{"id": 236, "url": "https://www.novelhall.com/the-lucky-star-blessing-the-whole-village-32483/14344327.html", "title": "Chapter 236 - Chapter 236: Chapter 236: (Second Update)", "volume": 3, "volume_title": "Volume 3", "body": "<h1>Chapter 236 - Chapter 236: Chapter 236: (Second Update)</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 236: Chapter 236: (Second Update)<br/><br/>Translator: 549690339<br/><br/>Xiao Jinli arrived and, after taking Grandpa Yuan’s pulse, smiled and said, “Not bad, his recovery is better than I expected. Maybe Grandpa Yuan doesn’t even need twenty days.”<br/><br/>She forgot that the physical quality of people in this era is not as strong as in future generations, and the cancer cells are not as stubborn either.<br/><br/>Another prescription, naturally, yielded even better treatment results.<br/><br/>Upon hearing this, Old Yuan was very excited and said, “Really, girl? Then I don’t have to take medicine anymore, right?”<br/><br/>This traditional Chinese medicine treatment method, which does not require surgery, can be quite bitter.<br/><br/>Old Chen laughed at him, “Haha, you’re not afraid of gunfire on the battlefield, but you’re afraid of taking medicine? Old Yuan, you’re really getting more and more backward.”<br/><br/>Old Yuan snorted, “So what if I’m afraid of taking medicine? Don’t think I don’t know that when you take medicine, your granddaughter has to coax you with sugar!”<br/><br/>“Pfft!” Gao Yanxin couldn’t help but laugh out loud.<br/><br/>When he came to his senses, he looked at Old Chen with curious and embarrassed eyes and tried very hard not to laugh.<br/><br/>Old Chen,  with a dark face.<br/><br/>He just wanted to enjoy the fun of being pampered by his granddaughter and let her coax him, but Old Yuan happened to see it, and so the rumor spread that he was afraid of taking medicine.<br/><br/>Old Chen explained irritably, “I’m not afraid of taking bitter medicine; I just want my granddaughter to accompany me. What’s wrong with that?”<br/><br/>At this point, he realized and laughed, “Oh, I see, you’re jealous that I have a granddaughter, and you don’t, right?”<br/><br/>Old Yuan,<br/><br/>He has three sons and five grandsons but indeed no granddaughter.<br/><br/>Old Yuan retorted, “I have a great-granddaughter!”<br/><br/>“Hehe, you do have a great-granddaughter, but how old is she?” Old Chen scoffed, “She’s not even one year old. Can she coax you to take medicine?”<br/><br/>Old Yuan said unwillingly, “Won’t my great-granddaughter grow up? Humph, now that I have a great-granddaughter, I don’t envy you having a granddaughter. Your granddaughter is not as cute as my great-granddaughter now.”<br/><br/>“How is my Nannan not as cute as your great-granddaughter?” Old Chen said unconvinced, “My Nannan can chat with me and buy me gifts now. Can your great-granddaughter do that?”<br/><br/>“You  ” Old Yuan wanted to refute, but Old Jiang interrupted him.<br/><br/>Old Jiang waved his hand and said, “Alright, you two old guys, what’s the point of arguing here? Is it childish or not? What’s the point of comparing granddaughters and great-granddaughters? If you want to compare, compare grandchildren  ”<br/><br/>“Shut up!”<br/><br/>Old Yuan and Old Chen said in unison, “You’re just jealous that our families have granddaughters and great-granddaughters. You have nine grandsons but not a single granddaughter, and you’re always envious of my Nannan!”<br/><br/>Old Jiang looked at the two old guys united in a common hatred and caught Xiao Jinli’s eyes as she watched the drama unfold. Suddenly an idea came to him, and he quickly pulled Xiao Jinli to his side, loudly defending himself, “Who says I don’t have a granddaughter? Little Li here is my granddaughter!”<br/><br/>Old Chen, Old Yuan, and Old Li,<br/><br/>Gao Yanxin,  When did his cousin become Elder Jiang’s granddaughter?<br/><br/>Xiao Jinli,  She didn’t expect that she, watching the play, would become the protagonist.<br/><br/>Old Li reacted first, pulling Xiao Jinli to his side and shouting, “No way, Xiao Jinli is my granddaughter.”<br/><br/>Old Jiang snorted coldly, “Old Li, you already have two granddaughters. Why are you fighting with me over a granddaughter? If you want a granddaughter, ask Xiao Jing to bring her two daughters over to accompany you.”<br/><br/>As he said this, he pulled Xiao Jinli back and said, “All of you with granddaughters, great-granddaughters, and granddaughters-in-law, don’t fight with me. I just want Little Li to be my granddaughter.”<br/><br/>At this point, Gao Yanxin looked at Xiao Jinli, then carefully glanced at Elder Jiang, and mustered the courage to say, “Grandpa Jiang, my cousin already has her own grandparents. They love her very much.”<br/><br/>He didn’t want to come to the capital and turn Xiao Jinli into someone else’s granddaughter.<br/><br/>If that happened, when he returned to Xiao Family Village, Grandma Xiao and Grandpa Xiao would definitely beat him.<br/><br/>Upon hearing Gao Yanxin’s words, Elder Jiang frowned and then said with a smile, “Girl, I want to recognize you as my adoptive granddaughter; do you agree?”<br/><br/>“Adoptive granddaughter?” Gao Yanxin was a bit stunned and asked, “Is that allowed?”<br/><br/>He looked at Xiao Jinli.<br/><br/>“Adoptive granddaughter, why not?” Old Chen said with a smile, “Girl, Old Jiang doesn’t have any granddaughters, granddaughters-in-law, or the like. He has five sons and nine grandsons. What he wants most now is a granddaughter to love.”<br/><br/>Before, he had long coveted Chen’s granddaughter. Once, Old Jiang took advantage of Chen’s inattention and took his granddaughter to his house. You don’t know how anxious Chen was that time; he almost developed a heart attack.”<br/><br/>Knowing that his granddaughter had been taken away by Old Jiang, he took a weapon and stormed to Jiang’s house, almost starting a life-and-death fight with Old Jiang.<br/><br/>Old Jiang was very dissatisfied and said, “I only took Yuanyuan away once, and you almost killed me.”<br/><br/>“Don’t you know that Nannan is my life?” Old Chen had no qualms about refuting.<br/><br/>Old Yuan, afraid that Old Jiang would steal his only great-granddaughter, said immediately, “Girl, just satisfy Old Jiang’s desire for a granddaughter.<br/><br/>You can rest assured that your Grandpa Jiang will definitely spoil you as if you were his biological granddaughter. His family has five sons and nine grandsons, and they will all treat you as their own daughter and sister.”<br/><br/>Everyone was trying to persuade Xiao Jinli to agree.<br/><br/>Xiao Jinli,  They didn’t even let her speak. How would they know if she agrees or not?<br/><br/>After everyone had their say, Old Li came back to his senses first.<br/><br/>“Ahem  ” Old Li said, “Let’s hear what the girl has to say. Girl, what’s your opinion? Will you agree to be Old Jiang’s adoptive granddaughter?”<br/><br/>Xiao Jinli thought for a while and said, “Grandpa Jiang, is it appropriate for me to be your adoptive granddaughter? I’m just a girl from the countryside.”<br/><br/>“What’s wrong with being a country girl?” Old Jiang immediately said, “You’re beautiful and cute, smart and clever. Which part of you is worse than a city girl? Besides, just by the skill of your medical skills, you can beat everyone else. Humph, I’ll see who dares to look down on you!”<br/><br/>At this point, he asked again, “Girl, do you still have any concerns? Are you worried that your parents won’t agree, or that your grandparents won’t agree? Should I talk to your family?”<br/><br/>After all, he was trying to steal someone’s granddaughter, so he was a bit guilty.<br/><br/>Xiao Jinli shook her head and said with a smile, “Grandpa Jiang, as long as I’m willing, my family won’t disagree.”<br/><br/>“Oh, then do you have any other concerns?” Old Jiang asked doubtfully, “Don’t worry, I’ll definitely treat you as my own granddaughter from now on. Whatever other people’s granddaughters have, you’ll definitely have.”\t\t\t\t\t\t</div>", "images": {}, "success": true}