{"id": 231, "url": "https://www.novelhall.com/the-lucky-star-blessing-the-whole-village-32483/14344319.html", "title": "Chapter 231 - Chapter 231: Chapter 231: (First Update)", "volume": 3, "volume_title": "Volume 3", "body": "<h1>Chapter 231 - Chapter 231: Chapter 231: (First Update)</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 231: Chapter 231: (First Update)<br/><br/>Translator: 549690339<br/><br/>Xiao Jinli and Doctor Jin communicated effortlessly with each other, young and old, while the others looked at them with puzzled expressions.<br/><br/>Unconsciously, an hour had passed.<br/><br/>Little Zhang came over and said, “Doctor Xiao, an hour has passed!”<br/><br/>Now, Little Zhang admires Xiao Jinli very much.<br/><br/>He used to judge her by her age and thought she was just lucky, but now it’s different.<br/><br/>Didn’t you see Doctor Jin, who is praised as a “Divine Doctor,” humbly asking her for advice?<br/><br/>Therefore, he firmly believes that Xiao Jinli can cure the Old Master’s illness.<br/><br/>Xiao Jinli and her party entered the room, and Old Master Yuan was sound asleep, “huhu.” He didn’t even notice their arrival.<br/><br/>Old Chen said, “Old Yuan hasn’t slept well since he found out he had a brain disease.”<br/><br/>“Yes, he couldn’t sleep well before because of his old injuries. Now he can’t sleep well simply because he’s uneasy,” sighed Old Li. “No matter how much we try to comfort him, it’s useless!”<br/><br/>Although they are getting old and holding an optimistic attitude to live one more day, who doesn’t want to live another day and live well?<br/><br/>“Girl, should we wake him up?” Grandpa Jiang asked.<br/><br/>“No need!” Xiao Jinli shook her head and said, “Let Grandpa Yuan continue to sleep. Just remove the needles.”<br/><br/>Having said that, Xiao Jinli quickly removed the needles.<br/><br/>In this process, Old Master Yuan did not wake up.<br/><br/>After the needles were removed, Xiao Jinli instructed Little Zhang, “When Grandpa Yuan wakes up, make him a pot of Camellia Tea. After drinking the tea, he will probably need to use the toilet a few more times.”<br/><br/>Little Zhang nodded and said, “Okay, I got it. Thank you, Doctor Xiao!”<br/><br/>Old Chen asked, not understanding, “Girl, why let Old Yuan drink the tea again and go to the toilet more? Didn’t you say that only the first time drinking would cause this reaction?”<br/><br/>Xiao Jinli smiled and said, “I just applied acupuncture to Grandpa Yuan, which consumed the toxins in his body. The camellia tea can detoxify.”<br/><br/>Old Chen and a few others already knew that the tea could detoxify, so they didn’t ask further.<br/><br/>Afterward, Old Chen looked at the snoring Old Yuan and laughed, “Haha, Old Yuan will be able to sleep well from now on.”<br/><br/>Whose patient, like him, gets treated in their sleep?<br/><br/>Doctor Jin’s conservative treatment may not be very painful, but Old Yuan couldn’t bear the emotional burden. As a result, the Seven Color Tea Flower in his room was of little use, and he couldn’t sleep tossing and turning.<br/><br/>“Little Li,” Doctor Jin, who had become close friends with Xiao Jinli, asked, “How many acupuncture sessions does Old Yuan need for this disease?”<br/><br/>“Three!” said Xiao Jinli. “The second one is in three days, and the third one is in seven days.”<br/><br/>“Only three?” Jin Xiangxue found it incredible. “Such a big illness can be cured with just three acupuncture sessions?”<br/><br/>Xiao Jinli glanced at him indifferently, “Grandpa Yuan’s condition is in its early stages, and three sessions of acupuncture are enough! Starting tomorrow, he will need to take a medicinal bath for three consecutive days! If his body recovers well, in twenty days, Grandpa Yuan’s body will be healthy again!”<br/><br/>“Huh, so soon?” Jin Xiangxue asked in surprise, “Will it relapse later?”<br/><br/>For Western medicine treatments, surgeries are prone to relapse!<br/><br/>Xiao Jinli almost gave him a burst of chestnut, but held back, considering that it was because of their new friendship.<br/><br/>However, Doctor Jin directly knocked on his head and scolded him,<br/><br/>“Where did your National Medical Arts go? Do you think, like Western medicine, surgery will cure it?<br/><br/>Hmph, Western medicine treats symptoms but not the root cause!<br/><br/>But our Traditional Chinese Medicine treats both symptoms and root causes! Xiao Xiaoyou said it will be cured, which means that the cancer cells in Old Yuan’s body will be eradicated and uprooted. There won’t be any recurrence!”<br/><br/>At this point, Doctor Jin sighed,<br/><br/>“Western Medical Arts rely on various instruments to diagnose and prescribe medication based on the symptoms, but many diseases only show surface symptoms and do not find the root cause.<br/><br/>Nowadays, people prefer the fast-acting treatment of Western medicine.<br/><br/>As for Traditional Chinese Medicine, reading a medical book is so profound and difficult to understand, and learning to take the pulse and diagnose the symptoms and conditions requires patience, which is hard for many people to continue learning.<br/><br/>Most importantly, the diagnosis and treatment method of Traditional Chinese Medicine is to find the root cause of the condition and then adjust the medication accordingly afterward, which makes the recovery slower, and many patients don’t have the patience for it.<br/><br/>In fact, people’s preference for Western medicine is because Chinese medicine is questioned, and many people don’t believe in Chinese medicine.”<br/><br/>When he said this, his eyes were dim, and he looked lonely as if he saw the decline of national medical arts.<br/><br/>Hearing Doctor Jin’s words, Xiao Jinli felt the same way.<br/><br/>Especially since her soul has traveled from 400 years later, she has a deep understanding of it.<br/><br/>At that time, the art of Traditional Chinese Medicine was almost at a dead end.<br/><br/>The inheritance of Traditional Chinese Medical Arts was extremely rare and hard to come by.<br/><br/>However, the development of technology at that time created various machines to treat human illnesses and invented various medicines.<br/><br/>At the same time, human beings’ physical quality became very strong, even catching a cold was very rare, almost non-existent.<br/><br/>Most of the diseases, caused by weapons’ external injuries, could be cured by taking a few recovery pills.<br/><br/>Therefore, the art of Traditional Chinese Medicine seemed to have no place to showcase its abilities.<br/><br/>Her inheritance of Traditional Chinese Medical Arts came from an accidental encounter.<br/><br/>Her master was a descendant of a thousand-year-old Chinese medicine family.<br/><br/>Even in that era when no one needed Chinese medicine, he didn’t want to lose the heritage passed down from his ancestors.<br/><br/>However, his descendants were unwilling to inherit it. In his loneliness, he traveled around and accidentally saved Xiao Wushuang, who was being hunted down.<br/><br/>At that time, her internal organs seemed to have been misplaced, causing excruciating pain. She was vomiting blood and had no medicine on hand. She laid there in a dark alley with no strength at all, waiting for death.<br/><br/>Her master, with his Traditional Chinese Medical Arts, gave her a pill to stop the bleeding and applied his superb acupuncture skills, putting a few needles into her body. The pain in her body subsided, her mouth stopped bleeding, and her strength gradually returned.<br/><br/>At that moment, she realized the magic of Chinese medicine and wanted to learn it.<br/><br/>Seeing her talent, her master taught her everything without reservation.<br/><br/>After learning Traditional Chinese Medicine, she also treated several important patients.<br/><br/>However, there were few patients who needed Traditional Chinese Medicine treatment, so Xiao Wushuang didn’t use it in ordinary situations.<br/><br/>Xiao Jinli thought about it and suddenly had an idea in her mind.<br/><br/>However, the implementation of this idea was somewhat difficult.<br/><br/>First, she was too young.<br/><br/>Second, she had no connections. Even if she had met Old Chen and the other old gentlemen, it was not enough to support her idea.<br/><br/>Third, she lacked adequate funds.<br/><br/>Xiao Jinli thought for a moment and believed she could talk to the old gentlemen about it.\t\t\t\t\t\t</div>", "images": {}, "success": true}