{"id": 234, "url": "https://www.novelhall.com/the-lucky-star-blessing-the-whole-village-32483/14344324.html", "title": "Chapter 234 - Chapter 234: Chapter 234: (Second Update)", "volume": 3, "volume_title": "Volume 3", "body": "<h1>Chapter 234 - Chapter 234: Chapter 234: (Second Update)</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 234: Chapter 234: (Second Update)<br/><br/>Translator: 549690339<br/><br/>Old Yuan went to Licheng for a trip and came back diagnosed with brain cancer. Such news could not be hidden from the other residents of the nursing home.<br/><br/>At first, many people felt sympathy and pity for Old Yuan, who was so old and had such a serious disease.<br/><br/>But fortunately, it was an early stage, and Western medicine could treat it, and Doctor Jin could control the condition. As long as one takes good care of themselves, there is still some hope for a good outcome.<br/><br/>However, no one can really say when it comes to illness.<br/><br/>Maybe, without being careful, the condition could develop in an uncontrollable direction.<br/><br/>This was really more unpredictable than when they were fighting on the battlefield against enemies.<br/><br/>Two years ago, there was an old cadre in the nursing home who was diagnosed with gastric cancer. Western and traditional Chinese medicine, both were treated by Doctor Jin, and the condition was well controlled.<br/><br/>Who would have thought that in less than half a year, the condition would rapidly worsen?<br/><br/>The disease suddenly entered its late stage.<br/><br/>At that stage, the illness was very painful, and everyone at the nursing home could hear it.<br/><br/>At that time, everyone could only comfort him, but there was no solution.<br/><br/>In the end, the old man couldn’t bear it anymore and shot himself to death.<br/><br/>This ending made the whole courtyard feel silent and bleak.<br/><br/>Who would have thought that someone who had made great achievements on the battlefield when they were young would end up being tormented and suffering from such a vicious disease? It’s really a sigh.<br/><br/>Therefore, the old cadres in the nursing home paid special attention to their health. They consumed various high-end health supplements in piles. If anything felt uncomfortable, they would let the doctor check it, and any problems were treated early.<br/><br/>After hearing that Old Yuan had a brain disease, one wave after another of visitors came to see him.<br/><br/>Although they said it was a good thing that the illness was discovered early and that current technology was so advanced that such early-stage diseases could be treated well, their eyes still revealed sympathy and pity.<br/><br/>Old Master Yuan couldn’t stand the expression of these people, so he closed the door and did not accept any guests.<br/><br/>Everyone just assumed that Old Master Yuan was in a bad mood and didn’t take it to heart.<br/><br/>However, everyone knew that Old Master Yuan refused Western medicine and surgery, only accepting Doctor Jin’s traditional Chinese medicine conservative treatment.<br/><br/>Of course, when it came to letting Xiao Jinli, a young child, treat his illness, other than his close friends Old Chen, Old Li, and Grandpa Jiang, only the Yuan family knew.<br/><br/>Yuan Tianlin sent his grandfather back to the nursing home with an excited and restless heart, then rushed home to tell the good news to his family.<br/><br/>As for why he didn’t notify them by phone, well, it just didn’t have the same atmosphere.<br/><br/>Yuan Family<br/><br/>“Tianlin, you said that the tumor in the old man’s brain has gotten smaller, and the activity level of the cancer cells has also decreased?”<br/><br/>Yuan Jianguo, the eldest son of the Yuan family and Old Master Yuan’s eldest son, looked very surprised after listening to his youngest son’s words.<br/><br/>“Yes, that’s what Doctor Guo said. He meant that as long as this treatment effect is maintained, Grandfather’s illness can be completely cured.” Yuan Tianlin explained truthfully, “Uncle, Doctor Guo thought it was Doctor Jin who treated Grandfather. When I told him it wasn’t, he asked me to introduce the doctor who treated Grandfather. I didn’t agree to it for now.”<br/><br/>Yuan Jianguo calmed down his excitement and nodded, saying, “It’s good that you didn’t agree.”<br/><br/>At this point, he sighed and said, “It really is true that one mountain is higher than the other. Who would have thought that a child of such a young age would have a medical skill higher than that of Doctor Jin, the number one expert in the national medical field? I heard that Elder Chen, Elder Li, and Elder Jiang’s health has been improving under the care of that child. Especially Grandpa Jiang, since the bullet in his body was removed, he walks as if he’s flying, full of energy and flushed with health.”<br/><br/>“Yes, yes, it’s clear to anyone that the health of the three elders is much better than before.”<br/><br/>Yuan Jianming, the second uncle of the Yuan family, chimed in.<br/><br/>“I heard that they met the child at the flower show held in Licheng some time ago. Speaking of which, I admire Grandpa Jiang’s courage the most. He let the child operate on him as soon as he learned he could move the bullet inside his body. Ordinary people wouldn’t dare to do that. What if something unexpected happened? The consequences would be unthinkable.”<br/><br/>Yuan Jianshe, the third of the Yuan family, and Yuan Tianlin’s father, said, “The main thing is that the child’s age is very deceptive. At her age, she should be in elementary school. Who could have thought that a child in their teens would have such amazing medical skills?”<br/><br/>Yuan Jianguo laughed, “We don’t need to worry about whether she is a child or not. As long as she can treat our family’s old master, she is our benefactor. However,”<br/><br/>At this point, he warned the family members present with a serious expression, “Without that child’s permission, we absolutely must not leak any information. Otherwise, if it causes trouble for the child, don’t blame me for being rude.”<br/><br/>“Yes, we all know that.”<br/><br/>“We absolutely cannot be ungrateful.”<br/><br/>A good doctor is very important to any family.<br/><br/>Who can guarantee that they will never get sick? Minor illnesses and pains are not a big deal, but what if one day a serious illness develops? Just like their old master, the doctors of both Western and traditional Chinese medicine failed to detect his brain disease in a timely manner.<br/><br/>But a child could just feel his pulse and discover the problem.<br/><br/>The earlier the illness is discovered, the greater the hope for a cure.<br/><br/>More than ten days later,<br/><br/>Xiao Jinli performed the second acupuncture session for Old Yuan.<br/><br/>After withdrawing the needles, Old Master Yuan got up from the bed and laughed, “This time the acupuncture, I feel very relaxed and comfortable!”<br/><br/>Old Chen laughed from the side and said, “All the impurities, toxins, and cancer cells in your body have been expelled. Of course, you feel relaxed.”<br/><br/>Grandpa Jiang said, “Old Yuan, I can see you’re getting younger and younger now. Before Little Li came, your state was very worrying. Now, we are completely at ease.”<br/><br/>Old Li said, “Old Yuan, do you still need that Seven Color Tea Flower at night? I’ll borrow it and put it in my room for a few days.”<br/><br/>As he said this, he also looked at Xiao Jinli. As long as she said it was not needed, he would move it away.<br/><br/>Xia Jinli said, “Well, that flower helps with sleep. Does Grandpa Yuan sleep well now?”<br/><br/>She threw the question back to Grandpa Yuan.<br/><br/>Old Master Yuan, with an excited expression, said, “No, I still need that flower. I still don’t sleep well at night!”<br/><br/>Everyone,  At night, even with a distance of ten miles, one could hear your snoring. And you still say you don’t sleep well?<br/><br/>The other people in the nursing home saw that Old Master Yuan’s spirit and condition were getting better and better, looking less like a patient, and they began to feel doubtful.<br/><br/>Could it be that Old Yuan was experiencing a brief recovery before death?<br/><br/>But looking at the people around Old Yuan, especially his family members, there was no sign of sadness. On the contrary, everyone seemed very happy.<br/><br/>What’s going on?\t\t\t\t\t\t</div>", "images": {}, "success": true}