{"id": 233, "url": "https://www.novelhall.com/the-lucky-star-blessing-the-whole-village-32483/14344322.html", "title": "Chapter 233 - Chapter 233: Chapter 233: (First Update)", "volume": 3, "volume_title": "Volume 3", "body": "<h1>Chapter 233 - Chapter 233: Chapter 233: (First Update)</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 233: Chapter 233: (First Update)<br/><br/>Translator: 549690339<br/><br/>Xiao Jinli’s treatment of Old Master Yuan became known.<br/><br/>Old Master Yuan’s descendants initially did not believe that a child could possess such outstanding medical skills, and they were not entirely at ease.<br/><br/>They still leaned heavily toward Western medicine treatments.<br/><br/>However, Old Master Yuan was adamant about receiving treatment from a child, and they had no choice.<br/><br/>Now that even Doctor Jin was assisting the child, they had nothing more to say.<br/><br/>After three days of treatment, the anxious Yuan family members took Old Master Yuan to the hospital for an examination.<br/><br/>The examination result shocked the chief attending physician.<br/><br/>“This   this is incredible. The tumor in Old Master’s head has noticeably shrunk, and the activity of the cancer cells has significantly decreased. How did Doctor Jin treat it?<br/><br/>If this treatment method were applied to other patients, it could definitely alleviate a lot of suffering.”<br/><br/>Doctor Guo said excitedly, “Is this the wonder of Traditional Chinese Medical Arts? No surgery or chemotherapy, yet the cancer cells disappear. It’s truly amazing.”<br/><br/>“Doctor Guo, do you mean that the tumor in my grandfather’s head is shrinking and moving in a positive direction?” Yuan Tianlin asked incredulously, “Is there any mistake in the examination?”<br/><br/>Doctor Guo replied earnestly, “No. Let me tell you, this is already the third examination result. I also doubted the previous two.<br/><br/>What surprised me was not that Old Master’s head tumor had shrunk, or that the activity of the cancer cells had decreased, but that this effect occurred in just three days.<br/><br/>Three days ago, Old Master’s tumor was only under control, not spreading. But three days later, the tumor had shrunk. This is truly a medical miracle.”<br/><br/>Upon hearing Doctor Guo’s words, Yuan Tianlin was shocked.<br/><br/>Previously, he had been the most opposed to entrusting Old Master Yuan’s condition to a child for treatment.<br/><br/>Doctor Jin is the top National Doctor in the country, known as the number one in the National Medical Field, and was brought in by the country for the Old Master. They trusted him.<br/><br/>However, even Doctor Jin could only conservatively treat Old Master Yuan’s condition, preventing it from worsening.<br/><br/>Therefore, the best treatment plan was for Western medicine to perform surgery and remove the tumor.<br/><br/>The family members leaned towards a combination of Traditional Chinese Medicine and Western medicine.<br/><br/>But who could believe a child who unashamedly claimed that she could treat the condition?<br/><br/>Even with Doctor Jin’s guarantee, the Yuan Family members still felt uneasy.<br/><br/>No wonder they brought Old Master Yuan to the hospital for an examination, fearing that he would develop other problems due to the treatment.<br/><br/>As a result, even the doctor was shocked by the examination results.<br/><br/>After composing himself, Yuan Tianlin asked anxiously, “Doctor Guo, with the tumor shrinking and the activity of the cancer cells decreasing, does it mean that if we continue this treatment, it might completely eradicate the cancer cells?”<br/><br/>“Of course!” Doctor Guo replied, “It has only been three days of treatment, and there is already such an effect. If the treatment continues, Old Master’s condition can be completely cured.”<br/><br/>At this point, Doctor Guo asked curiously, “Young Master Yuan, didn’t Doctor Jin say that he could only provide conservative treatment for Old Master and control the condition? Has he changed to another treatment plan now?”<br/><br/>“No, no  ” Yuan Tianlin said excitedly and happily, “Someone else is treating him, not Doctor Jin. Doctor Jin is assisting that person.”<br/><br/>Upon hearing this, Doctor Guo’s face showed utter astonishment and disbelief.<br/><br/>After a moment, he asked, “If it’s not Doctor Jin treating Old Master, then who is treating him? Who in the National Medical Field has more advanced Traditional Chinese Medical Arts than Doctor Jin?”<br/><br/>Yuan Tianlin calmed down and shook his head, “I’m sorry, Doctor Guo, I cannot tell you without her permission.”<br/><br/>Doctor Guo said with a smile, “Could Young Master Yuan possibly put in a recommendation for me? I would like to visit the Divine Doctor. After all, her treatment method might be suitable for all cancer patients.”<br/><br/>Yuan Tianlin nodded and said, “Doctor Guo, let me ask for you first, and if she agrees.”<br/><br/>“Thank you, Young Master Yuan!” said Doctor Guo with a smile.<br/><br/>When Yuan Tianlin returned to the ward, Old Master Yuan was lying in bed, insisting on going back home.<br/><br/>“I want to go back. I don’t feel comfortable here.”<br/><br/>Xiao Zhang helplessly said, “Old Master, please bear with it. When Young Master returns from the doctor’s, we will go back.”<br/><br/>Old Master Yuan complained, “I have already told them, I feel fine now. I have been eating well and sleeping soundly these days, and there is nothing wrong with me at all. They are simply worrying for nothing. Hmph, I think they don’t want me to get better, so they brought me to the hospital.”<br/><br/>Upon entering the ward and hearing the Old Master’s words, Yuan Tianlin said wearily, “Grandfather, we all want you to be healthy and live a long life. How could we not want your health to improve? You saying that is really hurtful for your grandson.”<br/><br/>“Hmph, you brat,” Old Master Yuan said coldly, “I feel uncomfortable as soon as I come to this hospital, and when I feel uncomfortable, I feel as if I am going to fall sick. Doesn’t that mean that you all don’t want me to get better?”<br/><br/>Yuan Tianlin had no choice but to apologize and coax him, “Yes, yes, it’s our fault. Old Master, we can return home now. Once back home, you can relax in any way you like, not come to the hospital again, how about that?”<br/><br/>Hearing this, Xiao Zhang’s eyes lit up.<br/><br/>This meant Old Master Yuan’s condition was improving, and there might even be a possibility of complete recovery.<br/><br/>Otherwise, the usually protective Yuan Tianlin would not have said such words.<br/><br/>“Really?” Old Master Yuan asked skeptically, “After this, I will never have to come to this stinky hospital again?”<br/><br/>“Of course it’s true.” Yuan Tianlin assured, “As true as gold! Old Master, let’s go back to the Nursing Home now. After we return, you can enjoy tea and chat with Grandpa Chen and the others, and have a good time.”<br/><br/>Just about to step out, Old Master Yuan suddenly raised his hand and said, “Wait, what did you mean by that? Your words sound very inappropriate. Are you implying that I don’t have much time left? So, you want me to enjoy the last days?”<br/><br/>Yuan Tianlin’s face changed instantly, and he quickly explained, “Grandfather, you misunderstood. Doctor Guo said that your body is gradually recovering, and your illness can be completely cured and healed. So, in the future, you will be a healthy elderly person.”<br/><br/>Xiao Zhang,<br/><br/>He was startled.<br/><br/>What Yuan Tianlin just said had sounded like what doctors would tell patients who didn’t have much time left.<br/><br/>He had thought Old Master’s condition was deteriorating.<br/><br/>Old Master Yuan’s expression softened, and he scolded, “My days, of course, I can enjoy them however I want. Who are you to teach me? Hmph, I want to go home, I still want to drink my camellia tea.”<br/><br/>“Old Master, please!” Yuan Tianlin dutifully attended to his needs.\t\t\t\t\t\t</div>", "images": {}, "success": true}