{"id": 230, "url": "https://www.novelhall.com/the-lucky-star-blessing-the-whole-village-32483/14344317.html", "title": "Chapter 230 - Chapter 230: Chapter 230: (Second Update)", "volume": 3, "volume_title": "Volume 3", "body": "<h1>Chapter 230 - Chapter 230: Chapter 230: (Second Update)</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 230: Chapter 230: (Second Update)<br/><br/>Translator: 549690339<br/><br/>As Xiao Jinli started administering the acupuncture treatment on Old Master Yuan, the usually proud Jin Xiangxue couldn’t believe his eyes.<br/><br/>He could scarcely believe what he was seeing. During the needle insertion process, Jinli’s movements were swift and accurate, much like those martial arts experts on television who unveil secret weapons with a mere wave of their hands.<br/><br/>With a single wave, at least three silver needles were dispatched. At most, she let nine silver needles fly.<br/><br/>Of course, the bystanders could not determine if this was her limit.<br/><br/>Even ‘divine doctor’ Doctor Jin, who had spent seventy years in medicine, could hardly believe what he had seen, let alone Jin Xiangxue.<br/><br/>Doctor Jin himself also used acupuncture therapy on patients.<br/><br/>His method was accurate and swift. However, he would place each needle separately onto the appropriate points of a patient, rather than flicking his wrist to allow the needles to find their target.<br/><br/>This is not a typical doctor’s behaviour, this is clearly the mastery of a martial arts expert.<br/><br/>Jin Xiangxue’s eyes widened at the sight.<br/><br/>Suddenly, Doctor Jin’s eyes became brighter with each needle that Xiao Jinli inserted, even the color of his ecstasy was clear.<br/><br/>He had an epiphany, “So that’s how it’s done. I knew I was missing something. That’s why I could only control Yuan’s condition, but I never realized it was because of this acupuncture point.”<br/><br/>Xiao Jinli replied, “Yes, these two acupuncture points share the same name, but their relative distances from certain organs are different. The results produced by acupuncture in these two points can greatly vary. Doctor Jin, have you never tried this before?”<br/><br/>Doctor Jin shook his head and smiled bitterly, “I’ve considered trying it, but once cancer strikes, it quickly progresses to the late stage. Even if we use acupuncture then, it won’t significantly help. Yuan’s disease was detected early, but he’s old. I dare not experiment with him carelessly.”<br/><br/>Jin Xiangxue, who was a bit confused by their conversation, asked, “Grandpa, what is this acupuncture technique? Also, which are the two acupuncture points that have the same name?”<br/><br/>Even Jin Xiangxue, who is well versed in medicine, didn’t understand. Thus, outsiders like Old Chen understood even less.<br/><br/>However, they knew that Xiao Jinli’s method was superior to Doctor Jin’s.<br/><br/>Rather than answering his grandson directly, Doctor Jin asked humbly, “Is this the Nine Yang Thirteen Acupuncture technique?”<br/><br/>Xiao Jinli’s eyes lit up and she nodded, “Yes, this is the Nine Yang Thirteen Acupuncture technique! Doctor Jin, did you know?”<br/><br/>Doctor Jin expressed astonishment. “I’ve seen it mentioned in an ancient medical book, ‘Discussion on Complicated Medical Cases’. This technique is said to be capable of bringing people back from the brink of death. I’ve researched this kind of acupuncture before, but I’ve never grasped its true essence and didn’t dare to practice it. Now, witnessing you perform this technique, I finally understand its principles. The so-called ‘reviving the dead’ refers to treating difficult diseases instead of literally bringing the dead back from hell.”<br/><br/>Xiao Jinli replied, “If Doctor Jin wants to learn, I can teach you.”<br/><br/>Doctor Jin looked surprised, then shook his head and asked, “Isn’t it unacceptable? This technique was passed down by your master. I can’t just casually learn it from you.”<br/><br/>Xiao Jinli shook her head and replied, “The duty of a medical professional is to save lives and aid the injured. My master taught me medical skills so I can save lives. If more patients can benefit from it, he would also rest in peace.”<br/><br/>“If that’s the case,” Doctor Jin respectfully bowed to Xiao Jinli. “Doctor Xiao, please enlighten me!”<br/><br/>Jin Xiangxue and the others,<br/><br/>Xiao Jinli turned to Old Yuan, “Grandpa Yuan, you can rest with your eyes closed. The effect of the acupuncture will take an hour. Call me immediately if you feel uncomfortable.”<br/><br/>Although the technique was under control, there was always a chance of something unexpected occurring.<br/><br/>During acupuncture, the appearance of sequelae could be possible.<br/><br/>Old Master Yuan chuckled contentedly, “Okay, I haven’t slept well for the past few days. Now I can take a good rest. Go enjoy some tea.”<br/><br/>With that, he seemed to remember something and asked, “Oh, by the way, I’ve been drinking that seven-color tea flower you gave me for a few days now. Should I go on drinking it?”<br/><br/>Xiao Jinli nodded, “Yes. Except for the first time, where consuming tea flowers detoxifies the body and leads to frequent toilet visits, drinking it at other times can nourish the body.”<br/><br/>Old Master Yuan nodded, “Okay, I’ll have a cup of tea flower tea then!”<br/><br/>Old Zhang, who was at Old Master Yuan’s side, then went to brew the tea.<br/><br/>Meanwhile, Old Chen and the others went to the living room for some tea and a chat.<br/><br/>They were lauding Jinli’s medical skills.<br/><br/>After hearing Doctor Jin speak of the “Nine Yang Thirteen Acupuncture,” a lost art that Jinli was using, they found it utterly astonishing.<br/><br/>“Girl, who exactly is your master? Has there been such a figure in the field of national medicine?” Old Chen asked out of curiosity.<br/><br/>Xiao Jinli shook her head, “Actually, I don’t know who he is. He only told me that his surname is Bian, and he’s a barefoot doctor.”<br/><br/>In her past life, Xiao Jinli’s national medicine master surnamed Bian was indeed a barefoot doctor.<br/><br/>A barefoot doctor who had chosen to remain anonymous.<br/><br/>“A barefoot doctor!” Grandpa Jiang exclaimed, “The truly skilled are indeed among the common folk.”<br/><br/>Doctor Jin pondered and then asked, “Does he carry the surname Bian, like the descendants of Bian Que? I remember the classical medical book ‘Discussion on Complicated Medical Cases’ that I read was compiled by the descendants of Bian Que based on their ancestors’ experience. Currently, there are no doctors with the surname Bian in the field of national medicine. Have they all decided to obscure their identities?”<br/><br/>Jin Xiangxue looked at his grandfather, then at Xiao Jinli. He opened his mouth but didn’t utter a word.<br/><br/>He found the whole scenario baffling.<br/><br/>Jinli’s acupuncture technique, her way of driving the needles into the acupuncture points with a flick, was something he, and even his grandfather, had never seen before.<br/><br/>Moreover, the user of this technique was an eleven-year-old child.<br/><br/>If he had doubts before, he was still skeptical now.<br/><br/>However, he was beginning to wonder if he was dreaming.<br/><br/>Upon hearing her master’s surname was Bian, he felt it made sense.<br/><br/>Even though there are not many doctors surnamed Bian in the field of national medicine, each one of them is a legend. It’s just that in recent years, the art was lost.<br/><br/>Xiao Jinli and Doctor Jin, sharing a similar passion, immediately started discussing various complex problems of national medicine. Others could not join the conversation. Even Jin Xiangxue, a national medicine student himself, couldn’t contribute to the conversation.<br/><br/>Although they were discussing national medicine, he couldn’t understand the topics they were discussing.<br/><br/>Just like a toddler trying to learn a foreign language.<br/><br/>“Ah, so the treatment for this disease substitutes a yang type drug with a cold type herb. These are clearly two medicines with conflicting properties, so why are they being used together?” Doctor Jin asked with confusion.<br/><br/>Xiao Jinli began to explain, “Because this medicine appears to  ”<br/><br/>“Ahh, I see!” An enlightened Doctor Jin exclaimed before she could finish explaining.\t\t\t\t\t\t</div>", "images": {}, "success": true}