{"id": 238, "url": "https://www.novelhall.com/the-lucky-star-blessing-the-whole-village-32483/14344331.html", "title": "Chapter 238 - Chapter 238: Chapter 238: (Second Update)", "volume": 3, "volume_title": "Volume 3", "body": "<h1>Chapter 238 - Chapter 238: Chapter 238: (Second Update)</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 238: Chapter 238: (Second Update)<br/><br/>Translator: 549690339<br/><br/>Elder Zeng was in doubt, but he came here today to seek medical treatment from Xiao Jinli.<br/><br/>“Elder Zeng, please extend your hand!” Xiao Jinli whispered, looking at the absent-minded Elder Zeng.<br/><br/>Elder Zeng came to his senses and asked, “Which hand?”<br/><br/>“Either hand is fine!” Xiao Jinli replied.<br/><br/>Elder Zeng stretched out his right hand.<br/><br/>Xiao Jinli took Elder Zeng’s pulse, but after a while, her frown deepened.<br/><br/>Seeing Xiao Jinli’s expression, experienced people like Old Chen became worried.<br/><br/>Could it be that Elder Zeng also has a serious illness?<br/><br/>After a moment, Xiao Jinli asked Elder Zeng to switch hands.<br/><br/>Similarly, Xiao Jinli’s frown remained deep.<br/><br/>As soon as Xiao Jinli let go, Old Chen couldn’t wait to ask, “Girl, is there a problem with Elder Zeng?”<br/><br/>Elder Zeng looked at Old Chen and the others with confusion, and seeing their serious expressions, he realized that something might be wrong with his health.<br/><br/>Elder Zeng said, “Child, just tell me, no matter what the result is, I can bear it!”<br/><br/>Xiao Jinli glanced at everyone in the room, sighed softly, and told the truth, “Elder Zeng, you have pancreatic cancer, and it has reached the late stage!”<br/><br/>“How is that possible?” Little Zhou, who had been taking care of Elder Zeng, said in disbelief, “The old master has a check-up every three months. It’s impossible! The last check-up was with Old Yuan, and it hasn’t been that long, just over a month. How could it be possible that in just over a month, his cancer has reached the late stage?”<br/><br/>Not to mention Little Zhou, everyone present found it hard to believe that Elder Zeng had contracted late-stage cancer.<br/><br/>This illness was even more severe than Old Yuan’s.<br/><br/>Old Yuan asked, “Old Zeng, have you recently had any new symptoms that you have ignored?”<br/><br/>Elder Zeng sighed lightly and said, “Recently, I’ve been feeling nauseous in my upper abdomen, but I thought it was just an upset stomach.”<br/><br/>Little Zhou asked in surprise, “Old Master, why didn’t you say anything when you were feeling unwell?” His expression was similar to that of Xiao Zhang.<br/><br/>Xiao Zhang had been taking care of Old Master Yuan, and he was responsible for taking care of Elder Zeng.<br/><br/>Therefore, they should be the most aware of any abnormalities in their health.<br/><br/>However, regrettably, the old masters had hidden it from them.<br/><br/>After some thought, Old Chen said, “Old Zeng, since the girl diagnosed you with pancreatic cancer, you should go to the hospital for a check-up first.”<br/><br/>Little Zhou immediately reacted and supported Elder Zeng, saying, “Yes, yes, Old Master, let’s go to the hospital for a check-up, shall we?”<br/><br/>He still couldn’t believe that Elder Zeng had contracted cancer, let alone reached the late stage.<br/><br/>He knew that Xiao Jinli was a skilled doctor; otherwise, she wouldn’t have discovered Old Master Yuan’s brain disease.<br/><br/>However, since Old Master Yuan’s brain cancer was in its early stage and the hospital and Doctor Jin hadn’t discovered it in time, it was understandable.<br/><br/>But now, their own Old Master had late-stage cancer. The development of cancer from early to late stage takes time.<br/><br/>During this process, they would have regular check-ups for the old masters. How could such a big hospital and highly skilled doctors fail to detect the Old Master’s illness?<br/><br/>Little Zhou did not believe that Elder Zeng had late-stage cancer, and just to be safe, he insisted on taking him to the hospital for a check-up.<br/><br/>Elder Zeng stared at Xiao Jinli for a moment and asked, “Girl, can you cure this disease?”<br/><br/>“Old Zeng!” Elder Jiang said with some dissatisfaction, “You should go to the hospital for a check-up first. If you really have this disease, see what treatment plan the hospital’s doctors can offer. My granddaughter is not a god, and it’s not possible for her to cure every disease!”<br/><br/>Late-stage cancer is like a death sentence.<br/><br/>Although Xiao Jinli has excellent medical skills, she cannot possibly cure late-stage cancer.<br/><br/>Therefore, Elder Jiang rejected the hope on behalf of Xiao Jinli in advance.<br/><br/>After hearing Elder Jiang’s words, Elder Zeng sighed lightly and said pessimistically, “Forget it, life and death are predetermined!”<br/><br/>If he were to go to the hospital and be diagnosed with late-stage cancer, he would be prepared to end his life early.<br/><br/>He didn’t want to suffer like Old Fang did at the end of his life.<br/><br/>As people age, they become more afraid of death, but if death is too painful, it’s better to end it early.<br/><br/>Little Zhou left with the slightly dispirited Elder Zeng.<br/><br/>The faces of Old Chen and the others showed pity.<br/><br/>“Ah, Old Zeng usually looks healthier than all of us, so how could he get such a disease?” Old Li sighed softly, “I don’t know how much longer he can hang on with late-stage cancer?”<br/><br/>Old Chen said, “I’m worried that Old Zeng will follow in Old Fang’s footsteps.” His eyes showed some sorrow when he said this.<br/><br/>“Old Fang was in too much pain in the later stages, so that’s why he committed suicide.” Elder Jiang said, looking sad.<br/><br/>Old Yuan said, “I hope the result is wrong.”<br/><br/>After saying this, he realized he was doubting Xiao Jinli and looked at her.<br/><br/>Xiao Jinli spread her hands and said, “I hope my diagnosis is wrong too. But based on his pulse, it’s highly likely that I’m right.”<br/><br/>Old Chen and the others,<br/><br/>Expressions of pity and sympathy appeared on their faces.<br/><br/>“Let’s just wait for his test results.” Elder Jiang said.<br/><br/>“Um  ” Xiao Jinli weakly spoke up, “Old Masters, have I ever said that this disease cannot be cured?”<br/><br/>“What?”<br/><br/>“Can you cure this disease?”<br/><br/>“This is late-stage cancer, you know? And it’s late-stage pancreatic cancer. I’ve heard that this disease progresses very rapidly.”<br/><br/>“Yeah, girl, can you really cure this disease?”<br/><br/>All four old masters were visibly excited.<br/><br/>Others in the room, including members of the Jiang family, were shocked.<br/><br/>Late-stage cancer can be cured?<br/><br/>Xiao Jinli nodded and said very seriously, “Yes, I can cure this disease.”<br/><br/>“To what extent can you cure this disease?” Old Master Yuan asked urgently, “Even if it can’t be cured completely, it’s good if the condition can be controlled and no longer progress!”<br/><br/>“Yes, girl, as long as you can control Old Zeng’s disease and not let him suffer so much in the late stage, that’s enough.” The others echoed.<br/><br/>Xiao Jinli shrugged her shoulders and said, “To what extent? Well, I guess complete recovery!”<br/><br/>“Haha, complete recovery?”<br/><br/>Everyone was shocked.<br/><br/>“Girl, what do you mean by complete recovery? Does it mean regaining health? Isn’t it just controlling the spread of cancer cells?” Elder Jiang asked excitedly.<br/><br/>Xiao Jinli said, “Yes, that’s right, regaining health!”<br/><br/>“Haha, that’s great. Then we don’t have to worry about Elder Zeng wanting to commit suicide after the test results come out.”<br/><br/>“Oh, right, call Elder Zeng quickly and tell him the good news. Let him come over after he finishes his examination and gets the results.”<br/><br/>“Yes, yes, call him quickly!”<br/><br/>So, the task of making the phone call was given to Elder Jiang.<br/><br/>Who would have thought that he is now Xiao Jinli’s adoptive grandfather?\t\t\t\t\t\t</div>", "images": {}, "success": true}