{"id": 235, "url": "https://www.novelhall.com/the-lucky-star-blessing-the-whole-village-32483/14344325.html", "title": "Chapter 235 - Chapter 235: Chapter 235: (First Update)", "volume": 3, "volume_title": "Volume 3", "body": "<h1>Chapter 235 - Chapter 235: Chapter 235: (First Update)</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 235: Chapter 235: (First Update)<br/><br/>Translator: 549690339<br/><br/>People in the nursing home began to probe Old Yuan.<br/><br/>“Old Yuan, I see that your health is getting better and better. Look at your energetic spirit and flush with health; you don’t look like a patient at all.”<br/><br/>Elder Zeng said with a smile, “Hehe, it’s good that you’ve come to terms with it. With medical technology so advanced now, your disease is in its early stage. Even if it is cancer, it is discovered early, and the cure rate is quite high.”<br/><br/>After hearing this, Old Yuan said unhappily, “Just say what you want to say directly, don’t beat around the bush. We aren’t that close.”<br/><br/>Elder Zeng laughed and said directly, “Alright then, I can’t keep anything from you, you old fox.”<br/><br/>“You’re also an old fox,” Old Yuan retorted without showing weakness. “A smiling tiger.”<br/><br/>Elder Zeng said, “Old Yuan, is your illness almost cured? Was it treated by Doctor Jin?”<br/><br/>Usually, people in the courtyard only saw Doctor Jin coming and going.<br/><br/>Doctor Jin was getting old, so after considering this issue, he wasn’t assigned too many patients.<br/><br/>However, when the other patients in the nursing home had undiagnosed conditions, they would ask Doctor Jin for help.<br/><br/>Old Yuan said, “No, Elder Zeng, what does it matter to you whether my illness was treated by Doctor Jin or not? If you have any headaches or fevers, you can ask Doctor Jin too. Don’t come to me with your sour grapes and probing tricks.”<br/><br/>Having his true intentions uncovered, Elder Zeng sighed lightly and said,<br/><br/>“Alright. I’ll just say it directly. You know, we old fellows have many lingering ailments left from our time on the battlefield. At night, we can’t sleep, and we don’t have much appetite.<br/><br/>Doctor Jin prescribed us a lot of medicines, but they didn’t work very well. They only controlled the pain a little. I could bear those, but recently I found that Doctor Jin’s medicines are not working well for me anymore.”<br/><br/>At this point, he looked at Old Yuan’s expression and continued, “I recently noticed that Old Chen, Old Li, and Old Jiang are getting better and better, just like you, all flush with health. I was just wondering if they took some health supplements?”<br/><br/>Old Yuan glared at him and unhappily said, “What health supplements? If those things worked, we wouldn’t have to wait until now to recover. Besides, any health supplements we have, you have a share too. Don’t you know if they are good or not?”<br/><br/>At this point, Old Yuan also sighed lightly, and said with some helplessness, “Forget it, I won’t hide it from you anymore. Our bodies have been conditioned by the doctor, and our lingering ailments are now recovering.”<br/><br/>Elder Zeng’s eyes lit up, and he asked excitedly, “Is it Doctor Jin? Then I’ll ask him to take a look at me too.”<br/><br/>As soon as he finished speaking, Old Yuan looked at Elder Zeng as if he was an idiot.<br/><br/>Elder Zeng asked suspiciously, “Did I say something wrong?”<br/><br/>Old Yuan said indifferently, “If it were Doctor Jin, everyone’s body wouldn’t recover just now!”<br/><br/>Elder Zeng asked, “What do you mean by that? It’s not Doctor Jin? But lately, only Doctor Jin has been coming and going at the nursing home, right?”<br/><br/>If it were another famous doctor, everyone should know.<br/><br/>Of course, no one would have thought that the child who was only a little over ten years old would be a highly skilled doctor.<br/><br/>“Oh, you all noticed Doctor Jin coming and going, did you?” Old Yuan nodded, “Didn’t you notice other people coming and going in the courtyard, especially in my side room?”<br/><br/>Elder Zeng pondered for a moment, ”  , have I?”<br/><br/>Old Yuan said speechlessly, “Hasn’t there? Have you guys eaten those children following Doctor Jin?”<br/><br/>“Children?” Elder Zeng asked in confusion, “There are indeed three children with Doctor Jin, one is his own grandson, whom we all know. The other two are a young girl in her teens and a young man.”<br/><br/>At this point, Elder Zeng suddenly realized, and asked incredulously, “Are you saying that the other people are the young man and the girl? Aren’t they Doctor Jin’s apprentice and grand-apprentice?”<br/><br/>“No!” Old Yuan nodded, “To be precise, only one of them is a doctor, and they are brother and sister!”<br/><br/>Elder Zeng furrowed his brows, and asked skeptically, “So, you mean, your illness, as well as Old Chen and the others’ health, were all treated by those two young people?”<br/><br/>“That’s right.” Old Yuan didn’t hide it, “It was the little girl who did it.”<br/><br/>Elder Zeng was so surprised that he stood up from his chair and said, “That young girl? How is that possible? She looks only a few years old, not even fifteen?”<br/><br/>“No, she’s only eleven years old.” Old Yuan’s expression was slightly smug, “Don’t you think it’s incredible? Well, let me tell you, the bullet inside Old Jiang was also moved by that child, so, the decades-long painful problem that troubled Old Jiang was easily solved.”<br/><br/>Old Jiang went to Licheng and met a highly skilled traditional Chinese medicine doctor who removed the bullet from his body. This news was already well-known.<br/><br/>However, no one knew which doctor had the ability to solve the problem that made all the doctors frown, and Old Jiang and the others kept silent about it.<br/><br/>Now, Elder Zeng knew that the doctor was right under their noses.<br/><br/>They had always thought it was Doctor Jin, but now<br/><br/>At this point, Elder Zeng frowned and stared deeply into Old Yuan’s eyes, full of suspicion, saying,<br/><br/>“That’s not right, Old Yuan, why did you reveal it so readily this time? Before, when many people asked you about it, you guys refused to talk.”<br/><br/>Old Yuan sighed lightly and said truthfully, “We all came from battlefields. We understand the pain and torment you all have endured.<br/><br/>Earlier, many people consulted me about my condition, and they must have noticed the changes in our bodies. Many people must have thought about getting Doctor Jin to condition their bodies.<br/><br/>Doctor Jin didn’t dare to take on such a responsibility, so he mentioned it to the child. Besides, we all hope that everyone in the courtyard is healthy, because there are fewer and fewer of us old fellows in this courtyard.<br/><br/>We tried asking the child if she was willing to help. She is a kind-hearted and righteous child who likes us old fellows who have come through the battlefields.<br/><br/>She agreed to take a look at everyone, but she had a condition: she needs obedient patients, and she doesn’t like it when people talk nonsense and point fingers during her treatment.”<br/><br/>At this point, he paused, looked at Elder Zeng and said, “Old Zeng, the girl’s medical skills are definitely better than Doctor Jin’s. If you want her to help you, I’ll talk to her and let her take a look at you when she comes tomorrow to treat me.”<br/><br/>Elder Zeng nodded, “Alright.”\t\t\t\t\t\t</div>", "images": {}, "success": true}