{"id": 232, "url": "https://www.novelhall.com/the-lucky-star-blessing-the-whole-village-32483/14344320.html", "title": "Chapter 232 - Chapter 232: Chapter 232: (Second Update)", "volume": 3, "volume_title": "Volume 3", "body": "<h1>Chapter 232 - Chapter 232: Chapter 232: (Second Update)</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 232: Chapter 232: (Second Update)<br/><br/>Translator: 549690339<br/><br/>Xiao Family Village.<br/><br/>“Wanshan, where has Jinli gone? I haven’t seen her for so many days,” the Village Head asked Xiao Wanshan.<br/><br/>Xiao Wanshan said, “She went to Licheng, to her maternal aunt’s house. Is there something wrong?”<br/><br/>The Village Head said, “She’s been gone for so long. I’m worried there might be some problems with the earthworms in the greenhouse.”<br/><br/>The Village Head was asking on behalf of everyone else.<br/><br/>After all, the earthworms raised by Xiao Jinli are now considered treasures by the villagers.<br/><br/>Xiao Wanshan smiled and said, “You can rest assured. Jinli prepared the earthworm’s feed before leaving.”<br/><br/>The Village Head nodded and shared the real purpose of his visit.<br/><br/>He said, “Wanshan, now people from ten miles and eight villages around us know that our Xiao Family Village makes a living by growing vegetables with earthworms.<br/><br/>Many relatives and friends have come to ask if they could buy some earthworms from us. They don’t want to use earthworms to grow vegetables to sell. They just want to grow them for their own consumption.”<br/><br/>Relatives and friends who visited Xiao Family Village naturally tasted the vegetables grown by the villagers.<br/><br/>Now, the vegetables grown at home are the ones everyone in the town are eager to buy.<br/><br/>Seeing their children enjoying the vegetables, relatives and friends naturally had some ideas.<br/><br/>Especially after hearing that the health of the children in Xiao Family Village improved significantly after eating the vegetables grown with earthworms, without even catching a cold.<br/><br/>If they asked for vegetables from their relatives every day, it would be fine for a while, but they couldn’t ask for it every day.<br/><br/>So they wanted to buy earthworms to grow their own vegetables.<br/><br/>Of course, the villagers of Xiao Family Village have refused before, because this is their means to wealth, and without permission from Xiao Jinli or the company, they cannot sell the earthworms to relatives and friends at will.<br/><br/>Therefore, after many requests from relatives and friends, the villagers were afraid of offending them, and reluctantly asked the Village Head to come and talk to them.<br/><br/>Upon hearing the Village Head’s words, Xiao Wanshan asked, “What do Xiao Yucheng and Xiao Mingchen think?”<br/><br/>The company in the village is now managed by them, so it should be up to them to decide.<br/><br/>The Village Head said with a smile, “The two of them think that the company can sell some earthworms to the relatives and friends. However, it’s not the relatives and friends buying from the company, but our Xiao Family Village buying them first. After that, whether we give or sell the earthworms to others is up to us.”<br/><br/>Xiao Wanshan laughed, “Then there’s no problem. Why ask my daughter about it? She’s handed over full authority for the company to her two cousins.”<br/><br/>The Village Head explained, “Everyone thinks that Jinli is the one who raised the earthworms, so they feel it’s necessary to ask her first.”<br/><br/>At this point, he asked doubtfully, “Jinli has been in Licheng for so long, doesn’t she need to go to school?”<br/><br/>Xiao Wanshan said, “She took a one-month leave from school.”<br/><br/>She had asked the Principal directly for the leave.<br/><br/>“One month? That’s so long?” The Village Head was slightly surprised, “Won’t it affect her studies?”<br/><br/>Xiao Wanshan seemed very open-minded and said, “She sleeps in class anyway. If she wants to go out, let her.”<br/><br/>The Village Head laughed and said, “That’s true. Jinli is very smart. Even if she sleeps in class, she can still win first place in the whole county when she competes.”<br/><br/>Xiao Wanshan just smiled.<br/><br/>After the Village Head left, Xiao Wanshan frowned. Just then, Xiao’s mother came over and asked, “What’s wrong?”<br/><br/>Xiao Wanshan said, “Jianjun called and said that Jinli knew Traditional Chinese Medicine, took the pulses of several important people, and now has even gone directly to the Capital City.”<br/><br/>Xiao Mother was surprised and asked doubtfully, “What? Jinli knows medicine? Since when has our Jinli studied medicine?”<br/><br/>Xiao Wanshan said, “Jianjun told me that she saved a TCM Grumpy Old Man in the deep mountain and has been learning from him since she was two years old.”<br/><br/>“She started learning at two years old?” Xiao Mother was amazed again, “So, the reason Jinli liked going to the mountains alone after she was two years old was to study medicine?”<br/><br/>Xiao Wanshan nodded and said, “It should be like that!”<br/><br/>They were such failed parents, not even knowing what their own child had been doing.<br/><br/>Unknowingly, their little daughter grew up to be so extraordinary.<br/><br/>Xiao Mother worriedly said, “This child is too reckless. She’s only been learning medicine for a few years, what if there’s a problem?”<br/><br/>“On the contrary,” said Xiao Wanshan, “Our Jinli has diagnosed new problems for them, used acupuncture, and prescribed medicine for them. The health of several old gentlemen is getting better and better, and they really like her now!”<br/><br/>Xiao Mother asked doubtfully, “We have never seen Jinli treat patients before. How could she go to Licheng and brazenly diagnose and treat those old gentlemen? And how could they trust a child for treatment? Isn’t their heart too big?”<br/><br/>Xiao Wanshan shook his head and said, “Those old gentlemen have good hearts. When Jinli said she wanted to take their pulse, they thought she was just playing. Who would have thought that she would find all the problems in their bodies with one diagnosis?<br/><br/>Most importantly, one of the old gentlemen, Grandpa Jiang, had a hidden bullet in his body, which was very close to his heart. It was too dangerous to have surgery, so he could only control the problem conservatively. But as soon as Jinli took action, she moved the bullet away from Grandpa Jiang’s heart. Afterwards, he had a minimally invasive surgery and ate the medicine prescribed by Jinli. His health has been improving day by day!”<br/><br/>Xiao Mother,<br/><br/>She must have given birth to a genius!<br/><br/>As Xiao Wanshan said this, he looked somewhat guilty, “Jianjun asked her why she did that. Do you know what Jinli answered? She said that our Xiao Family Village needs a powerful backer!”<br/><br/>“So,” said Xiao Mother, deeply moved, “Jinli suddenly exposed her extraordinary medical skills just for our Xiao Family Village?”<br/><br/>Xiao Wanshan nodded, “Yes!”<br/><br/>As he said this, he sighed softly, his eyes full of heartache,<br/><br/>“Jinli is very far-sighted and always thinks ten steps ahead when she does things!<br/><br/>The vegetables and other products from our Xiao Family Village have special properties and powerful effects. If we don’t find a powerful backer, once our vegetables become famous outside, they will definitely attract the attention of capitalists. Then, when they want our commercial secret planting technology, crushing us would be as simple as crushing an ant!”<br/><br/>Xiao Mother,  This child has been working too hard!\t\t\t\t\t\t</div>", "images": {}, "success": true}