{"id": 237, "url": "https://www.novelhall.com/the-lucky-star-blessing-the-whole-village-32483/14344329.html", "title": "Chapter 237 - Chapter 237: Chapter 237: (First Update)", "volume": 3, "volume_title": "Volume 3", "body": "<h1>Chapter 237 - Chapter 237: Chapter 237: (First Update)</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 237: Chapter 237: (First Update)<br/><br/>Translator: 549690339<br/><br/>Jiang’s old man had adopted a granddaughter, and this news spread quickly in the nursing home.<br/><br/>The Jiang family also received the news quickly.<br/><br/>Hearing that the old master had adopted a granddaughter, all the sons and grandsons of Elder Jiang who could spare the time rushed to the nursing home.<br/><br/>“Dad, where’s my adoptive daughter?” Jiang Zhenlong asked excitedly.<br/><br/>He is Elder Jiang’s second son.<br/><br/>“Dad, where’s my adoptive daughter?” Jiang Zhenzhou also asked the same question.<br/><br/>He is Elder Jiang’s fifth son.<br/><br/>“Fifth brother, why are you trying to compete with me?” Jiang Zhenlong was very dissatisfied, “I am her adoptive father!”<br/><br/>Jiang Zhenzhou was unhappy and said, “Dad didn’t say which one of us should be the adoptive father; why can’t I compete for it?”<br/><br/>As the two brothers bickered, they looked around the room.<br/><br/>In the whole house, there was only one girl.<br/><br/>“Sister, I’m your third brother, Jiang Xiping! You’ve become so pretty, sister.”<br/><br/>“Sister, I’m your sixth brother, Jiang Xi’an! How is our sister this cute!”<br/><br/>“Sister, I’m your eighth brother, Jiang Xixi! Sister, you’re so beautiful and adorable!”<br/><br/>“Sister, I’m your ninth brother, Jiang Xile! Haha, we finally have a sister, and she’s both beautiful and cute; we no longer have to be envious of other people’s sisters.”<br/><br/>Xiao Jinli,<br/><br/>Gao Yanxin, ”  .” He, the real older brother, had been pushed to the back!<br/><br/>Today, two of Elder Jiang’s sons and four grandsons came. The others were too busy with work and had no time to spare.<br/><br/>Elder Jiang looked at the group of people, who charged in like hungry wolves, and his face turned black.<br/><br/>He immediately scolded, “Enough! You grown men are crowding around the child, rude and barbaric; you’ll frighten this little girl!”<br/><br/>The two sons and four grandsons immediately fell silent.<br/><br/>“This child’s name is Xiao Jinli, and she’s eleven years old this year!” Elder Jiang said with a smile, “Girl, this is your Second Uncle and Fifth Uncle, and you have a Third Uncle and Fourth Uncle as well. As for the eldest, let him be your adoptive father.”<br/><br/>As the eldest son and grandson, the adopted granddaughter naturally belonged to him, her status was higher.<br/><br/>“Also, these are your four brothers who came today. Don’t be fooled by their rough appearances; they will surely spoil you in the future!” Elder Jiang introduced the four grandsons.<br/><br/>As soon as Elder Jiang finished speaking, Jiang Zhenlong and Jiang Zhenzhou immediately voiced their displeasure, “Dad, I want to be her adoptive father too!”<br/><br/>Being an adoptive father means being a daughter, and being an uncle means being a niece; there’s a difference in status.<br/><br/>“The eldest will be the adoptive father, and from then on, she will belong to the eldest grandson’s line!” Elder Jiang made the decision.<br/><br/>Jiang Zhenlong and the others immediately fell silent.<br/><br/>If they genuinely wanted a girl, placing her under the name of the eldest would be the best expression, showing Elder Jiang and the Jiang family’s greatest love for her.<br/><br/>Elder Jiang then asked, “When you came to meet your niece/sister, did you bring any gifts?”<br/><br/>Gifts?<br/><br/>The Jiang family members looked at each other.<br/><br/>Upon receiving Elder Jiang’s phone call, their hearts were too excited, and they all wanted to see their adoptive daughter (sister) at the first opportunity, so they hadn’t thought about bringing a gift for their first meeting.<br/><br/>Jiang Zhenlong was the first to react, and he said with a smile, “Little Li, I was too excited when Second Uncle came, so I forgot to prepare a gift. Don’t worry, Second Uncle will definitely not forget your gift!”<br/><br/>Then, everyone else promised to send Xiao Jinli gifts another day.<br/><br/>After all, Elder Jiang had suddenly accepted an adoptive granddaughter, and none of his descendants had been prepared.<br/><br/>They would have to choose a good gift to send to the newly-appointed niece (sister) another day.<br/><br/>“Um, Old Jiang, you should choose a more formal day for the adoption ceremony. Today, this girl still needs to treat me. My treatment hasn’t even started yet!” Old Master Yuan looked at the Jiang family’s posture and knew that if he didn’t stop them, he wouldn’t be treated today.<br/><br/>Old Chen also laughed and said, “Yes, Old Jiang, adopting a granddaughter is a good thing. Let’s choose an auspicious date and be more formal. At that time, it would be best to invite the girl’s relatives as well.”<br/><br/>Since Xiao Jinli had been adopted as a granddaughter, naturally her family members would also be considered as relatives and should not be ignored.<br/><br/>From what this girl’s cousin said, the girl’s relatives all cherished her very much.<br/><br/>Elder Zeng also laughed, “Old Jiang, congratulations!”<br/><br/>Since yesterday, when Old Master Yuan told him that Xiao Jinli could treat him, he had come over very early today.<br/><br/>Unexpectedly, before the treatment even began, Old Jiang had already claimed her as his adoptive granddaughter.<br/><br/>After feeling Old Master Yuan’s pulse, Xiao Jinli said, “Grandpa Yuan, you don’t need acupuncture, you just need to take medication for three more days.”<br/><br/>Old Yuan became excited, “Just three more days of medication, my girl, does that mean I’m completely cured of my illness?”<br/><br/>Xiao Jinli nodded, “Yes, in three days, you can go to the hospital for another check.”<br/><br/>Old Yuan immediately declined, “What’s the point of a check-up? Can’t I just trust you? That ghostly hospital can’t detect anything. Otherwise, they would have detected this condition of mine.”<br/><br/>On one hand, he really disliked going to the hospital, on the other hand, he had complete trust in Xiao Jinli’s medical skills.<br/><br/>Since she said his illness was cured, then it must be cured.<br/><br/>The so-called cure not only included his brain disease, but also some of the geriatric diseases and chronic ailments that were healed. He was now a completely healthy old man.<br/><br/>“Congratulations, Old Yuan, your health is about to recover,” Old Chen said with a grin.<br/><br/>Old Li and Grandpa Jiang also laughed, “From now on, we old fellows will be able to get out and about.”<br/><br/>Under Xiao Jinli’s care during this period, their health had also recovered.<br/><br/>Now they slept well, ate well, and what made them happiest was that they no longer needed to watch what they ate.<br/><br/>If they wanted to eat braised pork, they could without worrying about high blood pressure.<br/><br/>If they wanted to eat sugar, they could without worrying about diabetes.<br/><br/>In short, they could eat whatever they wanted.<br/><br/>Xiao Jinli had also prepared some specific pills for them, such as those for indigestion caused by overeating, and they only needed to take one without any side effects.<br/><br/>Hearing that Old Yuan was really cured, Elder Zeng still found it unbelievable.<br/><br/>“It’s almost cured? So soon?” Elder Zeng asked, “Old Yuan, how long have you been treated?”<br/><br/>“Fifteen days, or was it eighteen days?” Old Master Yuan furrowed his brows.<br/><br/>Xiao Zhang said, “Old Master, it’s fifteen days!”<br/><br/>The original estimate was that the treatment would take twenty to thirty days, but who would have thought that in just fifteen days, oh, plus the three days of taking medication afterward, in eighteen days, the old master’s body would be cured of even geriatric and chronic diseases.<br/><br/>Xiao Zhang really admired Xiao Jinli.<br/><br/>“So fast!” Elder Zeng was very surprised.<br/><br/>The treatment was so fast that he was quite skeptical.\t\t\t\t\t\t</div>", "images": {}, "success": true}