{"id": 241, "url": "https://www.novelhall.com/the-lucky-star-blessing-the-whole-village-32483/14344336.html", "title": "Chapter 241 - Chapter 241: Chapter 241: (First Update)", "volume": 3, "volume_title": "Volume 3", "body": "<h1>Chapter 241 - Chapter 241: Chapter 241: (First Update)</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 241: Chapter 241: (First Update)<br/><br/>Translator: 549690339<br/><br/>Tian Xiuli said with suspicion, “You’re not trying to use my old master for an experiment, are you?”<br/><br/>Tian Xiuli’s words were quite unpleasant.<br/><br/>She was entirely questioning Xiao Jinli.<br/><br/>Well, anyone in her position would probably have doubts.<br/><br/>“Enough, you don’t know anything, so just keep quiet!” Elder Zeng coldly scolded. “Otherwise, you can go back home.”<br/><br/>He was quite disappointed and sad about the couple’s attitude.<br/><br/>When they were at the hospital earlier, he had heard everything clearly from outside the door.<br/><br/>Doctor Guo said his cancer was in the late stage and could not be treated.<br/><br/>Even with treatment, the process would be painful, and it would be better to let him live peacefully for the last days.<br/><br/>But this couple, for the sake of their status and honor, let the doctor treat him to prolong his life.<br/><br/>Zeng Limin opened his mouth, his expression somewhat complex, and called out, “Dad!”<br/><br/>Elder Zeng waved his hand and said, “You two want me to live longer, don’t you? So why are you doubting when there’s hope? So, do you really want me to live or to die?”<br/><br/>His words were quite severe.<br/><br/>Zeng Limin and his wife’s faces changed, and they both shook their heads, “Dad, it’s not like that. We   we just want you to live well.”<br/><br/>Tian Xiuli added, “Dad, it’s not that we doubt her, but this child is really too young. Her medical skills make me very suspicious, and Doctor Guo said that your disease has no cure. I   I just can’t believe her, Dad!”<br/><br/>“You don’t believe, but I do!” Elder Zeng said firmly, “I tell you, even if it can be cured, I won’t choose Western medicine.”<br/><br/>At this point, he paused, his sharp eyes shooting toward them, and continued, “You go home. Whether my disease can be cured or not, and who will treat it, is none of your business.”<br/><br/>“Dad, how can it not be our business?” Zeng Limin disagreed. “You are my father, and we are your son and daughter-in-law. Of course, we should care about your health.”<br/><br/>“Enough, don’t say any more.” Elder Zeng seemed quite impatient. “If you really cared about me, you wouldn’t have stayed away for so long. Now that I’m about to die, you suddenly care and want me to live in agony.”<br/><br/>Everyone,<br/><br/>Except for Xiao Jinli and Gao Yanxin, the others knew some of Elder Zeng’s family matters.<br/><br/>Zeng Limin knew he couldn’t persuade Elder Zeng, so he turned to look at Xiao Jinli, his eyes sharp and full of suspicion.<br/><br/>Jiang Zhenlong stood in front of Xiao Jinli, slightly displeased, “Zeng Big Brother, what kind of look is that? This is my niece.”<br/><br/>“Your niece?” Zeng Limin asked doubtfully, “When did the Jiang family have a girl?”<br/><br/>“It has now. What’s the matter, do you have an opinion?” Grandpa Jiang’s spirits were high. “This is my granddaughter, and no one can bully her.”<br/><br/>He had finally gotten a granddaughter with abilities, and he couldn’t let her be underestimated.<br/><br/>Zeng Limin,<br/><br/>Although he didn’t know the exact relationship between this girl and the Jiang family, he couldn’t look down on her.<br/><br/>To be valued by the Jiang family and acknowledged by Grandpa Jiang as his granddaughter, this little girl must have some abilities.<br/><br/>Zeng Limin smiled and said, “Uncle Jiang, I won’t do anything to her or bully her. I just have some doubts and want to ask her. I won’t eat her.”<br/><br/>Then he turned to Xiao Jinli and asked, “You’re Doctor Xiao Jinli that Xiao Zhou mentioned, right?”<br/><br/>Xiao Jinli nodded.<br/><br/>Zeng Limin continued, “Doctor Xiao, just now you said that my father’s illness can be cured. I want to know clearly, how will you treat it and to what extent?”<br/><br/>Xiao Jinli replied with a faint smile, “Mr. Zeng, whatever extent you want me to treat, I’ll treat.”<br/><br/>Tian Xiuli immediately protested, “What kind of talk is that? Aren’t you doctors supposed to save lives? Shouldn’t you try your best to save those who can be saved? Why are you asking us to what extent?”<br/><br/>Xiao Jinli spread her hands and laughed lightly, “Madam, I just said that I could cure Elder Zeng’s illness. My ‘cure’ obviously means to cure it completely. But you keep doubting and questioning me. I understand, given my age. However, treating patients depends on my mood. If my mood is bad, I won’t treat. On the other hand, if my mood is good, I’ll treat.”<br/><br/>Everyone,  It really is a child’s mentality.<br/><br/>“So, since you’ve been doubting me, my mood has been quite bad,” Xiao Jinli spoke honestly. “Since you doubt me, I’ll just ask what condition you want the old master’s body to recover to?”<br/><br/>Zeng Limin and his wife,<br/><br/>Of course, they wanted Elder Zeng’s body to be completely restored to health.<br/><br/>Tian Xiuli said, “We obviously want the old master’s body to be restored to health.”<br/><br/>“In that case,” Xiao Jinli said solemnly, “if you choose me to treat Elder Zeng, no one can talk or interfere in my presence. Otherwise, I won’t take this patient! So, you’d better think it through now. I’ll give you three days to consider.”<br/><br/>After that, she turned to Elder Zeng and said, “Elder Zeng, you should discuss with your family whether you want me to treat you or not. Let me be clear, once I accept a patient, unless something happens to me, only I can treat them, and I will arrange everything. I won’t accept any doubts from anyone.”<br/><br/>Everyone,  This was like a tyrannical clause.<br/><br/>Also, how confident and capable must this child be to say such words?<br/><br/>Most people wouldn’t accept Xiao Jinli’s conditions.<br/><br/>Everyone looked at Elder Zeng.<br/><br/>Elder Zeng was very decisive, “Girl, no need to discuss. I accept your treatment.”<br/><br/>“Dad!” Zeng Limin and his wife strongly disagreed.<br/><br/>Tian Xiuli exclaimed, “Dad, do you really believe her? She’s just a child; what if she kills you halfway through treatment?”<br/><br/>“That’s my fate!” Elder Zeng said firmly, “I don’t have much time left anyway. If I die during treatment, so be it. I won’t blame Doctor Xiao or anyone else. And, you’re not allowed to cause trouble for Doctor Xiao either, or else, I won’t recognize you!”<br/><br/>Everyone,<br/><br/>Zeng Limin and his wife,<br/><br/>Everyone was surprised and admired Elder Zeng’s decisiveness.<br/><br/>As for Zeng Limin and his wife, they felt that the old master was being too childish in choosing a child to treat him.<br/><br/>They wanted to persuade him further, but the old master was too stubborn, and they couldn’t convince him.\t\t\t\t\t\t</div>", "images": {}, "success": true}