{"id": 246, "url": "https://www.novelhall.com/the-lucky-star-blessing-the-whole-village-32483/14344345.html", "title": "Chapter 246 - Chapter 246: Chapter 246: (Second Update)", "volume": 3, "volume_title": "Volume 3", "body": "<h1>Chapter 246 - Chapter 246: Chapter 246: (Second Update)</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 246: Chapter 246: (Second Update)<br/><br/>Translator: 549690339<br/><br/>Chapter 246: (Second Update)<br/><br/>Jiang Xile, Xiao Jinli, and Gao Yanxin entered the private room together.<br/><br/>Xiao Jinli curiously asked, “Ninth Brother, who is that girl? Someone pursuing you?”<br/><br/>Jiang Xile shook his head, “No, she is Third Sister-in-law’s younger sister.”<br/><br/>Gao Yanxin said with puzzlement, “She’s a relative then, but your attitude towards her  ” It was as if she was an enemy.<br/><br/>Jiang Xile explained with a smile, “If she wants to be part of the Jiang family as a relative, we will certainly treat her as one. However, you don’t know this girl; she has many schemes.”<br/><br/>“Oh, what do you mean?” Gao Yanxin asked with confusion.<br/><br/>Jiang Xile said with annoyance, “She wants to be a girl from our Jiang Family.” This remark was clearly directed at Lan Mingyue.<br/><br/>“She used to visit our Jiang family daily, pretending to be well-behaved and clever in front of us. But behind our backs, she would be very arrogant and bossy towards the servants in the house, acting as if she were the Miss of the Jiang family.”<br/><br/>“Ha, wearing two faces, huh?” Gao Yanxin said with slight surprise, “From how gracefully she carries herself, who would have thought she had such cunning and would be able to put on such an act.”<br/><br/>“Exactly. It’s a pity for such a young girl, who can act so well, not to become an actress.” Jiang Xile agreed, “Oh, wait, I heard from Third sister-in-law that she actually wants to break into the entertainment industry.”<br/><br/>“Entering the entertainment circle,” Gao Yanxin nodded, “No wonder she can act so well. It would be a real waste if she didn’t pursue a career in the entertainment industry.”<br/><br/>Jiang Xile agreed, “Absolutely. You know, our entire family was almost deceived by her. Fortunately, our grumpy old man has a keen eye for people and saw through her pretense. Otherwise, who knows how she would use the Jiang family’s influence for her own benefit.”<br/><br/>“Indeed, the old man has fiery eyes and a golden gaze!” Gao Yanxin agreed.<br/><br/>Xiao Jinli,<br/><br/>Just now, when the Ninth Brother called Lan Mingyue his sister, Xiao Jinli saw the girl’s face change, as if she had taken away everything that belonged to Lan Mingyue. Her eyes were filled with hatred.<br/><br/>After a while, Jiang Xile began to tell Gao Yanxin about Lan Mingyue’s achievements in the Jiang family.<br/><br/>Jiang Xile said, “She was so eloquent, gentle, and considerate in front of us. She was able to observe each of our likes and dislikes, especially that of my uncles and aunts. It’s hard not to like such a beautiful and clever girl, isn’t it?”<br/><br/>“Indeed!” Gao Yanxin agreed, “Just like my cousin, since she was little, she was beautiful, smart, and well-behaved. All of us loved her so much. However, my cousin is not an actress and wouldn’t know how to act.”<br/><br/>“No kidding,” Jiang Xile happily added, “The old man passed over so many girls in the capital but chose Little Sister Jinli. When our family heard that he adopted a granddaughter, everyone was overjoyed. We all trust the old man’s judgment, and we believe that the girl he chose must be a good girl, so everyone wanted to meet her at once. Everyone who could go meet her did so. Haha  ”<br/><br/>Gao Yanxin said with a hint of resentment, “Why did your entire family try to take my sister from me when I brought her to the Capital City?”<br/><br/>Especially since every time they visited Xiao Jinli, they brought all kinds of gifts, making him jealous.<br/><br/>“What taking away?” Jiang Xile disagreed, “We are joining in, understand?”<br/><br/>Gao Yanxin realized, “Right, joining in.”<br/><br/>Her sister originally had a bunch of older brothers, and now a whole new bunch of brothers had joined.<br/><br/>As they were chatting animatedly, a somewhat familiar voice came from the corridor outside.<br/><br/>“Brother Su, it’s been a long time since I’ve seen you. Have you been particularly busy recently?”<br/><br/>Was this Lan Mingyue’s voice?<br/><br/>Gao Yanxin asked with suspicion, “Does this woman have that many older brothers?”<br/><br/>However, before Jiang Xile could reply, an even more familiar voice came from inside the room.<br/><br/>“Miss Lan, please have some self-respect. I don’t know you well!”<br/><br/>“Xiao Siqian?” Gao Yanxin was surprised. He looked at Xiao Jinli and asked again, “Cousin, doesn’t this voice sound just like Xiao Siqian? Is he in the Capital City?”<br/><br/>Jiang Xile asked puzzledly, “Young Master Gao, who is Xiao Siqian?”<br/><br/>“He is one of my brothers,” Gao Yanxin said as he opened the private room’s door, and then saw the man entering another room. He murmured, “Even the back view looks so much like him. Could it be Xiao Siqian?”<br/><br/>Xiao Jinli’s eyes flashed.<br/><br/>Gao Yanxin asked her, “Cousin, this person not only sounds like Xiao Siqian but also resembles him from behind. Could it be him? We should go and confirm it. Should we greet him?”<br/><br/>About Xiao Siqian leaving the Xiao Family, Xiao Wanshan had not kept secrets from everyone.<br/><br/>Xiao Jinli thought for a moment and said, “Alright, let’s go and confirm it.”<br/><br/>With that, the two of them left the private room and knocked on the door of another private room. Jiang Xile went along with them out of curiosity.<br/><br/>“Who is it?” A stranger’s voice came from inside the room.<br/><br/>Gao Yanxin said, “Hello, I’m looking for Xiao Siqian.”<br/><br/>Gao Yanxin didn’t know Xiao Siqian’s real name and only mentioned Xiao Siqian.<br/><br/>Su Yichen, who was sitting inside the private room, was slightly shocked.<br/><br/>This voice  It was like his brother Gao Yanxin.<br/><br/>He wanted to go and open the door to confirm, but upon thinking of something, he suppressed his excitement and remained expressionless as usual.<br/><br/>Lan Mingyue, who was sitting beside him, noticed and said with a smile, “Brother Su, I’ll open the door and tell him he found the wrong person.”<br/><br/>However, as soon as she finished speaking, another person’s voice came in.<br/><br/>“Brother Siqian, it’s me!”<br/><br/>As soon as the voice outside fell, Su Yichen’s face turned excited as he ran to open the door.<br/><br/>As soon as the door opened, he saw Xiao Jinli standing outside and exclaimed excitedly, “Little Sister Jinli!”<br/><br/>After saying that, he immediately hugged Xiao Jinli.<br/><br/>Gao Yanxin did not expect it to really be Xiao Siqian.<br/><br/>He spoke discontentedly to Su Yichen, who was hugging Xiao Jinli, “Well, Xiao Siqian, I called you for half a day, and you didn’t respond. But when my sister spoke up, you immediately opened the door. Are you looking down on me as a brother?”<br/><br/>Jiang Xile also recognized Su Yichen and asked curiously, “Isn’t this Mr. Su? Why are you all calling him Xiao Siqian?”<br/><br/>Then, with a dark expression, he stepped forward to pull Su Yichen away, loudly saying, “Mr. Su, let go of my sister!”<br/><br/>He hadn’t even hugged his sister yet, but Su Yichen had already done so.<br/><br/>However, Xiao Jinli didn’t resist or show discontent, so it seemed their relationship might be quite close.<br/><br/>Hearing the two men’s voices, Su Yichen only then realized that they were in a public place, and his expression changed slightly. He felt a little annoyed that he had been so excited to see Xiao Jinli just now.\t\t\t\t\t\t</div>", "images": {}, "success": true}