{"id": 242, "url": "https://www.novelhall.com/the-lucky-star-blessing-the-whole-village-32483/14344338.html", "title": "Chapter 242 - Chapter 242: Chapter 242: (Second Update)", "volume": 3, "volume_title": "Volume 3", "body": "<h1>Chapter 242 - Chapter 242: Chapter 242: (Second Update)</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 242: Chapter 242: (Second Update)<br/><br/>Translator: 549690339<br/><br/>In Xiao Family Village, after hanging up the phone, Xiao Wanshan showed a somewhat helpless expression.<br/><br/>Xiao Mother anxiously asked, “What happened? What did Xiao Bao say?”<br/><br/>Xiao Wanshan said with a slightly complicated expression, “Xiao Bao told me that she was supposed to be back in a month, but something came up and now she has to wait a while longer before she can return.”<br/><br/>“Ah, what happened to Xiao Bao? Is she in danger?” Xiao Mother asked.<br/><br/>“Don’t worry, our Xiao Bao is very safe!” Xiao Wanshan said. “Xiao Bao took in a new patient with a serious illness, it requires a longer treatment time. So she won’t have time to come back home yet. She asked me to apply for another two months of leave from her school.” In two months, the school will start summer vacation.<br/><br/>At this point, he shared another surprising piece of information with Xiao Mother.<br/><br/>He said, “Xiao Bao also told me that she adopted a grandpa in the big courtyard. When they have time, they’ll meet us.”<br/><br/>Xiao Mother exclaimed in surprise, “An   adoptive grandfather?”<br/><br/>“Yes, an adoptive grandfather.” Xiao Wanshan said. “He’s from the big courtyard. Xiao Bao told me that he has five sons, nine grandsons, three great-grandsons, and no granddaughters. He likes Xiao Bao, so he adopted her as his adoptive granddaughter.”<br/><br/>Xiao Mother,<br/><br/>Xiao Bao managed to bring home a new relative after going out this time.<br/><br/>Xiao Wanshan continued, “The adoptive grandfather said that we should arrange a time for our entire family to visit the capital city or for them to visit Xiao Family Village, so both families can meet as relatives.”<br/><br/>Xiao Mother asked in amazement, “Is   is such a fanfare necessary?”<br/><br/>“Our Xiao Bao is very much loved by that old gentleman. He said that from now on, the two families will treat each other as relatives, so it’s necessary to get acquainted.” Xiao Wanshan said.<br/><br/>His mood was complicated and emotional.<br/><br/>The old gentleman in the big courtyard  well, he was certainly an important person.<br/><br/>But such an important person liked his Xiao Bao.<br/><br/>Indeed, Xiao Bao was a child loved by everyone.<br/><br/>When Xiao Jinli started the formal treatment for Elder Zeng, she gave him a treatment consent form.<br/><br/>This consent form, as she said, seemed like a tyrannical clause.<br/><br/>Elder Zeng agreed and signed without a second word.<br/><br/>However, Elder Jiang notified Zeng family’s offspring to come over to avoid them causing trouble for various reasons.<br/><br/>No matter how much the Zeng family objected, Elder Zeng still signed it himself.<br/><br/>Zeng family members wanted to cause trouble for Xiao Jinli, but there were people from Jiang family and several old gentlemen protecting her.<br/><br/>Elder Jiang said with arrogance and a strong aura, “You all are obstructing here ceaselessly, are you afraid that my granddaughter will cure your old man? If she really cures your old man, do you need to kowtow and apologize with death?”<br/><br/>Elder Zeng also warned with a dark face, “Letting Doctor Xiao treat me is my own choice. If you bother Doctor Xiao again, don’t blame me for being rude. Anyone who says more, I will drive them out of Zeng family and not let them share Zeng family’s property!”<br/><br/>Well, once these words were spoken, all Zeng family members kept quiet.<br/><br/>It’s unknown whether they were afraid of being expelled from the Zeng family or not getting a share of the property.<br/><br/>All Zeng family members were driven out of the nursing home by Elder Zeng. He ordered that no one was allowed to come to the nursing home before his permission.<br/><br/>He also told the security guards not to let Zeng family members pass.<br/><br/>The expressions on Zeng family members were angry and helpless.<br/><br/>Since the old man spoke, they dared not disobey.<br/><br/>However, if Xiao Jinli could cure the old man’s illness, that would be fine. But if anything went wrong halfway, regardless of what consent form was signed and who was protecting her, they would definitely make her pay the price.<br/><br/>“Elder Zeng, your condition is quite serious, so the treatment time may be quite long. In a shorter time frame, it would take at least a month and a half, and if longer, I’m afraid it will take three months.” Xiao Jinli said, “During the treatment process, acupuncture, herbal baths, and medications will be used.”<br/><br/>Elder Zeng said, “Girl, I’ll leave my body entirely in your hands. Whatever treatment you say, I’ll cooperate! Even if it’s not cured in the end, I have no complaints. After all, I don’t have much time left.”<br/><br/>Since being diagnosed with late-stage pancreatic cancer, he felt more and more pain throughout his body, sometimes unbearable.<br/><br/>So he could imagine that it would become more and more painful, too painful to control.<br/><br/>No wonder Old Fang chose suicide.<br/><br/>Old Master Yuan immediately countered and said loudly, “Old Zeng, it’s your mistake. How could you not have faith in the girl? If the child said your illness can be cured, it definitely can be. From now on, don’t say those discouraging words like ‘not being cured,’ it’s demoralizing.”<br/><br/>Elder Zeng said with a smile, “Yes, I should trust Doctor Xiao, and from now on, I won’t say those discouraging words.”<br/><br/>Xiao Jinli went to prepare the medicine, and after a while, she came out with a bowl of dark medicine in her hand. She said to Elder Zeng, “Elder Zeng, since your condition is serious, I’ll give you a strong medicine for the first dose. This medicine is very bitter, but you must drink it all without leaving a drop.<br/><br/>Five minutes after drinking it, you may need to use the toilet, and you might have diarrhea. So, be prepared. After drinking this medicine and having diarrhea, you will sleep.”<br/><br/>“Tomorrow, I will decide whether you need to drink this medicine again based on your physical condition. If not necessary, you can start taking herbal baths, and after the baths, acupuncture will begin!”<br/><br/>She told him this so that he could make arrangements in advance.<br/><br/>Hearing this, Xiao Zhou quickly made the arrangements.<br/><br/>The old man will have diarrhea in five minutes.<br/><br/>So, the bathroom must be arranged first.<br/><br/>Others may be able to endure it, but the old man definitely couldn’t.<br/><br/>Otherwise, Doctor Xiao wouldn’t have said so.<br/><br/>There are two bathrooms in Old Master Yuan’s yard.<br/><br/>One is a public bathroom, and the other is in the old man’s bedroom.<br/><br/>Xiao Zhou prepared the public one.<br/><br/>Those present wouldn’t use the bathroom at this time either.<br/><br/>Elder Zeng held the medicine, took a sip, and found it very bitter, even more bitter than any Chinese medicine he had drunk before.<br/><br/>However, it is said that good medicine tastes bitter.<br/><br/>Elder Zeng didn’t even change his facial expression and drank it all in one gulp.<br/><br/>After giving the bowl to Xiao Jinli, he went to the bathroom with Xiao Zhou’s assistance.<br/><br/>During Elder Zeng’s time in the bathroom, Old Master Yuan asked curiously, “Girl, what kind of medicine is this? Why does Elder Zeng need to drink it?”<br/><br/>Xiao Jinli said, “This is a detoxifying medicine. In fact, no matter it’s taking medicine, acupuncture, or herbal baths, their functions are to expel toxins. In the eyes of traditional Chinese medicine, cancer is caused by stagnation of qi, blood stasis, phlegm condensation, evil, poison, and deficiency. The general principle of treatment includes replenishing the positive energy, expelling the negative energy, using both attack and supplement. Differentiate the syndrome and treat according to the symptoms. Pay attention to the actual situation when treating the deficiency and don’t forget the reality in the beginning.”<br/><br/>The methods used for replenishing positive energy mainly depend on the deficiency and focus on different aspects, combining with the main affected organs and using the treatment methods of replenishing qi, blood, yin, and yang. To get rid of the negative energy is mainly targeted at the lesions, using the methods of regulating qi, transforming phlegm, activating blood and removing blood stasis, clearing heat and detoxifying, etc.”<br/><br/>Old Master Yuan and others,<br/><br/>It makes sense, but they just can’t understand it!<br/><br/>Indeed, different professions are like different mountains!\t\t\t\t\t\t</div>", "images": {}, "success": true}