{"id": 249, "url": "https://www.novelhall.com/the-lucky-star-blessing-the-whole-village-32483/14344350.html", "title": "Chapter 249 - Chapter 249: Chapter 249: (First Update)", "volume": 3, "volume_title": "Volume 3", "body": "<h1>Chapter 249 - Chapter 249: Chapter 249: (First Update)</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 249: Chapter 249: (First Update)<br/><br/>Translator: 549690339<br/><br/>After suffering a great humiliation at the restaurant, Lan Mingyue ran back home.<br/><br/>Upon seeing her daughter’s red eyes, Lady Lan asked with a heartache, “Mingyue, what’s happened to you? Who’s hurt you? I’ll fight back for you!”<br/><br/>Seeing her mother, Lan Mingyue began to cry bitterly and said, “Mom, Su Yichen and Jiang Xile have been seduced by a vixen. They scolded me just for that vixen. Boo-hoo   ”<br/><br/>Hearing this, Lady Lan furrowed her brow and asked, “Mingyue, what vixen? Could you explain more clearly?”<br/><br/>Lady Lan did genuinely love her daughter, but Lan Mingyue also held great value for their family’s purpose.<br/><br/>The Lan Family planned to use Lan Mingyue to make the Jiang Family recognize her as their granddaughter. The Lan Family’s rise to become a high-class family would be effortless then.<br/><br/>Why would the Lan Family want to send their daughter to the Jiang Family to be their daughter, after they had already married one of their daughters into the Jiang Family?<br/><br/>The daughter who had married into the Jiang Family didn’t get along well with the Lan Family, even threatening to stir trouble if the Lan Family tried to manipulate the Jiang Family for their benefit.<br/><br/>Furthermore, the Jiang Family had not offered any help to the Lan Family, leaving them feeling slighted.<br/><br/>However, Lan Mingyue and Lan Mingxing have a good relationship.<br/><br/>The Lan Family capitalized on this relationship, allowing Lan Mingyue to frequently visit the Jiang Family in hopes that they would accept her as their granddaughter.<br/><br/>It was a pity that the Jiang Family had not shown any reaction yet.<br/><br/>Hearing that Jiang Xile had bullied her daughter for another girl, Lady Lan had a bad feeling.<br/><br/>Through her tears, Lan Mingyue said, “She is a vixen. Jiang Xile even calls her ‘sister’. To please that vixen, he wouldn’t let me call him ‘Ninth Brother’ and cursed at me.<br/><br/>And that man, Su Yichen, he embraced that vixen the moment he saw her. He was affectionate towards her and treated me rudely. I hate him now. Boo-hoo    Mom, that vixen has stolen Brother Yichen from me!”<br/><br/>Before marrying her daughter into a high-end family, the Lan Family was relying on Lan Yingying to marry Lan Mingyue off to Su Yichen, thus gaining control over him.<br/><br/>Until Su Yichen turned 18, he had treated Lan Mingyue quite well out of respect for his stepmother. Lan Mingyue was also good at reading people’s emotions. At the Su Family, she sweetly called him ‘Brother Yichen’, and he seemed to accept it.<br/><br/>Yet, once Su Yichen returned to the Capital City, even his own family avoided him. Needless to say, he had no pleasant expressions for Lan Mingyue, who was only related by his stepmother’s side.<br/><br/>But Lan Mingyue was thick-skinned and ignored Su Yichen’s rejection. Whenever she saw Su Yichen, she would still act coquettishly, even though Su Yichen frowned, he did not curse at her directly.<br/><br/>However, who would have thought …<br/><br/>Upon hearing her daughter’s rich description of her grievances, Lady Lan felt a surge of anger.<br/><br/>“Where did this cunning vixen pop up from?” Lady Lan asked with a grim face. “Mingyue, are you sure Jiang Xile called her ‘sister’?”<br/><br/>“Yes, I heard it clearly!” Lan Mingyue said, “Oh, I just remembered. Su Yichen seems to call her Little Sister Jinli. That vixen also had another man calling Su Yichen by the name ‘Si Quan’.”<br/><br/>Si Quan?” Lady Lan frowned tightly. “Your Aunt has never mentioned him having such a name before.”<br/><br/>“Also, how could Jiang Xile call her ‘sister’? Could it be that the Jiang Family has acknowledged a new daughter?” Lady Lan speculated, “Or is she a girl that Jiang Xile met outside?”<br/><br/>Upon hearing this, Lan Mingyue stopped crying and questioned, “Mom, could she be Jiang Xile’s sweetheart?”<br/><br/>Lady Lan shook her head and said, “That’s hard to say.”<br/><br/>At this point, her expression became serious. “Mingyue, you must go to the Jiang Family immediately and try to understand the situation. See if the Jiang Family is aware of this ‘sister’ Jiang Xile was talking about.”<br/><br/>She had an unease deep in her heart, as if something she had under control was slipping away from her.<br/><br/>The only person who could enter the Jiang Family’s mansion now was Lan Mingyue.<br/><br/>Lan Mingyue came to her senses too, with a serious expression she said, “Alright, Mom, I’ll call Second Sister right now.”<br/><br/>Having said that, she called Lan Mingxing.<br/><br/>After hanging up the phone, her expression was somewhat unpleasant.<br/><br/>She said, “Mom, Second Sister said she’s not at home now.”<br/><br/>If Lan Mingxing wasn’t at the Jiang’s, Lan Mingyue had no excuse to go to the Jiang’s.<br/><br/>Lady Lan’s face darkened and she said with a hint of suspicion, “Is she lying to you?”<br/><br/>Lan Mingyue was a bit confounded, and suspicious as well, “Could she?”<br/><br/>“Why couldn’t she?” Lady Lan said angrily, “Haven’t you noticed that she’s been finding all sorts of excuses to avoid going to the Jiang’s lately?”<br/><br/>Lan Mingyue’s face turned a bit more sour at that remark.<br/><br/>Lady Lan said, “Mingyue, just head over to the Big Courtyard directly, I don’t believe that they would stop you from entering.”<br/><br/>Lan Mingyue nodded and said, “Alright, Mom, I’ll head to the Jiang’s right now!”<br/><br/>Jiang Xile still didn’t know that Lan Mingyue went to the Jiang’s.<br/><br/>After having lunch, they took Xiao Jinli and Gao Yanxin to several famous places in Capital City.<br/><br/>At night, after sending the two back to the nursing home, Jiang Xile returned to the Jiang’s.<br/><br/>Upon returning, he noticed that the atmosphere at home was a bit peculiar, the looks everyone gave him were even more so.<br/><br/>Jiang Xile touched the back of his head and asked, “Third brother, why are you staring at me like that? It’s a bit creepy?”<br/><br/>Jiang Xiping asked with a grin, “Eldest Brother, what were you up to today?”<br/><br/>Jiang Xile responded, “What was I up to? I went out to have fun.”<br/><br/>“Did you take a sister out with you and treat her to a meal at Old Huang’s Restaurant?” Jiang Xiping asked again.<br/><br/>Jiang Xile nodded and said, “Yes, how did you know, Third Brother? Did you see me somewhere?”<br/><br/>“Eldest Brother, are you being serious?” Jiang Xi’an asked curiously.<br/><br/>Jiang Xile looked a bit confused and said, “Of course I am, I took Xiao Jinli to lunch. What’s up, Third Brother, Sixth Brother, why are you suddenly asking me about all this? Something feels off.”<br/><br/>The eldest, Jiang Xiwen, said sternly, “Eldest Brother, if you’re dating, you need to have the intention of getting married and take it seriously. If I find out you’re just playing tricks, I’ll break your legs.”<br/><br/>“Wait, Big Brother, who am I dating?” Jiang Xile asked in confusion, “I’m not dating anyone.”<br/><br/>“If you’re not dating, why did you take a girl out to a restaurant and out to have fun?” Jiang Xiwen scolded harshly, “Jiang Xile, have you become involved with some questionable girls outside?”<br/><br/>“What does that even mean?” Jiang Xile asked, puzzled, “Big Brother, I was just out with our sister Xiao Jinli buying medical herbs and sightseeing a bit. How did this turn into me dating someone? And what questionable girl?”<br/><br/>“What did you say? You took Xiao Jinli out today?” Jiang Xi’an asked, surprised.<br/><br/>Jiang Xile nodded, “Yes. After Xiao Jinli treated Grandpa Zeng, she wanted to go out to buy medical herbs, so Grandfather told me to go with her.”<br/><br/>Jiang Xiwen and the others were left speechless,\t\t\t\t\t\t</div>", "images": {}, "success": true}