{"id": 240, "url": "https://www.novelhall.com/the-lucky-star-blessing-the-whole-village-32483/14344334.html", "title": "Chapter 240 - Chapter 240: Chapter 240: (Second Update)", "volume": 3, "volume_title": "Volume 3", "body": "<h1>Chapter 240 - Chapter 240: Chapter 240: (Second Update)</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 240: Chapter 240: (Second Update)<br/><br/>Translator: 549690339<br/><br/>Zeng Limin’s face was ashen, but after calming down slightly, he asked directly, “If we were to undergo treatment, how much longer could my father live?”<br/><br/>The old man must survive, even if he’s barely hanging on, he represents the foundation of the Zeng family. No one can trample over it.<br/><br/>Madam Zeng also chimed in, “Yes, Dr. Guo, if we try to treat him, we want him to live for as long as he can.”<br/><br/>Dr. Guo looked shocked, “Mr. Zeng, Mrs. Zeng, the treatment process will be very painful. Furthermore, given your father’s age, it is uncertain whether he can withstand it or not. Shouldn’t we discuss it with him first?”<br/><br/>They are truly disregarding the old man’s suffering by insisting on treatment.<br/><br/>Enraged, Zeng Limin barked, “I just want my father to be alive!”<br/><br/>As Dr. Guo was about to continue persuading, the door swung open. Xiao Zhou rolled in Elder Zeng in a wheelchair.<br/><br/>Xiao Zhou gave Zeng Limin and his wife a complex look, before bowing his head and maintaining a blank expression.<br/><br/>“Dad, why  why are you here?” Zeng Limin stuttered, “Weren’t you resting in the ward?”<br/><br/>Elder Zeng snorted coldly, “Humph, if I hadn’t come, I wouldn’t have known that my good son wanted to push me into a blazing pit.”<br/><br/>“Dad,” Tian Xiuli was visibly unhappy, “Why would you say that? We just want you to live, what’s wrong with that?”<br/><br/>“True, you did nothing wrong. You just want me to live a life worse than death.” Elder Zeng rebuked sarcastically, “Should I be thanking you?”<br/><br/>Zeng Limin and his wife were left speechless.<br/><br/>Elder Zeng didn’t spare his son and daughter-in-law another glance. Instead, he looked at Dr. Guo and calmly asked, “So, Dr. Guo, can you confirm that I have terminal pancreatic cancer?”<br/><br/>Just as Dr. Guo was about to speak, a nurse brought over a report.<br/><br/>After reviewing the final two items in the report, Dr. Guo’s eyebrows furrowed deeply.<br/><br/>His gaze lingered on Elder Zeng, uncertain.<br/><br/>Elder Zeng roared, “Dr. Guo, I want the truth!”<br/><br/>He sighed then declared, “Elder, the final test results came out. All the data confirms that you indeed have pancreatic cancer, and it’s already at an advanced stage. Any treatment would be fruitless.”<br/><br/>Zeng Limin’s face turned pale immediately, looking ghastly.<br/><br/>“This   This can’t be!” Zeng Limin shouted in disbelief, “You must have diagnosed incorrectly.”<br/><br/>He lunged forward, grabbing Dr. Guo by the collar, yelling, “You must have made a mistake. How can my father have such a serious illness? Every time he comes in for medical examination, how do you even check? How did you miss such a serious issue?”<br/><br/>“Enough!” Elder Zeng raised his voice, “Zeng Limin, stop your foolishness!”<br/><br/>Afterward, he instructed Xiao Zhou, “Xiao Zhou, let’s leave. Back to the nursing home!” His expression slightly melancholy.<br/><br/>However, before they got the chance to leave, Xiao Zhou’s phone rang.<br/><br/>Seeing the caller ID, Xiao Zhou said, “Elder, it’s Elder Jiang!”<br/><br/>“Pick it up!” Elder Zeng let out a sigh, “Tell him straight up about my late-stage pancreatic cancer!”<br/><br/>As Xiao Zhou responded to the call, “Elder Jiang, yes, what? Alright, I’ll hand the phone to Elder.”<br/><br/>Following that, he handed the phone to Elder Zeng and exclaimed, “Elder, Elder Jiang said that your disease can be cured!”<br/><br/>“What?”<br/><br/>Everyone present was taken aback.<br/><br/>Zeng Limin and his wife, in particular, were visibly agitated.<br/><br/>Calmly, Elder Zeng took the phone. After a brief conversation, he abruptly stood up, excitement apparent on his face.<br/><br/>“Alright, alright, I’ll head back now!”<br/><br/>After ending the call, Elder Zeng handed the phone back to Xiao Zhou, instructing him, “Xiao Zhou, take me back to the nursing home.”<br/><br/>Before leaving, he shot an intense look at his son and daughter-in-law, stating assertively, “Let me tell you two. I am not going to treat my disease. Even if I were to, I will not opt for western medicine.”<br/><br/>“Dad….” It was painful for Zeng Limin to watch his father leave.<br/><br/>Elder Zeng waved him off, “Enough.”<br/><br/>Xiao Zhou escorted Elder Zeng back to the nursing home. After a moment, Zeng Limin and his wife, both shaken, followed suit.<br/><br/>Upon arriving at the nursing home, Elder Zeng went directly to Master Yuan’s yard.<br/><br/>Zeng Limin and his wife were puzzled.<br/><br/>“Why isn’t the Old Master going into his own yard? Why go to Old Master Yuan’s?” Tian Xiuli was full of doubts.<br/><br/>Zeng Limin squinted his eyes and speculated, “I heard that Master Yuan’s illness was cured by a certain doctor, probably he is going to find that doctor?”<br/><br/>Tian Xiuli, full of skepticism, asked, “Master Yuan’s illness wasn’t cured by Dr. Jin? But Dr. Jin is currently hailed as the top figure in the National Medical Field. If even he couldn’t cure it, who could? Did Dr. Jin just credit the success to his pupil?<br/><br/>No matter what, she would never believe that a child in his teens was more competent than Dr. Jin.<br/><br/>Zeng Limin pondered over it and replied, “That seems unlikely. Master Yuan is no ordinary person, he knows best who cured him. Given his forthright character, he won’t go along with Dr. Jin’s plot.”<br/><br/>“So, my dear, you’re suggesting that the person who cured Master Yuan truly is a genius? And that genius is a child in his teens?” There was still disbelief on Tian Xiuli’s face.<br/><br/>“We can find out once we get inside.” Zeng Limin suggested.<br/><br/>Once they entered Old Master Yuan’s yard, they found it filled with people, especially Jiang’s family, they were in great numbers.<br/><br/>“What happened here?”<br/><br/>“Why are there so many people here?”<br/><br/>In this crowd, there was only one child, and it was a girl.<br/><br/>Xiao Zhou said that Master Yuan’s illness was cured by a child in his early teens, could he be referring to this girl?<br/><br/>How is that possible?<br/><br/>When Elder Jiang saw Elder Zeng’s arrival, he immediately waved him over, “Old Zeng, come, let the girl take your pulse another time?”<br/><br/>Elder Zeng, unlike his calm demeanor at the hospital, was filled with excitement as he asked, “Girl, can my illness genuinely be cured? The hospital confirmed that I have late-stage pancreatic cancer. It’s so late-stage that there is no necessity for treatment anymore, right?”<br/><br/>Xiao Jinli smiled and said, “Elder Zeng, please sit down, let me take your pulse again!”<br/><br/>Elder Zeng obediently sat down on a chair and extended his arm.<br/><br/>Xiao Jinli sat beside him, taking his pulse.<br/><br/>Zeng Limin watched, his mouth opening as if he wanted to say something. However, as his eyes roved around, he remained silent.<br/><br/>In contrast, Tian Xiuli wore a look of disbelief.<br/><br/>A moment later, Xiao Jinli let go of his wrist.<br/><br/>Old Master Yuan impatiently asked, “Girl, how is Old Zeng’s sickness?”<br/><br/>Xiao Jinli said, “Old Master Yuan, Elder Zeng’s illness can be cured, it’s just…”<br/><br/>Before she could finish her sentence, Tian Xiuli gasped in shock.<br/><br/>“You can cure him? How is that possible? You are just a kid,” Tian Xiuli questioned skeptically, “and you have the audacity to say you can cure our Sir? The hospital has already told us to give up on treatment, and live through the remaining days in peace.”\t\t\t\t\t\t</div>", "images": {}, "success": true}