{"id": 248, "url": "https://www.novelhall.com/the-lucky-star-blessing-the-whole-village-32483/14344348.html", "title": "Chapter 248 - Chapter 248: Chapter 248: (Second Update)", "volume": 3, "volume_title": "Volume 3", "body": "<h1>Chapter 248 - Chapter 248: Chapter 248: (Second Update)</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 248: Chapter 248: (Second Update)<br/><br/>Translator: 549690339<br/><br/>“Little sister, what is your relationship with Su Yichen?” Jiang Xile asked with a curious mind, “Why do you all call him Xiao Siqian?”<br/><br/>“Su Yichen?” Gao Yanxin said with a hint of joy, “So his real name is Su Yichen, and he is the heir of the Su Corporation. That’s quite an impressive identity.”<br/><br/>Jiang Xile became more confused, “You didn’t know his name is Su Yichen? Or his status?”<br/><br/>“We didn’t know.” Gao Yanxin shook his head. “The name Xiao Siqian was given to him temporarily.”<br/><br/>“Temporary name?”<br/><br/>Can names be given temporarily?<br/><br/>Gao Yanxin then narrated the story of how Xiao Siqian was rescued by his cousin Xiao Jinli from the foot of the mountain, and how he spent half a year living with his elder aunt in Xiao Family Village after losing his memory.<br/><br/>“Later, I heard from my elder aunt that he found his relatives and left. I didn’t expect Xiao Siqian’s family to be in the Capital City. It’s quite a surprise,” Gao Yanxin sighed, “And he has such an amazing status.”<br/><br/>After listening, Jiang Xile said, “There were rumors in the upper-class circles that Su Yichen’s disappearance had something to do with the Su Family. Moreover, during the half-year of his disappearance, the Su Family only sent people to search for him in secret and did not report to the police.<br/><br/>When Su Yichen returned to the Capital City, he did not go back to the Su Family immediately but instead went to the Xia Family and even took on the role of a deputy general manager. There were also rumors saying that Su Yichen suffered from amnesia.<br/><br/>Su Yichen, with memory loss, treated his biological father and his stepmother as strangers. Su Xiangdong, the head of the Su Corporation, was very upset that his son went to work for the Xia Family. He visited the Xia Family several times to persuade Su Yichen to return to the Su Family but was driven away every time, which had become a joke in the Capital City.”<br/><br/>Gao Yanxin asked in confusion, “Is Su… I mean, is Su Yichen’s relationship with his family really bad?”<br/><br/>Jiang Xile shook his head, “I’m not sure. They say that Su Yichen’s father is his biological father and his mother is his stepmother. Before Su Yichen’s disappearance, their family was loving and warm, especially this stepmother who treated him better than her own son, with respectful brothers.<br/><br/>However, after his disappearance and subsequent return as the amnesic Su Yichen, he grew close to his maternal family and seemed to reject his previous family members, even treating them worse than strangers.”<br/><br/>Telling this, he said jokingly, “Hehe, I even heard a rumor.”<br/><br/>“What is it?” Xiao Jinli asked.<br/><br/>Jiang Xile said, “There’s a rumor that Su Yichen’s disappearance was orchestrated by Lady Su, his stepmother, to secure the inheritance left by Yichen’s biological mother for her own son!”<br/><br/>“Huh?” Gao Yanxin doubted, “An inheritance left for the biological son, claimed by her son? How much inheritance was left that she has to fall out with her adopted son, who she treats as her own?”<br/><br/>“One billion!” Jiang Xile replied.<br/><br/>Gao Yanxin gaped in disbelief, “One billion? That much? Su   Su Yichen’s family is really that rich? One billion, no wonder his stepmother wants to become his enemy.”<br/><br/>One billion, wealth stirs up greed, especially such a vast fortune.<br/><br/>“But this raises a question.” Gao Yanxin reacted, “How can the inheritance left by someone’s biological mother be inherited by someone’s stepson?”<br/><br/>Jiang Xile shook his head, “It should be impossible. However, it was said that Su Yichen’s biological mother left a will. The will stipulates that all her inheritance could only be claimed after her biological son turns 18. However, when Su Yichen came of age, he gave up his biological mother’s inheritance and transferred all his mother’s wealth to his stepbrother, Su Hanyang.”<br/><br/>“Did Xiao   I mean, did Su Yichen’s brain get waterlogged?” Gao Yanxin asked incredulously, “Why would he transfer the inheritance his mother left for him to his stepbrother? Such a vast fortune, wouldn’t he want to inherit it himself?”<br/><br/>Jiang Xile nodded, “Exactly. If the rumors are true, then Su Yichen must have been out of his mind.”<br/><br/>“So he gave all his wealth to his stepmother and stepbrother. Then what does he live on, the wind? Or does he just live on the scraps given to him by his stepmother and stepbrother? What was Su Yichen thinking? Does he really trust his stepmother and stepbrother that much?” Gao Yanxin complained indignantly.<br/><br/>Jiang Xile shook his head, “Only he knows the answers to those questions!”<br/><br/>Gao Yanxin nodded, “Alright, the next time we meet, I will ask him if his brain was waterlogged.”<br/><br/>Jiang Xile, This brother’s character is really straightforward!<br/><br/>Xiao Jinli, This is a boy who has lost his way and been brainwashed by his stepmother. No, that’s wrong. He has been brainwashed by his so-called biological father and his family!<br/><br/>Xiao Jinli said, “I did hear him mention it! He lost his mother at a young age, and his stepmother, stepbrother, no, and his biological father, the three of them, gave him a particularly warm and happy home!<br/><br/>For that happy family, he felt that he was willing to give up anything, even if it was just his mother’s inheritance!<br/><br/>But what he never ever expected was that he signed the inheritance transfer agreement in the morning, and in the afternoon he was kidnapped by the kidnappers!”<br/><br/>Xiao Jinli did not look at Gao Yanxin and Jiang Xile, she said with a sigh, “He just wanted a home.”<br/><br/>Jiang Xile and Gao Yanxin fell silent at once!<br/><br/>A home, for many people, is simply made up of parents, brothers, and sisters. It’s a simple possession. Some people even take their homes for granted, or want to escape from it.<br/><br/>But for many others, a home is a longing that’s insatiably desired. They want the love of parents, the laughter among siblings, a happy and warm home.<br/><br/>Su Yichen lost his mother at a young age and soon after his stepmother came into his life, showing him warmth and empathy. His stepbrother has been protecting him since childhood, never fighting or grabbing anything from him, even leaving all the good things for his little brother. His biological father loved him.<br/><br/>No matter whether these scenarios were contrived or not, to Su Yichen, they represent the warmth and happiness of a home.<br/><br/>For the warmth and happiness of home, he was willing to make sacrifices.<br/><br/>But Su Yichen never ever expected that whilst he wanted to give up everything to maintain the surface level of peace and tranquillity, the others wanted his life.<br/><br/>Once this illusion was shattered, it’s like developing countless cracks!<br/><br/>The damage has been done, any attempts at fixing it are in vain.<br/><br/>Gao Yanxin sighed, “He really has it tough.”<br/><br/>Being born into a wealthy family, was unexpectedly brainwashed and calculated from a young age.<br/><br/>“After seeing him again, I won’t scold him for having a waterlogged brain.” Gao Yanxin added, “It’s actually not easy for him. After surviving the disaster, he stepped into the vortex.”<br/><br/>Xiao Jinli said, “He wants revenge. Revenge for his mother and for himself, he has to do it this way.”<br/><br/>Jiang Xile nodded, “Su Yichen is talented. Otherwise, being young and only 18, he wouldn’t be able to survive in the business world filled with smoke and fire.”<br/><br/>Speaking of this, he exclaimed, “By the way, I really admire his mother’s foresight.”<br/><br/>Even though her son was brainwashed in the hands of the enemy, she still left a way out for him.<br/><br/>“Indeed, his mother is truly great!” Gao Yanxin nodded.\t\t\t\t\t\t</div>", "images": {}, "success": true}