{"id": 243, "url": "https://www.novelhall.com/the-lucky-star-blessing-the-whole-village-32483/14344339.html", "title": "Chapter 243 - Chapter 243: Chapter 243: (First Update)", "volume": 3, "volume_title": "Volume 3", "body": "<h1>Chapter 243 - Chapter 243: Chapter 243: (First Update)</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 243: Chapter 243: (First Update)<br/><br/>Translator: 549690339<br/><br/>Actually, what Xiao Jinli gave Elder Zeng to drink was Lingquan water mixed with Coptis, and as for the black color, well, she added black ink.<br/><br/>If Elder Zeng’s illness were to be cured, he would only need to drink Lingquan water for three days, and go to the toilet several times each day. His body would recover quickly.<br/><br/>Of course, when treating people, she couldn’t be too special, so she had to proceed step by step. Besides, she really knew how to treat with traditional Chinese medicine.<br/><br/>She used her real medical skills to treat patients, not relying solely on Lingquan water.<br/><br/>After Elder Zeng went once, he felt much more relaxed.<br/><br/>He laughed and said, “I feel much more relaxed.”<br/><br/>Old Master Yuan laughed and said, “Just now when you went, it removed the toxins and impurities from your body, so of course you feel much more relaxed.”<br/><br/>Elder Zeng’s expression looked much better, and he laughed happily, “Oh, so that’s how it is. I was wondering why the medicine was so bitter, but as the saying goes, ‘Good medicine tastes bitter and benefits the sick’. After just one dose, my body feels much more relaxed.”<br/><br/>It’s just that the medicine was too bitter.<br/><br/>At this point, Elder Zeng asked, “Doctor Xiao, do I need to fast? Is there anything I should avoid eating?”<br/><br/>Xiao Jinli shook her head and said, “No need, unless it’s poison.”<br/><br/>Xiao Zhou’s mouth twitched.<br/><br/>Elder Zeng’s mouth also twitched, and he laughed, “I’m not so desperate as to want to eat poison. Today, I have a particularly good appetite, and I especially want to eat something. Since there’s nothing to avoid, Xiao Zhou, ask Mama Zhou to make me a plate of big chunks of braised pork. I want to eat enough today!”<br/><br/>Before, even if he wasn’t diagnosed with pancreatic cancer, the geriatric diseases would make him fast and avoid certain foods. His favorite braised pork was forbidden, and he had to eat a light diet.<br/><br/>However, because his body was not in good condition, even if a plate of braised pork was made, he didn’t have much appetite for it.<br/><br/>Today, he suddenly wanted to eat braised pork.<br/><br/>Xiao Zhou asked Xiao Jinli, “Doctor Xiao, can the old master eat that much braised pork?”<br/><br/>Xiao Jinli said, “There’s no need to avoid it. The old master can eat whatever he wants and as much as he wants. If you’re worried about indigestion, I have medicine here. You can take a pill after the meal.”<br/><br/>After saying so, Xiao Jinli took out a box containing snack-like granules from her bag, and a box of black pills.<br/><br/>She took them out and looked around.<br/><br/>“Girl, what are you looking for?” Old Master Yuan asked in confusion.<br/><br/>“A plastic bag!”<br/><br/>“What do you need a plastic bag for?”<br/><br/>“To hold these pills! Otherwise, there’s nothing to hold them in.”<br/><br/>Everyone,  using a plastic bag to hold these pills?<br/><br/>Xiao Zhou reacted and said, “Doctor Xiao, wait a moment. I’ll ask someone to bring a jar from home.”<br/><br/>After saying so, he made a phone call.<br/><br/>A few minutes later, someone brought over a yellow wooden box.<br/><br/>Xiao Jinli took the yellow wooden box and poured half of the pills into it directly.<br/><br/>Xiao Jinli said, “These pills, take one every day. However, if you eat too much indigestible food, you can take another one. Remember, you can only have two a day at the most.”<br/><br/>Xiao Zhou gratefully took the glass jar and replied, “I got it.”<br/><br/>He would be monitoring the old master’s medicine intake every day.<br/><br/>Now that the old master doesn’t need to fast or avoid certain foods, it’s best to eat one or two pills every day.<br/><br/>Treatment for today ends here.<br/><br/>Starting tomorrow, Xiao Jinli will treat Elder Zeng in his yard.<br/><br/>After Elder Zeng left, Xiao Jinli said, “Grandfather, Grandpa Yuan, I want to go out for a walk and buy some medicinal materials at the pharmacy.”<br/><br/>Old Master Jiang asked, “What medicinal materials do you need? I can send someone to buy them; there’s no need for you to go personally.”<br/><br/>Xiao Jinli shook her head and said, “There are some medicinal materials that I must pick out myself; otherwise, their medicinal properties won’t be strong enough.”<br/><br/>“Alright, where are you going? I’ll send someone to protect you,” said Old Master Jiang.<br/><br/>Xiao Jinli laughed and shook her head, “Grandfather, I’ve been in the Capital City for so long and haven’t gone out sightseeing. I just want to go out for a stroll now. If I have so many people following me, it would be too conspicuous.”<br/><br/>Old Master Jiang still looked worried, “But I’m not at ease with you going alone, as you’re just a girl!”<br/><br/>“I’ll have my cousin accompany me!” said Xiao Jinli. “Besides, as they say, there’s no real distinction between medicine and poison. I’ll let anyone who dares to bully me taste the feeling of being poisoned.”<br/><br/>Old Master Jiang twitched the corner of his mouth, “Girl, is it wise to say this in front of your grandfather? We live in a society with the rule of law, so don’t go too far.” He believed that she would know her limits.<br/><br/>“Well, I know,” said Xiao Jinli, nodding. “I’ll just make those who try to bully me itch all over and temporarily be unable to move – nothing too serious.”<br/><br/>Old Master Jiang was still concerned, “No, I’ll call your Ninth Brother to go with you.”<br/><br/>Xiao Jinli thought for a moment and said, “Alright then.”<br/><br/>She couldn’t refuse Old Master Jiang’s kindness.<br/><br/>It wasn’t long before Jiang Xile arrived in a black sedan to pick them up.<br/><br/>“Sister, let’s go. Today, Ninth Brother will take you around the city. I’m familiar with the streets and alleys in the Capital City, so just tell me where you want to go, and I’ll take you there,” said Jiang Xile with a smile.<br/><br/>Xiao Jinli replied with a smile, “Right now, I want to buy some medicinal materials. Ninth Brother, just take me to the largest pharmacy.”<br/><br/>“Alright!”<br/><br/>Gao Yanxin, who had been completely ignored, felt left out.<br/><br/>These days, he increasingly felt as if his sister had been snatched away by someone else.<br/><br/>During Xiao Jinli’s stay at the Nursing Home, Jiang’s nine grandsons would visit her daily, taking turns to do so.<br/><br/>Each time they came, they brought gifts.<br/><br/>And they were all gifts that a young girl would like.<br/><br/>Jiang Xile drove a low-profile, luxurious black sedan from the Retirement Home for Cadres, heading directly towards Tongrentang Pharmacy.<br/><br/>Seeing the crowded pharmacy,<br/><br/>There were people who came for treatment and those who came to buy medicine, all waiting in line in the lobby.<br/><br/>Jiang Xile furrowed his brows and said, “There are too many people here. You wait a moment; I’ll give Jin Xiangxue a call.”<br/><br/>“Does this pharmacy have anything to do with Jin Xiangxue?” Gao Yanxin asked curiously.<br/><br/>Jiang Xile explained, “The Jin family has shares in this Tongrentang.”<br/><br/>After Jiang Xile called, he said to Xiao Jinli, “Today, Doctor Jin is seeing patients at Baorentang, and Jin Xiangxue is there, too. Let’s go find him directly.”<br/><br/>Xiao Jinli nodded.<br/><br/>She knew that Doctor Jin had an appointment today.<br/><br/>Jiang Xile took Xiao Jinli and her brother through the back door, going straight to the clinic to find Jin Xiangxue.<br/><br/>Perhaps many people knew that Doctor Jin Shanlin was seeing patients today, so there were many patients lining up outside, most of them registered under Dr. Jin’s name.<br/><br/>Doctor Jin was seeing patients and had not noticed Xiao Jinli’s arrival.<br/><br/>Jin Xiangxue welcomed Xiao Jinli into the break room.<br/><br/>Looking at Xiao Jinli, he asked directly, “Doctor Xiao, Ah Le told me you’re here to buy medicinal materials. What do you need? Just tell me, and I’ll find them for you.”<br/><br/>Before he could finish speaking, there was suddenly a commotion outside, as if someone was shouting, “Help! Doctor, someone’s fainted and bleeding!”\t\t\t\t\t\t</div>", "images": {}, "success": true}