{"id": 247, "url": "https://www.novelhall.com/the-lucky-star-blessing-the-whole-village-32483/14344346.html", "title": "Chapter 247 - Chapter 247: Chapter 247: (First Update)", "volume": 3, "volume_title": "Volume 3", "body": "<h1>Chapter 247 - Chapter 247: Chapter 247: (First Update)</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 247: Chapter 247: (First Update)<br/><br/>Translator: 549690339<br/><br/>After letting go of Xiao Jinli, Su Yichen realized what had happened.<br/><br/>He first greeted Gao Yanxin, “Brother Gao, I’m so happy to see you again. How are my maternal aunt and uncle? Are they in good health?”<br/><br/>Jiang Xile raised her eyebrows.<br/><br/>Su Yichen actually had such a close relationship with the Gao family.<br/><br/>“They are all well!” Gao Yanxin nodded and said, “As for you, I thought I had misheard your voice just now, but when I saw your silhouette and resemblance to Xiao Siqian, I guessed it was you. So, I came to find you and say hello. Siqian, are you from the Capital City?”<br/><br/>Su Yichen nodded, “Yes, I am from the Capital City.”<br/><br/>Jiang Xile curiously asked, “Brother Gao, why did you call Mr. Su ‘Xiao Siqian’?”<br/><br/>Gao Yanxin was stunned, and asked, “Isn’t his name Xiao Siqian?”<br/><br/>At this moment, Lan Mingyue, who refused to be ignored, said, “Brother Su is now the deputy general manager of Xia Corporation and also the heir of Su Corporation. His name is not Xiao Siqian.”<br/><br/>“The heir of Su Corporation?” Gao Yanxin asked curiously, “Siqian, are you the heir of Su Corporation?”<br/><br/>Having been in the Capital City for some time, he had heard of Su Corporation.<br/><br/>“Yes, Brother Su is the heir of Su Corporation. You know the Su Corporation, right? It is one of the top wealthy families in the Capital City!” Lan Mingyue said proudly. “My aunt is Brother Su’s mom.” Although a stepmother, there was no difference from a birth mother.<br/><br/>“The heir of a wealthy family in the Capital City?” Gao Yanxin congratulated with a smile, “You have such a distinguished identity. Congratulations on finding your family!”<br/><br/>Su Yichen smiled and said, “Thank you.”<br/><br/>“So you guys really don’t even know that Brother Su is the heir of Su Corporation, where did you come from? Countrysides?” Lan Mingyue scanned Xiao Jinli and her brother with a look of disdain, “Dressed so shabbily, you must be some poor relatives.”<br/><br/>At this moment, Lan Mingyue was no longer pretending to be a kind and cute girl.<br/><br/>From the moment Jiang Xile called Xiao Jinli ‘little sister’ and Su Yichen hugged Xiao Jinli, her hostility towards Xiao Jinli erupted, and she even forgot to hide it in front of them.<br/><br/>“Lan Mingyue, shut up!” Su Yichen snapped angrily, “You are the poor relative, get lost!”<br/><br/>Xiao Family Village and all the people of Xiao Family were the softest spots in his heart, and no one could insult them.<br/><br/>Lan Mingyue looked at Su Yichen in disbelief, her beautiful eyes wide, “Brother Su, are you telling me to get lost? Have you forgotten how good you used to be to me? You even said I was your real sister. But now, for the sake of two outsiders, you’re yelling at me?”<br/><br/>As she said this, she looked hurt.<br/><br/>“Sorry, Lan Xiaoming, as I said, I have amnesia.” Su Yichen said coldly, “I don’t remember anything about the past. In the future, please don’t call yourself my sister, and don’t shamelessly follow me around. It’s not just you who loses face, I lose face too. So, please leave now.”<br/><br/>Jiang Xile raised her eyebrows. Su Yichen had quite a sharp tongue.<br/><br/>Originally, Su Yichen was ignoring Lan Mingyue, but she kept pestering and following him.<br/><br/>The reason he let Lan Mingyue enter the private room was to see if he could get any information about his stepmother from her.<br/><br/>Who would have thought that as soon as they sat down, Gao Yanxin and the others came looking for them?<br/><br/>Being driven away, Lan Mingyue’s face turned pale and then red, looking very ugly.<br/><br/>Immediately, she glared at Xiao Jinli with resentful eyes and said angrily. “Brother Su, are you driving me away because of this vixen?”<br/><br/>As she spoke, she looked at Jiang Xile with a pitiful gaze and asked, “Ninth   Ninth Young Master, what’s so good about this woman that she has you all so bewitched?”<br/><br/>Jiang Xile and Su Yichen’s expressions changed instantly, and they both angrily shouted, “Lan Mingyue, shut up!”<br/><br/>Afterward, the two men exchanged glances, seeing vigilance and alertness in each other’s faces.<br/><br/>Jiang Xile said coldly, “Lan Mingyue, I warn you, watch your mouth! This is my sister, a member of my Jiang family. If you call her a vixen again, believe it or not, I’ll sew your mouth shut!”<br/><br/>Su Yichen also seemed unwilling to concede, “Lan Mingyue, this is also my sister. If you call her a vixen again, believe it or not, I’ll sew your mouth shut! And, apologize to my sister!”<br/><br/>Gao Yanxin and Xiao Jinli siblings,<br/><br/>Lan Mingyue’s face suddenly turned pale.<br/><br/>She never expected that these two men who were related to her would defend the vixen like this.<br/><br/>Unable to bear the humiliation, Lan Mingyue bit her lip, tears filling her eyes as she ran away in grievance.<br/><br/>As she ran, she silently vowed that she would get back all the humiliation she had suffered today from that woman a hundredfold, even a thousandfold.<br/><br/>The annoying person had left.<br/><br/>Jiang Xile looked at the three of them, raised his eyebrows, and asked with a puzzled and curious tone, “It seems you guys have known each other for a long time? And why do you call Mr. Su as Xiao Siqian?”<br/><br/>He didn’t have much interaction with Su Yichen, but he was a influential figure in Capital City.<br/><br/>Su Yichen was the pride of the wealthy families of the Capital City, and Jiang Xile was the third generation of the renowned Jiang Family in Capital City.<br/><br/>Although they had no interaction, they had both heard of each other.<br/><br/>“It’s a long story,” Xiao Jinli said, “Let’s go to the box first.”<br/><br/>However, once they entered the box, Xiao Jinli realized, “Brother Siquan, did you invite guests?”<br/><br/>Su Yichen smiled and said, “Indeed, I invited General Manager Zhang of Licheng Group.”<br/><br/>“Then shall we get together some other day?” Gao Yanxin suggested.<br/><br/>Businessmen value credibility above all else. Since he had invited someone, as the host, he couldn’t break his promise to the guest, could he?<br/><br/>Xiao Jinli also agreed, “Brother Siquan, I’ll be in Capital City for a while. Let’s make a date another time. Also, our private room is next door.”<br/><br/>Su Yichen was delighted to meet Xiao Jinli and Gao Yanxin. If he had known in advance that he would meet them here, he wouldn’t have made an appointment with General Manager Zhang no matter what.<br/><br/>But Su Yichen also knew he couldn’t break his promise to others, so he reluctantly agreed, “Okay, let’s make another appointment.”<br/><br/>Gao Yanxin said, “Siquan, my phone number hasn’t changed. You can just call me when you’re free. My sister is sometimes very busy and may not have time to answer the phone.”<br/><br/>“Alright, I got it,” Su Yichen nodded and replied.<br/><br/>When Xiao Jinli came out of the box, she happened to meet General Manager Zhang and two other people who had come to attend the appointment.<br/><br/>As a member of the upper class, he immediately noticed Jiang Xile and his face was filled with surprise and joy.<br/><br/>“You   Are you the Ninth Young Master?” General Manager Zhang asked respectfully.<br/><br/>Jiang Xile just gave him a slight nod, then turned to Su Yichen and said, “Brother Su, we’ll be leaving first. Let’s meet up some another time when we have a chance.”<br/><br/>After that, the three of them left.<br/><br/>Watching their departing figures, General Manager Zhang curiously asked, “Mr. Su, are you very close with the Ninth Young Master?”<br/><br/>Su Yichen shook his head, “Not very!”<br/><br/>He was telling the truth.<br/><br/>Today was their first contact.<br/><br/>“Haha  ” General Manager Zhang laughed and said, “Mr. Su, you are too modest. If you guys aren’t close, would the Ninth Young Master address you as Brother Su? Who in the Capital City doesn’t know that very few people can make those princes address them as brothers?”<br/><br/>Su Yichen,<br/><br/>They really were not close.<br/><br/>However, he knew that Jiang Xile had taken a liking to him.\t\t\t\t\t\t</div>", "images": {}, "success": true}