{"id": 245, "url": "https://www.novelhall.com/the-lucky-star-blessing-the-whole-village-32483/14344343.html", "title": "Chapter 245 - Chapter 245: Chapter 245: (First Update)", "volume": 3, "volume_title": "Volume 3", "body": "<h1>Chapter 245 - Chapter 245: Chapter 245: (First Update)</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 245: Chapter 245: (First Update)<br/><br/>Translator: 549690339<br/><br/>Jiang Xile took Xiao Jinli and Gao Yanxin to Old Huang’s Private Kitchen — a famous gourmet food in the Capital City’s upper-class circle.<br/><br/>Jiang Xile looked at the restaurant’s sign and explained, “The owner of this restaurant has the last name Huang, and it is said that his ancestors were royal chefs.<br/><br/>The founder, Huang Tianyou, was once captured to cook for the enemy army during the troubled years.<br/><br/>Later, he utilized the principles of mutual promotion and restraint among foods to defeat the enemy leader. Under the headless situation, he helped our army reach the heart of the enemy and achieved a dramatic victory, earning Huang Tianyou a great merit. After the establishment of the new country, he founded Old Huang’s Private Kitchen.”<br/><br/>He introduced the place while walking into the restaurant.<br/><br/>The waitress saw Jiang Xile and greeted him immediately, “Ninth Young Master, you’re here?”<br/><br/>Jiang Family’s Ninth, known as the Ninth Young Master in the Capital City’s upper-class circle.<br/><br/>Jiang Xile replied, “I brought my sister and brother to have a meal.”<br/><br/>The waitress asked, “Do you want a private room or to eat in the lobby?”<br/><br/>“A private room!” Jiang Xile said.<br/><br/>The waitress led them to a private room.<br/><br/>As they were about to go up the stairs, a surprised voice called out, “Ninth Brother, are you also eating here?”<br/><br/>Before Jiang Xile could react, a girl in a pink princess dress, holding a white limited-edition handbag, rushed towards him.<br/><br/>As she was about to embrace him, Jiang Xile immediately jumped a step back, dodging the girl’s hug. The inertia almost made the girl fall, but the waitress quickly pulled her back.<br/><br/>Lan Mingyue complained with a wronged face, “Ninth Brother, how could you do this? You almost made me fall!”<br/><br/>Jiang Xile immediately waved his hand, “Stop, I’m not your Ninth Brother, and we’re not that close. Miss Lan, please call me Ninth Young Master, OK?”<br/><br/>Lan Mingyue disagreed, “How could we not be close? Your Third Sister-in-law is my second sister, and we’re a family now. I’m right to call you Ninth Brother, right?”<br/><br/>Actually, she knew that the Jiang Family wanted a daughter. Since her family didn’t have one, they thought of adopting one.<br/><br/>She pretended to be well-behaved and clever in front of the Jiang Family, hoping to get their approval.<br/><br/>However, the Jiang Family only praised her for being clever and adorable on the surface, but never mentioned letting her be their daughter.<br/><br/>Xiao Jinli raised her eyebrows, somewhat speechless.<br/><br/>This relative could be considered as such. However, it indeed could be.<br/><br/>After all, Jiang Xile was her Little Uncle, and the girl opposite was his Third Sister-in-law’s sister.<br/><br/>Jiang Xile said with a dark face, “I told you I’m not close with you. Your second sister is my Third Sister-in-law, but it doesn’t mean you’re my sister. So, please, Miss Lan, don’t recklessly claim relations.”<br/><br/>This made Lan Mingyue even more wronged. She bit her lip, the corners of her eyes shining like pearls about to fall. With a tearful expression like a pear flower, she really made people feel pity and love.<br/><br/>But she seemed to have encountered Jiang Xile, who didn’t pity the jade and treasure it.<br/><br/>However, before Jiang Xile could speak, two men, or rather, two boys who followed Lan Mingyue walked in. They looked underage.<br/><br/>Oh, Lan Mingyue was about fifteen or sixteen years old.<br/><br/>“How can you be like this, bullying a girl?” Wang Yunfei said angrily.<br/><br/>Jiang Xile frowned, his eyes sharp as he asked, “Who are you? How did I bully a girl? I just asked her not to call me Ninth Brother, what’s wrong with that?”<br/><br/>“I   I am from the Wang Family,” Wang Yunfei introduced, “Do you know the Wang Family? They are a great family in Capital City. Do you know Wang Jingfei? He is my cousin!”<br/><br/>Unexpectedly, as soon as he finished speaking, Lan Mingyue’s face changed, and she cursed in her heart, “This fool, he came up and compared his family background to others. He, a collateral of a rich family, can’t even compare to a single one of their toes.”<br/><br/>Of course, Lan Mingyue didn’t say anything.<br/><br/>Jiang Xile listened to the other party’s self-announcement and instantly laughed.<br/><br/>“Oh, so you are from the Wang Family. I apologize for my rudeness!” Jiang Xile said with a smile, “Then may I ask Young Master Wang, can I go now?”<br/><br/>Wang Yunfei was very proud and arrogant, “Hmph, as long as you know that I am the Young Master Wang, kneel and apologize to Miss Lan, and I will forgive you!”<br/><br/>Jiang Xile,<br/><br/>Waitress,<br/><br/>Did he make a mistake? Where did this Young Master Wang come from like a soil pimp? He didn’t even recognize the Ninth Young Master of the Jiang Family, and dared to brazenly ask the Ninth Young Master to kneel and apologize!<br/><br/>Really admire his courage, digging a foot on the God of Wealth’s head.<br/><br/>Lan Mingyue’s face changed instantly, and she shook her head, “No   no need for Ninth Brother to apologize!”<br/><br/>Seeing Lan Mingyue’s expression, Wang Yunfei thought she was afraid, and immediately comforted her, “Mingyue, you don’t have to be afraid, he wouldn’t dare do anything to you.”<br/><br/>Jiang Xile looked at the self-righteous Wang Yunfei and laughed even more.<br/><br/>He chuckled, “That’s right, I wouldn’t dare do anything to her. However,”<br/><br/>His expression changed, and he kicked Wang Yunfei with one leg, shouting loudly, “Who do you think you are, showing off your status in front of me?”<br/><br/>Then, he ordered the waitress, “Get these three out of here. They’re upsetting the guests’ appetite!”<br/><br/>“Yes, Ninth Young Master!” The waitress responded respectfully.<br/><br/>Wang Yunfei was kicked to the ground by Jiang Xile, his face twisted. Rage filled his eyes and he shouted in anger, “Dog  ” Before the swearing was out, another young man named Chen Binbin immediately stepped forward to cover his mouth and said, “Fool, do you want to get beaten and even drag me down? Can’t you see that the waitress and the guests here are very respectful to this man?”<br/><br/>Hearing that even she was going to be driven out, Lan Mingyue’s face changed again.<br/><br/>Her eyes turned red, making her look even more wronged. She defended herself, “Ninth   Ninth Young Master, Young Master Wang just made a thoughtless remark. It’s said, ignorance is innocence. You are a generous person, please forgive him this time.”<br/><br/>Her words were clever, only blaming Wang Yunfei.<br/><br/>Jiang Xile was disgusted with this pretentious woman.<br/><br/>He waved his hand and said, “Lan Mingyue, in consideration of my Third Sister-in-law, your second sister, I will forgive you this time. But if there’s a next time, don’t blame me for not being polite. Sister, Brother Gao, let’s go and don’t let these unrelated people affect our appetite.”<br/><br/>As soon as Lan Mingyue heard the word “sister,” she became sensitive and immediately noticed that there was a girl standing beside him. But this girl was half-covered by another boy, so she didn’t notice her from the beginning.<br/><br/>But this girl was called “sister” affectionately by Jiang Xile, which made her feel extraordinary.<br/><br/>Although she didn’t have much contact with the Jiang Family, she knew from her second sister that the Jiang Family, although fond of daughters, would not be close to a girl, just superficially passing it.<br/><br/>Seeing that Jiang Xile was about to leave with the others, Lan Mingyue immediately thickened her face and said, “Ninth Young Master, can I eat with you?”<br/><br/>Jiang Xile did not wear his heart on his face, and coldly replied, “I’m not willing!”\t\t\t\t\t\t</div>", "images": {}, "success": true}