{"id": 244, "url": "https://www.novelhall.com/the-lucky-star-blessing-the-whole-village-32483/14344341.html", "title": "Chapter 244 - Chapter 244: Chapter 244: (Second Update)", "volume": 3, "volume_title": "Volume 3", "body": "<h1>Chapter 244 - Chapter 244: Chapter 244: (Second Update)</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 244: Chapter 244: (Second Update)<br/><br/>Translator: 549690339<br/><br/>Upon hearing the terrified cry from outside, Jin Xiangxue quickly left the break room, running towards the lobby where the yelling took place.<br/><br/>Xiao Jinli and the others followed behind.<br/><br/>Seeing the patient’s face turn purple and bleeding from all orifices, Jin Xiangxue’s face turned pale and immediately ordered the nurse, “Bring me my Silver Needle.”<br/><br/>Doctor Jin had also arrived by then.<br/><br/>Seeing the symptoms, his face changed slightly as well.<br/><br/>Everyone made way for Doctor Jin when he approached.<br/><br/>The patient’s family members cried and begged, “Doctor Jin, please save my Grandfather.”<br/><br/>Doctor Jin said, “You need to lay him flat first; he cannot be moved right now.”<br/><br/>The family members carefully set the patient down as instructed.<br/><br/>The nurse quickly brought the Silver Needle.<br/><br/>Doctor Jin took the needle and aimed it in one direction.<br/><br/>Xiao Jinli’s face changed, and she immediately ran to his side, whispering something in his ear.<br/><br/>Doctor Jin’s face changed again, and when he applied the needle again, he had already changed the direction and acupoints.<br/><br/>Soon, after he skillfully inserted several needles, he checked the patient’s pulse and said to the family, “Your grandfather needs to be hospitalized immediately. Let the nurse arrange an emergency room for you.”<br/><br/>“Thank you, Doctor Jin!” The patient’s family expressed their gratitude.<br/><br/>Doctor Jin immediately ordered Jin Xiangxue, “The acupuncture can’t be removed yet. Come find me after the patient’s room is arranged. There can be no mistakes in the whole process; you must keep a close watch.”<br/><br/>“Yes, Grandfather!” Jin Xiangxue replied.<br/><br/>After the patient was settled, Doctor Jin went to the break room.<br/><br/>Applying the needles just now had drained his energy, and he needed to rest.<br/><br/>As soon as he entered the break room, he bowed to Xiao Jinli and said gratefully, “Girl, I really can’t thank you enough. If it weren’t for you, my needle would have killed the patient. I might have caused a medical accident.”<br/><br/>If the patient’s family made a fuss, his reputation as a divine doctor would be ruined, and he might become a quack.<br/><br/>Xiao Jinli laughed and said, “Doctor Jin, you are too polite. Saving a life is worth more than building a seven-story pagoda. Since I encountered this situation, I couldn’t just stand by and do nothing!”<br/><br/>It was also Doctor Jin’s luck that she came to Baorentang today and encountered an emergency patient.<br/><br/>This emergency patient had a particularly rare condition.<br/><br/>If the patient hadn’t had an attack, Doctor Jin’s initial acupuncture direction would have been correct.<br/><br/>However, once the patient had an attack, the condition worsened, and the treatment had to be adjusted urgently.<br/><br/>Xiao Jinli whispered the emergency acupuncture method for this condition to Doctor Jin.<br/><br/>If the patient’s attack hadn’t happened at Baorentang but at home or another place, and if emergency treatment hadn’t been implemented within three minutes of the attack, the patient would have lost vital signs.<br/><br/>In the past, there had been patients with such conditions, but Doctor Jin hadn’t been able to administer emergency treatment in time, and the patient might have died.<br/><br/>However, nowadays, more and more patients prefer to choose Western medicine for treatment.<br/><br/>After hearing this, Doctor Jin said regretfully, “I’ve encountered patients with such conditions before, and I thought it was because we didn’t rescue them in time that they passed away. It turns out that my emergency treatment method was wrong.”<br/><br/>Xiao Jinli comforted him, “Doctor Jin, don’t feel too much regret. Maybe it was just their fate.”<br/><br/>Doctor Jin heaved a heavy sigh, “Maybe so!”<br/><br/>If the patient hadn’t had the attack at Baorentang today, and if he hadn’t been on duty today, or if Xiao Jinli hadn’t been there, he would never have known that this disease could actually be cured during an attack.<br/><br/>So, it’s unclear whether it was the patient’s luck or his own luck.<br/><br/>Jiang Xile also comforted him, “Doctor Jin, it’s not your fault. You don’t need to be too upset! People can make mistakes, and even horses can trip. Besides, you’ve already done a great job. You’ve saved countless patients, and many people are grateful to you.”<br/><br/>Xiao Jinli nodded, “That’s right, Doctor Jin, you’ve saved countless patients. Many people are grateful to you and consider you a divine doctor in their hearts. You don’t need to be too bothered.”<br/><br/>Doctor Jin said, “I’m not bothered, just slightly regretful. Compared to Doctor Xiao, I need to further improve my medical skills.”<br/><br/>Xiao Jinli couldn’t tell him that she was an exception, not of this era, and had a Golden Finger.<br/><br/>Xiao Jinli laughed and said, “Doctor Jin, you can write a book about your life’s experience in treating illnesses so that others can better understand the greatness of Traditional Chinese Medicine.”<br/><br/>Doctor Jin replied with a smile, “I’m already organizing it. I want to write about the most classic cases for future generations to learn from.”<br/><br/>At this point, Doctor Jin remembered to ask, “Girl, why did you come here today? Do you have something going on?”<br/><br/>Xiao Jinli laughed and said, “I’m here to find some herbs to treat Elder Zeng’s illness.”<br/><br/>“What kind of herbs do you need? I can ask someone to find them,” Doctor Jin said, “Girl, can Old Zeng’s illness really be cured?”<br/><br/>Even with his medical skills, it was difficult to do conservative treatment, let alone a cure.<br/><br/>Xiao Jinli laughed, “It can be cured. However, the herbs are hard to find, so I came here first. If I can’t find them here, I’ll have to look elsewhere!”<br/><br/>“Oh, what herbs do you need?” Doctor Jin asked, “Let’s see if we have them.”<br/><br/>Xiao Jinli mentioned several precious and rare herbs.<br/><br/>Doctor Jin frowned and said, “The herbs you need are hard to find in ordinary pharmacies. Tong Ren Tang, Zijin, Magnolia Bark, Yellow Bark, Tian Dong, and Cordyceps are available here, but the aged Reishi Ginseng and Snow Lotus Flowers are very rare and valuable, and are likely only found in private collections. I have a century-old Reishi. I don’t have the other two herbs.”<br/><br/>He had a treasured Ginseng, but its age wasn’t enough.<br/><br/>Xiao Jinli nodded, “Thank you, Doctor Jin. I’ll figure out a way to get the other herbs.”<br/><br/>Doctor Jin sighed quietly, “Even if late-stage cancer patients can be cured, the herbs required are too precious and scarce to be used for widespread treatment.”<br/><br/>Perhaps only the wealthy and nobles could afford the treatment.<br/><br/>Although Doctor Jin had a compassionate heart for the poor, he was helpless to save more patients.<br/><br/>This was the sadness and helplessness of being a doctor.<br/><br/>After selecting the herbs, Xiao Jinli left Baorentang.<br/><br/>“Sis, where do you want to go now?” Jiang Xile asked.<br/><br/>Xiao Jinli asked, “Ninth Brother, do you have any recommendations?”<br/><br/>Jiang Xile said, “It’s almost noon, let’s go eat first. After lunch, I’ll take you to visit some attractions in the Capital City.”<br/><br/>The Capital City had been the capital for a long time, and there were many places to visit.<br/><br/>One or two days wouldn’t be enough to visit them all.<br/><br/>Xiao Jinli nodded and said, “Alright, let’s follow Ninth Brother’s plan!”\t\t\t\t\t\t</div>", "images": {}, "success": true}