{"id": 256, "url": "https://www.novelhall.com/the-lucky-star-blessing-the-whole-village-32483/14344368.html", "title": "Chapter 256 - Chapter 256: Chapter 256: (Second Update)", "volume": 3, "volume_title": "Volume 3", "body": "<h1>Chapter 256 - Chapter 256: Chapter 256: (Second Update)</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 256: Chapter 256: (Second Update)<br/><br/>Translator: 549690339<br/><br/>After taking Old Master Ji’s pulse, Xiao Jinli smiled and said, “Elder Ji, your body is not in bad shape, just some common geriatric illnesses like high blood pressure and a mild case of gastroenteritis. Your body is quite good.”<br/><br/>Upon hearing Xiao Jinli’s words, Old Master Ji secretly breathed a sigh of relief. It was Xiao Jinli who diagnosed Old Master Yuan’s brain cancer and Elder Zeng’s late-stage pancreatic cancer, not the hospital or Doctor Jin.<br/><br/>As a result, the elderly cadres in the nursing home were all panicking. Whenever someone coughed or felt dizzy, they would doubt whether they had contracted a serious illness.<br/><br/>However, going to the hospital for a check-up would require a lot of hassle, and even if there were no problems, the trouble itself might cause illness.<br/><br/>Now, everyone wanted to go to Elder Jiang’s courtyard and let his granddaughter take their pulse.<br/><br/>But there wasn’t a proper reason to go, and not every person in the big courtyard had a good relationship with Old Jiang’s family, and some of them belonged to rival families.<br/><br/>In the past few days, Old Master Ji had been feeling a bit dizzy and uncomfortable in his abdomen, so he thought about coming over to have a look.<br/><br/>Now that he had heard Xiao Jinli’s words, he was a little relieved but still asked, “Doctor Xiao, I’ve had some dizziness and abdominal pain these two days, especially nausea in the morning when I wake up.”<br/><br/>Xiao Jinli smiled and said, “Elder Ji, have you been worrying too much these past few days?”<br/><br/>Upon hearing this, Old Master Ji immediately understood and asked, “So you mean, my symptoms were caused by anxiety and worry?”<br/><br/>Xiao Jinli nodded, “Haven’t you been having trouble sleeping and eating during these days?”<br/><br/>“Yes.” Old Master Ji did not hide the truth. These past few days, he had been worried about his health, and the more he worried, the more sleep seemed to evade him.<br/><br/>Xiao Jinli smiled and said, “Grandfather Ji, you can rest assured that your body is quite good. I will prescribe you two herbal formulas to regulate your body.”<br/><br/>Old Master Ji asked somewhat anxiously, “What about my high blood pressure and gastroenteritis?”<br/><br/>“They will be cured together!” Xiao Jinli said, “Your body is quite good, and your geriatric diseases are not severe. You only need to take the medicine for seven days, and you don’t need acupuncture or herbal baths to cure some of the old illnesses in your body.”<br/><br/>Upon hearing this, Old Master Ji felt relieved.<br/><br/>He nodded and said, “Alright, thank you so much.”<br/><br/>Afterwards, Xiao Jinli took the pulses of the other elderly men one by one.<br/><br/>The symptoms that Xiao Jinli diagnosed after taking their pulses were basically the same as the diagnoses made by the hospital and Doctor Jin. Apart from some geriatric diseases and chronic old illnesses, no one had any serious illnesses, just varying degrees of severity.<br/><br/>Some people had slightly more severe illnesses and needed acupuncture and herbal baths, while others had milder illnesses and only needed to take a few prescriptions.<br/><br/>After Xiao Jinli’s round of pulse-taking, the old men who came were all relieved.<br/><br/>The elderly men who came here didn’t doubt Xiao Jinli’s medical skills.<br/><br/>By the time they sent all the elderly men away, it was already 10 o’clock at night.<br/><br/>Looking at his somewhat haggard granddaughter, Old Master Jiang said with concern, “Little Li, you’ve really worked hard. If you don’t like it, I’ll drive them away if they ever come knocking again.”<br/><br/>His granddaughter’s excellent medical skills and recognition from others made him very happy and proud.<br/><br/>However, seeing his granddaughter so tired, he couldn’t help but feel heartbroken.<br/><br/>Xiao Jinli shook her head, “Grandfather, I’m fine. In the future, if someone comes to visit, let’s make appointments in advance.”<br/><br/>Elder Jiang immediately agreed, “Yes, make appointments first!”<br/><br/>There are several hundred elderly cadres in the entire nursing home. If they all heard the news and came knocking one after another, Xiao Jinli would certainly be overwhelmed with work.<br/><br/>Moreover, she didn’t plan to stay in the capital for a long time, and she certainly couldn’t stay in Elder Jiang’s yard for the long term.<br/><br/>She planned to go home after Elder Zeng no longer needed acupuncture and herbal baths.<br/><br/>The village’s crops were about to hit the market, and she needed to go back and oversee things.<br/><br/>No matter how far she went, her family and hometown would always be her greatest concerns.<br/><br/>The next day, Old Master Ji and Old Master An came.<br/><br/>They brought their gratitude gifts with them.<br/><br/>Old Master Ji said with great pleasure, “Girl, it’s been so long since I slept as well as I did last night. Your medical skills are really amazing!”<br/><br/>He gave a thumbs up and praised, “Truly a miraculous medical skill.”<br/><br/>Last night, after Xiao Jinli took his pulse, she gave him a pill, saying that it would help him sleep.<br/><br/>That night, he slept soundly and didn’t even wake up in the middle of the night.<br/><br/>In the past, he would get up at least once a night.<br/><br/>Old Master An also said, “I slept very well last night too. Young girl, your superb medical skills at such a young age are truly admirable.”<br/><br/>He had been a battlefield hero all his life and had only admired a few people, but now he sincerely admired Xiao Jinli.<br/><br/>He had said that Doctor Jin had good medical skills, but he never said he admired him.<br/><br/>He thought that a good doctor’s medical skills were simply part of his job and responsibility.<br/><br/>Doctor Jin’s medical skills were good, but they were also built up over time.<br/><br/>But Xiao Jinli’s medical skills were truly a combination of talent and hard work. After all, she was only a teenager, just a child.<br/><br/>Xiao Jinli smiled and said, “I am a doctor, and it is my duty to heal patients.”<br/><br/>Old Master Ji took out a property certificate and said, “Girl, I don’t have anything valuable on me. I have a house in the capital, and I’ll give it to you.”<br/><br/>With that, he handed the property certificate to Xiao Jinli.<br/><br/>Xiao Jinli took the property certificate and opened it to take a look.<br/><br/>It was a 150-square-meter house in the Second Ring Business Center of the capital city.<br/><br/>Gao Yanxin’s mouth hung open in surprise.<br/><br/>In the land-scarce capital city, you had to have considerable wealth to buy a house, which was like climbing to the sky.<br/><br/>Ordinary houses in the fifth and sixth rings cost several million each, let alone the commercial center in the second ring where the housing prices reached over a hundred thousand per square meter.<br/><br/>Old Master Ji’s house covered a large area, so the value was at least 15 million yuan.<br/><br/>He didn’t even blink before giving it away, and Gao Yanxin couldn’t help but admire.<br/><br/>From what Gao Yanxin knew, he thought that Xiao Jinli would refuse the offer.<br/><br/>Xiao Jinli smiled and said, “Grandfather Ji, I will accept it then.”<br/><br/>Seeing Xiao Jinli accepting the house, Old Master Ji finally put his heart at ease.<br/><br/>He said, “I’m glad you can accept it.”<br/><br/>Wealth is something that doesn’t come with birth or death.<br/><br/>He would rather live a few more good years.<br/><br/>As long as Xiao Jinli accepted his things, she would naturally treat his body with care.<br/><br/>Of course, his previous work environment had instilled a certain amount of suspicion in him, and he was unable to change even after retiring for ten to twenty years.<br/><br/>Old Master An gave Xiao Jinli a high-grade glass jadeite bracelet, worth two or three million yuan.<br/><br/>Xiao Jinli still accepted it.<br/><br/>With curiosity in his heart, Gao Yanxin wondered why his cousin would accept such valuable thank you gifts from them.<br/><br/>After that, other elderly men came one after another, each bringing their own thank you gifts.<br/><br/>Most of the thank you gifts were worth over a million yuan.<br/><br/>Gao Yanxin’s mouth hung open, thinking to himself, “My cousin suddenly became a multi-millionaire.”\t\t\t\t\t\t</div>", "images": {}, "success": true}