{"id": 254, "url": "https://www.novelhall.com/the-lucky-star-blessing-the-whole-village-32483/14344364.html", "title": "Chapter 254 - Chapter 254: Chapter 254: (Second Update)", "volume": 3, "volume_title": "Volume 3", "body": "<h1>Chapter 254 - Chapter 254: Chapter 254: (Second Update)</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 254: Chapter 254: (Second Update)<br/><br/>Translator: 549690339<br/><br/>A table full of food, and everyone rushed for the vegetables.<br/><br/>As they looked at the empty plates with their chopsticks, they couldn’t help but ask, “Are there no more vegetables?”<br/><br/>Gao Yanxin couldn’t help but say, “Old man, aren’t there still a few plates of other dishes on the table?”<br/><br/>These other dishes were previously the old men’s favorite meat dishes, but now, not a single chopstick had touched them.<br/><br/>Elder Jiang said, “We’ve eaten these dishes so often, they’ve become somewhat tiresome.”<br/><br/>Gao Yanxin,    He didn’t know if Elder Jiang was really tired of them, but whenever they ate together, any dish they ordered themselves was usually finished completely.<br/><br/>“That’s right, eating too much meat isn’t good for our health. From now on, let’s eat less meat and more vegetables and fruits,” Old Master Chen said.<br/><br/>Gao Yanxin,    Ever since they stopped needing to be on a strict diet, the once meat-loving old masters were now advocating eating less meat and more vegetables. If he hadn’t heard it for himself, he would have thought they had become different people.<br/><br/>Old Master Yuan, Old Master Li, and now Old Master Zeng, who had come to mooch off a meal, nodded and said, “That’s right, at our age, we should eat less meat and more vegetables and fruits.”<br/><br/>Gao Yanxin,    After just one meal at his cousin’s home, their taste for food had changed.<br/><br/>However, this was indeed expected.<br/><br/>After all, he himself was an example.<br/><br/>In the past, he didn’t even like green vegetables, but now, as long as it was from Xiao Family Village, he loved it all.<br/><br/>With the vegetables on the table gone, the old men were still craving more, so Elder Jiang immediately had people cook a few more plates of vegetables.<br/><br/>Soon, the kitchen served up five more vegetarian dishes.<br/><br/>After they finished these plates, they finally felt full.<br/><br/>However, seeing the untouched meat dishes on the table, the always frugal old men frowned.<br/><br/>They couldn’t eat any more meat dishes.<br/><br/>Elder Jiang said, “Xiao Li, Xiao Zhang, take these dishes and eat them.”<br/><br/>Xiao Li and Xiao Zhang didn’t eat with the old men.<br/><br/>Mainly because their tastes were different.<br/><br/>The old men preferred lighter tastes, while the younger people preferred heavier tastes.<br/><br/>Most of the time, these young people ate in the cafeteria.<br/><br/>However, since the old men no longer needed to be on a strict diet, the taste of the dishes had become slightly heavier.<br/><br/>After they had eaten their fill, the old men took a walk in the yard to help with digestion.<br/><br/>Old Master Yuan smiled and asked, “Girl, are the vegetables in your village all like this?”<br/><br/>Xiao Jinli nodded, “Yes. This year is the first time our Xiao Family Village has grown vegetables and established a company. The company’s mission is to create pollution-free green food. However, the company’s products haven’t hit the market yet, and we don’t have our own brand.”<br/><br/>“I see!” Old Master Yuan nodded, “I remember you mentioning that your village is beautiful and picturesque, and a great place for recuperation, right?”<br/><br/>“Yes!” Xiao Jinli nodded, “I’m currently having the company plan to build a nursing home for guests.”<br/><br/>Old Master Chen and the others thought about it seriously.<br/><br/>After a while, Old Master Chen said, “Girl, once Old Zeng’s illness improves, I’ll go visit your village.” A village that could raise such a crystal-clear child must be very beautiful.<br/><br/>Xiao Jinli smiled and said, “You’ll be more than welcome! Our village has not only beautiful scenery and fresh air, but also very good-hearted and simple people who are easy to get along with.”<br/><br/>“Ha ha, you’re such a darling,” Old Master Yuan laughed, “It’s obvious that you love your hometown very much.”<br/><br/>“Yes, I love my hometown!” Xiao Jinli didn’t deny it.<br/><br/>Gao Yanxin also chimed in, “Grandpa Yuan, you don’t know, in Xiao Family Village, from old to young, everyone loves my cousin. Even the dogs in the village only listen to my cousin. And on top of that, the whole village growing vegetables and establishing a company this year were all suggested by my cousin. The villagers invested land as shares and all supported her.”<br/><br/>“Oh, really?” Old Master Li asked curiously, “The whole village listens to a child?”<br/><br/>“Yes.” Gao Yanxin nodded, “The villagers, old and young, all trust my cousin very much. Her prestige in the village surpasses that of the village head. Since she was young, she has helped handle village affairs, and the villagers often consult her on major issues.”<br/><br/>The old masters were amazed.<br/><br/>An entire village listening to a child, all growing vegetables and establishing a company wasn’t child’s play. Yet, everyone was so united and cohesive, following a child’s lead.<br/><br/>“Girl, you’re really something else.” Old Master Yuan praised, “I’m curious about how your brain works. You’re smart and capable. If I didn’t know better, I’d think you were a mature and steady adult.”<br/><br/>“That’s true.” Old Master Li nodded, “She looks like an ordinary girl, but the things she does are extraordinary.”<br/><br/>Xiao Jinli laughed and said, “Grandpa Li, I just do what I can. My hometown has nurtured me, and the villagers love and trust me. I just wanted to help them find a way to get rich. At the same time, I’m grateful to the people of my hometown for supporting and trusting me.”<br/><br/>“Kind villagers raise kind children.” Elder Jiang said, “Girl, when Old Zeng fully recovers from his illness, I’ll go visit your hometown.”<br/><br/>“Great!” Xiao Jinli nodded, “The villagers will definitely welcome the arrival of the old masters.”<br/><br/>“Ha ha  ”<br/><br/>Due to the delicious aroma from Elder Jiang’s cooking at noon, even the dogs in the yard were attracted by the scent.<br/><br/>Others in the courtyard thought that the aroma would only last for lunch, but when evening came, the aroma once again filled the entire nursing home, making many people restless.<br/><br/>“This seems to be coming from Elder Jiang’s yard, what are they cooking? It was so fragrant at noon, and now it’s even more so in the evening.” Old Master Ji said while walking, “I’m going to take a look.”<br/><br/>“I’ll go too.” Old Master An got up and said, “Elder Jiang and the others are really inconsiderate. I heard that they’ve been eating and drinking lavishly without any dietary restrictions.”<br/><br/>“Their bodies have been adjusted by a doctor, so they don’t need to be on a strict diet anymore.” Old Master Ji said.<br/><br/>Old Master An said, “Previously, Old Yuan had brain cancer, and it was cured in just over a month. Now Old Zeng has pancreatic cancer, and the doctor who treated Old Yuan is treating him too. I heard his condition has improved significantly. The day before yesterday, I visited Old Zeng, and he had gone to the hospital to have another check-up. The doctor said that the activity of cancer cells in his body has significantly decreased, and after a period of treatment, he should be cured.”<br/><br/>“I heard that the doctor, not only has better medical skills than Doctor Jin, but is also a child.”<br/><br/>“Then let’s go see the true face of this legendary doctor today.”<br/><br/>Most importantly, they wanted the same doctor to adjust their bodies as well.\t\t\t\t\t\t</div>", "images": {}, "success": true}