{"id": 250, "url": "https://www.novelhall.com/the-lucky-star-blessing-the-whole-village-32483/14344351.html", "title": "Chapter 250 - Chapter 250: Chapter 250: (Second Update)", "volume": 3, "volume_title": "Volume 3", "body": "<h1>Chapter 250 - Chapter 250: Chapter 250: (Second Update)</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 250: Chapter 250: (Second Update)<br/><br/>Translator: 549690339<br/><br/>“This Lan Mingyue,” Jiang Xile said angrily after hearing what his older brothers had told him, “What did our sister do to offend her that she would come to our door and slander her, even adding fuel to the fire?”<br/><br/>Just a moment ago, the Jiang family members had informed him.<br/><br/>“Today, Lan Mingyue came over and said she saw you with a girl. That girl is very indecent and hooked up with three men at the same time, besides you, there were two other men. She even saw them hugging and embracing each other.”<br/><br/>“Bullshit!” Jiang Xile was furious, “One is Gao Yanxin, our sister’s own cousin, and another is Su Yichen, who is also like a sibling to Xiao Jinli and has a good relationship with the Xiao family. How dare she have the guts to slander an innocent girl like this?”<br/><br/>Jiang Xiwen and the others listened with a dark expression on their faces.<br/><br/>They never expected Lan Mingyue to deceive them in such a way. Where did she get the courage?<br/><br/>Didn’t she know that as soon as Jiang Xile returned, her lies would be exposed?<br/><br/>Or was it that the Jiang family really liked her and didn’t dare do anything to her?<br/><br/>Jiang Laoda said with a black face, “This Lan Mingyue is not allowed to step into our Jiang family again!”<br/><br/>He said this while looking at Jiang Laosan.<br/><br/>Jiang Xiping felt his older brother’s gaze and shrugged his shoulders, “I’ll talk to Xingxing about it.”<br/><br/>Anyway, his wife had a bad relationship with the Lan family. As for Lan Mingyue, their cousin, maybe their relationship used to be good, but now he believed that his wife knew better.<br/><br/>Jiang Xile was filled with anger, “What kind of malicious intentions does this Lan Mingyue have? When she called our sister Jinli a vixen, I taught her a lesson. Who would have thought that she would come to our house and twist the facts around? I really underestimated her!”<br/><br/>Jiang Xi’an was also very angry, “An outwardly decent girl with such malicious and scheming intentions, slandering and sowing discord so skillfully!”<br/><br/>He sighed softly, “It’s really our old master who has sharp eyes. He saw through this girl’s intentions and warned us not to judge her by her appearance. If it weren’t for seeing it with our own eyes and hearing it with our own ears, it would be hard to see that such a young girl has two faces.”<br/><br/>Jiang Xiping added, “Isn’t that the truth? When she came to the Jiang family, she was such a well-behaved and sensible girl, but it turned out to be all fake! I wonder how far she could pretend, as she almost deceived all of us!”<br/><br/>After hearing Third Brother’s words, Jiang Xile questioned, “Third Brother, what is the current relationship between Third Sister-in-law and her?”<br/><br/>Jiang Xiping said, “Ever since the old master said that Lan Mingyue’s intentions were impure, Xingxing has gradually distanced herself from her! Otherwise, she wouldn’t have refused Lan Mingyue every time she wanted to come over.”<br/><br/>Jiang Xile asked with doubt, “Then who let her in today? Isn’t it Third Sister-in-law?”<br/><br/>“No!” Jiang Xiping shook his head, “She went straight to Big Brother, saying she saw you playing with a girl, and that girl was indecent and had relationships with two other men at the same time. She was a ‘Queen of the Sea.’ She tried to persuade you, but when you didn’t listen, she went directly to our family.”<br/><br/>Jiang Xile, “Is it that she’s stupid or not? She dared to say such clumsy lies, and she wasn’t afraid to be exposed, causing our family to dislike her even more?”<br/><br/>“That’s not the case.” Jiang Xi’an was also somewhat puzzled, “Usually, she seems to be a very intelligent girl, not likely to do something so foolish, right?”<br/><br/>Jiang Family’s second brother thought for a moment and said, “Perhaps she didn’t expect that sister Jinli was indeed our sister, not just Old Nine’s sister. She told us all this, and then, no matter how Old Nine tried to defend, our impression of that girl would be greatly discounted. Maybe we thought that girl had given Old Nine a love potion, enchanting him to the point where he couldn’t tell right from wrong, otherwise, how could he tolerate a woman who played with three men? Or maybe we thought Old Nine was just fooling around and didn’t take it too seriously, so she didn’t care that much.”<br/><br/>“Damn it!” Jiang Xile was close to cursing, “I thought such clumsy lies were so simple, but it turns out they are so insidious. I really underestimated her.”<br/><br/>“From now on, Lan Mingyue is absolutely forbidden to step foot in the Jiang family.” Jiang Xile gritted his teeth, “If it weren’t for sister Jinli today, my sister and I would never be able to clear our names even if we jumped into the Yellow River.”<br/><br/>“That’s right!” The others echoed, “Such clumsy lies, yet they hid such malicious intentions.”<br/><br/>“Oh, by the way, you just said that our sister knows Su Yichen, what’s the story with that?” Jiang Xiwen asked with puzzlement, “I thought our sister never came to the capital city? How did they meet?”<br/><br/>Jiang Xile shook his head, “To be exact, our sister doesn’t know Su Yichen, but Xiao Siqian instead.”<br/><br/>“Who is Xiao Siqian?” Jiang Xi’an asked curiously, “He has the same last name as Xiao, is he related to our sister?”<br/><br/>“Actually, Su Yichen is Xiao Siqian, and Xiao Siqian is Su Yichen!” Jiang Xile said.<br/><br/>“I’ve never heard of the young master of the Su family having an alias,” Jiang Xiping said with a hint of confusion, “Old Nine, tell us quickly what’s going on. Don’t keep us guessing.”<br/><br/>“No, Xiao Siqian is a temporary name,” Jiang Xile explained. “A few months ago, we all heard about Su Yichen’s disappearance, right? Our sister is the one who saved him in the mountains. They say that when he was rescued, he was injured all over and had to stay in the hospital for ten to twenty days, and had amnesia on top of that.<br/><br/>He knew that he was saved by our sister, so he took the Xiao family’s surname Siqian, which means gratitude for a drop of water and repaying it with a fountain.<br/><br/>He stayed with sister Jinli’s family for the half-year he was missing. The Xiao family treated him like one of their own. However, later Su Yichen accidentally contacted Old Master Xia and returned to the capital city.”<br/><br/>“Oh, so that’s what happened!” The members of the Jiang family nodded in understanding.<br/><br/>“I heard that Su Yichen is also a rising star in the business world,” Jiang Xiping said. “After returning to the Xia family, he worked for the Xia Corporation for just a few months and brought in several major projects that increased the overall revenue of the Xia Corporation by 30%. He is a business prodigy.”<br/><br/>“I’ve heard of him too,” Jiang Xi’an said with a smile, “Now he’s the heir to the Su Corporation. But the fact that he works for the Xia Corporation has made the Chairman of the Su Corporation lose face. He has been rejected by Su Yichen several times, using amnesia as an excuse.”<br/><br/>Jiang Xile said, “There’s a rumor in the business world that Su Yichen’s disappearance was actually orchestrated by his father, who hired people to kidnap and even kill him. That’s why Su Yichen cannot return.”<br/><br/>“Really?” The members of the Jiang family were somewhat surprised by this news. “Why would Su Xiangdong do such a thing?”<br/><br/>“Rumor has it that Su Yichen’s mother left him a huge inheritance, and it was all for that inheritance,”\t\t\t\t\t\t</div>", "images": {}, "success": true}