{"id": 251, "url": "https://www.novelhall.com/the-lucky-star-blessing-the-whole-village-32483/14344353.html", "title": "Chapter 251 - Chapter 251: Chapter 251: (First Update)", "volume": 3, "volume_title": "Volume 3", "body": "<h1>Chapter 251 - Chapter 251: Chapter 251: (First Update)</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 251: Chapter 251: (First Update)<br/><br/>Translator: 549690339<br/><br/>After two to three months of development, Xiao Family Village Lu Xian Ltd has gotten on the right track.<br/><br/>The crops in the fields are lush and green, and the chickens, ducks, and other poultry in the farms are plump and thriving. The technicians who were sent for training take their responsibilities seriously, especially in raising ducks and training other people in the village.<br/><br/>The Village Head approached Xiao Yucheng and asked, “Yucheng, our crops will be ready for harvest soon, and the chickens, ducks, and pigs are already 120 days old, which means they can be sold. Have you found buyers for all of them?”<br/><br/>Xiao Yucheng reassured the Village Head, “Uncle, don’t worry. Xiao Junxuan has already contacted many bosses. When the time comes, we’ll just deliver the goods directly.”<br/><br/>Despite Xiao Yucheng’s reassurance, the Village Head was still worried, “Yucheng, can we really sell so many vegetables and chickens and ducks?”<br/><br/>Not only was the Village Head worried, but so were the other villagers.<br/><br/>People appeared confident, but deep down, many were anxious, especially when they saw the vegetables growing better and the chickens and ducks growing bigger. Many people even had trouble sleeping at night, worrying if these things could be sold.<br/><br/>Xiao Yucheng nodded confidently, “Village Head, you have to trust our village’s products. Our village grows vegetables on several hundred acres of land, which may seem like a lot, but considering the large population in Dragonzhou Country, if we can make our products famous, we might even find several hundred thousand acres too few.”<br/><br/>The Village Head laughed, “This is the first time our village has ever grown vegetables for sale, and we’ve never sold them outside before.”<br/><br/>Xiao Yucheng said, “Uncle Village Chief, please tell everyone not to worry. Our village’s vegetables, chickens, ducks, and the like will definitely be sold. Then, everyone can look forward to the first dividend.”<br/><br/>The Village Head agreed, “Okay, I’ll tell everyone.”<br/><br/>After the Village Head left, Xiao Yucheng called together the company management and the sales department staff for a meeting.<br/><br/>Xiao Yucheng said, “The crops in the fields and the chickens and ducks in the farms will be on the market soon. We have two stores in the county town, three stores in Ganjiang City, and a small store in the town. These stores will need an estimated 6,000 to 7,000 jin of products every day.”<br/><br/>“Junxuan, how many orders do you have in your department?” Xiao Yucheng asked.<br/><br/>Xiao Junxuan reported, “We have orders from the largest hotel and restaurant in the county town, a five-star hotel and three four-star hotels in Ganjiang City, as well as five restaurants, and the fresh market…”<br/><br/>Xiao Junxuan reported all the orders they had received!<br/><br/>“The total amount of vegetables from these orders is 8,000 jin per day, fresh market supply of chickens, ducks, and geese is 6,000 jin per day, and pork is 4,000 jin per day.”<br/><br/>Xiao Yucheng nodded, “Good! As long as we maintain this volume every day, our company’s crops and poultry will be sold out quickly!”<br/><br/>Xiao Junxuan laughed, “I estimate that when the time comes, we’ll worry about not having enough to sell!”<br/><br/>Xiao Yucheng suddenly became serious, “This could be a problem! If we don’t have enough to sell, we’ll have to implement purchase limits!”<br/><br/>“Yes, Mingchen, didn’t our village’s vegetables go for green level evaluation? Has the result come out?” Xiao Yucheng asked.<br/><br/>Indeed, the sales route for Xiao Family Village Green Fresh Company is non-polluting green food. They applied for qualification level assessment from relevant departments two months ago.<br/><br/>However, before the assessment’s results were released, Xiao Junxuan had managed to secure a number of orders for his department, which showcased his ability.<br/><br/>Xiao Mingchen frowned slightly and said, “I contacted the relevant person in charge, and they said they’re still going through procedures?”<br/><br/>“Still going through procedures?” Xiao Yucheng also frowned, “It’s been two months already, and in another ten or twenty days, we’ll start selling our vegetables.”<br/><br/>After thinking for a while, he said, “Mingchen, keep following up and make phone calls.”<br/><br/>“Okay, I got it!”<br/><br/>Xiao Yucheng nodded, “Tomorrow, I’ll hold a village-wide meeting and inform the villagers of this news. The Village Head said everyone is very anxious. Everyone has been working hard these days.”<br/><br/>After the meeting, Xiao Yucheng chatted leisurely with Xiao Junxuan.<br/><br/>“Junxuan, Jinli has been away for a long time. When will she be back?” Xiao Yucheng rubbed his forehead, “Initially, she planned to be away for a month, and the worm feed she left behind was just enough for a month. Our crops will soon be harvested, and we’ll have to plant another round in the fields, so we’ll need to increase the number of earthworms. Also, chickens, ducks, and geese eat earthworms, so we have to consider expanding earthworm breeding. Only my sister can master this technology.”<br/><br/>No one implicitly mentioned that they should ask Xiao Jinli to hand over this technology.<br/><br/>Because the villagers had watched Xiao Jinli grow up and understood her nature.<br/><br/>If she could hand this technology over to others, Xiao Jinli would certainly do so without hesitation.<br/><br/>Xiao Junxuan said, “She is now in the Capital City, treating an old master. She estimates that she’ll need two months.”<br/><br/>Xiao Yucheng laughed, “Considering Jinli’s personality, can she really stay in the Capital City for two months?”<br/><br/>Xiao Junxuan shook his head, “Hehe, sometimes my sister seems calm, but at other times, she’s very lively.”<br/><br/>“Speaking of which, Jinli is really good at hiding her abilities,” Xiao Yucheng laughed, “Silent and unnoticed, she turned out to be a national doctor.”<br/><br/>“Yes, we really were surprised. Who would have thought that growing up under everyone’s watch, she would learn a set of medical skills without anyone knowing?” Xiao Junxuan laughed, “In fact, many things my sister does surprise us, but they seem to be within expectation.”<br/><br/>“That’s right!” Xiao Yucheng nodded, “At a very young age, my sister could help everyone manage village affairs, while other children were still running around with snotty noses.”<br/><br/>“Big brother, I’ll talk to my sister about the earthworms,” Xiao Junxuan said, “Let’s see what she thinks. I heard her mention that some elderly people will come to our village for recuperation in the future, so we might build a nursing home in the village.”<br/><br/>“Build a nursing home?” Xiao Yucheng was slightly puzzled.<br/><br/>Xiao Junxuan nodded, “Jinli didn’t mention the specifics, but I think the construction of a nursing home might be postponed.”<br/><br/>“Alright, I understand,” Xiao Yucheng nodded, “Building a nursing home is a good idea too, as it can attract more tourists to our village. In the future, we can set up a rural tourism and farmstay, which will generate extra income for everyone.”<br/><br/>Xiao Junxuan said, “When the company was first established, Xiao Siqian wrote a plan that included this idea. However, to develop rural tourism and farmstays, we need to proceed step by step. Once our Xiao Family Village products become famous and establish our own brand, tourism and farmstays will basically be established.”<br/><br/>Xiao Yucheng said, “Xiao Siqian is really far-sighted.”<br/><br/>“He is indeed very talented and capable!” Xiao Junxuan nodded in agreement.\t\t\t\t\t\t</div>", "images": {}, "success": true}