{"id": 258, "url": "https://www.novelhall.com/the-lucky-star-blessing-the-whole-village-32483/14344371.html", "title": "Chapter 258 - Chapter 258: Chapter 258: (Second Update)", "volume": 3, "volume_title": "Volume 3", "body": "<h1>Chapter 258 - Chapter 258: Chapter 258: (Second Update)</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 258: Chapter 258: (Second Update)<br/><br/>Translator: 549690339<br/><br/>Since setting foot in the Xia Family, he truly felt the dilemma of being caught between a rock and a hard place.<br/><br/>In just a few words, he learned from his eldest uncle that the Xia Family was also eyeing his biological mother’s inheritance.<br/><br/>He calmly dealt with them, using his current amnesia as an excuse not to touch his biological mother’s inheritance.<br/><br/>However, in the Xia Family, Old Master Xia wanted him to willingly hand over his mother’s inheritance, so he directly allowed Su Yichen to work in his own company and gave him a deputy general manager position with real power, showing his sincerity.<br/><br/>In fact, Old Master Xia’s strategy was simple: conquer the heart!<br/><br/>Just like with Su Xiangdong’s family, as long as he had conquered their sincerity, they would faithfully offer up his mother’s inheritance.<br/><br/>But Su Yichen had already been fooled once and would not be fooled again.<br/><br/>After experiencing a life-and-death ordeal, he could now distinguish who was sincere and who was deceitful.<br/><br/>Xiao Jinli looked at him with a sympathetic expression, and then comforted him, “It’s okay. Just be yourself now! Your mother’s revenge and your hatred are not things that can be resolved overnight. As long as you can keep yourself safe, take it slow, it’s not a problem.”<br/><br/>Su Yichen nodded and said, “Yeah, I will.”<br/><br/>Xiao Jinli said, “My parents, knowing I came to the Capital City, asked me to check on your situation, and they’re really worried about you!”<br/><br/>Su Yichen hardly called Father and Mother Xiao for fear of implicating Xiao Family Village.<br/><br/>He was afraid that if someone took his cell phone to the telecommunications company to check his records, it would cause trouble.<br/><br/>Su Yichen’s eyes reddened, and he choked, “I’m sorry for worrying Uncle and Auntie. When you go back, tell them I’m doing well and ask them not to worry!”<br/><br/>Xiao Jinli nodded and said, “Okay, I’ll let them know.”<br/><br/>Then, Xiao Jinli asked, “Brother Siquan, do you need my help?”<br/><br/>Su Yichen’s expression faltered, and he said, “No, I want to take my revenge personally.”<br/><br/>Xiao Jinli nodded and said, “Okay!”<br/><br/>Next, Xiao Jinli took out a USB drive and said to him, “Brother Siquan, I have some data from Su Corporation and Xia Corporation here. You can take it. How to deal with the things in here and how to use them is up to you.”<br/><br/>These data were, of course, copied from their company’s computer by Xiao Zhi.<br/><br/>Surprised, Su Yichen didn’t ask any questions but just took it and said, “Okay!”<br/><br/>Xiao Family<br/><br/>After arranging five or six rooms, Mother Xiao said, “Husband, are six rooms enough? Should I ask Little Husband’s Younger Brother to help out and make two more rooms available? Little Bao said that there are four old masters and several people taking care of them, totaling more than ten people.”<br/><br/>Xiao Wanshan said, “Little Bao said six rooms should be about right. We can arrange things after they arrive.”<br/><br/>Mother Xiao nodded and said, “Alright, then I’ll have Xuan’er prepare more meat.”<br/><br/>Xiao Wanshan said, “For the meat, just buy it from the company. Chickens, ducks, fish, geese, pigs, and cows are already available for sale. No need to buy from outside.”<br/><br/>As he spoke, Xiao Wanshan paused and said, “Little Bao said those several old gentlemen love our vegetables here. So, just prepare more vegetables to serve when it’s time.”<br/><br/>Mother Xiao nodded her head and said, “Alright.”<br/><br/>Now most people in the village don’t need to go out to buy pork and beef. They raise chickens and ducks at home.<br/><br/>The company now kills a pig every day to sell to the people in the village or surrounding villages.<br/><br/>One pig a day, weighing over 200 jin (Chinese weight unit), is actually not enough to sell.<br/><br/>The pigs raised by the company have tender meat because they are fed the old vegetables from the fields. The meat has no gamey taste and is deliciously fragrant and irresistible when cooked.<br/><br/>The people in the village have come to love such pork. Especially for those who used to be frugal, they used to eat meat only a few times a year at home. But after tasting the pork raised by the company, they can’t get enough. Even the most frugal people will buy some meat to cook at home and satisfy their appetite.<br/><br/>The company kills only one pig a day, so there isn’t enough meat to sell. Therefore, everyone goes early to the company’s slaughterhouse to wait.<br/><br/>People from nearby villages also come early to buy a taste of the pork here.<br/><br/>Luckily, the company kills one pig every day. If they don’t get it today, they can come back tomorrow to buy.<br/><br/>However, it’s hard for families with children. They can’t be happy without meat in every meal. If there’s no meat, they won’t eat.<br/><br/>As a result, in order for their children to eat, people from other villages try very hard. They start lining up as early as 4 or 5 o’clock in the morning.<br/><br/>Of course, there’s one thing: the company kills a pig every day and sells it at a fair price, which is a benefit to the villagers. Each day there is a limit to purchasing. As for people from other villages, they are treated separately.<br/><br/>Naturally, many people from other villages will ask relatives from Xiao Family Village to buy on their behalf.<br/><br/>Besides, people from other villages also have their eyes on the chickens, ducks, and fish raised by the company.<br/><br/>They heard that the company was willing to sell them individually. Therefore, people came from time to time to buy.<br/><br/>So, the company sells at least 30 to 40 chickens and ducks every day. The fish is caught by angling and sells 200 to 300 jin (Chinese weight unit) every day. However, you must book in advance to buy the fish.<br/><br/>But when it comes to weddings and funerals, sales will be even higher.<br/><br/>As for the sale of geese, it’s even less. Firstly, because the price is more expensive, and the weight is heavy. Ordinary villagers can’t afford to buy geese unless they have family functions or invite relatives and friends over.<br/><br/>Buying a goose can cost several hundred yuan.<br/><br/>Who wouldn’t feel the pinch of money?<br/><br/>As for the vegetables in Xiao Family Village, the villagers have their plots of land for their daily consumption and don’t need to buy from the company.<br/><br/>People from outside can buy them, but the price is slightly more expensive than ordinary vegetables.<br/><br/>But when they reach The Town, the price of these vegetables is different.<br/><br/>However, although all the company’s products have reached their marketable period, external sales have not yet begun.<br/><br/>Because they are waiting for Xiao Jinli.<br/><br/>Everyone hopes that when these products start selling, Xiao Jinli can witness the scene with her own eyes. At the same time, only when Xiao Jinli is there, their mood seems to be more stable.<br/><br/>Xiao Jinli is the heart-stabilizing pill for them all.<br/><br/>When Grandpa Jiang and the other old men arrived at Xiao Family Village and saw the endless green crops as soon as they entered the village, they were slightly surprised.<br/><br/>They already knew from Xiao Jinli that the whole village of Xiao Family Village was growing vegetables. But seeing it with their own eyes, they were still very astonished.<br/><br/>Because the vegetables here are just so beautiful – clusters of watery, green, and adorable plants made people want to take a bite of them right there in the field.<br/><br/>Among the people who delivered the several old men to the village were not only caretakers but also security personnel. So, when a row of cars entered Xiao Family Village, it was quite spectacular.<br/><br/>“Why are so many cars coming to the village? Is it a boss coming to buy something?” a villager wondered.<br/><br/>“I heard that Jinli is coming back to the village today, and she brought a lot of guests with her. Could this be Jinli and her guests?”<br/><br/>“Let’s go and have a look!”\t\t\t\t\t\t</div>", "images": {}, "success": true}