{"id": 259, "url": "https://www.novelhall.com/the-lucky-star-blessing-the-whole-village-32483/14344372.html", "title": "Chapter 259 - Chapter 259: Chapter 259: (First Update)", "volume": 3, "volume_title": "Volume 3", "body": "<h1>Chapter 259 - Chapter 259: Chapter 259: (First Update)</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 259: Chapter 259: (First Update)<br/><br/>Translator: 549690339<br/><br/>Several old gentlemen finally saw with their own eyes the extent to which Xiao Jinli was liked in Xiao Family Village.<br/><br/>Before they arrived home, the villagers had heard that Xiao Jinli was returning, and all of them came to greet her with snacks that she liked.<br/><br/>“Jinli, you’re back. Auntie knew you were coming back today, so I made your favorite Tang Ciba this morning. Here, eat some while it’s still fresh.”<br/><br/>As she spoke, she handed Xiao Jinli a bag filled with the glutinous rice cakes.<br/><br/>“Jinli, these are the beef meatballs Auntie made this morning with our own cattle. They are delicious.”<br/><br/>“Jinli  ”<br/><br/>All of them were gathered around Jinli.<br/><br/>“Jinli, you’ve grown taller and prettier in these two months.”<br/><br/>“Yes, our Jinli is getting prettier. They say girls change a lot when they become eighteen, and they just get prettier.”<br/><br/>“Jinli, our village’s vegetables are about to go on sale, and everyone was waiting for your return.”<br/><br/>The guards who came to look after the four old gentlemen couldn’t hide their surprise at the situation.<br/><br/>They knew some children were well-liked by village people.<br/><br/>However, they had never seen a child being liked to this extent, being pampered and cared about by everyone, even the big event of the whole village’s sale of vegetables had to wait for the child to return before starting to sell.<br/><br/>Now they finally understood why Doctor Xiao had been longing to return home while living in Capital City.<br/><br/>Among the guests who came today were people from the Jiang family, one of whom was Jiang Zhenping, the third son of Grandpa Jiang, and another was Jiang Xile.<br/><br/>Others from the Jiang family also wanted to come, but they were too busy with their jobs and couldn’t spare the time.<br/><br/>Well, all of the men and women in the Jiang family have their own work, and none of them stayed at home as a dutiful wife and a good mother.<br/><br/>Jiang Xile exclaimed in astonishment, “My goodness, our little sister is really popular.”<br/><br/>Gao Yanxin said beside him, “Yes, my cousin is the treasure of the village, and everyone loves her.”<br/><br/>Jiang Zhenping curiously asked, “Our niece really has charm. But why does she receive the love and affection of all the villagers?”<br/><br/>For the first time they saw Jinli, the adoptive granddaughter that the old master had recognized, they also liked her. She was beautiful, smart, and had a high level of medical skills, which made her a perfect girl.<br/><br/>None of the Jiang family objected to the old master’s choice of adoptive granddaughter.<br/><br/>Although Xiao Jinli hadn’t visited the Jiang family and formally met with the Jiang family members, each of them had sent her a gift.<br/><br/>After hearing Jiang Zhenping’s question, a child nearby said, “Sister Jin Li is really smart. She can solve so many problems for everyone.”<br/><br/>Jiang Zhenping’s eyebrows slightly furrowed, feeling confused.<br/><br/>It was not surprising that Xiao Jinli could solve many problems for the villagers and be well-liked by the adults. However, the children who surrounded Xiao Jinli were holding her hands and feet and crying pitifully, “Sister Jin Li, where have you been? I   hic   haven’t seen you in such a long time. Boo-hoo  ”<br/><br/>“Sister Jin Li, when you’re not in the village, Little Flower is so listless. She misses you, and so do I.”<br/><br/>“Boo-hoo, Sister Jin Li, I clean myself up every day, hoping you will come back soon. Where have you been? Why has it been so long?”<br/><br/>Seeing the almost uncontrollable scene, the guests from Capital City were speechless.<br/><br/>Had they all been overlooked by everyone?<br/><br/>Xiao Jinli coaxed and comforted the crying children with a gentle voice, then said to the villagers, “Dear uncles, aunts, I, Xiao Jinli, am back. Thank you for your thoughts. We have guests at our house today, so please feel free to sit in our yard.”<br/><br/>“Haha, Jinli, you have guests at your house today, you guys should focus on entertaining them, and we won’t join in the fun. Wanshan, Xiaofang, if you need any help, just let us know!”<br/><br/>Xiao Wanshan, who had been pushed outside by the kids, replied, “Okay, thank you everyone!”<br/><br/>Once everyone had seen Xiao Jinli and made sure she was safe and sound, they disbanded and went back to work.<br/><br/>Now it was harvest season, everyone was taking extra care of their crops in the fields.<br/><br/>As the adults dispersed, the children followed Xiao Jinli closely, forming her little entourage.<br/><br/>Xiao Jinli took out the snacks and toys she had bought from Capital City from her car and distributed them one by one to the children, saying, “Niuniu, Nini, Gouwa, Third Child  ”<br/><br/>The children, who had received their snacks and toys, immediately turned around and went to share them with their friends.<br/><br/>Xiao Jinli wiped the sweat off her forehead and muttered to herself, “These kids are really hard to please.”<br/><br/>Afterward, she walked over to her family and said with a smile, “Grandfather, Grandma, maternal grandfather, maternal grandmother, Mom, Dad, I’m back now.”<br/><br/>“Good, good, it’s good to be back!” The four elderly people said excitedly.<br/><br/>But Grandma Xiao and Xiao Jinli’s maternal grandmother hugged her, their eyes red, and cried out, “My good baby, it’s good to have you back!”<br/><br/>It’s important to note that when Xiao Wanshan and his wife first told them that Xiao Jinli had almost been in an accident on the airplane, the four elderly people, who didn’t have any heart problems, almost developed heart problems from the shock.<br/><br/>Xiao Jinli felt guilty and said, “Grandma, maternal grandmother, I’m sorry that I made you worry.”<br/><br/>In the hearts of the elderly, Xiao Jinli has never traveled alone before. But when she did for the first time, she almost had an accident, and afterwards, she was alone in Capital City thousands of miles away. Well, Gao Yanxin was left out.<br/><br/>“It’s okay, as long as you’re safe.”<br/><br/>Xiao Jinli hugged Grandpa Xiao and her maternal grandfather, saying, “Grandfather, maternal grandfather, I made you both worry.”<br/><br/>“Good, good, as long as you come back safely.”<br/><br/>Xiao Jinli didn’t forget that several important guests had also come to their home.<br/><br/>She quickly introduced them to her family, “This is Grandpa Chen, this is Grandfather Li, this is Grandpa Yuan, and this is Grandpa Jiang.”<br/><br/>Everyone greeted the other three old gentlemen and then immediately focused their gaze on Elder Jiang.<br/><br/>Undoubtedly, everyone was aware of the fact that Xiao Jinli had found herself an adoptive grandfather in Capital City.<br/><br/>“Sweetheart, is this the adoptive grandfather you found in Capital City?” Grandpa Xiao asked.<br/><br/>Xiao Jinli nodded, “Yes, Grandfather, Grandpa Jiang has been very kind to me.”<br/><br/>After speaking, she introduced Jiang Zhenping and Jiang Xile, saying, “This is Uncle Jiang San and this is Brother Jiang Jiu.”<br/><br/>Xiao Jinli’s introduction was meant to help everyone better understand their identities.<br/><br/>In front of all these people, Jiang Xile was the youngest in terms of generation.<br/><br/>He immediately greeted everyone politely, “Grandpa Xiao, Grandma Xiao, maternal grandfather, maternal grandmother, Uncle, Aunt, I am Jiang Xile, now I’m the Ninth Brother of my sister. I have eight older brothers, but due to work, they couldn’t make it here. I’m taking the place of my eight older brothers to greet all the elders here.”<br/><br/>“Good, good, he’s a good child.”\t\t\t\t\t\t</div>", "images": {}, "success": true}