{"id": 253, "url": "https://www.novelhall.com/the-lucky-star-blessing-the-whole-village-32483/14344363.html", "title": "Chapter 253 - Chapter 253: Chapter 253: (First Update)", "volume": 3, "volume_title": "Volume 3", "body": "<h1>Chapter 253 - Chapter 253: Chapter 253: (First Update)</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 253: Chapter 253: (First Update)<br/><br/>Translator: 549690339<br/><br/>When Gao Yanxin and Xiao Jinli came back from outside, they brought with them two large boxes. Two security guards each carried a big box and returned to Grandpa Jiang’s yard.<br/><br/>Grandpa Jiang and the others were playing chess in the yard, feeling slightly curious when they saw the two large boxes.<br/><br/>“What’s this, girl?” Old Master Yuan asked.<br/><br/>Xiao Jinli said, “These are vegetables and fruits sent from my home for you grandfathers to taste today!”<br/><br/>She spoke while unpacking the boxes.<br/><br/>“Oh, did you grow these yourself?” Elder Chen came over and immediately his eyes lit up at the sight of the fresh vegetables exposed inside the box. He exclaimed in amazement, “These vegetables are so fresh!”<br/><br/>“Cousin Xin, go to the kitchen and get a basket to wash some tomatoes and cucumbers for the old masters,” Xiao Jinli said. “The vegetables from our village taste exceptionally good. Our village vegetables are almost ready to be sold, so I asked my family to pick some and send them.”<br/><br/>The other three old gentlemen also came over, saw the fresh vegetables in the box, shining green, bright red, and radiant green, making them drool at the sight.<br/><br/>There were Chinese cabbages, chives, radishes, tomatoes, cucumbers, and other common vegetables.<br/><br/>“These vegetables are really fresh. Girl, are all these grown by your family?” Grandpa Jiang asked, “How many are you growing?”<br/><br/>Xiao Jinli answered, “I have planted five points of private land, and the village has planted more than 600 acres.”<br/><br/>“Ah, girl, what do you mean by that?” Elder Li asked with a puzzled face, “Does your entire village plant vegetables? And what does your private land mean?”<br/><br/>“Our whole village grows vegetables. We even established a company,” Xiao Jinli explained, “My private five points of land are for experimentation.”<br/><br/>Grandpa Jiang and the others were confused,<br/><br/>“Wait a minute, girl, what exactly do you mean by that?” Grandpa Jiang inquired with confusion, “Is your private land a testing ground? So these five points of land are for experimenting with growing vegetables? Is that what you mean?”<br/><br/>Gao Yanxin laughed and said, “Yes, Grandpa Jiang, that’s what it means. Those five points of land are for my cousin’s research on vegetable growing techniques. The whole Xiao Family Village plants vegetables relying on my cousin. You don’t know how delicious these vegetables are.”<br/><br/>After Gao Yanxin finished speaking, he took the basket of tomatoes and cucumbers to wash.<br/><br/>After listening to Gao Yanxin’s words, the old gentlemen exchanged glances, looking at Xiao Jinli in disbelief.<br/><br/>Is this a child?<br/><br/>Isn’t this a monster?<br/><br/>Such a young age, yet seems to know everything.<br/><br/>“Haha, so these vegetables were grown by our girl. We must have a good taste at noon,” Elder Chen said happily.<br/><br/>“Right, Xiao Li, we’ll have lunch here at Old Jiang’s today. Take the vegetables to the kitchen,” Old Master Yuan said with delight.<br/><br/>Xiao Li responded, “Alright!”<br/><br/>After that, he carried a box into the kitchen.<br/><br/>A moment later, Gao Yanxin brought out the washed tomatoes and cucumbers, giving them to the old masters, and laughed, “These tomatoes are sweet and sour, you’ll taste them, and they’ll be delicious.”<br/><br/>“These tomatoes smell so good,” Elder Chen took a tomato and put it in his mouth, and said, “Hmm, delicious, really delicious.”<br/><br/>The others also took a bite, and their expressions were similar to that of Elder Chen.<br/><br/>“This tomato is really delicious, not only sweet and slightly sour but also fragrant. This pleasant smell is amazing,” Old Master Yuan said, “I usually don’t like tomatoes, and when eating them, I like dipping them in sugar. But eating them in this original way is surprisingly delicious.”<br/><br/>“Little Xin, give me a cucumber to taste,” After eating the tomato, Grandpa Jiang asked for a cucumber.<br/><br/>Although Grandpa Jiang was old, he still had good teeth.<br/><br/>“Crunch!” He bit into the cucumber.<br/><br/>The cucumber juice and its fragrance filled his entire mouth.<br/><br/>“Hmm, this cucumber is crispy and sweet, juicy, and has a faint fragrance. It’s even more delicious than fruit,” Grandpa Jiang commented. “Girl, how did you grow these vegetables? They taste so delicious!”<br/><br/>“Do all the other vegetables taste this good?” Elder Chen asked curiously.<br/><br/>Gao Yanxin nodded, “The other vegetables are also very delicious. My sister’s vegetables, whether eaten raw or cooked, are great. You’ll all know when you eat them at noon.”<br/><br/>“We must have a good taste at lunchtime!”<br/><br/>They all thought that these vegetables were just ordinary farm-grown green vegetables, but they didn’t expect them to taste so different.<br/><br/>Gao Yanxin continued, “These vegetable growing techniques were researched by my cousin. Now the whole village has begun planting vegetables, hoping to find a way to get rich.”<br/><br/>“If the vegetables in the village all taste this good, they must sell well!” Elder Li said with excitement. “Girl, can I pre-order from you first?”<br/><br/>“Right, right, I want to pre-order too,” Old Master Yuan also said.<br/><br/>Xiao Jinli was somewhat speechless, “Old Masters, let’s wait until you have lunch, then place your orders.”<br/><br/>“Alright, let’s wait until after we’ve tasted them at noon, then we’ll place our orders!”<br/><br/>They all made up their minds that no matter how the vegetables were, they wanted to order some.<br/><br/>However, during lunchtime, they became excited and expectant when they smelled the strong aroma of the food coming from the kitchen.<br/><br/>Usually, the kitchen had an exhaust fan, so the smell should have been sucked out.<br/><br/>But this aroma floated into the yard.<br/><br/>“This food smells so good!”<br/><br/>“Yes, it’s so fragrant!”<br/><br/>“Just by smelling this, the vegetables taste better than meat.”<br/><br/>Since their bodies had been conditioned by Xiao Jinli, they no longer needed to worry about restrictions, and they enjoyed big fish and meat like they used to in their younger years. Now, with a meal after meal of fish and meat, they would just take a digestion pill if they ate too much, and soon their stomachs would feel comfortable.<br/><br/>At noon, it was time for the meal.<br/><br/>The old masters were waiting at the dining table early.<br/><br/>“Xiao Li, hurry up, serve the dishes quickly,” Elder Chen urged.<br/><br/>After a while, all the dishes were served.<br/><br/>There were ten dishes on the dining table.<br/><br/>Apart from the fried fish, braised pork, lamb chops, salt-baked chicken, and seafood that the old masters usually liked, there were stir-fried Chinese cabbage, scrambled eggs with chives, eggplant claypot, cold cucumber salad, and celery stir-fried with shredded pork.<br/><br/>As soon as the old gentlemen saw these dishes, they ignored the meat they loved to eat, picked up their chopsticks, and started snacking on the vegetarian dishes.<br/><br/>“Hmm, it’s really so delicious. I’ve been alive for so many decades, and this is the first time I’ve tasted such delicious vegetables.”<br/><br/>“Hmm, it’s really so delicious.”\t\t\t\t\t\t</div>", "images": {}, "success": true}