{"id": 252, "url": "https://www.novelhall.com/the-lucky-star-blessing-the-whole-village-32483/14344361.html", "title": "Chapter 252 - Chapter 252: Chapter 252: (Second Update)", "volume": 3, "volume_title": "Volume 3", "body": "<h1>Chapter 252 - Chapter 252: Chapter 252: (Second Update)</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 252: Chapter 252: (Second Update)<br/><br/>Translator: 549690339<br/><br/>Ever since Su Yichen found out that Xiao Jinli had come to the Capital City, he couldn’t suppress his excitement.<br/><br/>Before leaving Xiao Family Village, Xiao Jinli had revealed her abilities to him, so when she arrived in the capital city and sought him out, he wondered if she had accepted him.<br/><br/>Su Yichen held his cellphone, his hand hesitating over the buttons.<br/><br/>At the moment, he was deep in trouble and could not carelessly act or he would be unable to recover.<br/><br/>He was currently a rising star in the business world, an elite upstart in the field.<br/><br/>However, he was in a precarious situation, with wolves in the front and tigers in the back.<br/><br/>The huge inheritance his mother had left to him drew the attention of both the Grumpy Old Man of the Xia Family, who treated him like a beloved grandson, and his biological father, who cursed him as a white-eyed wolf. Both of them were watching his fortune closely.<br/><br/>Although he had become the darling of the business world based on his abilities, he was also a thorn in the eyes of many.<br/><br/>So, he couldn’t reveal his weaknesses to the public.<br/><br/>What if Xiao Jinli could protect herself, but there was a mistake?<br/><br/>Su Yichen put down his cellphone, sighed softly, and looked through the window into the distance with his deep eyes.<br/><br/>On the other side, Gao Yanxin was holding his cellphone, muttering to Xiao Jinli, “Cousin, what does this Su Yichen mean? Does he look down on us? It’s been several days, and he hasn’t called us to catch up on old times.”<br/><br/>Xiao Jinli glanced at him and shook her head. “Cousin Yanxin, you might be overthinking it. He may not be calling us because he has some concerns.”<br/><br/>Gao Yanxin thought about it and said, “That’s possible. I heard that Su Yichen’s stepmother is not easy to deal with. Ninth Brother also mentioned the rumor that Su Yiyi’s disappearance is due to her stepmother’s scheming. You found him covered in blood and in a critical condition. It seems that his stepmother is a dangerous person.”<br/><br/>As he said this, he realized, “Does he not contact us because he’s afraid his stepmother will target us? And then use us to threaten him?”<br/><br/>Xiao Jinli,  It was quite rare for Gao Yanxin to come up with this notion.<br/><br/>Gao Yanxin had a straightforward and cheerful personality, but sometimes his mind worked in a single track.<br/><br/>Xiao Jinli shrugged and said, “Maybe.”<br/><br/>Gao Yanxin pondered for a moment, then asked, “So, sister, should we take the initiative to contact him? Will that bring him any trouble?”<br/><br/>Xiao Jinli thought for a while and said, “Let’s just contact him and tell him that we want to catch up.”<br/><br/>In reality, she was just curious to know how Su Yichen would retaliate when faced with the whirlwind of wolves in front and tigers behind.<br/><br/>Gao Yanxin’s eyes lit up, and he immediately called Su Yichen.<br/><br/>Su Yichen, who was in a meeting, saw the familiar phone number and was so excited that he almost jumped up. However, he calmly looked at the management staff below and said coldly, “The meeting is over. Dismiss!”<br/><br/>Everyone broke up immediately, curious about who had called and why it was so important, causing the meeting to end early.<br/><br/>“Yan Xin, okay, I’ll be right there.” Su Yichen said.<br/><br/>After hanging up the phone, he walked out the door and told his secretary, “I have a few things to do outside, if you need anything, just call me.”<br/><br/>“Alright, Vice President Su!”<br/><br/>“Alright, Vice President Su!”<br/><br/>As soon as Su Yichen left, the two secretaries began to chat.<br/><br/>“Vice President Su is really getting more handsome.”<br/><br/>“Yes, he’s not only handsome but also aloof, which has attracted a large number of women.”<br/><br/>“Ah, if I weren’t married, I’d be bowing down at the hem of his suit pants.”<br/><br/>“I would too if I didn’t have children.”<br/><br/>Soon after, the two secretaries exchanged glances and sighed softly, “Ah, married too young!”<br/><br/>Su Yichen drove away from the Xia Corporation.<br/><br/>Xia Xinbei drove into the company and saw Su Yichen leaving, narrowing his eyes. Then, turning the steering wheel, he followed him.<br/><br/>Although Su Yichen had moved out of the Xia family residence and into his own apartment, he was still a vice president in the Xia Corporation.<br/><br/>As long as he was still a part of the Xia Family or the Xia Corporation, he was the eye of many who wanted to challenge him.<br/><br/>With a sense of urgency, Su Yichen was not as cautious as usual, and naturally did not notice the tail that had followed him.<br/><br/>Su Yichen’s car pulled up directly to Old Man Huang’s private restaurant.<br/><br/>Xia Xinbei saw this and was displeased, thinking, “Isn’t this bastard hungry enough? It’s afternoon and you’ve come here to eat?”<br/><br/>Upon rethinking, he thought, “No, this restaurant doesn’t serve customers in the middle of the afternoon. What is he doing here?”<br/><br/>“And this restaurant only serves top-tier patrons; it won’t entertain guests in the afternoon. So, there must be something fishy about this bastard showing up here. Did he plan a secret meeting to plot against the Xia Family’s property?”<br/><br/>When he thought about this, Xia Xinbei felt frustrated.<br/><br/>Ever since Su Yichen had joined the Xia Family, he had been like a comparison with everyone else.<br/><br/>The old master would often sigh in front of them, saying that if his descendants had even half the business talent of Su Yichen, he wouldn’t have to worry so much about them.<br/><br/>As a result, Xia Xinbei’s dislike for Su Yichen grew deeper every day.<br/><br/>“Humph, Su Yichen, I’ve finally found your Achilles heel!” Xia Xinbei’s mouth curled up into a satisfied expression. “You’re plotting with others to seize the Xia family’s property. I’ll tell the old master and see if he’s still so close to you, you little bastard.”<br/><br/>Seeing Su Yichen park the car, Xia Xinbei disguised himself and followed.<br/><br/>However, when he got to the door, he was stopped by the waitress.<br/><br/>The waitress smiled and said, “I’m sorry, sir, but the restaurant is currently closed for business, and we are not serving customers right now.”<br/><br/>Xia Xinbei’s expression darkened, and he asked directly, “Clearly, I saw someone go in. Why aren’t you serving customers?”<br/><br/>The waitress said, “I’m sorry, but that gentleman is a friend of our boss.” That’s why he could go in.<br/><br/>Xia Xinbei was annoyed. “You’re treating customers differently and discriminating against them. I want to file a complaint against your restaurant!”<br/><br/>The waitress tugged at the corner of her mouth, maintaining a smile but with a cold tone, “Suit yourself!”<br/><br/>Anyway, it wasn’t the first time their restaurant had received a complaint.<br/><br/>However, it was the restaurant’s prerogative to choose which customers to serve.<br/><br/>Humph!<br/><br/>Xia Xinbei,<br/><br/>Su Yichen hurried to Xiao Jinli’s private room, straightened his clothes and emotions, and knocked on the door.<br/><br/>“Who is it?” It was Gao Yanxin’s voice.<br/><br/>“Yanxin, it’s me!” Su Yichen replied.<br/><br/>The door then opened.<br/><br/>Gao Yanxin looked at him and said happily, “That was fast, Su Yichen!”\t\t\t\t\t\t</div>", "images": {}, "success": true}