{"id": 255, "url": "https://www.novelhall.com/the-lucky-star-blessing-the-whole-village-32483/14344366.html", "title": "Chapter 255 - Chapter 255: Chapter 255: (First Update)", "volume": 3, "volume_title": "Volume 3", "body": "<h1>Chapter 255 - Chapter 255: Chapter 255: (First Update)</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 255: Chapter 255: (First Update)<br/><br/>Translator: 549690339<br/><br/>Soon, in Elder Jiang’s courtyard, seven or eight old fellows in their seventies and eighties arrived.<br/><br/>Elder Jiang’s face darkened, and he said unhappily, “You guys, don’t you have food in your own homes? You all ran to my house. We don’t even have enough food for ourselves, let alone extra for you.”<br/><br/>Old Master An said with a smile, “It’s alright. If your food is not enough, I can have food sent from my house too. Just share a bit of your meals with us.”<br/><br/>The food in Old Jiang’s place was so fragrant that it wafted throughout the whole courtyard, and when walking into Old Jiang’s small yard, the aroma was even more mouth-watering and refreshing, making them feel very comfortable.<br/><br/>Old Master Ji nodded in agreement, “What Old An said is correct, you are not prepared, but we are. Come on, let’s join tables.”<br/><br/>Elder Jiang was speechless.<br/><br/>Of course, Elder Jiang wouldn’t really let them bring food from their homes, so he had the kitchen prepare another table. It didn’t matter if the meal was a little late.<br/><br/>Gao Yanxin was really eye-opening this time.<br/><br/>He had never imagined that these old heroes would be so thick-skinned just for a bite to eat.<br/><br/>After more than half an hour, another table of dishes was ready.<br/><br/>Since it was late, the kitchen didn’t have time to prepare any meat dishes, and only vegetables were left.<br/><br/>However, after enjoying the vegetables in the morning, the old masters specifically instructed them not to prepare any more meat dishes and just cook a few more vegetarian dishes.<br/><br/>Usually, lighter meals are eaten in the evening, and many times they don’t even cook any meat dishes.<br/><br/>But recently, having indulged their appetites, they even cooked meat dishes in the evening.<br/><br/>But tonight, they wanted to eat light vegetarian dishes.<br/><br/>Old Masters Ji, An, Zhou, and several other old men who were attracted to Elder Jiang’s courtyard by the fragrance, saw the colorful and delicious dishes on the dining table and couldn’t help salivating.<br/><br/>Old Master An asked, “Old Jiang, did your family change chefs? Why do the dishes smell so good?”<br/><br/>“Yes, the aroma can be smelled from far away.”<br/><br/>“Let me taste it first!”<br/><br/>“Mmm, it’s delicious.”<br/><br/>Seeing this, the others immediately began eating, not even bothering to speak anymore.<br/><br/>As soon as they talked, the dishes on the plate would be snatched away by others.<br/><br/>Gao Yanxin,<br/><br/>These old masters, one by one, had no image. They wolfed down the food, and in no time, the dishes on the two tables were all devoured.<br/><br/>After finishing the dishes on the table, they all still seemed unsatisfied.<br/><br/>Old Master Ji said with a smile, “Old Jiang, do you have any more of these dishes? We are still not full. Can you cook some more?”<br/><br/>Elder Jiang,  These thick-skinned old fellows, don’t they know that they are guests when they come to someone else’s house? And they are still demanding food directly from the host, what a disgrace.<br/><br/>However, Elder Jiang still smiled and said, “Why do you need to eat so much at night? It’s healthier to be just half-full.”<br/><br/>Old Master An said, “Old Jiang, did your family really change the chef? I remember Master Zhang’s cooking skills were not bad. Which better chef did you change to?”<br/><br/>Elder Jiang said, “You’re wrong, I didn’t change the chef!”<br/><br/>“Haha, you didn’t change the chef?” Old Master An said with slight surprise, “Then Master Zhang’s cooking skills have really improved. Old Jiang, can you lend Master Zhang to me to cook for me, so I can satisfy my cravings?”<br/><br/>“Old An, you’re wrong again.” Old Master Yuan smiled and said, “It’s not that Master Zhang’s cooking skills have improved, but the ingredients are better.”<br/><br/>Old Master Ji asked in confusion, “Old Yuan, what do you mean?”<br/><br/>Old Master Yuan smiled without answering and instructed Gao Yanxin, “Xiao Gao, go wash some tomatoes and cucumbers.”<br/><br/>“Alright!” Gao Yanxin immediately agreed.<br/><br/>After dinner, everyone gathered in the yard, chatting.<br/><br/>After a while, Gao Yanxin brought out two fruit platters, one with tomatoes and the other with cucumbers, looking fresh and juicy.<br/><br/>Elder Jiang laughed and said, “Don’t say I have good things and don’t share them with you old fellows. Old Ji, you guys try these tomatoes and cucumbers.”<br/><br/>Old Master Ji and Old Master An, both with skeptical looks, took a tomato each, sniffed it, and smiled, “It smells delicious!”<br/><br/>Although both of them didn’t like raw tomatoes, they smelled so good that they wanted to try them.<br/><br/>They took a bite.<br/><br/>They exchanged glances, their eyes filled with amazement and disbelief.<br/><br/>This tomato tasted so different from the ones they had eaten before, with a strong, fragrant, sweet, and sour flavor. One bite and they knew it was unforgettable.<br/><br/>And then, without minding their image, they quickly finished eating a tomato each.<br/><br/>Next, their gazes turned to the other fruit plate filled with cucumbers.<br/><br/>They each took a cucumber.<br/><br/>“Crunch,” they each took a bite.<br/><br/>Crispy, sweet, and juicy.<br/><br/>“It’s delicious! It’s even better than fruit!”<br/><br/>“Tell me, Old Jiang, where did your family get these?” asked Old Master Ji curiously.<br/><br/>Old Jiang, looking pleased, said with a smile, “Hehe…, they were given to us by my granddaughter.”<br/><br/>By “us,” of course, he meant the old masters who usually gathered together.<br/><br/>He said this to show Xiao Jinli’s respect and filial piety toward them.<br/><br/>“Your granddaughter?” Old Master Ji and Old Master An turned their eyes to Xiao Jinli.<br/><br/>In this courtyard, Xiao Jinli was the only girl.<br/><br/>Old Jiang laughed and said, “Little Li, come and greet the old masters!”<br/><br/>Xiao Jinli respectfully replied, “Little Li greets Grandfather An, Grandfather Ji …”<br/><br/>She greeted each of the seven or eight unfamiliar old masters in the courtyard one by one.<br/><br/>“Old Jiang, congratulations! You got a granddaughter and fulfilled your wishes.”<br/><br/>All the old masters came forward one by one to congratulate him.<br/><br/>“Your granddaughter is really beautiful and well-behaved. You are truly blessed.”<br/><br/>“Isn’t that right? Being her grandfather is my good fortune.”<br/><br/>“Old Jiang, I heard that your granddaughter is a doctor, a very skilled one at that. She cured Old Yuan’s illness, and now she is treating Old Zeng’s illness. I’ve observed Old Zeng’s condition getting better every day.” Old Master Ji said.<br/><br/>That was also the reason he had the nerve to come to Elder Jiang’s courtyard today.<br/><br/>He wanted someone to have a look at his body.<br/><br/>Seeing the daily improvement in Old Jiang and the others’ health, and hearing that they no longer needed to control their diet, he was envious.<br/><br/>Old Jiang smiled and said, “My granddaughter is outstanding. Her medical skills are indeed excellent. Our health has all been improved by her care.”<br/><br/>He didn’t mention letting Xiao Jinli check them out.<br/><br/>Old Master Ji looked at Xiao Jinli and said with a smile, “Girl, can I ask you to take my pulse and see how I should adjust my body?”<br/><br/>Xiao Jinli nodded and said, “Yes! Please stretch out your hand!”<br/><br/>For each of the old heroes in the nursing home, Xiao Jinli held them in high regard.<br/><br/>In fact, she had been staying at Elder Jiang’s courtyard these past few days, just waiting for these people to visit.\t\t\t\t\t\t</div>", "images": {}, "success": true}