{"id": 257, "url": "https://www.novelhall.com/the-lucky-star-blessing-the-whole-village-32483/14344369.html", "title": "Chapter 257 - Chapter 257: Chapter 257: (First Update)", "volume": 3, "volume_title": "Volume 3", "body": "<h1>Chapter 257 - Chapter 257: Chapter 257: (First Update)</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 257: Chapter 257: (First Update)<br/><br/>Translator: 549690339<br/><br/>Half a month later, Elder Zeng’s condition had greatly improved, and he no longer needed acupuncture and herbal baths.<br/><br/>Xiao Jinli planned to go home.<br/><br/>When Elder Jiang and others heard that Xiao Jinli was going home, they unanimously expressed their wish to visit her hometown.<br/><br/>As for whether they would convalesce in the village, they would decide later.<br/><br/>Before Xiao Jinli went home, she met with Su Yichen alone.<br/><br/>Gao Yanxin suspiciously asked, “Cousin, are you sure you don’t want me to accompany you to see Su Yichen?”<br/><br/>Since their last meeting, due to Su Yichen’s situation, they hadn’t seen each other and had only communicated via phone.<br/><br/>Xiao Jinli shook her head and said, “No need, I’ll go alone.”<br/><br/>Gao Yanxin nodded, “Alright then.”<br/><br/>Xiao Jinli went straight to Xia Corporation.<br/><br/>Dressed simply, Xiao Jinli arrived at the reception and said, “Hello, I’m here to see Mr. Su.”<br/><br/>“May I ask Miss, do you have an appointment with Mr. Su?” the receptionist asked with a smile.<br/><br/>Xiao Jinli replied, “Yes.”<br/><br/>The receptionist said, “Please wait a moment!”<br/><br/>Then, she made a phone call.<br/><br/>After hanging up, she said to Xiao Jinli, “Mr. Su is in his office. Please follow me.”<br/><br/>The receptionist led her to the elevator.<br/><br/>Just as she entered the elevator, Lan Mingyue approached the receptionist, her face slightly unpleasant, and asked, “Was that woman just now here to see Brother Su?”<br/><br/>The receptionist replied with a grin, “Miss Lan, I’m sorry, but I can’t divulge that.”<br/><br/>Lan Mingyue glared at her, about to lose her temper, but then she solemnly took a deep breath and said, “Never mind, I’ll go find Brother Su myself.”<br/><br/>With that, she walked towards the elevator.<br/><br/>The receptionist quickly stepped forward to stop her and said politely and courteously, “Miss Lan, do you have an appointment with Mr. Su?”<br/><br/>Lan Mingyue was instantly enraged. She bellowed, “Look at me clearly, who am I? I am Mr. Su’s girlfriend. Do I need an appointment to see my boyfriend? Move aside!”<br/><br/>The receptionist still politely said, “I’m sorry Miss Lan, but we have orders from above. Anyone who wants to see Mr. Su must make an appointment first!” She deliberately emphasized the words “anyone”.<br/><br/>Pointing towards the elevator, Lan Mingyue loudly asked, “What about the woman who just went in? Why didn’t you stop her?”<br/><br/>The receptionist explained, “The lady has an appointment with Mr. Su!”<br/><br/>Lan Mingyue’s complexion changed instantly.<br/><br/>She didn’t expect Xiao Jinli had made an appointment with Su Yichen in advance.<br/><br/>They must be getting together while she wasn’t around.<br/><br/>Hmph, that vixen Xiao Jinli thought she could seduce Su Yichen, how delusional.<br/><br/>Lan Mingyue said coldly, “I’ll call my boyfriend!”<br/><br/>As Lan Mingyue mentioned the word “boyfriend” repeatedly, the receptionist’s eyes flashed with a hint of sarcasm.<br/><br/>This woman always termed herself as Mr. Su’s girlfriend, but the fact was that Mr. Su had never acknowledged her. On the contrary, he was quite annoyed by her and shooed her away every time.<br/><br/>But she was thick-skinned, each time as she was chased away, she acted as if it wasn’t her.<br/><br/>Even after being kicked out this time, she’d return next time.<br/><br/>As expected, Lan Mingyue couldn’t get through to Su Yichen’s phone, which pissed her off.<br/><br/>She glanced at the elevator, and when the receptionist wasn’t looking, she ran towards it. As soon as the elevator opened, she planned to rush inside. To her surprise, it was occupied by Su Yichen and Xiao Jinli.<br/><br/>The color on Lan Mingyue’s face changed once again, she looked at Xiao Jinli with resentment in her eyes. Feeling wronged, she called out, “Brother Su, I came to see you, but your receptionist stopped me.”<br/><br/>Su Yichen couldn’t be bothered to answer her. He said to Xiao Jinli instead, “Little sister, beware of the dog that bites!”<br/><br/>Lan Mingyue’s face turned pale instantly.<br/><br/>She never expected Su Yichen to call her a dog, she was seething with resentment.<br/><br/>With gritted teeth, Lan Mingyue asked, “Brother Su, how could you say such a thing about me?”<br/><br/>Su Yichen retorted coldly, “What did I call you?”<br/><br/>“You said I  I am…” Lan Mingyue was unable to say the word ‘dog’.<br/><br/>“Did I call you a dog, didn’t I?” Xiao Jinli replied with a smirk, “You’re the one who took it personally and admitted to being a dog that bites people. Who are you blaming? ”<br/><br/>Fuming, Lan Mingyue launched into a tirade, “I am talking to Brother Su, what business is it of yours, you lowlife? If it weren’t for you, Brother Su would still treat me like his own sister. It’s all because of you – you vixen! You seduced my Ninth Brother and now you’re trying to seduce Brother Su, you wench!”<br/><br/>“Slap!”<br/><br/>Xiao Jinli raised her hand and slapped Lan Mingyue across the face, her little face expressing cold anger, she said coldly: “I have a bad temper. If I hear something I don’t like, I don’t hesitate to take action.”<br/><br/>The first time Lan Mingyue called her a vixen, Su Yichen and Jiang Xile defended her. She remained silent.<br/><br/>But this time, even with Su Yichen present, she had to teach Lan Mingyue a lesson.<br/><br/>“Brother Su, she   she hit me!” Lan Mingyue, covering her bruised face, said to Su Yichen with a wronged expression, “Whimpering  I’ve never been touched by my parents  and she   she hit me?”<br/><br/>Lan Mingyue was genuinely aggrieved this time.<br/><br/>It was indeed the first time she had been slapped by someone.<br/><br/>However, Su Yichen simply despised her. How could he possibly act tenderly towards her?<br/><br/>He said coldly, “Miss Lan, you should be taught how to speak properly. Little Sister Jinli, let’s go!”<br/><br/>The two of them walked away, leaving Lan Mingyue behind.<br/><br/>The receptionists watched this spectacle, their eyes wide. Such a drama was not a common occurrence.<br/><br/>Lan Mingyue watched their retreating figures, to be precise, she was staring at the back of Xiao Jinli, her eyes filled with malice. She vowed to make this woman pay a thousand-fold.<br/><br/>Su Yichen and Xiao Jinli arrived at a private dining room in a restaurant.<br/><br/>Xiao Jinli glanced at the CCTV camera, and Xiao Zhi promptly turned it off.<br/><br/>After ordering the food, Xiao Jinli said, “Brother Siquan, I have to go back tomorrow.”<br/><br/>Su Yichen’s eyes immediately revealed reluctance, he restrained his feelings and said, “All right. Then, I’ll order some delicious dishes for this meal; you should eat well.”<br/><br/>Xiao Jinli smiled and said, “Alright, I will eat well! Brother Siquan, how far along are you with your revenge?”<br/><br/>Xiao Jinli asked very straightforwardly.<br/><br/>Su Yichen was taken aback by the directness of her question.<br/><br/>He opened his mouth but then glanced at where the CCTV camera would be.<br/><br/>Xiao Jinli said, “Don’t worry, the CCTV camera is turned off right now.”<br/><br/>Su Yichen,  When was it turned off? He wasn’t aware.<br/><br/>However, Su Yichen knew that when Xiao Jinli said the CCTV was off, then it was indeed off.<br/><br/>He let out a bitter smile and said, “I originally wanted to use the Xia Corporation to show my capabilities so that Su Xiangdong would beg me to come back. However, it seems like the Xia Family is also coveting the inheritance in my hands. At the same time, I feel that my maternal grandfather is exploiting me to gain my trust and to let me see the development of the company. Then, he wants to use the inheritance in my hands to inject funds into the company for operational and investment purposes.”<br/><br/>Many times, he was left wondering, is he destined not to have any kinship in his life?\t\t\t\t\t\t</div>", "images": {}, "success": true}