{"id": 260, "url": "https://www.novelhall.com/the-lucky-star-blessing-the-whole-village-32483/14344374.html", "title": "Chapter 260 - Chapter 260: Chapter 260: (Second Update)", "volume": 3, "volume_title": "Volume 3", "body": "<h1>Chapter 260 - Chapter 260: Chapter 260: (Second Update)</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 260: Chapter 260: (Second Update)<br/><br/>Translator: 549690339<br/><br/>Xiao Family has plenty of rooms in their home, so when the four old gentlemen from the capital arrived, they moved straight in.<br/><br/>Each of the four old gentlemen had his own room, but an extra, slightly smaller bed was set up in each room for those who might need to take care of them during the night.<br/><br/>Even though their health had been restored by Xiao Jinli, they were old, and unexpected things might happen.<br/><br/>All of them are treasures and must be taken care of carefully.<br/><br/>Old Chen looked around at the clean and tidy Xiao Family home, his eyes revealing his satisfaction as he said, “Girl, your house is really nice!”<br/><br/>The house of Xiao Family is beautiful and clean, and it has many rooms.<br/><br/>What made them most delighted was the food cooked by Xiao’s mother, which was flavorful, aromatic, and even better than the food made by a five-star chef.<br/><br/>Good ingredients were one reason, but a chef with good culinary skills could bring out more surprising flavors in the food.<br/><br/>So, during their first meal at the Xiao Family, the four old gentlemen fought for food.<br/><br/>“The meat here is really good, tender, and without a hint of a gamey taste, and it’s so flavorful, it’s delicious,” said one.<br/><br/>After tasting the vegetables sent by Xiao Family, Old Chen and the others had practically become vegetarians.<br/><br/>In the past, they were not satisfied unless they had meat. Now, they are not satisfied unless they have vegetables.<br/><br/>It doesn’t matter after eating, Xiao Jinli can send more from home.<br/><br/>Letting them eat ordinary vegetables now feels like feeding them pig food.<br/><br/>“Girl, are you saying that this chicken and pork are also raised in your village?” Chen’s old master asked with mild surprise.<br/><br/>“Yes. To be precise, they are raised by our company. Our company has set up breeding farms for chickens, ducks, fish, geese, pigs, and cattle,” Jinli nodded, “We will consider expanding production and adding more breeds in the future. But the Green Fresh Company is just starting up, so we have to take it slow.”<br/><br/>“Indeed, you can’t get fat with just one bite,” Elder Li nodded in agreement. “Given the quality of the company’s products, people will fight for them. What are the prices like?”<br/><br/>Jinli replied, “Good things naturally cost more. Like the vegetables in the field; they sell for more in town than others.”<br/><br/>Turning her head, Jinli asked, “Brother, how much do we supply to the town every day now?”<br/><br/>Previously, they only supplied a few dozen jin every day.<br/><br/>Junxuan said, “For the shops in town, the company supplies 600 jin every day. But the demand is still not enough. As soon as the vegetables arrive in the shop, they are snapped up in an hour. Even many people come to our village in groups to buy.”<br/><br/>Of course, many people smell business opportunities in it and started trafficking vegetables from Xiao Family Village.<br/><br/>This company won’t care.<br/><br/>All the crops in the field are sold at a uniform price, take it or leave it.<br/><br/>Jinli thought for a moment and said, “Brother, supply more to the shops in town. After all, there are many types of vegetables. On average, there are not many jin per type.”<br/><br/>Without any hesitation, Junxuan agreed, “Alright!”<br/><br/>The town should have this consumption capacity.<br/><br/>Many people for the sake of their children, would buy fewer clothes, or fewer other snacks, and save this money.<br/><br/>Children are able to eat well, sleep well, grow up and enhance their resistance, get sick less, not to mention saving money, but also less suffering.<br/><br/>Jinli now has a love for her hometown.<br/><br/>She naturally hopes that her hometown will become better and better.<br/><br/>Jinli then asked about a few other company matters, such as the most concerned about the product sales channel, the company’s other operating processes and so on.<br/><br/>Except for the Xiao Family, everyone present was amazed by Jinli’s familiarity with the company’s operational processes, even feeling that Jinli seemed to be pointing out the way for the company.<br/><br/>But the Xiao Family seemed to have no problem with all of this, and they seemed to think it was right.<br/><br/>Jiang Xile asked curiously, “Sister, what is your position in the company?”<br/><br/>Jinli shook her head and said, “None.”<br/><br/>Junxuan immediately said, “Although my sister does not have an official position in the company, everyone defaults to her as the Chairman of the entire company! It’s just that my sister is not old enough.”<br/><br/>Jiang Xile and the others,<br/><br/>They were curious. Isn’t this company said to belong to all the villagers? Why would a child occupy the position of the chairman, direct the operation of the company, and the villagers don’t have any objections?<br/><br/>But then, when they thought of the scene of the whole village welcoming Jinli back home, this doubt was immediately dismissed.<br/><br/>What they were even more curious about was, how did a child become the mainstay of the whole village? How did she gain the trust of all villagers and gain such prestige in the village?<br/><br/>If they hadn’t seen it with their own eyes, they would have thought that the whole village was playing house with the child?<br/><br/>This was really surprising.<br/><br/>Junxuan said, “The crops in the field were supposed to be harvested and marketed a few days ago, but the villagers wanted you to see with your own eyes the first time our village’s vegetables were harvested and sold, so they delayed it by two days. Now that you’re back, we can start harvesting tomorrow. We can first transport them to our own few stores, as for the orders from the restaurants, we can also transport them all together.”<br/><br/>Jiang Xile, who had never farmed before, asked curiously, “If we start picking tomorrow, then I want to go and see, oh, how many jin are we going to pick?”<br/><br/>Junxuan said, “Around 30,000 jin.”<br/><br/>“30,000 jin, that’s a lot, isn’t it?” Jiang Xile was somewhat surprised.<br/><br/>Junxuan said, “We have four of our own stores, one in the county town, three in Ganjiang City, and five or six hotels and restaurants.”<br/><br/>“Oh, I see.”<br/><br/>Gao Yanxin said on the side, “Ninth Brother, we have to start picking very early tomorrow, can you get up?”<br/><br/>“What time?” asked Jiang Xile.<br/><br/>“00:30!” Junxuan replied.<br/><br/>“That early?” Jiang Xile was surprised.<br/><br/>“It’s not early,” Junxuan explained. “Picking doesn’t take much time. Most of the time is spent on transportation, especially to Ganjiang City, which takes at least two hours. The hotels and restaurants must get the vegetables before 04:30.”<br/><br/>Jiang Xile asked, “Why can’t we pick it the day before?”<br/><br/>Junxuan shook his head and said, “It must be picked on the same day, and it’s best to pick it when there is some dew. This ensures the freshness of the vegetables when they reach the customer’s hands!”<br/><br/>Jiang Xile immediately became excited and said, “Then I will not sleep tonight. I want to go to the field and see the vegetable picking.”<br/><br/>Anyway, when he was in the capital, staying up all night was a common occurrence.<br/><br/>Although Jiang Xile could stay up, Junxuan needed sleep. He had to supervise the whole process the next day and couldn’t allow any mistakes.<br/><br/>This is the first time that the village’s vegetables are going on the market on a large scale, and it also determines the future development of the company.<br/><br/>After dinner, he rested for a while, then went to his room to rest.<br/><br/>The four old gentlemen also wanted to witness the grand scene of vegetable picking in the field, but they had travelled all day, and even though they were in good health now, they couldn’t stand the strain of old age. How could they get up in the middle of the night?<br/><br/>But Jinli also said that there will be plenty of such harvests in the future, you can see them at any time, and they must have a good rest today.<br/><br/>The old gentlemen still listened to Jinli’s advice.\t\t\t\t\t\t</div>", "images": {}, "success": true}