{"id": 265, "url": "https://www.novelhall.com/the-lucky-star-blessing-the-whole-village-32483/14344383.html", "title": "Chapter 265 - Chapter 265: Chapter 265:", "volume": 3, "volume_title": "Volume 3", "body": "<h1>Chapter 265 - Chapter 265: Chapter 265:</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 265: Chapter 265:<br/><br/>Translator: 549690339<br/><br/>As the second dish of braised chicken chunks was made, its aroma could be detected from thirty to forty meters away.<br/><br/>“What kind of chicken is being cooked here? It smells so good.”<br/><br/>“So fragrant. Just a while ago, I smelled the aroma of stir-fried leek with eggs, and now the scent of chicken. It’s especially pleasant. Who might be cooking this?”<br/><br/>“This aroma seems to be drifting from the Taste Fresh Restaurant.”<br/><br/>“That’s impossible. Everyone around here knows that the boss of Taste Fresh isn’t the best cook, and his dishes are usually not tasty. But now, smelling this aroma, how can it not be delicious?”<br/><br/>“Perhaps they’ve hired someone else to cook. After all, neither Qiu Lianying nor her husband are good cooks.”<br/><br/>“It’s bizarre. Why would two people who can’t cook think of opening a restaurant?”<br/><br/>“Who knows what went through their minds?”<br/><br/>Qiu Lianying smelled this aroma of the chicken and stood up in surprise. Even her husband was amazed at his cooking skills that day. How did it become so good?<br/><br/>But the dishes cooked just a while ago were merely passable.<br/><br/>At that moment, some acquaintances came over, laughing, and asked, “Boss Yang, the dishes you cooked today smell great. At first, I thought someone else was cooking. I didn’t expect it to be you. Your culinary skills seem to have improved today, the dishes you’ve made are so fragrant! Just now, I smelled the scent of stir-fried leek with eggs, and now I smell the scent of the cooked chicken. Boss Yang, you seem to be good at cooking chicken dishes?”<br/><br/>Boss Yang replied with a smile, “Actually, I’m quite surprised that the two dishes I cooked today smell particularly nice.”<br/><br/>At that moment, another customer, drawn by the aroma, walked over and said, “Boss, your dishes smell great. Fry two dishes for me.”<br/><br/>“Alright!” Boss Yang cheerfully asked, “What dishes would you like?”<br/><br/>The customer glanced at the menu on the wall, and then noticed the tomato that the boss’s wife was holding. He laughed and said, “First, give me cold mixed tomatoes. Then stir-fried leek with eggs. I smelled the aroma of stir-fried leek with eggs just now, it was especially pleasant. I’d like to try it, and also add some braised chicken chunks.”<br/><br/>Boss Yang looked at him and asked, “Are you by yourself?”<br/><br/>“Yes, just me!” The customer laughed and replied.<br/><br/>Boss Yang said, “If you’re alone, three dishes, wouldn’t that be too much?”<br/><br/>“No problem, if I can’t finish it, I’ll take it to go!” The customer said.<br/><br/>Boss Yang thought to himself, “I’ll just prepare whatever the customer orders.”<br/><br/>After Qiu Lianying cut the tomatoes and served them, she laughed and said, “The tomatoes are indeed good. You can start eating. I’m going next door to buy some vegetables.”<br/><br/>As soon as her voice fell, the customer at the front table sniffed and said, “This tomato also smells good. Boss lady, give me a cold mixed tomato too!”<br/><br/>Qiu Lianying laughed and replied, “All right, please wait a moment!”<br/><br/>Originally, the two pounds of tomatoes were intended for her own consumption. However, after she ate one, she sold the rest.<br/><br/>After serving the tomatoes to the guests at the table, Qiu Lianying quickly went to the neighboring vegetable shop again, and told Xiao Chunhua, “Boss lady, please give me two pounds of leeks and a chicken!”<br/><br/>Now she understood why the products in this shop were so expensive. People here, indeed, offer high-quality goods.<br/><br/>Regarding her husband’s cooking skills, she knew he wasn’t extraordinarily skillful. The difference was in the ingredients.<br/><br/>That’s why she wasn’t concerned about the price when buying them again.<br/><br/>Xiao Chunhua chuckled and said, “Boss lady, the dishes you cook with the products from our shop taste good, don’t they?”<br/><br/>Qiu Lianying couldn’t disagree. She smiled and said, “Yes, they are very fragrant. When being cooked, the aroma can be smelled within dozens of meters. Look, customers are coming here following the scent.”<br/><br/>While Xiao Chunhua was weighing the vegetables and chicken, she said, “Boss lady, as long as you use my goods, your business will certainly improve.”<br/><br/>Qiu Lianying was somewhat tempted, but she was still hesitant and said, “But the vegetables from your shop are too expensive. My costs will increase.”<br/><br/>Xiao Chunhua suggested, “Then you can raise your prices. Let me tell you, once you have a good product, it deserves a high price.”<br/><br/>Carrying the Fresh vegetables and meat she just bought, Qiu Lianying rushed back to the restaurant.<br/><br/>Once she arrived at the restaurant, she was surprised to find that all three empty tables were filled with customers.<br/><br/>But these customers had not yet ordered any dishes.<br/><br/>Qiu Lianying promptly washed the vegetables she had just bought, while the guests also placed their orders for food.<br/><br/>One table of customers ordered braised eggplant, green fried cabbage, loofah and shredded pork soup, and red-braised pork ribs.<br/><br/>Another table ordered cold mixed tomatoes, tofu fish head soup, beer duck, and oil-poured baby bok choy.<br/><br/>Qiu Lianying looked at the vegetables in the refrigerator and the half-processed meat, thought for a moment, and immediately went next door again.<br/><br/>Boss Yang asked, “Where are you going?”<br/><br/>“To buy vegetables!” Qiu Lianying replied.<br/><br/>Boss Yang looked at the vegetables and meat in the refrigerator and asked, full of doubt, “Aren’t there still vegetables here? What else do you need to buy?”<br/><br/>“Not enough!” Qiu Lianying replied. She then turned to the customers and said, “Please wait a little longer, everyone. The vegetables we prepared earlier are not enough, I’m going to buy some.”<br/><br/>“Go ahead, boss’s wife. As long as we can have a delicious meal, we’re willing to wait.”<br/><br/>Boss Yang watched as his wife went to the neighboring shop to buy vegetables again.<br/><br/>When he saw the freshly-bought vegetables and meat in his wife’s hand, he was even more puzzled and asked, “Aren’t these vegetables already in the cabinet? Why did you buy them again?”<br/><br/>Qiu Lianying glared at him and said loudly, “The vegetables in the cabinet are not fresh. I bought the new ones!”<br/><br/>Boss Yang,But the vegetables were clearly prepared this morning.<br/><br/>Qiu Lianying didn’t bother about him. After quickly preparing the newly bought vegetables, she started to work on the duck.<br/><br/>Boss Yang was even more puzzled by his wife’s behavior. They already had prepared half-processed duck meat in the morning, why did they buy half a duck again? Could it be possible to cook it immediately? Could they finish it on time?<br/><br/>Although Boss Yang’s culinary skills weren’t great, he was strong and could cook some dishes with continuous stir-frying actions. The dishes were quickly served.<br/><br/>While Boss Yang was cooking the pork ribs, Qiu Lianying had already seasoned the duck meat, poured beer on it, and put it directly into the pressure cooker.<br/><br/>More and more customers were attracted by the aroma from the restaurant. Seeing the filled tables, they recognized that the dishes from this restaurant must be really delicious. Consequently, they started to line up outside voluntarily.<br/><br/>Boss Yang,<br/><br/>Ever since they opened the restaurant, they had never experienced such good business.<br/><br/>They didn’t know what happened today as wave after wave of customers just kept coming.<br/><br/>“So fragrant. This eggplant is so soft and flavorful, it’s really delicious”. That was what the customers who ordered dishes said.<br/><br/>“This cabbage is also delicious. I didn’t expect the cook from this restaurant to be this good.”<br/><br/>“Is this the aroma of red-braised pork ribs?”<br/><br/>“There’s also duck meat being cooked in the pressure cooker? This aroma is too captivating.”\t\t\t\t\t\t</div>", "images": {}, "success": true}