{"id": 264, "url": "https://www.novelhall.com/the-lucky-star-blessing-the-whole-village-32483/14344381.html", "title": "Chapter 264 - Chapter 264: Chapter 264:", "volume": 3, "volume_title": "Volume 3", "body": "<h1>Chapter 264 - Chapter 264: Chapter 264:</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 264: Chapter 264:<br/><br/>Translator: 549690339<br/><br/>Qing County opened two stores, one in City East and one in City South.<br/><br/>Each shop wasn’t very big, around sixty-square meters in size, but every corner was made use of.<br/><br/>At the same time, each shop carried three thousand jin of stock, a full range of varieties. On average, the amount of each variety wasn’t very much. In addition to vegetables, there were also chicken eggs, duck eggs, goose eggs, processed chickens, ducks, and geese, as well as pork and beef.<br/><br/>Before the store opening, Xiao Yucheng sent people from the Marketing Department to promote and distribute posters for the event.<br/><br/>Many people thought they were just ordinary green vegetables.<br/><br/>However, the county town isn’t like a big city.<br/><br/>Many nearby towns and villages had villagers bringing their own vegetables to sell in the county town.<br/><br/>Eating their homegrown vegetables, they would naturally use less or no pesticides. Therefore, in the eyes of city folks, many countryside people’s vegetables were actually green vegetables.<br/><br/>Xiao Family Village Fresh Green Vegetable Shop didn’t attract much attention, especially since the vegetable prices on the posters were outrageously expensive.<br/><br/>Xiao Yucheng and his team firmly believed in the philosophy that fine wine is not afraid of deep alleyways, so they did not compromise on the price.<br/><br/>For example, a Chinese cabbage from an ordinary market would cost between five to eight yuan per jin, but Xiao Family Village’s Chinese cabbage, even in Taoyuan Town, was double that price. In the county town shop, considering the higher costs and the fact that the county town had greater purchasing power, the price of Chinese cabbage was set at 1.5 times that of ordinary cabbage.<br/><br/>Although the company’s promotion efforts were strong, many people stepped back when they saw the prices on the posters. Especially for those who were thrifty by nature, even though the poster promoted an 80% discount on all agriculture products in the shop for the first three days after opening, it was still very expensive.<br/><br/>On the first day of the opening, Xiao Yucheng and others, taking into account that there weren’t many consumers, only put on sale half of the originally planned fifteen hundred jin.<br/><br/>Each shop had three employees, all from Xiao Family Village.<br/><br/>“What kind of Xiao Family Village Green Fresh Vegetable is this? Are they grown with gold? The price is so high, a jin of Chinese cabbage is priced at one yuan and fifty cents, while the market only asks for fifty or sixty cents.”<br/><br/>“Exactly. Look at these chicken eggs. We go to the supermarket and buy a pack of thirty eggs for just fifteen yuan, which averages to five cents each. Here, however, one egg costs one yuan and fifty cents. Even this chicken, which normally costs twelve yuan per jin, here sells for twenty-five yuan per jin. What kind of store is this? I think it’s more of a robbery.”<br/><br/>“Tch, I can’t afford such expensive vegetables. They say it’s green vegetables, but eating green vegetables won’t let me fly into the sky. Should I spend so much unjustified money? If we want green vegetables, it’s better to buy from the countryside people. They are all homegrown and even greener.”<br/><br/>“There are so many people selling vegetables. Supermarkets also have a lot of vegetables. I wonder when this shop will go out of business.”<br/><br/>The two shops opened simultaneously, starting business at six-thirty in the morning.<br/><br/>Xiao Chunhua waited in the shop until eight o’clock and had only sold a few jin of vegetables, so she couldn’t help but feel anxious.<br/><br/>“Xiaofang, it’s eight o’clock, and we’ve only sold ten jin of our vegetables. Will it be difficult to sell?”<br/><br/>“Everyone finds it expensive. The people who come here to buy vegetables are the ones who don’t have time to go to the market.”<br/><br/>“Should we lower the price? With so many vegetables, if we can’t sell them, they will rot.”<br/><br/>Xiao Chunhua said, “Second Aunt, Third Mother, please don’t worry. Let’s just keep an eye on it first, and we must believe in the quality of our products. As long as they have tried them, they will definitely come back next time. It’s just that the beginning is always the hardest.”<br/><br/>“Hehe, I’m just worried.”<br/><br/>“Yes, I’m worried too.”<br/><br/>Xiao Chunhua nodded and said, “Actually, we are worried too. However, before the shop opening, Xiao Yucheng had already anticipated this situation, so all we have to do is wait patiently. Gold will always shine.”<br/><br/>As they chatted, a woman wearing an apron walked in, looking a bit rushed and asked, “Do you have chives and eggs here?”<br/><br/>Xiao Chunhua smiled and said, “Yes, please come this way. How much do you need? I’ll pack it for you.”<br/><br/>Qiu Lianying looked at the price and hesitated for a moment, “These chives are six yuan per jin, isn’t that too expensive? The market only charges three yuan per jin, and these eggs, a jin costs four yuan, but here you charge one yuan and fifty cents each.”<br/><br/>Xiao Chunhua smiled and said, “You’re the boss lady of the restaurant next door, right?”<br/><br/>Qiu Lianying nodded and said, “Yes!”<br/><br/>Next door was a restaurant, but the boss lady’s cooking skills were lacking, so the business wasn’t doing very well, and there were very few customers throughout the day.<br/><br/>Finally, a few guests arrived, wanting to eat chives and eggs, braised chicken chunks, and a few other dishes.<br/><br/>However, she wasn’t prepared very well, as she didn’t have chives, eggs, or chicken, so it was too late to go to the market; that’s why she thought about going to the nearby vegetable shop.<br/><br/>She knew the shop was expensive, but she didn’t expect it to be so expensive.<br/><br/>Xiao Chunhua smiled and said, “Boss lady, our shop’s vegetables may be a bit more expensive, but you have to believe that our price is worth it. If you don’t believe me, taste this tomato!”<br/><br/>Xiao Chunhua took a tomato, cut it into small pieces, and let Qiu Lianying taste it.<br/><br/>As soon as the tomato was cut open, Qiu Lianying’s nose twitched as the smell was too good to resist.<br/><br/>Then she took a bite and her eyes lit up, nodding her head and saying, “Not bad, this tomato is delicious.”<br/><br/>Xiao Chunhua explained, “The tomatoes in the market are two yuan per jin, while ours are five yuan per jin. Boss lady, do you think it’s worth the price?”<br/><br/>Qiu Lianying became addicted after one bite of the tomato and stared at the remaining tomato in Xiao Chunhua’s hand, impulsively responding, “Of course it is worth it.”<br/><br/>As soon as she finished speaking, her expression became somewhat awkward.<br/><br/>Just as she was about to say something else, her husband called out to her, “Hurry up, what are you doing dawdling there? The guests are waiting for their food.”<br/><br/>She immediately replied, “Alright, I’m coming.”<br/><br/>Afterward, she weighed one jin of chives, took three eggs, and half a chicken. She thought about it and said, “Give me two jin of tomatoes!”<br/><br/>These tomatoes were so delicious that she wanted to buy them as fruit to eat herself.<br/><br/>Qiu Lianying brought the purchased items back to her restaurant, cleaned them, and started cooking immediately.<br/><br/>“It smells so good!”<br/><br/>The guest sniffed and smiled, saying, “This scrambled egg with chives is really fragrant. Boss, is this your specialty dish? The few dishes you cooked just now didn’t smell this good.”<br/><br/>“This smell is so good, it’s invigorating!”<br/><br/>The restaurant owner laughed and said, “Haha, to tell you the truth, this is the first time I’ve cooked such a fragrant dish. Just wait, you all can enjoy it in a moment.”<br/><br/>As soon as the scrambled eggs with chives were served, the five guests couldn’t wait to pick up their chopsticks and taste it.<br/><br/>“Wow, this dish is so fragrant and delicious.”<br/><br/>In no time, the plate of scrambled eggs with chives was emptied.\t\t\t\t\t\t</div>", "images": {}, "success": true}