{"id": 261, "url": "https://www.novelhall.com/the-lucky-star-blessing-the-whole-village-32483/14344376.html", "title": "Chapter 261 - Chapter 261: Chapter 261: (Happy May 1St!)", "volume": 3, "volume_title": "Volume 3", "body": "<h1>Chapter 261 - Chapter 261: Chapter 261: (Happy May 1St!)</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 261: Chapter 261: (Happy May 1st!)<br/><br/>Translator: 549690339<br/><br/>The vegetables in the field were about to be harvested, and everyone in the village was excited and eager. The harvest would begin at 00:30, and apart from the children and some very elderly people, hardly anyone was able to fall asleep.<br/><br/>Everyone had their baskets, containers, and other harvesting tools at the ready, standing by the field, waiting for the time to come.<br/><br/>The village committee had also bought a string of firecrackers, just waiting for the right time to light them up during the official start of the harvest.<br/><br/>Jiang Xile had said that he wouldn’t sleep, and he really didn’t.<br/><br/>Except for the four grumpy old men, no one else slept either, hmm, except for Xiao Junxuan.<br/><br/>Because he needed to supervise the whole process the next day, he probably wouldn’t have time to rest during the day.<br/><br/>“Grandpa, Grandma, what are you using all these things for?”<br/><br/>Jiang Xile was puzzled by the Xiao Family gathering ropes, containers, sickles, and other items.<br/><br/>Grandma Xiao explained with a smile, “These are harvesting tools.”<br/><br/>Jiang Xile’s eyes lit up, “Is there more? I want to participate in the harvest too!” It must be fun.<br/><br/>Gao Yanxin looked at him and asked with slight doubt, “Ninth Brother, do you know how to harvest vegetables?”<br/><br/>“Harvesting vegetables? Of course, I do.” Jiang Xile confidently replied.<br/><br/>Gao Yanxin questioned, “Ninth Brother, are you sure you really know how?”<br/><br/>“I should know, right?” Jiang Xile suddenly became less confident.<br/><br/>Gao Yanxin patted him on the shoulder and said, “Actually, all we need to do is to watch from the side. If we were to do it ourselves, we might not even know whether we would damage the crops. Wasting things is disgraceful, and besides, these vegetables are meant to be sold for money.”<br/><br/>Grandpa Xiao smiled and asked, “We’re heading to the field now, are you coming?”<br/><br/>Looking at the time, Jiang Xile asked, puzzled, “Grandpa, isn’t it only ten o’clock?”<br/><br/>Grandpa Xiao laughed, “It’s still early, but everyone is so excited that they want to go over ahead of time, so when the time comes, they can start working right away. Finishing the work early means they can rest during the day.”<br/><br/>Turning his head, he looked at Xiao Jinli and said, “Good baby, you can rest at home for a while and wait for someone to call you when it’s time.”<br/><br/>Xiao Jinli shook her head, “Grandpa, I’m too excited right now to sleep, let me come with you.”<br/><br/>Just as Grandpa Xiao was about to say something, Xiao Wanshan interjected, “Dad, it’s okay for Xiao Bao to stay up late once in a while. The village’s first harvest ceremony is waiting for Xiao Bao’s return, and she will witness it for the first time, so it won’t that be great?”<br/><br/>Elder Jiang, after hearing this, asked curiously, “There’s a harvest ceremony?”<br/><br/>Grandpa Xiao laughed, “The villagers all hope that the produce from the field can be sold, so they place great importance on the first harvest.”<br/><br/>“Then we want to go and see it too!” Elder Jiang declared.<br/><br/>“Yes, yes, we want to go and see for ourselves,” the other three chimed in.<br/><br/>“But, old masters, it’s very late, you should be resting!” Xiao Li tried to stop them.<br/><br/>“Just like what Little Xiao said, what’s wrong with us staying up late occasionally?” Old Chen declared. “We just want to witness the harvest ceremony, and when we get tired, we’ll naturally return home to rest.”<br/><br/>“Besides, Brother Xiao and Brother Ji are about the same age as us, not much difference, and they’re all going over there with high spirits, so how can we lag behind?”<br/><br/>Everyone,<br/><br/>Is there even any comparison?<br/><br/>Grandpa Xiao, Xiao Jinli’s maternal grandfather, and the others usually work in the fields. They also only look to be around 60 or 70 years old, much younger than the four old masters.\t\t\t\t\t\t</div>", "images": {}, "success": true}