{"id": 268, "url": "https://www.novelhall.com/the-lucky-star-blessing-the-whole-village-32483/15193360.html", "title": "Chapter 268 - Chapter 268: Chapter 268: (First Update)", "volume": 3, "volume_title": "Volume 3", "body": "<h1>Chapter 268 - Chapter 268: Chapter 268: (First Update)</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 268: Chapter 268: (First update)<br/><br/>Translator: 549690339<br/><br/>Marriott Hotel, a five-star hotel in Ganjiang City<br/><br/>Guests are gradually coming to the restaurant for breakfast.<br/><br/>Even before entering the restaurant, they can smell a variety of delicious food aromas.<br/><br/>“What kind of breakfast has the hotel made today? It smells so good. We can smell it from such a distance?” a smartly dressed and efficient-looking lady asked the person next to her.<br/><br/>Ordinarily, she would have her breakfast sent to her room. Coming to the restaurant was simply a waste of time.<br/><br/>But today, for some unexplainable reason, she decided to go to the restaurant.<br/><br/>The assistant next to her shook her head, “I’m not sure.”<br/><br/>When they entered the restaurant, they were both somewhat stunned by the sight before them.<br/><br/>The restaurant was full of people.<br/><br/>This hotel’s breakfast was normally a self-service buffet. Guests could eat whatever they liked and leave whenever they wanted.<br/><br/>But today, there were restrictions.<br/><br/>“I want two… no, I want six eggs!”<br/><br/>The eggs in question were boiled.<br/><br/>The waiter smiled and said, “Sorry, Guest. Today we have a limit on eggs. Each person can only take two.”<br/><br/>“Really?” a dissatisfied guest retorted, “Usually, guests can take as many as they want. Now, there’s a limit?”<br/><br/>The waitress explained with an apology, “We’re sorry, but since we don’t have many boiled eggs today, we’ve decided to limit each guest to two.”<br/><br/>The hotel had not anticipated that this morning’s eggs, beef noodles, among other dishes provided by a different supplier, would be so popular.<br/><br/>Like the boiled eggs. If there wasn’t a limit, some guests might eat as many as they could and then take all the remaining eggs away. Then, what about the guests who came later?<br/><br/>For example, they offered sixty eggs in the first batch, which smelled so good that they were irresistible to the many guests who have a habit of eating eggs for breakfast. These eggs disappeared in less than two minutes after being served. Each guest took at least six eggs. For their breakfast, instead of other dishes, they only ate eggs.<br/><br/>The restaurant manager had no choice but to boil another batch of eggs and impose a limit.<br/><br/>There were several hundred guests in the hotel. They didn’t have enough eggs for everyone.<br/><br/>They only ordered six hundred eggs per day.<br/><br/>Besides breakfast, they also needed to supply eggs for lunch and dinner.<br/><br/>The assistant queued up for eggs. Since each guest could only have two, she took four and divided them into two plates.<br/><br/>Serving the eggs, she said, “President, these eggs smell so good. To limit the quantity and we managed to take the last four.”<br/><br/>Lai Shanlin, smelling the eggs, said, “These eggs do smell good.”<br/><br/>Then she peeled one off, revealing its translucent, fair, soft egg white with a tempting smell.<br/><br/>After a slight bite, she couldn’t help but exclaim, “This egg is just too delicious.”<br/><br/>Out of patience, the assistant began eating too and nodded, “This egg is so delicious. No wonder there’s a limit. Otherwise, everyone would undoubtedly grab more.”<br/><br/>While eating, she looked towards the serving area again, noticing several places where long queues were forming, especially for beef noodles.<br/><br/>Normally, there’s no need to queue up here.<br/><br/>The assistant asked, “President, do you want me to get you a bowl of beef noodles?”<br/><br/>Lai Shanlin nodded, “Sure, go ahead.”<br/><br/>The assistant quickly finished two eggs, left them on the table, fearing that the president might eat them, and then went to queue for noodles.<br/><br/>After about twenty minutes, the assistant came back with two bowls of beef noodles, saying, “President, the beef noodles also smell great. Did the hotel change chefs today? Every dish is more delicious than the last. It’s so tasty that I could swallow my tongue.”<br/><br/>Lai Shanlin took a sip of the soup and her eyes lit up, “This soup is delicious, better than any beef soup I’ve ever had.”<br/><br/>Surprised, the assistant said, “Really? Let me try it!”<br/><br/>After taking a sip, she said with astonishment, “The soup is really awesome. It’s filled with the delicious taste of beef.”<br/><br/>She then grabbed a slice of beef and tasted it, “This beef is so tender and juicy. It’s delicious. And even the vegetables taste good. President, did the hotel really change its chief cook? These breakfast dishes are really delicious.”<br/><br/>She looked longingly towards the serving area, “The other breakfast dishes must be tasty as well. President, shall we try them?”<br/><br/>Lai Shanlin replied with a touch of speechlessness, “After you’ve had two eggs and a bowl of beef noodles, do you still have room in your stomach?”<br/><br/>She knew her assistant too well. Normally, her appetite was so small. After eating two eggs and a bowl of beef noodles, she would probably be full.<br/><br/>Instantly, the assistant regretted, “Ah, if I’d known the breakfast here was so delicious, I would have come earlier. I’ll try the other dishes after I rest awhile.”<br/><br/>Lai Shanlin looked at her with a slightly surprised expression and stated, “I never knew you were such a foodie. But there’s no foodie with such a small appetite like you. We’re going to stay here for three or four more days. We can try out every breakfast dish during this period.”<br/><br/>However, after the next four days, she was reluctant to leave after finishing her own business.<br/><br/>Not only were the breakfasts tempting, but the hotel’s lunches and dinners were also incredibly enticing.<br/><br/>Furthermore, there were more and more people coming to the hotel for meals. For the next three days after the first day, the restaurant was packed daily.<br/><br/>More and more people were booking meals at the hotel. In the end, they had to turn away some customers.<br/><br/>For the guests who stayed in the hotel, aside from those staying in the VIP deluxe rooms that had an advanced booking service, other guests had to go to the restaurant to get breakfast themselves. This way, they wouldn’t offend any of the guests.<br/><br/>As a result, guests had to get up early or send their subordinates to the restaurant early to queue for breakfast. Otherwise, breakfast might be sold out before seven o’ clock.<br/><br/>The hotel never expected that although it was mainly an accommodation service, when did it turn into a restaurant? Every day, groups of customers came to dine, whether it was for breakfast, lunch, dinner, or even midnight snacks.<br/><br/>However, with the influx of guests, the problem troubling the hotel’s general manager was the insufficient supply of ingredients for the meals.<br/><br/>General Manager Wan Yuan looked anxiously at the purchasing manager and asked, “Manager Wang, can’t we purchase more ingredients? We simply can’t suffice with daily supplies of three thousand jin, and the variety is extensive.”<br/><br/>Manager Wang replied with a bitter smile, “Boss Wan, when we initially signed the contract, we agreed on a daily supply of two thousand jin. Now that it has increased to three thousand jin, it’s only because the manager of the supplier is a friend of mine from school. Any more would be impossible. The other hotels absolutely cannot increase their supply. Isn’t this what we’ve been trying to solve all day?”<br/><br/>Boss Wan,<br/><br/>Manager Wang was also troubled.<br/><br/>He never expected the hotel to turn into a restaurant.<br/><br/>When they had decided to switch suppliers, many higher-ups disagreed. It was only after Boss Wan tasted the food that he made the decision to switch.<br/><br/>However, who could’ve expected that such a decision would make the business of the hotel so booming?\t\t\t\t\t\t</div>", "images": {}, "success": true}