{"id": 267, "url": "https://www.novelhall.com/the-lucky-star-blessing-the-whole-village-32483/15193359.html", "title": "Chapter 267 - Chapter 267: Chapter 267:", "volume": 3, "volume_title": "Volume 3", "body": "<h1>Chapter 267 - Chapter 267: Chapter 267:</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 267: Chapter 267:<br/><br/>Translator: 549690339<br/><br/>Sun Xiaoping takes her husband and son back to her maiden home today.<br/><br/>As soon as they arrive, Sun Xiaoping notices the tomatoes on the tea table and asks with some confusion, “Mom, why did you put the tomatoes here today? Aren’t you going to use them for cooking?”<br/><br/>Grandma Sun laughs and says, “I saved three for cooking, and the rest are to be eaten as fruit. Try them, they’re especially delicious.”<br/><br/>With that, she turns to her listless grandson, holding a tomato, saying, “Come, Xiao Bao, this tomato is really delicious, want to try?”<br/><br/>Sun Xiaoping looks at her spiritless son and says with concern, “Ever since the child caught a cold recently, he has been listless and not interested in eating. In just a few days, his whole body has become so thin that his eyes sunk in. We took him to the hospital for a check-up, and the doctor said that his cold was cured, but he needs to adjust and recover his spirit on his own.”<br/><br/>Grandma Sun feels heartache upon hearing this and immediately hugs her grandson and says, “My poor, good grandson.”<br/><br/>Thinking about something, she immediately tells her daughter, “Go, cut the tomato and bring it over for Xiao Bao to eat.”<br/><br/>Sun Xiaoping says, “Mom, Xiao Bao doesn’t even eat his favorite strawberries anymore, let alone, he doesn’t like tomatoes.”<br/><br/>Grandma Sun says impatiently, “I told you to cut it, just cut it, don’t talk so much.”<br/><br/>Sun Xiaoping,<br/><br/>With no choice, she gets up and cuts a tomato.<br/><br/>Soon, a surprised voice comes from the kitchen, “Mom, this tomato is too delicious.”<br/><br/>Grandma Sun says, “If you’ve cut it, then bring it out for my baby grandson to eat.”<br/><br/>Sun Xiaoping brings the cut tomato over, and then Xiao Bao wrinkles his nose and says, “It smells so good.”<br/><br/>Grandma Sun’s eyes light up, and she says happily, “Does it smell good? Xiao Bao, try it and see if it’s good or not, okay?”<br/><br/>Xiao Bao nods and says, “Okay!”<br/><br/>After that, he takes a bite of the tomato, his eyes suddenly light up, and he says while eating, “Grandma, this tomato is so delicious!”<br/><br/>“Hehe, if it’s delicious, then eat more!” Grandma Sun laughs and says.<br/><br/>Sun Xiaoping’s husband raises his eyebrows in curiosity and asks, “Is a tomato really that delicious?”<br/><br/>“It’s delicious, Dad!” Xiao Bao says. “Dad, you try it too!”<br/><br/>With a curious heart, he tries a piece, and then can’t help but praise, “It’s really delicious. Mom, where did you buy these tomatoes? When we go back, I’ll go buy some too.”<br/><br/>Mainly because his son is finally willing to eat. In recent days, the whole family has been worried about getting him to eat.<br/><br/>Grandma Sun laughs and says, “It’s from the Xiao Family Village Green Fresh Vegetable Shop just outside the neighborhood. I bought all of today’s vegetables from there. I bought duck meat, cabbage, eggplant, and a grass carp!”<br/><br/>Sun Xiaoping says, “Okay, Mom, I’ll go cook.”<br/><br/>When Sun Xiaoping saw the fresh vegetables and fish that her mother brought back, she didn’t pay much attention.<br/><br/>But when these dishes were cooked, even with the use of a range hood, the whole house was filled with fragrance.<br/><br/>Her husband can’t help but say, “It smells so good. And sniffing this aroma makes me feel especially comfortable, and my mind is much clearer.”<br/><br/>Xiao Bao wrinkles his nose, his eyes filled with anticipation, and he says, “Grandma, it smells so good. I want to eat.”<br/><br/>Grandma Sun says happily, “Good, wait for your mom to finish cooking, and then Xiao Bao can eat well.”<br/><br/>When the dishes were served, Sun Xiaoping takes off her apron and asks in surprise, “Mom, where did you buy the vegetables? They’re especially fragrant when cooked. Especially this duck meat, it’s tender and very fragrant. I’ve never tasted such delicious duck meat before.”<br/><br/>“It’s all bought from that store.” Grandma Sun looks at her grandson eating with relish and says happily, “It’s just that the stuff from that store is more expensive than the market, and a lot more expensive. Today is only their second day of opening.”<br/><br/>Sun Xiaoping’s husband laughs and says, “Mom, people sell things at a high price for a reason. Look at these vegetables, they smell good and they must taste good too.”<br/><br/>Grandma Sun laughs and says, “I know Xiao Ping’s cooking skills, they’re just average. Now these dishes smell so good and taste good too, it must be because of the good ingredients.”<br/><br/>Sun Xiaoping watches her son enjoying the meal and says with a laugh, “Xiao Bao hasn’t eaten so deliciously for a long time. Husband, let’s go to that store when we go back and buy some vegetables too!”<br/><br/>Xiao Bao immediately says, “I want to eat tomatoes and duck meat too!”<br/><br/>“Okay, whatever you want to eat, we’ll buy it!” Sun Xiaoping laughs and says.<br/><br/>Sun Xiaoping’s family of three stayed at her mother’s house until three or four in the afternoon.<br/><br/>Sun Xiaoping says, “Mom, Xiao Bao has to go to school tomorrow, so we’re leaving. We’ll come back next week!”<br/><br/>Grandma Sun tidies up and says, “I’m going to the store with you!”<br/><br/>When they arrive at the store, they find it completely empty!<br/><br/>Grandma Sun asks, “Where are the vegetables in your store?”<br/><br/>Xiao Chunhua laughs and says, “All sold out. We sold out at around 10 o’clock this morning.”<br/><br/>Grandma Sun is slightly surprised and asks, “So early today?”<br/><br/>Xiao Chunhua nods and says, “Yes, there were a lot of returning customers today. They brought more customers, and suddenly many people came to buy. We sold out early today!”<br/><br/>Grandma Sun asks anxiously, “Will new vegetables arrive this afternoon?”<br/><br/>Xiao Chunhua shakes her head and says, “Aunt, they won’t be here until tomorrow morning!”<br/><br/>Grandma Sun is slightly disappointed and says, “Not until tomorrow morning!”<br/><br/>She then turns to her daughter and says, “I’ll take the vegetables from home back and buy more in the morning to send them to you!”<br/><br/>Sun Xiaoping refuses and says, “Mom, don’t bother!”<br/><br/>Grandma Sun gets a little angry and says, “What do you mean don’t bother? Those vegetables are for my good grandson. The child has been sick for a while, and it’s not easy for him to have an appetite. Of course, he needs to be well nourished! You wait here, and I’ll go get them!”<br/><br/>Within three days of opening, all the goods in the store sell out in less than an hour on the third day!<br/><br/>In just a few days, the name of Xiao Family Village Green Fresh Vegetable Shop spread throughout the county town!<br/><br/>Two stores, 6,000 pounds of goods, are simply not enough to sell!<br/><br/>Many customers who couldn’t buy even complained to the Bureau of Industry and Commerce that they sold too little, and many people couldn’t buy!<br/><br/>Facing the inquiries from the Bureau of Industry and Commerce, Xiao Chunhua and others,<br/><br/>They’ve seen complaints about underweight and cheating consumers, but never thought they’d be complained about for selling too well!<br/><br/>Strange things happen every year, but there are especially many this year!\t\t\t\t\t\t</div>", "images": {}, "success": true}