{"id": 269, "url": "https://www.novelhall.com/the-lucky-star-blessing-the-whole-village-32483/15193361.html", "title": "Chapter 269 - Chapter 269: Chapter 269: (Second Update)", "volume": 3, "volume_title": "Volume 3", "body": "<h1>Chapter 269 - Chapter 269: Chapter 269: (Second Update)</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 269: Chapter 269: (Second Update)<br/><br/>Translator: 549690339<br/><br/>To become a supplier for a five-star hotel, one must be a strong and well-connected company.<br/><br/>Initially, it was Manager Wang’s classmate who introduced Xiao Junxuan. Xiao Junxuan didn’t say much, and directly offered the things he brought. Those that could be eaten raw were tasted by the procurement manager, while the others were cooked by the kitchen.<br/><br/>At that time, Manager Wang was shocked by the taste of the food and wanted to sign a contract with Xiao Junxuan on the spot.<br/><br/>Unfortunately, he had a superior to report to.<br/><br/>Moreover, they had suppliers they were happy to work with, and they couldn’t just cut ties, as it would breach the contract.<br/><br/>Manager Wang said, “Mr. Xiao, although I’m just a procurement manager, our hotel already has suppliers, and we can’t just change suppliers at will. Secondly, such a big decision doesn’t fall on me. Can I contact you after reporting to my superior?”<br/><br/>Xiao Junxuan said, “Sure, Manager Wang. However,”<br/><br/>He shifted the topic, “There are three four-star hotels in Ganjiang City, and all of them have signed a supply contract with me. Wanhao is the only five-star hotel in the city, so I think it should have the best accommodation and catering services, right? To be honest, our company is in its first year of farming, and the production area is not large, just over 600 acres. When all the crops are on the market, we can only produce about twenty thousand pounds per day. We have five or six shops ourselves, and if we seek cooperation with a few hotels and restaurants, our daily sales would be about right.”<br/><br/>Meaning, if they missed this village, there wouldn’t be another shop.<br/><br/>Manager Wang immediately understood Xiao Junxuan’s meaning.<br/><br/>After contemplating a bit, he said, “Mr. Xiao, could you wait a moment while I report to our superior?”<br/><br/>Then he left.<br/><br/>When he returned, he brought Manager Wan with him.<br/><br/>Manager Wan was not in favor of changing suppliers for food procurement.&gt;<br/><br/>After all, their hotel was quite happy with their current supplier, and changing suppliers would be considered a breach of contract.<br/><br/>However, since Manager Wang, the procurement manager, agreed to change suppliers, Manager Wan came to take a look.<br/><br/>After tasting everything Xiao Junxuan brought, he asked seriously, “Mr. Xiao, can you guarantee that the food you supply will always be of this quality?”<br/><br/>Xiao Junxuan immediately replied seriously, “Definitely. Doing business is all about integrity. If the food we supply doesn’t have this quality, we would be committing fraud, and the contract could be canceled anytime. Plus, we would pay three times the contract penalty.”<br/><br/>Manager Wan nodded and said, “Alright, I will make the decision. Manager Wang, this matter will be your responsibility. I will be responsible for the board of directors.”<br/><br/>Manager Wan was very grateful that he made that decision back then.<br/><br/>Otherwise, he would probably have to watch helplessly as his customers all ran to the other three hotels.<br/><br/>Just now, his biggest worry was that catering couldn’t keep up with the daily influx of customers.<br/><br/>Before, he was worried about how to attract customers.<br/><br/>Now he worried about having too many customers.<br/><br/>Manager Wan thought for a moment and said, “Manager Wang, prepare for a trip. I want to visit that company!”<br/><br/>Try to buy more supplies.<br/><br/>Manager Wang’s eyes lit up, and he immediately responded, “Alright, Manager Wan!”<br/><br/>Manager Wan’s phone rang again.<br/><br/>Manager Wan looked at the incoming call display with a helpless expression.<br/><br/>Seeing this, Manager Wang asked, “Manager Wan, is it another reservation for a table?”<br/><br/>Manager Wan nodded and said, “Yes.”<br/><br/>Manager Wang shook his head with a smile, “But our reservations are already booked up for the next five days.”<br/><br/>The same thing happened to the other three four-star hotel businesses, which were also booming.<br/><br/>Many people with status couldn’t reserve a table at the five-star hotel, so they tried the other three hotels. But the demand was just as high there too.<br/><br/>Many people were wondering why these four hotels were doing so well at the same time.<br/><br/>It wasn’t because they changed chefs; it must be an issue with the food quality.<br/><br/>At the same time, there were three vegetable stores in Ganjiang City called “Xiao Family Village Green Fresh Vegetable Shop” that were also becoming popular.<br/><br/>The vegetables and meats bought from these shops tasted just like those served in the hotels. Of course, the taste was slightly different because of the chefs’ skills.<br/><br/>The dishes prepared by the chefs were even more delicious.<br/><br/>Therefore, in just a few days, the entire Ganjiang City was caught in a frenzy of buying and eating.<br/><br/>Recently, the villagers in Xiao Family Village were all in high spirits, smiling from ear to ear.<br/><br/>“Ah, we didn’t expect our vegetables to sell so well,”<br/><br/>“Indeed. Didn’t you see, many big bosses have come and expressed their intention to increase supplies, or those who haven’t cooperated yet want to work with our company.”<br/><br/>“Sigh, it’s a pity that we only have this many fields, and we can’t supply too many people.”<br/><br/>“Haha, before we used to worry about how to sell our stuff. Now we worry about too many people buying.”<br/><br/>“Yes, and our produce is sold at a high price. Even though we sell so much, the price is not low. It really caught us by surprise.”<br/><br/>“Xiao Yucheng said that after the first batch of agricultural products are sold, we could get our first dividend.”<br/><br/>“I don’t know how much the dividend will be. Our family has invested three acres of land.”<br/><br/>“My family has invested five acres of land. And my Little Qing is now working at the store, earning a monthly salary of over two thousand yuan.”<br/><br/>“Xiao Yucheng said that as the company expands in the future and we open more shops, when the company recruits employees, priority will be given to the people of Xiao Family Village.”<br/><br/>After the four elders moved into Xiao Family Village, they found it more and more comfortable.<br/><br/>Just as Jinli said, the villagers of Xiao Family Village were pure, kind-hearted, and sincere. Other villages might have some underhanded dealings, but not Xiao Family Village.<br/><br/>All the villagers of Xiao Family Village were very united and friendly. Even if there were some arguments, they would persuade each other with reason. The one who lost the argument would apologize to the other.<br/><br/>The four elders had seen many people and encountered various situations in their time, but they had never seen a village as united and friendly as Xiao Family Village.<br/><br/>Since moving to Xiao Family Village, the four elders also helped out in the fields like the villagers and sat under the trees in the village, chatting and enjoying themselves.<br/><br/>Old Chen said, “Jinli was right. This village is really nice. No wonder she loves the village so much.”<br/><br/>Elder Li nodded and said, “Didn’t you see? Jinli acted like an adult in the capital, but in the village, she’s an obedient child. However, when it comes to important matters, the villagers still like to ask Jinli for advice.”<br/><br/>Elder Jiang said, “My granddaughter is a truly lovable child, indeed.”\t\t\t\t\t\t</div>", "images": {}, "success": true}