{"id": 270, "url": "https://www.novelhall.com/the-lucky-star-blessing-the-whole-village-32483/15193362.html", "title": "Chapter 270 - Chapter 270: Chapter 270: The Cunning And Cute Child 1 (First Update)", "volume": 3, "volume_title": "Volume 3", "body": "<h1>Chapter 270 - Chapter 270: Chapter 270: The Cunning And Cute Child 1 (First Update)</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 270: Chapter 270: The Cunning and Cute Child 1 (First Update)<br/><br/>Translator: 549690339<br/><br/>Eight years later<br/><br/>A girl with a ponytail, wearing a white T-shirt and jeans, looking tall and graceful, was sitting in the economy class of an airplane, wearing headphones and closing her eyes to rest, leaning on the seatback.<br/><br/>Suddenly, a flight attendant tapped her shoulder.<br/><br/>Xiao Jinli opened her eyes, which were as splendid as bright stars, beautiful and profound.<br/><br/>Xiao Jinli looked at the flight attendant and asked, “What’s the matter?”<br/><br/>The flight attendant politely said, “Miss Xiao, I apologize for the interruption. The thing is, this child is looking for his mother, and he says you are her. So, I brought him to find you!”<br/><br/>The flight attendant pointed to a three- or four-year-old boy beside her.<br/><br/>The little boy had fair skin, chubby cheeks, and a pair of big round eyes. He was very cute, especially with his slightly curly black hair, which made him even more adorable.<br/><br/>Before Xiao Jinli could react, the little boy let go of the flight attendant’s hand and threw himself on her lap.<br/><br/>“Wuuu, Mommy, I finally found you.” The little boy cried, rubbing his tears on Xiao Jinli’s white clothes.<br/><br/>Xiao Jinli’s face was a mix of confusion, and she felt somewhat unwell.<br/><br/>When did she have such a big son?<br/><br/>She took off her headphones and said solemnly, “Little friend, you’ve mistaken me for someone else. I am not your mother.”<br/><br/>But the little boy was very determined and said, “Wuuu… you are my mommy, I won’t be mistaken. Are you not wanting me because I’m disobedient? I promise I will be obedient from now on, please don’t abandon me! Wuuu… please don’t leave me behind, can you take me away from my abusive father? I don’t want to be beaten by my dad!”<br/><br/>The passengers around them and the flight attendant,<br/><br/>No one expected that such a beautiful girl would turn out to be a selfish mother who abandoned her child.<br/><br/>Knowing that her husband is abusive, she only thinks of escaping by herself, without taking her child. Does she intend to leave the child to face his father’s violence alone?<br/><br/>Thus, everyone looked at Xiao Jinli with strange eyes.<br/><br/>Xiao Jinli listened to the boy’s blabbering and became more annoyed.<br/><br/>Xiao Jinli took a deep breath and spoke patiently, forcing a smile, “Little friend, you got it wrong. I haven’t even gotten married yet, so where could I have a child? How about this, let the flight attendant sister take you to report to the police, and let the policing officer uncle help you find your mother, is that okay?”<br/><br/>Upon hearing Xiao Jinli’s words, the little boy cried even harder.<br/><br/>From the perspective of the people around, it seemed like he was heartbroken and desperate because he was abandoned by his mother.<br/><br/>The little boy cried loudly and sadly, “Wuuu… Mommy, are you afraid that I will affect you finding a boyfriend? Mom, don’t worry, I will be obedient and well-behaved, as long as you give me a meal, I will do all the work at home, so you can go on dates with your boyfriend, is that okay?”<br/><br/>Xiao Jinli,<br/><br/>Was this little boy truly looking for his mother, or did he come specifically to mess with her and discredit her reputation?<br/><br/>Did she have a grudge against him? So now he’s come to take revenge?<br/><br/>She glanced at the little boy, who was white and chubby like a radish, full of doubt and thought to herself, “Looking like this, what sort of tasks can he do, and how could he handle all the housework?”<br/><br/>Before Xiao Jinli could say anything, a passenger couldn’t stand it anymore.<br/><br/>“What kind of mother are you? If your husband doesn’t treat you well, it’s one thing to desert him, but to abandon your child as well? How can your conscience bear that?”<br/><br/>“Isn’t it, such a lovely child, she could actually bear to abandon him? Is this even a mother?”<br/><br/>“A mother like you is so selfish, only thinking of escaping unhappiness yourself, but leaving unhappiness to your son.”<br/><br/>Xiao Jinli took a deep breath and said to the flight attendant, “I’m sorry, but I don’t know this child. Since he was able to board the plane, there must be some information. You can check it, then send him back to his parents.”<br/><br/>The flight attendant listened, and her gaze towards Xiao was slightly contemptuous, but she still politely said, “I’m sorry, Miss Xiao, we’ve checked the child’s information and couldn’t find anything. According to him, he came with you, and we’ve also reviewed the surveillance footage, and the child indeed entered the plane with you.”<br/><br/>Xiao Jinli listened and said somewhat angrily, “Is your security check so careless? A child without any information can actually board a plane? If his family discovered he was missing, how anxious would they be? Also, I’ll say it again, I don’t know this child, and I’m not his mommy.”<br/><br/>“Waaa…” After hearing Xiao Jinli’s words, the little boy cried more sadly and said, “Waaa, mommy doesn’t want me anymore, now I have a violent father, and from now on, I will be an unwanted orphan. Waaa… I’m so young, why is my life so bitter?”<br/><br/>Xiao Jinli,<br/><br/>The surrounding passengers,<br/><br/>What a pitiful child, having such a selfish and cold-hearted mother.<br/><br/>An auntie stood up and said, “Little friend, don’t be sad. It’s okay not to have such an irresponsible mother. Grandma will take you back and take good care of you.”<br/><br/>Having said that, she wanted to take the little boy’s hand.<br/><br/>Xiao Jinli frowned slightly.<br/><br/>As soon as the little boy heard this, he immediately shook off her hand, his eyes filled with fear, “You… you’re a bad person, I don’t want to go with you.”<br/><br/>The auntie was very unhappy and said, “What’s wrong with you? Your mother doesn’t want you, and when I say I’ll take you in, you call me a bad person. It’s so ungrateful.”<br/><br/>Xiao Jinli said lightly, “Auntie, who just steps up and takes a child back like that?”<br/><br/>The auntie said angrily, “If you don’t take care of him, is it not allowed for someone else to? Do you think everyone is as selfish as you?”<br/><br/>Xiao Jinli chuckled, not angry but amused, “Let’s put aside whether I’m selfish or not. But Auntie, if someone else doesn’t take care of the child, you’ll take him in? There are so many children in the orphanage, why don’t you raise them? Also, if the child doesn’t want to go with you, and you start cursing him, what kind of person are you?”<br/><br/>The little boy pointed at the auntie and suddenly said, “Mommy, I know this person. Before, she followed a mother with a child. While the child’s mother was bowing her head to tie her shoelaces, she tried to carry away the child in the stroller. Fortunately, that mother was alert and immediately snatched the child back, and she escaped. I didn’t expect to meet her here.”<br/><br/>The auntie’s face darkened, and a flash of panic appeared on her face. She said nervously and guiltily to the little boy, “You’re talking nonsense. I’ll sew your mouth shut!”<br/><br/>“Waaa, mommy, this bad person is so terrifying!” The little boy’s face showed a scared expression as he cried, “She’s a child abductor! She must be trying to take me away and sell me to some faraway place. Wuuu… I don’t want that!”<br/><br/>After hearing this, the auntie became angry and anxious, as if she couldn’t wait to tear the child’s mouth apart.<br/><br/>“You…”<br/><br/>She reached out to grab the child.<br/><br/>Xiao Jinli immediately protected him, warning loudly, “I advise you not to touch him!”\t\t\t\t\t\t</div>", "images": {}, "success": true}