{"id": 278, "url": "https://www.novelhall.com/the-lucky-star-blessing-the-whole-village-32483/15193370.html", "title": "Chapter 278 - Chapter 278: Chapter 278: (First Update)", "volume": 3, "volume_title": "Volume 3", "body": "<h1>Chapter 278 - Chapter 278: Chapter 278: (First Update)</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 278: Chapter 278: (First Update)<br/><br/>Translator: 549690339<br/><br/>The rapid development of Xiao Family Village Green Fresh Company over the past few years has not gone unnoticed.<br/><br/>Especially the agricultural tycoons, who seem extremely anxious.<br/><br/>Many companies they have collaborated with, particularly in the catering industry, have chosen to terminate their contracts and cooperate with Green Fresh Company instead.<br/><br/>However, Xiao Family Village Green Fresh Company is selective in choosing their partners.<br/><br/>At the same time, due to limited product resources, they only choose two or three partners in one place in addition to supplying their own stores, resulting in fierce competition.<br/><br/>Despite this, to the agricultural tycoons, Xiao Family Village Green Fresh Company doesn’t seem to have a large market share.<br/><br/>But a small market doesn’t mean it won’t grow.<br/><br/>The market is small only because their company is small, with limited products, unable to supply more people.<br/><br/>That’s why the agricultural tycoons are even more worried.<br/><br/>If Xiao’s Green Fresh Company grows and can continuously supply products, how much market share could they maintain?<br/><br/>Thus, the best course of action would be to either acquire the company before it grows, or eradicate it while it’s still vulnerable; otherwise, future troubles will be endless.<br/><br/>Haidu City Vegetable Group, Qingling City Green Garden Group, and Jingjing Green Health Group are the three major players in the national agricultural product industry.<br/><br/>Together, they occupy nearly 70% of the national market.<br/><br/>All major hotels, restaurants, supermarkets, corporate cafeterias, and government agencies within the country collaborate with these groups. Moreover, they have opened chain stores across the nation.<br/><br/>From the beginning, they have been highly vigilant and wary of the emerging Xiao Family Village Green Fresh Company.<br/><br/>Why?<br/><br/>Jingjing Green Health Group has seized Jiangzhou Province and its surrounding market with a dozen provincial capital markets.<br/><br/>Naturally, the market of Ganjiang City is under its control.<br/><br/>The ingredient supply for Ganjiang City’s three-star and higher hotels and large restaurants is covered by Jingjing Green Health Group.<br/><br/>Xiao Junxuan effortlessly took over an order for a five-star hotel and two four-star hotels initially. After this, the hotels directly ended their contracts with Jingjing Green Health Group, not giving the branch manager any time to react.<br/><br/>But by the time they reacted, Xiao Family Village Green Fresh Company’s goods had already been supplied, and they quickly gained popularity at lightning speed.<br/><br/>These three hotels and large restaurants are full of customers daily.<br/><br/>At this time, it is practically impossible for the manager of Jingjing Green Health Company’s Ganjiang City branch to even discuss cooperation.<br/><br/>At that time, Xiao Family Village Green Fresh Company didn’t continue to poach other clients.<br/><br/>However, this emerging company cannot be underestimated, so the branch manager immediately reported the situation.<br/><br/>Upon learning this, the group directly sent people to the hotel for a meal. After eating, even the group’s employees almost wanted to quit their jobs and go work directly for the Xiao Family Village Green Fresh Company so they could enjoy such food daily.<br/><br/>Jingjing Green Health Group’s Chairman and President, Zhang Jingjing, felt a strong sense of threat based on her years of experience in the commercial field.<br/><br/>She immediately convened an executive meeting and issued the strongest instruction to maintain all existing clients and remain highly vigilant against Xiao Family Village Green Fresh Company. The executives were to investigate the details of the company and, if necessary, use extreme measures to either have the company join Jingjing Green Health Group or eradicate it before it grows further and becomes a crisis.<br/><br/>After giving the order, Zhang Jingjing personally went to Xiao Family Village.<br/><br/>She disguised herself as a customer.<br/><br/>Upon arriving, she couldn’t help but narrow her eyes when she saw the lush and pleasing crops in the field.<br/><br/>As an industry professional, she could tell at a glance how good the crops were, and having tasted their flavor, she couldn’t deny that the quality of vegetables from Xiao Family Village Green Fresh Company was significantly better than that of Jingjing Green Health Group. Jingjing Green Fresh Group couldn’t even compare.<br/><br/>This frustrated her.<br/><br/>So, after pondering for a while, she decided to seize this company before it could grow further.<br/><br/>Once it became part of the Jingjing Group, with its quality and taste, it would certainly be the industry leader nationwide, and possibly even expand to foreign markets and become the world’s top player.<br/><br/>The more Zhang Jingjing thought about it, the more excited she became.<br/><br/>Zhang Jingjing went directly to see General Manager Xiao Yucheng of the company.<br/><br/>Zhang Jingjing said frankly, “President Xiao, I’m Zhang Jingjing from Jingjing Green Health Group. My purpose here is to hope that your company can join our Jingjing Group. I will use all the resources of our group to promote Xiao Family Village’s agricultural products nationwide, even worldwide.”<br/><br/>For an ordinary company, this is a very tempting offer.<br/><br/>Being part of a large company or group means having the best resources and promotional channels, providing the best opportunities for a small, unknown company.<br/><br/>Joining a large company or group has its advantages and disadvantages.<br/><br/>The advantages are rapid development with the help of a large company.<br/><br/>The disadvantage is that once you join a large company, you will be heavily restrained and have no say in the matter.<br/><br/>Before becoming the general manager, Xiao Yucheng had of course learned about the industry and was naturally aware that Jingjing Green Fresh Group is one of the top three players in the national industry.<br/><br/>Xiao Yucheng smiled and directly refused, “I’m sorry, Chairman Zhang, our company will not join any large company or group.”<br/><br/>That’s a joke. While it sounds nice, once actually merged into a large company, their small company would not have any say in decision-making and lose the collective interests of their entire organization.<br/><br/>Furthermore, they never intended to join any company.<br/><br/>The original purpose of their company’s establishment was to lead the whole village into prosperity.<br/><br/>Joining a large company would severely infringe on the interests of the village, and it would be contrary to the original intention of establishing the company.<br/><br/>Hearing such a straightforward refusal, Zhang Jingjing’s face turned very unpleasant.<br/><br/>Speaking in a slightly heavier tone, she said, “President Xiao, I hope your company will reconsider. Your company has only taken a few clients from us, which we don’t really care about. But your company is still in its infancy and can easily be nipped in the bud, or even uprooted and destroyed.”<br/><br/>Although it seemed like advice, it was actually a blatant threat.<br/><br/>At present, Xiao Family Village Green Fresh Company is like an egg compared to the huge rock that is Jingjing Group.<br/><br/>It would be as easy as crushing an egg for the huge rock to smash it.<br/><br/>Xiao Yucheng remained calm, smiling faintly, “Chairman Zhang doesn’t need to worry. Our company has modest ambitions and only wants to be self-reliant in our small plot of land. Chairman Zhang, take care. Goodbye.”<br/><br/>Zhang Jingjing left with her face turning blue from anger.<br/><br/>However, before leaving, she said, “I still hope you will reconsider carefully and not regret your decision in the future.”\t\t\t\t\t\t</div>", "images": {}, "success": true}