{"id": 274, "url": "https://www.novelhall.com/the-lucky-star-blessing-the-whole-village-32483/15193366.html", "title": "Chapter 274 - Chapter 274: Chapter 274:", "volume": 3, "volume_title": "Volume 3", "body": "<h1>Chapter 274 - Chapter 274: Chapter 274:</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 274: Chapter 274:<br/><br/>Translator: 549690339<br/><br/>“Wow, what is this? Mommy, is this a snake?”<br/><br/>As Jiang Yifan entered the greenhouse, she saw earthworms tumbling everywhere on the ground, and she couldn’t help exclaiming.<br/><br/>“But if it’s a snake, it’s a bit small!” Jiang Yifan asked doubtfully, “Mommy, what are these things?”<br/><br/>“They are earthworms!” Xiao Jinli said.<br/><br/>Jiang Yifan, still puzzled, asked, “Earthworms? What are earthworms?”<br/><br/>Xiao Jinli thought for a moment before explaining, “Earthworms, also known as earth dragons, are terrestrial invertebrates belonging to the phylum Annelida and class Oligochaeta.”<br/><br/>Jiang Yifan nodded, pretending to understand.<br/><br/>Jiang Yifan looked at the earthworms wiggling all over the ground and felt a bit creeped out. There were so many of them.<br/><br/>“So Mommy, why are you raising so many earthworms?”<br/><br/>Xiao Jinli said, “To sell them, of course!”<br/><br/>Xiao Jinli’s earthworm farm had expanded from thirty mu at first to over three hundred mu now.<br/><br/>Out of these, three hundred mu of land were used for earthworm breeding for the company’s farming needs.<br/><br/>The remaining thirty-six mu of land were used to breed earthworms for exportation.<br/><br/>Back then, Gao Jianjun sold a few hundred earthworms as high-end ingredients in foreign countries. The price had once reached 88,000, but no matter how high the price, Xiao Jinli prioritized using the money for the development of Xiao Family Village.<br/><br/>In just half a year, the green agricultural products of Xiao Family Village had become a household brand.<br/><br/>Though expensive for ordinary people, the products were still within their affordable range.<br/><br/>Many people who had tasted the products from Xiao Family Village could hardly forget them. Moreover, the more one consumed them, the healthier they became.<br/><br/>This was also the slogan of the company’s brand.<br/><br/>After inviting several old gentlemen to stay in Xiao Family Village, the company suddenly became high-profile. Besides requesting strict product standards, they particularly emphasized the products’ special effects and benefits.<br/><br/>Therefore, Xiao Family Village’s agricultural products were always in great demand whenever they hit the market.<br/><br/>As Xiao Jinli had predicted, the products from Xiao Family Village would definitely draw the attention of various forces once they were launched.<br/><br/>Many big capital players wanted to take a bite of this big piece of fat, but these forces were warned before they even started!<br/><br/>Later, after a series of inquiries, they found out that several important figures were present in Xiao Family Village, and even one child from the village was the adoptive granddaughter of one of them!<br/><br/>Hearing such information, even the most powerful and wealthy capital players had no choice but to give up their intentions.<br/><br/>Of course, besides supplying ordinary consumers, the Xiao Family Village also opened another channel for the high-end market.<br/><br/>The agricultural products in the high-end market were personally supervised and managed by Xiao Jinli. Furthermore, the plants grown in the field had better growth and better taste, and they were even more effective for health!<br/><br/>However, the selling price of the products in the high-end market was several times, even more than ten times higher than those in the ordinary market.<br/><br/>For example, in the same place, a cabbage sold for one yuan per jin in the market, while there were two kinds of prices in Xiao Family Village’s store: one for two or three yuan per jin, and the other for thirty yuan per jin. High-end consumers could even choose to have the goods delivered to their door!<br/><br/>Despite the high prices, consumers still scrambled to buy the products from Xiao Family Village’s store!<br/><br/>In one year, Xiao Family Village’s store expanded nationwide.<br/><br/>Every county and above would have at least one store!<br/><br/>As for partnering hotels and restaurants, they would carefully select the ones with the best reputation!<br/><br/>However, only one or at most two could partner with them at the county level and above.<br/><br/>That being said, the competition in the catering industry was fierce!<br/><br/>Xiao Family Village’s Green Fresh Company in Xiao Family Village was thriving and growing rapidly!\t\t\t\t\t\t</div>", "images": {}, "success": true}