{"id": 271, "url": "https://www.novelhall.com/the-lucky-star-blessing-the-whole-village-32483/15193363.html", "title": "Chapter 271 - Chapter 271: Chapter 271: The Cunning And Cute Child 2 (Second Update)", "volume": 3, "volume_title": "Volume 3", "body": "<h1>Chapter 271 - Chapter 271: Chapter 271: The Cunning And Cute Child 2 (Second Update)</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 271: Chapter 271: The Cunning and Cute Child 2 (Second Update)<br/><br/>Translator: 549690339<br/><br/>While getting off the airplane, Xiao Jinli helplessly brought along the child.<br/><br/>Xiao Jinli’s original intention was to have the flight attendant send the child to the Yamen.<br/><br/>However, the child was smart and clever, and was determined to follow Xiao Jinli, insisting on sticking with her.<br/><br/>After the flight attendant reported the case, the policing officer took down Xiao Jinli’s information and let her take the child away.<br/><br/>First, let the child stay with Xiao Jinli, while they try their best to find the parents as soon as possible.<br/><br/>At the same time, the Auntie on the plane indeed turned out to be a human trafficker.<br/><br/>After the flight attendant reported the case, the officers investigated the information, found the person, and confirmed that there was suspicion of child trafficking, so they were taken to the Yamen upon deplaning.<br/><br/>Xiao Jinli carried a small bag and held Jiang Yifan’s hand.<br/><br/>Yes, the little boy is named Jiang Yifan, three and a half years old, and currently a runaway.<br/><br/>He met Xiao Jinli on the road and, seeing her beautiful appearance, decided to follow her all the way onto the airplane, where his lack of accompanying information was discovered by the flight attendant checking tickets.<br/><br/>Upon questioning, he said, “I followed my mommy on board, her name is Xiao Jinli.”<br/><br/>As for how he knew her name was Xiao Jinli, hehe, that was no match for the smart and invincible little friend Jiang Yifan, of course.<br/><br/>He obviously saw it on Xiao Jinli’s plane ticket.<br/><br/>Xiao Jinli, of course, had no defenses against this child and naturally did not notice the little tail following her behind.<br/><br/>Xiao Jinli sarcastically said, “You little rascal, following me and clinging to me, aren’t you afraid I’ll sell you?”<br/><br/>Jiang Yifan laughed confidently, “I know Mommy is a very kind person because she is so beautiful.”<br/><br/>“Call me sister!” Xiao Jinli corrected him.<br/><br/>“Mommy!”<br/><br/>“Sister!”<br/><br/>“Mommy!”<br/><br/>Finally, Xiao Jinli could only compromise helplessly.<br/><br/>She laughed and said, “I don’t even have a boyfriend, but I’ve become a mommy. If I take you home, will everyone think you’re my illegitimate child?”<br/><br/>Jiang Yifan said, “Then hurry up and find a boyfriend, then give me a household registration, and I won’t be an illegitimate child.”<br/><br/>Xiao Jinli said unhappily, “Little friend Jiang Yifan, are you getting addicted to playing my child that you’re even thinking about joining my family’s household registration? If your parents find out, don’t let them accuse me of being a child trafficker.”<br/><br/>Jiang Yifan shrugged his shoulders and said in an adult-like tone, “Don’t worry, they won’t.”<br/><br/>“They won’t,” Xiao Jinli said with a suspicious look on her face, “Are your parents really that irresponsible?”<br/><br/>Jiang Yifan nodded, “Yes, they are just like that, very irresponsible.”<br/><br/>Xiao Jinli,<br/><br/>Xiao Jinli took the child back to Xiao Family Village, and the child still called Xiao Jinli “Mommy”, instantly becoming big news in the village.<br/><br/>Xiao Wanshan asked seriously, “Xiao Jinli, tell me, why did you bring a child back after going out once, and he even calls you ‘Mom’?”<br/><br/>Xiao’s Mother looked at the child’s appearance and said happily, “This child is so plump and cute, just like Xiao Bao when he was little.”<br/><br/>Jiang Yifan immediately put on an innocent smile and asked, “Grandma, do I really look exactly like Mommy when she was little?”<br/><br/>Xiao’s Mother, full of motherly love, pinched his chubby face and laughed, “Isn’t that right? All similarly white and chubby, just adorable.”<br/><br/>Xiao Jinli immediately complained, “Mom, he slandered me on the airplane and ruined my reputation.”<br/><br/>Xiao Mother curiously asked, “How can a child slander you and ruin your reputation?”<br/><br/>From a young age, Xiao Bao had been sensible and well-behaved, like a little adult, never causing any trouble.<br/><br/>Now, it was the first time they saw Xiao Bao’s helplessness, and he even complained.<br/><br/>Xiao Mother couldn’t help but look at Jiang Yifan affectionately, as it was her cheap grandson who made it possible.<br/><br/>Xiao Jinli said, “She said I was domestically abused by my husband and then abandoned him and ran away on my own. You don’t know, the way people on the plane looked at me was strange, as if I were some rotten, selfish mother.”<br/><br/>It was rare for something to cause Xiao Jinli to be so emotional.<br/><br/>After hearing this, Xiao Mother not only wasn’t angry, she covered her mouth and laughed, “Ha ha, Xiao Bao, you have your helpless moments too.”<br/><br/>Xiao Jinli,<br/><br/>Is this her real mother?<br/><br/>Xiao Wanshan looked at his daughter, whose expression changed, and also wanted to laugh like his wife.<br/><br/>However, Xiao Wanshan still asked, “Xiao Jinli, what on earth is going on?”<br/><br/>Xiao Jinli helplessly said, “Dad, I don’t know what’s going on either. I was sitting on the plane when the flight attendant brought him to me and said he was my child. He was even better, just threw himself onto me and called me Mom. Jiang Yifan, can you explain to Grandpa and Grandma what’s going on?”<br/><br/>Jiang Yifan, looking at the fierce Xiao Jinli, immediately started crying in grievance.<br/><br/>As he cried, he explained, “Wah wah… Daddy told me that my mommy is the most beautiful woman in the world. Mommy is so beautiful, she must be my mommy! She’s my mommy!”<br/><br/>Xiao Jinli, Couldn’t even explain herself now.<br/><br/>“Jiang Yifan!” Xiao Jinli said sternly.<br/><br/>Who would have thought that Jiang Yifan seemed to be frightened by this and immediately shrank into Xiao Mother’s embrace, showing a look of fear on his face.<br/><br/>“Grandma, Mommy is so fierce, I’m scared!” Jiang Yifan said weakly.<br/><br/>Xiao Mother immediately scolded, “Xiao Jinli, why are you being so fierce? He’s just a child, what does he know?”<br/><br/>Xiao Mother then comforted, “Baby, don’t be afraid. Your mommy is usually very gentle, she’s not fierce, she’s just talking louder now.”<br/><br/>Xiao Jinli,<br/><br/>Great, her family status is plummeting.<br/><br/>All because of some little brat who popped up out of nowhere.<br/><br/>Xiao Mother then looked at Xiao Jinli again and said, “Let him call you mommy if he wants, it’s not like you’ll lose a piece of meat.”<br/><br/>Xiao Jinli,<br/><br/>Is this the gentle mother she’s had for decades?<br/><br/>Could it be that she’s been replaced by someone else?<br/><br/>Otherwise, why would she suddenly be so fierce to her own daughter?<br/><br/>Xiao Jinli pointed at Jiang Yifan and then at herself and said, “Mom, I’m not even twenty years old yet. I don’t even have a boyfriend, let alone a husband, and I’m already being called ‘Mom’? Don’t you think that’s ridiculous?”<br/><br/>Xiao Mother said, “What’s ridiculous? It’s just a child calling you ‘Mom,’ it doesn’t affect you.”<br/><br/>Jiang Yifan wiped his tears and said, “Grandma, Mommy doesn’t like me. Why don’t you send me to the orphanage? Anyway, I can’t find my parents either. I’ll just stay in the orphanage and wait for my dad to find me.”<br/><br/>As he said this, he paused and tears streamed down his face again. As he cried, he said, “But I heard that children in orphanages have no parents, are always hungry, and get bullied. Whoo-whoo, but I’m strong, I’m sure I can beat the others.”<br/><br/>Xiao Jinli,<br/><br/>Where is this child from? Some kind of drama king who knows how to act so well?\t\t\t\t\t\t</div>", "images": {}, "success": true}