{"id": 273, "url": "https://www.novelhall.com/the-lucky-star-blessing-the-whole-village-32483/15193365.html", "title": "Chapter 273 - Chapter 273: Chapter 273:", "volume": 3, "volume_title": "Volume 3", "body": "<h1>Chapter 273 - Chapter 273: Chapter 273:</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 273: Chapter 273:<br/><br/>Translator: 549690339<br/><br/>Working in the field, or not working, when they heard that Xiao Jinli had become a mother, they were very surprised, so they all ran to the Xiao family.<br/><br/>Old Master Jiang, who was 86 years old, looked at the fair, tender, chubby-faced, round-eyed, curly-haired little boy in front of him, and his eyes showed amazement. He asked, “Is it this child? So cute! Come on, child, call me Elderly Grandfather!”<br/><br/>Jiang Yifan cleverly called out, “Hello, Elderly Grandfather!”<br/><br/>“Haha…” Old Master Jiang said happily, “Good, this child looks smart. Girl, where did you snatch this child from?”<br/><br/>Xiao Jinli was somewhat speechless, “Great Grandfather, I didn’t snatch him! He’s the one who pestered me. I’m a single lady with no husband or boyfriend, and he calls me mom. I’m disadvantageous, alright?”<br/><br/>After adopting Xiao Jinli as his adoptive granddaughter, the two families had gathered for a meal, but there was a confusion in the address.<br/><br/>Xiao Jinli had a biological grandfather, and although Grandpa Jiang was an adoptive grandfather, calling Grandpa Jiang seemed unfamiliar.<br/><br/>So they called him by his age.<br/><br/>Old Master Jiang was older, so he was called Great Grandfather.<br/><br/>Jiang Yifan agreed with a smile, “Yes, Elderly Grandfather, I pestered Mommy. Mommy is so beautiful that I recognized her as my Mommy at first sight.”<br/><br/>Xiao Jinli and everyone,<br/><br/>So the child recognized his mommy based on looks.<br/><br/>Old Master Jiang asked with a smile, “Child, what’s your name and where do you live?”<br/><br/>“My name is Jiang Yifan!” Jiang Yifan held his chin, his eyes rolled around, “As for where I live, I don’t remember.”<br/><br/>Xiao Jinli added, “Great Grandfather, he followed me onto the plane in Capital City by sneaking in without a ticket. He must be from Capital City. He said he ran away from home. Great Grandfather, you can ask Ninth Brother and the others to check which family in Capital City lost a child, whose surname is Jiang, and whose family life should be quite good.”<br/><br/>He was wearing designer clothes.<br/><br/>After hearing this, Jiang Yifan’s eyes rolled again, not knowing what idea he was thinking of.<br/><br/>Suddenly, he hugged Old Master Jiang’s arm and started crying, “Elderly Grandfather, actually, Yifan is an orphan and doesn’t know who his parents are. Maybe my parents are gone, so there’s no need to investigate, right?”<br/><br/>Xiao Jinli sneered, “An orphan? Then we need to check even more. On Television, there are daily broadcasts of those parents looking for their children; maybe we can help you find your biological parents.”<br/><br/>Jiang Yifan,  Did he go too far and upset this halfway mommy?<br/><br/>Everyone,<br/><br/>They have never seen Xiao Jinli’s angry side.<br/><br/>Even though the villagers in Xiao Family Village watched her grow up since childhood, Xiao Jinli had always been sensible, well-behaved, and mature.<br/><br/>Jiang Yifan immediately laughed awkwardly and said, “Well… let’s not, right? That would be a waste of public resources.”<br/><br/>Xiao Jinli snorted coldly, “Hmm, you know it’s a waste of public resources, it seems you’re quite sensible. But why did you pester me? Do I look like I really want to be your mom?”<br/><br/>Even with the combined age of nearly fifty, she didn’t like to be someone else’s mom, let alone a child who came out of nowhere.<br/><br/>Xiao Jinli angrily forgot to shield her mind.<br/><br/>Now little Zhi looked at the master’s helplessness towards a child and couldn’t help but laugh.<br/><br/>“Hahaha… It’s so funny.”<br/><br/>“Master, it’s been a long time since I’ve seen your emotions change.<br/><br/>Xiao Jinli with a black face,<br/><br/>Everyone looked at the clever child and then at Xiao Jinli.<br/><br/>A villager laughed, “Jinli, I think this child is very cute, you can temporarily be his mom.”<br/><br/>“Yes, this child is fair, tender, and chubby. He’s so adorable and lovable. Since he recognizes you, just be his mom. He may call you mom, but everyone knows you’re still an unmarried woman, isn’t it?”<br/><br/>Unmarried woman Xiao Jinli,<br/><br/>Why is everyone so keen on having her, a girl without a boyfriend or husband and not even twenty years old, to be a mother?<br/><br/>After everyone took a look at the child and enjoyed the excitement, their mood relaxed, and they went back to work in the fields.<br/><br/>Actually, everyone was very busy, watching the excitement was just taking a break during the free time.<br/><br/>Of course, everyone was more interested in watching the excitement of Xiao Jinli.<br/><br/>After the villagers dispersed, the remaining Xiao family members and several old gentlemen, gathered around the child, very curious.<br/><br/>“This child is smart, clever, and so cute. Being Xiao Bao’s child is not impossible.”<br/><br/>“Little friend Jiang Yifan, why did you recognize Little Bao, ahem…my daughter as your mom?” Xiao Wanshan asked doubtfully.<br/><br/>Jiang Yifan took it for granted and asked, “Isn’t Mommy beautiful?”<br/><br/>Xiao Wanshan smiled and asked, “So because she’s beautiful, she’s your mommy, is that what you mean?”<br/><br/>“Yes!” Jiang Yifan nodded and said, “My dad said that the most beautiful woman is my mommy.”<br/><br/>“So who exactly is your dad?” Xiao Jinli asked with her hands on her hips, “Don’t try to fool me, since you remember your dad, you must not have amnesia!”<br/><br/>Jiang Yifan,<br/><br/>The Xiao family,<br/><br/>Did this mother and son hit it off?<br/><br/>Jiang Yifan slapped himself on the forehead, and exclaimed, “It’s not good, I’m amnesic again! I don’t remember anything. Grandpa, who am I, and what’s my name? Where is this place?”<br/><br/>The Xiao family,  This child is really a drama king.<br/><br/>The next day, Jiang Yifan held Old Master Jiang’s hand and walked towards the field, greeting the villagers along the way.<br/><br/>“Hello, Grandpa and Grandma!”<br/><br/>“Little friend, are you Jinli’s new son?”<br/><br/>New son Jiang Yifan nodded and replied, “Yes!”<br/><br/>“How old are you today?”<br/><br/>Jiang Yifan held up three little fingers and laughed, “Three and a half years old.”<br/><br/>“Hehe, three and a half years old. So cute!”<br/><br/>“Is this Jinli’s son? He looks so cute, fair and chubby, well raised!”<br/><br/>“So how did this child recognize Jinli as his mom? It’s good that we know Jinli doesn’t have a boyfriend.”<br/><br/>“Haha, Jinli was so cute when she was young too.”<br/><br/>“This child really looks like Jinli when she was young. If we didn’t know, we would think they are mother and son.”<br/><br/>“I didn’t expect that Jinli would bring a child back to the village after a trip to the Capital City.”<br/><br/>As Jiang Yifan followed Old Master Jiang, the villagers were all talking about it.<br/><br/>Jiang Yifan curiously asked, “Elderly Grandfather, this place is so beautiful, even more beautiful than my home!”<br/><br/>Old Master Jiang laughed and said, “So you didn’t lose your memory?”<br/><br/>Jiang Yifan,  Can’t they just keep pretending?\t\t\t\t\t\t</div>", "images": {}, "success": true}