{"id": 275, "url": "https://www.novelhall.com/the-lucky-star-blessing-the-whole-village-32483/15193367.html", "title": "Chapter 275 - Chapter 275: Chapter 275:", "volume": 3, "volume_title": "Volume 3", "body": "<h1>Chapter 275 - Chapter 275: Chapter 275:</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 275: Chapter 275:<br/><br/>Translator: 549690339<br/><br/>In the first year, Xiao Family Village Green Fresh Company made a name for all its products, while also distinguishing between the ordinary and high-end market directions.<br/><br/>Apart from crops, vegetables, and rice grown in the fields, there were also farmed meats: chicken, duck, fish, goose, pig, and cattle, later adding sheep, turkey, rabbit, etc., renowned for their tender and aromatic meat.<br/><br/>And agricultural by-products, including peanut oil, corn oil, rapeseed oil, and tea oil, etc.<br/><br/>In the second year, the company considerably increased its output value.<br/><br/>This was a big problem.<br/><br/>If the company wanted to increase its output value, it had to continually add more land and hills.<br/><br/>Hills were not the issue; the main concern was the land.<br/><br/>In the countryside, land is valuable, and at the same time, land is the lifeblood of the older generation, who believe that land is their assurance of survival, without it, they feel insecure.<br/><br/>Xiao Family Village had a strong sense of cohesion and unity because of Xiao Jinli, so everyone rallied to the cause.<br/><br/>But other villages did not have the unity of Xiao Family Village, and moreover, the company leased the land from these other villages, rather than using a stakeholder model, making things even more challenging.<br/><br/>The people who stayed at home were not willing to lease out their land; they would rather farm it themselves.<br/><br/>Moreover, seeing how well Xiao Family Village was developing, they also felt a certain amount of envy.<br/><br/>Just like among people, apart from parents who sincerely wish you well, many people wish you well but not better than themselves, otherwise, they would feel out of balance.<br/><br/>Once, Xiao Family Village was known as a poverty-stricken village in Taoyuan Town, mainly due to geographical issues and being greatly affected by the weather. There were not many really good days without either droughts or floods, causing significant impact on the harvest.<br/><br/>If it were not for the country becoming more and more developed, with more and more people choosing to work outside of the village, many young people from Xiao Family Village go out for work. Thus, reduced harvests have not led to starvation, but they have increased the burden on the younger generation.<br/><br/>However, since Xiao Jinli’s birth, the situation in Xiao Family Village has gradually improved, at least without frequent droughts and floods, so the villagers’ admiration for Xiao Jinli as a village treasure and Fortune is justified.<br/><br/>Even so, the gap between Xiao Family Village and other villages is still quite significant.<br/><br/>Every year, the Village Chief was criticized in the Town meetings. Xiao Village Chief could only face the ridicule and jeering of others with resignation.<br/><br/>It wasn’t until Xiao Family Village started growing and selling vegetables that the situation was completely changed.<br/><br/>If a few families in Xiao Family Village were doing well, that’s one thing, but the reality is every family is doing well.<br/><br/>Their village used land shares. It is said that the first dividend was twenty thousand per acre. Families with 3-4 acres got dividends of seventy to eighty thousand in the first time. This is equivalent to the savings of rural people for a lifetime.<br/><br/>The first dividend was for the first half of the year, and the second dividend was for the latter half of the year.<br/><br/>So, the first year of dividends, as long as they had land shares, it was several ten thousand or more.<br/><br/>In addition to dividends, many people in the village were arranged to work in the company, with additional salaries. Even the Cleaner of the company was from their own village, with wages paid accordingly.<br/><br/>As long as they work diligently and do not slack off, the annual income of a family can make others particularly envious.<br/><br/>It’s rumored that Xiao Family Village’s company wants to lease their village’s land, the majority of people disagreed.<br/><br/>Many people refused not only because the rents were too low, but also because they wanted to follow the way of Xiao Family Village, with land shares, getting dividends on top of working in the company.<br/><br/>However, with such conditions of land shares, both the company and the people of Xiao Family Village would not possibly agree.<br/><br/>They could offer to pay rent and consider hiring people as needed.\t\t\t\t\t\t</div>", "images": {}, "success": true}