{"id": 279, "url": "https://www.novelhall.com/the-lucky-star-blessing-the-whole-village-32483/15193371.html", "title": "Chapter 279 - Chapter 279: Chapter 279: (Second Update)", "volume": 3, "volume_title": "Volume 3", "body": "<h1>Chapter 279 - Chapter 279: Chapter 279: (Second Update)</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 279: Chapter 279: (Second Update)<br/><br/>Translator: 549690339<br/><br/>Hearing the refusal of Xiao Family Village Green Fresh Company, Zhang Jingjing was of course very annoyed.<br/><br/>So she personally took charge of the branch company in Ganjiang City.<br/><br/>Seeing the three stores that Xiao Family Village had opened in Ganjiang City, every time the goods arrived, they were immediately snatched up.<br/><br/>Only after the goods in the Xiao Family Village’s store were sold out, would the customers go to Jingjing’s Green Health Store, which led to a significant decline in the traffic of their store. Previously, they used to sell out daily, but now they were often left with a lot of unsold goods.<br/><br/>If this continued, they would have to close the store in Ganjiang City.<br/><br/>Zhang Jingjing looked at the situation, her eyebrows tightly knit.<br/><br/>Clenching her fists, a fierce look appeared in her eyes as she said, “We can’t go on like this. Jingjing Group can give up on the Ganjiang City market, but if we retreat, will we also have to retreat when Xiao Family Village Company enters other markets in the future? That’s not acceptable. Since the Xiao Family Village Company refuses to comply, don’t blame me, it’s their fault for not knowing better.”<br/><br/>Zhang Jingjing’s ability to develop from a small vegetable store to her current position today definitely required certain capabilities and means. Her good looks also helped her win many connections.<br/><br/>She thought for a moment and thought of her usual tactics.<br/><br/>She picked up the phone and dialed a number.<br/><br/>“Boss Li, it’s me. I need your help now, and the reward is 200,000.”<br/><br/>North Ganjiang City’s Xiao Family Village Green Fresh Store.<br/><br/>As usual, even before daylight, many customers were already lining up at the door waiting.<br/><br/>It couldn’t be helped; the things in this store were too popular. If they came a little later, not even a single leaf would be left for sale.<br/><br/>“Make way, make way for me!”<br/><br/>At this moment, a man with a wicked-looking face, bare arms, and tattoos on his arms appeared, leading a group of henchmen.<br/><br/>“Get out of the way right now, and don’t blame us if you get hurt by not watching out.”<br/><br/>The people who came to buy vegetables were ordinary people, and even the wealthy sent their nannies and servants.<br/><br/>So, seeing this group of fierce-looking men, who were clearly here to cause trouble, everyone scattered and stood by to watch the fun.<br/><br/>Xiao Qingshan and the four others working at the store, seeing this group of troublemakers, immediately gathered together.<br/><br/>Xiao Qingshan asked sternly, “Who are you, and what do you want to do?”<br/><br/>The man leading the group, Lai Lao Liu, sneered and said, “What do we want to do? Are you blind? We are obviously here to…smash the store. Brothers, smash it!”<br/><br/>Upon saying this, the men behind him immediately picked up iron rods and other tools and began smashing the store.<br/><br/>Xiao Qingshan was so angry he wanted to fight them, but the others held him back.<br/><br/>“Qingshan, calm down! They have tools in their hands, and if you go forward, you’ll just be asking to get smashed.”<br/><br/>The other four were older than Xiao Qingshan, and every time someone from Xiao Family Village went to work in the store, Xiao Jinli would specifically instruct them, “Remember, if something happens to the store, you must put your own safety first! Even if all the goods in the store are lost, it’s just some money, but your lives are priceless. You have to think about your family and friends, so protect yourself first!”<br/><br/>After they had finished smashing the store, Lai Lao Liu threatened Xiao Qingshan and the others, saying loudly, “I’m telling you, we’ll be here every day from now on; you better be on guard!”<br/><br/>Xiao Qingshan roared, “Who are you, and what do you want? Don’t you have any respect for the laws of the land?”<br/><br/>Hearing this, Lai Lao Liu laughed as if he had heard a funny joke.<br/><br/>He chuckled, “Haha, the laws of the land? Young man, you haven’t even bothered to find out who we are. Laws, pfft, I’m not afraid of you.”<br/><br/>With that, the group swaggered in and swaggered out.<br/><br/>The reason they were so bold and confident was that they had someone backing them.<br/><br/>Once they left, both Xiao Qingshan and the others, as well as the customers who had seen the smashed store, were heartbroken.<br/><br/>An old lady said, “Young man, I think these vegetables aren’t too smashed up. Why not sell them to us?”<br/><br/>Xiao Qinglin, Xiao Qingshan’s older brother, looked at the mess on the ground with a heartbroken expression. He took a deep breath and said, “Auntie, we won’t sell them today. If you don’t mind, you can take these home.”<br/><br/>Their store never sold subpar looking goods.<br/><br/>After hearing Xiao Qinglin’s words, many people’s eyes lit up and some asked hesitantly, “Boss, do you really want us to take them for free? You’re not selling?”<br/><br/>Xiao Qinglin said, “You can take them yourselves. But you must be careful!”<br/><br/>He was afraid that if these people started grabbing, things could get chaotic and out of control.<br/><br/>Fortunately, the people who came to buy vegetables were all well-mannered.<br/><br/>Although they were all scrambling to pick up the goods, they were competing with their hands and feet. They didn’t try to grab from others once someone got hold of an item.<br/><br/>After the customers had taken everything from the store, someone said to Xiao Qingshan, “Boss, it’s still early, let me help you clean up the store.”<br/><br/>Xiao Qingshan didn’t refuse; he said, “Thank you!”<br/><br/>Subsequently, many customers volunteered to help them tidy up the store.<br/><br/>However, the store was already in such a mess that no matter how much they cleaned up, it all turned into a pile of waste.<br/><br/>Xiao Qingshan clenched his fists in anger and gritted his teeth, “Who are these people? I must teach them a lesson once I find out.”<br/><br/>A customer said, “The leader is called Lai Lao Liu, a local thug in the northern part of the city who usually collects protection fees from businesses without a background. Did you guys offend him somehow? He smashed your store right away.”<br/><br/>Xiao Qinglin thought for a moment and then said, “Won’t the Yamen do anything about these people?”<br/><br/>Someone immediately scoffed and said, “Hehe, I heard these people have connections with the Yamen and even the city bureau. Usually, when people call the police, they just symbolically arrest them and take them to the Yamen, either giving them a warning or holding them for a few days before letting them go. Then these people continue to roam around freely.”<br/><br/>Xiao Qinglin and the others,<br/><br/>Xiao Qinglin said to the others, “We can’t open the store for now, so let’s go back to the dormitory.”<br/><br/>Xiao Qingshan called Xiao Yucheng and reported the incident.<br/><br/>Originally, they didn’t plan to disturb Xiao Jinli and the old gentlemen, but the villagers were anxious, and eventually, they found out.<br/><br/>Grandpa Jiang and the others were furious, saying, “Who are these people, such bullies? Girl, don’t worry, I’ll teach them a lesson and show them why the flowers are so red.”<br/><br/>Xiao Jinli laughed and comforted the old gentlemen, “My elders, I can handle this little matter myself, you don’t need to worry.”<br/><br/>Then, she added, “I know the Ganjiang City Official Department Chief, if they want to compete for connections, let’s compete.”<br/><br/>After hearing her words, Elder Jiang and the others immediately laughed and said, “Haha, great! Girl, you handle it first.”<br/><br/>Then, Xiao Jinli made a call, “Uncle Luo, it’s me!”\t\t\t\t\t\t</div>", "images": {}, "success": true}