{"id": 277, "url": "https://www.novelhall.com/the-lucky-star-blessing-the-whole-village-32483/15193369.html", "title": "Chapter 277 - Chapter 277: Chapter 277:", "volume": 3, "volume_title": "Volume 3", "body": "<h1>Chapter 277 - Chapter 277: Chapter 277:</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 277: Chapter 277:<br/><br/>Translator: 549690339<br/><br/>Director Chen was thinking about his political achievements, hoping that everyone could invest in the Xiao Family Village Green Fresh Company, and every household could receive dividends like the Xiao Family Village and have good days.<br/><br/>It would be his political achievement if the whole town lived a good life.<br/><br/>Xiao Yucheng couldn’t help but feel furious inside.<br/><br/>There wasn’t much difference between collective investment and individual investment.<br/><br/>If there were any problems, those who would make trouble would still do so.<br/><br/>He reiterated that their company was not a charity.<br/><br/>Xiao Yucheng, smiling, said, “Director Chen, so your idea is that if I want to lease the land of all the twenty-two villages in the town, I have to let the twenty-two villages invest in the company. If I lease the land of hundreds of villages in the whole county, I need to let those villages invest, right?”<br/><br/>Director Chen remained silent.<br/><br/>The silence was an answer.<br/><br/>Xiao Yucheng was almost bursting into laughter out of anger.<br/><br/>But then he shook his head and said, “Director Chen, isn’t that unrealistic? Our company just wants to lease land to expand the company’s output value. It doesn’t mean we’re a charity, tying our company and our village’s interests to allow hundreds or thousands of shareholders to invest. It’s not only impractical, but even if it were possible, with so many shareholders, the company would be difficult to manage and chaos might ensue, making it hard for the company to develop. So, we don’t agree to let other villages collectively invest.”<br/><br/>Without waiting for Director Chen’s response, he continued, “If any village is willing to lease their land to us, we can provide jobs for them. If the occupation is the same, the salary would be the same. If they insist on investing, we might as well consider leasing land in other counties.”<br/><br/>Upon hearing that, the faces of the staff in the county government office changed slightly.<br/><br/>Director Chen laughed, “President Xiao, you’re joking. If you don’t lease in our county and instead lease in other counties, wouldn’t that increase your company’s costs? Alright, let us handle the land leasing matter and communicate with the villages.”<br/><br/>Xiao Yucheng nodded, “Thank you all.”<br/><br/>Communicating through the county government office was much easier than the company going to the villagers directly.<br/><br/>After all, the county government office was an authority that the villagers were afraid of.<br/><br/>Most villagers were willing to lease their land, as the most attractive offer was the job opportunities – at least one position per family, plus temporary positions available occasionally.<br/><br/>Farming didn’t yield much profit throughout the year. A single position, even the lowest-paying cleaner, would earn 1,500 yuan a month. That would be 20,000 to 30,000 yuan a year, which was much more than farming.<br/><br/>Rumor has it that the Green Fresh Company of Xiao Family Village was unwilling to let the villagers invest. If people insisted on investing, the company would prefer not to rent the land.<br/><br/>Upon hearing this, most people gave up on the idea.<br/><br/>Of course, some lazy people wanted to invest in the land like the Xiao Family Village, and collect dividends later on.<br/><br/>That is, they could do nothing and still earn money.<br/><br/>Therefore, of course, they were reluctant to rent and would rather invest.<br/><br/>Xiao Yucheng sneered after hearing this, “So they want to invest, huh?”<br/><br/>So, the result was that they were unwilling to rent? Then they simply wouldn’t rent.<br/><br/>As for those who insisted on not renting, their land would be left out.<br/><br/>As for their own land, they could plant if they wished, or forget about it if they didn’t want to. It was their decision whether to leave it fallow or cultivate it.<br/><br/>Thus, those who were unwilling to rent were left dumbfounded.<br/><br/>With the previous experience, the following villages became much easier to deal with.\t\t\t\t\t\t</div>", "images": {}, "success": true}