{"id": 276, "url": "https://www.novelhall.com/the-lucky-star-blessing-the-whole-village-32483/15193368.html", "title": "Chapter 276 - Chapter 276: Chapter 276:", "volume": 3, "volume_title": "Volume 3", "body": "<h1>Chapter 276 - Chapter 276: Chapter 276:</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 276: Chapter 276:<br/><br/>Translator: 549690339<br/><br/>It can be said that in the second year, company expansion, or more precisely, land expansion issues, became a significant problem.<br/><br/>People from surrounding villages wanted to follow Xiao Family Village’s example, contributing their land as shares and then waiting for dividends.<br/><br/>But this was simply impossible.<br/><br/>If it couldn’t be done, then they wouldn’t lease the land.<br/><br/>Those villagers believed that because their lands were adjacent to Xiao Family Village, the company had no choice but to use their lands, giving them leverage.<br/><br/>Xiao Yucheng and others were almost amused to laughter by this assumption.<br/><br/>However, it was somewhat reasonable for these people to have such thoughts.<br/><br/>The land of surrounding villages was indeed close to Xiao Family Village, making it more convenient for management after leasing, which was its biggest advantage.<br/><br/>But an advantage was just an advantage, and it didn’t mean that their land was absolutely indispensable.<br/><br/>Fortunately, Xiao Family Village had already built a reputation. In just a year, it had become the hallmark of Qing County.<br/><br/>The county government attached great importance to this and was determined to maintain it.<br/><br/>The company’s expansion was taken seriously by the county government, and they were extremely supportive, offering as much help as possible.<br/><br/>It was just that they encountered the biggest obstacle from surrounding villages when it came to leasing land.<br/><br/>Xiao Yucheng held a meeting with staff from the county government.<br/><br/>One of the county government leaders contemplated the matter and suggested, “General Zhou, those villagers want to make money, and your company’s shareholders are all villagers who contributed their land as shares. So why not let other villages put in their land as shares too? You can let these villagers participate in a subsidiary company in their village under the guise of opening a branch. In this way, there won’t be any conflict with your Xiao Family Village Green Fresh Company, right?”<br/><br/>As a high-ranking leader, it was natural to hope that as many villages as possible could overcome poverty and embark on the path to prosperity.<br/><br/>Now that there was an opportunity in front of them, they certainly didn’t want to miss it.<br/><br/>However, since Xiao Family Village Green Fresh Company was indeed a company and Xiao Yucheng was a businessman, his main concern was his own interests.<br/><br/>Xiao Yucheng smiled and said, “Director Chen, our company’s expansion is not limited to the surrounding villages. In the future, we may extend to other counties. The land we lease is not limited to a few hundred mu, and the farmers are not just three or four hundred households.<br/><br/>In the future, the land we lease may reach tens of thousands of mu, and there may be more than ten thousand tenant households. If our company has to agree to let everyone who leases land become shareholders and then wait for dividends, not only will the workload increase and the number of shareholders grow, but it will also become a mixed bag. In this case, if there is even a slight issue, our company’s reputation may be damaged, directly tarnishing the company’s image.<br/><br/>Therefore, we cannot agree to this demand from a long-term development perspective. After all, letting thousands of tenant households become shareholders is quite unrealistic, isn’t it?”<br/><br/>If they had to accept shares from every tenant they leased land from,<br/><br/>After Xiao Yucheng finished speaking, everyone else pondered the matter further.<br/><br/>Destroying the company’s image was definitely unacceptable.<br/><br/>Although the Xiao Family Village Green Fresh Company currently seemed small, it had a significant reputation.<br/><br/>The reason it appeared small was that it had only been developing for a year.<br/><br/>Yet, in just a year, the company had gained nationwide recognition and had become the hallmark of Qing County, indicating its bright future prospects.<br/><br/>Any leader with vision and ambition would certainly do their utmost to protect this valuable asset for the sake of their political achievements.<br/><br/>Director Chen frowned slightly and said, “Another option is to allow the entire village to invest as a whole. Your company could treat the village as a single shareholder and distribute dividends accordingly. In this way, the problem of having thousands of shareholders would be solved.”<br/><br/>Xiao Yucheng’s mouth twitched slightly, and a glint flashed in his eyes.\t\t\t\t\t\t</div>", "images": {}, "success": true}