{"id": 282, "url": "https://www.novelhall.com/the-lucky-star-blessing-the-whole-village-32483/15193374.html", "title": "Chapter 282 - Chapter 282: Chapter 282: (Second Update)", "volume": 3, "volume_title": "Volume 3", "body": "<h1>Chapter 282 - Chapter 282: Chapter 282: (Second Update)</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 282: Chapter 282: (Second Update)<br/><br/>Translator: 549690339<br/><br/>“People sent by Jingjing Green Health Group’s branch company in Ganjiang City?”<br/><br/>Xiao Jinli received the results of Luo Sanbiao’s investigation on the group of people smashing their store.<br/><br/>“Jingjing Green Health Group?”<br/><br/>Hearing that it was the Jingjing Green Health Group, the anger appeared on Xiao Yucheng’s face immediately.<br/><br/>“Turns out it’s this woman.” Xiao Yucheng said angrily.<br/><br/>Xiao Jinli looked at him with a puzzled expression and asked, “Big brother, who is it?”<br/><br/>“Zhang Jingjing!” Xiao Yucheng explained, “This Zhang Jingjing is the founder and also the chairman and president of Jingjing Green Health Group.”<br/><br/>“Jingjing Green Health Group?”<br/><br/>“Yes, Jingjing Green Health Group is one of the national giants in the agricultural industry. Its business operations cover Jiangzhou Province and more than ten surrounding provinces, with its headquarters in Jiangnan Province,” Xiao Yucheng continued, “A while ago, this woman disguised herself as a boss and came to me, directly stating her intention to have our company merge with her Jingjing Green Health Group. I refused.”<br/><br/>Xiao Jinli nodded and said, “Hmm, maybe she sensed the threat from our company, so she wanted to strike first and ruin our company.”<br/><br/>She tapped the table lightly with her hand and said sternly, “She smashed our store, perhaps as a warning. To let us feel the sensation of an egg crashing against a rock.”<br/><br/>At this, she sneered, “What she didn’t expect was that she’d lift a rock only to drop it on her own foot.”<br/><br/>Letting a bunch of thugs smash the store was a clever idea she came up with.<br/><br/>If a company could steal her business, it obviously should not be messed with.<br/><br/>Xiao Yucheng was quite angry, “This woman is really unreasonable.”<br/><br/>Xiao Jinli said, “What Uncle Luo investigated, the person behind it is indeed Zhang Jingjing. But this woman is cunning, and she does things without leaving a trace. There is no evidence to prove that she was the one who ordered it. Now, she has pushed the person in charge of the Ganjiang City branch to take the blame. She has slunk off to her headquarters herself. Uncle Luo has no way to arrest her at the moment.”<br/><br/>A cunning hare has three burrows.<br/><br/>Zhang Jingjing was able to start from being an ordinary person to her current position. She must have used countless tactics in the business world, yet no one has caught her doing something wrong. This shows that she is extremely cunning.<br/><br/>Xiao Yucheng pondered and said, “This woman shouldn’t reach out to us for a while, right?”<br/><br/>Xiao Jinli shook her head, “Not necessarily. Previously, she sent people to smash our store as a warning. If she persists in the idea that it must be destroyed if she can’t have it, she will definitely resort to even more sinister methods.”<br/><br/>Xiao Mingchen, who was nearby, nodded in agreement and said, “That is indeed possible. Zhang Jingjing is quite a powerful woman in the business world. Otherwise, she wouldn’t have been able to turn a small, unknown vegetable shop into a large conglomerate. There must be many shady tactics she used in the process.”<br/><br/>It is said that this woman has a very keen sense of smell and a strong sixth sense. Perhaps that was how she sensed the threat from our company. So, she decided to have our company merge with hers before taking further action. If not, she would strangle our company in its cradle.”<br/><br/>“Her first move was to send people to smash our store as a warning and a show of power, hoping that we would compromise. But now that the warning has failed, she must be thinking of ways to destroy our company.”<br/><br/>Xiao Junxuan was very indignant, “What a malicious woman!”<br/><br/>Xiao Yucheng said, “We absolutely cannot sit back and wait for death.”<br/><br/>“That’s right, we absolutely cannot sit back and wait for death, we must take the initiative!” Xiao Mingchen chimed in.<br/><br/>Xiao Jinli agreed with them.<br/><br/>“Yes, we must take the initiative,” Xiao Jinli nodded, “The main thing is to kill the chicken to scare the monkey!”<br/><br/>Xiao Junxuan thought for a moment and said, “But how are we going to take the initiative now? Are we going to use tactics like that woman to damage their group’s reputation?”<br/><br/>“Yeah, our company is currently small and severely understaffed. Most importantly, how can we use tactics to bring her down?” Xiao Mingchen asked with a glint in his eyes.<br/><br/>Xiao Jinli laughed and said, “My dear brothers, just focus on managing the company well, and leave this matter to me.”<br/><br/>“No!” The three of them looked at her unanimously and disagreed.<br/><br/>“Jinli, do you plan to fly to Jiangnan Province alone?”<br/><br/>“Yeah, this matter is also somewhat dangerous, and we can’t leave it to you.”<br/><br/>Xiao Jinli smiled and said, “My brothers, rest assured, I won’t go to Jiangnan Province, and there won’t be any danger. Just wait and see.”<br/><br/>The others still looked at her doubtfully.<br/><br/>Xiao Jinli laughed and said, “Don’t you trust me? When have I ever lied to you, my brothers? Just relax and wait.”<br/><br/>Xiao Yucheng asked, “Jinli, do you plan to use the influence of those old gentlemen?”<br/><br/>The other two looked at Xiao Jinli.<br/><br/>Xiao Jinli shook her head and said, “Never use a sledgehammer to crack a nut!”<br/><br/>The three brothers, Why did such a big matter become so relaxed when it was mentioned by their sister?<br/><br/>Xiao Yucheng compromised and said, “Alright, Jinli, I trust you. But remember, never do anything dangerous, okay?”<br/><br/>Xiao Jinli smiled brightly and said, “When they encounter me, they’re the ones in danger.”<br/><br/>Xiao Yucheng and the others,<br/><br/>Three days later, the major online news media were widely reporting on the tax evasion of Jingjing Green Health Group, one of the three major agricultural giants. Attached was a picture of the group’s chairman, Zhang Jingjing, being handcuffed.<br/><br/>Xiao Yucheng and the others saw the news report on the office table and were momentarily speechless. At the same time, they were very excited.<br/><br/>“So this is what you meant by what you said, Jinli?” Xiao Yucheng pointed to the report in the newspaper.<br/><br/>Xiao Jinli nodded and said, “Yes.”<br/><br/>Xiao Junxuan said excitedly, “My dear sister, tell your beloved brother, how did you do it?”<br/><br/>The three of them looked at Xiao Jinli with shining eyes.<br/><br/>Xiao Jinli said, “I found a hacker to infiltrate their company’s computers.”<br/><br/>“A hacker?” Xiao Yucheng and the others were surprised.<br/><br/>“No, sister, where did you find a hacker?” Xiao Mingchen asked in confusion, “How did you find one?”<br/><br/>Xiao Jinli said, “I asked Brother Siqian to help me find one.”<br/><br/>“Xiao Siqian?” Xiao Junxuan was slightly puzzled.<br/><br/>Xiao Jinli explained, “Yes, Siqian is rich and influential in the Capital City. It’s easy for him to ask a hacker for help.”<br/><br/>“Haha…” Xiao Yucheng said happily, “I thought you would find some people to cause trouble in their stores, but I didn’t expect that a simple tax evasion case could bring that woman down.”<br/><br/>“Zhang Jingjing brought it upon herself,” Xiao Mingchen said disdainfully, “It would have been good for her to run her own company quietly, but she had to provoke us instead. She even said that we were like an egg crashing against a rock. Hmph, our egg hasn’t even cracked yet, but her big rock has already hit her feet, possibly crippling her.”\t\t\t\t\t\t</div>", "images": {}, "success": true}