{"id": 286, "url": "https://www.novelhall.com/the-lucky-star-blessing-the-whole-village-32483/15193378.html", "title": "Chapter 286 - Chapter 286: Chapter 286:", "volume": 3, "volume_title": "Volume 3", "body": "<h1>Chapter 286 - Chapter 286: Chapter 286:</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 286: Chapter 286:<br/><br/>Translator: 549690339<br/><br/>Many tourists visit the Xiao Village Farmhouse for the first time, and the first thing they see is the dancing of the domestic animals.<br/><br/>Yes.<br/><br/>Dancing.<br/><br/>Chickens dance, there are solo dances, double chicken dances, and group dances.<br/><br/>Ducks dance, there are solo dances, double duck dances, and group dances.<br/><br/>Dogs, pigs, geese…<br/><br/>Xu Mengmeng follows her parents to the chicken dance arena.<br/><br/>At the arena, the host announces: “The first dance is the Double Chicken Dance.”<br/><br/>Then, as the music starts, a majestic and beautiful rooster enters the stage with high spirits, and starts the performance by crowing, earning a round of applause from the audience.<br/><br/>Next, a hen enters the stage with pure white feathers, looking very beautiful. As soon as it enters, it performs a 360-degree spin on one leg, attracting another round of applause from the tourists.<br/><br/>This is Xu Mengmeng’s first time watching chickens dance.<br/><br/>She exclaims twice, “These chickens are so smart. There’s no one directing them on site, they’re performing all by themselves.”<br/><br/>After the male and female chicken greet each other on stage, they start dancing.<br/><br/>As the music plays, the two chickens spread their wings and use them like hands to perform a human couple’s social dance, and it looks so graceful.<br/><br/>“Wow, what a beautiful dance!”<br/><br/>“Great!”<br/><br/>“Ah, ah!”<br/><br/>There’s a round of cheers on site.<br/><br/>Xu Mengmeng is full of excitement, “These two chickens dance so well, using their wings as hands, and each movement is so graceful. How did the Xiao Village train them like this?”<br/><br/>“These two chickens are really smart.”<br/><br/>“Yeah, I’ve never seen such spiritual and smart chickens before.”<br/><br/>“I wonder if the chickens here are for sale.”<br/><br/>“No way. These chickens are professionally selected and trained. They won’t be for sale.”<br/><br/>“Oh, I wanted to buy a couple to take home and show off to my family and friends.”<br/><br/>Not everyone can find the time and opportunity to visit the Xiao Village Farmhouse.<br/><br/>“Here at the farmhouse, not only do chickens dance, but all the animals can dance. They even raised swans, and there’s a program for swan dancing as well.”<br/><br/>“Swans? Real swans?”<br/><br/>“Yes, real swans with pure white feathers, they’re very beautiful. However, the swan dance is not performed every day, it’s only on Wednesday, Friday, and Saturday nights.”<br/><br/>“The swan dance is only at night?”<br/><br/>“That’s right, the lighting is easier to control at night.”<br/><br/>“So where are the swans now? After watching the chicken dance, I want to see real swans!”<br/><br/>“The swans are in the Swan Lake!”<br/><br/>A guest, holding a map of the farmhouse, locates Swan Lake and says, “Later, I will visit the swans.”<br/><br/>Someone else suggests, “Go see the swans when there’s a swan dance program. Let’s watch the other programs for now. After the chicken dance, we can go watch the dog performance.”<br/><br/>“Do the dogs dance as well?”<br/><br/>“Not dancing. The dogs perform a military posture!”<br/><br/>“Military posture performance?” Someone asks in confusion, “How do dogs perform a military posture?”<br/><br/>“I’m not sure. We’ll find out when we go watch it later.”<br/><br/>While watching the double chicken dance, Xu Mengmeng hears the tourists’ conversation, her eyes light up. Holding Xu Guochang’s hand, she excitedly says, “Dad, Dad, everyone says there’s a dog military posture performance. Let’s go watch it later.”<br/><br/>Xu Guochang nods, “Okay, let’s go watch it later. Mengmeng, we’re going to be here for a few days, so we can watch the performances slowly. Don’t rush from one to another, we won’t enjoy it that way.”<br/><br/>Mother Xu nodded and said, “Isn’t that right? Mengmeng, after the Double Chicken Dance, there’s a Group Chicken Dance. After we watch the Group Chicken Dance, let’s go see some other shows.”<br/><br/>Xu Mengmeng nodded and said, “Okay. Mom, everyone says that on Wednesday, Friday, and Saturday nights, there’s a swan dancing performance. Today is Tuesday, so tomorrow night, we can watch the swans dance.”<br/><br/>In the past, ballet performances were called swan dances.<br/><br/>Now, they could watch a real swan dance.<br/><br/>“I wonder if real swans are as beautiful as the ones described in the books?” Xu Mengmeng said with some expectations.<br/><br/>“Definitely.”<br/><br/>The Double Chicken Dance finished quickly, and everyone enjoyed it. However, everyone was even more excited for the next dance.<br/><br/>The host immediately announced, “The next program is the Group Chicken Dance, please enjoy.”<br/><br/>As soon as the host finished speaking, the music started, and then white hens and colorful roosters with shiny feathers like phoenixes took to the stage.<br/><br/>“Wow, these chickens are so beautiful.”<br/><br/>“This manor is really good at selecting them. How can every chicken be so beautiful?”<br/><br/>“I want to take them home with me.”<br/><br/>“Haha, I also thought about taking them home. Unfortunately, they don’t sell them here.”<br/><br/>“Wow, this dance is so good. They can even pull red ropes.”<br/><br/>“Hehe, pulling ropes is nothing. Didn’t you see them using fans?”<br/><br/>“Wow, these chickens are so smart. How did they train them?”<br/><br/>“Exactly, being able to train one chicken to cooperate perfectly is already incredible; training a group of three or four dozen chickens to cooperate without human guidance, just dancing to the rhythm of the music, is even more amazing.”<br/><br/>Xu Mengmeng excitedly cheered along with the others, constantly exclaiming, “Ah ah, wow wow.”<br/><br/>The performance, lasting more than ten minutes, ended quickly.<br/><br/>The tourists were left wanting more.<br/><br/>However, hearing that the next show was even more exciting, everyone quickly rushed to see the other performances.<br/><br/>Dogs perform military posture.<br/><br/>Xu Mengmeng and her family also followed the crowd to the dog performance venue.<br/><br/>Due to the large crowd, Xu Mengmeng and the others were at the back, but there were large screens on all four sides.<br/><br/>The screens displayed the performances happening on stage.<br/><br/>However, the venue was still empty for the time being.<br/><br/>After a while, the host’s voice rang out.<br/><br/>As the host spoke, dogs walked out one by one.<br/><br/>These dogs were just ordinary mongrels, like the kind kept in the countryside.<br/><br/>However, unlike common country dogs, these dogs looked very intelligent at first sight.<br/><br/>They were dressed in green uniforms and green army caps, looking like children from a distance.<br/><br/>As they entered the venue, they stood on two legs, greeted the audience with their other two paws, and barked twice.<br/><br/>“Haha, these dogs are so cute.”<br/><br/>“They can even greet us; they really are adorable.”<br/><br/>“These dogs look so smart.”<br/><br/>The host said, “Dear cute dogs, line up now, we’re starting the performance.”<br/><br/>The host’s tone was gentle and soft, like talking to children.<br/><br/>Upon hearing the host’s words, the dogs quickly stood in formation.<br/><br/>The audience,\t\t\t\t\t\t</div>", "images": {}, "success": true}