{"id": 280, "url": "https://www.novelhall.com/the-lucky-star-blessing-the-whole-village-32483/15193372.html", "title": "Chapter 280 - Chapter 280: Chapter 280:", "volume": 3, "volume_title": "Volume 3", "body": "<h1>Chapter 280 - Chapter 280: Chapter 280:</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 280: Chapter 280:<br/><br/>Translator: 549690339<br/><br/>The second day, Lai Lao Liu and his gang arrived early in front of the store, without any pretense, displaying their arrogance.<br/><br/>They thought that after making such a scene yesterday, this store would not dare to open for business, at least for the short term.<br/><br/>Who would have thought that when they arrived here, they found the store unloading goods, as if nothing had happened at all.<br/><br/>This displeased Lai Lao Liu and made him very dissatisfied.<br/><br/>They felt that the store was provoking them, not taking them seriously at all.<br/><br/>“What are you doing, what are you doing?” Lai Lao Liu, holding an iron rod, led his gang menacingly.<br/><br/>Standing in front of Xiao Qinglin and the others, he said with fierce dissatisfaction, “You still want to open for business today? It seems the lesson we taught you hasn’t been harsh enough.”<br/><br/>Xiao Qinglin angrily questioned, “Who are you? How did we offend you?”<br/><br/>Lai Lao Liu revealed a mocking and triumphantly smile, “You didn’t offend me, but you offended someone you shouldn’t have!”<br/><br/>As he spoke, his sharp gaze swept through the store and immediately noticed the presence of Xiao Jinli, but he did not care – she was just a little girl after all.<br/><br/>“We offended someone we shouldn’t have?” Xiao Qinglin asked in surprise and anger, “Who exactly did we offend?”<br/><br/>They were merely people who ran a store selling vegetables – who could they possibly have offended?<br/><br/>Xiao Jinli, hearing this, suddenly understood.<br/><br/>She smiled and said, “Oh, so we’ve gotten in the way of certain people.”<br/><br/>Lai Lao Liu’s expression briefly stiffened. Looking at Xiao Jinli, he said maliciously, “You stinking girl, what nonsense are you talking about?”<br/><br/>Xiao Jinli looked at them with a nonchalant smile and said meaningfully, “Am I talking nonsense? Oh, I suppose if you say so. However, let me tell you, if you dare to smash our store, you’ll have to bear the consequences. Are you sure you want to do it?”<br/><br/>After hearing this, Lai Lao Liu narrowed his eyes. He had a feeling there was a hidden meaning behind the girl’s words.<br/><br/>But after thinking about it, he believed he was overthinking it – after all, it was just a child’s words.<br/><br/>Children are usually brave and fearless, like newborn calves facing a tiger.<br/><br/>Lai Lao Liu sneered and cursed, “You stinking girl, I’m going to teach you a lesson today by smashing your store! I want to see the consequences you’re talking about. Even if you call the police, I’m not afraid. We have powerful people behind us. At worst, I’ll spend a few days in jail but let me tell you this: after getting out, I’ll continue smashing your store!”<br/><br/>Xiao Qingshan and the others wanted to fight him, and Xiao Qinglin quietly said to his younger brother, “Don’t be impulsive. Jinli has already taken action; don’t mess up her plans.”<br/><br/>Before they arrived, Xiao Jinli had instructed them not to confront the gang no matter what happened.<br/><br/>She would handle them.<br/><br/>Upon hearing his big brother’s words, Xiao Qingshan finally calmed down.<br/><br/>Xiao Jinli, hearing this, laughed even more. “Alright, since you’re not afraid of the consequences, go ahead and smash our store. Do as you please.”<br/><br/>With that, she even made way for them.<br/><br/>Xiao Jinli spoke to Xiao Qinglin and the others, “All of you, step aside and let them smash.”<br/><br/>Xiao Qinglin and the others obediently stepped aside to make way.<br/><br/>Seeing this, Lai Lao Liu hesitated, but then thought that perhaps they were just bluffing.<br/><br/>After a moment, he waved his hand and ordered, “Smash it, my brothers!”<br/><br/>Lai Lao Liu and the others immediately began smashing everything they saw.<br/><br/>A short, skinny man with monkey-like features eyed Xiao Jinli’s group, then swung the iron rod in his hand and smashed it toward Xiao Jinli and the others.<br/><br/>Xiao Qinglin and the others widened their eyes, unable to react in time.<br/><br/>Xiao Jinli saw the man’s movements, and a fierce light flashed in her eyes for a moment.<br/><br/>These thugs not only smashed the store but also tried to hurt people.<br/><br/>Xiao Jinli reached out and grabbed the man’s iron stick, her cold eyes fixed on his face, and said icily, “Bastard, what are you trying to do? Do you still want to hit someone?”<br/><br/>At first, Cheng Gouzi didn’t take this group of people seriously. He swung the iron stick without fear of being caught, knowing that his gang members had his back.<br/><br/>Unexpectedly, when he swung the stick, it was caught by a little girl.<br/><br/>He didn’t care and tried to make another move, but after several attempts, he couldn’t pull the stick out of her hand.<br/><br/>Before he could react, Xiao Jinli’s eyes flashed coldly, and she snatched the iron stick from his hand, raised it and smashed it against his leg, saying coldly, “So you like smashing, huh? Well, I like smashing too!”<br/><br/>“Crack!”<br/><br/>“Ah!”<br/><br/>A miserable scream filled the entire street.<br/><br/>The other men who were smashing the shop immediately stopped what they were doing, their faces filled with shock, and their eyes showed a hint of fear as they nervously swallowed.<br/><br/>They never expected that a young girl could not only overpower them physically but also have the courage to hit them.<br/><br/>Right after he got over his shock, Lai Lao Liu pointed at Xiao Jinli and cursed, “You stinky girl, how dare you hit my brother! Just wait until I teach you a lesson!”<br/><br/>With that, he swung his iron stick at Xiao Jinli’s head.<br/><br/>When Xiao Qinglin and the others saw this, their pupils shrank and they roared, “Don’t you dare!”<br/><br/>However, Xiao Jinli effortlessly blocked Lai Lao Liu’s iron stick with her own, then pushed it back with a bit more force, making him stumble backward before he also let out a terrible scream.<br/><br/>“Crack!”<br/><br/>“Ah!”<br/><br/>Xiao Jinli broke his hand.<br/><br/>Xiao Jinli’s consecutive successes of breaking the hands and legs of the brothers have frightened the gang led by Lai Lao Liu.<br/><br/>Bearing the severe pain, Lai Lao Liu told his brothers, “Let’s go together and teach this stinky girl a lesson! If she dies, it’s on me.”<br/><br/>They knew by then that Xiao Jinli was not to be messed with.<br/><br/>However, after injuring their two brothers, they couldn’t let her go.<br/><br/>The remaining brothers exchanged glances, then shouted, “Let’s go together! I don’t believe we can’t take down this stinky girl!”<br/><br/>Just as they were about to attack Xiao Jinli with their weapons, a stern voice shouted, “Stop! Yamen police!”<br/><br/>Luo Sanbiao led five or six police officers to rush over quickly, each holding a weapon and pointing at the would-be assailants.<br/><br/>Those who wanted to hurt Xiao Jinli immediately froze when they saw the government officials appear with weapons in their hands.<br/><br/>When facing ordinary citizens, they were arrogant and domineering, but in the face of the Yamen officers, they were like rats seeing a cat.<br/><br/>Although they had people backing them, since the policing officers appeared, they no longer dared to challenge the authority of the Yamen officers.<br/><br/>Luo Sanbiao walked up to Xiao Jinli, looked her up and down, and asked very concerned, “Little Li, are you okay? I’m sorry, Uncle Luo is late.”<br/><br/>Xiao Jinli smiled and said, “Uncle Luo, it’s okay. You’re not late; you came at the perfect time!”<br/><br/>Someone recognized Luo Sanbiao and said in surprise, “It’s Director Luo from the Ganjiang City Yamen!”<br/><br/>As soon as the words fell, Lai Lao Liu and his men felt a sudden sense of impending doom.\t\t\t\t\t\t</div>", "images": {}, "success": true}