{"id": 288, "url": "https://www.novelhall.com/the-lucky-star-blessing-the-whole-village-32483/15193380.html", "title": "Chapter 288 - Chapter 288: Chapter 288: (Second Update)", "volume": 3, "volume_title": "Volume 3", "body": "<h1>Chapter 288 - Chapter 288: Chapter 288: (Second Update)</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 288: Chapter 288: (Second Update)<br/><br/>Translator: 549690339<br/><br/>Xu Mengmeng’s family of three were eating heartily in the cafeteria, very satisfied.<br/><br/>Xu Guochang patted his stomach, looked at the guests outside, and smiled, “After we finish eating, let’s leave. There are still many guests waiting for seats outside.”<br/><br/>Mother Xu nodded, “After we are full, let’s take a walk and go back to the hotel to rest. In the afternoon, we’ll go out again.”<br/><br/>In fact, the Xiao Village Farmhouse is not that big. If you want to take a look, you can actually finish in one day. But alas, there are many activities and lots of gourmet food.<br/><br/>Even for the gourmet food, many people don’t want to stay for just one day and then leave.<br/><br/>Xu Mengmeng’s family of three strolled around near the hotel.<br/><br/>Xu Mengmeng suddenly pointed to a girl and exclaimed, “Mom, look, that girl is so beautiful! And, the child she is leading is so cute!”<br/><br/>Xu Guochang looked in the direction his daughter pointed, and when he saw the person, his face changed slightly.<br/><br/>Mother Xu nodded, “Indeed, that girl is really beautiful. I have never seen a girl as beautiful as her.”<br/><br/>“Ah, someone is rushing towards that girl!” Xu Mengmeng widened her eyes, worriedly said, “Will they knock her down? If she falls, she might get hurt.”<br/><br/>Xu Guochang glanced and quickly ran over to try to stop it.<br/><br/>Xu Mengmeng stared dumbfounded at his father’s actions.<br/><br/>Mother Xu hesitated for a while, then told her daughter, “Mengmeng, let’s follow them!”<br/><br/>The girl Xu Mengmeng pointed to was Xiao Jinli, and the child she led naturally was her “stepson” Jiang Yifan.<br/><br/>Xiao Jinli took her child out, naturally just to look around.<br/><br/>It’s just that she is too beautiful, and often encounters men with lustful desires wanting a romantic encounter.<br/><br/>Just like this, as she’s walking along, a man wants rush over to her.<br/><br/>His purpose in doing so is, after knocking Xiao Jinli down, he would help her up, apologize, ask for her contact information, etc. This way, he has a legitimate way to strike up a conversation.<br/><br/>Xiao Jinli, holding Jiang Yifan, saw a man rushing towards them, quickly pulled Jiang Yifan away. The man, due to inertia, continued to move forward and collided with another man.<br/><br/>Jiang Yifan rolled his eyes and said somewhat speechlessly, “Mommy, another man is trying to collide with you.”<br/><br/>Xiao Jinli looked at the man who had fallen down, shrugged, and said modestly, “There’s no way. Your mommy is just too beautiful.”<br/><br/>Surrounding tourists saw this and covered their mouths, finding it somewhat amusing.<br/><br/>However, they were surprised to see that Xiao Jinli actually had such a big son.<br/><br/>“Girl, are you married?” someone curiously asked.<br/><br/>Xiao Jinli replied, “Not married.”<br/><br/>“Ha, not married, yet you have such a big son?” A tourist doubted this.<br/><br/>But they quickly figured it out.<br/><br/>They guessed that this girl was so beautiful that she was deceived by a man, which led to her becoming pregnant and having a child out of wedlock.<br/><br/>At once, people looked at Xiao Jinli with different expressions.<br/><br/>Some showed pity and sympathy, while others showed disdain and contempt, looking at such a beautiful girl who didn’t love herself enough.<br/><br/>Xiao Jinli was already used to these strange looks.<br/><br/>Who made her have a “stepson”?<br/><br/>However, since this “stepson” appeared, some troubles have indeed decreased.<br/><br/>Jiang Xiaoping, the man who was knocked down by inertia, turned green when he saw that he had bumped into another man.<br/><br/>The man who was bumped into also had a bad attitude. He clutched his shoulder and yelled, “Are you blind? You’re running around like crazy!”<br/><br/>If Jiang Xiaoping just apologized, it would have been okay. But he happened to look at Xiao Jinli and asked loudly, “Why did you dodge?”<br/><br/>Xiao Jinli,<br/><br/>The surrounding tourists,<br/><br/>Is this person crazy? If you can clearly see someone is about to run into you, shouldn’t you avoid them?<br/><br/>Xiao Jinli didn’t speak up, but Little Jiang Yifan curiously asked, “Uncle, your question is so strange! If you see something coming toward you, shouldn’t you move out of the way? You just stand there and let it hit you, hurting yourself in the process?”<br/><br/>Little Jiang Yifan’s words were agreed upon by everyone.<br/><br/>“Exactly, if we saw someone about to run into us, we would definitely move. We aren’t idiots.”<br/><br/>“This man is really strange, trying to bump into a girl for no reason and still insisting he’s right?”<br/><br/>“Hehe, he probably thought the girl was pretty and wanted a reason to touch her.”<br/><br/>While everyone was discussing, Xu Guochang hurried over and immediately acted respectfully upon seeing Xiao Jinli. “Xiao… Miss Xiao!” He originally wanted to call her Chairman Xiao.<br/><br/>Xiao Jinli smiled and said, “Oh, it’s Mr. Xu.”<br/><br/>Xu Guochang said, “Miss Xiao, I have something to discuss with you, do you have a moment?”<br/><br/>After hearing the honorifics he used, the expression on the faces of the surrounding people immediately looked strange.<br/><br/>Then someone recognized Xu Guochang and gasped, “The President of Divine Wind Technology Group, Xu Guochang!”<br/><br/>Divine Wind Technology Group was established three years ago out of nowhere, and in just three years, it has become a leader in the industry and ranked among the top three wealthiest people in the country.<br/><br/>The most advanced cellphones were developed by the Divine Wind Technology Group.<br/><br/>“Ah, it’s really President Xu!”<br/><br/>Xu Guochang occasionally appeared on television and in the media; naturally, many people recognized him.<br/><br/>“President Xu, hello, I am…”<br/><br/>“President Xu, hello, I am…”<br/><br/>Everyone gathered around Xu Guochang, introducing themselves and asking for autographs, making it impossible for him to leave.<br/><br/>Mother Xu and her daughter came over to see everyone surrounding her husband (father).<br/><br/>What happened in such a short time?<br/><br/>Xu Guochang finally escaped from the crowd and looked around, but he couldn’t find Xiao Jinli.<br/><br/>Xu Mengmeng asked doubtfully, “Dad, who are you looking for?”<br/><br/>“Xiao Miss, the pretty girl you just mentioned.” Xu Guochang replied.<br/><br/>Xu Mengmeng asked doubtfully, “Dad, why are you looking for her?”<br/><br/>At this point, recalling something, she said solemnly, “Dad, you can’t abandon my mom just because you’re rich now. If you do, I’ll never recognize you.”<br/><br/>Xu Guochang’s face darkened, and he scolded, “What nonsense are you talking about, kid? Do I look like that kind of person to you? Even if your mom wants to leave me, I’ll still cling to her.”<br/><br/>Mother Xu’s face turned red.<br/><br/>Xu Mengmeng asked doubtfully, “Then, dad, why are you looking for that pretty girl?”<br/><br/>Just as Xu Guochang was about to speak, a teenager came over and asked, “Are you Mr. Xu Guochang?”<br/><br/>“Yes, I am. And you are…?” Xu Guochang asked doubtfully.<br/><br/>Xiao Xiaoming smiled and said, “My name is Xiao Xiaoming. Sister Jinli asked me to take you to her.”<br/><br/>Xu Guochang instantly understood and nodded, “Okay, thank you!”\t\t\t\t\t\t</div>", "images": {}, "success": true}