{"id": 281, "url": "https://www.novelhall.com/the-lucky-star-blessing-the-whole-village-32483/15193373.html", "title": "Chapter 281 - Chapter 281: Chapter 281: (First Update)", "volume": 3, "volume_title": "Volume 3", "body": "<h1>Chapter 281 - Chapter 281: Chapter 281: (First Update)</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 281: Chapter 281: (First Update)<br/><br/>Translator: 549690339<br/><br/>Regarding Ganjiang City Official Department Chief Luo Sanbiao, Lai Lao Liu and his gang had never met the man in person, but they’d heard of his name and his legend.<br/><br/>Lai Lao Liu and his gang relied on having connections and being paid a large sum of money to come and vandalize the store.<br/><br/>According to their expectations, even if the store called the police, it should have been the Chengbei Xinjiang District Government Office that came to deal with the matter within their jurisdiction.<br/><br/>But they never expected that the person who showed up would be the Prefecture Official Department Chief.<br/><br/>Moreover, seeing how familiar Director Luo was with the little girl, they suddenly felt a dark cloud hanging over them.<br/><br/>Lai Lao Liu’s broken arms hung limply, and he tried to preemptively file a complaint with Luo Sanbiao, “Director Luo, this stinky brat broke my arms and one of my brother’s legs. You should arrest her and make them pay for compensation.”<br/><br/>Luo Sanbiao’s sharp gaze swept over him and then turned to Xiao Jinli, asking, “Little Li, what’s the resolution?”<br/><br/>Xiao Jinli shrugged her shoulders and spread her hands, saying, “I did break their arms and legs, but it was in self-defense!”<br/><br/>Lai Lao Liu roared with a guilty conscience, “You’re full of shit!”<br/><br/>Xiao Jinli said, “Whether or not it was self-defense, I have evidence. You guys, on the other hand, came to my store and caused a scene, causing our store to lose more than two hundred thousand dollars, and you still want to hurt people. Uncle Luo, I have surveillance here.”<br/><br/>Xiao Jinli pointed at a corner of the room and continued, “It’s them who hurt people first, I was acting in self-defense!”<br/><br/>Luo Sanbiao nodded, “Okay, Uncle Luo knows.”<br/><br/>Then, he scolded Lai Lao Liu and his gang, “You vandalize people’s stores and try to hurt them, do you think that’s reasonable? Take all these people away, thoroughly interrogate them, and find out who gave them the courage to act so lawlessly in broad daylight!”<br/><br/>Luo Sanbiao and his men took Lai Lao Liu and his gang away.<br/><br/>However, Lai Lao Liu and Cheng Gouzi both had their arms broken, and one of them had a leg broken, so they were taken to the hospital first.<br/><br/>Lai Lao Liu and Cheng Gouzi were still loudly shouting, “Director Luo, my arms (legs) were broken by her, you must make her pay for compensation!”<br/><br/>Luo Sanbiao coldly snorted, “Compensate what? I’ll tell you, the girl was acting in self-defense, and you guys brought it all on yourselves! You’d better start saving money to treat your own broken arms and legs. You deserve it for causing trouble!”<br/><br/>When Lai Lao Liu and Cheng Gouzi heard that, they panicked.<br/><br/>“No, Director Luo, we were ordered by someone to cause trouble at that store. I know I was wrong, please make sure we get the best doctors, I don’t want to be disabled.”<br/><br/>How could they continue their lives with broken arms and legs?<br/><br/>Luo Sanbiao sneered, “Do you not want to be disabled, huh? Then you better confess why you went to that store and caused trouble? You guys have any idea how much damage you caused to the store with just a casual swing? It’s two or three hundred thousand dollars. You’ll not only have to pay for the damages, but you’ll also go to jail.”<br/><br/>After hearing this, Lai Lao Liu and the others’ eyes were filled with darkness.<br/><br/>“No, we were ordered by someone else to cause trouble…”<br/><br/>Before even reaching the Official Department Office, Lai Lao Liu had confessed everything.<br/><br/>They did have backers, but their backers weren’t as powerful as Director Luo.<br/><br/>If they didn’t confess and try to reduce their guilt, they might face severe compensation and imprisonment.<br/><br/>As for being accomplices, they wouldn’t have to worry about compensating as the main culprit would.<br/><br/>Xiao Qinglin and the surrounding guests watched as the arrogant Lai Lao Liu and his gang were taken away by the unexpected government officials.<br/><br/>After regaining his composure, Xiao Qinglin asked happily, “Jinli, do you know Director Luo?”<br/><br/>In fact, Xiao Qinglin, as an ordinary citizen, didn’t know Ganjiang City Director Luo, but he just heard everyone calling him that a while ago.<br/><br/>Xiao Jinli nodded, “Hmm, I have some connections with Director Luo!”<br/><br/>Xiao Qinglin nodded, “So you were the one who told us not to be impulsive, to just stand by and watch them vandalize the store, you wanted to catch them in the act.”<br/><br/>A guest laughed, “That Lai Lao Liu relied on his connections and acted recklessly. Now he’s screwed, capsized his boat in the gutter.”<br/><br/>“Definitely,” another guest chimed in, “Now his hand is broken,”<br/><br/>At this point, the guests finally realized and exclaimed, “Girl, did you learn any martial arts? Those were two grown men with iron rods in their hands. I never thought you would be able to strike them back like that, you’re amazing.”<br/><br/>“Yeah, that’s an iron rod. If it hit you on the head, your brain would be splattered everywhere. Lai Lao Liu and his gang are just too lawless, not only did they vandalize the store, they even tried to hurt people in broad daylight, it’s outrageous. That’s a clear case of intentional murder, oh, attempted murder.”<br/><br/>“Damn, who gave them this kind of courage? Fortunately, the girl knows martial arts, otherwise, a beautiful girl like her would have been ruined by them.”<br/><br/>“Girl, you are amazing. Where did you learn this? I also want to send my girl to learn.” A middle-aged woman asked, “Having some martial arts would help protect themselves! My girl is about your age and she’s beautiful.”<br/><br/>Those with beautiful young girls at home would be both happy and worried about their girls being targeted by people with bad intentions.<br/><br/>An old lady looked at her with bright eyes, “Yes, my granddaughter is also about your age, very cute. I also want to send her to learn some martial arts, so that she can protect herself like you do.”<br/><br/>Xiao Jinli’s amazing performance earlier not only shocked Lai Lao Liu and his gang but also the surrounding guests and passers-by.<br/><br/>Xiao Jinli smiled helplessly, “Auntie, Grandma, I was born strong, I didn’t learn any martial arts.”<br/><br/>“Huh?” The guests could not believe such words as their puzzled gazes turned to Xiao Qinglin and the others.<br/><br/>“Cough…” Xiao Qinglin explained, “This child’s strength is indeed innate, she has never learned martial arts or anything like that.”<br/><br/>“So, some people really are born with divine strength. When I watched the television before, I thought it was all made up. Now I know that these are all based on reality.”<br/><br/>“Born with strength, and so beautiful and cute, she should be able to protect herself.”<br/><br/>“Yes, she can even counter-attack an adult with an iron rod, that’s really amazing.”<br/><br/>“Boss, do you still sell the products in your store?”<br/><br/>“Those gangsters have been arrested, they shouldn’t come back to cause any more trouble, right?”<br/><br/>“They shouldn’t. Didn’t you see that even Director Luo himself came to arrest them? No, how did Director Luo happen to come here?”<br/><br/>“Ha ha, didn’t you see that Director Luo and the little girl are so familiar with each other? They must have communicated in advance.”<br/><br/>“Yes, that’s true. From now on, the Xiao Family Village Green Fresh Shop has someone to back it, let’s see who dares to cause trouble here again.”\t\t\t\t\t\t</div>", "images": {}, "success": true}