{"id": 289, "url": "https://www.novelhall.com/the-lucky-star-blessing-the-whole-village-32483/15193381.html", "title": "Chapter 289 - Chapter 289: Chapter 289: (First Update)", "volume": 3, "volume_title": "Volume 3", "body": "<h1>Chapter 289 - Chapter 289: Chapter 289: (First Update)</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 289: Chapter 289: (First Update)<br/><br/>Translator: 549690339<br/><br/>Xu Guochang’s family of three followed Xiao Xiaoming to Xiao Jinli’s house.<br/><br/>There was no change to the Xiao family’s house.<br/><br/>“Sister Jin Li, I brought the guests here.”<br/><br/>Before entering the yard, Xiao Xiaoming started yelling.<br/><br/>In the yard, a cute child was playing with water in a pool, Xiao Jinli was sitting at a stone table, brewing a pot of hot tea, obviously preparing to greet the guests.<br/><br/>Seeing this quiet, tidy and beautiful yard, Xu Mengmeng’s eyes lit up, showing her admiration.<br/><br/>As soon as Xu Guochang stepped inside, he respectfully greeted, “Miss Xiao!”<br/><br/>Xiao Jinli put down the purple clay teapot and smiled, nodding, “President Xu, you’re here.”<br/><br/>It puzzled both Mother Xu and her daughter why their husband (father) was so respectful to Miss Xiao.<br/><br/>To be sure, ever since he became president of the Shenfeng Group, it was always others who showed respect to him.<br/><br/>Xu Guochang introduced to Xiao Jinli, “Miss Xiao, this is my wife, and this is my daughter. Wife, Mengmeng, this is Miss Xiao.”<br/><br/>Mother Xu and her daughter also showed their respect, calling out, “Miss Xiao!”<br/><br/>Xiao Jinli nodded and said, “Hmm, please have a seat, all of you!”<br/><br/>Xu Guochang nodded and then said to his wife and daughter, “Let’s sit.”<br/><br/>Xiao Jinli poured them a cup of tea and said, “Try this tea, everyone!”<br/><br/>Xu Guochang’s family of three had already noticed the fragrant tea, and they wanted to try it.<br/><br/>Therefore, without any hesitation, they picked up the teacups and took a sip.<br/><br/>Xu Mengmeng, surprised, exclaimed, “This tea smells so good! I’ve never had such fragrant tea.”<br/><br/>Mother Xu couldn’t help but sigh, “It’s so fragrant.”<br/><br/>Xu Guochang was equally amazed, “It really is fragrant. Miss Xiao, your tea-making skills are unparalleled.”<br/><br/>Xiao Jinli chuckled, “It’s not that my tea-making skills are great, but that the water here is good. No matter who makes the tea, it’s never bad!”<br/><br/>Xu Mengmeng’s eyes lit up, and she asked in astonishment, “Really?”<br/><br/>Xiao Jinli nodded and said, “Let Miss Xu try our well water. Jiang Yifan, go to the kitchen and bring some cold water.”<br/><br/>Xiao Jinli asked Jiang Yifan, who was playing with water in the pool, to fetch water.<br/><br/>Xu Mengmeng felt a little reluctant to trouble such a young child and said, “Let me do it myself.”<br/><br/>Xiao Jinli shook her head and said, “No need. He’s just idling around. It’s good for him to attend to guests.”<br/><br/>Xu Guochang and the others, . Aren’t children of three or four years old supposed to be idle?<br/><br/>Jiang Yifan stood up from the pool and complained, “Mom, do you call me just because I’m the youngest? Are you bullying me for my age?”<br/><br/>Xu Guochang was shocked when he heard the child call Xiao Jinli “Mommy”.<br/><br/>He stuttered, “Miss Xiao, is this… this your son?”<br/><br/>If he remembered correctly, Miss Xiao was only nineteen years old.<br/><br/>Does she already have such a big son at the age of nineteen?<br/><br/>Xiao Jinli responded, “It’s because you’re the youngest in the family and the easiest to order around. Now, stop complaining, and if I ask you to fetch water, go fetch water.”<br/><br/>Jiang Yifan grimaced, “You’re the only mother who treats a kid like this.”<br/><br/>Xiao Jinli smiled at him, “You’re not my son!”<br/><br/>Jiang Yifan,<br/><br/>Xu Guochang,<br/><br/>Jiang Yifan reluctantly went to the kitchen to get water.<br/><br/>Soon, he brought a teapot of cold water.<br/><br/>He came over, handed the water to Xiao Jinli, and muttered quietly, “I’ve never seen anyone treat guests to cold water.”<br/><br/>Xiao Jinli took the water, glared at him, and said irritably, “No one talks more than you do.”<br/><br/>Jiang Yifan sighed softly, “I’m just a poor little boy who has a cold-blooded and heartless mother like you.”<br/><br/>Xiao Jinli said indifferently, “You don’t have to be my son.”<br/><br/>No way.” Jiang Yifan firmly refused, “If I don’t be your son, you won’t have a son at all, so it’s better for me to be your son.”<br/><br/>Xiao Jinli, . How does she know she won’t have a son in the future since she’s not even married yet?<br/><br/>Xu Guochang’s family of three,<br/><br/>Can a mother and child get along like this?<br/><br/>Xiao Xiaoming laughed and said, “Xiao Fan, Brother Xiaoming will take you out to play.”<br/><br/>Everyone had grown accustomed to the strange relationship between Xiao Jinli and Jiang Yifan.<br/><br/>One refusing to acknowledge her son, the other desperately trying to be her son.<br/><br/>Jiang Yifan nodded and said, “Alright, Brother Xiaoming, take me out for a while. If I stay here, I’ll just be disliked by someone.”<br/><br/>Xiao Jinli,<br/><br/>As Xiao Xiaoming took Jiang Yifan away, Xu Guochang and his family still looked somewhat stunned.<br/><br/>“Ahem…” Xiao Jinli’s expression changed slightly and she said, “President Xu, what brings you here today?”<br/><br/>Xu Guochang came to his senses, “Miss Xiao, is this your family home?”<br/><br/>“Yes, I grew up here!” Xiao Jinli nodded, “This is my home.”<br/><br/>Ever since Xu Guochang had known Xiao Jinli, he had always found her mysterious.<br/><br/>He didn’t expect that, after coming on a trip, he would unexpectedly discover where Xiao Jinli lived.<br/><br/>Xu Mengmeng said enviously, “It must be so nice to grow up here, with such beautiful scenery.”<br/><br/>Xiao Jinli nodded and said, “Indeed, the scenery has always been beautiful here. How many days are you planning to spend here for your visit?”<br/><br/>Xu Mengmeng laughed and said, “Five days. The scenery here is beautiful, the performances are entertaining, and most importantly, there are so many delicious foods. I don’t want to leave. However, my parents have work to do and can’t stay here for long.”<br/><br/>Xiao Jinli smiled and said, “Miss Xu, you’re so adorable. You’re on vacation now, right?”<br/><br/>Xu Mengmeng nodded, “Hmm.”<br/><br/>It is now summer vacation.<br/><br/>He has also returned to the country three years ago.<br/><br/>Three years ago, when he came back, he was let go from a Plum Firm Country technology company. That company even boycotted him in the entire industry, forcing him to return home to find a job.<br/><br/>However, it’s not easy to find a job in a domestic company. Many people initially admired his resume, only to find that he had worked in Plum Firm Country. However, as soon as they learned through some channels the cause of his dismissal – stealing company secrets – they rejected him.<br/><br/>Meanwhile, his wife and daughter in Plum Firm Country were faced with expulsion.<br/><br/>Reluctantly, he brought his wife and daughter back to the country.<br/><br/>However, in his home country, he hadn’t found a job yet, and all his previous savings ran out. He borrowed money from relatives and friends.<br/><br/>But when the borrowed money was spent and there was no money to pay the rent, the three of them were evicted from their rented house.<br/><br/>Just when the family of three was about to be homeless, a man in black said to him, “Mr. Xu, our boss wants to see you.”<br/><br/>Xu Guochang looked puzzled and asked, “Who is your boss?”<br/><br/>“You’ll find out when you meet him.” The man in black looked at his wife and daughter, then said, “Our boss only wants to see you. We’ve already booked hotel rooms for your wife and daughter, and they can stay there temporarily.”\t\t\t\t\t\t</div>", "images": {}, "success": true}