{"id": 283, "url": "https://www.novelhall.com/the-lucky-star-blessing-the-whole-village-32483/15193375.html", "title": "Chapter 283 - Chapter 283: Chapter 283:", "volume": 3, "volume_title": "Volume 3", "body": "<h1>Chapter 283 - Chapter 283: Chapter 283:</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 283: Chapter 283:<br/><br/>Translator: 549690339<br/><br/>Jingjing Green Health Group was exposed for tax evasion, and its legal representative and group chairman, Zhang Jingjing, was taken away in handcuffs by government officials. The company’s stock plummeted quickly, and as the group was in chaos, many companies took the opportunity to capitalize on their misfortune.<br/><br/>Thus, the once vast group was on the brink of collapse within just a few days.<br/><br/>Of course, Xiao Jinli had no interest in Jingjing Green Health Group, so naturally, he did not make a move on the company.<br/><br/>Jingjing Green Health Group went bankrupt in no time, naturally giving the other two corporate giants a wake-up call.<br/><br/>If it was just ordinary tax evasion, as long as it was made up for in time, the company would not collapse so quickly.<br/><br/>Thus, these two giants began to investigate the real reason for the bankruptcy of Jingjing Green Health Group!<br/><br/>Upon investigating, some warning signs appeared – how come all clues pointed towards a small company – Xiao Family Village Green Fresh Company?<br/><br/>What’s so special about this small company?<br/><br/>After further investigation, what they found was shocking!<br/><br/>This small company was established in that very remote village!<br/><br/>This was not surprising, after all, it was a company selling vegetables and fruit, so having the company set up at the base was quite normal!<br/><br/>But what was not normal was that there were several old heroes living in this small village!<br/><br/>Who would dare to provoke this small company?<br/><br/>So, it was no injustice for Jingjing Green Health Group to go bankrupt – they had the audacity to provoke them?<br/><br/>Thus, the other two giants, while envious of the thriving business of this small company, didn’t dare to use any underhanded tactics. Even if they were to snatch business, it would only be through fair competition!<br/><br/>However, no matter how they tried, they couldn’t compete with Xiao Family Village Green Fresh Company and could only watch them make money in frustration!<br/><br/>As for the other companies, there was simply no possibility of competition.<br/><br/>Therefore, the Xiao Family Village Green Fresh Group, growing at a rapid speed, became a giant company worth tens of billions in just a few years.<br/><br/>Jiang Yifan sat at the village entrance, listening as the elders narrated the development history of the Xiao Family Village Green Fresh Company, and he was quite curious.<br/><br/>He asked, “Is Mommy the boss of the company?”<br/><br/>The elder chuckled, “Of course your Mommy is the boss of the company.”<br/><br/>Then he explained, “If it weren’t for your Mommy’s suggestion, if it weren’t for the earthworms that your Mommy raises, we wouldn’t have the good life we have now. Little Fanfan, you probably don’t know, but our Xiao Family Village used to be the poorest village within ten miles and eight villages. But now, our village is the richest village in the whole Quanzhou Province. All the credit goes to your Mommy.”<br/><br/>Jiang Yifan seemed to understand but didn’t quite fully get it, yet he looked quite proud as he puffed out his chest. He nodded, “Hmm, Mommy is very beautiful, she smells so good.”<br/><br/>The elder didn’t echo Jiang Yifan’s words, but continued to speak, “Your Mommy has been our village’s fortune, our village treasure since she was young. Apart from her own abilities, there’s another thing – her luck is incredibly good. Not only is her luck good, but it also seems to rub off on anyone associated with her. Isn’t this surprising and incredible?”<br/><br/>Jiang Yifan nodded, “Hmm, that’s indeed incredible!”<br/><br/>The elder continued, “When the company was first established, we decided your Mommy should be the boss. However, because she was only about ten years old then and couldn’t hold any real rights, this position was held off until she turned 18 and became an adult.”<br/><br/>Jiang Yifan’s eyes rolled around and he chuckled, “Elderly Grandfather, are you saying that such a big company now entirely belongs to my Mommy?”<br/><br/>The elder grinned and said, “Hmm, you can say that!”<br/><br/>“Ha ha, my Mommy is so rich!” Jiang Yifan laughed excitedly.\t\t\t\t\t\t</div>", "images": {}, "success": true}