{"id": 297, "url": "https://www.novelhall.com/the-lucky-star-blessing-the-whole-village-32483/15193389.html", "title": "Chapter 297 - Chapter 297: Chapter 297:", "volume": 3, "volume_title": "Volume 3", "body": "<h1>Chapter 297 - Chapter 297: Chapter 297:</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 297: Chapter 297:<br/><br/>Translator: 549690339<br/><br/>Though the headquarters of Lu Xian Group is located in Xiao Family Village,…<br/><br/>tourists are not allowed inside the company.<br/><br/>But when Lan Qingqing was escorted out of the village entrance by the security guard, numerous tourists gawked at her.<br/><br/>“What’s going on? How can they just throw a tourist out like that? So rude!” A tourist, unaware of Lan Qingqing’s identity, naturally assumed she was a fellow tourist.<br/><br/>“This woman seems to have been thrown out from the company’s headquarters. Is it because a tourist sneaked in, and they found her?”<br/><br/>“No, even if a tourist had sneaked in, they would just ask them not to come in anymore, not throw them out of the village in such an impolite manner.”<br/><br/>At this moment, someone from Xiao Family Village spoke up.<br/><br/>“Lan Qingqing is back, it seems like Xiao Mingchen must be really angry this time.”<br/><br/>“It probably wasn’t Xiao Mingchen who told the security guard to throw her out, right? I saw Jinli go in, so it must’ve been Jinli who did it.”<br/><br/>“It should be. Xiao Mingchen has a soft heart and values relationships.”<br/><br/>“As if Lan Qingqing isn’t bad enough, she has been divorced for so many years and has married twice since then, yet she still dares to come back asking for a remarriage with Xiao Mingchen. How could Xiao Mingchen even consider it when his relationship with Little Guan is so good?”<br/><br/>“Exactly, she’s shameless. When she married Xiao Mingchen, she demanded high betrothal gifts. During the divorce, she forced Xiao Mingchen to leave penniless, taking over a million from the family. Now that she’s having a hard time and hears Xiao Mingchen has money, she shamelessly comes back, wanting to remarry. Does she really think Xiao Mingchen can’t live without her?”<br/><br/>“Absolutely. She has cheated Xiao Mingchen out of so much money over the years, and in the end, taken the money and left without looking back after the divorce. Now, she wants to remarry? She’s dreaming. Anyone with a sane mind would never remarry her. How could she even bring up the matter of remarriage?”<br/><br/>Curious tourists asked, “Auntie, so you’re saying the woman who was just carried out by security isn’t a tourist but named Lan Qingqing? She used to be from your Xiao Family Village?”<br/><br/>“Indeed. But eight years ago, after divorcing Xiao Mingchen and taking all their money, even her parents-in-law’s savings were all snatched up—over a million back then! She left without ever looking back.”<br/><br/>“Ah, why did they divorce?”<br/><br/>I heard that many people now want to enter Xiao Family Village, finding it hard to get in.<br/><br/>News reports say that the land prices in Xiao Family Village are now comparable to those in the Capital City.<br/><br/>Having divorced eight years ago, that woman must now be dying of regret.<br/><br/>“Humph, what could be the reason? Back then, when the company in Xiao Family Village was just established, Xiao Mingchen wanted to stay, but she didn’t. Even though they had differences of opinion, Lan Qingqing ended up blaming her in-laws. But that’s not the<br/><br/>main point. She’s someone who only cares about her maiden family. Not only did she give all her own earnings to her family, but she also demanded her husband’s money to buy a house when her younger brother got married. As a result, due to various reasons, Xiao Mingchen couldn’t take it anymore and divorced her. Sigh, our Xiao Mingchen is such a good kid and husband, only to have been stuck<br/><br/>with such a daughter-in-law and family.”<br/><br/>“A wife who only focuses on her maiden family, and a younger brother-loving marriage wrecker, are the types to bring ruin. Marrying her could empty out the whole family’s wealth.”<br/><br/>“Exactly. Our Xiao Mingchen, just from getting married—and except for the old house—the majority of the money was drained away. But fortunately, he has now found a good wife.”\t\t\t\t\t\t</div>", "images": {}, "success": true}