{"id": 296, "url": "https://www.novelhall.com/the-lucky-star-blessing-the-whole-village-32483/15193388.html", "title": "Chapter 296 - Chapter 296: Chapter 296:", "volume": 3, "volume_title": "Volume 3", "body": "<h1>Chapter 296 - Chapter 296: Chapter 296:</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 296: Chapter 296:<br/><br/>Translator: 549690339<br/><br/>Lan Qingqing seemed to have a relentlessness about achieving her goal.<br/><br/>After hearing Xiao Mingchen’s words, she was greatly hurt.<br/><br/>Through her tearful eyes, she looked at Xiao Mingchen and asked sadly, “Mingchen, why are you so cruel to me? Didn’t you like me and spoil me a lot before? I already know my mistake, so why can’t you forgive me? Wuu… Xiao Mingchen, you can’t treat me like this!”<br/><br/>Onlookers,<br/><br/>Is this woman really shameless and unable to understand human language?<br/><br/>Divorced for eight years, people have already married and explicitly rejected her, and they will not remarry.<br/><br/>Moreover, asking him to divorce his current wife and marry her again is ridiculous.<br/><br/>Xiao Jinli glanced at her Second Brother, whose face was now livid and seething with anger.<br/><br/>She coldly shouted at Lan Qingqing, “Lan Qingqing, do you really have no shame? Even after peeling off your thick skin, you’re still being relentless here. Do we have to call the police and have you arrested to get rid of you?”<br/><br/>Lan Qingqing was taken aback and then said with a wronged and sorrowful expression, “Little Sister Jinli, you can’t treat me like this.”<br/><br/>“There’s nothing acceptable or unacceptable.” Xiao Jinli coldly said, “You’ve already caused serious trouble for my Second Brother and Second Sister-in-law. Please leave, and in the future, never set foot in Xiao Family Village again. Otherwise, I’ll call the police!”<br/><br/>“You…” Lan Qingqing hadn’t expected Xiao Jinli to be even more ruthless. She said, “I… I just want to fight for my own happiness. Is that wrong?”<br/><br/>“There’s nothing wrong with you fighting for your own happiness!” Xiao Jinli coldly responded, “But the happiness you want to fight for is to break up my Second Brother’s marriage and destroy his happiness. That’s where you’re wrong!”<br/><br/>“Xiao Jinli, when your Second Brother was with me, I can make him happy. I am the person your Second Brother loves the most!” Lan Qingqing yelled without confidence, “Don’t you want your Second Brother to be happy? Xiao Jinli, you can’t be so selfish.”<br/><br/>Xiao Mingchen furiously shouted, “Lan Qingqing, who exactly is being selfish? I admit that when you were my wife, I loved you and spoiled you. But now that we are divorced, I don’t love you at all. Let me tell you, stop causing trouble here. Leave immediately, and don’t ever set foot in Xiao Family Village again.”<br/><br/>“No, I won’t leave!” Lan Qingqing stubbornly said, “Xiao Mingchen, don’t deceive yourself anymore. Is it so hard for you to admit that you still love me? I swear I won’t support my maiden family anymore and will be filial to your parents. Can we remarry?”<br/><br/>Everyone,  Who exactly is deceiving themselves?<br/><br/>Slap!<br/><br/>Guan Yunrou couldn’t bear it any longer and slapped Lan Qingqing’s face hard.<br/><br/>She furiously yelled, “Lan Qingqing, have you no shame? When will you stop deceiving yourself and others?<br/><br/>Let me tell you, Xiao Mingchen loved and spoiled you before because you were his wife. Now, I am his wife, and I am the one he loves and spoils. You’re just a third party trying to destroy other people’s marriages, you’re a mistress.<br/><br/>Let me tell you, I’ve tolerated you for too long. I’ve only held back until now to slap you. If you come near my husband again, I’ll see if I won’t beat you to a pulp.”<br/><br/>Lan Qingqing covered her face which was slapped by Guan Yunrou, showing a very angry expression. Then her expression turned pitiful again as she looked at Xiao Mingchen, “Xiao Mingchen, she hit me. Wuu, she hit me, and it hurts so much. Can you hit her back for me?”<br/><br/>Everyone,<br/><br/>This person must really not understand human language.<br/><br/>Xiao Jinli immediately called the security guards over, pointed at Lan Qingqing, and said, “Throw this woman out, and don’t allow her to set foot in Xiao Family Village ever again.”<br/><br/>Lan Qingqing’s face changed and she shouted, “Xiao Jinli, you can’t do this to me. I am…”<br/><br/>“Seal her mouth shut!” Xiao Jinli coldly ordered, “Lan Qingqing, it’s you who has no shame. So don’t blame others for treating you without respect. In the future, if you ever bother my Second Brother again, I’ll make a poster to publicize your attempt at being a mistress at the community where your parents, relatives, and friends live. You know, once I say something, I’ll do it!”<br/><br/>Hearing Xiao Jinli’s words, many people gasped.<br/><br/>That move was ruthless.<br/><br/>Lan Qingqing’s name has already been tarnished after receiving three high betrothal gifts from marrying three times. If people find out she’s trying to be a mistress, her reputation in the county town will be completely ruined.<br/><br/>She may not care about her face, but her relatives and friends do.<br/><br/>On the other hand, she may not care about the face of her relatives and friends. But those relatives and friends will care about their own face.<br/><br/>Moreover, Lan Qingqing had been brainwashed by her parents since childhood and highly valued being filial to her parents.<br/><br/>Lan Qingqing’s face showed an expression of fear. She screamed, “Xiao Jinli, you can’t do this.”<br/><br/>Xiao Jinli spoke coldly, “You should know that I can do this. So, Lan Qingqing, don’t provoke my Second Brother and our Xiao Family again. Otherwise, you’ll have to bear the consequences.<br/><br/>As someone who was a daughter-in-law of Xiao Family Village for two years, you know that when I, Xiao Jinli, do something, I deal with it thoroughly and leave no trace. Lan Qingqing, just take care of yourself.”<br/><br/>After listening to Xiao Jinli, Lan Qingqing’s face turned pale.<br/><br/>She could pester Xiao Mingchen, but she couldn’t ignore Xiao Jinli’s words.<br/><br/>Eight years ago, when Xiao Jinli was still a child, her status in Xiao Family Village was like that of a deity.<br/><br/>Eight years later, Xiao Jinli’s status in Xiao Family Village was even more transcendent.<br/><br/>Eight years ago, when Xiao Jinli was a child, she was already a ruthless and resourceful person.<br/><br/>Eight years later, Xiao Jinli was still the same.<br/><br/>As the security guards dragged Lan Qingqing out of Xiao Family Village, Xiao Jinli frowned slightly and said to Xiao Mingchen, “Second Brother, you were too soft on Lan Qingqing, and it made Second Sister-in-law suffer.”<br/><br/>Xiao Mingchen smiled bitterly and said, “After all, she was my wife, and I wanted to leave her some face. Who would’ve thought that she would be so shameless? Had I known, I would’ve thrown her out the first time she came to pester me.”<br/><br/>At this point, he said to Guan Yunrou, “I’m sorry, wife, for making you suffer.”<br/><br/>Guan Yunrou shook her head and said, “No, I’m not suffering. You’re a man with affection and loyalty, and that’s what attracted me to you in the first place. As you said, you’ve been married to Lan Qingqing, and you don’t want to go to extremes. I understand.”<br/><br/>… Xiao Jinli sighed softly, “All right, Second Brother, you and Second Sister-in-law can handle the communication by yourselves.”<br/><br/>Jiang Yifan, who was standing beside her, also heaved a sigh, “Mommy, it’s most suitable for you to be the villain!”<br/><br/>Everyone,<br/><br/>Xiao Jinli lightly patted his little head, annoyed, “What nonsense are you talking about? Am I a villain? I’m clearly a good person. I’m helping my Second Brother and Second Sister-in-law to protect their relationship from being destroyed.”<br/><br/>Jiang Yifan nodded in agreement and said, “Yes, you’re a good person, you’re a good person!”<br/><br/>Everyone, Why does it sound so weird?\t\t\t\t\t\t</div>", "images": {}, "success": true}