{"id": 294, "url": "https://www.novelhall.com/the-lucky-star-blessing-the-whole-village-32483/15193386.html", "title": "Chapter 294 - Chapter 294: Chapter 294: (Second Update)", "volume": 3, "volume_title": "Volume 3", "body": "<h1>Chapter 294 - Chapter 294: Chapter 294: (Second Update)</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 294: Chapter 294: (Second Update)<br/><br/>Translator: 549690339<br/><br/>Guan Yunrou sneered at Lan Qingqing and said, “Well well, your third husband only tested you with the idea of buying a house, asking you to take out your money for the down payment. Yet, you eyed the money of his parents and accused them of favoritism.”<br/><br/>Lan Qingqing widened her eyes, incredulous as she asked, “How do you know about that?”<br/><br/>“Humph, let me tell you, I am the little sister-in-law of your third husband’s sister.” Guan Yunrou scoffed, “So, how could I not know? Not only that, I also know about your secret of being twice divorced before marrying my little nephew-uncle! So, Lan Qingqing, have some shame. Each time you’ve gotten married, you’ve tricked people out of their hefty betrothal gifts. Yet, in the end, your wages and those of your husbands all go to subsidising your maiden family. Whoever marries you, ends up in an endless pit of expenditure.”<br/><br/>If Lan Qingqing wanted to hassle Xiao Mingchen relentlessly, Guan Yunrou was prepared to ruthlessly shred her dignity into pieces.<br/><br/>If Lan Qingqing had no respect for herself, who would respect her then?<br/><br/>With a shocked expression, Lan Qingqing stepped back a few paces, her face visibly upset.<br/><br/>She truly hadn’t expected this Guan Yunrou to have any connection with her third husband, Fang Jianbei.<br/><br/>“How is it, quite the surprise, isn’t it?” Guan Yunrou sneered, “When you made a fuss here a few days ago, I gave you face and didn’t tear you down completely. But now you’ve gone too far to call me a mistress, so I just need to set you straight. What, being married three times but still unable to marry off, so you’re desperately trying to latch onto your ex-husband, right? Haven’t you just failed to find another man like Xiao Mingchen who could tolerate you and leave you his property after all these years?<br/><br/>Or is it that you’ve heard that Xiao Mingchen’s family now has a dividend of 100 to 200 million, and he himself has an annual salary of one million, so you’re trying to take advantage of him again, right?”<br/><br/>“Well, let me tell you this, as long as I’m Xiao Mingchen’s wife, you might as well keep dreaming. And I will always be Xiao Mingchen’s wife, so you might as well keep dreaming forever.”<br/><br/>Lan Qingqing’s face turned green.<br/><br/>She hadn’t expected that Xiao Mingchen’s new wife would be so articulate and so difficult to deal with.<br/><br/>At this moment, Xiao Mingchen firmly said, “Yes, Rou’er and I will always be together. You can get lost, I never want to see you again.”<br/><br/>Upon hearing Xiao Mingchen’s words, Lan Qingqing immediately played the victim, “Mingchen, you have never treated me like this before, right? You also said that you loved me and wanted to always be with me. Have you forgotten? How can you treat me like this now, uh uh…”<br/><br/>Lan Qingqing was genuinely heartbroken.<br/><br/>Of the three men she had married, Xiao Mingchen had treated her the best, fulfilling her every demand and handling the majority of the housework.<br/><br/>During her second marriage, she had received a high-priced betrothal gift but ended up being treated as a nanny in the man’s household, immediately asked to produce offspring after the marriage. As a college graduate with a decent job, and having been spoiled by others, how could she reconcile with being a housekeeping wife and breeding machine? She felt extremely wronged.<br/><br/>However, before she had a chance to rebel, her in-laws discovered her nature of playing favorites with her family home. Taking advantage of the fact that they hadn’t had children yet, they quickly divorced and even demanded the full return of the betrothal gift, causing her to lose face in the county town.<br/><br/>Luckily, she later married a man with an annual salary of one million, earning her and her maiden home a lot of face.<br/><br/>Fang Jianbei also liked her a lot and pampered her, but compared with Xiao Mingchen, there was a vast difference.<br/><br/>When Fang Jianbei came home, he acted like a lord, either lying on the sofa playing games or going straight into the study to work, refusing to lift a finger for household chores.<br/><br/>Each time Lan Qingqing complained, Fang Jianbei would say to her, “What would a man do with these chores? Aren’t they all supposed to be done by women?”<br/><br/>Over time, Lan Qingqing stopped complaining, but her resentment grew deeper and deeper, and she felt wronged with each passing day.<br/><br/>Especially during holidays when they returned to her in-law’s home, she had to prepare meals for a big family and put up with her in-laws’ criticisms. Every time they spoke, they made snide remarks and hinted that their son, a college graduate with a high salary, was far better than a twice-divorced woman like her.<br/><br/>As a result, every time she returned to her in-laws’ home, she was filled with resentment.<br/><br/>Comparisons are often painful.<br/><br/>Having been married before, but to in-laws who treated her as their own daughter and spoke to her kindly without ever finding fault, she was always praised no matter what she did.<br/><br/>But now…<br/><br/>Fortunately, Fang Jianbei really liked her back then.<br/><br/>Seeing that his parents were disrupting her, just for the sake of appeasing her, when they returned to the city, he would cheer her up and give her money, allowing her to swipe her card and buy whatever she wanted.<br/><br/>Even for all that money, Lan Qingqing wouldn’t think about divorcing.<br/><br/>She just held herself back whenever she was about to ask Fang Jianbei for money, sometimes just a few thousand, sometimes over a 100,000.<br/><br/>For her, Fang Jianbei was rich, and she was his wife. So, all his money was meant to be spent by her.<br/><br/>Who would have thought that it would lead to a divorce over the purchase of a house?<br/><br/>At the time, when Fang Jianbei mentioned buying a bigger house, she was delighted.<br/><br/>After buying a larger house, she could bring her parents and younger brother to live with them.<br/><br/>But they ended up clashing over the money.<br/><br/>In her opinion, Fang Jianbei was definitely expected to pay for the house. After all, he was the man and providing for the family was a man’s fundamental responsibility.<br/><br/>But he had his eye on her money, saying it was marital joint property and asking her to contribute a small portion so that they didn’t need to take out a loan.<br/><br/>How could that be possible?<br/><br/>She had already given her money to her parents as a token of respect, and there was no way she could ask for it back.<br/><br/>As such, she was of course unwilling, and persuaded him to borrow from his parents. Who knew that this suggestion would provoke a hornet’s nest and lead to a fierce quarrel between the couple?<br/><br/>Eventually, their arguing caused their mutual affection to dissolve away.<br/><br/>The pair ended up getting a divorce.<br/><br/>Fang Jianbei didn’t ask for the return of the betrothal gift of 500,000 he had given, but she didn’t get a single cent of his assets.<br/><br/>Having married and divorced three times, taking hefty betrothal gifts each time, and being a natural manipulator, her situation somehow became widely known. In the following three or four years, she went on countless blind dates, where either she didn’t like the man or the man liked her looks and was willing to offer a high betrothal fee but on the condition of severing all ties with her maiden family, essentially buying out the rest of her life.<br/><br/>Even if she was willing, her maiden family wasn’t.<br/><br/>After all, they knew the value of Lan Qingqing after marriage was much greater than before marriage.<br/><br/>Just as she was unsure whether to continue going on blind dates, she incidentally heard from a former colleague about Xiao Mingchen’s situation.<br/><br/>Her colleague mentioned that Xiao Mingchen’s family was now making a dividend of 100 to 200 million each year, and his salary had gone from 4,000 at a small company to an annual salary of two million.<br/><br/>Upon hearing this, she decided to reach out to him.<br/><br/>She believed that Xiao Mingchen must still have feelings for her, and as long as she could say a few nice things and promise to respect his parents in the future, he would be willing to reconcile.<br/><br/>It was only after she arrived in Xiao Family Village that she found out Xiao Mingchen had gotten married a few years ago.\t\t\t\t\t\t</div>", "images": {}, "success": true}