{"id": 295, "url": "https://www.novelhall.com/the-lucky-star-blessing-the-whole-village-32483/15193387.html", "title": "Chapter 295 - Chapter 295: Chapter 295:", "volume": 3, "volume_title": "Volume 3", "body": "<h1>Chapter 295 - Chapter 295: Chapter 295:</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 295: Chapter 295:<br/><br/>Translator: 549690339<br/><br/>“Slap, slap”!<br/><br/>Everyone turned to look, and it was Xiao Jinli who was clapping.<br/><br/>Previously, when Lan Qingqing had come to make a fuss, Xiao Jinli had not shown her face.<br/><br/>Lan Qingqing had never seen the real grown-up appearance of Xiao Jinli.<br/><br/>“Who are you?” Lan Qingqing asked with an ashen face.<br/><br/>But the more she looked at Xiao Jinli, the more familiar she seemed. Suddenly, she exclaimed incredulously, “You are… you are Xiao Jinli?”<br/><br/>Xiao Jinli smiled and said, “Oh, Second Sister-in-law, or rather, ex-Second Sister-in-law, it’s quite an honor to be remembered by you.”<br/><br/>Lan Qingqing was momentarily embarrassed, but then she had an idea and said with a hint of bitterness and grievance, “Jinli, I think about you every day.”<br/><br/>During the two years she had been married to Xiao Mingchen, she had deeply understood Xiao Jinli’s status in the Xiao Family and Xiao Family Village whenever they returned for the New Year.<br/><br/>It could be said that Xiao Jinli’s status in Xiao Family Village was exceptional.<br/><br/>Therefore, as long as she asked Xiao Jinli to let her remarry Xiao Mingchen, he would certainly agree.<br/><br/>“Sister, you’ve grown more and more beautiful after all these years,” Lan Qingqing said with a warm smile, “Girls really do change, always becoming more beautiful!”<br/><br/>Xiao Jinli gave a faint smile, “I wouldn’t dare to be called sister. Just call me Xiao Jinli, Ms. Lan!”<br/><br/>Upon hearing Xiao Jinli’s address, Lan Qingqing’s face changed again, and she said with a sad expression, “Sis… Little Sister Jinli, how can you call me Ms. Lan? I’m your Second Sister-in-law.”<br/><br/>Xiao Jinli said flatly, “I’m sorry, but my second sister-in-law is Ms. Guan Yunrou. You’re just a stranger to us now.”<br/><br/>Lan Qingqing,How could this be?<br/><br/>Lan Qingqing said, “Little Sister Jinli, have you forgotten? Your Second Sister-in-law used to really care for you. Every time I came home, I would bring gifts for you, remember?”<br/><br/>Xiao Jinli nodded, “Yes, you used to bring gifts, using my Second Brother’s money to buy them for us. My current Second Sister-in-law buys gifts for me every day, using her own hard-earned money.”<br/><br/>Everyone,  That was quite a slap in the face.<br/><br/>Without comparison, there would be no harm, right?<br/><br/>Boasting about buying gifts in the past, hmm, someone else did it better than you. Moreover, it was not even her own hard-earned money that she had used to buy those gifts.<br/><br/>Lan Qingqing’s expression suddenly became awkward.<br/><br/>In the past, she had disliked Xiao Jinli.<br/><br/>She believed that Xiao Jinli had stolen everyone’s love and was even more unhappy that her husband talked about his cousin Xiao Jinli all day long.<br/><br/>He was unwilling to spend money on gifts for her biological sister, which made her very upset with her sister-in-law Xiao Jinli.<br/><br/>But what made her even more upset was that everyone liked Xiao Jinli. Even her parents-in-law, who claimed to treat her like a biological daughter, were polite to her but showed deep love for Xiao Jinli in their eyes. This made her even more dissatisfied.<br/><br/>However, despite her dissatisfaction, she dared not vent it out.<br/><br/>In the Xiao Family, she could be dissatisfied with anyone, but not with Xiao Jinli. So, this dissatisfaction could only be hidden in her heart.<br/><br/>It wasn’t until the divorce that it all erupted.<br/><br/>Little did she expect that after all these years, she would have to beg Xiao Jinli for help.<br/><br/>If she had known this would happen, she would have treated Xiao Jinli like a princess.<br/><br/>Thinking of this, Lan Qingqing took a deep breath and then said with a smile, “Jinli, I really considered you as a close sister in the past, don’t you remember?”<br/><br/>Xiao Jinli nodded, “Yes, you treated me like a sister, but you also complained that your parents-in-law’s family shouldn’t spoil me so much. You even said that I shouldn’t have the best things. Isn’t that right, ex-second sister-in-law?”<br/><br/>Lan Qingqing’s face turned green again.<br/><br/>She didn’t expect that Xiao Jinli would know about her grumbling behind her back.<br/><br/>Unable to accept it, Lan Qingqing said, “I was only talking, after all. Did I still not care for you properly? Little Sister Jinli, I know you’re a magnanimous person. You shouldn’t mind such trifles, right?”<br/><br/>Xiao Jinli shook her head, “Yes, since it’s such a trivial matter, you shouldn’t even mention caring for me.” What a disgrace.<br/><br/>Lan Qingqing,<br/><br/>Onlookers burst into laughter.<br/><br/>The slap was so loud, everyone couldn’t help but revel in Lan Qingqing’s misfortune.<br/><br/>“Lan Qingqing, have you no shame? Since you divorced Deputy General Xiao, and he’s remarried, you should stay far away instead of causing endless trouble.”<br/><br/>“That’s right. I heard that when you divorced Deputy General Xiao, not only did he leave with nothing, but he also gave you all his savings. You took the over a million from him and left without looking back. Now you have the nerve to come back and ask for a reconciliation; this is truly bizarre.”<br/><br/>“Don’t even mention that Deputy General Xiao has remarried. Even if he hadn’t, anyone with a brain wouldn’t consider remarrying you. What if your relationship doesn’t work out again, and you divorce? Would he have to pay everything he owns as compensation again?”<br/><br/>“Marrying three times, receiving high betrothal gifts each time – besides the second husband, who was from their County town and heard about her spoiled little brother, so he divorced her and returned the gifts – but she didn’t return the gifts from the other two marriages. Deputy General Xiao even compensated her with over a million. The third husband didn’t compensate her as such, but a lot of his earnings were moved back to her maiden family. In total, they also had over a million.”<br/><br/>“My God, the money from both husbands adds up to three or four million. That family owes their fortune to their daughter. Ha, it’s good to have a daughter. Marrying once makes a small fortune, while marrying twice brings a big fortune.”<br/><br/>“Haha, indeed.”<br/><br/>Lan Qingqing’s three marriages and divorces had long ruined her reputation in their county town.<br/><br/>Her workplace, as well as Xiao Family Village, had heard of her notoriety.<br/><br/>At first, Lan Qingqing might have felt embarrassed when people talked about her.<br/><br/>However, over the years, she had become shameless to the point of no return.<br/><br/>No matter what others said about her, now she only wanted to remarry Xiao Mingchen.<br/><br/>Going through all the twists and turns, marrying Xiao Mingchen had been the happiest time of her life. Her husband had doted on her, her in-laws had loved her, and they didn’t care about her expenses.<br/><br/>After wasting several years, she wanted a stable life.<br/><br/>With tears in her eyes, Lan Qingqing pleaded, “Mingchen, Jinli, I know you resent me for helping my maiden family. I promise I won’t interfere with my family or bother my younger brother anymore. I know I was wrong. Please forgive me. I’ll bring all my earnings into our small family, and we can live our own life, okay?”<br/><br/>Xiao Mingchen’s face turned so black that it could drip ink.<br/><br/>He angrily said, “Lan Qingqing, let me say it one more time, it’s been eight hundred years since we divorced, and I’m already remarried. So whether or not you care about your family or brother, it has nothing to do with me. It’s absolutely impossible for us to remarry. If you still have some shame, stop bothering me in the future.”\t\t\t\t\t\t</div>", "images": {}, "success": true}