{"id": 299, "url": "https://www.novelhall.com/the-lucky-star-blessing-the-whole-village-32483/15193391.html", "title": "Chapter 299 - Chapter 299: Chapter 299:", "volume": 3, "volume_title": "Volume 3", "body": "<h1>Chapter 299 - Chapter 299: Chapter 299:</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 299: Chapter 299:<br/><br/>Translator: 549690339<br/><br/>Xu Guochang came to Xiao Family Village and saw Xiao Jinli sitting in the yard, looking a bit embarrassed.<br/><br/>Xiao Jinli asked with a half-smiling expression, “Uncle Xu, you seem to be very interested in my affairs?”<br/><br/>Xu Guochang awkwardly smiled and said, “Jinli, I’m just too curious about you.”<br/><br/>He had dared not ask about Xiao Jinli’s mysterious identity before.<br/><br/>Now that he suddenly knew who she was, he was truly curious.<br/><br/>What kind of village, what kind of family could raise such a powerful child?<br/><br/>Although he didn’t learn more about Xiao Jinli from the villagers, he could see from their attitudes and the children that Xiao Jinli had an unusual status in Xiao Family Village. When they mentioned her, their eyes were full of respect and admiration.<br/><br/>They said that Xiao Family Village’s current prosperity was due to Xiao Jinli.<br/><br/>Eight years ago, Xiao Jinli proposed to grow vegetables. When the vegetables were graded and returned as AA-level Green Food, they immediately became in high demand upon entering the market. The villagers couldn’t keep up with the production.<br/><br/>Eight years ago, it was also Xiao Jinli who proposed to set up a company, with the whole village contributing land shares, so that everyone could get dividends.<br/><br/>At that time, there were daughters-in-law who didn’t want to contribute their land and demanded a divorce. Later, they regretted their decision because their families had to compromise and only contribute half of their land as shares. As a result, while others could get one million in dividends, their families only got five hundred thousand.<br/><br/>Even if they contributed the other half of their land later, the dividends are much less than if they contributed initially. They could have had one million in dividends, but they only got seven to eight hundred thousand in the end, losing more than two hundred thousand.<br/><br/>Later, these new daughters-in-law finally understood why the villagers trusted Xiao Jinli so much.<br/><br/>Because in Xiao Family Village, following Xiao Jinli would never lead them astray.<br/><br/>Xu Guochang told Xiao Jinli what he had learned from the villagers and then laughed, “Jinli, I didn’t expect you to be like a god in everyone’s eyes.”<br/><br/>At this point, he paused and said seriously, “Actually, in my eyes, you are also a godlike existence.”<br/><br/>When the Divine Wind Technology Group was founded, she provided the funds, the key technology, and made connections with important resources.<br/><br/>At that time, he was very curious.<br/><br/>This was still a child.<br/><br/>Even the Wealthiest Person’s daughter wouldn’t have such great capabilities.<br/><br/>A Wealthiest Person’s daughter might have money and connections, but they definitely couldn’t have technology.<br/><br/>If a Wealthiest Person’s daughter had such technology, the Wealthiest Person would invest in such a technology company themselves and possibly become a world-leading technology giant.<br/><br/>Moreover, Dragon State’s Wealthiest Person was a young man, so he couldn’t possibly have such an accomplished older daughter.<br/><br/>In short, Xiao Jinli brought with her a great sense of mystery.<br/><br/>But upon arriving at Xiao Family Village, he realized that this girl named Xiao Jinli was an even greater child.<br/><br/>She led Xiao Family Village towards prosperity and protected every villager.<br/><br/>Xu Guochang looked at her and exclaimed, “If I hadn’t seen it with my own eyes, I would never have imagined that a child of your age could achieve such amazing feats. If the outside world knew that the person behind Divine Wind Technology Group is a young girl not even twenty years old, I don’t know how shocked they would be!”\t\t\t\t\t\t</div>", "images": {}, "success": true}