{"id": 298, "url": "https://www.novelhall.com/the-lucky-star-blessing-the-whole-village-32483/15193390.html", "title": "Chapter 298 - Chapter 298: Chapter 298:", "volume": 3, "volume_title": "Volume 3", "body": "<h1>Chapter 298 - Chapter 298: Chapter 298:</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 298: Chapter 298:<br/><br/>Translator: 549690339<br/><br/>Lan Qingqing’s troublemaking was just a small episode.<br/><br/>Xiao Family Village has now become a tourist manor, with many tourists coming and going every day.<br/><br/>With more people, naturally, some things will happen, such as conflicts between tourists, dissatisfaction with certain services provided by the people of Xiao Family Village, and so on.<br/><br/>Most of the issues had professionals intervening, or at most, it escalated to the company’s senior management. There were very few cases in which Xiao Jinli had to step in to handle them.<br/><br/>Xiao Jinli was very protective of Xiao Family Village’s interest and that of the villagers.<br/><br/>Of course, all the villagers were quite self-conscious.<br/><br/>They have money now, but they won’t forget where their wealth came from.<br/><br/>Before, calling Xiao Jinli the village treasure and lucky star was indeed not wrong, seeing as how she led the whole Xiao Family Village on the path to prosperity.<br/><br/>With the affluence of Xiao Family Village, even the surrounding villages, the entire town, and the county were growing prosperous as well.<br/><br/>To be aware, for many local economies, traffic flow is the economy.<br/><br/>Only where there is traffic can there be economic consumption, which then drives development.<br/><br/>Ever since Xu Guochang found out that Xiao Jinli came from Xiao Family Village, he couldn’t help but inquire about Jinli from the villagers.<br/><br/>Then he discovered that Xiao Family Village’s prosperity and development today were indeed inseparable from Jinli.<br/><br/>Because it was Xiao Jinli who suggested growing vegetables and starting a company in Xiao Family Village. Later, the whole village transformed into a manor, and it was Jinli along with talented individuals who developed it.<br/><br/>The villagers enjoyed talking about Jinli, but they would only share her stories with familiar people. If it’s someone unfamiliar, they would remain vigilant and cautious.<br/><br/>These days, Jinli has grown into a graceful and stunning beauty, and she must not be targeted by some ill-intentioned individuals.<br/><br/>“Who are you?” Xiao Chunmin asked cautiously.<br/><br/>Xu Guochang smiled and said, “I’m Miss Xiao’s friend.”<br/><br/>Xiao Chunmin didn’t buy it and replied, “If you’re Jinli’s friend, why are you asking us about her? Why don’t you ask Jinli herself?”<br/><br/>Having said that, he realized something and added, “You don’t have some ulterior motive, do you? I’m warning you, our Jinli is highly capable, and you wouldn’t want to suffer the consequences.”<br/><br/>Xu Guochang,  Did he look like a bad guy?<br/><br/>Xu Guochang smiled and said, “No, I’m not a bad guy. I do know Miss Xiao, but I didn’t know she was from Xiao Family Village. I just want to know more about her.”<br/><br/>Xiao Chunmin waved his hand, “Don’t try to make it sound better. That’s what every bad guy says.”<br/><br/>Xu Guochang,<br/><br/>If he couldn’t get information from the adults, he would turn his attention to the children.<br/><br/>He genuinely wasn’t up to no good, he was just really curious about Xiao Jinli.<br/><br/>Unexpectedly, perhaps due to the instructions from the adults, he couldn’t get information from the kids either.<br/><br/>“Why do you want to know about Sister Jin Li? Are you truly her friend?”<br/><br/>“Our parents told us not to talk about Sister Jin Li’s business to outsiders. Even if you offer candy and toys, it won’t work. Our family lacks none of these; we have heaps of them at home.”<br/><br/>Xu Guochang, He couldn’t help but admire how well-behaved and sensible the children were.<br/><br/>At that moment, his phone rang, and he looked a little embarrassed when he saw the caller ID.<br/><br/>Because, the caller was Xiao Jinli herself.<br/><br/>As soon as the call connected, Xiao Jinli teased with a laugh, “Uncle Xu, I heard you’ve been inquiring about me everywhere?”\t\t\t\t\t\t</div>", "images": {}, "success": true}