{"id": 293, "url": "https://www.novelhall.com/the-lucky-star-blessing-the-whole-village-32483/15193385.html", "title": "Chapter 293 - Chapter 293: Chapter 293: (First Update)", "volume": 3, "volume_title": "Volume 3", "body": "<h1>Chapter 293 - Chapter 293: Chapter 293: (First Update)</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 293: Chapter 293: (First Update)<br/><br/>Translator: 549690339<br/><br/>Lan Qingqing’s third husband couldn’t figure out where the money he gave her went, so he thought about it and called Xiao Mingchen.<br/><br/>As for Xiao Mingchen’s personality, he didn’t believe Xiao Mingchen really had other women and divorced Lan Qingqing for that reason.<br/><br/>After all, before the end of the year, Xiao Mingchen was still pampering Lan Qingqing and happily returned to their hometown. It made no sense for him to find another woman so soon after going home.<br/><br/>Of course, Xiao Mingchen was not the type to speak ill of Lan Qingqing. Since she married his former superior leader, he naturally had nothing to say.<br/><br/>So, he didn’t tell his former colleagues and leaders the real reason for their divorce.<br/><br/>But when his superior leader called him and asked about Lan Qingqing’s previous expenses, he thought about it and said, “I spent 266,000 on betrothal gifts to marry Lan Qingqing. Then, during the two years of our marriage, she sent her salary back to her maiden family, and I was responsible for all living expenses and other various costs. The main reason I divorced her was that she disrespected my parents in order to help her own family and even planned to involve my parents. My parents treated her like their biological daughter, but she took them so lightly and was so unfilial to them. This was something I could not tolerate.”<br/><br/>At this point, he paused and continued, “When I divorced her, I left with nothing and even compensated her with my parents’ lifelong savings.”<br/><br/>The leader was very surprised when he heard this.<br/><br/>“You left with nothing, and even your parents’ savings were lost. Xiao Mingchen, you suffered a lot in this. How much money was that?”<br/><br/>“Over a million,” Xiao Mingchen said. “I didn’t want to argue with her for too long. Money is an external possession. Giving her the money made the divorce go smoothly.”<br/><br/>The leader,<br/><br/>Such a generous ex-husband and mother-in-law’s family made him speechless.<br/><br/>Sometimes, he had to wonder if Xiao Mingchen’s head had been caught in a door or if he still had lingering feelings for his ex-wife and didn’t want to wrong her, so he gave all the money to Lan Qingqing.<br/><br/>The leader sighed lightly and asked, “Was it worth it?”<br/><br/>Over a million is not a small sum, especially for rural people, it’s a huge amount.<br/><br/>Xiao Mingchen’s magnanimity was truly impressive, even the leader couldn’t help admiring him.<br/><br/>Xiao Mingchen laughed and said, “There’s nothing worth or not worth it. As for her, I did my best to be fair. It was just that my parents were treated unfairly. However, our family situation is much better now. Our village has established a company through land shares, and the annual dividends are not small.”<br/><br/>After hanging up the call with Xiao Mingchen, the leader thought about it and decided to give Lan Qingqing another chance.<br/><br/>He asked Lan Qingqing, “Qingqing, why did you and Xiao Mingchen divorce in the first place? Was it really because Xiao Mingchen had another woman?”<br/><br/>Seeing her husband’s doubtful attitude, Lan Qingqing’s expression stiffened for a moment and then said, “Of course. Otherwise, why would I divorce him? He left the marriage so cleanly, isn’t it because he felt guilty for having an affair first?”<br/><br/>The leader narrowed his eyes, seriously examining his wife.<br/><br/>He never thought that his beautiful wife could lie so easily, her face not turning red, and her heart not skipping a beat.<br/><br/>But didn’t she ever think that since they were both working in the same company when they were husband and wife, Xiao Mingchen had good relationships with his colleagues, as well as his superiors. Finding out about Xiao Mingchen’s affairs was easy?<br/><br/>How could she deceive herself like that?<br/><br/>The leader nodded, “So that’s how it is!”<br/><br/>After thinking for a while, he suddenly said, “Wife, let’s change the house. This house is too small. When we have a child in the future and have our parents live with us, there won’t be enough rooms. Let’s change to a four or five-bedroom house.”<br/><br/>Lan Qingqing’s eyes sparkled, and she said happily, “That’s great. I think we should change to a bigger house too. So, husband, let’s go house hunting tomorrow?”<br/><br/>The leader frowned slightly and said, “But the prices of big houses are very high, and the down payment will have to be at least three or four million. I only have a little over two million in savings, so I’m still short.”<br/><br/>As he said this, he stared very seriously at Lan Qingqing.<br/><br/>He knew that Lan Qingqing had more than a million in her hands.<br/><br/>If she was truly committed to being with him, and the house was their property acquired after marriage and was shared property, she should be willing to contribute the money.<br/><br/>Lan Qingqing frowned and then said, “Husband, why don’t you try borrowing the money? With your annual salary of over a million, borrowing a million or so should be easy.”<br/><br/>After hearing her, the leader was slightly disappointed.<br/><br/>He nodded and said, “It’s not difficult for me to borrow that million or so. But after borrowing it to buy a house, we will have to repay the mortgage and the million, as well as raising children and taking care of the elderly’s medical expenses in the future. These all need money, and we will have a lot of pressure in the future.”<br/><br/>Lan Qingqing thought for a moment and then said, “Husband, how about you borrow some from your parents first?”<br/><br/>“My parents are from the countryside, where would they have so much money to lend me?” The leader’s face darkened slightly, and hearing the idea of borrowing money from his parents made a bit of anger rise in him. He continued, “Besides, that is my parents’ retirement money. I absolutely cannot touch it.”<br/><br/>After hearing this, Lan Qingqing complained, “What retirement money? I think it’s saved to subsidize your sister, right? Hmph, they only favor your sister.”<br/><br/>“Favoring my sister?” The leader suppressed a tinge of anger, and he raised his voice, “If it wasn’t for my sister giving me the opportunity to study? If it wasn’t for my sister going out to work and giving me the money she earned to pay for my education, there would be no me today.<br/><br/>My parents feel guilty towards my sister, and they occasionally help my sister. In your eyes, that turns into favoring my sister and leaving all the money to her? Lan Qingqing, I didn’t know you actually thought this way about my parents?”<br/><br/>Xiao Mingchen said that Lan Qingqing only knew how to respect her own parents, and she had no heart for her husband’s parents.<br/><br/>In the past, he always heard her send so much money to her parents and buy them so many things to send back, thinking that she was a filial girl.<br/><br/>But it’s true, she was filial, just only to her own parents.<br/><br/>Lan Qingqing was silenced by his words, and her face turned from white to pale. Then she defended herself, “Husband, it’s not like that. When I went back to your hometown with you those few times, I saw you give money to your parents. But in the blink of an eye, they gave it to your sister. And there were two times when they called and asked us for money. Once, they said your sister’s home needed to build a house and was short on money. Another time, they said your brother-in-law got sick and needed some money. So every time your sister asked you for money, I thought your parents were favoring your sister?”<br/><br/>“Your parents, your parents?” The leader said with a dark face, “Are my parents in my mouth just my parents and not your parents?”<br/><br/>Lan Qingqing,<br/><br/>What’s wrong with this man today? He keeps picking on her mistakes.\t\t\t\t\t\t</div>", "images": {}, "success": true}