{"id": 292, "url": "https://www.novelhall.com/the-lucky-star-blessing-the-whole-village-32483/15193384.html", "title": "Chapter 292 - Chapter 292: Chapter 292: (Second Update)", "volume": 3, "volume_title": "Volume 3", "body": "<h1>Chapter 292 - Chapter 292: Chapter 292: (Second Update)</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 292: Chapter 292: (Second Update)<br/><br/>Translator: 549690339<br/><br/>Xiao’s mother did not entertain Xu Guochang’s family of three for very long, as there were many things to attend to in the cafeteria.<br/><br/>When Xiao’s mother left, Xu Mengmeng expressed her admiration, “Miss Xiao,”<br/><br/>Xiao Jinli said, “If Mengmeng doesn’t mind, you can call me sister. Always calling me Miss Xiao feels a bit awkward. And Mr. Xu and Madam Xu, you can call me Little Xiao or Jinli.”<br/><br/>“Pfft!” Mother Xu laughed, “Well then, Jinli, don’t call us Mr. Xu and Madam Xu either, call him Uncle Xu and me Auntie.”<br/><br/>They spent quite some time discussing their appellations.<br/><br/>Although she didn’t know the nature of her husband’s relationship with Xiao Jinli, she could see that her husband treated Xiao Jinli with great respect, which made it clear that her status was not simple.<br/><br/>Xiao Jinli smiled and said, “Then I won’t be polite. Uncle Xu, Aunt Xu.”<br/><br/>“Bad news, bad news, Mommy!”<br/><br/>Jiang Yifan rushed in hastily.<br/><br/>Xiao Jinli spoke exasperatedly, “Jiang Yifan, I’m fine. What’s the rush?”<br/><br/>Jiang Yifan anxiously said, “Mommy, that woman is back.”<br/><br/>Xiao Jinli didn’t immediately understand and asked, “Which woman?”<br/><br/>“The one who claims to be Second Uncle’s wife!” Jiang Yifan said.<br/><br/>“Where is she now?” Xiao Jinli asked with a slightly serious expression.<br/><br/>Jiang Yifan said, “She is harassing Second Uncle and Second Aunt at the company! But that woman is too difficult to deal with, they can’t escape from her!”<br/><br/>Xiao Jinli stood up and said to Xu Guochang’s family of three, “I’m sorry, Uncle Xu and Aunt Xu, I have to go take care of some business.”<br/><br/>Xu Guochang also stood up and said, “It’s okay, Jinli. You can go handle your business first. Coincidentally, we also need to go back to the hotel to rest for a while.”<br/><br/>These days, he was always around and could find Xiao Jinli anytime.<br/><br/>Xiao Jinli left hurriedly for the company with Jiang Yifan.<br/><br/>Lan Qingqing was blocking Xiao Mingchen, crying and saying, “Husband, I still love you. Let’s remarry, okay?”<br/><br/>Xiao Mingchen shook off Lan Qingqing, his face dark and his expression stern. “Lan Qingqing, I am not your husband now. Don’t call me that. No matter how many times you ask, I will never remarry you.”<br/><br/>Although Lan Qingqing was wearing all branded clothes, they were all old, and even with her makeup, she looked haggard.<br/><br/>Seeing Xiao Mingchen’s oily face, her anger immediately shifted to his current wife, Guan Yunrou.<br/><br/>She pointed at Guan Yunrou and shouted, “You shameless woman! You won’t divorce him and steal my husband. Let me tell you, my husband and I were in love, and you, the mistress, should get lost!”<br/><br/>Xiao Mingchen’s face turned pale with anger. Just as he was about to defend his wife, Guan Yunrou pulled him aside and yelled at Lan Qingqing,<br/><br/>“Lan Qingqing, by the time I married my husband, you had already been divorced from Xiao Mingchen for three years. Xiao Mingchen is hardly your husband, he is, at best, your ex-husband. You call me a mistress, but now, you are the one trying to intrude upon our relationship.”<br/><br/>Lan Qingqing’s face was flushed with anger, “I’ve only been divorced for three years. If you hadn’t interfered, we would definitely be able to remarry.”<br/><br/>Guan Yunrou couldn’t help but laugh.<br/><br/>She sneered and said sarcastically, “Lan Qingqing, have some shame. When Xiao Mingchen loved you, you worked hard for your maiden family and gave all the money you earned as a couple to them. You were unfilial to your parents-in-law, and during the divorce, you even cleaned out your ex-husband’s entire savings. You took every last cent. Now, what face do you have to talk about remarrying?”<br/><br/>Glancing disdainfully at Lan Qingqing, she continued, “I heard that within a year of your divorce from Xiao Mingchen, you got remarried. What, did your new husband not let you help out your maiden family so you divorced? Or is it that your two marriages after Xiao Mingchen didn’t have a sucker like him willing to support your maiden family, so you want to find him again to be that sucker? Especially since you heard that Xiao Mingchen earns millions of dollars in dividends each year, not to mention the salaries of his family members, which would amount to more than what they earned working several years before. So, you regretted it?”<br/><br/>Lan Qingqing’s face turned red and white as Guan Yunrou rubbed her face in it.<br/><br/>What Guan Yunrou said was true.<br/><br/>Three months after her divorce from Xiao Mingchen, she was persuaded by her maiden family to marry a wealthy man in their county town.<br/><br/>That family didn’t mind her being divorced since they valued her high level of education and good job. They believed their children would also love learning in the future.<br/><br/>But they never expected that the woman they married would turn out to be a bottomless pit of financial support for her maiden family.<br/><br/>At their wedding, they gave Lan Qingqing 300,000 in betrothal gifts.<br/><br/>Not a cent of those gifts was brought back, and all of Lan Qingqing’s salary was given to her maiden family. The husband’s family had to bear the entire burden of living expenses, as well as the cost of their younger brother’s wedding and buying a house and car.<br/><br/>This wasn’t a wife they married, it was a bottomless pit.<br/><br/>The husband’s side couldn’t take it anymore.<br/><br/>So they divorced Lan Qingqing.<br/><br/>This time, not only did they want Lan Qingqing to return the betrothal gifts, but they also demanded that she bear the cost of various expenses, such as the wedding banquet and taking wedding photos. Otherwise, they would ruin her reputation, making it impossible for her to remarry in the future.<br/><br/>Lan Qingqing’s family, who hoped that she would remarry into a good family and support her younger brother, wouldn’t let her reputation be ruined. So, with the excuse of incompatible personalities, they divorced, returned the betrothal gifts, and covered the other expenses.<br/><br/>Lan Qingqing’s third marriage was to a small leader at her company.<br/><br/>Back when Lan Qingqing was with Xiao Mingchen, she was spoiled and lenient with herself, and willing to dress up. This made her look youthful and beautiful, attracting many male colleagues at her company.<br/><br/>When Lan Qingqing returned to work at her company, she told everyone that Xiao Mingchen had another woman and that they were divorced.<br/><br/>The male colleagues who had a crush on her naturally took action.<br/><br/>Lan Qingqing chose a leader who was considered excellent. Although he wasn’t as good-looking as Xiao Mingchen, his high position and salary were undeniable advantages!<br/><br/>So, Lan Qingqing hid her second marriage and began her third one!<br/><br/>But the leopard cannot change its spots!<br/><br/>After getting married, Lan Qingqing sent her entire salary to her maiden family and asked her husband for living expenses!<br/><br/>At first, her husband really loved his wife and didn’t care whether she contributed to their finances since his own salary was enough to support the family.<br/><br/>But as she kept asking for living expenses, the amounts kept getting higher and higher – from the first time’s 5,000 to 10,000 and 80,000 a time. He became suspicious!<br/><br/>His annual salary was only a little over a million, so this would quickly drain his millions!-<br/><br/>When he asked her where the money was spent, she stammered and didn’t answer!\t\t\t\t\t\t</div>", "images": {}, "success": true}