{"id": 290, "url": "https://www.novelhall.com/the-lucky-star-blessing-the-whole-village-32483/15193382.html", "title": "Chapter 290 - Chapter 290: Chapter 290: (Second Update)", "volume": 3, "volume_title": "Volume 3", "body": "<h1>Chapter 290 - Chapter 290: Chapter 290: (Second Update)</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 290: Chapter 290: (Second Update)<br/><br/>Translator: 549690339<br/><br/>Later, Xu Guochang was brought before Xiao Jinli by the men in black.<br/><br/>Seeing the girl in front of him, Xu Guochang asked incredulously, “Miss, are you the one looking for me?”<br/><br/>At that time, Xiao Jinli was only sixteen years old.<br/><br/>Listening to the men in black addressing the boss, Xu Guochang subconsciously thought that the boss was a fat middle-aged man.<br/><br/>After all, it is mostly men of this age group who have achieved success in their careers.<br/><br/>Xiao Jinli nodded and said, “Yes, I’m looking for you.”<br/><br/>She had a dossier in her hand and recited, “Xu Guochang, an ancestor from Fulin Province, twenty years ago…”<br/><br/>With every detail read by Xiao Jinli, Xu Guochang’s face became paler.<br/><br/>He felt as if, in front of this girl, even the color of his underpants was no secret.<br/><br/>After a while, Xu Guochang pretended to be calm and asked, “May I know why you are looking for me, miss?”<br/><br/>Xiao Jinli closed the dossier and said indifferently, “I know Mr. Xu is a talented and capable person. I have a question right now. When you had the ability and talent, why did you choose to stay in Meijian Country and not return home? But when you encountered career setbacks abroad, you returned to your home country. Do you think your home country should accept those who are rejected by Meijian Country?”<br/><br/>Upon hearing this, Xu Guochang’s face became even more unsightly.<br/><br/>Xu Guochang took a few deep breaths and said, “When I was studying years ago, our country’s technology was quite backward and was constantly suppressed by developed countries. At that time, I was determined to change our country’s technological status and make technology flourish. Therefore, when I was selected for a study abroad opportunity, I resolutely chose to go abroad.<br/><br/>But during my years of studying abroad, I found that I couldn’t learn the real core technology. All I learned were the outdated technologies that others had discarded.<br/><br/>I knew that even if I mastered these technologies and returned to my home country, I would not be able to truly change the country’s technological status. To change that and learn their country’s real core technology, I would have to join their research team. But to join their team, I would have to become a citizen of their country.”<br/><br/>As he spoke, Xu Guochang showed a face full of helplessness and heartache.<br/><br/>He continued, “So, I joined Meijian Country and became a traitor to my homeland.”<br/><br/>Xiao Jinli listened expressionlessly, tapping the table with one hand and saying coldly, “Continue.”<br/><br/>Xu Guochang said, “Even after becoming a citizen of Meijian Country and joining the research team, I was not trusted by the company because I came from Dragon State, a country with backward technology. At first, I could only engage in external research work.<br/><br/>I worked tirelessly day and night, and after ten years, I finally made it to the core circle. During this time, I met my lover Tao Tao, an overseas Chinese. We fell in love, got married, and had a daughter in Meijian Country. Everything seemed peaceful and happy.<br/><br/>But my determination to master core technology and serve my country never wavered. Once I entered the core team and confirmed that I had mastered the real core technology, I began to prepare for my return home, a preparation that took five years.<br/><br/>However, just a year ago, someone discovered my secret. The company then took a series of actions against me, first accusing me of leaking secrets and trying to imprison me. After my lover and her family’s mediation, I was released, but the company fired me on the grounds of leaking secrets and my career was ruined worldwide. They also blocked my way back home.”<br/><br/>Through the efforts of my lover’s family, I still managed to return to my homeland. Back home, my passion for serving my country slowly died out amid struggles to find a job. Now, my family of three is on the verge of being homeless. It’s a pity that I have all this talent but no place to showcase it.”<br/><br/>He showed a bitter smile on his face.<br/><br/>In twenty years, the dream of serving his country and revitalizing its technology had never wavered, no matter how hard or tired life in Meijian Country was. However, just one year after returning to his homeland, he felt a sense of nowhere to stretch his legs, the ridicule and mockery from people in the industry, and the pressure from life made it almost impossible for him to breathe. Sometimes, he wondered if he was doing the right thing?<br/><br/>For the so-called serving of the country and the revitalization of national technology, so as not to be looked down upon by foreigners, he had ended up in such a miserable state.<br/><br/>His predicament at home was even worse than in Meijian Country.<br/><br/>Since Xiao Jinli was able to investigate everything about Xu Guochang, she naturally knew his thoughts.<br/><br/>Xiao Jinli tapped the table with one hand and propped her chin with the other, expressionlessly sizing up Xu Guochang, making him feel uneasy.<br/><br/>Although the other party was just a young girl, her imposing manner was stronger than anyone he had met before.<br/><br/>He swallowed his saliva and took a deep breath before asking, “Miss, may I know what your intentions are in finding me?”<br/><br/>Xiao Jinli asked, “If given a chance, would you still be willing to uphold your previous intentions, serve your country, and promote the development of national technology?”<br/><br/>Xu Guochang’s eyes lit up and, without hesitation, he said excitedly, “Of course I am willing!”<br/><br/>Xiao Jinli nodded and said, “Well, not bad. Then, you can sign this agreement.”<br/><br/>Saying that, Xiao Jinli handed Xu Guochang an agreement to sign.<br/><br/>Xu Guochang took the agreement with curiosity and looked at it more and more excitedly. Then, he picked up the pen on the table, signed his name, and even stamped his fingerprint.<br/><br/>Xiao Jinli raised an eyebrow and asked, “Mr. Xu, won’t you consider it? You should know that this agreement is like a contract of sale for you. Once you breach any terms, the consequences will be your ruin.”<br/><br/>Xu Guochang shook his head and said, “There’s no need to consider! My passion for serving my country for over twenty years can finally be put into action. I don’t want to miss this opportunity.”<br/><br/>Upon hearing this, Xiao Jinli nodded and said, “In that case, please sign another contract, Mr. Xu.”<br/><br/>With that, she took out another contract.<br/><br/>Xu Guochang took a look and found out it was an employment contract.<br/><br/>Xu Guochang was very surprised and asked in astonishment, “Miss, what is this?”<br/><br/>Xiao Jinli smiled and said, “I plan to establish a technology company, but I need someone to represent the company externally, and you are the person I have chosen.<br/><br/>Sign this contract, and you will be employed by me. As my spokesperson, you have the authority to make decisions on everything except for major issues that need to be reported to me. Also, my identity must remain confidential; unless I allow it, you cannot disclose it!”<br/><br/>It meant being an invisible boss!<br/><br/>Xu Guochang was shocked and, after a while, he asked, “Miss, aren’t you afraid that I might take your company for myself in the future?”<br/><br/>“Hehe,” Xiao Jinli chuckled, “I don’t doubt those whom I choose to use, and I don’t use those I doubt! Besides, the fact that you can ask this question means you don’t have such intentions! Moreover,”<br/><br/>Xiao Jinli immediately turned serious and said, “I have the ability to investigate everything about you, so naturally, I am not afraid that you would take my company, am I right?”<br/><br/>Xu Guochang stared blankly at Xiao Jinli.\t\t\t\t\t\t</div>", "images": {}, "success": true}