{"id": 291, "url": "https://www.novelhall.com/the-lucky-star-blessing-the-whole-village-32483/15193383.html", "title": "Chapter 291 - Chapter 291: Chapter 291:", "volume": 3, "volume_title": "Volume 3", "body": "<h1>Chapter 291 - Chapter 291: Chapter 291:</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 291: Chapter 291:<br/><br/>Translator: 549690339<br/><br/>Xiao Jinli established the Divine Wind Technology Group and handed over several advanced technologies to Xu Guochang before letting him take care of the rest.<br/><br/>To the outside world, no one knew that there was a hidden boss behind the Divine Wind Technology Group.<br/><br/>In these three years, Xu Guochang had seen Xiao Jinli no more than the number of fingers on one hand.<br/><br/>However, Xu Guochang dared not harbor any ulterior motives.<br/><br/>Xu Guochang held the technologies given by Xiao Jinli, led the team, and devoted himself to research and development.<br/><br/>In just three years, the newly developed technologies emerged one after another, with many projects being developed alongside the country.<br/><br/>With the backing of the country, those outside, even if envious of the development of the Divine Wind Technology Group, dared not take any action.<br/><br/>The outsiders only knew that the Divine Wind Technology Group belonged to Xu Guochang.<br/><br/>Meanwhile, Xu Guochang’s experience abroad changed from being criticized for his immorality and spying in the industry to becoming a loyal and high-end figure who loved his country.<br/><br/>People believed that he stole secrets abroad solely to serve his motherland.<br/><br/>And now, it can be seen that the technology development in our country has made rapid progress these past three years.<br/><br/>This technological development not only refers to the commonly seen items in daily life such as the internet, cellphones, and computers, but also to the development of national defense technologies, including airplanes, rockets, aircraft carriers, and more. Of course, ordinary people did not know about these developments.<br/><br/>The current Divine Wind Technology Group has become a symbol of technological progress.<br/><br/>The founder, Xu Guochang, has become the idol of billions of people in Dragonzhou Country.<br/><br/>They believe that if given a few more years, our country’s technological development will definitely surpass the most advanced country abroad — Plum Firm Country.<br/><br/>Everyone credited Xu Guochang for the achievements.<br/><br/>But only Xu Guochang knew clearly in his heart that actually, it was all because of his mysterious boss.<br/><br/>What he didn’t expect was that taking a vacation and accompanying his wife and daughter on a trip, he would discover the identity of the mysterious boss.<br/><br/>Xu Guochang looked at the girl in front of him, as beautiful as a fairy, elegant and graceful, with a compelling aura, and stayed calm on the surface, but he was very excited inside.<br/><br/>Miss Xiao had become even more beautiful than she was three years ago, graceful and elegant, like a fairy who was untouched by the mundane world.<br/><br/>Xu Guochang took a few sips of water and smiled, “Miss Xiao, I didn’t know you were from Xiao Family Village. No wonder you’re so beautiful and have such good temperament. This must be nourishment from the local mountains and waters.”<br/><br/>Xiao Jinli nodded and said, “Yes, you’re right. Our village has beautiful mountains and waters, picturesque scenery, and pleasant air. It’s indeed very nourishing. So, many people want to come here to cultivate themselves.”<br/><br/>Mother Xu and her daughter,<br/><br/>Xu Guochang continued with a smile, “Indeed. However, I heard that now Xiao Family Village is very valuable, and even the rich and powerful find it difficult to buy residence rights here.”<br/><br/>Xiao Jinli said, “Xiao Family Village is only so big. If everyone were to settle here, there wouldn’t be enough space, right?”<br/><br/>“That’s true!” Xu Guochang nodded, “There are so many rich and powerful people in our country, and even some foreign billionaires who want to move in. How could they all fit?”<br/><br/>Xiao Jinli added, “We only allow domestic residents in our village, not foreigners. If a foreigner wants to settle here, they can only hold our nation’s citizenship. However, very few of them meet the criteria for living here. So far, not a single person has.”<br/><br/>Non-natives may have different intentions!<br/><br/>She didn’t deny that some foreigners claimed to be from their nation and loved Dragon Stateless country on the internet.<br/><br/>However, they also couldn’t deny that they definitely loved their own countries as well.<br/><br/>Xiao Jinli glanced at them and asked, “Mr. Xu, Mrs. Xu, would you like to live in Xiao Family Village?”<br/><br/>Mother Xu’s eyes brightened, and she excitedly asked, “Really? We can settle in Xiao Family Village?”<br/><br/>Xu Guochang and his daughter were equally excited.<br/><br/>Nowadays, who wouldn’t dream of living in Xiao Family Village?<br/><br/>Those who settled in Xiao Family Village could choose to work or not to work.<br/><br/>Xiao Jinli nodded, “If you’re willing, you can!”<br/><br/>“We are definitely willing!”<br/><br/>The three of them excitedly agreed in unison.<br/><br/>Xiao Jinli said, “I can introduce you to our Village Head later.”<br/><br/>“Thank you!”<br/><br/>All three of them expressed their gratitude at the same time.<br/><br/>Xu Mengmeng asked with curiosity, “Miss Xiao, why are you willing to help us?”<br/><br/>Xiao Jinli didn’t answer her but subtly glanced at Xu Guochang.<br/><br/>“Ahem…” Xu Guochang said, “Mengmeng, Miss Xiao and I are friends!”<br/><br/>Xu Mengmeng,<br/><br/>Are they friends? She felt like it wasn’t that simple.<br/><br/>She just didn’t know how to ask.<br/><br/>Upon hearing that Xiao Jinli had friends coming over, Xiao’s mother, who had been busy in the cafeteria, immediately rushed back.<br/><br/>“Xiao Bao, I heard from Fanfan that you have friends coming over?”<br/><br/>Xiao’s mother began asking questions even before entering the house. When she entered the yard, Xu Guochang’s family of three were amazed by her appearance.<br/><br/>Miss Xiao’s mother was really beautiful.<br/><br/>Although she looked older, it only added to her charm and allure.<br/><br/>Xiao Jinli said, “Mom, aren’t you busy in the cafeteria?”<br/><br/>Xiao’s mother smiled and said, “It’s rare that you have friends coming over. Of course, I have to come back and entertain your friends.”<br/><br/>She looked at the stone table, which only had tea on it, and laughed, “This child, you only serve tea to your guests. You didn’t even bring out any snacks!”<br/><br/>As she spoke, she headed inside.<br/><br/>Xu Guochang immediately said respectfully, “Mrs. Xiao, we just had a meal. Our stomachs are still full. There’s no need to bother.”<br/><br/>Xiao Mother smiled and said, “Eating a meal is one thing, and having snacks is another.”<br/><br/>After a while, she brought out some snacks from the house. Most of these snacks were made by Xiao’s mother herself.<br/><br/>When Xu Mengmeng saw these snacks, her eyes twinkled, and she peeled a roasted peanut.<br/><br/>“Wow, it smells so good. Mom, you should try it. This peanut is really fragrant.”<br/><br/>Mother Xu also tasted one and exclaimed, “It really is fragrant!”<br/><br/>Xiao’s mother laughed and said, “These snacks are all homemade; please help yourselves.”<br/><br/>Xiao Jinli asked, “Mom, has Jiang Yifan come to look for you?”<br/><br/>Xiao’s mother replied, “No, he was playing with Xiao Ming and happened to meet me. He told me that we had a guest at our house.”<br/><br/>In fact, Jiang Yifan came to complain to Xiao’s mom and told her that he was fed up with being exploited by mommy and had run away from home.<br/><br/>Xiao Mother sat down.<br/><br/>Xiao Jinli introduced her mother, “Mom, this is Mr. Xu Guochang, Mrs. Xu, and Miss Xu!”<br/><br/>Xu Guochang immediately said, “Mrs. Xiao, you can call me Little Xu or Guochang. My wife’s name is Taotao, you can call her Little Tao, and my daughter is named Mengmeng!”<br/><br/>No matter Xiao Mother’s age, since she was his boss’s mother, he had to show full respect to her.<br/><br/>Xiao Mother nodded and said, “Alright, if you don’t mind, I’ll call you Little Xu, Little Tao, and Mengmeng. Additionally, if you don’t mind, please call me sister-in-law.”\t\t\t\t\t\t</div>", "images": {}, "success": true}