{"id": 302, "url": "https://www.novelhall.com/the-lucky-star-blessing-the-whole-village-32483/15193394.html", "title": "Chapter 302 - Chapter 302: Chapter 302:", "volume": 4, "volume_title": "Volume 4", "body": "<h1>Chapter 302 - Chapter 302: Chapter 302:</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 302: Chapter 302:<br/><br/>Translator: 549690339<br/><br/>“Jiang Yifan,” Xiao Jinli saw Jiang Yifan covered in mud and angrily asked, “How many times have I told you, don’t go catch fish in the Mud Gully. You’re still too young, what if you step in and can’t get out?”<br/><br/>Jiang Yifan immediately sold out Xiao Xiaoming, saying, “Mommy, it was Bro Xiaoming who took me.”<br/><br/>Upon hearing this, Xiao Xiaoming quickly defended himself, “Sister Jin Li, I was watching from the side. Besides, that Mud Gully has a lot of tourists playing in it, and many tourists were also watching, so it won’t be dangerous. Don’t worry.”<br/><br/>Jiang Yifan nodded in agreement, “That’s right, that’s right. There were even many kids younger than me playing there, so what’s there to fear? Even tourists from far away places are not afraid, why should we be, when it’s our own land?”<br/><br/>Xiao Jinli coldly said, “Oh, well, it really makes sense.”<br/><br/>Jiang Yifan,  Why does it sound sarcastic, and moreover, it feels like Mom is about to unleash something big.<br/><br/>As expected, right after…<br/><br/>“Well then, you go to the Mud Gully and catch one hundred loaches for me,” Xiao Jinli said calmly, “Whenever you catch one hundred loaches, you can have your meal. Of course, if you want to eat the loaches instead, I don’t mind.”<br/><br/>Jiang Yifan was stunned, “What? There are not that many loaches in the Mud Gully!”<br/><br/>The Mud Gully was specifically set up for tourists to play in, so if there were any loaches, they would have been dug up by people long ago, not waiting for him to dig.<br/><br/>Xiao Xiaoming nodded, “Yeah, yeah, Sister Jin Li, there can’t be that many loaches in the Mud Gully. Aren’t you making it hard for Little Fanfan?”<br/><br/>“I haven’t even gotten to you yet. Xiao Xiaoming,” Xiao Jinli immediately aimed her anger at Xiao Xiaoming, “Jiang Yifan needs to catch one hundred loaches, and you, well, you need to catch two hundred since you are three to four times older than him. Two hundred loaches shouldn’t be too hard for you, right?”<br/><br/>Xiao Xiaoming immediately felt incredulous, “Sister Jinli, why should I be punished too?”<br/><br/>Two hundred loaches, that place, it’s hard to find even one.<br/><br/>Xiao Jinli raised her eyebrows, “Well, this isn’t a punishment, but sharing your fortune and difficulties together.”<br/><br/>Xiao Xiaoming and Jiang Yifan, Shouldn’t the two of them be catching one hundred loaches together? Why separate?<br/><br/>Xiao Jinli said, “Alright, get to work now. When you’ve caught all the loaches, come back to change clothes and eat.” Those two, trying to compete with me, still too green.<br/><br/>Xiao Xiaoming and Jiang Yifan looked at each other.<br/><br/>After a while, Xiao Xiaoming asked, “Little Fanfan, are you hungry?”<br/><br/>Jiang Yifan nodded, “Yeah, I’m hungry.”<br/><br/>It was precisely because he was hungry that he had come back.<br/><br/>Who would have thought, this cheap Mommy Xiao Jinli, would come up with such a punishment.<br/><br/>“Bro Xiaoming, are you hungry?” Jiang Yifan was still concerned about his brother who was sharing the same hardship.<br/><br/>Xiao Xiaoming nodded, “Yeah, I’m hungry.”<br/><br/>Jiang Yifan’s eyes turned and he said, “Bro Xiaoming, how about we go to the cafeteria to eat first, then catch the loaches?”<br/><br/>Xiao Xiaoming shook his head, “The problem right now is not about eating, but where can we find these three hundred loaches? There’s not even a single small fish in that Mud Gully.”<br/><br/>Jiang Yifan nodded his little head and sighed softly, “Yeah, there’s not a single loach in the Mud Gully, where do we find three hundred? Isn’t Mom making it difficult for us? What should we do now?”<br/><br/>“Yeah, what should we do?” Xiao Xiaoming fell into deep thought.<br/><br/>Suddenly, Jiang Yifan’s eyes turned and he said, “How about we borrow some from the cafeteria first?”<br/><br/>Xiao Xiaoming,\t\t\t\t\t\t</div>", "images": {}, "success": true}