{"id": 309, "url": "https://www.novelhall.com/the-lucky-star-blessing-the-whole-village-32483/15193401.html", "title": "Chapter 309 - Chapter 309: Chapter 309:", "volume": 4, "volume_title": "Volume 4", "body": "<h1>Chapter 309 - Chapter 309: Chapter 309:</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 309: Chapter 309:<br/><br/>Translator: 549690339<br/><br/>“Yichen, I’m sorry. Can you forgive Dad?”<br/><br/>Outside a high-rise apartment complex in Capital City, a man with a scruffy beard tried to stop a limited-edition Rolls-Royce from leaving.<br/><br/>The person sitting in the car was Su Yichen, who had become the richest man in the country in just a few years.<br/><br/>Su Yichen took three years to exact revenge for his mother and himself.<br/><br/>He used his inheritance left by his mother to register a new company and then used this new company to continuously devour the Su Corporation.<br/><br/>By the time Su Xiangdong realized what was happening, Su Yichen had already gained control of the corporation, kicked Su Xiangdong out of the board of directors and stripped him of his position as president, leaving him with just a nominal title and no power.<br/><br/>It was like brutally dragging Su Xiangdong from a high position down to the ground.<br/><br/>And this was just the beginning of the revenge.<br/><br/>As for Lady Su Lan Yingying, who once took pride in her title as the chairman’s wife in the Wealthy Ladies Circle, she enjoyed unlimited glory.<br/><br/>But when the Su Corporation was taken over by her stepson and her husband Su Xiangdong was left with just an empty title, she immediately faced ridicule from the other Madams, forcing her to stay at home all day. Without money, she couldn’t buy whatever she wanted; she couldn’t even afford a high-end custom-made dress now.<br/><br/>If she wanted to buy new items, she had to sell her previous jewelry and clothes to cover the expenses.<br/><br/>Lady Su’s spending habits became the subject of mockery once again.<br/><br/>The more glorious she was in the past, the more miserable she appeared now.<br/><br/>However, Su Yichen’s revenge couldn’t possibly just be about lowering the living standards of their family.<br/><br/>He wanted a ruthless revenge.<br/><br/>How to take revenge?<br/><br/>Naturally, it was to start with their most beloved son, Su Hanyang.<br/><br/>Initially, Su Hanyang loved gambling and drugs.<br/><br/>Su Yichen set a trap to lure him into gambling.<br/><br/>Gambling was addictive.<br/><br/>Before, Su Hanyang had his parents and the Su Corporation to underwrite the losses. No matter how much he lost, Su Xiangdong and his wife only saw it as a small amount of money.<br/><br/>But now, Su Yichen had cut off their source of money, leaving them with just enough to cover their living expenses each month.<br/><br/>Yet Su Hanyang’s gambling escalated from hundreds of thousands to millions, then to over 10 million, and even billions. At first, Lady Su was heartbroken for her son and used her previous savings to help him repay his gambling debts.<br/><br/>But the more he gambled, the less she had in savings. Not only that, she continuously sold her expensive jewelry to repay her son’s debts, otherwise, her son might end up missing his arms or legs.<br/><br/>However, the couple’s debts only grew more and more. They had paid back 10,000,000 but still owed a billion. Their assets dwindled until the only thing left was the villa they currently lived in.<br/><br/>If they sold this villa, where would they live?<br/><br/>So they went to beg Su Yichen, hoping he would help Su Hanyang pay off his debts out of past affection.<br/><br/>Su Yichen coldly laughed, “Even if I donated all my money, I wouldn’t give you a penny to help Su Hanyang repay his debts. You’re the ones who took my mother’s life and nearly killed me too. So why do you think I would help Su Hanyang fill this money pit and pay off his bottomless gambling debts out of past affection?”<br/><br/>Then, he looked at the haggard and disheveled Su Xiangdong and his wife and sarcastically said, “If you ask me, you should break Su Hanyang’s hands and feet, so he can’t gamble anymore.”<br/><br/>Lady Su Lan Yingying glared at him, resentfully saying, “How could you be so cruel?”<br/><br/>Su Yichen shrugged his shoulders mockingly, “If you don’t want to take my advice, then just continue repaying his gambling debts.”\t\t\t\t\t\t</div>", "images": {}, "success": true}