{"id": 301, "url": "https://www.novelhall.com/the-lucky-star-blessing-the-whole-village-32483/15193393.html", "title": "Chapter 301 - Chapter 301: Chapter 301:", "volume": 4, "volume_title": "Volume 4", "body": "<h1>Chapter 301 - Chapter 301: Chapter 301:</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 301: Chapter 301:<br/><br/>Translator: 549690339<br/><br/>After Xu Guochang left, Xiao Jinli immediately returned to her room.<br/><br/>After closing the doors and windows, she immediately entered the Space.<br/><br/>“Xiao Zhi!” Xiao Jinli shouted, “Is what Xu Guochang said true?”<br/><br/>Xiao Zhi nodded, “Yes!”<br/><br/>Xiao Jinli said somewhat speechlessly, “Why didn’t you tell me?”<br/><br/>Since the establishment of Divine Wind Technology Group, Xiao Jinli had let Xiao Zhi monitor the Internet worldwide.<br/><br/>For such a big matter as Xu Guochang, Xiao Zhi should have told her immediately.<br/><br/>Xiao Zhi flew in mid-air and said, “Master, don’t worry, I’ve been monitoring the situation in Plum Firm Country. I thought it wasn’t necessary to inform you for now.<br/><br/>Also, I wanted to test Xu Guochang and see what kind of choice he would make under the huge temptation of interests. Although he has a patriotic heart.<br/><br/>But I don’t know if his patriotic heart can withstand the huge temptation. After all, he has been living in Plum Firm Country for ten to twenty years, and many of his friends are there.”<br/><br/>Xiao Jinli,<br/><br/>Xiao Zhi flew a few more circles in the air and said, “However, his patriotic heart is quite firm. Master, let me tell you, before Plum Firm Country sued him, someone had already contacted him for going to Plum Firm Country, giving him the largest technology company there, several castles, manors, and several billion Mei Currency. Haha, all these things can make him the wealthiest person in Dragonzhou Country.”<br/><br/>Xiao Jinli raised her eyebrows and asked, “Then what?”<br/><br/>Xiao Zhi excitedly said, “Then what? Of course, he refused. Haha, I couldn’t tell that when you first found him, he was poor and almost swayed his patriotic heart, wanting to return to Plum Firm Country. But now, he firmly refuses the huge temptation from Plum Firm Country. I really don’t understand!”<br/><br/>Xiao Jinli explained, “Patriots should love their families before their country. At that time, he almost ended up on the streets with his wife and daughter. He felt guilty for them, so he prioritized their normal life. Now that his family is safe and they live happily together, Xu Guochang naturally devotes his heart to patriotism and wants to serve his country.”<br/><br/>Xiao Zhi said somewhat doubtfully, “But, is his patriotic heart too wavering? No money, no patriotism; money, and patriotism.”<br/><br/>“Pfft!” Xiao Jinli laughed, “People just love their families first, then their country.”<br/><br/>“But if Plum Firm Country threatens him with his wife and daughter, will he betray his country?” Xiao Zhi seriously said, “Master, what do you think?”<br/><br/>“Well, that’s very likely!” Xiao Jinli nodded, “But, if Plum Firm Country could threaten him effectively with his wife and daughter, he wouldn’t have been able to return to his country, and he would be forced to stay in Plum Firm Country.”<br/><br/>Xiao Zhi,<br/><br/>He sighed lightly, “Forget it, human feelings are the most complicated. I can’t understand!”<br/><br/>Xiao Jinli said, “Xiao Zhi, you must closely monitor the situation in Plum Firm Country. Also, send me a copy of the so-called evidence and, if possible, the evidence of their fabrication of evidence.”<br/><br/>“…Ah…” Xiao Zhi sighed lightly, “Master, I suspect you’ve always treated me as a tool, oh, no, I’m not a person, I’m a smart brain. Anyway, you use me as a tool!”<br/><br/>Xiao Jinli touched his little head and smiled, “No, I treat you as a family.”<br/><br/>“Wuu, I’m so touched, my master treats me as a family.” Xiao Zhi said sarcastically, “Alright, master, I know that you use me and then discard me, I’ve gotten used to it.”<br/><br/>Xiao Jinli,<br/><br/>“By the way, master, what do you intend to do with Jiang Yifan?” Xiao Zhi remembered something and his eyes rolled around.<br/><br/>Xiao Jinli smiled and said, “Since this stinky boy wants me to be his mom, I’ll continue to do so. If his parents come, I’ll let him go back with them.”<br/><br/>Xiao Zhi covered his mouth and giggled, “But if his parents don’t come, will you have to be that stinky boy’s real mom forever?”<br/><br/>Xiao Jinli didn’t hesitate and said, “How could that be possible? If his parents really don’t come, I’ll send him to the orphanage.”<br/><br/>Xiao Zhi sighed softly, “Poor Jiang Yifan. He’s already an orphan, and he finally met a mom halfway, but this mom just wants to send him to an orphanage.”<br/><br/>Xiao Jinli,<br/><br/>She looked at Xiao Zhi suspiciously.<br/><br/>Xiao Zhi immediately said somewhat guiltily, “Master, why are you looking at me?”<br/><br/>Xiao Jinli seriously asked, “Who is Jiang Yifan? You seem to know his identity? You’re right, as the most advanced smart brain, you can penetrate almost every hole in the network. You must have figured out his identity a long time ago. Tell me, what is his true identity?”<br/><br/>Xiao Zhi sighed and said, “Let him tell you himself. When the time comes, he will tell you naturally.”<br/><br/>Xiao Jinli,\t\t\t\t\t\t</div>", "images": {}, "success": true}