{"id": 303, "url": "https://www.novelhall.com/the-lucky-star-blessing-the-whole-village-32483/15193395.html", "title": "Chapter 303 - Chapter 303: Chapter 303:", "volume": 4, "volume_title": "Volume 4", "body": "<h1>Chapter 303 - Chapter 303: Chapter 303:</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 303: Chapter 303:<br/><br/>Translator: 549690339<br/><br/>Xiao Ming and Jiang Yifan ran to the cafeteria, and Jiang Yifan found Xiao’s mother, pulling on her apron and saying, “Grandma, can you give me and Bro Xiaoming three hundred loaches?”<br/><br/>Xiao’s mother asked with curiosity, “Little Fanfan, what do you guys need so many loaches for?”<br/><br/>Jiang Yifan rubbed his little hands together and replied, “I was punished by Mommy. Mommy said I have to dig out three hundred loaches in Small Mud Gully with Bro Xiaoming.”<br/><br/>Only then did Xiao’s mother notice that the children were covered in mud.<br/><br/>Xiao’s mother laughed and said, “Little Fanfan, did you go play in Mud Gully again and got punished by your mommy?”<br/><br/>Admitting without denying, Jiang Yifan said, “Yeah, I got punished. I was supposed to catch one hundred loaches in Mud Gully, and Xiaoming was supposed to catch two hundred. But there were no loaches in the Mud Gully at all, so Xiaoming and I came to find you.”<br/><br/>Xiao’s mother wiped her hands on her apron and smiled, “There are no loaches in Mud Gully, so you came to cheat with me?”<br/><br/>Jiang Yifan rolled his eyes and said, “Grandma, I know you love me the most and should be willing to help us, right?”<br/><br/>He showed a flattering smile on his face.<br/><br/>Xiao Ming also looked at Xiao’s mother with anticipation.<br/><br/>Unexpectedly, Xiao’s mother shook her head with a smile, “That won’t do! Little Fanfan, although I do love you, we still have to obey your mommy’s orders. I don’t dare to help you.”<br/><br/>Jiang Yifan’s expression stiffened, and disbelief showed on his little face.<br/><br/>Why would this happen?<br/><br/>Usually, his grandma cared for him the most, and every time his mommy scolded him, he would complain to her and be sure to succeed.<br/><br/>But why did it not work this time?<br/><br/>Jiang Yifan asked with a hint of sadness, “Grandma, why? I’m still so young, and if I’m hungry, I won’t grow tall.”<br/><br/>Xiao’s mother patted his little head and smiled, “Of course, I can’t bear it.”<br/><br/>Jiang Yifan’s expression stiffened again.<br/><br/>Why would it be like this?<br/><br/>Even though Grandma usually cared the most about him, whenever Mommy threatened him, he would complain, getting her on his side every single time.<br/><br/>But why did it not work this time?<br/><br/>Jiang Yifan appeared rather sad, asking, “Grandma, why? I’m so young, and if I go hungry, I won’t grow tall.”<br/><br/>Xiao’s mother laughed, “Oh, you child. Your mommy said you can’t have rice, but she never said you can’t have vegetables.”<br/><br/>Upon hearing this, Jiang Yifan’s eyes lit up, and he immediately understood.<br/><br/>Jiang Yifan exclaimed happily, “Right, Grandma always has a solution! Grandma, can you help me find a way to get those three hundred loaches?”<br/><br/>Xiao’s mother shook her head, “Little Fanfan, you’ll have to figure this out yourself. Grandma already helped you once; if I help you again, I’m afraid your mom might punish me, too.”<br/><br/>Xiao Ming and Jiang Yifan,<br/><br/>Xiao Ming and Jiang Yifan only ate their favorite foods and snacks in the cafeteria besides their main meal of rice.<br/><br/>However, after the two of them had eaten their fill, they began to rack their brains to figure out how to get loaches.<br/><br/>“Ah!” both sighed at the same time, “Where can we get so many loaches? Grandma refuses to help us.”<br/><br/>In Xiao Family Village, everyone treated Xiao Jinli’s words as if they were holy.<br/><br/>So, apart from Xiao’s mother, no one else would help them.<br/><br/>However, in terms of education, Xiao’s mother couldn’t always defy Xiao Jinli as it was not good for the children’s upbringing.<br/><br/>After sighing for a while, Jiang Yifan suddenly brightened up and said to Xiao Ming, “Bro Xiaoming, I know what to do!”<br/><br/>Xiao Ming, “… Huh?”\t\t\t\t\t\t</div>", "images": {}, "success": true}