{"id": 306, "url": "https://www.novelhall.com/the-lucky-star-blessing-the-whole-village-32483/15193398.html", "title": "Chapter 306 - Chapter 306: Chapter 306:", "volume": 4, "volume_title": "Volume 4", "body": "<h1>Chapter 306 - Chapter 306: Chapter 306:</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 306: Chapter 306:<br/><br/>Translator: 549690339<br/><br/>Xiao Xiaoming and Jiang Yifan spent the afternoon catching loaches by the pond, finally managing to catch three hundred by evening.<br/><br/>Jiang Yifan looked at the loaches in the bucket and said with a slightly worried expression, “Bro Xiaoming, it’s getting dark. My mom said we have to catch three hundred loaches from Mud Gully, but how are we supposed to do that now that it’s dark?”<br/><br/>With so many loaches, they might all disappear if they just pour them into the Mud Gully, and catching them again would be difficult.<br/><br/>Xiao Xiaoming also felt troubled as he looked at the many loaches.<br/><br/>He turned to Jiang Yifan and said, “Little Fanfan, you’re as smart as Sister Jin Li. Why don’t you try to come up with a solution?”<br/><br/>Trying to cheat was definitely not an option.<br/><br/>Older Sister Jinli had great powers, and she would definitely know that these loaches were not caught from Mud Gully.<br/><br/>So, they could only catch the loaches from Mud Gully.<br/><br/>Jiang Yifan tilted his little head, deep in thought.<br/><br/>Suddenly, his eyes lit up and he said, “I got it! Bro Xiaoming, before we dump the loaches in, let’s dig a pit in the mud gully first and put some crushed earthworms in it. That way, the loaches would be caught from Mud Gully and we don’t have to search for them, right?”<br/><br/>Xiao Xiaoming’s eyes also brightened, and he nodded, “Yeah, that’s a good idea. Let’s go dig a pit first.”<br/><br/>Immediately, the big and small figures went to dig a pit in the Mud Gully with their buckets.<br/><br/>The sky was getting darker, and there weren’t many tourists left playing in the Mud Gully.<br/><br/>But there were still some tourists.<br/><br/>Most of the visitors playing in Mud Gully were children or tourists accompanying children.<br/><br/>They noticed the loaches in the buckets.<br/><br/>“Hey, what are these?” Many of the children didn’t recognize loaches.<br/><br/>The adults remarked, “These look like loaches.”<br/><br/>“Loaches?”<br/><br/>“What are they doing with the loaches here?”<br/><br/>Some children even tried to catch them from the bucket.<br/><br/>Jiang Yifan’s serious little face warned, “Little brother, you can’t play with the loaches now.”<br/><br/>“Ha, why not?” A slightly older boy questioned, puzzled.<br/><br/>Jiang Yifan explained, “These loaches, I’m going to dump them in the Mud Gully, then catch them again.”<br/><br/>The small tourists,<br/><br/>Jiang Yifan rolled his eyes, saying, “Well, before we dump the loaches, we’ll dig a pit first, and then catch them back.”<br/><br/>Upon hearing this, the children became excited and said, “Dig a pit? How are we going to do that? Let’s do it together.”<br/><br/>Jiang Yifan nodded, “Okay, let’s go dig a pit first!”<br/><br/>Xiao Xiaoming stared blankly as Jiang Yifan rallied a group of children to dig the pit.<br/><br/>He had originally planned to do it just with Jiang Yifan.<br/><br/>How were they going to dig the pit?<br/><br/>Xiao Xiaoming thought about it and said, “We’ll just pile up this mud, make a circle, and that’ll make a small pit.”<br/><br/>And so, a group of children began to play with mud.<br/><br/>Soon, a pit with a diameter of two meters was dug.<br/><br/>Then, all three hundred loaches were swiftly poured into the pit from the buckets.<br/><br/>Jiang Yifan waved his little hand and shouted, “Soldiers, let’s start the operation, catch the loaches!”<br/><br/>As a result, a group of children began to battle in the small pit.<br/><br/>Although the loaches were all in a small pit, they were slippery and hard to catch, slipping away as soon as they were caught.<br/><br/>Jiang Yifan, ealized that, despite the good conditions for catching loaches, they were difficult to actually capture.<br/><br/>However, there’s strength in numbers, and although the loaches weren’t easy to catch, in just over an hour, all three hundred of them were captured without a single one missing.<br/><br/>But many children were still gazing longingly at the loaches in the bucket, wanting to play with them.\t\t\t\t\t\t</div>", "images": {}, "success": true}