{"id": 307, "url": "https://www.novelhall.com/the-lucky-star-blessing-the-whole-village-32483/15193399.html", "title": "Chapter 307 - Chapter 307: Chapter 307:", "volume": 4, "volume_title": "Volume 4", "body": "<h1>Chapter 307 - Chapter 307: Chapter 307:</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 307: Chapter 307:<br/><br/>Translator: 549690339<br/><br/>Jiang Yifan and Xiao Xiaoming went home, carrying two buckets filled with three hundred loaches, to complete their task.<br/><br/>Many young tourists, who wanted to play with the loaches, followed them.<br/><br/>Jiang Yifan said, “These loaches are not ready for you to play with yet, we’ll have to finish our task first. But once we’re done, you can have fun with them in any way you like, okay?”<br/><br/>Upon hearing this, the young tourists immediately cheered.<br/><br/>“Okay, okay!”<br/><br/>Then, they followed Jiang Yi Fan and Xiao Xiaoming to the Xiao Family’s house.<br/><br/>At this moment, several old gentlemen and Xiao Jinli were enjoying the shady courtyard.<br/><br/>Seeing Jiang Yifan and Xiao Xiaoming covered in mud and carrying a bucket, Elder Jiang, who was in his eighties or nineties, asked immediately, “Little Fanfan, Xiao Ming, where have you been? Why are you covered in mud? Go and take a bath, change your clothes, and who are these children following you?”<br/><br/>Jiang Yifan laughed, “Grandpa, we went to Mud Gully to catch loaches.”<br/><br/>Elder Chen looked puzzled and asked, “There are loaches in Mud Gully? Why would you go catching loaches there?”<br/><br/>Jiang Yifan glanced at Xiao Jinli and whispered, “We played in Mud Gully, so Mommy punished us by making us catch three hundred loaches there.”<br/><br/>Grumpy Old Man Jiang asked Xiao Jinli, “What’s going on? Isn’t Mud Gully for everyone to play in? Little Fanfan didn’t do anything wrong by playing there. Why did you punish him?”<br/><br/>Well, this must be a typical case of grandparents being more lenient than parents.<br/><br/>Ever since Jiang Yifan appeared, Xiao Jinli, who used to be the favourite amongst the old gentlemen, has fallen behind.<br/><br/>Xiao Jinli shot Jiang Yifan a look. This child was too good at tattling; he was practically the king of snitching.<br/><br/>She laughed and said, “Grandfather, the child was playing in Mud Gully alright, but they missed the mealtime, and that was wrong. And when you’re wrong, you have to accept the consequences.”<br/><br/>Elder Jiang, who doted on Jiang Yifan, said, “Kids being naughty and playing a little late before returning for a meal doesn’t seem like a big deal. We used to climb trees in the mountains and catch fish in the river. We would play until dark every single day.”<br/><br/>Others also nodded their heads and agreed, “Exactly, we used to be like that too. We would play all day and forget about meal times.”<br/><br/>“Kids are a bit naughty; when they are playing, they don’t feel hungry, so they don’t think about coming home to eat.”<br/><br/>“Xiao Jinli, I heard that when you were a child, you used to disappear at mealtimes every day. This naughty child is just like you.”<br/><br/>Xiao Jinli,<br/><br/>She felt deeply that she had indeed fallen out of favour.<br/><br/>Although she used to be the favourite of the group.<br/><br/>A slightly helpless Xiao Jinli said, “Old gentlemen, don’t you know that this child can’t go hungry? When he is hungry, he causes trouble. Some people lose strength when they are hungry, but he becomes full of energy and is very destructive. Therefore, he needs proper guidance. Besides, a child needs regular meals when he is growing.”<br/><br/>Elder Chen laughed and said, “That’s true. Little Fanfan, this kid, is very destructive when he is hungry, and not eating on time is indeed harmful to his growth.”<br/><br/>The other old men also agreed, “That’s true!”<br/><br/>Jiang Yifan, “…” Who is the real favourite here?<br/><br/>The grandfathers turned sides too quickly.<br/><br/>Jiang Yifan let out a sigh, making himself look like a poor abandoned child.<br/><br/>Then he asked, “Mommy, these little brothers and sisters want to play with the loaches. Can they?”<br/><br/>Xiao Jinli looked at the loaches in their bucket and nodded, “Okay. Pour these loaches into this pool for now and let them play. Tomorrow, we will pour them all back into Mud Gully as a small project.”<br/><br/>“Oh wow, Mommy is awesome!” Jiang Yifan said cheerfully.<br/><br/>Jiang Yifan and Xiao Xiaoming emptied all the loaches from their buckets into the pool. Then they turned to the children behind them and said, “Little brothers and sisters, you can try scooping up the loaches from this pool.”<br/><br/>The pool was not very large, around 200cm in length and 80cm in width. With three hundred loaches placed inside, it became quite crowded.<br/><br/>Seven or eight children gathered around the pool, reaching out their hands to try and catch the loachsenies while having a great time.<br/><br/>Because they now had company, even Jiang Yifan forgot about taking a bath and changing his clothes.<br/><br/>Xiao Jinli brought out a dozen small stools for the parents of these children to sit on and also brewed two pots of tea.<br/><br/>Like all guests, when they smelled the tea, many people couldn’t help but exclaim, “This tea smells so good.”<br/><br/>Even though they weren’t tea connoisseurs, they could tell that this tea was likely brewed well.<br/><br/>“What kind of tea leaves are these? Why does the tea brewed from them smell so good?” A male tourist asked with excitement, “I’ve been tasting tea for twenty years, and this is the first time I’ve smelled such fragrant tea.”<br/><br/>“Yes, I feel so comfortable after smelling this tea. What kind of tea leaves are these?”<br/><br/>When the tea is good, many people instinctively believe it’s because of the quality of the tea leaves.<br/><br/>After all, good tea comes from good tea leaves, right?<br/><br/>Otherwise, there must be a difference between cheap tea leaves and those worth several hundreds of thousands of yuan.<br/><br/>Xiao Jinli laughed and said, “This is just ordinary Da Hong Pao. In fact, the reason our brewed tea smells so good is because of the water we use. Our well water is sweet and refreshing, and the tea brewed from it is full of clear fragrance.”<br/><br/>Those who know about tea, after looking at the tea leaves that were brewed, knew what quality they were – indeed, they were the common kind of Da Hong Pao, the kind that costs 300-400 yuan per jin.<br/><br/>After sipping a bit, they exclaimed, “What a fragrant tea!”<br/><br/>The others also began to taste the tea.<br/><br/>After a while, a person said, “Miss Xiao, may I take a couple of bottles of your water back home?”<br/><br/>For tea lovers, such water quality for brewing tea is very appealing.<br/><br/>Xiao Jinli nodded, “Sure. This isn’t our well water. So, feel free to take as much as you like.”<br/><br/>“Alright, thank you very much, Miss Xiao.”<br/><br/>Inside, he was thinking, ‘When I get back, I’ll come back with a couple of big buckets and take more water.’<br/><br/>The children were having a great time playing by the pool, and their parents were also enjoying their time, drinking tea in the courtyard.<br/><br/>Elder Jiang and the other old men went to rest around seven or eight in the evening.<br/><br/>They were old. Even though they were healthy, they got tired in the evening. Basically, they would go to bed at eight.<br/><br/>Xiao’s mother was busy managing the cafeteria and also needed to finish work around eight or nine. Xiao’s father had his own business and was busy most of the times. He only came home on Saturdays and Sundays. Xiao Junxuan, too, was busy with company matters and would finish work around eight or nine.<br/><br/>So, the only one who seemed idle all day in the family was Xiao Jinli. She would stroll around here and there with her beloved son, tease each other, or engage in battles of wit and courage.<br/><br/>Now, she was left to chat with the unexpected tourists.\t\t\t\t\t\t</div>", "images": {}, "success": true}