{"id": 304, "url": "https://www.novelhall.com/the-lucky-star-blessing-the-whole-village-32483/15193396.html", "title": "Chapter 304 - Chapter 304: Chapter 304:", "volume": 4, "volume_title": "Volume 4", "body": "<h1>Chapter 304 - Chapter 304: Chapter 304:</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 304: Chapter 304:<br/><br/>Translator: 549690339<br/><br/>Xiao Jinli and Jiang Yifan, each carrying a small bucket, arrived at the pond. Standing by the edge, looking at the lotuses blooming under the sun in the pond, Xiao Xiaoming asked with some uncertainty, “Little Fanfan, are we really going to catch loaches here? Aren’t loaches found in mud?”<br/><br/>Jiang Yifan held some bait in his hand, well, actually they were earthworms.<br/><br/>Jiang Yifan also shook his head uncertainly, “I don’t know if we can catch any, either. Maybe we should ask Grandpa Changmin.”<br/><br/>Xiao Changmin was one of the people in charge of managing the pond.<br/><br/>In the Xiao Family Village, there were three large ponds.<br/><br/>Each pond was about ten mu (Chinese unit of area), and one of them was dedicated for tourists who wished to fish.<br/><br/>Of course, there would be some fees charged, and the fish caught could be bought at market prices if necessary. Otherwise, the cafeteria was able to take them back.<br/><br/>However, most tourists preferred to buy their own catches.<br/><br/>Once bought, tourists could ask locals to cook for them, for a small processing fee.<br/><br/>Seeing Xiao Xiaoming and Jiang Yifan carrying two large buckets, Xiao Changmin walked over, full of curiosity, and asked, “Xiaoming, Little Fanfan, what are you doing with those buckets?”<br/><br/>Xiao Xiaoming honestly said, “Uncle, Sister Jin Li told me and Little Fanfan to dig up three hundred loaches from Mud Gully. There are no loaches in that gully, though, so we came here to fish for loaches.”<br/><br/>Hearing this, Xiao Changmin realized Xiao Jinli was punishing them.<br/><br/>He glanced at the children’s equipment, raised an eyebrow and laughed, “You can indeed fish for loaches, but getting three hundred isn’t an easy task. Are you sure you want to fish? Even if you fish all day, I’m not sure if you can get three hundred.”<br/><br/>Pausing slightly, he asked, a bit confused, “Why didn’t you ask your grandma for loaches in the cafeteria?”<br/><br/>Jiang Yifan hung his head, dejectedly replying, “We did, we did. But Grandma said that since Mommy gave the order, she couldn’t refuse. So, she told us to figure it out ourselves.”<br/><br/>Xiao Xiaoming nodded, “Exactly, so Little Fanfan thought of fishing in the pond.”<br/><br/>Xiao Changmin understood that Xiao Jinli’s punishment for them was probably not about making them dig up three hundred loaches from the Mud Gully, where there were no loaches at all. Her real intention was probably to make them find their own solution during the punishment.<br/><br/>Xiao Changmin nodded and said, “Alright then. Since you want to fish, just do it. Let me check your equipment.”<br/><br/>Xiao Changmin checked and said, “Your equipment won’t work. Fishing for loaches is different from regular fishing. You don’t use a float, but bottom fishing.”<br/><br/>Jian Yifan’s eyes sparkled with curiosity as he asked, “Grandpa Changmin, why is that?”<br/><br/>Xiao Changmin explained, “Loaches live on the bottom, so you definitely need to bottom-fish. Use a small lead sinker for bottom fishing, and this hook, use a sleeve hook. Sleeve hooks are smaller and easier for loaches to bite. This bait, hmm, the earthworms from our village still work, but they’re too big and definitely need to be crushed.”<br/><br/>Hearing Xiao Changmin’s explanations, Xiao Xiaoming immediately said, “I’ll go back now and find my grandfather’s fishing gear and these hooks.”<br/><br/>With that, Xiao Xiaoming ran off.<br/><br/>Jiang Yifan asked, “Grandpa Changmin, are there many loaches in this pond?”<br/><br/>Xiao Changmin laughed, “There are definitely a lot. When the water in the pond is drained, not to mention three hundred, even three thousand can be caught. However, we can’t drain all the water from the pond just for your loaches.”<br/><br/>No matter how much they spoiled these children, they wouldn’t spoil them ridiculously.\t\t\t\t\t\t</div>", "images": {}, "success": true}