{"id": 308, "url": "https://www.novelhall.com/the-lucky-star-blessing-the-whole-village-32483/15193400.html", "title": "Chapter 308 - Chapter 308: Chapter 308:", "volume": 4, "volume_title": "Volume 4", "body": "<h1>Chapter 308 - Chapter 308: Chapter 308:</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 308: Chapter 308:<br/><br/>Translator: 549690339<br/><br/>After receiving permission for Xiao Jinli to stay in Xiao Family Village, Xu Guochang immediately arranged for his wife and daughter to settle down without stopping.<br/><br/>After all, he was now targeted by foreign forces, and the situation was very dangerous.<br/><br/>Xiao Jinli promised him that she would ensure the safety of his wife and daughter.<br/><br/>As for the safety of his so-called domestic relatives and friends, it was not necessary.<br/><br/>Back then, when they were destitute and forced to sleep on the streets, no one was willing to lend them a hand.<br/><br/>Although his parents were still alive, their favoritism towards his elder brother’s family made him feel chilled.<br/><br/>In fact, what chilled him even more was that after he gained fame and fortune with the Divine Wind Technology Group, his elder brother’s family and parents were plotting to send him forcibly to a mental hospital under the pretext of his mental illness. Then, they would monopolize his property and drive away his wife and daughter.<br/><br/>He never thought that when he achieved success, his family would not be happy for him but would only think of seizing his property.<br/><br/>If it weren’t for accidentally discovering their conspiracy, they would’ve succeeded.<br/><br/>From then on, he never visited his parents’ home again. He only fulfilled his duty of providing for them.<br/><br/>Therefore, even if those people threatened him with his family, it would be useless.<br/><br/>As for his close friends, most of them were abroad, and influential figures in Plum Firm Country. Plum Firm Country would not shoot itself in the foot by kidnapping them; once the news leaked out, no one would dare to work for Plum Firm Country in the future.<br/><br/>So, what he needed to protect most was his wife and daughter.<br/><br/>He had thought about letting his wife and daughter settle in Xiao Family Village before, but the conditions for settling in the village were strict, and not just anyone with power and influence could get in.<br/><br/>However, he didn’t want to give up and planned to take advantage of the holiday to bring his wife and daughter to Xiao Family Village and look for opportunities.<br/><br/>Unexpectedly, the opportunity seemed to fall from the sky.<br/><br/>His mysterious boss turned out to be right in Xiao Family Village.<br/><br/>Now, he was completely reassured.<br/><br/>Xiao Family Village today is not just a simple village but has become a place for national retired cadres to recuperate, almost gathering the highest power and influence. Who would dare to cause trouble in Xiao Family Village?<br/><br/>Three days later, Xu Guochang arranged for his wife and daughter to come over.<br/><br/>Thanks to Xiao Jinli’s connections, their family was assigned an independent courtyard that was quiet and spacious. Moreover, Xiao Jinli promised him that she could arrange for relatives and friends to visit.<br/><br/>However, for these relatives and friends to settle in, they must obtain her consent.<br/><br/>Only now did Xu Guochang realize that anyone coming to Xiao Family Village to settle down required Xiao Jinli’s consent, which showed how high her status was in the village.<br/><br/>Well, this secret was also an accidental discovery.<br/><br/>“Little Li, I have arranged for my wife and children. I will go back to the company now. Please take care of my wife and children.” Xu Guochang said sincerely.<br/><br/>Xiao Jinli nodded and said, “You can work with peace of mind. I will take care of everything behind you. Mei Jian would not dare to come here to cause trouble. The only thing I want from you now is to protect yourself well. Be careful with your food, and your bodyguards must accompany you twenty-four hours a day. The people sent by the National Public Relations Department are top-notch.”<br/><br/>As she said this, Xiao Jinli seemed to think of something. She took out a porcelain bottle and handed it to him, saying, “Take this with you. In case you get poisoned or hurt, drink it at the first opportunity. It will save your life!”<br/><br/>Upon hearing this, Xu Guochang took it very seriously and sincerely thanked her, “Thank you, boss!”\t\t\t\t\t\t</div>", "images": {}, "success": true}