{"id": 305, "url": "https://www.novelhall.com/the-lucky-star-blessing-the-whole-village-32483/15193397.html", "title": "Chapter 305 - Chapter 305: Chapter 305:", "volume": 4, "volume_title": "Volume 4", "body": "<h1>Chapter 305 - Chapter 305: Chapter 305:</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 305: Chapter 305:<br/><br/>Translator: 549690339<br/><br/>After preparing their fishing gear and bait, the two kids sat by the pond’s edge and began fishing intently.<br/><br/>However, the float remained still, as if there were no loaches at all.<br/><br/>Jiang Yifan, lacking patience, lowered his head and whispered, “Bro Xiaoming, are there really any loaches in here? Why has it been so long and our hooks still haven’t moved?”<br/><br/>Xiao Xiaoming quietly replied, “Little Fanfan, we’ve only been sitting here for less than five minutes. Let’s wait a little longer. Uncle Changmin said there are loaches in this pond, so there must be plenty here.”<br/><br/>Jiang Yifan has a restless disposition, and sitting still for five minutes was already his limit. He felt like he wanted to jump into the pond.<br/><br/>He said, “But it’s been so long and not a single one has been caught. We need to catch three hundred, how long will this take?”<br/><br/>Xiao Xiaoming said, “Little Fanfan, if we don’t fish here, where else can we get loaches? Your grandma won’t let us have any from the cafeteria. Uncle Changmin is already kind enough to let us fish here. Be patient, as long as there are loaches, we’ll catch them soon enough.”<br/><br/>“But seriously, how much longer do we have to fish?” Jiang Yifan still couldn’t let it go.<br/><br/>Getting him to settle down was truly difficult.<br/><br/>Maybe Xiao Jinli knew about his restless temperament, and that’s why she chose such a punishment to hone his patience.<br/><br/>Xiao Xiaoming could only patiently persuade him, “It’ll be very soon, Little Fanfan. We need to be patient. Shh, let’s stop talking now, or the loaches really won’t bite.”<br/><br/>Jiang Yifan,<br/><br/>Alright, he would wait and see.<br/><br/>After about ten minutes, the float finally moved.<br/><br/>“It moved, it moved,” Jiang Yifan suddenly exclaimed excitedly, “Bro Xiaoming, the float moved, did a loach take the bait?”<br/><br/>Xiao Xiaoming nodded, “It should be. But, Little Fanfan, maybe there is only one loach on the hook. Let’s wait a bit longer, and when the hook is full, we’ll reel it in.”<br/><br/>Starting is always the hardest part.<br/><br/>Perhaps having caught the first loach, Jiang Yifan found new motivation. He nodded, “Alright, let’s wait!”<br/><br/>Jiang Yifan might have developed an interest in fishing, as this time he waited for another twenty minutes while suppressing his impatience.<br/><br/>At that moment, Xiao Changmin came over to check on the two kids and how they were doing with their loach fishing.<br/><br/>“Oh, the float is moving quite a lot. We can reel it in now,” Xiao Changmin said, “There should be at least ten or twenty loaches on this hook.”<br/><br/>Jiang Yifan’s eyes lit up upon hearing this, and he excitedly said, “Really? There are so many loaches on just one hook?”<br/><br/>“Yes, I’m pretty sure. You guys can reel in the hook and see for yourselves,” Xiao Changmin thought for a moment and added, “Or should I do it? You might be too small to lift it.”<br/><br/>“No, I can do it.” Jiang Yifan eagerly replied, “Don’t underestimate me just because I’m young. I’m quite strong.”<br/><br/>With that, he pulled the fishing rod, successfully bringing up the hook.<br/><br/>Twenty hooks, all filled with loaches.<br/><br/>Jiang Yifan exclaimed, “They’re all full, all full! There are actually twenty loaches, this is amazing!”<br/><br/>If they could fill their hooks like this every time, they should be able to complete the task of catching three hundred loaches very quickly.<br/><br/>Xiao Xiaoming’s hooks were also full of loaches.<br/><br/>Xiao Xiaoming said, “Uncle Changmin didn’t lie to us, there really are a lot of loaches here. Little Fanfan, we should be able to catch three hundred loaches in no time.”<br/><br/>Jiang Yifan agreed, nodding his head, “Yes, very soon.”\t\t\t\t\t\t</div>", "images": {}, "success": true}