{"id": 300, "url": "https://www.novelhall.com/the-lucky-star-blessing-the-whole-village-32483/15193392.html", "title": "Chapter 300 - Chapter 300: Chapter 300: Happy Children’S Day On June 1", "volume": 3, "volume_title": "Volume 3", "body": "<h1>Chapter 300 - Chapter 300: Chapter 300: Happy Children’S Day On June 1</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 300: Chapter 300: Happy Children’s Day on June 1<br/><br/>Translator: 549690339<br/><br/>After teasing Xiao Jinli a bit, Xu Guochang immediately got to the point.<br/><br/>Xu Guochang said, “Some time ago, Plum Firm Country told the world media that the core technology of the Shenfeng Group was stolen by me. They are preparing to collect evidence and plan to sue me for theft of secrets in the International Court!”<br/><br/>Everyone knew the real situation well.<br/><br/>It was just an excuse for the Plum Firm Country to covet Shenfeng Group’s technology.<br/><br/>Xiao Jinli asked indifferently, “What will you do?”<br/><br/>Xu Guochang said, “I have applied for protection from the National Public Relations Department!”<br/><br/>Shenfeng Group has a deep cooperation with the National Institute of Science and Technology.<br/><br/>Therefore, as the person in charge of Shenfeng Group, he has the right to apply for personal protection from the National Public Relations Department.<br/><br/>Xiao Jinli frowned slightly, “So you’re just applying for personal protection?”<br/><br/>Xu Guochang nodded, “Yes, people in Plum Firm Country believe that these key core technologies are on me, and they haven’t developed them yet. So, while they are saying they will sue me in the International Court, they will definitely send people to secretly kidnap me. The usual company bodyguards won’t be enough, I can only apply for protection from the National Public Relations Department!”<br/><br/>Xiao Jinli nodded, thought for a while, tapped her fingers on the table lightly, and then said, “Since Plum Firm Country wants to sue, let them sue. Uncle Xu, maybe this time it’s an opportunity for you to clear your grievances and restore your innocence.”<br/><br/>Xu Guochang frowned slightly, with some doubts, “But back then, Plum Firm Country made up a lot of evidence to frame me for theft. This time, they must be well-prepared in suing me.”<br/><br/>The purpose of Plum Firm Country was simple: as long as they succeeded in suing him, they could take him to Plum Firm Country for trial and imprisonment, and then they could use methods to get advanced technology from his mouth.<br/><br/>Dragon State definitely couldn’t let Plum Firm Country take him away, but it was clear that the International Court was biased towards Plum Firm Country, and they were well prepared. So, the International Court would definitely let Plum Firm Country win.<br/><br/>Therefore, it would cost Dragon State a lot to protect him.<br/><br/>After all, the key technologies he held involved the entire country’s technological development level.<br/><br/>Xiao Jinli slightly frowned and then said, “I’ll take care of this matter. As for you, just do what you need to do. But, before the International Court opens, you must ensure your personal safety is protected. I don’t want you to be kidnapped before the lawsuit even begins.”<br/><br/>After hearing Xiao Jinli’s words, Xu Guochang’s spirit was lifted, and he became very excited. He eagerly asked, “Jinli, do you have a way?”<br/><br/>Could Xiao Jinli really have a solution?<br/><br/>It’s worth noting that even the National Security Department is currently clueless about this matter.<br/><br/>After all, he did stay in Plum Firm Country for more than a decade, did think about learning their advanced technology, and did want to bring that technology back to his motherland to serve the nation.<br/><br/>If put that way, his approach indeed had suspicions of theft, and Plum Firm Country’s evidence was indeed solid.<br/><br/>Xiao Jinli said, “I have my own channels. But before I speak out, everything will be kept confidential for now. Uncle Xu, you have to focus on protecting yourself, and no matter how big an issue is, it’s not as important as your safety, do you understand?”<br/><br/>Xu Guochang nodded, “Yes, I understand. But what about my family?”<br/><br/>Xiao Jinli said, “Your wife and children can live in Xiao Family Village. If there are any other close relatives or friends who might threaten you, they can also temporarily stay in Xiao Family Village. As long as they are in Xiao Family Village, I will ensure their safety, so you won’t have any worries!”<br/><br/>Xu Guochang replied seriously, “Okay, I understand!”\t\t\t\t\t\t</div>", "images": {}, "success": true}