{"id": 319, "url": "https://www.novelhall.com/the-lucky-star-blessing-the-whole-village-32483/15193411.html", "title": "Chapter 319 - Chapter 319: Chapter 319:", "volume": 4, "volume_title": "Volume 4", "body": "<h1>Chapter 319 - Chapter 319: Chapter 319:</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 319: Chapter 319:<br/><br/>Translator: 549690339<br/><br/>Su Yichen refused to invest in Xia Corporation, which angered the other members of the Xia family so much that they wanted to confront him.<br/><br/>“What the hell does Su Yichen think he is, a person neither loved by his mother nor father, who has no right to put on airs in front of us.”<br/><br/>“That’s right. Just because he’s rich doesn’t mean he can disregard family ties. Our grandfather is at least his maternal grandfather, and he can actually piss him off so much that he stays in bed.”<br/><br/>“No, we must find Su Yichen again and make it clear to him that now only our Xia family is his kin, and he cannot stand idly by.”<br/><br/>“Forget it. Even if our grandfather asks him for help, he can make him angry enough to fall into bed, and big brother has already been punched by him. If you go, I expect you’ll be considered merciful if only half mutilated.”<br/><br/>“How dare he. What the hell does he count as? He used to eat and live in our house, and now he’s made a fortune and is enjoying a life of luxury, but wants to abandon us relatives? Don’t even think about it. I’m going to find him right now and tell him that if he wants to leave us behind and live a good life, he must be dreaming!”<br/><br/>Who would have thought that a group of people would go to find Su Yichen in such a furious state, only to be stopped from entering the company’s door?<br/><br/>Then, they found Su Yichen’s residence, but they were intercepted by his bodyguards.<br/><br/>“The boss has ordered that no one from the Xia family is allowed to approach him.”<br/><br/>Publicly intercepted, the members of the Xia family has a bad look on their faces.<br/><br/>Xia Xinbei shouted at the inside, “Su Yichen, you coward, ungrateful thing, come out! If you don’t come out, you’re a cowardly turtle, letting it spread out there, how will people look at you? Oh, the famous business prodigy, the national richest person, who doesn’t even care about his relatives, is that it?”<br/><br/>From the first day Su Yichen moved into the Xia family, Xia Xinbei disliked him. Especially after his grandfather arranged for Su Yichen to become deputy general manager of the company, he was even angrier.<br/><br/>Later, even knowing that Xia Corporation was getting better day by day under Su Yichen’s decision-making, he still couldn’t help believing this person came to rob the Xia family property.<br/><br/>In his opinion, as a person living under another’s roof, Su Yichen should learn to read faces and be grateful.<br/><br/>Without the Xia family, there would be no Su Yichen today.<br/><br/>Well, that’s what everyone in the Xia family thinks. They demand Su Yichen’s gratitude, so he is obligated to save Xia Corporation.<br/><br/>Xia Xinbei continued to curse inside, “Su Yichen, you motherless hybrid, we let you help us because we think highly of you. Don’t take yourself too seriously. Without our Xia family, you are nothing.”<br/><br/>Meanwhile, Su Yichen was in the study of his villa, looking at the flourishing Seven Color Tea Flower.<br/><br/>From eight years ago, as soon as he left the Xiao family, Xiao Jinli gave it to him. Until now, no matter where he goes, he must keep it with him, whether it’s in the villa, at work, or on business trips.<br/><br/>Because with this tea flower, it always felt like the Xiao family was by his side.<br/><br/>One could say, this tea flower is even more precious than his life.<br/><br/>Now, the tea flower was blooming again.<br/><br/>It had been blooming for eight years, and this Seven Color Tea Flower was getting more and more beautiful every year.<br/><br/>Once, a foreign businessman wanted this tea flower and offered three billion for it, but he refused.<br/><br/>This tea flower is no longer just about the flower, but his closest companion.<br/><br/>He had always been waiting for the day when he would be strong enough to take it with him and return to that warm and happy big family.\t\t\t\t\t\t</div>", "images": {}, "success": true}