{"id": 318, "url": "https://www.novelhall.com/the-lucky-star-blessing-the-whole-village-32483/15193410.html", "title": "Chapter 318 - Chapter 318: Chapter 318:", "volume": 4, "volume_title": "Volume 4", "body": "<h1>Chapter 318 - Chapter 318: Chapter 318:</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 318: Chapter 318:<br/><br/>Translator: 549690339<br/><br/>Su Yichen continued, “What do I owe you? What do I owe you? Even if you didn’t send someone to pick me up, I could still come back!”<br/><br/>“You claim that you let me stay in the Xia Family, but do you not know how your descendants have treated me back then at the Xia’s?”<br/><br/>“You kept saying that you care for me, but you turned a blind eye when your descendants bullied me, even insulting me for having a mother who didn’t teach me well. Can the grievances I’ve suffered in the Xia family cover all the injustices I’ve suffered in the past eighteen years?”<br/><br/>“When I went to work at the Xia Corporation, wasn’t it because you wanted to exploit my business talent, just like you used my mother, in order to find another way for the Xia Family and bring the Xia Corporation to the next level?”<br/><br/>“The Xia Family didn’t give birth to me, didn’t raise me, so what do I owe the Xia family?”<br/><br/>Hearing Su Yichen’s words, Xia Weiguo was so angry that he pointed at Su Yichen, his face pale with rage, and he shouted, “Well, look who’s grown wings now, daring to settle accounts with me one by one.<br/><br/>Let me tell you, Su Yichen, what you owe me is the grace of continuation. Without me, there would be no your mother, and without your mother, there would be no you. You were born owing the Xia Family, so as long as I’m alive, you’ll never fully repay the debt!”<br/><br/>Su Yichen’s face turned ugly from Weiguo’s twisted logic, but instead of being angry, he laughed, “So, you mean to say that your own birth is also owed to my great-grandfather, right? But I heard that you haven’t fulfilled your obligation to support your parents, and you let them freeze and starve to death in winter without doing anything. So, is this how you repay the grace of continuation?”<br/><br/>At this point, a mocking look appeared on his face as he said coldly, “Maybe this kind of cold-blooded selfishness is also inherited. Look, am I not learning from you now?”<br/><br/>Xia Weiguo’s face turned pale with anger, his body trembling.<br/><br/>He never expected that the ugly affairs he had tried to cover up would be exposed by this grandson he once exploited.<br/><br/>He shouted angrily, “Unfilial, unfilial! Are you trying to kill me with anger? This is utterly unfilial! Su Yichen, so, you really want to see the Xia Family fall into bankruptcy and remain indifferent, right?”<br/><br/>Su Yichen shrugged and sneered, “Or what, do you want me to waste more money? Your multiple investment failures have drained my money.<br/><br/>I am rich, but my money didn’t come from the wind or picked up from the ground. As long as your investments fail, I have to underwrite the losses.<br/><br/>If the Xia Family can’t run their business properly and their investment projects keep failing, it would be better to let others take over instead of going bankrupt.”<br/><br/>Xia Xinnan, who was punched by Su Yichen, was already furious. After hearing Su Yichen’s words, he roared, “Su Yichen, this is your true intention, isn’t it?<br/><br/>You can’t bear to see the Xia Family thrive, and you want to take over the Xia Corporation, right? You don’t want to help, waiting for the Xia Corporation to go bankrupt, so you can take over, right? So, you are such a cruel and cold-hearted person.”<br/><br/>Su Yichen snorted coldly, “Humph, if I wanted to take over your Xia Corporation, I would have done it a long time ago. Why would I wait till now? I have no interest in your Xia Corporation, but I can’t inject funds into it now either.”<br/><br/>Xia Xinnan’s face changed, and he pleaded, “Ah Chen, if you really don’t help, the Xia Corporation will face bankruptcy if the capital chain is broken for too long. Can you bear to see your grandfather running around at his age?”<br/><br/>Su Yichen raised his hand and said, “If your grandfather has to run around at his age, that’s because you, his descendants, are unfilial. What does this have to do with me?”<br/><br/>Xia Xinnan,\t\t\t\t\t\t</div>", "images": {}, "success": true}