{"id": 311, "url": "https://www.novelhall.com/the-lucky-star-blessing-the-whole-village-32483/15193403.html", "title": "Chapter 311 - Chapter 311: Chapter 311:", "volume": 4, "volume_title": "Volume 4", "body": "<h1>Chapter 311 - Chapter 311: Chapter 311:</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 311: Chapter 311:<br/><br/>Translator: 549690339<br/><br/>Ever since Su Yichen took power and the company away from Su Xiangdong, Su Xiangdong initially cursed at Su Yichen, calling him ungrateful and expressing his resentment and hatred towards him.<br/><br/>However, as time went by, Su Yichen’s prestige in the business world grew, and he increasingly displayed a commanding presence, able to rally support and exert control with ease. Su Xiangdong became more and more panicked, especially as his money began to dwindle, the fear and dread in his heart grew more intense.<br/><br/>Moreover, due to his lack of money and influence, the woman he claimed to love most would argue with him over money every few days. The arguments would be even more frequent due to their beloved son, Su Hanyang.<br/><br/>Life’s changes turned Su Yichen from an initial source of resentment into a cause of strife within the family, with the husband, wife, and son blaming each other for their lack of power and the loss of the Su Corporation. Su Hanyang’s gambling addiction only made matters worse, turning the once happy family of three into bitter enemies filled with resentment.<br/><br/>It wasn’t until Su Hanyang’s unrestrained gambling that Su Xiangdong decided to cripple him.<br/><br/>However, Su Xiangdong was not prepared for what would happen next. As he chased after Su Hanyang to strike him, his dear wife held him back, allowing Su Hanyang to take the iron rod and strike Su Xiangdong in the waist.<br/><br/>“Ahh!” Su Xiangdong screamed in agony.<br/><br/>“Clang!”<br/><br/>With the iron rod falling from Su Hanyang’s hand, his face turned deathly pale as he cried out, “I…I didn’t mean to do it, I…I didn’t mean to!”<br/><br/>After saying that, he ran away, with Lan Yingying unable to stop him.<br/><br/>With no other choice, Lan Yingying called an ambulance.<br/><br/>“What do you mean, my husband Su injured his tailbone and is paralyzed from the waist down?!” Lan Yingying exclaimed with wide eyes, shaking her head in disbelief, “Doctor, did you get it wrong? How can my husband be paralyzed? What am I supposed to do if he’s paralyzed?”<br/><br/>The doctor looked grim and said, “Mrs. Su, we’ve conducted several tests and confirmed that Mr. Su is likely paralyzed from the waist down. Please prepare yourselves mentally.”<br/><br/>“No, no, my husband can’t be paralyzed!” Lan Yingying shook her head, grabbing the doctor’s hand, her eyes filled with pleading, “Doctor, use the best medicine, get the best doctor, please, you must heal my husband.”<br/><br/>The doctor shook his head and said, “Even if we were to invite the best orthopedic specialist, there’s not much they can do for a damaged tailbone. Mrs. Su, this isn’t about money.”<br/><br/>When Su Xiangdong heard from the doctor that he might be paralyzed from the waist down and confined to a wheelchair for the rest of his life, he was shocked, angry, but more than anything, he was overcome with fear and panic.<br/><br/>He said to the doctor, “Doctor, please, invite the best doctor to heal my injury. I can’t spend the rest of my life in a wheelchair. Don’t worry about the money. I have money, or rather, my son Su Yichen has money. Money is not a problem.”<br/><br/>The doctor shook his head and said, “Mr. Su, Mrs. Su has already mentioned this issue. However, your injury is not something that can be simply healed with money. With the current state of medical technology, there is no cure for your injury. But Mr. Su, don’t lose hope. Perhaps after the surgery, there may be a chance for your injury to heal, as long as you cooperate with our treatment.”<br/><br/>Upon hearing that there was hope, Su Xiangdong nodded and said, “Alright, I’ll cooperate! I’ll cooperate!”<br/><br/>Then, the doctor hesitated for a moment and asked, “Mr. Su, can you have your family members pay for the treatment?”<br/><br/>Su Xiangdong,\t\t\t\t\t\t</div>", "images": {}, "success": true}