{"id": 314, "url": "https://www.novelhall.com/the-lucky-star-blessing-the-whole-village-32483/15193406.html", "title": "Chapter 314 - Chapter 314: Chapter 314:", "volume": 4, "volume_title": "Volume 4", "body": "<h1>Chapter 314 - Chapter 314: Chapter 314:</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 314: Chapter 314:<br/><br/>Translator: 549690339<br/><br/>Su Yichen spent two years to seize Su Xiangdong’s Su Corporation, pulling Su Xiangdong down from his high position.<br/><br/>It took him a year to turn Su Xiangdong’s loving family into bitter enemies of each other. Some were imprisoned, some were handicapped, and some were sold.<br/><br/>Su Yichen’s revenge was not to let them die.<br/><br/>Death would be too easy for them.<br/><br/>He would make them live a life worse than death.<br/><br/>After Su Xiangdong became handicapped, he was confined to a wheelchair every day.<br/><br/>He moved back to his old villa, where, well, two nannies took good care of him.<br/><br/>When he defecated on his pants or the bed, he was severely beaten. When he was hungry, he got spoiled rice, and when he was thirsty, he drank dishwashing water.<br/><br/>He complained to Su Yichen, but when Su Yichen visited two hours later, he saw a clean Su Xiangdong.<br/><br/>Su Yichen sneered, “Su Xiangdong, aren’t you well taken care of? Look at your clean clothes, and your meals – seafood, big fish and meat, all your favorite flavors.”<br/><br/>Su Xiangdong’s face turned red with anger, and he shouted, “They… they are just putting on a show for you. Su Yichen, get rid of them and replace them. I don’t want them to serve me anymore, I don’t want them to serve me anymore.”<br/><br/>Su Xiangdong thought Su Yichen wouldn’t agree, but he agreed surprisingly quickly.<br/><br/>He nodded and said, “Fine, you want to change them, then I’ll change them for you.”<br/><br/>Su Xiangdong did not expect Su Yichen to agree, and his prepared curses were stuck in his throat, leaving him choking and turning purple.<br/><br/>Still not believing, he asked, “Did you say you would change them?”<br/><br/>Su Yichen nodded, “Yes, since you’re not satisfied with them, I’ll change them for you. Who let you be my dear dad? I’ll find two other people to come over until you’re satisfied, okay?”<br/><br/>Su Xiangdong, opened his mouth, wanting to say something, but not knowing how to say it.<br/><br/>As Su Yichen left the villa, the corners of his mouth curled.<br/><br/>Did he not know Su Xiangdong’s situation right now?<br/><br/>Of course, he knew.<br/><br/>The 360-degree surveillance CCTV cameras in the villa were not for show.<br/><br/>He enjoyed watching Su Xiangdong’s good days every day.<br/><br/>Receiving Su Xiangdong’s complaint, why did he deliberately arrive two hours late? Of course, it was to give those two time to clean Su Xiangdong up.<br/><br/>“Su Xiangdong, from now on, your days are only getting better, so just enjoy it.”<br/><br/>In the following days, the nannies who served Su Xiangdong were changed batch by batch, but the ones who served him were getting more and more powerful.<br/><br/>In the end, Su Xiangdong called Su Yichen and begged, “Xiao Chen, I don’t want these people to serve me anymore. You… you just bring back the ones who served me at the beginning.”<br/><br/>Those two only beat him when he defecated, but the others took out their anger on him 24 hours a day if something displeased them. Having to eat maggot-infested meat and drink stinking water, these days were not fit for humans, and he couldn’t take it anymore.<br/><br/>Su Yichen granted his wish and brought the first two nannies back to serve him.<br/><br/>However, Su Yichen said, “Su Xiangdong, since it’s your request, I’ll fulfill it. These two people are the ones you requested to be changed back, and if you’re not satisfied with them in the future, I won’t change them for you again. From now on, you can enjoy their service.”<br/><br/>Su Xiangdong’s face turned pale instantly.<br/><br/>A look of regret appeared on Su Xiangdong’s haggard face, and he said, “Xiao Chen, I regret it, can you forgive me?”\t\t\t\t\t\t</div>", "images": {}, "success": true}