{"id": 317, "url": "https://www.novelhall.com/the-lucky-star-blessing-the-whole-village-32483/15193409.html", "title": "Chapter 317 - Chapter 317: Chapter 317:", "volume": 4, "volume_title": "Volume 4", "body": "<h1>Chapter 317 - Chapter 317: Chapter 317:</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 317: Chapter 317:<br/><br/>Translator: 549690339<br/><br/>Xia Weiguo’s domineering and cold words left Su Yichen greatly disappointed, especially when he kept mentioning the help he had given Su Yichen in the past, trying to morally kidnap him and make him help the Xia Family again and again.<br/><br/>Su Yichen stared at his maternal grandfather for a moment, Xia Weiguo’s furious expression clearly visible on his face.<br/><br/>Suddenly, Su Yichen burst into laughter.<br/><br/>His laughter was filled with disappointment, helplessness, and self-mockery.<br/><br/>On his usually calm face, a mocking smile appeared, and he sharply retorted, “Help me? Grandfather, ask yourselves, did you sincerely help me? Or, like Su Xiangdong, were you just after the huge inheritance my mom left for me?”<br/><br/>Since they were all shameless and greedy, he didn’t need to hold back. He decided to call them out on it.<br/><br/>By now, he had grown so strong that nobody could bring him down.<br/><br/>Did Xia Weiguo say those words because he was sure that Su Yichen’s only relatives left were the Xia Family? And hadn’t the Xia Family genuinely helped Su Yichen before?<br/><br/>Hearing Su Yichen’s words, Xia Weiguo and Xia Xinnan’s pupils involuntarily contracted.<br/><br/>They didn’t expect Su Yichen to bring this matter out in the open.<br/><br/>Su Yichen continued, “The truth is, you all know very well that I’m aware of your true motives for getting close to me. But you want to deceive yourselves and kidnap me morally with this family love, making it seem like you genuinely care about me.<br/><br/>Grandfather, the fact that I can still call you my grandfather is solely because you are my mother’s biological father. Once, I sincerely wanted to see you as my grandfather, my family.”<br/><br/>Xia Weiguo’s pupils contracted again.<br/><br/>“What do you mean?” Xia Weiguo sneered, “So, you’re not planning to treat me as your grandfather now?<br/><br/>Su Yichen, whether you consider me your grandfather or not, your mom Xia Zhi Meng is Xia Weiguo’s only daughter, and you are her only son. By blood, by reason, and by law, I, Xia Weiguo, am your grandfather.<br/><br/>Since Xia Zhi Meng is my daughter and I am her father, isn’t it only natural for me to inherit her property?<br/><br/>But your mom, that ungrateful wolf, after I painstakingly raised her to become someone capable, she married someone else and took a huge fortune with her. Even after her death, she didn’t leave me a penny. Did she even treat me as her father?”<br/><br/>Thinking about this, Xia Weiguo became filled with resentment.<br/><br/>At the time, he wanted Xia Zhi Meng to create value for the Xia Family, but she resisted, found a man to marry, and left with a huge fortune.<br/><br/>“Moreover, when you fell into Su Xiangdong’s trap and disappeared, it was me who sent people to bring you back, let you live and eat in the Xia Family home, and allowed you to work at Xia Corporation, giving you the ability to seize control of Su Corporation. This kindness alone is enough for you to owe the Xia Family for a lifetime. If it weren’t for me, where would you be today? Hmph! White-eyed wolves give birth to Little White-eyed wolves after all.”<br/><br/>Since things had been brought to light, Xia Weiguo didn’t bother to beat around the bush anymore.<br/><br/>Upon hearing Xia Weiguo’s cold words, Su Yichen’s hands clenched into fists, veins bulging as he wanted to punch him in the face. Fortunately, he didn’t lose his reason.<br/><br/>“Bam!”<br/><br/>Xia Xinnan got punched heavily in the face.<br/><br/>That’s right.<br/><br/>Su Yichen couldn’t punch Xia Weiguo in the face, but he could hit Xia Xinnan’s.<br/><br/>Who could blame him since Xia Xinnan was Xia Weiguo’s grandson, his cousin, and technically his peer? There was no mistake in punching him.<br/><br/>Seeing his most beloved grandson being hit, Xia Weiguo was first taken aback, then he roared, “Su Yichen, you damn brat, how dare you hit your cousin!?”<br/><br/>Su Yichen stretched his muscles and sneered, “Why not?”\t\t\t\t\t\t</div>", "images": {}, "success": true}