{"id": 312, "url": "https://www.novelhall.com/the-lucky-star-blessing-the-whole-village-32483/15193404.html", "title": "Chapter 312 - Chapter 312: Chapter 312:", "volume": 4, "volume_title": "Volume 4", "body": "<h1>Chapter 312 - Chapter 312: Chapter 312:</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 312: Chapter 312:<br/><br/>Translator: 549690339<br/><br/>Lan Yingying demanded money from Su Yichen under the pretext of Su Xiangdong’s treatment.<br/><br/>However, Su Yichen had already found out the cause of Su Xiangdong’s injury, so he clearly refused, saying, “Lady Su, it was your precious son who injured Su Xiangdong, so naturally, your precious son should bear the responsibility.”<br/><br/>At this point, Su Yichen thought of something else, and said, “Oh, right, Su Hanyang ran away after beating his father, and now there’s no trace of him. How about I show mercy and find him to get the money and take care of Su Xiangdong?”<br/><br/>Upon hearing this, Lan Yingying’s whole face turned green.<br/><br/>She twisted her expression, and her eyes filled with resentment as she gritted her teeth and said, “No need.”<br/><br/>After repeatedly asking Su Yichen for money and being constantly urged by the hospital to pay the fees, Su Xiangdong’s temper had become even more irritable since his injury. He would curse at Lan Yingying whenever he saw her and demanded her to find his rebellious son Su Hanyang, saying he must cripple him to be worthy of his injury this time.<br/><br/>Lan Yingying couldn’t stand the violent and oppressive life anymore. After another quarrel with Su Xiangdong, she stopped going to the hospital.<br/><br/>She even took the last bit of money from home and ran away, not even caring about her son Su Hanyang.<br/><br/>On the tenth attempt to contact Lan Yingying and Su Hanyang, the hospital had no choice but to call Su Yichen.<br/><br/>After Su Yichen arrived at the hospital, he directly said to Su Xiangdong, “Su Xiangdong, I can pay for your treatment, but you need to report to the police that Su Hanyang injured you!”<br/><br/>With an ugly expression on his face, Su Xiangdong said, “Report to the police? Wouldn’t Su Hanyang be arrested then?”<br/><br/>With his injuries, he would be sentenced to at least a few years.<br/><br/>After all, Su Hanyang was the son he had loved dearly, so even though he was resentful of Su Hanyang’s misbehavior and gambling, he still couldn’t bear to let his beloved eldest son go to prison.<br/><br/>Su Yichen raised the corner of his mouth and said mockingly, “Those are my conditions. If you can accept them, let the doctor call me.”<br/><br/>Having said that, he didn’t care about Su Xiangdong’s unhappy expression.<br/><br/>Watching his retreating figure, Su Xiangdong gritted his teeth and said, “He’s your brother, your own brother, connected by blood. Must you be so ruthless?”<br/><br/>Su Yichen paused and said indifferently, “It depends on your choice as a father!”<br/><br/>What he wanted was not brothers killing each other but father and son shedding blood!<br/><br/>He believed that Su Xiangdong’s choice wouldn’t disappoint him!<br/><br/>Because they were all selfish people!<br/><br/>As expected, Su Yichen received a call from the hospital in less than half a day!<br/><br/>Su Yichen’s lips curved into a slight smile.<br/><br/>Ha, how close and loving the family used to be!<br/><br/>Now, one of them took the money and ran, one injured someone and hid, and one was seriously injured and hospitalized!<br/><br/>Ha, how interesting!<br/><br/>Su Xiangdong immediately received the best treatment!<br/><br/>However, what he didn’t expect was that during his treatment, his once most beloved eldest son had been crippled with one hand, one leg, and blinded in one eye due to gambling debts, turning into a complete waste.<br/><br/>Even so, it was a fact that he had injured Su Xiangdong, and the case had already been filed, so the government officials had to arrest him.<br/><br/>Therefore, after hiding for more than half a month, Su Hanyang was arrested and sentenced to seven years in prison since the victim did not want to mediate.<br/><br/>After learning that Su Xiangdong had reported him, Su Hanyang started cursing again.<br/><br/>If he had not been caught, he probably would have gone to the hospital and fought Su Xiangdong to death.<br/><br/>When Su Xiangdong learned that Su Hanyang had lost one hand, one leg, and one eye, his eyes filled with hatred and resentment. He looked at Su Yichen and said bitterly, “Su Yichen, how can your heart be so cruel that you don’t even spare your own siblings?”\t\t\t\t\t\t</div>", "images": {}, "success": true}