{"id": 315, "url": "https://www.novelhall.com/the-lucky-star-blessing-the-whole-village-32483/15193407.html", "title": "Chapter 315 - Chapter 315: Chapter 315:", "volume": 4, "volume_title": "Volume 4", "body": "<h1>Chapter 315 - Chapter 315: Chapter 315:</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 315: Chapter 315:<br/><br/>Translator: 549690339<br/><br/>After taking revenge on Su Xiangdong’s family of three, Su Yichen spent three years transforming Su Corporation from a major enterprise in Capital City to a top-tier large-scale enterprise in the country, ultimately becoming the youngest and richest person nationwide.<br/><br/>In the CEO’s office of Su Corporation, the secretary was reporting to Su Yichen, “Chairman, Old Master Xia has come to see you again. What should we do?”<br/><br/>The “old master” the secretary was referring to was Su Yichen’s maternal grandfather, Xia Weiguo.<br/><br/>Recently, the Xia Corporation invested in a new project and it failed, causing a break in their capital chain. Now, they desperately need an influx of funds to keep Xia Corporation running and to avoid bankruptcy.<br/><br/>However, many capable enterprises do not hold a favorable view of Xia Corporation. After risk assessments, no company is willing to inject funds. However, some companies seized the opportunity to attempt to acquire Xia Corporation, though the Xia Family was unwilling to do so.<br/><br/>Therefore, they wanted Su Yichen to inject funds into Xia Corporation.<br/><br/>However, this was not the first time Xia Corporation faced investment failures. Over the past few years, they failed in several major projects, resulting in broken capital chains. Each time, it was Su Yichen injecting funds and saving Xia Corporation.<br/><br/>It was precisely because Su Yichen was underwriting the losses that any time Xia Corporation saw a significant project, regardless of the size of the assessed risk, they would directly invest in it.<br/><br/>Su Yichen leaned his head against the backrest of his chair, stroked his forehead with his hand, and closed his eyes. Then, he opened them sharply and glanced around the room indifferently, tapping his luxury pen on the desk with one hand.<br/><br/>After a moment, he said calmly, “Please show Old Master Xia in.”<br/><br/>The secretary replied respectfully, “Understood.”<br/><br/>After a while, Old Master Xia, leaning on his cane and assisted by his grandson, Xia Xinnan, came to Su Yichen’s office.<br/><br/>As soon as he entered the office, Old Master Xia’s face darkened and he angrily scolded, “Su Yichen, have you grown too proud? Even wanting to see you is being refused outside the door. Have you forgotten that it was with the help of me and the Xia Family that you became the chairman of Su Corporation? But you, after seizing Su Corporation and becoming the chairman, have committed such ungrateful acts. Su Yichen, do you have no conscience?”<br/><br/>Upon hearing this, Su Yichen’s expression turned cold. “I’m ungrateful?” he said emotionlessly. “If I were truly ungrateful, I wouldn’t have injected funds during your investment failures in the last two years to help revive Xia Corporation.”<br/><br/>“First time, 200 million, second time 500 million, the third time, 1.2 billion… What is this, the eighth or ninth time that I need to inject tens of billions of funds to save your investment failures?”<br/><br/>“Grandfather, I believe that I have completely repaid the Xia Family’s kindness, and I owe you nothing. So what is the meaning of trying to hold onto the past now?”<br/><br/>“At the beginning, Xia Corporation had a total of just over a hundred billion, and the funds I’ve invested in saving Xia Corporation have already reached more than 150 billion. Grandfather, even with excessive gratitude, I should have repaid you by now.”<br/><br/>Hearing Su Yichen’s words, Xia Weiguo’s face turned ugly instantly, and Xia Xinnan’s face became even more embarrassed, with an awkward expression.<br/><br/>After a moment, Xia Weiguo snorted coldly and said, “Su Yichen, we are relatives after all, and we are a family. Shouldn’t you help your family when they are in trouble? Or do you really want to watch Xia Corporation disappear in Capital City with your own eyes?”<br/><br/>Su Yichen, This maternal grandfather has no shame left.\t\t\t\t\t\t</div>", "images": {}, "success": true}