{"id": 313, "url": "https://www.novelhall.com/the-lucky-star-blessing-the-whole-village-32483/15193405.html", "title": "Chapter 313 - Chapter 313: Chapter 313:", "volume": 4, "volume_title": "Volume 4", "body": "<h1>Chapter 313 - Chapter 313: Chapter 313:</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 313: Chapter 313:<br/><br/>Translator: 549690339<br/><br/>After Lan Yingying married Xia Zhi Meng, who had been driven to death by Su Yichen, she then married Su Xiangdong and lived a life of a rich woman, waited on by servants and bodyguards.<br/><br/>The twenty plus years of luxury and privilege robbed her of the ability to be self-sufficient.<br/><br/>After she took Su Xiangdong’s last bit of money, she planned to dress herself up in an attempt to be involved with rich people again, especially those rich men who were single.<br/><br/>However, beauty fades with age.<br/><br/>Years ago, when the Su family was wealthy, she maintained herself so well that although she was in her fifties, she looked like she was in her early thirties.<br/><br/>But in recent years, without money to splurge, she inevitably began to show her age of over fifty. Her temples were graying, her face was full of wrinkles, and her body was hunched. What rich, powerful man would take notice of an old hag like her?<br/><br/>In the end, she had to live in a small alley, selling herself to men who were ugly, smelly, poor, and had long separated from their wives.<br/><br/>Su Yichen fulfilled his promise. He paid for Su Xiangdong’s treatment and even invited top experts for a consultation.<br/><br/>However, Su Xiangdong’s injury could only be relieved, not healed, and he was destined to sit in a wheelchair for the rest of his life.<br/><br/>Su Xiangdong had a hard time accepting this. He roared at Su Yichen, “You unfilial son! Didn’t you hire the best experts to treat me? Otherwise, why isn’t this minor injury getting better? You must not be paying enough. Get me the best expert now, or else you won’t hear the end of it!”<br/><br/>Su Yichen looked at his frantic and pitiable father, a mocking expression on his face. He said coldly, “I’ve paid for your treatment, hired experts for you, and even employed two nurses to take care of you. But your injuries went too deep. You’re doomed to be in the wheelchair for the rest of your life.”<br/><br/>He paused briefly before continuing, “But don’t worry, you are indeed my biological father. Even though twenty years ago, you cheated and betrayed my mother, causing her to jump off the building and die, and even leading to my six-month disappearance, our blood relation doesn’t change. I’ll make sure you’re taken care of.<br/><br/>“I bought back that villa of yours so you can spend your remaining days there. After all, that place witnessed your love with my mother, and also the love with Lan Yingying that drove my mother to her death.”<br/><br/>Su Xiangdong’s face changed from red to green. He spat out angrily between his teeth, “So, you’re taking revenge on me, aren’t you? Su Yichen, no matter what, I am your real father. The blood running in your veins is mine. So, you want revenge? Just kill me then, avenge your mother!”<br/><br/>Su Yichen’s fists clenched tight, his sharp gaze fixed on Su Xiangdong. He said coldly, “Kill you? Ha, I would have to sacrifice my life for you then. Do you think you’re worth it? Su Xiangdong, don’t you know that the best revenge is to make the enemy wish they were dead? So, enjoy the rest of your days.”<br/><br/>Then, he leaned closer to Su Xiangdong’s ear and said in a cold voice, “Su Xiangdong, aren’t you curious how I’m still alive despite you hiring the best killer? And where are those kidnappers, why can’t you contact them?”<br/><br/>Su Xiangdong’s pupils contracted in surprise.<br/><br/>Su Yichen continued, “The four kidnappers are dead, so I survived. So, for the upcoming days, live well. How could I avenge you if you didn’t live, right?”<br/><br/>Su Xiangdong’s eyes were full of shock, fear, and terror.\t\t\t\t\t\t</div>", "images": {}, "success": true}