{"id": 310, "url": "https://www.novelhall.com/the-lucky-star-blessing-the-whole-village-32483/15193402.html", "title": "Chapter 310 - Chapter 310: Chapter 310:", "volume": 4, "volume_title": "Volume 4", "body": "<h1>Chapter 310 - Chapter 310: Chapter 310:</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 310: Chapter 310:<br/><br/>Translator: 549690339<br/><br/>In order to repay Su Hanyang’s debts, Su Xiangdong and his wife became more and more impoverished. Without any help from Su Yichen, they had no choice but to sell their villa to pay off the debts and rent a house in an old residential area.<br/><br/>From a spacious and bright luxury villa, they suddenly found themselves cramped in an old house of just over a hundred square meters. The house was old and dimly lit, making it uncomfortable for the family of three who were used to living luxuriously.<br/><br/>Thus, the family began to blame one another.<br/><br/>Lan Yingying blamed Su Xiangdong for being too soft-hearted and keeping that “wolf cub” in the first place, only to be bitterly bitten back by him now.<br/><br/>Su Xiangdong, on the other hand, cursed Su Hanyang for being useless, not being able to measure up to Su Yichen, and for gambling, blaming their current plight entirely on Su Hanyang.<br/><br/>If he hadn’t gambled, the money they had saved before would have been enough for them to live a good life, and they might even have been able to use that money to rise again and bring down Su Yichen.<br/><br/>Now, he was filled with regret.<br/><br/>At the beginning, he should have listened to Su Yichen’s advice, break Su Hanyang’s hands and legs, so that he couldn’t continue gambling.<br/><br/>Anyway, even with Su Hanyang being useless, he still had another son.<br/><br/>Now, because he had chosen the eldest son, the younger one ignored and neglected him.<br/><br/>Su Hanyang, on the other hand, blamed them for keeping Su Yichen in the first place, saying that if it weren’t for him, there would have been no room for Su Yichen in the Su Corporation.<br/><br/>As long as Su Yichen was dead, no matter whether it was the Su Corporation or his real mother’s inheritance, everything would go to Su Hanyang.<br/><br/>With that money, losing one or two hundred million wouldn’t be a problem, let alone ten or even a hundred billion. But now, what should have belonged to him had become Su Yichen’s.<br/><br/>Su Yichen, that ungrateful wolf, didn’t appreciate their kindness at all.<br/><br/>Subsequently, Su Hanyang began to curse and threaten Su Xiangdong and his wife, saying that they were incompetent and had brought calamity upon themselves. He threatened them that if they didn’t help him repay his debts, he wouldn’t support them in their old age and so on. This made Su Xiangdong want to send him back to the womb.<br/><br/>Over the past five years, Su Hanyang continued to gamble.<br/><br/>But people in the gambling world knew that Su Hanyang no longer had any family fortune, no money, so no one was willing to gamble with him.<br/><br/>However, Su Hanyang’s gambling addiction remained unchanged. When the larger gambling establishments wouldn’t take him, he went to smaller ones.<br/><br/>Despite the difficulty of making ends meet, Su Hanyang still managed to lose tens or even hundreds of thousands in small gambling establishments, leaving Su Xiangdong and his wife penniless.<br/><br/>Now, Su Yichen only gave Su Xiangdong a monthly retirement fee of six hundred. As for his stepmother, Lan Yingying, and Su Hanyang, he had no obligation or responsibility to support them.<br/><br/>After being kicked out of the Su Corporation, Su Xiangdong went to find a job and went to work. However, his reputation in the business world and his relationship with Su Yichen were well-known.<br/><br/>Everyone now knew that Su Xiangdong had a lover and a son before marrying Su Yichen’s real mother. Not only did he deceive her into marriage, but he also drove Su Yichen’s real mother, Xia Zhi Meng, to death.<br/><br/>At the same time, Su Xiangdong had a lot to do with Su Yichen’s disappearance for half a year.<br/><br/>With such a deep-seated hatred for killing his own mother, Su Yichen must want revenge.<br/><br/>Thus, people didn’t dare to offend the current head of the household, Su Yichen, and naturally wouldn’t offer Su Xiangdong a job either.<br/><br/>Su Xiangdong could only work as an ordinary employee in a small company, with a monthly salary of two to three thousand.<br/><br/>With the salary and the living expenses provided by Su Yichen, it was barely enough for the family to live an ordinary life.<br/><br/>But even so, Su Hanyang still gambled, which infuriated Su Xiangdong to the point where he really picked up an iron rod and chased after Su Hanyang to beat him.\t\t\t\t\t\t</div>", "images": {}, "success": true}