{"id": 316, "url": "https://www.novelhall.com/the-lucky-star-blessing-the-whole-village-32483/15193408.html", "title": "Chapter 316 - Chapter 316: Chapter 316:", "volume": 4, "volume_title": "Volume 4", "body": "<h1>Chapter 316 - Chapter 316: Chapter 316:</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 316: Chapter 316:<br/><br/>Translator: 549690339<br/><br/>Initially, Xia Weiguo exploited his daughter, showing that natural affection became insignificant in the face of profit; it turned into an accessory, a tool that can be used.<br/><br/>Years ago, when Xia Zhi Meng failed to serve as his tool for strengthening the Xia Corporation, he developed a deep resentment towards his daughter. Later, Xia Zhi Meng committed suicide, leaving all her inheritance to her only son, leaving nothing for her elderly father. Her actions triggered his outrage.<br/><br/>He was furious not because Xia Zhi Meng had taken her own life, creating a one-way solution by jumping off a building, leaving a child behind to suffer in a world void of an affectionate mother. Instead, he was livid because Xia Zhi Meng had failed to give any regard to him, her old father.<br/><br/>As a result, he directed his resentment towards the only son of his daughter.<br/><br/>He had no interest in caring for his three-year-old grandson, Su Yichen, who was then helpless and alone.<br/><br/>After neglecting the child for a period, he began devising ways to obtain Xia Zhi Meng’s inheritance.<br/><br/>While others might not know, he was well aware that his daughter must have left behind a significant amount of inheritance. However, according to what he heard, all these assets were left to Su Yichen, to be inherited only when he turned eighteen.<br/><br/>So, taking advantage of his young age, he thought of bringing him to the Xia Family. For the wealthy Xia Family, raising another child was just like having an extra pair of chopsticks; it was nothing. And when the child grew up, he planned to coax him into willingly giving up the inheritance.<br/><br/>In fact, that’s precisely what the family trio of Su Xiangdong had done.<br/><br/>It was just that Su Xiangdong’s family managed to snatch the child away a step ahead of Xia Weiguo.<br/><br/>After all, since Su Yichen was born, he had only met Xia Weiguo once or twice. His impression of the Xia Family was extremely negative, especially because he was bullied by his so-called cousins. Yet his maternal grandfather only criticized his mother and him.<br/><br/>Besides, regardless of whether Su Xiangdong had betrayed anyone before, at least before his betrayal of Xia Zhi Meng, he provided Su Yichen with a happy and stable home; he had experienced his father’s love.<br/><br/>Therefore, when Xia Weiguo came to the Su Family to take Su Yichen away, he didn’t have any emotional ties, the Su Family had the money. Why would Su Yichen leave with him?<br/><br/>Besides, his intention of taking Su Yichen was not pure, and together with Su Xiangdong’s brainwashing, Xia Weiguo gave up on Su Yichen.<br/><br/>Of course, they might have given up on Su Yichen, but that didn’t mean they were giving up on his mother’s inheritance.<br/><br/>The Xia Family went through various tactics, trying to seize Xia Zhi Meng’s inheritance without going through Su Yichen.<br/><br/>However, the lawyer appointed by Xia Zhipan was her good friend and a man who secretly loved her. No one could make him betray his promise. Because of him, he managed to preserve all his mother’s inheritance until Su Yichen turned eighteen.<br/><br/>The only familial affection Xia Weiguo showed towards Su Yichen was returning him to the Xia Family after he went missing and let him stay there before offering him a role in the Xia Corporation. This move then acted as a springboard for him to take over the Su corporation successfully.<br/><br/>With that favor, when Xia Corporation first encountered significant project failure, Su Yichen injected funds to maintain the corporation’s normal operations confidently.<br/><br/>However, human desire is insatiable.<br/><br/>Because of Su Yichen’s act of covering the losses, the Xia Corporation’s appetite became much more significant.<br/><br/>Looking at his indifferent grandson, Xia Weiguo said emotionlessly, “Su Yichen, let me tell you, with the help that the Xia family has given you in the past, you will never be able to repay us in this lifetime! Therefore, with this current situation, whether you are willing or not, you have to help us. If you refuse, then don’t acknowledge me as your grandfather, and don’t acknowledge your relation to the Xia family!”\t\t\t\t\t\t</div>", "images": {}, "success": true}