{"id": 328, "url": "https://www.novelhall.com/the-lucky-star-blessing-the-whole-village-32483/15193420.html", "title": "Chapter 328 - Chapter 328: Chapter 328:", "volume": 4, "volume_title": "Volume 4", "body": "<h1>Chapter 328 - Chapter 328: Chapter 328:</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 328: Chapter 328:<br/><br/>Su Yichen and Xiao Junxuan went downstairs together, and the Xiao family members, including several old gentlemen, were sitting in the living room waiting for them.<br/><br/>The old gentlemen had known about the connection between Su Yichen and the Xiao family for a few years.<br/><br/>They also knew that the Xiao family had already treated Su Yichen as another one of their children.<br/><br/>However, they didn’t quite agree with Su Yichen not coming to visit the Xiao family for eight years.<br/><br/>Perhaps at first, you went back for revenge and were afraid of getting the Xiao family and Xiao Family Village involved, so not staying in touch with them could be excused.<br/><br/>But in the following years, you became the wealthiest person with money and power, and were already very strong. So why didn’t you contact them?<br/><br/>Moreover, as someone who could become the wealthiest person, there was no way they wouldn’t know about the few old men in Xiao Family Village. Who would dare to harm them?<br/><br/>Of course, since the Xiao family members didn’t seem to mind, the old gentlemen wouldn’t interfere too much. But privately, they felt some admonition was necessary.<br/><br/>As soon as the makeup-free Su Yichen went downstairs, he saw a room full of people. When his gaze fell on the stern-looking elderly men, his expression paused for a moment, and he appeared a bit nervous.<br/><br/>If they were just sitting there as old cadres, it wouldn’t be enough to make him nervous. But the fact that these old gentlemen were sitting there as Xiao family members made him feel somewhat restrained.<br/><br/>After he came downstairs, the ladies’ expressions were excited, their eyes slightly red as they looked at Su Yichen.<br/><br/>Xiao’s mother looked at Su Yichen and with tears in her eyes, she smiled and said, “Xiao Quan, it’s been years since we last met. You’ve grown even more handsome and stronger.”<br/><br/>The maternal grandmother laughed and said, “Yeah, back then, you were tall but not very meaty. Now, it’s obvious that you’ve gained some muscle. You look even more mature than before.”<br/><br/>Su Yichen, who usually appeared cold and unsmiling in front of others, now showed a gentle smile and said, “Auntie, maternal grandmother, I am older now, so I must be more mature than before.”<br/><br/>Back then, he was only 18 years old, and had just reached adulthood.<br/><br/>Now, he was 26 years old and already a grown man.<br/><br/>Next, Su Yichen faced the room full of people and said one by one, “Grandfather, Grandma, maternal grandfather, maternal grandmother, Uncle Auntie, I’m sorry for making you worry about me all these years.”<br/><br/>“Hmm, as long as you’re doing well, that’s all that matters.” Grandma Xiao smiled and said, “In just a few years, Xiao Quan, you’ve become a famous figure. We are proud of you.”<br/><br/>“Yeah, you’ve become the National Richest Person, and we are all proud of you.”<br/><br/>The others echoed their agreement.<br/><br/>“We always thought your background was not simple, but who would have thought it would be this extraordinary, directly becoming the richest man in the country. To see you, we’d have to watch television, read newspapers, and watch videos.” Xiao Father exclaimed, “I really don’t know how your mind works, to be such a brilliant businessman.”<br/><br/>“Yeah, it’s really amazing.” The grandfather nodded and said, “You’re only 26 now, and when did you become the wealthiest person, at 22 or 23 years old?”<br/><br/>“Grandfather, it was at 22 years old.” Xiao Junxuan reminded him.<br/><br/>“Twenty-two years old.” Grandpa Xiao exclaimed, “Many young people of this age are still college students. Xiao Quan has achieved a miracle.”<br/><br/>Becoming the wealthiest person at twenty-two, no one could ever imagine this.<br/><br/>Xiao Junxuan nodded in agreement, “That’s right, in today’s universities, if a student can make a million, they are already considered very business savvy. But Xiao Quan has made several hundred billion. It’s like using money as paper.”<br/><br/>“Haha, indeed!”\t\t\t\t\t\t</div>", "images": {}, "success": true}