{"id": 325, "url": "https://www.novelhall.com/the-lucky-star-blessing-the-whole-village-32483/15193417.html", "title": "Chapter 325 - Chapter 325: Chapter 325:", "volume": 4, "volume_title": "Volume 4", "body": "<h1>Chapter 325 - Chapter 325: Chapter 325:</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 325: Chapter 325:<br/><br/>Translator: 549690339<br/><br/>Everyone was quite shocked once they established that the old man following Xiao Jinli was indeed Xiao Siqian.<br/><br/>The crowd gave curious looks at Su Yichen’s disguise.<br/><br/>“Wow, what makeup technique is this? It’s truly amazing!”<br/><br/>“To my mind, it’s Little Fanfan who has the keen eye to detect the fake old man, Xiao Quan.”<br/><br/>“Yes, yes, Little Fanfan indeed has a keen eye. His eyes are comparable to Sun Wukong’s Fiery Eyes, Golden Gaze. Faced with such a realistic makeup job that had us seeing a completely different person, Little Fanfan saw right through it.”<br/><br/>“Little Fanfan, how in the world did you figure out it was Big Brother?”<br/><br/>Jiang Yifan tipped his Little Head saying, “That’s exactly how I worked it out.”<br/><br/>Everyone,<br/><br/>With his old man makeover, Su Yichen suppressed his internal sorrow and loss, feigning curiosity as he asked, “Jinli, is this child yours?”<br/><br/>Xiao Jinli shook her head and explained, “No. He claimed me as his since our flight back from Capital City.”<br/><br/>Here, she paused slightly, then continued, “This child is quite the actor. He latched onto me on the plane, calling me a home-wrecker.”<br/><br/>Su Yichen,<br/><br/>Looking at the fine, beautiful girl of around eighteen or nineteen, and imagining the scene on the plane where the child was labeling her a home-wrecker, he found it absurdly funny.<br/><br/>Suppressing his laughter, Su Yichen questioned with curiosity, “Is the child from Capital City? Who are his parents? Do they know he is here?”<br/><br/>Before Xiao Jinli could respond, Jiang Yifan quickly answered, “No! I’m not from Capital City.”<br/><br/>“If not from Capital City, then where are you from?” Xiao Jinli asked doubtfully, “Didn’t you say at the beginning that you were from Capital City?”<br/><br/>Su Yichen questioned with perplexity, “Little Sister Jinli, you mean to say you didn’t look into his parents?”<br/><br/>Xiao Jinli shook her head and said, “I didn’t. However, we did report to the police once we got off the plane. The Yamen officials said they would contact us once they found his parents. However, it’s been three to four months now and there’s been no word.”<br/><br/>Su Yichen declared right away, “How about I have someone look into it?”<br/><br/>He then asked, “Little friend, what’s your name?”<br/><br/>“Hmph,” Jiang Yifan turned his Head away, “I’m not telling you!”<br/><br/>Xiao’s mother at this point mentioned, “His name is Jiang Yifan. Xiao Quan, if you have contacts in Capital City, then please help him locate his parents.”<br/><br/>Hearing this, Jiang Yifan got a bit agitated, “No, I don’t want him searching for my parents. My… my parents abandoned me. I don’t want to find them.”<br/><br/>Everyone,<br/><br/>This child, why does he get so worked up at the mention of finding his parents?<br/><br/>Su Yichen said, “Auntie, as long as the child is from Capital City and has a name, I can arrange for someone to find his parents!”<br/><br/>Upon hearing this, Jiang Yifan became even more outraged. He shouted at Su Yichen, “I don’t want to find my parents, I don’t want you meddling in my affairs. I don’t want to find my parents, I don’t want to find my parents!”<br/><br/>Seeing Jiang Yifan so wrought, everyone looked at him with mixed feelings of confusion and empathy.<br/><br/>Xiao’s mother picked up the child and said, “Alright, alright, we won’t look for them anymore, don’t be angry.”<br/><br/>Jiang Yifan nestled in Xiao’s mother’s arms, grumbling, “Grandma, I don’t like my parents. They often beat me, scold me, and they don’t feed me. They’re terribly nasty.”<br/><br/>Looking at Jiang Yifan who was well-fed and cared for, Xiao Jinli expressed her doubts.\t\t\t\t\t\t</div>", "images": {}, "success": true}