{"id": 326, "url": "https://www.novelhall.com/the-lucky-star-blessing-the-whole-village-32483/15193418.html", "title": "Chapter 326 - Chapter 326: Chapter 326:", "volume": 4, "volume_title": "Volume 4", "body": "<h1>Chapter 326 - Chapter 326: Chapter 326:</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 326: Chapter 326:<br/><br/>Translator: 549690339<br/><br/>Because Jiang Yifan wasn’t happy, Mother Xiao and others stopped discussing the matter of finding his parents.<br/><br/>Su Yichen’s heart was filled with happiness, but he didn’t know exactly why he was so happy.<br/><br/>Xiao Jinli glanced at his aged appearance and laughed, saying, “Brother Little Quan, go remove your makeup! Let everyone see your real face. Mom and Dad are so curious about your look after becoming the wealthiest person.”<br/><br/>Su Yichen nodded, “Okay, I’m going to do it now.”<br/><br/>Mother Xiao took out her cellphone and laughed, “Let me take a picture of you first. Haha, I wonder if this is how Little Quan will look when he gets old.”<br/><br/>After laughing, she said, “Little Quan, your old room has always been reserved for you. Yesterday, when Xiao Bao said you were coming back, I cleaned up the room and changed the quilt.”<br/><br/>Upon hearing Mother Xiao’s words, Su Yichen’s eyes reddened again.<br/><br/>He was touched and his heart was warmed.<br/><br/>Is this the feeling of coming home? Is this true affection?<br/><br/>No matter how far the children go or how long it takes, when they come back home, they always have their own room with clean, sun-dried quilts waiting for them—warm and happy.<br/><br/>Xiao Junxuan carried Su Yichen’s suitcase and brought him back to their old room.<br/><br/>In eight years, other families in Xiao Family Village had built new houses and beautiful small western-style buildings, but the Xiao Family’s house remained the same, and so did its people.<br/><br/>It’s so good that his uncles, aunts, and grandparents were all still here.<br/><br/>After arriving in his room, Su Yichen immediately removed his makeup.<br/><br/>Xiao Junxuan was very excited by Su Yichen’s side. “Little Quan, I always thought you weren’t an ordinary person. There’s no ordinary person with so many business ideas like you. I never expected that in just a few years, you would become the National Richest Person. Haha… I never dreamed that one day, I, Xiao Junxuan, would be a sworn brother of the richest man in a country.”<br/><br/>Su Yichen laughed, “Brother Xuan, stop teasing me.”<br/><br/>“No, Little Quan, I’m not making fun of you.” Xiao Junxuan immediately waved his hand. “I am really excited, happy, and proud. The National Richest Person! Everyone is estimating how much assets you have. Some say you have 150 billion, some say 200 billion, and even some say 400 billion. Little Quan, I am also very curious, how much money does this National Richest Person have?”<br/><br/>Su Yichen laughed, “Actually, everyone is exaggerating. How much personal wealth can I have? I consider that money belonged to the whole company’s employees, and those billions are all total assets. There is not much cash flow, though.”<br/><br/>Xiao Junxuan wasn’t convinced, “Little Quan, just tell me, how much are your total assets?”<br/><br/>Su Yichen smiled and said, “Actually, my company’s total assets are now around 680 billion, I guess.”<br/><br/>“What?” Xiao Junxuan was shocked. “680 billion, how can it be so much? You know, our Lu Xian Group only has more than 100 billion and is already a large company in Ganjiang City. Gosh, comparing people really kills one’s spirit. It turns out that talent is needed for everything, including business. In the past, my dad and I thought you had a great business mind, and it turns out it’s true. Brother, you really are getting rich! 6800 billion is a number I can’t even dare to think about, but it’s my brother’s wealth!”\t\t\t\t\t\t</div>", "images": {}, "success": true}