{"id": 324, "url": "https://www.novelhall.com/the-lucky-star-blessing-the-whole-village-32483/15193416.html", "title": "Chapter 324 - Chapter 324: Chapter 324:", "volume": 4, "volume_title": "Volume 4", "body": "<h1>Chapter 324 - Chapter 324: Chapter 324:</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 324: Chapter 324:<br/><br/>Translator: 549690339<br/><br/>Half an hour later, Xiao Jinli picked up Su Yichen, who was disguised as an average old man.<br/><br/>Upon seeing Su Yichen’s appearance, Xiao Jinli broke out into laughter once again.<br/><br/>“Haha, Brother Little Quan, you can’t possibly be thinking of going home looking like this, can you?” Xiao Jinli said between laughter, “With this look, I’m not sure if our parents will be able to recognize you.”<br/><br/>The wrinkles on Su Yichen’s face formed an expression of helplessness. He laughed and said, “To outsiders, I can only present myself with this disguise. However, at home, I am Xiao Siqian, a member of the Xiao family.”<br/><br/>Xiao Jinli nodded, “Hmm. Alright, let’s go.”<br/><br/>On the way home, they ran into other people from Xiao Family Village. Everyone greeted Xiao Jinli, but curious looks fell on Su Yichen.<br/><br/>Though they were curious, they did not pry too much.<br/><br/>After all, Xiao Jinli occasionally brought some important guests over. These guests were mostly either rich or noble. They didn’t want to offend these esteemed guests by asking too many questions.<br/><br/>Seeing the smiling faces of the Xiao Village residents, who were always so warm-hearted, Su Yichen, who had lived in Xiao Family Village for half a year, felt very happy.<br/><br/>Eight years had passed, yet the villagers’ cheerful and sincere disposition remained unchanged.<br/><br/>Eight years ago, Xiao Family Village was poor and impoverished, but the villagers were always smiling – they were optimistic, proactive, and in great spirits.<br/><br/>Eight years later, every family in the village had become wealthy, yet their demeanor remained the same.<br/><br/>Even disguised as an old man, Su Yichen greeted them courteously in return.<br/><br/>In a short while, Xiao Jinli had brought Su Yichen back to the Xiao Family home.<br/><br/>Everyone knew that Xiao Jinli had gone to fetch Xiao Siqian, but they saw her return with an old man, which left everyone puzzled.<br/><br/>However, before anyone could voice their questions…<br/><br/>Jiang Yifan’s round eyes were glued to Su Yichen. He asked Xiao Jinli, full of doubt, “Mommy, who is this big brother?”<br/><br/>Big brother?<br/><br/>Everyone was puzzled.<br/><br/>This old man, in no way, looked like a ‘big brother’.<br/><br/>Su Yichen, on hearing Jiang Yifan refer to Xiao Jinli, was surprised.<br/><br/>When did sister Jinli get married? And her child is already so big, how did he not know?<br/><br/>However, before he could voice his question…<br/><br/>Upon hearing what Jiang Yifan said, Xiao Junxuan responded quickly.<br/><br/>He pulled Jiang Yifan over and pointed at Su Yichen, asking, “Little Fanfan, you’re saying that this man is big brother?”<br/><br/>Jiang Yifan nodded, “Yes, Uncle. This man is big brother. He may have disguised himself as an old man, but who am I? I am Jiang Yifan, smart and discerning. He can’t fool me.”<br/><br/>After hearing Jiang Yifan’s words, Su Yichen realized that his disguise had been seen through by a child.<br/><br/>On hearing what Jiang Yifan had said, Xiao Junxuan exclaimed in disbelief, “Xiao Siqian?”<br/><br/>As soon as Xiao Junxuan said this, everyone was astonished.<br/><br/>“What, this old man is Little Quan? How is that possible?”<br/><br/>“Little Quan is a young man; when did he turn into an old man?”<br/><br/>“What are you saying? Didn’t you hear what Fanfan just said? Little Quan is disguised!”<br/><br/>“Little Quan?” Xiao’s mother also chimed in.<br/><br/>Su Yichen, ah no, before the Xiao family, he was Xiao Siqian.<br/><br/>Xiao Siqian nodded, “Aunt, it’s me!”<br/><br/>“Haha, it really is Little Quan.”<br/><br/>“Little Quan, you sure gave us a shock when you showed up in this old man getup.”<br/><br/>“Little Quan, did you really disguise yourself like this?”<br/><br/>“Who did your makeup? It’s simply masterful.”\t\t\t\t\t\t</div>", "images": {}, "success": true}