{"id": 322, "url": "https://www.novelhall.com/the-lucky-star-blessing-the-whole-village-32483/15193414.html", "title": "Chapter 322 - Chapter 322: Chapter 322:", "volume": 4, "volume_title": "Volume 4", "body": "<h1>Chapter 322 - Chapter 322: Chapter 322:</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 322: Chapter 322:<br/><br/>Translator: 549690339<br/><br/>Upon getting off the airplane, Su Yichen let his subordinates go and decided to handle some matters by himself.<br/><br/>The bodyguard captain frowned and said, “Boss, is it okay for you to go alone? Your identity is too conspicuous. It would be dangerous if someone finds out!”<br/><br/>Su Yichen nodded and calmly replied, “Don’t worry, I won’t run into any trouble that easily.”<br/><br/>Over the years, although he had not returned to Xiao Family Village or been in touch with Father Xiao and Mother Xiao, he had been keeping contact with Xiao Jinli.<br/><br/>Throughout these years, he had witnessed Xiao Jinli’s incredible skills, such as hacking, divine medicine, and makeup.<br/><br/>Xiao Jinli had personally taught him makeup for his safety.<br/><br/>Calling it makeup, in his case, was actually more like disguise.<br/><br/>He could turn from a man into a woman, or from a young person into an old one. If he hadn’t seen it with his own eyes, even he wouldn’t believe that they were the same person and no traces of makeup could be found.<br/><br/>Once, Xiao Jinli had transformed him into a seventy or eighty-year-old man and then he had blatantly left under the watch of his heavily guarded bodyguards.<br/><br/>Of course, Su Yichen didn’t want to share this with his subordinates.<br/><br/>He told the bodyguard captain, “You guys rest assured, I’ll take care of my own safety. All you have to do is create the illusion that I’m still with you.”<br/><br/>He just needed to leave now and find a hidden place to put on makeup!<br/><br/>After the transformation, who would know that he was the youngest richest man?<br/><br/>The kidnappers would never think of that!<br/><br/>In Xiao Jinli’s words, “If someone could recognize her makeup, then it meant she had failed as a master.”<br/><br/>Su Yichen quickly left under the watchful eyes of the bodyguards and headed through the crowd to the public restroom to start with his makeup transformation!<br/><br/>A young man entered the restroom, but an old man came out. No one who was unfamiliar with him would pay attention, right?<br/><br/>After coming out, Su Yichen directly rented one or two taxis.<br/><br/>“Master, please take me to Xiao Family Village!” Su Yichen said.<br/><br/>Everyone knew about Xiao Family Village now, especially the long-term taxi drivers.<br/><br/>The driver asked, “Boss, the fare to Xiao Family Village from here is about 300 yuan. Are you sure? If you take a bus, it’s only 50 to 60 yuan.”<br/><br/>Going from Ganjiang City to Xiao Family Village in Taoyuan Town cost 56 yuan by bus.<br/><br/>However, due to the large number of passengers, people lined up daily. Some people were willing to rent a car to go there!<br/><br/>For the taxi drivers, this was a big order. They could earn more than 200 yuan just from one trip, which was higher than their daily earnings.<br/><br/>Moreover, they could also pick up passengers along the way. If they were lucky, they could earn at least 600 to 700 yuan in one trip!<br/><br/>Su Yichen said, “I’ll pay you a thousand. You can’t pick up any more passengers along the way, I like quiet.”<br/><br/>Before, he didn’t know that taxis could have ride-sharing. Actually, it wasn’t exactly ride-sharing. Ride-sharing meant sharing the fare. His method of ride-sharing involved the driver picking up passengers along the way without lowering the fare!<br/><br/>Initially, passengers were annoyed and helpless about the driver’s rogue behavior, because they couldn’t get off the car halfway through the journey. They had no choice but to tolerate it!<br/><br/>Su Yichen had seen it all when he was in Xiao Family Village for those few months, accompanying Xiao Junxuan on his trips outside the village.<br/><br/>Su Yichen added, “If you break your word, I will get off the car halfway and not pay you a single cent!”<br/><br/>The driver cheerfully agreed, “Alright, I won’t pick up any more passengers. Please put on your seatbelt, and we’ll set off!”\t\t\t\t\t\t</div>", "images": {}, "success": true}