{"id": 327, "url": "https://www.novelhall.com/the-lucky-star-blessing-the-whole-village-32483/15193419.html", "title": "Chapter 327 - Chapter 327: Chapter 327:", "volume": 4, "volume_title": "Volume 4", "body": "<h1>Chapter 327 - Chapter 327: Chapter 327:</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 327: Chapter 327:<br/><br/>During the conversation with Xiao Junxuan, Su Yichen had already removed his makeup.<br/><br/>Xiao Junxuan looked at the completely transformed Su Yichen, truly astonished.<br/><br/>“Wow, Xiao Quan, your real appearance is so much more handsome than on television.” Xiao Junxuan exclaimed, “Look at you, what a good-looking person. Xiao Quan, how old are you now, 26 right?”<br/><br/>Su Yichen nodded and said, “Yes, 26.”<br/><br/>“Time goes by so fast.” Xiao Junxuan sighed lightly, “In the blink of an eye, eight years have passed. I remember when I first met you, you were still a naive teenager. At that time, you were someone who had lost their memory, and everything about the countryside was new to you. However, at that time, none of us could have imagined that in just a few short years, you would become the wealthiest person. Haha, you know, many people in our village were so excited when they recognized you on television.”<br/><br/>Who wouldn’t be excited to have a big shot around them?<br/><br/>“So you’re 26 now, do you have a girlfriend or any girl you fancy?” Xiao Junxuan suddenly asked.<br/><br/>Su Yichen’s expression slightly froze.<br/><br/>Girlfriend? A girl he fancied?<br/><br/>The first face that flashed through his mind was that of Xiao Jinli.<br/><br/>Then he shook his head and smiled, “Not yet. Brother Xuan, what about you? Do you have a girlfriend?”<br/><br/>Xiao Junxuan was not married.<br/><br/>If he was married, Xiao Jinli would have definitely told him.<br/><br/>By this calculation, Xiao Junxuan should be approaching 30.<br/><br/>Xiao Junxuan smiled and said, “Not yet, I’ve been busy with the company’s affairs all these years and haven’t had the time to look for a girlfriend.”<br/><br/>With his looks and his status, there have always been girls pursuing him.<br/><br/>However, he never felt moved by them.<br/><br/>Although love takes time to develop, it still has to start with a feeling of attraction.<br/><br/>Just like how his Dad felt about his Mom, love at first sight, and then immediately put it into action, and now they have been happily married for over 30 years.<br/><br/>As for his marriage, his parents only asked about it and didn’t pressure him.<br/><br/>His Dad once said, “Marriage is a lifelong event, you can’t rush it, so you shouldn’t get married just for the sake of it. You must find someone who touches your heart and is mutually in love.”<br/><br/>Su Yichen laughed and said, “Brother Xuan, you shouldn’t always be busy with work either, you need to find us a sister-in-law.”<br/><br/>Xiao Junxuan almost rolled his eyes and said, “You should be talking about yourself. You shouldn’t always be busy with work either, you need to find a girlfriend soon. As the saying goes, establish a career and a family. You already have a career, so it’s time to start a family.”<br/><br/>Su Yichen laughed and said, “Bro, I’m in no hurry, I’m only 26. I’ll wait for you to marry a sister-in-law first, then I’ll find a girl.”<br/><br/>Xiao Junxuan shook his head and laughed, “We really shouldn’t laugh at each other. I’m sure once we go downstairs, the elders will definitely urge us to find girlfriends. Haha…”<br/><br/>Su Yichen,<br/><br/>Just as he was about to say something, Xiao Jinli’s voice came from outside the door.<br/><br/>Xiao Jinli laughed and said, “Bro, Brother Little Quan, do you have any secrets to talk about here? The elders are urging you guys to go downstairs quickly. Everyone wants to meet Brother Little Quan as soon as possible and get a glimpse of his true appearance.”<br/><br/>Xiao Junxuan said, “We’re coming down now.”\t\t\t\t\t\t</div>", "images": {}, "success": true}