{"id": 320, "url": "https://www.novelhall.com/the-lucky-star-blessing-the-whole-village-32483/15193412.html", "title": "Chapter 320 - Chapter 320: Chapter 320:", "volume": 4, "volume_title": "Volume 4", "body": "<h1>Chapter 320 - Chapter 320: Chapter 320:</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 320: Chapter 320:<br/><br/>Translator: 549690339<br/><br/>No matter how much fuss the Xia Family made, Su Yichen never compromised and did not inject any more funds into the Xia Family.<br/><br/>The Xia Family’s failure to invest in large projects led to the breaking of their capital chain, with a funding gap reaching two hundred billion.<br/><br/>The Xia Family begged their grandparents and looked for banks, but to no avail. They could not save the Xia Family from its day-to-day decline.<br/><br/>Eventually, the Xia Family declared bankruptcy two months later.<br/><br/>The Xia Family’s bankruptcy directly led to their hatred for Su Yichen reaching the highest level.<br/><br/>For them, it was merely a matter of two hundred billion. Just for this money, Su Yichen actually watched them die without doing anything. So they blamed Su Yichen for the Xia Family’s bankruptcy.<br/><br/>However, they don’t have the ability to retaliate against Su Yichen now. But as soon as they have a chance, they will do everything they can to bring him down from his throne.<br/><br/>They are no longer relatives to Su Yichen, but sworn enemies!<br/><br/>One day, Su Yichen receives a phone call from Xiao Jinli.<br/><br/>As soon as he saw the caller ID, his whole demeanor became excited.<br/><br/>He answered the phone with a tender voice, “Jinli.”<br/><br/>Xiao Jinli directly said, “Su big brother, I have a favor to ask of you!”<br/><br/>Su Yichen immediately became serious and asked earnestly, “What kind of favor? If I can help, I will definitely do my best!”<br/><br/>Xiao Jinli said, “It’s not convenient to explain on the phone. I’ll come to the Capital City to find you.”<br/><br/>Su Yichen immediately replied, “I’ll come to you instead.”<br/><br/>Xiao Jinli,<br/><br/>“Ahem…” Su Yichen said solemnly, “I have invested in a large project in Ganjiang City, and I originally planned to fly there tomorrow. Now I will just go there a day early.”<br/><br/>Xiao Jinli agreed without suspicion, “Okay, then I’ll wait for you at home.”<br/><br/>With tears held back, Su Yichen whispered, “Mmm.”<br/><br/>Now he can openly go to Xiao Family Village.<br/><br/>He used to fear that his identity would bring trouble to Xiao Family Village. So, he always used his busy work as an excuse not to return.<br/><br/>But he knew there were many changes in the Xiao Family Village.<br/><br/>He arranged for someone to film the changes in every corner of the village and show him.<br/><br/>One could say he had been watching the Xiao Family Village transform.<br/><br/>However, he never returned to the Xiao Family.<br/><br/>Occasionally, in photos and videos, there would be appearances of Xiao Father, Xiao Mother, Xiao Junyi, or others from the village, all of which were so familiar and intimate.<br/><br/>After hanging up the phone, Xiao Jinli went to the cafeteria to find Xiao’s mother, smiling and saying, “Mom, Su… oh Xiao Siqian is coming back tomorrow.”<br/><br/>Xiao Mother asked unbelievingly, “Who did you say?”<br/><br/>“Xiao Siqian,” Xiao Jinli smiled and said, “Your former youngest son.”<br/><br/>Xiao Mother said emotionally, “Is Xiao Quan coming back? After so many years, he’s finally coming back.”<br/><br/>It’s been eight years.<br/><br/>At that time, they knew that Su Yichen’s identity was not simple, but they never thought that he had ended up in Xiao Family Village because his biological father wanted to kill him, just to get his mother’s inheritance.<br/><br/>Upon hearing this news, they could hardly believe that there could be such cruel parents in the world.<br/><br/>Even a tiger does not eat its young, yet Su Yichen’s real father wanted his life.<br/><br/>Instantly, they felt both pity and heartache for this child, Su Yichen.<br/><br/>Over the years, they knew that Su Yichen had been in contact with Xiao Jinli.<br/><br/>Although they missed him too, they also knew that if he did not contact them, there must be a reason.<br/><br/>But, they had been waiting for Su… Xiao Siqian to return home one day.\t\t\t\t\t\t</div>", "images": {}, "success": true}