{"id": 329, "url": "https://www.novelhall.com/the-lucky-star-blessing-the-whole-village-32483/15193421.html", "title": "Chapter 329 - Chapter 329: Chapter 329:", "volume": 4, "volume_title": "Volume 4", "body": "<h1>Chapter 329 - Chapter 329: Chapter 329:</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 329: Chapter 329:<br/><br/>As the National Richest Person, even if Su Yichen tried to be low-key, he was still a figure of attention nationwide and even worldwide. It was natural for his photos and videos to appear in news reports.<br/><br/>Wherever he went, he was surrounded by a group of bodyguards for protection. It was the ultimate honor for any businessman to have a photo taken with Su Yichen.<br/><br/>One could say that Su Yichen, the twenty-something richest person, was the most envied man in the world.<br/><br/>Many men, even if they were successful in their careers, could hardly boast about their age. The young ones might be in their thirties or forties, while the older ones were in their eighties, nineties, or even over a hundred years old.<br/><br/>Su Yichen was unprecedented and unparalleled. At the age of twenty-two, he became the world’s youngest richest person through his own abilities.<br/><br/>After catching up with the Xiao Family, Su Yichen nervously and apprehensively greeted the four elderly gentlemen.<br/><br/>“Grandpa Jiang, Elder Chen, Old Li, Elder Zeng, hello, I’m Su Yichen!”<br/><br/>The four old men’s expressions were indifferent, neither happy nor angry, nor surprised nor curious. They just gave a slight nod.<br/><br/>Su Yichen,  grew even more uneasy in his heart.<br/><br/>What was the meaning of the four elderly gentlemen’s actions? Were they dissatisfied with him?<br/><br/>What…what should he do about it?<br/><br/>He looked to Xiao Jinli with pleading eyes.<br/><br/>Xiao Jinli smiled and said, “Brother Little Quan, it’s okay. These old gentlemen have always been like this, not talkative or smiling.”<br/><br/>As soon as Xiao Jinli finished speaking, a “hmm, hmm” sound came as if clearing their throats.<br/><br/>Without guessing, it was the voices of the old men.<br/><br/>Grandpa Jiang laughed and said, “You girl, we haven’t even said anything, and you’re already protecting him.”<br/><br/>Were they not talkative and serious old men? All four of them were amiable old men, obviously.<br/><br/>They didn’t smile at Su Yichen just because they were dissatisfied with him….<br/><br/>Xiao Jinli laughed and said, “Grandfather, what am I protecting? You haven’t done anything wrong. It’s just that Little Quan isn’t too familiar with you guys, so he’s a little nervous.”<br/><br/>Su Yichen,<br/><br/>Grandpa Jiang and the others,<br/><br/>Had Su Yichen ever been nervous when meetingimportant people? They simply didn’t believe him.<br/><br/>Old Chen smiled and said, “Young man, don’t be nervous. Actually, we’re very approachable.”<br/><br/>Su Yichen respectfully replied, “Yes, the four old masters are very kind and amiable.”<br/><br/>/div&gt;<br/><br/>“Haha, that’s right, we’re all kind and amiable old men, so you don’t have to be nervous.” Elder Li said with a playful expression, “Girl, are you satisfied now?”<br/><br/>Xiao Jinli shrugged and said, “Grandfather Li, I didn’t actually say anything!”<br/><br/>The four old masters,<br/><br/>At this time, Xiao’s mother said with a smile, “Little Quan, I knew you’d be coming today, so I prepared your favorite dish, Spicy and Sour Taro Lotus. I just don’t know if you still like it now? After all, you’re now a big shot used to exotic delicacies.”<br/><br/>“I like it!” Su Yichen nodded, “I’ve always liked this dish from the first time I ate it until now!”<br/><br/>Of course, he only liked the Spicy and Sour Taro Lotus made by Xiao’s mother.<br/><br/>Others, even if made by a Michelin Master, were not to his liking.<br/><br/>Xiao’s mother was very pleased and said, “Great! If you like it, eat more tonight. I’ve also pickled a lot, so you can take some with you when you leave.”<br/><br/>Su Yichen was an important person, and he couldn’t stay in Xiao Family Village forever.<br/><br/>Su Yichen nodded and said, “Thank you, Auntie!”<br/><br/>“You’re being too polite,we’re all a family here. What’s the need to be so formal with Auntie?”\t\t\t\t\t\t</div>", "images": {}, "success": true}