{"id": 323, "url": "https://www.novelhall.com/the-lucky-star-blessing-the-whole-village-32483/15193415.html", "title": "Chapter 323 - Chapter 323: Chapter 323:", "volume": 4, "volume_title": "Volume 4", "body": "<h1>Chapter 323 - Chapter 323: Chapter 323:</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 323: Chapter 323:<br/><br/>Translator: 549690339<br/><br/>Su Yichen received a call from Xiao Jinli midway through.<br/><br/>“Mhm, I’m already on my way and I should arrive at Xiao Family Village in about half an hour,” he said.<br/><br/>After saying that, Su Yichen took a photo with his cellphone and sent it over.<br/><br/>He had transformed into a man in his sixties or seventies. He would probably take on this appearance in front of outsiders when he arrived at Xiao Family Village, but he might revert back to his original appearance when he was inside the house.<br/><br/>After all, his face as the Wealthiest Person is well-known to people across the country thanks to constant media coverage. He didn’t want to cause a massive commotion and crowded gathering just for returning to Xiao Family Village.<br/><br/>After sending the photo, Xiao Jinli nearly choked with laughter when she saw the ordinary old man in the photo.<br/><br/>Su Yichen really seemed to be addicted to playing the role of an old man. He would always disguise himself as one when going out. She would joke that one day some well-meaning person would mistake him for an elderly person in need of help and send him back home.<br/><br/>After checking Su Yichen’s cellphone location, Xiao Jinli told the Xiao Family who were waiting for Jinli to come home, “Brother Siquan is about half an hour away. I’ll go to the village entrance to wait for him. Our village has changed a lot, so I’m worried he won’t be able to find our house.”<br/><br/>“Oh, he’s coming soon! That was fast! Hurry up, Jinlin, and go get him. He should be at the village entrance in a little while,” Xiao’s mother urged.<br/><br/>Although Xiao Siqian only lived in Xiao Family Village for half a year, everyone treated him as a member of their family during that time.<br/><br/>Although they hadn’t seen each other for eight years, they could still hear news about him and knew that he was doing well. At such a young age, he had become the National Richest Person, which made them feel relieved.<br/><br/>Xiao’s maternal grandmother wondered, “This kid Xiaoquan, so young, how exactly did he become the Richest Person?”<br/><br/>Xiao Father laughed, “Mom, you don’t know. This kid Xiaoquan has a talent for business. At first, it was his suggestion that we buy the combine harvester for the village. He also gave me advice to enter the real estate industry, which allowed me to make a name for myself in the business world. With his talent, who else could become the Richest Person if he doesn’t?”<br/><br/>Ever since he found out that Xiao Siqian was returning to Xiao Family Village, Xiao Junxuan cleared his schedule to wait for him at home.<br/><br/>Xiao Junxuan said, “Grandma, the establishment plan for our Green Fresh Company was written entirely by Xiaoquan. He even included suggestions for managing the company and such. Our company was able to start off smoothly thanks to him.”<br/><br/>Xiao Jinli also said, “That’s right. The plan for setting up the company in the village was written by Brother Little Quan, and then submitted to the Village Head and the Village Committee for discussion.”<br/><br/>Grandma Xiao was slightly taken aback, “It was all written by this kid Xiaoquan? Back then, he was only 18 years old, right?”<br/><br/>“Indeed, he was 18,” Xiao Junxuan nodded.<br/><br/>“18, and so capable,” Grandma Xiao sighed, “What were most people doing at 18? If they weren’t studying in high school, they were working. Who else would be doing things like this?”<br/><br/>“Exactly,” the maternal grandmother chimed in, “Little Quan has really come a long way.”<br/><br/>People are not born smart and capable of doing anything with ease. One needs extensive knowledge and rich experience.<br/><br/>No one called Xiao Siqian ungrateful or anything like that for not contacting them for eight years and not even making a phone call. All they felt was heartache.<br/><br/>They knew he was from Capital City, but how did he end up bloodied and injured in Xiao Family Village thousands of miles away all those years ago?<br/><br/>Something must have happened during that process, and it must have been a bloody ordeal.\t\t\t\t\t\t</div>", "images": {}, "success": true}