{"id": 321, "url": "https://www.novelhall.com/the-lucky-star-blessing-the-whole-village-32483/15193413.html", "title": "Chapter 321 - Chapter 321: Chapter 321:", "volume": 4, "volume_title": "Volume 4", "body": "<h1>Chapter 321 - Chapter 321: Chapter 321:</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 321: Chapter 321:<br/><br/>Translator: 549690339<br/><br/>After Su Yichen hangs up on Xiao Jinli’s call, he makes a call to his subordinate, saying, “Book me the earliest flight to Ganjiang City.”<br/><br/>The secretary sounded a bit surprised, “President, from 2:30 pm to 3:30 pm this afternoon, you have an important meeting. At 5:30 pm, you’re discussing cooperation with Li Da Group’s Chairman Shen, which is related to a tens of billions order.”<br/><br/>Su Yichen didn’t even think before saying, “Cancel all of it! I have something even more important to do.”<br/><br/>“Hah, cancel all of it?” the secretary exclaimed in amazement, “But Mr. Chairman, it might be difficult to schedule another appointment with Chairman Shen of Li Da Group next time, right?”<br/><br/>Su Yichen pondered for a moment and said, “Then notify Vice President Lin and have him go!”<br/><br/>The secretary’s expression was slightly surprised, and after a while, he nodded and replied, “Alright, I’ll arrange it right away.”<br/><br/>Ten minutes later, the secretary called back, “Chairman, the ticket has been booked for 1:30 pm this afternoon.”<br/><br/>Su Yichen nodded and said, “Okay, I got it!”<br/><br/>Su Yichen couldn’t suppress his excitement after hanging up the phone!<br/><br/>It’s been eight years since he and his family could finally meet!<br/><br/>That’s right!<br/><br/>In his heart, the only true family members were the Xiao Family in Xiao Family Village!<br/><br/>On the other side, when the Xiao Family learned that Xiao Siqian was coming back, they were all very happy.<br/><br/>The maternal grandmother said, “It’s been eight years since we last saw this child, I wonder if he has grown taller or gained some weight.”<br/><br/>Grandma Xiao said, “This child is so honest, I don’t know if he’s been bullied by others. Oh, when he was in Xiao Family Village, he was so well-behaved!”<br/><br/>Xiao Junxuan said, “At last, we’re going to meet this business tycoon! We usually see him on television news, and now I don’t even know whether he still remembers us poor folks.”<br/><br/>Xiao’s mother said, “This kid Xiaoquan used to love my Spicy and Sour Taro Lotus, I wonder if he still likes it now? I’d better prepare some.”<br/><br/>Xiao Father said, “This kid Xiaoquan finally found it in his heart to come see us.”<br/><br/>Eight years ago, Xiao Father sold the garment factory business and switched to real estate!<br/><br/>Just as Xiao Siqian had said, the real estate industry had a great market prospect.<br/><br/>In just his first year of real estate, Xiao Father earned more than his profits from running the garment factory for five to six years.<br/><br/>However, he has always been cautious in doing things. He didn’t blindly invest due to his initial success but instead became more careful in choosing investment projects and even consulted Xiao Jinli’s opinion!<br/><br/>And sure enough, the projects Xiao Jinli recommended were all profitable!<br/><br/>The more investment projects, the bigger the company!<br/><br/>In just three years, Xiao Group became a well-known enterprise in Ganjiang City, and Xiao Father became an entrepreneur!<br/><br/>However, Xiao Father didn’t have much ambition. He was already satisfied with the current situation and didn’t want to expand outwards.<br/><br/>So he hired professional senior managers to run the company, and he retired to spend time with his wife and children, taking care of the Xiao Family Village’s business together!<br/><br/>Therefore, he was very grateful to Xiao Siqian for his initial suggestion! As the boss of a large consortium, he must have known about Xiao Siqian being Su Yichen, the National Richest Person!<br/><br/>However, he still wondered if Xiao Siqian had forgotten them.<br/><br/>Now that Xiao Siqian could come back, it meant that he hadn’t forgotten the Xiao Family and Xiao Family Village!<br/><br/>All those who received the news were excitedly waiting for Xiao Siqian’s return and Su Yichen’s arrival!\t\t\t\t\t\t</div>", "images": {}, "success": true}