{"id": 333, "url": "https://www.novelhall.com/the-lucky-star-blessing-the-whole-village-32483/15193425.html", "title": "Chapter 333 - Chapter 333: Chapter 333:", "volume": 4, "volume_title": "Volume 4", "body": "<h1>Chapter 333 - Chapter 333: Chapter 333:</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 333: Chapter 333:<br/><br/>“Sister Jin Li, hurry, Brother Xuan wants you to go to the hospital now!”<br/><br/>Xiao Xiaoming called out to Xiao Jinli from afar, “It’s a matter of life and death!”<br/><br/>Xiao Jinli’s face changed, and she quickly asked, “What happened to my brother?”<br/><br/>Xiao Xiaoming had run over and was panting, “No… it’s not Brother Xuan. He’s holding a woman with wounds all over her body.”<br/><br/>“A woman?” the grandmother immediately asked with concern, “What does she look like?”<br/><br/>“Go on, old lady, what does a child like Xiao Ming know about what a woman looks like?” the grandfather said.<br/><br/>Grandma Xiao hurriedly urged Xiao Jinli, “Good baby, hurry up and go see.”<br/><br/>“Fellow villager, shall we go and have a look too?” the grandmother asked with a smile.<br/><br/>Xiao Junxuan was in his thirties and had never found a partner before. Now, it was said that he was carrying an injured woman, which aroused everyone’s curiosity.<br/><br/>“Alright, let’s go and have a look.”<br/><br/>Xiao Family Village now has its own hospital and has hired some highly skilled doctors.<br/><br/>Usually, Xiao Jinli doesn’t take action, but in the case of critically ill patients who can’t be helped by other doctors, she will step in to save them.<br/><br/>Now that Xiao Junxuan didn’t ask anyone else but went straight to Xiao Jinli, it seemed that the girl was somehow special to him.<br/><br/>Su Yichen went to the hospital with Xiao Jinli.<br/><br/>Lin Xiaoxiao was lying on the hospital bed, unconscious or asleep. When the group of people entered, she did not wake up.<br/><br/>Her face was bruised, making people feel pain just by looking at it.<br/><br/>The two old ladies looked at her and said, “This poor child, was she beaten by someone?”<br/><br/>“Xuan’er, who beat this girl?”<br/><br/>Xiao Junxuan shook his head, “I don’t know.”<br/><br/>He only heard people talking but didn’t really see who hit her.<br/><br/>Su Yichen looked at Lin Xiaoxiao with surprise, “Lin Xiaoxiao!”<br/><br/>“Xiao Quan, do you know this girl?” the grandmother asked curiously.<br/><br/>Su Yichen said with some confusion, “She looks like a girl I know, but that girl is from the Capital City. If it’s her, how did she end up here?”<br/><br/>“From the Capital City?” Xiao Junxuan was surprised, “When I met her, she was in Qingzhai Village, Licheng County. That village is more backward and further away from the Capital City than our village. Moreover, she was lying on the ground. I thought she was a scammer, but it turned out she had escaped from that village, and a group of people were chasing her. Someone in that group said that the girl’s leg had been broken and that she couldn’t get far.”<br/><br/>The grandmothers’ faces changed, and they looked at Lin Xiaoxiao with astonishment.<br/><br/>The grandmother asked, “Xuan’er, do you mean that she was kidnapped and sold there, and then escaped?”<br/><br/>Xiao Junxuan nodded, “I suspect so. At that time, one of the men in the group said he had bought her for twelve thousand and she had run away before giving birth.”<br/><br/>“In all likelihood, she was trafficked,” said Grandma Xiao, “what a beast! Xuan’er, have you called the police?”<br/><br/>Xiao Junxuan shook his head, “At that time, I was stopped by this girl, and since she was severely injured and followed by a group of people chasing her, I left in a hurry.”<br/><br/>“Xuan’er did the right thing, the priority is to protect our own safety first,” Grandma Xiao said, “wait until the girl wakes up and see if she wants to call the police.”<br/><br/>Xiao Junxuan nodded, “We have to call the police. This girl was lucky to meet me while escaping from the wolf’s den with severe injuries, but what if there are other girls who are kidnapped and taken to that village? Can they be as lucky as she was?”<br/><br/>“Xuan’er is right. We still need to call the police,” the grandmother agreed, “we can’t let other girls be persecuted.”<br/><br/>As Xiao Jinli was checking Lin Xiaoxiao’s injuries and examining her leg, Lin Xiaoxiao might have been woken up by the pain.<br/><br/>When she opened her eyes, they were immediately filled with vigilance and wariness.<br/><br/>The grandmother quickly smiled and said, “Girl, don’t be afraid, you’re safe in the hospital now.”<br/><br/>Seeing the kind-eyed old lady, Lin Xiaoxiao’s eyes were somewhat confused, and then she looked around and quickly relaxed, her heart settling down.<br/><br/>Thank goodness, she had finally escaped that ghastly place.<br/><br/>Lin Xiaoxiao quickly looked over the strangers standing by her bed.<br/><br/>Well, she didn’t recognize Su Yichen. He had put on makeup and was still disguised as an old man.<br/><br/>After examining everyone, Lin Xiaoxiao’s gaze fell on Xiao Junxuan.<br/><br/>During her last escape, she seemed to have encountered a man driving a car. With her vision blurred at the time, all she knew was that the man was tall. She had used her last ounce of strength to beg him to take her away.<br/><br/>Although she didn’t see the man’s face clearly, she had a strong sense of smell since childhood and could distinguish different scents on people.<br/><br/>She smelled the man’s scent on her.<br/><br/>Lin Xiaoxiao looked at Xiao Junxuan and said, “It was you, sir, who saved me, wasn’t it? Thank you!”<br/><br/>Xiao Junxuan frowned and shook his head, “You saved yourself, I just happened to pick you up on the road.”<br/><br/>At this point, he looked at Lin Xiaoxiao’s broken leg, which had already been treated by other doctors, and asked with puzzlement, “One of your legs was broken by someone, and the bones are shattered. How did you manage to escape?”<br/><br/>Lin Xiaoxiao’s face changed, and she looked around with vigilance and wariness once again.<br/><br/>Xiao Jinli smiled and said, “Don’t worry, this is Xiao Family Village, and we don’t engage in the despicable act of trafficking women and children.”<br/><br/>“Xiao Family Village?” Lin Xiaoxiao looked astonished. She came to her senses and asked in amazement, “Is it the Xiao Family Village I’m thinking of? The one that’s famous nationwide for selling vegetables?”<br/><br/>“Yes, it’s this Xiao Family Village,” Xiao Jinli nodded, “It’s very safe here, so just put your mind at ease.”<br/><br/>Lin Xiaoxiao looked at Xiao Junxuan, puzzled, “Is Xiao Family Village very close to Qingzhai Village?”<br/><br/>She had only begged the man to save her, so how did she end up in Xiao Family Village when she woke up?<br/><br/>Xiao Jinli shook her head, “It’s far. It should be about three to four hundred kilometers by road, right?”<br/><br/>“That far?” Lin Xiaoxiao was stunned again.<br/><br/>She had thought it was nearby, so the person who saved her had brought her directly to Xiao Family Village.<br/><br/>Unexpectedly, the journey was so long, yet he had brought her all the way to Xiao Family Village.<br/><br/>Being here in Xiao Family Village, her mood had finally settled down.<br/><br/>That was because many people online said that Xiao Family Village was the safest place in the country.<br/><br/>Here, no bad person could enter, and even if they did and did something bad, they would be quickly discovered and unable to leave.<br/><br/>That’s what made Xiao Family Village so magical.<br/><br/>People outside had no idea what was going on.<br/><br/>Lin Xiaoxiao looked at Xiao Junxuan once again and sincerely thanked him, “Sir, thank you!”<br/><br/>Xiao Junxuan asked directly, “Is your home in the Capital City?”<br/><br/>Lin Xiaoxiao was surprised, “How did you know?”<br/><br/>Everyone,\t\t\t\t\t\t</div>", "images": {}, "success": true}