{"id": 338, "url": "https://www.novelhall.com/the-lucky-star-blessing-the-whole-village-32483/15193430.html", "title": "Chapter 338 - Chapter 338: Chapter 337:_2", "volume": 4, "volume_title": "Volume 4", "body": "<h1>Chapter 338 - Chapter 338: Chapter 337:_2</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 338: Chapter 337:_2<br/><br/>It could be said that this child was his life.<br/><br/>Although he loved his adopted daughter, Lin Wanqing, she was the daughter of a benefactor.<br/><br/>“So who put my cellphone in Xiaoxiao’s room that day?” Lin Chengdong thought about it and immediately called the housekeeper to check the surveillance for that day.<br/><br/>But soon, the housekeeper came to report, “Master, the surveillance was broken for a while that day, and there was no footage from that time.”<br/><br/>Lin Chengdong’s face darkened instantly, and he angrily said, “What are the security personnel doing? They didn’t even notice that the surveillance was broken?”<br/><br/>The housekeeper explained, “It took less than ten minutes for the security personnel to find out that the surveillance was broken and get it fixed.”<br/><br/>Lin Chengdong tapped his fingers lightly on the table, his eyes deep and moody. It was all a conspiracy—a well-planned conspiracy targeting his biological daughter, Lin Xiaoxiao.<br/><br/>His entire enterprise, yet his true heir, was always his own daughter.<br/><br/>After all, he had an old-fashioned mindset that the family business could only be passed on to his biological offspring.<br/><br/>As for his adopted daughter, Lin Wanqing, she was capable and talented, able to help Lin Xiaoxiao grow the Qianli Group. Even if not expanding, they could at least maintain the current state.<br/><br/>So, if something were to happen to his biological daughter, who would benefit the most?<br/><br/>First, the Lin Family—those nephews and nieces of his.<br/><br/>Second, his adopted daughter, Lin Wanqing.<br/><br/>Those relatives of Lin Family, especially his father, believed that his daughter would eventually marry and leave the family, so the Lin Family business must be inherited by Lin Family members.<br/><br/>But Lin Chengdong didn’t think so.<br/><br/>The Qianli Group was created by him alone, built from nothing to its current success with his blood, sweat, and tears. It was his family business, not the Lin Family’s.<br/><br/>Those Lin Family relatives had a luxurious life only because he’s supporting them.<br/><br/>They didn’t have the right to inherit his family business.<br/><br/>But what if Lin Xiaoxiao disappeared? Would Lin Chengdong have to choose one of his nephews to inherit the family business?<br/><br/>So, those Lin Family relatives were quite suspicious.<br/><br/>And Lin Wanqing as well.<br/><br/>Each time he quarreled with Lin Xiaoxiao, he would threaten her like this: “If you don’t want to inherit the Lin Family business, let your sister Lin Wanqing take over!”<br/><br/>At that time, Lin Xiaoxiao would retort, “Whoever you want to inherit it can inherit it. It’s none of my business.”<br/><br/>So maybe after hearing this so many times, Lin Wanqing took it to heart and became even more ambitious.<br/><br/>If Lin Xiaoxiao disappeared, would she, Lin Wanqing, as Lin Chengdong’s daughter in name, inherit everything from Lin Chengdong?<br/><br/>At this thought, Lin Chengdong’s hands clutched tightly.<br/><br/>He said, “It can’t be. Qingqing is gentle and kind. She couldn’t have done such a thing.”<br/><br/>After an unknown period of time, Xiao Zhang called and anxiously reported to Lin Chengdong, “Boss, the brothers have searched all the places Second Young Miss used to go—bars, hotels, apartments—and contacted all her friends, but nobody has seen her. The bar owner said she hasn’t been there in over ten days.”<br/><br/>Lin Chengdong’s heart tightened as he anxiously and loudly said, “Keep searching! Even if I have to dig three feet into the Capital City, I will find the Second Young Miss!”<br/><br/>Xiao Zhang fell silent for a moment, “Boss, is it possible that the Second Young Miss left Capital City and went somewhere else?”<br/><br/>“No way!” Lin Chengdong denied immediately, “She has no identification with her; where could she go?”<br/><br/>Originally, Lin Chengdong was afraid that Lin Xiaoxiao would leave the Capital City without a word, so he had taken away all her identification documents early on.<br/><br/>Without any identification, she could only come home obediently.<br/><br/>After hearing this, Xiao Zhang said, “Alright, boss, I’ll have the brothers turn the Capital City upside down to find the Second Young Miss.”<br/><br/>Lin Chengdong’s voice was heavy, “Xiao Zhang, I’m counting on you.”<br/><br/>After hanging up Xiao Zhang’s call, Lin Chengdong’s heart was weighed down with worry and fear.<br/><br/>He worried and feared that something unexpected had happened to Lin Xiaoxiao.<br/><br/>He thought of something else and immediately made another call.<br/><br/>Su Yichen was having dinner with the Xiao Family when the phone rang.<br/><br/>He originally planned to ignore it and hang up.<br/><br/>But when he caught a glimpse of the caller ID, Su Yichen looked at Xiao Jinli and glanced at Xiao Junxuan.\t\t\t\t\t\t</div>", "images": {}, "success": true}