{"id": 339, "url": "https://www.novelhall.com/the-lucky-star-blessing-the-whole-village-32483/15193431.html", "title": "Chapter 339 - Chapter 339: Chapter 337:_3", "volume": 4, "volume_title": "Volume 4", "body": "<h1>Chapter 339 - Chapter 339: Chapter 337:_3</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 339: Chapter 337:_3<br/><br/>Xiao Junxuan was baffled by their gazes.<br/><br/>He asked, “Xiao Quan, your phone is ringing. Answer it. Why are you looking at me?”<br/><br/>“Ahem…” Su Yichen said, “Brother Xuan, it is Lin Xiaoxiao’s biological father calling.”<br/><br/>To everyone’s surprise, as soon as he finished speaking, Grandma Xiao immediately became emotional and asked, “Xiaoxiao’s biological father? How did he call here?”<br/><br/>Maternal grandmother said, “Xiao Quan, you answer it first and see what he wants.”<br/><br/>Xiao’s mother knew that her son had taken a fancy to Lin Xiaoxiao and was aware of the strained relationship between the girl and her family.<br/><br/>She also said, “Xiao Quan, you answer the phone first and see if he is looking for Xiaoxiao.”<br/><br/>What a caring father he must be, as his daughter has been missing for more than ten days, and he hasn’t called once.<br/><br/>Of course, if he is calling Su Yichen’s cell phone now to find Lin Xiaoxiao, it means there might still be hope for the biological father.<br/><br/>Under everyone’s watch, Su Yichen answered the phone.<br/><br/>Once he did, his demeanor instantly shifted.<br/><br/>“Hello, who is this?”<br/><br/>“Su Dong, this is Lin Chengdong.”<br/><br/>“Oh, it’s Lin Dong. What can I do for you?”<br/><br/>Lin Chengdong directly asked, “Su Dong, has my daughter contacted you?”<br/><br/>Su Yichen asked, puzzled, “Which daughter of yours? What does she want with me?”<br/><br/>“It’s my youngest daughter, Lin Xiaoxiao.” Lin Chengdong did not hide the fact, saying, “It seems my daughter Lin Xiaoxiao has disappeared. She hasn’t contacted me for more than half a month.<br/><br/>When I call her, it’s either busy, turned off, or I’m hung up on directly. I originally thought she was protected by bodyguards in secret, and I didn’t worry about losing contact with her.”<br/><br/>But not long ago, the Bodyguard Captain told me that I ordered them to withdraw more than ten days ago and not protect Xiaoxiao anymore. But I never gave that command!”<br/><br/>Su Yichen frowned, full of doubt, and said, “So what, Lin Dong? Do you need my help with something?”<br/><br/>Lin Chengdong said, “Before Xiaoxiao disappeared, we had a fight. I told her to meet you!”<br/><br/>“What?” Su Yichen was so surprised that he almost stood up from his chair.<br/><br/>Not only was he surprised, but everyone else was as well.<br/><br/>No one expected that Su Yichen and Lin Xiaoxiao would have such a connection.<br/><br/>Hoping to prevent Xiao Junxuan from misunderstanding, Su Yichen immediately interrupted him, “Lin Dong, how many times have I told you that I don’t like your daughter, and she doesn’t seem to like me either? Don’t waste your efforts on this.”<br/><br/>Lin Dong’s expression was somewhat stiff, but in order to ask for Su Yichen’s help, he had to plow ahead,<br/><br/>“I understand, Su Dong. From now on, I definitely won’t. Just, after that argument, Xiaoxiao said she didn’t like you either and told me not to waste my energy. Then, she stormed off<br/><br/>angrily. And since then, she hasn’t given me a single phone call for more than half a month.<br/><br/>Before, I thought she was safe, and I didn’t care that she hadn’t called me for more than ten days. Now that I know someone has been secretly manipulating the bodyguards protecting her, I realize that my daughter is in danger.”<br/><br/>At this point, his voice choked.<br/><br/>Now, he was just a pitiful old father.<br/><br/>In the past, no matter how much he argued with Lin Xiaoxiao, even telling her to get lost and the farther away, the better, it was because he knew she was protected.<br/><br/>But now, with his daughter in unknown danger, how could he not worry?<br/><br/>Su Yichen remained silent, waiting for Lin Chengdong to continue.<br/><br/>Lin Chengdong went on, “Su Dong, I wanted to ask if Xiaoxiao came to see you sixteen days ago?”<br/><br/>“No!” Su Yichen gave him an answer.<br/><br/>After hearing that, Lin Chengdong said with a bitter smile, “I thought Xiaoxiao had come to see you, so I wanted to ask if you know where she is.”<br/><br/>If Su Yichen wanted to arrange for Lin Xiaoxiao to leave, it would be an effortless matter.<br/><br/>He was actually holding on to a glimmer of hope, hoping to learn Xiaoxiao’s whereabouts from Su Yichen.<br/><br/>“Well, I’ve disturbed you.” Lin Chengdong said, his voice tense and heavy.<br/><br/>“Lin Dong, don’t hang up just yet!” Su Yichen immediately said, “Although I don’t have romantic feelings for your daughter, Lin Xiaoxiao is a kind-hearted girl. I want to treat her like a sister, and since she is missing, I’ll do my best to find her.”<br/><br/>Lin Chengdong’s eyes lit up, and he immediately expressed his gratitude, “Thank you, Su Dong!”<br/><br/>With Su Yichen’s help, the hope of finding Lin Xiaoxiao increased.<br/><br/>At this point, Su Yichen suggested, “Lin Dong, although we haven’t confirmed that your daughter is missing, I recommend reporting it to the police. Perhaps using the power of the Yamen would be more promising, don’t you think?”<br/><br/>Lin Chengdong hesitated slightly, “But Su Dong, what if Xiaoxiao was kidnapped and reporting it to the police alerts the kidnappers? Could they retaliate against her?”\t\t\t\t\t\t</div>", "images": {}, "success": true}