{"id": 335, "url": "https://www.novelhall.com/the-lucky-star-blessing-the-whole-village-32483/15193427.html", "title": "Chapter 335 - Chapter 335: Chapter 335:", "volume": 4, "volume_title": "Volume 4", "body": "<h1>Chapter 335 - Chapter 335: Chapter 335:</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 335: Chapter 335:<br/><br/>Upon hearing Lin Xiaoxiao’s question, everyone was momentarily speechless.<br/><br/>How big was this girl’s heart? She had been awake for so long, and she only just remembered to ask if her leg could be treated?<br/><br/>Xiao Junxuan looked at Lin Xiaoxiao, his eyebrows and eyes all smiling.<br/><br/>How could this girl be so adorable?<br/><br/>And she’s a little cutie who admires her sister?<br/><br/>Xiao Jinli subconsciously glanced at her brother’s face, and sure enough, she found a different expression than before.<br/><br/>It seemed that this Lin Xiaoxiao might become her future sister-in-law.<br/><br/>Of course, Xiao Jinli didn’t think at all that her brother wouldn’t be able to chase Lin Xiaoxiao.<br/><br/>Not to mention anything else, just the life-saving favor should be reciprocated with her body, right?<br/><br/>Before Xiao Jinli could speak, Xiao Junxuan reassured, “Don’t worry, Miss Lin, since you called my sister a Divine Doctor, your injury will be treated and your leg will return to normal.”<br/><br/>Hearing Xiao Junxuan’s words, Lin Xiaoxiao was full of confidence in Xiao Jinli. “Then, Doctor Xiao, please help me with my leg.”<br/><br/>The more Grandma Xiao and the maternal grandmother watched Lin Xiaoxiao, the more adorable she seemed.<br/><br/>Her earlier sadness had completely vanished.<br/><br/>Grandma Xiao smiled and said, “Don’t worry, my good baby’s medical skills are excellent, she will definitely cure your leg!”<br/><br/>“Yes, I know. Doctor Xiao is the best doctor in the country.” Lin Xiaoxiao really, really, really had confidence in Xiao Jinli.<br/><br/>Xiao Jinli, “…” It seemed that if she didn’t cure the girl’s leg, she would be unworthy of the title “Divine Doctor.”<br/><br/>Xiao Jinli promised, “Well, for me, your leg injury is just a minor issue. Although the broken spot is a bit shattered, as long as you have a minimally invasive surgery and use the Bone-healing ointment, you will recover within one month.”<br/><br/>“Huh, a month?” Lin Xiaoxiao asked anxiously, “Doctor Xiao, do you mean I have to lie in bed for a month and need someone to take care of me?”<br/><br/>Xiao Jinli asked with a smile, “Sister Lin, do you think the time of being taken care of is too short, would you like to make it two months?”<br/><br/>“No, I don’t want anyone to take care of me.” Lin Xiaoxiao shook her head vigorously. “I don’t want to lie in bed for a single day, a month is too long. Doctor Xiao, please, can you shorten the time, please?” The last sentence was obviously filled with a spoiled tone.<br/><br/>“The old saying goes, ‘a hundred days of broken muscles and bones.’ Letting you lie down for a month is already a short time.” Xiao Jinli shook her head and said, “One month of recovery time is already very short.”<br/><br/>A desperate expression immediately appeared on Lin Xiaoxiao’s face.<br/><br/>“Pfft!” Xiao Junxuan laughed and explained, “What my sister meant was that you won’t need to lie in bed for the entire month. In the initial treatment, you’ll need to lie in bed, but during the later recovery period, you won’t.”<br/><br/>Although he was not a doctor himself, he had learned a bit about medicine from having a Divine Doctor sister.<br/><br/>“Oh, so that’s how it is!” Lin Xiaoxiao breathed a sigh of relief. “That’s good; I thought I would be in bed for the whole month. A whole month in bed would cause mold.”<br/><br/>Xiao Jinli explained, “During the treatment phase, you need to lie in bed and not move. After the surgery and applying the Bone-healing ointment, it will take about seven days. After seven days, you can sit in a wheelchair and go outside, and after fifteen days, you can slowly stand up.”<br/><br/>“Oh, so I still need to be bedridden for fifteen days.” Lin Xiaoxiao seemed disappointed.<br/><br/>The maternal grandmother said with a smile, “A hundred days of broken muscles and bones, this time is already very short, child, just bear with it. In just seven days, you can sit in a wheelchair and visit our Xiao Family Village. Our Xiao Family Village is very beautiful.”<br/><br/>“Yes, I’ve heard of Xiao Family Village as a beautiful rural area.” Lin Xiaoxiao smiled and said, “Since I’m here, I have to take a good look at it.”<br/><br/>Grandma Xiao smiled and said, “Yes, you should take a good look. Maybe you’ll fall in love with our Xiao Family Village.” She glanced subtly at her silly-smiling grandson.<br/><br/>It seemed that the young man had taken a fancy to the girl.<br/><br/>At that moment, Xiao Jinli asked, “Sister Lin, you are from Capital City. Do you want to notify your family about your injury?”<br/><br/>When the subject of family was brought up, Lin Xiaoxiao’s eyes darkened and her brows furrowed.<br/><br/>After a while, she shook her head, “No need. Even if the old man knew, he would only scold me, and I don’t want him to. He won’t worry about me anyway. Besides, he has another obedient daughter beside him, so I don’t want to disturb his favored daughter’s filial piety.”<br/><br/>Listening to Lin Xiaoxiao lightly and breezily talk about family, everyone didn’t bring it up any further.<br/><br/>It seemed that this child didn’t get along well with her family.<br/><br/>Maternal grandmother said, “Alright, we won’t let them know.”<br/><br/>Soon after, Xiao Jinli entered the treatment phase, and several skilled orthopedic doctors from the hospital followed and studied by her side.<br/><br/>On the other side, Grandma Xiao, the maternal grandmother, Xiao Junxuan and Su Yichen went to the lounge.<br/><br/>Xiao Junxuan couldn’t wait to ask, “Xiao Quan, is Lin Xiaoxiao the one you know?”<br/><br/>Since Xiao Junxuan had fallen for Lin Xiaoxiao, he naturally cared more about her affairs.<br/><br/>This love came so unexpectedly.<br/><br/>It wasn’t exactly love at first sight, and it wasn’t deep affection from a long time together—they had only been together for a short day or two, and most of that time, the other party was unconscious.<br/><br/>What he liked was her kind, cheerful and objective heart.<br/><br/>So, he wanted to know more about Lin Xiaoxiao.<br/><br/>Su Yichen nodded, “Yes. This Lin Xiaoxiao is the younger daughter of Lin Chengdong, from Kyoto’s Qianli Group.”<br/><br/>“Qianli Group?” Xiao Junxuan furrowed his brows, “The one that is ranked among the top 30 national enterprises?”<br/><br/>“Exactly.” Su Yichen nodded.<br/><br/>“But it seems that Lin Xiaoxiao doesn’t get along well with her family?” Xiao Junxuan asked doubtfully, “Xiao Quan, do you know what’s going on?”<br/><br/>Su Yichen shook his head, “This is their family matter, and I don’t know much about it. However, according to rumors, it is because Lin Chengdong is too biased towards his older daughter, causing dissatisfaction and even running away from home in his younger daughter, who is unwilling to return.”<br/><br/>“So, Lin Xiaoxiao doesn’t get along well with her sister?” Xiao Junxuan asked.<br/><br/>“It’s said that Lin Chengdong’s older daughter is adopted. She is actually the daughter of Lin Chengdong’s former comrade. In his early years as a soldier, that comrade saved him but sacrificed himself. That man’s wife ran away, leaving a daughter with her grandparents in the village. After Lin Chengdong retired, he adopted her.”<br/><br/>“In that case, Lin Chengdong is not wrong, and it’s understandable for him to be biased.” The maternal grandmother was puzzled, “But Xiaoxiao seems to be a sensible child, how could she make a fuss about this?”<br/><br/>Su Yichen shook his head, “It doesn’t seem to be that simple.”\t\t\t\t\t\t</div>", "images": {}, "success": true}