{"id": 336, "url": "https://www.novelhall.com/the-lucky-star-blessing-the-whole-village-32483/15193428.html", "title": "Chapter 336 - Chapter 336: Chapter 336:", "volume": 4, "volume_title": "Volume 4", "body": "<h1>Chapter 336 - Chapter 336: Chapter 336:</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 336: Chapter 336:<br/><br/>“I heard that Lin Chengdong’s younger daughter, Lin Xiaoxiao, has an arrogant and domineering personality. She bullies her adopted sister every day in front of the servants and maids,” Su Yichen shares what he knows. “Lin Chengdong is also constantly being irritated by his biological daughter, causing his heart disease to flare up every three days.”<br/><br/>Grandma Xiao frowned and asked in confusion, “Why would Xiaoxiao bully her adopted sister? Since her adopted sister’s father saved her father’s life, Xiaoxiao should treat her adopted sister kindly, right?”<br/><br/>Su Yichen shook his head, “I don’t know about that either.” As it was someone else’s family matter, he wouldn’t investigate it. What he knew was from stories within their circle.<br/><br/>The reason it reached his ears was that Lin Chengdong wanted to match Lin Xiaoxiao with him, so some people intentionally told him about it.<br/><br/>Maternal grandmother said, “Xiaoxiao seems to be a sensible and kind child. You’ve only heard about it, not seen it with your own eyes, right? Perhaps there’s some hidden truth behind this.”<br/><br/>“I agree with that,” Grandma Xiao nodded. “This child has been kidnapped, but she didn’t hesitate to report it to the police to prevent more girls from being hurt. I don’t believe such a kind person would treat the daughter of her father’s lifesaver so harshly. There must be some inside story that we don’t know.”<br/><br/>At this point, she suddenly realized something and asked, “Xiao Quan, does Lin Chengdong have a son?”<br/><br/>Su Yichen shook his head and said, “No, just a biological daughter and an adopted daughter.”<br/><br/>Grandma Xiao immediately understood the crux of the matter.<br/><br/>She said, “Lin Chengdong has two daughters, one adopted and one biological. For ordinary people, such a large family business would definitely go to their biological daughter. Has Lin Chengdong ever said who he’s going to leave his family business to?”<br/><br/>Su Yichen shook his head, “I don’t know. However, I heard that Lin Chengdong initially intended to leave the family business to Lin Xiaoxiao. But Lin Xiaoxiao didn’t seem to be interested in his company and treated her adopted sister poorly, frequently aggravating his heart condition. It’s unclear whether Lin Chengdong wanted to provoke her or was truly fed up with his daughter. He has said that he wanted to leave the family business to his adopted daughter instead.”<br/><br/>After hearing this, Grandma Xiao and the maternal grandmother exchanged glances, having a slightly better understanding of the situation.<br/><br/>Su Yichen thought for a moment and said, “Maternal grandmother, Grandma, should I go investigate this?”<br/><br/>Just now in the sickroom, he noticed that Xiao Junxuan might have had some special feelings towards Lin Xiaoxiao. If Lin Xiaoxiao’s character is good, she would probably become a part of the Xiao Family in the future.<br/><br/>After considering for a moment, the maternal grandmother said, “Never mind. If Xiaoxiao can become a part of the Xiao Family, she will definitely tell us about her family situation in the future.”<br/><br/>At this point, she paused and thought for a moment, “I’m just curious how Xiaoxiao was kidnapped from the Capital City and ended up thousands of miles away in Qingzhai Village. Logically, her family is wealthy, and there should be bodyguards to protect her all the time. I can’t believe that Zhu Chengdong would let his biological daughter go out alone without protection. There must be bodyguards protecting her secretly. So, there might be a scheme behind this.”<br/><br/>Two daughters, one adopted and one biological.<br/><br/>If there is no biological daughter, wouldn’t the vast fortune of the Zhu Family go entirely to the adopted daughter?<br/><br/>Su Yichen nodded, “Alright, I get it.”<br/><br/>Maternal grandmother thought for a moment and said, “Xiao Quan, you should send someone to secretly remind Zhu Chengdong and see if he has realized that his biological daughter has been kidnapped.”<br/><br/>“Okay, I got it, maternal grandmother!” Su Yichen nodded.<br/><br/>In the past, he didn’t care about the Lin Family’s affairs, but if Lin Xiaoxiao has the potential to become a part of the Xiao Family, he should be more concerned.<br/><br/>Lin Xiaoxiao has a bad reputation in the Capital Circle.<br/><br/>Lin Xiaoxiao’s personality is straightforward, daring to love and hate. She also despises the hypocritical socialite circle and has little interaction with the socialite daughters of the circle.<br/><br/>In contrast, her adopted sister has an excellent reputation in the Capital Circle.<br/><br/>In the upper-class circle, Lin Wanqing, her adopted sister, is praised for her gentle and virtuous demeanor and excellent business acumen. She is considered the perfect daughter-in-law by many wealthy families.<br/><br/>Additionally, Lin Wanqing has a good reputation among noble ladies and daughters and is friends with many of them.<br/><br/>Of course, the main reason he knew about Lin Xiaoxiao was that he had business dealings with Lin Chengdong, who had tried to set him up with Lin Xiaoxiao.<br/><br/>However, unlike other socialite daughters who tried to get his attention, Lin Xiaoxiao avoided him like the plague. Not that he had any interest in her, though.<br/><br/>Xiao Junxuan suddenly asked, “Xiao Quan, does Xiaoxiao have friends in the Capital City?”<br/><br/>Su Yichen shook his head and said, “Brother Xuan, I don’t know either. I… actually I don’t know Lin Xiaoxiao well.” He also felt embarrassed to tell Xiao Junxuan that they had once been potential blind dates.<br/><br/>“I can have someone investigate it!” Su Yichen said again, “But, Brother Xuan, I think it’s better to ask Lin Xiaoxiao directly.”<br/><br/>Rumors are really harmful.<br/><br/>Lin Xiaoxiao, such a lovely and kind-hearted girl, was said to be a bad girl who was arrogant and domineering in the circle.<br/><br/>Of course, no matter what kind of girl Lin Xiaoxiao was, she was not Su Yichen’s type.<br/><br/>Xiao Junxuan thought about it and nodded, “You’re right. I’ll ask Xiaoxiao first. If she has friends, she should make a phone call to let them know she’s safe. I’m just worried that her friends may be worried.”<br/><br/>In fact, he wanted to know Lin Chengdong’s attitude through Lin Xiaoxiao’s friends.<br/><br/>Lin Xiaoxiao said that the old man didn’t care about her, and she didn’t need him to care about her, but in fact, she still missed her family’s old man.<br/><br/>Since he had thoughts about Lin Xiaoxiao, he naturally considered everything for her.<br/><br/>On the other side, Lin Xiaoxiao opened her mouth in surprise.<br/><br/>She really didn’t expect that the minimally invasive surgery mentioned by Doctor Xiao was really just that, without anesthesia, only a few silver needles were inserted into her body, and then when the scalpel opened the skin, there was no pain and no blood flowed.<br/><br/>This surgery was also personally performed by Xiao Jinli.<br/><br/>Of course, it is Lin Xiaoxiao who has this treatment now, with the chance to become Xiao Family, that Xiao Jinli personally does the surgery for her.<br/><br/>Xiao Jinli cut open the broken part, then rearranged the shattered bone, sutured the wound, and finally put on a bone-healing ointment.<br/><br/>After a moment of surprise, Lin Xiaoxiao looked at the bone-healing ointment on her leg and asked in amazement, “Doctor Xiao, is the surgery finished?”<br/><br/>It only took a few minutes.<br/><br/>She had heard that such surgery usually takes several hours.<br/><br/>Xiao Jinli nodded and said, “Yes, it’s done. Didn’t I just tell you, it’s just a small surgery after all. Sister Lin, this bone-healing ointment needs to be applied for twenty-four hours, then replaced with another one. Your leg has just had surgery, so you can’t move around. You need to lie in bed for two days.”<br/><br/>“Oh, okay,” Lin Xiaoxiao responded blankly, “Is there anything I should pay attention to?”<br/><br/>Xiao Jinli said, “That is, today and tomorrow, you need to avoid spicy, fishy food and alcohol. After two days, you don’t need to be on a strict diet, you can eat whatever you want. Sister Lin, our Xiao’s dishes are very delicious.”<br/><br/>Lin Xiaoxiao, who was single-minded, didn’t understand the meaning of Xiao Jinli’s words.<br/><br/>She said with a shy smile, “Doctor Xiao, you’ve already helped me a lot. How can I bother you and your family? I’ve heard that Xiao Family Village Cafeteria’s meals are delicious. I’ll just ask the nursing staff to help me get some meals from there.”<br/><br/>“It’s no problem.” Xiao Jinli smiled ambiguously, “Sister Lin, I tell you, my dishes are really hard for ordinary people to eat. Once there was someone who offered a million just for a meal at my house. But my family refused, as we don’t lack money.”<br/><br/>Lin Xiaoxiao was stunned again.<br/><br/>“A million for a meal?” Lin Xiaoxiao seemed to be listening to fairy tales, “How could this be possible?”<br/><br/>“But it’s true.” Xiao Jinli continued to tempt her with a smile, “Sister Lin, if you refuse, you will definitely regret it.”<br/><br/>Lin Xiaoxiao was already a foodie. Hearing that someone offered a million just for a meal, it must be really delicious.<br/><br/>Her eyes sparkled, and she nodded subconsciously, “Yeah, yeah. I’ll have dinner at your house.”<br/><br/>When she realized it, her face turned red, and she said shyly, “Then I’ll take the liberty to bother you.”<br/><br/>Xiao Jinli revealed an aunt’s smile, taking a sister-in-law back home is not a bother.\t\t\t\t\t\t</div>", "images": {}, "success": true}