{"id": 334, "url": "https://www.novelhall.com/the-lucky-star-blessing-the-whole-village-32483/15193426.html", "title": "Chapter 334 - Chapter 334: Chapter 334: (First Update)", "volume": 4, "volume_title": "Volume 4", "body": "<h1>Chapter 334 - Chapter 334: Chapter 334: (First Update)</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 334: Chapter 334: (First Update)<br/><br/>Lin Xiaoxiao was truly surprised that he knew she was from the Capital City.<br/><br/>After all, she was not familiar with him or these people.<br/><br/>However, she looked at Xiao Jinli, who was examining her leg, squinted her eyes, and asked with a hint of confusion, “I feel like I’ve seen this sister somewhere before. Where was it?”<br/><br/>After thinking for a moment, her eyes suddenly widened, and she covered her mouth, pointing at Xiao Jinli and said with astonishment, “You’re Doctor Xiao, aren’t you?”<br/><br/>Her tone was very respectful, and admiration could be seen in her eyes.<br/><br/>Xiao Jinli raised her eyebrows, and asked with a half-smile, “You’ve seen me before?”<br/><br/>Lin Xiaoxiao nodded happily, “Yes, yes, I’ve seen you in the Retirement Home for Cadres. I saw you taking the pulse and diagnosing diseases for a group of old heroes. Doctor Xiao, you’re really amazing.<br/><br/>You’re so young, and you have such great medical skills. My maternal grandfather has told me about you, saying that when you were eleven or twelve, your medical skills surpassed those of the so-called Divine and National Doctor, Doctor Xu. You’ve diagnosed Old Chen and resolved the major hidden danger of the bullet in his body, discovered Elder Zeng’s early brain tumor, and cured it…”<br/><br/>Then, Lin Xiaoxiao seemed to forget her own injuries and spoke non-stop about Xiao Jinli’s past, revealing admiration in her eyes. Yes, it’s the admiration and respect for her idol.<br/><br/>Xiao Jinli and others were,<br/><br/>They didn’t expect Xiao Junxuan’s rescue to bring about a fan of Xiao Jinli.<br/><br/>Xiao Jinli interrupted her endless words and directly asked, “Sister, you…”<br/><br/>“Doctor Xiao, my name is Lin Xiaoxiao!” Lin Xiaoxiao said excitedly, “When my parents named me, they hoped that I would be happy and laugh more, and that one smile could dispel a thousand worries.”<br/><br/>“So Lin, since you’re from the Capital City, how did you end up in Qingzhai Village?” Xiao Jinli asked with curiosity.<br/><br/>She was afraid of touching on Lin Xiaoxiao’s difficulties and didn’t directly mention being sold to Qingzhai Village.<br/><br/>Lin Xiaoxiao shook her head and said, “I don’t know. That day, I was shopping and about to go home, when someone covered my mouth as I passed an alley, and then I passed out. When I woke up, I was in Qingzhai Village. Someone had sold me to the village to become a bachelor’s wife.”<br/><br/>“Seeing the injuries on your body, how did you cope in that village?” Xiao Jinli asked further.<br/><br/>Upon mentioning this, Lin Xiaoxiao’s face became angry and emotional, “That man wanted me to have children with him. I wouldn’t want that, so I resisted fiercely, and then I was beaten by his family.<br/><br/>The old witch even told her son to break my legs. If my legs were broken, I couldn’t fight back no matter what, and once I gave birth to a child, I would willingly stay in their house.”<br/><br/>“When I heard that and saw the five or six people in their family, I was terrified and anxious. But before I could think of a way to deal with them, the man picked up a thick stick and broke one of my legs.<br/><br/>I immediately cried out that I would obey and begged them not to hit me anymore. They thought they had beaten me into submission and that I wouldn’t dare to think of running away, so they let their guard down.”<br/><br/>That night, while they were fast asleep, I escaped. Dragging my broken leg and enduring the excruciating pain, I crawled out, step by step. Sobbing… I don’t know how long I crawled, but I couldn’t move anymore.<br/><br/>But I was so scared and terrified of going back to that place. If it weren’t for you, sir, I… I don’t know what would have happened to me if I had been caught again. Sobbing, I was so afraid, I longed for someone to help me. Sobbing…”<br/><br/>Grandma Xiao had red-rimmed eyes, and she hugged Lin Xiaoxiao, comforting her, “Good child, you’ve been rescued, and you’re safe now. You can rest assured. Don’t worry, this is Xiao Family Village; no bad person can enter, and no one will hurt you again.”<br/><br/>“Mmm, thank you, Grandma!” Lin Xiaoxiao cried.<br/><br/>“How can these bad people be so evil?” The maternal grandmother said angrily, “What kind of society is it now, and they still do such heinous deeds as kidnapping and trafficking women? Aren’t they afraid of getting shot?”<br/><br/>I looked at Su Yichen while Xiao Jinli whispered, “This Lin Xiaoxiao is the younger daughter of Lin Chengdong, the chairman of Kyoto Qianli Group. I heard that this younger daughter is disobedient and often does some unconventional things, which makes Lin Chengdong have heart attacks every day. However, it is said that Lin Chengdong’s elder daughter is an adopted one. This adopted daughter has been raised very well. She is a gentle, dignified, and virtuous woman, and a very capable person.”<br/><br/>Xiao Jinli nodded and said, “Well, I know.”<br/><br/>If nothing unexpected happens, Lin Xiaoxiao would likely become her sister-in-law in the future.<br/><br/>Therefore, she would certainly need to investigate this person thoroughly.<br/><br/>Also, she didn’t believe that Lin Xiaoxiao was kidnapped accidentally.<br/><br/>It was more likely that someone had planned to kidnap her.<br/><br/>As for who planned it, an investigation is needed.<br/><br/>After a while, Xiao Jinli looked at Lin Xiaoxiao and asked very seriously, “Sister Lin, do you plan to call the police?”<br/><br/>For a girl who has been kidnapped, calling the police might lead to criticism.<br/><br/>Society can sometimes be too harsh on women.<br/><br/>Even though she is a victim, she seems like an unforgivable criminal, bearing all sorts of abuse and pointing fingers.<br/><br/>So, calling the police takes great courage and is a result of the girl and her family’s struggle.<br/><br/>Lin Xiaoxiao, however, said without hesitation, “Calling the police, of course! If I don’t report it and expose the human trafficking village, more girls might get hurt in the future.”<br/><br/>Upon hearing this, Grandma Xiao and the maternal grandmother looked at each other and said, “Xiaoxiao, you are a kind girl.”<br/><br/>Liking for Lin Xiaoxiao immediately rose in Xiao Jinli’s heart.<br/><br/>She nodded in agreement, “Yes, we should call the police, otherwise more and more girls will be kidnapped and hurt. But Sister Lin, the person who kidnapped you must be found.”<br/><br/>Lin Xiaoxiao frowned, “But, someone covered my mouth and made me unconscious at that time. I didn’t see the person clearly. I don’t know if I can find them, or if there is any monitoring there to find the person through.”<br/><br/>Xiao Jinli said, “Sister Lin, tell me, when were you made unconscious and where? I will have someone check it out!”<br/><br/>After listening to Xiao Jinli’s question, Lin Xiaoxiao was very surprised, but after thinking about it, many people in the Retirement Home for Cadres had a good relationship with Doctor Xiao.<br/><br/>Lin Xiaoxiao said, “I remember it was on July 3rd, in the evening. I went shopping with my friends at that time. I was planning to leave and checked the time specially. It was 7:23 PM, on Liu Xiang Street.”<br/><br/>Xiao Jinli nodded, “Okay, I got it.”<br/><br/>At this moment, Lin Xiaoxiao suddenly thought of something and asked anxiously, “Doctor Xiao, my leg was broken by them, can it be cured? Will I become disabled?”\t\t\t\t\t\t</div>", "images": {}, "success": true}