{"id": 331, "url": "https://www.novelhall.com/the-lucky-star-blessing-the-whole-village-32483/15193423.html", "title": "Chapter 331 - Chapter 331: Chapter 331: (First Update)", "volume": 4, "volume_title": "Volume 4", "body": "<h1>Chapter 331 - Chapter 331: Chapter 331: (First Update)</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 331: Chapter 331: (First Update)<br/><br/>“Dad, you called for me?”<br/><br/>At the house of Lin, the Chairman of the Kyoto Lin Corporation, Lin Xiaoxiao asked her father as soon as she returned home.<br/><br/>Chairman Lin looked at his daughter’s heavy makeup, dressed like a punk, and said with dissatisfaction, “How many times have I told you not to dress like this? No wonder Su Yichen doesn’t like you.”<br/><br/>Lin Xiaoxiao pursed her lips and said, “I don’t like him either. Dad, what’s the matter that you called me back for?”<br/><br/>Chairman Lin was so angry that he was about to have a heart attack, he clutched his chest and pointed at her angrily, “Can’t I call you back if there’s no problem? How many days have you been away from home? You’re a girl, always out and about, what does that look like? How will you get married in the future?”<br/><br/>Lin Xiaoxiao sneered, “If I can’t get married, then I’ll just stay at home and mooch off you for the rest of my life.”<br/><br/>“You…you…” Chairman Lin was too angry to speak, his pointing hand shaking. After a while, he shouted, “Unfilial daughter, unfilial daughter!”<br/><br/>“Old man, don’t you have a filial daughter by your side?” Lin Xiaoxiao mocked, “You’re still short of one filial daughter.”<br/><br/>“It’s not the same!” Chairman Lin shouted angrily.<br/><br/>“How is it not the same?” Lin Xiaoxiao mocked, “Oh, it’s not the same, one is an adopted daughter, the other is a biological daughter. So, old man, you want both the biological and the adopted daughter to be filial to you, don’t you? I’m saying, aren’t you being too optimistic?”<br/><br/>At this, she changed her tone and said coldly, “Old man, I’ve told you before, in this home, it’s either her or me. Since you want your adopted daughter by your side to be filial, then I, as your biological daughter, will step aside and let you enjoy the father-daughter happiness.”<br/><br/>With that, she turned to leave, walking and saying, “Don’t call me back if it’s not necessary. It would only make you angry and have a heart attack. Also, you have no idea how happy I am alone outside.”<br/><br/>Upon hearing her words, Chairman Lin was so angry that he wanted to stomp his feet. He yelled, “Lin Xiaoxiao, you stop right there, you come back!”<br/><br/>But all that was left for him was Lin Xiaoxiao’s carefree back.<br/><br/>At this point, a girl in a white dress ran over from the stairway of the house and held onto Chairman Lin, asking with concern, “Dad, are you all right?”<br/><br/>Then, she looked outside with a puzzled expression, “I think I saw my sister, is she back?”<br/><br/>In fact, she heard their father-daughter conversation clearly at the upstairs staircase.<br/><br/>Upon hearing that Lin Chengdong called Lin Xiaoxiao to come back to marry Su Yichen, the girl clutched the Huali wood armrailing harder, leaving a few marks.<br/><br/>Lin Wanqing’s eyes were filled with resentment under her drooping eyelids.<br/><br/>She raged, “Lin Chengdong, I’ve always treated you as my biological father, but whenever there’s something good, you want to save it for your biological daughter. You clearly know that I like Su Yichen, yet you still want to take him away from me, for your biological daughter. If that’s the case, don’t blame me for not showing mercy.”<br/><br/>Once their father-daughter argument was over and Lin Xiaoxiao left, she came out.<br/><br/>Lin Chengdong gripped his chest, looking at his daughter’s retreating figure, scowling, “Don’t mention that rebellious girl to me, she just makes me angry when she comes back.”<br/><br/>As he said this, he sighed heavily, “If only Xiaoxiao was as obedient and sensible as you, I wouldn’t have to worry about her.”<br/><br/>Lin Wanqing shook her head and then asked with some suspicion, “Dad, has Xiaoxiao misunderstood me? I can feel her hostility towards me.”<br/><br/>Telling this, she hesitated a moment and said, “Shall I move out? Maybe with me here, Xiaoxiao doesn’t want to come home. If my leaving could make her feel better, then let me go.”<br/><br/>“Leave? What do you mean leave!” Lin Chengdong said loudly, “No one is allowed to leave!”<br/><br/>At this, he sighed lightly and said, “Qingqing, both you and Xiaoxiao are my children, this is your home. If either of you leaves, I will be unhappy.”<br/><br/>“But Xiaoxiao also said that in this home, it’s either her or me!” Lin Wanqing said with a pained expression, “Maybe it’s better if I leave and let Xiaoxiao accompany you. After all, she is your biological daughter, and I am just an adopted daughter.”<br/><br/>“Qingqing, it hurts my heart when you say that,” Lin Chengdong said with a sad expression on his face, “Although you are an adopted daughter, I have always raised you as my own.”<br/><br/>At this, he paused and said, “Qingqing, don’t think too much. Xiaoxiao just misunderstands you. As long as the misunderstanding is cleared up, everything will be fine.”<br/><br/>Lin Wanqing nodded and said, “Well, Dad, I’m going to have a good talk with Xiaoxiao one of these days.”<br/><br/>“That would be best,” Lin Chengdong nodded.<br/><br/>“But, Dad, why did Xiaoxiao come back this time and leave again?” Lin Wanqing asked.<br/><br/>Lin Chengdong frowned and said, “I originally wanted to have a good talk with her about Su Yichen. But that girl didn’t listen to me at all, and we started arguing after just a few words.”<br/><br/>“Su Yichen?” Lin Wanqing’s eyes flickered, and she asked with a puzzled look, “Didn’t Xiaoxiao say she doesn’t like Su Yichen?”<br/><br/>Lin Xiaoxiao had already made a loud fuss about not liking Su Yichen before, so her question wouldn’t raise any suspicions.<br/><br/>“Hmph, she doesn’t know her own blessings,” Lin Chengdong said indignantly, “Su Yichen is such a talented and rich young man. He has money, status, and good looks, plus he’s young. He’d be a perfect match for Xiaoxiao. Hmph, only that child Xiaoxiao would be so unappreciative…it’s better not to talk about it. Qingqing, when you have the time, talk to Xiaoxiao about Su Yichen. He’s really a rare best husband candidate.”<br/><br/>Lin Chengdong didn’t notice that as he spoke, Lin Wanqing’s expression grew darker.<br/><br/>She seethed, “He said he raised me as his daughter, but why does only Lin Xiaoxiao deserve a man like Su Yichen, who is rich, powerful and perfect? Am I, Lin Wanqing, not worthy of him? Hmph, in the end, I, this adopted daughter, am just an outsider. That’s why Lin Chengdong wants to save all the best things in the world for Lin Xiaoxiao. It’s a pity that Lin Xiaoxiao, that idiot, doesn’t know his good intentions and always goes against him.”<br/><br/>Lin Wanqing forced a smile and said, “Dad, don’t worry. With a man like Su Yichen, no girl would not want to marry him. Xiaoxiao is just being contrary to you now. Once she comes to her senses, she’ll naturally listen to you.”<br/><br/>Lin Chengdong nodded when he heard this and said, “Yes, you’re right. I have to wait a while longer to talk to her about Su Yichen.”\t\t\t\t\t\t</div>", "images": {}, "success": true}