{"id": 337, "url": "https://www.novelhall.com/the-lucky-star-blessing-the-whole-village-32483/15193429.html", "title": "Chapter 337 - Chapter 337: Chapter 337:", "volume": 4, "volume_title": "Volume 4", "body": "<h1>Chapter 337 - Chapter 337: Chapter 337:</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 337: Chapter 337:<br/><br/>Capital City<br/><br/>Lin Chengdong glanced at the calendar and realized that it had already been more than ten days since his younger daughter contacted him. His eyebrows immediately furrowed, and his heart became somewhat worried.<br/><br/>He took out his cellphone, flipped through it several times, and found no call records from his younger daughter. A worried expression appeared on his face.<br/><br/>He muttered to himself, “This child, she wouldn’t really want to sever ties with me, would she?”<br/><br/>At this moment, he saw Lin Wanqing coming down the stairs, a clear expression of joy on her face.<br/><br/>He stopped Lin Wanqing, “Qingqing, has Xiaoxiao contacted you recently?”<br/><br/>Lin Wanqing’s joyful expression froze, then she shook her head, “No.”<br/><br/>“No?” said Lin Chengdong, very worried, “This child hasn’t contacted me in more than ten days. Could something have happened? Qingqing, do you know where Xiaoxiao is?”<br/><br/>Lin Wanqing shook her head again, “I don’t know. Dad, you know that Xiaoxiao has a big misunderstanding of me, and she never takes the initiative to contact me.”<br/><br/>Lin Chengdong sighed lightly, “Xiaoxiao is still immature. Wanqing, you should be more tolerant.”<br/><br/>He noticed Lin Wanqing’s more radiant and dazzling attire than usual, and subconsciously asked, “Qingqing, are you dressed so beautifully tonight for a date with your boyfriend?”<br/><br/>Lin Wanqing’s face turned slightly red as she replied with a hint of shyness, “Dad, I don’t have a boyfriend yet. I have an appointment with a company client!”<br/><br/>“Ah, it’s a company client,” Lin Chengdong said with a slight disappointment. “I thought you’d found a boyfriend. Which client is it?”<br/><br/>“It’s Manager Liu from the Marketing Department of the Su Corporation,” said Lin Wanqing. “Dad, it’s almost time. I’ll check with Xiaoxiao later. Don’t worry.”<br/><br/>Lin Chengdong was preoccupied and waved his hand, “You go ahead.”<br/><br/>After Lin Wanqing left, Lin Chengdong muttered, “This child hasn’t contacted me for so long; nothing bad could have happened, right?”<br/><br/>After some thought, he made a phone call, “Hello, Xiao Zhang, where is the second young miss now?”<br/><br/>Xiao Zhang was the bodyguard he had assigned to secretly protect Lin Xiaoxiao.<br/><br/>Xiao Zhang was puzzled, “Boss, didn’t you call and tell me not to protect the second young miss anymore?”<br/><br/>“What?” his heart suddenly dropped, “When did I call you and tell you not to protect the second young miss?”<br/><br/>Xiao Zhang expressed doubt, “It was sixteen days ago.”<br/><br/>“How is that possible?” Lin Chengdong’s voice suddenly rose, “I never made such a phone call!”<br/><br/>Now, Xiao Zhang was shocked. He said, “But boss, I’m sure that sixteen days ago, I received a call from you, and it was your voice. I couldn’t have gotten it wrong.”<br/><br/>What was going on?<br/><br/>Lin Chengdong was silent for a moment.<br/><br/>He remembered.<br/><br/>His cellphone had been missing for an hour.<br/><br/>Perhaps, during that hour, someone had impersonated him and called Xiao Zhang.<br/><br/>“No, something’s not right,” Lin Chengdong immediately realized, “Xiaoxiao must be in trouble. Otherwise, no one would have impersonated me, calling you and telling you not to protect the second young miss. Xiao Zhang, immediately organize everyone to find the second young miss! As soon as possible!”<br/><br/>Xiao Zhang also understood the significance of the matter.<br/><br/>He nodded solemnly, “Alright, boss, I’ll get on it right away!”<br/><br/>After hanging up the phone, Lin Chengdong sat in his study, lost in thought.<br/><br/>Seventeen days ago was when he and his younger daughter, Lin Xiaoxiao, had had a heated argument.<br/><br/>Then, the next day, he went to work and found out that he forgot his cellphone. He called the housekeeper and asked them to bring his phone to the company.<br/><br/>However, the housekeeper told him that they couldn’t find his cellphone.<br/><br/>Later, the housekeeper called again saying that his phone wasn’t in the study or bedroom, but in the second young miss’s room’s drawer.<br/><br/>How did his phone end up in Xiaoxiao’s drawer?<br/><br/>At that time, he was slightly puzzled. Then, he thought that maybe he had missed his younger daughter and left his phone in her room absentmindedly.<br/><br/>With this explanation, he didn’t give much attention to the phone being lost.<br/><br/>Little did he know that his carelessness and presumption had led to such a huge oversight.<br/><br/>Lin Chengdong, nervous, frightened, and uneasy, tightly gripped the chair, muttering, “Xiaoxiao, you must not let anything happen to you.”<br/><br/>He was already in his fifties, and she was his only biological child.\t\t\t\t\t\t</div>", "images": {}, "success": true}