{"id": 330, "url": "https://www.novelhall.com/the-lucky-star-blessing-the-whole-village-32483/15193422.html", "title": "Chapter 330 - Chapter 330: Chapter 330:", "volume": 4, "volume_title": "Volume 4", "body": "<h1>Chapter 330 - Chapter 330: Chapter 330:</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 330: Chapter 330:<br/><br/>On the other hand, the general manager of Su Corporation’s branch company in Ganjiang City was so anxious that his forehead was covered in sweat.<br/><br/>He asked the bodyguard captain anxiously, “The boss disappeared right after he got off the airplane. Didn’t you know? How did you guys protect him? In case something happens to the boss, none of you will be able to bear the consequences.”<br/><br/>The bodyguard captain furrowed his brows, looking at the fuming general manager, and calmly said, “General Zhou, the boss said he had private matters to handle and didn’t want us to follow him.”<br/><br/>“The boss said not to follow him, so you don’t follow him?” General Manager Zhou said angrily, “Do you know who our boss is? He is the richest person in the country, and there are countless eyes watching him. If anything happens to him, not only will the stability of the Su Corporation be affected, but the entire national economy might also tremble or even be shaken.”<br/><br/>The bodyguard captain also helplessly said, “But as subordinates, we have to listen to our boss.”<br/><br/>No bosses like subordinates that are obedient on the surface but do the opposite behind their backs.<br/><br/>They are merely Su Yichen’s subordinates and his bodyguards. They, of course, have to obey his orders.<br/><br/>Zhou Jingming knew this reasoning, but they didn’t know where the boss was, which naturally made them feel agitated, uneasy, and afraid.<br/><br/>After pondering for a moment, Zhou Jingming asked again, “Did the boss really not tell you where he was going?”<br/><br/>The bodyguard captain shook his head and said, “The boss only instructed us to pretend he’s in the hotel.”<br/><br/>Zhou Jingming,<br/><br/>He muttered to himself, “What on earth is the boss trying to do by being so mysterious?”<br/><br/>Then, he said, “Alright, we can’t disobey the boss. Just make sure to protect the boss at the hotel.”<br/><br/>What puzzled him even more was how the boss had left.<br/><br/>He had instructed the bodyguards not to follow him as soon as he got off the plane.<br/><br/>Given the boss’s well-known identity, his presence anywhere would definitely cause a sensation.<br/><br/>The bodyguard said the boss left at the airport.<br/><br/>The airport is also a crowded place, and it gathers many wealthy and influential people.<br/><br/>But, the boss managed to avoid everyone and left the airport without causing any disturbance. How did he do that?<br/><br/>Zhou Jingming left the hotel, while the bodyguards continued to stay and protect the boss.<br/><br/>Meanwhile, in Capital City, at the CEO’s office of a certain large company.<br/><br/>“Are you sure? Su Yichen wasn’t at the hotel? And he left under everyone’s watch?”<br/><br/>“Do you know where he went?”<br/><br/>“Alright, alright, I got it. I’ll have someone investigate his whereabouts immediately!”<br/><br/>/div&gt;<br/><br/>After hanging up the phone, his sharp and clever eyes looked forward, and one hand tapped the desk lightly while muttering, “Su Yichen left without any bodyguards. Is it real or a setup? Regardless, it’s an opportunity for us as long as Su Yichen has left.”<br/><br/>After contemplating for a moment, he made a phone call, “I need to know where Su Yichen is now as soon as possible. For now, we know he took a flight from Capital City to Ganjiang City, and many people saw him get on the plane. But when he arrived at Ganjiang City, he vanished without a trace. You go to the Marriott Hotel Room 8088 in Ganjiang City and check it out. Alright, I need to know the information as soon as possible.”<br/><br/>After hanging up the phone, the corners of his mouth raised slightly, and he sneered, “Su Yichen, no matter where you are, I will find you and trample you under my feet.”\t\t\t\t\t\t</div>", "images": {}, "success": true}