{"id": 332, "url": "https://www.novelhall.com/the-lucky-star-blessing-the-whole-village-32483/15193424.html", "title": "Chapter 332 - Chapter 332: Chapter 332:", "volume": 4, "volume_title": "Volume 4", "body": "<h1>Chapter 332 - Chapter 332: Chapter 332:</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 332: Chapter 332:<br/><br/>Lin Xiaoxiao, dolled-up in her rebel garb, was walking down a small alley, when suddenly a man, hidden behind a black-brimmed hat and a black mask, took out a white cloth and lunged at Lin Xiaoxiao in front of him.<br/><br/>Before Lin Xiaoxiao could react, she passed out.<br/><br/>The man then helped the unconscious Lin Xiaoxiao leave.<br/><br/>At home, Lin Chengdong called Lin Xiaoxiao, but upon hearing the voicemail on the other end, his brow furrowed.<br/><br/>“What’s this girl up to? She’s not answering my calls and hasn’t been home for days.”<br/><br/>He then spoke to Lin Wanqing, who was eating with him across the table, “Qingqing, can you try calling Xiaoxiao? This headstrong girl is so angry with me she won’t even take my calls.”<br/><br/>Although Lin Xiaoxiao had her own apartment and often wouldn’t come home, it was rare for her to not answer her father’s calls, even when they argued.<br/><br/>Lin Wanqing paused for a moment as she was picking up food with her chopsticks. She then set down her chopsticks, took out her cell phone, and dutifully replied, “Okay!”<br/><br/>She then dialed the number. She allowed Lin Chengdong to see the outgoing call display marked “sister”. After a while, the call went through.<br/><br/>“Sister, where are you? Dad misses you!” Lin Wanqing gently asked.<br/><br/>Angrily, the voice on the other end retorted, “This damn old man, didn’t he say to never come back once I had left him? Now, I am miles away from him, and he should stop looking for me.”<br/><br/>With that, the call was abruptly ended.<br/><br/>Lin Chengdong’s face darkened, gritting his teeth he said, “Lin Xiaoxiao, you ungrateful girl, can’t I even say a few words to you?”<br/><br/>Lin Wanqing, looking at the ended call, said, “Dad, she hung up.”<br/><br/>“Bang!”<br/><br/>Lin Chengdong slammed down his chopsticks and angrily said, “This damn girl, can’t I even criticize her without her threatening to sever ties with me? She wants to run away from home? Fine, I hope she runs far far away, and never comes back!”<br/><br/>With that, he stomped out of the room.<br/><br/>“Dad, where are you going? You haven’t finished your meal yet!” Xiaoxiao called after him.<br/><br/>“Who wants to eat? I’m full of anger.” Lin Chengdong shouted back, “This damn girl, she’s driving me crazy!”<br/><br/>Watching Lin Chengdong storm out, a cryptic smirk tugged at the corner of Lin Wanqing’s mouth.<br/><br/>She glanced back at the number she had dialed earlier. Beneath the contact name “sister,” the number differed by a single digit from the one under “ungrateful girl,” a label Lin Chengdong had saved for Lin Xiaoxiao. It was a difference easy to miss for an unobservant eye.<br/><br/>Xiao Junxuan had a business trip. After completing his task, he planned to visit an old classmate in the countryside.<br/><br/>His classmate lived in a secluded mountain village, so he rented a car intending to drive himself there.<br/><br/>But still a fair distance from the village…<br/><br/>A “screeching” sound.<br/><br/>The sound of an emergency braking.<br/><br/>After Xiao Junxuan parked his car, an angry man emerged, looking at the person lying on the ground, he shouted, “I tell you, there’s a driving recorder in my car, don’t even think about staging a crash to swindle me.”<br/><br/>Lin Xiaoxiao laid on the ground, gingerly raising her head. Her face was covered in cuts and bruises, she gasped, “Help… save me!”<br/><br/>Just as Xiao Junxuan was about to respond, chatter arose in the distance.<br/><br/>“Let’s hurry, she won’t run far with a broken leg and injuries.”<br/><br/>“This bitch, I paid twelve thousand for her, and she runs before even giving me a child. I stand to lose a lot.”<br/><br/>“Pi Zi, that woman is so soft and pretty-looking, the child she’d give birth to would definitely be pretty.” A man laughed.<br/><br/>“Exactly, I’ve lived more than half of my life, and aside from the female celebrities on TV, I’ve never seen a woman as beautiful as her. Pi Zi, your purchase of twelve thousand was indeed worth it.”<br/><br/>With that, his eyes shifted, “Pi Zi, after the woman has given birth to your son, can you lend her to me to bear a child? I also want a beautiful and handsome son.”<br/><br/>Before Pi Zi could refuse, he continued, “You just relax, as long as the woman gives me a child, for a girl I’ll give three thousand, for a boy I’ll give you five thousand, how does that sound? Furthermore, you don’t have to pay for her nutritional supplements during her pregnancy.”<br/><br/>Immediately, people chimed in, “Pi Zi, I think this proposal isn’t bad. That woman is so young, after having your son, she can definitely continue to give birth. If you let her bear children for the other men in the village without wives, a year for one, you wouldn’t have to work and still make money, how beneficial. Five thousand a year, fifty thousand in ten years. You’ve lived almost all your life, even borrowing money from relatives and friends to buy a wife. With this income, you could quickly pay back the money borrowed from your relatives and friends…”<br/><br/>The more Xiao Junxuan listed in the colder his face turned.<br/><br/>Due to the long-term effects of Lingquan water, Xiao Junxuan’s hearing was exceptionally sensitive. Despite their talking, he was unable to see these people, being obstructed by the trees and hills, there was a considerable distance between them.<br/><br/>Lin Xiaoxiao, laying on the ground, endured her body’s pain. With blurred eyesight, she looked at the man in front of her and mustered all her strength to produce a mosquito-like sound, “Save me.”<br/><br/>Following that, she passed out.<br/><br/>Now, Xiao Junxuan wouldn’t think that this girl was trying to stage a fake accident.<br/><br/>He bent down and picked up the young girl.<br/><br/>But as soon as he lifted her, one of her legs hung limply.<br/><br/>That leg must be the one that had been broken, as those men had been discussing.<br/><br/>A surge of anger rose within Xiao Junxuan.<br/><br/>How dare these people?<br/><br/>He then looked at the severely bruised girl with a solemn gaze.<br/><br/>How did such a tender and fragile girl, with a broken leg and a body full of injuries, manage to escape?<br/><br/>Hearing the footsteps getting closer, Xiao Junxuan quickly carried the girl into the car.<br/><br/>By the time those men arrived, his car was long gone.<br/><br/>Of course, those men were unaware that the person they were looking for had been taken away.<br/><br/>On his way back, Xiao Junxuan received a call from his old classmate. His classmate told him that an incident had occurred in the village and they were not welcoming outsiders at the moment, so it would be best for him not to visit. The classmate also said he would visit him in the future instead.<br/><br/>Upon hearing his classmate’s words, Xiao Junxuan felt a mix of emotions welling up.<br/><br/>From his classmate’s words, he immediately understood that his classmate was aware of the women being bought in the village, but had chosen to turn a blind eye.<br/><br/>What a waste, such a highly educated person from a key university, yet still clinging to the backward customs of the village.<br/><br/>This old classmate, he couldn’t associate with him anymore.<br/><br/>Xiao Junxuan sighed softly, “:In the future, let’s not visit each other.”<br/><br/>His old classmate was left completely bewildered,\t\t\t\t\t\t</div>", "images": {}, "success": true}