{"id": 341, "url": "https://www.novelhall.com/the-lucky-star-blessing-the-whole-village-32483/15193433.html", "title": "Chapter 341 - Chapter 341: Chapter 338: _2", "volume": 4, "volume_title": "Volume 4", "body": "<h1>Chapter 341 - Chapter 341: Chapter 338: _2</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 341: Chapter 338: _2<br/><br/>So, had Su Yichen actually seen her before?<br/><br/>Oh right, the day she woke up, someone asked her if she was from the Capital City, right?<br/><br/>So, did they recognize her back then?<br/><br/>If not, how did these people know she was from the Capital City?<br/><br/>But among these people, she hadn’t seen anyone who was Su Yichen, right?<br/><br/>“Haha…” Both grandmas laughed, “Actually, when your dad called Xiao Quan, they mentioned the blind date thing on the phone. However, Xiao Quan made it clear to your dad that he doesn’t like you, um, like the feelings between a man and a woman. But he wants to take you as his sister, would you like that?”<br/><br/>Lin Xiaoxiao was dumbfounded when she heard this.<br/><br/>Just because she was trafficked once, the national richest person wanted to take her as his sister.<br/><br/>Her luck must have really struck the jackpot.<br/><br/>Lin Xiaoxiao laughed, “Two grandmas, I am honored to be the sister of the wealthiest person in the country. I am definitely willing, but I don’t know if he would look down on me?”<br/><br/>“He definitely won’t.” Maternal grandmother laughed, “If he despised you, he wouldn’t have mentioned taking you as his sister.”<br/><br/>“Child, your dad really cares about you.” maternal grandmother began again, “When he found out you were missing, he was really worried and mobilized everyone to look for you. Xiao Quan suggested calling the police, but he was worried about the kidnappers making things worse.”<br/><br/>At this point, the maternal grandmother asked with some confusion, “Xiaoxiao, what kind of misunderstanding do you and your dad have? It’s best to be open about anything between a father and daughter. Otherwise, the misunderstanding will deepen.”<br/><br/>Xiao Junxuan also wondered, “Xiaoxiao, because of your disappearance, your dad even called Su Yichen. He wanted to use Su Yichen’s power to find you as soon as possible. Your dad is really concerned and worried about you. So, there must be some misunderstanding between you.”<br/><br/>Lin Xiaoxiao was silent for a moment, then suddenly asked, “You said my dad called Su Yichen on his cell phone, does that mean my dad knows I’m in Xiao Family Village now?”<br/><br/>“Hehe…” Xiao Junxuan thought Lin Xiaoxiao was getting cuter and cuter, he laughed and asked, “You’re just realizing this now?” She’s such a ditz.<br/><br/>Lin Xiaoxiao,<br/><br/>Why did Xiao Junxuan’s smile seem more and more creepy to her?<br/><br/>Both old people watched their grandson (maternal grandson) and Lin Xiaoxiao interact and covered their mouths to laugh secretly.<br/><br/>It seemed that their own grandson (maternal grandson) really had his eye on Lin Xiaoxiao, and there was no way this future daughter-in-law (maternal grandson’s wife) was getting away.<br/><br/>Grandma Xiao laughed, “Don’t worry, we won’t tell your father your whereabouts without your consent.”<br/><br/>Upon hearing this, Lin Xiaoxiao immediately breathed a sigh of relief, “That’s good, that’s good!”<br/><br/>Maternal grandmother asked, “Xiaoxiao, do you really not want to tell your dad that you’re in Xiao Family Village? Do you want to watch your dad worry and be anxious?”<br/><br/>Lin Xiaoxiao shook her head, “Grandma, it’s not like that. I don’t know how to talk to my dad.”<br/><br/>Grandma Xiao still asked, “What kind of misunderstanding did you and your dad have, Xiaoxiao?”<br/><br/>Lin Xiaoxiao remained silent for a moment, then said, “I have a foster sister, and my dad adores her more than me. He wants me to give everything to my foster sister.<br/><br/>At first, she wanted to wear my clothes, but she clearly couldn’t fit into them. Then, in front of me, my foster sister took a pair of scissors and cut my clothes. She turned around and told my dad that I would rather destroy my clothes than let her wear them. My dad believed it right away.<br/><br/>After that, it was about the jewelry. She wanted every piece of jewelry I had. Once, she took my mom’s legacy for me, a sapphire necklace. I didn’t want to give it to her, so she forcibly ripped it off. I was so furious that I cried and pushed her. My dad saw it and immediately slapped me without saying anything…”<br/><br/>Lin Xiaoxiao recounted all the grievances she had suffered.<br/><br/>Xiao Junxuan and the others listened and understood that straightforward Lin Xiaoxiao had encountered a fake, innocent girl who liked to create drama.<br/><br/>But Lin Xiaoxiao’s real dad was also really confused.<br/><br/>How could he not know what his own biological daughter, whom he had cherished for more than a decade, was like? And yet he believed in a fake, innocent girl?<br/><br/>“The most recent big fight I had with my dad was because he wanted me to have a blind date with Su Yichen.<br/><br/>My foster sister found out and secretly told me that no matter if it was Su Yichen, my dad or the entire Lin Family business, she would take it all. I angrily told her to get lost. Then she went crying to my dad, saying I told her to leave and that she’s not part of the Lin Family, doesn’t deserve to live in the Lin Family, and doesn’t deserve to use any assets of the Lin Family.”\t\t\t\t\t\t</div>", "images": {}, "success": true}