{"id": 345, "url": "https://www.novelhall.com/the-lucky-star-blessing-the-whole-village-32483/15193437.html", "title": "Chapter 345 - Chapter 345: Chapter 341:", "volume": 4, "volume_title": "Volume 4", "body": "<h1>Chapter 345 - Chapter 345: Chapter 341:</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 345: Chapter 341:<br/><br/>After leaving the Lin family villa, Lin Wanqing immediately made a call.<br/><br/>As soon as the other party’s ringtone sounded, Lin Wanqing said, “My dad has sent someone to look for Lin Xiaoxiao, why didn’t you tell me?”<br/><br/>Fortunately, she had made thorough preparations beforehand; otherwise, Lin Chengdong would definitely suspect her.<br/><br/>Lin Wanqing said, “My dad wants to call the police, but I stopped him for now. We must come up with a plan to make him let go of that idea.” If the investigation continued, something would surely be discovered.<br/><br/>Although she had made thorough preparations, there was no guarantee that there weren’t any traces or clues that could lead back to her.<br/><br/>Then, she asked, “What’s the situation with Lin Xiaoxiao now? What, she ran away?”<br/><br/>Lin Wanqing was shocked and asked angrily, “How did she run away? How did you watch her? How could you not tell me about such a big thing? Go and find her now. You have to find her before Lin Chengdong’s people do, or we’ll all be dead!”<br/><br/>After hanging up the phone, Lin Wanqing’s face was ashen, but her expression was tense and uneasy.<br/><br/>She rubbed her hands together and muttered, “How did that bitch Lin Xiaoxiao escape? I carefully chose a buyer for her, how could she have run away?”<br/><br/>Where did that bitch escape to?<br/><br/>She had to find her before Lin Chengdong’s people or before Lin Chengdong called the police, otherwise the consequences would be severe.<br/><br/>Suddenly, she thought of something, “That mobile phone, yes, that mobile phone, I have to destroy it now!”<br/><br/>That mobile phone had been used to trick Lin Chengdong before.<br/><br/>Now that Lin Chengdong already knew about Lin Xiaoxiao’s disappearance, the mobile phone was no longer useful.<br/><br/>If someone found it, it would be terrible.<br/><br/>Not to mention other things, Lin Chengdong would suspect her first.<br/><br/>Half an hour later, Lin Chengdong received a phone call.<br/><br/>“Boss, this phone shows that it’s in a house in an old residential area near Capital Sixth Ring. The people in the residential area say that no one has been living in the house, but about twenty days ago, a man in his thirties started occasionally coming and going.”<br/><br/>Lin Chengdong frowned and said, “So, is Xiaoxiao there or not? Xiao Liu, take someone and go check right away.”<br/><br/>He suspected that Lin Xiaoxiao had been kidnapped and taken to that place.<br/><br/>After hanging up the phone, Lin Chengdong walked around the room with an uneasy expression.<br/><br/>After an unknown amount of time, Lin Chengdong’s phone rang again. He picked it up immediately and asked anxiously, “Xiao Liu, did you find Xiaoxiao?”<br/><br/>Xiao Liu said, “Boss, we didn’t find the young lady, but there’s a mobile phone in the house.”<br/><br/>Lin Chengdong couldn’t believe it, “How…how could that be? Where’s my Xiaoxiao? Where did she go?”<br/><br/>Xiao Liu paused for a moment and then said, “Sorry, boss, we haven’t found Second Young Miss yet!”<br/><br/>Lin Chengdong lost his composure for a moment, but then quickly calmed down!<br/><br/>He said, “Xiao Liu, have someone stand guard over there. Someone will definitely go there. Catch the person when they do, he must know where Xiaoxiao is! But remember, be careful and don’t startle the snake!”<br/><br/>“Alright, boss, I understand!”<br/><br/>After hanging up the phone, Lin Chengdong thought for a moment before calling the police!<br/><br/>He needed to use the police’s help to find Xiaoxiao’s whereabouts as quickly as possible!<br/><br/>Although he already suspected Lin Wanqing, it was only a suspicion without any substantial evidence!<br/><br/>With sharp eyes, Lin Chengdong looked towards the door and said with a slightly cold tone, “Lin Wanqing, I hope you haven’t done anything harmful to Xiaoxiao, or else…”\t\t\t\t\t\t</div>", "images": {}, "success": true}