{"id": 342, "url": "https://www.novelhall.com/the-lucky-star-blessing-the-whole-village-32483/15193434.html", "title": "Chapter 342 - Chapter 342: Chapter 338: _3", "volume": 4, "volume_title": "Volume 4", "body": "<h1>Chapter 342 - Chapter 342: Chapter 338: _3</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 342: Chapter 338: _3<br/><br/>“Then, my dad turned around to scold me as well, saying “Lin Family Business” and that I shouldn’t ostracize my adopted sister. Later, for the “Lin Family Business”, my adopted sister had inheritance rights. Upset, I left home and stayed at my own apartment. But during that time, my adopted sister would occasionally call me and say things to anger me.” Lin Xiaoxiao felt really wronged.<br/><br/>Despite such obvious evidence, her father chose to turn a blind eye and relied solely on Lin Wanqing’s one-sided words to blame and accuse her. Over time, her grievances exploded all at once.<br/><br/>Unexpectedly, leaving home had provided an opportunity for some people to cause her to end up in a remote small village, thousands of miles away.<br/><br/>Xiao Junxuan clenched his fist in anger and said, “Is your dad blind or deaf? Why does he trust an outsider more than his own daughter? No wonder you don’t want to go home. If I had such a confused father, I wouldn’t want to go home either.”<br/><br/>Grandma Xiao and her maternal grandmother exchanged looks, this child had really been wronged. No wonder she seemed strange whenever she mentioned her dad.<br/><br/>Grandma Xiao said, “Your adopted sister seems quite complicated, huh?”<br/><br/>Her maternal grandmother asked, “Why does your dad trust your adopted sister so much?”<br/><br/>Grandma Xiao asked curiously, “Is your adopted sister someone your dad adopted because he and your mom couldn’t have children for many years?” If that was the case, one should indeed treat the adopted sister well.<br/><br/>Lin Xiaoxiao shook her head and said, “No. My adopted sister is the daughter of one of my dad’s comrades. That comrade sacrificed himself to save my dad. So, my dad, wanting to repay his life-saving grace, found his family.<br/><br/>Then he found out that the comrade’s wife had already run away, leaving a daughter to live with her grandparents. But the grandparents’ health was poor so they couldn’t do any heavy work, so the burden of the family fell on my adopted sister who was only ten years old.<br/><br/>My dad felt guilty, consulted with her grandparents, and then took my adopted sister away with him. He left some money for them to retire and took her back every year during the Qingming Festival. My dad often told me that if it weren’t for my adopted sister’s dad, he wouldn’t have existed, and neither would I, so he asked me to treat my adopted sister kindly. But the problem is my adopted sister…”<br/><br/>Lin Xiaoxiao felt herself at a loss for words.<br/><br/>Initially, she listened to her parents, carried the mentality of repaying kindness, and attempted to treat her pitiful adopted sister well.<br/><br/>But her adopted sister had regarded her as an enemy from the moment she first met her. In the days that followed, whenever there were people around, she would shed pitiful tears, silently telling everyone that Lin Xiaoxiao had bullied her.<br/><br/>Actually, she did nothing at all.<br/><br/>At that time, she was still young – only about five or six years old. Completely innocent, she faced reprimands from everyone.<br/><br/>“Ah, it’s not your fault that your adopted sister had malicious intent!” Both her maternal grandmother and Grandma Xiao sighed lightly and comforted her, “Your dad perhaps feels guilty for the hardships she experienced in the past. So under the influence of this guilt, he’s become somewhat indifferent to you. Combined with your scheming and deep-thinking adopted sister who can put on a good show, it’s only natural for him to think you’ve done such a thing.”<br/><br/>How could a naive, straightforward child, let alone one with an age gap, compete with such a schematically acting, pitiful looking adopted sister?<br/><br/>Xiao Junxuan grew up in a loving, happy family.<br/><br/>He had never experienced the bitterness of family members scheming against him.<br/><br/>But after falling for Lin Xiaoxiao, he developed sympathy for her, feeling anger towards her adopted sister as well as resentment towards her foolish father.<br/><br/>In anger, he grabbed Lin Xiaoxiao’s hand and said, “Xiaoxiao, from now on, I will be your family. I will never let anyone bully you again, even your own father can’t do it.”<br/><br/>Lin Xiaoxiao was caught off guard when a man clasped her hands and said these words that sounded like a confession, it left her in a daze.<br/><br/>What… what did his words mean?<br/><br/>She was so stunned she couldn’t react.<br/><br/>Looking at this silly girl,<br/><br/>Grandma Xiao took the advantage and said with a smile, “Haha, you silly girl, my grandson has fallen for you. He started liking you from the moment he rescued you. Perhaps, that’s what people call love at first sight.”<br/><br/>“Ha, he likes me?” Lin Xiaoxiao was in disbelief.<br/><br/>She had not expected that the hero who saved her would like her.<br/><br/>Her heart couldn’t help but feel a surge of joy.<br/><br/>Lin Xiaoxiao blushed red and with her head slightly lowered, she whispered quietly, “Actually, I like you too!”\t\t\t\t\t\t</div>", "images": {}, "success": true}