{"id": 340, "url": "https://www.novelhall.com/the-lucky-star-blessing-the-whole-village-32483/15193432.html", "title": "Chapter 340 - Chapter 340: Chapter 338:", "volume": 4, "volume_title": "Volume 4", "body": "<h1>Chapter 340 - Chapter 340: Chapter 338:</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 340: Chapter 338:<br/><br/>Inside Lin Xiaoxiao’s hospital room.<br/><br/>Grandma Xiao and the maternal grandmother were talking to Lin Xiaoxiao.<br/><br/>“Child, I have to tell you, your dad called. He was very worried during the time you were missing,” the maternal grandmother said, “Also, your bodyguard, who was secretly protecting you, was used by someone and withdrawn, allowing the bad guys to success.”<br/><br/>“Yeah, he said you hadn’t called him for more than ten days, and he was very worried about you. At first, he thought your bodyguard was protecting you and didn’t worry too much about not getting through to your phone,” Grandma Xiao also said, “But later, during the days you were missing, the bodyguards didn’t protect you in secret. So, your dad immediately sent people to look for you and called Su Yichen for help.”<br/><br/>“Hmm, Su Yichen suggested your dad report directly to the police and used the force of Yamen to find your whereabouts. But do you know what your dad said?”<br/><br/>Lin Xiaoxiao,<br/><br/>“He feared that you were kidnapped and didn’t want to alert the kidnappers by calling the police. But, considering your dad’s worry, he does have a point. Weren’t you kidnapped during these days you were missing? But the people who kidnapped you just sold you and didn’t ask for a ransom from your dad.”<br/><br/>Lin Xiaoxiao listened, full of doubts.<br/><br/>She looked at the two old ladies and asked, “Grandmothers, do you know my dad?”<br/><br/>“We don’t!” The two old ladies were puzzled.<br/><br/>Lin Xiaoxiao asked incredulously, “If you don’t know my dad, how do you know about my situation, and how do you know it so clearly?”<br/><br/>Grandma Xiao said, “But your dad knows Xiao Quan! He even called Xiao Quan’s cell phone, and then we found out.”<br/><br/>“But who is Xiao Quan?” Lin Xiaoxiao asked again in confusion, “How does my dad know Xiao Quan?”<br/><br/>Xiao Junxuan covered his mouth and snickered on the side.<br/><br/>Family members always called Su Yichen “Xiao Quan,” and they never told Lin Xiaoxiao about it.<br/><br/>Grandma Xiao and the maternal grandmother exchanged a glance, immediately realizing something was wrong.<br/><br/>At this moment, Xiao Junxuan said, “The Xiao Quan that grandma and the maternal grandmother are talking about is Su Yichen.”<br/><br/>“Su Yichen?” Lin Xiaoxiao widened her beautiful eyes in surprise, and asked incredulously, “Is it the Su Yichen I’m thinking of?”<br/><br/>Xiao Junxuan laughed and said, “Yes, it’s the Su Yichen you’re thinking of, the National Richest Person.”<br/><br/>“Damn it!” Lin Xiaoxiao suddenly swore excitedly, “God, what kind of shit fate do I have with Su Yichen? I escaped from him in the Capital City, but couldn’t escape him in Xiao Family Village.”<br/><br/>Grandma Xiao wondered, “Xiaoxiao, why were you hiding from Xiao Quan in the Capital City? Did he bully you? But this kid Xiaoquan is honest and not likely to bully girls.”<br/><br/>“Su Yichen honest?” Lin Xiaoxiao seemed to have heard a big joke, “Grandma, are you talking about Su Yichen as Xiao Quan? There aren’t two people, are there? How can Su Yichen be honest?”<br/><br/>Xiao Junxuan’s face darkened and he said, “So, did Su Yichen really bully you?” Why else would she be so surprised?<br/><br/>Lin Xiaoxiao realized that her words might have caused misunderstandings; she shook her head and said,<br/><br/>“No, no, Su Yichen didn’t bully me. I just heard people say that Su Yichen is decisive and merciless in the shopping mall and is called Cold-hearted Yama.<br/><br/>I didn’t expect that such a cold-blooded person in the shopping mall would be so honest in front of my grandmothers. I…I really can’t believe it.”<br/><br/>“Hehe, so that’s it,” the maternal grandmother laughed, “Child, I’ll tell you, no matter what kind of person Xiao Quan is outside, in front of us, he’s a good kid, an honest one.”<br/><br/>Grandma Xiao brought up the previous topic again; she asked, “Xiaoxiao, what did you mean earlier when you talked about the connection with Xiao Quan?”<br/><br/>Lin Xiaoxiao was very curious about the relationship between Su Yichen and the Xiao Family; her eyes rolled and she said honestly,<br/><br/>“It’s my dad. I’ve told him I don’t like him, but my dad insists on setting up a blind date for us. To avoid him, I’ve hidden from him several times. But I never expected to bump into Su Yichen even in Xiao Family Village.”<br/><br/>She wondered to herself,<br/><br/>How did Su Yichen know she was here? She had been here for so long, and she hadn’t seen Su Yichen.\t\t\t\t\t\t</div>", "images": {}, "success": true}