{"id": 346, "url": "https://www.novelhall.com/the-lucky-star-blessing-the-whole-village-32483/15193438.html", "title": "Chapter 346 - Chapter 346: Chapter 342:", "volume": 4, "volume_title": "Volume 4", "body": "<h1>Chapter 346 - Chapter 346: Chapter 342:</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 346: Chapter 342:<br/><br/>Xiao Family Village<br/><br/>Xiao Jinli heard Lin Chengdong finally called the police, and the corners of her mouth raised, saying, “This confused dad is not completely confused at the critical moment!”<br/><br/>If he was blindly deceived by his adopted daughter, he might really lose his biological daughter.<br/><br/>Xiao Zhi asked, “Master, should we tell Lin Xiaoxiao? After all, Lin Xiaoxiao will be your sister-in-law in the future!”<br/><br/>Xiao Jinli shook her head and said, “No need for me to tell her.”<br/><br/>At dinner, Su Yichen told everyone, “Lin Dong has called the police.”<br/><br/>The Xiao Family was first stupefied and then they “Oh” and said, “This confused dad finally called the police!”<br/><br/>If they didn’t call the police, then they would do it first on this side.<br/><br/>Xiao Father said, “Since the future in-laws have called the police, let’s stick to the plan and let Lin Xiaoxiao report it.”<br/><br/>Although Lin Xiaoxiao and Xiao Junxuan are currently only in the early stage of love, if nothing unexpected happens, Lin Xiaoxiao will only be part of the Xiao Family in the future.<br/><br/>So, Xiao Father called the future in-laws in advance.<br/><br/>“Xiaoxiao will be very happy to hear this news.” Grandma Xiao said.<br/><br/>Xiao Jinli’s eyes turned and she smiled, “Grandma, I’ll tell my brother the news right now.”<br/><br/>Since they confirmed the relationship yesterday, Xiao Junxuan would stay in the ward with Lin Xiaoxiao when he had nothing to do, talking to her about some interesting things from his childhood and the matters of Xiao Family Village.<br/><br/>“Xiaoxiao, my mom made you a braised bone soup today, and the soup is so delicious and fresh.” Xiao Junxuan opened the thermos and poured the soup from the bucket into a bowl.<br/><br/>The fragrance of the soup immediately floated out.<br/><br/>Lin Xiaoxiao wrinkled her nose and laughed lightly, “This soup is really fragrant, the creamy soup is so rich and beautiful. Aunt’s cooking must be admired even by Michelin chefs.”<br/><br/>Xiao Junxuan laughed, “You’re right, there was a Michelin chef who wanted to learn cooking from my mom, but my mom refused. My mom said that her cooking is just casual, not good enough for the big stage.”<br/><br/>“Haha, if Aunt’s cooking isn’t good enough for the stage, then there’s no dish that is.” Lin Xiaoxiao took the warm soup while saying, “Aunt is too modest. Actually, the stuff in Michelin is just more of a good reputation, the taste is nothing special.”<br/><br/>Personally, she didn’t like the taste of Michelin.<br/><br/>It pays too much attention to the surface, but the final product lacks the emotion. So when you eat the food, it’s just a taste in your mouth, nothing resonates with it.<br/><br/>Xiao Junxuan smiled and said, “You like my mom’s cooking, huh? After marrying me, you can eat it every day.”<br/><br/>Lin Xiaoxiao’s expression faltered slightly, her face a mix of anticipation and fear and nervousness.<br/><br/>After all, those who have married know that the mother-in-law and daughter-in-law relationship is the most difficult to handle in the world.<br/><br/>Lin Xiaoxiao said, “I will be very lucky in the future.”<br/><br/>Xiao Junxuan, being a smart guy, saw the slight nervousness on Lin Xiaoxiao’s face. He held her hand and comforted her, “Xiaoxiao, don’t worry about the mother-in-law and daughter-in-law relationship or the sister-in-law relationship after you marry me. I’ll take care of everything. Besides, my mom is really nice and so is my sister. When you get to know them better, you’ll see. In our Xiao Family, there is no mother-in-law conflict. If there is, it means that I failed as a husband and son.”<br/><br/>It is indeed true.<br/><br/>On the Xiao Family’s side, except for the matter between Lan Qingqing and Xiao Mingchen, which was a bit too much, there were no mother-in-law conflicts for anyone else.\t\t\t\t\t\t</div>", "images": {}, "success": true}