{"id": 344, "url": "https://www.novelhall.com/the-lucky-star-blessing-the-whole-village-32483/15193436.html", "title": "Chapter 344 - Chapter 344: Chapter 340: (Second Update)", "volume": 4, "volume_title": "Volume 4", "body": "<h1>Chapter 344 - Chapter 344: Chapter 340: (Second Update)</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 344: Chapter 340: (Second Update)<br/><br/>“Call the police?” Lin Wanqing’s face changed slightly, and her voice became a bit higher, showing great surprise.<br/><br/>“Yes, call the police?” Lin Chengdong nodded and said, “Qingqing, do you think we should call the police?”<br/><br/>“No!” Lin Wanqing said urgently.<br/><br/>Lin Chengdong asked with doubt, “Why not? Your sister has been missing for more than ten days.”<br/><br/>Lin Wanqing said, “We can’t call the police. Dad, I know you are anxious about my sister’s disappearance. But dad, what if she was kidnapped by kidnappers? What if they heard something and decided to kill her? That would put my sister in great danger, so, dad, we cannot call the police!”<br/><br/>Lin Chengdong nodded, “Yes, when I was considering whether to call the police before, I also thought about this problem. However, Qingqing, have you thought about it? Xiaoxiao has been missing for more than ten days, and for us, time is life. It’s best to find Xiaoxiao as soon as possible. But with our own strength, it is difficult to find her in the shortest possible time. So, we have to call the police and use the power of the Yamen, to quickly find your sister Xiaoxiao.”<br/><br/>Lin Wanqing hesitated for a moment, then said comfortingly, “Dad, I know that for us now, time is life. However, we fear the worst. What if Xiaoxiao was indeed kidnapped by kidnappers? If they find out we called the police, Xiaoxiao’s situation will be even more dangerous. So, dad, we can’t call the police for now!”<br/><br/>To stabilize Lin Chengdong, she said it was temporary.<br/><br/>Lin Chengdong asked, “Then Qingqing, what do you suggest we do?” When he asked this, Lin Chengdong was almost crying.<br/><br/>After all, Lin Xiaoxiao is his life.<br/><br/>He is worried and scared every day she’s not found.<br/><br/>Lin Wanqing thought for a moment and said, “Dad, don’t worry. How about this, my close friend is the daughter of the deputy director of the Yamen. Maybe I can ask her to secretly help us without filing an official case and get the help of the Yamen.”<br/><br/>Lin Chengdong’s eyes lit up, and he nodded, “That’s a good idea. Then Qingqing, go and contact your close friend now.”<br/><br/>Lin Wanqing hesitated slightly, then excused herself, “Dad, my close friend went to Plum Firm Country today, and I think her cellphone is off because she is on the plane now.”<br/><br/>She glanced at the clock, then continued, “When she gets off the plane, I will call her.”<br/><br/>“Alright, Qingqing, please take care of Xiaoxiao.” Lin Chengdong said sincerely.<br/><br/>Lin Wanqing shook her head and said, “Dad, Xiaoxiao is my sister too. No matter how much she has misunderstood me in the past and doesn’t like me, I will not hold a grudge against her in matters of life and death. Rest assured, dad, I will persuade my close friend.”<br/><br/>“Good!” Lin Chengdong rubbed his forehead and said, “As long as Xiaoxiao is not found, my heart is uneasy every day.”<br/><br/>“Dad, I will go now to find people and mobilize all my connections to find Xiaoxiao.” Lin Wanqing said sincerely, “Dad, you rest at home first, and I will arrange things now.”<br/><br/>“Alright, you go.” Lin Chengdong nodded.<br/><br/>After Lin Wanqing left, Lin Chengdong’s face darkened.<br/><br/>Now he was very sure that Lin Wanqing was related to Lin Xiaoxiao’s disappearance. Even if she wasn’t the mastermind, she must be involved somehow.<br/><br/>Once he was sure Lin Wanqing had left the house, Lin Chengdong immediately made a phone call, “You go to the Telephone Office and get me the call records and locations of the phone number 139 … 018.”\t\t\t\t\t\t</div>", "images": {}, "success": true}