{"id": 348, "url": "https://www.novelhall.com/the-lucky-star-blessing-the-whole-village-32483/15193440.html", "title": "Chapter 348 - Chapter 348: Chapter 344:", "volume": 4, "volume_title": "Volume 4", "body": "<h1>Chapter 348 - Chapter 348: Chapter 344:</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 348: Chapter 344:<br/><br/>He confirmed that the girl who reported the alarm, Lin Xiaoxiao, was indeed his daughter, Lin Xiaoxiao.<br/><br/>Lin Chengdong suddenly sat down in the chair in a panic, unable to believe what he had just heard. “Xiaoxiao, how could Xiaoxiao be kidnapped? She clearly…” She clearly had bodyguards protecting her.<br/><br/>But he stopped before he finished his sentence.<br/><br/>He thought of the incident more than ten days ago, when someone had used his cellphone to send false retreat orders to the bodyguards who were guarding Lin Xiaoxiao.<br/><br/>So, right from the beginning, there had been a plot against Lin Xiaoxiao.<br/><br/>But the most suspicious person was Lin Wanqing!<br/><br/>In the Lin family, the person with the best opportunity to get hold of his cellphone was Lin Wanqing.<br/><br/>The person with the best opportunity to tamper with the monitoring in the Lin family was also Lin Wanqing. Moreover, it was Lin Wanqing who had been telling him for the past ten days that Xiaoxiao was in contact with her.<br/><br/>But he never thought that Lin Wanqing had been deceiving him all along.<br/><br/>Lin Chengdong clenched his fists, his heart full of hatred.<br/><br/>Lin Wanqing, a white-eyed wolf, had used his trust to hurt Lin Xiaoxiao.<br/><br/>What had Xiaoxiao done to deserve this? Why did she have to hurt Xiaoxiao like this?<br/><br/>Lin Chengdong recalled how Lin Wanqing had always complained to him that Xiaoxiao bullied her, that she wanted to wear Xiaoxiao’s old clothes, but Xiaoxiao would rather cut her clothes up than give them to her, and the same was true for her jewelry, bags, etc. Xiaoxiao would rather destroy them than give them away. Xiaoxiao defended herself, saying she hadn’t done any of that.<br/><br/>But he had never believed Xiaoxiao’s defense, always thinking that she was just being evasive.<br/><br/>Lin Wanqing, a poor child from the countryside, would not have the courage to frame her.<br/><br/>Besides, from start to finish, it was always Xiaoxiao who seemed angry and fierce toward Lin Wanqing.<br/><br/>“Mr. Lin, Mr. Lin?” Director Shen saw his shocked and devastated expression and couldn’t help but call out to him in concern. After calling him several times, he finally brought Lin Chengdong back to his senses.<br/><br/>“Mr. Lin, are you alright?” Director Shen asked with concern.<br/><br/>Lin Chengdong shook his head and replied, “I… I’m fine.”<br/><br/>At that moment, he suddenly thought of something and anxiously asked, “Director Shen, is my Xiaoxiao okay?”<br/><br/>But he knew that girls who were kidnapped and trafficked usually had terrible fate in the households of men, where they were not only treated as baby-making machines but were also often beaten and scolded, and it was very difficult for them to escape.<br/><br/>Director Shen smiled and said, “Mr. Lin, you don’t need to worry. Miss Lin Xiaoxiao is doing well now. However…”<br/><br/>At this point, he hesitated for a moment.<br/><br/>“What’s the matter?” Lin Chengdong asked anxiously.<br/><br/>Director Shen said, “In the family where Lin Xiaoxiao was trafficked into, someone broke one of her legs. She’s currently being treated at the hospital.”<br/><br/>“What? Someone broke one of her legs?” Lin Chengdong jumped up in shock. “Xiaoxiao is terrified of pain; even if she catches a cold and has to get an injection, she would cry for half a day. Now that she’s had her leg broken, she must be in so much pain. Xiaoxiao, my poor child.”<br/><br/>Seeing Lin Chengdong’s expression, Director Shen couldn’t help but sympathize. “Mr. Lin, Miss Lin managed to escape from the traffickers even with a broken leg, and she was rescued by someone halfway.”<br/><br/>Dragging a broken leg and running away?<br/><br/>Lin Chengdong stared wide-eyed, hardly able to believe his ears.<br/><br/>Dragging a broken leg and running away, he couldn’t imagine how painful it must have been.<br/><br/>Xiaoxiao, my child, you’ve suffered so much this time.<br/><br/>Director Shen consoled him, “But you can rest assured that Miss Lin has been sent to a divine doctor, and her leg is being treated. If the recovery goes well, her leg will return to normal.”<br/><br/>Of course, he was aware of this information, and all that he had said, because it had been explained to him by his superiors.<br/><br/>“Good, good,” Lin Chengdong, his eyes red-rimmed and teary, nodded. “As long as she can recover, that’s all that matters.”<br/><br/>His daughter, who had never suffered a moment’s hardship in her life, had gone through such a terrible ordeal.<br/><br/>But soon after regaining his composure, he asked, “Director Shen, which hospital is my daughter in right now? I want to see her.”<br/><br/>Director Shen shook his head and replied, “I’m not sure which hospital Miss Lin is in. However, we received the report from Taoyuan Town Yamen.”<br/><br/>Upon hearing this, Lin Chengdong nodded and said, “Thank you, Director Shen.”<br/><br/>Director Shen shook his head and said, “Serving the people is our duty. However, if Mr. Lin has any leads on Miss Lin’s abduction case, you can share them with us.”\t\t\t\t\t\t</div>", "images": {}, "success": true}