{"id": 343, "url": "https://www.novelhall.com/the-lucky-star-blessing-the-whole-village-32483/15193435.html", "title": "Chapter 343 - Chapter 343: Chapter 339:", "volume": 4, "volume_title": "Volume 4", "body": "<h1>Chapter 343 - Chapter 343: Chapter 339:</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 343: Chapter 339:<br/><br/>The most beautiful love is when you like me, I like you, and we both delight in each other. That’s simply sublime.<br/><br/>Xiao Junxuan couldn’t believe it that the girl he liked also liked him in return.<br/><br/>He was brimming with excitement, elation, and joy.<br/><br/>A look of surprise flickered in his eyes. He tightly clutched Lin Xiaoxiao’s hand, and asked in high spirits, “Xiaoxiao, is that true? You like me too?”<br/><br/>Lin Xiaoxiao was rather dumbfounded.<br/><br/>What kind of ears does he have to hear her soft-spoken words?<br/><br/>However, she, Lin Xiaoxiao, is a person who dares to love and hates openly.<br/><br/>If she likes someone, she may as well acknowledge it openly.<br/><br/>Lin Xiaoxiao nodded and said, “Yes, I like you!”<br/><br/>“Haha, that’s fantastic,” Xiao Junxuan could not hold himself back and embraced her, “Xiaoxiao, I like you too. It’s wonderful that you like me. I’m not lovesick after all. Haha…”<br/><br/>The pair of grandmothers were delighted to see their grandsons (maternal grandson) discovering the girls they liked.<br/><br/>Grandma Xiao held Lin Xiaoxiao’s hand and said,” Listen here, child. This grandson of mine may not have many redeeming qualities, but he inherits good traditions from the Xiao family, that is, he knows how to cherish his wife. All men in the Xiao family are wife slaves. Once you marry my grandson, he will definitely pamper you.”<br/><br/>Upon hearing her, Lin Xiaoxiao blushed, “Grandma, we just… just spoke about marriage. It’s rather embarrassing.”<br/><br/>“Haha, what’s embarrassing about it,” Grandma Xiao laughed and said,” Look, one of the unique traits of men in the Xiao family is that they will pursue the girls they fancy at all costs. Your grandmother, for instance, took a long time to be courted by your grandfather. Back then, your grandfather was a notorious petty ruffian from ten miles and eight villages away, wasting his time idling around from village to village, but once he had his sights on your grandmother, he turned a new leaf. Not only did he completely change his bad habits, but he also became a shameless wife slave.”<br/><br/>A curious look flashed in Lin Xiaoxiao’s eyes,”Really, Grandma Xiao?”<br/><br/>“Of course, it’s true. The love story of your grandfather’s pursuit of your grandmother is known to everyone within the vicinity of ten miles and eight villages.”<br/><br/>Her own grandmother also interjected with a smile,”You should know, Xiao’er’s dad was indeed a local ruffian and a scoundrel back then. When he was courting your grandma, I strongly objected to it. Considering my daughter, she is pretty and capable, why would she possibly marry a petty gangster?<br/><br/>But, this ruffian totally transformed himself in pursuit of his wife, and even swore to treat my daughter well all his life. But what’s more, he didn’t just make empty promises. He put his words into action and that eventually won me and her father’s consent. Moreover, the most important thing is, his mother was fond of him.”<br/><br/>Lin Xiaoxiao chuckled and said, “Listening to such stories feels so sweet and adorable.”<br/><br/>“Haha, isn’t it just,” Grandma Xiao burst into laughter and said,”Come to think of it, I’m truly grateful to my daughter-in-law. It was her life-changing influence on my son that made him successful. Hats off to you, for raising such a good daughter.”<br/><br/>Xiao’s mother was indeed beautiful, but she never took it for granted that it was only natural for men to treat her well because of her beauty. She was beautiful, but at the same time, she was virtuous and considerate. She knew how to take care of her man. They, as a couple, have been married for over 30 years, but never once had a fight and always showed mutual concern, tolerance, and respect for each other.<br/><br/>Love is indeed mutual.<br/><br/>Xiao Junxuan straight away confessed,”Xiaoxiao, I also love and cherish you, just like how my dad cherishes my mom. I will make you happy in the future.”<br/><br/>Lin Xiaoxiao nodded and said, “Hmm, I believe you!”<br/><br/>Thousands of miles away from the Capital City, Lin Chengdong had no idea that his worrisome younger daughter had found herself a boyfriend.<br/><br/>He was currently fraught with worry and anxiety.<br/><br/>He was contemplating Su Yichen’s words whether he should call the police.<br/><br/>After notifying the police, using the power of the Yamen, they would definitely be able to find Lin Xiaoxiao faster.<br/><br/>But, what if Lin Xiaoxiao had been kidnapped?<br/><br/>If the kidnappers got wind of their actions, would they then tear up the ticket?<br/><br/>He did not dare to wager!<br/><br/>However, if he did not notify the police, even if they had manpower available or had Su Yichen assist them, they still wouldn’t be able to compare to the Yamen.<br/><br/>Furthermore, when it comes to missing persons, time is of the essence.<br/><br/>While he was deep in thought, Lin Wanqing rushed in, her face anxious. The moment she saw Lin Chengdong, she asked in urgency,” Dad, I heard that Xiaoxiao is missing, is it true?”<br/><br/>At first, Lin Chengdong had suspected that Lin Xiaoxiao’s disappearance was somehow linked to his adopted daughter, Lin Wanqing.<br/><br/>When he heard Lin Wanqing’s question, he carefully observed her expression, then nodded and said,”Yes, Xiaoxiao has gone missing.”<br/><br/>At this point, Lin Chengdong studied Lin Wanqing closely with his sharp gaze and asked sternly,” Qingqing, tell me the truth, have you been in contact with Xiaoxiao over these past few days?”<br/><br/>He never suspected anything before, nor did he ever imagine that Lin Xiaoxiao’s disappearance would be because every two days, he would learn from Lin Wanqing that she had been in contact with Xiaoxiao and she would tell him that Xiaoxiao was doing very well on the outside and he needn’t worry.<br/><br/>On hearing his question, Lin Wanqing’s pupils shrank involuntarily and a look of guilt flashed across her face. Then, she nodded and said,”Yes, I have been.”<br/><br/>She then took out her cell phone and showed him their call logs.<br/><br/>Lin Chengdong saw clearly that it was indeed Lin Xiaoxiao’s phone number.<br/><br/>However, these call logs do not necessarily mean that Lin Xiaoxiao was the one who called Lin Wanqing.<br/><br/>Lin Chengdong then asked,” Qingqing, since you’ve been in touch with Xiaoxiao, do you know where she’s been staying these days?”<br/><br/>Lin Wanqing shook her head and said,”I don’t know. I asked Xiaoxiao several times, but she wouldn’t tell me. And she was particularly harsh to me and asked me to stay out of her business.”<br/><br/>When she said this, Lin Wanqing showed a guilty look and said,”I’m sorry, Dad. If I had known that Xiaoxiao would get into trouble, I should have asked for her address even if she was harsh with me. If I had, we wouldn’t be clueless about where to look now.”<br/><br/>Lin Chengdong continued to study her face, not missing any manifestations of her emotions.<br/><br/>Lin Chengdong shook his head and said,”This is not your fault. Xiaoxiao has always misunderstood you, so it’s understandable that she didn’t disclose her whereabouts.”<br/><br/>However, internally, he was puzzled. Given how contentious her relationship with Qingqing was, he knew for a fact that she wouldn’t call Qingqing and even if Qingqing called her, she’d most likely ignore it.<br/><br/>So, what was the story behind Qingqing’s call logs on her cellphone?<br/><br/>Essentially, she called every two days, and the calls lasted for about two or three minutes.<br/><br/>He had a gut feeling that there might be some issues with this situation.<br/><br/>No, maybe the problem had always been with Lin Wanqing, it was just that it had been overlooked before.<br/><br/>Every question he asked, Lin Wanqing answered without hesitation, but there were flaws everywhere.<br/><br/>Lin Chengdong rubbed his forehead and asked while keeping his composure, “Qingqing, I’m considering a question, do you think we should call the police?”\t\t\t\t\t\t</div>", "images": {}, "success": true}