{"id": 347, "url": "https://www.novelhall.com/the-lucky-star-blessing-the-whole-village-32483/15193439.html", "title": "Chapter 347 - Chapter 347: Chapter 343:", "volume": 4, "volume_title": "Volume 4", "body": "<h1>Chapter 347 - Chapter 347: Chapter 343:</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 347: Chapter 343:<br/><br/>Capital City<br/><br/>Lin Chengdong received a phone call from the Yamen.<br/><br/>“Hello, is this Mr. Lin Chengdong? I’m Xiao Li from the Yamen.”<br/><br/>Lin Chengdong immediately replied, “Comrade Xiao Li, hello, is there any news about my daughter Xiaoxiao?”<br/><br/>Xiao Li said, “Mr. Lin, can you please come to the Yamen? There is some information you need to know.”<br/><br/>Lin Chengdong’s heart suddenly thumped, and he became anxious. He asked urgently, “What news? Has something happened to my daughter Xiaoxiao?”<br/><br/>Xiao Li said, “It’s not clear on the phone. Please come to the Yamen, Mr. Lin. It’s about your second daughter, Lin Xiaoxiao.”<br/><br/>Lin Chengdong immediately replied, “Okay, I’ll come right away.”<br/><br/>As Lin Chengdong put down the phone and was about to leave, he encountered Lin Wanqing rushing back from outside the door.<br/><br/>“Dad, where are you going?” Lin Wanqing asked. “I have news about Xiaoxiao.”<br/><br/>Lin Chengdong hesitated and asked suspiciously, “Qingqing, what did you say? You said you have news about Xiaoxiao?”<br/><br/>Lin Wanqing nodded, her expression excited. “Dad, Xiaoxiao went to Changbai Mountain with her friends.”<br/><br/>“Changbai Mountain?” Lin Chengdong asked suspiciously. “Qingqing, how did you know she went to Changbai Mountain to play? Did you contact her?”<br/><br/>Lin Wanqing shook her head, “No. I called Xiaoxiao, but she didn’t answer. I contacted two of Xiaoxiao’s friends, and they told me she went to Changbai Mountain with her boyfriend.”<br/><br/>At this, she smiled, “Dad, Xiaoxiao has a boyfriend, and she hid it from us. She even went to Changbai Mountain with him without telling us. I heard that her boyfriend is an adventure sports enthusiast, and they went to Changbai Mountain to look for something. Xiaoxiao accompanied him. Dad, you can relax now.”<br/><br/>Lin Chengdong shook his head, “No, if I don’t personally contact Xiaoxiao, I still won’t feel at ease.”<br/><br/>After hearing this, Lin Wanqing frowned and then said, “What can we do now, Dad? Xiaoxiao is in Changbai Mountain, and there’s no signal there. We can’t contact her.”<br/><br/>She continued, “Dad, how about this? I’ll give you her friend’s phone number, and you can talk to them, okay?”<br/><br/>Lin Chengdong said, “Alright, give me her friend’s phone number.”<br/><br/>Lin Chengdong didn’t refuse.<br/><br/>Then, Lin Wanqing gave Lin Chengdong the phone number of the so-called friend of Lin Xiaoxiao.<br/><br/>After giving him the number, Lin Wanqing looked at the car prepared by the driver and asked curiously, “Dad, where are you going?”<br/><br/>Lin Chengdong said, “Going to meet a friend.”<br/><br/>Lin Wanqing didn’t doubt him, and she nodded, “Then, Dad, take care.”<br/><br/>After Lin Chengdong left, a hint of smugness appeared in Lin Wanqing’s eyes.<br/><br/>She believed she had successfully deceived Lin Chengdong.<br/><br/>After all, Lin Chengdong had always trusted her in the past.<br/><br/>Once he got in the car, Lin Chengdong’s face darkened.<br/><br/>Then, he made a phone call, “Xiao Liu, check this phone number!”<br/><br/>Lin Chengdong had Xiao Liu check the number Lin Wanqing gave him.<br/><br/>Lin Wanqing really put a lot of effort into it. It was rare for her to find this excuse.<br/><br/>In the past, he would have completely trusted her and not doubted her at all.<br/><br/>But now, Xiao Liu found Lin Xiaoxiao’s phone number in the morning, and Lin Wanqing told him in the evening that Lin Xiaoxiao had gone to the deep mountain forest with no signal, and even made up a boyfriend.<br/><br/>So, he didn’t believe Lin Wanqing’s words at all now.<br/><br/>Ten minutes later, Lin Chengdong arrived at the Yamen.<br/><br/>The department was indeed paying close attention to Lin Xiaoxiao’s disappearance case.<br/><br/>“Mr. Lin, please follow me.”<br/><br/>Lin Chengdong found Xiao Li, who had called him, and Xiao Li led him to the case investigation department, where the director’s surname was Shen.<br/><br/>As soon as Lin Chengdong saw Director Shen, he asked anxiously, “Director Shen, did you find my daughter Xiaoxiao?”<br/><br/>“Mr. Lin, don’t worry.” Director Shen said solemnly, “Mr. Lin, our department received a report from the Taoyuan Town Yamen that a girl named Lin Xiaoxiao reported a case to them. She was abducted from Capital City and sold to Qingzhai Village in Li City County.”<br/><br/>“What did you say!” Lin Chengdong was shocked and said, “Abducted? Is it my daughter Lin Xiaoxiao?”<br/><br/>He had considered the possibility of Lin Xiaoxiao being kidnapped, but he hadn’t expected that she would be trafficked.<br/><br/>Director Shen shook his head, “As for whether this Lin Xiaoxiao is your daughter, the other side did not report it clearly.”<br/><br/>Lin Chengdong’s mother asked suspiciously, “Why didn’t they report it clearly? Is that girl my daughter or not?”<br/><br/>Director Shen said, “That girl was frightened by being abducted and didn’t reveal much of her personal information. But she’s very kind, and she wants to report the case despite her own reputation. She just doesn’t want other girls to suffer. According to her, there are many trafficked women in Qingzhai Village. This issue is taken very seriously, and the relevant departments are organizing personnel to go to Qingzhai Village to rescue the women.”<br/><br/>Lin Chengdong’s heart tightened.<br/><br/>He asked anxiously, “Director Shen, can you confirm if the girl who reported the case is my daughter Lin Xiaoxiao?”<br/><br/>Otherwise, it really seemed too coincidental.<br/><br/>His daughter Lin Xiaoxiao was missing on this side, and on the other side, there was an abducted girl named Lin Xiaoxiao.<br/><br/>He was very worried.<br/><br/>If it was really his daughter Lin Xiaoxiao, how did she get abducted?<br/><br/>Capital City is not a small place, and it is covered with surveillance cameras.<br/><br/>Director Shen thought for a moment and said, “Alright, wait a moment, and I’ll make another call to ask.”<br/><br/>Lin Chengdong nodded, “Okay, thank you.”<br/><br/>Lin Chengdong waited anxiously by the side.<br/><br/>He didn’t know how long he had been waiting when Director Shen came over, his expression still serious.<br/><br/>He approached Lin Chengdong with a slightly complicated look on his face. After a while, he said, “Mr. Lin, that girl is not willing to disclose who her parents are. But she said she is from Capital City, and she was covered in a small alley in the city, and she fainted. When she woke up, she had already been trafficked to the remote Qingzhai Village.”<br/><br/>Lin Chengdong’s emotions were fluctuating wildly at this moment, and he was extremely nervous.<br/><br/>“However, we checked with the household registration department,” Director Shen continued, “and there are a total of sixteen people named Lin Xiaoxiao in our city. Of those, there are three who are close in age to your daughter Xiaoxiao. One is in the suburbs and working in a supermarket; another is teaching at Municipal Primary School and is working normally; the remaining one is your daughter Lin Xiaoxiao, who is missing.”<br/><br/>The answer was obvious.<br/><br/>When Lin Chengdong heard this, his face turned pale, and he retreated a few steps in panic.<br/><br/>Lin Chengdong still wanted to confirm further, and he said, “So, Director Shen, is the girl who was abducted my daughter Lin Xiaoxiao?”\t\t\t\t\t\t</div>", "images": {}, "success": true}