{"id": 349, "url": "https://www.novelhall.com/the-lucky-star-blessing-the-whole-village-32483/15193441.html", "title": "Chapter 349 - Chapter 349: Chapter 344: _2", "volume": 4, "volume_title": "Volume 4", "body": "<h1>Chapter 349 - Chapter 349: Chapter 344: _2</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 349: Chapter 344: _2<br/><br/>Lin Chengdong’s expression faltered slightly before nodding, “Alright, I will.”<br/><br/>After Lin Chengdong left the Yamen, his entire mental state seemed to have suffered a significant blow.<br/><br/>He never would have imagined that during his daughter’s disappearance, she was actually being trafficked.<br/><br/>And the fact that she was trafficked, it was highly likely that…<br/><br/>The driver saw Lin Chengdong’s dejected state as he walked out of the Yamen and was very concerned.<br/><br/>He stepped forward to support Lin Chengdong and asked worriedly, “Boss, are you alright?”<br/><br/>Lin Chengdong suddenly asked, “Old Chen, did I make a mistake by taking in Lin Wanqing to raise her?”<br/><br/>Old Chen was taken aback, not understanding the question. He shook his head, “Boss, everyone knows you took in the young lady to repay a debt of gratitude, you didn’t do anything wrong.”<br/><br/>“Is that so? No mistake?” Lin Chengdong murmured, “If there was no mistake, then why has it turned out like this?”<br/><br/>He was initially driven by the motive of gratitude to adopt and raise his comrade’s child.<br/><br/>Because she was his comrade and benefactor’s child, he was overly attached to her, even to the point of favoring her more than his own biological children.<br/><br/>However, he never would’ve thought that his repayment of gratitude would hatch a poisonous snake.<br/><br/>After getting in the car, Lin Chengdong fell deep into thought.<br/><br/>Was it his education that failed her, or was her nature always like this?<br/><br/>But she was his comrade’s child. If it was hereditary, she should have inherited her father’s traits.<br/><br/>“Boss, where do you want to go now?” The driver asked.<br/><br/>Lin Chengdong said, “Let’s go home.”<br/><br/>“Yes, Boss!”<br/><br/>When Lin Chengdong returned home, he saw Lin Wanqing wearing bright makeup and in a good mood, coming out of the house.<br/><br/>Perhaps it was because she had resolved Lin Xiaoxiao’s troubles.<br/><br/>Lin Chengdong watched her drive away before calling someone on the phone, “Follow Lin Wanqing, see where she’s going.”<br/><br/>Xiao Family Village Hospital<br/><br/>Xiao Jinli was observing the recovery of Lin Xiaoxiao’s leg.<br/><br/>“Hmm, it’s recovering nicely.” Xiao Jinli said with a smile, “Sister Xiaoxiao, you can get out of bed and move around in the future. However, you still cannot stand up with the bone-healing ointment on, so you can only sit in a wheelchair and go outside to take a look.”<br/><br/>Lin Xiaoxiao’s eyes curved into happy crescents, and she gave Xiao Jinli a thumbs-up, smiling, “You really live up to the title of Divine Doctor! If this broken leg were treated in one of the Capital’s top three hospitals, I’d have to lie down for at least a month. But now, it’s only been three days, and I can already start moving. Haha, it’s fantastic! It’s suffocating lying on this bed all day. I feel like if I lie down any longer, I’ll start growing mold.”<br/><br/>Xiao Jinli teased her, “These days, with my brother chatting with you, how could you be bored enough to grow mold? Besides, my brother moved his work into your ward just so he could chat with you.”<br/><br/>Xiao Family Village Hospital wards were all private rooms.<br/><br/>Being teased by her future sister-in-law, Lin Xiaoxiao felt a little embarrassed, her face flushing slightly, “That’s not the same. Just because I chat with your brother doesn’t mean I want to keep lying in bed.”<br/><br/>She was originally a lively and active person, and her perseverance gained through regular exercise was just as well, or else she wouldn’t have been able to drag her broken leg out of that den of thieves.<br/><br/>Xiao Jinli nodded, understanding, “Sister Xiaoxiao, once you can move around, you can come to our house. Actually, my parents really want to see you, but they’re afraid you might be shy and don’t dare to come. Also, there’s a whole bunch of people in our family besides me, Grandma, and my maternal grandmother who want to meet you.”<br/><br/>Upon hearing Xiao Jinli’s words, Lin Xiaoxiao’s heart started to tense up. Was this the rhythm of meeting the parents? In her current state, how could she meet them?<br/><br/>How could someone as handsome, talented, and accomplished as Xiao Junxuan choose her? She felt unworthy of him.<br/><br/>Xiao Family Village was no ordinary village.<br/><br/>Countless wealthy and influential people from around the world wanted to live there, but none could enter.<br/><br/>The more Lin Xiaoxiao thought about it, the more anxious she became.<br/><br/>Xiao Jinli squinted her eyes and saw Lin Xiaoxiao slightly flustered. She immediately took Lin Xiaoxiao’s hand and gently reassured her, “Sister Xiaoxiao, don’t be nervous. Everyone in our family is very kind and friendly. They all like you a lot, and I like you a lot too!”<br/><br/>Lin Xiaoxiao didn’t know that in Xiao Family Village, it was truly not easy for Xiao Jinli to like someone.<br/><br/>As long as Xiao Jinli liked them, their status in the entire Xiao Family Village would be different.<br/><br/>Gently holding Xiao Jinli’s fair and delicate hand, Lin Xiaoxiao’s heart suddenly calmed down.<br/><br/>She nodded, “Little Sister Jinli, I like all of you, too.”\t\t\t\t\t\t</div>", "images": {}, "success": true}