{"id": 355, "url": "https://www.novelhall.com/the-lucky-star-blessing-the-whole-village-32483/15193447.html", "title": "Chapter 355 - Chapter 355: Chapter 349:", "volume": 4, "volume_title": "Volume 4", "body": "<h1>Chapter 355 - Chapter 355: Chapter 349:</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 355: Chapter 349:<br/><br/>Lin Chengdong was devastated when he found out that Lin Wanqing had arranged for Lin Xiaoxiao to be kidnapped and sold.<br/><br/>He had never thought that his education could fail so thoroughly.<br/><br/>Maybe it was just Lin Wanqing’s nature.<br/><br/>After all, when they first took her in, she was already ten years old, an age where she should know better.<br/><br/>And back in the countryside, her paternal grandparents despised her for being a girl, and thought she was a bad omen since she had supposedly brought the death of her parents. Naturally, they didn’t put much effort into her education and treated her quite harshly, even bordering on abusive. She had to do all the housework, washing clothes, cooking, cleaning, and feeding the pigs, chickens, and ducks. The food for these pigs, chickens, and ducks could not come from the family’s own grain, so she had to go out and pick pigweeds and collect old vegetable leaves. During the busy farming season, she was working in the fields from the crack of dawn until night, with just a steamed bun or cornbread and salted vegetables for her noon meal.<br/><br/>When he learned of her situation, his heart ached with guilt.<br/><br/>If it hadn’t been for saving him, which caused her to lose her father, and then her mother dying later in despair by drowning in the river, she wouldn’t have had to suffer so much.<br/><br/>Therefore, his original plan was to give money to her relatives to raise her and the other kids properly, but seeing her situation, he gave some money to his comrade’s parents and took the girl as his adopted daughter.<br/><br/>It just so happened that the comrade’s family also had the last name Lin, so there was no need to change her name.<br/><br/>He had always pitied her, so he treated her with the utmost love and tolerance, allowing her to enjoy life and not suffer anymore.<br/><br/>But at some point, she had become unrecognizable to him.<br/><br/>Or perhaps she had never changed, and was just good at acting in front of him.<br/><br/>From the very first day she entered their home, his own biological daughter warmly called her sister and took her to her room, wanting to give her something. But as he turned around, he saw tears in her eyes and a look of aggrievement on her face.<br/><br/>Because she was holding tattered clothes in her hands, while his daughter Xiaoxiao held scissors, and she said with grievance, “Sister, I don’t want your clothes anymore, please don’t cut them, it’s such a pity to ruin such beautiful clothes. I… I have never worn new clothes in my life, let alone such beautiful ones.”<br/><br/>Hearing these words, his heart ached at that moment.<br/><br/>For the first time, he scolded his precious biological daughter.<br/><br/>He would never forget the look on his daughter Xiaoxiao’s face at that time, she was stunned and cried out when she heard his scolding, “I didn’t do it, I didn’t do it.”<br/><br/>“If you didn’t do it, are you saying your sister is framing you!” Lin Chengdong didn’t believe his daughter.<br/><br/>Thus, it started with the first time, then there was the second, third, and countless times afterward.<br/><br/>Thinking about it, Lin Chengdong’s eyes turned red.<br/><br/>“It turns out that my Xiaoxiao never wronged or harmed Lin Wanqing. So why didn’t I believe her? I know my own daughter’s character better than anyone else, right? My Xiaoxiao has always been a happy, innocent, and kind-hearted girl. At that time, she was only six years old, innocent and naive. How would she know to frame another girl she had just met? In contrast, in the case of Lin Wanqing, he only saw her superficial side, which was very pitiful and sympathetic. However, a girl without parents or anyone’s love has to be cunning to survive. But why did she want to frame Xiaoxiao the first time they met?”\t\t\t\t\t\t</div>", "images": {}, "success": true}