{"id": 357, "url": "https://www.novelhall.com/the-lucky-star-blessing-the-whole-village-32483/15193449.html", "title": "Chapter 357 - Chapter 357: Chapter 351:", "volume": 4, "volume_title": "Volume 4", "body": "<h1>Chapter 357 - Chapter 357: Chapter 351:</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 357: Chapter 351:<br/><br/>As Xiao Junxuan had said, Lin Chengdong quickly came to the Xiao Family Village Hospital to find someone.<br/><br/>At the hospital reception, Lin Chengdong asked the nurse, “Excuse me, is there a patient here named Lin Xiaoxiao?”<br/><br/>The nurse at the reception looked at him suspiciously and asked, “Who are you?”<br/><br/>Lin Chengdong introduced himself, “My name is Lin Chengdong, I’m looking for a patient named Lin Xiaoxiao, I’m her dad!”<br/><br/>The nurse thought for a moment and said, “Mr. Lin, please wait a moment, let me make a phone call to confirm.”<br/><br/>Many patients at the Xiao Family Village Hospital have special identities, so they must be careful.<br/><br/>After making a phone call, the nurse said, “Alright.”<br/><br/>After hanging up the phone, she said, “Mr. Lin, Miss Lin Xiaoxiao is located in Room 901 on the ninth floor of the Surgical Department.”<br/><br/>Lin Chengdong was very happy when he heard this news. “Thank you!” he said.<br/><br/>With that, he headed towards the Surgical Department, and his bodyguard followed immediately.<br/><br/>The hospital didn’t allow too many bodyguards, only two at most.<br/><br/>Lin Chengdong quickly found the ninth floor of the Surgical Department.<br/><br/>However, when he reached the door of the ward, he hesitated, pacing back and forth, but not daring to enter.<br/><br/>Before he arrived, he had been so eager, but now he had become timid.<br/><br/>He felt guilty for his daughter, so he was ashamed to face her.<br/><br/>At this moment, a handsome young man passed by him, striding directly into the ward.<br/><br/>The man was wearing a suit and dress shoes, clearly not a doctor.<br/><br/>Lin Chengdong immediately raised his guard, looking sharply at Xiao Junxuan with suspicion in his eyes.<br/><br/>Just as he was about to step into the ward, Lin Chengdong stopped him.<br/><br/>“Hey, young man, wait a minute!”<br/><br/>Xiao Junxuan looked at Lin Chengdong, sizing up his future father-in-law with an indiscernible gaze.<br/><br/>“Uncle, are you calling me?” Xiao Junxuan stopped and asked with a seemingly confused look.<br/><br/>Lin Chengdong nodded, and then he asked, “Are you going into this ward?”<br/><br/>“Yes.” Xiao Junxuan nodded his head and said, “Uncle, do you have any questions?”<br/><br/>With a cold face, Lin Chengdong asked, “What’s your relationship with the patient in this ward?”<br/><br/>“Boyfriend and Girlfriend!” Xiao Junxuan directly tossed a bomb at Lin Chengdong.<br/><br/>“What did you say?” Lin Chengdong was so surprised that his volume didn’t decrease.<br/><br/>Lin Xiaoxiao in the ward was talking with Xiao Jinli when she heard the sound, slightly furrowing her brows and wondering, “Why does it sound like my dad’s voice?”<br/><br/>Xiao Jinli asked in cooperation, “Your dad? Didn’t you say he was in the Capital City and couldn’t come here? Maybe you heard it wrong.”<br/><br/>As soon as Lin Chengdong heard this, he stepped into the ward without bothering with Xiao Junxuan, “Didn’t…”<br/><br/>But when he saw his daughter’s appearance, he was stunned.<br/><br/>His daughter had bruises on her face, one purple and one green, and her leg was wrapped in gypsum. He was immediately heartbroken.<br/><br/>He had learned from the government officials that his Xiaoxiao had been kidnapped and sold to a remote mountain village. She had been beaten and had a leg broken by the villagers because she had fiercely resisted. Even so, she had managed to escape.<br/><br/>Hearing it was one thing, but seeing it with his own eyes was another.<br/><br/>Lin Chengdong’s eyes reddened in an instant, and he called out with heartache, “Xiaoxiao?”<br/><br/>Lin Xiaoxiao looked at her father who had suddenly burst into the ward, her expression first astonished, then aggrieved, she turned her face to the other side and humphed, clearly still holding a grudge for what had happened before.<br/><br/>Seeing her like this, Lin Chengdong felt even more distressed. But before he could say anything, Xiao Junxuan walked in, an astonished look on his face, asking, “Xiaoxiao, is this uncle your dad?”\t\t\t\t\t\t</div>", "images": {}, "success": true}