{"id": 354, "url": "https://www.novelhall.com/the-lucky-star-blessing-the-whole-village-32483/15193446.html", "title": "Chapter 354 - Chapter 354: Chapter 348:", "volume": 4, "volume_title": "Volume 4", "body": "<h1>Chapter 354 - Chapter 354: Chapter 348:</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 354: Chapter 348:<br/><br/>“Your dad has sent Lin Wanqing to the Yamen!” Su Yichen stormed into Lin Xiaoxiao’s hospital room, dropping this bombshell which shocked Lin Xiaoxiao.<br/><br/>Lin Xiaoxiao opened her mouth wide, unable to believe what she heard, “Su Yichen, what are you talking about? Who did my dad send to the Yamen?”<br/><br/>“Lin Wanqing!” Su Yichen reiterated, “Your foster sister.”<br/><br/>“Huh, why?” Lin Xiaoxiao asked puzzled, “My father has always been very biased towards her, why would he send her to the Yamen?”<br/><br/>After hearing this, Su Yichen slightly frustratedly said, “Lin Xiaoxiao, do you genuinely not know, or are you pretending to be oblivious?”<br/><br/>Xiao Junxuan was unhappy. He said, “Xiao Quan, Xiaoxiao would never pretend. She’s just having trouble understanding.”<br/><br/>Then, Xiao Junxuan explained, “The abduction of you was arranged by Lin Wanqing. Now that your father is aware, he’s very angry and sent her to the Yamen. He has also gathered some clues and evidence, which he handed over to the Yamen.”<br/><br/>Lin Xiaoxiao listened, greatly astounded.<br/><br/>Still in disbelief, she said, “But didn’t my dad always pamper Lin Wanqing? And after all, Lin Wanqing is the daughter of his lifesaver. Could he really bear to send her to the Yamen?”<br/><br/>Yet, Su Yichen was very impartial, “Your father may be a bit confused when dealing with you and your foster sister, but he still has a sense of right and wrong. Lin Wanqing made a mistake. Not any ordinary mistake, but a crime of trafficking women. This is a crime, your father would absolutely not let it slide.”<br/><br/>He added, “Furthermore, Lin Wanqing is the daughter of his lifesaver, an upstanding comrade. He would certainly not want his daughter to continuously make mistakes and offend the law. Since she committed a crime, she has to bear the consequences.”<br/><br/>Xiao Junxuan nodded in agreement, “Xiaoxiao, Xiao Quan is right. Your father might be confused handling matters between you and Lin Wanqing, but as a former soldier, he has a strong sense of justice. Even to repay a favor, he cannot excuse any crime.”<br/><br/>Besides, he brought her out of the countryside and gave her a wealthy life. If she weren’t so selfish and greedy, always trying to usurp you, your dad would definitely have found her a suitable husband, assuring her a worry-free life.<br/><br/>People really should not be too greedy. Even though Lin Wanqing was already living a luxurious life as the Lin Family’s young miss, she was too greedy, wanting to seize all of the Lin Family’s business.”<br/><br/>“Hold on,” Lin Xiaoxiao finally responded, she asked, “So, Lin Wanqing wanted to harm me, because of the Lin Family’s business?”<br/><br/>“Yes.” Xiao Junxuan nodded, “She confessed herself. She said your dad only superficially favored her. If he truly cared for her, why didn’t he include her in the inheritance? He even wanted to use her as a tool to assist you in the future when you take over the company.”<br/><br/>Lin Xiaoxiao,  was at a loss for words.<br/><br/>She, in fact, didn’t want to inherit the family business at all.<br/><br/>So, every time her dad threatened her with forbidding her from inheriting the company, she took it lightly.<br/><br/>However, she never expected that someone could go to such lengths to harm her because of this.<br/><br/>“Xiaoxiao, are you alright?” Xiao Junxuan looked at Lin Xiaoxiao’s silent expression and called out to her worriedly.<br/><br/>Lin Xiaoxiao shook her head, “I’m okay.”<br/><br/>While holding her hand Xiao Junxuan said, “Lin Wanqing has already admitted to her crime explicitly, she most likely will be sentenced to prison. From now on, you don’t have to worry.”\t\t\t\t\t\t</div>", "images": {}, "success": true}