{"id": 352, "url": "https://www.novelhall.com/the-lucky-star-blessing-the-whole-village-32483/15193444.html", "title": "Chapter 352 - Chapter 352: Chapter 346:", "volume": 4, "volume_title": "Volume 4", "body": "<h1>Chapter 352 - Chapter 352: Chapter 346:</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 352: Chapter 346:<br/><br/>Watching the stubborn Lin Wanqing making excuses for herself, disappointment flickered in Lin Chengdong’s eyes.<br/><br/>Lin Chengdong sharply asked, “You keep saying your sister contacted you. Can’t you tell her voice apart? Is the person who stole the cellphone stupid? They stole the phone and then called you?”<br/><br/>“No, you misunderstand, Dad!” Lin Wanqing kept defending herself. “I’m sure it was my sister who contacted me before. Maybe her phone got lost or stolen in the past couple of days? I haven’t been able to reach Xiaoxiao these days, how am I supposed to know her phone got lost?”<br/><br/>Lin Chengdong nodded slightly without denying, “Fine, let’s say you’re right. Then tell me, if your sister’s phone got lost or stolen, how do you, oh, I meant, her friends know she went to Changbai Mountain?”<br/><br/>Lin Wanqing said somewhat speechlessly, “Dad, if the phone is lost, you can get a new one, right? You can just reactivate the SIM card.”<br/><br/>Lin Chengdong was speechless. He never knew his adopted daughter could be so eloquent and quick-witted. No wonder Xiaoxiao used to be at such a disadvantage around her, even he was deceived by her.<br/><br/>Lin Chengdong nodded again, “Alright, in that case, let’s see who picked up Xiaoxiao’s phone. Give me your phone!”<br/><br/>Lin Wanqing’s face suddenly changed.<br/><br/>She thought Lin Chengdong would use the home landline or his cellphone to call Lin Xiaoxiao, but instead, he wanted to use her phone directly.<br/><br/>Lin Wanqing hesitated, “Dad, my phone is broken, it can’t make calls.”<br/><br/>She stretched her hand into her bag, trying to secretly turn off her phone.<br/><br/>Looking at her fumbling movements, Lin Chengdong eyed her suspiciously, “Oh, is that so?”<br/><br/>Thinking she had successfully deceived him, Lin Wanqing was about to breathe a sigh of relief when her phone, which she hadn’t yet managed to turn off, rang.<br/><br/>Lin Wanqing’s expression changed again, and her hand in the bag was caught in a dilemma, unsure whether to answer the phone or not.<br/><br/>Lin Chengdong looked at her ambiguously, his voice tinged with doubt, “The phone is ringing, why don’t you answer it?”<br/><br/>Regaining her composure, Lin Wanqing smiled and said, “Okay Dad, I’ll answer it.”<br/><br/>She attempted to walk away.<br/><br/>“Answer it here. I want to hear what’s so important that they have to call you in the middle of the night,” Lin Chengdong said coldly.<br/><br/>Lin Wanqing’s expression froze.<br/><br/>She had lied to Lin Chengdong just now, saying her phone was broken. Now, by coincidence, the phone rang, exposing her lie. If she didn’t answer it, she would appear guilty.<br/><br/>Although she was guilty in the first place.<br/><br/>Lin Chengdong stared straight at her. Lin Wanqing had no choice but to answer the phone.<br/><br/>“Turn on speakerphone!” Lin Chengdong added another sentence.<br/><br/>Lin Wanqing,<br/><br/>“Hello!”<br/><br/>As soon as Lin Wanqing said “hello,” the other side anxiously said, “Miss Lin, Lin Xiaoxiao has escaped and called the police. Now the entire Qingzhai Village is being searched, and soon they will trace it back to us. What should we do now?”<br/><br/>Lin Wanqing had no chance to stop the other party from saying all this! Because her phone had been stolen!<br/><br/>As soon as the other party said the first sentence, Lin Chengdong snatched the phone from her hand.<br/><br/>Lin Wanqing’s face turned deathly pale, her expression full of terror and unease.<br/><br/>She couldn’t believe she was so defenseless and exposed right under Lin Chengdong’s watch.<br/><br/>“Hello, hello,” the other party called out a few times without hearing Lin Wanqing’s voice. Sensing something was wrong, they immediately hung up.\t\t\t\t\t\t</div>", "images": {}, "success": true}