{"id": 359, "url": "https://www.novelhall.com/the-lucky-star-blessing-the-whole-village-32483/15193451.html", "title": "Chapter 359 - Chapter 359: Chapter 353:", "volume": 4, "volume_title": "Volume 4", "body": "<h1>Chapter 359 - Chapter 359: Chapter 353:</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 359: Chapter 353:<br/><br/>Lin Chengdong took another look at Xiao Junxuan, tall and handsome, majestic, mature and steady, exuding the charm and temptation of a successful adult man.<br/><br/>Lin Chengdong kept nodding to himself inwardly, thinking, “Not bad, not bad at all.”<br/><br/>Surely, such a man is well-suited for his pampered daughter.<br/><br/>However, when he thought about having only one biological daughter and her marrying into the Xiao Family Village, he worried about who would inherit his vast family business.<br/><br/>Lin Chengdong quickly recalled his earlier plan when he wanted to introduce his daughter to Su Yichen. His plan was for the two of them to get married, and after that, each of them could manage their own family business.<br/><br/>After all, although Su Yichen could be considered the wealthiest person, his own family business was not weak either.<br/><br/>As for this man, he didn’t know how many brothers he had at home. If he could become his son-in-law, that would be perfect.<br/><br/>Of course, he couldn’t let him give up his status as a member of the Xiao Family Village. In the future, they could have more children, and each one could bear a different surname, which would be ideal.<br/><br/>Feeling excited at this idea, Lin Chengdong still looked at Xiao Junxuan with a serious expression and asked, “Young man…”<br/><br/>“Dad, his name is Xiao Junxuan. Don’t keep calling him ‘young man,’” Lin Xiaoxiao said discontentedly.<br/><br/>Lin Chengdong felt a pang in his heart.<br/><br/>In the past, he thought his daughter wasn’t serious about any man. Even an outstanding and dazzling man like Su Yichen didn’t seem to attract her, making him wonder if she had a cold temperament. He worried that one day, on a whim, she would decide to become a nun.<br/><br/>Now he knew that his daughter wasn’t cold, it was just she hadn’t met a man who moved her heart.<br/><br/>Look, after just a few days since they met, she’s already talking about meeting the parents and getting married. Moreover, she’s even defending him in front of her own father.<br/><br/>Seeing his daughter’s attitude, he felt a little apprehensive, worrying that his plan just now might anger her.<br/><br/>Let it be; let her marry him if she wants to.<br/><br/>Afterward, they could have more children together.<br/><br/>Lin Chengdong continued to ask, “Xiao… Junxuan, how many people are in your family? Do you have any siblings?”<br/><br/>His daughter is already talking about marrying him, so he must thoroughly understand his family situation.<br/><br/>Xiao Junxuan introduced, “There are just two of us siblings in my family, along with our parents. Also, we have our paternal grandparents and maternal grandparents…”<br/><br/>Xiao Junxuan explained his family situation, especially the members of the large family, in great detail.<br/><br/>“So, just you and your sister?” Lin Chengdong still wanted to confirm, but he was slightly disappointed.<br/><br/>With just the two siblings, Xiao Junxuan would most likely not be willing to become his son-in-law.<br/><br/>Xiao Junxuan nodded, “Yes, I have a younger sister. Although the cousins are not siblings by blood, there really isn’t much difference.”<br/><br/>“Oh, I see,” Lin Chengdong sighed with some regret.<br/><br/>No matter how many cousins there are, they don’t matter if they are not blood siblings.<br/><br/>Seeing his unhappy expression, Lin Xiaoxiao discontentedly said, “Old man, what does your disappointed look mean? Do you regret that Brother Xuan cannot be your son-in-law?”<br/><br/>Like father, like daughter.<br/><br/>Before Lin Chengdong could react, Lin Xiaoxiao huffed, “Hmph, let me tell you, Brother Xuan will never become your son-in-law, so just give up on that idea.”<br/><br/>In some large aristocratic families, if the woman is an only daughter, it is definitely more reassuring to have a son-in-law join the family. Of course, when they choose a son-in-law, it’s usually someone whose family is not as well off as theirs. This way, they can maintain control when he marries in.<br/><br/>Upon hearing his daughter’s words, Lin Chengdong felt another pang of heartache.<br/><br/>In the past, although they quarreled, at least his daughter was still on his side as her father.\t\t\t\t\t\t</div>", "images": {}, "success": true}