{"id": 356, "url": "https://www.novelhall.com/the-lucky-star-blessing-the-whole-village-32483/15193448.html", "title": "Chapter 356 - Chapter 356: Chapter 350:", "volume": 4, "volume_title": "Volume 4", "body": "<h1>Chapter 356 - Chapter 356: Chapter 350:</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 356: Chapter 350:<br/><br/>“Xiaoxiao, your dad is looking for you,” Xiao Junxuan said to Lin Xiaoxiao. “However, he hasn’t found Xiao Family Village yet, he just appeared in Taoyuan Town asking about your situation at various hospitals.”<br/><br/>As Xiao Junxuan spoke, his hand continued to peel the apple.<br/><br/>Lin Xiaoxiao paused mid-bite of her banana, “He’s here?”<br/><br/>“Yes,” Xiao Junxuan nodded, “He couldn’t find any information about you in the town, so he’ll probably come to Xiao Family Village soon.”<br/><br/>There are a total of four hospitals in Taoyuan Town: Taoyuan Town First People’s Hospital, Taoyuan Town Second People’s Hospital, Taoyuan Town Traditional Chinese Medicine Hospital, and Xiao Family Village Hospital, with no private hospitals.<br/><br/>Due to the rapid development of Xiao Family Village in recent years, it has driven the economic development of the entire county town. Taoyuan Town, being the nearest, has the best development, and many wealthy and powerful families have settled in the area. Everyone is afraid of getting sick and even more worried about delaying treatment at the hospital, making a treatable illness turn fatal by just a short delay.<br/><br/>So many wealthy people have begun to invest in Taoyuan Town’s hospitals.<br/><br/>These three hospitals in Taoyuan Village are now all Level 3 Hospitals.<br/><br/>With Xiao Jinli in charge of Xiao Family Village Hospital and recruiting top medical doctors from all over the country, the hospital naturally has the biggest reputation.<br/><br/>Not only in the whole town but throughout the country.<br/><br/>It’s considered one of the best hospitals in terms of medical skills in the country.<br/><br/>Lin Chengdong doesn’t know which hospital Lin Xiaoxiao is in, so he has to ask about her in each one.<br/><br/>Xiao Junxuan looked at the silent Lin Xiaoxiao and said, “Xiaoxiao, if you don’t want to see him, he won’t find you even if he comes here.”<br/><br/>Lin Xiaoxiao stared at Xiao Junxuan, her expression somewhat hesitant.<br/><br/>She wanted to see him, but the thought of being sold off by Lin Wanqing made her feel resentful towards him.<br/><br/>If he hadn’t been so trusting of Lin Wanqing, she wouldn’t have had the chance to harm him.<br/><br/>But she couldn’t blame him.<br/><br/>He owed a debt of gratitude. Without his comrade’s sacrifice, there wouldn’t be the man he is now, and there wouldn’t be the person she is now.<br/><br/>Lin Wanqing is the daughter of his comrade, so it’s only natural that he shows her pity, love, and favoritism.<br/><br/>It’s just that human hearts are unpredictable.<br/><br/>Who could have thought that such a young child would plot against her the first time they met?<br/><br/>Lin Xiaoxiao thought for a moment and said, “When he finds this place, I’ll see him.”<br/><br/>Xiao Junxuan handed the peeled apple to Lin Xiaoxiao, took the banana from her hand, threw it into the bucket, and nodded, “Alright, I’ll arrange it.”<br/><br/>Then he said seriously, “Xiaoxiao, I didn’t participate in your life before, and I didn’t know you suffered so many grievances. In the future, I will never let you be wronged, by anyone, not even my own parents or your father. They can’t cause you any grievances.”<br/><br/>When Lin Xiaoxiao heard this, tears welled up in her eyes, and she was moved. She nodded and said, “Thank you, Brother Xuan!”<br/><br/>Before she turned six, her mother was still alive, and her parents were loving. They cherished her, their only child, more than anything, and she never suffered any grievances.<br/><br/>But ever since her mother’s accidental death at the age of six and after her father brought back a sister, she had been mistreated every day. From then on, her beloved father never believed her again.<br/><br/>Lin Xiaoxiao thought for a moment and nodded, “Then I’ll see him.”<br/><br/>Xiao Junxuan smiled and nodded, “Alright, I’ll arrange it. You just focus on recovering. Your leg is healing, and although you can get out of bed and move around, my sister said you still need to rest more to heal faster and recover sooner.”<br/><br/>Lin Xiaoxiao smiled and nodded, “Okay!”<br/><br/>“Xiaoxiao,” Xiao Junxuan held her hand that wasn’t holding the fruit, and said seriously, “In these thirty years, I never had feelings for any girl before, and you are the first and will be the last. In the future, we will be together for the rest of our lives. I hope that we can face and solve problems together, alright?”<br/><br/>Lin Xiaoxiao was taken aback but then put down the apple in her hand and gripped his hand back, nodding solemnly, “Yes, Brother Xuan, I will.”<br/><br/>In the first twenty-four years, she also never had a boyfriend or been in love. Xiao Junxuan was the first man she was ever attracted to.<br/><br/>In college, many girls were busy dating and had crushes on boys, and many boys wrote her love letters, even the most popular guy in college confessed to her, but she never felt any affection for them. Her expression was cold, and her heart was unmoved.<br/><br/>Those who confessed to her were either after her looks or background.<br/><br/>Some people privately accused her of pretending to be aloof, but in reality, she was like a black lotus. Some had seen her dancing with other men at the bar.<br/><br/>That’s right. Ever since high school and especially with Lin Wanqing playing tricks on her from time to time, her father’s distrust led her to feel oppressed. So, she needed to vent those suppressed emotions by going to the bar.<br/><br/>The bar owner was a friend of her dad’s and knew her, so when she was at the bar, he looked out for her and never allowed any scoundrels to get close. From time to time, the owner would come over and urge her to go home, saying her dad would worry.<br/><br/>Of course, all she did at the bar was dance and occasionally drink. The waitresses and bartenders were specially instructed to take good care of her and not let her get bullied. Her drinks were never drugged, and even when she got drunk, someone would take her home, either someone from the bar or her bodyguard.<br/><br/>So, she had always been a virtuous girl.<br/><br/>She never would have thought getting sold off once would lead her to meet her true love.<br/><br/>Should she thank Lin Wanqing?<br/><br/>If it hadn’t been for her scheme, perhaps she never would have met such a great man like Xiao Junxuan.<br/><br/>Xiao Jinli and Su Yichen stood outside the door, not daring to look at the pink bubble floating in the room.<br/><br/>Seeing her brother finally in a romantic relationship and possibly getting married soon, she was truly happy for him.<br/><br/>Her brother, this man in his thirties, had finally found his true love.<br/><br/>Xiao Jinli poked Su Yichen’s arm with her finger and whispered, “My brother, this old log, has finally bloomed. Before, when he kept all those girls at arm’s length, I thought he was afraid of women. Who would have thought that when he falls in love, the sweet talk just keeps coming up? Did he inherit this from my dad?”<br/><br/>Xiao Jinli rubbed her chin, deep in thought.<br/><br/>Su Yichen’s gaze fell on the beautiful, cute, and lively girl in front of him, and his heart began to flutter and pound.<br/><br/>He didn’t know why he felt this way, but he knew that the girl before him was the one he, Su Yichen, would strive to protect for the rest of his life.\t\t\t\t\t\t</div>", "images": {}, "success": true}