{"id": 353, "url": "https://www.novelhall.com/the-lucky-star-blessing-the-whole-village-32483/15193445.html", "title": "Chapter 353 - Chapter 353: Chapter 347:", "volume": 4, "volume_title": "Volume 4", "body": "<h1>Chapter 353 - Chapter 353: Chapter 347:</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 353: Chapter 347:<br/><br/>Lin Chengdong listened to the other party’s words, and his anger instantly flared up.<br/><br/>He stared at Lin Wanqing with rage, “Lin Xiaoxiao escaped? Lin Wanqing, you tell me, what is going on? Why would Xiaoxiao want to run away all of a sudden? And where is Qingzhai Village? What does that have to do with you?”<br/><br/>Panic in Lin Wanqing’s heart continued to grow. She moved her mouth, wanting to defend herself, but when she met Lin Chengdong’s sharp gaze, her words got stuck in her throat, making her face turn red and blue.<br/><br/>After a moment, with tears streaming down her face, she shook her head, and sobbed, “I… I don’t know. Someone wants to harm me on purpose. Dad, do you believe me?”<br/><br/>After hearing this, deep disappointment could be seen in Lin Chengdong’s eyes. He sharply said, “Lin Wanqing, why would someone want to harm you all of a sudden?”<br/><br/>“It… It’s Xiaoxiao,” Lin Wanqing suddenly had an idea and spoke with certainty, “Yes, it’s Xiaoxiao. From the first day she entered this house, she has always been dissatisfied with me. Now, she deliberately staged her disappearance, and had someone make a late-night phone call, just to frame me. Dad, you have to believe me.”<br/><br/>At this moment, Lin Chengdong couldn’t describe how he felt.<br/><br/>He never expected that the girl he had raised, would have such a cunning and venomous heart.<br/><br/>Previously, he had been thinking about whether to give Lin Wanqing a chance, as long as she was willing to admit her mistakes, then maybe he could forgive her once and for all. After all, he truly treated Lin Wanqing as his own flesh and blood.<br/><br/>Lin Chengdong shook his head, his spirit broken, and said lightly, “You can explain yourself to the Yamen officials later. As for whether you are being framed, I believe the Yamen will give you justice.”<br/><br/>When Lin Wanqing heard this, her face turned completely pale.<br/><br/>With an incredulous expression, she asked, “You… you called the police?”<br/><br/>She had managed to calm him down before, so what went wrong, causing Lin Chengdong to choose to report her?<br/><br/>Lin Chengdong nodded, “Yes, I called the police.”<br/><br/>Lin Wanqing retreated a few steps in despair, she asked in disbelief, “Dad, why did you call the police? Have you never trusted me?”<br/><br/>Lin Chengdong stared at her with a sharp gaze, and said sternly,<br/><br/>“Actually, I’ve always wanted to believe you. Before, when Xiaoxiao disappeared, I never suspected you.<br/><br/>But then, you told me that Xiaoxiao had always been in contact with you and that I could rest assured.<br/><br/>However, it’s obvious that Xiaoxiao despised you so much, how could she not contact me and only contact you instead? So, I sent someone to the Telecommunications Bureau Chief to check Xiaoxiao’s phone, and it turned out that her phone had always been in Capital City, and kept in a separate house.<br/><br/>Yet you told me that Xiaoxiao went to Changbai Mountain, and you gave me a phone number belonging to one of her friends. When I checked the number, it was obviously newly registered. Lin Wanqing, if you weren’t always aware of Xiaoxiao’s whereabouts, why did you make these moves behind my back?”<br/><br/>Lin Wanqing’s face turned pale, she opened her mouth to say something, but before she could, Lin Chengdong sharply asked another question,<br/><br/>“Why did you keep trying to harm Xiaoxiao? Before, I always thought you were a sensible and well-behaved child. Every time I saw you with Xiaoxiao, you always looked like you were being bullied. I assumed that Xiaoxiao was the one bullying you, so I naturally protected you, which led to me arguing with Xiaoxiao several times a day.”<br/><br/>Yes, he didn’t understand why Lin Wanqing would do this.<br/><br/>He believed that he never treated the two children differently and even treated her better than Xiaoxiao!\t\t\t\t\t\t</div>", "images": {}, "success": true}