{"id": 358, "url": "https://www.novelhall.com/the-lucky-star-blessing-the-whole-village-32483/15193450.html", "title": "Chapter 358 - Chapter 358: Chapter 352:", "volume": 4, "volume_title": "Volume 4", "body": "<h1>Chapter 358 - Chapter 358: Chapter 352:</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 358: Chapter 352:<br/><br/>Xiao Junxuan, of course, knew that Lin Chengdong was Lin Xiaoxiao’s dad but pretended not to know.<br/><br/>Lin Xiaoxiao nodded slightly and said, “Yes, this is my dad!”<br/><br/>Xiao Junxuan immediately went forward and enthusiastically introduced himself, “Uncle, hello, my name is Xiao Junxuan, I am Xiaoxiao’s boyfriend!”<br/><br/>“Boyfriend?” Lin Chengdong only noticed the word “boyfriend,” which sounded particularly harsh to his ears, and he looked at Xiao Junxuan sharply.<br/><br/>Xiao Junxuan, undaunted by his gaze, sincerely said, “Yes, I am Xiaoxiao’s boyfriend Xiao Junxuan, and I am from Xiao Family Village.”<br/><br/>Lin Chengdong looked at his smile, which was very irritating, and he didn’t want to look anymore, so he turned to Lin Xiaoxiao and walked up to her, asking with concern, “Xiaoxiao, I heard from the Yamen people that your leg was broken by someone. How is it now, does it still hurt?”<br/><br/>However, when he looked at Lin Xiaoxiao’s leg, it seemed to have several patches of ointment on it, not to mention plaster, there wasn’t even a piece of gauze, which made Lin Chengdong very puzzled.<br/><br/>According to the Yamen, his daughter Xiaoxiao was rescued by someone five days ago, and her leg was severely injured.<br/><br/>For such a serious injury, wouldn’t you need surgery and a plaster cast?<br/><br/>Also, looking at his daughter’s leg, it seemed that it could bend now.<br/><br/>Could it be that the so-called broken leg was just an external injury?<br/><br/>Lin Xiaoxiao noticed Lin Chengdong’s puzzled gaze, and she said indifferently, “My leg was broken by that beast, and several pieces of bone inside were shattered. My leg has recovered to its current state all because of a Divine Doctor’s intervention. In a few more days, I’ll be able to stand up again.”<br/><br/>Lin Chengdong asked with suspicion, “Which Divine Doctor is so powerful? The bones are shattered, and in just a few days, the recovery is so good? You don’t need to have surgery?”<br/><br/>For such a serious injury, even after surgery, at least half a month of hospitalization would be required.<br/><br/>Lin Xiaoxiao had a smile on her face when she mentioned this. She had stars in her eyes, and there was a sense of showing off in her excitement as she said, “Doctor Xiao, the Divine Doctor from the Retirement Home for Cadres in the Capital City. Her skill heals even the most serious injuries like child’s play.”<br/><br/>“Doctor Xiao?!” Lin Chengdong was astonished, “Xiaoxiao, is it really Doctor Xiao who treated you?”<br/><br/>He had never seen the so-called Doctor Xiao, but in the Capital City, as long as you were in the upper circle, you would have heard of her. Doctor Xiao was rarely seen by anyone outside the Big Courtyard, and even those who were either rich or noble couldn’t afford her services with heavy money.<br/><br/>Lin Xiaoxiao raised her head proudly and said, “Of course. When Doctor Xiao takes action, you can tell the difference. Hmph, my severe leg injury was treated by Doctor Xiao with a minimally invasive surgery to reset the shattered bones. Then, she applied bone-healing ointment to me. In just five or six days, my leg has recovered more than half. Many people say that a broken limb takes a hundred days to heal, but Doctor Xiao says my leg will be fully recovered in at most a month.”<br/><br/>Lin Chengdong exclaimed, “Doctor Xiao’s medical skills are indeed superb, perfectly accomplished, and rejuvenating. Xiaoxiao, I don’t know where Doctor Xiao is, but I should go and thank her in person.”<br/><br/>That Doctor Xiao, who was difficult to invite with heavy money, actually treated his daughter’s leg injury personally. He had to thank her both emotionally and rationally as her father.<br/><br/>Lin Xiaoxiao glanced at Xiao Junxuan and said with an unusual expression, “No need, Doctor Xiao doesn’t need your thanks!”<br/><br/>“That won’t do.” Lin Chengdong shook his head and said, “Xiaoxiao, I still have to thank Doctor Xiao in person, and how much is the consultation fee? I have to pay it.”<br/><br/>Before Lin Xiaoxiao could speak, Xiao Junxuan laughed and said, “Uncle, we will be family in the future, so no need to be so polite.”<br/><br/>Lin Xiaoxiao,  Her face turned red with shyness.<br/><br/>Lin Chengdong didn’t quite catch on, and after hearing Xiao Junxuan’s words, he was displeased and said, “Who is your family? The marriage is not even settled yet.”<br/><br/>Xiao Junxuan laughed and said, “Uncle, our marriage has already been decided. Xiaoxiao and I love each other and are boyfriend and girlfriend. We just need to meet both our parents, and when Xiaoxiao’s leg recovers, we can get married.”<br/><br/>“What?” Lin Chengdong felt like his ears were playing tricks on him, “Meet the parents, get married?”<br/><br/>Immediately, he realized and said angrily, “Who agreed to this?”<br/><br/>He hadn’t seen his daughter for only a few days, and now she not only has a boyfriend but also talks about meeting parents and getting married.<br/><br/>Lin Xiaoxiao’s face turned black right away.<br/><br/>She said coldly, “I agreed. What, you don’t want to meet him? Fine, then you don’t have to meet Brother Xuan’s parents either. Brother Xuan and I will just get married.”<br/><br/>Lin Chengdong felt a lump in his chest, immediately filled with sadness.<br/><br/>His daughter was living in vain.<br/><br/>He clearly didn’t want her to get married, but she snubbed him and wanted to marry someone else.<br/><br/>Lin Chengdong’s face turned awkward, his mouth sour as he said, “Xiaoxiao, Dad didn’t mean that. Dad just feels you guys are moving too fast. You’ve only known each other for a short time, do you really understand each other? If you rush into marriage and find out later that your personalities clash and you fight all the time, what will you do? Dad is not against you, he just wants you to date and understand each other more. Isn’t that right?”<br/><br/>After hearing this, Lin Xiaoxiao scoffed and said, “Heh, how long did you know Lin Wanqing? You met her for just a few days, and you believed and trusted everything she said and did, yet you came to criticize your own daughter.”<br/><br/>When Lin Chengdong was called out like this, his face turned embarrassed and somewhat awkward, as he defended himself, saying, “How could I have known that a child of such a young age would have such a deep mind?”<br/><br/>“Heh, you raised Lin Wanqing for more than ten years. The time was long enough, but how much did you really know about her? And later, did you ever believe me once?” Lin Xiaoxiao questioned aggressively.<br/><br/>Upon hearing this, Lin Chengdong’s face was full of shame, and he fell silent.<br/><br/>Lin Xiaoxiao continued, “So, getting to know someone doesn’t mean that a long time together will help you understand them. When someone is acting in front of you on purpose, even if it takes a long time, all you understand is what the person wants you to understand, commonly known as a hypocrite!”<br/><br/>Lin Chengdong,<br/><br/>Why did it feel like Xiaoxiao had become so quick-witted after this ordeal?<br/><br/>After a while, Lin Chengdong waved his hand and said with some helplessness and sadness, “Forget it, forget it, since you like it, then Dad will support you!”<br/><br/>He turned his head to look at Xiao Junxuan and asked, “Young man, is your family from Xiao Village?” Xiao Junxuan nodded and said, “Yes! I was born and raised in Xiao Family Village!”<br/><br/>The land value of Xiao Family Village now outweighed even that of the Capital City.<br/><br/>People joked that the land of Xiao Family Village was now worth its weight in gold.<br/><br/>Getting a residence in Xiao Family Village had the strictest requirements!<br/><br/>Even if you had money and power, without meeting the qualifications, you couldn’t settle in!<br/><br/>Xiao Family Village people are good, Xiao Family Village people are wonderful!<br/><br/>Lin Chengdong nodded in agreement in his heart!\t\t\t\t\t\t</div>", "images": {}, "success": true}