{"id": 350, "url": "https://www.novelhall.com/the-lucky-star-blessing-the-whole-village-32483/15193442.html", "title": "Chapter 350 - Chapter 350: Chapter 344: _3", "volume": 4, "volume_title": "Volume 4", "body": "<h1>Chapter 350 - Chapter 350: Chapter 344: _3</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 350: Chapter 344: _3<br/><br/>The atmosphere here is really great.<br/><br/>Everyone I’ve met here has a smile on their face, very gentle and simple. Even the doctors and nurses are very patient, gentle, and considerate.<br/><br/>Xiao Jinli smiled and said, “Sister Xiaoxiao, that’s right. Our family is not a violent beast, you don’t need to be nervous and afraid. All of us in our family are looking forward to you joining our big family.”<br/><br/>Upon hearing this, Lin Xiaoxiao was deeply moved and said, “Hmm.”<br/><br/>Xiao Jinli continued, “My brother has been single for over thirty years, and our whole family has been hoping he’ll bring home a daughter-in-law. But our family is very open-minded and won’t rush things. We believe that if there’s destiny, a marriage will come naturally. And see, he went out on a trip and brought back a daughter-in-law. Our whole family is very happy.”<br/><br/>Lin Xiaoxiao looked at Xiao Jinli with a puzzled expression.<br/><br/>Xiao Jinli asked curiously, “Sister Xiaoxiao, why are you staring at me like that? If my brother sees this, he’ll get jealous.”<br/><br/>Lin Xiaoxiao shook her head and jokingly said, “No. When I was living in the Old Cadre Courtyard, I used to hear stories about you. I thought you were a fairy who had descended from the heavens to save these old heroes of our country.<br/><br/>At the same time, for us, you really seemed out of reach. I used to think that if I could meet Doctor Xiao and get her autograph, I would be so excited that I wouldn’t be able to sleep all night. But I didn’t have many chances to enter the Courtyard, and even when I did, I rarely saw you. And even if I did see you, you were treating people and I couldn’t get close.”<br/><br/>But I never thought that one day, I would not only see my fairy in person but also possibly become her family member. So does that make me a fairy too in the future? Hehe…”<br/><br/>Xiao Jinli didn’t expect Lin Xiaoxiao to actually worship her so much and consider her a fairy.<br/><br/>Xiao Jinli nodded and replied, “Yes, yes, yes, in the future, Sister Xiaoxiao will be our family’s fairy. My mom is the Big Fairy, you are the Little Fairy, and you, you’ll be the Middle Fairy.”<br/><br/>Lin Xiaoxiao’s lips twitched, and she laughed, asking, “What exactly is a Middle Fairy, it doesn’t sound good.”<br/><br/>Xiao Jinli thought for a moment and said, “Let’s change it then, how about Xiaoxiao Fairy?”<br/><br/>Lin Xiaoxiao,<br/><br/>Just as Xiao Jinli and Lin Xiaoxiao were chatting happily, Xiao Junxuan and Su Yichen entered the room.<br/><br/>She now knew that the old man in disguise was Su Yichen.<br/><br/>At that time, when she learned of this truth, she was so surprised that her mouth was wide open, big enough to shove an egg in it.<br/><br/>She would have never thought Su Yichen would show up in Xiao Family Village in such attire and a laid-back manner.<br/><br/>Yes, who could have imagined that a 26-year-old genius and the wealthiest person would appear in Xiao Family Village in the disguise of a 60-year-old man, and nobody would know?<br/><br/>As soon as Xiao Junxuan entered, he saw his sister and his girlfriend chatting happily, which also made him happy. He asked, “What are you talking about that’s making you so happy?”<br/><br/>Xiao Jinli said, “We’re talking about adding a Xiaoxiao Fairy to our fairy family.”<br/><br/>“Haha…” Xiao Junxuan also found it funny, and then he said seriously, “Xiaoxiao, your dad already knows you’re in Taoyuan Town, but we didn’t tell him you’re at Xiao Family Village Hospital.”<br/><br/>It’s true, who would think that someone would be in Xiao Family Village?<br/><br/>“However, once he arrives in Taoyuan Town, he will definitely find his way to Xiao Family Village.”<br/><br/>At this point, Xiao Junxuan stopped and looked at Lin Xiaoxiao and asked, “Xiaoxiao, your dad may have been confused before, but he really loves you dearly. Don’t you want to see him?”<br/><br/>Lin Xiaoxiao suddenly fell silent.<br/><br/>It would be a lie to say that she wasn’t wronged by what happened in the past.<br/><br/>She also resented her dad for always favoring an adopted daughter and not giving her any trust, even just once. She felt so wronged.<br/><br/>Su Yichen thought for a moment and said, “Your dad started suspecting Lin Wanqing after he found out you disappeared.”<br/><br/>Lin Xiaoxiao’s eyes lit up immediately, “Really?”<br/><br/>Su Yichen nodded, “Yes. Lin Wanqing used your phone number to deceive your dad at first. But your dad became suspicious and asked someone to investigate, finding your phone in an empty house. Meanwhile, Lin Wanqing kept lying to your dad, saying you found a boyfriend and went with him to Changbai Mountain.”<br/><br/>Lin Xiaoxiao’s eyes filled with anger, “Are you saying that I was abducted and sold because of Lin Wanqing?”<br/><br/>Su Yichen nodded, “From the current clues, it is very likely that she was involved, if not the mastermind, at least an accomplice.”<br/><br/>Lin Xiaoxiao couldn’t believe it and felt angry, “Why? Why would she do that? Whatever she wanted, I gave her – clothes, my room, even my dad. What more does she want from me? Why did she have to treat me like this?”<br/><br/>Lin Xiaoxiao’s emotions seemed to be on the verge of collapsing.<br/><br/>Lin Wanqing was really too malicious.\t\t\t\t\t\t</div>", "images": {}, "success": true}