{"id": 364, "url": "https://www.novelhall.com/the-lucky-star-blessing-the-whole-village-32483/15193456.html", "title": "Chapter 364 - Chapter 364: Chapter 357:", "volume": 4, "volume_title": "Volume 4", "body": "<h1>Chapter 364 - Chapter 364: Chapter 357:</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 364: Chapter 357:<br/><br/>After Xiao Jinli and Su Yichen entered the ward, Su Yichen saw Lin Chengdong in the ward, raised his eyebrows, and said with a smile, “Director Lin is here, Director Lin, when did you arrive?”<br/><br/>Lin Chengdong looked at Su Yichen with doubts and replied, “I just arrived! Who are you?”<br/><br/>Su Yichen, disguised as an old man, looked older than Lin Chengdong!<br/><br/>Lin Chengdong had no impression of this old man.<br/><br/>But from the tone of this old man, it seemed that he was quite familiar with him.<br/><br/>“Pfft!”<br/><br/>Lin Xiaoxiao couldn’t help laughing out loud!<br/><br/>“Haha…”<br/><br/>She laughed so hard that she brought up saline solution!<br/><br/>Xiao Jinli also covered her mouth and started to laugh!<br/><br/>Su Yichen’s face was full of black lines!<br/><br/>Lin Chengdong was perplexed by the two girls’ laughter!<br/><br/>Lin Chengdong asked with a puzzled face, “Xiaoxiao, what’s going on? Is there something wrong with my question? Why is it so funny?”<br/><br/>“Haha…” Lin Xiaoxiao laughed while holding her stomach, “I can’t stand it, my stomach hurts from laughing so hard!”<br/><br/>Lin Chengdong, “…” This child is silly, what’s so funny about this?<br/><br/>Xiao Jinli helplessly introduced, “Director Lin, this is Su Yichen!”<br/><br/>“Su Yichen?” Lin Chengdong didn’t react at first, but after he did, his eyes widened, and he asked in disbelief, “Su Yichen, is it the Su Yichen I’m thinking of?”<br/><br/>Lin Xiaoxiao wiped away a tear, still laughing, “It’s the Su Yichen you’re thinking of! Didn’t I tell you that Su Yichen and Brother Xuan are brothers? Also, this girl next to me is Xiao Jinli, Brother Xuan’s sister, blood sister!”<br/><br/>Emphasizing the words “blood sister.”<br/><br/>As her daughter explained, Lin Chengdong was really astonished, “Director Su, how did you become like this? No, blood sister,”<br/><br/>Suddenly, he widened his eyes again, staring at Xiao Jinli in disbelief, “You are the Divine Doctor Xiao?”<br/><br/>They had just talked about it, and Divine Doctor Xiao was Xiao Junxuan’s blood sister.<br/><br/>He had thought that the Divine Doctor Xiao was a very young girl since everyone in the Capital City circle knew that she was a little goddess-doctor who treated the Old Heroes at the Retirement Home for Cadres!<br/><br/>He thought that “young” would be at least 20 or 30 years old!<br/><br/>But he never expected that this goddess-doctor would be so young, was she even 20?<br/><br/>She looked like a girl in her teens!<br/><br/>Lin Chengdong was dumbfounded and asked, “Is this really the Divine Doctor Xiao? Isn’t she too young?”<br/><br/>Lin Xiaoxiao immediately said with a stern face, “Dad, are you doubting Doctor Xiao? Don’t you know that Doctor Xiao is so young? You should know that when she treated the Old Heroes at the Nursing Home, she was only in her teens. Isn’t it normal for her to be young now?”<br/><br/>It wasn’t strange for Lin Chengdong to not know Xiao Jinli’s age. After all, the title of Divine Doctor Xiao was only known by the big shots in the business world like them.<br/><br/>But Lin Xiaoxiao was different!<br/><br/>When her maternal grandfather was alive, she often went to the Nursing Home for Cadres, and even saw Xiao Jinli’s back from afar!<br/><br/>When her grandfather had a car accident, he also had the chance to be treated by Xiao Jinli, but Xiao Jinli wasn’t in the Capital City at the time. The time window to treat a massive heart hemorrhage is very short. By the time Xiao Jinli arrived, her grandfather had already passed away!<br/><br/>Lin Xiaoxiao heard that Xiao Jinli had arrived, and wanted to ask for her help!<br/><br/>However, no matter how skilled Xiao Jinli’s medical skills were, she was still a mortal after all!<br/><br/>If the patient was still alive, even barely, Xiao Jinli could definitely save him!<br/><br/>But the patient had already died!<br/><br/>How could he be saved?<br/><br/>So, Lin Xiaoxiao was held back, not allowed to disturb Xiao Jinli!<br/><br/>However, Lin Xiaoxiao had always been grateful that Xiao Jinli had rushed back to save her grandfather, even though she hadn’t made it in time!<br/><br/>In her heart, Xiao Jinli was the most admired idol and benefactor!<br/><br/>Now hearing her father doubting Xiao Jinli, she was naturally unhappy!\t\t\t\t\t\t</div>", "images": {}, "success": true}