{"id": 365, "url": "https://www.novelhall.com/the-lucky-star-blessing-the-whole-village-32483/15193457.html", "title": "Chapter 365 - Chapter 365: Chapter 358:", "volume": 4, "volume_title": "Volume 4", "body": "<h1>Chapter 365 - Chapter 365: Chapter 358:</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 365: Chapter 358:<br/><br/>Lin Xiaoxiao said, “Doctor Xiao is only nineteen years old now. How about it, do you have any objections?”<br/><br/>Lin Xiaoxiao’s tone was a bit aggressive.<br/><br/>After being questioned by Lin Xiaoxiao, Lin Chengdong suddenly felt that his reaction was too strong.<br/><br/>He grinned awkwardly and said, “No, no, I don’t dare to have any objections. I just didn’t expect that the famous Doctor Xiao would be so young. I thought that being young would mean at least twenty-eight or nine years old. After all, national medicine is not western medicine, and learning it takes a long time.”<br/><br/>“Humph, Doctor Xiao is very talented,” Lin Xiaoxiao said. “She has been learning medical skills under a hidden expert since she was a child, so she is naturally different from ordinary people.”<br/><br/>In her eyes, Xiao Jinli was like a fairy who had descended to earth.<br/><br/>Lin Chengdong,<br/><br/>He had always known that his daughter admired Doctor Xiao. In the past, she had said that if she had the chance, she would definitely want to take a picture with Doctor Xiao.<br/><br/>But who would have thought that destiny would be so wonderful and make them become a family.<br/><br/>“Ahem,” Lin Chengdong apologized to Xiao Jinli, “I’m sorry, Doctor Xiao, for offending you just now.”<br/><br/>Xiao Jinli laughed and said, “It’s alright, Lin Dong. I’m used to it.”<br/><br/>No one who had not seen her in person would believe that she was a divine doctor at her age.<br/><br/>Lin Chengdong’s doubt was not the first, and it would not be the last.<br/><br/>Lin Chengdong smiled and said, “Doctor Xiao, if you don’t mind, you can call me Uncle Lin.”<br/><br/>In the future, they would be relatives, so calling each other Lin Dong would feel a bit strange.<br/><br/>“Okay, Uncle Lin!” Xiao Jinli readily agreed.<br/><br/>Then Lin Chengdong looked at Su Yichen with puzzled eyes. No matter how he looked, he couldn’t see any trace of a business emperor in him. He just looked like an ordinary old man.<br/><br/>But that’s not right. Even with makeup, one’s appearance may change, but the voice does not.<br/><br/>Su Yichen’s voice was clearly aged and matched his appearance.<br/><br/>Lin Chengdong hesitated again and asked, “Are you really Su Yichen?”<br/><br/>“Yes, I am Su Yichen,” Su Yichen replied in his original voice.<br/><br/>As soon as he spoke, Lin Chengdong was certain that he was Su Yichen.<br/><br/>Lin Chengdong looked him up and down, full of doubt, and asked, “Su Dong, why do you look like this?”<br/><br/>Su Yichen shrugged and said, “Of course, it’s because it is more convenient to walk around outside like this.”<br/><br/>Otherwise, being such a big shot, wherever he went, the news media would swarm after him, causing trouble.<br/><br/>Lin Chengdong nodded and asked mysteriously, “Su Dong,”<br/><br/>“Lin Dong, please call me Little Su or Little Chen,” Su Yichen said. “Or even call me Xiao Quan if you like.”<br/><br/>After all, Lin Xiaoxiao would become Brother Xuan’s daughter-in-law and Su Yichen’s sister-in-law. Their relationship with Lin Chengdong would naturally become much closer.<br/><br/>Lin Chengdong was perplexed, “Xiao Quan?”<br/><br/>Su Yichen explained, “Uncle Lin, do you remember the time I disappeared for half a year in Capital City eight years ago?”<br/><br/>Su Yichen also spoke naturally.<br/><br/>Lin Chengdong nodded and said, “Of course I remember.”<br/><br/>Before Su Yichen had risen to prominence, perhaps no one paid much attention to his disappearance.<br/><br/>But once he became the well-known business tycoon, coupled with his grievances with the Su Family, his disappearance would naturally be exposed.<br/><br/>It turned out that Su Yichen’s disappearance was due to his biological father, Su Xiangdong, hiring a hitman on him. He was lucky to be saved by someone else.<br/><br/>Su Yichen explained, “I was chased by someone to the rear mountain of Xiao Family Village and was later saved. At that time, I had amnesia and gave myself a name, Xiao Siqian, which means that one should repay a drop of water with a gushing spring, let alone a life-saving grace. I have kept this name to remind myself not to forget that huge favor.”<br/><br/>Lin Chengdong immediately understood that Su Yichen might have been saved by the Xiao Family back then and had been treated as a family member by them, so Su Yichen also regarded them as his family.<br/><br/>“So, Uncle Lin, you can call me Xiao Quan as well!” Su Yichen said.<br/><br/>After all, they would be a family in the future.<br/><br/>Lin Chengdong agreed, “Alright, I’ll call you Xiao Quan.”<br/><br/>Just as Lin Chengdong was about to say something, a man in a black uniform suddenly rushed in. He anxiously said, “Boss, your whereabouts in Xiao Family Village have been leaked. It has attracted a lot of media reporters, and they even found out that Miss Lin had been kidnapped.”<br/><br/>“What?” Lin Chengdong’s face changed. “How did Xiaoxiao’s incident get leaked?”<br/><br/>Subordinate reported, “Before, the boss had been making a big fuss about finding Miss Lin, which attracted the attention of various forces. Many of the forces had news sources with connections. As long as someone took a little effort to investigate, they could still find out about Miss Lin.”<br/><br/>At that moment, another person rushed in.<br/><br/>He held a cell phone in his hand and handed it to Lin Chengdong, reporting, “Boss, things are not good. The news of Miss Lin being kidnapped has been posted on the internet. Everyone is attacking her with their words, saying that Miss Lin has lost her innocence and has become slutty, lewd… ”<br/><br/>It was difficult for him, a bodyguard, to continue repeating the harsh words that were on the internet.<br/><br/>It was simply too unpleasant to hear.<br/><br/>It was a strange world.<br/><br/>Clearly, Miss Lin was a victim, but those keyboard warriors did not hate the criminals who harmed others. Instead, they pointed their fingers at the victim and cursed her endlessly. In their words, they seemed to wish for Miss Lin to hang herself in order to prove her innocence.<br/><br/>Without even looking at the news, Lin Chengdong let Xiao Jinli take his phone. As she looked at the posts online about Lin Xiaoxiao being kidnapped and the netizens’ fierce criticism and verbal abuse, her eyebrows furrowed and there seemed to be anger on her face.<br/><br/>These keyboard warriors must have eaten too much and had nothing better to do. Or perhaps this era was just too good, with people having too much food and too much time on their hands.<br/><br/>At this moment, Lin Chengdong’s phone rang. He glanced at the caller ID, “General Chen, thank you for your concern. It’s all right, my daughter Xiaoxiao is doing well now.”<br/><br/>After hanging up the phone with General Chen, the phone rang again.<br/><br/>Seeing the number, his face darkened, but he had to answer the call.<br/><br/>“General Dong, oh, my daughter Xiaoxiao is doing well. Kidnapping? Not at all, my daughter Xiaoxiao just went on a trip with her boyfriend.”<br/><br/>Throughout the hospital room, Lin Chengdong could be heard answering the phone.<br/><br/>When the phone rang again, Xiao Jinli said, “Uncle Lin, I will handle the matter on the internet.”<br/><br/>She then turned to Lin Xiaoxiao and comforted her, “Sister Xiaoxiao, don’t worry about the online news, just focus on recovering. I will take care of this matter.”<br/><br/>“Uncle Lin, give me five minutes, I’ll have Xiaoxiao’s news taken down immediately,” Xiao Jinli said to Lin Chengdong.<br/><br/>Actually, with Lin Chengdong’s public relations department, it should be possible to handle the situation, but it would just take longer.<br/><br/>With Xiao Jinli’s help, it would be much faster.<br/><br/>Xiao Jinli left the hospital room.<br/><br/>Lin Chengdong was slightly surprised, but Su Yichen reassured him, “You can trust Jinli’s computer skills.”\t\t\t\t\t\t</div>", "images": {}, "success": true}