{"id": 368, "url": "https://www.novelhall.com/the-lucky-star-blessing-the-whole-village-32483/15193460.html", "title": "Chapter 368 - Chapter 368: Chapter 360:", "volume": 4, "volume_title": "Volume 4", "body": "<h1>Chapter 368 - Chapter 368: Chapter 360:</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 368: Chapter 360:<br/><br/>Xiao Jinli led Jiang Yifan to the sickroom and saw a room full of people. With his big, round, bright eyes, he went over to Xiao’s mother, hugged her thigh, and looked up, shouting, “Grandma, Fanfan has been looking for you for a long time.”<br/><br/>Xiao’s mother picked up Little Fanfan and laughed, “Little Fanfan, what do you need Grandma for?”<br/><br/>Jiang Yifan put his fingers together and whispered, “Grandma, I want to eat crayfish today… the crayfish you make.”<br/><br/>Xiao Jinli immediately scolded with her hands on her hips, “Jiang Yifan, how old are you? Eating crayfish every day, aren’t you tired of it?”<br/><br/>Fortunately, the crayfish were raised in their own pond and were clean.<br/><br/>She didn’t dare to let Jiang Yifan eat it every day.<br/><br/>Xiao’s mother laughed and said, “Okay, Grandma will make it for you when we go back.”<br/><br/>Lin Chengdong, standing nearby, was stunned for a moment before asking, “Is this Xiao Junxuan’s son?”<br/><br/>If it really was Xiao Junxuan’s son, then his daughter Lin Xiaoxiao would have to become a stepmother after marrying him.<br/><br/>But being a stepmother isn’t easy.<br/><br/>So, no matter how excellent Xiao Junxuan was, he wouldn’t want to marry his daughter off to him.<br/><br/>Xiao’s mother laughed and shook her head, “No.”<br/><br/>Just as she was about to explain, Jiang Yifan yelled to Xiao Jinli, “Mommy, Grandma has agreed to make crayfish for me. You won’t object anymore, right?”<br/><br/>Xiao Jinli laughed, “As long as Grandma is willing to make it for you, I won’t object. You little cunning ghost.”<br/><br/>Lin Chengdong’s expression was shocked again.<br/><br/>“This child is… is…”<br/><br/>The fact that this child was Xiao Jinli’s was just too surprising.<br/><br/>Xiao Jinli was only nineteen years old, but this child looked about three or four years old, which meant she must have given birth when she was sixteen.<br/><br/>Jiang Yifan showed a naive and cute smile and said to Lin Chengdong, “Elderly Grandfather, I am Xiao Jinli’s son.”<br/><br/>Xiao Jinli, Was this child deliberately trying to be misunderstood?<br/><br/>Everyone,<br/><br/>Elderly Grandfather, isn’t that making people feel old?<br/><br/>Lin Chengdong couldn’t believe it as he asked, “Elderly… Elderly Grandfather? Am I that old?”<br/><br/>To be called an elderly grandfather usually meant at least around seventy years old, and that’s assuming the children married early.<br/><br/>He wasn’t even fifty yet.<br/><br/>Jiang Yifan’s little fair face wrinkled as he asked innocently, “If it’s not Elderly Grandfather, then what is it? But your age looks like it’s the same as my Elderly Grandfather’s.”<br/><br/>“The… same?” Lin Chengdong asked as if he’d been hit.<br/><br/>He usually took good care of himself and looked very young. When he went out, his peers often said that he was well-maintained and asked if there was any secret to his youth. But now, in the eyes of the child, he was an elderly grandfather?<br/><br/>“Uh, uh,” Xiao’s mother said a little embarrassedly to Jiang Yifan, “Little Fanfan, this is Sister Xiaoxiao’s father. You can just call him Grandfather Lin.”<br/><br/>“Grandfather Lin?” Jiang Yifan said in confusion, “but he looks like my Elderly Grandfather.”<br/><br/>Lin Chengdong was hit by ten thousand wounds.<br/><br/>Xiao Jinli looked at Lin Chengdong’s slightly displeased face and immediately scolded sternly, “Jiang Yifan, where are your manners? Who taught you that addressing people is based on age?”<br/><br/>After being scolded by Xiao Jinli, Jiang Yifan’s little face was full of grievances. He looked at Lin Chengdong and softly called out, “Grandfather Lin!”<br/><br/>Seeing such a cute and pitiful look, Lin Chengdong’s heart instantly softened with sympathy.<br/><br/>He waved his hand and said, “It’s okay, it’s okay, don’t scold the child, it’s just a form of address. Let the child call whoever he wants!”<br/><br/>After saying that, he opened his arms toward Jiang Yifan and said, “Your name is Little Fanfan, right? Can Grandfather Lin give you a hug?”<br/><br/>This child was so cute and adorable that it made his heart melt, so he especially wanted to give him a hug.<br/><br/>Jiang Yifan thought for a moment and then stretched his arms out to him.<br/><br/>Lin Chengdong was pleasantly surprised to hug him, “Wow, this little guy is so cute.”<br/><br/>Lin Chengdong said, “Today, Grandpa didn’t prepare any gifts. What does Little Fanfan like? I’ll have someone prepare it for you right away.”<br/><br/>Jiang Yifan’s eyes lit up, and he asked happily, “Can you give me money?”<br/><br/>“Haha, give you money?” Lin Chengdong was slightly stunned, and then he laughed and said, “It turns out you’re a little money-lover. Of course, I can give you money.”<br/><br/>Jiang Yifan said very seriously, “Of course money would be better. Because with money, I can buy food and toys. But if I get other gifts, I can’t refuse the ones I don’t like, and the ones I like might not last long before I don’t like them anymore. So, money is the best.”<br/><br/>“Haha, so that’s how it is.” Lin Chengdong laughed heartily, “You’re so tiny but so smart, you must have inherited your mother’s genes.”<br/><br/>As soon as his words fell, he heard a burst of laughter.<br/><br/>“Xiaoxiao, what are you laughing at?” Lin Chengdong asked.<br/><br/>Lin Xiaoxiao asked, “Dad, do you know who Jiang Yifan’s real mother is? How do you know his cleverness was inherited from his biological mother?”<br/><br/>“Little Fanfan’s biological mother isn’t Doctor Xiao?” Lin Chengdong asked in confusion.<br/><br/>“Haha, Dad, stop teasing me, alright?” Lin Xiaoxiao laughed, “How old is Sister Jinli? Sure, at her age, she might be able to give birth to a child this age, but do you think that’s possible?”<br/><br/>Nowadays, any self-respecting and decent girl wouldn’t have a child at such a young age without being forced by her parents.<br/><br/>“So, Dad, you misunderstood.” Lin Xiaoxiao explained, “Although Little Fanfan calls Sister Jinli his ‘Mommy’, she’s not his biological mother. Do you understand now?”<br/><br/>Lin Chengdong’s expression was slightly awkward, and he apologized, “I’m sorry, I misunderstood. Doctor Xiao, please don’t take offense.”<br/><br/>Xiao Jinli laughed and said, “Uncle Lin, how could I take offense? Anyone would think that way.”<br/><br/>Then, Xiao Jinli seriously said to Jiang Yifan, “Jiang Yifan, from now on, call me sister. I don’t want to be your mommy anymore. Don’t call me old, and stop making people misunderstand that I’m not a pure girl.”<br/><br/>Jiang Yifan was unwilling, he said, “What’s wrong with being my Mommy? Anyway, you’ll get married and have children sooner or later. Letting you get used to the feeling of being a mother in advance, isn’t that good?”<br/><br/>Everyone,<br/><br/>This kid’s logic is really different from ordinary people.<br/><br/>Can motherhood be practiced in advance?<br/><br/>Xiao Jinli’s face was full of black lines, and she resisted again, saying, “No, I don’t want to be a mom at such a young age. After that, when I find a boyfriend, how am I going to fall in love with him?”<br/><br/>That’s a problem.<br/><br/>All of a sudden, the elders felt the same way.<br/><br/>Jiang Yifan suddenly burst into tears and said, “Waah, I don’t have a mother anymore, mom doesn’t want me, grandma, you guys just send me to the orphanage, anyway, Mommy doesn’t want me, and I don’t have any blood relationship with you all, so let Little Fanfan go to the Orphanage. Waah, Little Fanfan is so pitiful.”<br/><br/>Everyone,\t\t\t\t\t\t</div>", "images": {}, "success": true}