{"id": 367, "url": "https://www.novelhall.com/the-lucky-star-blessing-the-whole-village-32483/15193459.html", "title": "Chapter 367 - Chapter 367: Chapter 359: _2", "volume": 4, "volume_title": "Volume 4", "body": "<h1>Chapter 367 - Chapter 367: Chapter 359: _2</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 367: Chapter 359: _2<br/><br/>Manager Guan’s beautiful and smart eyes sparkled slightly, and she hooked her lips, saying, “Hehe, of course they wouldn’t admit it. Unless they come up with evidence.”<br/><br/>Xiao Junxuan also came across the news about Lin Xiaoxiao being kidnapped and sold and rushed to the hospital ward with concern.<br/><br/>He worries that Lin Xiaoxiao would see those bad comments on the Internet, get angry, indignant, and even break down.<br/><br/>After all, she’s still an innocent girl, yet she’s being pointed and cursed by a thousand people online. If her mental state is slightly fragile, she might crumble.<br/><br/>When he arrived at the ward and saw all the people inside, he was surprised by their expressions.<br/><br/>“Grandma, maternal grandmother, Mom, how come you are all here?”<br/><br/>That’s right, Grandma Xiao, maternal grandmother, and Xiao’s mother also came.<br/><br/>While they were working, they heard the tourists discussing the news about Lin Xiaoxiao being kidnapped and sold, and they immediately thought of Xiao Junxuan’s girlfriend, Lin Xiaoxiao.<br/><br/>There are many people named Lin Xiaoxiao in the country, but currently, only one named Lin Xiaoxiao has been kidnapped and sold.<br/><br/>They worried that Lin Xiaoxiao would be upset by the news, so they immediately put down their work to come and comfort her.<br/><br/>However, Lin Xiaoxiao’s mental state is good, very optimistic, and not affected by the news at all. Of course, it’s also because the news is quickly deleted and there hasn’t been a widespread impact.<br/><br/>Grandma Xiao glanced at him, not in a good mood and said, “Are you the only one allowed to visit Xiaoxiao and not us?”<br/><br/>Xiao Junxuan immediately defended, “Grandma, that’s not what I meant.”<br/><br/>Maternal grandmother said, “Hehe, Little Xuan, we all miss Xiaoxiao, so we came to visit!”<br/><br/>Xiao Junxuan, “…” They clearly come to visit every day.<br/><br/>Xiao’s mother smiled and said, “Seeing Xiaoxiao’s rosy complexion and good spirits, we can rest assured!”<br/><br/>Lin Chengdong looked at the three women who had suddenly rushed into the ward, ignoring him, and was full of surprise.<br/><br/>Who are these three people?<br/><br/>Before he could react, Xiao Junxuan returned and then greeted them.<br/><br/>Upon hearing Xiao Junxuan’s greeting, Lin Chengdong’s entire demeanor changed.<br/><br/>Grandma, maternal grandmother, and Mom?<br/><br/>Are they blood-related or related by marriage?<br/><br/>These weren’t too young to be sure.<br/><br/>The ages of these two old ladies seemed to be around fifty or sixty, similar in age to him. And they are Xiao Junxuan’s grandma and maternal grandmother?.<br/><br/>Moreover, this Nationally Stunning woman in her early thirties is Xiao Junxuan’s mother? Isn’t she his biological sister?<br/><br/>Xiao’s mother saw that Lin Xiaoxiao’s condition was good and put down her worries.<br/><br/>Then she noticed that there were other people in the ward besides Su Yichen and Xiao Junxuan, and she was slightly surprised.<br/><br/>Then, she glanced at Lin Chengdong and asked, “Little Xuan, who is this guest?”<br/><br/>Xiao Junxuan immediately introduced, “Mom, this is Uncle Lin, Xiaoxiao’s dad.”<br/><br/>Before Xiao’s mother could greet him, the maternal grandmother began to exclaim.<br/><br/>“What, this is Xiaoxiao’s confused dad?”<br/><br/>Lin Chengdong,<br/><br/>Confused dad, is that the evaluation of him by the Xiao family?<br/><br/>Lin Xiaoxiao chuckled and said, “That’s right, maternal grandmother, this is my silly father.”<br/><br/>Lin Chengdong glared at his crooked-arm daughter.<br/><br/>Grandma Xiao stepped up to shield her and frowned doubtfully, “I heard that you are a very shrewd businessman in the shopping mall, so how could you be so confused in dealing with your two daughters’ affairs?”<br/><br/>Upon hearing this, Lin Chengdong revealed a bitter smile on his face, and he explained, “I’m not confused, Old lady. I always trust my own judgment, and I never saw anyone in the wrong. Who would have thought that I couldn’t even understand a ten-year-old child?<br/><br/>A ten-year-old child framed my biological daughter and used her superb acting skills to fool me. This deception lasted for seventeen or eighteen years, and I never doubted her. If it weren’t for Xiaoxiao’s disappearance, which led me to start doubting, I might have been believing her the whole time.”<br/><br/>After hearing his explanation, the maternal grandmother didn’t understand at all, and she directly and sharply said,<br/><br/>“I don’t know whether your judgment is wrong or not. If it were me, I would definitely trust the child I had raised for several years more than the child I met for the first time.<br/><br/>So, it’s not a matter of judgment, but favoritism. This kind of favoritism is accompanied by guilt and a compensatory mentality, and this mentality naturally shifts to the biological daughter, thinking that it’s okay if her biological daughter suffers a little, as long as the good woman’s daughter doesn’t suffer any grievance.<br/><br/>As a result, you subconsciously ignore the unreasonable aspects. This neglect has caused your biological daughter to suffer for more than a decade. Is this confusion? I think you’re not confused at all, but rather, you’re sacrificing your daughter for the sake of compensating that child.”<br/><br/>After hearing the maternal grandmother’s words, Lin Chengdong’s face turned pale, and he frowned subconsciously.<br/><br/>He now vaguely realizes that it was perhaps that mentality back then that created the ambitious, greedy, and selfish Lin Wanqing that exists today.<br/><br/>If he had chosen to trust his biological daughter and educate Lin Wanqing properly, perhaps Lin Wanqing would be a different person today.<br/><br/>He was wrong, completely wrong.<br/><br/>Lin Chengdong’s face was very ugly, filled with remorse and guilt.<br/><br/>He looked at Lin Xiaoxiao and admitted his mistake for the first time, saying, “Xiaoxiao, the old lady is right. If I had chosen to trust you the first time and properly educated Lin Wanqing when she made a mistake, perhaps, you and Lin Wanqing wouldn’t have ended up in this life-and-death situation. It’s my fault for not trusting the child I raised with my own hands.”<br/><br/>Lin Xiaoxiao’s eyes turned red.<br/><br/>At this point, Xiao’s mother stepped in and said, “Mr. Lin, what’s done is done, and we can only choose to have a more open mindset. Those who harm others will ultimately be punished. It’s already the greatest lucky that Xiaoxiao is safely back now, and we as a family still have to live well in the future.”\t\t\t\t\t\t</div>", "images": {}, "success": true}