{"id": 362, "url": "https://www.novelhall.com/the-lucky-star-blessing-the-whole-village-32483/15193454.html", "title": "Chapter 362 - Chapter 362: Chapter 355:", "volume": 4, "volume_title": "Volume 4", "body": "<h1>Chapter 362 - Chapter 362: Chapter 355:</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 362: Chapter 355:<br/><br/>After Xiao Junxuan left, Lin Chengdong faced his biological daughter, and all he felt was remorse.<br/><br/>Before coming to find her, he was thinking that after finding his daughter, in addition to apologizing, he would also compensate her.<br/><br/>After a while, Lin Chengdong sighed lightly and said to Lin Xiaoxiao, “Xiaoxiao, it’s your dad’s fault. I’m sorry for letting you suffer so much for so many years.”<br/><br/>“Hmph!” Lin Xiaoxiao turned her face away, not immediately accepting his apology, and then said with a belly full of grievance, “If it weren’t for the help I received while fleeing this time, you probably would’ve never seen me again in your life.”<br/><br/>Saying this, she paused for a moment, before continuing, “That’s right, you already have such a filial adopted daughter, so you don’t even care about your own biological daughter, don’t you? After all, haven’t you been like this for the past dozen or so years?”<br/><br/>Her words pierced his heart!<br/><br/>Upon hearing Lin Xiaoxiao’s words, Lin Chengdong’s expression was full of remorse and heartache.<br/><br/>He apologized again, “I’m sorry, my daughter, your dad was confused, misjudged people, not only letting you suffer so much humiliation, but also causing you to bear so much suffering.”<br/><br/>Lin Xiaoxiao remained silent.<br/><br/>Lin Chengdong continued, “I never imagined that a ten-year-old child could be so calculating, with such a deep scheming mind, that she would try to frame you the first time she met you.”<br/><br/>No one would have expected that, right?<br/><br/>A child who was bullied and beaten casually in the countryside, a skinny little kid, could be so cunning and malicious.<br/><br/>The first time the two children met, when the clothes were cut, anyone else would probably think that it was their own child who was spoiled, looking down on children from the countryside, and hence becoming arrogant and aggressive.<br/><br/>At that time, Lin Xiaoxiao was already six years old. Although her memory of growing up was sparse, that first encounter was deeply ingrained in her mind.<br/><br/>Her eyes filled with tears, she asked him angrily,<br/><br/>“Why didn’t you believe me then? I’m the child you raised yourself, don’t you know what kind of person I am?<br/><br/>Do you think I could do something like that?<br/><br/>But you chose to believe what you saw with your own eyes and didn’t believe what I said. After that, every time you saw me bullying her, didn’t you ever wonder why it was always me bullying her that you saw?<br/><br/>Wouldn’t I know to bully people in secret? Why would I be so stupid as to let you see me do it?<br/><br/>If only you had thought about it a little, would you have seen the flaws?<br/><br/>But, from childhood to adulthood, I’ve bullied Lin Wanqing countless times in front of you, have you ever believed that I really didn’t bully her once? Wah wah…”<br/><br/>Lin Xiaoxiao recounted all the bullying she had suffered over the past dozen years.<br/><br/>“It’s because of your prejudice, your trust, that this time someone directly kidnapped me and sold me to that remote small village.<br/><br/>In that village, nine out of ten men were bachelors.<br/><br/>Those who had a daughter-in-law would sell their daughter-in-law to other families to have children, do you know that?<br/><br/>When I was first kidnapped to that family, what kind of life did I live, do you know?<br/><br/>As soon as I arrived, I was tied to a bed and the entire family took turns abusing me. If it wasn’t for the fact that I had learned some self-defense skills and fought back with all my strength, maybe I would be locked in a room now, waiting to give birth to a child.<br/><br/>I even overheard the family discussing that after I had a son for their family, they would sell me to other bachelors in the village to have more boys. They could earn ten thousand for each boy, and with so many bachelors in the village, as long as I could still have children, they could take their turns.<br/><br/>I was scared, terrified, and wanted to escape, but the first time I tried, my leg was broken by someone, I…”<br/><br/>Hearing this, Lin Chengdong’s expression was filled with gloom, anger, pain, and remorse.<br/><br/>He walked up to Lin Xiaoxiao, hugged her, and cried, “My daughter, your dad is sorry, wah wah, your dad is sorry for you.”\t\t\t\t\t\t</div>", "images": {}, "success": true}