{"id": 360, "url": "https://www.novelhall.com/the-lucky-star-blessing-the-whole-village-32483/15193452.html", "title": "Chapter 360 - Chapter 360: Chapter 354:", "volume": 4, "volume_title": "Volume 4", "body": "<h1>Chapter 360 - Chapter 360: Chapter 354:</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 360: Chapter 354:<br/><br/>Lin Chengdong said with a bit of heartache, “I didn’t plan on having him as my son-in-law.”<br/><br/>Lin Xiaoxiao quickly agreed, nodding, “Hmm, it’s good that you didn’t.”<br/><br/>Lin Chengdong,<br/><br/>Parents will always compromise in front of their children.<br/><br/>He didn’t want to discuss this issue with his daughter right now.<br/><br/>If he can’t be a son-in-law, then the child can at least take the surname of Lin, right?<br/><br/>Lin Chengdong brought the topic back around, he said, “Darling, Doctor Xiao took good care of your leg, regardless, I must personally come to thank him. What kind of gift should I buy?”<br/><br/>Doctor Xiao, who is rich and influential, would consider any gift to not be particularly expensive.<br/><br/>But he really wanted to express his gratitude.<br/><br/>Lin Xiaoxiao looked at her father with a slightly complex look.<br/><br/>At this moment, Xiao Junxuan laughed lightly and said, “Uncle, there’s no need…”<br/><br/>But before he could finish his sentence, Lin Chengdong was a little annoyed, “Xiao Junxuan, I’m going to thank Doctor Xiao, what do you mean by interrupting and saying it’s not needed? Are you looking down on me?”<br/><br/>“Dad, can’t you let people finish speaking,” Lin Xiaoxiao was also very angry, “If Brother Xuan says it’s not necessary, it’s not necessary. Because Doctor Xiao is Brother Xuan’s biological sister.”<br/><br/>Lin Chengdong was stunned by this, “What?”<br/><br/>Lin Xiaoxiao repeated, “Doctor Xiao is Brother Xuan’s biological sister. That’s why I was able to receive treatment directly from Dr. Xiao.”<br/><br/>At this point, Lin Chengdong didn’t know what to say.<br/><br/>He had not expected that his daughter’s boyfriend would be the biological brother of Doctor Xiao.<br/><br/>At this point, he didn’t know whether to feel upset or happy.<br/><br/>After all, having an in-law relationship with Doctor Xiao is a matter of pride for any family.<br/><br/>It’s not just about the medical skills of Doctor Xiao herself, more so because of the power after her.<br/><br/>Then, Lin Xiaoxiao dropped another bombshell on Lin Chengdong.<br/><br/>“And, Su Yichen is also Brother Xuan’s younger brother, a member of the Xiao family, and Doctor Xiao’s brother!”<br/><br/>Lin Chengdong was truly surprised.<br/><br/>In Capital City, he had also heard that Doctor Xiao and Su Yichen seemed to have a close relationship, but no one could find out exactly what their relationship was.<br/><br/>As it turned out, Su Yichen and Doctor Xiao were closely related in this way.<br/><br/>However, after all these twists and turns, Lin Xiaoxiao did not marry Su Yichen, but married a man who was very close to Su Yichen.<br/><br/>After a while, Lin Chengdong shook his head and laughed, “Xiaoxiao, it seems that your destiny was to be with Su Yichen as a family.”<br/><br/>Lin Xiaoxiao turned pale, and said irritably, “Old man, why are you bringing up what you shouldn’t.”<br/><br/>Lin Chengdong immediately came to his senses, looked at Xiao Junxuan, patted Xiao Junxuan’s shoulder, and laughed, “Ah Xuan, don’t misunderstand. In Capital City, I tried my best to bring Su Yichen and Xiaoxiao together, but they didn’t like each other. The last time I brought it up, Xiaoxiao disappeared and then met you.”<br/><br/>He sighed softly and said, “Ah, maybe this is destiny. Though Su Yichen and Xiaoxiao have known each other for several years, they are still like strangers to each other. But you are good, in just a few days after meeting my Xiaoxiao, you have taken her away.”<br/><br/>Xiao Junxuan laughed and said, “Uncle, as the saying goes, ‘A destined love will meet even if they are a thousand miles apart; an undestined love won’t even meet despite being across from each other.’ It is fate between Xiaoxiao and me. Otherwise, Xiaoxiao was in Capital City, how could she have met me.”<br/><br/>Lin Chengdong could not help but sigh at the wonder of fate.<br/><br/>He nodded and said, “Yes. One was in Capital City, the other in Xiao Family Village thousands of miles away. Yet, they met each other unexpectedly. Maybe this is destiny. However, you guys have known each other for a short time, have not understood each other completely. What about meeting the parents first, getting engaged, and delaying the marriage?”<br/><br/>Xiao Junxuan quickly responded, “Uncle, understanding each other after marriage is the same. And, in our Xiao family, marriage is for a lifetime. The men of the Xiao family, all know how to love their wives.”<br/><br/>Lin Chengdong,<br/><br/>There are divorces in marriage too, how can this be guaranteed?<br/><br/>Of course, he couldn’t say that, or else his daughter would roll her eyes at him again.<br/><br/>However, he still has to find out about Xiao Junxuan’s character a bit.<br/><br/>He can’t just marry his daughter off halphazardly because the groom is Doctor Xiao’s brother.<br/><br/>What he cares about now is his daughter’s happiness.<br/><br/>After a while, Lin Chengdong waved his hand and said, “Forget it, forget it. I have only one biological daughter. I just hope she marries a good man, and more importantly, she is happy forever.”\t\t\t\t\t\t</div>", "images": {}, "success": true}