{"id": 366, "url": "https://www.novelhall.com/the-lucky-star-blessing-the-whole-village-32483/15193458.html", "title": "Chapter 366 - Chapter 366: Chapter 359:", "volume": 4, "volume_title": "Volume 4", "body": "<h1>Chapter 366 - Chapter 366: Chapter 359:</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 366: Chapter 359:<br/><br/>In less than five minutes, the bodyguard took out his cellphone, checked the news again and was amazed. “Boss, there really isn’t any news about the young lady being kidnapped anymore.”<br/><br/>Upon hearing this, Lin Chengdong immediately snatched the cellphone from the bodyguard’s hand and scrolled through it. Indeed, the news about the businessman’s daughter, Lin Xiaoxiao, being kidnapped was gone.<br/><br/>Xiao Jinli had said that it would take her five minutes, but it didn’t even take that long. It might have taken even less than two.<br/><br/>Lin Chengdong looked at Su Yichen in astonishment, “Doctor Xiao’s computer skills are that high?”<br/><br/>The news disappeared without a trace before his public relations department even had a chance to take action.<br/><br/>And any comments about Xiaoxiao being kidnapped could not be found either.<br/><br/>This was too fast!<br/><br/>With such efficiency, it would take the efforts and time of a top hacker or his company’s public relations department to handle it.<br/><br/>Su Yichen had witnessed Xiao Jinli’s hacking skills with his own eyes, and he smiled and said, “This is just child’s play for Little Sister Jinli.”<br/><br/>Su Yichen had seen Xiao Jinli’s slender fingertips dance across the keyboard as she invaded the world-renowned, strongest firewall of Plum Firm Country’s national security system within moments. She had also implanted a Trojan virus that destroyed their supposedly most secure and solid firewall.<br/><br/>Of course, he couldn’t tell anyone about this.<br/><br/>“Really?” Lin Chengdong was truly astonished.<br/><br/>At her young age, Xiao Jinli had devoted most of her time and energy to studying medicine. Where did she find the time and energy to learn hacking skills as well?<br/><br/>Could this be the legendary genius talent?<br/><br/>Lin Xiaoxiao’s sad mood was instantly healed.<br/><br/>She seemed very excited, saying, “Little Sister Jinli is so amazing. Not only are her medical skills superb, her computer and networking skills are incredible too. I really admire her so much.”<br/><br/>Su Yichen watched her excitement without showing any sadness or anger, which was a little amusing.<br/><br/>He said, “So, Xiaoxiao, you don’t need to worry. Sister Jinli said that from now on, news about you will never appear on the internet again. Even if those news media want to grab attention or increase their traffic, it will never appear on paper either.”<br/><br/>“Wow, Little Sister Jinli is really amazing!” Lin Xiaoxiao’s eyes were full of sparkles, “She managed to control all the media with one move.”<br/><br/>Su Yichen nodded, “Yes, that’s right.”<br/><br/>Lin Chengdong scrolled through several pages and found no news about Lin Xiaoxiao being kidnapped anymore, which finally put his heart at ease.<br/><br/>At that moment, his phone rang again.<br/><br/>He answered it, “Manager Guan!”<br/><br/>Manager Guan was the manager of his company’s public relations department.<br/><br/>Manager Guan reported to him, “Chairman, just five minutes ago, news about Miss Xiaoxiao was all over the place. But before our PR department could even start investigating the matter, all the news disappeared without a trace, as if it had never appeared on the internet.”<br/><br/>At this point, she continued with concern, “Chairman, something doesn’t seem right. I’m worried that our opponents might be plotting something big and using this kind of feigned retreat to attack us.”<br/><br/>“Haha…” Lin Chengdong said in a good mood, “Manager Guan, don’t worry about it. It’s all taken care of. Just do your job, and you don’t need to worry about this for now.”<br/><br/>Upon hearing this, Manager Guan immediately understood that there must be something going on. She cautiously asked, “Chairman, did you ask someone else to handle this situation?”<br/><br/>Lin Chengdong admitted without hesitation, “Yes, don’t worry. The technician I hired is very skilled.”<br/><br/>After hearing this, Manager Guan let out a sigh of relief, “Alright, that’s good.”<br/><br/>After hanging up the phone with the chairman, Manager Guan turned to her subordinates and said, “This issue has been taken care of by the chairman. We don’t have to deal with it.”<br/><br/>Her subordinate was confused, “Huh, the chairman took care of it?” It happened too quickly. Their PR department hadn’t even started to take action before the issue was resolved. It made them seem incompetent.<br/><br/>Manager Guan nodded, “Yes. The chairman hired an expert to handle all the news on the internet.”<br/><br/>After processing the information, the subordinate asked with a frown, “Well, Manager, how should we deal with the reporters gathered upstairs?”\t\t\t\t\t\t</div>", "images": {}, "success": true}