{"id": 363, "url": "https://www.novelhall.com/the-lucky-star-blessing-the-whole-village-32483/15193455.html", "title": "Chapter 363 - Chapter 363: Chapter 356:", "volume": 4, "volume_title": "Volume 4", "body": "<h1>Chapter 363 - Chapter 363: Chapter 356:</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 363: Chapter 356:<br/><br/>Outside the hospital room, Xiao Junxuan clenched his fists tightly, hearing the painful wounds and scars that Lin Xiaoxiao kept bringing up.<br/><br/>Lin Xiaoxiao had never told them about this before.<br/><br/>All she said was that her leg was broken in the midst of a violent struggle.<br/><br/>But he had not expected the process to be so brutal and violent.<br/><br/>He only regretted not having met Lin Xiaoxiao sooner. He would never have allowed Lin Xiaoxiao to suffer such hardships.<br/><br/>In the hospital room, listening to Lin Xiaoxiao’s words, Lin Chengdong deeply regretted everything.<br/><br/>When he was angry that his daughter had not called him at home, she was actually being kidnapped.<br/><br/>When he believed Lin Wanqing’s claim that she was in constant contact with Lin Xiaoxiao, she was actually being trafficked to a remote small village.<br/><br/>So, how much mistrust did he have towards his daughter over these years, and how much trust did he have in Lin Wanqing, which led to this outcome?<br/><br/>Lin Chengdong held onto his daughter crying uncontrollably, continuously apologizing, “I’m sorry, my daughter, it’s my fault. If I had trusted you a bit more, you wouldn’t have suffered like this.”<br/><br/>But there’s no antidote for regret in this world. No matter how much he apologizes or regrets now, he can’t undo the damage and pain his daughter has suffered.<br/><br/>Crying bitterly, Lin Xiaoxiao angrily said, “What on earth have I ever done to Lin Wanqing? She has been framing me since the day we met, and now she heartlessly sold me into a remote village. How much does that woman hate me? She wanted me to suffer so much, is she happy now? Why did she treat me like this?”<br/><br/>Lin Xiaoxiao felt she had never done anything to hurt Lin Wanqing, yet Lin Wanqing retaliated out of spite.<br/><br/>Lin Chengdong cried out, “Don’t blame yourself. This is my fault, and hers too. I was too biased in favor of her which caused her ambition to inflate. She believed that as long as you disappeared, there would only be her as a daughter in my eyes, and the entire Lin family business would be inherited by her alone. But from beginning to end, I intended to leave all of our family business to my biological daughter. For Lin Wanqing, I just wanted to find her a good husband, a good mother-in-law’s home, and then give her a generous dowry. Who would have thought that the man she wanted to marry was Su Yichen, and she also wanted to inherit everything on her own.”<br/><br/>Crying out loudly, Lin Xiaoxiao said, “If she wants something, she should strive for it herself, instead of trying to harm me all the time.”<br/><br/>In fact, Lin Xiaoxiao was too kind-hearted.<br/><br/>She had once sympathized with Lin Wanqing’s circumstances, and also remembered the life-saving kindness her dad had shown to her father. Even though Lin Wanqing had framed her, causing her father to favor Lin Wanqing, she never really thought of taking revenge.<br/><br/>Experiencing first-hand her father’s trust issues and bias, Lin Xiaoxiao felt aggrieved and heartbroken. Consequently, when facing the accusations of her father, she felt a surge of anger and immediately confronted her father.<br/><br/>From the moment Lin Wanqing arrived at the Lin family, Lin Chengdong and Lin Xiaoxiao, the father-daughter duo, have never had a peaceful moment.<br/><br/>After Lin Chengdong’s continuous apologies and Lin Xiaoxiao’s sobbing, the resentment in her heart gradually subsided.<br/><br/>She wiped her tears, and asked directly, “I heard that Lin Wanqing has been arrested. How was she arrested?”<br/><br/>Lin Chengdong honestly replied, “I called the police.”<br/><br/>“You called the police?” Lin Xiaoxiao was very surprised to hear this from Lin Chengdong, “Didn’t you trust her a lot and treat her like your own daughter? You treated her better than you treated me. How could you bear to call the police?”<br/><br/>“Hmph, she harmed my daughter. How could I still trust her? Previously, I thought she was pitiful for losing her parents and being bullied by her grandparents. Plus her father saved my life. I felt guilty and sympathetic towards her, so I wanted to give her the best life. How could I have known that such a young child could be so calculating? Now, no matter how pitiful she is, I can’t let her harm my daughter. What angers me the most is, I gave her a chance. If she was willing to confess and admit her mistakes, in return for her father’s kindness to me, I would have let her off. But even when I confronted her with evidence, she showed no sign of remorse. Since she didn’t cherish the opportunity I gave her, naturally I can’t show any mercy to her. I called the police and had her arrested.”<br/><br/>Lin Chengdong expressed his anger, “She is too selfish, too greedy, too ambitious, and as well as ruthless. If I hand everything of the Lin family to her, I don’t know if the Lin Corporation can continue to grow, not to mention how many people she will oppress once she gains power. So, it is only right to have her arrested and teach her a lesson.”<br/><br/>Lin Xiaoxiao,<br/><br/>She looked at Lin Chengdong skeptically, saying disbelief, “Is this your opinion about Lin Wanqing now? I remember you used to say that she is a gentle and generous woman. How did this nice woman turn into a selfish, greedy, ambitious, and ruthless person in such a short time?”<br/><br/>Lin Chengdong paused for a moment, sighed lightly, “I admit that when it comes to Lin Wanqing, I misjudged her character, mistaking a fish’s eyes for a pearl. She is too calculating and her acting is too good, she tricked me.”<br/><br/>Lin Xiaoxiao nodded in agreement, “That’s right, Lin Wanqing is a great actress. If she had entered showbiz back then, she would have undoubtedly won the Oscar for Best Actress.”<br/><br/>As a witness to Lin Wanqing’s acting skills, she knew well how good Lin Wanqing’s acting was, otherwise, how could she possibly deceive Lin Chengdong, a sharp business tycoon?<br/><br/>Lin Xiaoxiao sighed again, continuing, “It would have been so good if she had entered show business back then. She would definitely be a shining star now.”<br/><br/>Lin Chengdong,<br/><br/>“But then again, she really is ambitious, and she’s good in the business world. Her goal is not to be a small star, but to be the head of the Lin family. If Lin Wanqing was your biological daughter, would you have trained her to be your heir?” Lin Xiaoxiao asked, feigning surprise.<br/><br/>Lin Chengdong,  That would have been likely.<br/><br/>Lin Wanqing indeed possessed business talent, and was quite capable in the business world, known as a famous female elite in the business circle.<br/><br/>It’s just a shame that she used her skills wrongly, which ruined her life.<br/><br/>Just as the father and daughter fell into a moment of silence, Xiao Jinli arrived.<br/><br/>As soon as Lin Xiaoxiao saw Xiao Jinli walk into the hospital room, she immediately perked up.<br/><br/>She smiled, her eyes forming a crescent, and called out, “Little Sister Jinli, why are you here so early today?”<br/><br/>After that, she glanced strangely at Su Yichen, standing next to Xiao Jinli, then glanced at her father, muttering to herself, “Looking like a ghost, my dad will definitely not recognize Su Yichen.”\t\t\t\t\t\t</div>", "images": {}, "success": true}