{"id": 361, "url": "https://www.novelhall.com/the-lucky-star-blessing-the-whole-village-32483/15193453.html", "title": "Chapter 361 - Chapter 361: Chapter 354: _2", "volume": 4, "volume_title": "Volume 4", "body": "<h1>Chapter 361 - Chapter 361: Chapter 354: _2</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 361: Chapter 354: _2<br/><br/>Happiness is not just about a man treating her well, it’s also about having a good relationship with the in-laws.<br/><br/>“Uncle, rest assured.” Xiao Junxuan said with a smile, “I will definitely make Xiaoxiao happy. My parents and my sister are all very easy-going. They also like Xiaoxiao. Everyone in our family likes Xiaoxiao.”<br/><br/>Lin Xiaoxiao nodded, “Old man, the Xiao family really is easy to get along with. Do you know? The Doctor Xiao in Capital City, whom we could never approach, turns out to be a beautiful and lovely girl, who’s also gentle and kind.”<br/><br/>When it came to Xiao Jinli, Lin Xiaoxiao always regarded her as an idol.<br/><br/>Even in the future, when she would be her sister-in-law, Jinli would still be her idol, the person she admires the most.<br/><br/>Speaking of Doctor Xiao, Lin Chengdong thought for a while and said, “Xiaoxiao, I still think I should formally thank Doctor Xiao, we can’t lack the courtesy.”<br/><br/>You see, asking Doctor Xiao for help in the Capital City is something money can’t buy.<br/><br/>Now that Lin Xiaoxiao was fortunate enough to meet Xiao Junxuan, who facilitated this help, they should show even more gratitude.<br/><br/>If they become a family in the future, then it’s a family matter.<br/><br/>But now, they must show proper etiquette.<br/><br/>Xiao Junxuan laughed, “Uncle, there’s no need for such formality.”<br/><br/>He paused slightly, glanced at Lin Xiaoxiao, and continued, “If you really want to thank my sister, please invite her to a meal.”<br/><br/>“Ha, just a meal, that’s not genuine at all,” Lin Chengdong disagreed, “I should still go back to Capital City and see if I have anything valuable to give to Doctor Xiao.”<br/><br/>” Xiao Junxuan immediately stopped him, “Uncle, it’s too formal to do this, my sister will not be happy about it. You see, my sister helped Xiaoxiao because she likes Xiaoxiao. My sister said, it’s because they have a predestined relationship. If you send those valuable gifts, wouldn’t that tear the relationship between them? In the future, they will be sisters-in-law, a family.”<br/><br/>Lin Chengdong,<br/><br/>After thinking for a bit, Lin Xiaoxiao nodded in agreement, “Dad, Brother Xuan is right. It would be really inappropriate of you to give gifts. Look at my relationship with Brother Xuan, would Doctor Xiao accept the gift or not?”<br/><br/>After pondering, Lin Chengdong eventually nodded, “Alright. I will not send any gifts. I will invite Doctor Xiao to have a meal instead.”<br/><br/>Just don’t know which hotel here has the best food.<br/><br/>The food at the Xiao Family Village Hotel and the Xiao Family Village Cafeteria is said to be really good.<br/><br/>But if you invite someone out for a meal, and go to their own restaurant, it is…<br/><br/>Before he could fret any further, Lin Xiaoxiao immediately decided, laughing, she said, “Old man, just book a table at the Xiao Family Village Hotel. Doctor Xiao won’t be used to eating anywhere else.”<br/><br/>Having tasted the culinary skills of her future mother-in-law, the food was simply too delicious. If she had to eat anywhere else, she felt it would be hard to swallow.<br/><br/>Xiao Jinli grew up eating food prepared by her future mother-in-law, she certainly would be picky about the food from other restaurants.<br/><br/>However, she probably wouldn’t be picky about the local restaurants, would she?<br/><br/>After hearing his daughter say this, Lin Chengdong decisively decided, “Alright, then I’ll book at the Xiao Family Village Hotel.”<br/><br/>Xiao Junxuan’s eyes flickered, and then he asked, “Uncle, where is your group staying?”<br/><br/>Lin Chengdong replied, “The few hotels in Taoyuan Town were fully booked, so we’re staying at the Jinshan Hotel in the county town.”<br/><br/>“The county town is quite far from Xiao Family Village.” Xiao Junxuan said, “Uncle, starting from today, you can stay at our place.”<br/><br/>In addition to their original house, they had built another big house at the back, specifically for housing Xiao family guests.<br/><br/>People like Elder Chen stayed at the Xiao family’s house all the time.<br/><br/>Because they loved eating meals cooked by Xiao’s mother.<br/><br/>Because of their status, they couldn’t register their residence in Xiao Village, but the government still funded a veterans’ nursing home to be built in Xiao Village for these old people who had made contributions to the country, so they could enjoy their old age.<br/><br/>Xiao Village is an excellent place for retirement, moreover, Doctor Xiao is a villager, always there to ensure their safety.<br/><br/>As soon as Xiao Junxuan suggested going to his house, Lin Chengdong’s face darkened. In annoyance, he said, “My daughter hasn’t married yet, and now I as her father should move in already, what’s that gonna look like, it’ll just bring unwanted gossip. No, I’d rather stay at the county town hotel. At least we have a car, and commuting is convenient.” Although sometimes there is a bit of a traffic jam.<br/><br/>He couldn’t book the Xiao Family Village Hotel.<br/><br/>The hotel needed to be booked half a month in advance.<br/><br/>“Alright,” Xiao Junxuan smiled somewhat helplessly, “But, Uncle, you also don’t need to stay in the county town hotel, just stay directly at our Xiao Family Village Hotel.”<br/><br/>Lin Chengdong asked with some hesitation, “But isn’t the Xiao Family Village Hotel fully booked?”<br/><br/>“Uncle, I’ll handle it.” Xiao Junxuan asked, “Uncle, how many people are there in your group?”<br/><br/>He knew that Lin Chengdong must have brought secretaries and bodyguards along.<br/><br/>Lin Chengdong said, “Eight people, all men.”<br/><br/>“Good!” Xiao Junxuan nodded, “Uncle, you and Xiaoxiao have a good chat, I’ll go and check on the hotel.”<br/><br/>In fact, he was making space for the father and daughter to have a good chat.<br/><br/>After all, Lin Xiaoxiao still had some unresolved issues.<br/><br/>These issues needed to be resolved.<br/><br/>He who tied the bell, must untie it himself.<br/><br/>Lin Chengdong must apologize for the past misunderstandings.<br/><br/>So it’s best for everyone else to avoid them during this time. Especially him, the future son-in-law.<br/><br/>Otherwise, the future father-in-law would feel like he’s lost face.<br/><br/>After Xiao Junxuan left, the atmosphere in the ward suddenly quieted down again.\t\t\t\t\t\t</div>", "images": {}, "success": true}