{"id": 369, "url": "https://www.novelhall.com/the-lucky-star-blessing-the-whole-village-32483/15193461.html", "title": "Chapter 369 - Chapter 369: Chapter 361:", "volume": 4, "volume_title": "Volume 4", "body": "<h1>Chapter 369 - Chapter 369: Chapter 361:</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 369: Chapter 361:<br/><br/>After being teased by the little drama king Jiang Yifan, everyone’s mood was suddenly much happier.<br/><br/>Xiao’s mother looked at Lin Chengdong and said, “Mr. Lin, since you’re already here, why don’t you stay in Xiao Family Village for a few days? Also, let’s talk about the relationship between Xuan’er and Xiaoxiao.”<br/><br/>Lin Chengdong hesitated a bit, “Mrs. Xiao, isn’t it a bit too quick? Xiaoxiao and Xiao Junxuan haven’t known each other for a few days, and they don’t understand each other yet.”<br/><br/>Xiao’s mother smiled, “Some people don’t understand someone in a lifetime, while others only need a few days to understand. For Xuan’er and Xiaoxiao, now both of their hearts are united, their feelings are mutual, so if they need to understand each other, they can continue to do so after they’re married.”<br/><br/>Grandma Xiao said, “Little Lin, my Junxuan may not be the handsomest man or the richest, but he inherited Xiao Family’s genes for being good to his wife. He will definitely love and care for Xiaoxiao. If he dares to treat Xiaoxiao badly, I can break his legs and kick him out of the Xiao Family without your saying.”<br/><br/>The maternal grandmother laughed and said, “That’s right. Actually, my Junxuan isn’t ugly either, and he’s had girls chasing after him before, but he’s never been interested. Now, he’s really fond of Xiaoxiao. Xiaoxiao is a good child, we all know that, and we won’t let her be bullied. You can entrust your daughter to us.”<br/><br/>After contemplating for a moment, Lin Chengdong said, “Let me think about it.”<br/><br/>All these people were Xiao Junxuan’s relatives, so it was only natural for them to speak highly of him.<br/><br/>During this time, he would stay in Xiao Family Village and properly inquire about Xiao Junxuan and the Xiao Family’s characters.<br/><br/>Of course, a family that could raise a divine doctor like Xiao would have good characters.<br/><br/>But even in the best family education, some scum could still appear.<br/><br/>Xiao’s mother smiled, “Alright, you can stay at our house for these days, let our family take good care of you.”<br/><br/>Just then, Jiang Yifan interrupted, “Grandpa Lin, my grandma’s cooking is so delicious, you’ll definitely regret it if you don’t try it.”<br/><br/>Lin Chengdong happily said while holding the little cute kid, “Oh, really? Then I must give it a try.”<br/><br/>Jiang Yifan nodded, “The food my grandma makes is really, really good. The elderly grandfathers in my family always say that after getting used to my grandma’s cooking, even the food made by Michelin chefs would taste like pig food.”<br/><br/>Of course, Lin Chengdong didn’t know that the elderly grandfathers Jiang Yifan was talking about were the old heroes rumored to be living in Xiao Family Village.<br/><br/>So, when Lin Chengdong first went to the Xiao Family and saw the old heroes sitting at the dining table, he was dumbstruck.<br/><br/>“Old Jiang…Elder Zeng, Old Chen, Old Li!” Lin Chengdong immediately greeted them respectfully.<br/><br/>He really hadn’t expected that all the old heroes would be living at the Xiao Family.<br/><br/>They were already eighty to ninety years old, but they looked like they were only in their sixties or seventies.<br/><br/>No wonder Little Fanfan said that their ages were similar to these old grandpas.<br/><br/>This was pretty much it.<br/><br/>Lin Chengdong happily said, “You old gentlemen all look strong and vigorous, full of vitality, flush with health, and appear twenty to thirty years younger than you actually are.”<br/><br/>Elder Jiang looked at Lin Chengdong and said with a smile, “Little Linzi, you have raised a good daughter. We all like Xiaoxiao. She has a bright personality and a kind heart. But such a good child has been misunderstood by you, her father, and accused of harming her sister, haven’t you?”<br/><br/>Several old gentlemen also knew about Xiao Junxuan’s fondness for Lin Xiaoxiao, so they naturally treated Lin Xiaoxiao as if she were their own child, especially since Lin Xiaoxiao was obviously favored by Xiao Jinli.<br/><br/>They all knew that girls who could win the favor of Jinli must have good characters.<br/><br/>Therefore, they were now trying to uphold justice for Lin Xiaoxiao against the unfair treatment she had received from her biological father.<br/><br/>Having been reminded of this, Lin Chengdong’s expression paused for a moment, then he said apologetically, “Ah, it was my mistake, I didn’t know people well, and took fish eyes for pearls, hurting my own biological daughter.”<br/><br/>Old Chen snorted coldly, “You really are a confused dad. Which parent doesn’t trust their own child, yet chooses to believe a child they met for the first time? Little Linzi, you’re a big shot in the business world, but you can’t even understand this simple logic. I don’t know how you recruit talent in your company without making mistakes.”<br/><br/>Lin Chengdong was speechless.<br/><br/>Old Li also laughed and said, “Fortunately, Xiaoxiao has a good character. She hasn’t gone astray in these ten years. Otherwise, sigh…”<br/><br/>Listening to the words of these old gentlemen, Lin Chengdong’s expression was even more ashamed. But he didn’t know how to defend himself, so he could only listen to their accusations one by one.<br/><br/>With a bitter smile, Lin Chengdong said, “Yes, it’s my fault.”<br/><br/>Seeing that it was almost enough, Xiao Jinli smiled and said, “Uncle Lin has admitted his mistake and put the bad guy behind bars, so can you please let him off the hook, grandpas?”<br/><br/>After all, Lin Chengdong is Lin Xiaoxiao’s biological father. When they see him, the Xiao family never misses an opportunity to scold him, making it hard to save face.<br/><br/>At this time, Grandpa Jiang said, “Girl, have you called your dad back? Since Xiaoxiao’s confused dad has shown up, shouldn’t we settle your brother’s and Xiaoxiao’s marriage?”<br/><br/>Xiao Jinli nodded, “Yes, I’ve already informed my dad. He’ll be back this afternoon.”<br/><br/>Though her dad manages a big company and is very busy, he still has to come back for his son’s marriage.<br/><br/>Lin Chengdong was speechless again.<br/><br/>But he hadn’t agreed yet.<br/><br/>Of course, it seemed that his opinion wasn’t important anymore.<br/><br/>It was at lunchtime that Lin Chengdong discovered that there were a lot of people having meals together inside the house.<br/><br/>In addition to the four old gentlemen, there were also Xiao Junxuan’s paternal grandparents and maternal grandparents, totaling eight people. Now, with the addition of himself, Xiao Junxuan pushing Lin Xiaoxiao, Xiao Jinli, and Xiao’s mother, that made more than ten people sitting around a large round table. Looking at the delicious food on the table, Lin Chengdong found it hard to believe that it was all prepared by a beautiful and stunning woman.<br/><br/>It wasn’t until Grandpa Jiang, who was the eldest at the table, picked up his chopsticks that everyone else began to eat at a rapid pace.<br/><br/>Lin Chengdong was dumbfounded.<br/><br/>Wasn’t eating supposed to be elegant and unhurried?<br/><br/>Why did it feel like they hadn’t eaten for days and were now fighting for food?<br/><br/>Even the imposing manners of the old gentlemen seemed bizarre when it came to grabbing food.<br/><br/>Before he could even pick up some food, more than half of the dishes in the dozen plates had already disappeared.<br/><br/>He didn’t even know whether to put his chopsticks down or not.<br/><br/>Fortunately, Xiao Junxuan still had to please his future father-in-law.<br/><br/>So, using the public chopsticks, he quickly snatched a few bites of food for Lin Chengdong and placed them on the plate in front of him.<br/><br/>He said, “Uncle Lin, you’ll get used to it eventually!”<br/><br/>Lin Chengdong was speechless, “What does that even mean?”\t\t\t\t\t\t</div>", "images": {}, "success": true}