{"id": 375, "url": "https://www.novelhall.com/the-lucky-star-blessing-the-whole-village-32483/15193467.html", "title": "Chapter 375 - Chapter 375: Chapter 367:", "volume": 4, "volume_title": "Volume 4", "body": "<h1>Chapter 375 - Chapter 375: Chapter 367:</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 375: Chapter 367:<br/><br/>Lin Chengdong didn’t need to investigate Xiao Junxuan’s character specifically; he knew how good the young man was.<br/><br/>After all, young people who can gain the approval of Li Minxing, Zhang Liyou, and Zhu Hongguang are truly rare.<br/><br/>Zhu Chengdong returned to the hotel with an attitude.<br/><br/>The two bodyguards looked at each other, not quite understanding.<br/><br/>The boss just went out and came back with a livid face, could it be that Xiao Junxuan’s character is not good? Otherwise, there should be no reason for the boss to be so angry.<br/><br/>A curious bodyguard asked, “Boss, what’s wrong with you? Is Xiao Junxuan’s character not good?”<br/><br/>Zhu Chengdong said angrily, “It pisses me off. That Li Minxing actually wanted to introduce his niece to Xiao Junxuan right in front of me, saying he didn’t want to miss such an outstanding young man.”<br/><br/>The two bodyguards let out a sigh of relief when they heard this.<br/><br/>It turned out that Xiao Junxuan’s character was not bad, but rather too good, and people were fighting to matchmaking him.<br/><br/>They thought, how could the family that cultivated Doctor Xiao, such an outstanding person, possibly cultivate another child with poor character?<br/><br/>The two bodyguards held back their laughter and appeased the angry Lin Chengdong.<br/><br/>“Boss, it’s good that someone is digging at the corners, it proves that Miss has good taste. In the past, you introduced so many talented young men, even Chairman Su, but she didn’t like any of them.”<br/><br/>“Yeah, boss. Such an outstanding young man would be the future husband of the Miss and your future son-in-law. You should be happy. Imagine, when the Miss and her nephew have their wedding, you can introduce the nephew to all the guests, and the expression of Chairman Li and the others would be priceless.”<br/><br/>Listening to the bodyguards, the still angry Lin Chengdong suddenly felt relieved and laughed heartily, “Right, you’re right. When Xiaoxiao and Xiao Junxuan have their wedding, they will be in for a big surprise. Haha, let them undermine my family.”<br/><br/>Lin Chengdong was happy, but he didn’t know that Li Minxing had actually guessed the truth.<br/><br/>In the President’s office of the top-tier technology company in Mei Jian country, Williams listened to his subordinate’s report.<br/><br/>“What did you say, Dragon State’s Su Corporation agreed to cooperate with us?” Williams asked in surprise, wanting to confirm the unbelievable news.<br/><br/>“Yes, boss,” Lai En reported, “Chairman Su Yichen of Su Corporation personally called.”<br/><br/>Williams still couldn’t believe it, “It’s impossible. How can those foolish people from Dragon State agree to such cooperation? You should know that according to Dragon State law, Su Corporation’s cooperation with our Mei Jian’s top-tier technology company could be considered as treason.”<br/><br/>Lai En asked with a slightly serious look, “Boss, what should we do now? According to the plan, Su Corporation of Dragon State will refuse to cooperate with us, and then we will find smaller companies to cooperate with. But we didn’t expect Su Corporation to agree and have Su Yichen personally call.”<br/><br/>Williams frowned and said, “I’ll hold an emergency meeting with the shareholders and the board of directors!”<br/><br/>Lai En nodded, “Okay.”<br/><br/>They hadn’t anticipated Su Corporation’s agreement.<br/><br/>Their agreement had completely disrupted their plans.<br/><br/>While those in the country of Mei Jian were worried, Su Yichen and Xiao Jinli didn’t put the matter on their hearts and just went about their business as usual.<br/><br/>With a smile, Su Yichen said to Xiao Jinli, “I guess those people from Mei Jian must be stunned and troubled right now.”<br/><br/>“Pfft!” Xiao Jinli laughed, “Haha, they deserve it. Now, I want to see what they will do. I bet they are trying every way to find out why you agreed to cooperate with them, and even called them personally.”<br/><br/>With a grin, Su Yichen said, “Hehe, we’re going to let them know what it means to lose their wife and their army. Hmph, they think they can take advantage of Dragonzhou Country? As long as they stick their hands in, we’ll break their hands and legs and send them back.”<br/><br/>“Let’s not talk about that anymore,” said Xiao Jinli. “My dad is coming back tonight and he will probably discuss Xiaoxiao and my brother’s matters. I need to prepare some gifts to give to Xiaoxiao’s muddled father as a token of respect.”<br/><br/>Su Yichen chuckled, “It seems you really like Lin Xiaoxiao. I’ve known you for such a long time, and I’ve never seen you like anyone so much other than people from the Xiao Family Village and a few old masters.”<br/><br/>Xiao Jinli replied, “Xiaoxiao is cute, straightforward, and kind-hearted. I’m worried that my brother, a cunning fox, might take advantage of her.”<br/><br/>“Hahaha…” Su Yichen laughed heartily, “This is the first time I’ve seen you describe your own brother like this. Your brother, Xiao Junxuan, is such an outstanding and handsome young talent, yet in your mouth, he’s somehow become a fox. I wonder how your brother would feel if he heard this.”<br/><br/>Shrugging her shoulders, Xiao Jinli said, “What could his feelings be? He’s been in the business world for more than a decade and has long become an old fox.”<br/><br/>“Little sister, I heard what you said,” Xiao Junxuan’s voice came.<br/><br/>“I loved and pampered you since you were young, and you actually said behind my back that I’m an old fox? That really hurts my heart,” he continued.<br/><br/>“Pfft!” Su Yichen laughed and said, “Brother Xuan, I also think you’re like an old fox in the business world.”<br/><br/>Xiao Junxuan rolled his eyes and said with annoyance, “You’re the real old fox, becoming a top business leader and the richest person in the country at such a young age. Comparing myself to you is like a small witch meeting a big one.”<br/><br/>Su Yichen,<br/><br/>Xiao Jinli said, “Brother, Little Quan became the richest person because he has the talent for business and is known as the Fiery Eyes, Golden Gaze. Any project he invests in will surely make a fortune. So, there’s no need for you to be sour about grapes.”<br/><br/>Xiao Junxuan said unhappily, “Little sister, in the end, who’s your real brother? You’re actually starting to bury me for your Little Quan brother.”<br/><br/>Shrugging her shoulders, Xiao Jinli said, “Brother, Brother Little Quan is also my brother.”<br/><br/>With a smile, Xiao Junxuan said, “Alright, enough with this banter. Sister, Dad will be back tonight, and Uncle Lin will come over for dinner, too. They will probably talk about the matter between Xiaoxiao and me. What kind of gift should I give Uncle Lin for our first meeting of both families’ parents?”<br/><br/>Xiao Jinli teasingly said, “To give a gift to your future father-in-law, it must be something close to his heart.”<br/><br/>Xiao Junxuan said, “Sister, Xiaoxiao said her dad always has high blood pressure and difficulty sleeping at night. What do you think?”<br/><br/>With a smile, Xiao Jinli waved her hand and said, “Alright, I got it. I will prepare a medicine according to his physique and also give a pot of Seven Color Tea Flower. How’s that?”<br/><br/>The value of the Seven Color Tea Flower, especially those produced in Xiao Family Village, is immeasurable.<br/><br/>Not only for its ornamental value but also for its health value.<br/><br/>Xiao Junxuan smiled sincerely and said, “Thank you, sister!”<br/><br/>Technically, he should have been the one to prepare the gift, but the gifts he would give were too ordinary. He could only turn to his sister for help.<br/><br/>In their family, only the gifts from his sister were the most precious and valuable gifts.\t\t\t\t\t\t</div>", "images": {}, "success": true}