{"id": 374, "url": "https://www.novelhall.com/the-lucky-star-blessing-the-whole-village-32483/15193466.html", "title": "Chapter 374 - Chapter 374: Chapter 366:", "volume": 4, "volume_title": "Volume 4", "body": "<h1>Chapter 374 - Chapter 374: Chapter 366:</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 374: Chapter 366:<br/><br/>Boss Zhang, Chairman Li, and the ever silent Manager Zhu watched the retreating figure of a scowling Lin Chengdong and were utterly perplexed.<br/><br/>Chairman Li said, “What’s with him? Was anything I said wrong? He seemed very angry.”<br/><br/>Manager Zhu turned his eyes and said with a smile, “I noticed that as soon as Old Li mentioned that he has a niece wanting to be introduced to Xiao Junxuan, Lin’s face darkened.”<br/><br/>“Ha,” Chairman Li exclaimed in even more confusion. “I introduced my niece to Xiao Junxuan, what does that have to do with him? Could it be that Xiao Junxuan is his son-in-law…..”<br/><br/>Having said this, Chairman Li snapped back to realization, his face full of surprise. “No way? Did he set his sights on Xiao Junxuan too, intending to make him his son-in-law?”<br/><br/>Boss Zhang replied, beaming, “I think it’s probably like that. Otherwise, there would be no reason why his face suddenly turned black and he left when we were chatting.”<br/><br/>For people of their status, expressions of joy, anger or other emotions rarely surface on their faces for others to see.<br/><br/>But Lin Chengdong’s anger was obviously uncommon – they all had no idea what they had done to offend him.<br/><br/>Chairman Li, still puzzled, asked, “Does Zhu Chengdong know Xiao Junxuan? Before, wasn’t he constantly trying to pair his biological daughter with Su Yichen? Why would he suddenly shift his sights to Xiao Junxuan after just one trip to Xiao Family Village?”<br/><br/>“How does Lin Chengdong know about Xiao Junxuan?” Boss Zhang responded after realizing, “Just now, wasn’t it him who raised the question? He was also the one who mentioned Xiao Junxuan. I thought he was here as a tourist. Could it be that his true intent was to find a match for his daughter?”<br/><br/>“But wasn’t he making a big fuss to find his daughter not long ago?”<br/><br/>“It seems that he has found her. His biological daughter was harmed by his adopted daughter who arranged for someone to abduct her and sell her in a remote small village. Later, she managed to escape and Lin Chengdong, really angered by this, reported the incident to the police and had his adopted daughter arrested.”<br/><br/>“Ah, tell me, what has Lin Chengdong done? He raised an adopted daughter only to turn her into an enemy.”<br/><br/>“Exactly. Everyone in the Capital City knows how much he spoiled his adopted daughter. Whenever the girl cried, he was always quick to assume that the biological daughter had bullied the adopted one and would immediately scold her. You would think that the adopted daughter is the biological one and vice versa. After all, not many parents would spoil an outsider over their own.”<br/><br/>Manager Zhu turned his eyes and said with a smile, “I heard that when Lin Chengdong’s biological daughter escaped from the small mountain village, she was rescued and is now being treated at the Xiao Family Village Hospital.”<br/><br/>“Ha, really?” Boss Zhang and Chairman Li exclaimed in unison, their eyes twinkling with juicy gossip.<br/><br/>Unlike these businessmen, Manager Zhu had a background in intelligence, so he knew all kinds of information about the Capital City like the back of his hand.<br/><br/>Manager Zhu said with a grin, “I’m not sure if it’s true. But I heard that after Lin Chengdong’s daughter went missing, he reported the case to the Yamen. At the same time, the Yamen received a report that a girl from Capital City had escaped from a small mountain village after being abducted, and was rescued. The information about the girl matched that of Lin Chengdong’s daughter. The hero who rescued her was from the Xiao Family Village, and he was Xiao Junxuan. After rescuing her, he took her to the Xiao Family Village Hospital and had Doctor Xiao personally treat her. As we all know, unless a patient is terminally ill or has a disease that can’t be treated in a hospital, Doctor Xiao will only personally intervene.”<br/><br/>Boss Zhang laughed heartily, “I also heard the same news. Moreover, I heard that the savior and the saved have now become lovers.”<br/><br/>Staying in Xiao Family Village for the past few days and getting familiar with the villagers, they naturally learned some information from their conversations.<br/><br/>After listening to the two men’s conversation, Chairman Li slapped his head and laughed out loud, “Ha-ha, so that Xiao Junxuan is likely to be Lin Chengdong’s future son-in-law.”<br/><br/>“Haha, so when you tried to steal his future son-in-law, he naturally got angry,” Boss Zhang laughed, finally understanding.<br/><br/>Chairman Li could have rolled his eyes. Slightly tongue-tied, he said, “This Lin Chengdong, really now. He said he was here for tourism, how would I know that Xiao Junxuan was his prospective son-in-law? If I had known, ahem, if I had known, I would have at least mentioned it. Such a promising young man, who would want to miss the opportunity to introduce him to their family? My niece is as precious to me as my own daughter. Being able to marry into the Xiao Family Village, being able to marry Doctor Xiao’s brother, would certainly be a joyous occasion.”<br/><br/>“Stop complaining,” said Manager Zhu, “If Xiao Junxuan were to become your son-in-law, and old Lin tried to steal him away in front of you, I bet you would be angry too.”<br/><br/>“That’s true, Manager Zhu does have a point.”<br/><br/>“Let’s go, let’s go for a walk. It’s really strange though, with so many people around here all day, the air still remains so fresh. Each breathe, and I feel like my whole body is at ease.”<br/><br/>“Indeed. No wonder the country decides to place the retired officials here for them to spend the latter part of their lives.”\t\t\t\t\t\t</div>", "images": {}, "success": true}