{"id": 376, "url": "https://www.novelhall.com/the-lucky-star-blessing-the-whole-village-32483/15193468.html", "title": "Chapter 376 - Chapter 376: Chapter 368:", "volume": 4, "volume_title": "Volume 4", "body": "<h1>Chapter 376 - Chapter 376: Chapter 368:</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 376: Chapter 368:<br/><br/>In the evening, before going to the Xiao family’s home, Lin Chengdong carefully dressed himself.<br/><br/>Two bodyguards looked at their boss constantly adjusting his clothes in front of the mirror, their faces slightly puzzled.<br/><br/>After a while, a bodyguard said, “Boss, with this outfit, you look several years younger than usual.”<br/><br/>Usually, Lin Chengdong didn’t pay much attention to his attire, except when conducting business, he would wear a suit and shoes; most of the time, he wore whatever was comfortable.<br/><br/>Another bodyguard also said, “Yeah, Boss, you’re really looking handsome today.”<br/><br/>However, Lin Chengdong was a bit uneasy and said, “Little Fanfan mentioned that my age is the same as his wife’s. At lunchtime, I saw those old gentlemen, and they didn’t look much different from me.”<br/><br/>He was putting so much effort into dressing now just because he didn’t want to look much older than Xiao Junxuan’s unseen father.<br/><br/>As for Xiao Junxuan’s appearance, he only resembled his mother by just two or three points. The remaining points should be similar to his father’s.<br/><br/>He must be a handsome man; otherwise, it would be difficult to match Xiao’s mother who is such a beauty.<br/><br/>Xiao’s mother has such a stunning appearance that, even in the capital city, or the whole country, she would be considered a great beauty.<br/><br/>However, for such a gorgeous woman to be protected so well, Xiao Junxuan’s father must have some ability and means.<br/><br/>He was somewhat looking forward to meeting his future in-laws, but he didn’t want to lose out too much in terms of age.<br/><br/>He dared not hope that Xiao Junxuan’s father would look about the same age as him.<br/><br/>Of course, the bodyguards didn’t know about his inner thoughts.<br/><br/>After helping Lin Chengdong adjust his clothes, they went to the Xiao family’s house on time.<br/><br/>Xiao Wanshan came back at around three or four o’clock in the afternoon.<br/><br/>As soon as he received his son’s call, he drove back. It took only a little over two hours to drive from Ganjiang City to Xiao Family Village.<br/><br/>When Lin Chengdong arrived at the Xiao family’s house, including several old men, everyone was already inside.<br/><br/>However, since it was the first meeting between the two families, other than Xiao Junxuan and Xiao Jinli, the younger members of the Xiao family didn’t join in the gathering. That night, they all went to the cafeteria for dinner, including Su Yichen.<br/><br/>When Lin Chengdong saw Xiao Wanshan, he was somewhat surprised.<br/><br/>He knew that Xiao Wanshan would be very young, but he didn’t expect him to be this young.<br/><br/>He heard that Xiao Wanshan was fifty-six years old this year, the same age as him.<br/><br/>However, when Xiao Wanshan stood with Xiao Junxuan, they looked like similar-looking brothers, without any father-son resemblance.<br/><br/>It was just that Xiao Wanshan appeared more mature and stable, with more masculine charm.<br/><br/>Lin Chengdong felt a bit disheartened.<br/><br/>He muttered to himself, “Do all the people in the Xiao family have hidden anti-aging genes? Why do they all look so young? No, those old heroes are not from the Xiao family, but they also look younger than their peers, at least ten years younger.”<br/><br/>Xiao Wanshan warmly welcomed Lin Chengdong.<br/><br/>He smiled and said, “Hello future in-law, I’m Xiao Junxuan’s dad, Xiao Wanshan; you can call me Old Xiao. My troublesome son will be your son in the future; if he does anything wrong or treats Xiaoxiao poorly, feel free to scold and punish him.”<br/><br/>Lin Chengdong, “… Is Xiao Junxuan’s dad really so direct?”<br/><br/>Lin Chengdong didn’t let anyone see his emotions, only smiling and saying, “Mr. Xiao, isn’t it a bit early to call each other in-laws?”<br/><br/>Xiao Wanshan laughed heartily and said, “Not early at all! After tonight, my brat and your daughter will be fiancés.”<br/><br/>Lin Chengdong really wanted to turn around and leave, but he couldn’t be willful. If he really turned away and ruined his daughter’s marriage, she would definitely resent him for the rest of her life.<br/><br/>At this point, Xiao Junxuan came over and said, “Dad, Uncle Lin, it’s time for dinner. Let’s take our seats.”<br/><br/>Xiao Wanshan immediately invited Lin Chengdong to the main seat, but Lin Chengdong refused right away.<br/><br/>With so many old gentlemen present, Lin Chengdong] did not dare to occupy the main seat.<br/><br/>There was a dining room in the Xiao Family that had a large round table that could seat 10-20 people.<br/><br/>Now, everyone took their seats.<br/><br/>Xiao Junxuan and Lin Xiaoxiao, Xiao Jinli and Su Yichen sat at the lower seats. When the two sets of parents met, Xiao Wanshan and his wife gave Lin Xiaoxiao a big red envelope. Grandpa Xiao, Grandma Xiao, maternal grandpa, maternal grandma, and several old gentlemen also gave Lin Xiaoxiao big red envelopes, which surprised and flattered Lin Xiaoxiao.<br/><br/>She had never thought that she would receive so many red envelopes on the first meeting of the two families.<br/><br/>_lin Chengdong was also surprised that even the old heroes had given his daughter red envelopes._<br/><br/>Lin Xiaoxiao’s eyes curved into crescent moons as she received the red envelopes, looking very happy.<br/><br/>From today on, she and Xiao Junxuan would no longer be boyfriend and girlfriend but fiancés recognized by both families.<br/><br/>Making her happier was the fact that even her future sister-in-law had given her a gift, the Whitening and Beautifying Pill.<br/><br/>“Sister Xiaoxiao, this Whitening and Beautifying Pill is specially made for your constitution. Take one pill a day for a total of thirty days. This is the first session. After finishing these beauty pills, I will adjust another pill formula based on your constitution and continue taking them. Don’t worry, I will make sure you are fair and smooth-skinned when you marry my brother,” said Xiao Jinli.<br/><br/>Lin Xiaoxiao immediately gave Xiao Jinli a big hug, saying happily, “Thank you, my sister!”<br/><br/>To women, beauty is most important.<br/><br/>Xiao Junxuan said, “Sister, stop calling her Sister Xiaoxiao. You should call her sister-in-law now.”<br/><br/>Xiao Jinli laughed, “Humph, I think calling her Sister Xiaoxiao is more intimate.”<br/><br/>Lin Xiaoxiao covered her mouth and laughed, “I also like Jinli calling me sister. I think calling my sister is more intimate.”<br/><br/>Xiao Junxuan said, “Fine, you guys can call each other whatever you like. Anyway, you are all family now.”<br/><br/>Xiao Jinli then looked at Lin Chengdong and said, “Uncle Lin, I heard from Sister Xiaoxiao that you have high blood pressure. After dinner, let me check your body.”<br/><br/>Lin Chengdong was very excited and nodded, “Thank you, Divine Doctor Xiao.”<br/><br/>Xiao Jinli said with a smile, “Uncle Lin, don’t call me Divine Doctor Xiao anymore. Everyone at home calls me Jinli, so you should do the same.”<br/><br/>Lin Chengdong nodded, “Alright, thank you, Jinli.”<br/><br/>After that, Xiao Wanshan and his wife, along with the elders, discussed Xiao Junxuan and Lin Xiaoxiao’s matters with Lin Chengdong at the dining table.<br/><br/>Lin Chengdong said, “Let them get engaged first. Waiting until the end of the year to get married isn’t too late!”<br/><br/>Xiao Wanshan agreed, “Alright, let them get engaged first, and then get married at the end of the year.”<br/><br/>“Let’s choose a date for the engagement. Which location should we choose, Capital City or Xiao Family Village?” Xiao Wanshan asked.<br/><br/>Most of Lin’s family’s relatives and friends were in Capital City, while most of Xiao’s family’s relatives and friends were in Xiao Family Village.<br/><br/>Lin Chengdong thought for a moment and said, “Let’s choose Xiao Family Village for both the engagement and the wedding!”<br/><br/>Xiao Wanshan asked, “Is that okay? Both the engagement and the wedding are chosen to be in Xiao Family Village? Don’t the relatives and friends on Lin’s side have any objections?”<br/><br/>Lin Chengdong said, “If I say it’s okay, it’s okay!”\t\t\t\t\t\t</div>", "images": {}, "success": true}