{"id": 370, "url": "https://www.novelhall.com/the-lucky-star-blessing-the-whole-village-32483/15193462.html", "title": "Chapter 370 - Chapter 370: Chapter 362:", "volume": 4, "volume_title": "Volume 4", "body": "<h1>Chapter 370 - Chapter 370: Chapter 362:</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 370: Chapter 362:<br/><br/>After Lin Chengdong finished his meal, he felt that it was still not enough.<br/><br/>Now he understood why these respectable older people fought for the food.<br/><br/>The dishes were simply delicious.<br/><br/>Someone who had tasted gourmet food all over the world, came to realize that all those so-called delicacies he had before were nothing in front of these dishes.<br/><br/>Lin Chengdong sincerely praised, “Mrs. Xiao…”<br/><br/>Xiao’s mother laughed and said, “Mr. Lin, my name is Ji Fangqin, everyone calls me Xiaofang. How old are you? I am fifty-three today.”<br/><br/>Fifty-three?<br/><br/>Lin Chengdong opened his mouth wide, utterly incredulous.<br/><br/>At first glance, he thought she was a woman in her early thirties, but knowing that she was the mother of Xiao Junxuan, she must be much older than that, even if someone has children late, they should be in their forties, right?<br/><br/>Who would have thought, Xiao Junxuan’s mother was actually fifty-three.<br/><br/>If it weren’t for the noticeable resemblance between Xiao Junxuan and his mother, he might have mistaken her for Xiao Junxuan’s stepmother.<br/><br/>What mattered most was, such a beautiful and charming woman was so diligent and capable. What a wonder she was.<br/><br/>Lin Xiaoxiao looked at her father’s stunned face, her cheeks turning a little red. She gently tugged at her father’s sleeve, then smiled and said to Xiao’s mother, “Auntie, my dad is fifty-six this year!”<br/><br/>No wonder her father was dumbstruck by his future mother-in-law.<br/><br/>The main reason was that the future mother-in-law was so beautiful, no wonder she gave birth to a little fairy like Xiao Jinli.<br/><br/>Xiao’s mother laughed and said, “Then I seem older, let’s call each other brothers. Brother, if you don’t mind, you can call me sister.”<br/><br/>The two kids weren’t married yet, nor were their engagement settled, so calling each other in-laws wasn’t appropriate yet.<br/><br/>Lin Chengdong laughed and said, “I’ll just call you sister.”<br/><br/>Then he praised, “Sister, your cooking skills are so good that you could outshine those so-called five-star chefs in a five-star hotel.”<br/><br/>As he said this, he gave a thumbs-up.<br/><br/>Xiao’s mother laughed and said, “I only know how to make some ordinary home-cooked dishes, how can I compare to those chefs? If big brother likes my cooking, you’re welcome to come over anytime.”<br/><br/>Lin Chengdong found it hard to refuse.<br/><br/>He nodded and said, “Okay.”<br/><br/>Now he finally understood why these dignified old gentlemen were fighting for the food for lunch like they were in a battle.<br/><br/>At this moment, Xiao’s mother said, “Brother, the children’s father will be back in the afternoon. Let’s sit down and chat together in the evening.”<br/><br/>Lin Chengdong didn’t refuse, he nodded and replied, “Okay!”<br/><br/>He was very curious to see what kind of man could marry such a beautiful, virtuous, and capable woman, and raise such outstanding children.<br/><br/>As for his daughter Lin Xiaoxiao getting married to the Xiao family, he had no objections now.<br/><br/>Before, he thought Su Yichen was the first choice, not just because he was the wealthiest young man, but also because his family had no messy relatives. Well, there were, but he could keep them in check and protect his wife well.<br/><br/>But having seen the people of the Xiao family and the warmth and happiness they have, he thought to himself, “It must be happiness for my daughter to marry into such a family.”<br/><br/>If she married Su Yichen, although there would be no in-laws or siblings to interfere, Su Yichen would be busy at work, leaving her alone at home, which would be cold and devoid of any happiness.<br/><br/>After having his lunch, Lin Chengdong returned to the hotel to rest.<br/><br/>He had rushed here from the Capital City and was looking for Xiaoxiao non-stop. Before he was certain about his daughter’s condition, he couldn’t rest well.<br/><br/>Now seeing his daughter safe, except for some leg injuries and some minor cuts and abrasions, he finally breathed a sigh of relief.<br/><br/>After taking a nap in the afternoon, he decided to tour the village to learn more about Xiao Junxuan’s character.<br/><br/>While the Xiao Family may seem pleasant and warm on the outside, he had no way of knowing what they were like behind closed doors. Therefore, he would be fully at ease only when he investigated personally.<br/><br/>He instructed his bodyguards to wake him up at the designated time, and then went to sleep in his room.<br/><br/>At the Xiao Family’s house, after Lin Chengdong had left, several of the elder men also went to take a rest.<br/><br/>Xiao Junxuan turned to Xiao Jinli and said, “Sister, please stay with Xiaoxiao.”<br/><br/>He intended to clear away the dishes used for the meal.<br/><br/>The meal for so many people had kept Xiao’s mother busy all morning. Naturally, she couldn’t be expected to wash the dishes as well.<br/><br/>Although the Xiao Family had an improved lifestyle, they hadn’t hired any housekeepers. All the chores were done by family members.<br/><br/>Washing dishes was usually the young people in the family’s job.<br/><br/>Grandma Xiao, with a big smile on her face, said, “Xuan’er, you stay with Xiaoxiao. Your grandmother and I will handle the dishes.”<br/><br/>Xiao Junxuan replied, “No, Grandma, you and grandmother have been busy all morning, and deserve a break. I’ll be able to clean up these dishes quickly.”<br/><br/>To save time, they had bought a dishwasher for the house.<br/><br/>They just had to put the dishes into the dishwasher, leave it to do its job, and wipe down the table. The cleanup would be done in no time.<br/><br/>Of course, there was an unspoken rule in the house that Xiao Jinli was not to do these chores.<br/><br/>Jinli did occasionally take part in tasks like doing the dishes. After all, family chores, when done together as a family, made the home feel even cozier.<br/><br/>Now that she was a doctor who sometimes had to perform surgeries, she needed to take great care of her hands.<br/><br/>Although Lin Xiaoxiao was not very familiar with the Xiao Family, she found it easy to interact with them. She smiled and said, “Grandma, Granny, you both go rest. It’s good enough to have Sister Jinli chat with me.”<br/><br/>Grandma Xiao chuckled and replied, “Alright, alright, we’ll rest. You talk with our sweetheart. After Xuan’er is done with the cleanup, he will take you back to your room for a well-deserved rest. Tonight, when Xuan’er’s father returns, we must have a proper meeting between the parents of both families.”<br/><br/>At the mention of a meet-up between both families’ parents, Lin Xiaoxiao blushed and agreed shyly, “Alright, Granny!”<br/><br/>After bidding them farewell, Xiao Junxuan started to clean up the bowls and chopsticks.<br/><br/>Su Yichen had also returned to his hotel to handle work issues.<br/><br/>After all, he was not an ordinary person anymore; he couldn’t possibly delegate all his tasks to others.<br/><br/>After returning to the hotel, he would take off his disguise, returning to his actual appearance, leaving no room for speculation!<br/><br/>He started a video conference.<br/><br/>The assistant promptly reported to him, “Boss, where are you now? The billion-dollar contract with Ailin Group is about to be signed.”<br/><br/>Su Yichen frowned slightly, “Let General Gu go!”<br/><br/>The assistant immediately replied, “General Gu already has three 10 billion dollar orders. If we let him sign this contract too…”<br/><br/>The assistant didn’t finish the sentence, but it was clear what he was implying; he was worried about General Gu becoming overly ambitious since he was holding several big orders.<br/><br/>Su Yiyi waved his hand as he said, “Trust the people you employ, and if you don’t trust them, don’t employ them!”<br/><br/>The assistant’s expression changed slightly and then he responded, “Okay, I understand boss. I will get in touch with General Gu.”<br/><br/>Afterward, Su Yichen received reports from other subordinates.<br/><br/>However, one person’s report made him frown.<br/><br/>That person said, “Boss, Mei Jian’s top-tech company is planning an investment of 30 billion to set up a tech company with us!”\t\t\t\t\t\t</div>", "images": {}, "success": true}