{"id": 371, "url": "https://www.novelhall.com/the-lucky-star-blessing-the-whole-village-32483/15193463.html", "title": "Chapter 371 - Chapter 371: Chapter 363:", "volume": 4, "volume_title": "Volume 4", "body": "<h1>Chapter 371 - Chapter 371: Chapter 363:</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 371: Chapter 363:<br/><br/>Su Yichen went to Xiao Jinli’s office.<br/><br/>Xiao Jinli’s office was at Xiao Family Village Hospital<br/><br/>However, Xiao Jinli rarely saw patients, she only went in when the hospital called about a critical patient.<br/><br/>She generally didn’t stray too far from the hospital, so she could quickly respond when a patient came in.<br/><br/>“What’s wrong, Brother Little Quan?” Xiao Jinli asked with confusion.<br/><br/>It was unusual for him to come looking for her at the hospital, knowing she was busy when she was there.<br/><br/>Su Yichen said, “One of my subordinates reported to me, Plum Firm Country’s top technology company wants to cooperate with my company, investing 30 billion to establish a technology company in our country.”<br/><br/>“This is certainly impossible.” Xiao Jinli frowned, “A technology company is not like some ordinary company, you can’t just cooperate with foreign countries, and furthermore with Plum Firm Country’s top technology company. What does Plum Firm Country want to do?”<br/><br/>Technology concerns the country’s development.<br/><br/>Usually, although there are technological exchanges and cooperation, the real technological core of any country would not be casually disclosed.<br/><br/>Therefore, in joint venture technology companies, unless they are low or mid-level companies, the technological core of top-end technology companies only resides in the hands of a few people or countries.<br/><br/>Su Yichen nodded, “The proposal of cooperation from Plum Firm Country’s top technology company is blatantly unreasonable. I think, they must be planning something.”<br/><br/>Xiao Jinli nodded in agreement, “I agree. Otherwise, how can Plum Firm Country, which is reputed to have the most advanced technology in the world, suddenly come to our country seeking cooperation, and moreover, directly approach you?”<br/><br/>Even if Su Yichen agreed, the country would hardly agree.<br/><br/>Plum Firm Country is not a fool either, how can they propose such a cooperation, it’s obviously an investment bound to lose.<br/><br/>Su Yichen thought for a moment and said, “They are probably scared.”<br/><br/>“Hmm, how do you mean?” Xiao Jinli asked with a smile.<br/><br/>Su Yichen said, “Divine Wind Technology Group, appearing out of nowhere, has introduced several high-tech projects in a few short years, making our country’s technological level leap a great step forward. Give Divine Wind some more time, and our country’s technology will certainly surpass them. So, they want to destroy it before Divine Wind monopolizes the top spot.”<br/><br/>Xiao Jinli nodded, “Your reasoning makes sense. However, they’ve made so many roundabout maneuvers, what exactly do they want to do to take down the Divine Wind Group?”<br/><br/>Su Yichen thought for a moment and said, “That’s exactly what I can’t figure out.”<br/><br/>Xiao Jinli said, “Some time ago, Xu Guochang reported to me that Plum Firm Country told the world media that the core technology of the Divine Wind Group was stolen from them. They are preparing to gather evidence and intend to sue them for theft of secrets in the International Court.”<br/><br/>Su Yichen’s demeanour changed, “There’s such a thing.”<br/><br/>Xiao Jinli nodded, “Yes. Just that there’s been no movement for more than a month after this incident. I was wondering why they were silent. It turns out they want to start from here.”<br/><br/>On hearing this, Su Yichen’s eyes instantly lit up, he said, “I understand now. What they actually need isn’t an investment partner, they need an assailant to challenge the Divine Wind Group.”<br/><br/>Xiao Jinli nodded, “Exactly. With the investment amount of 30 billion, they are not trying to attract your Su Corporation, but other companies. There are so many companies nationwide, not all companies are as large and wealthy as the Su Corporation. Plum Firm Country doesn’t really want to cooperate with Su Corporation, but put out the news under the guise of investment cooperation with Su Corporation. If Su Corporation agrees to the cooperation, that’s great. If not, other companies will swarm in.”<br/><br/>Su Yichen tapped the table lightly with one hand, frowning and wondering, “But wouldn’t Plum Firm Country be miscalculating? If they agree to cooperate, what about our superiors? Would they really allow that top Plum Firm Country technology company to enter?”<br/><br/>Xiao Jinli smiled and said, “I think I know what Plum Firm Country means. They are coercing!”<br/><br/>“Coercing? What do you mean by that?” Then he suddenly realized and said, “Damn it, Plum Firm Country is too cunning. Jinli, what do you want to do?”<br/><br/>He knew that the Divine Wind Technology Group belongs to Xiao Jinli.\t\t\t\t\t\t</div>", "images": {}, "success": true}