{"id": 379, "url": "https://www.novelhall.com/the-lucky-star-blessing-the-whole-village-32483/15193471.html", "title": "Chapter 379 - Chapter 379: Chapter 370: _2", "volume": 4, "volume_title": "Volume 4", "body": "<h1>Chapter 379 - Chapter 379: Chapter 370: _2</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 379: Chapter 370: _2<br/><br/>“Xiao Junxuan, I never thought that you, who never talked about love, would be this shameless when you finally did.”<br/><br/>“That’s right. We used to think that such a spirited young man in his thirties without a girlfriend was planning to become a monk. It turns out you just hadn’t met the girl who made you want to fall in love.”<br/><br/>“Haha, if it weren’t for Xiaoxiao’s leg injury now, he’d probably want to get married right away. You haven’t seen Xiao Junxuan running to the hospital the minute he gets off work these days. Oh, no, even at work, he’s constantly sneaking off to the hospital.”<br/><br/>“Tsk tsk, when this man starts dating, he really gets energetic. Working while taking care of his girlfriend at the same time.”<br/><br/>Everyone teased Xiao Junxuan one after another.<br/><br/>Although they were talking about Xiao Junxuan, Lin Xiaoxiao’s face was red the whole time, as if she wanted to hide in the cracks of the ground.<br/><br/>“Hm, Sister Xiaoxiao’s face is so red,” Xiao Jinli said with a seemingly unintentional expression as she deliberately teased, “Sister Xiaoxiao, are you sick? Come, let me check.”<br/><br/>As soon as she said it, she deliberately moved forward to touch Lin Xiaoxiao’s head.<br/><br/>Everyone looked over and an auntie said with laughter, “Haha, it’s not sickness, the girl is just shy.”<br/><br/>Xiao Jinli pretended to be puzzled and asked, “Shy? Why would Sister Xiaoxiao be shy? Everyone is talking about my brother. Shouldn’t my brother be the one who’s shy?”<br/><br/>“Haha, that’s true, but your brother has thick skin,” everyone laughed and said, “We never noticed your brother’s thick skin before, but now he’s dating, and it’s exposed his true nature.”<br/><br/>Xiao Junxuan said seriously, “If I didn’t have thick skin, I wouldn’t find a wife. This is my experience.”<br/><br/>“Oh, you just started dating and already consider yourself a love expert, huh?” someone teased with a smile, “Sure enough, a top student learns everything fast. According to you, you can totally teach others how to fall in love, right?”<br/><br/>But Xiao Junxuan said solemnly, “Let’s leave teaching others aside. I can only be my own love expert.”<br/><br/>Jiang Yifan listened to the adults talking, his face full of confusion.<br/><br/>Didn’t they say they were going to have a baby? How come it turned out to be dating?<br/><br/>Jiang Yifan asked uncertainly, “Uncle, what is dating?”<br/><br/>Xiao Junxuan patted his little head and said with a smile, “You’re too young to understand. When you grow up, you’ll know.”<br/><br/>“Why do I have to be grown up?” Jiang Yifan asked, not quite understanding, “Is there something about dating that adults do that children can’t see?”<br/><br/>“Haha…”<br/><br/>“Little Fanfan is so cute!”<br/><br/>“Little Fanfan is adorable.”<br/><br/>“Little Fanfan, do you really want to know what dating is?” someone laughingly asked out of curiosity.<br/><br/>Jiang Yifan frowned, then nodded seriously, “Yes, I want to know.”<br/><br/>Someone said chuckling, “Dating is when a boy and a girl want to be together all the time.”<br/><br/>This explanation was just right – not too abstruse, easy to understand, and also wouldn’t lead the child astray.<br/><br/>“So that’s dating?” Jiang Yifan blinked his eyes and asked, “Like Grandpa and Grandma, and Uncle Xiao and Aunt Xiaoxiao?”<br/><br/>“Haha, that’s right, Little Fanfan, you’re so smart!”<br/><br/>Jiang Yifan thought for a moment, his eyes suddenly lit up, and he exclaimed, “Oh, I see. So Uncle Little Quan and my mom are dating because they’re also together all the time, right?”<br/><br/>As soon as Jiang Yifan’s words fell, the lively atmosphere suddenly quieted down.<br/><br/>Then, everyone in the yard turned their eyes back and forth between Su Yichen and Xiao Jinli.<br/><br/>“Jinli, are you really dating Little Quan?” someone immediately questioned.<br/><br/>“Speaking of which, Little Quan and Jinli have always had a good relationship. Back when Little Quan lived in Xiao Family Village, they were always seen together.”<br/><br/>“Nonsense! Jinli was so young back then, isn’t it normal for siblings to be together?”<br/><br/>“But they’re not biological siblings, right?”<br/><br/>“Whether or not they’re biological siblings, they are considered siblings in name. Jinli was so young back then. You stinking boy, if you say they were dating back then, see if I don’t beat you!” This was spoken by a mother and her son.<br/><br/>“No, no, Mom, you misunderstood me. I meant they were close, but I didn’t say they were dating,” the son hurriedly explained.<br/><br/>“You know, I think Jinli and Little Quan are quite compatible. Little Quan has top-notch looks and figure, while Jinli is also pretty. They look terrific together, like a perfect golden boy and girl.”<br/><br/>“They do look compatible, and Little Quan has a good personality. It’s just that the age difference between Little Quan and Jinli is a bit too much, isn’t it?” They were seven or eight years apart.<br/><br/>“In this day and age, height is not an obstacle, and age is not a problem. What’s wrong with a man being a little older?”<br/><br/>The villagers, ignoring the two embarrassed parties, continued to discuss whether they were a good match.<br/><br/>Xiao Jinli, who’d always been good at concealing her feelings, couldn’t help but blush at this point.<br/><br/>In the past, everyone spoke of her with praise.<br/><br/>Now, they were talking about her love life in front of her.<br/><br/>What she hadn’t expected was the high public opinion about her and Su Yichen, even though there was nothing going on between them yet.<br/><br/>God knows, she really, truly regarded Su Yichen as a friend and brother, but never thought of him as a lover.<br/><br/>“Mm-Hmm,” Xiao Jinli finally spoke up, saying, “Everyone misunderstood. I just treat Brother Little Quan as a brother, and I have no other thoughts. Besides, I’m still young and not thinking about dating.”\t\t\t\t\t\t</div>", "images": {}, "success": true}