{"id": 378, "url": "https://www.novelhall.com/the-lucky-star-blessing-the-whole-village-32483/15193470.html", "title": "Chapter 378 - Chapter 378: Chapter 370:", "volume": 4, "volume_title": "Volume 4", "body": "<h1>Chapter 378 - Chapter 378: Chapter 370:</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 378: Chapter 370:<br/><br/>Lin Chengdong understood the principle of not showing off one’s wealth, so he would definitely protect this tea flower. Otherwise, if those wolves and tigers found out, it would be unknown whether he could keep this Seven Color Tea Flower safe.<br/><br/>Lin Chengdong wanted to give a return gift, but he didn’t know what would be a good one.<br/><br/>Lin Xiaoxiao tilted her head and thought, “I spent about the same time in the hospital, but I know the basics of the Xiao Family. They don’t lack money or influence. Whatever they want, they can get easily. I don’t know what kind of gift to give to my little sister. But I’ve heard Brother Xuan say that every year, the gifts their relatives and friends give to Little Sister Jinli are all those dolls, panda dolls, rabbit dolls, anyway, those fluffy dolls.”<br/><br/>“Haha, give dolls?” Lin Chengdong was slightly puzzled. “Does the Divine Doctor like dolls?”<br/><br/>In his heart, Xiao Jinli was like a divine figure that people worshiped. Immortals don’t eat mortal food, so they naturally wouldn’t care for these unbearable things in the world.<br/><br/>Lin Xiaoxiao rolled her eyes at her father and said, “What’s wrong with liking dolls? Even though Little Sister Jinli is a famous Divine Doctor, she’s still just a girl in her teens. Girls like cute things. I heard that there’s a special room at home for those dolls.”<br/><br/>Lin Chengdong understood instantly, “Okay, I got it. I’ll have someone buy a big and cute doll right away, no, I’ll have one customized.”<br/><br/>He instantly understood.<br/><br/>That’s right, most girls like dolls, especially those cute and fluffy dolls.<br/><br/>Three days later, Xiao Jinli received a two-three-meter-tall white fluffy rabbit doll at home. The rabbit had long and big ears, and round eyes.<br/><br/>Jiang Xiaofan looked up at the big doll and exclaimed, “Mommy, this doll is so big! It’s bigger than any doll in your room. Who gave it?”<br/><br/>Xiao Junxuan pushed Lin Xiaoxiao back and saw the doll, his expression slightly startled, then laughed and said, “This doll is so big. It looks like my father-in-law put a lot of thought into it.”<br/><br/>But such a big fluffy doll, although it looked cute, was hard to hold.<br/><br/>Jiang Yifan reacted and immediately asked, “Uncle, are you saying that Grandfather Lin gave this big doll? Why would he send such a big doll? How can you hold it?”<br/><br/>Buying dolls was originally for holding and stroking the fluff.<br/><br/>Xiao Junxuan said, “Isn’t bigger better?”<br/><br/>No matter whether the gift from the father-in-law is good or not, it must be the best.<br/><br/>Jiang Yifan spoke the truth, “But uncle, this doll is really too big and not good to hold. My mommy said this.”<br/><br/>Xiao Junxuan looked at Xiao Jinli immediately.<br/><br/>Xiao Jinli’s mouth twitched, and she immediately denied it, “Big dolls are not good to hold, but they can be used for viewing and stroking the fluff. They’re much better than small dolls. I like this big doll.”<br/><br/>Under the threatening gaze of her older brother, even if she didn’t like it, she had to pretend to like it.<br/><br/>She found that since her brother started dating, her position as a younger sister seemed to have moved a bit back.<br/><br/>Xiao Junxuan immediately said, “Jiang Yifan, did you hear that? Your mommy likes this doll.”<br/><br/>Jiang Yifan, He was young, but not foolish.<br/><br/>It was obvious that Mommy was forced to accept it due to her uncle’s intimidation.<br/><br/>It was only just a while ago that someone wanted to buy Mommy a very big doll, but she rejected the idea.<br/><br/>She said that too big of a doll is really not good to hold and doesn’t have that cute feeling.<br/><br/>Many people were attracted by such a big doll.<br/><br/>“Wow, such a big doll, so fluffy and cute. Who gave this doll?”<br/><br/>Xiao Junxuan immediately said, “It’s from my father-in-law.”<br/><br/>As soon as he finished speaking, everyone’s eyes turned to Lin Xiaoxiao.<br/><br/>Lin Xiaoxiao blushed and said, “We are not married yet. You can’t call him your father-in-law now.”<br/><br/>Even if they really got married in the future, that would be a future matter. Now, they were just boyfriend and girlfriend, and they hadn’t even gotten engaged yet.<br/><br/>Being called a father-in-law by her boyfriend now, even Lin Xiaoxiao with a thick face would be embarrassed.<br/><br/>Xiao Junxuan said, “Not now, but in the future. I’m just getting used to the idea of having an extra dad.”<br/><br/>“Hahaha…” Everyone laughed at Xiao Junxuan’s shamelessness.\t\t\t\t\t\t</div>", "images": {}, "success": true}