{"id": 373, "url": "https://www.novelhall.com/the-lucky-star-blessing-the-whole-village-32483/15193465.html", "title": "Chapter 373 - Chapter 373: Chapter 365:", "volume": 4, "volume_title": "Volume 4", "body": "<h1>Chapter 373 - Chapter 373: Chapter 365:</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 373: Chapter 365:<br/><br/>Xiao Family Village and Xiao Village Farmhouse are separate.<br/><br/>The Xiao Family Village is the place where the villagers and outsiders live, and the manor is the former land of the Xiao Family Village. Now, in addition to farming vegetables and other agricultural products, some recreational and viewing spots have been built.<br/><br/>These venues, when planned, were made to occupy as little arable land as possible, and most of them were built at the foot of the hills or in barren areas where it is difficult to cultivate.<br/><br/>The entire Xiao Family Village and the Farmhouse, with the land formerly belonging to the Xiao Family Village and the rented land from other villages, cover an enormous area of about 2.7 million square meters, which is about 4500 mu.<br/><br/>It’s said that the Kyoto Botanical Garden occupies just over 900 mu of land, so one can see how big the Xiao Village Farmhouse is. Not to mention the mountains, it would take at least three days to visit the entire Xiao Family Village Estate.<br/><br/>Only then did Lin Chengdong discover that the entire Xiao Family Village was so vast.<br/><br/>When strolling around Lin Family Village, he also came across several familiar faces who often appeared in financial magazines.<br/><br/>Of course, as celebrities in the business world and well-known domestic entrepreneurs, those people were also familiar with Lin Chengdong.<br/><br/>“Haha, Lin Dong, what a coincidence to meet you here! Do you also live in Xiao Family Village now?”<br/><br/>“CEO Li, what a coincidence.” Lin Chengdong smiled and said, “No, I’m just here for a few days of sightseeing.”<br/><br/>“Oh, even the busy Chairman Lin has time to travel!” Boss Zhang asked with a smile.<br/><br/>“Work-life balance!” Chairman Lin joked, “Do you gentlemen also live in Xiao Family Village?”<br/><br/>CEO Li and others nodded and said, “Yes. I obtained my residence permit three years ago. Now, whenever I have time, I come here.”<br/><br/>“I got mine one year ago.”<br/><br/>“I got mine three months ago.”<br/><br/>Lin Chengdong curiously asked, “Is it easy to get a residence permit?”<br/><br/>Boss Zhang shook his head and said, “It’s not easy nor hard. It’s not just about having money and power to get to live in Xiao Family Village. Those who come to live here must meet the requirements of Xiao Family Village. The most important point is that anyone who wants to live here must pass the approval of a girl from Xiao Family Village named Xiao Jinli.”<br/><br/>Lin Chengdong was instantly dumbfounded and confirmed incredulously, “You mean Xiao Jinli?”<br/><br/>“Yes, it’s Xiao Jinli,” Chairman Li complained, “Other conditions are negotiable, but this condition is simply baffling. I don’t know why the villagers of Xiao Family Village have such a condition. It’s too hasty to let a child decide such a big matter, isn’t it?”<br/><br/>Lin Chengdong tentatively asked, “Do you know Xiao Jinli’s status in Xiao Family Village?”<br/><br/>“Of course, it must be very high and significant,” Boss Zhang affirmed. “Otherwise, the condition for living in Xiao Family Village would not have to be approved by Xiao Jinli, and even the Village Head or the respected elders’ agreement would be useless.”<br/><br/>Chairman Li nodded and said, “Indeed.”<br/><br/>Lin Chengdong asked in confusion, “Then how did you make Xiao Jinli agree?”<br/><br/>He was truly very curious.<br/><br/>“Nothing special,” Boss Zhang said puzzledly, “We just sat in the village committee meeting room for a while, and then several village cadres brought a bunch of agreements and contracts for us to sign, smiling. We didn’t even meet Xiao Jinli.”<br/><br/>Lin Chengdong,<br/><br/>Then he asked tentatively, “Do you know that Xiao Jinli is skilled in medicine?”<br/><br/>“Of course we do,” said Chairman Li, “Not only is Xiao Jinli skilled in medicine, but she is also a divine doctor; this is no secret in Xiao Family Village. Just look at the huge Buddha statues at her house.”<br/><br/>There have been rumors in the Capital City that several old heroes from The Retirement Home for Cadres followed the Divine Doctor on a trip to her hometown for recuperation, and the rumor was that the Divine Doctor was a teenage girl back then. Although we didn’t see the true face of the Divine Doctor at the time, we now know who Dr. Xiao is after coming here.”<br/><br/>Lin Chengdong asked, “Maybe it’s because of Xiao Jinli the Divine Doctor’s identity that living here requires her approval?”<br/><br/>“It’s not for that reason!” Chairman Li shook his head and said, “I have been living here for three years and know very well that the people of Xiao Family Village, young and old, up and down, respect and trust Xiao Jinli very much. Even the animals in Xiao Family Village only listen to Xiao Jinli. Before that, the people in the village didn’t know that Xiao Jinli could heal.”<br/><br/>Lin Chengdong, Is it that magical?<br/><br/>Was it not only the people, but even the animals in the village who listened to Xiao Jinli?<br/><br/>“Lin Dong, you may not know that Xiao Jinli is a legendary story in Xiao Family Village! I heard that the entire Xiao Family Village’s vegetable marketing was proposed by Xiao Jinli, and the establishment of the company was also her idea. And there’s more…”<br/><br/>Chairman Li went on and on about Xiao Jinli’s legendary story.<br/><br/>Having been there the longest, he knew the most about the people and events of Xiao Family Village!<br/><br/>Lin Chengdong listened, dumbfounded!<br/><br/>Is this a child?<br/><br/>Is this an ordinary child?<br/><br/>Xiao Jinli is simply a freak, a monster!<br/><br/>No wonder she’s gained the support of the entire village; following Xiao Jinli means having meat to eat, right?<br/><br/>Look, the whole village has now led an affluent life.<br/><br/>Lin Chengdong opened his mouth and asked, “I heard Jinli has an older brother. What kind of person is he?”<br/><br/>“Haha, Lin Dong, what makes you suddenly ask about Xiao Junxuan?” Chairman Li laughed and said, “Xiao Junxuan is a very talented and mature young man. I heard that the men in their family are good at pampering women. If I had a daughter, I would choose him! Wait, I have a niece! I can introduce my niece to Xiao Junxuan!”<br/><br/>Lin Chengdong,\t\t\t\t\t\t</div>", "images": {}, "success": true}