{"id": 386, "url": "https://www.novelhall.com/the-lucky-star-blessing-the-whole-village-32483/15193478.html", "title": "Chapter 386 - Chapter 386: Chapter 377:", "volume": 4, "volume_title": "Volume 4", "body": "<h1>Chapter 386 - Chapter 386: Chapter 377:</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 386: Chapter 377:<br/><br/>Xiao Yucheng received instructions from Xiao Jinli to add an interesting confession game project.<br/><br/>There are already on-site confession scenes, with more than two mu of tens of thousands of roses arranged in a heart shape. Now, they need to find actors.<br/><br/>There are two requirements for the actors: the girl must be pure and beautiful, while the man must be handsome and good-looking, and of course, good character is required.<br/><br/>When it comes to character, no one is more accurate in judging people than Xiao Jinli.<br/><br/>So, Xiao Jinli must be the one to approve the chosen personnel.<br/><br/>Xiao Yucheng immediately called a meeting of senior officials, and the focus of the meeting was, of course, finding actors.<br/><br/>Beautiful women and handsome men are most abundant in the entertainment circle.<br/><br/>Xiao Yucheng didn’t care where the marketing department found actors, as long as they met the requirements.<br/><br/>During the meeting, someone looked at Xiao Junxuan and joked, “Junxuan, I think you and your girlfriend fit the requirements best. Why don’t you two become the actors for this project?”<br/><br/>“Haha, don’t joke. Junxuan is already so busy with work and has to find time to accompany his girlfriend. If he has the time for this project, he would certainly use it.”<br/><br/>Xiao Yucheng’s expression was serious as he said, “I don’t care where you find people, whether it’s in the entertainment circle or on the street; just make sure you find actors who meet the requirements.”<br/><br/>“The entertainment circle has the most handsome men and beautiful women; we can try looking there.”<br/><br/>“Hehe, the handsome men and beautiful women in the entertainment circle usually pursue money, fame, and status. Once they become famous, their fees for acting in dramas can easily be tens of millions or even billions. But coming to act here would just be an ordinary job with an ordinary salary, so who would come? In my opinion, it’s best if we go to a small mountain village or look for ordinary people on the streets to act.”<br/><br/>“I agree. We should find ordinary people to be the actors for this project. Those handsome men and beautiful women in the entertainment circle are all after fame, so we might as well save ourselves the trouble.”<br/><br/>Xiao Yucheng nodded and said, “This is a matter for the marketing department. I will only give you half a month. In half a month, I must see results. Otherwise, I won’t be able to explain.”<br/><br/>Xiao Yucheng is already the highest official in the company.<br/><br/>So, the only person he could answer to is Xiao Jinli.<br/><br/>Xiao Mingchen took charge of the marketing department, while Xiao Junxuan took charge of the sales department.<br/><br/>Xiao Mingchen sized up Xiao Junxuan with a shrewd look in his eyes before smiling and saying, “Ah Xuan, have you considered letting you and your girlfriend do a live confession performance? I think that with your looks and your girlfriend’s, you could easily become internet celebrities.”<br/><br/>Xiao Junxuan almost rolled his eyes.<br/><br/>He said with a cold smile, “Second Brother, to be honest, the ideal actors would actually be Xiao Jinli and Su Yichen. Why don’t you go and ask them directly?”<br/><br/>Xiao Mingchen immediately waved his hands and said, “No, no, my sister never appears in public. Su Yichen being a rich man is not a problem, but does he have the time for it? I don’t think so. And even if he does have the time, the object of his confession can only be our Little Sister Jinli, so they are not suitable for this project.”<br/><br/>Xiao Junxuan laughed, “Second Brother, I don’t have the time either. I’m busy working all day.”<br/><br/>Xiao Mingchen said, “This project won’t take much of your time, and it could still be considered within the scope of your work. The company will certainly take it into consideration.”<br/><br/>Xiao Junxuan waved his hand and said, “Forget it. I’m not getting involved. Second Brother, you should find someone else. In fact, there are several girls and boys in our village who are quite good. If they’re willing to become famous, it would be best to find them.”<br/><br/>Even if they’re from the same village, it wouldn’t lead to any emotional attachment as long as they acted professionally.<br/><br/>If the actors are two strangers, the outcome might be hard to predict.<br/><br/>Especially since Xiao Jinli didn’t say that they would block the actors involved in this project.<br/><br/>That is to say, the actors of this project could potentially become well known and face the impact of fame and fortune in the future.<br/><br/>However, for the people of Xiao Family Village, they don’t need this.<br/><br/>Xiao Mingchen and Xiao Junxuan chatted for a while and then returned to their own tasks.<br/><br/>Although Xiao Jinli was considering it, there was almost no suspense that she would agree.<br/><br/>Nothing changed between her and Su Yichen after that; they continued to go in and out together, and people who saw them couldn’t help but giggle behind their hands.<br/><br/>“Jinli and Xiao Quan really do make a perfect match. Look, the man is handsome, and the woman is beautiful; they’re truly a golden couple and pleasing to the eye.”<br/><br/>“Isn’t that the truth? Our Jinli is the most beautiful girl in the village. Xiao Quan is also a handsome young man, good enough for our Jinli.”<br/><br/>“But I heard that Jinli hasn’t agreed to date Xiao Quan yet, and they’re still interacting on a brother-sister basis. However, I heard that Xiao Siqian has started pursuing Jinli.”<br/><br/>“He should be pursuing her. What girl wouldn’t want someone to pursue them? It represents a kind of attitude. There wouldn’t be a lack of suitors as long as Jinli is willing.”<br/><br/>“Xiao Quan put a lot of effort into pursuing Jinli on the first day. He had thousands of roses air-freighted over. Tourists talked about the roses being named Juliet, the most expensive rose in the world. Each rose is worth several hundred yuan. Wow, just how much money does Xiao Siqian have? He spent several million just trying to pursue Jinli. Those thousands of roses were planted in the fields overnight.”<br/><br/>“Haha, don’t they know that those roses made the place even more beautiful?”<br/><br/>“Isn’t it? That’s why Jinli thought of adding amusement projects to the manor. Now Xiao Yucheng and his team are looking for actors.”<br/><br/>“Speaking of actors, my Yanzi just graduated from university today. I wonder if she’s interested in taking on this job. I’ll call and ask later.”<br/><br/>“My Linzi also just graduated from university today, but he wants to go to graduate school. He probably doesn’t want to stay and work at home; he wants to do research.”<br/><br/>“I think it’s better to find actors from our own village.”<br/><br/>“In my opinion, whether it’s actors from our village or from outside, it’s all good as long as they do the job well. According to Jinli’s intention, the actors for this project can develop further outside. My Yanzi is from the village, and I don’t want to let her blend into the entertainment circle or become an internet celebrity.”<br/><br/>“Let’s leave this matter to Xiao Yucheng and his team to discuss. I believe they will give everyone a satisfactory result, and of course, Jinli’s satisfaction is most important. Da Chun, I think you should ask Yanzi about her intentions. If Yanzi is interested, you should ask Jinli if it’s okay. As long as Jinli says it’s okay, she’s sure to protect Yanzi.”<br/><br/>“You make a good point. I’ll ask her later. What the children want is important.”\t\t\t\t\t\t</div>", "images": {}, "success": true}