{"id": 388, "url": "https://www.novelhall.com/the-lucky-star-blessing-the-whole-village-32483/15193480.html", "title": "Chapter 388 - Chapter 388: Chapter 379:", "volume": 4, "volume_title": "Volume 4", "body": "<h1>Chapter 388 - Chapter 388: Chapter 379:</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 388: Chapter 379:<br/><br/>No one expected that the Xiao Village Farmhouse, which was just hiring a few ordinary actors, would attract nationwide attention and be widely reported by major media outlets.<br/><br/>At the same time, someone posted on the Internet that there was a man in Xiao Village who looked almost identical to the Wealthiest Person. If it were not for the unanimous statement of the people of Xiao Village that this man was not Su Yichen, it could be easily mistaken for Su Yichen.<br/><br/>However, ordinary people would just be mistaken.<br/><br/>For the top figures in the circle, they finally knew where Su Yichen was staying.<br/><br/>Previously, Su Yichen said he was going to negotiate a big project and then disappeared in the public eye. Even his personal bodyguard did not know where he had gone.<br/><br/>If Su Yichen had not made arrangements before leaving, people would have thought he had been kidnapped.<br/><br/>Capital City, a certain luxurious mansion.<br/><br/>A young woman in her early twenties, with exquisite makeup, had just returned from shopping, still holding a limited edition bag in her hand.<br/><br/>She sat on a high-end sofa, spread her fingers, and looked at her expensive manicure impatiently, “Dad, I was just shopping with my friends. Why did you call me back?”<br/><br/>Liang Haohan said in disappointment, “All you do is shop all day long, don’t you know that Su Yichen is about to be snatched away by someone?”<br/><br/>Upon hearing this, anger immediately appeared on Liang Shanshan’s face, “Who dares to snatch Su Yichen away? I’ll skin them alive. It was bad enough that Lin Xiaoxiao tried it before, but now the whole Capital City knows that Su Yichen is the man I, Liang Shanshan, have set my sights on. Which blind woman would dare to compete with me? I’ll make her suffer.”<br/><br/>“Hmph, no one in the Capital City. But what about outside the Capital City?” Liang Haohan sneered.<br/><br/>Liang Shanshan was taken aback and asked, “Dad, what do you mean?”<br/><br/>“What do I mean?” Liang Haohan said coldly, “Someone in Xiao Village saw a man who looks exactly like Su Yichen, but he denied being Su Yichen and claimed to be a local.”<br/><br/>Upon hearing this, Liang Shanshan breathed a sigh of relief, “Dad, that’s just two similar-looking people. Everyone knows that Su Yichen is from Capital City, and he grew up here. How could he possibly be from Xiao Village?”<br/><br/>“What do you know?” Liang Haohan scolded, “That is Su Yichen himself.”<br/><br/>“How is that possible?” Liang Shanshan asked in surprise, “If it is really him, why would he deny it?”<br/><br/>Liang Haohan’s face turned livid with anger, he pointed at Liang Shanshan and shouted, “What is your brain for? All day long, all you know is shopping, buying this limited edition, that limited edition; you don’t even know your man is about to be taken away.”<br/><br/>Liang Shanshan’s expression changed, and she said seriously, “So, Dad, is the man in Xiao Village really Su Yichen? How is that possible? He is usually in Capital City, and I have never heard of him buying a house or living in Xiao Village.”<br/><br/>The Liang Family had also applied for residence in Xiao Village but were rejected.<br/><br/>This caused Liang Haohan to lose face.<br/><br/>If it wasn’t for the presence of several Old Heroes in Xiao Village and the national Retirement Home for Cadres built in Xiao Village, he would have made the people of Xiao Village suffer.<br/><br/>Why wasn’t his Liang Family qualified for residence?<br/><br/>His Liang Family had billions in assets, power, and influence.<br/><br/>Of course, he didn’t dare to take action now.<br/><br/>He knew that if he touched Xiao Village, the country would not let him off.<br/><br/>So, he had to endure this resentment.<br/><br/>He would wait until the country no longer sheltered Xiao Village and then settle the score.<br/><br/>Hmph!<br/><br/>Now, which woman from Xiao Village has caught Su Yichen’s eye? This is unacceptable!<br/><br/>Su Yichen was the son-in-law he had in mind. Last time, people thought he was not in the Capital City and had disappeared, and maybe even been kidnapped. He wanted to take advantage of this opportunity to mess with the Su Corporation.<br/><br/>Who would have thought that Su Yichen had prepared various precautions? Instead of biting a piece of meat off the Su Corporation as planned, not only did they not pluck a single hair, but the Su Corporation also bit a piece of meat off them. It truly enraged him.<br/><br/>He must get a piece of the Su Corporation’s huge wealth.<br/><br/>Since he couldn’t defeat Su Yichen in business, he would bring him to his side.<br/><br/>After all, Su Yichen was all alone. He had almost destroyed his despicable relatives, leaving even his own father to live alone in that villa, living a life worse than death.<br/><br/>So, they would try to take over the Su Corporation through marriage.<br/><br/>But who would have thought that when Su Yichen appeared, he would be professing his love to someone in Xiao Village?<br/><br/>This was absolutely unacceptable.<br/><br/>Liang Haohan said to his daughter, “Hurry up and get yourself ready, go to Xiao Village immediately, find Su Yichen, and I don’t care what methods or means you use, make Su Yichen agree to be your boyfriend. If you can get pregnant, it would be even better; by then, we can force him to marry you and when the child is born, we can use the child to control everything. You can be the wife of a multi-billionaire, with any kind of man you want. Even if you have a harem of three thousand, no one can say anything about you; they will only envy you!”<br/><br/>He blatantly outlined his conspiracy to his daughter, Liang Shanshan.<br/><br/>He knew his daughter very well.<br/><br/>Although she liked Su Yichen now, it was not a case of him or nothing.<br/><br/>What she wanted was money.<br/><br/>Hearing her father’s words, Liang Shanshan’s eyes lit up, and she immediately laughed, “Alright, Dad, I’ll go right away. Just wait for my good news. Su Yichen will not escape from my clutches.”<br/><br/>With that, she went into her room.<br/><br/>When she came out again, she seemed like a completely different person, with an innocent, pure, lotus-like appearance.<br/><br/>Her skin was fair, her features might not be the most delicate, but they blended together to create a gentle and beautiful look, the kind of demure beauty of a traditional girl next door. She had long, straight, black hair and wore a white dress.<br/><br/>Liang Haohan was somewhat confused and asked, “My dear, what’s with this outfit?”<br/><br/>Liang Shanshan smiled and said, “Dad, I’ve done my homework. Su Yichen likes this kind of outfit and a women with an innocent, lotus-like appearance. Since I’ve targeted Su Yichen, of course, I need to know his preferences, so I can strategize accordingly.”<br/><br/>“Good, good,” Liang Haohan laughed happily, “Hahaha, you are truly my daughter. Shanshan, your father will wait for your good news at home. In the future, the entire business world will belong to us.”<br/><br/>Liang Shanshan confidently said, “Dad, do you know how many young talents in the upper class have fallen for me? Su Yichen will be no exception.”<br/><br/>“Right, right, my daughter is the best,” Liang Haohan echoed and then added, “Shanshan, you must get pregnant with Su Yichen’s child.”\t\t\t\t\t\t</div>", "images": {}, "success": true}