{"id": 385, "url": "https://www.novelhall.com/the-lucky-star-blessing-the-whole-village-32483/15193477.html", "title": "Chapter 385 - Chapter 385: Chapter 376:", "volume": 4, "volume_title": "Volume 4", "body": "<h1>Chapter 385 - Chapter 385: Chapter 376:</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 385: Chapter 376:<br/><br/>Xiao Jinli ignored the discussions outside and looked at Su Yichen who had just jumped off Cow King and wiped the sweat from his forehead. She couldn’t help but laugh and say,<br/><br/>“Little Brother Xiao Quan, you’re overreacting. You’re just being surrounded and fussed over by a few girls who like you. Did that scare you so much that you’re covered in sweat?”<br/><br/>Before Su Yichen could respond, Xiao Jinli continued with a somewhat skeptical look,<br/><br/>“With your status, there must be countless beauties around you. Don’t you have a single one that makes your heart race? It is said that the First Beauty in the entertainment industry wants to marry you. With her looks and figure, don’t you have any thoughts about her?”<br/><br/>Hearing this, Su Yichen’s face changed slightly, and he soon showed a bitter smile, saying,<br/><br/>“Jinli, to me, no woman can compare to even a single finger of yours. So, what does it matter how beautiful those women are? It has nothing to do with me.<br/><br/>To avoid any misunderstandings, even my secretary is either a man or a married woman with a happy family. I try to maintain a distance from female bosses of partner companies as well.<br/><br/>Now, the entire Dragonzhou Country knows that I, Su Yichen, avoid women. Women have to keep a three-foot distance when talking to me.”<br/><br/>Xiao Jinli raised her eyebrows as if asking why he didn’t refuse just now.<br/><br/>As if understanding Xiao Jinli’s question, he continued to say,<br/><br/>“I was planning to confess my feelings for you just now, but I was caught off guard when those girls rushed over and quickly surrounded me.<br/><br/>I was worried about causing trouble with my identity and about you misunderstanding me, so I had to deny that I was Su Yichen. Those women were really scary, surrounding me so tightly that I had difficulty breathing. That’s why I’m so sweaty. Jinli,”<br/><br/>After calling her name, he showed a pitiful and helpless expression on his face, and said, “I was surrounded by so many women, weren’t you afraid they would tear me apart?”<br/><br/>Xiao Jinli’s mouth twitched, and she stiffly replied, “Not scared.”<br/><br/>Su Yichen continued with a pitiful and pathetic look, “Little Sister Jinli, but I’m worried. Those girls were really terrifying. I was waiting for you to pull me out, but instead, you were enjoying the show.”<br/><br/>Xiao Jinli laughed and said, “Hehe, I think the show was quite enjoyable. I’m considering whether our manor should add some romantic confession programs like this in the future.”<br/><br/>That’s right, Xiao Jinli was inspired by those people and thought that adding such a project would be fun.<br/><br/>Su Yichen’s face twitched, and he said, “So, while I was confessing my feelings to you, you were thinking about how to add projects to make money?”<br/><br/>Xiao Jinli shrugged and said, “Yeah.”<br/><br/>When she came to her senses, she saw that Su Yichen’s expression of being wronged had intensified, and she immediately shook her head violently and denied it, saying, “No, no, Little Brother Xiao Quan, you misunderstood. I just… I just think that it’s a waste not to make use of so many roses.”<br/><br/>So, in the end, she was still thinking about new projects.<br/><br/>Xiao Xiaoming and the others in the distance didn’t know what they were talking about.<br/><br/>The surrounding tourists had also been cleared by security personnel.<br/><br/>It was a joke that they didn’t react earlier, which gave those girls a chance.<br/><br/>But now they had to maintain the on-site order, oh no, maintain the innocence of Xiao Siqian, their future son-in-law.<br/><br/>The entire Xiao Family and Xiao Family Village held high hopes for Xiao Jinli and Xiao Siqian. Those security personnel also needed to follow the same general idea.<br/><br/>“Elder Brother Xiaoming, what are Brother Little Quan and Sister Jin Li really doing?”<br/><br/>“Elder Brother Xiaoming, is this what you call a confession? Just Brother Little Quan and Sister Jinli standing together and talking?”<br/><br/>Xiao Xiaoming,<br/><br/>He scratched his head, not quite understanding either, and said, “I don’t know.”<br/><br/>Although he somewhat understood the matters between men and women, he was still quite clueless.<br/><br/>He was also kept in the dark about the so-called confession between Little Brother Xiao Quan and Sister Jinli.<br/><br/>Just then, Jiang Yifan bounced over and, upon seeing Xiao Xiaoming, asked with a confused look on his face, “Elder Brother Xiaoming, what are Mommy and Uncle Xiao Quan doing?”<br/><br/>Xiao Xiaoming,<br/><br/>He didn’t know either, and he had already been asked this question by several people.<br/><br/>Not waiting for Xiao Xiaoming to answer, Jiang Yifan ran over to Su Yichen, hugged his leg, and curiously asked, “Uncle Xiao Quan, what are you and Mommy doing?”<br/><br/>Seeing Jiang Yifan, a glint appeared in Su Yichen’s eyes.<br/><br/>He bent down to pick up Jiang Yifan and asked with a smile, “Little Fanfan, what do you think of me becoming your dad? Then you’d have both a mom and a dad, wouldn’t you?”<br/><br/>Jiang Yifan nodded excitedly, clapped his little hands, and said loudly, “Great, great! After that, I’ll have both a mom and a dad. We’ll be a happy family.”<br/><br/>Then, he looked at Xiao Jinli and asked, “Mom, is Uncle Xiao Quan really going to be my dad?”<br/><br/>Upon hearing this, Xiao Jinli almost wanted to curse out loud.<br/><br/>She couldn’t tell at ordinary times, but at this critical moment, Su Yichen turned out to be so cunning, even taking advantage of the child.<br/><br/>After thinking for a moment, Xiao Jinli said, “If you want him to be your dad, let him be your dad.” After all, she wasn’t Jiang Yifan’s real mother, so whoever he wanted to be his dad could be his dad.<br/><br/>Su Yichen was immediately overjoyed, and he said excitedly, “Jinli, you agreed?”<br/><br/>Xiao Jinli asked suspiciously, “Little Brother Xiao Quan, what did I agree to?”<br/><br/>Su Yichen,<br/><br/>She had refused.<br/><br/>Suddenly, his face showed a somewhat disheartened expression, but he soon regained his confidence and said, “No matter. This time my confession failed, but I’ll try again next time. Anyway, Jinli, just don’t reject my pursuit.”<br/><br/>Just then, Old Cow King, who had been acting as the background, suddenly let out a loud “moo,” its voice resounding throughout the entire Xiao Family Village. Then, it rubbed its head against Xiao Jinli’s palm and let out another two “moos,” but these were softer, more like chatting with a person.<br/><br/>Upon seeing this, Xiao Jinli’s face changed slightly, and she gently caressed its fluffy head and sighed softly, “Alright, I know, I’ll consider it.”<br/><br/>Su Yichen curiously asked, “Jinli, what did Cow King say?”<br/><br/>Before Xiao Jinli could respond, Jiang Yifan answered for her, saying, “Grandpa Cow said that Mom has grown up and can fall in love and start a family. You’re a good man and the best choice, so let Mom consider it.”<br/><br/>Su Yichen,<br/><br/>Xiao Jinli,<br/><br/>Everyone was supporting her to be with Su Yichen, even Cow King had stepped in.<br/><br/>It seemed that she needed to give this matter some more thought.<br/><br/>People say, once bitten by a snake…<br/><br/>But when she was bitten by a snake, it was because she, a snake breeder, had been focused on raising snakes, and the snake’s nature was hard to change.\t\t\t\t\t\t</div>", "images": {}, "success": true}