{"id": 389, "url": "https://www.novelhall.com/the-lucky-star-blessing-the-whole-village-32483/15193481.html", "title": "Chapter 389 - Chapter 389: Chapter 380:", "volume": 4, "volume_title": "Volume 4", "body": "<h1>Chapter 389 - Chapter 389: Chapter 380:</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 389: Chapter 380:<br/><br/>With five or six hundred thousand applicants, it’s impossible to review them in a single day.<br/><br/>So, they allotted two days for the interviews.<br/><br/>The county town could only accommodate around one to two hundred thousand people, so those who received a notification dressed up and rushed to Xiao Family Village immediately.<br/><br/>However, before they could reach the village entrance, they were arranged in lines based on the order they arrived; men and women each had their own line.<br/><br/>Xiao Family Village had already issued a notice saying that they would temporarily not be accepting any tourists.<br/><br/>As the applicants held their resumes, they looked at the two long lines filled with confusion, “What’s going on? Why are there suddenly two lines going in and two lines coming out?”<br/><br/>Those who had already entered and exited the queue were also left clueless.<br/><br/>“We just lined up to go in and came back out without doing anything, not even an interview.”<br/><br/>“Huh, no interview?” someone asked strangely, “Then what was the point of calling us for an interview? Is this just a queue to walk in a circle and call it an interview?”<br/><br/>“It might actually be true. This is strange, I’ve never seen an interview like this before.”<br/><br/>“There’s nothing strange about it. We’re applying for roles as actors, and the company’s requirement is that we be good-looking and have good disposition. I think that as we walk through this line, most of the people who don’t meet the requirements will be eliminated.”<br/><br/>“That does make some sense. When we went in, there was a table set up at the entrance of the company, and there were a few people who looked like company employees.”<br/><br/>“See? That must have been the first round of interviews. Speaking of which, there are just too many people here.”<br/><br/>“Isn’t that the truth? The whole county is bursting at the seams, and everywhere you look there are people applying for jobs.”<br/><br/>“Ah, I don’t know if I can get this job or not. But I’m just giving it a try anyway. Even if I don’t get the job, the experience is like a tourist trip, and I get to enjoy the gourmet food of Xiao Family Village.”<br/><br/>“I know, right? Who would have thought that a public cafeteria could make such amazing food? Even a plain scallion pancake tastes better here than anywhere else.”<br/><br/>“I’ve thought about it, even if I can’t make it as an actor, I can still try to find another job here. It would be best to find one in Xiao Family Village, but if I can’t, then I’ll look in the nearby area. I don’t mind if the salary is lower, as long as I can enjoy the good food close by.”<br/><br/>“Actually, the salaries for jobs in and around Xiao Family Village aren’t low at all; they might even be higher than those in big cities. Do you have any idea how much a cleaner in Xiao Family Village earns in a month? I heard it’s 6,000 yuan, while in the most economically developed Magic City, a cleaner only makes 4,000 to 5,000 yuan.”<br/><br/>“My God, the salary for cleaners is so high, then what about the salaries for other jobs?”<br/><br/>“Of course they’re also high. My cousin, she has a distant relative who is a villager near Xiao Family Village. He got a job there as a warehouse packer, and you know how much he makes? 10,000 yuan! And do you know how much the staff who work on the amusement projects earn? It’s also over 10,000 yuan with food and accommodation included.”<br/><br/>“Oh my God, the salaries are so high. No wonder there are so many applicants for each position.”<br/><br/>“That’s right. Otherwise, the recruitment requirements wouldn’t be so strict. The pay is high and the welfare is good. Every holiday there is something given or money paid, each time no less than three thousand yuan.”<br/><br/>“Damn, the jobs here are so good, I really want to work here.”<br/><br/>“It’s just a pity that they prioritize hiring people from the village first, and only recruit from outside when there are leftover positions. I heard there are several thousand employees in such a large Xiao Family Village.”<br/><br/>At the entrance of Xiao Family Village Green Fresh Company, a table was placed in the middle with three people sitting behind it: Xiao Yucheng, Xiao Jinli, and Xiao Mingchen. The others were either sitting or standing nearby.<br/><br/>Since there were no tourists today, many staff members were idle, and so they gathered around for some excitement.<br/><br/>Two lines of candidates passed by them in an orderly fashion.<br/><br/>Xiao Yucheng whispered to Xiao Jinli, “Jinli, is this really okay?”<br/><br/>Xiao Jinli said, “Big brother, why don’t you trust me?”<br/><br/>“It’s not that I don’t trust you,” Xiao Yucheng said, “But after so many people have filed past, is there really not a single one you like?”<br/><br/>In the first round, all the applicants were screened out, which felt a bit odd.<br/><br/>Xiao Jinli said indifferently, “Better to lack than to have too many! Among the five or six hundred thousand people, we will select just ten or so candidates. This ratio is extremely small. We’ve only seen a few people so far, and you’re already anxious.”<br/><br/>Xiao Yucheng took a deep breath and said, “Alright, I understand.”<br/><br/>The applicants noticed Xiao Jinli and the men around her, and their eyes lit up, but they also whispered among themselves:<br/><br/>“Who are these people? They look like perfect examples of handsome men and beautiful women. Especially that girl, she’s breathtakingly beautiful, and she seems to be wearing no makeup.”<br/><br/>“She might be one of the actresses.”<br/><br/>“No, I heard that she’s the famous little beauty mentioned on the Internet who’s from Xiao Family Village. They say her mother is another legendary beauty.”<br/><br/>“If she is this beautiful, how gorgeous must her mother be?”<br/><br/>“I heard that her mother is extremely beautiful and works as a manager in the cafeteria.”<br/><br/>“Is that so? I have to see that for myself.”<br/><br/>Thinking they were already quite beautiful compared to TV actresses, these women couldn’t help but feel ashamed when faced with the stunning beauty of Xiao Jinli.<br/><br/>“Those men beside her seem to be high-level executives from the Lu Xian Group. The one on the left is Xiao Yucheng, the President of the Lu Xian Group, and the one on the right is the Deputy General Manager Xiao Mingchen. And the few standing there are Deputy General Managers or General Managers.”<br/><br/>“Oh my god, then what position does this girl hold in the Green Fresh Group? She’s got all the company presidents accompanying her. Oh, wait, what is she doing now? Is she interviewing us?”<br/><br/>“It seems so?”<br/><br/>“So the main interviewer for the Green Fresh Group is actually this beauty? That’s really not fair to us.”<br/><br/>If they’re judged by the standards of this interviewer, how many people could match up?<br/><br/>From the beginning, Lu Xian Group’s requirements were for beautiful women with good dispositions and handsome and dashing men.<br/><br/>So, those who thought of themselves as handsome and beautiful came to see if they could push their luck.<br/><br/>But when they faced the extraordinarily beautiful woman, they felt suffocated.<br/><br/>One by one, the handsome men and beautiful women passed by Xiao Jinli.<br/><br/>Suddenly, Xiao Jinli stood up from the table, walked up to a girl wearing a green skirt in the queue, and pointed at her, saying, “You, come out.”<br/><br/>Lu Xiangxiang looked left and right, then at Xiao Jinli, pointed to herself, and asked with some confusion, “Are you talking about me?”<br/><br/>Xiao Jinli nodded her head and said, “Yes, it’s you. Come out for now.”<br/><br/>Lu Xiangxiang looked forward and backward before stepping out of the line.\t\t\t\t\t\t</div>", "images": {}, "success": true}