{"id": 382, "url": "https://www.novelhall.com/the-lucky-star-blessing-the-whole-village-32483/15193474.html", "title": "Chapter 382 - Chapter 382: Chapter 373:", "volume": 4, "volume_title": "Volume 4", "body": "<h1>Chapter 382 - Chapter 382: Chapter 373:</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 382: Chapter 373:<br/><br/>Su Yichen was surrounded by a group of women, and Xiao Jinli was not far away at the intersection, watching the drama with her arms folded across her chest, feeling both anxious and helpless.<br/><br/>Suddenly, he shouted at the girls, “I don’t like you guys, I have a girl I like. Xiao Jinli, I like you, I like you!”<br/><br/>The latter sentence was suddenly yelled at Xiao Jinli.<br/><br/>His cry directly scared the girls who had surrounded him.<br/><br/>The last confession made everyone even more surprised.<br/><br/>So, did Su Yichen have a girl he liked?<br/><br/>“Sister Jin Li, Little Brother Xiao Quan confessed his love for you.” Xiao Xiaoming said excitedly, “Sister Jin Li, hurry up and go over.”<br/><br/>Xiao Xiaoming is now fourteen or fifteen years old and has already learned a little about love matters.<br/><br/>“Big brother Xiao Ming, what does ‘confession’ mean?” Little Niuniu beside him asked.<br/><br/>“Yeah, big brother Xiao Ming, what does ‘confession’ mean? Why do you say that Little Brother Xiao Quan confessed to Sister Jin Li?”<br/><br/>“Big brother Xiao Ming…”<br/><br/>Xiao Xiaoming raised his hand to stop them from asking further and said like an adult, “You’re still young, don’t you know what ‘confession’ means? When you grow up, you’ll know what ‘confession’ means.”<br/><br/>Niuniu and the other little cabbages, Although they were young, they weren’t completely ignorant.<br/><br/>After all, these children, having grown up eating Xiaojia Vegetables, not only had better physical fitness than others, but were also smarter.<br/><br/>“Sister Jin Li, Little Brother Xiao Quan confessed his love to you. Let’s just go over.”<br/><br/>“Yeah, hurry up. Little Brother Xiao Quan is about to be taken away by other women.”<br/><br/>Xiao Jinli, Do these little brats really know what confession means?<br/><br/>However, considering that the children loved Xiao Siqian so much, she decided to save him this time.<br/><br/>Xiao Jinli walked over, then smilingly looked at the girls and said lightly, “There’s no chance for you all, he likes me.”<br/><br/>“You’re Xiao Jinli?” The girls asked with a hint of doubt.<br/><br/>Xiao Jinli laughed and asked, “Do you have any doubts? Didn’t you just hear him call out Xiao Jinli? I am Xiao Jinli, right, Little Brother Little Quan?”<br/><br/>When the girls looked at the smiling girl, their expressions immediately become ashamed and inferior.<br/><br/>Because this girl was really too beautiful.<br/><br/>Her skin was as white as snow, her features exquisite, her face without makeup, but even more charming and lovely than girls who had applied makeup. She was like a fairy descending to earth.<br/><br/>Compared to her, they were simply ordinary, like mere mortals. Oh wait, they were indeed mere mortals.<br/><br/>“This girl is so beautiful.”<br/><br/>“This girl is even more beautiful than the most beautiful actresses on television.”<br/><br/>“Who is this girl?”<br/><br/>“Just now, someone called her Xiao Jinli, she is surnamed Xiao, could she be from Xiao Family Village?”<br/><br/>“That must be the case, she’s from Xiao Family Village. Didn’t you see? Those children around her, they’re all children of Xiao Family Village.”<br/><br/>“No, if this girl is from Xiao Family Village and she’s so beautiful, why hasn’t any talent scout come and signed her up to join the entertainment industry?”<br/><br/>“Yeah, such a beautiful girl, with just her natural beauty, would become popular across the entire entertainment industry.”<br/><br/>“Pfft, the entertainment industry? That place is like a dye vat, even the most beautiful colors will vanish without support from powerful backers. No one could stay in the limelight there.”<br/><br/>“But if this girl is from Xiao Family Village, surely she’ll have plenty of powerful capitalists to back her up. You know, there are countless wealthy and influential people who want to get into Xiao Family Village, but the conditions are so strict, and many can’t find a way in no matter what they try. However, if they were to support a girl from Xiao Family Village as a celebrity, it would be as good as having a pass to enter the village. That’s why people from Xiao Family Village are so sought-after, so how can they not become popular?”<br/><br/>“That’s strange, with all the talents in Xiao Family Village and their favorable conditions, how come none of them has entered the entertainment circle?”<br/><br/>“Yeah, that’s really strange.”<br/><br/>“I heard that there’s a rule in Xiao Family Village. No one is allowed to enter the entertainment industry. If you want to go, you must first leave Xiao Family Village.”<br/><br/>“Ha, why would they do that?”<br/><br/>“Who knows?”<br/><br/>The more people talk, the more they speculate, feeling that the Xiao Family Village is becoming more mysterious.<br/><br/>For example, why has there never been any accident within the Xiao Family Village?<br/><br/>How did Xiao Family Village, which was the poorest village in the county ten years ago, suddenly produce such amazing vegetables, establish a company, and in just a few years become a leading force in the industry?<br/><br/>And the Xiao Family Village…<br/><br/>Xiao Jinli has no intention to pay attention to these speculations and discussions. She looks at the girls with a faint smile on her face, “Sorry girls, this gentleman’s name is Xiao Siqian right now. He is from my Xiao Family Village, not the national richest person Su Yichen you are talking about!” She says that it’s “now”. Just a specific time.<br/><br/>Upon hearing that, the girls look at Su Yichen and then lower their heads to look at their cellphones, asking uncertainly, “He’s not really the national richest person Su Yichen? They seriously look so alike.”<br/><br/>“Yes, yes, they are identical.”<br/><br/>“Could they be twins? After all, there are many twins who look alike.”<br/><br/>“But we’ve never heard of Su Yichen having a twin brother, have we?”<br/><br/>“Humph, whether he has brothers or not, how would we ordinary people know?”<br/><br/>Seeing the opportunity, Su Yichen quickly took Xiao Jinli’s hand and said, “That’s right, my name is Xiao Siqian now, and this girl is the one I like.”<br/><br/>He shook the hand they held together and continued, “I have no brothers. All my family members are in Xiao Family Village. So, ladies, just leave.”<br/><br/>Even though the girls were still doubtful, they couldn’t understand how there could be two people in this world who looked so similar without any blood relation. Still, if he wasn’t Su Yichen, there was no need to keep bothering him.<br/><br/>After all, they liked Su Yichen’s appearance, but they liked his money even more. If he wasn’t Su Yichen, there was no need to keep holding on.<br/><br/>Besides, the girl he confessed to was so pretty. They couldn’t compare to her.<br/><br/>Soon, the girls surrounding Su Yichen dispersed.<br/><br/>But the tourists nearby didn’t leave.<br/><br/>Many tourists thought it was a new event launched in the manor, a romantic love confession between a man and a woman.<br/><br/>After all, the man was handsome, and the girl was beautiful. Confessing their love amidst the beautiful garden filled with red roses was both eye-catching and pleasing to the heart.<br/><br/>“When did Xiao Family Village launch this new event?”<br/><br/>“No, this isn’t an event. This is a real confession scene.”<br/><br/>“What, really? Gosh, I thought it was a new event. After all, seeing such a handsome man and beautiful woman is really enjoyable to watch.”<br/><br/>“Haha, isn’t it? I heard that they are both from Xiao Family Village. They should be childhood sweethearts, and now they are officially confessing their love.”<br/><br/>“Childhood sweethearts, huh? That’s really pure and romantic. Back in the day, my wife and I were also childhood sweethearts…”\t\t\t\t\t\t</div>", "images": {}, "success": true}