{"id": 387, "url": "https://www.novelhall.com/the-lucky-star-blessing-the-whole-village-32483/15193479.html", "title": "Chapter 387 - Chapter 387: Chapter 378:", "volume": 4, "volume_title": "Volume 4", "body": "<h1>Chapter 387 - Chapter 387: Chapter 378:</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 387: Chapter 378:<br/><br/>Word of Xiao Family Village’s actor recruitment spread quickly, garnering attention from across the country.<br/><br/>Most<br/><br/>people know that while this acting job wouldn’t get them into the entertainment industry like appearing on television or in movies, it could potentially make them famous.<br/><br/>Besides, working in Xiao Family Village is a dream job for many.<br/><br/>Not only is the salary and benefits good, but they can also enjoy endless gourmet food there.<br/><br/>Many people want to apply for the actor position just to try the delicious food in Xiao Family Village.<br/><br/>As a result, handsome men and beautiful women from all over the country flooded into Xiao Family Village. The daily traffic was several thousand times higher, forcing the village to impose restrictions.<br/><br/>As the head of the marketing department, Xiao Mingchen was a bit overwhelmed by the influx of male and female applicants from all over the country.<br/><br/>He had only tried looking for people outside the entertainment industry by posting recruitment information online. He never expected so many people to come.<br/><br/>Xiao Mingchen’s subordinates, seeing the boss’s difficult expression, cautiously asked, “Boss, with so many people, how do we screen them out?”<br/><br/>They had expected at most, 5 or 6 thousand people would come. Turns out, it was in more than 5 or 6 hundred thousand people.<br/><br/>Why did so many people come just for two new actor positions?<br/><br/>Xiao Mingchen thought for a moment and said, “First, divide them into three groups. The first group will be screened based on appearance. We need male and female actors with good looks and charisma. The second group will be tested for character, and the third group will be tested for acting skills. We don’t care about their background or education when recruiting actors. As long as they meet our requirements, we will contact them first. Divide each group into ten small teams and arrange the people.”<br/><br/>Although they were ordinary actors, the final decision would still have to be approved by Xiao Jinli.<br/><br/>It was because these actors would be exposed to the public, and their image would have a significant impact on the image of Xiao Family Village.<br/><br/>Su Yichen and Xiao Jinli stood on the top floor of the Xiao Family Village Hotel, looking down at the surging crowd below.<br/><br/>Su Yichen couldn’t help but say, “Jinli, your command has made the entire Xiao Family Village quite lively. Even though there are many people here usually, and even more during holidays, the crowd now seems like it’s holiday levels.”<br/><br/>Xiao Jinli hooked her lips and said, “These two actors represent the image of my Xiao Family Village. Of course, we must pay close attention!”<br/><br/>Su Yichen raised an eyebrow and smiled, “Why not choose from within Xiao Family Village?”<br/><br/>Xiao Jinli said, “Those who are interested in Xiao Family Village can come and apply to me first. I must evaluate them before I can know if they are suitable or not.”<br/><br/>Su Yichen chuckled, “Jinli, I feel like you’re effortlessly good at everything. Sometimes I wonder if you’re not human at all, but a fairy. We mere mortals can only look up to you.”<br/><br/>Perhaps the only person in the world who knew about Xiao Jinli’s strength and abilities was Su Yichen.<br/><br/>That’s why he constantly tried to become stronger and match Xiao Jinli as much as possible.<br/><br/>Unless Xiao Jinli didn’t want to get married, if she wanted to get married, he would try to become the best man for her.<br/><br/>With that thought, Su Yichen suddenly asked, “Jinli, how are you considering our situation?”<br/><br/>Xiao Jinli,  remained silent.<br/><br/>Su Yichen sighed a little and said, “Never mind, take your time to think it over.”<br/><br/>At that moment, there was a knock on the office door.<br/><br/>“Come in!” said Xiao Jinli.<br/><br/>Xiao Yucheng stepped in.<br/><br/>Seeing Su Yichen there, his eyes gleamed with gossip. He raised an eyebrow and smiled, “Little Quan, you’re here.”<br/><br/>Su Yichen smiled and said, “Brother Yu.”<br/><br/>Xiao Yucheng grinned, “You know you’re famous now, right? Even though you denied that you were Dragon State’s richest, many people still believe you’re Su Yichen. Many reporters from the news media have come to Xiao Family Village. Although we’re not afraid of these journalists, your identity will eventually be revealed.”<br/><br/>After a moment of silence, Su Yichen seriously said, “Brother Yu, I understand. Don’t worry, I will handle it well and definitely won’t cause any trouble for Xiao Family Village.”<br/><br/>Xiao Yucheng waved dismissively, “Actually, we’re not afraid of these troubles either, right Little Jinli?”<br/><br/>Xiao Jinli nodded and said, “Right. If you don’t want to expose yourself, it won’t matter how many journalists there are; it won’t work.”<br/><br/>Xiao Yucheng,  It was clear that his words were meant to tell Su Yichen not to deny his identity and use his real identity to confess his feelings to the reporters.<br/><br/>It would be best if the whole country knew that Dragon State’s richest, Su Yichen, only loved Xiao Jinli.<br/><br/>However, he also realized something.<br/><br/>His seemingly all-capable cousin was incredibly dense when it came to love affairs. No wonder when it came to Xiao Siqian’s confession, she seemed unimpressed.<br/><br/>Su Yichen was the same; even though he appeared bold, he seemed cautious.<br/><br/>Xiao Yucheng rubbed his forehead and said to Xiao Jinli, “Sister, I think Little Quan is not bad. He has good looks, money, and power. He’s just barely good enough for you. Just consider him, will you?”<br/><br/>Xiao Jinli,<br/><br/>Another advocate.<br/><br/>It seemed she really had to consider Su Yichen now.<br/><br/>Xiao Jinli said, “Big brother, what did you want us for?”<br/><br/>Returning to business, Xiao Yucheng immediately became serious. He handed the file in his hand to her and said, “Take a look at the planning scheme for this confession project.”<br/><br/>Xiao Jinli took a look and said, “It’s not bad. Have you found any actors yet?”<br/><br/>“The preparations are in full swing, and we should have results by the day after tomorrow at the latest,” reported Xiao Yucheng. “However, the situation with the applicants is quite unexpected. We thought that only a few thousand people would come at most, but there are hundreds of thousands. We need time to screen the actors from these 5 or 6 hundred thousand people.”<br/><br/>Xiao Jinli thought for a moment and said, “Here’s what we’ll do. Have ​​the applicants line up and I’ll go over.”<br/><br/>Xiao Yucheng’s eyes lit up, and he said happily, “Okay, I’ll arrange it right away. With Sister Jinli’s help, we’ll complete the screening in no time, even if it’s 5 or 6 million people.”<br/><br/>“Big brother, don’t praise me too much,” Xiao Jinli smiled and said, “Even without me, you guys would do it quickly.”<br/><br/>“Alright, I won’t chat with you guys anymore. I’m going to arrange the work,” said Xiao Yucheng, still smiling. Before leaving the room and closing the door, he raised his fist at Su Yichen and encouraged him, “Little Quan, keep it up! I’m looking forward to you becoming my brother-in-law!”<br/><br/>Xiao Jinli,<br/><br/>Was she so desperate to get married? Everyone kept trying to pair her with Su Yichen.<br/><br/>Su Yichen leaned his fist against his lips and smiled, “Little Sister Jinli, it seems your family really likes me. It’s just up to you now.”<br/><br/>Xiao Jinli said irritably, “They’ve always treated you like family.”\t\t\t\t\t\t</div>", "images": {}, "success": true}