{"id": 381, "url": "https://www.novelhall.com/the-lucky-star-blessing-the-whole-village-32483/15193473.html", "title": "Chapter 381 - Chapter 381: Chapter 372:", "volume": 4, "volume_title": "Volume 4", "body": "<h1>Chapter 381 - Chapter 381: Chapter 372:</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 381: Chapter 372:<br/><br/>From that day on, Xiao Jinli fell into a state of annoyance.<br/><br/>Whenever she went out, people would ask her, “Jinli, where is Little Quan? Isn’t he with you today?”<br/><br/>“Jinli, how come we didn’t see Little Quan? Where did Little Quan go?”<br/><br/>“Jinli…”<br/><br/>Xiao Jinli,<br/><br/>Everyone was asking about Su Yichen’s whereabouts.<br/><br/>They weren’t conjoined twins.<br/><br/>How would she know where he went?<br/><br/>At this moment, Xiao Xiaoming ran over, panting, and shouted loudly, “Sister Jin Li, hurry, come with me.”<br/><br/>Xiao Jinli asked curiously, “Where to?”<br/><br/>“Don’t ask, just follow us.”<br/><br/>Then, a group of children pulled and pushed Xiao Jinli forward.<br/><br/>Some adults were also puzzled as they watched the children lead Xiao Jinli away.<br/><br/>Xiao Jinli asked somewhat helplessly, “Where on earth are you taking me?”<br/><br/>Xiao Xiaoming mysteriously smiled and said, “You’ll know when we get there. Hurry up, we’re almost there.”<br/><br/>After a while, they arrived at a shaded path lined with rose bushes and balloons hanging from them.<br/><br/>Xiao Jinli asked curiously, “When did this place get so many roses planted? And so many balloons hung?”<br/><br/>Xiao Xiaoming’s eyes darted and said, “Sister Jinli, you’ll know when you go over there, won’t you?”<br/><br/>Xiao Jinli suspiciously said, “Could it be Little Brother Xiao Quan?”<br/><br/>Xiao Xiaoming spoke a little guiltily, “You’ll know who it is when you get there.”<br/><br/>Sister Jinli is just too smart, guessing right away.<br/><br/>But, Sister Jinli is originally the smartest person in the village.<br/><br/>Xiao Jinli,A guilty conscience needs no accuser.<br/><br/>Forget it, let’s see what Su Yichen is up to.<br/><br/>Hmmm, Xiao Jinli has all kinds of cells, just not romantic ones.<br/><br/>Wouldn’t most women think of romance at first sight when they see so many roses and balloons?<br/><br/>But she didn’t think in that direction.<br/><br/>Surrounded by the children, Xiao Jinli arrived at the destination.<br/><br/>Before Xiao Jinli could even react, the children shouted first.<br/><br/>“Wow, it’s so beautiful.”<br/><br/>“Little Brother Xiao Quan is so handsome.”<br/><br/>“Little Brother Xiao Quan looks so cool sitting on Cow King’s back.”<br/><br/>At the same time, many tourists gathered around and kept taking photos with their cameras and cellphones.<br/><br/>“Is someone confessing their love? This is so romantic!”<br/><br/>“Bright red roses, and the most expensive Juliet ones, each one being three to five hundred. To plant them all over an entire field, who is this big shot? That’s so much money.”<br/><br/>“It must be a rich person. So many roses, at least tens of thousands of them, that’s three to five million for sure. It’s so frustrating to compare with others. Some people spend hundreds of thousands just to confess their love, while my entire net worth is less than a hundred thousand.”<br/><br/>“No, is it just me who’s focused on that cow? Why does he have to ride a cow to confess his love?”<br/><br/>“Don’t you know? This is the famous Cow King of Xiao Family Village! I heard that this Cow King is nearly twenty years old. It’s very smart, with the intelligence of a child in their teens.”<br/><br/>“Yeah, I’ve heard that this Cow King is a treasure of Xiao Family Village, and it has accomplished many glorious deeds. It is said that it rescued a group of cows stolen by a cattle trafficker, saved a child from a flood, and even commanded the entire village’s cows. But, I also heard that it only allows its owner to ride it. Could this man be the owner?”<br/><br/>“Did any of you notice that the man riding the cow looks familiar?”<br/><br/>“Ah, you didn’t mention it, but now that you say it, I really think this man looks very familiar.”<br/><br/>Then, someone flips through their cellphone, and suddenly someone exclaims, “Oh, I know! He… he’s Su Yichen, the richest man in Dragonzhou Country!”<br/><br/>This is so thrilling.<br/><br/>“What? It’s Su Yichen?”<br/><br/>Then, a group of people start to flip through their cellphones.<br/><br/>“Oh my god, he really is Su Yichen.”<br/><br/>“Ah, it’s Su Yichen.”<br/><br/>“Why is Su Yichen here? It seems like he’s confessing his love to a girl.”<br/><br/>“Ah, Su Yichen, the richest person in the country. No wonder he spends several million on a confession.”<br/><br/>“Ahh, rich people can be so romantic. If a man confessed to me with a whole field of roses, even if they were just ordinary roses and not Juliets, I would be moved.”<br/><br/>Beyond the money spent, there’s also thoughtfulness and romance.<br/><br/>“Wait, who is Su Yichen confessing his love to? He chose to confess in Xiao Family Village? This place is a Feng Shui treasure land, so he should be able to succeed.”<br/><br/>“Hehe, he must be able to succeed. Just think, who is Su Yichen? He’s rich, powerful, young, and handsome, with a physique that outmatches even fashion models. What woman wouldn’t like such a man? Unless she’s blind?”<br/><br/>Xiao Jinli, with her exceptionally sharp ears,<br/><br/>But she couldn’t pretend to be blind even if she wanted to.<br/><br/>“Sister Jinli, we’re here.”<br/><br/>Xiao Jinli was led by a few children to the entrance of the flower field.<br/><br/>Xiao Xiaoming laughed with his hand over his mouth, “Sister Jinli, Brother Little Quan is waiting for you inside, good luck!”<br/><br/>Xiao Jinli,” What “good luck” should she have? Su Yichen should be the one to have good luck.<br/><br/>Just as Xiao Jinli was about to enter, a girl suddenly rushed in and shouted, “Su Yichen, I like you.”<br/><br/>When there’s one, there’s another, and another…<br/><br/>Then, Su Yichen hadn’t even confessed his love yet but was already confessed to by a group of girls.<br/><br/>Xiao Jinli,<br/><br/>Standing with her arms folded, she watched the chaotic scene where Su Yichen was surrounded by a group of girls.”<br/><br/>Xiao Xiaoming saw this and became anxious, saying, “Sister Jinli, hurry up and go over there. If you don’t go now, Brother Little Quan will be taken away by other girls.”<br/><br/>Xiao Jinli said indifferently, “Why are you in such a hurry? If your Brother Little Quan is so easily snatched away by others, then I should be lucky. Anything that can be taken away is garbage.”<br/><br/>Upon hearing this, Xiao Xiaoming thought for a moment and said, “Sister Jinli, you’re right.”<br/><br/>Meanwhile, Su Yichen never thought that he would encounter such trouble while confessing his love to Xiao Jinli in the fields with his true appearance.<br/><br/>He rejected the girls coldly, saying, “I’m not Su Yichen, I’m called Xiao Siqian. You all made a mistake. I just look like Su Yichen. Also, I’m about to confess my love to a girl I like. Please leave, or don’t blame me for being rude.”<br/><br/>But to these girls, this could be a once-in-a-lifetime opportunity, so how could they give up so easily?<br/><br/>“No, you are Su Yichen. Su Yichen, I like you. Every time you appear on the news or in financial magazines, I follow closely. I know you well. I like you; can I be your girlfriend?”<br/><br/>“Yes, you are Su Yichen. There’s no such thing as two completely identical people in this world. Even identical twins are not exactly the same, but aren’t you an only child? Su Yichen, I like you; accept me.”\t\t\t\t\t\t</div>", "images": {}, "success": true}