{"id": 380, "url": "https://www.novelhall.com/the-lucky-star-blessing-the-whole-village-32483/15193472.html", "title": "Chapter 380 - Chapter 380: Chapter 371:", "volume": 4, "volume_title": "Volume 4", "body": "<h1>Chapter 380 - Chapter 380: Chapter 371:</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 380: Chapter 371:<br/><br/>Ever since Su Yichen and Xiao Jinli’s inseparability had been pointed out, Xiao Jinli felt a slight awkwardness when interacting with Su Yichen.<br/><br/>Since they had met, they had indeed spent all their available time together.<br/><br/>Xiao Jinli rubbed her forehead, thinking that it was mainly due to their initial acquaintance with Xiao Siqian, perhaps it was a nestling complex.<br/><br/>From the moment she saved Su Yichen, he had become unusually attached to her due to his nestling complex.<br/><br/>However, from the beginning, they had always interacted as siblings, right?<br/><br/>Xiao Jinli muttered to herself, “From now on, how do I interact with Brother Little Quan?”<br/><br/>At this moment, Su Yichen entered the room, hearing Xiao Jinli’s words, and his expression stiffened for a moment.<br/><br/>Then, he took a deep breath, walked over, and grabbed Xiao Jinli’s hand, looking serious as he said, “Jinli, I … actually, I … I like you. I want… I want to be in a relationship with you. Are you willing?”<br/><br/>As the emperor of the business world, who was decisive and cold-hearted, he was incredibly nervous during the confession, his heartbeat rising, filled with fear and panic.<br/><br/>He was truly afraid of Xiao Jinli’s rejection.<br/><br/>However, he managed to gather his courage.<br/><br/>Even if she rejects him, so what?<br/><br/>After the rejection, he can pursue Xiao Jinli as an ordinary man, rather than maintaining a sibling relationship with her.<br/><br/>Xiao Jinli was taken aback by Su Yichen’s sudden confession.<br/><br/>She didn’t know that Su Yichen had feelings for her, and she had always thought that Su Yichen regarded her as his sister as well.<br/><br/>Staring with wide eyes in disbelief, she looked at Su Yichen and said, “Brother Little Quan, you?”<br/><br/>Su Yichen took another deep breath and bravely confessed, “When you were little, I really saw you as my sister and never had any other intentions. However, as you grew older and we spent more time together, my heart couldn’t help but sink. But during this sinking, I had to suppress my racing heart and try to maintain our usual interaction.<br/><br/>When you were young, I could hold your hand without any reservations, running as we pleased through the fields and mountains, and releasing our happiness with abandon.<br/><br/>But I don’t know when it changed; I didn’t dare to touch you casually, didn’t dare to look into your clear eyes, didn’t dare to hold your hand, and even more so, didn’t dare to hug you.<br/><br/>I was afraid that my true thoughts would be revealed, and then we wouldn’t even be able to maintain our sibling relationship, let alone become lovers. So, I tried hard to restrain myself. But now, I don’t want to restrain myself any longer; I want to confess to you. I like you, no, I love you, and I want to spend the rest of my life with you, growing old together.”<br/><br/>Xiao Jinli’s pupils contracted involuntarily. No matter how mature and steady she seemed in the eyes of others, at this moment, her expression was a little flustered.<br/><br/>Xiao Jinli couldn’t help but call out, “Brother Little Quan?”<br/><br/>Before Xiao Jinli could speak, Su Yichen gently covered her mouth, looking very nervous as he said, “Little Sister Jinli, if you reject me, please don’t refuse to continue interacting with me as siblings, okay? Oh, no, if you reject me, I will pursue you as a man, but please don’t refuse my pursuit in the future, okay?”<br/><br/>Xiao Jinli opened her mouth, not knowing how to respond.<br/><br/>If it weren’t for this sudden turn of events, she might have forgotten that she was a time-traveler.<br/><br/>She was not a real teenage girl.<br/><br/>When she first arrived, she swore never to fall in love again, focusing on protecting the Xiao family and Xiao Family Village instead.<br/><br/>When she was younger, her family had never considered her personal affairs.<br/><br/>But now, she was almost twenty years old.<br/><br/>Others might be of the age to go to college and fall in love, but she was already a powerful figure, and attending college was merely a formality.<br/><br/>She had never considered falling in love throughout her life.<br/><br/>Xiao Jinli thought for a moment and said, “Brother Little Quan, don’t be in a hurry, this is too sudden. Let me think about it, okay?”<br/><br/>Hearing this, a delighted expression appeared on Su Yichen’s face, and he nodded, “Alright, you take your time to think about it.”<br/><br/>At this point, Su Yichen thought of something and said, “Little Sister Jinli, if you’re worried about me betraying you, I can transfer all of my property under your name. If I truly betray you, I will leave with nothing. Besides,” his eyes seemed to imply something, “can I really betray you?”<br/><br/>In this world, only Su Yichen knew the extent of Xiao Jinli’s power.<br/><br/>He understood very well the consequences of betraying Xiao Jinli; not only would he be ruined, but he could also be completely wiped out, like those four kidnappers who were unknowingly fed to the tigers.<br/><br/>Xiao Jinli’s expression changed slightly as she heard this, but she still said, “Alright, let me think about it.”<br/><br/>She knew that in this world, no one could betray her and get away with it.<br/><br/>But she just didn’t want any trouble.<br/><br/>She would prefer a one-time solution.<br/><br/>What she had the least faith in was love.<br/><br/>Xiao Jinli didn’t flatly refuse, but promised to think about it. This gave Su Yichen his biggest surprise yet.<br/><br/>In the following days, he wanted to win Xiao Jinli’s heart step by step.<br/><br/>They already had a solid foundation in their feelings, and as long as Xiao Jinli wasn’t made of stone, he would be able to win her over.<br/><br/>Su Yichen nodded and said, “Alright, take your time.”<br/><br/>With that, Su Yichen left the room.<br/><br/>But as soon as he opened the door, he saw a group of elders gathered outside.<br/><br/>Xiao Jinli walked over and asked, “Grandpa, Grandma, and all of you, what’s the matter? Why are you standing outside my door?”<br/><br/>Grandma Xiao happily said, “Well, we were worried that you might hit this kid Little Quan, so we’re here to keep an eye on things and break up any fights.”<br/><br/>Xiao Jinli,<br/><br/>Su Yichen,<br/><br/>These old ladies and old men just wanted to enjoy the drama, but they ended up involving themselves.<br/><br/>Xiao Jinli forced a smile and asked, “Do I look like such a violent person?”<br/><br/>“No, no…” The old men and old ladies unanimously shook their heads.<br/><br/>At this point, her maternal grandmother spoke earnestly, “Our good baby, we all think that you’ve grown up into a young lady. In the past, we’ve always wondered which boy would be a good match for a girl like you who is both intelligent and capable, beautiful and competent.<br/><br/>We have always been picky, thinking that no one was good enough, until we saw Little Quan and our eyes lit up.<br/><br/>Little Quan, well, we all know him inside and out. Not only is he handsome, but he also has enormous wealth. If you marry him, you can squander it as you please. The most important thing is that Little Quan has a great character, and will love and cherish you, looking at you with shining eyes. If you fall in love with him, we will all be at ease.”<br/><br/>Xiao Jinli took a deep breath, her expression slightly complicated as she asked, “Grandma, how old am I for you to be matchmaking me? I’m only nineteen, not twenty-nine or thirty-nine, an old maid that can’t be married off. Why are you so worried?”<br/><br/>Her maternal grandmother smiled awkwardly and said, “Good men should be pursued early. Once you turned eighteen, we let you start dating.”<br/><br/>Xiao Jinli,\t\t\t\t\t\t</div>", "images": {}, "success": true}