{"id": 390, "url": "https://www.novelhall.com/the-lucky-star-blessing-the-whole-village-32483/15193482.html", "title": "Chapter 390 - Chapter 390: Chapter 381:", "volume": 4, "volume_title": "Volume 4", "body": "<h1>Chapter 390 - Chapter 390: Chapter 381:</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 390: Chapter 381:<br/><br/>As soon as Lu Xiangxiang was singled out, it caused an uproar.<br/><br/>Someone couldn’t help but ask loudly, “What does this mean? Did she pass the interview? Or was she selected directly?”<br/><br/>The person they were asking, of course, was Xiao Jinli.<br/><br/>Xiao Jinli nodded and said, “Yes, she is selected.”<br/><br/>Xiao Jinli’s confirmation stirred discontent among everyone.<br/><br/>“Why should she pass? This woman, she’s neither attractive nor has a good figure, why was she chosen? We can’t accept this!”<br/><br/>The ones shouting their discontent were those who had been previously interviewed.<br/><br/>There were tens of thousands of people who had queued up for the interview, but none of them passed.<br/><br/>Yet this woman, with a casual gesture, was deemed successful in her interview.<br/><br/>Looking at the woman who was picked out, her looks were not particularly stunning. Compared to the many girls who were far more beautiful than her, she could only be considered pretty.<br/><br/>Moreover, her body, is she 165cm tall? How did such a petite figure pass the selection?<br/><br/>Therefore, those who failed the interview, of course, could not accept this.<br/><br/>Upon hearing their questions, Xiao Jinli straightened her lips, smiled, and then casually asked, “Do you disagree?”.<br/><br/>“Yes, we do. This woman can’t even compare to us, why could she be selected?”<br/><br/>Xiao Jinli’s cold snort silenced them, “Then swallow your discontent.”<br/><br/>She didn’t own them any explanations.<br/><br/>Xiao Yucheng and everyone else,<br/><br/>Jinli, wouldn’t this offend people too much?<br/><br/>You should at least provide a convincing reason.<br/><br/>But all she said was, “Swallow your disbelief!”<br/><br/>Those who asked questions had faces that were alternately turning blue and white.<br/><br/>They were very angry and said, “What kind of company is this? What kind of interview is this? This is too outrageous. I quit the interview. Forget about becoming an actor in your company.”<br/><br/>Xiao Jinli simply responded, “You weren’t chosen by the company anyway. Even if you wanted to join, we wouldn’t have you.”<br/><br/>Everyone,  This hit them hard.<br/><br/>They had come all the way here, naturally attracted by the company’s reputation and the acting job, but now…<br/><br/>“Hey, what kind of language is that?” Someone was very angry, “Is it a mistake for us to come for the job interview? President Xiao, who is this woman and what qualifications does she have for the interview? Is it just because she is pretty?”<br/><br/>The one asking the question was a girl. She was fashionably dressed, tall, and quite beautiful. She was a major internet celebrity often called Little Zhou Bingbing.<br/><br/>Yes, Zhou Bingbing was the acclaimed First Beauty among celebrities.<br/><br/>Therefore, Little Zhou Bingbing believed that with her qualifications, she could easily land a job as an extra in any film.<br/><br/>Of course, as a major internet celebrity, her aim was not actually to become an actress but to document the interview process and upload it online, especially as she was confident that she would be selected.<br/><br/>According to her plan, she would definitely be selected. Then, she would find an excuse to decline the company’s offer. This way, she believed she would gain a lot of attention online.<br/><br/>“Oh my God, isn’t she the famous internet celebrity, Little Zhou Bingbing?” Someone quickly recognized Zhou Xiaohong.<br/><br/>“Ah, so it is Zhou Bingbing. So, she also came to apply to be an actress.”<br/><br/>“Isn’t she already a big internet celebrity? I heard her monthly income is hundreds of thousands, even millions. Could she really be interested in this salary job as an actor?”<br/><br/>“Look at her group. She must have already passed. If she did pass, it means she failed the interview. But she is more dissatisfied because a woman who doesn’t even compare to her was chosen.”<br/><br/>“Isn’t she already a successful internet celebrity? Why is she here to vie with others for jobs? Even if she got the job, would she still be an internet celebrity?” Some people showed disdain and complaint.<br/><br/>“You don’t understand. Being an internet celebrity pays much more than this smallly paid actor’s job. According to my guess, she does not want to be an actor, but she also does not want to miss the opportunity to get in with the Lu Xian Group. Just imagine, she is a big internet celebrity, if she has the opportunity to be endorsed by the Lu Xian Group, doing live-selling on her broadcasts, the money she will make, would probably surpass what she makes at any given time.”<br/><br/>“Are you joking? Do the products of the Lu Xian Group need live selling to be sold?”<br/><br/>“Haha, you’re right. The Lu Xian Group never advertises or promotes, and their products are always in short supply. There’s no need for live-selling.”<br/><br/>“However, live-selling aside, this Zhou Xiaohong is likely taking this opportunity to climb up the Lu Xian Group. Even if she doesn’t want to be an actress, having the backing of the Lu Xian Group will certainly aid her success as an Internet celebrity.”<br/><br/>“Is she thinking too much? Just because she’s auditioning for a role, she’s already thinking about getting into the Lu Xian Group? Is the Lu Xian Group so easily accessible? Doesn’t she know how many either rich or noble people have failed to get in? All she is really just a small internet celebrity.”<br/><br/>“She may be an internet celebrity. But she is a beautiful internet celebrity, known as Little Zhou Bingbing. Don’t you know that a woman’s beauty is an asset?”<br/><br/>“Hehe, there are plenty of women out there more beautiful and attractive than her. Just because she is known as Little Zhou Bingbing, does it mean she really is the First Beauty in the world? Is she dreaming too much?”<br/><br/>These people didn’t hesitate to ridicule Little Zhou Bingbing.<br/><br/>Upon hearing these discussions, her face turned from green to black, back and forth. Then, she yelled, “Shut up, you all shut up! What I do is none of your damn business, you shouldn’t be sticking your noses into it.”<br/><br/>The queue was halted due to Zhou Xiaohong’s outcry and protest.<br/><br/>Xiao Jinli slightly frowned, she pointed to Zhou Xiaohong and casually said, “You, come here! The rest, keep going!”<br/><br/>Zhou Xiaohong, who was initially furious, straightened herself up like a proud peacock upon hearing Xiao Jinli’s words. She quickly tidied her slightly messy hair and adjusted the clothing on her body. With an expression of contempt, she sneered at those whispering about her and the others in the queue, “Humph!”<br/><br/>She thought she was singled out because she was selected.<br/><br/>Everyone else also thought the same.<br/><br/>Then, Xiao Jinli clapped her hands and two security guards immediately came over. They were very respectful and called out, “Miss Xiao!”<br/><br/>The attitude of the security guards, and the executives of Lu Xian Group indicated that the status of this Miss Xiao in the Lu Xian Group was very high.<br/><br/>Xiao Jinli lightly nodded her head and then pointed her chin indicating, “Please see her out.”<br/><br/>“Yes, Miss Xiao!”<br/><br/>This completely stunned Zhou Xiaohong and the people in the queue.<br/><br/>Then a wave of laughter broke out.\t\t\t\t\t\t</div>", "images": {}, "success": true}