{"id": 394, "url": "https://www.novelhall.com/the-lucky-star-blessing-the-whole-village-32483/15193486.html", "title": "Chapter 394 - Chapter 394: Chapter 385:", "volume": 4, "volume_title": "Volume 4", "body": "<h1>Chapter 394 - Chapter 394: Chapter 385:</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 394: Chapter 385:<br/><br/>Fang Jingjing and the others never expected that the young and extremely beautiful girl standing before them would actually be the chairman of the Lu Xian Group.<br/><br/>“Oh my god, you’re the chairman?” Fang Jingjing asked incredulously, “It’s rare to see such a young chairman. May I ask how old are you?”<br/><br/>“I’m nineteen,” Xiao Jinli responded without hesitation.<br/><br/>“Haha, nineteen?! That’s unbelievable!” Fang Jingjing couldn’t believe it, “I knew about the presidents and vice presidents of Lu Xian Group, and other executives, but the introduction of the chairman has always been extremely mysterious. I never thought, haha, now I know why the chairman of Lu Xian Group is so mysterious; it’s because he’s so young. No wonder all the presidents and other executives have been accompanying you today during the interview.”<br/><br/>As she spoke, Fang Jingjing seemed to think of something and asked, “Chairman, I want to ask, why did you choose us?”<br/><br/>Among the four of them, she noticed that Lu Xiangxiang was definitely not graceful or beautiful. The other two men were also far from handsome or stylish; they could only be described as tough guys with sharp features, every one of them former soldiers.<br/><br/>As for herself, she might have been chosen for her beauty, but there were many more beautiful people in the hundreds of thousands of people. She dared not claim herself to be the most beautiful woman.<br/><br/>So, she was genuinely curious about the reason they were chosen, and her personality made her ask.<br/><br/>Xiao Jinli smiled and said mysteriously, “You’ll find out later. But you’ve all been chosen by me for your extraordinary qualities. In fact, I’m selecting you not only as actors, but also as talents to be cultivated by our company. Trust me, you are all individuals with immense potential, just waiting to be tapped, and I am here to help you unlock it.”<br/><br/>With Xiao Jinli saying so, the four of them became completely puzzled.<br/><br/>They are the company’s reserve talents, and they have potential?<br/><br/>But even they didn’t know what kind of potential they had.<br/><br/>Xiao Jinli took a look at them and said, “Lu Xiangxiang, digital memory; Tang Renjie, maze strategy; Ren Feiyang, sharp vision; and you, Fang Jingjing, have good eloquence.”<br/><br/>“Huh?” The four of them didn’t expect that they would be chosen for these abilities.<br/><br/>“You are outstanding in these fields,” Xiao Jinli didn’t hide it, “Just stay true to yourselves, and I can make you famous all over the world.”<br/><br/>Upon hearing what Xiao Jinli said, the four of them suddenly became more serious.<br/><br/>They said excitedly, “Is it true? Can we… we really become famous all over the world?”<br/><br/>What does it mean to be globally famous?<br/><br/>It means that they will have great achievements in the future.<br/><br/>They will have great success in their careers.<br/><br/>Xiao Jinli nodded and said, “As long as you believe in me, and stay true to yourself, it is definitely possible.”<br/><br/>Although Xiao Jinli is young, she is the chairman of the Lu Xian group and has created such a large industry. How could she convince people just by talking a lot?<br/><br/>But she has the strength and the courage to convince people.<br/><br/>Among them, Lu Xiangxiang was the most excited. She asked with a lack of self-confidence, “Chairman, can… can I really do it?”<br/><br/>Xiao Jinli patted her shoulder, encouraging her with a smile, “Lu Xiangxiang, you should believe in yourself. Look at the numerous awards you’ve won since childhood. Do you still need to doubt yourself? By doubting yourself, you’ll be letting down all your past efforts and struggles. So, just keep going!”\t\t\t\t\t\t</div>", "images": {}, "success": true}