{"id": 398, "url": "https://www.novelhall.com/the-lucky-star-blessing-the-whole-village-32483/15193490.html", "title": "Chapter 398 - Chapter 398: Chapter 389:", "volume": 4, "volume_title": "Volume 4", "body": "<h1>Chapter 398 - Chapter 398: Chapter 389:</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 398: Chapter 389:<br/><br/>Xiao’s mother’s gourmet food, with the last portion left, twelve chive dumplings, was snatched by Fang Jingjing and Lu Xiangxiang.<br/><br/>When the two of them ate the first dumpling, they couldn’t help but exclaim, “This is so delicious.”<br/><br/>This kind of deliciousness is simply beyond description with any adjective, it can only be said that such dumplings should only exist in heaven.<br/><br/>Before, the two of them, who had appetites as small as kittens, ate six dumplings each and tasted other delicacies as well.<br/><br/>With every bite, they would say, “This is so delicious!”<br/><br/>Fang Jingjing made up her mind and said, “With such delicious food, I will have to work hard for my three meals a day from now on.”<br/><br/>Lu Xiangxiang nodded in agreement, “Yes, yes.”<br/><br/>But both of them completely forgot about keeping their figures.<br/><br/>Just as Lu Xiangxiang and Fang Jingjing were enjoying various gourmet delights, Chen Hao and Ren Yingying, both carrying suitcases and looking embarrassed, appeared before Lu Xiangxiang.<br/><br/>Seeing that Lu Xiangxiang had forgotten them, Ren Yingying felt flames erupting from her heart and cursed silently, “Bitch, such a bitch.”<br/><br/>However, on the surface, she appeared to be extremely wronged and pitiful, “Xiangxiang, so you were here. Brother Hao and I have been looking for you for a long time. Why didn’t you tell us when you checked out? The hotel kicked Brother Hao and me out. Brother Hao almost started a fight with them.”<br/><br/>As she spoke, she began to cry again.<br/><br/>If it had been before, her words would have upset Lu Xiangxiang immensely.<br/><br/>However, at this moment, Lu Xiangxiang was holding a chicken leg in one hand while looking at their embarrassed expressions.<br/><br/>Chen Hao stared at Lu Xiangxiang’s indifferent expression, and his bottled-up anger finally erupted.<br/><br/>He questioned angrily, “Lu Xiangxiang, how could you be so cruel? Why did you check out? Don’t you know that we were kicked out of the hotel because of you? Did you deliberately want to humiliate us?”<br/><br/>Fang Jingjing was also eating a chicken leg, and she asked in a low voice loud enough for others to hear, “So they’re the boyfriend and close friend you were talking about?”<br/><br/>Lu Xiangxiang nodded, “Yes.”<br/><br/>Fang Jingjing showed a look of contempt on her face, and said, “What kind of taste do you have? These two people are obviously very artificial and vain. He claims to be your boyfriend, but he holds another woman in his arms and questions you on behalf of another girl. Tsk tsk, is he really your boyfriend and not someone else’s?”<br/><br/>Lu Xiangxiang took a bite of her chicken leg and then fell into thought. She shook her head and said, “I don’t know. Every time we went on a date, the three of us were together. Every time they wanted to eat or drink something, they would order me to buy it.”<br/><br/>Fang Jingjing exclaimed, “No way. Are you guys really boyfriend and girlfriend, and not their nanny-cum-paymaster ATM?”<br/><br/>Lu Xiangxiang thought about it and nodded, “You’re right.”<br/><br/>“So how did you become boyfriend and girlfriend with him in the first place? He’s not looking for a girlfriend, he’s obviously looking for an ATM nanny for his real love life, right?” Fang Jingjing asked while chewing on her chicken leg.<br/><br/>Lu Xiangxiang thought about it and shook her head, “Actually, I don’t know either. At that time, he confessed his love to me, and then I agreed in a daze. Even now, I don’t understand why I agreed. And later, I willingly spent money on him.”<br/><br/>Hearing Lu Xiangxiang’s words, both Chen Hao and Ren Yingying’s faces changed.<br/><br/>Chen Hao, unable to contain his anger after hearing their conversation, said, “Lu Xiangxiang, what do you mean? Now that you’ve been admitted to the Lu Xian Group and climbed to a high position, do you want to abandon your poor boyfriend and close friend?”<br/><br/>Was he trying to shift the blame?<br/><br/>Fang Jingjing snorted coldly and said with a sneer, “Oh dear, what are you trying to do? Do you want to label Xiangxiang as a gold-digger? But haven’t you thought that when you two were dating, you were also spending Xiangxiang’s money? Even going so far as to have your secret girlfriend, using the pretext of being close friends, make Xiangxiang pay for you? Now, are you pretending to be a poor little lamb?”<br/><br/>Jealousy flashed in Ren Yingying’s eyes as she looked at the beautiful and generous Fang Jingjing. She asked angrily, “And who are you? This is between the three of us, what does it have to do with you? Why are you meddling?”<br/><br/>She didn’t expect that Lu Xiangxiang, whom she hadn’t kept an eye on, had already made friends.<br/><br/>This made her feel very unpleasant.<br/><br/>Her control over the situation had slipped away and now it was even starting to backfire on her, making her feel both angry and panicked.<br/><br/>Fang Jingjing looked at her with her beautiful eyes and said with a smile, “Oh, I’m Xiangxiang’s new friend. We hit it off right away and are inseparable, so her business is my business. How can you say I’m meddling? And as for you, I heard that when Xiangxiang goes on a date with her boyfriend, you always follow them. Don’t you have any self-awareness? Why are you butting in as a third wheel?”<br/><br/>At this point, she suddenly understood and continued, “Oh, I see. You two are building a front while secretly violating trust. You’ve taken advantage of Xiangxiang’s innocent kindness to deceive and humiliate her. Hmph, you’re really shameless.”<br/><br/>Perhaps because Fang Jingjing had hit the nail on the head, Ren Yingying immediately became flustered and defensive. She pointed at Fang Jingjing and shouted, “I just knew that Xiangxiang was acting like a different person because you were brainwashing her behind her back. Let me tell you, the bond between us close friends for two years cannot be broken by your few words, so your plan will not work.”<br/><br/>She then said to Lu Xiangxiang, “Xiangxiang, is there some misunderstanding between us? Would you rather believe others than trust me? Have you forgotten that when you had a fever in the dormitory, it was me who braved the rain to buy medicine for you and took care of you day and night? So Xiangxiang, you wouldn’t be an ungrateful person, right?”<br/><br/>Was she trying to play the moral kidnapping card?<br/><br/>Just as Fang Jingjing was about to retort, Lu Xiangxiang pulled her sleeve.<br/><br/>Ren Yingying’s eyes brightened, thinking that perhaps Lu Xiangxiang had changed her mind again.<br/><br/>Lu Xiangxiang said, “Speaking of that, I remember that the reason I caught a cold and had a fever at that time was because you lost your meal card. It was raining heavily that night, and you said you were scared to be alone, so you insisted on dragging me along to find it. As a result, I got caught in the rain and caught a cold, while you were fine. You say you braved the rain to buy medicine for me, but you just borrowed a box of medicine from the next dormitory. As for taking care of me without sleeping, you just gave me a glass of water and went straight to bed. Ren Yingying, since my cold was caused by you, how come you’re acting like my benefactor? Where do you get the nerve?”<br/><br/>Ren Yingying’s face changed dramatically.\t\t\t\t\t\t</div>", "images": {}, "success": true}