{"id": 399, "url": "https://www.novelhall.com/the-lucky-star-blessing-the-whole-village-32483/15193491.html", "title": "Chapter 399 - Chapter 399: Chapter 390:", "volume": 4, "volume_title": "Volume 4", "body": "<h1>Chapter 399 - Chapter 399: Chapter 390:</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 399: Chapter 390:<br/><br/>Ren YingYing and Chen Hao are now certain that Lu Xiangxiang, who had been hypnotized, is completely awake now.<br/><br/>She is no longer the slave that they could command at their whimsy.<br/><br/>Chen Hao did not understand, yet wanted to scold out loud, when Ren YingYing tugged at him. She then murmured in a red-eyed, aggrieved and doubtful voice,<br/><br/>“Xiangxiang, how could you say such things? When you helped me find my meal card, it was entirely voluntary. When you caught a cold, I did find medicine and fetched water for you. In the past, you remember me doing these things, right?<br/><br/>But I didn’t expect that after you came here, you would become such an ungrateful person. I… I know you’re not like that Xiangxiang, were you led astray by someone else?”<br/><br/>She glanced at Fang Jingjing as if unintentionally, making it obvious that Fang Jingjing was the one who supposedly led Xiangxiang astray.<br/><br/>Fang Jingjing could not help laughing at this ridiculous accusation.<br/><br/>She calmly laughed and responded, “Haha, so you’re saying I corrupted Xiangxiang, right?<br/><br/>You two are really hilarious.<br/><br/>Xiangxiang not following your commands, no longer being your ATM anymore makes her bad? What kind of shameless logic is that?<br/><br/>So you’re saying Xiangxiang should be your slave, she should serve you? Please, who do you two think you are? Luckily, Xiangxiang came to her senses at the right time and stopped being exploited by you two.”<br/><br/>Facing the truth stated by Fang Jingjing while firmly standing up for Lu Xiangxiang, Ren YingYing’s face, flushed with anger, turned green.<br/><br/>Still, she held back her anger from exploding and looked at Lu Xiangxiang pitifully,<br/><br/>“Xiangxiang, we’ve been friends for two years. You know that back in school, Chen Hao and I were your only friends. Everyone else didn’t like you because you were unattractive and dumb. It was just us, your roommate and Brother Hao, who accepted you, becoming your friend and saving you from loneliness. Oh, so now you have a new friend, you despise your old ones, huh?”<br/><br/>She intentionally glanced at Chen Hao and whimpered,<br/><br/>“Xiangxiang, if you don’t want me that’s fine, but what about Brother Hao? He’s your boyfriend! Have you forgotten how considerate he was towards you? On your birthday, he would buy you gifts. If anyone bullied you, he would stand up for you. Xiangxiang, you may not want me as your friend, but do you also not want him as your boyfriend?”<br/><br/>“Pfft!”<br/><br/>Unexpectedly, Lu Xiangxiang who was the subject of the conversation, burst out laughing after hearing Ren YingYing’s words.<br/><br/>“Haha…”<br/><br/>Then it turned into a loud laughter, so much that she started tearing.<br/><br/>“This is the funniest joke I’ve ever heard.”<br/><br/>Lu Xiangxiang, while trying to control her laugher, spoke loudly,<br/><br/>“Take care of me? I think he was taking care of you under my name, right?<br/><br/>Even shamelessly told me that because you were sick, I had to do the chores. So I was the one who washed your clothes, your socks.<br/><br/>Whatever snacks or drinks you wanted, he would tell me to buy them for you.<br/><br/>Usually, when we went out on dates, you two would flirt shamelessly in front of me, sometimes even pushing me away because I was in the way.<br/><br/>At the movie theater, you two were seated together while my seat was far away, where I could clearly see you two.<br/><br/>Do I even need to elaborate on what you two did in the cinema?<br/><br/>Ren YingYing, you keep saying that Chen Hao is my boyfriend. But this boyfriend just carried the title without any of its significance for me.<br/><br/>But for you, he didn’t have the title, but he did everything a boyfriend should do, caring for you, looking after you, even going to bed with you. So who Chen Hao really is dating, you know it well.”<br/><br/>So, please don’t use him as my boyfriend to manipulate me.<br/><br/>In the past, I, Lu Xiangxiang was like a pig with my mind muddled, letting you two use me.<br/><br/>But now I’m awake. I won’t let you two use me anymore, I won’t become your call and beck slave or your ATM again.<br/><br/>My money, even if given to beggars or donated to the mountains, won’t ever go to you two again.<br/><br/>So, please don’t blackmail me in the name of being my boyfriend or close friend. I, Lu Xiangxiang, won’t fall for it anymore.<br/><br/>And, I’m breaking up with Chen Hao, *ahem*, no, I mean I am dumping him. So, if you want this trash, feel free to take him.”<br/><br/>At the end of Lu Xiangxiang’s speech, the faces of Ren YingYing and Chen Hao turned uglier.<br/><br/>Especially Chen Hao, who was just called ‘trash’ by Lu Xiangxiang. This was a huge insult to him, especially in this public setting.<br/><br/>“Lu Xiangxiang!”<br/><br/>Chen Hao was so angry that he shouted, “You’ve said so much, and it’s all for an excuse for your snobbishness towards wealth!<br/><br/>I really misread you.<br/><br/>Well, breakup, huh. I would like to see which man would want you. You’re just an ugly and dumb fool and you’re a worn shoe that I don’t want, which man would want a worn shoe.”<br/><br/>Let me tell you, don’t come crying back to me later. If you apologize to me now, kneel and beg for my forgiveness, I could consider leaving the past behind and still treat you as my girlfriend, as long as you take good care of me later.”<br/><br/>Ren YingYing also added, “Xiangxiang, if you apologize to Brother Hao, he’ll definitely forgive you. He is a kind and soft-hearted man.<br/><br/>Xiangxiang, I’m not the one saying this, but Brother Hao is truly a good man. He is gentle, careful, and considerate. He will definitely treat you well in the future. If you find me annoying, I won’t contact Brother Hao anymore in the future.”<br/><br/>But in her heart she was thinking, “As long as I can bring Lu Xiangxiang back, then hypnotize her again, she’ll still be our slave.”<br/><br/>Upon hearing this, Chen Hao was quite moved.<br/><br/>He continued, “Lu Xiangxiang, do you see? Yingying is such a reasonable and generous girl. She’s already telling me to forgive you. What more do you want?<br/><br/>So, if you beg for my forgiveness and apologize to Yingying now, we can still be a couple, and you and Yingying can still be close friends.<br/><br/>After we forgive you, you then go to the Xiao Family Village Hotel and book a room for us. We’re both tired and hungry right now. After a good rest, we’ll go back with you.”<br/><br/>Everyone was dumbfounded upon hearing their outrageous words.<br/><br/>Fang Jingjing couldn’t stand it anymore.<br/><br/>She shouted in anger, “Where did these two rabid dogs come from? Chattering nonsense and biting randomly. Damn, my eyes are opened wide now! Apparently, in this world, there’s no such thing as the most shameless, only more shameless people. Lu Xiangxiang, how on earth did you endure these two?”<br/><br/>Lu Xiangxiang shook her head, “I really don’t know.”<br/><br/>Suddenly, a light voice came over, “She may not know, but I do!”\t\t\t\t\t\t</div>", "images": {}, "success": true}