{"id": 396, "url": "https://www.novelhall.com/the-lucky-star-blessing-the-whole-village-32483/15193488.html", "title": "Chapter 396 - Chapter 396: Chapter 387:", "volume": 4, "volume_title": "Volume 4", "body": "<h1>Chapter 396 - Chapter 396: Chapter 387:</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 396: Chapter 387:<br/><br/>Although Lu Xiangxiang wasn’t sure about the character screening in Lu Xian Group, she had been chosen, indicating that she must have had a good character besides her exceptional talent.<br/><br/>Thus, she started tidying up the room in a good mood.<br/><br/>The room was very clean and tidy, with new sheets and a new quilt, an air conditioner installed, and basically all household appliances and furniture were available.<br/><br/>This made Lu Xiangxiang puzzled.<br/><br/>How rich is the Lu Xian Group? She heard that there were 20,000 employees, are all treated like this? That’s a huge sum of money.<br/><br/>Li Xiaomei looked at it and said, “Xiangxiang, if you’re missing anything, just send me a message and I’ll bring it to you, or you can use your work card to get it from the dormitory management department.”<br/><br/>Lu Xiangxiang nodded and said, “Okay, I got it, thank you, Sister Li!”<br/><br/>Li Xiaomei smiled and said, “Xiangxiang, you are a talent that the chairman has high hopes for, so keep going!”<br/><br/>People outside didn’t know that Xiao Jinli was the chairman, but most of the company’s employees knew that Xiao Jinli was indeed the chairman.<br/><br/>For ordinary employees, the Human Resources Department takes charge, unless there’s a special person or situation where the chairman himself would personally intervene.<br/><br/>She had been working for two years and just met the chairman intervening in recruitment for the first time.<br/><br/>Lu Xiangxiang gladly agreed, “Yes, yes, I’ll do my best!”<br/><br/>After Li Xiaomei left, as Lu Xiangxiang was about to pack her luggage, the phone rang.<br/><br/>She thought it was Chen Hao who found out she had vacated the room and called to make trouble.<br/><br/>But when she looked, it turned out to be a call from home.<br/><br/>She was silent for a moment before she answered the phone.<br/><br/>“Hello, Mom!”<br/><br/>A gentle voice came in, “Daughter, are you doing well?”<br/><br/>Lu Xiangxiang’s tears welled up, she nodded and replied, “Yes, I’m doing well. And you?”<br/><br/>“I’m doing well too,” the woman’s voice said, “I’m glad you’re doing well. I heard you went to Xiao Family Village for an audition to be an actor?”<br/><br/>“Yes, I’ve been hired,” Lu Xiangxiang replied, “Now I’m officially in the company and about to start work.”<br/><br/>The woman was silent for a while before asking, “But what about your studies? You’re still in college now!”<br/><br/>Lu Xiangxiang said, “There are six groups of us, and two of them perform on holidays, including myself.”<br/><br/>“Don’t you want to work in your family’s company?” the other side asked anxiously, “Are you going to let that wretched couple take over all your family’s property?”<br/><br/>“Mom, I don’t want to inherit the family business, so I don’t want to join the company. I have things I like to do! Little Brother is doing great in the company, starting from the bottom, and has successfully completed several major projects at a young age.”<br/><br/>As soon as Lu Xiangxiang’s words fell, the other side yelled irrationally, “Lu Xiangxiang, are you trying to kill me with anger? I don’t care how well Lv Zhiqiang does, I only know that the entire Lv family’s property should be yours, and if that wretched couple tries to grab it, you should drive them away.”<br/><br/>Lu Xiangxiang’s eyes were red, and she said loudly, “That’s not my family business, it’s the Lu Family’s, and Little Brother is part of the Lu Family, he is also entitled to inherit the family business.”<br/><br/>The other side cursed angrily, “Stupid girl, how did I give birth to such a stupid girl? Let me tell you, Lu Xiangxiang, this Lu Family business, whether you fight for it or not, you have to fight for it, otherwise, you are no longer my daughter, and I don’t have such a stupid daughter.”<br/><br/>Having said that, she hung up the phone directly.<br/><br/>Lu Xiangxiang stared at the disconnected phone, her eyes were blank and she didn’t speak for a long time.<br/><br/>After a while, her phone rang again.<br/><br/>Seeing the call, the softness in her eyes appeared, she answered, “Little Brother?”<br/><br/>He couldn’t wait to say, “Sister, I heard that you went to Xiao Family Village with Chen Hao and Ren Yingying for the auditions, did you?”<br/><br/>Lu Xiangxiang nodded, “Yes.”<br/><br/>Little Brother Lv anxiously said, “But I heard that you were just accompanying them? Will they bully you? I heard that since you started dating Chen Hao, he has been complaining about you. That bastard, what qualifications does he have to complain about you? You’re the golden girl of our Lv Family, the pearl in our palms, and my precious sister, Lu Zhiqiang. Besides his good looks, what else does that Chen Hao have? He’s just a crow that flew out of a rural ravine.”<br/><br/>As he said this, he reacted immediately, and then apologized, “Sister, I’m sorry, I shouldn’t have spoken bad about him.”<br/><br/>Lu Xiangxiang’s tears flowed again, she shook her head and choked, “No, you’re right. Chen Hao is just a wild crow that flew out of the rural ravine, what qualifications does he have to complain about me, the precious daughter of the Lv Family.”<br/><br/>On the other side, Lu Zhiqiang had his mouth wide open, his expression incredulous.<br/><br/>In the past, when he spoke ill of Chen Hao and Ren Yingying, his sister would angrily defend the man.<br/><br/>Now…<br/><br/>Lu Zhiqiang asked worriedly, “Sister, what happened? Why did you…?”<br/><br/>If something hadn’t happened, her sister wouldn’t have changed so suddenly.<br/><br/>He thought of something and immediately said, “Sister, did they bully you? You wait, I’m coming to Xiao Family Village right now. If that bastard dares to bully you, I will teach him a lesson.”<br/><br/>Lu Xiangxiang laughed and cried, “No, Little Brother, it’s not like that. I’ve just come to my senses, so I don’t put them in my heart anymore. Oh, and let me tell you, I got accepted by the Lu Xian Group, and I’ll be working there from now on.”<br/><br/>“Sister, did you really get accepted by the Lu Xian Group?” Lu Zhiqiang was obviously more excited and happier than her, but then he thought of something, “But sister, Dad wants you to work in the family’s company? You are the heir of the Lv Family. How can you control those ambitious directors if you don’t work in the future?”<br/><br/>That’s right, Lu Xiangxiang lied to her own mother.<br/><br/>Actually, she didn’t even have to fight for the Lv Family; it was hers by default.<br/><br/>It’s just that she was not interested in inheriting the family business and knowing her mother’s nature, she lied to her mother.<br/><br/>However, Lu Xiangxiang shook her head and said, “No, I’m not interested in inheriting the family business. Little Brother, the responsibility of the Lv Family will fall on you in the future.”<br/><br/>Lu Zhiqiang shook his head repeatedly, refusing, “That won’t do. I’m not interested in inheriting the Lv Family either. Sister, Dad said that you are the heir of the Lv Family, and that will never change. I am just here to assist you from the side! Sister, I plan to start my own business outside, I like the process of entrepreneurship and competition.”<br/><br/>“Pfft!” Lu Xiangxiang laughed and said, “If Dad knew that both of his children didn’t want to inherit the family business, I wonder if he’d have a heart attack.”<br/><br/>Lu Zhiqiang said, “It’s fine, the old man’s in good health. If we, the two big ones, really don’t want to inherit the family business, he can have a little one with my mom.”<br/><br/>“Hehe, if Dad hears you say that, he’ll probably grab a stick and chase you around the yard.”<br/><br/>“Haha…”\t\t\t\t\t\t</div>", "images": {}, "success": true}