{"id": 392, "url": "https://www.novelhall.com/the-lucky-star-blessing-the-whole-village-32483/15193484.html", "title": "Chapter 392 - Chapter 392: Chapter 383:", "volume": 4, "volume_title": "Volume 4", "body": "<h1>Chapter 392 - Chapter 392: Chapter 383:</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 392: Chapter 383:<br/><br/>Throughout the day, Xiao Jinli chose four people, two men and two women.<br/><br/>Among those she chose, one was extremely beautiful, and the other had a delicate and pretty face. As for the men, they were all tall, muscular, and had sharp facial features that made them look like soldiers.<br/><br/>Xiao Yucheng looked at the four chosen ones and secretly breathed a sigh of relief.<br/><br/>Xiao Mingchen patted his chest in consolation and said, “Thank goodness, I thought Jinli would only choose delicate-looking actors.”<br/><br/>Yet their recruitment criteria were dignified, beautiful, and graceful.<br/><br/>Xiao Jinli said to Xiao Yucheng, “Today we have chosen two pairs. Tomorrow, we must continue.”<br/><br/>Xiao Mingchen asked, “Will the people who were chosen today come back tomorrow?”<br/><br/>“Of course, they will.” Xiao Yucheng said with certainty, “There are so many of them, and none of them have been screened out.”<br/><br/>“So there will be even more to choose from tomorrow?” Xiao Mingchen asked worryingly, “Jinli, won’t you be really tired?”<br/><br/>Xiao Jinli shook her head and smiled, “No, I’ll be fine.”<br/><br/>“Alright, as long as you don’t feel tired,” Xiao Yucheng sighed lightly. “The recruitment this time is just too massive. Next time, let’s do an online screening first and then proceed with the interviews.”<br/><br/>Xiao Mingchen shrugged and said, “But Jinli insisted on not screening online and wanted to conduct face-to-face interviews herself.”<br/><br/>With a puzzled tone, Xiao Mingchen asked, “Jinli, why are you so concerned about auditioning ordinary actors?”<br/><br/>Xiao Jinli smiled and replied, “Because I want to cultivate real actors!”<br/><br/>“Are we really going to establish an entertainment company?” Xiao Mingchen exclaimed in amazement.<br/><br/>There was a lot of room for growth in the entertainment industry.<br/><br/>Xiao Jinli shook her head and said, “No, the entertainment industry is too deep for us to get involved. We just want to build a theater in Xiao Family Village and start a drama company. In the future, this will be one of our manor’s projects.”<br/><br/>Xiao Yucheng frowned and said, “Jinli, if we set up a theater, do we need to invite actors from the national theater? These ordinary people have no foundation in acting. Also, actors must be cultivated from a young age. Isn’t it too late to train them now?”<br/><br/>Xiao Jinli shook her head and said, “Big brother, you misunderstand me. What I meant by theater was that we would perform a script live on stage. The script must be a short play. As long as the actor has acting skills, it’s fine.”<br/><br/>Xiao Yucheng immediately understood and laughed, “Alright, I’ll get the people below to draft a proposal right away.”<br/><br/>As for the script, whether it was written or bought, it would be handled by the people below in the company. Xiao Jinli would not interfere.<br/><br/>In the conference room, Lu Xiangxiang, Fang Jingjing, Tang Renjie, and Ren Feiyang sat at the conference table, all feeling a bit awkward as they didn’t know each other well.<br/><br/>Lu Xiangxiang had a delicate appearance but was not very eloquent. She seemed rather clumsy in front of her friends and classmates.<br/><br/>In contrast, Fang Jingjing, judging by her name, seemed like a quiet girl,<br/><br/>However, she was a cheerful and lively girl who was not only exceptionally beautiful but also articulate and sociable. She was a very talented girl, and singing and dancing seemed effortless to her. At school, she was a popular figure and a beauty with both looks and talent.<br/><br/>Of course, considering her looks and talent, it was natural that talent scouts would seek her out to sign her into the entertainment industry.<br/><br/>However, Fang Jingjing didn’t like the entertainment industry, and her family didn’t allow her to enter it either.<br/><br/>She was very aware of her limits.<br/><br/>Although she was considered very beautiful by others, she would be nothing special in the entertainment industry, which was full of beautiful women.<br/><br/>Whether or not one could maintain their innocence in the entertainment industry was hard to say.<br/><br/>After all, the industry was too dark. One careless move could potentially lead to becoming the target of someone’s scheme, making it difficult to escape.<br/><br/>Nevertheless, she enjoyed acting. Whenever there were public performances at school, she would participate.<br/><br/>She applied for the position of an actor here due to the reputation of Xiao Family Village, which could ensure her safety.<br/><br/>Unexpectedly, she was lucky enough to be chosen.<br/><br/>Fang Jingjing confidently introduced herself to the others, “Hello everyone, my name is Fang Jingjing, I’m twenty-one years old, from the south, and a student of S University. If there are no mishaps, we will be colleagues in the future.”<br/><br/>After Fang Jingjing took the lead in introducing herself, the other three followed suit.<br/><br/>“My name is Tang Renjie. I’m twenty-three years old and from Guang Province. I just finished my military service.”<br/><br/>“My name is Ren Feiyang. I’m twenty-two years old and from Gui Province. I just finished my military service.”<br/><br/>“My name is Lu Xiangxiang. I’m twenty years old, from the Capital City, and a sophomore at Jing University.”<br/><br/>“Wow, you’re actually from the Capital City and a student at Jing University. That’s amazing!” Fang Jingjing exclaimed. “It seems like you’re a talented woman. Please teach me more in the future.”<br/><br/>Lu Xiangxiang immediately blushed and said modestly, “I… I’m not smart. My friends and people around me always say that. I just hope you all won’t mind.”<br/><br/>“Not smart? Where are you not smart? Can someone who’s not smart get into Jing University? Even though you’re a local and the entry requirements might be lower, you still got in based on your own abilities,” Fang Jingjing argued angrily. “I think those who call you stupid are just jealous of you.”<br/><br/>It wasn’t easy for the two men who had just met to console Lu Xiangxiang.<br/><br/>But they said, “Anyone who can get into Jing University is very intelligent and hardworking. You’re not stupid at all.”<br/><br/>Having been soldiers, they were trained to recognize that this girl had probably been brainwashed for a long time, causing her self-doubt.<br/><br/>At that moment, Lu Xiangxiang’s phone rang.<br/><br/>As soon as Lu Xiangxiang saw the caller ID, her face lit up with a sweet smile. She answered the phone and said, “Brother Hao.”<br/><br/>Unexpectedly, the other party was clearly very angry.<br/><br/>“Hao what? Lu Xiangxiang, you better come out now. You want to starve Yingying and me to death?” Chen Hao scolded loudly.<br/><br/>Lu Xiangxiang glanced at the conference room and the other three people with her phone in hand, hesitatingly saying, “But I was chosen, and they asked me to wait in the conference room for the chairman.”<br/><br/>Upon hearing this, Chen Hao became even angrier, “You were chosen? How could that be? Yingying’s much smarter and prettier than you, and she didn’t get chosen! You’re stupid and ugly, how could you possibly get chosen? They’re just lying to you! We’re at the Delicious Cafeteria, so hurry up! We’re waiting for you to eat, and we didn’t bring money.”<br/><br/>As soon as he finished speaking, a whiny voice tried to convince her, “Xiangxiang, it’s not just me, even that famous internet celebrity Zhou Bingbing wasn’t chosen. You know how pretty she is. Xiangxiang, with your qualifications, there’s no way you could have been chosen. Don’t embarrass yourself. Just come back.”\t\t\t\t\t\t</div>", "images": {}, "success": true}