{"id": 393, "url": "https://www.novelhall.com/the-lucky-star-blessing-the-whole-village-32483/15193485.html", "title": "Chapter 393 - Chapter 393: Chapter 384:", "volume": 4, "volume_title": "Volume 4", "body": "<h1>Chapter 393 - Chapter 393: Chapter 384:</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 393: Chapter 384:<br/><br/>Fang Jingjing had heard enough. She grabbed Lu Xiangxiang’s cellphone and spoke loudly, “Are you her friends? How can friends not be happy for her success? Instead, you are constantly attempting to manipulate and trick her.”<br/><br/>As soon as Fang Jingjing finished speaking, Ren Yingying responded angrily, “Who are you to interfere? This is between us and Lu Xiangxiang, just give the phone back to her.”<br/><br/>Chen Hao, standing nearby, yelled, “Lu Xiangxiang, do you still want Yingying as a friend or not? Apologize right now. Otherwise, I won’t forgive you.”<br/><br/>With the cellphone in hand, Fang Jingjing nearly rolled her eyes in disbelief. She muttered into the phone, “You are such pests, all you do is nag.”<br/><br/>With that, she hung up the call.<br/><br/>As she handed the cellphone back to Lu Xiangxiang, she asked in disbelief, “Who are they to treat you like this?”<br/><br/>Lu Xiangxiang looked hesitant and said, “One of them is my boyfriend and the other is my close friend.”<br/><br/>“What?” Fang Jingjing responded, astonished, “Are they not your enemies? How could your boyfriend and close friend be like this? You were chosen, they weren’t. Yet they still belittle you. If this is how friends behave, they must be enemies for sure.”<br/><br/>Lu Xiangxiang was a bit crestfallen as she responded, “I don’t know why they behave like this. They often call me stupid and ugly, saying no one would want to be friends with me. Yet, they want to be my friends. At school, no one wants to be my friend, or even talk to me. Everyone looks at me with disgust. But Brother Hao likes me, and Ren Yingying is my friend.”<br/><br/>Fang Jingjing frowned, puzzled, and asked, “Is that how they speak to you?”<br/><br/>Lu Xiangxiang nodded, “Yes.”<br/><br/>“They must be your enemies,” Fang Jingjing commented, still shocked. “Who said you are ugly? If a cute and refined girl like you is considered ugly, there would be no beautiful girls in this world. And where are you stupid? If you were truly stupid, could you have been admitted to Jing University?”<br/><br/>After thinking for a moment, Fang Jingjing suggested, “Xiangxiang, don’t think I am trying to drive a wedge in your relationships, but I feel like they are manipulating you. They constantly make you doubt yourself, so that you can only rely on them. You said no one at school wants to be your friend, but have you ever tried communicating with other classmates?”<br/><br/>Lu Xiangxiang thought for a moment, nodded, then shook her head. She bit her lip and timidly responded, “I…I actually want to communicate with my classmates. But every time I thought about approaching them, Yingying would stop me. She says that they already dislike me. If I continued to approach them without realizing my place, they would be more disgusted.”<br/><br/>Her voice breaking, Lu Xiangxiang expressed, “In reality…I…I really don’t know why they find me so annoying. I want to interact and be friends with others.”<br/><br/>Fang Jingjing, “…”<br/><br/>This girl was too naïve and gullible, easily manipulated.<br/><br/>And those manipulating her were her boyfriend and so-called close friend.<br/><br/>Listened to the phone call just now, she thought the one called Brother Hao and Ren Yingying were the actual couple. Meanwhile, Lu Xiangxiang was just paying for their dates. For instance, they would have her pay for their meals.<br/><br/>Fang Jingjing thought for a moment, then asked tentatively, “Xiangxiang, when you go on dates with your boyfriend, are there usually two or three people?”<br/><br/>“Three of us.” Lu Xiangxiang responded, “Yingying said she would supervise to ensure my boyfriend would not look at other girls.”<br/><br/>“Then who pays for these dates? Do you split the bill amongst the three of you?” she further asked.<br/><br/>Lu Xiangxiang shook her head, “I pay for everything. Both Brother Hao and Yingying come from poor families in the countryside and have to spend every penny with care.”<br/><br/>Fang Jingjing, “…” she didn’t know what to say at this point.<br/><br/>What she was sure now was that the two individuals had sought out Lu Xiangxiang with the intention of finding a scapegoat to pay for their dates and living expenses.<br/><br/>Fang Jingjing’s eyes moved as she jokingly asked, “Xiangxiang, have you ever suspected that your boyfriend and your friend might be a secret couple?”<br/><br/>Lu Xiangxiang reacted with surprise, “No way?”<br/><br/>Just as Fang Jingjing was about to say something, Lu Xiangxiang’s phone rang again.<br/><br/>The screen displayed “Brother Hao”.<br/><br/>After hesitating for a moment, Lu Xiangxiang answered the call.<br/><br/>The caller instantly berated her, “Lu Xiangxiang, what were you doing throughout half the day that you couldn’t answer the phone?”<br/><br/>Before Lu Xiangxiang could explain, the caller yelled again, “Yingying and I are waiting in the cafeteria for you to pay the bill. What are you doing there? Don’t think that just because you pretend to be a phoenix soaring high, the executives of Lu Xian Group will be impressed.”<br/><br/>“Look at yourself, you’re ugly and stupid, who would like you? Be real and come to the cafeteria. Oh, and Yingying wants to rest in the hotel. Go book a room. Yingying has another interview tomorrow, she has to rest well to give her best performance. Once Yingying has this job; she becomes an actress and becomes famous, she won’t forget you. So, you should be grateful, understand?”<br/><br/>Fang Jingjing couldn’t bear to listen any more.<br/><br/>Just as she was about to speak, someone came in.<br/><br/>Xiao Jinli, followed by a few executives.<br/><br/>Lu Xiangxiang saw Xiao Jinli and without a second thought, she hung up instantly, appearing flustered and anxious.<br/><br/>Xiao Jinli took notice of her and asked, “What’s wrong?”<br/><br/>Lu Xiangxiang shook her head, “No…nothing!”<br/><br/>Fang Jingjing, unable to hold back, interjected, “Her boyfriend just called her, asked her to go to the cafeteria to pay for him and his friend.”<br/><br/>Lu Xiangxiang’s face immediately reddened in embarrassment.<br/><br/>Xiao Jinli took Lu Xiangxiang’s resume from his assistant, looked at it, then said, “Lu Xiangxiang, 20 years old, from the capital city, your father is Lu Yiming, and your mother is Dai Jin…”<br/><br/>Lu Xiangxiang’s mouth fell open as she stared at Xiao Jinli in disbelief.<br/><br/>The information that Xiao Jinli had just read was not just from her resume, but also included her achievements, awards, and even events that she had almost forgotten herself.<br/><br/>In the end, Xiao Jinli asked, “Lu Xiangxiang, you are excellent, a smart and hardworking individual. We need such talents in our company. Would you like to join us and become one of us?”<br/><br/>Lu Xiangxiang, still stunned and in disbelief, couldn’t respond for a while.<br/><br/>What did the Chairman just say? He said that she is excellent, smart, and hardworking.<br/><br/>Is that true? Is that really about her?<br/><br/>Fang Jingjing, standing next to the dazed Lu Xiangxiang, gently pushed her and whispered, “Xiangxiang, what are you spacing out for? He’s asking you a question.”<br/><br/>Awoken by Fang Jingjing, Lu Xiangxiang, brimming with happiness, nodded violently and responded, “Yes, I am willing, I am willing, Chairman!”<br/><br/>“Ha, Chairman?”\t\t\t\t\t\t</div>", "images": {}, "success": true}