{"id": 391, "url": "https://www.novelhall.com/the-lucky-star-blessing-the-whole-village-32483/15193483.html", "title": "Chapter 391 - Chapter 391: Chapter 382:", "volume": 4, "volume_title": "Volume 4", "body": "<h1>Chapter 391 - Chapter 391: Chapter 382:</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 391: Chapter 382:<br/><br/>Everyone heard and had the security guard go out, and they burst into laughter.<br/><br/>Someone mocked loudly, “Hahaha, I thought she was chosen, but it turns out she wasn’t chosen, or rather, she was chosen to be kicked out.”<br/><br/>“Hahaha, this result is quite unexpected.”<br/><br/>“She is a well-known internet celebrity, and she is driven away like this, I don’t know how humiliating this is.”<br/><br/>“Isn’t it? So many people calmly lined up to go out, but this famous internet celebrity was directly chased out. It’s a huge humiliation, I don’t know what her fans will think of her.”<br/><br/>“By the way, Little Zhou Bingbing is quite beautiful, why wasn’t she chosen?”<br/><br/>“What’s so strange about that? There are countless beautiful people among these hundreds of thousands. Little Zhou Bingbing is said to be beautiful, but actually, she has had plastic surgery to look like Zhou Bingbing – all for the sake of fame.”<br/><br/>“As a famous internet celebrity, how could she be willing to come here and be a salaried actress? Therefore, her applying for an acting role here may be for hype.”<br/><br/>“That could be possible.”<br/><br/>“Miss Xiao really is bold, kicking people out without leaving any face. By the way, what is Miss Xiao’s position in the company? It seems that all the big shots are following her lead.”<br/><br/>“The green-dressed girl she picked is just fresh-faced, not exactly beautiful, but it’s clear that no one has any objections to Miss Xiao’s choices.”<br/><br/>“No, what do you mean? There will still be initial screenings, right? They will definitely choose few people?”<br/><br/>“It’s hard to tell. We all received notifications and came for the interview suddenly. With so many people coming at once, you have to narrow it down and pick more people for the next screening, right? How could they just pick people at random and have this be the final list?”<br/><br/>“By the way, why did Little Zhou Bingbing suddenly get asked to leave?”<br/><br/>“Don’t you see it? Little Zhou Bingbing was unwilling to accept that she wasn’t chosen and that the green-dressed girl with worse qualifications was chosen instead. She wanted to cause trouble, but she didn’t get a chance to.”<br/><br/>“Right. Just as Little Zhou Bingbing was about to start trouble, the line stopped. There are so many people, and a little delay can hold up so many people.”<br/><br/>After Lu Xiangxiang was picked, she felt like she was dreaming.<br/><br/>She was actually just here to accompany her boyfriend and close friend for the interview, but out of the three of them, she was the one who got chosen.<br/><br/>She looked quite ordinary, and was much less good-looking than her close friend, but it was she who was chosen.<br/><br/>“Ma’am, please give me your resume and have a seat here,” a staff member from the Human Resources department politely said to her.<br/><br/>Lu Xiangxiang handed over her resume blankly and asked with doubt, “Excuse me, was I chosen? Have I been chosen?”<br/><br/>The staff member smiled and responded, “You passed the preliminary round.”<br/><br/>Lu Xiangxiang looked at Xiao Jinli and whispered, “I want to ask who the beautiful girl is. She’s so beautiful and has such a temperament, like a little fairy.”<br/><br/>The staff member laughed and said, “This is our Miss Xiao, the company’s chairman!”<br/><br/>“Chair… Chairman?” Lu Xiangxiang was shocked, “So young?”<br/><br/>The public structure and executive introductions of the Lu Xian Group only introduced the president and other executives, but no information about the chairman.<br/><br/>Everyone knew that the Lu Xian Group had a chairman, but who the chairman was remained a mystery.<br/><br/>However, Lu Xiangxiang never expected that the famous Lu Xian Group and Xiao Village Farmhouse chairman would be a young girl.<br/><br/>Before Lu Xiangxiang could digest the information she had received, she was taken to the company’s reception room by the staff to wait quietly.<br/><br/>The line continued, and Xiao Jinli did not take the interviewer’s seat, but stood between the two lines.<br/><br/>Communication is now very advanced.<br/><br/>Soon, everyone knew that the interviewer this time was a very beautiful girl.<br/><br/>And this beautiful girl could casually select you with just a finger.<br/><br/>So, those who had not yet lined up immediately fixed their hair and clothes, or touched up their makeup.<br/><br/>“I heard that there is a very beautiful girl in Xiao Family Village, could it be her?”<br/><br/>Someone speculated.<br/><br/>“Now that you mention it, it’s very likely. But the strange thing is that no one can take her picture, and even if they can, the picture will unknowingly disappear in the phone’s camera. If you didn’t know better, you’d think it was a picture of a female ghost.”<br/><br/>“This beauty exists only in the mouths of travelers, but no matter whether it’s online or in reports, this beauty never appears.”<br/><br/>“Wait a minute, I must take a good look at this beauty. How beautiful must she be.”<br/><br/>The information spread quickly,<br/><br/>Everyone went from being nervous about the interview to being curious and suspicious about the interviewer.<br/><br/>“She’s really so beautiful. How can there be such a beautiful girl? It’s not an exaggeration to say she’s nationally stunning.”<br/><br/>“Yes, Zhou Bingbing, who is known as the number one beauty in the entertainment industry, is no match for this girl’s beauty.”<br/><br/>“By the way, why is the interviewer this time a beautiful girl and not those presidents? But on a side note, why is the Lu Xian Group’s recruitment of acting talent being treated as a big deal? Even the presidents are coming out?”<br/><br/>“Yes, aren’t they just ordinary actors? The Lu Xian Group seems to be very focused.”<br/><br/>“Maybe the Lu Xian Group wants to develop in the entertainment industry and promote a few star actors?”<br/><br/>“That’s quite possible. Otherwise, there’s no reason for the entire executive team to pay so much attention to the recruitment of just a few ordinary actors.”<br/><br/>“So, the Lu Xian Group is recruiting real actors who will later film TV shows and movies? If that’s really the case, as long as they sign with the Lu Xian Group, they will definitely become very popular.”<br/><br/>“Ahh,” someone said excitedly, “Even if I don’t get chosen as an actor, I’ll stay here and do odd jobs to see if I can watch someone rise from an ordinary person to fame.”<br/><br/>Of course, these discussions all fell into Xiao Jinli’s ears!<br/><br/>Xiao Mingchen laughed and said, “This group of applicants is quite lively!”<br/><br/>Xiao Yucheng chimed in, “And creative!”<br/><br/>The line continued to move forward, with Xiao Jinli’s hands folded in front of her, her expression cold. Then she spoke loudly, “Speed up the line!”<br/><br/>“Haha, speed up? How can we go faster, are we supposed to run?”<br/><br/>“How do they choose people here? What do they see just by us walking a circle?”<br/><br/>“Who knows!”<br/><br/>After a while, Xiao Jinli picked another person. This time, it was a boy!<br/><br/>The chosen boy was very excited!\t\t\t\t\t\t</div>", "images": {}, "success": true}