{"id": 395, "url": "https://www.novelhall.com/the-lucky-star-blessing-the-whole-village-32483/15193487.html", "title": "Chapter 395 - Chapter 395: Chapter 386:", "volume": 4, "volume_title": "Volume 4", "body": "<h1>Chapter 395 - Chapter 395: Chapter 386:</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 395: Chapter 386:<br/><br/>Lu Xiangxiang didn’t call Chen Hao in advance and went straight to the cafeteria.<br/><br/>Perhaps she was too familiar with Chen Hao and Ren Yingying, and she noticed them from a distance, sitting in a corner.<br/><br/>But her gaze seemed utterly incredulous.<br/><br/>She saw Chen Hao and Ren Yingying embracing each other like a real couple, feeding each other their food.<br/><br/>Well, it is quite common to see couples displaying affection in this cafeteria.<br/><br/>Lu Xiangxiang suddenly remembered what Fang Jingjing had said: “Xiangxiang, are you sure you and that guy called Chen Hao are a couple, not him and that girl called Ren Yingying?”<br/><br/>With red eyes and tearful corners, Lu Xiangxiang slowly walked behind them.<br/><br/>Chen Hao and Ren Yingying, who were back-to-back with her, fed each other while chatting. Chen Hao spoke about his situation in a complainy manner.<br/><br/>Listening to them, Lu Xiangxiang felt heartbroken. Chen Hao always spoke to her in a derogatory way.<br/><br/>For instance, “You’re so ugly; I’m the only one who can stand you. You’re so stupid that only I would date you. Otherwise, you wouldn’t even know if someone sold you off.”<br/><br/>But now she heard Chen Hao saying, “Yingying, I think about you every day and miss you terribly. Just the thought of being with that stupid girl makes every day feel like a year. Only looking at your photo can comfort my tainted soul. Come on, give me a kiss to compensate for my suffering.”<br/><br/>Ren Yingying giggled and teased, “Brother Hao, I’m with you on all your dates with that stupid girl. We’re basically together every day, so why would you miss me to death?”<br/><br/>After hearing her words, Lu Xiangxiang recalled that since she started dating Chen Hao, she hardly had any alone time with him. Every time they talked or went on a date, Ren Yingying was following them.<br/><br/>No, their dates were basically Chen Hao and Ren Yingying cozying up and chatting, while Lu Xiangxiang was running around fulfilling their every demand. She either bought them water, drinks, or snacks while following them, or paid for their purchases directly.<br/><br/>Ren Yingying continued, “Why isn’t that stupid girl here yet? She couldn’t have actually been chosen, could she?”<br/><br/>“How is that possible?” Chen Hao said confidently, “That stupid girl is ugly and foolish. How could she be chosen?”<br/><br/>Ren Yingying asked worriedly, “But what if she does get chosen? What will we do then? If she stays here, we’ll have to go back to the Capital City. We won’t have anyone to pay for our purchases anymore. I’ve got my eye on a Swarovski necklace that costs 6800. I was planning to find an excuse for her to pay for it when we go back.”<br/><br/>“How could she possibly be chosen?” Chen Hao said confidently. “Even if she is, once I say a few words to crush her spirits, she’ll doubt herself. After that, I’ll make her refuse the job – she’ll definitely listen.”<br/><br/>Ren Yingying’s eyes lit up, and she said excitedly, “Right! That stupid girl Lu Xiangxiang is so afraid you’ll dump her, she’s willing to be your slave, serve you, listen to you, and spend money on me.”<br/><br/>Standing behind them, Lu Xiangxiang had red eyes and clenched fists, anger burning at the bottom of her eyes. She wanted to confront them right away, but it would be embarassing for her to do so in public.<br/><br/>Then, she took a deep breath, rushed back to her hotel to pack up and checked out. As for their luggage, it was none of her business.<br/><br/>The receptionist hesitated for a moment as she looked at Lu Xiangxiang’s luggage and asked, “Miss Lu, are you checking out your two friends’ rooms too?”<br/><br/>Indeed, since coming to Xiao Family Village, Lu Xiangxiang had been responsible for all the expenses, including the hotel fees.<br/><br/>Lu Xiangxiang nodded and said, “Yes, check them out as well. They’ll come by themselves to pick up their luggage later.” As for how the hotel would deal with their luggage, she no longer cared.<br/><br/>Those two scumbags used her money and looked down on her. It’s like biting the hand that feeds them.<br/><br/>She was indeed a fool being toyed with by two scumbags.<br/><br/>She had a good family background, wealthy and powerful, and was top of her class, winning various awards. Relatives and friends used to praise her for being smart, obedient, and adorable.<br/><br/>However, after going to university and meeting Chen Hao and her roommate Ren Yingying, her mind seemed clouded, and she was brainwashed by them, only ever listening to what they said.<br/><br/>Well, now she’s awake and won’t serve them anymore.<br/><br/>As Lu Xiangxiang dragged her suitcase away, she glanced at the two suitcases in the corner and smirked. She wanted to see what they would do without her, their “fool,” spending money on them.<br/><br/>Lu Xiangxiang pulled her suitcase onto the company-arranged car and headed to the company dormitory.<br/><br/>The staff member accompanying her said, “Our company’s dormitory offers single rooms, double rooms or family rooms. Single rooms are for those without partners, 20 square meters with a bathroom and bedroom. Double rooms are for couples or childless married couples, slightly larger, with a kitchen, about 30 square meters. Family rooms are for families, with either two or three bedrooms.”<br/><br/>Lu Xiangxiang’s eyes lit up, “The company’s treatment is so good!”<br/><br/>The staff member said with pride, “Isn’t it? In other big companies, dormitories have three or four people squeezed together. But here, everyone has their own room. Most importantly, if they want, the whole family can live together. My partner and I live together, and we both work here. Employees have free meals and accommodation, so my partner and I save money. By the end of the year, when we get married, we’ll buy a house in our hometown.”<br/><br/>Together, their salaries added up to more than twenty thousand. Minus essential living expenses, they could save about twenty thousand each month.<br/><br/>House prices in their hometown were cheap, and a down payment for a first home was just over 100,000.<br/><br/>Although Lu Xiangxiang came from a wealthy family and lived in a big villa with a private plane to take her to school, she felt uneasy at home because of her parents.<br/><br/>Now having this private space made her feel very happy.<br/><br/>Lu Xiangxiang said, “The benefits here are so great. I guess anyone who comes to work here wouldn’t want to leave, right?”<br/><br/>“Absolutely. So everyone working here does their best to do their jobs well.” Li Xiaomei said, “Every position here is full. Otherwise, I’d want to introduce my relatives and friends to come here. However, to work here, one’s character is the most important thing. No matter how capable they are, if their character isn’t good, they’ll be eliminated.”<br/><br/>Lu Xiangxiang pondered on this.<br/><br/>Curious, Lu Xiangxiang asked, “How exactly does the company recruit people? And how do they determine whether someone has a good character?”<br/><br/>After all, it’s hard to know someone’s character upon just meeting them for the first time.<br/><br/>Li Xiaomei shook her head and said, “Actually, we don’t know either. We submitted our resumes, and after the interview, we received a notice to start work the next day.”<br/><br/>Lu Xiangxiang,\t\t\t\t\t\t</div>", "images": {}, "success": true}