{"id": 397, "url": "https://www.novelhall.com/the-lucky-star-blessing-the-whole-village-32483/15193489.html", "title": "Chapter 397 - Chapter 397: Chapter 388:", "volume": 4, "volume_title": "Volume 4", "body": "<h1>Chapter 397 - Chapter 397: Chapter 388:</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 397: Chapter 388:<br/><br/>“What do you mean, our room has been cancelled?” Ren YingYing’s eyes widened, full of surprise.<br/><br/>When Chen Hao and Ren YingYing returned to the hotel, they were informed that their room had been cancelled.<br/><br/>“How is that possible? We clearly booked the room for five days, and we only stayed for two days!” Ren YingYing said angrily, “Why didn’t your hotel make a call to inform us when cancelling the room on behalf of the guest? This is unacceptable; I want to make a complaint!”<br/><br/>The receptionist’s face darkened, but she maintained a smile and said, “I’m sorry, ma’am. Your room was booked by another guest. So when she wanted to cancel the room, our hotel naturally agreed.”<br/><br/>It was a joke – they were not short of customers.<br/><br/>As soon as they cancelled one room, another guest booked it immediately.<br/><br/>Now hotel and homestay rooms are in high demand.<br/><br/>Many tourists outside were unable to book rooms and were even considering being admitted to the hospital to have a place to stay.<br/><br/>Chen Hao and Ren YingYing’s faces turned black with anger and embarrassment.<br/><br/>The receptionist looked at their expressions, full of doubt; was the girl who cancelled the room really their good friend?<br/><br/>However, she still showed a courteous and polite smile and asked, “Would you like to check in to the hotel again?”<br/><br/>She glanced at the computer and apologized, “I’m sorry, all the rooms in the hotel are booked. Please look for another hotel.”<br/><br/>Upon hearing this, Ren YingYing became even angrier and complained, “No, your hotel cancelled our room without our consent, leaving us with nowhere to stay. You must find a solution for our accommodation problem; otherwise, I will complain to the relevant department.”<br/><br/>The receptionist’s expression twisted for a moment, almost rolling her eyes, and said, “Your room was booked by your friend, so when she wanted to cancel the room, our hotel followed the normal procedure. Therefore, your room problem is your own business, and our hotel has no obligation.”<br/><br/>Ren YingYing threw a tantrum, “I don’t care whether you have an obligation or not; since your hotel cancelled our room, you must solve our accommodation problem.”<br/><br/>Receptionist,<br/><br/>After a while, Chen Hao and Ren YingYing were escorted out of the hotel by the security guards, looking very embarrassed.<br/><br/>The hotel receptionist said speechlessly, “They have no money, yet they still want to stay at our hotel. They must think our hotel is easy to exploit.”<br/><br/>The pair stood at the entrance of the hotel, looking wretched and extremely angry.<br/><br/>In a furious voice, Ren YingYing said to Chen Hao, “Brother Hao, call that stupid woman again. She secretly cancelled our room. We must teach her a lesson and make her remember that she will always be our slave. Whenever we want her to go east, she dares not go west. She thinks she is something because she has some money. Even if she has money, she is still a slave following us.”<br/><br/>Chen Hao dialed the number, but the call was always busy.<br/><br/>It was obvious that they had been blacklisted.<br/><br/>Chen Hao said with a dark face, “My phone number might have been blacklisted by her. Try yours.”<br/><br/>Ren YingYing took out her phone, but the result was the same, being blacklisted as well.<br/><br/>Ren YingYing hated it and said, “This bitch dares to blacklist us.” But she couldn’t help feeling a wave of panic in her heart.<br/><br/>This was too unexpected.<br/><br/>If they lose their cash cow Lu Xiangxiang, their quality of life will undoubtedly decline in the future. Moreover, once they return to school, many people they had bullied will retaliate.<br/><br/>Ren YingYing reluctantly said, “Brother Hao, we must find that bitch. After we make her suffer, we will continue to use her as our ATM and a slave who serves us.”<br/><br/>Chen Hao, however, was worried, “YingYing, will she escape our control?”<br/><br/>Ren YingYing confidently replied, “No, the hypnosis master I found is very powerful. He said that as long as we hypnotized her once and continuously brainwashed her, she would become an obedient puppet.”<br/><br/>Speaking of this, she gritted her teeth and said, “In order to hypnotize her, we paid a great price.” Besides a huge sum of money, she even sacrificed herself.<br/><br/>It’s not long since Lu Xiangxiang broke out of their cage – how could she be willing to let go?<br/><br/>She hasn’t exploited her enough yet.<br/><br/>Lu Xiangxiang was carefully selected by her.<br/><br/>Chen Hao wondered, “Why did she change after coming to Xiao Family Village?”<br/><br/>Ren YingYing didn’t want to think too much and said, “That bitch must still be in Xiao Family Village. She got lucky and was chosen, thinking she could get rid of us. Dream on. Let’s go, Brother Hao, let’s find her directly.”<br/><br/>On the other side, Lu Xiangxiang was obviously in a better mood, more lively, and soon became good friends with Fang Jingjing without talking much.<br/><br/>When they arrived at the cafeteria, they saw the great beauty mentioned on the internet.<br/><br/>“Wow, she’s so beautiful!” Lu Xiangxiang widened her eyes as she looked at the beautiful Xiao’s mother, full of admiration.<br/><br/>Fang Jingjing, who was always known as the campus belle, also gaped in awe, “Wow, she’s so stunning. She’s the epitome of ‘nationally stunning beauty’.”<br/><br/>This campus belle was nothing in front of the great beauty.<br/><br/>As she said this, she took another look and said, “Xiangxiang, don’t you think this great beauty looks somewhat similar to our Chairman?”<br/><br/>The auntie nearby who was collecting dishes heard this and laughed, “Of course they look alike; they are mother and daughter.”<br/><br/>“Huh?” Lu Xiangxiang and Fang Jingjing were really surprised, “So they are mother and daughter, no wonder they are both so beautiful.”<br/><br/>The auntie smiled and said, “Isn’t it? Xiaofang and her daughter are both famous beauties mentioned online.”<br/><br/>“Haha, like mother, like daughter!” Fang Jingjing laughed, “Auntie, I heard that the food in this cafeteria is delicious. Can you recommend some dishes for us to try first?”<br/><br/>Fang Jingjing was a social butterfly; she had a sweet mouth wherever she went.<br/><br/>The auntie said, “Every dish here is made by the chef who specializes in it. You can eat anything you want. But there is one dish made by Xiaofang herself; you should try that first.”<br/><br/>“Oh, which dish is made by the great beauty?” Fang Jingjing asked.<br/><br/>The auntie replied, “Chive dumplings. The filling is prepared by Xiaofang herself, and the taste is quite unique. Let me tell you, whenever Xiaofang makes any dish, we in Xiao Family Village will finish it all, only leaving a little bit occasionally. There’s just a little bit left now, which should be enough for both of you.”<br/><br/>Fang Jingjing’s eyes lit up, and she immediately said, “Thank you, Auntie. We will try the delicious food made by the great beauty.”\t\t\t\t\t\t</div>", "images": {}, "success": true}