{"id": 401, "url": "https://www.novelhall.com/the-lucky-star-blessing-the-whole-village-32483/15193493.html", "title": "Chapter 401 - Chapter 401: Chapter 392:", "volume": 5, "volume_title": "Volume 5", "body": "<h1>Chapter 401 - Chapter 401: Chapter 392:</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 401: Chapter 392:<br/><br/>Ren Yingying and Chen Hao are just ordinary people who have just arrived in Xiao Family Village and have no idea what kind of reputation Xiao Jinli has.<br/><br/>Calling Jinli a cheap person?<br/><br/>“Smack”<br/><br/>Ren Yingying’s face was slapped by someone.<br/><br/>Well, it wasn’t Jinli who did it.<br/><br/>It was Xiao Chunjing, a villager from Xiao Family Village.<br/><br/>He was working in the cafeteria. Seeing that there was a dispute here, he came over, fearing that a conflict might arise and it would be bad if someone got hurt.<br/><br/>Later, Xiao Jinli appeared, indicating that this matter was not simple. Villagers working in the cafeteria gathered around to protect Jinli’s safety.<br/><br/>Well, even though Jinli was strong and didn’t need anyone’s protection, they would still instinctively protect her.<br/><br/>Unexpectedly, Jinli was scolded by someone.<br/><br/>How could this happen?<br/><br/>Just like Jinli herself said, no one had ever called her a cheap person from childhood till now.<br/><br/>How could they allow others to scold Jinli?<br/><br/>Xiao Chunjing shouted angrily, “Jinli is our Xiao Family Village’s treasure. How dare you scold our Jinli on our Xiao Family Village’s territory? Where did you get the courage from?”<br/><br/>“Exactly, our Jinli just exposed your true nature of harming others, and you still have the shamelessness to scold others.”<br/><br/>“Young lady, you look young and beautiful. How can you have such poisonous mouth and evil heart?”<br/><br/>“Hmph, hitting you is too light. Who told you to be so cheap-mouthed? At such a young age, not doing proper things and specializing in crooked ways, you’re simply born evil.”<br/><br/>…<br/><br/>The people of Xiao Family Village are biased.<br/><br/>Especially when their village treasure is bullied, they must protect her.<br/><br/>Ren Yingying covered her slapped face, and saw that everyone was protecting Xiao Jinli, she was both angry and furious.<br/><br/>At this moment, she foolishly said, “If it weren’t for her meddling, would I scold her? And you hit me; I’m going to call the police?”<br/><br/>Xiao Chunjing was not afraid at all. He nodded and said, “You want to call the police, right? Then go ahead. I’d like to see whether the government officials would arrest you, the cruel person who harmed others, or me, the person who slapped you lightly.”<br/><br/>Reminded by him, Ren Yingying hesitated again.<br/><br/>She couldn’t fight these people, both angry and furious. She turned around and complained to Chen Hao with a grievance, “Brother Hao, they are bullying us too much. Wuu…”<br/><br/>Chen Hao was even more furious, but he didn’t dare to mess with the people of Xiao Family Village, so he picked on the easy target and yelled at Lu Xiangxiang, “Lu Xiangxiang, we have been boyfriend and girlfriend for so long, and you’ve been close friends with Yingying for so long too. Are you really going to watch us being bullied by these people?”<br/><br/>When he said this, Lu Xiangxiang almost burst into laughter.<br/><br/>Chen Hao really thought she was still the Lu Xiangxiang who used to be at his beck and call.<br/><br/>Lu Xiangxiang sneered, “Hehe, so funny. Wasn’t it you guys who bullied others first? You think you can scold Miss Xiao and not allow her to fight back? Who do you think you are, the Emperor? Chen Hao, Ren Yingying, I think it’s time for you to wake up from your beautiful dream. If you know what’s good for you, apologize to Miss Xiao and get the hell out of Xiao Family Village!”<br/><br/>Chen Hao’s face darkened, and he gritted his teeth, “Fine, very ruthless, Lu Xiangxiang. In the future, even if you kneel down and beg me to get back together, I won’t agree.”<br/><br/>Fang Jingjing looked speechless and said loudly, “How big of a face do you think you have? Your girlfriend was originally obtained by stealing and cheating, right? Tsk tsk, I’ve really broadened my horizons today, witnessing such a shameless couple.”<br/><br/>“You…,” Chen Hao was at a loss for words to refute.<br/><br/>“What ‘you’?” Fang Jingjing said coldly, “I’m not the easy-to-bully Lu Xiangxiang. If you know what’s good for you, take your woman and get out.”<br/><br/>Xiao Jinli said, “They can’t leave now. They scolded me, and how can they just roll out of Xiao Family Village? Isn’t that making me lose face? Anyway, anyone who sees me has to call me Miss Xiao.”<br/><br/>Ren Yingying’s face changed and she asked, “What…what do you want?”<br/><br/>“I don’t want anything. I just don’t like being scolded by others,” Xiao Jinli said with an indifferent expression, but her aura could not be ignored, “So when someone scolds me, I must take revenge a hundred times over. How about this: you slap yourself while saying, ‘I am a cheap person.’ Slap yourself a hundred times and say ‘I am a cheap person’ a hundred times, and I will let you go. How about it?”<br/><br/>Ren Yingying’s face turned pale, and she looked around at the unfamiliar faces, none of whom were willing to help her.<br/><br/>But how could she willingly let others bully her? She said, “You are illegally imprisoning and abusing me. This is against the law. I’ll call the police. I want to leave here, Brother Hao, let’s get out of here.”<br/><br/>With that, the two of them tried to leave.<br/><br/>But there were people all around, and no one would let them through, making it impossible for them to leave.<br/><br/>Their faces grew uglier.<br/><br/>Xiao Jinli laughed, “Am I illegally imprisoning you? I haven’t restricted your freedom, have I? I’m abusing you, but isn’t it you who hit yourself?”<br/><br/>“You…,” Ren Yingying’s face turned blue and white with anger.<br/><br/>In Xiao Family Village, surrounded by villagers, how could they leave?<br/><br/>Chen Hao shouted angrily, “Don’t push people too far!”<br/><br/>Xiao Jinli shrugged her shoulders nonchalantly, “So what if I push people too far? If you have the guts, bite me.”<br/><br/>Chen Hao, “…” This was the first time he had seen someone so confidently boastful about bullying others.<br/><br/>The villagers and employees of Xiao Family Village said, “Humph, it’s you who bullied people too far in the first place. Our Jinli, who isn’t treated like a treasure in everyone’s hands, but you guys start off by cursing her. Are we dead?”<br/><br/>“Hurry up and slap yourself, and call yourself a cheap person. We will generously send you out of Xiao Family Village, and we won’t welcome people like you back in the future.”<br/><br/>Chen Hao and Ren Yingying were surrounded by everyone.<br/><br/>Some people were taking videos, waiting to post them out later, thinking that it would bring in a lot of traffic.<br/><br/>Xiao Family Village, with their majority, bullied foreign tourists. No, they bullied job applicants.<br/><br/>Xiao Family Village, which everyone saw as a fairyland, had become a place of bullying.<br/><br/>…<br/><br/>In short, those eye-catching headlines had all been thought of, and they were just waiting for the material.<br/><br/>It’s just that they had forgotten that anything with Xiao Jinli in it would disappear without a trace when it got out.<br/><br/>Moreover, they would not allow people to misunderstand Xiao Family Village by distorting the truth and tarnishing its reputation.<br/><br/>Ren Yingying and Chen Hao were surrounded by everyone with ugly faces.<br/><br/>However, they were still unwilling to admit their mistakes and compromise. So they pinned their hopes on Lu Xiangxiang once again.<br/><br/>Ren Yingying pretended to be innocent and said, “Xiangxiang, are you really going to be so heartless? Letting outsiders bully us, does that make you happy?”<br/><br/>Upon hearing this, Fang Jingjing wanted to get angry and scold them but was stopped by Lu Xiangxiang. She said, “I’ll handle my own affairs.”<br/><br/>Then Lu Xiangxiang said, “Don’t you know who bullied whom first? Hurry up and do what you should do, and then get lost.”<br/><br/>In the end, Ren Yingying and Chen Hao could only slap themselves and call themselves cheap before they left in embarrassment.\t\t\t\t\t\t</div>", "images": {}, "success": true}