{"id": 409, "url": "https://www.novelhall.com/the-lucky-star-blessing-the-whole-village-32483/15193501.html", "title": "Chapter 409 - Chapter 409: Chapter 400:", "volume": 5, "volume_title": "Volume 5", "body": "<h1>Chapter 409 - Chapter 409: Chapter 400:</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 409: Chapter 400:<br/><br/>After breakfast at home, Xiao Jinli leisurely left the house with Jiang Yifan.<br/><br/>As soon as they stepped out of the security zone, they were stopped by a woman.<br/><br/>Xiao Jinli slightly furrowed her brows.<br/><br/>Jiang Yifan raised his head, looked at Liang Shanshan, and asked in confusion, “Auntie, who are you, and why are you stopping Mommy and I?”<br/><br/>Liang Shanshan scanned Jiang Yifan briefly before focusing her attention on Xiao Jinli.<br/><br/>“You are Xiao Jinli?” Liang Shanshan asked in an arrogant and condescending tone.<br/><br/>After settling down at Li Minxing’s house yesterday, she had learned about Miss Xiao’s identity.<br/><br/>“I am Xiao Jinli,” Xiao Jinli replied politely but with distance, “May I ask who you are, Miss, and why are you stopping me?”<br/><br/>Liang Shanshan sized up Xiao Jinli, a flash of intense jealousy in her eyes.<br/><br/>Xiao Jinli was just too beautiful. Her face was devoid of makeup but appeared as if it had been meticulously done up, her features were delicate, her skin smooth and white as jade, flawless, and her figure tall and perfect with a golden ratio that could outshine even top models.<br/><br/>In the past, Liang Shanshan had considered herself the most beautiful.<br/><br/>However, when compared to Xiao Jinli’s naturally stunning beauty, she realized that her own charm was built upon layers of luxury brands, cosmetic surgeries, high-end makeup, and luxury clothing and jewelry.<br/><br/>Quickly hiding her jealousy, Liang Shanshan spoke arrogantly, “I am Liang Shanshan, Su Yichen’s friend. However, in the Capital Circle, many people say we are a perfect golden couple.”<br/><br/>She didn’t directly state that she was Su Yichen’s girlfriend, but instead claimed it based on others’ compliments.<br/><br/>This introduction was a direct provocation to Xiao Jinli while also telling her that Liang Shanshan and Su Yichen were a couple highly looked upon by everyone.<br/><br/>“And then?” Xiao Jinli asked indifferently, “Why are you looking for me?”<br/><br/>Liang Shanshan became somewhat unhappy, her face full of doubt as she looked at Xiao Jinli, not sure if she was genuinely clueless or just pretending.<br/><br/>She frowned slightly and said, “Why else? Don’t you think you should keep your distance from Su Yichen?”<br/><br/>Upon hearing this, Jiang Yifan immediately retorted with his childish voice, “Auntie, are you out of your mind? On what grounds do you ask my mom to maintain her distance from Uncle Su? Who are you to us, no, who are you to Uncle Su?”<br/><br/>Liang Shanshan was obviously unhappy being rebuffed by a child, but seeing him call Xiao Jinli “Mommy”, her face immediately showed a mocking and disdainful expression. She sneered, “On what grounds? What right does a woman with a child have to marry an eligible bachelor like Su Yichen? Are you expecting him to become a stepfather?”<br/><br/>Continuing, she sarcastically remarked, “Haha, you don’t seem that old, and yet your child is already so big. How shameless.”<br/><br/>Jiang Yifan wanted to argue, but Xiao Jinli interrupted him.<br/><br/>Xiao Jinli coldly said, “Miss Liang, please get it straight. First, Su Yichen and I have been friends since childhood. Second, he is the one pursuing me. Third, he does not despise me for having a child. Therefore, there is no need for Miss Liang to worry about it.”<br/><br/>With that said, she took Jiang Yifan and left directly.<br/><br/>Watching their receding figures, Liang Shanshan clenched her teeth in anger.<br/><br/>What right did that woman have to be so self-righteous? She was clearly a shameless and unmarried woman who had become pregnant prematurely.<br/><br/>It seemed that Liang Shanshan had not yet gathered comprehensive information about Xiao Jinli from the Li Family.<br/><br/>Jiang Yifan was not even Xiao Jinli’s biological son.<br/><br/>Liang Shanshan clenched her fists, gritting her teeth and saying, “Xiao Jinli, no matter how beautiful you are, you are still a second-hand good. So the woman who deserves to be with Su Yichen can only be me!”<br/><br/>She did not feel embarrassed when saying this, despite having been involved with countless men in the capital city.\t\t\t\t\t\t</div>", "images": {}, "success": true}