{"id": 404, "url": "https://www.novelhall.com/the-lucky-star-blessing-the-whole-village-32483/15193496.html", "title": "Chapter 404 - Chapter 404: Chapter 395:", "volume": 5, "volume_title": "Volume 5", "body": "<h1>Chapter 404 - Chapter 404: Chapter 395:</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 404: Chapter 395:<br/><br/>Manager Li listened to Xiao Yucheng’s instructions and told the receptionist to reveal Su Yichen’s information.<br/><br/>When Liang Shanshan came out in the lobby, the receptionist stopped her and said with a smile, “Miss Liang, does your offer from this morning still stand?”<br/><br/>Upon hearing this, Liang Shanshan raised an eyebrow and appeared disdainful. She calmly replied, “Of course.”<br/><br/>She knew this information could be bought with money.<br/><br/>The receptionist looked around and whispered to Liang Shanshan, “Miss Liang, let’s talk over there.”<br/><br/>The receptionist pulled Liang Shanshan to a corner, hesitated and nervously said, “Miss Liang, if I tell you Mr. Su’s information, will you really give me 20,000 yuan?”<br/><br/>“Of course!” Liang Shanshan replied with a contemptuous look.<br/><br/>With determination, the receptionist revealed, “Actually, Mr. Su is not staying at the hotel!”<br/><br/>“Su Yichen isn’t staying at the hotel?” Liang Shanshan asked with slight surprise, “Then where is he staying?”<br/><br/>“Miss Liang,” the receptionist gestured, implying that Liang Shanshan should pay up first.<br/><br/>Liang Shanshan said, “Give me your account number, and I’ll transfer the money to you immediately.”<br/><br/>The receptionist provided the account number, and within two minutes, the receptionist received a bank deposit notification.<br/><br/>Upon seeing the money deposited, the receptionist’s face immediately displayed satisfaction. She said, “Mr. Su is not staying at the hotel. He’s staying at Miss Xiao’s house.”<br/><br/>“Which Miss Xiao?” Liang Shanshan asked in confusion.<br/><br/>“Hmm, there are many people surnamed Xiao in Xiao Family Village, but in the entire village, there’s only one person called Miss Xiao,” the receptionist said, “Walk straight from the hotel entrance, take the second fork in the road, and continue… ”<br/><br/>The receptionist described Xiao Jinli’s address.<br/><br/>Liang Shanshan asked with confusion, “Why is he staying at Miss Xiao’s house?”<br/><br/>The receptionist appeared surprised, “Don’t you know? Mr. Su is pursuing Miss Xiao.”<br/><br/>“So called getting the moon first by staying by the water, Mr. Su is living directly in Miss Xiao’s house.” After saying this, the receptionist realized she had said too much, hastily covered her mouth, and said nervously, “I’m sorry, Miss Liang. I have to go back to work now.”<br/><br/>With that, she hurriedly left.<br/><br/>“Miss Xiao?” Liang Shanshan recalled what her father had said before: Su Yichen had confessed his feelings to a girl from Xiao Family Village.<br/><br/>Could that girl be Miss Xiao? And she was from Xiao Family Village?<br/><br/>On Liang Shanshan’s beautiful and delicate face, a confident and victorious smile appeared.<br/><br/>Disdainfully she said, “I don’t care if it’s Miss Xiao or Miss (获小) Huo, Su Yichen can only belong to me, Miss Liang. Hmph… No one can steal the man I set my sights on.”<br/><br/>From childhood till now, she had never been disappointed in obtaining what she wanted.<br/><br/>Now it was the same for men.<br/><br/>Upon learning Su Yichen’s exact whereabouts, Liang Shanshan was in no hurry.<br/><br/>Anyway, this man will be hers sooner or later. He can’t escape.<br/><br/>Liang Shanshan thought for a moment and took the elevator upstairs.<br/><br/>After her figure disappeared, the receptionist’s greedy face changed and she said worriedly to Manager Li beside her, “Manager, is it really okay for me to sell Mr. Su and Miss Xiao’s information like this? And who should I give these 20,000 yuan to? I don’t want to lose my job by taking advantage of this.”<br/><br/>Although she was a receptionist, her salary was not low.<br/><br/>She earned tens of thousands of yuan per month.<br/><br/>If she lost this job, it would be difficult to find another one like this.<br/><br/>Manager Li patted her shoulder and said with a smile, “Don’t worry, we’re just following orders. The president said to give Miss Xiao a sense of crisis. You know, everyone in the whole Xiao Family Village wants Mr. Su and Miss Xiao to be together. All of them think that only the young and talented wealthiest person, Mr. Su, is barely good enough for Miss Xiao. Although Miss Xiao and Mr. Su have been close childhood friends, it seems that she hasn’t accepted his confession yet.”<br/><br/>The receptionist understood immediately.<br/><br/>However, she still had some worries in her heart, “This Miss Liang looks quite beautiful and innocent, can she successfully snatch Mr. Su away?”<br/><br/>Manager Li said with amusement, “If Mr. Su can be easily seduced and taken away by others, he’s not worthy of a divine beauty like Miss Xiao.”<br/><br/>The receptionist nodded thoughtfully, “You’re right. If one can’t resist temptation before marriage, the marriage itself will just turn into a harem. The fairy-like Miss Xiao surely can’t be with such a man. She must be with the best man in the world, just barely good enough for her.”<br/><br/>After going upstairs, Liang Shanshan applied light makeup, put on a conservative white dress, let her long black hair fall loosely, and her pretty face made her look pure and stunning.<br/><br/>Then, she dragged a suitcase and left her room.<br/><br/>The receptionist asked her, “Miss Liang, are you checking out?”<br/><br/>Of course, it wasn’t her who booked the room, so she was just staying there temporarily.<br/><br/>However, since she was leaving, the receptionist had to ask.<br/><br/>Liang Shanshan coldly replied, “No!”<br/><br/>She just wanted to act pitiful in front of Su Yichen. If he had a soft heart, he would surely arrange a room for her.<br/><br/>But everyone in the Capital City knew that Su Yichen was a cold-hearted man who didn’t have any interest in women.<br/><br/>Although she had met him a few times, they weren’t very familiar with each other. She knew him, but he didn’t know her.<br/><br/>Just in case Su Yichen didn’t care about her, she still had a backup plan.<br/><br/>The receptionist reminded her, “Miss Liang, there’s only one more night left for your room. It might cause some trouble for you afterwards…”<br/><br/>To find another hotel.<br/><br/>Liang Shanshan’s face darkened, “I know. I don’t need your reminder.”<br/><br/>In her heart, she planned to buy another night from whichever guest happens to be there the following night.<br/><br/>Liang Shanshan approached a man in a cap with the Xiao Family Village Estate logo and asked, “Excuse me, which way is Miss Xiao’s house?”<br/><br/>She was looking for Su Yichen.<br/><br/>But directly asking for Su Yichen would raise too much suspicion, and she didn’t know if others would tell her.<br/><br/>“You’re looking for Miss Xiao?” Xiao Chunming looked at Liang Shanshan suspiciously, “Who are you? What do you want with her?”<br/><br/>Liang Shanshan replied arrogantly and indifferently, “I’m her friend.”<br/><br/>Xiao Chunming could tell that she was lying just from her attitude.<br/><br/>Jinli would never be friends with such an arrogant and seemingly insincere woman.<br/><br/>Xiao Chunming coldly said, “If you’re her friend, call her. Don’t ask me.”<br/><br/>With that, he ignored Liang Shanshan and continued with his work.<br/><br/>Liang Shanshan stamped her foot in anger.<br/><br/>Subsequently, she asked several people, but whenever she claimed to be Miss Xiao’s friend, no one would pay her any attention, which infuriated her.<br/><br/>She realized that everyone here was very protective of Miss Xiao.<br/><br/>She eventually wised up and stopped asking about Miss Xiao, but instead followed the receptionist’s directions and found the Xiao family’s house directly.\t\t\t\t\t\t</div>", "images": {}, "success": true}