{"id": 406, "url": "https://www.novelhall.com/the-lucky-star-blessing-the-whole-village-32483/15193498.html", "title": "Chapter 406 - Chapter 406: Chapter 397:", "volume": 5, "volume_title": "Volume 5", "body": "<h1>Chapter 406 - Chapter 406: Chapter 397:</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 406: Chapter 397:<br/><br/>Liang Shanshan had anticipated Su Yichen’s rejection.<br/><br/>After all, Su Yichen’s indifference to women was well-known in Capital City.<br/><br/>Although she was beautiful, she had seen Su Yichen several times before, but his eyes never lingered on her.<br/><br/>She was just trying her luck this time.<br/><br/>But with Su Yichen, she acted weak and polite; towards the two security guards, especially the ones urging her to leave, her face was rather ugly.<br/><br/>Liang Shanshan held back her anger and said, “You don’t need to rush me, I’ll leave on my own.”<br/><br/>The key now was to find out who Su Yichen had confessed his feelings to.<br/><br/>It was said that she was a girl from the Xiao Family Village, and the receptionist said that Su Yichen was pursuing Miss Xiao.<br/><br/>There was only information about Su Yichen’s confession on the internet, but no videos or pictures.<br/><br/>Liang Shanshan pulled her suitcase and walked back.<br/><br/>Upon arriving at the hotel, Liang Shanshan went to the front desk for more information.<br/><br/>However, this time she couldn’t get any information about Miss Xiao from the receptionist.<br/><br/>But the receptionist told her, “Speaking of Miss Xiao, she is the most beautiful girl in our Xiao Family Village, oh no, she should be the most beautiful girl in the world with a face like a fairy. Moreover, Miss Xiao is very gentle and kind to everyone. We all like Miss Xiao.”<br/><br/>Liang Shanshan, “…”<br/><br/>So, the information she got was that Miss Xiao was a very beautiful girl.<br/><br/>Humph, how beautiful could she be? Was she more beautiful than herself?<br/><br/>She was known as the number one beauty in Capital City. Even Zhou Bingbing, the number one beauty in the entertainment circle, was only worth seventy percent of her beauty.<br/><br/>Liang Shanshan asked patiently, “Where can I find Miss Xiao?”<br/><br/>The receptionist asked with a puzzled face, “Miss Liang, why are you looking for Miss Xiao? Do you know Miss Xiao? Or do you have something to ask Miss Xiao? If you have something to ask, just tell me, and I’ll make an appointment for you, okay?”<br/><br/>Hearing this, Liang Shanshan became a little unhappy and said, “Do I need an appointment to meet Miss Xiao?”<br/><br/>The receptionist answered naturally, “Of course. Our Miss Xiao is very busy every day, and she has a lot of things to do. We usually don’t disturb Miss Xiao unless it’s a very important matter.”<br/><br/>Liang Shanshan asked angrily, “May I ask what kind of important figure Miss Xiao is in your company?”<br/><br/>“The Chairman!” The receptionist replied without thinking.<br/><br/>However, after realizing her mistake, she immediately covered her mouth, glanced around to make sure no one had noticed, and breathed a sigh of relief.<br/><br/>“…” Liang Shanshan exclaimed surprisingly, “What? Miss Xiao is the Chairman of your hotel?” No, she was the Chairman of the Lu Xian Group.<br/><br/>The Xiao Family Village Hotel was under the Lu Xian Group.<br/><br/>The receptionist covered her mouth and didn’t want to say more, “Miss Liang, I’m sorry. If you need to see Miss Xiao, please leave your phone number, and we’ll pass it on for you! If you want to see Miss Xiao directly, it might be a bit inconvenient!”<br/><br/>If it wasn’t for the orders from above, she wouldn’t divulge any information about Miss Xiao.<br/><br/>Liang Shanshan, “…”<br/><br/>She thought about it and tried her trick again, “I’ll be very grateful if you tell me everything about Miss Xiao.”<br/><br/>She seemed to unconsciously raise five fingers, and with the other hand, she unconsciously wrote the word “ten-thousand” on the table.<br/><br/>That meant that she could get fifty thousand yuan for telling her about Miss Xiao.<br/><br/>However, the receptionist laughed and said, “Miss Liang, if you really want to see Miss Xiao, please leave your phone number and we’ll make an appointment for you.”<br/><br/>What a joke, fifty thousand yuan for finding out about Miss Xiao? No, no matter how much money was offered, it wouldn’t be possible to buy any information about Miss Xiao.<br/><br/>Seeing the receptionist’s reaction, Liang Shanshan thought she didn’t offer enough, so she doubled the offer.<br/><br/>But the receptionist pretended not to understand.<br/><br/>When the price increased to three hundred thousand, the reaction of the receptionist remained the same. Liang Shanshan thought that the other party was too greedy.<br/><br/>After thinking about it, she decided that she would still have to stay in Xiao Family Village for a while, so she had plenty of time.<br/><br/>She could find out for herself.<br/><br/>Now she knew a critical piece of information, that Miss Xiao was actually the Chairman of the Lu Xian Group.<br/><br/>This surprised her a lot.<br/><br/>The Chairman of the Lu Xian Group was always a mysterious figure to the outside world.<br/><br/>In the leadership structure of the Lu Xian Group, the only thing missing was an introduction to the Chairman.<br/><br/>Back in her room, Liang Shanshan wore a white silk sleeping robe, swinging the red wine in her hand, her face showing a playful smile, and she chuckled softly, “How interesting! The Chairman of the Lu Xian Group is a woman named Miss Xiao. I want to see what Miss Xiao’s true face looks like.”<br/><br/>She now felt challenged.<br/><br/>It was not only the desire to conquer Su Yichen but also the urge to snatch someone from the hands of the Chairman of the Lu Xian Group.<br/><br/>After a while, there was a knock on the door.<br/><br/>After opening the door, the room manager politely said, “Miss Liang, your time in this room ends at 12 o’clock tonight. The next guest is already waiting in the resting hall. There are still four hours till 12 o’clock, so please cooperate when the time comes.”<br/><br/>Many guests didn’t want to check out when it came to the scheduled time and wanted to extend their stay, but the hotel’s policy was no extensions, and changes were not possible, so some customers would create a fuss.<br/><br/>Liang Shanshan’s face darkened and she said coldly, “Alright, I know.”<br/><br/>Just as the room manager was about to leave, Liang Shanshan asked again, “What’s the next guest’s name? Can you help me contact that guest?”<br/><br/>The receptionist smiled and refused, “I’m sorry, Miss Liang. Our hotel has a policy to protect customer information. I’m afraid I can’t help you with that.”<br/><br/>Liang Shanshan’s face darkened again, and she said disdainfully, “I won’t let you help for nothing. How about I give you this amount? Just like before.”<br/><br/>She held up two fingers, meaning twenty thousand yuan.<br/><br/>The receptionist’s heart trembled.<br/><br/>It was such a test of self-control.<br/><br/>Just now, the price was three hundred thousand, and now it was twenty thousand.<br/><br/>Anyone slightly greedy would probably be tempted.<br/><br/>Of course, she was a foodie, and no matter how greedy she was, she couldn’t enjoy delicious food more.<br/><br/>If she took the three to four hundred thousand, she wouldn’t be able to enjoy a bite of Xiao Family Village Cafeteria’s delicious food ever again, especially the food made by Miss Xiao’s mother.<br/><br/>On the other hand, the money was quite a lot, but it was only worth one or two years of her salary.<br/><br/>If she took the three hundred thousand, she would lose her job, and she might never find such a good job again, with high salary and good welfare. Most importantly, she wouldn’t be able to enjoy delicious food.<br/><br/>The receptionist took a deep breath and politely refused, “I’m sorry, Miss Liang, our company policy is our policy.”<br/><br/>Liang Shanshan frowned and said displeasedly, “Some things, once they have passed, can’t be taken back.” Her point was to tell the receptionist not to be too greedy.<br/><br/>It was just giving some information to a customer, twenty thousand yuan was already top-notch.<br/><br/>The receptionist couldn’t help but roll her eyes after hearing this.<br/><br/>She firmly and politely shook her head and said, “Miss Liang, the company’s rules are the rules. I’m sorry I can’t help you.”<br/><br/>After saying that, she left.\t\t\t\t\t\t</div>", "images": {}, "success": true}