{"id": 400, "url": "https://www.novelhall.com/the-lucky-star-blessing-the-whole-village-32483/15193492.html", "title": "Chapter 400 - Chapter 400: Chapter 391:", "volume": 4, "volume_title": "Volume 4", "body": "<h1>Chapter 400 - Chapter 400: Chapter 391:</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 400: Chapter 391:<br/><br/>Everyone followed the sound.<br/><br/>It turned out to be the beautiful interviewer.<br/><br/>Xiao Jinli walked over gracefully, her whole demeanor cold and sharp.<br/><br/>She stood in front of Lu Xiangxiang and asked with a slightly serious expression, “I know why you’re like this. Do you want to know the reason?”<br/><br/>Lu Xiangxiang asked eagerly, “Isn’t it because I’m ugly and stupid?”<br/><br/>“Pfft!” Fang Jingjing laughed and said, “Xiangxiang, you silly girl. Miss Xiao just said earlier that you are a smart and hardworking kid. How did you suddenly become ugly and stupid? It seems like your brainwashing isn’t working very well.”<br/><br/>They were reminded that they could call Xiao Jinli Miss Xiao or directly call her by her name.<br/><br/>Lu Xiangxiang thought about it and admitted, “It is true.<br/><br/>Actually, even now I can’t remember how I became boyfriends and girlfriends with this scumbag, or how I became close friends with this woman?<br/><br/>It felt like I had been cursed, willingly and selflessly devoted to them, and took their words as the gospel, which made me fall into self-doubt.<br/><br/>Miss Xiao, you mentioned that you know the reason; please let me know!”<br/><br/>Xiao Jinli turned around, her beautiful eyes and sharp gaze lightly swept over the two, and the corners of her mouth revealed a hint of mockery,<br/><br/>“Xiangxiang, although you haven’t been cursed, it’s almost the same. Because you were hypnotized by someone.”<br/><br/>“What?!”<br/><br/>Upon hearing this, not only Lu Xiangxiang but also the others were shocked.<br/><br/>“Hypnotized by someone?”<br/><br/>Someone exclaimed, “What kind of hypnotism is so powerful that it can make people do whatever they say, as if they were cursed?”<br/><br/>At this moment, Lu Xiangxiang also realized that she had been manipulated by them.<br/><br/>Lu Xiangxiang asked sternly, “Is that true?”<br/><br/>When Ren YingYing was exposed by Xiao Jinli, her face turned white in an instant, and she was horrified.<br/><br/>Facing Lu Xiangxiang’s questioning, she shook her head violently,<br/><br/>“No, it’s not like that. Xiangxiang, don’t believe them.<br/><br/>I really wanted to be friends with you, and I didn’t use hypnotism or anything.<br/><br/>We’ve been friends for two years! Do you trust me, or someone you’ve only known for two to three days?”<br/><br/>Lu Xiangxiang already had the answer in her heart.<br/><br/>It turned out that she had been hypnotized, which was why she inexplicably became friends with Chen Hao, the scumbag, and Ren YingYing, the cheap woman.<br/><br/>No wonder they used her as they pleased before, with no trace of friendship, treating her like private property, a servant, and an ATM. Still, even so, she didn’t feel anything was wrong.<br/><br/>But after coming to Xiao Family Village and being pointed out by Fang Jingjing and the others, even she felt it was unbelievable.<br/><br/>She used to have a good personal relationship with friends, classmates, and teachers.<br/><br/>But after getting to know them, it seemed like she was isolated by everyone else, and the only ones she could make friends with were them.<br/><br/>She didn’t even know the reason herself.<br/><br/>Xiao Jinli continued to say to her, “The reason you woke up in Xiao Family Village is that the fresh air of Xiao Family Village activated the hypnotism.”<br/><br/>This explanation made Ren YingYing and Chen Hao understand the root cause immediately.<br/><br/>So that’s how it was.<br/><br/>They wondered how Lu Xiangxiang managed to break free from their control after just one visit to Xiao Family Village.<br/><br/>Ren YingYing deeply regretted it.<br/><br/>If she had known, they would never have come to Xiao Family Village.<br/><br/>They came to Xiao Family Village not only to test if their conditions could be hired as actors for this job.<br/><br/>Their previous plan was that even if they were hired, they would find an excuse to refuse.<br/><br/>But the reason they came was to take advantage of the reputation of the Lu Xian Group in Xiao Family Village. Who didn’t know that the job positions in the Lu Xian Group were hard to come by, and the recruitment process was notoriously strict? But Once hired, the benefits were excellent.<br/><br/>Their goal was one of the top enterprises in Kyoto, especially the Su Corporation, the number one enterprise.<br/><br/>Ren YingYing’s ultimate goal was Su Yichen.<br/><br/>Su Yichen was a handsome young man, and most importantly, he was rich and powerful.<br/><br/>Even if she couldn’t become the main wife, being a mistress or a concubine, the wealth that Su Yichen let slip through his fingers would be enough for her to live a life of luxury and wealth.<br/><br/>As for Chen Hao, his goal was, of course, the Lu Corporation.<br/><br/>As long as he could marry Lu Xiangxiang, the Lu Corporation would be as good as his.<br/><br/>He and Ren YingYing were merely harboring their ulterior motives.<br/><br/>However, they enjoyed playing with Lu Xiangxiang.<br/><br/>Once they were hired by the Lu Xian Group and then rejected by them, they would have a significant advantage when applying for jobs at other companies.<br/><br/>They brought Lu Xiangxiang here for two reasons: one was to show off themselves, the other was to pay for their travel expenses.<br/><br/>Things like staying in hotels, eating meals, and shopping all came out of Lu Xiangxiang’s pocket.<br/><br/>Another purpose for coming to Xiao Family Village was, of course, to enjoy the food and fun at the Xiao Village Farmhouse.<br/><br/>The Xiao Village Farmhouse had a reputation worldwide, and missing out on the opportunity to visit Xiao Family Village would indeed be a great regret.<br/><br/>Now that there was a generous fool to foot the bill, why not enjoy it?<br/><br/>Little did they expect that a trip to Xiao Family Village would be so strange and cause everything to fall apart.<br/><br/>Ren YingYing was extremely annoyed in her heart, her eyes filled with venomous light, staring straight at Xiao Jinli and resentfully saying,<br/><br/>“You, bitch, why do you meddle in other people’s business? We don’t bother each other. With you, we have no reason or hatred. Why do you have to frame us?”<br/><br/>Hearing this, Xiao Jinli sneered, “I’ve lived so long, and this is the first time someone has called me a bitch.<br/><br/>You guys were malicious, trying to control people for your use, and now you want to play the victim and push the blame onto me? I must say, you’re quite bold.”<br/><br/>Xiao Jinli was never someone to be bullied, especially on her own turf.<br/><br/>Ren YingYing had her true face exposed and had nothing to hide. She yelled angrily,<br/><br/>“What right do you have to say that? I’m just making plans for myself. What’s wrong with that? People who don’t act for themselves will be punished by heaven and earth!<br/><br/>Lu Xiangxiang was born wealthy. What’s the problem with her spending a little money on us? We didn’t ask for her life.”<br/><br/>Fang Jingjing and the others were dumbfounded.<br/><br/>She had done such evil things and still had the nerve to be so arrogant. It was really rare to see such a person.<br/><br/>Fang Jingjing was stunned for a moment and then said, “My goodness, this is the first time I’ve seen such a wicked person, and yet they’re so self-righteous.”<br/><br/>Someone else also had their eyes wide open, “My goodness. She’s not that old, but how can she be so calculating and evil-hearted?”<br/><br/>“Absolutely. She hypnotized someone, treated them like a slave, and spent their money. How did she come up with such an idea?”<br/><br/>“Wait a minute. Hypnosis? That’s not something ordinary people can do, especially controlling people’s hypnosis. Does she know hypnotism?”<br/><br/>“No way.”<br/><br/>…<br/><br/>Lu Xiangxiang listened to the murmurs of the crowd and had a guess in her heart.\t\t\t\t\t\t</div>", "images": {}, "success": true}