{"id": 403, "url": "https://www.novelhall.com/the-lucky-star-blessing-the-whole-village-32483/15193495.html", "title": "Chapter 403 - Chapter 403: Chapter 394:", "volume": 5, "volume_title": "Volume 5", "body": "<h1>Chapter 403 - Chapter 403: Chapter 394:</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 403: Chapter 394:<br/><br/>The casting process took three days, and they selected six pairs, six men, six women.<br/><br/>They arranged for these twelve people to work at different times.<br/><br/>For instance, Fang Jingjing and Lu Xiangxiang were still college students, so they could only work during the holidays, making them part-time workers.<br/><br/>The rest were full-time workers.<br/><br/>There were two performances every day.<br/><br/>Now that the cast was chosen, Xiao Jinli handed off the other tasks and didn’t interfere.<br/><br/>However, she had the intention to foster the first four that were picked, so she handed them over to professionals for special training.<br/><br/>As the company chairman, she couldn’t micromanage everything and needed to delegate tasks to others appropriately.<br/><br/>If Xiao Yucheng knew her thoughts, he would probably roll his eyes.<br/><br/>She was nothing like a micromanager, she was more like a hands-off executive.<br/><br/>Of course, they knew that even though Xiao Jinli seemed free, she was actually quite busy, especially with her medical responsibilities, which sometimes kept her rushed off her feet.<br/><br/>Since the hospital could have critically ill patients at any time, Xiao Jinli needed to be there promptly.<br/><br/>However, what Xiao Jinli and Su Yichen were waiting for now was a move from the state of Plum Firm.<br/><br/>At the office place, Xiao Jinli was musing with one hand on her chin and lightly tapping the table with the other, “What’s going on with Plum Firm? You extended an olive branch to them, why haven’t they responded yet? I’m getting a little impatient.”<br/><br/>Especially after hearing from Xu Guochang that Plum Firm would take some action against him, she was expecting them to collaborate with some companies in Dragon State.<br/><br/>But when she was waiting for their next move, there was no news.<br/><br/>Xiao Jinli thought for a while and said, “It seems I should take the initiative. Getting rid of the hazard of Plum Firm as early as possible is the best thing to do.”<br/><br/>Su Yichen laughed and said, “Let’s wait again. Perhaps, my response might trigger them to hatch a bigger conspiracy, which would provide us in Dragon State a good opportunity to crush Plum Firm, wouldn’t it?”<br/><br/>Xiao Jinli thought for a moment again and said, “Alright, I will listen to you and wait a bit longer.”<br/><br/>In the dark, she instructed Xiao Zhi to investigate what was Plum Firm up to.<br/><br/>However, what Xiao Jinli had not anticipated was that – before getting wind of the plot from Plum Firm, a love rival who was not a love rival had come into the picture.<br/><br/>Liang Shanshan came to Xiao Family Village in a hurry, and therefore did not book a room at the Xiao Family Village Hotel in advance.<br/><br/>But she was rich, of course.<br/><br/>She paid ten times the normal rate to make an ordinary guest give up his room.<br/><br/>A standard room cost three hundred yuan a day, ten times the price would be three thousand yuan. As she already had stayed at the Xiao Family Village Hotel for two nights and enjoyed the stay, there was no reason for her to refuse a high asking price equivalent to her monthly salary now.<br/><br/>Three days left, yielding almost ten thousand yuan.<br/><br/>Why wouldn’t she?<br/><br/>But she did not check out of the hotel; she just moved in.<br/><br/>The transaction was between them, and they were adults. The hotel had no right to interfere.<br/><br/>As long as they did not cause trouble in the hotel, the hotel turned a blind eye.<br/><br/>Of course, the transaction duration could only be the time the first guest had booked. Once time was up, regardless of who was inside, they had to check out and let the next reserved guest move in.<br/><br/>These were the rules of the Xiao Family Village Hotel.<br/><br/>For booking the Xiao Family Village Hotel, every guest must reserve a room one month in advance.<br/><br/>What Liang Shanshan wanted was to get into the hotel, and if there was a first person selling a room, there would be a second, so she was not worried.<br/><br/>After all, she had money. She was willing to spend tens of thousands yuan to stay calmly.<br/><br/>Of course, she wanted to live in a better room, but the best rooms in Xiao Family Village Hotel was occupied by the rich who had booked and would not likely sell their rooms as they were not short of money.<br/><br/>Luckily, the standard rooms at Xiao Family Village were quite nice, and even though she looked down upon them, she reluctantly accepted it.<br/><br/>Upon settling in, she began to inquire about Su Yichen’s whereabouts.<br/><br/>At first, she thought Su Yichen was staying at the Xiao Family Village Hotel, and given Su Yichen’s status, she presumed that he would definitely be staying in the best room.<br/><br/>So, she waited nearby, waiting for the opportunity to emerge.<br/><br/>However, after a day passing by, she did not see the person she was looking for.<br/><br/>Then she thought about asking the reception.<br/><br/>However, customer information was confidential, and anyone who wanted to keep their job would not expose customer information.<br/><br/>Liang Shanshan never imagined that while she was inquiring about Su Yichen, Xiao Yucheng would receive the news from the other side.<br/><br/>“You said a woman was inquiring about Su Yichen’s information?”<br/><br/>Xiao Yucheng listened to the hotel manager’s report.<br/><br/>Manager Li nodded, “Yes. And judging by the woman’s accent, she seems to be from the Capital City.”<br/><br/>“Do you know her name?” Xiao Yucheng asked.<br/><br/>“She goes by Liang Shanshan.”<br/><br/>A woman from Capital City inquiring about Su Yichen is likely to have schemed something.<br/><br/>Of course, considering Su Yichen’s status, ordinary girls wouldn’t dare to casually inquire about him.<br/><br/>A young, pretty girl from Capital City came looking for Su Yichen.<br/><br/>A cryptic smile appeared on Xiao Yucheng’s face, “It seems that our little Koi has a love rival!”<br/><br/>Manager Li paused for a moment, “Ha, Miss Xiao’s love rival? Chairman, do you mean that this woman called Liang Shanshan could be Miss Xiao’s love rival?”<br/><br/>Xiao Yucheng nodded, “Yes, that’s highly likely.”<br/><br/>“Ah, should we get this Miss Liang out of here then?” Manager Li asked anxiously, “Miss Xiao has not accepted Mr. Su’s confession yet. Will this woman’s intervention cause Miss Xiao to misunderstand?”<br/><br/>Xiao Yucheng laughed, “A misunderstanding would be good, that’s precisely what we want.”<br/><br/>Everyone saw Xiao Jinli and Su Yichen as a perfect couple.<br/><br/>It’s just that for some reason, his sister is yet to accept Su Yichen’s confession.<br/><br/>In such a case, a catalyst could be of help.<br/><br/>If Su Yichen can resist the temptation and stay true to his heart, then he is worthy of his sister.<br/><br/>Also, it will help Xiao Jinli to realize her true feelings.<br/><br/>Xiao Jinli was so mature, understanding, and obedient that everyone almost forgot that she was a girl. Girls need to fall in love, and they need to get married and have children in the future for a complete life.<br/><br/>Xiao Yucheng said, “Manager Li, come, tell Miss Liang this….”<br/><br/>Xiao Yucheng conveyed a few instructions to Manager Li, and finally reminded him, “This matter must be kept confidential, especially from Miss Xiao.”<br/><br/>After thinking for a bit, he added, “No, the information should reach Miss Xiao.”<br/><br/>Manager Li was slightly astonished, “Chairman, is this… alright?”<br/><br/>Xiao Yucheng affirmed, “Yes, it’s perfectly alright. Go ahead and do as I said.”<br/><br/>Manager Li had to comply, “Yes, chairman!”<br/><br/>Leaving the chairman’s office, he murmured to himself, “Is the chairman really hoping for the best for Miss Xiao?”\t\t\t\t\t\t</div>", "images": {}, "success": true}