{"id": 402, "url": "https://www.novelhall.com/the-lucky-star-blessing-the-whole-village-32483/15193494.html", "title": "Chapter 402 - Chapter 402: Chapter 393:", "volume": 5, "volume_title": "Volume 5", "body": "<h1>Chapter 402 - Chapter 402: Chapter 393:</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 402: Chapter 393:<br/><br/>Lu Zhiqiang called Lu Xiangxiang, his voice full of anger, “Sis, I have the results of the investigation you asked me to conduct. I’ll send them to you later. Chen Hao and Ren Yingying are truly despicable. The truth is indeed as you speculated, they have hypnotized you.”<br/><br/>After Ren Yingying and Chen Hao left Xiao Family Village, Lu Xiangxiang had called Lu Zhiqiang to investigate the two of them.<br/><br/>Soon, the results of the investigation were sent to Lu Xiangxiang.<br/><br/>Looking at these documents, Lu Xiangxiang’s face turned red with anger.<br/><br/>Both of them had come from the countryside, having been exposed to the prosperity of big cities and the luxury goods flaunted by their classmates, gradually eroding their innocence.<br/><br/>They also desired such luxurious lifestyles, yearning for branded clothing, jewelry, and handbags.<br/><br/>However, they had only come from the countryside, where their families had exhausted all their resources to support them. Other than basic living expenses, they simply did not have extra money to indulge in frivolities.<br/><br/>Even when they worked part-time jobs, they hardly earned enough to afford upscale cosmetics.<br/><br/>Consequently, they hatched a plan.<br/><br/>By chance, they met a Hypnosis Master.<br/><br/>The Hypnosis Master claimed he could allow them to live the good life.<br/><br/>Even after using all their resources still wasn’t enough, Ren YingYing offered herself up. The Hypnosis Master then gifted her with a special object and taught her hypnotism.<br/><br/>At first, they targeted many individuals, people with wealth and status. Yet, the effects of their hypnotism were minimal.<br/><br/>They had to consult the Hypnosis Master again, who advised them to seek out individuals with pure and simple personalities for better results.<br/><br/>After careful selection, they gradually oriented their scheme towards Lu Xiangxiang, their dorm mate.<br/><br/>Ren Yingying hadn’t initially viewed Lu Xiangxiang as a target. She presumed Lu Xiangxiang’s family was poor due to her simple clothes, her lack of makeup, and absence of any significant piece of jewelry.<br/><br/>However, during a part-time job at a hotel, Ren Yingying unexpectedly ran into Lu Xiangxiang’s family gathering. The grandiose event and the obsequious manager left her utterly stupefied.<br/><br/>Only later did she hear that the Lu Family was extremely wealthy and influential in Capital City.<br/><br/>Lu Xiangxiang was Miss Lv!<br/><br/>Unsought, her search had ended in an unexpected place with unexpected ease!<br/><br/>Taking advantage of their shared dormitory, Ren Yingying quickly hypnotized Lu Xiangxiang, and the results were remarkably effective.<br/><br/>Subsequently, the unlikely pair, much to the surprise of their other classmates, became inseparable friends.<br/><br/>Then, under Ren Yingying’s introduction, Lu Xiangxiang met Chen Hao. Not long after, Chen Hao confessed his feelings to Lu Xiangxiang, who unwittingly accepted.<br/><br/>Having frequently reinforced her hypnotism on Lu Xiangxiang, Ren Yingying concluded that the timing was right, and gradually revealed her true intentions.<br/><br/>They began using various excuses to wheedle money and make purchases from Lu Xiangxiang’s accounts.<br/><br/>In fear of exposure, they isolated Lu Xiangxiang from her other acquaintances by convincing her that she was ugly and foolish, and unlikable to all. Then, they told the other classmates that Lu Xiangxiang looked down on them and was unwilling to interact with them.<br/><br/>Therefore, besides her nominal boyfriend Chen Hao and Ren Yingying, Lu Xiangxiang had no one else.<br/><br/>Even her good friends were estranged under Ren Yingying’s urging.<br/><br/>After starting university, in an attempt to encourage her independence, Lu Xiangxiang rarely returned home. Her contact with her family was limited to occasional phone calls, or when her family members came to visit her, or when she would occasionally return home.<br/><br/>However, every time Lu Xiangxiang wanted to go home, Ren Yingying would come up with various pretexts to prevent her from leaving.<br/><br/>As a result, Lu Xiangxiang’s strange behavior did seem a little odd to her family members, but they didn’t dwell on it.<br/><br/>They would never have imagined that their beloved daughter had fallen under someone else’s manipulative spell.<br/><br/>When Father Lv found out the truth from his son, he was utterly furious.<br/><br/>“These two vile creatures, daring to victimize my daughter.” Father Lv said angrily, “Alright, alright, this is very good. From now on, if they can still get by in Capital City, I’ll take their last name.”<br/><br/>Then, he gave the order to his son to transfer the results of the investigation to his daughter while preparing for his retaliation against the two culprits.<br/><br/>To him, they were just two insignificant figures, and if he were to retaliate against them, he would not need to lift a finger personally.<br/><br/>But since they had the audacity to bully his daughter, he would take matters into his own hands.<br/><br/>His precious pearl, whom he held in the palm of his hands, had been manipulated into becoming their ATM. On top of that, they had been spreading rumors and slandering his daughter. If he didn’t take revenge, he would dishonor his paternal duty.<br/><br/>Thus, before Chen Hao and Ren Yingying could even return to school, their troubles had already begun.<br/><br/>On their journey back, if they weren’t robbed by thieves, they would be harassed by petty gangsters. When they finally returned to Capital City and arrived back at school in disarray, they were informed that they had been expelled.<br/><br/>Ren Yingying and Chen Hao were completely dumbfounded.<br/><br/>“Why? Why have we been expelled?” Upon hearing of the expulsion, as panic set in, Ren Yingying demanded an explanation.<br/><br/>The Teaching Director looked at them coldly and said, “Why? Don’t you know what you’ve done? How audacious of you to plot against Miss Lv. Now that her father is livid, he’s determined to avenge his beloved pearl. Alright then, since the two of you are no longer students of our school, hurry up and move out.”<br/><br/>He then called over two student council members and pointed at Ren Yingying and Chen Hao, “You two, go help them move out of the dormitory as quickly as possible.”<br/><br/>Ren Yingying stopped him and pleaded, “Director Wang, we were wrong. Please, don’t expel us. We’ve realized our mistake! Please, please…”<br/><br/>Their future would be ruined once expelled.<br/><br/>They would be unable to find good jobs in the future and would be limited to working menial tasks or labor in factories.<br/><br/>This was not the life they’d dreamed of.<br/><br/>Director Wang, irritated, responded, “The decision to expel you couldn’t have been mine. You pleading with me is useless. People like you with malicious intent and corrupt morals – allowing you to stay would tarnish the hundred-year reputation of our school. You two should think about what’s next.”<br/><br/>With that, he prepared to leave.<br/><br/>Ren Yingying, unwilling to give up, tried again to stop him, pleading, “Director Wang, please ask for mercy on my behalf. I know I made a mistake but could you not expel me? Please help me retain my student status. As long as you help me…”<br/><br/>Here she bit her lower lip and with a little embarrassment continued, “I’ll do anything…” This naturally included compromising herself.<br/><br/>On hearing this, Director Wang laughed coldly and said, “Ha ha, Miss Ren, you’re pleading with the wrong person. Let me tell you, the decision to expel came from the school’s highest governing body. You’re under harsh scrutiny, no one is going to save you now. As I said before, you two must face the consequences.”<br/><br/>No one wants to deal with individuals who harbor ambitious aspirations, but are unwilling to work hard and instead resort to malicious tactics.\t\t\t\t\t\t</div>", "images": {}, "success": true}