{"id": 407, "url": "https://www.novelhall.com/the-lucky-star-blessing-the-whole-village-32483/15193499.html", "title": "Chapter 407 - Chapter 407: Chapter 398:", "volume": 5, "volume_title": "Volume 5", "body": "<h1>Chapter 407 - Chapter 407: Chapter 398:</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 407: Chapter 398:<br/><br/>Liang Shanshan’s room was occupied, and the next guest refused to vacate it.<br/><br/>This guest was on vacation with his family.<br/><br/>He had booked the room a month in advance through his secretary.<br/><br/>So, he was not short of money at all.<br/><br/>Hearing that Liang Shanshan was offering money for him to leave the room, his attitude was one of contempt and arrogance, making him laugh in anger.<br/><br/>He sneered and said, “I won’t leave. I had a hard time booking this room, and when the time came, I took my family on vacation here. You think you can just make me leave? Who do you think you are?”<br/><br/>Liang Shanshan’s face darkened as she said, “How much money do you want to leave the room? Is one hundred thousand enough? For an ordinary person like you, one hundred thousand yuan must be your annual salary, right?”<br/><br/>The man waved his hand and said, “I’ve told you, I won’t leave. No matter how much money you offer, I won’t leave. Do you really think that having money makes you great?”<br/><br/>Was he really short of money? No, he just needed a room.<br/><br/>If the Xiao Family Village Hotel had enough rooms, he wouldn’t have to book this ordinary standard room for his family of five.<br/><br/>“Also, please pack up your things as soon as possible and leave.” The man was clearly angry, “I can’t believe you still have the nerve to stay here without packing up. The hotel even said that the guest had already left, so why are you still here?”<br/><br/>He seemed to be talking to himself, but in fact, he was speaking to Liang Shanshan.<br/><br/>It was not really the hotel’s fault.<br/><br/>The hotel had already urged her to pack up and leave, and had even changed her sheets and other supplies. Who would have thought that Liang Shanshan would be so thick-skinned? When the waitress turned her back, she left something in the room and then followed the waitress out with her suitcase.<br/><br/>When the next guest arrived, she used the excuse that she had left something behind to enter the room and then approached the guest.<br/><br/>Hearing this guest’s words that were deliberately intended for her to hear, anger flashed across her face.<br/><br/>Liang Shanshan held back her anger and, with a pale face, left the room.<br/><br/>She couldn’t stay in this room any longer, so she had to find other willing guests to sell their rooms.<br/><br/>However, she couldn’t waste her time looking for rooms all day; she needed someone to help her.<br/><br/>She thought for a moment and called her father.<br/><br/>Upon hearing this, Liang Haohan became somewhat annoyed and said, “So, you didn’t book a hotel room and disturbed your father in the middle of the night?”<br/><br/>Liang Shanshan was also holding back her anger, complaining, “Dad, you don’t know how hard it is to book a room in Xiao Family Village Hotel? After I arrived here, I found someone who was willing to sell their room, and I had to pay ten times the price just to stay for three days. Now I’ve been kicked out and am stranded in the lobby. Do you know how crowded this lobby is? It’s even more crowded than an airport waiting hall.”<br/><br/>Liang Haohan frowned and said, “If there are no rooms in Xiao Family Village Hotel, can’t you find another hotel?”<br/><br/>Liang Shanshan rolled her eyes in the lobby and said, “Dad, haven’t you been to Xiao Family Village? Whether it’s Xiao Family Village Hotel or the surrounding hotels and guesthouses, they all require advance reservations. And the accommodation conditions around the village can’t be compared to Xiao Family Village Hotel.”<br/><br/>Even the ordinary rooms in Xiao Family Village Hotel were so comfortable that Liang Shanshan had to admit it.<br/><br/>It’s hard to transition from luxury to frugality.<br/><br/>After staying so comfortably in Xiao Family Village Hotel, she would definitely be even more picky about other hotels.<br/><br/>“Dad, I want to stay at Xiao Family Village Hotel. You need to find a way for me,” Liang Shanshan said.<br/><br/>Liang Haohan said irritably, “What can I do for you? Xiao Family Village Hotel is not an ordinary hotel. Staying there, whether rich or poor, requires advance reservations. Whoever makes the reservation gets the room. This hotel requires reservations one month in advance. How can I get a room for you with such short notice?”<br/><br/>Liang Shanshan’s eyes shifted and she said immediately, “Dad, why don’t you call Su Yichen and ask him to arrange accommodations for me?”<br/><br/>Liang Haohan said irritably, “Can’t you find him yourself? Didn’t you say that Su Yichen would be your servant? Wouldn’t he help with such a small favor?”<br/><br/>Naturally, Liang Shanshan wouldn’t tell her father about being rejected by Su Yichen.<br/><br/>She sighed softly and said, “Dad, I haven’t found Su Yichen yet. How can I ask for his help?”<br/><br/>Liang Haohan asked suspiciously, “Haven’t you found Su Yichen yet? Isn’t Su Yichen in Xiao Family Village?”<br/><br/>Liang Shanshan said, “He should be in Xiao Family Village, but maybe he’s not staying in Xiao Family Village Hotel. I was refused when I inquired about his whereabouts at the hotel. Even when I offered a high price, people still refused. I can only look for him slowly.”<br/><br/>“Isn’t Xiao Family Village so small that you still need so many days to find him?” Liang Haohan asked suspiciously, “You’ve been there for three days, right?”<br/><br/>“Is Xiao Family Village small?” Liang Shanshan laughed lightly, “But do you know how many tourists come here every day for vacations? Several thousands. How am I supposed to find him? When I tried asking the people who work in Xiao Family Village, they all claimed they don’t know. I’ve been waiting in the hotel for several days and haven’t seen a trace of Su Yichen.<br/><br/>Actually, Xiao Family Village is not small at all. It’s several times larger than Kyoto Botanical Garden.<br/><br/>The hotel is very secretive about customer information. When they asked around the village for Su Yichen, everyone said there was no Su Yichen.”<br/><br/>After listening, Liang Haohan was puzzled, “Has Su Yichen left?”<br/><br/>“No!” Liang Shanshan said confidently, “When I asked the reception for information earlier, they inadvertently said that Mr. Su is pursuing Miss Xiao.”<br/><br/>“Miss Xiao?” Liang Haohan was confused.<br/><br/>“She’s the girl who looks like the one Su Yichen confessed to on the internet. She’s a local of Xiao Family Village. People here call her Miss Xiao,” Liang Shanshan said, “She’s the chairman of the Lu Xian Group.”<br/><br/>“You’re saying the chairman of the Lu Xian Group is a young girl?” Liang Haohan was surprised.<br/><br/>To know that the chairman of Lu Xian Group is definitely not a puppet, but has real power.<br/><br/>It’s said that many of the group’s orders were personally issued by the chairman.<br/><br/>However, the outside world does not know what the chairman of the Lu Xian Group looks like.<br/><br/>Now that they suddenly heard the chairman was a young girl, it felt somewhat unreal.<br/><br/>He asked again, “Are you sure you’re not mistaken?”<br/><br/>Liang Shanshan wanted to roll her eyes as she said, “There’s no way I’m mistaken. When I was inquiring about the news, everyone here was very respectful of the chairman and called her Miss Xiao!”<br/><br/>After listening, Liang Haohan paused for a moment and then said, “Shanshan, it seems you’re facing a very powerful opponent.”<br/><br/>However, Liang Shanshan was full of confidence as she said, “Hmph, no matter how great she is, Su Yichen will eventually be mine.”\t\t\t\t\t\t</div>", "images": {}, "success": true}