{"id": 405, "url": "https://www.novelhall.com/the-lucky-star-blessing-the-whole-village-32483/15193497.html", "title": "Chapter 405 - Chapter 405: Chapter 396:", "volume": 5, "volume_title": "Volume 5", "body": "<h1>Chapter 405 - Chapter 405: Chapter 396:</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 405: Chapter 396:<br/><br/>Liang Shanshan pulled her suitcase and walked to a place not far from the entrance of the Xiao Family.<br/><br/>The Xiao Family was not a tourist attraction, and there were barricades set up from a distance due to the sensitive identity of the grumpy old men.<br/><br/>“Hello, Miss, who are you looking for?” asked the security guard.<br/><br/>Having failed to find Miss Xiao several times before, Liang Shanshan directly said, “I’m looking for Su Yichen. I’m his friend.”<br/><br/>She said “friend”, just as a probe. At first, she wanted to say “girlfriend”.<br/><br/>The security guard frowned and then politely asked, “Miss, if you are a friend of Mr. Su’s, you can contact him directly on the phone. No one can enter the house without permission.”<br/><br/>What he meant by “inside” was, of course, the Xiao Family.<br/><br/>Liang Shanshan’s face darkened when she heard this.<br/><br/>It happened again.<br/><br/>She had Su Yichen’s work phone number but not his personal one.<br/><br/>It was said that only a few people had his personal phone number.<br/><br/>Liang Shanshan thought about it and said, “I came from Capital City, and my family has business dealings with Su Corporation. I’m also acquainted with Su Yichen. I came to travel to Xiao Family Village and couldn’t find accommodation. I heard he’s in Xiao Family Village, so I wanted to see if he could help me.”<br/><br/>That was the reason why she had brought her suitcase here.<br/><br/>The security guard still said, “Miss, please wait a moment, I’ll make a phone call.”<br/><br/>Of course, he didn’t have Su Yichen’s phone number.<br/><br/>The phone call was to Xiao Jinli’s office.<br/><br/>Now, there was no one at the Xiao Family. Everyone was working, while the old men were restless, wandering outside, fishing, climbing mountains, or helping to entertain tourists. In short, they didn’t like to stay at home.<br/><br/>Xiao Family Village was very safe, so they didn’t need to worry about their physical condition.<br/><br/>Su Yichen was also not in Xiao Jinli’s office, and Xiao Jinli was rescuing a patient in the hospital.<br/><br/>The security guard had no choice but to call the reception at Lu Xian Group.<br/><br/>As soon as the reception picked up the phone, they knew that Liang Shanshan had gone there, and they were not surprised at all.<br/><br/>What was slightly unexpected was that there was no one at the Xiao Family.<br/><br/>The receptionist followed the instructions and called the President’s office.<br/><br/>After receiving the secretary’s report, Xiao Yucheng hooked the corner of his mouth and said, “I see. I’ll call Su Yichen right now.”<br/><br/>Then, he called Su Yichen with a serious expression and asked, “Su Yichen, someone from Capital City, claiming to be your girlfriend, has come to the Xiao Family. What’s going on? Shouldn’t you explain?”<br/><br/>Su Yichen looked puzzled and said, “Girlfriend? Where did I get a girlfriend? I don’t even have female friends, let alone girlfriends. Big brother Xiao, it must be a scam, right?”<br/><br/>Xiao Yucheng replied, “I don’t know if it’s a scam, but I know she’s from Capital City, her surname is Liang, and she’s said to have business dealings with you. Su Yichen, if you have a girlfriend and still flirt with my younger sister, not to mention me, the entire Xiao Family Village won’t let you off. You’d better watch out.”<br/><br/>Without waiting for Su Yichen to explain, he hung up the phone directly.<br/><br/>Xiao Jinli was still rescuing the patient, so he would call later.<br/><br/>No, he should send a message first.<br/><br/>Xiao Yucheng’s edited message read: There’s a girl from Capital City who claims to be Su Yichen’s girlfriend. She’s innnocent and beautiful. Ask Su Yichen what’s going on.<br/><br/>When Xiao Jinli returned from the rescue room and saw the message on her cellphone, her eyebrows furrowed slightly.<br/><br/>On the other side, Su Yichen, who was working in his office, was startled when he received Xiao Yucheng’s call.<br/><br/>He was very clear whether he had a girlfriend or not.<br/><br/>Her surname was Liang, and she had business dealings with him.<br/><br/>Su Yichen couldn’t remember which boss surnamed Liang had business dealings with him.<br/><br/>As a woman had already found her way to the entrance of the Xiao Family, Su Yichen immediately stopped working.<br/><br/>He wanted to see who this woman was, so audacious and presumptuous to pretend to be his girlfriend.<br/><br/>Su Yichen hurried to the entrance of the Xiao Family and saw Liang Shanshan, who was dressed innocently.<br/><br/>Before Su Yichen could ask, Liang Shanshan’s eyes lit up when she saw him. She trotted up and called him shyly and coyly, “Brother Yichen, I finally arrived. I’ve been waiting for you for a long time.”<br/><br/>Upon seeing Liang Shanshan coming closer, ​​Su Yichen immediately stopped her, “Stop, who are you?”<br/><br/>Liang Shanshan’s expression instantly stiffened, and then a wronged expression appeared on her face. “Brother Yichen, I’m Liang Shanshan. My father is Liang Haohan. We’ve met at several parties.”<br/><br/>She thought that even if Su Yichen hadn’t begun to like her yet, at least he should know who she was.<br/><br/>After all, her beauty was well-known in Capital City’s upper-class circles, and many talented young men and playboys wanted to try their luck with her.<br/><br/>Little did she know, he didn’t even know who she was.<br/><br/>This made Liang Shanshan feel somewhat defeated, and at the same time, a desire to conquer him arose in her heart.<br/><br/>The more difficult a man was to deal with, the more people would want to conquer him.<br/><br/>Once she took down Su Yichen, she would treat him like a dog and train him.<br/><br/>When Su Yichen heard that she was the daughter of Liang Haohan, CEO of the Liang Group, a flash of disgust appeared in his eyes.<br/><br/>He also remembered Liang Shanshan.<br/><br/>In Capital City’s upper-class circles, it was rumored that Liang Shanshan, with her beauty, had won numerous projects for her father. She also flirted with multiple men, and even declared that she would pursue him, Su Yichen.<br/><br/>He found it disgusting that such a rotten person would dare to say she wanted to pursue him.<br/><br/>With a cold smile, Su Yichen said, “I’m sorry, Miss Liang, we are not familiar. Please call me Director Su or Mr. Su. I feel sick when you call me Brother Yichen.”<br/><br/>As soon as his words fell, the security guards nearby couldn’t help but laugh.”<br/><br/>They really thought that Liang Shanshan and Mr. Su were very close. They didn’t expect that he didn’t know her at all and was even disgusted by her.<br/><br/>That’s right.<br/><br/>Mr. Su only had eyes for Miss Xiao, how could he have ambiguous relations with other women?<br/><br/>Su Yichen then said to the security guards, “I’m not familiar with this Miss Liang, so do whatever you need to do!”<br/><br/>“Yes, Mr. Su.” The two security guards replied with a stifled smile.<br/><br/>Liang Shanshan’s face turned green with anger, and her expression was very ugly.<br/><br/>She never expected Su Yichen to be so unkind to her.<br/><br/>Liang Shanshan looked at him leaving, with a pitiful expression, and said, “Su Yichen, I’m a stranger here, and there are no rooms available in the hotel. Since you’re familiar with this area, can you please help me arrange my accommodation?”<br/><br/>Su Yichen laughed, “Miss Liang, please get it straight, I’m not familiar with you at all. Why would I want to arrange your accommodation?”<br/><br/>After that, he stopped paying attention to this self-righteous woman and left.<br/><br/>Liang Shanshan looked at Su Yichen’s back, her eyes revealing a determined expression.<br/><br/>The two security guards politely said, “Miss Liang, this is private property. Please leave.”\t\t\t\t\t\t</div>", "images": {}, "success": true}