{"id": 408, "url": "https://www.novelhall.com/the-lucky-star-blessing-the-whole-village-32483/15193500.html", "title": "Chapter 408 - Chapter 408: Chapter 399:", "volume": 5, "volume_title": "Volume 5", "body": "<h1>Chapter 408 - Chapter 408: Chapter 399:</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 408: Chapter 399:<br/><br/>In order to solve Liang Shanshan’s accommodation issue, Liang Haohan used many connections and finally found Li Minxing, who lives in Xiao Family Village and has greeted Lin’s father, Chairman Li.<br/><br/>Liang Haohan called Liang Shanshan and said, “Li Minxing’s family is living in Xiao Family Village. I’ve talked to him, and you can stay at his place for a while.”<br/><br/>Liang Shanshan frowned and asked suspiciously, “How can his family live in Xiao Family Village? Aren’t the living conditions here very strict? It’s even more difficult than living in the Capital City.”<br/><br/>“You don’t need to know about that,” Liang Haohan ordered. “Li Minxing’s entire family lives there, so you need to tone down your spoiled behavior. If you annoy them and get kicked out, you’ll have nowhere to stay.”<br/><br/>Liang Shanshan nonchalantly replied, “What is there to be afraid of? In the future, I will be the wife of Su Corporation’s chairman, and they won’t dare to offend me.”<br/><br/>Liang Haohan felt a headache coming on and warned her sternly, “Liang Shanshan, watch yourself. Before anything happens, you need to be cautious.”<br/><br/>After listening, Liang Shanshan reluctantly said, “Fine, I understand.”<br/><br/>After hanging up her father’s call, Liang Shanshan felt irritated because she felt her father had little faith in her.<br/><br/>Humph, from the moment Su Yichen became the wealthiest person, she vowed to become Lady Su. No one could stop her.<br/><br/>Liang Shanshan took a deep breath and dragged her suitcase outside.<br/><br/>At the hotel entrance, there was a simply dressed woman in her forties holding up a sign that read “Liang Shanshan.”<br/><br/>Liang Shanshan walked over and, after glancing at her attire, asked, “Are you the servant from Uncle Li’s family?”<br/><br/>“Are you Liang Shanshan?” Aunt Li asked.<br/><br/>“Yes,” Liang Shanshan answered and then arrogantly said, “Let’s go.”<br/><br/>Aunt Li frowned but didn’t say anything, simply saying, “Alright, let’s go.”<br/><br/>Aunt Li took her to the residential area.<br/><br/>Liang Shanshan looked at the house, a very ordinary residence with a small area, a small yard, and three stories high.<br/><br/>Was Li Minxing’s family short on money? Why was the house so small?<br/><br/>How could such a small house accommodate her?<br/><br/>Aunt Li took out the key and opened the yard door, then said casually, “Miss Liang, please go in.”<br/><br/>Liang Shanshan looked at her suitcase and said dissatisfied, “Isn’t someone supposed to help me with my suitcase?”<br/><br/>Li Minxing’s family was wealthy, and they must have a lot of servants.<br/><br/>Before Aunt Li could respond, a young girl around fifteen or sixteen years old came bouncing out, loudly asking, “Mom, did you pick up Sister Liang?”<br/><br/>Sister Liang?<br/><br/>Liang Shanshan was unhappy with this title.<br/><br/>A servant’s daughter was not qualified to address her as Sister Liang.<br/><br/>She should be addressed with respect as Miss Liang.<br/><br/>Li Jiatong immediately noticed the woman beside Aunt Li, and reacting quickly, she laughed and said, “You must be Sister Liang. You’re so beautiful. You’re the second prettiest girl I’ve ever seen.”<br/><br/>“Second prettiest girl?” Liang Shanshan was slightly displeased. “Who is the first prettiest girl?”<br/><br/>“That would definitely be Sister Xiao.” Li Jiatong answered innocently.<br/><br/>“Sister Xiao?” Liang Shanshan was slightly puzzled.<br/><br/>Without waiting for Li Jiatong to answer, Aunt Li said to Li Jiatong, “Tongtong, get Miss Liang’s luggage to the guest room.”<br/><br/>“Alright, Mom,” Li Jiatong immediately took over and said, “Sister Liang, follow me.”<br/><br/>…<br/><br/>Xiao Jinli hadn’t left the office yet when Su Yichen came rushing in.<br/><br/>Xiao Jinli raised an eyebrow and asked, “Little Brother Xiao Quan, why are you in such a hurry?”<br/><br/>Su Yichen replied, “To pick you up after work.”<br/><br/>He was worried that Liang Shanshan had been talking nonsense in front of the security guard, and if her words about having a boyfriend reached Xiao Jinli, things would get worse.<br/><br/>“Picking me up after work?” Xiao Jinli chuckled and said, “Is your conscience acting up after doing something wrong?”<br/><br/>Su Yichen’s face changed immediately, and he said anxiously, “Jinli, did you hear something? You mustn’t get angry. I don’t have a girlfriend – no, I don’t even have female friends. How could I have a girlfriend come looking for me? Believe me, all these years, I’ve only liked you.”<br/><br/>Xiao Jinli’s eyes twinkled, and she decided to tease him.<br/><br/>She asked suspiciously, “A girlfriend? Little Brother Xiao Quan, what do you mean? Do you already have a girlfriend?”<br/><br/>Su Yichen, “…”<br/><br/>This was getting more and more chaotic as he tried to explain.<br/><br/>But he couldn’t not explain.<br/><br/>Su Yichen shook his head vigorously and said, “No, I don’t have a girlfriend. I mean, if a girl claims to be my girlfriend and comes looking for you, don’t believe her. I don’t have any impression of her at all.”<br/><br/>Xiao Jinli laughed and said, “I haven’t even met her yet. How did you know I would misunderstand?”<br/><br/>Su Yichen smiled and said, “It’s just a precaution. Just in case the girl starts talking nonsense in front of you, and you believe her, then I’d be wronged.”<br/><br/>Xiao Jinli laughed even harder. “Little Brother Xiao Quan, how much don’t you trust me? I’ve known you for eight or nine years. Are you saying I should trust a stranger over someone I’ve known for that long?”<br/><br/>Xiao Jinli’s words made Su Yichen realize how silly he was being and he started laughing too. “Indeed. But a lot of these dramas are like that. Long-time lovers end up misunderstanding each other because of a sudden stranger, ultimately leading to a breakup. I just wanted to prevent that.”<br/><br/>Xiao Jinli scoffed, “Trust built through love and understanding getting easily disrupted by someone else shows that they’re not a real couple. They deserve to break up. Those protagonists in TV dramas don’t know how to explain misunderstandings and deserve to part ways.”<br/><br/>“…” Su Yichen chuckled and said, “That’s true. But if those idol dramas didn’t play out like that, where would the plot come from? Idol dramas mainly rely on brainless romantic stories, and people are attracted to the on-and-off relationships between the male and female leads.”<br/><br/>“Hehe…” Xiao Jinli let out a few chuckles. “So, I advise you to watch fewer brainless idol dramas.”<br/><br/>Su Yichen, “No, Jinli, you misunderstood. I never watch idol dramas. I’m a big boss, and there are so many things in the company to deal with. I don’t have time to watch dramas.”<br/><br/>Xiao Jinli asked suspiciously, “Then how do you know about the plot of those idol dramas?”<br/><br/>“Ahem…” Su Yichen explained, “Didn’t I watch a few while our entertainment company was investing in film and television?”<br/><br/>In fact, in order to pursue Xiao Jinli, he had been learning relationship strategies from idol dramas and novels.<br/><br/>Xiao Jinli raised an eyebrow and said, “Oh, so as a big boss, you must personally take care of those things?”<br/><br/>“Ahem, sometimes, it’s necessary to pay attention,” Su Yichen said earnestly.<br/><br/>Xiao Jinli, “…”&lt;/p\t\t\t\t\t\t</div>", "images": {}, "success": true}