{"id": 417, "url": "https://www.novelhall.com/the-lucky-star-blessing-the-whole-village-32483/15193509.html", "title": "Chapter 417 - Chapter 417: Chapter 406:", "volume": 5, "volume_title": "Volume 5", "body": "<h1>Chapter 417 - Chapter 417: Chapter 406:</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 417: Chapter 406:<br/><br/>Xiao’s mother’s arrival ignited the hidden anger in Liang Shanshan’s heart.<br/><br/>She swore she would trample everyone under her feet.<br/><br/>Liang Shanshan appeared in front of Xiao’s mother and pitifully asked, “Auntie, are you Little Sister Jinli’s mother?”<br/><br/>Xiao’s mother asked with slight suspicion, “Miss, who are you?”<br/><br/>Liang Shanshan said, “Auntie, I am Liang Shanshan, from Capital City, a friend of Su Yichen.”<br/><br/>Xiao’s mother nodded, “How can I help you? Miss Liang.”<br/><br/>Xiao’s mother sized up Liang Shanshan and noticed her unabated jealousy in a glance. With her high and mighty attitude masked by a contrived respectful address, she seemed to look down upon her.<br/><br/>Xiao’s mother immediately held no fondness for her, even if she maintained a polite demeanour when speaking.<br/><br/>Liang Shanshan’s words stopped abruptly upon hearing Xia’s mother’s words.<br/><br/>Shouldn’t she ask about the nature of her friendship with Su Yichen?<br/><br/>Then wouldn’t she be able to casually mention how she and Su Yichen were lauded as a perfect couple back in the Capital City?<br/><br/>Then she could use this as an excuse to tell her to keep an eye on her daughter.<br/><br/>Anyone with some dignity wouldn’t want their daughter to be the other woman.<br/><br/>Liang Shanshan smiled and said, “Aunt, actually, I came looking for Su Yichen because I like him.<br/><br/>I have liked him for several years. Everyone in Capital City knows. Everyone says we are the perfect couple, a match made in heaven, both handsome and beautiful, and equally wealthy.<br/><br/>This time, when I heard he confessed his feelings to another rich girl, I thought you should know. Men will have a whole bunch of women around them, especially the wealthy and influential ones.<br/><br/>However, the rightful wife is forever irreplaceable. But the position of that rightful wife is not for those who don’t belong or have no money or power. You would agree, wouldn’t you, Auntie?”<br/><br/>The undertone of Liang Shanshan’s words was clearly implying that Xiao Jinli is one of those girls who doesn’t belong or have money or power.<br/><br/>Xiao’s mother was no fool; she clearly understood what she was hinting at.<br/><br/>Liang Shanshan arrogantly made it evident.<br/><br/>Perhaps, in someone else’s place, they may genuinely doubt if their daughter is a match for Su Yichen.<br/><br/>After all, they are from the countryside. People from rural areas and those from big cities are not considered well-matched.<br/><br/>However, this was simply not possible in front of Xiao’s mother.<br/><br/>Her daughter was outstanding; a sensible and well-behaved girl. Regardless of how wealthy or powerful others may be, in front of her daughter, they are bound to flattering her.<br/><br/>If such an outstanding girl is not considered of great power, she couldn’t think of anyone else who would be.<br/><br/>Xiao’s mother smiled and agreed, “Miss Liang, you’re right. Marriage is often about a well-matched status. But what to do? I think there is only Su Yichen in the entire world who could barely match my daughter, because my daughter is so excellent. Therefore, Su Yichen liking my daughter is unavoidable.”<br/><br/>Liang Shanshan, “…”<br/><br/>Her lips twitched slightly, and she cursed inwardly, “Such a beautiful face, yet such thick skin.”<br/><br/>Liang Shanshan didn’t get angry. She laughingly said, “Oh, is that so? Your daughter must be really impressive to think that even the nation’s richest man is just barely worthy of her. I do wonder in what way she is so outstanding.”<br/><br/>Xiao’s mother retorted without flinching, “There’s no need for everyone to know how outstanding my daughter is. I’m afraid you will feel ashamed once you know.”<br/><br/>Xiao’s mother was speaking the truth.<br/><br/>But Liang Shanshan felt that Xiao’s mother’s big talk was making her face thicker and thicker.<br/><br/>Liang Shanshan inquired, “Oh, if the other Miss Xiao is that outstanding, can I meet her?”<br/><br/>Xiao’s mother had no goodwill towards Liang Shanshan, she declined, “I’m sorry, but too many people want to meet my daughter. My daughter just doesn’t have the time to meet everyone.”<br/><br/>She was telling the absolute truth.<br/><br/>Upon hearing this, the smile on Liang Shanshan’s face suddenly froze.<br/><br/>This was really too much.<br/><br/>“Miss Liang, do you need anything else? If not, I have things to do, please excuse me!” After saying this, Xiao’s mother left, not caring about Liang Shanshan’s reaction.<br/><br/>Liang Shanshan watched Xiao’s mother’s retreating figure, her face revealing an angry expression. But seeing the crowd around her enjoying the show, she took a deep breath and decided to bide her time.<br/><br/>After Xiao’s mother got back to the kitchen, Li Guihua asked her, “Xiaofang, who was that girl?”<br/><br/>Xiao’s mother said, “I don’t know. She just came up and said she’s from the Capital City, a friend of Su Yichen, saying everyone thinks they are a golden boy and jade girl. She even said, they are a perfect match in terms of status. Isn’t she implying that my little Koi is a rural girl and not a good match for Su Yichen? Huh…”<br/><br/>Xiao’s mother gave a cold laugh.<br/><br/>Upon hearing this, Li Guihua immediately became angry, “What? Where did she come from? Is she not aware that our Jinli is that miracle doctor? Hmph, as if she’s a good match for Su Yichen, I think her perfect match would be a key, that’s the real match!”<br/><br/>Others hearing this, chimed in, “Exactly. Our Jinli happens to be the most outstanding girl in the world. What status match, wealth and power, our Jinli can handle all of that by herself.”<br/><br/>One of them asked uncertainly, “Xiaofang, this girl wouldn’t really have anything to do with Xiao Quan, would she? It seems, I too will have to ask for confirmation.”<br/><br/>“Yeah, someone came all the way from Capital City, surely putting aside her pride. So, we must also confirm the situation.”<br/><br/>Xiao’s mother knew a lot about Su Yichen.<br/><br/>She chuckled and said, “Rest assured. We know everything about Xiao Quan’s situation. If there were any ulterior motive women around, the Jiang Family would not let it pass. They truly care for Jinli.”<br/><br/>The power of the Jiang Family, everyone in the Xiao Family Village, knew. They were national figures, familiar faces on television news.<br/><br/>“Oh, it makes sense. The Jiang family also lives in Capital City, they certainly know about Su Yichen’s situation.<br/><br/>Su Yichen thought that after warning Liang Shanshan, she would have given up.<br/><br/>But he never expected that this woman would immediately try to win over Xiao’s mother’s favor.<br/><br/>Liang Shanshan was repeatedly frustrated, and she was feeling down.<br/><br/>After lunch, she went back to the Li’s home.<br/><br/>Aunt Li was not at the Li home, only Li Jiatong was home.<br/><br/>After seeing Li Jiatong, her eyes started to turn again.<br/><br/>She smiled and asked, “Jiatong, may I have a chat with you?”<br/><br/>One doesn’t hit a smiling face.<br/><br/>Li Jiatong reluctantly walked over.<br/><br/>She asked, “Miss Liang, what would you like to discuss?”<br/><br/>Liang Shanshan took out a very exquisite and beautiful blue diamond necklace from her bag, and extended it to Li Jiatong, saying, “This necklace is my favorite, worth two million, I’m giving it to you.”<br/><br/>Li Jiatong reached out and took it.\t\t\t\t\t\t</div>", "images": {}, "success": true}