{"id": 415, "url": "https://www.novelhall.com/the-lucky-star-blessing-the-whole-village-32483/15193507.html", "title": "Chapter 415 - Chapter 415: Chapter 405: _2", "volume": 5, "volume_title": "Volume 5", "body": "<h1>Chapter 415 - Chapter 415: Chapter 405: _2</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 415: Chapter 405: _2<br/><br/>Liang Qiming spoke even more excitedly, “Dad, isn’t that even better? Although the Lu Xian Group can’t compare to our well-established big corporations, it’s still thriving. Most importantly, if we can build good relationships with the big shots living in Xiao Family Village, wouldn’t the Liang Group be unbeatable? ”<br/><br/>“Moreover, why was the Lu Xian Group able to soar? It’s because of the amazing effects of the products grown in that village. Those high-ranking officials have no choice but to fawn over them. So, if we were to control the Lu Xian Group, we’d have not just the nobles of Dragonzhou Country, but also the world’s elites fawning over us.”<br/><br/>The more Liang Qiming talked, the more excited he became, as if he could already see himself dominating the world with his ambitions.<br/><br/>Liang Haohan was drawn by the grand vision painted by his son.<br/><br/>He said very cautiously, “Alright, son, the glory of the Liang Family rests on your shoulders now. If we can control Xiao Family Village, who needs connections and business? As you said, all the nobles of the world will fawn over us.”<br/><br/>As a member of the top elite, he knew the value of Xiao Family Village very well.<br/><br/>If it weren’t for some big shots protecting the place, it would have been taken over long ago.<br/><br/>However, if he were to marry the chairman of the Lu Xian Group and have her yield control willingly, that would be a different story.<br/><br/>Liang Haohan said, “Son, no time to lose, I’ll have someone book your flight right away.”<br/><br/>“Alright, Dad!” Liang Qiming replied.<br/><br/>Liang Haohan suddenly thought of something, “Oh, and about the accommodation. Your sister is staying at Li Minxing’s house now. You can stay at either Zhang Liyou’s or Zhu Hongguang’s houses. I only know these three people right now.”<br/><br/>Liang Qiming was rather unhappy and said, “Dad, I don’t like living under someone else’s roof. I want to stay in a hotel, the Xiao Family Village Hotel!”<br/><br/>Xiao Family Village Hotel and Xiao Family Village Hospital are both unranked worldwide, but they’re both universally acknowledged as the best hotel and hospital, respectively.<br/><br/>However, not just anyone could enter these places. No matter how powerful or wealthy someone is, it wouldn’t help.<br/><br/>Liang Haohan shook his head, “That’s not possible. You need to book rooms at the Xiao Family Village Hotel one month in advance online.<br/><br/>With you rushing over there right now, where would you find a room? Your sister got to stay at the hotel for three days only because she paid a high price to buy it from another guest.<br/><br/>When her time was up, she was asked to leave by the hotel staff. It was then when she called me, and I arranged for her to stay at Li Minxing’s house in Xiao Family Village. And yet, she refuses to show any self-awareness there. It’s infuriating.”<br/><br/>Liang Qiming spun his eyes and said, “Dad, my sister has always been flamboyant, we should be more understanding towards her.”<br/><br/>Oh, hearing that somehow felt like pouring oil on fire.<br/><br/>Liang Haohan became angry, “I’m understanding towards her, but does she reciprocate? In order to find her a place to stay, I swallowed my pride and asked her to stay at Li Minxing’s house, but she still refuses to behave.”<br/><br/>He turned to Liang Qiming and said, “Son, let me call Zhang Liyou or Zhu Hongguang and see.”<br/><br/>Although Liang Qiming was reluctant to live under someone else’s roof, he had to make do for the greater good.<br/><br/>Unless he had incredible abilities to book a room at the Xiao Family Village Hotel immediately.<br/><br/>Liang Haohan contacted them right away.<br/><br/>After a while, he said to Liang Qiming, “Uncle Zhu is willing to let you stay at his house. However, son, Zhu Hongguang may be openly running a company, but in reality, he deals with intelligence. You must be careful when you’re with him and don’t reveal any intentions. Otherwise, he’ll kick you out without any concern for your feelings.”<br/><br/>Liang Qiming said, “Dad, I understand. I’ll be careful.”<br/><br/>…<br/><br/>After being warned by her father, Liang Shanshan was somewhat more restrained in front of Aunt Li and her daughter, but her arrogance still couldn’t be completely hidden.<br/><br/>Aunt Li knew what kind of person she was, so she ignored her.<br/><br/>For her, if it weren’t for the fact that Liang Shanshan was the daughter of her husband’s business partner, she would have kicked her out long ago.<br/><br/>How could she allow someone else to upset her in her own home?<br/><br/>Liang Shanshan only needed a place to stay, and as for meals, she’d naturally go to the cafeteria.<br/><br/>Most families in Xiao Family Village ate at the cafeteria.<br/><br/>After having tasted the gourmet food in the cafeteria, even Liang Shanshan, who was very picky, had to admit that it was the best food she had ever eaten.<br/><br/>There were many people eating at the cafeteria, but everything was orderly.<br/><br/>However, every time the cafeteria supervisor appeared, the entire cafeteria would burst into excitement.\t\t\t\t\t\t</div>", "images": {}, "success": true}