{"id": 418, "url": "https://www.novelhall.com/the-lucky-star-blessing-the-whole-village-32483/15193510.html", "title": "Chapter 418 - Chapter 418: Chapter 407:", "volume": 5, "volume_title": "Volume 5", "body": "<h1>Chapter 418 - Chapter 418: Chapter 407:</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 418: Chapter 407:<br/><br/>Li Jiatong took the necklace and looked at it curiously, then asked doubtfully, “Could this necklace be the ‘Water Heart’ diamond necklace from the Youth Charity Auction last time?”<br/><br/>Upon hearing this, Liang Shanshan immediately said proudly, “You have a good eye! This was the focus of the auction last time, designed by Linda.”<br/><br/>She looked at Li Jiatong and asked with a smile, “Miss Li, do you like this necklace?”<br/><br/>If it wasn’t for politeness, Li Jiatong would have rolled her eyes, but her upbringing didn’t allow her to do so.<br/><br/>She’s being treated like a three-year-old.<br/><br/>A person who clearly disliked her a moment ago is now giving her such a precious necklace.<br/><br/>There’s a saying, “Unsolicited favors.”<br/><br/>Li Jiatong hesitated for a moment and nodded, “Yes, I do like this necklace.”<br/><br/>Although this necklace is slightly cheaper than the ones in her drawer, it is somewhat more attractive.<br/><br/>Liang Shanshan’s eyes shifted, the corners of her mouth curling up, revealing a trace of disdain in her eyes.<br/><br/>As expected, staying in the countryside for too long does dull one’s senses.<br/><br/>Of course, as far as she’s concerned, as long as she can be bought.<br/><br/>“You like it, huh? Then I’ll just give it to you,” Liang Shanshan said with a smile, “This necklace is also one I particularly like.”<br/><br/>Upon hearing this, Li Jiatong immediately handed the necklace back to her, saying sincerely, “Since it’s something you like, I don’t want to take it away from you. I’ll give it back.”<br/><br/>As soon as she heard that it would be returned, Liang Shanshan’s smile froze for a moment.<br/><br/>If it were in Capital City, those so-called socialite daughters would be grateful for the gift of a necklace from her.<br/><br/>So why isn’t Li Jiatong playing her cards like everyone else?<br/><br/>Liang Shanshan pushed the necklace back, smiling, “I’ve already said, the necklace is yours. I don’t need it. But, I could use your help with a small matter. I think Miss Li would be more than willing to help out, right?”<br/><br/>Li Jiatong didn’t answer right away, but instead asked, “What do you need my help with, Miss Liang?”<br/><br/>In her heart, she thought, “This woman is definitely giving gifts for a reason.”<br/><br/>Liang Shanshan said, “The thing is, Su Yichen and I are good friends. I heard that he confessed his feelings to a girl from the countryside here, to Jinli Xiao.”<br/><br/>Li Jiatong frowned, asking doubtfully, “So, what do you want to say, and what small favor do you need from me? Don’t keep things hidden, I’m young and don’t understand all those hidden intentions.”<br/><br/>Liang Shanshan took a deep breath and asked directly, “Alright, I’ll just say it. Tongtong, I like Su Yichen, so I need your help.<br/><br/>Currently, in the Capital City, only I have the qualifications to be his wife.<br/><br/>We’re well-matched, a handsome man and a beautiful woman; we’re the perfect couple, aren’t we?<br/><br/>But now he’s confessing to a country girl; isn’t this a slap in the face to those of us in the elite social circle of the Capital City?<br/><br/>The Li Family is a top-tier and influential family in the Capital City, right? You are Uncle Li’s daughter, and you represent the Li Family’s image, don’t you?<br/><br/>If Su Yichen were to marry Jinli Xiao, where would it leave the rest of us in the elite circle? Tongtong, for the sake of our dignity, you’ll help me, won’t you?”<br/><br/>Li Jiatong’s face showed a mixture of surprise and confusion, but inside she secretly thought, “This woman has such cunning. Using the social circle’s pride to manipulate me; she really thinks I’m a naive child. Wait, even little Fanfan, who’s three, wouldn’t be that easily fooled.”<br/><br/>Li Jiatong tilted her head, pondering for a moment and asked, “Miss Liang, I think what you said makes sense. It indeed hurts our dignity. So, how do you want me to help?”<br/><br/>Liang Shanshan’s eyes flickered, and she felt a mix of disdain and mockery in her heart, thinking, “Heh, just a little girl with no cunning, so easy to deceive. But this makes it easier for me to manipulate her.”<br/><br/>She didn’t notice that from the beginning to the end, Li Jiatong had been calling her “Miss Liang” with politeness and distance.<br/><br/>Liang Shanshan’s smile became even warmer.<br/><br/>She grabbed Li Jiatong’s hand, smiling and said, “Younger sister, you really are a person of great vision.”<br/><br/>“You’re giving me too much credit,” Li Jiatong replied modestly, “What do you want me to do?”<br/><br/>After whispering a few words into Li Jiatong’s ear, Liang Shanshan repeated her instructions, “Tongtong, this matter can only be known by us and not by anybody else, especially not your parents, understand?”<br/><br/>Li Jiatong nodded solemnly and said, “I understand.”<br/><br/>Upon hearing Li Jiatong’s reply, the anger Liang Shanshan had felt in the cafeteria dissipates.<br/><br/>She sneered in her heart, “Humph, that stinky old woman showing off for nothing. When I marry Su Yichen, I will get even with them.”<br/><br/>After Li Jiatong left her house, she could finally show the emotions on her face.<br/><br/>She exclaimed angrily, “Liang Shanshan is so hateful, she could think of such a poisonous plan!<br/><br/>No, with Liang Shanshan staying at the Li Family, once something happens, it will definitely implicate the Li Family. At that time, they will definitely drive us out.<br/><br/>Xiao Family Village is such a great place with beautiful scenery, a healthy lifestyle, and most importantly, delicious food. The most important thing is that everyone around the world wants to get close to Jinli Xiao, who is in the Xiao Family Village.<br/><br/>So, how stupid is Liang Shanshan to think I would help her? No, I can’t let Liang Shanshan ruin the Li Family and Jinli Xiao. I’ll find Sister Jinli now; no, I should find my dad first.”<br/><br/>With this thought, Li Jiatong went to a secluded place and made a phone call to her father.<br/><br/>After receiving Li Jiatong’s call, Li Minxing was both angry and furious.<br/><br/>He cursed, “How could Liang Shanshan be so malicious? I thought she was just arrogant and let her live in our house as long as she stayed out of trouble.”<br/><br/>Li Jiatong asked, “Dad, what should we do now? Should we just kick Liang Shanshan out?”<br/><br/>Li Minxing thought for a moment and said, “We can’t kick her out just yet. If she knows we won’t help her, she might seek help from others. Maybe people from the Xiao Family Village won’t betray Jinli Xiao, but there are people from other villages who know her. Here’s what you should do, Tongtong: go directly to Jinli Xiao. Tell her Liang Shanshan’s evil plan; she’s so smart, she’ll know what to do.”<br/><br/>Li Jiatong nodded and said, “Alright, I had the same idea. Jinli Xiao is the smartest person I’ve ever met.”<br/><br/>After hanging up the phone, Li Jiatong went to find Jinli Xiao.\t\t\t\t\t\t</div>", "images": {}, "success": true}