{"id": 413, "url": "https://www.novelhall.com/the-lucky-star-blessing-the-whole-village-32483/15193505.html", "title": "Chapter 413 - Chapter 413: Chapter 404:", "volume": 5, "volume_title": "Volume 5", "body": "<h1>Chapter 413 - Chapter 413: Chapter 404:</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 413: Chapter 404:<br/><br/>Su Yichen knew that Liang Shanshan had looked for Xiao Jinli and was worried she would misunderstand, so after he found out where she had gone, he rushed over. Just as he was about to go in, Xiao Junxuan stopped him and whispered, “Don’t go in, let Xiaoxiao talk to her.”<br/><br/>So, the two men didn’t go in and stood outside the door of the ward.<br/><br/>When Lin Xiaoxiao said, “Jinli, you are very sensible and outstanding, but people forget that you are still a young girl who doesn’t understand love”, she looked very shocked.<br/><br/>Yes.<br/><br/>Everyone was trying to match him with Xiao Jinli, but they completely ignored<br/><br/>that she was a young girl who didn’t understand love.<br/><br/>Wasn’t their matchmaking equivalent to coercion?<br/><br/>Xiao Junxuan sighed softly, “Girls really understand girls’ thoughts. We all only tried to match you with Jinli, but we haven’t paid any attention to her feelings. Xiao Quan, we know you like Jinli, but now, I hope you won’t push my sister too hard. Actually we know, since childhood, Jinli has treated you specially, it’s just that she hasn’t realized it herself.”<br/><br/>Su Yichen nodded, “Brother Xuan, I understand.”<br/><br/>If Jinli didn’t know what love was, then he would let her experience it slowly until she understood.<br/><br/>Then, Su Yichen and Xiao Junxuan left the hospital.<br/><br/>By coincidence, Liang Shanshan found Su Yichen’s figure.<br/><br/>She ran over and directly stood in front of Su Yichen.<br/><br/>“Brother Chen, how did you get here? It was so hard to find you!” Liang Shanshan spoke in a coquettish tone.<br/><br/>Before Su Yichen could speak, Xiao Junxuan asked with a dark face, “Xiao Quan, who is she?”<br/><br/>Liang Shanshan looked at Xiao Junxuan’s handsome appearance, her eyes lit up, and if this happened in the Capital City, she would surely send some seductive glances. However, she still remembered her purpose.<br/><br/>With a shy expression, she said, “I… I am Brother Chen’s friend, my dad is his business partner. In Capital City, everyone says that Brother Chen and I are a perfect match.”<br/><br/>Liang Shanshan was intentionally vague, trying to mislead people.<br/><br/>Xiao Junxuan’s face suddenly turned dark.<br/><br/>Su Yichen knew this was not good, so he quickly explained, “Brother Xuan, don’t listen to her nonsense. I don’t even know who she is, how could I have any relationship with her? At most, I know her dad. As for what everyone says, that we are a perfect match, that’s just baseless gossip. In Capital City, who doesn’t know that I, Su Yichen, am cold and indifferent towards women, keeping them at least three thousand miles away?”<br/><br/>After listening, Xiao Junxuan asked, “Is that true?”<br/><br/>Su Yichen nodded vigorously, “Yes, of course it’s true. If there’s any truth to it, Grandpa Jiang would have my skin.”<br/><br/>Since Xiao Jinli acknowledged Elder Jiang as her adoptive grandfather, her relationship with the Jiang Family naturally became closer.<br/><br/>Before, wouldn’t the Jiang family know about the contact between Xiao Jinli and Su Yichen? Of course they did, they just turned a blind eye.<br/><br/>If Su Yichen was really involved with some women, the Jiang family would definitely step in to stop it.<br/><br/>Moreover, some time ago, Su Yichen’s romantic confession to Xiao Jinli was definitely known to the Jiang family.<br/><br/>If there were really women involved with Su Yichen in the Capital City, the Jiang family would be the first to stop it.<br/><br/>Xiao Junxuan also seemed to have thought of this.<br/><br/>He said to Su Yichen seriously, “Then hurry up and clean up this mess.”<br/><br/>This comment made Liang Shanshan very unhappy.<br/><br/>She shouted, “Who are you to meddle in my business?”<br/><br/>Any good feelings she had for him just now disappeared.<br/><br/>She cursed in her heart, “Nosy bastard. Once I become Lady Su, the first thing I do is to cut off ties with these people.”<br/><br/>Xiao Junxuan didn’t pay any attention to her.<br/><br/>As soon as Xiao Junxuan left, Su Yichen’s face darkened. He said coldly, “Liang Shanshan, I don’t know you, and I won’t know you in the future. If you dare to say again that we are a perfect match, don’t blame me for breaking off cooperation with your father. This is your last warning.”<br/><br/>Liang Shanshan’s face changed instantly, and then she said with a grievance, “Su Yichen, I like you. Is it wrong for me to pursue my love? Our union is the perfect match in terms of social status, and our marriage would be a strong alliance. If our families’ companies cooperate, we would certainly become the most powerful enterprises in the world. Su Yichen, I am the most suitable person for you to marry.”<br/><br/>Su Yichen coldly replied, “I don’t need that. The money I earn myself is enough for me to spend, so I don’t need to strive for the whole world. Liang Shanshan, please disappear from my sight right now. And I’m warning you, if you ever show up in front of Xiao Jinli again, do you believe that I won’t let your Liang family find a foothold in Capital City?”<br/><br/>Finishing his speech, he left directly.<br/><br/>For someone who cares about their own interests so much, a warning to that person is not useful. So, the family’s businesses behind them must be threatened to make them have some scruples and think twice.<br/><br/>Watching Su Yichen walk away, Liang Shanshan’s face turned pale with anger. Her hands tightly clenched into fists, her nails almost piercing her flesh.<br/><br/>Her eyes were filled with hatred as she gnashed her teeth and said, “Su Yichen, I swear that I will make you beg under my skirt like a dog, craving my love. I’ll make you regret so much insulting and threatening me today. Ha, making me back down in my dreams!”<br/><br/>She considers herself a beautiful woman who can play with men’s hearts, but being rejected by Su Yichen again and again has made her desire for conquest and anger fill her entire chest, spreading deeper and deeper until she’s driven mad by it.<br/><br/>“From childhood to now, whatever I, Liang Shanshan, want, I will definitely get it. If I can’t have it, I’d rather destroy it. You, Su Yichen, are no exception.”<br/><br/>At the entrance of the hospital, the hustle and bustle of passing people, Liang Shanshan’s furious twisted expression frightened everyone, even scaring children.<br/><br/>“Wah wah…” The children started crying.<br/><br/>The adults were puzzled by the children’s sudden crying, thinking they were crying because they suddenly felt sick and uncomfortable.<br/><br/>“Baby, it’s okay, we are at the hospital. Let’s go inside and see, the doctors here are really good. You don’t even need injections and medication for the bad sickness to go away.”<br/><br/>Liang Shanshan was interrupted by the children’s crying and snapped out of her rage. She glanced sharply at the crying children, then walked away in her high heels.<br/><br/>When Liang Shanshan returned to the Li family home, she still seemed angry.<br/><br/>She shouted at Aunt Li, who was mopping the floor, “Get me a glass of water.”<br/><br/>Aunt Li looked at her irritably, put down her work, and poured her a glass of warm water.<br/><br/>Liang Shanshan took a sip and immediately spat it out, scolding angrily, “You damn blind woman. Don’t you know what the weather is like now? Still giving me hot water. Don’t you know to pour ice water?”<br/><br/>Aunt Li was infuriated and retorted, “Liang Shanshan, if you want something to eat or drink, go get it yourself with your own hands and feet. I am not your nanny or servant, nor am I your mother. You have no right to order me around or scold me!”\t\t\t\t\t\t</div>", "images": {}, "success": true}