{"id": 412, "url": "https://www.novelhall.com/the-lucky-star-blessing-the-whole-village-32483/15193504.html", "title": "Chapter 412 - Chapter 412: Chapter 403:", "volume": 5, "volume_title": "Volume 5", "body": "<h1>Chapter 412 - Chapter 412: Chapter 403:</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 412: Chapter 403:<br/><br/>Xiao Jinli is still a young girl, perhaps she doesn’t know what love is yet?<br/><br/>Thus, suddenly pushing the so-called love towards her, of course she would be at a loss and confused.<br/><br/>Lin Xiaoxiao may have not understood love in the past either.<br/><br/>But after meeting Xiao Junxuan, she naturally learned the meaning of love.<br/><br/>However, after all, she was older and more mature in heart and experience, so when love arrived, she understood it instantly without any guidance.<br/><br/>Lin Xiaoxiao sighed softly and then asked Xiao Jinli, “Jinli, I heard that you and Su Yichen have a deep friendship since childhood. Over the years, others may have lost contact with Su Yichen, but I heard you’ve always been in touch with him, right?”<br/><br/>Xiao Jinli nodded, “Yes.”<br/><br/>Lin Xiaoxiao continued, “Then, how have you been getting along with Su Yichen all these years?”<br/><br/>Xiao Jinli said without hesitation, “We treat Brother Little Quan like a family member, and naturally get along as siblings.”<br/><br/>Lin Xiaoxiao asked again, “But, Jinli, how do you get along with the brothers of the Jiang Family?”<br/><br/>Xiao Jinli’s expression suddenly froze.<br/><br/>She now realized that her interactions with them were somewhat different.<br/><br/>When interacting with Su Yichen, maybe it’s because she had confided her secrets to Su Yichen; in front of him, her attitude was relaxed and natural, without any apprehension. In fact, she was willing to share everything with Su Yichen, just like when she created the Shenfeng Group. Even her family members didn’t know that she was the person behind it, but she was willing to tell Su Yichen.<br/><br/>Could it be that she trusts Su Yichen so much that she firmly believes he would never betray her?<br/><br/>Why is that?<br/><br/>Yes, why is that?<br/><br/>An answer was faintly rising in Xiao Jinli’s heart, which seemed unnatural and yet reasonable at the same time.<br/><br/>When interacting with the brothers of the Jiang Family, she genuinely regarded them as her older brothers whom she needed to protect.<br/><br/>Maybe that is the difference.<br/><br/>Seeing Xiao Jinli deep in thought, Lin Xiaoxiao just sat there quietly, not interrupting her.<br/><br/>In Lin Xiaoxiao’s opinion, Su Yichen was indeed the best candidate for her little fairy sister.<br/><br/>Just as her father used to think that Su Yichen was a perfect match for her.<br/><br/>But whether they are a match or not, it still depends on the willingness of the parties involved.<br/><br/>At first, she admitted that Su Yichen was outstanding, but she just didn’t like him.<br/><br/>She felt that Su Yichen was too cold and had no human touch.<br/><br/>Now she knows that Su Yichen is only cold to others, but for those he likes, he is gentle and intimate. For example, towards all members of the Xiao Family, he doesn’t act like a cold and domineering tycoon or the wealthiest person. Instead, he truly regards himself as a part of this family and gets along with everyone in the Xiao Family, even the entire Xiao Family Village, in a natural and harmonious way.<br/><br/>In Capital City, who has ever seen Su Yichen like this?<br/><br/>Furthermore, Su Yichen is showing different attitudes towards Xiao Jinli on other occasions, besides being a loving brother. There are mixed feelings and friendship between them.<br/><br/>For example, it was known that they would often hold hands and go to the fields and mountains. Xiao Jinli even took Su Yichen to the top of the Red Peak Mountain, which was her secret base known to everyone.<br/><br/>Xiao Jinli had given Su Yichen a very special treatment. Even her brother, Xiao Junxuan, didn’t receive such special treatment.<br/><br/>As they grew up, wherever Xiao Jinli was, Su Yichen had to be there as well. It was very appropriate to say that they were inseparable.<br/><br/>Only Xiao Jinli didn’t quite understand her special treatment towards Su Yichen.<br/><br/>So, when everyone was matchmaking her with Su Yichen, she seemed very confused and bewildered.<br/><br/>After a while, Lin Xiaoxiao asked again, “Jinli, haven’t you noticed that you treat Su Yichen differently from others?”<br/><br/>Xiao Jinli frowned in bewilderment, “Do I?”<br/><br/>Xiao Jinli thought about it, and she did treat Su Yichen differently.<br/><br/>Too many of her secrets were already known to Su Yichen, but she didn’t harbor any ill intent towards him.<br/><br/>Why did she save Su Yichen in the first place? At that time, she could have killed the kidnappers and just as easily killed him without anyone knowing.<br/><br/>In her previous life, she had always been in a high position, not recklessly killing the innocent but neither harboring a tender heart. She often tried to compensate the innocent with money when they got involved.<br/><br/>Although there was no love at first sight towards Su Yichen, she couldn’t deny that she had a good impression of his temperament the first time she saw him.<br/><br/>He was driven to the brink by those four kidnappers, but he didn’t relent. His hatred and despair in his eyes made her feel heartbroken and thrilling.<br/><br/>That’s why she decided to save him and wanted to see if he would really take revenge on those people when he had the chance.<br/><br/>Later, Su Yichen liked to keep close to her, and she didn’t refuse him.<br/><br/>Now thinking about it, if someone else wanted to stick to her like that, would she refuse? The answer was definitely yes.<br/><br/>After all, back then, she wasn’t really a ten-year-old child, but a mentally mature middle-aged person. Moreover, she didn’t like having people around her in the past either.<br/><br/>The more Xiao Jinli thought about it, the more incredible she found herself.<br/><br/>After a lot of thinking, Xiao Jinli said to Lin Xiaoxiao, “I do treat Su Yichen differently. However, I think it’s because I treat him like a brother.”<br/><br/>“Is it really just as a brother?” Lin Xiaoxiao asked, “Jinli, you have a brother too, would you be willing to share your many secrets with him? I heard that your secret base is on the top of Red Peak Mountain, and no one can go there unless you take them there. But I heard you take Su Yichen there every day.”<br/><br/>Xiao Jinli pouted and said, “At first, he followed me every day, so I had no choice but to take him there.”<br/><br/>“Pfft!” Lin Xiaoxiao laughed and said, “Yes, he followed you every day. But that’s also because you allowed him to follow you, didn’t you? I know how many people in Xiao Family Village wanted to follow you, but did you allow them?”<br/><br/>Xiao Jinli, “…”<br/><br/>Lin Xiaoxiao patted Xiao Jinli on the shoulder and said earnestly, “Jinli, it’s still the same question – if Su Yichen really marries another woman, will you be willing? Will it hurt inside? Jinli, you are so smart and excellent that people almost forget that you are still a little girl who is inexperienced in love. But, Jinli, don’t rush this. Just let your heart lead the way.”<br/><br/>Letting her heart lead the way?<br/><br/>Xiao Jinli touched her heart.<br/><br/>Outside the hospital room, the two men stood quietly against the wall, listening.<br/><br/>Su Yichen’s eyes turned red.<br/><br/>Xiao Junxuan patted him on the shoulder and said, “Don’t worry, my sister will figure it out. In fact, it’s our fault, just like Xiaoxiao said. No matter how understanding, strong, and outstanding my sister is, it makes people forget that she is still an inexperienced little girl when it comes to love. So, Little Quan, give my sister some time and don’t pressure her too much.”<br/><br/>Su Yichen nodded, “I know, Brother Xuan.”\t\t\t\t\t\t</div>", "images": {}, "success": true}