{"id": 419, "url": "https://www.novelhall.com/the-lucky-star-blessing-the-whole-village-32483/15193511.html", "title": "Chapter 419 - Chapter 419: Chapter 408:", "volume": 5, "volume_title": "Volume 5", "body": "<h1>Chapter 419 - Chapter 419: Chapter 408:</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 419: Chapter 408:<br/><br/>Liang Qiming traveled lightly to the Xiao Family Village.<br/><br/>Upon arriving at the Xiao Family Village, he did not directly go to Zhu Hongguang’s house, but first contacted Liang Shanshan.<br/><br/>As soon as Liang Shanshan received the call from her brother, whom she regarded as an enemy, she immediately stomped her foot in anger.<br/><br/>“Where are you? You’re also in the Xiao Family Village? What are you doing here?” Liang Shanshan asked, raising her guard and becoming more vigilant.<br/><br/>From childhood, the siblings had always been at odds with each other, using all kinds of schemes and traps against each other. They wished the other would simply disappear.<br/><br/>Liang Qiming spoke sarcastically, “You’ve been here for so long without making any progress, and you’ve even provoked Li Minxing to report you to Dad. He said you’re too arrogant and wanted to kick you out.<br/><br/>Dad felt humiliated.<br/><br/>He had to swallow his pride and apologize to prevent Li Minxing from driving you out of his home. Liang Shanshan, are you completely useless? Dad thinks you can’t bring Su Yichen under your control and that your failure has shamed him. That’s why he sent me to help you.”<br/><br/>Liang Shanshan’s fingers holding the phone turned white, her face was pale with anger, and she gritted her teeth, “I don’t need you to pretend to be kind. I can handle it myself. Tell Dad to wait for my good news at home.”<br/><br/>In her heart, she cursed, “This despicable person! After I marry Su Yichen, he and his despicable mother will have to kneel down and lick my shoes.”<br/><br/>Liang Qiming mocked her directly, “Liang Shanshan, I don’t think you understand. I’m here to inform you directly, not to seek your approval. So, whether you agree or not, you have to agree.<br/><br/>Now, we need to find a place to discuss our plan. You’ve been here for so long, you should be familiar with the area. Remember to find a secluded place.”<br/><br/>He emphasized, “This place, Xiao Family Village, is a bit strange. Our plan cannot be known to anyone.”<br/><br/>Immediately afterwards, regardless of whether Liang Shanshan agreed or not, he hung up the phone and sat on his suitcase under a big tree in the Xiao Family Village, waiting for her.<br/><br/>He was not worried that Liang Shanshan would be angry at him.<br/><br/>From childhood to adulthood, Liang Shanshan had never been able to outsmart him.<br/><br/>He sneered. Liang Shanshan was a useless person who only knew how to jump up and down without any cunning skills.<br/><br/>After hanging up Liang Qiming’s call, Liang Shanshan’s eyes were filled with hatred, wishing that he would disappear before her eyes immediately.<br/><br/>Before Liang Qiming was born, her life had been a very happy one.<br/><br/>At home, she was the true princess, doted on by her father and flattered by her stepmother. She acted like a spoiled young lady, believing that the Liang Family’s future would belong to her alone. As for her stepmother, who she had always looked down upon, of course she could only try to please her.<br/><br/>Before and after marrying her father, Liang Shanshan’s stepmother could only please her to have a good life in the Liang family.<br/><br/>Even more, her stepmother had become her plaything to bully.<br/><br/>As long as there was the slightest injury on her, it was her stepmother who had caused it.<br/><br/>Her father would scold the stepmother, saying that she couldn’t even take good care of a child. He told her to remember her identity, that he married her just to take care of his daughter.<br/><br/>After being scolded by her father, the stepmother would continue to serve her with a swollen face.<br/><br/>Later on, her stepmother got so angry that she ran back to her maiden family.<br/><br/>But when she saw her again, the stepmother was holding a child, and her father, who had always had eyes only for her, was now carefully protecting her and the child.<br/><br/>He held the child joyfully and said to her, “Shanshan, you have a younger brother now. He will play with you when he grows up, and he will protect you. Are you happy?”<br/><br/>Little Liang Shanshan looked at the tender baby and her happy father, then angrily and miserably said loudly, “No, I don’t want a younger brother, I don’t want a brother. Dad, I don’t want a brother, can you give him away?”<br/><br/>“Slap” sound.<br/><br/>That was the first time her father hit her, with anger in his eyes, he said, “Liang Shanshan, has your father spoiled you so much that even at such a young age your heart is so poisonous that you want to give your brother away? Hmph, let me tell you, I’m happy to have a son, and you have a brother. I don’t care if you accept him or not, he is your brother.”<br/><br/>The stepmother, in her postpartum clothes, spoke with a gentle voice, “My husband, please don’t scold the child. Shanshan is still young, and perhaps it’s hard for her to accept a brother suddenly as an only child. We should give her some time to slowly accept it, right? Shanshan, you will definitely like your brother later, right?”<br/><br/>Liang Shanshan had been spoiled and couldn’t listen to her stepmother’s “kind” advice, she angrily said, “I don’t want a brother, I just don’t.”<br/><br/>Later, when no one was in the baby room, she pinched her brother’s neck with her little hands. If her stepmother hadn’t come in to check on her son, she might have lost him due to this infuriating scene.<br/><br/>In fact, her every move was being watched.<br/><br/>The stepmother, wanting to kick her out, had to find a powerful reason.<br/><br/>“My husband, I was so scared that I almost lost my son. Wuu… I can’t stand living in this house anymore. Who knows when Shanshan will try again to hurt our son when no one’s around? I can’t live through another scene like that, we can’t always be so lucky and save him each time.”<br/><br/>Later, Liang Haohan hit her again, even more fiercely than before.<br/><br/>After hitting her, he sent her to her maternal grandfather’s house.<br/><br/>The grandfather himself had several grandsons and granddaughters and was partial to them, so he didn’t like her at all.<br/><br/>So, her life as a dependent was particularly difficult.<br/><br/>Every time she called her father, asking him to take her back home and admitting her mistake, promising that she would treat her brother well in the future.<br/><br/>However, every time her father wanted to take her back home, her brother would happen to be sick.<br/><br/>Her stepmother said, “My husband, I miss Shanshan too and feel pain for her when she’s at her maiden family. I want nothing more than for Shanshan to come back home and take care of her.<br/><br/>However, I consulted a master, and my son and Shanshan’s horoscopes clash. Otherwise, why would our son always get sick whenever Shanshan is about to come back home?<br/><br/>The master said that they can only live together when they both turn 18. My husband, how about I go back to my maiden family with our son and let Shanshan come back home?<br/><br/>Even though I’d have to put up with my sister-in-law’s attitude there, it’s still better than Shanshan fighting for favor at her grandfather’s house. And as an adult, I can protect our son.”<br/><br/>Upon hearing this, Liang Haohan thought, how could his wife and son go to her maiden family?<br/><br/>Nowadays, his motivation for going to work every day was all because of his son.<br/><br/>After work, he would hug and kiss his son, and all of his day’s fatigue would disappear.<br/><br/>Liang Haohan thought for a moment and said, “Don’t worry. Since Shanshan doesn’t want to stay at her grandfather’s house, I’ll arrange for her to stay at the villa and have a nanny take care of her. You and our son should stay peacefully at home.”<br/><br/>Upon hearing this, the stepmother was reassured and instructed, “My husband, please make sure to find a reliable nanny to take good care of Shanshan. No, I will arrange it myself. You are a busy man working all day, and I will handle this small matter of finding a nanny.”<br/><br/>Then, after making all the arrangements, the stepmother kept Shanshan in a secluded villa.<br/><br/>With the most poisonous heart of a woman, she made strategic moves, using the softest knife to poke at the biggest wound, until the other party disappeared from her sight.\t\t\t\t\t\t</div>", "images": {}, "success": true}