{"id": 416, "url": "https://www.novelhall.com/the-lucky-star-blessing-the-whole-village-32483/15193508.html", "title": "Chapter 416 - Chapter 416: Chapter 405: _3", "volume": 5, "volume_title": "Volume 5", "body": "<h1>Chapter 416 - Chapter 416: Chapter 405: _3</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 416: Chapter 405: _3<br/><br/>Normally, the cafeteria manager would be working in the back kitchen, only occasionally appearing in the main hall.<br/><br/>Many tourists, besides coming for the unique features of Xiao Family Village, often wanted to see the two stunning beauties mentioned online with their own eyes.<br/><br/>After deliberately seeking out Xiao Jinli and seeing her stunning looks, Liang Shanshan had been consumed by jealousy for many days.<br/><br/>Now she wanted to see for herself just how beautiful the other “middle-aged” woman was.<br/><br/>She doubted the online claims of nation-toppling beauty for a woman in her forties or fifties. No matter how beautiful, could an older woman really have the allure of a young girl?<br/><br/>Just as she was thinking this, someone suddenly shouted, “Manager Xiao is here! Wow, Manager Xiao is as beautiful as they say on the internet!”<br/><br/>“Wow, Manager Xiao is so beautiful. I heard she’s already in her 50s and her son is in his 30s. But looking at her now, she doesn’t look 50-plus at all, she looks like she’s just in her early thirties.”<br/><br/>“How does she maintain her beauty? With no makeup on her naturally flawless skin and that graceful demeanor, she’s unbelievably captivating! Even as a woman, I can’t help but be mesmerized by her beauty.”<br/><br/>“Yeah, before coming here, I thought the online claims were exaggerations. Rural women, working in the fields with the sun and soil, even if they’re beautiful, their skin would be sunburnt and their hair dry, and they’d generally look unkempt.”<br/><br/>“But now, I realize I was too absolute in my judgment.”<br/><br/>“Isn’t that the truth? Many people come here actually for the two beauties, the elder beauty being Manager Xiao and the younger beauty being her daughter.”<br/><br/>“It’s the first time I’ve encountered a situation where the mother is more sophisticated and beautiful than the daughter. The mother has not only breathtaking beauty but also a mature charm and allurement that is captivating.”<br/><br/>“Although I haven’t seen her daughter yet, I can imagine that if she takes after her mother’s looks even a little bit, she’ll also be a beauty.”<br/><br/>“I heard that her daughter looks 70% like her and the remaining 30% like her dad, who is also a very handsome man. She has inherited the best features from both her parents.”<br/><br/>“Ah, just thinking about it, I can’t imagine how stunning her daughter must be.”<br/><br/>“Yes.”<br/><br/>Yet many people couldn’t understand.<br/><br/>Since ancient times, beautiful women have caused strife and chaos.<br/><br/>But how did these two beauties from Xiao Family Village manage to avoid the attention of those powerholders?<br/><br/>Nowadays, the internet is accessible everywhere; there’s no way to keep things hidden.<br/><br/>Both of them could enter the entertainment circle just on the strength of their appearance and become instant celebrities.<br/><br/>Upon seeing Xiao’s mother, jealousy surged in Liang Shanshan’s eyes, and a deep resentment filled her heart.<br/><br/>How come these two country women were so beautiful and lived such carefree, happy lives?<br/><br/>She, on the other hand, was born with beauty, well-known in the Capital City, yet she was well aware that she was just a bargaining chip in Liang Family’s business dealings and a pawn for a future marriage alliance.<br/><br/>She had set her sights on Su Yichen early on as the most outstanding talent among all the young and eligible men in the Capital City.<br/><br/>He was young, tall, handsome, and at her age. He kept his distance from women, had overwhelming influence and astonishing wealth.<br/><br/>No matter which attribute you looked at, they would all make many women’s hearts flutter. Let alone a combination of them all, which made him the dream match for practically every woman.<br/><br/>Liang Shanshan was no exception, of course.<br/><br/>She had spread the word early on that she would pursue Su Yichen.<br/><br/>Back in the Capital City, she had indeed taken action, but before she could even get close to him, she was stopped three feet away by his bodyguard, and Su Yichen left without even glancing at her.<br/><br/>Even at social gatherings where others usually weren’t allowed to bring bodyguards, as long as he attended, he would always have two bodyguards just to block any women trying to get close to him.<br/><br/>So when she claimed to have met Su Yichen at social events, she really meant that she had only seen him from a distance.<br/><br/>Previously, she thought he was either simply not interested in women or didn’t like women at all. In either case, she believed she’d be able to marry him and become his official wife.<br/><br/>But she never, ever expected that Su Yichen wasn’t indifferent to women, but rather that he had already fallen for another girl.<br/><br/>Upon learning this information, she had smashed everything she could at her villa.<br/><br/>She was driven mad with anger and jealousy.<br/><br/>She absolutely couldn’t allow anyone to steal her marriage.<br/><br/>Even if Su Yichen didn’t like her, she didn’t care as long as she could bear the title of Madam Su.<br/><br/>So whoever stood in her way to become Lady Su, she would eliminate them, whether they were ghosts or gods.\t\t\t\t\t\t</div>", "images": {}, "success": true}