{"id": 414, "url": "https://www.novelhall.com/the-lucky-star-blessing-the-whole-village-32483/15193506.html", "title": "Chapter 414 - Chapter 414: Chapter 405:", "volume": 5, "volume_title": "Volume 5", "body": "<h1>Chapter 414 - Chapter 414: Chapter 405:</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 414: Chapter 405:<br/><br/>Li Minxing was a man who loved his wife and children. He heard from his daughter that Liang Shanshan treated them like nannies and servants in the house, making them angry and upset.<br/><br/>He immediately called Liang Haohan and said, “Mr. Liang, my humble house can’t accommodate your daughter’s grand presence. Please find her another place to stay.”<br/><br/>Upon hearing this, Liang Haohan immediately asked for the reason.<br/><br/>Li Minxing said coldly, “My wife and daughter are now staying in Xiao Family Village, without any hired nannies or maids. They’re doing all the housework themselves.<br/><br/>But your young mistress came to my house and treated my wife and children as if they were your servants, ordering them around and even cursing at them.<br/><br/>Mr. Liang, my wife has been married to me for twenty years, and I have never let her suffer any grievances. As for my daughter, I can’t even bear to speak harshly to her. But your young mistress has treated them all so poorly.<br/><br/>I love my own wife and children, so please ask your daughter to find another place to stay. We’re not able to host her any longer.”<br/><br/>After hearing this, Liang Haohan was also furious.<br/><br/>Liang Shanshan had clearly become too accustomed to her arrogance at home and continued to act that way even in other people’s houses.<br/><br/>Didn’t she know why she was there?<br/><br/>The Li Family staying in Xiao Family Village must have been able to get more information than others. Instead of pleasing them, she had thoroughly offended them.<br/><br/>Liang Haohan repeatedly apologized to Li Minxing.<br/><br/>He said, “Mr. Li, please calm down. My daughter Shanshan is spoiled by me. I will definitely teach her a lesson when I get back. I will also come and personally apologize to your wife and daughter.”<br/><br/>Li Minxing was still angry and directly refused, “There’s no need for apologies. I just hope your daughter won’t further offend my wife.”<br/><br/>“Definitely, definitely,” Liang Haohan assured him, “I’ll make sure to talk to her. Please ask your wife to calm down as well.”<br/><br/>Since Liang Haohan had already apologized in a humble manner, Li Minxing didn’t feel it was appropriate to ask them to leave directly.<br/><br/>After hanging up Liang Haohan’s phone, Li Minxing’s face turned completely dark.<br/><br/>Sitting next to him, Liang Qiming asked, “Dad, what’s wrong? Did my sister cause trouble?”<br/><br/>Liang Haohan said angrily, “Your sister is causing trouble here, living under someone else’s roof but still acting so arrogant and overbearing. She’s gone too far and has offended the host. Now they’ve called to express their anger.”<br/><br/>As the heir of the family, Liang Qiming knew why Liang Shanshan was there.<br/><br/>He frowned and said, “My sister is really out of line. The fact that she hasn’t been kicked out of the house already just proves that the hosts are generous.”<br/><br/>Liang Haohan nodded and then said, “I’ll call your sister now.”<br/><br/>Aside from warning her, he also wanted to ask about the progress of the situation.<br/><br/>Afterward, Liang Haohan called Liang Shanshan and immediately scolded her, “Liang Shanshan, what’s the matter with you? You want to act like the master even in someone else’s house, don’t you?”<br/><br/>He cursed her for a while, and then asked about the progress of the situation.<br/><br/>After hanging up the phone, Liang Haohan muttered angrily, “Useless girl, she can’t even catch a man.”<br/><br/>Liang Qiming comforted him with a smile, “Dad, don’t be angry. My sister is talented and beautiful. Sooner or later, she’ll get Su Yichen. Then, the whole business world will respect us, and we’ll achieve great success.”<br/><br/>Liang Qiming’s greatest wish now was to step on Su Yichen.<br/><br/>Why should Su Yichen, being so young, be the National Richest Person, while they, as heirs to conglomerates and rich children, be compared to being trampled in the mud?<br/><br/>Liang Haohan was still angry, he grumbled, “Your useless sister has spent so many years and still hasn’t caught Su Yichen. She’s even been overtaken by others.”<br/><br/>Liang Qiming’s eyes flickered and then said, “Dad, why don’t I go to Xiao Family Village, too?”<br/><br/>Liang Haohan asked, “What are you going to do there?”<br/><br/>Liang Qiming said, “Dad, my sister hasn’t made any progress with Su Yichen, right? So, how about we do this: she pursues Su Yichen, and I pursue the girl he likes.<br/><br/>With my sister and me in the middle, even the strongest relationship will seem shaky. Perhaps with just a little trick, we could separate them. Then my sister can take advantage of the situation, right?”<br/><br/>Upon hearing this, Liang Haohan considered it for a moment and said, “The plan is good? But I heard your sister say that the girl Su Yichen likes is the Chairman of the Lu Xian Group! That person is quite mysterious in the outside world.”\t\t\t\t\t\t</div>", "images": {}, "success": true}