{"id": 411, "url": "https://www.novelhall.com/the-lucky-star-blessing-the-whole-village-32483/15193503.html", "title": "Chapter 411 - Chapter 411: Chapter 402:", "volume": 5, "volume_title": "Volume 5", "body": "<h1>Chapter 411 - Chapter 411: Chapter 402:</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 411: Chapter 402:<br/><br/>Jiang Yifan ran to the hotel, found Su Yichen, and directly complained to him.<br/><br/>He puffed up his little face and said, “Dad, a woman came to see mom. She told mom to stay away from you, saying that you two are celebrated as a golden boy and a jade girl in Capital City.”<br/><br/>As soon as Su Yichen heard this, he didn’t bother with the ongoing international video conference.<br/><br/>He stood up immediately, his face full of anger, and asked, “When and where was this?”<br/><br/>He even ignored Jiang Yifan calling him dad.<br/><br/>Su Yichen didn’t notice this title, but his subordinates, who were in the meeting with him, were as if they had been hit by boiling water, all thrown into chaos.<br/><br/>“Wait, the Boss has a kid?”<br/><br/>“The Boss is even married, and his kid is already this big?”<br/><br/>“When did the boss get married?”<br/><br/>…<br/><br/>Su Yichen only managed to deal with that woman, to prevent her from always bothering Xiao Jinli.<br/><br/>Su Yichen quickly left the hotel, with Jiang Yifan running after him, yelling as he went, “Dad, wait for me, wait for me!”<br/><br/>Only then did Su Yichen pay attention to his title, he happily asked, “Little Fanfan, what did you call me just now? Did you call me dad?”<br/><br/>Jiang Yifan nodded his little head, “Yeah. Mom has a rival, I have to let that woman know that we are a family, and make her back off.”<br/><br/>Su Yichen immediately picked him up, stroked his soft hair, and said with great joy, “Good, let’s father and son together, drive that woman away.”<br/><br/>Jiang Yifan nodded, “Yeah, let’s drive her away.”<br/><br/>After all, tourists have been driven away from Xiao Family Village before.<br/><br/>People who did wrong things in Xiao Family Village were always driven out.<br/><br/>Su Yichen left the hotel carrying Jiang Yifan, he didn’t go to find Liang Shanshan right away, instead he went to the hospital to find Xiao Jinli.<br/><br/>Xiao Jinli did not have emergency duty today, so she was in the hospital helping her future sister-in-law with rehabilitation, but she seemed to be somewhat absent-minded.<br/><br/>Xiao Junxuan felt that his sister was a bit of an eyesore here.<br/><br/>He said, “Sis, you’re off emergency duty today, why don’t you go and check the greenhouse?”<br/><br/>Xiao Jinli raised an eyebrow, “Brother, as long as there’s no emergency patients, I can go where I want. I want to accompany Sister Xiaoxiao now, why are you finding me bothersome? You really prioritize love over sister!”<br/><br/>Lin Xiaoxiao was now able to stand up and walk short distances without the wheelchair. However, while Xiao Jinli’s medical skills were exceptional, rehabilitation was not something that could be done in an instant, it had to be taken slowly.<br/><br/>Lin Xiaoxiao laughed and said, “I also want little sister to accompany me and chat. I find you bothersome.”<br/><br/>Xiao Junxuan, “…” It was always like this. Every time his sister came, his darling fiancee would find him bothersome.<br/><br/>Xiao Junxuan shrugged, showing a helpless expression, “Alright, I’m the one being bothersome, I’ll make room and disappear from your sight for now.”<br/><br/>He then massaged Lin Xiaoxiao’s leg a bit and left.<br/><br/>Seeing it, his sister must have something to discuss with his darling fiancée.<br/><br/>After Xiao Junxuan left, Lin Xiaoxiao asked curiously, “Jinli, what’s wrong? You seem to be in a bad mood?”<br/><br/>Xiao Jinli’s mood was usually very calm, unruffled, and rarely showed emotional fluctuations.<br/><br/>This was the first time Lin Xiaoxiao saw Xiao Jinli frown looking troubled.<br/><br/>Thus, she became very curious. In her eyes, the omnipotent fairy, what was there to trouble her?<br/><br/>Xiao Jinli smiled faintly and shook her head, “I’m fine.”<br/><br/>Lin Xiaoxiao asked skeptically, “Are you really okay?”<br/><br/>Xiao Jinli hesitated for a moment.<br/><br/>Lin Xiaoxiao took her hand and said seriously, “Jinli, technically we will be sisters-in-law, but in reality, we are sisters, you can share your worries with me as a sister. Even if I can’t help much, I can give some advice or simply lend an ear to your troubles.”<br/><br/>Xiao Jinli had many friends, but she only had one real confidant, Su Yichen, who was no longer there.<br/><br/>Lin Xiaoxiao understood Xiao Jinli. She had always shown so much maturity and excellence, that people often overlooked the fact that she was still a young girl with her own worries and troubles typical of her age.<br/><br/>Lin Xiaoxiao, around the same age as Xiao Jinli, understood this very well.<br/><br/>Xiao Jinli opened her mouth to speak, but hesitated. After a while, she said, “Sister, I… I don’t know if I should accept Little Brother Xiao Quan?”<br/><br/>Ever since Su Yichen confessed his feelings to her, she had been conflicted.<br/><br/>She had been betrayed before, but she admitted that it was her own lack of judgment.<br/><br/>But since coming to this world, she couldn’t deny that there really were many wonderful men. For instance, her father Xiao Wanshan, her uncle Gao Jianjun, and her cousin brothers. They all loved and cherished women.<br/><br/>Watching the interactions between these couples, she found it intriguing and somewhat enviable. Perhaps this was what marriage was supposed to be like.<br/><br/>When she was a child, she told herself that she would never fall in love or get married.<br/><br/>However, her younger self had overlooked one thing.<br/><br/>She was no longer the lonely person who only had herself, she now had parents, grandparents, and many relatives and friends. These people all cared for her, loved her, concerned about her, and also worried about her.<br/><br/>At the same time, they also respected her.<br/><br/>But if she really chose not to get married in this lifetime, her family might respect her decision, but at the same time, they would undoubtedly worry more about her.<br/><br/>Unmarried people wouldn’t have someone to support them. Perhaps they would end up growing old alone.<br/><br/>Lin Xiaoxiao didn’t know why Xiao Jinli was having such a dilemma.<br/><br/>She didn’t directly respond. Instead, she asked, “Don’t you like your Little Brother Xiao Quan? Or do you really just see him as a brother? Let’s say, hypothetically, if one day he marries someone else, have you thought about whether you would feel upset or hurt?”<br/><br/>Xiao Jinli thought about it. The idea of Su Yichen marrying someone else and having children did indeed make her feel somewhat upset.<br/><br/>Xiao Jinli then asked, confused, “Sister Xiaoxiao, what is ‘liking’ someone and what is ‘love’?”<br/><br/>She thought she had experienced love before. After all, before crossing worlds, she did have a boyfriend.<br/><br/>But now she questioned whether she had dated a sham boyfriend. Otherwise, why would he betray her so easily?<br/><br/>What exactly is love? Isn’t it when two people are together?<br/><br/>She was somewhat unsure.<br/><br/>Lin Xiaoxiao looked at Xiao Jinli, clearly seeing the young girl’s confusion and bewilderment.<br/><br/>Who would have thought that the almighty Lucky Star Jinli didn’t really know what love is?<br/><br/>Perhaps because she didn’t understand, she found Su Yichen’s sudden confession uncomfortable, and was now primarily confused and perplexed.<br/><br/>Lin Xiaoxiao suddenly felt very sorry for Xiao Jinli.<br/><br/>It can’t be denied, everyone loved Xiao Jinli.<br/><br/>But Xiao Jinli’s strength had made everyone overlook the fact that she was a girl who didn’t understand love.<br/><br/>Everyone was trying to match her with Su Yichen, yet they neglected Xiao Jinli’s feelings about love.\t\t\t\t\t\t</div>", "images": {}, "success": true}