{"id": 410, "url": "https://www.novelhall.com/the-lucky-star-blessing-the-whole-village-32483/15193502.html", "title": "Chapter 410 - Chapter 410: Chapter 401:", "volume": 5, "volume_title": "Volume 5", "body": "<h1>Chapter 410 - Chapter 410: Chapter 401:</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 410: Chapter 401:<br/><br/>Xiao Jinli led Jiang Yifan, whose small eyes were slightly entangled and his expression seemed hesitant.<br/><br/>Xiao Jinli rolled her eyes at him and said, “Alright, just say what you want to say. Look at your little face, all wrinkled like an old man’s. Be careful, or you’ll really turn into one.”<br/><br/>After hesitating for a moment, Jiang Yifan whispered, “Mom, you might have a love rival!”<br/><br/>Xiao Jinli, “…”<br/><br/>She tapped his little head, “Why are you worrying so much at such a young age?”<br/><br/>Jiang Yifan touched the spot where he had been hit and said with an air of superiority, “How could I not understand? I’m smart. It’s you adults who think I don’t understand. Let me tell you, I like Uncle Su, and I want him to become my dad.”<br/><br/>Xiao Jinli, speechless, said, “Alright, find your biological mom, and maybe you can have Uncle Su become your dad.”<br/><br/>Now it was Jiang Yifan’s turn to be speechless.<br/><br/>Jiang Yifan rolled his eyes and asked, “Mom, are you really going to let Uncle Su become someone else’s boyfriend or husband? Are you sure you won’t regret it?”<br/><br/>Xiao Jinli stopped in her tracks and fell deep into thought.<br/><br/>Would she really allow Su Yichen to be someone else’s boyfriend or husband?<br/><br/>Honestly, she wasn’t sure, but a voice in her heart told her she didn’t want that.<br/><br/>Jiang Yifan called out to Xiao Jinli several times.<br/><br/>After snapping her out of her thoughts, Jiang Yifan asked curiously, “Mom, what were you thinking about? I called you so many times, but you didn’t respond.”<br/><br/>Xiao Jinli tapped his head again, “We adults are thinking about things, you don’t have to worry about it.”<br/><br/>Jiang Yifan touched his tapped head and protested, “Mom, stop tapping my head like this; it might make me stupid. If I become stupid, won’t you lose your smart baby?”<br/><br/>Xiao Jinli raised her hand to hit him again but Jiang Yifan quickly ran away, saying, “I think you’re addicted to hitting me, right? No, I’m going to tell Grandma.”<br/><br/>Xiao Jinli, “…”<br/><br/>Well, that might indeed be true.<br/><br/>Xiao Jinli had just taken a few steps when Li Jiatong came hopping over.<br/><br/>“Sister Jin Li, do you have a moment?” As she asked this question, her eyes darted all around.<br/><br/>“Yes, Xiaotong, what’s the matter?” Xiao Jinli asked puzzled.<br/><br/>Li Jiatong stepped forward and whispered, “Sister Jin Li, yesterday, a woman came to my house. I don’t like her. As soon as she arrived, she ordered me and my mom around. My mom didn’t make things difficult for her because she was a guest.<br/><br/>Later, she asked my mom and me about you. We gave her a little bit of information, but not too much.<br/><br/>Sister Jin Li, I think she has ill intentions. Be careful. If she does anything excessive, let me know, and I’ll drive her out of my house.”<br/><br/>But for now, I can’t drive her away. She is a guest introduced by my dad and is the daughter of a business partner from Capital City. She said she wanted to stay in Xiao Family Village for a few days. The hotel had no rooms available, so she stayed at our house.”<br/><br/>After moving to Xiao Family Village, they never hired any household help, so all the housework was done by Li Jiatong and her mother, and sometimes her father when he was home.<br/><br/>However, when Liang Shanshan arrived, she treated her mom as a nanny and her like the nanny’s daughter, acting arrogant and domineering. She ordered them around but wouldn’t let her call her Sister Liang, thinking she was unqualified.<br/><br/>Later, her mom couldn’t take Liang Shanshan’s excessive behavior anymore and directly told her, “Miss Liang, you are a guest introduced by my husband, Old Li, and I will certainly treat you well. But please, be a proper guest.”<br/><br/>This was when Liang Shanshan realized that she had misunderstood.<br/><br/>But even after realizing her mistake, she did not apologize. Instead, she got dressed up in a ridiculous village girl outfit.<br/><br/>Li Jiatong, seeing that she didn’t even show any sign of apologizing, was incredibly frustrated.<br/><br/>Later, upon hearing her inquire about Miss Xiao’s identity, Li Jiatong blurted out, “What are you trying to find out about Sister Jinli?”<br/><br/>After that, Liang Shanshan found out that Miss Xiao was Xiao Jinli.<br/><br/>The second day, she came directly to look for Xiao Jinli.<br/><br/>Xiao Jinli patted Li Jiatong’s shoulder and said with a smile, “Don’t worry, I know what’s going on. On my own territory, who can bully me? When have you ever seen me get bullied?”<br/><br/>No one had ever been able to bully her since childhood.<br/><br/>Li Jiatong said, “Sister Jinli, I know that no one can bully you, but last night I overheard her asking my mom about you and Brother Su Yichen.<br/><br/>We’ve been living in Xiao Family Village for so long that we basically know the relationship between Su Yichen and your family. So we didn’t reveal anything to her.<br/><br/>However, my mom asked my dad about Liang Shanshan, and the reputation she found was not good. People from the whole Capital City socialite circle know that Liang Shanshan once claimed that if she married Su Yichen, she would become Lady Su.<br/><br/>It’s said that many talented men in Capital City are her willing followers.”<br/><br/>At this point, Li Jiatong angrily said, “This Liang Shanshan is really shameless. She has never lacked men by her side, and yet she dares to openly pursue Big Brother Su. Where did she get this courage? Is she Liang Jingru?”<br/><br/>“…” Xiao Jinli responded somewhat speechlessly, “Jiatong, you’re still a child. Uh, you’d better not listen to these rumors.”<br/><br/>“…” Li Jiatong sighed gently and said, “Sister Jinli, I’m sixteen years old this year, not a little girl anymore. I already know what I need to know.”<br/><br/>At this point, Li Jiatong’s eyes rolled and she whispered, “My mom said that it’s best for Liang Shanshan not to do anything outrageous. Otherwise, my family will not care if she’s a guest or not, and will definitely kick her out.”<br/><br/>The fact that Li Minxing’s family could live in Xiao Family Village proved that they had good character and proper values.<br/><br/>They had been staying in Xiao Family Village for quite some time, and it was their first time seeing Su Yichen visit Xiao Jinli’s home. They were very surprised.<br/><br/>Later, they learned from the villagers that Su Yichen had spent half a year in Xiao Family Village eight or nine years ago.<br/><br/>At that time, he was brought down from the mountain by Xiao Jinli and had lost his memory after waking up in the hospital. He then gave himself the name Xiao Siqian, meaning to remember the kindness and gratitude of Xiao Jinli and her family, and lived in Xiao Jinli’s house.<br/><br/>Back in those days, Xiao Jinli was still young, and Su Yichen was not much older. They both had enemies, so everyone treated them as brother and sister.<br/><br/>Now that Su Yichen had returned, everyone realized that the children from back then had all grown up.<br/><br/>Although Su Yichen was eight years older than Xiao Jinli, he was an excellent individual, and outstanding people should be with other outstanding people. Moreover, Su Yichen really liked Xiao Jinli, so everyone intentionally or unintentionally wanted to bring them together.<br/><br/>Li Jiatong might be young, but she also had some ideas about their situation from listening to adult conversations.<br/><br/>After thinking for a moment, Li Jiatong said, “Sister Jinli, you’re so beautiful and capable; Big Brother Su likes you so much. That Liang Shanshan definitely doesn’t stand a chance.”<br/><br/>Xiao Jinli smiled and said, “Alright, I know. I have some work to do now. Do you want to come with me?”<br/><br/>Li Jiatong shook her head and said, “No need, I’ll go play on my own.”<br/><br/>If Xiao Jinli said she had work to do, she must be busy.\t\t\t\t\t\t</div>", "images": {}, "success": true}