{"id": 429, "url": "https://www.novelhall.com/the-lucky-star-blessing-the-whole-village-32483/15193521.html", "title": "Chapter 429 - Chapter 429: Chapter 418:", "volume": 5, "volume_title": "Volume 5", "body": "<h1>Chapter 429 - Chapter 429: Chapter 418:</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 429: Chapter 418:<br/><br/>Liang’s brother and sister met at their so-called secret base again.<br/><br/>As soon as they met, Liang Shanshan looked at Liang Qiming with contempt and asked mockingly,<br/><br/>“Liang Qiming, do you think you can compare with Su Yichen? Anyone who isn’t blind would never choose you over him!<br/><br/>After all, you’re not as handsome as him, you don’t have a body like him, and you don’t have the money like him. Why would people choose you instead of Su Yichen?”<br/><br/>Liang Qiming heard this and immediately became angry, saying, “Liang Shanshan, I think your brain is muddled. Are you jealous of my progress?”<br/><br/>At this point, he snorted coldly, mocking,<br/><br/>“There is nothing you can do. Even if I can’t compare to Su Yichen, I am smarter than you. Look, in such a short time, my progress with Xiao Jinli is rapid.<br/><br/>All I need to do is put in a little more effort, and Xiao Jinli will not be able to escape my grasp. So, whether you can become Mrs. Su or not depends on whether I help you.”<br/><br/>Liang Shanshan’s face suddenly changed, looking ugly, she coldly said,<br/><br/>“Liang Qiming, you haven’t even married Xiao Jinli yet, what are you proud of?<br/><br/>I’m telling you, do you think she could be the chairman of such a large company like Lu Xian Group if she were a simple-minded woman, easily deceived by you?<br/><br/>Maybe she’s just playing with you, and you’re still feeling so smug about it.”<br/><br/>Liang Qiming immediately shouted angrily, “Liang Shanshan, are you just sour because you can’t have what you want?<br/><br/>You don’t have the ability to get Su Yichen, and you feel unbalanced, don’t you?<br/><br/>I’m telling you, whether you can marry Su Yichen in the end still has to go through me.”<br/><br/>Liang Shanshan was also furious, saying, “Liang Qiming, you and your mother are both treacherous villains, always playing tricks behind the scenes!”<br/><br/>Liang Qiming shrugged and mocked, “Liang Shanshan, so what? At least my mother drove you away, and she and I received Dad’s love, while you could only watch our family happily.”<br/><br/>Liang Shanshan was extremely angry.<br/><br/>Liang Qiming enjoyed Liang Shanshan’s wonderful expression for a moment and then continued,<br/><br/>“Whether you admit it or not, Liang Shanshan, we now have a common goal. It’s best if you can capture Su Yichen in one fell swoop.<br/><br/>If you can’t, hehe…, you’d better be ready for Dad to arrange a marriage for you. Don’t let him pick an old man in his fifties or sixties for you.”<br/><br/>Upon hearing this, Liang Shanshan seemed to realize something, and her face turned pale.<br/><br/>Now she knew her father quite well.<br/><br/>Liang Haohan viewed her as a chess piece for alliance marriages.<br/><br/>The reason why she proclaimed that she wanted to marry Su Yichen and made herself the First Beauty of Capital City was for her own future.<br/><br/>She wanted to choose for herself, and Su Yichen was the most suitable choice.<br/><br/>Considering Liang Haohan’s ambition, capturing Su Yichen would be the best option.<br/><br/>At that time, leveraging the relationship, Liang’s would become closer with Su Corporation.<br/><br/>Moreover, Su Yichen had broken ties with his so-called relatives, and after getting him, they will inherit the entire Su Corporation.<br/><br/>So, Liang Haohan certainly wouldn’t stop Liang Shanshan from pursuing Su Yichen.<br/><br/>Thinking of this, Liang Shanshan sneered,<br/><br/>“You don’t need to worry about that. You should be worried about how we continue our plan.<br/><br/>It’s not like you can just interact with Xiao Jinli a few times and expect her to have a good impression of you, right?”<br/><br/>About this, Liang Qiming furrowed his brows.<br/><br/>This was indeed a problem.<br/><br/>These days, he had indeed interacted with Xiao Jinli but only at a distance, falling short of their original goal.<br/><br/>He hadn’t even touched a piece of her clothing, let alone more intimate contact!<br/><br/>Liang Qiming said, “Xiao Jinli is too cunning and has a strong sense of defense. She’s not like those women I used to be with! I tried all kinds of tricks, accidents, sweet talk, and gifts, but all are tactfully rejected!”<br/><br/>Liang Shanshan taunted, “Of course it’s different! Others can talk sweeter than you, and as for gifts, she has money herself and can buy whatever she wants. Why would she need your little things?”<br/><br/>At this point, she looked around and said, “In my opinion, extraordinary people require extraordinary means!”<br/><br/>“Extraordinary people require extraordinary means?” Liang Qiming asked, staring at her, “What do you mean by that?”<br/><br/>Liang Shanshan laughed and said,<br/><br/>“It’s exactly what you’re thinking of!<br/><br/>There’s a man beside Xiao Jinli who is more handsome than you, richer than you, and more romantic than you. Anyone would know who to choose.<br/><br/>Now that she’s willing to talk to you, it already means she sees you in a better light. Otherwise, she wouldn’t even know who you are!”<br/><br/>Liang Qiming felt bitter and unconvinced, even though he couldn’t deny the truth in her words!<br/><br/>Liang Shanshan continued, “However, as a woman, there is often a different feeling towards the first man they have been with!”<br/><br/>Liang Qiming understood her point, “You mean…?”<br/><br/>“That’s right!” Liang Shanshan said, “Make yourself her first man!”\t\t\t\t\t\t</div>", "images": {}, "success": true}