{"id": 426, "url": "https://www.novelhall.com/the-lucky-star-blessing-the-whole-village-32483/15193518.html", "title": "Chapter 426 - Chapter 426: Chapter 415:", "volume": 5, "volume_title": "Volume 5", "body": "<h1>Chapter 426 - Chapter 426: Chapter 415:</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 426: Chapter 415:<br/><br/>Everyone in Xiao Family Village was putting on a show with Xiao Jinli, including Li Jiatong.<br/><br/>Of course, the outsiders who had moved in had not participated in this.<br/><br/>After all, they were not natives of Xiao Family Village, and their trust and admiration for Xiao Jinli were not as high.<br/><br/>From what they knew, Xiao Jinli was a Divine Doctor and the Chairman of the Lu Xian Group.<br/><br/>They didn’t understand why the villagers had reserved the Chairman position for Xiao Jinli until she came of age.<br/><br/>Mingming, the Director, should have been more capable and prestigious.<br/><br/>But eight years ago, Xiao Jinli was just eleven years old.<br/><br/>Of course, the outsiders who settled in Xiao Family Village had definitely received Xiao Jinli’s approval, so their character was absolutely not an issue.<br/><br/>But just because their character wasn’t an issue didn’t mean they would listen to a child.<br/><br/>Furthermore, there was always some distance between local villagers and newcomers.<br/><br/>None of the outsiders were rural people; they were either rich or powerful.<br/><br/>This was the difference.<br/><br/>“Sister Shanshan, you don’t know, but Sister Jin Li rarely gets close to men. Your brother is only the second one. Of course, the first one is Su Yichen.” Li Jiatong said to Liang Shanshan.<br/><br/>Upon hearing this, Liang Shanshan’s eyes filled with jealousy.<br/><br/>She had been here for so long and had only seen Su Yichen, who had warned her twice.<br/><br/>But things were different with Liang Qiming. In such a short time, he had made such great progress with that woman.<br/><br/>That woman was also really shameless.<br/><br/>Mingming was already so intimate with Su Yichen, yet she was still able to hook up with Liang Qiming.<br/><br/>Of course, such a situation was the most advantageous for her.<br/><br/>If Liang Qiming could marry the beauty, not only would the Liang Family get a daughter-in-law, but they would also get a golden nugget. By then, everything in Xiao Family Village would belong to the Liang Family.<br/><br/>On the other hand, if Su Yichen couldn’t marry Xiao Jinli, he would naturally turn his attention to her.<br/><br/>These days, she had been quite peaceful in Xiao Family Village.<br/><br/>Liang Shanshan asked, “Xiao Tong, do you know Su Yichen’s attitude from Xiao Jin Li’s mouth?”<br/><br/>Before Liang Shanshan came, Su Yichen and Xiao Jinli were inseparable.<br/><br/>Of course, Liang Shanshan and Liang Qiming didn’t know about this until now.<br/><br/>All they knew was that Su Yichen had confessed to Xiao Jinli.<br/><br/>However, after they arrived, they only knew that Su Yichen would return to the Xiao Family every day, but they couldn’t enter the Xiao Family’s home and didn’t know how they got along. They also had no idea what Su Yichen’s attitude was regarding Liang Qiming and Xiao Jin Li’s closeness.<br/><br/>Liang Shanshan could only try to find out from Li Jiatong, who was close to Xiao Jinli.<br/><br/>Of course, in order to seek Li Jiatong’s help, besides the necklace and earrings, she had gradually sent more things. Of course, the value of these things was far less than the necklace and earrings; they were just meant to win Li Jiatong’s heart.<br/><br/>Li Jiatong said, “I don’t know about Xiao Jin Li and Su Yichen. Before, it seemed that their relationship was good. Although they were not a couple, they acted like one. But recently, it seems that Sister Jin Li and Su Yichen are having conflicts.”<br/><br/>Liang Shanshan’s eyes lit up at this, “Conflicts? Are you sure?”<br/><br/>Li Jiatong shook her head, “I don’t know. I’m just guessing. Every time I mention Su Yichen, Sister Jin Li seems to be a bit unhappy, so I wonder if it has something to do with Su Yichen?”<br/><br/>Liang Shanshan’s face darkened a bit, and then she said, “Xiao Tong, you go and investigate first, and see if their relationship has really broken down.”<br/><br/>Li Jiatong nodded, “Alright!”\t\t\t\t\t\t</div>", "images": {}, "success": true}