{"id": 422, "url": "https://www.novelhall.com/the-lucky-star-blessing-the-whole-village-32483/15193514.html", "title": "Chapter 422 - Chapter 422: Chapter 411:", "volume": 5, "volume_title": "Volume 5", "body": "<h1>Chapter 422 - Chapter 422: Chapter 411:</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 422: Chapter 411:<br/><br/>Liang Shanshan was in a good mood when she went to see Liang Qiming.<br/><br/>Liang Qiming had already gone to the Zhu family, carrying his suitcase.<br/><br/>Just like the Li family, the Zhu family had their family members around them.<br/><br/>His parents and wife were here, while his children had gone abroad to study.<br/><br/>Mother Zhu arranged Liang Qiming to stay in the guest room.<br/><br/>He had just set down his suitcase when he received a message from Liang Shanshan, raising his eyebrows.<br/><br/>Previously, Liang Shanshan hadn’t made much progress, but in such a short time, she had a new plan.<br/><br/>Liang Qiming then went out to meet Liang Shanshan.<br/><br/>Liang Qiming directly asked, “What’s up?”<br/><br/>Liang Shanshan said directly, “I’ve bribed that girl from the Li family. She will arrange a meeting between you and Xiao Jinli according to my plan. Once you meet Xiao Jinli, we can proceed with our other plans!”<br/><br/>Upon hearing this, Liang Qiming immediately became interested and said, “Oh, tell me about your plans!”<br/><br/>Liang Shanshan said, “Before you came, I planned to arrange a date for Xiao Jinli with a man she knows well and gets along with, and then have Su Yichen catch them in bed! But now the plan has changed a bit. Now, it’s just a change of person. Liang Qiming, you must dress yourself up well and not be outdone by Su Yichen!”<br/><br/>Liang Qiming’s face darkened, but he quickly nodded and laughed, “This plan doesn’t sound very strategic, but as long as it works, it’s fine. Okay, I’ll cooperate!”<br/><br/>At this point, he paused and said with a warning, “Liang Shanshan, you want Su Yichen, and I want Xiao Jinli. It’s a win-win situation for both of us, so I hope you won’t do anything unnecessary!”<br/><br/>Liang Shanshan snorted coldly at this, “For the benefit of the overall situation, I don’t need your reminder; I know. However, I’ll remind you, Xiao Jinli is not an easy character! You’d better be careful!”<br/><br/>Liang Qiming sneered, his face showing a hint of contempt, and said lightly, “She’s just a woman! No woman can escape the stupid love trap! You don’t need to worry about this!”<br/><br/>Liang Shanshan didn’t bother trying to persuade him anymore!<br/><br/>After all, she didn’t understand Xiao Jinli herself!<br/><br/>When they first met, Xiao Jinli didn’t take her provocation seriously!<br/><br/>Su Yichen didn’t have Xiao Jinli’s capabilities!<br/><br/>He thought that just by warning Liang Shanshan, he could make her back off!<br/><br/>But he never expected that they would dare to target Xiao Jinli directly!<br/><br/>Su Yichen went to the hospital to pick up Xiao Jinli and take her home!<br/><br/>Su Yichen said, “Jinli, a crazy woman came to Capital City, and she keeps following me, claiming that we are a couple based on the rumors. She didn’t even say it herself but used others’ words as an excuse.”<br/><br/>Xiao Jinli raised her eyebrows!<br/><br/>She had met that Liang Shanshan, no rather, Liang Shanshan had deliberately waited for her to come and then said those words!<br/><br/>But she wasn’t angry, nor was she jealous!<br/><br/>Because she trusts Su Yichen’s character! He wouldn’t have any ambiguous relationships with any woman!<br/><br/>Seeing Xiao Jinli’s somewhat amused expression, Su Yichen was a little puzzled!<br/><br/>Su Yichen continued, “I’ve warned her! If she keeps talking nonsense, I’ll attack her family’s business directly!”<br/><br/>Xiao Jinli, “…”<br/><br/>That woman just thought about how to frame her? She even got in touch with Li Jiatong!<br/><br/>Xiao Jinli said, “Brother Little Quan, I won’t believe any unfamiliar person’s provocation! Don’t worry about it!”<br/><br/>Su Yichen felt a little embarrassed and said, “I’m just worried!”<br/><br/>Xiao Jinli replied ambiguously, “You don’t need to worry! If someone says something bad about me in front of you, or if you see something with your own eyes, would you believe me?”<br/><br/>Su Yichen didn’t hesitate and said, “Of course!”<br/><br/>Xiao Jinli couldn’t help but laugh, “That’s incredible!”<br/><br/>Su Yichen, “…”\t\t\t\t\t\t</div>", "images": {}, "success": true}