{"id": 424, "url": "https://www.novelhall.com/the-lucky-star-blessing-the-whole-village-32483/15193516.html", "title": "Chapter 424 - Chapter 424: Chapter 413:", "volume": 5, "volume_title": "Volume 5", "body": "<h1>Chapter 424 - Chapter 424: Chapter 413:</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 424: Chapter 413:<br/><br/>Xiao Jinli and Liang Qiming quickly got acquainted under the introduction of Li Jiatong.<br/><br/>After finding out Xiao Jinli’s address, Liang Qiming would just happen to bump into her while waiting around in the area.<br/><br/>“Miss Xiao, what a coincidence. Where are you off to?”<br/><br/>“Miss Xiao, last night I saw a beautiful piece of jewelry online, and I thought it would suit you perfectly. I wanted to buy it for you as a gift.”<br/><br/>…<br/><br/>Regarding Liang Qiming’s appearance, Xiao Jinli didn’t order anyone to drive him away, and the security personnel wouldn’t do so without being told. They were just a bit puzzled.<br/><br/>As for Liang Qiming’s “coincidental encounter,” Xiao Jinli politely nodded her head and then continued with her own business without engaging with him.<br/><br/>Liang Qiming followed her and said, “Miss Xiao, I’m new here, and I’m not familiar with this place. Can I ask you to be my tour guide?”<br/><br/>Xiao Jinli declined, “I’m sorry, Mr. Liang, I’m very busy and I’m afraid I don’t have time to be your tour guide. If you really need someone to guide you, our information desk has free tour guides, or perhaps you can ask Tongtong to be your guide.”<br/><br/>Liang Qiming said, “But Miss Xiao, you are a local of the Xiao Family Village and are surely more familiar with the local customs and practices, right?”<br/><br/>Xiao Jinli shook her head, saying, “Mr. Liang, the tour guides at our information desk are also locals of the Xiao Family Village. I’m sorry, Mr. Liang, I have urgent matters to attend to. I must go now.”<br/><br/>With that, Xiao Jinli hurriedly left.<br/><br/>These days, Liang Qiming’s occasional encounters with Xiao Jinli did not go unnoticed by everyone.<br/><br/>“Jinli, who is that guy?”<br/><br/>“Just a stranger.”<br/><br/>“Ha, a stranger? Is he trying to pester you? Should we drive him away?”<br/><br/>The people of the Xiao Family Village now have enough confidence to kick people out if they don’t like them.<br/><br/>Xiao Jinli waved her hand and said, “Not for now. I have other plans for him. Uncle, tell everyone not to make a fuss when he’s with me.”<br/><br/>Uncle Xiao was puzzled and asked, “Jinli, can you tell us what kind of person he is and if he has any intentions towards you?”<br/><br/>Xiao Jinli smiled and said, “Don’t worry, Uncle. No matter if he’s a dragon or a tiger elsewhere, he has to crouch in front of me in the Xiao Family Village. Besides, I wouldn’t let outsiders bully me here.”<br/><br/>Uncle Xiao was still a little worried, “But Jinli, what exactly does he want to do?”<br/><br/>Xiao Jinli raised an eyebrow, “Uncle, don’t worry about him. Just sit back and enjoy the show.”<br/><br/>Uncle Xiao was puzzled, “Enjoy the show?”<br/><br/>Xiao Jinli’s smile was enigmatic.<br/><br/>Subsequently, Uncle Xiao laughed, “Alright, let’s enjoy the show. I’ll tell everyone to be cautious and not to disturb you.”<br/><br/>Hearing about the show, Uncle Xiao was especially interested!<br/><br/>Uncle Xiao suddenly remembered something and asked, “That young man was walking so close with you just now. People might think he’s either your lover or friend, Jinli. Are you sure it’s okay? Won’t Little Quan misunderstand?”<br/><br/>Xiao Jinli laughed, “Uncle, think about it like this! If Little Quan mistrusts me so easily and doesn’t believe me, then there’s no need for us to be lovers, right?”<br/><br/>Uncle Xiao suddenly understood and nodded, “That’s true! Well then, Jinli, go ahead and do your thing! Should we tell Little Quan?”<br/><br/>Xiao Jinli shook her head and said, “Uncle, what’s the difference between you telling everyone and telling him? Unless he doesn’t care about me at all!”<br/><br/>Uncle Xiao nodded, “Alright, I got it!”<br/><br/>Soon, the whole village, including the employees working at the Xiao Family Village, received a notification!<br/><br/>Many people were both interested and puzzled after reading the message.<br/><br/>What is Jinli (Chairman) going to do?<br/><br/>Without exception, Su Yichen also received the message!<br/><br/>He didn’t rush to confront Xiao Jinli right away.<br/><br/>He believed Xiao Jinli must have had a reason for doing so!<br/><br/>But the man Liang Qiming seemed familiar!<br/><br/>Su Yichen mused, “It seems that Liang Qiming is the son of Liang Haohan.”<br/><br/>He immediately called one of his subordinates, “Hey, find out where Liang Haohan’s son, Liang Qiming, is right now.”<br/><br/>Not long after Su Yichen hung up, the other party called back to report, “Boss, Liang Qiming is at the Xiao Family Village and is currently staying at Zhu Hongguang’s house!”<br/><br/>Su Yichen frowned slightly, “Zhu Hongguang?”<br/><br/>“Zhu Hongguang, the Chairman of Zhu Group! Zhu Hongguang and his family moved to the Xiao Family Village half a year ago!<br/><br/>Also, our people found out that more than ten days ago, Liang Qiming’s sister Liang Shanshan also went to the Xiao Family Village and is currently staying at Li Minxing’s house of the Li Group! Moreover, Boss, Liang Shanshan’s target seems to be you!”<br/><br/>“Our people investigated that the reason Liang Shanshan went to the Xiao Family Village to find you was because she was provoked by the news of your confession to Miss Xiao!<br/><br/>After all, she has been claiming all along that she wouldn’t marry anyone but you!”<br/><br/>“Ugh!”<br/><br/>Su Yichen suddenly let out a retching sound!<br/><br/>“Boss, are you alright?” The subordinate on the other end immediately asked with concern!<br/><br/>Su Yichen waved his hand, “I’m fine! It’s just that your last sentence made me sick!”<br/><br/>The person on the other end, “…”<br/><br/>Su Yichen continued, “I’ve already met with Liang Shanshan and warned her! However, it seems that my warning has not been effective! Xiao Li, you collect evidence of the crimes and violations of the Liang Group and Liang Haohan. Then, wait for my order!”<br/><br/>“Alright, boss!” The subordinate on the other end hesitated for a moment and then agreed!<br/><br/>He knew that when the boss said this, it probably meant he was going to make a move on the Liang Group!<br/><br/>In the past, the Liang Group had been eyeing the Su Corporation covetously, and Liang Haohan had been jumping around for it.<br/><br/>There was even an attempt to take advantage of the boss’s disappearance, but it didn’t work.<br/><br/>The boss just ignored it, watching it like a clown!<br/><br/>Who would have thought that just by Liang Shanshan going to the Xiao Family Village, she would provoke the boss!<br/><br/>It seems that once the boss makes a move, the Liang Group and Liang Haohan will suffer greatly, even if they don’t die!<br/><br/>One wonders what Liang Haohan was being greedy for!<br/><br/>He already had such a large enterprise as the Liang Group in his hands, but he still wanted to seize the Su Corporation!<br/><br/>The Su Corporation, as the largest enterprise in the country, wasn’t something he could just take over!<br/><br/>If Liang Haohan really had such ability, then the Liang Group would have already surpassed the Su Corporation and become the largest enterprise!<br/><br/>So, people must know their limits in everything they do, or else they won’t even know how they die!<br/><br/>The subordinate suddenly felt sympathy for Liang Haohan!<br/><br/>But the good are hard to persuade the stubborn, so he decided not to meddle and just focus on doing what the boss had told him!\t\t\t\t\t\t</div>", "images": {}, "success": true}