{"id": 427, "url": "https://www.novelhall.com/the-lucky-star-blessing-the-whole-village-32483/15193519.html", "title": "Chapter 427 - Chapter 427: Chapter 416:", "volume": 5, "volume_title": "Volume 5", "body": "<h1>Chapter 427 - Chapter 427: Chapter 416:</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 427: Chapter 416:<br/><br/>Xiao Family<br/><br/>During dinner, Xiao’s mother asked with doubt, “Xiao Bao, what’s going on between you and that Liang Qiming?”<br/><br/>Xiao Jinli replied, “Nothing. I’ve been bored lately. Someone came to play, so why not have some fun.”<br/><br/>Xiao’s mother reminded her, “If you want to have fun, don’t go overboard! Now, people who don’t know might think that you didn’t accept Xiao Quan’s pursuit and fell for someone else!<br/><br/>Thankfully, everyone in our Xiao Family Village knows that you and Liang Qiming are acting, otherwise, they might think that for the first time, you got scolded! After all, everyone used to trust your judgment, but now when it comes to yourself, you seem to have lost that ability.”<br/><br/>Xiao Jinli laughed and said, “I think everyone has nothing else to do, so why not let them act and have some fun? Mom, you don’t know how Auntie Li’s acting skills exploded, she could possibly win an Oscar! It was so amazing that it scared Liang Qiming away!”<br/><br/>“Hehe… ”<br/><br/>Everyone laughed!<br/><br/>“Now everyone wants to act and have some fun, so I’ll tell my big brother to set up a Film and Television Company division!”<br/><br/>“Good baby, what did you say? Set up another Film and Television Company? Does this mean that the company will invest in making movies in the future?” Grandma Xiao was very excited!<br/><br/>Xiao Jinli smiled and replied, “Yes, Grandma, in the future, if you want to act in any movie, just say it, and we’ll let you star! Empress Dowager and Grand Empress Dowager, or Wealthy Grandma, whatever role you want, it’s up to you!”<br/><br/>Grandma Xiao waved her hand and laughed, saying, “No, no, I can’t act at my age. Professional things should be left to professionals, I won’t join in this excitement!”<br/><br/>Xiao Jinli laughed and said, “Grandma, we’re not here to join any excitement! The true purpose of the company establishing a Film and Television Company is to make everyone happy and do things that they enjoy and like!<br/><br/>My big brother and I have already decided that the first TV drama to be produced after the establishment of the Film and Television Company is called “Country Story”. We’ll showcase the customs, specialties, and flavors of our Xiao Family Village, so everyone can get to know it!”<br/><br/>Upon hearing this, Grandma Xiao thought for a moment and happily agreed, “Then let’s show the poverty of Xiao Family Village before it became prosperous! Let everyone know how poor we were before we became rich, and how many people couldn’t even afford a proper meal!”<br/><br/>Maternal grandmother laughed and said, “That’s true. Back then, although we were poor, we weren’t so poor that we couldn’t even eat a meal, but Xiao Family Village was indeed like that every year!”<br/><br/>Grandma Xiao said, “But we can’t blame ourselves, can we? The people in our village are all diligent, but we were plagued with years of drought. Even those who were good at farming had no way to grow crops on dry land!”<br/><br/>Maternal grandmother said, “Those years were really strange! In other villages, everything was going smoothly, but when it came to Xiao Family Village, dark clouds came, and the rain fell in the neighbor village! Xiao Family Village was so poor that young men couldn’t find a wife, and girls from other villages were unwilling to marry in. It seemed like there was an endless queue of bachelors, with no solution!”<br/><br/>Grandma Xiao continued, “Later, after Good Baby was born, the situation in our village improved, and everything went smoothly. Everyone’s spirits were lifted, and people gradually became rich! Then, when Good Baby introduced earthworms to improve the soil, our village soared to new heights!”\t\t\t\t\t\t</div>", "images": {}, "success": true}