{"id": 420, "url": "https://www.novelhall.com/the-lucky-star-blessing-the-whole-village-32483/15193512.html", "title": "Chapter 420 - Chapter 420: Chapter 409:", "volume": 5, "volume_title": "Volume 5", "body": "<h1>Chapter 420 - Chapter 420: Chapter 409:</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 420: Chapter 409:<br/><br/>Li Jiatong wasted no time in finding Xiao Jinli.<br/><br/>For someone familiar with Xiao Jinli, finding her whereabouts was not difficult.<br/><br/>Xiao Jinli had only three places she frequented: home, hospital, and the company. Occasionally, she would go elsewhere to see if any projects needed improvement.<br/><br/>But whenever Xiao Jinli went out, she caused a sensation and crowding.<br/><br/>Many tourists who saw Xiao Jinli wanted to stir up trouble, but they were all crushed by Xiao Jinli’s martial prowess. They were subsequently thrown out of Xiao Family Village and blacklisted.<br/><br/>However, Xiao Jinli didn’t want to be chased like a monkey.<br/><br/>Li Jiatong didn’t have Xiao Jinli’s phone number so she had to search herself.<br/><br/>Unable to find Xiao Jinli at home, she went directly to the hospital, but she wasn’t there either, so she went straight to the company.<br/><br/>As it turned out, Xiao Jinli was in the president’s office with Jiang Yifan.<br/><br/>Jiang Yifan was playing with advanced Lego in a corner.<br/><br/>Xiao Jinli and Xiao Yucheng were discussing business matters.<br/><br/>Upon seeing Li Jiatong, Xiao Jinli asked, “Tongtong, are you looking for me?”<br/><br/>Li Jiatong carefully glanced at Xiao Yucheng, nodded her head, and spoke softly, “Sister Jin Li, I have something to tell you. Is it convenient for you? It’s about Liang Shanshan.”<br/><br/>Xiao Jinli nodded and said, “Okay, let’s go to the office next door.”<br/><br/>The office next door was actually the CEO’s office.<br/><br/>Xiao Jinli poured Li Jiatong a glass of water and asked, “Tongtong, what’s the matter?”<br/><br/>Li Jiatong took a sip of water and continued, “It’s about Liang Shanshan. She said she wants to be Su Yichen’s wife. But Su Yichen has confessed to you, right? She thinks you’re an obstacle. So…”<br/><br/>“Oh, so she wants to get rid of me, right?” Xiao Jinli chimed in.<br/><br/>Li Jiatong replied, “Yes. In order for me to help her, she even gave me a necklace worth two million.”<br/><br/>With that, she showed the necklace to Xiao Jinli, explaining, “This necklace is the grand finale of the Capital City Youth Charity Auction in March, called the ‘Water Heart’ diamond necklace, valued at two million.”<br/><br/>Xiao Jinli took a look and nodded, saying, “It’s indeed nice. You should keep it. Don’t refuse it.”<br/><br/>“Haha…” Li Jiatong was a little confused, “Sister Jin Li, this…” She really didn’t dare to accept it.<br/><br/>Xiao Jinli laughed and said, “Tongtong, don’t worry. If I tell you to accept it, then accept it. Trust me, I won’t be so easily manipulated. Just do whatever Liang Shanshan wants you to do.”<br/><br/>Li Jiatong thought for a moment and said, “Alright, then I can be at ease. Everyone knows that you are the smartest person, Sister Jin Li, and you definitely won’t be easily deceived.”<br/><br/>Xiao Jinli patted her on the shoulder, instructing, “Tongtong, just go ahead and do whatever Liang Shanshan wants.”<br/><br/>Although the target was her, the ultimate goal was Su Yichen.<br/><br/>If Su Yichen didn’t fall for it, then her poisonous tricks would be useless.<br/><br/>Li Jiatong received the two-million-worth necklace and followed Xiao Jinli’s words.<br/><br/>Liang Shanshan had no idea that Li Jiatong had told Xiao Jinli about her plan.<br/><br/>At this moment, she had to meet up with Liang Qiming after hanging up on his call.<br/><br/>Following Liang Qiming’s instructions, she found him sitting on a suitcase under a big tree.<br/><br/>Though the sun was shining brightly, Xiao Family Village was cool and refreshing. However, many people were resting in the shade under the large tree.<br/><br/>She walked up to Liang Qiming, her eyes filled with contempt, and spoke indifferently, “Come with me.”<br/><br/>Liang Qiming saw Liang Shanshan, the corners of his lips curling up faintly as he asked casually, “Where to?”<br/><br/>“I’m taking you to a place with fewer people. Do you want to discuss things with me here?” Liang Shanshan said coldly.<br/><br/>Liang Qiming sneered, “Let’s go!”<br/><br/>He followed Liang Shanshan, pulling his suitcase himself.<br/><br/>Liang Shanshan indeed took him to a secluded place.<br/><br/>Liang Qiming looked around and laughed, “Not bad, Liang Shanshan, you’ve at least found such a place during your time here. Although Xiao Family Village is teeming with tourists, every corner always has many visitors. This place is quiet.”<br/><br/>Liang Shanshan said, “It’s near the cow market. I had been here for several days and discovered that this place has fewer visitors. Enough of the nonsense, Liang Qiming, what are you up to?”<br/><br/>Liang Qiming replied, “I heard that the girl Su Yichen is pursuing is the chairwoman of the Lu Xian Group?”<br/><br/>Liang Shanshan nodded, “Indeed!”<br/><br/>“That makes things easy. Give me that girl’s information,” Liang Qiming said directly.<br/><br/>Liang Shanshan’s eyes flashed with caution and asked, “What do you want to do?”<br/><br/>Liang Qiming explained, “Simple. You pursue Su Yichen, and I’ll pursue the girl. With both of us working together, isn’t that more secure?”<br/><br/>Liang Shanshan thought for a moment and responded, “I don’t know much about her. I just found out by accident that she’s the chairwoman of the Lu Xian Group, named Xiao Jinli. But when it comes to her information, both company employees and local villagers are very vigilant and remain tight-lipped. So, there’s very little information about her.”<br/><br/>Liang Qiming furrowed his eyebrows, slightly puzzled, “So mysterious?”<br/><br/>Liang Shanshan added, “However, she is very beautiful. She’s the internet-famous ‘little beauty of the two beauties,’ with the big beauty being her mother.”<br/><br/>“Really?” Liang Qiming’s eyes lit up, and he asked with interest, “How beautiful is she, compared to you? There’s such a rumor online, but no photos. No one knows how the two of them actually look. Do you have any photos?”<br/><br/>Liang Shanshan shook her head, “No. I didn’t have time to take any.”<br/><br/>Liang Qiming rolled his eyes, thinking to himself, “What a useless person.”<br/><br/>Liang Shanshan thought for a moment and said, “However, I know where her house is. Also, her mother works in the cafeteria as a supervisor.”<br/><br/>Liang Qiming’s eyes lit up again, “That’s great. I’d like to see just how beautiful this big beauty is.”<br/><br/>Liang Shanshan’s expression turned sarcastic as she said, “Let me warn you as your older sister. It’s okay to admire beautiful people, but if you harbor any ill intentions, I advise you to think twice.<br/><br/>Xiao Family Village may be called that, but it’s not like any remote small village. Although Xiao Family Village is not big, it is more valuable than the Capital City. In the Capital City, land is worth its weight in gold, whereas in Xiao Family Village, an inch of land is worth ten times that. Many important figures live here, and they are not people anyone can afford to provoke.”<br/><br/>Liang Qiming casually responded, “Don’t worry. I’m not you, so I know my limits. Alright, take me to Zhu Hongguang’s place. My father asked me to stay at his house since there are no rooms at the hotel.”<br/><br/>Liang Shanshan replied coldly, “I don’t know where Zhu Hongguang lives. Find it yourself.”<br/><br/>With that, she left by herself.<br/><br/>Liang Qiming sneered once more.\t\t\t\t\t\t</div>", "images": {}, "success": true}