{"id": 421, "url": "https://www.novelhall.com/the-lucky-star-blessing-the-whole-village-32483/15193513.html", "title": "Chapter 421 - Chapter 421: Chapter 410:", "volume": 5, "volume_title": "Volume 5", "body": "<h1>Chapter 421 - Chapter 421: Chapter 410:</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 421: Chapter 410:<br/><br/>Li Jiatong said to Liang Shanshan, “Sister Shanshan, I’ve found out that the man closest to Xiao Jinli lately is Ji Yanping, a man from the Ji Family Village. Should we approach this man?”<br/><br/>But she thought to herself, “Liang Shanshan has no idea who Ji Yanping is.”<br/><br/>Ji Yanping is Xiao Jinli’s cousin!<br/><br/>Liang Shanshan, however, knotted her brows, slightly torn, “Jiatong, there’s been a change in the plan. I’ll notify you of the specifics.”<br/><br/>“Ah, why?” Li Jiatong asked with confusion, “Didn’t you previously say to find a man to ask Xiao Jinli out, then let Su Yichen see them so that he will think Xiao Jinli is a flirtatious woman?”<br/><br/>Liang Shanshan shook her head, “No! We’re changing the man!”<br/><br/>Li Jiatong was stunned, “Changing the man? Change to whom?”<br/><br/>Liang Shanshan stated, “Changing the male lead! We will replace that Ji Yanping with another, he’s called Liang Qiming!”<br/><br/>Li Jiatong, dumbfounded, asked, “But who is Liang Qiming?”<br/><br/>Liang Shanshan replied a bit irritably, “It doesn’t matter who he is, you just need to follow my instructions.”<br/><br/>“…” Li Jiatong pondered and then said, “Miss Liang, I don’t want to continue, it’s too dangerous!”<br/><br/>Liang Shanshan, mistaking Li Jiatong’s hesitation for greed, chided internally, “So greedy! Living in the countryside has surely turned her into a covetous rustic!”<br/><br/>From her bag, Liang Shanshan then brought out a pair of exquisite earrings, embedded with white gold and diamonds in a design that evoked snowy mountain peaks, very beautiful.<br/><br/>Liang Shanshan loved these earrings, but giving them away now was a rather painful decision!<br/><br/>She handed them to Li Jiatong, “Tongtong, I cherish these earrings a lot, but I’m giving them to you now!”<br/><br/>Li Jiatong, originally intending to refuse, immediately remembered Xiao Jinli’s words, “Accept anything Liang Shanshan offers! It’s a waste not to take free things!”<br/><br/>Li Jiatong reached out to accept them, a look of happiness on her face, as she sweetly said, “Sister Liang, thank you so much!”<br/><br/>Only then did Liang Shanshan notice Li Jiatong’s change in address. Before, she had continuously called her Miss Liang but was now affably calling her sister!<br/><br/>A trace of disdain flitted across Liang Shanshan’s eyes, ‘So shallow! To think she finds joy in such small things!’<br/><br/>But she thought with satisfaction that it was much easier to win over someone less discerning.<br/><br/>Did she not consider Li Jiatong’s financial standing at her home?<br/><br/>The Li family’s company was on par with the Liang Group, and unlike the biased father of the Liang Family, the Li family adored their only daughter to the extent that they wouldn’t hesitate to pluck the moon from the sky for her!<br/><br/>Therefore, what could she possibly lack that she would be captivated by these things!<br/><br/>After receiving the gift, Li Jiatong immediately asked, “Sister Shanshan, what do you want me to do? Whatever you say, I’ll do it!”<br/><br/>Liang Shanshan was pleased with her words!<br/><br/>She laughed, “Tongtong, you are such an obedient child! Rest assured, when I rise to wealth and power, I’ll definitely remember your contribution.”<br/><br/>Li Jiatong looked both excited and grateful, “Really? Thank you, Sister. I promise to do what you ask of me!”<br/><br/>Miss Liang’s lips curled into a smile, as she said, “Good! So, are you familiar with Xiao Jinli?”<br/><br/>Li Jiatong nodded, “Very much so!”<br/><br/>“That’s…” Liang Shanshan whispered a few instructions to Li Jiatong!<br/><br/>Li Jiatong kept nodding, then affirmed, “Okay, I’ll fulfill the mission!”<br/><br/>Liang Shanshan patted her shoulder, smiling as she said, “Everything is up to you now, Tongtong!”<br/><br/>Afterwards, she happily left the Li’s residence!<br/><br/>However, she completely missed the increasingly cold look in Li Jiatong’s eyes as she watched her leave!\t\t\t\t\t\t</div>", "images": {}, "success": true}