{"id": 425, "url": "https://www.novelhall.com/the-lucky-star-blessing-the-whole-village-32483/15193517.html", "title": "Chapter 425 - Chapter 425: Chapter 414:", "volume": 5, "volume_title": "Volume 5", "body": "<h1>Chapter 425 - Chapter 425: Chapter 414:</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 425: Chapter 414:<br/><br/>Liang Qiming constantly interacted with Xiao Jinli!<br/><br/>On the other side, Liang Shanshan remembered Su Yichen’s warning and did not dare to appear in front of Xiao Jinli or Su Yichen easily!<br/><br/>She was very clear in her heart that Su Yichen’s words were definitely not a joke!<br/><br/>If she really appeared in front of Xiao Jinli, he would target the Liang Group!<br/><br/>She didn’t care if Liang Qiming died or not, but the Liang Group was her support and couldn’t fall!<br/><br/>If Liang Qiming could really get Xiao Jinli, Su Yichen wouldn’t blame them. Instead, he would blame that woman Xiao Jinli, who had a flirtatious nature!<br/><br/>Liang Qiming occasionally encountered Xiao Jinli without being driven away by her!<br/><br/>So, someone from Xiao Family Village secretly told Liang Qiming, “Mr. Liang, it’s surprising that Jinli treats you differently!”<br/><br/>Liang Qiming’s heart swelled with pride, but he asked innocently, “Auntie, what do you mean by that?”<br/><br/>Auntie Li looked around, whispered in Liang Qiming’s ear, equivalent to roaring, “Young man, let me tell you, our Jinli has never been close to people since she was a child! If someone gets close to her, it means she approves of you! You are doing well, young man, you have actually earned Jinli’s approval! Keep up the good work, I’ve got my eye on you!”<br/><br/>Liang Qiming rubbed his ears, feeling upset, but didn’t dare to show it for fear of offending her!<br/><br/>He said softly, “Auntie, can you lower your voice?”<br/><br/>Auntie Li yelled at him, “What did you say? Do you want me to speak louder? But I can’t speak louder! This is already my loudest voice!”<br/><br/>Liang Qiming was shocked by her lion-like roar and immediately retreated a few steps. With one hand constantly patting his shocked ear and the other waving, he said, “No need, no need!”<br/><br/>“What, you want me to say it again?” Auntie Li roared!<br/><br/>Liang Qiming’s face turned pale, and he waved his hand while retreating, “No need, no need, I got it!”<br/><br/>After saying that, he didn’t wait for Auntie Li to get closer and immediately ran away!<br/><br/>When he ran far away, a group of people immediately appeared!<br/><br/>“Hahaha…”<br/><br/>Apart from a few villagers from Xiao Family Village, Xiao Jinli and Li Jiatong were standing there!<br/><br/>Li Jiatong gave Auntie Li a thumbs up, laughing and saying, “Hahaha, Auntie Li, your acting is great! Look, you scared him away!”<br/><br/>Xiao Qingshan said with a smile, “Little Aunt, I didn’t expect your acting to be so good!”<br/><br/>Then he said to Xiao Jinli, “Jinli, what if our company adds a film and television company, specializing in making movies, and specifically inviting our own Xiao Family members to work on them, how about that?”<br/><br/>Xiao Jinli also said with a smile, “It’s possible! I didn’t realize that the people in our village are all acting experts! Tongtong’s acting earlier also impressed me! Right, Tongtong?”<br/><br/>Li Jiatong stuck out her tongue, a little embarrassed, “I just thought it was fun watching others act so I joined in.”<br/><br/>“Hahaha…” Xiao Dafu laughed happily, “Little girl, if you really start acting, you’ll win the Oscar for Best Actress!”<br/><br/>“Jinli, it seems we have to consider opening a film and television company. Look, everyone in our village is an actor.” Another villager said with a smile.<br/><br/>In fact, they didn’t really want to be actors, they just wanted to try acting as they saw people on television.<br/><br/>Xiao Jinli thought for a moment and said, “Sure. At that time, we’ll use our village as the background and shoot a country story.”<br/><br/>“Haha, Jinli, are we really going to open a film and television company?” The villagers were suddenly a little confused.<br/><br/>They were just joking, but Xiao Jinli took it seriously.<br/><br/>Xiao Jinli laughed and said, “Just open it, it’s not a big deal. At that time, those who want to act can sign up and have a taste of acting. When the movie is finished, we’ll decide whether we want to watch it ourselves or show it nationwide based on everyone’s opinions.”<br/><br/>“Alright. Actually, I also want to try acting.”<br/><br/>“Hahaha, me too. As for whether it’s good or not, I don’t know.”<br/><br/>Li Jiatong was very excited and said, “Sister Jin Li, can I sign up for acting too?”<br/><br/>Xiao Jinli nodded and said, “Of course, as long as you like it.”<br/><br/>Li Jiatong’s eyes lit up immediately, “I like it, I like it.”<br/><br/>…<br/><br/>So, Xiao Yucheng received another order to directly establish a film and television company to shoot a “Country Story”, hiring people from Xiao Family Village, except for specific actors with names outside the village.<br/><br/>Also, notify the villagers that those who want to act should register with the company.<br/><br/>Upon receiving the notification, Xiao Yucheng, “…”<br/><br/>Jinli has recently gotten involved in acting on set.<br/><br/>Some time ago, he just completed a project for an actor selection and set up a theater in the village. Now, he’s directly starting a film and television company.<br/><br/>Xiao Yucheng rubbed his forehead and couldn’t help but call Xiao Jinli to complain, “Jinli, are you trying to work your big brother to death lately? Or have you just gotten into acting? It’s one act after another, you know.”<br/><br/>Xiao Jinli shrugged and said, “Big brother, I’m just following the people’s wishes. The villagers all want to have a taste of acting, so am I not fulfilling everyone’s wishes?”<br/><br/>“…,” Xiao Yucheng, “everyone wants to act, so you establish a film and television company? What if everyone doesn’t want to act?”<br/><br/>Xiao Jinli said indifferently, “If everyone doesn’t want to act, then we’ll just shut it down.”<br/><br/>“…” Xiao Yucheng took a deep breath and finally said, “Alright, alright, you’re rich, you’re willful, okay?”<br/><br/>Xiao Jinli shrugged and said with a smile, “Then please sort out the plan as soon as possible, big brother.”<br/><br/>Xiao Yucheng hesitated for a moment and said, “Jinli, I feel something is off about you. Are you trying to take revenge on me?”<br/><br/>Xiao Jinli laughed and said, “Big brother, you’re joking, right? Revenge on you? Why would I take revenge on you? Is it by starting a film and television company to get back at you?”<br/><br/>Xiao Yucheng immediately understood when he heard this.<br/><br/>Xiao Jinli indeed wanted to take revenge on him by making him busier at work.<br/><br/>Just when he finally got his vacation, he had to go back to work.<br/><br/>Xiao Yucheng could only beg for mercy, “Sister, I was wrong. I shouldn’t have tested Xiao Siqian’s feelings for you by telling Liang Shanshan about your news. I was wrong, can’t I fix it? I’m busy all day long, can you give your big brother a break, please?”<br/><br/>Xiao Jinli chuckled a few times and said, “Big brother, I’m afraid it’s not Little Quan’s feelings for me that you’ve been testing, right? It’s clearly my feelings for Little Quan that you want to test. Don’t worry, Liang Shanshan and Liang Qiming, and Little Quan and I, the four of us will compete in acting and see who can outplay the other. It’s enough for you to be a spectator.”<br/><br/>Xiao Yucheng, “…”<br/><br/>After hanging up the phone, he rubbed his forehead, knowing that nothing could be hidden from his sister.<br/><br/>Alright, he’ll be a spectator then.<br/><br/>Wait, he still felt something was off.<br/><br/>Right, the acting scene.<br/><br/>Now the whole village is cooperating with Xiao Jinli in acting and playing Liang Shanshan and her brother.<br/><br/>Thinking of this, Xiao Yucheng suddenly felt a lot better.<br/><br/>Sure enough, there were many talented people in Xiao Family Village.<br/><br/>Alright, let’s start a film and television company for fun then.<br/><br/>If everyone likes to act, let them have fun.<br/><br/>Xiao Yucheng, Xiao Jinli, and everyone else didn’t see anything wrong with starting a film and television company for fun.<br/><br/>Isn’t starting a film and television company for making money? How did it turn into a game?<br/><br/>Well, everyone in Xiao Family Village is rich now, getting richer every year. They don’t expect to make big money from shooting a movie.<br/><br/>…<br/><br/>After being scared away by Auntie Li, Liang Qiming ran back to Zhu’s house.<br/><br/>Grandma Zhu saw Liang Qiming’s pale expression and asked with concern, “Little Liang, what’s wrong? You look so pale, are you feeling unwell?”<br/><br/>Liang Qiming is not as clueless as Liang Shanshan, who got into trouble with the Li family on her first day of living there.<br/><br/>On the first day of his stay, he established a good relationship with the Zhu family.<br/><br/>After all, he had important things to do here, and he needed help. The Zhu family was the best helper.<br/><br/>Liang Qiming shook his head and said, “It’s nothing, Grandma Zhu. I just saw a snake and was startled. I’ve been scared of snakes since I was little.”<br/><br/>“Ha, a snake? Where did you come across a snake? Snakes in Xiao Family Village usually don’t show up easily,” Grandma Zhu said in surprise, “You can rest assured that even if a snake appears, it won’t bite people. Unless, you provoke it for no reason.”<br/><br/>Liang Qiming, “…” He just came up with an excuse, but Grandma Zhu took it so seriously.\t\t\t\t\t\t</div>", "images": {}, "success": true}