{"id": 428, "url": "https://www.novelhall.com/the-lucky-star-blessing-the-whole-village-32483/15193520.html", "title": "Chapter 428 - Chapter 428: Chapter 417:", "volume": 5, "volume_title": "Volume 5", "body": "<h1>Chapter 428 - Chapter 428: Chapter 417:</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 428: Chapter 417:<br/><br/>After discussing the development history of Xiao Family Village, the family returned to the main topic.<br/><br/>No one understood why Xiao Jinli had the leisure to accompany the Liang siblings in this play.<br/><br/>The goals of the Liang siblings were clear. One was targeting Su Yichen, and the other was targeting Xiao Jinli.<br/><br/>Their ambitions were really big and strong. They not only wanted wealth, but also wanted to have a share in a Feng Shui treasure land like the Xiao Family Village.<br/><br/>As soon as Su Yichen warned Liang Shanshan, her younger brother was already eyeing Xiao Jinli.<br/><br/>This really annoyed Su Yichen!<br/><br/>Did the Liang family really think they were a piece of cake?<br/><br/>Humph! Just as he was about to let his assistant report the illegal activities of the Liang family, Xiao Jinli sent a timely message for him to let her play with them a while longer!<br/><br/>Okay, since Jinli wanted to play, what could he do? Of course, he would support unconditionally!<br/><br/>He also wanted to see what kind of tricks the siblings were trying to play!<br/><br/>Xiao’s mother didn’t have a good impression of Liang Shanshan at all.<br/><br/>Xiao’s mother said, “Liang Shanshan clearly aimed at Little Quan. She was arrogant, and she implied that our Xiao Bao is a mistress.”<br/><br/>Su Yichen’s expression changed immediately, and he hurriedly stated, “Aunt, don’t trust that crazy woman’s words! When Liang Shanshan came to me, I didn’t even know who she was! I have already warned her harshly. She even dares to make trouble in front of you. It seems that I have been too kind. I will definitely remember this debt and calculate them all together later!”<br/><br/>Now he couldn’t possibly let the Liang family off the hook!<br/><br/>In the past, Liang Haohan played some small tricks behind his back, and he just let it go. But now that they are calculating the Xiao family members, it touched his bottom line!<br/><br/>When Su Yichen said he was going to settle accounts with the Liang family, no one in the Xiao family tried to persuade him!<br/><br/>It was not blameworthy for the Liang family or Liang Shanshan to want to marry Su Yichen, but using unscrupulous means was bullying people!<br/><br/>If it were a girl from an ordinary family, being slandered and insulted like Liang Shanshan did to them, with just slightly lower quality, wouldn’t it be enough to drive them to death!<br/><br/>Xiao Jinli laughed and said, “We don’t need to settle the accounts now! In a short period of time, they will have their own evil consequences!”<br/><br/>Xiao Junxuan curiously asked, “Sister, can you reveal a little bit about what you want to do? If you don’t like the Liang siblings, we can just drive them out. There’s no need to go through such a big fuss and play games with them. Isn’t it a waste of time?”<br/><br/>Xiao Jinli shook her head and said, “Originally, they had nothing to do with us, but they wanted to provoke us. It’s really annoying. If I don’t teach them a lesson, I won’t feel comfortable.”<br/><br/>The Xiao family, “…” Why does it feel a bit unusual?<br/><br/>Usually, Jinli had a big heart and was always tolerant to others.<br/><br/>And for solvable issues, she always resolved them on the spot and never did any fancy stuff.<br/><br/>Now, to teach the Liang siblings a lesson, she wanted to accompany them in this play?<br/><br/>Somehow, it felt unusual no matter how they thought about it.<br/><br/>So, everyone’s eyes unanimously swept towards Su Yichen, secretly speculating.<br/><br/>Could it be because of Jinli?<br/><br/>Although Xiao Jinli wasn’t quite sure about her feelings for Jinli, she would subconsciously not let anyone take him away?<br/><br/>Well, this incident might help Xiao Jinli see her feelings for Jinli more clearly.<br/><br/>A mutual response is called mutual love.<br/><br/>It’s just that Jinli keeps expressing himself alone, feeling like he’s the only one excited about it.<br/><br/>Su Yichen noticed everyone’s gazes, and initially he was a bit confused, but he quickly reacted and felt pleasantly surprised in his heart. However, he kept his expression calm on the outside.<br/><br/>He wanted Xiao Jinli to come to her senses slowly.<br/><br/>Xiao Jinli, of course, also noticed everyone’s gazes and was full of confusion, “What are you doing, why are you all looking at Brother Jinli?”<br/><br/>Immediately, she assumed that everyone was blaming Su Yichen for the problem with love affairs and quickly explained, “Don’t blame Brother Jinli. He doesn’t like that Liang Shanshan. It’s all because of Shanshan’s self-righteousness and self-satisfaction that she ran to show off in front of me, and I couldn’t be bothered to deal with her. Shanshan did try to approach Jinli, but he didn’t at once reject her and gave her a stern warning. Moreover, I know Jinli isn’t fickle.”<br/><br/>Her Xiao Zhi was always monitoring, oh, no, always caring about Su Yichen.<br/><br/>Upon hearing Xiao Jinli’s explanation, everyone unanimously, “Cough cough…”<br/><br/>Xiao Father suppressed his laughter and said seriously, “Little Jinli, don’t defend Xiao Siqian anymore. Whether he’s right or wrong, he’s the one who’s attracting the bad love affairs. That’s a fact, so it’s his fault, and he has to deal with it.”<br/><br/>Then Xiao Father asked Su Yichen seriously, “Xiao Siqian, is that Liang Shanshan really not related to you? I heard that she’s the daughter of Kyoto Liang’s Group and is on equal footing with you. She’s a talented woman and is considered a golden boy and jade girl. I heard she’s very beautiful and even regarded as the number one beauty in the capital city. Aren’t you tempted at all?”<br/><br/>Su Yichen’s scalp tingled, and he answered very seriously, “Uncle, I have face blindness. I don’t know whether Liang Shanshan is round or flat, how can I have any emotions towards her? Besides, no matter how beautiful she is, can she be more beautiful than Jinli? I have Little Jinli, a precious pearl, why would I like the fishy eyes? I’m not blind.”<br/><br/>Everyone, “…”<br/><br/>Who would have thought that Xiao Father would ask even more seriously, “So, do you like Little Jinli just because she’s beautiful?”<br/><br/>“…” Su Yichen said, “Uncle, the love of beauty is universal. I like Little Jinli’s appearance, but I like the essence of Little Jinli even more, regardless of her looks. She’s just her, no matter how beautiful she is, she will age and lose her color. Beauty can’t last long. My fondness for Little Jinli has grown over time and has become part of my soul. Su Yichen, having recognized Little Jinli as the only one for me, I will only have her for the rest of my life.”<br/><br/>Everyone, “…” They listened to another round of Xiao Siqian’s confession.<br/><br/>Xiao Junxuan sneered and said, “Xiao Siqian, we all know what you’re thinking. Don’t worry, my sister will be yours sooner or later. It’s just that she’s a young girl who hasn’t realized it yet.”<br/><br/>Xiao Jinli, “…” So, after all this talking, it’s still about her?<br/><br/>“Cough cough…” Xiao Father suddenly asked, “Xiao Junxuan, what about you? Xiaoxiao’s leg is almost healed, so why is she still living in the hospital and not being allowed to move in? She can be checked on by your sister at home at any time.”<br/><br/>Xiao Junxuan said, “Dad, don’t blame me for this. I wanted her to move in with us long ago, but she’s shy and doesn’t think it’s appropriate for an unmarried girl to live at her boyfriend’s house. Dad, why don’t we advance Xiaoxiao’s wedding?”<br/><br/>Xiao Father glared at him and said impatiently, “You should be talking to your future father-in-law about this, not me.”<br/><br/>Xiao Junxuan, “…”\t\t\t\t\t\t</div>", "images": {}, "success": true}