{"id": 423, "url": "https://www.novelhall.com/the-lucky-star-blessing-the-whole-village-32483/15193515.html", "title": "Chapter 423 - Chapter 423: Chapter 412:", "volume": 5, "volume_title": "Volume 5", "body": "<h1>Chapter 423 - Chapter 423: Chapter 412:</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 423: Chapter 412:<br/><br/>Li Jiatong looped her arm through Xiao Jinli’s and pointed a finger toward a figure under a big tree, speaking jubilantly, “Sister Jinli, that’s a neighbor big brother from the capital city, who took great care of me when I was there. Now that he’s in Xiao Family Village, I want to treat him well.”<br/><br/>Her voice was loud enough for the person under the tree to hear.<br/><br/>However, as she spoke, she blinked her big eyes at Xiao Jinli, looking amusing.<br/><br/>Soon, Li Jiatong and Xiao Jinli approached Liang Qiming.<br/><br/>To give Xiao Jinli a good impression, Liang Qiming appeared quite graceful; his hair was meticulously groomed, and he wore a white shirt, a black suit, and shiny black leather shoes. With his height of 180 centimeters and his somewhat handsome features, he caught the attention of a few girls under the big tree, especially in this dress, which revealed his wealth.<br/><br/>The only problem was, with the weather being so hot, wasn’t he afraid of getting heatstroke in those clothes?!<br/><br/>From afar, Liang Qiming had noticed their arrival, but he was stunned when he saw the girl next to Li Jiatong.<br/><br/>This girl was just too beautiful, too stunning.<br/><br/>Even though he had rolled among countless fresh flowers, at this moment, he truly realized that all those women were nothing compared to this beauty. Even his sister, who was referred to as the most beautiful woman in the capital city, was no match for her radiant presence.<br/><br/>No wonder Liang Shanshan was so jealous of Xiao Jinli when talking about her.<br/><br/>Seeing Liang Qiming, Li Jiatong immediately greeted him warmly and sweetly called, “Brother Liang.”<br/><br/>Liang Qiming showed a proper and happy expression, looked at Li Jiatong with indulgence, and laughed, “In just over a year since I’ve seen you, Tongtong, you’ve grown up to be a beautiful young lady.”<br/><br/>His eyes were unmistakably staring unabashedly at Xiao Jinli.<br/><br/>In reality, Liang Qiming and Li Jiatong didn’t know each other.<br/><br/>Li Minxing had protected his daughter well, and when she was in the capital, Li Jiatong was still very young. Apart from family banquets, she hardly appeared at various receptions. So, few people outside the close and friendly family knew Li Jiatong.<br/><br/>Now, they played the roles of neighbors who had grown up together, Neighbor Big Brother and Neighbor Little Sister.<br/><br/>Li Jiatong blushed with shyness and said, “Big brother Liang is getting more and more handsome. I was delighted to receive your call and know that you came to Xiao Family Village. Are you here for a few days of vacation or just touring? Have you booked a hotel?”<br/><br/>Liang Qiming looked at the non-stop chatter of Li Jiatong, who deliberately ignored Xiao Jinli standing beside her.<br/><br/>At this point, Liang Qiming was clearly displeased.<br/><br/>However, he didn’t show his displeasure. Instead, he looked at Xiao Jinli and asked with a smile, “Tongtong, who is this young lady beside you?”<br/><br/>Li Jiatong smacked her forehead and exclaimed loudly, “Oh, look at me, Brother Liang. I’m so happy to see you that I completely forgot to introduce you to the young lady standing beside me.<br/><br/>This is a girl I met in Xiao Family Village named Xiao Jinli.<br/><br/>Sister Jinli, this is the neighbor big brother I often mention to you. In elementary school, he was the one who helped me with my homework when my grades were bad.”<br/><br/>Xiao Jinli, “……”<br/><br/>Xiao Jinli almost praised Li Jiatong, her acting skills were just too good.<br/><br/>She was like those child stars who made their debut on television, with extraordinary acting talent.<br/><br/>If she didn’t know the truth, she would have been fooled by this young girl’s acting.<br/><br/>Hearing Li Jiatong’s introduction, Liang Qiming eagerly stretched out his hand, displaying an intention to shake hands, and said, “Hello, I am Liang Qiming, Tongtong’s Neighbor Big Brother.”<br/><br/>But, as his eyes stared at Xiao Jinli’s slender, soft, and delicate fingers, he secretly thought, “These hands are so beautiful. How could this woman have such beautiful hands to match her gorgeous face?<br/><br/>People say that hands are a woman’s second face. With both faces so stunning, I wonder if her hands are as soft as they look.”<br/><br/>However, Xiao Jinli shook her head and said, “I’m sorry, I never shake hands with strange men.”<br/><br/>Liang Qiming’s expression changed slightly, but he quickly lowered his hand and maintained a polite smile, saying, “I understand. With a girl as beautiful as you, it’s easy to be taken advantage of.”<br/><br/>Xiao Jinli nodded, “Exactly. Men’s eyes hardly budge when they see a beautiful woman, especially some men with dangerous gazes. So, I’m very cautious with strange men.”<br/><br/>Liang Qiming, “……”<br/><br/>He felt as if Xiao Jinli was hinting at something.<br/><br/>Forget it; it was their first meeting. He didn’t want to scare her away.<br/><br/>If he frightened her, not only would he not be able to capture her heart, but all his plans would also fall apart.<br/><br/>Liang Qiming nodded in agreement, “Yes, for a beautiful girl like you, it’s essential to be cautious. Miss Xiao, are you from Xiao Family Village?”<br/><br/>Xiao Jinli nodded, “Yes, I was born and raised here.”<br/><br/>Liang Qiming continued with a smile, “Xiao Family Village is indeed a land of outstanding people and magical scenery. It has nurtured spirited girls like Miss Xiao and made this land a world-famous legend.”<br/><br/>Xiao Jinli smiled, “Yes, that’s why I love Xiao Family Village so much. I won’t let anyone who tries to destroy Xiao Family Village off the hook.”<br/><br/>Liang Qiming’s expression faltered for a moment but quickly recovered. He said, “If I were from Xiao Family Village, I wouldn’t allow anyone to destroy it either.”<br/><br/>Feeling left out, Li Jiatong pouted and looked at Liang Qiming, complaining unhappily, “Big Brother Liang, are you forgetting about me now that there’s someone new? And Sister Jinli too, I’ve been standing here for so long, and you guys are busy chatting. Have you forgotten about me?”<br/><br/>Hearing her words, Liang Qiming laughed heartily, “Haha… Tongtong, don’t be angry. I was just chatting with Miss Xiao for a moment; how could I forget you?”<br/><br/>Xiao Jinli patted her head with an indulgent look in her eyes and said, “Exactly. We were just talking for a little while, there’s no need for you to be jealous.”<br/><br/>Denying the jealousy, Li Jiatong replied, “Hmph, I’m not jealous. I just… just feel a bit hot.” She looked up at the scorching sun in the sky.<br/><br/>“Haha, alright, you’re not jealous, you’re just feeling a bit hot!” Liang Qiming still laughed cheerfully. “Let’s go somewhere cooler to sit for a while, shall we?”<br/><br/>In fact, when he said this, his eyes were fixed on Xiao Jinli, his intention was clear — he hoped that Xiao Jinli would invite him to her house.<br/><br/>But, Li Jiatong said, “Big Brother Liang, let’s go to my house instead.”<br/><br/>Liang Qiming, “……”<br/><br/>Li Jiatong must have a pit in her brain. Why did she say that at this time?!\t\t\t\t\t\t</div>", "images": {}, "success": true}