{"id": 430, "url": "https://www.novelhall.com/the-lucky-star-blessing-the-whole-village-32483/15193522.html", "title": "Chapter 430 - Chapter 430: Chapter 419:", "volume": 5, "volume_title": "Volume 5", "body": "<h1>Chapter 430 - Chapter 430: Chapter 419:</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 430: Chapter 419:<br/><br/>“Those who accomplish big things can’t be tied up with little details!” Liang Shanshan continued to persuade, “You’ve seen it too, right? Xiao Jinli appears to hold a significant position in Xiao Family Village. Once Xiao Jinli is in our hands, the village will basically be under our control.”<br/><br/>As she spoke, a sarcastic smile appeared on her face, “Su Yichen doesn’t respect me because the Liang Family simply can’t match the importance of Xiao Family Village.”<br/><br/>Liang Qiming’s face darkened upon hearing this, apparently realizing the truth.<br/><br/>He furiously said, “Su Yichen, how despicable!”<br/><br/>Upon Liang Shanshan’s reminder, it was clear to him that what Su Yichen truly valued, beyond Xiao Jinli’s beauty, was her influential background.<br/><br/>Everyone in the world knows that Xiao Family Village is now a haven for health and aging care.<br/><br/>It attracts the best medical practitioners worldwide.<br/><br/>All seriously ill cancer patients, unless at their dying breath, can be saved upon arrival at Xiao Family Village Hospital.<br/><br/>As a result, Xiao Family Village Hospital is full of patients every day.<br/><br/>Just like Xiao Family Village Hotel, anyone can get an appointment regardless of their wealth, provided they queue and book.<br/><br/>Moreover, to prevent scalping, actual patient information is required.<br/><br/>So, no matter how rich you are, you still have to wait.<br/><br/>Liang Shanshan is not a brainless beauty.<br/><br/>She realized that in Xiao Family Village, she couldn’t find any information about Xiao Jinli.<br/><br/>Subsequently, she shifted her inquiries to other villages.<br/><br/>However, from the people of the other villages, the Xiao Jinli they described was an exceptionally strong yet fierce character.<br/><br/>They recounted incidents of Xiao Jinli leading the Xiao Family Village in bullying villagers from other villages.<br/><br/>Hearing this, Liang Shanshan was utterly exasperated.<br/><br/>What she wanted to hear was not this kind of information.<br/><br/>Her eyes flickered, and she asked, “Do you all know what relationship Su Yichen has with Xiao Jinli?”<br/><br/>“Su Yichen? You’re asking about Su Yichen?” The villager from the other village excitedly asked, “That National Richest Person, Su Yichen?”<br/><br/>“Yes, that’s him!” Liang Shanshan nodded.<br/><br/>The man then looked puzzled, “Does the National Richest Person have anything to do with Xiao Jinli?”<br/><br/>Liang Shanshan, “…”<br/><br/>It’s not surprising that people from other villages didn’t know.<br/><br/>In Xiao Family Village, Su Yichen was known as Xiao Siqian.<br/><br/>Eight years ago, Su Yichen was still young, and Xiao Jinli was just a child. How could people from other villages pay much attention to this situation? At most, they knew that a handsome young man had arrived at Xiao Family Village.<br/><br/>Since Su Yichen left, he hadn’t returned in eight years. His appearance and demeanor had changed greatly. Apart from the Xiao Family, even the people in Xiao Family Village could hardly recognize him, and even less could the people from other villages recognize him. They had no idea that Su Yichen was the Xiao Siqian from eight years ago.<br/><br/>When Liang Shanshan went to ask around about him, she didn’t know that here, everyone called Su Yichen by the name Xiao Siqian.<br/><br/>Her inquiries turned out to be fruitless.<br/><br/>However, it didn’t stop her from scheming against Xiao Jinli.<br/><br/>As long as Xiao Jinli cheated, Su Yichen would surely break up with her.<br/><br/>Liang Qiming fell into deep thought.<br/><br/>He said, “But Xiao Jinli is very vigilant and hard to deal with.”<br/><br/>Liang Shanshan said, “I’ve said before, extraordinary people should use extraordinary means!”<br/><br/>Liang Qiming said, “We don’t have any helpers here, and this is their territory.”<br/><br/>Liang Shanshan laughed and said, “Isn’t that simple? Just lure her out of Xiao Family Village.”<br/><br/>Although Liang Qiming wanted to give it more thought, Liang Shanshan was firm, “Liang Qiming, Su Yichen is already seriously courting Xiao Jinli. You can’t compare to him in terms of personal circumstances. How will you get Xiao Jinli to willingly date you? By sweet-talking her? Do you think a chairman of such a large group will be swayed by a few sweet words? Since you can’t win her heart through normal means, you’ll have to take the unconventional route. I’ve said it before, any woman will have a deep impression of, and an Attachment Syndrome towards, the first man who transforms her from a girl into a woman.”<br/><br/>Liang Qiming immediately decided, “Alright, let’s do what you said. But how exactly do we lure Xiao Jinli out of Xiao Family Village?”<br/><br/>Liang Shanshan confidently said, “Leave that to me. However, Liang Qiming, I’m just helping you create opportunities. Whether you can succeed depends on you. Don’t blame me if you fail in the end, okay?”<br/><br/>Liang Qiming immediately said, “Don’t worry. I’ve been with hundreds, if not thousands, of women. I’m very experienced and will surely give her an unforgettable time.”\t\t\t\t\t\t</div>", "images": {}, "success": true}