{"id": 433, "url": "https://www.novelhall.com/the-lucky-star-blessing-the-whole-village-32483/15193525.html", "title": "Chapter 433 - Chapter 433: Chapter 420:", "volume": 5, "volume_title": "Volume 5", "body": "<h1>Chapter 433 - Chapter 433: Chapter 420:</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 433: Chapter 420:<br/><br/>When Xiao Jinli came out of the house, she noticed the woman beside Li Jiatong and slightly knitted her eyebrows, clearly showing her discontent.<br/><br/>“Tongtong, is Miss Liang coming with us?” asked Xiao Jinli casually.<br/><br/>Li Jiatong glanced at Xiao Jinli, then at Liang Shanshan, and immediately said, “Sister Jin Li, Sister Shanshan said that the previous incident with you was a misunderstanding.”<br/><br/>Liang Shanshan smiled and said, “Miss Xiao, I’m truly sorry for the trouble I caused you before. I was blinded and obsessed with Su Yichen, thinking that only I was worthy of him.<br/><br/>But after seeing Miss Xiao, I realized how ridiculous I was in front of you.<br/><br/>So, I no longer dare to think about Su Yichen. I sincerely wish you and Mr. Su Yichen all the happiness in the world.”<br/><br/>In her heart, she muttered, “In order to see you fall from heaven to earth, I’ll flatter you first.<br/><br/>You are like a cloud now, but soon you will turn into mud on the ground, trampled on by everyone. Then, how can you be worthy of the glorious Su Yichen?”<br/><br/>After listening, Xiao Jinli said with pride, “Hmph, at least you know your place.”<br/><br/>Liang Shanshan’s face changed slightly, she clenched her fists, but still maintained a proper smile.<br/><br/>Xiao Jinli pretended to be magnanimous and said, “Since you sincerely apologized, I, as an adult, will forgive you. I’ll let you accompany us to the county town for Tongtong’s sake.”<br/><br/>After Xiao Jinli and the others left, people immediately gathered nearby.<br/><br/>Su Yichen, holding Jiang Yifan’s hand along with several villagers were among them.<br/><br/>“Where does Jinli want to go?”<br/><br/>“Little Tong wants to go to the county town, so Jinli agreed to accompany her.”<br/><br/>“Haha, I remember Jinli never liked shopping, right?”<br/><br/>“Yeah. Didn’t you notice the woman who came with her? I bet she persuaded Jinli.”<br/><br/>“Is Jinli up to something? That woman has ill intentions. Will Jinli be in danger?”<br/><br/>“Hehe, you don’t have to worry about that. Jinli has been lucky since she was a child, so she can always turn danger into safety.”<br/><br/>“Haha, that’s true. Nobody can harm Jinli, otherwise the consequences would be terrible.”<br/><br/>“Speaking of that, this woman has been in Xiao Family Village for a while, and she seems to be asking about Jinli’s information every day! What does she mean by that?”<br/><br/>“You don’t understand this?” someone laughed, “This woman came from the Capital City and was said to be the perfect match for Su Yichen there. Obviously, she’s Jinli’s love rival! She’s trying to learn everything about Jinli so she can know her and deal with her!”<br/><br/>“Haha, she’s miscalculated then! Jinli’s information is not easy to obtain!”<br/><br/>Even the brides who marry into the village are warned by their in-laws not to leak any information about Xiao Jinli, regardless of who asks or inquires, even their own maiden family members. If they’re found out, they will not only divorce immediately, but also take back everything from the maiden family! From then on, the Xiao Family Village will exclude the relatives and friends of the woman’s side when there are job opportunities.<br/><br/>However, the brides who marry into Xiao Family Village have been carefully selected by Xiao Jinli herself, and their character and upbringing are definitely up to the mark!<br/><br/>“But I heard that the receptionist at the hotel received an order from above to reveal some of Jinli’s information to her and she got several thousand yuan for it!”<br/><br/>“Huh? Orders from above? So that’s Xiao Yucheng, right? What does he want to do?”<br/><br/>“Hmm, maybe he wants to give Jinli a love rival?”<br/><br/>“What kind of bad taste does Yucheng have?”<br/><br/>“That Liang Shanshan from the Capital City has ulterior motives. I wonder what she’s up to?”<br/><br/>…<br/><br/>Xiao Jinli drove Li Jiatong and Liang Shanshan to the county town herself!<br/><br/>Because of the fame of Xiao Family Village, the economy of the whole county town developed rapidly, and now the value of Qing County has surpassed that of first-tier cities, becoming the most desirable place to live in the whole country!<br/><br/>Xiao Jinli rarely went shopping; in fact, she basically never went!<br/><br/>She had no interest in it. Whenever she needed something, she simply made a phone call, and someone would deliver it to her door.<br/><br/>Xiao Jinli drove her car into the parking lot of the largest shopping mall!<br/><br/>Xiao Jinli dropped them off first and said, “Tongtong, wait for me at the entrance, and I’ll go park the car.”<br/><br/>Li Jiatong obediently replied, “Okay!”<br/><br/>After Xiao Jinli left by car, Liang Shanshan said to Li Jiatong, “I’ll go find the restroom, and I’ll come to find you later!”<br/><br/>Li Jiatong nodded and said, “Okay, you go! I’ll wait for Sister Jin Li here!”<br/><br/>As soon as Liang Shanshan was gone, she made a phone call.<br/><br/>When the other party answered, she said directly, “We are now at the Dayongle Shopping Mall. After we finish shopping, I will find a way to bring them to the hotel we agreed on during lunchtime!”<br/><br/>When Liang Shanshan came out, she saw Xiao Jinli and Li Jiatong talking and laughing. Li Jiatong was laughing so happily that her face bloomed!<br/><br/>Many men gathered around them, especially the men, whose eyes were full of astonishment as they looked at them like they were untouchable goddesses!<br/><br/>Xiao Jinli’s beauty was pure, lively, and stunning!<br/><br/>Liang Shanshan’s eyes darkened, and her fists clenched.<br/><br/>In her heart, she cursed, “Laugh, laugh! The happier you are, the more desperate you’ll be later! Xiao Jinli, Su Yichen is mine, and he can only be mine! I will destroy anyone who stands in my way!”<br/><br/>She then calmed her emotions and walked towards them.<br/><br/>Someone saw her and immediately whistled, “Oh, another beauty has arrived! What a treat today, three beautiful women all at once!”<br/><br/>“These three beauties, one is innocent and adorable, one is pure and beautiful, and the last one is enchanting and glamorous, wearing pure clothes, but deep down she’s seductive. I want to get in bed with her.”<br/><br/>“Indeed, I can only appreciate the first two beauties without any disrespectful thoughts. But the one who came last, wow, such a seductive woman, I want to go to bed with her.”<br/><br/>“These two girls are obviously virgins, but the one who came last looks older, and she’s definitely not a virgin.”<br/><br/>…<br/><br/>Liang Shanshan listened to the people nearby, her face full of shame and anger.<br/><br/>These bastards dared to say such things about her in front of her face.<br/><br/>If it were in the Capital City, she would have taught them a lesson long ago.<br/><br/>But here…<br/><br/>Liang Shanshan took a deep breath and reminded herself, “Bear it, bear it, I must bear it. A little suffering leads to great success.”<br/><br/>She held her anger back, but she blamed all the grievances on Xiao Jinli.<br/><br/>She believed that it was because of Xiao Jinli that she suffered this humiliation.<br/><br/>Liang Shanshan walked over and said, “Let’s go, let’s go in.”\t\t\t\t\t\t</div>", "images": {}, "success": true}