{"id": 439, "url": "https://www.novelhall.com/the-lucky-star-blessing-the-whole-village-32483/15193531.html", "title": "Chapter 439 - Chapter 439: Chapter 426:", "volume": 5, "volume_title": "Volume 5", "body": "<h1>Chapter 439 - Chapter 439: Chapter 426:</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 439: Chapter 426:<br/><br/>In Capital City, Liang Haohan was taking his afternoon nap in the CEO’s office lounge.<br/><br/>His cellphone was beeping persistently.<br/><br/>It was receiving messages.<br/><br/>Messages from his Friends Circle.<br/><br/>Anyone of some importance always had at least two cellphones.<br/><br/>One for public office calls.<br/><br/>And another for personal calls.<br/><br/>The personal one typically stored contact information of family, friends, and crucial business partners.<br/><br/>Given their familiarity, people rarely messaged during rest hours, unless there was something terribly important.<br/><br/>Hearing the succession of beeps, Liang Haohan opened his eyes, picked up the cellphone from the bedside table, looking a bit puzzled.<br/><br/>Seeing the message was from an unknown account, he quickly lost interest, thinking it was just spam.<br/><br/>He was about to put his phone back on the bedside table.<br/><br/>Wait, this wasn’t a message to his phone number. It was a Friends Circle message.<br/><br/>Friends Circle messages required both sender and receiver to be connected on the platform.<br/><br/>Liang Haohan opened the message, full of doubts, muttering, “Whose account is this? Why there are no remarks.”<br/><br/>He spoke while opening the message.<br/><br/>However, as soon as he opened the message, he stiffened. His eyes widened in shock, mouth hanging open.<br/><br/>“This…how is this possible?” Liang Haohan’s voice trembled, the hands holding the phone shook violently, “These two rebels.”<br/><br/>Immediately after, a strange voice message came through.<br/><br/>Liang Haohan clicked to play it.<br/><br/>Voice message: “Chairman Liang, you have raised quite a pair of children. This is my gift to you. Do you like it?”<br/><br/>Liang Haohan quickly typed a reply, his anger evident in his words, “Who are you? What the hell do you want?”<br/><br/>But his message showed a red exclamation mark.<br/><br/>Clearly, he had been blocked by the other person.<br/><br/>Liang Haohan’s fury was raging.<br/><br/>…<br/><br/>Inside the luxury suite of Jin Hua Hotel, two figures lay intertwined on the bed. Their faces close, their breaths mingling, both were lost in slumber.<br/><br/>Suddenly, the ringing of a cellphone shattered the tranquility of the room.<br/><br/>Liang Qiming, still in a haze, groped for his phone for, one hand wrapped around the entangled woman.<br/><br/>Without even glancing at the caller ID, he answered, “Hello!”<br/><br/>Liang Haohan’s roar instantly reached his ears, “You ingrate! Look at the mess you’ve made.”<br/><br/>Listening to his father, Liang Qiming assumed the ‘good thing’ he was referring to was something positive.<br/><br/>Closing his eyes again, he broke into a grin, “Ha, dad, you found out? I was going to get married when I get back!”<br/><br/>“Marriage?” Liang Haohan was stunned before his anger flared again, “You are planning to get married? Do I still have any face left?”<br/><br/>Liang Qiming continued, however, “Dad, weren’t you the one who said to…” pursue Xiao Jinli and then marry her?<br/><br/>But before he could finish his sentence, a familiar voice interrupted him.<br/><br/>“Who is it? Making so much noise and disturbing my sleep!” Liang Shanshan, sleeping on Liang Qiming’s arm, muttered sleepily.<br/><br/>Listening to this voice, Liang Qiming froze. The phone slipped out of his hand, landing directly on Liang Shanshan’s head.<br/><br/>Feeling as if his blood was draining away, Liang Qiming said in disbelief, “How could this happen?”<br/><br/>Liang Shanshan, hit by the phone, sat up abruptly in irritation, “Who is it? Who hit me?”<br/><br/>But when she saw the surroundings, she screamed in shock, “Ah!”<br/><br/>Then, she threw off the blanket and saw her naked self. She cried out sharply again.<br/><br/>“Ah!”<br/><br/>Immediately after, she yelled, “Liang Qiming, what did you do to me? I’m your sister, I’m your sister, you animal, how could you do this to me?”<br/><br/>With that, she grabbed a pillow and hurled it at Liang Qiming.<br/><br/>Liang Haohan’s call with Liang Qiming hadn’t disconnected, he heard Liang Shanshan’s words clearly. His blood pressure shot up, and he fainted.<br/><br/>Before fainting, he cursed one last time, “Animal!”<br/><br/>His secretary, hearing some noise from the room, came in to check, just in time to see his boss passing out. He immediately called out, “Chairman, what’s wrong?”<br/><br/>While the secretary was helping Liang Haohan, his phone was still ringing.<br/><br/>“Liang Qiming, you animal, you slept with me. How am I supposed to face people now?”<br/><br/>Secretary, “…” Isn’t this Miss Liang’s voice?<br/><br/>Then, the voice of their young master entered his ears.<br/><br/>“Enough, Liang Shanshan. What are you freaking out about?”<br/><br/>The secretary felt as if he had uncovered an astonishing secret.<br/><br/>Did the master and Miss Liang sleep together?<br/><br/>This couldn’t be possible. The secretary’s eyes widened.<br/><br/>They are brother and sister!<br/><br/>Fearing that he might hear more horrifying details, he promptly hung up the call and dialed for an ambulance.<br/><br/>…<br/><br/>Xiao Jinli and Li Jiatong were taking a rest in another room.<br/><br/>Hearing the noise inside, the two women exchanged a knowing glance and shared a good laugh.<br/><br/>However, Li Jiatong asked anxiously, “Sister Jinli, Liang Shanshan and Liang Qiming are siblings, aren’t they? Isn’t this against morals and ethics? Is this okay?”<br/><br/>Xiao Jinli wore a mysterious expression and reassured her with a smile, “Don’t worry, they’re not crossing any boundaries!” because they didn’t share the same bloodline.<br/><br/>Otherwise, she would never have orchestrated this spectacle.<br/><br/>After all, she couldn’t bring herself to have biological siblings sleep together.<br/><br/>The point was just to teach them a lesson now.<br/><br/>Li Jiatong was puzzled, “Huh?”<br/><br/>Xiao Jinli patted her head, saying with a smile, “You’ll know soon enough. You’ve been working hard these days, playing along with sibling Liang. But, to be honest, you’re such a good actress. Look at them, they didn’t suspect anything.”<br/><br/>Looking somewhat proud, Li Jiatong said, “Haha, it must be hereditary. My grandmother was an actress in the National Theater. My mom was also an actress, but she quit acting when she met my dad.”<br/><br/>“Haha, I see.” Xiao Jinli exclaimed in delight and amusement.<br/><br/>She listened to the noise from the adjacent room, laughing as she said, “We should go see how they’re doing.”<br/><br/>Li Jiatong hesitated, “If we go over now, and they’re still not dressed, wouldn’t that be inappropriate?”<br/><br/>Xiao Jinli said, “It’s alright, we’ll knock on the door first, giving them time to get dressed.”<br/><br/>Li Jiatong, curious to see the siblings’ current situation, opened the door.<br/><br/>The moment it opened, she saw Su Yichen and Jiang Yifan, who were about to knock.<br/><br/>Xiao Jinli looked over, raised an eyebrow, and asked with a smile, “How come you two are here?”<br/><br/>Li Jiatong didn’t recognize Su Yichen in his disguise, she was surprised, asking Jiang Yifan, “Little Fanfan, how did you know we’re here?”<br/><br/>Jiang Yifan crossed his arms, raised his head, and replied haughtily, “I followed you all the way here!”<br/><br/>Xiao Jinli and Li Jiatong, “…”\t\t\t\t\t\t</div>", "images": {}, "success": true}