{"id": 438, "url": "https://www.novelhall.com/the-lucky-star-blessing-the-whole-village-32483/15193530.html", "title": "Chapter 438 - Chapter 438: Chapter 425:", "volume": 5, "volume_title": "Volume 5", "body": "<h1>Chapter 438 - Chapter 438: Chapter 425:</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 438: Chapter 425:<br/><br/>The restaurant’s food was actually packed up by Xiao Jinli.<br/><br/>This left Liang Shanshan and her brother with dark expressions on their faces.<br/><br/>Even if Xiao Jinli did the packing, the embarrassment still fell on the person who paid the bill.<br/><br/>When Liang Qiming carried the packed food through the lobby and saw the gazes of the restaurant’s waitresses and customers, it was hard to describe how stifled he felt.<br/><br/>Liang Shanshan, who was walking with him, also had a dark expression on her face.<br/><br/>As they walked out of the restaurant, Liang Shanshan asked anxiously, “Where’s our rented hourly room?”<br/><br/>Liang Qiming said, “It’s in Jin Hua Hotel. Let’s go. I will drive the ladies.”<br/><br/>Li Jiatong laughed and said, “Big Brother Liang, you’ve just drunk alcohol, are you able to drive?”<br/><br/>Liang Qiming’s face stiffened slightly. He was too busy showing off and forgot that he couldn’t drive after drinking alcohol.<br/><br/>Li Jiatong then looked at Liang Shanshan and laughed, “Sister Shanshan, it seems you’ve also had a drink. I’m not 18 yet, so it looks like only Sister Jinli can drive.”<br/><br/>Xiao Jinli nodded and said, “You guys wait here for a while, I’ll bring the car over.”<br/><br/>As soon as Xiao Jinli left, Li Jiatong’s smiling face changed to reveal a restless and uneasy look. She asked, “Sister Shanshan, Big Brother, why don’t you give up?”<br/><br/>Liang Shanshan’s face changed, revealing an angry expression. “Give up? At this point, how can we possibly give up? Li Jiatong, I warn you, we’re just one step away. Don’t think about betraying us. Otherwise, I’ll make your father and the Li Family lose everything.”<br/><br/>Li Jiatong’s face changed, revealing a frightened, uneasy, and angry expression. She said, “Sister Shanshan, you were the one who deceived me in the first place. I…I…”<br/><br/>Liang Shanshan sneered, “So what if I deceived you? You were willingly deceived, and that’s not my fault. Humph, Li Jiatong, my three or four million isn’t so easy to come by.”<br/><br/>Liang Qiming, carrying the packed food, saw two homeless people searching through a trash can for food. he directly handed them the boxed food with a cold face, saying, “Here’s some food for you.”<br/><br/>After he said that, he put the food on the ground and walked away.<br/><br/>The homeless people opened the packed food and saw the exotic delicacies inside, their eyes lit up before moving apart to eat.<br/><br/>Liang Qiming walked up to Li Jiatong and comforted her, “Tongtong, I just like Xiao Jinli and want to be with her. Don’t worry, when we get married, we won’t forget you, our matchmaker.”<br/><br/>Li Jiatong’s face was pale, “But Sister Jinli… she doesn’t like you.”<br/><br/>Liang Qiming sneered, “So what? Is like really that important? How am I worse than Su Yichen? Don’t worry, now Xiao Jinli doesn’t like me, but after being with me, I’ll treat her twice as good. She’ll definitely realize that I’m her true love.”<br/><br/>Li Jiatong snorted inwardly, “In the capital, you must have been good to countless women. Since these two fools don’t give up and don’t listen to advice, I hope they can bear the consequences. Humph, treating Sister Jinli like an ordinary woman, they probably don’t know. The prosperity of Xiao Family Village today is all thanks to Sister Jinli’s efforts.”<br/><br/>Li Jiatong’s face was expressionless, and she looked suspicious, “Big Brother Liang, in the future, will you really be good to Sister Jinli and not let her down?”<br/><br/>Liang Qiming was somewhat impatient, and he replied vaguely, “Of course.” Who can be sure about the future?<br/><br/>In a black sedan across from the hotel.<br/><br/>Jiang Yifan’s small face showed a look of admiration, “Wow, Sister Tongtong really has a talent for acting. Not entering the entertainment circle as an actress is a great loss for the industry. Look at that superb acting, fooling the Liang siblings to such a miserable extent.”<br/><br/>Su Yichen laughed and said, “With such a big family business in the Li Family, she’s the only heir. If she becomes an actress, who will inherit the Li family?”<br/><br/>Jiang Yifan’s little face showed a confused expression, “But that’s not a conflict. She can be an actress and inherit the family business too!”<br/><br/>Su Yichen, “…”<br/><br/>Jiang Yifan said, “Just like my mom, she can heal people and be the chairman too.”<br/><br/>Su Yichen laughed, “You’re right. I’ve never seen a chairman as laid-back as your mommy. She’s a really hands-off boss.”<br/><br/>Jiang Yifan said confidently, “That’s not what you should say. A good leader should learn to delegate and let the subordinates do the work. If everything has to go through her, she’ll be exhausted.”<br/><br/>At this point, Jiang Yifan realized something and looked doubtfully at Su Yichen. He asked, “Uncle Su, aren’t you a chairman too? I don’t see you being very busy either. All you do is hang around wanting to be with my mommy.”<br/><br/>Su Yichen, “…” A smart child like him could be quite disheartening.<br/><br/>Su Yichen looked over and said, “Enough, your mommy is driving over.”<br/><br/>After Xiao Jinli drove over, she noticed that Li Jiatong’s complexion was not good and asked with concern, “Tongtong, what’s wrong? Why does your face look so bad?”<br/><br/>Li Jiatong nervously shook her head and said, “No… I’m fine. I guess I just ate too much just now, and my stomach is a bit uncomfortable.”<br/><br/>“Oh, if you’re full, let’s go for a walk later after the meal,” Xiao Jinli said.<br/><br/>Liang Shanshan, afraid that she would run away, quickly said, “Your stomach will feel better after a rest, right Tongtong?”<br/><br/>Li Jiatong nodded, “Yes, I’ll be fine after resting a bit at the hotel.”<br/><br/>Xiao Jinli dissatisfied, “When your stomach is full, you should move around to help digest.”<br/><br/>Liang Qiming immediately said, “Let’s go for a walk after we get to the hotel.”<br/><br/>After arriving at the hotel, Xiao Jinli parked the car and rubbed her forehead, feeling a little puzzled. “Why do I feel a bit dizzy?”<br/><br/>Liang Shanshan and her brother’s eyes lit up, as they glanced at each other with excited expressions.<br/><br/>Liang Shanshan quickly said, “Oh, Jinli, you’re feeling dizzy? Maybe you’re tired from walking this morning. Qiming, help Jinli to the room and let her rest for a while. I’ll accompany Tongtong to go for a walk and digest.”<br/><br/>Liang Qiming nodded, “Alright, I’ll take Jinli to the room to rest, and you two go for a walk.”<br/><br/>Li Jiatong anxiously said, “I’m not full anymore, let’s all go to the room together.”<br/><br/>Liang Shanshan, however, held her arm, her eyes fierce as she spoke word for word, “Tongtong, you, ate, too, much, we, need, to, walk, and, digest.”<br/><br/>With Liang Shanshan half-warning, half-dragging her, Li Jiatong followed her to go for a walk.<br/><br/>Liang Qiming took Xiao Jinli to the pre-booked room, and he looked very excited.<br/><br/>He stared at Xiao Jinli’s sleepy face, showing a look of excitement, joy, and triumph.<br/><br/>He was about to possess this heavenly beauty.\t\t\t\t\t\t</div>", "images": {}, "success": true}