{"id": 435, "url": "https://www.novelhall.com/the-lucky-star-blessing-the-whole-village-32483/15193527.html", "title": "Chapter 435 - Chapter 435: Chapter 422:", "volume": 5, "volume_title": "Volume 5", "body": "<h1>Chapter 435 - Chapter 435: Chapter 422:</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 435: Chapter 422:<br/><br/>Ultimately, under Liang Shanshan’s threat, Li Jiatong had to agree to let Xiao Jinli return to the village after having lunch in the county town.<br/><br/>“Going to a restaurant for lunch?” Xiao Jinli asked with confusion, “It’s still early. If we drive back now, there will still be food in the cafeteria. Besides, the cafeteria serves food twenty-four hours a day. Why would we go somewhere else to eat? I’m not used to eating food outside our cafeteria.”<br/><br/>Li Jiatong, holding her arm and smiling, said, “Sister Jinli, I actually want to buy a few more clothes. How about we come back and take a walk in the afternoon? If we go back now, it would take two or three hours back and forth, which is a waste of time. Let’s go to the hotel for lunch first, and then we can have an hourly rental room after lunch to rest for a while before continuing shopping. We can shop at the mall and also visit other places.”<br/><br/>Xiao Jinli thought for a moment and said, “Since you still want to shop, what can I do? I’ll just accompany you. Alright, let’s go. I’m quite familiar with this place. I know a few people who run restaurants nearby, their food tastes not bad, let’s go there to eat.”<br/><br/>Upon hearing this, Liang Shanshan immediately said, “Well, a friend of mine heard that we were going shopping, so he has already booked a restaurant. We can just go there directly.”<br/><br/>However, Xiao Jinli looked at her suspiciously, “You, a person from the Capital City, have friends here?”<br/><br/>Liang Shanshan smiled, “Yes, we have friends from all corners of the world. Let’s go eat at his place.”<br/><br/>Li Jiatong turned her eyes and said, “Sister Jinli, since Sister Shanshan’s friend has already reserved a restaurant, let’s not bother to find a place to eat. Let’s just follow Sister Shanshan.”<br/><br/>Xiao Jinli remained suspicious and asked, “Are you familiar with this county town? Tell me, where is the restaurant your friend booked? I’ll take you there.”<br/><br/>Liang Shanshan, “…” She wasn’t familiar with the area.<br/><br/>Liang Shanshan said, “Let me call and ask!”<br/><br/>After a while, she said, “It’s on Jiefang East Road, Jinxiu Restaurant!”<br/><br/>Xiao Jinli nodded, “I know the place, let’s get in the car!”<br/><br/>It took about ten minutes to drive from Jiefang East Road to Yongle Mall, but the only problem was finding a parking space!<br/><br/>“I see it, Jinxiu Restaurant! Is that it?” Li Jiatong pointed to a place.<br/><br/>The three of them arrived at Jinxiu Restaurant, where Liang Qiming was waiting at the entrance!<br/><br/>Seeing the three of them, Liang Qiming happily said, “You’re here so quickly, let’s go inside the private room, it’s too hot outside!”<br/><br/>Xiao Jinli was puzzled to see Liang Qiming there. “Liang Qiming, what are you doing here?”<br/><br/>She then realized and looked at Liang Shanshan, asking, “So the friend you mentioned is him?”<br/><br/>Liang Shanshan nodded, “Yes, it’s him!”<br/><br/>After calling “Big Brother Liang”, Li Jiatong said to Xiao Jinli, “Sister Jinli, Sister Shanshan and Big Brother Liang are siblings!”<br/><br/>Xiao Jinli was slightly surprised, “Siblings?”<br/><br/>Frowning, she looked at Li Jiatong somewhat accusingly and said, “Tongtong, why didn’t you tell me they were siblings?”<br/><br/>“…” Li Jiatong said, “I didn’t see them together, so I didn’t introduce them!”<br/><br/>Liang Qiming said, “I came to Xiao Family Village on vacation with my sister. I heard from her this morning that you were going shopping, and I happened to be in the county town, so I thought I’d treat you to a meal!”<br/><br/>Xiao Jinli coldly refused, “No need, we’re not that close!”<br/><br/>Liang Qiming was taken aback, then gave a bitter smile with some helplessness, “Xiao Jinli, don’t be like this. I don’t have any ill intentions towards you! I genuinely want to be friends with you! If I was rude before, I apologize and hope you can forgive me!”<br/><br/>While saying this, he gave Li Jiatong a meaningful glance!<br/><br/>Li Jiatong understood immediately!\t\t\t\t\t\t</div>", "images": {}, "success": true}