{"id": 431, "url": "https://www.novelhall.com/the-lucky-star-blessing-the-whole-village-32483/15193523.html", "title": "Chapter 431 - Chapter 431: Chapter 419: _2", "volume": 5, "volume_title": "Volume 5", "body": "<h1>Chapter 431 - Chapter 431: Chapter 419: _2</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 431: Chapter 419: _2<br/><br/>Liang Shanshan snorted coldly and left.<br/><br/>Unbeknownst to them, as soon as they left, a small head popped out from a corner nearby.<br/><br/>This person was none other than Jiang Yifan.<br/><br/>At this moment, Jiang Yifan’s little face was tightly wrinkled, with a faint trace of anger.<br/><br/>He watched the backs of the two people and angrily muttered, “These two bastards are targeting my master. It seems they’ll go to any lengths to achieve their goal. As if, my mother would ever lower herself to be with them! They’re dreaming.”<br/><br/>Jiang Yifan tilted his little head in thought and said, “Humph, my mother is so smart and capable, she definitely won’t be fooled, especially with Little Zhi’s help.”<br/><br/>Then, he rolled his eyes, showing a cheeky smile on his face while murmuring, “Maybe I should seize this opportunity to help my mother realize her own feelings. She can’t live alone forever in this world. She needs someone to accompany her through life. If they can have a few more children, that would be even better.”<br/><br/>In this world, his mother seemed much more ordinary because she had concealed her previous sharp edges.<br/><br/>She was living happily, joyfully, and blissfully here.<br/><br/>He hoped that she could be happy and blessed in this era and throughout her life.<br/><br/>Jiang Yifan then patted the grass off of himself, and went to look for Su Yichen.<br/><br/>This Su Yichen guy, though he was so decisive and efficient in the mall, seemed somewhat hesitant when facing his mother.)<br/><br/>It seemed that he had to give them both a push himself.<br/><br/>Jiang Yifan ran directly to find Su Yichen.<br/><br/>As for where to find him, it was quite simple; he had the most advanced phone watch in the world in his hand.<br/><br/>Just call and ask, and he would know.<br/><br/>Jiang Yifan broke into Su Yichen’s office.<br/><br/>Upon entering, he shouted, “Uncle Su, something terrible has happened.”<br/><br/>Su Yichen’s expression tensed up, and he spoke irritably, “Weren’t you just calling me ‘Uncle Su’ and ‘Dad Su’ a few days ago? How come now, you’ve changed it to ‘Uncle Su’ again?”<br/><br/>Jiang Yifan, the little body sat on the sofa, his arms crossed. He very coldly snorted, “Humph, as long as you haven’t won my mother over, I can call you whatever I want. It’s none of your business.”<br/><br/>Su Yichen shrugged his shoulders and laughed, “Okay, okay, whatever you say, little ancestor.”<br/><br/>Jiang Yifan glared at him and said irritably, “What are you laughing at? Your daughter-in-law is about to become someone else’s, and you’re still so happy.”<br/><br/>Su Yichen, “…”<br/><br/>Why was this child so aggressive? Had he eaten gunpowder?<br/><br/>And what did he mean by his daughter-in-law was about to become someone else’s?<br/><br/>Su Yichen asked suspiciously, “Little Fanfan, what do you mean by that?”<br/><br/>Jiang Yifan replied, “Just now I went to play in the mountain hollow and happened to overhear two people plotting to lure my mother out of Xiao Family Village. Then, that woman said something about how women treasure memories of their first man. Anyway, I didn’t really understand all the things they were talking about.”<br/><br/>Upon hearing this, Su Yichen immediately panicked, and furiously asked, “Fanfan, tell me everything they said, word for word!”<br/><br/>Jiang Yifan had a good memory, remembering everything people had seen and said!<br/><br/>Jiang Yifan looked at his anxious face and stared intently. Then, he sighed like a little adult, “Uncle Su, don’t worry! My mother is so powerful, she won’t be so easily deceived! Besides, didn’t she say herself that she and that brother and sister were just putting on a show? Don’t you trust my mother?”<br/><br/>Su Yichen was taken aback.<br/><br/>He quickly recalled how amazing Xiao Jinli’s abilities were!<br/><br/>Yes, maybe no one could harm Xiao Jinli, but after all, she was still just a girl, and no matter how capable she was, she was only human and not a god!<br/><br/>Jiang Yifan’s expression turned slightly sad, and he said, “Uncle Su, my mother won’t be easily fooled. You should trust her, and don’t be so nervous, okay?”<br/><br/>After listening, Su Yichen gave a bitter smile.<br/><br/>He looked at Jiang Yifan, who behaved like a little adult, and reached out to stroke his soft hair, saying, “But your mother, Jinli, is still just a girl! No matter how capable she is, we will still worry!”\t\t\t\t\t\t</div>", "images": {}, "success": true}