{"id": 436, "url": "https://www.novelhall.com/the-lucky-star-blessing-the-whole-village-32483/15193528.html", "title": "Chapter 436 - Chapter 436: Chapter 423:", "volume": 5, "volume_title": "Volume 5", "body": "<h1>Chapter 436 - Chapter 436: Chapter 423:</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 436: Chapter 423:<br/><br/>Su Yichen had applied makeup and looked like a middle-aged man.<br/><br/>He drove, following Xiao Jinli and others with Jiang Yifan.<br/><br/>Su Yichen looked at Jiang Yifan’s excitement and said with slight regret, “What’s the point of bringing you, a kid, here?”<br/><br/>Jiang Yifan said excitedly, “Of course, it’s to catch unfaithful people.”<br/><br/>“…” Su Yichen turned around and knocked his little head, “Nonsense. If your mom heard this, she would scold you again.”<br/><br/>Jiang Yifan touched his hit little head and said angrily, “You all just love to hit my head. It hurts, you know. And hitting the head can make people stupid. I, Jiang Yifan, a super smart little genius, will not allow my head to become stupid.”<br/><br/>“…” Su Yichen laughed and said, “Your little head is always smart no matter how much it’s hit.”<br/><br/>Jiang Yifan immediately felt proud, “That’s right. I’m the most beautiful and the smartest child in the entire world.”<br/><br/>Su Yichen thought, “…” Children should not be praised too much; otherwise, they become overly proud.<br/><br/>Jiang Yifan saw Xiao Jinli and others driving away again.<br/><br/>He asked, “Hey, where are mom and Sister Tongtong going?”<br/><br/>Su Yichen curled his lips and said sarcastically, “Where else could they go? Of course, they will take them to the place where the crime will happen.”<br/><br/>Jiang Yifan wasn’t an ordinary child, so Su Yichen didn’t avoid discussing the matter with him.<br/><br/>Jiang Yifan immediately understood.<br/><br/>He asked further, “So where is that woman taking mom and Sister Tongtong?”<br/><br/>Before Su Yichen could answer, Jiang Yifan’s eyes sparkled, and he said loudly, “I know, she wants to take mom to a hotel!”<br/><br/>Su Yichen was amazed by the intelligence of a three-year-old child.<br/><br/>Most three-year-olds are still snotty, but his thought process is already on par with adults.<br/><br/>Does genius run in the family?<br/><br/>Jiang Yifan’s eyes sparkled, and he said excitedly, “Uncle Su, hurry up and follow them. I want to see how Liang Shanshan and her brother dig their graves.”<br/><br/>Su Yichen asked doubtfully, “Why are you so sure that the Liang siblings are the ones digging their graves?”<br/><br/>Jiang Yifan immediately answered without thinking, “My mom is the smartest person in the entire world. People who want to trick her probably won’t be born for another few hundred years. People who think my mommy is stupid enough to act with them are just overestimating themselves.”<br/><br/>Su Yichen asked again, “Little Fanfan, how do you know your mom is the smartest person in the world?”<br/><br/>Jiang Yifan raised his head proudly and said, “Humph, I just know it. Anyway, my mom is the smartest person.”<br/><br/>Su Yichen didn’t ask any further.<br/><br/>From the first day he met Xiao Jinli, he felt that she was mysterious.<br/><br/>After she voluntarily revealed her secrets to him, he felt that she was not only mysterious but also powerful.<br/><br/>His liking for her was drawn by her mysterious aura, unable to help himself from wanting to know more about her. Of course, he just wanted to know her plainly.<br/><br/>Because the more he understood her, the closer he felt to her, instead of her being an elusive fairy who could fly away at any moment.<br/><br/>Jiang Yifan saw Su Yichen spacing out and urged, “Uncle Su, hurry up and drive? If you don’t catch up, we’ll lose them, and then I won’t have a show to watch.”<br/><br/>Su Yichen, “…” So, this child was so excited to follow, not to catch unfaithful people. Oops, he meant to watch the drama.<br/><br/>Su Yichen stepped on the accelerator and continued to follow.<br/><br/>Xiao Jinli and her companions entered the restaurant with Liang Qiming.<br/><br/>Due to Xiao Jinli’s stunning beauty, they attracted attention as soon as they stepped into the restaurant.<br/><br/>Most of the people eating at the restaurant were tourists visiting Xiao Family Village.<br/><br/>Some had been there before, while others had just arrived.<br/><br/>Xiao Jinli did not intentionally make appearances in the village, but she still encountered many tourists when she went to the hospital or other places.<br/><br/>It wasn’t long before someone recognized her.<br/><br/>“Hey, isn’t that beautiful girl one of the two beauties from Xiao Family Village Estate? What is she doing here?”<br/><br/>“Wow, the girl in the light blue dress is so beautiful.”<br/><br/>“Even though she’s just wearing a simple blue T-shirt and jeans, it doesn’t hide her beauty.”<br/><br/>“It’s my first time seeing such a beautiful girl.”<br/><br/>“One of the women next to her has a round face and big eyes; she’s so cute. The other woman looks pretty too, but her beauty relies more on cosmetics. To judge someone’s beauty, you have to look at their bone structure. That woman looks quite charming.”<br/><br/>Someone opened their cellphone and suddenly exclaimed, “Ah, isn’t that the provocative woman from the Douyin video? She was just shopping in the mall and got filmed, now she’s trending.”<br/><br/>Actually, there were also videos and photos of Xiao Jinli and Li Jiatong, but they couldn’t be uploaded, so the trending search only displayed Liang Shanshan.<br/><br/>“Ah, a provocative woman? Hahaha, that’s hilarious. Who’s the genius that called her that? She’s still quite a beauty.”<br/><br/>…<br/><br/>Liang Shanshan listened to these comments and clenched her teeth, her face turning ashen. She cursed under her breath, “These bastards. Once I return to the capital, I will investigate every single one of them and sue them until they’re bankrupt.”<br/><br/>Upon hearing these rumors, Liang Qiming wanted to laugh out loud.<br/><br/>He never thought that the top beauty, once praised by so many young talents in the capital city, would now be directly called a provocative woman. It was absolutely hilarious.<br/><br/>However, Liang Qiming managed to hold in his laughter and comforted her, ” These people are just commoners, so don’t take their words to heart. Let’s hurry up and go to the private room.”<br/><br/>Liang Qiming then complimented Xiao Jinli, “Jinli, you’re so stunning that you attract attention wherever you go. Everyone is captivated by your beauty.”<br/><br/>Xiao Jinli ignored his compliments and asked, “Where’s the private room?”<br/><br/>Liang Qiming felt a little frustrated.<br/><br/>Xiao Jinli seemed to be quite resistant to flattery, not responding to any of his compliments, and remained expressionless.<br/><br/>On second thought, she was indeed a nationally stunning beauty, so she had the right to be proud.<br/><br/>Liang Qiming led them to the private room.<br/><br/>He took out a bottle of 1985 Lafite Red Wine and said, “Jinli, this classic ’85 Lafite is part of my collection. I have been saving it for three years and couldn’t bear to drink it. Now, I have it transported here for you to taste.”<br/><br/>Having said that, he opened the bottle and was about to pour some for Xiao Jinli.<br/><br/>However, Xiao Jinli refused outright, “I’m sorry, Mr. Liang, but I don’t drink foreign wines. In my opinion, even the best wine in the world can’t compare to what my mother brews. Besides, when it comes to wine, what kind of wine from Xiao Family Village can’t compare to these Lafite wines from whenever?”<br/><br/>Liang Qiming, “…”\t\t\t\t\t\t</div>", "images": {}, "success": true}