{"id": 437, "url": "https://www.novelhall.com/the-lucky-star-blessing-the-whole-village-32483/15193529.html", "title": "Chapter 437 - Chapter 437: Chapter 424:", "volume": 5, "volume_title": "Volume 5", "body": "<h1>Chapter 437 - Chapter 437: Chapter 424:</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 437: Chapter 424:<br/><br/>In the private room, although Xiao Jinli was cold towards Liang Qiming, he still persisted in approaching her, while Liang Shanshan rolled her eyes at the scene.<br/><br/>Liang Qiming, in the Capital City, belonged to a circle of wealthy young princes, and he was among the top ones.<br/><br/>But now, he was humiliating himself by trying to please another woman with such a low posture, and still could not win the girl’s heart.<br/><br/>Liang Shanshan felt a sense of pleasure at Liang Qiming’s frustration, but at the same time, she began to harbor intense jealousy towards Xiao Jinli.<br/><br/>With her good looks, Xiao Jinli manipulated men so easily, how despicable!<br/><br/>However, thinking that Xiao Jinli would be soon pinned down by a man she disliked excited Shanshan’s heart.<br/><br/>She was eager to see the desperation in Xiao Jinli’s eyes.<br/><br/>To ease the atmosphere, Liang Shanshan said, “Jin Li, all these dishes are signature dishes from this restaurant, including Buddha Jumps over the Wall, Abalone on Both Sides, Shark fin. Feel free to help yourself with whatever you like.”<br/><br/>Unexpectedly, Xiao Jinli coldly replied, “No matter how delicious this food is, it can’t compare to the food in Xiao Family Village.”<br/><br/>Liang Shanshan and her brother, “…” Admittedly, it was the truth.<br/><br/>They didn’t know what the food in Xiao Family Village was like.<br/><br/>However, the gourmet food in the Xiao Family Village Cafeteria was known nationwide.<br/><br/>It was said that most of the ingredients in the cafeteria were locally sourced, but there were also some imported ingredients, such as seafood.<br/><br/>Dishes like Buddha Jumps over the Wall, Abalone on Both Sides, Shark fin, and other specialty dishes were also served at the Xiao Family Village Cafeteria, but these were only made when a customer ordered them, so the prices were generally higher than outside.<br/><br/>The original food in the Xiao Family Village Cafeteria was priced for the common people, and even ordinary seafood was also priced fairly. However, dishes that involved complex processes and expensive ingredients were not only carefully selected from the highest grade materials and, therefore, more expensive but also came with transportation, labor, and other costs, hence the higher price. Moreover, these dishes were sold to either rich or noble guests, so the price would naturally be even higher.<br/><br/>For the Liang siblings, they thought people from the countryside couldn’t afford these things.<br/><br/>But they forgot that Xiao Family Village, while it was still called a village, was currently the wealthiest village in the country. Even if you didn’t look at Xiao Jinli’s family, other households in the village had assets worth several million or more. How could they not afford these things?<br/><br/>Perhaps wanting to make the Liang siblings feel even more embarrassed, Xiao Jinli pointed at the limited variety of dishes on the table, “Moreover, these green vegetables were bought from Xiao Family Village.”<br/><br/>Both siblings stared in disbelief.<br/><br/>Li Jiatong glanced at the awkward siblings, then at Xiao Jinli, who seemed to be pressuring them. She laughed and said, “Jinli, we’re all just having a meal together, there’s no need to compare it to the Xiao Family Village Cafeteria. Besides, there is no second cafeteria in the country like the one in Xiao Family Village. Saying that is just discouraging to others.”<br/><br/>Liang Qiming immediately agreed, “Yes, yes, Jiatong is right. What kind of delicious food isn’t there in the Xiao Family Village Cafeteria? It’s my fault, I apologize to you. Let’s just make do with this meal.”<br/><br/>Liang Shanshan was angry in her heart, but still managed a smile on her face, “Yes, let’s just make do with this meal.”<br/><br/>Xiao Jinli didn’t say anything more.<br/><br/>Both brother and sister secretly heaved a sigh of relief, thinking that they would humiliate Xiao Jinli when the time was right, to make up for today’s humiliation.<br/><br/>After the ten dishes were served, the four of them started eating slowly.<br/><br/>Once everyone put down their chopsticks, they saw that more than half of the food was left, and they frowned.<br/><br/>Xiao Jinli muttered, “So much food is left, what a waste!”<br/><br/>Having lived a good life since childhood, Xiao Jinli never experienced hardship and always valued frugality and avoided wasting food due to family teachings.<br/><br/>At her home, leftover food would be eaten at the next meal or fed to the chickens and ducks, but no food would ever be wasted.<br/><br/>However, because her mother was an excellent cook, there usually wasn’t any food left over, just not enough food.<br/><br/>Therefore, the Xiao family never wasted food.<br/><br/>Even when Xiao Jinli ate alone, she would not waste a single bite.<br/><br/>Now, for the first time eating with others, so much food had been left, which of course made her dissatisfied.<br/><br/>Hearing Xiao Jinli’s words, the expressions on Liang Shanshan and Liang Qiming’s faces quickly twisted.<br/><br/>What did Xiao Jinli mean by this? Were they supposed to take the leftovers home? That would be too embarrassing!<br/><br/>They didn’t know what kind of person Xiao Jinli was, but she must be a country bumpkin, actually complaining about wasting such a small amount of food.<br/><br/>However, since they needed to please Xiao Jinli now, they had to go along with her ideas.<br/><br/>Liang Qiming smiled and said, “It won’t be wasted. I heard that the leftovers from this restaurant are used to feed pigs, Jinli, you can rest assured!”<br/><br/>“Feed pigs?” Xiao Jinli looked incredulous, “Such good and expensive food is used to feed pigs?”<br/><br/>Liang Shanshan clenched her fists, barely managing to suppress the anger rising on her face!<br/><br/>She laughed and asked, “Jin Li, although these dishes are a bit expensive, we have already eaten them! What’s left is just soup! If you feel bad about wasting it, why don’t you take it home?”<br/><br/>“Alright!” Xiao Jin Li agreed, much to their dismay!<br/><br/>Liang Shanshan and her brother, “…”\t\t\t\t\t\t</div>", "images": {}, "success": true}