{"id": 434, "url": "https://www.novelhall.com/the-lucky-star-blessing-the-whole-village-32483/15193526.html", "title": "Chapter 434 - Chapter 434: Chapter 421:", "volume": 5, "volume_title": "Volume 5", "body": "<h1>Chapter 434 - Chapter 434: Chapter 421:</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 434: Chapter 421:<br/><br/>Nowadays, with advanced communication, three stunning beauties have come to Yongle Mall, and one of them has a nationally stunning appearance. Not taking a look would be a great regret.<br/><br/>So, many people took out their cellphones and aimed at the three of them to take photos and videos before posting them in their friends circles.<br/><br/>How lucky to come across such a beauty today!<br/><br/>Wow, she’s like a fairy descending from the heavens! I want to get her autograph!<br/><br/>Who said the woman who looks very flirtatious is a big beauty? Compared to the beauty beside her, she’s just nothing! Her clothing is more pure than anyone else, but the worldliness that seeps out of her bones makes her more flirtatious than anyone else!<br/><br/>Which bastard compared an old flirtatious woman with a little fairy? Can this even be compared? Totally blind!<br/><br/>…<br/><br/>The comment section contains various opinions!<br/><br/>Of course, the three of them don’t know about this yet!<br/><br/>When Liang Shanshan found out, it was her arch-rival from the Capital City who called her, and directly said, “Flirtatious woman, are you having fun?”<br/><br/>“Zhou Min, you dare call me flir… You’ve got some guts, huh?”<br/><br/>“Hehe…” Zhou Min on the other side laughed gleefully,<br/><br/>“Liang Shanshan, do you think I’m the one who called you that? People online are calling you that!<br/><br/>You’re famous now, don’t you know?<br/><br/>Everyone online unanimously says that you dress more purely than anyone else, but in your bones, you’re more flirtatious than anyone else!<br/><br/>It’s strange, Liang Shanshan, since when have you dressed so purely?<br/><br/>Weren’t you always flaunting your sexy and gorgeous style?<br/><br/>Oh right. Where are you now? How come people took photos of you and you don’t even know you’re being called a flirtatious woman?<br/><br/>It’s said online that there’s another big beauty beside you, and you can’t even compare to her in beauty! I’m really curious about what kind of beauty she is. She not only outshines the Liang Shanshan who’s known as the First Beauty in Capital City.<br/><br/>And she even mocked you, haha… It’s so funny that I need to catch my breath! I’m about to die laughing!”<br/><br/>Liang Shanshan didn’t want to listen to her anymore and hung up the phone directly.<br/><br/>Afterward, she flipped through her cellphone to check the news!<br/><br/>When she saw a piece of news, her pupils shrank, and her face turned very ugly!<br/><br/>Today’s Headline: A flirtatious woman and a fairy go shopping at a mall, causing overcrowding and entry restrictions!<br/><br/>Immediately, two photos were attached – one showing people crowded in the mall, and the other one was of her.<br/><br/>That’s right, the photo only had her in it, looking arrogantly at the attention from everyone.<br/><br/>“These bastards!” Liang Shanshan was both ashamed and furious.<br/><br/>They dare to call her a flirtatious woman.<br/><br/>How hateful!<br/><br/>She’s the First Beauty of Capital City, yet people’s evaluation of her turned out to be a flirtatious woman. This didn’t just slap her face but shamed her greatly.<br/><br/>She could imagine the laughter she would face when she returned to Capital City.<br/><br/>Even if she really became Mrs. Su, this glorious dark history would become a stain on her.<br/><br/>“Sister Shanshan, Sister Shanshan…” Li Jiatong looked at her worriedly, “Sister Shanshan, why does your face look so bad? Are you okay?”<br/><br/>Liang Shanshan was awakened by Li Jiatong’s call and came back to her senses, but the anger on her face hadn’t subsided, instantly scaring Li Jiatong.<br/><br/>She asked, “Sister Shanshan, why did you suddenly get angry? What happened?”<br/><br/>Looking into Li Jiatong’s clear eyes, Liang Shanshan took a deep breath and said, “It’s nothing. I just got a harassing phone call that made me a little angry.”<br/><br/>Li Jiatong didn’t suspect anything and nodded, “Oh, I see. But some harassing calls are indeed very annoying.”<br/><br/>She glanced at the items Liang Shanshan was holding, then said, “Sister Shanshan, do you have anything else to buy? Sister Jinli said it’s too crowded with so many people, so we should just go back.”<br/><br/>“No way!” Liang Shanshan quickly protested, immediately noticing that Jinli was nowhere to be found, and anxiously asked, “Where’s Xiao Jinli? Where did she go?”<br/><br/>“Sister Jinli went to the restroom.” Li Jiatong answered, “Sister Shanshan, what do you mean no way? Do you still have things to buy? If you still want to buy things, there are too many people here. We’re being treated like monkeys on display, and it’s very uncomfortable. We just want to leave.”<br/><br/>How can we go back now? Liang Shanshan thought.<br/><br/>Liang Shanshan said, “I still want to buy some things. But look, it’s almost noon and time for lunch. Why don’t we find a place to eat lunch and take a break, and come back in the afternoon. Maybe there will be fewer people in the mall in the afternoon.”<br/><br/>Li Jiatong shook her head, “Sister Shanshan, you don’t know. In the afternoon, there will be even more people in this mall, especially at night. We shouldn’t come in the afternoon or evening.”<br/><br/>Taking a look around, Liang Shanshan approached Li Jiatong and whispered,<br/><br/>“Tongtong, don’t forget our plan. Today is our chance. If Xiao Jinli wants to leave, convince her to have lunch with us first. The restaurant we’re going to eat at has already been reserved.”<br/><br/>Li Jiatong rolled her eyes in her heart, thinking, “You fool, after all this time, you finally fell for it.”<br/><br/>Li Jiatong also looked around and whispered carefully, “Sister Shanshan, won’t there be any accidents? What if… Jinli gets angry and my family ends up being kicked out of the Xiao Family Village.”<br/><br/>Pondering this, she shook her head and changed her mind, “Let’s forget it. I’ll… I’ll return the items to you, and I won’t help you anymore. If my dad finds out, he’ll definitely break my legs.”<br/><br/>At this point, how could Liang Shanshan allow her to back down?<br/><br/>She put both hands on Li Jiatong’s shoulders and comforted, “Tongtong, don’t worry, I’ll take responsibility for all the consequences. At that time, you can just say I forced you.”<br/><br/>Let’s talk about that later!<br/><br/>Right now, she can only reassure Li Jiatong first.<br/><br/>Without Li Jiatong’s help, their entire plan would be doomed to fail.<br/><br/>Therefore, she would not allow Li Jiatong to back down in any way.<br/><br/>Li Jiatong’s expression was still somewhat hesitant and reluctant, as she whispered, “Sister Shanshan, why don’t we just forget about it?”<br/><br/>“Forget about it?” Liang Shanshan sneered coldly, threateningly saying, “At this point, how can we forget about it? Tongtong, you’re too naive. You’ve accepted so many things from me, the value of which totals three or four million, and you’re unwilling to help me with just a small favor.”<br/><br/>“I…I’ll return everything to you. I don’t want it anymore.” Li Jiatong was somewhat frightened.<br/><br/>“Hmph, Li Jiatong, do you think you can just say you’ll return them, and that would be the end of it? You’re really too naive!” Liang Shanshan looked at her contemptuously, “Do you know that this is related to your dad’s reputation!”<br/><br/>Li Jiatong was stunned, “What does this have to do with my dad?”<br/><br/>Liang Shanshan smiled without answering!<br/><br/>She said, “Why don’t you give him a call and ask if it has anything to do with him!”\t\t\t\t\t\t</div>", "images": {}, "success": true}