{"id": 432, "url": "https://www.novelhall.com/the-lucky-star-blessing-the-whole-village-32483/15193524.html", "title": "Chapter 432 - Chapter 432: Chapter 419: _3", "volume": 5, "volume_title": "Volume 5", "body": "<h1>Chapter 432 - Chapter 432: Chapter 419: _3</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 432: Chapter 419: _3<br/><br/>Jiang Yifan opened his hand and said irritably, “Why do you people always like to touch my head? I almost feel dumb from all the touching! When I grow up, I might not have a girlfriend!”<br/><br/>Then he propped up his chin, showing an expression similar to Su Yichen’s. He sighed lightly, echoing concern, “Yes, my mother is still a girl herself, but her small shoulders are bearing all the big matters! She protects our family, Xiao Family Village, and all our relatives and friends very well. Everyone is very happy and content. But she does not consider her own happiness and joy!”<br/><br/>Su Yichen lightly tapped his small head again and irritably said, “Oh, you know quite a lot for your age!”<br/><br/>Jiang Yifan immediately proudly replied, “Of course, I am quite smart!”<br/><br/>Su Yichen asked again, “Didn’t you hear how they plan to lure Jinli out of Xiao Family Village?”<br/><br/>Jiang Yifan shrugged and said, “I don’t know! Because they didn’t discuss this, they just left!”<br/><br/>Saying this, he thought about something and added, “However, it seems that the plan to lure my mother out of Xiao Family Village was made by that Liang Shanshan! But, my mother is good at acting, so no matter what strategy they use, my mother will surely cope with it!”<br/><br/>Then, his little face looked solemnly at Su Yichen, and he said, “Uncle Su, this might be your chance to play the hero and rescue the beauty, you must seize it well!”<br/><br/>Su Yichen, “…”. Jinli is immune to all attacks and very strong, how could he play the so-called hero and save the beauty?<br/><br/>Su Yiyi touched his soft hair again, agreeing, “Okay!”<br/><br/>…<br/><br/>Li Jiatong approached Xiao Jinli, “Sister Jin Li, I want to go to the county town for a stroll, can you accompany me?”<br/><br/>When she asked this, she subtly signaled with her eyes.<br/><br/>Xiao Jinli understood instantly!<br/><br/>She smiled and agreed, “Sure! I haven’t visited the county town for a while! When should we schedule it?”<br/><br/>Li Jiatong’s eyes spun around, and she agreed with a smile, “Then, let’s go tomorrow!”<br/><br/>Xiao Jinli nodded and said, “Alright, let’s meet tomorrow then!”<br/><br/>Li Jiatong happily returned home and excitedly said, “Sister Shanshan, I’ve made the plan, I’ve made the deal!”<br/><br/>Upon hearing this, Liang Shanshan immediately showed a delighted smile and said, “You’ve made the deal? Really? Tongtong, you’re not fooling me, are you?”<br/><br/>Li Jiatong earnestly said, “Sister Shanshan, we’re on such good terms, why would I lie to you? Kidding you brings me no benefit. Do you really not trust me? It turns out you never have, even though I thought you considered me your sister!”<br/><br/>Having said that, pretending to be very angry, she got up to leave.<br/><br/>Liang Shanshan’s expression changed instantly.<br/><br/>She was just joking, but this girl was making a fuss!<br/><br/>She held back Li Jiatong who was about to leave, and put on a smile saying, “Tongtong, my dear sister! I was just kidding, didn’t you get it?”<br/><br/>Li Jiatong shook her head, with a wronged expression on her face, said, “How would I know you were joking! After all, Sister Shanshan, you’ve never joked with me before!”<br/><br/>Liang Shanshan, “…”<br/><br/>She was cursing inwardly, “Li Jiatong, you wooden bucket, you’ve got no intelligence at all! If she didn’t have some use, who would want to indulge her? Besides, I’ve given her so many things, worth several million in total. Isn’t this a massive loss for me? No, once she’s no longer useful, I have to get everything back! She’s not a philanthropist, who’d spend several million just to ask for some information? Humph, ordinary people can’t earn a million in their entire life!”<br/><br/>Liang Shanshan apologized, “Tongtong, my dear sister, it was my mistake. Shall I apologize to you, okay?”<br/><br/>Li Jiatong pursed her lips and offered no reply.<br/><br/>Seeing this, Liang Shanshan had no choice but to reluctantly dig into her bag again, pulling out another item, and passed it to her, desperately said, “This is my favorite bracelet, I am giving it to you now as an apology, is that alright?”<br/><br/>She had no choice, she still needed to appease her!<br/><br/>However, she was keeping a record of all the debts, and planned to collect the repayments twofold in the future.<br/><br/>Liang Shanshan’s things were not that easy to get!<br/><br/>Li Jiatong saw the object and her eyes brightened immediately. She quickly took it and her previous displeasure disappeared instantly!<br/><br/>She grinned and said, “Thank you, Sister Shanshan, this bracelet is beautiful, I love it!”<br/><br/>Liang Shanshan, “…”<br/><br/>Damn girl!<br/><br/>She’s actually so satisfied after stealing her things!<br/><br/>Smile, keep smiling, when the time comes, I’ll make you pay back double!<br/><br/>Liang Shanshan thought about her plan and sternly said, “Tongtong, I’m going with you tomorrow, it’s better to have company!”\t\t\t\t\t\t</div>", "images": {}, "success": true}