{"id": 449, "url": "https://www.novelhall.com/the-lucky-star-blessing-the-whole-village-32483/15193541.html", "title": "Chapter 449 - Chapter 449: Chapter 433:", "volume": 5, "volume_title": "Volume 5", "body": "<h1>Chapter 449 - Chapter 449: Chapter 433:</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 449: Chapter 433:<br/><br/>Liang Haohan, having been invited and then disinvited, was both furious and deeply humiliated.<br/><br/>In the entire Capital Circle, most of the elites were invited by Lin Chengdong. However, the Liang Family, who are at the top of the business world, were not given a single spot. If this information got out, it would be the joke of the Capital City.<br/><br/>The Lin Family connected with Doctor Xiao, and Lin Xiaoxiao got engaged to Doctor Xiao’s older brother.<br/><br/>Upon hearing this news, the faces of Liang Qiming and Liang Shanshan immediately changed, looking very unpleasant.<br/><br/>They offended Doctor Xiao, and then, immediately after, Lin Xiaoxiao got engaged with Doctor Xiao’s older brother. The Lin Family had just sent them an invitation, only to withdraw it a moment later. It was surely the laughingstock of the Capital Circle.<br/><br/>Liang Shanshan gritted her teeth, insisting, “The Lin Family must be doing this on purpose, they must be.”<br/><br/>The Liang Family becoming a joke made them, as part of the family, clowns within the joke.<br/><br/>Liang Qiming tightly pursed his lips, with darkness lurking in his eyes.<br/><br/>He knew very well that the Lin Family was doing this on purpose.<br/><br/>No, it was the Xiao Family doing this on purpose.<br/><br/>This was Xiao Jinli’s revenge.<br/><br/>Yet, what he feared was that this was only the beginning of the revenge.<br/><br/>That Xiao Jinli said he was going to destroy their arrogant capital.<br/><br/>Their capital was the Liang Family.<br/><br/>After half a day of criticising the Liang Family, Liang Shanshan felt quite unsatisfied when she didn’t hear Liang Qiming support her. She exclaimed, “I’ve been talking for so long, did you not hear me at all?”<br/><br/>Liang Qiming rolled his eyes and coldly replied, “You’ve been cursing Lin Chengdong and Lin Xiaoxiao the whole time. What can I say?”<br/><br/>At this point, he paused. He was clearly worried as he spoke, “I don’t know what’s going on with dad. It’s been so long and he doesn’t seem to want to see us.”<br/><br/>He couldn’t help but guess that perhaps his father already knew about the affair between him and Liang Shanshan. His father had been holding his anger back because his health was poor and he couldn’t get angry with them for now. But, to be honest, he really could not face his children at this moment.<br/><br/>Liang Shanshan wore a worried look on her face. She said, “Dad must feel humiliated after getting his invitation revoked. I don’t know where he’s going to vent his anger.”<br/><br/>Liang Qiming coldly suggested, “Well, you can go and be his punching bag. I think after dad vents his anger, he will feel guilty towards you. ”<br/><br/>Liang Shanshan rolled her eyes and coldly retorted, “Forget it. He never liked me or cared about me. If I go there, I might just add fuel to the fire. You should go instead. You’ve been loved by our parents since childhood and even now. Maybe when he sees his precious son, he won’t be angry anymore.”<br/><br/>Liang Qiming, “…”<br/><br/>Elsewhere, Mrs. Liang had tried several times to figure out why Liang Haohan unexpectedly became angry with their son, even his attitude towards her deteriorated.<br/><br/>This made her heart thump out of fear, and she was filled with suspicion.<br/><br/>Could he possibly know that their son was not his biological child?<br/><br/>No, she couldn’t afford to lose her current position. She had to eliminate his suspicion so that she and her son could continue their life filled with wealth and honour.<br/><br/>Liang Haohan really didn’t want to see his children right now. Every time he saw them, he thought about the video of them in bed, which immediately turned his stomach.<br/><br/>In consideration of his own health, he refused to see them.<br/><br/>However, slowly, he calmed down.<br/><br/>They both went to Xiao Family Village, one aiming for Su Yichen, the other targeting the chairman of Lu Xian Group.<br/><br/>So, their plans and actions failed, so they were trapped.<br/><br/>In that video, they were just lying together on a bed, covered in blankets, and both closing their eyes. This didn’t prove anything, did it?<br/><br/>If Su Yichen wanted to set them up, he must have known that they were siblings. He wouldn’t be so cruel as to set them up like that, would he?\t\t\t\t\t\t</div>", "images": {}, "success": true}