{"id": 444, "url": "https://www.novelhall.com/the-lucky-star-blessing-the-whole-village-32483/15193536.html", "title": "Chapter 444 - Chapter 444: Chapter 430:", "volume": 5, "volume_title": "Volume 5", "body": "<h1>Chapter 444 - Chapter 444: Chapter 430:</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 444: Chapter 430:<br/><br/>Liang Shanshan gritted her teeth and asked, “What do you really want?”<br/><br/>Xiao Jinli spoke lightly, “What did you rely on for your previous unscrupulous deeds?”<br/><br/>Liang Qiming’s pupils shrank, and he quickly realized. His heart trembled as he stammered, asking,<br/><br/>“You… you… it’s impossible. You’re just a doctor at most, and at most just a director of the Lu Xian Group. The Liang Group is one of the top enterprises in the whole country. How could you have such power?”<br/><br/>Xiao Jinli laughed, “Do you think I became the chairman of Lu Xian Group at a young age? Why did the Xiao Family Village become the safest tourist destination now?”<br/><br/>“How many powerful people in the world want to possess the Xiao Family Village, but why does it still stand strong?”<br/><br/>For each question Xiao Jinli asked, Liang Qiming’s face turned a few shades paler.<br/><br/>Now he understood.<br/><br/>It was Xiao Jinli who protected and kept the Xiao Family Village so peaceful and serene.<br/><br/>And who Xiao Jinli relied on, of course, was the country.<br/><br/>So, Xiao Jinli really had the ability to wipe the Liang Group off the face of the earth.<br/><br/>After all, who could compete against the might of the country?<br/><br/>Panic and fear welled up in Liang Qiming’s heart.<br/><br/>He tried to grab Xiao Jinli’s hand nervously, but she dodged him.<br/><br/>Su Yichen stepped between them and scolded sharply, “Just talk, don’t get physical.”<br/><br/>With his head down, Liang Qiming apologized sincerely, “Miss Xiao, or rather Doctor Xiao, I know I was wrong, and I sincerely apologize to you. Please forgive me, and please spare the Liang Group.”<br/><br/>Without the Liang Group, Liang Qiming would have nothing.<br/><br/>Moreover, during his time as the heir of the Liang Group, he had offended many people.<br/><br/>Once he was down and out, anyone could step on him.<br/><br/>The thought of living such miserable days made him feel like he was going insane.<br/><br/>Liang Shanshan suddenly realized the severity of the problem, or rather, the heavy consequences. She couldn’t help but cry out in fear, her face reflecting her panic.<br/><br/>Just like Liang Qiming, she thought that without the Liang Group, she would be nothing.<br/><br/>She had also made a lot of enemies, and played with many men in the palm of her hand. If she became vulnerable, she might become a plaything for men.<br/><br/>Compared to the Liang Group and the bright future ahead, what was a little humiliation?<br/><br/>Liang Shanshan quickly knelt down in front of Xiao Jinli and pleaded,<br/><br/>“Miss Xiao, I was wrong, and I apologize to you now. I’ll do anything you ask in the future, please forgive me and spare the Liang Group.”<br/><br/>Xiao Jinli raised an eyebrow, mildly surprised.<br/><br/>The two of them, though calling each other brother and sister, actually had no blood relationship and were only raised by the Liang Family. But they could both act subservient when needed.<br/><br/>Seeing Xiao Jinli’s indifferent demeanor, Liang Shanshan’s heart filled with hidden resentment, but she became even more anxious.<br/><br/>She looked around and noticed Li Jiatong. Her eyes lit up as she eagerly said to Li Jiatong,<br/><br/>“Tongtong, I’ve always treated you like my own sister since I met you. I beg you, help me plead with Miss Xiao.”<br/><br/>Inside, she despised Li Jiatong.<br/><br/>Li Jiatong, the little bitch, knew everything but kept it from her. Then she turned around and sold her out clean.<br/><br/>Now she had no way to deal with Xiao Jinli, but once she got out of this, she could still deal with Li Jiatong After all.<br/><br/>Just as Li Jiatong was enjoying the show, Liang Shanshan suddenly started begging her, startling her a bit.<br/><br/>She shook her head and refused, “Sister Shanshan, don’t ask me, I really can’t help you.”<br/><br/>What a joke, she wasn’t a saint. She didn’t have the compassion to sympathize with Liang Shanshan.<br/><br/>Liang Shanshan had brought this on herself with her wicked scheming. Now that the tables had turned, she had to face the consequences.<br/><br/>Why should she plead for her help? She and Liang Shanshan weren’t even close.<br/><br/>Furthermore, during this time, Liang Shanshan had stayed in her house without acting like a proper guest, bossing her and her mother around like servants. She had all of that stored in her memory.<br/><br/>It wasn’t just Liang Shanshan who held grudges; she did too.<br/><br/>Upon hearing Li Jiatong’s words, anger flashed in Liang Shanshan’s eyes before quickly disappearing.<br/><br/>When Liang Shanshan was just about to say something, still unsatisfied with being rejected, Xiao Jinli waved her hand and said,<br/><br/>“Don’t even bother saying anything else. If you do something wrong, you have to pay the price. Don’t say I’m ruthless or wicked. Compared to you, I’m just like a small witch meeting a greater witch.”\t\t\t\t\t\t</div>", "images": {}, "success": true}