{"id": 445, "url": "https://www.novelhall.com/the-lucky-star-blessing-the-whole-village-32483/15193537.html", "title": "Chapter 445 - Chapter 445: Chapter 430: _2", "volume": 5, "volume_title": "Volume 5", "body": "<h1>Chapter 445 - Chapter 445: Chapter 430: _2</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 445: Chapter 430: _2<br/><br/>Liang Qiming and Liang Shanshan shuddered upon hearing this.<br/><br/>Although they felt afraid and panicked in their hearts, they still didn’t quite believe that Xiao Jinli had the ability to bring down such a large group, declaring bankruptcy and leaving thousands of employees unemployed. They thought that such a terrible situation would never be allowed by the relevant authorities.<br/><br/>Realizing this, the two breathed a small sigh of relief.<br/><br/>They knew that no more pleading would help.<br/><br/>Liang Qiming was still somewhat puzzled about the incident of him and Liang Shanshan ending up in bed together.<br/><br/>He asked, “I clearly saw you drink that beverage with the aphrodisiac, and I helped you to the room. How did it turn out that Liang Shanshan was in my room?”<br/><br/>Xiao Jinli said indifferently, “Since you know I’m a Divine Doctor, a mere aphrodisiac is nothing that I wouldn’t recognize. Otherwise, I would be unworthy of the title ‘Divine Doctor’.”<br/><br/>Jiang Yifan rolled his eyes and said, “How stupid, of course that drugged beverage was switched.”<br/><br/>“Impossible!” Liang Qiming immediately denied, “To prevent accidents, I ordered different drinks for everyone, so there’s no way to swap.”<br/><br/>Actually, what he really wanted to prevent was Li Jiatong suddenly backing out and secretly informing Xiao Jinli, and then swapping their drinks.<br/><br/>Jiang Yifan was slightly surprised upon hearing this.<br/><br/>It turned out that this Liang Qiming actually had some brains.<br/><br/>Xiao Jinli said, “There was no switch. As a Divine Doctor, resolving a simple aphrodisiac is a piece of cake.<br/><br/>So, I didn’t care at all. The drinks outside are terrible, and I usually don’t drink them. I did take a few sips in front of you, but as soon as I turned around, I spat it into the trash can.”<br/><br/>Liang Qiming, “…”<br/><br/>Without waiting for them to ask, Xiao Jinli continued, “I didn’t drink the beverage, so of course I wouldn’t have any dizziness or unconsciousness. Earlier, I was just putting on an act for you.<br/><br/>After you helped me into the room, I applied the antidote I had prepared on your neck, so the person in the room was you. As for her…”<br/><br/>Xiao Jinli pointed at Liang Shanshan and said, “That was even simpler. I knocked her out directly and then carried her into your room.<br/><br/>Afterward, I gave her the same antidote. Oh, by the way, the antidote has some aphrodisiac effects as well.”<br/><br/>Liang Qiming, “…”<br/><br/>Liang Shanshan couldn’t believe it. “It was you who knocked me out?”<br/><br/>She was puzzled as to how she ended up in that room.<br/><br/>Xiao Jinli spread his hands and said, “Isn’t it obvious?”<br/><br/>Liang Shanshan, like a madwoman, screamed, “I want to call the police, I want to call the police, wuu…”<br/><br/>Liang Qiming raised his hand and gave her a harsh slap, coldly saying, “Shut up!”<br/><br/>If the police were called, it would be the two of them who would face the consequences.<br/><br/>Liang Shanshan, this stupid woman, really had her brains messed up by sleep.<br/><br/>As Liang Shanshan was about to continue cursing, Liang Qiming’s phone rang.<br/><br/>The ringing sounded abrupt in the room.<br/><br/>Liang Qiming didn’t want to pay attention to it, but when he saw the caller ID, it turned out to be his dad’s secretary.<br/><br/>“Secretary Li…”<br/><br/>Before he could speak, the secretary on the other side urgently said, “Young Master, the Chairman has suddenly fainted and is now in the rescue room. The doctor says he has cerebral infarction and needs surgery. We need a family member’s signature. We can’t reach Madam on the phone. You’d better come back quickly.”<br/><br/>“Did my dad faint?” Liang Qiming said in surprise, “Why did my dad faint?”<br/><br/>Secretary Li said, “I don’t know. The Chairman fainted in the CEO’s office. I heard the noise and went in to look, only to find that the Chairman had fainted. Young Master, please hurry back.”<br/><br/>Liang Qiming was anxious too. “Alright, Secretary Li, I’ll be back as soon as possible. Please keep an eye on my dad.”<br/><br/>After hanging up the phone, Liang Shanshan stood up from the ground, her face full of anxiety and tension, and asked, “What happened to dad?”<br/><br/>Liang Qiming said, “Dad fainted, he has a cerebral infarction and needs surgery. Let’s hurry back.”<br/><br/>Cerebral infarction is a very serious disease. If any accident occurs, the patient could easily collapse on the operating table.<br/><br/>Therefore, it was best for their family members to be around in case the patient needs someone.<br/><br/>Liang Shanshan was scared when she heard this, and she said, “Cerebral infarction? How could dad have cerebral infarction? Dad usually gets regular check-ups.”<br/><br/>At this point, her gaze suddenly shifted to Xiao Jinli, and she urgently asked, “Was it you? Did you make my dad sick?”\t\t\t\t\t\t</div>", "images": {}, "success": true}