{"id": 440, "url": "https://www.novelhall.com/the-lucky-star-blessing-the-whole-village-32483/15193532.html", "title": "Chapter 440 - Chapter 440: Chapter 427:", "volume": 5, "volume_title": "Volume 5", "body": "<h1>Chapter 440 - Chapter 440: Chapter 427:</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 440: Chapter 427:<br/><br/>Sister Shanshan and her brother had a big quarrel before finally realizing something was wrong.<br/><br/>“Wait, Liang Shanshan, how are you in my room?”<br/><br/>Liang Qiming’s face was scratched and bloody.<br/><br/>“I clearly helped Xiao Jinli into this room, and I’m sure she was unconscious,” Shanshan thought about it and said, “I was accompanying Li Jia Shitong for a walk downstairs when she suddenly said her stomach hurt and then went to the toilet. But after she left, I suddenly felt dizzy and then I passed out.”<br/><br/>Saying that, the siblings exchanged a glance, and blurted out in unison, “We’ve been tricked!”<br/><br/>Liang Shanshan was furious and said, “Xiao Jinli, it must be that bitch who set me up. Otherwise, why would it have been her in the room, and now it’s me?”<br/><br/>It would have been fine if she had just slept with someone else.<br/><br/>However, the man she slept with was her sworn enemy, her own younger brother.<br/><br/>Even if she had no shame, she should have known right from wrong.<br/><br/>This was clearly incest.<br/><br/>“Xiao Jinli is really evil.” Liang Shanshan gritted her teeth, “She clearly knows that we’re siblings, yet she dared to make us…”<br/><br/>Liang Qiming’s eyes darkened, and a fierce light flashed in them as he clenched his fists.<br/><br/>Not to mention that Shanshan couldn’t accept it, even he couldn’t accept it.<br/><br/>Xiao Jinli was indeed very evil.<br/><br/>“And Li Jiatong, that little bitch must have betrayed us,” Liang Shanshan gritted her teeth in anger, “Perhaps she’s been betraying us from the start, it’s just that her acting skills were too good, and we were deceived. Otherwise, how could so many coincidences happen?”<br/><br/>“These two bitches, I … I will take revenge, I must take revenge!” Liang Shanshan said viciously, “I’ll make them prostitutes ridden by thousands of people, so that I can vent my hatred.”<br/><br/>Liang Qiming’s lips were tightly pressed, and anger flashed in his eyes, but he quickly calmed down.<br/><br/>Looking at Liang Shanshan, he said coldly, “Revenge, how do you plan to take revenge now? The fact that I slept with you probably became a handle to control us. You still want revenge? I think you’re dreaming.”<br/><br/>Liang Shanshan almost broke down in tears, “No, I will take revenge. I will definitely get back at those two bitches.”<br/><br/>If Su Yichen likes Xiao Jinli, he should see what he thinks of her after she becomes a prostitute.<br/><br/>Liang Qiming said annoyingly, “Crying, crying, I knew you could only cry. Can crying solve the problem?<br/><br/>Since it has happened, we should control the damage as much as possible.<br/><br/>No matter how much we wanted each other to suffer before, we’re now in the same boat. So, Liang Shanshan, don’t think of using this to threaten me, especially my mom. Otherwise, I will never let you go.”<br/><br/>Upon hearing this, Liang Shanshan gritted her teeth and hated.<br/><br/>She said proudly, “You just said we’re in the same boat, how could I possibly do anything to you? All I want now is revenge on the two bitches, Xiao Jinli and Li Jiatong.”<br/><br/>Liang Qiming said, “Listen to me, we’ll get our revenge eventually.”<br/><br/>As Liang Shanshan was about to say something, there was a knock on the door.<br/><br/>The two were startled.<br/><br/>“Who is it?” Liang Qiming asked coldly.<br/><br/>“It’s me, Xiao Jinli!” Xiao Jinli reported her name directly.<br/><br/>Hearing Xiao Jinli’s name, the anger immediately showed on Liang Shanshan’s face. She cursed, “Great, this bitch dares to come to us.”<br/><br/>She was about to open the door, but suddenly remembered that she hadn’t put on her clothes.<br/><br/>She searched for her scattered clothes under the bed.<br/><br/>Not moving, she called to Liang Qiming, “Pick up my clothes.”<br/><br/>Liang Qiming covered himself with the other end of the blanket, and of course, there was not a shred under him. Gritting his teeth, he said, “Pick them up yourself. I won’t do it for you.”<br/><br/>Liang Shanshan shouted, “Liang Qiming, are you a man or not? You’re even fighting with me over this.”<br/><br/>Liang Qiming raised an eyebrow and said mockingly, “Whether I’m a man or not, don’t you know?”<br/><br/>Liang Shanshan was immediately speechless, her face flushed with shame and anger.<br/><br/>She gritted her teeth and said, “You get dressed first and open the door. I want to see what she’s up to.”<br/><br/>Liang Qiming lifted the blanket, and Liang Shanshan was frightened and quickly closed her eyes.<br/><br/>Liang Qiming picked up his clothes from the floor and picked up Liang Shanshan’s clothes, throwing them to her and saying coldly, “Hurry up and put your clothes on. After I put mine on, I’ll open the door.”<br/><br/>Liang Shanshan picked up the clothes on the bed and quickly put them on.<br/><br/>After a while, she said, “Open the door.”<br/><br/>As soon as Liang Qiming opened the door, his pupils shrank when he saw the people standing outside.<br/><br/>Then, the corner of his mouth hooked into a sarcastic smile, “Miss Xiao, I really underestimated you. Are you satisfied now?”<br/><br/>Xiao Jinli nodded with a smile, “Satisfied, how can I not be satisfied? What do you think, Mr. Liang?”<br/><br/>Liang Qiming’s face darkened, and he said accusingly, “Xiao Jinli, Liang Shanshan and I are brother and sister. How could you be so ruthless as to make us commit incest!”<br/><br/>Xiao Jinli sneered, “Siblings? Haha, she was lacking a man and you were lacking a woman, so I put you two together. What’s wrong with that?”<br/><br/>“Ah, I’m going to kill you!” Hearing Xiao Jinli’s arrogant words, Liang Shanshan, like a madwoman, rushed out, reaching out to slap Xiao Jinli in the face, shouting, “You bitch, you ruined me, I’m going to kill you, kill you!”<br/><br/>Liang Shanshan’s angry howling soon attracted the attention of other hotel guests and waitresses. Fearing trouble, the waitresses quickly called the manager over.<br/><br/>Xiao Jinli quickly dodged Liang Shanshan’s slap, and while counterattacking, grabbed her arm. Liang Shanshan tried to pull her arm free, but it was no use, as Xiao Jinli’s strength held on like a pair of iron pincers.<br/><br/>Liang Shanshan yelled in anger, “Bitch, let go of me!”<br/><br/>“Slap!”<br/><br/>Liang Shanshan’s face was slapped hard by someone.<br/><br/>After slapping her, Xiao Jinli pushed Liang Shanshan’s arm, and Liang Shanshan stumbled back a few steps.<br/><br/>Xiao Jinli said coldly with a stern face, “Liang Shanshan, this is my lesson to you.<br/><br/>You left and right calling me a bitch, then went to my mom behind my back and tried to tarnish my reputation, making me carry the name of a mistress. I’m letting you off lightly with just one slap.”<br/><br/>“You really thought I, Xiao Jinli, could be bullied easily? Don’t you know what kind of person I am?”<br/><br/>In fact, she tried to find out, but she couldn’t.<br/><br/>Liang Shanshan’s face immediately swelled up. She covered her face and cried in despair, “Ah, ah …”<br/><br/>She had never suffered such humiliation and insult since she was a child. At the moment, she simply couldn’t bear it.\t\t\t\t\t\t</div>", "images": {}, "success": true}