{"id": 443, "url": "https://www.novelhall.com/the-lucky-star-blessing-the-whole-village-32483/15193535.html", "title": "Chapter 443 - Chapter 443: Chapter 429: _2", "volume": 5, "volume_title": "Volume 5", "body": "<h1>Chapter 443 - Chapter 443: Chapter 429: _2</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 443: Chapter 429: _2<br/><br/>Li Jiatong looked at Xiao Jinli and then at Su Yichen, not quite understanding what they meant.<br/><br/>Li Jiatong asked, “Sister Jin Li, how are you not going to let them off?”<br/><br/>Xiao Jinli said indifferently, “It depends on their performance. If they’re smart, it’s fine.” She was afraid that they would still think about revenge.<br/><br/>She wasn’t afraid of their revenge, but she hated trouble. If they kept seeking revenge endlessly, that would be troublesome.<br/><br/>Li Jiatong remained silent.<br/><br/>She had been living in Xiao Family Village for quite some time, and she knew from the villagers that in their eyes, Xiao Jinli was almost like a divine being.<br/><br/>So, she was worshipped by everyone in the village, regardless of their age or gender.<br/><br/>Even the new daughters-in-law, they could disrespect their parents-in-law, but they had to respect Xiao Jinli and couldn’t have any objections to her requests.<br/><br/>Of course, many new daughters-in-law, influenced by their maiden families, wanted to look down on Xiao Jinli and even had objections to her winning the trust of the whole village. They thought they shouldn’t listen to a child and things like that. In that case, they had no choice but to either break off ties with their maiden family or divorce.<br/><br/>If they looked down on Xiao Jinli, it meant they looked down on their mother-in-law’s family. In that case, they were sorry, but what they married back was their daughters-in-law, not their ancestors.<br/><br/>So, with lessons from the past, many new daughters-in-law, no matter what their grievances were, had to suppress them in their hearts.<br/><br/>Xiao Jinli, at such a young age, must have had skills and abilities to win the trust and admiration of the whole village.<br/><br/>Otherwise, even if the villagers were stupid, they wouldn’t trust and admire a fool, would they?<br/><br/>Only those who can bring benefits and hope to the whole village are truly worthy of people’s trust, right?<br/><br/>Li Jiatong secretly felt a sense of anticipation in her heart.<br/><br/>After a while, Sister Shanshan and her brother came in after tidying themselves up.<br/><br/>Liang Shanshan still wore an angry and resentful expression on her face.<br/><br/>So what if she knew that Xiao Jinli was the divine doctor, had the things Xiao Jinli had done sneakily be justified?<br/><br/>She stared at Li Jiatong with a resentful expression and asked harshly, “Why? You clearly took my things, but you betrayed me the moment you turned around!”<br/><br/>Li Jiatong said, “When you first gave me something and approached me for cooperation, I told Sister Jin Li about it.”<br/><br/>Liang Shanshan’s pupils shrank.<br/><br/>So, all her and Liang Qiming’s actions were under Xiao Jinli’s control.<br/><br/>She and her brother were like two jumping clowns, showing off in front of her.<br/><br/>Liang Shanshan angrily questioned, “If you didn’t want to cooperate, you shouldn’t have agreed. You agreed and then betrayed us. People like you are really too terrifying.”<br/><br/>Li Jiatong said innocently, “But Sister Shanshan, when you and Liang Qiming were taking action, I reminded you several times. But you were so self-righteous, thinking everything was under control. So, it’s because of your own selfish greed and interest that this situation happened. What can I do? I can only cooperate.”<br/><br/>Liang Shanshan, “…” Li Jiatong did say not to do it, but they didn’t listen. They only thought success was at hand.<br/><br/>Liang Qiming looked at Xiao Jinli and then sincerely apologized to her, “Miss Xiao, I apologize to you. I shouldn’t have had any ideas about you. I was too self-centered. Now, I have faced the consequences and paid the price. Can you forgive me?”<br/><br/>He only talked about forgiving him and didn’t include Liang Shanshan.<br/><br/>Xiao Jinli looked at Liang Qiming with a seemingly smiling expression and didn’t answer his question about forgiveness. Instead, she sharply asked, “Liang Qiming, if I weren’t the famous divine doctor Xiao, but just a regular girl, would you have backed off? Would you apologize?”<br/><br/>Liang Qiming opened his mouth but didn’t know how to respond.<br/><br/>Xiao Jinli smiled and said, “Let me answer that for you. Of course not, right? So why do you think that once you know you’re wrong, I should forgive you? Do you need me to forgive you?”<br/><br/>Liang Shanshan couldn’t help but angrily retort, “What more do you want from us? You let us sleep together knowing our relationship, how can you be so vicious? When this gets out, how can we face others? Xiao Jinli, the divine doctor, everyone says you’re a lifesaving Bodhisattva, but when you hurt people, you don’t even blink. Do you deserve the praise?”<br/><br/>Jiang Yifan immediately refuted, “Auntie, your words are really funny. If you hadn’t tried to hurt my mother, would she have actively tried to hurt you?<br/><br/>You’re angry and embarrassed now just because your schemes didn’t succeed.<br/><br/>If they had succeeded, knowing my mother’s identity as a divine doctor, you probably would have set off fireworks to celebrate it because the divine doctor was stepped on by you, making it even easier to use her in the future.<br/><br/>It’s so funny. You know you’re wrong, but you still refuse to apologize, and you want to save face and suffer.”<br/><br/>Li Jiatong nodded in agreement, “Little Fanfan is right. Little Fanfan has a sharp tongue.”<br/><br/>Liang Shanshan was speechless, unable to refute any of the words. The resentment in her chest was stuck, and she turned purple from holding her breath.<br/><br/>She couldn’t say that what the child was saying wasn’t true.<br/><br/>If their plan had succeeded and they had learned of Xiao Jinli’s identity as a divine doctor, they would just be more proud and happy.<br/><br/>Because with the trump card of Doctor Xiao Jinli, then everything would belong to the Liang family. With the national identity background, the Liang family could walk sideways anywhere.<br/><br/>But now, their plan had failed, and they had already borne the consequences of their failure.<br/><br/>Liang Shanshan asked unwillingly, “So what exactly do you want us to do?”<br/><br/>“What exactly do we want you to do? How should I put it?” Xiao Jinli tilted her head, supported her cheek with her hand, and smiled, “I think if you do something wrong, you should bear the consequences, right?”<br/><br/>Liang Qiming and Liang Shanshan’s expressions changed.<br/><br/>Haven’t they already borne the consequences?\t\t\t\t\t\t</div>", "images": {}, "success": true}