{"id": 448, "url": "https://www.novelhall.com/the-lucky-star-blessing-the-whole-village-32483/15193540.html", "title": "Chapter 448 - Chapter 448: Chapter 432:", "volume": 5, "volume_title": "Volume 5", "body": "<h1>Chapter 448 - Chapter 448: Chapter 432:</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 448: Chapter 432:<br/><br/>After Lin Xiaoxiao’s legs recovered, her engagement ceremony with Xiao Junxuan was scheduled.<br/><br/>Lin Chengdong wanted to show off that his biological daughter had found an ideal groom and that he had a good son-in-law, so even for the engagement ceremony, he invited everyone he should, shouldn’t, and might as well have invited.<br/><br/>As a result, everyone in the Capital Circle knew that Lin Chengdong’s biological daughter had found Doctor Xiao’s big brother as her husband, and that Lin Xiaoxiao had a particularly good relationship with Doctor Xiao.<br/><br/>So, no matter whether they had a good relationship with Lin Chengdong before or not, they all tried to please him.<br/><br/>Pleasing Lin Chengdong, the future father-in-law of Doctor Xiao’s big brother, was equivalent to pleasing Doctor Xiao.<br/><br/>Previously, they wanted to please Doctor Xiao, but unfortunately, they had no way.<br/><br/>As everyone knows, Doctor Xiao was either invited to the Retirement Home for Cadres to treat the old heroes or went to the Jiang Family’s home.<br/><br/>But no matter whether it was the Nursing Home or the Jiang Family, they were not places that ordinary businessmen could freely enter, so if they wanted to meet Doctor Xiao, they could either go to Xiao Family Village, or just block the way on these two routes.<br/><br/>If they went to Xiao Family Village, they would have to wait in line online, otherwise, even if they met Doctor Xiao, it would be of no use.<br/><br/>Don’t think that by going to Xiao Family Village, you can just stay at the Xiao Family Village Hospital; that’s simply impossible.<br/><br/>Every day, the Xiao Family Village Hospital is full of patients who have made appointments in advance, and there is no way to squeeze in.<br/><br/>Any personal connections won’t work.<br/><br/>Blocking people at those two places is even less practical than going to Xiao Family Village.<br/><br/>Therefore, to invite Doctor Xiao to come out, you either have to invite the Jiang Family to intercede or have the country intercede, but without a huge amount of power, you simply don’t have enough face to let people intervene.<br/><br/>So, before, they wanted to find Doctor Xiao to see a doctor, and they had no way to ask for help.<br/><br/>Now, who would have thought that Lin Xiaoxiao, who has a domineering reputation in the Capital City, has actually become a family with Doctor Xiao? They might be able to ask Lin Family father and daughter for help if they want to find Doctor Xiao.<br/><br/>On another note, this time Lin Xiaoxiao’s engagement banquet is to be held in Xiao Family Village, so obviously, this is an opportunity to get close to and get acquainted with Doctor Xiao.<br/><br/>So, no matter whether they have a good relationship with Lin Chengdong or not, they all happily accepted the invitation!<br/><br/>This opportunity to go to Xiao Family Village and meet Doctor Xiao is hard to come by, only a fool would refuse!<br/><br/>Even the Liang Family received an invitation!<br/><br/>Liang Haohan, who was hospitalized due to illness, felt quite happy when he heard such information!<br/><br/>After all, with his current physical condition, if he could have Doctor Xiao take a look, he would surely recover quickly!<br/><br/>At this time, Liang Haohan never thought that the chairman of the Lu Xian Group and Doctor Xiao were the same person!<br/><br/>So, it’s pointless for him to go!<br/><br/>However, before he had even considered whether or not to ask his son to accompany him, the Liang Family’s invitation from the Lin Family was taken back!<br/><br/>Liang Haohan’s face turned so dark that it was truly unsightly!<br/><br/>Ignoring his angry expression, Lin Chengdong directly said, “Director Liang, I’m sorry, but my subordinate didn’t hear clearly, and the invitation was sent in error. Please return it to me!”<br/><br/>Liang Haohan’s expression was extremely ugly!<br/><br/>Got the invitation wrong? Who are you fooling?<br/><br/>Could an invitation sent in error have Liang Haohan’s name written on it so clearly?<br/><br/>Liang Haohan gritted his teeth and said, “Director Lin, I haven’t offended you in any way. Even the competition in the shopping mall is fair and just, so why do you insult me like this?”<br/><br/>Lin Chengdong smiled and said, “Director Liang, I’m really sorry, but the invitation was indeed sent in error! Normally, it wouldn’t matter, but I have to explain to my in-laws!”<br/><br/>Liang Haohan, puzzled, asked, “What does your sending invitations have to do with your in-laws?”<br/><br/>As the daughter’s family, who they invite to the engagement banquet shouldn’t concern the groom’s family, right?\t\t\t\t\t\t</div>", "images": {}, "success": true}