{"id": 442, "url": "https://www.novelhall.com/the-lucky-star-blessing-the-whole-village-32483/15193534.html", "title": "Chapter 442 - Chapter 442: Chapter 429:", "volume": 5, "volume_title": "Volume 5", "body": "<h1>Chapter 442 - Chapter 442: Chapter 429:</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 442: Chapter 429:<br/><br/>There were so many people outside watching the fun.<br/><br/>Liang Qiming and his sister had many questions in their hearts.<br/><br/>He calmed himself down and said to Xiao Jinli, “Jinli, can we talk?”<br/><br/>His attitude wasn’t one of anger at being counter-schemed, but rather a combination of flattery, appeasement, and request.<br/><br/>Su Yichen was very dissatisfied and said, “Jinli, are you guys close? Mr. Liang, just call her Miss Xiao.”<br/><br/>Xiao Jinli, “…”<br/><br/>Jiang Yifan, “…” was Su Yichen getting jealous?<br/><br/>Liang Qiming had a black face as he asked, “Who are you again?”<br/><br/>He knew that Xiao Jin li’s identity was not to be offended. Even now that she had counter-schemed them, he dared not speak angrily.<br/><br/>But what about the others? They didn’t count for anything.<br/><br/>Su Yichen coldly said, “I’m your uncle!”<br/><br/>Everyone, “…” so arrogant.<br/><br/>Liang Qiming’s anger was immediately provoked as he yelled, “What? Whose uncle are you?”<br/><br/>Su Yichen wasn’t afraid to provoke him, saying, “I’m your uncle. Even if your dad was in front of me, he would only have to hang his head.”<br/><br/>After hearing this, Liang Qiming was about to lose his temper and curse, but on second thought, this man was very close to Xiao Jinli. Birds of a feather flock together, and it’s possible that his identity was indeed extraordinary.<br/><br/>After all, just because he didn’t know any top-tier identities, that didn’t mean they didn’t exist.<br/><br/>Liang Qiming no longer tangled with Su Yichen on this issue, but instead asked Xiao Jinli with a pleading tone, “Jin… Miss Xiao, can we? I have nothing else, I just want to know what’s going on.”<br/><br/>Xiao Jinli glanced at the onlookers and didn’t want to be seen as a monkey show. She nodded and said, “Alright.”<br/><br/>Then, she turned to the spectators and said coldly, “Everyone, I am Xiao Jinli from Xiao Family Village. If you have any business, you can find me in Xiao Family Village. Now I have some private matters to deal with, please disperse.”<br/><br/>No one present wanted to offend Xiao Jinli.<br/><br/>Since she had spoken, everyone naturally left with discretion.<br/><br/>Although they were very curious about what was happening here.<br/><br/>After everyone had left, Xiao Jinli and her group walked straight into the room.<br/><br/>However, seeing the mess and the smell of blood in the room, she frowned and said, “Let’s change rooms. Go to the room next door. Clean up yourselves.”<br/><br/>She had given them some respect.<br/><br/>Liang Qiming, “…”<br/><br/>Xiao Jinli and the others left without waiting for any response from Liang Qiming.<br/><br/>As soon as Xiao Jinli returned to their room, she crossed her arms, smiled, and looked at Su Yichen, asking, “Brother Little Quan, how did you come along?”<br/><br/>“Mommy, Uncle Su was worried about you!” Jiang Yifan, the little devil, explained, “Mommy, this is what happened. I accidentally overheard the Liang brother and sister…”<br/><br/>He told them about accidentally hearing the Liang siblings’ conspiracy.<br/><br/>Li Jiatong was surprised with her mouth wide open, and then asked incredulously, “Who gave them the courage to think that one could become the Wealthiest Person’s Madam and the other could become the Lu Xian Group’s favored son-in-law? They even deluded themselves into wanting to control the entire Xiao Family Village?”<br/><br/>Jiang Yifan smacked his mouth and said, “Probably Liang Jingru. After all, Liang Jingru and their Liang Family might have been a family 500 years ago.”<br/><br/>Li Jiatong, “…” it made sense.<br/><br/>Su Yichen looked at Xiao Jinli with a little hesitation and asked, “Jinli, judging from your attitude, you don’t plan on letting them off, do you?”<br/><br/>As for him, he would definitely not let them off. They had bullied Xiao Jinli, and not teaching them a deep lesson would be letting her down.<br/><br/>Xiao Jinli’s lips curled into a faint smile and she chuckled, “Let them off? How could I? With such large intentions and malice, letting them off would be too cheap.”<br/><br/>Although their conspiracy was not very substantial, it was still the most insidious and effective. If it had been an ordinary girl, she might have fallen for it or even been deceived.<br/><br/>After all, Liang Qiming was not bad, both in looks and body, and most importantly, his family was rich and powerful. Any girl who was relentlessly pursued by such a man would probably lose.<br/><br/>Hearing Xiao Jinli’s words, Su Yichen was relieved.<br/><br/>This was the Xiao Jinli he knew. She didn’t bully others, but she would never let herself be bullied either.<br/><br/>She was kindhearted, but she was not a saint.\t\t\t\t\t\t</div>", "images": {}, "success": true}