{"id": 446, "url": "https://www.novelhall.com/the-lucky-star-blessing-the-whole-village-32483/15193538.html", "title": "Chapter 446 - Chapter 446: Chapter 430: _3", "volume": 5, "volume_title": "Volume 5", "body": "<h1>Chapter 446 - Chapter 446: Chapter 430: _3</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 446: Chapter 430: _3<br/><br/>Li Jiatong was somewhat speechless and said, “Liang Shanshan, stop being unreasonable.”<br/><br/>“What does your father’s illness have to do with Sister Jinli? Are you suggesting that Jinli made him sick?”<br/><br/>“Jinli is a doctor, not a god. She heals people, she doesn’t make them sick.”<br/><br/>Fearing that Liang Shanshan would make absurd claims and offend Xiao Jinli again, Liang Qiming quickly warned her,<br/><br/>“Liang Shanshan, have you gone mad? Your father’s illness has nothing to do with Doctor Xiao. Let’s go, we should head back to the Capital City immediately!”<br/><br/>Liang Shanshan knew she was being unreasonable, but the events occurred too coincidentally, causing her to overthink.<br/><br/>Liang Qiming, and Liang Shanshan left in a hurry.<br/><br/>However, there were no more flights left. Liang Qiming used all his connections to get a helicopter to come and pick them up.<br/><br/>Seeing the Liang brothers leaving, Li Jiatong asked with confusion, “Uncle Liang is sick?”<br/><br/>She looked towards Xiao Jinli.<br/><br/>Xiao Jinli shrugged, without replying to Li Jiatong.<br/><br/>This child would be better off with less interaction with these dark matters.<br/><br/>As the group returned to the Xiao Family Village, Su Yichen, unable to mask his curiosity, asked Xiao Jinli, “Jinli, Liang Shanshan and Liang Qiming, they are…”<br/><br/>Xiao Jinli knew what he was about to ask and smiled, “They’re not real siblings.”<br/><br/>“Ha, not real siblings?” Su Yichen was quite surprised, “This is really unexpected. After all, in the Capital City, nobody knew that they weren’t real siblings.”<br/><br/>“He-he, I bet even Liang Haohan doesn’t know.” Xiao Jinli laughed softly.<br/><br/>Su Yichen curiously asked again, “So, which one of them isn’t Liang Haohan’s child?”<br/><br/>Xiao Jinli said, “Both of them aren’t!”<br/><br/>“…” Su Yichen was even more surprised by this, and then he laughed, “So, Liang Haohan already has grass growing on his head.<br/><br/>But I heard that Liang Haohan had a very good relationship with his ex-wife. He even treated his ex-wife like a princess. It’s just that his ex-wife was melancholic and died from depression.<br/><br/>Later, Liang Haohan transferred his affection to his daughter. His second marriage was to better care for his daughter.<br/><br/>However, as time passed, even the deepest affection could not stand against the traditional mindset of preferring boys over girls. As a result, his once most adored daughter became a tool that he used.”<br/><br/>Saying this, he began to laugh!<br/><br/>Then he said, “To think that both the daughter whom Liang Haohan had treasured, and the son he treasures now, are not his. Is it really that miserable?”<br/><br/>Su Yichen didn’t doubt the truth of what Xiao Jinli had revealed!<br/><br/>Others might not know, but he knew very well. Every piece of information given by Xiao Jinli was authentic.<br/><br/>Because Xiao Jinli had unmatched hacker skills in the world!<br/><br/>Xiao Jinli openly said, “This time, Liang Haohan passed out due to a stroke after receiving a video of Liang Qiming and his sister in bed.”<br/><br/>Su Yichen, “…” Jinli was really too wicked!<br/><br/>Su Yichen laughed and said, “Haha, serve him right! He claims to be human, but his acts are inhuman! In the business world, he resorts to every trick in the book, causing many people to become bankrupt, families to break apart, and lives to be lost! Now, let him taste the consequences!”<br/><br/>As for Liang Haohan’s future, Su Yichen had no sympathy at all!<br/><br/>This was the consequence Liang Haohan had brought upon himself. It was merely a case of karma coming back to him!<br/><br/>Su Yichen asked, “Jinli, is there anything you want me to do? As for him, I had already started making arrangements!”<br/><br/>Xiao Jinli shook her head and said, “Not for now! After Liang Haohan comes out of the operating room, we’ll present him this big gift. Consider it a form of repayment for the people he’s harmed in the past!”<br/><br/>Su Yichen nodded and said, “Alright, I’ll follow your lead! When the time comes, I’ll arrange for the Liang Family’s assets to be donated to the foundation and to help the children in impoverished mountainous areas go to school!”<br/><br/>Xiao Jinli had no objections and said, “Every action has consequences! Liang Haohan is not innocent!”<br/><br/>At a luxurious villa in Capital City, a man and a woman were in the throes of passion!<br/><br/>After the passion subsided, the woman picked up her phone and saw several missed calls, some from her secretary, her son, and her relatives from her maiden family!<br/><br/>The woman panicked and wondered, “What could have possibly happened?”<br/><br/>Subsequently, she called back her son.<br/><br/>“Mom, where are you now? Dad’s been hospitalized, did you know that? Everyone’s looking for you!”<br/><br/>Liang Qiming shouted angrily,<br/><br/>“Dad has a stroke and needs surgery, and we couldn’t find you! Hurry to the hospital to sign off on the surgery, I’m on my way back to the Capital City!”<br/><br/>Mrs. Liang turned pale and hurriedly said, “Alright, son, I’ll rush over there now!”<br/><br/>After hanging up, she rushed to the hospital, ignoring the man who was calling her from behind!<br/><br/>She knew very well that everything she had now was given by Liang Haohan, so he couldn’t have anything happen to him!\t\t\t\t\t\t</div>", "images": {}, "success": true}