{"id": 441, "url": "https://www.novelhall.com/the-lucky-star-blessing-the-whole-village-32483/15193533.html", "title": "Chapter 441 - Chapter 441: Chapter 428:", "volume": 5, "volume_title": "Volume 5", "body": "<h1>Chapter 441 - Chapter 441: Chapter 428:</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 441: Chapter 428:<br/><br/>The bustling scene quickly attracted a crowd.<br/><br/>After hearing Xiao Jinli’s words, someone frowned and mumbled, “Xiao Jinli, Xiao Jinli, why does this name sound so familiar?”<br/><br/>“I know, I also feel like I’ve heard the name Xiao Jinli before, but I can’t remember where.”<br/><br/>Soon, someone remembered.<br/><br/>“Ah, I remember now. Isn’t the female divine doctor in Xiao Family Village Hospital called Xiao Jinli?” someone exclaimed.<br/><br/>“The female divine doctor from Xiao Family Village?” Many people immediately questioned, “No way? Xiao Jinli doesn’t look very old. Is she even twenty years old?”<br/><br/>Someone immediately refuted, “What do you know? It is said that the female divine doctor Xiao Jinli from Xiao Family Village is indeed a young beauty.<br/><br/>She first saved Old Yuan eight years ago, removing a bullet from the edge of his heart. Later, she diagnosed him with brain cancer.<br/><br/>At that time, Doctor Xiao was only in her teens.”<br/><br/>“Not only that, I heard she also saved Elder Zeng who had late-stage cancer.”<br/><br/>“Now, cancer patients from all over the world are going to Xiao Family Village Hospital.<br/><br/>The good thing is that the hospital doesn’t care about power and authority. As long as the patient gets a number, they can line up for treatment, bringing hope to many ordinary families.<br/><br/>But in the whole world, there’s only one Doctor Xiao who can bring people back to life from cancer.”<br/><br/>“Anyway, this gives so many people hope.”<br/><br/>“It is said that the country built The Retirement Home for Cadres in Xiao Family Village because Xiao Jinli is from there. That way, if any of the old cadres are unwell, they can see a doctor nearby.”<br/><br/>“So, Doctor Xiao is not even twenty years old now.”<br/><br/>“Isn’t that right?”<br/><br/>“So this Xiao Jinli is that Doctor Xiao? Young and beautiful, and named Xiao Jinli, it can only be her.”<br/><br/>“Ah, can I go up and ask for her autograph? I really admire Doctor Xiao so much. A child in her teens, yet she has such amazing life-saving powers.”<br/><br/>“There’s only one person like that in the whole world. I also want to go ask for an autograph.”<br/><br/>…<br/><br/>The discussion naturally caught the attention of Liang Qiming and Liang Shanshan.<br/><br/>Upon hearing that Xiao Jinli was the famous Doctor Xiao, their faces showed great astonishment, followed by their complexions changing rapidly.<br/><br/>They had been in Xiao Family Village for some days and knew that Xiao Jinli often went to the hospital. They just thought she went there to visit since it was normal for people from Xiao Family Village to do so.<br/><br/>They never, ever expected that this Xiao Jinli was the legendary divine doctor from Capital City.<br/><br/>Doctor Xiao was a person who even the top power players in the Capital sought to please.<br/><br/>After all, no one could guarantee they would live a healthy life without illness, especially as they get older and their worries increase.<br/><br/>It’s important to know that Elder Zeng usually had the National Doctor Xu check his pulse for safety. He also had health check-ups at the hospital every three months, but no one had detected the cancer in his body.<br/><br/>However, Doctor Xiao diagnosed his illness with just one check, and it was already late-stage cancer!<br/><br/>When the Yuan Family heard about it, they were devastated!<br/><br/>But Doctor Xiao treated him, and within just three months, Elder Zeng’s condition returned to health!<br/><br/>This is simply a miracle in the medical field!<br/><br/>Later, the country hired Doctor Xiao to take care of the pulses of those old cadres!<br/><br/>Liang Qiming’s mouth trembled, he asked in disbelief, “You… you are Doctor Xiao?”<br/><br/>Li Jiatong, puzzled, asked, “Didn’t you guys know?”<br/><br/>Liang Qiming froze, and even the collapsing Liang Shanshan stopped crying, her expression clearly shocked!<br/><br/>Of course, they didn’t know!<br/><br/>If they had known early that Xiao Jinli was the Divine Doctor Xiao, they wouldn’t have used such despicable means no matter what!<br/><br/>After all, a person with the entire country as their background is not someone they could mess with!<br/><br/>Especially since both siblings had ulterior motives!<br/><br/>One wanted Mrs. Su and planned to destroy the girl that Su Yichen admired!<br/><br/>One found out that Xiao Jinli was the Chairman of the Lu Xian Group and wanted to use her as a stepping stone to take over the entire Xiao Family Village, become friends with the powerful and rich, and live luxurious and superior days!<br/><br/>On these premises, Xiao Jinli was just an ordinary girl with a bit of a background!<br/><br/>They could handle her!<br/><br/>But once Xiao Jinli became the Divine Doctor with a national background, they wouldn’t dare to mess with such a mythical figure!<br/><br/>Looking at their shocked and incredulous expressions, Li Jiatong was extremely dumbfounded!<br/><br/>She asked, “When you heard Xiao Jinli’s name before, didn’t you have any suspicions? Especially since you stayed in Xiao Family Village for so long and noticed Sister Jin Li going to the hospital every day, didn’t you ever have any doubts?”<br/><br/>Liang Qiming and his siblings, “…”<br/><br/>They genuinely never suspected that Xiao Jinli was the Divine Doctor Xiao!<br/><br/>Li Jiatong instantly looked at them as if they were idiots!<br/><br/>She had previously suspected that Liang Shanshan and her brother were out of their minds, targeting the Divine Doctor of all people and even trying to use despicable means against her!<br/><br/>Liang Shanshan finally came back to her senses, glaring at Li Jiatong’s face, her anger spewing like fire. She pointed at Li Jiatong and shouted, “Li Jiatong, I treated you like my own sister, but you teamed up with others to set me up? Do you have a conscience, you ungrateful wolf, taking my several million and then betraying me? You’re such a despicable person!”<br/><br/>Hearing “several million,” the bystanders were full of disbelief.<br/><br/>“Damn, what kind of person is this, so rich!”<br/><br/>“What’s going on here? Why is the Divine Doctor Xiao here?”<br/><br/>“There’s something wrong. This woman just said the Divine Doctor calculated them? Why would the Divine Doctor do that?”<br/><br/>Everyone looked back and forth between Xiao Jinli and the Liang siblings in confusion!<br/><br/>Fearing it would tarnish Xiao Jinli’s reputation, Su Yichen immediately explained.<br/><br/>He pointed to Liang Qiming and his sibling, saying, “These two came to Xiao Family Village and used despicable means to make the Divine Doctor sleep with this man!<br/><br/>However, the Divine Doctor was very clever and saw through their tricks, derailing their plot.<br/><br/>They were furious and even questioned why others destroyed their schemes! Are these people bad or not?”<br/><br/>“Of course they are bad!”<br/><br/>“So they are reaping what they sowed? They have no one to blame but themselves. I’ve never seen anyone doing evil things be so self-righteous!”<br/><br/>“It’s true what they say, ‘Evil brought by heaven can be borne; evil brought by oneself is unbearable!’”<br/><br/>“Ah, ah,…” Liang Shanshan covered her ears in frustration, “Shut up! Shut up! What do you know? You don’t know anything! He and I, he is…”<br/><br/>“Shut up!” Liang Qiming immediately stopped her!<br/><br/>If Liang Shanshan revealed they were siblings sleeping together, they would probably make headlines immediately!<br/><br/>He wouldn’t be able to handle that embarrassment!<br/><br/>Furthermore, they could potentially face various public opinions!\t\t\t\t\t\t</div>", "images": {}, "success": true}