{"id": 447, "url": "https://www.novelhall.com/the-lucky-star-blessing-the-whole-village-32483/15193539.html", "title": "Chapter 447 - Chapter 447: Chapter 431:", "volume": 5, "volume_title": "Volume 5", "body": "<h1>Chapter 447 - Chapter 447: Chapter 431:</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 447: Chapter 431:<br/><br/>Liang Haohan’s surgery was successful.<br/><br/>When he woke up and saw his children by his bedside, anger flashed in his eyes, and he roared, “Get out of here!”<br/><br/>However, he had just had surgery and had no strength in his body, so his roar had no deterrence.<br/><br/>Liang Shanshan was very angry when her father drove her out as soon as he woke up.<br/><br/>She shouted, “Fine, I’ll leave. You’re getting more and more confused as you get sicker. When we heard that you were sick, we rushed back from so far away. And now that you’re awake, you drive me out.”<br/><br/>When she said these words, Liang Shanshan felt both indignant and wronged.<br/><br/>From the age of ten, it was challenging for her to experience the so-called father’s love.<br/><br/>All of his fatherly love went to Liang Qiming, who came later.<br/><br/>Mrs. Liang comforted him, “Old Liang, you just woke up and you’re so angry. You’re still a patient, you have to be careful not to get too mad. Even if Shanshan is wrong, it’s not too late to teach her a lesson when your body recovers.”<br/><br/>She intentionally ignored Liang Haohan mentioning both of them and only pointed at Liang Shanshan.<br/><br/>When Liang Haohan saw them, he thought of the video on his cellphone, and he couldn’t help but get angry.<br/><br/>Liang Qiming was also confused and said, “Dad, calm down. When Sister heard that you were sick, she was very worried. Before you woke up, she had been watching by your bed.”<br/><br/>For once, Liang Qiming spoke in favor of Liang Shanshan.<br/><br/>However, as soon as Liang Qiming opened his mouth, it made Liang Haohan even more suspicious.<br/><br/>He thought that the once incompatible brother and sister were showing signs of improvement. If it had been before, he would have been relieved.<br/><br/>But now, he only felt anger, thinking that the siblings had slept together, so they had a different kind of emotion.<br/><br/>He was a man, how could he not know?<br/><br/>Liang Haohan’s face darkened, and he said solemnly, “I don’t want to see you either, you get out too.”<br/><br/>When he said this, Mrs. Liang’s eyelids twitched, and she couldn’t help but feel a little flustered.<br/><br/>But she didn’t immediately defend her son. Instead, she glanced at the angry Liang Haohan and said to Liang Qiming, “Son, you go out first. Your dad can’t be angry right now. When he cools down, you can come back. Don’t worry, I’ll take good care of him.”<br/><br/>Liang Qiming also felt that his father’s anger was inexplicable. But right now, his dad’s health was more important.<br/><br/>He nodded and said, “Okay, Mom, I’ll go back first, and you take care of Dad.”<br/><br/>After the siblings left, Mrs. Liang cautiously tested the waters, “Husband, did our son make you angry? Tell me, and I’ll talk to him later.”<br/><br/>Liang Haohan pursed his lips and said nothing. He didn’t want to reveal such shameful news.<br/><br/>But when he thought of the stranger’s account, he felt a sharp sword hanging over his head, making him very uneasy.<br/><br/>Seeing that her husband didn’t say anything, Mrs. Liang’s eyes flickered, and she didn’t continue to ask. Instead, she asked with concern, “Husband, is there any discomfort in your body? Should I call the doctor?”<br/><br/>Liang Haohan shook his head and said, “Except for some pain in the wound, everything is fine.”<br/><br/>It was okay that the wound hurt, but he was worried about the sudden exposure of Liang Qiming and Liang Shanshan’s affair while he was in the hospital.<br/><br/>…<br/><br/>On the other hand, Xiao Jinli did not care about the current situation of Sister Shanshan and her brother.<br/><br/>When she said she would make them pay, she meant it. But first, she needed to let them stew for a while. Sometimes, waiting could be a kind of torture.<br/><br/>Right now, there was a happy event in the Xiao Family, which took priority over everything else.<br/><br/>It was the engagement ceremony of older brother Xiao Junxuan and Lin Xiaoxiao.\t\t\t\t\t\t</div>", "images": {}, "success": true}