{"id": 453, "url": "https://www.novelhall.com/the-lucky-star-blessing-the-whole-village-32483/15193545.html", "title": "Chapter 453 - Chapter 453: Chapter 436: _2", "volume": 5, "volume_title": "Volume 5", "body": "<h1>Chapter 453 - Chapter 453: Chapter 436: _2</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 453: Chapter 436: _2<br/><br/>“We all know that Doctor Xiao has been recognized as the granddaughter of the Jiang family. So, it’s very likely that the Jiang family has been secretly assisting Su Yichen out of consideration for their granddaughter.”<br/><br/>“You make sense.”<br/><br/>“Should we approach Su Yichen to say hello and confirm it?”<br/><br/>Many people’s eyes lit up at this proposal.<br/><br/>They were initially attracted by the reputation of Doctor Xiao. They didn’t want to risk annoying Doctor Xiao by introducing themselves to him directly, as it could lead to more losses than gains.<br/><br/>But if they had Su Yichen as a stepping stone, it would be different.<br/><br/>Though Su Yichen is the richest man in the country, he is also a leading figure in the business world. Isn’t it reasonable for them to greet him as fellow businessmen?<br/><br/>“Chairman Su?” Jiang Kun, the owner of Jiang Corporation, was the first to come over, looking at Su Yichen with slight confusion.<br/><br/>With a smile, Su Yichen answered,” Yes, it’s me, Chairman Jiang.”<br/><br/>Upon Su Yichen’s confirmation, Jiang Kun was visibly delighted. He said,”I noticed you from afar and thought I had mistaken you for someone else. Never expected it to be really you, Chairman Su. Seeing you brings me immense joy. Everyone was wondering where you had been, as you have not been seen in Capital City for some time.”<br/><br/>Su Yichen smiled, and politely replied,”Thank you for your concern, I’m doing well.”<br/><br/>Jiang Kun turned his gaze on Xiao Jinli and asked with a smile,”Chairman Su, is this your girlfriend? She is indeed beautiful.”<br/><br/>Xiao Jinli’s eyes flickered, not confirming nor denying.<br/><br/>Nonetheless, this pleased Su Yichen greatly and he introduced,”This is my childhood friend, the girl I am pursuing currently, her name is Xiao Jinli. Jinli, this is Chairman Jiang of Jiang Corporation in Capital City.”<br/><br/>Xiao Jinli didn’t mind Su Yichen’s introduction, she nodded at Jiang Kun and said,”Chairman Jiang, hello!”<br/><br/>This time, Jiang Kun wasn’t just happy, he was excited.<br/><br/>He happily replied,”Doctor Xiao, I’ve heard a lot about you.”<br/><br/>He intentionally revealed that he knew Xiao Jinli’s identity and was purposely trying to get close to her.<br/><br/>Xiao Jinli raised an eyebrow and said with a smile,”Chairman Jiang, you flatter me. My medical skills are nothing more than treating illnesses and saving lives, nothing worth mentioning.”<br/><br/>Xiao Jinli’s modesty made Jiang Kun burst into laughter.<br/><br/>“Ha ha…if Doctor Xiao’s skilled medical skills for saving lives and treating patients is not worth mentioning, then we are even less significant.” Jiang Kun laughed heartily.<br/><br/>Xiao Jinli chuckled and said,”I hope Chairman Jiang will not come looking for me. However, if there is anything you need me to do in the future, you are welcome to approach me.”<br/><br/>This was a promise to Jiang Kun.<br/><br/>Seeing he got what he wanted, Jiang Kun didn’t linger, he said a few words and left, giving room for others.<br/><br/>After Jiang Kun’s tentatively approached Xiao, other business tycoons followed suit. They all rushed over to greet Su Yichen and introduced themselves to Jinli.<br/><br/>With respect to these people, Xiao Jinli gave some of them a promise and declined some.<br/><br/>Those who didn’t get a promise from her felt disappointment, yet they didn’t dare to offend Xiao Jinli openly. They thought, in case they need something from Xiao Jinli one day, they could get in touch with her through Lin Chengdong.<br/><br/>Seeing so many people surrounding her, Xiao Jinli got a bit unhappy as she felt the limelight of the engagement couple was being stolen. Her face showed her displeasure.<br/><br/>Reading Xiao Jinli’s expressions, Su Yichen realized she was unhappy. He took the initiative to block the guests coming after her.<br/><br/>The protagonists of the day were the couple getting engaged. But the guests came to meet Xiao Jinli instead. What did that mean?<br/><br/>Maybe the couple didn’t mind, but to others, it seemed they were not paying enough attention to the bride-to-be. Otherwise, why would a younger sister steal the thunder from her sister-in-law.<br/><br/>The guests invited to this engagement banquet were all big shots in the business world, who are naturally smart.<br/><br/>Seeing Su Yichen stop others from talking to Xiao Jinli, it was evident that Doctor Xiao was not pleased.<br/><br/>Those who missed the opportunity and were late were regretful but were careful not to cause any irritation. So, everyone greeted Su Yichen and left politely.<br/><br/>There are many opportunities in the future, such as the wedding feast, baby’s full month feast, one-year-old banquet. But they all made a mental note not to miss their chance next time.\t\t\t\t\t\t</div>", "images": {}, "success": true}