{"id": 457, "url": "https://www.novelhall.com/the-lucky-star-blessing-the-whole-village-32483/15193549.html", "title": "Chapter 457 - Chapter 457: Chapter 439:", "volume": 5, "volume_title": "Volume 5", "body": "<h1>Chapter 457 - Chapter 457: Chapter 439:</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 457: Chapter 439:<br/><br/>After the engagement of Xiao Junxuan and Lin Xiaoxiao, many guests still had not left.<br/><br/>In the past, they had no idea where to find Doctor Xiao, but now that they knew Doctor Xiao was in Xiao Family Village, they wanted to find a way to build a relationship with him at any cost.<br/><br/>So that when they or their family members need emergency help, they can rely on this connection.<br/><br/>That’s what everyone was thinking.<br/><br/>At this moment, Xu Guochang went home to be with his wife and daughter for a while. Then he came back to Xiao’s house to talk to Xiao Jinli about some important matters.<br/><br/>Xiao Jinli knew Xu Guochang was coming and was already waiting for him at home with Su Yichen by her side.<br/><br/>When Xu Guochang arrived at Xiao Family Village, he saw Su Yichen looking tenderly at the girl beside him, and his expression was still somewhat surprised.<br/><br/>Previously, he had thought that Xiao Jinli was the daughter of the wealthiest person or from a prominent family, so that she would have such strength.<br/><br/>The mysterious identity always made Xu Guochang curious and in awe of his boss.<br/><br/>Lately, by accident, he discovered the identity of the mysterious boss, and his admiration for Xiao Jinli skyrocketed almost instantly.<br/><br/>Because Xiao Jinli didn’t borrow anyone else’s power, relying solely on her own abilities and skills, she created the Shenfeng Technology Group.<br/><br/>Now, suddenly hearing that Xiao Jinli was not the daughter of the richest man but still a good friend of his, he still couldn’t quite believe it.<br/><br/>Xiao Jinli saw Xu Guochang and called him over, “Uncle Xu, I’ve been waiting for a while, come sit.”<br/><br/>Xu Guochang walked over and sat down, jokingly saying, “Xiao Jinli, I always thought you were the daughter of the wealthiest person, but only now do I realize that you are actually his girlfriend.”<br/><br/>Then, he introduced himself to Su Yichen, “Hello, Chairman Su, I am Xu Guochang of the Shenfeng Technology Group. I have heard so much about your impressive accomplishments.”<br/><br/>“Hello, President Xu!” Su Yichen actively extended his hand, very friendly greeting, “I have heard so much about President Xu’s great reputation!”<br/><br/>If it weren’t for Su Yichen’s serious expression, Xu Guochang would have thought he was being sarcastic.<br/><br/>After all, Su Yichen’s fame as the wealthiest person in the country at such a young age was much greater than his own.<br/><br/>Xu Guochang humbly replied, “Not at all, I am not worth mentioning compared to Chairman Su.”<br/><br/>Xiao Jinli laughingly intervened, “Alright, you two, stop comparing, you’re both family.”<br/><br/>Afterwards, the two men sat down.<br/><br/>Xiao Jinli asked directly, “Uncle Xu, have you encountered any problems lately?” Referring to the troubles brought upon by Plum Firm Country.<br/><br/>Xu Guochang frowned slightly, looking somewhat puzzled, “Some time ago, I experienced some incidents, such as car accidents, thefts, and madmen. However, they have been avoided. Lately, everything has been peaceful.”<br/><br/>Xiao Jinli remarked lightly, “This calm seems like the calm before the storm, doesn’t it?”<br/><br/>Xu Guochang’s heart immediately tensed, “So, they want to make a big move?”<br/><br/>Xiao Jinli shook her head, “It’s hard to say. For a while, the Mei Jian Guo company you once worked for invited the Su Group to collaborate on a technology company. The Su Group agreed quite readily, but it’s unknown why it has been so long and there has been no movement.”<br/><br/>As soon as Xu Guochang heard this, he immediately asked suspiciously, “What do they want to do?”<br/><br/>Su Yichen analyzed, “As it stands now, Shenfeng Technology is growing rapidly and has mastered the most advanced technology in the world. Therefore, they want to cooperate with domestic companies to hinder the development of Shenfeng Group. They thought the Su Group would refuse, but the Su Group agreed quite readily, perhaps disrupting their plans.”<br/><br/>Xu Guochang quickly understood and said, “So, they might be brewing an even bigger conspiracy.”\t\t\t\t\t\t</div>", "images": {}, "success": true}