{"id": 450, "url": "https://www.novelhall.com/the-lucky-star-blessing-the-whole-village-32483/15193542.html", "title": "Chapter 450 - Chapter 450: Chapter 434:", "volume": 5, "volume_title": "Volume 5", "body": "<h1>Chapter 450 - Chapter 450: Chapter 434:</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 450: Chapter 434:<br/><br/>Who else could it be if not Su Yichen?<br/><br/>Liang Haohan fell deep into thought.<br/><br/>After a while, Liang Haohan still thought it was best to ask the person involved.<br/><br/>However, the hospital was not a suitable place for keeping secrets. Walls have ears.<br/><br/>But, Liang Haohan’s love for his son took precedence, so he called Liang Qiming to the hospital.<br/><br/>As for Liang Shanshan, he didn’t want to see her right now.<br/><br/>“Dad!” Liang Qiming called out respectfully as soon as he arrived at the hospital.<br/><br/>“Hmm.” Liang Haohan responded lightly.<br/><br/>Liang Qiming looked at his father’s attitude and his heart grew more uneasy.<br/><br/>“Dad, how is your recovery?”<br/><br/>“Hmm.”<br/><br/>“Son, did you make any progress with that Xiao Jinli when you went to Xiao Family Village?”<br/><br/>Liang Qiming’s face twisted a bit, and he shook his head, “That girl is not easy to get along with. She is very guarded against everyone. Moreover, with Su Yichen as an option, she completely ignores me.”<br/><br/>What he said was half true and half false.<br/><br/>“Su Yichen?” Liang Haohan asked doubtfully.<br/><br/>“Yes, Su Yichen is very fond of that girl.” At the moment, Liang Qiming could only blame his failure on Su Yichen.<br/><br/>Liang Haohan immediately asked, “So, your sister’s pursuit of Su Yichen must have failed too, right?”<br/><br/>Liang Qiming hesitated for a moment before nodding, “Yes.”<br/><br/>Liang Haohan’s face suddenly turned pale, and he angrily said, “So, the matter between you and your sister was also a scheme of Su Yichen? This brat is too much.”<br/><br/>Liang Qiming’s face changed dramatically, and he stammered in panic, “Dad… What matter between me and sister…?”<br/><br/>Liang Haohan took out his cellphone, opened the friend circle, found that account, and angrily said, “What matter? Look at this. You think I suddenly passed out from a stroke for no reason? It’s because of this message that I fainted!”<br/><br/>Liang Haohan saw that video and his face turned “pale” in an instant. He checked the message’s send time, which was the day he was with Liang Shanshan…<br/><br/>So, from beginning to end, someone – no, Xiao Jinli – was monitoring his every move.<br/><br/>His father had fainted from seeing this video.<br/><br/>Liang Haohan looked at his son’s pale face and felt a chill in his heart, a sense of foreboding.<br/><br/>He glanced around, suppressing his anger, lowered his head and asked in a whisper, “Son, tell the truth to dad. Is this video real? Did you really sleep with your sister?”<br/><br/>Liang Qiming suddenly felt his blood flowing backwards, his body weak, and his mind blank, with a buzzing sound in his ears.<br/><br/>Looking at his son’s stunned expression, silence was louder than words. What could Liang Haohan not understand?<br/><br/>In an instant, he felt the blood in his heart gushing out.<br/><br/>He clutched the position of his heart, his postoperative head aching slightly, as if he would faint in the next second.<br/><br/>Bang!<br/><br/>The sound of Liang Haohan’s fall startled Liang Qiming awake.<br/><br/>Liang Qiming’s face changed drastically, and he helped the man up in panic and concern, shouting, “Dad, Dad, what’s wrong with you?”<br/><br/>Then he shouted loudly, “Doctor, doctor, nurse, nurse! There’s a patient here who has fainted!”<br/><br/>Thus, Liang Haohan was pushed back into the emergency room by the doctors and nurses.<br/><br/>Outside, Liang Qiming slumped down in the corridor, feeling completely drained.<br/><br/>He never expected that Liang Haohan would find out about his and his sister’s information right away. No wonder his father fainted in anger.<br/><br/>A resentful hatred appeared in Liang Qiming’s eyes, and he gritted his teeth and whispered, “Xiao Jinli, you’re ruthless!”<br/><br/>No wonder, at such a young age, she became the chairwoman of the Lu Xian Group. Look at her methods, can ordinary people be compared to her?<br/><br/>No wonder they couldn’t find out any information about Xiao Jinli in Xiao Family Village. She must have won everyone’s admiration and trust to keep their information secret.<br/><br/>Is this something an ordinary person can do?<br/><br/>Liang Qiming now regretted and resented getting involved with Xiao Jinli.<br/><br/>Blame it on himself for being blinded by his own greed.<br/><br/>He never thought that if the chairwoman of the Lu Xian Group were so easy to conquer, the group or even the entire Xiao Family Village might have been taken over by others. Why would it be his turn?<br/><br/>As for Su Yichen, he was not convinced in his heart and naturally wanted to compete.<br/><br/>Since learning that Su Yichen was pursuing Xiao Jinli, the village girl from Xiao Family Village, his heart had been itching.<br/><br/>In the business world, he couldn’t compare to Su Yichen, but if he could surpass Su Yichen in the love field, he could slap Su Yichen’s face hard.<br/><br/>Perhaps he was too confident in himself.<br/><br/>He didn’t even think that a girl who could make Su Yichen fall for her would be as vulgar as ordinary girls?<br/><br/>Liang Qiming sat down in the corridor, deeply regretting. Mrs. Liang hurried over when she heard her husband had fainted again.<br/><br/>Seeing her son’s appearance, she thought her husband’s condition was very bad, and the whole person suddenly had a bad feeling.<br/><br/>Her voice trembling, she asked, “Son, how is your father…how is he?”<br/><br/>Liang Qiming shook his head, “I don’t know. The doctor is still trying to save him, hasn’t come out yet.”<br/><br/>Mrs. Liang asked in confusion, “What on earth is going on? Your father was recovering quite well, why did he faint again?”<br/><br/>Liang Qiming opened his mouth, then closed it again.<br/><br/>…<br/><br/>On the other hand, Xiao Family Village was bustling due to the engagement banquet of Xiao Junxuan and Lin Xiaoxiao.<br/><br/>In order to join the excitement, the Xiao Village Farmhouse did not close and was still open.<br/><br/>However, the third-floor banquet hall of the Xiao Family Village Hotel was prepared by the Xiao Family for entertaining guests.<br/><br/>The banquet hall was very large, covering thousands of square feet, and could accommodate hundreds of guests. So, no matter how many guests the Lin Family invited, they could handle it.<br/><br/>The guests of the Lin Family, besides the close friends and relatives of Lin Chengdong, were the celebrities in the Capital Circle and the important partners of the Lin Corporation.<br/><br/>Therefore, on that day, these guests would put aside all other matters and make a special trip here.<br/><br/>This was an opportunity and a chance.<br/><br/>No matter how much money one has, there are times when it can’t save lives.<br/><br/>Knowing a divine doctor who can revive the dead is more cost-effective than signing a deal worth tens of billions.<br/><br/>It was said that a wealthy man, in order to treat his illness, hired medical experts at a high price to serve him. He spent tens of billions each year, or even more.<br/><br/>However, no matter how much money was invested, the results were minimal. When he got cancer, he still had to endure all kinds of pain and didn’t live much longer.<br/><br/>So basically, all the guests Lin Chengdong invited had arrived.<br/><br/>On the Xiao Family’s side, there’s even more to say.<br/><br/>No matter where people were, from all over the world, they would rush back on this day.\t\t\t\t\t\t</div>", "images": {}, "success": true}