{"id": 454, "url": "https://www.novelhall.com/the-lucky-star-blessing-the-whole-village-32483/15193546.html", "title": "Chapter 454 - Chapter 454: Chapter 436: _3", "volume": 5, "volume_title": "Volume 5", "body": "<h1>Chapter 454 - Chapter 454: Chapter 436: _3</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 454: Chapter 436: _3<br/><br/>At the engagement banquet, Xiao Junxuan and Lin Xiaoxiao exchanged rings, and the excitement reached its peak.<br/><br/>Lin Chengdong, standing on the stage, looked at his daughter, about to be married, feeling both happy and a bit sad.<br/><br/>He was happy because his daughter had found a good husband and entered a good in-law’s family.<br/><br/>The sorrow was that it would be hard for him to see her from now on.<br/><br/>Before his daughter got married, they would argue, but they would see each other almost every day. When they didn’t see each other, he was on a business trip.<br/><br/>Now that she’s married, he can’t even argue if he wants to.<br/><br/>In the future, he’d just be an old man living alone in that big house.<br/><br/>Although he could move to Xiao Family Village, he still had to go to work and manage the company before a successor appeared for the big group.<br/><br/>His few nephews all wanted to be his heirs, and for this, they didn’t hesitate to harm his own daughter.<br/><br/>It was with their help that Lin Wanqing could so easily kidnap Lin Xiaoxiao.<br/><br/>However, the happiest ones were his nephews, especially since they thought Lin Xiaoxiao was marrying a man from the countryside who had no ability to manage such a large company. So, the heir must be chosen from among them.<br/><br/>After knowing their thoughts, Lin Chengdong snorted in his heart, but didn’t show it on his face.<br/><br/>Humph, even if he donated all his property, he would never give it to them.<br/><br/>These people were just like ungrateful wolves, enjoying the home and food he provided, but still complaining about him. He wasn’t a soft steamed bun to be manipulated by them.<br/><br/>He already had plans for the company in his heart. If Xiao Junxuan was willing to manage the company, he would give it to him to manage. If not, he would hire a few senior professional managers to manage it, and his daughter would just wait to receive the company’s dividends.<br/><br/>Now, his biggest wish was for his daughter to be safe and worry-free for the rest of her life.<br/><br/>The two people on stage had no idea that their father (father-in-law) had so many thoughts in such a short time, and even thought of letting Xiao Junxuan inherit the company.<br/><br/>When they went down to toast Lin Chengdong, they saw his eyes were red, but his gaze was fixed on Xiao Junxuan with a burning intensity that made Xiao Junxuan feel his hairs stand on end for a moment.<br/><br/>“Dad!” Xiao Junxuan called out respectfully.<br/><br/>“Ah!” Lin Chengdong responded happily, and then, with tears in his eyes, said solemnly, “Xiao Junxuan, I have only this biological daughter. I entrust her to you from now on. I hope you can treat her well, love her, protect her, and never let her suffer any grievances. If I find out that you’ve let her suffer, even if it’s thousands of miles away, I’ll come over immediately and take her back home!”<br/><br/>As he spoke, his voice choked, “In the past, it was my fault for not knowing people well enough, and Xiaoxiao suffered for ten to twenty years. But from now on, I won’t let her suffer anymore, and I won’t let anyone else do so.”<br/><br/>Xiao Junxuan’s face was serious, “Father-in-law, these are also the words that your son-in-law wants to say. Xiaoxiao has suffered too many grievances before, and because of these grievances, she has suffered a lot. In the future, I will never let her suffer any grievances and will never allow anyone to make her suffer, including myself!”<br/><br/>Xiao’s mother promised gently, “Don’t worry! Since my son has chosen Xiaoxiao, he will definitely protect her and won’t let her suffer a bit. Our whole family will treat Xiaoxiao like our own daughter. You don’t have to worry about any conflicts between me and her! Xiao Family Law: Married men must listen to their wives, love their wives unconditionally, and if there is a mother-in-law-daughter-in-law issue, it’s his responsibility, and he must be punished by kneeling in the ancestral hall!”<br/><br/>The guests were surprised to hear the last sentence! They didn’t expect that the Xiao family had such a punishment.<br/><br/>So, if the mother-in-law and daughter-in-law problems were not resolved, it was the man’s problem!<br/><br/>It’s quite impressive and good!<br/><br/>Xiao’s father also said seriously, “Xiaoxiao is a great child, and we all love her. She’s even become good sisters with my daughter, Jinli! With my daughter protecting her, no one can bully Xiaoxiao, even her own husband!”<br/><br/>He deliberately mentioned Xiao Jinli to give a promise!<br/><br/>After listening, Lin Chengdong wiped away his tears and said with satisfaction, “Good, good, from now on, I’ll entrust Xiaoxiao to you, Junxuan. As long as you treat her well and you both can be happy, I’ll be satisfied!”<br/><br/>Lin Xiaoxiao grabbed her father’s hand, with tears in her eyes, and said, “Dad, I’ll be very happy in the future, you can rest assured!”\t\t\t\t\t\t</div>", "images": {}, "success": true}