{"id": 455, "url": "https://www.novelhall.com/the-lucky-star-blessing-the-whole-village-32483/15193547.html", "title": "Chapter 455 - Chapter 455: Chapter 437:", "volume": 5, "volume_title": "Volume 5", "body": "<h1>Chapter 455 - Chapter 455: Chapter 437:</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 455: Chapter 437:<br/><br/>Xiao Junxuan and Lin Xiaoxiao’s engagement party was bustling with excitement.<br/><br/>The guests who came to the banquet got to meet the legendary Doctor Xiao.<br/><br/>Doctor Xiao may be young, but she is to not be underestimated.<br/><br/>Most of the guests decided, after not having a chance to chat with her, that they wouldn’t miss another opportunity.<br/><br/>But the biggest surprise of all was Su Yichen!<br/><br/>Nobody expected that Su Yichen and Xiao Jinli were childhood sweethearts!<br/><br/>They knew each other from a young age, so no wonder there are rumors in Capital City about Doctor Xiao having a good relationship with the richest man, Su Yichen!<br/><br/>So that’s the reason!<br/><br/>But, wasn’t Su Yichen raised in Capital City? How did he get to know Doctor Xiao, who was raised in the Countryside?<br/><br/>However, these people didn’t just come to the Xiao Family Village for no reason!<br/><br/>They heard that Su Yichen was saved from a mountain by Xiao Jinli about eight or nine years ago.<br/><br/>At that time, Su Yichen was severely injured and stayed in the hospital for more than half a month before being discharged.<br/><br/>However, Su Yichen had lost his memory temporarily and couldn’t find his family. So the Xiao family, Doctor Xiao’s family, took him in, and he named himself Xiao Si Quan, meaning that kindness should be repaid like a spring.<br/><br/>Su Yichen, without his memory, lived in Xiao Family Village for over half a year until his grandfather came to find him which put an end to his connection with the Xiao family.<br/><br/>So, this encounter became the focus point of everyone’s discussion.<br/><br/>“Oh, I remember now. Eight years ago, Su Yichen was found by the Xia family, and after that, he worked in the Xia Group and was directly appointed as the deputy general manager. Later, when Su Xiangdong found out about this, he went to him directly and asked him to come home. At that time, he refused to return to the family using his memory loss as an excuse.”<br/><br/>Su Yichen was a naïve young man at that time and his name in the business world was not particularly prominent.<br/><br/>But the affairs of the Su family were the talk of the Capital City at that time.<br/><br/>Why? Mainly because Su Xiangdong and his wife were too ungrateful. They clung to their younger son Su Yichen, asking him to hand over his biological mother’s inheritance, and voluntarily transfer the agreement.<br/><br/>“I remember that too. That jerk Su Xiangdong was just too greedy. In order to get their younger son willingly to give up his mother’s inheritance, that family put on a show for more than ten years, only to stop playing nice just two days before Su Yichen turned eighteen. Su Xiangdong, his own father, even hired someone to kidnap his son. Luckily, Su Yichen was lucky enough to escape and was saved by someone.”<br/><br/>“Indeed, fortune in misfortune, and misfortune lies concealed within fortune! That disaster actually led Su Yichen to meet Doctor Xiao!”<br/><br/>“Isn’t that the truth! Doctor Xiao was adopted as a goddaughter by Jiang La and helped him behind the scenes so much after realizing their relationship! Otherwise, a young man like Su Yichen would have probably been pulled down from his position as the richest man long ago!”<br/><br/>“Exactly! Many of Su Yichen’s connections were actually facilitated by the Jiang family and a few other old men!”<br/><br/>“Su Yichen is so lucky!”<br/><br/>“That’s true. No wonder he didn’t like any of the rich and noble ladies in Capital City. He’s had his eye on someone else! So he actually likes Doctor Xiao.”<br/><br/>“Doctor Xiao is astonishingly beautiful and has superior medical skills. Moreover, she has such a powerful background and resources. Anybody would know how to make a choice.”<br/><br/>“That’s a fact. look at those so-called rich and noble ladies in Capital City. None of them can hold a candle to Doctor Xiao. Even Liang Shanshan, the daughter of Liang Haohan who is known as the number one beauty in Capital City, is nothing but a shoeshiner by comparison. Speaking of which, why didn’t anybody from the Liang family come this time?”<br/><br/>“Yes, where is the Liang family? Did Lin Chengdong forget to invite Liang Haohan?”<br/><br/>“Impossible. Who in the entirety of Capital City would forget about the Liang family?”<br/><br/>“Then why didn’t anybody from the Liang family come this time?”<br/><br/>“I heard that Liang Haohan was ill and in the hospital, so he probably couldn’t make it.”<br/><br/>“Ha ha, even if he’s ill and in the hospital, couldn’t he send his son? This is such a good opportunity to expand one’s connections. Surely Liang Haohan knows this? Given how much he dotes on his son, he would certainly want to have everything arranged for him, so he should have at least sent his son, right?”<br/><br/>“That makes sense.”<br/><br/>A well-informed big shot chimed in, laughing, “I do know some news, but I’m not sure how accurate it is.”<br/><br/>“What news? Do tell.”<br/><br/>“It’s just that Mr. Lin actually sent an invitation to Liang Haohan. But for some reason, Mr. Lin took back the invitation after sending it out.”<br/><br/>Everyone, “…”<br/><br/>What is this bizarre operation, why would Lin Chengdong retract the invitation? Isn’t he afraid of offending Liang Haohan and the Liang family?<br/><br/>Everyone in the circle knows that Liang Haohan is the type who holds grudges.<br/><br/>To offend him so blatantly, isn’t he afraid of retaliation?<br/><br/>So someone asked in disbelief, “Is that likely? Would Mr. Lin do such a low thing?”<br/><br/>“Exactly, even if he doesn’t like the Liang Family, the invitation has already been sent out. If the Liang family wants to come, let them come. If they don’t want to, then let it be. Why bother asking for the invitation back?”<br/><br/>“If this is true, then hasn’t the whole Liang family, including Liang Haohan, become a joke in Capital City?”<br/><br/>“Hehe, let them be a joke. Hasn’t Liang Haohan made a fool of others countless times? It’s just his turn this time.”<br/><br/>“My, who would have thought that Mr. Lin’s own daughter Lin Xiaoxiao, with such a terrible reputation in Capital City, could end up marrying Doctor Xiao’s own brother. Just look at Doctor Xiao’s family, the men are handsome, the women are beautiful, and especially her mother-in-law, who is as beautiful as a fairy, enough to cause the downfall of nations. If she were in a normal family, there would surely be countless nobles fighting over her.”<br/><br/>“Beauty often brings disaster. How many beauties have caused wars in the past? Mrs. Xiao’s beauty is on par with the Four Great Beauties of ancient times. If she were to marry a normal man, it’s certain that it would bring disaster to the whole family.”<br/><br/>“With such a stunning mother-in-law and sister-in-law, I wonder if Xiaoxiao would feel pressured?”<br/><br/>“What pressure? Didn’t you see how happy and blessed the child looked? I heard that she has Doctor Xiao’s affection.”<br/><br/>“Lin Chengdong is so happy now that he almost floats while walking. If my own daughter were to marry this well, I’m afraid I would be even more proud.”<br/><br/>“Lin Chengdong really has been hit with good luck.”<br/><br/>There’s no telling how many people are jealous and envious of Lin Chengdong now.<br/><br/>He previously misunderstood people and because of his adopted daughter he almost ruined his own daughter. But his daughter turned a misfortune into a blessing and met Doctor Xiao’s younger brother, Xiao Junxuan.<br/><br/>“Oh, it’s been so comfortable living in Xiao Family Village these past few days. Before, my old problems would act up, but they haven’t here.”<br/><br/>“Living in Xiao Family Village is really comfortable. The air is great, there’s delicious food. No wonder Li Minxing and others are looking more and more youthful every day.”<br/><br/>“I’m planning to apply to stay in Xiao Family Village, I wonder if I can get through?”<br/><br/>“I applied before and didn’t get through. I’m planning to apply again now.”\t\t\t\t\t\t</div>", "images": {}, "success": true}