{"id": 458, "url": "https://www.novelhall.com/the-lucky-star-blessing-the-whole-village-32483/15193550.html", "title": "Chapter 458 - Chapter 458: Chapter 440:", "volume": 5, "volume_title": "Volume 5", "body": "<h1>Chapter 458 - Chapter 458: Chapter 440:</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 458: Chapter 440:<br/><br/>Xiao Jinli said, “Plum Firm Country will definitely use various means to hinder the development of Longzhou Nation, especially in the field of technology.<br/><br/>Divine Wind Technology is at the forefront of global technology. To stop Longzhou Nation is to stop Divine Wind Technology.<br/><br/>Since they couldn’t get rid of you with various means, they must have a bigger conspiracy targeting not only you, but also the Shenfeng Group.”<br/><br/>Xu Guochang furrowed his brow, lost in thought.<br/><br/>Xiao Jinli continued, “No outsider knows that I am the hidden boss of Shenfeng Group, nor that those technologies actually come from me. Next, they are bound to find opportunities to bribe and sow discord among technical personnel, and even bring down you, the apparent boss.<br/><br/>Previously, you also mentioned that they would accuse you of stealing technology based on your work at a Plum Firm Country technology company, and take you to an international court. But they haven’t taken action yet, perhaps it has something to do with finding a partner company in Longzhou Nation.<br/><br/>This technology company must be targeting Divine Wind Technology at every turn. No, perhaps they’re waiting for the company to be established before they start dealing with you.”<br/><br/>Su Yichen nodded, “That’s very likely. Once their technology partnership is established and conditions are basically ripe, they will start to deal with you, and many resources will tilt towards them. With the big boss of Shenfeng Group in trouble and technical personnel betraying and switching sides, their company will have a good chance of swallowing up Shenfeng Group.<br/><br/>With Shenfeng Group in trouble, it will greatly hinder the technological progress of the country. But they are not purely a Plum Firm Country technology company, but a joint venture company cooperating with Longzhou Nation. It is difficult for the country to intervene in the competition between companies.”<br/><br/>Xu Guochang’s expression became serious.<br/><br/>Xiao Jinli said solemnly, “So now it’s just the calm before the storm. Uncle Xu, be prepared in your heart. Actually, we don’t have to worry. We are prepared ourselves. If they don’t make a move, it’s fine, but once they do, the more hands they stretch out, the more we’ll cut them off, making it impossible for them to return.”<br/><br/>After listening, Xu Guochang’s heart eased.<br/><br/>In his heart, although Xiao Jinli was young, she seemed to be omnipotent.<br/><br/>Xiao Jinli was not only the faith of the people of Xiao Family Village but also the faith of Xu Guochang himself.<br/><br/>Xiao Jinli smiled and said, “To lure them onto the hook, I have decided to invest in a new technology, the appearance of this technology will surely make them restless.”<br/><br/>Xu Guochang was stunned, “What kind of technology?”<br/><br/>Xiao Jinli smiled.<br/><br/>…<br/><br/>Ever since Liang Qiming told Liang Haohan the truth, he had been uneasy.<br/><br/>As for Xiao Jinli’s plan to deal with Liang Group, he did not inform his father. Firstly, he didn’t want to worsen his father’s illness; secondly, he didn’t know how Xiao Jinli planned to retaliate against Liang Group.<br/><br/>However, after some time passed, there was no sign of Xiao Jinli’s actions. No, it’s more accurate to say that everything was running smoothly for Liang Group, without any abnormalities.<br/><br/>This eased his heart, thinking that Xiao Jinli was just talking, otherwise, it had already been a month and there was no action.<br/><br/>Liang Shanshan still felt a little uneasy, “Is Xiao Jinli just talking? Or does she want to wait for later to take revenge?”<br/><br/>“What revenge?” Liang Haohan walked out of the room with a puzzled look on his face. “Who wants to take revenge?”<br/><br/>Liang Shanshan’s face changed color, “Nothing, Dad.”<br/><br/>Liang Haohan sternly said, “I want the truth!”<br/><br/>Liang Shanshan bit her lip, and had no choice but to tell the truth.\t\t\t\t\t\t</div>", "images": {}, "success": true}