{"id": 451, "url": "https://www.novelhall.com/the-lucky-star-blessing-the-whole-village-32483/15193543.html", "title": "Chapter 451 - Chapter 451: Chapter 435:", "volume": 5, "volume_title": "Volume 5", "body": "<h1>Chapter 451 - Chapter 451: Chapter 435:</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 451: Chapter 435:<br/><br/>Xiao Junxuan and Lin Xiaoxiao’s engagement banquet was very lively, with the entire Xiao Family Village adorned with lights and decorations. When entering the village, each tourist received candy, and even the entrance tickets were half-price.<br/><br/>Relatives from both sides came from all over the country.<br/><br/>Lin family’s relatives and friends mostly came from the Capital City. Lin Chengdong even chartered two airplanes to shuttle guests.<br/><br/>After arriving in Ganjiang City, the Xiao family arranged for cars to pick up the guests.<br/><br/>A row of luxury cars waited at the airport entrance, attracting the attention of passers-by in all directions.<br/><br/>After picking up the guests, they were sent directly to the Xiao Family Village Hotel for rest.<br/><br/>Usually, it was difficult to book a room in the Xiao Family Village Hotel even for the wealthy, but today, people truly got a taste of luxury.<br/><br/>To accommodate guests from all sides, the Xiao Family Village Hotel reserved five hundred luxurious rooms.<br/><br/>These five hundred rooms had stopped taking reservations a month in advance.<br/><br/>“No wonder Xiao Family Village is known as the most sought-after paradise village in the country and the world. Even the air here is fresher than elsewhere.”<br/><br/>“Isn’t that the truth? I’ve been traveling by plane and car all day, and my head is a little foggy and swollen. But as soon as I set foot in Xiao Family Village, I feel so much better, and my head clears up.”<br/><br/>“The air here is really good. No wonder the country wants to build a retirement home for old cadres here. It is an excellent place for recuperation.”<br/><br/>“That’s true. Otherwise, why would so many powerful people rack their brains to live in Xiao Family Village? It’s just a pity that there’s not enough space in the village. To live here, the requirements are quite strict. There are only a few families in the Capital City that can live here. Haven’t you seen how Li Minxing and Zhu Hongguang have become more radiant and younger since living in Xiao Family Village?”<br/><br/>“In the future, Lin family is likely to settle down here, too.”<br/><br/>“I don’t know if Lin family will settle here, but Lin Chengdong will definitely be spending more time in Xiao Family Village. After all, his biological daughter is marrying into Xiao Family Village, and she’s marrying Doctor Xiao’s brother.”<br/><br/>“By the way, I wonder if we can meet Doctor Xiao at this engagement banquet.”<br/><br/>“It’s hard to say. So many guests have come to this engagement banquet, and you can imagine how many are here just for Doctor Xiao. Even if he wanted to meet everyone, it would be impossible.”<br/><br/>“I heard that Su Yichen will also attend this engagement banquet.”<br/><br/>“Su Yichen? He hasn’t been seen in the Capital City for a long time. Some time ago, someone spotted a man who looked very much like Su Yichen romantically confessing to a girl from Xiao Family Village. No one knows what kind of girl has captivated the young talent that all the socialite daughters in the Capital City want to marry.”<br/><br/>“I heard that it was someone who looks like Su Yichen, but it’s not him.”<br/><br/>“Pfft! You say they look very similar, but can you think of anyone else who looks so much like him other than a twin brother, and Su Yichen has no siblings.”<br/><br/>“So, you mean that the person is Su Yichen.”<br/><br/>“It’s obviously him.”<br/><br/>“Ah, it really is Su Yichen.”<br/><br/>“If it is indeed Su Yichen, is it possible that the girl he confessed to was Doctor Xiao?”<br/><br/>“… It’s possible. He wouldn’t be interested in ordinary girls!”<br/><br/>“There have been rumors in the Capital City that Su Yichen and Doctor Xiao are very close.”<br/><br/>…<br/><br/>After the guests arrived, they didn’t stay idle. After resting at the hotel for a while, they went on to tour the estate, especially the cafeteria, which is world-famous and now their first stop.<br/><br/>Everyone was from the business world and knew each other.<br/><br/>Even those who had faced off against each other in the business world let go of their grudges at this moment, not causing any trouble for the hosts, and got along amicably, treating each other as strangers at most.<br/><br/>When a group of business tycoons appeared in the cafeteria, many ordinary tourists were shocked.<br/><br/>These tycoons were people they had only seen in the news or newspapers, but now they were in the cafeteria.<br/><br/>“That’s President Chen of the Liying Group.”<br/><br/>“That’s Boss Jiang Kun of the Jiang Corporation.”<br/><br/>“That one looks like Chen Yuanyuan of the Yu Jing Development Group.” The Yu Jing Development Group is a leading domestic real estate company.<br/><br/>…<br/><br/>“Ah, look, that seems to be Xu Guochang of the Divine Wind Technology Group, I didn’t expect him to come too.”<br/><br/>What everyone didn’t know was that Xu Guochang came voluntarily.<br/><br/>Lin Chengdong doesn’t have a deep relationship with Xu Guochang, and their industries don’t overlap much, so Lin Chengdong naturally didn’t think of inviting him.<br/><br/>As a business tycoon, Xu Guochang had heard of Lin Chengdong’s marriage to the Xiao family, and after confirming with Xiao Jinli, he asked Lin Chengdong for an invitation card and became a guest of Lin Xiaoxiao’s maiden family.<br/><br/>In fact, Xu Guochang could have come as a guest from the groom’s side. After all, the Shenfeng Group and the Lu Xian Group are officially cooperating.<br/><br/>Moreover, Xu Guochang’s family now lives in Xiao Family Village, naturally becoming part of the Xiao Family Village community.<br/><br/>Therefore, it’s perfectly acceptable for him to be a guest from the groom’s side.<br/><br/>However, he chose to come as a guest from the bride’s family, just to establish a good relationship with the Lin family.<br/><br/>He knew very well that a sister-in-law who could gain Xiao Jinli’s approval was really hard to come by.<br/><br/>The group of big shots entered the Xiao Family Village cafeteria to eat gourmet food and caused a huge sensation. Many tourists saw these important figures and were extremely excited. They took out their cameras and cell phones, started taking pictures and recording videos, and even some eagerly wanted to ask for autographs.<br/><br/>Fortunately, there were many people in the cafeteria, but the security was very good. There were no stampede accidents. Even if the tourists were excited and agitated, they couldn’t get close to these people.<br/><br/>Of course, this was also for the safety of these important people.<br/><br/>When these people came to Xiao Family Village, they basically didn’t bring any bodyguards, so their safety was fully taken care of by Xiao Family Village. Lin Chengdong also wanted to hire more bodyguards, just in case.<br/><br/>But Xiao Jinli said that as long as they entered Qing County, she could guarantee their safety.<br/><br/>Lin Chengdong didn’t know why he should trust Xiao Jinli, but he just did.<br/><br/>Maybe it was because of Doctor Xiao.<br/><br/>After all, even criminals wouldn’t want to offend a divine doctor like him.<br/><br/>Xiao Family Village is known as the safest tourist destination in the world.<br/><br/>There have never been any cases of abduction, theft, robbery, and so on here. Everyone who comes here will be guaranteed safety, as long as they are not criminals.<br/><br/>If they are criminals trying to escape capture, thinking they won’t be caught if they come here, they’re clearly miscalculating.<br/><br/>As soon as these criminals set foot in Xiao Family Village, the government officials and relevant departments came to arrest them.<br/><br/>The village seemed to have a heavenly eye, able to see every corner and notice every person.<br/><br/>Nobody knew what was going on, not even the native villagers.<br/><br/>But they all laughed and said, “It’s because our village has a lucky star to protect us.” As for who the lucky star is, no one has revealed it.\t\t\t\t\t\t</div>", "images": {}, "success": true}