{"id": 452, "url": "https://www.novelhall.com/the-lucky-star-blessing-the-whole-village-32483/15193544.html", "title": "Chapter 452 - Chapter 452: Chapter 436:", "volume": 5, "volume_title": "Volume 5", "body": "<h1>Chapter 452 - Chapter 452: Chapter 436:</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 452: Chapter 436:<br/><br/>The second day, the engagement banquet officially began.<br/><br/>Xiao Junxuan wore a tailor-made black suit, and Lin Xiaoxiao, whose legs had already healed, donned a red fishtail dress. The handsome groom and beautiful bride were a perfect match.<br/><br/>The Xiao family also dressed up formally today.<br/><br/>Xiao’s mother wore a purple cheongsam, she didn’t need makeup, her natural beauty, tall figure, gracefully standing there, she was a proper stunning beauty, nationally stunning, instantly attracting everyone’s attention.<br/><br/>Xiao’s father also wore a bespoke suit. He was tall and handsome, with sharp eyebrows and eyes. At the age of over fifty, he only looked like he was in his thirties, and standing next to his son Xiao Junxuan, he could even be mistaken for a brother. He was a fitting match for Xiao’s mother.<br/><br/>The elderly members of the Xiao family donned custom-made Tang suits. Each suit was a different color, but all of them looked energetic and radiant.<br/><br/>Xiao Jinli usually dressed casually, wearing T-shirts and jeans in whatever way felt comfortable.<br/><br/>But today was a special day, so she dressed a little more formally.<br/><br/>Not to overshadow the bride-to-be, Xiao Jinli wore a light blue dress, tied her hair in a high ponytail, and wore five-centimeter-tall light blue crystal sandals, looking like a lovely youthful girl.<br/><br/>Su Yichen attended as a male guest, with his appearance restored and dressed formally. Tall and handsome, he and Xiao Jinli made an extraordinary couple.<br/><br/>If it weren’t for their outfits, many people would have mistaken them as the couple to be engaged.<br/><br/>Seeing Xiao Jinli and Su Yichen together, all the big shots were extremely excited.<br/><br/>“The person wearing the blue dress must be Doctor Xiao, right?”<br/><br/>“It should be. Look at her standing next to the groom’s parents, so proper.”<br/><br/>“The groom’s parents are really good-looking.”<br/><br/>“That’s for sure. I heard that the groom’s mother is the top beauty of Xiao Family Village, and her biological daughter, who is also Doctor Xiao, is the second.”<br/><br/>Many people came to the Xiao Family Village just to witness the stunning beauty of these two women.<br/><br/>It was said that their photos and videos would automatically disappear from cellphones, and cameras once they left the village. Even if uploaded to the internet, they would be gone before the upload was completed, leaving only a blank space.<br/><br/>As a result, people outside knew there were two nationally stunning beauties in Xiao Family Village, but none had ever seen their true faces.”<br/><br/>Lin Chengdong’s son-in-law looks like his father, very handsome, no wonder he attracted Lin Xiaoxiao’s attention. You know, even Su Yichen didn’t attract her, but Xiao family’s son did.”<br/><br/>“Shush, don’t say that. After all, Lin Xiaoxiao is getting engaged to him, and they’ll be an official couple soon. Saying that might be inappropriate. Don’t let the master’s house hear it, they would feel uncomfortable.”<br/><br/>“Right, right, you’re right.”<br/><br/>“I never thought that Doctor Xiao would be so young and so beautiful.”<br/><br/>“Exactly, who would have thought that the young Doctor Xiao would have such exquisite medical skills? Eight years ago, she displayed her talents, saving Grandpa Jiang, Old Yuan, and Elder Zeng, especially Elder Zeng, who was diagnosed with late-stage cancer, but she healed him in just two months without surgery or chemotherapy.”<br/><br/>“How old was Doctor Xiao eight years ago, um, I heard she was just over ten. What could an average child do at that age? Many kids were still acting spoiled in front of their parents, while Xiao was already a divine doctor with superb medical skills.”<br/><br/>“Old Lin Chengdong must be feeling very smug now that his daughter is marrying Doctor Xiao’s own brother.”<br/><br/>“Definitely, sometimes I can’t help but feel an itch to slap him.”<br/><br/>“Hey, isn’t that young man next to Doctor Xiao Su Yichen?”<br/><br/>“It does look like Su Yichen. But a while ago, someone online claimed to have seen someone like Su Yichen romantically proposing to a girl.<br/><br/>The tourists who were on the scene at first thought it was Su Yichen, so they excitedly approached him, asking him to marry them and sign autographs. But the man denied that his name was Su Yichen, claiming that he was from Xiao Family Village.”<br/><br/>“Impossible. He looks exactly like Su Yichen. There cannot be two identical people at this time, except for twins. I heard a rumor that Doctor Xiao had dealings with Su Yichen in the Capital City.<br/><br/>In these years, Su Yichen’s development has been so rapid that he became the richest man in the country in just a few years. That couldn’t have happened without the help of the Jiang Family.”\t\t\t\t\t\t</div>", "images": {}, "success": true}