{"id": 456, "url": "https://www.novelhall.com/the-lucky-star-blessing-the-whole-village-32483/15193548.html", "title": "Chapter 456 - Chapter 456: Chapter 438:", "volume": 5, "volume_title": "Volume 5", "body": "<h1>Chapter 456 - Chapter 456: Chapter 438:</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 456: Chapter 438:<br/><br/>It’s like robbing the henhouse and losing the rice.<br/><br/>This was Liang Haohan’s feeling after being pushed out of the rescue room for the second time.<br/><br/>He never expected that Su Yichen could be so vicious.<br/><br/>Yes, he was sure that Su Yichen had planned all this.<br/><br/>Because only Su Yichen would have the guts to do so. Who else besides him would have plotted against his son and daughter for no reason?<br/><br/>His daughter stayed at Li Minxing’s house, and his son lived with Zhu Hongguang. Su Yichen was a young man but an old fox in the business world. How could he not know about them?<br/><br/>Seeing his father pushed out of the rescue room for the second time, Liang Qiming was filled with guilt.<br/><br/>“I’m sorry, Dad, I’ve let you down.”<br/><br/>Even though Liang Haohan was rescued again, he still couldn’t let it go.<br/><br/>He asked, “Son, tell me the truth. What happened? I believe that with your intelligence, it’s impossible for you to be easily set up. Was it Su Yichen who framed you? Su Yichen, that brat, went too far. Is he really bullying our Liang family because we have no one left?”<br/><br/>Liang Qiming shook his head and said, “Dad, it wasn’t him!”<br/><br/>“If it’s not him, then who?” Liang Haohan asked doubtfully, “Who else in Capital City could have thought of such a vicious plan?”<br/><br/>“It was Xiao Jinli!” Liang Qiming said.<br/><br/>“Xiao… Xiao Jinli, who is that?” Liang Haohan didn’t react immediately.<br/><br/>“…” Liang Qiming said, “The one I wanted to pursue and take down from Lu Xian Group, Xiao Jinli.”<br/><br/>After hearing this, Liang Haohan’s face darkened, and he said unhappily, “She’s just a little girl, and you not only failed to take her down but now you’re being set up by her? She has such a vicious heart. Even if she doesn’t like you, she could have found any other girl, but she chose your sister…” He didn’t finish saying the word sister, but they both knew what he meant.<br/><br/>Liang Qiming’s face changed, and he said excitedly, “Dad, do you know who Xiao Jinli is? She is the legendary Doctor Xiao in Capital City. She is Doctor Xiao.”<br/><br/>“What?” Liang Haohan’s expression changed, “Lu Xian Group’s CEO Xiao Jinli is Doctor Xiao? How is that possible?”<br/><br/>“Yeah, how could it be possible?” Liang Qiming said with a slightly desperate look, “Lu Xian Group’s CEO Xiao Jinli is that elusive Doctor Xiao. Who could have thought?”<br/><br/>That person said that they wanted to destroy their arrogance.<br/><br/>This was about destroying the Liang Group and the Liang family.<br/><br/>If she was just Xiao Jinli of the Lu Xian Group, she might have to consider whether she had the strength to deal with a top-level company nationwide.<br/><br/>But if she was Doctor Xiao, she didn’t even need to make a move herself. As long as she said a word, there would be people in the business circle who would target the Liang family. The Liang Group would be surrounded by wolves and tigers, and even the largest company would be devoured.<br/><br/>Liang Qiming was praying that Xiao Jinli was only joking to give them a warning, otherwise….<br/><br/>Liang Qiming couldn’t imagine the serious consequences.<br/><br/>Liang Haohan was genuinely surprised to hear this news.<br/><br/>Everyone in Capital City wanted to know the true identity of Doctor Xiao, and most of the businessmen including him didn’t know.<br/><br/>In the business world, he was a leader. Ordinary people would show him respect, but who knew that he couldn’t even see Doctor Xiao.<br/><br/>Does becoming a businessman like them mean having no connections with higher-ups? Of course not. But the higher-ups were also in the dark about Doctor Xiao’s identity. They only knew that Doctor Xiao had become a national figure and no one dared to offend her easily.<br/><br/>Who would have thought that the mysterious Doctor Xiao would turn out to be Xiao Jinli of Xiao Family Village and also the CEO of Lu Xian Group? It was such a surprise.<br/><br/>Liang Haohan squinted his eyes and asked, “Didn’t she take a liking to you when you first met her? Even if Xiao Jinli is Doctor Xiao, she is essentially still a girl, a young girl!<br/><br/>Girls yearn for love, especially romantic love. They like romance, sweet talk, gentle and considerate men, and men who spend money on them.<br/><br/>There’s a popular saying online: A man who is willing to spend money on you may not necessarily love you, but a man who is unwilling to spend money on you definitely doesn’t love you. So whether or not you love her, she is your target, and you have to be willing to spend money on her. Did you follow my advice?”<br/><br/>“…” Liang Qiming nodded and said, “Dad, that’s how I’ve always pursued girls! Most of the girls in the past were the ones who threw themselves at me, and a few I won over with money and romance!<br/><br/>But Xiao Jinli is different. She is stunningly beautiful and wealthy. Most men don’t stand a chance with her! When I first arrived in Xiao Family Village, I talked to my sister, made a plan, and got to know her through Li Jiatong, Li Minxing’s daughter. Li Jiatong accepted two sets of jewelry from my sister worth more than 3 million!<br/><br/>But what my sister and I didn’t expect was that Li Jiatong betrayed us from the beginning. So our every move was exposed to Xiao Jinli.”<br/><br/>Liang Haohan, “…”\t\t\t\t\t\t</div>", "images": {}, "success": true}