{"id": 465, "url": "https://www.novelhall.com/the-lucky-star-blessing-the-whole-village-32483/15193557.html", "title": "Chapter 465 - Chapter 465: Chapter 448: The Grand Finale (Part 3)", "volume": 5, "volume_title": "Volume 5", "body": "<h1>Chapter 465 - Chapter 465: Chapter 448: The Grand Finale (Part 3)</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 465: Chapter 448: The Grand Finale (Part 3)<br/><br/>The news of a large number of technical staff from Shenfeng Group jumping ship spread like wind in every corner of the business world!<br/><br/>“Have you heard? Many technical staff from Shenfeng Group were poached by offering high salaries!”<br/><br/>“No way, is this news accurate?”<br/><br/>“It should be accurate! It seems that they were poached by Liangshi Group!”<br/><br/>“Liangshi Group? Is Liangshi Group so tough now? They can even poach people from Shenfeng Group! You know how many companies wanted to poach people before but didn’t succeed! Now they have succeeded!”<br/><br/>“Haha, they didn’t cooperate with Shenfeng Group, but they snatched away people from their corner. The new chairman is indeed resourceful!”<br/><br/>“Liangshi Group poached so many technicians. I wonder if they can research the New-Type Watch. If they can, they can compete with Shenfeng Group in the market. Liangshi Group will have a leapfrog transformation due to their misfortune! Oh, by the way, do you know which company injected funds for Liangshi Group? Their strength is so impressive!”<br/><br/>“I’m not quite sure! But there’s news that it’s a foreign company!”<br/><br/>“Damn, is Liangshi seeking death? With such technology, they dare to cooperate with foreigners. Aren’t they afraid of being accused of treason?”<br/><br/>“Seeking wealth in danger, right? Before, several projects of Liangshi were on the verge of breaking down? You know what it means for a company when its working capital breaks down. It’s very likely to lead to significant accidents like bankruptcy or closure! So their approach is also a method!”<br/><br/>In the General Manager’s Office of Liangshi Group’s Meilin Technology Company, a brown-haired, green-eyed middle-aged man was scolding the technical staff.<br/><br/>“You idiots, it’s been two months, and you still haven’t researched the New-Type Children’s Watch? I paid a high price to poach you guys here for your new technology, not for you to eat shit here!”<br/><br/>One of the core technicians who were poached said with an ugly expression, “When you asked us to come over, you asked us to research new technology and new products, not directly asking for the New-Type Children’s watch technology!”<br/><br/>The foreigner heard this and immediately laughed. He showed a contemptuous expression on his face and said sarcastically, “What are you pretending to do in front of me? It’s clear to anyone with eyes that the real purpose of my high salary poaching you guys is the technology of the New-Type Children’s Watch! If it’s just other technology, do I need you to research? My Plum Firm Country has a lot of technical talent! I thought you guys had the goods, but as it turns out, you’re idiots!”<br/><br/>The expressions of the poached technical staff changed instantly.<br/><br/>Then the technician said through gritted teeth, “You can look down on us, but you can’t insult us!”<br/><br/>Already feeling remorse deep down in their hearts!<br/><br/>At Shenfeng Group, they were respected by everyone, and Xu Guochang never looked down on them!<br/><br/>But after coming here, they were kicked out and scolded as idiots every other day, plus even worse words.<br/><br/>The foreigner mocked, “Did I insult you? I’m just telling the truth!”<br/><br/>Technician, “…” It’s too infuriating!<br/><br/>“I’ll give you half a month more. If you still can’t research it by then, your bunch of idiots can get ready to pay compensation and get lost!”<br/><br/>The technicians were stunned, “Pay compensation? He didn’t even know that himself!”<br/><br/>Then they quickly realized that they had been played, but there was no evidence. They could only accept their misfortune!<br/><br/>With an ugly and panicked expression, the core technician said, “The key technology of the New-Type Children’s Watch is only in the hands of Xu Guochang!”<br/><br/>The foreigner’s expression became extremely ugly!<br/><br/>…<br/><br/>Su Yichen and Xiao Jinli took off their headphones and said with a light laugh, “Jinli, They took the bait!”<br/><br/>Xiao Jinli laughed and said, “Let Uncle Xu get ready and start launching the Second Generation Children’s Watch!”<br/><br/>The announcement of the New-Type Children’s Watch Second Generation conference made the whole world boil!<br/><br/>Everyone was looking forward to what the New-Type Children’s Watch Second Generation would look like!<br/><br/>At the conference, Xu Guochang said, “This new product, well, it can’t be called a new product. It’s just an upgraded version of the New-Type Children’s Watch! Please look at the product display!”<br/><br/>When the product display was over, it was once again a pleasant surprise!<br/><br/>“Ah, the watch has added an attack skill!”<br/><br/>“When the watch is forcibly removed by a non-guardian, it will release an electric current and instantly knock the person down! Damn, how could such a small thing store electricity? It’s unbelievable!”\t\t\t\t\t\t</div>", "images": {}, "success": true}