{"id": 466, "url": "https://www.novelhall.com/the-lucky-star-blessing-the-whole-village-32483/15193558.html", "title": "Chapter 466-End - Chapter 466: Chapter 448: The Grand Finale (Part 3)_2", "volume": 5, "volume_title": "Volume 5", "body": "<h1>Chapter 466-End - Chapter 466: Chapter 448: The Grand Finale (Part 3)_2</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 466: Chapter 448: The Grand Finale (Part 3)_2<br/><br/>Up next is the real new product presentation – Robot Nanny!<br/><br/>“Ah, ah, it’s just too incredible! This isn’t a robot, it’s basically like a human!”<br/><br/>“Exactly, this Robot Nanny is constructed according to real human proportions, and when it’s dressed in simulation skin, it’s just like a real person!”<br/><br/>“Most importantly, this robot can take care of people, it can do the laundry, clean and cook, go grocery shopping on the streets, and serve sick elderly people by feeding them water and medicine!”<br/><br/>The Robot Nanny came into existence, shocking the world!<br/><br/>“No, we can’t let them continue like this! The technology research and development of the Robot Nanny has already made Dragonzhou Country the strongest country in the world! If this continues, who will listen to our Plum Firm Country! Stop, stop, we must stop them!”<br/><br/>“Boss, how should we stop them?” the subordinate asked.<br/><br/>The boss said coldly, “We must cut off the source!”<br/><br/>The source of all this was Xu Guochang!<br/><br/>Half a month later, a piece of news shocked the nation!<br/><br/>Shenfeng Group’s president Xu Guochang was lured out by his own employees and then kidnapped!<br/><br/>The national security department quickly launched a rescue operation!<br/><br/>Xiao Jinli joined the rescue team!<br/><br/>Under Xiao Jinli’s command, the rescue team soon found the kidnappers’ lair.<br/><br/>The kidnappers were caught before they could escape to the high seas!<br/><br/>What’s even more shocking is that the kidnappers turned out to be from Plum Firm Country!<br/><br/>They kidnapped Xu Guochang, naturally for the high-end technology in his hands!<br/><br/>When this news broke out, it quickly aroused public indignation, and spontaneous street demonstrations demanded severe punishment for the perpetrators!<br/><br/>At the same time, the behind-the-scenes boss of Shenfeng Group spoke up to seek justice for his employees, and decided to teach Plum Firm Country a lesson!<br/><br/>Then, Plum Firm Country’s national network was paralyzed for three days and three nights!<br/><br/>Three days later, all the high-end technology cores that Plum Firm Country prided itself on were exposed!<br/><br/>Plum Firm Country’s top position in the world was quickly eroded!<br/><br/>At the same time, Liangshi Group was declared bankrupt, and the company’s head, Liang Qiming, was arrested on charges of treason and betraying state secrets!<br/><br/>When the dust settled, everyone realized that there was a mysterious boss behind Shenfeng Group, and Xu Guochang was just the surface agent!<br/><br/>What’s even more terrifying is that this mysterious boss is the real master of Shenfeng Group!<br/><br/>So, netizens fell into a frenzy of digging up the mysterious identity of the boss behind Shenfeng Group, however, there were no clues!<br/><br/>“Could it be that the behind-the-scenes boss appeared out of thin air, and we can’t find any information?”<br/><br/>Someone snickered, “Don’t you see what Shenfeng Group does? If the identity of the behind-the-scenes boss was so easily exposed, wouldn’t that be slapping their own face?”<br/><br/>Little did they know, the identity of this mysterious boss was listed as the highest state secret within the Bureau of National Documents!<br/><br/>Because, this mysterious boss was invisible behind Dragonzhou Country!<br/><br/>Since it’s a trump card, it will definitely not be easily revealed!<br/><br/>At the same time, the girl Su Yichen confessed to finally agreed to his confession!<br/><br/>The wealthy first got excited and gave consumers many benefits!<br/><br/>Then, netizens again delved into the identity of Su Yichen’s girlfriend!<br/><br/>The person the country’s richest man confessed to was indeed extraordinary!<br/><br/>She was not only from Xiao Family Village, but her father Xiao Wanshan was also the head of the real estate industry in Ganjiang City, her brother was the vice president of Lv Xian Group, her sister-in-law was the heiress of the Lin Group, and what was even more surprising was that her mother was a stunningly beautiful woman, and the girl had inherited seven or eight points of her mother’s beauty!<br/><br/>What’s even more incredible is that this girl is the mysterious chairman of the Lv Xian Group!<br/><br/>Her own worth has reached fifty billion!<br/><br/>“Damn, the rich really find the rich! So the identity of the First Lady is so special! The entire family, apart from the mother, are all domineering CEOs, and she herself is a beautiful and wealthy CEO!”<br/><br/>“Isn’t it? No wonder the richest man, Su Yichen, is still single and chaste at twenty-seven or eight years old, it turns out he’s been waiting for the grown-up girl to remain pure!”<br/><br/>“What a fairytale romance!”<br/><br/>…<br/><br/>Today, the people of the Xiao family are truly happy!<br/><br/>Why, of course it’s because Xiao Jinli agreed to Su Yichen’s confession and now has a boyfriend!<br/><br/>“Come, come, congratulations to Xiao Quan for upgrading his status in the Xiao family from son to future son-in-law, from now on, we’re a real family!”<br/><br/>“Congratulations, Xiao Quan!”<br/><br/>“Congratulations Xiao Quan, from now on, please take good care of Little Bao!”<br/><br/>Xiao Jinli, “….”<br/><br/>Why does everyone congratulate Xiao Quan’s brother when she agrees to Su Yichen’s confession?<br/><br/>Could it be that she can’t get married?<br/><br/>Xiao Jinli fell into deep thought!<br/><br/>As night fell, Jiang Yifan knocked on Xiao Jinli’s room!<br/><br/>His eyes red, he said, “Mom, you found happiness in this era, and I should leave now! Mom, you have to be extremely happy in the future, only then can I leave with peace of mind!”<br/><br/>Xiao Jinli blurted out anxiously, “Little Space, where are you going?”<br/><br/>Jiang Yifan, oh no, Little Space laughed!<br/><br/>He said, “So, the little master knew my identity early on!”<br/><br/>Xiao Jinli said seriously, “I knew the moment you appeared by my side. After all, there’s a connection between us! Little Space, you said you’re leaving, where are you going?”<br/><br/>Little Space shook his head and said, “Little Master, I’m not leaving, but my energy to maintain my human form is running out, and I can only revert back to being with Xiao Zhi!”<br/><br/>Xiao Jinli, “…” He scared her, she thought Little Space was going to disappear!<br/><br/>She frowned and said seriously, “If you’re leaving, let me arrange it! Otherwise, your grandparents will be heartbroken!”<br/><br/>Little Space nodded and smiled, “Okay, I’ll listen to the Little Master!”<br/><br/>So Xiao Jinli said that Jiang Yifan’s parents had been contacted and were abroad, so they had to say goodbye to everyone and meet again later!<br/><br/>When Jiang Yifan and his so-called parents left, there was a flood of tears. They were so reluctant to part!<br/><br/>When Little Space returned to the space, he still couldn’t stop crying. Xiao Zhi comforted him for a long time!<br/><br/>Xiao Zhi said, “You can see everyone every day now, so why are you crying? At least you’ve transformed into a human, but I can only stay in the space. If anyone should cry, it’s me!”<br/><br/>Little Space paused.<br/><br/>That’s right, he didn’t leave and is still together with everyone. Why should he cry?\t\t\t\t\t\t</div>", "images": {}, "success": true}