{"id": 462, "url": "https://www.novelhall.com/the-lucky-star-blessing-the-whole-village-32483/15193554.html", "title": "Chapter 462 - Chapter 462: Chapter 444:", "volume": 5, "volume_title": "Volume 5", "body": "<h1>Chapter 462 - Chapter 462: Chapter 444:</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 462: Chapter 444:<br/><br/>Liang Qiming visited the Xiao Family Village again and stopped Xiao Jinli, asking directly, “Is it you, is it you?”<br/><br/>Su Yichen blocked her with his body, his face darkened as he said, “Young Master Liang, what do you mean by your words? It’s hard to understand what you’re implying.”<br/><br/>Liang Qiming anxiously asked, “Is it your doing that the Kami-kaze Group rejected the cooperation with the Liang Corporation? Otherwise, why would they suddenly refuse to work with Liang Corporation when everything had been going well? Do you know what it means when Kami-kaze Group refuses to cooperate with the Liang Corporation? I admit I had ill intentions at the beginning, I’ve apologized already! Why are you insistent on pushing us towards a dead end?”<br/><br/>Su Yichen retorted with a stern face, “Young Master Liang, I think there might be some misunderstanding. If the Liang Corporation is rejected for cooperation, it might be you guys who messed up – what does Jinli have to do with this? Don’t put all the blame on her!”<br/><br/>Given the circumstances, denial seemed futile.<br/><br/>Liang Qiming shouted angrily, “How is she not involved? She declared her intention to take down our company before. First, there was the issue with Lin Chengdong wanting to recall his invitation, which caused a wave of mockery among all the people of Kyoto. Then, Kami-kaze Group refused to cooperate with Liang Corporation, leading us to a desperate situation. Xiao Jinli, if you dare to start this, then own up to it!”<br/><br/>Su Yichen wanted to say something, but Xiao Jinli pulled him back and stepped forward.<br/><br/>She chuckled lightly and countered, “What if it is me?”<br/><br/>Liang Qiming’s face turned white with anger, he retorted furiously, “Xiao Jinli, Doctor Xiao, you should be merciful. I already admitted my mistake, you didn’t lose anything. Can’t you let it go once? Must you force us to a dead end?”<br/><br/>Xiao Jinli answered solemnly, “When Liang Corporation, you guys, forced others to bankruptcy and led to their downfall, did you think of being merciful or not?<br/><br/>Let’s take a step back, if I were merely Xiao Jinli, the chairman of the Green Fresh Corporation, fell for your schemes, and were not a renowned doctor, would you have thought of sparing me? Survival of the fittest – when you’re strong, you can do what you want. But when you’re weak, you should consider the consequences of retaliation.”<br/><br/>With each sentence Xiao Jinli spoke, Liang Qiming’s face turned a shade paler.<br/><br/>Because everything Xiao Jinli said was true.<br/><br/>Xiao Jinli ignored his ghastly complexion and stated calmly: “Even though I am kind, I am no saint. My principle has always been: if people leave me alone, I will not bother them. But if they bully me, I will make them pay a hundred times over!”<br/><br/>Having said that, she dismissed Liang Qiming and walked away.<br/><br/>Liang Qiming’s face turned from green to pale, a mix of upset, embarrassment, shock, and fear.<br/><br/>…<br/><br/>“Are you saying the Kami-kaze Group’s refusal to collaborate with us is because of that Xiao Jinli?” Liang Haohan asked grimly.<br/><br/>Liang Qiming nodded, “Yes, that’s right. Xiao Jinli admitted it herself. Her goal is to destroy our Liang Corporation!”<br/><br/>“How dare she!” Liang Haohan said angrily. “She is a mere doctor and thinks herself as a monarch who can manipulate all? Our Liang Corporation is so big, does she really think she can destroy us by just saying so? Son, don’t be afraid. We will just stop cooperating with the Kami-kaze Group. We have numerous business partners!”<br/><br/>Liang Qiming opened his mouth to say something but ended up saying nothing.<br/><br/>…<br/><br/>Meanwhile, the executives at the Plum Firm Country Technology Company were aware of the new and innovative products from the Kami-kaze Group and were flustered.<br/><br/>Don’t get me wrong, they were not excited but angry and anxious.<br/><br/>The reason being, Plum Firm Country was once again overwhelmed by Longzhou Nation, crashing their reputation as the leader in technology.<br/><br/>“Imbecile, imbecile!” the president of the Plum Firm Country Technology Company fumed. “Longzhou Nation is terribly overbearing.”<br/><br/>After a big show of anger, he continued, “This cannot go on. If our reputation as the top technology country is suppressed by Longzhou Nation, it’s entirely detrimental to us.”<br/><br/>The reason why Plum Firm Country can lord over many other countries globally is largely due to its advanced technology, which other countries rely on.<br/><br/>Relying on top-tier technology, they invade small countries, seize their resources, and then strengthen their own country, becoming the world’s leader.<br/><br/>“BOSS, we urgently need to infiltrate Longzhou Nation. Previously, the Su Corporation in Longzhou Nation agreed to cooperate with us,” one of his subordinates suggested with a furrowed brow. “However, the Su Corporation is one of the top enterprises in Longzhou Nation – even among the top ten global enterprises. If we cooperate with Su Corporation, it’s indeed like making a deal with a tiger and could greatly limit our company’s future development or even be utilized by them. It’s known that Su Yichen is a patriot. Therefore, I propose we change our cooperative partner.”<br/><br/>The president glanced at him irritably, “You think I don’t know everything you’ve just mentioned? Why do you think I’ve been so slow to progress with the collaboration? The guy Su Yichen from Longzhou is not an easy one to handle. If he were, how could he become the wealthiest man in his nation at such a young age?”<br/><br/>The subordinate asked, “BOSS, what do we do now? The Su Corporation is willing to cooperate with us, so are you suggesting we outright reject them?”<br/><br/>“Nonsense, of course we should reject!” The president angrily retorted. “We clearly know that cooperating with the Su Corporation would put us at a disadvantage, yet we still proceed; we are not suicidal.”<br/><br/>After a short pause, he continued, “We’ll need to select a few more companies, specifically those that are at odds with Su Corporation, but still have sufficient strength. I leave this task to you. You must find them in the shortest possible time. No matter what methods you need to employ, make sure they will cooperate with us.”<br/><br/>“Yes, BOSS!”<br/><br/>…<br/><br/>After Kami-kaze Group rejected the cooperation with the Liang Corporation, the other companies followed suit, causing several major projects under the Liang Corporation to face a funding shortage. If immediate strategies were not implemented to secure these funds and maintain operations, there would be a high risk of capital chain rupture. Once the funds chain ruptures, the consequences would be drastic. It could lead to a project shutdown at best, or bankruptcy and closure of the Liang Corporation at worst.<br/><br/>Liang Haohan and his son had been anxious and exhausted these days in search of capital.<br/><br/>Liang Haohan even started discussing marriage prospects for Liang Shanshan in order to attract investments. Regardless of whether it was a marriage alliance or being someone’s mistress, if it would result in investments for the Liang Corporation projects, it was acceptable. Liang Shanshan was outraged, but no matter whether she cried or threw tantrums or even threatened suicide, it was to no avail.<br/><br/>Liang Haohan told her, “You may not be willing to sacrifice now, but when the Liang Corporation goes bankrupt, you’ll still become someone’s plaything. At least now we’re still around, most people wouldn’t dare mess with you.”<br/><br/>Left with no options, Liang Shanshan relented and agreed to the marriage.\t\t\t\t\t\t</div>", "images": {}, "success": true}