{"id": 463, "url": "https://www.novelhall.com/the-lucky-star-blessing-the-whole-village-32483/15193555.html", "title": "Chapter 463 - Chapter 463: Chapter 445: Grand Finale (Part 1)", "volume": 5, "volume_title": "Volume 5", "body": "<h1>Chapter 463 - Chapter 463: Chapter 445: Grand Finale (Part 1)</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 463: Chapter 445: Grand Finale (Part 1)<br/><br/>Liang Haohan walked into his own office and noticed an unopened express in the office. Frowning, he asked his assistant, “Whose express is this? Why is it in the Chairman’s Office?”<br/><br/>After calling and inquiring, the assistant replied, “Chairman, it’s an anonymous express. It’s specifically addressed to you and requires you to open it personally!”<br/><br/>Upon saying this, he furrowed his brow and said with slight worry, “Chairman, I don’t know if there’s anything dangerous in it. Let me open it for you.”<br/><br/>With that, he began to open the express package.<br/><br/>Liang Haohan was also afraid of what it might contain, so he did not stop him.<br/><br/>After all, with his identity, it wouldn’t be strange if someone sent him a bomb.<br/><br/>As the assistant opened the express package, two documents were revealed.<br/><br/>When the assistant saw the content of the documents, his eyes widened in shock, and he stuttered incredulously, “How… how is this possible?”<br/><br/>Liang Haohan asked in confusion, “Xiao Li, what is impossible? What kind of documents are these?”<br/><br/>He immediately walked over, took the documents from the assistant’s hand, and saw the marked content: Paternity Test Results. He muttered in confusion, “Whose paternity test is this?”<br/><br/>The assistant came to his senses and tried to stop the Chairman from reading further, but it was too late.<br/><br/>Liang Haohan saw that the tested individuals were Liang Qiming and himself. He was deeply angry, thinking it was someone’s sick joke. However, he saw the last line written: The paternity test revealed that Mr. Liang Qiming and Mr. Liang Haohan do not have a biological father-son relationship.<br/><br/>This was a heavy blow to Liang Haohan, who was both angry and frustrated.<br/><br/>“Bastard!” Liang Haohan shouted angrily, “Who played this cruel joke? Let me find out, I will definitely teach them a lesson.”<br/><br/>But the seeds of doubt had already been planted in his heart.<br/><br/>The assistant saw that the Chairman was only angry and did not faint or something similar, so he let out a sigh of relief.<br/><br/>However, there was another set of paternity test results.<br/><br/>Liang Haohan continued to read and found that they also indicated a non-biological father-daughter relationship. He cursed again in anger.<br/><br/>Assistant Li thought to himself, “Fortunately, the Chairman has a strong heart. Otherwise, he might have really fainted from anger!”<br/><br/>The assistant tried to comfort him, “Chairman, as you said, this could be someone’s cruel joke. Don’t take it to heart. Later, I’ll have someone look into who’s doing this and sue them for defamation, teaching them a lesson.”<br/><br/>Liang Haohan nodded, “Alright, I’ll leave this matter to you. You can leave now; I want to rest for a while.”<br/><br/>The assistant complied, “Alright.”<br/><br/>After the assistant left, Liang Haohan held his chest and looked extremely distressed.<br/><br/>He recalled that when the two children were younger, some people had said they didn’t resemble him.<br/><br/>He assumed their resemblance to their mothers was the reason, but it seemed that…<br/><br/>…<br/><br/>Three days later, Liang Haohan looked at the freshly printed paternity test results, his face extremely ugly and pale.<br/><br/>He never expected that the two children he had pampered and favored were not his own.<br/><br/>They were really not his own.<br/><br/>Both of his wives had cuckolded him!<br/><br/>The extent of Liang Haohan’s anger could easily be imagined.<br/><br/>Suddenly, he clutched his chest, and his face turned purple. Before he could call for help, he fell to the ground.<br/><br/>The loud bang caught the attention of Assistant Li, who was working outside.<br/><br/>His heart suddenly raced. He immediately opened the office door, and sure enough, he saw the Chairman collapsed on the ground, his face turning purple.<br/><br/>“Chairman!” The assistant shouted and cradled the Chairman’s head in his lap.<br/><br/>At this moment, Liang Haohan’s entire body was trembling, and he couldn’t speak. He reached out his right hand, pointing to a spot. The assistant followed his gaze, which fell on the two sets of paternity test results. His pupils involuntarily shrank.<br/><br/>Soon after, Liang Haohan’s head tilted, and he passed out completely.<br/><br/>The assistant dialed for an ambulance, set Liang Haohan’s body down, and picked up the paternity test results from the floor. He hid them securely on his person.<br/><br/>When Liang Qiming received the news and rushed to the hospital, the doctor told him, “Young Master Liang, my condolences!”<br/><br/>Liang Qiming was dumbfounded, unwilling to accept the sudden fact of losing his father.<br/><br/>From then on, he lost his father, the one who had been a protective mountain for him.<br/><br/>While Liang Qiming was too grief-stricken to cry, his mother wailed in sorrow.<br/><br/>Liang Qiming looked at the assistant and asked suspiciously, “What exactly happened in the company? When my father left the house, he was fine. How could he be gone so soon after getting to the office?”<br/><br/>The assistant looked around and then whispered, “Young Master Liang, can we speak privately for a moment?”<br/><br/>Liang Qiming and the assistant went to the hospital staircase.<br/><br/>The assistant took out the documents but didn’t directly hand them to Liang Qiming. Instead, he said, “Young Master Liang, it was these two documents that caused the Chairman’s heart attack.”<br/><br/>Liang Qiming wanted to take them but was stopped by the assistant.<br/><br/>Liang Qiming’s face darkened, and he asked sternly, “Assistant Li, what do you mean?”<br/><br/>Assistant Li revealed a greedy smile, like a cunning fox. He said, “I don’t really mean anything. I just think I’ve worked tirelessly for the company for so many years. Even if I haven’t made significant contributions, I’ve put in a lot of hard work, haven’t I?”<br/><br/>Liang Qiming immediately realized what he meant, frowning and asking, “So, you want money?”<br/><br/>“No, no, I don’t want money,” Assistant Li shook his head, “That would be too vulgar.”<br/><br/>Liang Qiming didn’t understand.<br/><br/>Assistant Li directly stated, “I want 5% of the company’s shares!”<br/><br/>“Impossible!” Liang Qiming refused without thinking.<br/><br/>Liang Haohan’s shares were only 20%. If he gave Assistant Li 5% of the shares, the remaining 15% would be too close to the second-largest shareholder’s shares – only a 1% difference. It would be too dangerous.<br/><br/>Assistant Li hooked his lips, smiling and saying, “Young Master Liang, why don’t you take a look at the documents first? I believe you’ll agree.”<br/><br/>With that, he showed the documents to Liang Qiming, but didn’t completely hand them over, fearing that Liang Qiming might destroy them and therefore, the evidence.<br/><br/>After all, once Liang Haohan was cremated, it would be impossible to do a paternity test again.<br/><br/>Looking at the content on the documents, Liang Qiming’s pupils contracted violently.<br/><br/>He shook his head, saying, “This… How is this possible? No, this can’t be!” He couldn’t accept the fact that he wasn’t Liang Haohan’s biological son.<br/><br/>Assistant Li laughed and said, “But that’s the truth. So, Young Master Liang, do you think these documents are worth 5%?”<br/><br/>Liang Qiming gritted his teeth, “Fine, I agree!”<br/><br/>Since he had already lost his father, he couldn’t afford to lose this identity. Otherwise, he would be illegitimate, despised, and unable to inherit the company or any of Liang Haohan’s assets.<br/><br/>Another of his concerns was that Liang Shanshan might fight for the inheritance after discovering the truth.<br/><br/>Assistant Li saw what he was thinking and reassured him, “Don’t worry. Liang Shanshan isn’t qualified to lay claim to anything from the Liang family. Because, she isn’t your father’s biological daughter either!”<br/><br/>“What?” Liang Qiming was incredulous.<br/><br/>“It’s true.”<br/><br/>Assistant Li handed him the other document.<br/><br/>After reading it, Liang Qiming fell silent, deep in thought.\t\t\t\t\t\t</div>", "images": {}, "success": true}