{"id": 461, "url": "https://www.novelhall.com/the-lucky-star-blessing-the-whole-village-32483/15193553.html", "title": "Chapter 461 - Chapter 461: Chapter 443:", "volume": 5, "volume_title": "Volume 5", "body": "<h1>Chapter 461 - Chapter 461: Chapter 443:</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 461: Chapter 443:<br/><br/>In a corner of the exhibition, Su Yichen and Xiao Jinli were standing together.<br/><br/>Su Yichen was also quite surprised by the new positioning phone watch.<br/><br/>He asked, “Jinli, is this the technology you mentioned? It’s really shocking.”<br/><br/>Once this new kind of children’s watch is launched on the market, it will definitely be popular.<br/><br/>After all, which family doesn’t have children? In every family with children, parents worry every day that their child might get lost accidentally.<br/><br/>Therefore, with such a child’s watch, parents can surely feel more at ease.<br/><br/>Xiao Jinli hooked her lips and said, “This technology belongs to the first generation, which is considered ordinary.”<br/><br/>Su Yichen quickly understood and asked excitedly, “So, is there a second generation, and a third generation?”<br/><br/>The first-generation technology was already astonishing, so one could only imagine how amazing the second and third generations would be.<br/><br/>At the exhibition site, after Xu Guochang briefly introduced the functions of the children’s watches, he continued, “Next, let’s continue to showcase our new products.”<br/><br/>Everyone was surprised and exclaimed, “There’s more?”<br/><br/>The second scene.<br/><br/>An elderly person suffering from dementia encounters a robber on the street.<br/><br/>The robber snatched the elderly person’s wallet, mobile phone, and even a gold ring, then forcibly removed the watch from the victim’s wrist.<br/><br/>“Tsk, it’s just a worthless children’s watch,” the robber disdainfully said, then tossed the watch into a pond.<br/><br/>After the robber left, the watch emerged from the pond and an electronic voice sounded.<br/><br/>“Detected that the non-guardian who removed the watch has left, system starts automatic alarm!”<br/><br/>The process after that was the same as before. After the automatic alarm, the entire incident, including the direction the robber fled, was all recorded.<br/><br/>All the people present were standing up and looking excited.<br/><br/>The phone watch could float up in the water.<br/><br/>The phone watch could actually float up.<br/><br/>After floating up, it would automatically report the alarm.<br/><br/>After floating up, it would automatically send the alarm.<br/><br/>This was really shocking.<br/><br/>Even Su Yichen was greatly shocked.<br/><br/>He looked at Xiao Jinli in disbelief and stuttered excitedly, “Jin…Jinli, did you research this technology yourself?”<br/><br/>Xiao Jinli unhesitatingly said, “Yes. Brother Little Quan, do you think this technology is attractive to Plum Firm Country? Will they be tempted?”<br/><br/>She was now baiting them, wanting Plum Firm Country to be desperate for the technology so as to speed up their conspiracy.<br/><br/>She had been waiting for so long without any action and was getting a little impatient.<br/><br/>It’s only a matter of time before the thief is caught, as they say.<br/><br/>Su Yichen thought for a moment and said seriously, “If I were the president of Plum Firm Country, I would be definitely tempted.”<br/><br/>Xiao Jinli nodded and said, “Well, as long as they’re tempted, that’s fine. Once they’re tempted, they’ll take action. Brother Little Quan, let’s go.”<br/><br/>Afterward, the two of them quietly left.<br/><br/>The press conference was a huge success.<br/><br/>This event was live-streamed worldwide.<br/><br/>That is to say, anyone in any country could witness the successful launch of this new technology.<br/><br/>Industry giants from around the world found the sales department’s phone number before the exhibition was even over, eager to secure orders.<br/><br/>Both the sales and marketing departments’ phones were overwhelmed with calls.<br/><br/>It was hot, hot, hot, incredibly hot!<br/><br/>Busy, busy, busy, incredibly busy!<br/><br/>As soon as the new product from Shenfeng Group was released, the entire company was busy as a spinning top, working non-stop.<br/><br/>Seeing the popularity of the new children’s watches, everyone at Liang Group, including Liang Haohan and his son, were extremely anxious.<br/><br/>Why?<br/><br/>Shenfeng Group refused to cooperate with Liang’s Group.<br/><br/>The refusal to let them enter the exhibition was already a signal given by Shenfeng Group.<br/><br/>Shenfeng Group cooperated with many companies in the industry, even smaller ones, but they were unwilling to work with Liang’s Group.<br/><br/>This left the shareholders of Liang’s Group very anxious.<br/><br/>“What’s going on? Everything was fine before. Why did Shenfeng Group suddenly refuse to cooperate with Liang’s Group?”<br/><br/>Seeing how many people in the industry were benefiting from this trend, while Liang’s Group couldn’t even get a share of it, no one could remain calm.<br/><br/>“Exactly, did we somehow offend Shenfeng Group at some point? Otherwise, why would they refuse to cooperate with Liang’s Group for no reason?”<br/><br/>“Chairman Liang, you need to think of a solution quickly! If our company can obtain orders from Shenfeng Group, our profit could increase by at least 30%.”<br/><br/>“Yes, Chairman, where did this problem come from? We must find the source of the problem.”<br/><br/>…<br/><br/>The more Liang Qiming listened, the more his heart trembled.<br/><br/>With Lin Chengdong wanting to return the invitation on one hand and Shenfeng Group refusing to cooperate on the other, it seemed like they were deliberately targeting Liang’s Group.<br/><br/>Could it be Xiao Jinli?<br/><br/>If it were only these things, it wouldn’t matter that much. However, what was even more serious was that Shenfeng Group’s refusal to cooperate with Liang’s Group implied that there might be problems with Liang’s Group. As a result, many companies would refuse to cooperate with Liang’s Group in the future. If things continued like this, Liang’s Group would eventually face bankruptcy and closure.<br/><br/>That’s why the shareholders of Liang’s Group were so anxious, but they couldn’t find the source of the problem.<br/><br/>Liang’s brother and sister, who knew the source of the problem, didn’t dare to speak.<br/><br/>After the shareholder meeting, Liang Haohan returned to the villa in a rage.<br/><br/>He cursed, “Those old fox bastards only know how to order me to find a solution. If I had a solution, would I still be so worried about this matter?”<br/><br/>After cursing at the other shareholders, he furrowed his brows, feeling puzzled, “Why did Shenfeng Group refuse to cooperate with us? We haven’t offended Xu Guochang, have we?”<br/><br/>Liang Qiming thought for a moment and said, “Dad, this might have something to do with Xiao Jinli.”<br/><br/>Liang Haohan asked with a puzzled face, “What does this have to do with Xiao Jinli?”<br/><br/>“Dad, you’ve forgotten that Xu Guochang attended Lin Chengdong’s daughter’s engagement banquet. Perhaps he met Xiao Jinli at the banquet and wanted to win her favor by taking action against us.”<br/><br/>As Liang Qiming spoke, he paused for a moment before continuing, “No, it’s said that many people took the opportunity to get to know Doctor Xiao at Lin Xiaoxiao’s engagement banquet, and many even received promises from Doctor Xiao. However, none of the other people took action against our Liang’s Group. Why is it just Shenfeng Group?”<br/><br/>Liang Haohan calmed down and contemplated for a moment before saying, “To deal with our Liang’s Group, you don’t need many companies, just Shenfeng Group alone would suffice. Because in the business world, many people know that if Shenfeng Group refuses to cooperate with a certain company, there must be a problem with that company. Afterwards, other companies would follow suit, and Liang’s Group would eventually be on the brink of bankruptcy or closure.”<br/><br/>Liang Qiming’s expression changed, “So Dad, what should we do? Are we really going to watch Liang’s Group go bankrupt with our own eyes?”<br/><br/>“How could that be possible?” Liang Haohan immediately vetoed, “We need to think of a good way to solve this. If Shenfeng Group doesn’t compromise, we’ll have to find another way to save Liang’s Group.”\t\t\t\t\t\t</div>", "images": {}, "success": true}