{"id": 464, "url": "https://www.novelhall.com/the-lucky-star-blessing-the-whole-village-32483/15193556.html", "title": "Chapter 464 - Chapter 464: Chapter 446: The Grand Finale (Part 2)", "volume": 5, "volume_title": "Volume 5", "body": "<h1>Chapter 464 - Chapter 464: Chapter 446: The Grand Finale (Part 2)</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 464: Chapter 446: The Grand Finale (Part 2)<br/><br/>Once the New Generation Children’s Watch was launched, the market immediately heated up, and every family with children would buy a children’s watch to greatly ensure the children’s safety.<br/><br/>Companies that cooperated with Shenfeng Group made a fortune.<br/><br/>They were all grateful for signing Shenfeng Group’s order in the first place.<br/><br/>So their company was thriving and growing thanks to the order.<br/><br/>On the other hand, due to the refusal to cooperate with Shenfeng Group, Liang’s Group’s development gradually went downhill!<br/><br/>However, a camel is still bigger than a horse even when it’s starved to death. After all, Liang’s Group is one of the top ten large companies in the country, and with the projects they had before, the company was still running normally for the time being!<br/><br/>Nevertheless, the board of Liang’s Group has recently been thrown into turmoil!<br/><br/>The former Chairman Liang Haohan suddenly fell ill and died without having time to leave a will, resulting in disharmony within the board!<br/><br/>Adhering to the principle of the son inheriting the father’s career, Liang Qiming, against the majority opposition of the board, held the most shares and inherited the position of Chairman. Liang Shanshan wanted to obtain the inheritance, but was excluded by a personal authentication!<br/><br/>After inheriting the position of Chairman, the first thing Liang Qiming did was secretly transfer 5% of the shares to Assistant Li!<br/><br/>However, after Liang Qiming became the Chairman, with other companies coveting the huge Liang’s Group and other board members coveting his position, it was like being surrounded by wolves and tigers!<br/><br/>Therefore, Liang Qiming’s first step upon taking office was to reverse the current situation of Liang’s Group.<br/><br/>But even when his father was still alive, there was no way to change the situation, let alone for him, who was forced to take on the Chairman’s role!<br/><br/>Just as Liang Qiming was at his wits’ end, he finally found an investment company willing to inject funds into Liang’s Group through the help of a matchmaker, but on the condition that Liang’s Group must work for them!<br/><br/>Liang Qiming couldn’t consider too much. He just wanted to solve the current situation as soon as possible to consolidate his position!<br/><br/>…<br/><br/>In the President’s office of Shenfeng Group, the assistant reported, “President, the Chairman of Liang’s Group wants to talk to you?”<br/><br/>“Liang Haohan?” Xu Guochang didn’t react for a moment, thinking it was Liang Haohan!<br/><br/>“No, it’s his son Liang Qiming! Liang Haohan has passed away!” The assistant said helplessly, “President, Liang Haohan has been dead for quite some time. Are you still thinking about him?”<br/><br/>Xu Guochang wanted to roll his eyes, he said, “Why should I think about him, he doesn’t owe me any money? I just didn’t react in time!”<br/><br/>“Oh, so do you want to meet with Liang Qiming or not?” the assistant asked.<br/><br/>Xu Guochang said, “I wouldn’t even see his father, let alone him!”<br/><br/>“But he said that if you don’t see him, you’ll regret it!” the assistant said!<br/><br/>Xu Guochang frowned and then laughed, “Ha, who is he trying to scare?”<br/><br/>Xu Guochang didn’t bother with Liang Qiming!<br/><br/>Two months later, many technicians of Shenfeng Group switched jobs!<br/><br/>Even a core technician was gone!<br/><br/>Xu Guochang looked at the list and asked, “Where did these people go?”<br/><br/>The assistant replied, “They went to Meilin Technology Company, a subsidiary of Liang’s Group!”<br/><br/>From the establishment of Shenfeng Group to the debut of the new product, the company’s technicians have been coveted by other companies!<br/><br/>But at that time, these technicians were rejected by other companies and joined Shenfeng Group during their most difficult times. Back then, they were filled with gratitude and swore loyalty to the company, promising not to betray it!<br/><br/>However, as Shenfeng Group grew better and better, these technicians became the tasty treats that other companies wanted, luring them with various high salaries and benefits. In the long run, some people were bound to waver!<br/><br/>And now, they really did!\t\t\t\t\t\t</div>", "images": {}, "success": true}