{"id": 460, "url": "https://www.novelhall.com/the-lucky-star-blessing-the-whole-village-32483/15193552.html", "title": "Chapter 460 - Chapter 460: Chapter 442:", "volume": 5, "volume_title": "Volume 5", "body": "<h1>Chapter 460 - Chapter 460: Chapter 442:</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 460: Chapter 442:<br/><br/>No matter how noisy it was outside, the exhibition continued in an orderly manner.<br/><br/>The host of the exhibition was Xu Guochang himself.<br/><br/>Xu Guochang said, “Ladies and gentlemen, our new product this time is a children’s phone watch!”<br/><br/>When everyone heard that it was just an ordinary phone watch that was already common in the market, there was an uproar at the scene.<br/><br/>“Children’s phone watch? This is already common on the market, what kind of new product is this?”<br/><br/>“Exactly, what is Shenfeng Group doing this time? This is clearly not a new product, how did it become a new product launch?”<br/><br/>“Could it be that Shenfeng Group has run out of talent? Unable to research new technology, they are turning the common technology on the market into a new product. Isn’t this just a bluff?”<br/><br/>“Aren’t you all too anxious? President Xu hasn’t said anything yet, and you’re already making judgments? I think this product must not be that simple.”<br/><br/>“I also think it’s not that simple! If it was really the common product in the market, Shenfeng Group wouldn’t suddenly host a new product launch event, isn’t this just them shooting themselves in the foot and tarnishing their own brand?”<br/><br/>“But why is the new product a children’s watch?”<br/><br/>“Based on my intuition, there must be something special about this children’s watch.”<br/><br/>As soon as this man finished speaking, Xu Guochang on stage directly said, “I won’t say much nonsense, please watch the product demonstration!”<br/><br/>Then, everyone focused on the big screen.<br/><br/>A child in a school uniform, about ten years old, was wearing a blue children’s watch on his hand. At first glance, the watch looked no different from the children’s watches in the market. The child happily walked out of the school and continued to a pedestrian-less area with no surveillance. He was still very happy, because his home was not far ahead.<br/><br/>Little did he know, he was being tailed from behind.<br/><br/>The tail had carefully searched for a good spot, looked around, then stepped forward and covered the child’s mouth with a scarf. The child immediately passed out.<br/><br/>Seeing the phone watch on his hand, he muttered, “Annoying thing!”<br/><br/>Then, he ripped it off carelessly and threw it into a corner nearby.<br/><br/>At the same time, the nearest regional office of Yamen runners received a special alarm call!<br/><br/>“Help, help, my child Yu Tongtong is being kidnapped at Ten Li Lane and Street Tail, please rescue him quickly!” Then, the computer screen connected to the phone line immediately showed the process of Yu Tongtong being kidnapped, the kidnapper’s face and figure, and the direction of escape were clearly visible.<br/><br/>All the people in Yamen office were stunned for a moment, and then the bureau chief immediately ordered, “Rescue the child!”<br/><br/>All Yamen runners quickly intercepted the kidnapper according to his escape direction, and ten minutes later, the child was safely rescued.<br/><br/>With a “whoosh” sound, everyone in the audience stood up at the same time, their faces full of shock.<br/><br/>“Is… is this really a children’s phone watch?”<br/><br/>“A phone watch that can automatically send an alarm?”<br/><br/>“Not only can it automatically send an alarm, but it can also clearly record the scene at that time?”<br/><br/>“With such a children’s watch, which parent would still worry about their child getting lost?”<br/><br/>“Yes, this kind of phone watch greatly ensures the safety of children.”<br/><br/>“This kind of children’s watch is also suitable for the elderly with dementia.”<br/><br/>Then, Xu Guochang began to introduce, “As the guests can see, this children’s watch has a new type of positioning. As long as it passes by any place, it will record the entire scene, including sound and image. When taken off by a non-guardian or through violence, it will automatically send an alarm and record the entire process of the watch being removed.”\t\t\t\t\t\t</div>", "images": {}, "success": true}