{"id": 3, "url": "https://www.novelhall.com/i-became-an-immortal-on-mortal-realm-32879/14234557.html", "title": "Chapter 3 - 3 Chapter 2 The Righteous Path And The Demonic Path_1", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 3 - 3 Chapter 2 The Righteous Path And The Demonic Path_1</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\t3 Chapter 2 The Righteous Path and the Demonic Path_1<br/><br/>Translator: 549690339<br/><br/>“Right, before your rebirth, how did I perform on the night our clan was exterminated?”<br/><br/>Fang Wang’s question snapped Zhou Xue back to reality.<br/><br/>With his superior martial skills, he must have been outnumbered and exhausted to death, right?<br/><br/>As Fang Wang pondered this, he heard Zhou Xue say, “I don’t remember you at all. You must have died on the night of our clan’s extermination. After that, only a handful of people from the Fang Residence survived, and you weren’t among them.”<br/><br/>I, the thirteenth son of the distinguished Fang Residence, left no impression on you?<br/><br/>Fang Wang felt insulted, but Zhou Xue’s subsequent words gave him the sensation of having been sentenced to death. The thought of all the people he cared about dying made his heart tense up.<br/><br/>“Let’s talk about this extermination night you mentioned and see what we can do about it,” Fang Wang stated earnestly.<br/><br/>To annihilate the Fang Residence meant either an army besieging the city or martial arts sects infiltrating it. And it had to be a joint effort by many top-notch experts, as the Fang Residence’s servants included quite a few retired maestros from the rivers and lakes.<br/><br/>Zhou Xue tucked her hair behind her ear and took a deep breath before saying, “Seven nights from now, the Fang Residence will face its doom. The enemies are all martial artists, including six of the most formidable from the Imperial City, masters from the Da Qi Dynasty, and one Cultivator. Most of the Fang Residence’s people died at his hands, and he possesses a strange treasure that can absorb the souls of the deceased.”<br/><br/>Cultivator!<br/><br/>No wonder he died!<br/><br/>Fang Wang’s heart sank. By practicing the Sword Control Technique, he’d realized the vast gap between warriors and Cultivators. Even though he had reached a legendary realm in the martial world, facing an unknown Cultivator still placed a huge pressure on him.<br/><br/>“How big is the gap between this Cultivator and ordinary martial artists?” Fang Wang asked, staring at Zhou Xue.<br/><br/>Zhou Xue sighed and answered, “He’s just low-ranking in the Cultivation World, but in the martial world, he could be invincible. A hundred top martial artists wouldn’t stand a chance against him.”<br/><br/>“Then, if one masters the Sword Control Technique, could he be slain?” Fang Wang pressed.<br/><br/>Zhou Xue looked at him strangely and said, “It depends on the level of mastery. All Cultivators can use the Sword Control Technique, but someone like a low-ranking Cultivator can barely manage it. Don’t even think about it. Within seven days, you won’t be able to master the Sword Control Technique, let alone use it to kill a Cultivator.”<br/><br/>Fang Wang got the gist and didn’t underestimate the threat, despite never having faced a Cultivator himself.<br/><br/>“In these seven days, I can’t regain my Cultivation abilities; at most, I can concoct some poisons. You’re the son of my Fifth Uncle and closer to the head of the household. It might be best if you tried to persuade him. Even if you can’t convince the Fang Residence to leave Southern Hills City, it would be wise to start preparing early,” Zhou Xue advised seriously.<br/><br/>After calming down, she realized her previous recklessness. She had been so focused on saving the Fang Residence that she had forgotten its status and her own identity. As the Duke’s Mansion, it would be impossible for the Fang Residence to flee Southern Hills City. Moreover, fleeing would be more dangerous; without the protection of commoners, the Fang Residence’s situation would be even more perilous.<br/><br/>Fang Wang nodded, then cautioned, “The matter of rebirth is too absurd. Don’t talk about it anymore, not even when alone. If word of this gets to the ears of Cultivators, it would be even more dangerous.”<br/><br/>If Fang Wang had been reborn, he would have kept the secret of his rebirth to himself, just as he did with his transmigration.<br/><br/>Zhou Xue nodded slowly, her gaze at Fang Wang changing.<br/><br/>Fang Wang felt alarmed by her look. She wouldn’t be thinking of killing him to silence him, would she?<br/><br/>Afterwards, they talked for a while longer, settling on a rough outline of their statements and actions. Then Zhou Xue urged, “Fang Wang, hurry and get ready. I need to start preparing as well.”<br/><br/>Fang Wang had intended to acquire Cultivation techniques earlier, but seeing Zhou Xue’s increasingly peculiar looks, he simply nodded, stood up, and left through the window.<br/><br/>Zhou Xue stared at the shoeprints on the windowsill, sitting idly on the stool for quite some time.<br/><br/>…<br/><br/>At nightfall, the Fang Residence was brightly lit.<br/><br/>“What? Someone wants to slaughter my entire Fang Residence?”<br/><br/>Fang Yin, dressed as a refined scholar, put down his utensils, his anger out of control as he asked. Fang Wang’s mother, Lady Jiang, turned pale with fright, while the room was devoid of servants, as Fang Wang had sent them away before the conversation.<br/><br/>Fang Wang frowned and said, “Last month, I heard some wandering heroes mention this, but thought it was just a baseless rumor. Today after asking Zhou Xue, I confirmed it. Some mysterious expert secretly informed her, pushing her to desperation. In her urgency, she started making inquiries everywhere.”<br/><br/>Fang Yin snorted, “Why did that expert seek her out rather than going to me, or your four uncles?”<br/><br/>Fang Wang shook his head, “How could I know? But father, consider this: I heard about it, and so did Zhou Xue. It’s better to believe it than to risk disbelief. The Fang Residence cannot afford such consequences.”<br/><br/>Upon hearing this, Fang Yin’s expression darkened. After pondering for a few moments, he slammed the table and stood up, leaving with these last words before departing, “I’m going to see your grandfather!”<br/><br/>Lady Jiang sighed and while serving Fang Wang some dishes, she cautioned, “Wang’er, try to avoid contact with those adventurers in the future. It’s too dangerous.”<br/><br/>“I understand, mother. I won’t do it again,” Fang Wang replied with a smile.<br/><br/>Once this crisis was over, he would pursue the Path of Immortality. As for the unfortunate martial world, he wouldn’t bother with it. If he was going to venture into anything, it would be the Cultivation World!<br/><br/>After dinner, Fang Wang waited in the hall. It took a full hour before Fang Yin returned, his expression extremely grave.<br/><br/>In front of this son, who had always been intelligent and sensible, he did not hide the truth.<br/><br/>“Your grandfather believes it and is preparing to take precautions. You don’t need to worry about these matters; with us here, nothing will happen to the Fang Residence.”<br/><br/>Hearing this, Fang Wang finally felt reassured, then took his leave.<br/><br/>That night, Fang Wang had a rare dream where he soared through the heavens and earth on his sword, becoming a carefree true immortal, feeling thoroughly exhilarated!<br/><br/>The next morning, Fang Wang got up, washed, and then instructed his closest servant, Li Jiu, “Within six days, I want the sharpest sword. No matter the cost!”<br/><br/>Fang Meng had followed the late emperor in conquests to the south and north, accumulating illustrious military achievements. Though he had his military power stripped after the founding of the dynasty, he exchanged it for a vast wealth, making descendants like Fang Wang equally wealthy. For his only son, Fang Yin provided whatever amount of gold, silver, and jewels he requested.<br/><br/>“Very well, I’ll make sure to satisfy the young master!”<br/><br/>Li Jiu, only two years older than Fang Wang, left giddily.<br/><br/>Seizing the moment when the courtyard was empty, Fang Wang began attempting the Sword Control Technique, using a tree branch as his sword. Although he had practiced the Sword Control Technique to the Great Perfection, he had never actually fought with it.<br/><br/>It was nearly impossible for martial arts experts to control swords with True Qi, let alone to achieve sword flight. But fortunately, his Sword Control Technique had reached Great Perfection and, having mastered it, he could use his True Qi to control the sword against his enemies.<br/><br/>The faster the speed, the greater the consumption!<br/><br/>After attempts that lasted more than half an hour, he realized he only had a chance for one strike. He had to seize the opportunity to execute that cultivator in one blow.<br/><br/>In the afternoon, Fang Wang went to visit Zhou Xue, hoping to learn some cultivation techniques that didn’t require much spiritual power. With only six days, even if he mastered a cultivation technique, there wasn’t enough time to accumulate the spiritual power of a cultivator. It might be better to master more techniques to kill his enemy.<br/><br/>However, Zhou Xue had been released from confinement, and Fang Wang missed his chance, forcing him to give up.<br/><br/>Perhaps she had other plans; even her own parents didn’t know where she’d gone.<br/><br/>During these days, the numbers of servants at the Fang Residence grew. Fang Wang’s eldest uncle was openly recruiting wanderers from the martial world within the city, and Fang Family disciples who practiced martial arts elsewhere were called back – mostly those from sects closest to Yang Hu County.<br/><br/>The most noteworthy was Fang Zhe’s third son, Fang Hanyu.<br/><br/>This ninth young master of the Fang Residence had a good relationship with Fang Wang when they were younger, with only two years between them. However, when Fang Wang was seven, Fang Hanyu was sent to train at the largest martial arts sect in Yang Hu County. He would send letters home every year, and last year Fang Yin even mentioned that he had reached the standard of a first-class martial arts expert, a true martial arts prodigy.<br/><br/>Having not seen each other for many years, Fang Wang somewhat missed his little cousin who used to pester him as a child, but now was not the time for reminiscing.<br/><br/>The sixth day, afternoon.<br/><br/>Zhou Xue came looking for Fang Wang, who led her inside the house and closed the door.<br/><br/>Today’s Zhou Xue wore a tight red dress, looking valiant and spirited. She had removed her usual headgear and hairpins, tying her hair up with a red ribbon at the back of her head, revealing a delicate and beautiful face.<br/><br/>She looked quite striking.<br/><br/>That’s what Fang Wang thought, then he sat down with Zhou Xue.<br/><br/>Zhou Xue took out a sachet from her bosom and said, “This is the Fragrant Soft Bone Powder I refined. Just sprinkle it on your enemy, and as long as they breathe in the powder, they will fall to the ground within three breaths. However, this powder is only effective against martial arts experts. It won’t work on that cultivator. If you encounter him, you must flee.”<br/><br/>Zhou Xue had a favorable impression of the first member of her clan to trust her and didn’t want him to act recklessly and die tomorrow night.<br/><br/>Fang Wang picked up the sachet, unable to resist asking, “Is the Cultivation World divided into righteous and demonic paths?”<br/><br/>Zhou Xue glanced at him and hummed softly, “Of course, it’s divided. That’s right, I’m a cultivator from the Demonic Path. Countless humans, demons, and monsters have died by my hands. Are you afraid?”<br/><br/>Fang Wang earnestly said, “I often hear the heroes in the city say that one is subject to forces beyond one’s control in the martial world. The danger in stepping on the Path of Immortality must be even greater. The fact that you’ve returned from rebirth and still care about the Fang Residence is enough for me not to fear you. You are forever a part of the Fang Residence, my clan member.”<br/><br/>This…<br/><br/>A cultivator of the Demonic Path!<br/><br/>Fang Wang felt a bit unsettled. With his reminder, he might be the only one who knows about Zhou Xue’s rebirth in the future. Would this bring trouble?<br/><br/>Seeing his seriousness, Zhou Xue gave a small smile and began to look him over. She noticed he was quite handsome, with sharp eyebrows and bright eyes, full of vigor. That made sense, since his father, Fang Yin, was well-known as a handsome man in Southern Hills City.<br/><br/>After a brief contemplation, Zhou Xue said solemnly, “Your martial skills are not bad, but they can only deal with mere warriors. Leave the cultivator to me and don’t you be overly brash.”<br/><br/>She had a fondness for Fang Wang but also understood the temerity of young geniuses. Fang Wang had mastered powerful martial skills at a young age, and in his impulsiveness, he could likely challenge a cultivator.<br/><br/>Fang Wang pondered for a moment then slowly nodded. After all, as a reborn individual, she must have some tricks up her sleeve.<br/><br/>Eager to learn about the ways of cultivation, Fang Wang did not wish to die before he even began his journey on the path of immortality.<br/><br/>The two talked for quite a while – mostly Zhou Xue outlining plans with Fang Wang listening. Zhou Xue needed Fang Wang to pass on some of her suggestions. After all, as an adoptive daughter, she had no say within the Fang Residence. Throughout the conversation, Fang Wang tried to seek cultivation methods, but she sternly rejected him, claiming that with the Fang Residence on the brink of life and death, it was not the time to think about such futile matters.<br/><br/>After Zhou Xue left, Fang Wang went to see his father and relayed her suggestions. Fang Yin showed appreciation for Fang Wang’s proposals and immediately went to seek Fang Meng, his father.<br/><br/>That night, many in the Fang Residence had trouble sleeping.<br/><br/>Anyone who heard their family was on the verge of annihilation would be in turmoil.<br/><br/>Fang Wang was no exception; he practiced his internal skills to accumulate True Qi, seeking to strengthen his confidence.\t\t\t\t\t\t</div>", "images": {}, "success": true}