{"id": 5, "url": "https://www.novelhall.com/i-became-an-immortal-on-mortal-realm-32879/14234559.html", "title": "Chapter 5 - 5 Chapter 4: The Strength Of A Cultivator_1", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 5 - 5 Chapter 4: The Strength Of A Cultivator_1</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\t5 Chapter 4: The Strength of a Cultivator_1<br/><br/>Translator: 549690339<br/><br/>Thud!<br/><br/>Gazing at the masked man, who had brought despair, collapsing onto the ground, Fang Hanyu’s eyes widened, his face showing disbelief.<br/><br/>Such incredible speed!<br/><br/>What kind of footwork was that?<br/><br/>Fang Hanyu was, after all, a first-rate expert; even from behind, he couldn’t see Fang Wang’s movements clearly. They were too fast, and the sword’s speed even quicker.<br/><br/>He had struck down a top-level master with a single blow!<br/><br/>Fang Hanyu suddenly questioned himself. Was he too weak, or was Fang Wang too strong?<br/><br/>Could it be that he was not truly a first-rate master?<br/><br/>Fang Wang turned around, wiping the sword blade on the masked man’s body. Only after the bloodstains were cleaned off did he finally sheathe his sword.<br/><br/>He looked up at Fang Hanyu and said, “If you’re still able to fight, then go and kill the enemy. Aside from those top-level masters, you are still very strong.”<br/><br/>After speaking, Fang Wang turned and left. His feet performing the Shadowless Step, he skimmed over the courtyard wall and disappeared into the night.<br/><br/>Fang Hanyu took a deep breath, gripped the sword in his hand tightly, and walked in another direction.<br/><br/>…<br/><br/>The Fang Residence was in chaos, utter chaos!<br/><br/>Thousands of household guards were all over the place, trying to capture the mysterious black-clothed persons. Each of those black-clad figures possessed martial skills; the weakest among them could take on several tens of guards, not to mention the enormous threat posed by the top-level masters.<br/><br/>Boom —<br/><br/>Fang Shi, Fang Wang’s senior uncle, clashed palms with one of the black-clothed persons. The two competed in True Qi. Their robes billowed wildly as if they were about to tear apart, the stone slabs underfoot shattered, flowers and plants were swept up, and an old tree ten steps away trembled violently.<br/><br/>“Solar Palm Fang Shi, truly lives up to his reputation. Half a step into the top-level realm. If only you weren’t the legitimate eldest son of the Fang Family, your martial arts achievements would be even higher. What a pity!”<br/><br/>The black-clothed person confronting Fang Shi sneered. He, too, wore a mask, a white opera mask painted with a crafty, vicious smile that made him look like a devilish fiend in the dead of night.<br/><br/>Fang Shi was in the prime of his life, his palms hot as branding irons. As True Qi against True Qi clashed, his palms turned red, causing the surrounding space to appear as if it were slightly wavering.<br/><br/>“A top-level master yet you hide behind a mask, lacking the courage of a martial artist. If I am to be pitied, then you are truly laughable!”<br/><br/>Fang Shi snorted coldly, exerting strength in his arms. His powerful True Qi burst forth, and both men retreated simultaneously.<br/><br/>Fang Shi stepped back eight paces, while the other merely retreated five, revealing the disparity!<br/><br/>This scene tightened Fang Shi’s heart even further. As the highest-skilled fighter in the Fang Residence, if he couldn’t overcome the person before him, then the Fang Residence might indeed face the threat of annihilation!<br/><br/>He had previously seen several figures with exceptionally quick movements, most likely all top-level masters.<br/><br/>The force capable of mobilizing so many top-level masters against the Fang Residence…<br/><br/>Fang Shi’s expression worsened. He varied his palm techniques, True Qi surging, palms emanating scorching heat. Against the backdrop of night, it seemed especially striking.<br/><br/>The black-clothed person opposite him held no weapons but instead lifted his right leg. His entire body was tensed, giving off a thrilling sense of pent-up power.<br/><br/>The two men locked eyes for a moment before charging at each other furiously.<br/><br/>Bang! Bang! Bang…<br/><br/>As they engaged in close-quarters combat, Fang Shi used his palms, fierce and powerful, as if one strike could overpower ten forces. The black-clothed person had agile footwork; his legs like swift lashes. Confronting Fang Shi’s techniques, he countered every move with his legs, his speed like the wind, his momentum like thunder, stirring up the dust and pebbles in the courtyard, with violent streams of energy wreaking havoc all around.<br/><br/>The guards outside the courtyard watched them in horror, wanting to aid Fang Shi but unable to find an opportunity to intervene.<br/><br/>Hundreds surrounded the courtyard, even lining the walls. They nocked arrows and drew bows, but their eyes couldn’t keep pace with the movements of the black-clothed figures.<br/><br/>There were not just a few battlegrounds like this one at the Fang Residence—courtyards, corridors, gardens, and even the rooftops were filled with clashing figures.<br/><br/>While the Fang Residence didn’t have many martial arts experts, there were plenty of trained family members and guards. After all, Fang Meng was a celebrated Duke who emerged victorious from the battlefield, ranking among the top ten generals at the founding of the Da Qi Dynasty. His influence peaked to the point where he could command an entire army alone. Even though Fang Meng had relinquished his military power, the indomitable spirit ingrained in his bones continued to be passed down through the Fang Residence.<br/><br/>Apart from Fang Shi, the black-clothed persons were gaining the upper hand in other fights. The group of assassins were all highly skilled in martial arts. Even outnumbered, they handled themselves with ease, and every moment, members of the Fang Residence met their demise.<br/><br/>Murderous intent and terror enveloped the Fang Residence!<br/><br/>Fang Wang, while possessing martial arts skills akin to a myth, was still a mere mortal. He couldn’t multiply himself. As he moved quickly forward, the number of black-clothed persons dying by his hand grew.<br/><br/>One person witnessed this scene from atop the highest building in the Fang Residence, a tower filled with all the collected books of the family. He stood at the pinnacle of the tower, merged with the darkness of the night.<br/><br/>It was the Qingyi Daoist.<br/><br/>“Not bad martial skills, he counts as a real top-level among warriors. If I hadn’t come, perhaps the Prime Minister’s plans might have fallen through.”<br/><br/>The Qingyi Daoist’s mouth curved upward, his face displaying disdain.<br/><br/>Those who practiced martial arts were, after all, mere mortals. Even the strongest was no match for him!<br/><br/>He practiced Cultivation!<br/><br/>The Qingyi Daoist lifted his left hand, and a Yellow Talisman flew out from his sleeve, hovering above his palm. The talisman emitted a radiance that illuminated his face.<br/><br/>Just then, the Qingyi Daoist glanced towards a certain spot. Following his gaze, a figure in red could be seen standing on top of an old tree, gazing at him from a distance.<br/><br/>Zhou Xue!<br/><br/>Gazing at the Qingyi Daoist, Zhou Xue’s eyes were ice-cold, exuding a daunting murderous intent.<br/><br/>“It’s him!”<br/><br/>In these seven days, she’d constantly felt an unreal sensation, afraid that it was all a dream or an Illusionary Realm until today. When she saw that figure from deep within her memories, which brought her despair, she finally felt that she had truly been reborn.<br/><br/>Hatred!<br/><br/>Intent to kill!<br/><br/>There was still a trace of excitement!<br/><br/>The Qingyi Daoist felt Zhou Xue’s gaze and couldn’t help but frown.<br/><br/>For some reason, Zhou Xue gave him a feeling of great danger. His first reaction was that the other party was also a cultivator, but upon closer inspection, the other party did not have the aura or magic artifacts of a cultivator.<br/><br/>The Qingyi Daoist immediately leaped up, like a grey eagle gliding through the night sky, launching an attack on Zhou Xue.<br/><br/>Zhou Xue instantly leaped down from the tree and disappeared into the night. The boundless night was like daylight to the Qingyi Daoist, and he quickly closed in on Zhou Xue.<br/><br/>The Qingyi Daoist lightly touched the courtyard wall with his toes, as agile as a swallow. While still in mid-air, he swung his horsetail whisk with his right hand, sweeping towards Zhou Xue. Almost in an instant, Zhou Xue suddenly turned around and threw out five flying darts, all describing different arcs as they sped towards the Qingyi Daoist.<br/><br/>The Qingyi Daoist’s eyebrows raised, and the killing intent in his eyes intensified.<br/><br/>…<br/><br/>Bang!<br/><br/>A figure smashed through the courtyard wall, sending debris flying. He collapsed onto the stone path like a heap of mud, limbs twisted unnaturally, a chilling sight.<br/><br/>Fang Wang withdrew his hanging right leg and looked at the corpse before him with an icy expression.<br/><br/>This night was the first time he had killed someone, but he felt no discomfort because he had seen many from the Fang Residence, including some of his kin, die gruesomely. Hatred had taken over his mind.<br/><br/>He had already slain thirty-seven black-clothed persons, the weakest of whom were second-rate experts, including three top-notch masters.<br/><br/>His performance had been witnessed by many family members and servants, but the Fang Residence was still in jeopardy, and no one had the time to marvel at his prowess. His eyes were focused only on killing the enemy.<br/><br/>He moved towards the main hall where his parents were. He had been making his way there all along, fearing for their safety.<br/><br/>With the strength of a martial arts myth, Fang Wang was able to kill all the black-clothed persons he encountered without using his True Qi, always saving it and ending the enemies’ lives with the most vicious moves.<br/><br/>It wasn’t long before.<br/><br/>Fang Wang arrived at the vicinity of the main hall. There were about five hundred servants surrounding the entire courtyard tightly, with a dozen or so corpses of black-clothed persons already there.<br/><br/>Fang Wang, covered in dust, arrived, his white clothes unstained by blood. The servants all recognized him and made way for him.<br/><br/>Upon reaching the front of the main hall and seeing his parents were still alive, Fang Wang let out a sigh of relief.<br/><br/>“Wang’er, come here quick, it’s dangerous outside!”<br/><br/>Seeing him, Lady Jiang, Fang Wang’s mother, urgently waved her hand and called out to him.<br/><br/>Fang Yin, seeing his son unharmed, also let out a sigh of relief. He was about to speak when suddenly a thunderous noise came from the west, causing everyone to turn their heads.<br/><br/>Fang Wang also turned to look, a burst of golden light reflecting on his face, his pupils dilating in response.<br/><br/>If he was like this, then the others were even more so, open-mouthed and dumbstruck, as if they had seen a ghost.<br/><br/>To the west, amidst a dazzling burst of golden light rising between the buildings, a figure stood suspended, holding up the golden light against the backdrop of the moon. With Fang Wang’s exceptional eyesight, he could clearly see the figure’s true form.<br/><br/>It was a Qingyi Daoist standing on one foot atop a wooden sword, with a horsetail whisk in his right hand. His left hand was raised above his head holding a Yellow Talisman, constantly emitting golden light, brilliant and eye-catching.<br/><br/>“What is that?”<br/><br/>“How is it possible, how can a person stand in the air?”<br/><br/>“It’s a ghost! A ghost has come to destroy our Fang Residence!”<br/><br/>“It must be a trick, even a top martial arts expert could not possibly stand suspended in the air!”<br/><br/>“If it were an illusion, why would there be so many experts attacking the Fang Residence tonight?”<br/><br/>The people around the Fang Residence were in an uproar, a sense of indescribable panic spreading, even servants armed with weapons were frightened, with some already kneeling and praying.<br/><br/>Fang Wang immediately took steps towards the direction of the Qingyi Daoist. Lady Jiang saw this scene.<br/><br/>“Wang’er, what are you doing?”<br/><br/>Lady Jiang yelled, drawing the attention of many towards Fang Wang. Fang Wang didn’t look back but simply raised the sword in his hand and leapt into the air, soaring like a roc, jumping tens of feet high and landing on a distant rooftop, rushing forward. This scene made many members of the Fang Family gape in amazement.<br/><br/>Fang Jin, the third son, exclaimed in astonishment, “Fifth brother, Wang’er’s lightness skill is incredible. Even our eldest brother couldn’t leap so high straight away.”<br/><br/>Fang Yin was stunned, staring at the receding figure of Fang Wang, unable to snap out of his daze for a long time.<br/><br/>Fang Meng, the supported family head, stared intently at the Qingyi Daoist, his focus not shifted by Fang Wang. It was the first time his face looked so awful, and he slowly whispered three words, audible only to himself:<br/><br/>“Cultivator!”<br/><br/>…<br/><br/>In the damaged courtyard, Zhou Xue, with slightly disheveled hair, looked up at the Qingyi Daoist high above her. She wiped the blood from the corner of her mouth, her left arm obviously dislocated, hanging loosely.<br/><br/>“Girl, such a tyrannical poison, this is not something an ordinary person can create. Which sect are you from? Could it be Green Cicada Valley?” The Qingyi Daoist, looking down on Zhou Xue with indifference, asked coldly.<br/><br/>Zhou Xue furrowed her brows tightly and coldly said, “What treasures are you still hiding on your person?”<br/><br/>Upon hearing this, a fierce light flashed in the Qingyi Daoist’s pupils, and his killing intent was unstoppable. He snorted coldly, “Unwilling to talk? Then die!”<br/><br/>He violently directed the Yellow Talisman in his hand towards Zhou Xue, countless golden beams bursting forth from it, pouring down like a torrential rain, aimed at Zhou Xue. Zhou Xue immediately jumped aside, but the golden beams were faster still.<br/><br/>After dodging several times, she was feeling the limits of this body.<br/><br/>“I hadn’t expected him to possess two noteworthy magic artifacts. It seems his identity is not as simple as it looks.” Zhou Xue felt a sinking feeling in her heart. Was she going to have to use that move?<br/><br/>Just as she was about to be struck, an arm wrapped around her shoulder, and a great force pulled her away from the assault of the golden beams. The beams of golden light hit the ground, piercing through the courtyard walls, stone slabs, and tree trunks, extremely sharp.<br/><br/>Zhou Xue turned her head to see, and caught a glimpse of Fang Wang’s somewhat youthful handsome profile.\t\t\t\t\t\t</div>", "images": {}, "success": true}