{"id": 9, "url": "https://www.novelhall.com/i-became-an-immortal-on-mortal-realm-32879/14234567.html", "title": "Chapter 9 - 9 Chapter 7 Solaris Scripture Ninth Level Of Great Perfection_1", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 9 - 9 Chapter 7 Solaris Scripture Ninth Level Of Great Perfection_1</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\t9 Chapter 7 Solaris Scripture Ninth Level of Great Perfection_1<br/><br/>Translator: 549690339<br/><br/>“Can I learn them all?”<br/><br/>Fang Wang made his choice, eliciting from Zhou Xue a slight twitch at the corner of her mouth she could not suppress an eye roll.<br/><br/>So arrogant!<br/><br/>Zhou Xue, with much patience, explained, “Different cultivation techniques cultivate different kinds of spiritual power. Learning too many will lead to the chaos of spiritual powers, and mastering one technique is easier than dabbling in many.”<br/><br/>Unabashed, Fang Wang asked, “If I choose one and can’t learn it, can I switch to another?”<br/><br/>“Alright then, since you saved my life.”<br/><br/>Unable to hold back a chuckle, Zhou Xue spoke softly, but the laugh triggered her injuries, causing her to cough violently.<br/><br/>Fang Wang felt it inappropriate to touch her, so he could only watch from the side.<br/><br/>“Which one do you want to start with?” Zhou Xue asked, her voice even weaker after coughing.<br/><br/>Fang Wang thought for a moment and said, “Let’s try the difficult Solaris Scripture. If I start with the hardest, the rest will feel easier.”<br/><br/>Zhou Xue wasted no time and began explaining the mental method of the Solaris Scripture, which included the Qi Gathering Method.<br/><br/>Fang Wang listened attentively, filled with anticipation. Only by mastering the cultivation technique could he truly step onto the path of cultivation.<br/><br/>As Zhou Xue passed on the technique, she watched him and felt quite emotional.<br/><br/>“I never thought I would treat someone this way. Is this what family feels like? Ruo Lan, you were right, relying on others is useless. I must cultivate a force that can be trusted. My rebirth must be divine guidance, hinting at a different path for me.”<br/><br/>Witnessing Fang Wang, whom she had no memory of from her past life, listen so earnestly, Zhou Xue truly felt reborn.<br/><br/>If she had a second chance at life, she would not settle for just becoming an immortal!<br/><br/>Thousands of thoughts rose in Zhou Xue’s heart. Now that the crisis facing her residence had passed, it was time to plan her new life.<br/><br/>Fang Wang was unaware of her thoughts, his mind completely absorbed in the Solaris Scripture.<br/><br/>After Zhou Xue finished imparting the entire Solaris Scripture, Fang Wang’s mind exploded, his vision blurring.<br/><br/>The next second, he was inside the Heavenly Palace. When he opened his eyes and clearly saw his surroundings, he immediately punched the air and shouted triumphantly.<br/><br/>“I did it!”<br/><br/>Overwhelmed with excitement, Fang Wang realized that being able to enter the Heavenly Palace meant he could cultivate the Solaris Scripture!<br/><br/>Although the Heavenly Palace could only assist him in grasping supreme techniques, if he could master the Solaris Scripture to Great Perfection and then cultivate Qi, his progress would be twice as effective.<br/><br/>This was a technique not even Zhou Xue could master before ascending!<br/><br/>Sitting down right then and there, Fang Wang immediately started cultivating the Solaris Scripture.<br/><br/>There were nine levels in the Solaris Scripture. Upon reaching the third level, the spiritual power contained the Solaris Flame, capable of scorching the soul. At the sixth level, one could resist all kinds of fire, and at the ninth level, one could condense the Solaris True Fire, burning everything!<br/><br/>Fang Wang started cultivating with the basic Qi Gathering Method. The Heavenly Palace underwent changes, manifesting the nature’s spiritual energy needed by cultivators. This energy was illusory, intended to aid his cultivation. The so-called spiritual energy born from nature nourishes all creatures. Yet, many different types of energy exist in the universe, and the process of cultivation involves extracting and refining this spiritual energy.<br/><br/>However, just to cultivate the first level of the Solaris Scripture, Fang Wang felt like ten years had passed. Ten years to master the first level?<br/><br/>Could my talent for cultivation be that poor?<br/><br/>Disbelieving, Fang Wang continued his cultivation. To confirm the time he spent practicing, he visualized a large clock in the Heavenly Palace, reminiscent of a modern Earth timepiece but with an ancient appearance and a record of years at its base to keep track of time.<br/><br/>Yet the time it took to cultivate the second level was twice that of the first, and Fang Wang had to put aside concerns about his talent and focus on his practice.<br/><br/>So it went, as Fang Wang continued cultivating the Solaris Scripture, gradually becoming numb to his heart and forgetting everything outside.<br/><br/>It was as if the years flowed endlessly and the stars shifted in their courses.<br/><br/>By the time he mastered the Solaris Scripture to Great Perfection, flames spontaneously ignited behind his head, forming into spheres of fire, like miniature suns, orbiting behind him—these were the Solaris True Fire.<br/><br/>The Solaris True Fire looked like ordinary flames, but it could absorb sunlight. The longer it burned during daylight, the more terrifying its power became.<br/><br/>Opening his eyes, Fang Wang’s gaze had become weathered—not from worldly experiences, but from the fatigue of the heart.<br/><br/>Turning his head, he discovered that he had spent a total of two hundred and thirteen years cultivating the Solaris Scripture!<br/><br/>This duration nearly matched that of an entire dynasty!<br/><br/>Fang Wang’s mood sank, attributing the difficulty to the Solaris Scripture itself.<br/><br/>Yes, better to blame the goal than to lament one’s own shortcomings.<br/><br/>No wonder Zhou Xue couldn’t master it before ascending—who would spend two hundred years practicing a single technique?<br/><br/>Collecting his emotions, Fang Wang willed himself out of the Heavenly Palace.<br/><br/>His vision cleared, and he saw Zhou Xue lying weakly on the bed.<br/><br/>He had spent two centuries in his journey, but in reality, it was but an instant.<br/><br/>“This month, you should focus on cultivating the Solaris Scripture. Once I’m healed, we’ll set out. Great Abyss Gate recruits disciples every five years, and if we miss this year, we’ll have to wait another five,” Zhou Xue said softly, her gaze somewhat peculiar.<br/><br/>For some reason, ever since she finished teaching the Solaris Scripture, she had the feeling something was different about Fang Wang. She couldn’t pinpoint it, but it was a subtle feeling.<br/><br/>“If you are the reborn Immortal Venerable, why not establish your own sect?” Fang Wang asked, puzzled.<br/><br/>Zhou Xue gave a resigned smile and replied, “Cultivation isn’t that simple. The blessed lands of Grotto-Heaven and various resources in Da Qi have long been divided by the Nine Great Sects. And since my rebirth, I also need to walk the path of cultivation again. Joining a sect not only provides resources for cultivation but also protection.”<br/><br/>Fang Wang nodded. Seeing her grow paler, he said, “You should rest and heal. We can talk more afterward.”<br/><br/>After speaking, he stood up, ready to leave.<br/><br/>“Oh, and last night that cultivator left behind two magic artifacts. Since you killed him, they rightfully belong to you. Once I’m healed, I’ll give them to you and teach you how to control them so that your starting point in cultivation will be higher than others,” Zhou Xue said suddenly.<br/><br/>Fang Wang didn’t turn back but merely raised his hand in acknowledgment and replied, “Keep them for yourself. You introduced me to the path of cultivation; consider these as repaying that favor. Later, pass on some spells to me.”<br/><br/>Without pausing, he quickly left the room.<br/><br/>When the door closed, Zhou Xue showed a smile on her face and muttered to herself, “Taking him as a disciple isn’t a bad idea, but since we are one clan, why fuss over formalities?”<br/><br/>Having returned from rebirth, she decided that not only would she cultivate herself, but she would also lead the Fang Residence in cultivation. The betrayal of her past life made her realize that no matter how strong she was, without a trustworthy power, she would end up dead with her path destroyed.<br/><br/>Setting aside the grace of the Fang Residence raising her, the presence of a genius like Fang Wang made it worth her while to nurture him.<br/><br/>Zhou Xue closed her eyes, taking advantage of her convalescence to sort out her thoughts.<br/><br/>She had realized that rebirth was not just about changing regrets; she could embark on a stronger path than in her previous life. Those missed opportunities she remembered could be hers with careful planning!<br/><br/>Besides, she mustn’t reveal the fact of her rebirth; this would be her greatest secret.<br/><br/>Even in The Upper Realm before her rebirth, she had never heard of such a bizarre experience. Putting herself in others’ shoes, if she truly believed someone was reborn, she would probably have some crooked thoughts.<br/><br/>…<br/><br/>Back in his room, Fang Wang sat cross-legged at the desk, activating the Solaris Scripture and absorbing nature’s spiritual energy.<br/><br/>Without any hindrance, and with no need to adapt, in almost an instant, he formed a whirlpool of qi around his body as the invisible and colorless spiritual energy from nature surged into him, giving him a feeling of refreshing clarity.<br/><br/>He had felt something similar while cultivating in the Heavenly Palace, but it was nowhere near as intense as the sensation in his physical body.<br/><br/>He became engrossed in the exhilarating feeling that the Qi Gathering brought, unable to extricate himself.<br/><br/>The strength of the nine-layer Great Perfection of the Solaris Scripture was immense. Fang Wang didn’t know the progress rate of other cultivators, but he was certainly enjoying himself; the Solaris Spiritual Power had already begun to condense in his Dantian.<br/><br/>An hour passed, and he successfully entered the first layer of the Qi Cultivation Realm.<br/><br/>After a day and a night, he strongly advanced to the second layer of the Qi Cultivation Realm.<br/><br/>In the following days, Fang Wang didn’t leave his house and focused on Qi Gathering. Initially, his parents would come to visit him, but upon hearing that he was cultivating, they dared not disturb him any longer, only instructing the maids to deliver meals daily.<br/><br/>After that night’s great battle, Fang Wang’s status within the residence skyrocketed, becoming the pride of the entire Fang Residence. However, the affairs of cultivation were not spread widely, and Fang Meng even issued orders to forbid the spread of the demonic cultivator’s existence, claiming only that the Fang Residence had been attacked by a group of mysterious martial artists.<br/><br/>…<br/><br/>In a quiet study.<br/><br/>The Emperor of Da Qi sat in his chair, holding an ancient book. He appeared to be only in his early twenties, very young.<br/><br/>An elderly minister walked in and bent down to bow at the table.<br/><br/>“Your Majesty, the Southern Hills plan failed, and the Immortal Master that your servant requested has also perished,” the old minister reported in a low voice, his official attire outlining a slightly corpulent figure with grizzled temples. As he spoke these words, his countenance remained unchanged.<br/><br/>Upon hearing this, the Emperor of Da Qi’s hand, holding the book, trembled. He slowly put down the book and stared blankly at the old minister before saying, “Didn’t you say it was foolproof?”<br/><br/>The old minister sighed, saying, “Being able to kill an Immortal Master indicates that the Fang Residence also harbors such power or is protected by it. I indeed miscalculated, thinking it was foolproof. However, it doesn’t matter. I have sent a letter to that person; before this, he assured me there would be no complications. Presumably, he will resolve this himself.”<br/><br/>The Emperor of Da Qi turned to look out the window, murmuring, “The power of cultivation, the prospect of immortality… I wish to enter this realm, having sacrificed so much without success. How did the Fang Residence come by the support of such power?”<br/><br/>The old minister did not answer; he too was perplexed and did not even dare to send someone to investigate the Fang Residence, fearing he might startle the snake.<br/><br/>After a while.<br/><br/>The Emperor of Da Qi returned his gaze, stared straight at the old minister, and said, “Let’s leave it at that for now. I will act as if I am unaware of this matter. Handle it cleanly.”<br/><br/>The old minister nodded.<br/><br/>The Emperor of Da Qi waved his sleeve, and the old minister bowed and took his leave.<br/><br/>“The world often speaks of the allure of imperial power, but what is even that compared to immortality?”<br/><br/>The Emperor of Da Qi’s deep sigh echoed in the study, his voice filled with helplessness.<br/><br/>…<br/><br/>Half a month into his seclusion, news of the massacre at the Fang Residence spread throughout the Great Qi, with every state and county discussing it. The Fang Residence even sent someone to the Imperial City to protest their innocence, leading to a chill among the various noble families, as the Duke’s Mansion was an institution of considerable standing. What kind of audacious power could it be?<br/><br/>That day.<br/><br/>Zhou Xue came to visit Fang Wang, who got up to greet her. They sat at the table, where Fang Wang poured her tea.<br/><br/>“You’ve recovered from your injuries too quickly…”<br/><br/>Fang Wang was inwardly alarmed. Zhou Xue’s wounds had been so severe before that normal medical treatment would have required at least half a year of recuperation.<br/><br/>Zhou Xue, having regained her dashing figure, was still dressed in bright red, catching the eye captivatingly. Compared with half a month ago, her demeanor was even more remarkable, with a sharpness shining between her brows. She sized up Fang Wang and asked, “How is your training with the Solaris Scripture?”<br/><br/>Fang Wang thought to himself that it was pretty good, reaching the nine-layer Great Perfection.<br/><br/>However, facing Zhou Xue, a reborn individual, he dared not reveal everything. After all, she was still a demonic cultivator, and although they had fought side by side before, it was only because the disaster facing the Fang Residence had been so imminent that they had no time to guard against each other.<br/><br/>“It’s alright, I feel I can keep going,” Fang Wang replied. After practicing the Solaris Scripture, he had no immediate plans to train in other techniques like the Spring Autumn Art or the Devouring Heaven Demonic Art.<br/><br/>The Solaris Scripture was too powerful, and half a month of cultivation had already transformed him, taking his cultivation realm to the sixth layer of the Qi Cultivation Realm.<br/><br/>And furthermore…<br/><br/>Spending a century in the Heavenly Palace was excruciating. Only he knew the monotony and torment of it.<br/><br/>Zhou Xue watched him, her gaze enigmatic.<br/><br/>Fang Wang felt a jolt of anxiety under her scrutiny, worried that she might have noticed something.<br/><br/>Zhou Xue withdrew her gaze and said softly, “Thirteen days from now we will set off. I have made my selections, and together with you and me, a total of nine Fang Family Disciples will head to the Great Abyss Gate.”<br/><br/>Fang Wang nodded, his eyes brimming with anticipation.<br/><br/>Having mastered a Cultivation Technique was not enough; he needed to learn powerful spells!<br/><br/>“Ahem, Zhou Xue, could you pass on a spell to me?” Fang Wang gave a polite cough, cheekily making his request.<br/><br/>Zhou Xue looked at him with a smile that was not quite a smile, and cheerfully said, “Sure, your Sword Control Technique is so powerful that you must have quite a talent for the Sword Dao. I have a set of Swordsmanship here that, if you master, will allow you to sweep across those of the same realm.”\t\t\t\t\t\t</div>", "images": {}, "success": true}