{"id": 2, "url": "https://www.novelhall.com/i-became-an-immortal-on-mortal-realm-32879/14234556.html", "title": "Chapter 2 - 2 Chapter 1 Immortal Venerable Reborn_2", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 2 - 2 Chapter 1 Immortal Venerable Reborn_2</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\t2 Chapter 1 Immortal Venerable Reborn_2<br/><br/>Translator: 549690339<br/><br/>Fang Wang, upon hearing this, clenched his right hand hidden in his sleeve.<br/><br/>Am I so inconspicuous within the Fang Residence?<br/><br/>Alright, I admit I’ve kept a low profile in the past sixteen years, which is nothing compared to the overflowing talents and arrogance of my brothers.<br/><br/>Fang Wang said, “I am Fang Wang, my father is Fang Yin.”<br/><br/>Zhou Xue narrowed her eyes and asked coldly, “How long have you been here?”<br/><br/>“Upon hearing your visit to my uncles and claiming that the Fang Residence faces the danger of annihilation, I came with the attitude that it’s better to believe it’s true. However, this matter is of great importance, and I dare not fully trust it,” Fang Wang didn’t answer her question but steered the conversation towards the danger of the family’s annihilation.<br/><br/>Zhou Xue frowned; she had intended to dismiss Fang Wang but was reminded of his martial skills, which could prove to be a significant help.<br/><br/>Even though in her previous life she was an Immortal Venerable, she had now been reborn with a body weaker than that of ordinary mortals. In seven days’ time, she wasn’t able to change the course of the family’s demise with her own strength.<br/><br/>“Did you overhear something just now?” Zhou Xue stared at Fang Wang, realizing she had been careless. She could only blame herself; first, for not knowing enough about the experts of the Fang Residence in her past life, and second, for being mentally unsettled after rebirth.<br/><br/>In her previous life, the Fang Residence was slaughtered overnight, leaving only her and a few others to escape. Thus subconsciously, she thought the Fang Residence had no experts, which led her to speak her troubles out loud in her room.<br/><br/>Fang Wang was silent for a moment before deciding to lay it all on the line, after all, it concerned the annihilation of the Fang Residence. “You said you are reborn, I am willing to try to believe you. Since you are the rebirth of an Immortal, your mind must surely contain Immortal Laws. I don’t need you to show them to me, just teach me any move at random. I have ways to verify its authenticity. If it’s real, then I am willing to believe your words and join you in reversing the fate of the Fang Residence, as I too carry the Fang surname.”<br/><br/>In his mind, there lay a Heavenly Palace, a place he discovered the first time he engaged with Inner Strength. Once he commenced the training of Inner Strength and martial arts, his consciousness would enter the Heavenly Palace, where he could survive without eating or drinking until he perfected these extraordinary abilities. Only then would he be able to leave the Heavenly Palace and return to reality.<br/><br/>No matter how long he stayed within the Heavenly Palace, it was only a moment in reality.<br/><br/>This was the reason he had reached the mythic realm of martial arts at the age of sixteen.<br/><br/>Zhou Xue’s brows tightened as she stared intently at Fang Wang, a cold glint flickering in her eyes. She did not speak immediately.<br/><br/>Fang Wang was not in a hurry either, sitting down at the table opposite her, patiently waiting for her response.<br/><br/>Alas, he had hoped to quietly acquire skills before adventuring through the martial world, living a carefree life. He hadn’t expected to encounter such a predicament.<br/><br/>Fang Wang felt miserable, but his current martial prowess allowed him to stay calm.<br/><br/>The sun outside the window gradually set, and the residual glow was like blood, painting a tragic yet beautiful scene.<br/><br/>Zhou Xue broke the silence and asked, “Why do I need your trust? You are just a third-generation descendant, with no say in the matter.”<br/><br/>Fang Wang replied calmly, “But you have no other choice right now. If you can gain my trust, I will certainly support you fully. The words of one Fang Family Disciple might be taken as a joke, but what about two? I can at least persuade my father, and with the family’s survival at stake, if you speak the truth, please believe in me.”<br/><br/>Zhou Xue, hearing this, felt there was some sense to it. Indeed, she had no other option; the Fang Residence had to be forewarned.<br/><br/>“So be it. I cannot just abandon the Fang Residence. Since you are the only one willing to believe me, I will teach you the Sword Control Technique. The Sword Control Technique is the gateway spell for a Cultivator and also the threshold between Cultivation and martial arts,” Zhou Xue said softly. Fang Wang nodded slightly on hearing this, feeling a nervous tension inside.<br/><br/>He hoped it was real, yet feared it was real.<br/><br/>If it was real, then the Fang Residence faced great peril.<br/><br/>But if it was real, the pursuit of eternal life through Cultivation would also be real…<br/><br/>If one could cultivate, who would practice martial arts?<br/><br/>Zhou Xue began to recite the mental method formula for the Sword Control Technique, and Fang Wang listened intently.<br/><br/>The Sword Control Technique emphasizes projecting Spiritual Power to control a Flying Sword. Fang Wang had heard from a knight-errant that a Sword Saint a hundred years ago could achieve such a feat. Could it be possible that this individual was a Cultivator?<br/><br/>Zhou Xue spoke while observing the other’s expression closely.<br/><br/>The cultivation level from her previous life was gone, and even her thoughts were now akin to those of a mortal, without the divine consciousness that she had cultivated in the Upper Realm. All these made her feel as if she were in a dream.<br/><br/>What made her feel helpless was that seven days were too short; there was no time to cultivate anew. Moreover, her current status was low and no one believed her, only the youth before her was willing to attempt to trust her words.<br/><br/>After an incense stick’s worth of time, Zhou Xue finished recounting all the key points of the Sword Control Technique.<br/><br/>No sooner had her words fallen than Fang Wang’s mind exploded, and his consciousness instantly arrived within a majestic, resplendent palace.<br/><br/>This was his very own Heavenly Palace!<br/><br/>When he first arrived, he stood outside the Heavenly Palace where he could see the plaque with the words ‘Heavenly Palace.’ Afterwards, he would directly appear inside the Heavenly Palace.<br/><br/>The space inside the Heavenly Palace was vast, but through his explorations, it only had this one hall. On both sides of the hall were eighteen types of weapons. He could further imagine weapons and martial arts equipment, creating anything at will. He could even change the environment inside the hall, all with just a thought.<br/><br/>“It’s real… it’s real…”<br/><br/>Fang Wang could barely contain his excitement. When Zhou Xue described the Sword Control Technique, he already found it profound. Now that he had entered into the Heavenly Palace and verified that the Sword Control Technique was real, such a supreme technique must indeed be a Cultivation Law.<br/><br/>Most importantly, even if it was a Cultivation Law, he could still enter the Heavenly Palace!<br/><br/>What did this imply?<br/><br/>It meant that in the future, his Cultivation would not require the actual time to practice Cultivation Techniques and Spells. This would be his greatest advantage!<br/><br/>Fang Wang could not help cheering, utterly ecstatic.<br/><br/>Since childhood, he had dreamed of wandering the ends of the earth. He had planned to travel the world after turning eighteen, living a joyful life with his martial skills. Now that he knew of Cultivation’s existence, his wanderlust grew even stronger.<br/><br/>After calming his emotions, Fang Wang thought of the Fang Residence’s impending doom and immediately began practicing the Sword Control Technique.<br/><br/>Cultivation within the Heavenly Palace was monotonous; it had taken him nearly twenty years to reach the Great Perfection in his Inner Strength, and with the addition of other peerless martial arts, he appeared sixteen but had actually lived through seventy to eighty years. Fortunately, the Heavenly Palace did not affect his physical lifespan.<br/><br/>Fang Wang was proficient in a set of first-class sword techniques of his time and had his own understanding of swordsmanship. Practicing the Sword Control Technique was not so difficult to comprehend, but the Sword Control Technique utilized the Spiritual Power of Cultivators, whereas he had the True Qi of a Martial Artist in his body. He wondered whether True Qi could control a sword.<br/><br/>A full ten years passed before Fang Wang arduously achieved Great Perfection in the Sword Control Technique.<br/><br/>Great Perfection was the highest state of that supreme technique, far from just a simple matter of mastery.<br/><br/>The moment he reached Great Perfection, his consciousness returned to reality.<br/><br/>…<br/><br/>After Zhou Xue finished explaining the Sword Control Technique, she kept her gaze on Fang Wang, wanting to see what kind of expression he would have. However, there was no change in Fang Wang’s expression, which left her a bit disappointed.<br/><br/>She promptly asked, “Now, do you believe, or do you not believe?”<br/><br/>A gleam flashed in Fang Wang’s eyes, and he smiled, showing the vigor of youth on his face.<br/><br/>“I believe! Such an extraordinary technique is not something ordinary people could conceive. From now on, I shall join you in changing the destiny of the Fang Residence!” Fang Wang declared emphatically, his heart filled with excitement which he was eagerly trying to control.<br/><br/>Zhou Xue was taken aback and looked at Fang Wang with a peculiar expression.<br/><br/>In her heart, she couldn’t quite distinguish whether she felt relief, moved, helpless, or amused.<br/><br/>The setting sun outside the window grew lower, as if to tell her that there was not much time left. She could only put her faith in the young man before her, just as he had believed in her.\t\t\t\t\t\t</div>", "images": {}, "success": true}