{"id": 4, "url": "https://www.novelhall.com/i-became-an-immortal-on-mortal-realm-32879/14234558.html", "title": "Chapter 4 - 4 Chapter 3 You'Re Not That Special In Front Of Me_1", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 4 - 4 Chapter 3 You'Re Not That Special In Front Of Me_1</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\t4 Chapter 3 You’re Not That Special in Front of Me_1<br/><br/>Translator: 549690339<br/><br/>On the seventh day, which was the most oppressive one since the Fang Residence was established, most people were disdainful of the looming threat to destroy the residence. However, as night fell, everyone in the Fang Residence grew tense.<br/><br/>The night skies were like water, and the cold wind whistled through the silent Southern Hills City, once bustling and prosperous, now punctuated occasionally by the barking of dogs.<br/><br/>Fang Wang sat atop the eaves, touching a treasured sword in his hand—a sword that Li Jiu had taken three days to purchase, capable of cutting through iron as if it were mud, truly a divine weapon.<br/><br/>His gaze settled on a figure on a distant rooftop, his cousin, Fang Hanyu.<br/><br/>Fang Hanyu stood tall and straight, holding a sword, his head slightly bowed as if dozing off. The cold wind tugged at his long hair and robe, lending him the air of a chivalrous warrior set to conquer the world.<br/><br/>“Impressive skills, he’s indeed reached the premier level of the martial world, and not just entered it; he’s a true martial arts prodigy,” Fang Wang commended internally.<br/><br/>In the martial world, practitioners divided their realms from low to high as follows: non-proficient, third-rate, second-rate, first-rate, pinnacle, and the legendary Martial Mythical Realm. The pinnacle masters were rare, usually from major sects, seldom wandering the world. To be first-rate was to run rampant across the land.<br/><br/>Fang Wang had reached the Martial Mythical Realm at sixteen; he should have been a legend of his time, if not for the Cultivation World’s dimensional strike that he encountered.<br/><br/>Facing the imminent cultivators, Fang Wang felt no fear or panic, instead, a fervent passion stirred within him.<br/><br/>Four years into his martial practice, he had yet to kill an enemy. Even in sparring, he wore a mask and challenged other masters, always stopping at the point of contact.<br/><br/>His confidence lay in his martial arts and the Great Perfection of his Sword Control Technique, which he relied on to challenge the weakest of the Cultivation World. Moreover, with Zhou Xue—a reborn Immortal Venerable—in the Fang Residence, he believed she surely possessed exceptional skills, especially since Zhou Xue understood the gap between cultivators and mortals.<br/><br/>The night grew deeper, with frog croaks echoing frequently in the courtyards, and troops of family retainers patrolled the area, especially around the Fang Residence where even the officials were alerted to stand guard at night.<br/><br/>Zhou Xue sat at a stone table in the courtyard, wiping silver darts, her expression icy cold. Her eyes were colder than the moonlight reflected on the blades, and a trace of black malevolence seemed to well up within them.<br/><br/>Elsewhere.<br/><br/>Atop the eastern city wall of Southern Hills City, silhouettes leapt up like soaring eagles or skimming geese, swiftly infiltrating the city.<br/><br/>The last figure landed on the wall, overlooking the vast Southern Hills City, his Qingyi fluttering, broad shoulders and a thin waist, his long hair casually tied with a cloth strip. He appeared to be in his early forties, and the horsetail whisk in his hand made him resemble a Taoist, yet his eyes held a serpentine coldness.<br/><br/>“As expected of one of Da Qi’s most prosperous cities in the south, it will surely enable the Soul Burning Banner to resurrect,” he muttered to himself, the corners of his mouth curving upwards slightly, his tone laced with ruthlessness. He then leapt up, vanishing into the vast night.<br/><br/>…<br/><br/>In the main hall of the Fang Residence, which was brightly lit, the master of the house, Fang Meng, was seated at the head, surrounded by the lords and ladies of the residence.<br/><br/>Fang Meng, nearing seventy, had white hair but the presence of an elderly lion. Sitting on his chair, hands braced on his walking stick, he looked sharply and calmly toward the night sky outside the door.<br/><br/>“It’s the hour of the Rat, and no invaders have attacked. It was indeed a false alarm.”<br/><br/>“I told you, you can’t just blindly trust the words of a couple of kids.”<br/><br/>“Isn’t Fang Wang usually quite clever? How could he believe such rumors? The Fang Residence is the Duke’s Mansion; who would dare to barge in? They’d be risking their heads.”<br/><br/>“Quiet down, what do you women understand? The sky isn’t even fully bright yet; we can’t let our guard down!”<br/><br/>“Father, I’m actually feeling increasingly uneasy.”<br/><br/>The lords were Fang Wang’s uncles, and their expressions were somber. The ladies tried to appear relaxed in an effort to lighten the heavy atmosphere.<br/><br/>Fang Zhen, the fourth lord, had an impact with his words, because he had served in the military, and had crawled out from mountains of corpses and seas of blood; his sense of danger far surpassed the others.<br/><br/>With a snort, Fang Meng said, “I have been a soldier all my life; now that I’ve returned to the fields and handed over military power, it doesn’t mean just anyone can provoke me. Whoever dares come must die, and this affair won’t end here!”<br/><br/>His ire was great—as he looked across the vast lands of Da Qi, who would dare to target a Fang State Duke’s Mansion so recklessly?<br/><br/>And who would have the power to do so?<br/><br/>Fang Meng had his suspicions, but he did not voice them.<br/><br/>Suddenly!<br/><br/>“Ah—”<br/><br/>A scream echoed from the east, the terrified voice of a maid.<br/><br/>Fang Shi, Fang Wang’s eldest uncle, immediately rushed out, disappearing from sight within a few strides.<br/><br/>The remaining four lords of the Fang Residence—Fang Zhe, Fang Jin, Fang Zhen, and Fang Yin—immediately went outside the main door, looking around. Their ladies were startled but not panicked, huddling together and shivering.<br/><br/>Fang Meng coughed a few times and slowly stood up with the support of his wife.<br/><br/>Soon, the Fang Residence echoed with screams, shouts of combat, and the clashing of swords and blades.<br/><br/>Perched on the eaves, Fang Wang saw mysterious black-clothed persons breaking into the Fang Residence from multiple directions. The number of enemies was greater than he had imagined, and he charged towards the fastest-moving black-clothed person.<br/><br/>At the same time, Fang Hanyu also moved, while Zhou Xue continued to sit patiently at the stone table, waiting.<br/><br/>Tap!<br/><br/>A black-clothed person flipped over the wall and landed. He held a long saber in his right hand and wore a black cloth over his face, revealing only his eyes. His gaze fell on three maids in the courtyard, who screamed in terror and scurried towards the house when they saw him.<br/><br/>Without a word, the black-clothed person charged at them.<br/><br/>Whoosh—<br/><br/>A sound of air being torn rang out, piercing the silence of the night, and the black-clothed person stopped abruptly. Behind him, at the corner of the wall, a pebble landed on the wall, carving a thumb-sized indent before hitting the ground. The bloodstain on the pebble was black under the moonlight.<br/><br/>The black-clothed person then fell backward, his head hitting the ground heavily, eyes wide open in death, unwilling to close. A bloody hole was pierced through his forehead, eerily haunting.<br/><br/>Within his lifeless pupils, Fang Wang’s reflection flashed by.<br/><br/>Running swiftly along the estate wall, Fang Wang occasionally tossed a pebble, which he had prepared in advance; each one easily took the life of a black-clothed person wreaking havoc on the Fang Residence.<br/><br/>Fang Wang occasionally changed direction, heading wherever there were black-clothed persons; none could withstand a single hit from him.<br/><br/>The Fang Residence was vast, more like a city within a city. The black-clothed persons scattered, and Fang Wang couldn’t slaughter them all in a short time. During his movement, Fang Wang also kept watch on the distance.<br/><br/>Zhou Xue had said that apart from the cultivator, there were also six peak-level masters from the Imperial City invading. It was worth noting that the Fang Residence did not have a peak-level master. Even with the help of thousands of family guards and soldiers, it was difficult to kill six peak-level masters.<br/><br/>Fang Wang planned to take out the six peak-level masters first and then deal with the cultivator, minimizing the casualties of the Fang Residence.<br/><br/>Suddenly, Fang Wang saw a powerful surge of energy in a direction, collapsing an entire loft; he immediately turned and dashed towards it.<br/><br/>Clang!<br/><br/>As swords clashed, Fang Hanyu was forced back, his heels dragging two long marks on the ground. Bending over abruptly, he braced himself with the scabbard on the ground before half-kneeling, unable to stop the blood gushing from his mouth.<br/><br/>He had been defeated as soon as the fight began!<br/><br/>Fang Hanyu’s long hair was slightly disheveled. Looking up with difficulty, his eyes filled with horror, he gritted his teeth and spat out two words, “The peak!”<br/><br/>Under the cover of night, with the cold wind whistling, the black-clothed person standing before Fang Hanyu held a long saber made of fine iron. Different from the others, he wore a bronze mask that revealed only his eyes and nose.<br/><br/>Staring down coldly at Fang Hanyu, the masked man snorted, “To reach first-class level at such a young age, a genius indeed comes from the Fang Residence. It’s a pity that tonight, you will meet an early demise.”<br/><br/>He raised the long saber in his right hand, which began to emit a chilling frost.<br/><br/>Fang Hanyu’s face was filled with unwillingness. Before this night, he had already met a peak-level master, the sect leader of their sect and a renowned grandmaster in the Da Qi martial community. The sect leader had once guided him, making him fully aware of the gap between a first-class master and a peak-level master.<br/><br/>Despair crept into his heart—the Fang Residence might belong to a Duke with a military background, but it did not have a peak-level master. His eldest uncle, Fang Shi, was also at most at the top first-class level.<br/><br/>“Who are you, exactly? Who is pulling the strings behind the scenes?”<br/><br/>Fang Hanyu asked sternly as he struggled to stand, his hand holding the treasured sword trembling.<br/><br/>He had just engaged in combat and was already gravely injured by the opponent’s True Qi. Even so, he did not want to retreat because this was his home.<br/><br/>The masked man stepped forward, the blade reflecting the cold light that shimmered next to the ruins.<br/><br/>“One who is about to die doesn’t need to know the truth. Everything in this world will soon be irrelevant to you.”<br/><br/>The masked man said coldly, lifting the long saber in his hand at an angle, the frostiness on the blade intensifying, blurring his silhouette in a mist-like vapor.<br/><br/>Fang Hanyu threw aside his scabbard and wiped the blood from the corner of his mouth with a raised hand, assuming a sword stance, prepared to fight to the death.<br/><br/>Even if he couldn’t kill his opponent, he had to try to inflict some injury, to buy more time for the Fang Residence.<br/><br/>Just at that moment,<br/><br/>The masked man suddenly halted, and just as Fang Hanyu was hesitating and confused, a familiar yet unfamiliar voice came from behind:<br/><br/>“You’re right, but have you ever considered that the one about to die might be you?”<br/><br/>Fang Hanyu instinctively turned his head, his peripheral vision catching a glimpse of a figure flashing past him like a startled swan.<br/><br/>It was Fang Wang!<br/><br/>He arrived swiftly using the Shadowless Step, leaving afterimages, positioning himself between Fang Hanyu and the masked man.<br/><br/>Fang Wang, dressed in a white robe that hugged his frame, had grown taller and appeared handsome, though his face still had traces of boyishness. There was an air of maturity in his expression that one wouldn’t find in ordinary youth.<br/><br/>The masked man’s gaze fell on the scabbard in Fang Wang’s right hand. Narrowing his eyes, he said, “Impressive footwork. To see you so young, a truly peerless talent. Compared to you, the person behind you is quite ordinary.”<br/><br/>Upon hearing this, Fang Hanyu didn’t think much of it; he merely gazed at the back of Fang Wang.<br/><br/>Of course, he remembered this younger cousin; however, after many years apart and with the imminent disaster of their home, he had not found the opportunity to reconnect with Fang Wang.<br/><br/>“That footwork just now… He’s also trained in martial arts?”<br/><br/>Fang Hanyu wondered in surprise. Since returning, he had also asked his father about Fang Wang’s experiences. This younger brother had always stayed in the Fang Residence, so from where had he acquired such high level footwork?<br/><br/>Fang Wang locked eyes with the masked man and suddenly drew his treasured sword. As the bright blade left its sheath, the pupils of the masked man dilated suddenly.<br/><br/>Within his wide eyes, a sword grew larger. He instinctively raised his saber.<br/><br/>Splat—<br/><br/>Blood splattered; Fang Wang emerged behind the masked man, his right hand holding the sword pointed obliquely at the moon. Slightly lifting his chin without turning back, he said softly, “In my presence, you’re quite ordinary as well.”\t\t\t\t\t\t</div>", "images": {}, "success": true}