{"id": 7, "url": "https://www.novelhall.com/i-became-an-immortal-on-mortal-realm-32879/14234563.html", "title": "Chapter 7 - 7 Chapter 6: Three Cultivation Techniques_1", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 7 - 7 Chapter 6: Three Cultivation Techniques_1</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\t7 Chapter 6: Three Cultivation Techniques_1<br/><br/>Translator: 549690339<br/><br/>“`<br/><br/>Thump!<br/><br/>The headless body of the Qingyi Daoist fell upon the shattered stone ground, blood scattering everywhere. The Soul Burning Banner that had been hovering above him fell as well, its surrounding Ghost Qi dissipating.<br/><br/>Gazing at the corpse of the Qingyi Daoist, Zhou Xue trembled all over. She turned her head to look at the Treasured Sword hovering in front of Fang Wang and couldn’t help but ask, “You… What was that just now…?”<br/><br/>Fang Wang, supporting her with his left hand and maintaining the Sword Control Technique posture with his right, replied with a calm face, “As you saw, it was the Sword Control Technique that you taught.”<br/><br/>As soon as he finished speaking, a huge cheer erupted from the people of the Fang Residence nearby.<br/><br/>“The demon Daoist is dead!”<br/><br/>“What was that just now? That sword was flying!”<br/><br/>“Even the strongest swordsmen in the Jianghu couldn’t execute such swordsmanship!”<br/><br/>“Young Master Fang Wang is so powerful!”<br/><br/>The people of the Fang Residence were extremely excited; with the Qingyi Daoist being so powerful, having slain him meant the other assassins were nothing to fear.<br/><br/>Some people, however, worried that the Qingyi Daoist might come back to life, for after all, this fellow was a demonic Daoist whose actions could not be predicted by common sense.<br/><br/>Zhou Xue, hearing Fang Wang’s words, had a drastic change in her expression and started coughing violently out of emotion, coughing up blood all over the ground. This scared Fang Wang so much that he hastily abandoned his pose to support her.<br/><br/>Clang!<br/><br/>The Treasured Sword fell to the ground, its blade still smeared with the blood of the Qingyi Daoist, chillingly thrilling.<br/><br/>“I’m fine… I won’t die… I just used a Secret Technique to temporarily grant this body a certain fighting strength. Although my injuries are severe, they will heal within a month…”<br/><br/>Zhou Xue looked up and said. Her face was as pale as death, but her eyes were filled with spirit, as if she could swallow Fang Wang whole.<br/><br/>Fang Wang was frightened by her gaze, especially since she claimed to be a Demonic Cultivator in her previous life…<br/><br/>“Fang Wang, had you truly never engaged in the way of cultivation before?” Zhou Xue stared at Fang Wang, took a deep breath, and asked seriously.<br/><br/>Fang Wang hesitated for a moment but decided to trust her and replied, “Indeed, I had not, but when you mentioned the Sword Control Technique, I felt it was genuine and possible, so I cultivated for seven days. Using the Sword Control Technique, I utilized True Qi, which you should be able to sense.”<br/><br/>He was still relying on Zhou Xue to set foot on the path of cultivation; there was no need to pretend to be a pig to eat a tiger. By showing his worth, he could gain more favor.<br/><br/>“How could True Qi be used to execute the Sword Control Technique? And your sword isn’t even a Magic Artifact, to control it through the air…”<br/><br/>“I’m not sure either, but it worked.”<br/><br/>Fang Wang shook his head, his heart secretly pleased.<br/><br/>Do you think this is an ordinary Sword Control Technique?<br/><br/>Sorry, this is the Sword Control Technique of Great Perfection!<br/><br/>Even high-level cultivators might not spend time studying the Sword Control Technique.<br/><br/>At these words, Zhou Xue grew even more excited, her chest heaving uncontrollably. Despite the intense pain in her body, she spoke firmly, “Fang Wang, you are definitely a once-in-a-millennium cultivation genius. Your destined magical artifact must surely be an Earth Origin Spirit Treasure! Once my injuries heal, follow me to cultivate!”<br/><br/>With the Qingyi Daoist slain, the disaster of the Fang Family being wiped out had been averted, which led Zhou Xue to speak directly about the future.<br/><br/>Here it comes!<br/><br/>Fang Wang had been waiting for these words. He nodded and said, “All right, wait for me. I’ll go take care of the remaining foes. Afterward, you can tell me more about what an Earth Origin Spirit Treasure is.”<br/><br/>Zhou Xue nodded.<br/><br/>Fang Wang immediately beckoned for his clan members to come and take care of Zhou Xue while he left with his sword in hand.<br/><br/>Fang Zhe, accompanied by clan members and servants, rushed over. He instructed two women to take care of Zhou Xue, while he cautiously approached the body of the Qingyi Daoist.<br/><br/>“Don’t get close; there is a ghostly presence on him. Let Fang Wang and me deal with it!”<br/><br/>Zhou Xue called out to stop Fang Zhe. Hearing this, Fang Zhe hesitated, but recalling the terrifying sight of the Soul Burning Banner, he shivered and quickly signaled the others to retreat and not to come near.<br/><br/>Performing the Sword Control Technique had depleted seventy percent of Fang Wang’s True Qi, but to slay the remaining black-clothed persons, he didn’t need True Qi at all.<br/><br/>An hour later.<br/><br/>The Fang Residence had completely returned to tranquility, though the atmosphere remained heavy as the night’s death toll exceeded a thousand.<br/><br/>In the Manor’s Main Courtyard, the hall.<br/><br/>Fang Wang stood next to his father, Fang Yin, surrounded by clan members, each looking grim, with all eyes focused on Fang Meng.<br/><br/>Fang Meng, hands on his walking stick, took a deep breath and said, “What happened tonight cannot be concealed. We must spread the word. Tomorrow, we’ll hold a grand funeral, the grander the better, to let the world know of the Fang Family’s tragedy. Only then will no one dare to touch us further.”<br/><br/>Fang Wang’s uncle, Fang Jin, couldn’t help but say, “Father, to mobilize so many experts, it must be related to the Imperial Palace. We are the Duke’s Mansion, after all. Even after giving up military power, we have come to such an end…”<br/><br/>“Shut up!”<br/><br/>Fang Meng shouted, causing Fang Jin to close his mouth, but his face was still full of resentment and unwillingness.<br/><br/>The dead tonight were not just servants; two of Fang Wang’s cousins had also perished.<br/><br/>Fang Meng continued solemnly, “Remember, we are within Da Qi, we cannot recklessly fight against heaven.”<br/><br/>In the hall, most shared Fang Jin’s sentiments and emotions. Had it not been for Fang Wang’s actions that night, the Fang Residence might truly have been eradicated. Every time they thought of this, they were immensely relieved yet terrified.<br/><br/>“Everyone, disperse now. Wang’er, you stay behind.”<br/><br/>Fang Meng continued, and at these words, all eyes turned to Fang Wang, each filled with gratitude, admiration, and disbelief.<br/><br/>That night, Fang Wang had slain sixty-three assassins, including the demonic Daoist. News of his feat had spread throughout the Fang Residence, but they were still immersed in grief, so it wasn’t right to ask how he had become so formidable.<br/><br/>The people filed out with respectful gestures, and Fang Wang’s uncles even patted his shoulder as they left, their eyes full of praise.<br/><br/>“`\t\t\t\t\t\t</div>", "images": {}, "success": true}