{"id": 8, "url": "https://www.novelhall.com/i-became-an-immortal-on-mortal-realm-32879/14234565.html", "title": "Chapter 8 - 8 Chapter 6: Three Cultivation Techniques_2", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 8 - 8 Chapter 6: Three Cultivation Techniques_2</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\t8 Chapter 6: Three Cultivation Techniques_2<br/><br/>Translator: 549690339<br/><br/>Only Fang Meng and the old lady remained in the hall when Fang Wang took a step forward to pay his respects to his grandparents.<br/><br/>“From where did you learn the Immortal Law?” Fang Meng asked, his face breaking into a kind and gentle smile.<br/><br/>Fang Wang replied, “Grandfather, it was Zhou Xue who taught me. She has the guidance of a senior cultivator behind her. Earlier, I had heard her mention that the Fang Residence was in danger of destruction, so I sought her out, and she taught me the Sword Control Technique, which convinced me of her words.”<br/><br/>Since the image of a genius had been established, he better solidify it. It was perfect for explaining!<br/><br/>Fang Meng was momentarily stunned, gripping his cane tightly. Struggling to contain his excitement, he asked, “She said the Fang Residence was in danger of destruction, and it’s only been seven days. Did you have prior knowledge of this matter, or have you only practiced for seven days?”<br/><br/>Fang Wang feigned hesitation before answering, “I practiced for seven days.”<br/><br/>“Good! Good! Very good!”<br/><br/>Fang Meng was overwhelmed with excitement, his body trembling. He even wanted to stand up and embrace Fang Wang, who quickly walked over and held his hand.<br/><br/>“The Fang Family has a successor; we can break through this deadly situation!”<br/><br/>Fang Meng cried tears of joy, old tears streaming down. Fang Wang panicked at once; it was his first time seeing his grandfather cry.<br/><br/>Afterward, Fang Meng began to recount the past.<br/><br/>As a founding hero of the Da Qi Dynasty, Fang Meng certainly knew more than the average citizen did, including information about the Cultivation World. However, for Fang Meng, cultivators were still ethereal beings; his understanding of them was limited, but he was aware of their existence.<br/><br/>He urged Fang Wang to cultivate well.<br/><br/>He even thought about betrothing Zhou Xue to Fang Wang, thinking it would make Fang Wang’s path to cultivation more stable, but Fang Wang declined politely.<br/><br/>What a joke. Zhou Xue was a reincarnated person and a demonic cultivator at that. Such a woman would certainly not prioritize love. If she were to sever emotional ties for the sake of longevity, wouldn’t that be troublesome?<br/><br/>Moreover, having lived a second life, Fang Wang did not want to spend a lifetime with anyone. He sought unencumbered freedom and ease.<br/><br/>Before encountering cultivators, he had prepared to wander the world!<br/><br/>Now that he had encountered the path of cultivation, his desire only grew stronger. In this life, he planned to traverse every mountain and river, witness the world’s splendor, and seek the method to eternal life. He could not allow any person to hold him back.<br/><br/>That night, the grandson and grandfather talked for a long time.<br/><br/>…<br/><br/>The next day at noon, while the Fang Residence was enveloped in sorrow, Southern Hills City fell into turmoil. The Fang Residence had been attacked; so many had died. The citizens under the Fang Family’s protection were naturally afraid, and many gossipers were discussing the events.<br/><br/>Fang Wang left the house to visit Zhou Xue.<br/><br/>The two maids guarding the door promptly paid their respects upon seeing him. One of the maids said, “Young master, the miss has commanded that if you were to come, you may go straight in.”<br/><br/>Last night, Fang Wang and Zhou Xue had fought the demonic Daoist to save the Fang Residence, and word had spread throughout the household. Their relationship, in the eyes of the people of the Fang Residence, had also changed. Last night, the maids had even heard the fourth young master suggesting that the two should marry.<br/><br/>Fang Wang nodded, then pushed the door open and entered, closing the door behind him. He sat down beside Zhou Xue’s bed.<br/><br/>At this moment, Zhou Xue lay in bed, her face pale, her body wrapped in white bandages, appearing severely injured. Hearing footsteps, she opened her eyes to look at Fang Wang.<br/><br/>Fang Wang, however, did not greet her, after all, she was a reborn individual, not a true sixteen-year-old girl.<br/><br/>“Is it possible to take the Fang Family Disciple with us on the path to immortality? We have offended the imperial power, and even if the commotion is great, it will be forgotten one day. Will the killing intent return with a vengeance?” Fang Wang asked, voicing Fang Meng’s expectations.<br/><br/>Zhou Xue retracted her gaze, slowly closed her eyes, and softly said, “The threshold for Cultivation is extremely high, not everyone who wishes to cultivate can do so. However, I do have this intention. This month, I will select disciples with potential to follow us in Cultivation.”<br/><br/>Fang Wang asked curiously, “Where are we going? Can you tell me about the way of Cultivation, such as the Earth Origin Spirit Treasure you mentioned last night?”<br/><br/>“The Cultivation World of Da Qi has Nine Great Sects, hidden deep within mountains and wondrous realms. The sect we’re heading for is Great Abyss Gate, which ranks in the top five among the Nine Great Sects, with a profound foundation. I have a way to get you into the sect.”<br/><br/>Zhou Xue spoke at length, giving Fang Wang a brief introduction to Great Abyss Gate, instilling great anticipation in him for this Cultivation Sect.<br/><br/>If he joined Great Abyss Gate, he would have to find a way to practice the most profound Cultivation Techniques and Spells. With the Heavenly Palace in his mind, he was certain to surpass his fellow Cultivators.<br/><br/>As for Zhou Xue, the reborn individual, he needed to keep up with her pace of becoming stronger and, if possible, surpass her—that would be even better!<br/><br/>“As for the Earth Origin Spirit Treasure, we must first talk about the realms in Cultivation. Above Qi Cultivation is the Soul Sculpting Realm, only after crafting one’s own Lifespirit Treasure can one step into the Soul Sculpting Realm. A treasure resides within the body of a Cultivator, and oftentimes, the grade of the treasure can determine a Cultivator’s talent. The treasures, from low to high, are ranked as Yellow Origin, Mysterious Origin, Earth Origin, and Heavenly Origin, with sub-ranks within each level. I will tell you more about this later,” Zhou Xue said, and then couldn’t help but open her eyes to look at Fang Wang, her eyes full of expectation.<br/><br/>Lifespirit Treasure…<br/><br/>Fang Wang began to imagine what rank his own treasure might achieve.<br/><br/>After chatting for a while, Fang Wang timely made his request, “By the way, could you teach me Cultivation Techniques so that during the month you heal, I can cultivate Spiritual Power? That way, once we enter Great Abyss Gate, I won’t embarrass you.”<br/><br/>A greatly accomplished Sword Control Technique easily killed the Qingyi Daoist; how much stronger would it be if he used Spiritual Power?<br/><br/>Zhou Xue pondered for a moment and said, “Alright, I want to see how good your comprehension is. I will teach you the basic Qi Gathering Method.”<br/><br/>“Wait, can you teach me some more profound Cultivation methods…” Fang Wang tentatively said.<br/><br/>Basic Qi Gathering Method?<br/><br/>Too humble!<br/><br/>Zhou Xue frowned at him, intending to lecture him, but then she thought about the Sword Control Technique Fang Wang had used last night, and other ideas came to her mind.<br/><br/>Fang Wang’s Sword Control Technique had already surpassed the scope of a Qi Cultivation Realm Cultivator; his talent was beyond question and warranted her special cultivation.<br/><br/>“So be it. Since you saved me, I will pass a technique on to you. Although I have many techniques, I can only give you three choices. The first is Spring Autumn Art, an extraordinary ancient art established by the foremost cultivator of Da Qi a thousand years ago, known to extend lifespan and pursue longevity. Reaching great completion, living three thousand years is not difficult. Second is the Devouring Heaven Demonic Art that I acquired in an ancient secret realm. It was the first art I practiced, which allows absorption of others’ Spiritual Power. However, practicing it will reduce lifespan and is prone to Heart Demons; it’s a rocky road of cultivation, but with my guidance, you would progress twice as fast.”<br/><br/>“Third is the Solaris Scripture, the most profound Cultivation Technique I acquired in the mortal world. Before I ascended, I did not manage to master it. I do not know how powerful the Solaris Scripture truly is, but for it, even I, who was already in the Mahayana Realm, nearly died in a dangerous ordeal.”<br/><br/>Having finished, Zhou Xue smiled at Fang Wang, curious to see what he would choose.\t\t\t\t\t\t</div>", "images": {}, "success": true}