{"id": 6, "url": "https://www.novelhall.com/i-became-an-immortal-on-mortal-realm-32879/14234561.html", "title": "Chapter 6 - 6 Chapter 5 He Can'T Be Killed_1", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 6 - 6 Chapter 5 He Can'T Be Killed_1</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\t6 Chapter 5 He Can’t Be Killed_1<br/><br/>Translator: 549690339<br/><br/>“””<br/><br/>“What are you doing here? You’re not his match!”<br/><br/>Zhou Xue said through gritted teeth, seven days after her rebirth, apart from her adoptive parents, she also felt a bit of fondness for Fang Wang and did not wish to see the young man buried here tonight.<br/><br/>Fang Wang cradled Zhou Xue in one arm and performed the Shadowless Step, constantly changing his footing to dodge the golden beams of light attacking him. He didn’t flee directly but instead evaded back and forth in the area.<br/><br/>“I may not be, but are you certain you are now?”<br/><br/>Fang Wang didn’t glance at Zhou Xue in his arms; he calmly replied, keeping his gaze fixed on the Qingyi Daoist standing in the air.<br/><br/>Zhou Xue fell silent, unable to respond.<br/><br/>At that moment, the Qingyi Daoist’s attack ceased, and Fang Wang landed on a broken wall. Zhou Xue naturally slipped from his arm, maintaining a very measured distance from him.<br/><br/>“Is this a spell? The bottom tier of the Cultivation World is this strong, you didn’t deceive me?”<br/><br/>Fang Wang asked in a low voice, staring at the Qingyi Daoist.<br/><br/>The killing power of those golden beams was terrifying. While dodging earlier on, Fang Wang felt an unprecedented sense of danger and was on high alert, not daring to be careless.<br/><br/>Zhou Xue took a deep breath and said, “His realm is indeed the lowest in the Cultivation World, but wielding two magic artifacts, he is considered a first-rate expert within his realm. However, with his Spiritual Power, he can’t continuously use the kind of attack you just saw.”<br/><br/>Upon hearing this, Fang Wang immediately had an idea of the situation.<br/><br/>Under his watchful eye, the high and mighty Qingyi Daoist descended, which seemed to suggest that standing in the air, though cool, was quite draining.<br/><br/>“Who are you?”<br/><br/>The Qingyi Daoist stared intently at Fang Wang and asked in a deep voice.<br/><br/>Fang Wang’s swordplay was different from any martial arts experts he had seen before, even surpassing most Cultivators in the Qi Cultivation Realm. He couldn’t see through Fang Wang’s identity at the moment, but Zhou Xue’s poison made him sure she was a Cultivator.<br/><br/>Fang Wang raised his sword and said, “Shouldn’t one introduce oneself first before inquiring about the identities of others?”<br/><br/>The Qingyi Daoist hearing this, showed a cold smile and said, “Then let me see what makes you dare to resist!”<br/><br/>He suddenly charged towards Fang Wang and Zhou Xue, his speed much faster than the black-clothed persons from before.<br/><br/>Fang Wang didn’t retreat but advanced instead, bringing his sword down on the Qingyi Daoist.<br/><br/>The two moved rapidly like arrows, and in the blink of an eye, they were within seven steps of each other. Fang Wang swung his sword to strike, while the Qingyi Daoist tilted his body and waved his horsetail whisk.<br/><br/>So fast!<br/><br/>Both thought this at the same time. Fang Wang was amazed at the culticator’s quick bodily reactions, while the Qingyi Daoist was astonished by his footwork. What level of Qi Cultivation Realm is this young man at?<br/><br/>Each avoiding the other’s techniques, they unfolded a fierce and swift duel, attacking each other in the courtyard, stirring up dust and stones. In a short span of time, neither could injure the other.<br/><br/>Seeing Fang Wang and the Qingyi Daoist fighting evenly, Zhou Xue was deeply moved; she realized she had underestimated this young man.<br/><br/>“Such strength, he could match up to cultivators at the seventh or eighth level of Qi Cultivation Realm, yet he is merely a warrior. Could it be that he has reached the mythical realms of martial arts?”<br/><br/>Zhou Xue was secretly shocked, having a clear understanding of Fang Wang’s age.<br/><br/>To be so powerful at the age of sixteen…<br/><br/>Such comprehension and talent were too exaggerated!<br/><br/>Even though the paths of martial arts and cultivation are different, there are some similarities, and a prodigy in martial arts won’t be too lacking in talent for cultivation, particularly in terms of comprehension.<br/><br/>Zhou Xue’s appreciation for Fang Wang grew, and at the same time, some of the Fang Residence’s top experts quickly rushed over. When they saw the battle between Fang Wang and the Qingyi Daoist, they all instinctively stopped in their tracks.<br/><br/>Fang Wang, clad in white, was as fast as a specter with his sword gleaming coldly under the night sky, while the Qingyi Daoist, like a crane, seemed slower than Fang Wang but always managed to evade his attacks with ease.<br/><br/>“So fast!”<br/><br/>“Is this speed humanly possible? Is that Young Master Fang Wang?”<br/><br/>“Who would’ve thought that our Thirteenth Young Master’s martial skills were so advanced, I heard from Ah Hu that many experts have been killed by the Thirteenth Young Master.”<br/><br/>“Is that guy a human or a ghost? It feels like he’s floating!”<br/><br/>“Let’s not act rashly to avoid distracting Young Master Fang Wang!”<br/><br/>The experts from the Fang Residence discussed amongst themselves, including Fang Wang’s clan members. They were the most shocked, having never imagined Fang Wang to be so formidable.<br/><br/>The Qingyi Daoist wielded his horsetail whisk, striking Fang Wang’s treasured sword and sending a tremendous force that repelled Fang Wang.<br/><br/>“Without a trace of Spiritual Power, could it be you are merely skilled in martial arts, and you specialize in techniques?” said the Qingyi Daoist in a cold voice.<br/><br/>Fang Wang hadn’t employed True Qi but relied solely on his swordsmanship and footwork to fight. This was his first time battling with such effort, with body and mind taut.<br/><br/>He had underestimated Cultivators, thinking they spent most of their time in meditation and might have physical attributes weaker than warriors. Now, however, after exchanging blows, he had a certain understanding of the Qingyi Daoist’s strength.<br/><br/>The Qingyi Daoist raised his left hand, the Yellow Talisman releasing streaks of golden light towards Fang Wang, who immediately dodged.<br/><br/>More and more top experts from the Fang Residence arrived, including the previously injured Fang Hanyu.<br/><br/>They had all been shocked when they witnessed the Qingyi Daoist using magic artifacts, and now, observing the Yellow Talisman’s miraculous effects from a close distance, they were even more fearful.<br/><br/>“Sorcerer…”<br/><br/>A middle-aged manservant holding a long stick said with a trembling voice, full of fear.<br/><br/>Fang Hanyu wanted to go and support Fang Wang, but was stopped by his father, Fang Zhe. Fang Zhe, with a solemn look, said, “You can’t participate in their battle.”<br/><br/>Waves of shock surged inside him. He had traveled far and wide for many years, visiting many great sects in the martial world, but had never seen such evil arts.<br/><br/>He suddenly remembered a legend he had heard a long time ago.<br/><br/>The legend spoke of cultivators who lived deep within the mountains and five sacred peaks, creators of the martial arts practiced by the ordinary world.<br/><br/>Fang Hanyu watched Fang Wang continuously dodge the golden beams, his footwork and posture filling his heart with complex emotions, admiration mixed with an unwillingness to accept.<br/><br/>Since childhood, he had harbored admiration for his younger cousin because Fang Wang knew so much, always saying things that amazed him. Even though he had left to practice martial arts for many years, Fang Hanyu would often think of his cousin, always feeling that Fang Wang would grow up to be an extraordinary person. He had never imagined, however, that Fang Wang would reach such an exceptional level in martial arts.<br/><br/>What made him feel unwilling was not that Fang Wang was stronger than he, but that he could not be of help to Fang Wang.<br/><br/>Fang Wang quickly evaded the golden beams, closing in on the Qingyi Daoist, who, despite seeing that the Yellow Talisman could not harm Fang Wang, did not panic and maintained his stern expression.<br/><br/>When Fang Wang was less than eight steps away from the Qingyi Daoist, he threw his treasured sword.<br/><br/>His throw was so forceful that the sword almost pierced the Qingyi Daoist as soon as it left his hand; however, with a clang, the sword was deflected.<br/><br/>A flash of yellow light appeared before Fang Wang’s eyes. He saw the Qingyi Daoist’s body burst into a golden glow, like a suit of light armor that deflected his sword.<br/><br/>Upon closer inspection, Fang Wang saw the edge of a yellow talisman at the Qingyi Daoist’s chest burning, with a visible light emanating from it and covering his entire body.<br/><br/>Whoosh! Whoosh! Whoosh…<br/><br/>A series of whizzing sounds filled the air as six silver darts grazed past Fang Wang’s ears, flying straight toward the Qingyi Daoist.<br/><br/>This time, the Qingyi Daoist did not attempt to stand his ground but instead dodged with a flash of movement.<br/><br/>Before he even touched the ground, he rapidly cast a spell, his horsetail whisk stirring up, creating snake-like bolts of lightning out of nowhere, striking unrelentingly towards Fang Wang.<br/><br/>Fang Wang leaped to dodge, as the lightning bolts shattered the silver darts and followed by a crash to the ground, they pierced through the earth with incredible destructive power.<br/><br/>He turned his head to see that Zhou Xue had joined the battle, now confronting the Qingyi Daoist up close, wielding a dagger. Her agile movements made it impossible for the Qingyi Daoist to shake her off.<br/><br/>“She has such skill after being reborn for just seven days…” Fang Wang was secretly astonished.<br/><br/>Before her rebirth, Zhou Xue was just a frail woman confined to her home, but now her skills surpassed those of ordinary top-notch experts.<br/><br/>Could it be that Zhou Xue, like him, had secretly trained in martial arts from a young age?<br/><br/>The Qingyi Daoist unleashed his lightning spell again, and due to their proximity, Zhou Xue, whose agility did not match Fang Wang’s, was hit in the back while dodging, blood spurting out. Then, with a wave of her sleeve, a puff of light green powder spread out, instantly enveloping the Qingyi Daoist.<br/><br/>As Zhou Xue hit the ground, she immediately looked to Fang Wang.<br/><br/>Understanding her intention, Fang Wang executed the Shadowless Step and rapidly advanced. He raised his palm and struck forward, his surging True Qi carrying a dragon’s roar, releasing a dragon-shaped True Qi with immense force that collided with the Qingyi Daoist, sending him flying. The Qingyi Daoist was flung like a broken kite, soaring tens of meters before crashing into the ruins.<br/><br/>“Is that… the True Dragon Palm that once made a formidable name for itself in the martial world?”<br/><br/>Fang Zhe’s eyes widened in incredulous exclamation, while Fang Hanyu beside him was equally moved.<br/><br/>The True Dragon Palm was not an exceedingly rare technique, easily obtainable for those willing to spend money, yet it was extremely difficult to master. In today’s martial world, no one could cultivate the True Dragon Palm to Great Completion.<br/><br/>Fang Wang withdrew his palm, swiftly moving to Zhou Xue’s side. Below her, a pool of blood formed, a sight most tragic.<br/><br/>Without waiting for Fang Wang to speak, Zhou Xue propped up her upper body and pulled out a small paper packet from her embrace, her voice trembling, “A martial artist’s True Qi can’t kill him. Use my specially made poison, sprinkle it on his wounds, and it can continuously dissipate the Spiritual Power within his body …”<br/><br/>Fang Wang didn’t take the poison but instead asked, “If it can’t kill him, can it injure him?”<br/><br/>Zhou Xue frowned and replied, “Of course it can. He is merely a cultivator from the Qi Cultivation Realm. It’s just that, right now, it’s very difficult for me …”<br/><br/>Boom!<br/><br/>Before she could finish her words, a deafening roar came from behind, followed by a rampaging wind.<br/><br/>Fang Wang squinted towards the noise, and Zhou Xue also turned her head, only to see rolling black qi emerging from the ruins while a black banner ascended, surrounded by floating debris like rocks and splinters, with the vague shapes of ghostly souls.<br/><br/>As the black banner soared into the sky, the Qingyi Daoist staggeringly rose to his feet. His hair was disheveled, he was covered in blood, his robes torn to shreds, looking utterly ragged. Those wounds, now openly weeping black blood, were unable to cease. His gaze fixated on Fang Wang, he shouted angrily, “Mortal, how dare you injure me!”<br/><br/>After being struck by the True Dragon Palm, he had fully confirmed that Fang Wang was not a cultivator but just a warrior after all!<br/><br/>The fact that he was injured by a warrior caused the Qingyi Daoist great shame. Burning with rage, he took a step forward, the black banner above his head following him. Waves of ghostly wails filled the air, plunging the Fang Residence into a night of terror.<br/><br/>“That’s the Soul Burning Banner, you must not come into contact with its Ghost Qi, or it will seize your mind and soul, at its mercy!”<br/><br/>Zhou Xue grit her teeth and spoke urgently, while also racking her brains for a strategy.<br/><br/>“And you, you venomous girl, what poison did you sprinkle on me? Very well, I shall repay it a hundredfold!” The Qingyi Daoist, eyes filled with viciousness, glared at Zhou Xue. His body trembled with poison blood oozing from his wounds, evidently enduring pain beyond ordinary imagination.<br/><br/>Fang Wang watched as the other’s unsteady gait became more pronounced and his expression grew exceedingly dangerous. He slowly raised his right hand.<br/><br/>“If you can be injured by a mortal, it proves you are nothing but a mortal yourself.”<br/><br/>Fang Wang jeered, his voice ringing out clearly, fueling the killing intent in the Qingyi Daoist’s eyes.<br/><br/>The Qingyi Daoist said icily, “Very well, I won’t let you die so easily, I will flay your skin, draw your tendons, torment your soul, so that …”<br/><br/>As he spoke, he moved closer to Fang Wang and Zhou Xue, but before he could finish, Fang Wang’s right hand suddenly raised his index and middle fingers together, using them as a sword, and pointed at the Qingyi Daoist from afar.<br/><br/>The Qingyi Daoist wore a mocking smile, but then his pupils suddenly contracted, and he instinctively turned his head to see the treasured sword that had been knocked away earlier suddenly shooting up from the ground, turning into a streak of cold light that moved at a speed imperceptible to the naked eye.<br/><br/>The severely injured Qingyi Daoist had no time to evade.<br/><br/>Bang —<br/><br/>The treasured sword struck from behind the Qingyi Daoist, shattering his skull, the sword light sparkling, then flying in front of Fang Wang to stop, hovering in mid-air. Then, it swiftly turned around, the hilt facing Fang Wang’s right hand, as if it were a living entity.<br/><br/>This scene left Zhou Xue with a stunned expression, and Fang Wang’s kinsmen from a distance watched his treasured sword, all wearing faces as if they’d seen a ghost, completely dumbfounded.<br/><br/>The Fang Residence fell into silence!\t\t\t\t\t\t</div>", "images": {}, "success": true}