{"id": 1, "url": "https://www.novelhall.com/i-became-an-immortal-on-mortal-realm-32879/14234555.html", "title": "Chapter 1 - 1 Chapter 1 Immortal Venerable Reborn_1", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 1 - 1 Chapter 1 Immortal Venerable Reborn_1</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\t1 Chapter 1 Immortal Venerable Reborn_1<br/><br/>Translator: 549690339<br/><br/>The setting sun dipped below the horizon, casting the last rays of dusk upon Southern Hills City. The city walls stood tall, covered in green moss at the corners, while citizens, merchants, and carriages queued to enter the gates. Inside, the streets were a spider’s web of activity with inns, shops, and willow-lined alleys bustling with life. Children frolicked in the lanes, while hawkers shouted to sell their crafts on the street corners. Jianghu drifters drew crowds with their gong and drum performances, their feats of skill captivating the onlookers. Wisps of cooking smoke rose from households, blurring the twilight.<br/><br/>At sixteen, Fang Wang stepped through the gates of the Fang State Duke’s Mansion. Clothed in a white garment that clung to his body, his bearing was both scholarly and heroically youthful. The servants at the gate greeted him with smiling faces, and he nodded back without any hint of pretension.<br/><br/>“Shadowless Step really is extraordinary. From now on, nobody can harm me within five steps.”<br/><br/>A smile spread across Fang Wang’s face as his Inner Strength reached a legendary realm in the martial world. With proficiency in first-class swordsmanship, palm techniques, and footwork of the present age, he felt invincible.<br/><br/>After all, he was only sixteen!<br/><br/>Sixteen years after his reincarnation, he had reached the pinnacle that many strive for their entire lives, and now he could truly enjoy life.<br/><br/>Full of anticipation for the future, Fang Wang walked on. The servants he passed greeted him, calling him by his title, the Thirteenth Young Master.<br/><br/>Fang Wang’s grandfather, Fang Meng, was a founding hero of the Da Qi Dynasty, holding the noble rank of a second-grade duke, while his father Fang Yin was the youngest son of Fang Meng. Among the third generation, Fang Wang was the thirteenth in age, hence his title.<br/><br/>In this ancient-like dynasty, the atmosphere within the Fang State Duke’s Mansion was harmonious, without much deception or treachery, perhaps due to Fang Meng’s powerful influence.<br/><br/>With the connections and prestige of the Duke’s Mansion, Fang Wang started to collect martial arts secrets since the age of twelve. After four years of training, he managed to emit Inner Strength from his body, strong as an elephant, but no one knew this; they merely thought he was another young master of Fang Residence, dreaming of the jianghu.<br/><br/>Entering a garden, Fang Wang saw a group of maids huddled together, no doubt gossiping about trivial Fang Residence affairs. With his exceptional hearing, he could make out their conversations despite being ten yards away.<br/><br/>“Zhou Xue has gone mad. Today, she’s been warning all the young masters around that Fang Residence is about to be annihilated.”<br/><br/>“I heard it too. She’s got guts, visiting all the masters in the mansion. Now, her father, the Fourth Master, has locked her in her room.”<br/><br/>“Who dares to annihilate our Fang Residence? Even the current emperor wouldn’t dare!”<br/><br/>“Shush, don’t say such things.”<br/><br/>“Fourth Master is so fond of his adopted daughter Zhou Xue, she’ll likely be released in a few days.”<br/><br/>At the mention of ‘annihilation,’ Fang Wang’s heart skipped a beat.<br/><br/>Fang Residence, facing annihilation?<br/><br/>After listening for a while and pondering the situation, Fang Wang decided to investigate. With nothing else pressing to do, and Zhou Xue’s abnormal behavior hinting at a reason, he made his way towards her courtyard.<br/><br/>The Fourth Uncle Fang Zhen had joined the army when he was young and almost lost his life on the battlefield. Fortunately, Zhou Xue’s father sacrificed himself to save him. Even so, Fang Zhen was left with a lifelong disability. After leaving the army, he took his savior’s ashes back to his hometown. There, Zhou Xue’s mother, bedridden by illness, learned of her husband’s death, despaired, and passed away. Fang Zhen had no choice but to take the infant Zhou Xue back to Fang Residence and adopt her as his daughter.<br/><br/>Zhou Xue was an introverted girl who seldom left her courtyard. Growing up, Fang Wang had only seen her a few times, remembering her as a shy young girl about the same age as him, delicate and pretty.<br/><br/>Since the Fourth Uncle was extremely protective, Zhou Xue had never been bullied, so it seemed unlikely for her to go mad without cause. Could there really be a threat of annihilation?<br/><br/>A sense of dread weighed on Fang Wang. What kind of force could bring about the annihilation of the Fang State Duke’s Mansion?<br/><br/>Could it be the Emperor’s doing?<br/><br/>The Duke’s Mansion was extensive, occupying one-fifth of Southern Hills City, virtually a “city within a city.” The Fang family had thousands of household guards; sometimes, Fang Wang would see his eldest uncle Fang Xing training them in martial arts.<br/><br/>Could such a formidable Fang Residence be annihilated?<br/><br/>Fang Wang picked up his pace. Activating his Inner Strength, he concentrated with Condensation and stepped with Mystifying Step, reaching Zhou Xue’s window without making a sound, carefully eavesdropping.<br/><br/>The room was silent, but Fang Wang’s acute hearing could detect Zhou Xue’s breathing, rapid and clearly not yet calm.<br/><br/>A moment passed.<br/><br/>“Alas, to think that I, an Immortal Venerable, have returned to my youth, yet am unable to alter my family’s fate… Is Heaven playing tricks on me? If only I had one more month, it might not have come to this…”<br/><br/>Fang Wang heard Zhou Xue’s faint sigh, too soft for ordinary ears to discern.<br/><br/>Returned to her youth?<br/><br/>Rebirth?<br/><br/>And… Immortal Venerable?<br/><br/>Fang Wang’s heart trembled. Having heard many legends of Immortal Gods since his own reincarnation, he had yet to hear of rebirth. Her words were so convincing. Could it be true?<br/><br/>He couldn’t take the chance; after all, he himself was a reincarnated soul. Encountering someone reborn was not so far-fetched.<br/><br/>The thought of Fang Residence being wiped out made his heart feel tight. He adored this life, his parents who treated him so well, his uncles who were kind to him, and he cherished Fang Residence. He didn’t want to see it fall.<br/><br/>Afterward, Zhou Xue fell silent, no longer murmuring to herself. The room returned to calm. Hesitating for a moment, Fang Wang forcefully opened the window and leaped inside.<br/><br/>Zhou Xue was not startled by his entry; she simply sat at the table, calmly looking at him.<br/><br/>She wore a green dress, her makeup meticulous despite her slightly disheveled hair. Still, she exuded grace and beauty, maintaining the elegance of a well-bred lady.<br/><br/>As their eyes met, the room lapsed back into silence.<br/><br/>“Your agility is impressive. I sensed nothing. Who are you?” Zhou Xue broke the stillness, asking him.\t\t\t\t\t\t</div>", "images": {}, "success": true}