{"id": 17, "url": "https://www.novelhall.com/i-became-an-immortal-on-mortal-realm-32879/14234583.html", "title": "Chapter 17 - 17 Chapter 15 Illusionary Realm Assessment_1", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 17 - 17 Chapter 15 Illusionary Realm Assessment_1</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\t17 Chapter 15 Illusionary Realm Assessment_1<br/><br/>Translator: 549690339<br/><br/>“Not yet, I didn’t expect Miss Gu’s cave dwelling to be right beside mine,”<br/><br/>Fang Wang looked at Gu Li, standing at the entrance of her cave dwelling, and answered with a smile. Under the sunshine, Gu Li, dressed in a Great Abyss Gate Dao robe without a veil, appeared exceptionally captivating, like a celestial fairy.<br/><br/>Inside Fang Wang’s cave dwelling was a set of Dao robes for direct disciples, which seemed almost identical to the one Gu Li was wearing. Could it be that Gu Li had also become a direct disciple?<br/><br/>Gu Li gazed at Fang Wang and said softly, “I chose this place next to you on purpose. I’ve successfully reached the Soul Sculpting Realm and have become a direct disciple. From now on, you’ll be my senior brother.”<br/><br/>Direct disciple?<br/><br/>So soon?<br/><br/>Fang Wang was surprised inwardly but maintained his composure on the surface.<br/><br/>Seeing him unaffected, Gu Li’s hand tightened slightly within her sleeve. She strove to stabilize her emotions, reminding herself not to be hasty.<br/><br/>“Master told me you were only at the seventh layer of the Qi Cultivation Realm when you joined. It has been only several months, and you’ve already reached the ninth layer. It seems you’ll soon be undergoing Spiritual Refinement. Before that happens, can we spar once more?” Gu Li’s face turned slightly red as she spoke.<br/><br/>Fang Wang looked at her skeptically.<br/><br/>A Soul Sculpting Realm fighting a Qi Cultivation Realm?<br/><br/>What a joke!<br/><br/>How shameless!<br/><br/>Fang Wang was about to refuse when he heard Gu Li continue, “I won’t use my Lifespirit Treasure, I’ve just made a breakthrough in my Five Sacred Sword Technique and I’d like to spar with you. Don’t worry, we’ll find a secluded place so word won’t spread.”<br/><br/>Fang Wang found this to be troublesome at first, but now he was suddenly keen to experience the might of the Soul Sculpting Realm. Inside the Great Abyss Gate, there wouldn’t be a murderous intent.<br/><br/>“Where to?” Fang Wang asked.<br/><br/>Gu Li’s eyes lit up as she said, “Let’s go to the forest at the bottom of the mountain. Sparring is a common occurrence, and as long as it’s not fueled by hatred, the Great Abyss Gate won’t forbid it. We won’t use magic swords but spar with wooden swords instead.”<br/><br/>Fang Wang wanted to say that wooden swords and magic swords could both kill, but he didn’t want to waste words. It was actually a good opportunity to test the Jinghong Divine Sword Art!<br/><br/>“Let’s go, to the forest!”<br/><br/>“Okay!”<br/><br/>The two of them immediately headed down the mountain, with Gu Li leading the way. They didn’t use the Sword Control Technique to fly. From above, the two figures walking side by side on the mountain path looked like a pair of celestial beings.<br/><br/>Along the way, Gu Li made small talk with Fang Wang, and upon hearing that he had been cultivating ever since he joined, she began to tell him about recent interesting events within the Great Abyss Gate.<br/><br/>Fang Wang, having just experienced two hundred years of darkness, was also interested in these tales, so he listened on, occasionally interjecting with questions.<br/><br/>“By the way, is Zhou Xue a member of your family?” Gu Li suddenly asked.<br/><br/>Fang Wang nodded and said, “Yes, what about her?”<br/><br/>He wasn’t worried that Zhou Xue would encounter trouble. After all, she was a reborn individual; not causing trouble to others was already good enough.<br/><br/>“She passed the sect’s Illusionary Realm test and received the inheritance of the previous Sect Leader. Her fame has skyrocketed. Once she completes Spiritual Refinement, even if her Lifespirit Treasure has average quality, she’ll become a direct disciple,” Gu Li remarked with a sigh.<br/><br/>Illusionary Realm test?<br/><br/>Fang Wang hadn’t heard Zhou Xue mention it, but it was within reason that she would encounter such an opportunity. Being reborn was the greatest advantage. With so many opportunities in her mind, Zhou Xue could surely choose an even stronger path than in her previous life.<br/><br/>Since joining the Great Abyss Gate, the two had lost contact, but Fang Wang remembered the lineage she had chosen for herself, the first lineage.<br/><br/>And so, Fang Wang and Gu Li chatted leisurely as they made their way towards the forest.<br/><br/>After the time it took an incense stick to burn.<br/><br/>The two entered the forest, where the sparse trees made it a suitable place for a match, and the dense foliage overhead concealed them from the prying eyes of passing disciples.<br/><br/>Fang Wang and Gu Li stood three Zhang apart. He lifted his right hand and said, “Come on, this time, I won’t use the Sword Control Technique.”<br/><br/>The Sword Control Technique!<br/><br/>At the mention of these three words, Gu Li’s expression changed. The technique that defeated her before was indeed the Sword Control Technique.<br/><br/>Being defeated by a sophisticated swordsmanship, she could accept that, but to be beaten by the Sword Control Technique…<br/><br/>And at that time, her opponent was only at the seventh layer of the Qi Cultivation Realm!<br/><br/>Gu Li took a deep breath and immediately drew out two wooden swords, tossing one to Fang Wang and holding the other in her right hand.<br/><br/>Fang Wang caught the wooden sword, examined it, and intended to refuse to fight with it. However, he didn’t want to insult her, so he decided to go along with it.<br/><br/>This was a good strategy indeed. He had always posed as a swordsman, yet he didn’t need a sword to execute the Jinghong Divine Sword Art. Perhaps this could be life-saving in a critical moment later on.<br/><br/>As Fang Wang held the wooden sword, he pointed it at Gu Li. With his left hand, he extended two fingers and ran them along the sword blade. Three streams of Sword Qi overflowed from the blade, quickly condensing into three sword shapes that hovered in front of him.<br/><br/>This sight caused Gu Li’s brows to furrow, and she was inwardly shocked. What swordsmanship was this?<br/><br/>Taking a deep breath, Gu Li immediately executed her family’s ultimate technique, the Five Sacred Sword Technique. She swung her sword rapidly, the moves fierce and her figure so fast that afterimages appeared. In an instant, it looked as though five people were wielding swords simultaneously, and the tyrannical Sword Qi swept towards Fang Wang like a windstorm, cutting fine notches into the passing trees with extreme sharpness.<br/><br/>Fang Wang, holding the sword in his right hand, twisted his wrist and suddenly thrust forward. The three sword shapes turned into three streaks of cyan frost, lunging forward.<br/><br/>Boom!<br/><br/>The two Sword Qi forces collided, and the seemingly strong Five Sacred Sword Qi was instantly shredded by the three cyan streaks. Gu Li’s hair was blown about, and her eyes widened instinctively in shock.<br/><br/>At that moment, she had the same sense of dread as she had when competing for the position of direct disciple.<br/><br/>Fortunately, the three cyan streaks dissipated just before reaching her. Yet, even so, the powerful sword streaks made her heart skip a beat.<br/><br/>Fang Wang sheathed his sword, inwardly relieved that his Jinghong Divine Sword Art had reached Great Perfection; otherwise, it would have been difficult to restrain the sword just now.<br/><br/>The surrounding forest shook violently, leaves falling like rain, surrounding Gu Li in this shower of leaves as she fell into a daze.<br/><br/>Worried that she might make another request, Fang Wang spoke up, “Miss Gu, your swordsmanship is very strong, and you are the most formidable Sword Cultivator I have ever fought. Let’s spar again in the future; I need to return to my cultivation now.”<br/><br/>Having said that, he leaped up and, stepping on his wooden sword, swiftly flew out of the forest.<br/><br/>At the same time.<br/><br/>A male disciple flew over, noticing the commotion below in the woods, and was about to check it out when he saw Fang Wang flying out on his sword. He was immediately thrilled and hurried over.<br/><br/>“Brother Fang, it’s rare to see you!”, the male disciple intercepted Fang Wang, speaking enthusiastically.<br/><br/>Fang Wang felt that he looked somewhat familiar and replied politely, “I was in closed-door cultivation previously and have come out for a stroll today.”<br/><br/>“Brother Fang, do you remember me? I’m Zhou Bo!”<br/><br/>“Of course I remember…,” he replied.<br/><br/>In the woods.<br/><br/>Gu Li took a deep breath. This was not her first defeat, and the blow was not as great as before, especially considering that she had gained Fang Wang’s approval.<br/><br/>Wait a second!<br/><br/>That young man hasn’t been cultivating for a year yet, how many sword cultivators could he have possibly met?<br/><br/>Gu Li recalled her master Yang Yuanzi’s lament; her face instantly turned unpleasant, with no anger in her heart, only boundless confusion.<br/><br/>She took a deep breath, then controlled her sword to fly away.<br/><br/>Fang Wang hurriedly dealt with Zhou Bo and left. As Zhou Bo was admiring Brother Fang’s dedication to arduous cultivation, he followed and saw Gu Li fly out of the forest.<br/><br/>Ruffled by the impact of the Jinghong Divine Sword Art, Gu Li’s hair was slightly disheveled, which startled Zhou Bo.<br/><br/>Without giving him any heed, Gu Li quickly flew toward the mountain.<br/><br/>Zhou Bo withdrew his gaze, standing on his flying sword, and muttered in a low voice, “Brother Fang truly has a taste for excitement.”<br/><br/>…<br/><br/>After landing, Fang Wang leaned the wooden sword against the mountain gate of Gu Li’s cave abode before swiftly returning to his own.<br/><br/>Having struck a blow to a young talent of the heavens, he feared endless trouble, but there was nothing he could do about it as it was Gu Li who had sought him out.<br/><br/>Sitting crossed-legged on the white jade bed, Fang Wang reflected on the previous battle, finding the Soul Sculpting Realm not so impressive, at least not much compared to him.<br/><br/>Perhaps the Lifespirit Treasure significantly enhances combat power in the Soul Sculpting Realm.<br/><br/>Fang Wang didn’t dwell on it and continued to cultivate in Qi Gathering, knowing that reaching the ninth level of the Qi Cultivation Realm didn’t mean he could directly assault the Soul Sculpting Realm. Between the ninth level of Qi Cultivation and the Soul Sculpting Realm lay a nameless realm, which also existed in martial arts. Some called it Opportunity, some called it Great Perfection; in any case, he just wanted to reach the Soul Sculpting Realm as quickly as possible.<br/><br/>Outside the cave abode.<br/><br/>Gu Li looked at the wooden sword leaning against the mountain gate, biting her lip, picked up the sword, and walked back into her own cave abode.<br/><br/>In the blink of an eye.<br/><br/>Another month had passed.<br/><br/>Fang Wang’s spiritual power had doubled, and amidst the mists, he faintly sensed the sign of a breakthrough but found that his cultivation could still grow. So, he continued to practice, wanting to wait until he could no longer improve before attempting the breakthrough.<br/><br/>One day, a voice came from outside the cave:<br/><br/>“Fang Wang, are you there?”<br/><br/>Upon hearing this, Fang Wang immediately got up and went over. He opened the mountain gate, and as the sunlight poured in, he saw a long-missed face.<br/><br/>Zhou Xue!<br/><br/>After several months, Zhou Xue, dressed in the robes of the Great Abyss Gate disciples, looked even more beautiful. The spirit and vigor in her brows were something Gu Li didn’t possess; she was spirited and sharp, while Gu Li was merely cold-faced.<br/><br/>Zhou Xue stepped directly into the cave, walking past Fang Wang, and gestured, “Close the door!”<br/><br/>Fang Wang immediately closed the mountain gate of the cave abode and then followed Zhou Xue’s steps.<br/><br/>“Why have you come?” Fang Wang asked with surprise.<br/><br/>Zhou Xue huffed, “You’ve been in closed-door cultivation all this time, trying to sever ties with the Fang Family? The other disciples have already met and established connections, only you have not stepped out of the third vein. I had no choice but to come find you.”<br/><br/>Fang Wang explained, “I only wish to reach the Soul Sculpting Realm sooner.”<br/><br/>“The ninth level of Qi Cultivation, not bad. It seems you haven’t neglected your cultivation. I was just worried that girl from the Gu Family might entangle herself with you, and you wouldn’t be able to contain the restlessness of youth and sink into it.”<br/><br/>While speaking, Zhou Xue sat down at the stone table.<br/><br/>Fang Wang helplessly replied, “How could that be? I am the thirteenth son of the Fang Family; if I was so easily moved, all those pretty maids in the house, the daughters of noble families in the city, would have already been mesmerized by me.”<br/><br/>Zhou Xue huffed, “I hope so. I came today to bid you farewell; I’m planning to leave, and I probably won’t return for three to five years.”<br/><br/>“That long? What for?”<br/><br/>Fang Wang sat down and curiously asked, wondering how to fish for some peerless skills.<br/><br/>Zhou Xue looked at him and said, “To seize a great opportunity and incidentally investigate this Soul Burning Banner in my hand. If I don’t settle this matter, I won’t be at peace.”<br/><br/>“Take me with you?”<br/><br/>“With such good talent as yours, just focus on your cultivation. A genius like you should concentrate on practice. I’ve seen too many talented geniuses who thought they were strong enough only to be killed by old monsters and those with great fortune once they went out, becoming pitiful figures in someone else’s story. Besides, I operate better alone.”<br/><br/>“Alright then…”<br/><br/>Fang Wang was just being polite with a casual comment; after all, he couldn’t brazenly beg Zhou Xue to take him along, and indeed, he didn’t want to go out either. He wasn’t quite at the stage of seeking opportunities outside yet.<br/><br/>But still…<br/><br/>How should he broach the subject?<br/><br/>Zhou Xue teased with a chuckle, “What now? You want to ask me for cultivation techniques and spells?”\t\t\t\t\t\t</div>", "images": {}, "success": true}