{"id": 14, "url": "https://www.novelhall.com/i-became-an-immortal-on-mortal-realm-32879/14234577.html", "title": "Chapter 14 - 14 Chapter 12 Initiation And Direct Transmission_1", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 14 - 14 Chapter 12 Initiation And Direct Transmission_1</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\t14 Chapter 12 Initiation and Direct Transmission_1<br/><br/>Translator: 549690339<br/><br/>“Who are you?”<br/><br/>Gu Li stared at Fang Wang, her delicate brows tightly knit as she sized him up. Anyone daring to step forward at this moment must be extraordinary. Could she have underestimated him, and this youth actually had a significant background?<br/><br/>Everyone scrutinized Fang Wang, including the Greedy Sleeper.<br/><br/>Fang Wang said calmly, “My name is Fang Wang. How about we have a friendly contest first? The winner will have the right to challenge everyone else alone. What do you say?”<br/><br/>As soon as he spoke, some people began to hoot. Everyone present came from a cultivation family and, although they hesitated to take the initiative, they were excited to see someone challenging Gu Li’s authority.<br/><br/>Most people were wary of the reputation of the Luo Bei Gu Family, but the rest were merely cautious, fearing that they might not even qualify to be a sword-carrying disciple if they contested for a direct disciple position too rashly, potentially being overwhelmed before they could display their strength in the face of a fifty-one person siege.<br/><br/>The Greedy Sleeper stood by, twirling his beard with a look of enjoyment on his face. He showed no sign of intervening.<br/><br/>Gu Li stepped forward, pulling a thin sword from behind her back with two fingers wide and four feet long, the blade gleaming with a cold light.<br/><br/>“Then let’s give it a try!” Gu Li said firmly, raising her sword toward Fang Wang.<br/><br/>Fang Wang raised his right arm and lifted the flying sword in his hand, but he quickly released it, and the flying sword hovered in mid-air.<br/><br/>Gu Li narrowed her eyes and immediately swung her sword, unleashing a slash with powerful, unstoppable sword Qi, stirring up clouds of dust as it advanced toward Fang Wang.<br/><br/>With a swift wave of his right hand, Fang Wang’s flying sword erupted with terrifying speed, a cold gleam that tore through the approaching sword Qi and dispelled the turbulent air, stopping inches from Gu Li’s forehead in virtually no time.<br/><br/>The blast of the sword wind blew off Gu Li’s bamboo hat, tearing away her veil as well, revealing a stunningly beautiful face, which at the moment wore an expression of shock.<br/><br/>Looking at the flying sword suspended before her face, Gu Li stiffened, her pupils reflecting the tip of the sword like twinkling stars emitting a cold light, cold sweat beading on her forehead.<br/><br/>Everyone was startled, including Zhou Xue, who couldn’t help but raise an eyebrow.<br/><br/>“It seems I was right about him, but this kid’s Sword Control Technique…”<br/><br/>Based on Fang Wang’s performance that night, Zhou Xue felt that his real strength was not limited to what his cultivation level showed, which was why she had pushed him forward. Fang Wang’s mastery of the Sword Control Technique was a pleasant surprise to her, that speed was something even some cultivators in the Soul Sculpting Realm might not achieve.<br/><br/>Indeed, back then Fang Wang used an ordinary sword, but now he had a magic sword in his hand.<br/><br/>However, this magic sword was of the most common variety, yet he managed to wield such power with it. Just how high was this kid’s potential?<br/><br/>The Greedy Sleeper was also shocked, staring intensely at Fang Wang, his eyes practically shining.<br/><br/>“What domineering control, such fierce speed, to be able to stop instantly, even I almost didn’t react in time.” The Greedy Sleeper was inwardly alarmed, thinking that if Gu Li died here, it would cause great trouble.<br/><br/>The Luo Bei Gu Family was not one to be provoked lightly!<br/><br/>He had to stay alert, watching Fang Wang closely, fearing the young man might strike too hard.<br/><br/>The Tai Yuan Sect Disciples behind him all wore expressions as if they had seen a ghost. Was this kid really in the Qi Cultivation Realm?<br/><br/>Fang Wang did not look at Gu Li, but scanned the others and asked, “I’m here to be a candidate for direct disciple, does anyone object?”<br/><br/>No one dared to respond, all looking at him as if facing a formidable enemy, even silently taking out their magic artifacts.<br/><br/>Zhou Xue’s lips curved into a small smile, thinking to herself, “This kid’s tenacity is impressive. He seems reserved usually, yet he has such presence in a moment of contention. What heights could he have reached in his previous life if he hadn’t died on the night of the massacre?”<br/><br/>As she thought, she also took out a magic artifact, which was the Yellow Talisman previously used by the Qingyi Daoist.<br/><br/>Fang Wang caught sight of this action and his heart skipped a beat. You’re not going to get serious, are you?<br/><br/>Hey!<br/><br/>We’re on the same side!<br/><br/>Fang Wang’s right hand made an inward twist, and the flying sword that hovered in front of Gu Li’s forehead sharply retracted, landing back into the palm of his hand.<br/><br/>Gu Li’s heart pounded like a drum as she looked at Fang Wang, seeming dazed.<br/><br/>At that moment, she felt the presence of death. Had he wanted to kill her, she would undoubtedly not have been able to dodge it.<br/><br/>Why was the gap between them so large?<br/><br/>She hadn’t even had the chance to use her Five Sacred Sword Technique…<br/><br/>At that moment, she recalled her father’s words, “The Tai Yuan Sect has the potential for greatness, and exceptional individuals are bound to emerge. Once there, you must not be careless.”<br/><br/>Fang Wang paid no attention to Gu Li’s thoughts. Seeing the others shifting their positions to encircle him, he knew that relying solely on the Sword Control Technique was insufficient for the current situation.<br/><br/>Deciding this, he stabbed the flying sword he held into the ground and faced the encirclement empty-handed.<br/><br/>Madness!<br/><br/>This was the sentiment shared by all. Just as someone was about to lose patience, Fang Wang raised his right hand, palm facing downward.<br/><br/>Boom!<br/><br/>A domineering aura burst forth from Fang Wang, dust swirling from beneath his feet. Behind his head, three fireballs materialized, resembling miniature suns, as his robes billowed and his expression turned stern.<br/><br/>“This is…”<br/><br/>“How is this possible!”<br/><br/>The faces of both the Greedy Sleeper and Zhou Xue showed astonishment, the former pleasantly surprised, the latter purely shocked.<br/><br/>Solaris Scripture!<br/><br/>Zhou Xue’s claim that she had not mastered it before ascending was a bluff to intimidate Fang Wang, when in fact she had cultivated the Solaris Scripture to the sixth level, only to give it up later due to other reasons.<br/><br/>Just at the sixth level, it took her decades. How long has Fang Wang been cultivating?<br/><br/>Looking at the three flames behind Fang Wang’s head, it was clear that he hadn’t just mastered the first level. She suddenly suspected that Fang Wang might have reached the seventh level, which she had not attained.<br/><br/>No wonder this kid’s cultivation has grown so rapidly. He has even progressed the Solaris Scripture to such an extent, and it’s only been a little over a month…<br/><br/>Such a genius was actually born in Da Qi. Zhou Xue suddenly felt the power of destiny. Perhaps an unseen force was influencing the destiny of the Fang Family.<br/><br/>In this life, since Fang Wang survived, the times were about to change.<br/><br/>Although Zhou Xue found it unbelievable, it was not beyond her acceptance. After all, she had ascended and had seen even more monstrous beings.<br/><br/>“Attack!”<br/><br/>The man in black clothes wearing a bamboo hat took the lead. As he spoke, he fiercely slapped the ground. The book trunk on his back opened, and a hail of black arrows shot towards Fang Wang.<br/><br/>The others immediately deployed their spells, all opting for long-range attacks. Even Zhou Xue made her move, her Yellow Talisman bursting into dozens of golden beams of light.<br/><br/>In an instant, multicolored lights enveloped Fang Wang.<br/><br/>Fang Wang’s eyes narrowed, and with a fierce clench of his right fist, the three fireballs behind him burst open, transforming into a roaring sea of flames that swept away, scattering the incoming spells and magic artifacts from all directions with a spectacular firewall.<br/><br/>The next second, Fang Wang, utilizing Shadowless Step, broke out of the encirclement. As a ninth-level Great Perfection practitioner of the Solaris Scripture, he no longer feared any flames. In just three steps, he reached a cultivator.<br/><br/>He struck with his palm as quickly as the wind and with the momentum of thunder.<br/><br/>Bang!<br/><br/>The cultivator was directly sent flying, vomiting blood in midair.<br/><br/>Fang Wang turned around with a sweeping kick aimed at the female cultivator beside him. He wasn’t just a cultivator, but also a martial artist. His physical body reaction was extremely fast. With spiritual power condensed on his right leg, he kicked her directly in the face, causing her to faint on the spot.<br/><br/>He continued his onslaught towards the next person. He had to defeat all his opponents in the shortest time possible because his spiritual power was limited and he couldn’t maintain such intensity for long.<br/><br/>The Solaris Spiritual Power of the Solaris Scripture was extremely domineering. Fang Wang used the Solaris Spiritual Power to execute the True Dragon Palm, not producing a dragon-shaped True Qi, but rather a magnificent fire dragon that rampaged forth, crushing several cultivators.<br/><br/>The man in black with the bamboo hat attempted to sneak attack Fang Wang from behind, hoping to catch him off guard. However, Fang Wang dodged with the Shadowless Step, causing the man’s staff to hit nothing.<br/><br/>Fang Wang turned around and hit him with a True Dragon Palm. Although he dodged, the cultivators behind him had no such luck.<br/><br/>Several more were sent flying, their bodies ablaze.<br/><br/>The Tai Yuan Sect Disciples watching the battle lent a hand to rescue these flaming new disciples. To their horror, they found the fire difficult to extinguish, forcing them to use spells.<br/><br/>Fortunately, the flames suddenly disappeared, allowing them to breathe a sigh of relief.<br/><br/>That was Fang Wang’s doing. As a ninth-level Great Perfection master of the Solaris Scripture, he could control the Solaris True Fire to its utmost limits. He was also wary of burning these people to death.<br/><br/>In less than ten breaths, already half of the participants had lost their ability to fight. The remaining cultivators all leapt back, not daring to let him get close.<br/><br/>Fang Wang was swift like an arrow, continuously seeking targets. His True Dragon Palm was too overwhelming; no one could withstand its edge. When Zhou Xue appeared in front of him, Fang Wang did not hold back. The two acted as if they didn’t know each other.<br/><br/>Zhou Xue actually exchanged palms with him!<br/><br/>Boom—<br/><br/>Upon their palms meeting, a fierce wind arose. Fang Wang frowned; he felt a sinister spiritual power that was like a venomous snake trying to erode his Solaris Spiritual Power. Thankfully, his Solaris Spiritual Power was strong enough.<br/><br/>Greedy Sleeper could not help but look toward Zhou Xue, his eyes lighting up as he thought to himself that here was another genius.<br/><br/>He immediately counted Zhou Xue among the sword-wielding disciples.<br/><br/>No sooner had this thought crossed his mind than Zhou Xue was sent flying, vomiting blood and falling several meters away, struggling to get up after several attempts.<br/><br/>Fang Wang truly admired her; her acting skills were naturally flawless.<br/><br/>From that exchange of palms, he could almost be certain that Zhou Xue was not weaker than him.<br/><br/>On reflection, it made sense. Zhou Xue couldn’t possibly have passed on her strongest cultivation technique to him, and if he were in her position, he wouldn’t cultivate someone stronger than himself, either.<br/><br/>One might care for one’s kin but merely seeking their betterment, not going all out to the point of losing control over their growth.<br/><br/>With Zhou Xue defeated, the rest were no match for him. The majority were in the Qi Cultivation Realm between the fifth and eighth levels. Only three people had reached the ninth level of the Qi Cultivation Realm, including Gu Li and the black-clothed man.<br/><br/>Soon, only the black-clothed man was left fighting against Fang Wang. The man’s agility was extraordinary, making it difficult for Fang Wang to hit him for a while.<br/><br/>The black-clothed man felt the same, even more frustrated. His spells dissipated upon approaching Fang Wang, neutralized by the fireballs behind Fang Wang’s head, ineffective. After a dozen or so exchanges, Fang Wang’s True Dragon Palm struck from a tricky angle, catching the black-clothed man off guard, who instinctively countered with a palm.<br/><br/>With that exchange, he was defeated!<br/><br/>Falling to the ground, the black-clothed person clutched his chest, coughing up a mouthful of blood, losing the ability to fight.<br/><br/>Fang Wang turned to look at Gu Li, who had not made a move and was watching from a distance. Feeling his gaze, she shook her head slightly, indicating her surrender.<br/><br/>“Good! Very good!”<br/><br/>Greedy Sleeper laughed aloud, shouting, “Fang Wang, you are promoted to a direct disciple, the first in the history of the Great Abyss Gate to achieve this from day one!”<br/><br/>His voice echoed under the firmament, and the Tai Yuan Sect Disciples watching the battle looked at Fang Wang with complex gazes.<br/><br/>The Great Abyss Gate valued not only the talent for cultivation but also for combat, and these two were often inseparable.<br/><br/>Greedy Sleeper was already looking forward to what rank the soul spirit Fang Wang would produce after the Spiritual Refinement, wondering if he could catch up with ‘that kid’?\t\t\t\t\t\t</div>", "images": {}, "success": true}