{"id": 16, "url": "https://www.novelhall.com/i-became-an-immortal-on-mortal-realm-32879/14234581.html", "title": "Chapter 16 - 16 Chapter 14: Jinghong Divine Sword Art, Thirty-Six Swords Great Completion_1", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 16 - 16 Chapter 14: Jinghong Divine Sword Art, Thirty-Six Swords Great Completion_1</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\t16 Chapter 14: Jinghong Divine Sword Art, Thirty-Six Swords Great Completion_1<br/><br/>Translator: 549690339<br/><br/>For five days, Fang Wang did not leave his cave dwelling. Although he was excited to have joined the Great Abyss Gate, he had no intention of going out to socialize with other disciples. He understood all too well that his standing within Great Abyss Gate depended on his cultivation level. As long as he maintained the reputation of a genius, he would be surrounded by benevolent people. However, if he ever fell behind in his cultivation, troubles would naturally follow.<br/><br/>At noon on this day.<br/><br/>Fang Wang sensed something, opened his eyes, and picked up the token from his waist. A voice transmitted from it:<br/><br/>“Fang Wang, come to the Qingxin Hall to see me.”<br/><br/>It was an aged male voice. Hearing Qingxin Hall, Fang Wang’s expression lightened, and he immediately got up. After thinking for a moment, he hung his storage bag on his belt, picked up the Flying Sword given by Zhou Xue, and quickly left his cave dwelling, then took to the skies on his Flying Sword.<br/><br/>The Qingxin Hall was the Peak Master’s palace, which meant that the person who had just spoken was his future mentor, Yang Yuanzi.<br/><br/>He was very curious about what he might learn next.<br/><br/>Located at the summit of the third peak, Qingxin Hall had been pointed out to him by the senior disciple, Li Yu, before.<br/><br/>Ascending the peak, Fang Wang quickly arrived at the entrance to Qingxin Hall. No disciples guarded the place, and the palace was surrounded by tall trees, standing like giant swords.<br/><br/>Fang Wang stood in front of the gate, and slowly pushed the door open, stepping inside.<br/><br/>Qingxin Hall was not large and looked like an ordinary daoist temple. Fang Wang walked up to a figure and bent over to salute, saying, “Disciple Fang Wang, greets Master.”<br/><br/>Yang Yuanzi was seated in meditation facing away from him, in front of a stone statue. The statue was that of a woman, with an elegant demeanor. Its face, devoid of detailed features, appeared solemn and mysterious.<br/><br/>At those words, Yang Yuanzi stood up and turned to look at him.<br/><br/>Only then did Fang Wang clearly see Yang Yuanzi’s true appearance. His hair was a mix of black and white, carelessly scattered; he wore a black dao robe. His eyes were dull, like dry wells, and the stubble around his mouth made him look unkempt. This was a far cry from the image of Yang Yuanzi Fang Wang had expected.<br/><br/>Yang Yuanzi asked, “Why choose the third peak?”<br/><br/>Fang Wang had thought his words through beforehand and replied, “For the most profound legacy.”<br/><br/>“The Nine Heavens Azure Thunder Sword Formation? Of course, which family are you from?”<br/><br/>“Disciple comes from the Fang Family in Southern Hills City.”<br/><br/>“Never heard of it. Well, no matter. I’m not interested. Now that you’ve joined my tutelage, you’re my disciple, ranked fifth. You have four elder apprentice-brothers and sisters. You will get to know them slowly. You’re already at the seventh level of the Qi Cultivation Realm; is there anything particular you wish to learn?”<br/><br/>Yang Yuanzi spoke calmly. He seemed to have no interest in Fang Wang, this genius disciple.<br/><br/>It was only then that Fang Wang realized why Sect Leader Guang Qiuxian had urged him to join the first peak. It seemed that the issue with the third peak lay with Yang Yuanzi.<br/><br/>Fang Wang was straightforward, “Master, could you teach me how to use the storage bag?”<br/><br/>Upon hearing this, Yang Yuanzi’s pupils slightly contracted. He couldn’t help but ask, “You don’t know how to use a storage bag? Didn’t your family teach you?”<br/><br/>“My family doesn’t understand cultivation. Only one of my kinspeople was guided by a cultivator, and I came to Great Abyss Gate following her.”<br/><br/>“How long have you been practicing?”<br/><br/>“Less than a year.”<br/><br/>“You’ve reached the seventh level of the Qi Cultivation Realm in less than a year?”<br/><br/>Yang Yuanzi reexamined Fang Wang, narrowing his eyes, “Not bad. To open a storage bag, you need to develop your spiritual sense.”<br/><br/>Seeing that Fang Wang wanted to keep asking questions, Yang Yuanzi raised his hand and handed over a script to Fang Wang, saying, “This is the Great Abyss Gate’s comprehensive guide to cultivation. It records various basic cultivation methods. Read it when you go back.”<br/><br/>Fang Wang quickly thanked his master, unaware that Yang Yuanzi was quite speechless.This book was intended for Outer Sect Disciples to introduce them to the Dao of Cultivation. Since becoming a Peak Master, he had hardly ever given out this book. It was the very book he had received when he first entered Great Abyss Gate, kept as a memento.<br/><br/>Fang Wang tucked the scripture into his chest and then asked, “Master, might you pass on to me the Nine Heavens Azure Thunder Sword Formation? I’d like to try it.”<br/><br/>Yang Yuanzi huffed, saying irritably, “In Great Abyss Gate, you cannot simply learn whatever you desire. Even if your talents and comprehension are exceptional, you need to make contributions. At the time you were admitted, Great Abyss Gate didn’t delve into your background, firstly because it didn’t care, and secondly because you need to prove yourself by making contributions.”<br/><br/>“As a Direct Disciple, you can select three superior cultivation techniques from the Daofa Pavilion, but the Nine Heavens Azure Thunder Sword Formation is a core legacy of one peak. If you wish to learn it, you must first become the senior disciple.”<br/><br/>Fang Wang eagerly inquired, “How can I become the senior disciple?”<br/><br/>Yang Yuanzi was not annoyed but rather interested, “To become the senior disciple, you must first reach the Spirit Elixir Realm, and you must have made significant achievements. Forget it for the next fifty years.”<br/><br/>Upon hearing this, Fang Wang was instantly disappointed.<br/><br/>Yang Yuanzi changed his tone, “However, you are the first in the history of Great Abyss Gate to become a Direct Disciple upon entry. Although there has never been such an exception before, you will be recorded in the annals of Great Abyss Gate.”<br/><br/>He lifted his right hand, and a green jade slip appeared in his palm.<br/><br/>“This sword technique is called the Jinghong Divine Sword Art, which I personally mastered. The Nine Heavens Azure Thunder Sword Formation belongs to the legacy of Great Abyss Gate, and I cannot give it to you directly; however, the Jinghong Divine Sword Art is different, having been acquired during my adventures in the Cultivation World. Once you cultivate your spiritual sense, you can access the content of the jade slip.”<br/><br/>Yang Yuanzi’s face bore a smile, but it was so awkward that it was more frightening than sorrowful.<br/><br/>Fang Wang took the jade slip, suppressing his excitement, and asked, “Master, is this sword technique powerful?”<br/><br/>Yang Yuanzi raised his chin proudly, “With this sword technique, I secured my position as Peak Master of the third peak. Does that not speak of its strength? I’ve only practiced twenty-seven moves of the technique and was able to sweep through cultivators of the same realm. If you can achieve minor success within ten years, it would mean you have exceptional comprehension.”<br/><br/>“Thank you, Master. I will not disappoint you!”<br/><br/>“First cultivate to the ninth level of Qi Cultivation Realm. As a Direct Disciple, you can cultivate freely. When you reach the Spiritual Refinement Realm, it won’t be too late to start practicing the Jinghong Divine Sword Art.”<br/><br/>“Understood.”<br/><br/>Yang Yuanzi then went on to explain the rules of Great Abyss Gate, mainly that disciples must not kill each other, must not harm innocent mortals, and must not collude with the Demonic Path, among other matters.<br/><br/>After giving instructions, Yang Yuanzi allowed Fang Wang to leave.<br/><br/>Fang Wang didn’t immediately go to the Daofa Pavilion to select a cultivation technique. He felt there was no rush; just mastering the Jinghong Divine Sword Art would require him to spend time practicing. It seemed to have passed in a moment, but for him, it truly was living that many more years.<br/><br/>Locking a person in a room with only food and drink assured, but no forms of entertainment, would drive one mad in a month.<br/><br/>Even though Fang Wang longed for strength, staying in the Heavenly Palace for a hundred or two hundred years was also very painful.<br/><br/>Once one entered the Heavenly Palace, they could not leave without reaching the Great Perfection Realm.<br/><br/>But he faintly discovered another advantage of the Heavenly Palace: any cultivation technique or supreme skill could definitely be mastered to Great Perfection, which was truly domineering!<br/><br/>Furthermore, since the opening of the Heavenly Palace, Fang Wang had gained an eidetic memory.<br/><br/>Returning to his cave dwelling, Fang Wang first took out the cultivation guidelines and, according to the records, cultivated his spiritual sense. For him, who was at the seventh layer of the Qi Cultivation Realm, this was nothing; he accomplished it in just a couple of hours.<br/><br/>The cultivation guidelines also recorded the realms of cultivation, from low to high: Qi Cultivation, Soul Sculpting, Spirit Elixir, Xuanxin, Condensation. Above Condensation were other realms, and the book mentioned ‘hoping disciples could touch even higher realms one day’.<br/><br/>The Soul Sculpting Realm was a level that determined the fate of a cultivator. The rank of the Lifespirit Treasure one sculpted directly affected a cultivator’s talent and comprehension. Of course, it wasn’t absolute; on the path of cultivation, there were always those who defied heaven and stunned past and present.<br/><br/>Fang Wang set aside the cultivation guidelines and began his practice.<br/><br/>He planned to accumulate his cultivation level to the ninth layer of the Qi Cultivation Realm before considering anything else.<br/><br/>By then, he no longer needed to eat and could focus on his cultivation. Closing his eyes, he seemed to enter the state of training in the Heavenly Palace.<br/><br/>One and a half months later, Fang Wang reached the eighth layer of the Qi Cultivation Realm. The gap between the seventh and eighth layers was indeed as large as Zhou Xue had described. His previous victory was only because the Solaris Scripture was stronger than the cultivation techniques of those other cultivators.<br/><br/>He continued to cultivate.<br/><br/>Nearly four months passed, and Fang Wang finally reached the ninth layer of the Qi Cultivation Realm in one breath.<br/><br/>He opened his eyes, and a glint flashed in them. He once again condensed the Solaris True Fire; nine small suns floated behind his head, illuminating the cave dwelling. Feeling the surging spiritual power within his body, he suddenly felt like when he first reached the Martial Mythical Realm.<br/><br/>Well, he felt invincible.<br/><br/>Of course, this feeling was only momentary, and he knew that he was still at the bottom in the Cultivation World and needed to keep striving.<br/><br/>Fang Wang picked up the Jade Slip given to him by Yang Yuanzi and probed into it with his spiritual sense. A vast array of text flooded into his mind. After sorting it all out, he felt woozy, and when he opened his eyes again, he had already arrived in the Heavenly Palace.<br/><br/>He stood inside the main hall of the Heavenly Palace and began practicing the Jinghong Divine Sword Art.<br/><br/>The Jinghong Divine Sword Art consisted of thirty-six strikes. One didn’t need to have a sword in hand; the sword technique condensed a sword shape, much like a magic artifact, moving as one desired.<br/><br/>Yang Yuanzi himself claimed to have practiced only up to the twenty-seventh strike, which made Fang Wang hold great expectations for the thirty-six strikes.<br/><br/>However, just the first strike took him five years to practice.<br/><br/>The Jinghong Divine Sword Art was very difficult to cultivate!<br/><br/>It was not just about condensing spiritual power into a sword shape but also about imbuing it with spiritual sense, making the sword shape an extension of one’s vision, which also tested the spiritual sense.<br/><br/>However difficult, as long as one entered the Heavenly Palace, they would definitely master it, even if it meant enduring more time!<br/><br/>Fang Wang continued to cultivate the second strike.<br/><br/>The second strike also took five years!<br/><br/>It wasn’t until the sixth strike that the time taken to practice shortened to two years. Fang Wang originally thought he had made it, but when he continued to practice up to the eighteenth strike, each required more than ten years, nearly causing him to collapse.<br/><br/>Who could day after day, for over a hundred years, train and learn without any form of entertainment in between?<br/><br/>Fang Wang had tried to create a computer from his previous life within the Heavenly Palace, but it was just a shell. As for creating a person, that was even more impossible.<br/><br/>Just like that.<br/><br/>By the time Fang Wang finally mastered the thirty-six strikes, thirty-six sword shapes, each resembling the Qingjun Sword, floated around him, very dazzling. Only his face was filled with numbness.<br/><br/>“Finally, it’s over.”<br/><br/>As these words fell, Fang Wang’s consciousness returned to reality.<br/><br/>Practicing the Jinghong Divine Sword Art had taken him two hundred years!<br/><br/>Numb!<br/><br/>Fang Wang immediately got up and walked out of the cave dwelling. He needed to go see the outside scenery, or he would go insane.<br/><br/>Boom!<br/><br/>The door to the cave dwelling opened, and sunlight fell upon Fang Wang. At that moment, he felt truly alive.<br/><br/>He went to the edge of the cliff and admired the magnificent scenery of the Great Abyss Gate’s peaks, standing there for half an hour before returning to continue his cultivation.<br/><br/>Watching the disciples coming and going, Fang Wang finally felt a sense of reality.<br/><br/>“Fang Wang, long time no see, have you achieved Soul Sculpting?”<br/><br/>A female voice came, and Fang Wang turned to look. It was Gu Li from the Luo Bei Gu Family.<br/><br/>Gu Li’s cave dwelling was right next to his, which surprised him secretly; this place was meant for direct disciples!\t\t\t\t\t\t</div>", "images": {}, "success": true}