{"id": 15, "url": "https://www.novelhall.com/i-became-an-immortal-on-mortal-realm-32879/14234579.html", "title": "Chapter 15 - 15 Chapter 13: Nine Heavens Azure Thunder Sword Formation_1", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 15 - 15 Chapter 13: Nine Heavens Azure Thunder Sword Formation_1</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\t15 Chapter 13: Nine Heavens Azure Thunder Sword Formation_1<br/><br/>Translator: 549690339<br/><br/>“`<br/><br/>Direct Disciple!<br/><br/>Hearing the words of Greedy Sleeper, Fang Wang secretly let out a sigh of relief. He seemed to have dominantly ended the battle, yet after the chaotic fight, eighty percent of his spiritual power had been depleted; he had only pretended to remain calm and untroubled.<br/><br/>The cultivators who had not yet fainted looked at Fang Wang with mixed emotions, all of them feeling a complex mixture of feelings. They couldn’t believe that someone had managed to fight against fifty-one individuals on his own, especially considering the small gap in their realms and that they all hailed from families of the cultivation world.<br/><br/>“Fang Wang? Why haven’t I heard of him before?”<br/><br/>“The Fang Family is incredible, but I don’t know from which place this Fang Family hails.”<br/><br/>“So strong, to become a direct disciple upon entering. I’m thoroughly convinced. I couldn’t even block one of his moves.”<br/><br/>“His flames could burn us to death; he obviously held back.”<br/><br/>Almost everyone was utterly convinced by their defeat, only having realized the terror of Solaris Spiritual Power after fighting with Fang Wang.<br/><br/>They even felt that they weren’t fighting a Qi Cultivation Realm cultivator, but a Soul Sculpting Realm expert!<br/><br/>Gu Li looked at the tall and upright figure of Fang Wang and, for the first time, felt quite ordinary, realizing why her father wanted her to join the Great Abyss Gate. If she had stayed within her family, she would have continued to believe herself an unparalleled genius in this world.<br/><br/>Just then, a figure descended from the sky as if an Immortal had descended from the heavens. He was dressed in a Great Abyss Gate Dao robe, elegant and graceful despite his white temples, which only emphasized his detached from the worldly dust demeanor. He looked to be just over thirty years old.<br/><br/>Greedy Sleeper turned his head to look and laughed, “Junior brother, this is the one, take him up.”<br/><br/>He then turned to Fang Wang and introduced, “This is Inheritance Elder Zhao Chuanqian. Go with him to receive your direct disciple rewards.”<br/><br/>Fang Wang hurriedly paid his respects to Zhao Chuanqian who had an indifferent expression and merely nodded slightly. Suddenly, he waived his sleeve, and a gust of wind brushed against their faces, directly sweeping Fang Wang away. The two turned into a rainbow light and disappeared among the mountains.<br/><br/>This scene filled the entrance-level cultivators with envy, while Zhou Xue’s lips curved upwards, her mood lifting immensely.<br/><br/>“In the future, he is destined to become a prominent figure in the Great Abyss Gate and even in the Da Qi Cultivation Realm. In a hundred years, no, at most in fifty, all of you will take pride in having been his contemporaries,” said Greedy Sleeper with a touch of emotion as if he was reminiscing about the rise and fall of life.<br/><br/>“Alright, now we will begin selecting the five Sword Bearing Disciples,” Greedy Sleeper said, shifting his tone to a more serious note as he looked towards the cultivators.<br/><br/>…<br/><br/>Fang Wang stood behind Zhao Chuanqian on a flying sword, a three-zhang-long weapon beneath his feet, its blade shimmering with strands of silver light, breathtakingly beautiful.<br/><br/>From high above, looking down upon the Great Abyss Gate, he saw a large city amidst the mountains, with Tai Yuan Sect disciples coming and going, all sorts of flying artifacts and mounts catching his eyes.<br/><br/>Zhao Chuanqian remained silent, which made it difficult for Fang Wang to initiate conversation, so he simply took in the scenery along the way.<br/><br/>The Great Abyss Gate was vast, much larger than Southern Hills City. The peak Zhao Chuanqian was heading towards was the tallest, and only upon approach could one truly sense the majesty of this towering mountain.<br/><br/>Soon, soaring on their swords, the two men landed in front of a palace.<br/><br/>Fang Wang lifted his eyes to see the imposing palace named Shiyuan Hall, guarded by two ferocious mythical beast statues at the entrance.<br/><br/>Behind him was a white jade staircase with hundreds of steps leading to a vast platform spanning two or three miles where three disciples were cleaning.<br/><br/>“Follow me.”<br/><br/>Zhao Chuanqian spoke and then stepped into the Shiyuan Hall, with Fang Wang following closely behind.<br/><br/>Inside Shiyuan Hall, Fang Wang took in his surroundings; the hall was spacious and bright, giving him an impression of grandeur. There were no weapons displayed, nor were there any gaudy decorations.<br/><br/>Fang Wang’s gaze was drawn to a figure in the front, an old man in a white robe with white hair neatly coiled under a jade crown, not particularly tall but his posture emanated a comforting stability, as if he could face any calamity of this world with his hands clasped behind his back.<br/><br/>“Sect Leader Senior Brother, he has arrived,” Zhao Chuanqian announced, stopping in his tracks. Hearing the title Sect Leader, Fang Wang couldn’t help but feel nervous.<br/><br/>The Sect Leader turned around, sweeping his sleeves. His face was not as old as his figure suggested; although not young, he had the visage of an old man with a child’s complexion.<br/><br/>Fang Wang immediately bowed and greeted the man, having heard from Zhou Xue earlier that the Sect Leader of the Great Abyss Gate, Guang Qiuxian, was profoundly skilled and ranked among the top five in personal strength within the Nine Great Sects, with no clear ranking among them.<br/><br/>“I’ve seen your performance, and it’s quite good. I have high hopes for you. As a direct disciple, you will directly receive a Superior Grade Spiritual Weapon, but before that, you must choose which lineage to join,” Guang Qiuxian said with a smile, appearing friendly and without any air of intimidation.<br/><br/>Fang Wang responded, “I wish to join the Third Lineage.”<br/><br/>This was arranged in advance by Zhou Xue on their way here; each Fang Family Disciple had to join different lineages.<br/><br/>Hearing this, Zhao Chuanqian couldn’t help but give Fang Wang a peculiar look.<br/><br/>Guang Qiuxian chuckled and said warmly, “Fang Wang, it seems you are well-informed about the Great Abyss Gate. However, I should clarify that although the Third Lineage’s inheritance is indeed the most profound among the nine lineages, its current situation is particular, and in terms of overall strength, it is ranked eighth. A lineage’s ranking can affect its resources, so think carefully.”<br/><br/>Upon hearing that the inheritance was the most profound, Fang Wang immediately nodded, “I choose the Third Lineage.”<br/><br/>“`<br/><br/>Zhao Chuanqian shook his head slightly, yet he did not speak.<br/><br/>Guang Qiuxian nodded in agreement, then lifted his right hand, from within his sleeves flew out three beams of light, hovering above the hall, which were a green longsword, a jade flute, and a folding fan.<br/><br/>“These three are all Superior Grade Spiritual Weapons, quite similar to each other, choose based on the one you feel a connection with,” he said.<br/><br/>Guang Qiuxian gave a brief introduction, then waited for Fang Wang to choose.<br/><br/>Fang Wang didn’t hesitate, directly choosing the sword since that was what he was best at. He would focus on learning other secret techniques and developing other Magic Artifacts later on.<br/><br/>To establish oneself as a Cultivator, one couldn’t rely solely on a single Magic Artifact.<br/><br/>Guang Qiuxian waved a hand, and the green longsword landed in Fang Wang’s hands, the sword was entirely green, as if forged from green jade, and the blade wasn’t sharp. Holding it with both hands, he felt a cooling sensation that calmed his heart.<br/><br/>He noticed two characters engraved on the hilt of the sword.<br/><br/>Qing Jun!<br/><br/>“Do not use this Magic Artifact rashly before reaching the Spiritual Refinement Realm, as it is easy to suffer from backlash,” Guang Qiuxian warned him.<br/><br/>Zhao Chuanqian turned around and said, “Let’s go. I’ll take you to collect the reward for a Direct Disciple.”<br/><br/>Fang Wang hurriedly sheathed the sword, paid his respects to Guang Qiuxian, and followed Zhao Chuanqian’s steps.<br/><br/>Watching Fang Wang’s retreating figure, Guang Qiuxian’s smile never faded, and once the two had left Shiyuan Hall, he murmured to himself, “Another genius has emerged, it seems the Great Abyss Gate is on the rise. It’s just a pity that he entered the sect late and won’t be able to catch the upcoming fortunate opportunity.”<br/><br/>After leaving Shiyuan Hall, under Zhao Chuanqian’s lead, Fang Wang went to the main peak’s administrative hall and received the Direct Disciple’s Jade Pendant, then to the Magic Artifact Hall, where he collected a storage bag, a Flying Sword, a hundred Talisman Papers, and ten Spirit Stones. The bounty didn’t end there; they also went to the Elixir Hall, where he received ten bottles of Spiritual Energy Elixirs.<br/><br/>Zhao Chuanqian also briefed him about the situation of the third lineage, which had a total of over two thousand disciples, including Outer Sect Disciples. Currently, there were four Direct Disciples in the third lineage, and with Fang Wang, there were now five.<br/><br/>Above the Direct Disciples were the Single Lineage’s Chief Disciples, and above them, the Chief Disciple of the Great Abyss Gate.<br/><br/>The Chief Disciple of a Single Lineage had the qualifications to inherit the position of Peak Master, whereas the Great Abyss Gate’s Chief Disciple would be the next Sect Leader!<br/><br/>Fang Wang wasn’t interested in the elevation of status or position, and inquired about the highest inheritance of the third lineage.<br/><br/>Zhao Chuanqian looked at him deeply and replied, “The Nine Heavens Azure Thunder Sword Formation. This Sword Array could be considered the strongest Formation of the Great Abyss Gate, able to be used by a single person and counts as the most powerful Spell, possessing a peerless might capable of stabilizing the world. However, nowadays no one can master the Nine Heavens Azure Thunder Sword Formation.”<br/><br/>Fang Wang silently took note of this.<br/><br/>Afterwards, Zhao Chuanqian took him flying to the peak of the third lineage, where disciples were seen meditating and cultivating all over the mountain, and there were many stone doors, the contents unknown.<br/><br/>Under Zhao Chuanqian’s guidance, Fang Wang landed in an open space, where hundreds of disciples were gathered, cultivating some kind of Swordsmanship.<br/><br/>In front of the open field, a line of distinguished disciples were scrutinizing those training, but when they saw Zhao Chuanqian, they immediately turned and all bowed in unison to him.<br/><br/>“Li Yu, this is your junior brother, Fang Wang, he has entered the sect today and has been acknowledged by the Sect Leader. Take him to settle into his Cave Abode,” said Zhao Chuanqian to the man in the lead, and after speaking, he left on his sword, leaving Fang Wang behind.<br/><br/>Li Yu, the Chief Disciple of the third lineage, appeared young, but was actually over two hundred years old.<br/><br/>Hearing Zhao Chuanqian’s words, Li Yu’s eyes brightened, and the other disciples behind him also became excited, crowding around.<br/><br/>“Direct Disciple, you must be the strongest among the new disciples of this batch!”<br/><br/>“Good lad, you have keen eyesight for choosing the third lineage, you definitely won’t be disappointed.”<br/><br/>“Hahaha, finally a remarkable genius joins the third lineage.”<br/><br/>“Junior Brother Fang Wang, if there’s anything you need, just call on me anytime. I’m a branch lineage disciple; my name is Zhou Bo.”<br/><br/>Within the Tai Yuan Sect, disciples of a higher rank are addressed as ‘senior brother,’ and only those of the same rank would talk about seniority.<br/><br/>Fang Wang did not put on airs, and courteously exchanged pleasantries with them all. After some effort, Li Yu took Fang Wang to choose his Cave Abode.<br/><br/>Throughout the way, Li Yu was very enthusiastic, introducing the third lineage to Fang Wang.<br/><br/>The Peak Master of the third lineage was named Yang Yuanzi. In addition to leading the lineage’s affairs, the Peak Master would also take Direct Disciples as apprentices. Li Yu highly praised Yang Yuanzi, almost as if Yang Yuanzi were the strongest of the Peak Masters.<br/><br/>It took a full half-hour before Fang Wang finally chose his Cave Abode. It turned out that the stone doors on the mountain were the entrance to the Cave Abodes. There were also grades among Cave Abodes. As a Direct Disciple, he was entitled to one of the best Cave Abodes.<br/><br/>After Li Yu bade farewell and left, Fang Wang entered the Cave Abode, and henceforth, he would use his own identity Token to enter and leave this Cave Abode. An ownerless Cave Abode simply needed one to press their Disciple Token against the door to claim it. Of course, this claim was not unbreakable; the Peak Master could forcibly retrieve a Cave Abode.<br/><br/>Everything in front of Fang Wang was eye-opening, from the outside it seemed the Cave Abode was small, but inside it was another world, large enough to be half the size of a soccer field, with a small lake at the deepest point. The Cave Abode was filled with rich Spiritual Energy; just taking one breath was refreshing and clarifying.<br/><br/>The Cave Abode was furnished with stone tables and benches, and there was also a white jade bed. After a brief exploration, he sat down on the white jade bed to practice Qi Gathering and cultivate.<br/><br/>Having expended much Spiritual Power today, he needed to replenish it.<br/><br/>According to Li Yu, Yang Yuanzi would only be able to come out of seclusion to meet him in five days. Direct Disciples in the Great Abyss Gate enjoyed a lot of freedom; even if they didn’t do anything on ordinary days, they would still receive their cultivation resources from the sect punctually.<br/><br/>While cultivating through Qi Gathering, Fang Wang harbored his own thoughts.<br/><br/>The Nine Heavens Azure Thunder Sword Formation—he must get his hands on it!\t\t\t\t\t\t</div>", "images": {}, "success": true}