{"id": 10, "url": "https://www.novelhall.com/i-became-an-immortal-on-mortal-realm-32879/14234569.html", "title": "Chapter 10 - 10 Chapter 8 Cultivation Dynasty_1", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 10 - 10 Chapter 8 Cultivation Dynasty_1</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\t10 Chapter 8 Cultivation Dynasty_1<br/><br/>Translator: 549690339<br/><br/>“Really? Then I want to learn!”<br/><br/>Fang Wang’s eyes lit up and he quickly spoke. His greatest skill was his swordsmanship, chiefly because he always harbored the heart to travel the world on the edge of a sword, and moreover, the sword complemented a cultivator perfectly.<br/><br/>Just like the Sword Control Technique, according to Zhou Xue, it was something all cultivators would learn, which demonstrated the universality of swords within the path of cultivation.<br/><br/>Zhou Xue wasted no time and began to teach the sword technique, with Fang Wang listening attentively.<br/><br/>After a while.<br/><br/>Zhou Xue finished her explanation, then gazed at Fang Wang.<br/><br/>Fang Wang, however, furrowed his brows. He hesitated for a moment and then said, “This sword technique is not right. Although I have never cultivated a sword technique for cultivators, all techniques share commonalities, especially within the Sword Dao. I feel that if I practice this sword technique following the method you’ve described, it won’t work.”<br/><br/>This fact that he had not been able to enter the Heavenly Palace was enough to prove that this sword technique was fake!<br/><br/>Upon hearing this, Zhou Xue was not angry. Instead, appreciation showed in her eyes as she exclaimed, “Impressive, I can now confirm that, aside from your aptitude, your intuitive understanding is excellent. It’s no wonder you could achieve such a level with the Sword Control Technique within seven days.”<br/><br/>“Since you’ve already reached the sixth layer of the Qi Cultivation Realm, you should continue cultivating. Spells are not urgent at the moment. After entering the Great Abyss Gate, you will need to endure hard cultivation for the first two years, focusing on your realm of cultivation. The last three layers of the Qi Cultivation Realm are much more challenging than the first six, especially the ninth layer transitioning into the Soul Sculpting Realm. The hardship involved is something you can’t imagine right now. If you can achieve Spiritual Refinement within five years, then you can choose any spell from the Great Abyss Gate.”<br/><br/>When Zhou Xue pinpointed Fang Wang’s level of cultivation, he was not surprised; after all, he was the reincarnation of an Immortal Venerable, so it was normal for her to discern his cultivation level.<br/><br/>Fang Wang pretended to be depressed and said, “If I hadn’t seen through it, wouldn’t I have practiced this sword technique in vain?”<br/><br/>Zhou Xue shook her head slightly and said, “I was just testing you. Your talent and perception are truly extraordinary, but after all, you’re a mortal with limited lifespan. Remember, cultivation is of the utmost importance. Don’t rely on your keen perception to spend most of your time delving into minor skills.”<br/><br/>Hearing this, Fang Wang had no choice but to give up on the idea.<br/><br/>He wasn’t too disappointed; after all, the Solaris Scripture he possessed came with Solaris True Fire, which, when applied to his Sword Control Technique and the martial arts he had mastered, was equivalent to the power of spells.<br/><br/>After offering a few pieces of advice, Zhou Xue stood up and left.<br/><br/>Watching her retreating figure, Fang Wang suddenly became very curious about her level of cultivation.<br/><br/>His intuition told him that Zhou Xue had already embarked on the path of cultivation, and her cultivation was not weak, but it seemed she possessed some method to conceal her energy, making her inscrutable to him.<br/><br/>Once Zhou Xue closed the door, Fang Wang stopped thinking about it and continued with his cultivation.<br/><br/>Cultivation could be addicting, especially when effort led to tangible results.<br/><br/>…<br/><br/>Under the blue sky and among the green mountains, three horse-drawn carriages moved forward, appearing very small in the majestic landscape, indistinguishable from pebbles in the eyes of eagles soaring above.<br/><br/>Fang Wang leaned against the carriage door, holding the reins in his hand, enjoying the scenery along the way.<br/><br/>The thirteen days had not led to a breakthrough to the seventh layer of the Qi Cultivation Realm, but his spiritual power had increased significantly.<br/><br/>Recalling his parents’ reluctance during their farewell, Fang Wang felt a touch of emotion, but more than that, he was excited. It wasn’t that he was cold-hearted; he just had memories of a past life. Although he was fond of this life’s Fang Residence, his attachment hadn’t reached an inseparable extent yet.<br/><br/>He had longed to venture out, but in this world akin to ancient times, bandits often lurked outside the city. From childhood to adulthood, he had never stepped out of Southern Hills City, which made everything along the way feel novel to him.<br/><br/>Zhou Xue stepped out of the carriage and sat beside him, appreciating the landscape together.<br/><br/>“How large do you think this world really is, and how much of it does Da Qi occupy?” Fang Wang suddenly asked.<br/><br/>Zhou Xue looked into the distance and replied, “It’s vast, very vast. Da Qi is just a tiny part of Canghai. I’ve heard from a senior that outside of Da Qi, there are even dynasties where everyone practices cultivation.”<br/><br/>To cover up the fact of her rebirth and to establish her authority, all the Fang Family Disciples now knew that a certain cultivator from her past was guiding her.<br/><br/>“Everyone practices cultivation? How formidable would that be?” Fang Wang mused eagerly.<br/><br/>Zhou Xue chuckled softly and said, “Perhaps Da Qi will also transform into a Cultivation Dynasty in the future.”<br/><br/>Perhaps?<br/><br/>Then it must be true!<br/><br/>Since there were others in the carriage, Zhou Xue dared not reveal her knowledge, speaking only in conjectures. Fang Wang naturally understood this.<br/><br/>The fact that Qi Dynasty could evolve from a mundane dynasty into a Cultivation Dynasty was astonishing. No wonder Zhou Xue was willing to support Fang Residence. Could it be that she intended to secure a position in the future Qi Dynasty?<br/><br/>Fang Wang silently thought that Zhou Xue might have other intentions, but he was not opposed to it. After all, for an Immortal Venerable to support a power was incredibly easy. Zhou Xue had not failed the kindness of Uncle Fang Zhen in raising her, showing that at the very least, she harbored a shred of goodness in her heart and was not the Demonic Cultivator he had imagined.<br/><br/>He had always been curious about why Zhou Xue had been reborn. Surely she didn’t just reincarnate while meditating and practicing, right?<br/><br/>The two continued to chat idly as the sun gradually set.<br/><br/>At dusk, they stopped to rest by a river near the mountain road, and the Fang Family Disciples began to gather firewood. Fang Wang found a spot to sit; he didn’t need to engage in these trivial tasks, as his responsibility was to protect the clansmen.<br/><br/>Along with Fang Wang and Zhou Xue, a total of nine people were present, including Fang Hanyu, who, despite his young age, had achieved the status of a first-rate expert. The three of them didn’t need to gather firewood, so it was up to the other six to take care of these tasks.<br/><br/>Fang Hanyu sat not far away, glancing at Fang Wang from time to time, seemingly hesitant about something.<br/><br/>After struggling for a while, Fang Hanyu clenched his teeth and stood up, walking over to Fang Wang.<br/><br/>Fang Wang opened his eyes to look at him and asked with a smile, “Han Yu, is there something on your mind?”<br/><br/>Although Fang Hanyu was two years older than him, Fang Wang had an adult’s mind since birth, so he always called his peers by their names, and Fang Hanyu was used to it.<br/><br/>After that night, the two had no chance to speak, and even after leaving Southern Hills City for three days, Fang Hanyu and Fang Wang merely nodded at each other without having a chat.<br/><br/>“Fang Wang, Zhou Xue taught us the basic Qi Gathering Method, and after half a month of cultivation, I’ve barely managed to produce Spiritual Power. Could you teach me the Sword Control Technique? I don’t want to bother Zhou Xue…” Fang Hanyu said awkwardly, avoiding Fang Wang’s gaze.<br/><br/>Fang Wang couldn’t help but smile, stood up, and laughed, “All right, Hanyu, I’ve been waiting for you to ask me, but it took you so long, I thought you had forgotten about me. When you were little, you’d lie down if I told you to, but now that you’ve grown up, you’ve become rather aloof, haven’t you?”<br/><br/>Aloof?<br/><br/>Fang Hanyu couldn’t help but smile, as he was accustomed to Fang Wang using odd and quirky terms since childhood, and he roughly understood their meanings. His cheeks blushing slightly with embarrassment, he said, “It’s been many years since we last met, let’s not talk about when we were kids—when you made me crawl around pretending to be a dog searching for meat buns. I still remember that!”<br/><br/>The two brothers became more familiar with each other and started reminiscing about their childhood.<br/><br/>After chatting for a while, Fang Wang saw that Fang Hanyu had completely relaxed, so he began to teach him the Sword Control Technique.<br/><br/>It’s worth mentioning that since they left, Zhou Xue spent every night alone in the woods, unseen by anyone. Fang Wang knew she was a reborn person, so he wasn’t worried about her safety.<br/><br/>That’s why Zhou Xue kept a great distance from the other Fang Family Disciples, and this was one of the reasons Fang Hanyu sought out Fang Wang to practice the Sword Control Technique.<br/><br/>From that night on, Fang Wang instructed Fang Hanyu in the Sword Control Technique every night, and it must be said that the boy was indeed a genius. After only three days, he could make the wooden sword float.<br/><br/>This wooden sword was not ordinary—it was the specially made Peach Wood Sword of the Qingyi Daoist, which could be manipulated by Spiritual Power. Zhou Xue had taken possession of all the Qingyi Daoist’s remaining belongings, and upon hearing that Fang Wang was teaching Fang Hanyu the Sword Control Technique, she lent the wooden sword to Fang Hanyu.<br/><br/>“Brother Hanyu is really amazing!”<br/><br/>“I haven’t even managed to cultivate any Spiritual Power yet, ah, the difference is so huge.”<br/><br/>“Hahaha, Hanyu has always been a genius! Didn’t Zhou Xue say that having a trace of Spiritual Power within six months qualified one for Cultivation?”<br/><br/>“The more skilled Hanyu is, the more confident we will be when we reach the Great Abyss Gate, and we’ll be able to look out for each other in the future.”<br/><br/>Surrounded by his clan members, Fang Hanyu’s usually stern face showed a rare smile. He wasn’t being arrogant, but rather, he was excited about his own achievements as he looked at Fang Wang, who stood not far away by the lake.<br/><br/>At dawn, Fang Wang and Zhou Xue stood by the lakeside, gazing at them from a distance. The mist over the lake entwined, making the scene look like a heavenly realm. The two standing together looked as though they were a pair made by heaven itself, as if they could ascend to immortality at any moment.<br/><br/>“Fang Hanyu’s aptitude is indeed impressive, which is quite a surprise to me,” Zhou Xue praised. In her eyes, these Fang Family Disciples were not her peers; she was more like looking at her own descendants, given that she had lived more lifetimes than the oldest history of the Qi Dynasty’s noble families.<br/><br/>Listening to her words, it seemed that in their original destinies, Fang Hanyu would have died on the night the Fang Residence was annihilated.<br/><br/>Fang Wang watched Fang Hanyu and thought this to himself, smiling and feeling happy for Hanyu.<br/><br/>“How much longer is the journey to the Great Abyss Gate?” Fang Wang asked.<br/><br/>He could already fly with his sword, but there were seven other family members traveling with him, including two young girls who thought walking half a day was tiresome, so they had to travel by horse-drawn carriage.<br/><br/>Zhou Xue looked at the tender-faced youths and answered softly, “We will arrive in three more days.”<br/><br/>She paused, then continued, “You must have felt these past two days that the number of villages we’ve encountered is dwindling. As we proceed, we’re more likely to encounter malicious spirits and Spirit Demons, so be careful when we travel.”<br/><br/>Malicious spirits?<br/><br/>Spirit Demons?<br/><br/>Fang Wang wasn’t nervous; instead, he was filled with excitement.<br/><br/>This was the perfect opportunity to test his Solaris Scripture!<br/><br/>As the sun rose, the Fang Family Disciples excitedly packed their belongings to continue on the road.<br/><br/>The mountain roads were rugged, with tall trees and lush vegetation. The foggy air gave the forest an enchanted appearance. With the bumpy journey, those Fang Family Disciples who wanted to sleep had also woken up.<br/><br/>By noon, Zhou Xue reined in her horse and stood up, then called back to the others, “Everyone, pack your belongings and disembark. We will continue on foot from here.”<br/><br/>Each horse-drawn carriage carried three people, who would normally take turns sleeping: one to lead the horse, one to stay alert for danger, and the third to sleep inside the carriage.<br/><br/>Soon, all the Fang Family Disciples dismounted, and aside from Fang Wang, Zhou Xue, and Fang Hanyu, the other six members shouldered their baggage, including the two young girls.<br/><br/>Fang Wang couldn’t help but glance at Zhou Xue. He knew she carried the Qingyi Daoist’s storage bag with her, though he wondered exactly how large the interior space was.<br/><br/>According to Zhou Xue, storage bags, Talisman Paper, and Flying Swords were standard equipment for a Cultivator.<br/><br/>Zhou Xue drew the Treasured Sword from Fang Wang’s waist and cut all the reins of the horses from the three carriages in one go.<br/><br/>“What does this mean?” asked Fang Hanyu in surprise.<br/><br/>Zhou Xue replied, “We’re heading to the Great Abyss Gate and it will be difficult to return for several years. Even when we return, we won’t need the carriages. Better to set them free than let them be eaten by the ghosts and demons in the mountains.”<br/><br/>Ghosts and demons!<br/><br/>At these words, the two Fang Family young ladies turned pale, and the other four young men did as well.<br/><br/>Zhou Xue tossed the sword with her hand, and it flew through the air three zhang away, accurately sliding into Fang Wang’s scabbard. This smooth move caught the others off guard, their eyes widening in amazement.<br/><br/>Fang Wang squinted his eyes slightly, his right hand trembling slightly, and he thought to himself that the force and speed were impressive. He became even more curious about Zhou Xue’s current level of Cultivation.\t\t\t\t\t\t</div>", "images": {}, "success": true}