{"id": 19, "url": "https://www.novelhall.com/i-became-an-immortal-on-mortal-realm-32879/14234588.html", "title": "Chapter 19 - 19 Chapter 17 Tianyuan!_1", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 19 - 19 Chapter 17 Tianyuan!_1</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\t19 Chapter 17 Tianyuan!_1<br/><br/>Translator: 549690339<br/><br/>The process of Spiritual Refinement was incredibly wondrous. As Fang Wang envisioned the sword-shaped spirit he desired, he entered a strange state of inner vision, seeing within his body a black region where flames fiercely burned, gradually taking the shape of a sword.<br/><br/>Fang Wang’s attention was focused on this sword. At that moment, his thoughts seemed to transform into invisible hands, capable of touching the sword.<br/><br/>As he was engrossed in the process, the flames around him surged towards his head, condensing into a fireball.<br/><br/>Guang Qiuxian, Yang Yuanzi, and Zhou Xing Shi stood on the walkway, watching.<br/><br/>“Your disciple’s Cultivation Technique is extraordinary. It’s the first time I’ve seen such a burning aura of Spiritual Power,” Guang Qiuxian exclaimed in admiration.<br/><br/>Yang Yuanzi remained silent; his understanding of Fang Wang was actually quite shallow.<br/><br/>Zhou Xing Shi, on the other hand, thought back to the battle before his initiation. He had exchanged just one palm strike with Fang Wang and had to nurse his injuries for a whole month. Even now, the memory made him shudder.<br/><br/>The joy of sculpting the Mysterious Origin Treasure Spirit had already faded; he stared at the nascent form of Fang Wang’s spirit above his head, and intuition told him that Fang Wang’s spirit would certainly surpass his own.<br/><br/>At the seventh level of the Qi Cultivation Realm, he could sweep him and fifty other cultivators; he dared not speculate what kind of Lifespirit Treasure Fang Wang would shape.<br/><br/>In his family, he had heard many tales of geniuses, but Fang Wang was the most terrifying talent he had ever encountered.<br/><br/>Setting aside their strength, this youngster was only at the seventh level of the Qi Cultivation Realm a few months ago, and now he was following him in Spiritual Refinement…<br/><br/>Zhou Xing Shi’s heart trembled, and his gaze toward Fang Wang grew ever more complex.<br/><br/>Time slowly slipped by.<br/><br/>Half an hour later.<br/><br/>The treasure spirit forming above Fang Wang’s head had already taken on a basic sword shape, and the blazing flames around him grew increasingly immense, like fiery snakes entwining his body, even causing the water in the pool to boil, sending up billows of hot mist.<br/><br/>Stroking his beard, Guang Qiuxian laughed and said, “He’s attained at least a Mysterious Origin.”<br/><br/>Yang Yuanzi, with a solemn expression, said, “Reaching the Mysterious Origin grade at this stage, he may truly attain the Earth Origin grade.”<br/><br/>His glance unintentionally fell on Zhou Xing Shi, causing Zhou’s heart to skip wildly. He suddenly regretted staying to watch, but to say he would leave now was even more impossible.<br/><br/>Guang Qiuxian, staring at Fang Wang, proudly laughed and said, “After Lu Yuanjun, there comes another Fang Wang. Why should Great Abyss Gate worry about flourishing?”<br/><br/>Upon hearing this, Yang Yuanzi shook his head and snorted coldly, “Sect Leader, I advise you not to get too carried away. Don’t forget the tragedy of Taiqing Gate. Great Abyss Gate attracts cultivator clans with its talents, which might lead to jealousy from other sects. One Lu Yuanjun might not cause trouble, but another might not be so certain.”<br/><br/>Hearing this, Guang Qiuxian’s smile gradually faded.<br/><br/>Zhou Xing Shi, upon hearing this, grew even more regretful and began pondering how to respond later.<br/><br/>Time continued to pass, second by second.<br/><br/>The sword-shaped treasure spirit above Fang Wang’s head became more tangible, with fine patterns even visible. Not only that, but this treasure spirit had begun to absorb the natural spiritual energy from the surroundings.<br/><br/>“Earth Origin!”<br/><br/>Guang Qiuxian uttered two words. The ability to absorb nature’s spiritual energy during Spiritual Refinement was a characteristic of an Earth Origin Spirit Treasure.<br/><br/>Zhou Xing Shi felt a whirlwind of emotions, his hands clenched tight.<br/><br/>“For such a genius to sculpt an Earth Origin Treasure Spirit… is not surprising. Why should I bother comparing myself to him…” Zhou Xing Shi consoled himself.<br/><br/>Fang Wang’s treasure spirit continued to condense, causing Guang Qiuxian to lose his composure, his brows furrowed tight.<br/><br/>Yang Yuanzi narrowed his eyes, his gaze firmly fixed on Fang Wang’s Lifespirit Treasure.<br/><br/>At this moment, Fang Wang was still observing his Lifespirit Treasure within that dark realm. In the darkness, his Lifespirit Treasure had already taken the sword shape he wanted, with the hilt and the guard as if entwined by a majestic Red Dragon, powerful and commanding.<br/><br/>Wielding such a sword would be so cool!<br/><br/>Fang Wang was satisfied with his aesthetic choice. Just as he was admiring his treasure spirit, he suddenly sensed something and his gaze subconsciously drifted upwards.<br/><br/>Above, a light appeared in the darkness, and his Heavenly Palace revealed itself.<br/><br/>This is…<br/><br/>As Fang Wang was puzzled, the gates of the Heavenly Palace suddenly swung open, and a beam of light burst forth, shooting down and striking his Lifespirit Treasure head-on.<br/><br/>Boom!<br/><br/>His sword-shaped treasure spirit was instantly extinguished. At the same time, outside, the three observers Guang Qiuxian, Yang Yuanzi, and Zhou Xing Shi saw Fang Wang’s treasure spirit above his head suddenly explode, with a blast of flame spreading out.<br/><br/>Guang Qiuxian raised his hand, shielding the blast of flames with his Spiritual Power. His brow was tightly knitted, and his eyes showed signs of disappointment.<br/><br/>Yang Yuanzi frowned deeply, speaking in a heavy tone, “He failed? How is that possible? Only a Yellow Origin Treasure Spirit could possibly result in failure…”<br/><br/>Zhou Xing Shi, witnessing this scene, felt a mix of surprise and pity. For such an outstanding figure to fail in Spiritual Refinement was like falling from the clouds to the mortal world. He still had been looking forward to seeing how powerful Fang Wang would become after successful refinement. If successful, he might have witnessed the rise of a legend.<br/><br/>What a pity!<br/><br/>Still in a state of inner vision, Fang Wang stared at the Heavenly Palace, stunned.<br/><br/>What’s going on?<br/><br/>Why would the Heavenly Palace destroy his treasure spirit?<br/><br/>In that moment, he panicked. Although the Heavenly Palace was present, ensuring there must be a way forward, he didn’t want to play the role of a hidden dragon. In Great Abyss Gate, a Lifespirit Treasure determined one’s talent and was also decisive for one’s treatment.<br/><br/>Just when Fang Wang didn’t know what to do, the gates of the Heavenly Palace didn’t close. More light appeared inside, growing brighter and brighter.<br/><br/>“That is…”<br/><br/>Fang Wang looked at the intense light inside the Heavenly Palace and vaguely saw a blurry figure.<br/><br/>…<br/><br/>“I’ve failed!”<br/><br/>Guang Qiuxian said in a deep voice, his face filled with disappointment. He took a deep look at Fang Wang, turned around, and prepared to leave.<br/><br/>Just then, he suddenly felt something and whirled around.<br/><br/>Flames surged in the eyes of the three men as they watched the blaze around Fang Wang grow wildly. His robe was burned to ashes, and the water in the pool evaporated at an extreme speed, filling the corridors of Shiyuan Hall with an overpowering heat.<br/><br/>Yang Yuanzi was moved, and Zhou Xing Shi’s eyes widened in disbelief.<br/><br/>Under their scrutiny, Fang Wang had turned into a man of fire, with roaring flames surging towards the top of his head and converging there.<br/><br/>“Is this… the re-formation of a treasure spirit? How is that possible?”<br/><br/>Yang Yuanzi exclaimed, unable to maintain his composure any longer.<br/><br/>Guang Qiuxian seemed to think of something, his pupils dilated. He took a deep breath and said, “Legend has it that when the Lifespirit Treasure is condensed, a phenomenon of Nirvana rebirth may occur. This often happens to unparalleled geniuses. Lifespirit Treasures capable of Nirvana rebirth… are a mandate of heaven!”<br/><br/>As soon as he finished speaking, he turned to look at Zhou Xing Shi, only to see a black fan taking shape above his head.<br/><br/>“My treasure spirit… why is it out of control…”<br/><br/>Zhou Xing Shi asked in a panic, his gaze involuntarily seeking assistance from Sect Leader Guang Qiuxian.<br/><br/>However, Guang Qiuxian didn’t pay him any attention; he gave Zhou Xing Shi a glance and then turned his gaze back to Fang Wang in the pool.<br/><br/>Elsewhere.<br/><br/>Gu Li, who was meditating in her cave, suddenly opened her eyes. She looked up with a frown, only to see a silver sword appearing above her head.<br/><br/>It was her Lifespirit Treasure!<br/><br/>“What’s going on…”<br/><br/>Gu Li murmured to herself, an inexplicable sense of unease in her heart as she couldn’t recall her own Lifespirit Treasure. Since reaching the Spiritual Refinement realm, it was the first time she had encountered such a situation.<br/><br/>It wasn’t just her. Those Disciples of the Great Abyss Gate flying between the peaks in the Soul Sculpting Realm were also experiencing the same phenomenon, their Lifespirit Treasures materializing above their heads. Some Disciples stopped in their tracks, variously nervous or panic-stricken.<br/><br/>Inside Shiyuan Hall.<br/><br/>The glow of fire lit the faces of Guang Qiuxian, Yang Yuanzi, and Zhou Xing Shi, all three of them in shock, incapable of keeping their composure.<br/><br/>Yang Yuanzi clenched his teeth and said, “My Lifespirit Treasure is also afraid…”<br/><br/>Guang Qiuxian’s face was grim and he remained silent, but his heart was equally turbulent.<br/><br/>They saw that among the roaring inferno above Fang Wang’s head, the shape of a Divine Weapon gradually took form. It wasn’t a sword but a long polearm!<br/><br/>At that moment, Fang Wang, in an introspective state, also saw this long polearm.<br/><br/>Boom!<br/><br/>The darkness shattered, his consciousness flickered, and suddenly he felt his feet touch the ground. He opened his eyes in surprise to find himself inside the Heavenly Palace.<br/><br/>A polearm nearly ten feet long stood before him, with an elusive Azure Dragon coiling around it. The halberd was embellished with crescent blades on both sides, each a third of the length of the halberd. Between the two blades ran the body of the polearm, shaped like a coiled dragon with its maw open to the skies, spitting out the blade, and the tail as sharp as a short sword. The body of the polearm was pitch black, emitting a faint glow.<br/><br/>What an imposing halberd!<br/><br/>Fang Wang instinctively reached out and grasped the halberd. In that instant, his body’s Solaris True Fire surged out, wrapping around the polearm. Blades at both ends caught flame, and even the sharp tail end ignited. Fiery patterns covered the shaft, adding both color and a divine aura to the weapon.<br/><br/>The moment he grasped the halberd, Fang Wang sensed a connection to it as if it were a part of his own body.<br/><br/>An intense emotion urged him to name the halberd, and he slowly voiced his thought, “Heavenly Palace Halberd!”<br/><br/>Named for the Heavenly Palace!<br/><br/>In an instant, his consciousness returned to reality, and he stood up instinctively.<br/><br/>Under the watchful eyes of Guang Qiuxian and the others, Fang Wang rose, flames engulfing his body, and gripped the halberd-shaped treasure spirit above his head. At this moment, his stance was like that of a war deity, imposing and towering. Compared to before, he was a changed man.<br/><br/>Unable to help himself, Yang Yuanzi turned to Guang Qiuxian and asked, “The Mysterious Origin Treasure Spirit has mysterious light, and the Earth Origin Spirit Treasure can devour nature’s spiritual energy. Then… what rank should a treasure spirit that undergoes Nirvana rebirth, causing other Lifespirit Treasures to fear, belong to?”<br/><br/>He had a hunch, but he dared not say it aloud.<br/><br/>Guang Qiuxian stared intently at Fang Wang’s posture and uttered two words, “Heaven Yuan!”<br/><br/>Zhou Xing Shi was stupefied, standing in place without noticing the murderous gaze Yang Yuanzi directed at him.<br/><br/>Meanwhile, all the flames around Fang Wang poured into the Heavenly Palace Halberd, revealing his figure. The ten-foot-long Heavenly Palace Halberd in his hands appeared incredibly formidable.<br/><br/>Fang Wang firmly planted the halberd’s tail into the bottom of the pool, and a terrifying wave of energy swept out, forcing Guang Qiuxian to take action again. This time, even Shiyuan Hall trembled.<br/><br/>“Sect Leader, what is the rank of my treasure spirit?”<br/><br/>Fang Wang looked at Guang Qiuxian and asked, holding back his excitement. He could clearly feel the Spiritual Power within him boiling and transforming.<br/><br/>Spiritual Refinement Realm!<br/><br/>Guang Qiuxian, while staring at the Heavenly Palace Halberd, said, “Above the Earth Origin Spirit Treasure, the exact rank, I do not know, for I have never seen a Heaven Yuan Spirit Treasure…”<br/><br/>His gaze then shifted sideways to Zhou Xing Shi.<br/><br/>Sensing the threat, Zhou Xing Shi took two steps back and hastily said, “I… I will never speak of this!”\t\t\t\t\t\t</div>", "images": {}, "success": true}