{"id": 13, "url": "https://www.novelhall.com/i-became-an-immortal-on-mortal-realm-32879/14234575.html", "title": "Chapter 13 - 13 Chapter 11 I Disagree_1", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 13 - 13 Chapter 11 I Disagree_1</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\t13 Chapter 11 I Disagree_1<br/><br/>Translator: 549690339<br/><br/>Across the plains, Fang Wang kept to his own pace, having been overtaken by seven people so far, yet he wasn’t in a hurry, he even wanted to see if Zhou Xue could catch up.<br/><br/>Among the remaining eight from the Fang Residence, he estimated that only Zhou Xue could catch up. Although Fang Hanyu had cultivated Spiritual Power, he was still merely a Martial Artist and climbing over that high mountain alone would be enough to stump him, let alone catching up to this point.<br/><br/>As Zhou Xue had said, the assessment here was aimed at those with a certain foundation in cultivation, it was not for ordinary people to mix in.<br/><br/>Time continued to pass.<br/><br/>Half an hour later, Fang Wang saw a majestic fog arise on the horizon, with vague outlines of mountain ranges visible, imposing and mysterious. In front of these ranges, the high mountains on either side of the plains simply didn’t compare.<br/><br/>At first glance, Fang Wang thought of the Great Abyss Gate.<br/><br/>Could it be that the area ahead was the land of the Great Abyss Gate’s sect?<br/><br/>Fang Wang thought with anticipation. Soon, he saw many people stopped in front of a cliff. As he was about to stop, he heard someone shout, “I give up!”<br/><br/>As the words fell, a streak of green light descended from the sky, brushed past the person, a thread of green light split off, wrapped around the person, and took him soaring away, rapidly vanishing into the thick fog in front of the cliff.<br/><br/>Was that a Magic Artifact?<br/><br/>Even with Fang Wang’s eyesight, he couldn’t see what it actually was.<br/><br/>Fang Wang went to a deserted spot, stood at the edge of the cliff and looked down; it was bottomless and pitch black below, while the sides were shrouded in heavy fog. He looked up, estimating that to reach the mountains behind the fog it would be at least ten miles away.<br/><br/>He must fly over!<br/><br/>Fang Wang turned his head to look around. Some people who had previously used Sword Control Technique were now at a loss as well. Judging by their weary looks, their Spiritual Power was probably depleted, some even sat down on the spot, taking Elixirs.<br/><br/>Was this also possible?<br/><br/>Fang Wang wasn’t unconvinced, but he marveled inwardly at the difference of those from prominent families.<br/><br/>“What are you looking at, has your Spiritual Power run out?”<br/><br/>A familiar voice came from behind him, and Fang Wang turned to see Zhou Xue landing in front of him on a Flying Sword.<br/><br/>Fang Wang was curious. Where did this Flying Sword come from?<br/><br/>Zhou Xue didn’t jump down from the Flying Sword but instead waved her hand. A slender Flying Sword flew out from her storage bag, and Fang Wang reached out to catch it.<br/><br/>As soon as he gripped the sword, he could feel the Spiritual Power within. This was no ordinary sword; it was a magic sword.<br/><br/>Fang Wang looked at Zhou Xue in surprise and asked, “Where did you get this?”<br/><br/>Zhou Xue’s lips curved upward, and she waved her hand dismissively, turned, and flew away, disappearing into the fog in the blink of an eye.<br/><br/>Fang Wang thought back to the earlier exchange of blows between two figures. Could Zhou Xue have stolen it?<br/><br/>Indeed, such an action was very much in keeping with a Demonic Cultivator.<br/><br/>Fang Wang didn’t dwell on it any further and directly connected his Spiritual Power with the sword. Then, he leaped up, the Flying Sword landing beneath his feet, carrying him into the fog.<br/><br/>The Sword Control Technique of the Great Perfection allowed him to easily control the sword. Of course, it was also because this sword was not too powerful an artifact. According to Zhou Xue, powerful artifacts were difficult to subdue, and Cultivators needed to cultivate their Lifespirit Treasure to manipulate them well.<br/><br/>Whoosh whoosh whoosh—<br/><br/>The strong wind whistled past his face, and Fang Wang smiled. Sword flight was indeed supreme.<br/><br/>With his feet on the Flying Sword and facing the wind, his spirits were lifted, standing proudly in the firmament. A bold spirit welled up in his chest; no wonder people sought the path of cultivation.<br/><br/>Entering the fog, Fang Wang suddenly heard some unusual noises and immediately drew the Treasured Sword from his waist.<br/><br/>A black hawk suddenly pounced out, its claws fiercely aiming for him at a speed surpassing that of the top martial artists of the pugilistic world. Fang Wang raised his hand and slashed, his Spiritual Power condensing into Sword Qi and slicing the hawk down.<br/><br/>The black hawk turned into smoke and dissipated, causing Fang Wang to raise an eyebrow.<br/><br/>It wasn’t a living creature!<br/><br/>It seemed it was part of the assessment!<br/><br/>Fang Wang continued to control his Flying Sword forward while keeping a vigilant defense. Black hawks emerged now and then from various directions as he went, each one smoothly dealt with by him.<br/><br/>It wasn’t too difficult.<br/><br/>As he journeyed forward and passed through the heavy fog, he beheld a majestic range of mountains that seemed to stand upon the clouds. Peeks rose behind the mountain range, the tallest reaching into the clouds, too high for him to gauge.<br/><br/>Above Fang Wang’s head, a line of white cranes showed the way. Following them, he landed on a vast open space where Zhou Xue was already waiting.<br/><br/>After landing, Fang Wang gripped the Flying Sword in his hand and scanned the area. Aside from the Tai Yuan Sect Disciples guarding the front, there were a total of sixteen examinees present, each of them looking formidable.<br/><br/>Gu Li glanced at Fang Wang and didn’t pay much attention. She remembered this boy, who had run on foot; it was clear his family was not very rich, at least not a threat to her next objectives.<br/><br/>Zhou Xue walked next to Fang Wang and exclaimed, “So quick, I thought you’d need some time to get used to it.”<br/><br/>Fang Wang smiled and replied, “It did take a little time.”<br/><br/>The two of them stood together, conversing in hushed tones, while the others dispersed, not approaching each other.<br/><br/>Time kept flowing.<br/><br/>Cultivators, one after another, crossed the fog and landed on this open space. Fang Wang noticed that even the weakest among them carried the aura of at least the fifth level of the Qi Cultivation Realm, which left him with profound reflections.<br/><br/>No wonder the treatment here is greater; they are all top students.<br/><br/>An hour later.<br/><br/>The number of entry-level disciples at this location had already surpassed fifty, astonishment filled Fang Wang’s heart.<br/><br/>Just in this place, there are fifty people, plus those who passed earlier, at least five hundred people passed the entrance assessment, and this is only in Taiyuan Town. How much larger must the number of disciples recruited by Taiyuan City be? Thousands every five years?<br/><br/>“This is why I chose Great Abyss Gate. A hundred years from now, Great Abyss Gate will become the strongest sect in Da Qi.” Zhou Xue’s voice reached him, employing the Sound Transmission Technique, prompting Fang Wang to unavoidably turn his head to look at her.<br/><br/>The strongest sect?<br/><br/>Fang Wang believed her, after all, Zhou Xue was a reborn individual, and he looked forward even more to his own cultivation years at Great Abyss Gate.<br/><br/>Some time passed, and suddenly a white crane descended from the sky. Lying on the back of the crane was unexpectedly a short, chubby old man. Fang Wang had noticed the white crane before but did not see that there was a person on its back.<br/><br/>As the white crane landed, the short, chubby old man slowly sat up. Though he was dressed in the Dao Robe of Great Abyss Gate, he looked out of place and sloppy with no air of immortality.<br/><br/>Upon seeing the other man’s demeanor, Fang Wang instantly labeled him as a highly skilled individual in his heart.<br/><br/>This person must be very powerful!<br/><br/>The short, chubby old man stroked his beard, scanning all those present before smiling and saying, “Not bad, not bad, a total of fifty-two people. It looks like my Great Abyss Gate is on the rise. You have the potential to become branch disciples of Great Abyss Gate just by making it here.”<br/><br/>“Within Great Abyss Gate, status and treatment are divided from low to high into Outer Sect Disciples, Inner Sect Disciples, Branch Disciples, Sword-bearing Disciples, and Direct Disciple. Outer Sect Disciples and Inner Sect Disciples can also choose a lineage to cultivate in, starting as servants, while Branch Disciples can directly choose a master on the peak of your chosen lineage.”<br/><br/>Everyone listened intently, making the short, chubby elder smile with satisfaction.<br/><br/>“Let me introduce myself. I am a Revered Elder of a lineage, you can call me Greedy Sleeper. Don’t laugh at my name; in the world of cultivation, it carries quite a reputation,” said the short, chubby old man, also known as Greedy Sleeper, with a proud laugh.<br/><br/>A young man in blue clothes showed respect and admiration as he bowed and said, “I have indeed heard of the illustrious Greedy Sleeper. It is said that, a hundred years ago in the great war between good and evil, you singlehandedly, with one sword, entered Ancient Demon Mountain and slew over a thousand demon heads. That battle significantly weakened the morale of the Demonic Path and allowed peace to arrive early.”<br/><br/>On hearing this, Greedy Sleeper couldn’t help but raise his chin high with an air of superiority.<br/><br/>Gu Li glanced at the young man in blue, and though her face was covered by a veil, a clear look of disdain was evident in her eyes.<br/><br/>Most people looked on with faces full of admiration; it was clearly the first time they had heard this legend.<br/><br/>Fang Wang thought to himself that this indeed seemed to be a highly skilled individual.<br/><br/>Probably one of the top figures in Great Abyss Gate. He may appear casual and sloppy, but he must be very fierce when it matters.<br/><br/>“Alright, back to the matter at hand. You have already become branch disciples, and now you can compete for Sword-bearing Disciple and Direct Disciple,” Greedy Sleeper cleared his throat and said with a serious tone.<br/><br/>A woman couldn’t help but ask, “Can we directly compete to become a Direct Disciple? Such a precedent doesn’t exist among the Nine Great Sects.”<br/><br/>The other scions of great families all murmured in low voices, appearing excited.<br/><br/>Greedy Sleeper said proudly, “That used to be the case, but from now on it’s different. Great Abyss Gate is breaking old conventions to better assist geniuses in their growth. All of you are within the Qi Cultivation Realm, and you can contend for it now. Those who wish to become a Direct Disciple can step forward and battle all others. If you win, you will become a Direct Disciple, and the five best performers can become Sword-bearing Disciples.”<br/><br/>Contend against everyone!<br/><br/>Upon these words, everyone fell silent.<br/><br/>Fang Wang instinctively glanced at Zhou Xue, asking with his eyes if she intended to compete.<br/><br/>Zhou Xue slowly nodded her head, but there was a slight frown on her brow, clearly caught off guard.<br/><br/>Could it be that this person was not a disciple of Great Abyss Gate in her previous life?<br/><br/>Fang Wang couldn’t help but mock in his heart; he started to doubt Zhou Xue’s intentions toward Great Abyss Gate.<br/><br/>Gu Li spoke up, “May I ask the elder, if there is more than one person who wants to become a Direct Disciple, who will contend against everyone?”<br/><br/>This question prompted nods from a dozen or so people, all of whom were full of confidence.<br/><br/>Greedy Sleeper smiled cryptically and said, “That depends on you. A Direct Disciple also has the authority to enforce laws and manage disciples within the same lineage, so you must have the ability to command respect.”<br/><br/>Gu Li immediately stepped forward and declared, “My name is Gu Li, from the Luo Bei Gu Family. I have been cultivating for twelve years and have reached the ninth level of the Qi Cultivation Realm. I have learned the Five Sacred Sword Technique from my father Gu Tianxiong, and I wish to become a Direct Disciple. Who disagrees?”<br/><br/>The Luo Bei Gu Family!<br/><br/>Most people present were moved, making Fang Wang curious about the strength of Luo Bei Gu Family.<br/><br/>The man wearing a bamboo hat, with his arms folded across his chest, hummed, “The Luo Bei Gu Family is indeed qualified. Let’s give you this opportunity, and I am interested to see if your Five Sacred Sword Technique can overpower all adversaries of the same realm.”<br/><br/>With that, no one dared to stand up.<br/><br/>Fang Wang inwardly sighed, wondering when the Fang Family from Southern Hills would have such influence?<br/><br/>“Hurry up; the benefits of being a Direct Disciple are beyond your imagination. My physical talents do not match yours, I have many chances to fight for, but it’s different for you. Your path to cultivation cannot always rely on me, unless you also want to become a Demonic Cultivator. As for the Luo Bei Gu Family, they will be wiped out in no more than twenty years and won’t threaten you!” Zhou Xue’s transmitted message arrived.<br/><br/>Fang Wang had been prepared for a long time; he would have stood up even without Zhou Xue’s urging, but her words lifted some of his burden.<br/><br/>He thought it over, then Fang Wang stood up and said, “I disagree!”<br/><br/>Instantly, all eyes landed on him, causing his heart to skip a beat, but he still pretended to be composed and looked steadily at Gu Li.\t\t\t\t\t\t</div>", "images": {}, "success": true}