{"id": 12, "url": "https://www.novelhall.com/i-became-an-immortal-on-mortal-realm-32879/14234573.html", "title": "Chapter 12 - 12 Chapter 10 Rise To Power_1", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 12 - 12 Chapter 10 Rise To Power_1</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\t12 Chapter 10 Rise to Power_1<br/><br/>Translator: 549690339<br/><br/>“`<br/><br/>Compete with the great cultivation families!<br/><br/>The disciples from the Fang Residence were frightened, and even Fang Hanyu subconsciously tightened his grip on his sword sheath.<br/><br/>Zhou Xue said no more, and took the lead onto the street, following the flow of people, with Fang Wang and others closely following her.<br/><br/>Along the way, Fang Wang was sensing the energy of the people around him; not everyone could hide their aura like Zhou Xue, and he felt quite a few fluctuations of spiritual power.<br/><br/>Many people had cultivated spiritual power, including ordinary people like the Fang Family Disciple, so they did not stand out.<br/><br/>It seemed that there were varying degrees of strength even among the so-called cultivation families. Perhaps having a cultivator among one’s ancestors was enough to be considered one.<br/><br/>As Fang Wang thought about this, he quickly noticed a figure whose spiritual power was extremely strong, nearly catching up to his own.<br/><br/>The person was wearing a bamboo hat and black clothes, carrying a bookcase on his back, with a gourd hanging from his waist, a peculiar attire that drew the gazes of many.<br/><br/>Taiyuan Town had one main street that led straight to a large lake at the end. Surrounded by the high mountains and the town itself, the lake was over a hundred zhang in diameter and the water was a greenish color. Under the sunlight, it shimmered brilliantly.<br/><br/>There was a row of men and women on the lakeshore, wearing the same robes, all standing tall, the men handsome and the women beautiful, like descendants of immortals. They looked like Tai Yuan Sect Disciples judging by their white robes outlined with black sleeves, shoulders, waistbands, and boots, embroidered with exquisite patterns.<br/><br/>Zhou Xue stopped, and Fang Wang and the others stopped close to her, looking around to see that there were at least five hundred people gathered, a number that was still growing.<br/><br/>This caused Fang Wang to feel astonished; while living in Southern Hills City, he had been completely unaware of the existence of the Cultivation World. Now, far from the secular world, there were so many people pursuing the path of immortality.<br/><br/>Southern Hills City was one of the richest cities in Da Qi, with many past martial arts masters. Fang Wang knew many of them, and yet he had never heard of cultivation. This showed how great the cognitive gap between immortals and mortals was.<br/><br/>Zhou Xue remained silent, while the other people from the Fang Residence whispered among themselves. Fang Hanyu looked around, seemingly calm, but Fang Wang noticed that the boy clenched tightly onto his sword sheath, obviously very nervous.<br/><br/>After about half an hour, the gathering at the lakeside had surpassed a thousand, and even people appeared whose cultivation Fang Wang could not see through at all.<br/><br/>Boom—<br/><br/>The same bell from earlier rang out again, quieting everyone by the lake.<br/><br/>Fang Wang focused his gaze and noticed a male disciple striking the bell; despite being only the size of a palm and made of brass, a light tap with an iron pin produced an earth-shaking, forest-startling effect.<br/><br/>Another male disciple stepped forward, appearing to be in his early thirties with a refined demeanor.<br/><br/>“I am a fifth lineage disciple of the Great Abyss Gate, Guan Linfeng, and I will be overseeing the entrance examination today. The examination is divided into two parts: the first is to summon spiri. One by one, you will come before me and place your hand on the spirit stone in my hand. Those who can make the spirit stone glow can immediately proceed to the next part.”<br/><br/>“The second part is beyond me, over this lake and across that mountain. Follow the guidance of the cranes in the sky, and press forward. The road will be rough, and if you shout out loud that you give up, someone will save you. The further you travel, the higher your score. Remember, do not stray from the direction pointed by the cranes. Otherwise, should you die, it will be upon your own head.”<br/><br/>The disciple who identified himself as Guan Linfeng spoke without arrogance, yet his words carried an indescribable oppressiveness.<br/><br/>Fang Wang looked up and, sure enough, saw a crane circling above the mountain peak. Looking further, there were other cranes in the sky; from his angle, they formed a straight line.<br/><br/>Looking at the large lake before them, the Fang Family Disciples felt panic setting in. Aside from Zhou Xue, Fang Wang, and Fang Hanyu, the others, although they practiced martial arts, had skills likened to a three-legged cat. How were they to cross this lake, let alone surpass that mountain which was at least one hundred and fifty zhang high?<br/><br/>Zhou Xue comforted them by saying, “As long as you can make that spirit stone light up, that counts as being admitted. The second part is for those who have a foundation in cultivation to compete over.”<br/><br/>Upon hearing this, everyone breathed a sigh of relief.<br/><br/>Fang Hanyu looked at Fang Wang and asked, “Can your Sword Control Technique fly over that mountain?”<br/><br/>Fang Wang raised his eyebrows and asked with a smile, “Why? Want me to carry you?”<br/><br/>At this, Fang Hanyu rolled her eyes and said impatiently, “As if, I was just asking. I don’t need your help, and don’t you help anyone else either. Flying with someone using the Sword Control Technique is sure to consume a great deal of spiritual power. You should strive to bring honor to the Fang Residence as much as possible.”<br/><br/>Her words also served as a reminder to the other Fang Family Disciples.<br/><br/>Fang Wang shook his head with a wry smile and said no more.<br/><br/>Meanwhile, people had already started approaching Guan Linfeng, and a long queue soon formed. Zhou Xue led the group to line up.<br/><br/>“Pass!”<br/><br/>Guan Linfeng’s voice rang out from ahead, and Fang Wang saw a man leap into the air. A flying sword flew out from the storage bag at his waist, expanded quickly, and landed beneath his feet, carrying him towards the horizon.<br/><br/>This scene caused a stir among the onlookers, making them even more yearning for the Great Abyss Gate.<br/><br/>A young man from the Fang Residence named Fang Mo remarked, “If one can master the Sword Control Technique, couldn’t they achieve the highest score?”<br/><br/>Zhou Xue glanced at him and said, “It’s not that simple. How do you know how long the journey is, and if there are any magical beasts or spirit demons obstructing the route in the sky?”<br/><br/>Upon hearing this, Fang Mo scratched his head and gave a sheepish smile.<br/><br/>The first part of the assessment went quickly, with an average of ten breaths per person. Fang Wang and his group were not too far back in the queue, so they patiently waited.<br/><br/>Under Zhou Xue’s arrangement, Fang Wang was to go first, and she would be last, making it easier to look after everyone else.<br/><br/>This careful planning made Fang Wang doubt if she really was a demonic cultivator.<br/><br/>Could a demonic cultivator become an Immortal Venerable?<br/><br/>“`<br/><br/>Could she be bluffing him?<br/><br/>Fang Wang pondered in his heart, finding himself increasingly unable to see through Zhou Xue. Ever since acclimating to her rebirth, she had become unfathomable, like in the recent nights when he would hear the sound of her footsteps leaving, not knowing what she was up to.<br/><br/>He had considered whether to fawn over Zhou Xue like a madman, in hopes of gaining more cultivation methods, but he quickly discarded the thought. Apart from the doubt whether Zhou Xue would fall for it, he also didn’t want to demean himself.<br/><br/>Moreover, he couldn’t follow Zhou Xue’s path completely. Since Zhou Xue had been reborn, it meant that she had failed in her previous life, and he must carve out an even stronger path for himself.<br/><br/>Time raced by as Fang Wang was lost in thought.<br/><br/>Gradually, it was his turn to undergo the assessment. He had noticed earlier that the light each person could evoke from the Spirit Stone varied, with more than half of them unable to make the Spirit Stone light up at all.<br/><br/>Having cultivated Spiritual Power, he naturally wasn’t worried; he was just curious about how bright the light he could evoke would be. He suspected that the brighter the light, the better the talent.<br/><br/>He walked up to Guan Linfeng, laying his right hand on the Spirit Stone in Guan’s hand.<br/><br/>A cool sensation penetrated his palm, followed by a sucking force tugging at the Spiritual Power within his body. He offered no resistance, and as the Spiritual Power entered the Spirit Stone, it burst into light.<br/><br/>“Pass!”<br/><br/>Guan Linfeng spoke, his expression unchanged.<br/><br/>Fang Wang was also slightly disappointed; the light was clearly brighter than that of those before him, but it didn’t seem to indicate aptitude, maybe it was just related to cultivation level.<br/><br/>Without dwelling on it, after giving Guan Linfeng a fist salute, he walked toward the lake. With a leap, he jumped into the lake, treading on its surface and swiftly skimming away.<br/><br/>This scene did not catch the attention of the Tai Yuan Sect Disciples, as others had done the same before, since not everyone knew the Sword Control Technique.<br/><br/>Guan Linfeng called another Disciple over to take his place, then turned to watch as Fang Wang’s figure glided over the lake surface like a swan goose, then stepped on the cliff face, climbing with ease as if on level ground.<br/><br/>Fang Wang’s performance lifted the spirits of Fang Hanyu and the others. No matter what, with Fang Wang there, the Fang Residence wouldn’t lose face. Even though they had no reputation here, there was still a hint of pride in their hearts.<br/><br/>“Impressive.”<br/><br/>Guan Linfeng murmured to himself as he watched Fang Wang reach the summit, his eyes filled with appreciation.<br/><br/>“This group of Disciples is extraordinary; there might emerge someone on the level of a single-school senior Disciple. Who knows who will seize that Superior Grade Spiritual Weapon and command the winds and clouds.”<br/><br/>Meanwhile, Fang Wang stood atop the mountain, the breeze fluttering his fitted white garb, with the locks of hair beside his temple flying backward, revealing his handsome face.<br/><br/>Looking at the magnificent plains ahead, Fang Wang was awestruck by the scenery that unfolded behind the mountain, with two rows of towering mountains stretching to the horizon, and a vast plain between them as if cleaved by an Immortal’s sword.<br/><br/>Fang Wang did not have long to admire the view; he leaped down, the wind roaring past him as he plummeted, and just before hitting the ground, he drew his Treasured Sword, twisting in mid-air to stab it into the mountainside. As the Sword Blade cut through the rock and debris flew, his descent slowed significantly.<br/><br/>The Treasured Sword he had spent a fortune on was deservedly hard!<br/><br/>Less than five feet from the ground and nearly stopped, he immediately pushed off the cliff, pulling the Sword Blade free from the mountain, flipping in the air, and landing steadily on the grass.<br/><br/>He sheathed his sword and ran in the direction pointed out by the crane in the sky.<br/><br/>Although the Sword Control Technique of Great Perfection could allow him to fly on this sword, it was a huge drain on energy. Since this wasn’t a magic sword and couldn’t channel Spiritual Power, only being enveloped and manipulated by it, he didn’t plan to use it prematurely.<br/><br/>He had a premonition that there might be a battle at the end of this road.<br/><br/>If it were simply about who could run the furthest, it would be just a simple test of Spiritual Power. The Great Abyss Gate would not be so hasty.<br/><br/>Fang Wang sprinted across the plains, employing the Shadowless Step with the support of Spiritual Power which consumed far less than flying on the sword. His speed surpassed that of a swift horse, and at first glance, it looked as if his feet barely touched the ground, people passing and grass flying.<br/><br/>Before long.<br/><br/>Fang Wang saw two figures; they were fighting near the mountain wall ahead on the left side, their movements extremely agile—one wielding a scimitar slashing out like lightning, the other holding a folded fan, unleashing fiery winds that set the grass in a ten-foot radius ablaze.<br/><br/>Fang Wang took only a quick glance, without stopping.<br/><br/>Indeed, such a lengthy path for an assessment surely wasn’t as simple as it seemed on the surface.<br/><br/>A whoosh cut through the air above Fang Wang’s head. He looked up to find a woman in yellow, wearing a Bamboo Hat and a white veil, with three scabbards on her back, the outfit of a wandering heroine. Most crucially, instead of flying on a sword, she was riding on a bright red gourd.<br/><br/>That was too…<br/><br/>Fang Wang envied her; that was definitely a Magic Artifact, and her cultivation level must be quite high, probably in the eighth or ninth layer of the Qi Cultivation Realm.<br/><br/>After just a few glances, he continued at speed on his way, in no rush to catch up.<br/><br/>In the sky.<br/><br/>Gu Li stood atop her precious gourd, gazing into the distance with a distracted look. Even behind the veil, her eyes were capable of sparking wild thoughts.<br/><br/>Suddenly, she seemed to perceive something, turning her head to see a man in black, also wearing a Bamboo Hat, approaching quickly on a Flying Sword. He soon passed by her at amazing speed.<br/><br/>“Qi Cultivation Realm, Layer Nine. It looks like father was right; the Great Abyss Gate is on the rise. But I have no intention of losing to my peers!”<br/><br/>Gu Li snorted coldly and began to accelerate.\t\t\t\t\t\t</div>", "images": {}, "success": true}