{"id": 11, "url": "https://www.novelhall.com/i-became-an-immortal-on-mortal-realm-32879/14234570.html", "title": "Chapter 11 - 11 Chapter 9: Contesting With Cultivation Clans - 1", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 11 - 11 Chapter 9: Contesting With Cultivation Clans - 1</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\t11 Chapter 9: Contesting with Cultivation Clans – 1<br/><br/>Translator: 549690339<br/><br/>The forest was quiet, and heavy fog shrouded the area, with streams of sunlight filtering through gaps in the treetops, forming visible slanting beams of light.<br/><br/>Zhou Xue led the way, with Fang Wang and Fang Hanyu at the rear, the group of nine trekking on foot. They had been walking for nearly two days.<br/><br/>The mountain paths within the forest were not easy to traverse, with many muddy spots along the way. Every so often, they would see snakes, rodents, and spiders, causing the Fang Family Disciples to be extremely tense; they took each step with great caution.<br/><br/>“It’s hard to imagine that a Cultivation Sect is hidden within such deep mountains.”<br/><br/>Fang Hanyu remarked softly, as the Da Qi Kingdom’s vast landscape was filled with countless uninhabited mountain ranges populated by wild beasts and thieves. Even a seasoned martial artist like him seldom set foot in such places.<br/><br/>Fang Wang could sense the rich nature’s spiritual energy in the area; the further forward they went, the denser the Spiritual Energy became, which made him look forward to the Great Abyss Gate even more.<br/><br/>At that moment.<br/><br/>Cries rang out from ahead, sounding like a woman or perhaps a child, giving Fang Wang and the others goosebumps. However, seeing that Zhou Xue did not stop, they continued to follow.<br/><br/>Fang Wang turned to look behind him; the fog was thick, rendering everything beyond seven steps invisible.<br/><br/>He had felt something following them ever since the crying began to echo from up ahead.<br/><br/>Unalarmed, he continued walking with composure.<br/><br/>Soon, the fog up ahead thinned and the terrain leveled out, revealing a woman sitting under an old tree. She wore plain clothes and looked disheveled, clearly a villager from the countryside. She held a child in her arms, sobbing softly.<br/><br/>“Should we ask her what’s wrong?”<br/><br/>asked Fang Xin, the youngest of the group, one year younger than Fang Wang. She was frail, carrying two packs on her back, drenched in sweat.<br/><br/>Another girl, Fang Ziqing, tugged at her, shaking her head in silence.<br/><br/>All eyes turned to Zhou Xue; throughout their journey, she had become their pillar of strength. After all, besides Zhou Xue teaching them the Qi Gathering technique, even Fang Wang, the strongest of them, deferred to her lead.<br/><br/>Zhou Xue didn’t stop. She walked straight towards the woman.<br/><br/>The woman, hearing the footsteps, looked up at Zhou Xue with tear-stained and reddened eyes. She seemed to see a lifeline and reached out to Zhou Xue, crying out, “Miss, please save my child, he was bitten by a poisonous snake…”<br/><br/>Some of the Fang Family Disciples wanted to step forward to help, but then they saw a dagger slide out of the sleeve of Zhou Xue’s right hand, which she swiftly gripped.<br/><br/>The woman’s face turned ashen at the sight of the dagger, and just as she was about to speak, Zhou Xue suddenly hurled the dagger straight at her head.<br/><br/>Bang!<br/><br/>The woman instantly turned into a puff of white smoke, through which the dagger pierced and lodged in the tree trunk.<br/><br/>As the smoke dissipated, the clothes fell to the ground, revealing two weasels, one large, one small, that jumped up and landed on a distant tree. The Fang Residence’s group watched with wide eyes. The woman had been a transformed weasel?<br/><br/>Zhou Xue remained expressionless, her gaze fixed on the two weasels in the tree, her eyes indifferent.<br/><br/>“Impressive skills. You must be at least at the fifth level of the Qi Cultivation Realm. Girl, if you want to join the Great Abyss Gate, why not go to Taiyuan City?” the weasel spoke in the same voice as the woman before.<br/><br/>Zhou Xue replied, “Taiyuan City is too far, and it’s more convenient to visit the Great Abyss Gate directly. We are sincere in our desire to cultivate, and I hope you will not play with us any further.”<br/><br/>The weasel chuckled, humanely waved its paw as if to gesture for them to continue on their way.<br/><br/>Zhou Xue looked back at the rest with a certain look, then continued to lead the way. As they passed under the tree where the weasels sat, everyone was nervous, fearing a sudden attack.<br/><br/>After walking for a while, Zhou Xue finally spoke up to explain, “Those were Spirit Demons. The mountains around the Great Abyss Gate shelter many such creatures. Some are wild; others are raised by the Sect’s Disciples. The ones near the edge are responsible for scaring off mortals who stray too close, giving rise to ghostly legends to keep people away.”<br/><br/>A young Fang Family Disciple couldn’t help but ask, “Just to scare them off?”<br/><br/>“They might also get eaten. While the Great Abyss Gate is considered righteous, there are grey areas between good and evil in the Cultivation World. You must be cautious in your actions.” Zhou Xue said with a smile that seemed rather sinister to the others.<br/><br/>With that, Zhou Xue resumed leading the way.<br/><br/>Fang Wang remained at the end of the group, but his attention was behind them. After passing the Spirit Demons, that feeling of being watched persisted, making him wary.<br/><br/>Half a column of incense later, that feeling of being watched still lingered in Fang Wang’s mind.<br/><br/>“No need to be nervous, he won’t dare to make a move.”<br/><br/>A voice entered Fang Wang’s ears, and he looked up towards Zhou Xue at the front, his expression perplexing.<br/><br/>It seemed only he could hear Zhou Xue’s voice; the others continued on without looking sideways or turning back.<br/><br/>“This is the Sound Transmission Technique. Once inside the Great Abyss Gate, you will learn it too. The person following us is likely related to the Cultivator you killed. These past few days, I’ve been hiding in the deep forest, pretending to study the Soul Burning Banner, but in reality, I’ve been leaving traces for them to follow.”<br/><br/>Zhou Xue’s voice came through again, causing Fang Wang to frown, not understanding her intentions.<br/><br/>“That fellow holds two Magic Artifacts, which means someone is backing him. I fear the Fang Residence will face further danger, so I purposely led the person behind us here to investigate. As long as they know we’re joining the Great Abyss Gate, they won’t act rashly. However important that person may be, they are merely in the Qi Cultivation Realm, and offending a massive entity like the Great Abyss Gate for his sake is not worth it.”<br/><br/>So that was it.<br/><br/>Fang Wang felt it made sense, but another question arose in his mind.<br/><br/>Is the adversary so bold as to follow them here, not fearing discovery by the Great Abyss Gate?<br/><br/>Zhou Xue stopped transmitting her voice, and Fang Wang did not let his guard down, remaining vigilant.<br/><br/>It was not until evening that the feeling of being watched finally disappeared; it seemed the other party dared not to advance any further.<br/><br/>In the woods, the group stopped by a small creek, where they had lit a fire. Fang Wang rested next to Zhou Xue, while the others also sat down together.<br/><br/>“Tomorrow, we will reach the valley town in front of the Great Abyss Gate. Let me tell you in advance that the Great Abyss Gate has nine veins, and the entrance exam is estimated to take place in six to seven days. With your talents, passing the examination won’t be difficult, but I hope each of you will join a separate vein instead of sticking together,” Zhou Xue said softly.<br/><br/>Within the Fang Residence, there were more people capable of cultivation than them. Zhou Xue had selected only the most exceptional group of disciples to come and establish a foothold first.<br/><br/>Hearing that they would have to join a vein on their own, Fang Xin’s face turned pale, and she became nervous, but the other teenagers and young adults were not intimidated; they felt mostly excitement.<br/><br/>Zhou Xue glanced at Fang Wang and Fang Hanyu, saying, “Once you two enter the examination, you must not hold back. Show your talents as much as possible, as this will determine your treatment after you join the Great Abyss Gate. Those with ordinary talents will only become ordinary disciples, and it would take many years of hard work to get promoted.”<br/><br/>“Especially you, Fang Wang, don’t go playing any tricks like pretending to be a pig to eat a tiger at this time.”<br/><br/>Zhou Xue was very concerned about Fang Wang because this young man was too good at hiding his abilities. After her rebirth, she had come to understand that it was not only her, but the entire Fang Residence, including Fang Wang’s parents, who were unaware of Fang Wang’s high martial skills.<br/><br/>She had also wondered why she had never seen Fang Wang make a move in her past life. Later, she realized that on the night the clan was destroyed, she was powerless and had fled immediately, only catching a glimpse of the Qingyi Daoist. She had not seen many of the battles between Fang Family Disciples and the Qingyi Daoist—without the Sword Control Technique, even a strong Fang Wang would have died at the hands of the Qingyi Daoist.<br/><br/>Fang Wang replied helplessly, “I know.”<br/><br/>It made him seem as if he was muddling through life.<br/><br/>Zhou Xue continued to give instructions. She did not explain the specifics of the examination, whether to temper them or for fear of being overheard by the high-ranked members of the Great Abyss Gate.<br/><br/>The night passed without incident.<br/><br/>As the moon set and the sun rose, with the first rays of morning light, Fang Wang and the others continued on their way.<br/><br/>Along the way, they saw many wonders, such as spiders as large as human heads, man-eating trees waving their branches, wild goats with human-like faces, and black cats with five tails. According to Zhou Xue, these were the lowest level of magical creatures, not yet Spirit Demons with the ability to speak human language.<br/><br/>Beyond magical creatures, they also saw many brightly colored flowers and fruits that looked extraordinary. However, after being warned by Zhou Xue about their deadly poison, they dared not touch them.<br/><br/>Finally, after noon, they reached the valley that Zhou Xue had talked about. At the entrance of the valley stood a giant door with a signboard hanging above it:<br/><br/>Taiyuan Town!<br/><br/>Inside the valley, pavilions rose one after another, with smoke from kitchens curling upward, and the surrounding mountains were magnificent, which inexplicably reminded Fang Wang of Five Fingers Mountain, with Taiyuan Town trapped within.<br/><br/>The mountain gate was unguarded, so Fang Wang and the others entered the town directly. The street ahead was busy with many people coming and going, all of whom looked extraordinary. Some even rode cranes into the sky, flying out of the town and quickly ascending the mountains, which caused the Fang Family Disciples to become excited and yearn for more.<br/><br/>At this moment, they truly felt in touch with the path of cultivation.<br/><br/>Along the way, Fang Wang also observed his surroundings. On both sides of the street were various shops, selling elixirs, magic artifacts, talisman paper, cultivation techniques, spells, and even treasures. Even though most shops were not crowded, they still displayed the rich atmosphere of the cultivation world.<br/><br/>Zhou Xue led them to an inn to stay. After paying the innkeeper, a young server brought them upstairs. Apart from Fang Xin and Fang Ziqing, the rest had a room each.<br/><br/>“Tsk, the Great Abyss Gate even collects silver?”<br/><br/>Fang Wang mused to himself. Although he found it odd, seeing the amount of silver Zhou Xue paid, it seemed that even the Great Abyss Gate needed to engage in mundane affairs.<br/><br/>Entering his own room and closing the door, Fang Wang approached the bed and started to tidy up briefly before sitting down to meditate.<br/><br/>With six to seven days remaining, he preferred not to wander aimlessly but to enhance his cultivation as much as possible.<br/><br/>His Solaris Scripture had reached Great Perfection, but Spiritual Power needed to be accumulated over time. Since Zhou Xue said not to hide his abilities, he was going to give it his all.<br/><br/>Thus, Fang Wang remained isolated in his room, and other Fang Family Disciples didn’t dare to disturb him.<br/><br/>After six days.<br/><br/>At the hour of Si, bright daylight shone, and a bell tolled, echoing in the valley, deafening, awakening Fang Wang.<br/><br/>“Has it come?”<br/><br/>Fang Wang thought to himself, a smile appearing on his face.<br/><br/>Last night, he had finally broken through to the seventh layer of the Qi Cultivation Realm. With the power of the Great Perfection in the Solaris Scripture, it had taken him over a month to reach the seventh layer of Qi Cultivation. If he had started from the first layer of the Solaris Scripture, it was hard to imagine how much time it would take to reach this level.<br/><br/>“Hurry up and come out, the entrance exam is about to begin!”<br/><br/>Zhou Xue’s voice came from outside the door, and Fang Wang picked up his Treasured Sword and stepped down from the bed.<br/><br/>Since he had gathered Qi and tempered his body, he did not need to wash or eat, so he did not need to prepare further. He also looked very clean and refreshed.<br/><br/>After half a stick of incense’s time, led by Zhou Xue, Fang Wang and the others left the inn to discover many people doing the same. The streets were also full of groups heading in the same direction.<br/><br/>Fang Wang asked curiously, “You mentioned Taiyuan City before. What’s the difference between Taiyuan City and Taiyuan Town?”<br/><br/>Zhou Xue replied, “Taiyuan City is a city that the Great Abyss Gate opens to the entire cultivation world, while Taiyuan Town is a town of ordinary people cultivated by the Great Abyss Gate itself. The ordinary people living here are responsible for mining various resources for the disciples of the Great Abyss Gate. Those who come to Taiyuan Town almost all have a cultivation background, from cultivation families around the world. Without background and intelligence, this path wouldn’t be discovered.”<br/><br/>“To put it simply, in Taiyuan City, we compete with ordinary people, but here, we are competing against some families with a cultivation background. Of course, being assessed here brings more benefits.”\t\t\t\t\t\t</div>", "images": {}, "success": true}