{"id": 18, "url": "https://www.novelhall.com/i-became-an-immortal-on-mortal-realm-32879/14234585.html", "title": "Chapter 18 - 18 Chapter 16 White Rainbow Evasion Technique Great Perfection, Beginning Spiritual Refinement_1", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 18 - 18 Chapter 16 White Rainbow Evasion Technique Great Perfection, Beginning Spiritual Refinement_1</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\t18 Chapter 16 White Rainbow Evasion Technique Great Perfection, Beginning Spiritual Refinement_1<br/><br/>Translator: 549690339<br/><br/>Fang Wang had not expected Zhou Xue to be so direct. He gave a fake cough and said, “Only if I become stronger can I help you, just like during the crisis when our clan was nearly wiped out.”<br/><br/>Zhou Xue stared into his eyes, making him feel uneasy.<br/><br/>However, the thought of not seeing each other for several years compelled Fang Wang to meet Zhou Xue’s gaze with determination.<br/><br/>After a few moments of eye contact, Zhou Xue revealed a smile and said, “I can only give you one opportunity. Tell me, what type of Supreme Technique do you desire?”<br/><br/>Just one chance?<br/><br/>Fang Wang felt a twinge of disappointment but also understood Zhou Xue. After all, you never know what’s in another’s heart, and considering Zhou Xue had been reborn, only she knew how many times she had been betrayed in her previous life.<br/><br/>Sword Control Technique, Solaris Scripture, and now, Fang Wang owed Zhou Xue even more.<br/><br/>As for owing a life debt, it was Zhou Xue who had saved Fang Wang. Without the Sword Control Technique, Fang Wang would have certainly perished against that cultivator, because with his character, he would never abandon his clan members to escape alone. After all, he had already died once, so in this matter, they had redeemed each other.<br/><br/>How could Fang Wang say to Zhou Xue directly, “I have the Heavenly Palace, you help me become invincible, and I will ensure your eternal peace and safety?”<br/><br/>That’s ridiculous!<br/><br/>No one is the absolute protagonist of the world. Even if Zhou Xue believed him about the Heavenly Palace, Fang Wang still had to consider if the other party might harbor ill will.<br/><br/>In the end, one can only rely on oneself!<br/><br/>After much deliberation, Fang Wang thought he didn’t lack cultivation techniques or combat spells. He was missing a speed-based Supreme Technique, for instance, to increase his chances of escaping when facing an unbeatable enemy, so he shared his thoughts.<br/><br/>“Sword Control Technique is just a basic spell in the Cultivation World. Indeed, you need an evasion technique. I will teach you the White Rainbow Evasion Technique,”<br/><br/>Zhou Xue said thoughtfully. Seeing Fang Wang about to question further, she gave him a stern look and said, “Don’t ask me if this technique is strong or not. You’ll know once you practice it!”<br/><br/>Fang Wang, feeling awkward, could only nod in agreement.<br/><br/>Zhou Xue began to impart the practice methods of the White Rainbow Evasion Technique, and Fang Wang listened intently.<br/><br/>After Zhou Xue finished, Fang Wang was irresistibly drawn back into the Heavenly Palace. Looking at the grandiose inner halls, he sighed.<br/><br/>He had just been brooding for two hundred years, left for less than half an hour, and now he was back again.<br/><br/>But he had no choice since Zhou Xue was about to leave.<br/><br/>He started to practice the White Rainbow Evasion Technique, which was a flying art that allowed one to transform into a white rainbow, streaking across the sky at extreme speeds. At Great Completion, it was as fast as a white rainbow flying across ten thousand miles.<br/><br/>The White Rainbow Evasion Technique wasn’t classified into levels like the Solaris Scripture or the Jinghong Divine Sword Art, so as Fang Wang practiced, he couldn’t see how far he was from achieving Great Perfection.<br/><br/>After sixty-three years of dedicated practice, Fang Wang finally mastered the White Rainbow Evasion Technique to Great Perfection. He was very pleased with the final result; he was indeed as fast as a white rainbow streaking through the sky, and as his cultivation continued to rise, this technique would only become faster.<br/><br/>At least for now, the speed he demonstrated had already surpassed all the flying speeds he had seen since joining the Great Abyss Gate.<br/><br/>Fang Wang’s consciousness returned to the present, his vision cleared, just in time to see Zhou Xue looking at him.<br/><br/>Zhou Xue teased, “How is it, young prodigy? Is the technique difficult?”<br/><br/>Fang Wang raised an eyebrow and said with a smile, “Just average. I’ve already mastered it.”<br/><br/>“Heh heh!”<br/><br/>Zhou Xue couldn’t help but roll her eyes in disbelief. She didn’t press Fang Wang to demonstrate, but instead stood up and said, “Alright, it’s time for me to go. I hope when I return, you will have succeeded in Spiritual Refinement.”<br/><br/>“Make sure to keep in touch with other Fang Family Disciples when you have time. I arranged for you to be separated in different branches for strategic purposes. Even as a one-in-a-million genius, you could face suppression. Even the most righteous sects have internal struggles, and no sect purely regards talent alone. Kinship and interest relations are the foundation of everything,” Zhou Xue advised, worried that Fang Wang would follow the same path as she did in her past life.<br/><br/>Fang Wang nodded. He was not averse to social interactions, especially with his own clan members. Right now, he was just focused on becoming stronger.<br/><br/>Afterward, Fang Wang escorted Zhou Xue out of his cave abode. Zhou Xue left on her sword, turning into a white rainbow and vanishing into the clouds and mist in the blink of an eye.<br/><br/>White Rainbow Evasion Technique!<br/><br/>Fang Wang commented to himself, qualifying it as a minor success. Worthy of a reborn individual.<br/><br/>Suddenly, he heard a noise nearby. Turning his head, he saw Gu Li walking out of her own cave dwelling, her eyes full of complex emotions as she looked at Fang Wang.<br/><br/>Fang Wang felt a chill run down his spine under her gaze. He smiled and gave Gu Li a slight nod.<br/><br/>Gu Li responded with a nod, then left on her sword, which made Fang Wang breathe a sigh of relief. He truly feared Gu Li might cling to him.<br/><br/>Afterward, Fang Wang returned to his cave dwelling to continue his practice.<br/><br/>…<br/><br/>Three months later, Fang Wang’s Spiritual Power had reached a full state, and he felt he couldn’t further improve. So, he left his cave dwelling to visit his master, Yang Yuanzi.<br/><br/>Inside Qingxin Hall.<br/><br/>Yang Yuanzi looked at Fang Wang curiously and said, “Indeed, you’ve reached the state necessary for Spiritual Refinement. Have you been cultivating for a full year yet?”<br/><br/>Fang Wang responded, “Almost, I suppose.”<br/><br/>Yang Yuanzi’s lip twitched, and he sighed, “With your talent, you should be at the first branch. The Nine Heavens Azure Thunder Sword Formation is powerful, but it’s too difficult to learn. The inheritance of the first branch is also very strong.”<br/><br/>“Having joined the third branch, how could I be so fickle? Master, rest assured, I will cultivate diligently and bring honor to the third branch!” Fang Wang replied earnestly.<br/><br/>He purposefully made his stance clear, hoping to become the eldest disciple sooner and then obtain the inheritance of the Nine Heavens Azure Thunder Sword Formation. Even if he stepped back and became the eldest disciple, he would access more resources for cultivation.<br/><br/>Armed with the Great Perfection level of the Solaris Scripture and the cave dwelling of a direct disciple, Fang Wang didn’t currently need resources, but he wouldn’t be complacent. He believed that the realms ahead were even more difficult.<br/><br/>Even someone as strong as Zhou Xue had to seek opportunities everywhere.<br/><br/>When Yang Yuanzi heard Fang Wang’s words, he didn’t smile; instead, he shook his head and followed with, “All nine veins have their own Spirit Molding Ground, but your talent in cultivation is indeed rare in a century. Let me take you to meet the Sect Leader, the Spirit Molding Ground at the main peak is more effective.”<br/><br/>Fang Wang was overjoyed and quickly thanked his master.<br/><br/>This way, Fang Wang accompanied Yang Yuanzi to the main peak to meet with Sect Leader Guang Qiuxian in the Shiyuan Hall.<br/><br/>Hearing that Fang Wang was about to undergo Spiritual Refinement, Sect Leader Guang Qiuxian wasn’t surprised, as he had long been aware of Fang Wang’s cultivating pace. He stroked his beard and laughed, “Of course, you may. Let’s go; someone happens to be undergoing Spiritual Refinement right now, so you can take a look.”<br/><br/>He stood up and led Yang Yuanzi and Fang Wang toward the side hall.<br/><br/>They wound through the convoluted corridors and arrived deep within the Shiyuan Hall, at a spot connected to the mountain cliff where a waterfall descended from the clouds, forming a pond. Inside the pond, a bare-chested man was undergoing Spiritual Refinement.<br/><br/>Standing on the corridor, Fang Wang saw a set of clothes and a book chest nearby and realized this person was the man in black he met in the same period, previously wearing a bamboo hat, wrapped tightly, so he didn’t recognize him at first glance.<br/><br/>“This man’s name is Zhou Xing Shi. He joined Great Abyss Gate with you and was defeated by you. He has now joined the second vein. Don’t underestimate him; he is about to create his own Mysterious Origin Treasure Spirit.”<br/><br/>Sect Leader Guang Qiuxian stroked his beard and laughed, feeling proud as more and more geniuses emerged in Great Abyss Gate.<br/><br/>Yang Yuanzi hummed, “You had him undergo Spiritual Refinement here because you thought he could create an Earth Origin Spirit Treasure, right?”<br/><br/>“There’s always something to hope for.”<br/><br/>“Ha, someone with talents like Lu Yuanjun comes once in centuries; he’s not someone you encounter easily.”<br/><br/>“Oh, is that so? You lack confidence in your disciple?”<br/><br/>Listening to their conversation, Fang Wang felt something was off—as if there was some kind of overt and covert rivalry between them. Could it be they didn’t get along?<br/><br/>No wonder the Sect Leader initially had some objections to him going to the third vein.<br/><br/>This was bad, had he sided with the wrong faction?<br/><br/>Was the third vein being marginalized by the Sect Leader?<br/><br/>Yang Yuanzi hummed, “We will see soon enough!”<br/><br/>Fang Wang watched Zhou Xing Shi. Zhou looked to be in his twenties or thirties, with a somewhat weather-beaten face. Around him, strands of black light whirled like a vortex towards his head.<br/><br/>There, a black fan was slowly taking shape, becoming more solid, with a hint of metallic luster.<br/><br/>Is this the Treasure Spirit?<br/><br/>Fang Wang was filled with anticipation for his own Treasure Spirit.<br/><br/>Sect Leader Guang Qiuxian and Yang Yuanzi stopped their quarreling and watched intently.<br/><br/>After an incense stick’s time, the black fan above Zhou Xing Shi’s head suddenly fluttered, sending a wave of visible black energy sweeping across the pool’s surface, severing even the waterfall as it nearly crashed into Shiyuan Hall. Guang Qiuxian raised his hand, blocking it with his own spiritual power.<br/><br/>Boom—<br/><br/>The black energy collided with an invisible barrier and dispersed instantly. Fang Wang’s robes whipped in the wind, and his sideburns fluttered; he couldn’t help but look at Guang Qiuxian in awe.<br/><br/>What realm was the Sect Leader in?<br/><br/>Just the aura alone made Fang Wang feel unable to contend.<br/><br/>In the pool, Zhou Xing Shi slowly opened his eyes, lifted his right hand, and the black fan above quickly descended into his grasp. Holding the fan, he smiled, seemingly relieved.<br/><br/>“A Superior Xuan Yuan Spirit Treasure, impressive indeed. Enough to rank him among the top ten disciples of the current generation,” praised Sect Leader Guang Qiuxian.<br/><br/>Zhou Xing Shi stood up and gave his respects to Guang Qiuxian. He also noticed Fang Wang’s arrival.<br/><br/>Sect Leader Guang Qiuxian turned to Fang Wang and smiled, “Go ahead, meditate in the pond. While cultivating, imagine the Treasure Spirit you desire. The spiritual energy of nature here will aid you in molding your own Treasure Spirit.”<br/><br/>Fang Wang nodded and immediately approached the pond, while Zhou Xing Shi followed and nodded at him in greeting.<br/><br/>Sitting cross-legged in the middle of the pond, Fang Wang took a deep breath, closed his eyes, and began his cultivation.<br/><br/>After putting on his clothes, Zhou Xing Shi didn’t leave but stayed to watch Fang Wang undergo Spiritual Refinement.<br/><br/>With the three people watching, Fang Wang felt some pressure, but he soon cast away all external distractions.<br/><br/>According to the cultivation guidelines, Lifespirit Treasures from low to high are classified as Yellow Origin, Mysterious Origin, Earth Origin, and Heaven Yuan Spirit Treasures. Each rank is further divided into lower, middle, upper, and supreme grades. The highest grade Spirit Treasure ever seen in the history of Great Abyss Gate has been a Lower Grade Earth Origin Precious Spirit.<br/><br/>It is said Lu Yuanjun’s own Lifespirit Treasure reached a middle-grade Earth Origin Spirit Treasure, breaking the historical limit of Great Abyss Gate and being the reason for the sect’s current revival.<br/><br/>Creating a Lifespirit Treasure requires a special Heavenly Dao Spirit Stone, only upon which can one create their Lifespirit Treasure. Beneath the pond where Fang Wang sat was a huge Heavenly Dao Spirit Stone.<br/><br/>The Nine Great Sects dominate the Da Qi Cultivation Realm because they control the highest-grade Heavenly Dao Spirit Stones, not just one but several. Many cultivator families unable to undergo Spiritual Refinement can only have their family disciples join one of the Nine Great Sects.<br/><br/>Fang Wang began to imagine the form of his own Lifespirit Treasure.<br/><br/>His first choice was a sword since his strongest move was now the Jinghong Divine Sword Art.<br/><br/>Gradually, faint flickers of light swirled around him, gathering towards his head, much like Zhou Xing Shi had before.\t\t\t\t\t\t</div>", "images": {}, "success": true}