{"id": 29, "url": "https://www.novelhall.com/i-became-an-immortal-on-mortal-realm-32879/14234618.html", "title": "Chapter 29 - 29 Chapter 27: Nine Dragons Divine Transformation Art, Li Honggang_1", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 29 - 29 Chapter 27: Nine Dragons Divine Transformation Art, Li Honggang_1</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\t29 Chapter 27: Nine Dragons Divine Transformation Art, Li Honggang_1<br/><br/>Translator: 549690339<br/><br/>The Ji Hao Sect’s secret realm…<br/><br/>Fang Wang’s heart raced. Could this be the inheritance of a Great Cultivator from the Ji Hao Sect?<br/><br/>It wasn’t just him; Fang Hanyu also realized this, his breathing becoming rapid. He whispered, “Fang Wang, take a closer look. If it’s indeed an exceptional cultivation technique, you should learn it first.”<br/><br/>Fang Wang snorted, “No need to tell me, I’ll teach you after I’ve mastered it.”<br/><br/>The corners of Fang Hanyu’s mouth curled up, his mood buoyant. He finally wasn’t a burden; he had finally helped Fang Wang.<br/><br/>Fang Wang read carefully, the small world within the Fang Realm fell silent, the rippling lake beside them mirroring their figures.<br/><br/>Once Fang Wang had memorized all the text, his consciousness exploded and he entered the Heavenly Palace.<br/><br/>Opening his eyes, he looked around the spacious hall of the Heavenly Palace and took a deep breath.<br/><br/>As he began to recall that supreme technique, comprehension began to blossom in his mind; confusing parts became clear, leading to epiphanies.<br/><br/>This time, he truly felt the power of the Heavenly Palace; it wasn’t just about cultivating to Great Perfection. It was about mastering any method of cultivation!<br/><br/>After integrating his understanding, Fang Wang learned the name of the technique from the words and lines of the method.<br/><br/>Nine Dragons Divine Transformation Art!<br/><br/>The Nine Dragons Divine Transformation Art was a powerful attack spell that allowed the user to transform into a dragon, possessing immense destructive power. The art had nine levels, from low to high: Qi Dragon, Shape Dragon, White Dragon, Azure Dragon, Yellow Dragon, Purple Dragon, Red Dragon, Golden Dragon, and Black Dragon!<br/><br/>The reason why the Black Dragon was ranked above the Golden Dragon was because this art brought destruction, not hope.<br/><br/>After understanding the Nine Dragons Divine Transformation Art, Fang Wang became extremely interested and began to practice according to the cultivation method.<br/><br/>However, the Nine Dragons Divine Transformation Art was harder to practice than he had imagined.<br/><br/>It took him nine years just to congeal the Qi Dragon.<br/><br/>To practice up to the Shape Dragon, it took seventeen years!<br/><br/>This time, he was not frustrated but filled with a strong will to cultivate.<br/><br/>The Nine Dragons Divine Transformation Art was too powerful; the destructive power of the Shape Dragon was several times that of the Qi Dragon. Most crucially, the Nine Dragons Divine Transformation Art relied not only on one’s own Spiritual Power but could also be combined with Magic Artifacts. The stronger the Magic Artifact, the greater the enhancement to the destructive power of the transformed dragon.<br/><br/>Fang Wang became so immersed in the Nine Dragons Divine Transformation Art that he could not extricate himself, as time flew by swiftly.<br/><br/>By the time he reached the ninth level Black Dragon to Great Perfection, he had spent a total of two hundred and seventy-three years!<br/><br/>This had surpassed the time he spent practicing the Solaris Scripture, becoming the longest technique he had trained in. But the gains were also tremendous. As the Black Dragon, he felt he could destroy everything. If he wielded the Heavenly Palace Halberd while transformed into the Black Dragon, it would be even more terrifying!<br/><br/>When he finally reached Great Perfection, his surroundings shattered, and his consciousness returned to reality, where he was faced with Fang Hanyu’s startling back.<br/><br/>Fang Wang showed a smile, patted Fang Hanyu’s back, and laughed, “This technique is extraordinary. Once your eyes are healed, I’ll teach you how to practice it.”<br/><br/>Being patted on the back by Fang Wang, Fang Hanyu shuddered, goosebumps spreading all over. He hurriedly put on his clothes, then stood up and asked, “Did you memorize it?”<br/><br/>“Of course, I never forget what I see.”<br/><br/>“Then you start practicing. I hope that once my eyes are healed, I can see you perform this technique.”<br/><br/>“I’m sure it will shock you.”<br/><br/>Fang Wang said with a raised eyebrow and a smile, feeling pleased at having acquired the Nine Dragons Divine Transformation Art. It was undoubtedly the strongest offensive technique he had mastered to date.<br/><br/>The Jinghong Divine Sword Art was indeed impressive, but it paled in comparison to the Nine Dragons Divine Transformation Art.<br/><br/>With Li Hongshuang as a reference, he suddenly felt that he might indeed be able to challenge the Spirit Elixir Realm.<br/><br/>No, he mustn’t get ahead of himself!<br/><br/>Fang Wang reminded himself inwardly while watching Fang Hanyu leave unsteadily.<br/><br/>…<br/><br/>At Great Abyss Gate, in the Shiyuan Hall…<br/><br/>Guang Qiuxian was meditating while a dozen people stood above in the hall, among them Yang Yuanzi; the expressions on everyone’s faces were solemn.<br/><br/>Zhao Chuanqian, the Inheritance Elder who had taken Fang Wang into the third lineage, spoke up, “Sect Leader, the Nine Dragons Divine Transformation Art has caused an uproar in the Western Region. It isn’t just the Demonic Path but also the Righteous Path’s various sects that have joined the search and contention. Are we really not going to take part?”<br/><br/>Upon hearing this, the other Peak Masters and Elders started voicing their opinions.<br/><br/>“The chief disciple of the Suspended Vast Sword Sect, Xu Qiuming, has exchanged blows with an elder of Huangyu Mountain.”<br/><br/>“First, it was the Heavenly Gang Sheng Ti Zhen Gong, and now the Nine Dragons Divine Transformation Art. Why does it feel like someone is plotting behind the scenes?”<br/><br/>“Whether it’s a plot or not, we must get involved, at the very least to find out if it’s true or who ultimately obtains it. This concerns the future layout of the Nine Great Sects.”<br/><br/>“It’s not good to get involved in this matter. Many of our disciples have encountered attacks from the Green Cicada Valley. Once we’re involved, Green Cicada Valley will surely retaliate as if they have gone mad.”<br/><br/>“Right, Brother Yang, when did you cultivate such a talent? Who is it exactly? To be able to master the Jinghong Divine Sword Art to the extent of 32 swords, how many swords have you reached now?”<br/><br/>A Peak Master shifted the topic to Yang Yuanzi, whose face remained expressionless and did not respond.<br/><br/>Guang Qiuxian spoke up, “Enough, do not inquire further about the identity of the one in white. You all just need to know that such a disciple exists in the Great Abyss Gate. Li Hongshuang is dead, and Green Cicada Valley will definitely send spies to infiltrate us. We must protect him.”<br/><br/>Excitement filled his heart, for he knew who had inherited the Jinghong Divine Sword Art.<br/><br/>That lad!<br/><br/>In such a short period of cultivation, he had mastered the Jinghong Divine Sword Art to the extent of 32 swords, surpassing Yang Yuanzi, which astonished him.<br/><br/>Perhaps this is the terrifying aspect of the Heaven Yuan Spirit Treasure.<br/><br/>“Let the first vein be responsible for investigating the whereabouts of the Nine Dragons Divine Transformation Art. Remember, prioritize investigation, and don’t be rash,” Guang Qiuxian continued, then waved his sleeve to signal everyone to leave.<br/><br/>Only Yang Yuanzi remained.<br/><br/>After Shiyuan Hall’s doors closed, Yang Yuanzi frowned and said, “I’m worried about Fang Wang. Although he’s with his kin, they are all juniors.”<br/><br/>Guang Qiuxian nodded, “I share the same concern. Let’s send a direct disciple from the Spirit Elixir Realm to find him.”<br/><br/>Yang Yuanzi shook his head, “A direct disciple is not enough. Let Lu Yuanjun go. It’s a good opportunity for them to meet in advance. If Lu Yuanjun can save his life during a moment of crisis, it would be hard for any conflict to arise between them in the future.”<br/><br/>Hearing this, Guang Qiuxian thought for a moment and then slowly nodded.<br/><br/>“Junior brother, do you think the Nine Dragons Divine Transformation Art really has appeared?”<br/><br/>“How would I know? Even if it has, so what?”<br/><br/>“There are rumors that the Nine Dragons Divine Transformation Art possesses the destructive power to flatten a kingdom. Ji Hao Sect’s dominance over vast territories owes much to the Nine Dragons Divine Transformation Art.”<br/><br/>“Those are just legends. Who has ever seen it with their own eyes? Besides, we have Fang Wang and Lu Yuanjun. Even if the other sects obtain the Heavenly Gang Sheng Ti Zhen Gong or the Nine Dragons Divine Transformation Art, the future still belongs to us!”<br/><br/>“That’s true. Fang Wang, that lad, has actually practiced the Jinghong Divine Sword Art to the extent of 32 swords. Looking at this, junior brother, you really have mediocre talent!”<br/><br/>“Heh, I have mediocre talent, so what does that make you?”<br/><br/>…<br/><br/>After acquiring the Nine Dragons Divine Transformation Art, a month and a half passed, and Fang Wang finally broke through to the fourth layer of the Soul Sculpting Realm.<br/><br/>During this time, Fang Hanyu’s cultivation speed increased rapidly, reaching the fifth layer of the Qi Cultivation Realm, and he could even spar with demon beasts.<br/><br/>The lad, blindfolded, could predict his opposition’s attacks as if he wasn’t blind at all, which made Fang Wang even more expectant towards the Absolute Heart Evil Eye.<br/><br/>As more and more shapeshifting demons from the Mountain God clan arrived, Fang Realm began bustling with activity. These shapeshifting demons were very friendly to Fang Wang and Fang Hanyu, even helping to build houses for them.<br/><br/>On this day.<br/><br/>Fang Wang found Fang Hanyu and began teaching him the Nine Dragons Divine Transformation Art. Though he had not yet removed the cloth from his eyes, he could practice spells, using his sense of breath and the flow of the air around him to judge his opponent’s movements.<br/><br/>Fang Hanyu had a good aptitude; after being taught for only half an hour by Fang Wang, he was left to practice on his own.<br/><br/>Although the practice method of the Nine Dragons Divine Transformation Art was profound, its specific techniques were not overly complicated, and after memorizing them, Fang Hanyu could contemplate them on his own.<br/><br/>Noon.<br/><br/>While Fang Wang was meditating by the lake, a beast with the body of a human and the head of a fox from the Mountain God clan ran over, knelt beside him, and cried out, “Master Fang, you must save my sister!”<br/><br/>Fang Wang opened his eyes and saw a mask in his hand, the fox mask of the young girl in green.<br/><br/>The survivors of the Mountain God clan had almost all moved to Fang Realm. In order to repay the kindness of the Fang Family for taking them in, they began collecting spiritual flowers and herbs from all over to transplant into Fang Realm. It had been a month since this started, with no incidents, nor had they encountered any Demonic Cultivators.<br/><br/>Fang Wang frowned and asked, “What happened to her?”<br/><br/>“A Human Cultivator named Li Honggang captured her, and he commanded us, the Mountain God clan beasts, to find the one in the white garment. If the ‘White Garment Astonishing Swan’ doesn’t go to Haixia City within a month, he will kill my sister… but our clan hardly has one-tenth left, where can we find the ‘White Garment Astonishing Swan’?” the Mountain God beast cried as he spoke.<br/><br/>The Mountain God clan’s advantage over other beasts is their early transformation. At present, the strongest beast in Fang Realm was only comparable to a cultivator at the fourth layer of the Soul Sculpting Realm.\t\t\t\t\t\t</div>", "images": {}, "success": true}