{"id": 21, "url": "https://www.novelhall.com/i-became-an-immortal-on-mortal-realm-32879/14234594.html", "title": "Chapter 21 - 21 Chapter 19: Body-Protecting Divine Barrier, Great Celestial Thunder Technique_1", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 21 - 21 Chapter 19: Body-Protecting Divine Barrier, Great Celestial Thunder Technique_1</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\t21 Chapter 19: Body-protecting Divine Barrier, Great Celestial Thunder Technique_1<br/><br/>Translator: 549690339<br/><br/>“Not to be passed on outside? Then how about I pass it on to you?” Fang Wang looked at Zhou Xing Shi, asking with a chuckle.<br/><br/>Zhou Xing Shi’s complexion changed slightly, and he quickly said, “Brother Fang, please don’t jest with me. How dare I harbor such wild thoughts?”<br/><br/>Fang Wang shook his head and laughed. “I’m not joking. You are my man now, and naturally, I want you to become stronger and stronger. Go back for now. Come pick up these two jade slips after seven days.”<br/><br/>Upon hearing this, Zhou Xing Shi felt an unexpected joy but dared not show it. He could only agree, then stood up and left.<br/><br/>Having taken just a few steps, he suddenly remembered something and turned back, saying, “Oh right, the Sect Leader asked me to remind you that you can still take on the usual tasks of the third vein. They can hone your combat experience and cultivate your moral character. Should you have any needs, you can seek him out. Just the rewards for the tasks will not change on the surface.”<br/><br/>Zhou Xing Shi was filled with emotion. Thinking about the Heaven Yuan Spirit Treasure that Fang Wang possessed, he couldn’t help but feel astounded.<br/><br/>That is the legendary Heaven Yuan Spirit Treasure!<br/><br/>The Da Qi Cultivation Realm has never seen one since ancient times.<br/><br/>Zhou Xing Shi wouldn’t doubt Guang Qiuxian’s judgment because on that day, his precious spirit was truly frightened, and afterwards, he learned that all the precious spirits in the Great Abyss Gate were uncontrollable, possessing such might from the moment they were formed. Apart from the legendary Heaven Yuan Spirit Treasure, what other grade could it be?<br/><br/>Fang Wang nodded, then picked up one of the jade slips on the table.<br/><br/>Seeing this, Zhou Xing Shi didn’t try to disturb him further and quickly left.<br/><br/>Once the mountain gate of the dwelling was closed, Fang Wang looked at the jade slip in his hand, thinking to himself, “Zhou Xing Shi, are you truly my man, or are you the Sect Leader’s? Let’s see how you perform.”<br/><br/>He took Yang Yuanzi’s words to heart; he wouldn’t fully trust anyone, at least not in his heart.<br/><br/>The so-called Myriad Poison Eternal Insect, Fang Wang always felt there was more to it than just chanting spells in front of him. The chanting should only ensure Fang Wang could prevent Zhou Xing Shi from assassinating him. Surely Yang Yuanzi had other methods, at the very least, he could control Zhou Xing Shi’s life and death from afar.<br/><br/>This was interesting; Zhou Xing Shi’s life and death were in Yang Yuanzi’s hands, and he carried out tasks for Guang Qiuxian. Now, he was supposed to assist Fang Wang. With three identities, he probably felt extremely uncomfortable himself.<br/><br/>Fang Wang began to read the jade slip with his spiritual sense.<br/><br/>The first thing he saw was four large characters.<br/><br/>Body-protecting Divine Barrier!<br/><br/>…<br/><br/>The seven days quickly passed by.<br/><br/>Zhou Xing Shi arrived as promised. Inside the dwelling, he held the two jade slips and hesitantly asked, “You’re really giving these to me? And in such a short time, have you completely memorized all the methods for cultivation?”<br/><br/>Fang Wang nodded, saying, “It’s not difficult to memorize. Go and cultivate them.”<br/><br/>For Zhou Xing Shi, it was just seven days, but for Fang Wang, a hundred and thirty-eight years had passed.<br/><br/>Within the Heavenly Palace, it took him forty years to cultivate the Body-protecting Divine Barrier, and ninety-eight years to cultivate the Great Celestial Thunder Technique.<br/><br/>The Body-protecting Divine Barrier, as the name suggests, is a defensive spell.<br/><br/>And the Great Celestial Thunder Technique is very domineering; it summons the thunder of the firmament to descend upon the world and annihilate enemies, its power boundless.<br/><br/>From the duration of practice, it was clear Guang Qiuxian had not been careless, they were all superior techniques.<br/><br/>Mere cultivators spend most of their days gathering Qi, and the time spent to practice spells rarely exceeds a third. To master the Body-protecting Divine Barrier to Great Perfection, it’s estimated it would take hundreds of years, and this is still under the assumption that one’s talent is similar to Fang Wang’s.<br/><br/>Not to mention the Great Celestial Thunder Technique; it’s certainly something most disciples of the Great Abyss Gate couldn’t even dream of touching in their lifetimes.<br/><br/>As a direct disciple, Fang Wang could still choose three superior Dharma techniques from the Daofa Pavilion, but he had no intention of doing so for the time being. As it stands, he already had his combat methods, it would be better to focus his energies on accumulating his cultivation level.<br/><br/>Zhou Xing Shi looked at the two jade slips in his hands, his emotions in turmoil.<br/><br/>That he was still alive was because Fang Wang had spoken for him. Now, without having done anything yet, Fang Wang had bestowed upon him two supreme techniques. How could he not be moved?<br/><br/>However, he was not one to express himself.<br/><br/>“Understood!”<br/><br/>Zhou Xing Shi answered and then performed a formal bow before leaving. Only after the mountain gate was closed did Fang Wang settle down to cultivate in peace.<br/><br/>It was nothing more than gilding the lily; if it could win over people’s hearts, then naturally it was good. If not, he wouldn’t be at a loss.<br/><br/>…<br/><br/>With autumn passing and winter arriving, the flying snow finally came, covering the peaks of the Great Abyss Gate in a blanket of white, a vast scene with its own unique charm.<br/><br/>A giant flying sword cut through the vast snow, landing at the city gate of the Great Abyss Gate’s sprawling city.<br/><br/>Two figures leapt down from the flying sword, one of them was the Emperor of Da Qi, disguised and dressed like a scholar.<br/><br/>The Tai Yuan Sect disciple standing on the flying sword looked down at him and said, “Your token only allows you to stay for a month. After a month, leave on your own, or our Enforcement Hall won’t be lenient with you.”<br/><br/>With that said, the disciple left on his sword.<br/><br/>As he disappeared into the endless snow, the young man behind the Emperor of Da Qi sneered, “Your Majesty, that person is truly arrogant, it’s just…”<br/><br/>“Silence! Do not speak rashly!”<br/><br/>The Emperor of Da Qi scolded him in a cold voice, frightening the young man into silence.<br/><br/>The snowflakes danced around them. The Emperor of Da Qi brushed the snow off his head and, looking at the imposing city walls with admiration in his eyes, whispered, “Let’s go, let’s take a look at this land of immortals.”<br/><br/>Amidst the vast snow, a master and his servant walked towards the city gate. Their figures were so small, as if they could be buried by the snow at any moment.<br/><br/>Elsewhere.<br/><br/>Atop the third vein’s peak, the mountain gate to a cave dwelling opened, with Fang Wang leading out six of his clan members, chatting and laughing.<br/><br/>“Brother Fang Wang, we’re heading out first.”<br/><br/>“When you get back, you must cultivate diligently.”<br/><br/>“Hehe, with the guidance from Thirteenth Brother, we will definitely cultivate well.”<br/><br/>“Fang Wang, rest assured, I will certainly become an Inner Sect Disciple!”<br/><br/>Fang Wang stopped in his tracks and watched as they descended the mountain.<br/><br/>Having joined the Great Abyss Gate for ten months, all these Fang Family Disciples handpicked by Zhou Xue had cultivated Spiritual Power and embarked on the path of cultivation, with the highest among them reaching the third layer of the Qi Cultivation Realm. However, their Sword Control Technique had not yet been perfected, preventing them from flying down the mountain on their swords, and thus they had to walk down the mountain on foot.<br/><br/>With heavy snow fluttering down, Fang Wang’s heart filled with warmth as he watched the silhouettes of his clan members slowly disappear into the whitened landscape.<br/><br/>In a past life, while reading cultivator novels, he thought the path of cultivation was lonely and desolate, but now, having this group of clan members by his side, there was a sense of reliance in his heart, and this feeling was quite nice.<br/><br/>At this moment, Fang Wang suddenly understood why Zhou Xue had taken the Fang Family Disciples along to cultivate; apart from her planning, companionship and support were crucial. Being isolated might inspire potential, but it could also be exhausting.<br/><br/>Then, the mountain gate of the neighboring cave dwelling abruptly opened, and Gu Li emerged. Seeing her, Fang Wang felt a headache coming on.<br/><br/>This young lady had truly set her sights on him.<br/><br/>Every time he came out, as long as she was in the cave dwelling, she would follow him out.<br/><br/>Gu Li naturally walked over to Fang Wang’s side and asked, “Are they all your clan members?”<br/><br/>Fang Wang could only respond politely, “Hmm, we grew up together since we were young.”<br/><br/>Gu Li lifted her right hand to gently sweep back her hair, saying, “I’m truly envious of you. Only I from the Gu Family came to the Great Abyss Gate; the others went to different sects.”<br/><br/>To ensure longevity, a cultivation family often disperses its members across different sects; the Fang Family had only just entered the Cultivation World and had yet to develop this kind of foundation.<br/><br/>The two started chatting idly, and Fang Wang, having cultivated intensely for a while, wanted to enjoy the scenery, so he kept her company.<br/><br/>Most of the time, it was Gu Li who spoke while Fang Wang listened.<br/><br/>“By the way, have you already achieved Spiritual Refinement successfully? Why can’t I see through your cultivation level; could it be that you’ve surpassed me?” Gu Li asked curiously, her bright, expressive eyes fixated on Fang Wang with an unusual sparkle.<br/><br/>Unable to withstand her gaze, Fang Wang looked into the distance and said, “Hmm, I have successfully achieved Spiritual Refinement, a Superior Mysterious Origin Treasure Spirit.”<br/><br/>His cultivation had reached the third level of the Spiritual Refinement Realm, not far from the fourth, while Gu Li was still at the first level, naturally unable to discern his level.<br/><br/>“Guess what grade my Treasure Spirit is?” Gu Li blinked, and asked with a giggle, hiding her mouth with her hand.<br/><br/>Fang Wang could tell that hers was higher than his as soon as he heard it, no wonder she became a Direct Disciple so quickly. He had previously assumed it was due to the Gu Family’s influence, but now it seemed her aptitude was the key factor.<br/><br/>It looked like Zhou Xue was right; even without him, the Great Abyss Gate would become the strongest sect in the Da Qi Cultivation Realm.<br/><br/>“An Earth Origin Treasure Spirit?” Fang Wang cautiously guessed.<br/><br/>“Mhm, a Lower Grade Earth Origin Precious Spirit. Although the grade of the Treasure Spirit is slightly higher than yours, you’ve overtaken me in terms of cultivation. It seems that your Cultivation Technique is stronger than mine. Why don’t we have a sparring match when we’re about to break through to the Spirit Elixir Realm?” Gu Li nodded, her face filled with anticipation.<br/><br/>So that was her angle.<br/><br/>Fang Wang had thought Gu Li had taken a liking to him, but it turned out she just couldn’t stand losing.<br/><br/>With that being the case, he felt no pressure and immediately lifted his chin, laughing, “Alright, but you better cultivate diligently. I’ll wait for you to challenge me before every major realm breakthrough.”<br/><br/>“It’s a deal!”<br/><br/>“Hmm!”<br/><br/>The two exchanged smiles and then Gu Li began to talk about the customs and culture of the North Luo, introducing her own family.<br/><br/>It wasn’t until half an hour later that the bell of the third vein rang.<br/><br/>Fang Wang had heard this kind of bell sound twice before, signaling the arrival of a vein mission. He had not paid attention to it previously, as Direct Disciples could ignore these missions.<br/><br/>“Let’s go take a look. You can’t always stay cooped up in the cave dwelling,” Gu Li suggested. After a moment’s hesitation, Fang Wang nodded.<br/><br/>For some reason, upon hearing the bell, he felt an inexplicable unease, as if something bad had happened.<br/><br/>The two flew on their swords towards Qingxin Hall at the peak of the mountain.<br/><br/>Disciples emerged from the cave dwellings scattered across the third vein’s peak, all flying toward the summit and eventually gathering in front of Qingxin Hall.<br/><br/>Upon the arrival of Fang Wang and Gu Li, numerous disciples immediately surrounded them with great enthusiasm. Some of the male disciples clenched their fists in secret, thinking the two had already established some kind of relationship.<br/><br/>Some female disciples who had developed a fondness for him were secretly heartbroken, thinking the handsome Brother Fang already had his eyes on someone.<br/><br/>The eldest Disciple, Li Yu, stood on the steps with his hands behind his back. Seeing Fang Wang arrive, he nodded and smiled.<br/><br/>After a while, once enough disciples had arrived, Li Yu finally spoke up, “Today, I’ve called everyone here because our second vein’s Disciples have encountered trouble and need assistance from our third vein. This mission is completely voluntary and will require going into the territory of a Demonic Sect.”<br/><br/>Disciples from the second vein in trouble?<br/><br/>Fang Wang immediately thought of Han Yu. He had been absent for several months with no return, and the youngest Fang Xin had been worried about him during their previous conversations.<br/><br/>As soon as Li Yu finished speaking, some disciples immediately questioned why they from the third vein should be involved in the second vein’s matters.\t\t\t\t\t\t</div>", "images": {}, "success": true}