{"id": 28, "url": "https://www.novelhall.com/i-became-an-immortal-on-mortal-realm-32879/14234615.html", "title": "Chapter 28 - 28 Chapter 26 Mysterious Supreme Skills_1", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 28 - 28 Chapter 26 Mysterious Supreme Skills_1</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\t28 Chapter 26 Mysterious Supreme Skills_1<br/><br/>Translator: 549690339<br/><br/>In the dense forest, Fang Wang carried Fang Hanyu on his back, with Zhou Xue leading the way. As for Zhou Xing Shi, Zhou Xue had already sent him back to the Great Abyss Gate.<br/><br/>Before leaving, Zhou Xue had spoken to Zhou Xing Shi alone; after their conversation, Fang Wang noticed that Zhou Xing Shi had become anxious and even left without giving him an additional glance.<br/><br/>“Come out, you’ve been following us for quite a while!”<br/><br/>Zhou Xue suddenly stopped in her tracks and called out.<br/><br/>Fang Wang wasn’t surprised; he had sensed a presence following them several hours earlier, but since it was very faint, he didn’t concern himself with it.<br/><br/>After a few moments, a large tree behind them trembled, and a green figure dropped down—it was a young girl in green clothes wearing a fox mask.<br/><br/>Upon landing, she said, “I mean no harm; you are heading towards the land of my clan, and I wanted to persuade you against it, but I was afraid you were just passing by.”<br/><br/>Upon hearing this, Fang Hanyu raised his head and said with surprise, “Miss Green, you’re still alive?”<br/><br/>The girl in green clothes snorted, “Of course I’m alive, but my clan has suffered heavy losses, and now everyone is fleeing in all directions. I got separated from them and ran towards our clan territory, only to encounter you on the way.”<br/><br/>Zhou Xue turned around, examining the girl in green with interest, and said with admiration, “The Mountain God clan, I wondered what spirit saved Fang Hanyu; it turns out it was you. The world today is murky, and Cultivators hardly acknowledge the existence of Mountain Gods.”<br/><br/>Upon hearing this, the girl in green immediately stepped forward eagerly and asked, “Sister, you know about our Mountain God clan?”<br/><br/>“Hmm, the earth is vast with countless mountains; since ancient times, there have been Mountain Gods in deep mountain ranges. Although they share the same origin as spirits and demons, they have their own heritage and have transformed earlier than spirit beasts. The Mountain God clan is compassionate, taking the protection of their territories as their duty. As humans began their path of Cultivation and failed to find traces of Immortal Gods, they gradually lost their reverence for the deities of nature. Despite the historical renown of the Mountain God clan, in the eyes of Cultivators, they are no different from spirits and demons. Your physical bodies are considered precious medicine to Cultivators.”<br/><br/>Zhou Xue answered softly, the explanation intended for Fang Wang and Fang Hanyu.<br/><br/>After listening, Fang Hanyu couldn’t help but turn his head towards the girl in green and asked, “Are you a demon?”<br/><br/>“What? You have a prejudice against demons?”<br/><br/>“Your friends and clan members from before…”<br/><br/>“Yes, they were all demons; the little yellow bird that woke you up every day was a bird demon, and it’s dead now.”<br/><br/>The girl in green’s response left Fang Hanyu silent.<br/><br/>Such heavy words came from the girl in green’s mouth as if she were making a joke, but Fang Wang could feel her restraint.<br/><br/>“Since you are of the Mountain God clan and you have saved Fang Hanyu, you should follow us for now. The place we are going to is just passing through your clan land, not your clan land itself. However, in the future, that place could become a refuge for your clan. After all, in the years to come, the various Demonic Sects will still be frantically slaughtering the Mountain God clan everywhere.”<br/><br/>Zhou Xue spoke again, extending an invitation.<br/><br/>The girl in green nodded, and seeing this, Zhou Xue didn’t say more, continuing to lead the way.<br/><br/>Fang Wang, still carrying Fang Hanyu, asked through a mental message, “When I slew Li Hongshuang, some Cultivators from the Green Cicada Valley escaped. Will they cause trouble for the Fang Residence?”<br/><br/>The massacre of the Mountain God clan renewed his concern for the Fang Family.<br/><br/>Zhou Xue responded through a mental message, “As long as you didn’t reveal your family name, even if the Green Cicada Valley can trace it, it will take time. Green Cicada Valley wouldn’t retaliate against a family for a single Disciple, but Li Hongshuang’s Li Family will. You don’t have to worry, I have my methods.”<br/><br/>Assured by Zhou Xue’s strategy, Fang Wang stopped worrying.<br/><br/>They continued their journey, encountering numerous spirits and demons along the way. The group grew larger as these creatures dared to approach thanks to the girl in green.<br/><br/>Two more days passed.<br/><br/>They arrived in front of a majestic mountain so tall that its summit could not be seen and towering clouds enshrouded it, spanning across tens of miles. The surrounding mountain terrain was steep and continuous, with sparse trees revealing a vast emptiness.<br/><br/>Behind Zhou Xue and the others followed a vast array of wild beasts, numbering over a hundred. The largest among them was a wild boar with shoulder height of two zhang, tusks one zhang long, and black fur billowing like flames, looking terrifying, yet it hadn’t reached the level of a Spirit Demon.<br/><br/>Zhou Xue walked straight to a part of the mountainside, touched it, and promptly seemed to trigger some mechanism. The mountainside trembled, revealing a crack. Dust billowed as a mountain gate pushed open, unveiling a massive entrance five zhang high.<br/><br/>This mountain gate, appearing minuscule on the mountainside, seemed like a skyscraper before Fang Wang and the others.<br/><br/>Fang Wang couldn’t help but ask, “What is this place?”<br/><br/>Zhou Xue replied without turning back, “A thousand five hundred years ago, a Great Cultivator from Ji Hao Sect secretly built this immense Cave Heavens here, wishing to provide refuge for his own family from blood feuds. Afterwards, it has remained undiscovered. Perhaps he died before he could even inform his family of this place. From now on, the Fang Family will cultivate here, rallying the Mountain God clan. I hereby name this Cave Heavens the Fang Realm.”<br/><br/>Fang Wang suddenly understood. He had been wondering if Zhou Xue was truly so kind as to take in the Mountain God clan. It was all for the Fang Residence!<br/><br/>Afterward, they entered the massive cave entrance. The girl in green and the beasts curiously observed the tunnel along the way, lined with various shining crystals.<br/><br/>After about a hundred meters, a bright light appeared ahead.<br/><br/>As Fang Wang stepped into the bright light, he reopened his eyes to the sun shining on his face, and the sight before him was moving.<br/><br/>Blue skies and white clouds hovered above, the sun hung high, and lush grass surrounded a large lake, with tall mountains on all sides. It was truly a heavenly realm far from the mundane world.<br/><br/>“This is a Formation within the Fang Realm that makes you feel as if you’re in another world. In fact, this small realm has boundaries; it’s not as vast as it appears. Rest here, and do not venture out, especially in the upcoming month. As for the Mountain God clan, rest assured, you won’t be exterminated. You can search for your kin once the Demonic Sects retreat,” Zhou Xue turned and said to the beasts, her gaze mostly on the girl in green.<br/><br/>The girl in green nodded. After enduring so much combat, she wasn’t about to be reckless.<br/><br/>Fang Wang asked, “Will Green Cicada Valley leave in a month?”<br/><br/>“Yes, the inheritance of Ji Hao Sect will be disseminated in a different direction, attracting various branches of the Demonic Path to scramble for it, sparking bloodshed and carnage that will last for years.”<br/><br/>“What about the Heavenly Gang Sheng Ti Zhen Gong?”<br/><br/>“Not that, but it’s still a remarkable cultivation technique. At the very least, it will allow Green Cicada Valley to temporarily set aside Li Hongshuang’s death.”<br/><br/>As the two chatted, they walked toward the nearby mountainside. Fang Wang set Fang Hanyu down, then took off all the storage bags from his waist, and said, “Check these when you have time, all this stuff is for you, to help the Fang Residence step onto the cultivation path.”<br/><br/>Zhou Xue didn’t stand on ceremony, she nodded, and then took out a small cauldron from the storage bag, following that, she began throwing eyeballs into the cauldron.<br/><br/>That’s right!<br/><br/>Eyeballs!<br/><br/>Fang Wang felt uncomfortable at the sight and immediately walked away. He went to the lakeside and began to meditate and gather Qi.<br/><br/>The girl in the green dress dispersed with the mystical beasts, each finding a place to rest. They were tired, having been in constant fear over the past few days, and now they just wanted to sleep well.<br/><br/>Not until night had fallen did Fang Hanyu suddenly emit a piercing, tragic scream that echoed through the night sky.<br/><br/>Fang Wang glanced back, then redirected his gaze and continued to cultivate.<br/><br/>…<br/><br/>A month passed quickly.<br/><br/>Fang Hanyu was now able to meditate and gather Qi, but his eyes were still covered by a white cloth, unable to withstand light.<br/><br/>Inside the cave tunnel, after Zhou Xue and Fang Wang had figured out the various mechanisms, she spoke, “I need to leave now. Once Fang Hanyu’s eyes have successfully condensed, you can return to the Great Abyss Gate.”<br/><br/>Fang Wang was mentally prepared for this and then asked, “You’re considering letting the girl in green go find her people, shall we let her go out?”<br/><br/>“Let her go. She grew up in the mountains and forests; she shouldn’t run into any trouble. According to the timing, that cultivation technique should already be spreading, and Green Cicada Valley’s attention will be drawn away. In short, once Fang Hanyu’s eyes are better, you can head back to the Great Abyss Gate on your own; there’s no need to wait for me.”<br/><br/>Zhou Xue nodded, she gave a few more warnings, and eventually left under Fang Wang’s urging.<br/><br/>Watching Zhou Xue’s retreating figure flying away on her sword, Fang Wang stood at the entrance of the cave for a long while before he closed the mountain gate and returned to the lakeside of Fang Realm to continue his cultivation.<br/><br/>The battle with Li Hongshuang made Fang Wang feel that his Spiritual Power was insufficient. Merely executing Li Hongshuang had drained him of a lot of Spiritual Power, and he had to elevate his cultivation realm, reaching the ninth layer of the Soul Sculpting Realm as soon as possible.<br/><br/>Fang Realm was peaceful, and the mystical beasts hiding there were very quiet; they could now absorb nature’s spiritual energy and Essence of the Sun and Moon without the need for food.<br/><br/>It’s worth mentioning that the sun and the moon within this worldlet are real, with a special Formation allowing the sun and the moon above the mountaintop to be reflected inside the cave, clearly distinguishing day from night, rotating in synchronization with the outside world.<br/><br/>On the third day after Zhou Xue left, the girl in the green dress could not hold back and left the cave heaven to seek her tribespeople.<br/><br/>Every three or four days, she would bring a group of Mountain God creatures to the refuge; all these creatures maintained human forms, some with heads like wolves or dogs, some like eagles, able to articulate human speech. Fang Wang did not communicate much with them but let Fang Hanyu deal with them.<br/><br/>In the blink of an eye, another month had gone by.<br/><br/>That night.<br/><br/>Fang Wang was cultivating by the lake, and Fang Hanyu, led by a Mountain God creature, came to his side. After the creature left, he still seemed hesitant and didn’t speak for quite some time.<br/><br/>“What is it?”<br/><br/>Fang Wang opened his eyes and wearily inquired.<br/><br/>After everything that had happened, Fang Hanyu was still the same, timid as a shy bride.<br/><br/>Fang Hanyu clenched his teeth and said, “Fang Wang, my back feels very itchy, especially when I’m cultivating. Could you take a look for me?”<br/><br/>“Then sit down,”<br/><br/>Fang Wang responded, concerned there might be something wrong with Fang Hanyu’s body.<br/><br/>Although Zhou Xue hadn’t been explicit before leaving, Fang Wang suspected that what she had installed in Fang Hanyu were the Absolute Heart Evil Eyes from Green Cicada Valley. Since they were evil eyes, they could possibly have side effects.<br/><br/>With Fang Wang’s assistance, Fang Hanyu got up and, with his back to him, slowly removed his clothes.<br/><br/>In the moonlight, Fang Hanyu’s fair back was covered in crimson lines, dense and mazelike, dazzling to the beholder.<br/><br/>“This is…”<br/><br/>Fang Wang narrowed his eyes, inspecting closely.<br/><br/>There appeared to be a cultivation technique on Fang Hanyu’s back!<br/><br/>This technique didn’t display a name, just the method of cultivation, which was clearly profound and advanced.<br/><br/>“Did Green Cicada Valley etch something on your back?” Fang Wang asked with a frown.<br/><br/>Fang Hanyu shook his head, speaking softly, “No, but before, in the Ji Hao Sect’s secret realm, something hit my back. I didn’t pay much attention at the time…”\t\t\t\t\t\t</div>", "images": {}, "success": true}