{"id": 22, "url": "https://www.novelhall.com/i-became-an-immortal-on-mortal-realm-32879/14234597.html", "title": "Chapter 22 - 22 Chapter 20 Heavenly Gang Sheng Ti Zhen Gong_1", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 22 - 22 Chapter 20 Heavenly Gang Sheng Ti Zhen Gong_1</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\t22 Chapter 20 Heavenly Gang Sheng Ti Zhen Gong_1<br/><br/>Translator: 549690339<br/><br/>“`<br/><br/>Facing the disciples’ confusion, Li Yu explained, “This matter concerns the second channel, so they naturally have to participate. Their mission, however, is different from ours; they are to confront the Demonic Sect, while our task is to rescue the disciples of the second channel. Those disciples were scattered after being attacked by demonic cultivators, which is why the tasks assigned to us are more dispersed.”<br/><br/>Zhou Bo asked, “Why did the disciples of the second channel go to the territory of the Demonic Path?”<br/><br/>Li Yu did not conceal the truth and answered, “They discovered a secret realm of a Great Cultivator from the Ji Hao Sect, so the disciples organized themselves to explore it. Unfortunately, they encountered an attack by demonic cultivators.”<br/><br/>Ji Hao Sect!<br/><br/>The gathered disciples of the third channel at the foot of the steps immediately became noisy, discussing among themselves—it was obvious that they all had heard of the name of the Ji Hao Sect.<br/><br/>Fang Wang whispered to Gu Li beside him, “What’s the history of the Ji Hao Sect?”<br/><br/>Hearing this, he could be certain that it was Fang Hanyu and the other disciples who were in trouble.<br/><br/>“The Ji Hao Sect was a great sect from a thousand years ago. Both Da Qi and the surrounding dynasties were once under its rule, but for some unknown reason, the Ji Hao Sect fell apart. The Nine Great Sects that exist today all rose after its collapse. Everything about the Ji Hao Sect has since been sought after by various sects and noble families, especially the Ji Hao Sect’s heritage,” Gu Li replied.<br/><br/>Being from a great clan does have its advantages—she knew so much.<br/><br/>As Fang Wang hesitated, Li Yu’s voice came, “According to the intelligence sent back by the second channel disciples, they have discovered the legendary Heavenly Gang Sheng Ti Zhen Gong. The mission to investigate this Divine Skill offers the greatest reward. Anyone who acquires this Divine Skill can be directly promoted to Direct Disciple. It’s a common mission for the disciples of all nine channels, but there are very few clues about this Divine Skill, making the mission extremely difficult.”<br/><br/>Heavenly Gang Sheng Ti Zhen Gong?<br/><br/>Sounds so domineering!<br/><br/>Fang Wang’s Lifespirit Treasure was a long weapon, so he had decided to focus on enhancing his physical body in the future. This Heavenly Gang Sheng Ti Zhen Gong sounded exactly like the kind of domineering skill he was looking for.<br/><br/>He asked Gu Li again, “Is the Heavenly Gang Sheng Ti Zhen Gong very powerful?”<br/><br/>Gu Li nodded with a look of yearning, saying, “According to legend, the Heavenly Body possesses the power to move mountains and overturn seas. In ancient myths, the Heavenly Body is also one of the ancient gods, symbolizing strength, and the Heavenly Gang Sheng Ti Zhen Gong is the cultivation technique to train the Heavenly Body. It is also one of the strongest cultivation techniques of the Ji Hao Sect. In the Da Qi Cultivation Realm, legends of the Heavenly Gang Sheng Ti Zhen Gong have been circulating.”<br/><br/>Move mountains and overturn seas!<br/><br/>Fang Wang’s heart stirred upon hearing this, as did the other disciples’. However, no one stepped forward to take on the mission.<br/><br/>After a moment’s thought, Fang Wang stepped forward toward Li Yu.<br/><br/>Hmm, it’s not for Fang Hanyu, it’s for the Heavenly Gang Sheng Ti Zhen Gong.<br/><br/>“Big Senior Brother, I will take the mission!”<br/><br/>Fang Wang approached Li Yu and said. Li Yu hesitated upon hearing this and, seeing all the disciples’ eyes on him, had no choice but to remind him through a sound transmission, “Brother Fang, this task could be very easy or very dangerous, and that Heavenly Gang Sheng Ti Zhen Gong is elusive. As a Direct Disciple, you don’t have to take the risk. Let the other disciples gain experience.”<br/><br/>Fang Wang did not respond with the Sound Transmission Technique but instead said directly, “I have a relative in the second channel who might be involved in this. His name is Fang Hanyu; I don’t know if you have any information about him, but I must go and save him.”<br/><br/>Upon hearing this, Li Yu could only give up. He searched his storage bag with his divine sense and soon lifted his right hand. A piece of Green Jade appeared in the palm of his hand.<br/><br/>“Fang Hanyu’s Token last transmitted Spiritual Power to the sect from the location recorded in this Guide Jade. It will lead you to that place, we don’t have any more clues at the moment,” Li Yu said.<br/><br/>Fang Wang took the Green Jade, thanked Li Yu, and then turned and left.<br/><br/>Seeing Fang Wang participate, other disciples immediately rushed up to Li Yu to receive missions.<br/><br/>Gu Li approached Fang Wang and asked, “Do you need my help?”<br/><br/>Fang Wang shook his head and replied, “I’m not just on a mission; you better not get involved. Focus on your cultivation. I will wait for you to challenge me at the ninth layer of the Soul Sculpting Realm.”<br/><br/>Gu Li nodded, not lingering any longer, and the two flew toward the cave abode.<br/><br/>Back at the cave, Fang Wang started packing his things. Once he was finished, he probed into the Green Jade with his divine sense. His consciousness was immediately enveloped in darkness, and instinctively, he looked around and saw a distant light—this was the direction to follow.<br/><br/>The overall principle of cultivation mentioned this Jade, called the Guide Jade. This was Fang Wang’s first time using it, and he was quite curious.<br/><br/>He didn’t delay for too long. After determining the direction, he put the Guide Jade back into his storage bag and then stood up to leave.<br/><br/>After leaving the cave abode, he did not immediately depart from the Great Abyss Gate but instead headed toward the Elixir Hall to claim all the sect’s elixirs for the past six months and also to buy some healing medicines, just in case.<br/><br/>Half an hour later.<br/><br/>Fang Wang, stepping on a Flying Sword, left the giant city and prepared to descend the mountain.<br/><br/>“Wait! I’ll come with you!”<br/><br/>A voice called out. Fang Wang turned his head and saw Zhou Xing Shi approaching.<br/><br/>Seeing him arrive, Fang Wang knew he was being monitored; Yang Yuanzi must have entrusted other disciples to keep an eye on his whereabouts. It might be well-intentioned, but he had to be cautious.<br/><br/>“Who sent you?” Fang Wang asked.<br/><br/>Zhou Xing Shi flew alongside Fang Wang on his sword and replied, “It was your mentor. He’s concerned that you might run into trouble on your first descent from the mountain. If we work together, we at least have each other for support.”<br/><br/>Fang Wang nodded, not asking further, and continued on his way.<br/><br/>The two of them crossed the vast expanse of white snow, their figures quickly disappearing from sight.<br/><br/>“`<br/><br/>…<br/><br/>In the Western Territory of Da Qi, under a blue sky with white clouds, green mountains and clear waters converge to create a beautiful scenery.<br/><br/>In a valley, where flowers and grass grow in abundance, and tree branches and leaves are extremely dense, Fang Hanyu leaned against a tree trunk, his body shaded by the leaves. His clothes were dirty and tattered, and a piece of cloth was tied over his eyes, covering them.<br/><br/>He wanted to exercise his Inner Strength, but couldn’t help coughing violently, even coughing up blood.<br/><br/>“Stop moving, you’ve been poisoned by Green Cicada Valley. Even with my treatment, you will need a few years to recover,” a woman’s voice came.<br/><br/>A young girl was squatting on a nearby tree, dressed in green with a fox mask covering her face, her figure suggesting she was only about fifteen or sixteen years old.<br/><br/>Fang Hanyu, unable to see, asked, “When will I be able to walk?”<br/><br/>“Wait for three more months. You were lucky to survive with your broken bones. Stop rushing it, okay?” The girl in green said impatiently with a snort.<br/><br/>Fang Hanyu fell silent.<br/><br/>His fists clenched tightly inside his sleeves, filled with frustration.<br/><br/>At this moment, he suddenly thought of Fang Wang, Zhou Xue, and the other family members at Great Abyss Gate, then he thought of the Fang Residence in Southern Hills City. He tried hard to calm his emotions, motivating himself, because he could not fall here.<br/><br/>A sharp cry swept across the firmament, disturbing the birds and animals in the forest.<br/><br/>The girl in green looked up to see a giant demon bird sweeping over the valley. She clicked her tongue in wonder and said, “What on earth could it be to cause so many Demonic Cultivators to stir up trouble? They seem to be searching for something. Could it be you? Are you hiding something they want?”<br/><br/>Fang Hanyu did not answer, and leaning against the tree, he seemed to have fallen asleep.<br/><br/>“Tsk, if you won’t talk, then don’t. I don’t want to cause trouble. You better pray they don’t discover this place. If they do, I can’t protect you. I will definitely leave you behind,” the girl in green huffed, and laying down on the branch, she prepared to rest.<br/><br/>Fang Hanyu slightly raised his head, as if wanting to look at the sky, but it had been a long time since he had seen any light.<br/><br/>…<br/><br/>Night fell.<br/><br/>In the woods, Fang Wang and Zhou Xing Shi sat in front of a campfire, the light casting their shadows long.<br/><br/>“The seasons inside Great Abyss Gate differ greatly from the mortal realm,” Fang Wang remarked.<br/><br/>Having descended the mountain for five days and nearing the direction indicated by the Guide Jade, Fang Wang tried not to think about the possibility of Fang Hanyu being dead.<br/><br/>Zhou Xing Shi nodded and said, “The Nine Great Sects all have their own spiritual formations, which gather more of nature’s spiritual energy. Thus, their celestial phenomena also last longer than in the mortal realm.”<br/><br/>Fang Wang asked, “Have you cultivated the Body-protecting Divine Barrier and the Great Celestial Thunder Technique?”<br/><br/>In response, Zhou Xing Shi showed a bitter smile and said, “Those two divine skills are extremely profound; without decades of arduous cultivation, it’s very hard to master them.”<br/><br/>Fang Wang, now interested, pressed on, “How many spells have you mastered, and how many of those have you brought to Great Completion?”<br/><br/>“I’ve acquired seven spells, but only one really reaches Great Completion, and it’s a family heritage. The path of cultivation alone, just the accumulation of Qi Gathering to build cultivation, already takes a significant amount of time. Just having one spell at Great Completion is already quite an achievement,” Zhou Xing Shi replied honestly, glancing at Fang Wang unconsciously.<br/><br/>He couldn’t forget the sight of Fang Wang single-handedly battling fifty-one cultivators, that sword which intimidated Gu Li was definitely of Great Completion level, as well as his cultivation technique, the terrible flames that clearly also reached a state of Great Completion.<br/><br/>Fang Wang felt somewhat relieved after hearing this. After all, others did not have the Heavenly Palace, and even Soul Sculpting Realm cultivators could only advance a few spells to Great Completion. Aside from the rank of his Lifespirit Treasure, he also held an advantage in his combat methods.<br/><br/>He had mastered Solaris Scripture, Jinghong Divine Sword Art, White Rainbow Evasion Technique, Body-protecting Divine Barrier, and Great Celestial Thunder Technique, all at the level of Great Perfection. He could attack, defend, and escape, making him a fully rounded combatant.<br/><br/>“Following this direction, we might encounter Green Cicada Valley or Huangyu Mountain. Green Cicada Valley is a Demonic Sect known for using poison, while Huangyu Mountain is more comprehensive. The two sects are neighbors and fight incessantly. We need to be cautious in our actions to avoid revealing our identities,” Zhou Xing Shi reminded him.<br/><br/>Fang Wang nodded and said, “I just want to find my family members. I won’t act recklessly.”<br/><br/>How strong could the Heavenly Gang Sheng Ti Zhen Gong be?<br/><br/>Solaris Scripture was considered Inner Strength, so the Heavenly Body Divine Skill must be an external technique. With both internal and external skills, his power would leap forward.<br/><br/>Zhou Xing Shi said no more and began to sit in meditation, gathering Qi.<br/><br/>Fang Wang did the same.<br/><br/>The night grew deeper, and the occasional howl of wolves could be heard.<br/><br/>In the blink of an eye,<br/><br/>Three days later, Fang Wang and Zhou Xing Shi arrived at a mountain town. They changed into the clothes they had worn before entering Great Abyss Gate. Fang Wang donned a body-fitting white garment, and wore a bamboo hat given to him by Zhou Xing Shi, resembling a wandering swordsman.<br/><br/>Zhou Xing Shi’s voice transmitted mentally, “The spiritual energy here is richer than in other places, probably a market built by cultivators. When asking for information, only mention Fang Hanyu’s appearance. I have a bad feeling; the place is unusually crowded.”<br/><br/>Fang Wang, having learned the Sound Transmission Technique from the basic principles of cultivation, responded affirmatively. He then began to observe the people along his way.<br/><br/>The denizens of the town almost all had the aura of Spiritual Power; most were in the fifth level of the Qi Cultivation Realm or below, posing no threat.<br/><br/>According to the Guide Jade, the last time Fang Hanyu contacted the sect using his Disciple Token was in this town.\t\t\t\t\t\t</div>", "images": {}, "success": true}