{"id": 23, "url": "https://www.novelhall.com/i-became-an-immortal-on-mortal-realm-32879/14234600.html", "title": "Chapter 23 - Add", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 23 - Add</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tADD<br/><br/>23 Chapter 21: Encounter with Zhou Xue_1<br/><br/>Translator: 549690339<br/><br/>After entering the town, Fang Wang and Zhou Xing Shi did not immediately seek to inquire about the whereabouts of Fang Hanyu, choosing instead to look around first.<br/><br/>Fang Wang had previously asked Zhou Xing Shi how to identify Demonic Cultivators, to which Zhou Xing Shi replied that one should not judge based on appearance or aura, but by considering the environment and actions.<br/><br/>The cultivators within the town were of mixed repute, making it impossible to determine the town’s stance for the time being.<br/><br/>As they moved on, Fang Wang heard the names of various sects and noble families along the way. It seemed that this place was truly a gathering place of Loose Cultivators—a market where trading of cultivation resources took place, with no one patrolling around specifically.<br/><br/>“You find a place to stay first, I’ll investigate the clues alone,” Zhou Xing Shi communicated to Fang Wang via the Sound Transmission Technique.<br/><br/>Fang Wang replied through the same technique, “How can that be okay? You are here to help me; how could I do nothing?”<br/><br/>“Although I come from a cultivation family, I have been wandering the world since I was ten and have long ventured through the Cultivation World. I am confident I can find clues about Fang Hanyu. You are stronger than I am, and should danger arise, your assistance will be needed sooner or later. With so many cultivators in this town, I fear something big might happen. It’s better for us to act separately,” Zhou Xing Shi explained through Sound Transmission.<br/><br/>After pondering for a moment, Fang Wang agreed, admitting that he indeed knew less about the Cultivation World than Zhou Xing Shi.<br/><br/>Subsequently, the two found an inn, booked rooms, and after Fang Wang went upstairs, Zhou Xing Shi left the inn to continue the investigation.<br/><br/>Once in his room, Fang Wang closed the door and sat down on the bed to cultivate.<br/><br/>Though he was only at the third layer of the Soul Sculpting Realm, he was confident in his ability to sweep through cultivators of the same realm. After all, he mastered many Great Perfection techniques and possessed what might be a Heaven Yuan Spirit Treasure, the Heavenly Palace Halberd.<br/><br/>Even filled with confidence, he didn’t want to waste time, as even the most potent Inner Strength required time to accumulate cultivation levels.<br/><br/>The sun set, and the moon rose.<br/><br/>With nightfall, the town grew quiet. Fang Wang occasionally sensed presences passing by the window, indicating that the night would not be peaceful.<br/><br/>As long as he wasn’t disturbed, he couldn’t be bothered to go out and investigate.<br/><br/>The night passed.<br/><br/>At the break of dawn, the town became lively once more, with rambunctious noises filling the streets. With Fang Wang’s hearing, he could make out some conversations.<br/><br/>“A disciple of Green Cicada Valley was found dead on the bridge to the east.”<br/><br/>“Who did it? Could it be Huangyu Mountain?”<br/><br/>“These two sects have been active a lot recently, as if they’re searching for something.”<br/><br/>“It’s said that the lair of a Great Cultivator of Ji Hao Sect was discovered in the demonic lands over five hundred miles to the west.”<br/><br/>“That person died horribly; even their eyes were dug out.”<br/><br/>In his room, Fang Wang slowly opened his eyes. It seemed the news had already spread, making the search for Fang Hanyu even more challenging.<br/><br/>He would have to put the training of his Heavenly Gang Sheng Ti Zhen Gong on hold and not rush it.<br/><br/>Fang Wang contemplated in his heart, deciding to leave once he found Fang Hanyu.<br/><br/>But Zhou Xing Shi had not returned all night. Had he run into trouble?<br/><br/>Fang Wang’s gaze flickered with caution. He remained vigilant about Zhou Xing Shi, worrying that Guang Qiuxian and Yang Yuanzi might be plotting against him. But then he thought, if they truly wanted to steal his treasure spirits, why go through such elaborate schemes for someone only at the Soul Sculpting Realm?<br/><br/>He suppressed the suspicion in his heart and decided to wait a bit longer. If Zhou Xing Shi hadn’t returned by noon, then he would have to take action on his own.<br/><br/>Fortunately, things were not as bad as he had feared. An hour later, Zhou Xing Shi returned.<br/><br/>Upon entering the room, Zhou Xing Shi closed all doors and windows.<br/><br/>“The situation is grim. Our disciple might have indeed obtained some legacy. Both Green Cicada Valley and Huangyu Mountain are searching for the whereabouts of the Tai Yuan Sect Disciples,” Zhou Xing Shi communicated, sitting in front of Fang Wang and still using the Sound Transmission Technique.<br/><br/>Fang Wang responded using the same technique, “Then, do you have any trace of Fang Hanyu?”<br/><br/>“Four months ago, Fang Hanyu indeed appeared in this town, but was chased by Green Cicada Valley and ran towards the deep mountains. The incident was witnessed by many merchants who have long resided in the town…” Zhou Xing Shi hesitated for a moment before continuing, “Being pursued by Green Cicada Valley for four months and still not returning to the sect, I fear he might be…”<br/><br/>He did not finish his sentence, but Fang Wang understood well.<br/><br/>The odds were stacked against them!<br/><br/>Fang Wang frowned. He and Fang Hanyu had a good relationship when they were young, and regardless, they shared the same surname. Plus, he had promised Zhou Xue to take care of their clan members.<br/><br/>“By the way, Zhou Xue is from your clan, right? Can she be trusted?” Zhou Xing Shi suddenly asked via Sound Transmission.<br/><br/>Fang Wang raised an eyebrow, asking in return, “Why do you ask that? Have you met her?”<br/><br/>“Indeed, the one who took out the Green Cicada Valley disciple last night was her. She was ruthless, using Green Cicada Valley’s methods to gouge out the man’s eyes…” Zhou Xing Shi said, shuddering uncontrollably with a look of fear.<br/><br/>To Fang Wang’s surprise, he felt elation instead. If Zhou Xue had arrived, then the chances of finding Fang Hanyu had increased.<br/><br/>“Trustworthy. I’ve been through life and death with her. You’ve seen her and she didn’t notice you?” he replied.<br/><br/>He was doubtful inside. Could Zhou Xing Shi’s experience in the Cultivation World truly compare to Zhou Xue’s?<br/><br/>Zhou Xing Shi shook his head, about to reply, when suddenly the door was pushed open, startling both of them to their feet. They fixed their gaze on the entrance, where a red-dressed woman wearing a Bamboo Hat walked in. Lifting her head, she looked at Fang Wang and Zhou Xing Shi with a condescending smile.<br/><br/>Who could it be if not Zhou Xue?<br/><br/>“You…”<br/><br/>Zhou Xing Shi, pale with shock, instinctively stepped in front of Fang Wang.<br/><br/>Zhou Xue laughed and said, “I was wondering why the Tai Yuan Sect Disciples were investigating the whereabouts of Fang Hanyu. Although the boy has good talent, his late start needs time to settle. The Tai Yuan Sect shouldn’t care about him. It turns out that the person behind this is you, kid. How did you two end up together?”<br/><br/>Having not seen her for several months, Zhou Xue appeared even more graceful, and Fang Wang still could not see through the depth of her cultivation.<br/><br/>No, he must learn the secret of how she conceals her cultivation!<br/><br/>Fang Wang said helplessly, “Can you close the door before we talk?”<br/><br/>Zhou Xue raised her hand, and the door behind her closed through the air. She took a seat at the table, her voice devoid of warmth, “Everyone in the inn has gone out to watch the excitement. You think you’re cautious, using Sound Transmission Technique to communicate, but daring to come here is simply reckless. The legacy of the Ji Hao Sect has spread, and even though you have reached the Soul Sculpting Realm, it’s still very dangerous.”<br/><br/>Her gaze was intense as she looked at Fang Wang, making him feel uncomfortable.<br/><br/>Fang Wang cleared his throat and said, “It’s all because Fang Hanyu went missing. I had no choice but to come. Who asked you to entrust their care to me?”<br/><br/>“It’s your duty to look after them within the sect. What are you doing running around outside? You’ve been in the Tai Yuan Sect for less than a year and already reached the third layer of the Soul Sculpting Realm. You should be focusing on your cultivation. Maybe in ten years, you could reach the Spirit Elixir Realm, and then you’d have enough strength to travel the Cultivation World,” Zhou Xue glared at Fang Wang and scolded him, clearly feeling like he was not living up to his potential.<br/><br/>Zhou Xing Shi walked to the side, curious about the closeness between Zhou Xue and Fang Wang, but even more shocked to learn that Fang Wang had reached the third layer of the Soul Sculpting Realm.<br/><br/>The two had begun their Spiritual Refinement on the same day, yet he had not even broken through to the second layer of the Soul Sculpting Realm…<br/><br/>Was this the difference between a Mysterious Origin Treasure Spirit and a Heaven Yuan Spirit Treasure?<br/><br/>When reprimanded by Zhou Xue, Fang Wang didn’t get angry; instead, he felt somewhat warmed by it.<br/><br/>In this unfamiliar place where the fate of his clansmen was unknown and he was caught between a rock and a hard place, Zhou Xue’s appearance brought him hope.<br/><br/>After all, she was an Immortal Venerable reborn. Following her would surely increase his chances of survival.<br/><br/>“By the way, what grade is your Lifespirit Treasure? Have you reached an Earth Origin Spirit Treasure?” Zhou Xue inquired.<br/><br/>Lifespirit Treasures are special. Unless a cultivator reveals them, it’s difficult for others to discern them. It’s said that Lifespirit Treasures are hidden within the soul, imperceptible even to divine consciousness from the outside.<br/><br/>Fang Wang nodded. Before he acted in the Heavenly Palace, his sword-shaped Lifespirit Treasure indeed could have been considered an Earth Origin Spirit Treasure. It seemed Zhou Xue’s discernment was sharp; she had pinpointed it with a glance.<br/><br/>Zhou Xing Shi internally roared with frustration. It was not just an Earth Origin Spirit Treasure; damn it, it was a Heaven Yuan Spirit Treasure!<br/><br/>It was precisely because Fang Wang’s Lifespirit Treasure was a Heaven Yuan Spirit Treasure that he found himself in this awkward situation, pressured by three parties and hesitating.<br/><br/>“Let’s talk about Fang Hanyu. Weren’t you supposed to be out for several years? After we find Fang Hanyu, I’ll take him back, and you can continue traversing the world,” Zhou Xue proposed.<br/><br/>Fang Wang changed the subject, aware that the more time wasted, the greater the danger Fang Hanyu might face.<br/><br/>Zhou Xue’s smile faded as she calmly said, “He’s not dead. As for how I know, I can’t tell you for now. I’ll go save him. You return to the mainland and find a place to wait for me.”<br/><br/>Fang Wang frowned and said, “Zhou Xue, I can help you. No matter what, since we started on the path of cultivation at the same time, our strengths shouldn’t be too far apart.”<br/><br/>Zhou Xing Shi was beside them, and it wasn’t appropriate for Fang Wang to speak too openly.<br/><br/>Zhou Xue couldn’t help but think back to the night of the massacre when she had indeed been careless. If not for Fang Wang’s intervention, she might have had to abandon the Fang Residence and flee alone. Then, just like in her previous life, burdened with a vendetta, she would have entered the Cultivation World, not nearly as carefree as she was now.<br/><br/>“This operation might encounter a master of the ninth layer of the Soul Sculpting Realm. Prepare yourselves mentally,” Zhou Xue said gravely.<br/><br/>Zhou Xing Shi’s eyelids twitched, and he clenched his fists.<br/><br/>Fang Wang asked in surprise, “Are you sure we won’t encounter any master of the Spirit Elixir Realm?”<br/><br/>Zhou Xue gave him a sidelong glance and said, “Based on my investigation, at least ninety percent sure.”<br/><br/>Fang Wang immediately understood. Zhou Xue in her previous life must have been involved or knew about this matter, hence her confidence. The remaining ten percent represented uncertainty; nothing in the world was absolute.<br/><br/>“Then let’s go!” Fang Wang said in a deep voice.<br/><br/>Soul Sculpting Realm ninth layer?<br/><br/>He wondered if his full strength, equipped with a Heaven Yuan Spirit Treasure, the Great Perfection of Solaris Scripture, the Great Perfection of Jinghong Divine Sword Art, and the Great Perfection of Great Celestial Thunder Technique, could withstand such an opponent.<br/><br/>There was always a burning desire within Fang Wang to chase after the strongest. He was eager to know just how powerful he could be if he gave his all.<br/><br/>If the opponent was of the Spirit Elixir Realm, then fleeing would be the best choice; but if it was only the Soul Sculpting Realm, then excuse me, but my sword has not been tested in vain!<br/><br/>“There’s no rush. Wait another five days. Practice here for now; I have things to do,” Zhou Xue said, then stood up, ready to leave the room.<br/><br/>“Wait, can you…” Fang Wang quickly spoke up, but Zhou Xue left without looking back, quickly exiting the room.<br/><br/>She came quickly and left just as swiftly.<br/><br/>Fang Wang sighed; it seemed she had anticipated what he wanted to say.<br/><br/>Zhou Xing Shi closed the room door and asked cautiously, “Did she really start cultivating at the same time as you? Why didn’t we notice her approach earlier?”<br/><br/>Fang Wang thought to himself that the means of an Immortal Venerable were beyond Zhou Xing Shi’s imagination. He answered nonchalantly, “How would I know? Why don’t you ask her?”<br/><br/>Zhou Xing Shi thought of Zhou Xue’s methods from the previous night and immediately shook his head.<br/><br/>Wait a minute!<br/><br/>That Zhou Xue seems to be a Demonic Cultivator!<br/><br/>Then Fang Wang…<br/><br/>At that thought, Zhou Xing Shi shuddered, not daring to look at Fang Wang.\t\t\t\t\t\t</div>", "images": {}, "success": true}