{"id": 26, "url": "https://www.novelhall.com/i-became-an-immortal-on-mortal-realm-32879/14234609.html", "title": "Chapter 26 - 26 Chapter 24: The Astonishing 32 Swords!_1", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 26 - 26 Chapter 24: The Astonishing 32 Swords!_1</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\t26 Chapter 24: The Astonishing 32 Swords!_1<br/><br/>Translator: 549690339<br/><br/>Hearing Fang Wang’s words, Zhou Xue immediately said to Zhou Xing Shi, “Carry him on your back, I’ll protect you guys, let’s go!”<br/><br/>“But…”<br/><br/>Zhou Xing Shi hesitated, his objective was to protect Fang Wang; he didn’t care about Fang Hanyu.<br/><br/>“Don’t worry, he’s very strong. Seize the time, don’t hold him back!” Zhou Xue said sternly, her tone somewhat impatient.<br/><br/>Pressed by her, Zhou Xing Shi had no choice but to lift Fang Hanyu onto his back, and the two dashed into the woods, quickly disappearing from view.<br/><br/>The middle-aged man standing beside the red palanquin immediately waved his hand, and instantly more than a dozen Green Cicada Valley disciples chased after Zhou Xue and the other.<br/><br/>Fang Wang raised his left hand in front of him, his index and middle fingers together. In an instant, three sword shapes condensed around him and immediately lunged at the batch of Green Cicada Valley disciples.<br/><br/>The sword Qi tore through the air with extreme speed!<br/><br/>The faces of those Green Cicada Valley disciples changed drastically. Those above the seventh level of the Qi Cultivation Realm scattered to avoid the attack, whereas those below the seventh level were pierced straight through the throat by the sword Qi, their blood spilling across the sky. The remaining disciples attempted to evade, but their speed was no match for the Jinghong Divine Sword Art.<br/><br/>In less than three breaths’ time, more than a dozen Qi Cultivation Realm Green Cicada Valley disciples lay dead, their bodies plummeting to the ground.<br/><br/>Fang Wang’s gaze remained fixed on the red palanquin above the Gu insect. He scoffed inwardly, “The Demonic Path is truly the Demonic Path; watching their fellows die horrific deaths, they still sit unmoved.”<br/><br/>The middle-aged man glared at Fang Wang, furious to the extreme. The disciples from Green Cicada Valley behind him spread out, surrounding Fang Wang completely, each taking out their own magic artifacts or Gu insects.<br/><br/>Encircled by hundreds of Green Cicada Valley disciples, Fang Wang was not at all flustered. His task was to delay the enemy as much as possible.<br/><br/>Finally, the curtain of the red palanquin was lifted, and a sinisterly handsome man in black brocade stepped out. His complexion was handsome, his lips a deep purple, even the bags under his eyes were deep purple, exuding a faint poison Qi between his brows. His long hair rested atop his head, secured by a diadem made from the carcass of a poisonous scorpion, striking terror in those who beheld it.<br/><br/>Li Hongshuang, the number one genius of Green Cicada Valley, had a reputation that preceded him even before he joined the Valley; his aura was distinctly different from the other Green Cicada Valley disciples.<br/><br/>At first glance, Fang Wang almost mistook him for an elder of Green Cicada Valley.<br/><br/>Li Hongshuang looked down at Fang Wang, then at the three sword shapes that returned to hover behind Fang Wang, standing suspended. He asked, “The Jinghong Divine Sword Art? What is your relationship with Yang Yuanzi?”<br/><br/>Fang Wang, wearing the bamboo hat, looked up, the shadow of the hat making his face appear exceptionally cold. The grievous state of Fang Hanyu had his desire to kill continuously rising.<br/><br/>“Is Yang Yuanzi the only person in the world who knows the Jinghong Divine Sword Art?” Fang Wang countered.<br/><br/>If not for the need to buy time for Zhou Xue and the others, he would have already made his move.<br/><br/>Li Hongshuang lifted his right hand, a blood-red banner flew out from above his head, quickly enlarging before landing back in his hand, taller than his entire body.<br/><br/>On the blood-red banner, an image of a malevolent spirit was depicted, hideous and terrifying, almost as if alive, writhing fiercely as the banner fluttered.<br/><br/>Lifespirit Treasure!<br/><br/>“Since you refuse to talk, I’ll force you to speak!” Li Hongshuang spoke coldly. As he spoke, he kicked the middle-aged man next to him away. Without needing his command, the Gu insect instantly pounced towards Fang Wang.<br/><br/>During the surprise attack, Li Hongshuang quickly waved the blood-red banner, billowing blood mist spread out, like long dragons going for Fang Wang.<br/><br/>Fang Wang’s eyes sharpened, his Spiritual Power erupted, forming multiple sword shapes around him.<br/><br/>The Jinghong Divine Sword Art, twelve swords!<br/><br/>He leaped into the air, stepped on his Flying Sword, and met the Gu insect in battle. The twelve sword shapes moved at an even faster speed, drawing different trajectories in the sky to scatter those blood mist dragons head-on.<br/><br/>Li Hongshuang’s lips curled into a smile as he leaped up, his left hand raised high before he slammed it down, his Spiritual Power coalescing into a huge black palm that bore down upon Fang Wang.<br/><br/>Fang Wang violently threw out his Qingjun Sword, which turned into a streak of azure light and sped away, as fast as lightning, shattering the giant black palm. Li Hongshuang instinctively twisted his body, avoiding the Qingjun Sword, but a lock of his sideburns was sheared off.<br/><br/>“Superior Grade Spiritual Weapon!”<br/><br/>Li Hongshuang’s eyes flashed with fierce intensity. He was not deterred, instead charging toward Fang Wang.<br/><br/>Within the blink of an eye, the two collided, Fang Wang using his fingers as swords, manipulating the twelve sword shapes to launch a frenzied attack on Li Hongshuang. Li Hongshuang waved the blood-red banner swiftly, defending against the twelve sword shapes while also mounting an offensive.<br/><br/>Such a malicious poison Qi!<br/><br/>Fang Wang noticed that his twelve sword shapes, after being tainted with poison mist, began to shrink; this poison could corrode Spiritual Power!<br/><br/>Li Hongshuang’s attacks were fierce. In terms of hand speed alone, he was the strongest opponent Fang Wang had ever encountered.<br/><br/>A sweep of the blood-red banner, and his left palm followed through from underneath it to strike at Fang Wang’s chest.<br/><br/>Clang!<br/><br/>Li Hongshuang was sent flying back, Fang Wang was also pushed back. Judging by the distance each had retreated, it was hard to tell who was superior.<br/><br/>“What cultivation technique is this?” Li Hongshuang frowned, his left hand trembling slightly. He immediately clenched his fist, forcibly suppressing it.<br/><br/>Following his gaze, Fang Wang was surrounded by a layer of visible Qi that caused the surrounding space to vibrate.<br/><br/>“What domineering Spiritual Power!”<br/><br/>Fang Wang inwardly marveled, but was even more excited. Indeed, this was Green Cicada Valley’s future Valley Master.<br/><br/>After an exchange of blows, he got a rough measure of Li Hongshuang’s strength. His desire to kill surged uncontrollably, erupting from his eyes.<br/><br/>Fang Wang’s right hand pointed upwards, and the number of sword shapes behind him began to increase.<br/><br/>Sixteen swords!<br/><br/>Eighteen swords!<br/><br/>Twenty-two swords!<br/><br/>Li Hongshuang was shaken, waves of shock crashing through his heart. He knew quite a bit about the Jinghong Divine Sword Art, and knew that Yang Yuanzi had not surpassed fifteen swords at the Soul Sculpting Realm.<br/><br/>He did not panic, but immediately waved his sleeve, and countless poisonous insects flew out from within, swarming densely to form a suffocating canopy of shadows in the sky above the woods.<br/><br/>Fang Wang gathered 27 swords in one breath, each sword circling around his body, making his robe flap violently, as if it might shatter at any moment.<br/><br/>The more sword formations that were formed with the Jinghong Divine Sword Art, it wasn’t just about having a greater number, but also the strength of each sword continually increasing. The appearance of 27 swords brought Fang Wang’s sword momentum to a terrifying level. Even the disciples of Green Cicada Valley who were watching the battle were uneasy, with some even retreating.<br/><br/>Fang Wang’s gaze was fixed on Li Hongshuang as he coldly said, “If this is all you’re capable of, then you have no future.”<br/><br/>Upon hearing this, Li Hongshuang flew into a rage. He immediately raised the blood-colored flag high above, and amidst the dark clouds formed by countless poisonous insects, blood-colored lightning emerged, one bolt after another, with imposing thunderous might.<br/><br/>A formation!<br/><br/>…<br/><br/>In the woods, Zhou Xue and Zhou Xing Shi were rapidly weaving through, passing by the bodies of beasts and cultivators, a truly harrowing sight.<br/><br/>Boom!<br/><br/>As thunderous roars resounded from behind, Zhou Xing Shi couldn’t help but ask with concern, “Can he really escape?”<br/><br/>That was Li Hongshuang!<br/><br/>Even though Fang Wang was a Heaven Yuan Spirit Treasure, Li Hongshuang, after all, was an Earth Origin Spirit Treasure, and there was a significant gap between their cultivation levels.<br/><br/>How could someone from the third level of the Soul Sculpting Realm stand a chance against someone from the ninth level, especially when the opponent was the number one talent from a Demonic Sect!<br/><br/>Zhou Xue, keeping her eyes forward and not looking back, said, “Don’t underestimate him, this kid always has a card up his sleeve. Are you sure you know his full strength? Even if he can’t defeat Li Hongshuang, escaping with his life is hardly difficult for him.”<br/><br/>Upon hearing this, Zhou Xing Shi felt somewhat reassured.<br/><br/>Yes.<br/><br/>He didn’t know the full extent of Fang Wang’s strength.<br/><br/>Fang Hanyu, who was lying on Zhou Xing Shi’s back, had been silent, but he was also sweating bullets for Fang Wang in his heart.<br/><br/>…<br/><br/>Boom! Boom! Boom…<br/><br/>Thunderbolts rained down one after another, devastating the woods. The disciples of Green Cicada Valley screamed as they were struck, their bodies blackened and charred. From the original group of three or four hundred disciples, only a third remained. They all hid far away, watching the battlefield with fear, as Li Hongshuang’s giant insect pressed down on the forest, emitting wafts of smoke, the blood mist that permeated the air adding a suffocating atmosphere to the battlefield.<br/><br/>This thunder was not from Li Hongshuang’s formation!<br/><br/>With her hairpin fallen and her hair disheveled, Li Hongshuang bit her teeth with a fierce gaze on Fang Wang and coldly uttered, “The Great Celestial Thunder Technique, who on earth are you? Could it be that you are Lu Yuanjun?”<br/><br/>Fang Wang, holding the Qingjun Sword high, pointed its tip toward the center of the thunderclouds above, with 27 swords revolving around him. In this moment, his presence reached its peak, unparalleled.<br/><br/>Fang Wang snorted, “What is Lu Yuanjun compared to me!”<br/><br/>Suddenly, he retracted his sword and turned into a white rainbow as he rushed toward Li Hongshuang.<br/><br/>The White Rainbow Evasion Technique wasn’t necessarily only for fleeing!<br/><br/>Li Hongshuang, enraged, held the blood-colored flag in his left hand and a long sword in his right, charging to meet Fang Wang head-on.<br/><br/>Under the watchful eyes of all, he could not allow himself to fail!<br/><br/>Clang!<br/><br/>Their swords collided, sparking flames, and as their eyes met, lethal intent surged in both. Almost instantly, they struck at the same time, their magic artifacts moving so fast they created afterimages.<br/><br/>The 27 swords of the Jinghong Divine Sword Art followed Fang Wang’s lead, attacking Li Hongshuang from all directions. Li Hongshuang fought with wide swings, the blood-colored flag whirling, fending off the 27 swords, and his long sword unleashed a set of fierce sword techniques, facing Fang Wang single-handedly.<br/><br/>The rolling blood mist spread, and the figures of the two intertwined, battling from the sky to the ground, their footsteps scraping the earth and sending stones and sand flying.<br/><br/>The sight chilled the remaining disciples of the Green Cicada Valley.<br/><br/>“How is this possible! Brother Li can’t take him down!”<br/><br/>“Who is this person after all?”<br/><br/>“He must be from the Great Abyss Gate, otherwise why would he save that Tai Yuan Sect disciple, I didn’t expect there to be such a formidable person in the Great Abyss Gate.”<br/><br/>“Did you hear what Brother Li said earlier? The Great Celestial Thunder Technique, the Jinghong Divine Sword Art, these are the supreme techniques of the Great Abyss Gate. Mastering one and bringing it to great completion, one could dominate Da Qi. It’s surprising that there’s a disciple who has mastered two such arts!”<br/><br/>“Could this person possibly be the elite disciple of a single lineage within the Great Abyss Gate?”<br/><br/>Fang Wang and Li Hongshuang no longer cared to listen to the disciples’ discussions; in their hearts, there was only one thing – to kill each other.<br/><br/>Fang Wang was seeking vengeance for Fang Hanyu, and Li Hongshuang was fighting for his pride!<br/><br/>Li Hongshuang swung his sword fiercely, his poison-laced Sword Qi bombarded Fang Wang like a storm. Fang Wang used the Shadowless Step to quickly dodge. His gaze sharpened, and behind him, sword shapes began to coalesce once again.<br/><br/>Five swords appeared at once!<br/><br/>Thirty-two swords!<br/><br/>Li Hongshuang’s pupils shrank with horror. Before he could speak, the speed of the 32 sword shapes surrounding Fang Wang suddenly increased, their might even greater.<br/><br/>The 32 swords attacked Li Hongshuang relentlessly. He barely managed to defend with the two magic artifacts, but in less than three breaths’ time, he was wounded and increasingly overwhelmed.<br/><br/>Fang Wang hurled the Qingjun Sword, cutting through the swirling dust, advancing straight towards Li Hongshuang.<br/><br/>Even as he was caught off guard by the 32 swords, Li Hongshuang was still quick to react. His body leaned back to dodge the Qingjun Sword. Just as he was regaining his stance, the 32 swords simultaneously attacked from all directions.<br/><br/>Clang!<br/><br/>Li Hongshuang’s sword crashed to the ground, and the 32 sword shapes pierced into his body, blood spurting wildly. Even from his mouth gushed forth copious amounts of venomous blood, unstoppable.<br/><br/>He glared at Fang Wang with bloodshot eyes, his lips trembling, “Jinghong… Thirty-two swords… who exactly are you…”<br/><br/>Sputter!<br/><br/>All of a sudden, the Qingjun Sword came from behind, decapitating him, his head rolling to the ground, coming to a stop against Fang Wang’s right foot, eyes still wide open in anger.\t\t\t\t\t\t</div>", "images": {}, "success": true}