{"id": 20, "url": "https://www.novelhall.com/i-became-an-immortal-on-mortal-realm-32879/14234591.html", "title": "Chapter 20 - 20 Chapter 18: The Next Sect Leader Of The Great Abyss Gate_1", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 20 - 20 Chapter 18: The Next Sect Leader Of The Great Abyss Gate_1</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\t20 Chapter 18: The Next Sect Leader of the Great Abyss Gate_1<br/><br/>Translator: 549690339<br/><br/>The Superior Mysterious Origin Treasure Spirit should have been regarded as a precious treasure by the Great Abyss Gate, which was why Guang Qiuxian allowed Zhou Xing Shi to stay and enjoy the show. In his opinion, Fang Wang being able to create an Earth Origin Spirit Treasure was already wishful thinking. Even if he succeeded, it would be a good opportunity for these two talents to know each other, support each other, and grow together.<br/><br/>But as Fang Wang’s treasure spirit surpassed the Earth Origin Spirit Treasure, everything changed.<br/><br/>The Superior Mysterious Origin Treasure Spirit was simply not worth mentioning in front of the Heaven Yuan Spirit Treasure!<br/><br/>Guang Qiuxian realized one thing, once Fang Wang’s treasure spirit became known, the other eight major sects would certainly find every possible means to eliminate Fang Wang, so he could not let this news spread.<br/><br/>His gaze towards Zhou Xing Shi became even colder, while Yang Yuanzi did not hide his killing intent.<br/><br/>Facing the murderous intent of two sect powerhouses, Zhou Xing Shi was so scared that he knelt down, begging for mercy, “Sect Leader! I definitely won’t speak of this, truly! You must believe me! After all, I am also a possessor of the Superior Mysterious Origin Treasure Spirit. In the future, I will surely make significant contributions to the Great Abyss Gate!”<br/><br/>By the end of his plea, his forehead was pressed tightly against the ground.<br/><br/>He understood that he couldn’t escape and could only beg for mercy.<br/><br/>Yang Yuanzi looked at Guang Qiuxian and said coldly, “Sect Leader, we cannot afford any slightest uncertainty in this matter. If you’re reluctant to act, let me do it!”<br/><br/>Guang Qiuxian remained silent.<br/><br/>Yang Yuanzi raised his right hand, condensing a streak of Sword Qi on his palm.<br/><br/>Seeing this, Fang Wang, who held the Heavenly Palace Halberd, asked, “Is there no way to control him? To prevent him from speaking of what he’s seen and heard today?”<br/><br/>He wasn’t so kind-hearted. His own life being at stake, he had no interest in asking Guang Qiuxian and Yang Yuanzi to spare Zhou Xing Shi. If Zhou Xing Shi could be controlled, then he could be allowed to live. If not, then murder was the only option.<br/><br/>The Heaven Yuan Spirit Treasure thrilled Fang Wang beyond his expectations. However, joy was soon followed by endless worries. The Earth Origin Spirit Treasure alone was enough to propel the Great Abyss Gate to new heights, let alone another Heaven Yuan Spirit Treasure…<br/><br/>Most importantly, Guang Qiuxian was still unsure of the specific grade of his Heavenly Palace Halberd.<br/><br/>At that moment, Fang Wang was even worried that Guang Qiuxian and Yang Yuanzi might harbor malicious intentions.<br/><br/>After hearing Fang Wang’s words, Yang Yuanzi glanced at Guang Qiuxian. Guang Qiuxian took a deep breath and said, “The Heaven Yuan Spirit Treasure is of great importance and must be handled with caution. Nonetheless, the Great Abyss Gate is not the Demonic Path. Let’s do as Fang Wang suggests.”<br/><br/>Upon hearing this, Yang Yuanzi couldn’t help but shake his head, thinking Guang Qiuxian was too merciful.<br/><br/>Then Yang Yuanzi stepped forward, dissipating the Sword Qi in his hand. He pulled out a small bottle from his storage bag, squatted in front of Zhou Xing Shi, grabbed his jaw with his left hand, pried his mouth open, and poured the contents of the small bottle into it.<br/><br/>Throughout the process, Zhou Xing Shi didn’t show the slightest resistance, knowing this was his only chance for survival. He even cast a grateful look towards Fang Wang.<br/><br/>Fang Wang, however, saw that the contents of the small bottle were deep red insects, making his skin crawl.<br/><br/>“This is the Myriad Poison Autumn Spring Insect, incurable by any medicine. When the person dies, the insect perishes. They are born tamed, and whenever someone recites the incantation in front of the one who has ingested the insect, the Myriad Poison Autumn Spring Insect will self-destruct, spreading the poison throughout the body and causing the person to die violently within three breaths.”<br/><br/>Yang Yuanzi stood up, looking down on Zhou Xing Shi as he spoke, his face indifferent as if he were looking at a crawly insect.<br/><br/>Afterward, he transmitted the incantation to Fang Wang secretly.<br/><br/>Fang Wang’s expression remained calm, but inside he felt it strange that his master did not seem like a member of the righteous sects at all, keeping such a poisonous creature.<br/><br/>Turning to face Fang Wang, Guang Qiuxian said, “The matter of the Heaven Yuan Spirit Treasure must be kept secret. From now on, I won’t show you any special favor publicly and will treat you as an ordinary disciple. However, you can come to me with any issue at any time, and I will help you resolve them in private. I assure you, you will be the next Sect Leader of the Great Abyss Gate!”<br/><br/>Regardless of character or background, the position of Sect Leader was now promised to Fang Wang.<br/><br/>At that moment, Fang Wang truly understood the significance of the Heaven Yuan Spirit Treasure, and he quickly replied, “Whether I become the Sect Leader is irrelevant to me. Having joined the Great Abyss Gate, I will forever be a disciple, ready to go through fire and water for the sect!”<br/><br/>Fancy words, who can’t say them?<br/><br/>At least he needed to handle the current situation better to avoid arousing Guang Qiuxian’s suspicion.<br/><br/>“Only the four of us can be privy to this matter. Fang Wang, you also cannot tell your clan. The Heaven Yuan Spirit Treasure is indeed powerful, but you have not yet grown. You must stay low-key. From now on, your Lifespirit Treasure will be set as the Superior Mysterious Origin Treasure Spirit,” Guang Qiuxian said, glancing at Zhou Xing Shi, who had just gotten up, and spoke firmly, “Zhou Xing Shi, from now on, your duty will be to protect Fang Wang. You shall follow his commands, and your treatment will be the same as that of a chief disciple of a single meridian!”<br/><br/>Hearing that, Zhou Xing Shi hurriedly expressed his thanks to Guang Qiuxian, then thanked Fang Wang again.<br/><br/>Yang Yuanzi followed up, saying, “Sect Leader, let me take Fang Wang away first. Many people have arrived outside, and they must not see Fang Wang.”<br/><br/>Guang Qiuxian nodded, and then Yang Yuanzi retrieved another set of clothes from his storage bag and threw them to Fang Wang.<br/><br/>Fang Wang quickly dressed and followed Yang Yuanzi’s footsteps.<br/><br/>There was actually a tunnel leading underground inside Shiyuan Hall. Along the way, Fang Wang was feeling the Heavenly Palace Halberd inside his body.<br/><br/>Inside him, the Heavenly Palace Halberd occupied an independent space above the Dantian. It was pitch black, and he couldn’t tell whether it was an extradimensional space or a soul space. However, he could feel the presence of the Heavenly Palace Halberd and could summon it at any time.<br/><br/>But there was one thing that puzzled him. The space occupied by the Heavenly Palace Halberd was very small compared to the entire dark space, and it wasn’t in the central position.<br/><br/>Could there be a second Lifespirit Treasure?<br/><br/>The tunnel was quiet, and just as Fang Wang was curious and confused, Yang Yuanzi’s voice came from ahead, “Fang Wang, remember, you can’t fully trust anyone, including the Sect Leader, and even your master.”<br/><br/>Fang Wang looked up, watching Yang Yuanzi’s back, unsure of how to respond.<br/><br/>“People’s hearts ultimately change. The Sect Leader is willing to train you as the next leader because he hasn’t reached his limit. When he faces his limit, what kind of evil thoughts he might have, even your master can’t imagine. In the Cultivation World, seizing treasures and seizing bodies are not uncommon. Not to hide this from you, your master has once had such evil thoughts.”<br/><br/>Yang Yuanzi’s tone was ghostly, making it impossible to gauge what he was thinking.<br/><br/>Fang Wang spoke, “Thank you for the reminder, Master. Your disciple will keep it in mind. I will never forget your kindness and will repay you in the future.”<br/><br/>“Is that so?”<br/><br/>Yang Yuanzi chuckled without ever turning back or stopping his stride.<br/><br/>For the rest of the journey, he remained silent, and Fang Wang grew anxious, fearing a sudden attack.<br/><br/>Fortunately, their trip passed without incident, and upon reaching the cave entrance, Yang Yuanzi told him to go back to his dwelling first.<br/><br/>Fang Wang flew away on his sword, and along the way, he noticed many disciples gathered at various peaks, seemingly discussing something. Since his induction, it was the first time he had seen such a lively scene.<br/><br/>Could it be related to the commotion caused by the Heavenly Palace Halberd?<br/><br/>Fang Wang’s heart tensed, and he quickened his pace.<br/><br/>Upon returning to the third vein, he landed at the entrance of his dwelling and saw Gu Li standing at her entrance, gazing into the distance.<br/><br/>Gu Li turned to face Fang Wang and asked, “Brother Fang, where have you returned from?”<br/><br/>Fang Wang replied, “I went to the Daofa Pavilion. Something seems to have happened at the Tai Yuan Sect. If Miss Gu is interested, you could talk with the other disciples.”<br/><br/>With that, he entered his dwelling.<br/><br/>Gu Li’s face betrayed her suspicion, but she didn’t think too much about it. She was full of confusion about what could have happened to make her Lifespirit Treasure uncontrollable.<br/><br/>After closing the door of his dwelling, Fang Wang went straight to the open space inside and summoned the Heavenly Palace Halberd, admiring his Lifespirit Treasure the more he looked at it.<br/><br/>Holding the Heavenly Palace Halberd, he felt an overwhelming sense of power, no wonder Spiritual Refinement was so crucial for cultivators.<br/><br/>Then, he retracted the Heavenly Palace Halberd and sat cross-legged on his white jade bed to consolidate his cultivation.<br/><br/>He had reached the first layer of the Soul Sculpting Realm, which was also divided into nine layers. He planned to practice calmly and wait for the commotion to pass.<br/><br/>The emergence of the Heavenly Palace Halberd had changed Fang Wang’s approach; he could no longer focus solely on swordsmanship and would have to learn the arts of using long weapons.<br/><br/>The Jinghong Divine Sword Art wasn’t a waste, after all, it didn’t require a sword. He resolved not to use the Heavenly Palace Halberd casually while in the Tai Yuan Sect and felt that the Jinghong Divine Sword Art should be enough to sweep through competitors of the same realm.<br/><br/>Ah, pretending to be a Sword Cultivator!<br/><br/>And so, two months hurried by.<br/><br/>After entering the Soul Sculpting Realm, Fang Wang’s progress in cultivation began to slow down. Even with the Great Perfection’s Solaris Scripture, he barely managed to break through to the second layer after two months.<br/><br/>Until this day.<br/><br/>Fang Hanyu came to visit Fang Wang, interrupting his life of cultivation.<br/><br/>After inviting Fang Hanyu into his dwelling, the brothers exchanged pleasantries. Fang Hanyu brought up the recent significant events in the Tai Yuan Sect. All cultivators in the Soul Sculpting Realm had experienced their Lifespirit Treasures becoming uncontrollable at the same time, leading to a speculation circulating within the sect.<br/><br/>That was the birth of a supreme treasure!<br/><br/>Upon hearing such speculation, Fang Wang breathed a sigh of relief in his heart.<br/><br/>Before he was strong enough, he dared not expose the rank of his Lifespirit Treasure.<br/><br/>“Fang Wang, I visited you today because I have something…” Fang Hanyu hesitated.<br/><br/>Fang Wang rolled his eyes and replied irritably, “I can’t stand your dithering. Since you’re already here, you can’t possibly hold it in, can you? Just say it, we are brothers, after all.”<br/><br/>Well, not blood brothers, so don’t ask for too much.<br/><br/>Relieved, Fang Hanyu said, “I plan to go out for training. Zhou Xue instructed me to look after the other clan members and to trouble you as little as possible. But if I stay within the Tai Yuan Sect, it’s hard to advance by leaps and bounds, considering I’m just an Inner Sect Disciple. I want to seek out opportunities.”<br/><br/>“Is that all? Do you have a plan?” Fang Wang asked.<br/><br/>Each person has their destiny. The other Fang Family Disciples didn’t have his talent or privilege. Seeking their fortunes was the right thing to do.<br/><br/>Fang Hanyu nodded and said, “A senior sister from the second vein has obtained a map of a secret realm that is said to contain a Great Cultivator’s remains. Twenty-three disciples from my vein have decided to go together, and I don’t want to miss out.”<br/><br/>Fang Wang considered for a moment, then nodded, “Go then, I’ll take care of the other clan members.”<br/><br/>Fang Hanyu showed his gratitude with a smile, quickly thanked him, and after a short chat, he took his leave since there was no more to discuss.<br/><br/>No sooner had he left than another visitor arrived at Fang Wang’s doorstep.<br/><br/>Zhou Xing Shi!<br/><br/>With the spell to kill Zhou Xing Shi in hand, Fang Wang naturally wasn’t afraid of him, so he invited him into his dwelling.<br/><br/>Though Zhou Xing Shi wore the Dao Robe of a Tai Yuan Sect Disciple, he kept his bamboo hat on, looking travel-worn. He sat down at the stone table and took out two Jade Slips from inside his chest, “These are the Superior Spell Arts entrusted to me by the Sect Leader for you. They suit your Treasure Spirit and must not be disclosed to others.”\t\t\t\t\t\t</div>", "images": {}, "success": true}