{"id": 24, "url": "https://www.novelhall.com/i-became-an-immortal-on-mortal-realm-32879/14234603.html", "title": "Chapter 24 - 24 Chapter 22: The Position Of The Eldest Disciple Is Settled_1", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 24 - 24 Chapter 22: The Position Of The Eldest Disciple Is Settled_1</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\t24 Chapter 22: The Position of the Eldest Disciple is Settled_1<br/><br/>Translator: 549690339<br/><br/>For an entire day, Fang Wang stayed in his guest room practicing his cultivation, while Zhou Xing Shi did the same in his room, neither disturbing the other, yet both harbored their thoughts.<br/><br/>Fang Wang was curious about what Zhou Xue was doing and why she would want to gouge out the eyes of the disciples of Green Cicada Valley, while Zhou Xing Shi was torn with conflict. If both Fang Wang and Zhou Xue were Demonic Cultivators, then the Great Abyss Gate nurturing Fang Wang would be like digging its own grave. However, Fang Wang had treated him well, even imparting the Body-protecting Divine Barrier and the Great Celestial Thunder Technique to him, causing him great anguish.<br/><br/>In the days that followed, the atmosphere in Fang Town became increasingly tense, with more and more battles at night, and a growing number of corpses appearing during the day.<br/><br/>Fang Wang heard the cultivators passing by the street below discussing that the victims were almost all gouged of both eyes.<br/><br/>Could it all be Zhou Xue’s doing?<br/><br/>Why would she do such a thing? Doesn’t she fear attracting the attention of the Great Cultivators of Green Cicada Valley?<br/><br/>Fang Wang believed that Zhou Xue wouldn’t betray him, so he could only suppress his confusion and continue his cultivation.<br/><br/>Five days passed quickly.<br/><br/>On this day, before dawn, Zhou Xue came to find them, asking Fang Wang and Zhou Xing Shi to follow her and leave.<br/><br/>The three of them swiftly left the town and entered the forest.<br/><br/>Fang Wang couldn’t help but ask, “Are those corpses with gouged eyes your doing?”<br/><br/>He always felt that her actions weren’t as simple as eradicating demons, that she must be plotting something. Yet he worried that Zhou Xing Shi would inform Guang Qiuxian about Zhou Xue’s methods. If Guang Qiuxian concluded that Zhou Xue was a Demonic Cultivator, it would be bad.<br/><br/>“Hmm, isn’t exterminating evil part of what we righteous cultivators should do?” Zhou Xue, walking ahead, suddenly turned her head and smiled at Fang Wang. Her smile sent a chill down Zhou Xing Shi’s spine.<br/><br/>“Let me tell you, Green Cicada Valley is practicing a Secret Technique called the Absolute Heart Evil Eye, which requires gouging the eyes of living people to craft the evil eyes. What I have done is simply to mislead Green Cicada Valley, making them suspect their own members, thereby succumbing to internal suspicion. At the same time, I can collect spirit stones, elixirs, magic artifacts, and so on while killing Demonic Cultivators.” Zhou Xue turned back, looking forward, and said calmly.<br/><br/>Zhou Xing Shi breathed a sigh of relief upon hearing this.<br/><br/>The explanation seemed reasonable; although he had never heard of the Absolute Heart Evil Eye, at least it was something he could report.<br/><br/>The three of them walked through the forest, not too fast; along the way, Zhou Xue occasionally sprinkled the flowers and plants by the roadside with powder.<br/><br/>Fang Wang and Zhou Xing Shi were puzzled but did not ask further.<br/><br/>Until nightfall.<br/><br/>The three of them rested in the woods, and Zhou Xue called Fang Wang aside, leaving Zhou Xing Shi by the campfire. He just glanced at the two of them.<br/><br/>Fang Wang followed Zhou Xue to a riverside a few miles away where they stood facing each other. Zhou Xue frowned and asked, “What exactly is the matter with that guy having the Spring Autumn Wondrous Worm inside him? How come he is so obedient to you?”<br/><br/>After thinking it over, Fang Wang decided to speak about the incident that had occurred, but he did not reveal the grade of his spirit treasure.<br/><br/>“I see, it seems these two still have a conscience. However, the Spring Autumn Wondrous Worm can’t be controlled by just an incantation,” said Zhou Xue with a strange tone.<br/><br/>Fang Wang asked, “Can you solve it?”<br/><br/>Zhou Xue smiled and said, “The Spring Autumn Wondrous Worm is a gu insect of Green Cicada Valley. I have cultivated there for fifty years, of course, I can solve it. But now is not the time, to avoid alerting the enemy. Before reaching the Profound Heart Realm, you must leave the Great Abyss Gate, at least you cannot break through while at the Great Abyss Gate. When that time comes, I will guard you personally.”<br/><br/>Hearing this, Fang Wang felt much more at ease.<br/><br/>“Aren’t you an Immortal Venerable? Why are you after the legacy of Ji Hao Sect?” Fang Wang changed the subject and asked, a question that had been bothering him for a long time.<br/><br/>Zhou Xue couldn’t have come for Fang Hanyu, who had only passed a message to the Tai Yuan Sect, and Zhou Xue being outside, should not be aware of his trouble.<br/><br/>Zhou Xue glanced at Fang Wang and said, “Although I was an Immortal Venerable, before ascending, I did not reach the level where I could master all the unique skills in the world. You mustn’t think that an Immortal Venerable can overlook and scrutinize everything in the mortal realm. If you think so, you’re sorely mistaken. Mortals and immortals are separated by a great divide; it’s hard to cross. Mortals cannot reach The Upper Realm, and mighty beings from The Upper Realm cannot descend to the mortal world; they are two different worlds, though The Upper Realm is stronger.”<br/><br/>“Besides, I am not here for the unique skills but for the special Magic Artifacts, Heavenly Materials and Earthly Treasures, and top-quality Spirit Stones left behind by the Ji Hao Sect. Even if I’ve been reborn as an Immortal Venerable, I still need to cultivate step-by-step. Gathering resources for cultivation from the mortal realm is what I need to do, and, ascending is not so simple.”<br/><br/>When talking about ascending, Zhou Xue’s expression became one that Fang Wang could not understand.<br/><br/>It seemed that ascending was incredibly difficult. Even Zhou Xue, who had already successfully ascended, was not absolutely certain she could do it again.<br/><br/>Fang Wang was not intimidated; with the Heavenly Palace, there was hope for everything.<br/><br/>“The Cultivator who attacked the Fang Residence before was named Luo Shang, where do you guess he comes from?” Zhou Xue suddenly fixed her gaze on Fang Wang, asking with cold eyes.<br/><br/>Fang Wang furrowed his brows and asked, “Green Cicada Valley?”<br/><br/>He made this guess considering Zhou Xue’s recent retaliation against Green Cicada Valley.<br/><br/>“No, Great Abyss Gate!”<br/><br/>“What?”<br/><br/>Fang Wang was deeply moved, and his hands clenched tightly within his sleeves.<br/><br/>Zhou Xue said with emotion, “In my past life, after I escaped death and wandered for many years, by the time I stepped onto the path of cultivation and wanted to investigate the annihilation of the Fang Residence, there were no clues to be found. Before my rebirth, I didn’t even know his name. In Da Qi, besides the Fang Residence, other Duke’s Mansions and cities were also slaughtered by mysterious Qi Cultivation Realm cultivators. In my previous life, I only knew that it was a conspiracy between the reigning Prime Minister and the cultivation sects. By the time I had the power to investigate, the Prime Minister had long been dead, and his family did not meet good ends, so the matter was left unresolved.”<br/><br/>“Three months ago, I went to monitor a Duke’s Mansion that was supposed to be destroyed and caught another cultivator. He revealed the truth: he and Luo Shang were both Outer Sect Disciples of the first lineage of Great Abyss Gate, acting on Lu Yuanjun’s orders, disguised as demonic cultivators. After all, the Soul Burning Banner is a common Ghost Instrument in the Cultivation World, making it easy to conceal one’s identity.”<br/><br/>Lu Yuanjun!<br/><br/>The number one genius of the Great Abyss Gate, a mid-grade Earth Origin Spirit Treasure!<br/><br/>Fang Wang furrowed his brows. The vengeance for the Fang Residence could not go unanswered; how could he rest when so many had perished?<br/><br/>Zhou Xue continued, “I suspect Great Abyss Gate is unaware of this affair, and behind it all may even be the Emperor of Da Qi. In my past life, Lu Yuanjun had a very good relationship with the Emperor of Da Qi. It was largely thanks to Lu Yuanjun’s support that Da Qi transformed into a Cultivation Dynasty. I’m telling you this to caution you against Lu Yuanjun, a person who appears kind and is always able to draw people to serve him.”<br/><br/>Fang Wang’s gaze flickered as he asked, “Are you certain it was him?”<br/><br/>“Yes, the Outer Sect Disciple I forced a confession from admitted that it was Lu Yuanjun who ordered them to help gather souls, probably because Lu Yuanjun is cultivating a powerful Ghost Instrument,” Zhou Xue nodded, her eyes also flashing with a murderous intent.<br/><br/>Lu Yuanjun!<br/><br/>For Fang Wang and Zhou Xue, this was a towering mountain that currently stood in their way. They couldn’t just accuse Lu Yuanjun; the entire Great Abyss Gate was facilitating his rise.<br/><br/>Fang Wang took a deep breath and said, “If that’s the case, then I am determined to win the status of the Great Abyss Gate’s chief disciple!”<br/><br/>Zhou Xue showed a smile and said, “That’s right, it’s good that you have such ambition. I didn’t misjudge you. Until you become the chief disciple, let’s pretend this incident never happened. Though Great Abyss Gate belongs to the orthodox cultivation path, not everyone there is benevolent. The fate of Zhou Xing Shi is the best proof of that.”<br/><br/>For a moment, Fang Wang had even thought about seeking Guang Qiuxian and using his heaven-tier Heaven Yuan Spirit Treasure to pressure Lu Yuanjun, but he quickly dismissed the idea as too risky.<br/><br/>Todays’s Lu Yuanjun was not like him; he was the face of Great Abyss Gate. Could Guang Qiuxian really suppress Lu Yuanjun directly?<br/><br/>Even if he could, it was likely only to be a punishment. Surely they couldn’t kill Lu Yuanjun for the sake of some mortals, could they?<br/><br/>“Tell me, what do you want to learn? I’ll teach you, but remember, you can only make one request,” Zhou Xue said with her arms folded and eyebrows raised, looking at Fang Wang.<br/><br/>Upon hearing this, Fang Wang immediately said, “Heavenly Gang Sheng Ti Zhen Gong!”<br/><br/>Zhou Xue couldn’t help but glower at him and said in annoyance, “Do you really think I know everything? I didn’t acquire this technique in my past life. Before ascension, I wasn’t an invincible existence. There were more than a handful of people who could compete with me. Ascension also depends on opportunity.”<br/><br/>Fang Wang smiled. He was just testing the waters. Since Zhou Xue didn’t know the technique, he decided to learn the art of concealing his presence instead.<br/><br/>Upon hearing his request, Zhou Xue agreed readily.<br/><br/>This technique was called the Breathless Natural Skill, an auxiliary Inner Strength method mainly for concealing one’s emotions.<br/><br/>In the Heavenly Palace, Fang Wang only took ten years to reach Great Perfection. From Zhou Xue’s perspective, the moment Fang Wang finished speaking, his presence vanished instantly. If she closed her eyes and didn’t use her spiritual sense, she wouldn’t even be able to detect anyone in front of her.<br/><br/>“With this kid’s comprehension, he’ll be able to topple Lu Yuanjun sooner or later,” Zhou Xue said with a relieved smile, her confidence in Fang Wang’s talent long established.<br/><br/>Fang Wang was responsible for competing for the position of chief disciple within Great Abyss Gate to seek benefits for the Fang Family, while she would nurture the Fang Family. For her, Great Abyss Gate was merely a stepping stone in her plan.<br/><br/>…<br/><br/>Sunlight filtered through the gaps in the leaves and scattered across the grass, creating a dappled pattern of light spots.<br/><br/>Bang!<br/><br/>A man dressed in a green Dao Robe smashed against a massive tree trunk, causing the ancient tree to tremble mightily. He fell to the ground, spitting out a mouthful of fresh blood.<br/><br/>Not far away, Fang Wang retracted his leg, while Zhou Xue and Zhou Xing Shi standing behind him showed different expressions. Zhou Xue wore a satisfied and admiring smile, while Zhou Xing Shi was filled with fear.<br/><br/>Since the night three days ago when Fang Wang spoke with Zhou Xue, Zhou Xing Shi felt that Fang Wang carried a sharp aura of killing intent, a stark contrast to who he used to be.<br/><br/>For instance, now, Qi Cultivation Realm cultivators at the ninth level couldn’t withstand a single kick from him!<br/><br/>Zhou Xue walked forward and squatted in front of the severely injured Green Cicada Valley disciple, starting to interrogate him.<br/><br/>These past days, they had forced confessions from seven Green Cicada Valley disciples and learned that this group of disciples was searching for a Tai Yuan Sect Disciple, who based on descriptions, could very well be Fang Hanyu.<br/><br/>After a while, Zhou Xue broke the neck of the Green Cicada Valley disciple, plundering his storage pouch, and then gestured to Fang Wang and the others.<br/><br/>As Fang Wang passed by the corpse, he noticed the man’s eyes had been gouged out as well.<br/><br/>He suddenly wondered if Zhou Xue was aiming to cultivate the Absolute Heart Evil Eye?<br/><br/>Fang Wang didn’t feel too opposed to the idea; the disciples of Green Cicada Valley were notorious, not just for using poisons, but also for being ruthlessly brutal, often massacring ordinary people in the countryside. According to Zhou Xing Shi, the most cruel of all Demonic Sects were those from Green Cicada Valley; even other Demonic Sect followers despised them.<br/><br/>Leading the way, Zhou Xue wiped her hands as she said, “Fang Hanyu must be hiding somewhere in the Demon Forest Mountain Range up ahead. The Demonic Qi here is thick; there could be powerful demonic beings. Be cautious.”\t\t\t\t\t\t</div>", "images": {}, "success": true}