{"id": 27, "url": "https://www.novelhall.com/i-became-an-immortal-on-mortal-realm-32879/14234612.html", "title": "Chapter 27 - 27 Chapter 25 Rising Fame, White Garment Astonishing Swan_1", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 27 - 27 Chapter 25 Rising Fame, White Garment Astonishing Swan_1</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\t27 Chapter 25 Rising Fame, White Garment Astonishing Swan_1<br/><br/>Translator: 549690339<br/><br/>“`<br/><br/>The mountains undulated, the breeze swayed the forest, creating gentle green ripples.<br/><br/>By a mountain brook, Fang Hanyu leaned against a large rock, with Zhou Xue tending to his wounds, and Zhou Xing Shi stood nearby, vigilantly watching the surroundings.<br/><br/>“Two hours have passed, why hasn’t he caught up yet? Could something have happened?”<br/><br/>Zhou Xing Shi couldn’t help but look back and ask, as his life was linked to Fang Wang’s. His greatest fear was something happening to Fang Wang.<br/><br/>While dressing Fang Hanyu’s wounds, Zhou Xue calmly said, “Don’t worry, he’s not dead.”<br/><br/>“How can you be so sure?”<br/><br/>“I have my ways of being sure, just as I was certain this young man wasn’t dead before.”<br/><br/>Zhou Xing Shi was stunned by her answer. On reflection, Zhou Xue had been sure that Fang Hanyu was alive even before they found him.<br/><br/>Could it be that this woman had meddled with Fang Wang and Fang Hanyu somehow?<br/><br/>Although Fang Wang was stronger in Zhou Xing Shi’s eyes, he found Zhou Xue to be more dangerous and inscrutable.<br/><br/>After a while, Zhou Xue stood up, looked down at Fang Hanyu, and said, “Your body is ruined, but I can help you undergo Nirvana and be reborn, even stronger than before. However, the process will be excruciatingly painful. Are you willing to endure that?”<br/><br/>At her words, Fang Hanyu immediately looked up, clenched his teeth, and said, “I’m willing! I don’t want to be a cripple for the rest of my life! I’m not afraid of any amount of pain!”<br/><br/>“Hmm, once Fang Wang returns, I’ll take you to a place where you can be healed,” Zhou Xue said.<br/><br/>After she finished speaking, she walked over to the stream, crouched down, and began to wash her hands.<br/><br/>Zhou Xing Shi secretly wondered how Fang Hanyu, injured as he was, could be reborn through Nirvana.<br/><br/>His curiosity about Zhou Xue’s origins only grew. It was clear that even before joining Great Abyss Gate, Zhou Xue had a deep background in cultivation.<br/><br/>Afterward, the three of them waited by the brook for Fang Wang’s return.<br/><br/>About half an hour later, they finally heard the sound of something slicing through the air. Zhou Xue and Zhou Xing Shi immediately turned their heads to look. Soon after, both let out a sigh of relief and smiled.<br/><br/>The one who approached was Fang Wang.<br/><br/>Fang Wang arrived on a Flying Sword, carrying the Qingjun Sword with blood on its blade. Not only that, his white garment was now soaked in blood, and he was adorned with blood-stained pouches, all storage bags.<br/><br/>His appearance was extraordinarily grim, but Zhou Xue and Zhou Xing Shi were not worried, knowing that as long as he could still control his Flying Sword, he wouldn’t die.<br/><br/>As Fang Wang landed, the Flying Sword retreated into his storage bag. Zhou Xing Shi quickly came forward, asking with concern, “Are you alright?”<br/><br/>For some reason, Fang Wang felt awkward; shouldn’t Zhou Xue have been the first to show concern for him?<br/><br/>Why was it a man who came to care for him first?<br/><br/>“No problem, I’m not injured. But my Spiritual Power is nearly depleted,” Fang Wang replied.<br/><br/>Even the Great Perfection level of the Solaris Scripture was running low after more than two hours of intense fighting, especially since all his opponents were cultivators.<br/><br/>Zhou Xing Shi nodded and then stepped aside.<br/><br/>Zhou Xue came over to examine his body and asked with a smile, “How strong is Li Hongshuang? Fighting her should have broadened your horizons.”<br/><br/>Seeing Fang Wang return unharmed filled her with pride, for she had taught him cultivation techniques, and in her heart, she had already come to consider Fang Wang her disciple.<br/><br/>To survive an encounter with the top talent of Green Cicada Valley within less than a year of cultivation was indeed a mighty feat!<br/><br/>“Very strong, it definitely broadened my horizons,” Fang Wang nodded in agreement.<br/><br/>Zhou Xing Shi was silently astounded. As a member of a noble family, he knew more about Li Hongshuang. She was not their peer, and despite Li Hongshuang’s longer period of cultivation and monstrous talent, she was unable to defeat Fang Wang, which increased Zhou Xing Shi’s respect for him.<br/><br/>After examining him and making sure he wasn’t poisoned, Zhou Xue finally felt reassured.<br/><br/>“By the way, is there a way to preserve a head so it doesn’t rot? I’m planning to take it back to Great Abyss Gate to increase my contribution points,” Fang Wang suddenly asked, then took a cloth wrap from behind his back.<br/><br/>With a frown, Zhou Xue said, “At a life-or-death moment, you still care about these things? Aren’t you afraid Li Hongshuang will catch up to you?”<br/><br/>“Not afraid.”<br/><br/>“Apart from Li Hongshuang, there’s no one of note among the Green Cicada Valley disciples in the area. They’re all Li Hongshuang’s lackeys. It seems Green Cicada Valley is intentionally cultivating Li Hongshuang’s power. The lackeys’ heads are worthless—just throw them away.”<br/><br/>Zhou Xue dismissed the matter with a wave of her hand, realizing then that Fang Wang was only seventeen after all, and still somewhat naive.<br/><br/>“Coincidentally, it’s the head of Li Hongshuang,” Fang Wang said, raising an eyebrow and maintaining a calm expression, though he felt elated inside.<br/><br/>“What?”<br/><br/>Zhou Xue was stunned, and Zhou Xing Shi also turned his head to look at Fang Wang, eyes widening.<br/><br/>With a flick of Fang Wang’s right hand, Li Hongshuang’s head fell, landing perfectly with the neck on the ground, her eyes wide open in death, an unnerving sight.<br/><br/>“It really is Li Hongshuang… you…”<br/><br/>Once Zhou Xue clearly saw Li Hongshuang’s face, she looked up at Fang Wang, her eyes revealing her shock.<br/><br/>Zhou Xing Shi wore a face as if he’d seen a ghost.<br/><br/>How could Li Hongshuang, leading hundreds of Green Cicada Valley disciples, be beheaded by Fang Wang on his own?<br/><br/>“`<br/><br/>“`<br/><br/>How is that possible!<br/><br/>“`<br/><br/>Even after seeing Li Hongshuang’s true face, Zhou Xing Shi still found it incredible.<br/><br/>“`<br/><br/>“During your fight with him, what was his strength like? Did he use his Lifespirit Treasure, which is a big flag…” Zhou Xue furrowed her brows as she asked.<br/><br/>“`<br/><br/>Fang Wang rolled his eyes, replying exasperatedly, “Of course, did you think I killed some counterfeit? It wasn’t easy to kill him, I fought with nearly all my might.”<br/><br/>Zhou Xue took a deep breath and said nothing further. She squatted down, took a medicinal bottle from her storage bag, and sprinkled the powder over Li Hongshuang’s head.<br/><br/>Fang Wang turned his head towards Fang Hanyu, who was not far away, and asked, “Hanyu, I avenged you. I’ve killed at least three hundred members of the Green Cicada Valley along the way. How is that, brother, am I not loyal?”<br/><br/>Fang Hanyu didn’t know what to say. He had already realized how strong Li Hongshuang was, and now, hearing that such a powerful figure had been slain by Fang Wang, he felt that expressing gratitude seemed pretentious and giving praise seemed lackluster. All he could do was nod slightly.<br/><br/>Fang Wang looked at Zhou Xue, Zhou Xing Shi, and Fang Hanyu, who had all gone quiet, and couldn’t help but curl his lip.<br/><br/>The reaction isn’t big enough, is it?<br/><br/>Shouldn’t they be exclaiming, declaring how terrifying it was?<br/><br/>“Right, before I left, I burned Li Hongshuang’s corpse. He won’t come back to life, will he? After all, cultivators can possess bodies. I’m worried about techniques similar to reanimation.” Fang Wang saw Zhou Xue stand up and immediately asked.<br/><br/>While speaking, he squatted down to rewrap his spoils of war.<br/><br/>Zhou Xue responded, “As long as you have his head here, and if his body was truly burned clean, then he certainly cannot be reborn.”<br/><br/>Solaris True Fire of the Solaris Scripture…<br/><br/>Zhou Xue was filled with emotion. Being entangled in Solaris True Fire would surely leave nothing but ashes.<br/><br/>Who could have imagined that the future master of Green Cicada Valley would perish just like that…<br/><br/>She suddenly felt that Fang Wang’s existence was going to massively alter the future, and together with the fact that she had reincarnated, it was certain that the future would be shaped by them.<br/><br/>Afterward, Fang Wang bathed in the river. After changing into clean clothes, they continued on their way. Zhou Xue said she would take them to a place, a place where great opportunities lay, and they could also heal Fang Hanyu there.<br/><br/>On the subsequent journey, the atmosphere was rather peculiar.<br/><br/>Zhou Xue and Zhou Xing Shi frequently glanced at Fang Wang but didn’t speak, making him somewhat uncomfortable.<br/><br/>Little did he know that despite the apparent calmness of the two, a storm of shock and awe had not subsided in their hearts.<br/><br/>Zhou Xue inwardly marvelled at how her own rebirth had caused an extraordinary and previously unheralded individual to emerge in this life.<br/><br/>Zhou Xing Shi, meanwhile, was simply dumbfounded. They had attained the Spiritual Refinement on the same day; how could there be such a huge gap between them?<br/><br/>…<br/><br/>In an inn, Gu Li sat drinking tea with three fellow disciples, with every table on the first floor occupied.<br/><br/>“There are really a lot of people. The legacy of the Ji Hao Sect has spread far and wide, which is good. The more people there are, the easier it is for us to carry out our rescue mission,” Zhou Bo commented.<br/><br/>They were all disciples from the third lineage, formed into teams for this expedition.<br/><br/>Gu Li, who had been turned down by Fang Wang, still worried, so she followed the team led by Zhou Bo.<br/><br/>She wore a bamboo hat and a yellow shirt, appearing very much like a female warrior of the martial world, and with her head slightly bowed, no one could see her face.<br/><br/>Just then, a man in plain clothes hurried into the inn, shouting, “Disaster! Disaster! Li Hongshuang, the direct disciple of Green Cicada Valley and the most talented among their current disciples, has been killed by a disciple of the Great Abyss Gate!”<br/><br/>At these words, the entire inn erupted into noise.<br/><br/>The diners here were not ordinary people; they were all cultivators, mostly loose cultivators, or perhaps disciples of the Nine Great Sects in disguise.<br/><br/>“That Li Hongshuang was at the ninth layer of the Soul Sculpting Realm! Many direct disciples of the Great Abyss Gate might not be his match, and killing him is practically a declaration of war against Green Cicada Valley!”<br/><br/>“Li Hongshuang is dead; this is a big deal.”<br/><br/>“Tsk tsk, Li Hongshuang doesn’t only have the backing of Green Cicada Valley, there’s also the Li Family. A thousand years ago, it was their Li Family who established the dynasty on this land.”<br/><br/>“Hmph, dead is dead, just a Demonic Cultivator.”<br/><br/>The loose cultivators in the inn buzzed with discussion, and then someone asked the man who had brought the news, “Hey lad, who exactly killed Li Hongshuang, do you have more information?”<br/><br/>It turned out the man who reported the news was the inn’s server. He stood with hands on hips, hee-hee laughing, “I do have more. It’s said that the disciple of the Tai Yuan Sect who killed Li Hongshuang used the Jinghong Divine Sword Art. Do you know the origins of the Jinghong Divine Sword Art?”<br/><br/>Upon hearing this, someone stood up and said, “I know. It’s the ultimate technique of Yang Yuanzi, the Peak Master of the third lineage of the Tai Yuan Sect. A hundred years ago, he forced his way into Green Cicada Valley with this sword technique and emerged unscathed. Could it be that Yang Yuanzi himself took action? The Jinghong Divine Sword Art is uniquely mastered by Yang Yuanzi, and I haven’t heard of any Tai Yuan Sect disciples who have mastered this sword art.”<br/><br/>“Half right, half wrong. The person who killed Li Hongshuang indeed used the Jinghong Divine Sword Art, but he was very young, definitely not Yang Yuanzi. According to the surviving disciples of Green Cicada Valley, that man wore white and executed the sword art to the thirty-second move, definitely a yet unrecognized genius of the Tai Yuan Sect. Now, those disciples of Green Cicada Valley call him the White Garment Astonishing Swan, and the valley has dispatched Spirit Elixir Realm Great Cultivators to search for the whereabouts of this White Garment Astonishing Swan,” the server said, shaking his head, his words causing the cultivators in the inn to discuss heatedly again.<br/><br/>Zhou Bo turned back, whispering, “White Garment Astonishing Swan? Who in the third lineage got this legacy?”<br/><br/>He had belonged to the third lineage for over ten years and had never heard of anyone receiving the true inheritance of Yang Yuanzi, not even the big disciple Li Yu.<br/><br/>The two third-lineage disciples shook their heads, and although Gu Li remained silent, for some reason, she couldn’t help but think of a certain person.<br/><br/>Could it be him?<br/><br/>No way…<br/><br/>He has only been refining spirits for how long?\t\t\t\t\t\t</div>", "images": {}, "success": true}