{"id": 25, "url": "https://www.novelhall.com/i-became-an-immortal-on-mortal-realm-32879/14234606.html", "title": "Chapter 25 - 25 Chapter 23: The Next Green Cicada Valley Master_1", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 25 - 25 Chapter 23: The Next Green Cicada Valley Master_1</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\t25 Chapter 23: The Next Green Cicada Valley Master_1<br/><br/>Translator: 549690339<br/><br/>Fang Wang and his two companions groped their way forward, occasionally encountering disciples from Green Cicada Valley. They were even ambushed at times, but these disciples were merely in the Qi Cultivation Realm and posed no threat to them.<br/><br/>Three more days passed, and besides Green Cicada Valley disciples, they began to encounter disciples from Huangyu Mountain. However, these disciples from Huangyu Mountain were more cautious—upon seeing the three of them, they all chose to avoid them.<br/><br/>In addition, they encountered many loose cultivators, all searching around in the forests, clearly aiming for the inheritance of Ji Hao Sect.<br/><br/>It was noon on this day.<br/><br/>Fang Wang and the others arrived at a cliff from which they could overlook the endless forests ahead. They saw many cultivators and even some engaging in combat in the air.<br/><br/>What a lively scene!<br/><br/>This was the first time Fang Wang had seen so many cultivators and loose cultivators gather together, and that too in the deep mountains far from human habitation.<br/><br/>The cultivators were not just flying with swords; there were all kinds of odd and ancient flying magical artifacts. Some even had spirit demons and mystic creatures as mounts. Fang Wang watched with envy and secretly decided to obtain a dominant and impressive mount for himself someday.<br/><br/>“It seems either Fang Hanyu or other disciples have had their whereabouts exposed, which has brought so many people here,” Zhou Xue pondered aloud.<br/><br/>Zhou Xing Shi frowned and said, “If they’ve been exposed and not captured, could it be that some powerful force is protecting them?”<br/><br/>Zhou Xue shook her head, also unsure.<br/><br/>“Ahead of us, there are not only those in the Qi Cultivation Realm, I’ve already sensed many cultivators stronger than me. Do we really plan to rescue him?” Zhou Xing Shi continued to ask.<br/><br/>Zhou Xue did not respond and stared ahead, lost in thought.<br/><br/>Fang Wang, however, did not feel too much pressure; he was keen to show off his skills.<br/><br/>As long as no cultivator beyond the Soul Sculpting Realm appeared, he was not afraid of the number of enemies at his realm. Even if he could not defeat them, he could run.<br/><br/>The White Rainbow Evasion Technique at Great Perfection gave him the confidence to break out of the encirclement and shake off any pursuers!<br/><br/>Just then, a strong wind blew from the east, prompting Fang Wang and the others to turn their heads. They saw a colossal beetle, as large as a small hill, flying toward them. Its wings flapped rapidly, causing gusts of wind that shook the trees along its path, creating a spectacular wave of forests.<br/><br/>This beetle was pitch-black, had eight legs, and boasted a pair of scorpion-like pointed horns at its head, looking like a demonic insect from a hellish realm, terrifyingly grim. Behind its horns stood a red palanquin, shrouded in mystery.<br/><br/>“It’s him…”<br/><br/>Zhou Xue narrowed her eyes, muttering to herself.<br/><br/>Upon hearing this, Fang Wang asked, “Who is he?”<br/><br/>“Li Hongshuang, the number one talent of Green Cicada Valley. He is an Earth Origin Spirit Treasure, but this news hasn’t spread yet,” Zhou Xue quietly explained.<br/><br/>Zhou Xing Shi frowned and remarked, “I’ve heard of Li Hongshuang. The Li Family is a millennium-old household, and he was the pride of the family from a young age. However, his decision to join Green Cicada Valley enraged the Li Family. Although they officially expelled him from the family records, there are still rumors that it was all the Li Family’s arrangement.”<br/><br/>Fang Wang sent a mental message to Zhou Xue, asking, “What realm is Li Hongshuang in now?”<br/><br/>“He should be at the eighth or ninth layer of the Soul Sculpting Realm. It will take several more years for him to reach the Spirit Elixir Realm. Once he does, his Gu insect will evolve, making it easy to identify him. Two hundred years from now, he will become the number one person in Green Cicada Valley. Another fifty years, and he will become the Green Cicada Valley Master, a giant at the forefront of the Da Qi Demonic Path. It’s troublesome meeting a man like him,” she communicated back solemnly.<br/><br/>That impressive?<br/><br/>Fang Wang raised an eyebrow, but he was not intimidated. No matter how formidable, it was a matter for the future. In this life, if he survived and had the help of the Heavenly Palace, everything in the future would change because of him!<br/><br/>The massive Gu insect of Li Hongshuang drew the attention of many cultivators, prompting the Green Cicada Valley disciples to immediately fly towards him like a rain of arrows from every direction, creating a magnificent scene.<br/><br/>With this formation, there were at least three to four hundred disciples from Green Cicada Valley alone, not to mention other cultivators. If their target was all Fang Hanyu, that would be troublesome.<br/><br/>Boom!<br/><br/>A huge rumble came from the horizon, accompanied by the trembling of the mountains. Li Hongshuang’s Gu insect immediately flew toward that direction.<br/><br/>Zhou Xing Shi looked at Fang Wang, silently praying that Fang Wang would not make a foolish move.<br/><br/>“Let’s go and have a look. If it’s not Fang Hanyu, then we’ll leave. I’ve already mastered the White Rainbow Evasion Technique you taught me,” Fang Wang said quietly.<br/><br/>Zhou Xue looked at him in surprise. The White Rainbow Evasion Technique was no simple flight technique, and it certainly wasn’t something that the Qi Cultivation Realm’s natural workings or the Sword Control Technique could compare to. Had this lad already mastered it?<br/><br/>She knew that Fang Wang’s mention of “mastered” was not just about being able to use it, but achieving Great Completion!<br/><br/>“Then let’s go take a look. There are so many loose cultivators anyway!” Zhou Xue decided, and the two immediately flew off on their swords.<br/><br/>Zhou Xing Shi clenched his teeth and had no choice but to stiffly follow them.<br/><br/>These two are madmen!<br/><br/>…<br/><br/>In the forest, a black panther was fleeing quickly with a person on its back—Fang Hanyu. He clung tightly to the panther’s neck, his eyes still wrapped with cloth. The vigorous running motion caused his eyesockets to bleed.<br/><br/>On the branches nearby, a figure in green hopped rapidly from tree to tree, matching the panther’s speed. It was the same green-cloaked girl who saved Fang Hanyu. She wore a fox mask, moving like a specter.<br/><br/>“Leave me behind, so as not to implicate you…” Fang Hanyu gritted his teeth and spoke, having realized that he was being protected by the green-cloaked girl and her clan members, despite not being able to see.<br/><br/>“You think I don’t want to? But ever since those people came to our clan lands, they started killing mercilessly. Many of my friends were skinned and dismembered. It’s not just you I have saved; my sister saved another Tai Yuan Sect Disciple before, and then surrendered him. As a result, my sister was executed on the spot… Damn them! One day, I must destroy Green Cicada Valley, Huangyu Mountain!”<br/><br/>“Since we are bound to die, you might as well live to seek help from Tai Yuan Sect, a righteous sect that should not swallow this insult!” The green-cloaked girl replied quickly, and her words plunged Fang Hanyu’s heart into the abyss.<br/><br/>He wondered how many of his adventuring fellow brothers and sisters had survived. If they fell into the hands of the Demonic Path, even living was worse than death.<br/><br/>Fang Hanyu harbored deep hatred but had to suppress it. At the moment, he had neither the strength to fight nor even to stand.<br/><br/>“`<br/><br/>Boom!<br/><br/>A deafening roar came from ahead, followed by a fierce wind that caught Fang Hanyu off guard. He was swept away and crashed into a tree trunk with a thud, nearly losing consciousness from the intense pain in his waist.<br/><br/>The girl in green landed and slid backward uncontrollably. She looked up to see a ravine that had appeared in the forest ahead, with trees toppled to either side and dust filling the air.<br/><br/>A black giant insect with a ferocious appearance hovered in the air, a red sedan chair on its back, its curtains fluttering like blazing flames.<br/><br/>Behind the giant insect, a large group of Green Cicada Valley disciples were rushing over.<br/><br/>A middle-aged man landed in front of the red sedan and said, “Brother, there’s a severely injured cultivator up ahead, his eyes have been gouged out. He is likely the Tai Yuan Sect disciple who escaped from us.”<br/><br/>A lazy voice came from inside the red sedan, “Bring him here for questioning.”<br/><br/>“There’s also a spirit demon nearby…”<br/><br/>“Kill it.”<br/><br/>“Understood!”<br/><br/>The middle-aged man immediately turned and gestured to the Green Cicada Valley disciples behind him. Instantly, twelve disciples flew towards the girl in green and Fang Hanyu on their swords.<br/><br/>The black panther that had been carrying Fang Hanyu was trapped under a tree that had been cut off at the waist, whining and unable to move.<br/><br/>The girl in green tried to carry Fang Hanyu on her back when the sound of air being sliced through was heard. A long sword blocked her path, startling her into jumping backward.<br/><br/>Seeing this, the girl in green could only flee in another direction, disappearing into the depths of the forest within a few steps.<br/><br/>The man standing atop the giant insect once again gestured, and nine Green Cicada Valley disciples immediately gave chase to the girl in green.<br/><br/>Fang Hanyu lay in front of the tree, his body aching as if it were about to fall apart. The cloth in front of his eyes was soaked red with blood, even dripping, presenting a truly pitiful sight.<br/><br/>He heard footsteps, understanding that his enemies were approaching him.<br/><br/>“I remember this guy; he took the opportunity to throw himself off the cliff when we were unprepared. When we tried to find him again, he was nowhere to be seen.”<br/><br/>“Oh? Is he the Tai Yuan Sect disciple who escaped from your grasp?”<br/><br/>“Yes, he’s got some guts, arms and legs broken, eyes gouged out live, and still, he did not beg for mercy, showing much more backbone than his brothers and sisters.”<br/><br/>“Tsk tsk, look at him, he’s like an insect about to be squashed.”<br/><br/>As he listened to the laughter of the Green Cicada Valley disciples, Fang Hanyu’s fingers dug into the soil, hatred filling his heart.<br/><br/>Just then, a white rainbow streaked out from the forest at high speed.<br/><br/>Whoosh! Whoosh! Whoosh…<br/><br/>A series of piercing sounds erupted, one after another. Fang Hanyu faintly sensed the fierce sword qi; as a swordsman himself, he was highly sensitive to it.<br/><br/>Before he could think further, he heard the sound of bodies hitting the ground, and the taunting of the Green Cicada Valley disciples abruptly stopped.<br/><br/>What’s going on?<br/><br/>Fang Hanyu was extremely nervous, his body trembling instinctively.<br/><br/>In front of him stood a figure, tall and direct in the sunlight, clad in white, surrounded by corpses.<br/><br/>It was Fang Wang!<br/><br/>Fang Wang’s back was to Fang Hanyu as he held the Superior Grade Spiritual Weapon, the Qingjun Sword, with a cold look in his eyes beneath the bamboo hat, staring at the giant insect hovering over the forest.<br/><br/>“Who are you?”<br/><br/>The middle-aged man beside the red sedan atop the insect asked harshly, his eyes full of fear.<br/><br/>Fang Wang was too fast!<br/><br/>He didn’t even see how Fang Wang made his move, and all twelve disciples were dead!<br/><br/>Upon hearing this, Fang Hanyu realized that someone was there to rescue him. He gritted his teeth and said, “Whoever you are, don’t save me. I’m already a cripple. Instead of being a burden to me, just run away!”<br/><br/>He thought it might be the girl in green or someone from her clan. He did not want to involve innocent people any longer.<br/><br/>“A burden? This is already the second time I’m saving you. If you’re crippled, find a way to recover. I’ll be waiting for you to repay the favor of saving your life!”<br/><br/>A familiar voice came from ahead, causing Fang Hanyu to suddenly look up.<br/><br/>“Fang… Wang?”<br/><br/>Fang Hanyu’s tone was full of disbelief; he couldn’t believe that Fang Wang would appear at this moment.<br/><br/>“Tsk tsk, you’re seriously injured, even your eyes have been gouged out.”<br/><br/>A mocking laugh sounded; upon hearing it, Fang Hanyu didn’t get angry. His body trembled violently, and for the first time, he felt aggrieved because his family had come.<br/><br/>Zhou Xue had also arrived!<br/><br/>He felt no grievance being tortured by the disciples of Green Cicada Valley, nor fear when being treated by the girl in green, but facing the arrival of his two relatives, he could no longer control his emotions.<br/><br/>Zhou Xue and Zhou Xing Shi emerged from the forest nearby. Seeing the extent of Fang Hanyu’s injuries, Zhou Xing Shi was deeply chilled.<br/><br/>“Li Hongshuang, some believe you could be the next Green Cicada Valley Master, but my sword does not agree!”<br/><br/>Fang Wang called out loudly, his words causing Zhou Xue and Zhou Xing Shi to look at him in surprise.<br/><br/>Having said this, Fang Wang communicated with Zhou Xue, telling her to take Fang Hanyu and leave quickly.<br/><br/>Zhou Xue indeed was the reincarnation of the Immortal Venerable, but Fang Wang did not believe that she was necessarily stronger than himself. Moreover, he was not skilled in medicine, so entrusting the task of carrying Fang Hanyu to Zhou Xue was a better option.<br/><br/>“`\t\t\t\t\t\t</div>", "images": {}, "success": true}