{"id": 39, "url": "https://www.novelhall.com/i-became-an-immortal-on-mortal-realm-32879/14236711.html", "title": "Chapter 39 - Chapter 39: Chapter 37 Spirit Elixir Realm_1", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 39 - Chapter 39: Chapter 37 Spirit Elixir Realm_1</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 39: Chapter 37 Spirit Elixir Realm_1<br/><br/>Translator: 549690339<br/><br/>Facing Zhao Zhen’s beaming smile, Fang Wang also smiled in response and said, “If Da Qi can become a Cultivation Dynasty, then there would be more cultivator families, and we would have to thank you for your efforts.”<br/><br/>Zhao Zhen nodded with a smile, and then Li Yu began introducing others to him.<br/><br/>Throughout the process, Zhao Zhen did not exhibit any royal arrogance, and the other disciples were quite interested in this Emperor.<br/><br/>On this land, dynasties rise and fall, and whenever a dynasty changes its name, the prefix of the Cultivation World would also change accordingly. Although they practiced cultivation, they could not completely break away from mortals.<br/><br/>The Qi Dynasty was essentially the foundation of the Da Qi Cultivation Realm. Cultivation emphasizes the need for resources, and mortals are the tools for cultivators to extract these resources. Furthermore, cultivators also emerge from among the mortals.<br/><br/>Amongst the disciples, many were mortals who had received an opportunity and thus set foot on the path of cultivation. Before cultivating, the imperial authority had been lofty and untouchable to them, akin to the vast heavens.<br/><br/>Now, seeing the Emperor as their fellow sect member and peer, the mentality of most disciples could not help but get a little scattered.<br/><br/>As more and more disciples arrived, the area in front of Qingxin Hall became lively and boisterous.<br/><br/>Over ten thousand Third Vein disciples gathered, with seventy percent of them being Outer Sect Disciples. Under the arrangement of Direct Disciples, they stood on the hillside below, waiting for Yang Yuanzi to speak.<br/><br/>The Third Vein was like this, and the same went for other veins. All disciples gathered together, and Fang Wang could hear cheering from the neighboring peaks from time to time, making him wonder what could make them so happy.<br/><br/>After a while.<br/><br/>The grand doors of Qingxin Hall opened, and Yang Yuanzi walked out slowly.<br/><br/>“We pay respects to Master!”<br/><br/>Li Yu’s voice suddenly rang out, covering everyone else’s, and upon these words, all disciples turned around, saw Yang Yuanzi, and promptly bent over to pay their respects.<br/><br/>“We pay respects to Master!”<br/><br/>“We pay respects to Peak Master!”<br/><br/>The voices of tens of thousands resonated together, shaking the heavens.<br/><br/>Yang Yuanzi’s gaze swept over the Direct Disciples and the Sword-bearing Disciples in the front row and then moved to the various levels of disciples at the back. The overwhelming majority of disciples were excited to see him and tried hard to contain their emotions.<br/><br/>“Today, I have summoned you all for a matter. A month from today, our gate will hold the Nine Veins Combat Method. The reason for arranging this ahead of time is that the Nine Great Sects have already negotiated peace. The<br/><br/>Righteous and Demonic paths will work together to drive the transition of Da<br/><br/>Qi into a Cultivation Dynasty.”<br/><br/>Yang Yuanzi began to speak, his tone calm, yet these words made the disciples look towards Zhao Zhen involuntarily.<br/><br/>Zhao Zhen remained expressionless, as if all of this had nothing to do with him, the Emperor of Da Qi.<br/><br/>“The Nine Veins Combat Method consists of two stages. The first is the competition among disciples of each vein, chosen by the Peak Master to compete against those from the other eight veins. The second stage is a one-on-one battle between the Nine Channels’ disciples, contending for the ranking of their respective peaks based on their number of victories. The strongest nine disciples will represent the Great Abyss Gate in the grand opportunity organized jointly by the Nine Great Sects.”<br/><br/>Yang Yuanzi briefly introduced, not elaborating on the grand opportunity.<br/><br/>He paused for a moment, then continued, “In the next three days, Li Yu, you will personally select the combatants. Fang Wang does not need to participate in the assessment and will represent the Third Vein in battle. Alright, your eldest senior brother, Li Yu, will take over the organization. Fang Wang, follow your master into the hall.”<br/><br/>Having said that, Yang Yuanzi turned and entered the hall, ignoring the murmur of the disciples.<br/><br/>Fang Wang immediately followed, aware of the many eyes on his back, but he was not intimidated. In fact, he was glad, as having to be tested for three days would have been such a waste of time.<br/><br/>Those disciples who didn’t know Fang Wang asked those around them, and it quickly became known that Fang Wang was an unparalleled genius who became a Direct Disciple as soon as he entered. Any confusion and indignation in their hearts instantly dissipated.<br/><br/>Zhao Zhen watched Fang Wang’s retreating figure with a smile still on his face, but his hands in his sleeves were clenched tightly.<br/><br/>Once inside the hall, the door closed behind them.<br/><br/>Fang Wang approached Yang Yuanzi, who had already taken his seat and was staring blankly at him.<br/><br/>“Master, could it be that your disciple has done something wrong?” Fang Wang asked, feigning confusion, remembering what Guang Qiuxian had said about Yang Yuanzi being petty.<br/><br/>Yang Yuanzi snorted, “You certainly have nerve, do you still regard me as your master? Do you remember what I’ve said to you?”<br/><br/>“Of course, I dare not forget for a single moment!”<br/><br/>Fang Wang had long since forgotten, after all, it had been over two hundred years.<br/><br/>“I told you to cultivate diligently and stay out of trouble. What did you do? You went to fight at the Soul Sculpting Realm as soon as you reached it, even battling those at the third layer of the Spirit Elixir Realm!”<br/><br/>Yang Yuanzi scolded angrily, with a tone of disappointment as if hating that iron could not turn into steel. Fang Wang hurriedly apologized, promising earnestly.<br/><br/>After scolding for a while, Yang Yuanzi revealed a satisfied smile and said, “However, your achievements haven’t brought shame upon your master, quite the opposite—they’re quite impressive!”<br/><br/>Fang Wang immediately started to flatter, “It’s all thanks to Master’s excellent teaching.”<br/><br/>“Don’t say that, I haven’t really taught you anything, you’ve already surpassed me.”<br/><br/>“The disciple just happened to have a bit of luck and understanding, I’ll still need Master’s guidance and transmission of skills in the future.”<br/><br/>These words made Yang Yuanzi even more pleased. In fact, he did feel a bit of discomfort in his heart, mainly because Fang Wang had showcased the astonishing Thirty-Six Swords of the Flying Phoenix, while he had only mastered twenty-seven. However, Fang Wang’s attitude was very humble, not at all arrogant, and even made him feel somewhat ashamed.<br/><br/>As his disciple encountered difficulties, he was feeling jealous, which was unworthy of a teacher.<br/><br/>“Fang Wang, you have peerless talent, and it’s true that there’s not much I can teach you. But we have the bond of master and disciple, and whatever you wish to do in the future, I will support you with all my might. I’ve even requested the<br/><br/>Sect Leader to allow you to practice the Nine Heavens Azure Thunder Sword Formation, but the Sect Leader cannot easily agree as it goes against the rules. In the future, you must strive to contribute to the sect. If there’s anything you need to speak up for, just tell me,” Yang Yuanzi said deeply, his gaze filled with expectancy as he looked at Fang Wang.<br/><br/>Fang Wang quickly said, “Thank you, Master. The disciple is preparing to break through to the Spirit Elixir Realm; could Master provide some guidance?”<br/><br/>The Solaris Scripture had mentioned the Spirit Elixir Realm. This realm required external forces for enhancement, and the better the Spirit Pill that was shaped, the more it would benefit one’s future cultivation and reduce the likelihood of Heart Demons appearing, so breaking through to the Spirit Elixir Realm couldn’t simply rely on Qi Gathering.<br/><br/>Yang Yuanzi had a strange expression on his face and asked, “Have you already reached the ninth layer of the Spiritual Refinement Realm?”<br/><br/>Fang Wang habitually concealed his aura, preventing Yang Yuanzi from seeing through his cultivation level.<br/><br/>Facing his master’s inquiry, Fang Wang slowly nodded, causing the corners of Yang Yuanzi’s mouth to twitch.<br/><br/>He had made an exception for Fang Wang to join the Nine Veins Combat Method because of Fang Wang’s battle achievements. He hadn’t expected Fang Wang’s cultivation to have already reached the ninth layer of the Spiritual Refinement Realm. That meant Fang Wang’s strength..<br/><br/>This kid had only been initiated for three years!<br/><br/>Yang Yuanzi had lived for over three hundred years, but at this moment, he couldn’t help feeling inferior.<br/><br/>Guang Qiuxian was right, compared to Fang Wang, he really was too mediocre.<br/><br/>Yang Yuanzi took a deep breath and slowly began to speak, “The Spirit Elixir Realm can be cultivated directly, but if one could obtain Heavenly Materials and Earthly Treasures to temper one’s bones and condense one’s Spirit Pill, it would assist in understanding the Dao in the future. I’ll tell you in advance, we found a blessed land containing countless Heavenly Materials and Earthly Treasures at the border of the Qi Dynasty when the Cultivation Sects were fighting over the heritage of the Ji Hao Sect. Because we detected the presence of other Cultivation Dynasty Sects, we had no choice but to negotiate a joint occupation of this blessed land.”<br/><br/>“As long as you stand out in the Nine Veins Combat Method, you’ll be able to go to that blessed land with us. Once inside the blessed land, whatever you obtain will be yours. Of course, if you’re unable to secure one of the nine spots, your master will also help you collect them.”<br/><br/>With the conversation reaching this point, it was natural for Fang Wang to express his stance. He immediately spoke up, “Master, rest assured, your disciple will definitely try his best to strive for it, to bring honor to Master and the Third Channel!”<br/><br/>Yang Yuanzi showed a gratified smile and said, “Even disciples in the Spirit Elixir Realm might not be able to stand out, but for you, your master still holds great expectations. If you can help the Third Channel achieve a good ranking, all the disciples of the channel will be grateful to you, which will aid in your future bid for the position of the chief disciple.”<br/><br/>The strongest talent is meaningless if not utilized!<br/><br/>The Third Channel was currently the second-to-last in ranking, and although Yang Yuanzi seemed indifferent, he was actually holding a grudge inside.<br/><br/>The master and disciple talked this way for a full half an hour before Yang Yuanzi finally allowed Fang Wang to leave.<br/><br/>Stepping out of Qingxin Hall, Fang Wang saw that Li Yu and the other Direct<br/><br/>Disciples were already organizing the competition trials. Almost all of the Outer Sect Disciples and Inner Sect Disciples were spectating, knowing they had no qualification to participate, but watching the combat between high-level cultivators was uplifting, at least broadening their horizons.<br/><br/>Fang Wang slipped away quietly. When he arrived in front of his cave abode, he suddenly noticed a figure waiting at the entrance.<br/><br/>Zhou Xue!<br/><br/>She was dressed in the robes of a Taiyuan Gate Direct Disciple, leaning against the entrance with a flute in her hands. Seeing Fang Wang return, she showed a smile on her face.<br/><br/>“You’re finally back!”<br/><br/>Fang Wang quickly approached Zhou Xue, saying happily..\t\t\t\t\t\t</div>", "images": {}, "success": true}