{"id": 38, "url": "https://www.novelhall.com/i-became-an-immortal-on-mortal-realm-32879/14236109.html", "title": "Chapter 38 - Chapter 38: Chapter 36 Jin Xiao Sect, Nine Veins Combat Method 1", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 38 - Chapter 38: Chapter 36 Jin Xiao Sect, Nine Veins Combat Method 1</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 38: Chapter 36 Jin Xiao Sect, Nine Veins Combat Method 1<br/><br/>Translator: 549690339<br/><br/>Ultimately, whether it was the Emperor of Da Qi who chose to sacrifice the<br/><br/>Fang Residence, or whether it was Lu Yuanjun who chose to slaughter the Fang Family, or perhaps it was simply their subordinates who targeted the Fang Residence, none of these mattered.<br/><br/>The dire peril of the Fang Residence’s annihilation could not be disentangled from them.<br/><br/>Now that the Fang Residence was still standing, Fang Wang felt no rush to seek revenge. What he needed to do was to cultivate diligently; once he was strong enough, no one would be able to shelter his enemies.<br/><br/>After chatting for a while, the young disciples of the Fang Residence began to discuss affairs of the Cultivation World. The turmoil stirred by the Ji Hao Sect had subsided. Neither the Heavenly Gang Sheng Ti Zhen Gong nor the Nine Dragons Divine Transformation Art had fallen into anyone’s hands, at least not publicly, and all participating sects had suffered casualties.<br/><br/>“Recently, a mysterious sect known as the Jin Xiao Sect has emerged in the Cultivation World,” said Fang MO, his face full of admiration. “It is said that they entered the scene forcibly when the Great Abyss Gate, Taiqing Gate, Green Cicada Valley, and Ancient Demon Mountain were competing for a magical artifact. A Jin Xiao Sect powerhouse, alone, withstood the elders of the four sects, seized the magical artifact, and left with it. Tsk, tsk, now the rumors say that the Da Qi Cultivation Realm will no longer consist of the Nine Great Sects but instead, ten major sects.”<br/><br/>Fang MO clicked his tongue in wonder, his face filled with longing.<br/><br/>All of them were young men and women full of vigor. Who wouldn’t want to make a name for themselves, to become a person of influence worshiped by the masses?<br/><br/>Fang Wang also listened with great interest.<br/><br/>Two hours later, as the clan members were preparing to leave, Fang Wang gave them all the Spirit Stones and Spiritual Energy pills he had claimed, leaving them deeply moved.<br/><br/>After leaving the mountainside retreat, Fang Wang watched them as they left by sword flight.<br/><br/>Although only half of them had mastered the technique of sword flight, they were enough to lead the other half down the mountain.<br/><br/>The last time they parted, they had to walk down the mountain.<br/><br/>Fang Wang felt even more deeply than the young disciples, because for him, it had been far more than a year since they had seen each other.<br/><br/>Boom—<br/><br/>The door to the adjacent retreat opened. Fang Wang glanced over to see Gu Li coming out of her retreat; however, she was dressed as if she were going somewhere else, not coming to see Fang Wang.<br/><br/>“You’ve finally come back.”<br/><br/>With a sword case on her back, Gu Li walked up to Fang Wang and smiled. She sized him up, her eyes brimming with admiration.<br/><br/>Fang Wang asked with a smile, “Miss Gu, are you heading out on a long journey?”<br/><br/>Gu Li nodded and said, “There’s a matter with my family. They’ve called me back.”<br/><br/>Suddenly, Fang Wang remembered something Zhou Xue had mentioned when he first joined their ranks: in twenty years, the Gu Family would cease to exist…<br/><br/>If it had been the him from before, he certainly wouldn’t have cared, but now, after having been acquainted for so long, and with Gu Li having gone out of her way to look for him, he clearly understood this kindness. The thought that Gu Li might die alongside her family caused his heart to sink.<br/><br/>But thankfully, it was twenty years later. Once Zhou Xue returned, he could inquire more carefully.<br/><br/>After exchanging pleasantries for a while, Gu Li left on her flying sword, quickly disappearing into the thick fog surrounding the Great Abyss Gate.<br/><br/>Fang Wang stood in place, gazing into the horizon, lost in thought.<br/><br/>If Zhou Xue had not been reborn, he might have already died and would not have met Gu Li. Similarly, Gu Li might have perished with her family. Their fates were originally two lines that never intersected, but now they had become entwined, which meant that fate could change.<br/><br/>However, even Zhou Xue, as powerful as to have ascended to an Immortal Venerable, had met a demise that wiped both his body and path, forcing him to cultivate anew. Could cultivation truly bring about carefree immortality?<br/><br/>Could eternal life truly be attained?<br/><br/>After a long time.<br/><br/>Fang Wang withdrew his gaze and turned back to his own retreat.<br/><br/>The path of Immortality was something he had to explore and understand the true meaning of for himself.<br/><br/>Seasons changed from spring to autumn, and in the blink of an eye, two years had passed.<br/><br/>The Great Abyss Gate was once again greeted with heavy snow. Snowflakes filled the sky, and disciples came and went through the snow and fog, appearing small and weak amidst the vast, raging blizzard.<br/><br/>Inside the retreat.<br/><br/>Fang Wang was practicing his cultivation. Two years had passed, and he had reached the eighth layer of the Soul Sculpting Realm; he was now attempting to break through to the ninth layer.<br/><br/>The Solaris True Fire circled his body, and the Heavenly Palace Halberd was faintly visible above his head.<br/><br/>Suddenly.<br/><br/>He abruptly opened his eyes, flames shooting from them, and a powerful wave of energy burst forth, shaking everything within the retreat.<br/><br/>Gu Li, who lived in the cave dwelling next door, seemed to sense something and opened her eyes to look.<br/><br/>“He broke through again?”<br/><br/>Gu Li was secretly shocked. She had returned last year, but in the year since, she had not seen Fang Wang. Seeing that Fang Wang was in seclusion, she began to cultivate in seclusion herself, not wanting to be left too far behind.<br/><br/>She marveled at Fang Wang’s talents, but then thought of her father’s words and her expression darkened.<br/><br/>On the other side.<br/><br/>Fang Wang had successfully broken through and stepped into the ninth level of the Soul Sculpting Realm. He began to run his exercises to regulate his breath.<br/><br/>A full seven days passed before his breath completely stabilized. Now, his Spiritual Power was about ten times what it had been when he faced Li Honggang, which greatly boosted his confidence.<br/><br/>Exhilarating!<br/><br/>Fang Wang did not get up to rest but continued to cultivate.<br/><br/>Upon reaching the ninth level of the Soul Sculpting Realm, he vaguely felt a change in the Treasured Spirit Space within his body. What exactly it was, he did not know, so he wanted to research it.<br/><br/>When he first stepped into the Soul Sculpting Realm, he suspected that he could condense a second Lifespirit Treasure but could not be sure.<br/><br/>Half a month later.<br/><br/>The bell of the third vein suddenly sounded. Not just the third vein, bells from the other peaks also rang out, waking all the disciples who were cultivating.<br/><br/>Fang Wang took out his disciple token. Yang Yuanzi’s voice came from it:<br/><br/>“All disciples, including direct disciples, immediately assemble in front of Qingxin Hall!”<br/><br/>Fang Wang immediately placed the disciple token into his storage bag, then got up, straightened his robe, and walked out of his cave dwelling with the Qingjun Sword in hand.<br/><br/>Upon exiting his cave dwelling, he saw Gu Li.<br/><br/>Gu Li nodded slightly at him and then soared into the sky on her sword.<br/><br/>Seeing her leave without saying a word made Fang Wang feel somewhat unaccustomed. He then saw Gu Li stop in midair, turn her head to look at him, and asked, “Fang Senior Brother, why aren’t you leaving?<br/><br/>Fang Wang shook his head with a smile and followed her on his flying sword.<br/><br/>The two of them flew side by side, heading to the peak of the mountain. Figures were flying out of the third vein, all heading toward the peak in a spectacular scene.<br/><br/>Their speed was very fast and they did not interact along the way. They quickly arrived in front of Qingxin Hall. As soon as they landed, a group of disciples surrounded them, led by the eldest disciple, Li Yu.<br/><br/>Fang Wang and Gu Li were teased by the other disciples. Gu Li did not retort, making it awkward for Fang Wang to clarify and potentially diminish her<br/><br/>dignity.<br/><br/>“Elder Senior Brother, what’s the matter that it’s causing such a commotion?” Fang Wang found an opportunity to ask.<br/><br/>Li Yu said, “It must be the Nine Veins Combat Method. It was originally scheduled for three years from now, but because the Qi Dynasty will soon transform into the Cultivation Dynasty, it’s been brought forward. It’s said that after the end of the Nine Veins Combat Method, there will be a great opportunity.”<br/><br/>This statement intrigued all the disciples.<br/><br/>A great opportunity?<br/><br/>Fang Wang was very interested in the Nine Veins Combat Method. As recorded in the cultivation handbook, every ten years, the Nine Channels’ disciples would compete, vying for the ranking of their veins. The higher the rank, the more cultivation resources obtained, and many of the senior disciples had been the strongest in a session of the Nine Veins Combat Method.<br/><br/>As one of the Nine Great Sects, Great Abyss Gate was watched by various sects and noble families. Whoever came to the fore in the Nine Veins Combat Method would rise to fame in the Cultivation World. Lu Yuanjun had also made a name for himself in this way. After becoming famous, Great Abyss Gate then announced that he possessed a mid-grade Earth Origin Spirit Treasure, further elevating his reputation.<br/><br/>More and more disciples rushed over, none daring to join the conversation of the sword-bearing disciples and direct disciples. The open space in front of<br/><br/>Qingxin Hall was forming into various circles.<br/><br/>“The Emperor has arrived!”<br/><br/>Someone uttered, causing everyone to turn their heads to look, including Fang Wang.<br/><br/>They saw the Emperor of Da Qi, dressed in the robe of a sword-wielding disciple, flying over on his sword. He was tall and upright, with sharp eyebrows and bright eyes. The heavy snow could not conceal his figure, and he seemed to emanate a dragon aura, setting him apart from the surrounding disciples.<br/><br/>The Emperor, named Zhao Zhen, had ascended to the throne at the age of thirteen and was the third emperor of the Qi Dynasty. Qi Gaozu had founded the nation and died from illness less than a decade later. Zhao Zhen’s father had ascended the throne at the age of thirty, but had died just two years into his reign. Therefore, although young, Zhao Zhen was already the longest-reigning emperor of the Qi Dynasty.<br/><br/>As Zhao Zhen walked forward under the gaze of the disciples, he arrived in front of Li Yu, Fang Wang, and the others, raised his hand in salute, and smiled, “Zhao Zhen pays his respects to all Senior Brothers and Senior Sisters.”<br/><br/>His gaze swept across the crowd, and when it passed over Fang Wang, it did not linger.<br/><br/>Li Yu responded with an enthusiastic smile, “Junior Brother Zhao, there’s no need for such formality. Oh, this is your Fang Wang Senior Brother. He comes from the Fang State Duke’s Mansion of Southern Hills City. You should get to know each other better. After all, there was once a subject status involved.”<br/><br/>Zhao Zhen then turned his gaze to Fang Wang, showing a warm smile, and said, “The State Duke of Fang has made numerous military accomplishments for Da Qi, which I deeply respect. Now the Fang State Duke’s Mansion has produced someone of your standing, Senior Brother Fang Wang. In the future, the Fang Residence will surely become a cultivation noble family and strive for the path of immortality.”\t\t\t\t\t\t</div>", "images": {}, "success": true}