{"id": 32, "url": "https://www.novelhall.com/i-became-an-immortal-on-mortal-realm-32879/14234960.html", "title": "Chapter 32 - Chapter 32: Chapter 30: Deciding Life And Death, Resolving Karma_L", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 32 - Chapter 32: Chapter 30: Deciding Life And Death, Resolving Karma_L</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 32: Chapter 30: Deciding Life and Death, Resolving Karma_l<br/><br/>Translator: 549690339<br/><br/>On the evening of accepting the challenge, Fang Wang infiltrated the Li Mansion, relying on his Breath Concealment Technique and Shadowless Step, he moved like a ghost, searching for the trail of the girl in green.<br/><br/>Before long, Fang Wang found the room where the girl in green was staying, after White Garment Astonishing Swan received the challenge, Li Honggang withdrew the cultivators guarding the room, and there wasn’t even anyone patrolling the mansion.<br/><br/>Fang Wang stood in front of the window, peering through the crack, the girl in green was sitting cross-legged on the bed, she didn’t seem to have suffered at all.<br/><br/>Fang Wang immediately transmitted his voice to her, ‘Miss Qing, are you alright? Do not sneak. vou iust need to nod or shake vour head.’<br/><br/>Upon hearing this, the girl in green trembled and then nodded.<br/><br/>“Have you been poisoned?”<br/><br/>The girl in green shook her head.<br/><br/>Fang Wang used his spiritual sense to scan the room, after confirming there was no danger, he motioned for the girl in green to follow him.<br/><br/>As soon as the girl in green stepped out of the room, he swept her up and quickly left, using his movement techniques all the way, he went undetected by the people of Li Mansion, and Li Honggang had begun his retreat and paid no attention to the outside.<br/><br/>Taking advantage of the night, Fang Wang took the girl in green away from Haixia City, he escorted her for a hundred li before stopping and saying, “You can go back on your own from here.”<br/><br/>The girl in green landed on her feet, looking surprised as she asked, “Aren’t you going back? Are you actually going to accept the challenge?”<br/><br/>That afternoon, Li Honggang had found her, informing her that White Garment Astonishing Swan had accepted the challenge, which made her worried all day; when Fang Wang found her, she thought they would escape together, but Fang Wang was actually planning to return.<br/><br/>“Yes, I’ve rescued you so now I can face Li Honggang without any pressure,” Fang Wang replied.<br/><br/>The journey had been smooth, with no pursuers from the Li Mansion, which showed that Li Honggang was indeed forthright. Given that, he was determined to accept the challenge.<br/><br/>Perhaps, the ease with which he rescued the girl in green had been tacitly allowed by Li Honggang himself.<br/><br/>“But… Li Honggang is a Great Cultivator of the Spirit Elixir Realm, why bother to contend with him?” the girl in green said anxiously, she had heard from Fang Hanyu that Fang Wang joined the Great Abyss Gate at the same time as he did.<br/><br/>Fang Wang smiled and said, “Having accepted the challenge, how can I not fight? Everyone knows White Garment Astonishing Swan is a disciple of the Great Abyss Gate, I represent not only myself but also the honor of the Great Abyss Gate.”<br/><br/>Since he aimed to compete with Lu Yuanjun for the position of head disciple, Fang Wang needed to earn prestige, and what better way to do it than with one feat of valor after another!<br/><br/>Others might not know who White Garment Astonishing Swan was, but Fang Wang believed that Guang Qiuxian and Yang Yuanzi certainly did.<br/><br/>And furthermore…<br/><br/>Fang Wang was very confident!<br/><br/>This was no longer a battle out of hatred but one for spirit and reputation!<br/><br/>One day, the name White Garment Astonishing Swan would be bound with<br/><br/>Fang Wang, and before all this happened, he wanted to make the name of White Garment Astonishing Swan a goal for the disciples of the Great Abyss Gate to strive for.<br/><br/>Hearing these words, the girl in green remained silent.<br/><br/>“Miss Qing, please go back quickly, so your family won’t worry,” Fang Wang urged.<br/><br/>The girl in green stamped her foot and huffed, “What Miss Qing? I have a name, I’m called Qing Wan’er, call me Wan’er from now on!”<br/><br/>With that, she turned and darted into the forest, quickly disappearing into the night.<br/><br/>Fang Wang chuckled and, without dwelling on it, turned to head back to Haixia City.<br/><br/>ft•venty days, not too long, yet not too short, Fang Wang remained in seclusion at the Gu Family Mansion, which made it difficult for Gu Li to disturb him.<br/><br/>Gradually, more and more cultivators gathered in Haixia City, all drawn by the impending battle between White Garment Astonishing Swan and Li Honggang.<br/><br/>White Garment Astonishing Swan’s slaying of Li Hongshuang had propelled his fame, and as a Spirit Elixir Realm cultivator, Li Honggang was a figure of significance for most ordinary cultivators.<br/><br/>A duel at the level of the Spirit Elixir Realm was a rare sight, how could it not attract loose cultivators, and young members of noble families to come and join the excitement.<br/><br/>The night before the decisive battle.<br/><br/>Fang Wang came out of the house and found Gu Li, the two of them sat opposite each other at a table.<br/><br/>“Miss Gu, after observing the battle tomorrow, you should return to the Great Abyss Gate. I have matters to attend to and won’t be able to return for a while,” Fang Wang started.<br/><br/>He guessed Gu Li had come for his sake, even if he was presuming, he felt it necessary to clarify, to prevent Gu Li from waiting in vain.<br/><br/>Gu Li frowned and asked, “Is it because of your injured family member? Is his injury severe?”<br/><br/>“Yes, he needs several months to recover.”<br/><br/>“Do you need my help?”<br/><br/>“Thank you for your kindness, Miss Gu, but there’s no need for you to worry, he’s already recovering. However, it’s inconvenient to disclose his location.”<br/><br/>Fang Wang expressed his apologies; the Fang Residence had not yet reached the Fang Realm, and was not yet established, so he dared not invite Gu Li into the Fang Realm.<br/><br/>Gu Li asked softly, “Then you must win, I will be watching.”<br/><br/>Fang Wang smiled and said, “Of course, I have never lost before.”<br/><br/>Inside the room, the candlelight flickered, and outside the window, the bright moon hung high. Gu Li looked at Fang Wang’s smile, her eyes becoming misty. For some reason, she found his smile very pleasing to the eye.<br/><br/>Fang Wang was very curious about the Ji Hao Sect, so he asked Gu Li about its history. Gu Li did not conceal anything and told him everything she knew.<br/><br/>That night, they talked very happily, and Gu Li felt she had grown closer to him.<br/><br/>As the moon set and the sun rose.<br/><br/>At dawn, when the first light brushed over Haixia City, the city was already buzzing with activity.<br/><br/>Because today, White Garment Astonishing Swan would come to challenge Li Honggang!<br/><br/>More and more cultivators were heading to the south city gate early, afraid of missing the spectacle.<br/><br/>With less than half an hour left until noon, the area in front of the south city gate and atop the city walls were packed with people. Gu Li also arrived, and she stood on the city wall, her face covered with a light veil, her beautiful eyes fixed on a figure below.<br/><br/>Li Honggang!<br/><br/>This Spirit Elixir Realm cultivator was seated cross-legged atop the hilt of his saber, while his long saber stood in the dirt. Although motionless, a formidable aura was accumulating around him, swelling constantly.<br/><br/>“What a terrifying saber intent!”<br/><br/>“Could it be the legendary Scorching Sun Slaughter Sword from the Crimson Sect?”<br/><br/>“I never thought that after so many years away from the Crimson Sect, Li Honggang’s saber intent would have grown to such an extent.”<br/><br/>“I wonder if White Garment Astonishing Swan will even show up.”<br/><br/>The cultivators were abuzz with talk; Li Honggang’s stance was clear—he was prepared for a fight to the death, which made the spectators look forward even more to the ensuing battle.<br/><br/>Some commotion came from behind Gu Li, and she turned to look. A burly elder, surrounded by a group of cultivators, made his way up to the city wall.<br/><br/>This man wore a black robe and a purple crown on his head, his left hand resting behind his waist while his right hand played with two iron balls, with faint sparks of electricity flashing around them.<br/><br/>The City Lord of Haixia City, Tang Chengfeng!<br/><br/>Seeing him appear, many cultivators around him bent down to salute, their faces filled with eagerness and flattery.<br/><br/>Gu Li, however, quietly stepped back, moving away from Tang Chengfeng.<br/><br/>Tang Chengfeng walked to the edge of the city wall, looked down at Li Honggang, and smiled, saying, “It seems Li Honggang is resolved to battle to the death. It makes me see him in a new light. The Li Family lives up to their millennium-old esteemed reputation.”<br/><br/>A young woman in white beside him curiously asked, “Father, do you think he can win?”<br/><br/>“I cannot say for certain since I have not yet seen White Garment Astonishing Swan,” Tang Chengfeng replied contemplatively, as curious as the other cultivators about White Garment Astonishing Swan.<br/><br/>Astonishing Swan’s Thirty-Two Swords…<br/><br/>First, the Great Abyss Gate introduced Lu Yuanjun, and now a White Garment Astonishing Swan has emerged. Their rising momentum seems unstoppable!<br/><br/>Tang Chengfeng felt that the upcoming battle would become a turning point for the Cultivation World; therefore, he came personally to watch.<br/><br/>The cultivators on the city wall and at the city gate were all discussing White Garment Astonishing Swan, speculating about his identity, with Lu Yuanjun’s name being mentioned several times.<br/><br/>Many believed that White Garment Astonishing Swan was Lu Yuanjun!<br/><br/>Time ticked away by the minute and the second.<br/><br/>Noon arrived swiftly!<br/><br/>Li Honggang, who was meditating on the hilt of his saber, suddenly opened his eyes, while Tang Chengfeng at the top of the city wall narrowed his eyes; both of them looked towards the horizon at the same time.<br/><br/>Whoosh—<br/><br/>A sound of something tearing through the air came, and the thousands of cultivators around the south city gate turned their heads to look. Some cultivators even flew up on their swords to get a better view from the air.<br/><br/>A white rainbow approached from the horizon at an incredible speed and stopped suddenly in mid-air, a hundred paces away from the south city gate. Everyone’s gaze fixed on the white rainbow.<br/><br/>The white light dissipated, revealing a figure in fluttering white clothes standing in the sunlight. He was tall and straight, broad-shouldered and narrow-waisted, standing on a flying sword with a bamboo hat on his head, looking like an exiled immortal.<br/><br/>“White Garment Astonishing Swan!”<br/><br/>Someone exclaimed, and the vast majority of cultivators gazed eagerly at the white-clothed figure.<br/><br/>Under the watchful eyes of all, White Garment Astonishing Swan slowly looked up, and beneath the bamboo hat was a fox mask—further adding to his mystery.<br/><br/>The newcomer was none other than Fang Wang!<br/><br/>Fang Wang’s right hand slowly drew out the Qingjun Sword, standing proudly in mid-air as he looked down at Li Honggang and said, “Shall we have a battle to resolve our karma?”<br/><br/>Li Honggang slowly stood up on the hilt of his saber, his robe billowing dramatically as he raised his eyes to Fang Wang and replied in a cold voice, “Let’s settle life and death and end our karma!”\t\t\t\t\t\t</div>", "images": {}, "success": true}