{"id": 30, "url": "https://www.novelhall.com/i-became-an-immortal-on-mortal-realm-32879/14234621.html", "title": "Chapter 30 - 30 Chapter 28 Challenge_1", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 30 - 30 Chapter 28 Challenge_1</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\t30 Chapter 28 Challenge_1<br/><br/>Translator: 549690339<br/><br/>Li Honggang?<br/><br/>The surname “Li” instantly made Fang Wang think of the Li Family behind Li Hongshuang. Could the White Garment Astonishing Swan that Li Honggang was searching for be him?<br/><br/>When he executed the Jinghong Divine Sword Art, he indeed wore white garments.<br/><br/>Three and a half months had passed since Li Hongshuang’s death. Green Cicada Valley had already retreated, but unexpectedly, the Li Family had located this place.<br/><br/>The Li Family had no idea what he looked like.<br/><br/>Upon this thought, Fang Wang turned to ask the demon beast beside him about the specific details of the incident.<br/><br/>This demon, called Shan Xiang, grew up alongside the girl in the green dress. They had been like siblings since childhood. After Green Cicada Valley began slaying the Mountain God clan, Shan Xiang had always accompanied the girl in her outings. Similarly, this time, during their collection of herbs, they were suddenly assailed by Li Honggang.<br/><br/>A host of demon beasts joined forces, yet none was a match for Li Honggang. They had no choice but to let him abduct the girl in green.<br/><br/>“Why didn’t he kill you all? Even if it was to spread a message, there was no need to let all of you live, right?” Fang Wang asked, frowning.<br/><br/>Shan Xiang was startled and shook his head, puzzled.<br/><br/>Fang Wang looked towards Fang Hanyu in the distance. The girl in green had saved Fang Hanyu’s life before, and now that she was in trouble, he indeed couldn’t stand by and do nothing.<br/><br/>Moreover, if he let the girl in green fall into the hands of the Li Family, they would sooner or later force her to reveal the location of the Fang Realm. He might as well take action sooner.<br/><br/>Having made up his mind, Fang Wang stood up and extended his right hand towards Shan Xiang, saying, “Give me the mask.”<br/><br/>Upon hearing this, Shan Xiang quickly handed over the fox mask in his hand to Fang Wang.<br/><br/>Fang Wang stowed it away in his storage bag, then inquired about the direction of Haixia City. After Shan Xiang replied, he headed towards Fang Hanyu.<br/><br/>Arriving at Fang Hanyu’s side, Fang Wang recounted the events. Fang Hanyu wanted to follow along but was refused by him.<br/><br/>“This trip might be a trap. You would only hinder me if you came. Since it is the doing of the Li Family, they are surely targeting me. If they come looking after I leave, you’d better pretend you don’t know me,” Fang Wang conveyed through a private message, still retaining a bit of wariness towards the Mountain God clan.<br/><br/>Hearing this, Fang Hanyu clenched the hands inside his sleeves and nodded slowly.<br/><br/>“You must be careful!”<br/><br/>“Don’t worry!”<br/><br/>Fang Wang patted his shoulder and then turned to walk towards the cave entrance.<br/><br/>In the tunnel, Fang Wang took out a set of black clothes from his storage bag to put on and also donned a bamboo hat.<br/><br/>He wasn’t that naive. Before taking any action, he needed to investigate thoroughly.<br/><br/>After leaving the Fang Realm, Fang Wang flew towards the direction pointed out by Shan Xiang, quickly vanishing into the horizon.<br/><br/>…<br/><br/>Haixia City, situated on the western border of the Qi Dynasty, had been isolated from the world since the early days of the dynasty and had become a city frequented by cultivators.<br/><br/>The city was surrounded by mountains on all sides and, spanning a modest ten or so miles, could only be considered a small city. However, its walls were towering and imposing.<br/><br/>Cultivators would occasionally arrive by flying sword, landing in front of the southern and northern city gates and paying spirit stones to enter the city.<br/><br/>Inside the city, within a residence.<br/><br/>In the room, the girl in the green dress was eating pastries. She had put on a white opera mask again, slightly tilting it up to reveal only her small mouth, appearing just like any other person.<br/><br/>“Mountain God, are you eating well?”<br/><br/>A firm and vigorous voice sounded as a middle-aged man wearing a black robe stepped into the room with a vigorous stride, his gray hair cascading behind him. He had a square face, thick brows, fierce eyes, and three scars on his cheeks as if scratched by the claws of some wild beast.<br/><br/>The girl in green immediately stopped, pulled down her mask, and huffed, “I’ve already said, I don’t know the White Garment Astonishing Swan. I have never even met him. When I saved the Tai Yuan Sect disciples, it was out of pity. Because of this, my Mountain God clan has already paid a heavy price.”<br/><br/>Li Honggang sat down opposite her, pouring himself a cup of wine, and said, “Whether you know him or not isn’t important. Your Mountain God clan has the power to command the spirit demons of the wilderness. What I want is for you to help me send a message. If it weren’t for holding you captive, would those demons put in their best effort?”<br/><br/>The girl in green clothes fell silent for a moment, and only after several breaths did she finally speak, “This incident happened months ago, the major sects have already left, and the White Garment Astonishing Swan is likely long gone.”<br/><br/>“No, those sects are all competing for the legacy of the Ji Hao Sect. Members of my Li Family are also present, and they haven’t found out where the White Garment Astonishing Swan went. I suspect that the Great Abyss Gate disciple saved by the White Garment Astonishing Swan was seriously injured and needed time to heal, which is why they must be hiding nearby,” Li Honggang shook his head and said.<br/><br/>The girl in green huffed, “With the Li Family’s influence, why don’t you mobilize all the family disciples to search for them?”<br/><br/>“How could that be possible? Li Hongshuang joining the Demonic Sect was already a disgrace for the Li Family. The family would not mobilize forces over this, much less take revenge on the Great Abyss Gate. As a family member, if Li Hongshuang is dead, then he’s dead, it’s not worth the pursuit. However, standing from a father’s perspective, I must have a battle with the White Garment Astonishing Swan to resolve this cause and effect!” Li Honggang said coldly, his voice filled with an indescribable aura that enveloped the room, making the girl in green not dare to even take a deep breath.<br/><br/>The room once again fell into silence.<br/><br/>Li Honggang drained the cup of wine in one gulp and then said, “I’ve come here to inform the Mountain God not to worry, even if the White Garment Astonishing Swan does not come in a month’s time, I will still let you leave. I’ve already spread the message, and if White Garment Astonishing Swan has an ounce of pride, he will come. Then, Mountain God, you will witness our showdown!”<br/><br/>Having said that, Li Honggang stood up and left.<br/><br/>The girl in green didn’t stand up but remained seated in silence.<br/><br/>She naturally knew who the White Garment Astonishing Swan was, the one who saved Fang Hanyu was the one, but she had not mentioned this to her clan, fearing it would bring trouble.<br/><br/>Now, all she could do was pray in her heart that Fang Wang would not be impetuous.<br/><br/>…<br/><br/>The sun was setting in the west.<br/><br/>Dressed in black and wearing a bamboo hat, Fang Wang stood in front of the city gate, watching the cultivators come and go, his heart filled with suspicion, the city did not seem like a trap.<br/><br/>He approached the city guards to inquire about the cost of entering the city.<br/><br/>“Entering the city requires ten inferior spirit stones, or twenty elixirs of spiritual energy,” the guard replied.<br/><br/>In the Da Qi Cultivation Realm, spirit stones are classified from low to high as inferior, middle, superior, and ultimate, just like magic artifacts. The sects cut the spirit stones into equally weighted pieces, distributed them to their disciples, and traded with noble families, creating a currency system. The value difference between each grade is tenfold; a middle-grade spirit stone is equivalent to ten inferior spirit stones. As a direct disciple, Fang Wang received ten superior spirit stones every month, and the elixirs of spiritual energy also served as a currency type, with standardized specifications for use in cultivation and recovery of Spiritual Power, equivalent to spirit stones.<br/><br/>After paying twenty elixirs of spiritual energy, Fang Wang entered the city. His attire was not unusual, as most cultivators wore bamboo hats, and some even covered their faces.<br/><br/>Walking down the street, Fang Wang observed the scenery of Haixia City, having heard of its legend before he began his cultivation.<br/><br/>Among the common folk, Haixia City was known as the vanished ghost city, with various versions of the story, nearly all of which believed that the reason for Haixia City’s disappearance was that it had been occupied by ghosts and demons. If mortals encountered Haixia City, it would undoubtedly mean death.<br/><br/>It was not a ghost city after all, simply taken over by cultivators.<br/><br/>Inside Haixia City, there were numerous shops, and Fang Wang finally saw street stalls, bustling and thriving.<br/><br/>Cultivation techniques, secret manuals, elixirs, heavenly materials and earthly treasures, magic artifacts, talisman paper, rare treasures, and demon pets, you name it, they had it, even more cosmopolitan than the towns he had visited before.<br/><br/>As he walked, Fang Wang often heard cultivators mention the names of Li Honggang, White Garment Astonishing Swan, and Ji Hao Sect. He quickly came to understand that Li Honggang had put out a message to challenge the White Garment Astonishing Swan. As the father of Li Hongshuang, he issued the challenge to the White Garment Astonishing Swan. If the White Garment Astonishing Swan won, then this cause and effect would be considered settled.<br/><br/>The city was so lively because many cultivators came for the showdown between the White Garment Astonishing Swan and Li Honggang.<br/><br/>Considering this, it didn’t look like a trap; Li Honggang was taking the high road.<br/><br/>Just as Fang Wang was pondering, he suddenly saw a familiar figure. He looked carefully and indeed, it was Gu Li.<br/><br/>Gu Li stood in front of a busy stall, her gaze fixed on a batch of demon pet eggs on the ground. She wore a tight-fitting purple dress, a sword case on her back, a bamboo hat on her head, and a blue veil over her face, very much the same as when Fang Wang first saw her.<br/><br/>Fang Wang immediately walked up behind Gu Li and spoke softly, “Miss Gu, what are you doing here?”<br/><br/>Upon hearing this, Gu Li turned her head to look at him, her beautiful eyes lighting up with joy.<br/><br/>Fang Wang’s heartstrings were plucked by her gaze, he reminded himself internally—illusion, it must be an illusion, she only wishes to challenge me.<br/><br/>“Brother Fang… Let’s talk somewhere else,” Gu Li said joyfully. Before finishing her sentence, she took Fang Wang’s hand and led him away.<br/><br/>This was the first time Fang Wang, in his life, had been taken by the hand by a woman other than his mother, and he was somewhat unprepared.\t\t\t\t\t\t</div>", "images": {}, "success": true}