{"id": 31, "url": "https://www.novelhall.com/i-became-an-immortal-on-mortal-realm-32879/14234624.html", "title": "Chapter 31 - 31 Chapter 29 Stronger Than Everyone_1", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 31 - 31 Chapter 29 Stronger Than Everyone_1</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\t31 Chapter 29 Stronger Than Everyone_1<br/><br/>Translator: 549690339<br/><br/>Fang Wang was led by Gu Li for a considerable distance before he found the right opportunity to naturally slip away from her delicate hand.<br/><br/>He couldn’t help thinking, how tender.<br/><br/>Fang Wang reflected in his heart, but he wasn’t about to be fooled. He was still young and couldn’t afford to lose his heart to a woman, which would distract him from his cultivation.<br/><br/>Gu Li, walking ahead, clearly noticed, and her ears turned red.<br/><br/>Without a word, under Gu Li’s guidance, Fang Wang walked into a mansion, which was empty of people.<br/><br/>“This is a residence purchased by our Gu Family in Haixia City. In all the cultivation cities of Da Qi, our Gu Family owns property,” Gu Li explained.<br/><br/>Fang Wang nodded, wanting to ask how an ordinary mortal family could transform into a cultivation family, but then he thought that Zhou Xue surely knew better than Gu Li, considering the history of the Gu Family might not be as long as Zhou Xue’s age.<br/><br/>Thus, Gu Li brought Fang Wang into a great hall, then closed the door behind them. She removed her veil, gazed at Fang Wang, and asked, “You’re the White Garment Astonishing Swan, aren’t you?”<br/><br/>Fang Wang arched an eyebrow, “The White Garment Astonishing Swan who killed a master of the Soul Sculpting Realm Ninth Level? Do you think I have that kind of strength? I started my Spiritual Refinement later than you.”<br/><br/>“You’re really irritating when you talk, but I feel it’s you. The Jinghong Divine Sword Art is a unique technique from our master, Yang Yuanzi. I haven’t received this legacy, so it could only be you. As for our senior brothers and sisters, their talents and comprehension are just average; otherwise, our third vein wouldn’t be second to last,” she stated.<br/><br/>Gu Li stared into Fang Wang’s eyes with a look that mixed delight, admiration, and a hint of grievance—a look that could melt any man’s heart.<br/><br/>Fang Wang looked away, changing the subject, “Why did you come? Did the sect assign you a task?”<br/><br/>“The inheritance of Ji Hao Sect has caused such a stir, and there’s much discussion within the Great Abyss Gate. Many disciples have come, so it’s not strange that I did too,” Gu Li replied, though she slightly pursed her lips, showing insincerity.<br/><br/>Fang Wang saw through her, “The inheritance of Ji Hao Sect isn’t in Haixia City, is it? It’s almost a thousand miles away, right?”<br/><br/>Gu Li huffed softly, thinking would I admit that I was worried about you?<br/><br/>She too changed the subject, “Are you here to accept the challenge? Li Honggang is in the Spirit Elixir Realm, already at the Spirit Elixir Realm Third Layer. Although it’s very unlikely he’ll further progress in this lifetime, he’s still not someone we can challenge at the moment…”<br/><br/>As she spoke, she suddenly paused, because Li Hongshuang from the Soul Sculpting Realm Ninth Level had been defeated by Fang Wang.<br/><br/>Being from the prestigious Gu Family, Gu Li had heard of Li Hongshuang since she was a child. Her father had lamented Li Hongshuang’s talent more than once. The thought that such a figure had died at Fang Wang’s hands caused an unstoppable admiration to rise in her heart.<br/><br/>Due to the rich heritage of the Gu Family, she had heard numerous stories of prodigies, including those beyond Da Qi. The impact Fang Wang had on her was even more astonishing than legends.<br/><br/>“The Spirit Elixir Realm Third Layer? Are you sure?” Fang Wang asked, raising an eyebrow.<br/><br/>His main reason for coming to Haixia City was to understand Li Honggang’s strength; he had no intention of acting recklessly.<br/><br/>Gu Li nodded, “He’s been stuck at this realm for at least sixty years. My father even said that the best thing Li Honggang did in his later years was giving birth to Li Hongshuang.”<br/><br/>Fang Wang followed up with another question, “Do you think he might have set a trap in Haixia City?”<br/><br/>Gu Li shook her head, “He chose Haixia City because its lord, Tang Chengfeng, is a Great Cultivator at the Spirit Elixir Realm Ninth Level. With Tang Chengfeng there, no chaos will arise in Haixia City. That’s why many Loose Cultivators like to deal here. Even when facing cultivators from other dynasties, Tang Chengfeng wouldn’t hesitate, as he has one of the sternest temperaments among border city lords and can’t stand a speck of dust in his eyes. Because of this, Haixia City frequently witnesses duels between cultivators.”<br/><br/>“Moreover, the matter has already blown up. If Li Honggang were to call upon other Li Family Cultivators to take action, it would make the world look down on the Li Family. The Li Family values their honor and reputation highly. Otherwise, they wouldn’t have expelled Li Hongshuang from the clan’s register back then. You don’t need to worry about the Li Family seeking revenge on you or your family over this. Cultivation families care deeply about their reputation, at least in the Da Qi Cultivation Realm.”<br/><br/>Hearing this, Fang Wang was relieved.<br/><br/>Gu Li furrowed her brows, “You’re not really going to accept the challenge, are you? How confident are you?”<br/><br/>Feeling relaxed, Fang Wang settled at a table and chuckled, “About fifty percent, I guess. When facing an enemy, it’s usually a fifty-fifty. Either my enemy dies or survives, or I do.”<br/><br/>Gu Li sat down as well, continuing to gaze steadily at Fang Wang.<br/><br/>“What’s with that look? Do you think I’m arrogant?” Fang Wang asked, arching an eyebrow.<br/><br/>Gu Li raised her hand, her right hand resting on the table, supporting her cheek. She stared at Fang Wang with a flickering gaze, sighed, and said, “Fang Wang, I suddenly feel that our agreement is hard to fulfill. By the time I reach the Ninth Level of the Soul Sculpting Realm, you will definitely be roving through the Spirit Elixir Realm, and the gap between us will only grow wider.”<br/><br/>Fang Wang blinked, speaking earnestly, “Gu Li, do you practice cultivation just to compare yourself with others? Isn’t each advancement a source of accomplishment for you, helping you find the meaning of existence?”<br/><br/>Upon hearing this, Gu Li took a deep breath and said with a hint of shame, “You’re right, I’ve been stubborn.”<br/><br/>“Your talent is beyond question.”<br/><br/>“Mmm…”<br/><br/>Feeling a little better, Gu Li then asked, “Is it because you compare yourself only to yourself that you have become so powerful?”<br/><br/>“That’s certainly not the case, I compare myself with everyone. I have an innate desire to excel. Since I practice cultivation, my goal is to be stronger than everyone,” Fang Wang replied calmly.<br/><br/>“…”<br/><br/>Gu Li suddenly felt uncomfortable again. Could it be that he advised me to compare myself to myself because I’m not qualified?<br/><br/>…<br/><br/>That very night, Fang Wang, using his Unceasing Natural Technique, quietly arrived at Li Honggang’s residence, sticking a piece of paper on the stone statue in front of the mansion’s gate.<br/><br/>The very next morning, the news spread like wildfire throughout Haixia City.<br/><br/>The White Garment Astonishing Swan had accepted the challenge!<br/><br/>Twenty days later, at noon, he would face the challenge at the southern city gate to resolve karma!<br/><br/>Inside the Li family mansion, Li Honggang sat in a chair, holding a yellow paper in his hand, his eyebrows tightly knitted, his face dark.<br/><br/>“Are you sure it was stuck on the stone statue at the entrance?” Li Honggang asked.<br/><br/>The servant standing in front of him nodded hastily, “This servant saw it when he went out to clean this morning. It was not given to me by someone else.”<br/><br/>“Hmm, go down.”<br/><br/>Upon Li Honggang’s response, the servant, relieved, immediately left.<br/><br/>The purple-clad young man standing by furrowed his brows and said, “Father, he managed to come to the outside of our mansion without anyone noticing, his strength should not be underestimated. Moreover, third brother’s talent was extraordinary; ordinary cultivators in the first layer of the Spirit Elixir Realm might not be his match. To kill third brother, the other party must be a high-ranking expert in the Spirit Elixir Realm, perhaps even higher than you. Is it really worth taking the risk?”<br/><br/>Li Honggang glared at him with a stern voice, “Do you think I issued the challenge because I’m certain of victory? My son is dead, your third brother is dead. Even if he was a scoundrel, he was still my son, your third brother!”<br/><br/>The purple-clad young man fell silent, his face showing discomfort.<br/><br/>“I have come to accept my fate. Among you children, Li Hongshuang had the highest potential. If he had lived, I could have relied on him to change my destiny. Now that he’s dead, I have no expectations left in my life, but there is regret. The pain of an elder burying the young, do you understand?” Li Honggang sighed, his expression becoming world-weary.<br/><br/>The purple-clad young man hesitated to speak, his face showing a guilty expression. Ever since Li Hongshuang joined the Green Cicada Valley, their branch had faced exclusion within the Li family, which valued reputation and had thousand-year foundations in history. Because of Li Hongshuang, they had become a stain on the family’s honor.<br/><br/>Li Honggang’s eyes suddenly sharpened, “Furthermore, this act is to bolster the Li family’s prestige. If I win, the majesty and strength of the Li family will be undeniable. Even though I haven’t increased my cultivation for many years, my blade skills have reached their peak. Even if I lose, at least the Li family will appear upright and will receive the Cultivation World’s respect. This will also benefit the Li family in interacting with other righteous sects.”<br/><br/>Hearing this, the purple-clad young man revealed a look of guilt, and with clenched teeth, he said, “It’s my fault for not being strong enough, or else father wouldn’t have to step in!”<br/><br/>“Nonsense, such matters should naturally be handled by me. Go, spread the word as widely as possible. Since the White Garment Astonishing Swan set a date of twenty days, it shows he also wants more spectators. Let’s fulfill his wish. I want to see if his Jinghong Thirty-Two Sword Techniques are more impressive or if my blade harbors more killing intent!” Li Honggang said, his whole person exuding immense confidence by the end.<br/><br/>Between the glints of his eyes, the shadows of blades flickered indistinctly.\t\t\t\t\t\t</div>", "images": {}, "success": true}