{"id": 33, "url": "https://www.novelhall.com/i-became-an-immortal-on-mortal-realm-32879/14234961.html", "title": "Chapter 33 - Chapter 33: Chapter 31: Thirty-Six Swords Emerge_1", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 33 - Chapter 33: Chapter 31: Thirty-Six Swords Emerge_1</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 33: Chapter 31: Thirty-Six Swords Emerge_1<br/><br/>Translator: 549690339<br/><br/>Determine life and death, settle karma!<br/><br/>As soon as Li Honggang’s words were uttered, the cultivators around the south gate of Haixia City all became excited.<br/><br/>The cultivation world is even more cruel than the secular one; although there are distinctions between righteous and evil, cultivators prioritize their own interests. They step onto the path of cultivation not for peace in the world, but in pursuit of eternal life—a choice that is essentially a battle against the heavens.<br/><br/>“Such dominance, truly befitting of a cultivator from the Li Family.”<br/><br/>“A powerful dynasty a thousand years ago, now a leading cultivation family, the Li Family’s heritage has indeed stood the test of time with their spirit.” “White Garment Astonishing Swan looks so calm. Who exactly is he?”<br/><br/>“It couldn’t be Lu Yuanjun, could it? Lu Yuanjun no longer needs to wear a mask. It seems Great Abyss Gate has nurtured another remarkable talent.” “I think he might be a Peak Master or an elder of Great Abyss Gate!”<br/><br/>Standing on the city wall, Gu Li, with a hint of contempt beneath her veil, thought to herself that he was not an elder, but a genius even more formidable than Lu Yuanjun!<br/><br/>Before entering Great Abyss Gate, her father had often mentioned Lu Yuanjun, lamenting that he would become a pivotal figure in the future of the Da Qi Cultivation Realm. She was always unconvinced, feeling that she was not inferior. Why didn’t her father praise her?<br/><br/>Though she had not met Lu Yuanjun, deep down she believed any genius would seem mediocre in front of Fang Wang and not worth mentioning.<br/><br/>Listening to the discussions around her, Gu Li’s worries faded, replaced by anticipation.<br/><br/>Fang Wang will surely win!<br/><br/>Tang Chengfeng stared intently at Fang Wang without speaking, and from his expression, it was difficult to guess what was on his mind.<br/><br/>The woman in white beside him muttered, “His build looks fine, but who knows if the face behind the mask is good-looking.”<br/><br/>Li Honggang’s body exuded a visible aura. He suddenly rose into the air<br/><br/>without relying on a magic artifact. The long saber planted in the earth trembled for several moments before shooting out, its handle fitting smoothly into his right hand.<br/><br/>With the long saber in hand, Li Honggang fixed his gaze on Fang Wang. His cloak fluttered, and his hair danced as if possessed.<br/><br/>Fang Wang’s mask revealed his eyes, and within his pupils, the figure of Li Honggang seemed to burn with flames, gradually merging with the scorching sun in the sky.<br/><br/>Li Honggang continued to rise until he could look down upon Fang Wang.<br/><br/>In that moment, he was like the blazing sun in the sky, his aura reaching its zenith. It even extended along the saber blade, forming a terrifying sword Qi more than thirty feet long. Under the blazing sun’s illumination, this sword Qi began to ignite.<br/><br/>Fang Wang raised his sword, with the tip pointing upwards, the blade horizontal in front of him. Sword forms began to condense around his body.<br/><br/>One sword!<br/><br/>Three swords!<br/><br/>Nine swords!<br/><br/>Twelve swords!<br/><br/>This spectacle further excited the observing cultivators. For a cultivator, the pursuit of swordsmanship is paramount. The fame of the Jinghong Divine Sword Art in the Cultivation World is not small; back then, Yang Yuanzi had used this sword technique to penetrate Green Cicada Valley and emerge unscathed. That battle still excites many cultivators to this day.<br/><br/>This was also the reason why Yang Yuanzi could inherit the Great Abyss Gate’s secret technique, the Nine Heavens Azure Thunder Sword Formation!<br/><br/>As the number of sword forms around Fang Wang surpassed twenty-four, even sword cultivators began to count them on the city walls.<br/><br/>“Thirty-two swords! The Jinghong thirty-two sword technique indeed!” Someone shouted fervently, his hand clutching the sheath trembling.<br/><br/>Thirty-two swords circled around Fang Wang, all aiming at Li Honggang. The combined might of the thirty-two swords lent Fang Wang an awe-inspiring aura, in no way inferior to Li Honggang.<br/><br/>“No wonder my son died at your hand, White Garment Astonishing Swan. Let me see just how powerful your thirty-two swords are!”<br/><br/>Li Honggang raised his saber, pointing it diagonally at Fang Wang with a commanding gaze.<br/><br/>The aura of the Jinghong thirty-two swords was genuinely strong, but feeling Fang Wang’s momentum, Li Honggang had a bold thought.<br/><br/>The opponent might not have reached the Spirit Elixir Realm!<br/><br/>This conjecture shocked him, seemed incredible, and even a fear he never felt before arose from the depths of his heart.<br/><br/>To possess such aura without having reached the Spirit Elixir Realm, he was undoubtedly a talent more terrifying than Li Hongshuang. He could not fathom how high Li Hongshuang might climb, much less predict how high the limit for White Garment Astonishing Swan could be.<br/><br/>Such a terrifying existence, if he held any grudges against the Li Family, would surely be a disaster for them!<br/><br/>He must be killed!<br/><br/>A fearsome killing intent flashed in Li Honggang’s eyes, his aura suddenly increased, and the flames on the long saber surged.<br/><br/>“Thirty-two swords?”<br/><br/>Fang Wang’s voice suddenly rang out, tinged with a trace of disdain.<br/><br/>Fang Wang’s right wrist twisted, the sword blade aiming at his brow, his eyes piercingly sharp!<br/><br/>Boom!<br/><br/>Fang Wang’s momentum surged violently, and four swords appeared out of thin air around him, forming a large circle with thirty-six swords suspended around him.<br/><br/>The enhancement of each layer of the Jinghong Divine Sword Art was not just about increasing the number of swords, the sword intent and sword force also grew accordingly. The further it progressed, the addition of each new sword brought a remarkably different might!<br/><br/>With thirty-six swords unveiled, Fang Wang’s sword force soared to the skies, causing cultivators even far away at the southern city gate to be startled, with many of their swords trembling in hand.<br/><br/>Gu Li’s sword case on her back trembled as well. At that moment, she suddenly remembered the day when all the Lifespirit Treasures of Great Abyss Gate were out of control—her own Lifespirit Treasure had been similarly affected.<br/><br/>Could it have been because of him back then…<br/><br/>Gu Li thought of the day Fang Wang hurried back, could it be…<br/><br/>Her eyes on Fang Wang turned even more fervent, filled with anticipation.<br/><br/>“Jinghong Thirty-Six Swords!”<br/><br/>Tang Chengfeng spoke with deliberate pauses, uttering six words, his expression solemn.<br/><br/>All the cultivators around the southern city gate were deeply moved, holding down their own swords while looking excitedly at Fang Wang. Li Honggang was also scared, panic evident in his eyes.<br/><br/>Thirty-six swords!<br/><br/>How could it be possible!<br/><br/>Li Honggang’s mind was shaken, his qi and blood tumultuous. At that moment, intense fear surged into his heart. He shouted angrily and slashed with his saber.<br/><br/>A nearly fifty-feet-long slash of flaming saber qi swept the half sky, creating a terrifying sea of fire condensed into a huge sun-like fireball that rapidly enveloped Fang Wang!<br/><br/>Fang Wang’s eyes narrowed sharply as he swung his sword forward. The thirty-six swords fell like a rain of blades, moving like thunder and unstoppable as floodwaters.<br/><br/>In a flash, Fang Wang seemed to be controlling not just thirty-six swords, but three hundred and sixty!<br/><br/>Boom—<br/><br/>The relentless sword rain swept across, scattering the blazing sun’s flames with a dominantly tyrannical force, leaving Li Honggang with wide eyes, his robe torn to shreds by the sword qi, unable to react in time.<br/><br/>Under the watchful eyes of all the cultivators, Fang Wang swung his sword, and the Jinghong Thirty-Six Swords power doubled, forcibly dispersing Li<br/><br/>Honggang’s Scorching Sun Slaughter Sword before they could even clearly see Li Honggang’s response. He was engulfed by the sword rain.<br/><br/>The vast sword rain swept across the skies of Haixia City, extending for miles before dissipating, leaving behind a magnificent stream of qi currents as a spectacle in the air.<br/><br/>When the sword rain had passed, there was no sign of Li Honggang in the sky, only his long saber remained, and a spirit pill the size of a chicken egg, which was entirely red and still burning with fierce flames.<br/><br/>The long saber slowly fell, disintegrating into smoke as it descended.<br/><br/>The dispersal of the Lifespirit Treasure meant that its master was dead!<br/><br/>As Li Honggang’s Spirit Pill hit the ground, Fang Wang turned around, transformed into a streak of white rainbow and departed, quickly disappearing into the horizon.<br/><br/>Haixia City fell into dead silence.<br/><br/>“White Garment Astonishing Swan won!”<br/><br/>A man exclaimed excitedly, breaking the silence, and a thunderous cheer rose throughout the city.<br/><br/>Li Honggang’s son, the young man in purple, and other members of the Li Family stood in front of the city gate, staring blankly at the scene. With a thud, the young man in purple knelt on the ground, utterly disheartened.<br/><br/>“My heavens! Thirty-six swords!”<br/><br/>“Does the Jinghong Divine Sword Art really have thirty-six swords? Such a powerful sword technique!”<br/><br/>“I thought it would be a great battle, but I didn’t expect Li Honggang couldn’t withstand a single move…”<br/><br/>“Who exactly is White Garment Astonishing Swan? To slay a Spirit Elixir Realm<br/><br/>Third Layer with a single sword, isn’t it too inconceivable?”<br/><br/>“Another prodigy has emerged from Great Abyss Gate!”<br/><br/>As all the cultivators exclaimed in shock, Gu Li looked in the direction Fang Wang had left, the corners of her mouth under her veil slightly curving upward.<br/><br/>Having witnessed Fang Wang’s instant kill of Li Honggang with a single sword, she felt no shock but thought it was only natural.<br/><br/>“Father, you said that when a true prodigy appears, everyone else pales in comparison. I have really met one,” Gu Li quietly thought, then turned and left.<br/><br/>Fang Wang’s strength did not crush her spirit but instead made her eager to return to her sect to cultivate.<br/><br/>Tang Chengfeng watched the horizon and remarked, “Zhi Xin, go to Great Abyss Gate. With the unveiling of the Jinghong Thirty-Six Swords, the world is about to change dramatically. It seems this hidden dragon of Great Abyss is truly set to soar.”<br/><br/>The woman in white beside him was still in shock, her gaze vacant, unable to snap back to reality.<br/><br/>Under the bright daylight, the airflow above Haixia City lingered for a long time, as if the sword intent of White Garment Astonishing Swan was deeply etched in the hearts of all who witnessed the battle, indelible..\t\t\t\t\t\t</div>", "images": {}, "success": true}