{"id": 37, "url": "https://www.novelhall.com/i-became-an-immortal-on-mortal-realm-32879/14236108.html", "title": "Chapter 37 - Chapter 37: Chapter 35: The Identity In White, The Emperor’S Cultivation_L", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 37 - Chapter 37: Chapter 35: The Identity In White, The Emperor’S Cultivation_L</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 37: Chapter 35: The Identity in White, The Emperor’s Cultivation_l<br/><br/>Translator: 549690339<br/><br/>“Senior Brother Fang, have you returned to complete a task?”<br/><br/>A surprised voice came from beside him, prompting Fang Wang to turn his head and look.<br/><br/>Fang Wang observed the other’s face, pondered for a moment, then nodded and said, “Mm, you’re here too, what a coincidence.”<br/><br/>This time, his departure from the Great Abyss Gate seemed to have lasted only a few months, but including the time he spent practicing the Nine Dragons<br/><br/>Divine Transformation Art, he had actually been away for two hundred years. Aside from those close to him, he couldn’t remember people he had only met once or twice.<br/><br/>The other person came up and chatted with him warmly.<br/><br/>As they talked, Fang Wang remembered—the person was none other than Zhou Bo, who was always very enthusiastic whenever they met.<br/><br/>After chatting for a good while, Fang Wang finally found an opportunity to excuse himself. He glanced at the main pillar and saw that Lu Yuanjun’s name had entered the top twenty. It should be noted that most of the names above were those of Peak Masters and Elders who had lived for several hundreds of years.<br/><br/>Fang Wang made his way to the fourth floor and found the study where the Elder of the Task Hall resided. As a direct disciple, he could meet the Elder directly.<br/><br/>The study was large, filled with numerous magic artifacts; against the wall stood several bookcases loaded with countless books and jade slips.<br/><br/>“Fang Wang, right? The first disciple in the history of the Great Abyss Gate to become a direct disciple upon entry—I’ve been very curious about you. From now on, you can call me Elder Uncle Zhang.”<br/><br/>Elder Zhang of the Task Hall said this with a chuckle. He was plump and appeared very amiable, but Fang Wang had seen his name among the top ten on the main pillar.<br/><br/>“Elder Uncle Zhang, I have a task to turn in, but I’m afraid the information getting out could endanger my safety. Could it just be recorded without being spread?” Fang Wang respectfully requested.<br/><br/>Elder Zhang stroked his beard and laughed, “Don’t worry. The Task Hall only records contributions and never engages in idle gossip. Besides, I’m handling your case—what do you have to be worried about?”<br/><br/>Upon hearing this, Fang Wang immediately felt at ease, then pulled out a cloth bag from his storage pouch and placed it on the table.<br/><br/>Elder Zhang, however, wasn’t scared; he just looked at him with a smile.<br/><br/>Fang Wang untied the cloth bag, revealing the head of Li Hongshuang. Aside from the dried blood, it looked as if she had died only a few days ago, with no signs of decay.<br/><br/>Elder Zhang took a glance, initially not paying much attention, but then his eyes widened in astonishment.<br/><br/>“Eh? Is this… Li Hongshuang?”<br/><br/>Elder Zhang was startled and quickly picked up Li Hongshuang’s head to examine it. After a short while, he lifted his eyes to look at Fang Wang, his expression one of shock as he trembled, “Are you the White Garment Astonishing Swan?<br/><br/>Seeing the White Garment Astonishing Swan did not surprise him, it was just that the White Garment Astonishing Swan had only joined less than a year ago…<br/><br/>A year ago, Fang Wang was only at the seventh layer of the Qi Cultivation Realm!<br/><br/>Being at the seventh layer of the Qi Cultivation Realm and sweeping through fifty-one cultivators of the same realm had already spread among the Elder ranks. All Peak Masters envied Yang Yuanzi for his good luck with such a talented disciple, and even though Elder Zhang was the Task Hall Elder, he too yearned for a genius disciple like Fang Wang.<br/><br/>As one gets older and reaches the limit of their cultivation, other than defying the heavens to change their fate, they seek a suitable successor to pass on their will and ensure it continues within the sect for a long time.<br/><br/>A year ago, at the seventh layer of the Qi Cultivation Realm, he had executed Li Hongshuang, who was at the ninth layer of the Soul Sculpting Realm…<br/><br/>What’s most crucial was that this event happened a few months ago, and White Garment Astonishing Swan’s latest feat was defeating Li Honggang, who was at the third layer of the Spirit Elixir Realm…<br/><br/>Elder Zhang had been in this position for one hundred and fifty years and had heard of all kinds of remarkable achievements.<br/><br/>Yet, he was still shaken by Fang Wang…<br/><br/>He looked at Fang Wang as if he were staring at a monster.<br/><br/>Fang Wang cleared his throat to interrupt Elder Zhang’s thoughts, and the Elder continued with a sigh and a smile, “Twenty-five years ago, when the Li family visited our sect, Li Hongshuang was among them. At that time, the Sect Leader predicted she had the potential to rival Lu Yuanjun, and the Li family also intended for Li Hongshuang to join our sect. It’s regrettable that she ultimately joined the Green Cicada Valley, and now it’s even more lamentable that she has died at the hands of our sect’s disciple.”<br/><br/>Fang Wang didn’t know how to respond, so he could only nod and smile.<br/><br/>Afterward, Elder Zhang asked for his disciple token, then recorded the contribution points. Li Hongshuang was a well-known genius in the Demonic Path, and his task had always been available, meaning that Fang Wang could turn in the task even if he hadn’t accepted it beforehand.<br/><br/>Besides that, Fang Wang also turned in the task of rescuing Fang Hanyu. When disciples return to the Great Abyss Gate, their tokens are checked. These tokens are connected to a sect-defining magic artifact, and all the Task Halls are linked to this artifact. In short, Elder Zhang could confirm whether Fang<br/><br/>Hanyu had returned.<br/><br/>Fang Wang tried to hand over the identity items of other Green Cicada Valley disciples, which had been selected by Zhou Xue.<br/><br/>After busying himself for half an hour, Fang Wang finally left.<br/><br/>Elder Zhang sat in his chair, struggling to calm his emotions for a long time. “White Garment Astonishing Swan… seventeen years old… less than two years into cultivation and already slaughtering someone at the third layer of the Spirit Elixir Realm… a true monster… No wonder the Sect Leader values him so highly, I must do something for him…”<br/><br/>Elder Zhang silently thought, after the shock had passed, his heart surged with infinite anticipation.<br/><br/>Before his time was up, could he witness an unprecedented Great Abyss Gate?<br/><br/>Elsewhere.<br/><br/>Fang Wang arrived on the first floor, where he stopped in his tracks by the main pillar, his gaze turning to the name of Lu Yuanjun. Behind Lu Yuanjun’s name was a string of numbers, indicating his contribution points, which amounted to over three million.<br/><br/>After completing his task, Fang Wang’s contribution points were just over nine hundred. Li Honggang was not considered an enemy of the Great Abyss Gate, so he did not fall within the scope of mission objectives.<br/><br/>Fang Wang only glanced at it before withdrawing his gaze and continuing on his way.<br/><br/>In the grand hall, people came and went. Fang Wang seemed unremarkable among the crowd, as unassuming as the names below Lu Yuanjun’s, hidden among the multitude.<br/><br/>After returning to his cave dwelling, Fang Wang began his cultivation routine.<br/><br/>He wasn’t lacking in spells, so he focused on cultivation and Qi gathering, aiming to reach the ninth layer of the Soul Sculpting Realm as soon as possible.<br/><br/>Time flew by.<br/><br/>Half a year passed.<br/><br/>Fang Wang reached the sixth layer of the Soul Sculpting Realm. Such a breakthrough speed, if known, would certainly cause a huge stir within the Great Abyss Gate.<br/><br/>That day, just past noon, Fang Hanyu came for a visit to Fang Wang’s dwelling with six disciples from the Fang Family, their arrival enlivening the place.<br/><br/>Seeing his family, Fang Wang was also very happy. After sitting down, they began to share their experiences.<br/><br/>They were Fang Residence disciples handpicked by Zhou Xue. Now, even the least advanced among them had reached the third layer of the Qi Cultivation Realm. Compared to Fang Wang, they seemed heaven and earth apart, but in reality, cultivation was challenging. Many outer sect disciples from the nine veins struggled for decades and still found it hard to surpass the fifth layer of the Qi Cultivation Realm, not to mention reaching the Soul Sculpting Realm.<br/><br/>Fang Hanyu had successfully completed his Spiritual Refinement, his Lifespirit Treasure being a Top-Grade Mysterious Elemental Spirit, which made the Fang Family extremely proud.<br/><br/>Fang Wang, however, was somewhat disappointed as anything less than an Earth Origin Spirit Treasure no longer caught his eye.<br/><br/>“Thirteenth Brother, what grade is your Lifespirit Treasure?” asked Fang Xin curiously, with the others following her gaze to Fang Wang.<br/><br/>Fang Wang just smiled and looked at Fang Hanyu. Fang Hanyu immediately said, “Don’t ask anymore. It’s definitely higher than mine, but too high is not good either, as it may attract calamity. Remember, you must not mention Fang<br/><br/>Wang’s Lifespirit Treasure to outsiders.”<br/><br/>Upon hearing this, everyone nodded quickly.<br/><br/>Fang Hanyu’s expression was serious, but inside, he was as anxious as a cat scratching, more curious than anyone else about the grade of Fang Wang’s treasure. Alas, the youngster would not reveal a word.<br/><br/>Fang Zigeng, whose cultivation had reached the fifth layer of the Qi Cultivation Realm, spoke up, “By the way, do you know about the Emperor of Da Qi joining the Great Abyss Gate for cultivation?”<br/><br/>The others began to discuss.<br/><br/>“I know, it’s already being talked about in the seventh vein. They say that the Qi<br/><br/>Dynasty is going to transform into a Cultivation Dynasty, but who knows if it’s true.”<br/><br/>“If the Emperor joins the sect, won’t he have to address us as senior brothers and sisters?”<br/><br/>“Tsk, tsk, originally I thought that after cultivating, I would transcend imperial power, but now even imperial power has started cultivation.”<br/><br/>“It’s said that the Emperor gave up a lot to get the agreement of the Great<br/><br/>Abyss Gate. The Task Hall has released a large number of tasks to mine Spirit Mines and find Spirit Veins, and the Emperor must have made concessions there.”<br/><br/>Hearing their discussions, Fang Wang raised his eyebrows.<br/><br/>Zhou Xue had mentioned before that the Qi Dynasty would become a<br/><br/>Cultivation Dynasty. Fang Wang hadn’t expected it to happen so soon. On second thought, while the Emperor was now cultivating, it would still take decades of effort before the methods of cultivation were extended to all the people.<br/><br/>Zhou Xue suspected that the Shadow Prime Minister might be involved with Lu Yuanjun, and perhaps the Emperor of Da Qi was involved as well. After all, in the predetermined future, the Emperor of Da Qi and Lu Yuanjun were close and reached the pinnacle of the Da Qi Cultivation Realm together.<br/><br/>Now hearing that the Emperor of Da Qi had joined the Great Abyss Gate, Fang Wang suddenly thought of a possibility.<br/><br/>The Cultivators who attacked the Fang Residence held the Soul Burning Banner, a Ghost Instrument used to collect souls. Righteous sects do not permit their disciples to kill commoners indiscriminately. Could it be that, to join the Great Abyss Gate, the Emperor was willing to sacrifice commoners to gain Lu Yuanjun’s referral?<br/><br/>As for why they chose the Fang Residence, it was probably opportunistic. On the surface, it seemed like a struggle for power in the royal court, and at most, it would tarnish the Emperor with a reputation for cruelty. However, if it was discovered that the Emperor wanted to sacrifice the people of an entire city in exchange for the secrets of cultivation, the matter would be serious, and tumult would inevitably ensue throughout the land!<br/><br/>Fang Wang remained silent, listening to his family’s conversation while sorting through his own thoughts..\t\t\t\t\t\t</div>", "images": {}, "success": true}