{"id": 34, "url": "https://www.novelhall.com/i-became-an-immortal-on-mortal-realm-32879/14234962.html", "title": "Chapter 34 - Chapter 34: Chapter 32: The Five Poisons Of The North, Lu Yuanjun_L", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 34 - Chapter 34: Chapter 32: The Five Poisons Of The North, Lu Yuanjun_L</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 34: Chapter 32: The Five Poisons of the North, Lu Yuanjun_l<br/><br/>Translator: 549690339<br/><br/>Above the mountain range, a white rainbow streaked across the sky, the white light gradually dissipating as the speed dropped, revealing the figure of Fang Wang.<br/><br/>No longer employing the White Rainbow Evasion Technique and riding on his Flying Sword, he let out a sigh of relief behind his mask.<br/><br/>It seemed as if he killed Li Honggang with a single move, but in reality, it consumed half of his Spiritual Power, so he dared not keep using the White Rainbow Evasion Technique, in case he encountered an attack later on.<br/><br/>“The Solaris Scripture is indeed powerful, allowing me, at the fourth level of the Soul Sculpting Realm, to kill in a second someone in the full strength of the Spirit Elixir Realm Third Layer using only half of my Spiritual Power.”<br/><br/>Fang Wang thought silently, feeling that he was quite well-rounded at present, yet if he were to point out a weakness, it would be the lack of techniques aimed at souls and sealing techniques.<br/><br/>As he flew on with the Sword Control Technique, he quietly summed everything up, the breeze blowing against his white garment, fully embodying the spirit of a Sword Cultivator.<br/><br/>Ever since he entered the Great Abyss Gate, Fang Wang had never truly exerted all his strength; he had never used his Lifespirit Treasure, and the Nine Dragons Divine Transformation Art was kept as his ace in the hole.<br/><br/>Through this battle, Fang Wang could be certain that his strength was far above the Spirit Elixir Realm Third Layer, but as for how high his limit was, it was still unclear.<br/><br/>The Spiritual Power of the Spirit Elixir Realm was indeed higher than that of the Soul Sculpting Realm, and even though Fang Wang used Solaris Spiritual Power, he was startled for a moment by Li Honggang’s Spirit Elixir Realm Spiritual Power. Fortunately, he was wearing a mask at the time.<br/><br/>He came flying on his sword, swung his sword to kill, and then flew away again…<br/><br/>Fang Wang silently gave himself a perfect score in his heart, feeling that he had fully embraced the persona of a master, which would surely spark a following within the Great Abyss Gate.<br/><br/>He continued on his journey.<br/><br/>The world around him grew increasingly desolate.<br/><br/>Fang Wang seemed to sense something, lifted his eyes, and saw ahead of him dense forests, with towering peaks standing like spikes, magnificent and desolate in their beauty.<br/><br/>Atop five high peaks stood a figure each; these five individuals were clad in the attire of Green Cicada Valley, their bodies crawling with poisonous insects and surrounded by a fog of poison, horrifying and terrifying.<br/><br/>Green Cicada Valley!<br/><br/>Fang Wang slowed down and gripped the hilt of his Qingjun Sword at his waist.<br/><br/>“White Garment Astonishing Swan, you killed the disciples of Green Cicada Valley, do you acknowledge your crimes?”<br/><br/>A cold female voice echoed through the mountains like the Grim Reaper announcing the end for mortals.<br/><br/>Fang Wang snorted, “Green Cicada Valley slaughtered the Tai Yuan Sect<br/><br/>Disciples, so do you recognize your crimes?”<br/><br/>The aura these five exuded made him feel the danger, but he was not afraid; it was a good opportunity to test how powerful his Nine Dragons Divine Transformation Art was!<br/><br/>Seeing Fang Wang’s obstinate attitude, the five cultivators of Green Cicada Valley took to the air, closing in on him. The toxic fog around them expanded, causing the trees below to quickly wither, a ghastly sight.<br/><br/>Spirit Elixir Realm!<br/><br/>Fang Wang instantly gauged the cultivation level of the five, realizing that even as Green Cicada Valley was competing with other sects for the inheritance of the Ji Hao Sect, they could still afford to send five people to intercept him— truly worthy of being one of the Nine Great Sects.<br/><br/>“Do you wish to die in your attempt to harm a Tai Yuan Sect Disciple?”<br/><br/>An icy shout suddenly came through, followed by Fang Wang feeling an immensely powerful aura sweeping in from the horizon. He turned his head to look and saw a figure atop a bolt of lightning, arriving with great speed. It was a handsome man garbed in the robes of a Tai Yuan Sect Disciple, wearing a purple crown with two strands of long hair beside his cheeks. His features were handsome and sharp, his eyes bright and spirited, a treasured sword at each side of his waist, and a golden ring floating behind him, emitting a faint golden light.<br/><br/>“Lu Yuanjun!”<br/><br/>A female Demonic Cultivator of Green Cicada Valley spat out the name through clenched teeth.<br/><br/>Upon hearing this name, Fang Wang’s eyes narrowed behind his mask.<br/><br/>Lu Yuanjun raced over on his lightning, stopping in front of Fang Wang, alone confronting the five Spirit Elixir Realm Demonic Cultivators. His right hand rested on his sword scabbard, his chin lifted slightly as he looked down on the five, saying, “The Da Qi Cultivation Realm is about to face great upheaval; I don’t wish to kill you, so as not to affect the cooperation between our sects.<br/><br/>At these words, the five Demonic Cultivators stopped, exchanging glances and silent communication with each other.<br/><br/>Fang Wang observed Lu Yuanjun’s silhouette, internally assessing the man’s aura.<br/><br/>Very strong!<br/><br/>Clearly, he was not in the same league as the five Demonic Cultivators in front of him!<br/><br/>Li Honggang couldn’t even compare!<br/><br/>Why had Lu Yuanjun come?<br/><br/>Fang Wang’s eyes flickered, his mind raced with numerous conjectures.<br/><br/>“I didn’t expect the Great Abyss Gate to send you out, fine, that’ll save Lu Yuanjun’s face for you, but if we encounter him next time, we certainly won’t let it go so easily!”<br/><br/>An elder from the Green Cicada Valley coldly snorted, and after speaking, swept his sleeve and left. The other four glared maliciously at Fang Wang for a moment before following the elder’s departure.<br/><br/>Their exit was quick, vanishing out of sight in less than three breaths’ time.<br/><br/>Lu Yuanjun turned to face Fang Wang, his expression warm and sunny as he smiled and said, “Junior Brother Fang, you truly possess great skill, killing a cultivator from the Spirit Elixir Realm while in the Soul Sculpting Realm. Since the dawn of the Great Abyss Gate, not a single disciple has been as powerfully unprecedented as you.”<br/><br/>Hearing Lu Yuanjun use his surname, Fang Wang understood that Guang Qiuxian had sent him.<br/><br/>The news of Fang Wang inheriting the White Garment Astonishing Swan’s thirty-sixth sword technique hadn’t spread. Although the Fang Residence was nearly annihilated by the cultivators under Lu Yuanjun, he did not assign anyone to monitor Fang Wang, probably fearing that making a big fuss over the matter.<br/><br/>Fang Wang spoke up, “Thank you, Senior Brother Lu, for the rescue.”<br/><br/>Lu Yuanjun waved his hand and said, “Those five fellows are the Five Poisons of the North from Green Cicada Valley, each of them is at the fifth to eighth level of the Spirit Elixir Realm. Don’t regard their fierce reputation too highly, for with Junior Brother Fang’s talent, in less than twenty years, no, perhaps in less than ten years, slaying them will be as effortless as butchering chickens and slaughtering dogs.”<br/><br/>His gaze on Fang Wang was full of admiration, and his smile grew even warmer.<br/><br/>It had to be said, if not for knowing the true background of the night the Fang Residence was destroyed, Fang Wang would genuinely believe that this senior brother was quite admirable, his words making Fang Wang feel comfortable and his eyes and expressions seeming genuine.<br/><br/>“Senior Brother exaggerates.”<br/><br/>“Hahaha, Junior Brother is modest, I understand, I understand. Let’s go, I’ll escort you back. These are the Sect Leader’s direct orders; once we return to the Great Abyss Gate, if you encounter any trouble in the future or want to learn something or need anything, just come to me at any time.”<br/><br/>Lu Yuanjun laughed heartily, his tone bold and generous.<br/><br/>Fang Wang feigned hesitation and said, “Senior Brother, may I not return for now? I’ve discovered a blessed land which might hide some secret. I want to study it for a while and return to the Great Abyss Gate in a few months.”<br/><br/>He refrained from mentioning Fang Hanyu, fearing that Lu Yuanjun would immediately request to go to the Fang Realm, as, after all, in terms of healing, the Great Abyss Gate would certainly be more convenient.<br/><br/>Talking about a fortuitous opportunity was an easier excuse to give.<br/><br/>For cultivators, opportunities mattered the most. Even among sect members, they wouldn’t disturb each other’s fortunes, a rule throughout the Cultivation World. Interfering with someone’s opportunity was as egregious as killing one’s parents, an unforgivable act that left no common ground.<br/><br/>Upon hearing this, Lu Yuanjun slightly furrowed his brows and asked, “Junior Brother, is that opportunity worthy of risking yourself?”<br/><br/>Fang Wang nodded.<br/><br/>Seeing this, Lu Yuanjun pulled a stack of Talisman Papers from his storage bag and casually tossed them to Fang Wang. The papers were bundled together by two red strings, so they didn’t scatter.<br/><br/>“These are high-quality talismans, just pour your Spiritual Power into them, and they will explode after three breaths. Their combined power can kill a Great Cultivator in the ninth level of the Spirit Elixir Realm, of course, you have to be close for it to work. Junior Brother possesses extraordinary strength and has your own strong will, so I won’t disturb you further. Take these, I will pursue and engage the Five Poisons of the North for a few days, preventing them from turning back to trouble you.”<br/><br/>After speaking, Lu Yuanjun turned and left, moving even faster than the Five Poisons of the North.<br/><br/>Very decisive!<br/><br/>Without any hesitation!<br/><br/>Fang Wang looked at the Talisman Papers in his hand, recalling Zhou Xue’s evaluation of Lu Yuanjun.<br/><br/>This person indeed possessed a charismatic personality, never one for empty words, just action. If not for the enmity with his family, Fang Wang would indeed owe him a debt of gratitude.<br/><br/>Fang Wang didn’t dwell on it further and continued to fly away using his Sword Control Technique.<br/><br/>In the following days, he didn’t fly directly to the Fang Realm but made a few large circles around the vicinity, spending several days tossing away the<br/><br/>Talisman Papers Lu Yuanjun gave him in a forest before finally rushing to the Fang Realm.<br/><br/>Late that night.<br/><br/>Fang Wang returned to the Fang Realm, opening the mountain gate mechanism and entering the cave passage.<br/><br/>Once the mountain gate closed, he settled down to rest directly in the cave corridor, to prevent Lu Yuanjun from discovering the Fang Realm.<br/><br/>Early the next morning, Qing Wan’er came to the cave corridor and, upon seeing his figure, was immediately overjoyed. She rushed over, asking, “Fang Wang, you’ve returned, did you win?”<br/><br/>Fang Wang opened his eyes and smiled, “I barely managed to win, but it took a great toll on me, so I rested here last night.”<br/><br/>Qing Wan’er surveyed him, marveling in amazement, “You’re truly impressive, defeating a Cultivator from the Spirit Elixir Realm after just one year of cultivation. Not to mention you, Fang Hanyu’s talent is also astonishing. Just what is the origin of your Fang Family?”<br/><br/>Hearing this, Fang Wang stood up, smiling as he asked, “Oh? Has Hanyu indeed perfected something?”\t\t\t\t\t\t</div>", "images": {}, "success": true}