{"id": 35, "url": "https://www.novelhall.com/i-became-an-immortal-on-mortal-realm-32879/14235207.html", "title": "Chapter 35 - Chapter 35: Chapter 33 Fang Family Trio 1", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 35 - Chapter 35: Chapter 33 Fang Family Trio 1</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 35: Chapter 33 Fang Family Trio 1<br/><br/>Translator: 549690339<br/><br/>Fang Hanyu’s talent is exaggerated?<br/><br/>When Zhou Xue spoke, Fang Wang didn’t question her, but instead felt full of expectation. After all, Fang Hanyu had fitted the Absolute Heart Evil Eye, a pair of eyes meticulously prepared by Green Cicada Valley, and Zhou Xue had mentioned that after the eye transplant, Fang Hanyu would be reborn from the ashes, his talent far surpassing that of his past self.<br/><br/>Even though he believed it, witnessing Fang Hanyu’s talent first-hand still shocked him.<br/><br/>At noon, Fang Wang and Fang Hanyu were sparring beside the lake.<br/><br/>A month had passed, and Fang Hanyu’s cultivation had improved by another level. Now, with his covering cloth removed and his figure darting back and forth, his eyes shone with blood-red light; because his movements were so fast, they seemed like two streaks of blood rapidly extending and moving, eliciting occasional exclamations from the demon beasts watching from a distance.<br/><br/>Fang Wang wasn’t fighting in earnest, just acting as a sparring partner. He felt Fang Hanyu’s reaction speed could now match that of the ninth level of the Qi Cultivation Realm.<br/><br/>Whenever he increased the intensity of his attacks, Fang Hanyu would adapt and keep up after a short while, but most importantly, he could quickly learn the sword techniques Fang Wang used.<br/><br/>Is this the Absolute Heart Evil Eye?<br/><br/>Fang Wang grew more interested in Fang Hanyu’s eyes, starting to perform the basic sword techniques of the Jinghong Divine Sword Art.<br/><br/>When he performed the Jinghong Divine Sword Art, it seemed as though he was directly condensing sword shapes, but it wasn’t that simple in reality. Normally, the Jinghong Divine Sword Art required sword techniques as guidance. It was because he had reached the Great Perfection Realm that he could integrate his knowledge and make it seem simple.<br/><br/>The sword technique for each strike of the Jinghong Divine Sword Art was different.<br/><br/>As Fang Wang’s sword techniques began to change, Fang Hanyu also started to imitate. Their movements were almost synchronized.<br/><br/>What did this mean?<br/><br/>It meant tnat rang Hanyu•s Insignt was extremely strong, especially ms eyes, which moved too fast, making it dizzying to watch.<br/><br/>Upon closer inspection, Fang Hanyu’s pupils were blood-red, and his eyeballs were green. At first glance, he appeared like a ferocious ghost, extremely terrifying.<br/><br/>It couldn’t be denied that after fitting the Absolute Heart Evil Eye, Fang Hanyu’s entire demeanor had changed, now more aggressive than before, giving Fang Wang the impression he was someone from a demonic cult.<br/><br/>A full half-hour passed.<br/><br/>Fang Hanyu stopped, half-kneeling on the ground, resting on his sword, breathing heavily, his back soaked with sweat by now.<br/><br/>Standing in front of him, Fang Wang looked down and asked, “How much have you learned?”<br/><br/>“I’ve memorized all of it, but haven’t fully mastered it yet,” Fang Hanyu gasped, lifting his eyes to meet Fang Wang’s, his expression spirited.<br/><br/>The sunlight shining on the two of them made Qing Wan’er feel somewhat dazed.<br/><br/>She had a premonition that in a hundred years, these two would be renowned throughout Da Qi.<br/><br/>Fang Wang extended his hand, and Fang Hanyu smiled, reaching out to grab it, and was pulled up.<br/><br/>“Your eyes are no simple matter. Apart from the boost in talent, the enhancement to your body is also massive.”<br/><br/>“Right, any movement I see seems very slow, and for some reason, I can remember everything after just one glance, with my body able to smoothly imitate the actions. The only issue is that I uncontrollably develop an urge to kill, which I’ll need to control in the future.”<br/><br/>“Incredible, with experiences and transformations like yours, you’d definitely be the protagonist in a story.”<br/><br/>“Protagonist?”<br/><br/>“Yes. From now on, you, Zhou Xue, and I will be the three protagonists of the Fang Family. Zhou Xue will be in charge of strategy and running the Fang<br/><br/>Family, you’ll be responsible for killing enemies, sweeping away all before us. A trio like this in stories can often achieve great things!”<br/><br/>“And what about you?”<br/><br/>“I’ll be responsible for being invincible.”<br/><br/>Though Fang Hanyu was left speechless, he felt exceedingly excited inside, feeling a sense of recognition.<br/><br/>The first batch of disciples from the Fang Family who started cultivation all followed Fang Wang and Zhou Xue. He had been a genius from the start of his martial training, but after beginning cultivation, he couldn’t catch up with the two of them and had always felt frustrated inside.<br/><br/>Fang Hanyu took a deep breath and said solemnly, “Fine! From now on, whoever the two of you want me to kill, I will kill, no questions asked!”<br/><br/>With green irises and red pupils, plus long hair slightly disheveled, even in broad daylight, Fang Hanyu had the aura of a ghost among men.<br/><br/>“Continue your training, and strive until you can achieve Spiritual Refinement.”<br/><br/>Fang Wang chuckled softly. He was in no hurry to return to the Great Abyss Gate, for the spiritual energy of Fang Realm was not inferior to that of his cave abode. It would be better to cultivate Fang Hanyu here. After returning to the Great Abyss Gate, Fang Hanyu could then train other Fang Family Disciples. With this, he would have a group of trustworthy and capable people at the Great Abyss Gate.<br/><br/>The next step was to focus on growth—to become stronger himself and to strengthen his kinsmen, and then challenge Lu Yuanjun!<br/><br/>Lu Yuanjun was not merely a genius, he was powerful in his own right, and undoubtedly, the power behind him was profound.<br/><br/>Thinking of this, Fang Wang was filled with fighting spirit.<br/><br/>Amidst the mountains and fields, an inn was situated by a big river. Cultivators were seen landing from time to time, and just as many were departing.<br/><br/>The inn was quite large, with three floors, and smoke from cooking rose in the air.<br/><br/>At the moment, in the center of the first floor, a scholar-dressed middle-aged man held a folding fan and spoke with passionate ardor: “In the battle at Haixia City, White Garment Astonishing Swan annihilated Li Honggang with a single sword strike, and his astonishing Sword Qi lingered long in the sky. His strike seemed to sever karmic ties but in reality, it ignited the pursuit of the Sword Dao among cultivators of the world!”<br/><br/>“A fox-faced man in white, astonishing as he rises among mortals!”<br/><br/>As his words fell, the surrounding cultivators cheered in unison, the exploits of the White Garment Astonishing Swan always stirring their blood.<br/><br/>At a corner table, Fang Yin, Fang Wang’s father, sighed, “White Garment Astonishing Swan is truly formidable. I didn’t expect the Cultivation World to be as thrilling as the martial world.”<br/><br/>Zhou Xue, sitting opposite him wearing a bamboo hat, smiled slightly and said, “White Garment Astonishing Swan is indeed formidable. With such a genius, the Great Abyss Gate could truly soar, and our Fang Family can also benefit from it.”<br/><br/>A curious young man beside them asked, “Sister, have you ever met the White Garment Astonishing Swan?<br/><br/>Zhou Xue shook her head and said, “How could I have the chance to meet someone like that? Enough about him. The name of White Garment Astonishing Swan has spread far and wide; we better be careful lest his enemies overhear us and think we’re related.”<br/><br/>The young man shrank his neck at those words, while the disapproving gaze of the elders was cast upon him.<br/><br/>“How much farther to Fang Realm?” asked Fang Yin.<br/><br/>Zhou Xue replied, “Before we go to Fang Realm, we need to visit another place first to prepare for the construction of Fang Realm and to enhance the Fang Family’s combat strength.”<br/><br/>Hearing this, the Fang Family members displayed no concern, instead showing eager anticipation. Since leaving Fang Residence under Zhou Xue’s leadership for several months, they were thoroughly convinced by her actions, and even the elders deferred to her.<br/><br/>Fang Yin let out a sigh, “It’s been a long time since I’ve seen that boy, Fang Wang. He’s always been full of ideas since he was young. I hope he doesn’t offend anyone at the Great Abyss Gate.”<br/><br/>The others consoled him, praising Fang Wang for being sensible.<br/><br/>Zhou Xue smiled and remained silent, quietly lifting her teacup and savoring the aroma.<br/><br/>At Fang Realm, by the lake.<br/><br/>Fang Wang was meditating, gathering Qi while keeping an eye on Fang Hanyu, who was facing the lake, cultivating. Spiritual energy formed a mist around him, gathering with the intention of shaping a dragon, but at this point, it looked more like a swollen python.<br/><br/>“The Absolute Heart Evil Eye is indeed formidable; this kid has already caught a glimpse of the threshold,” Fang Wang thought. No wonder Zhou Xue went to such lengths to collect so many eyes—it was truly powerful.<br/><br/>Had he not witnessed Fang Hanyu going mad, almost embarking on a killing spree, he might have been tempted to acquire a pair of Absolute Heart Evil Eyes himself.<br/><br/>rlkvvo months prior, one night while cultivating, Fang Hanyu suddenly succumbed to a Heart Demon, intending to slaughter the mythical creatures within Fang Realm. Fortunately, Fang Wang had stopped him in time, knocking him unconscious. Since then, Fang Hanyu had not been possessed again, but the incident left a seed of worry in Fang Wang’s heart.<br/><br/>What kind of Lifespirit Treasure will Fang Hanyu create after obtaining the ADS01ute Heart Evil Eyeg Fang wang was 100K1ng rorwara witn anticipation.<br/><br/>Five months had passed since his return to Fang Realm. Fang Wang’s cultivation had reached the fifth level of the Soul Sculpting Realm, while Fang Hanyu had reached the eighth level of the Qi Cultivation Realm and was about to break through to the ninth. Once he reached the ninth level of the Qi<br/><br/>Cultivation Realm, Fang Wang would take him back to the Great Abyss Gate.<br/><br/>Fang Wang believed that with his own talent, Guang Qiuxian should be able to accept Fang Hanyu and provide a way to suppress the Heart Demon.<br/><br/>After a while.<br/><br/>The mist dispersed from around Fang Hanyu, and he turned to Fang Wang, sighing, “Fang Wang, this technique is too difficult to master. How many levels have you reached? Can you show me?”<br/><br/>Fang Wang laughed and said, “Even if I show you, you won’t understand. This technique is quite extraordinary, after all, it’s a legacy of Ji Hao Sect. Stop prying; you wouldn’t want to frighten yourself..”\t\t\t\t\t\t</div>", "images": {}, "success": true}