{"id": 36, "url": "https://www.novelhall.com/i-became-an-immortal-on-mortal-realm-32879/14235214.html", "title": "Chapter 36 - Chapter 36: Chapter 34 Contribution Rankings_L", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 36 - Chapter 36: Chapter 34 Contribution Rankings_L</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 36: Chapter 34 Contribution Rankings_l<br/><br/>Translator: 549690339<br/><br/>Hearing Fang Wang’s words, Fang Hanyu pondered and chose to trust Fang Wang. The commotion caused by the Ji Hao Sect was too great; it was best for him to remain unaware to avoid trouble.<br/><br/>Fang Hanyu took a deep breath and then said, “Fang Wang, you are already seventeen years old, right? If you hadn’t started cultivation, Uncle Five would likely have celebrated your birthday for you.”<br/><br/>Fang Wang laughed and said, “We are pursuing eternal life, so why care about a birthday? In the future, we are going to live for a hundred, a thousand, or even ten thousand years. Only those anniversaries are worth celebrating.”<br/><br/>A smile appeared on Fang Hanyu’s face as he began to chat with him about the past.<br/><br/>Time passed quickly during their days at the Fang Residence.<br/><br/>Another month had gone by, and Fang Hanyu had reached the ninth level of the Qi Cultivation Realm. His rapid progress was proof enough of the power of the Absolute Heart Evil Eye, compelling Fang Wang to decide to return to the Great Abyss Gate.<br/><br/>Before leaving, Fang Wang reminded Qing Wan’er to go out as little as possible and wait for Zhou Xue to return.<br/><br/>The Fang Residence was now well-developed, with lakeside pavilions and many spiritual herbs and flowers planted along the cliff walls, and the Spiritual Energy was continuously increasing.<br/><br/>“Rest assured, we won’t act recklessly,” Qing Wan’er nodded and said. After the incident with Li Honggang, she decided to cultivate diligently and not always rely on others for protection.<br/><br/>Fang Wang didn’t say much and left with Fang Hanyu.<br/><br/>To conceal the Absolute Heart Evil Eye, Fang Hanyu put the white cloth strip back on, covering his eyes. He had cultivated spiritual sense and could perceive the world with it.<br/><br/>Thus, Fang Wang and he left the Fang Residence and flew away on a sword.<br/><br/>Along the way, Fang Wang considered teaching the White Rainbow Evasion<br/><br/>Technique, so he increased the speed, and Fang Hanyu did his best to keep up.<br/><br/>For cultivators, traveling from the western borders of the Da Qi Dynasty to the Great Abyss Gate only took a few days. The closer they got, the fewer demonic cultivators they encountered, and when they donned the robes of the Tai Yuan Sect Disciples, they met no trouble on the road.<br/><br/>Four days later.<br/><br/>The two of them returned to the Great Abyss Gate using their Disciple Tokens as a guide.<br/><br/>Upon returning to the Great Abyss Gate, they didn’t part ways. Fang Wang took Fang Hanyu straight to the main peak and visited the Sect Leader at the Shiyuan Hall.<br/><br/>“Come in.”<br/><br/>The doors to Shiyuan Hall opened, and the voice of Guang Qiuxian emanated from within.<br/><br/>Fang Wang and his companion immediately entered the hall. Inside, Guang Qiuxian was meditating on a cushion, eyes closed, seeming like a celestial Immortal with an aura of immortality and Daoist bones.<br/><br/>After Fang Wang paid his respects, he recounted Fang Hanyu’s experiences without any concealment, including the bestowal of the Absolute Heart Evil Eye by Zhou Xue. This was the result of his consultation with Zhou Xue, who had instructed him to tell the truth, as she had her ways to handle the situation.<br/><br/>Guang Qiuxian hadn’t listened for long before he opened his eyes, his brows furrowed and his gaze grew cold.<br/><br/>As the Sect Leader, how could he remain indifferent to the torture his disciple had endured?<br/><br/>After Fang Wang finished speaking, Guang Qiuxian slowly said, “The Absolute Heart Evil Eye, like the Heavenly Gang Sheng Ti Zhen Gong, was created by the ancients based on primordial physiques and possesses the effect of defying fate. Green Cicada Valley has had the cultivation method for the Absolute Heart Evil Eye for a century but never succeeded. I didn’t expect you to succeed. It seems the mastermind behind Zhou Xue is no ordinary person.”<br/><br/>“In a lifetime of cultivation, apart from the sect, one needs the help of many benefactors. The Great Abyss Gate respects the fortuity of every disciple. The Absolute Heart Evil Eye is considered part of the Demonic Path, but it doesn’t entirely belong to Green Cicada Valley.”<br/><br/>Guang Qiuxian waved his sleeve and a Jade Slip flew out, landing in Fang<br/><br/>Hanyu’s hands. He said, “This is my decree. Go to the Cultivation Technique Hall and retrieve the Clear Heart Mantra to effectively suppress your innate urge to kill.”<br/><br/>Fang Hanyu quickly nodded and said, “Thank you, Sect Leader.”<br/><br/>“From now on, continue to cover your eyes to avoid unnecessary trouble. And I’m not talking about simply being ostracized by fellow disciples, but rather being discovered by Green Cicada Valley. You must understand that there will always be spies from the Demonic Path within the righteous sects,” Guang Qiuxian warned.<br/><br/>Fang Hanyu acknowledged with a nod and saw Guang Qiuxian wave his hand as a sign to leave, and so he paid his respects and took his leave.<br/><br/>Only Fang Wang and Guang Qiuxian remained in the hall.<br/><br/>Guang Qiuxian showed a smile, no longer maintaining the formal demeanor of the Sect Leader. He glared at Fang Wang and huffed, “You scoundrel, just one year since you joined and already you’ve stirred up so much trouble. I sent Lu Yuanjun to pick you up, yet you didn’t return?”<br/><br/>Fang Wang replied helplessly, “Sect Leader, I had no choice. When my clansmen are suffering, I cannot simply ignore them.”<br/><br/>“White Garment Astonishing Swan, what a prestigious name, even grander than when Lu Yuanjun rose to fame,” the Sect Leader said with evident joy. “As the Sect Leader, I’m naturally thrilled. Your reputation will benefit the Great<br/><br/>Abyss Gate. However, from a personal standpoint, I hope you won’t be reckless. Concentrate on your cultivation. Too many talents perish early, and only those who survive can become the powerhouses of their time.” Guang Qiuxian spoke earnestly.<br/><br/>Fang Wang nodded and replied, “Thank you for the guidance, Sect Leader.” He then planned to spend time accumulating his cultivation level.<br/><br/>He then planned to spend time accumulating his cultivation level.<br/><br/>“The Astonishing Swan Thirty-Six Sword techniques, tsk tsk, you’ve already surpassed your master, hahaha. When you see your master next time, you should try to please him. He’s a bit petty. Back when I was chosen as Sect<br/><br/>Leader, he was upset for a very long time, ignoring me for ten full years…”<br/><br/>Guang Qiuxian began to share his past with Yang Yuanzi, painting him as a petty and straightforward junior brother.<br/><br/>Fang Wang listened intently, all the while analyzing the true relationship between the two.<br/><br/>After a long time,<br/><br/>Once Guang Qiuxian had said his piece, still seemingly having more to say,<br/><br/>Fang Wang asked, “Sect Leader, who is Brother Lu’s master? Is he a Peak<br/><br/>Master of a lineage?”<br/><br/>Guang Qiuxian stroked his beard and said with a smile, “Lu Yuanjun has two masters. One is the Peak Master of a lineage, and the other is me. What about<br/><br/>Fang Wang said with a smile, “After meeting Brother Lu, I found him to be truly a good person. I’m certain he can become a great Sect Leader in the future. However, Sect Leader, you also wish to groom me as the next Sect Leader, which leaves me in a difficult position.”<br/><br/>He was probing.<br/><br/>Guang Qiuxian responded with a smile, “To become Sect Leader, it takes more than just being a good person. A capable Sect Leader must withstand intense competition, be powerful enough to command respect, and have the ability to lead. If you wish to compete, I can privately offer you more support than Lu Yuanjun. But you need prestige; at the very least, the disciples of the sect must believe you have the qualifications to contend with him. When the entire Great Abyss Gate feels that you are more suitable than Lu Yuanjun to be the Sect<br/><br/>Leader, that will be the time for me to concede the position to you.”<br/><br/>“You don’t have to worry about your relationship with Lu Yuanjun. A sect cannot have only one strong individual. Losing the position of Sect Leader doesn’t mean a complete fallout. Just like your master and me, regardless of who wins or loses, both of you are pillars of the next generation within the Tai<br/><br/>Yuan Sect.”<br/><br/>Guang Qiuxian gave many instructions and also imparted his experience on how to vie for the position of the chief disciple.<br/><br/>Half an hour later,<br/><br/>Fang Wang left Shiyuan Hall and flew towards the Sect’s Main City.<br/><br/>Along the way, he pondered Guang Qiuxian’s words. Although Guang Qiuxian appeared to be supportive, he was in fact instilling a concept – no matter the competition, keep the harmony. This indicated that Lu Yuanjun held significant weight in Guang Qiuxian’s mind. Even if Fang Wang was the Heaven Yuan Spirit Treasure, Guang Qiuxian was reluctant to give up on Lu Yuanjun.<br/><br/>From a disciple’s perspective, such a Sect Leader would be admirable. However, for Fang Wang’s standpoint, it was a major obstacle, for it was impossible for him to be amicable with Lu Yuanjun!<br/><br/>If it wasn’t for Zhou Xue’s rebirth, he, lacking the Sword Control Technique, would have surely fallen in a desperate battle, perishing on the night his residence was destroyed, along with everyone in the Fang Residence. He could not dispel the resentment in his heart until this vengeance was avenged.<br/><br/>Fortunately, Fang Wang had long known that the destruction of his home was orchestrated by Lu Yuanjun. Otherwise, he might have been tormented by Lu Yuanjun’s warmth.<br/><br/>He contended for the position of the chief disciple not for power but to surpass Lu Yuanjun. When the day came for him to draw his sword on Lu Yuanjun, the entire sect would have no choice but to silently acknowledge or tolerate it!<br/><br/>Upon entering the city, Fang Wang flew towards the Task Hall.<br/><br/>The Task Hall was the liveliest place in the city, a nine-story building bustling with disciples coming and going.<br/><br/>Fang Wang sheathed his sword, disembarked, and entered the Task Hall; he was there to hand in the head of Li Hongshuang.<br/><br/>Within the Great Abyss Gate, aside from the basic treatment for disciples, if one wished to improve their cultivation abode, obtain Cultivation Techniques, elixirs, Magic Artifacts, etc., it all depended on contribution. Contributions were earned through various tasks, ranging from slaying great Demonic Cultivator leaders to cultivating medicinal herbs. Different tasks had different contribution values, as recorded in the cultivation guidelines.<br/><br/>Even the most talented disciples needed to complete tasks continually to build their reputation, especially since higher-ranking advancements were greatly influenced by contributions.<br/><br/>In the process of completing tasks, disciples would increasingly bind their loyalties to the sect; even if they were spies from the Demonic Path, killing too many Demonic Cultivators for the sect would make their return difficult.<br/><br/>Entering the main hall, he was greeted by the spaciousness of the grand chamber. As soon as he walked in, he saw ten pillars, nine of which encircled a central, massive column. Each pillar displayed glowing characters, the names and contribution scores of the disciples.<br/><br/>The Contribution Columns recorded the contribution rankings of the disciples from each lineage, including elders. The massive central column was the overall contribution ranking of the entire Great Abyss Gate. Those who were listed on the main column were the strong members of the sect.<br/><br/>The presence of the Contribution Columns also served as a means to elevate the reputation of diligent disciples so their silent contributions wouldn’t remain unrecognized..\t\t\t\t\t\t</div>", "images": {}, "success": true}