{"id": 49, "url": "https://www.novelhall.com/i-became-an-immortal-on-mortal-realm-32879/14238306.html", "title": "Chapter 49 - Chapter 49: Chapter 47 Have You Ever Heard Of The Great Saint’S Heaven Subjugation?_L", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 49 - Chapter 49: Chapter 47 Have You Ever Heard Of The Great Saint’S Heaven Subjugation?_L</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 49: Chapter 47 Have You Ever Heard of the Great Saint’s Heaven Subjugation?_l<br/><br/>Translator: 549690339<br/><br/>A period of time equivalent to one tea session later, Fang Wang set down the Spiritual Refinement Classic.<br/><br/>The difficulty of making a temporary Heavenly Dao Spirit Stone was quite high, requiring some special materials. It was better to find a place where Spiritual Energy was so abundant that it formed a whirlwind, then by setting up a special Formation, it would be possible to create an effect comparable to that of the Heavenly Dao Spirit Stone.<br/><br/>With his eidetic memory, Fang Wang noted down some key points and then got up to take action.<br/><br/>Before coming, he had exchanged for the largest capacity storage bag at the Great Abyss Gate, specifically for collecting as many Heavenly Materials and Earthly Treasures as possible on this journey.<br/><br/>He descended into the forest below the cliff, and upon landing, he was attracted by some brightly colored flowers and fruits. He took out the catalog of natural treasures given to him by Gu Li. Regarding this book, he had only memorized the patterns and specific page numbers, not the detailed contents of each page.<br/><br/>He flipped directly to a certain page and then made a comparison.<br/><br/>“Luhuang fruit, good for enhancing one’s vitality and energy. Not bad, I’ll take it.”<br/><br/>Fang Wang thought contentedly to himself. To have a find at the very start, he followed the tips in the catalog of natural treasures, avoiding the poisonous thorns of the surrounding weeds and easily picking the Luhuang fruit.<br/><br/>On the rest of his journey, Fang Wang’s pace wasn’t fast; it was as if he was taking a leisurely stroll through the forest.<br/><br/>This was his first time collecting Heavenly Materials and Earthly Treasures, so he was quite excited, feeling like he was playing an adventure game.<br/><br/>In this life, aside from Cultivation, it was all about traveling. He had never really relaxed. Considering his actual age, he had lived for over a thousand years, and most of that time had been like being in jail. If he didn’t relax properly, he feared that he might develop a Heart Demon.<br/><br/>This forest was vast, with trees taller than those in the outer world and denser undergrowth. Some of the bushes were even taller than Fang Wang himself.<br/><br/>An hour later, Fang Wang had already gathered quite a bit, but they could only be considered good materials, not reaching the level of Heavenly Materials and Earthly Treasures.<br/><br/>To break through to the Spirit Pill realm, some special Heavenly Materials and Earthly Treasures were needed, and they also had to be of a particular attribute. During the breakthrough process, the more attribute-specific Spiritual Power absorbed from these materials and treasures, the stronger the created Spirit Pill would be, and it would also transform one’s own attribute of Spiritual Power.<br/><br/>In Zhou Xue’s Spiritual Refinement Classic, she cautioned Fang Wang against focusing on fire attributes and instead advised collecting Heavenly Materials and Earthly Treasures of all five elements to balance his Spiritual Power attributes. Although she didn’t explain why, Fang Wang was willing to trust her.<br/><br/>Perhaps focusing on particular attributes of Spiritual Power could make a Cultivator stronger in the earlier stages, but to become an immortal, one certainly had to reach the level of natural harmony between heaven and earth—which meant the unity of the five elements.<br/><br/>To combine the five elements is to give birth to even more properties.<br/><br/>Suddenly.<br/><br/>Fang Wang stopped in his tracks, faintly hearing the sound of a woman crying. As a Cultivator, he was not one to have auditory hallucinations.<br/><br/>The women capable of entering the Great Saint’s Grotto-Heaven wouldn’t cry so easily, would they?<br/><br/>Could it be a demon from the Great Saint’s Grotto-Heaven playing tricks?<br/><br/>Fang Wang was not apprehensive; instead, he felt some anticipation. Demons also cultivated, and some Great Demons could even cultivate a Demon Core. A Demon Core was also a treasured item that Cultivators could use when condensing a Spirit Pill.<br/><br/>He immediately headed toward the source of the sound, simultaneously cultivating his White Rainbow Evasion Technique to make his aura disappear.<br/><br/>As he advanced, the mysterious crying of the woman became clearer and clearer. Gradually, Fang Wang sensed Demonic Qi.<br/><br/>It was undoubtedly a demon!<br/><br/>Yet the distance between him and the creature was greater than he had expected.<br/><br/>After traveling several dozen miles, Fang Wang saw the end of the forest. He began to slow down and move through the branches.<br/><br/>It was obvious that the crying sound was intentionally made to lure him here.<br/><br/>Fang Wang’s right hand gripped the hilt of his Qingjun Sword; his movements were as agile as a monkey yet as light as a wild goose, not making a single sound.<br/><br/>He arrived at the edge of the forest, using the dense leaves as cover, and looked towards the open area beyond. Ahead lay a hillside sparsely vegetated and strewn with rocks of various sizes.<br/><br/>His gaze quickly locked onto a figure halfway up the hillside—that of a woman in white standing on a cliff, disheveled, preventing a clear view of her face. She was holding a Green Snake in her right hand, which was continually emitting the sorrowful cries like that of a woman.<br/><br/>Fang Wang frowned. The Green Snake emitted an extremely strong Demonic Qi, the strongest he had ever felt. As for the woman in white, she emitted no aura at all; if one closed their eyes, they wouldn’t be able to sense her presence.<br/><br/>The woman in white stood motionless; the Green Snake in her hand trembled slightly, and the whining sounded even more pitiable—just by listening, one could easily imagine a delicate and wronged woman weeping quietly.<br/><br/>Fang Wang was unable to gauge the strength of the woman in white and thus dared not act rashly.<br/><br/>He observed patiently and soon noticed a deep yellow rock embedded in the mountainside behind the white-clothed woman.<br/><br/>Earth Element Ore!<br/><br/>A heavenly material and earthly treasure for forging magic artifacts and condensing spirit pills, the Earth Element Ore harbors an extremely high concentration of earth-attributed spiritual energy, and the ore is far larger than it appears—it could very well be that this entire mountain is made of Earth Element Ore.<br/><br/>Fang Wang began to ponder, he must find a way to cut off a piece.<br/><br/>If only someone would emerge and test the waters!<br/><br/>Just as this thought surfaced, a swooshing sound broke the silence, startling Fang Wang into a focused gaze. From another direction, a flying sword shot out of the woods and streaked towards the woman in white with incredible speed.<br/><br/>So fast!<br/><br/>This was even faster than Xu Lang’s sword!<br/><br/>In the blink of an eye, the flying sword reached the woman in white, and suddenly came to a halt mere five centimeters from her head. The sword blade trembled but could not move any further.<br/><br/>Swoosh—<br/><br/>A figure sprang from the woods, a young man clad in black garments. Fang Wang instantly recognized him as a cultivator from the Suspended Vast Sword Sect.<br/><br/>The disciples of the Suspended Vast Sword Sect wear black robes with a sword pattern embroidered on the back, and the number of swords signifies the disciple’s rank. The man bore five swords, indicating he was a direct disciple of the Suspended Vast Sword Sect.<br/><br/>The man in black leapt forward, grabbed the hilt of his flying sword, and raised his left hand, flicking two fingers. A sword qi shot out, instantly striking the woman in white, piercing through her body, and then hitting the Earth Element Ore behind her, causing shards to fly in all directions.<br/><br/>The man in black tried to leap away with his sword, but found he couldn’t lift the flying sword at all. An invisible force had fixed his sword in place, causing his complexion to drastically change.<br/><br/>He leaped away fiercely, abandoning the flying sword. Midair, his hands moved swiftly to cast spells. Rings of sword qi enveloped him and shot up into the sky. His right hand pointed towards the heavens, and the sword qi followed the direction of his fingertips to quickly condense into a colossal sword qi, fifty feet in length.<br/><br/>As the saying goes, “easier said than done,” but the whole process was over in the blink of an eye!<br/><br/>The man in black used his palm as if it were a sword, slashing towards the woman in white. The giant sword qi crashed down like a heavenly punishment, striking the woman in white.<br/><br/>The mountains trembled violently as sword qi spilled out in every direction, like wind blades rampaging across the landscape, slicing even the peripheral trees with deep gashes.<br/><br/>Fang Wang’s pupils suddenly dilated, and the man in black turned as pale as death. They saw his sword qi hovering above the woman’s head, unable to fall.<br/><br/>The woman in white slowly lifted her head, revealing a ghastly pale face. Her features were undeniably beautiful enough to topple empires, but her skin was so pale it sent chills down one’s spine, and her eyes were numb, as still as dead water.<br/><br/>Suddenly, she let go of the Green Snake in her hand. The snake fell to the ground, and as it tried to escape, she stepped on it. The snake’s body twitched and then lay still.<br/><br/>Feeling an intense killing intent, the man in black immediately turned and fled.<br/><br/>With sword qi clinging to his body like a flying sword tearing through the sky, he rapidly disappeared on the other side of the woods, while the woman in white floated up and vanished on the spot.<br/><br/>Now was his chance!<br/><br/>Fang Wang immediately moved, transforming into a White Rainbow, and swiftly arrived at the edge of the cliff. He swung his sword to cut off a piece of the Earth Element Ore from the cliffside and threw it into his storage bag.<br/><br/>Before leaving, he glanced at the half-dead Green Snake on the ground, hooked it with his foot, grabbed the snake’s head with his left hand to prevent it from biting, and took off with it on his flying sword.<br/><br/>To prevent the woman in white from catching up, Fang Wang immediately used the White Rainbow Evasion Technique, fleeing at full speed.<br/><br/>Fang Wang felt a thrill of excitement in his heart, having stumbled upon such great fortune just upon arrival, heaven was truly aiding him.<br/><br/>The Earth Element Ore could be used as one of the materials for spirit pills, and the Green Snake in his hand had an astonishing amount of demonic qi—perhaps it contained a demon core. He needed to find a place to dissect it and check!<br/><br/>Fang Wang’s White Rainbow Evasion Technique was incredibly fast, and he sped over a hundred miles. He even encountered two disciples from other sects along the way, who were so startled by Fang Wang’s speed that they too fled in different directions.<br/><br/>After escaping for two hundred miles, Fang Wang finally slowed down. He looked around for a suitable place to rest.<br/><br/>Just then, Fang Wang felt a chill run down his spine, followed by a cold voice that entered his ears:<br/><br/>“Have you ever heard of the Great Saint’s Heaven Subjugation?”<br/><br/>He turned his head to look, and to his surprise, the woman in white was behind him, not even three meters away.<br/><br/>An exceedingly dangerous proximity!\t\t\t\t\t\t</div>", "images": {}, "success": true}