{"id": 44, "url": "https://www.novelhall.com/i-became-an-immortal-on-mortal-realm-32879/14237118.html", "title": "Chapter 44 - Chapter 44: Chapter 42: Battle The Spirit Elixir Realm", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 44 - Chapter 44: Chapter 42: Battle The Spirit Elixir Realm</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 44: Chapter 42: Battle the Spirit Elixir Realm<br/><br/>Ninth Level 1<br/><br/>Translator: 549690339<br/><br/>Five disciples?<br/><br/>Fang Wang raised his eyebrows, curious. Other than him, Zhou Xue, and Gu Li, were there two more disciples with Earth Origin Spirit Treasures?<br/><br/>This piqued his interest in the upcoming battles.<br/><br/>After Zhou Xue was switched out, the Second Vein lost another match, and their Peak Master gave up their rights without sending the last two competitors.<br/><br/>By evening, finally, a vein peak challenged the Third Vein, but this time, Yang Yuanzi took over the conversation from Li Yu and had other disciples go first, saving Fang Wang for the end.<br/><br/>This arrangement aimed to allow Fang Wang to recover to his peak state as much as possible, while also giving the other disciples an opportunity to showcase their abilities.<br/><br/>The other competing disciples from the Third Vein all smiled; they too were worried that Fang Wang alone would block all opponents, leaving them no chance to fight.<br/><br/>The Nine Veins Combat Method was about fighting for the glory of the vein peaks, and the number of individual victories mattered for the upcoming grand opportunities; everyone wanted to take a chance.<br/><br/>Zhou Bo was the first to go, lasting a hundred rounds before being defeated, fortunately without severe injuries. The second on stage was the eldest senior brother, Li Yu. With the cultivation of the Spirit Elixir Realm Seventh Level, he won three consecutive matches before being defeated.<br/><br/>Li Yu’s performance didn’t surprise the disciples from the various veins; they all felt it was to be expected. The Peak Masters, however, sighed lightly, feeling somewhat disappointed in Li Yu.<br/><br/>Fang Wang knew that Li Yu was already over two hundred years old and was still at the Spirit Elixir Realm, which was enough to prove his ordinary talent.<br/><br/>The third to go up was Gu Li. The disciple who had defeated Li Yu was replaced by the opposing Peak Master. Relying on her Earth Origin Spirit Treasure and the Gu Family’s inherited Five Sacred Sword Technique, Gu Li dazzled the entire city. Even with a Soul Sculpting Realm cultivation, she defeated an opponent at the Spirit Elixir Realm First Layer.<br/><br/>Each vein has its inherited cultivation techniques and spells, but disciples from families like Gu Li’s have their own techniques and legacies. They were inducted into the Great Abyss Gate more for the resources held by the Nine Great Sects.<br/><br/>Among the disciples who had previously taken the stage, many were sword cultivators, but none were as pure as Gu Li. With her brilliant Five Sacred Sword Technique, Gu Li’s name began to spread.<br/><br/>The opponents that followed were all below the Spirit Elixir Realm Second<br/><br/>Layer and even included disciples from the Soul Sculpting Realm, making Fang Wang suspect that Yang Yuanzi had signaled the other side.<br/><br/>After winning three consecutive matches, Gu Li was switched out. The subsequent battles had both wins and losses, but in the end, the Third Vein maintained its current ranking, which made the other vein disciples realize that the Third Vein was truly rising.<br/><br/>In the following three days, Fang Wang did not make an appearance, and the other disciples had all taken their turn. They were challenged in turn by the vein peaks ranked lower, and ultimately, the Third Vein stabilized their ranking.<br/><br/>The fights in these three days were very exciting, essentially the battles of the top five vein peaks. Surprisingly, the Second Vein also produced a genius with an Earth Origin Spirit Treasure who was at the Spirit Elixir Realm.<br/><br/>His name was Ye Xiang, who had been inducted for fourteen years and did not participate in the previous Nine Veins Combat. He had not taken part in the earlier battles, so his fame was not yet prominent. This time, however, with seven consecutive victories, he became famous throughout the Great Abyss Gate.<br/><br/>He represented the Second Vein in securing the second place, unable to defeat the First Vein but unbeaten by the following vein peaks.<br/><br/>The First Vein’s fight against the Second Vein was a complete sweep, and the Second Vein’s battle against other vein peaks also showed a sweeping momentum…<br/><br/>On the morning of the sixth day, another vein peak challenged the First Vein, and this time it was Lu Yuanjun who acted.<br/><br/>Lu Yuanjun achieved nine consecutive victories, each battle ending within two moves. He didn’t even move his feet and seemed more at ease than Fang Wang, although his opponents were stronger than those Fang Wang faced.<br/><br/>Even though Lu Yuanjun won quickly, his opponents were almost unharmed, merely quickly sealed and forced to give up helplessly.<br/><br/>Thus, Lu Yuanjun also secured nine victories, locking in a spot among the final nine. Afterward, he no longer participated, allowing other disciples to take action.<br/><br/>At noon on the same day, as soon as the battles between the two veins ended, Yang Yuanzi instantly spoke up, “The Third Vein challenges the First Vein!” The moment these words were spoken, the entire city was energized!<br/><br/>The Third Vein, lying dormant for several days, was finally making a push for a higher ranking, and this time they were directly challenging the top-ranked First Vein!<br/><br/>The disciples watching the battle were not just anticipating the Third Vein’s performance but Fang Wang’s participation. Facing the strongest ranked First Vein, the Third Vein was bound to send out Fang Wang; otherwise, they stood no chance!<br/><br/>“Fang Wang, you go first,” Yang Yuanzi ordered directly.<br/><br/>Fang Wang nodded and walked to the edge of the platform, encouraged by his fellow sect members. His heart was ablaze with excitement. The First Vein was filled with experts, and the one he wanted to challenge most was Lu Yuanjun, to see how big the gap between himself and Lu Yuanjun was.<br/><br/>However, at that moment, the entire city erupted into an uproar as a figure from the First Vein leaped onto the combat platform. “How could it be him!”<br/><br/>Li Yu exclaimed in a voice filled with dismay.<br/><br/>Fang Wang looked intently and saw a man in blue standing on the combat platform. His long hair was casually tied with a straw rope, and though his features were handsome, the stubble on his face gave him an unkempt appearance, exuding a carefree demeanor.<br/><br/>“Xu Lang, Spirit Elixir Realm Ninth Level, a Top-Grade Mysterious Elemental<br/><br/>Spirit, was once the most outstanding disciple next to Lu Yuanjun in the First Vein, and the former number one genius of the Great Abyss Gate. He stepped down after losing to Lu Yuanjun. Brother Fang, you must be careful!” Zhou Bo quickly explained, briefly introducing the other party’s background.<br/><br/>Spirit Elixir Realm Ninth Level!<br/><br/>Far from being intimidated, Fang Wang felt a surge of excitement within.<br/><br/>Bring it on!<br/><br/>He leaped gracefully like a white crane, lightly landing on the combat stage.<br/><br/>Xu Lang rested his hand on the bamboo stick at his waist, tilted up his chin with a scornful look towards Fang Wang, and laughed, “Junior brother Fang, Lu Yuanjun said you are very strong. I hope you won’t disappoint me.”<br/><br/>Fang Wang raised his right arm, and the Heavenly Palace Halberd materialized in the palm of his hand. Grasping it in his flow, he replied, “I will certainly do my utmost, but I also hope that Senior brother Xu won’t blame this junior if you happen to be defeated by me.”<br/><br/>The thirty-two Golden Mirrors not only reflected the images but also carried the voices of the fighters on stage to the audience, and everyone could sense the tension in their dialogue.<br/><br/>A female disciple from the First Vein, smiling, said to Zhou Xue, ‘Your clansman is quite confident.”<br/><br/>Zhou Xue laughed, “He’s only nineteen, at the peak of his vigor. If not confident now, when will he be?”<br/><br/>Nineteen!<br/><br/>The faces of the disciples from the First Vein changed slightly, except for Lu Yuanjun, who maintained his smile, seeming to look forward to Fang Wang’s performance.<br/><br/>In response to Fang Wang’s domineering reply, Xu Lang snorted coldly and drew a long sword from within the bamboo stick.<br/><br/>Without another word, Xu Lang threw the bamboo sword with a flash of cold light. Its speed was not only comparable to Fang Wang’s earlier throw of the Heavenly Palace Halberd but even faster!<br/><br/>Fang Wang’s eyes focused as he shot the Heavenly Palace Halberd from his hand like a cannon, its roaring noise tearing through the air, heading straight to meet the attack.<br/><br/>Boom!<br/><br/>At the moment of collision, the bamboo sword burst forth with an incredibly powerful Sword Qi that shook the combat stage!<br/><br/>Almost simultaneously, Fang Wang and Xu Lang stepped forward; even though Fang Wang used Shadowless Step, as he gripped the Heavenly Palace Halberd, Xu Lang also grabbed the hilt of his bamboo sword, and noteworthy was the farther distance Xu Lang covered.<br/><br/>Both holding their weapons, Fang Wang swung his halberd with great force and weight. Xu Lang, nimble, dodged and took to the air, inverting his grip to slash his sword at Fang Wang.<br/><br/>The two engaged in a fierce close combat, with the sounds of halberd striking sword echoing incessantly, blades flashing, cold light shining.<br/><br/>They moved too fast, interweaving within a radius of fifteen feet, and the disciples below the Spirit Elixir Realm couldn’t see clearly; this made the whole city fall silent, with the audience anxious not to miss a single moment.<br/><br/>Disciples from the Third Vein were anxious for Fang Wang, while those from the First Vein were surprised.<br/><br/>“Senior brother Xu is wielding a Top-Grade Magic Artifact, obtained in exchange for a million contributions!”<br/><br/>“This shows that Fang Wang’s Lifespirit Treasure must be of high grade, likely an Earth Origin Spirit Treasure.”<br/><br/>“It’s surely an Earth Origin Spirit Treasure, just compare it to Ye kiang!”<br/><br/>“To fight at nineteen against the ninth level of the Spirit Elixir Realm… And bear in mind Xu Lang is not ordinary; he’s also a genius.”<br/><br/>“No wonder Lu Yuanjun said he’s stronger than any of us. Pity such a genius didn’t join our First Vein.”<br/><br/>Zhou Xue watched Fang Wang’s performance, her lips slightly raised, with her eyes reflecting only his silhouette.<br/><br/>Boom!<br/><br/>Xu Lang unleashed an even stronger Sword Intent, slashing with his sword and generating over a hundred streaks of Sword Qi that swept toward Fang Wang like a storm, with a tremendous might.<br/><br/>Fang Wang planted the Heavenly Palace Halberd into the ground with one hand, erupting Solaris Spiritual Power to form an invisible barrier for defense. His robe billowed violently, yet his posture remained unshakable, exuding an air of unyielding resolve. As the Sword Qi collided, a wall of Qi shot up instantaneously, reaching a height of thirty feet – a truly magnificent sight.<br/><br/>Xu Lang leaped into the air, gripping the bamboo sword with his right hand while his left hand summoned his Lifespirit Treasure, also a sword, but one without a blade. Inverting his hold on the hilt, one could vaguely discern the outline of the sword blade under the sunlight.<br/><br/>Fang Wang looked up, Solaris True Fire aflame in his eyes. His right hand ignited with Solaris True Fire, rapidly covering the Heavenly Palace Halberd; releasing his grip, he then kicked the butt of the halberd fiercely. The halberd, ablaze with roaring flames, spun through the air. As the blade turned downward, he quickly grabbed the shaft, lifting it to strike upwards.<br/><br/>Majestic Solaris True Fire transformed into a mighty dragon soaring to the sky!<br/><br/>The entire sequence happened in the blink of an eye, dazzling to behold.. Before Xu Lang could make his move, a massive fire dragon had already appeared before him, the Dragon Head several times larger than his entire body!\t\t\t\t\t\t</div>", "images": {}, "success": true}