{"id": 43, "url": "https://www.novelhall.com/i-became-an-immortal-on-mortal-realm-32879/14237117.html", "title": "Chapter 43 - Chapter 43: Chapter 41 Highly Skilled_L", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 43 - Chapter 43: Chapter 41 Highly Skilled_L</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 43: Chapter 41 Highly Skilled_l<br/><br/>Translator: 549690339<br/><br/>The disciple from the sixth vein who stepped forward first was a male, with the cultivation of the Spirit Elixir Realm. After landing, he raised his hand and offered up a little tower that burst into rings of red light.<br/><br/>“My name is Qu Xiao, let me test your strength!”<br/><br/>The male disciple said coldly, holding the tower in his right hand while casting spells with his left, infusing spiritual power into the small tower.<br/><br/>Fang Wang, with the Heavenly Palace Halberd in hand, nodded toward Qu Xiao.<br/><br/>Should he give his opponent a chance to show off?<br/><br/>Forget it!<br/><br/>There’s no time!<br/><br/>There are still eight more from the sixth vein!<br/><br/>Having thought it through, Fang Wang once again loosened his right hand, preparing to use the Sword Control Technique.<br/><br/>Qu Xiao had already witnessed the terrifying speed of the Heavenly Palace Halberd, so he immediately leaped backward, his small tower emitting countless red rays to set up a net between him and Fang Wang.<br/><br/>A smirk appeared on Fang Wang’s lips as he charged forward, stepping once and immediately being enveloped in a fiery aura that quickly gathered behind his head to form three fireballs. Both the blade and the tail end of the Heavenly Palace Halberd were ignited with Solaris True Fire as well.<br/><br/>At this moment, Fang Wang seemed possessed by a fire god, startling disciples within the main city who watched in astonishment.<br/><br/>Faced with Qu Xiao’s net, he raised the Heavenly Palace Halberd, his speed suddenly increasing as if he were a streak of fire stretching at an incredibly fast rate, penetrating through the countless red light beams.<br/><br/>When the Heavenly Palace Halberd reached Qu Xiao, the numerous red rays behind Fang Wang were dissipating, with the flames of the Solaris True Fire still hanging in the air.<br/><br/>“How is this possible!”<br/><br/>Qu Xiao’s eyes widened in disbelief; he had mentally prepared himself, but only when facing the Heavenly Palace Halberd did he truly feel the terror of its pressure.<br/><br/>In his eyes, the blade of the Heavenly Palace Halberd was drawing ever closer, soon to occupy his entire pupil.<br/><br/>He immediately raised the small tower in his hand, its doors swinging open as talisman papers flew out, rapidly enlarging and then igniting to form a spectacular sea of fire.<br/><br/>However, the sea of fire had barely formed before it was shredded by a mighty surge of energy, the Heavenly Palace Halberd hitting Qu Xiao’s small tower with an unstoppable force.<br/><br/>Boom!<br/><br/>Qu Xiao was sent flying by a formidable energy blast he couldn’t describe, slamming into the formation’s light barrier and losing consciousness the moment he spat blood.<br/><br/>Fang Wang halted his advance, extending his right hand forward, his palm less than ten centimeters from the tail blade of the Heavenly Palace Halberd.<br/><br/>The fireballs behind Fang Wang absorbed the sky-full of flames, resembling a massive cloak of fire. The scorching waves of heat swept in all directions across the combat stage.<br/><br/>“The third vein, Fang Wang wins!”<br/><br/>Greedy Sleeper shouted out loud, announcing Fang Wang’s name this time also as a mean to promote his fame within the Great Abyss Gate.<br/><br/>Another move!<br/><br/>A louder buzz than before arose in various areas of the main citv. Fang Wang standing on the combat stage and hearing exclamations from everywhere.<br/><br/>“So strong! It ended in one move!”<br/><br/>“That brother from the sixth vein is definitely powerful, you can tell just by looking at how the spiritual power is manifested!”<br/><br/>“Fang Wang, another Lu Yuanjun?<br/><br/>“Can he even compare with Brother Lu? Brother Lu’s reputation isn’t built only within the sect. If you ask me, if White Garment Astonishing Swan were really a disciple, she might be able to compare with Brother Lu.”<br/><br/>“White Garment Astonishing Swan uses Jinghong Divine Sword Art, could it be a disciple of the third vein?”<br/><br/>Unlike the battle with the fifth vein, the disciples of the sixth vein were first-timers on the stage, ranked higher than the fifth vein, but still overwhelmingly defeated by Fang Wang. This proved Fang Wang’s power was indeed formidable, and not just because he preyed on tired disciples.<br/><br/>Li Yu commented thoughtfully, “Junior Brother Fang is really smart; such a way of fighting reduces spiritual power consumption.”<br/><br/>The other disciples nodded and offered their own remarks. Zhou Bo chuckled, “Smart for sure, but it’s a tactic we can’t afford to use.” Gu Li did not make a sound, her focus remained on Fang Wang.<br/><br/>Disciples from various veins discussed Fang Wang’s strength—some interested, some wary, and others anxious or fearful.<br/><br/>Up in the second vein’s attic.<br/><br/>Zhou Xing Shi listened to the remarks of his fellow senior brothers and sisters, regarding them with disdain.<br/><br/>“This is a Heaven Yuan Spirit Treasure! It cannot be measured by ordinary standards; you might not be his match at all!”<br/><br/>Zhou Xing Shi’s gaze fixated on Fang Wang, filled with fervor. As Fang Wang grew stronger, Zhou Xing Shi’s perspective on his own plight began to change. The Wondrous Spring Autumn Parasite might not be a calamity to him but an opportunity instead.<br/><br/>In the Da Qi Cultivation Realm, a Heaven Yuan Spirit Treasure had never before been born. But the Zhou Family was a cultivation family, which gave Zhou Xing Shi a sense of how expansive the outside world was.<br/><br/>Perhaps clinging to Fang Wang’s coattails could take him further!<br/><br/>Zhou Xing Shi’s heart grew even hotter as he thought of the promise made by Zhou Xue.<br/><br/>Fang Wang grasped the Heavenly Palace Halberd and turned to look toward the sixth vein’s loft.<br/><br/>At the fourth layer of the Soul Sculpting Realm, he was already capable of killing in one second those at the third layer of the Spirit Elixir Realm. Now, with his cultivation reaching the ninth layer of the Soul Sculpting Realm and armed with the Heavenly Palace Halberd, which was suspected to be a Heaven Yuan Spirit Treasure, coupled with Great Perfection in the Solaris Scripture, he had the confidence to sweep through the Spirit Elixir Realm. In the upcoming battles, he would maintain this dominating stance!<br/><br/>Soon, the second disciple took to the stage!<br/><br/>In less than ten breaths, the battle was over!<br/><br/>As soon as Fang Wang approached his opponent, the battle ended, no one could withstand the attack of the Heavenly Palace Halberd under the Great Perfection Sword Control Technique. The Heavenly Palace Halberd itself contained immense power, and together with the technique, anyone hit by this attack would either die or be gravely injured!<br/><br/>Disciple after disciple from the sixth vein took turns entering the stage, only to meet continuous crushing defeats. The clamor from the main city grew increasingly intense until after five disciples from the sixth vein had been defeated, the noise began to die down.<br/><br/>It wasn’t until the ninth disciple from the sixth vein fell outside the combat platform, unconscious, that a complete silence fell over the entire city! The nine disciples from the sixth vein at most survived two moves from Fang<br/><br/>Wang!<br/><br/>Standing on the stage, Fang Wang held his head high and puffed out his chest. Even without a smile, he seemed full of vigorous spirit.<br/><br/>“Third Vein wins! It will take over the ranking of the Sixth Vein!”<br/><br/>Greedy Sleeper shouted loudly and then looked toward Yang Yuanzi.<br/><br/>Yang Yuanzi remained silent. Fang Wang waited for a while before flying toward the loft of the third vein.<br/><br/>“Really, Master, even if you’re not challenging, you should at least speak up,” Fang Wang thought helplessly, but when he approached Yang Yuanzi, he still bowed respectfully.<br/><br/>Yang Yuanzi didn’t comment on Fang Wang’s performance; instead, the disciples crowded around him, showering him with praise and flattery.<br/><br/>The Nine Veins Combat Method continued!<br/><br/>The seventh vein challenged the second vein!<br/><br/>After dealing with his fellow sect members, Fang Wang sat down at the back to meditate and recover his spiritual power, striving to maintain his peak condition.<br/><br/>Twelve consecutive wins spread Fang Wang’s name throughout the Sect’s Main City. The disciples who opened betting pools now believed that Fang Wang had the strength to stand out and become one of the nine representatives for the<br/><br/>Great Abyss Gate, thus they began adjusting his odds.<br/><br/>In the next five hours, no peak dared to challenge the third vein.<br/><br/>The Nine Veins Combat Method lasted for seven days, and the third vein was clearly on the rise this year!<br/><br/>As night fell, the Nine Veins Combat Method was still underway, and each combat began to take longer. The sixth vein, defeated by Fang Wang alone, had fallen to the very last place. Facing challenges from other veins, the peak master chose to forfeit, indicating to Fang Wang that he planned to strike for rank on the last two days.<br/><br/>It must be said that seven days were indeed enough to test every vein’s peak. Those disciples from weaker veins but with strong abilities would not be buried in obscurity. The disciples from the first vein were challenged from time to time, as if the peaks had made some sort of agreement to take turns depleting the first vein disciples’ spiritual power.<br/><br/>From the current situation, it seemed that the first vein was handling challenges with ease.<br/><br/>On the second day, close to noon, the first vein encountered a challenge from the second vein. This time, Zhou Xue was the first to step onto the stage.<br/><br/>Fang Wang got up, ready to watch Zhou Xue’s combat.<br/><br/>“You seem quite concerned about her,” Gu Li said as she walked up to Fang Wang, speaking softly.<br/><br/>Fang Wang, keeping his eyes on Zhou Xue, answered, “After all, she is part of my clan. ”<br/><br/>“I heard you two are not blood-related, and she is just an adopted daughter.”<br/><br/>“The Fang Family has never treated her as an adopted daughter.”<br/><br/>“Hmm.”<br/><br/>Gu Li said no more and watched the battle alongside Fang Wang.<br/><br/>Zhou Xue’s Lifespirit Treasure was a zither. As soon as she played it, her opponents became utterly confused; the light ones staggered while the more affected ones stood frozen in place.<br/><br/>Such a Lifespirit Treasure sparked discussions among the various veins.<br/><br/>Zhou Xue swiftly gained six consecutive wins and was eventually substituted by the peak master. Her strong performance caused a great deal of discussion in the main city, but in the hearts of most disciples, her performance still fell short of Fang Wang’s.<br/><br/>Fang Wang was the epitome of dominance, while Zhou Xue was inscrutable.<br/><br/>“Fang Wang, your clan member is extraordinary, quite a high level of cultivation, ” Yang Yuanzi said meaningfully.<br/><br/>Upon hearing this, Fang Wang asked, “How high?”<br/><br/>Yang Yuanzi shook his head and didn’t answer, leaving Fang Wang speechless. Li Yu then asked, “Master, what grade is Zhou Xue’s treasure?”<br/><br/>Yang Yuanzi answered, “It’s a Lower Grade Earth Origin Precious Spirit. The news hasn’t spread yet, but after this Nine Veins Combat Method, at least five disciples from the Great Abyss Gate will become famous throughout the<br/><br/>Cultivation Realm.. “\t\t\t\t\t\t</div>", "images": {}, "success": true}