{"id": 46, "url": "https://www.novelhall.com/i-became-an-immortal-on-mortal-realm-32879/14237605.html", "title": "Chapter 46 - Chapter 46: Chapter 44: Divine Nurturing Sword Qj, Sword In The Eye_L", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 46 - Chapter 46: Chapter 44: Divine Nurturing Sword Qj, Sword In The Eye_L</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 46: Chapter 44: Divine Nurturing Sword Qj, Sword in the Eye_l<br/><br/>Translator: 549690339<br/><br/>After Fang Wang’s battle with Xu Lang, more information about Fang Wang began to circulate.<br/><br/>Before joining, he was only at the seventh level of the Qi Cultivation Realm, and three years after joining, he defeated a direct disciple at the ninth level of the Spirit Elixir Realm!<br/><br/>This news spread like a whirlwind through the city after being released by a disciple of the third vein, causing shock among all who heard it. The legendary peerless geniuses of the legends had appeared right beside them, making it feel unreal. Many people were questioning this and believed that Fang Wang was just as low-key as Ye Xiang, allowing others to mistake him for a new disciple.<br/><br/>Time would prove the truth!<br/><br/>In an inn within the main city, Zhao Zhen sat by the window, not looking at the Golden Mirror in the sky, but pouring himself a drink, his right hand trembling as he did so.<br/><br/>The disciples inside the inn were discussing Fang Wang’s strength and didn’t notice his abnormality. If someone were sitting across from him, they would have seen him sweating profusely with terror on his face.<br/><br/>After Fang Wang’s match, although the subsequent battles were spectacular, they felt somewhat lackluster to the spectators.<br/><br/>The first vein had hidden a genius with an Earth Origin Spirit Treasure. Excluding Fang Wang and Zhou Xue, this genius along with Ye Xiang, Gu Li, and Lu Yuanjun meant the Great Abyss Gate had four geniuses with Earth Origin Spirit Treasures. No wonder they could become the strongest sect in the Da Qi Cultivation Realm in another timeline.<br/><br/>Until the very end of the last half-day, there were challenges from the lower-ranking veins to the third, and Yang Yuanzi sent Gu Li to meet the challengers, who were three disciples of the Spiritual Refinement Realm and one of the first level of the Spirit Elixir Realm.<br/><br/>It was confirmed!<br/><br/>Something fishy was going on!<br/><br/>After Gu Li achieved four consecutive victories, she returned to Fang Wang’s side with an expressionless face. Fang Wang wasn’t sure if it was his imagination, but it felt like she was deliberately avoiding his gaze. When the other disciples praised her, she merely nodded slightly.<br/><br/>Thinking back on Gu Li’s previous opponents, it was likely that those above the Spirit Elixir Realm had intentionally held back.<br/><br/>That’s right, she was a genius with an Earth Origin Spirit Treasure. How could the Great Abyss Gate not focus on cultivating her? There are grey areas under any set of rules.<br/><br/>Time flew by.<br/><br/>The seven-day period of the Nine Veins Combat Method finally arrived, and the third vein managed to secure the fifth-place position, their best result in fifty years.<br/><br/>After Guang Qiuxian announced the rankings of each vein, the Vice Sect Leader Chen Anshi stood up and said, “The nine disciples representing the Great Abyss Gate to seek opportunities in the Cave Heavens are Lu Yuanjun, Fang Wang, Xu<br/><br/>Lang, Ye Xiang, Zhou Xue, Gu Li, Yan Feiyue, Tang Jue, and Xiao Ling!”<br/><br/>“One month from today, at noon, report in front of the Shiyuan Hall to wait!” With that, this Nine Veins Combat Method came to an end!<br/><br/>The disciples from the various lofts flew out, heading towards the loft where the third vein resided, all aiming for Fang Wang.<br/><br/>Faced with the overtures from the direct disciples of each vein, Fang Wang had to be polite, and even the elders from various veins came to him eventually.<br/><br/>It took him an entire hour to finally make his escape, and he quickly returned to the gate of his own mountain abode, finding Gu Li waiting at the entrance.<br/><br/>As Fang Wang landed and was about to say hello, Gu Li spoke first, “You must be disappointed. But I couldn’t refuse. Even if I didn’t want to, the sect would have pushed me forward, and I myself desire this opportunity. My father had mentioned this to me before.”<br/><br/>Fang Wang blinked and replied, “Disappointed about what? I’m only envious. Please, are you bragging or what?”<br/><br/>Fair?<br/><br/>What a joke. In this world, apart from life and death, nothing is absolutely fair!<br/><br/>The very existence of cultivation might make even life and death unfair.<br/><br/>Gu Li’s mood lightened a bit at his tone; she rolled her eyes at him, then took out two blue-covered books from her storage bag. Handing them to Fang Wang, she said, “My father heard that you defeated me with the seventh level of Qi Cultivation during the entrance examination and wanted to befriend you. Here are the records of Heavenly Materials and Earthly Treasures and the<br/><br/>Divine Nurturing Sword Qi, a unique skill exclusive to the Gu Family.”<br/><br/>“The Heavenly Materials and Earthly Treasures record all the treasures between heaven and earth, which can help you in collecting treasures within the Great Saint’s Grotto-Heaven. The Divine Nurturing Sword Qi is the essential swordsmanship method for legitimate descendants of the Gu Family, but very few can truly master it. If it reaches great completion, it possesses the wondrous divine skills mentioned in legends.”<br/><br/>After saying this, she turned and walked away. Watching her leave, Fang Wang wanted to say something but hesitated.<br/><br/>Gu Li left quickly, seemingly in fear that he would refuse, and hurried back to her own abode.<br/><br/>Fang Wang shook his head with a chuckle and then entered his own abode.<br/><br/>Sitting on his bed, Fang Wang began to flip through the Heavenly Materials and Earthly Treasures. Each page contained illustrations followed by textual descriptions about various plants, trees, fruits, and also many peculiar ores, which captivated him thoroughly. Although it wasn’t a secret manual, the Heavenly Materials and Earthly Treasures still pleasantly surprised him.<br/><br/>After spending a good half-hour, he put the book into his storage bag and then picked up the Divine Nurturing Sword Qi to examine it.<br/><br/>He didn’t have high expectations for the Divine Nurturing Sword Qi, having witnessed Gu Li’s Five Sacred Sword Technique.<br/><br/>As he read on, his expression turned serious.<br/><br/>The Divine Nurturing Sword Qi was not simple at all!<br/><br/>This Sword Qi was cultivated within the Dantian. The longer it was nurtured, the stronger it became. Generally speaking, the Divine Nurturing Sword Qi was very weak in the early stages, and it would be difficult to form combat power within the first ten years, which was why Gu Li had never used it.<br/><br/>Fang Wang was different. If he could cultivate the Divine Nurturing Sword Qi to the Great Perfection Realm from the start, then his cultivation speed of this Sword Qi would far surpass that of the Gu Family members. After all, they had to cultivate it step by step and spent a long time just to gather the Sword Qi.<br/><br/>When Fang Wang was about to turn to the last page, his hands trembled slightly.<br/><br/>God knows how long he had to stay in the Heavenly Palace, but thinking of his imminent visit to the Great Saint’s Grotto -Heaven, he felt it would be a good thing to have another combat technique.<br/><br/>Fang Wang took a deep breath, then turned the last page and began to read.<br/><br/>When he finished reading the last character, his mind exploded, and everything before his eyes became blurry.<br/><br/>Fang Wang opened his eyes again to find himself within the Heavenly Palace, and he did not waste any time, immediately starting to cultivate the Divine Nurturing Sword Qi.<br/><br/>There were no clear realm divisions for Divine Nurturing Sword Qi, but the cultivation process was extremely difficult. It was not like ordinary Sword Qi but more like an exploration of the soul.<br/><br/>Just like that, years passed by.<br/><br/>Eventually, Fang Wang spent one hundred and twenty years to cultivate the Divine Nurturing Sword Qi to the Great Perfection Realm. At that moment, he finally believed Gu Li’s words.<br/><br/>The Divine Nurturing Sword Qi indeed had its divine mysteries!<br/><br/>The Great Perfection Divine Nurturing Sword Qi was not in the Dantian, but within the soul, which caused an immense increase in Fang Wang’s spiritual consciousness, allowing him to introspectively view his own soul.<br/><br/>Essentially, the Great Perfection Divine Nurturing Sword Qi was like a part of the soul that could extend out from the eyes, under his control, and return to the body after killing an enemy, untainted by any filth and possessing terrifying destructive power.<br/><br/>The most crucial point was that there was no upper limit to Divine Nurturing Sword Qi. The longer he nurtured it, the stronger it became.<br/><br/>Fang Wang’s consciousness then withdrew from the Heavenly Palace, and, as he opened his eyes, he saw his own cave dwelling.<br/><br/>Suppressing the urge to go out and experience the world, he began to cultivate Divine Nurturing Sword Qi. As spiritual energy entered his body, within less than the time it took for half a pot of tea to brew, his soul refined the Divine Nurturing Sword Qi. From now on, whenever he gathered Qi, a part of the spiritual energy would automatically feed the Divine Nurturing Sword Qi. This was the Great Perfection Divine Nurturing Sword Qi, which no longer needed his separate cultivation.<br/><br/>Of course, if he felt that the Divine Nurturing Sword Qi was affecting his cultivation speed, he had the option to sever its connection with the outside world on his own.<br/><br/>Fang Wang’s eyes suddenly brightened, sending a streak of Sword Qi from his eyes, swiftly moving within the dwelling, as fast as lightning. With a quick gesture, the Sword Qi rapidly re-entered his eyes, returning them to normal.<br/><br/>Comforting!<br/><br/>The moment the Divine Nurturing Sword Qi left his body, Fang Wang felt as if he had gained a clone, able to perfectly control the Sword Qi. Everything around him seemed to come to a standstill.<br/><br/>In future battles, the Divine Nurturing Sword Qi would be his trump card!<br/><br/>Centuries later, Divine Nurturing Sword Qi would become his major move, his eyes glaring fiercely as Sword Qi filled the air, with the power to destroy heavens and obliterate the earth!<br/><br/>Just the thought of it excited Fang Wang.<br/><br/>He immediately got up, walked out of his dwelling, and went to the edge of the cliff, gazing upon the snow flying through the sky. He felt an urge to shout out loud, to vent the frustrations of a hundred years of arduous cultivation, but he held back!<br/><br/>NO!<br/><br/>He had to get out and talk to people!<br/><br/>Fang Wang immediately set out to visit his clansmen. Aside from Zhou Xue, they were all in their own cave dwellings.<br/><br/>It was not until three days later that he returned, hesitating for a moment before the mountain gate, then making his way to Gu Li’s dwelling and asking, “Miss Gu, are you there?”<br/><br/>Before long, the mountain gate opened, and Gu Li walked out, puzzled, she asked, “What’s the matter?”<br/><br/>It was rare for Fang Wang to seek her out proactively, and she thought that something must have happened.<br/><br/>“I have been studying Divine Nurturing Sword Qi for the past three days. May I ask, how many people in the Gu Family have mastered it? To what extent can the strongest among them wield it?” Fang Wang asked earnestly.<br/><br/>Having been bottled up for one hundred and twenty years, he needed to make a comparison.<br/><br/>Gu Li replied helplessly, “Fang Wang, you indeed are a genius, but you must not rush the cultivation of Divine Nurturing Sword Qi. Currently, there are less than a handful in the Gu Family who can use Divine Nurturing Sword Qi in battle. The strongest is my grandfather, who can exhale Sword Qi from his mouth, nothing can withstand it, he can even shatter Superior Grade Spiritual<br/><br/>Weapons.. “\t\t\t\t\t\t</div>", "images": {}, "success": true}