{"id": 47, "url": "https://www.novelhall.com/i-became-an-immortal-on-mortal-realm-32879/14237777.html", "title": "Chapter 47 - Chapter 47: Chapter 45 Chi Devil Sect_1", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 47 - Chapter 47: Chapter 45 Chi Devil Sect_1</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 47: Chapter 45 Chi Devil Sect_1<br/><br/>Translator: 549690339<br/><br/>Exhaling Sword Qi?<br/><br/>Wasn’t that my level after practicing for forty years?<br/><br/>Upon hearing Gu Li’s words, Fang Wang was certain that his mastery of Divine Nurturing Sword Qi had already surpassed everyone in the Gu Family, well, everyone alive that is.<br/><br/>“So that’s how it is, no wonder it’s so hard to practice,” Fang Wang said, pretending to agree.<br/><br/>Gu Li, worrying that she might have dampened Fang Wang’s enthusiasm, consoled him, “Don’t lose heart. With your strong talent, even the Sword Control Technique you could practice to such an unbelievable degree. Given time, your Divine Nurturing Sword Qi will surely become extraordinary, surpassing even my grandfather.”<br/><br/>“Thanks for the encouragement, Miss Gu. I’ll have to practice more then, can’t disappoint you,” he replied.<br/><br/>“Hmm, do remember to tell me when you’ve mastered the Divine Nurturing<br/><br/>Sword Qi.”<br/><br/>“Oh? Why?”<br/><br/>“My father is very much looking forward to your results.”<br/><br/>“It’s not that once I master it, your father will betroth you to me, right?”<br/><br/>“How could that be! You wish! With my talents, my father would never arrange my marriage. I’m only pursuing cultivation in this lifetime, it’s impossible for me to marry!”<br/><br/>Gu Li said with wide eyes, her cheeks blushing slightly.<br/><br/>Fang Wang suddenly couldn’t tell whether she was just shy or actually angry, but he dared not say that he had already mastered Divine Nurturing Sword Qi. As for his own talents, he preferred to keep them under wraps. “I won’t talk to you anymore, I need to cultivate!”<br/><br/>With a humph, Gu Li turned and headed back to her cave dwelling.<br/><br/>Fang Wang smiled, thinking this side of Gu Li was quite interesting, at least not as standoffish as usual.<br/><br/>He followed her back to the cave dwelling, preparing to practice. He might encounter cultivators from other dynasties in the Great Saint’s Grotto-Heaven, so he needed to become as strong as possible.<br/><br/>A month quickly passed, and the winter snow of the Great Abyss Gate had yet to melt.<br/><br/>In front of Shiyuan Hall, at the Main Meridian.<br/><br/>Fang Wang and Gu Li flew in on their swords, landed on the ground, and were joined by five other disciples who were already waiting, including Zhou Xue and Xu Lang.<br/><br/>Xu Lang looked uncomfortable seeing Fang Wang but still took the initiative to nod at him. Fang Wang didn’t put on airs either and returned the nod.<br/><br/>Zhou Xue walked up to Fang Wang and teased, “Looks like the two of you get along quite well.”<br/><br/>Fang Wang raised an eyebrow, “After all, we’re neighbors.”<br/><br/>Gu Li cast a glance at Zhou Xue and quietly stepped aside, giving space to the two of them. She wasn’t left out, though, as the other disciples began to talk with her.<br/><br/>Fang Wang said softly with a laugh, “It’s still you, Han Yu. They all say they’ve been helped or guided by you, you haven’t overlooked anyone. I can’t match this point of yours, you truly are our big brother.”<br/><br/>Big brother?<br/><br/>Zhou Xue pursed her lips with a smile, “That title doesn’t sound very nice. Don’t think too much about it, just focus all your energy on your own cultivation. If I have to leave for something, I’ll tell you in advance. Normally, you don’t need to worry about the Fang Family.”<br/><br/>Fang Wang nodded. The two had gone through life and death together and could be trusted. Moreover, throughout their journey, thanks to Zhou Xue’s presence, he really hadn’t had to deal with other matters, even when saving Fang Hanyu, Zhou Xue was with him.<br/><br/>Even the matter of revenge was taken care of by Zhou Xue. Fang Wang had no objections outwardly but was brewing with determination inside.<br/><br/>Once he had the strength to confront Lu Yuanjun and the forces behind him, he would certainly take his revenge!<br/><br/>Before long, Lu Yuanjun and another disciple arrived, and for the first time, the nine representatives of the Great Abyss Gate gathered together. Naturally, Lu Yuanjun was the central figure, he was very good at dealing with people, attentive to every disciple’s needs.<br/><br/>Zhou Xue was similarly skilled, casually chatting and laughing with Lu Yuanjun, appearing like a very friendly brother and sister duo. Fang Wang, who knew the truth, sensed the murderous intent within her.<br/><br/>At this moment.<br/><br/>The doors of the Shiyuan Hall opened, and Guang Qiuxian emerged with a group of elders, and right behind Guang Qiuxian was the Vice Sect Leader Chen Anshi, who had an even more imposing aura, attracting more attention than Guang Qiuxian.<br/><br/>“Vice Sect Leader Chen Anshi is a spy from the Chi Devil Sect. The Demonic Path’s future siege on the Great Abyss Gate will be orchestrated by him. Stay away from him and don’t believe any of his words,”<br/><br/>Fang Wang suddenly heard Zhou Xue’s sound transmission, his heart pounding.<br/><br/>Wow, aren’t you afraid that the Vice Sect Leader might hear you?<br/><br/>Fang Wang didn’t dare look at Zhou Xue or Chen Anshi; instead, he focused on Guang Qiuxian.<br/><br/>He knew his Sound Transmission Technique was definitely not as good as Zhou Xue’s, so he didn’t dare to respond.<br/><br/>Guang Qiuxian approached the stone steps and spoke, “This expedition will be led by the Vice Sect Leader and the Inheritance Elder. They will inform you of the specifics along the way. Although this is an opportunity, it is also fraught with the risk of death. Be cautious, I’ll await your return at Great Abyss Gate.”<br/><br/>Fang Wang’s gaze landed on the Inheritance Elder, Zhao Chuanqian. It was Zhao Chuanqian who had initially taken him to see Guang Qiuxian and then led him to the third meridian.<br/><br/>Zhao Chuanqian, feeling Fang Wang’s gaze, maintained his dignity, merely exchanging a glance with Fang Wang without responding.<br/><br/>Chen Anshi stepped forward, waved his right hand, and a small wooden boat flew out from his sleeve. It swiftly grew in size, becoming ten Zhang long, complete with a pavilion on it, painted red and adorned with lanterns.<br/><br/>The wooden boat hovered in mid-air. As soon as it appeared, Fang Wang distinctly felt the surrounding nature’s spiritual energy rushing towards it.<br/><br/>Chen Anshi, Zhao Chuanqian, and five other elders immediately leapt onto the boat, followed closely by the nine disciples.<br/><br/>Standing on the deck, Fang Wang used his spiritual sense to examine the boat, discovering that below the wooden planks were various Talisman Papers and intricate parts of Magic Artifacts.<br/><br/>Soon, the wooden boat set sail, its speed rapidly increasing, and in the blink of an eye, it disappeared into the snowy mist on the horizon, out of sight.<br/><br/>Guang Qiuxian stood on the steps, gazing at this scene, while the elders behind him left one by one, until Yang Yuanzi emerged from Shiyuan Hall and came to his side.<br/><br/>Only the two of them remained.<br/><br/>The cold wind blew past, stirring their temples.<br/><br/>“Brother, I always feel that Da Qi’s transition into a Cultivation Dynasty is unreliable. I fear this trip to the Great Saint’s Grotto-Heaven will lead to grave trouble,” Yang Yuanzi spoke up, his tone detached.<br/><br/>Guang Qiuxian, expressionless, replied, “I know, but luckily, the Great Saint’s Grotto-Heaven is not controlled by any sect. We cannot let such an opportunity pass by. It will allow these disciples to grow much faster, especially Yuanjun. Great Abyss Gate needs his strength.”<br/><br/>Yang Yuanzi furrowed his brow and said, “Lately, some negative rumors about Lu Yuanjun have been circulating within the main meridian. Brother, you must keep a close eye on him, don’t spoil him too much, and do not forget his origins.”<br/><br/>Guang Qiuxian glanced at him and answered, “Junior brother, the grievances of the previous generation belong to them. As for those rumors, as long as they don’t have much impact, let it be. Have you not also learned some spells from<br/><br/>Green Cicada Valley? Should I hold you accountable for that?”<br/><br/>“Hmph! Then let’s see if your favored Lu Yuanjun can stand against Xia Qingchan from Chi Devil Sect and Xu Qiuming from Suspended Vast Sword Sect!” Yang Yuanzi said coldly.<br/><br/>Guang Qiuxian shook his head with a wry smile and turned to walk towards Shiyuan Hall.<br/><br/>The sun was setting, with half of it obscured by the horizon.<br/><br/>Fang Wang stood on the deck, facing the wind. He marveled at the magnificent landscape passing by, feeling carefree and content.<br/><br/>Having been cooped up in the Heavenly Palace for one hundred and twenty years, he needed to relax; otherwise, he feared his mentality might suffer.<br/><br/>In his previous life, he read cultivation novels of various genres, but he never expected that once he embarked on his own journey of cultivation, it would be a different path altogether.<br/><br/>What was this?<br/><br/>Prison-style cultivation?<br/><br/>Fang Wang mocked himself inwardly. Although his years of training in the Heavenly Palace were monotonous and tiresome, the sense of accomplishment that came afterward was immensely satisfying. He was still grateful to have the Heavenly Palace.<br/><br/>“What are you thinking about?”<br/><br/>Zhou Xue’s voice came over, as she walked up beside Fang Wang, standing shoulder to shoulder with him.<br/><br/>Fang Wang glanced at her and said softly with a laugh, “Thinking about nothing much, just appreciating the scenery of the mortal world. Seeking carefree existence is the pursuit of cultivation, isn’t it carefree to behold the world from here?”<br/><br/>Zhou Xue looked towards the horizon, not replying.<br/><br/>Fang Wang also said no more, immersing himself back in the grandeur of the mountains and rivers.<br/><br/>At dusk, the Firmament was ablaze with red, the sea of clouds resembling spilled blood. The mountains below were shrouded in darkness, yet their peaks glimmered with light, giving the whole world a dreamlike quality.<br/><br/>“The Great Saint’s Grotto-Heaven will be a turning point for the future of the Da Qi Cultivation Realm. Once inside, you must be extremely cautious. If you meet disciples from other sects, you cannot trust them. If someone shows you malice, you must either kill or flee—do not hesitate,” Zhou Xue said, her voice reaching Fang Wang’s ear through the Sound Transmission Technique.<br/><br/>Fang Wang did not respond, fearful of being detected by the disciples and elders behind him.<br/><br/>Then, Zhou Xue continued to use the Sound Transmission Technique to introduce to Fang Wang other exceptional individuals from different sects and even listed a few whom he should not provoke.<br/><br/>Gu Li was meditating by the side of the boat; upon opening her eyes, she saw the silhouettes of Fang Wang and Zhou Xue, and under the glow of the setting sun, the two of them looked so well-matched, causing her to fall into a daze.<br/><br/>A month ago, having witnessed Zhou Xue’s performance, she knew she was no match for her. Thus, she had added another goal to her ambitions.<br/><br/>“If I cannot defeat Zhou Xue, how could I be worthy to challenge you?” Gu Li thought to herself, her eyes hardening with determination.<br/><br/>At that moment, another person was watching the pair; standing at the edge of the second floor of the pavilion, it was Lu Yuanjun..\t\t\t\t\t\t</div>", "images": {}, "success": true}