{"id": 42, "url": "https://www.novelhall.com/i-became-an-immortal-on-mortal-realm-32879/14236951.html", "title": "Chapter 42 - Chapter 42: Chapter 40: One Move! One Move! _1", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 42 - Chapter 42: Chapter 40: One Move! One Move! _1</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 42: Chapter 40: One Move! One Move! _1<br/><br/>Translator: 549690339<br/><br/>Facing the jesting of Greedy Sleeper, Fang Wang could only nod with a smile.<br/><br/>Seeing Fang Wang take the stage, Guang Qiuxian, sitting in the main pavilion, adjusted his position and looked at Fang Wang with a trace of expectation in his eyes.<br/><br/>Zhou Xue saw Fang Wang but was indifferent.<br/><br/>Lu Yuanjun, knowing that Fang Wang was the White Garment Astonishing Swan, chuckled softly, “This is the Third Vein’s Fang Wang, junior brother. He’s very strong, definitely the strongest in the Third Vein’s lineup this time.”<br/><br/>Upon hearing this, the First Vein disciples who had doubts about Fang Wang were all taken aback. They would not question Lu Yuanjun’s judgment; they were merely puzzled about when the Third Vein had such a disciple.<br/><br/>Meanwhile, all around the city, criticism arose.<br/><br/>“The Third Vein is really kicking the Fifth Vein when it’s down. Now, the Fifth Vein will end up last.”<br/><br/>“Hahaha, this junior brother must have just started. The Nine Veins Combat Method is so cruel after all, since what’s at stake is the cultivation resources of a vein; of course, interests are paramount.”<br/><br/>“Don’t hurry, this is just the beginning. The Third Vein will soon be besieged.”<br/><br/>“Even if the Third Vein wins, it’s not a glorious victory. If they lose, that would be a huge embarrassment.”<br/><br/>“Who is this person? He’s quite handsome!”<br/><br/>The Fang Family Disciples in the city got excited seeing Fang Wang on stage and started introducing him to their fellow peak disciples.<br/><br/>In a guesthouse, the Emperor of Da Qi, Zhao Zhen, sat by the window, looking at the Golden Mirror in the sky and Fang Wang’s figure, his sword-like eyebrows furrowed.<br/><br/>Not long after Fang Wang took the stage, a disciple from the Fifth Vein leaped onto the combat platform, holding a long sword. He had won two bouts against the Second Vein earlier and was definitely the strongest in the Fifth Vein’s lineup.<br/><br/>Fang Wang lifted his right hand, and his Lifespirit Treasure gradually formed above his head.<br/><br/>Heavenly Palace Halberd!<br/><br/>He couldn’t use the Jinghong Divine Sword Art, for that would reveal his identity, and the Great Celestial Thunder Technique consumed too much<br/><br/>Spiritual Power. It would be better to fight with the Heavenly Palace Halberd.<br/><br/>As he was about to condense his second Lifespirit Treasure, it was also time to put the Heavenly Palace Halberd to use!<br/><br/>A ten-foot-long Heavenly Palace Halberd appeared above Fang Wang’s head, grasped by his right hand. Bathed in sunlight, the halberd blade shimmered with cold light, and the dragon design on the shaft seemed lifelike, as if it were a True Dragon.<br/><br/>Upon the appearance of the Heavenly Palace Halberd, it immediately caused quite a stir.<br/><br/>“A polearm-type Lifespirit Treasure? Fang Tian Painted Halberd? Rare to see!”<br/><br/>One of the elders beside Guang Qiuxian stroked his beard and laughed. The other elders followed suit with their comments, seeing that the Heavenly Palace Halberd was no ordinary item.<br/><br/>Guang Qiuxian smiled without saying a word, not joining their discussion.<br/><br/>Zhou Xue’s gaze locked onto the Heavenly Palace Halberd, her delicate brows slightly furrowed; she seemed to think of something, her eyes revealing a peculiar color.<br/><br/>The ten-foot-long Heavenly Palace Halberd was so large that, just by Fang Wang holding it, it exerted an overwhelming pressure.<br/><br/>“Is that his Lifespirit Treasure?”<br/><br/>Gu Li’s beautiful eyes filled with anticipation. She had previously thought Fang Wang’s Lifespirit Treasure would be a sword but hadn’t expected it to be a polearm.<br/><br/>Greedy Sleeper stared at the Heavenly Palace Halberd, his eyebrows knitted together.<br/><br/>Having seen much and knowing much, he realized at first glance that this Lifespirit Treasure was not simple.<br/><br/>Earth Origin Spirit Treasure?<br/><br/>Could it be higher in grade than Lu Yuanjun’s Lifespirit Treasure?<br/><br/>Lu Yuanjun on the upper floor of the First Vein was also drawn by the Heavenly Palace Halberd. At this moment, ninety percent of the city’s attention was captivated by its design.<br/><br/>What a domineering Lifespirit Treasure!<br/><br/>Fang Hanyu’s eyes were obscured by white cloth, but in truth, he could see, and he was astonished in his heart.<br/><br/>Fang Wang isn’t a Sword Cultivator?<br/><br/>On the combat platform!<br/><br/>Fang Wang rotated the Heavenly Palace Halberd in his right hand and then slashed forward, the tip of the halberd pointing at the Fifth Vein’s Sword Cultivator disciple. He smiled and asked, “Senior brother, are you ready?” If they were going to compete, then let his edge be completely revealed!<br/><br/>After all, Fang Wang still had an even stronger card up his sleeve!<br/><br/>The Sword Cultivator disciple from the Fifth Vein, being pointed at by the<br/><br/>Heavenly Palace Halberd. felt an immense pressure hilt wouldn’t show<br/><br/>weakness under all these watchful eyes.<br/><br/>“Come then!” the Sword Cultivator disciple said coldly.<br/><br/>As soon as the words fell, Fang Wang suddenly released his hold, and the Heavenly Palace Halberd burst forth with terrifying speed, tearing through the air with a piercing explosive noise, like a cold light aiming for the Sword Cultivator disciple.<br/><br/>The Sword Cultivator disciple’s pupils shrank, instinctively lifting his sword to block.<br/><br/>Clang!<br/><br/>The halberd blade struck the sword blade, and an unimaginable force hit, directly sending the Spirit Elixir Realm Sword Cultivator disciple flying backward. In the blink of an eye, he crashed against the Formation light curtain on the edge of the combat platform. Blood sprayed from his mouth, and then he fell to the ground.<br/><br/>Silence!<br/><br/>The entire city suddenly fell silent. Inside the thirty-two Golden Mirrors, Fang<br/><br/>Wang still maintained the gesture of raising his hand, while the Heavenly Palace Halberd remained where the sword cultivator disciple had previously stood.<br/><br/>All the people on the various pavilions of the Nine Veins and Main Meridian were shocked.<br/><br/>Overwhelming victories had occurred before, but none so exaggerated!<br/><br/>Yang Yuanzi pinched his beard and secretly breathed a sigh of relief; he was genuinely worried that Fang Wang might use the Jinghong Divine Sword Art.<br/><br/>After this battle, in the eyes of the disciples of the Great Abyss Gate, Fang Wang was not related to sword cultivators anymore.<br/><br/>“Amazing, Brother Fang!”<br/><br/>Zhou Bo suddenly cheered, his voice breaking the silence and causing discussion to spread amongst the pavilions surrounding the combat platform.<br/><br/>An elder quickly landed beside the sword cultivator disciple to check on their injuries, then carried them out of the formation.<br/><br/>Soon, the second disciple stepped onto the platform, a female disciple with a face full of anger. Without a word, she directly condensed her Lifespirit Treasure, a silver longsword, and unleashed her swordmanship. The vibrating sword blade created blossoms of sword Qi aimed at Fang Wang.<br/><br/>Fang Wang waved his right hand, and the Heavenly Palace Halberd hovering in mid-air burst forth with terrifying speed once more!<br/><br/>Great Perfection Sword Control Technique!<br/><br/>The Heavenly Palace Halberd powerfully exterminated every sword Qi blossom, frightening the female disciple to the point her face paled, and she quickly leaped up, only to find the Heavenly Palace Halberd tracking her, drawing a perfect arc in the air.<br/><br/>In midair, the Heavenly Palace Halberd smashed into the female disciple’s abdomen with its halberd staff, sending her flying off the combat platform and crashing into the formation’s light screen, then tumbling to the ground.<br/><br/>The female disciple, with her hair in disarray, tried to withstand the pain and stand up, only for a mouthful of reverse-flowing blood to rush up her throat, making her involuntarily spray it onto the ground.<br/><br/>Whoosh—<br/><br/>Another victory with a single move!<br/><br/>Although the disciples of the Fifth Vein had experienced fierce battles, their strength couldn’t be that disparate, could it?<br/><br/>That was the thought in most disciples’ minds, and their gaze toward Fang Wang changed.<br/><br/>The elders of the various veins also looked at Fang Wang differently. The Peak Master of the Fifth Vein furrowed his brows tightly, and a disciple behind him followed suit, leaping onto the combat platform.<br/><br/>“Come!”<br/><br/>This was a burly middle-aged man who raised his hand to condense his Lifespirit Treasure, which turned out to be a long whip.<br/><br/>Fang Wang immediately charged towards him, and at the same time, raised his right hand to draw the Heavenly Palace Halberd back from mid-air, swiftly landing in his hand.<br/><br/>The middle-aged man leaped into the air, a flying sword flew out of the storage bag at his waist, rapidly expanding in size; he stood on the flying sword, wielding the whip in his right hand, and countless golden arrows shot towards Fang Wang like a torrential downpour, the sound was tremendous.<br/><br/>Fang Wang used Shadowless Step to easily dodge, then suddenly stopped, and with a fierce throw, hurled the Heavenly Palace Halberd into the air.<br/><br/>At that moment, with less than a five-yard distance between the two men, the middle-aged man was so frightened by the might of the Heavenly Palace Halberd that his body tensed up, leaving him no chance to dodge.<br/><br/>Dang!<br/><br/>A deafening collision sounded. A Golden Mirror appeared out of nowhere in front of the middle-aged man, somewhat similar to the thirty-two mirrors suspended above the main city, and it firmly blocked the Heavenly Palace Halberd.<br/><br/>Fang Wang frowned, a hint of surprise flashing in his eyes.<br/><br/>“Alright, this battle is won by the Third Vein. The Fifth Vein, send out another person!”<br/><br/>An authoritative voice rang from the platform; the speaker was none other than Greedy Sleeper, who gestured with his hand, and the Golden Mirror swiftly flew into his sleeve.<br/><br/>So it was the elder who acted!<br/><br/>Fang Wang relaxed, having thought his opponent was that fierce.<br/><br/>The middle-aged man in the air was sweating profusely, looking at Fang Wang with eyes full of fear.<br/><br/>Three consecutive victories, each with absolute strength!<br/><br/>All the city’s disciples grew excited, as no one had displayed such boldness in the previous combat. Suddenly, the talk of the Third Vein’s victory being undeserved ceased, replaced by inquiries about Fang Wang’s identity, and soon, the name Fang Wang spread throughout the city.<br/><br/>The news of his status as a direct disciple upon his entrance also spread, adding a legendary aura to Fang Wang in the eyes of the disciples from various peaks.<br/><br/>“The Fifth Vein forfeits!”<br/><br/>The Peak Master of the Fifth Vein declared, his expression still calm as if he didn’t feel disgraced.<br/><br/>Greedy Sleeper immediately ordered, “The Third Vein has won, replacing the<br/><br/>Fifth Vein’s ranking, now placed seventh!”<br/><br/>Fang Wang raised his hand to retrieve the Heavenly Palace Halberd, ready to step down, when Yang Yuanzi’s voice came: “The Third Vein continues the challenge, now challenging the Sixth Vein!”<br/><br/>Greedy Sleeper was also taken aback and inwardly cursed Yang Yuanzi for stealing his lines.<br/><br/>Fang Wang was already too lazy to keep track of the ranking of the veins; no matter who Yang Yuanzi chose, he was willing to fight!<br/><br/>Fang Wang shouldered the Heavenly Palace Halberd, his gaze fixed on the pavilion of the Sixth Vein, his posture and eyes giving the Sixth Vein disciples the impression of a challenge.<br/><br/>The disciples of the Third Vein were excited, as such a domineering Brother Fang had not appeared in their vein for a long time. Big Brother Li Yu was kind to people, which was a diplomatic way of saying it, but in reality, many thought Li Yu was too weak, pulling down the image of the Third Vein..\t\t\t\t\t\t</div>", "images": {}, "success": true}