{"id": 40, "url": "https://www.novelhall.com/i-became-an-immortal-on-mortal-realm-32879/14236712.html", "title": "Chapter 40 - Chapter 40: Chapter 38: The Treasured Spirit With Multiple Lives, The Battle Of Spells Approaches_L", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 40 - Chapter 40: Chapter 38: The Treasured Spirit With Multiple Lives, The Battle Of Spells Approaches_L</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 40: Chapter 38: The Treasured Spirit with Multiple Lives, The Battle of Spells Approaches_l<br/><br/>Translator: 549690339<br/><br/>“Do you miss me, or do you miss the cultivation techniques and spells on me?”<br/><br/>Zhou Xue teased with a smile as she looked Fang Wang over, her eyes revealing a look of satisfaction.<br/><br/>Fang Wang walked over to her side, opened the door, and said, “Let’s go inside to talk.”<br/><br/>The two entered the cave dwelling, and the mountain gate closed tightly behind them.<br/><br/>They sat down at the table, and Fang Wang poured a cup of tea for Zhou Xue, then asked, “Has the Fang Residence already reached the Fang Realm?”<br/><br/>Zhou Xue nodded and said, “Over a hundred disciples have already moved into the Fang Realm, led by my Uncle Wu and my father. Grandfather stays in Southern Hills City, he said the Fang Residence can’t completely move out; he’s afraid of disturbances in Southern Hills City.”<br/><br/>Upon hearing this, Fang Wang frowned slightly.<br/><br/>“Don’t worry, as long as the real identity of White Garment Astonishing Swan is not exposed, the Fang Residence won’t suffer retaliation from Green Cicada Valley or the Li Family. As for Lu Yuanjun, he assisted the Emperor of Da Qi in entering the Great Abyss Gate. Now that the plan to turn Da Qi into a<br/><br/>Cultivation Dynasty has begun, he certainly won’t dare to collect more souls.<br/><br/>Moreover, from his perspective, he definitely would not take revenge on the Fang Residence and risk exposure. As for the Emperor of Da Qi, Zhao Zhen, he really is ruthless,” Zhou Xue said with a hint of scorn in her tone.<br/><br/>Fang Wang inquired, “Why do you say that?”<br/><br/>“He had the Prime Minister assassinated in secret and pinned the crime of exterminating nine clans on him, claiming that the attack on the Fang<br/><br/>Residence and the slaughter of other cities were all related to the Prime Minister. Then, within a short period of time, he had the nine clans of the Prime Minister executed,” Zhou Xue replied.<br/><br/>Fang Wang’s brow furrowed further as he asked, “There were other cities involved?”<br/><br/>“Yes, apart from the Duke’s Mansion I visited before, they targeted two other<br/><br/>Duke’s Mansions and slaughtered the cities where those two state Duke’s Mansions were located. Lu Yuanjun collected at least a million souls,” said Zhou Xue.<br/><br/>Hearing Zhou Xue’s words, Fang Wang couldn’t help but recall his previous exchange with Zhao Zhen. That emperor appeared mild-mannered and sunny; it was hard to imagine him committing such cruel acts behind the scenes.<br/><br/>Narrowing his eyes, Fang Wang said, “Lu Yuanjun’s goal is to collect souls, and Zhao Zhen made arrangements for him. In turn, Zhao Zhen seized the opportunity to have Lu Yuanjun’s people eliminate the Duke’s Mansions that threatened him?”<br/><br/>Zhou Xue nodded and said, “Exactly. Moreover, by doing so, the events appear to be nothing more than a tragic power struggle between the imperial authority and the ministers, not involving the Cultivation World.”<br/><br/>“But now that the Prime Minister is dead, won’t we be without evidence if we want revenge? Are there any cultivators who helped Lu Yuanjun that survived?” Fang Wang asked with a frown.<br/><br/>With a smile that was not quite a smile, Zhou Xue said, “To truly seek revenge, do we need evidence? Evidence is only meant to convince oneself. Leave the matter of revenge to me. Practice your cultivation in peace. I’m telling you the truth only to make sure you are not deceived by the outward appearances of Lu<br/><br/>Yuanjun and Zhao Zhen.”<br/><br/>Just as Fang Wang was about to respond, Zhou Xue interrupted him, “Let’s talk about the upcoming Nine Veins Combat Method. You must compete because the nine disciples who ultimately win will gain entry to the Great Saint’s Grotto-Heaven. It’s a secret realm passed down from ancient times. If nothing goes wrong, the Great Abyss Gate will benefit the most, which also lays the foundation for their rise.<br/><br/>Great Saint’s Grotto-Heaven?<br/><br/>Fang Wang’s interest was piqued, especially since even Zhou Xue was urging him to compete. There must be many benefits inside.<br/><br/>“I will also enter the Great Saint’s Grotto-Heaven this time. When you manage to get in, I’ll explain in detail to you. The Great Saint’s Grotto-Heaven will be a turning point for the Da Qi Cultivation World. At the same time, we will also encounter cultivators from other dynasties’ sects, and perhaps we will even meet an exceptional talent with the Heaven Yuan Spirit Treasure,” Zhou Xue said with a smile, her words only further stirring Fang Wang’s interest in the Great Saint’s Grotto-Heaven.<br/><br/>Curious, Fang Wang asked, “What have you been doing these two years, just taking care of the Fang Residence?”<br/><br/>Zhou Xue shook her head and said, “Of course not. I, too, have to strive to become stronger.”<br/><br/>“Which realm are you at now?”<br/><br/>“I’m not telling you, but I know you’ve already reached the ninth layer of the Soul Sculpting Realm,” Zhou Xue said as she rested her chin in her hand and stared at Fang Wang with a smile.<br/><br/>Fang Wang’s expression stiffened, as he did not expect Zhou Xue to be able to see through his cultivation level. It seemed that the Unnoticeable Nature Technique did have ways to be deciphered.<br/><br/>“To be honest, I didn’t expect you to defeat Li Honggang. It seems you’ve kept something up your sleeve as well. But it’s okay; keep your secrets. This way, you can set my mind at ease,” Zhou Xue continued with a smile, already starting to compare Fang Wang with the peerless geniuses from her past life’s memories.<br/><br/>Fang Wang coughed lightly and asked, “Speaking of which, can cultivators only have one Lifespirit Treasure?”<br/><br/>Upon hearing this, Zhou Xue narrowed her eyes and asked, “Could it be that your Treasured Spirit Space is abnormal?”<br/><br/>Fang Wang did not hide anything and shared his experiences. After he finished speaking, Zhou Xue was not shocked; instead, she spoke in a wistful tone, “So that’s how it is. No wonder your talent is so strong. Indeed, there are cultivators in the world who possess more than one type of Lifespirit Treasure.<br/><br/>The most Lifespirit Treasures I’ve seen one genius possess were nine Lifespirit<br/><br/>Treasures. He ascended with me and became unstoppable after ascension, turning into someone even I had to look up to.”<br/><br/>Raising an eyebrow, Fang Wang asked, “Is that true? What kind of realm is capable of earning an Immortal Venerable’s respect?”<br/><br/>“The so-called ‘Immortal Venerable’ is just a term of respect in the Upper Realm, I’m not the strongest existence there, otherwise, I wouldn’t have come back to the present,” Zhou Xue replied. She seemed unwilling to discuss the Upper Realm further and continued to talk about the Lifespirit Treasure.<br/><br/>“The realms of cultivation are divided into Qi Cultivation, Spiritual Refinement, Spirit Pill, Profound Heart, and Condensation. Generally speaking, having an<br/><br/>Earth Origin Spirit Treasure gives one hope to break through to the Condensation Spirit Realm. Currently in the Da Qi Cultivation Realm, the number of Great Cultivators in the Condensation Spirit Realm can be counted on one’s fingers, which speaks volumes about the importance of the grade of a Spirit Treasure. Those with multiple Lifespirit Treasures, having one or two more than other cultivators, naturally have more possibilities.”<br/><br/>“Take you, for example. The grade of your second Lifespirit Treasure may not be lower than the first, but it could also be mediocre; it all depends on fate.”<br/><br/>“I estimate that you’ll be able to create your second Lifespirit Treasure when you break through to the Spirit Pill Realm.”<br/><br/>Fang Wang was filled with surging excitement. Although he had not used the Heavenly Palace Halberd, when he was in the Heavenly Palace holding it and executing the Nine Dragons Divine Transformation Art, its power was incredibly terrifying, proving that the Heavenly Palace Halberd was far stronger than the Superior Grade Spiritual Weapon, the Qingjun Sword.<br/><br/>If he could have another Lifespirit Treasure…<br/><br/>The two continued to talk, with Fang Wang asking questions and Zhou Xue answering them. Gradually, Fang Wang’s understanding of the Cultivation World deepened.<br/><br/>An hour later.<br/><br/>Zhou Xue stood up, preparing to leave, and Fang Wang immediately offered to see her out.<br/><br/>“Don’t make any more requests. Once you reach the Spirit Pill Realm, I’ll teach you another technique. I won’t disappoint you,” Zhou Xue said as she walked ahead.<br/><br/>Fang Wang grimaced, thinking to himself, am I the kind of person who only takes and never gives?<br/><br/>“Alright, that day won’t be too far off!”<br/><br/>“Hmm.”<br/><br/>A month passed quickly. During this month, Fang Wang rarely cultivated, instead, he planted spiritual plants and flowers in his cave dwelling.<br/><br/>When the day of the Nine Veins Combat Method arrived, his disciple token vibrated with Spiritual Power. He immediately picked up the token, and Yang Yuanzi’s voice came from within:<br/><br/>“Fang Wang, come to Qingxin Hall immediately.”<br/><br/>Fang Wang got up, quickly tidied himself up, and then left his cave dwelling.<br/><br/>As soon as he stepped out, he saw Gu Li, causing him to raise an eyebrow.<br/><br/>Noticing his expression, Gu Li said irritably, “What? You think I’m not qualified to represent the third vein?<br/><br/>“That’s not it. It’s just that you’ve just joined…”<br/><br/>“You don’t think the Nine Veins Combat Method is exclusively a battle among<br/><br/>Spirit Pill Realm disciples, do you?”<br/><br/>“Isn’t it?”<br/><br/>“How could it be? Disciples in the Spirit Pill Realm already qualify for the positions of junior elders and attendants. Although there are Spirit Pill Realm disciples participating in the Nine Veins Combat Method, they make up less than 40 percent,” Gu Li huffed, giving Fang Wang a clearer understanding of the Great Abyss Gate.<br/><br/>Above the Spirit Pill Realm is the Profound Heart Realm. According to what Zhou Xue said, Peak Masters of the various veins are all in the Profound Heart Realm, and as for the Condensation Spirit Realm, only the Sect Leader Guang Qiuxian may have achieved it.<br/><br/>Fang Wang smiled and said, “Let’s go, we must win glory for the third vein.”<br/><br/>“Hmph!”<br/><br/>Gu Li gave him a cold glance, then the two of them flew on their swords towards Qingxin Hall at the mountaintop.<br/><br/>Outside Qingxin Hall, Yang Yuanzi and the senior disciple Li Yu were already waiting. After Fang Wang and the others landed, four more disciples were yet to arrive.<br/><br/>Before long, the remaining four arrived one after the other.<br/><br/>Fang Wang noticed that aside from him and Gu Li, there were three other<br/><br/>Spiritual Refinement Realm disciples, all at the eighth layer of the Spiritual Refinement Realm, no wonder the third vein ranked second-to-last in the last combat meet.<br/><br/>Yang Yuanzi surveyed the nine disciples below, expressionless, and said, “Since there are new disciples participating, I will go over the rules again. The upcoming Nine Veins Combat Method will be one-on-one duels. Peak Masters will select an opponent, and can only choose a vein ranked higher than their own, engaging in a round-robin style combat among disciples of the veins. We have seven choices, while the top-ranked first vein can only wait for challenges from other veins. During the battles, if all disciples from a higher-ranked vein are defeated, the victorious vein will take their place. The defeated vein can consider whether to continue challenging, but the nine participating disciples cannot be replaced.”<br/><br/>“Ultimately, the nine disciples with the most individual victories will represent the Great Abyss Gate to seek opportunities in the Blessed Land of Grotto-Heaven!”\t\t\t\t\t\t</div>", "images": {}, "success": true}