{"id": 48, "url": "https://www.novelhall.com/i-became-an-immortal-on-mortal-realm-32879/14237778.html", "title": "Chapter 48 - Chapter 48: Chapter 46 Do Not Provoke_L", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 48 - Chapter 48: Chapter 46 Do Not Provoke_L</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 48: Chapter 46 Do Not Provoke_l<br/><br/>Translator: 549690339<br/><br/>The Great Saint’s Grotto-Heaven was located outside of the western borders of the Qi Dynasty, a chaotic place at the seam between Qi and Wei, frequented by cultivators year-round, and thus beyond the control of the dynasties.<br/><br/>In the past, cultivators were drawn here by the abundant spiritual energy in the area; no one expected that behind it lay a hidden cave heaven.<br/><br/>The morning sun skimmed across the deck, illuminating everyone on board.<br/><br/>Vice Sect Leader Chen Anshi stood on the deck, introducing the Great Saint’s Grotto-Heaven, “The Great Saint’s Grotto-Heaven is a secret realm left by an ancient Great Saint, a self-contained world. It was once controlled by the Ji Hao Sect, which has now vanished. The Artifact Spirit of the Great Saint’s Grotto-Heaven still exists and maintains its rules. This time, as you venture inside, the Great Cultivators of the Nine Great Sects will not be able to accompany you; you’ll be on your own.”<br/><br/>“This exploration will last six months, and whatever you find will be yours to keep, with no need to hand over to the sect. After six months, I will be waiting for you at the entrance. None of the enmities formed inside can be brought outside, meaning competition will be fierce. You represent the greatest talents of the Tai Yuan Sect, and you must not only strive to survive but also bring honor to the Sect. Do you understand?”<br/><br/>Chen Anshi spoke sternly, his sharp gaze sweeping across all the disciples.<br/><br/>Fang Wang thought to himself that hiding undercover required an impressive acting skill; if Zhou Xue hadn’t reminded him, he truly wouldn’t have noticed that Chen Anshi was a spy from the Demonic Path.<br/><br/>Tsk, this man must have already leaked their information to the Chi Devil Sect. It seemed that the inside of the Great Saint’s Grotto-Heaven would be fraught with lethal dangers!<br/><br/>The disciples listened attentively.<br/><br/>According to Chen Anshi, the Artifact Spirit limited the threshold for entering the Grotto-Heaven to cultivators below the fifth level of the Profound Heart Realm, and each sect could only send in nine people. As for whether only nine sects were allowed, the Artifact Spirit was ambiguous, so Chen Anshi warned his disciples that they might encounter cultivators from the Da Wei Cultivation World.<br/><br/>Having defeated Xu Lang of the Spirit Elixir Realm Ninth Level, Fang Wang, now facing the Profound Heart Realm, was wary but not afraid. His most powerful spell had not yet been cast!<br/><br/>Half an hour later.<br/><br/>The Law Ship flew into a barren wilderness, the land scarlet and sparsely vegetated, with fissures crisscrossing the surface forming a complex network of canyons.<br/><br/>Two sheer peaks appeared ahead, about thirty feet apart from each other, as if cleaved into halves by a Sword Cultivator’s single strike—magnificently breathtaking.<br/><br/>The Law Ship descended, and Fang Wang, along with others, followed Chen Anshi off the vessel, Zhao Chuanqian and the elders trailing behind.<br/><br/>Fang Wang fixed his gaze and saw that cultivators had already gathered at the foot of the mountain, identifiable by their attire as belonging to six different sects, numbering over a hundred individuals.<br/><br/>The arrival of the Tai Yuan Sect attracted the attention of the other sects, and Fang Wang felt many scrutinizing gazes, which irked him.<br/><br/>“Hmph!”<br/><br/>Chen Anshi let out a cold snort, resonating like a muffled thunder, instantly erasing the probing spiritual senses from Fang Wang, and the complexions of the other disciples also improved.<br/><br/>“Hahaha, isn’t this the Vice Sect Leader of the Tai Yuan Sect? Chen Anshi, when will you step into the Condensation Spirit Realm?” an elder asked with a loud and clear laugh, his voice easing the tense atmosphere as other sect elders greeted him.<br/><br/>“Vice Sect Leader Chen, this batch of Tai Yuan Sect disciples is impressive indeed!”<br/><br/>“Who’s Fang Wang? Cultivating for three years and able to defeat someone at the ninth level of the Spirit Elixir Realm, truly remarkable!”<br/><br/>“With Fang Wang and Lu Yuanjun, plus three Earth Origin Spirit Treasures, tsk tsk, it seems the leading position among the Nine Great Sects in the future will belong to the Tai Yuan Sect.”<br/><br/>“Alas, what a pity that my Taiqing Gate doesn’t have such fortune when we share the same roots as the Tai Yuan Sect.”<br/><br/>The Great Cultivators of various sects gathered together, heaping praise upon the Tai Yuan Sect.<br/><br/>Xu Lang, Ye Xiang, and other Tai Yuan Sect disciples couldn’t help but look towards Fang Wang, their eyes equally complex.<br/><br/>Fang Wang hadn’t expected that in just a month, his reputation had spread so quickly. It seemed that the Tai Yuan Sect had its fair share of spies.<br/><br/>When Lu Yuanjun heard others belittle him to praise Fang Wang, he remained indifferent, a harmlessly pleasant smile on his face.<br/><br/>Chen Anshi snorted, “No matter how talented Fang Wang is, he is still young. I hope the other sects will be considerate. After all, in the future, the Nine Great Sects will join hands to develop the Da Qi Cultivation Realm. Our opponents are the cultivation worlds of Wei, Chu, and Zhao.”<br/><br/>With those words, the other sect’s Great Cultivators no longer joked and switched the topic to the Great Saint’s Grotto-Heaven.<br/><br/>“It seems your troubles have just increased, take care of yourself.”<br/><br/>Zhou Xue’s voice reached Fang Wang’s ears. He couldn’t help but glance at her and gave her a look that told her to figure it out herself.<br/><br/>Seeing this, Zhou Xue pursed her lips in a smile, moved to his side, and took out a manual from her storage bag, handing it to him.<br/><br/>Fang Wang glanced at it, the cover inscribed with four characters: Spiritual Refinement Manual.<br/><br/>He felt a rush of joy and immediately stowed the Spiritual Refinement Manual into his storage bag.<br/><br/>Gu Li, who was not far away, noticed this scene and, through her veil, faintly saw her biting her lip.<br/><br/>An hour later, the remaining two sects arrived.<br/><br/>Fang Wang was drawn to the Suspended Vast Sword Sect, his gaze sweeping around, trying to identify Xu Qiuming.<br/><br/>Zhou Xue said that one absolutely shouldn’t provoke Xu Qiuming of the Suspended Vast Sword Sect. The Great Abyss Gate would become the strongest sect in the Da Qi Cultivation World, but Xu Qiuming would become the strongest individual. Only after he left the Da Qi Cultivation World to seek opportunities overseas did Lu Yuanjun then rise to the top.<br/><br/>According to Zhou Xue, Lu Yuanjun was formidable, but he was merely a person of influence within the limited realm of Da Qi’s Cultivation World, whereas Xu Qiuming was someone who could genuinely pursue the Path of<br/><br/>Immortality. When Zhou Xue reached the highest realm among mortals, Xu<br/><br/>Qiuming was at the same stage, except Xu Qiuming wasn’t destined to ascend.<br/><br/>“It seems that the youngest youth over there is Xu Qiuming,” Zhou Xue said through a voice transmission.<br/><br/>Fang Wang’s gaze landed on a black-clothed youth who looked to be about fourteen or fifteen years old. His features weren’t particularly handsome, barely passing as delicate. Unlike the other Suspended Vast Sword Sect disciples who all wore treasured swords, he alone had nothing at his waist, nor did he carry a sword on his back, showing no hint of a strong person’s demeanor.<br/><br/>Feeling Fang Wang’s gaze, Xu Qiuming looked toward him and flashed a teeth-baring smile, which surprisingly revealed a bit of shyness.<br/><br/>Fang Wang nodded to him immediately, then withdrew his gaze.<br/><br/>The vice sect leaders and elders of the various sects engaged in conversation, while the disciples from each sect stood apart, clearly demarcated.<br/><br/>Until noon.<br/><br/>The two straight mountains in the front suddenly began to tremble, disrupting everyone’s attention.<br/><br/>“The Great Saint’s Grotto-Heaven has opened, all sects prepare to enter!”<br/><br/>An elder from the Taiqing Gate shouted loudly, and the disciples promptly got to their feet.<br/><br/>A blinding light appeared between the two peaks, too dazzling to see what lay behind the gorge.<br/><br/>The nine disciples of Green Cicada Valley were the first to walk into the strong light, their presence vanishing as they did so, followed by Taiqing Gate and the Chi Devil Sect.<br/><br/>Chen Anshi turned around and instructed, “Remember, be extremely careful in everything! Do not trust others lightly, and your objective is to seek out<br/><br/>Heavenly Materials and Earthly Treasures and inheritances, understand?”<br/><br/>All the disciples nodded in unison; aside from Fang Wang and Zhou Xue, they all felt that the vice sect leader, though stern in appearance, had a warm heart.<br/><br/>Soon, it was Great Abyss Gate’s turn, and Lu Yuanjun led the way into the gorge.<br/><br/>Fang Wang followed behind Zhou Xue, with Gu Li behind him.<br/><br/>An uneventful journey ensued.<br/><br/>When Fang Wang stepped into the strong light, he was enveloped by an unimaginable force. He then felt his body uncontrollably falling, a strong sense of weightlessness that made him feel uncomfortable, but he couldn’t open his eyes.<br/><br/>A full ten breaths passed.<br/><br/>Fang Wang finally felt his feet touch the ground; the extreme dizziness almost caused him to fall, but he managed to steady himself forcefully.<br/><br/>As he progressively regained control over his body, Fang Wang felt a spiritual energy far richer than that of the Great Abyss Gate’s cave dwelling rushing towards him. He felt invigorated and subconsciously opened his eyes.<br/><br/>The first thing that met his eyes was a series of rolling mountains stretched out before him, thunderclouds boiling over the horizon, with faint sightings of massive demonic beasts soaring. He was standing on the edge of a cliff, just five steps away from plummeting down.<br/><br/>He immediately turned around and surveyed the area, not seeing anyone else. His divine consciousness spread out but likewise detected no traces of people.<br/><br/>Indeed, as Chen Anshi had said, upon teleportation, everyone was scattered, their actual locations dependent on the whims of the Great Saint’s Grotto-Heaven’s Artifact Spirit.<br/><br/>In half a year, the Artifact Spirit would transport them out, so there was no need to search for an exit.<br/><br/>Without hurry, Fang Wang sat down at the edge of the cliff to meditate and took out the Spiritual Refinement book Zhou Xue had given him.<br/><br/>Spiritual Refinement required Heavenly Dao Spirit Stones, which only the Nine Great Sects in the Da Qi Cultivation Realm controlled; even if noble families possessed them, they had to hide them, or else they might attract deadly trouble.<br/><br/>Fang Wang had originally planned to return to the Great Abyss Gate for Spiritual Refinement after this event ended. Now, it seemed unnecessary; the first page of the Spiritual Refinement manual was about how to create temporary Heavenly Dao Spirit Stones!<br/><br/>Besides the method of creation, some special locations were also suitable for Spiritual Refinement, only they hadn’t yet been discovered by the Da Qi Cultivation Realm.<br/><br/>While it was called a Spiritual Refinement manual, most of the content dealt with how to condense Spirit Pills; he suspected Zhou Xue had written it<br/><br/>specifically for him..\t\t\t\t\t\t</div>", "images": {}, "success": true}