{"id": 41, "url": "https://www.novelhall.com/i-became-an-immortal-on-mortal-realm-32879/14236950.html", "title": "Chapter 41 - Chapter 41: Chapter 39 Leading The Charge_L", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 41 - Chapter 41: Chapter 39 Leading The Charge_L</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 41: Chapter 39 Leading the Charge_l<br/><br/>Translator: 549690339<br/><br/>After listening to Yang Yuanzi’s introduction, Fang Wang felt something was amiss. If the final nine spots were determined solely by the number of victories, wouldn’t it be more beneficial to rank later?<br/><br/>Wouldn’t the second-ranked vein peak just avoid challenging the first-ranked vein peak and effectively suffocate the first vein to death?<br/><br/>But then, with another thought, it dawned on him.<br/><br/>This was the Nine Veins Combat Method!<br/><br/>It was first a competition between the nine veins, and only afterwards, a personal contest. Which vein to challenge was not up to the disciples to decide. For the Peak Masters, the ranking of the vein peaks was paramount, while the last nine spots were a matter of personal gain for the disciples.<br/><br/>The second-ranked vein peak would certainly challenge the first vein; otherwise, they would have to wait another ten years!<br/><br/>The ranking of the vein peaks was crucial to the allocation of resources within the Sect and would also attract disciples to join. Like the first vein, it had the highest number of disciples.<br/><br/>Wait a moment!<br/><br/>Zhou Xue was in the first vein, and so was Lu Yuanjun…<br/><br/>Fang Wang suddenly felt the pressure coming from the first vein; this first vein was untouchable!<br/><br/>However, the third vein, ranked eighth, probably wouldn’t challenge the first vein either.<br/><br/>Yang Yuanzi continued to speak about some matters to note, and the nine disciples listened attentively until the bell from the Sect’s Main City rang, signaling Yang Yuanzi to lead them away.<br/><br/>The group flew on their magic swords, hovering in the sky, Fang Wang saw many disciples flying towards the ten vein peaks surrounding the Sect’s Main City, shuttling through the dense, snowy mist.<br/><br/>The bells of the Sect’s Main City rang incessantly, and golden light rose from various areas within the city, manifesting as thirty-two semi -transparent Golden Mirrors in mid-air. As they drew closer, Fang Wang could see that the surfaces of the mirrors reflected a massive combat platform.<br/><br/>The combat platform was located in the central area of the Sect’s Main City, a hundred Zhang in length and width, surrounded by Formation Magic Artifacts on its edges. Outside of those were pavilions where disciples normally settled their grudges.<br/><br/>Fang Wang followed Yang Yuanzi towards the combat platform. The Nine Channels’ disciples all arrived in the city, positioned at various locations. They didn’t need to approach the platform closely; by simply looking up at those Golden Mirrors, they could watch the battles unfold. Some nosy disciples even started setting up betting pools, allowing other disciples to wager Spirit Stones and Spirit Pills.<br/><br/>“It’s Fang Wang, he’s going to participate too!”<br/><br/>On a street below, Fang Xin watched Fang Wang fly by above with excitement, and the three Fang Family Disciples beside her were equally thrilled. Such an important event for the Sect, and Fang Wang, who had joined just three years ago, was eligible to participate?<br/><br/>What extraordinary talent!<br/><br/>There was no envy amongst his clan members, only boundless pride. The more famous Fang Wang became, the more they would benefit.<br/><br/>Fang Hanyu, blindfolded, arrived on his sword from within the swirling snow.<br/><br/>Although he hadn’t seen Fang Wang’s figure, he had come to watch Fang<br/><br/>Wang’s battle—it was after learning about the victories of White Garment Astonishing Swan that he had realized the truth, Fang Wang was the White Garment Astonishing Swan!<br/><br/>For someone with the strength of White Garment Astonishing Swan, it wasn’t hard to break into the Nine Veins Combat Method!<br/><br/>After undergoing Spiritual Refinement, Fang Hanyu’s power had greatly increased. Unfortunately, he was unable to emerge victorious from within the second vein, which ranked among the top three in overall strength, not something the third vein could compare with.<br/><br/>The name of the vein peak was the original ranking, and the third vein used to hold the third place. Now relegated to the eighth rank, the third vein had become the laughingstock of the Great Abyss Gate.<br/><br/>Fang Wang followed Yang Yuanzi into a pavilion at the edge of the combat platform. Yang Yuanzi found himself a seat and sat down, while the disciples stood behind him.<br/><br/>“Master, which vein shall we challenge first?” Li Yu asked.<br/><br/>Fang Wang watched other veins gradually fly into other pavilions, not spotting Zhou Xue yet.<br/><br/>Yang Yuanzi said calmly, “Let’s challenge the fifth vein first.”<br/><br/>The fifth vein, which in the previous ranking had been the seventh vein peak, presented the least pressure for the third vein to challenge.<br/><br/>A moment later, Fang Wang saw disciples from the first vein arriving, including Lu Yuanjun and Zhou Xue, amidst a large group.<br/><br/>After a short while, Guang Qiuxian arrived with a group of elders from the main peak. Yang Yuanzi and the other Peak Masters rose to greet them, quieting the disciples behind them as well.<br/><br/>The Greedy Sleeper, who had been in charge of the entry assessment three years earlier, landed on the combat platform, looking just as unorthodox as he had back then.<br/><br/>“The Nine Veins Combat Method, which takes place once every ten years, will start ahead of schedule,” Greedy Sleeper said with a laugh. His voice, surprisingly, spread throughout the entire Main City via the thirty-two Golden Mirrors.<br/><br/>Upon finishing, Greedy Sleeper’s gaze swept across the pavilions.<br/><br/>Yang Yuanzi did not speak, instead, he closed his eyes.<br/><br/>Seven days were plenty for each vein to take the stage, and the defeated could continue to challenge as long as there were disciples left to fight.<br/><br/>Soon, the Peak Master of the fifth vein spoke up: “The fifth vein challenges the second vein!”<br/><br/>As the words fell, one of his disciples flew onto the platform, followed shortly by one from the second vein. Four elders sat at each side of the platform, who immediately cast spells to activate the Formation. The Magic Artifacts on the edges emitted a faint white light. Droiecting a barrier that exDanded and connected with other barriers until they formed a complete enclosure.<br/><br/>Once the Formation was set, Greedy Sleeper declared the battle to begin.<br/><br/>The combatants on both sides were from the Spirit Elixir Realm, clearly both were intent on getting off to a good start. Fang Wang watched intently, also wanting to see what combat in the Spirit Elixir Realm was like.<br/><br/>The battle with Li Honggang had ended too quickly, so he still wasn’t clear on how typical Spirit Elixir Realm combat was conducted.<br/><br/>But then again, the fifth channel’s pretty hard-headed, huh, challenging the second channel that’s ranked third among the top three!<br/><br/>As soon as the fight began, the two disciples conjured their life-bound Magic Artifacts and commenced long-distance combat by quickly casting spells; various spells were unleashed, causing continuous explosive sounds.<br/><br/>The combat platform was exceptionally sturdy; no matter the spell it endured, its surface remained as smooth as jade, without a scratch.<br/><br/>The disciples residing in the Sect’s Main City were all watching the battle, discussing with their friends, keeping the entire city bustling with noise.<br/><br/>The first battle lasted the duration of half a stick of incense. The second channel’s disciple was victorious. Instead of stepping down, that person continued to face the next challenger.<br/><br/>“Master, who will go on stage first later?”<br/><br/>Li Yu asked, not as excited as the other disciples from different channels, since the recent iterations of the Nine Veins Combat Method had been nothing but days of humiliation for them.<br/><br/>Yang Yuanzi, with his eyes closed, said, “You decide.”<br/><br/>Upon hearing this, Li Yu turned his head towards the other disciples, his brows slightly furrowed.<br/><br/>“Who could be White Garment Astonishing Swan?”<br/><br/>Li Yu thought to himself, the name of White Garment Astonishing Swan was famous throughout the Cultivation World, and of course, he had heard of it. Anyone capable of utilizing the Jinghong Divine Sword Art must belong to the third channel, but Yang Yuanzi and the elders of the third channel all denied this, which led him to boldly surmise that White Garment Astonishing Swan might be a direct disciple.<br/><br/>Soon, Li Yu’s gaze fell on Fang Wang as he asked, “Fang junior brother, would you be willing to take the lead?”<br/><br/>Fang Wang nodded and said, “Naturally, I am willing!” But if I go up, then you’ll have no chance at all!<br/><br/>“Brother Fang will definitely do it!” Zhou Bo sycophantically said.<br/><br/>Indeed, Zhou Bo also made it into the nine spots for the third channel, which made Fang Wang suspect that he might have gotten in through backdoor connections.<br/><br/>The other disciples looked at Fang Wang with curiosity and scrutiny. As a direct disciple from the get-go, this halo was too heavy, leading many disciples to hold him to even higher expectations.<br/><br/>Gu Li shook her head slightly and sighed silently, it seemed she wouldn’t have the chance to go on stage today at least.<br/><br/>The match between the second channel and the fifth channel continued for an hour, culminating in the defeat of the fifth channel. The fifth channel suffered five severe injuries, a rather tragic outcome.<br/><br/>The elders surrounding the combat platform were numerous, and with Greedy Sleeper on the platform, there was no chance of a disciple dying.<br/><br/>Next up was the ninth channel, which, starting out at the bottom, surprisingly challenged the first channel. Fang Wang then found out that in the previous Nine Veins Combat Method competition, the ninth channel had ranked fourth. The audacity of the fourth challenging the first, as hard-headed as the fifth channel.<br/><br/>The first contestant from the first channel wasn’t Lu Yuanjun nor Zhou Xue, but this disciple was strong, winning four consecutive matches with a magic sword before calmly stepping down to make way for another.<br/><br/>Fang Wang silently compared the two, and Li Honggang probably was no match for this first channel disciple.<br/><br/>The first channel was truly the strongest peak!<br/><br/>In less than half an hour, the peak competition came to an end with the first channel declared the victors. They only lost one match and had only four participants in the entire event; Zhou Xue did not take the stage.<br/><br/>“It seems like Zhou Xue holds a high status in the first channel.”<br/><br/>Fang Wang was curious. Zhou Xue had been gone for three years; upon her return, what abilities did she demonstrate to gain such a status?<br/><br/>Disciples throughout the city lamented the first channel’s strength, while the disciples of the first channel shared in the glory, each one brimming with pride.<br/><br/>“Which channel would like to challenge next?”<br/><br/>Greedy Sleeper stood on the combat platform and inquired. As his words fell, the voice of Yang Yuanzi rang out, “The third channel challenges the fifth channel!”<br/><br/>As soon as these words were spoken, the entire city erupted in commotion!<br/><br/>The fifth channel had just failed to challenge the second channel, suffering five severe injuries. How much time had passed, and the third channel was taking advantage of their weakened state?<br/><br/>This was Yang Yuanzi’s initial plan. Fang Wang had thought that after the fifth channel’s defeat, Yang Yuanzi might change his mind, but he didn’t.<br/><br/>Goodness me, it appears that the Nine Veins Combat Method is serious business, with hidden currents flowing beneath!<br/><br/>The disciples of the third channel looked towards Fang Wang, who, without a word, walked to the edge of the pavilion, leaped, and landed on the combat platform.<br/><br/>“It’s you, kid, you’ve grown up fast,” Greedy Sleeper winked at Fang Wang and teaSed\t\t\t\t\t\t</div>", "images": {}, "success": true}