{"id": 45, "url": "https://www.novelhall.com/i-became-an-immortal-on-mortal-realm-32879/14237604.html", "title": "Chapter 45 - Chapter 45: Chapter 43 Promotion_L", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 45 - Chapter 45: Chapter 43 Promotion_L</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 45: Chapter 43 Promotion_l<br/><br/>Translator: 549690339<br/><br/>Facing the colossal fire dragon before him, Xu Lang’s pupils suddenly narrowed; he wasn’t scared but instead immediately twisted his waist and grasped his sword, his body spinning in mid-air, sending out fierce Sword Qi that swiftly severed the Solaris True Fire Dragon.<br/><br/>Streaks of Sword Qi rained down wantonly, Fang Wang wielding the Heavenly Palace Halberd to block, the dueling platform being bombarded by Sword Qi, even causing ripples to appear on the formation’s light screen at the edge of the platform.<br/><br/>“Such immense Spiritual Power!”<br/><br/>“Brother Xu Lang is so strong, his Sword Qi is wide-open and fierce—extremely sharp!”<br/><br/>“Fang Wang is also very strong. He’s not a bit inferior.”<br/><br/>“Only three years since he started, and Fang Wang has already become this powerful?”<br/><br/>“Even if Fang Wang loses this battle, he has proven that he has the potential to match Lu Yuanjun!”<br/><br/>All the disciples from various parts of the city were discussing, giving Fang Wang and Xu Lang extremely high praise, with the Fang Family Disciples holding their breath in anticipation, even more nervous than Fang Wang himself.<br/><br/>Fang Hanyu stood in front of a window, looking up at the Golden Mirror in the sky, his expression calm as he muttered to himself, “How much longer do you intend to test him?”<br/><br/>In his heart, Fang Wang was unbeatable.<br/><br/>As if he had heard Fang Hanyu’s words, Fang Wang suddenly leaped backward, evading the range of Xu Lang’s Sword Qi attack.<br/><br/>Before touching the ground, Fang Wang raised the Heavenly Palace Halberd high, his left hand casting a spell swiftly. Spiritual Power surged through his right arm into the Heavenly Palace Halberd, and, above the dueling platform, thunderclouds materialized out of thin air, swiftly enveloping the entire platform.<br/><br/>At this moment, all the elders around the platform were moved; Greedy Sleeper’s eyes widened as he muttered to himself, “No way… How is this possible…”<br/><br/>The Peak Masters from all veins straightened up, and all the elders and disciples turned their attention to the thunderclouds above the platform.<br/><br/>Xu Lang, suspended in mid-air, quickly landed, holding his sword with both hands and looking up, his sword-like eyebrows tightly knit as he slowly uttered the five words, “Great Celestial Thunder Technique!”<br/><br/>Peals of thunder could be heard by disciples all over the city, the atmosphere intensely oppressive. Before the Great Celestial Thunder Technique, other disciples had cast grand spells, but none were as sensational as this.<br/><br/>Guang Qiuxian, Yang Yuanzi, Lu Yuanjun, and Zhou Xue all remained indifferent, but even those who knew the true identity of White Garment Astonishing Swan, including Zhou Xing Shi, Gu Li, and Fang Hanyu, couldn’t help but be moved.<br/><br/>In their memory, Fang Wang was a master skilled in swordsmanship; this was the first time they had seen him cast the Great Celestial Thunder Technique.<br/><br/>Started three years ago, mastering the Jinghong Divine Sword Art’s thirty-six forms, and now he has also perfected such a powerful lightning spell?<br/><br/>Having previously heard about White Garment Astonishing Swan casting the Great Celestial Thunder Technique, it was only facing it directly that they realized the terrifying nature of this technique.<br/><br/>Fang Wang held the Heavenly Palace Halberd high, with thunderclouds churning overhead, lightning interweaving, the terrifying oppressive power getting ready to strike; at this moment, he appeared like a deity wielding the power of heaven and earth, his long hair dancing in the wind.<br/><br/>Xu Lang, sensing danger, immediately charged at Fang Wang.<br/><br/>He threw his bamboo sword first, which turned into a streak of cold light, racing toward its target, aiming directly at Fang Wang’s head.<br/><br/>So fast!<br/><br/>Greedy Sleeper almost intervened but managed to restrain himself.<br/><br/>Fang Wang used Shadowless Step to dodge; Xu Lang followed, closing in on him, his left hand gripping his Lifespirit Sword inversely, the invisible sword blade slashing towards Fang Wang’s neck.<br/><br/>In a flash, Fang Wang swung the Heavenly Palace Halberd downward.<br/><br/>Clang—<br/><br/>As the two Lifespirit Treasures clashed, Xu Lang felt a dragon’s roar exploding by his ear, causing him a moment of disorientation. When he opened his eyes again, Fang Wang had already soared into the sky.<br/><br/>Above him, thunder and lightning raged; Fang Wang looked down indifferently at Xu Lang and then swung the halberd downwards.<br/><br/>The Great Celestial Thunder Technique erupted!<br/><br/>Dozens of bolts of lightning suddenly struck down, varying in size but enough to cover the entire dueling platform.<br/><br/>Facing the apocalyptic might of the lightning, Xu Lang released the sword in his hands. Casting a spell with both hands, the bamboo sword and the invisible sword revolved around him, rapidly spinning, with Sword Qi emanating from his body.<br/><br/>Lightning struck him, only to be dispersed by the crisscrossing Sword Qi, failing to harm him.<br/><br/>The interweaving Sword Qi around Xu Lang swiftly grew stronger, forming into an array, a Sword Qi storm rising from the ground, equally awe-inspiring, but soon he was engulfed by lightning bolt after lightning bolt.<br/><br/>Boom! Boom! Boom…<br/><br/>The dueling platform trembled violently, and even the formation’s light screen at the edge trembled. The whole city was silent; all disciples fixated on the scene within the Golden Mirror.<br/><br/>Greedy Sleeper held a Golden Mirror, shielding against the impact of the Great Celestial Thunder Technique. His gaze locked onto the place where Xu Lang stood before, and even as the lightning was dazzling, he didn’t blink.<br/><br/>After more than three breaths since Xu Lang’s figure vanished, Greedy Sleeper could no longer hold back and immediately threw the Golden Mirror in his hand.<br/><br/>The Golden Mirror burst forth with golden light, dispersing the lightning along its path, quickly reaching the center of the dueling platform, its powerful glow blocking the sky-high lightning.<br/><br/>Seeing this, Fang Wang cut off his Spiritual Power, no longer sustaining the Great Celestial Thunder Technique.<br/><br/>The thunderous roar in the sky faded, but the dark clouds couldn’t dissipate swiftly, and all eyes looked beneath the Golden Mirror.<br/><br/>As the lightning receded, Xu Lang’s figure appeared. He was half-kneeling on the ground, gasping for air, with his robe tattered, hair disheveled, and wounds all over his body. Bloodstains were everywhere, and the two swords orbiting him slowed down before clattering to the ground with two sounds.<br/><br/>Struggling to raise his head, Xu Lang tried to locate Fang Wang but collapsed before he could, losing consciousness.<br/><br/>The scene made Fang Wang breathe a sigh of relief. Xu Lang truly was formidable; it was difficult to defeat him with just the Solaris True Fire. That’s why he used the Great Celestial Thunder Technique, a Superior Spell Art of the Great Abyss Gate, not as difficult to learn as the Jinghong Divine Sword Art, so it didn’t risk exposing his identity as the White Garment Astonishing Swan.<br/><br/>In aiming for a strong victory over Xu Lang, Fang Wang did not hold back when using the Great Celestial Thunder Technique.<br/><br/>“It’s a pity I can’t challenge Lu Yuanjun in my prime condition,” Fang Wang thought to himself, his tone casual but his heart heavy with the Spiritual Power he had expended against Xu Lang.<br/><br/>Greedy Sleeper immediately shouted, “Victory goes to Fang Wang of the third vein!”<br/><br/>An elder quickly ascended the stage to check on Xu Lang’s injuries.<br/><br/>All the disciples from the different veins looked at Fang Wang with fear, and a hush fell over the entire city.<br/><br/>“Could that have been the Great Celestial Thunder Technique?” a male disciple from the first vein asked with a trembling voice.<br/><br/>The Great Celestial Thunder Technique was one of the most potent thunder spells of the Great Abyss Gate, and even though the sect was not known for its lightning spells, the prestige of the Great Celestial Thunder Technique was significant, with a considerable reputation even within the Da Qi Cultivation Realm.<br/><br/>After hearing about Fang Wang’s background through the introductions of Zhou Xue and Lu Yuanjun, the disciples in the pavilion of the first vein realized his origins.<br/><br/>Within three years of joining, and with such swift improvement in his cultivation, he had mastered the Great Celestial Thunder Technique…<br/><br/>Such talent…<br/><br/>Could even Lu Yuanjun from those years really compare?<br/><br/>After a brief silence, shouts of joy and amazement erupted throughout the city.<br/><br/>Fang Wang turned to look towards the first vein, and as his gaze sought out Lu<br/><br/>Yuanjun, Yang Yuanzi’s voice came through, “Change!”<br/><br/>Upon hearing this, the disciple from the first vein about to enter the fray released a sigh of relief.<br/><br/>Even Xu Lang, second only to Lu Yuanjun, had faced a bitter defeat; they dared not step up.<br/><br/>The Nine Veins Combat Method had reached this point, and Fang Wang was the most ruthless, leaving every opponent severely injured.<br/><br/>Amid cheers from the city, Fang Wang flew up to the pavilion of the third vein to be greeted by the enthusiastic crowd of disciples.<br/><br/>“Junior Brother Fang, you have surpassed me!” Li Yu exclaimed excitedly, seemingly unconcerned about the possibility of Fang Wang taking his position as the top disciple.<br/><br/>The other disciples also praised Fang Wang’s strength. The most exaggerated<br/><br/>was Zhou Bo, who seemed almost ready to kneel and worship him.<br/><br/>Lu Yuanjun stood inside the pavilion, watching Fang Wang from afar, and chuckled softly, “It seems I underestimated Junior Brother Fang’s strength.”<br/><br/>The disciples from all veins marveled at Fang Wang’s prowess; his strength after merely three years of joining was unprecedented, not even seen in Lu Yuanjun in his early years.<br/><br/>With Zhou Xue, Ye Xiang, and Gu Li having all made a name for themselves previously, all the disciples felt the rise of Great Abyss Gate was imminent.<br/><br/>Once, an Earth Origin Spirit Treasure appearing every hundred years was rare, but now four had emerged in succession within the Great Abyss Gate, surely a blessing from heavens unto the sect.<br/><br/>Fang Wang and Zhou Xue, due to their formidable strengths, were considered Earth Origin Spirit Treasures as well.<br/><br/>“Fang Wang, take a good rest now. You don’t need to go up on stage again, your wins are enough to secure you a spot in the final nine,” Yang Yuanzi’s voice reached his ears, calm in tone as if Fang Wang’s performance hadn’t shocked him, but a closer look would reveal his tightly gripped chair armrest.<br/><br/>Inside the Main Meridian pavilion.<br/><br/>Sitting beside Guang Qiuxian was Vice Sect Leader Chen Anshi, who appeared just over fifty, his build slightly lean but more commanding than the affable Guang Qiuxian, exuding a pressure through his demeanor.<br/><br/>“Brother, with this child being so formidable, could he be that person hiding in Shiyuan Hall that day?” Chen Anshi glanced at Guang Qiuxian, his gaze sharp as he slowly asked.<br/><br/>Guang Qiuxian smiled without a word, seeming composed while feeling deeply moved inside.<br/><br/>Is this what a Heaven Yuan Spirit Treasure is like?<br/><br/>Such power in just three years…<br/><br/>Unaware of the thoughts of the Sect Leader, Vice Sect Leader, and the elders, Fang Wang, learning he could ascend to one of the nine final seats, began excitedly envisaging his second Lifespirit Treasure!<br/><br/>After entering the Great Saint’s Grotto-Heaven and gathering Heavenly<br/><br/>Materials and Earthly Treasures, he would certainly break through to the Spirit Elixir Realm, which should allow the formation of his second Lifespirit Treasure.<br/><br/>If the first Lifespirit Treasure was a halberd, what should the second one be?<br/><br/>He had to think carefully; perhaps the Heavenly Palace wouldn’t interfere with his second Spiritual Refinement..\t\t\t\t\t\t</div>", "images": {}, "success": true}