{"id": 59, "url": "https://www.novelhall.com/i-became-an-immortal-on-mortal-realm-32879/14240531.html", "title": "Chapter 59 - Chapter 59: Chapter 57 True Combat Technique Great Perfection 1", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 59 - Chapter 59: Chapter 57 True Combat Technique Great Perfection 1</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 59: Chapter 57 True Combat Technique Great Perfection 1<br/><br/>Translator: 549690339<br/><br/>“Golden Scale White Feather Robe!”<br/><br/>Xiao Zi exclaimed with surprise, becoming excited as soon as it saw the magical garment floating inside the grand hall. This proved that it had not led them astray.<br/><br/>Despite its seemingly unwavering confidence along the way, it secretly feared not finding the Golden Scale White Feather Robe. Fang Wang was decisively ruthless, and Xiao Zi was filled with fear towards him, so it usually tried to flatter him.<br/><br/>Fang Wang did not proceed directly but instead used the Sword Control Technique, sending the Rainbow Sword that was planted in the ground soaring into the hall. It quickly approached the Golden Scale White Feather Robe and gently touched it with the white light of the sword blade.<br/><br/>There was no reaction.<br/><br/>He had the Rainbow Sword circle around the Golden Scale White Feather Robe five times before flying around the grand hall. After repeating this process for the duration of an incense stick, and assuring there were no traps, he then advanced, carrying the Heavenly Palace Halberd.<br/><br/>“My lord, you are truly cautious,”<br/><br/>Xiao Zi praise timely, and Fang Wang had grown accustomed to its flattery.<br/><br/>When he reached the Golden Scale White Feather Robe, he looked up to see the robe floating in mid-air, with the golden dragon energy coiling around it vividly, as if it were a dragon’s soul.<br/><br/>Looking at the golden scales on the robe, Fang Wang instantly fell in love. The pure white base of the robe was not merely white but also had faint patterns. The chest was embroidered with a series of majestic flying creatures that appeared different when viewed from various angles, and one had to be close to see them clearly.<br/><br/>“How do I take it?”<br/><br/>Fang Wang asked softly as he fixed his gaze on the Golden Scale White Feather Robe.<br/><br/>Xiao Zi shook its head and said, “This, I do not know. Maybe just take it directly?”<br/><br/>Upon hearing this, Fang Wang lifted the Heavenly Palace Halberd and used the tip to lift the Golden Scale White Feather Robe down. In an instant, the Golden Scale White Feather Robe’s golden light retracted, and all the surrounding golden dragon energy disappeared, causing the whole grand hall to darken.<br/><br/>Just like that, the Golden Scale White Feather Robe fell into Fang Wang’s hands. He immediately placed the robe into his storage bag, preparing to find another place to refine and lift its restrictions.<br/><br/>Powerful magic artifacts possess their own recognition restrictions, much like passwords, which must be refined before one can wholly control them and unleash the artifact’s true power.<br/><br/>Fang Wang was about to turn and leave when he suddenly saw faintly glowing letters on a wall—something that only became visible after the golden light faded.<br/><br/>He stepped forward, arriving at the wall to take a closer look.<br/><br/>Xiao Zi also lifted its serpent head as the grand hall fell into silence.<br/><br/>Three lines of text was all it took for Fang Wang’s brows to raise, joy surging in his heart. It seemed to be a secret technique containing the patterns of a cultivation method.<br/><br/>He pulled Xiao Zi out of his clothes and instructed, “You watch the surroundings for me.”<br/><br/>Xiao Zi snapped to attention and promptly climbed on his shoulder, alert to their surroundings.<br/><br/>As line after line of text caught Fang Wang’s eye, he gradually felt as if he was watching a figure practicing. The figure was not practicing Inner Strength but various movements, even weapons and magic artifacts.<br/><br/>Fang Wang became engrossed in what he saw. Although there were only a few hundred characters, it made him feel as though he was reading an epic tale.<br/><br/>After a long while, when the figure in Fang Wang’s pupils ceased its movements, his consciousness exploded, and his vision blurred.<br/><br/>When he opened his eyes again, Fang Wang found himself within the Heavenly Palace.<br/><br/>He showed a bitter smile, as he had been so immersed in the secret technique that he had entered a state of self-forgetting.<br/><br/>This secret technique was profound and unfathomable, and he felt that he would need at least two hundred years.<br/><br/>Taking a deep breath, he stood still and began to recall the secret technique he had just memorized. With the assistance of the Heavenly Palace, all his confusions unraveled one by one, with more and more insights flooding his mind.<br/><br/>True Combat Technique!<br/><br/>This technique was neither Inner Strength nor a Body Tempering Technique but a method of combat. When cultivated to Great Completion, one could develop a Combat Heart, mastering any and all weapons and magic artifacts to an extraordinary degree, even forcibly using those not yet acknowledged by their owners. Moreover, it also provided immunity to various attacks from artifacts, like bewilderment or illusions targeting the body and spirit.<br/><br/>Of course, the control over and resistance to magic artifacts provided by the True Combat Technique also depended on one’s own cultivation level. If the gap in cultivation between oneself and the enemy was too vast, the True Combat Technique could not bridge the disparity.<br/><br/>The Combat Heart allowed its bearer to enter a state where they were wholly and undistractedly devoted to battle, with a fighting spirit that could even dominate other emotions, for example, forgetting fear and shedding cowardice when facing an invincible enemy.<br/><br/>A very domineering secret technique!<br/><br/>Fang Wang grew even more curious about this Great Saint.<br/><br/>The Heavenly Gang Sheng Ti Zhen Gong, True Combat Technique, and Nine Dragons Divine Transformation Art were all methods that transcended those of the Da Qi Cultivation Realm!<br/><br/>He began to practice the True Combat Technique, needing to master various types of weapons as a prerequisite to entering the beginner level. Within the Heavenly Palace, he could freely create weapons and magic artifacts.<br/><br/>However, he underestimated the difficulty of mastering the True Combat Technique.<br/><br/>For just the weapons detailed in the records, it took him a full thirty years to fully master them. He could use each weapon as nimbly as if it was an extension of his own body.<br/><br/>Next was the cultivation of magic artifacts, and Fang Wang continued his practice.<br/><br/>In the Heavenly Palace, he neither ate, drank, nor slept, with one day equaling two regular days in the mortal realm. Fortunately, the necessity to switch between different types of magic artifacts allowed him to retain a sense of novelty, albeit barely.<br/><br/>He practiced the True Combat Technique incessantly for a hundred years, but eventually began to feel the monotony.<br/><br/>Later, using the Heavenly Palace Halberd to practice the True Combat Technique, he managed to suppress the boredom within his heart.<br/><br/>But the time it took to practice the True Combat Technique far exceeded his expectations.<br/><br/>By the time he had cultivated the True Combat Technique to the Great Perfection Realm, his heart had become numb, his eyes devoid of spirit. He turned his head to look, and the fantasy clock inside the Heavenly Palace showed that four hundred and twenty-six years had passed.<br/><br/>This was the secret technique he had cultivated for the longest time to date!<br/><br/>The repression of over four centuries filled his heart with an indescribable fury, making him want to destroy everything.<br/><br/>During the cultivation process, he often doubted himself, wondering why he strove so hard, why he sought the ultimate secret technique — just as Zhou Xue had said, with the cultivation techniques he currently possessed, cultivating peacefully and steadily might well enable him to reach the pinnacle of the Cultivation World.<br/><br/>But every time he remembered his ordinary life in his previous incarnation and the dangers his family faced in this one, he would suppress the negative emotions and force himself to continue cultivating through gritted teeth.<br/><br/>Yet the repressed emotions always lurked within him!<br/><br/>Fang Wang’s vision blurred, and the next second, he was back in reality.<br/><br/>Within the dimly lit great hall, lines of glowing text appeared before his eyes; he took a deep breath as if time had separated him from his past self.<br/><br/>Majestic spiritual energy from all directions surged toward him, frantically entering his body, billowing his robes, startling Xiao Zi into leaping away.<br/><br/>Xiao Zi looked at Fang Wang anxiously and asked tentatively, “Master, what’s wrong with you?”<br/><br/>Fang Wang did not answer, instead closing his eyes in silence.<br/><br/>He was condensing the Combat Heart!<br/><br/>The Combat Heart was located within the body, and its formation would also transform his physical form, making his body compatible with the True Combat Technique.<br/><br/>Seeing that he wasn’t speaking, Xiao Zi didn’t dare to disturb him.<br/><br/>For some reason, it felt that Fang Wang was very angry, with a hostility emanating from him that made it quite agitated. The great hall sank into silence, extremely oppressive.<br/><br/>An hour passed.<br/><br/>Fang Wang stopped absorbing the spiritual energy of the world; his heart had been metamorphosed into the Combat Heart. At first glance, there was no change in appearance, but when he opened his eyes, they shone with an ultimate combativeness, both wildly confident and resolute.<br/><br/>“Did you remember it?”<br/><br/>Fang Wang asked with a calm tone.<br/><br/>Xiao Zi was momentarily puzzled, then quickly replied, “The secret technique on the wall? I remember it, but I don’t understand it!”<br/><br/>“Then let’s go.”<br/><br/>Fang Wang turned and walked toward the main gate, carrying the Heavenly Palace Halberd.<br/><br/>He had no intention of destroying the palace walls, leaving the opportunity for those who came after him. Even if someone obtained it, cultivating the Combat Heart would be exceedingly difficult.<br/><br/>Xiao Zi hurriedly followed, jumping onto his shoulder, as it tilted its head and tentatively gazed at his profile.<br/><br/>It always felt that Fang Wang had become a different person, which made it wonder with a bold thought in its heart.<br/><br/>Could it be that the master was possessed?<br/><br/>On the way back, there were occasional ghosts blocking the path, but upon seeing Fang Wang, they all avoided him, not daring to attack.<br/><br/>The journey was unobstructed.<br/><br/>Once Fang Wang stepped out of the temple’s main gate and stood on the edge of the cliff at the mountainside, he spread his arms, basking in the baptism of sunlight.<br/><br/>Behind him, on the temple gate, still hung a corpse, eerily terrifying.<br/><br/>“Sigh…’<br/><br/>Fang Wang exhaled deeply, only at this moment feeling truly alive.<br/><br/>“Master, are we going to look for other inheritances?” Xiao Zi asked in a low voice.<br/><br/>Upon hearing this, Fang Wang’s body tensed, and he said gravely, “No need, let’s stop here. Find a place to cultivate!”<br/><br/>He feared being trapped for another four hundred years — that would be too unbearable!<br/><br/>Besides, the techniques he currently mastered were sufficient!<br/><br/>Although the True Combat Technique was a supportive cultivation technique, it would definitely multiply his strength many times over and would serve as his new trump card.<br/><br/>“I know of a place rich in spiritual energy, inhabited only by demonic beasts.<br/><br/>Would you like to go, master?”<br/><br/>“Lead the way.”<br/><br/>Upon hearing this, Xiao Zi immediately pointed in a direction. Fang Wang leapt up, transforming into a white rainbow that streaked across the sky!<br/><br/>The White Rainbow Evasion Technique!<br/><br/>He didn’t need a flying sword; he could fly on his own!<br/><br/>With the aid of the True Combat Technique, his physical body was already comparable to a magic artifact!<br/><br/>Xiao Zi almost got blown away; it quickly burrowed into Fang Wang’s embrace, trembling within the folds of his clothing.<br/><br/>“Master, you’re so fast….”\t\t\t\t\t\t</div>", "images": {}, "success": true}