{"id": 50, "url": "https://www.novelhall.com/i-became-an-immortal-on-mortal-realm-32879/14238307.html", "title": "Chapter 50 - Chapter 50: Chapter 48 Legend, True Skill Map [Seeking Monthly Pass]_L", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 50 - Chapter 50: Chapter 48 Legend, True Skill Map [Seeking Monthly Pass]_L</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 50: Chapter 48 Legend, True Skill Map [Seeking Monthly Pass]_l<br/><br/>Translator: 549690339<br/><br/>Upon first sight of the white-clad woman, Fang Wang immediately sped up, deploying the White Rainbow Evasion Technique again. His right hand smoothly sheathed the Qingjun Sword and summoned the Heavenly Palace Halberd. Only by holding the Heavenly Palace Halberd did his sense of safety increase to its maximum.<br/><br/>He glanced back once more and discovered the white-clad woman had vanished, but he had no intention of stopping.<br/><br/>Then, ten breaths later.<br/><br/>“Have you ever heard of the Great Saint’s Heaven Subjugation?”<br/><br/>The voice of the white-clad woman echoed once again; Fang Wang dared not respond, fearing that it was a trick, especially since he had read ‘Journey to the West’.<br/><br/>Fang Wang stole a glance and noticed the white-clad woman appeared behind him yet again, and this time, she was even closer.<br/><br/>Without a word, he turned and thrust the halberd. The blade pierced through the body of the white-clad woman without a drop of blood flying out—her garments didn’t even tear!<br/><br/>A ghost!<br/><br/>No wonder he couldn’t sense her presence!<br/><br/>Fang Wang’s eyes narrowed as the Solaris True Fire blazed from his right hand, swiftly climbing along the halberd toward the white-clad woman, reaching her in the blink of an eye.<br/><br/>The Solaris Flame, capable of burning souls!<br/><br/>As expected, the white-clad woman immediately stopped, and the distance between them widened quickly.<br/><br/>The white-clad woman furrowed her brows slightly, then with a wave of her sleeve, she dispelled the Solaris True Fire surrounding her, and the next second, she disappeared into thin air.<br/><br/>Fang Wang could not afford to be careless; this creature had a knack for appearing and disappearing unpredictably, so he had to remain vigilant.<br/><br/>Throughout the journey that followed, Fang Wang maintained full speed, and<br/><br/>the voice of the white-clad woman did not reach him again.<br/><br/>He frequently looked back but did not see the figure of the white-clad woman.<br/><br/>Half an hour later.<br/><br/>Fang Wang landed on the riverbank, an open plain that allowed him space for rest.<br/><br/>He stabbed the Heavenly Palace Halberd into the ground and looked around for a good while. Once he was sure the white-clad woman wouldn’t appear, he finally let out a sigh of relief.<br/><br/>He wondered how the man in black, who was previously being chased, fared now.<br/><br/>Fang Wang tossed the Green Snake onto the ground, then drew the Qingjun Sword and stabbed it into the serpent’s belly.<br/><br/>A delicate, feminine cry sounded. As the Green Snake opened its eyes, Fang Wang’s left hand instantly seized its head, suppressing it with his spiritual power.<br/><br/>The Demonic Qi of the Green Snake was startling, but it wasn’t enough to instill fear in Fang Wang; otherwise, he wouldn’t have dared to bring it with him.<br/><br/>“Don’t kill me… don’t kill me… I can lead you to treasures!”<br/><br/>The Green Snake cried out in a panic, its plea enough to soften the hearts of most men, but Fang Wang remained unaffected.<br/><br/>He couldn’t afford to pity a snake; the hand holding the sword began to tighten, causing the Green Snake to shriek even more pitifully.<br/><br/>“I know the location of the inheritance site of the Great Saint’s<br/><br/>Grotto-Heaven!”<br/><br/>Upon hearing this, Fang Wang halted his hand, narrowing his eyes as he asked,<br/><br/>“What inheritance site?”<br/><br/>The Great Saint’s Grotto-Heaven used to belong to the Ji Hao Sect and might contain its legacy.<br/><br/>Even today, Fang Wang still coveted the Heavenly Gang Sheng Ti Zhen Gong.<br/><br/>It was said that the Heavenly Gang Sheng Ti Zhen Gong was no less formidable than the Nine Dragons Divine Transformation Art, a cultivation technique Zhou Xue did not acquire before her rebirth.<br/><br/>After ascending to immortality, Zhou Xue could not return to the mortal realm, and many regrets became eternal.<br/><br/>“Many inheritance sites…” the Green Snake replied between sobs.<br/><br/>Fang Wang narrowed his eyes and asked, “Does the Great Saint’s<br/><br/>Grotto-Heaven have the Heavenly Gang Sheng Ti Zhen Gong?”<br/><br/>“The Heavenly Gang Sheng Ti Zhen Gong? That is the strongest cultivation technique of the Ji Hao Sect, no, but I’ve seen its map somewhere!”<br/><br/>The Green Snake answered promptly, fearful that Fang Wang might act, as it still had a Superior Grade Magic Artifact embedded in its belly.<br/><br/>After some consideration, Fang Wang decided to give it a chance.<br/><br/>He could encounter another Demon Core, but a guide was hard to find.<br/><br/>However, he had to be cautious of a sneak attack from the Green Snake.<br/><br/>Fang Wang pulled out the Qingjun Sword, stepped back, and took the Heavenly Palace Halberd with him. The Green Snake turned over, coiled itself, and looked at Fang Wang, its tongue flickering out, somehow managing to look wrongfully accused.<br/><br/>After retreating to a distance of five zhang, Fang Wang settled down to meditate and began Qi gathering. He seemed to have his eyes closed, but his consciousness remained on the Green Snake.<br/><br/>If the Green Snake tried to flee, he would not hesitate to kill it. Even if it managed to escape, it would be no great loss.<br/><br/>Before long, Fang Wang sensed some of the nature’s spiritual energy in the vicinity being absorbed by the Green Snake, indicating that it was healing itself.<br/><br/>Silence fell along the riverside.<br/><br/>Time slowly passed.<br/><br/>The mysterious woman in white no longer appeared, seemingly scared of the Solaris True Fire.<br/><br/>Dusk gradually descended.<br/><br/>The river water glistened, with tiny fish stirring within.<br/><br/>The Green Snake raised its head, looked at Fang Wang, and kept flicking its tongue. It plucked up the courage to ask, “Young Master, how did you escape the evil spirit’s pursuit?”<br/><br/>Fang Wang didn’t even open his eyes as he replied, “I just used some small tricks. By the way, she kept asking you whether you had heard of ‘Great Saint Slaying Heaven’. What does this mean?”<br/><br/>The Green Snake heard that his tone was no longer filled with intent to kill, and secretly breathed a sigh of relief. It answered, “The evil spirit is not simple; she is a servant of an ancient Great Saint. Legend has it that in ancient times, the Heavenly Dao was ruthless; the Heavenly Gods descended and wreaked havoc on the common folk. The Great Saint stood up, slaughtered the Heavenly Gods, but as a result, calamity befell him, and he eventually fell. The reason she’s asking is to see if the people of later generations remember this. If they do, she would grant them a way to live; if not, then death.”<br/><br/>Fang Wang raised his eyebrows slightly; at first, he thought ‘Slaying Heaven’ was the Great Saint’s name, but it turned out to be a legend.<br/><br/>“Since you know the legend, why did you get caught?”<br/><br/>“Because I have been trapped here for over three hundred years. She has caught me several times, and now even giving the correct answer is useless…”<br/><br/>The Green Snake said grievously and then opened the floodgates of its complaints, “Originally, I was just a helpless little green snake. Three hundred years ago, on a certain day, an eagle snatched me away, but halfway through, a cultivator killed the eagle, and I fell to the ground. I survived against all odds, and later I accidentally crawled into a crevice and somehow ended up in the Great Saint’s Grotto-Heaven. It’s been three hundred years, and I want to leave, but I can’t escape no matter what. Young Master, I know you can’t fully trust me, but please believe that I also want to leave. By following you, I could have a glimmer of hope for survival.”<br/><br/>Fang Wang decided to test it for a while, saying, “For the next month, I’ll cultivate here. You help me collect Heavenly Materials and Earthly Treasures. If you perform well, I’ll take you out.”<br/><br/>The view here was wide and open, and if any enemies approached, he would be able to detect them early on, which was better than being trapped in a dead corner.<br/><br/>Hearing this, the Green Snake asked cautiously, “May I rest for a few days?”<br/><br/>“Of course.”<br/><br/>Upon hearing Fang Wang’s answer, the Green Snake relaxed a lot.<br/><br/>In the following days, the Green Snake didn’t disturb Fang Wang and focused on healing its injuries.<br/><br/>After six days, the Green Snake left.<br/><br/>Fang Wang’s Spiritual Power had recovered, and he began to walk along the river, looking to see if there were treasures nearby.<br/><br/>Unfortunately, after walking for several dozen miles, he found no Heavenly<br/><br/>Materials and Earthly Treasures, and he had to return the same way he came.<br/><br/>Rumble—<br/><br/>The ground suddenly vibrated. Fang Wang looked up toward the edge of the sky and land, feeling the direction of the vibrations.<br/><br/>This time, he didn’t join the commotion but continued his cultivation in place, waiting for the Green Snake to return.<br/><br/>If the Green Snake didn’t come back after a month, he would leave on his own, as if nothing had happened. If the Green Snake did come back, he could use it to search for treasures and legacies-<br/><br/>As the sun set and the moon rose, Fang Wang sat within the boundless world, facing the river as he cultivated, feeling the Essence of the Sun and Moon and the breeze of Spiritual Energy. Cultivating in such a state of mind was more comfortable than cultivating in a cave dwelling.<br/><br/>Occasionally, cultivators passed by, but none dared to disturb him; disciples of various sects were very cautious within the Great Saint’s Grotto-Heaven.<br/><br/>In the blink of an eye.<br/><br/>Half a month passed, and the Green Snake finally returned.<br/><br/>Fang Wang glanced over, frowning as he watched it slither toward him, annoyed.<br/><br/>Nothing at all!<br/><br/>Could this snake be playing tricks?<br/><br/>The Green Snake quickly came to Fang Wang’s side, opened its mouth, and spat out fist-sized stones, each a different color, numbering five in total, and then it spat out a scroll of paper.<br/><br/>Fang Wang raised an eyebrow, quite intrigued.<br/><br/>“Young Master, these stones contain rich Spiritual Energy and should be considered Heavenly Materials and Earthly Treasures. And this map, it’s a map for the Heavenly Gang Sheng Ti Zhen Gong cultivation technique. It took a lot of effort to find it. Now you can trust me, right?” the Green Snake said, flicking its tongue.<br/><br/>Fang Wang stared at it and asked, “I almost killed you; why didn’t you take this opportunity to flee and find other cultivators to take you out?”<br/><br/>“Almost killing me is not the same as killing me. Besides, other cultivators may not be as strong as you are, to have escaped from that evil spirit. Your strength must be very formidable. There are countless evil spirits and terrifying demons in the Great Saint’s Grotto-Heaven; it’s safer to follow you.”<br/><br/>The Green Snake’s answer seemed sincere, and Fang Wang reluctantly believed it.<br/><br/>He drew out the Qingjun Sword and used the blade to spread open the map. After carefully memorizing it, he activated the Solaris Spiritual Power within him, igniting the Solaris True Fire, and directed it down the Sword Blade onto the map.<br/><br/>The map instantly ignited, causing the Green Snake to exclaim in shock. Although it didn’t understand, it did not dare to intervene.<br/><br/>Fang Wang did this out of fear that the Green Snake was up to some trick, perhaps poisoning the map.<br/><br/>Smoke rose and created a barrier between Fang Wang and the Green Snake.<br/><br/>Fang Wang suddenly frowned; why was the map so difficult to burn?<br/><br/>The might of the Solaris True Fire was fierce. After ten breaths, only one-fifth of the map had been burned, which was enough to show its unusual material.<br/><br/>Just then, as the rising smoke condensed into a figure, Fang Wang stood up, immediately conjuring a Heavenly Palace Halberd. The Green Snake was also startled and leapt farther away than Fang Wang.\t\t\t\t\t\t</div>", "images": {}, "success": true}