{"id": 56, "url": "https://www.novelhall.com/i-became-an-immortal-on-mortal-realm-32879/14239966.html", "title": "Chapter 56 - Chapter 56: Chapter 54 There Is Always A Way Out_1", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 56 - Chapter 56: Chapter 54 There Is Always A Way Out_1</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 56: Chapter 54 There is Always a Way Out_1<br/><br/>Translator: 549690339<br/><br/>A sword slashed out, its Sword Qi carrying the Solaris True Fire at an extremely fast speed, nearly in an instant it swept past seven women in white, causing their figures to momentarily pause.<br/><br/>Fang Wang swept his cold gaze over them, and the seven women in white immediately retreated and then vanished into thin air.<br/><br/>Without any further obstacles, Fang Wang smoothly landed in the monastery.<br/><br/>“They ran away just like that?”<br/><br/>Xiao Zi in Fang Wang’s arms excitedly exclaimed, it had guessed Fang Wang was strong, but it hadn’t expected him to be this strong.<br/><br/>In Great Saint’s Grotto-Heaven, it wasn’t afraid of demonic beasts, nor of cultivators, but it was scared of this group of female ghosts in white.<br/><br/>Fang Wang didn’t pay it any attention, he moved forward, his spiritual consciousness spreading out, remaining vigilant of his surroundings.<br/><br/>All throughout the monastery were signs of battle left behind, sword scars, bloodstains, burnt half talisman papers, and everything else, all of which was startling.<br/><br/>Fang Wang’s gaze fell on the main hall of the temple ahead, where it was pitch black, a cool breeze surged out from within, and struck his face, blowing his sideburns.<br/><br/>He stepped into the main hall at a leisurely pace, and as his vision became clear, he saw a gaping hole on the dark hall’s wall, occupying the entire wall space.<br/><br/>“It smells strongly of blood inside.”<br/><br/>Xiao Zi flicked its tongue and said, and before it had spoken, the smell had already reached Fang Wang.<br/><br/>He directly entered the hole, following the tunnel downwards, the white light from the Rainbow Sword blade illuminating the pathway, where bloodied handprints could be seen on the walls, and occasionally, he would step on broken bones.<br/><br/>It was hard to imagine what this tunnel had witnessed in the past.<br/><br/>The winding pathway led downwards, clearly towards the underground, Fang Wang maintained his pace, his spiritual consciousness always spread out, scouting ahead for any developments.<br/><br/>Meanwhile.<br/><br/>In an immense space underground, Gu Li, Ye Xiang, Yan Feiyue, and a female disciple from the Suspended Vast Sword Sect were seated cross-legged under a tree. Above their heads floated a Yellow Paper Umbrella, spinning on its own, emitting a faint light that enveloped the four.<br/><br/>Ghost souls wandered in front of them, and at the center of this underground space stood a massive old tree, its trunk so wide it would take at least twenty people to encircle it. Upon the tree coiled a black dragon!<br/><br/>Yes, a black dragon!<br/><br/>It had claws, a horn on its forehead, and its body was covered in black scales.<br/><br/>At a glance, it was as least twenty yards long, both terrifying and horrendous.<br/><br/>The female disciple from the Suspended Vast Sword Sect, Xu Tian Jiao, opened her eyes and frowned, “Xu Lang has been out for half an hour; could something have happened?”<br/><br/>As soon as she spoke those words, Gu Li and the others opened their eyes as well.<br/><br/>Ye Xiang, with a stern face, asked, “How much longer can your protective spirit hold out?”<br/><br/>Xu Tian Jiao answered, “At most, another two days.”<br/><br/>Gu Li’s brows were tightly knitted, while Yan Feiyue gritted her teeth.<br/><br/>“It’s all Xu Lang’s fault for insisting on coming here. With so many evil spirits, and even a Demon King present, we can’t even think about escaping…” Yan Feiyue muttered under his breath.<br/><br/>Ye Xiang and Gu Li didn’t argue, not because they agreed, but because they were too tired to waste their emotions on infighting.<br/><br/>“The pursuit of cultivation is essentially struggling against heaven; disasters and crises are inevitable. Although we seek immortality, to die on this path leaves no room for regrets.” Xu Tian Jiao spoke calmly.<br/><br/>Yan Feiyue was so frustrated he could only clench his fists, reluctant to rebuke a woman, for fear of appearing weak.<br/><br/>Suddenly, Xu Tian Jiao smiled and said, “We still have hope. When my brother arrives, he will surely rescue us.”<br/><br/>Upon hearing this, Ye Xiang and the others’ expressions varied; Gu Li appeared somewhat distracted, thinking of another person, Ye Xiang raised an eyebrow with a hint of unwillingness in her eyes, while Yan Feiyue’s expression was one of hope.<br/><br/>The four fell into silence once again.<br/><br/>Inside the tunnel, Fang Wang advanced with the Rainbow Sword in hand, accompanied by Xiao Zi, thus, he didn’t feel the nervousness of traversing unknown lands alone.<br/><br/>“Master, I feel a strong Demonic Qi, much stronger than the toad we encountered before.’<br/><br/>Xiao Zi spoke from Fang Wang’s embrace, its voice equally unruffled.<br/><br/>Ever since it fell into Great Saint’s Grotto-Heaven, it had never felt as relaxed as it did now. Following Fang Wang through these secret realms, it felt a sense of safety, which was the impression Fang Wang had given it.<br/><br/>Profound and unfathomable strength!<br/><br/>Fang Wang suddenly caught a familiar scent, as if he had encountered it somewhere before.<br/><br/>He quickened his steps.<br/><br/>Deeper within the tunnel, a figure staggered weakly forward, it was Xu Lang.<br/><br/>At that moment, Xu Lang was disheveled, his robe torn and covered in blood. His left arm was gone, and the shoulder was a blur of torn flesh as if he had crawled out of hell.<br/><br/>As he gasped for breath, he stumbled forward, his right hand trembling on the sword hilt, sweat rolling down his cheeks, which turned into droplets of blood as they fell.<br/><br/>“Is this as far as I go…”<br/><br/>Xu Lang felt a deep sense of unwillingness. He had ventured into this place desiring to grow stronger, to avenge his past humiliation.<br/><br/>Once, he was the top prodigy of the Great Abyss Gate, until he was defeated by Lu Yuanjun and fell from his pedestal. Since then, the gap between him and Lu Yuanjun had only widened even more, to the point where he was now defeated by a disciple who had only been in the sect for three years!<br/><br/>He seemed indifferent and of good spirits, but in reality, he was feeling extremely frustrated.<br/><br/>A cold wind blew from behind, and without even needing to turn around, he knew that evil spirits were closing in on him.<br/><br/>He was powerless to resist and could only press forward with all his might.<br/><br/>The tunnel was dim, and his vision was beginning to blur, everything in his eyes seemed to be spinning.<br/><br/>He knew he had reached his limit, his Spiritual Power exhausted, his strength spent, he had no hope left for survival.<br/><br/>Right then!<br/><br/>A white speck of light appeared in his field of vision, growing larger and larger in the darkness.<br/><br/>He stopped in his tracks, a bitter smile on his face.<br/><br/>Evil spirits were both in front and behind, there was no escape.<br/><br/>The white speck grew bigger and bigger until it whooshed past his ear with an intense force that jolted him awake, his vision suddenly clear.<br/><br/>Instinctively, he turned to look, and saw the ghosts behind him being pierced by the white light, one after another dissipating, that white light finally stopping at the bend in the tunnel.<br/><br/>What was that…<br/><br/>Xu Lang thought blankly, feeling as though he was dreaming.<br/><br/>“Brother Xu, are you here alone?”<br/><br/>A voice drifted over, startling Xu Lang into turning around and taking a look. Seeing the person, his expression changed drastically.<br/><br/>Fang Wang emerged from the darkness. Seeing Xu Lang’s dazed look and receiving no response, he couldn’t help but feel a bit awkward.<br/><br/>Had he mistaken the person?<br/><br/>Was this not Xu Lang?<br/><br/>Fang Wang still had a strong impression of Xu Lang; even after spending a hundred years in the Heavenly Palace, Fang Wang hadn’t forgotten him.<br/><br/>Xu Lang took a deep breath and said, “Gu Li, Ye Xiang, Yan Feiyue, they’re all inside… It’s too dangerous in there. I advise you not to go. There’s a Demon King lurking within. Even if you’re at the fifth level of the Profound Heart<br/><br/>Realm, you might not be its match…”<br/><br/>After all, Fang Wang had saved him, and he did not wish to see Fang Wang in danger.<br/><br/>He envied Fang Wang for defeating him, but what he wanted was not Fang Wang’s death, but to defeat Fang Wang fair and square, to prove himself!<br/><br/>Upon hearing that Gu Li was also inside, Fang Wang raised an eyebrow, brushed past Xu Lang, leaving behind a statement, “Brother Xu, rest here and recover from your injuries, lest more evil spirits emerge outside. As for the ones behind us, I’ll take care of them for you.”<br/><br/>With that said, Fang Wang quickened his pace.<br/><br/>Xu Lang turned around and just managed to see Fang Wang gripping the white light.<br/><br/>That seemed to be a sword…<br/><br/>A sword radiating dazzling light…<br/><br/>Fang Wang, with the Rainbow Sword in hand, moved swiftly forward. The evil spirits along the way couldn’t withstand a single strike from his sword, the Solaris True Fire being a true nemesis to lost souls and wild ghosts.<br/><br/>“Young master, you’re moving so fast, are you going to rescue someone?” Xiao Zi couldn’t help but ask.<br/><br/>Fang Wang replied, “I’m afraid my treasure will get snatched.”<br/><br/>Though that was what he said, in his heart he knew clearly that Gu Li and the others’ strength was definitely not on par with Xu Lang’s. If Xu Lang was nearly killed, what about Gu Li and the others?<br/><br/>His steps grew faster and faster, exterminating more and more evil spirits along the way, unstoppable, an unstoppable force.<br/><br/>Within the subterranean space.<br/><br/>Under the tree, Gu Li stared at the distant cave entrance, silently lost in thought. It wasn’t just her; the others too started to look toward the entrance as if sensing something, for all the lost souls and wild ghosts around seemed to be drifting toward that same opening.<br/><br/>Before long, shrill howls of evil spirits echoed from that entrance, terribly piercing.<br/><br/>“Is someone coming?” Ye Xiang asked with a frown.<br/><br/>Xu Tian Jiao revealed a smile and said, “Heaven never seals off all exits; it’s either a group of disciples coming to kill or my brother…”<br/><br/>Boom—<br/><br/>The distant cave entrance suddenly exploded, and violent Sword Qi carrying flames exterminated the wild ghosts one by one, the scorching blast hitting the giant tree head-on, disturbing the black dragon coiled upon it.<br/><br/>The dragon raised its head, looking toward the cave entrance.<br/><br/>Amidst the rolling dust, a figure emerged. Who could it be if not Fang Wang?<br/><br/>He walked with the Rainbow Sword slung in his right hand, the bright Sword Blade so radiant. His robes billowed fiercely, and a Green Snake head peeked out from his chest, also looking in the same direction, continuously flickering its tongue.<br/><br/>“Fang Wang?”<br/><br/>Gu Li called out in happy surprise, while Ye Xiang and Yan Feiyue displayed looks of astonishment.<br/><br/>Xu Tian Jiao frowned and said, “Fang Wang? The genius who defeated Xu<br/><br/>Lang?”\t\t\t\t\t\t</div>", "images": {}, "success": true}