{"id": 53, "url": "https://www.novelhall.com/i-became-an-immortal-on-mortal-realm-32879/14239278.html", "title": "Chapter 53 - Chapter 53: Chapter 51: The Ancient Great Formation, Crossing Thunder Tribulation_L", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 53 - Chapter 53: Chapter 51: The Ancient Great Formation, Crossing Thunder Tribulation_L</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 53: Chapter 51: The Ancient Great Formation, Crossing Thunder Tribulation_l<br/><br/>Translator: 549690339<br/><br/>“Is everything ready? How can I accept this?” Fang Wang feigned hesitation.<br/><br/>Zhou Xue blinked and smiled, “If you feel embarrassed, then forget it. You can work on your breakthrough once we return. As a direct disciple, Yang Yuanzi will definitely help you with all his heart.”<br/><br/>“No need to be embarrassed. After all, we’re one family!”<br/><br/>“Mhmm.”<br/><br/>A warm feeling filled Fang Wang’s heart; ever since he stepped onto the path of cultivation, it had always been Zhou Xue taking care of him, and he hadn’t yet had the opportunity to repay her.<br/><br/>Only by cultivating diligently could he repay her!<br/><br/>Zhou Xue said, “Don’t always carry hatred in your heart. The road to cultivation is long. Da Qi is just a small corner of the world, and Great Abyss Gate is not the only sect where we will always stay. Remember, at any time, prioritize your cultivation. Only by getting stronger can you take revenge and obtain everything you desire.”<br/><br/>Fang Wang nodded. Zhou Xue had made everything clear, and he naturally wouldn’t act rashly.<br/><br/>After leaving the Great Saint’s Grotto-Heaven, he would continue to cultivate in seclusion, striving to reach the Condensation Spirit Realm as soon as possible and then to acquire the Heavenly Gang Sheng Ti Zhen Gong.<br/><br/>With the cultivation of the Condensation Spirit Realm and by relying on the<br/><br/>Great Perfection of Heavenly Gang Sheng Ti Zhen Gong, along with the Nine Dragons Divine Transformation Art, who in the entire Da Qi Cultivation Realm would be his opponent?<br/><br/>The two began to chat about interesting stories from the cultivation world, with Zhou Xue doing most of the talking, as she had been adventuring outside all these years.<br/><br/>Boom, boom, boom—<br/><br/>Thunderclouds surged, and the rain was incessant.<br/><br/>Fang Wang and Zhou Xue walked through the wilderness, over undulating hills, extending as far as the eye could see. The oppressive thunderclouds seemed as if the sky was about to collapse, and the thunder that roared like the anger of the gods added a touch of terror to the world.<br/><br/>Xiao Zi perched on Fang Wang’s shoulder couldn’t help but speak up, “Do we really have to go there? I nearly got struck by lightning just getting close last time. This place likely has an ancient formation left from the past.”<br/><br/>Ever since Xiao Zi was cursed with the Soul-Binding Curse, Fang Wang had allowed it to rest on his shoulder.<br/><br/>Six days had passed since that night.<br/><br/>The Great Saint’s Grotto-Heaven was bigger than Fang Wang had imagined; it was hard to believe how powerful the Great Saint of the past must have been to have created such a vast refuge.<br/><br/>Zhou Xue, without turning her head, said, “That’s right, there is indeed a large formation here. It seems the inheritance you received is extraordinary, allowing you to know so much. Fang Wang, once we get out of here, don’t let it go, keep it with you.”<br/><br/>“You…”<br/><br/>Xiao Zi trembled with anger but dared not curse out loud, as if it seemed keen to escape.<br/><br/>Fang Wang didn’t aggravate Xiao Zi; instead, he asked curiously, “Could it be that you intend to use this large formation to help me breakthrough?”<br/><br/>“Yes, this formation has stood for at least ten thousand years. The spiritual energy accumulated over time has transformed into the attribute of thunder and can substitute for the thunder attribute in heavenly materials and earthly treasures.”<br/><br/>Zhou Xue explained as her gaze was drawn to a rock formation.<br/><br/>Fang Wang followed her gaze and saw a man leaning against a boulder some distance ahead. Although his clothes were disheveled, they were not torn; he just lay there against the rock, motionless.<br/><br/>Zhou Xue didn’t slow down but kept moving forward.<br/><br/>As they approached, Fang Wang saw that the man was already dead, with his eyes wide open in death, and his vacant gaze fixed on the firmament.<br/><br/>Zhou Xue paused beside him, glanced over the body, and said, “There are no injuries; he must have been horrifically drained of his soul.”<br/><br/>Soul extraction?<br/><br/>Fang Wang’s first thought was of Lu Yuanjun, who loved doing such things.<br/><br/>Could Lu Yuanjun be nearby?<br/><br/>Fang Wang looked closely and saw that the storage bag had been taken and there were no rings or similar items on the corpse’s hands.<br/><br/>“Let’s keep moving. If someone unwelcome has taken our spot, then we’ll just have to avenge this Taiqing Gate disciple, ” Zhou Xue continued on her way, her words causing Xiao Zi to shiver slightly.<br/><br/>Fang Wang immediately followed her steps.<br/><br/>After they had walked a hundred steps, Zhou Xue summoned her Lifespirit Treasure, a zither. The instrument looked different from during the Nine Veins Combat Method – its wooden exterior was now marked with white lines.<br/><br/>Clutching the zither, she moved forward with an intense presence erupting, which astonished Fang Wang.<br/><br/>This presence was far stronger than Xu Lang at the Spirit Elixir Realm Ninth<br/><br/>Just how powerful she was, Fang Wang had no idea.<br/><br/>Deep down, Fang Wang had always harbored the desire to measure his strength against Zhou Xue’s, but he felt too embarrassed to voice it, especially given how much he owed her.<br/><br/>Lightning danced ahead, stirring gusts of wind that billowed their robes.<br/><br/>Lightning struck the mountains ahead, not touching the ground, but the might it radiated was frightening.<br/><br/>Thankfully, with Zhou Xue’s Lifespirit Treasure alongside them, they were spared from lightning strikes and did not even need to take cover.<br/><br/>After crossing the mountain peak, Fang Wang stood at the summit, overlooking the landscape below. Ten Zhang away there was a stone gate, and beyond it lay a stone staircase that stretched for ten-odd miles, leading to a towering peak that pierced the gathering storm clouds.<br/><br/>For some unknown reason, the sight of that peak tilled Fang Wang with an inexplicable sense of dread.<br/><br/>He had a premonition that his breakthrough would not come easily; hardships awaited him.<br/><br/>However, in front of Zhou Xue, he couldn’t show any weakness to avoid being looked down upon.<br/><br/>Fang Wang hurried to keep up with Zhou Xue’s pace, avoiding being struck by the rampant lightning as Xiao Zi crouched on his shoulder, quivering and daring not to speak a word.<br/><br/>After a while,<br/><br/>A figure leaped down from the distant peak, racing toward them; Fang Wang squinted and realized in astonishment that it was Lu Yuanjun.<br/><br/>Lu Yuanjun came skimming across the ground on his Flying Sword, with dozens of lightning bolts interweaving around him, neutralized by his Sword Qi, creating a rather spectacular scene.<br/><br/>Seeing Fang Wang and the other, he sped up and soon arrived in front of them, the lightning behind him fluttering like a cape in the air before dispersing in the wind.<br/><br/>“What brings you here? There aren’t many treasures left on this mountain; likely, disciples from other sects have already claimed them,” Lu Yuanjun asked with a smile.<br/><br/>Zhou Xue replied, ‘We are preparing to cultivate some thunder-based Spells.”<br/><br/>Upon hearing this, Lu Yuanjun nodded slightly, then turned to Fang Wang and asked, “Younger Brother Fang, how goes your progress? Do you need any<br/><br/>Heavenly Materials and Earthly Treasures to break through to the Spirit Elixir<br/><br/>Realm? If you lack anything, tell your Senior Brother, and I’ll help you find it.”<br/><br/>Fang Wang shook his head and smiled, “Thank you, Senior Brother, but I’m not in need at the moment.”<br/><br/>Lu Yuanjun nodded, as if he remembered something, and then asked with concern, “Junior Brother Fang, I heard that your Fang Family encountered a great calamity three years ago. Have you uncovered the truth yet? Your Senior Brother has connections in the mortal realm and can help you investigate.”<br/><br/>Having lived two lives, Fang Wang realized that he was being prodded for information.<br/><br/>He sighed and said, “It was done by the current Prime Minister, who has been beheaded by the Emperor. It’s infuriating; I really wish I could have executed him with my own hands.”<br/><br/>Upon hearing this, Lu Yuanjun’s face showed sympathy as he said, “Take solace. Da Qi is about to transform into a Cultivation Dynasty. This could be an opportunity for the Fang Family. Let go of the past and focus on advancing on the Path of Immortality.”<br/><br/>“Yes, thank you Senior Brother for your concern.”<br/><br/>“It’s nothing; your Senior Brother has not been of much help. Go on with your task; I won’t disturb you any longer.”<br/><br/>After speaking, Lu Yuanjun nodded to Zhou Xue then left on his sword.<br/><br/>Only when he had vanished into the horizon did Zhou Xue speak with a smile,<br/><br/>“I seem to have underestimated you; you are quite the secret-keeper.”<br/><br/>Fang Wang shrugged nonchalantly and said, “Once the seed of suspicion is sown, it becomes fear. The question is just how long he can restrain himself.” Zhou Xue chuckled and said no more, continuing to lead the way.<br/><br/>Xiao Zi cocked its head, curious about their conversation but not daring to ask.<br/><br/>Half an hour later.<br/><br/>On the cliffside, Fang Wang sat cross-legged on the ground, surrounded by various Heavenly Materials and Earthly Treasures, ranging from floral fruits and exotic plants to strange stones and unidentifiable objects.<br/><br/>Zhou Xue was busy drawing talismans; with each one she completed, she attached it to a stick and inserted it into the ground around the perimeter of the Heavenly Materials and Earthly Treasures.<br/><br/>Fang Wang glanced up and saw the thunderclouds overhead, the oppressive might of heaven making him quite uneasy.<br/><br/>“You don’t plan on having the Young Master face the Thunder Tribulation, do you?”<br/><br/>Xiao Zi, perched on a rock, couldn’t help but ask, earning an approving look from Fang Wang.<br/><br/>This snake was quite perceptive!<br/><br/>Zhou Xue, while continuing her drawing, responded, “It’s somewhat like crossing the Thunder Tribulation, but not as dangerous as the real ordeal. It will just be a bit painful, but the lightning will help different medicinal effects fuse better.”<br/><br/>Just a bit painful?<br/><br/>This was bad!<br/><br/>Fang Wang knew he was in deep trouble; the Immortal Venerable’s idea of ‘a bit painful’ was surely beyond mortal comprehension.<br/><br/>“You nasty woman, you don’t harbor ill intentions, do you? Young Master, do you really trust her that much? You can never see into a person’s heart. I’ve seen many cultivators who relied on each other upon arrival but turned on each other when they couldn’t leave!” Xiao Zi hurriedly tried to persuade Fang Wang.<br/><br/>Zhou Xue ignored Xiao Zi, focusing on her task.<br/><br/>Fang Wang was pleased with Xiao Zits attitude, but outwardly he maintained a righteous tone, “She is of my kind, together we’ve faced life and death; how can there be no trust?”<br/><br/>Nevertheless, he still felt apprehensive.<br/><br/>It was better to be cautious!<br/><br/>The Nine Dragons Divine Transformation Art was his reliance; Zhou Xue was unaware that he had mastered it.<br/><br/>“If I really wanted to harm your Young Master, would I need to waste so many Heavenly Materials and Earthly Treasures? As for snatching a body, I have no desire for a man’s body, and I have no need to perform such an action,” Zhou Xue replied irritably. After speaking, she glanced at Fang Wang with a meaningful look..\t\t\t\t\t\t</div>", "images": {}, "success": true}