{"id": 55, "url": "https://www.novelhall.com/i-became-an-immortal-on-mortal-realm-32879/14239965.html", "title": "Chapter 55 - Chapter 55: Chapter 53 Rainbow Sword, Golden Scale White Feather Robe 1", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 55 - Chapter 55: Chapter 53 Rainbow Sword, Golden Scale White Feather Robe 1</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 55: Chapter 53 Rainbow Sword, Golden Scale White Feather Robe 1<br/><br/>Translator: 549690339<br/><br/>Fang Wang immersed himself in spiritual refinement, and within the treasured spirit space, the handle of his sword had become clear, even the fine patterns etched upon it.<br/><br/>At first glance, the hilt looked exquisitely made, but it wasn’t breathtakingly<br/><br/>To make his sword stand out, Fang Wang turned the handle white, as if carved from pure jade, with the guard designed as a pair of dragon claws, the blade extending from between them.<br/><br/>But at that moment, he had no intention of creating the blade.<br/><br/>From the outside world, the sword handle above his head had successfully materialized, voraciously devouring nature’s spiritual energy.<br/><br/>“The grade is very high.”<br/><br/>Zhou Xue silently thought, with the Heavenly Palace Halberd as a precedent, she didn’t think Fang Wang’s second lifespirit treasure would be far off.<br/><br/>Time continued to pass.<br/><br/>Fang Wang kept infusing his aspirations for the second lifespirit treasure into the sword handle, which, feeling his intentions, began to glitter above his head, shining even more brightly in the daylight.<br/><br/>About another hour passed, and Fang Wang, who had been sitting in meditation, slowly stood up. He raised his right hand and grasped the sword handle above his head. The mist of spiritual energy enveloped his body, and the gazes of Zhou Xue and Xiao Zi inevitably fell upon his right hand.<br/><br/>Beams of sunlight penetrated the thunderclouds, slanting across the cliff, and the part of the hilt not touched by sunlight was flashing even more dazzlingly, like stars in the night sky.<br/><br/>Suddenly!<br/><br/>Fang Wang flicked his wrist, and a beam of white light burst forth from the dragon claw guard, dispersing the surrounding fog.<br/><br/>Xiao Zi’s snake eyes widened in shock, and Zhou Xue’s eyebrows slightly raised.<br/><br/>The white light took form as a sword blade, four fingers wide and a half-zhang long. Fang Wang, holding the sword with one hand, positioned the white light blade horizontally above his head. Looking up, the sword light reflected on his face, brightly shining.<br/><br/>A smile curled at the corner of Fang Wang’s mouth. He flicked his wrist upward, and the white light blade slashed toward the sky. The movement was not fast, but in an instant, the layers of thunderclouds parted as if cleft by a massive sword gash. The sight was staggering, leaving Xiao Zi with her snake mouth agape.<br/><br/>There was no sound, no flamboyant display of sword qi, but with just such a casual swing, the sky seemed to be split open – what a spectacular sight!<br/><br/>Joy gleamed in Fang Wang’s eyes. His concept for this sword wasn’t as fancy as poison release or soul capture; he wanted only sharpness, absolute sharpness that could cut through anything!<br/><br/>“This sword shall be named Rainbow Sword,”<br/><br/>Fang Wang murmured to himself, settling on a name for the sword.<br/><br/>No sooner had the words fallen than the Rainbow Sword in his hand erupted with a powerful aura, stirring the surrounding nature’s spiritual energy into a gale that swept in all directions.<br/><br/>The entire mountain trembled as if welcoming the descent of a Heavenly Monarch!<br/><br/>Xiao Zi clung tightly to the rocks, nearly being swept away.<br/><br/>Zhou Xue’s hair blew across her face, and she reached up to brush it aside, squinting at the Rainbow Sword in Fang Wang’s hand.<br/><br/>Fang Wang, feeling the momentum of the Rainbow Sword, was extremely pleased. This time the Heavenly Palace had not interfered with his forging because he wasn’t within the sect, so the event did not attract attention like the first spiritual refinement. Still, the might displayed by the Rainbow Sword was unquestionably powerful.<br/><br/>It was nothing Earth Origin Spirit Treasures could compare to!<br/><br/>As for whether it could match the Heavenly Palace Halberd, it was hard to say.<br/><br/>The Heavenly Palace Halberd itself contained immense power, and as Fang Wang’s cultivation grew higher, the more of its power he could wield; the limits of the Heavenly Palace Halberd were yet unknown.<br/><br/>He slowly lowered his arm, and the white light blade of the Rainbow Sword began to retreat, merging back into the guard, leaving only the hilt in his hand.<br/><br/>In future great battles, the Heavenly Palace Halberd in his right hand, the Rainbow Sword in his left — who could stand against him?<br/><br/>Fang Wang looked at the Rainbow Sword’s hilt in his hand, growing fonder the more he looked.<br/><br/>If this sword were put into an online game, it would surely be highly sought after.<br/><br/>What man doesn’t love a beam sword?<br/><br/>He wondered whether such a sword existed within the Cultivation World.<br/><br/>“Alright, get dressed.”<br/><br/>The voice of Zhou Xue came over, and only then did Fang Wang realize that he was still unclothed, standing tall and dignified.<br/><br/>He hurriedly placed the Rainbow Sword into the treasured spirit space and then reached for the storage bag not far away, pulling it toward him. He took out clothes and quickly dressed.<br/><br/>Once dressed, Zhou Xue said, “It’s time to part ways. I must continue searching for what I am seeking.”<br/><br/>“Do you need my help?” Fang Wang asked.<br/><br/>He sighed inwardly; being seen naked was truly an unpleasant feeling.<br/><br/>Zhou Xue shook her head and replied, “The place I’m going to is very dangerous. I’ll be better off acting alone. I’m leaving.”<br/><br/>With that, she turned around and leapt into the air. A flying sword emerged from her storage bag, rapidly enlarging and positioning underneath her feet, whisking her away towards the horizon.<br/><br/>Fang Wang watched her leave, feeling a tinge of regret.<br/><br/>It had always been Zhou Xue helping him, and he disliked the feeling of owing someone.<br/><br/>Only after Zhou Xue’s figure vanished did he withdraw his gaze, lifting both hands and simultaneously conjuring the Heavenly Palace Halberd and Rainbow Sword.<br/><br/>Whoosh—<br/><br/>The Rainbow Sword burst forth with a blade of white light, and although it wasn’t as long as the Heavenly Palace Halberd, its half-zhang length was absolutely considered very long among swords.<br/><br/>With both Lifespirit Treasures in hand, Fang Wang’s confidence surged.<br/><br/>He was now ready to challenge the Profound Heart Realm!<br/><br/>No matter who he encountered, he feared no one!<br/><br/>“Young Master, your two Lifespirit Treasures are really impressive, but I feel you lack suitable attire. I know a place where there’s a garment left behind by a Great Saint, known as the Golden Scale White Feather Robe. According to the legacy clues I’ve received, this robe is at least a supreme Magic Artifact!” Xiao Zi spoke, her tone unable to hide a hint of excitement.<br/><br/>The scene of Fang Wang swinging his sword at the heavens had stimulated her, and she felt that with Fang Wang, she could venture into those places she had previously dared not go.<br/><br/>“A supreme Magic Artifact?”<br/><br/>Fang Wang raised an eyebrow; such artifacts would cost at least a million contributions within the Great Abyss Gate and were not even guaranteed to be available for purchase. Supreme Magic Artifacts were priceless treasures, each one sparking a frenzy among the elders and Direct Disciples of various sects.<br/><br/>“Yes, at least. I’m not certain of the exact grade though,” Xiao Zi nodded, the sight of a snake nodding its head rather comical.<br/><br/>“Good. Let’s find a place to rest for a few days, and then go seek that Golden Scale White Feather Robe!”<br/><br/>Fang Wang, looking at the firmament, made the declaration. Zhou Xue had only just left, and the thunder was already starting to gather again, ready to strike at any moment.<br/><br/>Xiao Zi immediately crawled onto his shoulder as he stepped onto the Qingjun Sword, swiftly flying away from the area.<br/><br/>Seven days later.<br/><br/>Fang Wang landed on a rock, with Xiao Zi lying on his shoulder, staring ahead and flicking her tongue, “Young Master, it’s inside that monastery, but there are too many evil spirits lurking around, you must be careful.”<br/><br/>Without her reminder, Fang Wang already spotted several figures of women clad in white perched on the distant monastery walls.<br/><br/>He wondered if the woman in white who had once pursued him was among them.<br/><br/>Fang Wang leapt down from the rock, striding forward while taking in the scenery along the way.<br/><br/>The wilderness of this region was desolate, devoid not only of Heavenly Materials and Earthly Treasures but also scarce in common flora.<br/><br/>Marching forward, Fang Wang spotted bloodstains, clearly sprayed down from the sky, all pointing towards the monastery.<br/><br/>When he was less than half a mile from the monastery, he suddenly caught sight of a hand resting atop some broken stones.<br/><br/>Fang Wang lifted his eyes to the monastery gates and saw two corpses hanging there, disheveled, their genders indistinguishable.<br/><br/>He raised his right hand, and the Rainbow Sword appeared in his palm. With his right hand clasping the sword, a blade of white light quickly formed, followed by a wrapping of Solaris True Fire.<br/><br/>Solaris True Fire could harm evil spirits and wild ghosts—this was the confidence that emboldened him to venture here!<br/><br/>Following his gaze, the white-clad women atop the walls had already looked up, each revealing their pale faces, their hollow eyes all fixed on Fang Wang.<br/><br/>Xiao Zi immediately burrowed into the collar of Fang Wang’s chest, leaving only her snake head exposed.<br/><br/>Fang Wang didn’t mind her timidity and continued to advance.<br/><br/>Shortly after, he realized that one of the corpses hanging in front of the monastery gate was dressed in the robe of a Direct Disciple of the Great Abyss Gate. The robe was tattered, and one had to look closely to notice this fact.<br/><br/>The right sleeve of the corpse was shredded, the right hand missing; it seemed likely that the hand seen earlier on the road belonged to this corpse.<br/><br/>Fang Wang squinted, walking while trying to recognize the face of the corpse.<br/><br/>He had seen this person before, in the previous Nine Veins Combat Method, but the two had never interacted, making it difficult for him to recall the person’s name, especially since he had spent many years sitting in idleness at the Heavenly Palace.<br/><br/>When Fang Wang arrived at the monastery gate, the seven women in white began to float upwards.<br/><br/>Even in broad daylight, the sight of these ghosts rising was chilling.<br/><br/>Fang Wang raised his left hand and pointed from a distance, shooting out Sword Qi to slice off the storage bag at the waist of the corpse. He secured the bag to his own belt.<br/><br/>Only after doing this did he leap forward, ready to jump over the monastery wall and forcefully enter.<br/><br/>The seven women in white immediately lunged at him, but Fang Wang raised his hand and delivered a sweeping slash. A flash of white light appeared as the Sword Qi, ablaze with Solaris True Fire, swept across unstoppable..\t\t\t\t\t\t</div>", "images": {}, "success": true}