{"id": 58, "url": "https://www.novelhall.com/i-became-an-immortal-on-mortal-realm-32879/14240148.html", "title": "Chapter 58 - Chapter 58: Chapter 56: Forbidden Gate, Destroying Heaven And Earth 1", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 58 - Chapter 58: Chapter 56: Forbidden Gate, Destroying Heaven And Earth 1</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 58: Chapter 56: Forbidden Gate, Destroying Heaven and Earth 1<br/><br/>Translator: 549690339<br/><br/>“White Garment Astonishing Swan is indeed formidable. Have you already reached the fifth layer of the Profound Heart Realm?”<br/><br/>Xu Tian Jiao asked, her face full of admiration.<br/><br/>Yan Feiyue followed up, “Junior Brother Fang, impressive! I didn’t expect you to be White Garment Astonishing Swan, tsk tsk, truly concealing your talent. I feel that if you challenge Lu Yuanjun, you might not necessarily lose.”<br/><br/>Ye Xiang didn’t make a sound, but his gaze towards Fang Wang was mixed with numerous emotions.<br/><br/>Fang Wang didn’t answer about his cultivation level but said calmly, “I hope everyone won’t let out the fact that I am White Garment Astonishing Swan. I don’t want to be hunted by Green Cicada Valley.”<br/><br/>At this point, he could only make friends.<br/><br/>It had to be said, Xu Tian Jiao’s Yellow Paper Umbrella had broadened his horizons; he really hadn’t noticed the slightest sign before, knowing that his divine consciousness was already stronger than that of an ordinary Spirit Elixir Realm cultivator.<br/><br/>“Naturally, you saved our lives, and I certainly won’t speak of it,” Xu Tian Jiao replied earnestly.<br/><br/>Yan Feiyue and Ye Xiang nodded in agreement.<br/><br/>Fang Wang glanced at the carcass of the black serpent and said, “There are many evil spirits here. You all should leave first. Senior Brother Xu Lang is healing in the tunnel; take him and go.”<br/><br/>Upon hearing this, Yan Feiyue hesitated.<br/><br/>Xu Tian Jiao immediately bowed her fist and said, “Then we won’t disturb you.” With that, she sent a gaze to Yan Feiyue and Ye Xiang.<br/><br/>Ye Xiang immediately bowed his fist and followed Xu Tian Jiao as she left. Seeing this, Yan Feiyue had no choice but to give up.<br/><br/>Fang Wang looked at Gu Li and said, “Find a place to cultivate well, and don’t venture into such dangerous places again. Always measure your abilities before taking action.”<br/><br/>Gu Li nodded and softly said, “You be careful yourself.”<br/><br/>Though she wanted to stay by Fang Wang’s side, she was also afraid of being a burden to him.<br/><br/>Fang Wang let out a sigh of relief in secret as he watched them enter the tunnel they had come through, glad that Gu Li hadn’t insisted on staying.<br/><br/>He had saved Gu Li based on their friendship, and since she had given him the Record of Heavenly Materials and Earthly Treasures and Divine Nurturing Sword Qi, it was only right to save her.<br/><br/>As for deeper feelings, he didn’t want to think about them for the time being.<br/><br/>Being reborn and getting in touch with cultivation, he was certain cultivation must come first!<br/><br/>Even if he had to get married…<br/><br/>The image of Zhou Xue suddenly popped into Fang Wang’s mind, scaring him into a start and quickly casting aside the distraction.<br/><br/>Zhou Xue, a rebirth herself, would also not take love too seriously. He couldn’t afford to get distracted, lest he show weakness in front of her.<br/><br/>They were comrades fighting side by side!<br/><br/>Fang Wang continued forward, checking the area to make sure he didn’t overlook any Heavenly Materials and Earthly Treasures.<br/><br/>His attitude was to take whatever he saw; as long as it was useful, he didn’t care whether he needed it now or not, he would take it all!<br/><br/>The underground space fell silent again, and from time to time, ghosts peered out of the holes, but upon seeing Fang Wang still there, they all shrank back, not daring to approach.<br/><br/>Fang Wang found a huge Lingzhi mushroom growing on a massive tree, flesh-pink, as large as a human face; no wonder it wasn’t listed in the Record of Heavenly Materials and Earthly Treasures, as it contained an extremely rich concentration of nature’s spiritual energy. No wonder the Black Dragon had made its den here.<br/><br/>About two hours later, Xiao Zi finally finished collecting the treasures of flesh and blood. It had to be said that the Black Dragon was a treasure throughout its body.<br/><br/>Fang Wang took all the treasures of flesh and blood scattered on the ground into his storage bag, thankful that his bag was large enough.<br/><br/>Xiao Zi had turned into a blood serpent and tried to jump onto Fang Wang’s shoulder, but he refused.<br/><br/>“Wait until you clean up before getting on my shoulder,” Fang Wang’s words left Xiao Zi feeling quite wronged, yet she didn’t dare to argue.<br/><br/>Afterward, Xiao Zi began eating the blood and flesh of the Black Dragon.<br/><br/>The difference in size between them was more than a hundredfold, but Xiao Zi ate extremely fast, and in less than half an hour, only a skeleton remained.<br/><br/>Fang Wang stared at the Xiao Zi in front of him and noticed it was almost three feet long, now a large snake.<br/><br/>Hmm, she can’t lie on me anymore.<br/><br/>As if sensing Fang Wang’s thoughts, Xiao Zi immediately belched and then her body shrank, becoming only a meter long, and she also shed her skin. The new skin was very delicate, clean, and now turned a bluish-purple color.<br/><br/>Apparently, her name wasn’t chosen wrongly.<br/><br/>“Young Master, may I climb up now?” Xiao Zi asked with a coquettish voice, and just from hearing her voice, you would think a gentle and beautiful young woman was acting coy.<br/><br/>Fang Wang opened up the front of his robe, allowing her to crawl inside.<br/><br/>After doing all this, he continued on his way to look for the Golden Scale White Feather Robe.<br/><br/>Having broken through to the Spirit Elixir Realm, his Spiritual Power was far greater than before, and the previous battle had only depleted a third of his Spiritual Power.<br/><br/>As he walked, he consumed Spiritual Energy Pills to recover his Spiritual<br/><br/>power.<br/><br/>The reason Xiao Zi knew about the existence of the Golden Scale White Feather Robe was because she had learned of it from a mural, and she had also seen a map, so now she could guide Fang Wang, saving a lot of trouble.<br/><br/>“What do you know about the story of this Great Saint?”<br/><br/>Fang Wang walked into the tunnel and, feeling suddenly inspired, asked. The Rainbow Sword lit up the tunnel, and his divine consciousness had already spread out.<br/><br/>Xiao Zi stared ahead, flicking her tongue as she said, “The Great Saint existed in ancient times, and I’m not clear about his specific name. All I know is that he offended the Immortal Gods above, brought a great disaster upon himself, and had many such cave dwellings. This Cave Heaven is just one of them.”<br/><br/>Just one of his cave dwellings?<br/><br/>That exaggerated?<br/><br/>Fang Wang grew even more curious about what realm the Great Saint was in. Why hadn’t he ascended if he was so powerful?<br/><br/>Every time Zhou Xue had spoken about ascension before, she had been ambiguous, as though ascension wasn’t as wonderful as it seemed. It wasn’t just a matter of reaching a certain level of cultivation for a cultivator in the human world to ascend; it also required a certain opportunity.<br/><br/>Fang Wang didn’t believe in superstitions. He believed there must be some Immortal Law out there, after all, immortals are omnipotent beings. Perhaps one day he would acquire the Immortal Law, and then, by cultivating in the Heavenly Palace, he would reach Great Perfection and become an immortal on earth.<br/><br/>If one could become an immortal on earth, without the need for ascension, wouldn’t that mean you could roam freely in the world? With this thought, Fang Wang’s heart grew hot.<br/><br/>A person must have grand goals!<br/><br/>Xiao Zits sweet, delicate voice echoed through the tunnel, making the dark passageway seem less frightening.<br/><br/>Footsteps came from the pitch-black cave entrance, and Fang Wang could be seen walking out with Xiao Zi peeking over his chest.<br/><br/>In front of them was a massive golden door, thirty feet long and fifty feet tall, with the engravings of two mysterious beasts with snarling fangs and claws, as if ready to leap out at any moment.<br/><br/>Xiao Zi spoke up, “Huh? Why is there a door here? It looks familiar… I seem to have seen this pattern somewhere before…”<br/><br/>Upon hearing this, Fang Wang couldn’t help but rub her snake head. How many secret realms had this creature snuck into?<br/><br/>Xiao Zi pondered for a moment before coming to a realization, “I remember now, this door is known as the forbidden door. It is said that only with the power to destroy heaven and earth can one break through this door and gain the Great Saint’s recognition.” The power to destroy heaven and earth?<br/><br/>That exaggerated?<br/><br/>Fang Wang was astonished. The fifth layer of the Profound Heart Realm couldn’t destroy heaven and earth. Since the Artifact Spirit let people in, it should want someone to inherit the Great Saint’s legacy. If so, there shouldn’t be a test that someone at the fifth layer of the Profound Heart Realm couldn’t shake at all.<br/><br/>Wait a minute!<br/><br/>The power to destroy heaven and earth…<br/><br/>Fang Wang seemed to think of something, his eyes lighting up.<br/><br/>He didn’t act immediately, instead he went to the side and began to meditate and gather Qi.<br/><br/>“You keep watch for me, I need to restore my Spiritual Power,”<br/><br/>Fang Wang instructed before closing his eyes, Xiao Zi then slithered out, taking position at the cave entrance, her snake head fixated on the darkness — the mouth of the cave looked like the gaping maw of an abyssal monster, ready to devour her at any moment.<br/><br/>Just like that.<br/><br/>Several hours passed by swiftly, and Fang Wang slowly stood up.<br/><br/>Xiao Zi perked up, excitedly asking, “Young Master, could it be that you’re thinking of using swordsmanship to force your way through?”<br/><br/>The power of the thirty-six astonishing sword moves had left a huge impact on her, and even now, the memory excited her.<br/><br/>Fang Wang walked over to the golden forbidden door. He planted the Rainbow Sword into the ground and his right hand began to form the Heavenly Palace Halberd.<br/><br/>“Xiao Zi, do not share the spell I’m about to perform with anyone else, not a single person,”<br/><br/>Fang Wang said seriously, and seeing him so solemn, Xiao Zi quickly nodded.<br/><br/>Fang Wang slightly shifted his right foot, a powerful aura burst forth suddenly, a visible blaze of energy swirling around him, startling Xiao Zi into stepping back.<br/><br/>This aura was even stronger than when Fang Wang had performed the thirty-six astonishing sword moves!<br/><br/>The fiery energy around him quickly turned black, enveloping his entire body and culminating in a black Dragon Head, far more imposing than the previous black flood dragon, with curved horns pointing skyward and whiskers fluttering.<br/><br/>Xiao Zits mouth hung open, her expression one of utter amazement.<br/><br/>Fang Wang, holding the Heavenly Palace Halberd in one hand, let out a low shout and thrust his right arm forward – a dragon’s roar exploded, and the colossal black Dragon Head surged towards the golden door. As it charged, part of its dragon body became visible, as if it had burst forth from an alternate dimension.<br/><br/>With a boom!<br/><br/>The Nine Dragons Divine Transformation Art unleashed divine power!<br/><br/>The golden door began to tremble, the Black Dragon roared furiously, deafening, and debris fell from the cavern ceiling.<br/><br/>In less than three breaths, the golden door began to open.<br/><br/>Standing within the Dragon Head, Fang Wang raised his eyebrows and stepped forward. The golden door opened with a bang, and the Black Dragon, as if breaking free from its prison, rushed madly inside.<br/><br/>Fang Wang immediately withdrew the halberd, and the domineering Black Dragon dissipated like smoke. The black smoke cleared, revealing a golden hall before him.<br/><br/>The hall was vast, with two rows of giant redwood columns. Looking straight ahead, Fang Wang’s gaze locked onto the center of the hall where a robe was suspended, surrounded by golden dragon energy and bursting with dazzling golden light. The reason the hall appeared golden was because of this robe.<br/><br/>The robe’s base color was white, with Golden Dragons on the shoulders, and delicate golden scales embedded on the forearms, waist belt, legs, and boots. The fluttering sleeves and hem resembled drifting white feathers, detailed patterns visible, exuding an ethereal immortal aura while also containing an indescribable oppressive force..\t\t\t\t\t\t</div>", "images": {}, "success": true}