{"id": 57, "url": "https://www.novelhall.com/i-became-an-immortal-on-mortal-realm-32879/14240140.html", "title": "Chapter 57 - Chapter 57: Chapter 55 The White Garment Astonishing Swan Slays The Dragon_L", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 57 - Chapter 57: Chapter 55 The White Garment Astonishing Swan Slays The Dragon_L</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 57: Chapter 55 The White Garment Astonishing Swan Slays the Dragon_l<br/><br/>Translator: 549690339<br/><br/>Fang Wang lifted his gaze and was dazzled by the sight of the black Jiao dragon on the huge tree. Although it had only two claws, its form and momentum were definitely the strongest among the demonic creatures he had ever seen. Xiao Zi spoke with an envious tone, “It’s about to transform into a Jiao.”<br/><br/>Fang Wang felt the Demonic Qi of the other party. Although astonishing, it was not yet to the extent that made him want to turn away in fear.<br/><br/>Having just broken through to the Spirit Elixir Realm, he also needed a battle to test his own strength.<br/><br/>Meanwhile, beneath a distant tree, Gu Li wanted to stand up but was held down by Xu Tian Jiao pressing on her shoulder.<br/><br/>“Do not act rashly. I have expended ninety percent of my Spiritual Power. Once the Formation is undone, it will be difficult to conceal ourselves again. If he managed to make it here alone, perhaps his strength is not bad. We should adapt accordingly and find an opportunity to save him,” Xu Tian Jiao said gravely, disappointment filling her eyes.<br/><br/>She had not waited for her elder brother, and she had heard of Fang Wang’s deeds. This youngster indeed possessed monstrous talent, even more exaggerated than her brother’s growth. However, with only a little over three years of cultivation, it probably took all he had to defeat Xu Lang at the Spirit Elixir Realm Ninth Level, so how could he possibly defeat the Demon King?<br/><br/>She was at the Profound Heart Realm first layer, and she had nearly died facing the Demon King.<br/><br/>Recalling the process of narrowly escaping danger earlier, she was still frightened. Now trapped here and unable to leave, she could only wait for rescue. She appeared calm, but her heart was in turmoil.<br/><br/>After hearing this, Gu Li felt it made sense. Her Spiritual Power had only recovered by half, and going out might not help Fang Wang; she might even become a burden to him.<br/><br/>She suddenly noticed Fang Wang glancing around as if searching for something.<br/><br/>Could it be that he was looking for her?<br/><br/>Gu Li’s heart skipped a beat. She felt she was being delusional since Fang Wang didn’t even know she was there.<br/><br/>But what if…<br/><br/>After all, Xu Lang had previously forced his way out.<br/><br/>Fang Wang indeed was searching for Gu Li’s figure, but he did not find her.<br/><br/>Fortunately, there were several cave entrances behind the huge tree. Maybe Gu Li and the others had hidden inside one of them.<br/><br/>Forget it!<br/><br/>First, slay the dragon!<br/><br/>A Jiao dragon is still a dragon!<br/><br/>For young men full of vigor, challenging a Jiao dragon was an achievement in itself!<br/><br/>Fang Wang advanced with his sword in hand, his garment fluttering. With every step he took, a sword shape appeared beside him.<br/><br/>“Mortal, do you intend to challenge this king alone?” the black Jiao dragon on the huge tree asked, its voice deep as thunder. As it spoke, it exhaled scorching breath, lifting its upper body to look down upon Fang Wang.<br/><br/>Fang Wang said, “Where is the Golden Scale White Feather Robe? If you tell me,<br/><br/>I might spare your life.”<br/><br/>As his words fell, nine sword shapes had already condensed around him, and his footsteps did not halt.<br/><br/>“The Jinghong Divine Sword Art… could he be the White Garment Astonishing Swan?” Xu Tian Jiao asked under the Yellow Paper Umbrella, furrowing her brows.<br/><br/>Gu Li did not respond. Ye Xiang and Yan Feiyue were both deeply moved.<br/><br/>The White Garment Astonishing Swan, with the use of the thirty-six moves of the Jinghong Divine Sword Art, led many to believe that the White Garment Astonishing Swan was Yang Yuanzi. Even if he did not admit it, only he seemed capable.<br/><br/>The Jinghong Divine Sword Art is an unparalleled sword technique. How could a Cultivator who is still at the level of a Disciple master thirty-six moves?<br/><br/>Seeing Fang Wang perform the Jinghong Divine Sword Art, they all felt it was ridiculous, even more so than seeing Xu Lang defeated at Fang Wang’s feet.<br/><br/>“Spare this king’s life? Arrogant! The Great Saint’s holy robe is not something you can covet! Seeking death!” the black Jiao dragon cried angrily, its roar echoing with the majesty of a dragon’s chant.<br/><br/>It charged furiously at Fang Wang, its massive body whipping up fierce winds. Ghosts from all directions likewise rushed towards Fang Wang, as if a thousand troops were thundering towards him, like a surging wave threatening to engulf him.<br/><br/>Gu Li and the others were incredibly tense, their eyes locked on Fang Wang.<br/><br/>Xu Lang, who was recuperating from his injuries inside the cave, faintly heard the Jiao dragon’s howl. He was sure he was not mistaken because the owner of that voice had once brought him to despair — his left arm was broken in its jaws.<br/><br/>Xu Lang took a deep breath and silently prayed for Fang Wang, hoping that Fang Wang would not die here.<br/><br/>Facing the ghosts attacking from all sides, Fang Wang did not retreat but advanced instead, stepping forward and swinging his sword.<br/><br/>The white blade of the Rainbow Sword burst forth with brilliant and intense light, and within that intense light, countless Sword Qi shot forth, slicing the ghosts in half.<br/><br/>Immediately after, he leaped into the air, and more sword shapes condensed out of thin air around him, reaching the number of thirty-six in almost an instant.<br/><br/>The faces of Gu Li and the others were illuminated by the intense light, and they all showed expressions of shock.<br/><br/>In their pupils, countless ghosts howled and struggled, and above the ghosts, the black Jiao dragon writhed its demonic body, biting towards the white-garbed figure in front of it. The man held a glowing sword, with thirty-six sword shadows floating behind him, like a sword deity battling the demonic dragon.<br/><br/>This vision was deeply imprinted in their minds.<br/><br/>Fang Wang held the sword in his right hand and thrust it forward. In an instant, the thirty-six sword shapes shot out with the Rainbow Sword, turning into a Sword Qi even larger than the black Jiao dragon itself.<br/><br/>The black Jiao dragon’s pupils suddenly constricted, and it instinctively opened its dragon’s mouth, spewing out terrifying black flames.<br/><br/>Boom—<br/><br/>The collision of two terrifying forces shook the entire underground space, causing sand and stones to tremble and fall.<br/><br/>The Sword Qi of Jinghong Divine Sword Art rampaged like a fierce storm in all directions, and the black Jiaolong’s raging flames managed to block it for only a moment. The combined force of thirty-six swords in one swept away the flames, charging head-on towards the black Jiaolong.<br/><br/>In the blink of an eye, the black Jiaolong twisted its demonic body, trying to dodge, but it was too late.<br/><br/>The powerful Sword Qi struck the demon’s body of the black Jiaolong, pinning it to a giant old tree; immediately after, the tree’s trunk split apart, sending up clouds of dust.<br/><br/>Boom, boom, boom—<br/><br/>As the Sword Qi slashed through, the giant old tree was cloven in two, and along with it, the demon’s body of the black Jiaolong was severed, and blood spurted out.<br/><br/>Amidst the howling wind, Fang Wang stood immovable, maintaining his thrusting sword stance, right arm forward, body slightly tilted to one side, his back to Gu Li and the others.<br/><br/>A sword that slew the dragon!<br/><br/>Even Gu Li, familiar with Fang Wang, couldn’t help but widen her beautiful eyes in shock. Xu Tian Jiao and Yan Feiyue were dumbfounded, while Ye Xiang reacted better, but his eyes were still filled with astonishment.<br/><br/>The invincible Demon King they saw in their eyes had been forcefully executed like this?<br/><br/>“Jinghong thirty-six swords… White Garment Astonishing Swan…”<br/><br/>Yan Feiyue muttered to himself, his voice trembling.<br/><br/>Fang Wang’s figure slowly descended, his strong Sword Qi dispersing the dusl around him, bearing witness as the giant old tree split to either side, and the two halves of the black Jiaolong’s demonic body slammed onto the ground, blood splashing everywhere.<br/><br/>“Wow! Young master, you’re so powerful!”<br/><br/>Xiao Zi woke up from shock, eagerly shouting in admiration.<br/><br/>It had been in Fang Wang’s embrace all along, and when previously confronted by the black Jiaolong, its snake body had gone stiff, overawed by the terrifying prospect of being swallowed by a dragon.<br/><br/>Fang Wang, carrying the Rainbow Sword, stepped forward.<br/><br/>The half-tomb-length Rainbow Sword could only be carried at an angle, its blade’s brilliance unperturbed by the swirling dust.<br/><br/>Fang Wang’s expression remained unchanged, but inside, he was sighing.<br/><br/>Sigh!<br/><br/>I’m too fierce!<br/><br/>To this day, no enemy had forced him to use the Nine Dragons Divine Transformation Art!<br/><br/>Fang Wang approached the Dragon Head of the black Jiaolong, which was filled with fear. It hurriedly cried, “Spare my life! Please let me go, senior… I will tell you where the Golden Scale White Feather Robe is hidden!”<br/><br/>Pchht!<br/><br/>The Rainbow Sword was thrust directly into the Dragon Head, the black Jiaolong shuddered, and then lay motionless.<br/><br/>Fang Wang couldn’t be bothered to waste words with it, to avoid the creature’s potential sneak attacks.<br/><br/>“Go and dig out its Demon Core, Demon Sinew, and Jiaolong gallbladder, and<br/><br/>other treasures.”<br/><br/>Fang Wang instructed, and Xiao Zi who was in his arms darted out at once.<br/><br/>He glanced around, and those ghosts that still lingered scattered in fear upon meeting his gaze, swiftly vanishing into various tunnels. Fortunately, no spirit dared approach the tunnel Fang Wang had come through.<br/><br/>Fang Wang began to walk around the old tree, looking to see if there were any other corpses.<br/><br/>“Fang Wang! ”<br/><br/>A familiar voice came through, filled with surprise, startling Fang Wang into turning his head. He saw four figures suddenly appear under a large tree in front of a cave wall, a Yellow Paper Umbrella hovering above their heads.<br/><br/>Fang Wang frowned; how had he failed to detect these four people earlier?<br/><br/>Gu Li quickly approached Fang Wang, her eyes full of admiration as she looked up at him.<br/><br/>Fang Wang spoke coldly, “This place is so dangerous, what are you doing here? Aren’t you afraid of dying?<br/><br/>It was rare for Fang Wang to reprimand her, but Gu Li wasn’t upset; she was still excited and softly asked, “Why did you come?”<br/><br/>Are you here to save me?<br/><br/>This question was buried in her heart, unspoken.<br/><br/>“Of course, I came for the treasure,” Fang Wang avoided her intense gaze and replied.<br/><br/>“Ah, so there was a beauty here after all, no wonder the young master rushed over in a hurry after hearing someone mention a few names!”<br/><br/>A surprised shout came from the demon corpse nearby; Xiao Zi poked its head out, covered in the black Jiaolong’s blood and gore.<br/><br/>Although Gu Li was surprised at the existence of Xiao Zi, her attention was captured by its words.<br/><br/>He really did come for her…<br/><br/>Her gaze towards Fang Wang grew even brighter, filled with tender emotions like water.<br/><br/>At that moment, Xu Tian Jiao and the other two approached; their eyes upon Fang Wang were extremely complicated.\t\t\t\t\t\t</div>", "images": {}, "success": true}