{"id": 52, "url": "https://www.novelhall.com/i-became-an-immortal-on-mortal-realm-32879/14238592.html", "title": "Chapter 52 - Chapter 52: Chapter 50: The Soul-Binding Curse, The Chosen One 1", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 52 - Chapter 52: Chapter 50: The Soul-Binding Curse, The Chosen One 1</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 52: Chapter 50: The Soul-Binding Curse, The Chosen One 1<br/><br/>Translator: 549690339<br/><br/>“Really?” Fang Wang said with a smile, not boasting, Zhou Xue meant that he would need her to save him if one day he was in deep trouble.<br/><br/>Zhou Xue walked to the fire and sat down, ignoring Xiao Zi beside her, while Xiao Zi, terrified, scurried to Fang Wang’s side and whispered, “Young Master, she has a powerful Ghost Instrument on her, I have felt this before in a secret realm.”<br/><br/>It didn’t know the past between Fang Wang and Zhou Xue, but it didn’t want Fang Wang to die here.<br/><br/>Zhou Xue looked at it with a smile that was more than a smile, “Maybe it’s the Ghost Instrument you’re thinking of.”<br/><br/>“You…” Xiao Zi trembled all over, instinctively moving closer to Fang Wang.<br/><br/>Zhou Xue looked at Fang Wang and said, “What, thinking of keeping a snake demon? Snakes are naturally lascivious, many cultivators love to keep snake demons; you better not neglect your cultivation because of this.”<br/><br/>“Nonsense!” Fang Wang glared at Zhou Xue. How could this woman speak so recklessly?<br/><br/>Xiao Zi blinked and said nothing more.<br/><br/>Zhou Xue liked to see Fang Wang get flustered; she covered her mouth with a laugh and said, “I’ll teach you a technique to control souls, so that this snake demon can never betray you. Are you willing?”<br/><br/>When Fang Wang heard this, his eyes suddenly lit up, “Great, tell me!”<br/><br/>Xiao Zi panicked but didn’t dare to refute, because it knew it couldn’t beat either of them.<br/><br/>Zhou Xue immediately started to teach the spell, and Fang Wang listened intently.<br/><br/>Xiao Zi was caught in painful indecision, unsure whether to flee.<br/><br/>The technique Zhou Xue was teaching was called the Soul-Binding Curse. Once it was cast on the soul of the other party, no matter how far apart they were, just by reciting the curse, the other party would be destroyed, and it didn’t need to be recited aloud; even thinking it would work.<br/><br/>During the process of listening, Fang Wang was surprised; wasn’t this beyond the scope of spells?<br/><br/>“Wait! Give me a moment!” Suddenly, Fang Wang asked Zhou Xue to stop and then took out pen and paper, quickly drawing a map.<br/><br/>Zhou Xue asked curiously, ‘What are you drawing a map of?”<br/><br/>Fang Wang replied, “Heavenly Gang Sheng Ti Zhen Gong, want to learn it? Wait until I find it, and I’ll teach you!”<br/><br/>Zhou Xue’s gaze grew strange as she said, “You’re really fixated on that technique. I don’t need any cultivation techniques or spells, and actually, neither do you. Just cultivating the Solaris Scripture is enough for you to reach the pinnacle of the human world.”<br/><br/>“I know it’s enough,” Fang Wang replied, “but if I can learn more, won’t I become stronger?” He wasn’t like Zhou Xue, whose head was filled with various peerless arts; at the very least, the Heavenly Gang Sheng Ti Zhen Gong was something he wanted to learn. Plus, he suspected that it combined with the<br/><br/>Nine Dragons Divine Transformation Art could unleash even greater power.<br/><br/>After quickly finishing the map, Fang Wang put it into his storage bag and then had Zhou Xue continue to explain the Soul-Binding Curse.<br/><br/>It took a good while longer before Zhou Xue finally finished.<br/><br/>Xiao Zi also listened to the whole process of the Soul-Binding Curse, and not understanding anything, felt it was very mysterious. It breathed a sigh of relief.<br/><br/>Such a complicated curse, Fang Wang should find it very hard to learn.<br/><br/>Zhou Xue looked up at Fang Wang and asked, “How about it, do you understand?”<br/><br/>Under the moonlight, Fang Wang hung his head slightly. He took a deep breath and said, “I understand, and I’ve got it.”<br/><br/>“Huh<br/><br/>“What?” Zhou Xue and Xiao Zi said at the same time, the former puzzled, the latter frightened.<br/><br/>Fang Wang had already become numb.<br/><br/>Damn it, luckily he had drawn the map ahead of time!<br/><br/>It took a full one hundred and eighty years to master this Soul-Binding Curse!<br/><br/>After returning to reality, his spiritual consciousness had greatly increased, and his senses had begun to sharpen, but he needed to calm down.<br/><br/>The process of cultivating the Soul-Binding Curse was more monotonous than cultivating either the Nine Dragons Divine Transformation Art or the Jinghong Divine Sword Art; at least the latter two could involve movement, but the Soul-Binding Curse was purely sitting still.<br/><br/>Sitting still for one hundred and eighty years!<br/><br/>Fang Wang needed to calm his emotions. He spread his arms wide and felt the air around him, finding comfort enveloping his entire body.<br/><br/>“You really learned it?” Zhou Xue asked with a complex look in her eyes, filled with both anticipation and unease.<br/><br/>Fang Wang tilted his neck and with his left hand, he tightly grasped the head of Xiao Zi.<br/><br/>“Ah! Young Master! Please no! Xiao Zi will never betray you!”<br/><br/>Xiao Zi emitted a mournful shriek, begging desperately.<br/><br/>Fang Wang brought it in front of him and looked into its eyes, saying, “Sorry, you pose a certain threat to me. Just behave, and once we leave the Great Saint’s Grotto-Heaven, I will release the Soul-Binding Curse and set you free.”<br/><br/>Having said that, his right hand began to form spells, and his eyes burst forth with a ghostly light.<br/><br/>Xiao Zi wept but dared not resist.<br/><br/>Zhou Xue knew he really had learned it when she saw him performing the spell, which made her gaze become subtle.<br/><br/>“Just hearing it and you can… such a talent… Could it be that he’s also a person with a destined fate? The person of destiny in the previous life was clearly not him. Could it be because he died too young, that the destined fate was transferred to someone else? Counting the years, he and that person were born in the same year…”<br/><br/>Zhou Xue’s eyes flickered as she kept her gaze fixed on Fang Wang.<br/><br/>Fang Wang had already practiced the Soul-Binding Curse to Great Perfection, and he quickly imprinted the curse onto Xiao Zi’s soul.<br/><br/>Every creature with intelligence would possess a soul, and although Xiao Zi had not transformed, it too possessed one.<br/><br/>Soon, Xiao Zi stopped struggling altogether, as though it had passed out, its mouth open wide with the forked tongue dangling at the edge.<br/><br/>The Soul-Binding Curse was a suppression of soul by soul, consuming not only Spiritual Power but also the strength of the soul. Moreover, the curse could control at most five souls at once; exceeding this number would cause backlash to the caster’s soul and reduce the suppressive force.<br/><br/>After a while.<br/><br/>Fang Wang placed the unconscious Xiao Zi beside him. Even as one of Great Perfection Realm, the first use of the Soul-Binding Curse still left him feeling faint.<br/><br/>“You indeed have learned it, but try not to use it in the future, as your Cultivation is still too low. I came to you this time to help you break through to the Spirit Elixir Realm,” Zhou Xue said, having regained her composure, making her inscrutable.<br/><br/>Fang Wang nodded, then inquired, “After I break through to the Spirit Elixir<br/><br/>Realm, should we deal with Lu Yuanjun inside the Great Saint’s<br/><br/>Grotto-Heaven? Together, we should be able to take him down, right? His<br/><br/>Cultivation is below the fifth layer of the Profound Heart Realm.”<br/><br/>The fifth layer of the Profound Heart Realm was the upper limit for those entering the Great Saint’s Grotto-Heaven, thus Lu Yuanjun’s Cultivation could be inferred.<br/><br/>On the night the Fang Residence was destroyed, perhaps it was the Emperor Zhao Zhen who had chosen to act, but Zhao Zhen worked for Lu Yuanjun, and everything started because Lu Yuanjun wanted to absorb souls. Zhao Zhen just took advantage of the situation to include the Fang Residence. Furthermore, Lu Yuanjun appeared kind and enthusiastic, but behind that facade, he had already caused the death of millions; eliminating him posed no moral dilemma for Fang Wang.<br/><br/>Zhou Xue raised a hand and pointed towards Xiao Zi from a distance before she continued speaking.<br/><br/>“No, the strength of Lu Yuanjun is not that simple. I am yet to investigate what exactly that Ghost Instrument is which absorbed millions of souls, because in my past life, he never used a Ghost Instrument, or at least, I never saw it. Additionally, the trouble with killing Lu Yuanjun is huge; Guang Qiuxian and Yang Yuanzi would become your mortal enemies.”<br/><br/>Hearing Zhou Xue, Fang Wang frowned.<br/><br/>He could understand why Guang Qiuxian was supporting Lu Yuanjun, but why would his master support him too?<br/><br/>Zhou Xue continued, “Lu Yuanjun’s biological parents were from the Demonic Path, but they died when he was three years old. It was Yang Yuanzi who brought him back to Great Abyss Gate. Both Guang Qiuxian and Yang Yuanzi were the close friends of Lu Yuanjun’s mother, and Yang Yuanzi even ventured alone into the Green Cicada Valley for her. This is a secret from the past of the Great Abyss Gate, only unveiled years later after Yang Yuanzi succumbed to madness and caused an uproar at the Great Abyss Gate.”<br/><br/>“And you still had me enter the third lineage?” Fang Wang was at a loss for words.<br/><br/>Zhou Xue huffed, “Joining any other lineage would be pointless since the Sect Leader is the one supporting Lu Yuanjun. I had you join the third lineage because I hoped you would encounter Yang Yuanzi sooner. Yang Yuanzi is exceedingly protective; he doesn’t have a good relationship with Lu Yuanjun. As long as you don’t kill Lu Yuanjun, he might even help you seize the position of Lu Yuanjun’s chief disciple, provided he doesn’t find out about the enmity between you two.”<br/><br/>Fang Wang’s frown deepened, as it seemed Zhou Xue was strategizing with Yang Yuanzi in mind.<br/><br/>“Lu Yuanjun can’t die, at least not now, because we need him to help transition Da Qi into a Cultivation Dynasty. Lu Yuanjun has a special background, and he has people behind him who could bridge both the righteous and demonic paths. Once Da Qi successfully transitions into a Cultivation Dynasty, a great opportunity will arise, one that even the Nine Great Sects collectively seek. After seizing that opportunity, we can kill Lu Yuanjun. Even if Guang Qiuxian and Yang Yuanzi intervene, we can still escape after the deed,” Zhou Xue reasoned.<br/><br/>“The most important thing is that the Fang Family needs time to grow. You and I can flee after killing Lu Yuanjun, but the Fang Family can’t. Understand? Just endure it for now,” she added earnestly. Fang Wang, hearing this, realized he couldn’t act recklessly.<br/><br/>He sighed, saying, “Why didn’t you say this before?”<br/><br/>“If you knew all this, how would you be able to face Yang Yuanzi?” Zhou Xue<br/><br/>retorted.<br/><br/>Fang Wang fell silent.<br/><br/>Zhou Xue stopped, leaving him to ponder.<br/><br/>Fang Wang then asked, “What about the Emperor Zhao Zhen?”<br/><br/>Zhou Xue replied calmly, “Once he leaves the Great Abyss Gate, I will kill him.<br/><br/>After his death, the Great Abyss Gate will support his heir to become the Emperor, as his role is no longer needed. We didn’t kill him before because we needed Zhao Zhen’s help for Da Qi’s transformation into a Cultivation Dynasty, as the matter involves families from both the Cultivation World and the mortal realm.<br/><br/>“Alright, we should prepare for your breakthrough to the Spirit Elixir Realm.<br/><br/>I’ve already gathered the Heavenly Materials and Earthly Treasures you’ll need. Next, we need to find a suitable place for the breakthrough..”\t\t\t\t\t\t</div>", "images": {}, "success": true}