{"id": 51, "url": "https://www.novelhall.com/i-became-an-immortal-on-mortal-realm-32879/14238591.html", "title": "Chapter 51 - Chapter 51: Chapter 49: Zhou Xue’S Tactics [Vote For Monthly Ticket]_L", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 51 - Chapter 51: Chapter 49: Zhou Xue’S Tactics [Vote For Monthly Ticket]_L</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 51: Chapter 49: Zhou Xue’s Tactics [Vote for Monthly Ticket]_l<br/><br/>Translator: 549690339<br/><br/>Fang Wang maintained a distance of three Zhang from the mysterious figure on the map. The figure gradually solidified amidst the curling smoke, appearing like a ghost materializing in broad daylight, an unsettling sight.<br/><br/>“What are you… What is this thing?”<br/><br/>Before Fang Wang could voice his question, Green Snake anxiously asked; it was more frightened than Fang Wang — partly out of genuine fear, and partly out of concern that Fang Wang would misunderstand.<br/><br/>The figure was blurred, with only its general outline visible. “Junior, do you aspire to lay hands on the Heavenly Gang Sheng Ti Zhen Gong?” An ancient voice came from the mysterious figure, calm and steady.<br/><br/>Holding the Heavenly Palace Halberd, Fang Wang replied, “Would it not be a pity if a good Cultivation Technique weren’t passed down?”<br/><br/>Currently, his physique wasn’t an advantage. The reason he could fight across levels was mainly due to Solaris Spiritual Power and Great Perfection Spells. The Heavenly Body was an ancient and powerful constitution, even applauded by Zhou Xue, so naturally, he coveted it.<br/><br/>“This map indeed records the location where the Heavenly Gang Sheng Ti Zhen Gong can be inherited, but the test there is stringent. If you had not burned this map, awakening a wisp of my will, and gone there rashly, you would have certainly died beyond a doubt.”<br/><br/>The mysterious figure spoke slowly, causing Fang Wang to raise an eyebrow.<br/><br/>Fang Wang immediately bowed with his fists clasped and said, “Please, senior, give me some guidance.”<br/><br/>The other clearly intended to guide him, and even though it wasn’t a living person, he should still pay this respect.<br/><br/>Facing Fang Wang, the mysterious figure said, “First, you must reach the<br/><br/>Condensation Spirit Realm. Second, you must master the Nine Dragons Divine Transformation Art. Both are indispensable.”<br/><br/>Upon hearing this, Fang Wang secretly breathed a sigh of relief.<br/><br/>This wasn’t too difficult!<br/><br/>Given his talents and his status within the Great Abyss Gate, reaching the<br/><br/>Condensation Spirit Realm was just a matter of time, and as for the Nine Dragons Divine Transformation Art, he had already attained the Great Perfection Realm.<br/><br/>“Could the senior possibly pass the Nine Dragons Divine Transformation Art to my young master?” asked Green Snake suddenly.<br/><br/>Fang Wang glanced at it and suddenly found it somewhat agreeable.<br/><br/>Although he had already mastered the Nine Dragons Divine Transformation Art, Green Snake did not know that, and by making this request, even if not sincere, it at least seemed to be trying to ingratiate itself with him.<br/><br/>“My duty is merely to remind you of these two points. Cultivators, after all, pursue endeavors as challenging as ascending to heaven.”<br/><br/>With that said, the mysterious figure dissipated like smoke in the wind, and Fang Wang did not even have time to ask about its identity.<br/><br/>The map, consumed by the Solaris True Fire, turned to ashes and scattered in the wind.<br/><br/>Fang Wang and Green Snake stared at each other, silent for a long time.<br/><br/>After a while, Green Snake finally sighed, “If an ordinary person found the map and directly sought the Heavenly Gang Sheng Ti Zhen Gong, they would likely face a life-or-death ordeal. You are extraordinary, young master, for it was by destroying the map that you actually gained the predecessor’s approval.”<br/><br/>Fang Wang felt that this was a fluke—nevertheless, he would not speak his true thoughts.<br/><br/>He then began to inspect the five stones Green Snake had brought; covering his palm with Spiritual Power, he took the stones to the river to clean them.<br/><br/>Green Snake drew closer, maintaining a safe distance from Fang Wang.<br/><br/>After Fang Wang had cleaned the stones and placed them in the storage pouch,<br/><br/>Green Snake then spoke up, “Young master, I know of a place with many Heavenly Materials and Earthly Treasures, but there is a Great Demon guarding them.”<br/><br/>“How powerful is that Great Demon?”<br/><br/>Fang wang asked casually. He nau set a goal ror mmselt: to DreaK tnrougn within the Great Saint’s Grotto-Heaven and forge his second Lifespirit Treasure.<br/><br/>“It is equivalent to a Human Cultivator at the Ninth Level of the Spirit Elixir Realm,” Green Snake answered.<br/><br/>Fang Wang looked at it and smiled, “It seems you are quite extraordinary, not just an ordinary demon snake.”<br/><br/>Green Snake replied, “You jest, young master. Having lived here for three hundred years, I have inherited some knowledge, and over the years occasionally cultivators have strayed into this area, so I have a rough understanding of Human Cultivators.”<br/><br/>Fang Wang thought this demon snake was no simple creature, since it managed to cry for so long in the hands of the woman in white—it must have some tricks up its sleeve.<br/><br/>Having rested for half a month, it was time to set out!<br/><br/>“Lead the way!”<br/><br/>“Certainly, young master!”<br/><br/>Green Snake immediately started leading the way, its body wriggling in an almost cheerful manner.<br/><br/>Watching its movement, Fang Wang suddenly felt the situation was somewhat absurd.<br/><br/>Was he really going on an adventure with a snake?<br/><br/>Two days later.<br/><br/>At the entrance of a valley, Fang Wang stood under a tree, and Green Snake slithered onto a nearby branch; one man and one demon stared in the same direction.<br/><br/>The dense foliage in this area made it hard for sunlight to penetrate; even at noon, the forest behind Fang Wang was pitch-dark.<br/><br/>“Is that it?”<br/><br/>Fang Wang asked, his right hand resting on the hilt of his sword.<br/><br/>After two days of communication, Fang Wang learned the Green Snake’s name; it called itself Xiao Zi. A Green Snake calling itself Xiao Zi, Fang Wang suspected it was color-blind.<br/><br/>Xiao Zi nodded and said, “Yes, that’s it, it even tried to eat me before. Be careful, Young Master, its mouth emits a very dangerous poison!”<br/><br/>Following its gaze, the valley ahead was filled with colorful flowers and plants as tall as two Zhang, and the bright fruits scattered among them were as numerous as stars, creating an illusion of a galaxy made of exotic fruits, utterly mesmerizing.<br/><br/>In the center of the valley was a depression filled with water reflecting various colors. A four-Zhang tall red toad squatted there, its body covered with moss and flowers. If one didn’t look closely, they might think it was a small hill.<br/><br/>Clang—<br/><br/>Fang Wang took a step forward and drew his sword smoothly.<br/><br/>Xiao Zi, still a bit worried, couldn’t help but say, “Young Master, its back is incredibly tough; the weak spot should be in the eyes…”<br/><br/>Fang Wang took five steps and immediately executed the Jinghong Divine Sword Art, conjuring thirty-six sword forms. Sword Qi overflowed, stirring up a wild wind that caused branches and leaves to shake violently. This startled the giant red toad, causing its eyes to snap open like those of a venomous snake, cold and sinister.<br/><br/>Xiao Zi, seeing the thirty-six sword forms appear around Fang Wang, immediately shut up and fixed its eyes intently on him.<br/><br/>Fang Wang’s footsteps did not halt; with his right hand holding the sword, he thrust forward, the thirty-six strokes of the Jinghong Sword shooting out fiercely, converging into a massive force of Sword Qi and cutting a swath through the flora in its path.<br/><br/>With a boom!<br/><br/>The giant red toad was hit by the Sword Qi, exploding into a bloody mess that scattered on the flowers, plants, and even stained the distant cliff walls with its poisonous flesh.<br/><br/>Xiao Zi, quick as lightning, dodged the flying flesh and swiftly scrambled to the branch above.<br/><br/>Fang Wang’s pace didn’t falter; his robe fluttered as he thrust the Qingjun Sword forward and flicked his wrist, causing the Treasured Sword to spin. He then reversed his grip with a fluid motion, sheathing the sword back into its scabbard.<br/><br/>Drawing the sword, stabbing, sheathing the sword—this whole process took less than a moment!<br/><br/>A quick kill on the giant red toad!<br/><br/>Fang Wang seemed nonchalant, but in truth, this move was his full power, the strongest Jinghong Divine Sword Art he could perform. Besides defeating the foe, it was also meant to intimidate Xiao Zi.<br/><br/>“Go and look around to see if there are any other demons nearby,” Fang Wang said, his back turned to Xiao Zi. Xiao Zi, regaining its senses, quickly agreed and leaped into the forest.<br/><br/>Fang Wang took out the Celestial Treasure Record and referenced it against the Heavenly Materials and Earthly Treasures he encountered along the way; each had its unique harvesting methods. Some would lose their Spiritual Energy once detached from the soil, others would wilt quickly if broken, and yet others were poisonous on the surface, entering the body upon contact, each peculiar in its own way. Fang Wang was amazed when he first read the Celestial Treasure Record.<br/><br/>While harvesting, Fang Wang did not let his guard down and kept his consciousness alert.<br/><br/>Half an hour later, Xiao Zi returned, and Fang Wang was still picking. The abundance of medicinal herbs and precious fruits here meant it was hard to leave; indeed, the Great Saint’s Grotto-Heaven was a tremendous opportunity, and after half a year, as long as one survived, anyone could become rich.<br/><br/>“Young Master, there are no demons nearby,” Xiao Zi softly said, its tone filled with reverence.<br/><br/>The reason it took so long to return was that it needed to calm its nerves.<br/><br/>Fang Wang was too frightening for it!<br/><br/>With that level of strength, even if Xiao Zi wanted to launch a sneak attack, it wouldn’t be possible, and it was also afraid that Fang Wang might turn on it later.<br/><br/>“Then go up there and keep watch,” Fang Wang casually responded, not needing Xiao Zi’s help since the creature had not yet transformed.<br/><br/>Upon hearing this, Xiao Zi immediately took off, scaling the cliff and shooting up to the mountain top.<br/><br/>It wasn’t until deep into the night that Fang Wang finally plundered the entire valley. This trip’s haul was tremendous, and he even obtained a demon core.<br/><br/>Late at night, they came upon a brook in the forest. Beside the campfire, Fang Wang began to draw a map.<br/><br/>He had a strong memory, but fearing it might fail before he could practice the Heavenly Gang Sheng Ti Zhen Gong and enter the Heavenly Palace, no matter how good his memory, it was impossible to remember a map he saw once hundreds of years ago.<br/><br/>Xiao Zi curled up quietly on the other side of the fire, not daring to disturb Fang Wang.<br/><br/>Ever since Fang Wang executed the Jinghong Divine Sword Art, Xiao Zi spoke much less.<br/><br/>Crack!<br/><br/>The sound of a twig being snapped carried over from nearby, and Fang Wang instantly glanced in that direction, with Xiao Zi jerking its head up sharply.<br/><br/>A silhouette emerged from the darkness, and as the moonlight aided Fang Wang’s vision, he identified her figure and said with a peculiar look, “It was the same when you were looking for Fang Hanyu before, did you cast some kind of spell on us?”<br/><br/>The one approaching was Zhou Xue.<br/><br/>Zhou Xue walked closer, laughing as she said, “There will come a day when you’ll be thankful for this method..”\t\t\t\t\t\t</div>", "images": {}, "success": true}