{"id": 54, "url": "https://www.novelhall.com/i-became-an-immortal-on-mortal-realm-32879/14239279.html", "title": "Chapter 54 - Chapter 54: Chapter 52: Breaking Through To The Spirit Elixir Realm, The Second Spiritual Refinement_L", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 54 - Chapter 54: Chapter 52: Breaking Through To The Spirit Elixir Realm, The Second Spiritual Refinement_L</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 54: Chapter 52: Breaking Through to the Spirit Elixir Realm, The Second Spiritual Refinement_l<br/><br/>Translator: 549690339<br/><br/>After spending nearly half an hour, Zhou Xue finally ceased her work. At this moment, the formation completely surrounded Fang Wang. Twelve wooden stakes were embedded in the soil, covered with talisman papers that were not randomly attached. Each stake had talisman papers arranged in accordance with some methodical rule, and the characters and drawings on each paper were different—Fang Wang couldn’t understand any of these.<br/><br/>Fang Wang took a deep breath and said, “Let’s begin!”<br/><br/>Zhou Xue eyed him and said, “Take off your clothes so as not to interfere with the absorption of Spiritual Energy.”<br/><br/>“This…”<br/><br/>Fang Wang frowned and hesitantly asked, “Can you turn around then?”<br/><br/>“Hurry up, don’t dawdle,” Zhou Xue said expressionlessly. Hearing this, Fang Wang had no choice but to steel himself and strip off his clothing. Perched on a rock, Xiao Zi watched Fang Wang, constantly flicking her snake tongue.<br/><br/>Being watched by a woman and a female demon, Fang Wang couldn’t feel more awkward, and he couldn’t refuse them either.<br/><br/>Forget it!<br/><br/>Fang Wang pushed aside all distractions, removed all his clothing, placed them into his storage bag, and then sat in meditation.<br/><br/>“You can start cultivating now. The Solaris Scripture has a breakthrough method,” Zhou Xue spoke again, and Fang Wang immediately began to cultivate.<br/><br/>Suddenly, Zhou Xue waved her sleeves, and a strong wind blew towards Fang Wang. In an instant, all the talisman papers on the twelve wooden stakes ignited, forming twelve differently colored flames. Strangely, the talisman papers did not turn to ash, as if the flames merely clung to their surfaces.<br/><br/>As the formation was activated, Fang Wang could clearly feel the Spiritual Energy from beneath the earth rushing towards him. The ground around him rose with wind gusts, shaking the Heavenly Materials and Earthly Treasures piled on the ground.<br/><br/>Winds of Spiritual Energy spiraled upwards, encircling Fang Wang’s body.<br/><br/>For some reason, Fang Wang felt a cool sensation beneath him, indescribably refreshing, giving him the urge to stand up.<br/><br/>Boom, boom, boom—<br/><br/>Above, clouds roiled violently, with bolts of lightning slithering out like snakes, their immense rumble making the atmosphere atop the cliff even more oppressive.<br/><br/>Frightened, Xiao Zi hid away at a distance.<br/><br/>Zhou Xue stood before the formation, her robe billowing fiercely, her gaze fixed on the clouds above, undeterred by the ghastly wind and lightning.<br/><br/>As the surrounding winds grew stronger, the Heavenly Materials and Earthly Treasures around Fang Wang began to release attribute-specific Spiritual Energy of various colors, which combined together to form a multicolored wind, dazzlingly beautiful.<br/><br/>Fang Wang immersed his mind in the breakthrough, setting aside all distractions.<br/><br/>Boom!<br/><br/>A bolt of lightning suddenly struck down, shattering the multicolored whirlwind and plunging into Fang Wang’s crown. His body trembled, followed by the surrounding Spiritual Energy winds rushing madly into his body.<br/><br/>After a brief moment of intense pain, it was replaced by endless comfort, making Fang Wang long for another strike.<br/><br/>Boom! Boom! Boom…<br/><br/>Lightning struck down repeatedly, each time drawing the nearby Spiritual Energy into his body, cleansing his sinews and bones, and ultimately gathering above his Dantian, concentrating at one point.<br/><br/>Gradually, Fang Wang forgot the pain, his attention turned inward to his Dantian.<br/><br/>The mental method of the Solaris Scripture circulated, compressing and condensing the Spiritual Energy within the Dantian. The process was complex, and any laxity could easily disperse the condensed energy, especially since the energy of differing attributes inherently tended to repel each other. Zhou Xue watched Fang Wang intently, and slowly, a smile spread across her face.<br/><br/>From time to time, Xiao Zi glanced at her, fearing she might do something rash because its life was in Fang Wang’s hands, and it feared that it would die alongside him.<br/><br/>Time hurried along.<br/><br/>After an hour.<br/><br/>One-third of the Heavenly Materials and Earthly Treasures around Fang Wang had wilted or turned to ash, scattering with the wind.<br/><br/>Zhou Xue no longer watched him; instead, she sat in meditation nearby, resting with her eyes closed.<br/><br/>Thunder occasionally fell but did not disturb Fang Wang, who remained sitting in meditation.<br/><br/>Under the gloomy Firmament, barren hills stretched far and wide. On a hillside, four Tai Yuan Sect Disciples stood shoulder to shoulder, including Gu Li and Xu Lang.<br/><br/>Their gazes were all fixed in the same direction. Several miles away, nestled between two mountains, lay a broken temple with its doors wide open. A body hung beneath the temple’s signboard, swaying slightly in the wind.<br/><br/>Atop the monastery walls stood several mysterious women in white, with disheveled hair, their faces obscured and beyond recognition. From a distance, they appeared eerily bone-chilling.<br/><br/>“Are we really going to attempt it?”<br/><br/>A male disciple with furrowed brows asked. His name was Yan Feiyue, carrying a broadsword on his back and a long whip on his waist. His stature was towering, and his bearing was less that of a cultivator and more that of a warrior.<br/><br/>Xu Lang spoke impassively, “An opportunity like the Great Saint’s Grotto-Heaven is a once-in-a-lifetime chance. If you do not take the risk, you will regret it. Maybe we are considered top talents in the Great Abyss Gate, but the goal of cultivation is to pursue immortality. Since ancient times, has anyone from the Great Abyss Gate ever achieved immortality?”<br/><br/>These words rendered Yan Feiyue silent.<br/><br/>Ye Xiang, a talent from the Earth Origin Spirit Treasure of the second branch, spoke up, “Let’s go up. The four of us together should not encounter any problems.”<br/><br/>Gu Li had no objections; her goal was always to surpass Fang Wang. She knew that following the conventional cultivation path would not allow her to outshine Fang Wang. Only by taking risks in search for great opportunities could she entertain a glimmer of hope.<br/><br/>The four immediately took to their swords and flew towards the distant monastery. Simultaneously, the white-garbed women on the walls looked up, revealing pallid faces with hollow, lifeless eyes.<br/><br/>The early morning sunlight pierced the sky, penetrating the thunderclouds and shining down, landing precisely on Fang Wang.<br/><br/>After a day and a night of striving for a breakthrough, he had finally reached the first level of the Spirit Elixir Realm!<br/><br/>The Heavenly Materials and Earthly Treasures around him had all withered away or turned into ashes, ceasing to exist.<br/><br/>At this moment, within his Dantian, the Spirit Pill had formed; it was the color of white jade, crystal clear. Spiritual Energy flowed into the Spirit Pill, which then transformed into a mighty Spiritual Power. The difference between the ninth level of the Soul Sculpting Realm and the first level of the Spirit Elixir Realm seemed just one level apart, but the disparity was enormous.<br/><br/>The process after the breakthrough was to stabilize his cultivation level!<br/><br/>Fang Wang was observing his Treasured Spirit Space internally and noticed that around the Heavenly Palace Halberd, eight dark purple groove-like areas had emerged. This made him extremely alert.<br/><br/>Could he also condense nine Lifespirit Treasures?<br/><br/>Lifespirit Treasures not only determined one’s aptitude but also functioned as indestructible Magic Artifacts. For cultivators, the more Magic Artifacts, the better, as they could face different dangerous situations. In Zhou Xue’s words, the existence of Lifespirit Treasures was a grace bestowed by the Heavenly Dao upon the human race!<br/><br/>Zhou Xue, who was meditating, opened her eyes and murmured to herself, “It’s about time.”<br/><br/>She raised her right hand and with a swift motion, the Formation abruptly changed. The wind of nature’s spiritual energy swirling around Fang Wang suddenly sank, spreading across the ground and forming a mist visible to the naked eye that kept expanding, covering Fang Wang’s figure.<br/><br/>Fang Wang clearly felt the Formation’s change, which brought back the feeling he had during his original Spiritual Refinement.<br/><br/>Initially, he wanted to form Lifespirit Treasures such as tripods and towers, but now realizing that he could condense eight more, he changed his mind.<br/><br/>First to condense a sword, to masquerade as a Sword Cultivator!<br/><br/>During his first Spiritual Refinement, he had the idea to form a sword-like Lifespirit Treasure — what’s a cultivator without a handsome sword?<br/><br/>Fang Wang’s heart began to throb with unease, uncertain whether the Heavenly Palace would obstruct him this time.<br/><br/>He started to imagine his sword.<br/><br/>This sword was different from the first one he envisaged. Before encountering Xu Lang, his understanding of swords was restricted by conventional wisdom. Seeing Xu Lang’s formless sword made him realize that Spiritual Refinement could be innovative.<br/><br/>Spiritual Refinement entailed not only shaping the form of a Lifespirit<br/><br/>Treasure but also infusing it with envisioned abilities, like Li Hongshuang’s Lifespirit Treasure that could release poison, or Zhou Xue’s that could capture souls.<br/><br/>The ultimate power of a Lifespirit Treasure depended on its grade.<br/><br/>Under Zhou Xue’s watchful gaze, Fang Wang exuded Solaris True Fire around him, which was different from the first time he performed Spiritual Refinement. This time the Solaris True Fire was accompanied by white flames. The Solaris True Fire and white flames rose to the top of his head, merging together.<br/><br/>Xiao Zi climbed onto a large boulder and watched Fang Wang, flicking her snake tongue.<br/><br/>With the experience from his first Spiritual Refinement, Fang Wang found the current process far more natural.<br/><br/>He was observing the Treasured Spirit Space internally, imagining the form and abilities of his second Lifespirit Treasure.<br/><br/>As time went by, a sword hilt began to take shape above Fang Wang’s head, the guard pointing upwards.<br/><br/>“Is the young master performing Spiritual Refinement?” Xiao Zi couldn’t help but ask. She remembered that Fang Wang’s Lifespirit Treasure was a long halberd.<br/><br/>Zhou Xue did not answer; her gaze remained fixed on the emerging hilt above Fang Wang’s head.<br/><br/>The hilt became increasingly solid, and Zhou Xue thought of Xu Lang’s formless sword, which had only a hilt with an invisible blade.<br/><br/>But she had a hunch that Fang Wang would not simply mimic someone else.<br/><br/>That Heavenly Palace Halberd was not merely a replica; such a Lifespirit Treasure did not exist in the mortal realm!<br/><br/>The Heavenly Palace Halberd was far from just a simple long halberd!\t\t\t\t\t\t</div>", "images": {}, "success": true}