{"id": 64, "url": "https://www.novelhall.com/i-became-an-immortal-on-mortal-realm-32879/14255963.html", "title": "Chapter 64 - Chapter 64: Chapter 62 Legendary Tier 1", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 64 - Chapter 64: Chapter 62 Legendary Tier 1</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 64: Chapter 62 Legendary Tier 1<br/><br/>Translator: 549690339<br/><br/>“Who made the move? Is there any news?”<br/><br/>Fang Wang frowned as he asked. Hearing about Zhao Zhen’s troubles, he felt no pleasure, an instinctual feeling that something was amiss.<br/><br/>Fang Hanyu shook his head and said, “Since there are absolutely no clues, it could only be the work of the Cultivation Sects. But now, with the Nine Great Sects plotting to transform Da Qi into a Cultivation Dynasty, they need the kingdom to be stable. Why would they do this? It could only be the doing of Cultivation Sects from other kingdoms.”<br/><br/>“If it really were to be someone from inside Da Qi, it could only be the Jin Xiao Sect. The Jin Xiao Sect is mysterious and elusive, and it is hard to distinguish between their good and evil.”<br/><br/>The Jin Xiao Sect?<br/><br/>Fang Wang suddenly felt it was possible. Could it be that Zhou Xue made the move?<br/><br/>That’s right, Zhou Xue had said before that she would deal with Zhao Zhen after she returned.<br/><br/>Fang Wang continued to ask, “What about Zhao Zhen?”<br/><br/>“He’s unharmed. He’s been staying inside the Great Abyss Gate, avoiding disaster. I reckon he’s not having an easy time now. Ah, who would have thought that the Duke’s Mansion and the royal family would face such calamity?” sighed Fang Hanyu. He genuinely sympathized with Zhao Zhen; had it not been for Fang Wang concealing his strength and turning the tide that night, the Fang State Duke’s Mansion would no longer exist, and he would have been dead.<br/><br/>Upon hearing this, Fang Wang felt even more that something was not right.<br/><br/>If they truly wanted to overthrow a dynasty, why not kill the emperor, why not siege cities and capture territory?<br/><br/>What is the point of killing royal relatives and dukes?<br/><br/>Fang Hanyu sat down and said, “Regardless, the Great Abyss Gate will surely intervene, so you need not worry too much. I’ve asked Zhou Xue, and more and more disciples from the Fang Residence have gone to cultivate in the Fang Realm. She has also hired two cultivators of the Soul Sculpting Realm to guard the Fang Residence.”<br/><br/>Fang Wang gave him a look and said, “I’m not worried. It’s you who came rushing to find me.”<br/><br/>Unembarrassed, Fang Hanyu began to inquire about his previous experiences in the Great Saint’s Grotto-Heaven.<br/><br/>Fang Wang briefly recounted his experiences, mainly focusing on the enemies and perilous situations he had encountered, which left Fang Hanyu yearning for adventure.<br/><br/>He himself was an adventurous sort. Otherwise, he wouldn’t have lost his eye and nearly died. However, after surviving that ordeal, he realized the importance of cultivation level, so he had been diligently practicing and had not rashly sought adventure.<br/><br/>“Regarding the Great Saint’s Grotto -Heaven, there has been a lot of buzz in the sect. Now every branch is filled with expectation for you. Ye Xiang, Yan Feiyue, and Xu Lang have all been praising your strength, saying that your Lifespirit Treasure is definitely not of Mysterious Origin, and must be even higher than theirs,” Fang Hanyu remarked with emotion.<br/><br/>Fang Wang didn’t expect these three to be so supportive. His rescuing them wasn’t in vain.<br/><br/>As his cultivation level continuously improved, he ought to upgrade the rank of his Lifespirit Treasure as well, at the very least to make it tough for the nine branches of the sect to overlook him, and even to subtly surpass Lu Yuanjun in terms of talent.<br/><br/>Fang Wang advised, “Your Absolute Heart Evil Eye, along with the secret techniques on your back, are extraordinary. As long as you cultivate wholeheartedly, you’ll eventually become renowned all over the world. From what I understand, the talents of the sect are just so-so, at least in my eyes, you surpass them, including Lu Yuanjun.”<br/><br/>“How could that be? My talents aren’t that exaggerated.” “You don’t believe me? Do you not trust your own eyes?” Fang Hanyu fell silent, his heartbeat quickening.<br/><br/>Could I truly have underestimated myself?<br/><br/>He couldn’t help but touch his own eyes.<br/><br/>Fang Wang changed the subject and asked, “Have you encountered any difficulties with the secret techniques on your back recently?”<br/><br/>His own Nine Dragons Divine Transformation Art had reached Great<br/><br/>Perfection. Giving guidance to Fang Hanyu would be well within his means.<br/><br/>Without hesitation, Fang Hanyu confessed that this matter was indeed the main reason for his visit, and the two brothers began to exchange insights about the Nine Dragons Divine Transformation Art.<br/><br/>Xiao Zi was quietly listening on the side, occasionally sticking out her tongue.<br/><br/>The secluded cave dwelling was strewn with green vines along the walls, with a small waterfall beside it. The waterfall’s waters fell into a pond, stirring up ripples yet making no sound at all, which was quite eerie.<br/><br/>Next to the small pond, Lu Yuanjun sat at a stone table, his right arm pressing on the tabletop. His complexion was incredibly somber, while Emperor Zhao Zhen of Da Qi sat opposite him, his expression calm.<br/><br/>Lu Yuanjun spoke in a deep voice, “Must you go to such lengths? Those were your kin by blood, including your two sons!”<br/><br/>Zhao Zhen, unperturbed, countered, “If I don’t do this, should I just wait to die? When Fang Wang learns the truth and wants to kill me, will you stand against him for my sake?”<br/><br/>“It hasn’t come to that. He’s still alive, isn’t he? The majority of the Fang Residence were mere servants. Our hatred hasn’t reached the point of life and death. Moreover, I didn’t target him. I’ll make it up to him, repair our relationship, and dissipate the hatred. Why the rush?” Lu Yuanjun asked coldly, his eyes no longer carrying their usual warmth but filled with murderous intent.<br/><br/>Zhao Zhen said with self-mockery, “His survival was his own doing. If you were him, could you bear it? Besides, you can’t understand his sense of family loyalty since you’ve been an orphan from a young age.”<br/><br/>“Are you provoking me?” Lu Yuanjun narrowed his eyes.<br/><br/>Zhao Zhen took a deep breath and said, “Lu Yuanjun, let me repeat, I did not mean to frame you. You had someone soul-snatch before; there were traces. Although it couldn’t be traced back to you, I had my own clan members soul-snatched as well. That made things easy. I have the same plight as the Fang Residence, a common enemy; Fang Wang couldn’t possibly suspect me. Besides, I haven’t troubled you and dealt with the matter myself. Aren’t you the one who benefits the most?”<br/><br/>“Nonsense. The incident has caused such a stir that not only the Great Abyss Gate will investigate, but the other eight great sects will as well. Do you truly believe the truth won’t surface?” Lu Yuanjun said indignantly, even slamming his hand on the stone table, which caused cracks to form on the surface.<br/><br/>Zhao Zhen’s eyes held a distant look as he spoke, “Cultivation should sever worldly ties. This can resolve potential calamities and purify the six senses. What’s wrong with that? From now on, the karma of the mortal realm has nothing to do with me. Moreover, to prevent the Da Qi Kingdom from being destabilized and affecting the Nine Great Sects’ opening of the earthly destiny, the Great Abyss Gate will value my safety even more. They fear something might happen to me. Even if Fang Wang discovers the truth, he wouldn’t dare to move against me.”<br/><br/>Lu Yuanjun stared at him coldly, unable to suppress his murderous intent.<br/><br/>No matter how eloquently Zhao Zhen spoke, Lu Yuanjun knew that the other party was deliberately slinging mud at him. The demonic cultivator who slaughtered the cities belonged to him, and now the one suspected of slaughtering the royal family was assumed to be his as well. Wouldn’t his guilt be even greater if he were exposed someday?<br/><br/>Clearly, Zhao Zhen was dissatisfied with his attempts to ingratiate himself with Fang Wang.<br/><br/>At this moment, Lu Yuanjun truly felt the urge to kill Zhao Zhen. In his view, the enmity and karma between him and Fang Wang hadn’t reached the point of life-and-death. In the Cultivation World, the pursuit of longevity was paramount, and as long as he could help Fang Wang with his cultivation, even if Fang Wang knew the truth, he would give up on vengeance.<br/><br/>What could be more important than pursuing immortality through cultivation?<br/><br/>That was his belief, and Zhao Zhen thought the same way. That’s why Zhao Zhen, for the sake of immortality, sacrificed his closest kin, although their circumstances differed.<br/><br/>Lu Yuanjun watched Zhao Zhen calmly pouring himself a cup of tea and suddenly felt that if he grew stronger, he would definitely stir up trouble in the world.<br/><br/>“Alright, you needn’t worry about my affairs. Just ensure those disciples who did your bidding disappear. Let’s talk about Fang Wang. You’ve invited him several times; has he ever visited your sect?”<br/><br/>Zhao Zhen looked up at Lu Yuanjun and asked, his tone completely flat when mentioning Fang Wang.<br/><br/>Lu Yuanjun frowned.<br/><br/>Zhao Zhen said with a smirk, “Perhaps he already knows the truth. How could his growth rate be merely due to the Mysterious Origin Treasure Spirit? I heard that when Fang Wang was accepted into the Great Abyss Gate, all the Lifespirit Treasures of the disciples there exhibited abnormalities on the same day. Later, the Peak Masters and elders approached the Sect Leader, who dismissed the matter, attributing it to artifact refinement. What kind of artifact could cause such disturbances, do you think?”<br/><br/>At his words, Lu Yuanjun’s brow furrowed even more, and he asked coldly,<br/><br/>“What are you implying?”<br/><br/>“Is there a possibility that Fang Wang’s Treasure Spirit has surpassed the Earth<br/><br/>Origin and reached the legendary Heaven Yuan level? Each level of Treasure Spirit behaves differently during sculpting, but no one knows what sort of phenomena a Heaven Yuan Treasure Spirit would cause. Now think about it, the Heaven Yuan is high above, overlooking all beings, causing their Treasure Spirits to tremble – that makes sense, doesn’t it?” Zhao Zhen spoke in an eerily calm tone, but his hand holding the teacup trembled slightly.<br/><br/>“Don’t be too quick to deny it. Think about it, could an Earth Origin Treasure Spirit achieve defeating a Ninth Level Spirit Elixir Realm within three years of cultivation? Perhaps the Sect Leader feared leaking the news, leading to an onslaught by the eight great sects and deliberately concealed his true level.”<br/><br/>Lu Yuanjun’s expression grew increasingly somber, his right hand balled into a fist on the table.<br/><br/>Zhao Zhen continued, “With his talent, in twenty years, no, perhaps just ten years, he could surpass you. If you wait another ten years and he becomes the strongest in the Great Abyss Gate, and he comes to know the truth by then, do you think he would definitely forgive you? If he wants you dead, who could stop him?”<br/><br/>Lu Yuanjun’s eyes flickered as he recalled his interactions with Fang Wang.<br/><br/>Although Fang Wang greeted him with a smile, there was an undeniable distance.<br/><br/>For example, six months ago, he tried to win him over with the Yin Yang Xuan Ming Zhen Gong and told the other disciples that Fang Wang was the one he favored, but Fang Wang declined in another way. Previously, he thought it was because Fang Wang feared gossip from other disciples, but now it seemed Fang Wang wanted to embarrass him.<br/><br/>In fact, as soon as he learned that his own men had slaughtered the Fang Residence, Lu Yuanjun harbored thoughts of killing Fang Wang. However, since Fang Wang had become a disciple of Yang Yuanzi, he dared not act and could only hope for the best, trying to win him over and make reparations as much as possible.<br/><br/>The thought that Fang Wang might surpass him one day made it impossible for Lu Yuanjun to calm his heart..\t\t\t\t\t\t</div>", "images": {}, "success": true}