{"id": 67, "url": "https://www.novelhall.com/i-became-an-immortal-on-mortal-realm-32879/14260077.html", "title": "Chapter 67 - Chapter 67: Listing Remarks_L", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 67 - Chapter 67: Listing Remarks_L</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 67: Listing Remarks_l<br/><br/>Translator: 549690339<br/><br/>The novel will be precisely updated at noon tomorrow!<br/><br/>Thanks to the chief editor Northern River and the responsible editor Jia Nan; thanks to my loyal readers who have accompanied me from my previous book, and also to the new readers who started following my work with this book— myriad words converge into a surge of updates tomorrow–<br/><br/>Since the book was released on October 10th, and it will go live tomorrow, November 10th, it has been exactly one month. I have seen all your criticisms and support. Without deviating from the main storyline I envision, I will correct what I can to try to satisfy everyone. However, it’s hard to please everyone, and there will always be some who dislike it; I hope you all understand.<br/><br/>I saw a comment before saying why do I always write these cliche plots filled with fighting and killing, and why can’t I write about low-key cultivation and the years spent in cultivation. I almost couldn’t hold it together.<br/><br/>The person probably doesn’t know that I’ve already written two books like that. When I was writing them, everyone felt it was too monotonous and hoped I could try a different approach. After changing my style, some asked why I didn’t stick to my previous approach, which left me both amused and frustrated.<br/><br/>This book will still maintain my original core, meaning the protagonist will not act rashly without absolute certainty, nor will they actively provoke unrelated enemies or force open subplots. However, compared to my previous books, I want to write with more human touch, and the necessary boldness will also be present.<br/><br/>Beyond the protagonist’s growth, this book will also focus on the growth of the family. Fang Family Disciples will have different development arcs. Right now, it’s still too early for much description because I feel that ten years isn’t significant enough to drive the ambition of a family seeking cultivation. The family can’t have the same growth rate as the protagonist; even if the supporting characters get their chapters, they can’t artificially keep up with the protagonist’s pace. That would be unreasonable.<br/><br/>Furthermore, as the title indicates, becoming immortal is something achieved after ascending, but the protagonist will become immortal in the mortal world. The mortal realm will be significant and won’t involve rapidly changing realms. Consider this a reassurance pill for everyone!<br/><br/>Let’s talk about the additional update rules for after the novel goes live.<br/><br/>For every 500 additional monthly tickets, I will release an extra chapter. There’s no cap–<br/><br/>For each appearance of a leader among supporters, I will add an extra chapter<br/><br/>It’s not that the threshold for additional chapters is too high; it’s that I’ve reduced it. I can’t add that much, nor would it be meaningful-<br/><br/>The additional chapters start the day after the novel goes live, and do not count the surge of updates tomorrow!<br/><br/>Let’s play a game for fun!<br/><br/>Choose one of the numbers below and guess how many extra chapters I will release tomorrow.<br/><br/>1, If there are 3 or fewer chapters, it would be feeble and unsatisfying—just like you.<br/><br/>2, If there are 3 to 5 chapters, it’s a modest effort that’ll raise some eyebrows among my brothers and sisters.<br/><br/>3, If there are 5 to 7 chapters, it’s enough to draw attention, showing that there’s something different about this guy.<br/><br/>4, If there are 7 to 10 chapters, it’s incredibly impressive—he’s awakened.<br/><br/>5, Everyone, feel free to imagine..\t\t\t\t\t\t</div>", "images": {}, "success": true}