{"id": 63, "url": "https://www.novelhall.com/i-became-an-immortal-on-mortal-realm-32879/14255962.html", "title": "Chapter 63 - Chapter 63: Chapter 61 Major Incident_L", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 63 - Chapter 63: Chapter 61 Major Incident_L</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 63: Chapter 61 Major Incident_l<br/><br/>Translator: 549690339<br/><br/>After hearing Lu Yuanjun’s words and sensing the gazes of the other disciples, Fang Wang remained composed as he softly replied, “Brother Lu, everyone here represents the future of the Great Abyss Gate. Since you intend to teach me, why not speak plainly and let everyone learn together?”<br/><br/>Trying to corner me?<br/><br/>Then don’t blame me for making you lose face!<br/><br/>If Lu Yuanjun truly wanted to teach him, he could have used the Sound Transmission Technique to inquire, but Lu Yuanjun spoke directly, which meant that once Fang Wang accepted, it would confirm his allegiance to Lu Yuanjun, serving him and also signifying that he had given up the competition for the Sect Leader position.<br/><br/>Fang Wang felt that Lu Yuanjun was a bit too hasty; previously, he had been meticulous in his actions, but now his intentions were too transparent.<br/><br/>Upon hearing this, Lu Yuanjun’s expression became slightly unnatural, but it was only for an instant. He pondered and said, “Little brother has a point. In that case, when I return, I will write down the Yin Yang Xuan Ming Zhen Gong and then submit it to the sect.”<br/><br/>“That is unacceptable; the Yin Yang Xuan Ming Zhen Gong is one of the Ji Hao Sect’s Three Great True Cultivations. If it spreads, it will surely bring about immense trouble. This technique cannot be placed within the Daofa Pavilion!”<br/><br/>A voice sounded, and Fang Wang turned his head to see Chen Anshi standing at the second-floor doorway of the pavilion, looking down at them.<br/><br/>Chen Anshi’s face was expressionless as he said, “Lu Yuanjun, since you are willing to teach the fellow disciples, why not teach it here on the ship? Other disciples, remember that it is difficult to repay Brother Lu’s kindness, and you must keep it a secret. Obtaining the true skills of the Ji Hao Sect is undoubtedly a tremendous fortune.”<br/><br/>Hearing this, Xu Lang, Ye Xiang, and others quickly stood up and bowed to Lu Yuanjun to thank him for his teaching.<br/><br/>Fang Wang also clasped his fists in gratitude, though in his heart, he exclaimed in admiration.<br/><br/>Chen Anshi, this undercover from the Demonic Sect, turned out to be one of Lu Yuanjun’s backers!<br/><br/>With these words, the disciples owed a favor to Lu Yuanjun and had no choice but to learn from him.<br/><br/>Lu Yuanjun nodded and said, “In that case, I will proceed to impart the technique to all my fellow disciples right now.”<br/><br/>After speaking, he gave Fang Wang a look, signaling him to come over.<br/><br/>All the disciples gathered together, sitting in meditation around Lu Yuanjun. Fang Wang sat next to Zhou Xue, who from beginning to end, had not communicated with him via sound transmission.<br/><br/>Fang Wang was secretly curious, and he wasn’t sure if Lu Yuanjun would truly be willing to impart the Yin Yang Xuan Ming Zhen Gong. His Heavenly Palace could verify whether the cultivation technique was genuine. Only if it were real would his consciousness enter the Heavenly Palace directly.<br/><br/>Wait a minute!<br/><br/>If it was real, would he not be locked in the Heavenly Palace for at least two centuries?<br/><br/>It took four hundred and twenty-six years to reach Great Perfection with the<br/><br/>True Combat Technique, and the time required for the equally rated Yin Yang Xuan Ming Zhen Gong was estimated to be about the same — another four hundred years.<br/><br/>Fang Wang’s heart sank, suddenly feeling like he had shot himself in the foot.<br/><br/>The more he thought about it, the more he believed that Lu Yuanjun might really impart the true technique. If it were fake, it would be a trap set for him. So, how should he face the other disciples now?<br/><br/>Even if it were true, Lu Yuanjun likely wasn’t afraid of it being leaked, as such supreme skills don’t instantly make one strong just by obtaining them.<br/><br/>Lu Yuanjun began to recite the Yin Yang Xuan Ming Zhen Gong, and all the disciples listened intently, while the elders, although vigilant in every direction, were also focused on Lu Yuanjun.<br/><br/>“The Yin and Yang of heaven and earth, with spirit entering the body, transforming into the two extremes, Yin being solid, Yang being void, revolving like the shifting stars, from good to evil, from strong to weak…”<br/><br/>Lu Yuanjun recited the mental method and incantation of the Yin Yang Xuan Ming Zhen Gong. At first listen, Fang Wang felt it sounded credible and could very well be genuine.<br/><br/>When he previously comprehended the True Combat Technique and Nine Dragons Divine Transformation Art, the incantations were also profound and enigmatic. Even after memorizing the entire content, he still couldn’t understand it all at once.<br/><br/>Time slowly passed.<br/><br/>Lu Yuanjun spoke for the duration of an incense stick burning. Once he finished, everyone had furrowed brows, deep in thought.<br/><br/>Fang Wang also furrowed his brow, but he was feigning it.<br/><br/>He hadn’t entered the Heavenly Palace, which meant that the Yin Yang Xuan Ming Zhen Gong imparted by Lu Yuanjun was fake, or perhaps incomplete, since Lu Yuanjun didn’t have the Heavenly Palace and couldn’t discern its authenticity.<br/><br/>After scanning the crowd, Lu Yuanjun spoke, “This technique is extremely profound. I have studied it hard for a month and have only a little understanding. I have not truly practiced it. Later on, we can contemplate together, discuss the Dao with each other, and help each other to improve.” He spoke gracefully, his words magnanimous and open-hearted.<br/><br/>Yan Feiyue immediately responded with a laugh, “Thank you, Brother Lu. Supreme skills naturally aren’t easy to master. Just having the opportunity to practice them is already a great kindness.”<br/><br/>Ye Xiang, Gu Li, and Xu Lang nodded in agreement.<br/><br/>“Ultimately, we will still rely on Brother Lu to guide us. We hope you won’t hesitate to impart your knowledge to us in the future,” Zhou Xue said with a beaming smile.<br/><br/>“No worries at all. Your talents and comprehension may very well match mine, and the future is yet uncertain,” Lu Yuanjun replied humbly, laughing, the atmosphere quite harmonious. Not far away, Zhao Chuanqian nodded slightly, his lips curling upwards unconsciously.<br/><br/>With the disciples so united, how could the Great Abyss Gate not flourish?<br/><br/>Following this incident, the relationship between the disciples grew closer—at least on the surface—as they began to share their respective experiences.<br/><br/>When Xu Lang spoke of his rescue by Fang Wang, Lu Yuanjun lavished praise upon Fang Wang once more, thankfully Xu Lang and the others did not mention the specific details of that underground space.<br/><br/>The atmosphere was quite delicate, with Xu Lang, Ye Xiang, and Yan Feiyue feeling grateful to Fang Wang for saving them, Zhou Xue being from Fang Wang’s clan, and Gu Li being Fang Wang’s close friend, so they all speculated about the relationship between Fang Wang and Lu Yuanjun.<br/><br/>To outsiders, it seemed they understood nothing; but in reality, they were well aware that Lu Yuanjun was courting Fang Wang’s allegiance, and Fang Wang clearly did not wish to submit to Lu Yuanjun—at least he did not want to become a subordinate; otherwise, Fang Wang would not have previously proposed that Lu Yuanjun teach them the Yin Yang Xuan Ming Zhen Gong.<br/><br/>Chen Anshi may have spoken well, but in truth, Lu Yuanjun had no desire to teach them—this was as clear as day to Ye Xiang and the others.<br/><br/>Of course, even if their motivations differed, they indeed owed Lu Yuanjun a favor, so they all needed to perform adequately on the surface.<br/><br/>After leaving the Great Saint’s Grotto-Heaven, the Law Ship carrying Fang Wang and the others flew extremely fast. In less than half a day’s time, they had already arrived in the central region of the Qi Dynasty, effectively returning to the territory of the righteous path, and only then did the speed of the Law Ship decrease.<br/><br/>During their journey, they did not encounter attacks from other sects.<br/><br/>Fang Wang speculated that this had to do with Chen Anshi, seeing that the latter came from the Chi Devil Sect of the Demonic Path and was now openly and covertly supporting Lu Yuanjun; it was natural that he wouldn’t allow attacks from the Demonic Sects.<br/><br/>Thus, the group from the Great Abyss Gate arrived safely back at their sect as the sky was just beginning to lighten.<br/><br/>After dispersing, Zhao Chuanqian reminded Fang Wang that he needed to register his Demon Pet at the affairs hall; Xiao Zi had been hiding in his embrace the whole time, but others had noticed its presence, they just didn’t speak up about it.<br/><br/>Consequently, Fang Wang flew to the Sect’s Main City.<br/><br/>After about half an hour of trouble, he finally returned to his own cave dwelling.<br/><br/>As soon as he closed the stone door of his cave dwelling, Xiao Zi, with a whoosh, darted out from his embrace and began to wander around inside.<br/><br/>Fang Wang let out a sigh of relief, a smile appearing on his face. To others, it might have only been half a year since they’d been back, but for him, it had been six hundred years!<br/><br/>Looking at every plant and flower in his cave dwelling, he felt as if he was in a dream.<br/><br/>He stepped forward, placing two storage bags on the table, and then sat down in meditation on the white jade bed.<br/><br/>He pondered over the attitudes of Chen Anshi and the other elders towards Lu Yuanjun; no wonder Zhou Xue had advised him not to rush. Lu Yuanjun’s backing was more complicated than he had imagined.<br/><br/>He had to do something, at least to increase his own standing within the Great Abyss Gate.<br/><br/>Guang Qiuxian, thinking it was for his own good, had concealed the true rank of his Lifespirit Treasure, resulting in the fact that even if his performance in the Nine Veins Combat Method was outstanding, he could not shake Lu Yuanjun’s status.<br/><br/>The ranking of the Lifespirit Treasure was one of the most fundamental recognitions in this world.<br/><br/>The higher the rank of the Lifespirit Treasure, the greater the potential for cultivation!<br/><br/>He would concentrate on cultivating for the next six months first!<br/><br/>Fang Wang closed his eyes and began his cultivation practice.<br/><br/>Half a year later, Fang Wang had made a breakthrough to the third layer of the<br/><br/>Spirit Elixir Realm. On this day, he was organizing the Heavenly Materials and Earthly Treasures in his cave dwelling, preparing to donate a batch to the sect in order to increase his contribution points.<br/><br/>“Is Fang Wang there?”<br/><br/>A voice came from outside the cave dwelling, and with his spiritual sense, Fang Wang peered through the mountain gate only to find that Fang Hanyu had arrived.<br/><br/>He immediately instructed Xiao Zi to open the door.<br/><br/>The mountain gate opened and the blindfolded Fang Hanyu stepped inside, only to be startled by the sight of a greenish-purple snake floating before him, which caused him to grab the hilt of his sword at once.<br/><br/>“It’s my Demon Pet.”<br/><br/>The voice of Fang Wang floated over, and upon hearing it, Fang Hanyu relaxed his grip.<br/><br/>Afterward, Fang Hanyu walked past Xiao Zi towards Fang Wang, while Xiao Zi closed the mountain gate behind him.<br/><br/>“Something big has happened,” Fang Hanyu approached Fang Wang and said in a solemn voice.<br/><br/>He glanced at the Heavenly Materials and Earthly Treasures on the table without interest.<br/><br/>Without raising his head, Fang Wang asked, “How big?”<br/><br/>Fang Hanyu took a deep breath and said, “The Qi Dynasty royal family has been massacred; all the imperial relatives have been exterminated, with even the two sons of Emperor Zhao Zhen killed. Now the Qi Dynasty is in turmoil. The Sect Leader has already summoned the elders from each branch to discuss this matter. Before this, including our Fang State Duke’s Mansion, many cities with Duke’s Mansions suffered mass killings.. Now that even the royal family has met this fate, do you think it could be the work of the Cultivation World from other dynasties looking to invade our Qi Dynasty?”\t\t\t\t\t\t</div>", "images": {}, "success": true}