{"id": 62, "url": "https://www.novelhall.com/i-became-an-immortal-on-mortal-realm-32879/14245895.html", "title": "Chapter 62 - Chapter 62: Chapter 60: Demon Monarch, Yin Yang Xuan Ming Zhen Gong_L", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 62 - Chapter 62: Chapter 60: Demon Monarch, Yin Yang Xuan Ming Zhen Gong_L</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 62: Chapter 60: Demon Monarch, Yin Yang Xuan Ming Zhen Gong_l<br/><br/>Translator: 549690339<br/><br/>“The Sect Hierarch, the Divine Dragon, is as elusive as they come. Where she is, I have no idea, and I’m waiting for her too,” answered Zhou Xue, her tone calm, her gaze still fixed on the distance.<br/><br/>Below the cliff lay a wasteland, vast and endless. At the edge of heaven and earth, bursts of bright light would occasionally flicker, revealing upon closer examination two cultivators in battle, the radiance emanating from their magic artifacts.<br/><br/>Cao Ran followed her gaze and couldn’t help but marvel, “Having witnessed Fang Wang’s strength, these so-called geniuses seem rather lackluster in comparison. Are you really not deceiving me? Has he only been with Great Abyss Gate for three years?”<br/><br/>Zhou Xue chuckled softly and said, “If you doubt it, then believe what you will.”<br/><br/>Cao Ran snorted coldly and said, “Always playing the inscrutable sage, how boring. I’m leaving.”<br/><br/>With those words, he turned and walked away.<br/><br/>Zhou Xue turned to look at him and said, “Before you leave, don’t forget our main business.”<br/><br/>Cao Ran waved his hand dismissively, then transformed into a swirl of dark mist and rapidly flew towards the horizon.<br/><br/>Zhou Xue turned back and continued to watch the battle.<br/><br/>The half-year in the Great Saint’s Grotto-Heaven was agonizing for most cultivators, with days feeling like years, but for those with formidable strength, the time was too short; they had not yet explored the entirety of the Great Saint’s Grotto-Heaven.<br/><br/>Since Cao Ran’s departure, no other cultivators had come to bother Fang Wang. From time to time, magical beasts passed by, and none required him to act; Xiao Zi could handle them on its own.<br/><br/>Xiao Zi’s demonic qi grew stronger each day. Now, Fang Wang even felt it was not weaker than Xu Lang. And this was just judging from the demonic qi alone. After so many years in the Great Saint’s Grotto-Heaven, it had undoubtedly inherited some extraordinary skills.<br/><br/>“It’s finally over,” Fang Wang stood up and stretched lazily. He had broken through to the Spirit Elixir Realm Second Layer two days prior, so he had not cultivated since then, instead spending his time playing by the lake with Xiao Zi, waiting for the Artifact Spirit of the Great Saint’s Grotto-Heaven to send them out.<br/><br/>Xiao Zi nestled within the collar of his robe on his chest. Ever since learning it would be sent away by the Artifact Spirit, Xiao Zi remained inseparable from Fang Wang over the past few days, always curled up in his arms, fearing that he might be sent away while it was left behind in the Great Saint’s Grotto-Heaven.<br/><br/>“Young master, how much longer?” Xiao Zi asked anxiously, its voice pitifully soft.<br/><br/>Fang Wang stroked its snakehead and said with a gentle laugh, “I don’t know either. Don’t worry, we’ll get out.”<br/><br/>Xiao Zi was bound to him by a Soul-Binding Curse and already belonged to him; the Artifact Spirit should be able to recognize that fact.<br/><br/>During this time, Xiao Zi had helped him collect numerous Heavenly Materials and Earthly Treasures; both of his storage bags were packed full. Since it had worked so hard, he naturally had to reassure it.<br/><br/>“Once we’re outside, I’ll break the curse and set you free. You can start thinking about where you want to go,” Fang Wang continued as he twisted his waist to stretch his muscles and bones.<br/><br/>After returning to Great Abyss Gate, he planned to cultivate non-stop until reaching the Spirit Elixir Realm Ninth Level. By then, with his own extraordinary skills, there would hardly be anyone in the Da Qi Cultivation Realm capable of killing him.<br/><br/>‘Where to go…”<br/><br/>Xiao Zi murmured to itself in Fang Wang’s arms, its serpent eyes reflecting a sense of confusion.<br/><br/>Previously, it only thought about escaping and rarely pondered this question, especially after meeting Fang Wang, as it became preoccupied with pleasing him, leaving no room for other thoughts.<br/><br/>Indeed.<br/><br/>Where should it go?<br/><br/>It had been in the Great Saint’s Grotto-Heaven for over three hundred years; it had no home outside.<br/><br/>Not only was it without kin, but everything outside was also unknown. Where should it head to?<br/><br/>Fang Wang sensed its despondent mood and realized he hadn’t provided proper comfort, so he suggested, “If you don’t know where to go, you can stay with me for a while. Just tell me when you want to leave. Once we are out of the Great Saint’s Grotto-Heaven, you won’t be of any help to me, so I have no reason to keep you trapped. If I wanted to ensure your silence, I could simply kill you.”<br/><br/>He kept his tone as even as possible to avoid frightening Xiao Zi.<br/><br/>After hearing his words, Xiao Zi thought it made sense; months ago, Fang Wang had stopped searching for inheritances, and if he truly wanted to kill it, he could have done so already.<br/><br/>After much consideration, Xiao Zi cooed, “Then I’ll follow the young master. I hope the young master will cherish me.”<br/><br/>“Who taught you to talk like that?”<br/><br/>Fang Wang was speechless and gave its snakehead a pat.<br/><br/>About a hundred years ago, a man and a woman stumbled into the Great Saint’s Grotto-Heaven. After realizing they couldn’t leave, the female cultivator spoke to the male that way. From then on, the man doted on her non-stop and even sacrificed himself so that she could escape when they encountered an evil spirit, ” Xiao Zi explained, blinking its eyes.<br/><br/>Fang Wang said irritably, “I won’t sacrifice myself to save you. If we face danger, I’ll throw you out to buy me time. ”<br/><br/>“The young master jests; how could you possibly face danger? Who would dare to provoke you? That would be outright seeking death,” Xiao Zi answered earnestly, as if speaking from its very soul.<br/><br/>So, the two of them, one human, one beast, chatted casually to pass the time.<br/><br/>By noon, a powerful beam of light descended from the sky, startling Fang Wang into looking up. He had no time to dodge and was enveloped by it, blurring his vision.<br/><br/>“Young Master!”<br/><br/>A cry of alarm from Xiao Zi reached Fang Wang’s ears, and he felt a sinking in his heart. Could it be that Xiao Zi had been left behind?<br/><br/>Unfortunately, he couldn’t move at the moment and was unable to do anything.<br/><br/>A few moments later, Fang Wang felt his feet touch the ground and regained control over his body. He instinctively reached for his chest.<br/><br/>“Young Master?”<br/><br/>Xiao Zits voice sounded again, timid as if fearing it was all a dream.<br/><br/>“Mm, we’ve made it out.”<br/><br/>Fang Wang responded then began to move forward.<br/><br/>After five steps, his vision cleared, and he saw the Vice Sect Leaders and Elders of the Nine Great Sects before him.<br/><br/>Zhao Chuanqian, upon seeing him, obviously relaxed and a smile appeared on his usually stern face.<br/><br/>“What are you waiting for? Let’s go!”<br/><br/>Zhou Xue came up from behind and bumped Fang Wang with her shoulder.<br/><br/>Fang Wang immediately followed her, while Xiao Zi, who huddled in his arms, was too scared to meet anyone and shook in fear.<br/><br/>The disciples from the various sects walked towards their respective groups, quickly forming nine camps.<br/><br/>Only seven disciples from Great Abyss Gate had survived and returned: Fang Wang, Zhou Xue, Gu Li, Lu Yuanjun, Xu Lang, Ye Xiang, and Yan Feiyue.<br/><br/>The other sects had casualties as well, but Great Abyss Gate was relatively fortunate. Fang Wang noticed that only three disciples from Green Cicada Valley had returned, creating an incredibly oppressive atmosphere there. Vice Sect Leader Chen Anshi looked at Xu Qiuming, who had lost an arm, a completely changed person from when he first entered, disheveled but with eyes fiercer than before.<br/><br/>“Only two have died, that’s not too bad,” Chen Anshi said. It was a harsh statement, but Fang Wang and the others were no innocents, so they weren’t upset.<br/><br/>The other Elders of Great Abyss Gate started to comfort them.<br/><br/>At that moment,<br/><br/>Xu Qiuming and Xu Tian Jiao from Suspended Vast Sword Sect approached, causing everyone from Great Abyss Gate to turn and look.<br/><br/>“Fang Wang, thank you for saving my sister. I owe you a favor. If you need my help in the future, as long as it doesn’t harm the interests of Suspended Vast Sword Sect, write to me anytime,” Xu Qiuming said earnestly. Despite his youthful appearance, when he was devoid of smiles, an imposing aura emerged, heavy with authority.<br/><br/>Fang Wang nodded slightly and exchanged a few polite words with Xu Qiuming. Xu Tian Jiao also expressed her gratitude.<br/><br/>Xu Qiuming did not linger and left with Xu Tian Jiao.<br/><br/>Once they were gone, Chen Anshi did not inquire further but simply waved his sleeve. The wooden ship that had carried them to the Great Saint’s<br/><br/>Grotto-Heaven appeared in mid-air, and the disciples immediately followed Chen Anshi onto the ship.<br/><br/>When the Nine Great Sects had first arrived, there were cordial greetings, but after the end of the events in the Great Saint’s Grotto-Heaven, they barely communicated. As the Great Abyss Gate prepared to depart, the other sects did the same, as if a great disaster was imminent.<br/><br/>The wooden ship flew swiftly through the sky, and as Fang Wang looked out from the side, he saw the other eight Great Sects speeding away in different directions.<br/><br/>“Be vigilant on the journey home; no one should be careless,”<br/><br/>Chen Anshi’s voice rang out, explaining why the Nine Great Sects departed so quickly.<br/><br/>Although it was said not to carry grudges into their entry, that was only a public agreement.<br/><br/>For a group like Green Cicada Valley, left with only three disciples, how could they swallow such a defeat?<br/><br/>“Young Brother Fang, how did you fare?”<br/><br/>Lu Yuanjun came over to Fang Wang’s side and asked with a smile, his demeanor so warm and sunny it was easy to feel good about him and let one’s guard down.<br/><br/>Fang Wang replied with a smile, “Not bad, I suppose.”<br/><br/>Lu Yuanjun spoke in a low voice, “I don’t mean to conceal it from you, junior brother, but I’ve obtained one of the Three Great True Cultivations from Ji Hao Sect, the Yin Yang Xuan Ming Zhen Gong. If you want to learn it, just come to me once we’re back at the sect.”<br/><br/>Upon hearing this, Fang Wang quickly said, “How could I accept such a thing? That was obtained by senior brother at the risk of your life; I couldn’t possibly enjoy the fruits of your efforts.”<br/><br/>“Young Brother Fang, with your talent, sharing such profound knowledge with you is truly an investment by the sect. When I become the Sect Leader in the future, you will be the Vice Sect Leader. There’s no need for modesty, ” Lu Yuanjun said with a laugh.<br/><br/>Although their voices were low, everyone on the ship was a cultivator; how could they not hear?<br/><br/>The elders did not look their way, but the disciples could not help but cast glances..\t\t\t\t\t\t</div>", "images": {}, "success": true}