{"id": 60, "url": "https://www.novelhall.com/i-became-an-immortal-on-mortal-realm-32879/14240532.html", "title": "Chapter 60 - Chapter 60: Chapter 58: The Southern Executioner Heavenly King, Cao Ran_L", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 60 - Chapter 60: Chapter 58: The Southern Executioner Heavenly King, Cao Ran_L</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 60: Chapter 58: The Southern Executioner Heavenly King, Cao Ran_l<br/><br/>Translator: 549690339<br/><br/>A large lake was surrounded by rolling mountains, with mist lingering over the water and the peaks reflected in the emerald surface, like a celestial paradise on earth.<br/><br/>Fang Wang walked to the lakeside and sat down in meditation, feeling the spiritual energy of the area. A smile appeared on his face as he praised, “Not bad, it is indeed an excellent place for cultivation.”<br/><br/>Xiao Zi let out a sigh of relief. Throughout the journey, Fang Wang had been silent, occasionally exuding an intimidating aura that left it trembling with fear.<br/><br/>“Feel free to do as you please; I’m going to cultivate here.”<br/><br/>After saying this, Fang Wang began to practice Qi gathering.<br/><br/>He needed to meditate and gather Qi to calm his mind. The fresh air here was everywhere, each view capable of broadening his mood.<br/><br/>Xiao Zi immediately left Fang Wang’s chest. It looked back at Fang Wang, flicked its snake tongue a few times, and then silently left.<br/><br/>There was still plenty of time before the six-month deadline, and Fang Wang had already enjoyed numerous gains, so it was a good choice to meditate here for inner peace.<br/><br/>Half an hour later, he opened his eyes and gazed at the wind-stirred lake as he gathered Qi.<br/><br/>The mountains and waters appeared mystical and enchanting under the cover of thick fog, while ripples occasionally spread across the lake as fish leapt out of the water, making everything seem so beautiful.<br/><br/>After spending more than four hundred years in the Heavenly Palace, he never tired of such landscapes.<br/><br/>And so it went, day by day, with the sun setting and the moon rising.<br/><br/>Fang Wang sat by the lake without standing up, watching the fog disperse and gather, observing the proud sun as it rose and set, and the malice in his heart dissipated.<br/><br/>Every few days, Xiao Zi would return, each time bringing back various Heavenly Materials and Earthly Treasures. Although Fang Wang was resting, it did not dare stop, feeling that only through active effort could it ensure Fang Wang’s loyalty.<br/><br/>One month later.<br/><br/>Fang Wang’s mood had returned to normal, and Xiao Zi clearly sensed that his smiles had become more frequent, lessening its nervousness.<br/><br/>One day, just after Xiao Zi had left, Fang Wang took out the Golden Scale White Feather Robe and began to refine and lift the ownership seals within.<br/><br/>Thanks to his True Combat Technique, his perception of magic artifacts far surpassed his past abilities, and he quickly located the ownership seal.<br/><br/>The seal within the Golden Scale White Feather Robe was extremely complex, making it difficult to claim ownership. It would’ve taken him a long time to control it previously, but now it went smoothly, having fully mastered the True Combat Technique of Great Perfection.<br/><br/>Three hours later.<br/><br/>The treasure, which was at least of exquisite quality, acknowledged him as its master. As he stood up, the Golden Scale White Feather Robe floating before him clung directly onto his body. A golden radiance burst forth, engulfing his figure.<br/><br/>After two breaths, the golden light dissipated, and Fang Wang was dressed in the Golden Scale White Feather Robe. Under the sunlight, the robe’s golden scales shone brilliantly, and the wide sleeves and hem fluttered like white feathers, making him look extremely handsome. Visible golden dragon Qi swirled around him, as if a celestial lord had descended to the mortal world.<br/><br/>Fang Wang felt as light as a swallow. The Golden Scale White Feather Robe could automatically absorb nature’s spiritual energy and had protective seals within. They would be triggered automatically upon attack.<br/><br/>Wearing this robe, he felt in excellent condition and could even guide the robe to store his Spiritual Power.<br/><br/>What a treasure!<br/><br/>Fang Wang grew even more fond of it. He was curious about the defensive capability of the Golden Scale White Feather Robe, but it was not a good idea to experiment with it within the Great Saint’s Grotto-Heaven.<br/><br/>With a thought, the Golden Scale White Feather Robe seeped into the robe of his Great Abyss Gate disciple, out of sight. He could feel it turning into a thin layer clinging to his body, ready to be summoned at any moment.<br/><br/>Convenient!<br/><br/>With such a treasure in hand, Fang Wang felt even better.<br/><br/>He did not continue with his Qi gathering cultivation. Instead, he went to a nearby forest to cut a tree branch, fashioning it into a fishing rod, and used the roots of long grass as the fishing line.<br/><br/>He prepared to fish and relax for a few days.<br/><br/>Before long, he sat by the lake and began fishing.<br/><br/>Without using Spiritual Power, he sat motionless for half a day. By dusk, he finally caught a fish, but, unfortunately, he pulled too hard and only a fish mouth was left on the hook.<br/><br/>Despite the failure, Fang Wang found enjoyment in it.<br/><br/>Three days later, Xiao Zi returned and, seeing him fishing, grew even more suspicious that he had been possessed.<br/><br/>“I wonder which demon it is…”<br/><br/>Xiao Zi thought worriedly, bound to Fang Wang by the Soul-Binding Curse with no other choice.<br/><br/>During this time, Fang Wang could sense Xiao Zi’s Demonic Qi rapidly increasing, likely from devouring the blood and flesh of the black dragon. He did not point it out, nor did Xiao Zi mention it.<br/><br/>Another half-month passed.<br/><br/>The peaceful days were eventually disrupted.<br/><br/>In the early morning, the majestic fog over the lake churned violently, and a howling wind came sweeping in, blowing Fang Wang’s black hair and fluttering his robe.<br/><br/>Xiao Zi, which had been sleeping beside him, woke up startled and looked up, its small snake head revealing a panicked expression.<br/><br/>“So you are Fang Wang of the Great Abyss Gate? You certainly gave this old man quite the hunt!”<br/><br/>A cold voice echoed through the mountains and resonated over the lake surface.<br/><br/>The dense fog parted like terrifying waves, revealing a figure in Fang Wang and Xiao Zits line of sight. It was a middle-aged man dressed in a wide black robe with blood-colored flame patterns. His hair was disheveled, and he wore a bronze forehead protector inlaid with a red jade bead. With leopard-like eyes and thick eyebrows, his skin was slightly dark and he had a defiant smile on his face, resembling a human-shaped fierce ghost.<br/><br/>Fang Wang had not seen this man before, but he could feel that the man’s aura was strong, slightly more powerful than the black dragon he had encountered earlier.<br/><br/>“Who are you?”<br/><br/>Fang Wang stood up and asked.<br/><br/>He could not recall the scenes when entering the Great Saint’s Grotto-Heaven, did not know whether he had seen this man before, and was even more unsure of which sect the man came from.<br/><br/>“Jin Xiao Sect, Southern Executioner Heavenly King, Cao Ran!”<br/><br/>The man in the black robe sneered with a playful look as he looked down at Fang Wang.<br/><br/>“I’ve heard that the Great Abyss Gate has produced a once-in-an-age genius who, after only three years of cultivation, could defeat opponents at the ninth level of the Spirit Elixir Realm. Someone has put a price on your head, and I don’t suppose you’d mind if this old man claimed it?”<br/><br/>Jin Xiao Sect?<br/><br/>Fang Wang felt he might have heard of it, and he was certain that the Jin Xiao Sect was not one of the Nine Great Sects of the Da Qi Cultivation Realm.<br/><br/>Regardless of the origin of the Jin Xiao Sect, Fang Wang was not going to sit and wait for death!<br/><br/>He raised his right hand, and the hilt of the Rainbow Sword appeared in the palm of his hand out of thin air. With a firm grip, a golden light surfaced on his body, and the Golden Scale White Feather Robe materialized.<br/><br/>Seeing Fang Wang’s attire, Cao Ran frowned.<br/><br/>Xiao Zi, on the other hand, was excited. It had not expected Fang Wang to have mastered this treasure. That robe was at least a supreme grade Magic Artifact!<br/><br/>Cao Ran gave it an extreme sense of danger, which made it incredibly nervous just moments ago. But now, seeing Fang Wang summon the Golden Scale White Feather Robe, it felt instantly reassured.<br/><br/>Fang Wang soared upward to the same altitude as Cao Ran, the white light of the Rainbow Sword’s blade flashing in his hand, causing Cao Ran’s pupils to constrict.<br/><br/>This kid…<br/><br/>Is not simple!<br/><br/>Cao Ran had lived for centuries and recognized at a glance the extraordinariness of the Rainbow Sword and the Golden Scale White Feather<br/><br/>Robe.<br/><br/>High -Grade Spirit Treasure, supreme grade Magic Artifact!<br/><br/>That was still a conservative estimate: he could not determine the exact level of the two treasures.<br/><br/>Without another word, Cao Ran raised his right arm, and a Black Great Cauldron materialized out of nowhere above his head. It was a three-legged cauldron with mysterious patterns carved into its surface. As soon as the cauldron appeared, waves of black qi gushed out, like a swarm of demons bursting forth.<br/><br/>“Though I’ve just suffered grave injuries and my realm has fallen, my cultivation is still at the fifth level of the Profound Heart Realm. Kid, today you’ll see just how high the heavens of the Cultivation World are. You, yet to grow up, represent nothing at all!”<br/><br/>Cao Ran roared with laughter, and with a fierce slap of his right palm towards Fang Wang, the black qi from the cauldron morphed into a gigantic black tiger head that roared and charged at Fang Wang.<br/><br/>With incredible speed!<br/><br/>Fang Wang seemed unable to dodge, getting struck head-on by the black qi tiger head. The black qi dispersed, engulfing him. Cao Ran frowned with a look of disdain in his eyes.<br/><br/>But at that moment!<br/><br/>The rolling black qi suddenly scattered, and a white light Sword Qi came slashing through, startling Cao Ran into leaping out of the way. The Sword Qi flew by, splitting the dense fog over the lake in half, continuing unimpeded and striking a distant mountain peak. The mountainside exploded, rocks flew everywhere, and dust billowed; the mountain top was nearly sheared off.<br/><br/>Cao Ran turned his head and looked back. As the black qi dissipated, Fang<br/><br/>Wang’s figure emerged, surrounded by golden dragon qi around the Golden Scale White Feather Robe. His right arm was extended horizontally, with the bright white blade of the Rainbow Sword shining brilliantly. In that moment, Fang Wang’s aura abruptly shifted, along with the look in his eyes.<br/><br/>What sort of look was that?<br/><br/>Cao Ran, who had survived countless brushes with death and endured many perilous situations, was seeing such a gaze for the first time, and it made his heart tremble.<br/><br/>“This kid…”<br/><br/>Cao Ran grabbed one leg of the Black Great Cauldron, channeling his Spiritual Power, and his black robe billowed dramatically.<br/><br/>Fang Wang had intentionally taken the hit just now to test the defensive power of the Golden Scale White Feather Robe.<br/><br/>The result was that the attack from a fifth-level Profound Heart Realm practitioner could not breach his defense.<br/><br/>Is that all?<br/><br/>Fang Wang decided to stop playing along and directly unleashed his True Combat Technique. At that moment, all he had was the will to fight. In his eyes, Cao Ran was already a dead man!<br/><br/>Sword shapes began to appear around him, and with each addition, his aura rose step by step. The golden dragon qi even emitted roars of dragons, and the lake below generated ripples of waves as his aura became intimidating..\t\t\t\t\t\t</div>", "images": {}, "success": true}