{"id": 66, "url": "https://www.novelhall.com/i-became-an-immortal-on-mortal-realm-32879/14256742.html", "title": "Chapter 66 - Chapter 66: Chapter 64: Tianyuan Shocks The World 1", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 66 - Chapter 66: Chapter 64: Tianyuan Shocks The World 1</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 66: Chapter 64: Tianyuan Shocks the World 1<br/><br/>Translator: 549690339<br/><br/>“It’s hard to say, after all, I haven’t crossed hands with the Ninth Level of<br/><br/>Profound Heart Realm. Do you really know the strength of the Ninth Level of Profound Heart Realm? In my view, the distinction between strength and weakness doesn’t rely on realm, but on who the opponent is.”<br/><br/>Fang Wang replied, weighing his own strength in his heart.<br/><br/>Don’t let his age of just twenty-six fool you; he had spent over one thousand five hundred years cultivating those peerless techniques, and his strength could no longer be defined by his realm.<br/><br/>However, his current goal was to break through to the Profound Heart Realm.<br/><br/>Having already reached the eighth level of the Spirit Elixir Realm, he naturally aimed to charge straight into the Profound Heart Realm, where he would have the confidence to face all manner of formidable enemies and dangers.<br/><br/>Afterward, he could spend time on tasks to increase his contribution beyond that of Lu Yuanjun and seize the position of the leading disciple, becoming a candidate for Sect Leader.<br/><br/>Such a move would not only be about revenge but would also bring more benefits to his family.<br/><br/>What is cultivation, after all, if not aptitude, but more importantly, fortune? What is fortune?<br/><br/>Resources are fortune!<br/><br/>Xiao Zi flattered, “Young master is right. With your talent, another hundred years of cultivation would be enough to dominate the world. Surely now is not the time for carelessness.”<br/><br/>After leaving the Great Saint’s Grotto-Heaven, it learned of Fang Wang’s age and the time he had spent cultivating, which came as a great shock to it.<br/><br/>After ten years of cultivation, it wasn’t even at the level of a spirit demon… let alone defeating a Demon King.<br/><br/>Because of this, it now had high hopes for Fang Wang.<br/><br/>In the various secret realms of the Great Saint’s Grotto-Heaven, it had seen many ancient marvels, fully aware of how difficult attaining immortality was, that once in a thousand years would someone become an immortal, and those who did were always individuals with peerless talent and boundless fortune.<br/><br/>Fang Wang’s talent astounded it, and his fortune was even less in need of elaboration, especially considering the gains he made within the Great Saint’s Grotto-Heaven.<br/><br/>The Golden Scale White Feather Robe, the Demon King’s Demon Pill, and that mysterious wall—it seriously suspected that Fang Wang had already learned the mysterious inheritance from the wall.<br/><br/>Such a great thigh must be held tight—if Fang Wang were to become an immortal, wouldn’t it also ascend to heaven on a chicken’s back?<br/><br/>Fang Wang took out the black flood dragon’s demon core from his storage bag, handed it to Xiao Zi, and said, “This demon core isn’t needed for now. When I decide to use it later, slaying a Demon King won’t be difficult. It’s better to give it to you. While I cultivate, you must also strive to become stronger. In a few years, you and I will traverse the world together and strive to become living legends. ”<br/><br/>“Thank you, young master. I will go through fire and water for you from now on!”<br/><br/>Xiao Zi was extremely excited and twined its tail around the demon core, licking it twice with a fascinated expression.<br/><br/>“Strive to transform into a dragon, then I’ll be the Divine Dragon Immortal Monarch.”<br/><br/>“Divine Dragon Immortal Monarch? That sounds so domineering. I will definitely cultivate hard so that I can carry the young master in the future.”<br/><br/>“It’s ride the dragon, not carry the dragon!”<br/><br/>“What’s the difference?”<br/><br/>The two of them chatted, dreaming of future possibilities.<br/><br/>Zhou Xue had advised Fang Wang to put aside his hatred for now and focus on cultivation. Listening to her, it seemed she was right. His greatest advantage was his speed in cultivation. As long as he kept getting stronger, not to mention revenge, it would not be difficult for him to have the final say in the affairs of the Great Abyss Gate one day.<br/><br/>As long as he was powerful enough, Lu Yuanjun, Zhao Zhen, whether they were righteous or evil, would be at his command!<br/><br/>Time flew like an arrow, and Fang Wang, who barely left his home, continued to seclude himself. After Fang Hanyu left that day, he had never come to visit again, and the other Fang Family Disciples didn’t dare to disturb him either.<br/><br/>Nearly two more years had passed.<br/><br/>Fang Wang’s cultivation finally reached the ninth level of the Spirit Elixir Realm. The last level of the Spirit Elixir Realm was much harder to cultivate than the previous levels, but fortunately, his Solaris Scripture was a superior technique.<br/><br/>The Profound Heart Realm was different from the Spirit Elixir Realm as it didn’t rely on external things but mainly on comprehending the natural world, allowing one’s heart to condense into the Profound Heart—what is the<br/><br/>Profound Heart but the heart that understands the profound mysteries of the Dao.<br/><br/>The Profound Heart Realm is a first-class realm within the Da Qi Cultivation World. As for the even higher Condensation Spirit Realm, that was an extremely rare existence, seldom encountered.<br/><br/>Breaking through to the Profound Heart Realm required insight and destiny.<br/><br/>One day, Fang Wang rarely stepped out of his cave dwelling, walking to the edge of a cliff to enjoy the magnificent scenery of the Great Abyss Gate; Xiao Zi followed over his shoulder and wriggled into his chest, peeking out its snakehead.<br/><br/>Eight years of cultivation had completely transformed Xiao Zi into a purple snake, its scales reflecting an unusual cold light under the sun.<br/><br/>At the height of summer, with the scorching sun suspended in the sky, the ten peaks of the Great Abyss Gate were not shrouded in fog, all revealing their bodies, soaring into the clouds, majestic and imposing. One glance at them lifted the spirits.<br/><br/>The ten peaks surrounded the Sect’s Main City like a pair of hands cradling it. From where Fang Wang stood, he could see the figures of various sect disciples flying on their swords, and long lines of cranes sailing past in groups.<br/><br/>“It would be nice to keep cultivating like this.”<br/><br/>Fang Wang suddenly reflected, removed from worldly affairs, temporarily forgetting vengeance, wholeheartedly engaged in cultivation—wasn’t this the life of cultivation he had fantasized about?<br/><br/>Xiao Zi turned its head and looked up at Fang Wang, asking, “Young master, don’t you wish to be the Divine Dragon Immortal Monarch anymore?”<br/><br/>For it, staying in one place for too long became dull, perhaps shaped by its three hundred years in the Great Saint’s Grotto-Heaven, it developed an urge to flee any environment where it lingered for too long.<br/><br/>“Of course not, I’m just making an offhand remark,” Fang Wang said with a light chuckle.<br/><br/>In his previous life, he hadn’t traveled the world and lived a very ordinary life; in this life, he had decided since childhood that he wanted to traverse mountains and rivers. For this goal, he secretly practiced martial arts to avoid revealing his talent, so that the Fang Family wouldn’t have too many expectations of him, which would bind him. Now that he had started cultivating, his desire to wander the world remained unchanged.<br/><br/>Once he helped the Fang Residence firmly embark on the path of cultivation and eliminated all their enemies, he planned to see the world beyond Da Qi.<br/><br/>Just at that moment.<br/><br/>Fang Wang heard the rumbling sound of the mountain gate opening behind him; he glanced back and saw Gu Li walking out of her cave dwelling. She walked up to Fang Wang and asked, “Have you finished your closed-door cultivation?<br/><br/>“Just getting some fresh air, Miss Gu, how has your cultivation been after so many years?” Fang Wang asked with a smile.<br/><br/>Gu Li had obviously practiced some profound technique to conceal her aura; even Fang Wang could not see through her cultivation level.<br/><br/>As expected of the Gu Family from the north.<br/><br/>With a subtle gaze, Gu Li said softly, “Not bad, but definitely no match for you… Fang Wang, is your Lifespirit Treasure really of the Heaven Yuan rank?”<br/><br/>Heaven Yuan rank?<br/><br/>Fang Wang was caught off guard by her question, and he feigned surprise, “How could that be, why do you ask that?”<br/><br/>Could something have happened in these two years?<br/><br/>Fang Wang instantly thought of Guang Qiuxian; could it be Guang Qiuxian trusted Vice Sect Leader Chen Anshi too much and revealed the rank of his treasure spirit?<br/><br/>“Now the entire Da Qi Cultivation Realm is spreading this news, saying that the Great Abyss Gate has a peerless genius with a Heaven Yuan Treasure Spirit, named Fang Wang,” Gu Li replied, her eyes burning with intensity as she looked at Fang Wang.<br/><br/>She wanted to hear Fang Wang admit it himself.<br/><br/>Fang Wang showed an exasperated expression and asked helplessly, “Who said that? How would I not know that my treasure spirit is a Heaven Yuan Treasure Spirit?”<br/><br/>Gu Li stared at him intently and said, “It’s not clear who spread it, but this news has been circulating for a year. Last month, the Grand Elder Fu Xuanji of the Tian Shu Sect declared, after divining the heavens, that he was certain the Great Abyss Gate had indeed produced a destiny’s child surpassing the<br/><br/>Mysterious Origin Treasure Spirit…”<br/><br/>The Tian Shu Sect, one of the Nine Great Sects, belonged to the righteous path and had a relationship with the Great Abyss Gate that wasn’t too good, but not too bad either.<br/><br/>Hearing this, Fang Wang appeared calm, but his mind was in turmoil.<br/><br/>His treasure spirit’s rank had spread throughout the world?<br/><br/>Although he had previously thought about elevating the rank of his treasure spirit, he never intended to expose its Heaven Yuan rank so directly.<br/><br/>Zhou Xue had mentioned before that the Great Abyss Gate in her previous life suffered an invasion from the Demonic Path due to the emergence of several geniuses with Earth Origin Treasure Spirits, and it almost perished. It was after surviving that calamity that the Great Abyss Gate transformed and ultimately became the strongest sect in Da Qi.<br/><br/>Now that his Heaven Yuan Treasure Spirit was exposed, could this bring the calamity sooner?<br/><br/>“You have no idea, the commotion your Heaven Yuan Treasure Spirit caused. Even my father wrote to me, saying that I must befriend you…” Gu Li said with emotion, and for some reason, her earlobes turned red toward the end.<br/><br/>“Wow, young master, your treasure spirit is of the Heaven Yuan rank!”<br/><br/>Xiao Zi popped her head out of Fang Wang’s embrace and asked excitedly.<br/><br/>Fang Wang pressed the snake’s head back down and followed by asking, “What did master say? And what’s the Sect Leader’s attitude, he doesn’t believe it, does he?”<br/><br/>Gu Li replied, “Master warned us not to disturb you and also forbid disciples from other lineages to visit, fearing it might affect your cultivation. As for the Sect Leader, I’m not sure about his stance, but all the Peak Masters were summoned by him. What exactly he said, even the direct disciples don’t know. If it weren’t for you coming out yourself, I wouldn’t have intruded.”<br/><br/>Her gaze towards Fang Wang was filled with amazement.<br/><br/>A living Heaven Yuan Treasure Spirit!<br/><br/>Her initial reaction upon learning this was disbelief, followed by sudden realization and then a return of confidence.<br/><br/>No wonder she could never surpass Fang Wang; the gap in their treasure spirits’ rank was too vast.<br/><br/>If she didn’t compare herself with Fang Wang, she remained a genius rarely seen in a hundred years.<br/><br/>Fang Wang was silent.<br/><br/>Many possible consequences surfaced in his mind, but when he thought of his own cultivation level and then of Zhou Xue, he regained his confidence.<br/><br/>Once he broke through the Profound Heart Realm, even if someone from the Condensation Spirit Realm were to act against him, he might still have the power to fight back!<br/><br/>“Since it has come to this… I can only lay my cards on the table. My treasure spirit is indeed a Heaven Yuan Treasure Spirit. I originally wanted to get along with everyone as having a Mysterious Origin Treasure Spirit, but I never expected… ”<br/><br/>Fang Wang took a deep breath and spoke with a worried expression, embodying the loneliness of a high achiever.<br/><br/>Although Gu Li found his words odd, she didn’t dwell on it and said with exhilaration, “Now you’ve become more famous than Lu Yuanjun; the entire sect recognizes you as the foremost genius of the Great Abyss Gate, and some even say that you should be nurtured to become the next Sect Leader!”\t\t\t\t\t\t</div>", "images": {}, "success": true}