{"id": 69, "url": "https://www.novelhall.com/i-became-an-immortal-on-mortal-realm-32879/14273990.html", "title": "Chapter 69 - Chapter 69: Chapter 66 Transformation Technique [Seeking First Subscription]_L", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 69 - Chapter 69: Chapter 66 Transformation Technique [Seeking First Subscription]_L</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 69: Chapter 66 Transformation Technique [Seeking First Subscription]_l<br/><br/>Translator: 549690339<br/><br/>Impart a technique?<br/><br/>Fang Wang’s heart leapt with joy, but he feigned composure and calmly said, “If you’re willing to teach, I’m naturally willing to learn. However, you must impart something formidable. Too common a spell doesn’t help me much.”<br/><br/>Having mastered the Solaris Scripture, True Combat Technique, Nine Dragons Divine Transformation Art, and Jinghong Divine Sword Art to Great Perfection, anyone who acquired any of these techniques could look down upon their peers with pride, and his sights were already set higher.<br/><br/>Beyond that, he had also mastered the White Rainbow Evasion Technique, Divine Nurturing Sword Qi, Body-protecting Divine Barrier, Great Celestial Thunder Technique, and the Effortless Natural Technique.<br/><br/>At present, he lacked not for combat spells; rather, he was interested in some more esoteric arts.<br/><br/>For instance, sealing, soul-capturing, and prediction techniques.<br/><br/>Zhou Xue’s smile deepened when she heard his request. She walked toward the couch not far away and called out in a light, airy voice, “Come here.”<br/><br/>Fang Wang followed, eager to find out what kind of spells this Immortal Venerable would impart to him.<br/><br/>Zhou Xue sat cross-legged on the couch and gestured for Fang Wang to sit in front of her. He showed no cowardice and followed suit.<br/><br/>Xiao Zi stuck her head out of his embrace, her forked tongue flicking out as her snake eyes stared intently at Zhou Xue.<br/><br/>Suddenly, Zhou Xue waved her sleeve toward the snake, and its head tilted, losing consciousness. Its tongue hung out of its mouth, and then Zhou Xue pulled it out.<br/><br/>Fang Wang didn’t try to stop her, knowing Zhou Xue had something to say.<br/><br/>“Let’s start with your initial question. I’ve investigated, and the news came from a disciple of the third meridian. Guang Qiuxian and Yang Yuanzi were caught off guard. If I’m not wrong, it’s either Zhao Zhen’s doing or Lu Yuanjun’s,” Zhou Xue said softly, her eyes tranquil as still water.<br/><br/>Fanc Wang wasn’t too surDrised to hear this: he’d susoected the leak was<br/><br/>meant to set him up.<br/><br/>Lu Yuanjun and Zhao Zhen might not know Fang Wang had learned the truth of the massacre night, but they couldn’t possibly have forgotten themselves.<br/><br/>Moreover, the fact that they did nothing while Fang Wang’s reputation soared was in itself unreasonable.<br/><br/>“Zhao Zhen never left the Great Abyss Gate, clearly out of wariness. As for Lu Yuanjun, I was beside him when he clashed with the Demon Monarch. The world believes the Demon Monarch showed mercy, but they don’t know Lu Yuanjun escaped on his own strength. His Ghost Instrument has surpassed even the finest Magical Artifacts to reach the rank of a Magical Treasure. For someone in the Condensation Spirit Realm, killing him would be very difficult.”<br/><br/>With this, Zhou Xue’s gaze turned icy cold.<br/><br/>That strong?<br/><br/>Fang Wang frowned, but thinking of the millions of souls that the Ghost Instrument had absorbed, he felt relieved.<br/><br/>Zhou Xue’s tone shifted, “But you don’t need to worry. Though he escaped with his life, he was gravely injured, and he’ll likely need several more years to recover.”<br/><br/>Fang Wang shook his head and said, “I’m not worried. If worst comes to worst, after I break through to the Condensation Spirit Realm, I’ll deal with him myself. I’m only afraid that my reputation will cause trouble for the Fang<br/><br/>Residence.”<br/><br/>“No, your talent will only prove the Fang Family’s bloodline is extraordinary.<br/><br/>The other sects will try to win over the Fang Family. I’ve already arranged for<br/><br/>Fang Family Disciples to join the other Eight Great Sects. Thus, at least the Nine Great Sects will not act against the Fang Family. At most, some noble families might resent you.”<br/><br/>Zhou Xue’s words seemed somewhat reasonable to Fang Wang.<br/><br/>For the sects, noble families pose no threat since their systems are different, and these families could provide them with talented individuals.<br/><br/>“That said, how did Zhao Zhen and Lu Yuanjun find out I am a Heaven Yuan Spirit Treasure?” Fang Wang asked, puzzled.<br/><br/>Zhou Xue chuckled, “They probably just wanted to fan the flames. Your growth rate is already staggering; claiming you are a Heaven Yuan Spirit Treasure will make some believe it’s true. Little did they know, they accidentally hit the mark. Of course, calling your spirit treasure a Heaven Yuan Spirit Treasure is an understatement.”<br/><br/>Fang Wang raised an eyebrow and asked, “What do you mean? Are there levels higher than Heaven Yuan?”<br/><br/>Zhou Xue answered with a question of her own, “Alright, do you have any other questions?”<br/><br/>Fang Wang pouted but then asked, “I’m preparing to mold a third treasure. Should I do it at the Great Abyss Gate or should I look elsewhere?”<br/><br/>Not only the main meridian at the Great Abyss Gate had Heavenly Dao Spirit Stones, but no matter where he chose, it would draw the sect’s attention, so he hesitated.<br/><br/>Zhou Xue raised her right hand, and a storage bag on the table opened. A piece of Green Jade flew out and landed in Fang Wang’s hand—it was a Guide Jade.<br/><br/>“This is a Spirit Molding Ground I have chosen for you in advance. It’s best you go there incognito. If you succeed in spirit molding there, you’ll receive a pleasant surprise,” Zhou Xue said, implying a deeper meaning.<br/><br/>Seeing that Zhou Xue didn’t seem surprised that he was preparing to mold a third treasure, he felt somewhat disappointed inside.<br/><br/>No awe factor there, huh.<br/><br/>Fang Wang took the Guide Jade and placed it into his storage bag, jesting, “All this secrecy—hope it’s not the same routine as with the Southern Executioner Heavenly King, Cao Ran?”<br/><br/>Zhou Xue glared at him upon hearing Cao Ran’s name and huffed, “I did underestimate you back then, but this time it’s not my doing. There is a formidable person in that place. You must act with utmost caution.<br/><br/>Being described as formidable by Zhou Xue made Fang Wang curious.<br/><br/>“Alright, time for the technique. Tell me, what are you going to teach me?” Fang Wang asked eagerly.<br/><br/>Zhou Xue raised her right hand and extended three fingers, saying, “I have three Transformation Techniques that could save your life or allow you to infiltrate enemy territories. The first is the Sparrow Technique, which allows you to transform into a sparrow, but it consumes a lot of Spiritual Power and isn’t very fast. It’s just the easiest to hide with.”<br/><br/>“The second is the White Crane Technique, enabling you to become a white crane, using less energy and allowing for fast flight.”<br/><br/>“The third is the Black Hawk Technique, which lets you become a black hawk. It requires a moderate amount of Spiritual Power among the three techniques, but it’s the fastest.”<br/><br/>Transformation Techniques!<br/><br/>Fang Wang’s eyes lit up, and he asked, “Can I learn all three?”<br/><br/>Zhou Xue shook her head and said, “This technique already possesses the wonders of a Divine Skill. Mortals should not wield Divine Skills. Every Transformation Technique will leave different imprints on your Profound Heart Realm, which will repel each other.”<br/><br/>Hearing this, Fang Wang fell into hesitation.<br/><br/>After all, it was a Transformation Technique. As long as he kept it well hidden most of the time and only transformed at critical moments, it would be tough for the enemy to detect it. The transformed physique wasn’t that important.<br/><br/>Then he should choose the fastest one!<br/><br/>The higher the realm he reached, the stronger the divine senses of the enemies he would face. Even if the sparrow was tiny, it couldn’t escape the pursuit of divine senses. If he considered it from the perspective of being discovered, the faster, the better.<br/><br/>“I’ll learn the Black Hawk Technique,” Fang Wang stated seriously.<br/><br/>Zhou Xue didn’t beat around the bush and immediately began to impart the Sword technique for the Black Hawk Technique.<br/><br/>Fang Wang sighed inwardly. Damn, he had just emerged from a decade-long seclusion, and now it was starting all over again.<br/><br/>But how could he refuse a peerless technique that was handed to him on a platter?<br/><br/>The Transformation Technique focused on channeling spiritual energy into the acupoints. By activating different acupoints, one could achieve a physical transformation. Furthermore, one needed to sense nature’s essence to merge with the world, ensuring that the transformed body wasn’t rejected by the natural world.<br/><br/>After Zhou Xue finished speaking, Fang Wang inevitably entered the Heavenly<br/><br/>Palace.<br/><br/>As usual, after finishing her explanation, Zhou Xue simply gazed steadily at Fang Wang, wanting to see his reaction.<br/><br/>After a moment of absentmindedness in his eyes, Fang Wang took a deep breath and remarked, “Truly, the Transformation Technique is profound and unfathomable. ”<br/><br/>Zhou Xue’s lips curled upward as she said, “It will take about one or two decades to achieve minor success, and fifty years for Great Completion. When you reach the pinnacle of mastery, you won’t need to perform the Spell. With a mere thought, you can transform into a black hawk, with your aura indistinguishable from that of a common black hawk.”<br/><br/>“Yes, I can sense the difficulty.”<br/><br/>Fang Wang sighed. Damn it, it took him ninety-four years to practice a single Transformation Technique.<br/><br/>Fortunately, at Great Perfection, the Black Hawk Technique would allow him to transform into a black hawk instantly, without preparation, and without any leakage of Spiritual Power.<br/><br/>He didn’t reveal that he had already mastered the Black Hawk Technique.<br/><br/>Subsequently, Fang Wang asked about her experiences over the years.<br/><br/>Zhou Xue picked out some of her adventures to share. She had even left the Qi Dynasty and traveled to the northern territories, which made Fang Wang marvel at her tendency to wander.<br/><br/>An hour later, Fang Wang stepped out of Zhou Xue’s cave dwelling. As the mountain gate closed behind him, he flew toward the Main Meridian.<br/><br/>Xiao Zi in his arms had not yet awakened, while Fang Wang organized his thoughts.<br/><br/>Practicing the Black Hawk Technique for ninety-four years meant he had to prepare anew how he would speak with Guang Qiuxian.<br/><br/>On his way to the peak of the Main Meridian, he landed in front of Shiyuan Hall.<br/><br/>The disciple sweeping the plaza below merely glanced up at him without much thought. However, one disciple seemed to realize something, looked up again, and with eyes wide with excitement, exclaimed, “Brother Fang Wang!”<br/><br/>As soon as these words came out, the other disciples cleaning the area looked up in surprise.<br/><br/>The job of cleaning here wasn’t really about the cleaning. After all, Cultivators wielded magic and could easily tidy up. Usually, those assigned to sweeping had made some mistake and used the task to reflect and calm their mind. Those permitted to clean this place were at least at the level of a Sword Disciple.<br/><br/>Fang Wang glanced over and felt the person looked somewhat familiar, but before he could give it more thought, he saw the gate of Shiyuan Hall opening and immediately stepped inside.<br/><br/>The disciple who recognized Fang Wang laughed smugly, “See? Fang Brother looked at me. I’ve told you guys, Fang Wang Brother is quite solitary within the sect. There are very few disciples who can converse with him. Fortunately, I, Zhou Bo, am one of them. Do you want to know Brother Fang Wang’s secretive hobbies?”<br/><br/>The surrounding disciples turned their attention to him; although skeptical, they were eager to hear his babble.<br/><br/>On the other side.<br/><br/>Fang Wang entered Shiyuan Hall and made his way to see Guang Qiuxian.<br/><br/>Guang Qiuxian sat on his mat, smiling at Fang Wang. After Fang Wang had paid his respects, Guang Qiuxian took the initiative to ask, “How has your practice been these years?”<br/><br/>Fang Wang nodded and said, “Quite good. Thanks to the Sect Leader and<br/><br/>Master for their care, I’ve been able to concentrate on my cultivation.”<br/><br/>“What realm have you achieved now?” “Profound Heart Realm.”<br/><br/>“Hm, no… what? Profound Heart Realm!”<br/><br/>Guang Qiuxian was initially smiling but suddenly widened his eyes, his tone filled with astonishment.<br/><br/>Although Fang Wang’s strength couldn’t be measured in mere realms, revealing his true realm hadn’t been a problem. It could help him gain even more recognition from Guang Qiuxian.<br/><br/>Fang Wang nodded. Seeing this, Guang Qiuxian struggled to compose himself and said with emotion, “Good! Good! Good!”<br/><br/>“Fang Wang, you’ve truly exceeded my expectations. I originally thought that if you could reach the Profound Heart Realm by the age of forty, it would be quite impressive, considering you only started Cultivation at sixteen. But now, by my estimate, you’re only about thirty years old, right?” The more Guang Qiuxian looked at Fang Wang, the more satisfied he became.<br/><br/>Fang Wang replied with a smile, “Thank you for the Sect Leader’s favor. Because you imparted Spells and provided Spiritual Energy, I have achieved what I have today.”<br/><br/>Guang Qiuxian laughed and said, “As you should. In fact, I have something to tell you.. Are you aware that the grade of your Spirit Treasure has been exposed?”\t\t\t\t\t\t</div>", "images": {}, "success": true}