{"id": 61, "url": "https://www.novelhall.com/i-became-an-immortal-on-mortal-realm-32879/14245894.html", "title": "Chapter 61 - Chapter 61: Chapter 59 Long Memory_1", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 61 - Chapter 61: Chapter 59 Long Memory_1</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 61: Chapter 59 Long Memory_1<br/><br/>Translator: 549690339<br/><br/>“Jinghong Divine Sword Art?”<br/><br/>Cao Ran furrowed his brows tightly, an unease thrumming in him.<br/><br/>With one hand he held the Great Cauldron aloft, and with the other he cast spells rapidly, swirling dark energy engulfing his body, its force creating a tornado that sucked up the lake water toward the firmament. As the black energy tornado’s maximum diameter exceeded fifteen feet, darkness fell over the lakeside as if night were about to engulf them.<br/><br/>On the dim surface of the lake, Fang Wang became the most dazzling presence, his Golden Scale White Feather Robe fluttering fiercely, thirty-six swords already condensed around him.<br/><br/>The thirty-six strikes of Jinghong combined with the True Combat Technique had brought Fang Wang’s momentum to its peak. Facing Cao Ran at the fifth level of the Profound Heart Realm, Fang Wang didn’t fall behind in the slightest, even suppressing Cao Ran slightly.<br/><br/>Clenching his teeth, Cao Ran let out an angry shout, and with a fierce motion, he directed the mouth of the Great Cauldron towards Fang Wang, a tempestuous black energy whirlwind rushing toward Fang Wang with the might to level mountains, the lake water scattering like a torrential downpour, as though the Milky Way were cascading down.<br/><br/>Almost simultaneously, Fang Wang thrusted with his sword, the thirty-six sword forms striking out in unison, quickly merging into a massive Sword Qi, piercing through the black energy whirlwind that blotted out the sun, evaporating the rainstorm that filled the sky.<br/><br/>Boom!<br/><br/>The thirty-six strikes of the Jinghong Divine Sword powerfully scattered the black energy tornado, Cao Ran holding the cauldron with both hands, as before his eyes, the boundless black wind suddenly dispersed, and an exceedingly brilliant massive Sword Qi bore down upon him.<br/><br/>Cao Ran, startled, raised the Great Cauldron to block, only to feel an unstoppable great force crashing into his Lifespirit Treasure.<br/><br/>“To be so formidable… Had I been an ordinary practitioner at the fifth level of the Profound Heart Realm, my Lifespirit Treasure would have shattered instantly… ”<br/><br/>Cao Ran thought gritting his teeth, he exerted all his strength yet still staggered backwards, his arms trembling.<br/><br/>He was forced back dozens of feet above the lake, his neck veins bulging, still unable to hold back the terrifying might of the thirty-six strikes of Jinghong.<br/><br/>Suddenly!<br/><br/>A chill rushed up his spine, and instinctively turning his head, he saw Fang Wang appearing behind him, looking down on him from above, his hand still holding the sword radiating white light.<br/><br/>Fang Wang’s face was expressionless, the cold gleam in his eyes flashing sharply, his sword slashing down. Cao Ran dodged immediately, but caught between attacks from front and behind, his reaction was still too slow. The Sword Qi slashed through his robe, cutting a diagonal line across his chest, blood spurting forth.<br/><br/>Boom!<br/><br/>From Xiao Zi’s perspective, Fang Wang’s strike sent Cao Ran plummeting from the sky to crash into the lake, with a splash he fell into the water, while his blood still dotted the air.<br/><br/>After Cao Ran plunged into the lake, his Great Cauldron followed, smashing into the water.<br/><br/>Fang Wang dove down, breaking into the lake, and water sprayed upwards.<br/><br/>On the lakeside, Xiao Zi watched anxiously, not being able to see the situation at the bottom of the lake, it couldn’t help but be worried for Fang Wang. It didn’t doubt Fang Wang’s strength, but rather feared Cao Ran would resort to trickery.<br/><br/>After three breaths’ time.<br/><br/>The lake’s surface suddenly exploded, two figures burst out swiftly, slamming into the grass by the lakeside and dragging out a trench seven feet long. Xiao Zi turned its head, witnessing Fang Wang standing over Cao Ran, his right hand inversely gripping the Rainbow Sword, thrust into Cao Ran’s chest, while Cao Ran, his hands grasping the white glowing sword blade, his flesh torn and arms trembling.<br/><br/>With his right hand inversely wielding the Rainbow Sword, Fang Wang pressed down without expression, even twisting the sword handle.<br/><br/>At this moment, what appeared as battle will in Cao Ran’s eyes was the chilling intent to kill.<br/><br/>Cao Ran couldn’t push Fang Wang away, his Spiritual Power concentrating in his palms. If not for the help of Spiritual Power, his hands would have been sliced off by the Rainbow Sword long ago.<br/><br/>The Rainbow Sword churned inside his chest, causing him excruciating pain. Suddenly, he saw nine sword forms condensing out of thin air behind Fang Wang, terror dilating his pupils.<br/><br/>“Wait! I am not your enemy!”<br/><br/>Fang Wang did not heed him as the nine sword forms behind him suddenly surged toward Cao Ran, swooping down and grazing past Fang Wang’s cheek.<br/><br/>‘%hou xue!”<br/><br/>Cao Ran shouted in haste, before the words could even fall, the nine sword forms ceased, one stopping less than an inch from his face.<br/><br/>In that moment, Cao Ran felt as if he had died.<br/><br/>The icy light in Fang Wang’s eyes dissipated, returning to clarity; had he not cultivated the Combat Heart, at such a distance, he’d not have been able to stop in time.<br/><br/>That was the strength of the Combat Heart; casting aside all distractions, only battle will remained, not a derangement akin to possession, but a battle will under absolute rationality. Thus, upon hearing the two words ‘Zhou Xue,’ he stopped his hand at once.<br/><br/>Under the state of the True Combat Technique, everything seemed to slow. It was a subtle feeling.<br/><br/>Fang Wang didn’t let go, staring down at him, inquiring with his eyes as the nine sword forms hovered in front, their keenness making his face ache.<br/><br/>Taking a deep breath, Cao Ran said begrudgingly, “It was Zhou Xue who sent me to test you, fearing you were too arrogant, wanting me to teach you a lesson and impress a long-lasting memory…”<br/><br/>He was extremely vexed mentioning this.<br/><br/>He had thought it would be an easy task to bully a junior, not expecting it to nearly cost him his life…<br/><br/>He really wanted to ask Zhou Xue whether she wanted Fang Wang to remember this lesson, or for him to remember it.<br/><br/>Fang Wang frowned and asked, “Aren’t you from Jin Xiao Sect?”<br/><br/>Cao Ran coughed feebly, saying, “Now that it has come to this, there’s no need to hide it from you. Two years ago, Zhou Xue joined the Jin Xiao Sect and even rescued me from the sealed land. Therefore, I owe her my life. Don’t spread this matter around; otherwise, it will affect her operations within the Great Abyss<br/><br/>Gate.”<br/><br/>Fang Wang’s expression became odd.<br/><br/>Zhou Xue joined the Jin Xiao Sect…<br/><br/>Damn!<br/><br/>Everyone in the Great Abyss Gate, from the Vice Sect Leader to his own people, were they all undercover?<br/><br/>Fang Wang drew out the Rainbow Sword and slowly retreated as Cao Ran stood up, crossed his legs, and began to meditate to heal his injuries. His chest was a bloody mess, with fresh blood continuously flowing out.<br/><br/>“You’re really something… I’ve never seen a talent like you before. Looking across the seven nations of the Cultivation World, I guess only those legendary prodigies mentioned in the stories can compare with you…”<br/><br/>Cao Ran lamented, feeling the thrill of surviving a disaster; his heart was still pounding violently.<br/><br/>Fang Wang thought carefully and concluded that Cao Ran probably wasn’t lying to him. If it were an enemy, they wouldn’t have fabricated such an excuse at the brink of death.<br/><br/>Moreover, he never had any dealings with Jin Xiao Sect.<br/><br/>“Can you tell me about the Jin Xiao Sect? Why did Zhou Xue join Jin Xiao Sect?” Fang Wang asked.<br/><br/>Cao Ran shook his head lightly, “Sorry, I can’t say. She does not want you to get involved with Jin Xiao Sect. Jin Xiao Sect is not a force of good, and the things they are plotting will sooner or later make them the enemy of the world.” Fang Wang, hearing this, didn’t press further but left a message before turning to leave:<br/><br/>“Heal your wounds and then be on your way.”<br/><br/>Watching Fang Wang’s retreating figure, Cao Ran wanted to say more but hesitated.<br/><br/>Why didn’t this youngster act his age? Was he really not even twenty years old?<br/><br/>Cao Ran didn’t have the courage to call out to Fang Wang; for the first time, he felt fear towards a junior.<br/><br/>Forget it, recover from the injuries and make a quick escape!<br/><br/>Returning to the lakeside, Fang Wang sat down to gather Qi, with Xiao Zi slithering over, her snake eyes fixated on Cao Ran, fearing he might launch a sneak attack.<br/><br/>Xiao Zi stayed silent, just sitting beside Fang Wang and watching Cao Ran.<br/><br/>Until dusk, when Cao Ran said his goodbyes and left, still bleeding along the way, looking very ragged.<br/><br/>“Master, should we find another place?” Xiao Zi asked softly.<br/><br/>Fang Wang, enjoying the sunset, replied, “No need, the scenery here is quite nice.”<br/><br/>Even the fifth layer of the Profound Heart Realm was no match for him; he no longer needed to run away. Now he intended to concentrate on cultivation while waiting for the half-year period to end.<br/><br/>Lately, he had been contemplating whether to wander the world or find a quiet place to cultivate and open up a Cave Heaven that truly belonged to him.<br/><br/>His residence within the Great Abyss Gate ultimately belonged to the sect. And as he grew stronger, who knows if Lu Yuanjun would resort to schemes.<br/><br/>After all, Guang Qiuxian was a being of the Condensation Spirit Realm!<br/><br/>He was strong now but not yet so strong that he could disregard the Great Abyss Gate entirely.<br/><br/>His philosophy was to always keep a trick up his sleeve and never let others know how strong he really was.<br/><br/>Xiao Zi looked at him, then followed his gaze towards the lake surface. The setting sun reflected in the water, shimmering with light, as the silhouettes of both man and snake slowly darkened.<br/><br/>Atop a cliff, Zhou Xue stood against the wind; she wore a bamboo hat with a veil covering her face.<br/><br/>Cao Ran stood beside her, his body wrapped in white bandages, looking very ragged, his usually dark face showing signs of pallor.<br/><br/>After recounting his battle with Fang Wang, he couldn’t help but start coughing.<br/><br/>“Your clansman is practically a monster. Now look at me. Not only did my old injuries not heal, but I’ve also got new ones. In the next twenty, no, fifty years, don’t ask me to do anything else for you!” Cao Ran said bitterly, with a tone filled with emotion.<br/><br/>Zhou Xue was silent for a moment before suddenly laughing. She said softly, “He always surprises me. This time, I truly underestimated him. Cao Tianwang,<br/><br/>I will compensate you and help your injuries heal soon.”<br/><br/>At those words, Cao Ran’s eyes brightened, and he asked, “Really?”<br/><br/>“Hmm, after the matter of the Great Saint’s Grotto-Heaven is settled, I will accompany the Demon Monarch to the Northern Territory, and then I can pick a Thousand-year Jade Bone Ice Lotus for you,” Zhou Xue answered.<br/><br/>Upon hearing this, Cao Ran immediately smiled, “With the Sect Hierarch taking action, I’m naturally at ease.. But on another note, where exactly has the Sect Hierarch gone? It’s been three years since the founding of the sect, and when will the positions of the Four Heavenly Kings finally be filled?”\t\t\t\t\t\t</div>", "images": {}, "success": true}