{"id": 68, "url": "https://www.novelhall.com/i-became-an-immortal-on-mortal-realm-32879/14260078.html", "title": "Chapter 68 - Chapter 68: Chapter 65 Breakthrough To The Profound Heart Realm [Seeking Subscriptions]_L", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 68 - Chapter 68: Chapter 65 Breakthrough To The Profound Heart Realm [Seeking Subscriptions]_L</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 68: Chapter 65 Breakthrough to the Profound Heart Realm [Seeking Subscriptions]_l<br/><br/>Translator: 549690339<br/><br/>“The third vein has become lively because of you, every day there are disciples from other veins coming to inquire about your news. Later, when you go to the sect’s main city, it might be difficult for you to get away,” Gu Li said, her tone full of teasing.<br/><br/>Fang Wang smiled and said, “Then I will just have to visit the sect’s main city less often.”<br/><br/>Afterward, he changed the topic and inquired about the changes in the Great Abyss Gate over the past two years.<br/><br/>Gu Li stood beside him, looking at the distant scenery together, and she began to talk about what she knew.<br/><br/>The year before was calm, the Great Abyss Gate didn’t encounter any major events, until the news of the Heaven Yuan Spirit Treasure came out. The Great Abyss Gate became lively, and every month there were sects and noble family cultivators coming to visit. The Great Abyss Gate as a result recruited quite a<br/><br/>few disciples exceptionally, all of whom chose to join the third vein.<br/><br/>More and more people began to praise Fang Wang’s cultivation feats, making him sound almost mythical.<br/><br/>If the Great Abyss Gate had previously been like a dazzling array of stars, now Fang Wang overshadowed everyone’s brilliance, including Lu Yuanjun. Ever since Lu Yuanjun was seriously injured by the Demon Monarch, he had been healing for a number of years and had not made any public appearances, which made it difficult for most disciples to remember him. Fang Wang listened while contemplating.<br/><br/>Too much attention is not a good thing!<br/><br/>Next, he must seize the time to break through the Profound Heart Realm, and after the breakthrough, he would then probe the Sect Leader’s intentions!<br/><br/>After chatting for half an hour, Fang Wang found an opportunity to excuse himself and returned to his cave dwelling to cultivate.<br/><br/>Gu Li looked towards his mountain gate, her heart full of emotions.<br/><br/>“So the Heaven Yuan Spirit Treasure really exists… I wonder how strong he is now…”<br/><br/>In the sect’s main city, Task Hall, first floor great hall.<br/><br/>Fang Hanyu stepped in with his eyes covered, attracting the attention of many as soon as he entered.<br/><br/>“It’s him again, he’s back so soon?”<br/><br/>“That’s Fang Hanyu, Fang Wang’s cousin, his contribution points have been rising so fast.”<br/><br/>“He only takes on tasks to kill enemies, and they are all very difficult.”<br/><br/>“I heard that last month he killed two direct disciples of the Chi Devil Sect, and it was a two against one situation.”<br/><br/>“Tsk tsk, if he’s this powerful, then how strong must Fang Wang be? It looks like the Fang Family of the Southern Hills is on the rise.”<br/><br/>Fang Hanyu ignored the surrounding discussions. He made his way to the fourth floor to visit Elder Zhang.<br/><br/>When Elder Zhang saw him walking into the room, a smile appeared on his face, and he said, “Your efficiency is just too high. On average, you complete two tasks a month, and the targets are all at the First or Second Layer of the Spirit Elixir Realm.”<br/><br/>Fang Hanyu walked up to the desk and took a wrapped head out of his storage bag, saying modestly, “I’m just trying my best, my contributions are still very few.”<br/><br/>Elder Zhang checked and verified the head while sighing, “Your reputation has grown a lot lately, be careful of the Demonic Path targeting you.”<br/><br/>Fang Hanyu nodded and said, “Elder, don’t worry, I always disguise myself when I go out, so I won’t be targeted.”<br/><br/>“You also need to be careful within the sect. No sect is free of leaks, understand?” Elder Zhang said meaningfully.<br/><br/>Upon hearing this, Fang Hanyu’s brows furrowed, as he began to review the details of every mission trip he had taken.<br/><br/>Soon, Elder Zhang helped him re-enter his contribution points, and he excused himself and left.<br/><br/>As he reached the door, he saw someone and stopped. The person was Zhou Xue.<br/><br/>Zhou Xue was dressed in red, with two storage bags at her waist, looking valiant and beautiful. Her makeup was exquisite and as her cultivation grew, she became even more stunning.<br/><br/>“Long time no see!”<br/><br/>Zhou Xue smiled and raised her eyebrows at Fang Hanyu, then without waiting for him to respond, she brushed past him.<br/><br/>“Elder Zhang, I’m here to submit a mission too, don’t get scared again this time,” she called out.<br/><br/>Hearing Zhou Xue’s words, Fang Hanyu couldn’t help but turn his head to look, but it was only a glimpse; he closed the door behind him as he left the room.<br/><br/>Walking in the corridor, Fang Hanyu was filled with curiosity.<br/><br/>He was curious about how strong Zhou Xue had become and even more curious about Fang Wang’s current cultivation level.<br/><br/>Zhou Xue, just like him, often went out for training, which must have delayed her cultivation, at least not as much as Fang Wang’s.<br/><br/>When he thought about Fang Wang’s nearly ten years of seclusion, Fang Hanyu truly admired him.<br/><br/>Not everyone can sit in meditation for so long, especially young people like them who find it hard to withstand loneliness, always tempted by the world below the mountains.<br/><br/>Inside the cave dwelling.<br/><br/>Fang Wang was seated cross-legged on a white jade bed, his hands operating his cultivation technique, with nine fireballs floating behind his head, forming a circle and causing the space around to twist.<br/><br/>Xiao Zi lay near a small pond, looking at Fang Wang.<br/><br/>It secretly marveled, curious about the cultivation technique Fang Wang was practicing, as the flames were too domineering!<br/><br/>It hadn’t seen anything like this fiery cultivation technique in the Great Saint’s Grotto-Heaven.<br/><br/>At this moment, Fang Wang was in the process of breaking through to the Profound Heart Realm.<br/><br/>A year and a half had passed since his last conversation with Gu Li; he was fast approaching thirty.<br/><br/>Reaching the Profound Heart Realm by the age of thirty was an unrivaled display of aptitude in the Great Abyss Gate. For a monster to cultivate to the realm equivalent to the Profound Heart Realm, the Demon King level, it would nearly be impossible without two hundred years.<br/><br/>Perhaps because of the Combat Heart, Fang Wang encountered no obstacles in condensing his Profound Heart. While he cultivated, he felt the natural essence within the cave dwelling.<br/><br/>The Profound Heart understood the nature of heaven and earth, and could hear the voices of all things, such as animals that do not speak human language, and could even sense the emotions of plants.<br/><br/>In a certain sense, reaching the Profound Heart Realm was truly stepping onto the path of cultivation; the previous three realms were merely forging the foundation for cultivation.<br/><br/>Gradually, Spiritual Power began to grow in Fang Wang’s heart, flowing through his meridians and bones, and the essence of his Spiritual Power was also elevating.<br/><br/>This process was delightful, indescribable, and irresistibly entrancing.<br/><br/>Days passed.<br/><br/>Eventually, Fang Wang achieved a breakthrough, officially reaching the first level of the Profound Heart Realm. His Spiritual Power doubled, and his divine consciousness also strengthened considerably, filling him with joy.<br/><br/>Under his inner vision, he noticed a new black groove appearing in his Treasured Spirit Space, signaling that he could create a third Lifespirit Treasure.<br/><br/>However, without the Heavenly Dao Spirit Stone in his cave dwelling, he could not condense a Lifespirit Treasure.<br/><br/>He did not get up immediately but chose to continue stabilizing his cultivation level.<br/><br/>It took a full seven days before his Spiritual Power stopped growing autonomously, signaling a complete end to his breakthrough.<br/><br/>He stood up, stretched his muscles, and felt lighter than before.<br/><br/>After stretching, he began to tidy up his clothes, put on his storage bag, and<br/><br/>Xiao Zi, seeing that he was about to leave, immediately followed; it had been eager to do so for a while.<br/><br/>Fang Wang did not dare to let it out for fear it would cause trouble or encounter difficulties.<br/><br/>Walking out of the cave dwelling’s gate, the sunlight poured down on him, making him feel refreshed and invigorated.<br/><br/>Now at the Profound Heart Realm, his approach to the world had changed. With his Great Perfection techniques, added to his Lifespirit Treasure and magic artifacts, even if Lu Yuanjun and Guang Qiuxian conspired to kill him, he would escape, and no one could stop him.<br/><br/>“Master, where will we go next?” Xiao Zi asked, its tone full of anticipation.<br/><br/>Fang Wang had initially intended to find Guang Qiuxian to test his attitude but had a change of heart and decided to look for Zhou Xue first.<br/><br/>Having not seen her for many years, he rather missed her.<br/><br/>Fang Wang didn’t answer and immediately took to the sky on his sword, flying towards the First Meridian.<br/><br/>Having been in secluded cultivation for nearly ten years, although Fang Wang had a great reputation within the sect, few still remembered his face. Thus, as he flew, the disciples along the way did not immediately recognize him, their gazes drawn to his impressive presence.<br/><br/>Having reached the First Meridian, Fang Wang inquired around before he found the location of Zhou Xue’s cave dwelling. Zhou Xue also had a significant reputation now, ranking among the top five in fame among the newer generation of disciples, with only Fang Wang, Lu Yuanjun, and Ye Xiang clearly ahead of her.<br/><br/>At the entrance to the mountain, Fang Wang called out, “Zhou Xue, are you there?”<br/><br/>He was unsure; in his memory, Zhou Xue spent most of her time adventuring outside, and he didn’t know if she was currently in her dwelling.<br/><br/>After a few moments, with no response, Fang Wang felt a twinge of disappointment and was about to turn and leave when suddenly the mountain gate opened.<br/><br/>“Come in.”<br/><br/>The entrance to the cave was dark, obscuring the view inside, and Zhou Xue’s indifferent voice floated out. Fang Wang felt a surge of happiness and immediately entered the cave dwelling.<br/><br/>As soon as he entered, the mountain gate closed behind him automatically, and a fragrant scent filled Fang Wang’s nostrils. He noticed that the cave walls were covered with various vines bearing dark purple flowers. As he walked forward, he saw Formation talisman papers every few steps, either pasted on the cave walls or on the vines.<br/><br/>Upon reaching the inner chamber, Fang Wang saw Zhou Xue. She was meditating in a pool, drenched, her curves outlined, though her red gown remained opaque.<br/><br/>Each direct disciple’s cave dwelling had such a pool, with varying sizes, made from condensed Spiritual Energy.<br/><br/>Fang Wang approached the pool’s edge, observing her hair sticking to her face, her skin pale as snow, with her long hair casually tied behind her head. He had to admit, it gave her a certain feminine charm.<br/><br/>“Why don’t you get up and change before facing me?” Fang Wang couldn’t help but ask.<br/><br/>Zhou Xue, eyes still closed, replied, “Nobody but you can enter, so why stand on ceremony with you? What’s wrong, the dwelling next door houses Miss Gu, along with a mother snake demon, isn’t that enough? Have you taken a liking to me now?”<br/><br/>“Nonsense, how could that be possible!”<br/><br/>Fang Wang rolled his eyes, annoyed. He quickly changed the subject, asking, “The grade of my Lifespirit Treasure has been exposed. Who do you think leaked it?”<br/><br/>Zhou Xue finally opened her eyes, her long eyelashes lifting with droplets of water, revealing a pair of enchanting and vivid eyes as her gaze fell upon Fang Wang. She didn’t respond right away but took her time sizing him up.<br/><br/>Fang Wang looked away as Xiao Zi suddenly popped out from his embrace and exclaimed, “It’s you, wicked woman! Who’s calling someone a mother snake demon?”<br/><br/>“Are you saying you’re male?”<br/><br/>“Of course not, but something about what you said feels off.”<br/><br/>“Seems you’re somewhat clever.”<br/><br/>Zhou Xue began to banter with Xiao Zi, but sadly, Xiao Zi was no match for her wit and quickly lost the verbal duel.<br/><br/>Splash—<br/><br/>Zhou Xue stood up, steam rising from her body as her clothes dried at a visible speed; even her wet hair did the same. Her black hair danced in the air, her red garments billowed, exuding a sense of celestial grace.<br/><br/>She stepped out of the pool barefooted and approached Fang Wang. Barely half a meter apart, her eyes glinted with a strange, dark nefarious energy.<br/><br/>“Profound Heart Realm, you truly didn’t disappoint me. With such rapid progress, I could teach you a technique. Would you like to learn?” Zhou Xue asked with satisfaction, gazing intently at Fang Wang..\t\t\t\t\t\t</div>", "images": {}, "success": true}