{"id": 65, "url": "https://www.novelhall.com/i-became-an-immortal-on-mortal-realm-32879/14256735.html", "title": "Chapter 65 - Chapter 65: Chapter 63 Turmoil In The Cultivation World 1", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 65 - Chapter 65: Chapter 63 Turmoil In The Cultivation World 1</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 65: Chapter 63 Turmoil in the Cultivation World 1<br/><br/>Translator: 549690339<br/><br/>Fang Wang followed Fang Hanyu out of the cave dwelling, and the two men took different paths, with Fang Hanyu returning to the cave dwelling to cultivate, while Fang Wang flew towards the Sect’s main city.<br/><br/>There, he took out one-tenth of the treasures he had obtained in the Great Saint’s Grotto-Heaven and donated them to the sect in exchange for contribution points.<br/><br/>He went to the Task Hall and found Elder Zhang. When Fang Wang presented a batch of Heavenly Materials and Earthly Treasures, Elder Zhang was shocked; it was simply too much.<br/><br/>Elder Zhang was too busy to handle it alone, so he called over several disciples to help calculate.<br/><br/>In the end, Fang Wang received seven hundred and seventy-nine thousand contribution points, shooting up to the top twenty of the third vein’s contribution board in one fell swoop. Elder Zhang praised Fang Wang for his grand vision and decided he would report the matter to the main meridian. The looks the Task Hall disciples gave Fang Wang were full of admiration.<br/><br/>After exchanging pleasantries for quite some time, Fang Wang finally left the Task Hall.<br/><br/>Returning to the third vein but not directly to his cave dwelling, Fang Wang went to the mountaintop to visit his master, Yang Yuanzi, who happened to be there.<br/><br/>After entering Qingxin Hall, Fang Wang bowed and said, “Master, your disciple has donated a batch of Heavenly Materials and Earthly Treasures at the Task Hall. I’ve also had new insights into the Jinghong Divine Sword Art, which I’d like to show you and see if I’m on the right path.”<br/><br/>He took out a yellowed book from his storage bag, which contained his insights into the final nine swords of the Jinghong Divine Sword Art.<br/><br/>He had prepared this book long ago but hesitated to share it with Yang Yuanzi for fear of provoking him. Now, after hearing about the tragic events that befell the Da Qi royal family, he felt it necessary to act and at least draw closer to his relationship with Yang Yuanzi.<br/><br/>Yang Yuanzi frowned and didn’t reach out to take the book.<br/><br/>Fang Wang continued, “Master, this supreme technique was originally passed down to me by you. It’s only right that I return it to you. I also want to contribute to the third vein and not just reap the benefits without effort.”<br/><br/>Guang Qiuxian was right—his master really was stingy, or rather, Yang Yuanzi was too proud.<br/><br/>Yang Yuanzi hesitated a long time before finally taking the yellowed book Fang Wang offered.<br/><br/>“Da Qi is currently unstable, with invasions from other dynastic sects on the outside and disturbances from the Jin Xiao Sect on the inside. Just stay in the sect and cultivate quietly; don’t go out. And don’t feel too burdened about contributing. You have already achieved the best result for the third vein in decades. The overall resources of the third vein have increased significantly. All disciples of the vein should be grateful to you,” Yang Yuanzi said earnestly.<br/><br/>Fang Wang nodded and replied, “I will heed Master’s advice. I plan to enter seclusion to cultivate, striving to reach the ninth level of the Spirit Elixir Realm as soon as possible and then to challenge the Profound Heart Realm.”<br/><br/>Upon hearing this, Yang Yuanzi was deeply moved and said, “The Heaven Yuan Spirit Treasure truly exceeds expectations. It’s only been four years since you started, and you’re already looking towards the Profound Heart Realm. When you do break through, I will appoint you as the great disciple of the third vein. If you wish to compete for the position of the Great Abyss Gate’s direct disciple in the future, I will support you.”<br/><br/>“Hmph, it’s time for our third vein to rise. Your talent is stronger than Lu<br/><br/>Yuanjun’s; you should compete!”<br/><br/>When it came to Lu Yuanjun, Yang Yuanzi’s tone was filled with scorn.<br/><br/>Fang Wang felt a pang of emotion. Who would have thought that Yang Yuanzi, who ridiculed Lu Yuanjun, would die for him?<br/><br/>He suddenly became very curious about the story between Yang Yuanzi, Guang Qiuxian, and Lu Yuanjun’s mother—whether it was a tragic love story or a melodramatic plot twist.<br/><br/>After a long talk, Fang Wang finally took his leave.<br/><br/>On his way down from the mountaintop, the third vein disciples he met all greeted him warmly. His reputation within the Great Abyss Gate was now substantial; aside from his combat achievements in the Nine Veins Combat Method, the public praises from Ye Xiang, Xu Lang, and Yan Feiyue also kept his name from fading over time, making it even more rooted in people’s hearts.<br/><br/>Once back at his cave dwelling, Fang Wang sat down to practice his cultivation.<br/><br/>Xiao Zi was also cultivating. Fang Wang gave it a portion of the treasures from the black flood dragon’s flesh and blood, which excited it greatly.<br/><br/>According to Xiao Zi, the realms for monster progression from low to high were Spirit Demon, Great Demon, Demon King, and Great Demon King, corresponding exactly to the Qi Cultivation, Spiritual Refinement, Spirit Elixir, Profound Heart, and Condensation realms.<br/><br/>Currently, Xiao Zi had reached the peak of the Great Demon realm, thanks to the flesh of the black flood dragon. Now it was attempting to advance to the realm of a Demon King.<br/><br/>Fang Wang was quite looking forward to it becoming a Demon King. There were no Demon Kings in the Great Abyss Gate; most demon pets were of the Spirit Demon realm, with those reaching the Great Demon level in the hands of elders and peak masters.<br/><br/>The cave dwelling was quiet, with the sun and the moon cycling outside.<br/><br/>Years went by.<br/><br/>In the first year, the Fang Family Disciples all came to visit Fang Wang. After learning of his seclusion, they no longer disturbed him in the following years.<br/><br/>In the blink of an eye,<br/><br/>Six years passed.<br/><br/>As one advanced in the Spirit Elixir Realm, cultivation became increasingly difficult. Even with the help of the Great Perfection’s Solaris Scripture, Fang Wang had only reached the eighth level of the Spirit Elixir Realm.<br/><br/>Meanwhile, Xiao Zi had successfully stepped into the realm of a Demon King. Oddly enough, it still couldn’t transform into a human shape, which was quite mysterious, and even Xiao Zi didn’t understand why.<br/><br/>Fang Wang wasn’t in a hurry, it was quite good not to transform, If he did transform, Zhou Xue would definitely tease him, and now it was quite nice to be kept as a pet.<br/><br/>It was autumn, and the third meridian was tinted with the shades of fall, leaves fluttering down.<br/><br/>A figure landed in front of the mountain gate, It was Fang Hanyu, His stature was tall and straight, his long hair coiled under a purple crown, his eyes wrapped in a strip of black cloth, two locks of hair falling beside the outer corners of his eyes. A breeze passed, waving the strands of hair, showcasing a dashing demeanor.<br/><br/>“Fang Wang. ”<br/><br/>Fang Hanyu called out, Compared to six years ago, his temperament was even better, full of youthful spirit with an edge that couldn’t be ignored.<br/><br/>The mountain gate opened with a bang, and Fang Hanyu stepped inside.<br/><br/>“Your energy isn’t bad at all, you’ve reached the ninth level of the Soul Sculpting Realm already?”<br/><br/>Xiao Zi teased, to which Fang Hanyu simply nodded slightly, walking directly up to Fang Wang.<br/><br/>Fang Wang opened his eyes, sizing him up.<br/><br/>Six years ago, Fang Hanyu was already at the third level of the Soul Sculpting Realm, and in just six years he had soared to the ninth level, It couldn’t be said to be slow. Although he couldn’t compare with Fang Wang, he could definitely be considered a top-notch genius.<br/><br/>And there, Fang Hanyu was already wearing the robe of a Direct Disciple.<br/><br/>One had to say, the Absolute Heart Evil Eye was really formidable, Green Cicada Valley had researched it for many years without success, which showed how difficult it was to attain the Absolute Heart Evil Eye. If not for Zhou Xue, the reborn, Fang Hanyu wouldn’t have had such a great opportunity.<br/><br/>“You’ve reached the ninth level of the Soul Sculpting Realm, you haven’t disappointed me. With you here, I can cultivate with peace of mind. Do you need me to give you Heavenly Materials and Earthly Treasures to condense your Spirit Pill?” Fang Wang said with a satisfied smile.<br/><br/>Fang Hanyu sat at the table, shaking his head while pouring himself a cup of tea, “No need, Zhou Xue has already prepared them for me.”<br/><br/>It was her again.<br/><br/>Fang Wang felt in his heart, damn, being reborn really was different,<br/><br/>Cultivation constantly rising, able to go undercover, and even gathering Heavenly Materials and Earthly Treasures for those around her, he couldn’t imagine how busy Zhou Xue’s life must be.<br/><br/>“Zi Geng and the others have also made their own progress, now even the one with the lowest status and rank is an Inner Sect Disciple. Our Fang Family has a bit of a reputation within the Great Abyss Gate now, especially with you and Zhou Xue at the forefront, those millennial families can’t compare.” Fang Hanyu said softly with a smile.<br/><br/>Upon hearing this, Fang Wang also felt very pleased, If one could have clanship accompany them on the path to pursing immortality, that would naturally be excellent.<br/><br/>Afterward, Fang Hanyu continued to talk about the events that occurred in the Great Abyss Gate over these years.<br/><br/>The tragedy of the Da Qi royal family came to an inconclusive end. Now, the state affairs are dominated by a new Prime Minister. He corresponds with Zhao Zhen through letters, discussing matters of the state. As for Zhao Zhen, he has been cultivating at the Great Abyss Gate. His talent is not bad, he has proven himself within the sect, and his Lifespirit Treasure is a Middle-grade Profound Origin Precious Spirit, worthy of the sect’s strong cultivation.<br/><br/>After speaking of Zhao Zhen, Fang Hanyu brought up the Cultivation World.<br/><br/>“Over these years, the Jin Xiao Sect has been making waves, Their four<br/><br/>Guardian Kings have successively attacked Green Cicada Valley and Huangyu Mountain, inflicting heavy losses on both demonic sects. They have even declared that they want to make Jin Xiao Sect the only sect in Da Qi.”<br/><br/>“All four Guardian Kings are powerful cultivators, comparable to the level of a<br/><br/>Vice Sect Leader, and the strongest among them even entered Huangyu Mountain alone, unstoppable.”<br/><br/>Speaking of the Jin Xiao Sect, Fang Hanyu expressed admiration.<br/><br/>Because the Jin Xiao Sect attacked the Demonic Sect, the disciples of the righteous Great Abyss Gate didn’t dislike them. The Cultivation World is just a larger world, and most cultivators care greatly about reputation, They are curious to see how far Jin Xiao Sect can go.<br/><br/>Fang Wang knew that Zhou Xue had joined the Jin Xiao Sect, He too held great expectations for the sect.<br/><br/>What sect could possibly be worthy of Zhou Xue, the reborn Immortal Venerable, joining?<br/><br/>“By the way, three years ago, Lu Yuanjun encountered an attack by the Sect Hierarch of Jin Xiao Sect, the Demon Monarch, and it’s said that he was gravely injured, He’s still recuperating in his Cave Heaven. The Sect Leader was furious, One of the Peak Masters even descended the mountain to investigate Jin Xiao Sect.” When Fang Hanyu brought up this matter, he appeared unsurprised.<br/><br/>He remarked, “Lu Yuanjun really has terrible luck, running into a Demon<br/><br/>Monarch even when just going out for experience. Luckily, the Demon<br/><br/>Monarch didn’t want to kill him.”<br/><br/>If the four Guardian Kings of the Jin Xiao Sect are that strong, then the Demon<br/><br/>Monarch’s cultivation must be unfathomably profound. So although Lu Yuanjun was injured, more people feel the Demon Monarch intentionally showed mercy.<br/><br/>Fang Wang thought the same after hearing this, He even felt there might be a backer for Lu Yuanjun within the Jin Xiao Sect, otherwise, why would Zhou Xue join it?<br/><br/>The two brothers chatted for a long while.<br/><br/>Before leaving, Fang Hanyu informed Fang Wang that once he broke through to the Spirit Elixir Realm, he would descend the mountain to earn sect contributions. He was doing this because sect contributions could be exchanged for a tremendous amount of cultivation resources, He wanted to help the Fang Family become a cultivation family. Moreover, he was also interested in the position of the foremost disciple of the second meridian.<br/><br/>After seeing him off, Fang Wang returned to the white jade bed and continued to meditate.<br/><br/>Xiao Zi came over and said, “Young master, you were able to defeat a cultivator of the fifth level of the Profound Heart Realm six years ago, sweeping through the Profound Heart Realm shouldn’t be difficult for you now, right?”\t\t\t\t\t\t</div>", "images": {}, "success": true}