{"id": 71, "url": "https://www.novelhall.com/i-became-an-immortal-on-mortal-realm-32879/14274566.html", "title": "Chapter 71 - Chapter 71: Chapter 68: A Radiant Glory, The Divine", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 71 - Chapter 71: Chapter 68: A Radiant Glory, The Divine</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 71: Chapter 68: A Radiant Glory, The Divine<br/><br/>Dragon Appears in the World [4th Update, Request for Monthly Pass]_l<br/><br/>Translator: 549690339<br/><br/>As the disciples were discussing the influx of talents, Zhou Xue gathered with the Fang Residence disciples, except for Fang Hanyu who was absent.<br/><br/>Fang Zigeng spoke with emotion, “Fourteen years of cultivation and already overshadowing the prestige of talents who have cultivated for decades, is this the deterrence of the Heaven Yuan Spirit Treasure?”<br/><br/>The other Fang Family Disciples were excited, feeling a sense of shared glory.<br/><br/>Zhou Xue, however, was calm, her gaze fixed on the combat platform, lost in thought.<br/><br/>Just then, a cry of surprise rose from the distant disciples.<br/><br/>“Fang Wang is here!”<br/><br/>Zhou Bo exclaimed excitedly, pointing toward Fang Wang with his right hand.<br/><br/>Everyone turned their heads to look, and saw a figure flying from the direction of the Third Channel. It was Fang Wang indeed. He was not riding a Flying Sword but a white disciple’s robe fluttered in the air; his aura was not strong, yet as he skimmed past the sky above the main city, his out-of-this-world demeanor drew people’s gazes naturally.<br/><br/>After so many years of cultivation in the Heavenly Palace, a hard-to-describe sense of vicissitude emanated from Fang Wang’s being. Yet, this sense of age combined with his youthful and handsome appearance, instead conjured a unique charm.<br/><br/>Zhao Zhen, looking at Fang Wang’s figure, said with emotion, “When some people appear, you just know who the hero of the story is.”<br/><br/>The surrounding disciples from the Third Channel agreed with him. Fang Wang was now the pride of the entire Third Channel. Praising Fang Wang would earn you the friendship of the disciples from the Third Channel, and<br/><br/>Zhao Zhen’s words made him even more beloved by the disciples around him.<br/><br/>Lu Yuanjun also looked toward Fang Wang, his face showing an expression of anticipation and admiration.<br/><br/>“It’s been ten years; I wonder how strong Fang Wang is now,” Yan Feiyue remarked with emotion.<br/><br/>The day in the Great Saint’s Grotto-Heaven where Fang Wang slew the black<br/><br/>Jiaolong had remained vivid in his mind, as if it had happened just yesterday.<br/><br/>Gu Li, wearing a veil, fixed her beautiful eyes on Fang Wang, filled with anticipation because she believed Fang Wang would win.<br/><br/>Fang Wang crossed through the combat platform’s formation opening and gently landed on it. At that moment, all eyes were on him. From all directions, ardent gazes were cast upon him. His face was calm, his posture upright, and his right hand lightly rested on the hilt of the Qingjun Sword at his waist. Xiao Zi remained in his embrace, though she dared not peek out.<br/><br/>In Cultivator combat, it is permissible to bring along one’s Demon Pet. A cultivator’s comprehensive strength is never solely determined by cultivation level.<br/><br/>“Fang Wang really has a great bearing,” Fang MO commented with emotion.<br/><br/>With so many cultivators watching, Fang Wang remained unflapped. That such a person was his clansman felt almost surreal to him now.<br/><br/>Zhou Xue’s expression remained indifferent, showing no intention to comment.<br/><br/>Greedy Sleeper stood outside the combat platform, raised his hand to cast a spell, and the twelve Golden Mirrors within the Sect’s Main City soared into the sky, quickly enlarging and hovering above the city, reflecting the combat platform. No matter where in the main city, everyone could see Fang Wang’s figure.<br/><br/>“That’s Fang Wang? How handsome!”<br/><br/>“Ten years have passed, and Brother Fang Wang’s charm has only increased.”<br/><br/>“It’s hard to imagine he’s only practiced cultivation for fourteen years.<br/><br/>Standing there, I feel like he has already won.”<br/><br/>“That’s just the psychological suggestion that the Heaven Yuan Spirit Treasure gives you all. You feel that the Heaven Yuan Spirit Treasure should win.”<br/><br/>“Even if the Heaven Yuan Spirit Treasure is powerful, facing thirteen contemporary top talents in sequence, it’s going to be tough to achieve victory against all of them, right?”<br/><br/>The discussions of the cultivators echoed throughout the main city, where the majority of disciples believed Fang Wang was undoubtedly the strongest, but the opponents were too many. To win against them all seemed unlikely; this wasn’t a Nine Veins Combat Method, and his opponents now were all top talents from various sects.<br/><br/>Guang Qiuxian leaped forward, landing on the combat platform with a gentle smile spilling across his face as he stroked his beard and said, “Today is a day of discourse between the Tai Yuan Sect Disciples and the various talented cultivators of the Cultivation World. We seek Dao and not discord, so even as victory and defeat shall be determined, the eternal Path of Immortality knows no end. Regardless of the outcome, I hope both sides can share their visions of the great path to immortality.”<br/><br/>His words, carried by the twelve Golden Mirrors, echoed throughout the city, eliciting admiration from the Nine Channels’ disciples and cultivators alike. A Sect Leader’s words truly possess a grand scale.<br/><br/>At the edge of the combat platform, the thirteen talents prepared to challenge Fang Wang were chatting with laughter.<br/><br/>Liu Jun of the Suspended Vast Sword Sect, adorned in blue and graceful with a folding fan in hand, looked around at the talents with a smile and said, “Fellow daoists, how about you let me go first to test his depth?”<br/><br/>As soon as he spoke, a talented cultivator from the Crimson Sect coldly snorted, “Why should you be the one to go first?”<br/><br/>The other talents chimed in, each wanting to be the first to go up. One reason was their knowledge of Fang Wang’s years of cultivation, and the other was their confidence in themselves, all wishing to defeat Fang Wang with honor and dignity.<br/><br/>At that moment, a voice floated over:<br/><br/>“Gentlemen, there’s no need to argue. Why don’t you all come up together?”<br/><br/>At those words, the smiles on the faces of the thirteen talents froze, all turning to look at Fang Wang in astonishment.<br/><br/>The smile on Guang Qiuxian’s face also stiffened as he looked questioningly at Fang Wang, wondering if he was serious.<br/><br/>The other day, when Fang Wang said he would deal with these talents all at once, Guang Qiuxian had assumed it would be a rotating battle like in the Nine Veins Combat Method. Little did he know this young man actually wanted to take on these talents alone.<br/><br/>The twelve Golden Mirrors focused on Fang Wang, and even though he spoke softly, his words were clearly conveyed to all parts of the city—besides, he did not speak in a low voice; it was quite loud and clear.<br/><br/>The city fell silent, and even the disciples of the Tai Yuan Sect were moved.<br/><br/>Lu Yuanjun’s smile vanished, and he furrowed his brows deeply.<br/><br/>Zhao Zhen, however, still had a smile on his face, although his hands clenched tightly inside his sleeves.<br/><br/>“Hmph, aren’t you a bit too arrogant?”<br/><br/>Song Jinyuan from the Da Qi Sword Saint lineage glared coldly at Fang Wang and spoke with a chill, his hands cradling his sword, clothed in simple attire, wearing a Bamboo Hat, his face weathered, eyes as fierce as a lion’s, both cold and exuding an aura of dominance.<br/><br/>Fang Wang said calmly, “None of you want to miss the chance to cross hands with me, so come at me together. It’ll save time. Besides, you really don’t stand a chance one-on -one.”<br/><br/>Arrogant!<br/><br/>That was everyone’s first reaction upon hearing those words.<br/><br/>A smile crossed Zhou Xue’s face for the first time.<br/><br/>Seeing Fang Wang so confident, Guang Qiuxian could only choose to believe in him, so he said, “If that’s the case, then all of you go up together.”<br/><br/>Even he said so, and the thirteen geniuses naturally didn’t refuse. They leaped onto the combat platform one after another, quickly forming a line and surrounding Fang Wang. Their gazes towards Fang Wang varied; some were<br/><br/>Liu Jun tucked his folding fan into his waistband and raised his hand to summon a great bow. He scoffed, “Fang Wang, aren’t you going to reveal your Heaven Yuan Spirit Treasure, to enlighten us all? I’m really curious what it’s like, to make you so dismissive of everything!”<br/><br/>Song Jinyuan didn’t utter another word and drew the long sword from his hand. The blade was four fingers wide, silver-blue in color, exuding cold air, and clearly of a high grade at first glance.<br/><br/>The other geniuses took out their own magic artifacts, and some directly summoned their Lifespirit Treasures.<br/><br/>Fang Wang raised his right hand, and the Heavenly Palace Halberd materialized in his grip. This time, he didn’t hide the true might of the Heavenly Palace Halberd; an overbearing aura burst forth, sweeping across all directions and kicking up a fierce wind.<br/><br/>Whine—<br/><br/>A dragon’s whine echoed from within the Heavenly Palace Halberd, resonating throughout the entire city and capturing every cultivator’s gaze.<br/><br/>What an imposing halberd!<br/><br/>Although many disciples had seen the Heavenly Palace Halberd in the Nine Veins Combat Method ten years ago, they were still dazzled upon seeing it again.<br/><br/>At this moment, the Lifespirit Treasures of the thirteen geniuses began to tremble. Those who hadn’t summoned their Lifespirit Treasures were shocked to find that their own treasures involuntarily revealed themselves.<br/><br/>The disciples around the combat platform also had drastic changes in expression, feeling the unrest in their Lifespirit Treasures, grateful that the formations around the platform kept them under control.<br/><br/>“Could the anomalies back then have been caused by his creation of a Heaven Yuan Spirit Treasure?”<br/><br/>Someone couldn’t help exclaiming aloud. Sixteen years ago, the Lifespirit Treasures of all the disciples in the sect uncontrollably burst forth from their bodies, trembling anxiously. How could they forget such an event?<br/><br/>Lu Yuanjun’s face turned serious. Although his expression seemed no different from other disciples around him, his heart was surging with a desire to kill.<br/><br/>He felt the threat from Fang Wang, and it was strong!<br/><br/>He thought about Zhao Zhen’s words; if Fang Wang were to surpass him and learn the truth about the past, would he really let Lu Yuanjun go?<br/><br/>Although he had only interacted with Fang Wang a few times, he noticed that Fang Wang was different from most cultivators. He wasn’t in a hurry to seek allegiance for the sake of profit. Perhaps that was what made a genius, not needing others.<br/><br/>Fang Wang held the halberd in one hand with his robe fluttering, his aura like a rainbow. He looked down at the geniuses surrounding him and said, “Gentlemen, why not announce your names? Today’s battle is also our first exchange. I hope we can make friends through fighting and pursue the Path of<br/><br/>Immortality together.”<br/><br/>He wanted to compete, but he wanted it to be fair and square!<br/><br/>And he didn’t wish to make enemies by being arrogant.<br/><br/>Upon hearing this, the expressions of the thirteen geniuses eased. They understood Fang Wang’s arrogance. If they had a Heaven Yuan Spirit Treasure, they would surely be even prouder. But now that Fang Wang was extending an olive branch, how could they refuse?<br/><br/>Despite their anger, they were all aware that Fang Wang, with his Heaven Yuan Spirit Treasure, would inevitably become a legend beyond their reach.<br/><br/>“Crimson Sect, Tang Kun!” “Chi Devil Sect, Li Lisheng!” “Disciple of Sword Saint, Song Jinyuan!”<br/><br/>“Taiqing Gate, Lu Xunfeng!”<br/><br/>“Tian Shu sect, MO Bei!”<br/><br/>One bv one. the geniuses announced their names. After everyone had sD0ken, Fang Wang soared into the sky with the halberd in one hand.<br/><br/>The thirteen geniuses subconsciously looked up at him.<br/><br/>“Ten years ago, in the Great Saint’s Grotto-Heaven, I learned an extraordinary art. Now I’ve barely entered the threshold, and I’ll demonstrate it to you all.”<br/><br/>Fang Wang looked down on them, his tone calm as he spoke. As his words fell, strands of energy rapidly circulated around his body, solidifying and forming a huge dragon’s head.<br/><br/>Nine Dragons Divine Transformation Art, Qi Dragon!<br/><br/>Guang Qiuxian looked up, his brows tightly furrowed; he was just as curious about what extraordinary art Fang Wang had learned.<br/><br/>Under the watchful eyes of all, the Qi Dragon around Fang Wang swiftly solidified, the dragon’s whiskers and eyes becoming lifelike, as if possessed by a dragon spirit.<br/><br/>Shape Dragon!<br/><br/>Next, the Shape Dragon emitted a white light, transforming into a White Dragon!<br/><br/>Upon seeing this, Guang Qiuxian and the Nine Channels’ Peak Masters changed expression drastically, seemingly realizing something, their faces showing disbelief.<br/><br/>Fang Wang leaped into the air once more. Originally just a dragon head, as he ascended, the head rose and extended into a body, resembling a Divine Dragon traveling from another dimension. By the time he soared to a hundred feet, a majestic White Dragon stretching twenty Zhang long proudly hovered in the sky, looking down on the combat platform.<br/><br/>Nine Dragons Divine Transformation Art!\t\t\t\t\t\t</div>", "images": {}, "success": true}