{"id": 74, "url": "https://www.novelhall.com/i-became-an-immortal-on-mortal-realm-32879/14275615.html", "title": "Chapter 74 - Chapter 74: Chapter 71 Just Looking Forward To Fang", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 74 - Chapter 74: Chapter 71 Just Looking Forward To Fang</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 74: Chapter 71 Just Looking Forward to Fang<br/><br/>Wang of the Great Abyss Gate [Seventh Release, Seek Monthly Votes]_l<br/><br/>Translator: 549690339<br/><br/>“Oh? May I ask what your daughter’s surname and name are, and which lineage she belongs to?”<br/><br/>Fang Wang looked at the middle-aged man with a smile, asking; although he had seen every sight during his half-month descent from the mountain, he had little communication with others, so he was willing to chat with the man at the moment.<br/><br/>The middle-aged man sat down right there and took out a wine gourd from his storage bag. While unscrewing it, he smiled and said, “That, young man, I cannot tell you. What business brings you to Sword Heaven Marsh?” Fang Wang did not hide anything, replying, “To undergo Spiritual Refinement.”<br/><br/>“Spiritual Refinement? Sword Heaven Marsh has a Spirit Molding Ground? I wasn’t aware of that. The Sword Saint is in this place, so perhaps there really is one. Young man, you are indeed bold; undertaking such a journey here without having undergone Spiritual Refinement. Did you encounter many difficulties along the way?” the middle-aged man remarked with emotion.<br/><br/>With the help of his Breath Concealment Technique, the middle-aged man couldn’t see through Fang Wang’s aura.<br/><br/>During the ten years of seclusion, Xiao Zi also learned a method to conceal its breath, which it found in the Great Saint’s Grotto -Heaven. Previously, in the Great Saint’s Grotto-Heaven, it had to emit Demonic Qi to drive away other demon creatures, so it only touched the surface of the technique and didn’t delve deeply into it. Now that it had mastered the breath-concealing technique, it looked like an ordinary snake, albeit brightly colored.<br/><br/>“Indeed, it was difficult,” Fang Wang said with a feigned sigh.<br/><br/>“Meeting is fate. Even though you have come for Spiritual Refinement, you must be a Sword Cultivator too. My name is Gu Tianxiong, what about you?” the middle-aged man said with a smile.<br/><br/>He felt that Fang Wang, even without having undergone Spiritual Refinement, must be no ordinary individual if he had managed to get this far. Perhaps, he was a prodigy. So, making his acquaintance was undoubtedly a good thing. Fang Wang responded, “I am Zhou Yu.”<br/><br/>“Zhou Yu? A fine name. If you can refine an Earth Origin Spirit Treasure, then you’ll soar to great heights. Perhaps I will have to rely on you in the future,” Gu Tianxiong said with a hearty laugh.<br/><br/>For some reason, Fang Wang felt like he had heard the name Gu Tianxiong before.<br/><br/>His surname is Gu, his daughter is acquainted with him…<br/><br/>Could it be related to Gu Li?<br/><br/>It makes sense, the Gu Family is a Sword Dao family, coming here in pursuit of the Sword Saint is quite normal.<br/><br/>Fang Wang asked, “May I know what is your relation to the Luo Bei Gu Family?”<br/><br/>Upon hearing this, Gu Tianxiong raised his chin proudly and smiled smugly, “I didn’t expect you’ve heard of the Luo Bei Gu Family. Yes, I come from the Luo Bei Gu Family.”<br/><br/>“I see, no wonder you carry yourself with such poise and vigor.”<br/><br/>“Haha, young brother, you sure have a way with words.”<br/><br/>Fang Wang flattered skillfully, drawing their relationship closer. Gu Tianxiong was a great conversationalist, and he began to relay legends about Sword Heaven Marsh and the Sword Saint.<br/><br/>The history of Sword Heaven Marsh is shrouded in mystery, located to the south of Da Qi, hidden deep within a vast range of mountains. Legend has it that long ago, the sky cracked open, spilling the Milky Way. The ancient Immortal Gods repaired the sky, and “Sword Heaven Marsh” formed from the water left behind. From the surrounding mountain peaks, the lake resembles the shape of a sword, hence it was named Sword Heaven Marsh.<br/><br/>The Sword Saint, having lived over six hundred years, was already the foremost Great Cultivator in the Cultivation World three hundred years ago. Later, he traveled south across the sea in search of the elixir of immortality. Upon his return, which was thirty years ago, his reappearance shook the Da Qi Cultivation Realm. The Nine Great Sects all sent emissaries to win him over, but he resided at Sword Heaven Marsh and did not wish to involve himself further. As time passed, the Cultivation World gradually forgot about the existence of the Sword Saint.<br/><br/>“Some say the Sword Saint’s life is coming to an end and he will sit in meditation to pass away in Sword Heaven Marsh. That’s why I’ve rushed here. Even if I can’t obtain his sword, just to glimpse the grace of the Sword Saint would be one of life’s great fortunes,” Gu Tianxiong said longingly.<br/><br/>Fang Wang thought of Zhou Xue’s words.<br/><br/>Could it be that if he succeeds in Spiritual Refinement at Sword Heaven Marsh, he would receive the Sword Saint’s legacy?<br/><br/>What exactly is the unimaginable benefit?<br/><br/>Fang Wang found Sword Heaven Marsh even more intriguing.<br/><br/>The two continued to chat until the moon hung high in the sky. Gu Tianxiong didn’t seem tired, and Fang Wang, having suppressed himself for over three hundred years, was similarly spirited.<br/><br/>Their conversation lasted all night long.<br/><br/>Until dawn, when the fiery red sunlight illuminated the mountains, Gu Tianxiong expressed his genuine admiration, ‘Zhou Yu, my young brother, you truly are a conversationalist. I thought I was quite the talker, but it seems we were fated to meet late in life. You wouldn’t believe how much my precious daughter hates my chatter.”<br/><br/>Upon hearing this, Fang Wang grew even more convinced that his daughter must be Gu Li.<br/><br/>Apart from when facing Fang Wang, Gu Li was typically aloof, often playing a listening role in crowds. Thinking back to when she first became a disciple, she was quite spirited. He wondered whether it was just an act or if she had eventually changed her character.<br/><br/>“Let’s go, Brother Gu. It’s time to head to Sword Heaven Marsh.”<br/><br/>Fang Wang stood up, smiling, with Xiao Zi slipping into his embrace.<br/><br/>In the presence of strangers, Xiao Zi maintained its silence. Therefore, though Gu Tianxiong had noticed it early on, he did not realize that this was in fact a Demon King.<br/><br/>The two of them then began to fly on their swords, with Gu Tianxiong flying not too quickly, as if worried that Fang Wang couldn’t keep up.<br/><br/>“Zhou Yu, my young brother, since you keep a snake, I wonder if you know how to ‘play’ with snakes?”<br/><br/>“Play with snakes? How so?”<br/><br/>Fang Wang asked in surprise, clearly feeling the body of Xiao Zi in his arms grow stiff.<br/><br/>Gu Tianxiong burst out laughing, “Haha, it seems, Zhou Yu, you’ve been preoccupied with cultivation. My friend, let me warn you, a person shouldn’t always be so immersed in cultivation. You’ve got to find some pleasures in life. I know a strange man who loves raising snakes. For every seven days spent in cultivation, he takes two days to ‘play’ with snakes…”<br/><br/>He went on a torrent of speech. At first, Fang Wang was genuinely interested, but as he listened further, he became speechless.<br/><br/>This old coot is not serious at all!<br/><br/>He’s so damn flirty!<br/><br/>Fang Wang inwardly despised Gu Tianxiong, but he still asked humbly to avoid wounamg ms pride.<br/><br/>Xiao Zi trembled more violently as she listened, uncertain whether she was angry or afraid.<br/><br/>An hour later.<br/><br/>They finally approached the vicinity of Sword Heaven Marsh. Standing on his Flying Sword, Fang Wang looked into the distance. High mountains stretched in two rows, with a dense forest in between, shrouded by heavy fog. At the end of the forest, a huge lake emerged, partly concealed by the mountains, its exposed waters blue, resembling a fairyland on earth.<br/><br/>From afar, Fang Wang was captivated by the beauty of Sword Heaven Marsh, and he noted that the Spiritual Energy here was very rich, although the Demonic Qi was abundant in all directions.<br/><br/>Gu Tianxiong stopped bantering about snakes and began cautioning Fang Wang not to wander about Sword Heaven Marsh.<br/><br/>Fang Wang couldn’t help but smile wryly; after just one night’s acquaintance, Gu Tianxiong seemed to have truly taken him as a brother.<br/><br/>The two sped up and before long, they shot through the gap between the mountains and arrived in front of Sword Heaven Marsh. The location, though surrounded by mountains, was actually quite vast, spanning at least a thousand feet in width, with an azure lake that resembled an ocean, its surface faintly veiled in mist.<br/><br/>Fang Wang noticed some figures standing on the lake surface, eyes closed, quietly perceiving their surroundings.<br/><br/>The two landed at the edge of the lake. Gu Tianxiong looked around, clearly searching for the Sword Saint.<br/><br/>Fang Wang observed as well, his gaze drawn to an elder with white hair. The elder, wearing simple white clothing and barefoot, stood on the lake’s surface, where whirlpools appeared beneath his feet and formed continuous ripples.<br/><br/>Just then, a young boy came walking over the waves. He seemed to be only seven or eight years old, light as a swallow. He briskly approached Fang Wang and Gu Tianxiong.<br/><br/>“What brings you here?” the boy asked, his voice unexpectedly robust, like a vigorous grown man, which caused both Fang Wang and Gu Tianxiong to twitch.<br/><br/>Gu Tianxiong bowed in greeting and said, “I am Gu Tianxiong from the Luo Bei Gu Family, here to seek the inheritance of the Sword Saint.”<br/><br/>The boy nodded and then turned to Fang Wang.<br/><br/>Fang Wang said, “I’ve come for Spiritual Refinement. May I ask if there’s a<br/><br/>Spirit Molding Ground here?”<br/><br/>The boy looked puzzled after hearing this and said, “You wait here.”<br/><br/>He turned back to Gu Tianxiong and said, “Follow me.”<br/><br/>Without hesitation, he turned and walked over the waves. Gu Tianxiong winked at Fang Wang and then quickly followed, hovering across the lake’s surface with his sword.<br/><br/>After they were gone, Xiao Zi raised her head, hissing her snake tongue and said pitifully, “Master, please don’t listen to him and pull out my teeth.”<br/><br/>Fang Wang replied irritably, “I don’t like to play with snakes, what are you thinking?”<br/><br/>“Really? That’s quite…” Xiao Zi murmured, leaving her sentence half-finished, but Fang Wang was preoccupied and didn’t ask further.<br/><br/>Some time passed.<br/><br/>At the far end of the lake, the thick fog parted, and a man in yellow garments, hands clasped behind his back, approached while walking on the lake. A sword-shaped aura, visible to the naked eye, surrounded him, incredibly sharp.<br/><br/>Before the man arrived, the sword wind had already swept to the lakeshore, causing Fang Wang’s white clothes to flap and rustle.<br/><br/>He quickly reached Fang Wang, scrutinized him, and asked, “You’ve come for<br/><br/>Spiritual Refinement?”<br/><br/>“Indeed. May I trouble you for guidance? Is it possible to perform Spiritual<br/><br/>Refinement here?” Fang Wang asked with clasped hands. The man in front seemed weak, but as a newcomer, it was better to be modest.<br/><br/>The man in yellow nodded and said, “There is indeed a place, but to refine your spirit here in Sword Heaven Marsh is extremely difficult. Only those with at least a Middle-grade Profound Origin Precious Spirit qualify for successful refinement. If you fail, it doesn’t necessarily mean your talent is poor, but failure will pose a risk for your next attempt at refinement. Please consider this carefully. ”<br/><br/>A threshold too?<br/><br/>Looking down on lower-grade spirit treasures?<br/><br/>Fang Wang complained in his mind but kept a polite smile on his face as he said, “I’ve come fully prepared, please lead the way.”<br/><br/>“Come with me then.”<br/><br/>The man in yellow landed and walked along the lakeside, with Fang Wang following close behind.<br/><br/>“Over the years, there’ve been those who came for the Swordsmanship, some for the Sword of the Sword Saint, but you are the first to come for Spirit Molding. It’s usually safer to join one of the Nine Great Sects if you wish to undergo Spirit Molding. Could it be that you’ve heard the legend of Fang Wang from Great Abyss Gate and want to test whether you can awaken a high-tier Lifespirit Treasure?” The man in yellow walked ahead, speaking as he went.<br/><br/>Fang Wang responded, “I don’t belong to any of the Nine Great Sects. I received guidance from a wise man who said there’s an opportunity for Spiritual<br/><br/>Refinement here.”<br/><br/>The man in yellow did not turn back, but chuckled lightly and said, “There is indeed an opportunity. If the Lifespirit Treasure you mold pleases the Sword Saint, he will bestow upon you a great opportunity.”<br/><br/>Fang Wang found himself curious about the man’s relationship with the Sword Saint as he kept mentioning him.<br/><br/>“Like those people on the lake, I am a Sword Cultivator who admires the Sword Saint’s prestige. Unfortunately, the Sword Saint no longer accepts disciples. We can only serve as Sword Servants, which is an immense honor for us Sword Cultivators as it allows us to comprehend the Sword Dao alongside him,” said the man in yellow, his voice finally showing a hint of emotion.<br/><br/>“But don’t get your hopes up too high. I’ve heard the Sword Saint mention that even Earth Origin Precious Spirits may not catch his eye. Right now, he’s only anticipating the arrival of Fang Wang from Great Abyss Gate,” the man in yellow remarked with a sigh.<br/><br/>“I can’t even imagine what kind of genius that Fang Wang must be, possessing a Heaven Yuan Precious Spirit.. Incredible, absolutely incredible!”\t\t\t\t\t\t</div>", "images": {}, "success": true}