{"id": 78, "url": "https://www.novelhall.com/i-became-an-immortal-on-mortal-realm-32879/14276965.html", "title": "Chapter 78 - Chapter 78: Chapter 75 The Great Demon King Attacks [Fourth Update, Seeking Monthly Pass]_L", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 78 - Chapter 78: Chapter 75 The Great Demon King Attacks [Fourth Update, Seeking Monthly Pass]_L</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 78: Chapter 75 The Great Demon King Attacks [Fourth Update, Seeking Monthly Pass]_l<br/><br/>Translator: 549690339<br/><br/>“Leave? Yang Yuanzi, that old fool, said the same thing to me! Why should I leave?”<br/><br/>Lu Yuanjun said gravely, his eyes filled with an unstoppable killing intent at the mention of Yang Yuanzi.<br/><br/>Zhao Zhen sighed and said, “See, even the sect stands on Fang Wang’s side. You and I can only hide. Although it is stifling, there is nothing we can do. These are the consequences of our choices. At least you have cultivated a Ghost Instrument, and I have at least set foot on the path of Cultivation. What harm is there in retreating now?”<br/><br/>“Having been the Emperor for many years, I understand one thing well. When your power doesn’t match up to your opponent’s, you can only bear it silently, even take a step back. What matters is who has the last laugh.”<br/><br/>As he talked about it, his heart was filled with mixed feelings.<br/><br/>He had guessed that Fang Wang was the Heaven Yuan Spirit Treasure, but he did not expect it to be true, and Fang Wang’s displayed strength was enough to sweep through the Profound Heart Realm. This meant that Fang Wang had realized his potential, and Lu Yuanjun could no longer scheme against him.<br/><br/>Moreover, there was a sliver of relief in his heart. Fang Wang had become so powerful without killing him. Did this mean Fang Wang really didn’t know?<br/><br/>If so, why should he provoke Fang Wang?<br/><br/>“No! Absolutely not! Why should I give way? Is the Heaven Yuan Spirit Treasure definitely stronger than me? I have a supreme treasure. Maybe I can take him down! If I devour his soul, his talents will only serve me!”<br/><br/>Lu Yuanjun growled hysterically. His usual gentle and sunny demeanor was gone, replaced by a face filled with resentment, hatred, and greed.<br/><br/>Zhao Zhen frowned, noticing that his state was off.<br/><br/>Suddenly, Lu Yuanjun turned to him with a cold sneer and said, “If it weren’t for your scheming, how would I have been exposed so soon? Now that Great Abyss Gate won’t tolerate me, well then, follow me in overthrowing Great<br/><br/>Abyss Gate!”<br/><br/>Zhao Zhen stood up and said sternly, “Have you gone mad? The world is at peace now, the Nine Great Sects have ceased hostilities and made peace. How can you alone overthrow Great Abyss Gate?”<br/><br/>Threads of black Ghost Qi emanated from Lu Yuanjun’s body, as a terrifying figure took shape behind him. With a fierce smile, he said, “You think you know me? I called you here today to end your presumptuous life. You are nothing but a dog that received my pity. You dare to scheme against me and even advise me to run away? Ridiculous!”<br/><br/>Zhao Zhen’s face drastically changed, and he abruptly turned to flee. But as soon as he turned around, he found himself unable to move. Ghost Qi, like tentacles, wrapped around his limbs and waist, immobilizing him.<br/><br/>“You dog under the name of Emperor, do you know why my supreme treasure absorbs souls? I want you to watch as I overthrow Great Abyss Gate and execute Fang Wang. I will make you beyond redemption and watch as I pursue immortality! ”<br/><br/>Lu Yuanjun’s voice rang in Zhao Zhen’s ear. Zhao Zhen’s eyes widened; he could feel Lu Yuanjun’s breath.<br/><br/>He glanced over and found, to his despair, that Lu Yuanjun was standing right behind him.<br/><br/>At noon, the weather was cool.<br/><br/>Fang Wang sat at the edge of a lake on a large rock, fishing. He called out boredly, “Brother Gu, stop cultivating for a moment and come have a chat with me!”<br/><br/>Upon hearing this, Gu Tianxiong, who stood on the lake’s surface with veins popping on his forehead, bellowed with eyes closed and with irritation, “For heaven’s sake, once you’re done with your Spiritual Refinement, get lost and stop disturbing my sword practice!”<br/><br/>This situation had been ongoing for a month, and Gu Tianxiong deeply regretted having greeted him a month ago. He should have just let the kid wander aimlessly.<br/><br/>Fang Wang yawned and said, “There’s always time for sword practice, but you can’t cultivate all the time. You’ve got to have some fun—that’s what a friend told me, though I’ve forgotten who.”<br/><br/>Gu Tianxiong clenched his fists and cursed silently, this kid is provoking me.<br/><br/>Little did he know, Fang Wang had genuinely forgotten.<br/><br/>Fang Wang continued fishing while contemplating inwardly.<br/><br/>Whoever said that profound maxim was right; he had indeed nearly gone mad cultivating in the Heavenly Palace for four hundred years. This month, having completely refrained from cultivation and traveling through the Sword Heaven Marsh, his state of mind had improved significantly.<br/><br/>Two words described it, exhilarating!<br/><br/>However, such a state wouldn’t last too long. In three days, he would have to resume Cultivation.<br/><br/>Cultivation is the foundation of a Cultivator; one may take a break, but one should never give up practising.<br/><br/>Just then, a strong wind came from the east, dispersing the dense fog over the lake and catching the attention of several Sword Cultivators who turned to look. They saw a group of Cultivators flying from the horizon. They weren’t on Flying Swords but were flying directly through the air, their clothing elegant and grand, their demeanor extraordinary, clearly not ordinary people.<br/><br/>Eighteen individuals in total, both men and women. Among them, four carried a palanquin, piquing curiosity about the identity of the person inside.<br/><br/>“Tsk, a bunch of Spirit Elixir Realm Cultivators, yet carrying a palanquin for someone. Whose Disciple has such grandeur?”<br/><br/>Fang Wang thought to himself. Xiao Zi suddenly emerged from the water, burrowed into his arms, and then poked her head out and whispered, “Master, there’s Demonic Qi, very fearsome Demonic Qi. It’s likely from the Great<br/><br/>Demon King.”<br/><br/>The Great Demon King?<br/><br/>An existence comparable to the Condensation Spirit Realm?<br/><br/>Fang Wang narrowed his eyes and stared at the palanquin.<br/><br/>The group quickly flew to the other side of the lake, where four individuals gently set down the palanquin. Fang Wang’s exceptional vision pierced across the vast lake surface, revealing a demonically enchanting male figure in black emerging from the palanquin.<br/><br/>The demonically enchanting male seemed to sense Fang Wang’s gaze and turned his attention back. Fang Wang quickly withdrew his own gaze, not wanting to court trouble.<br/><br/>Gu Tianxiong walked up to Fang Wang and muttered, “Kid, be careful. Keep your distance from that guy over there, something feels off.”<br/><br/>Fang Wang replied, “It’s definitely off, but it’s you who needs to be careful. Don’t always try to be the hero.”<br/><br/>Just this month, Gu Tianxiong had been involved in several disputes with other Sword Cultivators, always taking up for others.<br/><br/>Every few days, Sword Cultivators seeking the Sword Saint’s legacy would arrive. With the increase in number came a mix of characters, inevitably leading to conflicts. Gu Tianxiong, disliking those who oppressed others with their realm, often intervened.<br/><br/>Fang Wang suspected that the Gu Family’s demise was due to Gu Tianxiong causing trouble.<br/><br/>Now that he thought about it, it had been less than six years since the Gu Family was destroyed.<br/><br/>Zhou Xue didn’t specify an exact time.<br/><br/>Gu Tianxiong snorted and continued, “I suspect they are from the demon race. There are a great many demons in the south of Da Qi, especially those from beyond the sea. They are countless in number, and often demon kings take form and come ashore, searching for opportunities of cultivation. The Sword Saint came from abroad, so perhaps those demons did too.”<br/><br/>Fang Wang noticed that the strange demon-like man and his eighteen followers were walking along the lakeside.<br/><br/>He wasn’t worried about these demons troubling the Sword Saint.<br/><br/>That day, when he shook the Sword Saint’s Sword Array with the Qiankun Fan, he knew just how terrifying the Sword Saint was, definitely not someone the demon-like man could compare with.<br/><br/>Although the demon-like man gave Fang Wang a dangerous feeling, it wasn’t to the extent that he was dreadfully afraid, at least nowhere near the impression the Sword Saint had left on him.<br/><br/>Thus, Fang Wang casually chatted with Gu Tianxiong.<br/><br/>The other sword cultivators on the lake were also discussing the mysterious newcomers.<br/><br/>By evening of that day, the mysterious group returned to the lakeside opposite Fang Wang, each sat down to meditate, without interacting with the other sword cultivators.<br/><br/>Three days later.<br/><br/>Fang Wang went back to the wooden bridge where he was in the Soul Sculpting Realm to cultivate, with the attic door still closed. He could feel Fang Hanyu’s presence, indicating the inheritance process was still ongoing.<br/><br/>After starting his cultivation, time began to pass more quickly for Fang Wang.<br/><br/>Days went by.<br/><br/>And thus, a month passed.<br/><br/>“Come in.”<br/><br/>The voice of the Sword Saint reached Fang Wang’s ears, using the Sound Transmission Technique. Surprisingly, the voice was incredibly weary.<br/><br/>He immediately got up and went over. Xiao Zi had been staying in his embrace, very afraid of the demon-like man who was suspected to be a Great Demon King.<br/><br/>Entering the main hall of the attic, Fang Wang closed the door behind him.<br/><br/>He saw Fang Hanyu lying flat on the ground, a painful expression on his face, with mysterious energy pulsing around him.<br/><br/>“Don’t worry, he has successfully inherited my Sword Qi, and is now in the process of Spiritual Refinement. He should succeed in at most two days,” the Sword Saint said in a low voice as he sat in meditation. At that moment, he appeared much older, his back was bent, and his body was considerably thinner.<br/><br/>Fang Wang took a step forward and asked with concern, “Senior, are you alright?”<br/><br/>The Sword Saint looked up at him, and said somberly, “The departure of my Sword Qi and Sword Intent from my body has also depleted my spirit. I have at most seven days left to live.”<br/><br/>Upon hearing this, Fang Wang’s expression changed and he asked with a frown, “Senior, is there any way to prolong your life?”<br/><br/>“Prolong my life? Hehe… My time is up; there’s no cure for it. That you care is enough. What I am about to give you is the real reason I set up the Spiritual<br/><br/>Refinement scheme here.”<br/><br/>As the Sword Saint spoke, he tremulously raised his right hand and a red jade flew out from his sleeve towards Fang Wang.<br/><br/>Fang Wang subconsciously caught the jade and noticed three characters engraved on it.<br/><br/>Sword Sovereign of the Yellow Glyph!<br/><br/>Holding the jade, he felt the powerful Spiritual Power and prohibitions contained within, making him extra cautious.<br/><br/>“I have finally found my heir. With this order, you will be the Sword Sovereign of the Yellow Glyph. Once you surpass the Condensation Spirit Realm, you can take this order to the sea beyond. It will guide you to your destination, where there are opportunities of cultivation unseen in Da Qi. I was not talented enough and attained this opportunity far too late, but you are different…”<br/><br/>The Sword Saint spoke weakly, suddenly bursting into laughter, “Hahaha, Heaven Yuan Spirit Treasure… Chanter, in the end, I still won… My heir will surely be stronger than you, and might even aspire to the position among the twenty-four True People…”<br/><br/>Because he laughed too hard, he couldn’t help but cough.<br/><br/>Fang Wang listened, feeling as though he had been saddled with an issue.<br/><br/>Was this the surprise that Zhou Xue had mentioned?<br/><br/>An opportunity of cultivation from beyond the sea?<br/><br/>And he had to surpass the Condensation Spirit Realm to seek it?<br/><br/>Once the Sword Saint’s coughing fit subsided, Fang Wang then asked, “Senior, what is the origin of this order?”<br/><br/>“Senior? Call me master, ” the Sword Saint said softly, looking at Fang Wang with a hopeful gaze.<br/><br/>Seeing this, Fang Wang immediately knelt on one knee and said with a fist in palm, “Master, thank you for bestowing the dual inheritance upon us!”<br/><br/>The Sword Saint showed a smile, saying, “Good! Very good! I, the Sword Saint, finally have a successor!”<br/><br/>“Good disciple, there’s no need to ask further about this matter. Once you’ve surpassed the Condensation Spirit Realm, and you probe this order with your consciousness, you will know everything. But there’s trouble ahead; a Great Demon King from beyond the sea is pursuing this Yellow Glyph Sword Sovereign Order,” the Sword Saint said, his smile vanishing as his expression turned serious.<br/><br/>Fang Wang narrowed his eyes and asked, “Is that Great Demon King your sworn enemy?”<br/><br/>The Sword Saint took a deep breath, “I know your cultivation is not low, at least beyond the Soul Sculpting Realm, which means you are a Twin Spirit Treasure. However, you cannot confront him. A Great Demon King is equivalent to the Condensation Spirit Realm and is not someone you can provoke right now. When Yu Han wakes up, take him and leave.”<br/><br/>Yu Han, the alias of Fang Hanyu..\t\t\t\t\t\t</div>", "images": {}, "success": true}