{"id": 73, "url": "https://www.novelhall.com/i-became-an-immortal-on-mortal-realm-32879/14275614.html", "title": "Chapter 73 - Chapter 73: Chapter 70 The Great Perfection Of The Sword", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 73 - Chapter 73: Chapter 70 The Great Perfection Of The Sword</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 73: Chapter 70 The Great Perfection of the Sword<br/><br/>Array, Sword Heaven Marsh [6th Update, Request for Monthly Pass]_l<br/><br/>Translator: 549690339<br/><br/>“Then Senior Brother, please go ahead.”<br/><br/>Fang Wang hurriedly made way, and Lu Yuanjun smiled and nodded as they brushed past each other.<br/><br/>As the two headed in opposite directions, Fang Wang leapt up and transformed into a white rainbow, flying toward the Third Peak. His expression cooled, and his smile was no more.<br/><br/>Walking towards the gate of Shiyuan Hall, Lu Yuanjun similarly lost his smile, his face growing extremely grim.<br/><br/>What each was thinking, only they themselves knew.<br/><br/>The Sect’s Main City was still bustling with noise. Although the confrontation between Fang Wang and the thirteen geniuses was brief, its sensational impact was long-lasting.<br/><br/>Fang Wang moved quickly, soon arriving at the Third Peak. He landed in front of his cave dwelling, and Xiao Zi, following, popped her head out from his arms, asking, “Master, do you have a grudge against that man?”<br/><br/>As Fang Wang took out his disciple token to open the mountain gate, he replied, “Indeed, there is a grudge.”<br/><br/>As the mountain gate opened, he walked into his cave dwelling.<br/><br/>Xiao Zi slipped out from his arms, closed the mountain gate smoothly, then followed Fang Wang and asked, “Master, if you have trouble dealing with him, let me do it. Just one bite from me, and he’ll wish he were dead.”<br/><br/>“There’s no need. Killing him isn’t difficult, but the relationships behind him are complicated. Let’s wait a few more years. He’s probably suffering greatly already,” Fang Wang answered.<br/><br/>His observational skills were exceptionally sharp, and he clearly felt that during this encounter, Lu Yuanjun was very nervous, only pretending to be calm.<br/><br/>Perhaps Lu Yuanjun was still praying that Fang Wang wouldn’t find out the truth.<br/><br/>Fang Wang sat down in front of the white jade bed and took out the jade slip of the Nine Heavens Azure Thunder Sword Formation, falling into hesitation.<br/><br/>To learn it now, or not?<br/><br/>It could well consume two hundred years of his life.<br/><br/>But if he didn’t study it now, when would he?<br/><br/>Having recently made a big splash, Fang Wang might not face many people daring to trouble him in the future, but those who dared would certainly be existences above the fifth level of the Profound Heart Realm.<br/><br/>Never mind!<br/><br/>Just study it!<br/><br/>Fang Wang clenched his teeth, deciding to be tough on himself, and immediately began to probe the jade slip with his divine consciousness.<br/><br/>Seeing him begin cultivation, Xiao Zi no longer disturbed him and went to the edge of the pond. Looking at her reflection in the water, she began to fantasize that it was a dragon head.<br/><br/>After a little less than half an hour,<br/><br/>Fang Wang’s gaze suddenly became vacant, and his consciousness entered directly into the Heavenly Palace.<br/><br/>Standing inside the grand hall of the Heavenly Palace, Fang Wang worked hard to calm his mind.<br/><br/>In the process of reading the Nine Heavens Azure Thunder Sword Formation, he had learned that it was even more abstruse than the Jinghong Divine Sword Art, meaning it would take a long time for him to cultivate it.<br/><br/>“Practice it then. I want to see just how strong the Sword Formation that can sweep through the Da Qi Cultivation Realm is!”<br/><br/>Fang Wang muttered to himself, encouraging himself.<br/><br/>With a thought, numerous Flying Swords appeared out of thin air around him. The Nine Heavens Azure Thunder Sword Formation required swords to form the Sword Array, and to achieve Great Perfection, seventy-two array swords were needed—the higher the quality of the swords, the greater their power.<br/><br/>He had thought that having mastered the Jinghong Divine Sword Art and<br/><br/>Divine Nurturing Sword Qi, cultivating the Nine Heavens Azure Thunder Sword Formation would not be too difficult, but even just getting started was nearly driving him to despair.<br/><br/>It took a full forty years for him to barely enter the threshold. This Sword Formation required the refinement of one’s divine consciousness and an understanding of the lightning attribute of Spiritual Energy, extremely profound indeed.<br/><br/>Condensing Sword Intent with Azure Thunder to form the Nine Heavens Sword Domain, he would vanquish all powerful foes!<br/><br/>After entering the threshold, Fang Wang no longer found it tedious and his interest in the Nine Heavens Azure Thunder Sword Formation grew immensely.<br/><br/>He felt that the Nine Heavens Azure Thunder Sword Formation possessed might not inferior to the Nine Dragons Divine Transformation Art. To put it precisely, they were two different types of spells; the Nine Dragons Divine Transformation Art was suited for destruction and breaking through encirclements, while the Nine Heavens Azure Thunder Sword Formation was suitable for mass killing. Azure Thunder was naturally the bane of certain special demons, evil spirits, and cultivation techniques.<br/><br/>Years passed in the Heavenly Palace.<br/><br/>By the time Fang Wang had cultivated the Nine Heavens Azure Thunder Sword Formation to Great Perfection, he looked back and saw that a total of three hundred and forty-two years had passed.<br/><br/>If seventy-two people were to cultivate the Nine Heavens Azure Thunder<br/><br/>Sword Formation, it would be even more effective. However, cultivating this Sword Formation required a high perception of lightning attributes and a profound understanding of the Sword Dao. Great Abyss Gate, at least, could not gather the seventy-two qualified people.<br/><br/>Fang Wang’s consciousness returned to reality, his eyes becoming clear again.<br/><br/>At that moment, he was still in the posture of holding the jade slip in his hand.<br/><br/>He tossed the jade slip into his storage bag and stood up, saying, “Xiao Zi, prepare to go down the mountain!”<br/><br/>Xiao Zi, who was in the midst of her cultivation, opened her serpent eyes in surprise and asked, “So soon? Master, you’ve just been through a great battle, don’t you need to rest? And what about the Nine Heavens Azure Thunder Sword Formation, won’t you study it further?”<br/><br/>“Are you coming or not? If not, I’m leaving!”<br/><br/>Fang Wang donned the two storage bags on the table, then picked up the Qingjun Sword and headed towards the mountain gate.<br/><br/>Xiao Zi hurriedly followed him, afraid of being left behind.<br/><br/>“Master, why do you suddenly want to go down the mountain?” “I’m feeling restless.”<br/><br/>“Restless? How so? Do you need me to help you release it?”<br/><br/>“What do you understand, and how could you help me release it? Let me vent on you?”<br/><br/>“Ah? It’s not impossible, as long as the young master is pleased…”<br/><br/>Inside Shiyuan Hall, Guang Qiuxian sat cross-legged on a meditation cushion, his complexion dreadfully unsightly, while Yang Yuanzi stood by, his face full of rage.<br/><br/>“Foolish! So foolish! I told you long ago to stop indulging him. Look at him, just like his father, his heart is not that of a human!”<br/><br/>Yang Yuanzi’s voice was harsh, his teeth clenched as he struggled to suppress his anger.<br/><br/>Glaring at him, Guang Qiuxian retorted, “I indulged him? When he was seven, I listened to you and let Chen Anshi take him to travel the world until he was twenty. Do you know how much hardship he suffered during those years?<br/><br/>Perhaps those experiences are exactly what twisted his heart!”<br/><br/>Yang Yuanzi said fiercely, “I don’t care. Fang Wang is my disciple and the hope of Great Abyss Gate. No matter what, I won’t allow Lu Yuanjun to threaten him. Since Lu Yuanjun has erred, then punish him. We must compensate Fang Wang. I suggest we make Fang Wang the head disciple of Great Abyss Gate! He has the qualifications!”<br/><br/>Guang Qiuxian furrowed his brow and sighed, “Certainly, Lu Yuanjun must be punished, or else it would be unfair to the souls who died in vain. But can we keep this secret forever? Should we communicate with Fang Wang beforehand to resolve this issue?”<br/><br/>“How can one resolve a feud of annihilation?”<br/><br/>“Then what should we do? A hundred years from now, Fang Wang is bound to become the most powerful in the Da Qi Cultivation Realm. By then, will you and I still be able to control him?”<br/><br/>“Why should we control him? My disciple is magnanimous and kindhearted, never bullying the weak. As for the grudge between him and Lu Yuanjun, the best solution is to make Lu Yuanjun disappear, send him away!”<br/><br/>Yang Yuanzi spoke in an irrefutable tone, pausing before he added seriously, “Brother, we can’t indulge him any longer. We owe his mother, but that was to her, not to him. A scourge like him, it’s enough that he simply lives!”<br/><br/>Guang Qiuxian remained silent.<br/><br/>At that moment, a disciple’s voice came from outside the gate of Shiyuan Hall, “Reporting to the Sect Leader, Fang Wang is not in his cave dwelling. I’ve investigated and found that his disciple token has left Great Abyss Gate; he must have descended the mountain.”<br/><br/>Hearing this, the expressions of Guang Qiuxian and Yang Yuanzi changed instantly.<br/><br/>“Alright, go back to your cultivation.”<br/><br/>Guang Qiuxian replied, and the disciple outside immediately took leave.<br/><br/>Shiyuan Hall had special prohibitions that prevented eavesdropping, so the two men were not worried about their conversation being overheard.<br/><br/>Guang Qiuxian had a strange look on his face as he said, “It’s been only two hours since he obtained the Nine Heavens Azure Thunder Sword Formation. The geniuses from other sects haven’t left yet, but he’s already descended the mountain. Could it be that he fled with the exclusive techniques?”<br/><br/>Yang Yuanzi gave him a cold glance, saying irritably, “What are you suggesting, that you doubt he’s a spy from the Demonic path? Are you willing to use the Heaven Yuan Spirit Treasure as a mole? If he were really a spy, why would he not climb up to the position of Vice Sect Leader or even take your place? To flee over a technique that can’t be mastered, do you think it’s possible? Besides, the Fang Family isn’t just him in the Great Abyss Gate. I really don’t know why the master chose you as the Sect Leader!”<br/><br/>“I was just joking, what’s with the attack on me?” Guang Qiuxian was more than a little annoyed.<br/><br/>Humming, Yang Yuanzi said, “Call Lu Yuanjun here. I want to question him myself! ”<br/><br/>Guang Qiuxian hesitated for a moment but ultimately nodded in agreement.<br/><br/>Amidst the vast sea of clouds, a majestic black eagle plummeted down. On the horizon was the twilight, the setting sun casting a glow across the sky, while the mountains and rivers beneath gradually darkened, painting a desolate yet beautiful scenery.<br/><br/>“Young master, can you go any faster?”<br/><br/>Xiao Zi lay on the eagle’s head, curiously asking.<br/><br/>The black eagle promptly flew toward the ground, landing next to a large river amid the mountains. Upon touching down, it transformed back into a human figure: clad in white, wearing a bamboo hat, holding a treasured sword, he appeared like a travel-worn swordsman.<br/><br/>Xiao Zi was thrown to the ground by Fang Wang, who then sat down to meditate by the river.<br/><br/>Rushing over, Xiao Zi cooed, “Young master, where are we going? It’s been half a month since we left, and you’ve been flying all over the place. I’m worried you’re overdoing it.”<br/><br/>While gathering Qi, Fang Wang answered, “Soon, there’s no more than a couple hundred miles left.”<br/><br/>Half a month had passed since descending the mountain. To alleviate the frustration pent up from three hundred forty-two years in Heavenly Palace, he had taken the form of a black eagle, roaming the Da Qi Kingdom, passing through dozens of cities, and occasionally even saving commonfolk from bandits.<br/><br/>And now, he was less than two hundred miles away from the Spirit Molding Ground that Zhou Xue had recommended.<br/><br/>Seeing that he didn’t seem eager to talk, Xiao Zi had no choice but to let it be.<br/><br/>Fang Wang began to close his eyes and restore his spirits.<br/><br/>The sun gradually set.<br/><br/>When it was nearly dark, a sound of something breaking through the air startled Xiao Zi, who looked up.<br/><br/>A middle-aged man in blue brocade, strong and burly with a large sword on his back and a handsome face adorned with a beard, exuding a manly charm, was arriving on a flying sword.<br/><br/>He landed five yards from Fang Wang on the riverbank and cheerfully inquired,<br/><br/>“Young fellow, are you also heading to Sword Heaven Marsh?”<br/><br/>Fang Wang opened his eyes and glanced at him, responding with a question, “You are as well?”<br/><br/>Though he had not heard of Sword Heaven Marsh, the man’s cultivation was not low, and since he had landed nearby, he probably was heading to the same destination.<br/><br/>“Indeed, the Sword Saint has made a rare appearance, how could I miss it? It is said he’ll be waiting at Sword Heaven Marsh for those who are destined. I believe I may just be that person,” the middle-aged man chuckled, his demeanor somewhat frivolous, much like a carefree wanderer.<br/><br/>Then, the middle-aged man went on to say, “By the way, have you heard? Sword Saint’s direct disciple, Song Jinyuan, was defeated by Great Abyss Gate’s top talent Fang Wang, and it’s said that because of it, Song has given up swordsmanship. Tsk tsk, if the Sword Saint hears of this, I wonder what he’d think. ”<br/><br/>“But then again, Fang Wang is indeed formidable. With the Heaven Yuan Spirit Treasure, my goodness, legend has become reality. Young fellow, which sect are you from? Why not switch to Great Abyss Gate? Great Abyss Gate will certainly rise. My daughter is in Great Abyss Gate and has a very good relationship with Fang Wang..”\t\t\t\t\t\t</div>", "images": {}, "success": true}