{"id": 75, "url": "https://www.novelhall.com/i-became-an-immortal-on-mortal-realm-32879/14276217.html", "title": "Chapter 75 - Chapter 75: Chapter 72: The Third Lifespirit Treasure [Seeking Monthly Votes]_L", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 75 - Chapter 75: Chapter 72: The Third Lifespirit Treasure [Seeking Monthly Votes]_L</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 75: Chapter 72: The Third Lifespirit Treasure [Seeking Monthly Votes]_l<br/><br/>Translator: 549690339<br/><br/>The Sword Saint is looking forward to seeing me?<br/><br/>Fang Wang was secretly surprised. He hesitated whether he should reveal his true identity or not, but then he recalled Zhou Xue’s words. Zhou Xue had advised him to hide his surname and stay low profile; there must be a reason for it.<br/><br/>On the way that followed, the man in yellow wouldn’t stop talking. At first, Fang Wang thought the man was intentionally giving him pointers, but later he realized the man was just grumbling.<br/><br/>After the time it takes to burn a stick of incense had passed.<br/><br/>Under the guidance of the man in yellow. Fang Wang arrived at a pavilion by.<br/><br/>the lakeside. The lake in front of the pavilion was dense with lotuses, mist enshrouded the area, intermittently revealing and hiding itself, adding to the aura of a mystical realm.<br/><br/>“This lake area has a natural Heavenly Dao Spiritual Vein buried deep underground, drawn to the surface by the Sword Saint using a Sword Array. You can conduct your Spiritual Refinement here, stay as long as you like.” Having said that, the man in yellow turned and left.<br/><br/>Fang Wang bowed with his hands clasped and then stepped onto the wooden platform by the lakeside. The platform in front of the pavilion was simple, with a broken bridge directly in front of it, resembling a sword thrust into the lotus-filled lake area.<br/><br/>Fang Wang didn’t enter the pavilion but walked onto the wooden bridge to admire the beautiful scenery before him.<br/><br/>The fog was thick, the scene ethereal and stunning. It couldn’t obscure the majestic posture of the mountains on the opposite bank. The lotus blossoms swayed slightly in the breeze, and occasionally, redfish would jump out of the water as though trying to break free from fate and leap up to become dragons.<br/><br/>Xiao Zi wormed out of Fang Wang’s embrace and climbed towards the pavilion behind them. Fang Wang didn’t stop Xiao Zi but sat down to meditate on the spot.<br/><br/>He had already used his divine sense to investigate the pavilion behind him; no one was there, nor were there any mice or bugs. There wasn’t a soul for miles around, and he was far away from the Sword Saint’s Sword Servants. Here it was quiet and undisturbed.<br/><br/>Taking in the scenery of Sword Heaven Marsh, Fang Wang suddenly found himself liking this place. There were no rules, no conflicts—it indeed was an ideal spot for cultivation. Perhaps this was why so many Sword Cultivators were willing to serve as Sword Servants.<br/><br/>Half an hour later, Fang Wang closed his eyes and began his practice.<br/><br/>To undertake Spiritual Refinement, he first had to sense the Heavenly Dao Spiritual Vein beneath the lake.<br/><br/>As he closed his eyes, day turned to night and the days passed, with the thick fog on the lake swirling quickly and the clouds in the sky churning dramatically. It was as if the world had pressed the fast-forward button.<br/><br/>In the blink of an eye.<br/><br/>A month had passed in a flash.<br/><br/>That afternoon, Xiao Zi lay on a lotus basking in the sun when it suddenly sensed something and looked up sharply, seeing spiritual energy from nature swirling towards Fang Wang, forming a visible whirlwind around him. “Is he really going to conduct Spiritual Refinement?”<br/><br/>Xiao Zi was secretly astonished, as it had thought Fang Wang was just fooling Gu Tianxiong, especially since Fang Wang already possessed two Lifespirit Treasures.<br/><br/>It hadn’t expected…<br/><br/>Three Lifespirit Treasures…<br/><br/>Xiao Zi recalled a legend it had seen in the Great Saint’s Grotto -Heaven, and hope shone in its eyes.<br/><br/>After a month, Fang Wang had finally sensed the Heavenly Dao Spiritual Vein. His Treasured Spirit Space began to tremble; he had finally found the feeling for Spiritual Refinement.<br/><br/>He was about to conduct Spiritual Refinement now!<br/><br/>Threads of Solaris True Fire exuded from his body, twirling around his form, rushing towards his crown and converging there.<br/><br/>Meanwhile.<br/><br/>Tens of miles away by another lakeside, Gu Tianxiong and several Sword Cultivators followed a young boy along a corridor; among them was unmistakably Fang Hanyu.<br/><br/>Fang Hanyu, blindfolded, walked at the very end of the group.<br/><br/>Gu Tianxiong, as jovial as ever, chatted cheerfully with the accompanying Sword Cultivators.<br/><br/>Fang Hanyu, however, was quietly admiring the lake scenery beside him, not saying a word.<br/><br/>As they rounded a corner of the corridor, a woman’s voice came from ahead: “Song Jinyuan, it’s time to come out and practice your sword. How long will you indulge in self-pity? Although the Sword Saint hasn’t said anything, his refusal to summon you is a clear sign of his displeasure.”<br/><br/>Gu Tianxiong and his companions fell silent and turned to look. They saw a simply dressed woman with long hair tied into a ponytail and two swords at her waist, exuding a spirited energy. She stood in front of a house, her brows tightly knit.<br/><br/>Seeing Gu Tianxiong and the others approach, she stepped forward to make way.<br/><br/>The boy nodded slightly at her and then brushed past.<br/><br/>The group walked past the front of the house, and before they were far away, a mocking voice came from inside: “Practice the sword? What’s the use? Sword Dao insight, Sword Dao’s heart—compared to the grade of a Lifespirit Treasure, they are nothing. The heavens have already set the rules for us…”<br/><br/>Song Jinyuan!<br/><br/>The Sword Saint’s direct disciple!<br/><br/>Hearing his words, the group said nothing and carried on their way.<br/><br/>After walking a hundred steps, one of the Sword Cultivators finally sighed and said, “When Song Jinyuan returned to Da Qi with the Sword Saint, he flaunted his might by sweeping through the disciples of the Nine Great Sects of the same realm with the sword in his hands—how dashing he was back then, but now he’s ended up like this… Alas!”<br/><br/>Another Sword Cultivator added, “It can’t be helped, the Heaven Yuan Spirit Treasure. Lu Yuanjun, with just a medium-grade Earth Origin Spirit Treasure, has made a name for himself in the Da Qi Cultivation Realm, and can even battle across different levels of cultivation. By comparison, you can’t even imagine how strong a Heaven Yuan Spirit Treasure is.”<br/><br/>The other Sword Cultivators also sighed, the Heaven Yuan Spirit Treasure had become well-known throughout the Da Qi Cultivation Realm. In the last two years, the name Fang Wang had become so prominent that cultivators felt as if his name was thunder echoing in their ears.<br/><br/>Fang Hanyu walked behind, now accustomed to the attention. Particularly in the last month, the deed of Fang Wang defeating thirteen top-notch contemporary talents with a single move had stirred up a lot of excitement. The once-famous deeds of those geniuses were dug up once again; the more one understood the power and legends of those talents, the more incredible Fang Wang’s accomplishment seemed.<br/><br/>Moreover, the Nine Dragons Divine Transformation Art became widely discussed. Ten years ago, the Ji Hao Sect’s secret realm appeared, and various sects fought tooth and nail over the Nine Dragons Divine Transformation Art and the Heavenly Gang Sheng Ti Zhen Gong, culminating in a joint excavation of the Great Saint’s Grotto-Heaven. It turned out that the Nine Dragons Divine Transformation Art had already been obtained by someone, and it was the unparalleled genius with the Heaven Yuan Spirit Treasure. Some openly stated that it was a Divine Skill choosing its inheritor.<br/><br/>Though cultivators challenge the heavens in their pursuit of immortality, the longer they practice, the more they believe in fate.<br/><br/>“What is destined to be yours will come, and what is not, cannot be forced.”<br/><br/>Upon hearing the legends about Fang Wang, Fang Hanyu felt no pride, but an infinite fighting spirit surged within him, driving him to strive tirelessly to catch up to Fang Wang and fight alongside him.<br/><br/>Gu Tianxiong resumed boasting about how close his daughter was with Fang Wang, although, of course, the other sword cultivators didn’t believe a word of it.<br/><br/>After walking for a while, the boy finally stopped in front of a room’s door and turned to bow respectfully to it.<br/><br/>“Sword Saint, these people have passed the first round of tests,”<br/><br/>the boy said softly. It was said that the Sword Servants of Sword Heaven Marsh would directly address him by his title, as the Sword Saint himself had instructed.<br/><br/>Clang—<br/><br/>Suddenly, the door flung open and a strong wind howled out, causing the boy’s robes to flap crazily behind him, prompting the sword cultivators to bow in greeting, astonished.<br/><br/>Bent over, Gu Tianxiong raised his eyes to see a figure in white stepping out of the room, surrounded by numerous faint sword shadows. With every step he took, an afterimage was left behind, as if his soul were separating from his body, causing Gu Tianxiong’s eyes to widen in amazement.<br/><br/>The Sword Saint!<br/><br/>His white hair was coiled under a white jade crown, his face was rosy and full of vitality, his spirit abundant, and especially his eyes, which shone brightly, as if there were two little people practicing swordsmanship within his pupils, with sword light spilling out in all directions.<br/><br/>“Take them to the Sword Nurturing Pond to undergo the baptism, ” the Sword Saint left these words behind and turned into a gust of wind, disappearing into the mist above the lake in the blink of an eye. The sword cultivators turned their heads, only to see the lingering afterimages of the Sword Saint on the lake’s surface, shaped by his Sword Qi.<br/><br/>“Is this the Sword Saint? I wonder what realm he has achieved,” Fang Hanyu thought to himself, startled.<br/><br/>Even within the Great Abyss Gate, he had never encountered such an eminent figure before.<br/><br/>Not even the Sect Leader, Guang Qiuxian, he felt, could match up to the Sword Saint.<br/><br/>“Ladies and gentlemen, please follow me, ”<br/><br/>the boy spoke, then resumed walking forward. The sword cultivators followed reluctantly, their regret palpable; they had not expected to be unable to meet the Sword Saint directly just yet.<br/><br/>On the wooden bridge above the lake, Fang Wang was meditating, his body suspended in the air, as he feared igniting the bridge, so he had levitated himself.<br/><br/>Mastering the Combat Heart allowed him to turn his body into a magic artifact and ascend with the Sword Control Technique, a feat quite effortless for him.<br/><br/>Balls of churning Solaris True Fire converged above his head, forming a fiery sphere. Waves of heat occasionally spilled out, shaking the pavilions and dispersing the mist over the lake.<br/><br/>Xiao Zi watched Fang Wang intently, her eyes filled with anticipation.<br/><br/>It had not noticed the figure approaching from the end of the lake behind it. Out of the dense fog, a figure was slowly making its way toward them—it was the Sword Saint.<br/><br/>The Sword Saint arrived walking on the waves, with no Sword Qi visible around him, blending with nature as one, his gaze fixed on Fang Wang, his white eyebrows furrowed deeply.<br/><br/>“This fire seems familiar…” he thought to himself silently, contemplating for a few moments before his pupils dilated in realization.<br/><br/>“Could it be the Solaris True Fire? No, that can’t be right, with his level of cultivation, he couldn’t possibly have been to such forbidden places…”<br/><br/>The Sword Saint’s gaze remained intensely focused on Fang Wang, observing the treasure above his head with a look of expectancy.<br/><br/>At this moment, Fang Wang’s consciousness was inspecting the Treasured Spirit Space within him.<br/><br/>The third Lifespirit Treasure was taking shape!<br/><br/>Fang Wang had long contemplated the third Lifespirit Treasure. He didn’t want to create another long or short weapon; he wished to forge an auxiliary type Lifespirit Treasure instead.<br/><br/>Preferably, it would be a Lifespirit Treasure with sealing powers, and Fang Wang had been gravitating towards the concept of seals in his plans.<br/><br/>However, to his disappointment, he failed—perhaps due to his insufficient understanding of sealing arts. Creating a Lifespirit Treasure relied on imagination, but it also had to be based on one’s own knowledge; one cannot conjure a power completely unencountered before, and the Soul-Binding Curse was not a pure sealing technique.<br/><br/>Since, for the time being, he couldn’t craft a sealing-type treasure, he had to choose a different path.<br/><br/>Reluctantly, he decided to bring his concept for the fourth Lifespirit Treasure forward.<br/><br/>He wanted to create a folding fan!<br/><br/>A fan that possessed a terrifying force of wind, akin to the Banana Leaf Fan from ‘Journey to the West,’ though it was of course impossible for him to create such a fan at the moment.<br/><br/>This force of wind would not only target physical objects but souls as well. He wanted the fan to have the power to obliterate ghosts and capture souls!<br/><br/>The reason for this idea was to prepare for Lu Yuanjun, as well as Green Cicada Valley—to use the fan to drive away poisonous fogs, effortlessly crushing decay.<br/><br/>The Solaris True Fire already had the ability to suppress souls, so his idea was feasible.<br/><br/>Gradually, the fiery sphere above him began to morph, slowly solidifying into a folding fan.<br/><br/>The nature’s spiritual energy rushed crazily towards the sphere above his head, forming a fierce wind that blew from all directions, the commotion immense.<br/><br/>Rolling thunderclouds approached from the horizon, billowing towards Sword Heaven Marsh, steadily darkening the skies around them..\t\t\t\t\t\t</div>", "images": {}, "success": true}