{"id": 76, "url": "https://www.novelhall.com/i-became-an-immortal-on-mortal-realm-32879/14276218.html", "title": "Chapter 76 - Chapter 76: Chapter 73: The Qjankun Fan, Sword Saint’S Legacy [Seeking Monthly Votes]_L", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 76 - Chapter 76: Chapter 73: The Qjankun Fan, Sword Saint’S Legacy [Seeking Monthly Votes]_L</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 76: Chapter 73: The Qjankun Fan, Sword Saint’s Legacy [Seeking Monthly Votes]_l<br/><br/>Translator: 549690339<br/><br/>Looking at the Lifespirit Treasure hovering above Fang Wang’s head, a shade of disappointment flickered in Sword Saint’s eyes.<br/><br/>It’s not a sword, what a pity!<br/><br/>But remembering his own impending demise, Sword Saint’s gaze dimmed again; he had no other choice.<br/><br/>He stood on the surface of the lake, silently watching Fang Wang.<br/><br/>As the Lifespirit Treasure became more tangible, the momentum it emitted grew stronger, drawing clouds overhead to rapidly transform into thunderclouds, with thunder rumbling incessantly.<br/><br/>In the distance, the sword cultivators who were comprehending the Sword Dao on the surface of the lake all looked up, confusion evident on their faces.<br/><br/>Xiao Zi looked up and saw the changes in the sky pattern, a worried expression in its serpent eyes, afraid that the commotion would be too great and attract trouble.<br/><br/>Just then, it felt an unimaginable pressure coming from behind; turning its head, its serpent eyes widened.<br/><br/>It saw Sword Saint raise his right hand; behind him, amidst the dense mist, a series of sword shadows rose, and as far as the eye could see, the lake area was surrounded by countless sword shadows, forming a sword array. The sword shadows burst forth with Sword Qi, creating a Sword Qi light screen, isolating this region.<br/><br/>“There’s no need to worry, I am merely setting up the formation for him,”<br/><br/>came the voice of Sword Saint, and upon hearing this, Xiao Zi immediately heaved a sigh of relief.<br/><br/>Wait a second!<br/><br/>Is he talking to me?<br/><br/>Xiao Zi, startled, tensed up all over and grew even more wary of Sword Saint.<br/><br/>Fang Wang heard Sword Saint’s words, and his heart also settled. If the other party had bad intentions, there would be no need to wait any longer.<br/><br/>At the same time, the sword servants and sword cultivators in the distance, seeing the soaring sword array, all came to a realization—it was Sword Saint’s doing.<br/><br/>The expanse of Sword Heaven Marsh was vast, but when Sword Saint’s sword array rose, it was like a giant sword energy mountain, its presence no less magnificent than the surrounding peaks, and even more awe-inspiring.<br/><br/>Such Sword Qi was enough to make all the sword cultivators who witnessed this scene become obsessed.<br/><br/>With Sword Saint securing the formation, Fang Wang’s subsequent Spiritual Refinement process naturally went smoothly.<br/><br/>As time passed, the folding fan above his head gradually solidified. It was a black fan with flame patterns on the blades, capable of storing Solaris True Fire, designed to counter Ghost Instruments.<br/><br/>Nature’s spiritual energy surged tumultuously, lightning flashing above, yet delayed in striking down, as if the heavens were expressing dissatisfaction.<br/><br/>Sword Saint looked at Fang Wang’s treasure and uttered two words: “Earth Origin! ”<br/><br/>He himself was an Earth Origin Spirit Treasure, so he was well aware of the characteristics of the Earth Origin grade, but he noticed that this treasure was still absorbing nature’s spiritual energy, indicating its grade had not yet reached its limit.<br/><br/>This did not surprise Sword Saint; he had set up the formation so only a treasure surpassing that of Mysterious Origin could be refined. Fang Wang’s ability to provoke sky patterns showed he was no ordinary Earth Origin—a trap set by Sword Saint. For his own disciples, he had even deliberately lowered the threshold, fearing he might scare away the predestined ones.<br/><br/>Expectation began to arise in Sword Saint’s heart.<br/><br/>He hoped this young man could refine a grade surpassing that of Earth Origin Spirit Treasures.<br/><br/>Just like Fang Wang of the Great Abyss Gate!<br/><br/>Thinking of Fang Wang made Sword Saint sigh; what a pity such a talent had already joined the Great Abyss Gate, a sect that would certainly not let him go.<br/><br/>With a sect, there were ties that made him unsuitable for Sword Saint’s criteria for selection.<br/><br/>Suddenly!<br/><br/>Sword Saint’s expression changed subtly; he felt his own treasure quivering, a brilliant light flashing in his eyes.<br/><br/>Could it really be…<br/><br/>Fang Wang immersed himself wholeheartedly in the Spiritual Refinement, forgetting all external matters.<br/><br/>Time passed, unknown how long.<br/><br/>Fang Wang suddenly opened his eyes, stood up, and the Solaris True Fire above his head dispersed, carrying fiery waves fanning out in all directions, shaking the sword array.<br/><br/>Standing, he reached above his head and grasped the fan handle; a black folding fan with fiery flame patterns appeared in his hand.<br/><br/>Looking intently, he saw Sword Saint’s sword array; his mind stirred, and suddenly he swung the black folding fan towards the distant Sword Qi screen.<br/><br/>Boom—<br/><br/>With a single wave of his hand, the surface of the lake exploded, the terrifying wave and surge of water visible to the naked eye lifting up nearly thirty feet high and smashing against the sword array’s light screen, causing the entire sword formation to tremble.<br/><br/>Sword Saint raised an eyebrow, his gaze sharpening. With a flick of his fingers towards the lake, in an instant, the originally trembling sword array steadied, as solid as Mount Tai, until the massive wave dissipated.<br/><br/>Fang Wang let out a breath of foul air, inwardly lamenting the missed opportunity.<br/><br/>Turning toward Sword Saint, he bowed respectfully and said, “The younger generation, Zhou Yu, thanks the senior Sword Saint for setting up the formation. I was just overwhelmed with emotion and couldn’t help but try my hand; I hope the senior will forgive me.”<br/><br/>If he had managed to break through the sword formation with one strike, it wouldn’t matter; the other party wouldn’t dare say much.<br/><br/>Since he failed, he could only be polite.<br/><br/>Of course, he truly meant no offense; he simply wanted to test the strength of his third Lifespirit Treasure.<br/><br/>“It’s of no matter; being fortunate enough to witness the birth of a Heaven Yuan is truly my honor. I never expected this land to produce two Heaven Yuan in the same era. It seems that person did not deceive me. This place can indeed fulfill my wish. It’s just a pity that your treasure is not a sword; otherwise, I would want to give you all of my inheritance,”<br/><br/>Sword Saint said, stroking his beard, filled with emotion. Fang Wang, upon hearing this, grew even more curious about what Sword Saint wanted to give him.<br/><br/>He was tempted to take out the Rainbow Sword, but he couldn’t act rashly; what if Sword Saint desired to seize his body?<br/><br/>To be honest, he wasn’t particularly interested in Sword Saint’s inheritance; he already had plenty of supreme arts for combat and didn’t want to spend centuries confined in Heavenly Palace.<br/><br/>Struck by an idea, Fang Wang spoke up: “Senior, I managed to refine this treasure thanks to you. Why not let you name it, what do you say?”<br/><br/>Sword Saint, upon hearing this, hesitated for a moment, but recalling his limited time left, smiled and pondered: “Its power is like fire, its movement like thunder; with a flick, it can move heaven and earth. Let’s call it the Qiankun Fan.”<br/><br/>Qiankun Fan?<br/><br/>Fang Wang felt the name suited well and hurriedly thanked Sword Saint.<br/><br/>The Sword Saint waved his sleeve, dissolving the Sword Array. The screen of Sword Qi shattered, the sky full of Sword Qi fading away like thick fog, a magnificent sight to behold.<br/><br/>Afterward, the Sword Saint walked towards Fang Wang.<br/><br/>Xiao Zi immediately came to Fang Wang’s side, climbed up his leg, and nestled into his embrace.<br/><br/>The Sword Saint landed on the wooden bridge, walked past Fang Wang, and dropped a line, “Continue your cultivation, in one year, I have something for you.”<br/><br/>Fang Wang watched him enter the loft behind, then close the door.<br/><br/>One year?<br/><br/>He wouldn’t be up to any tricks, would he?<br/><br/>On second thought, given the power of the Sword Array just now, Fang Wang was certainly no match for the Sword Saint. If the Sword Saint wanted to hurt him, why would he wait another year?<br/><br/>Even if there were special reasons to wait a year, why not suppress him directly just to be on the safe side?<br/><br/>After much deliberation, Fang Wang decided to wait for a year, and it would be an excellent opportunity to cultivate in this place.<br/><br/>The scenery here is nice, well-suited for cultivation.<br/><br/>Fang Wang turned around, fiddling with the Qiankun Fan in his hand, the more he looked at it, the more he liked it.<br/><br/>A lonely shadow on the cold river, clothed in white, holding a black fan, approached with the wind. The lotus flowers beneath the bridge were toppled and disordered, revealing a kind of disarrayed beauty, the scene as splendid as a painting.<br/><br/>After shaping the Qiankun Fan, Fang Wang’s strength surged. Afterward, he did not wander around but meditated on the wooden bridge.<br/><br/>The Profound Heart Realm was not enough!<br/><br/>He must reach the Condensation Spirit Realm as soon as possible. Firstly, to have the confidence to face all the crises of the Da Qi Cultivation Realm, and secondly, to gain the inheritance of the Heavenly Gang Sheng Ti Zhen Gong. Hmm, to this day, he still coveted the Heavenly Gang Sheng Ti Zhen Gong.<br/><br/>In the blink of an eye.<br/><br/>Half a year passed.<br/><br/>It took a full half-year for Fang Wang to break through to the second layer of the Profound Heart Realm, a pace he felt was slow. However, considering that many people spend their entire lives stuck at the first layer of the Profound Heart Realm, he came to terms with it.<br/><br/>After the breakthrough, he continued to sit at the head of the bridge and meditate, eyes open, gazing at the surface of the lake.<br/><br/>During this half-year, he was constantly cultivating, and the Sword Saint did not come out again after entering the loft beyond. Unable to sense the aura inside the loft, Fang Wang could not determine if the Sword Saint was still there, and it wouldn’t be right to rashly disturb him.<br/><br/>In recent days, Fang Wang found the changes over the lake surface intriguing. He always felt there was a special purpose behind the Sword Saint arranging for him to cultivate here. The mist over the lake changed daily, and for some reason, whenever the mist surged, he seemed to glimpse a silhouette practicing swordsmanship. Yet whenever he thought of this, and looked back to the mist on the lake, he could no longer see the figure.<br/><br/>“Why are you here?”<br/><br/>A familiar voice came, Fang Wang glanced over, and saw Fang Hanyu approaching on his sword, his face showing surprise.<br/><br/>Fang Wang breathed a sigh of relief, thankful that the young man did not directly call out his real name.<br/><br/>This was Fang Hanyu, with his meticulous mind. As soon as he saw Fang Wang, he knew Fang Wang had changed his name. After all, there was much talk about him within Sword Heaven Marsh, especially since Song Jinyuan was still in a state of decline.<br/><br/>Fang Wang waved at him, and he immediately flew over, landing beside Fang Wang.<br/><br/>“Cultivating here, what about you?” Fang Wang asked with a smile.<br/><br/>Fang Hanyu answered, “I came for the Sword Saint’s inheritance, of course.<br/><br/>Unfortunately, I’ve been here for over half a year and only saw his grace once. Why don’t you try as well? You would definitely succeed. In terms of talent for the Sword Dao, I think no one can compare to you.”<br/><br/>The Jinghong Divine Sword Art with its thirty-six techniques, who in this era could match such mastery?<br/><br/>Clang!<br/><br/>A sound came from behind, followed by a gust of wind. Fang Wang and the other turned their heads to see the Sword Saint standing behind them.<br/><br/>The Sword Saint’s eyes were piercing as he stared at Fang Wang, “Zhou Yu, are you also a Sword Cultivator?” zhou Yu?<br/><br/>Isn’t that a name from the Romance of the Three Kingdoms?<br/><br/>Fang Hanyu was secretly surprised. Fang Wang had always enjoyed telling him stories from the Romance of the Three Kingdoms as a child. It was only when he grew up that he realized there was no such thing as the Three Kingdoms in the world—the romance of Shu Han and the integrity of Cao Wei were clearly fabrications by Fang Wang.<br/><br/>What surprised him wasn’t Fang Wang’s change of name but why he chose a name from the Eastern Wu faction. Didn’t Fang Wang dislike Eastern Wu?<br/><br/>Why not take the name of Zhuge Liang, whom he admired?<br/><br/>Right, from now on, I shall also use names from the Three Kingdoms to wander the world of martial arts, and even form a secret signal with Fang Wang.<br/><br/>Faced with the Sword Saint’s intense gaze, Fang Wang stiffened and said,<br/><br/>“Hmm, I have some knowledge, but I’m not purely a Sword Cultivator.”<br/><br/>The Sword Saint narrowed his eyes and said, “Compete with me using your strongest Sword Art. If it satisfies me, I will also bestow my legacy upon you.” Fang Wang’s frowned.<br/><br/>If he were to use the Jinghong Divine Sword Art or the Nine Heavens Azure Thunder Sword Formation, it would be easy to expose his identity. A Tai Yuan Sect Disciple who has shaped a Heaven Yuan Spirit Treasure…<br/><br/>“If you perform well, my legacy will not only be for you, but for him too, ” the Sword Saint spoke again, glancing at Fang Hanyu with his gaze.<br/><br/>Fang Hanyu did not feel excited but fell silent instead.<br/><br/>He wasn’t sure what Fang Wang was hesitating about, but he feared creating trouble for him.<br/><br/>Before landing, he had scanned the loft with his divine sense, clearly finding it empty…<br/><br/>Which meant that this man was the Sword Saint!<br/><br/>Apart from the Sword Saint, who else could be so unfathomably profound? But…. why was Fang Wang reluctant to accept the Sword Saint’s legacy?\t\t\t\t\t\t</div>", "images": {}, "success": true}