{"id": 79, "url": "https://www.novelhall.com/i-became-an-immortal-on-mortal-realm-32879/14278312.html", "title": "Chapter 79 - Chapter 79: Chapter 76: Sword Intent Emerges, Heaven And Earth Fall Silent 1", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 79 - Chapter 79: Chapter 76: Sword Intent Emerges, Heaven And Earth Fall Silent 1</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 79: Chapter 76: Sword Intent Emerges, Heaven and Earth Fall Silent 1<br/><br/>Translator: 549690339<br/><br/>“Equivalent to which level of the Condensation Spirit Realm?” Fang Wang asked, his voice tinged with a hint of anticipation.<br/><br/>He had been holding back for too long and wanted to let loose!<br/><br/>Conveniently, the opponent was his new master’s enemy, so there was no guilt in killing him!<br/><br/>Sword Saint frowned, “It’s about the fourth or fifth level of the Condensation Spirit Realm, disciple, one must not act recklessly. Although you have mastered the Celestial Sword Intent, it is precisely because your aptitude and understanding are so incredible that you need to be all the more careful. As long as you live, the heights you will achieve in the future are beyond what you can imagine now.”<br/><br/>By the end of his words, he couldn’t help coughing again due to the excitement.<br/><br/>Fang Wang could only give up, saying, “Okay, Master, I’ll listen to you. Don’t rush.”<br/><br/>The Sword Saint was now nearly at the end of his life force, so Fang Wang didn’t want to go against him.<br/><br/>“The Great Demon King has been intimidated by me and dares not act rashly for a short period. Come back in two days and take Yu Han away with you… I want to rest.”<br/><br/>Having said that, the Sword Saint slowly closed his eyes. His spine was hunched, and his whole figure seemed to curl up, showing all the vicissitudes and desolation.<br/><br/>Fang Wang stored the Sword Monarch Order in his storage bag, then bowed to the Sword Saint and turned to leave.<br/><br/>After leaving the loft, he closed the door behind him.<br/><br/>Just as he descended the steps, he suddenly saw a figure standing on the lake, startlingly the eerie man in black, with his clothes fluttering in the breeze, his long hair doing the same, even in broad daylight, he looked terrifying.<br/><br/>The eerie man stared at Fang Wang with an expressionless face.<br/><br/>Unafraid, Fang Wang boldly continued forward, sat down on the bridge’s edge, and faced the eerie man.<br/><br/>Fang Wang took out the Qiankun Fan, waved it gently, and then admired the scenery of the lake without practicing his cultivation.<br/><br/>Xiao Zi, seemingly sensing Fang Wang’s attitude, wriggled out from his embrace and twined around his shoulder, with its snake head facing the eerie man, constantly flicking its tongue.<br/><br/>Seeing Fang Wang acting so confidently, the eerie man furrowed his brows.<br/><br/>After watching for a while, the eerie man silently backed away and disappeared into the thick fog.<br/><br/>“Master, you’re really powerful now. You even managed to scare away the Great Demon King,” Xiao Zi said in an admiring tone.<br/><br/>Fang Wang replied calmly, “He’s not afraid of me, he’s afraid of my master.”<br/><br/>The time spent cultivating the Celestial Sword Intent proved how powerful the<br/><br/>Sword Saint’s Sword Dao was, second only to the True Combat Technique,<br/><br/>suggesting that in terms of Sword Dao alone, the Sword Saint was comparable to the Great Saint’s mastery over the Dao.<br/><br/>Of course, Fang Wang didn’t understand the Great Saint, but such a comparison was enough to earn his respect for the Sword Saint.<br/><br/>Without a doubt, the Sword Saint was the strongest person he had encountered in his lifetime.<br/><br/>The Da Qi Cultivation Realm, ruled by the Nine Great Sects, was home to many powerful cultivators, and the world beyond was vast and boundless. The thought alone made Fang Wang’s heart surge with excitement.<br/><br/>What would the view be like from the pinnacle of humanity?<br/><br/>As Fang Wang pondered this, he also felt the Universal Sword Intent of Sword Heaven Marsh.<br/><br/>Since he had attained Great Perfection in the Celestial Sword Intent, his world had changed drastically. Everything had its own will, and he could even harness the Celestial Sword Intent that could be used in everything, even the rocks by the lake.<br/><br/>Xiao Zi lay on his shoulder, vaguely sensing something, and likewise settled down to concentrate.<br/><br/>Two days quickly passed.<br/><br/>Approaching noon.<br/><br/>Fang Wang suddenly felt something, stood up, and turned to look at the loft behind him.<br/><br/>Xiao Zi, lying on his shoulder, also opened its eyes and muttered, “Such strong<br/><br/>Sword Qi…”<br/><br/>Fang Wang smiled. With the Sword Saint’s Sword Qi, Fang Hanyu had not only obtained a higher quality Lifespirit Treasure, but his cultivation must have soared dramatically, undergoing a true transformation.<br/><br/>Just the Sword Qi displayed now, although far from that of the Sword Saint’s, seemed capable enough to handle the lower levels of the Profound Heart Realm cultivators.<br/><br/>Fang Wang felt relieved thinking that with Fang Hanyu growing stronger, the Fang Family had more protection. He was busy cultivating daily, and Zhou Xue had her own matters to attend to, so it was necessary for someone to guard the Fang Family.<br/><br/>Boom!<br/><br/>The Sword Qi inside the loft suddenly surged, blasting open the eaves, and a figure soared into the sky, a pillar of Sword Qi reaching for the heavens.<br/><br/>Fang Wang looked closely and saw Fang Hanyu’s figure suspended in the column of Sword Qi, a hundred meters up in the air, with a sword floating above his head. It was an extremely ordinary looking sword, not particularly refined, yet the earth -shattering Sword Qi was emanating from this sword.<br/><br/>The surrounding mountains of Sword Heaven Marsh trembled, and waves surged on the lake, showing how terrifying the Sword Qi of the Sword Saint was.<br/><br/>The cloth covering Fang Hanyu’s face had gone with the wind, his blue eyes with blood-colored pupils were open, looking like a demon possessed, and he radiated an ineffable aura of slaughter.<br/><br/>Fang Wang raised his eyebrows slightly. It seemed that Green Cicada Valley’s past torment on Fang Hanyu had had a significant impact, still lingering to this day, and that murderousness had etched into his bones.<br/><br/>At the same time, powerful presences hurried from all directions. The eerie man and his subordinates arrived first, followed by the Sword Saint’s Sword Servants, and even Gu Tianxiong approached across the water.<br/><br/>In Sword Heaven Marsh, there were at least five to six hundred sword cultivators present, with the weakest being in the Spiritual Refinement Realm, and there were twenty to thirty in the Profound Heart Realm, all renowned cultivators.<br/><br/>More and more cultivators arrived, all looking up at Fang Hanyu with diverse expressions, yet none acted rashly.<br/><br/>“Who is that person?”<br/><br/>“What powerful Sword Qi, what kind of treasure is that?”<br/><br/>“No, isn’t that the Sword Saint’s Sword Qi?”<br/><br/>“Why does he have the Sword Saint’s Sword Qi?”<br/><br/>“Could it be that he received the Sword Saint’s inheritance? I remember him, he participated in the inheritance challenge before…”<br/><br/>The cultivators discussed fervently, and when someone speculated that Fang Hanyu had received the Sword Saint’s inheritance, the cultivators suddenly became anxious, looking at Fang Hanyu with malice in their eyes.<br/><br/>At this moment, Fang Hanyu hovered in the air. Although his eyes were open, he was clearly not fully awake yet, and nature’s spiritual energy gathered between him and the sword.<br/><br/>Gu Tianxiong approached Fang Wang curiously and asked, “Brother, what’s going on?”<br/><br/>As Fang Wang was about to answer, an exclamation rang out, and from the sound of it, there was clearly a sense of grinding teeth.<br/><br/>“Fang Wang!”<br/><br/>The name Fang Wang seemed to possess some kind of magic, as all cultivators subconsciously looked towards the speaker. They saw Song Jinyuan standing by the lake, gritting his teeth as he glared at Fang Wang.<br/><br/>Following Song Jinyuan’s gaze, everyone turned to look at Fang Wang again.<br/><br/>Gu Tianxiong frowned and bellowed, “I am definitely not Fang Wang!”<br/><br/>As soon as the words left his mouth, something occurred to him. He violently twisted his head to look at Fang Wang, his eyes widening in surprise. Fang Wang sighed. It seemed he could no longer keep his identity a secret.<br/><br/>If he couldn’t hide it, then so be it!<br/><br/>A true man should act openly and honorably. He had been too weak before, but now he feared nothing!<br/><br/>Fang Wang nodded towards Song Jinyuan to show courtesy, then turned his gaze back to Fang Hanyu in the sky.<br/><br/>Fang Hanyu slowly raised his right hand and grasped the hilt of the sword above his head.<br/><br/>“That might be the Sword Saint’s divine sword—he must not be allowed to get it!” someone exclaimed, instantly drawing everyone’s attention back to Fang Hanyu.<br/><br/>Immediately, several individuals soared into the sky, swords in hand, charging towards Fang Hanyu.<br/><br/>With one taking the lead, more followed until, at a glance, there were no fewer than fifty cultivators.<br/><br/>Boom!<br/><br/>A domineering and unparalleled aura suddenly erupted, shattering the wooden bridge under Fang Wang’s feet. Gu Tianxiong, startled, stumbled and almost fell into the lake.<br/><br/>The cultivators advancing forward all stopped in their tracks, looking at the swords in their hands and under their feet with expressions of shock and disbelief.<br/><br/>Then they all turned their heads to look at Fang Wang, even the strange demonic man on the lake’s surface frowned at Fang Wang.<br/><br/>Around Fang Wang swirled a terrifying sword intent, causing even the space around him to shimmer. His Sword Intent enveloped Sword Heaven Marsh in an instant. Although no Sword Qi could be seen, everyone could feel it pressing in from all sides, threatening to pulverize their bodies with the slightest movement. The sensation sent shivers down their spines.<br/><br/>“Celestial Sword Intent!” the demonic man enunciated, staring at Fang Wang.<br/><br/>Fang Wang kept his gaze on Fang Hanyu and spoke slowly, “Nobody act rashly. He’s my brother. Whoever dares to harm him, dies.”<br/><br/>Enhanced by the Sword Intent of all things, his voice echoed over Sword Heaven Marsh, unceasingly stunning everyone present.<br/><br/>What kind of Sword Intent was this?<br/><br/>Aside from the demonic man, including the Sword Servants, no one had truly experienced the Sword Saint’s Sword Intent, so they were all filled with fear. One man’s Sword Intent subdued hundreds of sword cultivators!<br/><br/>With the release of Sword Intent, heaven and earth went silent!<br/><br/>Within the pavilion,<br/><br/>The Sword Saint slowly lifted his head, his cloudy eyes revealing a trace of a smile as he murmured, “Great Completion of Celestial Sword Intent… no, he has surpassed me… Dual Destiny Heavenly Origin… unimaginable comprehension of the Sword Dao. To think that there are indeed people destined by heaven… I am indeed fortunate…”<br/><br/>His words came in fits and starts, and finally, his head dropped sharply, hands falling naturally to his sides.<br/><br/>Gu Tianxiong stared blankly at Fang Wang, feeling as if he were in a dream.<br/><br/>His little brother Zhou Yu turned out to be the famous Fang Wang?<br/><br/>The prodigy so often mentioned in his daughter’s letters?<br/><br/>Sensing his gaze, Fang Wang turned to look at him, smiling slightly, “Don’t worry, Big Brother Gu, if you don’t make a move, I won’t kill you.”<br/><br/>Despite the absence of killing intent, already quite mild, it still made Gu Tianxiong’s skin crawl and fear rise in his heart.<br/><br/>“Heh heh, who would have thought the Sword Saint had a successor,” the demonic man’s cold voice came through.<br/><br/>The man stepped towards Fang Wang, black Demonic Qi spreading, churning violently as it resisted Fang Wang’s Celestial Sword Intent.<br/><br/>As his Demonic Qi burst forth, most of the sword cultivators felt a stirring of emotion.<br/><br/>Such a terrifying Demonic Qi!<br/><br/>This guy must be a demon!<br/><br/>Song Jinyuan paid no attention to the demonic man; his gaze was fixed on<br/><br/>Fang Wang in a daze.<br/><br/>At that moment, his mind was blank.<br/><br/>The figure of Fang Wang began to overlap with that of his master in Song Jinyuan’s eyes.<br/><br/>“Why… how could he have learned…” Song Jinyuan thought despairingly. He couldn’t even muster jealousy because the gap was just too wide.<br/><br/>Fang Wang turned to face the demonic man approaching from across the lake. Behind the man, those eighteen individuals also emitted Demonic Qi, their faces transforming into frightful demonic visages.<br/><br/>Strange Demonic Qi quickly spread like black fog over the entire lake, dispersing the mist formed by Spiritual Energy.<br/><br/>Fang Wang held the Qiankun Fan in his right hand, gently waving it with the poise of Zhou Yu complete with his feather fan and silk kerchief. Facing the Great Demon King, he was entirely composed, even showing an expectant look in his eyes.<br/><br/>“My Lord, annihilate him!” Xiao Zi called out from Fang Wang’s shoulder, unable to restrain herself. Her delicate voice startled Gu Tianxiong into waking, and he looked at Xiao Zi in astonishment.<br/><br/>She was actually a female demon!<br/><br/>Gu Tianxiong thought about his words to Fang Wang and his face turned beet<br/><br/>red..\t\t\t\t\t\t</div>", "images": {}, "success": true}