{"id": 70, "url": "https://www.novelhall.com/i-became-an-immortal-on-mortal-realm-32879/14273991.html", "title": "Chapter 70 - Chapter 70: Chapter 67: A Gathering Of Geniuses, An Unrivaled Arrival (Third Update) _1", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 70 - Chapter 70: Chapter 67: A Gathering Of Geniuses, An Unrivaled Arrival (Third Update) _1</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 70: Chapter 67: A Gathering of Geniuses, An Unrivaled Arrival (Third Update) _1<br/><br/>Translator: 549690339<br/><br/>Facing Guang Qiuxian’s inquiry, Fang Wang feigned a bitter smile and said, “Sect Leader, I came precisely because of this matter. You, I, and my master would never spread such news. Who could have leaked it? Surely it wasn’t Zhou Xing Shi?”<br/><br/>Upon hearing this, Guang Qiuxian’s smile froze, and his face turned gloomy as he said, “There is indeed something fishy about this. I’ve sent people to investigate. They say it was a third-vein disciple who leaked it. That disciple was captured by a demonic cultivator who demanded information about Great Abyss Gate, so he revealed the grade of your spirit treasure. He was convinced that your growth rate could not possibly be from a Mysterious Origin Treasure Spirit; perhaps it was indeed an accidental slip. That disciple is now dead, leaving no one to corroborate the story. The key issue is that this matter has drawn the divinations of Tian Shu Sect’s Fu Xuanji.”<br/><br/>“That old immortal, divining the heavens, is indeed very skilled at it. As soon as he opened his mouth, the matter was settled as firmly as a nailed coffin. Now, every sect has sent people over, and those geniuses are all eager to exchange views with you.”<br/><br/>As he said this, Guang Qiuxian sighed.<br/><br/>Fang Wang, seeing his demeanor, believed him to be genuine. It matched what Zhou Xue had told him, which suggested that Lu Yuanjun had not yet informed Guang Qiuxian about the Fang Residence incident.<br/><br/>Moreover, once it was revealed, the matter of the ghost instrument could no longer be concealed. Guang Qiuxian had an excellent reputation; even if he were to protect Lu Yuanjun to the death, he would not foster an evil trend.<br/><br/>Fang Wang decided not to test Guang Qiuxian. What he wanted now was to improve his standing in Guang Qiuxian’s eyes and within the Great Abyss Gate. When the day came for him to confront Lu Yuanjun and Zhao Zhen and have a decisive break, both Great Abyss Gate and Guang Qiuxian would have no choice but to stand with him.<br/><br/>After all, that day would not be far off.<br/><br/>Up to this day, Fang Wang’s hatred for Lu Yuanjun and Zhao Zhen was no longer as urgent as it had been. After all, he had been in Heavenly Palace for so many years, and even the deepest enmity would subside. Of course, once he was strong enough, he would still effortlessly crush these two to prevent any future threats to his family.<br/><br/>“Let’s talk business. The matter of the Heaven Yuan Spirit Treasure has spread widely. Our Great Abyss Gate cannot deny it any longer. Since last year, there have been geniuses visiting the Great Abyss Gate, wishing to spar with you. They are still staying at the Great Abyss Gate. Some came of their own volition, while others were sent by their sects to test your strength. How about you take them on?”<br/><br/>Guang Qiuxian asked in a probing tone, feeling guilty in his heart. He felt he had failed to protect Fang Wang. If Fang Wang did not want to come forward, he would grit his teeth and refuse.<br/><br/>“I will follow the Sect Leader’s orders,” Fang Wang responded without hesitation, agreeing to the matter.<br/><br/>To bring glory to the sect, wouldn’t that elevate his status within the sect? Of course, this could also attract envy, but every decision has its pros and cons, and as long as the benefits outweighed the disadvantages, it was acceptable.<br/><br/>Besides, after holding back for so many years, he was looking forward to venting his frustrations.<br/><br/>A smile appeared on Guang Qiuxian’s face as he said, “There are thirteen geniuses, from six great sects and five great families, and there are also two loose cultivators. However, their masters are reclusive experts of the present age, who, while living apart from worldly affairs, have widespread fame, and even the Great Abyss Gate has to give them face.”<br/><br/>Fang Wang pondered for a moment before responding, “Then, Sect Leader, choose a date. The sooner, the better. Let them all come together.”<br/><br/>“All together?”<br/><br/>“Yes, let’s settle everything at once. Since they are all geniuses, surely their cultivation hasn’t reached the Condensation Spirit Realm, right?”<br/><br/>“How could that be? The Condensation Spirit Realm is the pinnacle of the Da Qi Cultivation Realm. Some of the Sect Leaders among the Nine Great Sects haven’t even reached the Condensation Spirit Realm.”<br/><br/>Guang Qiuxian shook his head and looked at Fang Wang. Suddenly, he felt absurd.<br/><br/>How was it that Fang Wang seemed calmer than him? He was acting more like a junior, not as composed as Fang Wang.<br/><br/>However, whether Fang Wang was composed or arrogant would have to be determined by the outcome of the combat challenges.<br/><br/>“Very well, if that is so, let’s set it for seven days from now. High noon, on the Sect’s Main City combat platform, we’ll determine who is superior. If you beat all of them, you’ll get an extra five hundred thousand sect contributions and access to the Vein Suppression Ultimate Arts; you can choose any legacy you wish. How does that sound?” Guang Qiuxian said, his eyes blazing as he stared at Fang Wang.<br/><br/>Fang Wang laughed and said, “Thank you, Sect Leader!”<br/><br/>Guang Qiuxian stroked his beard and laughed heartily, then after giving some advice, he allowed Fang Wang to leave.<br/><br/>Leaving the Main Meridian, Fang Wang did not return to the third vein but instead went to visit his other family members in the Great Abyss Gate.<br/><br/>The family members chosen by Zhou Xue had grown up with Fang Wang since they were children, and their relationship was already strong. Fang Wang worried that if he didn’t visit them, he might forget them.<br/><br/>Sunset followed by moonrise.<br/><br/>The next day brought with it a piece of news that spread like wildfire within the Great Abyss Gate!<br/><br/>Fang Wang, who had been in closed-door cultivation for ten years, had emerged and was ready to accept challenges from the geniuses of other sects and great families!<br/><br/>All nine veins were abuzz. Ever since the matter of the Heaven Yuan Spirit Treasure had spread, the disciples of all veins were filled with curiosity, anticipation, and skepticism towards Fang Wang. Now that they heard Fang Wang was going to fight, how could they not be excited?<br/><br/>Dusk.<br/><br/>On the fifth vein’s mountain peak, within a cave abode.<br/><br/>Fang Wang was drinking with his cousin Fang Zigeng, engaging in a cheerful conversation mostly about the amusing incidents from their childhood at the Fang Residence.<br/><br/>Fang Zigeng had reached the second level of the Soul Sculpting Realm. Although he hadn’t risen to fame like Fang Hanyu, his cultivation progress was considered above average among the Fang Family Disciples.<br/><br/>He had an ordinary appearance, the kind that wouldn’t stand out in a crowd.<br/><br/>Usually low-key and without many connections, he was very happy to see Fang Wang, and his face was constantly alight with a smile.<br/><br/>Fang Hanyu had a high opinion of him, stating that he was the most diligent in cultivation among the Fang Family Disciples. Although he hadn’t ventured down the mountain for experience, he was either engaged in the sect’s tasks of harvesting and planting, or he stayed in his cave abode.<br/><br/>“Brother Fang Wang!”<br/><br/>A female voice came from outside the mountain gate, belonging to the youngest, Fang Xin.<br/><br/>Fang Zigeng immediately went to open the door. The cave dwelling for the Inner Sect Disciple was very small, and it only took him a few steps to reach the mountain gate.<br/><br/>Since Fang Wang had earlier gone to visit Fang Xin, she knew Fang Wang was in Fang Zigeng’s cave dwelling.<br/><br/>The now twenty-nine-year-old Fang Xin, no longer as childish as she once was but still lively, hurried to Fang Wang’s side and asked, “Brother Fang Wang, are you going to fight the geniuses? And you’re going to do it in a single day with back-to-back battles?”<br/><br/>Walking behind her, Fang Zigeng heard this and couldn’t help but be moved, his eyes revealing a look of worry.<br/><br/>Fang Wang swirled his wine cup and laughed, “Mm, they’ve been waiting for me for a long time, it’s only right to face them. I find it tiresome, better to finish it all in one day.”<br/><br/>“Don’t take it lightly, I’ve heard that the disciple of the Da Qi Sword Saint broke through to the Profound Heart Realm more than ten years ago,” Fang Zigeng sat down and cautioned.<br/><br/>Although he couldn’t comprehend the world of a genius like Fang Wang, he couldn’t help but want to offer a reminder.<br/><br/>Fang Wang smiled and said, “Don’t worry, I know my limits. Just wait and see me win.”<br/><br/>Fang Xin looked at Fang Wang with admiration and asked, “Brother Fang Wang, if you defeat those geniuses, will you become the top disciple of Great<br/><br/>Abyss Gate?”<br/><br/>Ever since Fang Wang’s Heaven Yuan Spirit Treasure was revealed, most disciples believed he would become the next top disciple.<br/><br/>In the Cultivation World, talent is revered, and such talent naturally deserves to be nurtured with the treatment of the top disciple.<br/><br/>Fang Wang shook his head, “It’s not that easy, but I can get one step closer.”<br/><br/>The three of them began to talk about the position of the top disciple. The position at Great Abyss Gate has always been vacant since the last top disciple died at the hands of a Demonic Cultivator from Chi Devil Sect. After that, Guang Qiuxian had not appointed a new one, and privately, disciples from all branches believed the position was being reserved for Lu Yuanjun.<br/><br/>As Fang Wang rose in power, the position of the Sect’s top disciple became a subject of great suspense. People enjoy watching a newcomer challenge the old number one talent, just as Lu Yuanjun had challenged Xu Lang back in the day. Now, many disciples are curious who the Sect Leader will ultimately choose.<br/><br/>With only six days left, Fang Wang still hadn’t returned to his cave dwelling, frequenting the residences of other Fang Family Disciples. Xiao Zi had already awakened long ago but stayed hidden in Fang Wang’s arms until the third day, when Fang Wang forcefully dragged it out to introduce it to his family members. Afterward, Xiao Zi opened up and often joined in the conversations between Fang Wang and his relatives.<br/><br/>By the seventh day, at dawn, the Sect’s Main City was already packed with people.<br/><br/>Disciples had crowded around the combat stage, eager to witness the elegance of the Heaven Yuan Spirit Treasure.<br/><br/>During the combat tournament known as Nine Veins Combat Method ten years ago, although Fang Wang’s performance was sensational, it was mostly quick victories, which didn’t showcase his full strength. Now with geniuses gathering, the disciples were eager to see the limits of Fang Wang’s power.<br/><br/>The Third Meridian Disciples took pride in Fang Wang; even before the combat began, they were spreading word of Fang Wang’s advantages everywhere. Some even claimed that the Fang Wang was White Garment Astonishing Swan, though that name had faded in the Cultivation World. Among the geniuses coming to challenge Fang Wang, halt had stronger records and bigger reputations than White Garment Astonishing Swan.<br/><br/>Cultivators who were guests of Great Abyss Gate also came, and the noise in the Sect’s Main City was deafening.<br/><br/>Rumors about Fang Wang and the competing geniuses circulated throughout the Main City.<br/><br/>When it came to the grade of their Lifespirit Treasures, all these geniuses possessed Top-Grade Mysterious Elemen tal Spirit Treasures, far beyond Fang Wang’s. But these geniuses were older than Lu Yuanjun, proficient in ultimate arts, and had fierce combat records. Putting aside the halo of ‘genius,’ they were already strong figures in Da Qi Cultivation Realm.<br/><br/>This battle, in the eyes of the Cultivators from all sides, was a contest between generations.<br/><br/>Lu Yuanjun’s rise with an Earth Origin Spirit Treasure had disrupted the patterns of the Da Qi Cultivation Realm. Now with a Heaven Yuan Spirit Treasure emerging, it’s impossible for the Eight Great Sects and various powerful families not to feel threatened. This probe was not just an internal affair of Great Abyss Gate, it was bound to spread throughout the Cultivation World.<br/><br/>Approaching noon, Guang Qiuxian arrived with the Peak Masters of the Nine Meridians and dozens of elders, including Zhao Chuanqian, Elder Zhang from the Task Hall, and Greedy Sleeper.<br/><br/>Vice Sect Leader Chen Anshi, however, did not come.<br/><br/>Eight elders dispersed around the combat stage to begin setting up formations.<br/><br/>Lu Yuanjun, Xu Lang, Ye Xiang, Yan Feiyue, Gu Li, and other geniuses had also arrived, standing together discussing the day’s battles.<br/><br/>Soon, Zhou Xue joined them.<br/><br/>Within Great Abyss Gate, there were circles among geniuses. Although Lu Yuanjun was approachable, the real gap in Treasure Spirit grades meant that those who did not have the requisite grade did not dare to intrude on their conversation.<br/><br/>Emperor of Da Qi, Zhao Zhen, arrived surrounded by a group of Third Meridian Disciples, and it was clear that he held prestige among them.<br/><br/>After some time passed, the geniuses who came to challenge Fang Wang started to arrive one after the other.<br/><br/>The arrival of each one incited discussions among the surrounding watching disciples, and tales of their exploits spread from mouth to mouth.<br/><br/>“That is Liu Jun from Suspended Vast Sword Sect, a genius second only to Xu Qiuming, who stepped into the Profound Heart Realm four years ago.”<br/><br/>“These unparalleled talents of our time truly carry themselves with extraordinary grace!”<br/><br/>“Unparalleled talents? A joke. What are they compared to the Heaven Yuan Spirit Treasure?”<br/><br/>“Sword Saint’s disciple Song Jinyuan, it’s said that his Sword Intent has reached a transformative realm.”<br/><br/>“Where is Brother Fang Wang, and when will he make his appearance? Facing thirteen formidable geniuses in succession, it’s hard to imagine how he will perform..”\t\t\t\t\t\t</div>", "images": {}, "success": true}