{"id": 77, "url": "https://www.novelhall.com/i-became-an-immortal-on-mortal-realm-32879/14276964.html", "title": "Chapter 77 - Chapter 77: Chapter 74 Celestial Sword Intent Great", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 77 - Chapter 77: Chapter 74 Celestial Sword Intent Great</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 77: Chapter 74 Celestial Sword Intent Great<br/><br/>Perfection [3rd Update, Request for Monthly Pass]_l<br/><br/>Translator: 549690339<br/><br/>“All right, since the elder has spoken thus, the younger can only show his lack of skill.”<br/><br/>Fang Wang bowed with his hands clasped, not for himself, but for Fang Hanyu, he had to steel his resolve and step forward.<br/><br/>At worst, he would just feel awkward for a few hundred years!<br/><br/>Upon hearing this, Sword Saint revealed a smile, and Fang Hanyu likewise felt that Fang Wang was acting for his sake; he could only grip his sword hilt tightly.<br/><br/>Fang Wang stood up, facing the lake. Xiao Zi emerged from the bottom of the lake and peeked at him.<br/><br/>As soon as Fang Wang’s gaze sharpened, a surge of Sword Qi shot out suddenly, piercing through the fog at the far end of the lake at high speed, followed by a thunderous roar from the distant mountains.<br/><br/>So fast!<br/><br/>Fang Hanyu was moved; his Absolute Heart Evil Eye barely kept up with the Sword Qi just now.<br/><br/>But what was most critical was how that Sword Qi was emitted?<br/><br/>He didn’t see any Spiritual Power flowing out from Fang Wang’s body; could it be that the Sword Qi really shot out from Fang Wang’s eyes?<br/><br/>Sword Saint squinted his eyes and uttered four words: “Divine Nurturing Sword Fang Wang blinked, and his eyes returned to normal, no longer as cold and harsh. He turned back to Sword Saint and asked, “This is my most skilled sword technique; does it satisfy you?”<br/><br/>“What is your relation to the Luo Bei Gu Family?”<br/><br/>“I have a good friend from the Gu Family who saw some potential in me, thus passing this sword technique on to me.”<br/><br/>Fang Wang answered truthfully; his Divine Nurturing Sword Qi had reached Great Perfection, nurtured for ten years, and its power was comparable to what most of the Gu Family members had nurtured for decades, even nearly a hundred years.<br/><br/>Sword Saint smiled slightly and turned around, saying, “Follow me.”<br/><br/>Fang Wang and Fang Hanyu exchanged glances and immediately followed.<br/><br/>Xiao Zi also hastily leaped out from the water and perched on Fang Wang’s shoulder.<br/><br/>They walked all the way into the pavilion, Sword Saint waved his sleeve, and the room door closed automatically.<br/><br/>Inside the great hall, Sword Saint sat cross-legged on a cushion and gestured for Fang Wang and the other to sit cross-legged in front of him.<br/><br/>“I began studying the sword under a master on the mountain at the age of six, descended the mountain to wander the world at seventeen, and by twenty, I was unmatched in all under heaven. However, when I was twenty-one, I<br/><br/>encountered a Sword Cultivator and was thoroughly defeated by him, only then did I understand what true Sword Dao is, the Sword Dao of the mortal world has only form, lacking intent.”<br/><br/>Sword Saint spoke slowly, his gaze becoming distant as he relayed his past.<br/><br/>Fang Wang felt an immediate resonance with these words.<br/><br/>Damn it, at sixteen, he also thought he was invincible, but before he could earn a prestigious reputation, cultivators descended from the sky, and he nearly broke his lance.<br/><br/>If Zhou Xue hadn’t been the reincarnation of an Immortal Venerable, he might already be approaching fourteen years old now.<br/><br/>“Since then, I have pursued the Path of Immortality. Fortunately, fate did not disappoint me, allowing me to create an Earth Origin Spirit Treasure. It took me three hundred years to traverse the Cultivation World. Afterwards, I went south to the seas, seeking a higher fate in immortality. Only upon that journey did I learn that there are mountains beyond mountains, heavens beyond heavens.”<br/><br/>As Sword Saint spoke, he sighed endlessly.<br/><br/>His gaze returned to Fang Wang and the other, saying, “The path of cultivation is long, and the Sword Dao is merely one of the three thousand Great Daos. Too many pursue a pure Sword Dao, solely because their hearts are filled with competition and feuds. The true Sword Dao should consider all things as one’s sword. In the year I turned five hundred, I forgot all the swordsmanship I ever learned and created a Sword Dao that truly belonged to me.”<br/><br/>“Celestial Sword Intent, which takes the intent of all things in heaven and earth as Sword Intent.”<br/><br/>“Now, you can make your choice. One of you will receive the Celestial Sword Intent, and the other will receive my lifetime’s accumulation of Sword Qi. I will condense this Sword Qi into your Lifespirit Treasure, making you possess multiple Lifespirit Treasures, and the grade would surpass my Lower Grade<br/><br/>Earth Origin Precious Spirit.”<br/><br/>Sword Saint spoke in a calm tone, as if it was a trivial matter.<br/><br/>Fang Hanyu couldn’t help but ask, “Can you pass them all to him? I don’t want the inheritance.”<br/><br/>Sword Saint glanced at him and asked, “Why?”<br/><br/>“I’m not worthy to accept it. Compared to him, my comprehension of the Sword Dao falls short by far more than a hundred thousand miles. I also do not wish to split his opportunity,” Fang Hanyu said earnestly.<br/><br/>Fang Wang couldn’t help but say, ‘You have the audacity to refuse when you’re being chosen? Don’t think too highly of yourself. If Sword Saint deigns to pass it to you, you should just be quietly overjoyed. You have no choice in this matter!”<br/><br/>Having said that, he looked at Sword Saint and said, “I choose the Celestial<br/><br/>Sword Intent.’<br/><br/>He already had three Lifespirit Treasures, so he didn’t need another. Moreover, he strongly suspected that the Heavenly Palace would prevent the formation of an external Lifespirit Treasure; he still remembered the process of the Heavenly Palace Halberd’s birth.<br/><br/>Besides, Fang Hanyu was simply a Mysterious Origin Treasure Spirit. If he could obtain a stronger Lifespirit Treasure, it was a fate-changing blessing.<br/><br/>This lifetime, having lived for so long, Fang Wang had few friends. Apart from Gu Li, he was on good terms with his clan members. If he could give a hand, he naturally should.<br/><br/>“But…” Fang Hanyu became anxious.<br/><br/>“Enough. Celestial Sword Intent and Sword Qi Treasure Spirit cannot coexist; your bodies cannot withstand both at the same time. You can only choose one, and I do not have much time left, I can’t wait any longer. Perhaps you are not the best inheritors, but I have no other choice,” Sword Saint interjected, cutting off their argument. His eyes, however, were filled with satisfaction. Fang Wang couldn’t resist asking, “Do you trust us so much?”<br/><br/>“I can see through the heart behind the Sword Qi. Your Sword Heart is pure, your greed is not great, and you have few distractions. Although his Sword Qi is extremely lethal, the fact that he can consider your feelings also proves his loyalty and righteousness. I have been waiting for thirty years and can wait no longer. Perhaps you are not the ideal inheritors, but I have no other option,” Sword Saint replied.<br/><br/>“My unworthy disciple’s Sword Heart has dissipated, and he is not qualified to inherit my Celestial Sword Intent. His mind is so fragile, treating the grade of a Treasure Spirit as fate. If he had a higher grade Treasure Spirit, I fear that in the future, he might misuse his power over others.”<br/><br/>Hearing this, Fang Wang felt somewhat ashamed.<br/><br/>If he hadn’t appeared out of nowhere, could Song Jinyuan have received Sword Saint’s inheritance?<br/><br/>However, things had already come to this point, and he could not be overly sentimental.<br/><br/>“Let’s begin.”<br/><br/>Suddenly, Sword Saint raised his hand, pointing his right index finger at Fang Wang. Fang Wang’s eyes fixed in place, reflecting the image of sword fighting figures.<br/><br/>At this moment, Fang Wang thought of the mysterious figure he had seen practicing swordsmanship on the lake’s surface. It was none other than the Celestial Sword Intent.<br/><br/>With this in mind, had the Sword Saint already decided to pass on the Celestial Sword Intent to him, and was the test earlier just a probe?<br/><br/>But Fang Wang only had this thought flash through his mind before he quickly became immersed in the Sword Saint’s inheritance.<br/><br/>A great number of sword moves flooded into Fang Wang’s eyes, and they were branded into his mind, making them impossible to forget. This feeling was quite extraordinary.<br/><br/>It was very passive, highly uncomfortable, yet there was an inexplicable sense of elation.<br/><br/>Not long afterward.<br/><br/>The Sword Saint withdrew his hand, and with a look of unease and anticipation, he gazed at the bewildered Fang Wang and asked, “How do you feel?”<br/><br/>Fang Hanyu grew tense as well and faced Fang Wang.<br/><br/>Fang Wang’s eyes gradually regained clarity, and he seemed to age ten years, a twilight air about him, as he sighed, “Quite good..<br/><br/>Damn!<br/><br/>Fang Wang underestimated the Celestial Sword Intent, for it took four hundred<br/><br/>and six years to master, second only to the True Combat Technique.<br/><br/>“From now on, you need not learn any other swordsmanship. It is sufficient to focus on cultivating my Sword Dao. With the talent of your Heaven Yuan Spirit Treasure, you should be able to master it in ten years, mobilize the intent of all things in heaven and earth in fifty years, and surpass me in a hundred years,” the Sword Saint said with a chuckle, stroking his beard.<br/><br/>Fang Wang nodded calmly.<br/><br/>“All right, you may leave now. Next, I will pass on the Sword Qi to him, which will take a month. During this month, you must not disturb me,” the Sword Saint instructed.<br/><br/>Taking a deep breath, Fang Wang stood up, then patted Fang Hanyu on the shoulder and walked out of the loft.<br/><br/>With the acquisition of the Celestial Sword Intent, he could now trust the Sword Saint!<br/><br/>As the door closed behind him, Fang Wang walked towards the wooden bridge, Xiao Zi poking its head out of his embrace. It felt that Fang Wang had that sense of being possessed once more, but since it had happened before, Xiao Zi didn’t ask.<br/><br/>The Sword Saint looked at Fang Hanyu and said, “Actually, I can feel your sincere heart for the sword. Zhou Yu cannot compare to you. In the realm of the Sword Dao, your future might be…”<br/><br/>Meanwhile, outside the loft.<br/><br/>At the end of the wooden bridge, Fang Wang slowly stretched out his arms and roared:<br/><br/>“Ahh—<br/><br/>His voice echoed over the Sword Heaven Marsh, carrying far and resonating persistently.<br/><br/>Ten miles away, Gu Tianxiong, who was meditating on the lake surface on swordsmanship, opened his eyes and cursed, “Where did that brat come from, howling like a banshee!”<br/><br/>And he wasn’t the only one; many Sword Cultivators frowned.<br/><br/>Inside the loft.<br/><br/>The Sword Saint’s face changed dramatically; he seemed to sense something, his eyes filled with shock and awe.<br/><br/>Fang Hanyu hurriedly said, “Senior, please continue. Don’t mind him; he’s always been very capricious since he was young.”<br/><br/>The Sword Saint took a deep breath and said, “In the future, do not harbor any thoughts of competing with him. Focus on your own Sword Dao, for that is the true path!”<br/><br/>Fang Hanyu’s eyes were covered by a cloth strip, but his expression still seemed a bit confused.<br/><br/>He really wanted to ask, was that really what you meant to say just now?<br/><br/>“No! I have to get a move on!”<br/><br/>Fang Wang dropped his arms and said in a heavy tone. Although he felt much better after yelling, he really wasn’t in the mood to cultivate right now.<br/><br/>Xiao Zi then said, “My Lord seems very troubled. Do you want to play with me?”<br/><br/>Fang Wang pulled it from his embrace and tossed it into the lake, then turned and left.<br/><br/>He walked down the wooden platform and along the lakeside.<br/><br/>He remembered meeting someone before coming to Sword Heaven Marsh; what was their name again?<br/><br/>He couldn’t recall, but he figured that if they met again, the other person would surely recognize him. His impression of that person was not bad; surely an interesting individual.<br/><br/>“My Lord, wait for me!”<br/><br/>Xiao Zi swam rapidly across the lake surface.<br/><br/>At the Great Abyss Gate, within the first lineage, inside a cave dwelling,<br/><br/>Lu Yuanjun sat opposite Zhao Zhen at a stone table, Zhao Zhen poured tea for Lu Yuanjun and then spoke, “That kid has been gone for over half a year, have you found out where he is?”<br/><br/>Lu Yuanjun replied, “I’ve checked his Disciple Token’s location through the sect’s central Magical Artifact; it’s in the south, quite far away, probably in that range of one hundred thousand mountains. Exactly where, I cannot say.”<br/><br/>Zhao Zhen took a deep breath and said, “During this time, I’ve drawn some of the Fang Family Disciples to our side and established good relations.”<br/><br/>Lu Yuanjun looked at him with a half-smile and asked, “What, you’re not afraid of him finding out now?”<br/><br/>“With the emergence of the Heaven Yuan Spirit Treasure, the sect will protect him at all costs. Neither you nor I can compete with him. Why bother contending with him? Once Da Qi becomes a Cultivation Dynasty, I will leave Da Qi and seek my own path to immortality, never to return,” Zhao Zhen said calmly.<br/><br/>Upon hearing this, Lu Yuanjun laughed, but his expression then turned gloomy as he said coldly, “Leave? Where do you think you’re going? If I killed you, he wouldn’t be able to trace it back to me at all, would he?”<br/><br/>Zhao Zhen was not panicked; his demeanor did not change as he said, “I’m just a human witness, after all. Once your Ghost Instrument, which has absorbed so many souls, appears, he will surely deduce the truth. Then, you won’t be able to escape retribution. Killing me is meaningless. Leaving the Great Abyss Gate, leaving Da Qi—this is the best way out for both you and me.. The world is so vast; where can we not find refuge?”\t\t\t\t\t\t</div>", "images": {}, "success": true}