{"id": 72, "url": "https://www.novelhall.com/i-became-an-immortal-on-mortal-realm-32879/14274567.html", "title": "Chapter 72 - Chapter 72: Chapter 69: Cannot Withstand A Single Blow, Inheritance Of The Sword Array [Fifth Update) _1", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 72 - Chapter 72: Chapter 69: Cannot Withstand A Single Blow, Inheritance Of The Sword Array [Fifth Update) _1</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 72: Chapter 69: Cannot Withstand a Single Blow, Inheritance of the Sword Array [Fifth Update) _1<br/><br/>Translator: 549690339<br/><br/>The White Dragon coiled in the sky, with Fang Wang inside its dragon head looking down indifferently at the thirteen geniuses below like a dragon god.<br/><br/>This was the first time he publicly displayed the Nine Dragons Divine Transformation Art; he had avoided using it before for fear of attracting trouble with a valuable possession, but now he had a certain amount of confidence. Although he did not dare to call himself invincible, showing off his power when appropriate could avoid more trouble.<br/><br/>Now that his Heaven Yuan Spirit Treasure had been revealed, he wanted to tell the world that he had grown up!<br/><br/>Whoever dared to use the Fang Family to plot against him should first weigh their own worth!<br/><br/>Everyone was shocked by the Nine Dragons Divine Transformation Art; the White Dragon Fang Wang had transformed into was not only visually stunning but also exuded a powerful aura. Even through the Formation, it was palpable to the disciples outside.<br/><br/>The thirteen geniuses below felt it even more intensely, facing a formidable enemy, some even beginning to sweat from their foreheads.<br/><br/>“Let’s go at him together,” the Suspended Vast Sword Sect’s Liu Jun said sternly, “Our combined strength might not lose to him, the more powerful the arcane art, the greater the consumption of Spiritual Power!”<br/><br/>He immediately drew his bow to full circle, his Spiritual Power converging into an arrow, pointing at Fang Wang in the sky.<br/><br/>The other geniuses hurriedly activated their Lifespirit Treasures, casting their strongest spells.<br/><br/>Fang Wang’s gaze sharpened as he suddenly dived down, with the dragon’s roar echoing through the sky, the twenty-zhang-long White Dragon descended with a momentum like the sky was falling!<br/><br/>So fast!<br/><br/>Song Jinyuan’s pupils shrank, his heart shocked by the reaction, the tastest among the people. He nimble maneuvers in place, executing sword moves rapidly, as if he had created five clones, all lifting their swords to slash towards the sky, their Sword Intent soaring.<br/><br/>Liu Jun, leaning to the side, his upper body pointing skyward, angrily unleashed his bow, the arrow made of Spiritual Power turning into a beam of light, as swift and fierce as a thunderbolt.<br/><br/>The ultimate moves of the other geniuses were equally grandiose, causing the Sect’s Main City to tremble.<br/><br/>The White Dragon charged angrily downwards, tearing through all attacks with an absolutely dominant posture, and when it was about to hit the ground, it violently changed direction, rushing at Liu Jun.<br/><br/>The speed of the White Dragon was simply too fast; before Liu Jun could dodge, he was hit and sent flying, spitting blood and crashing against the Formation’s light screen, slowly sliding down.<br/><br/>Before he hit the ground, other geniuses were successively blasted out of the combat platform!<br/><br/>The White Dragon was unstoppable, colliding with anyone in its path, scattering their Spiritual Power; a lighter hit would shake their blood and Qi, a heavier one could break tendons and shatter bones.<br/><br/>In less than the time of three breaths, ten people had been flung from the combat platform, the entire city of spectators too shocked to speak, all staring intently at the twelve Golden Mirrors in the sky. In the mirrors, the White Dragon was so powerful, like a divine beast descending from the heavens, wreaking havoc upon the mortal world.<br/><br/>Fang Wang stood within the dragon’s head, his gaze locked on Song Jinyuan, whom he felt was the strongest.<br/><br/>Song Jinyuan retreated swiftly, his right hand executing sword moves, with Flying Swords flying out from his storage bag, swiftly forming a Sword Array, drawing in nature’s spiritual energy to gather around him.<br/><br/>Facing the incoming White Dragon, he fiercely threw out his sword in his hand, followed by numerous Flying Swords in the formation, accompanied by thunderous sounds, their Sword Intent fierce.<br/><br/>Boom—<br/><br/>His Treasured Sword was directly deflected, the Flying Swords shattered one by one, the Sword Intent dispersed, causing strong winds that shook the Formation’s light screen.<br/><br/>Song Jinyuan’s eyes widened in horror.<br/><br/>His pride, the Sword Array, just couldn’t withstand a single strike?<br/><br/>He didn’t have time to think more about it; upon collision with the White Dragon, Song Jinyuan lost consciousness, his body flying out like a shooting star.<br/><br/>Fang Wang had purposely accelerated to deal with him, and luckily it had been successful.<br/><br/>Only two were left!<br/><br/>Fang Wang immediately turned around, and the two remaining opponents, frightened, voluntarily flew off the combat platform, not daring to fight.<br/><br/>Following their retreat, Fang Wang stopped, his feet touching the ground, the White Dragon coiling around him, then dissipating into a surge of air, its dragon roar once again resounding tirelessly.<br/><br/>The entire event took less than six breaths of time!<br/><br/>All the spectators shared the same sentiment.<br/><br/>Like crushing dry weeds and smashing rotten wood, unparalleled in the world!<br/><br/>The two sides were not on the same level!<br/><br/>Even outnumbered, Fang Wang had shown a strength beyond their imagination.<br/><br/>Everyone had great expectations for the Heaven Yuan Spirit Treasure, but they had not expected the course of the battle to be so exaggerated.<br/><br/>After a brief silence, a thunderous cheer and roar arose from the Sect’s Main City.<br/><br/>“My goodness, what kind of spell is that, isn’t it too strong?”<br/><br/>“So powerful… Even those widely renowned geniuses combined are no match for him!”<br/><br/>“Is this the power of the Heaven Yuan Spirit Treasure? It’s too exaggerated, besides his cultivation level, he can actually practice such an incredible art! ”<br/><br/>“How do I feel that he has transcended the category of a genius? I feel even the elders might not be his match.”<br/><br/>“After this battle, the title of Da Qi’s number one genius is no longer in dispute.”<br/><br/>While disciples and cultivators from all sides were discussing in amazement, the Peak Masters and elders of the nine meridians looked at Fang Wang with complex gazes.<br/><br/>They felt a dangerous aura.<br/><br/>Facing Fang Wang just now, they truly did not have the confidence to say they would win, some elders even felt they were inferior to Fang Wang.<br/><br/>Zhao Chuanqian looked at Fang Wang, his eyes filled with complicated emotions.<br/><br/>Fourteen years ago, he had brought Fang Wang up the mountain, and at that time, he had regretted Fang Wang’s choice to join the third meridian, but fourteen years later, Fang Wang had grown to such an extent.<br/><br/>Greedy Sleeper couldn’t stop laughing, boasting to the surrounding elders that from the moment he first saw Fang Wang, he knew the child would soar to the heavens eventually, but he had never expected that day to come so soon.<br/><br/>Lying on the ground was Sword Saint’s Successor, Song Jinyuan, who struggled to get up but failed. Fortunately, the elders of Great Abyss Gate arrived just in time to help him sit up and heal his injuries.<br/><br/>With great effort, Song Jinyuan opened his eyes, but the figure standing on the duel platform seemed blurred and unattainably distant.<br/><br/>After eighty years of cultivation, he had never felt such defeat.<br/><br/>Initially, when he heard that Lu Yuanjun had crafted a mid-grade Earth Origin Spirit Treasure, he was disdainful, still believing in his own Sword Intent. But now…<br/><br/>He found himself lost in an unprecedented confusion.<br/><br/>No matter how strong the Sword Intent, could it make up for the gap in the grade of one’s Lifespirit Treasure?<br/><br/>Lu Yuanjun stood among the talents of Great Abyss Gate, looking at Fang Wang with complicated eyes. The disciples around him were excitedly discussing the recent fight, but he couldn’t stay calm because the strength Fang Wang had shown was truly terrifying. Without using that ultimate treasure, he was not fully confident he could handle it.<br/><br/>In the distance, Zhao Zhen glanced at Lu Yuanjun. Seeing the expression on Lu Yuanjun’s face, Zhao Zhen’s eyes turned cold before he silently turned around and walked away.<br/><br/>Zhou Xue looked at the triumphant Fang Wang with a light laugh, and she, too, turned to leave.<br/><br/>Guang Qiuxian stood on the duel platform and, seeing that the elders had started to heal the talents, turned to Fang Wang and said, “Fang Wang, come with me.”<br/><br/>He appeared composed, but inside, he was extremely anxious.<br/><br/>Fang Wang was too strong!<br/><br/>He feared that the strong breeze might destroy the prominent tree in the forest!<br/><br/>Defeating so many talents forcefully, how could the eight major factions sit easy?<br/><br/>He needed to think of a strategy to deal with this.<br/><br/>Fang Wang stored the Heavenly Palace Halberd in his Treasured Spirit Space, then followed Guang Qiuxian’s lead down from the duel platform. Guang Qiuxian also called for Elder Zhang from the Task Hall.<br/><br/>All along the way, the disciples were shouting Fang Wang’s name.<br/><br/>Fang Wang felt emotional, thinking that these disciples truly lacked the composure of a cultivator. His mere transformation into a White Dragon had them this excited; what if he were to become a Black Dragon?<br/><br/>Along the way, Elder Zhang kept lavishing Fang Wang with praise, which was so excessive that Fang Wang felt a bit embarrassed.<br/><br/>Guang Qiuxian led the way in front without turning back or interjecting.<br/><br/>The three of them quickly arrived inside the Task Hall, heading to the fourth floor to the Elders’ Chamber, where Guang Qiuxian spoke, “Record eight hundred thousand contributions for him!”<br/><br/>Fang Wang raised an eyebrow as that was three hundred thousand more than what had been agreed upon in advance.<br/><br/>He quickly took out his disciple token and handed it to Elder Zhang.<br/><br/>Elder Zhang immediately complied, chuckling, “Eight hundred thousand? I think even a million would be too modest. The renown from this battle is immeasurable.”<br/><br/>Guang Qiuxian glared at him and said, “Are you the Sect Leader, or am I?” Elder Zhang made a face but said no more.<br/><br/>It was clear that the relationship between these two was close, with no strict hierarchy.<br/><br/>Fang Wang remembered hearing someone say that Elder Zhang was actually the Sect Leader’s senior brother, who didn’t have much longer to live.<br/><br/>Soon, Elder Zhang handed the disciple token back to Fang Wang. Guang Qiuxian turned around and gestured for Fang Wang to follow him.<br/><br/>Elder Zhang sat down, watching Fang Wang’s departing figure and reflected, “To see a Heaven Yuan Spirit Treasure in the twilight years of my life, truly the heavens have favored me…”<br/><br/>After leaving the Task Hall, Guang Qiuxian led Fang Wang back to Main Meridian, and they entered Shiyuan Hall. Standing opposite each other, Guang Qiuxian asked Fang Wang what he wanted to learn.<br/><br/>Fang Wang, without hesitation, chose the legacy of the third meridian, the Nine Heavens Azure Thunder Sword Formation!<br/><br/>This Sword Array was the most profound secret of the nine meridians, never passed on since then; even Yang Yuanzi had not learned it, indicating the Nine Heavens Azure Thunder Sword Formation was stronger than the Jinghong Divine Sword Art.<br/><br/>Guang Qiuxian gave him a deep look and then raised his right hand. The wind echoed through the corridor, and shortly afterward, a Jade Slip flew into his palm, which he promptly handed to Fang Wang.<br/><br/>“This is the Jade Slip of the Nine Heavens Azure Thunder Sword Formation legacy. I can only give you ten years. After ten years, you must return it,” Guang Qiuxian said solemnly.<br/><br/>Fang Wang nodded and quickly replied, “I won’t need that long. As soon as I remember the cultivation method, I will return it early.”<br/><br/>Guang Qiuxian nodded and said, “The Nine Heavens Azure Thunder Sword Formation was created by the second Sect Leader, who traveled beyond the lands of Da Qi to seek the Dao in more vast realms. Upon returning, he swept through the Cultivation World with the Nine Heavens Azure Thunder Sword Formation. Unfortunately, no one could carry on his legacy. You possess a<br/><br/>Heaven Yuan Spirit Treasure and have a profound understanding of the Sword<br/><br/>Dao. I hope to see it brought back to the world through you.”<br/><br/>Fang Wang immediately agreed, and Guang Qiuxian said no more, waving his sleeve to indicate that Fang Wang could leave.<br/><br/>Fang Wang stored the Jade Slip in his storage bag and then bowed in farewell.<br/><br/>After leaving Shiyuan Hall, he was about to fly back to the third meridian when he suddenly saw someone coming up the mountain, so he immediately went to meet them.<br/><br/>“Brother Lu, long time no see,” Fang Wang greeted with a smile.<br/><br/>Lu Yuanjun saw him, and for a moment, his expression faltered, but he quickly recovered his usual warm demeanor and laughed, “Brother Fang, your performance was really impressive. I feel I am no longer your match.”<br/><br/>“Brother Lu is too kind. I still have to cultivate more to catch up to you. By the way, what brings you up here?” Fang Wang said with a shake of his head and a chuckle.<br/><br/>The two appeared to have a close relationship, showing no signs of being enemies.<br/><br/>Lu Yuanjun replied with a smile, “I have some intelligence about the other sects that I need to report to the Sect Leader..”\t\t\t\t\t\t</div>", "images": {}, "success": true}