{"id": 87, "url": "https://www.novelhall.com/i-became-an-immortal-on-mortal-realm-32879/14282394.html", "title": "Chapter 87 - Chapter 87: Chapter 84 Danger At The School, Return", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 87 - Chapter 87: Chapter 84 Danger At The School, Return</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 87: Chapter 84 Danger at the School, Return<br/><br/>Quickly! [Third Update, Request for Monthly Pass]_l<br/><br/>Translator: 549690339<br/><br/>“Grandfather, what about the second matter?”<br/><br/>As soon as Fang Wang heard his grandfather agree, he immediately shifted the topic and asked.<br/><br/>Fang Meng restrained his smile and asked, “Regarding the matter of the Qi Dynasty turning into a Cultivation Dynasty, have you been involved? Or do you know anything about it?”<br/><br/>Upon hearing this, Fang Wang shook his head and said, “I’ve been busy with cultivation on ordinary days and have not inquired about these matters.<br/><br/>Grandfather, what do you wish to know?”<br/><br/>“Over these years, the atmosphere in the court has been subtle, with ministers disappearing and the turnover rate of officials faster than all the women in the Imperial City giving birth. During this visit, I’ve found that some cities are not as bustling as before, and all the people are in fear for their lives. I’ve asked around, and it’s said that the local government offices are forcibly conscripting people to dig for Spirit Veins, and once they’re gone, there’s no news of them. I followed our ancestors in uprising and fought for the world together. Although there were those in the Qi Dynasty who wanted to harm us, the world of the Qi Dynasty has your grandfather’s efforts in it, and I wouldn’t want someone to ruin it.”<br/><br/>“Moreover, Fang Residence is of the Duke’s Mansion, you were born into wealth, which comes from the people.”<br/><br/>Fang Meng spoke seriously. He was very cautious and also gauged Fang Wang’s expression.<br/><br/>People’s ideas can change with their standpoints, and he was also worried that Fang Wang had completely adopted the ideas of a Cultivator, caring only for what’s good for the Cultivation World and disregarding the lives of the common folk.<br/><br/>After hearing this, Fang Wang pondered and said, “How about this? When I return to the Great Abyss Gate, I will ask my master about it. If he can’t give a<br/><br/>clear explanation, I’ll find the Sect Leader.”<br/><br/>Relieved by these words, Fang Meng’s smile returned. He raised his hand and patted Fang Wang heavily on the shoulder.<br/><br/>‘Good grandson, immortality is elusive. In a person’s life, what’s most important is what kind of person you become. If you can live long and become an immortal, then you must consider what kind of immortal you should be,” Fang Meng said with profound meaning.<br/><br/>What kind of immortal?<br/><br/>An immoral and willful immortal, that was for sure!<br/><br/>Fang Wang thought to himself, but he dared not say it aloud. He wasn’t foolish; he understood his grandfather’s meaning.<br/><br/>For someone like Fang Meng, duty to the family and country was above all else.<br/><br/>Then, Fang Meng no longer talked about these matters and began to discuss the affairs of the Fang Realm with Fang Wang.<br/><br/>Sixteen years had passed, and the Fang Family had produced hundreds of Cultivators, although the vast majority were in the Qi Cultivation Realm, it was enough to ensure the safety of the Fang Family.<br/><br/>Once upon a time, a single Qi Cultivation Realm cultivator had almost led to the annihilation of Fang Residence. Looking back now, both grandfather and grandson felt deeply moved.<br/><br/>That night, they talked for a long time.<br/><br/>The next day at noon, Fang Wang sat in meditation at the bridgehead, performing his Qi Gathering technique.<br/><br/>Despite the ease of the battle with Sword Sect’s Kong Xi, the consumption of<br/><br/>Spiritual Power was enormous. The Nine Heavens Azure Thunder Sword Formation was incredibly draining on Spiritual Power. Just facing Kong Xi had used up half of his Spiritual Power, and he had to hurry to replenish it, keeping his Spiritual Power in an abundant state.<br/><br/>Xiao Zi lay on his left, continuing to comprehend the sword.<br/><br/>As all excitement eventually wanes, most of the various forces had already departed, including the Fang Family members who had left early in the morning. Those who remained were also preparing to leave.<br/><br/>Fang Wang planned to return to the Great Abyss Gate after his Spiritual Power was restored. Having not returned in a long time, it was about time to go back. After so many events, he would return with a celebrated name, which was quite exhilarating to consider.<br/><br/>Just then.<br/><br/>Fang Wang suddenly sensed something, opened his eyes, and flipped his right hand to take out his disciple Token. Gu Li’s voice came from inside:<br/><br/>“The Sect is in danger! Return immediately!”<br/><br/>The tone of Gu Li’s voice was incredibly solemn, and it was the first time Fang Wang heard him speak in such a manner.<br/><br/>Fang Wang furrowed his brows, wondering if Gu Li was summoning him alone, or all the disciples?<br/><br/>Soon, a figure swept over like a breeze and stopped behind him – it was Fang Hanyu.<br/><br/>“Fang Wang, did you hear the Sect Leader’s words?” Fang Hanyu asked in a low voice.<br/><br/>Fang Wang stood up and looked at him, saying, “The Sect is in danger, return immediately?”<br/><br/>Fang Hanyu nodded and then said, “It seems that this call is for all disciples; it looks like the Great Abyss Gate is in significant trouble. We must go back, Fang Xin and the others are still inside the Great Abyss Gate.”<br/><br/>Fang Wang hesitated. He had just gone through a major battle and was still recovering his Spiritual Power. It would not be wise to return at this time.<br/><br/>To have Gu Li summon all the disciples who were outside…<br/><br/>Could it be…<br/><br/>Fang Wang suddenly remembered Zhou Xue once mentioning that the Great Abyss Gate had come under attack by several factions of the Demonic Path because they had produced several Earth Origin Spirit Treasure geniuses. Now that the Great Abyss Gate had birthed a Heaven Yuan Spirit Treasure, could this calamity have come sooner?<br/><br/>Wait a minute!<br/><br/>If the Demonic Path were invading, was their choice of this moment because they had just learned of his battle with the Sword Sect?<br/><br/>After the battle yesterday, many had departed immediately, clearly spies.<br/><br/>Fang Wang had already killed a Great Demon King before, equating to a being at the Condensation Spirit Realm. If they could invade the Great Abyss Gate right after his battle, their chances of success would naturally be higher.<br/><br/>First to annihilate the Great Abyss Gate and then either siege or subjugate him, the Heaven Yuan Spirit Treasure genius?<br/><br/>Fang Wang’s mind was flooded with myriad thoughts. In the meantime, multiple figures flew across the lake on their Flying Swords, all Tai Yuan Sect Disciples.<br/><br/>Zhao Chuanqian arrived in front of Fang Wang first and quickly said, “The Great Abyss Gate is in trouble; we are going back first. Fang Wang, you two stay in Sword Heaven Marsh!”<br/><br/>Having said that, he flew away on his sword, and the others followed closely behind.<br/><br/>The Greedy Sleeper, who was usually light-hearted, now had a serious face, and although the other disciples looked towards Fang Wang, they dared not speak.<br/><br/>Fang Wang noticed Gu Li was among them as well, and she, wearing her veil, did not look at Fang Wang, her gaze as cold as ever.<br/><br/>A line of hundreds flew northward on their swords, swiftly crossing the mountain tops, disappearing without a trace.<br/><br/>Fang Wang’s brows knitted tightly; it was clear Zhao Chuanqian was conveying a message to him, and they had come to the same conclusion.<br/><br/>The calamity of the Great Abyss Gate was certainly related to Fang Wang’s great battle.<br/><br/>Fang Hanyu spoke gravely: “You stay here; I am going back. I cannot stand by<br/><br/>and watch our people suffer!”<br/><br/>Having said that, he was about to leap into the air, but Fang Wang held him down by the shoulder.<br/><br/>Fang Wang took a deep breath and said, “Wait for me one day, how about that?”<br/><br/>“But…’<br/><br/>“Can you alone turn the tide? The Great Abyss Gate isn’t weak enough to be easily destroyed! The Great Abyss Gate has a protective great formation!”<br/><br/>Convinced by Fang Wang’s serious words, Fang Hanyu nodded in agreement.<br/><br/>After that, Fang Wang sat back down to channel and gather Qi, while taking spirit energy pills from his storage bag to speed up the recovery of his spiritual power.<br/><br/>Fang Hanyu went to find Song Jinyuan and informed him of the situation.<br/><br/>Song Jinyuan started to speak but hesitated. He really wanted to keep Fang Wang behind—what did the life or death of the Great Abyss Gate have to do with him?<br/><br/>But if Fang Wang could abandon the Great Abyss Gate, might he later abandon Sword Heaven Marsh?<br/><br/>The sun set, and the moon rose.<br/><br/>A day passed, and Sword Heaven Marsh had entirely fallen into silence, a silence so profound it was frightening.<br/><br/>As noon approached, Fang Wang stood up and rushed over to Fang Hanyu, who had been waiting for a long time.<br/><br/>“Let’s go,” said Fang Wang, though his spiritual power hadn’t fully recovered, seventy percent was enough to cope.<br/><br/>Xiao Zi immediately snuggled into Fang Wang’s embrace.<br/><br/>Fang Hanyu nodded, and the two brothers leaped onto their flying swords, which carried them northward at high speed.<br/><br/>Song Jinyuan and a crowd of Sword Servants watched as the brothers departed.<br/><br/>Gu Tianxiong came over from the side, laughing, “Song lad, I should leave, too.<br/><br/>Let’s spar again next time.”<br/><br/>Song Jinyuan turned to look at him and bowed in respect.<br/><br/>Their sparring had ended in victory for Song Jinyuan, and thanks to Gu Tianxiong, Song Jinyuan had regained his confidence. Gu Tianxiong’s humor had already made him a friend in Song Jinyuan’s eyes.<br/><br/>Gu Tianxiong turned and walked in another direction, leaving behind a parting word:<br/><br/>“When we meet again, who knows how far Fang Wang will have progressed? Song lad, you must work hard, so you aren’t unqualified to even follow him.” Song Jinyuan didn’t get angry; instead, he smiled.<br/><br/>Above the mountains, Fang Wang and Fang Hanyu flew on their swords. They were quick, covering nine hundred miles in an hour, and that wasn’t even their top speed, considering the long journey ahead. All the way, both men kept their own counsel.<br/><br/>Suddenly.<br/><br/>Xiao Zi poked her head out from Fang Wang’s embrace. Fang Wang seemed to sense something, squinting his eyes, and then stopped.<br/><br/>Fang Hanyu stopped as well, surprised, and asked, “What’s wrong?”<br/><br/>With a deep and distant look, Fang Wang said, “Hanyu, go back, take another route to the Great Abyss Gate.”<br/><br/>Hearing that, Fang Hanyu’s brow furrowed as he pressed, ‘Why?”<br/><br/>“Fool! There are enemies ahead! And a lot of them. Someone has set an ambush for us! If you stay, you’ll only drag me down, ” Xiao Zi shouted, her tone extremely tense.<br/><br/>An ambush?<br/><br/>Fang Hanyu swiftly turned to look ahead. The mountainous forest undulated with high peaks stretching as far as the eye could see, no trace of anyone.<br/><br/>He naturally would not question Fang Wang’s judgment. Turning back, he clenched his teeth and said, “I have to stay with you!”<br/><br/>Fang Wang took a deep breath, “Such a big setup is surely meant for ambushing me. Hurry back. Listen to me. Think about Fang Xin and the others. And if I’m alone, even if I can’t defeat them, I still have a better chance to escape. Surely you don’t want to end up being a liability I have to look after!”<br/><br/>After hearing Fang Wang, Fang Hanyu bit his lip. Without delay, he leaped onto his sword and headed back the way they came.<br/><br/>Once he had vanished into the sky, Xiao Zi couldn’t help asking, “Young master, what do we do? Hide?”<br/><br/>Fang Wang gazed ahead and said, “We can’t hide. If we do, they’ll trace us, and that will put Hanyu in danger. And my clansmen are also heading this way.”<br/><br/>Half an hour earlier, he and Fang Hanyu had spotted members of the Fang Family. They were traveling on foot, four hundred miles from where he was standing.<br/><br/>Fang Wang continued to fly on his sword, but at a slower pace than before.<br/><br/>Xiao Zi, though scared, moved to Fang Wang’s shoulder and watched their surroundings warily.<br/><br/>About ten miles further, a taunting voice rang out:<br/><br/>“Heaven Yuan Sword Saint Fang Wang, do you understand that blood debts are paid in blood?”<br/><br/>Fang Wang’s eyes locked onto a high peak several miles ahead, where hundreds of cultivators stood, led by a man in a blood-red robe with a skull crown and a red scorpion on his exposed chest—gruesome and terrifying.<br/><br/>It wasn’t just that one mountain peak. The figures of other cultivators appeared one after another on other peaks ahead, and figures leaped out from the forests to his left and right as well.<br/><br/>Green Cicada Valley!<br/><br/>Fang Wang recognized their identity.<br/><br/>Indeed, who else but Green Cicada Valley could dispatch so many people to ambush him?<br/><br/>Fang Wang gently descended, landing on the mid-slope of a mountain below.<br/><br/>He raised his right hand, drawing out the Heavenly Palace Halberd, and whispered, “What comes next is a fierce battle. Are you ready?” In his spiritual sense, enemies from all directions numbered at least ten thousand—a count that likely didn’t include all of them.<br/><br/>For the sake of ambushing him, Green Cicada Valley truly had mustered a great force!\t\t\t\t\t\t</div>", "images": {}, "success": true}