{"id": 80, "url": "https://www.novelhall.com/i-became-an-immortal-on-mortal-realm-32879/14278313.html", "title": "Chapter 80 - Chapter 80: Chapter 77: The Celestial Sword Intent Slays The Demon King, Fame Begins To Spread Throughout The World 1", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 80 - Chapter 80: Chapter 77: The Celestial Sword Intent Slays The Demon King, Fame Begins To Spread Throughout The World 1</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 80: Chapter 77: The Celestial Sword Intent Slays the Demon King, Fame Begins to Spread Throughout the World 1<br/><br/>Translator: 549690339<br/><br/>Fang Wang did not pay attention to Xiao Zi, nor did he care why Gu Tianxiong was blushing; his eyes were solely on the bizarre man. At this moment, he was thinking about one thing.<br/><br/>How to kill the Great Demon King?<br/><br/>Since this place was Sword Heaven Marsh, and all around were the worshippers of the Sword Saint, it would be fitting to use the legacy of the Sword Saint to execute the Great Demon King!<br/><br/>Having thought this, Fang Wang’s gaze turned fierce, and he stepped forward into the air. Everyone’s gaze fell on him and the bizarre man. Some people wanted to take this opportunity to launch a sneak attack on Fang Hanyu, but the ubiquitous Celestial Sword Intent made them dare not act rashly.<br/><br/>They could only hope that the bizarre man could hold Fang Wang back.<br/><br/>What they failed to realize was that, with Fang Wang’s Celestial Sword Intent displayed, in their eyes, Fang Wang was no longer just a genius, but a world-shaking powerhouse in the making.<br/><br/>The bizarre man’s eyes hardened, and his body exploded into a cloud of demonic mist. The rolling mist surged violently, bringing gales sweeping towards Fang Wang, with waves on the lake reaching heights of ten feet, the momentum immense.<br/><br/>Gu Tianxiong stood behind Fang Wang, his legs trembling slightly on the Flying Sword.<br/><br/>He could feel the oppressive might of the Great Demon King; just a Cultivator of the Profound Heart Realm, he had never crossed hands with someone from the Condensation Spirit Realm. How could he not panic facing the Great Demon King?<br/><br/>However, when his gaze fell on Fang Wang’s silhouette, his heart suddenly felt at ease.<br/><br/>Faced with the monstrous waves raised by the Great Demon King, Fang Wang’s lips curled upwards, his right hand holding the Qiankun Fan and waving it forward.<br/><br/>Just as the Sword Saint had said, the gesture was as fiery as it was thunderous, a single wave moving heaven and earth!<br/><br/>With a wave of the Qiankun Fan, a terrifying sea of fire burst forth, even more vast than the waves generated by the bizarre man.<br/><br/>Boom—<br/><br/>The two powerful forces collided, dissipating into hot mist.<br/><br/>The next second, the bizarre man suddenly burst out of the hot mist. He raised his right hand from his waist, and a bone sword materialized from nowhere, lunging forward with a thrust aimed straight at Fang Wang.<br/><br/>Fang Wang revealed a contemptuous smile. He shifted his right foot to the side, and in an instant, everything seemed to come to a halt—the lake’s ripples, the wind and rain, even the expressions of the hundreds of Cultivators.<br/><br/>Only the bizarre man still advanced!<br/><br/>His eyes, however, suddenly narrowed as the speed of his swing drastically slowed.<br/><br/>Reflected in his eyes was the image of Fang Wang, standing amidst the roaring flames, bearing a smile that seemed to look down upon the world as if staring at an insect he could easily crush.<br/><br/>When time seemed to stand still, multiple shadows of swords converged, above the lake, in the sky, on cliff walls, atop pavilions, and even around Fang Hanyu, who saw his Absolute Heart Evil Eye undergo a change, gaining expression as his awareness awakened in this moment.<br/><br/>What did he see?<br/><br/>So many swords!<br/><br/>Sword Qi?<br/><br/>No!<br/><br/>It was Sword Intent!<br/><br/>From above, Fang Hanyu looked down to see Fang Wang standing by the lake, with roiling demonic Qi obscuring half of it, and a silhouette before the mist rushing towards Fang Wang.<br/><br/>Such terrifying Demonic Qi!<br/><br/>Just a single glance left Fang Hanyu in no doubt that, although he had inherited the Sword Saint’s Sword Qi, he was no match for this demon.<br/><br/>However, he did not worry for Fang Wang. Unbeknownst to him, Fang Wang had become the most trustworthy person in his heart.<br/><br/>The Celestial Sword Intent was everywhere between heaven and earth, dense and numerous, floating in all directions, a magnificent sight to behold!<br/><br/>Almost simultaneously, all the shadows formed by Sword Intent pointed towards the bizarre man.<br/><br/>The bizarre man kept advancing, his terrifying Demonic Qi still spreading, but his speed seemed exceedingly slow in front of Fang Wang.<br/><br/>Suddenly, Fang Wang’s right hand snapped the Qiankun Fan shut with a crack, and the thousands of Celestial Sword Intents moved together, swift as lightning, striking at the bizarre man.<br/><br/>Hundreds of Cultivators were brushed past by the Celestial Sword Intent or had it skim over their heads, each feeling a harmonious yet exceptionally powerful Sword Intent.<br/><br/>It was the Sword Saint’s Celestial Sword Intent, the unity of heaven and man, the natural way of the Dao!<br/><br/>Boom!<br/><br/>Thousands of Sword Intents struck the bizarre man, exploding the surface of the lake and sending waves dozens of feet high, with the terrifying Sword Qi raising huge waves that swept in all directions.<br/><br/>The world returned to normal!<br/><br/>Fang Wang did not possess the ability to stop time; what had just occurred was merely a use of the Celestial Sword Intent to suppress Sword Heaven Marsh, creating the illusion of a frozen moment.<br/><br/>However, the Great Demon King was not so easily killed!<br/><br/>The huge wave broke apart, and the bloodied bizarre man leaped above Fang Wang’s head with speed akin to teleportation. He raised his bone sword high and slashed furiously downwards.<br/><br/>Everything happened too fast for Xiao Zits snake eyes to even widen in surprise.<br/><br/>Pfft!<br/><br/>A Sword Qi shot fiercely from Fang Wang’s eyes, piercing through the bizarre man’s forehead. His body was thrown backward, his face displaying a look of terror.<br/><br/>Divine Nurturing Sword Qi!<br/><br/>A cold gleam flashed in Fang Wang’s eyes, his killing intent unabated.<br/><br/>The Divine Nurturing Sword Qi turned back and attacked the bizarre man again.<br/><br/>Whoosh! Whoosh! Whoosh…<br/><br/>The Divine Nurturing Sword Qi, fast as lightning, repeatedly pierced the bizarre man, blood splashing, his body convulsing wildly in midair, completely defenseless.<br/><br/>In less than a moment, the Divine Nurturing Sword Qi ceased, and the riddled body of the bizarre man fell into the lake, stirring up blood, the dark red fresh blood spreading over the surface of the lake.<br/><br/>“That is… ”<br/><br/>Gu Tianxiong’s eyes widened; his face flushed red once more, this time with excitement.<br/><br/>If he wasn’t mistaken, that was the Divine Nurturing Sword Qi of their Gu<br/><br/>Family!<br/><br/>The Divine Nurturing Sword Qi was something he had asked Gu Li to give to Fang Wang, but he never expected that Fang Wang had already mastered it to such a degree, that even his father would probably be no match for him.<br/><br/>The Divine Nurturing Sword Qi returned to Fang Wang’s eyes, and he glanced towards the subordinates of the strange man in the distance, those monsters had been scared out of their wits and feeling his gaze, they all turned tail and fled.<br/><br/>Clang<br/><br/>Fang Wang’s Qingjun Sword at his waist suddenly unsheathed, striking towards those eighteen demons.<br/><br/>Great Perfection of the Sword Control Technique!<br/><br/>Xiao Zi on his shoulder followed, darting out like a sharp arrow, so fast that Gu Tianxiong’s eyes couldn’t keep up.<br/><br/>So fast!<br/><br/>This snake is stronger than me!<br/><br/>Fang Wang turned around, raised an eyebrow at Fang Hanyu in the sky, and threw a look that meant, “Am I awesome or what?”<br/><br/>Fang Hanyu got the message, shook his head indicating he was fine.<br/><br/>Fang Wang broke out a question mark on his forehead?<br/><br/>Is this not strong?<br/><br/>The Celestial Sword Intent dissipated, and Sword Heaven Marsh was left with only the sound of splashing water, all cultivators stared wide-eyed at Fang Wang, stunned into silence for a long time.<br/><br/>The boy who initially led the way for Fang Wang and the man in yellow were even more frightened, beginning to recollect their own attitudes at the time, worrying whether they had been arrogant and offended Fang Wang.<br/><br/>Fang Wang said to Gu Tianxiong, “Big Brother Gu, help me look after the demon corpses, I’m going inside for a moment.”<br/><br/>Having said that, he walked toward the attic.<br/><br/>Gu Tianxiong came back to his sense, turned his head to look at Fang Wang, and hesitated to speak.<br/><br/>He had too many questions he wanted to ask.<br/><br/>Meanwhile, Fang Hanyu descended from the sky, the treasure above his head merging into his body and disappearing from sight.<br/><br/>He landed in front of Fang Wang, who once again gave him a look, signaling him to follow, and this time he understood.<br/><br/>The two brothers entered the attic, and when Fang Hanyu saw the bowed Sword Saint, his expression changed.<br/><br/>Fang Wang walked up to the Sword Saint, hitched up his clothes and knelt down, kowtowing three times to the Sword Saint, with Fang Hanyu quickly doing the same.<br/><br/>“Master, although our time together was short, but I will carry forward your<br/><br/>Celestial Sword Intent, the Cultivation World will not forget your name.”<br/><br/>Fang Wang said gently, feeling remorse in his heart for not having witnessed his master’s strongest posture.<br/><br/>Fang Hanyu didn’t speak, but from his clenched teeth, it was clear his heart was filled with guilt; he suddenly felt as if the great power he now possessed was an unearned debt.<br/><br/>Subsequently, Fang Wang stood up, instructing Fang Hanyu to carry the Sword Saint’s body.<br/><br/>Fang Hanyu immediately complied, and just as he touched the Sword Saint, the latter’s right hand suddenly grabbed his, the ring on his thumb transferring onto Fang Hanyu’s right thumb, before the Sword Saint’s right hand fell back down.<br/><br/>Fang Hanyu was startled, compelled to re -examine the Sword Saint, thinking the Sword Saint was still alive.<br/><br/>By the lakeside of Sword Heaven Marsh, the light of the fire flickered.<br/><br/>Hundreds of sword cultivators gathered here, with Song Jinyuan, Fang Wang, and Fang Hanyu standing at the forefront, watching the cremation of the Sword Saint’s body.<br/><br/>Fang Wang couldn’t help but ask, “Do we really have to burn it? By keeping the body and soul intact, maybe he can be revived in the future.”<br/><br/>Song Jinyuan shook his head and said, “These were master’s previous orders; he feared more that his body would become a bane rather than hoping for revival. My master led an open and honorable life, never committing a single evil deed, nor troubling others, and he did not wish to cause disasters for the living after death.”<br/><br/>Fang Wang was silent.<br/><br/>Although the other cultivators felt it was a pity, they were also saddened by the<br/><br/>Sword Saint’s death, for most who came here had heard tales of the Sword Saint, and upon their arrival, with no rules set by the Sword Saint and with his protection allowing them to cultivate, they held deep respect for him.<br/><br/>That night, Fang Wang and the other two kept vigil for the Sword Saint.<br/><br/>As dawn broke the next day, some cultivators started to leave, while others wished to stay.<br/><br/>Song Jinyuan turned to Fang Wang, gritting his teeth and said, “From now on, Sword Heaven Marsh is yours, I am not worthy to be his disciple, I will leave of my own accord.”<br/><br/>After saying this, he turned and prepared to leave, but Fang Wang held him by the shoulder, causing him to look at Fang Wang in surprise.<br/><br/>“Senior Brother, now that we’re from the same sect, there’s no need to be strangers. Master would definitely want you to pick yourself up. You should still oversee Sword Heaven Marsh. I plan to cultivate here for a few years, during which we can exchange insights on the Sword Dao,” Fang Wang said seriously.<br/><br/>Song Jinyuan gave a wry smile and said, “What qualifications do I have to exchange with you?”<br/><br/>Fang Wang sighed and said with frustration, “Senior Brother, you really lack vision!”<br/><br/>Provoked by Fang Wang’s rebuke, Song Jinyuan flared up immediately.<br/><br/>“Don’t compare yourself with me, who in this world can compare with me? You’ve got the wrong target. Moreover, I aim to be the world’s number one; does it shame you to chase after the world’s number two?” Fang Wang said with earnest gravity.<br/><br/>Song Jinyuan was silent, his face twitching slightly.<br/><br/>Fang Hanyu nodded and said, “Exactly, even master said the same to me before he passed away, not to compare with him. Think about it, before you met him, when did you ever fail?”<br/><br/>Fang Wang smiled, dropped a word, and turned to leave, “Senior Brother, I’ll pass on the Celestial Sword Intent to you later; if you run, you’ll miss out.”<br/><br/>Upon hearing this, Song Jinyuan’s face showed anticipation; he had long wanted to learn the Celestial Sword Intent, but the Sword Saint thought he wasn’t qualified.<br/><br/>Fang Wang approached Gu Tianxiong.<br/><br/>Gu Tianxiong stood by the lake, watching him come over, and couldn’t help but smile, “Having inherited from the Sword Saint and slain the Great Demon King, Fang Wang, your reputation will resound even more. From now on, you’re not just the number one genius of Da Qi, but one of the strongest cultivators in the Da Qi Cultivation Realm!”<br/><br/>Hundreds of cultivators were watching; the news couldn’t be hidden, nor did Fang Wang wish to hide it.<br/><br/>Who wouldn’t want to achieve a fame that resounds throughout the world?\t\t\t\t\t\t</div>", "images": {}, "success": true}