{"id": 85, "url": "https://www.novelhall.com/i-became-an-immortal-on-mortal-realm-32879/14281605.html", "title": "Chapter 85 - Chapter 85: Chapter 82 Are You Convinced?_L", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 85 - Chapter 85: Chapter 82 Are You Convinced?_L</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 85: Chapter 82 Are you convinced?_l<br/><br/>Translator: 549690339<br/><br/>The voice of Kong Xi from the Sword Sect reverberated in the skies above<br/><br/>Sword Heaven Marsh, and every cultivator who heard it was deeply moved.<br/><br/>Gu Tianxiong and Gu Li stood by the corridor, looking up at the figure of Kong Xi in the distance. Gu Li bit her lip and said in a low voice, “How shameless to talk such hypocritical words. If you want to fight, fight. What’s the use of speaking such falsehoods?”<br/><br/>Gu Tianxiong’s eyes were complex as he sighed and said, “He’s trying to clear the name of the Suspended Vast Sword Sect and himself, but these words may also be from the bottom of his heart.”<br/><br/>The torment of the Spirit Treasure rank is something that the vast majority of cultivators have experienced, even if one is the most talented of the current era, eventually there will be higher ranks to challenge.<br/><br/>When you look up to others, you might resign yourself to fate, yet when you are surpassed by others, it’s unbearable to be bound by fate, and the deeper you fall, the more painful it becomes.<br/><br/>The disciples of the Fang Family were indignant.<br/><br/>“Nonsense, if Fang Wang really was that fortunate, would our family have nearly been exterminated?”<br/><br/>“Exactly, if it weren’t for Fang Wang, we would have been dead by now.”<br/><br/>“This old scoundrel is deceiving the masses, he can’t stand losing!”<br/><br/>“What’s Fang Wang doing? Defeat him quickly, let strength do the talking!”<br/><br/>Fang Meng and Fang Yin didn’t make a sound, their eyes fixated on the figure of the elder from the Sword Sect, filled with complex emotions.<br/><br/>For them, Kong Xi was their senior by countless generations, and yet such a figure was provoked to such an extent by their junior, it seemed they had underestimated the impact of the Heaven Yuan Spirit Treasure on the Cultivation Realm.<br/><br/>At the peak of the high mountain, Kong Xi leaped into the air, swiftly flying to the space above the center of Sword Heaven Marsh. Terrifying sword qi burst forth from within him, causing his black clothing to flutter even more fiercely, like a dark flame burning mightily in the sky.<br/><br/>Behind him, magic swords rose up, twelve in total, arranged in a circle. A continuous stream of sword qi gushed from the blades, forming visible energy waves that expanded outwards, a spectacular sight to behold.<br/><br/>Cultivators from every corner of Sword Heaven Marsh could see his sword qi, feel the momentum of his sword, and all were astonished.<br/><br/>The aura surpassing the Profound Heart Realm had completely erupted!<br/><br/>In this moment, Kong Xi from the Sword Sect made no attempt to hide his skill. He sought to face Fang Wang in his strongest state.<br/><br/>“Fang Wang, be careful!”<br/><br/>Fang Hanyu looked ahead at Fang Wang, admonishing him. Even with the Sword Qi he received from the Sword Saint, against the head of the Sword Sect, he still felt pressure, and he was certainly no match for him.<br/><br/>Not to mention Song Jinyuan, his gaze fixed on Fang Wang, eyes brimming with anticipation.<br/><br/>More than anyone else, he hoped that Fang Wang would win; as long as Fang Wang remained undefeated, losing to him would not seem so strange.<br/><br/>Moreover, this was Fang Wang’s first battle after inheriting the title of Sword Saint, he could not afford to lose!<br/><br/>Fang Wang leaped into the air, rising like a shooting arrow. He flew to the same height as Kong Xi, his white robes billowing, holding a black folding fan with effortless grace.<br/><br/>The two of them were a contrast in black and white!<br/><br/>The gazes of thousands of cultivators were concentrated on them. No one shouted; all held their breath, waiting tensely for the great battle to erupt at any moment.<br/><br/>Kong Xi looked at Fang Wang, feeling sentimental, “It really is true that heroes emerge from the youth. If you had been born five hundred years earlier, then the Sword Saint would have been overshadowed by you.”<br/><br/>Fang Wang gently waved his Qiankun Fan, calmly saying, “Being in the same era as me shouldn’t be a source of sorrow, but rather, a fortune. It is only in an era where heroes abound that an era can be truly magnificent, and every magnificent era must have a target for all the heroes of the world. Come then, let me experience the honor of the Sword Sect.”<br/><br/>His voice, carried by the Celestial Sword Intent, spread to every corner of Sword Heaven Marsh. Confronted by Kong Xi’s psychological warfare, he couldn’t be bothered to explain, merely displaying his confidence instead.<br/><br/>He was determined to rise irresistibly, making sure no one dared to consider resisting him!<br/><br/>The moment his words fell, Fang Wang forcefully swung his fan. A barrage of treasured swords flew out from his storage bag, even the Qingjun Sword at his waist was swiftly unsheathed.<br/><br/>A total of seventy-two superior magic swords surrounded Fang Wang, arrayed in layers, an even greater setup than that of Kong Xi.<br/><br/>“Could it be…?”<br/><br/>Greedy Sleeper became excited, his old face flushed red, his lips quivering.<br/><br/>Zhao Chuanqian seemed to realize something, his pupils widening at the thought.<br/><br/>The other disciples stared intently at the two figures in the sky, fearful of missing anything.<br/><br/>Kong Xi eyed Fang Wang’s formidable array, frowning. He spoke in a deep voice, “Then let this lord experience the Sword Sect’s best technique!”<br/><br/>Fang Wang’s lips curled slightly, as he fanned himself and chuckled, “The Sword Dao of the Sword Saint never takes lives; I do not wish to sully my master’s name. Thus, the technique I am using is the supreme technique of the Tai Yuan Sect — it’s called the Nine Heavens Azure Thunder Sword Formation!”<br/><br/>His voice, full of confidence, spread throughout Sword Heaven Marsh. Many cultivators were moved, and the disciples from the Tai Yuan Sect were especially invigorated.<br/><br/>The Nine Heavens Azure Thunder Sword Formation was the Tai Yuan Sect’s strongest and most difficult supreme technique, and Fang Wang had mastered<br/><br/>“Indeed it is! Indeed it is! Hahaha!”<br/><br/>Greedy Sleeper stood up, laughing heartily. As he got to his feet, several hundred Tai Yuan Sect disciples followed suit.<br/><br/>It wasn’t just them. Other cultivators who had heard of the Nine Heavens Azure Thunder Sword Formation rose to their feet or took a step forward, all gazing up at Fang Wang.<br/><br/>On hearing this, Kong Xi became furious, “Not killing lives? Ridiculous! Just like the Sword Saint humiliated me in the past! Then let me force you to display the supreme technique of the Sword Saint!”<br/><br/>Boom!<br/><br/>His Sword Intent erupted, all twelve magic swords trembling, emitting a burst of azure light. Kong Xi’s right hand formed a sword, and he thrust it toward Fang Wang. The twelve magic swords simultaneously released azure Sword Qi. In an instant, the firmament turned azure, the azure light illuminating the faces of everyone there, highlighting their expressions.<br/><br/>The vast expanse of azure Sword Qi, like a celestial river crossing the sky, charged unstoppably at Fang Wang.<br/><br/>Fang Wang remained unfazed. With his right hand holding the Qiankun Fan in a reverse grip, he suddenly lifted the fan and swung it.<br/><br/>The Qiankun Fan burst forth with an endless stream of Solaris True Fire, whipping up a terrifying fiery wind that engulfed the Sword Qi of Kong Xi head-on.<br/><br/>With a powerful leap, Kong Xi dodged the sea of fire. The tyrannical fiery wind continued its path towards the opposing mountain and directly ignited the mountaintop, causing the mountain to tremble, dust to rise, and rocks to be violently ejected.<br/><br/>Kong Xi glanced back and was secretly alarmed. Then he turned his head to look at Fang Wang, and to his horror, he realized that the Nine Heavens Azure Thunder Sword Formation had already been activated. Thousands of Azure Thunders were interwoven around Fang Wang, and the seventy-two high-grade magic swords were forming three Sword Circles, gathering an immense terror.<br/><br/>Fang Wang gazed at Kong Xi from a distance, his eyes suddenly changed, and an indescribable sense of oppression burst forth from within him.<br/><br/>True Combat Technique!<br/><br/>At this moment, he had entered an absolutely focused state of combat, condensing the Nine Heavens Azure Thunder Sword Formation at the fastest speed, with surging Spiritual Power connecting to the seventy-two high-grade magic swords.<br/><br/>As his gaze locked onto Kong Xi, the Nine Heavens Azure Thunder Sword Formation erupted instantaneously!<br/><br/>Boom! Boom! Boom…<br/><br/>Massive Sword Qi, mingled with Azure Thunder, shot towards Kong Xi, with an immense momentum and a sword light that dazzled heaven and earth.<br/><br/>Grinding his teeth, Kong Xi pressed forward instead of retreating. His right hand reached back to grasp a sword hilt and swiftly brandished his sword. Ten thousand Sword Qis erupted, with the eleven magic swords behind him also following the motion. It was as if an invisible swordsman was wielding them, the moves sharp, and the Sword Qi swept over like a fierce storm.<br/><br/>With a loud boom echo that shook heaven and earth!<br/><br/>Kong Xi dispersed the first wave of Azure Thunder Sword Qi, but the Azure Thunder entwined around his body, numbing his limbs and drastically changing his complexion.<br/><br/>“How is this possible!”<br/><br/>A great alarm rose in Kong Xi’s heart, his face showing a look of terror.<br/><br/>The Azure Thunder had directly dispersed two-tenths of his Spiritual Power!<br/><br/>He immediately turned to flee, but countless Azure Thunder Sword Qis traced arcs in the sky, pursuing him relentlessly.<br/><br/>As Kong Xi turned around, he flew backward while swiftly swinging his sword. The eleven magic swords did the same. Using all his strength and displaying his strongest swordsmanship, the Sword Qi that once reigned supreme in the Da Qi Cultivation Realm landed on the Azure Thunder Sword Qi, but it was completely incapable of dispersing it.<br/><br/>All the cultivators widened their eyes, engulfed in shock.<br/><br/>The Sword Sect was being suppressed in a confrontation?<br/><br/>Their gaze followed Kong Xi as he retreated at high speed, causing them to turn their heads as well.<br/><br/>Boom! Boom! Boom…<br/><br/>Successive roars erupted above Sword Heaven Marsh, the speed of the Azure Thunder Sword Qi was simply too fast. Kong Xi had traversed most of the distance across Sword Heaven Marsh but was still caught by the Azure Thunder Sword Qi.<br/><br/>All the Azure Thunder Sword Qi suddenly converged into a vast sword shadow intertwined with lightning, ten Zhang in length, resembling a celestial sword soaring upward. Then it dove down at a speed far surpassing before, its blade aimed at Kong Xi.<br/><br/>Kong Xi had exhausted all his Spiritual Power and had no chance to dodge.<br/><br/>Under the gaze of thousands of cultivators, the mighty sword carrying Heavenly Might descended from the Firmament, forcefully striking Kong Xi, pressing him down as he fell, and landing in the woods surrounding Sword Heaven Marsh.<br/><br/>Boom!<br/><br/>A deafening explosion erupted, a fierce wind suddenly arose, forcing the cultivators to channel their energies to resist. In their eyes, a massive surge of dust rose from the forest, with lightning flashing and thunder roaring, and even trees were flung into the air, displaying shocking destructive power.<br/><br/>Has the Sword Sect died?<br/><br/>That was the thought of all the observers. Who could survive such an assault?<br/><br/>Sword Heaven Marsh fell into silence, only the rumbling of thunder around Fang Wang continued to resound. At this moment, he stood proudly in the sky, with the Nine Heavens Azure Thunder Sword Formation surrounding him, making him appear like the lord of thunder descending upon mortals.<br/><br/>Lightning gleamed; Fang Wang stood tall and resolute, his expression stern.<br/><br/>More and more cultivators shifted their focus to him, the seventy-two high-grade magic swords encircling him like divine attendants—a scene so profound, it profoundly stirred the cultivators, etching this moment forever in their memories.<br/><br/>Gu Li’s eyes filled with wonder as she looked at Fang Wang; beside her, Gu Tianxiong was stupefied. This was his second time witnessing Fang Wang fight, and yet he was still shaken.<br/><br/>He couldn’t understand how such a figure could exist in the world!<br/><br/>Celestial Sword Intent, Divine Nurturing Sword Qi had already been mastered to great completion by him. And now, he could easily wield the Tai Yuan Sect’s most challenging Nine Heavens Azure Thunder Sword Formation!<br/><br/>And he has only been cultivating for sixteen years!<br/><br/>Fang Wang raised his left hand and stretched it forward, his right hand formed into a claw. With a gesture in the air, a figure suddenly flew out from within the rolling dust in the distance.<br/><br/>It was none other than Kong Xi, now blackened by scorching, dripping with blood, with a chest impaled by one of his own magic swords, the hilt facing Fang Wang.<br/><br/>His appearance once again drew everyone’s attention.<br/><br/>Thousands of cultivators watched as he flew towards Fang Wang, the hilt upon his chest landing in Fang Wang’s hand. At first glance, it seemed as if Fang Wang had skewered Kong Xi with the sword, with Kong Xi’s limbs hanging limply, his body trembling, devoid of his former grandeur.<br/><br/>The Sword Sect suffered a crushing defeat!<br/><br/>The spectators of this battle shared a single sentiment.<br/><br/>Kong Xi was no match for Fang Wang!<br/><br/>If they didn’t know their identities, they might have thought Fang Wang was overpowering Kong Xi with a higher realm.<br/><br/>Fang Wang slightly raised his chin, looking down on the impaled Kong Xi with a fading glint of cold in his eyes. He asked quietly, “Do you concede?”<br/><br/>These three words, accompanied by Celestial Sword Intent, echoed across Sword Heaven Marsh, like continuous thunder, resonating without end..\t\t\t\t\t\t</div>", "images": {}, "success": true}