{"id": 83, "url": "https://www.novelhall.com/i-became-an-immortal-on-mortal-realm-32879/14280948.html", "title": "Chapter 83 - Chapter 83: Chapter 80 The Treasure Of The Da Qj Cultivation Realm, A Tale For The Ages_L", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 83 - Chapter 83: Chapter 80 The Treasure Of The Da Qj Cultivation Realm, A Tale For The Ages_L</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 83: Chapter 80 The Treasure of the Da Qj Cultivation Realm, A Tale for the Ages_l<br/><br/>Translator: 549690339<br/><br/>“His Heaven Yuan Spirit Treasure is impressive, but is the Cultivation World truly dominated by the grade of Spirit Treasures? Since ancient times, has everyone who achieved immortality possessed a Heaven Yuan Spirit Treasure?<br/><br/>I hardly think so!”<br/><br/>Xu Qiuming spoke calmly, not provoked by Kong Xi’s words.<br/><br/>Kong Xi revealed a smile, but it was one of mockery. He snorted, “You’re still young and utterly unaware of what the grade of a Spirit Treasure means. It represents fate itself. Granted, the world offers opportunities and the chance at immortality, and to some extent, opportunity is more important. However, that’s only for those who cannot live forever. Opportunity merely allows them the luxury of a better life within the confines of their limited lifespans. But what’s the point of pursuing cultivation if not to seek immortality?”<br/><br/>“Whether Earth Origin Spirit Treasures can lead to immortality, I do not know.<br/><br/>Heaven Yuan ones may or may not, but since it’s unclear, I must make a move. If Fang Wang achieves immortality and becomes the Sect Leader of Great Abyss Gate, do you think the Suspended Vast Sword Sect and the Nine Great Sects will still exist?”<br/><br/>Xu Qiuming’s expression subtly changed. Looking at it from the perspective of the Suspended Vast Sword Sect, such actions were indeed justified.<br/><br/>And yet…<br/><br/>Through gritted teeth, Xu Qiuming said, “Please, Uncle-Master, give me a chance. I will prove myself to be no weaker than Fang Wang!”<br/><br/>Pride was in his nature, and although Fang Wang’s rise had shocked him, he felt more anticipation and motivation. Setting aside Xu Tian Jiao’s life-saving favor, he too wished to have an open and fair competition with such an adversary.<br/><br/>Kong Xi closed his eyes and said, “This is something only I can do. Your master certainly can’t. Leave now, my mind is made up.”<br/><br/>Xu Qiuming frowned deeply, struggled for a moment, but ultimately departed.<br/><br/>He decided to go directly to his master and let him make the final decision.<br/><br/>Ever since he learned that Kong Xi of the Sword Sect had challenged him, Fang Wang noticed that cultivators came every day.<br/><br/>Fortunately, the weakest cultivators who made it to Sword Heaven Marsh were at least at the Soul Sculpting Realm. These cultivators had transcended the need for food and wouldn’t pollute his Sword Heaven Marsh.<br/><br/>Indeed, he now considered Sword Heaven Marsh as his own, and so did everyone else. Song Jinyuan and the Sword Servants were all loyal to Fang Wang alone.<br/><br/>Unbeknownst to them, it wasn’t that the Sword Saint couldn’t teach; the Sword Saint had long since covered the lake with Celestial Sword Intent for them to decipher, but they simply lacked the insight.<br/><br/>However, Fang Wang’s mastery of Celestial Sword Intent had reached Great Perfection, surpassing the Sword Saint’s understanding. His teachings of the Celestial Sword Intent allowed others to perceive much more.<br/><br/>Days passed one after another.<br/><br/>The number of cultivators at Sword Heaven Marsh grew, and looking along the lakeside, the figures of cultivators were everywhere. The Sword Servants marked a three-mile radius around where Fang Wang lived, not allowing other cultivators to approach.<br/><br/>There were a total of one hundred and twenty-three Sword Servants, the weakest among them being the sixth layer of Soul Sculpting Realm, and the strongest at the fourth layer of Profound Heart Realm. When these people came together, they formed a formidable force, enough to stabilize the situation.<br/><br/>Fang Hanyu and Song Jinyuan led the Sword Servants on ordinary days,<br/><br/>managing the affairs of Sword Heaven Marsh, giving Fang Wang plenty of leisure to cultivate daily and occasionally fish.<br/><br/>Four months passed in the blink of an eye.<br/><br/>The number of cultivators in Sword Heaven Marsh had surpassed a thousand, including members from all the major sects, and even the Li Family had come.<br/><br/>Li Hongshuang and Li Honggang of the Li Family visited Fang Wang in person and proactively offered apologies.<br/><br/>Turns out, the White Garment Astonishing Swan’s identity could no longer be hidden. Primarily because Fang Wang’s reputation was too great. Even the disciples within Great Abyss Gate were frantically investigating his background, and news spread quickly. The Li Family was not angry, only fearful.<br/><br/>The Li Family head, Li Qingfeng, stood behind Fang Wang with a sincere apology and a humble attitude.<br/><br/>Without turning around, Fang Wang said, “Since the Li Family had already expelled Li Hongshuang from the family records, that naturally has nothing to do with the Li Family. As for Li Honggang, to be honest, I hold him in high regard. There’s no resentment, as a father defending his son is only natural. Rest assured, I hold no grudge against the Li Family.”<br/><br/>Li Qingfeng breathed a sigh of relief. Although he was at the second layer of<br/><br/>Profound Heart Realm, he felt an immense pressure standing behind Fang Wang, and even the purple snake coiling around the wooden stake made him shiver.<br/><br/>In his eyes, Fang Wang was not just a Heaven Yuan genius but compared to a Condensation Spirit Realm’s peerless strongman!<br/><br/>“Young Master Fang, this is a small token from the Li Family, please pass it on to the Fang Family. The Li Family wishes to forge good relations with the Fang Family,” Li Qingfeng said earnestly, presenting a storage bag with both hands.<br/><br/>Fang Wang raised his hand, and the storage bag automatically flew into his grasp, a move that inwardly startled Li Qingfeng.<br/><br/>He could not sense any of Fang Wang’s Spiritual Power.<br/><br/>“I thank you on behalf of the Fang Family. You may settle down with your people. It will be good to watch my battle with the Sword Sect,” Fang Wang said softly as he put away the storage bag.<br/><br/>Li Qingfeng immediately bowed and then turned to leave.<br/><br/>This was not the only episode involving the Li Family. The combination of a Heaven Yuan Spirit Treasure and the power to slay the Great Demon King attracted many clans and sects, who came to seek goodwill with Fang Wang and the Fang Family.<br/><br/>As for the battle with the Sword Sect, although they couldn’t predict who would win or lose, becoming friendly with Fang Wang beforehand was certainly beneficial.<br/><br/>They all believed that Fang Wang would not perish; even if he suffered a<br/><br/>crushing defeat, someone powerful would likely step in on his behalf. This was a Heaven Yuan Spirit Treasure, after all, and no one knew to what heights he could ascend. However, one opinion was spreading through the Cultivation World.<br/><br/>Fang Wang was the treasure of the Da Qi Cultivation Realm!<br/><br/>As long as Fang Wang lived, the Condensation Spirit Realm would no longer be the pinnacle of the Da Qi Cultivation Realm!<br/><br/>Of course, this was the view of lower-level cultivators. The bigger sects were more concerned that he might overturn the established order of the Cultivation World.<br/><br/>As the battle with the Sword Sect drew nearer, more and more noble families came to visit Fang Wang. Two of the Nine Great Sects on the side of the righteous path came and even provided him with information about Kong Xi.<br/><br/>Kong Xi had already achieved the Condensation Realm, and not just recently broken through!<br/><br/>Fang Wang was not surprised by this fact. After all, it was he who had slain the Great Demon King, and now those who dared to come were naturally at the Condensation Realm.<br/><br/>With only a month left until the battle with the Sword Sect, Sword Heaven Marsh had become bustling with activity; the lake surface was dotted with figures comprehending the sword, while the lakeshore was thronged with figures from various powers.<br/><br/>One day, Fang Hanyu arrived with a group of people in tow.<br/><br/>Fang Wang seemed to sense something, opened his eyes hurriedly, and stood up.<br/><br/>He saw his grandfather Fang Meng, his father Fang Yin, and a host of clan members approaching, over twenty people in total.<br/><br/>“Wang’er!”<br/><br/>Fang Yin called out to Fang Wang with joy upon seeing him.<br/><br/>Fang Wang immediately flashed over to them and asked with a smile,<br/><br/>“Grandfather, Father, what brings you here?”<br/><br/>Stroking his beard, Fang Meng replied, “My grandson is about to fight the<br/><br/>Sword Sect; how could I not come?”<br/><br/>“Exactly, the news has spread all over now. Our Fang Family has been in the Cultivation World for many years; naturally, we’d get the news. You little rascal, you haven’t come home in almost sixteen years. Have your wings grown too strong?”<br/><br/>Fang Yin continued, his eyes widened in a seemingly angry manner, but before Fang Wang could respond, Fang Meng scoffed coldly, saying, “What do you know? My grandson pursues immortality; how can he be delayed by you?” Fang Yin gave an awkward smile and could only nod in agreement.<br/><br/>The other family members greeted Fang Wang one after another, and many of their faces were unfamiliar to him, mainly because he had forgotten them, so he could only nod with a smile.<br/><br/>Seeing that Fang Wang, whose name now reverberated throughout the<br/><br/>Cultivation World, was still so polite, everyone felt their pressure lessen.<br/><br/>“Your father has inherited my title as Duke, so you are now the heir apparent. Of course, this status is not important to you; I’m just telling you that the royal court is also very warm towards the Fang Family, probably because the Great Abyss Gate has made its move,” Fang Meng said with a smile.<br/><br/>Having not seen him for many years, he seemed much sturdier and there was a fluctuation of Spiritual Power within his body.<br/><br/>Fang Wang asked in surprise, “Why didn’t you let Uncle Shi take the title of<br/><br/>Duke?”<br/><br/>The son of Uncle Fang Shi laughed and said, “My father is busy with his cultivation. Letting Fifth Uncle become the Duke has rather troubled him instead.”<br/><br/>Fang Yin shook his head and said, “My talent is average. Zhou Xue gave me numerous cultivation resources for your sake, but still, I cannot match your uncles. Why force it?”<br/><br/>At this point, Fang Wang didn’t know what to say.<br/><br/>Could he tell his father that he surely wasn’t lacking since he himself had exceptional talent?<br/><br/>He relied on the Heavenly Palace…<br/><br/>“Alright, now that we’ve greeted each other it’s enough. Continue with your cultivation, my good grandson, and after the big battle is over, your grandfather wants to talk to you alone,” Fang Meng cheerfully said to Fang Wang. After speaking, without waiting for Fang Wang’s response, he urged his children and grandchildren to leave.<br/><br/>Fang Hanyu added, “I’ll see to their accommodation here.”<br/><br/>Fang Wang watched their retreating figures with warmth in his heart.<br/><br/>For the Fang Family members, it had only been almost sixteen years since they last saw each other, but for Fang Wang, it had been two thousand years.<br/><br/>The moment he saw Fang Yin, his heart was tumultuous, though he controlled it well.<br/><br/>“Having them by my side, what would another five hundred years in seclusion<br/><br/>matter?” Fang Wang thought to himself with boundless pride. As for the upcoming great battle, he had a firmer idea of what to do. He wanted to defeat Kong Xi with overwhelming force!<br/><br/>With not a hint of mercy!<br/><br/>He wanted to show the entire world just how powerful he, Fang Wang, was. Anyone thinking of provoking the Fang Family in the future, should first weigh whether they were worthy of offending him!<br/><br/>The bright sun shone down, and Sword Heaven Marsh, eternally springlike, continued to display a scenery as beautiful as a painting.<br/><br/>In front of a tall pavilion, Gu Li stood on the corridor, staring distractedly at the lake. She was dressed in the disciple robe of the Great Abyss Gate and wore a light veil over her face, which, although only revealing her eyes, still made her look exceedingly charming.<br/><br/>Gu Tianxiong walked out from the house and said, “Stop worrying. You haven’t seen that kid wield the Celestial Sword Intent. I tell you, if Kong Xi could see it with his own eyes, he definitely wouldn’t dare to challenge him.”<br/><br/>Gu Li didn’t look at him but just calmly gazed at the lake, saying, “I’m not worried he will lose; I’m just curious why you won’t let me see him. My presence wouldn’t delay him much.”<br/><br/>An awkward expression crossed Gu Tianxiong’s face as he feigned seriousness and said, “Daughter, he needs to be focused now, understand? Your presence would only add pressure to him. And even if it didn’t, it would create distractions, since you are on his mind after all.”<br/><br/>“Really?” Gu Li turned to look at him, her eyes filled with anticipation and nervousness.<br/><br/>Gu Tianxiong, thick-skinned, replied, “Of course. We used to hide our identities and address each other as brothers. He has told me that he likes the junior sister from the neighboring cave dwelling, but since they are both exceptionally talented, he doesn’t want to confirm the relationship too early, lest it affects their Dao hearts. Daughter, I think he’s right. You are both young and have plenty of time to be together. Hiding your emotions in pursuit of the Path of Immortality is the way to go.”<br/><br/>Gu Li frowned and asked, “Why didn’t you say this before?”<br/><br/>Gu Tianxiong sighed and said, “Who knew you would be so restless, daughter? I must criticize you; on this point, you’re far behind Fang Wang.. Can’t you be a bit more ambitious? He is a Heaven Yuan Spirit Treasure, but you are an Earth Origin Spirit Treasure, how bad can it be? Focus on cultivation, catch up to his pace, and you may create an eternal love story!”\t\t\t\t\t\t</div>", "images": {}, "success": true}