{"id": 86, "url": "https://www.novelhall.com/i-became-an-immortal-on-mortal-realm-32879/14281606.html", "title": "Chapter 86 - Chapter 86: Chapter 83: In This Life, Never Compete With Him! 1", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 86 - Chapter 86: Chapter 83: In This Life, Never Compete With Him! 1</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 86: Chapter 83: In this life, never compete with him! 1<br/><br/>Translator: 549690339<br/><br/>Are you convinced?<br/><br/>These three words, like a heavy hammer, struck the hearts of thousands of cultivators, who had already forgotten the inciting words of Kong Xi, and were filled with endless admiration and excitement.<br/><br/>This battle, undoubtedly the strongest they had most of them had ever witnessed in their lives, was brief, but enough to be unforgettable for a lifetime.<br/><br/>Even the Fang Family members felt the same way, believing Fang Wang to be so powerful that he seemed unfamiliar, but this unfamiliarity did not deter them; instead, they felt only pride.<br/><br/>Fang Yin looked at his son’s figure, feeling an even deeper sense of emotion.<br/><br/>Oh heavens!<br/><br/>How did he sire such a prodigy?<br/><br/>Had Fang Wang not looked so much like him, he would have doubted his own life.<br/><br/>Fang Hanyu, Song Jinyuan, and the Sword Servants were swept with towering waves of emotion because at this moment, Fang Wang was the Sword Saint in their eyes.<br/><br/>Especially for Song Jinyuan, who had followed the Sword Saint for many years, Fang Wang’s posture at this moment was the very image of the Sword Saint to him, utterly identical.<br/><br/>At this moment, only one person couldn’t feel happy.<br/><br/>And that was Kong Xi from the Sword Sect.<br/><br/>Kong Xi was already at the end of his rope, his vision blurry, unable to see Fang Wang’s expression clearly, but he heard Fang Wang’s pressing question.<br/><br/>“Am I going to die…”<br/><br/>Fear filled Kong Xi’s heart, and he couldn’t care about anything else; never before had death felt so close to him.<br/><br/>In the past, his narrow escapes from death were all due to his own strength, with conviction in his heart, but in today’s battle, his confidence was completely shattered. At this moment, the sect, reputation, jealousy, and all were cast aside from his mind.<br/><br/>After cultivating for hundreds of years, finally reaching the pinnacle of the Da Qi Cultivation Realm, was he truly going to stop here?<br/><br/>Fear uncontrollably sprung up in Kong Xi’s heart; he did not want to die!<br/><br/>“I concede…”<br/><br/>Kong Xi replied with difficulty as Fang Wang deliberately used the Celestial Sword Intent to amplify his voice so that all the cultivators heard him, even if it was just one word, it was enough to exhilarate all the cultivators.<br/><br/>Boom!<br/><br/>Sword Heaven Marsh was utterly astir!<br/><br/>“So strong! Is this the Heaven Yuan Sword Saint?”<br/><br/>“I’ve never seen the Sword Saint’s grace, but I think Fang Wang is already a true<br/><br/>Sword Saint.”<br/><br/>“I feel like Fang Wang showed mercy!”<br/><br/>“Indeed, if it were a battle to the death, the Sword Sect would already be dead. To speak truthfully, the Sword Sect picking on the younger was already disgraceful, and prior to the fight, he used those words meant to strike at the heart; the fact that Fang Wang let him live already shows great magnanimity and the demeanor of a grandmaster. Compared to the Sword Saint, the difference is clear!”<br/><br/>“What Sword Sect, that’s all they amounted to. For the next eight hundred years, the name of Da Qi should be Fang!”<br/><br/>The cultivators from all sides discussed animatedly, holding no grudges against Fang Wang and naturally feeling happy to witness the rise of such an exceptional figure.<br/><br/>After this battle, Fang Wang was destined to become one of the Great Cultivators at the pinnacle of the Da Qi Cultivation Realm, with power enough to shake the world.<br/><br/>And most importantly, he was still very young!<br/><br/>Fang Wang, upon hearing Kong Xi’s words, gave a slight smile, turned around and flew towards the lake, a series of top-quality magic swords successively entering his storage bag, the mountain peaks in the distance still ablaze, a symbol that this battle had indeed taken place.<br/><br/>Fang Wang had originally intended to kill the member of the Sword Sect, but upon thinking about the cordial relations between the Great Abyss Gate, Suspended Vast Sword Sect, and the fact his own Fang Family was behind him, he left a survivor. Besides, the Sword Sect’s survival was proof of his strength.<br/><br/>Dead men bring only fear or hatred.<br/><br/>Fang Wang landed on the bridgehead, and Song Jinyuan immediately ordered the Sword Servants to take Kong Xi for treatment.<br/><br/>Xiao Zi hopped onto Fang Wang’s shoulder and grunted, “My lord, why didn’t you just slay him outright?”<br/><br/>Fang Hanyu nodded; the murderous intent of the Absolute Heart Evil Eye could not be hidden by a mere cloth strip.<br/><br/>Song Jinyuan spoke up, “Killing him is as easy as flipping one’s hand, but why bother? After this battle, his sword heart is broken, no longer a threat. In the future, when other sects see him, they’ll remember his defeat at Fang Wang’s hands, and that serves as the best stepping stone.”<br/><br/>“My master became the Sword Saint precisely because those he beat still lived.<br/><br/>Everyone sang praises of his strength, and that is how he gained such renown.<br/><br/>Now think about the Sect Leaders of Suspended Vast Sword Sect and the Great Abyss Gate, they are powerful, they’ve killed many, but can they compare to the Sword Saint?”<br/><br/>This speech left Fang Hanyu and the Sword Servants in deep thought.<br/><br/>Fang Wang smiled, finding this elder brother Song quite interesting.<br/><br/>“I didn’t kill him simply because he abided by the rules, promised a year and gave a year, and didn’t set up an ambush. This doesn’t mean I don’t kill; I’m the Sword Saint’s Successor, but I won’t become the kind of Sword Saint that he was. ‘To stop killing with killing, that is my true path,’ ” Fang Wang said with a smile.<br/><br/>He had killed many; he didn’t have a non -killing creed. Not slaying the member of the Sword Sect was merely for the greater situation at hand.<br/><br/>Upon hearing this, Song Jinyuan frowned slightly, wanting to say something but then felt that Fang Wang made sense. Sometimes killing was indeed necessary; he had seen too many spared by the Sword Saint who returned, unreformed and unappreciative.<br/><br/>Just then, a group of cultivators approached, the disciples of the Suspended Vast Sword Sect, among them one was Xu Qiuming.<br/><br/>Xu Qiuming was too ashamed to face Fang Wang and didn’t dare to look him in the eye, primarily because Fang Wang had already forgotten about him.<br/><br/>This group of cultivators received the barely alive Sword Sect from the hands of the Sword Servants.<br/><br/>The blood -covered sect leader of the Sword Sect struggled to raise his head, looking at Xu Qiuming, he trembled, “In this life… one must never compete with him… never…”<br/><br/>Tears of old age unexpectedly streamed from his eyes, followed by him fainting.<br/><br/>Xu Qiuming’s mind was deeply shaken. He had witnessed the great battle with his own eyes and felt that he was no match for Fang Wang. Now hearing his proud and willful uncle utter such words, it intensified the shock in his heart.<br/><br/>Since he began his path of cultivation, he had been the genius that everyone looked up to. The Suspended Vast Sword Sect coddled him, and even when Lu Yuanjun appeared out of nowhere, the sect still held full confidence in him. He had lived up to expectations and never disappointed anyone.<br/><br/>But now…<br/><br/>A genius named Fang Wang had stormed into his world with an extremely domineering presence. Ever since the Heaven Yuan Spirit Treasure became known, all the talk around him had been about Fang Wang’s feats. Although no one directly compared him with Fang Wang to his face, he knew that nobody saw them as equals; they weren’t on the same level of genius. That’s why deep inside, he actually felt unreconciled; he wanted to diligently cultivate and defeat Fang Wang fairly and squarely.<br/><br/>But seeing Kong Xi’s terrible state and thinking about his words, Xu Qiuming’s heart fell into an unprecedented state of confusion.<br/><br/>Sword Heaven Marsh erupted into clamor as the people from Fang Residence and the Tai Yuan Sect Disciples quickly arrived, surrounding Fang Wang.<br/><br/>“It’s good that you didn’t kill Kong Xi. If you had, there would be a rift between the Tai Yuan Sect and Suspended Vast Sword Sect,” Zhao Chuanqian remarked admiringly.<br/><br/>Greedy Sleeper said disdainfully, “If he had killed him, so what? Would the Suspended Vast Sword Sect have dared to say anything? It was they who caused the trouble!”<br/><br/>Zhou Bo exclaimed excitedly, “Brother Fang is mighty! He’s not far from becoming the number one under heaven now!”<br/><br/>Fang Yin looked at his son being revered by his fellow disciples, his face bursting with proud smiles.<br/><br/>Meanwhile, some cultivators had already started to leave, all of them spies eager to bring back news of the battle’s outcome as swiftly as they could. Yet each person had a complex expression upon departing.<br/><br/>Having witnessed the battle, they knew that Fang Wang was unstoppable and didn’t need the Tai Yuan Sect’s protection. He had become one of the most formidable Great Cultivators in Da Qi that no one dared provoke!<br/><br/>By the lakeside, along the corridor,<br/><br/>Gu Tianxiong sighed, “My daughter, practice well. I don’t ask that you catch up to him, but at the very least, when compared to other women in the Cultivation World, you shouldn’t be unworthy of him. If you can become the strongest female cultivator in the Cultivation World, even if you are far less than him, you’re the only one who could be a match for him.”<br/><br/>After this battle, he genuinely felt that his daughter wasn’t worthy of Fang Wang.<br/><br/>Not to mention his daughter, he estimated that even the Tai Yuan Sect couldn’t retain Fang Wang!<br/><br/>Such a figure would undoubtedly not be confined to the Da Qi Cultivation Realm!<br/><br/>Gu Li nodded, although silent, her eyes betrayed that her heart was anything but calm.<br/><br/>It wasn’t until deep into the night that Sword Heaven Marsh finally regained its usual tranquility.<br/><br/>Inside a pavilion,<br/><br/>Fang Wang sat opposite his grandfather, Fang Meng, both savoring tea. Fang Meng looked at his grandson with increasing pride, his heart overwhelmed with indescribable emotions.<br/><br/>Ever since his sons had grown up, Fang Meng was always worried, feeling they were unable to carry on the great enterprise. And with the grandsons still too young, that was why he was reluctant to relinquish his Duke title.<br/><br/>Who could have expected the Fang Family would produce someone like Fang Wang?<br/><br/>It wasn’t just about holding up the Fang Residence; even the imperial authority seemed trivial in front of Fang Wang!<br/><br/>The thought of the Fang Family possibly producing an Immortal filled Fang Meng’s heart with elation, nearly floating to the heavens.<br/><br/>Fang Wang broke the silence, “Grandfather, what is it that you wanted to talk to me about?”<br/><br/>Fang Meng came back to his senses and smiled, “There are two things. One is about your marriage with Zhou Xue. Even if you two don’t want to marry just yet, the matter can be settled based on the parents’ agreement for now.”<br/><br/>Fang Wang quickly said, “Grandfather, I might not always stay in the Fang Family in the future. I don’t want to settle down. My ambition is to travel the world, of course, I won’t forget my home and will find time to return. Let the other family members handle the matter of continuing the family line.”<br/><br/>Fang Meng glared at him and said, “Who said I want to cage you? Who dares cage you? I’m the first one who won’t agree to that. Whatever you want to do in the future, I’ll support you. But Zhou Xue obviously has a master behind her. The Fang Family owes her a lot for our current prosperity. Yet at the end of the day, she is a woman. If you don’t step up, can you ensure she will remain unmarried for life? If she marries someone else, can you guarantee her heart will still belong to the Fang Family? Even if the Fang Family shouldn’t confine her, as time passes, she will eventually become a stranger.”<br/><br/>“I would certainly not force the issue, but I hope you will try at least to show some intention, letting Zhou Xue know you are thinking about it. If she isn’t willing, I won’t force her either. She will always be a benefactor to the Fang Family. Your uncle has written to ask her, and she said it’s all up to you. Han Yu also mentioned to me, Zhou Xue certainly likes you, you, my boy, are too arrogant and self-righteous!”<br/><br/>“Listen to your grandfather. A man having three wives and four concubines is quite normal, but the position of the principal wife cannot rely solely on personal preference. Feelings are temporary, suitability is more important.<br/><br/>Zhou Xue is the best partner for you!”<br/><br/>Fang Wang opened his mouth, filled with bewilderment.<br/><br/>Zhou Xue truly liked him?<br/><br/>But it didn’t seem like it!<br/><br/>Great!<br/><br/>This was passing the buck!<br/><br/>Throwing the problem onto him.<br/><br/>Fang Wang immediately said, “If that’s the case, then I agree. I’ll find an opportunity to make my intentions clear to her. If she refuses, it’s not my fault. We, the Fang Family, act openly and aboveboard, we cannot bully her. If she’s unwilling, we can’t force her.”<br/><br/>Fang Meng stroked his beard and smiled, “Of course..”\t\t\t\t\t\t</div>", "images": {}, "success": true}