{"id": 84, "url": "https://www.novelhall.com/i-became-an-immortal-on-mortal-realm-32879/14280953.html", "title": "Chapter 84 - Chapter 84: Chapter 81: The One Favored By The Heavens, The Struggle Of Fate (Third Update)_L", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 84 - Chapter 84: Chapter 81: The One Favored By The Heavens, The Struggle Of Fate (Third Update)_L</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 84: Chapter 81: The One Favored by the Heavens, The Struggle of Fate (Third Update)_l<br/><br/>Translator: 549690339<br/><br/>After much persuasion by Gu Tianxiong, Gu Li finally made up her mind not to disturb Fang Wang. She turned around, entered the attic, and prepared to cultivate.<br/><br/>Gu Tianxiong sighed in relief, thinking to himself that was a close call.<br/><br/>His spur-of-the-moment idea turned out to be ingenious.<br/><br/>Um!<br/><br/>Just like that, he would urge his daughter to focus more on cultivation in the future and prevent her from contacting Fang Wang.<br/><br/>“Dear daughter, in the matter of pursuing a husband, your father will assist you, but for now, keep away from him. After all, Fang Wang has no such thoughts about you; it will only spare you the heartache.” Once Gu Tianxiong thought this, any guilt in his heart vanished, replaced by a sense of being moved.<br/><br/>Being a father who could go this far, truly there was no second one like him!<br/><br/>Gu Tianxiong turned and left, planning to go and talk to Fang Wang.<br/><br/>Matters of taking a wife or concubines could be put aside for now, but some assurances had to be obtained!<br/><br/>Elsewhere.<br/><br/>Fang Wang was sitting at the head of the bridge, stretching lazily. He sighed and wondered, “When will the Sword Sect come? The day should be arriving soon, right?”<br/><br/>Xiao Zi lay beside him, looking at the vast expanse of the lake, and replied, “Who knows? Maybe they got scared.”<br/><br/>If one looked closely, one might see a silhouette practicing swordplay in its snake eyes, its movements swift and nearly indistinct.<br/><br/>Fang Wang turned to look at Xiao Zi, reaching out to rub its serpent head.<br/><br/>In recent months, Xiao Zi had been rather well-behaved, becoming somewhat uncharacteristic of itself.<br/><br/>Fang Wang knew why, because it was immersed in comprehending the sword, a notion he found preposterous.<br/><br/>A serpent had a higher aptitude for the Sword Dao than Song Jinyuan?<br/><br/>It was indeed a serpent that could survive in the Great Saint’s Grotto-Heaven.<br/><br/>At that moment, Song Jinyuan approached the wooden bridge, walking up behind Fang Wang and stopping. He spoke, “Master’s divine sword still hasn’t been found.”<br/><br/>Sword Saint had passed on the Celestial Sword Intent to Fang Wang, and the Sword Qi was used to shape a Lifespirit Treasure for Fang Hanyu. He even gave his Storage Ring to Fang Hanyu, but the divine sword wasn’t inside the ring.<br/><br/>Before the Sword Saint passed away, most sword cultivators were drawn by the lure of his sword.<br/><br/>It was rumored that Sword Saint’s sword was a Superior Grade Spiritual Weapon with the most powerful force of the Sword Dao infused within it, attracting swordsmen from everyvvhere like ducks to water.<br/><br/>“If it can’t be found, let it be. The master surely had his reasons, and if it’s destined for us, it will naturally appear before us.”<br/><br/>Fang Wang was rather philosophical about it; with three Lifespirit Treasures of his own, he didn’t crave the Sword Saint’s sword.<br/><br/>“Hmm, these are the seventy-one Superior Grade magic swords you asked for.” Song Jinyuan nodded, then tossed a storage pouch into Fang Wang’s lap.<br/><br/>Fang Wang raised an eyebrow, asking, “So soon?”<br/><br/>Song Jinyuan said, “Most were gifts from various factions, organized by Fang Hanyu. After all, you’re the newly risen Sword Saint, and the treasures they present to you would naturally have to be swords. I’ve contributed two myself, and also had a number of Sword Servants go out to purchase a dozen or so more.”<br/><br/>The price of a Superior Grade Spiritual Weapon was no small sum.<br/><br/>Fang Wang was about to pull out Heavenly Materials and Earthly Treasures from his own Storage Ring when Song Jinyuan turned and walked away, leaving behind a remark:<br/><br/>“As the master of Sword Heaven Marsh and my junior, consider it a welcome gift from me. The Sword Servants are also grateful for your teachings on Sword Intent, so no need to reach for your Storage Ring.”<br/><br/>Fang Wang turned to look as Song Jinyuan took five steps before leaping up, riding a sword into the distant mountains.<br/><br/>He couldn’t help but smile; this senior brother was quite tsundere.<br/><br/>He murmured, “Xiao Zi, did you see that? That’s the advantage of having power. When will you set out to establish your own rule and gather Heavenly Materials and Earthly Treasures for your young master?”<br/><br/>“Forget it. I don’t have such abilitv. It’s better for me to stav bv vour side. If vou<br/><br/>ever get bored, you can always play with me,” Xiao Zi replied nonchalantly, causing Fang Wang’s mouth to twitch. All thanks to Gu Tianxiong!<br/><br/>That old rascal!<br/><br/>Fang Wang stopped talking; holding Song Jinyuan’s storage pouch, he began pulling out magic swords one by one to refine and unlock their seals.<br/><br/>It wasn’t long before Gu Tianxiong arrived, incessantly babbling, hoping that Fang Wang would promise not to tell Gu Li about the nonsense they had discussed previously. Fang Wang agreed, but Gu Tianxiong thought he agreed too quickly and suspected a trick, insisting on written evidence. After much hassle, he finally left.<br/><br/>Once Gu Tianxiong was gone, Fang Wang couldn’t help but remark, “Xiao Zi, do you think he’s a fool? Having a written contract is equivalent to creating evidence of his own crime, isn’t it?”<br/><br/>Gu Tianxiong could have simply denied everything outright; now that he carried the written contract, if it fell into someone else’s hands one day, it would spell disaster.<br/><br/>“He’s always been a bit silly,” Xiao Zi responded offhandedly.<br/><br/>With the year’s appointment upon them, Sword Heaven Marsh became bustling with activity; the lakeside was crowded with people, representatives from major sects, including those from Great Abyss Gate led by Greedy Sleeper and Zhao Chuanqian.<br/><br/>“Elder Zhao, the Sword Sect wouldn’t be too scared to show up, would they?” Zhou Bo asked, looking towards Zhao Chuanqian who was sitting in the front meditating, surrounded by hundreds of disciples—all from Great Abyss Gate and none weak, the least of whom were branch disciples.<br/><br/>Other disciples began discussing among themselves, convinced that the Sword Sect had chickened out.<br/><br/>Most people were unfamiliar with Sword Sect’s Kong Xi, but they regarded Fang Wang as a legend.<br/><br/>After cultivating for four years, he made his name in the Nine Veins Combat Method battle; it later emerged that his Lifespirit Treasure was a Heaven Yuan Spirit Treasure, and he then swept through thirteen top- tier prodigies.<br/><br/>Afterwards, Fang Wang received the inheritance from Sword Saint, slew the Great Demon King, and was hailed as the Heaven Yuan Sword Saint. All these feats were enough to make the disciples of Great Abyss Gate take pride.<br/><br/>Now, as they traveled the world, the cultivators they met who knew they were from the Great Abyss Gate would exclaim in awe of Fang Wang’s strength, which gave them a shared sense of glory.<br/><br/>“What do you all know? Anyone might be scared, but not him, Kong Xi. That old lad must come with murderous intent!”<br/><br/>Greedy Sleeper scoffed coldly. Mentioning Kong Xi, he couldn’t help but curse, clearly, the two had some unresolved issues.<br/><br/>Zhao Chuanqian opened his eyes and said calmly, “The name of the Sword Sect should not be underestimated; even if the Sect Leader faced him, he might not win.”<br/><br/>Sect Leader!<br/><br/>The disciples suddenly fell silent, believing Fang Wang to be incredibly strong but inevitably inferior when compared to the Sect Leader. As disciples of the Great Abyss Gate, they naturally considered their Sect Leader, Guang Qiuxian, to be the strongest within their sect.<br/><br/>Could Fang Wang surpass Guang Qiuxian after only 16 years of cultivation?<br/><br/>Even that…<br/><br/>Zhou Bo, who was most enthusiastic in praising Fang Wang, also fell silent.<br/><br/>Greedy Sleeper was about to speak when he suddenly turned his head, frowning towards a direction. Zhao Chuanqian did the same, his eyes sharpening.<br/><br/>At this moment, all the cultivators at the Profound Heart Realm by the lake lifted their heads, looking in the same direction.<br/><br/>It was a majestic mountain, with the sun just perched atop it. Following their gaze, one could see a figure standing on the summit, backlit by the bright sun, his black robes flapping in the wind.<br/><br/>Sword Sect!<br/><br/>At the same time.<br/><br/>Fang Wang, who had been sitting at the bridge, slowly stood up. Waving his<br/><br/>Qiankun Fan lightly with his right hand, he gazed at Kong Xi in the distance.<br/><br/>Xiao Zi looked towards that direction, flicking her tongue in and out, and said, “Master, he is very strong, feels even mightier than the previous Great Demon King. No wonder he dares to challenge you.”<br/><br/>The wind began blowing across the lake, fog surging around, and Fang Wang’s white robes fluttered, his side locks of hair lifting at the sound of his ears, his eyes filled with anticipation.<br/><br/>How could he not look forward to the battle that had attracted the world’s attention?<br/><br/>In one’s youth, who does not dream of becoming a celebrated hero, admired by all?<br/><br/>After 16 years of cultivating, Fang Wang had found confidence in himself. With family watching this battle, he was determined to display his most formidable self.<br/><br/>“Heaven Yuan Sword Saint Fang Wang, I have arrived!”<br/><br/>Kong Xi’s voice suddenly rang out, booming like thunder, startling thousands of cultivators to rise and those living in the pavilions to also come out.<br/><br/>His voice echoed over Sword Heaven Marsh, resounding long after.<br/><br/>Fang Hanyu, Song Jinyuan, and the Sword Servants all gathered behind Fang Wang, their gazes reaching far, and even though they couldn’t see Kong Xi’s figure clearly, they could feel the impressive Sword Qi.<br/><br/>“I joined the Suspended Vast Sword Sect at the age of eight, achieved Spiritual<br/><br/>Refinement at twenty, but only managed to create a Middle-grade Profound Origin Precious Spirit. At twenty-five, I journeyed across the world, was fortunate to meet the Sword Saint, and was utterly fascinated by his Sword Dao. Alas, the Sword Saint told me my aptitude was lacking and not enough to take me as his disciple.”<br/><br/>Kong Xi’s voice rose again, recounting his past.<br/><br/>These words touched many Sword Servants, as they shared a similar experience. They too wished to study under Sword Saint but were rejected.<br/><br/>“Lifespirit treasures are like destiny, something that once confined me, leading me to a moment of loss, but then I realized cultivation itself defies the heavens. If we are to defy the heavens, why believe in fate? Thus, I immersed myself in questioning the Sword, understanding it over two hundred years. But by the time I wished to prove myself to Sword Saint, he had already headed south across the sea!”<br/><br/>Defying the heavens!<br/><br/>These words resonated with most of the cultivators at Sword Heaven Marsh, echoing in their hearts.<br/><br/>Fang Wang remained unmoved, sighing in his heart.<br/><br/>Clever move!<br/><br/>With these words, no one would say anymore that Kong Xi was bullying the young; instead, they would empathize and possibly even support him.<br/><br/>“After Sword Saint left, I roamed the world, challenging all the great sword cultivators on these lands, ultimately establishing the name of the Sword Sect. But so what?”<br/><br/>“Without defeating the Sword Saint, the Sword Sect is just a joke!”<br/><br/>“Alas, the heavens did not fulfill my wish. When I emerged from seclusion, eager for Sword Saint’s return, I found out that the Sword Saint had passed away!”<br/><br/>“Hahaha! Sword Saint passed away! And before he died, he chose a genius with a Heaven Yuan Treasured Spirit as his successor! What an irony, Sword Saint succeeded, at least in proving to me that he was indeed capable of finding someone with better talent than mine!”<br/><br/>“Heaven Yuan Treasured Spirit, from ancient times until now, this land has only heard legends of it, yet nobody has ever seen one!”<br/><br/>“Fang Wang, you are a favorite of the heavens, born to have everything: the strongest talents, the greatest mentor, the best of all things. But defeating the Sword Saint is the life-long pursuit that I have been seeking!”<br/><br/>“Today’s battle, you shall represent the Sword Saint as well his pursuit of the greatest talent in this fight against me! Putting aside the Suspended Vast Sword Sect and the Great Abyss Gate, with no grudges, only a duel of destiny!”<br/><br/>Kong Xi laughed out loud, and his laughter reverberated through the Sword<br/><br/>Heaven Marsh. His heartfelt words moved the vast majority of the onlookers.<br/><br/>At this moment, they seemed to see an ordinary cultivator, on the verge of his end, drawing his sword against his own destiny.<br/><br/>They couldn’t help but compare themselves with Fang Wang; after all, what were they as mere onlookers?<br/><br/>At least the Sword Sect dared to challenge, while they could only join the crowd or try to please Fang Wang!\t\t\t\t\t\t</div>", "images": {}, "success": true}