{"id": 82, "url": "https://www.novelhall.com/i-became-an-immortal-on-mortal-realm-32879/14280135.html", "title": "Chapter 82 - Chapter 82: Chapter 79 The World I S Words, The Sword Sect Seeks Battle 1", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 82 - Chapter 82: Chapter 79 The World I S Words, The Sword Sect Seeks Battle 1</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 82: Chapter 79 The World I s Words, The Sword Sect Seeks Battle 1<br/><br/>Translator: 549690339<br/><br/>“I heard you’ve taken the Sword Saint as your master, which I didn’t expect,” Zhou Xue said to Fang Wang, her tone slightly wistful. “I originally thought he would only bestow the Sword Monarch Order upon you.”<br/><br/>This kid always managed to surprise her.<br/><br/>Fang Wang nodded and said, “Although we haven’t been together long, his<br/><br/>Celestial Sword Intent is indeed powerful. Moreover, he passed on the Han Yu<br/><br/>Sword Qi. We should indeed call him master.”<br/><br/>Zhou Xue chuckled lightly and said, “I am naturally aware of the strength of his<br/><br/>Celestial Sword Intent. His reputation to the south overseas is immense, far greater than you’d imagine.”<br/><br/>Fang Wang asked in surprise, “If he is so powerful, why would there still be demons daring to pursue him?”<br/><br/>“The reason why the Sword Saint is known as such is not only because of his strength, but also because he does not kill. Having cultivated for six hundred years, he has never killed a single person or demon. This is also why I let you come here with peace of mind. Great Cultivators like the Sword Saint are rare in the world. The reason I had you conceal your identity was only because there are too many cultivators in Sword Heaven Marsh, and I feared it might cause trouble and affect your Spiritual Refinement. After all, the Sword Saint doesn’t have much time left and could pass away at any moment.”<br/><br/>Zhou Xue’s words brought the visage of the Sword Saint back into Fang Wang’s mind.<br/><br/>His master had never killed a person…<br/><br/>Fang Wang grew even more curious about the Sword Saint’s past.<br/><br/>“By the way, have you met Gu Tianxiong, the father of Gu Li?” Zhou Xue changed the subject and asked.<br/><br/>Fang Wang narrowed his eyes and asked, “Have I met him? Could this also be part of your calculations?”<br/><br/>Zhou Xue smiled and replied, “Gu Tianxiong likes making friends. If you came to Sword Heaven Marsh, it was likely you would meet him. However, he has a penchant for championing others, which is why the Gu Family was destroyed.<br/><br/>They offended the Great Demon King, which eventually led to their downfall. You get along well with Gu Li, and the Gu Family took the initiative to approach you, so go ahead and help them. It’ll save you from a lifetime of regret.”<br/><br/>When she uttered the word ‘regret’, her eyes became time-worn, as if recalling some past events.<br/><br/>Fang Wang secretly felt fortunate that Zhou Xue was his kinswoman. If she were an enemy, it would be terrifying. To know the future is truly fearsome, impossible to guard against.<br/><br/>“Sword Heaven Marsh is not bad. Develop it and turn it into a second residence for the Fang Family. Oh, and if the Sword Saint’s Sword Servants wish to follow you, feel free to accept them. If they’re too much trouble, Han Yu can take charge. ”<br/><br/>After saying this, Zhou Xue turned and walked along the lakeside.<br/><br/>Fang Wang quickly asked, “Where are you going?”<br/><br/>Without turning back, Zhou Xue said, “To give Han Yu a few instructions, then continue heading south to seek a treasure.”<br/><br/>This time, Fang Wang didn’t ask if he could accompany her. If Zhou Xue truly wished to bring him, she would have said so.<br/><br/>“Is she worried about me and came specifically to make sure I’m alright?” Fang Wang watched Zhou Xue’s retreating figure and silently reflected.<br/><br/>But the next second, he quickly dismissed the thought.<br/><br/>Too self-confident!<br/><br/>Isn’t this just a life illusion?<br/><br/>Fang Wang turned and walked toward the opposite side of the lake.<br/><br/>He planned to cultivate in Sword Heaven Marsh for a while, incidentally guiding Fang Hanyu and Song Jinyuan.<br/><br/>Song Jinyuan had been an orphan since childhood. With the Sword Saint’s death, he didn’t know where to go. Invited by Fang Hanyu to join the Fang Family, he hesitated for a while before agreeing, mainly because he wanted to follow Fang Wang. For the Fang Family, gaining a high-level cultivator in Profound Heart Realm was naturally a good thing.<br/><br/>Fang Wang returned to the head of the bridge to continue his cultivation, with Song Jinyuan and Xiao Zi sitting on either side of him, contemplating swords as they gazed at the lake.<br/><br/>Half an hour later, Fang Hanyu found Fang Wang and said that Zhou Xue had already left and that the next time they would meet would probably be at Great Abyss Gate.<br/><br/>Fang Wang just nodded slightly, not saying much.<br/><br/>Seeing this, Fang Hanyu sighed inwardly.<br/><br/>She has feelings, but he is indifferent!<br/><br/>In his view, Zhou Xue’s visit was clearly a special trip out of concern for Fang Wang, and her affection didn’t need to be stated explicitly.<br/><br/>Yet Fang Wang feigned ignorance, and Fang Hanyu wondered who was hidden in his heart.<br/><br/>Fang Hanyu watched Fang Wang’s back, lost in thought for a while before departing.<br/><br/>Although he received the inheritance of the Sword Saint’s Sword Qi, his mastery of the Sword Dao was not yet strong enough. He had been sparring and exchanging ideas with other Sword Servants lately.<br/><br/>The Sword Servants had followed the Sword Saint to Sword Heaven Marsh.<br/><br/>Even though the Sword Saint was gone, after witnessing Fang Wang’s Celestial Sword Intent, they regarded Fang Wang as the new Sword Saint and were willing to continue following him. Because of Fang Wang, they were also very friendly towards Fang Hanyu.<br/><br/>Zhou Xue’s arrival was just a minor interlude.<br/><br/>Aside from the Sword Servants, nearly a hundred Sword Cultivators hadn’t left, including Gu Tianxiong. They were all very interested in Fang Wang, wanting to see how he cultivated. Fang Wang didn’t let them down either, occasionally gathering everyone to teach them about Celestial Sword Intent. As for how much they could comprehend, it depended on their destiny, and his magnanimity further earned their respect.<br/><br/>Eight months later, Fang Wang made a breakthrough to the third layer of the Profound Heart Realm.<br/><br/>By now, the Sword Servants of Sword Heaven Marsh were completely convinced by Fang Hanyu. Relying on the Lifespirit Treasure bestowed by the Sword Saint, his aptitude for swordsmanship was incredibly high. In half a year’s time, he learned several exquisite sets of swordsmanship and now could easily wield the Sword Saint’s Sword Qi, sweeping away most cultivators at his level in the Profound Heart Realm with ease.<br/><br/>Under Fang Wang’s guidance, Song Jinyuan also gradually sensed the existence of the Celestial Sword Intent. Fully comprehending it was still difficult for him, but at least he had hope and wasn’t dispirited anymore.<br/><br/>He even harbored a wild thought in his heart.<br/><br/>That was, Fang Wang’s attainments in Celestial Sword Intent exceeded those of his master, the Sword Saint!<br/><br/>Having followed the Sword Saint for so many years, he had barely begun to glimpse the threshold, yet after half a year of cultivating with Fang Wang, he could feel a hint of it…<br/><br/>On this day.<br/><br/>Fang Wang opened his eyes, looked out over the lake, and stretched his arms in a yawn.<br/><br/>Xiao Zi leaped out of the lake and said, “Young master, more and more cultivators have been coming to Sword Heaven Marsh recently. It feels like trouble is brewing.”<br/><br/>Fang Wang, who originally planned to leave Sword Heaven Marsh, upon hearing this, couldn’t help but raise an eyebrow and said, “Is that so? Then you ask Han Yu.”<br/><br/>Xiao Zi immediately dived into the bottom of the lake and disappeared from sight.<br/><br/>Fang Wang wasn’t afraid at all; after defeating the Great Demon King, his confidence had soared. Even if he were to face the Condensation Spirit Realm, he felt assured.<br/><br/>This return trip, he would have to confront Lu Yuanjun and Zhao Zhen!<br/><br/>The renown of the Sword Saint was sufficient to make Great Abyss Gate take him seriously. He believed that between him and Lu Yuanjun, Great Abyss Gate would certainly choose him; Guang Qiuxian and Yang Yuanzi, unwilling as they might be, would have no choice.<br/><br/>He just didn’t know how much longer it would take for the Qi Dynasty to transform into the Cultivation Dynasty.<br/><br/>Fang Wang had never paid much attention to this matter and was unaware of its progress.<br/><br/>An hour later, Xiao Zi finally returned, accompanied by Gu Tianxiong, who looked utterly anxious.<br/><br/>Fang Wang stood at the head of the bridge, gently fanning himself. Although puzzled, he wasn’t in a hurry and waited for them to approach him.<br/><br/>“We have big trouble. The grand elder of the Suspended Vast Sword Sect, Kong Xi, has declared he will come to Sword Heaven Marsh to challenge the Celestial Sword Intent of the Sword Saint!” Gu Tianxiong said gravely.<br/><br/>The grand elder?<br/><br/>Fang Wang raised an eyebrow and asked, “Is Kong Xi very strong?<br/><br/>Gu Tianxiong took a deep breath and answered, “Although he’s not the Sect Master, he has earned the title within the Sword Sect. In terms of Sword Dao, there are no more than three people in the entire Da Qi who can match him! As long ago as one hundred and thirty years, Kong Xi had already stepped into the Ninth Level of Profound Heart Realm. In his youth, he sought to become a disciple of the Sword Saint but was refused. He probably holds a grudge because of this. Hearing that you’ve inherited from the Sword Saint, he’s declared that he will come to Sword Heaven Marsh to challenge you in a year’s time; all swordsmen of the world may come to watch. Counting the time, five months have already passed, and in another seven months, he will come.”<br/><br/>“This old scoundrel is vicious indeed, throwing down the gauntlet to the entire world. If you don’t answer the challenge, everyone will laugh at you, yet what status does he have to bully the younger and act shamelessly!”<br/><br/>Gu Tianxiong was very angry, realizing unconsciously that he had started to see Fang Wang as one of his own.<br/><br/>If he couldn’t become his father-in-law, then being brothers was also fine!<br/><br/>Xiao Zi, however, didn’t care, blurting out, “What’s there to be afraid of? Even if Kong Xi is stronger, can he be more formidable than the Great Demon King?<br/><br/>My master ought to contend with the Da Qi’s top-level powerhouses.”<br/><br/>Fang Wang did not expect that after slaying the Great Demon King, someone would still dare to trouble him.<br/><br/>“If that’s the case, then let him come.”<br/><br/>Fang Wang calmly said, yet he was somewhat looking forward to it.<br/><br/>So far, he had never truly given his all in a fight.<br/><br/>Moreover, since the other party had openly issued the challenge, if he were to flee, how would the world view him, and how would Great Abyss Gate see him?<br/><br/>Even knowing it was an overt scheme, Fang Wang was willing to take it on!<br/><br/>The source of all his confidence stemmed from his cultivation and abilities!<br/><br/>“But…” Gu Tianxiong furrowed his brows tightly, wanting to persuade, yet not knowing how to persuade him, because he wasn’t clear on how strong Fang Wang actually was.<br/><br/>At this moment, Song Jinyuan descended from the sky, landing in front of Fang Wang. With an expressionless face, he said, “Don’t you want to be the greatest in the world? Then you must accept the challenge. Master has trained for six hundred years, becoming the Sword Saint not because he never lost, but because he never avoided any challenge.”<br/><br/>Fang Wang raised his eyebrow; this Song Jinyuan was provoking him.<br/><br/>“There are still seven months left, so let’s wait.”<br/><br/>Fang Wang shook his head and said, suddenly recalling another matter in his mind.<br/><br/>Lu Yuanjun and Zhao Zhen hadn’t run away, had they?<br/><br/>Although he hadn’t returned, the news of him inheriting from the Sword Saint and slaying the Great Demon King must have spread far and wide in the Da Qi Cultivation Realm, or else the grand elder of the Suspended Vast Sword Sect wouldn’t have become restless.<br/><br/>If Lu Yuanjun and the others had fled, then it would show their decisiveness, and he could slowly hunt them down later.<br/><br/>If not, then it could only be said that their fate was sealed.<br/><br/>With these thoughts in mind, Fang Wang then lifted his robe and resumed his seated meditation, continuing his cultivation.<br/><br/>Seeing that he couldn’t be persuaded, Gu Tianxiong could only give up. He turned to Song Jinyuan and raised an eyebrow, “Song Jinyuan, care to find a spot to spar?”<br/><br/>This young man was not behaving; daring to provoke his son-in-law, he must be properly tempered, otherwise, who knows what trouble he might cause in the future!<br/><br/>For his daughter’s happiness, Gu Tianxiong felt it was necessary to intervene.<br/><br/>“Let’s go.”<br/><br/>Song Jinyuan agreed; he too needed a sparring session to build up his confidence.<br/><br/>And so, the two left, stepping on the waves, and Xiao Zi followed them, wanting to join in the excitement.<br/><br/>Within a brightly lit great hall, a dark-clothed young man walked in, the premier talent of the Suspended Vast Sword Sect, Xu Qiuming.<br/><br/>Xu Qiuming made his way to the stairs and frowned as he looked at the figure meditating upon them.<br/><br/>“Senior uncle, with your status, challenging Fang Wang is inappropriate, don’t you think?”<br/><br/>Xu Qiuming’s sister, Xu Tian Jiao, had been saved by Fang Wang, so he owed Fang Wang a favor, and he had to come.<br/><br/>Sword Sect’s Kong Xi, with a gaunt frame and dressed in a voluminous black robe, had black and white hair carelessly hanging over his shoulders. A red sword pattern was marked on his forehead, making his already majestic face appear even more imposing.<br/><br/>Kong Xi opened his eyes and looked down at Xu Qiuming in the hall, saying,<br/><br/>“With the inheritance of the Sword Saint and having slain the Great Demon King, he is no longer just a genius but a swordsman renowned throughout the world. What’s inappropriate about me challenging him?”<br/><br/>“Don’t take offense at my blunt words, but if I don’t take action, Fang Wang will rise unopposed, and for the rest of your life, you will live in his shadow.. Suspended Vast Sword Sect will also be belittled by Great Abyss Gate; we must not suffer their oppression!”\t\t\t\t\t\t</div>", "images": {}, "success": true}