{"id": 89, "url": "https://www.novelhall.com/i-became-an-immortal-on-mortal-realm-32879/14282880.html", "title": "Chapter 89 - Chapter 89: Chapter 86: The Myriad Poison Array Is", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 89 - Chapter 89: Chapter 86: The Myriad Poison Array Is</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 89: Chapter 86: The Myriad Poison Array is<br/><br/>Established! Black Dragon Breaks Through the Formation! 1<br/><br/>Translator: 549690339<br/><br/>The earth trembled, and the poison mist that stretched for more than ten miles churned tumultuously. At the edge of the poison mist flood, a dark sky curtain was gathering, rising up. Upon a glance, aside from the heavens, there was no gap to be found.<br/><br/>Fang Wang quickly arrived above Xiao Zits head, and the demonic cultivators from all around Green Cicada Valley ceased their actions, creating distance. “Young Master, this formation is no simple matter!”<br/><br/>Xiao Zi said anxiously, her voice once again tinged with fear and worry.<br/><br/>Fang Wang stared expressionlessly into the distance and said, “A grand formation assembled by tens of thousands of cultivators is naturally not simple. Such a grand formation could easily suppress even a Condensation<br/><br/>Spirit Realm cultivator.”<br/><br/>The great battle had been ongoing for some time; he had killed at least a thousand people, with half his Spiritual Power depleted. Yet, the number of Green Cicada Valley’s demonic cultivators remained vast. In every direction, there were silhouettes of demonic cultivators.<br/><br/>Even though Pang Tuntian was dead, Green Cicada Valley had not given up.<br/><br/>It seemed their true reliance was on this so-called Myriad Poison Array!<br/><br/>In the past, Fang Wang had heard about the Myriad Poison Array of Green Cicada Valley, their number one grand formation. This formation was the reason they could rank among the Nine Great Sects even without a<br/><br/>Condensation Spirit Realm great cultivator.<br/><br/>When the Myriad Poison Array was deployed, the heavens and earth would wail, and all things would decay!<br/><br/>“Looks like it’s time for a real fight.”<br/><br/>Fang Wang muttered to himself. He had not yet deployed spells with a wide killing range because there were too many enemies who were all nimble cultivators, attacking from various directions at long range. If he used spells that consumed a high amount of energy, he could easily be drained to death.<br/><br/>Of course, if he wanted to escape, Green Cicada Valley wouldn’t be able to stop him!<br/><br/>But the reason he was fighting now was for the Fang Family members behind him, and for the Great Abyss Gate!<br/><br/>It was highly likely that the Great Abyss Gate was facing a siege from the Demonic Path. If he could break through and cast fear into Green Cicada Valley, the pressure on the Great Abyss Gate would naturally diminish.<br/><br/>In his previous life, even without him and Zhou Xue, the Great Abyss Gate had managed to turn danger into safety. Now, with Green Cicada Valley out of the picture, they should be able to hold on.<br/><br/>As for the Fang Family disciples in the Great Abyss Gate, although he was worried, there was still a glimmer of hope in his heart.<br/><br/>Because he had someone to rely on!<br/><br/>“The Myriad Poison Array has been activated, everyone reinforce it with your Spiritual Power, and let’s kill this demon in one fell swoop!”<br/><br/>The gaunt man standing on a toad bellowed angrily. The poison flags around him burst with Spiritual Power, rising up. Thunderclouds above the Myriad Poison Array roiled violently, with streaks of green light piercing through the clouds and falling down.<br/><br/>Tens of thousands of demonic cultivators followed suit. At the same time, outside the Myriad Poison Array, more Green Cicada Valley cultivators were hurrying over. They all came to the periphery of the formation, raised their hands, and used their own Spiritual Power to reinforce the Myriad Poison Array. The figures of demonic cultivators were everywhere.<br/><br/>Boom—Boom—Boom—<br/><br/>The sea of clouds parted, and a huge green light rune appeared above the Myriad Poison Array, spanning over ten miles in diameter. Fang Wang looked up and couldn’t make out what rune it was. It looked like complex characters, or perhaps some kind of pattern. It was gathering nature’s Spiritual Energy, and a terrifying oppressive force descended, causing Xiao Zits enormous serpent body to bow down.<br/><br/>“Young Master, I can’t hold on much longer!”<br/><br/>Xiao Zi gritted her teeth and shouted, her serpentine body trembling.<br/><br/>This scene greatly invigorated the demonic cultivators of Green Cicada Valley; the elders were even calling out to boost morale.<br/><br/>“He certainly can’t withstand the Myriad Poison Array, we must avenge the<br/><br/>Valley Master!”<br/><br/>“No matter how talented he is, he has only cultivated for sixteen years, and even the strong have their limits!”<br/><br/>“Hahaha, the Heaven Yuan Spirit Treasure will die at our hands. When word spreads, it will surely intimidate the other Great Sects!”<br/><br/>“I have to say, he is indeed very strong. If the elders hadn’t bought us time, we wouldn’t have been able to condense the Myriad Poison Array and would have been helpless against him.”<br/><br/>“After all, his strength is comparable to that of a Condensation Spirit Realm.<br/><br/>It’s no exaggeration to say that he is now within the top five in the Da Qi<br/><br/>Cultivation Realm.”<br/><br/>Every demonic cultivator was drenched in sweat, putting forth all their might to strengthen the Myriad Poison Array, their faces a mix of excitement, anticipation, and disdain.<br/><br/>The stronger Fang Wang was, the greater the sense of achievement in executing him would be.<br/><br/>In the face of the Myriad Poison Array’s might, akin to Heavenly Might, Fang<br/><br/>Wang showed no fear. He looked up at the huge green light rune in the sky, his Golden Scale White Feather Robe fluttering in the wind. Strands of golden Qi Dragons, like eternally burning flames, spread their unique glow across the dimly lit battlefield, impossible to conceal.<br/><br/>“Xiao Zi, don’t you yearn to transform into a dragon?”<br/><br/>Fang Wang looked up at the firmament and murmured to himself.<br/><br/>Xiao Zi widened her serpentine eyes and asked, “What do you mean? Young<br/><br/>Master, can you make me become a dragon?”<br/><br/>It remembered the spell Fang Wang used to break the forbidden gate. Could it be happening again?<br/><br/>No sooner had the words left its mouth than it felt a surge of scorching Spiritual Power enveloping its serpentine body—it was Fang Wang’s Spiritual Power.<br/><br/>Xiao Zits serpentine eyes brightened. In this moment, it felt as if it and Fang Wang had become one.<br/><br/>Fang Wang stood atop Xiao Zits head, activating the Nine Dragons Divine<br/><br/>Transformation Art, and his Spiritual Power overflowed, turning into Qi Dragons to cover Xiao Zits enormous serpentine body. The Qi Dragons began to condense into a dragon shape.<br/><br/>Qi Dragon!<br/><br/>Shape Dragon!<br/><br/>White Dragon!<br/><br/>As Xiao Zi underwent the transformation into a White Dragon, a dragon’s roar echoed through heaven and earth, and the rolling poison mist could not obstruct the White Dragon’s figure.<br/><br/>All the demonic cultivators’ eyes were fixed on the White Dragon. In the gloomy heavens and earth, the White Dragon’s stature was so majestic and domineering.<br/><br/>“What is that?”<br/><br/>“A dragon… a True Dragon from legends?”<br/><br/>“What’s going on? How did that serpent demon become a dragon?” “No, it must be some kind of sorcery; everyone be careful!”<br/><br/>“Still trying to struggle in the face of death? With so many of us forming the formation, it’s impossible for them to break through!”<br/><br/>The demonic cultivators of Green Cicada Valley were abuzz with alarm, while the higher realm cultivators shouted out, calming the unease of their subordinates.<br/><br/>After transforming into a White Dragon, Xiao Zi felt the pressure on its body greatly diminish as it lifted its massive frame.<br/><br/>However, Fang Wang felt it was not enough!<br/><br/>The dragon’s body on Xiao Zi began changing color, from white to blue, and then from blue to yellow; with each color shift, its dragon’s body grew larger, and to all the demonic cultivators’ eyes, Xiao Zi was rapidly increasing in size, creating a spectacular scene.<br/><br/>As Xiao Zi grew bigger, the fear and anxiety in the hearts of the demonic cultivator intensified; they could only clench their teeth and increase the output of their Spiritual Power.<br/><br/>Yellow turned to purple, purple to red, and red to gold!<br/><br/>A hundred-zhang tall Golden Dragon roared up to the heavens, its dragon’s roar shaking the earth and stirring the hearts of those who heard it. The gaunt old man shouted hastily, “Activate the formation for the kill!” The thousand demonic cultivators mainly in control of the Myriad Poison Array pinched their spells in unison, their hand movements synchronized, the green light runes in the sky trembled violently, the terrifying formation might erupted, spewing out vast clouds of poison that enveloped the green light runes, which then plummeted downward.<br/><br/>This plummet was like the sky collapsing!<br/><br/>The ground shook, all the demonic cultivators forming the formation trembled, they clenched their teeth tightly, staring fixedly at the Golden Dragon within the formation.<br/><br/>Fang Wang, standing atop Xiao Zi’s head, his gaze sharpened as Xiao Zi felt an unstoppable force lifting it soaring skyward.<br/><br/>Chant—<br/><br/>The Golden Dragon ascended to the sky, and the moment it leapt up, it transformed into a Black Dragon!<br/><br/>The highest level of the Nine Dragons Divine Transformation Art!<br/><br/>As the Golden Dragon transformed into the Black Dragon, its dragon’s might became even more imposing, a momentum that frightened tens of thousands of Green Cicada Valley disciples rushed towards them!<br/><br/>This was the ultimate aura of destruction!<br/><br/>The speed of the Black Dragon abruptly increased, its posture fierce and domineering as it broke through to the clouds with force, shattering the green light runes. In an instant, a brilliant flash illuminated the entire sky and earth, causing all demonic cultivators to instinctively close their eyes.<br/><br/>Even the Fang Family members resting in the forest far away had their eyes dazzled.<br/><br/>Fang Hanyu, who was swiftly flying on his sword, seemed to sense something and turned his head to look, a powerful light swept towards him, blowing his hair.<br/><br/>Luckily, the flash was over in a blink of an eye.<br/><br/>“Fang Wang… you must survive!”<br/><br/>Fang Hanyu gritted his teeth with that thought, confident that in a one-on-one fight, no one could stop Fang Wang, but faced with numerous enemies, he couldn’t help but be apprehensive for him.<br/><br/>The Black Dragon rose into the sky, forcefully shattering the massive green light runes, and the Myriad Poison Array was instantly broken!<br/><br/>Unrivaled and supreme!<br/><br/>All Green Cicada Valley demonic cultivators, having just regained their sight, opened their eyes to see the Myriad Poison Array broken and were shaken by the terrifying backlash, spitting blood and flying backward, with some low realm Soul Sculpting Realm cultivators dying on the spot.<br/><br/>The rolling clouds of poison swept across the eight directions like a terrifying tidal wave, unstoppable, uprooting trees in its path.<br/><br/>The gaunt old man was also injured by the shock, using his four poisonous flags to resist the impact. His face was filled with fear and despair, and following his gaze, one could see a large hole torn through the thunderous clouds above, where a massive Black Dragon’s head emerged. Before this dragon head, anyone would feel their insignificance.<br/><br/>“It’s over…”<br/><br/>The gaunt old man trembled all over, his voice shaking, his face void of color.<br/><br/>At that moment, even the toxic insects raised by Green Cicada Valley felt fear, an instinct they couldn’t control.<br/><br/>In the distance, a male cultivator lay on the ground, trembling as he propped himself up, staring in despair at the Black Dragon in the sky, his voice shaking, “The Myriad… The Myriad Poison Array… is broken…”<br/><br/>“Run for it!”<br/><br/>A shout from another direction came from a demonic cultivator, crying out with all his might, breaking the silence between the heavens and the earth, and the morale of Green Cicada Valley crumbled instantly. The living demonic cultivators got up and fled, running haphazardly, with the elders as scared as the disciples, not daring to yell out again, escaping faster than the disciples.<br/><br/>The valley master’s death did not scare them because they still had the Myriad Poison Array!<br/><br/>But with the Myriad Poison Array broken, they had truly lost all confidence!<br/><br/>Fang Wang, with a focused gaze, noticed a group of demonic cultivators escaping in the direction of the Fang Family and immediately had Xiao Zi chase after them.<br/><br/>The Black Dragon dissipated, and the dragon’s energy cleared like wind, revealing Xiao Zi’s figure. Xiao Zi’s body, originally large, seemed to shrink suddenly after the Black Dragon disappeared; the once massive serpent now seemed rather ordinary.<br/><br/>“Young Master! That was amazing! I really turned into a dragon just now!”<br/><br/>Xiao Zi called out excitedly, standing on its head, with Fang Wang managing a faint smile.<br/><br/>Transforming into the Black Dragon had completely drained all his Spiritual Power, but the battle was not over yet; he could still fight with the strength of his physical body.<br/><br/>He stood proudly on the serpent’s head, his right hand holding the Heavenly Palace Halberd, his left hand took out Spiritual Energy pills from his storage bag to consume.<br/><br/>Green Cicada Valley slaughtered Great Abyss Gate disciples and tortured Fang Hanyu; that enmity was not yet settled, and now they had besieged him, making the hatred irreconcilable!<br/><br/>Fang Wang’s eyes were filled with murderous intent!<br/><br/>Even with depleted Spiritual Power, his combat heart was still ablaze.<br/><br/>Xiao Zi moved swiftly, flying quickly in the direction pointed by the Heavenly Palace Halberd, continuously spewing Sword Qi to shoot down the demonic cultivators along the way.<br/><br/>The feeling of not being besieged thrilled it to no end!<br/><br/>The demonic cultivators of Green Cicada Valley were already scared out of their wits, not daring to fight back, only fleeing for their lives, and any cultivator hunted down was destined to die..\t\t\t\t\t\t</div>", "images": {}, "success": true}