{"id": 81, "url": "https://www.novelhall.com/i-became-an-immortal-on-mortal-realm-32879/14280130.html", "title": "Chapter 81 - Chapter 81: Chapter 78 What Gu Tianxiong Thinks,", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 81 - Chapter 81: Chapter 78 What Gu Tianxiong Thinks,</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 81: Chapter 78 What Gu Tianxiong Thinks,<br/><br/>Tianyuan Sword Saint [3rd Update, Request for Monthly Pass]_l<br/><br/>Translator: 549690339<br/><br/>Looking at Fang Wang before him, Gu Tianxiong’s heart was filled with too many emotions. Even after a day and a night, the shock in his heart had not yet dissipated.<br/><br/>The first time he saw the name Fang Wang was in a letter from his daughter, Gu Li.<br/><br/>In the letter, Gu Li claimed to have been defeated by a young man named Fang Wang, whose cultivation was only at the seventh layer of the Qi Cultivation Realm, with a single sword strike.<br/><br/>At that time, Gu Tianxiong was angry. He had high hopes for Gu Li and did not want his precious daughter to lose her confidence just after entering the Great Abyss Gate, so he encouraged her in his reply to challenge Fang Wang again after her Spiritual Refinement.<br/><br/>The second letter arrived at the Gu Family very soon. Gu Tianxiong was silent for a long time after reading it. His daughter had been defeated once again; one defeat could be an accident, but another defeat was enough to show a gap in talent. And his daughter, who had an Earth Origin Spirit Treasure, lost to a boy younger than her, not once, but twice. This made him begin to take Fang Wang seriously for the first time and even look forward to his future.<br/><br/>In the days that followed, every letter Gu Li sent back contained the words Fang Wang.<br/><br/>Eventually, Gu Tianxiong decided to invest in Fang Wang, instructing Gu Li to pass on the Divine Nurturing Sword Qi to him.<br/><br/>The Divine Nurturing Sword Qi was the signature ultimate skill of the Gu<br/><br/>Family. The stronger one’s talent was, the more powerful their Divine<br/><br/>Nurturing Sword Qi. He was confident that Fang Wang would still use the Divine Nurturing Sword Qi after becoming powerful, and by then, Fang Wang’s reputation would bolster that of the Gu Family wherever he went.<br/><br/>Indeed, as he had expected, when Fang Wang used the Divine Nurturing Sword Qi to slay the Great Demon King yesterday, it left Gu Tianxiong astonished.<br/><br/>Eyes emitting Sword Qi!<br/><br/>What an accomplishment!<br/><br/>Gu Tianxiong remembered how he felt when he learned that Fang Wang’s Lifespirit Treasure was actually a Heaven Yuan Spirit Treasure. At that time, he had left the Gu Family, and upon hearing the news, his first reaction was disbelief, at most he thought it could be an excellent Earth Origin Spirit Treasure.<br/><br/>Until later…<br/><br/>Fang Wang powerfully defeated thirteen of the current world’s top talents!<br/><br/>From then on, the Heaven Yuan Spirit Treasure was confirmed as true!<br/><br/>At that moment, Gu Tianxiong felt the same as his daughter; Fang Wang, who showed no aura in front of him, seemed to shine with dazzling brilliance.<br/><br/>He seemed to see those legendary figures of ancient myths living right before his eyes.<br/><br/>One day, Fang Wang would undoubtedly become the most powerful cultivator in Da Qi, and his fame would not be limited to Da Qi alone!<br/><br/>Gu Tianxiong looked at Fang Wang with fervent eyes and could not help but say, “Fang Wang, how about I betroth my daughter to you?”<br/><br/>Upon hearing this, Fang Wang hurriedly replied, “How can that be possible!”<br/><br/>“Impossible!”<br/><br/>The voice of Fang Hanyu came through as he quickly stepped forward in front of Fang Wang, staring intently at Gu Tianxiong with his daunting Absolute Heart Evil Eye.<br/><br/>Gu Tianxiong felt a chill in his heart under that gaze, but still asked somewhat displeased, “Why not? My daughter is a peerless beauty, and her Lifespirit Treasure is of Earth Elemental grade. Looking across Da Qi, there is no second woman more suitable for Fang Wang than her!” Fang Hanyu said coldly, “Fang Wang is already engaged!”<br/><br/>“What?”<br/><br/>Fang Wang and Gu Tianxiong exclaimed in unison. The brothers exchanged looks and then both turned toward Fang Hanyu.<br/><br/>“His fiancée is Zhou Xue, also one of the top five talents of the Great Abyss Gate, and moreover, she was raised by our Fang Family!” Fang Hanyu stated seriously.<br/><br/>Fang Wang looked confused, and Fang Hanyu quickly pulled him away.<br/><br/>Gu Tianxiong was anxious; he could not follow them and could only call out, “Fang Wang, even if not as the primary wife, being a concubine is also fine. My daughter is so beautiful, don’t you know?”<br/><br/>Fang Wang did feel tempted upon hearing these words, but Fang Hanyu was dragging him away.<br/><br/>“Even if you’re not interested, a failed deal doesn’t break friendship, don’t let those jumbled words I said reach my daughter, alright!” Upon hearing Gu Tianxiong’s remark, Fang Wang was speechless.<br/><br/>No wonder he was so enthusiastic!<br/><br/>The fear was of being exposed!<br/><br/>Fang Wang followed Fang Hanyu into the Sword Saint’s transfigured attic, while Xiao Zi was not with him, still at the lakeside devouring the flesh and blood of the Great Demon King. It was a Demon King after all, and other cultivators couldn’t handle it. Moreover, Fang Wang’s face carried weight.<br/><br/>Fang Hanyu looked at Fang Wang and said in a low voice, “This is what grandfather and all the uncles think, and the fourth uncle agrees too. Zhou Xue has truly helped the Fang Family a lot, but ultimately, she is a woman. If she were to marry someone else, how would the Fang Residence get along with her then?”<br/><br/>Fang Wang frowned and said, “That doesn’t seem right. Matters of the heart should be about mutual affection, and we can’t make decisions for Zhou Xue.” Even if he wanted to, he didn’t have that power!<br/><br/>“Of course, it’s not about coercion. But if you take the initiative, it may be possible. Zhou Xue clearly cares about you the most, and you two are the closest. Furthermore, the more outstanding the woman, the more she yearns for a hero. With your talent as a Heaven Yuan Spirit Treasure, to tell the truth, I can’t imagine any other man fitting in her eyes except for you.” Fang Hanyu spoke earnestly.<br/><br/>Indeed, there might be no one in this world…<br/><br/>But not necessarily in the heavens…<br/><br/>Fang Wang mused, also a vigorous young man, how could he remain unmoved? But he knew what he wanted.<br/><br/>Both he and Zhou Xue were not likely to pause their journeys for love. And Gu Li, being the daughter of the head of the Gu Family, how could she wander the world with him?<br/><br/>Even if she were willing, Fang Wang also worried he could not protect her well enough.<br/><br/>“Let’s see in the future!” Fang Wang said, waving his hand, and then turned to leave the attic.<br/><br/>Fang Hanyu watched Fang Wang’s retreating back and sighed softly.<br/><br/>It was not for Fang Wang that he sighed, but for Zhou Xue.<br/><br/>In his eyes, Fang Wang shined brighter than Zhou Xue, and he also knew of Zhou Xue’s kindness towards Fang Wang, which all their clansmen had witnessed. So, he thought it was Fang Wang who didn’t harbor feelings for<br/><br/>Zhou Xue.<br/><br/>No, this won’t do!<br/><br/>To repay Zhou Xue’s kindness, he must protect Fang Wang on her behalf and ensure that Fang Wang’s heart isn’t swayed by any other woman. Suddenly, Fang Hanyu felt a heavy sense of responsibility.<br/><br/>He enjoyed the feeling of giving silently.<br/><br/>As time passed, a month hurried by since the Sword Saint’s passing, and the isolated Sword Heaven Marsh became even more tranquil.<br/><br/>On a wooden bridge by the lake, Fang Wang sat, with Xiao Zi lying on his shoulder. In front of them, Song Jinyuan paced back and forth.<br/><br/>“Who is this Pang Changqing? He wields the Soul Devouring Blade, notorious and infamous. Seeing that my master wouldn’t fight, he became agitated, angrily drew his blade, and struck at us, master and disciple. However, my master did not even furrow his brow and, with his Celestial Sword Intent, raised waves from the ocean that nearly obscured the sky. Pang Changqing was scared witless!”<br/><br/>As Song Jinyuan spoke with cadence and emphasis, his eyes bulged at the climax, startling Xiao Zi into exclaiming over and over.<br/><br/>Fang Wang also listened with keen interest.<br/><br/>His acquaintance with the Sword Saint had been too brief, nearly without interaction, so he was very interested in Song Jinyuan’s stories.<br/><br/>During that month, Fang Wang would spend six days training and then seek out Song Jinyuan to learn about the Sword Saint’s overseas adventures.<br/><br/>Coming from overseas himself, Song Jinyuan was an orphan picked up by the Sword Saint. While he was called the sole disciple, in reality, he had never received the Sword Saint’s recognition. This was why his defeat at the hands of Fang Wang had hit him so hard, for he knew he could never inherit his master’s legacy.<br/><br/>“All right, that’s enough for today. Fang Wang, it’s time you imparted to me the Celestial Sword Intent,” Song Jinyuan said as he stopped, speaking earnestly.<br/><br/>Fang Wang patted the floor beside him, signaling Song Jinyuan to sit down, and Song Jinyuan immediately began to meditate next to him.<br/><br/>“Look at the mist on the surface of the lake and feel it carefully. Whatever you see, do not speak—just quietly experience it,” Fang Wang said as he watched the lake.<br/><br/>Sword Heaven Marsh contained a strong Celestial Sword Intent, which was why the Sword Saint let sword cultivators meditate above the lake. However, the sword cultivators had not found the most suitable spot, and this was the best one.<br/><br/>Hearing this, Song Jinyuan was skeptical.<br/><br/>Xiao Zi also turned to gaze at the thick fog over the lake, having become quite interested in the Sword Dao recently.<br/><br/>Worth mentioning is that the Great Demon King and its eighteen demonic followers had all perished, all devoured by Xiao Zi. It had quite the appetite—having eaten so much without getting fatter—but its Demonic Qi was certainly growing.<br/><br/>Gu Tianxiong called it extraordinary; indeed, it was rare for demonic beasts to consume one another, and even rarer to assimilate the other’s demonic power, usually only enhancing their vitality at most.<br/><br/>Xiao Zi had even grown strong enough to defeat Gu Tianxiong, a cultivator of the Profound Heart Realm.<br/><br/>In fact, it was Gu Tianxiong who had challenged Xiao Zi and was roundly defeated. His Five Sacred Sword Technique merely scratched Xiao Zi, shedding a few scales without inflicting any harm.<br/><br/>In Fang Wang’s opinion, Gu Tianxiong’s Five Sacred Sword Technique made a great show of force, which seemed quite intimidating, but it was far inferior to the Jinghong Divine Sword Art, not to mention incomparable to the Nine Heavens Azure Thunder Sword Formation and the Celestial Sword Intent. The Gu Family’s most formidable technique was the Divine Nurturing Sword Qi, sadly requiring time to cultivate.<br/><br/>Fang Wang casually gazed at the lake’s surface when suddenly his eyes fixed on something.<br/><br/>He saw a figure in red on the distant other side of the lake, intermittently visible through the dense fog.<br/><br/>Fang Wang immediately rose to his feet, leaping across like a flying goose. Song Jinyuan and Xiao Zi watched him with curiosity.<br/><br/>“Damn it, that bad woman is here!” Xiao Zi muttered under its breath, its tone resentful.<br/><br/>Fang Wang swiftly crossed over to the opposite shore of the lake and stood before the figure in red, his face breaking into a smile as he asked, “Why have you come?”<br/><br/>Zhou Xue looked up, her delicate yet stern face appearing beneath her bamboo hat. She smiled enchantingly, her voice light, “I heard you vanquished the Great Demon King in quite a display of might. Passing by, I had to see for myself what the heralded Fang Wang was like.”<br/><br/>Upon hearing this, Fang Wang feigned a frown and asked, “Really? News travels that fast?”<br/><br/>But the corners of his mouth betrayed him.<br/><br/>“Of course. With the Sword Saint’s inheritance and the Heaven Yuan Spirit<br/><br/>Treasure you possess, some now call you the Heaven Yuan Sword Saint,” Zhou Xue chuckled, her beautiful eyes appraising Fang Wang, the mirth in her gaze deepening.<br/><br/>She gently nudged Fang Wang’s shoulder and asked, “Did you get the Sword<br/><br/>Monarch Order?”<br/><br/>Fang Wang nodded and replied, “I did. What exactly is its origin?”<br/><br/>Zhou Xue glanced over the lake with a meaningful expression, “It’s a precious treasure. Once you venture overseas, you’ll be able to summon others at your beck and call, like a fish in water. Actually, in the original course of fate, I was meant to seek a mystical fate here, but I never won the Sword Saint’s endorsement. On his deathbed, he passed the Sword Monarch Order to his disciple, Song Jinyuan. Afterward, Song Jinyuan left Da Qi for overseas, but unfortunately, his strength was inadequate, and he was killed in an ambush. The Yellow Glyph Sword Sovereign Order then fell into someone else’s hands.” How tragic.<br/><br/>Upon hearing the earlier part of her story, Fang Wang felt somewhat guilty, thinking he had taken away Song Jinyuan’s chance. But after hearing the rest, he realized he actually saved Song Jinyuan’s life..\t\t\t\t\t\t</div>", "images": {}, "success": true}