{"id": 88, "url": "https://www.novelhall.com/i-became-an-immortal-on-mortal-realm-32879/14282395.html", "title": "Chapter 88 - Chapter 88: Chapter 85: One Man, One Snake Versus An Entire Sect! [4Th Update, Vote For Monthly Pass]_L", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 88 - Chapter 88: Chapter 85: One Man, One Snake Versus An Entire Sect! [4Th Update, Vote For Monthly Pass]_L</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 88: Chapter 85: One Man, One Snake Versus an Entire Sect! [4th Update, Vote for Monthly Pass]_l<br/><br/>Translator: 549690339<br/><br/>As more and more cultivators of Green Cicada Valley leapt out from the surrounding mountains and forests, a surging poison fog rose up in the wilderness. Wherever it passed, flowers, grass, and trees withered at a visibly rapid pace.<br/><br/>Fang Wang stood on the mid-slope, surveying his surroundings, he was completely surrounded.<br/><br/>He didn’t attack immediately; instead, he waited for Green Cicada Valley’s encirclement to prevent them from going after Fang Hanyu.<br/><br/>Countless poisonous insects flew in from the horizon, darkening the sky. Gradually, the land fell into gloom.<br/><br/>“Even if it were a mountain of knives or a sea of fire, I would accompany the young master. Young master, rest assured, I have stayed in the Great Saint’s Grotto-Heaven for so many years, I’ve learned quite a few skills!”<br/><br/>Xiao Zi clung to Fang Wang’s shoulder, trembling as it spoke, its voice frail but its demonic Qi ready for battle.<br/><br/>Powerful presences erupted, and from even behind Fang Wang in the forest, a multitude of enormous poison insects emerged — beetles, spiders, scorpions, moths, ants, long worms, and more, all were present.<br/><br/>A figure emerged from the rolling poison fog, looking down at Fang Wang, who had his back to him. The man wore a red robe, burly in stature, with a bearded face and long hair streaked black and white, coiled beneath a black centipede. The centipede’s long whiskers fluttered like phoenix wings. The poisonous Qi swirling around him was the most formidable.<br/><br/>“Fang Wang, you killed my disciple, Li Hongshuang, do you admit it or not?” the man in red coldly asked, his eyes brimming with greed.<br/><br/>Fang Wang slightly tilted his head, glancing at him with the corner of his eye, and replied, “Who are you from Green Cicada Valley?”<br/><br/>“Green Cicada Valley Master, Pang Tuntian!” the man in red responded, his tone barely concealing his murderous intent.<br/><br/>Fang Wang scoffed mockingly, “I didn’t expect the esteemed Green Cicada<br/><br/>Valley Master to go to such great lengths just to kill a junior like me!”<br/><br/>Pang Tuntian raised his right hand; blood -colored poison fog gushed from his palm as a whip-like tendril emerged. His expression was ice cold as he said, “Blame yourself for possessing the Heaven Yuan Spirit Treasure. If you want to live, there is still a chance.”<br/><br/>“Kneel down, beg me for mercy, and after I possess your body, I will find a new one for you. You will serve Green Cicada Valley from then on, how about it?” Upon hearing this, Fang Wang burst into laughter.<br/><br/>More and more Great Cultivators of Green Cicada Valley drew near, all of<br/><br/>Profound Heart Realm, numbering in the hundreds. Disciples of Green Cicada Valley beneath the Profound Heart Realm were setting up formations in the distance, each one looking solemn.<br/><br/>Although they had superior numbers, facing Fang Wang, they dared not take him lightly. They believed Green Cicada Valley would capture Fang Wang, but knew subduing the Fang Wang who had slain the Great Demon King and defeated the sword sect would cost them dearly; nobody wanted to be dead.<br/><br/>“If you’re unwilling, then wait for me to tear out your sinews and drain your blood until you’re utterly weak, before I forcibly possess you!” Pang Tuntian declared coldly, and with that, he viciously lashed out with his whip toward Fang Wang.<br/><br/>The vicious wind tore through nature’s spiritual energy, producing a piercing noise.<br/><br/>Rather than retreat, Fang Wang advanced, charging toward Pang Tuntian with the Heavenly Palace Halberd in hand.<br/><br/>The great battle was about to begin!<br/><br/>The Great Cultivators of Green Cicada Valley each brought out their Lifespirit Treasures as they all sped towards Fang Wang.<br/><br/>Facing Pang Tuntian’s long whip, Fang Wang dashed forward eight steps before fiercely hurling the Heavenly Palace Halberd.<br/><br/>Boom!<br/><br/>The Heavenly Palace Halberd unleashed a terrifying force, forcefully breaking through the whip and heading unstoppably towards Pang Tuntian.<br/><br/>The Great Perfection’s Sword Control Technique!<br/><br/>Enforced with the True Combat Technique!<br/><br/>With each step, Fang Wang had already activated the True Combat Technique; at this moment, he cast aside all distractions, his sole purpose to eliminate as many demonic cultivators of Green Cicada Valley as possible!<br/><br/>That’s right, he didn’t want to flee!<br/><br/>Pang Tuntian’s face turned pale. Faced with the onrushing Heavenly Palace<br/><br/>Halberd, he instinctively raised his hands, forming a spiritual power shield.<br/><br/>However, the Heavenly Palace Halberd struck with overwhelming force, scattering the spiritual power shield, severing his arms, and piercing his chest. Blood sprayed as he fell backward into the forest behind him.<br/><br/>Fang Wang came to an almost simultaneous stop, turned, and charged, drawing the Qingjun Sword with his right hand.<br/><br/>In this lopsided battle, he didn’t want to deplete his spiritual energy directly, deciding instead to use the simplest methods to slay the most powerful.<br/><br/>“Kill!<br/><br/>Seeing Pang Tuntian wounded in an instant, the Great Cultivators of Green Cicada Valley, despite shaken expressions, still unleashed their ultimate moves, swarming Fang Wang.<br/><br/>Uncountable spells flooded towards Fang Wang from all directions. He ran to the edge of a cliff and leaped, his eyes ice-cold and resolute, seeing only enemies.<br/><br/>Xiao Zi, perched on Fang Wang’s shoulder, also opened its maw wide, its form frozen in time. Man and snake faced the sky full of demonic cultivators, their faces void of fear.<br/><br/>In the forest.<br/><br/>Fang Yin walked in the middle of the group, frowning with an inexplicable unease stirring in his heart.<br/><br/>Fang Meng, walking beside him, noticed his expression and scolded, “What’s the matter? Tired already? I keep telling you to practice more, but you don’t listen!”<br/><br/>Fang Yin replied with a wry smile, “With no progress in cultivation, how can one calm down? I’m not tired, I just feel like something big is happening.”<br/><br/>“Humph, always babbling nonsense.”<br/><br/>Fang Meng shook his head disdainfully and proceeded onward.<br/><br/>Just then, the Fang Family Disciples ahead gradually stopped, all looking upwards. The forest around them was sparse, allowing a clear view of the sky, and they saw the heavens darken, as if a thunderstorm was about to engulf them, heavily oppressive.<br/><br/>Yet, they heard no sound of thunder.<br/><br/>After a moment of contemplation, Fang Meng spoke, “Alright, let’s stop here. Set up camp nearby and prepare to rest.”<br/><br/>The Fang Family Disciples had no objections, but while they worked, they couldn’t help but turn their heads to look towards the sky repeatedly.<br/><br/>The phenomenon was truly terrifying, filling them with dread and unease. Fang Yin stood in place, looking toward the horizon with growing unease in his heart.<br/><br/>For some reason, he thought of Fang Wang.<br/><br/>“It shouldn’t be possible; that kid is so formidable, how could anything happen to him?”<br/><br/>Fang Yin silently thought to himself, trying desperately to comfort himself, mainly because there was nothing he could do.<br/><br/>At this moment, he suddenly regretted not putting more effort into his cultivation. Even if his talents were mediocre, wouldn’t it be worth it to become a little stronger?<br/><br/>Dark clouds rolled, the world was enveloped by boundless poison fog. Wherever one looked, forests across the hills had withered, drenched with blood and littered with corpses.<br/><br/>Countless Demonic Cultivators and poisonous insects moved through the poison fog, with various spells bombarding the earth, scattering debris and wildly churning the toxic mists.<br/><br/>On closer look, there was a golden figure flashing swiftly in the direction they faced!<br/><br/>Boom!<br/><br/>The forest exploded, and a giant purple python as vast as a mountain range emerged like a dragon from the abyss, upon whose head stood a dazzling golden figure—Fang Wang himself.<br/><br/>Fang Wang’s body was covered with a Golden Scale White Feather Robe, and golden dragon auras swirled around him. He held the Heavenly Palace Halberd in his right hand, his valiant aura as if a divine general had descended from the heavens.<br/><br/>The Golden Scale White Feather Robe was stained with patches of blood, and Xiao Zi was also covered in wounds, but their momentum only grew more ferocious.<br/><br/>“Activate the Myriad Poison Array! Quick, raise the Myriad Poison Array!”<br/><br/>An old cultivator from Green Cicada Valley stood atop the head of a giant ant, his voice hoarse with urgency. As his words faded, a whooshing sound came from the darkness of the poison fog ahead. A cold light flashed, and the Qingjun Sword directly shattered his skull.<br/><br/>New corpses joined the old, uncooled ones!<br/><br/>Xiao Zi rolled forth, its mouth unexpectedly emitting Sword Qi, blasting away the Demonic Cultivators of Green Cicada Valley in its path. Where it passed, dust filled the air, flesh and blood flew, and screams of agony never ceased to reach the ears.<br/><br/>Fang Wang leapt into the air, his figure as majestic as an eagle, wielding the Heavenly Palace Halberd with both hands and furiously smashing downward. A middle-aged Demonic Cultivator tried to block with his knife only to be shaken until his arms and shoulders numbed, his face revealing a look of shock and horror.<br/><br/>He raised his eyes in fear, only to meet Fang Wang’s cold gaze.<br/><br/>Without any cruel words, Fang Wang forcefully exerted his strength, chopping off half of the man’s body, sending flesh and blood flying, as the middle-aged man screamed in intense agony.<br/><br/>“Stop him!”<br/><br/>Pang Tuntian’s voice rose shrilly, his face covered in blood, his arms made up of countless small blood insects, holding a whip in his right hand and a large flag in his left. As he spoke, he quickly gathered power, and a surging crimson miasma, like a tornado, barreled towards Fang Wang.<br/><br/>Fang Wang landed and charged directly towards him, unstoppable.<br/><br/>As he sprinted, he swiftly swung the Heavenly Palace Halberd, scattering the spells that attacked from all directions. Nine fire orbs floated behind his head, forcing the surrounding poison fog to stay away from him. His charge tore a rift through the poisonous morass of the wilderness.<br/><br/>Seeing Fang Wang approaching, Pang Tuntian, despite his trembling heart, immediately swung his whip, smashing it into the ground. The earth cracked open, and strands of blood-colored flames surged from the ground, extending towards Fang Wang.<br/><br/>Protected by the Solaris Scripture, Fang Wang ignored all flames and forced his way through, leaving Pang Tuntian in utter panic.<br/><br/>“This guy…”<br/><br/>Pang Tuntian’s heart was filled with terror, as he, with half of Green Cicada Valley’s power, was unable to suppress Fang Wang.<br/><br/>How was this possible!<br/><br/>Had the battle with the Sword Sect not cost Fang Wang anything?<br/><br/>Even with the power of the Heaven Yuan Spirit Treasure, there had to be a limit to Spiritual Power, right?<br/><br/>Pang Tuntian, realizing this, his eyes hardened with resolve, had no retreat left and was determined to slay Fang Wang.<br/><br/>He let out an enraged roar, his body of flesh exploding into countless blood insects, swarming towards Fang Wang as if to obliterate the sky.<br/><br/>Fang Wang leapt upward, and suddenly, the energy around him condensed into an azure dragon head. As an Azure Dragon, he met the overwhelming tide of blood insects head-on.<br/><br/>The sea of blood insects was torn asunder. Fang Wang’s gaze sharpened, and with his right hand wielding the Heavenly Palace Halberd, he thrust forward.<br/><br/>Thrust!<br/><br/>The halberd’s blade pieced through Pang Tuntian’s chest, revealing that he had not truly transformed into insects but was simply hidden among them.<br/><br/>“You…”<br/><br/>Pang Tuntian’s eyes bulged, his face, smeared with blood, resembling a fierce ghost.<br/><br/>Fang Wang’s right arm shook, and the Heavenly Palace Halberd immediately cleaved off his head. Endless blood insects tried to get close, but the nine fire orbs behind his head burnt them to ash.<br/><br/>The next second, Fang Wang, holding Pang Tuntian’s head, leaped out of the maelstrom of blood insects. He pulled out a cloth from his storage bag, quickly wrapped the head, and then placed it into the bag.<br/><br/>He then turned and, holding the Heavenly Palace Halberd, charged towards Xiao Zits location.<br/><br/>As the blood insect whirlwind dissipated, Pang Tuntian’s headless corpse fell to the ground.<br/><br/>“The Valley Master is dead, kill! We must avenge the Valley Master!”<br/><br/>A gaunt man shouted angrily. Clearly of high status, he stood on a toad as large as a hill with four poison flags revolving around him, gathering a formation.<br/><br/>All Green Cicada Valley cultivators who heard this saw red in their eyes. By now, they had forgotten their fear, their gaze fixed only on Fang Wang and Xiao Zi.<br/><br/>They must slay Fang Wang, or else he would remain an eternal menace!<br/><br/>Boom—<br/><br/>The ground shook violently, and the poison cloud in the distance churned intensely, coalescing into a rising magenta canopy that spread a thick oppressing sensation throughout the land..\t\t\t\t\t\t</div>", "images": {}, "success": true}