{"id": 96, "url": "https://www.novelhall.com/i-became-an-immortal-on-mortal-realm-32879/14285286.html", "title": "Chapter 96 - Chapter 96: Chapter 93: Unmatched In The World, Ninth Level Of Profound Heart Realm 1", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 96 - Chapter 96: Chapter 93: Unmatched In The World, Ninth Level Of Profound Heart Realm 1</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 96: Chapter 93: Unmatched in the World, Ninth Level of Profound Heart Realm 1<br/><br/>Translator: 549690339<br/><br/>Is it really that easy?<br/><br/>Fang Wang looked at Guang Qiuxian, feeling deeply moved.<br/><br/>He realized he had underestimated the power and say of a direct disciple. To become a direct disciple was essentially to be the next Sect Leader. Guang Qiuxian’s attitude was clearly meant to help him establish authority.<br/><br/>In Fang Wang’s eyes, Guang Qiuxian’s vitality indicated not more than thirty years of life left, and what’s more, he had suffered the same injuries as Yang<br/><br/>Yuanzi.<br/><br/>The elders and Peak Masters started to agree that Fang Wang was acting for the greater good, while also discussing the state of Da Qi. They had heard of the people’s suffering, but the Prime Minister of the imperial court was from the Chi Devil Sect.<br/><br/>Previously, they might have turned a blind eye for the peace of the Cultivation World, but now that Great Abyss Gate and Chi Devil Sect had reached a point of life-and-death struggle, they naturally supported Fang Wang’s decisions. They wished to see the Chi Devil Sect pay a price.<br/><br/>“Alright, you can go back to your cultivation. If you have any questions in the future, feel free to ask your elders,” said Guang Qiuxian, speaking up once more.<br/><br/>The elders and Peak Masters nodded, their expressions gentle as they faced Fang Wang.<br/><br/>Fang Wang did not bid farewell with a salute, but said, “Sect Leader, Master, I have something to discuss with you both privately.”<br/><br/>Guang Qiuxian raised his eyebrows, then with a sweep of his sleeve, the others took their leave. Fang Wang did not put on airs, saluting them as they departed.<br/><br/>Once the doors of Shiyuan Hall closed, leaving only the three of them, Guang<br/><br/>Qiuxian asked with a smile, “Fang Wang, what is it that you wish to discuss with just the two of us?”<br/><br/>Fang Wang remained calm as he spoke. Guang Qiuxian and Yang Yuanzi’s expressions changed drastically, their faces growing so dark it was as if they might drip with water.<br/><br/>Half an hour later.<br/><br/>Fang Wang walked out of Shiyuan Hall, a mysterious smile on his face, thinking, “Lu Yuanjun, let’s see if you can restrain yourself!”<br/><br/>He had not removed the Xuanming Seal from Guang Qiuxian and Yang Yuanzi completely, just suspended its effects. Even if the Xuanming Seal were directly lifted, Guang Qiuxian’s and Yang Yuanzi’s injuries would not fully recover, and their souls would still be damaged. However, suspending it could make Lu Yuanjun, with his mastery over the Yin Yang Xuan Ming Zhen Gong, suspect his own lack of power.<br/><br/>Guang Qiuxian and Yang Yuanzi did not know they were affected by the<br/><br/>Xuanming Seal, believing it was the Demon Monarch’s vicious Spiritual Power. Fang Wang did not want to risk them signaling Lu Yuanjun, so he did not reveal who was behind it.<br/><br/>Now, Guang Qiuxian and Yang Yuanzi would no longer suffer from the Xuanming Seal’s torment, but Lu Yuanjun was none the wiser.<br/><br/>Fang Wang was making a bet, gambling that Lu Yuanjun would return.<br/><br/>The Xuanming Seal could turn others into ghost soldiers; perhaps Lu Yuanjun would think of him.<br/><br/>He put himself in the other’s shoes; without the Heavenly Palace, having mastered the Yin Yang Xuan Ming Zhen Gong, he too would want to turn a powerful enemy into a ghost soldier.<br/><br/>However, the Yin Yang Xuan Ming Zhen Gong could not absorb ghost soldiers indefinitely. The number of ghost soldiers one could command varied with different levels of cultivation, with a maximum of eighteen simultaneously.<br/><br/>Moreover, if ghost soldiers were to grow, they needed to be fed with Spiritual Power. To Fang Wang, ghost soldiers were not particularly useful.<br/><br/>Personal strength was what mattered most!<br/><br/>Fang Wang returned to his cave-dwelling, sitting cross-legged on the white jade bed, extending his consciousness into the token of the direct disciple.<br/><br/>In an instant, his consciousness entered a surreal scene, where he could overlook the entire Great Abyss Gate. The nine veins, the main meridian, the Sect’s Main City were all there, with countless shimmering dots within. Outside the map of Great Abyss Gate, dots of light were sparse and at varying distances.<br/><br/>When Fang Wang focused his attention on a small dot, the identity information of that dot would emerge in his mind.<br/><br/>What a marvel! This was even more miraculous than Earth’s internet, almost like a virtual world.<br/><br/>As long as Fang Wang spread his consciousness over all the dots, he could speak to all the disciples through their tokens, or address just one individually. Even the tokens of Guang Qiuxian, Yang Yuanzi, and Tu Caiyi were among them.<br/><br/>What a treasure!<br/><br/>Later on, he could also use the token of the direct disciple to track down the whereabouts of people like Fang Hanyu.<br/><br/>Fang Wang noticed one dot that was very far from Great Abyss Gate. He concentrated on it, and the identity information of that dot surfaced in his mind.<br/><br/>First lineage, direct disciple, Zhou Xue.<br/><br/>Fang Wang was speechless; this guy could really run.<br/><br/>He searched but couldn’t find Lu Yuanjun’s disciple token. It seemed he truly had defected.<br/><br/>He then searched for Zhao Qi’s disciple token and sent a message to him, instructing him to go to the main meridian and find Vice Sect Leader Chai Yi, who would arrange his ascension.<br/><br/>In less than half an incense stick’s time, Zhao Qi appeared outside Fang Wang’s cave. He hesitated for a moment before speaking, “Sword Saint, are you there?” Fang Wang opened the cave gate and invited him in.<br/><br/>Zhao Qi walked in quickly, falling to his Imees in front of Fang Wang and kowtowing three times with force.<br/><br/>“Sword Saint, I will never forget your great kindness. Once I ascend the throne, I promise to forever treat the Fang Family well and to use them effectively, never allowing them to suffer any grievances.”<br/><br/>Hearing Zhao Qi’s promise, Fang Wang merely smiled faintly, speaking softly, “You just go ahead and do it. If there’s trouble, tell me. But remember, if you can’t be a good emperor for the people, I can make you and I can unmake you with just one word. I hope you live up to the aspirations you spoke of before.”<br/><br/>Zhao Qi raised his hand to swear, “If I, Zhao Qi, ever fail the people, then let me have an unfortunate old age, plagued with bad luck, and be without descendants to continue my line!”<br/><br/>Fang Wang nodded, “Go. The Vice Sect Leader will arrange everything.” Zhao Qi nodded, stood, and respectfully took his leave.<br/><br/>He had come specifically to express his stance and his gratitude.<br/><br/>Although Fang Wang appeared strict, he was quite pleased. Regardless of anything else, the fact that Zhao Qi thought to visit him first upon learning of his impending ascension was commendable.<br/><br/>Boom!<br/><br/>The sect gate closed, and Fang Wang couldn’t help but think of Tu Caiyi.<br/><br/>He was very curious about how this person had managed to ascend to the position of Vice Sect Leader. It seemed that during the years of his seclusion, Tu Caiyi had made quite an effort.<br/><br/>Once Zhou Xue returned, he would have to ask her about Tu Caiyi to see if she was trustworthy.<br/><br/>Fang Wang didn’t think any further and continued cultivating.<br/><br/>First, he would breakthrough to the seventh level of the Profound Heart Realm!<br/><br/>That day, the news of Fang Wang becoming the Great Abyss Gate’s Direct Disciple spread rapidly throughout the sect, with notices posted in all nine branches and the Sect’s Main City.<br/><br/>Almost all disciples agreed and were even excited about Fang Wang becoming the Direct Disciple. With such a figure leading them, every person harbored greater expectations for the future.<br/><br/>In the following half-month.<br/><br/>The news of Fang Wang becoming the Great Abyss Gate’s Direct Disciple spread throughout the Da Qi Cultivation Realm.<br/><br/>At the Suspended Vast Sword Sect, surrounded by a sea of clouds, the peak of a mountain broke through the clouds, and at the top, Xu Qiuming sat in front of an old tree, fiddling with a wooden sword in his hands.<br/><br/>A figure passed through the mist, approaching him—it was his sister, Xu Tian Jiao.<br/><br/>“Brother, Fang Wang has become the Great Abyss Gate’s Direct Disciple!”<br/><br/>Xu Tian Jiao said excitedly; she had once been saved by Fang Wang and had been curious about him ever since. Ever since the news about Fang Wang’s Heaven Yuan Spirit Treasure spread across the world, her interest in him had only increased.<br/><br/>Upon hearing this, Xu Qiuming stopped what he was doing and looked up with a smile, “What’s so surprising about him becoming the Direct Disciple, isn’t that expected?”<br/><br/>Xu Tian Jiao said thoughtfully, “But he’s only thirty-seven years old. Throughout history among the Nine Great Sects, no one has ever assumed the position of Direct Disciple at such a young age.”<br/><br/>Upon hearing this, Xu Qiuming’s expression became complex.<br/><br/>Ever since Fang Wang made his remarkable entrance, all geniuses in Da Qi paled in comparison. Now there were only two types of geniuses in the world: Fang Wang and all the others, and he, Xu Qiuming, was one of the others.<br/><br/>Xu Qiuming didn’t say much on the surface, but deep down, he was holding back a strong determination to prove that he was not inferior to Fang Wang!<br/><br/>Xu Tian Jiao talked ceaselessly, her words filled with curiosity and admiration<br/><br/>tor Fang Wang. Although Xu Qiuming couldn’t teel happy, he couldn’t get angry with his sister and could only force a smile and nod in agreement.<br/><br/>“By the way, Lv Changge has already issued a challenge to the Suspended Vast Sword Sect. He will come to challenge us in six months. Clearly, he is leaving the Great Abyss Gate for last, which is a disdain for our Suspended Vast Sword Sect,” Xu Tian Jiao brought up another matter, her face showing indignation.<br/><br/>She admired Fang Wang, but she did not have the same reverence for the Great Abyss Gate. In her opinion, a peerless genius like Fang Wang should have joined the Suspended Vast Sword Sect, especially since he had inherited the Sword Saint’s legacy, proving he was a Sword Cultivator.<br/><br/>In fact, the Suspended Vast Sword Sect indeed had plans to recruit him, but Fang Wang had been in seclusion all year round, and they simply hadn’t been able to get in touch with him.<br/><br/>After becoming the Direct Disciple, Fang Wang still kept a low profile and continued his seclusion, while the Great Abyss Gate did not assign him any tasks, hoping he would focus on cultivating.<br/><br/>All the disciples were reflecting on Fang Wang’s perseverance. With his unparalleled talent, he still cultivated so diligently, leaving no chance for others to overtake him.<br/><br/>And so, four years passed.<br/><br/>Fang Wang finally broke through to the ninth level of the Profound Heart Realm!<br/><br/>At the age of forty-one, having reached the ninth level of the Profound Heart Realm, he wanted to ask the world, who else could compare?<br/><br/>Ever since Fang Wang was promoted to Direct Disciple, the spiritual energy in his abode had greatly increased, indicating that the sect had indeed increased the resources allocated to him.<br/><br/>After the breakthrough, he spent seven days consolidating his cultivation. Once it stabilized, he burst out of his cave dwelling and stood on the edge of the cliff, shouting loudly.<br/><br/>Disciples passing by in the distance were startled, but when they turned and saw it was Fang Wang, they didn’t dare to disturb him.<br/><br/>Rumble—<br/><br/>The cave dwelling next door opened, and Gu Li walked out, her delicate and cool beauty unveiled as she wasn’t wearing a veil. She came beside Fang Wang and asked, “Feeling pent up?”<br/><br/>Fang Wang gave her a smile and said, “Miss Gu jests. Have I disturbed your cultivation?”<br/><br/>Gu Li shook her head lightly and said, “Half a year ago, I broke through to the eighth level of the Spirit Elixir Realm. Now, my cultivation doesn’t need too much focus, so you didn’t disturb me. Actually, I wanted to come out and take a look around myself.”<br/><br/>“Eighth level of the Spirit Elixir Realm, not bad at all,” Fang Wang praised. Gu Li stared at him and asked, “And you, what realm have you reached now?”<br/><br/>Fang Wang humbly replied, “I’m still in the Profound Heart Realm.”<br/><br/>After hearing this, Gu Li sighed and said, “It seems we won’t be able to spar when I reach the ninth level of the Spirit Elixir Realm. Thinking back, I was really naive.”<br/><br/>“If you want to spar, we can,” Fang Wang said with a soft chuckle.<br/><br/>You used a higher realm to fight me before, let me have a try now.<br/><br/>Gu Li gave him a roll of her eyes and asked, “Are you going to continue your seclusion?”<br/><br/>Fang Wang nodded, “Of course. I’m afraid of being attacked by Demonic Sects again if I go out.”<br/><br/>Gu Li suddenly felt like his words were truly irritating, making her want to act on her impulses. But realizing she was no match for him, she had to hold back.<br/><br/>“Tell me about the recent events in the Cultivation World,” Fang Wang said, noticing the look of resentment in her eyes, and quickly changed the subject.\t\t\t\t\t\t</div>", "images": {}, "success": true}