{"id": 97, "url": "https://www.novelhall.com/i-became-an-immortal-on-mortal-realm-32879/14285887.html", "title": "Chapter 97 - Chapter 97: Chapter 94 – Second In The World, Xiao Zi’S Insight [Third Update]_L", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 97 - Chapter 97: Chapter 94 – Second In The World, Xiao Zi’S Insight [Third Update]_L</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 97: Chapter 94 – Second in the World, Xiao Zi’s Insight [Third Update]_l<br/><br/>Translator: 549690339<br/><br/>Facing Fang Wang’s request, Gu Li didn’t refuse, as she just wanted to talk more with Fang Wang.<br/><br/>“Let’s start with Lu Yuanjun from Da Wei. Three years ago, he challenged the Suspended Vast Sword Sect, was defeated, and even imprisoned by them,” Gu Li said with a tone full of emotion.<br/><br/>Fang Wang asked in surprise, “Isn’t that normal? After all, the Suspended Vast Sword Sect is considered the strongest sect. They can’t just let Lu Yuanjun sweep through the Da Qi Cultivation Realm by himself, can they?”<br/><br/>If the Da Wei Cultivation World were really that strong, wouldn’t they have invaded and seized the Spirit Veins long ago?<br/><br/>At the beginning of Da Qi’s establishment, they had gone to war with Da Wei. His grandfather, Fang Meng, had participated, greatly defeating the Wei army and expanding the country’s territory by five hundred li.<br/><br/>The clash of dynasties indicated the rivalry in the Cultivation World. If Da Wei was defeated, it meant the Da Wei Cultivation World was also defeated.<br/><br/>Although mortals were unaware of the existence of Cultivators, these Cultivators would influence the warfare in the Mortal Realm, not by directly showing themselves, but by utilizing spells.<br/><br/>For example, when Qi Gaozu was nearly besieged by the lords and surrounded by the sound of Chu’s defeat, a shower of meteorites fell from the sky, instantly killing a hundred thousand enemies. The remaining forces were so terrified that they broke apart and fled.<br/><br/>Only after joining Great Abyss Gate did Fang Wang learn that the legendary battle was staged by the Suspended Vast Sword Sect, who dropped boulders from above the sea of clouds, disguising it as a natural disaster.<br/><br/>“The one who defeated Lu Yuanjun was not the Sect Leader of the Suspended Vast Sword Sect but Xu Qiuming, and moreover, he did so with a Profound Heart Realm cultivation defeating someone in the Condensation Spirit Realm. Now all over the Cultivation World, people are talking about him, calling him the second most talented person under the heavens,” Gu Li continued, glancing at Fang Wang with profound feeling.<br/><br/>This feat was impressive, but it still couldn’t shake Fang Wang’s status.<br/><br/>Fang Wang wasn’t surprised, Zhou Xue had already mentioned that Xu Qiuming was to be the future top Cultivator of Da Qi, and he would even leave Da Qi to reach the apex of the entire world.<br/><br/>Zhou Xue, before her ascension, might not have been his match; it’s a pity his fate wasn’t favorable, lacking the chance for ascension.<br/><br/>“Next, the second matter is that the Chi Devil Sect suffered a great loss from the Jin Xiao Sect’s attack. The power of Jin Xiao Sect is indeed formidable; since their emergence, they have never known defeat, and their ranks of experts continue to grow. Xiao Kuang’s reputation has already surpassed the four Guardian Kings; I truly don’t know where the Demon Monarch finds so many Great Cultivators,” Gu Li exclaimed in admiration.<br/><br/>Fang Wang had not yet met Xiao Kuang, but he had heard the name more than once.<br/><br/>Tu Caiyi is in the Condensation Spirit Realm, so this Xiao Kuang is very likely to be in the Condensation Spirit Realm too.<br/><br/>Tsk tsk, could the number of Jin Xiao Sect’s Condensation Realm Cultivators possibly surpass that of all the Nine Great Sects combined?<br/><br/>Of course, this was only on the surface. Just like Kong Xi of the Sword Sect, before challenging Fang Wang, he never told the world that he had achieved the Condensation Spirit Realm.<br/><br/>Gu Li continued to speak of matters in the Cultivation World, and Fang Wang listened earnestly, occasionally sharing her sense of wonder, as if those who stirred the winds and clouds were beyond his reach.<br/><br/>Meanwhile,<br/><br/>Inside the Shiyuan Hall, Guang Qiuxian and Yang Yuanzi were also having a conversation.<br/><br/>Yang Yuanzi spoke with emotion, “This Junior Sister Chai is indeed formidable. She has already helped Zhao Qi consolidate his government and even assist him in balancing the power of other sects’ minions.”<br/><br/>Guang Qiuxian, stroking his beard with a smile, said, “Of course. Our master never casually takes in disciples from the outside. Being able to accept her, she is naturally extraordinary. She has even mastered our master’s supreme technique, achieving a level of proficiency beyond even what you and I dared to imagine.”<br/><br/>Thinking back, Yang Yuanzi said with a complicated expression, “When she wanted to be the Vice Sect Leader, I almost clashed with her. Luckily, she gave me face and didn’t embarrass me, choosing instead to prove her abilities through completing missions.”<br/><br/>Guang Qiuxian smirked with pride, “Without her being so assertive, how could Great Abyss Gate have acquired so many Spirit Veins? And those noble families, would they willingly contribute multiple times more resources?”<br/><br/>Yang Yuanzi snorted, “As much as that’s true, you ought to be careful with her. After all, Chen Anshi is a lesson from the past.”<br/><br/>Upon mentioning Chen Anshi, Guang Qiuxian’s smile faded. Chen Anshi’s betrayal was his greatest pain.<br/><br/>He even felt guilty towards Lu Yuanjun, thinking that if he hadn’t let Chen Anshi take the young Lu Yuanjun out for experience, Lu Yuanjun would not have ended up as he was now. Therefore, even when Lu Yuanjun defected, he couldn’t bring himself to issue a warrant for his arrest.<br/><br/>“Let’s talk about Jin Xiao Sect. We’ve been recuperating for many years; it’s time to face the threat of the Jin Xiao Sect. They attacked the Chi Devil Sect, and along with the incident at Green Cicada Valley, they’ve demonstrated their strength not fearing the Nine Great Sects,” said Guang Qiuxian gravely.<br/><br/>Yang Yuanzi frowned, picturing the Demon Monarch’s figure filled with apprehension.<br/><br/>Guang Qiuxian also frowned, his voice solemn, “The Demon Monarch’s strength is unfathomable. Before the Demonic Path raided Great Abyss Gate, I sparred with her. At that time, I felt she could have killed me but deliberately spared my life, seemingly preferring to watch us and the Demonic Path fight amongst ourselves.”<br/><br/>Yang Yuanzi raised an eyebrow and asked, “That’s when you were cursed in the same way as I was?<br/><br/>“That seems likely.”<br/><br/>“Why didn’t you tell me? I thought you were attacked by the Demon Monarch while escorting Lu Yuanjun.”<br/><br/>“How could I tell you that I couldn’t handle the Demon Monarch? That’s embarrassing. Besides, she only tested me for a while before leaving.”<br/><br/>“Heh, you do love to protect your pride,” replied Yang Yuanzi mockingly.<br/><br/>Taunted by Yang Yuanzi, Guang Qiuxian snorted and said, “No matter. Fang Wang has already grown so much. Once he breaks through to the Condensation Spirit Realm, the Demon Monarch might not be his match!”<br/><br/>Talking about Fang Wang, Guang Qiuxian became proud again. During his time as Sect Leader, having a genius like Fang Wang emerge from the Great Abyss Gate meant that even in death, he could face the previous Sect Leaders proudly!<br/><br/>“My disciple is destined to be invincible under the heavens, but if Lu Yuanjun comes back, and they fight, you can’t protect Lu Yuanjun anymore! That rascal struck me with a palm when I was helping him; he’s truly detestable! ” Yang Yuanzi couldn’t help getting angry as he talked about Lu Yuanjun, cursing nonst0D.<br/><br/>Guang Qiuxian let out a wry smile, sighed, and said, “We’ve done our best to protect his life. If he comes back and dies at Fang Wang’s hands, then it’s his fate. But tell me, do you think Fang Wang knows the truth?”<br/><br/>Yang Yuanzi said calmly, “Nonsense, if he didn’t know, why would Fang Wang fight for the position of head disciple with his temperament?”<br/><br/>Guang Qiuxian fell silent, then asked, “Do you think he will hold a grudge against us?”<br/><br/>Yang Yuanzi shook his head and replied, “I’m not clear about what’s on his mind, but at least outwardly, he still shows us respect. You can’t expect him to have no hard feelings at all, can you? He’s human after all. Let’s just leave the matter as it is. You and I don’t have many years left anyway. What does it matter if he blames us, as long as he doesn’t hold a grudge against the Great Abyss Gate? Fortunately, he treats his fellow sect members extremely well and never bullies the weak.”<br/><br/>After hearing this, Guang Qiuxian felt it made sense, but he still couldn’t help sighing deeply.<br/><br/>“Junior brother, when we die, if we see her, do you think she will reproach us?”<br/><br/>“Why would she reproach us? True, she did save our lives back then, but we’ve repaid that debt. She got what she deserved for insisting on marrying that guy.<br/><br/>Look at the kind he is, nothing good!”<br/><br/>Yang Yuanzi cursed through gritted teeth, his eyes brimming with sorrow.<br/><br/>Guang Qiuxian said earnestly, “Junior brother, stop thinking about her. It’s my fault for not protecting you better. The first time I took you down the mountain for training, we were ambushed by the Demonic Path. If she hadn’t stepped in, we would both be dead. And because it was your first time descending the mountain and you hadn’t experienced the rolling waves of the mortal world, you fell for her. It’s all my fault.”<br/><br/>Yang Yuanzi snorted, “What nonsense are you talking about? How could I possibly have fallen for her!”<br/><br/>Guang Qiuxian wanted to say something more but ultimately let out a heavy sigh.<br/><br/>“Let’s continue discussing the Jin Xiao Sect. I suggest we join forces with the righteous sects, come to a consensus, and share intelligence about the Jin Xiao Sect. If possible, join hands to eradicate them!” Yang Yuanzi changed the topic, his face taking on a fierce expression when he spoke of the Jin Xiao Sect.<br/><br/>Guang Qiuxian began to ponder as well.<br/><br/>After talking with Gu Li for a full hour, the two finally bid each other farewell.<br/><br/>Back in his cave abode, Fang Wang sat on the white jade bed with an expression that suggested his thoughts lingered.<br/><br/>The heroes of the world constantly vied for supremacy, and he too wished to…<br/><br/>Cough, cough, he too wished to bring glory to the Great Abyss Gate!<br/><br/>Unfortunately, he had to restrain himself and break through to the Condensation Spirit Realm first.<br/><br/>“My lord, what’s with that look? You’re not pining for her, are you?”<br/><br/>Xiao Zi lay on the table, watching Fang Wang’s expression, and couldn’t help but ask.<br/><br/>Fang Wang gave it a glance and said irritably, “Whomever I pine for is none of your business.”<br/><br/>Xiao Zi flicked its tongue and asked, “My lord, should I learn the Transformation Technique and become Gu Li to satisfy you? You can do whatever you want with me.”<br/><br/>Upon hearing this, Fang Wang almost shattered the white jade bed. He glared at Xiao Zi and scolded, “What are you thinking about with that tiny brain of yours, and where did you learn it from? I haven’t seen you go out!”<br/><br/>“Of course, I learned it in the Great Saint’s Grotto-Heaven. It was demonstrated by your human cultivators. That female cultivator liked to change into various forms to please the male cultivators. Every time, the male cultivator would praise her greatly. Don’t you like this sort of thing, my lord?” Xiao Zi asked seriouslv.<br/><br/>“Nonsensical talk! Whether I like it or not, what does it matter to you? You’re just a snake, so mind your behavior, or else be careful, I’ll discipline you!” Fang Wang chastised.<br/><br/>He couldn’t let the snake continue speaking!<br/><br/>It was causing him to be swept up in wild thoughts!<br/><br/>Demons are demons, always trying to corrupt my cultivation heart!<br/><br/>Fang Wang waved his hand and flicked Xiao Zi into a small pond behind him and then began to meditate and cultivate.<br/><br/>Xiao Zi popped its head out of the water, its wet head fixated on Fang Wang’s silhouette as it flicked its tongue incessantly, contemplating something.<br/><br/>In a dimly lit cave chamber.<br/><br/>Lu Yuanjun, who was practicing his technique, opened his eyes with a frown, muttering to himself, “Why can’t I succeed? What exactly is the problem?”<br/><br/>Zhao Zhen, floating above a black gourd, asked, “Could it be that you haven’t mastered it at all?”<br/><br/>“It’s possible, but then how could I have absorbed their spirits before?” Lu Yuanjun was at a loss.<br/><br/>Zhao Zhen spread his hands and said, “It’s quite normal. The more you absorb, the stronger the ghostly soldiers become, and your mastery still needs improvement. Forget about Fang Wang for now. By the time you fully master the Yin Yang Xuan Ming Zhen Gong, I suspect Fang Wang will have left Da Qi already.”<br/><br/>“His treasure is the Heaven Yuan Spirit Treasure, and no one knows how fast his cultivation is progressing. Just accept it, you’re not his match.”<br/><br/>As soon as the words fell, Lu Yuanjun looked up, staring coldly at Zhao Zhen, who quickly shut his mouth in fright.<br/><br/>Lu Yuanjun snorted coldly, his gaze flickering as he said, “Yes, I can’t wait any longer. The longer I wait, the more troublesome it becomes..”\t\t\t\t\t\t</div>", "images": {}, "success": true}