{"id": 94, "url": "https://www.novelhall.com/i-became-an-immortal-on-mortal-realm-32879/14284494.html", "title": "Chapter 94 - Chapter 94: Chapter 91 True Great Perfection, The Path Of", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 94 - Chapter 94: Chapter 91 True Great Perfection, The Path Of</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 94: Chapter 91 True Great Perfection, The Path of<br/><br/>Yin and Yang! [Third Update, Request for Monthly Pass]_l<br/><br/>Translator: 549690339<br/><br/>After hearing Zhao Qi’s words, Fang Wang felt quite emotional.<br/><br/>Zhao Zhenzhen was ruthless!<br/><br/>He even included the possibility of his own death in his plan, wanting Fang Wang to avenge him—and, most crucially, Fang Wang couldn’t refuse, because killing Lu Yuanjun was also his own desire.<br/><br/>Fang Wang stared at Zhao Qi and asked, “Although Lu Yuanjun is the source of all problems, it’s the imperial power that wants to destroy the Fang Family. How do you know I wouldn’t want to kill you first, then kill Lu Yuanjun?”<br/><br/>Zhao Qi looked up and said, “Because I have inquired about what kind of person you are. Since you started your cultivation journey, all those you have killed were evildoers. You inherited the Sword Saint legacy, and even when your sect clearly wanted you dead, you let them go in the name of the Sword Saint’s principle of not taking lives. This shows your respect and duty to your teacher. You have taught so many swordsmen in Sword Heaven Marsh without holding back any of the Sword Saint’s teachings, which shows your magnanimous nature.”<br/><br/>“A person of respect, righteousness, like yourself, how could you not understand gratitude and grudges? Of course, if you insist on killing me, then do it. You are my only hope. If you don’t help me, there’s no point in my life.” Fang Wang squinted his eyes and asked, “Who told you these things?”<br/><br/>“Your brother, Gu Tianxiong!”<br/><br/>Suddenly, Fang Wang was at a loss for words. Was Gu Tianxiong really praising him like that outside?<br/><br/>However, he indeed had no intention to kill Zhao Qi. After all, Zhao Qi was also a victim, and his grandfather, Fang Meng, still cherished the friendship with Qi Gaozu.<br/><br/>Fang Wang took the jade slip from Zhao Qi’s hand and calmly asked, “What do you want my help with? It cannot be just to kill Lu Yuanjun.”<br/><br/>Zhao Qi revealed a look of happiness. Clenching his fists, he said, “Now the Da<br/><br/>Qi Dynasty is controlled by the Prime Minister’s hands. Although he is the Prime Minister, he has become the emperor in all but name. He only favors his own people, acts brutally, and replaces ministers daily. I’ve investigated, and this Prime Minister is the progeny of an elder from the Chi Devil Sect. He brutally conscripts the commoners to mine spirit veins without regard for their lives, where none of the conscripted return alive. If this continues, chaos will ensue, and perhaps in many years, Da Qi will truly become a Cultivation Dynasty, but that dynasty will certainly not be Da Qi!”<br/><br/>“Sword Saint, you were born in the Fang State Duke’s Mansion. The old Duke Fang knew the founder from his humble beginnings, and after fighting side by side for twenty years, they established this Da Qi Dynasty. The world of Da Qi contains the blood, sweat, and tears of the Fang family. Can you really stand by and watch Da Qi crumble? Please help me ascend to the throne. As the top talent of the Great Abyss Gate, if you recommend me, the Great Abyss Gate will have to support me wholeheartedly. Lu Yuanjun might not be able to suppress you!”<br/><br/>“If I ascend, I will certainly promote the Fang State Duke’s Mansion, appointing the Duke of Fang as the Prime Minister!”<br/><br/>After speaking, Zhao Qi fervently kowtowed, pressing his forehead to the ground, unwilling to lift it.<br/><br/>Fang Wang stared at him and said, “It is an inevitable trend for Da Qi to transform into a Cultivation Dynasty. How can one person reverse such a trend?”<br/><br/>Zhao Qi said solemnly, “I am not asking you to reverse the trend, but rather to delay the process. If we prolong the period, not as many people will die. The Nine Great Sects are eager for quick success and have allowed a member of the Chi Devil Sect to become the Prime Minister. They pretend not to know and only wish to reap the benefits.”<br/><br/>Fang Wang thought of his grandfather, his commoner friends he made in Southern Hills City before he began his cultivation, and his past life.<br/><br/>All these images flashed quickly before his eyes.<br/><br/>His rational mind told him that one should be selfish in cultivation, striving for immortality, and in a thousand years, the world of men would have changed countless times.<br/><br/>There has always been a distinction between mortals and immortals, and it was not just an empty saying.<br/><br/>But then he thought of his grandfather’s words.<br/><br/>“My dear grandson, immortality is illusory and elusive. What matters most in a lifetime is what kind of person you become, and if you manage to become an immortal who can live forever, then you must consider what kind of immortal you want to be.”<br/><br/>Fang Wang sighed. Actually, this matter wasn’t difficult and didn’t require him to risk life and death. He just needed to give a push and support Zhao Qi.<br/><br/>“Enough, go back and wait for my message. This cannot be rushed, especially since the Sect Leader is still recovering,” Fang Wang finally said. Upon hearing this, Zhao Qi was overjoyed. He thanked Fang Wang profusely and then rose to leave.<br/><br/>Fang Zigeng turned to leave as well but was stopped by Fang Wang.<br/><br/>Zhao Qi turned back, hesitating, “Predecessor, Brother Fang and I are not close.<br/><br/>It was I who approached him. His stance is to listen to you completely.”<br/><br/>Fang Wang slightly nodded. Seeing this, Zhao Qi had no choice but to leave.<br/><br/>After Zhao Qi left, the mountain gate closed.<br/><br/>Fang Zigeng asked nervously, “Fang Wang, you won’t blame me for bringing him here, right?”<br/><br/>Although the two were cousins, Fang Wang’s renown had become so great over the years that even he felt a slight fear. With his slaughter of at least five thousand people in the battle with Green Cicada Valley, his achievements were something the cultivators of the world could not overlook.<br/><br/>“What are you thinking? We are brothers. Why make it so formal? I asked you to stay because I wanted to check the Yin Yang Xuan Ming Zhen Gong. If it’s real, then you can take it for your cultivation,” Fang Wang said with slight annoyance. “Han Yu said that you are the most diligent cultivator among them; it’s only because of your limited talent that you aren’t progressing faster. The Yin Yang Xuan Ming Zhen Gong is a divine skill of our times; it will definitely compensate for the flaws in your talent.”<br/><br/>“Really? But I couldn’t possibly…” Fang Zigeng said, delighted yet hesitant. Fang Wang laughed and said, “Family doesn’t keep accounts with each other.” With that, he took the jade slip and read it with his spiritual sense.<br/><br/>Fang Zigeng took a deep breath, sat down at the nearby stone table, and stared blankly at Fang Wang, his heart brimming with countless emotions.<br/><br/>Fang Wang radiated such brilliance—if he claimed he didn’t feel any envy, that would be impossible.<br/><br/>After so many years in cultivation, everyone had changed, and so had the disciples of the Fang Residence. It seemed, however, that only Fang Wang hadn’t changed.<br/><br/>He was still as open-minded and magnanimous as ever. From childhood to adulthood, he had always been like this, always able to attract the affection of elders and the admiration of peers.<br/><br/>Fang Zigeng looked at Fang Wang, his heart filled with emotion.<br/><br/>At the same time, he made a decision, he would certainly repay Fang Wang in the future, even if it meant exchanging his life for Fang Wang’s.<br/><br/>Nineteen years ago, had it not been for Fang Wang’s intervention, that night he would have perished alongside the Fang Residence. He already owed Fang Wang his life.<br/><br/>Fang Wang was unaware of what Fang Zigeng was thinking at the moment, his focus was entirely on reading the Yin Yang Xuan Ming Zhen Gong. With Xiao Zi around, he was not afraid of Fang Zigeng launching a surprise attack on him.<br/><br/>After a long while,<br/><br/>Fang Wang’s eyes changed, and Fang Zigeng, who had been watching him, couldn’t help but anxiously ask, “What’s wrong? Is there a problem with this cultivation technique?”<br/><br/>Fang Wang closed his eyes, exhaled a long breath, and upon reopening them, he looked at Fang Zigeng and said, “There’s no problem with the cultivation technique, here, take it, practice well. If you succeed, the name Fang Zigeng will surely be known in this world.”<br/><br/>The Jade Slip floated into Fang Zigeng’s hands, and he looked at Fang Wang, somewhat astonished.<br/><br/>For some reason, he always felt like Fang Wang had suddenly changed, but he couldn’t quite put his finger on what exactly had changed.<br/><br/>“By the way, tell me, what major events have occurred in the Cultivation World recently?” Fang Wang asked, as Xiao Zi climbed onto his shoulder.<br/><br/>Xiao Zi looked at Fang Wang’s profile and thought to herself that the strange state had appeared again!<br/><br/>Fang Zigeng collected his thoughts and said, “If we’re talking about the biggest events of the past three years, it would have to be the destruction of the Green Cicada Valley. Jin Xiao Sect’s Xiao Kuang invaded Green Cicada Valley on his own, wreaked havoc with a massacre, and directly killed the new valley leader. Following that year, the four Guardian Kings of Jin Xiao Sect collectively sought vengeance against Green Cicada Valley, relentlessly pursuing and killing them. Now, there are no disciples of Green Cicada Valley left in the<br/><br/>Cultivation World, at least not openly. As a result, Jin Xiao Sect has taken Green<br/><br/>Cicada Valley’s place as one of the Nine Great Sects.”<br/><br/>Fang Wang’s gaze shifted subtly, and he felt an inexplicable joy at the thought of a particular possibility.<br/><br/>“Besides that, there is a cultivator from the Da Wei Dynasty who is challenging the top experts of the major sects. His name is Lv Changge. The leaders of Huangyu Mountain, Ancient Demon Mountain, and Crimson Sect have consecutively been defeated by him. Where he’ll go next is unknown to anyone.”<br/><br/>Fang Zigeng spoke with a look of envy in his eyes.<br/><br/>Such carefree and spirited life, when could he possess it?<br/><br/>Though he was modest and honest, he also harbored a desire to be renowned across the world.<br/><br/>Fang Wang listened with great interest; as for Lv Changge, he didn’t take him seriously at all.<br/><br/>After three years in closed-door cultivation, he had reached the fifth layer of the Profound Heart Realm. Compared to three years ago, his strength was unfathomably greater.<br/><br/>Thus, Fang Zigeng continued speaking, and after completing an entire hour, Fang Wang finally let him leave.<br/><br/>Once the sect gate closed, Xiao Zi couldn’t wait to ask, “Young master, is the<br/><br/>Yin Yang Xuan Ming Zhen Gong powerful?”<br/><br/>Fang Wang revealed a smile and responded, “Powerful, and not just ordinarily so. ”<br/><br/>It took him a full three hundred eighty years to master the Yin Yang Xuan Ming<br/><br/>Zhen Gong, and that was on top of having the Nine Dragons Divine Transformation Art and True Combat Technique. Initially, he didn’t find it difficult, as many points were similar to the True Combat Technique. However, the longer he cultivated it, the more he felt the immense power of the technique.<br/><br/>This was an intricate supreme art involving the principles of Yin and Yang and the Ghost Path!<br/><br/>It had the power to capture souls, reanimate the dead, and reveal the secrets of Yin and Yang!<br/><br/>The most formidable technique within it was the Xuanming Seal. If it were imprinted on an enemy, it would attach to their soul. Once imprinted, even if separated by the ends of the earth, the caster could continuously erode the imprinted person’s soul through the seal. The portions of the soul that were absorbed would slowly be transformed into ghost soldiers for the caster.<br/><br/>The stronger the ghost soldiers, the weaker the victim’s soul would become until the ghost soldiers reached Great Completion. At that point, the victim would be left soulless, merely a shell suffering a painful death.<br/><br/>Fang Wang had mastered the Yin Yang Xuan Ming Zhen Gong to Great<br/><br/>Perfection. Facing an enemy with inferior cultivation, he could extract their soul with a single palm strike, transforming it into ghost soldiers for his own use!<br/><br/>Furthermore, he could even interrupt the soul-to-ghost soldier transformation process and, through the Xuanming Seal, grant power to the imprinted person!<br/><br/>This process could transcend spatial distances!<br/><br/>Incalculably profound!<br/><br/>Without exaggeration, the Yin Yang Xuan Ming Zhen Gong was the most exquisite technique he possessed. Its strength wasn’t just in terms of destructive power or lethality; it was both deadly and aided him in entering the realms of the Yin and Yang, the Ghost Path.<br/><br/>Precisely because the Yin Yang Xuan Ming Zhen Gong was so vast and complex, Fang Wang’s three hundred eighty years didn’t pass in monotony; each day brought new discoveries and insights, which he relished endlessly.<br/><br/>Of course, the Xuanming Seal was not invincible. If there was too large a gap in realm, he couldn’t forcibly penetrate the enemy’s power and control their soul.<br/><br/>The True Combat Technique helped him master magic artifacts and weapons, the Yin Yang Xuan Ming Zhen Gong aided him in mastering the paths of Yin and Yang, and what about the Heavenly Gang Sheng Ti Zhen Gong?<br/><br/>At this moment, Fang Wang’s longing for the Heavenly Gang Sheng Ti Zhen Gong reached its peak; he still remembered what Zhao Qi had said.<br/><br/>Collecting the Three Great True Cultivations could grant one a chance at an immortal fate.<br/><br/>What kind of fate would that be?<br/><br/>Fang Wang’s heart was brimming with confidence and anticipation; he had embarked on a path completely different from Zhou Xue. Zhou Xue had said that in her previous life, she had not obtained the Ji Hao Sect’s Three Great True Cultivations.<br/><br/>Only by walking different paths could they keep pace with each other, or even surpass one another!\t\t\t\t\t\t</div>", "images": {}, "success": true}