{"id": 93, "url": "https://www.novelhall.com/i-became-an-immortal-on-mortal-realm-32879/14284493.html", "title": "Chapter 93 - Chapter 93: Chapter 90 Yin Yang Xuan Ming Zhen Gong, A Fateful Encounter Appears_L", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 93 - Chapter 93: Chapter 90 Yin Yang Xuan Ming Zhen Gong, A Fateful Encounter Appears_L</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 93: Chapter 90 Yin Yang Xuan Ming Zhen Gong, A Fateful Encounter Appears_l<br/><br/>Translator: 549690339<br/><br/>Facing Fang Wang’s inquiry, Zhou Xue didn’t open her eyes, calmly answering, “I just don’t want them to fuss over this. Even if I said I would remain unmarried all my life, they probably wouldn’t rest easy. It’s better to set up a marriage agreement now. After all, both of us need to focus on cultivation, and this status won’t affect much. Of course, if you’re concerned about that junior sister, you can refuse.”<br/><br/>After some thought, Fang Wang said, “I’m also averse to trouble. I don’t want to get married and have children; I just want to practice cultivation. Let’s do it this way—we’ll set up a marriage agreement first to get by for now.”<br/><br/>Zhou Xue responded with a hum. Seeing she didn’t want to talk anymore, Fang Wang didn’t bother her further and turned to leave.<br/><br/>After leaving the cave residence, Fang Wang flew towards the peak of the Third vein.<br/><br/>“Master, didn’t Tu Caiyi previously say that Zhou Xue is the Demon Monarch’s disciple? Since when does a mentor listen to their disciple’s arrangements? Could this be a trick?” Xiao Zi huddled in Fang Wang’s embrace, asking through the Sound Transmission Technique.<br/><br/>Fang Wang replied using the Sound Transmission Technique, “Who knows? Just pretend you didn’t hear anything.”<br/><br/>Demon Monarch?<br/><br/>Interesting.<br/><br/>Upon calculation, Jin Xiao Sect’s emergence coincided nearly with my time of cultivating.<br/><br/>And coincidentally, the Demon Monarch happens to be a woman…<br/><br/>Why would a reborn individual need to find a mentor?<br/><br/>Joining the Great Abyss Gate was for resources; why join Jin Xiao Sect?<br/><br/>Moreover, Zhou Xue was able to mobilize Cao Ran and Tu Caiyi, the two Guardian Kings—her position did not seem as simple as just being a disciple of the Demon Monarch.<br/><br/>The Demon Monarch spared Lu Yuanjun for the sake of a Ghost Instrument and spared Yang Yuanzi for what purpose?<br/><br/>Fang Wang had previously harbored a bold guess, but he did not directly ask. Some things are better left unstated. With the existence of Jin Xiao Sect, the Fang Family could be safer.<br/><br/>After experiencing so many things, Fang Wang trusted Zhou Xue. If a person trusts no one, how pitiable they are; it meant he lacked judgment. To be cautious, even if Zhou Xue did have ulterior motives, why bother with elaborate plans? There were plenty of ways to take control of him earlier.<br/><br/>Of course, Fang Wang must always remain cautious. He could trust others, but the person he must trust the most is himself.<br/><br/>Strive to cultivate, to keep growing, and always have a trump card—that’s the real confidence to handle all crises!<br/><br/>Soon.<br/><br/>Fang Wang arrived at the peak of the Third Vein, descended in front of Qingxin<br/><br/>Hall, and bent slightly to salute, “Disciple has come to see Master!”<br/><br/>Fortunately, there were no disciples cleaning around Qingxin Hall, which spared him some trouble.<br/><br/>This time returning, he could feel that Great Abyss Gate was still in sorrow, each Vein quieter and more desolate than before.<br/><br/>The doors to Qingxin Hall opened.<br/><br/>Fang Wang walked straight in, and upon entering, he saw Yang Yuanzi’s figure meditating—pale-faced with dry lips, devoid of his usual vitality.<br/><br/>Upon seeing Fang Wang return, Yang Yuanzi smiled and said, “Disciple, you’ve finally come back. You’ve truly made your master proud!”<br/><br/>Seeing Fang Wang genuinely delighted Yang Yuanzi.<br/><br/>He started effusively praising Fang Wang’s performance, and Fang Wang could only respond modestly.<br/><br/>After a while, Fang Wang found a moment to inquire, “Master, are you injured?”<br/><br/>Yang Yuanzi nodded and said, “Injured by a Demonic Cultivator, but not fatally.<br/><br/>You needn’t worry. Don’t dwell on the calamity that befell Great Abyss Gate.<br/><br/>From now on, focus on your cultivation. With your talent, reaching the<br/><br/>Condensation Spirit Realm is not difficult. Once you enter the Condensation Spirit Realm, you will have the final say in the Da Qi Cultivation Realm and need not be concerned with others.”<br/><br/>His tone was weary, his smile forced.<br/><br/>Seeing that he intended to conceal the matter regarding Lu Yuanjun, Fang Wang knew that he wanted to save Lu Yuanjun’s life.<br/><br/>The revelation of the Ghost Instrument meant that the deeds Lu Yuanjun had committed could no longer be hidden; Yang Yuanzi might even be aware that Lu Yuanjun’s subordinates nearly annihilated Fang Wang’s entire family.<br/><br/>Understanding this, Fang Wang naturally felt uncomfortable, but since Yang Yuanzi was his master, he couldn’t blame him.<br/><br/>The conversation between master and disciple continued, with Yang Yuanzi mostly instructing him on how to become a great disciple of Great Abyss Gate, though the atmosphere was less enthusiastic than before.<br/><br/>“By the way, Master, regarding the transformation of Da Qi into a Cultivation<br/><br/>Dynasty, how much do you know, and what needs to be done for it to succeed?<br/><br/>Must the common people be enlisted to dig for Spirit Veins?” Fang Wang asked.<br/><br/>He hadn’t forgotten about his grandfather’s affairs.<br/><br/>Yang Yuanzi replied, “I don’t know much. The Qi Dynasty indeed conscripted commoners to help dig Spirit Veins, and the Nine Great Sects are setting up Formations. It will take many years but once successful, the land where Da Qi lays will see a surge in Spiritual Energy, and the number of Cultivators will undoubtedly double, and the Condensation Spirit Realm may no longer be the pinnacle of the Da Qi Cultivation Realm.”<br/><br/>He paused, speaking earnestly, “The process is long and arduous, involving complex layers of society. There will always be a darker side to it. It is deemed worthy if it means hard work from one generation can usher in success for countless generations.”<br/><br/>The words resonated harshly with Fang Wang.<br/><br/>At first glance, it made sense, but the present generation of commoners lives only once; ‘reincarnation’ is actually another person altogether.<br/><br/>Fang Wang, too, was a Cultivator. He had no right to condemn Yang Yuanzi, neither the power to sway this matter.<br/><br/>“Go back and cultivate. As for going to see the Sect Leader, there’s no need. His injuries are more severe than mine, and it’s uncertain how many more years he can last.”<br/><br/>Yang Yuanzi waved his sleeve, then closed his eyes to continue his healing.<br/><br/>Fang Wang raised his hand in salute, then turned to leave.<br/><br/>Several breaths later, the doors of Qingxin Hall closed once more.<br/><br/>Yang Yuanzi slightly furrowed his brow, his hands quickly working to channel energy, only to see that another figure separated from his shadow, as if a ferocious ghost was struggling, its shape hideous and terrifying.<br/><br/>Before returning to his cave abode, Fang Wang went to find Fang Hanyu, who happened to be inside his dwelling. He too had been injured and was healing. Fang Wang told him the information he had gathered, asking him to write a letter to their grandfather when he had the chance.<br/><br/>Fang Hanyu agreed without hesitation and then urged him to go out less in the near future.<br/><br/>Fang Wang’s momentum was too strong, and he was worried that Fang Wang would encounter an even more terrible siege.<br/><br/>Fang Wang nodded in agreement, then stood up and returned to his cave abode.<br/><br/>Upon returning to the cave abode, Fang Wang finally let out a long breath.<br/><br/>“I’m finally back! ”<br/><br/>Fang Wang exclaimed, reflecting that everything he had experienced since he had learned the Celestial Sword Intent to this day was more thrilling than anything he had experienced before, yet it also left him feeling exhausted.<br/><br/>In the days to come, he planned to cultivate diligently, striving to reach the Condensation Spirit Realm as soon as possible, and then to condense his fourth Lifespirit Treasure!<br/><br/>Tu Caiyi and the demonic cultivators from Green Cicada Valley had witnessed his use of the Nine Dragons Divine Transformation Art, and he urgently felt the need for greater strength. Only then could he settle down.<br/><br/>Once he broke through to the Condensation Spirit Realm, Fang Wang intended to seek out the Heavenly Gang Sheng Ti Zhen Gong.<br/><br/>To obtain the Heavenly Gang Sheng Ti Zhen Gong, one must first master the<br/><br/>Nine Dragons Divine Transformation Art. This indicated that the Heavenly Gang Sheng Ti Zhen Gong was a more advanced technique, which was why Fang Wang had been fixated on it for so many years.<br/><br/>Fang Wang tossed all the storage pouches from his waist onto the table, then stripped off his clothes and headed towards the small pool to take a bath. Although Xiao Zi’s water-based spell had cleaned him, he still felt the need for a physical bath to truly feel refreshed.<br/><br/>Xiao Zi lay on the white jade bed, watching Fang Wang and hissing softly, her thoughts unknown.<br/><br/>The news of Fang Wang cutting through Green Cicada Valley spread throughout the Da Qi Cultivation Realm. Great Abyss Gate, which had just experienced an invasion by demonic forces, gained great notoriety because of this—equivalent to repelling the entire demonic path with the might of one sect!<br/><br/>Though Great Abyss Gate suffered great losses, it gained even greater prestige. More and more cultivation families came to visit, bringing either resources or family juniors to offer.<br/><br/>In just one short year, Great Abyss Gate replenished its numbers of disciples, and even major righteous sects began to send envoys to establish better collaborative relations.<br/><br/>Spring went and autumn came.<br/><br/>Three years passed by.<br/><br/>The name of Fang Wang still circulated in the Da Qi Cultivation Realm. He had become the most admired prodigy among the younger generation, and he had fully inherited the title of Sword Saint. Even the older generation cultivators didn’t dare to underestimate him. When the Nine Great Sects preached and imparted their teachings, they would mention him, claiming that the Da Qi<br/><br/>Cultivation Realm was about to experience unprecedented changes because of Fang Wang.<br/><br/>Gradually, the renown of Fang Wang began to spread to the surrounding dynasties’ realms of cultivation.<br/><br/>Da Qi was surrounded by Wei, Chu, Hong, Zhao, Han, and the Northern Territories. Seven dynasties were engaged in endless strife and aggression against each other for over a thousand years. From the standpoint of the cultivation world, the territories of these seven dynasties were closely related to the strife within their cultivation realms.<br/><br/>One day.<br/><br/>A voice came from outside the cave abode:<br/><br/>“Fang Wang, are you there? I have brought someone to see you.”<br/><br/>Fang Wang opened his eyes and sent out his divine consciousness, pondering for a moment as he recalled the identity of the other party.<br/><br/>F ang Ligeng!<br/><br/>He was one of his cousins at Great Abyss Gate.<br/><br/>Standing beside Fang Zigeng was a young man dressed in the robe of a Great Abyss Gate disciple, whom Fang Wang didn’t recognize at all.<br/><br/>“Come in,” Fang Wang said, then remotely activated the mechanism of the mountain gate using his spiritual power.<br/><br/>The mountain gate opened.<br/><br/>Fang Zigeng and the young man stepped in, while Xiao Zi scurried to hide behind Fang Wang.<br/><br/>The two men approached Fang Wang, and the youth was the first to fist-palm salute, saying, “I am Zhao Qi, I have the honor to meet the Sword Saint!” Fang Wang narrowed his eyes and asked, “Your surname is Zhao?”<br/><br/>Upon closer inspection, Zhao Qi actually bore some resemblance to Emperor Zhao Zhen of Da Qi.<br/><br/>Suddenly, Zhao Qi swept up the hem of his robe and kneeled before Fang Wang. He took out a jade slip from his storage bag and held it up, his teeth clenched as he said, “This contains one of the Ji Hao Sect’s Three Great True Cultivations, the Yin Yang Xuan Ming Zhen Gong. It was given to me by Zhao<br/><br/>Zhen on his deathbed, to be passed on to you as a way to seek forgiveness!”<br/><br/>Fang Wang turned to Fang Zigeng, who nodded and explained, “His father was born to the previous emperor and a palace maiden. As a child, he was cast out among the common people. He’s actually Zhao Zhen’s older brother. Not long after he was born, his parents were murdered, leaving only him alive. He was taken in by ordinary folk until, seven years ago, a mysterious person delivered a package to Zhao Qi, revealing the truth to him. The Yin Yang Xuan Ming Zhen Gong was inside that package.”<br/><br/>Upon hearing this, Fang Wang looked at Zhao Qi anew.<br/><br/>Zhao Qi said through clenched teeth, “It was Zhao Zhen who killed my parents, wanting to be unencumbered. But he left me alive out of fear that Lu Yuanjun would scheme against him, leaving a last trace of the imperial bloodline. Zhao Zhen told me that if he didn’t come for me within five years, it meant he was dead, and I should find you and deliver the Yin Yang Xuan Ming Zhen Gong.”<br/><br/>“He revealed everything to me. He sought the path of immortality, but the<br/><br/>Cultivation Sects didn’t want an emperor who might live forever. Meanwhile,<br/><br/>Lu Yuanjun approached him, wanting to slaughter the populace to nourish a<br/><br/>Ghost Instrument. To pursue cultivation, Zhao Zhen allotted the cities where he thought the Duke’s Mansion was a threat, allowing Lu Yuanjun’s followers to capture souls, creating the illusion of a power struggle.”<br/><br/>“Zhao Zhen deserved to die, and I hate him too, but now he’s dead. Da Qi is in turmoil, and the commoners are suffering. I had no choice but to find you. Zhao Zhen said that the high ranks of Great Abyss Gate are all on Lu Yuanjun’s side. To stand against Lu Yuanjun, I can only turn to you!”<br/><br/>“This Yin Yang Xuan Ming Zhen Gong is real. It was taught to him by Lu Yuanjun, who previously wanted to pass on only half of it to you. It’s impossible to master with just half.. This jade slip contains the complete technique, with both Yin and Yang! Furthermore, Lu Yuanjun mentioned that one might find the opportunity for immortality if they could gather all three<br/><br/>Great True Cultivations of the Ji Hao Sect! “\t\t\t\t\t\t</div>", "images": {}, "success": true}