{"id": 91, "url": "https://www.novelhall.com/i-became-an-immortal-on-mortal-realm-32879/14283667.html", "title": "Chapter 91 - Chapter 91: Chapter 88: The Disciple Of The Demon Monarch [Third Update]_L", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 91 - Chapter 91: Chapter 88: The Disciple Of The Demon Monarch [Third Update]_L</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 91: Chapter 88: The Disciple of the Demon Monarch [Third Update]_l<br/><br/>Translator: 549690339<br/><br/>In Shiyuan Hall, all eyes were on Elder Zhang, and Zhou Xue also furrowed her brows.<br/><br/>Elder Zhang shivered all over, his hand clutching the jade slip, seemingly unable to believe the intelligence he had received.<br/><br/>Yang Yuanzi said urgently, “Spit it out! What’s with the trembling?” Lu Yuanjun stared intently at Elder Zhang, anticipation hard to hide in his eyes.<br/><br/>Under the watchful gazes, Elder Zhang took a deep breath and clenched his teeth, saying,<br/><br/>“The Green Cicada Valley Master, Pang Tuntian, set up an ambush in the Ten Thousand Mountains, with the elite forces of Green Cicada Valley all coming forth. Even the weakest disciple who attacked was in the Soul Sculpting Realm, totaling twenty thousand in number, and they even established the Myriad<br/><br/>Poison Array! ”<br/><br/>Myriad Poison Array!<br/><br/>These three words moved everyone present, and Guang Qiuxian even spat out a mouthful of blood in his shock, collapsing weakly onto his cushion.<br/><br/>“Green Cicada Valley! Damn them!” cursed Chen Anshi through gritted teeth.<br/><br/>Yang Yuanzi stood frozen as if struck by lightning, as did the three direct disciples of the third lineage, with the eldest disciple, Li Yu, trembling all over.<br/><br/>Lu Yuanjun struggled to contain his inner joy, his lips involuntarily curving upward, thankful that no one noticed him in this moment.<br/><br/>Zhou Xue narrowed her eyes, a chill filling them.<br/><br/>“Wait! Sect Leader, don’t be hasty! I haven’t finished yet! Fang Wang isn’t dead!” Elder Zhang, seeing Guang Qiuxian vomiting blood, hurriedly shouted, once again attracting everyone’s attention.<br/><br/>Yang Yuanzi instantly approached him, grasping his robe, and cursed, “Can’t you finish what you’re saying in one go?”<br/><br/>Elder Zhang replied with an aggrieved tone, “The news is too shocking; I hadn’t even recovered my wits just now. Fang Wang is fine; it’s Green Cicada Valley that’s in trouble!”<br/><br/>Without waiting for questions, he quickly continued his report,<br/><br/>“Green Cicada Valley’s nearly twenty thousand elites surrounded Fang Wang alone, onlv to find out that Fang Wanz had a Demon King at his disposal. A<br/><br/>man and a demon bore the brunt of Green Cicada Valley’s offensive. Green Cicada Valley Master Pang Tuntian was beheaded by Fang Wang on the battlefield, and despite the Myriad Poison Array, it was forcefully breached by Fang Wang. It is suspected that he performed the Nine Dragons Divine<br/><br/>Transformation Art, and moreover, the unheard -of Black Dragon Form!”<br/><br/>“Over five thousand from Green Cicada Valley were slaughtered by Fang Wang; the exact casualties are still unclear. In the end, Green Cicada Valley was decimated, scattering and fleeing!”<br/><br/>“This news has already begun to spread in the Da Qi Cultivation Realm; the intelligence in my hands was extorted from a demonic cultivator of Green Cicada Valley by a direct disciple!”<br/><br/>After saying all this in one breath, Shiyuan Hall fell into silence. Everyone wore a stunned expression, including Guang Qiuxian, who opened his mouth wide in disbelief.<br/><br/>Zhou Xue’s expression returned to normal, a smile forming on her lips.<br/><br/>Lu Yuanjun stood dumbfounded as if struck by lightning.<br/><br/>Chen Anshi, who had earlier fervently supported Lu Yuanjun, was also stunned, doubtful whether he had heard correctly.<br/><br/>“Is it true?” Yang Yuanzi asked, grasping Elder Zhang’s shoulders, his face flushing with excitement.<br/><br/>Just as excited, Elder Zhang handed the jade slip to Yang Yuanzi, saying,<br/><br/>“Absolutely true. Read it for yourself if you don’t believe me! ”<br/><br/>Yang Yuanzi immediately probed the jade slip with his divine consciousness.<br/><br/>“Hahaha<br/><br/>Guang Qiuxian suddenly burst into loud laughter, laughing so hard that his injuries flared up, causing him to cough and quickly meditate to circulate his energy.<br/><br/>After reading the jade slip, Yang Yuanzi also started laughing. The other elders crowded around, snatching the jade slip out of his hands to read the intelligence for themselves. “It’s true!”<br/><br/>“He has become this powerful?”<br/><br/>“The Heaven Yuan Spirit Treasure has never appeared before; indeed, we can’t measure him by common standards.”<br/><br/>“No wonder Green Cicada Valley didn’t show up; it turns out they were held back by him.”<br/><br/>“More than being held back, so many elders died, even the Valley Master is dead; Green Cicada Valley is finished!”<br/><br/>The elders discussed excitedly, the direct disciples were also thrilled, eagerly conferring with one another, while those disciples who were close to Lu Yuanjun looked at him worriedly.<br/><br/>Lu Yuanjun had to show a delighted smile, but unfortunately, everyone could see his smile was forced this time.<br/><br/>No helping it, the impact of this event was too great!<br/><br/>If Fang Wang had fought his way out of the encirclement, it would have been shocking enough.<br/><br/>But Fang Wang had actually slaughtered his way through Green Cicada Valley!<br/><br/>It was inconceivably insane!<br/><br/>Could it be that Fang Wang had already become powerful enough to contend with an entire sect by himself?<br/><br/>Zhao Chuanqian looked at Guang Qiuxian and said sternly, “Sect Leader, the position of the senior disciple needs to be reconsidered!”<br/><br/>Upon hearing this, many elders chimed in agreement. This time, Yang Yuanzi did not speak; he stood aside, still caught in his own excitement, unable to snap out of it for a long while.<br/><br/>Chen Anshi hesitated, but ultimately gave up.<br/><br/>Breaking through Green Cicada Valley, that was indeed a monumental contribution!<br/><br/>Guang Qiuxian took a deep breath and said, “The position of the senior disciple will wait until Fang Wang returns. During my recovery, all sect affairs will be overseen by Elder Zhao Chuanqian.”<br/><br/>No one objected, and the majority of elders showed joy on their faces. With a Great Cultivator like Fang Wang in Great Abyss Gate, the sect would surely soar to new heights!<br/><br/>Lu Yuanjun’s expression was calm; no one could see what he was truly thinking.<br/><br/>Rustle—<br/><br/>In the heart of the mountains, Fang Wang sat in meditation by the side of a small lake, practicing Qi Gathering. At one side of the lake was a waterfall, which was fifty feet high, causing water to splash in all directions.<br/><br/>On the other side of Fang Wang, not far away, lay a pile of storage bags on the grass. Xiao Zi was checking them one by one; each time she opened a bag, poisonous insects emerged, only to be swallowed by her in one gulp, making one feel repulsed.<br/><br/>Six days had passed since the battle with Green Cicada Valley, and Fang Wang planned to return to Great Abyss Gate after his Spiritual Power had fully recovered, to guard against the possibility of Demonic Sects ambushing him on the road ahead.<br/><br/>“Come out, how much longer do you intend to hide in the shadows?”<br/><br/>Fang Wang suddenly spoke, slowly opening his eyes and looking toward the woods across the small lake.<br/><br/>Hearing this, Xiao Zi lifted her snakehead nervously and looked to the other side of the lake.<br/><br/>There was no movement in the woods across the lake, and after a whole five breaths had passed just when Xiao Zi was about to speak, a voice sounded:<br/><br/>“Ah, I have been discovered by the young master. Please don’t be angry, young master. I have nothing to do with Green Cicada Valley. The reason I followed you is because I care for you.”<br/><br/>This voice was melodious and seductive, stirring one’s heart and causing one’s thoughts to wander.<br/><br/>A graceful woman in green emerged from the woods, barefoot, her thighs peeking out from beneath her skirt, pale and glowing. The neckline of her robe was low, revealing a deep cleavage, her face beautiful and her long hair arranged in an elegant bun with three jewelled hairpins.<br/><br/>At first glance, Fang Wang thought she had run away from a pleasure house, but she gave him an ominous feeling.<br/><br/>No weaker than Sword Sect’s Kong Xi!<br/><br/>Fang Wang squinted his eyes and asked, “Who are you?”<br/><br/>So white…<br/><br/>The woman in green covered her mouth with a laugh and said, “My name is Tu Caiyi. Has the young master heard of me?<br/><br/>Fang Wang studied her, his right hand conjuring a Qiankun Fan as he stood up and said, “I haven’t heard of you. If you are here as an enemy, then come at me.”<br/><br/>“Oh, young master is really in a hurry. I already told you, I came here because I care for you. Oh right, I forgot to mention the name of my sect. I’m from the Jin Xiao Sect, the Dongshi Heavenly King. Surely you must have heard of it by now?” said the woman in green with a coquettish pose, throwing a flirtatious glance at Fang Wang.<br/><br/>Fang Wang almost bristled with discomfort, this woman was so damn pretentious, he couldn’t help but want to fan her away.<br/><br/>Suppressing the urge to strike, he asked, “Jin Xiao Sect? Why have you come? Does it have something to do with Zhou Xue?”<br/><br/>“The young master is indeed intelligent. Ever since the Sword Sect challenged you, Zhou Xue has been worried, asking me to protect you in secret until you return to Great Abyss Gate. Your battle with the Sword Sect really tingled my fancy, a man like you is exactly my type…” Tu Caiyi licked her lips as she spoke.<br/><br/>It was indeed Zhou Xue!<br/><br/>Fang Wang’s heart warmed, this woman, like him, said one thing and meant another.<br/><br/>Tu Caiyi sighed, “Watching the young master surrounded by Green Cicada Valley, I was so anxious, but who would have thought that the young master was so formidable, breaking through Green Cicada Valley with a serpent spirit. I admire you.”<br/><br/>“Young master, I see you are recovering your Spiritual Power. Why don’t I give you a hand? I have a dual cultivation method that can greatly boost your cultivation.”<br/><br/>Having said that, her eyes gleamed as she stared at Fang Wang. Fang Wang did not fully trust her and flatly refused, “No need, I don’t like women!”<br/><br/>Upon hearing this, Tu Caiyi was momentarily stunned.<br/><br/>Xiao Zi turned her head to look at Fang Wang, her serpent eyes shining brightly.<br/><br/>“What status does Zhou Xue have in the Jin Xiao Sect, to be able to enlist you, a Heavenly King, to protect me?” Fang Wang couldn’t help but ask.<br/><br/>With a toss of her hair, Tu Caiyi said, “She, well, is the cherished disciple of the Demon Monarch. I must say, she indeed has insight, she has helped me a lot; I owe her my life.”<br/><br/>Her tone had changed, becoming much colder, a stark contrast to her previous frivolous behavior.<br/><br/>The disciple of the Demon Monarch?<br/><br/>For some reason, Fang Wang felt inexplicably irked.<br/><br/>“May I ask if the Demon Monarch is male or female?” Fang Wang asked, keeping his gaze on Tu Caiyi.<br/><br/>At this, Tu Caiyi couldn’t help but giggle behind her hand.<br/><br/>“What difference does it make if the Demon Monarch is male, and what if he wishes to marry her? What then will you do?” Tu Caiyi asked with a cold laugh.<br/><br/>Fang Wang calmly replied, “It would not concern me. I merely wish to hear the truth, why irk me?”<br/><br/>Tu Caiyi couldn’t help but shake her head and sigh, “You’re just like Zhou Xue, despite your youth, you’re very mature. I can’t fool you, alright, I’ll tell you the truth. The Demon Monarch is a woman, are you relieved now?”<br/><br/>Fang Wang’s heart eased, but he answered with composure, “Even if it were a man, it would be fine.”<br/><br/>Tu Caiyi rolled her eyes at him and snorted, “Hmph, men.”<br/><br/>Before Fang Wang could respond, she said seriously, “Enough teasing, let’s go. There’s a blessed land nearby that can help you recover your Spiritual Power sooner. The sooner you recover, the sooner I can send you back to Great Abyss Gate, and I can take leave sooner. Keeping company with a youngster like you is truly boring.”<br/><br/>Fang Wang was speechless.<br/><br/>Why did this woman’s attitude suddenly flip completely?<br/><br/>“Really?” Fang Wang asked cautiously.<br/><br/>“Believe it or not!”<br/><br/>After saying that, Tu Caiyi turned and left, her graceful figure swaying as she went.<br/><br/>Fang Wang immediately raised his hand, drawing all the nearby storage bags around him, then leaped over the small lake.<br/><br/>Xiao Zi hurriedly followed, squatting on Fang Wang’s shoulder and saying softly, “Young master, be careful. This woman is dangerous. I always feel she harbors ill intentions.”<br/><br/>Fang Wang replied softly, “Let’s go have a look. If she has ill intentions, she’ll act against us sooner or later.”<br/><br/>He didn’t use the Sound Transmission Technique, intentionally speaking loudly enough for Tu Caiyi to hear.<br/><br/>Tu Caiyi ahead didn’t turn back, as if she hadn’t heard..\t\t\t\t\t\t</div>", "images": {}, "success": true}