{"id": 95, "url": "https://www.novelhall.com/i-became-an-immortal-on-mortal-realm-32879/14285285.html", "title": "Chapter 95 - Chapter 95: Chapter 92: Peering Into Life And Death, Advancing To Senior Disciple_L", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 95 - Chapter 95: Chapter 92: Peering Into Life And Death, Advancing To Senior Disciple_L</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 95: Chapter 92: Peering into Life and Death, Advancing to Senior Disciple_l<br/><br/>Translator: 549690339<br/><br/>Aside from the Xuanming Seal, the Yin Yang Xuan Ming Zhen Gong also encompasses other spells, including soul possession techniques, offering a vast array. It is no exaggeration to say that Yin Yang Xuan Ming Zhen Gong is akin to an encyclopedia of the Dao of Yin and Yang.<br/><br/>Fang Wang could now glimpse into the Yang energy of living beings, which revealed their lifespan.<br/><br/>Take Xiao Zi, for example.<br/><br/>Xiao Zits Yang energy indicated a lifespan of another eight hundred years.<br/><br/>The Yang energy of demons differs from that of humans, being hard to discern as it’s shrouded by dense and chilly Yin energy. However, for Fang Wang, who had achieved Great Perfection in Yin Yang Xuan Ming Zhen Gong, identifying the Yang energy of demons remained a simple task.<br/><br/>The Yang energy of humans is much more intense, which is why demons crave devouring it to balance their own Yin and Yang, thus better pursuing the Heavenly Dao. If a demon’s cultivation is inadequate and it faces a person whose Yang energy is too fierce, the demon would suffer a backlash from the person’s Yang energy.<br/><br/>Fang Wang got up, ready to go out for a walk, and Xiao Zi promptly followed<br/><br/>behind him.<br/><br/>Upon leaving the cave dwelling, Fang Wang first went to visit Zhou Xue; unfortunately, she wasn’t there. He then visited Fang Hanyu, but this fellow was also absent; hence, he had to look for other clan members.<br/><br/>Apart from Fang Zigeng, there were two other clan members present. Fang Wang observed their Yang energy and found that their lifespans were both around two hundred years.<br/><br/>The lifespan signified by Yang energy is not fixed; it merely reflects the current state of the body. Improvements in cultivation level and certain Heavenly Materials and Earthly Treasures can increase Yang energy.<br/><br/>Thus, after roaming outside for several days, Fang Wang returned to the cave dwelling with Xiao Zi.<br/><br/>Reaching the gate of the mountain, Fang Wang felt that something was amiss. His gaze involuntarily shifted to the neighboring cave dwelling’s entrance.<br/><br/>Gu Li hadn’t sought him out for a long time.<br/><br/>It was just as well, a genius like her should concentrate on cultivation.<br/><br/>Fang Wang shook his head with a smile and then went into his own cave dwelling to cultivate.<br/><br/>The fifth level of the Profound Heart Realm was not enough. He needed to reach the Condensation Spirit Realm and then the Heavenly Gang Sheng Ti Zhen Gong, Only then would he become the true number one person in the Da Qi Cultivation Realm!<br/><br/>Meanwhile.<br/><br/>Gu Li sat cross-legged in her cave dwelling, eyes open, lightly biting her lip. She took a deep breath and continued her cultivation.<br/><br/>Ever since she parted with Sword Heaven Marsh, she had restrained herself from going out every time she heard noise from the next cave dwelling.<br/><br/>She felt she was close to success.<br/><br/>Only by temporarily curbing her longing for Fang Wang could she stand a chance to catch up with him!<br/><br/>In the dim cave chamber, Lu Yuanjun was meditating on the ground, covered with dead grass. As he circulated his power, three dark ghostly figures formed behind him, their features indistinct.<br/><br/>Hovering in front of him was a black gourd, emitting ghost Qi that coalesced into the figure of Zhao Zhen.<br/><br/>Zhao Zhen quietly observed Lu Yuanjun, his expression calm.<br/><br/>After a while.<br/><br/>Lu Yuanjun suddenly spewed a mouthful of blood, his face instantly turning pale, his hands trembling.<br/><br/>Zhao Zhen commented, “The Demon Monarch is truly formidable. Who knows where he sprang from. It seems the Jin Xiao Sect will dominate the future of the Cultivation World.”<br/><br/>Lu Yuanjun wiped the blood from the corner of his mouth and said coldly, “I will one day annihilate the Jin Xiao Sect and refine the Demon Monarch into a ghost soldier.”<br/><br/>Zhao Zhen merely smiled, a sinister smile, and did not respond.<br/><br/>Lu Yuanjun looked up at Zhao Zhen and asked, “How is your cultivation of the Yin Yang Xuan Ming Zhen Gong progressing?<br/><br/>Zhao Zhen gave a wry smile and replied, “The technique is profound and inscrutable; I cannot learn it.”<br/><br/>Lu Yuanjun’s expression shifted, deep in thought.<br/><br/>“Haven’t you already mastered it and started absorbing the souls of the Sect Leader and Yang Yuanzi?” Zhao Zhen inquired.<br/><br/>Lu Yuanjun took a deep breath and said, “I have only mastered it in part, yet to gain full control. The Yin Yang Xuan Ming Zhen Gong is extensive and profound; there are many aspects I have yet to fully understand. As for the Xuanming Seal, it has barely entered their bodies. I don’t know how many vears it will take to completelv transform their souls into mv zhost soldiers.”<br/><br/>Zhao Zhen taunted, “Then you should flee quickly, lest the Jin Xiao Sect find you. Besides, the Sect Leader, Vice Sect Leader, and Yang Yuanzi have all seen your Ghost Instrument. It might reach the ears of Fang Wang. Give it ten years, and Fang Wang will surely dominate unmatched across Da Qi. With his nature, he will undoubtedly hunt you down.”<br/><br/>Lu Yuanjun said coldly, “Flee? Where to? Moreover, I might not lose. If I manage to refine Fang Wang into a ghost soldier, his Heaven Yuan Spirit Treasure and his swordsmanship will be at my command!”<br/><br/>“Tsk, such lofty ambition. But if you truly succeed, it would indeed be defying fate, worth a gamble,” Zhao Zhen commented with emotion.<br/><br/>Lu Yuanjun said confidently, “I have practiced the Ghost Path from a young age; no matter how difficult the Yin Yang Xuan Ming Zhen Gong is, as long as I have time, I will surely master it. Let Fang Wang live for now. As for the Jin Xiao Sect, even the Demon Monarch couldn’t keep me, so they are not a concern.”<br/><br/>Zhao Zhen just smiled without further words.<br/><br/>Lu Yuanjun continued to practice, cultivating the Yin Yang Xuan Ming Zhen Gong.<br/><br/>The cave fell silent, with Zhao Zhen floating above the black gourd, his gaze distant and unfathomable.<br/><br/>Time passed by.<br/><br/>Since Zhao Qi left, Fang Wang spent another two years in seclusion, reaching the sixth level of the Profound Heart Realm and nearing the seventh level.<br/><br/>One day, his Disciple Token began to fluctuate with Spiritual Power. He opened his eyes and drew the token on the table into his hands. Immediately after, the weary voice of Guang Qiuxian came from inside the token:<br/><br/>“Fang Wang, come to the Shiyuan Hall immediately.”<br/><br/>Upon hearing this, Fang Wang sprang to his feet. This time, he didn’t bring Xiao Zi and instructed her to continue cultivating well inside the cave dwelling.<br/><br/>Before long, he rapidly arrived in front of the Shiyuan Hall’s Main Meridian.<br/><br/>As he landed on his feet, the great doors opened, and he stepped into the hall.<br/><br/>He noticed the hall was filled with numerous elders, including all nine Peak Masters, among whom was Yang Yuanzi.<br/><br/>Fang Wang, who had mastered the Yin Yang Xuan Ming Zhen Gong, habitually checked their vitality, seeing how many years they had left.<br/><br/>One hundred and twenty years!<br/><br/>Ten years!<br/><br/>Three years!<br/><br/>Eighty-seven years!<br/><br/>One hundred and one years!<br/><br/>With just a glance, the fates and life spans of all present were laid bare before Fang Wang’s eyes. Suddenly, his pupils constricted, his gaze landing on a woman.<br/><br/>Tu Caiyi!<br/><br/>She was actually wearing the robe of a Great Abyss Gate elder, carrying herself with dignity, no longer the enchantress of before, her face cold, her gaze towards Fang Wang indifferent.<br/><br/>Guang Qiuxian, seated cross-legged on his cushion, saw Fang Wang’s gaze and couldn’t help but introduce with a smile, “This is our newly appointed Vice Sect Leader Chai Yi, a great cultivator of the Condensation Spirit Realm.”<br/><br/>Upon hearing this, Fang Wang promptly clasped his hands towards Tu Caiyi in a formal salute.<br/><br/>caiyi, Chai Yi…<br/><br/>The former Vice Sect Leader was a spy from the Demonic Path, and now replaced by a spy from the Jin Xiao Sect?<br/><br/>Fang Wang didn’t call her out but instead asked curiously, “Where is Elder<br/><br/>Chen?”<br/><br/>At that, the faces of everyone in the hall took on a subtle expression. Guang Qiuxian heaved a sigh and said, “Chen Anshi has joined the Chi Devil Sect, betrayed the Great Abyss Gate; if we meet him again, he will be our enemy. Sister Chai is a disciple taken in by the former Sect Leader in the northern lands, trustworthy.”<br/><br/>Tu Caiyi maintained her expressionless face, the epitome of unapproachability.<br/><br/>She’s playing the part very well!<br/><br/>Fang Wang then asked, “May I know what business the Sect Leader has with me here?”<br/><br/>At this question, everyone except Chai Yi revealed smiling faces.<br/><br/>Despite the recent crises faced by the Great Abyss Gate, everyone held hope upon seeing Fang Wang.<br/><br/>Zhao Chuanqian chuckled, “Fang Wang, from today onwards, you are the head disciple of the Great Abyss Gate, in charge of the main meridian affairs as well as those of all the other peak’s head disciples.”<br/><br/>Hearing this, Fang Wang raised his eyebrows and looked towards Guang Qiuxian.<br/><br/>Guang Qiuxian stroked his beard, nodding with a smile, as the other elders and Peak Masters began to praise Fang Wang.<br/><br/>“In terms of cultivation and merits, you are more than qualified for the position of head disciple.”<br/><br/>“Fang Wang, the future of the Great Abyss Gate now rests upon you.”<br/><br/>“Hahaha, Fang Wang, once you break through to the Condensation Spirit<br/><br/>Realm, the position of Sect Leader should be passed on to you, right, brother?”<br/><br/>“With Fang Wang as the head disciple, he will certainly attract more talents to join the Great Abyss Gate; I support this.”<br/><br/>Fang Wang feigned being flattered, looking awkwardly at the elders, while Tu<br/><br/>Caiyi remained expressionless, a subtle smile almost imperceptible in her eyes.<br/><br/>“This is your new head disciple token; you can use it to relay messages to everyone in the Great Abyss Gate. Your contribution points have been transferred into this token, including your feats of repelling Green Cicada Valley and slaying Pang Tuntian.”<br/><br/>Guang Qiuxian raised his hand, and a piece of green jade with golden edges flew towards Fang Wang.<br/><br/>Fang Wang caught it, holding the head disciple token, his mood quite sentimental.<br/><br/>Finally obtained it!<br/><br/>Twenty-one years after joining, ascending to the position of head disciple; such speed in the history of the Great Abyss Gate was surely unprecedented.<br/><br/>“My disciple, as the head disciple of the Great Abyss Gate, you must lead by example and avoid going astray,” Yang Yuanzi said earnestly, his eyes filled with gratification and pride as he looked at Fang Wang.<br/><br/>Fang Wang suddenly raised an eyebrow, noticing something on Yang Yuanzi, but he didn’t mention it at the moment. He nodded to Yang Yuanzi, then scanned the other elders and Peak Masters, and turned to Guang Qiuxian.<br/><br/>“Sect Leader, esteemed uncles and elders, I have a favor to ask, as my first act upon becoming head disciple,” Fang Wang said thoughtfully, his tone solemn.<br/><br/>Greedy Sleeper couldn’t help but laugh, “You wouldn’t be planning to recommend one of your clan members, would you?”<br/><br/>The Peak Masters and elders all smiled, showing no signs of mockery, as it was only natural to care for one’s kin.<br/><br/>Guang Qiuxian admired Fang Wang for not being hesitant; a head disciple should have their own judgment, be able to change the Great Abyss Gate, take action, and not merely sit and enjoy the benefits of the position.<br/><br/>Fang Wang shook his head and said, “Zhao Zhen has been missing for many years and is likely dead. Da Qi cannot go a day without an emperor. I know of a royal descendant whom I would like to nominate as the Emperor of Da Qi. My Fang Family, after all, is from the Duke’s Mansion and bears responsibility for this land. Although the kingdom seems stable, the common people are suffering, and they need an emperor to govern. This person happens to have joined the Great Abyss Gate, and he has a way to prove his royal bloodline.”<br/><br/>Upon saying this, everyone looked at him in amazement, not expecting him to make such a request.<br/><br/>Yang Yuanzi slightly furrowed his brows, recalling Fang Wang’s question from the other day, but he withheld comment.<br/><br/>“Da Qi truly cannot go a day without an emperor, and the Great Abyss Gate, as an upright sect, has the responsibility to protect the people. I agree. Sister Chai, will you arrange this matter? How about it?” Guang Qiuxian pondered, not even bothering to ascertain whether the person really was from the Da Qi royal family—in his view, that didn’t matter.<br/><br/>He wanted to send a clear message: he was giving Fang Wang unconditional support!<br/><br/>Tu Caiyi nodded slightly and said, “Alright, I’ll personally take him to the Imperial City to crown him as the emperor and arrange a group of disciples to support him..”\t\t\t\t\t\t</div>", "images": {}, "success": true}