{"id": 92, "url": "https://www.novelhall.com/i-became-an-immortal-on-mortal-realm-32879/14283668.html", "title": "Chapter 92 - Chapter 92: Chapter 89: The Name Of Fang Wang, The Matter Of Engagement_L", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 92 - Chapter 92: Chapter 89: The Name Of Fang Wang, The Matter Of Engagement_L</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 92: Chapter 89: The Name of Fang Wang, The Matter of Engagement_l<br/><br/>Translator: 549690339<br/><br/>Tu Caiyi did not deceive Fang Wang; there indeed was a blessed land hidden within this forest, located in a valley. Both the entrance of the valley and the surrounding mountains were clearly under the influence of a formation, preventing the spiritual energy from leaking out and making it undetectable to outsiders.<br/><br/>The spiritual energy of this blessed land was more than ten times that of the outside. After entering the valley, Fang Wang began to sit in meditation to gather Qi, while Xiao Zi continued to inspect the storage bags, her snake-like eyes occasionally glancing towards the distant Tu Caiyi.<br/><br/>Inside the valley lay a flat piece of land, lush with flowers and plants. Although not densely forested, the trees stood tall and imposing. Tu Caiyi lay on the trunk of a large tree, feigning sleep. Lying on her side, she fully exposed her thigh, which just so happened to face Fang Wang.<br/><br/>Fang Wang did not devote himself entirely to cultivation; his consciousness always kept a watchful eye on her. It wasn’t that he harbored inappropriate thoughts; it was simply that he remained vigilant toward Tu Caiyi.<br/><br/>In the blink of an eye, five days passed.<br/><br/>Fang Wang’s spiritual power had fully replenished. During this time, Tu Caiyi had not moved at all, leading Fang Wang to wonder if she might have left her body in astral projection.<br/><br/>Xiao Zi, having arranged the storage bags day and night, finally finished her inspection. She gathered everything useful to Fang Wang into twelve storage bags. Fang Wang clipped all these storage bags to his belt and then looked towards Tu Caiyi.<br/><br/>“It’s time to hit the road,” he said.<br/><br/>Upon hearing this, Tu Caiyi opened her eyes, then sat up and stretched, as Fang Wang averted his gaze.<br/><br/>This woman was setting a trap for him!<br/><br/>He would not be fooled!<br/><br/>“Young master is quite quick, it seems your cultivation technique is no simple matter,” Tu Caiyi said in an interested tone as she landed and walked towards Fang Wang.<br/><br/>Fang Wang did not respond but instead leaped up and flew away on his sword.<br/><br/>He quickly flew out of the valley and looking back, he saw Tu Caiyi pursuing him barefoot on two golden disks.<br/><br/>“Wind Fire Wheels? Interesting,” thought Fang Wang as he raised an eyebrow, then turned his gaze back towards the horizon.<br/><br/>Xiao Zi, however, kept her eyes on Tu Caiyi, monitoring her every move.<br/><br/>Within a bustling city, endless streams of cultivators walked the streets, while shops on both sides sold magic artifacts, heavenly materials and earthly treasures, demon pets, and various other items.<br/><br/>In a tavern.<br/><br/>The cultivators drank while directing their attention to a middle-aged scholar standing in the center of the hall.<br/><br/>“Once the Myriad Poison Array was activated, heaven and earth wept and howled, the wind and clouds changed color, it was terrifying. Being inside was like falling into the eighteen levels of Hell. Sword Saint Fang Wang stood proudly on the head of a snake demon, utterly fearless. The tens of thousands of demonic cultivators from Green Cicada Valley didn’t expect that so many people together could not stop Fang Wang with their Myriad Poison Array!” the middle-aged scholar said with an excited tone, adept at stirring the emotions of the listeners.<br/><br/>The surrounding cultivators were completely engrossed, their eyes filled with longing and admiration.<br/><br/>Who wouldn’t aspire to the legendary achievement of a single person defeating an entire sect?<br/><br/>“Slaying the Great Demon King, defeating the Sword Sect, then laying waste to Green Cicada Valley, can Fang Wang be considered the number one in the world today?” someone said with emotion.<br/><br/>As soon as these words came out, many cultivators agreed. Their understanding was limited, and Fang Wang was the most domineering and strongest person they had ever heard of.<br/><br/>“Green Cicada Valley has been attacked several times over the years, their strength is no longer on par with the Nine Great Sects. Moreover, they are a poison sect. Defeating Green Cicada Valley doesn’t make one the number one in the world. Poison is only effective in lower realms, and high-level cultivators can resist poison with their inner strength. Yang Yuanzi of Great Abyss Gate managed to fight his way in and out in the past, and a great cultivator from the Jin Xiao Sect did the same years ago. It’s just that the deed of Fang Wang’s Heaven Yuan Spirit Treasure has been exaggerated,” a discordant voice said from a corner, its tone laced with sarcasm, it was unclear whether the speaker was mocking Green Cicada Valley or looking down on Fang Wang.<br/><br/>“Oh, you talk a big game, why don’t you try breaking into Green Cicada Valley yourself!” a man exclaimed as he slammed the table and stood up angrily. It was none other than Gu Tianxiong.<br/><br/>Gu Tianxiong was enjoying his drink, listening to the scholar sing the praises of his brother, his mood elated, when someone dared to undermine Fang Wang.<br/><br/>This could not be tolerated!<br/><br/>Gu Tianxiong’s gaze was tightly fixed on the black-robed cultivator who had spoken sarcastically. The man was dressed in black, his face hidden beneath a wide-brimmed bamboo hat.<br/><br/>In response to Gu Tianxiong’s provocation, the black-robed cultivator drank a cup of wine and snorted, “Green Cicada Valley? I just happen to have a score to settle with them, I’ll go cause some trouble for them right now!” With that, the black-robed cultivator stood up and left.<br/><br/>“Wait, shouldn’t you leave a name?” Gu Tianxiong called out hastily, thinking the man was making excuses to sneak away.<br/><br/>The black-robed cultivator didn’t look back, leaving only the words: “Jin Xiao<br/><br/>Sect, Xiao Kuang!”<br/><br/>The three words ‘Jin Xiao Sect’ made everyone in the tavern’s complexion change drastically, silence falling over them, even Gu Tianxiong didn’t dare to speak any further.<br/><br/>Although the Jin Xiao Sect was not one of the Nine Great Sects and had only emerged over the past decade or so, their military achievements were too frightening, making them a concern for the Da Qi Cultivation Realm as seen by the Nine Great Sects.<br/><br/>Once Xiao Kuang had left, the cultivators in the tavern finally breathed a sigh of relief.<br/><br/>“Gentlemen, please continue eating and drinking, Mr. Scholar, please proceed with the legendary tales of Sword Saint!” the tavern keeper quickly called out.<br/><br/>Having run this tavern for over a hundred years, he had seen all kinds of storms.<br/><br/>Upon hearing this, the middle-aged scholar immediately continued his narration.<br/><br/>Gu Tianxiong felt a bit embarrassed and sat down stiffly, saying, “Right, keep going. Fang Wang is my brother, and I want to see if what you say matches what I’ve heard.”<br/><br/>However, the cultivators only rolled their eyes at him, not believing his words, yet none dared to mock him.<br/><br/>Feeling bored, Gu Tianxiong could only grimly sit down.<br/><br/>He started drinking heavily.<br/><br/>After quite a while,<br/><br/>a plainly dressed youth, who seemed to be around sixteen or seventeen, approached his table, hesitating to speak.<br/><br/>Gu Tianxiong glanced at him and said bluntly, “What is it?”<br/><br/>The youth gathered his courage, sat down to the right of Gu Tianxiong, and asked in a low voice, “Senior, is Fang Wang truly your brother?”<br/><br/>Gu Tianxiong glared at him and said, “Of course, I never tell lies! ”<br/><br/>The youth took a deep breath and said, “Senior, may we speak privately? I have a favor to ask of you, and I assure you it will be worth your while.” Upon hearing this, Gu Tianxiong looked at him with a face full of suspicion.<br/><br/>“Does this concern Fang Wang?”<br/><br/>“That’s right.”<br/><br/>“Alright, let’s go!”<br/><br/>Under the blue sky, the mountains rose and fell like a series of Azure Dragons coiling upon the earth, majestic and imposing.<br/><br/>Gliding on his sword, Fang Wang slowly decelerated, turned his head, and said,<br/><br/>“We’re coming up on Great Abyss Gate, thank you for accompanying me.”<br/><br/>Tu Caiyi maintained a distance of thirty feet from him. Hearing his words, she smiled slightly and said, “You’re welcome, I’ll leave you here.” After speaking, she stopped and hovered in the air, watching Fang Wang depart.<br/><br/>Fang Wang nodded and continued to accelerate toward Great Abyss Gate. Xiao Zi muttered, “Master, are you sure she has no ill intentions?”<br/><br/>“Who knows, but at least for now, she indeed seems to mean well,” Fang Wang replied softly.<br/><br/>Above the sea of clouds on the horizon, the ten peaks of Great Abyss Gate already loomed, like a pair of giant hands reaching through the heavens, or a mirage, both illusory and real.<br/><br/>I’m finally back!<br/><br/>Fang Wang felt emotional in his heart, for he had not returned for over four hundred years, and he naturally felt some nostalgia for Great Abyss Gate.<br/><br/>Xiao Zi perched on his shoulder, keeping its gaze on Tu Caiyi behind them until she disappeared from view, but it still did not look away. It wouldn’t be at ease until it entered Great Abyss Gate.<br/><br/>Half an incense stick’s time later.<br/><br/>Fang Wang entered Great Abyss Gate. The two disciples who had checked his disciple token earlier were very excited to see him but didn’t dare to disturb him, so they didn’t impede his progress.<br/><br/>Upon entering Great Abyss Gate, he took out his bamboo hat, put it on, and slightly lowered his head, trying not to let others see his face.<br/><br/>Even so, as he headed toward the first branch, he could still hear the disciples along the way discussing him and Green Cicada Valley.<br/><br/>“Tsk tsk, news travels incredibly fast in the Cultivation World.”<br/><br/>Xiao Zi, nestled in Fang Wang’s embrace, lamented as they approached the mountain gate of Great Abyss Gate, then hid in Fang Wang’s arms.<br/><br/>Fang Wang’s expression remained calm, but inwardly he was rather pleased.<br/><br/>Such spectacular combat achievements, he naturally did not want to conceal.<br/><br/>As for whether he would make enemies, he was not worried. Even without this incident, his possession of the Heaven Yuan Spirit Treasure had already placed him at the center of controversy.<br/><br/>Fang Wang quickly arrived at Zhou Xue’s dwelling. Just as he landed, the mountain gate to the cave dwelling 0Dened.<br/><br/>He raised an eyebrow and stepped inside.<br/><br/>“Master, why are you looking for her as soon as you return? Don’t you dislike women?” Xiao Zi said with a hint of jealousy.<br/><br/>Fang Wang pressed its snake head down and entered without paying it any mind.<br/><br/>The mountain gate closed, and the cave dwelling was plunged into darkness.<br/><br/>He walked up to Zhou Xue and saw her meditating in a small pond, surrounded by a strange black Qi. Huh?<br/><br/>It seems to be Ghost Qi!<br/><br/>Fang Wang frowned and asked, “Are you injured?”<br/><br/>Zhou Xue, without opening her eyes, said, “Just a minor injury, it’s nothing serious.”<br/><br/>“How did it happen?”<br/><br/>“I was wounded by a Ghost Instrument wielded by Lu Yuanjun.”<br/><br/>“What?”<br/><br/>Upon hearing this, Fang Wang’s frown deepened, and a murderous intent flared in his eyes.<br/><br/>Zhou Xue opened her eyes and, seeing his expression, couldn’t help but smile and said, “Lu Yuanjun and Chen Anshi left Great Abyss Gate. I followed the Demon Monarch in pursuit of them. I didn’t expect Lu Yuanjun’s Ghost Instrument to have three more ghost gods, and even Yang Yuanzi came out to save him. The Demon Monarch is very interested in Lu Yuanjun’s Ghost Instrument, so he deliberately let Lu Yuanjun and Chen Anshi escape to investigate the origin of his Ghost Instrument. I couldn’t persuade the Demon Monarch otherwise, but fortunately, he gravely injured them.”<br/><br/>Fang Wang raised an eyebrow, not expecting Lu Yuanjun to be so hard to kill, that even his teacher had to intervene.<br/><br/>Tsk tsk, and that Demon Monarch, so formidable…<br/><br/>Chen Anshi, the Vice Sect Leader of Great Abyss Gate, along with his teacher, were almost killed by the Demon Monarch?<br/><br/>Zhou Xue continued, “With Lu Yuanjun gone, I guess he won’t be coming back. Once the Demon Monarch gets his hands on that Ghost Instrument, his death is certain. You can safely take the position of the top disciple and let go of your grudge. I will reveal the truth and make Great Abyss Gate completely give up on<br/><br/>Lu Yuanjun.”<br/><br/>Fang Wang was confused after listening, such as whether the Demon Monarch was waiting around Great Abyss Gate or not.<br/><br/>But he still held back and instead asked, “Is everyone else in the clan alright?”<br/><br/>Zhou Xue answered, “Three suffered serious injuries. A few years of recuperation should suffice. It’s already fortunate that no one died.”<br/><br/>Fang Wang breathed a sigh of relief. Looking at Zhou Xue, he sincerely said,<br/><br/>“Thank you! ”<br/><br/>He surmised it was Zhou Xue’s timely return that had saved the lives of the other six Fang Family Disciples.<br/><br/>“Go see your teacher. First, you’ve just returned, and out of master-disciple etiquette, you should visit him. Second, his injuries are severe, and he’ll likely need to recover for twenty years,” Zhou Xue said with closed eyes.<br/><br/>The Demon Monarch is so ruthless?<br/><br/>Fang Wang frowned, immediately turned around, and left. After taking three steps, he seemed to think of something, turned back, and asked, “By the way, my grandfather and the others want to push forward with our marriage arrangement.. My Fourth Uncle said that it all depends on my will, is that<br/><br/>true?”\t\t\t\t\t\t</div>", "images": {}, "success": true}