{"id": 99, "url": "https://www.novelhall.com/i-became-an-immortal-on-mortal-realm-32879/14290541.html", "title": "Chapter 99 - Chapter 99: Chapter 96 How Can One Person ‘S Strength Reach This Level? 1", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 99 - Chapter 99: Chapter 96 How Can One Person ‘S Strength Reach This Level? 1</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 99: Chapter 96 How Can One Person ‘s Strength Reach This Level? 1<br/><br/>Translator: 549690339<br/><br/>After seven days, Fang Wang stabilized his cultivation and began packing his belongings for departure. Upon seeing this, Xiao Zi immediately became excited.<br/><br/>“Young Master, where do you plan to go?” Xiao Zi asked.<br/><br/>Fang Wang casually replied, “To Sword Heaven Marsh.”<br/><br/>He could create multiple Lifespirit Treasures, an ability he intended to keep secret; currently, everyone in the world saw him as a Sword Cultivator, which was beneficial.<br/><br/>Only enemies on the brink of death would have the chance to witness all his treasures!<br/><br/>As soon as Xiao Zi heard this news, as long as it meant leaving the Great Abyss Gate, it was happy. It instantly found its way onto Fang Wang’s shoulder.<br/><br/>Once everything was packed, Fang Wang hooked three storage bags to his waist, along with the Qingjun Sword, and then walked out of his cave dwelling.<br/><br/>The Qingjun Sword could be put into a storage bag, but he felt it looked more dashing hanging at his waist.<br/><br/>He first went to visit Guang Qiuxian to inform him that he would be leaving for a while.<br/><br/>“I won’t ask where you’re going, but there’s something that requires your action,” Guang Qiuxian said with a chuckle, looking at Fang Wang with hopeful eyes.<br/><br/>Fang Wang smiled and said. “Please sneak. Sect Leader. After secluding myself<br/><br/>for so many years, it’s time I display some of my divine abilities.”<br/><br/>Guang Qiuxian nodded and spoke, “A year ago, we learned that the Chi Devil<br/><br/>Sect has acquired a supreme treasure, a kind unseen in the Da Qi Cultivation Realm for a thousand years. However, the sect seems to have encountered trouble; they cannot get the treasure to acknowledge its master. Thus, they have summoned their cult members to prepare for a grand ritual sacrifice, offering a million living souls to awaken the treasure’s spirit.”<br/><br/>“I have discussed with the Suspended Vast Sword Sect and the Tian Shu Sect and we’ve decided to take this opportunity to eradicate the Chi Devil Sect altogether. Counting the days, the sacrifice by the Chi Devil Sect should soon commence. The exact date, I’m not sure, as my arranged spies haven’t figured it out. You have the Token of Senior Disciple, so you should search for the locations of most people on this list.”<br/><br/>With that said, Guang Qiuxian waved a hand and a piece of yellow paper flew into Fang Wang’s hands.<br/><br/>Fang Wang glanced down at the paper, his expression unchanged.<br/><br/>But, he had already caught three names.<br/><br/>Fang Hanyu, Fang Zigeng, Gu Li!<br/><br/>Fang Wang immediately stored the yellow paper in one of his storage bags, then bowed to Guang Qiuxian and turned to leave.<br/><br/>Looking at Fang Wang’s departing figure, Guang Qiuxian, as if prompted by some unseen force, asked, “If you encounter Lu Yuanjun, what will you do?”<br/><br/>Fang Wang stopped in his tracks, and without turning his head, said, “A traitor of the sect naturally deserves death.”<br/><br/>Guang Qiuxian slightly furrowed his brows, sighed, and then said, “Go on then, remember, you are the Great Disciple of the Great Abyss Gate, and one day you will be the Sect Leader.”<br/><br/>Fang Wang turned and smiled at Guang Qiuxian, “Sect Leader, I assure you, I will not bring disgrace upon the Great Abyss Gate.”<br/><br/>After speaking, he strode away from the Shiyuan Hall.<br/><br/>Guang Qiuxian’s gaze seemed distant, as if recalling past events, a shade of sorrow appearing in his eyes.<br/><br/>After leaving the Main Meridian, Fang Wang flew straight towards the Sect’s Main City. Along the way, he wore a bamboo hat, tilting it slightly down to conceal his face from others.<br/><br/>He arrived at the Daofa Pavilion and, asserting his identity as the Senior Disciple, commanded someone to take him to the highest floor, where he wished to learn sealing spells and formations.<br/><br/>On the top floor, only a few people wandered about, all elders and Peak Masters. Seeing Fang Wang approach, they all smiled and nodded in greeting. No one spoke. Fang Wang returned the gesture with a smile.<br/><br/>As the Senior Disciple, he could practice any of the Great Abyss Gate’s techniques because one must first have made substantial contributions to earn the title.<br/><br/>Here stood rows upon rows of bookshelves, each bearing a wooden sign that detailed the types of spells it contained.<br/><br/>Fang Wang went straight to the shelf of sealing spells. It displayed jade slips with pieces of yellow paper alongside them, which described the spells within each slip.<br/><br/>Two hours later.<br/><br/>Fang Wang left the Daofa Pavilion, slightly lifting his head to let the sunlight fall on his face, which showed signs of profound experiences.<br/><br/>He leapt up and transformed into a streak of white light, speeding away from the Great Abyss Gate.<br/><br/>“Young Master, you looked at so many spells, can you remember them all?” Xiao Zi poked its head out from Fang Wang’s embrace, looking up at him and asked tentatively.<br/><br/>Here it was again, that bizarre condition!<br/><br/>Fang Wang’s eyes were vacant as he gazed into the distance and said in a dull voice, “I can.”<br/><br/>More than that!<br/><br/>Damn it, I’ve already mastered them all to Great Perfection!<br/><br/>A whole five hundred and twenty years!<br/><br/>Fang Wang felt fierce with himself, but it was essential. To craft his fourth Lifespirit Treasure, he had to be harsh on himself.<br/><br/>The sealing techniques of the Great Abyss Gate weren’t numerous, nor were they as refined as those of the Tian Shu Sect; however, they were sufficient for Fang Wang to establish a high level of proficiency with sealing methods.<br/><br/>Five hundred and twenty years was not just for learning one technique but seven in total, with the most profound consuming one hundred and six years of his time.<br/><br/>As Fang Wang left the Great Abyss Gate, he sorted through his thoughts.<br/><br/>“Wait, what was I planning to do before I entered the Daofa Pavilion?” Fang Wang suddenly asked.<br/><br/>Xiao Zits snake-like eyes widened as it quickly responded, “To go to Sword<br/><br/>Heaven Marsh.”<br/><br/>“Anything else?”<br/><br/>“The Sect Leader said to go to the Chi Devil Sect.”<br/><br/>With that, Fang Wang remembered and expressed satisfaction, “Good memory. I was just testing you. Keep it up.”<br/><br/>“Young Master, it’s only been a short time. How could I possibly forget…”<br/><br/>“I was worried you might not have been listening. Right now, we rely on each other for survival. My matters are your matters, understand? You should think of us as a single unit.”<br/><br/>Fang Wang spoke earnestly, and as soon as his words came out, Xiao Zi became immediately excited, instinctively stretching upwards, her forked tongue almost touching Fang Wang’s mouth, startling him into hurriedly stuffing it back in.<br/><br/>This wretched snake, always trying to overstep its bounds!<br/><br/>“Young Master, rest assured, I will definitely focus from now on!” Xiao Zi said excitedly, her delicate female voice leading one’s thoughts astray.<br/><br/>Fang Wang did not continue the conversation.<br/><br/>His heart was still numb, needing time to recover.<br/><br/>Soon, he left the Great Abyss Gate, making Xiao Zi enlarge so she could carry him as they flew.<br/><br/>Xiao Zi had mastered a flying spell, which was also an inheritance from the Great Saint’s Grotto-Heaven.<br/><br/>Sitting cross-legged on the snake’s head, Fang Wang sent his divine consciousness into the Eldest Disciple’s Token to find the locations of Fang Hanyu, Fang Zigeng, and Gu Li. Their points of light were clustered together, surrounded by over a hundred other disciples, in the southwest direction.<br/><br/>Fang Wang had an idea in mind, and he immediately sent a message through his disciple’s token to Fang Hanyu, “If you need my help, make a large detour.” Then he focused his divine consciousness on Fang Hanyu’s point of light.<br/><br/>Ordinary disciple’s tokens could not send messages to the sect or higher-level tokens, only receive commands.<br/><br/>After a while, Fang Hanyu moved, indeed making a circle with her actions.<br/><br/>Fang Wang revealed a smile, following up with a message: “I will come to find you in a few days.”<br/><br/>Having said that, he put the Eldest Disciple’s Token into his storage bag.<br/><br/>Thunderclouds rolled, and desolate mountains stretched on, with groups of crows occasionally sweeping over the mountaintops.<br/><br/>In a forest, Tai Yuan Sect Disciples had gathered, each sitting in meditation. Above their heads floated twelve large flags forming a formation that isolated their presence and figures.<br/><br/>Fang Hanyu returned to Fang Zigeng’s side, a smile on her face. Fang Zigeng opened his eyes to look at her and asked, “Where did you go?”<br/><br/>Fang Hanyu sat down and replied softly, “The Eldest Disciple sent me a message, saying he will come in a few days.”<br/><br/>The Eldest Disciple?<br/><br/>Fang Zigeng was momentarily stunned, then his eyes brightened, and he asked in a low voice, “Fang Wang?”<br/><br/>“Mhm.”<br/><br/>Fang Hanyu nodded lightly, clearly very happy despite being blindfolded.<br/><br/>Fang Zigeng let out a breath of air, feeling relieved.<br/><br/>Having been here for over half a month, Fang Zigeng had been anxious, as his cultivation level was among the lowest in the group. If they really encountered an encirclement by the Chi Devil Sect, he would be in the greatest danger.<br/><br/>Fang Zigeng looked up, muttering, “Who knows how much longer we’ll have to wait to take action.”<br/><br/>Fang Hanyu began to cultivate, saying calmly, “Just wait. We cannot rush this matter; all three sects must act together.” Meanwhile.<br/><br/>Within a cave hundreds of miles away.<br/><br/>Lu Yuanjun was sitting in meditation on a stone bed, a black gourd hanging at his waist. The ghost of Zhao Zhen drifted out of it, hovering over Lu Yuanjun’s shoulder.<br/><br/>At the moment, they were frowning at the person before them.<br/><br/>The former Vice Sect Leader of the Great Abyss Gate, Chen Anshi!<br/><br/>“Has Fang Wang not emerged from seclusion yet?” Lu Yuanjun asked in a grave voice, looking displeased.<br/><br/>It had been so many years!<br/><br/>How could that boy contain himself?<br/><br/>Chen Anshi’s expression was complex as he said in a deep tone, “According to my sources, Fang Wang has already broken through to the Condensation Spirit Realm and is currently in seclusion to consolidate his cultivation. Whether he will come out yet remains uncertain.” The Condensation Spirit Realm!<br/><br/>Lu Yuanjun’s face grew even more displeased.<br/><br/>Zhao Zhen exclaimed, “How old is he? Seems like he’s only forty-three, right? To reach the Condensation Spirit Realm at such an age is terrifying. In at most fifty years, he’ll surpass the Condensation Spirit Realm, and by then, he alone could dominate the entire Da Qi Cultivation Realm, couldn’t he?”<br/><br/>Chen Anshi nodded, adding, “Indeed, it’s quite likely. However, the Da Qi Cultivation Realm does not have cultivation techniques to reach higher realms.<br/><br/>If he wishes to pursue higher realms, he can only leave the Da Qi Cultivation Realm.”<br/><br/>Not all cultivation techniques can be broken through indefinitely; each has its own limit. The most profound cultivation techniques of the Nine Great Sects can only reach the Condensation Spirit Realm, and because there are so few methods, practitioners at this level are not numerous. Those who reach it are all exceptionally gifted.<br/><br/>“If he leaves the Da Qi Cultivation Realm, the next time we meet him, he might well be a true immortal among men,” sighed Zhao Zhen. “Why did we have to encounter such a genius? The heavens really enjoy making fools of us. Without Fang Wang, I could have continued my cultivation in pursuit of immortality,<br/><br/>Lu Yuanjun could have smoothly become the Sect Leader of the Great Abyss<br/><br/>Gate, eventually even becoming the prime figure in the Da Qi Cultivation Realm, and Elder Chen could have returned with his mission accomplished, with everyone happy. Unfortunately, Fang Wang became the unpredictable factor. How can one person’s power reach such a level? Alas! How unfair the heavens are!”<br/><br/>Zhao Zhen’s words struck chord with both Lu Yuanjun and Chen Anshi.<br/><br/>Indeed!<br/><br/>If not for Fang Wang, all their plans would have gone smoothly!<br/><br/>Chen Anshi sighed deeply, saying, “There is also the Jin Xiao Sect. I don’t know where that Demon Monarch sprang up from, who rescued so many who were supposed to die, creating a force that cannot be underestimated. It seems that powers from beyond Da Qi have infiltrated our realm, and it’s unclear what they want.”<br/><br/>Lu Yuanjun said coldly, “No matter what, we must wait for Fang Wang to come out. If he doesn’t come out, then we must find a way to force him. Presumably, the people of the Great Abyss Gate are already nearby. Find a way to capture them.”<br/><br/>Chen Anshi squinted and asked, “Shall we kill a few of the Fang Family<br/><br/>Members to urge him? He will surely panic!”<br/><br/>“No, that would anger him. With his cultivation, if he loses his senses, it’s hard to imagine what might happen. If he feels no pressure for the time being, he might become careless,” Lu Yuanjun shook his head..\t\t\t\t\t\t</div>", "images": {}, "success": true}