{"id": 90, "url": "https://www.novelhall.com/i-became-an-immortal-on-mortal-realm-32879/14282881.html", "title": "Chapter 90 - Chapter 90: Chapter 87 The Position Of The Great Disciple Of The Main Meridian 1", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 90 - Chapter 90: Chapter 87 The Position Of The Great Disciple Of The Main Meridian 1</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 90: Chapter 87 The Position of the Great Disciple of the Main Meridian 1<br/><br/>Translator: 549690339<br/><br/>Dusk gradually fell.<br/><br/>On the hillside, Fang Wang walked slowly forward, his Golden Scale White Feather Robe stained with fresh blood, and even his face bore traces of blood; Xiao Zi lay on his shoulder, similarly drenched in blood.<br/><br/>He sat down in front of a large stone, the remaining sunlight of the setting sun cast upon him, casting half of his face into shadow. Between him and the sunset, among the mountains, lay the gigantic bodies of poisonous insects and the corpses of Green Cicada Valley Demonic Cultivators, a sight that shook the soul.<br/><br/>Tired!<br/><br/>An unprecedented level of fatigue!<br/><br/>Fang Wang stored the Heavenly Palace Halberd into the Treasured Spirit Space. He exhaled a breath of turbid air, not wanting to do anything at the moment, not even Qi Gathering; he just wanted to empty his mind for a while.<br/><br/>Before this battle, he had longed for an opportunity to fight with all his might. This fight had indeed pushed him to his limits, but the enemy was too numerous, depleting his Spiritual Power and physical energy. After using Black Dragon to break the Myriad Poison Array, he fought a hundred miles all the way. Those Demonic Cultivators didn’t dare to confront him, but they released poisonous insects in their escape to buy themselves time.<br/><br/>Fang Wang didn’t know how many poisonous insects he had killed, but fortunately, the Golden Scale White Feather Robe could block the splash of venom.<br/><br/>The existence of the Combat Heart allowed him to enter the most perfect state of combat, unaffected by any sneak attacks from poisonous insects or spells.<br/><br/>Reflecting on the battle, he recognized his shortcomings. His combat strength was enough to sweep through most Condensation Spirit Realm Cultivators, but he was ultimately in the Profound Heart Realm, with limited Spiritual Power, not enough to annihilate a sect by himself.<br/><br/>However, this battle saw him slaughtering thousands of Demonic Cultivators, severely weakening Green Cicada Valley. For a long time to come, Green Cicada Valley would likely not dare to show its face, and if enemies took the opportunity to kick them while they were down, perhaps Green Cicada Valley would be completely destroyed. Among the Cultivators of the Profound Heart Realm that Fang Wang killed, there were at least a hundred, which was an extremely heavy loss for any sect.<br/><br/>“I need to break through to the Condensation Spirit Realm soon. Then, when facing such a situation next time, I can simply use the Celestial Sword Intent to sweep them clean,” Fang Wang reflected solemnly. The Celestial Sword Intent consumed a great deal of Spiritual Power, and with Green Cicada Valley’s Demonic Cultivators spread so far and wide, along with countless poisonous insects, if he were to fight using Celestial Sword Intent, perhaps before even one-fifth of the enemy died, his Spiritual Power would be exhausted. After all, the participating Green Cicada Valley Demonic Cultivators weren’t in the Qi Cultivation Realm; they were the elite, and the variety of spells they used still felt novel to him upon reflection.<br/><br/>Xiao Zi lay on Fang Wang’s shoulder, silent as if dead, also extremely tired. Before breaking the array, it was already injured, but afterwards, due to extreme excitement, its demonic power depleted even faster.<br/><br/>Fang Wang slightly raised his head, gazing into the dusk, his thoughts drifting.<br/><br/>Only when night had fallen did he regain some strength, beginning to meditate and perform Qi Gathering, while also consuming Spiritual Energy pills.<br/><br/>Xiao Zi opened its mouth, starting to consume the Essence of the Sun and Moon, the night silent and lonely, both the human and the animal not in the mood for conversation.<br/><br/>By the next morning, Fang Wang was still gathering Qi, the bloodstains on his body now washed clean, thanks to Xiao Zi. It had mastery over water-based spells. It spat water from its mouth, helping him to clean up.<br/><br/>Suddenly feeling something, Fang Wang raised his hand and took out his Disciple Token.<br/><br/>“The crisis of the sect has already been lifted.”<br/><br/>Zhao Chuanqian’s voice came from it, his tone weary.<br/><br/>Fang Wang breathed a sigh of relief, indeed meriting the reputation of the future’s strongest sect, repelling the enemy within two days. But judging from Zhao Chuanqian’s tone, the battle was fierce.<br/><br/>Although Fang Wang was concerned about the Fang Family Members, if someone had indeed died, he couldn’t bring them back to life by returning; and if they were still alive, the Taiyuan Gate would surely take good care of them. His mind settled for the moment, there was no need to rush back to the sect. He stood up and said, “Xiao Zi, it’s time to collect the spoils of war.”<br/><br/>Xiao Zi woke with a start, and after a moment of grogginess, joyfully said,<br/><br/>“That’s right, almost forgot, Master, let’s hurry!”<br/><br/>Fang Wang smiled and headed down the mountain.<br/><br/>Following the direction he was going, the woodland was withered, the corpses of the poisonous insects adding a thrilling atmosphere to the already desolate scenery. In the horizon, dim poison fog still lingered, long unable to dissipate, all signs of how brutal yesterday’s battle was.<br/><br/>Thus, Fang Wang and Xiao Zi began searching along the way for storage bags.<br/><br/>The Demonic Cultivators of Green Cicada Valley each hid poison in their<br/><br/>storage bags, making their collection somewhat troublesome. Fortunately, they were not afraid of poison, Fang Wang had the Solaris True Fire, and Xiao Zi was itself a poisonous snake.<br/><br/>Two days later, they came across the rotting corpses of Green Cicada Valley Demonic Cultivators. The flesh and blood of these corpses were filled with toxicity, making it hard to imagine what kind of Cultivation these individuals undertook.<br/><br/>It’s worth mentioning that they encountered some Loose Cultivators along the way, also engaging in the same activity.<br/><br/>“Stop right there, you rascal, daring to collect bodies alone, aren’t you afraid of dying? State your name!”<br/><br/>Four Loose Cultivators landed in front of Fang Wang, the leader brandishing a knife and speaking sternly. They were cautious, not attacking immediately.<br/><br/>Fang Wang responded cheerfully, “These are my spoils of war. But you, daring to rob me, are courting death?”<br/><br/>Xiao Zi peeked out from behind Fang Wang, hissing, “My master is a Taiyuan<br/><br/>Gate Direct Disciple, the Sword Saint’s Successor, known as the Heaven Yuan<br/><br/>Sword Saint. Have you heard of him?”<br/><br/>Upon hearing this, the expressions of the four Loose Cultivators changed drastically as they began to retreat.<br/><br/>“Is that Fang Wang?”<br/><br/>“Sword Heaven Marsh isn’t too far from here; it’s possibly him…”<br/><br/>“Could they be bluffing us?”<br/><br/>“Want to take that bet? Count me out!”<br/><br/>After muttering among themselves, someone decides to leave quickly, and the other three hesitate to stay. Some even bowed to Fang Wang, fearing he would take offense.<br/><br/>Fang Wang couldn’t help but smile, refraining from pursuing them. With so many bodies, someone was bound to take advantage of the leftovers; as long as no one took the storage bags in front of him, it was fine.<br/><br/>Elsewhere,<br/><br/>Members of the Fang Family also encountered the corpses of Green Cicada Valley Demonic Cultivators. Looking ahead at the mountains blanketed with insect corpses, every face showed fear and unease.<br/><br/>Looking around, the mountains and forests ahead were withered, forming a straight line that extended to the horizon, exceptionally horrifying. It was hard to imagine just what kind of battle had taken place here a few days ago.<br/><br/>“Let’s take a detour.”<br/><br/>Fang Meng spoke up. Although it would be a hassle, no one objected; everyone preferred not to explore what had actually happened.<br/><br/>Fang Yin couldn’t help but worry about Fang Wang. Even though Fang Wang should be within Sword Heaven Marsh, he feared that Fang Wang might have also been caught up in this unknown war.<br/><br/>Previously, to avoid worrying them, Fang Wang and his companion had deliberately detoured around them so as not to be discovered by them.<br/><br/>At Great Abyss Gate’s main peak, within Shiyuan Hall, all nine Peak Masters as well as many elders and direct disciples were present.<br/><br/>Guang Qiuxian was meditating on a cushion, pale-faced and appearing very weak.<br/><br/>The chief disciples from each meridian were reporting casualty figures, causing everyone present to look somber.<br/><br/>Zhou Xue stood behind the first meridian’s Peak Master, listening silently.<br/><br/>After the chief disciples finished their reports, an elder said, “The Chi Devil Sect, Huangyu Mountain, and Ancient Demon Mountain joined forces to attack us. We must avenge this insult!”<br/><br/>Upon hearing this, the other elders spoke out in agreement:<br/><br/>“Exactly, what nonsense about a peace treaty. Unacceptable. We must seek revenge on these three Demonic Sects!”<br/><br/>“Almost twenty thousand disciples died. This is the greatest casualty we’ve suffered in the last three hundred years at Taiyuan Gate!”<br/><br/>“Thankfully, Green Cicada Valley did not join in, or else we might not have been able to withstand it.”<br/><br/>“I suggest we write to Taiqing Gate, Suspended Vast Sword Sect, Tian Shu Sect, and Crimson Sect to join forces with us in declaring war against the Demonic<br/><br/>Path!”<br/><br/>The direct disciples from various meridians were equally outraged, struggling to contain the murderous and angry looks in their eyes.<br/><br/>Vice Sect Leader Chen Anshi frowned and said, “Enough. If we’re to seek revenge, we also need some time to recover!”<br/><br/>At his words, the elders became quieter, which showed his considerable influence.<br/><br/>Chen Anshi stepped forward, focusing on Guang Qiuxian and said, “Sect Leader, you’ve been seriously injured and will likely need time to heal. I also have to go out to supervise the matter of the Dragon Vein, so we should select a main meridian chief disciple to take charge of all sect affairs and stabilize the situation.”<br/><br/>“I propose that Lu Yuanjun takes on the role of chief disciple of Taiyuan Gate. His contributions and seniority are sufficient. In this catastrophe, he alone held off the Sect Master of Chi Devil Sect, which is a remarkable feat. Does anyone object?”<br/><br/>As his words fell, he turned to look at everyone in the hall.<br/><br/>The atmosphere in the grand hall turned delicate.<br/><br/>Yang Yuanzi immediately stood up and said, “My disciple Fang Wang has inherited the legacy of Sword Saint, slain the Great Demon King, defeated Sword Sect’s Kong Xi, and is renowned throughout Da Qi Cultivation Realm. He rightfully deserves the position of chief disciple. That is what everyone expects!”<br/><br/>Immediately, many elders echoed this sentiment. Though Lu Yuanjun was well-liked, the factions within Taiyuan Gate were intricate and complex; it was impossible for him to be favored by everyone.<br/><br/>Hearing Yang Yuanzi’s words, Lu Yuanjun seemed unfazed, still standing composedly behind the first meridian’s Peak Master.<br/><br/>Chen Anshi looked at Yang Yuanzi and said sternly, “Fang Wang’s talent and fame are indeed extremely high, unmatched by any disciple. However, his contributions to Taiyuan Gate are too minimal to convince everyone. Should the position of Sect Leader of Taiyuan Gate also be decided by talent? Then what is the point of the sacrifices made by the disciples for the sect?”<br/><br/>This statement won the approval of the elders supporting Lu Yuanjun.<br/><br/>Even someone said sarcastically, “Perhaps this catastrophe was even caused by him drawing too much attention to himself. If we knew of a Heaven Yuan Spirit Treasure emerging within a Demonic Sect, wouldn’t we take action?” This touched a nerve with most of the people present.<br/><br/>The catastrophe came abruptly, and the majority of the sacrificed disciples died within the first half-hour. Apart from Fang Wang’s Heaven Yuan Spirit Treasure, what else could warrant such a massive Demonic Path invasion?<br/><br/>“Ridiculous, Fang Wang never told anyone about the grade of his spirit treasure. It is us, the elders, who failed to protect him, exposing his spirit treasure’s grade, putting him in the spotlight. How can you blame him? Does this mean that Taiyuan Gate cannot have outstanding talents in the future? What would other sects, the entire Cultivation World think of us at Taiyuan Gate?” Yang Yuanzi said forcefully, leaving the elder at a loss for words.<br/><br/>Lu Yuanjun narrowed his eyes, the look he gave Yang Yuanzi carrying a chill.<br/><br/>Another elder furrowed his brows and said, “But his contribution is indeed very low, and that cannot convince the masses!”<br/><br/>Mentioning sect contribution, the elders supporting Lu Yuanjun had more to say.<br/><br/>The grand hall was once again filled with contentious debate and noise.<br/><br/>Guang Qiuxian’s brow was deeply furrowed, reluctant to make a statement.<br/><br/>At that moment.<br/><br/>Elder Zhang from the Task Hall seemed to sense something, raised his hand to take out a jade slip from his storage bag, and read it with his divine consciousness. Immediately after, his complexion changed dramatically.<br/><br/>Chen Anshi stared at Yang Yuanzi and snorted coldly, “Elder Brother Yang, the position of chief disciple concerns the entire Taiyuan Gate. Please be impartial!”<br/><br/>Yang Yuanzi was unflinching and about to retort when Elder Zhang suddenly said loudly, “Everyone, Green Cicada Valley has taken nearly twenty thousand disciples to encircle Fang Wang! ”<br/><br/>As soon as these words were spoken, the grand hall became instantaneously silent.<br/><br/>Guang Qiuxian stood up abruptly, aggravating his wounds, and asked through gritted teeth, “Where? What is the situation?”\t\t\t\t\t\t</div>", "images": {}, "success": true}