{"id": 108, "url": "https://www.novelhall.com/i-became-an-immortal-on-mortal-realm-32879/14294417.html", "title": "Chapter 108 - Chapter 108: Chapter 105: Zhao Zhen’S Shock, Xiao Zi Wants To Transform", "volume": 2, "volume_title": "Volume 2", "body": "<h1>Chapter 108 - Chapter 108: Chapter 105: Zhao Zhen’S Shock, Xiao Zi Wants To Transform</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 108: Chapter 105: Zhao Zhen’s Shock, Xiao Zi Wants to Transform<br/><br/>Translator: 549690339<br/><br/>Watching Zhao Zhen continuously kowtow to him, Fang Wang suddenly felt that he was also a pitiful person, just that today’s outcome was his deserts.<br/><br/>Regardless, the Yin Yang Xuan Ming Zhen Gong was given to him by Zhao Zhen.<br/><br/>Until his death, Lu Yuanjun never understood why Fang Wang could neutralize his Xuanming Seal.<br/><br/>Fang Wang’s eyes flickered, his thoughts swift as lightning.<br/><br/>“Young Master, if you don’t fancy this Ghost Instrument, why not give it to me? I often deal with monsters in the Great Saint’s Grotto-Heaven,” Xiao Zi edged closer and said.<br/><br/>Fang Wang thought for a moment and said, “Do you need my help?”<br/><br/>“No need, his assistance is enough. I’m sure he wouldn’t dare to make any mistakes,” Xiao Zi said as she slithered in front of the Soul Devouring Gourd, flicking her tongue.<br/><br/>Zhao Zhen looked up at Xiao Zi, his expression astonished.<br/><br/>A demon snake wants the Ghost Instrument?<br/><br/>He dared not question and promptly said, “I will definitely not cause trouble!” As long as he could survive, he no longer cared who his master was.<br/><br/>Fang Wang nodded, then watched Xiao Zi refine the Ghost Instrument.<br/><br/>Xiao Zi stared intently at the Soul Devouring Gourd, her eyes emitting a purple light, and Fang Wang clearly felt a strong consciousness probing into the Soul Devouring Gourd.<br/><br/>It seemed that the immense Black Python, which had helped Xiao Zi enhance her blood and qi, had also significantly strengthened her spiritual consciousness.<br/><br/>Indeed, the immense Black Python had died, ultimately consumed by Xiao Zi. Since the Black Python was slain by Fang Wang, the Three Great Sects could not intervene and could only watch Xiao Zi wastefully devour such an entity.<br/><br/>Zhao Zhen scurried back into the Soul Devouring Gourd, and the forest fell silent.<br/><br/>Fang Wang felt somewhat worried, so he kept his spiritual consciousness on the Soul Devouring Gourd, ready to assist Xiao Zi at any moment.<br/><br/>However, the situation took a turn quite different from what he had expected. Xiao Zits behavior was extremely tyrannical, even causing Zhao Zhen to wail in agony from within the Soul Devouring Gourd.<br/><br/>Was this a show of force?<br/><br/>Fang Wang couldn’t help but reassess Xiao Zi.<br/><br/>Could it be that her submissive demeanor in front of him was all an act?<br/><br/>An hour later.<br/><br/>A colossal purple snake, like a dragon emerging from the mountains, flew high into the sky. Fang Wang sat upon its head, with Zhao Zhen’s spirit hovering beside them.<br/><br/>The Soul Devouring Gourd, which was hanging on Xiao Zi’s back, appeared tiny in comparison.<br/><br/>“That treasure must be extraordinary, otherwise, Lu Yuanjun wouldn’t have left it in his mother’s tomb. It might be related to the legacy of the Ji Hao Sect,” Zhao Zhen spoke earnestly.<br/><br/>Fang Wang had originally planned to go directly in search of the Heavenly Gang Saint Body Technique, but after hearing Zhao Zhen mention that Lu Yuanjun had hidden something, he became intrigued.<br/><br/>Perhaps that object could aid in the search for the Heavenly Gang Saint Body Technique.<br/><br/>After Xiao Zi refined the Soul Devouring Gourd’s constraints, Zhao Zhen’s ghost was now under her control. With a mere thought, she could make Zhao Zhen dissipate into ash. To preserve himself, Zhao Zhen offered up one of Lu Yuanjun’s secrets.<br/><br/>According to Lu Yuanjun, that treasure was positioned together with the Yin Yang Xuan Ming Zhen Gong, but Lu Yuanjun couldn’t comprehend it and had to put it aside temporarily.<br/><br/>“By the way, why did Lu Yuanjun tell you everything?” Xiao Zi couldn’t help but ask.<br/><br/>Zhao Zhen floated beside Fang Wang and sighed, “After he turned me into a ghost soldier, he confided the truth to me. He had repressed too many things and needed to vent. Unlike other ghost soldiers, I possessed my own will, so he wanted to hear my opinions.”<br/><br/>“Speaking of which, he’s also a pitiful person. The reason he collected souls for Heaven’s Larceny Saint Sect wasn’t out of greed for more profound techniques, but to harness the Saint Spirit’s power to resurrect his own mother.”<br/><br/>Upon hearing this, Fang Wang thought of Zhou Xue’s words, that each Saint Spirit had different abilities could it be that the Saint Spirit Soul Jade that Zhou Xue possessed had the power to resurrect the dead?<br/><br/>No wonder Zhou Xue wanted it.<br/><br/>“If that’s the case, why did he set a trap for my Young Master? Shouldn’t he have endured for the sake of his mother and fled far away?” Xiao Zi asked in surprise.<br/><br/>Zhao Zhen spread his hands and said, “Where else in other dynasties could he roam freely and kill? If he had gone there, he would sooner or later become a street rat, hunted by the Cultivation World. Plus, he had operated in Grand Qi for so many years; how could he willingly give up everything he controlled? Most importantly, he coveted the Heaven Yuan Spirit Treasure belonging to the master. ”<br/><br/>Though constrained by Xiao Zi, he still respectfully referred to Fang Wang as the master, because he could see that Xiao Zi listened to Fang Wang, and it was not a feigned obedience.<br/><br/>Fang Wang, who had just been cooped up in the Heavenly Palace for two hundred and eighty years, found Zhao Zhen’s account of Lu Yuanjun’s story quite intriguing.<br/><br/>Along the way, Zhao Zhen gave directions while revealing Lu Yuanjun’s dirty secrets, Xiao Zi occasionally asked questions, and Fang Wang listened attentively, rarely speaking.<br/><br/>The next afternoon.<br/><br/>Xiao Zi brought Fang Wang to a land of ice and snow. This was the northern part of Grand Qi, and eight hundred miles further north would be the Northern Border, a rival kingdom. Every hundred years, they would attack Grand Qi from the south, becoming Grand Qi’s ancient nemesis. In history, the best result Grand Qi had æainst the Northern Border was driving its armv out without ever truly penetrating into the Northern Border. The reasons were twofold: the harsh climate and the vast distance.<br/><br/>Guided by Zhao Zhen, Xiao Zi landed on a snowy mountain. Fang Wang dismounted, Xiao Zi shrank in size, and the Soul Devouring Gourd on her back became comparatively larger.<br/><br/>A purple snake carrying a gourd looked quite cute, making Fang Wang involuntarily prod the gourd with the tip of his foot, eliciting an annoyed fuss from her.<br/><br/>Zhao Zhen floated in the air, thinking to himself, “So Fang Wang has a taste for this, no wonder he seldom shows his face in public. Could it be that he had been in his cave dwelling all this time…”<br/><br/>As the emperor, Zhao Zhen had enjoyed all sorts of pleasures, but Fang Wang still managed to surprise him.<br/><br/>The Heaven Yuan Spirit Treasure is indeed extraordinary.<br/><br/>Soon.<br/><br/>Zhao Zhen stopped and pointed at the mountain wall covered in deep snow ahead of them, “It’s inside here, but there are restrictions on the mountain gate, so it hasn’t revealed itself.”<br/><br/>Fang Wang’s eyes hardened, and a stream of Sword Qi surged forth.<br/><br/>Divine Nurturing Sword Qi!<br/><br/>Boom!<br/><br/>Snow mist soared, debris shot in all directions, and a cave entrance appeared in front of Fang Wang, Zhao Zhen, and Xiao Zi.<br/><br/>Zhao Zhen, witnessing that sword qi return to Fang Wang’s eyes, became dumbfounded.<br/><br/>What kind of swordsmanship is this?<br/><br/>The inheritance of Sword Saint?<br/><br/>Zhao Zhen couldn’t understand. He suddenly felt sorry for Lu Yuanjun; not realizing how strong his enemy truly was, was utterly foolish.<br/><br/>Xiao Zi was the first to rush towards the cave entrance, with Zhao Zhen floating after her, while Fang Wang casually strolled behind.<br/><br/>Amid the swirling snow under the vast icy sky, his figure seemed so insignificant.<br/><br/>After entering the cave.<br/><br/>Passing through a long and winding tunnel, they arrived at a spacious cavern with an ice coffin placed at its center. Lamps embedded in the walls of the cave flickered, fuelled by nature’s spiritual energy that transformed into lamp oil upon entering.<br/><br/>Fang Wang approached the ice coffin and saw through the transparent lid a woman lying inside.<br/><br/>Such a beautiful woman!<br/><br/>At first glance, Fang Wang was captivated. This was certainly the most beautiful face he had ever seen. She was dressed in a long white gown, hands placed before her abdomen, wearing exquisite makeup with a coronet on her head, her splendid visage exuding an air of sacred purity. Her skin was pale as snow, with long lashes that gave the illusion that she might open her eyes at any moment.<br/><br/>At a glance, it was hard to believe that this woman had been dead for decades; it was as if she merely slept there, refusing to awaken.<br/><br/>“Tsk, tsk, no wonder the master and the Sect Leader can’t forget her,” Fang Wang reflected as he then turned to gaze at Zhao Zhen.<br/><br/>Zhao Zhen pointed at the ground beneath them, saying, “Lu Yuanjun buried that treasure here.”<br/><br/>Without waiting for Fang Wang’s orders, Xiao Zi started digging.<br/><br/>Within less than five breaths, a hexagonal slab fell into Fang Wang’s hands.<br/><br/>This slab, weighing about twenty pounds, was engraved with strange patterns depicting humans and monsters, seemingly recording an event from ancient times.<br/><br/>He probed into it with his divine sense, only to be repelled by a formidable force.<br/><br/>Hmm?<br/><br/>Fang Wang was at the Condensation Spirit Realm and yet there was something his divine sense couldn’t penetrate, which suggested that the slab was not ordinary.<br/><br/>After tinkering with it for a while to no avail, Fang Wang placed the slab into his storage bag and then turned to look at Xiao Zi.<br/><br/>Xiao Zi was peering intently into the ice coffin at the mother of Lu Yuanjun.<br/><br/>Fang Wang said, “Stop looking. She’s been dead for decades; you don’t plan on eating her, do you? If that’s the case, I’d really have to despise you.”<br/><br/>Turning around, Xiao Zi looked at Fang Wang and asked, “Master, if I transform one day, can I take on her appearance?”<br/><br/>“Can’t you imagine your own appearance?” Fang Wang frowned, finding Xiao Zits thoughts somewhat dangerous.<br/><br/>Xiao Zi blinked her serpent eyes and said, “When monsters transform, they always mimic human faces.”<br/><br/>“Let’s go, stop thinking about it.”<br/><br/>Fang Wang turned to leave, Xiao Zi rapidly followed.<br/><br/>Zhao Zhen, dragged by the Soul Devouring Gourd, couldn’t help but look back, his gaze lingering on the ice coffin.<br/><br/>In the spacious and serene cavern, the ice coffin seemed so lonely, so desolate.<br/><br/>With the deaths of Lu Yuanjun and Chen Anshi, it’s unlikely anyone would help her come back to life.<br/><br/>Zhao Zhen retracted his gaze, looking towards Fang Wang.<br/><br/>From now on, he would follow this man.<br/><br/>He became curious about Fang Wang’s future.<br/><br/>After exiting the cave, Fang Wang turned around and waved his sleeve to pile up snow at the entrance, then cast a sealing technique to isolate the inside aura.<br/><br/>Xiao Zi asked, “Why bother? She’s Lu Yuanjun’s mother. No one will help her come back to life now; she’ll decay sooner or later.”<br/><br/>Fang Wang replied calmly, “It was a mere trifle. My enmity with Lu Yuanjun doesn’t involve his mother.”<br/><br/>With that, he turned around and Xiao Zi grew in size, bowing her snake head.<br/><br/>Fang Wang sat down on her head, and took out a map from his storage bag.<br/><br/>The map was ancient, many of the place names having changed; Fang Wang asked Zhao Zhen to help him with it.<br/><br/>Zhao Zhen, who grew up in the royal family, had extensive knowledge of ancient culture. After some thought, he pointed in a direction, and Xiao Zi swiftly took flight.<br/><br/>“This destination should be beyond Grand Qi, likely within the domain of<br/><br/>Grand Wei. What are you looking to find, Master?” Zhao Zhen asked curiously.<br/><br/>With Fang Wang only a step away from becoming the leader of the Great Abyss Gate, they would certainly meet his every need—why would he travel to another kingdom?<br/><br/>“I’m looking for the Heavenly Gang Saint Body Technique,” Fang Wang replied with a light chuckle.<br/><br/>Zhao Zhen was moved and said, “You want to gather the Three Great True<br/><br/>Cultivations of the Ji Hao Sect? That won’t be easy. Not to mention one True Cultivation’s whereabouts are unknown, even if you find them, becoming an<br/><br/>Immortal is elusive.”<br/><br/>Fang Wang, looking at the map, answered, “I’ve already practiced the Yin Yang<br/><br/>Xuan Ming Zhen Gong and the True Combat Technique, just missing the Heavenly Gang Saint Body Technique. This map should be accurate. Let’s gather them first; as for destiny with Immortality, it would be good fortune to achieve it, and no loss if I don’t.” The True Combat Technique?<br/><br/>Zhao Zhen was stunned, inwardly exclaiming how unfair the heavens were…<br/><br/>He had heard that Fang Wang had mastered the Nine Dragons Divine Transformation Art of the Ji Hao Sect. Now, he was very curious about what Fang Wang had gained from his time in the Great Saint’s Grotto-Heaven..\t\t\t\t\t\t</div>", "images": {}, "success": true}