{"id": 107, "url": "https://www.novelhall.com/i-became-an-immortal-on-mortal-realm-32879/14294416.html", "title": "Chapter 107 - Chapter 107: Chapter 104: Minor Divine Skill, Sky Capturing Palm Great Perfection", "volume": 2, "volume_title": "Volume 2", "body": "<h1>Chapter 107 - Chapter 107: Chapter 104: Minor Divine Skill, Sky Capturing Palm Great Perfection</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 107: Chapter 104: Minor Divine Skill, Sky Capturing Palm Great Perfection<br/><br/>Translator: 549690339<br/><br/>“In my past life, I naturally encountered the Heaven’s Larceny Saint Sect, and moreover, I was one of them,” Zhou Xue said with a smiling tone. As she spoke, she took two steps back and sat down with her sleeves swept back in meditation.<br/><br/>Fang Wang followed suit and sat down in meditation, then asked, “You joined the Heaven’s Larceny Saint Sect too? Didn’t you say that Lu Yuanjun would become the pinnacle of the Grand Qi Cultivation Realm? Doesn’t that mean that the Grand Qi Cultivation Realm wasn’t destroyed by the Heaven’s Larceny Saint Sect?”<br/><br/>Zhou Xue replied, “Of course, without you and me, the Heaven’s Larceny Saint<br/><br/>Sect wouldn’t have thought to destroy the Grand Qi Cultivation Realm. Hu Yuanjun and Chen Anshi’s plan would have succeeded. Now it seems they’ve always been secretly serving the Heaven’s Larceny Saint Sect. In the previous life, they were successful, and with the support of the Heaven’s Larceny Saint Sect, Lu Yuanjun became Grand Qi’s foremost cultivator.”<br/><br/>“In the previous life, three hundred years later, the Heaven’s Larceny Saint Sect would move southward, conquering the lands of forty-nine dynasties along the way, becoming the strongest Cultivation Sect in this continent. Grand Qi was also subordinate to the Heaven’s Larceny Saint Sect, but there was no massacre because Lu Yuanjun surrendered proactively,” she said.<br/><br/>Fang Wang frowned and said, “So, you’re saying that I inadvertently caused the Heaven’s Larceny Saint Sect to emerge prematurely, bringing a potential catastrophe upon the Grand Qi Cultivation Realm?”<br/><br/>Zhou Xue consoled him, “You can’t think like that. Lu Yuanjun set a trap for you, and the news about the Chi Devil Sect’s treasure was leaked by their own people. Since Lu Yuanjun is involved, it means he wants you dead.”<br/><br/>“As for the so-called catastrophe, even if it happens, it’s just a matter of who dies. In a former life, countless mortals perished as Grand Qi transformed into a Cultivation Dynasty. Now, even if the Heaven’s Larceny Saint Sect moves southward, it’s only targeting the Cultivation Realm. Considering the number of deaths, this life cannot possibly match the previous one, where Grand Qi once saw corpses everywhere and the land was desolate, with barely one in ten people surviving.”<br/><br/>“I used to think it was the strife of the Nine Great Sects, but now it seems like it was Chen Anshi and the Chi Devil Sect collecting souls for the Heaven’s Larceny<br/><br/>Saint Sect,” Zhou Xue remarked, sighing over these matters.<br/><br/>She solemnly said, “The Heaven’s Larceny Saint Sect is very powerful, and one must not provoke them. However, they are only powerful on this continent. The Yellow Glyph Sword Sovereign Order in your hand belongs to a far more powerful force. Once you reach the Cross-Void Realm, you can head southward and seek opportunities overseas.”<br/><br/>The Cross-Void Realm!<br/><br/>Fang Wang asked, “Why do you insist that I go overseas?”<br/><br/>Zhou Xue looked at him and said, “You might think your talent is strong, but the difficulty of spiritual practice at higher realms is immense, far beyond your current imagination. Heading southward, you can go to a cave dwelling with a much more abundant spiritual energy for cultivation. The Yellow Glyph Sword Sovereign Order in your hand will enable you to access a cave dwelling where the spiritual energy is more than ten times that of Great Abyss Gate’s, and that’s just one of the benefits.” Ten times!<br/><br/>Fang Wang felt somewhat tempted.<br/><br/>“Do you have the Saint Spirit Soul Jade with you?” Zhou Xue suddenly asked.<br/><br/>Fang Wang nodded and subsequently took out a yellowed ancient jade. This was previously obtained on the sacrificial platform. Great Abyss Gate, Tian Shu Sect, and Suspended Vast Sword Sect were all searching for it, but he didn’t reveal it.<br/><br/>He directly tossed the Saint Spirit Soul Jade to Zhou Xue.<br/><br/>Catching it with one hand, Zhou Xue remarked with emotion, “This is a real treasure. There are many pieces of such soul jade, and each one needs a massive storage of soul force. As long as there’s enough soul force, it can revive a Saint Spirit.”<br/><br/>Fang Wang curiously asked, “What is a Saint Spirit? Are they strong?”<br/><br/>He remembered the mysterious soul body he had seen on the sacrificial platform, whose daunting figure was unsettling even to think about.<br/><br/>Zhou Xue answered, “Those are ancient demons from ancient times. Each demon had different abilities. In a former life, the Heaven’s Larceny Saint Sect once revived a Saint Spirit, but unfortunately, they could not control it, bringing an apocalyptic threat to this continent. The Heaven’s Larceny Saint Sect perished because of this, and afterward, I went overseas to seek the chance of immortality.”<br/><br/>Fang Wang furrowed his brows and asked, “Doesn’t that mean this continent would have been wiped out of all living beings?<br/><br/>“Naturally not, the Saint Spirit was eventually subdued by an extremely powerful individual from the Mortal Realm. That same individual ascended to immortality with me. Before I died, his achievements were still something I looked up to,” she recounted wistfully.<br/><br/>“How about giving me this piece of Saint Spirit Soul Jade?” Zhou Xue asked, fixing her gaze on Fang Wang.<br/><br/>Fang Wang nodded and said, “Take it then, I got it for you anyway.”<br/><br/>Zhou Xue raised an eyebrow and asked, “Really?”<br/><br/>Fang Wang smiled and nodded again.<br/><br/>He wanted to say, after all, you’re my fiancée, so what’s the harm in giving you a treasure?<br/><br/>But he found it hard to utter those words. For some reason, he always found it hard to tease Zhou Xue.<br/><br/>Zhou Xue gave him a profound look. She stored the Saint Spirit Soul Jade in her storage bag and then smiled, “What do you want to learn? Just say it.”<br/><br/>Fang Wang shook his head and replied, “Let’s skip it this time, I’m not learning.”<br/><br/>He was about to search for the Heavenly Gang Saint Body Technique—it would involve at least another two hundred years of his time, and he had just spent five hundred years within Great Abyss Gate. He could not afford to learn anything new.<br/><br/>Zhou Xue stared intently at Fang Wang. as though she wanted to see right<br/><br/>through him.<br/><br/>“You don’t want to learn, so I’m going to teach you,” she stated.<br/><br/>“Huh? Why?” he asked.<br/><br/>“Because I want to. Listen well, this is a Divine Skill called Sky Capturing Palm!” Zhou Xue smiled and began to impart the technique.<br/><br/>Fang Wang inwardly groaned upon hearing this. He really wanted to get up and leave, but his body refused to budge.<br/><br/>Alas!<br/><br/>He might as well surrender.<br/><br/>Fang Wang began to listen attentively.<br/><br/>The Sky Capturing Palm is akin to a sealing Divine Skill. Any creature grasped by it would become immobile, even their Primordial Spirit would not be able to escape. This Divine Skill could also capture massive objects, hence its name.<br/><br/>After the time it takes for two incense sticks to burn, Zhou Xue finished her explanation.<br/><br/>She noticed a change in Fang Wang’s gaze.<br/><br/>Fang Wang also noticed her look. He immediately closed his eyes, pretending to contemplate deeply, when in fact he was trying to calm his emotions. “This Divine Skill is not trivial. If you can master it, it will make killing enemies much easier. Once it reaches Great Completion, and you ascend with me to become an Immortal, capturing a piece of the heavens and earth will not be out of the question,” Zhou Xue said softly, laughing. Unfortunately, Fang Wang did not respond to her.<br/><br/>She was not in a hurry and continued to observe Fang Wang carefully.<br/><br/>The more Fang Wang studied, the more she admired him, and in her heart, Fang Wang’s image gradually overlapped with those chosen by destiny in her previous life.<br/><br/>“I’m really looking forward to your future, not knowing what it would be like for you to compete with those chosen by destiny and peerless prodigies,” she thought.<br/><br/>Zhou Xue thought to herself.<br/><br/>Fang Wang, with his eyes closed, felt despondent, without a hint of excitement.<br/><br/>Even though he had five hundred years of experience in practicing the spirit-confining technique, it still took him two hundred and eighty years to cultivate the Sky Capturing Palm.<br/><br/>Practicing the spirit-confining art was truly tedious; the Sky Capturing Palm had no specific moves, and for these two hundred and eighty years, he was constantly meditating.<br/><br/>After a long time.<br/><br/>Fang Wang opened his eyes and exhaled, saying, “Worthy of being a minor Divine Skill, quite remarkable indeed.”<br/><br/>Zhou Xue asked, “How many years do you think you need to reach Great Completion?”<br/><br/>“I hope to achieve it in less than a hundred years,” Fang Wang hesitated to say.<br/><br/>He tried hard to appear the same as he did two hundred and eighty years ago; he even forced a smile.<br/><br/>Zhou Xue thought he was finding it difficult, which was why his expression seemed so unnatural, and so she consoled him, “You have many years of cultivation ahead, no need to hurry. Just allocate some time for practice later<br/><br/>“<br/><br/>Fang Wang nodded.<br/><br/>Then Zhou Xue continued to talk about Heaven’s Larceny Saint Sect, and Fang Wang listened attentively. Listening to her stories seemed to improve his mood.<br/><br/>The next day at noon, Fang Wang sought out Zhao Chuanqian and announced his plans to leave for a while.<br/><br/>Zhao Chuanqian wasn’t worried about him and agreed immediately.<br/><br/>Following that, Fang Wang left with Xiao Zi; he didn’t even say goodbye to Zhou Xue, Fang Hanyu, and others.<br/><br/>He used the Sword Control Technique to fly; wherever he passed, disciples from the three teachings cast admiring glances at him.<br/><br/>The great battle of yesterday would surely become legendary in the Grand Qi Cultivation Realm, and Fang Wang, silent for many years, would once again become the talk of the town among the cultivators under the heavens of Grand<br/><br/>He sped all the way.<br/><br/>After distancing himself from the battlefield, Fang Wang raised his arms and let out a long howl.<br/><br/>Thrilling!<br/><br/>He had held it in all night!<br/><br/>It had truly been unbearable!<br/><br/>Xiao Zi, tucked away in his arms, also poked its head out and made a noise—not the sound of a snake, but a woman’s shrill scream.<br/><br/>To be honest, it was quite affected, evidently forcing the voice through strained vocal cords.<br/><br/>“Master, where shall we go next?” Xiao Zi asked excitedly, eager to venture everywhere instead of being cooped up in one place to cultivate.<br/><br/>Fang Wang replied, “First, we’ll find a place to cultivate for a few days. Once my spiritual power is restored, we’ll go in search of the Heavenly Gang Saint Body Technique, and enjoy the sights along the way.”<br/><br/>“The Heavenly Gang Saint Body Technique? Master intends to gather all Three Great True Cultivations?”<br/><br/>Xiao Zi exclaimed admiringly, very much playing along.<br/><br/>Fang Wang rubbed its snakehead and said no more.<br/><br/>Having flown hundreds of miles, Fang Wang landed in a forest and meditated beside a creek. This creek meandered through the entire forest and flowed into rivers.<br/><br/>With tall and straight trees, sunlight filtering through, creating visible beams of light, and mist moving gently among the trees, one could occasionally see deer darting by.<br/><br/>Fang Wang cultivated and gathered Qi.<br/><br/>In the days to follow, no one disturbed him, nor was it likely that anyone would come to assassinate him at this stage—he was strong enough.<br/><br/>Days later, Fang Wang’s spiritual power was abundant.<br/><br/>He gathered the Reincarnation Bell, which now held two Primordial Spirits that had dissipated like smoke, as Fang Wang had no intention of questioning them, he allowed the Primordial Spirits of Lu Yuanjun and the white-haired man to be destroyed.<br/><br/>He then took out Lu Yuanjun’s black gourd.<br/><br/>The Ghost Instrument had absorbed millions of souls, exuding a chilling ghostly Qi. Even sealed by him, ghost Qi still leaked out, and a force surged within, as if it wanted to break free.<br/><br/>Fang Wang took out the Reincarnation Bell, ready to suppress this Ghost Instrument.<br/><br/>He placed the black gourd in front of him and then undid the seal.<br/><br/>In an instant, ghost Qi poured out of the gourd’s mouth, quickly forming a human figure.<br/><br/>It was Zhao Zhen!<br/><br/>Upon seeing Fang Wang, Zhao Zhen immediately raised his hand and said,<br/><br/>“Fang Wang, I won’t resist. Keep calm, don’t do anything rash!”<br/><br/>Fang Wang watched him with interest. He hadn’t expected him to become the Artifact Spirit of a Ghost Instrument refined by Lu Yuanjun.<br/><br/>Seeing that Fang Wang had no intention of attacking, Zhao Zhen gave a wry smile and said, “I am already an Artifact Spirit, with no chance of transcendence or rebirth. I am no longer even a human soul, so there’s no need for you to destroy me. Since I’m already dead and my worldly karma should be settled, why not keep my ghost body and let it serve you in the future?”<br/><br/>“I’ve completely merged with the Soul Devouring Gourd and can control its power to help you refine its restrictions.”<br/><br/>Fang Wang spoke calmly, “I am not interested in Ghost Instruments, nor do I wish to foster ghosts.”<br/><br/>As he spoke, he slowly raised his right hand.<br/><br/>Zhao Zhen, panicked, immediately knelt before Fang Wang and began kowtowing desperately, with none of the dignity of an emperor..\t\t\t\t\t\t</div>", "images": {}, "success": true}