{"id": 103, "url": "https://www.novelhall.com/i-became-an-immortal-on-mortal-realm-32879/14293722.html", "title": "Chapter 103 - Chapter 103: Chapter 100: A Sword Cleaves The Heavens, Utterly Defenseless", "volume": 2, "volume_title": "Volume 2", "body": "<h1>Chapter 103 - Chapter 103: Chapter 100: A Sword Cleaves The Heavens, Utterly Defenseless</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 103: Chapter 100: A Sword Cleaves the Heavens, Utterly Defenseless<br/><br/>Translator: 549690339<br/><br/>As the news of Fang Wang’s arrival began to spread, he stood against the wind, his gaze locked on the distant blood-red pillar of energy, where he could see the terrifying figure within.<br/><br/>“What on earth is that?”<br/><br/>Fang Wang wondered in amazement. The blood-red pillar of energy made him uneasy; if it contained Lu Yuanjun’s Ghost Instrument, it was outrageously powerful.<br/><br/>One by one, Demonic Cultivators from Chi Devil Sect charged at him, trying to halt him, but before he could make a move, Xiao Zi opened its snake mouth and spewed out vast Sword Qi, forcefully scattering the Demonic Cultivators’ Spells and forcing them to dodge in panic.<br/><br/>As Fang Wang entered the battlefield, more and more Great Cultivators took note of his presence.<br/><br/>Including the people around the altar.<br/><br/>Xu Qiuming watched the figures of Fang Wang and Xiao Zi, his mouth curving upward. He turned to look at the white-haired man and said, “I hope you won’t beg for mercy later.”<br/><br/>The white-haired man raised his eyebrows slightly, intrigued by Xu Qiuming’s interest; the newcomer must be formidable.<br/><br/>The man in purple standing on the Black Python’s head had been staring at Fang Wang this whole time, the greed in his eyes intensifying, seemingly lost in thought.<br/><br/>Fang Hanyu, who was engaged in battle, looked up just in time to see Xiao Zi’s massive figure passing overhead, and a smile crossed his face.<br/><br/>“You’re finally here.”<br/><br/>Fang Hanyu muttered to himself, his speed suddenly increasing.<br/><br/>Seeing Fang Wang arrive bolstered his confidence, and he decided not to hold back any longer, knowing that once Fang Wang defeated the leading figures of the Chi Devil Sect, the great battle would end.<br/><br/>Miles away.<br/><br/>Fang Zigeng held an ancient jade in his hand, leaping and dodging attacks from all directions; at this moment, he could only care for himself.<br/><br/>Just then, corpses began raining from the sky, and Fang Zigeng, having just steadied himself, instinctively looked up to see Xiao Zits massive body and Fang Wang’s figure from behind.<br/><br/>Fang Wang raised his left hand, and the domineering Fang Tian Painted Halberd tore through the sky, returning to his hand.<br/><br/>Fang Zigeng blinked, taking a deep breath once he was sure he had seen right.<br/><br/>Looking at Fang Wang’s retreating figure, Fang Zigeng felt envious. Even amidst the tumult, in a battlefield like hell itself, Fang Wang’s presence brought infinite hope, his figure so reliable.<br/><br/>“When will I be able to possess such grace…”<br/><br/>Fang Zigeng sighed to himself, then turned around to support other Tai Yuan Sect Disciples.<br/><br/>As he fought his way forward with only his Great Halberd in hand, Fang Wang’s gaze never left the blood-red pillar of energy.<br/><br/>Xiao Zi kept firing Sword Qi, shooting down countless members of the demonic sect. The deeper they went, the fewer Demonic Cultivators dared to attack them.<br/><br/>Very soon.<br/><br/>Fang Wang was less than three miles away from the mountain of corpses around the altar, his attention drawn to the white-haired man standing in front of Xu Qiuming.<br/><br/>This man is strong!<br/><br/>That was the first impression the white-haired man gave Fang Wang.<br/><br/>The white-haired man soared into the air, flying a hundred yards high, with a wooden sword in hand. He advanced towards Fang Wang, stepping through the air, a powerful Sword Intent erupting from within him that disturbed heaven and earth, causing Cultivators within a hundred miles to turn their heads to look.<br/><br/>On the ground, Zhao Chuanqian, barely hanging onto life, struggled to lift his head. He opened his eyes to see the white-haired man moving toward the horizon, where a serpent demon was slowly growing larger, and it seemed there was a figure upon its snake head.<br/><br/>A few breaths later, Zhao Chuanqian finally made out that figure.<br/><br/>It was him…<br/><br/>A smile appeared on Zhao Chuanqian’s face.<br/><br/>How strong was Fang Wang, who had broken through to the Condensation Spirit Realm?<br/><br/>He was looking forward to it, confident as well.<br/><br/>Xiao Zi had already slowed down, eyeing the white-haired man as if facing a formidable enemy.<br/><br/>The Heavenly Palace Halberd in Fang Wang’s hand slowly disappeared. He reached for the storage bag at his waist and pretended to pull out a sword hilt. As he swung his right hand to the side, white light blades burst forth from the sword guard.<br/><br/>The Rainbow Sword!<br/><br/>The white-haired man’s eyes shifted when he saw the Rainbow Sword; his Sword Intent surged, and visible Sword Qi formed around him like a flash flood, breaking through the clouds above in a spectacle.<br/><br/>Behind Fang Wang, swords shadows appeared, quickly reaching the number of thirty-six.<br/><br/>Jinghong Divine Sword Art, thirty-six swords!<br/><br/>Swordsmen need not speak much; one glance was enough for the two men to know that only one would leave alive.<br/><br/>With the emergence of the Jinghong thirty-six swords, Fang Wang’s momentum far surpassed the Condensation Spirit Realm, reaching a level that even the man in purple found disconcerting.<br/><br/>Chen Anshi furrowed his brows, his gaze at Fang Wang filled with wariness and envy.<br/><br/>This kid’s growth is just too exaggerated!<br/><br/>“Fortunately, I called upon a Great Cultivator from Heaven’s Larceny Saint Sect in advance, otherwise, he really might have been able to turn the tide by himself.” Chen Anshi thought. his look instinctivelv searching for Lu Yuaniun.<br/><br/>only to find he had long since disappeared.<br/><br/>In the murky heavens and earth, thousands of eyes were fixed on Fang Wang and the white-haired man.<br/><br/>The fighting continued, but whether it was the Three Righteous Paths or the Chi Devil Sect, all had heard of Fang Wang’s renown and knew his performance would determine the outcome of the battle.<br/><br/>Fang Wang was the most dazzling, dominant figure of the last century!<br/><br/>Searching back a thousand years, it would be hard to find anyone who could match Fang Wang!<br/><br/>And then!<br/><br/>The white-haired man made the first move. His eyes focused, his sword shadows turned into a tempest that swept towards Fang Wang. A flurry of Sword Qi and sword shadows burst from within him, covering the space in front of him with afterimages, as if a scroll painted with Sword Qi was unfolding.<br/><br/>Unfolding towards Fang Wang!<br/><br/>Fang Wang raised the Rainbow Sword in his hand, pointing at the white-haired man, and with a twist of his right hand, the thirty-six Jinghong swords suddenly burst forth!<br/><br/>Thirty-six swords streaked past him, quickly merging into one, forming a massive Sword Qi.<br/><br/>Xiao Zi trembled all over, feeling as cold as if she were in an ice cellar.<br/><br/>Boom—<br/><br/>Two powerful Sword Intents collided, engaging in a fight too fast for the naked eye, and the deafening booming noise drew the heads of countless cultivators to turn and look.<br/><br/>Following their gaze, next to the crimson column of energy appeared two torrential Sword Intents, stretching across the sky like a curtain, and as the massive Sword Qi advanced, they could faintly see the figures of Fang Wang and the white-haired man, their afterimages, as though there were hundreds of clones clashing with swords in battle.<br/><br/>Shocking, vast!<br/><br/>The immense Sword Qi from the Jinghong thirty-six swords was unstoppable, forcefully tearing through the white-haired man’s sword energy scroll, and with it, his sword-swinging afterimages were rapidly extinguished.<br/><br/>The white-haired man’s pupils suddenly dilated, and he immediately vanished into the distance, the next second appearing beside Xu Qiuming, sliding backwards half a foot, revealing just how anxious he had been.<br/><br/>With his retreat, his Sword Intent dissolved instantly, and the Jinghong Sword Qi passed through, slicing even the thunderclouds in the sky open, with sunlight spilling down. The gusting wind left in the wake of the Sword Qi hadn’t yet dispersed, revealing a cold light within as if filled with countless fragments of sword blades.<br/><br/>This streak of Sword Qi rainbow crisscrossed with the crimson pillar, as if dividing heaven and earth into four regions.<br/><br/>The scene left both the righteous and demonic paths dumbfounded and their hearts pounding.<br/><br/>Did Fang Wang’s single sword strike really possess such might?<br/><br/>Greedy Sleeper, while manipulating the Golden Mirror in his hand, couldn’t help but exclaim, “This kid… Even the Sword Saint of yesteryear probably didn’t have such ability, right?”<br/><br/>No one answered him.<br/><br/>With just one strike, Fang Wang brought quiet to the entire battlefield, for the sword strike was simply too domineering!<br/><br/>From a distance, Fang Wang appeared to have split the sky in two, something they had never seen in their lifetime—a sword Qi so powerful.<br/><br/>The cultivators of both the righteous and demonic paths who were engaged in battle hastened to distance themselves, then all turned to look towards the center of the battlefield.<br/><br/>Fang Wang stood atop Xiao Zi’s head, slightly tilting his chin up, pointing his sword at the white-haired man with a lofty gaze, and said softly, “Is this the extent of your Swordsmanship?”<br/><br/>With the power of Celestial Sword Intent, his voice thundered like the roaring heavens across the battlefield, resounding for a long time.<br/><br/>He wasn’t simply showing off; this act bolstered the morale of the Three Righteous Paths and intimidated the Demonic Dao, reducing casualties.<br/><br/>The white-haired man furrowed his brows tightly, his hand holding the wooden sword trembling slightly.<br/><br/>Xu Qiuming, not far to the side, couldn’t help laughing heartily, utterly delighted.<br/><br/>Without another word, the white-haired man leapt up, sword in hand, charging towards Fang Wang.<br/><br/>Fang Wang’s expression changed, and he too jumped, soaring like a giant roc; his presence dramatically shifted.<br/><br/>True Combat Technique!<br/><br/>In an instant, Fang Wang’s mind was overwhelmed by a fighting spirit, and his speed surged as he dived toward the white-haired man.<br/><br/>The two collided in mid-air, swiftly wielding their swords. The blades moved so quickly that they created dazzling afterimages, with Sword Qi spilling onto all sides, compelling even Xu Qiuming to avoid them.<br/><br/>Their movements were so fast that they fought purely with swordsmanship, their Sword Intents clashing, and Sword Qi flying!<br/><br/>Their battle was so rapid that the sword light sent shivers down one’s spine, making it impossible to discern their moves.<br/><br/>Boom!<br/><br/>The two hit the ground, kicking up billowing dust; Fang Wang thrust forward with his sword while the white-haired man raised his own to block, his eyes filled with terror.<br/><br/>“Such a fast sword… such a domineering Sword Intent… how could there be such a Sword Cultivator in this place?” the white-haired man thought fearfully. He had exerted all his strength, yet every one of Fang Wang’s strikes was cunning, aiming for the weak points of his swordplay, making it difficult for him to defend, and now he was already stained with multiple wounds—though their speed was so fast that onlookers had yet to notice he was injured.<br/><br/>In less than four breaths’ time since their exchange began, the white-haired man had already sustained more than twenty sword wounds!<br/><br/>Engaging in close combat with Fang Wang, who possessed the Combat Heart, was his biggest mistake!<br/><br/>Of course, in terms of competing with Sword Qi, he had already lost!<br/><br/>In an extremely short period, their swords had clashed over five hundred times, and the white-haired man realized he was no match for Fang Wang, with the thought of retreat emerging in his mind.<br/><br/>But would Fang Wang, activated by the True Combat Technique, allow him to retreat?<br/><br/>Just as the white-haired man attempted to dodge away, Fang Wang reversed his grip on the sword, stepping in front of him with a single stride—for a moment, their eyes met, and the look in Fang Wang’s eyes made his heart tremble.<br/><br/>Such cold eyes!<br/><br/>The white-haired man, who had practiced swordplay for five hundred years, was facing such a gaze for the first time.<br/><br/>Thud!<br/><br/>The white-haired man was sent flying by Fang Wang’s strike, blood spraying, and before he even hit the ground, Fang Wang closed in for another attack.<br/><br/>At this point, the white-haired man completely lost the ability to parry, his moves became disorderly, and with each blocked sword strike, he was left with two new wounds.<br/><br/>This scene, witnessed by many cultivators, was entirely one-sided.<br/><br/>This mysterious white-haired man was no match for Fang Wang, utterly powerless to fight back!<br/><br/>Yet many of them had seen how the white-haired man had previously defeated Xu Qiuming.<br/><br/>Back then, Xu Qiuming was just like the white-haired man now, equally powerless to resist…<br/><br/>Xu Qiuming, while dodging the Sword Qi and watching the battle, felt exhilarated. At that moment, he felt a complex emotion towards Fang Wang..\t\t\t\t\t\t</div>", "images": {}, "success": true}