{"id": 102, "url": "https://www.novelhall.com/i-became-an-immortal-on-mortal-realm-32879/14293349.html", "title": "Chapter 102 - Chapter 102: Chapter 99: Time For A Massacre! [Third Release, Seeking Monthly Votes]", "volume": 2, "volume_title": "Volume 2", "body": "<h1>Chapter 102 - Chapter 102: Chapter 99: Time For A Massacre! [Third Release, Seeking Monthly Votes]</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 102: Chapter 99: Time for a Massacre! [Third Release, Seeking Monthly Votes]<br/><br/>Translator: 549690339<br/><br/>“Xiao Zi, speed up. Don’t make me the last hero to appear,” Fang Wang urged. His eyes were fixed ahead, where roiling clouds foreshadowed an impending storm.<br/><br/>Upon hearing this, Xiao Zi immediately accelerated.<br/><br/>Being a Demon King, Xiao Zi’s full-speed flight was incredibly fast.<br/><br/>Through his senior disciple token, Fang Wang could calculate the distance to their destination. Judging by Xiao Zi’s speed, it shouldn’t take too long.<br/><br/>The fact that Great Abyss Gate had to send so many disciples for reinforcements indicated the immense scale of the battle. Considering the involvement of the Tian Shu Sect, the Suspended Vast Sword Sect, and the Chi Devil Sect, it was certain to far surpass the battle at Green Cicada Valley. Therefore, Fang Wang hadn’t rushed ahead; he needed to conserve as much spiritual power as possible.<br/><br/>Fang Wang’s gaze deepened, his eyes seeming to traverse mountains and rivers to witness the battlefield where forces of good and evil clashed.<br/><br/>Boom!<br/><br/>A massive fireball fell from the sky, sending Fang Zigeng flying. He tumbled several times upon landing before swiftly getting up. Wiping the blood from his face, he looked up to see a figure emerge from the sea of flames.<br/><br/>“Didn’t expect you to be so resilient,” said an average-looking Chi Devil Sect cultivator, his gaze upon Fang Zigeng filled with murderous intent.<br/><br/>Fang Zigeng, not yet at the Spirit Elixir Realm, knew he was no match for his opponent. Glancing around, he saw disciples from the three major sects all under siege, the situation dire.<br/><br/>In the blink of an eye, Fang Zigeng drew an ancient jade from his storage bag. Biting his finger, he smeared his blood upon it. In an instant, the jade burst into dazzling light, startling the demonic cultivator into attacking, unwilling to take any chances.<br/><br/>Meanwhile.<br/><br/>Gu Li, Fang Hanyu, Ye Xiang, Zhou Xing Shi, Li Yu, and other Tai Yuan Sect disciples who had crossed paths with Fang Wang were also in fierce battles. Each of them bore injuries, and none was in an optimistic state.<br/><br/>“Hang in there, reinforcements are on the way!” Li Yu bellowed before ducking to avoid an incoming dart, then raised his sword to unleash an upward slash of sword qi, driving back an airborne demonic cultivator.<br/><br/>From the eastern horizon, hundreds of Tai Yuan Sect disciples approached on swords, led by Greedy Sleeper. Holding aloft a large flag, he generated a visible surge of force that covered all the disciples, greatly accelerating their flight as if they were a mighty sword thrusting into the battlefield.<br/><br/>“Attack!” Greedy Sleeper commanded. The Tai Yuan Sect disciples behind him gestured rapidly, casting spells, bombarding demonic cultivators en route, with Greedy Sleeper’s target being a distant altar.<br/><br/>The Tai Yuan Gate wasn’t the only group with reinforcements arriving; the Tian Shu Sect and the Suspended Vast Sword Sect’s reinforcements were steadily approaching, but many were being blocked by the Chi Devil Sect’s cultivators.<br/><br/>The Chi Devil Sect had now deployed over thirty thousand demonic cultivators, none of whom were in the Qi Cultivation Realm, and their numbers were still growing.<br/><br/>In the center of the battlefield, a blood-colored pillar on the altar was continuously absorbing the flesh of bodies, the piles of corpses around it shaking. One body after another was swept into the blood-colored pillar by fierce winds, resembling a bloody tornado.<br/><br/>On a desolate patch of land to the east, Xu Qiuming was half-kneeling, his blood-soaked hair clumping together. He gasped for air, the sword shadows behind him growing faint, threatening to dissipate any moment.<br/><br/>The white-haired man stood ten paces away, expressionless. “If this is the extent of your abilities, then bow your head. You’ll come to see this as an opportunity,” he said.<br/><br/>With great effort, Xu Qiuming rose to his feet.<br/><br/>Plop!<br/><br/>A sound came from the side. Xu Qiuming glanced over and his pupils suddenly narrowed. An elderly figure drenched in blood lay on the ground, limbs obviously broken, in a state of extreme misery.<br/><br/>“Elder…”<br/><br/>Xu Qiuming then looked up to see a giant Black Python coiling in the sky, its red spots resembling eyes, creating a chilling effect in the dim world.<br/><br/>“Who in the world are they…” he thought, feeling despair for the first time.<br/><br/>The white-haired man had shown near invincible strength, and the man in purple standing on the Python’s head was clearly even stronger.<br/><br/>These two were definitely from beyond Grand Qi!<br/><br/>“Since he refuses to submit to you, why not give us his soul?” The voice of Chen Anshi came, as he flew in carrying an unconscious Zhao Chuanqian.<br/><br/>The white-haired man glanced at him but said nothing.<br/><br/>Above them, the man in purple stood atop the Python, his gaze locked onto the blood pillar.<br/><br/>Upon closer inspection, the blood pillar seemed to roar with flames, bridging heaven and earth, and within it, a vast, curled figure could faintly be seen, as though a great demon was about to emerge.<br/><br/>“What a pity, the cultivators here are too weak,” the man in purple muttered, his voice tinged with regret.<br/><br/>Suddenly, as if sensing something, he sharply turned to look into the distance, squinting as he gazed toward the end of the earth and sky.<br/><br/>Following his gaze, a hundred miles away, a purple snake was rapidly approaching.<br/><br/>Fang Wang surveyed the expansive battlefield below, where throughout the endless wasteland, figures of cultivators clashed in combat. He let out a sigh of relief.<br/><br/>He had made it in time!<br/><br/>Fang Wang did not wish to arrive just at the last moment when the situation was about to collapse, which would mean that many had already been sacrificed.<br/><br/>Seeing so many sect brothers still fiercely fighting indicated that it wasn’t the time for true despair yet.<br/><br/>Raising his right hand, Fang Wang summoned the Heavenly Palace Halberd, his eyes swiftly locating the figures of Tai Yuan Sect disciples.<br/><br/>“Time for a massacre!” Fang Wang declared. Xiao Zi sped up, causing his white robes to flutter more violently in the wind.<br/><br/>He noticed that ahead there were dozens of demonic cultivators besieging twelve Tai Yuan Sect disciples, who struggled valiantly, sustaining new injuries continuously.<br/><br/>Suddenly, Fang Wang hurled the Heavenly Palace Halberd.<br/><br/>The Great Perfection’s Sword Control Technique!<br/><br/>The Heavenly Palace Halberd flew at a terrifying speed, and the demonic cultivators, sensing something, instinctively turned their heads to look.<br/><br/>Spurt!<br/><br/>The chest of a demonic cultivator was directly pierced by the Heavenly Palace Halberd, blood spraying as his body split into two halves!<br/><br/>The next demonic cultivator didn’t even have the time to see the Heavenly Palace Halberd clearly before he followed his comrade’s fate, forcibly bisected at the waist.<br/><br/>Too fast!<br/><br/>The demonic cultivators were being slaughtered in succession, only a few who had reached the fifth layer of the Spirit Elixir Realm managed to see clearly, they were so frightened that they immediately leapt up to dodge, but their speed was no match for the Heavenly Palace Halberd.<br/><br/>A Spirit Elixir Realm demonic cultivator held his Lifespirit Treasure, a bronze mirror that erupted with intense light, forming a solid shield to protect his flesh.<br/><br/>With a bang!<br/><br/>The Spirit Elixir Realm cultivator, along with the mirror, was directly obliterated into a blood mist by the Heavenly Palace Halberd.<br/><br/>Dominant!<br/><br/>Ruthless!<br/><br/>The eyes of the twelve Tai Yuan Sect disciples were glued to the scene as they instinctively looked in the direction from which the Heavenly Palace Halberd had come.<br/><br/>“It’s Fang Wang! Big senior brother has come!”<br/><br/>One of the disciples shouted with ecstasy, and the others were exhilarated, recognizing Fang Wang’s identity.<br/><br/>Xiao Zi swiftly passed over their heads. Fang Wang raised his right hand, and the Heavenly Palace Halberd flew back into his grasp, as mutilated bodies fell from the sky, raining blood onto the earth, a sight that left the twelve Tai Yuan Sect disciples with their eyes wide open<br/><br/>Were the dozens of powerful demonic cultivators who brought them to despair just effortlessly dealt with by Fang Wang?<br/><br/>With the appearance of the Heavenly Palace Halberd, in less than five breaths of time, all the surrounding demonic cultivators were dead, some of whom were killed while trying to escape.<br/><br/>The gap in cultivation was too vast. the demonic cultivators stood no chance of<br/><br/>resisting!<br/><br/>Fang Wang gripped the Heavenly Palace Halberd, pointing towards the distant bloody pillar of energy, and spoke, “Fly in that direction.”<br/><br/>Xiao Zi immediately accelerated, the massive serpent moving as if a Purple Dragon soaring through the skies.<br/><br/>Their arrival quickly drew the attention of the Chi Devil Sect’s demonic cultivators, and immediately a Profound Heart Realm demonic cultivator charged at them. She wielded a long ribbon, whipping it out as Spiritual Power transformed into white lightning along the ribbon, which rapidly spread out. Hundreds of bolts of lightning, like a net, converged on Fang Wang.<br/><br/>Fang Wang didn’t even glance at her. He loosened his grip and the Heavenly Palace Halberd, moving at a speed invisible to the naked eye, struck, the resulting gust making Fang Wang’s white robes flutter violently.<br/><br/>The Heavenly Palace Halberd became a streak of cold light, powerfully tearing through the incoming lightning.<br/><br/>The female demonic cultivator’s eyes widened in shock, her hands instinctively casting a spell, but the Heavenly Palace Halberd was simply too fast!<br/><br/>Boom!<br/><br/>The blood mist exploded, and the Heavenly Palace Halberd soared upwards, tracing a perfect arc in the sky before returning to Fang Wang’s hand.<br/><br/>“Young master, killing Profound Heart Realm cultivators is now as easy as slaughtering chickens or dogs! It’s too easy!”<br/><br/>Xiao Zi exclaimed enthusiastically, her tone full of admiration, which made the corners of Fang Wang’s mouth turn up.<br/><br/>Beyond the sheer oppressive force of his cultivation, he was utilizing the Great Perfection’s Sword Control Technique!<br/><br/>Back in his Profound Heart Realm days, had he gone all out, he could have instantly killed those in the Condensation Spirit Realm. Now that he had reached the Condensation Spirit Realm, facing those in the Profound Heart Realm, it was naturally a guaranteed one-shot kill!<br/><br/>Xiao Zi’s massive body, together with Fang Wang’s exaggerated combat performance, attracted more and more attention.<br/><br/>“It’s Fang Wang, the senior brother!”<br/><br/>“The Celestial Sword Saint has arrived!”<br/><br/>“Hahaha, I knew the Sect Leader would send the big senior brother over. The<br/><br/>Chi Devil Sect is done for!”<br/><br/>“What, that person is Tai Yuan Sect’s Fang Wang?”<br/><br/>“That’s right, it’s him. He didn’t even draw his sword, he has the power to reverse the Qiankun!”<br/><br/>The Tai Yuan Sect disciples shouted excitedly, letting the nearby disciples from the Tian Shu Sect and the Suspended Vast Sword Sect learn of Fang Wang’s identity.<br/><br/>The disciples from the other two paths, upon learning of Fang Wang’s arrival, were also invigorated. Even if they did not belong to the same sect, they looked up to Fang Wang with admiration and reverence, as he represented the strongest talent of the young generation within the Grand Qi Cultivation Realm.<br/><br/>Xiao Zi sped ahead, boosting the morale of the warriors from the Three Righteous Paths wherever she passed.<br/><br/>Fang Wang hadn’t expected his reputation to reach such an extent. It was one thing for the Tai Yuan Sect disciples to be excited, but to see the disciples of the Tian Shu Sect and the Suspended Vast Sword Sect equally enthusiastic, as if injected with a dose of adrenaline, made him inwardly marvel at his own impressiveness.<br/><br/>Gu Li, Li Yu, and others, who were in the midst of battle, sensed something and glanced over. When they saw Fang Wang atop Xiao Zi, they all showed expressions of pleasant surprise.<br/><br/>Fang Wang also caught sight of Gu Li, Li Yu, and the others ahead. His gaze sharpened as out of nowhere, shadows of swords appeared around the third pulse disciples. These were formed by the Celestial Sword Intent and immediately struck towards the demonic cultivators in every direction.<br/><br/>Spurt! Spurt! Spurt…<br/><br/>Flesh and blood flew everywhere!<br/><br/>The demonic cultivators surrounding Gu Li and the others were continuously pierced by the Celestial Sword Intent, unable to escape in time!<br/><br/>As Xiao Zi flew over the heads of Gu Li and the others, Gu Li caught a glimpse of Fang Wang winking at her but before she could react, Fang Wang had already moved on with Xiao Zi towards the center of the battlefield.<br/><br/>“Hahaha, with senior brother Fang Wang here, there’s going to be a good show!”<br/><br/>Zhou Bo said with excitement. Due to the extreme emotion, his internal injuries were aggravated, blood gushing from his mouth, yet he still wore a smile on his face..\t\t\t\t\t\t</div>", "images": {}, "success": true}