{"id": 109, "url": "https://www.novelhall.com/i-became-an-immortal-on-mortal-realm-32879/14294783.html", "title": "Chapter 109 - Chapter 109: Chapter 106: Zhui Tian Waterfall, Renowned Throughout Grand Wei", "volume": 2, "volume_title": "Volume 2", "body": "<h1>Chapter 109 - Chapter 109: Chapter 106: Zhui Tian Waterfall, Renowned Throughout Grand Wei</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 109: Chapter 106: Zhui Tian Waterfall, Renowned Throughout Grand Wei<br/><br/>Translator: 549690339<br/><br/>Grand Wei is located to the west of Grand Qi, and the Great Saint’s Grotto-Heaven is situated between the two dynasties.<br/><br/>After leaving Grand Qi, Fang Wang began flying on his sword, not wanting to attract too much attention with Xiao Zi. For this reason, Fang Wang also changed into black clothes and donned a bamboo hat, completely altering his usual style.<br/><br/>Xiao Zi lay on his shoulder, carrying a black gourd, which matched his look quite well.<br/><br/>Although Zhao Zhen did not show up, he could still see the outside world through the gourd.<br/><br/>“Young master, would you like to take another turn around the Great Saint’s Grotto-Heaven?” Xiao Zi asked with a smile.<br/><br/>Fang Wang looked straight ahead and said, “Don’t forget the presence of the<br/><br/>Artifact Spirit.”<br/><br/>The Great Saint’s Grotto-Heaven had an Artifact Spirit, and Fang Wang couldn’t forget the sensation of being teleported out. Although his cultivation was low at the time, the Artifact Spirit could immobilize him, which was a testament to its strength.<br/><br/>For over ten thousand years, great cultivators likely came to visit, but the Great Saint’s Grotto-Heaven still stood, further proving the strength of the Artifact Spirit.<br/><br/>On the journey, the verdant mountains and clear waters were gradually replaced by desolate hills and wilderness. Looking around, desolation stretched as far as the eye could see.<br/><br/>Human tracks were occasionally visible, but they were almost all bandits. Fugitives from both dynasties loved to flee here, though the area was also teeming with demonic beasts.<br/><br/>Fang Wang occasionally sensed Demonic Qi, the strongest of which had reached the Great Demon Realm, equivalent to the Spirit Elixir Realm.<br/><br/>He did not linger and quickly flew toward Grand Wei.<br/><br/>The closer he got to Grand Wei, the more cultivators Fang Wang encountered, most of whom were in a hurry. They simply exchanged glances and did not dare to approach each other.<br/><br/>Fang Wang wasn’t afraid, as the Grand Wei Cultivation World couldn’t possibly be much stronger than the Grand Qi Cultivation Realm. With his strength, he might not be able to sweep through Grand Wei, but if he wanted to flee, no one could stop him.<br/><br/>In the blink of an eye.<br/><br/>Two days passed.<br/><br/>Guided by Zhao Zhen and the map, Fang Wang finally arrived at his destination.<br/><br/>Standing atop a mountain peak, he looked out at the horizon where mountains stood in rows. At the end of the horizon, there was a plateau and a massive waterfall plunging from the mountain top, hundreds of feet high with an imposing roar. It created a spectacular mist at the forest’s end.<br/><br/>“This was Fang Wang’s first time seeing such a spectacular waterfall; ne could hear its thunderous sound even from over ten miles away.<br/><br/>Zhao Zhen emerged and said, “This must be the number one wonder of Grand Wei, the Zhui Tian Waterfall. Above it lies Wei River, Grand Wei’s foremost river. It’s said that thousands of years ago, the Zhui Tian Waterfall didn’t exist, and it was an extraordinary force that raised half of Grand Wei’s territory by hundreds of feet.”<br/><br/>It was also his first time seeing the Zhui Tian Waterfall, and he found it breathtaking.<br/><br/>What is the force of heaven?<br/><br/>This is it!<br/><br/>Xiao Zi then asked, “Where is the inheritance?”<br/><br/>Fang Wang picked up the map and carefully compared it. The map indeed showed Wei River, and the inheritance was at the river’s turning point. Could this bend be the Zhui Tian Waterfall?<br/><br/>“Let’s go take a look first. There’s a town in front of the Zhui Tian Waterfall where we can also gather some information,” Fang Wang said softly, and then he resumed his sword flying.<br/><br/>Sword flying was the most basic form of flight and was less ostentatious.<br/><br/>Zhao Zhen retreated back into the Soul Devouring Gourd, afraid of being seen.<br/><br/>Half an hour later.<br/><br/>In an inn, Fang Wang sat at the edge of a second-story window, across from a waiter who was enthusiastically telling him about the grand event of the Zhui Tian Waterfall.<br/><br/>“The Zhui Tian Secret Realm opens once every twenty years. With two more years until the next opening, sir, you should be able to feel the abundant spiritual energy here. You could completely go to Zhui Tian City above the Zhui Tian Waterfall and cultivate for two years. Although the city has not been established for even a century, the city lord has the Condensation Spirit Realm cultivation, which is one of the top in the Grand Wei Cultivation World.<br/><br/>Cultivating there, even if your enemies pursue you, you need not worry.” The waiter continued unabatedly, very enthusiastically.<br/><br/>Fang Wang looked out the window at the magnificent Zhui Tian Waterfall in the distance, convinced that the transmission of the Heavenly Gang Saint Body Technique was hidden inside the Zhui Tian Waterfall.<br/><br/>“Speaking of the lord of Zhui Tian City, it was he who discovered the Zhui Tian Secret Realm. At that time, he was tempering his body beneath the waterfall and unintentionally entered it. He described the inside as if it were another world. He was only able to explore for a month before being expelled.<br/><br/>Afterwards, he moved his family here, established Zhui Tian City, and after a hundred years, deduced the opening patterns of the Zhui Tian Secret Realm.”<br/><br/>“As the Secret Realm opened time and again, it made numerous great cultivators. The fame of Zhui Tian Secret Realm eventually spread. At that time, great cultivators and geniuses from various sects and families in Grand Wei will come. Each entry could result in a legendary strong person’s emergence, and it’s unsure who will become famous in the next two years,” he said, his face showing longing.<br/><br/>He too wished to compete but was hampered by his own mediocrity.<br/><br/>“By the way, this Zhui Tian Secret Realm may attract cultivators from other dynasties as well. I wonder if Fist Saint Fang Wang from Grand Qi will come. Tsk tsk, Grand Qi actually gave birth to a Heaven Yuan Spirit Treasure, truly unbelievable. Sir, what do you think? Is that Heaven Yuan Spirit Treasure really as formidable as they say? I heard that Fang Wang, under fifty years old, can already slay those in Condensation Spirit Realm with his sword,” the waiter suddenly switched the conversation to Fang Wang.<br/><br/>Xiao Zi poked her head out from Fang Wang’s embrace, startling the waiter, but he did not turn away. Cultivation folk liked to keep a variety of strange things; he was already accustomed to it—it was just that Xiao Zi’s appearance was too sudden.<br/><br/>Fang Wang casually answered, “How would I know that? How could you and I even fathom the Heaven Yuan Spirit Treasure?”<br/><br/>He was secretly thrilled.<br/><br/>His fame had actually spread so far.<br/><br/>After chatting with the waiter a bit more, Fang Wang paid with a Spirit Stone and sent him off.<br/><br/>He didn’t linger, and after drinking his beverage, he got up and left, ready to head for Zhui Tian City.<br/><br/>Zhui Tian City was located above the Zhui Tian Waterfall, and he wanted to see if there was a good place for cultivation. If so, he would stay and wait there for two years.<br/><br/>Fang Wang continued flying on his sword, ascending alongside the Zhui Tian Waterfall and using his divine sense to probe the interior of the waterfall.<br/><br/>Indeed, there were powerful prohibitions inside, giving him a feeling similar to facing the Great Saint’s Grotto-Heaven.<br/><br/>It seems that the Zhui Tian Secret Realm might also be left behind by the Ji Hao Sect, hence it contains the Heavenly Gang Saint Body Technique.<br/><br/>As Fang Wang thought this, he leaped over the top of the waterfall and immediately saw a huge city located at the edge of a cliff, spanning both banks of the Wei River, with pavilions densely packed and high towers like peaks. Countless cultivators were coming in and out. Various kinds of demon birds were circling in the sky, and there were even people boating on the river. This was more splendid than Haixia City, which he had visited, and he felt as if he had ascended to the heavens.<br/><br/>It wasn’t clear whether the Grand Wei Cultivation World was catching up to the Grand Qi Cultivation Realm, or if Fang Wang had just visited too few places.<br/><br/>He immediately flew toward the city and then strolled around inside.<br/><br/>An hour later.<br/><br/>Fang Wang was walking up a spiral staircase; the windowsill next to him had no windows, just open portals through which he could look directly down at the entire city. He was inside a cultivation tower right now.<br/><br/>It turned out that each of the high towers in Zhui Tian City was a place for cultivation, with temporary cave dwellings inside, and different levels of spiritual energy. Fang Wang had the storage ring of the white-haired man, and he had already broken the restrictions it contained. There were countless spirit stones and spiritual energy pills inside, more than enough for him to be extravagant.<br/><br/>Fang Wang was being led by someone, who was bringing him to the highest floor to enjoy the highest grade cave dwelling in the city.<br/><br/>All the way to the top layer of the tower, there were three cave dwellings. The guide stopped in front of the innermost one, took out a jade token, pressed it on a slot next to the door, and the cave dwelling’s door opened. The guide then handed the jade token to Fang Wang with respect.<br/><br/>“If the guest has any needs, you can contact me with the jade token,” the guide said humbly, giving Fang Wang the feeling of staying in a modern hotel in a previous life.<br/><br/>Of course, not even a hotel might offer such attentive service.<br/><br/>Fang Wang took the jade token and then walked into the cave dwelling, shutting the door behind him.<br/><br/>The cave dwelling was lavishly decorated, with a bed, tables and chairs, and even meditation cushions. There was even a hot pool emitting steam. It was very spacious and eye-catching.<br/><br/>Xiao Zi immediately popped out, threw the Soul Devouring Gourd onto the ground, and then dived into the pool for a bath.<br/><br/>Zhao Zhen floated out of the gourd, sighed, and said, “I didn’t expect the Grand Wei Cultivation World to have come this far. Luckily, we in Grand Qi are preparing to transform into a Cultivation Dynasty.”<br/><br/>Fang Wang, on the other hand, wasn’t as sentimental. He stretched lazily and said, “First, I’ll cultivate for a year. Once I break through a minor realm, I’ll take you out for a walk.”<br/><br/>Xiao Zi and Zhao Zhen naturally did not dare to object.<br/><br/>In his heart, Zhao Zhen was curious. Why cultivate for an entire year?<br/><br/>After reaching the Condensation Spirit Realm, what could be achieved in a year of cultivation?<br/><br/>A year swiftly passed by.<br/><br/>Inside the cave dwelling, Fang Wang broke through to the second layer of the Condensation Spirit Realm. His aura surged, making the tables and chairs tremble, while Zhao Zhen was astonished.<br/><br/>This was the Condensation Spirit Realm.<br/><br/>Just after breaking through to the Condensation Spirit Realm, using only one year to advance another minor realm?<br/><br/>At this rate, even if it becomes harder to advance, Fang Wang could surpass the Condensation Spirit Realm in less than twenty years…<br/><br/>Fang Wang did not notice Zhao Zhen’s expression; he was focused on consolidating his cultivation.<br/><br/>A few days later, he took out the sect’s chief disciple token, intending to check if his family members were well.<br/><br/>As his divine consciousness probed inside, he discovered over a dozen points of light nearby, which meant that more than ten disciples had come to Zhui Tian City.<br/><br/>Six months ago, the sect leader had contacted him through the chief disciple token. Knowing he was safe, he shouldn’t have sent anyone to find him. Could it be that news of the Zhui Tian Secret Realm had already spread within the Grand Qi Cultivation Realm?<br/><br/>Fang Wang began to check the identities of these disciples to see if he knew any of them.<br/><br/>Only the name Ye Xiang seemed familiar. With a moment of thought, Fang Wang remembered that they had entered the Great Saint’s Grotto-Heaven together. Speaking of which, Ye Xiang still owed him a life-saving favor.<br/><br/>Since he wasn’t familiar with the rest, Fang Wang couldn’t be bothered to look for them. However, should they encounter trouble, he would be willing to lend a hand.<br/><br/>Fang Wang stood up and said, “Let’s go out for a walk and see more of Grand<br/><br/>Wei’s local customs and culture.”<br/><br/>Xiao Zi immediately leaped in front of the Soul Devouring Gourd, slung it over her shoulder, and forcibly sucked Zhao Zhen back inside.<br/><br/>Fang Wang put on a bamboo hat and, after a quick tidy-up, walked out of the cave dwelling.<br/><br/>He had already paid for two years’ worth of spirit stones in advance, so leaving temporarily wouldn’t result in someone else taking his place.<br/><br/>After leaving the cave dwelling, Fang Wang had just closed the door when he saw the door next to his open. A man in green clothes came out, wearing white underneath, not extremely handsome, but his eyebrows emitted a sharpness that made him look difficult to provoke.<br/><br/>The man in green noticed Fang Wang and immediately said, “Brother, you seem unfamiliar. My name is Hu PO Xie, may I ask for your name?”<br/><br/>Fang Wang replied, “My name is Fang Wang.”<br/><br/>“Hm? Fang Wang?”<br/><br/>Hu PO Xie seemed to recognize the reputation. He couldn’t help asking, “Are you the Fang Wang from the Great Abyss Gate of the Grand Qi Cultivation Realm?”<br/><br/>Fang Wang asked with a smile, “Do you think I would be?”<br/><br/>Hu PO Xie couldn’t suppress a chuckle, saying, “Well, that person is a Heaven Yuan Spirit Treasure and has just slaughtered a sect. He wouldn’t have time to come here.”<br/><br/>Slaughtered a sect?<br/><br/>The Chi Devil sect?<br/><br/>How had this news spread?<br/><br/>Fang Wang inwardly complained. Rumors are like blades, killing without spilling blood..\t\t\t\t\t\t</div>", "images": {}, "success": true}