{"id": 100, "url": "https://www.novelhall.com/i-became-an-immortal-on-mortal-realm-32879/14290545.html", "title": "Chapter 100 - Chapter 100: Chapter 97: The Fourth Lifespirit Treasure!", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 100 - Chapter 100: Chapter 97: The Fourth Lifespirit Treasure!</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 100: Chapter 97: The Fourth Lifespirit Treasure!<br/><br/>Translator: 549690339<br/><br/>From the Great Abyss Gate to Sword Heaven Marsh, under Xiao Zi’s full speed, it only took half a day.<br/><br/>Song Jinyuan and the Sword Servants were still at Sword Heaven Marsh. Aside from them, there were also some Cultivators who had come to visit, all desiring to gaze upon the place where Sword Saint Fang Wang had once comprehended the sword. If possible, they also wished to seek his guidance on the chance that they might encounter him. After all, the news of Fang Wang imparting Celestial Sword Intent to others had spread, adding the grand aura of a grandmaster to his already prestigious name.<br/><br/>Fang Wang landed at the head of the bridge where he had previously engaged in Spiritual Refinement and commanded Song Jinyuan who was behind him, “I’m preparing to comprehend the sword, don’t let others disturb me.”<br/><br/>Song Jinyuan nodded his head, immediately summoned the other Sword Servants to disperse, and gave orders to prevent anyone from approaching within a five-mile radius.<br/><br/>He had many things he wanted to say to Fang Wang, but seeing Fang Wang seemed to be in a hurry, he could only suppress his emotions.<br/><br/>After so many years, he was extremely curious about Fang Wang’s current Cultivation level.<br/><br/>Back then, when he learned that Fang Wang had single-handedly slain his way through Green Cicada Valley, he was extremely surprised. The Sword Saint had once praised the Myriad Poison Array of Green Cicada Valley, calling it the second strongest Formation in the Grand Qi Cultivation Realm. The more people who set up the Formation, the stronger its power would be. With tens of thousands of people, it could even cut down those in the Condensation Spirit Realm.<br/><br/>Years ago, Fang Wang had already slashed through the Myriad Poison Array set up by ten thousand people. Wouldn’t he now be able to sweep through the Condensation Spirit Realm?<br/><br/>There was also that mysterious Black Dragon Art that made Song Jinyuan inwardly uncomfortable.<br/><br/>Why does this junior brother not use the peerless techniques of our master!<br/><br/>How could it be that the grand Sword Saint doesn’t use a sword to slay his enemies!<br/><br/>It’s preposterous!<br/><br/>Of course, in that battle, Fang Wang’s choice to not use his sword actually made him appear even stronger. It gave the impression that he had breezed through Green Cicada Valley without even unsheathing his sword.<br/><br/>It was precisely because of Fang Wang that even though the Great Abyss Gate had suffered a Demonic Dao attack, losing twenty thousand Disciples, the various major sects still dared not look down upon the Great Abyss Gate. Their attitude towards the Great Abyss Gate had even improved compared to before.<br/><br/>Fang Wang was unaware of what Song Jinyuan was thinking. He sat down at the head of the bridge and began to sense the aura of the Heavenly Dao Spirit Stone under the lake.<br/><br/>This time, it was even smoother than before. In less than five days, Fang Wang found the sense of Spiritual Refinement.<br/><br/>One should know that the Spiritual Refinement Formation established here by the Sword Saint was aimed at Earth Origin Spirit Treasures and even higher rank treasures, which is why sensing it took far longer than common Heavenly Dao Spirit Stones.<br/><br/>Spiritual Energy began surging towards the top of his head, even causing ripples on the lake’s surface.<br/><br/>Fang Wang then opened his eyes, condensing the Celestial Sword Intent. In an instant, myriad sword shadows appeared on the lake’s surface, forming a large circle that enclosed both him and the building behind him. Sword Qi burst forth in a dense and vast dome that soared into the sky, shaking the clouds.<br/><br/>Shrouded by the Celestial Sword Intent, Song Jinyuan and the Sword Servants could no longer see what he was doing.<br/><br/>With a Primordial Spirit, Fang Wang’s attention could be divided. Multi-tasking wasn’t difficult for him, especially since this was the fourth time he was engaging in Spiritual Refinement. It was all very familiar to him.<br/><br/>For his fourth Lifespirit Treasure, he wanted a sealing type!<br/><br/>Moreover, the sealing should take place during combat, depriving the enemy of their ability to move, and even sealing their Primordial Spirit, leaving them waiting for him to kill!<br/><br/>The conception was domineering, but whether it could be realized would depend on his ability to actually create it!<br/><br/>With the Golden Scale White Feather Robe in his possession, he decided to postpone creating a defensive type Lifespirit Treasure. When the Golden Scale White Feather Robe could no longer keep up with his pace, he would create a defensive treasure.<br/><br/>Lifespirit Treasures and Magic Artifacts served similar functions, but Lifespirit Treasures were special in that a Cultivator could use them more naturally and they were difficult to seize. If an enemy tried to steal them, one only needed to will it, and the Lifespirit Treasure would dissipate—an aspect that Magic Artifacts couldn’t match.<br/><br/>With so many Lifespirit Treasures at his disposal, Fang Wang didn’t need to fight over so-called supreme treasures.<br/><br/>Every day in the Cultivation World, Cultivators would die fighting over Magic Artifacts because the vast majority could only own one Lifespirit Treasure, and they found it very difficult to break through a major realm. Therefore, collecting Magic Artifacts had become essential for them.<br/><br/>Fang Wang began internal viewing, with his consciousness within the Treasured Spirit Space.<br/><br/>He continuously infused his own conceptions into it.<br/><br/>Sealing could also be seen as a form of control. It couldn’t be that he had to touch the target to initiate sealing; that would be too limiting.<br/><br/>Fang Wang always remembered Zhou Xue’s displayed Lifespirit Treasure, that wooden zither which, with a single pluck, left the opponent utterly disoriented.<br/><br/>He didn’t like zithers, though. While it was indeed elegant for a man to play the zither, he preferred to tread a more domineering path.<br/><br/>A bell!<br/><br/>A large bell tolling, ringing to claim souls, causing instant bewilderment, even to the point of scattering one’s spirit!<br/><br/>Besides the bell’s sound, it also needed to be sturdy, ideally with some defensive effects. He could incorporate his own Body-protecting Divine Barrier into it.<br/><br/>Furthermore, the bell could also cover people. If it could trap someone, it would ensure the enemy could not escape even if they had wings.<br/><br/>With such a high grade of Lifespirit Treasure, naturally, its effects couldn’t be too simplistic.<br/><br/>The speed at which the Spiritual Energy surged towards the top of his head became faster and faster. Strands of Solaris True Fire began to emerge, his own Spiritual Power, shaping the body of the Lifespirit Treasure.<br/><br/>Meanwhile, the Cultivators at Sword Heaven Marsh, upon seeing the Sword Qi dome formed by the Celestial Sword Intent, were all stirred with excitement.<br/><br/>“Has the Sword Saint returned?”<br/><br/>“With such Sword Qi and such vast Sword Intent, it can only be Fang Wang!” “I just knew it, Fang Wang wouldn’t forget about Sword Heaven Marsh.”<br/><br/>“Nonsense, after years of construction by the previous Sword Saint, the Spiritual Energy of Sword Heaven Marsh is now second to none compared to the great sects’ cave abodes, and everyvvhere here is imbued with the Sword Saint’s Sword Intent.”<br/><br/>“Stop the chatter and pay attention; encountering such Sword Intent is also an opportunity, ”<br/><br/>More and more Sword Cultivators flew to the mountaintops surrounding Sword Heaven Marsh, facing the Sword Qi canopy above and immersed in careful perception.<br/><br/>In the forest.<br/><br/>The morning sunlight filtered through the leaves, illuminating the forest interior, where the disciples of Great Abyss Gate sat in silent meditation.<br/><br/>A cultivator swiftly made his way from the depths of the forest, wearing the robes of Great Abyss Gate, and quickly approached Zhao Chuanqian, whispering to him.<br/><br/>After he had spoken, Zhao Chuanqian stood up, surveyed all the disciples, and announced, “Everyone, prepare to take action.”<br/><br/>Upon hearing this, all the disciples stood up, each mentally ready.<br/><br/>Geniuses like Ye Xiang and Fang Hanyu showed an eager look, itching to make a name for themselves. Although they knew they couldn’t compare to Fang Wang, they still wanted to carve out their own renown.<br/><br/>Ever since Fang Wang burst onto the scene, whenever the Cultivation World mentioned Great Abyss Gate, they thought of Fang Wang, casting the other disciples in his shadow.<br/><br/>If this had been fifty years earlier, the Earth Origin Spirit Treasure would have drawn the entire Grand Qi Cultivation Realm’s attention; now it seemed to be just so-so.<br/><br/>Zhao Chuanqian turned and walked in a certain direction, the disciples quickly following behind. The elders at the edge of the group managed the Formation, moving alongside them.<br/><br/>Elsewhere.<br/><br/>To the east, three hundred li away, the cultivators from Suspended Vast Sword Sect were also preparing to move out. Their numbers exceeded two hundred and included all elite members.<br/><br/>Xu Qiuming and Xu Tian Jiao moved through the group. After many years, Xu Qiuming appeared even more spirited, with a sword shadow floating behind his head, following him like a shadow, resembling a Sword Spirit.<br/><br/>“Brother, do you think Great Abyss Gate will send Fang Wang?” Xu Tian Jiao asked curiously, her face filled with anticipation.<br/><br/>Xu Qiuming glanced at her and calmly said, “Didn’t you say that Fang Wang has a special relationship with that girl named Gu Li? Why are you still so concerned about him?”<br/><br/>Xu Tian Jiao covered her mouth and laughed, “I only admire him, and besides, the Cultivation World doesn’t enforce monogamy. Even if they become Dao companions, they might still part ways. In the face of immortality, no one can accompany another forever. It’s best to live in the moment.”<br/><br/>Xu Qiuming rolled his eyes, no longer wishing to continue the conversation.<br/><br/>Xu Tian Jiao nudged Xu Qiuming with her elbow and gave him a forward look, whispering, “Do you think Lv Changge is sincerely helping us, or could it be that he might… ”<br/><br/>Xu Qiuming looked ahead and said, “He just so happens to have a grudge against Chi Devil Sect. He previously challenged Chi Devil Sect and won, but he was besieged by them and nearly died. Moreover, I sense he truly means to join Suspended Vast Sword Sect. Once there’s nobody in the sect who can rival him, he’ll leave again; he’s a Sword Maniac.”<br/><br/>“A Sword Maniac? Is there anyone in the world more obsessed with swords than you?” Xu Tian Jiao said, batting her eyelashes.<br/><br/>Xu Qiuming gave no response.<br/><br/>Just then, a male cultivator approached, smiling, “Junior Brother Xu, Gu<br/><br/>Jianxin of Tian Shu Sect is also here. Make sure he doesn’t steal the limelight.”<br/><br/>Upon hearing this, Xu Qiuming’s eyebrows twitched slightly, saying, “How could he bear to leave his retreat? Could it be because of Fang Wang?”<br/><br/>The male cultivator said with a smile, “Of course, given the opportunity, Great<br/><br/>Abyss Gate will definitely send Fang Wang. Gu Jianxin was the top talent of the Grand Qi Cultivation Realm in his youth. A good friend of mine in Tian Shu Sect told me that Gu Jianxin has long declared his desire to contend with Fang<br/><br/>Wang.”<br/><br/>Xu Qiuming’s gaze turned profound, saying, “Could it be that he’s broken through his own fate?”<br/><br/>The male cultivator shrugged, answering, ‘Who knows?”<br/><br/>Combat intent flickered in Xu Qiuming’s eyes, and the sword shadow behind him began to shimmer with cold light.<br/><br/>“Once this matter is settled, I must take care of him. In the past, he bullied my brother using his seniority. Now my brother has grown, and we’ll make sure he pays for it!” Xu Tian Jiao said through clenched teeth, her hatred for Gu Jianxin causing her teeth to itch.<br/><br/>Xu Qiuming didn’t reply, but his Sword Intent had already been released, causing the male cultivator to step away as the nearby Suspended Vast Sword<br/><br/>Sect cultivators turned to look at him.<br/><br/>At the bridge of Sword Heaven Marsh.<br/><br/>Xiao Zi retreated far away, looking at the large bell above Fang Wang’s head, feeling dizzy, unable to tell whether the world was spinning around her or if she was losing her senses.<br/><br/>As the bell became more solid and occasionally emitted a ring, although not loud, shielded by the Celestial Sword Intent, Xiao Zi still suffered within the array.<br/><br/>Fang Wang’s bell had now taken tangible form: an ancient gold-colored large bell, with three Qilin heads at the top, facing outward. Below, intricate patterns spiraled down the bell, with three Golden Dragons on each side, their bodies entwined with the bell, and heads held high, exhibiting the majestic aura of True Dragons.<br/><br/>The base of the bell bore wave patterns, while nine bright suns were engraved above, emanating an ancient and grand aura that exuded a mythological charm!<br/><br/>Fang Wang slowly opened his eyes and looked up; his Lifespirit Treasure was nearly completed.<br/><br/>He could feel its power; after all, this Spiritual Refinement took him five hundred and twenty years to prepare for, and it would certainly be mightier than the Rainbow Sword or the Qiankun Fan.<br/><br/>As for the Heavenly Palace Halberd, that was less certain.<br/><br/>Fang Wang always felt that the Heavenly Palace Halberd concealed an even greater power, waiting for him to unearth, since it was a treasure created by the Heavenly Palace itself.<br/><br/>“Let’s call it the Reincarnation Bell,”<br/><br/>Fang Wang murmured to himself, naming the bell.<br/><br/>In creating this bell, he had also infused some understanding of the Yin Yang Xuan Ming Zhen Gong, imparting to it the forces of yin and yang, giving it abilities beyond sealing and soul control—it could also rebound sealings and take control..\t\t\t\t\t\t</div>", "images": {}, "success": true}