{"id": 106, "url": "https://www.novelhall.com/i-became-an-immortal-on-mortal-realm-32879/14294125.html", "title": "Chapter 106 - Chapter 106: Chapter 103: The Greatest In The World, The Demon Monarch Appears", "volume": 2, "volume_title": "Volume 2", "body": "<h1>Chapter 106 - Chapter 106: Chapter 103: The Greatest In The World, The Demon Monarch Appears</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 106: Chapter 103: The Greatest in the World, the Demon Monarch Appears<br/><br/>Translator: 549690339<br/><br/>Fang Wang didn’t know what the man in purple was thinking, and he didn’t fear the mysterious Heaven’s Larceny Saint Sect, for his intent was to kill the man in purple.<br/><br/>To show mercy to a formidable enemy out of fear is not an exchange for a chance at life, but a descent into an abyss from which there is no return!<br/><br/>Clasping the Heavenly Palace Halberd in his hand, he summoned all his Spiritual Power. At that moment, he simultaneously activated the Solaris<br/><br/>Scripture, the True Combat Technique, and the Yin Yang Xuan Ming Zhen Gong, reaching the pinnacle of his might, pressuring the man in purple as he tore through the overwhelming ghostly fog, charging hundreds of steps straight forward.<br/><br/>The halberd blade was less than eight centimeters from the man in purple’s chest, and his right hand was sandwiched in between.<br/><br/>The man in purple’s eyes burst open, filled with bloodshot veins, he struggled with all his might, but could barely defend against the onslaught.<br/><br/>Numerous ferocious spirits charged at Fang Wang one after another, but as soon as they neared, they were incinerated by the Solaris True Fire, their souls scattering to the winds.<br/><br/>Just at that moment!<br/><br/>The ghostly fog next to them suddenly burst open, a huge mouth lunged at Fang Wang—it was that immense Black Python.<br/><br/>In the blink of an eye, Fang Wang executed the Nine Dragons Divine Transformation Art again, transforming into a Black Dragon. The giant python bit onto the Black Dragon’s head, its sharp fangs instantly shattered, blood sprayed everywhere, and with a mournful howl, it quickly retreated back into the ghostly fog.<br/><br/>Facing the Black Dragon, the man in purple’s right arm broke instantly, his chest caved in, and blood spurted uncontrollably from his mouth.<br/><br/>Boom!<br/><br/>The Black Dragon burst out of the ghostly fog that blocked the sun, causing the Cultivators in that direction to shiver.<br/><br/>They looked closely and saw that when the Black Dragon came to a halt, it transformed into wisps of black mist and dissipated, revealing Fang Wang’s figure. His Golden Scale White Feather Robe was stained with blood, golden dragon qi swirled around him, plus the nine fireballs behind his head, he seemed like a Heavenly God in human form, extraordinary in bearing, so captivating that one glance was unforgettable.<br/><br/>Fang Wang, holding the Heavenly Palace Halberd, surveyed what lay before him.<br/><br/>In front of him, an extremely long trench had been carved into the ground, stretching a hundred yards to a massive rock. Beneath the shattered rock, the man in purple lay within the crevice, bloodied, his legs a mangled mess, a horrific sight.<br/><br/>The ghostly fog behind Fang Wang billowed violently as the enormous Black<br/><br/>Python emerged from it. It was covered with wounds, and countless sword qis fell upon it like torrential rain. Xiao Zi then emerged, spitting out the sword qi.<br/><br/>Even with two massive demons battling behind him, Fang Wang did not look back.<br/><br/>He loosened his left hand, and the Rainbow Sword shot out fiercely, like a streak of white light, and in the blink of an eye, it pinned itself to the forehead of the man in purple, causing blood to burst from the rock behind his head.<br/><br/>Dead!<br/><br/>Fang Wang was relentless, knowing well that if that white-haired man could escape with his Primordial Spirit, so could the man in purple.<br/><br/>He quickly advanced to the corpse of the man in purple, lifted his left hand to summon the Reincarnation Bell, preparing to cover the body of the man in purple.<br/><br/>Suddenly!<br/><br/>The body of the man in purple exploded, startling Fang Wang, who used the Body-protecting Divine Barrier to defend against the flying blood and bone.<br/><br/>Staring intently, he couldn’t see the Primordial Spirit of the man in purple anywhere.<br/><br/>“Fang Wang of Great Abyss Gate, this hatred is inexorable; my Heaven’s Larceny Saint Sect shall surely trample the Grand Qi Cultivation World one day!”<br/><br/>The vindictive voice of the man in purple resonated, echoing between heaven and earth, chilling all who heard it.<br/><br/>Fang Wang looked sharply toward the ground, following it to the very edge of the world.<br/><br/>So fast!<br/><br/>This scoundrel’s Primordial Spirit actually fled through the earth!<br/><br/>Even Fang Wang could not catch up with such speed.<br/><br/>Fang Wang thought to himself, “I have indeed underestimated the powerhouses of this world.”<br/><br/>He admired the man in purple’s extraordinary means of escape but bore no regrets; he had done everything in his power to attempt to kill the man in purple.<br/><br/>Without a physical body, it would take the man in purple at least a hundred years to regain his peak strength. Moreover, he must find a body to possess within seven days, or his Primordial Spirit would be rejected by the forces of heaven and earth, becoming a vengeful spirit with no possibility of possession ever again.<br/><br/>This was what Fang Wang learned about possession from the Yin Yang Xuan Ming Zhen Gong.<br/><br/>As for that Heaven’s Larceny Saint Sect, that would be a matter for another day!<br/><br/>Fang Wang scanned the ground but found not a single storage bag or Storage Ring. That scoundrel was indeed ruthless, blowing up all his possessions.<br/><br/>Now, it was time to deal with the Chi Devil Sect!<br/><br/>Fang Wang took a deep breath, turned around, the Rainbow Sword flying to his waist before suddenly disappearing.<br/><br/>Under the twilight, mountains stretched endlessly.<br/><br/>In a mountain pass, a white light emerged from beneath the earth, landing in front of a rock, revealing the soul body of the man in purple.<br/><br/>Even as a soul, his face bore the look of exhaustion.<br/><br/>Just the thought of Fang Wang brought anger to his face, his eyes filled with murderous intent.<br/><br/>“Damn it… I never expected to take such a fall in this barbaric land…’<br/><br/>The man in purple showed a look of regret; he shouldn’t have heeded Chen Anshi’s words to personally lead the attack.<br/><br/>The Saint Spirit Soul Jade was important, but how could it be more important than his own life?<br/><br/>Despite his fierce words, what he considered now was whether he should return to the Heaven’s Larceny Saint Sect.<br/><br/>How could he explain himself after losing the Saint Spirit Soul Jade? The more he thought about it, the worse he felt, trying his best not to dwell on these thoughts.<br/><br/>The pressing matter was to find a suitable body for possession, with a cultivation base not too weak, or else he would have to start over for hundreds of years.<br/><br/>Just as he was about to make a move, he suddenly sensed something, turned around abruptly, and looked toward the mountaintop.<br/><br/>The setting sun just happened to fall on the mountaintop, where he saw a mysterious figure standing and looking down at him, causing him to tremble with fear.<br/><br/>Impossible!<br/><br/>Who could possibly follow his escaping technique?<br/><br/>“Who are you?” the man in purple asked in a grave voice, extremely nervous inside.<br/><br/>Using the escaping technique for an extended period had drained his Spiritual Power, leaving him with little fight left.<br/><br/>“Jin Xiao Sect, Demon Monarch.”<br/><br/>A cold female voice descended from the mountaintop, causing the man in purple to turn pale and flee immediately.<br/><br/>“As one of the seventy-two Monarch’s Envoys of Heaven’s Larceny Saint Sect,<br/><br/>Zuo Yu, did you ever think you would find yourself in such a sorry state?”<br/><br/>The voice of the Demon Monarch was like a death knell, pulling the man in purple into the abyss of despair.<br/><br/>Nightfall enveloped the land.<br/><br/>Fang Wang and the Tai Yuan Sect Disciples were sitting in meditation together, with Xiao Zi sprawled across his legs, dangling its snake head listlessly like a salted fish.<br/><br/>Although other disciples were meditating and healing, their gazes could not help but stray towards Fang Wang, filled with reverence and longing.<br/><br/>The Chi Devil Sect met with death and flight; in this battle, the righteous path claimed a resounding victory. The three major sects did not need to mobilize their full strength, just sending a part was enough to successfully annihilate the Chi Devil Sect – what a magnificent feat!<br/><br/>In this battle, Fang Wang’s contribution was immense!<br/><br/>All the participating cultivators from the three sects believed Fang Wang was now the foremost person in the Grand Qi Cultivation Realm.<br/><br/>Even Fang Hanyu, Gu Li, and Fang Zigeng couldn’t help but steal glances at<br/><br/>Fang Wang. He didn’t just win; he displayed a domineering presence. Surveying all his enemies, none could match him. He decimated them with overwhelming force, igniting wild fantasies about the extent of his cultivation.<br/><br/>Just then, a figure descended from the sky.<br/><br/>It was Vice Sect Leader Chai Yi, landing within the Tai Yuan Sect campsite, her brows furrowing as she surveyed the area.<br/><br/>Upon her arrival, several elders who stayed behind immediately greeted her and reported the situation.<br/><br/>Not all the Tai Yuan Sect cultivators who participated in the battle were present; another group was scouring the battlefield outside, with their prime objective being the search for the Chi Devil Sect’s secret treasure.<br/><br/>After listening for a while, Chai Yi could not resist turning her gaze toward Fang Wang, her eyes filled with surprise, seemingly astounded by his performance.<br/><br/>Fang Wang paid no attention to the gazes directed at him from all sides; he was focused on restoring his Spiritual Power.<br/><br/>After the battle, his Spiritual Power was left with less than one-tenth, mostly spent on fighting the man in purple and destroying the blood-colored pillar.<br/><br/>Fang Wang had gathered quite a few trophies from the fight, hence he didn’t join the cleanup of the battlefield. After all, he had to leave some spoils for the sect; otherwise, the battle would have been in vain.<br/><br/>Now, his thoughts had already drifted to the Heavenly Gang Saint Body Technique.<br/><br/>Once his Spiritual Power was restored, he had no plans to return to the Tai<br/><br/>Yuan Sect but intended to set out directly in search of the Heavenly Gang Saint Body Technique and assemble the Three Great True Cultivations as soon as possible to see what miracles might occur.<br/><br/>Time continued to pass.<br/><br/>Half an hour later, a voice reached Fang Wang’s ears: “Come here.”<br/><br/>Zhou xue!<br/><br/>Fang Wang immediately opened his eyes, turned his head, and saw Zhou Xue standing outside the east side of the campsite looking at him, still clad in her red attire.<br/><br/>Fang Wang put Xiao Zi on the ground and stood up alone to walk toward Zhou Xue.<br/><br/>As he stood up, everyone turned to look at him. Seeing him heading towards<br/><br/>Zhou Xue, most retracted their gazes. Zhou Xue was also a top genius of the Tai Yuan Sect, and all disciples were aware of her relationship with Fang Wang.<br/><br/>Gu Li’s eyes darkened slightly, and she closed her eyes to concentrate on Qi Gathering.<br/><br/>Fang Hanyu and Fang Zigeng, on the other hand, didn’t think much about it. Among the Fang Family Disciples, Fang Wang and Zhou Xue were the closest, and they had already set a marriage pact, so it was normal for them to talk privately.<br/><br/>Zhou Xue turned and walked towards the distance, and Fang Wang quickly followed.<br/><br/>After distancing themselves from the campsite, Zhou Xue still did not speak.<br/><br/>Fang Wang felt puzzled; why she didn’t ask about his performance?<br/><br/>It was one thing to boast in the presence of others but quite different to do so in front of Zhou Xue.<br/><br/>After the time it takes an incense stick to burn, Zhou Xue stopped and raised her right hand, revealing a compass, which then burst forth with a circle of visible Qi, spreading out.<br/><br/>This treasure is no small thing!<br/><br/>It must be an exquisite Magic Artifact!<br/><br/>Fang Wang judged the moment he saw the compass.<br/><br/>“Alright, now no one can eavesdrop on our conversation. Say whatever you want to say,” Zhou Xue said, looking at Fang Wang with a smile, her voice tinged with teasing.<br/><br/>Fang Wang arched an eyebrow and retorted, “Shouldn’t it be you to speak since you called for me?”<br/><br/>Zhou Xue stepped forward, coming within thirty centimeters of him, face-to-face at such a close distance that Fang Wang’s heart skipped a beat.<br/><br/>“I’ve seen you itching to show off all the way, haven’t I?” Zhou Xue asked softly, a hint of mockery in her smile.<br/><br/>Fang Wang feigned composure, responding calmly, ‘What’s there to show off about? When have I ever lost?”<br/><br/>“I didn’t say you had to show off anything. Why bring up winning and losing?”<br/><br/>“Ahem, let’s talk about Heaven’s Larceny Saint Sect. The Chi Devil Sect had two Great Cultivators from Heaven’s Larceny Saint Sect come to their aid, and I was ultimately not strong enough, letting one of them escape. He uttered vicious threats to massacre the Grand Qi Cultivation Realm.” At this, Fang Wang sighed.<br/><br/>Zhou Xue looked at him, her heart awash with feelings.<br/><br/>This guy can really nut on an act.<br/><br/>Zhou Xue spoke reassuringly, “Don’t worry, Heaven’s Larceny Saint Sect won’t come. ”<br/><br/>“Why not?”<br/><br/>“Heaven’s Larceny Saint Sect is to the north. They are located over a dozen kingdoms away from Grand Qi. By their timeline, they are currently busy with internal strife, and the one who escaped won’t be able to return; thus, the news won’t reach the inside of Heaven’s Larceny Saint Sect.”<br/><br/>“But he escaped.”<br/><br/>“Rest assured, he won’t get away. The Jin Xiao Sect will hunt him down.”<br/><br/>Seeing Zhou Xue so certain, Fang Wang was somewhat incredulous but didn’t argue.<br/><br/>What did it matter if he didn’t believe? He had no other choice.<br/><br/>Fang Wang asked curiously, “How powerful is Heaven’s Larceny Saint Sect? Have you encountered them in your past life?”\t\t\t\t\t\t</div>", "images": {}, "success": true}