{"id": 105, "url": "https://www.novelhall.com/i-became-an-immortal-on-mortal-realm-32879/14294124.html", "title": "Chapter 105 - Chapter 105: Chapter 102: Crumbling At A Blow, An Invincible Stance! [Third Update, Please Support With Monthly Votes]", "volume": 2, "volume_title": "Volume 2", "body": "<h1>Chapter 105 - Chapter 105: Chapter 102: Crumbling At A Blow, An Invincible Stance! [Third Update, Please Support With Monthly Votes]</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 105: Chapter 102: Crumbling at a Blow, an Invincible Stance! [Third update, please support with monthly votes]<br/><br/>Translator: 549690339<br/><br/>Hearing Fang Wang’s words, the man in purple laughed as he looked at him and said, “Junior, some things aren’t for you to see just because you want to.”<br/><br/>He raised his right hand, and a black pagoda condensed in his palm, swiftly enlarging to nine levels, each adorned with various statues on all four sides, lifelike and mesmerizing, making one feel entranced at a glance.<br/><br/>Lu Yuanjun likewise summoned a black gourd, and three ghostly gods emerged, his black robe fluttering in the air as if he were a fierce ghost himself, surrounding Fang Wang with the man in purple from front and back.<br/><br/>Just at that moment!<br/><br/>Strong presences approached from all directions, a few of which felt familiar to Fang Wang, probably belonging to several Peak Masters of the Great Abyss<br/><br/>Gate.<br/><br/>Reinforcements had arrived.<br/><br/>Just like in the stories, they always arrive belatedly.<br/><br/>But now it was Fang Wang’s home ground, and no one could overshadow his majesty!<br/><br/>Fang Wang slowly turned around, the Golden Scale White Feather Robe appeared on his body, and strands of golden dragon aura wrapped around him, with the sound of dragon chants rising and falling. The emergence of this treasure caused the man in purple’s eyes to flicker, and the Chi Devil Sect members’ faces to change dramatically.<br/><br/>This robe had the looks of something extraordinary!<br/><br/>At least a supreme Magic Artifact!<br/><br/>Fang Wang coldly looked toward Lu Yuanjun and said icily, “Let’s settle our karma, today, even if the king of heaven comes, you must die!” Upon hearing this, Lu Yuanjun’s heart skipped a beat. “He must have recognized your identity!”<br/><br/>Zhao Zhen’s voice rang in Lu Yuanjun’s ear, sounding frantic.<br/><br/>Upon hearing this, Lu Yuanjun immediately took off his mask, revealing his handsome face, and looking at Fang Wang, he took a deep breath and said, “I didn’t expect things would come to this between us.”<br/><br/>Before this, their meetings and conversations had always been with smiling faces, but now their eyes were full of murderous intent.<br/><br/>Fang Wang asked expressionlessly, “Really didn’t expect it?”<br/><br/>He took a step out, walking on air toward Lu Yuanjun, with the Reincarnation Bell floating behind him, closely following.<br/><br/>Lu Yuanjun activated the Yin Yang Xuan Ming Zhen Gong, and strands of black qi wrapped around his body, his aura rising continuously.<br/><br/>He had actually reached the Condensation Spirit Realm!<br/><br/>But the corners of his mouth started to bleed, clearly indicating internal injuries.<br/><br/>Just as Lu Yuanjun was about to reply, Fang Wang suddenly attacked him.<br/><br/>Boom—<br/><br/>An eerie boom came from behind Fang Wang, causing his figure to pause. In a flash, the Reincarnation Bell trembled, and an even louder bell sound emerged, covering the strange booms from behind and resounding through heaven and earth.<br/><br/>With the ringing of the bell, Fang Wang’s speed suddenly increased.<br/><br/>The man in purple behind him furrowed his brows, his eyes locked on the Reincarnation Bell, showing surprise in his gaze.<br/><br/>Seeing Fang Wang attack, Lu Yuanjun did not avoid it, and immediately swung his palm, a powerful surge of Spiritual Power attacking Fang Wang with the force of a collapsing mountain and tsunami.<br/><br/>Suddenly!<br/><br/>Qi Dragons condensed around Fang Wang, transforming into an ethereal long dragon, forcefully dispersing his Spiritual Power. Seeing this, Lu Yuanjun withdrew his palm and pushed out again, with strange runes emerging in the palm of his hand.<br/><br/>Fang Wang sheathed his sword with his right hand and struck with his left.<br/><br/>The two quickly collided, their palms meeting in mid-air.<br/><br/>Lu Yuanjun’s face revealed a wildly joyous smile, which then turned fierce. But in the next second, his expression became one of horror, even disbelief.<br/><br/>“Impossible… you…”<br/><br/>Lu Yuanjun exclaimed in shock, trying to withdraw his hand but finding that his right palm seemed to be welded to Fang Wang’s left palm, immovable.<br/><br/>The three ghostly gods behind him were wailing and holding their heads as if they had encountered their natural enemy, not daring to attack Fang Wang.<br/><br/>Yin Yang Xuan Ming Zhen Gong!<br/><br/>Fang Wang felt a strong force approaching from behind, and he forcefully pushed his left palm forward.<br/><br/>With a boom!<br/><br/>Lu Yuanjun’s physical body exploded into a mist of blood, and almost instantly, Fang Wang turned and thrust his sword, the Celestial Sword Intent suddenly bursting forth, forming a dazzling slash of Sword Qi.<br/><br/>A huge black claw, like a towering mountain, attacked Fang Wang, unstoppable.<br/><br/>The two forces of Spiritual Power collided, and the Celestial Sword Intent forcefully pierced through the black claw, yet the powerful gale still shook Fang Wang back. The attacker was the man in purple, who still had his left hand extended toward Fang Wang, his expression one of shock, clearly not expecting Fang Wang’s Celestial Sword Intent to be so powerful, far surpassing the Sword Qi he had displayed in the battle against the white-haired man.<br/><br/>As he retreated, Fang Wang raised his hand to summon Lu Yuanjun’s black gourd, quickly infused a few sealing techniques into it, and then threw it into his storage bag.<br/><br/>“How dare you!”<br/><br/>A hoarse bellow erupted, and Chen Anshi seemed to go mad as he charged at Fang Wang.<br/><br/>Fang Wang wondered to himself, what was Lu Yuanjun’s relationship to him that he would be so desperate?<br/><br/>He noticed a white light trying to escape and promptly captured it with the Reincarnation Bell.<br/><br/>After that, he let go of the Rainbow Sword, grasped the Reincarnation Bell, which vanished into thin air as if he had put it in his storage bag, all these movements performed swiftly, with Chen Anshi still not having reached him.<br/><br/>Watching Chen Anshi’s approach, Fang Wang’s right hand reached for his storage bag, and with a raise of his hand, the Heavenly Palace Halberd appeared in his grasp, and with his left hand, he reached under his right armpit and simultaneously seized the Rainbow Sword, wielding both Lifespirit Treasures with arms crossed.<br/><br/>One hand holding a long halberd, the other a white light sword!<br/><br/>The Golden Scale White Feather Robe rustled loudly, the fierce gales pulling his hair backward as his face displayed a scornful smile.<br/><br/>Xiao Zi and the Black Python soared into the sky together, like two angry Flood Dragons battling in the air, a sight so magnificent that many distant cultivators looked up in awe.<br/><br/>Chen Anshi swung his sword at Fang Wang, channeling extreme fury into the strike. Spiritual power transformed into sword qi, interwoven with thunder and fire like the wrath of heaven.<br/><br/>Fang Wang charged directly into the thunder and fire sword qi, and in an instant, transformed into a massive Black Dragon Head, brutally dispersing the fiery sword qi as he charged straight at Chen Anshi.<br/><br/>As Fang Wang moved forward, the Dragon Body extended, and with the True Dragon’s appearance, Xiao Zi and the Black Python suddenly seemed insignificant in comparison.<br/><br/>Chen Anshi’s face turned pale with shock, raising his sword to defend himself, but the moment it was hit by the Black Dragon, it shattered on impact.<br/><br/>The Lifespirit Treasure couldn’t withstand a single blow!<br/><br/>Chen Anshi even lost consciousness.<br/><br/>The Black Dragon pressed down on him as they rushed toward the blood-red pillar. The dragon’s roar shook heaven and earth; the Black Dragon had now extended a hundred Zhang long body with Dragon Scales all condensing, shimmering with a chilling gleam.<br/><br/>The Great Perfection’s Nine Dragons Divine Transformation Art!<br/><br/>Still supported by the power of the Heavenly Palace Halberd, at this moment, Fang Wang unleashed the Nine Dragons Divine Transformation Art with all his might, the devastatingly powerful Black Dragon forcing Chen Anshi’s body to burst open, his blood mist blooming before the Dragon Head and then scattered.<br/><br/>The man in purple’s face drastically changed, and he immediately threw the black tower in his hand out. The black tower flew quickly to the front of the blood-red pillar and grew rapidly, reaching two hundred Zhang in height, like a mountain peak blocking the Black Dragon’s path.<br/><br/>Fang Wang’s gaze sharpened as he activated the True Combat Technique!<br/><br/>The True Combat Technique, combined with the Nine Dragons Divine Transformation Art, caused the Black Dragon’s speed to surge, its body intertwined with purple lightning.<br/><br/>Boom!<br/><br/>The black tower was directly sent flying. The man in purple’s face changed dramatically; without time to think further, he placed himself in front of the blood-red pillar with his flesh body, pushing forward with both palms, erupting with spiritual power like an overwhelming flood against the Black Dragon.<br/><br/>Immediately after, the man in purple felt the power of the Black Dragon!<br/><br/>Not good!<br/><br/>Instinctively, the man in purple dodged to the side, his left arm unable to keep up with his body, cruelly torn off.<br/><br/>The arrogant Black Dragon smashed into the blood-red pillar, causing a shocking explosion that dispersed the pillar into a terrifying blood wind that swept across the area, scattering the surrounding corpse mountains and sending countless bodies flying into the sky. The violent wind swept hundreds of miles, breaking the entire battlefield, as numerous cultivators turned their heads, catching the stunning scene of the Black Dragon sweeping past the altar.<br/><br/>A dragon…<br/><br/>A True Dragon?<br/><br/>All the cultivators thought their eyes were deceiving them, even Xiao Zi and the Black Python came to a halt, shocked.<br/><br/>The Black Dragon whirled arrogantly across the sky above the altar, displaying its domineering body as the roar of the dragon echoed unceasingly.<br/><br/>After circling a few times, the Black Dragon plunged down, its body dissipating like smoke, revealing Fang Wang’s figure, holding a halberd in one hand and a sword in the other, like a celestial general descending from the heavens.<br/><br/>He landed on the altar, eyes fixed on another figure upon the altar.<br/><br/>It was the soul of an indeterminate gender, kneeling on the ground as if bound by invisible shackles, struggling fiercely. Even without any sound, one could feel its screaming, a grim and terrifying sight.<br/><br/>Fang Wang frowned, what was this thing?<br/><br/>“Nine Dragons Divine Transformation Art… you’ve actually cultivated the Nine Dragons Divine Transformation Art to such a level…”<br/><br/>A cold voice came, filled with barely concealed rage.<br/><br/>The man in purple, missing an arm, was seen advancing in mid-air from a distance, the black tower back in his right hand. The windows of the tower’s tiers were open, rolling Ghost Qi pouring out, covering the sky, and within the mist, terrifying evil specters took shape, all roaring towards Fang Wang. At a glance, it was impossible to count the number of ghosts.<br/><br/>“Destroying the Saint Treasure of my sect, obstructing the resurrection of the Saint Spirit… you must die… you must die!”<br/><br/>The man in purple’s face was incredibly ferocious, filled with anger, clenching his teeth, trembling all over.<br/><br/>He had never expected Fang Wang to conceal such power!<br/><br/>Most importantly, his plan nearly a century in the making was ruined; how would he explain to his sect once he returned?<br/><br/>At this moment, the soul on the altar suddenly dissipated, leaving behind a yellowed ancient jade on the ground.<br/><br/>Fang Wang was about to reach for it when the man in purple suddenly roared angrily, and an endless tide of evil specters charged like a vast army. The terrifying ghost fog immediately engulfed the entire altar.<br/><br/>The ghost fog was still spreading!<br/><br/>In less than the time it takes for three breaths, it covered an area of five miles. Corpses were devoured by the ghost fog, causing the cultivators of the Chi Devil Sect to retreat one after another.<br/><br/>Xu Qiuming carried the elder and retreated, Zhao Chuanqian was also fleeing, not daring to be consumed by the ghost fog.<br/><br/>Within that ghost fog, Fang Wang, now in the state of True Combat Technique, was fighting. Evil ghosts crazily attacked from all directions and were easily dispelled by him. The Solaris Scripture activated, and nine fireballs floated behind his head. Both the Heavenly Palace Halberd’s blade and the Rainbow Sword’s light shined with Solaris True Fire. Armed with both weapons, wherever he passed, the ghost fog dispersed, and not a single specter could harm him.<br/><br/>At this moment, Fang Wang displayed an unstoppable, invincible posture!<br/><br/>Suddenly, the man in purple burst out from the ghost fog. Fang Wang turned around and hurled his halberd.<br/><br/>The Heavenly Palace Halberd burst forth with immense momentum, rapidly forcing the purple-clothed man back.<br/><br/>The man in purple’s right palm was surrounded by black qi, using his spiritual power to resist the blade of the Heavenly Palace Halberd, but its power exceeded his expectations.<br/><br/>“How is this possible… How could someone in the Condensation Spirit Realm possess such strength… What rank is this halberd?”<br/><br/>The man in purple’s eyes bulged, inwardly roaring with fury. He could no longer maintain his composure as he saw Fang Wang bursting from the darkness, his right hand gripping the Heavenly Palace Halberd, intending to pierce through him..\t\t\t\t\t\t</div>", "images": {}, "success": true}