{"id": 101, "url": "https://www.novelhall.com/i-became-an-immortal-on-mortal-realm-32879/14293348.html", "title": "Chapter 101 - Chapter 101: Chapter 98: Fang Wang’S Sword Intent, The Sacrificial Battle", "volume": 2, "volume_title": "Volume 2", "body": "<h1>Chapter 101 - Chapter 101: Chapter 98: Fang Wang’S Sword Intent, The Sacrificial Battle</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 101: Chapter 98: Fang Wang’s Sword Intent, The Sacrificial Battle<br/><br/>Translator: 549690339<br/><br/>Once the name of the Reincarnation Bell was set, the large bell above Fang Wang’s head burst into powerful shock waves, and Xiao Zi immediately mobilized her demonic power to stabilize her figure.<br/><br/>The Celestial Sword Intent’s Sword Qi formation was shaken, but fortunately, this was just the fluctuation from the Spiritual Refinement process, not the full power of the Reincarnation Bell.<br/><br/>Fang Wang closed his eyes again, trying his best to prolong the Spiritual Refinement process and make the Reincarnation Bell stronger.<br/><br/>Half a day later.<br/><br/>The Celestial Sword Intent dissipated, and Song Jinyuan immediately came behind Fang Wang, seeing him standing at the bridgehead, stretching his limbs, appearing no different from when he arrived.<br/><br/>The Reincarnation Bell had already been taken into Fang Wang’s Treasured Spirit Space.<br/><br/>“Fang Wang, what is your current cultivation level?” Song Jinyuan asked.<br/><br/>Without turning his head, Fang Wang replied with a light laugh, “The First Layer of the Spirit Condensation Realm.”<br/><br/>As expected!<br/><br/>Although Song Jinyuan had anticipated it, his heart still trembled upon hearing Fang Wang personally confirm it.<br/><br/>Fang Wang turned around and said, “I have other matters to attend to. Before I go, do you have any requests?”<br/><br/>Song Jinyuan thought for a moment, then slightly shook his head.<br/><br/>Fang Wang smiled, then turned to face the lake, waved his right sleeve, and a stream of Sword Qi shot out. Flying at high speed over the vast lake, it struck the mountain on the opposite side.<br/><br/>Boom—<br/><br/>Dust flew up, and the mountain trembled violently.<br/><br/>Song Jinyuan looked on puzzled, not understanding what Fang Wang was doing.<br/><br/>As the dust settled, a ten-zhang-long crack appeared on the opposite mountain wall—a sword scar. Even from afar, one could feel the fierce aura emanating from the sword mark.<br/><br/>That is…<br/><br/>Song Jinyuan squinted his eyes, his mind shaking.<br/><br/>Fang Wang raised his hand to beckon Xiao Zi into his arms, leaped up, and turned into a streak of white light that shot towards the horizon.<br/><br/>Song Jinyuan kept his eyes fixed on the sword scar in the distant mountain. In his pupils, an image appeared, that of Fang Wang’s figure swiftly wielding his sword, his sword moves unpredictable and profound.<br/><br/>More and more Sword Servants and Sword Cultivators arrived, observing the sword scar.<br/><br/>Elsewhere.<br/><br/>Xiao Zi had grown larger, and Fang Wang stood on its head, holding the Direct Disciple Token in his hand, using his divine consciousness to search for the location of Fang Hanyu and the others.<br/><br/>Xiao Zi flew in the direction Fang Wang pointed.<br/><br/>Fang Wang noticed that this group of disciples was not as closely packed as before, and there were twenty or thirty fewer of them.<br/><br/>It seems a battle has already started!<br/><br/>Fang Wang’s eyes twinkled.<br/><br/>Chi Devil Sect, treasured artifacts, sacrifices…<br/><br/>He always felt this battle would involve Lu Yuanjun.<br/><br/>“Lu Yuanjun, I hope you’re really there,” Fang Wang thought to himself.<br/><br/>It was time to settle this karma.<br/><br/>How could Fang Wang be carefree without removing this thorn?<br/><br/>Rolling thunderclouds covered an area of hundreds of miles, dark clouds pressing down, and the world fell into oppression.<br/><br/>On the wasteland, a blood-colored pillar of Qi connected heaven and earth, below was a massive altar made of bluestone. Around it were countless corpses, human, demon, and beast alike, piled into mountains of bodies, dried blood lakes, a terrifying sight.<br/><br/>Looking in the distance, figures of cultivators battling could be seen in all directions.<br/><br/>The Chi Devil Sect had dispatched tens of thousands of cultivators, all clad in the uniform red robes of the sect, besieging the disciples of the Great Abyss Gate, the Tian Shu Sect, and the Suspended Vast Sword Sect at various locations.<br/><br/>The battlefield stretched over hundreds of miles, a devastating sight full of spell bombardments, heart-shaking to behold.<br/><br/>Fang Hanyu, disheveled, wielding twin swords in battle, fought alone against dozens of demonic cultivators. Various spells chased after him as he dodged swiftly, his figure ghostlike. The Absolute Heart Evil Eye carved out two bloody lines in the gloomy world.<br/><br/>Suddenly!<br/><br/>Fang Hanyu leaped up, his body covered in Spiritual Power, turning into a Qi Dragon soaring upwards, breaking through the formation. He then released the Nine Dragons Divine Transformation Art and thrust his sword forward. The Sword Saint’s Sword Qi turned him into a rainbow light that shot away, unstoppable.<br/><br/>In other directions, Xu Qiuming, Lv Changge, Ye Xiang, Zhao Chuanqian, and others also displayed the strength to fight multiple opponents at once.<br/><br/>Especially Xu Qiuming, who was surrounded by five hundred demonic cultivators and still held his own!<br/><br/>With his right hand using his fingers as a sword, and his left hand behind his back, Xu Qiuming swung his right arm rapidly. One after another, powerful Sword Qi burst forth from the sword shadows behind his head, following the direction of his pointing, with a grand momentum. The demonic cultivators of the Chi Devil Sect could not stop them and had to dodge. But even so, every moment, someone was injured or even killed.<br/><br/>Boom—<br/><br/>To the north of the altar, the ground heaved up rolling dust clouds, massive enough to envelope the heavens, and a figure flew out from within, the Inheritance Elder of the Great Abyss Gate, Zhao Chuanqian, wounded all over, holding a White Jade Ruler that bristled with Qi and exerted tremendous pressure.<br/><br/>Chen Anshi, high above on a calabash, holding a Long Saber, looked down at Zhao Chuanqian and said, “Junior brother, why struggle? Just bow your head to me, and I, your senior brother, will spare your life.”<br/><br/>Zhao Chuanqian was expressionless. He lifted his Ruler with his right hand, smeared blood with his left fingers onto it, and then swung it forward. Sword Qi mixed with the blood droplets transformed swiftly into bloody Sword Qi that streaked across the sky, shredding the dust clouds along its path.<br/><br/>Chen Anshi swung his long saber rapidly, forming a huge protective shield of saber qi around him, to block Zhao Chuanqian’s oncoming attack head-on.<br/><br/>The clash of two high-ranking Great Cultivators from the Profound Heart Realm was of immense magnitude, yet they were not the fiercest encounter on the battlefield.<br/><br/>At that moment, nearly thirty Elders from the Great Abyss Gate, Suspended Vast Sword Sect, and Tian Shu Sect were besieging one person who was clad in black, holding a sword in his right hand, and supporting a black gourd with his left, behind whom three ghostly apparitions were condensed, their true faces unclear, black all over, spine-chillingly terrifying.<br/><br/>All three ghostly deities loomed several Zhang high, baring their fangs and brandishing their claws, slashing out strokes of black Ghost Qi like ink, wreaking havoc in all directions and preventing the Elders from approaching the person in black.<br/><br/>The man in black wore a mask that covered even his eyes, occasionally glancing around as though searching for something.<br/><br/>“Fang Wang won’t be coming, will he? He just broke through to the Condensation Spirit Realm and is probably busy cultivating new spells,”<br/><br/>Zhao Zhen’s voice echoed in the heart of the man in black.<br/><br/>This man in black was none other than Lu Yuanjun!<br/><br/>Hearing this, Lu Yuanjun’s heart sank to the bottom.<br/><br/>Boom!<br/><br/>A thundering sound from a distance struck, causing everyone to turn their heads, only to see rolling Demonic Qi swirling toward them like a tornado. Within the tempestuous Demonic Qi, a giant demonic python could be vaguely discerned, writhing its body. Despite being far at the horizon, it exerted an indescribable oppressive force on all.<br/><br/>“What are you all waiting for? Finish them at once!”<br/><br/>An icy voice came through, tinged with impatience.<br/><br/>Hearing this, the Sect Master of the Chi Devil Sect, who was leading his direct disciples in the attack on Xu Qiuming, immediately shouted, “Don’t wait any longer, kill them all!”<br/><br/>As his voice fell, many Cultivators from the Chi Devil Sect began casting their ultimate arts!<br/><br/>Chen Anshi, who was fiercely battling Zhao Chuanqian, frowned and couldn’t help but glance at Lu Yuanjun, sighing softly.<br/><br/>Hearing the words of the Chi Devil Sect’s Sect Master, the Cultivators from the Great Abyss Gate, Suspended Vast Sword Sect, and Tian Shu Sect all felt a tightening in their chests.<br/><br/>Still, some did not believe in their defeat, such as Xu Qiuming. He turned around to charge towards the altar, moving as fast as a gust of wind, the sword shadows behind his head slashing rapidly, cutting through the Demonic Cultivators along his path.<br/><br/>Boom!<br/><br/>A figure descended from the sky, smashing into the altar’s outer perimeter and blocking Xu Qiuming, a dust cloud billowing upward, terrifying momentum halting Xu Qiuming in his tracks.<br/><br/>The dust was torn apart by a powerful gust, revealing a figure in white ahead.<br/><br/>This was a white-haired man who appeared to be about thirty, his long hair tied under a silver crown, with a robust frame, holding a wooden sword in his right hand, staring emotionlessly at Xu Qiuming.<br/><br/>The white hair and white clothes were particularly conspicuous in the gloomy firmament.<br/><br/>Xu Qiuming, feeling as if he were facing a formidable enemy, frowned and asked, “Who exactly are you? You’re not with the Chi Devil Sect, are you?”<br/><br/>The white-haired man looked at him indifferently and said, “Born with a sword heart, you are a fine seedling. If you are willing to kneel, I can lead you to seek a higher Immortal fate.”<br/><br/>Upon hearing this, Xu Qiuming’s eyes immediately flashed with killing intent, and he launched an attack on the white-haired man.<br/><br/>Elsewhere.<br/><br/>Gu Li fought shoulder to shoulder with the Disciples of the third line; the twelve of them were already enveloped in a siege with no avenue of escape.<br/><br/>“Elder brother! Hasn’t our sect sent reinforcements? It’s somewhat farcical that just the few of us are confronting the entire Chi Devil Sect,” Zhou Bo said anxiously, his hair disheveled and blood smearing his face, gasping for air as he cast spells, clearly nearing his limit.<br/><br/>Li Yu clenched his teeth and said, “Trust in the Sect Leader, he must have a plan! ”<br/><br/>No sooner had he finished speaking than an overbearing and decisive Sword Intent arrived from the heavens, prompting them to look up in surprise.<br/><br/>Their eyes caught sight of a sword qi sweeping irresistibly from the horizon, skimming across the sky over the battlefield like an aurora cutting through the gloomy firmament, heading straight for the terrifying demonic python surrounded by Demonic Qi.<br/><br/>In less than three breaths, the sword qi flew over dozens of li, boldly dispersing the Demonic Qi around the fearsome python, revealing its body.<br/><br/>This was a huge black python spotted with red, wide enough to require eight people to encircle it, dozens of Zhang long, with a bulging lump on its head, and a figure standing behind. The figure raised his right hand, pointing with two fingers towards the front, forcefully blocking the sword qi.<br/><br/>The man in purple clothes stood imposingly, his dignified face framed by loosely cascading long hair, his leopard eyes piercing with a bone-chilling coldness. With a turn of his right hand, the powerful sword qi in front of him vanished instantly.<br/><br/>“May I ask who you are, and from which realm do you hail, that you would meddle in the affairs of the Grand Qi Cultivation Realm?”<br/><br/>An old voice rang out, tone icy.<br/><br/>Upon hearing this, the Cultivators from the Suspended Vast Sword Sect were instantly excited, with one disciple even exclaiming, “The Supreme Elder has arrived!”<br/><br/>The man in purple squinted towards the horizon and sneered, “My origin is not for you barbarians to investigate. Since I’m here, you might as well all become sacrifices!”<br/><br/>As he spoke, the demonic python under his feet burst forth with black demonic power again, engulfing the man’s figure before transforming into a sweeping black wind.<br/><br/>Atop a mountain range, Xiao Zi slithered forward, occasionally looking left and right with its snake head raised.<br/><br/>“Such dense demonic qi.”<br/><br/>Xiao Zi muttered to itself, while Fang Wang, standing atop its head, also sensed it.<br/><br/>It was not just demonic qi, but also magic qi and ghost qi!<br/><br/>It seemed the battle ahead was exceedingly fierce.<br/><br/>Fang Wang picked up the token of the eldest disciple, extended his divine sense into it, and found that only over eighty of the group of Great Abyss Gate disciples on the mission remained. In other directions, numerous light spots were converging, with the sizeable number no doubt in the tens of thousands. A portion of them had already joined the battlefield.<br/><br/>Such rapid movement!<br/><br/>The support from the Great Abyss Gate took Fang Wang by surprise.. Naturally, the speed couldn’t compare to his, but to travel so quickly in such numbers, could it be some kind of powerful magic artifact?\t\t\t\t\t\t</div>", "images": {}, "success": true}