{"id": 104, "url": "https://www.novelhall.com/i-became-an-immortal-on-mortal-realm-32879/14293723.html", "title": "Chapter 104 - Chapter 104: Chapter 101: Cross -Void Realm, Heaven I S Larceny Saint Sect", "volume": 2, "volume_title": "Volume 2", "body": "<h1>Chapter 104 - Chapter 104: Chapter 101: Cross -Void Realm, Heaven I S Larceny Saint Sect</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 104: Chapter 101: Cross -Void Realm, Heaven I s Larceny Saint Sect<br/><br/>Translator: 549690339<br/><br/>The man in purple stood atop the Black Python, looking down at the fierce battle between Fang Wang and the white-haired man, his smile growing increasingly intense.<br/><br/>“Master, aren’t you going to make a move? If this continues, he will die,” the Black Python said in a deep human voice.<br/><br/>The man in purple chuckled lightly, “It’s fine, he has just stepped into the Cross-Void Realm after all. His opponent is merely at the Condensation Spirit Realm.”<br/><br/>“What? He’s only at the Condensation Spirit Realm?”<br/><br/>The Black Python exclaimed in surprise, evidently having misjudged the situation.<br/><br/>The man in purple did not speak again and continued watching the battle.<br/><br/>Beside him, the blood-colored pillar of energy grew wantonly, and the mysterious figure inside seemed to be quietly stretching its body.<br/><br/>Fang Wang quickly swung his sword, causing the white-haired man to bleed profusely. The white-haired man was both shocked and enraged, and he suddenly burst forth with spiritual power to forcefully push Fang Wang back with his strongest momentum.<br/><br/>The next second, the white-haired man abruptly lowered his head, his face twisting into a ferocious snarl, no longer the calm composure he had before. He raised his left hand, and strands of black air condensed into a black broad sword in his hand.<br/><br/>“What realm are you in?”<br/><br/>The white-haired man asked through gritted teeth, his eyes nearly spewing flames of rage.<br/><br/>Fang Wang hovered in the air, looking down at him, “Naturally, I am at the Condensation Spirit Realm. Aren’t you?”<br/><br/>Upon hearing this, the killing intent in the white-haired man’s eyes surged violently.<br/><br/>He roared in fury, wielding the black broad sword to slash down angrily, a gigantic Sword Qi slashing out, like ink splashed on the canvas of the sky, stretching a hundred zhång long and sweeping away like a crescent moon.<br/><br/>Fang Wang loosened his right hand, and the Rainbow Sword shot straight out, powerfully dispelling the black Sword Qi!<br/><br/>In fact, he had already guessed that the white-haired man had surpassed the Condensation Spirit Realm, as the sensation the white-haired man gave him far exceeded that realm. The reason he competed in swordsmanship was to test the power of a higher realm.<br/><br/>After all, there was still one person watching!<br/><br/>The mysterious man standing on the head of the black python was even stronger than the white-haired man!<br/><br/>What a pity!<br/><br/>The white-haired man had disappointed him.<br/><br/>The power of a higher realm is nothing special!<br/><br/>Since that is the case, then go to your death!<br/><br/>Fang Wang chased after the Rainbow Sword, soaring through the air, his palm aiming toward the hilt of the sword. He and his sword cut through the air, astonishing the white-haired man into hurriedly dodging.<br/><br/>But no matter where he dodged to, Fang Wang and the Rainbow Sword were always before his eyes, getting closer and closer.<br/><br/>In the eyes of the onlookers, the figures of both men disappeared and reappeared simultaneously, their movements impossibly fast!<br/><br/>Damn it!<br/><br/>The white-haired man cursed inwardly. Suddenly, he crossed the two swords in front of him, and spiritual power burst forth from his arms, turning into a myriad of Sword Qi, intending to grind Fang Wang to death.<br/><br/>“Fancy tricks!”<br/><br/>Fang Wang snorted coldly, his speed suddenly increasing.<br/><br/>A flash of cold light stretched, and the next second, the white-haired man’s speed plummeted, Fang Wang already behind him, his right hand holding the Rainbow Sword.<br/><br/>Both of them landed at the same time, skidding forward as dust flew into the air.<br/><br/>When they came to a stop, Fang Wang’s Rainbow Sword was wrapped in qi tinged with blood — the blood of the white-haired man, being evaporated by the Sword Qi.<br/><br/>Behind him, the white-haired man’s body trembled, taking a few shaky steps forward before his head suddenly flew off and his body fell to the ground with a thud.<br/><br/>Seeing this scene, Xu Qiuming fell into a daze.<br/><br/>The white-haired man he deemed unbeatable, was just slain by Fang Wang like that?<br/><br/>Fang Wang suddenly turned around, his gaze locked onto the corpse of the white-haired man. He saw a streak of white light shoot out, fleeing towards the heavens.<br/><br/>Primordial Spirit!<br/><br/>Trying to escape?<br/><br/>Fang Wang immediately used his body as a magic artifact and performed the Sword Control Technique at an even faster speed to give chase. At the same time, his left hand reached for the storage bag on his waist and pulled out the Reincarnation Bell.<br/><br/>All these were but tricks to the eye, making others mistake his Lifespirit Treasure for a magic artifact!<br/><br/>Once a Lifespirit Treasure successfully condensed, it indeed looked indistinguishable from a magic artifact.<br/><br/>Dong!<br/><br/>The Reincarnation Bell sounded, and the flight speed of the white light dropped sharply. Fang Wang quickly flew up, catching the white light with the bell. He then turned around and flew back to the corpse of the white-haired man at an extremely fast speed.<br/><br/>He placed the Reincarnation Bell onto the ground, the bell larger than his entire body!<br/><br/>He began to search the white-haired man’s corpse with the Rainbow Sword.<br/><br/>Peace returned to the heavens and the earth, with the occasional sound of thunder rumbling in the distance.<br/><br/>The cultivators from all directions had not yet snapped out of their daze, and the battle was already over.<br/><br/>Zhao Chuanqian sat on the ground, a large flag before him forming a shield to protect him. The ground around him was covered with dense and innumerable<br/><br/>sword marks from previous Sword Qi attacks.<br/><br/>“Their strength must exceed the battle from three hundred years ago between the Sword Saint and Grand Qi’s number one…”<br/><br/>Zhao Chuanqian felt complicated emotions. He had estimated Fang Wang’s strength as highly as possible, but the result told him that he had still underestimated him.<br/><br/>Xu Qiuming felt the same. Following the surprise was endless confusion.<br/><br/>Chen Anshi’s expression was extremely gloomy, his hands clenched tightly inside his sleeves. His eyes were full of disbelief.<br/><br/>How could he possibly be so powerful?<br/><br/>Even if an Immortal reincarnated, it wouldn’t be this preposterous, right?<br/><br/>He felt as though Fang Wang was the calamity destined to thwart him and Lu Yuanjun, no matter how many traps he set or how powerful the entities he invited, Fang Wang could tear apart his hopes with a domineering attitude.<br/><br/>“Junior, I am still here. It may not be good for you to rush to gather the spoils of battle like this!”<br/><br/>A mocking laugh came over, the voice of the man in the purple robe.<br/><br/>Fang Wang lifted a ring with his sword blade and tried to toss it into his storage bag, but it wouldn’t fit. It appeared that this item was a Storage Ring.<br/><br/>Space Magic Artifacts cannot contain other Space Magic Artifacts; otherwise, stacking storage bags within storage bags would be invincible.<br/><br/>Fang Wang clipped the ring to his belt and then turned to look at the massive black python, large as a mountain, in the distance.<br/><br/>At that moment, Xiao Zi came up behind him and lowered her head. He soared into the air following her, and the Reincarnation Bell also took flight, landing with him on the snake’s head. Xiao Zi carried him towards the massive Black Python, growing larger as they flew.<br/><br/>At the very least, on the surface, it could not let its master appear weaker than anyone else!<br/><br/>“Kill! Keep killing! Kill all those from the Demonic Dao! Fang Wang will lead us to victory! ”<br/><br/>Greedy Sleeper shouted loudly, sounding the horn of war once again.<br/><br/>The nearby disciples of Great Abyss Gate launched their attacks one after another, their blood boiling with fervor, infecting the disciples of the Suspended Vast Sword Sect and Tian Shu Sect as well. With the battle here underway, other battlefronts also plunged back into intense warfare.<br/><br/>Fang Wang, standing on Xiao Zi, flew toward the black python beside the blood-colored pillar.<br/><br/>Xiao Zi was otherworldly and majestic, while the Black Python was domineering and malevolent. The standoff between the two colossal monsters still tugged at the hearts of many cultivators, who, not engaged in battle, were healing their wounds while keeping a close eye on the two beasts.<br/><br/>It was clear to everyone that the upcoming battle between Fang Wang and the man in the purple robe would determine the victor of this war.<br/><br/>At that moment.<br/><br/>A number of figures flew in, swiftly arriving around the Black Python—it was the Sect Master and elders of the Chi Devil Sect, a total of twenty-six people, each exuding an extraordinary aura.<br/><br/>“Senior, we must be cautious. This young man possesses the Heaven Yuan Spirit Treasure and has inherited the legacy of the Sword Saint! Recently, he even achieved the Condensation Spirit Realm, and he possesses the talent to fight across realms!”<br/><br/>The Sect Master of the Chi Devil Sect said gravely, his gaze towards Fang Wang filled with apprehension.<br/><br/>The reason why Green Cicada Valley was destroyed was mainly due to Fang Wang slaughtering his way through, which gave the Jin Xiao Sect an opportunity.<br/><br/>As fellow Demonic Sects, the Chi Devil Sect naturally felt the sorrow of the fox for the death of the rabbit, and they wished for Fang Wang to die sooner rather than later.<br/><br/>Over the years, the Chi Devil Sect had also dispatched people to investigate Fang Wang’s whereabouts, even capturing cultivators of the Fang Family in hopes of using them to threaten Fang Wang. Yet, some mysterious forces always interfered, leading to their repeated failures.<br/><br/>The man in the purple robe looked at Fang Wang with a defiant smile, saying, “The Heaven Yuan Spirit Treasure? Indeed, the aura of that halberd didn’t deceive me; he’s truly strong. To slaughter a Great Cultivator of the Cross-Void Realm with the cultivation of the Condensation Spirit Realm is no small feat. Such talent, if allowed to grow, is unimaginable.”<br/><br/>“What’s your name?”<br/><br/>Before he could answer, the Sect Master of the Chi Devil Sect hastily said, “His name is Fang Wang!”<br/><br/>The man in the purple robe glanced at him sideways, frightening him into immediately silencing himself, daring not to speak further.<br/><br/>“Hmph ! ”<br/><br/>The man in the purple robe once again turned towards the approaching Fang Wang, saying, “Fang Wang, join my Heaven’s Larceny Saint Sect, and I will help you explore higher realms and reach heights you dare not even imagine!”<br/><br/>Fang Wang asked with a chuckle, “If I were to submit, would you let go of Great Abyss Gate, Suspended Vast Sword Sect, and Tian Shu Sect, and help me eradicate the Chi Devil Sect?”<br/><br/>Upon hearing this, the faces of the people from the Chi Devil Sect changed dramatically.<br/><br/>The man in the purple robe kept his smile and said, “That won’t do. Everyone here, except you and the Chi Devil Sect, must die. After all, the Chi Devil Sect has acted for my Heaven’s Larceny Saint Sect and has merits. The treasures here cannot be leaked out.”<br/><br/>While speaking, he pointed his hand towards the mysterious shadow inside the blood -colored pillar.<br/><br/>Fang Wang smiled and then his gaze turned cold.<br/><br/>Just as Fang Wang was passing a mountain of corpses, a black shadow flew out, like an arrow released from its bow, striking towards Fang Wang’s back faster than the members of the Chi Devil Sect could react.<br/><br/>Boom!<br/><br/>Fang Wang’s Body-protecting Divine Barrier erupted, blocking the black-clothed person behind him.<br/><br/>The black-clothed person’s right palm slapped toward Fang Wang’s back, but was stopped by the Body-protecting Divine Barrier, unable to touch Fang Wang at all.<br/><br/>Fang Wang slightly turned his head, glancing sideways with his peripheral vision, startling the black-clothed person into quickly retreating, creating a hundred-zhang distance.<br/><br/>“Stop.”<br/><br/>Fang Wang said softly, and Xiao Zi immediately came to a halt.<br/><br/>Yin Yang Xuan Ming Zhen Gong!<br/><br/>Lu Yuanjun!<br/><br/>Fang Wanging was extremely familiar with the Xuanming Seal; the palm that Lu Yuanjun had thrown at him was indeed the Xuanming Seal.<br/><br/>Good!<br/><br/>I’ve finally caught you!<br/><br/>“Heaven’s path is unchosen, hell’s gates unwalked, yet you chose to barge into doom, seems like greed is pulling you into the abyss,” Fang Wang said disdainfully to Lu Yuanjun in a cold voice.<br/><br/>Lu Yuanjun was internally startled. Why had his Xuanming Seal not succeeded?<br/><br/>What spell had protected Fang Wang just now?<br/><br/>Could it be…<br/><br/>The Body-protecting Divine Barrier?<br/><br/>Impossible!<br/><br/>How could the Body-protecting Divine Barrier have such defensive power?<br/><br/>Lu Yuanjun was puzzled. He had practiced the Body-protecting Divine Barrier of Great Abyss Gate, but he had abandoned the technique early when he stepped into the Profound Heart Realm, not only because it consumed a lot but also because its defensive power was not as strong.<br/><br/>Chen Anshi came up behind the man in the purple robe and saluted, “Senior,<br/><br/>Fang Wang cannot be swayed. He is affiliated with the Jin Xiao Sect!”<br/><br/>Upon hearing the three words “Jin Xiao Sect,” the man in purple robe’s expression changed.<br/><br/>“Senior, please help my disciple capture his soul, and then Fang Wang’s talents can still be of use to us! My disciple has given everything to revive the Saint Treasure!” Chen Anshi quickly said, his tone grave.<br/><br/>Upon hearing this, the man in the purple robe nodded slightly.<br/><br/>At that moment, Fang Wang’s voice came through, “Oh? A Saint Treasure? Is it strong? May I have a look?”\t\t\t\t\t\t</div>", "images": {}, "success": true}