{"id": 114, "url": "https://www.novelhall.com/i-became-an-immortal-on-mortal-realm-32879/14295355.html", "title": "Chapter 114 - Chapter 114: Chapter 111: Life And Death Are Predestined, The Strongest Under The Heavens", "volume": 2, "volume_title": "Volume 2", "body": "<h1>Chapter 114 - Chapter 114: Chapter 111: Life And Death Are Predestined, The Strongest Under The Heavens</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 114: Chapter 111: Life and Death are Predestined, The Strongest Under the Heavens<br/><br/>Translator: 549690339<br/><br/>Xiao Chen stared at the white light sword blade piercing through his chest, his eyes wide open with both shock and fury.<br/><br/>Such a fast sword!<br/><br/>Such domineering sword qi!<br/><br/>It was the first time Xiao Chen had seen such swordsmanship. He swiftly retreated, his left hand pointing towards an acupuncture point on his chest, attempting to stop the bleeding.<br/><br/>Liang Xunqiu was also not dead, though he was scared too.<br/><br/>Just after clashing, he was severely injured, which spoke volumes about the gap between his cultivation level and Fang Wang’s.<br/><br/>Despite his alarm, Liang Xunqiu did not give up. His torn chest began to heal on its own.<br/><br/>Fang Wang had never seen such a rapid self-healing ability before. Could this guy not be human?<br/><br/>“Young Master, there’s something off about his aura!”<br/><br/>Xiao Zi spoke in a heavy tone. It moved behind Fang Wang, facing Lanxin Xianzi who was approaching.<br/><br/>Fang Wang’s eyes were still fierce as he said, “It’s just a futile struggle!”<br/><br/>He stored the Rainbow Sword into the Treasured Spirit Space and then condensed the Heavenly Palace Halberd. This moment, he was ready to fight in earnest!<br/><br/>The scorching sun hung high in the sky, and amidst the mountains stood a towering tree reaching the clouds, with a trunk diameter exceeding a hundred zhang, robust branches, and dense foliage. Every leaf was as big as a house, and numerous vines hung down with their ends wrapped in green cocoons. Some cocoons hadn’t completely closed, revealing human feet that were still slightly trembling.<br/><br/>Hu Pomo and Hu PO Xie stood atop a mountain peak, their gazes fixed on the enormous tree in the distance.<br/><br/>They weren’t the only ones – hundreds of cultivators were scattered in all directions, all eyeing the giant demon tree because they could feel the tremendous Spiritual Energy it emitted. Clearly, there were treasures hidden within the tree.<br/><br/>Fang Zigeng was also there, acting alone, standing cautiously behind a rock, observing the tree in the distance.<br/><br/>Hu PO Xie asked, “Big brother, who do you think can win among Fang Wang, Liang Xunqiu, Grand Chu Sword Master, and Lanxin Xianzi?”<br/><br/>He was obsessed with this issue, not out of concern for Fang Wang, but pure curiosity.<br/><br/>He too had a desire to become famous throughout the world. Fang Wang’s reputation made him envious, and he was curious to see how Fang Wang would fare against those renowned great cultivators.<br/><br/>Hu Pomo, staring off into the distance, casually said, “Grand Chu Sword Master Xiao Chen, his swordsmanship has reached the path of the Dao. Amongst the sword cultivators of the seven dynasties, only the Grand Qi Sword Saint could contend with him, but the Sword Saint has died. In my view, he has the greatest chance of winning.”<br/><br/>“Next is Liang Xunqiu, whose bloodline is unique, his body like that of a primitive demon beast, his blood fiery as magma. He may have a chance.”<br/><br/>“Although Lanxin Xianzi is a woman, she is the Sect Hierarch of Grand Han’s First Demon Sect, with unfathomable strength.”<br/><br/>“As for Fang Wang, even though he is young, he has already crushed two demon sects in the Grand Qi Cultivation Realm on his own. I can’t see through him either.”<br/><br/>After listening, Hu PO Xie couldn’t help but roll his eyes and said impatiently, “Big brother, can you say something useful?”<br/><br/>Hu Pomo chuckled, “Haven’t I already said it? I’m most optimistic about Xiao<br/><br/>Chen.”<br/><br/>At that moment, an eerie humming sound came from the front, like a swarm of bees or the wind, attracting the attention of all cultivators. The Hu Pomo brothers also looked over.<br/><br/>They saw the giant demon tree begin to shake, the cocoons on the ends of the vines opened, and corpses rained down like rain, human and demon alike, with most of the upper bodies reduced to mere skeletons, an horrific sight. Above the demon tree, lights started to flicker amongst the leaves, followed by the spread of a red mist that appeared quite enchanting.<br/><br/>“Alright, it’s time to act. This fruit is one of the finest Heavenly Materials and Earthly Treasures in the Zhui Tian Secret Realm. Twenty years ago when I came here, the fruit had not yet appeared. You’re lucky,” Hu Pomo said with a<br/><br/>soft chuckle, bringing Hu PO Xie’s focus back to the present.<br/><br/>No sooner had he spoken than some cultivators in the distance began to move, flying on their swords towards the giant demon tree.<br/><br/>Under the cosmic stars, dust rolled over the floating islands, enveloping a corner of the ancient city.<br/><br/>Liang Xunqiu lay in the ruins, bloodied, with his limbs grotesquely twisted. He was gasping for air, his hair disheveled.<br/><br/>He struggled to lift his head, only to see a figure walking through the billowing dust—Fang Wang.<br/><br/>Fang Wang was holding Lanxin Xianzi by the neck, lifting her high in the air, while his right hand held the Heavenly Palace Halberd, with Xiao Chen’s body impaled on its blade.<br/><br/>“Fang Wang… you… will not die a good death…”<br/><br/>Xiao Chen struggled to lift his head, trembling and drooling blood.<br/><br/>Xiao Zi, perched on Fang Wang’s shoulder, sneered, “Weren’t you very arrogant before?”<br/><br/>Lanxin Xianzi, with Fang Wang’s hand around her neck, forced a smile and said, “Life and death are predestined; to lose is to die. Xiao Chen, don’t be too weak…”<br/><br/>With a snap!<br/><br/>Fang Wang broke Lanxin Xianzi’s neck, tossing her body aside.<br/><br/>Then, he swung the Heavenly Palace Halberd, throwing Xiao Chen to the ground.<br/><br/>He looked down at Xiao Chen, and as Xiao Chen glared back with resentment and malice, Fang Wang raised his left hand. He first took Xiao Chen’s Storage Ring, then a Solaris True Fire condensed in his palm and he swung it forward.<br/><br/>The Solaris True Fire landed on Xiao Chen, who cursed madly. Unfortunately, he no longer had the strength to run away and could only be burned to death.<br/><br/>This process was quick; Xiao Chen fell silent after three breaths, and within five breaths, his ashes were scattered by the wind.<br/><br/>Fang Wang looked towards Liang Xunqiu and asked, “Do you have any last words?”<br/><br/>With difficulty, Liang Xunqiu managed a smile and said, “Heaven Yuan Spirit Treasure… Indeed, there are always others stronger and higher places beyond the heavens. When I first heard of your deeds, I was dismissive… After all, I am also a supreme Earth Origin Spirit Treasure… And I possess the bloodline of a Demon Emperor… I couldn’t possibly lose to you… Yet, I have lost… utterly…”<br/><br/>“Fang Wang, do it, to die by your hand… I have no grievances nor regrets, because you are destined to become the strongest in this world…”<br/><br/>After finishing his words intermittently, Liang Xunqiu lowered his head.<br/><br/>Fang Wang threw the Heavenly Palace Halberd, beheading Liang Xunqiu, whose lifeforce was completely severed.<br/><br/>While the Condensation Spirit Realm does possess a Primordial Spirit, it still cannot achieve the out-of-body stage; death of the body is true death.<br/><br/>However, Fang Wang did not use the Solaris True Fire, so Liang Xunqiu and<br/><br/>Lanxin Xianzi still had the chance to enter the cycle of reincarnation. As for Xiao Chen, being too arrogant and spouting unkind words, Fang Wang caused his soul to disperse and perish.<br/><br/>“Go pick up their storage treasures.”<br/><br/>Fang Wang instructed, and Xiao Zi immediately acted.<br/><br/>Without delay, Fang Wang sat down on the spot to restore his Spiritual Power. Although eradicating Xiao Chen and the other two only depleted one-tenth of his Spiritual Power, he still wanted to face the upcoming challenges in the best condition possible.<br/><br/>Obtaining the Heavenly Gang Saint Body Technique certainly wouldn’t be easy.<br/><br/>Soon, Xiao Zi brought the storage pouches and the Storage Ring of Lanxin Xianzi and Liang Xunqiu in front of Fang Wang.<br/><br/>Zhao Zhen emerged from the Soul Devouring Gourd, lamenting, “A supreme Earth Origin Spirit Treasure, and in the Condensation Spirit Realm, he should have been a prodigy of his generation. It’s a pity, fate toys with people.”<br/><br/>He understood Liang Xunqiu’s feelings all too well.<br/><br/>Being an opponent of Fang Wang truly made one question life.<br/><br/>Only by becoming Fang Wang’s opponent can one truly realize how terrifying his talents are.<br/><br/>“No one is to blame; contending for chances is bound up with both good and ill fortune, and death on the path of cultivation is normal.” Xiao Zi wasn’t too thoughtful; it had long been accustomed to life and death, and compared to those cultivators who died unsightedly within the Great Saint’s Grotto-Heaven, Liang Xunqiu died with considerable dignity.<br/><br/>Zhao Zhen shook his head with a wry smile, choosing not to dwell on the topic any longer. He floated up and began observing the ancient city.<br/><br/>An hour later.<br/><br/>Fang Wang stood up, he attached the three storage pouches to his waist and pocketed Lanxin Xianzi’s Storage Ring. Afterwards, he buried the bodies of Liang Xunqiu and Lanxin Xianzi separately.<br/><br/>Having completed these tasks, Fang Wang began walking towards the interior of the ancient city.<br/><br/>Xiao Zi flew beside him while Zhao Zhen floating above spoke, “There’s a huge palace ahead; it’s probably the key structure of this city.”<br/><br/>Fang Wang nodded and continued walking slowly.<br/><br/>He wasn’t in a hurry and took the opportunity to appreciate the scenery along the way.<br/><br/>The ancient city was extremely desolate, aside from the areas that had collapsed due to the battle, the other well -preserved streets and buildings all seemed desolate, with handprints on some walls adding to the eeriness.<br/><br/>It was as if people really lived here once and then abandoned it.<br/><br/>After a while, Fang Wang stopped in his tracks. He had reached the central part of the city where a massive stone hall stood before him. The entrance alone was thirty feet tall, carved with two beast-like lions that seemed ordinary, yet as he approached the door, he felt an indescribable pressure.<br/><br/>There was danger beyond the door!<br/><br/>Xiao Zi cautiously asked, “Shall we go in?”<br/><br/>It too felt a chilling sensation and was quite nervous.<br/><br/>Zhao Zhen floated behind, quietly observing the ferocious beasts depicted on the stone gate, his thoughts unknown.<br/><br/>Without answering, Fang Wang gathered the Heavenly Palace Halberd in his hand and let go, unleashing its terrifying momentum that unyieldingly struck the stone door.<br/><br/>With a loud boom!<br/><br/>The ground trembled slightly as the Heavenly Palace Halberd struck the stone door, but it didn’t penetrate it.<br/><br/>“That hard?” Xiao Zi exclaimed in surprise.<br/><br/>Fang Wang seemed to have an idea. He furrowed his brows, retrieved the Heavenly Palace Halberd, and then charged at the stone door.<br/><br/>In an instant, he executed the Nine Dragons Divine Transformation Art, conjuring a colossal Black Dragon head that collided head-on with the stone door.<br/><br/>Another loud boom!<br/><br/>The stone door shattered as Fang Wang burst into the palace with overwhelming momentum. A strong wind carrying the stench of blood greeted him, forcing him to keep the Nine Dragons Divine Transformation Art active.<br/><br/>Outside the palace, Xiao Zi swiftly avoided the onslaught, watching a bloody windstorm erupt from within the gates, enormous and frightful.<br/><br/>Once the windstorm subsided, Fang Wang then deactivated the Nine Dragons Divine Transformation Art.<br/><br/>What met his eyes was a dim and spacious pathway, with darkness at the end, depth unknown. On either side stood rows of pillars, each etched with various forms of dragons — some with oversized heads and small bodies, some with eight limbs, and others with two heads — bizarre and varied.<br/><br/>Xiao Zi followed behind Fang Wang, its gaze also drawn to the dragon figures on the pillars.<br/><br/>“Wow, young master, do you think there’s a chance of dragon transformation inside? I saw a record in a secret realm within the Great Saint’s Grotto-Heaven before, stating that the Great Saint once raised dragons, but there are no true dragons in the world,” Xiao Zi said excitedly.<br/><br/>Fang Wang replied offhandedly, “We’ll know once we go inside.”<br/><br/>Carrying the Heavenly Palace Halberd, he advanced. He instinctively sensed danger and did not retract the Heavenly Palace Halberd. As he stepped forward, his Golden Scale White Feather Robe surfaced, with golden dragon energy swirling around him, illuminating the path ahead.<br/><br/>Zhao Zhen floated behind, looking around quietly without uttering a word..\t\t\t\t\t\t</div>", "images": {}, "success": true}