{"id": 112, "url": "https://www.novelhall.com/i-became-an-immortal-on-mortal-realm-32879/14295026.html", "title": "Chapter 112 - Chapter 112: Chapter 109: Surpassing The Great Saint, Grand Chu Sword Master", "volume": 2, "volume_title": "Volume 2", "body": "<h1>Chapter 112 - Chapter 112: Chapter 109: Surpassing The Great Saint, Grand Chu Sword Master</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 112: Chapter 109: Surpassing the Great Saint, Grand Chu Sword Master<br/><br/>Translator: 549690339<br/><br/>Fang Wang followed the cultivators into the waterfall; Xiao Zi in his arms shivered, uncertain if it was due to fear or excitement.<br/><br/>Passing through the waterfall’s waters, a blinding light shone into Fang Wang’s eyes. The long-lost sensation appeared once again; he couldn’t move at all, unable to open his eyes or extend his spiritual sense.<br/><br/>After three breaths, Fang Wang regained his senses and immediately opened his eyes. What entered his view was a vast blue sky, surrounded by the figures of cultivators.<br/><br/>Unlike in the Great Saint’s Grotto-Heaven, they hadn’t scattered after entering but remained clustered together.<br/><br/>Fang Wang turned his head and saw a splendid array of rainbow light hovering high behind him, resembling a portal, with a steady stream of cultivators flying out from it.<br/><br/>He glanced only once before immediately stepping on his flying sword and speeding off into the distance.<br/><br/>In the blink of an eye, he vanished into the horizon.<br/><br/>Zhui Tian Secret Realm was an independent world; with green mountains, clear waters, blue skies, white clouds, and everything one would expect, including a blazing sun hanging in the sky.<br/><br/>While using the Sword Control Technique to fly, Fang Wang took out a map.<br/><br/>Xiao Zi climbed onto Fang Wang’s shoulder, and Zhao Zhen emerged from the Soul Devouring Gourd. Inside the Zhui Tian Secret Realm, there was no need to hide his ghostly form, as danger might present itself at any time.<br/><br/>Fang Wang muttered, “This map only shows the location of the Zhui Tian Waterfall, but the Zhui Tian Secret Realm is so vast, where should we search?”<br/><br/>Zhao Zhen leaned over to check the map as well.<br/><br/>Xiao Zi also tilted her head to look.<br/><br/>“There must be some mystery to this map; it’s not just about guiding us here to the Zhui Tian Secret Realm. If we explore around, maybe we will find something,” Zhao Zhen pondered.<br/><br/>Fang Wang thought the same and glanced at Xiao Zi.<br/><br/>Understanding the cue, Xiao Zi swiftly leapt aside, her snake body enlarging. The flying sword under Fang Wang’s feet slipped into the storage bag, and he smoothly landed on her head, crossing his legs to sit down and observe the terrain along the way.<br/><br/>Boom—<br/><br/>A roaring sound approached, and Fang Wang glanced over to see a mountain peak ten-odd miles to the left being sliced off, dust billowing. Two sword cultivators were besieging another cultivator there.<br/><br/>Goodness gracious, a fight as soon as we entered. Could there be a feud?<br/><br/>Fang Wang merely glanced, and since it wasn’t any of the Great Abyss Gate disciples, he had no intention of intervening.<br/><br/>Xiao Zi accelerated onward. Her nearly thirty zhang-long serpentine form exuded an imposing presence, also releasing billowing demonic qi that swirled around her, making her seem extremely menacing.<br/><br/>Using Xiao Zits imposing form, the cultivators they encountered along the way all swiftly avoided them, with no one daring to provoke Fang Wang.<br/><br/>In the blink of an eye, two hours had passed.<br/><br/>The vastness of the Zhui Tian Secret Realm seemed boundless, with rivers crisscrossing and mountains undulating, though the forests were rather sparse.<br/><br/>“I’ve got it!”<br/><br/>Zhao Zhen suddenly clapped his hands, becoming excited.<br/><br/>Fang Wang turned his head toward him, his eyes filled with anticipation.<br/><br/>Zhao Zhen pointed at the map and said, “This is both a map of the outside and the inside. The terrain of the Zhui Tian Secret Realm mirrors that of the outside, but the rivers and forests are different. I’ve been familiar with the sand tables and maps of Grand Qi Kingdom since childhood, and the terrain surrounding us now greatlv resembles the borders of Grand Oi.”<br/><br/>Upon hearing this, Fang Wang looked towards the distance. After such a mention by Zhao Zhen, it indeed seemed similar.<br/><br/>Of course, Fang Wang didn’t actually remember those mountainous terrains. Grand Qi was so vast, and the places he had been to were not many. Every now and then, he would even be confined in the Heavenly Palace for centuries, so how could he remember clearly, unless there were cities?<br/><br/>Zhao Zhen began to give directions, and Xiao Zi immediately changed course.<br/><br/>Fang Wang began to feel fortunate that he hadn’t wiped out Zhao Zhen. He had to admit, the former Emperor of Grand Qi was indeed useful.<br/><br/>As Xiao Zi continued to advance, Zhao Zhen grew increasingly certain of his conjecture.<br/><br/>“It seems that the Zhui Tian Secret Realm was also created by a Great Saint over ten thousand years ago. Truly remarkable, a perfect replication of the outside world’s terrain, and just as vast. No wonder only the Immortal Gods could vanquish him and his forces,” Zhao Zhen remarked with awe.<br/><br/>He suddenly felt content with his current state. With his innate talents, how far could he go?<br/><br/>Following Fang Wang, he was assured to witness the wonders of the world and venture into realms unreachable by mortals.<br/><br/>Fang Wang smiled and said, “That would indeed save us a lot of trouble.”<br/><br/>The expanse of the Zhui Tian Secret Realm was vast; blindly searching for the Heavenly Gang Saint Body Technique was like finding a needle in a haystack.<br/><br/>“The Great Saint was naturally formidable. According to the legends I saw in the Great Saint’s Grotto-Heaven, the Great Saint once unified this land. Just think about how many kingdoms there are on this land…” Xiao Zi spoke up, knowing much more about the legends of the Great Saint.<br/><br/>Zhao Zhen listened attentively, eager to learn more about the ancient Great Saint.<br/><br/>The Ji Hao Sect had received part of the Great Saint’s legacy, so the Three Great True Cultivations of the Ji Hao Sect were likely to have been passed down from the ancient Great Saint.<br/><br/>Perhaps the so-called fate with the Immortals was the true legacy of the Great Saint.<br/><br/>Thinking of the legends where the Great Saint stood against the Immortal Gods in the heavens, Fang Wang’s heart grew fervent.<br/><br/>He wanted to become the next Great Saint of the Mortal Realm!<br/><br/>No, he wanted to surpass the Great Saint!<br/><br/>During the rest of the journey, the voices of Xiao Zi and Zhao Zhen never ceased, and Fang Wang listened quietly. With their company, the loneliness was dispelled.<br/><br/>Dusk arrived.<br/><br/>Finally, Fang Wang reached his destination. Below was a large river that bore a striking resemblance to the Wei River, and ahead was a vast lake, seemingly a confluence of two rivers, which precisely matched the target location on the map.<br/><br/>Fang Wang’s face lit up with a smile, his eyes brimming with expectation.<br/><br/>Heavenly Gang Saint Body Technique, I’m coming for you!<br/><br/>Xiao Zi swiftly landed on the shore of the lake and then said, “Zhao Zhen, you go down and have a look. You’re a ghost, so you won’t be afraid of the water.”<br/><br/>“Ah? But this is a secret realm. What if there are formations or prohibitions? Would I not have my soul scattered?” Zhao Zhen said in fear.<br/><br/>Having spent so long together, he thought he had grown quite familiar with Xiao Zi.<br/><br/>He had not expected this serpent demon to be so ruthless!<br/><br/>It was even more heartless than the heart of an emperor!<br/><br/>Xiao Zi humphed, “You will have your soul scattered even if you don’t go<br/><br/>down.”<br/><br/>Zhao Zhen’s face instantly turned ugly, and he could only tremble as he floated towards the lake’s surface.<br/><br/>“Wait.”<br/><br/>Fang Wang called out to Zhao Zhen and then waved his sleeve. A Flying Sword shot out and dove into the lake.<br/><br/>Zhao Zhen let out a sigh of relief and looked at Fang Wang gratefully.<br/><br/>Fang Wang controlled the Flying Sword with the Great Perfection’s Sword Control Technique. The lake was unexpectedly three hundred Zhang deep, and many fish swam in the water, yet there were no powerful demons.<br/><br/>The Flying Sword swiftly shuttled through the water without encountering any obstacles or restrictions.<br/><br/>A whole incense stick’s worth of time passed before Fang Wang retracted the Flying Sword. The Sword Blade showed no abnormalities, proving that the lake water posed no problems.<br/><br/>Fang Wang frowned deeply, lost in thought.<br/><br/>“Could it be related to the time of day?” Zhao Zhen suddenly suggested.<br/><br/>Upon hearing this, Fang Wang took out the map again and noticed that there was a sun on the top of it, perfectly aligned with the lake’s surface.<br/><br/>“Then let’s wait until tomorrow,” Fang Wang said softly.<br/><br/>It was their first visit, and there was no hurry for this half day.<br/><br/>Zhao Zhen shook his head, “I fear tomorrow won’t do. Today, I observed the sun in the sky and noticed that, although there is a distinction between day and night, the sun’s light slowly fades, not setting beyond the western mountains.”<br/><br/>Fang Wang, upon hearing this, looked towards the setting sun and found it to be just as described; the sun had stayed in that same direction throughout their journey that day.<br/><br/>Fang Wang’s brows furrowed. If that was the case, how long would they have to wait?<br/><br/>“Since we have to wait anyway, I’ll go down and have a look. Who knows, there might be discoveries.” Xiao Zi spoke up and then plunged into the lake. Zhao Zhen had no time to react before being dragged into the depths by the Soul Devouring Gourd.<br/><br/>Fang Wang sat by the lake, carefully studying the map.<br/><br/>He suddenly thought of something and took out the mysterious stone tablet he had acquired. This item had been hidden away by Lu Yuanjun and was found alongside the Yin Yang Xuan Ming Zhen Gong, so it must be related to the Three Great True Cultivations.<br/><br/>After some time,<br/><br/>Xiao Zi burst out of the water, landing in front of Fang Wang. It had a fish in its mouth, which it swallowed whole, causing its snake body to bulge slightly in a rather comical manner.<br/><br/>“There’s really nothing at the bottom of the lake,” Xiao Zi said helplessly.<br/><br/>Fang Wang responded, “Then let’s wait a bit longer.”<br/><br/>The opportunities in the Zhui Tian Secret Realm were countless, but he was only concerned with the Heavenly Gang Saint Body Technique; he could afford to wait.<br/><br/>And so, a man, a demon, and a ghost spent the night by the lake.<br/><br/>The next morning, just as the sky brightened, Fang Wang noticed that the sun had slightly shifted right above the lake, but it was still a great distance away.<br/><br/>Seeing this, he immediately began to meditate and cultivate.<br/><br/>Zhao Zhen sat nearby with the map and stone tablet in front of him. Stroking his chin, he pondered carefully.<br/><br/>When it was nearing noon, the sun was still far from being directly above the lake, and no anomalies had occurred.<br/><br/>However, a person appeared on the opposite side of the lake. The individual was draped in a white robe with black clothes underneath, had graying hair, but appeared to be only in his forties, and possessed an extraordinary demeanor. He merely glancea at rang wang Derore sitting aown to meditate DY the lake’s edge.<br/><br/>Fang Wang narrowed his eyes. Could that person also be after the Heavenly Gang Saint Body Technique?<br/><br/>If there were no map, ordinary people passing by this place wouldn’t stop, as there were no formations or restrictions here.<br/><br/>Of course, there was another possibility: that person was after him.<br/><br/>Interesting.<br/><br/>Fang Wang smirked and continued to practice his cultivation.<br/><br/>An hour later, another individual arrived—a woman in black, wearing a bamboo hat and a veil that covered her face, revealing only her eyes. She didn’t approach Fang Wang or the man in the white robe. The three of them sat far apart from one another, but all chose to meditate by the lake’s edge.<br/><br/>“I didn’t expect the Lanxin Xianzi from Grand Han to come as well. May I ask what you seek, Xianzi?” the man in the white robe asked, his tone calm as his voice echoed over the lake.<br/><br/>The woman known as Lanxin Xianzi, with her eyes closed, replied, “There’s no need to ask. If we have gathered here, we must all be here for the same thing.”<br/><br/>Hearing this, the man in the white robe smiled and then turned to Fang Wang, saying, “This young fellow must be from somewhere new, a little unfamiliar to me. I hail from Grand Chu and my name is Xiao Chen.”<br/><br/>Fang Wang opened his eyes and responded, “My name is Fang Wang, from<br/><br/>Grand Qi.”<br/><br/>Upon hearing this, Xiao Chen’s eyes narrowed, and Lanxin Xianzi opened her eyes, looking towards Fang Wang.<br/><br/>“Is this the Fang Wang who possesses the Heaven Yuan Spirit Treasure?” Xiao Chen asked.<br/><br/>Fang Wang calmly said, “Yes, it is. Do you happen to know Xiao Jian?<br/><br/>Xiao Jian, the previously mentioned white-haired man from Heaven’s Larceny Saint Sect, whose Storage Ring Fang Wang had acquired. Inside the Storage Ring, he found a letter revealing the white-haired man’s name. This letter was intended for a family in Grand Chu but was never sent.<br/><br/>Fang Wang had always kept Xiao Jian and the man in purple at the forefront of his mind, feeling that the cause and effect had not yet unfolded.<br/><br/>Upon hearing the name, Xiao Chen stroked his beard and laughed, “That’s my father. He was once the Swords Master of Grand Chu, but he retired two hundred years ago and has since been wandering the world. Ever since he left, I have not seen him again.. May I ask where you met my father, young Fang Wang, and if he has been well?”\t\t\t\t\t\t</div>", "images": {}, "success": true}