{"id": 111, "url": "https://www.novelhall.com/i-became-an-immortal-on-mortal-realm-32879/14295015.html", "title": "Chapter 111 - Chapter 111: Chapter 108: Entry, Rules Of Life And Death", "volume": 2, "volume_title": "Volume 2", "body": "<h1>Chapter 111 - Chapter 111: Chapter 108: Entry, Rules Of Life And Death</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 111: Chapter 108: Entry, Rules of Life and Death<br/><br/>Translator: 549690339<br/><br/>Fang Wang chatted with Fang Hanyu and Fang Zigeng as they sat down. After many years apart, seeing his clan members in a foreign land made Fang Wang’s mood quite pleasant, which mitigated the irritation he felt from not breaking through to the Third Layer of the Condensation Spirit Realm.<br/><br/>If only he had two more months, he would certainly have made the breakthrough to the Third Layer of the Condensation Spirit Realm. Unfortunately, the Zhui Tian Secret Realm was about to open.<br/><br/>Fang Hanyu began to speak of the Great Abyss Gate’s attitude towards the Zhui Tian Secret Realm.<br/><br/>Ever since the great battle with the Chi Devil Sect, the Grand Qi Cultivation Realm had grown wary of Heaven’s Larceny Saint Sect and cultivators from other realms. The strength of the man with white hair and the man in purple was so formidable that, had Fang Wang not intervened, they could have swept through the Grand Qi Cultivation Realm on their own. Thus, the various sects decided to send their disciples out for experience, and just as news of the Zhui Tian Secret Realm reached the heart of Grand Qi, all the major sects set their sights on the realm.<br/><br/>The first reason was to compete for opportunities, and the second was to gauge how the strength of the Grand Qi Cultivation Realm compared with the other dynasties.<br/><br/>Fang Hanyu and his companion had already been there for more than a month.<br/><br/>According to them, talents from the Seven Dynasties had gathered, and Zhui Tian City was experiencing an unprecedented level of activity. In order to secure the safety of Zhui Tian City, various sects and families from the Grand Wei Cultivation World had arrived. Without exaggeration, the current strength within Zhui Tian City represented seventy percent of power of the Grand Wei Cultivation World.<br/><br/>“Zhui Tian City’s Lord Hu Pomo has announced that he will also participate in the Zhui Tian Secret Realm, which means that Great Cultivators from the Seven Dynasties might also join,” Fang Zigeng expressed his worries.<br/><br/>Competing with Great Cultivators for opportunities felt very dangerous to him, yet Zhou Xue had insisted on his coming.<br/><br/>Fang Hanyu, on the other hand, was unafraid. “The Zhui Tian Secret Realm is said to be even vaster than the Great Saint’s Grotto-Heaven. We’ll be fine as long as we don’t confront the Great Cultivators head-on.”<br/><br/>Xiao Zi leaned in, asking curiously, “What are the targets of the Great<br/><br/>Cultivators from the Seven Dynasties? Has any news spread?”<br/><br/>Fang Hanyu pondered for a moment and said, “The Grand Chu Dynasty seems to be searching for a Magical Artifact that surpasses the exceptional grade. Apart from that, I’ve heard no other news.”<br/><br/>Fang Wang didn’t seem to care. He joked, “Once inside the Zhui Tian Secret Realm, I must act alone. You guys better not die in there. Be careful and know your limits.”<br/><br/>Fang Hanyu nodded, “Don’t worry. Unlike you, who’s constantly in secluded cultivation, Zigeng and I often embark on adventures. Especially Zigeng, his skills for survival far exceed mine.”<br/><br/>Hearing this, Fang Zigeng gave an awkward smile, unused to being praised so highly.<br/><br/>The three brothers continued their conversation.<br/><br/>Two hours later, Fang Hanyu and Fang Zigeng took their leave. Fang Wang wanted to ask them to stay, but they didn’t want to interfere with his cultivation.<br/><br/>After the door closed, Zhao Zhen emerged from the Soul Devouring Gourd, his face serious. “That man named Fang Zigeng has a very strong soul force. Perhaps the treasure he spoke of is a Ghost Instrument even more powerful than the Soul Devouring Gourd.”<br/><br/>Fang Wang resumed his meditation on the bed and softly laughed, “Isn’t that a good thing? It means my clan members also have their own fortunes.”<br/><br/>He had always been hopeful about Fang Zigeng.<br/><br/>Fang Zigeng was the most diligent and modest among the Fang Family Disciples. Fang Wang felt reassured knowing that such a clan member was growing stronger.<br/><br/>If the Fang Family wants to become a truly powerful cultivation household, it can’t depend on just him alone.<br/><br/>Zhao Zhen couldn’t help but regard Fang Wang more highly. Perhaps this confidence was the pride of possessing the Heaven Yuan Spirit Treasure, having no fear of being surpassed by those around him.<br/><br/>Soon after, Fang Wang closed his eyes and waited for the opening of the Zhui Tian Secret Realm.<br/><br/>Two days later, a deafening drumming sound rang out across Zhui Tian City, like the drums of war, striking at the heart of everyone, waking all those who were meditating or sleeping.<br/><br/>Fang Wang did the same, beginning to pack his things.<br/><br/>Xiao Zi was already excited, asking, “Master, will you use a pseudonym once you enter the secret realm?”<br/><br/>“Of course not. A true gentleman leaves his name wherever he goes; I won’t change my name or my nature. And at such a grand event, I want to win glory for Grand Qi,” Fang Wang replied casually.<br/><br/>The moniker ‘White Garment Astonishing Swan’ was not a name he chose for himself; he wore a mask in the past only because he was not strong.<br/><br/>Now that he was powerful, there was no reason for timidity. What would be the point of achieving immortality in this life if he still had fears?<br/><br/>Zhao Zhen exclaimed with a sigh, “I am starting to look forward to you sweeping through the cultivators from the Seven Dynasties.”<br/><br/>Once the Emperor of Grand Qi, he naturally felt delighted hearing Fang Wang’s desire to win glory for Grand Qi.<br/><br/>Shortly, Fang Wang stepped out of his dwelling.<br/><br/>As soon as he left, he saw his next-door neighbor, Hu PO Xie.<br/><br/>The City’s Lord was named Hu Pomo; was this Hu PO Xie his brother?<br/><br/>No wonder he could afford such a high-end dwelling.<br/><br/>“Brother Fang, shall we go together?” Hu PO Xie asked with a smile.<br/><br/>This time, Fang Wang did not refuse, taking the opportunity of Hu PO Xie showing the way.<br/><br/>That moment, the door of another dwelling opened, and a girl in yellow walked out. Small and delicate, with long hair tied into two braids that fell over her shoulders, her face was playful and cute. She stretched her arms, displaying her white wrists, adorned with a red jade bracelet on each.<br/><br/>“Miss Yang, would you like to join us?” Hu PO Xie asked with a smile.<br/><br/>The girl in yellow glanced at him, nodded, and then turned to Fang Wang, asking, ‘My name is Yang Jiner, what’s yours?”<br/><br/>“Fang Wang, ” he replied.<br/><br/>He couldn’t see through Yang Jiner’s cultivation level, suggesting that she possessed some spell for concealing her aura. At the very least, Yang Jiner didn’t pose any danger to him.<br/><br/>Yang Jiner responded and then closed her door, urging Hu PO Xie to lead the way.<br/><br/>Hu PO Xie suddenly laughed, though it was unclear what amused him.<br/><br/>Afterward, Fang Wang followed the two of them out of the cultivation tower, heading toward the riverbank.<br/><br/>On both banks of the Wei River, there was a sea of people—an incredibly lively scene. Fang Wang had never before seen so many cultivators gathered together, making the battle against Green Cicada Valley and Chi Devil Sect seem less impressive by comparison.<br/><br/>Yang Jiner marveled, “So many people, have all the cultivators from Grand Wei come?”<br/><br/>Hu PO Xie laughed, “This exploration of the secret realm is indeed different from the past. As cultivators from the other six dynasties have arrived, Grand Wei has to pay more attention.”<br/><br/>Yang Jiner teased, “Aren’t you afraid that other dynasties will show off their power?”<br/><br/>“Regardless, this display of might ensures that Zhui Tian Secret Realm’s reputation is now established. This bodes well for all of Grand Wei,” Hu PO Xie replied.<br/><br/>Fang Wang, wearing his bamboo hat, did not join in their conversation. His gaze swept around, and he quickly located the Tai Yuan Sect group.<br/><br/>Fang Hanyu and Fang Zigeng were among them. Fang Wang had not instructed them to conceal his arrival, so now the Tai Yuan Sect disciples were all looking around, clearly searching for him.<br/><br/>Before long, Hu PO Xie and Yang Jiner turned their conversation to the genius individuals participating in this exploration of the Zhui Tian Secret Realm.<br/><br/>The names Liang Xunqiu and Xu Qiuming came up repeatedly. Yang Jiner seemed unfamiliar with the influential figures of the Seven Dynasties, and she kept asking questions.<br/><br/>Hu PO Xie did not mention Fang Wang, and from just that, Fang Wang knew that the other party believed he was indeed Fang Wang of Grand Qi—after all, the cultivators around them were talking, and Fang Wang’s name had been mentioned more than a few times.<br/><br/>The more Xu Qiuming showcased his strength, the more remarkable Fang Wang seemed in comparison.<br/><br/>Xu Qiuming was recognized as the second greatest talent of Grand Qi, and even he had admitted that he was no match for Fang Wang.<br/><br/>Fang Wang’s reputation in Zhui Tian City owed much to Xu Qiuming’s influence.<br/><br/>“Fang Wang? They’re not talking about you, are they?” Yang Jiner suddenly turned to Fang Wang and inquired, her eyes wide and sparkling with curiosity.<br/><br/>Fang Wang just smiled and did not respond.<br/><br/>Yang Jiner didn’t say anything more, but her eyes wandered, clearly deep in thought.<br/><br/>Hu PO Xie looked at Fang Wang and asked with a smile, “After entering the secret realm, what does Brother Fang plan to do?”<br/><br/>Fang Wang smiled, “I’m used to being free. I plan to act alone, but if I happen to encounter Brother Hu in trouble, I’ll lend a hand, as thanks for showing the way.”<br/><br/>Hu PO Xie did not feel slighted, and he waved his hand, laughing, “It’s nothing, hardly worth mentioning, but having Brother Fang’s word makes me feel more at ease. If it were just a comparison among the talents of various dynasties, I wouldn’t be concerned, but now that the older generation of great cultivators have joined, this exploration of the Zhui Tian Secret Realm might be quite troublesome.”<br/><br/>Fang Wang nodded and made a non-committal reply.<br/><br/>He could hardly wait any longer.<br/><br/>No fame or fortune could compare to Heavenly Gang Saint Body Technique!<br/><br/>The more he thought about it, the more Fang Wang anticipated the effects of combining all Three Great True Cultivations.<br/><br/>Time continued to pass.<br/><br/>Hu PO Xie and Yang Jiner continued their intermittent conversation, their enthusiasm for the topic diminishing, clearly just as eager for the Zhui Tian Secret Realm as Fang Wang.<br/><br/>The mysterious drumming echoed incessantly, rising and falling on either side of the river.<br/><br/>Half an hour later, a number of figures flew from the direction of the city lord’s mansion—dozens of them, with one particularly imposing figure at the forefront. In Fang Wang’s perception, this person should possess the cultivation level of the fourth or fifth layer of the Condensation Spirit Realm, the most powerful presence among the group.<br/><br/>Listening to the discussions around him, Fang Wang learned of the man’s identity.<br/><br/>City Lord, Hu Pomo!<br/><br/>As Hu Pomo appeared, Hu PO Xie next to Fang Wang fell silent, his gaze toward Hu Pomo was quite uncomfortable.<br/><br/>Hu Pomo stopped above the Wei River, his followers dispersing behind him, arranged in rows like a military formation.<br/><br/>“Fellow Daoists from the Seven Dynasties, there is a stick of incense’s time before the opening of the Zhui Tian Secret Realm. I am Hu Pomo, the city lord of Zhui Tian City, in charge of overseeing this exploration,” Hu Pomo announced. His voice was loud and clear, resonating like a lion’s roar with definitive authority.<br/><br/>“Since this is the first time that the exploration of the secret realm is open to the other six dynasties, in order to prevent the friendship among the seven dynasties from being damaged, I have taken the liberty of setting a few rules.”<br/><br/>Upon hearing that he would be setting rules, the majority of cultivators displayed expressions of disdain.<br/><br/>Such tricks were commonplace, merely veiled in fine words. They seemed to be for the greater good, but in truth, they served to avoid trouble. By establishing rules in advance, Hu Pomo could wash his hands of any responsibility should anyone die, later asserting that losses were too great for Zhui Tian City to manage.<br/><br/>Listening, Fang Wang thought the rules sounded similar to those of past explorations of Great Saint’s Grotto-Heaven.<br/><br/>The gist was that whatever happened within the secret realm should not lead to grudges spilling outside, and that the competition for opportunities was entirely dependent on one’s strength.<br/><br/>After laying down the rules, Hu Pomo began to introduce the Zhui Tian Secret Realm.<br/><br/>The time of one stick of incense quickly elapsed.<br/><br/>Suddenly, a rainbow radiance surged at the end of the cliffs, where the river dropped off, and Hu Pomo called out loudly, “My friends, follow me into the realm!”<br/><br/>Nearly a hundred thousand cultivators immediately took flight, an awe-inspiring sight. They spontaneously followed behind Hu Pomo and the others, heading towards the Zhui Tian Waterfall.<br/><br/>Diving down the cliffs, a rainbow radiance could be seen shining from the middle of the Zhui Tian Waterfall, gleaming brightly.<br/><br/>Hu Pomo was the first to plunge into the waterfall, followed by other cultivators in droves, like carps crossing a river.<br/><br/>Fang Wang flew amidst the throng, looking down, he could feel an impressive spiritual energy emanating from the Zhui Tian Secret Realm.<br/><br/>This spiritual energy was purer than any he had absorbed in the cultivation tower or within the Tai Yuan Sect. Just feeling it from a distance refreshed his spirit. Not only him, but the other cultivators felt the same way, and all began to speed up their flight..\t\t\t\t\t\t</div>", "images": {}, "success": true}