{"id": 117, "url": "https://www.novelhall.com/i-became-an-immortal-on-mortal-realm-32879/14296062.html", "title": "Chapter 117 - Chapter 117: Chapter 114: The Heavenly Gang Saint Body Technique, Success!", "volume": 2, "volume_title": "Volume 2", "body": "<h1>Chapter 117 - Chapter 117: Chapter 114: The Heavenly Gang Saint Body Technique, Success!</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 117: Chapter 114: The Heavenly Gang Saint Body Technique, Success!<br/><br/>Translator: 549690339<br/><br/>Fang Wang activated the Combat Heart, wholeheartedly perusing the cultivation methods of the Heavenly Gang Saint Body Technique, blocking out the conversation of the white-haired old man, Xiao Zi, and Zhao Zhen.<br/><br/>After a while of discussing Zhu Changsheng, Xiao Zi and Zhao Zhen began to seriously delve into the Heavenly Gang Saint Body Technique.<br/><br/>The white-haired old man gazed at Fang Wang, while stroking his beard and maintaining a smile, seemingly lost in thought.<br/><br/>Days passed by, one by one.<br/><br/>Seven days later.<br/><br/>Fang Wang still had no clue. This cultivation technique was too chaotic; he had tried many sequences of memory but had failed in all of them.<br/><br/>Xiao Zi was on the verge of collapse and exclaimed, “There’s not a single hint, how are we supposed to practice this? Even if I get on the right track, I’m still afraid of deviating into madness!”<br/><br/>Zhao Zhen closed his eyes, striving to calm his mind.<br/><br/>The white-haired old man meditated at the entrance of the palace, also with closed eyes, indifferent to Xiao Zi’s complaints.<br/><br/>Xiao Zi flew in front of him and asked, “Old man, how many years did it take<br/><br/>Zhu Changsheng to truly begin cultivating the Heavenly Gang Saint Body<br/><br/>Technique?”<br/><br/>Without opening his eyes, the white-haired old man said, “It must have been a hundred years.”<br/><br/>“What! A hundred years!”<br/><br/>Xiao Zi cried out in shock and frustration, then turned and said, “Young Master, we don’t have much time, the Zhui Tian Secret Realm is only open for one month.”<br/><br/>The white-haired old man chuckled, “Don’t worry, while you’re here, you won’t be expelled.”<br/><br/>“Then if my Young Master learns it in ten years, wouldn’t we have to wait another ten years for the Zhui Tian Secret Realm to open again?”<br/><br/>“Hm, you make a very valid point.”<br/><br/>Xiao Zi was nearly driven to anger and turned its gaze back to Fang Wang.<br/><br/>Fang Wang answered calmly, “Don’t worry, this secret realm cannot trap me; I could break through the realm’s space with a single punch.”<br/><br/>The white-haired old man’s face twitched, he opened his eyes, and looked deep into Fang Wang, saying, “Don’t be rash, if it comes to it, I’ll let you out…”<br/><br/>Xiao Zi’s snake eyes widened in astonishment and asked, “You have that ability?”<br/><br/>“Of course, I am the Artifact Spirit of the Zhui Tian Secret Realm! I can open it when I want, close it when I want!”<br/><br/>“Tsk, tsk…”<br/><br/>Although Xiao Zi was just a snake that hadn’t taken human form, its gaze made the white-haired old man feel the contempt.<br/><br/>Suddenly recalling something, Xiao Zi curiously asked, “The Artifact Spirit of the Great Saint’s Grotto-Heaven, do you know them?”<br/><br/>The white-haired man revealed a smile and said, “Of course, we were colleagues.”<br/><br/>“What do you mean?”<br/><br/>“All of us were important cultivators under His Majesty’s command. Before His Majesty perished, he integrated our souls into his Lifespirit Treasures, granting us immortality. As to why He wished for us to be immortal, that I cannot tell you.”<br/><br/>Xiao Zi was astonished by the white-haired old man’s words, and even Zhao Zhen turned to look at him.<br/><br/>Zhao Zhen asked out of curiosity, “How many Lifespirit Treasures did the Great<br/><br/>Saint have?”<br/><br/>The white-haired old man raised his hand and showed four fingers, saying, “He had nine in total, truly peerless through the ages. There probably hasn’t been a genius born with Nine Lives Precious Spirits in the Mortal Realm nowadays, has there?”<br/><br/>Upon hearing this, Xiao Zi and Zhao Zhen couldn’t help but look towards Fang Wang.<br/><br/>Xiao Zi knew that Fang Wang possessed four Lifespirit Treasures, which is why it felt proud, believing it had chosen the right person to follow.<br/><br/>Zhao Zhen, on the other hand, was curious. Along the way, the Magic Artifacts Fang Wang had used seemed somewhat like Lifespirit Treasures…<br/><br/>Seeing this, the white-haired old man also looked towards Fang Wang.<br/><br/>Fang Wang ignored them and continued to study the Heavenly Gang Saint Body Technique.<br/><br/>He refused to believe in curses!<br/><br/>He would keep trying and failing until he found the correct method of cultivation. With the Heavenly Palace at hand, he would eventually discover the right way!<br/><br/>And so, time continued to pass.<br/><br/>The underground palace lacked the sun and the moon, making it easy to lose track of time.<br/><br/>“The Zhui Tian Secret Realm should be ending. Let’s drive out those mortals first.<br/><br/>The white-haired old man spoke up and then snapped his fingers.<br/><br/>There were no changes in the underground palace, and Fang Wang, Xiao Zi, and Zhao Zhen couldn’t feel any changes in the Zhui Tian Secret Realm. “Stop daydreaming. I must master it; otherwise, I won’t leave!”<br/><br/>Fang Wang took a deep breath and quietly said, his gaze turning steadfast.<br/><br/>Upon hearing this, Xiao Zi quickly said, “No worries, Young Master, take your time. We’re not in a rush.”<br/><br/>It had already given up on the Heavenly Gang Saint Body Technique. Just looking at the characters on the wall made it feel dizzy.<br/><br/>Can’t read it, can’t read it!<br/><br/>It decided to go out for a stroll and even thought about asking the white-haired old man to show it around.<br/><br/>With someone to accompany, even though it was a demon, the white-haired old man found it interesting and thus left with Xiao Zi.<br/><br/>Zhao Zhen came to his senses and promptly made the Soul Devouring Gourd follow.<br/><br/>The Heavenly Gang Saint Body Technique was too difficult; he had given up as well.<br/><br/>Even if he comprehended it thoroughly, as a ghost, he wouldn’t be able to practice it.<br/><br/>And so, the hall fell into silence, with Fang Wang continuing his research. It had taken him more than three hundred years to master the Mountain River Town Heaven Fist, and now his resolve was as firm as rock, not achieving results in a short time would not make him anxious.<br/><br/>Thus, day by day, Fang Wang would memorize several sequences. It’s worth noting that this was tens of thousands of characters, and to find the right sequence was no simple task of shuffling a few lines of text.<br/><br/>As he memorized, he also forgot, gradually entering an indescribable state.<br/><br/>At first, he thought it was the effect of the Combat Heart.<br/><br/>But later, without realizing it, he had turned off the Combat Heart, yet that profound feeling remained.<br/><br/>Zhui Tian City was bustling with life.<br/><br/>Six days had passed since the Zhui Tian Secret Realm closed. Many cultivators were still lingering, seeking news.<br/><br/>The final battle involving Fang Wang, Xiao Chen, Lanxin Xianzi, and Liang Xunqiu was widely discussed. The cultivators were all curious about who won, but the four were nowhere to be found, leaving the inquisitive cultivators without answers.<br/><br/>Apart from that, there were many other stories about great cultivators’ duels spreading around. Among the younger generation, Xu Qiuming’s name stood out the most.<br/><br/>In a battle, he unexpectedly advanced to the Condensation Spirit Realm, and that too while singlehandedly opposing two Great Cultivators of the same realm. After his breakthrough, he even brutally killed those two Great<br/><br/>Cultivators, an exaggeration unheard of by the cultivators within Zhui Tian City.<br/><br/>Sword transcends Heaven’s Origin!<br/><br/>This was the Cultivators of the Seven States’ evaluation of Xu Qiuming. Aside from Grand Qi, the other six states had not witnessed Fang Wang’s power, and since the cultivators from Grand Qi had not seen Fang Wang face off against Xu Qiuming, they all believed Xu Qiuming had transcended the rank of Lifespirit Treasure with his mastery of Sword Dao, reaching the peak talent of his era.<br/><br/>On a loft by the river, Tai Yuan Sect Disciples gathered.<br/><br/>One disciple said to Ye Xiang, “We haven’t found Fang Wang, and no one has seen him come out of the Zhui Tian Secret Realm.”<br/><br/>Everyone had emerged from the Zhui Tian Waterfall, making it easy to locate the person they sought after; however, Fang Wang’s cultivation was exceptional, and he might have left before them, quickly departing, so they were inquiring everywhere.<br/><br/>Yan Feiyue frowned and said, “He couldn’t have failed to come out, could he?”<br/><br/>Fang Hanyu shook his head, “Impossible. We were all forced out. Fang Wang must have left early. He definitely made a discovery and wanted to cultivate as soon as possible without disturbance.”<br/><br/>A female disciple worriedly said, “His opponents were Liang Xunqiu, Xiao Chen, and Lanxin Xianzi. It’s said that those three are also missing. Nothing bad happened, right?”<br/><br/>Fang Hanyu’s sword-like eyebrows tightened as well.<br/><br/>Zhou Bo laughed and said, “Hey, hey, what are you talking about? That’s Senior Brother Fang Wang. How could anything happen to him? Even if he didn’t come out, he must have found a great opportunity. Remember how Green Cicada Valley’s attack on Brother Fang was crushed? And the battle with the Chi Devil Sect where those two cultivators were so badly beaten by Xu Qiuming, only to be effortlessly killed by Brother Fang!”<br/><br/>“Anyone might die, but not Senior Brother Fang. If anyone in this world could become an Immortal, my bet is on Brother Fang being the most hopeful!”<br/><br/>Hearing his words, the disciples thought carefully and found them reasonable.<br/><br/>Having lived for so long, even after coming to Zhui Tian City, they had never seen a talent like Fang Wang.<br/><br/>Thinking back on Fang Wang’s growth, the disciples became more excited and soon stopped worrying, instead looking forward to what kind of fortune Fang Wang would gain.<br/><br/>Fang Hanyu chuckled at himself.<br/><br/>What am I worried about?<br/><br/>I seem to have less faith in Fang Wang than the disciples from the third branch.<br/><br/>Meanwhile, the powers that Liang Xunqiu, Xiao Chen, and Lanxin Xianzi belonged to began to worry. They were certain these four had not left the Zhui Tian Secret Realm!<br/><br/>Could they have perished together?<br/><br/>This made the three powers panic. Liang Xunqiu was the top genius of Grand Chu, and Xiao Chen and Lanxin Xianzi were sect leaders of their respective forces. How could they not be alarmed?<br/><br/>The underground palace was timeless.<br/><br/>When the white-haired elder, Xiao Zi, and Zhao Zhen returned, Fang Wang was still engrossed in his research.<br/><br/>The white-haired elder smiled, sitting at the doorway, thought to himself:<br/><br/>“You rascal, let’s see how many years it will take you to master the Heavenly Gang Saint Body Technique.”<br/><br/>Fang Wang’s previous fist-clench had already proven his talent, and now the elder was curious how many years it would take for Fang Wang to find the method and how many years to completely master it.<br/><br/>Fang Wang was utterly immersed, with the characters on the walls seeming to float about, constantly shifting their positions in his eyes.<br/><br/>Xiao Zi lay on the ground, flicking her snake tongue, saying, “It’s been almost half a year already, it seems like we’ll be waiting a long while.”<br/><br/>Zhao Zhen was more accepting, laughing, “Anyway, I am a ghost, already dead. And you, a demon with a long life; this is a good chance for you to cultivate more.”<br/><br/>He was eagerly anticipating Fang Wang’s mastery of the Heavenly Gang Saint Body Technique, even if it took hundreds of years.<br/><br/>As long as Fang Wang could master it, his worst future achievement would be as Zhu Changsheng!<br/><br/>Fang Wang didn’t hear their conversation; he had blocked out his hearing.<br/><br/>Half a year passed, and his memory speed significantly increased. Now he could switch between at least ten different memory sequences in an hour and, as if guided by some pattern, he appeared to have found a rule, like solving a Rubik’s cube, and was immersed in it, looking forward to unveiling the correct answer.<br/><br/>Time continued to pass, faster and faster.<br/><br/>About another three months had gone by.<br/><br/>Fang Wang suddenly sat up straight, the hundreds of thousands of characters in his eyes rearranging themselves before bursting into a golden light, which shone into his pupils.<br/><br/>His vision spun wildly, and he blinked subconsciously. When he opened his eyes again, he was already inside the Heavenly Palace!<br/><br/>With a thought, the surroundings in the Heavenly Palace changed to mimic Fang Residence, confirming he had truly entered the Heavenly Palace.<br/><br/>He stood up and stretched.<br/><br/>The past half year of focus made him feel as though he had been away for an eternity.<br/><br/>Revisiting the Heavenly Gang Saint Body Technique in his mind, a smile gradually spread across his face.<br/><br/>The long-desired Heavenly Gang Saint Body Technique was finally his!<br/><br/>This was an opportunity even Zhou Xue in her previous life had not obtained!<br/><br/>Considering Lord Demon of the Jin Xiao Sect’s performance, Zhou Xue’s power was unfathomable. Although they were betrothed, Fang Wang still harbored a sense of competition in his heart.<br/><br/>He, too, wanted to protect Zhou Xue, not just be taken care of by her!\t\t\t\t\t\t</div>", "images": {}, "success": true}