{"id": 118, "url": "https://www.novelhall.com/i-became-an-immortal-on-mortal-realm-32879/14296063.html", "title": "Chapter 118 - Chapter 118: Chapter 115: The Great Perfection Of Heavenly Gangs, Physical Body Perfection", "volume": 2, "volume_title": "Volume 2", "body": "<h1>Chapter 118 - Chapter 118: Chapter 115: The Great Perfection Of Heavenly Gangs, Physical Body Perfection</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 118: Chapter 115: The Great Perfection of Heavenly Gangs, Physical Body Perfection<br/><br/>Translator: 549690339<br/><br/>Standing inside the Heavenly Palace, Fang Wang did not start his cultivation immediately but walked around to calm himself down.<br/><br/>For the past half-year, he had been too focused, causing him now to need some time to empty his mind.<br/><br/>What the Heavenly Palace had in abundance was time.<br/><br/>Fang Wang imagined the power of the Heavenly Gang Saint Body Technique and transformed it into motivation for cultivation.<br/><br/>Several hours later, he began to meditate and practice the Heavenly Gang Saint Body Technique; the surging spiritual energy from nature flooded into him as he recalled the correct methods of circulating the technique in his mind.<br/><br/>The Heavenly Gang entailed condensing the thirty-six Heavenly Gang Star Acupoints in the flesh, absorbing nature’s spiritual energy through these acupoints, and then refining the body. Not only could it shape an even stronger body but it could also produce greater power for combat.<br/><br/>This process was exceedingly difficult. The body’s acupoints were fixed, and to create thirty-six new acupoints was very likely to disrupt the balance and hard for the body to accept, thus requiring a lengthy time to attempt and stabilize.<br/><br/>Fang Wang had prepared himself mentally, knowing that the Heavenly Gang Saint Body Technique would certainly set a new record for the longest seclusion in the Heavenly Palace!<br/><br/>However, he still underestimated the difficulty of the Heavenly Gang Saint Body Technique.<br/><br/>Just the first Heavenly Gang Acupoint took him thirty years, which made him realize the severity of the situation!<br/><br/>At this point, he had no choice but to bury himself in cultivating.<br/><br/>He was determined to cultivate the Heavenly Gang Saint Body Technique to the Great Perfection, a state that perhaps not even the ancient Great Saint who created the technique had reached.<br/><br/>Great Perfection is the most flawless state of a cultivation technique, attainable only by those who devote their lives to studying a particular art to reach the state of Great Perfection.<br/><br/>Fang Wang consistently achieved the state of Great Perfection in various types of ultimate techniques, which allowed him to maintain a suppressive force against those of the same realm and a lethal force across realms.<br/><br/>The higher the realm, the more difficult it is to slay enemies across realms or even within the same realm; for this reason, cultivators must practice different spells.<br/><br/>With the Heavenly Palace at his disposal, Fang Wang was essentially doing things that he would have done at a later stage in the future.<br/><br/>After achieving the first Heavenly Gang Acupoint, the difficulty of continuing the practice wasn’t as great, giving Fang Wang some relief.<br/><br/>And so, the years passed by swiftly.<br/><br/>Under the environment of the Fang Residence, Fang Wang’s state of mind remained well composed. Now, even a hundred years of seclusion wouldn’t make him irritable.<br/><br/>Time flew by.<br/><br/>Five hundred years later, Fang Wang refined twenty-five Heavenly Gang Acupoints. Even though he could clearly feel the transformation of his physical body, he still couldn’t control his emotions.<br/><br/>Doing one thing continuously was truly tedious!<br/><br/>Initially, he could entertain himself with practices like the Heavenly Palace Halberd or swordsmanship, but now, nothing interested him.<br/><br/>Couldn’t the damnable Heavenly Palace conjure up a person for him to chat with?<br/><br/>Fang Wang took a deep breath and could only activate his Combat Heart to continue the tedious cultivation.<br/><br/>Combat Heart allowed him to let go of distracting thoughts, but such a state greatly consumed spiritual power and wasn’t suitable for prolonged use.<br/><br/>In the blink of an eye.<br/><br/>Another three hundred years had passed, and Fang Wang refined all thirty-six Heavenly Gang Acupoints, achieving the Heavenly Body. His physical strength skyrocketed, his vitality surged like a fierce beast, yet he did not leave the Heavenly Palace.<br/><br/>He had merely cultivated it; he had not yet reached the perfect state!<br/><br/>Having gotten this far, Fang Wang felt that the end was near, and his numb heart finally began to stir as he started to look forward to the Heavenly Gang Saint Body in the state of Great Perfection.<br/><br/>Time raced on.<br/><br/>The time it took for the Heavenly Gang Saint Body to evolve from Great Completion to Great Perfection once again disappointed Fang Wang.<br/><br/>By the time he fully cultivated the Heavenly Gang Saint Body Technique to the state of Great Perfection, he looked back and realized that nine hundred and sixty years had passed since he entered the Heavenly Palace!<br/><br/>Mortals could only live for a few decades, rarely exceeding a century, while those in the Condensation Spirit Realm could live past five hundred years, which was already considered long-lived. Cultivators of the Condensation Spirit Realm need to gather Qi and take action; a lifetime’s worth of cultivation time, when meticulously calculated, is difficult to exceed three hundred years.<br/><br/>This means cultivators of the Condensation Spirit Realm are impossible to cultivate the Heavenly Gang Saint Body Technique!<br/><br/>Fang Wang had no time to lament the difficulty mortals faced in pursuing cultivation as his consciousness gradually returned to reality.<br/><br/>The grand hall was silent.<br/><br/>An elderly man with white hair was meditating; Xiao Zi and Zhao Zhen were cultivating.<br/><br/>Fang Wang opened his eyes to see them and then closed them again. The fists resting on his legs involuntarily clenched.<br/><br/>Boom—<br/><br/>The entire underground palace suddenly trembled violently, a terrifying aura enveloping Xiao Zi, Zhao Zhen, and the white-haired elder.<br/><br/>The white-haired elder opened his eyes and looked at Fang Wang, hastily asking, “What’s wrong with you? Don’t be reckless!”<br/><br/>He thought Fang Wang might have become furious for not mastering the technique.<br/><br/>Xiao Zi, fanning the flames, said, “Young Master, destroy this palace. What kind of legacy is this, if not deliberately giving us a hard time?”<br/><br/>Anyway, it had already given up on the Heavenly Gang Saint Body Technique!<br/><br/>“Don’t be impulsive! This really isn’t a trick; the Heavenly Gang Saint Body Technique is indeed very difficult to learn. His Majesty set such a challenge surely for a deep reason!” the white-haired elder said urgently.<br/><br/>Fang Wang slowly relaxed his fists, and with his eyes still closed, said, “Indeed there is a deep reason. The thirty-six stars of the Heavenly Gang inherently have changes, yet they also maintain a certain pattern.”<br/><br/>Hearing this, the white-haired elder looked at Fang Wang with surprise.<br/><br/>These words…<br/><br/>Then Fang Wang slowly stood up and walked toward the palace gate.<br/><br/>Xiao Zi quickly hopped onto his shoulder, curiously asking, “Young Master, are we leaving now?”<br/><br/>“It’s rare for us to come here, let’s take a look around,”<br/><br/>Fang Wang said expressionlessly, and seeing his state, Xiao Zi’s snake eyes widened in surprise.<br/><br/>Could it be…<br/><br/>Zhao Zhen floated over; he also noticed something unusual about Fang Wang.<br/><br/>Fang Wang’s appearance had not changed, but his disposition was dramatically different, radiating an ineffable sense of vicissitudes. This kind of disposition was something Zhao Zhen had only seen in Guang Qiuxian, and even Guang Qiuxian could not compare to it.<br/><br/>At first glance, Fang Wang seemed to exude an extremely aged air.<br/><br/>Such a sense of twilight years was something a young shell could not conceal.<br/><br/>Fang Wang passed by the white-haired old man and made his way toward the staircase, step by step, as the white-haired old man quickly followed.<br/><br/>“Junior, have you forgotten your resolution? It hasn’t been long, not even a year, and you’re giving up already?” the white-haired old man scolded with a disappointed tone.<br/><br/>Fang Wang, without turning back, replied, “I haven’t forgotten.”<br/><br/>“Then why leave?”<br/><br/>“I’ve learned enough.”<br/><br/>“Learned… what? You’ve learned enough?”<br/><br/>The white-haired old man immediately materialized in front of Fang Wang,<br/><br/>his eyes wide open, staring intently at Fang Wang.<br/><br/>Fang Wang’s face was expressionless; his numb gaze landed on the old man, causing his heart to tremble.<br/><br/>Such eyes…<br/><br/>He had only seen them in old monsters who had lived for thousands of years…<br/><br/>He promptly stepped aside, not daring to block the path.<br/><br/>Fang Wang continued onward, and the white-haired old man followed at his side, pressing, “Have you truly learned it?”<br/><br/>Xiao Zi was so excited that his serpent body trembled, while Zhao Zhen looked incredulously at Fang Wang.<br/><br/>To master the Mountain River Town Heaven Fist was one thing, for Fang Wang might have previously learned something similar and grasped it through association. However, the Heavenly Gang Saint Body Technique was another matter entirely—Zhao Zhen was sure Fang Wang had no knowledge of it, otherwise, he wouldn’t have come such a long way in search of its legacy. And the inscriptions within that underground palace, weren’t they incredibly complex?<br/><br/>Fang Wang did not speak; instead, he activated the thirty-six Heavenly Gang acupoints within his flesh.<br/><br/>In an instant, an extremely domineering aura erupted from him. Nature’s spiritual energy flowed from the ground into his body, causing the entire underground space to tremble once again.<br/><br/>The white-haired old man’s eyes bulged as he saw Fang Wang, his body radiating white flames, causing his black robes to flutter.<br/><br/>“This aura… It can’t be wrong… Impossible… How could this…”<br/><br/>The white-haired old man’s lips quivered. It was not necessary to look at his reaction, for Xiao Zi and Zhao Zhen were already terrified.<br/><br/>The aura of the Heavenly Body was so powerful that it unsettled demons, and it struck terror into evil spirits.<br/><br/>What was crucial was that as Fang Wang absorbed more and more of nature’s spiritual energy, his aura continued to grow stronger!<br/><br/>The underground space began to collapse, which caused the white-haired old man to cry out in a panic, “Fine, fine, fine! I believe you, now stop it!”<br/><br/>Fang Wang did not heed him but transformed into a streak of white light and surged upward.<br/><br/>With a boom!<br/><br/>Fang Wang burst through the streets of the ancient city and flew high into the sky. His powerful aura caused the entire ancient city to start collapsing, creating massive cracks in the roads, while buildings collapsed one after another, throwing up clouds of dust.<br/><br/>The white-haired old man, Xiao Zi, and Zhao Zhen followed and flew out. They looked up at Fang Wang, each with a different expression on their face.<br/><br/>Fang Wang twisted his neck; he raised his right fist and punched towards the starry cosmos above.<br/><br/>Nature’s spiritual energy followed his fist, forming a visible wave of qi that forcefully pierced through the stars, revealing a huge hole beyond which lay the blue sky and white clouds.<br/><br/>Fang Wang immediately flew out, with Xiao Zi, Zhao Zhen, and the white-haired old man quickly following suit.<br/><br/>“Has your young master gone mad?” the white-haired old man asked in frustration.<br/><br/>Xiao Zi retorted indignantly, “Isn’t it because of the test your emperor set up? If it were you, wouldn’t you go mad?”<br/><br/>The white-haired old man was so vexed he cursed, “But it hasn’t even been a year! What poor mettle he has!”<br/><br/>“Poor mettle? Watch your tongue, or my young master’s fist might land on you, old donkey, and we’ll see if your soul can withstand it!”<br/><br/>The white-haired old man realized he couldn’t out-argue a demon snake.<br/><br/>Preposterous!<br/><br/>Meanwhile, Fang Wang returned to the Zhui Tian Secret Realm. He landed on a mountaintop and let out a furious roar.<br/><br/>His bellow echoed throughout the Zhui Tian Secret Realm, startling the various demonic beasts and ghosts.<br/><br/>After howling for a long while, Fang Wang finally felt exhilarated!<br/><br/>He had been repressed for far too long and needed to vent!<br/><br/>He glanced with the corner of his eye, and saw that the white-haired old man, Xiao Zi, and Zhao Zhen had already arrived not far away in mid-air.<br/><br/>“There should be existences beyond the Condensation Spirit Realm in this secret realm! Call them out; I’d like to test my Heavenly Gang Saint Body!” Fang Wang stated, his voice cold. He was not actually hostile towards the white-haired old man; it was just that sitting stagnant for nine hundred and sixty years had filled him with resentment, and he longed to vent it properly.<br/><br/>To prevent harming them, Fang Wang was doing his utmost to restrain his emotions.<br/><br/>The white-haired old man intended to admonish him, but upon meeting Fang<br/><br/>Wang’s gaze, he hastily said, “Naturally, there is. Within the Zhui Tian Secret Realm, there are army spirits from an old legion of His Majesty, and its general is at the Cross-Void Realm Ninth Level. I will summon him forthwith.”<br/><br/>As the words fell, the white-haired old man’s lips moved slightly as if chanting a spell.<br/><br/>Before long, the ground trembled, and a formidable presence rolled in from the horizon, followed by shouts that grew louder, reminiscent of thousands of troops charging forth.<br/><br/>“Kill!<br/><br/>“Kill!<br/><br/>“Kill!<br/><br/>Throughout the heavens and earth, the battle cries of thousands resounded, striking terror into the heart, with Xiao Zi and Zhao Zhen hurriedly moving closer to Fang Wang..\t\t\t\t\t\t</div>", "images": {}, "success": true}