{"id": 110, "url": "https://www.novelhall.com/i-became-an-immortal-on-mortal-realm-32879/14294784.html", "title": "Chapter 110 - Chapter 110: Chapter 107: The Grand Event Of The Seven Dynasties, A Gathering Of Geniuses (Third Update)", "volume": 2, "volume_title": "Volume 2", "body": "<h1>Chapter 110 - Chapter 110: Chapter 107: The Grand Event Of The Seven Dynasties, A Gathering Of Geniuses (Third Update)</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 110: Chapter 107: The Grand Event of the Seven Dynasties, A Gathering of Geniuses (Third Update)<br/><br/>Translator: 549690339<br/><br/>“Brother Fang Wang, you must also be here for the Zhui Tian Secret Realm, right? To be able to stay in such a Cave Heaven in advance, it seems that Brother Fang Wang’s background is no ordinary matter. Could it be that you come from the Fang Family of Grand Wei?” Hu PO Xie asked curiously.<br/><br/>Fang Wang nodded and said, “This is indeed my first time participating in the Zhui Tian Secret Realm. Before this, I was in secluded cultivation. Now, I’m preparing to go out for a walk and see if I can gather any useful information.”<br/><br/>He gauged Hu PO Xie’s cultivation level.<br/><br/>Third level of the Profound Heart Realm!<br/><br/>Impressive!<br/><br/>He must also be a talented individual.<br/><br/>“Is that so? Then it seems Brother Fang and I are alike. I have always been cultivating within my family clan since I started my practice. Since that’s the case, why don’t we explore together? Later, when we enter the Zhui Tian Secret Realm and run into each other, we can look out for each other,” Hu PO Xie said with an enthusiastic smile.<br/><br/>Fang Wang feigned difficulty and responded, “Honestly, besides scouting for information, I have a personal matter to attend to.”<br/><br/>Upon hearing this, Hu PO Xie could only express his regret, insisting no further. After exchanging a few more courteous words, the two left together flying out of the corridor window.<br/><br/>Fang Wang landed swiftly on a street and strolled forward.<br/><br/>Zhui Tian City spanned tens of miles, with numerous streets. Here there were cultivators as well as mortals, and even the mortals were those who aspire to tread on The Path of Immortality.<br/><br/>From this point of view, Grand Wei could indeed be superior to Grand Qi, with an even more intense atmosphere for cultivation.<br/><br/>Fang Wang blended into the crowd with Xiao Zi perched on his shoulder. Along the way, they didn’t attract much attention; after all, keeping a snake was not unusual. He saw someone with scorpions crawling all over their body and another leading a two-headed lion, with all sorts of bizarre demon pets present.<br/><br/>At the same time.<br/><br/>In a pavilion by the river, a group of young cultivators gathered, among them were Ye Xiang and Xu Qiuming.<br/><br/>Xu Qiuming sat at the table sipping tea, his gaze fixed on a leaf boat on the Wei River. The river was vast and the currents swift; the wood boat on the river’s surface was truly insignificantly small, as if it could be swallowed by the water at any moment. However, the boat did not follow the swift current and remained stationary there.<br/><br/>Ye Xiang sat nearby. There were five individuals sitting at the table, all of them talented disciples from great sects, with cultivations all above the Profound Heart Realm. As for the other disciples, some were meditating on the spot, while others stood at the window admiring the view.<br/><br/>Suddenly, one of them asked, “What do you think, will Fang Wang come? He has been missing for a year now; what matter is worth him vanishing for so long?”<br/><br/>Upon hearing this, everyone turned to Ye Xiang, who, coming from the Great Abyss Gate, would have the clearest idea.<br/><br/>Ye Xiang answered, “Who knows? But do you wish for him to come, or not?” This question, however, left everyone in silence.<br/><br/>Xu Qiuming spoke up, “Naturally, we hope for his arrival. Don’t forget, our presence here is not solely for our personal fortunes but also to ascertain the situation in Grand Wei. Wouldn’t it be glorious for Grand Qi if someone were to dominate over the heroes of Grand Wei?”<br/><br/>As soon as he said this, everyone felt it made sense and echoed in agreement. “If Fang Wang arrives, who could stop him?”<br/><br/>“Hahaha, now that you mention it, I’m actually looking forward to it.”<br/><br/>“Actually, even if Fang Wang doesn’t come, Xu Qiuming himself is eligible.<br/><br/>Don’t forget, Lv Changge is himself one of the top Great Cultivators in the<br/><br/>Grand Wei Cultivation World.”<br/><br/>“Yes, defeating a Great Cultivator in the Condensation Spirit Realm with just a<br/><br/>Profound Heart Realm cultivation, does Grand Wei have such a talent?” “Looking at this, we really ought to fight for some honor.”<br/><br/>The cultivators discussed, even starting to think about how they would compete with the cultivators from Grand Wei.<br/><br/>Just then, a male cultivator leaped onto the pavilion and said urgently, “There’s been a change; sects from the Chu Dynasty have also arrived, and they even went to meet with the city lord. It’s unknown what they are discussing.”<br/><br/>The Chu Dynasty!<br/><br/>Everyone’s face fell.<br/><br/>The Chu was one of the top dynasties among the seven, far surpassing Grand Qi and Grand Wei in terms of cultivation atmosphere. A hundred years ago, Chu had already transformed into a Cultivation Dynasty.<br/><br/>If the Chu Dynasty was also participating in this opportunity for the secret realm, it would undoubtedly be a tremendous pressure for them.<br/><br/>Ye Xiang frowned and asked, “Strange, if we from Grand Qi have come, and<br/><br/>Grand Chu too, don’t you think there might be some conspiracy behind this?”<br/><br/>Xu Qiuming nodded and said, “It’s indeed possible. Grand Wei deliberately publicized the Zhui Tian Secret Realm, surely they have an ulterior motive. Moreover, there is still a year before the opening of the secret realm, and perhaps cultivators from other dynasties will arrive.”<br/><br/>Other dynasties!<br/><br/>The faces of the crowd grew more solemn.<br/><br/>Standing at the edge of the pavilion, Xu Tian Jiao couldn’t help but tease, “At that time, it wouldn’t be all the cultivators from the seven dynasties converging here, would it? If so, this would truly be a once-in-a-century grand event.”<br/><br/>She followed up by looking at Ye Xiang, saying, “Ye Xiang, why don’t you write to the Great Abyss Gate and ask them to send Fang Wang here — after all, there’s still a year left.”<br/><br/>The others thought it made sense and urged Ye Xiang one after another.<br/><br/>Ye Xiang hesitated for a moment but eventually nodded, deciding to seek help from the Great Abyss Gate.<br/><br/>Into the night, Fang Wang returned to his own Cave Heaven. As he was about to close the door, Xiao Zi suddenly said, “Master, why not let me wander outside? With Zhao Zhen’s company, and with my cultivation level, surely nothing will go wrong. I can even help you gather information while you focus on your cultivation.”<br/><br/>Hearing this made Fang Wang furrow his brow.<br/><br/>“Master, you saw today that there are quite a few demons moving through the city unaccompanied by their masters, and there are always cultivators patrolling within the city. I won’t run into trouble,” Xiao Zi coaxed.<br/><br/>Fang Wang thought for a while. He should indeed train Xiao Zi. Ever since they emerged from the Great Saint’s Grotto-Heaven, Xiao Zi had not acted alone. Over time, this was not a good sign.<br/><br/>“Then go ahead, but consult with Zhao Zhen on everything,” Fang Wang<br/><br/>agreed.<br/><br/>Xiao Zi immediately expressed her gratitude, then with a swish, she leaped out the window and disappeared from sight.<br/><br/>Fang Wang closed the door and then seated himself on the bed to meditate and cultivate.<br/><br/>With one more year to go, he wondered if he could break through to another minor realm.<br/><br/>On the other side.<br/><br/>Xiao Zi moved through the darkness of the night while Zhao Zhen’s Ghost Body emerged from the Soul Devouring Gourd on her back, asking curiously, “Looking at you, you obviously have somewhere in mind to go. Where are you headed?”<br/><br/>Following a snake, he had no expectations; he only hoped that the snake would not trouble him too much.<br/><br/>“Go to the Apricot Flower Building.”<br/><br/>“Eh? But that’s a brothel. What are you going there for?”<br/><br/>“Just curious, is that not allowed?”<br/><br/>Zhao Zhen’s expression became odd. He suddenly recalled the scene when Fang Wang teased Xiao Zi, and he guessed a possibility, causing the image of Fang Wang in his heart to completely collapse.<br/><br/>“Weren’t you the crown prince? Didn’t you ever go to a brothel in disguise?”<br/><br/>“Of course not!”<br/><br/>“Really? Tell the truth, or I’ll make your life worse than death!”<br/><br/>“Alright, alright… I’ve been, I’ve been…”<br/><br/>“That’s more like it. Introduce me to a few when we get there.” Xiao Zi smiled contentedly, while Zhao Zhen was close to breaking down.<br/><br/>Before he was executed by Lu Yuanjun, he never imagined he would be threatened by a snake and even accompany it to a brothel.<br/><br/>A male snake would have been one thing, as snakes are inherently lustful and like to slink into brothels, which was understandable.<br/><br/>But this one was a female snake!<br/><br/>How on earth had Fang Wang raised it?<br/><br/>When Xiao Zi returned, it had already been seven days, and it had gathered quite a bit of information.<br/><br/>“Young Master, they say that Liang Xunqiu from Grand Chu is a peerless Earth Origin Spirit Treasure, a once-in-a-millennium prodigy of Grand Chu. Just a hundred years old, he has already achieved the Condensation Spirit Realm. The city is filled with tales about him, and there are mentions of you, too. They say if you were here, there would be a good show to watch.”<br/><br/>Xiao Zi spoke incessantly. Fang Wang was gathering Qi and listening at the same time.<br/><br/>Zhao Zhen floated behind Xiao Zi, chiming in from time to time. Besides Liang Xunqiu, they mentioned other notable figures as well.<br/><br/>Fang Wang learned that Xu Qiuming had also arrived and was looking forward to meeting him.<br/><br/>Zhou Xue once said that Xu Qiuming would become one of the strongest mortals, which meant that Xu Qiuming would make a name for himself in this Zhui Tian Secret Realm.<br/><br/>He wondered if Zhou Xue had come too. The Zhui Tian Secret Realm was becoming more and more prominent; why had Zhou Xue never mentioned it before?<br/><br/>Was it the butterfly effect, or had Zhou Xue not participated in her past life either?<br/><br/>As he heard the names of several formidable figures, Fang Wang felt no worry at all.<br/><br/>No one could stop him from acquiring the Heavenly Gang Saint Body Technique!<br/><br/>The more opponents there were, the more excited he became.<br/><br/>Moreover, those cultivators were only there to seek treasures and were unaware of the Heavenly Gang Saint Body Technique hidden within the Zhui Tian Secret Realm.<br/><br/>Xiao Zi and Zhao Zhen talked for two whole hours before they finally finished, still looking as if they had more to say.<br/><br/>After listening, Fang Wang closed his eyes.<br/><br/>Zhao Zhen looked at Fang Wang, wanting to say something, then suddenly felt<br/><br/>Xiao Zits gaze and scaredly retreated into the Soul Devouring Gourd.<br/><br/>Days passed, and Fang Wang stayed indoors, continuing his retreat.<br/><br/>As time went on, the opening of the Zhui Tian Secret Realm drew closer. Figures of cultivators battling often appeared above the Wei River, and as cultivators from other dynasties arrived, such practices became even more rampant.<br/><br/>Xu Qiuming, too, became involved, and made a reputation for himself.<br/><br/>Xu Qiuming fought four times and never tasted defeat. He didn’t even sustain any injuries, and his fame began to spread throughout Grand Wei.<br/><br/>The days and months rotated.<br/><br/>There were now less than three days left until the opening of the Zhui Tian Secret Realm.<br/><br/>On this day, Xiao Zi returned from an outing, bringing two people back. Fang Wang opened the door and rose to greet them.<br/><br/>“Fang Wang! ”<br/><br/>Fang Hanyu was quite excited, and Fang Zigeng by his side was also thrilled.<br/><br/>When they met Xiao Zi, they were pleasantly surprised. Having Fang Wang with them in this strange place gave them a lot of reassurance.<br/><br/>“What brings you guys here?” Fang Wang asked curiously.<br/><br/>Fang Hanyu smiled and said, “It was Zhou Xue who sent us. She said that there’s a great opportunity within the Zhui Tian Secret Realm. She just didn’t tell us that you would be here too.”<br/><br/>Fang Wang raised an eyebrow and commented, “So it seems Zhou Xue has faith in you guys after all. Not bad at all, Zi Geng, you’ve become quite impressive!”<br/><br/>Fang Hanyu’s smile was full when he heard the first part, but it froze at the latter half of the sentence.<br/><br/>Fang Zigeng’s face turned red, and he hurriedly waved his hands, saying, “I’m not that impressive. I just have a magical treasure. Zhou Xue said that this treasure is extraordinary and could offer me a chance to defy my fate.”<br/><br/>Fang Wang nodded but didn’t inquire further about his magical treasure. Instead, he asked, “How’s the cultivation technique coming along?”<br/><br/>Fang Zigeng said awkwardly, “I’m of dull aptitude and still haven’t gotten the hang of the technique. Otherwise, why don’t you pass it on to someone else?”<br/><br/>Fang Hanyu chimed in, “I won’t learn it. Just the Nine Dragons Divine<br/><br/>Transformation Art is enough to keep me busy for many years.”<br/><br/>Ever since Fang Wang’s Nine Dragons Divine Transformation Art became famous throughout Grand Qi, he too knew of the legacy on his back.<br/><br/>Even though he had only mastered the level of the Qi Dragon, the Nine Dragons Divine Transformation Art remained his strongest move. Additionally, he was curious about what level the Black Dragon was and how many realms it was removed from his Qi Dragon..\t\t\t\t\t\t</div>", "images": {}, "success": true}