{"id": 115, "url": "https://www.novelhall.com/i-became-an-immortal-on-mortal-realm-32879/14295870.html", "title": "Chapter 115 - Chapter 115: Chapter 112: Founding Ancestor, Mountain River Town Heaven Fist", "volume": 2, "volume_title": "Volume 2", "body": "<h1>Chapter 115 - Chapter 115: Chapter 112: Founding Ancestor, Mountain River Town Heaven Fist</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 115: Chapter 112: Founding Ancestor, Mountain River Town Heaven Fist<br/><br/>Translator: 549690339<br/><br/>Fang Wang advanced with the Heavenly Palace Halberd in hand, while Xiao Zi wandered around, curious about the dragon patterns on every stone pillar, and Zhao Zhen was also dragged around, drifting about.<br/><br/>With this demon and ghost present, the eerie atmosphere of this gloomy corridor was dispersed.<br/><br/>They advanced along the way.<br/><br/>The avenue in this palace seemed never to end. Fang Wang did not accelerate, strolling as if he were out for a walk.<br/><br/>After advancing for more than ten miles without reaching the end, Fang Wang realized that there was a Formation at play here. He had been paying careful attention and noticed that the dragon images on the stone pillars were indeed changing, meaning he wasn’t just walking in circles.<br/><br/>Fang Wang stopped.<br/><br/>He raised the Heavenly Palace Halberd, prepared to use force to break through the Formation.<br/><br/>“Wait, I’ve discovered that the dragons on these stone pillars are actually individual characters. When combined together, they form the stone slab you’re holding,” Zhao Zhen suddenly said.<br/><br/>Upon hearing this, Fang Wang immediately took out the enigmatic stone slab.<br/><br/>On the slab were various patterns, including humans, demons, and many strange and incomprehensible ancient characters.<br/><br/>Zhao Zhen leaned in and said, “If you look closely, the postures of the humans and demons are also characters.”<br/><br/>Fang Wang handed the stone slab to Zhao Zhen and said, ‘You study it.”<br/><br/>Zhao Zhen hastily used his ghostly power to hold the stone slab and then flew to a nearby pillar to start a detailed comparison.<br/><br/>Fang Wang looked ahead at the avenue, filled with emotion.<br/><br/>The hint he had gotten in the Great Saint’s Grotto-Heaven was that he must master the Nine Dragons Divine Transformation Art and reach the Condensation Spirit Realm. Indeed, it was the Nine Dragons Divine Transformation Art that had allowed him to break into the palace.<br/><br/>But without Lu Yuanjun’s stone slab, even after entering, there would have been many difficulties.<br/><br/>Why was obtaining the Heavenly Gang Saint Body Technique more difficult than obtaining the True Combat Technique or Yin Yang Xuan Ming Zhen Gong?<br/><br/>Of course, the greater the difficulty in obtaining it, the stronger the Heavenly Gang Saint Body Technique must be.<br/><br/>Zhao Zhen held the stone slab, hovering in front of a stone pillar, deep in thought.<br/><br/>Xiao Zi stared blankly at the dragon pattern on the stone pillar, which was a slender and beautiful four-clawed True Dragon.<br/><br/>Seeing Xiao Zi’s expression, Fang Wang knew it was daydreaming again.<br/><br/>They waited like this for two hours.<br/><br/>Xiao Zi couldn’t help but ask, “Your Majesty, how much longer will it take?” Zhao Zhen furrowed his brows, whispering, “Strange… it’s really strange…” “What’s strange?” Xiao Zi asked, eyes wide.<br/><br/>Zhao Zhen looked uD at Fang Wang and said. “I feel like the images on this stone slab have changed. It’s like we’ve appeared on the slab.”<br/><br/>Upon hearing this, Fang Wang instantly raised his hand and summoned the slab to him.<br/><br/>As he looked closely, there were still various strange characters on it, but in the middle, there were only two human figures and a serpent demon.<br/><br/>It had indeed changed!<br/><br/>Fang Wang frowned and asked, “When did it change?”<br/><br/>Zhao Zhen floated over and said, “I’m not sure. Looking at this slab too long makes you bewitched. I even forgot what I was just thinking.”<br/><br/>His soul was trembling slightly, and as he raised his head to look around, his eyes showed a hint of fear.<br/><br/>Fang Wang stared intently at the stone slab, unsure of what its changes signified.<br/><br/>Xiao Zi came to rest on Fang Wang’s shoulder, looking at the stone slab as well.<br/><br/>After a while, Xiao Zi exclaimed with a mixture of surprise and doubt, “Young Master, have you noticed? The characters around the edge are increasing, seemingly moving towards us in the center.”<br/><br/>Upon hearing this, Fang Wang took a closer look and saw that it was indeed the case.<br/><br/>Even he was startled.<br/><br/>As a Cultivator of the Condensation Spirit Realm, his spiritual senses were extremely powerful, yet after staring at the stone slab for some time, he had failed to notice its changes.<br/><br/>“Could this signify that danger is approaching us? Are we already trapped in a scheme?” Zhao Zhen asked carefully.<br/><br/>Fang Wang couldn’t help but look up, and suddenly, whether it was an illusion or not, he felt as though the dragons on those pillars were staring at him.<br/><br/>This feeling was very eerie!<br/><br/>“Xiao Zi, stay close to my shoulder. Don’t get separated later,” Fang Wang said gravely. Xiao Zits serpentine body immediately clung to his shoulder, scanning anxiously in all directions, fearing some kind of demon or ghost might emerge.<br/><br/>Zhao Zhen also stayed close to Fang Wang. Even as a ghost, he was terrified of the situation.<br/><br/>The broad and dim avenue became engulfed in silence, and a strong feeling of unease surged towards Fang Wang, causing his right hand holding the Heavenly Palace Halberd to grip it tightly.<br/><br/>Time ticked away, second by second.<br/><br/>Gradually, Fang Wang’s vision started to blur, and he felt groggy, an experience he hadn’t felt since stepping onto the path of Cultivation, reminiscent of having a fever.<br/><br/>In a daze, he saw something rising from the two rows of stone pillars in front— those dragon patterns.<br/><br/>The dragons carved on the stone pillars had come to life!<br/><br/>Fang Wang immediately activated the Combat Heart, and in an instant, his senses cleared, and his vision sharpened. The stone dragons emerging from the pillars were indeed real, and he found himself surrounded by a throng of dragons.<br/><br/>The stone dragons from all directions closed in on Fang Wang with bared fangs and claws, exuding an immense oppressive force despite their silence.<br/><br/>A glint of cold light flashed in Fang Wang’s eyes as he suddenly hurled the Heavenly Palace Halberd in his hand and followed it closely. Raising his right hand, the palm was less than ten centimeters from the halberd’s tail blade, as if he were chasing after the Heavenly Palace Halberd.<br/><br/>Man and halberd, together they became a cold light, shattering the stone dragons along their path.<br/><br/>The roar echoed through the dimly lit passage!<br/><br/>Suddenly!<br/><br/>Wisps of black mist emanated from the cold light that was Fang Wang, swiftly<br/><br/>condensing into an enormous Black Dragon, making the gloomy passage seem insignificant.<br/><br/>Zhao Zhen floated behind Fang Wang, watching the transformation into the Black Dragon. He was shocked.<br/><br/>The legendary Nine Dragons Divine Transformation Art!<br/><br/>Zhao Zhen had read some records of the Ji Hao Sect. The Great Cultivators of the Ji Hao Sect could transform into dragons, effortlessly destroying mountains and cities, but those records only mentioned Azure Dragons and White Dragons, never a Black Dragon.<br/><br/>Zhao Zhen had seen Fang Wang transform into a Black Dragon before, but this was his first time inside the Black Dragon.<br/><br/>Such a powerful sensation!<br/><br/>Even though he couldn’t control the Black Dragon, its destructive power was clearly perceptible to him.<br/><br/>Fang Wang charged forward recklessly, continually enhancing his Spiritual Power.<br/><br/>At that moment, he no longer cared whether he was caught in an Illusionary Realm.<br/><br/>He was determined to forcefully break the formation!<br/><br/>After racing for hundreds of li, when half of Fang Wang’s Spiritual Power was spent, something in front of him suddenly shattered upon impact. He then felt his feet trip over something, stumbling; he quickly steadied himself.<br/><br/>The Black Dragon dissipated, and it was as if he had suddenly slammed into another world. His vision blurred, and when he opened his eyes again, he found himself on the streets of an ancient city.<br/><br/>At the end of the street stood a statue, the figure of a burly man standing five<br/><br/>Zhang tall. His right hand was raised but did not exceed his head, supporting a Great Cauldron. His garment was captured in the motion of fluttering, exuding tremendous authority.<br/><br/>Fang Wang narrowed his eyes, spreading out his spiritual consciousness.<br/><br/>He was unsure whether he was still in the Illusionary Realm.<br/><br/>Xiao Zi lifted its snake head and exclaimed with joy, “Master, we’ve broken through! My heart suddenly feels secure.”<br/><br/>It had an extremely keen sense of danger. Its previous unease and fear had dissipated like smoke, and it truly trusted its own feelings.<br/><br/>Fang Wang took a deep breath and moved forward with determination.<br/><br/>Zhao Zhen and Xiao Zi vigilantly scanned their surroundings, afraid that something might suddenly emerge.<br/><br/>Soon, Fang Wang arrived before the statue. He saw that the Great Cauldron had a groove on its surface that matched the stone tablet perfectly.<br/><br/>He immediately leaped up and pressed the stone tablet into the groove of the Great Cauldron.<br/><br/>In an instant, the statue trembled violently, startling Fang Wang into retreating.<br/><br/>The eyes of the statue shed their stone cover, releasing two bright beams of light, followed by the appearance of a soul body that floated in front of the statue.<br/><br/>It was a white-haired old man with a kind expression, a long beard reaching his chest, and the youthful appearance of a sage. He stroked his beard with a smile, eyes squinted to mere slits, invisible to the eye.<br/><br/>“Almost three thousand years and finally another junior has set foot here to take up the poor Daoist’s challenge.”<br/><br/>The white-haired old man said cheerfully, his tone gentle, and not exuding even a trace of pressure.<br/><br/>Fang Wang breathed a sigh of relief internally. He placed the Heavenly Palace Halberd beside him and clasped his hands in a salute, “Junior Fang Wang greets the senior. I dare to ask if you possess the inheritance of the Heavenly Gang Saint Body Technique?”<br/><br/>“Heavenly Gang Saint Body Technique? Good lad, you are quite direct. The<br/><br/>Heavenly Gang Saint Body Technique, created by His Majesty based on the Heavenly Body, can transform a mortal into the legendary Heavenly Body. The effort and sacrifice required are unimaginable and, for those with mediocre talent or insufficient resolve, it could lead to a disastrous path,” said the white-haired old man earnestly, his eyes still closed.<br/><br/>His Majesty?<br/><br/>Could it be the ancient Great Saint?<br/><br/>Fang Wang responded, “The junior has prepared himself mentally.”<br/><br/>The white-haired old man laughed heartily for a while before saying, “Merely being prepared is not enough; you must prove yourself to the poor Daoist.”<br/><br/>“How should I prove myself?” Fang Wang asked, already impatient to obtain the Heavenly Gang Saint Body Technique-<br/><br/>The white-haired old man lifted his right hand and waved it in the air.<br/><br/>Characters of light appeared in mid-air as he wrote and spoke, “This is the Mountain River Town Heaven Fist, created by His Majesty. Vigorous and domineering, when practiced to a minor degree of mastery, it can level mountains and part rivers. If practiced to great completion and with sufficient cultivation strength, one can break heaven with a single punch!” A punch to break heaven?<br/><br/>Fang Wang’s spirits were uplifted. He did not doubt the words of the white-haired old man because the ancient Great Saint had indeed challenged the Immortal Gods above, proving he had the strength to threaten the Upper Realm.<br/><br/>He began to watch the sequence of light characters intently, with Zhao Zhen and Xiao Zi also watching without blinking.<br/><br/>“Three thousand years ago, there was a junior named Zhu Changsheng who reached me. It took him a full two hundred years to master the Mountain River<br/><br/>Town Heaven Fist, and he thus attained the Heavenly Gang Saint Body Technique. I wonder if his name has left any mark in the mortal world of today?” the white-haired old man asked with a smile.<br/><br/>Fang Wang had not heard of the name Zhu Changsheng and did not join the conversation.<br/><br/>Xiao Zi, however, exclaimed, “I know of him! He is the founding patriarch of the Ji Hao Sect. Legend has it that he ascended!”<br/><br/>The smile on the white-haired elder’s face momentarily stiffened, but he quickly returned to smiling and said contemplatively, “Ascended? Whether the Immortal Gods truly exist, how can mortals know? The truth of cultivation and ascension is even harder to discern.”<br/><br/>After finishing, he quickly changed the subject, ‘Zhu Changsheng took two hundred years to master the Mountain River Town Heaven Fist. Fang Wang, the poor Daoist would like to see how many years you will need.”<br/><br/>Fang Wang, still concentrated on the cultivation technique, did not respond.<br/><br/>Xiao Zi, however, engaged in a conversation with the white-haired old man, asking curiously, “Senior, the Heavenly Gang Saint Body Technique is a technique to mold a Heavenly Body.. Have you ever seen someone who was born as a Heavenly Body?”\t\t\t\t\t\t</div>", "images": {}, "success": true}