{"id": 119, "url": "https://www.novelhall.com/i-became-an-immortal-on-mortal-realm-32879/14296536.html", "title": "Chapter 119 - Chapter 119: Chapter 116: The Comparison Between Fang Wang And The Great Saint", "volume": 2, "volume_title": "Volume 2", "body": "<h1>Chapter 119 - Chapter 119: Chapter 116: The Comparison Between Fang Wang And The Great Saint</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 119: Chapter 116: The Comparison Between Fang Wang and the Great Saint<br/><br/>Translator: 549690339<br/><br/>Fang Wang stood proudly atop the mountain peak, overlooking the Ghost Army advancing from the horizon.<br/><br/>At a glance, every ghost soldier radiated a powerful aura, with the weakest at the Spirit Elixir Realm, numbering in the tens of thousands, including no lack of Profound Heart Realm and Condensation Spirit Realm existences. The commanding general at the forefront possessed momentum far surpassing the Condensation Spirit Realm.<br/><br/>This Ghost Army maintained their images with each one clad in black armor. The leading general’s helmet was adorned with two phoenix wings, and his cloak fluttered behind him like raging flames. His Ghost Qi spread hundreds of yards, accompanied by earth-shattering battle cries that bore an imposing presence.<br/><br/>Even from a great distance, Xiao Zi and Zhao Zhen were frightened by this Ghost Army, especially the general’s momentum, which was even more terrifying than the two Great Cultivators of Heaven’s Larceny Sect they had encountered before!<br/><br/>“Old man, are you joking?” Xiao Zi couldn’t help but look at the white-haired elder, feeling that this old thing was up to no good.<br/><br/>The white-haired elder’s expression was grave as he said, “Their souls are bound to the secret realm. Even if you obliterate them, give them time, and they will recover. You can vent to your heart’s content.”<br/><br/>He had realized that Fang Wang was harboring pent-up malice in his heart and wanted to vent it.<br/><br/>Perhaps the impact brought by the Heavenly Gang Saint Body Technique was too great, causing his blood to circulate poorly and accumulating deep frustration within him.<br/><br/>Fang Wang didn’t reply, but his fists were already clenched.<br/><br/>The surging Spiritual Energy between heaven and earth coursed toward his fists. The white aura around his body grew even more majestic, especially at his fists, which seemed to be grasping two blazing flames. His black robe billowing violently, he slowly soared into the sky; the mountain top beneath him began to crumble, countless fragments mixed with clouds of dust falling down.<br/><br/>Fang Wang activated the Heavenly Gang’s thirty-six star points, his blood boiling as endless strength emerged from within his body. At the same time, he could feel his flesh absorbing nature’s spiritual energy.<br/><br/>Although he had mastered the Heavenly Gang Saint Body Technique, his flesh had not yet truly transformed into a Heavenly Body.<br/><br/>This was precisely why he needed a great battle!<br/><br/>In combat, absorbing the spiritual energy of heaven and earth and tempering his physique, he would make himself truly become a Heavenly Body!<br/><br/>The distant ghost general noticed Fang Wang’s momentum and the fierce brows beneath the helmet furrowed. He immediately raised his hand, conjuring a large saber.<br/><br/>“Heavenly Gang Saint Body Technique, huh… I wonder if you’re stronger or weaker compared to the legendary Zhu Changsheng.”<br/><br/>The ghost general murmured to himself as he picked up his pace, charging forward with a rainbow-like aura.<br/><br/>Fang Wang did not take out his Lifespirit Treasure; he sought a battle that would test the limits of his physical body!<br/><br/>Great Abyss Gate, Main Meridian, Shiyuan Hall.<br/><br/>Nine Peak Masters, elders, and some Direct Disciples were gathered here, including Zhou Xue, Ye Xiang, and Li Yu.<br/><br/>Guang Qiuxian sat cross-legged on a cushion, slowly exhaling a breath of air, and said, “What are your thoughts on the request from Vast Qi Sect?”<br/><br/>Zhao Chuanqian was the first to speak, “They’re kicking us when we’re down, and they’ve come specifically for Fang Wang. Not to mention what Fang Wang’s Lifespirit Treasure represents, Grand Chu’s losses in the Zhui Tian Secret Realm, including Liang Xunqiu and Xiao Chen, are enough to cause discontent towards us. They want us to trade Fang Wang for the resources of the Cultivation Dynasty, which is absolutely unacceptable! ”<br/><br/>Yang Yuanzi snorted and said, “They claim they want Fang Wang to cultivate higher Daoist methods and build connections, but if Fang Wang goes, and something happens to him, what can we do? Cross Grand Wei to attack Vast Qi<br/><br/>Sect? It’s unrealistic!”<br/><br/>The other elders spoke up one after another, all sharing the same opinion.<br/><br/>“Fang Wang is our prime disciple, the next Sect Leader. How could he go to Grand Chu?”<br/><br/>“I’m going to say something selfish. If Grand Chu is sincere, what benefit does Fang Wang’s departure bring to Great Abyss Gate? We don’t want Fang Wang to owe us a favor. Instead, we want him to lead Great Abyss Gate to unprecedented heights, even surpassing Vast Qi Sect.”<br/><br/>“Hmph, the other sects in Grand Qi would love for us to hand over Fang Wang, which is why they’ve kept silent before. We must not fulfill their wishes.”<br/><br/>“If Fang Wang goes to Grand Chu, and if Liang Xunqiu and Xiao Chen are really dead, then Fang Wang’s trouble will be great. Vast Qi Sect has close ties with Grand Chu’s royal family and is known as a supervising national sect. What’s more, Liang Xunqiu just happens to be a disciple of Vast Qi Sect.”<br/><br/>“What’s there to fear? No matter how strong Vast Qi Sect is, can they cross thousands of miles to slaughter our Great Abyss Gate?”<br/><br/>Listening to the many elders’ discussions, Zhou Xue’s face remained calm, as if she was not very familiar with Fang Wang.<br/><br/>The other Direct Disciples displayed angry expressions, also feeling that Grand Chu was bullying them.<br/><br/>Guang Qiuxian slowly said, “You all make good points, but the issue is how to refuse Vast Qi Sect? Since Chi Devil Sect’s destruction, the person providing spirit stones to awaken the Dragon Vein for Grand Qi has gone missing. Surely, the other Grand Qi sects will pressure Great Abyss Gate, seeing as the transformation of Grand Qi into a Cultivation Dynasty cannot be interrupted, having been in preparation for so many years and nearly successful.” At these words, everyone fell silent.<br/><br/>Facing pressure from Vast Qi Sect and dissatisfaction from other sects, the situation was indeed tricky.<br/><br/>If they refuse, Great Abyss Gate might face an onslaught from various Grand Qi sects, and Vast Qi Sect might also dispatch Great Cultivators beyond the Condensation Spirit Realm.<br/><br/>The usually protective Yang Yuanzi fell silent too.<br/><br/>The arrogance of Vast Qi Sect’s envoy in front of the six Grand Qi sects was vividly etched in memory, acting as if demanding a disciple from Great Abyss Gate was an honor for them.<br/><br/>Guang Qiuxian, seeing that they had nothing else to say, harbored even deeper worry in his eyes.<br/><br/>Originally, he thought that acquiring a genius disciple like Fang Wang in his later years was his greatest honor, but he had not expected that he might lose Fang Wang before even retiring from his position.<br/><br/>If he handed Fang Wang over to Vast Qi Sect, he might go down in history as the Sect Leader with the least backbone, the one who hindered Great Abyss Gate’s ascent!<br/><br/>Just thinking about it made Guang Qiuxian feel a stifling tightness in his chest.<br/><br/>Just then, Zhou Xue stood up and said, “Suspended Vast Sword Sect, Tian Shu Sect, Taiqing Gate, Crimson Sect, Huangyu Mountain, and Ancient Demon Mountain may pressure us, but we are not completely without support. There is another sect that has been ostracized by them and that, despite its bad reputation, has never been at odds with Great Abyss Gate.”<br/><br/>Upon hearing this, Greedy Sleeper looked toward Zhou Xue and squinted, asking, “Are you talking about Jin Xiao Sect?”<br/><br/>Zhou Xue said, “Yes, Jin Xiao Sect’s strength is unfathomable. Although I do not understand Jin Xiao Sect well, if I want to save Fang Wang, our only option now is to ally with Jin Xiao Sect.”<br/><br/>Greedy Sleeper pressed, “How can Jin Xiao Sect agree? And who shall we send to make contact with Jin Xiao Sect?”<br/><br/>Zhou Xue shook her head and said, “These are matters for the elder masters and uncles to consider.”<br/><br/>Greedy Sleeper turned to look at Guang Qiuxian.<br/><br/>Guang Qiuxian furrowed his brow and began to ponder.<br/><br/>Yang Yuanzi suddenly said, “I think she makes sense. Moreover, we all know about her relationship with Fang Wang. Her suggestion to unite with Jin Xiao Sect is not ill-intentioned. In fact, aside from this, we really have no other way out unless you all truly intend to hand Fang Wang over.”<br/><br/>Many elders nodded, but there were others who felt it was inappropriate.<br/><br/>Although Jin Xiao Sect had not been hostile toward Great Abyss Gate, its style of conduct was clearly that of an evil sect, and by colluding with an evil sect, even if Great Abyss Gate could survive this crisis, it would never be able to wash away the stain afterward.<br/><br/>“Even if Jin Xiao Sect is strong, perhaps even strong enough to oppose Vast Qi Sect, what will we do then to counter Jin Xiao Sect? What if Jin Xiao Sect seeks to unify Grand Qi, how shall we respond?” the second meridian’s peak master said solemnly, his expression grave.<br/><br/>Ye Xiang suddenly stood up and said, “Honored elder masters and uncles, we have overlooked an important point, the most crucial point, that is Fang Wang’s rate of growth. If we can rely on Jin Xiao Sect to weather this peril, how many years do you think Fang Wang needs to surpass the Condensation Spirit Realm, and what sort of power will he wield after surpassing it?”<br/><br/>“The ones who need to go out are us, the ones with mediocre talent. With Fang Wang’s talent and the inheritance he received from Ji Hao Sect, he doesn’t need to go out at all. Just give him time. What is there to fear from Vast Qi Sect or Jin Xiao Sect?”<br/><br/>His words won the approval of the direct disciples. They understood even more clearly than their masters how terrifying Fang Wang’s talent was.<br/><br/>They had reached the status of direct disciples because they themselves were prodigies who appeared once in a century in their respective families. Yet in front of Fang Wang, they genuinely felt mediocre.<br/><br/>Guang Qiuxian, listening to his disciples’ discussions, felt emotional turbulence.<br/><br/>Indeed!<br/><br/>They could still believe in Fang Wang!<br/><br/>Just then, an elder hurried in. He walked to the front of everyone and said anxiously to Guang Qiuxian, “A grand elder from Vast Qi Sect has arrived, claiming to be traveling the world with his disciple and wishing to visit Great Abyss Gate!”<br/><br/>With these words, everyone was moved, even Zhou Xue’s eyes showed a change.<br/><br/>Guang Qiuxian did not panic but instead was furious. He gritted his teeth and said, “Good! Very good!”<br/><br/>Zhui Tian Secret Realm.<br/><br/>Fang Wang, shirtless, was sitting in meditation by the lakeside. The swirling spiritual energy formed a vortex around him, aiding the transformation of his body, while the thirty-six stars of the Heavenly Gang Saint Body Technique flickered mysteriously on his body.<br/><br/>An old man with white hair, Xiao Zi, and Zhao Zhen stood in the distance, gazing at Fang Wang with complex expressions. Beyond them, at the horizon, dust still filled the air, and mountains crumbled, resembling the aftermath of a major earthquake—a scene of desolation and oppression.<br/><br/>“A Heavenly Gang Saint Body… Moreover, a more perfect Heavenly Gang Saint<br/><br/>Body than Zhu Changsheng’s… No, he’s even…”<br/><br/>The white-haired old man muttered to himself, his eyes filled with shock.<br/><br/>Even though some time had passed since the astonishing battle, he was still unable to calm his emotions.<br/><br/>Xiao Zi turned and asked, “Even what? Could it be that my young master has already surpassed a Great Saint?”<br/><br/>Xiao Zi spoke in a teasing tone, but the white-haired old man fell silent.<br/><br/>Zhao Zhen was astonished. A Great Saint was immensely powerful and wielded nine Lifespirit Treasures, likely Heaven Yuan Spirit Treasures. How could Fang Wang surpass that?<br/><br/>Could it be…<br/><br/>Is there a higher rank above Heaven Yuan?<br/><br/>This speculation shocked Zhao Zhen. In his view, even describing Fang Wang’s talent as akin to a Heaven Yuan Spirit Treasure seemed insufficient.<br/><br/>The most exaggerated aspect of Fang Wang was not the speed of his cultivation progression, but the rate at which he comprehended the methods of cultivation —it was absurdly fast.<br/><br/>The white-haired old man took a deep breath and said, “Of course, he hasn’t surpassed His Majesty, but he has surpassed the state His Majesty was in when he first mastered the Heavenly Gang Saint Body Technique. Furthermore, he…<br/><br/>is even more powerful than His Majesty was at the Condensation Spirit<br/><br/>Realm…”<br/><br/>He kept back a half-sentence.<br/><br/>Had His Majesty been in the Condensation Spirit Realm when facing Fang Wang, he might have…<br/><br/>“Perhaps, it is time to give him that item.” the white-haired man said quietly.<br/><br/>Xiao Zi asked curiously, “What item?”<br/><br/>The white-haired man spoke slowly and deliberately, “That item can bring him an opportunity, a chance for him to achieve immortality and live forever in the Mortal Realm!”\t\t\t\t\t\t</div>", "images": {}, "success": true}