{"id": 113, "url": "https://www.novelhall.com/i-became-an-immortal-on-mortal-realm-32879/14295352.html", "title": "Chapter 113 - Chapter 113: Chapter 110: The Unrivaled Conflict, Disdaining Everything", "volume": 2, "volume_title": "Volume 2", "body": "<h1>Chapter 113 - Chapter 113: Chapter 110: The Unrivaled Conflict, Disdaining Everything</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 113: Chapter 110: The Unrivaled Conflict, Disdaining Everything<br/><br/>Translator: 549690339<br/><br/>Hearing Xiao Chen ask about the condition of his father, Fang Wang really wanted to say that he had already died, but he still held back.<br/><br/>“It was merely a brief encounter, yet his elegance is unforgettable. His sword intent emerged spontaneously, his sword qi exceptional—truly, a rare individual in this world,” Fang Wang remarked with emotion.<br/><br/>Upon hearing this, Xiao Chen’s smile grew. He laughed and said, “My father is indeed extraordinary. Perhaps he has already touched a realm above the Condensation Spirit Realm. I don’t know if I can catch up with him in this lifetime. Speaking of which, I’m quite envious of you, young brother Fang. With the Heaven Yuan Spirit Treasure in your possession, the Condensation Spirit Realm is certainly not your limit.”<br/><br/>Fang Wang modestly responded in turn.<br/><br/>Since there was nothing else to do, chatting with this person wasn’t too bad.<br/><br/>Of course, the chat was not for making friends. The three of them had gathered here, and undoubtedly, a major battle was about to erupt—it was very likely a battle to the death.<br/><br/>Fang Wang had already considered Xiao Chen as good as dead.<br/><br/>In fact, Xiao Chen had also considered Fang Wang as good as dead.<br/><br/>While Xiao Chen made small talk, his mind was busy strategizing.<br/><br/>Should he kill this guy directly, or should he take possession of his body?<br/><br/>The Heaven Yuan Spirit Treasure, ah!<br/><br/>Such a flesh body was hard to come by.<br/><br/>Lanxin Xianzi glanced at Fang Wang for a while before closing her eyes. Not long after, the lake fell into silence.<br/><br/>Xiao Zi lay on Fang Wang’s thigh, keeping an eye on Xiao Chen, continuously flicking its snake tongue, pondering who knows what.<br/><br/>So it went, another day and night passed.<br/><br/>The sun drew closer to being right above the lake than the previous day, and the degree was significantly more noticeable.<br/><br/>This was good news!<br/><br/>After all, the Zhui Tian Secret Realm was only open for a month. Fang Wang did not wish to wait until it ended without the sun coming directly above the lake surface.<br/><br/>In the days that followed, no fourth person arrived.<br/><br/>Ever since Xiao Chen and Lanxin Xianzi had sat down, they had not stood up again—it was clear they were also waiting for the sun above.<br/><br/>Six days later, the sun was not far from being right above the lake surface, and on this afternoon, a fourth person arrived.<br/><br/>The number one genius of Grand Chu, Liang Xunqiu!<br/><br/>An extraordinary Earth Origin Spirit Treasure!<br/><br/>Clothed in fine brocaded garments and holding a folding fan, he looked dashing and seemed to be under thirty years old. He chose to sit opposite Lanxin Xianzi by the lakeside, which made the four people form a square.<br/><br/>Xiao Chen and Liang Xunqiu were quite familiar with each other and chatted amicably. He even introduced Fang Wang to Liang Xunqiu.<br/><br/>Once he knew Fang Wang’s identity, Liang Xunqiu frequently glanced over at him, but Fang Wang was not very keen to talk, so they merely exchanged greetings.<br/><br/>After Xiao Chen and Liang Xunqiu talked for a while, they each began to cultivate.<br/><br/>Xiao Zi telepathically asked, “Master, could those two join forces against us?<br/><br/>Fang Wang telepathically replied, “If they were to join forces, why would they sit so far apart? Even if they did, it would not make any difference. They best not block my path.”<br/><br/>Hearing this, Xiao Zi couldn’t help but glance toward Liang Xunqiu in the distance, its snake eyes revealing a human-like mocking expression.<br/><br/>Time passed, and another day went by.<br/><br/>Fang Wang looked up at the firmament, estimating that in two more days, the sun would be directly above the lake.<br/><br/>At this moment, he suddenly felt a group of presences rapidly approaching, one of which was familiar to him. Glancing over, he saw dozens of cultivators from the Grand Qi Cultivation Realm flying over from the horizon, among them Fang Hanyu.<br/><br/>All these cultivators were sword flying, and as they came close to the lake, they took notice of the four people by the lakeshore.<br/><br/>“Is that Fang Wang?” Zhou Bo excitedly said, pointing at Fang Wang. Even though Fang Wang was dressed in black and wore a bamboo hat, he recognized him at a glance.<br/><br/>As soon as this statement was made, the others also looked over.<br/><br/>“It seems to be him!”<br/><br/>“Who are the other three?”<br/><br/>“What are they doing? Something feels off.”<br/><br/>“I’m not sure. The other three don’t seem easy to mess with.”<br/><br/>“Isn’t that Grand Chu’s number one genius, Liang Xunqiu? It’s said that he has reached the Condensation Spirit Realm. Could it be that they are here to fight over something?”<br/><br/>The Grand Qi Cultivators speculated among themselves. Although they were curious, they did not dare to approach rashly.<br/><br/>Fang Hanyu spoke up, “Let’s not pry any further. We’d better just leave. To be honest, all of us here may not be able to help Fang Wang.”<br/><br/>Having heard this, everyone fell silent for a moment and all thought there was reason in his words.<br/><br/>Even though Fang Hanyu’s words were somewhat hurtful, the truth was that their combined cultivation was no match for a single Condensation Spirit Realm cultivator.<br/><br/>In the end, they chose to bypass the lake and fly toward the horizon.<br/><br/>Fang Hanyu turned back, looking deeply at Fang Wang for a moment.<br/><br/>Fang Wang did not look towards Fang Hanyu but continued to sit in meditation and practice.<br/><br/>The Grand Qi Cultivators started a discussion about who was stronger between<br/><br/>Fang Wang and Liang Xunqiu. Liang Xunqiu had displayed his strength in Zhui Tian City, extremely formidable, and he was also more than fifty years Fang Wang’s senior.<br/><br/>In the time that followed, cultivators passed by intermittently. Seeing the confrontation of Fang Wang’s group, they all dared not approach.<br/><br/>When Zhui Tian City’s lord, Hu Pomo, passed by this place with Hu PO Xie, they too were drawn to the sight.<br/><br/>“Fang Wang…” Hu PO Xie squinted as he looked over, murmuring to himself.<br/><br/>Hu Pomo raised an eyebrow and said, “Oh? Is that man the talent of Heaven<br/><br/>Yuan from Grand Qi?”<br/><br/>Hu Poxie nodded and said, “That’s him. But who are the other two besides Liang Xunqiu?”<br/><br/>Hu Pomo sighed, “Those two are extraordinary. One is Grand Chu’s Sword<br/><br/>Master Xiao Chen, and the other, Grand Han’s Lanxin Xianzi, a sect leader. These two are unmatched within the Condensation Spirit Realm. Tsk tsk, with these four waiting here, it seems there will soon be a fierce struggle akin to dragons and tigers fighting.”<br/><br/>Hearing this, Hu Poxie’s eyes lit up; the identities of these four sounded like undefeated champions. It was rare to encounter them one-on-one on ordinary days, yet now there were four of them in a standoff.<br/><br/>“Let’s go, don’t disturb them,” Hu Pomo withdrew his gaze.<br/><br/>Hu Poxie frowned and said, “Should we stay and watch?”<br/><br/>Hu Pomo didn’t even turn to look at him as he replied, “Do you know how long they will wait? Do you really think you could snatch away the treasures they’re after?”<br/><br/>Upon hearing this, Hu Poxie felt it made sense and could only follow him away.<br/><br/>Still, he glanced back from time to time, his face filled with regret.<br/><br/>Thus, the standoff involving Fang Wang, Liang Xunqiu, Xiao Chen, and Lanxin Xianzi in the Zhui Tian Secret Realm became known. However, no one came to spectate, as all cultivators had to strive for their own fortunes.<br/><br/>Two days went by quickly.<br/><br/>It was the hour of si, just over half an hour until midday.<br/><br/>Fang Wang and the others all watched the sun slowly move across the sky, drawing near directly above the lake’s surface.<br/><br/>Gradually, the four of them stood up one after another.<br/><br/>When the sun was exactly above the lake’s surface, heaven and earth seemed tc freeze, and all living things fell silent. They saw a vertical ray of light from the sun fall onto the lake, whereupon the water rose along this ray, forming a liquid stairway leading up towards the heavens<br/><br/>The sun began to darken and soon displayed the appearance of stars, as if a great hole had been torn in the sky, and beyond lay the universe.<br/><br/>Without hesitation, the four leapt up and quickly flew into the Firmament, bursting through the bright sun.<br/><br/>Fang Wang felt the world spinning around him, the universe’s stars rotating at high speed, forcing him to slow down. Soon, his vision returned to normal.<br/><br/>Before him lay a huge floating island with no vegetation, only an ancient city built of stone.<br/><br/>He immediately flew toward the island, with Xiao Chen, Liang Xunqiu, and Lanxin Xianzi doing the same, each keeping a distance from the others.<br/><br/>As they landed on the island, Xiao Chen suddenly sped up and then turned around, blocking the path of the three others.<br/><br/>Xiao Chen raised his right hand, his Lifespirit Treasure converging— a silver sword that emitted a chill even from a hundred Zhang away, its coldness palpable.<br/><br/>“The three of you, since we’re all here for the Heavenly Gang Saint Body Technique, why not decide the victor now? The winner seeks the opportunity, and those who lose can seek other fortunes,” said Xiao Chen expressionlessly, a stark contrast to his previous warmth.<br/><br/>Liang Xunqiu, waving his fan with a smile, replied, “I naturally have no objections, as long as you would accept defeat graciously.”<br/><br/>As the tension between them flared, the two, both hailing from Grand Chu, locked horns with each other—an intriguing sight indeed.<br/><br/>Lanxin Xianzi radiated Demonic Qi, encircled by swirling black mist, looking as if an Extraterrestrial Demon had descended amidst the stars. “A gentleman’s agreement? Are you jesting? We’ve all been preparing for so long—if we must fight, then be prepared to die!”<br/><br/>At these words, Xiao Chen and Liang Xunqiu both turned to look at her, their eyes brimming with murderous intent.<br/><br/>Fang Wang raised his right hand, and the Rainbow Sword materialized in his hand. Xiao Zi leaped from his shoulder, growing larger, resembling a Purple Dragon coiling around him.<br/><br/>“The three of you, stop arguing. I’ll give you one last chance—either die or leave now,” Fang Wang said coldly, drawing the attention of all three, who were surprised by his arrogance.<br/><br/>Xiao Chen scoffed, “The Heaven Yuan Spirit Treasure is indeed formidable, but such arrogance will only lead to your demise.”<br/><br/>Fang Wang looked at him coldly and said, “Your father Xiao Jian died by my hand. Do you think I lack the strength to be so haughty?”<br/><br/>Xiao Chen’s expression shifted, fear flashing in his eyes.<br/><br/>Fang Wang lifted the Rainbow Sword as Sword Qi burst forth, thirty-six sword shadows converging around him.<br/><br/>Extraordinary Thirty- Six Sword!<br/><br/>His formidable momentum caused Liang Xunqiu and Lanxin Xianzi to furrow their brows.<br/><br/>Lanxin Xianzi made the first move, striking with her palm as the surging Demonic Qi transformed into a gigantic black claw aiming at Fang Wang.<br/><br/>Liang Xunqiu charged directly at Fang Wang, fast as a ghost, swift as a startled swan.<br/><br/>Fang Wang flicked his sword, the Golden Scale White Feather Robe materializing on him. He did not swing his sword but rushed towards Liang Xunqiu, the thirty-six sword shadows following him like a shadow’s echo.<br/><br/>Facing Fang Wang, Liang Xunqiu felt an indescribable pressure. He swung his fan fiercely, unleashing hundreds of wind blades with great momentum.<br/><br/>The thirty-six sword shadows suddenly shot out, slashing at high speed, destroying the wind blades targeted at Fang Wang, including Lanxin Xianzi’s gigantic black claw, which was shredded.<br/><br/>In less than two breaths, Fang Wang was upon Liang Xunqiu.<br/><br/>Liang Xunqiu met Fang Wang’s gaze and was inwardly shocked.<br/><br/>What kind of eyes were these?<br/><br/>Fang Wang’s eyes were incredibly sharp, as if he held twin swords within them, and he had now unveiled his Combat Heart.<br/><br/>The Extraordinary Thirty-Six Sword, accompanied by a storm’s onslaught, attacked Liang Xunqiu, who retreated while fending off with his fan. His Mana was immensely strong, able to scatter Fang Wang’s Sword Qi.<br/><br/>Suddenly, Fang Wang’s eyes intensified, and he thrust his sword forward. All the sword shadows swiftly converged, rushing towards Liang Xunqiu at an unbelievable speed.<br/><br/>Boom!<br/><br/>Sword Qi pierced through Liang Xunqiu; his eyes widened, his body trembled, and blood uncontrollably surged from his mouth. His eyes were filled with terror, seemingly unable to believe what was happening before him.<br/><br/>Fang Wang promptly turned and thrust his sword backward. The Extraordinary<br/><br/>Thirty-Six Sword swiftly converged again, following the blade of the Rainbow Sword as he stabbed behind him. They became Sword Qi, extending along the blade.<br/><br/>With a thrust—<br/><br/>The bright sword blade extended ten zhang, piercing straight through Xiao Chen’s chest as he approached with his sword, blood splattering while he maintained his attacking stance..\t\t\t\t\t\t</div>", "images": {}, "success": true}