{"id": 116, "url": "https://www.novelhall.com/i-became-an-immortal-on-mortal-realm-32879/14295875.html", "title": "Chapter 116 - Chapter 116: Chapter 113: Fist Moves Mountains And Rivers, Mortal Realm Three Thousand Years Later", "volume": 2, "volume_title": "Volume 2", "body": "<h1>Chapter 116 - Chapter 116: Chapter 113: Fist Moves Mountains And Rivers, Mortal Realm Three Thousand Years Later</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 116: Chapter 113: Fist Moves Mountains and Rivers, Mortal Realm Three Thousand Years Later<br/><br/>Translator: 549690339<br/><br/>“Of course, I’ve seen it. Your Majesty has been cultivating for five thousand years, dominating the mortal realm, and aside from being defeated by someone from The Upper Realm, he has only lost once, and that was to a congenital Heavenly Body!”<br/><br/>The white-haired elder wrote characters in the air while he exclaimed with emotion.<br/><br/>Xiao Zi’s snake eyes widened as she exclaimed, “Isn’t the Great Saint an invincible being in the Mortal Realm?”<br/><br/>“Indeed, but His Majesty really lost to the Heavenly Body. Unfortunately, the person with the Heavenly Body died young and didn’t get to duel with His Majesty at their peak. It was His Majesty’s regret, for which he specially created the Heavenly Gang Saint Body Technique,” the white-haired elder said, stroking his beard with emotion.<br/><br/>Xiao Zi eagerly asked, “Why did the Heavenly Body die early? Was it also slain by the Immortals and Gods from The Upper Realm?”<br/><br/>The white-haired elder shook his head and said, “He died in the Cross-Void Realm. At that time, he was already capable of fighting across realms and had offended too many enemies. He was jointly pursued by various great sects and ultimately fled into an ancient forbidden land. Since then, he never emerged again, which means he died inside the forbidden land. In the mortal realm, there is no one with eternal life.”<br/><br/>Upon hearing this, Xiao Zi couldn’t help but look at Fang Wang, her gaze filled with worry.<br/><br/>Suddenly, she was concerned that Fang Wang might follow in the footsteps of the Heavenly Body.<br/><br/>Zhao Zhen did not make a sound and was just as focused on reading through the cultivation methods for the Mountain River Town Heaven Fist together with Fang Wang.<br/><br/>Although he was a Ghost Body, he had been continually cultivating. What if one day he could become a Ghost Immortal?<br/><br/>Zhao Zhen was meticulous in thought and very bold. Had Lu Yuanjun been his master, he would not dare to harbor such thoughts, but with Fang Wang as his master, he felt that it was not entirely impossible.<br/><br/>If Immortals did truly exist in this world, then Heaven Yuan Spirit Treasure was the most promising to reach the realm of Immortal Gods.<br/><br/>After a good while, the white-haired elder finally finished writing. Thousands of characters floated in the air, dazzling to behold.<br/><br/>Fang Wang gazed up at the cultivation methods for the Mountain River Town Heaven Fist. He needed only glance through the thousands of characters once to remember them. When he was about to reach the last line, he took a deep breath, trying to calm his emotions.<br/><br/>Xiao Zi asked with concern, “Young Master, what’s wrong?”<br/><br/>The white-haired elder looked at him with a smile and asked, “This fist technique is indeed difficult, but if you can’t calm your mind to train, you won’t be able to master the Heavenly Gang Saint Body Technique.”<br/><br/>Fang Wang replied calmly, “It’s not difficult.”<br/><br/>Not difficult?<br/><br/>The white-haired elder was taken aback, then burst into laughter.<br/><br/>Fang Wang ignored him and looked at the last line.<br/><br/>As soon as he saw the final character, the world in front of him shattered. The familiar sensation of dizziness overcame him, and then he felt his feet touch the ground. Opening his eyes, he found himself within the Heavenly Palace.<br/><br/>Gazing at the splendid, spacious hall, he willed it to transform into a landscape of mountains and rivers. He seemed to have landed among the mountains, a meandering river flowing between them. From a high viewpoint, it looked like a dragon, magnificent in its majesty.<br/><br/>Fang Wang’s face broke into a satisfied smile, feeling that such a grand scenery was perfect for practicing his punches.<br/><br/>He approached the edge of a cliff and began practicing his punches towards the bright sun in the sky.<br/><br/>The Mountain River Town Heaven Fist had only a few simple moves, much like most spells, mainly focusing on the methods of circulating energy and activating certain meridians.<br/><br/>Fang Wang assumed a horse stance, punching out one fist after another, recalling the cultivation methods and circulating energy as he did so.<br/><br/>On the first day, he punched towards the proud sun ten thousand times.<br/><br/>Each subsequent day, he maintained the count of ten thousand punches.<br/><br/>After ten years, he was throwing twenty thousand punches each day, maintaining this pace for five years. Beyond that, his daily count of punches rose to thirty thousand!<br/><br/>Day after day of punching, in the Heavenly Palace, though his consciousness did not tire endlessly nor was his body without soreness, once he got used to it, he could clearly feel the increase in physical strength.<br/><br/>When he had trained the Mountain River Town Heaven Fist to minor achievement, he could punch across the air and blow up a mountain peak hundreds of meters away, displaying a frightening destructive power.<br/><br/>However, the true intricacy of the Mountain River Town Heaven Fist was not in its ferocity, but in the understanding of space.<br/><br/>A punch that broke the heavens, shattered the space!<br/><br/>Fang Wang delved into a previously unexplored method of cultivation, shaking off the dullness, and began to train the fist technique with renewed vigor.<br/><br/>With this training, a hundred years passed!<br/><br/>Fang Wang mastered the Mountain River Town Heaven Fist to Great Completion, yet the Heavenly Palace did not release him, which meant there was still room for improvement in the Mountain River Town Heaven Fist.<br/><br/>He could only continue to comprehend.<br/><br/>Once he had completely mastered the Mountain River Town Heaven Fist to the Great Perfection Realm, he looked back to find that three hundred and thirty years had passed!<br/><br/>With the Mountain River Town Heaven Fist at Great Perfection, he was able to shatter the space of a miniature world with one punch. As long as his cultivation was strong, breaking through the heavens was not impossible.<br/><br/>Zhu Changsheng had taken two hundred years to master the Mountain River Town Heaven Fist, but it might not have been to the Great Perfection Realm, perhaps only having reached mastery!<br/><br/>To think that Fang Wang could master the Mountain River Town Heaven Fist, it was also because he utilized the essence of the Combat Heart, turning his body into a Divine Weapon.<br/><br/>In this world, the more profound the art, one could not guarantee mastering it by merely continuing to cultivate. The most domineering aspect of the Heavenly Palace was that it could indeed help Fang Wang achieve Great Perfection in any art!<br/><br/>Just like that, Fang Wang’s vision blurred, and then, he returned to reality.<br/><br/>The white-haired elder was still laughing as if he had heard the funniest joke in the world.<br/><br/>Xiao Zi stared at Fang Wang and suddenly realized that his gaze had changed.<br/><br/>Her heart stirred with excitement. Each time the Young Master cultivated, he would undergo this strange change in state, indicating he had mastered the Mountain River Town Heaven Fist.<br/><br/>This fact, she never mentioned to anyone because she herself was baffled.<br/><br/>After all, geniuses tend to be incomprehensible to ordinary beings. Zhao Zhen didn’t think much of it, his focus still on the glowing characters in the air.<br/><br/>After the white-haired elder finished laughing, he looked at Fang Wang and asked. “You say it is not difficult, then how long will you need to master it?”<br/><br/>Fang Wang raised his right hand, his gaze fixed on it. His right hand formed into a fist, and suddenly, the surging Spiritual Energy within the ancient city crazily rushed towards him, converging on his right fist.<br/><br/>A powerful gust from the punch made Zhao Zhen involuntarily look over.<br/><br/>Fang Wang’s black hair fluttered, and the white-haired elder’s eyes widened, his lips trembling.<br/><br/>“Could it be… Impossible!”<br/><br/>The white-haired elder couldn’t help but cry out in alarm, no longer able to maintain his previous composure.<br/><br/>Upon hearing this, Zhao Zhen looked toward Fang Wang with a strange glint in her eyes.<br/><br/>Could it be…<br/><br/>Zhao Zhen suddenly understood why Lu Yuanjun’s Xuanming Seal had failed.<br/><br/>It was very likely that Fang Wang had already mastered the Yin Yang Xuan Ming Zhen Gong…<br/><br/>Boom!<br/><br/>As Fang Wang began to concentrate on the Mountain River Town Heaven Fist, the entire ancient city trembled with him, as if an earthquake had struck, making Xiao Zi and Zhao Zhen tense up.<br/><br/>Just by clenching his fist, Fang Wang possessed such might!<br/><br/>Xiao Zi was full of admiration, while Zhao Zhen found it unbelievable.<br/><br/>The white-haired elder hurriedly shouted, “Stop! Stop now!”<br/><br/>Upon hearing this, Fang Wang immediately relaxed his right fist, the surging spiritual energy around him dissipated, the domineering aura vanished, and peace returned to the ancient city.<br/><br/>The white-haired elder breathed a sigh of relief. He looked at Fang Wang with a complex expression and asked, “Have you ever learned the Mountain River Town Heaven Fist before?”<br/><br/>Fang Wang shook his head, “No, and even if I had learned it before, I have already mastered it. Doesn’t that count as passing the trial?”<br/><br/>The white-haired elder’s heart was filled with mixed feelings.<br/><br/>How could someone possibly master the Mountain River Town Heaven Fist all at once without having learned it before?<br/><br/>The white-haired elder always felt that Fang Wang wasn’t deceiving him, and the reactions of the serpent demon and the ghost did not seem fake.<br/><br/>The more he thought about it, the more uncomfortable he felt. He had yet to personally teach, yet Fang Wang had learned solely from the text…<br/><br/>This is against the natural order!<br/><br/>Are the geniuses of the Mortal Realm after three thousand years all so gifted?<br/><br/>If indeed he is a genius who could learn so quickly…<br/><br/>The white-haired elder seemed to think of something, and his gaze toward Fang Wang changed.<br/><br/>“Hey, old man, you’re not going to back out, are you?”<br/><br/>Xiao Zi couldn’t help but speak out, her tone unfriendly.<br/><br/>The white-haired elder smiled and said, “Why would I go back on my word? Follow me. ”<br/><br/>With that, he turned around, and the stone statue trembled. Gaps appeared at its base, which then began to sink.<br/><br/>As the stone statue descended into the ground, an opening appeared. The white-haired elder floated into it.<br/><br/>Fang Wang immediately followed, with Xiao Zi and Zhao Zhen closely behind. A staircase appeared below the entrance, leading down into the dark depths. A human, a demon, and a ghost descended the stairs.<br/><br/>“Since His Majesty’s fall, ten thousand years have passed. Many people and demons have come to seek fortune, but only three have mastered the Mountain River Town Heaven Fist: you, Zhu Changsheng, and a demon of unmatched prowess, who was only given the teachings due to his ancestors serving as the Demon Generals for His Majesty,” the white-haired elder said as he floated ahead, as if recounting the past.<br/><br/>Xiao Zi asked curiously, ‘What’s the name of that demon?” “Qi Tian. I wonder if he’s made a name for himself now?”<br/><br/>“Never heard of him.”<br/><br/>“That’s to be expected. Five thousand years have passed since then. It’s hard to say whether he’s dead or alive.”<br/><br/>Thus, the conversation between Xiao Zi and the white-haired elder echoed through the tunnel, while Fang Wang and Zhao Zhen listened without speaking.<br/><br/>After navigating the winding tunnel, they finally arrived at an underground palace.<br/><br/>As soon as he walked through the entrance, Fang Wang saw walls, the ceiling, and the floor covered in text.<br/><br/>“This is where the Heavenly Gang Saint Body Technique is recorded. Where to start reading, I do not know. Perhaps this is another trial set by His Majesty,” said the white-haired elder, stroking his beard.<br/><br/>Xiao Zi couldn’t resist snarking, “Another trial? If they didn’t want to teach others, why leave clues at all?”<br/><br/>The white-haired elder glared at her, replying with annoyance, “This is part of cultivation as well. If I merely handed you the technique to practice, you still wouldn’t succeed.”<br/><br/>Fang Wang didn’t question further. He walked to the center of the hall, looking around.<br/><br/>The place was covered with text, dense and numerous, easily totaling tens of thousands of characters, with no clear beginning or end. Fang Wang wasn’t in a rush but began to read carefully.<br/><br/>The studious Zhao Zhen also observed.<br/><br/>“If Qi Tian can learn, I want to give it a try too!” Xiao Zi huffed, climbing onto Fang Wang’s shoulder, looking around.<br/><br/>The white-haired elder chuckled, stroking his beard, “Whether Qi Tian has learned it, I do not know. Only Zhu Changsheng mastered it here before departing.”<br/><br/>Xiao Zi asked, “How many years did Zhu Changsheng take?”<br/><br/>“Eight hundred years.”<br/><br/>“What, eight hundred years? How is he not dead?”<br/><br/>The one speaking was Zhao Zhen, who was always fascinated by immortality.<br/><br/>Could it be that Zhu Changsheng had achieved eternal life?<br/><br/>Xiao Zi then said, “I remember, after the founder of the Ji Hao Sect established the sect, he abdicated in less than two hundred years. Could it be that his end was near? Tsk, what’s the point of that, when he spent most of his life on it?”<br/><br/>Zhao Zhen seriously said, “Without cultivation, one might not even have two hundred years of leisure. Moreover, he only abdicated; that doesn’t necessarily mean he died.\t\t\t\t\t\t</div>", "images": {}, "success": true}