{"id": 120, "url": "https://www.novelhall.com/i-became-an-immortal-on-mortal-realm-32879/14296537.html", "title": "Chapter 120 - Chapter 120: Chapter 117 Tai Cang Immortal Mansion, Descending Dragon Great Saint’S Sole Disciple", "volume": 2, "volume_title": "Volume 2", "body": "<h1>Chapter 120 - Chapter 120: Chapter 117 Tai Cang Immortal Mansion, Descending Dragon Great Saint’S Sole Disciple</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 120: Chapter 117 Tai Cang Immortal Mansion, Descending Dragon Great Saint’s Sole Disciple<br/><br/>Translator: 549690339<br/><br/>The Quest for Immortality!<br/><br/>Xiao Zi and Zhao Zhen’s eyes both lit up. They had been following Fang Wang, and if Fang Wang were to become an immortal, they naturally stood to benefit. Hence, there was no jealousy, only excitement and anticipation.<br/><br/>Xiao Zi eagerly inquired about the specific opportunity, but the white-haired elder only smiled without speaking, his gaze fixed on Fang Wang from afar. The day turned dark as the moon shone brightly, and day and night alternated.<br/><br/>Days passed by.<br/><br/>In a blink of an eye, another half year had gone by.<br/><br/>Fang Wang’s physical body had finally transformed into the Heavenly Gang Saint Body, and his cultivation had entered the Third Layer of the Condensation Spirit Realm.<br/><br/>Going forward, he could still temper his physique to strengthen the vitality and power of the Heavenly Gang Saint Body.<br/><br/>However, he did not plan to continue cultivating there. Having left the Great Abyss Gate for three years, it was time to return.<br/><br/>Abyss Gate for three years, it was time to return.<br/><br/>Fang Wang stood up and took out a set of black clothes from his storage bag to put on. His figure had not changed much, but if one looked closely, one could clearly feel that his physique had become tougher, a body that seemed lean but exuded a strong sense of power.<br/><br/>After he had dressed, the white-haired elder, Xiao Zi, and Zhao Zhen approached.<br/><br/>The way they looked at Fang Wang was full of fervor.<br/><br/>Fang Wang bowed with folded hands to the white-haired elder, saying, “Thank you for your guidance, senior. I hope you can forgive my disrespect during the previous time.”<br/><br/>The white-haired elder did not expect Fang Wang to apologize and his opinion of him improved. So he spoke up, “No harm done. After all, the Heavenly Gang Saint Body is a divine body among mortals, and I can understand the influence it had on you. Before you leave, I have prepared an opportunity to bestow upon you.”<br/><br/>Here it comes!<br/><br/>Even though he had been in the Zhui Tian Secret Realm for over twelve hundred years, he had not forgotten that gathering the Three Great True Cultivations could lead to the Quest for Immortality.<br/><br/>The white-haired elder raised his right hand, and suddenly a gap opened in the sky above, revealing a vista of the universe and its stars. Following that, a long wooden box flew out. With a wave of his hand, the box landed in Fang Wang’s hands.<br/><br/>“What is this?”<br/><br/>Fang Wang asked, frowning, feeling a sense of foreboding in his heart.<br/><br/>It couldn’t possibly be another map, could it?<br/><br/>The white-haired elder stroked his beard and chuckled, “This contains the key to the Tai Cang Immortal Mansion. The Tai Cang Immortal Mansion appears in the Mortal Realm once every ten thousand years, and it should be about a thousand years until the next time. With this key, it will guide you to the Tai Cang Immortal Mansion. His Majesty devoted his entire life to pursuing the<br/><br/>Immortal Mansion, which is why he established the Three Great True Cultivations. Unfortunately, he did not succeed. His Majesty asked me to leave this key to someone with greater talent than him, in the hopes of bringing immortals to the Mortal Realm.”<br/><br/>“Zhu Changsheng, although he attained the Heavenly Gang Saint Body Technique, falls short compared to His Majesty. In addition, before His Majesty passed away, he proposed the concept that the Three Great True Cultivations could be fused into one Divine Skill, but he did not succeed. If you can do it, I hope you will bring back your insights to share with me, how’s that?”<br/><br/>Upon hearing this, Fang Wang thought there was no rush, with a thousand years at his disposal. As for the white-haired elder’s request, he had no objections.<br/><br/>“Of course. The Three Great True Cultivations were created by the Great Saint, who can be regarded as my mentor. I should repay the Great Saint,” Fang Wang said sincerely.<br/><br/>Although his own efforts played a part, the Great Saint’s legacy truly helped him substantially, which made him highly respect the Great Saint.<br/><br/>“Mentor?”<br/><br/>The white-haired elder paused, then suddenly burst into laughter.<br/><br/>Fang Wang looked at him in confusion, as did Xiao Zi and Zhao Zhen.<br/><br/>The white-haired elder looked at Fang Wang and said with a smile, “In that case, you should formally take His Majesty as your master, what do you say?”<br/><br/>Upon hearing this, Fang Wang hesitated and said, “That seems inappropriate, and besides, the Great Saint is no longer with us, that would seem disrespectful to him…”<br/><br/>“His Majesty already had this in mind before he died. Let’s settle it this way, from now on, you will be the sole disciple of the Descending Dragon Great Saint, and this will be your proof of identity.”<br/><br/>While speaking, the white-haired elder waved towards Fang Wang, and a golden ring fell into his hands.<br/><br/>The ring was set with a piece of red jade, surrounded by two finely crafted golden dragons as if they were playing with a pearl. Indistinctly, Fang Wang saw some sort of liquid flowing inside the red jade.<br/><br/>“This is the Dragon Jade Ring, a symbol of His Majesty, and also a unique<br/><br/>Profound-grade Storage Magical Treasure in the world. If you encounter His Majesty’s descendants in the future, this ring will surely ensure they do not treat you lightly, and they may even assist you,” the white-haired elder said cheerfully.<br/><br/>Fang Wang was overjoyed upon hearing this and immediately thanked the white-haired elder.<br/><br/>A Profound-grade Magical Treasure?<br/><br/>Could it be that above the supreme magical artifact lay the yellow-grade and Profound-grade Magical Treasures?<br/><br/>Following that, the white-haired elder said, “I am ready to send you out. Do not resist. ”<br/><br/>Fang Wang quickly placed the wooden box into his storage bag and slipped the Dragon Jade Ring onto the index finger of his right hand. Xiao Zi climbed onto Fang Wang’s shoulder, and Zhao Zhen entered the Soul Devouring Gourd.<br/><br/>The white-haired elder smiled knowingly, finding the combination a bit amusing.<br/><br/>He didn’t say much more, his gaze intensifying, and Fang Wang felt a powerful force approaching. If it were the old him, he would have been powerless to resist, but now that he had cultivated the Heavenly Gang Saint Body, he felt capable of breaking free.<br/><br/>In an instant, Fang Wang and Xiao Zi vanished into thin air.<br/><br/>The white-haired elder stood by the lake, stroking his beard and gazing into the distance, a contemplative expression on his face.<br/><br/>“A prodigy like this emerging in the Mortal Realm means the future will surely be exciting. I look forward to our next meeting,” the white-haired elder murmured to himself.<br/><br/>He turned around, waved his hand, and instantly, souls began to rise from the ground. Among them were those slain by Fang Wang, like Liang Xunqiu and Lanxin Xianzi. Most of them were confused upon their souls emerging, not understanding what had happened.<br/><br/>The white-haired elder looked at them, his kind face transforming into a stern one with his eyes wide open, exuding a rebellious aura.<br/><br/>As soon as Fang Wang felt his feet touch the ground, he immediately opened his eyes and found that he hadn’t appeared inside the Zhui Tian Waterfall but on the banks of the Wei River, looking up and down the river without a single sign of the Zhui Tian Waterfall.<br/><br/>Zhao Zhen emerged and noticed this as well, he couldn’t help but remark, “It seems the Zhui Tian Secret Realm doesn’t exist solely within the Zhui Tian Waterfall, the entrance is just there.”<br/><br/>Fang Wang sat down on the spot and began to refine the Dragon Jade Ring.<br/><br/>Xiao Zi dove into the river to start eating fish.<br/><br/>Zhao Zhen hovered in mid-air, watching Fang Wang, his eyes brimming with anticipation.<br/><br/>This year, Fang Wang had gained immense fortunes.<br/><br/>He was very much looking forward to Fang Wang’s subsequent performance.<br/><br/>The seven dynasties?<br/><br/>Heaven’s Larceny Saint Sect?<br/><br/>It was not just about that, Fang Wang was destined to traverse this continent and explore even vaster realms. Following Fang Wang, he would definitely see sceneries beyond a mortal’s reach.\t\t\t\t\t\t</div>", "images": {}, "success": true}