{"id": 129, "url": "https://www.novelhall.com/i-became-an-immortal-on-mortal-realm-32879/14299722.html", "title": "Chapter 129 - Chapter 129: Chapter 126: The Fifth Lifespirit Treasure [Seeking Monthly Pass]", "volume": 2, "volume_title": "Volume 2", "body": "<h1>Chapter 129 - Chapter 129: Chapter 126: The Fifth Lifespirit Treasure [Seeking Monthly Pass]</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 129: Chapter 126: The Fifth Lifespirit Treasure [Seeking Monthly Pass]<br/><br/>Translator: 549690339<br/><br/>Fang Wang heard Zhao Zhen’s words but remained indifferent. The world was vast, and there were many with great fate, not to mention the existence of the Upper Realm. In his view, the Cross-Void Realm was not all that impressive.<br/><br/>He focused on consolidating his cultivation level.<br/><br/>The Solaris Scripture detailed the breakthrough methods for each cultivation level, but did not specify the names of the realms. Fang Wang speculated that this might be because the scripture was ancient and disconnected from the current era. However, judging from the breakthrough methods mentioned later, he was still far from reaching the end of his cultivation journey. Moreover, it was still uncertain whether the endpoint of the Solaris Scripture was the ultimate endpoint in the Mortal Realm.<br/><br/>Days passed in this manner.<br/><br/>A full month went by before Fang Wang finally consolidated his cultivation level.<br/><br/>He took out his Token of the Eldest Disciple and summoned the high-ranking members of the Great Abyss Gate. In the past few days, people often loitered in front of Shiyuan Hall, but hesitated to disturb him. This made him realize the senior members had urgent matters to discuss with him.<br/><br/>One by one, everyone entered Shiyuan Hall and paid their respects to Fang Wang.<br/><br/>“Zhao Qi has been captured, and Xu Qiuming suffered a terrible defeat at the hands of the Carefree Immortal and has also been captured. Their fates are uncertain. The Carefree Immortal has issued an ultimatum, demanding that you visit him on North Border Heavenly Summit Mountain within a year. Otherwise, he threatens to massacre the Grand Qi Kingdom,” Zhao Chuanqian swiftly said with a grave tone.<br/><br/>The Carefree Immortal?<br/><br/>Quite the pretentious title!<br/><br/>Fang Wang asked, “Why didn’t he come to find me directly?”<br/><br/>Zhao Chuanqian shook his head, and Chai Yi took over the conversation, “I have already communicated with the other sects, preparing to join forces to travel to Apex Mountain and encircle the Carefree Old Devil.”<br/><br/>The Carefree Old Devil?<br/><br/>Quite good at naming, indeed.<br/><br/>Fang Wang almost laughed, but he held back.<br/><br/>Yang Yuanzi frowned and said, “Clearly, the Carefree Immortal is plotting something. The one-year timeframe seems arrogant, but perhaps he is also making preparations. As far as I know, Apex Mountain is the tallest among the Seven Dynasties, the closest place to the heavens. The extreme cold there is no coincidence; he chose this place for a reason.”<br/><br/>The other Peak Masters and elders began to speculate. “Could it be he is preparing a Formation?”<br/><br/>“Possible. Does that Formation relate to ice and frost?”<br/><br/>“If Fang Wang does not go, wouldn’t his plan fall apart?”<br/><br/>“After all, our Sect Leader is already the number one cultivator in Grand Qi and possesses the Heaven Yuan Spirit Treasure. How could he fear battle? The Carefree Immortal is banking on exactly this.”<br/><br/>“No matter, if he can prepare in this year, can’t we?”<br/><br/>Listening to their discussion, Fang Wang was recalling how the Carefree Immortal targeted Ji Rutian in his past life.<br/><br/>Ji Rutian had no association with Grand Qi, so the Carefree Immortal naturally wouldn’t use Grand Qi as a threat.<br/><br/>But why did the Carefree Immortal also capture the Seven Dynasties Emperor in the previous life?<br/><br/>The emperor…<br/><br/>Fang Wang always felt that the emperor and the Heaven Yuan Spirit Treasure had some special significance to the Carefree Immortal.<br/><br/>“Since he mentioned a year, let’s wait half a year first. In the meantime, you can investigate. He dares to call himself the Carefree Immortal, which means he is very arrogant. He must have left traces in other kingdoms,” Fang Wang said.<br/><br/>Although he did not fear the Carefree Immortal, he also wanted to wait, to shape his Lifespirit Treasure first!<br/><br/>The senior members had no objections and they discussed other sect affairs afterward. With over two hundred thousand Tai Yuan Sect Disciples, more than half of them were outside, while some settled around the Spirit Vein areas or guarded the sect’s Heavenly Material Treasure Spirit Zone. All affairs would be reported back to the Main Meridian.<br/><br/>Another hour passed.<br/><br/>After Fang Wang sent them away, he immediately took out the Token of the Eldest Disciple and projected a telepathic message to Zhou Xue, “Come back quickly to support the new Sect Leader. I can’t hold on any longer.”<br/><br/>Elsewhere.<br/><br/>Inside a dilapidated palace, Zhou Xue was reclining on a long chair, one hand propping her head, the other holding a Disciple Token of the Great Abyss Gate. She was dressed in a red and black gown, hair neatly arranged, make-up vivid. She looked enchanting, yet exuded an air of authority.<br/><br/>Hearing the voice from the Disciple Token, Zhou Xue’s lips curled into a smirk. Then, the Token in her hand suddenly disappeared, and a ring on her right hand glimmered briefly.<br/><br/>Zhou Xue closed her eyes to feign rest, but her right hand was lightly tapping her thigh with her fingers.<br/><br/>After a while,<br/><br/>A woman clad in black strode into the hall and knelt before her, saying in a deep voice, “They have all been cleanly dispatched. Not one survived.”<br/><br/>Zhou Xue got up from her seat, patted the shoulder of the woman in black, and walked out of the hall. The black-clad woman hastily got up and followed closely behind.<br/><br/>In the North Border, on Heavenly Summit Mountain,<br/><br/>Icebergs stretched for thousands of miles , rolling and undulating. The Firmament here was gloomy, the cold wind and snow blowing mercilessly. The rugged peaks were like stark sword blades piercing the sky and earth, incredibly sharp.<br/><br/>Among the peaks was a cliff, flat as if cleaved by a Sword Blade, upon which was built a circular stone platform. Around the platform were eight iron cages, each plastered with numerous Talisman Papers.<br/><br/>Xu Qiuming and Zhao Qi were inside these cages. The pride of the Suspended Vast Sword Sect and the True Dragon Emperor of Grand Qi were now reduced to prisoners, in a sorry state.<br/><br/>The emperors of the other dynasties were in a similar state, all injured, clearly having been tortured.<br/><br/>Xu Qiuming was in the midst of meditation, his brow furrowed deeply.<br/><br/>“Xu Qiuming, what do you think he is really up to?” Zhao Qi’s voice came from nearby, prompting Xu Qiuming to open his eyes and look into the distance.<br/><br/>On a sharp peak next to the cliff, the Carefree Immortal maintained a strange posture, squatting like a wolf on the mountain peak, one hand on the rock face, the other hand shaped like a claw, his head and hand both pointing towards the dark Firmament.<br/><br/>“Could he be a monster?”<br/><br/>The Grand Wei Emperor murmured, unable to hide his fear.<br/><br/>On the other side of the stone platform, the Grand Chu Emperor snorted, “He indeed is absorbing the Essence of the Sun and Moon. A person practicing monstrous Dao, truly heretical and unorthodox.”<br/><br/>The North Border Emperor expressed his concern, “In this desolate cold place, what exactly is he planning to do? I fear he might commit acts against the heavens and reason.”<br/><br/>The emperors of the various dynasties spoke one after another, their voices not too low for fear of being masked by the winds and snow; yet, even so, they failed to disturb the carefree Immortal.<br/><br/>Xu Qiuming gazed at the carefree Immortal from afar, his numb eyes filled with an unwilling color.<br/><br/>Since the battle with the Chi Devil Sect, he had believed he would no longer face defeat, and if he were to lose, it could only be to Fang Wang. He hadn’t expected reality to teach him such a harsh lesson.<br/><br/>“Could it be that I’m really mediocre… Am I not one born extraordinary…” “Father, do I truly possess a heavenly destiny?<br/><br/>As Xu Qiuming thought this, his hands clenched into fists involuntarily.<br/><br/>Suddenly, he thought of Fang Wang.<br/><br/>He wondered how Fang Wang coped with failure.<br/><br/>No, had he ever failed?<br/><br/>The news of Fang Wang’s tribulation spread like wildfire within the Grand Qi Cultivation Realm, and the term “Cross -Void Realm” forcefully made its way into the consciousness of Grand Qi Cultivators for the first time.<br/><br/>The title of Grand Qi’s Number One Cultivator firmly landed upon Fang Wang’s head.<br/><br/>An even greater event occurred inside the Great Abyss Gate; less than two months after Fang Wang’s successful tribulation, the Main Meridian erupted with a terrifying aura again. No one knew what Fang Wang was doing, but such an aura made everyone in the Great Abyss Gate more confident about the future of their sect.<br/><br/>Inside Shiyuan Hall.<br/><br/>Fang Wang played with a gold-edged jade seal in his hand. The seal was square and solid, featuring four intertwined qilin statues; it was not too large and could be held in one hand.<br/><br/>Xiao Zi came closer to observe carefully, while Zhao Zhen floated in midair, looking at the gold-edged jade seal with a curious gaze.<br/><br/>“What is this seal called?” Xiao Zi asked curiously.<br/><br/>Fang Wang smiled and said, “The Six Harmonies and Eight Desolations Seal.” Xiao Zi was puzzled, “The Six Harmonies and Eight Desolations?”<br/><br/>“The Six Harmonies and Eight Desolations are vast, and this seal can also cover a vast space,” Fang Wang replied with profound meaning. He grew fonder of the Six Harmonies and Eight Desolations Seal the more he looked at it; it was his fifth Lifespirit Treasure.<br/><br/>Zhao Zhen followed up with a question, “Master, what mighty power does this treasure possess?”<br/><br/>Fang Wang raised an eyebrow and said, “You shall see when it’s time to confront the carefree Immortal.”<br/><br/>Upon hearing this, Zhao Zhen smiled and said, “Then I must preemptively mourn for the carefree Immortal. He is likely to face the most tragic suppression in the world.”<br/><br/>Fang Wang flipped his right hand, and the Six Harmonies and Eight Desolations Seal disappeared from his hand.<br/><br/>Then, he stood up, ready to go for a walk outside.<br/><br/>The Fang Family now had more than thirty disciples in the Great Abyss Gate, some of whom were Fang Wang’s descendants. However, Fang Wang would not seek them out, for he only planned to visit the seven original disciples who joined the Great Abyss Gate.<br/><br/>Fang Hanyu, Fang Zigeng, Fang Ziqing, Fang MO, Fang Xin, Fang Chen, Fang Lin.<br/><br/>Among these seven, Fang Hanyu had fared the best, achieving the highest cultivation level, followed by Fang Zigeng. The other five, though mediocre, all advanced to the rank of sword-wielding disciples, thanks to the prestige of Fang Wang and two others. Even if they could not reach higher realms in their cultivation later on, they would at least be able to assist the Fang Family.<br/><br/>This time, Fang Wang was quite pleased; the clan members no longer felt so uneasy around him.<br/><br/>Their ease was mainly due to their curiosity about him.<br/><br/>Being of the same generation, they were curious about just how strong Fang Wang had become, what the world looked like through his eyes, and whether he was ready to accept the challenge from the carefree Immortal.<br/><br/>Three months later.<br/><br/>Zhou Xue finally returned, and Fang Wang still remained inside Shiyuan Hall, not in a hurry to take action, aligning with the intentions of the higher echelons of the Great Abyss Gate—they wanted to investigate first.<br/><br/>Inside Shiyuan Hall.<br/><br/>Zhou Xue stood above the hall, looking at Fang Wang and smiling, “You really have the presence of a Sect Leader. Why don’t you just keep sitting there?”<br/><br/>Fang Wang rolled his eyes and said, “I don’t want to; you better find someone to replace me quickly.”<br/><br/>Zhou Xue chuckled, shifting the topic, “That carefree Immortal should be in the Golden Body Realm. Are you ready to face him?”<br/><br/>“Golden Body Realm?” Fang Wang inquired.<br/><br/>“Yes, the Golden Body Realm is above the Cross-Void Realm. I’ve done some investigating; the carefree Immortal is a traitor from Heaven’s Larceny Saint Sect, who has changed his name and claimed to be the carefree Immortal. He likely wants to perform a heaven-sacrificing ritual to exchange destinies, to obtain the dragon qi of an emperor, as well as your Heaven Yuan Spirit Treasure, in order to create a treasure beyond Heaven Yuan. The reason he needs a year is likely that he’s establishing the Kun Long Huan Tian Formation, one of the three great saint formations of Heaven’s Larceny Saint Sect,” Zhou Xue said, her face wearing a faint smile as she relayed this information.<br/><br/>Fang Wang raised an eyebrow and asked, “Do you know this formation?” Zhou Xue responded with a smile and no words.<br/><br/>Fang Wang snorted, “Dreaming of taking my life, he’s delusional. I will make him regret it.”<br/><br/>Zhou Xue laughed and said, “This matter has already spread throughout the Seven Dynasties. Cultivators have already started heading to Apex Mountain. Since that’s the case, I won’t accompany you. You’ll face your ordeal alone, proving to the world just how strong your heavenly destiny is.”<br/><br/>Fang Wang looked at her and said calmly, “I will hang his severed head on the gates of the Grand Qi Imperial City, as a warning to all dynasties and sects..”\t\t\t\t\t\t</div>", "images": {}, "success": true}