{"id": 122, "url": "https://www.novelhall.com/i-became-an-immortal-on-mortal-realm-32879/14296795.html", "title": "Chapter 122 - Chapter 122: Chapter 119 The Position Of Sect Leader", "volume": 2, "volume_title": "Volume 2", "body": "<h1>Chapter 122 - Chapter 122: Chapter 119 The Position Of Sect Leader</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 122: Chapter 119 The Position of Sect Leader<br/><br/>Translator: 549690339<br/><br/>Fang Wang’s fist clenching caused such a stir throughout the Great Abyss Gate that those disciples who had not witnessed his appearance stepped out of their caves one after another, asking what had happened.<br/><br/>Soon, the news that Fang Wang’s mere clenching of his fists had frightened the Vast Qi Sect’s supreme elders and disciples into bowing and apologizing spread rapidly.<br/><br/>Everyone had felt the might of the Mountain River Town Heaven Fist, so no one would question it, while those who had not seen it unfold began to wildly imagine.<br/><br/>On the other side.<br/><br/>Fang Wang followed the senior members of the Great Abyss Gate into the Shiyuan Hall, where everyone surrounded him with endless praise, filling the hall with noise.<br/><br/>Guang Qiuxian did not intervene, as he too needed time to calm his emotions.<br/><br/>In fact, before Fang Wang’s return, he had fantasized about how strong Fang Wang would be when he came back.<br/><br/>But he had never imagined…<br/><br/>The Cliff Hermit was an existence above the Condensation Spirit Realm, yet Fang Wang’s mere fist clench forced him to bow his head; such strength…<br/><br/>Looking at Fang Wang, Guang Qiuxian felt both pleasantly surprised and somewhat desolate.<br/><br/>The Vast Qi Sect, which had nearly suffocated him, was nothing in front of Fang Wang, making Guang Qiuxian feel utterly inadequate by comparison.<br/><br/>After exchanging pleasantries with the senior members of the Great Abyss Gate for quite a while, Fang Wang finally found an opportunity to approach Guang Qiuxian and inquired, “Is the trouble brought by the Vast Qi Sect serious?”<br/><br/>Just scaring away the Cliff Hermit and Xu Guang meant that the matter was far from over, but since Guang Qiuxian was the Sect Leader, Fang Wang naturally couldn’t kill if he did not permit it.<br/><br/>Guang Qiuxian sighed and then gave Zhao Chuanqian a look. Stepping forward, Zhao Chuanqian explained the predicament facing the Great Abyss Gate.<br/><br/>The more Fang Wang listened, the more furrowed his brow became.<br/><br/>The Vast Qi Sect, along with other sects from Grand Qi, was threatening the Great Abyss Gate?<br/><br/>Fang Wang was not angry at the other sects. If he were in their position, he would certainly be more concerned about the transformation of Grand Qi into a Cultivation Dynasty, but he had not expected this plan to involve a special kind of Spirit Stone. No wonder Grand Qi had not become a Cultivation Dynasty before; Lu Yuanjun must have been instrumental in this change, likely having ties to the Heaven’s Larceny Saint Sect.<br/><br/>With his death, the followers of the Heaven’s Larceny Saint Sect in charge of supplying these Spirit Stones naturally fled.<br/><br/>Fang Wang also considered another issue – would the escaped followers relay the news back to the Heaven’s Larceny Saint Sect, potentially inciting them to move south?<br/><br/>This matter would require a thorough discussion with Zhou Xue.<br/><br/>“We have already contacted the Jin Xiao Sect. They have agreed to align with the Great Abyss Gate. If the Vast Qi Sect attacks, the Jin Xiao Sect will stand with us, and in return, we will support them to become one of the Nine Great Sects. To this end, the Jin Xiao Sect will send some disciples to the Great Abyss Gate for an exchange and to send a signal to the Grand Qi Cultivation Realm,” Zhao Chuanqian said earnestly.<br/><br/>Fang Wang did not find the cooperation with the Jin Xiao Sect objectionable; on the contrary, he admired their straightforwardness.<br/><br/>Daring to support the Great Abyss Gate at this critical juncture was no ordinary courage, and it also indicated that Jin Xiao Sect’s strength was far more formidable than they had perceived.<br/><br/>Before Fang Wang’s return, Zhao Chuanqian had indeed been wary of the Jin Xiao Sect, but now, he was fearless.<br/><br/>And he was not the only one; all the Peak Masters and elders shared this sentiment.<br/><br/>Fang Wang spoke, “I will stay within the sect to cultivate until I break through. Whether it’s the Vast Qi Sect or any other sect, if anyone dares to invade, I will ensure they carry their regrets to the Netherworld for penance.”<br/><br/>His words gave everyone an immense sense of comfort.<br/><br/>In the past, they might have reprimanded Fang Wang for his aggressive spirit, but in this past year, the Vast Qi Sect had truly pushed them too far.<br/><br/>“That’s good, Fang Wang. Once your seclusion is over, I will hand over the Sect Leader position to you, how about that?” Guang Qiuxian asked cheerfully, without anyone else displaying agitation, instead looking expectantly towards Fang Wang.<br/><br/>Fang Wang hesitated, “Reporting to the Sect Leader, I’ve found that I’m not suited to be a Sect Leader. I even feel somewhat unworthy of the position of chief disciple. Over the years, I’ve been contemplating this issue. Please train another Sect Leader for Great Abyss Gate. I want to devote my time to cultivation. Of course, I will always belong to Great Abyss Gate. Anyone who targets Great Abyss Gate is offending me, Fang Wang!”<br/><br/>He fought for the position of chief disciple to challenge Lu Yuanjun, and naturally, he could not disclose this matter.<br/><br/>“This…”<br/><br/>Guang Qiuxian frowned, finding it difficult to handle.<br/><br/>Yang Yuanzi intervened, smoothing things over, “Let Fang Wang rest first. As for the next Sect Leader, we can discuss that later.’<br/><br/>The others echoed in agreement, as any discerning person could see that the Great Abyss Gate no longer served a purpose for Fang Wang. Why bind him with the position of Sect Leader?<br/><br/>Guang Qiuxian nodded, “Fang Wang, go rest. And if we need your help, I won’t hesitate to ask. Don’t worry about these matters.”<br/><br/>Fang Wang nodded and immediately bowed to the other senior members before turning to leave.<br/><br/>Once Fang Wang had left the Shiyuan Hall, the Peak Masters and elders felt a great sense of emotion, all feeling that the heavens had blessed the Great Abyss Gate.<br/><br/>Zhao Chuanqian spoke up, “Sect Leader, even if Fang Wang doesn’t want to be the Sect Leader, it would be best to choose from among the Fang Family<br/><br/>Disciples. It just so happens that Zhou Xue, Fang Hanyu, and a disciple named<br/><br/>Fang Zigeng have shown promising performance and are worth cultivating.”<br/><br/>The second lineage Peak Master furrowed his brow, “By doing so, won’t the<br/><br/>Great Abyss Gate bear the Fang surname from now on?”<br/><br/>Greedy Sleeper calmly stated, “I think that Disciple Brother Zhao makes a valid point. Even if it bears the Fang surname, it is better than the Great Abyss Gate falling into obscurity. Besides, after our generation has passed, what will the Great Abyss Gate have to retain Fang Wang? Moreover, it’s not unprecedented for a family to hold successive Sect Leader positions. As long as the Great Abyss Gate can flourish, future generations will break the family’s monopoly.” This statement led others to nod their heads in agreement.<br/><br/>The Great Abyss Gate indeed could not afford to lose Fang Wang.<br/><br/>Guang Qiuxian likewise fell into deep thought.<br/><br/>Elsewhere.<br/><br/>Fang Wang went to the first vein to visit Zhou Xue, only to find out that Zhou Xue was not there.<br/><br/>He then looked for Fang Hanyu and Fang Zigeng, but neither of them was around, leaving him no choice but to visit other clan members.<br/><br/>As the gap between him and the other clan members grew wider, they became increasingly reserved around him, even the once lively Fang Xin behaved this way, which made him feel somewhat helpless, but he could understand it as this was just human nature.<br/><br/>This resulted in Fang Wang returning to his own cave dwelling that day.<br/><br/>Sitting on the white jade bed, he looked around at the familiar yet strange cave dwelling, feeling as though he had forgotten something yet unable to remember what it was.<br/><br/>He shook his head and chuckled at himself, no longer dwelling on it, and started to sit cross-legged to practice his cultivation.<br/><br/>The emergence of the Vast Qi Sect and the potential threat of Heaven’s Larceny Saint Sect were incentives for Fang Wang to cultivate diligently.<br/><br/>He had to keep up the pace of growing stronger, ensuring that as long as his rate of improvement exceeded his enemies’ expectations, he could always remain undefeated.<br/><br/>Since mastering the Heavenly Gang Saint Body Technique, his strength had surged tremendously. Not to mention the Condensation Spirit Realm, even in the Cross-Void Realm, he was confident he could sweep away all adversaries. He must set higher standards for himself.<br/><br/>Being invincible within his realm didn’t mean just winning one-on-one or outnumbered battles, but being unmatched no matter how many foes of the same level came at him—that was the true definition of invincibility within his realm!<br/><br/>Hmph!<br/><br/>That would be his goal!<br/><br/>Fang Wang stopped thinking about it and focused on his cultivation.<br/><br/>Several days later, Xiao Zi returned with Zhao Zhen. Xiao Zit s name had already spread throughout Great Abyss Gate because it was Fang Wang’s demon pet, which made the disciples feel fond of it, showing no aversion; it had officially integrated into the Great Abyss Gate.<br/><br/>At the same time, the news about Fang Wang’s return and his frightening off the Vast Qi Sect’s elder with a simple clench of his fist wildly spread throughout the Grand Qi Cultivation Realm.<br/><br/>In less than a month, this topic was being discussed wherever cultivators gathered within the Grand Qi Cultivation Realm.<br/><br/>Suspended Vast Sword Sect.<br/><br/>Inside a spacious hall, dozens of sword cultivators convened, the least of whom were direct disciples, all sporting grave expressions.<br/><br/>Sect Master Xue Wunchen sat at the head, his face expressionless as he waited for the people in the hall to discuss.<br/><br/>Sword Sect’s Kong Xi stood up, faced Xue Wunchen, and said in a deep voice, “Sect Master, my stance remains unchanged. We cannot afford to be enemies of the Great Abyss Gate; we must align with it. Even if we listen to the Vast Qi Sect, do you think Grand Chu will truly help Grand Qi transform into a<br/><br/>Cultivation Dynasty?”<br/><br/>Since the battle at Sword Heaven Marsh, Kong Xi had become a staunch<br/><br/>supporter of Fang Wang, convinced that Fang Wang would become a leading figure in the Grand Qi Cultivation Realm. This stance had brought him a lot of criticism within the Suspended Vast Sword Sect.<br/><br/>Xu Qiuming then spoke up, “At the very least, Fang Wang no longer fears the<br/><br/>Vast Qi Sect. With such strength, we must exercise caution, or else Green<br/><br/>Cicada Valley and Chi Devil Sect might soon share our fate.”<br/><br/>He too held Fang Wang in high regard. After the battle with Chi Devil Sect, he no longer harbored any thoughts of comparing himself with Fang Wang; he only wished to try his best to follow in Fang Wang’s footsteps.<br/><br/>After he spoke, others joined in the conversation—some in favor, others against.<br/><br/>Many felt that Fang Wang’s rise was too rapid, like a tall tree that invites the wind, and he was certainly going to attract great trouble. Aligning with him seemed far too risky.<br/><br/>Of course, the most important concern was that Fang Wang’s growth posed a threat to the Suspended Vast Sword Sect itself.<br/><br/>Sect Master Xue Wunchen remained expressionless, not uttering a word.<br/><br/>After a long while.<br/><br/>When everyone had exhausted themselves with discussion and the room finally quieted down, all eyes turned to Xue Wunchen.<br/><br/>Xue Wunchen slowly began to speak, “Given the circumstances, let’s discuss how to recover our relationship with the Great Abyss Gate.”<br/><br/>As these words were spoken, many sighed with relief, and nearly half of them began to excitedly persuade against the notion.<br/><br/>They felt that if Fang Wang were allowed to continue growing, the Grand Qi Cultivation Realm would eventually be unified by the Great Abyss Gate, leaving no place for the Suspended Vast Sword Sect.<br/><br/>Xue Wunchen said sternly, “I have made up my mind. Think carefully, all of you. Forget the future—if Fang Wang were to attack us now, would any of you be willing to fight to the death in defense?”<br/><br/>Silence!<br/><br/>Everyone shut their mouths as the objectors flushed with embarrassment, no longer daring to speak.<br/><br/>Most cultivators prioritize their own life and death, finding it difficult to put the interests of their sect first. Their opposition was also rooted in self-interest.<br/><br/>“Sect Master, I am willing to go to the Great Abyss Gate and propose a peace,” Xu Qiuming stood up and said, drawing everyone’s attention to him.<br/><br/>Xue Wunchen’s gaze softened, and with a gentle sigh, he said, “Qiuming, this will be tough for you.”<br/><br/>Xu Qiuming, after all, was a favored son of heaven and now a well-known figure across the seven nations. Having him represent the Suspended Vast<br/><br/>Sword Sect to seek peace would tarnish his reputation once it became widely Imown.<br/><br/>Xu Qiuming calmly replied, “It is not a burden. I believe Fang Wang is not a man of brute force and irrationality. Looking at all the instances where Fang Wang has taken action, almost every one of them was provoked by others. He has also maintained a low profile within the Great Abyss Gate. He surely hopes for peace within the Grand Qi Cultivation Realm..”\t\t\t\t\t\t</div>", "images": {}, "success": true}