{"id": 128, "url": "https://www.novelhall.com/i-became-an-immortal-on-mortal-realm-32879/14297598.html", "title": "Chapter 128 - Chapter 128: Chapter 125: Breakthrough To Cross-Void Realm! [Vote For Monthly Pass]", "volume": 2, "volume_title": "Volume 2", "body": "<h1>Chapter 128 - Chapter 128: Chapter 125: Breakthrough To Cross-Void Realm! [Vote For Monthly Pass]</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 128: Chapter 125: Breakthrough to Cross-Void Realm! [Vote for Monthly Pass]<br/><br/>Translator: 549690339<br/><br/>After withstanding the first heavenly thunder, Fang Wang displayed a look of dissatisfaction.<br/><br/>“Is this all?”<br/><br/>“It doesn’t hurt at all!”<br/><br/>He hadn’t even exerted his full strength, not to mention activating the strongest state of his Heavenly Body.<br/><br/>Although Fang Wang was unsatisfied, the other Great Abyss Gate cultivators outside the formation were terrified. They reckoned that they wouldn’t be able to react in time if that thunderbolt had been aimed at them.<br/><br/>Chai Yi, Zhao Chuanqian, Yang Yuanzi, and others had grave expressions on their faces. They weren’t frightened by the tribulation itself, but by Fang Wang’s strength, which was an instinctive reaction, irrespective of how close or distant their relationships were.<br/><br/>As the first heavenly thunder struck, the Thunder Tribulation officially began. Bolts of thunder continuously descended upon Fang Wang’s body.<br/><br/>Sitting cross-legged in mid-air, he resisted the heavenly thunder with his Body-protecting Divine Barrier. The lightning directly dissipated upon hitting him, unable to shake his figure. More and more thunderbolts fell, and the momentum continued to rise, echoing within the Great Abyss Gate, deafeningly loud.<br/><br/>The disciples outside the formation began to discuss in alarm, but however many they were, their voices couldn’t overshadow the thunder.<br/><br/>Xiao Zi was also outside the formation, watching with a surge of excitement in its heart.<br/><br/>If one day it were to transform into a dragon, it too would have to endure such a tribulation, allowing heaven and earth to proclaim its metamorphosis!<br/><br/>The tribulation continued relentlessly!<br/><br/>After a solid incense stick’s time, the heavenly might entered another phase. The cultivators maintaining the formation turned pale, feeling as if the formation might break at any moment.<br/><br/>The once snowy white terrain inside the formation had already melted away, contrasting starkly with the outside where the falling snow had slowed significantly and even the mist had thinned out.<br/><br/>More and more disciples rushed to witness Fang Wang’s tribulation, engraving today’s scene deeply into their minds, unforgettable for a lifetime.<br/><br/>From then on, surviving the tribulation would become a standard by which the Great Abyss Gate disciples measured a Great Cultivator.<br/><br/>And this standard would only get higher as time passed.<br/><br/>Fang Wang was immersed in his practice, recalling the teachings of the Solaris Scripture in his mind.<br/><br/>The Cross-Void Realm, a stage for refining one’s Primordial Spirit!<br/><br/>Reaching the Cross-Void Realm meant not only a surge in cultivation but also that the Primordial Spirit could emerge from the body. Even if a cultivator died, their Primordial Spirit could survive.<br/><br/>Keep in mind that below the Cross-Void Realm, the vast majority of cultivators do not have the means to prevent a Primordial Spirit from escaping. Fang Wang was an exception, with very few people in the Condensation Spirit Realm able to match him.<br/><br/>A Primordial Spirit leaving the body could also detect the Yin entities wandering in the Mortal Realm, and such entities were not limited to ghosts and evil spirits. There were many other unseen things belonging to the Underworld.<br/><br/>As the Thunder Tribulation grew stronger, Fang Wang, who was in a state of enlightenment, subconsciously activated his Heavenly Body. A domineering aura shot up towards the sky, causing the thunderclouds above to scatter. The Great Abyss Gate’s grand formation violently fluctuated, on the verge of breaking apart.<br/><br/>“Quick, we need more people!”<br/><br/>A senior elder shouted angrily, his neck veins bulging grotesquely.<br/><br/>It wasn’t just him, all the Peak Masters were summoning disciples from their respective peaks to join the formation, just needing to channel Spiritual Power into them.<br/><br/>In less than five breaths’ time, over ten thousand disciples joined the formation, quickly stabilizing the light screen of the formation.<br/><br/>All who joined could feel the terrifying aura inside, their faces turning pale, and their hearts were like tumultuous waves.<br/><br/>“What realm is our Senior Brother exactly in? His aura is too heaven-defying!”<br/><br/>“Merely his aura gives such a sense of oppression, it’s hard to imagine how terrifying it would be to face him as an opponent…”<br/><br/>“Why aren’t they calling Sect Leader Fang… My heavens, even standing at the very back, I feel like I can’t hold on!”<br/><br/>“We need more people, this isn’t enough!”<br/><br/>As shouts of alarm rose from disciple after disciple, more and more joined the formation. At first glance, it seemed as though the Great Abyss Gate was forming an array to suppress Fang Wang.<br/><br/>Fang Wang’s hands were performing various techniques, and gradually, fiery orbs began to coalesce behind his head, transformed from the Solaris True Fire. Wisps of scorching white flame exuded from his body, making him look as if he could ascend to immortality at any moment.<br/><br/>Fang Wang had entered a state of self-forgetfulness, aware that the Thunder Tribulation could no longer pose a threat to him. Now, all he needed to do was concentrate on cultivating his Primordial Spirit.<br/><br/>The moment his Primordial Spirit broke free, he would have successfully made a breakthrough!<br/><br/>In the Grand Qi Imperial City, the once prosperous city was now engulfed in smoke and debris, with buildings collapsing and dust rolling in. The cries of children and women, and the shouts of men echoed in every corner.<br/><br/>Large numbers of soldiers were rescuing people throughout the city, while many who weren’t injured just gazed at the firmament, their faces filled with despair and terror.<br/><br/>The thunderclouds in the sky had been torn into countless fragments, faintly revealing the tracks of passing Sword Qi. In the Imperial Palace, there was a terrifying sword mark stretching from the southern wall to the northern wall, unimaginable battles must have occurred earlier.<br/><br/>High in the sky, the Immortal Xiaoyao was grasping the neck of Xu Qiuming with his right hand, his face beaming with a ruthless smile. Meanwhile, Xu Qiuming’s limbs dangled lifelessly, his robes torn, and his body covered in blood, his toes still dripping with it.<br/><br/>Xu Qiuming was close to losing consciousness, but he still managed to lift his right hand, aiming two fingers towards the Immortal Xiaoyao’s chest, as if stabbing him with a sword.<br/><br/>“Your understanding of the Sword Dao is quite good, suitable for a sacrifice, so I shall let you live for a few more days.”<br/><br/>Immortal Xiaoyao said with a cold laugh, then turned his gaze downward and abruptly vanished from mid-air.<br/><br/>In less than ten breaths, he reappeared high above, now holding another person in his left hand, Zhao Qi, who had already passed out.<br/><br/>“Tell Fang Wang of the Great Abyss Gate that this Immortal will be waiting for him at North Border Heavenly Summit Mountain. He has one year. If he does not come after a year, not only will the Seven Dynasties Emperor die, but I will also massacre Grand Qi. By then, I will ensure this land flows with rivers of blood and is littered with millions of corpses!”<br/><br/>Immortal Xiaoyao’s voice echoed above the Imperial City, and then he flew north, carrying Zhao Qi and Xu Qiuming with him.<br/><br/>Inside a residence in the Imperial City,<br/><br/>Fang Family Members were gathered. A young man looked anxiously at Fang Meng and asked, “Grandfather, will my brother go to the challenge?” He was Fang Wang’s younger brother, Fang Xun.<br/><br/>Fang Meng’s face was somber as he said in a heavy voice, “He will go, and he will take personal revenge on that traitor!”<br/><br/>Cries of woe came from all directions, heralding the terror of the impending disaster. While the Fang Residence had numerous cultivators who relied on formations to protect the entire residence, the common people could only suffer.<br/><br/>As a duke who had opened the dynasty, Fang Meng was naturally heartbroken, but he was merely a mortal. Although he too was cultivating, he was powerless against a carefree immortal; he didn’t even have the ability to reach the heavens.<br/><br/>The other people in the Fang Residence all fell into silence, creating a repressive atmosphere.<br/><br/>They all had the same thought in their minds.<br/><br/>Did Fang Wang really stand a chance against the carefree immortal he faced just now?<br/><br/>Having witnessed the capabilities of that carefree immortal, they truly felt that he was no ordinary immortal – not like the ones in myths – but so evil and cruel.<br/><br/>Great Abyss Gate, the thunderclouds slowly dissipated.<br/><br/>The light from the formation enveloping the main meridian slowly dispersed, with tens of thousands of cultivators floating in the air, and the weaker disciples already resting on the various mountain peaks, gathering their spiritual power while panting. Their gazes couldn’t help but look towards the main peak.<br/><br/>Fang Wang was seated in meditation above the main meridian, atop all the mountain peaks. His Golden Scale White Feather Robe fluttered in the wind, surrounded by strands of golden dragon qi, and with a halo of fireballs behind his head, he resembled a true immortal descending to the mortal realm.<br/><br/>Whether it was the higher-ups of the Tai Yuan Sect or the disciples, all were filled with lingering fear.<br/><br/>At the most critical moment of Fang Wang’s tribulation, the heavenly might was terrifying, forcing the Tai Yuan Sect to mobilize over a hundred thousand disciples to provide spiritual power, barely managing to keep the formation from breaking.<br/><br/>If the thunder tribulation had continued for a while longer, they might not have been able to withstand it, and even the Great Abyss Gate could have been razed to the ground.<br/><br/>The heavenly might was too horrifying, giving them a true sense of contending against the heavens.<br/><br/>What most shocked them was Fang Wang’s performance.<br/><br/>From beginning to end, Fang Wang had not been injured; not a hair on his head was out of place. It was as if the tribulation wasn’t meant for him.<br/><br/>The disciples looked at Fang Wang with adoration in their eyes, while the higher-ups looked at him with expectation.<br/><br/>They all knew that with the conclusion of this tribulation, the Great Abyss Gate would become the strongest sect in Grand Qi, without a rival!<br/><br/>Even the profound and unfathomable Jin Xiao Sect would not be a match for Fang Wang.<br/><br/>Even Vice Sect Leader Chai Yi thought so.<br/><br/>She looked at Fang Wang from afar, continuously comparing him with the Demon Monarch in her mind.<br/><br/>Suddenly, she lost her faith in the Demon Monarch.<br/><br/>This young man was simply too strong!<br/><br/>Chai Yi recalled her first meeting with Fang Wang as if it were in a previous life. How many years had it been, and Fang Wang had grown so powerful… At that moment.<br/><br/>Fang Wang was overlooking the entire Tai Yuan Sect, not with his physical eyes, but in the state of his primordial spirit.<br/><br/>Standing high in the sky, he could even see his own physical body below.<br/><br/>An unprecedented, wondrous feeling welled up in his heart. At that moment, he felt a sense of freedom, as if his physical body was a shackle.<br/><br/>But he quickly suppressed this thought. Not only did he need to cultivate his soul, but also his body; only by cultivating both in tandem could he truly walk the path of immortality.<br/><br/>Fang Wang saw many souls wandering within the Tai Yuan Sect, human and demon alike. These were not ghosts visible to the Condensation Spirit Realm cultivators; they appeared to be in the mortal realm but had actually fallen into the underworld, only manifesting in the mortal realm.<br/><br/>Yin and Yang separated!<br/><br/>Fang Wang saw a soul on the mountainside of the main meridian looking at him.<br/><br/>Guang Qiuxian!<br/><br/>Guang Qiuxian stood in front of his own grave, stroking his beard and smiling, his eyes filled with satisfaction as he looked at Fang Wang.<br/><br/>Seeing him, Fang Wang suddenly felt a sense of relief.<br/><br/>As for what he had let go of, even he couldn’t clearly say.<br/><br/>Afterward, Fang Wang returned to his physical body, his primordial spirit back in place. He took control of his body, feeling grounded, and he inexplicably let out a sigh of relief.<br/><br/>Being out of the body as a primordial spirit felt free, but too ephemeral, as if he could be pulled away by some unknown force at any moment.<br/><br/>Fang Wang stood up and flew towards Shiyuan Hall, quickly entering the hall.<br/><br/>“No one is to approach Shiyuan Hall and disturb the Sect Leader from consolidating his cultivation ! ”<br/><br/>The authoritative voice of Zhao Chuanqian echoed through the Great Abyss Gate, breaking the silence and plunging the sect into a buzz, with everyone marveling at the preceding tribulation.<br/><br/>Back in Shiyuan Hall.<br/><br/>Fang Wang began to meditate and regulate his spiritual power.<br/><br/>He had completely stepped into the Cross -Void Realm!<br/><br/>His spiritual power was also transforming!<br/><br/>His aura surged, causing the Shiyuan Hall to tremble.<br/><br/>Xiao Zi entered the hall cautiously, followed by Zhao Zhen who drifted out of the Soul Devouring Gourd, he remarked softly in amazement, “With such a presence, anyone who becomes our master’s enemy is pitiable.”<br/><br/>He even felt that Fang Wang was invincible.<br/><br/>Perhaps his cultivation was not at the pinnacle in the mortal realm, but that imperious, unmatched aura was certainly the first among mortals!\t\t\t\t\t\t</div>", "images": {}, "success": true}