{"id": 126, "url": "https://www.novelhall.com/i-became-an-immortal-on-mortal-realm-32879/14297338.html", "title": "Chapter 126 - Chapter 126: Chapter 123: Capturing The Seven Dynasties,", "volume": 2, "volume_title": "Volume 2", "body": "<h1>Chapter 126 - Chapter 126: Chapter 123: Capturing The Seven Dynasties,</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 126: Chapter 123: Capturing the Seven Dynasties,<br/><br/>Destined Enemy [Third Update, Request for Monthly Pass]<br/><br/>Translator: 549690339<br/><br/>After returning from Shiyuan Hall, Fang Wang once again began his seclusion.<br/><br/>Knowing that Guang Qiuxian did not have much longer to live, he was not too saddened; their relationship was not that close. Moreover, he himself had died once already, so all he could do was silently wish Guang Qiuxian a new life of prosperity on Earth.<br/><br/>However, he had been in closed-door cultivation for only half a year when someone came to visit him.<br/><br/>Zhou Xue!<br/><br/>After Xiao Zi opened the door for Zhou Xue, she was, as always, shooed away and could only curse Zhou Xue from outside the door, not daring to raise her voice.<br/><br/>Zhou Xue sat at the table and smiled as she asked, “I hear you personally chose me to be the Sect Leader? Big brother Fang, that’s quite the display of authority.”<br/><br/>Fang Wang calmly asked, “What? You don’t want it?”<br/><br/>It was because he was considering going to the Jin Xiao Sect that he had offered the position of Sect Leader to Zhou Xue.<br/><br/>“It’s not that I can’t take it, give it to me for now. I’ll select someone from the Fang Family Disciples to focus on training as the future Sect Leader. With me and Tu Caiyi around, whoever we decide on will be the next Sect Leader,” Zhou<br/><br/>Xue said with a smiling tone.<br/><br/>Tu Caiyi, Vice Sect Leader Chai Yi…<br/><br/>Fang Wang had heard from Fang Hanyu that Chai Yi had earned significant achievements, elevating her status considerably, and disciples she promoted were in positions throughout the Sect’s Main City; her influence was immense.<br/><br/>Of course, within the Great Abyss Gate, no one could now rival Fang Wang when it came to influence.<br/><br/>If Fang Wang wished to be Sect Leader at this moment, no one in the Great Abyss Gate would dare to object.<br/><br/>“No matter who you choose, you cannot let down the disciples of the Great Abyss Gate,” Fang Wang reminded her.<br/><br/>Zhou Xue had been about to tease him, but seeing his serious gaze, she nodded in agreement.<br/><br/>“Did you come back specially for this?” Fang Wang shifted the conversation.<br/><br/>Zhou Xue rolled her eyes at him and said, “This is no small matter. Of course, there’s another issue—your tribulation may be approaching.”<br/><br/>Tribulation?<br/><br/>Fang Wang narrowed his eyes, not understanding what Zhou Xue meant.<br/><br/>Zhou Xue said, “Since the Vast Qi Sect visited, I had people go to Grand Chu to investigate them. I found out that the Sect Leader of the Vast Qi Sect had changed and there was only scorn for the Vast Qi Sect throughout the Cultivation World of Grand Chu, accusing them of losing Grand Chu’s backbone and not daring to avenge Sword Dao master, Liang Xunqiu. And indeed, the Vast Qi Sect took no action for many years, but I was not reassured and continued to send people to investigate.”<br/><br/>“Last year, I received intelligence that someone from the Vast Qi Sect had traveled northwards, spreading the news that you possess a Heaven Yuan Spirit Treasure. Now the whole northern continent knows that a dynasty named Grand Qi in the south has birthed someone with a Heaven Yuan Spirit Treasure.”<br/><br/>Upon hearing this, Fang Wang felt it seemed somewhat absurd, asking, “Is that<br/><br/>Zhou Xue shook her head, her expression turning serious, and said, “If I’m not mistaken, the Vast Qi Sect invited that person to come out of seclusion. In a previous life, before the Heaven’s Larceny Saint Sect unified the continent, there was a powerful figure who proclaimed himself an Immortal from the north, capturing the Seven Dynasties Emperor, seeking the Heaven Yuan Spirit Treasure. At that time, he was probably targeting Ji Rutian, but now that Ji<br/><br/>Rutian has kept a low profile, I fear that this person may come after you.”<br/><br/>Fang Wang squinted and asked, “Proclaiming himself an Immortal, how strong must that be?”<br/><br/>Zhou Xue answered, “I do not know either because my cultivation was too low at that time. By the time I joined the Heaven’s Larceny Saint Sect, that man had already vanished. In the years that followed, I didn’t inquire about him as he had no cause and effect with me. If not for the action of the Vast Qi Sect, I might never have remembered him.” Fang Wang fell into contemplation.<br/><br/>Immortal?<br/><br/>Interesting!<br/><br/>“Since Ji Rutian survived until the end and that person did not, doesn’t that suggest that the person might have died at Ji Rutian’s hands?” Fang Wang curiously asked.<br/><br/>Zhou Xue nodded, “Indeed, that’s a possibility.”<br/><br/>Fang Wang then thought of something else, “Ji Rutian hasn’t appeared in this life. Do you think it’s possible that he too has been reborn? After all, most of your and my actions have been within Grand Qi, which shouldn’t affect his destiny.”<br/><br/>Zhou Xue irritably said, “How could that be? Before my death, Ji Rutian was so resplendent in The Upper Realm. My guess is it could be related to the Ji Family. The Ji Family has those who can foresee fate. In my previous life, after seven hundred years of cultivation, I encountered a Ji Family Disciple who told me that besides Ji Rutian, their family had someone else who could glimpse destiny. If destiny changed, the Ji Family would retreat. That’s why the Ji Family has lasted a thousand years. However, that person did not ascend, so I didn’t focus on it later. Whether in a previous life or this one, I have had no contact with Ji Rutian, so naturally, I never dwelled on his legacy or the Ji Family’s affairs.”<br/><br/>After hearing this, Fang Wang thought it was far-fetched. He couldn’t help asking, “I’ve never even met Ji Rutian. We couldn’t possibly be fated enemies, could we?”<br/><br/>Zhou Xue pinched her chin, seemingly recalling something, and muttered to herself, “Now that you mention it, it could be possible. I remember Ji Rutian was about your age. Rumors say when Ji Rutian was born, it caused a celestial phenomenon. The entire continent shook and after that, torrential rain lasted for a full seven days, causing disasters in every dynasty, including our Grand Qi. People said it was a celestial phenomenon heralding the birth of a Heaven Yuan. At that time, I wondered how merely a Heaven Yuan could cause…”<br/><br/>She did not continue with what she was going to say next.<br/><br/>Mere Heaven Yuan?<br/><br/>Fang Wang was about to question her, when suddenly he remembered that indeed there had been such a period when he was a child.<br/><br/>He possessed memories from the moment of his birth, and the first sound he heard was thunder, followed by seven days of heavy rain. He remembered clearly because someone in the residence suggested he might be a reincarnated demon, only to be fiercely scolded by his grandfather who strictly prohibited such heretical talk. Later, that incident was forgotten by others.<br/><br/>If what Zhou Xue said was accurate, then he and Ji Rutian were born around<br/><br/>the same time, possibly even on the same year, month, and day.<br/><br/>Being born on the same day, when considering destiny, it does indeed make sense.<br/><br/>A thought suddenly crossed Fang Wang’s mind, his expression changing as he said, “If the Ji Family can foresee fate, and Ji Rutian knew his own fate, him coming south to Grand Qi before he was even twenty years old—could it be possible that he was coming for me? Perhaps because I died, he then sought opportunities in the Great Saint’s Grotto -Heaven.”<br/><br/>“Think about it, the Ji Family is so far from Grand Qi, what reason would he have to come here? Is the legacy of the Great Saint’s Grotto-Heaven really that important? Moreover, he was the only one who came.”<br/><br/>Upon hearing this, Zhou Xue fell silent as well.<br/><br/>Fang Wang felt the power of destiny surge through him as he spoke.<br/><br/>The name Ji Rutian took on a different meaning in his heart.<br/><br/>For a long time.<br/><br/>Zhou Xue broke the silence, saying, “I will investigate the Ji Family, I can’t just wait for that self-proclaimed immortal to show up. Take care of yourself, everyone has their own tribulation. If that immortal truly died at the hands of Ji Rutian, then in this life, he should die by your hand too.” After speaking, she stood up.<br/><br/>“Where are you going?” Fang Wang quickly called out to her.<br/><br/>Zhou Xue, without turning her head, replied, “I have some arrangements to make, then I’ll head north to check on Heaven’s Larceny Saint Sect.”<br/><br/>She left briskly, and just before the mountain gate closed, Xiao Zi scurried in.<br/><br/>“Young Master, did you two have a fight?” Xiao Zi asked curiously, her tone barely concealing her delight.<br/><br/>Fang Wang ignored her and pondered over the matter of Ji Rutian.<br/><br/>After his exchange with Zhou Xue, he confirmed that Ji Rutian was indeed paying attention to him.<br/><br/>Heaven Yuan against Heaven Yuan?<br/><br/>A clash of fates?<br/><br/>Fang Wang wasn’t afraid, but instead, he was filled with fighting spirit.<br/><br/>In my past life, I died early, and my fame and fate were inferior to yours. If in this life, you dare to provoke me, then I will live even more brilliantly than you!<br/><br/>After Zhou Xue left, Fang Wang continued his cultivation, but at the end of the year, Guang Qiuxian passed away at the age of four hundred and forty-five, and the whole sect mourned his death.<br/><br/>Great Abyss Gate, being a Cultivation Sect, did not have many mourning traditions. The direct disciples of the nine branches gathered to burn incense at Guang Qiuxian’s grave, and Fang Wang also attended.<br/><br/>Before leaving, Vice Sect Leader Chai Yi approached Fang Wang, telling him that Zhou Xue was away on business, and he was to temporarily reside in Shiyuan Hall, taking on the responsibilities of the Sect Leader, to which Fang Wang agreed this time.<br/><br/>The reason he agreed was that he was about to make a breakthrough, and after the breakthrough, he would have to create his fifth Lifespirit Treasure!<br/><br/>And Shiyuan Hall contained the Heavenly Dao Spirit Stones!<br/><br/>That day, Fang Wang moved to Shiyuan Hall. The news spread within Great Abyss Gate, and while the disciples felt it was difficult to defy destiny, they were more excited. As the older generation departed, with Fang Wang leading them, Great Abyss Gate was surely on its way to becoming more powerful.<br/><br/>After moving into Shiyuan Hall, Xiao Zi ran around wildly all day. Shiyuan Hall was larger than it looked from the outside, and it was even connected to the inside of the mountain. Hidden within were secret books and chambers.<br/><br/>The end of the year passed, and a new year arrived, covering Great Abyss Gate in a blanket of snow.<br/><br/>Just two months into the new year, Vice Sect Leader Chai Yi, along with the peak masters and many elders, came to Shiyuan Hall, and Fang Wang had to let them in.<br/><br/>Sitting on his cushion, looking down at the high-ranking members of Great Abyss Gate, he couldn’t help but feel a certain way.<br/><br/>Fang Wang felt a surge of emotion as he saw an elder preparing to pay respects, and he hurriedly said, “My fellow masters do not have to pay respects. I am only temporarily handling the affairs of the Sect Leader, not the true Sect<br/><br/>Leader.”<br/><br/>Upon hearing this, everyone smiled. Fang Wang noticed that Yang Yuanzi seemed lost in thought, clearly affected by Guang Qiuxian’s death.<br/><br/>Zhao Chuanqian stepped forward and said, “Emperor Zhao Qi of Grand Qi has requested aid from Great Abyss Gate, claiming that someone has sent him a threatening message, saying that the emperors of Chu, Zhao, and Wei have all been captured, and he will be next.”<br/><br/>Fang Wang narrowed his eyes upon hearing this.<br/><br/>Isn’t this the tribulation Zhou Xue was talking about?<br/><br/>Chai Yi then added, “Since the battle with Chi Devil Sect, I have placed disciples all over the Seven Dynasties, and they have relayed news that the emperors of those three dynasties have indeed been captured by a mysterious cultivator who claims to be an Immortal God. The reason for capturing the emperors is still unclear.”<br/><br/>“One thing is certain, that cultivator is unfathomable and unstoppable, ” Chai Yi continued.<br/><br/>Atop the great hall, the high-ranking members of Great Abyss Gate unknowingly formed two lines, with Chai Yi and Zhao Chuanqian leading each side.<br/><br/>Fang Wang pondered and suggested, “What about bringing the emperor to<br/><br/>Great Abyss Gate for protection?”<br/><br/>Chai Yi replied, “There’s no need. Suspended Vast Sword Sect has also learned of this and has sent Xu Qiuming to protect the emperor. Since the emperor holds you in high regard, this is Suspended Vast Sword Sect’s way of showing good will toward us. Xu Qiuming has reached the Condensation Spirit Realm, and with him there, we can test the strength of that mysterious cultivator.” Out of curiosity, Fang Wang asked, “Hasn’t he gone south to seek his fortune in cultivation?”<br/><br/>Heading south to sea had been a trend in the last twenty years, and not just among disciples of Great Abyss Gate.<br/><br/>Zhao Chuanqian continued the conversation, “He is comprehending his own Sword Dao, vowing not to leave Grand Qi until he masters it.”<br/><br/>To master it?<br/><br/>Interesting.<br/><br/>Fang Wang did not think Xu Qiuming was boasting; instead, he believed Xu Qiuming was bound to succeed.<br/><br/>It seems that, like him, Xu Qiuming needs the power to cross the vast ocean before heading south, or else, dying along the way would be a waste of talent..\t\t\t\t\t\t</div>", "images": {}, "success": true}