{"id": 125, "url": "https://www.novelhall.com/i-became-an-immortal-on-mortal-realm-32879/14297337.html", "title": "Chapter 125 - Chapter 125: Chapter 122: The Overseas Eternal Life", "volume": 2, "volume_title": "Volume 2", "body": "<h1>Chapter 125 - Chapter 125: Chapter 122: The Overseas Eternal Life</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 125: Chapter 122: The Overseas Eternal Life<br/><br/>Pavilion, Ninth Level of the Condensation Realm<br/><br/>Translator: 549690339<br/><br/>Facing Fang Wang’s blessings, Gu Li’s eyes flickered with a hint of disappointment as she asked softly, “When will you go out to seek the fate of immortality, will you head south?”<br/><br/>Fang Wang still remembered the Sword Saint’s entrustment; he had a Yellow Glyph Sword Sovereign Order in his hand, Zhou Xue also said he should head south in the future, and he himself wanted to see a broader world.<br/><br/>“I don’t know when, but I will,” Fang Wang answered.<br/><br/>Gu Li looked at him, hesitating to speak.<br/><br/>Fang Wang thought for a moment and said, “For a beauty like you, what man wouldn’t like? But I am different, I care more about the Dao of Immortality, and I hope Miss Gu feels the same. Do you want to spend hundreds of years with me, or seek eternal life together?”<br/><br/>The meaning should be clear enough and not hurtful.<br/><br/>Fang Wang gave himself a mental thumbs-up.<br/><br/>He couldn’t see through Zhou Xue’s mind, but Gu Li’s thoughts were transparent to him, her feelings couldn’t be hidden.<br/><br/>But he didn’t feel that Gu Li’s feelings for him were necessarily love, perhaps it was admiration born from being defeated by him, and he didn’t want Gu Li to prioritize love above all else.<br/><br/>Those who cultivate immortality should aim to chase eternal life as their greatest goal.<br/><br/>“Who wants to seek eternal life with you?” Gu Li huffed, her tone surprisingly shy and indignant.<br/><br/>Without waiting for Fang Wang to explain, she stared straight at him and asked, “Can I write to you in the future? Once we part, it may be a century before we meet again.”<br/><br/>Fang Wang asked in surprise, “Can letters be sent to Great Abyss Gate from overseas?”<br/><br/>Gu Li replied, “My Gu Family has been voyaging overseas for a long time and has business dealings there. As long as I give the letter to a subordinate of the Gu Family, they can deliver it, but your letter might not reach my hands.” That’s good, I don’t want to write letters.<br/><br/>Fang Wang thought to himself, but still praised aloud, “My Brother Gu is doing quite well.”<br/><br/>Fang Wang laughed and said, “My brother Gu Tianxiong, ah, he took the initiative to become sworn brothers with me.” “Really? My father doesn’t seem like such a frivolous person.”<br/><br/>“Ahem, what do you know, we are confidants.”<br/><br/>Fang Wang really wanted to say her father was quite interesting, but he held back.<br/><br/>Gu Li blinked and seemingly remembered something, her ears suddenly turning red. She left with the words, “If fate allows, we will meet on the sea. I’ll write to you.”<br/><br/>She fled back to her dwelling like a runaway, and the mountain gate swiftly closed.<br/><br/>Fang Wang looked at Xiao Zi on his shoulder and asked, “What’s with her?”<br/><br/>Xiao Zi flicked her tongue and said, “In our Demonic Realm’s terms, she’s longing to reproduce.”<br/><br/>“Huh?”<br/><br/>Fang Wang immediately pulled Xiao Zi off and threw her down the cliff.<br/><br/>The departures of Fang Zigeng and Gu Li were a microcosm of Grand Qi, with the talents raised by the Nine Great Sects beginning to head south in search of immortality. The Grand Qi Cultivation Realm did not become cooler because of this, but it grew even more vibrant as Grand Qi turned into a cultivation dynasty.<br/><br/>The Nine Great Sects changed their rules together, no longer setting time limits for recruiting disciples. At any time, as long as someone showed the aptitude for cultivation, they could be accepted into the sects.<br/><br/>Besides, more and more cultivators were flooding into the Grand Qi Imperial City. It was said that the emperor and court officials began to gather Qi and cultivate, making cultivation, which was once a vague concept for the common people, rudely barge into their lives. With more and more cultivators entering the world to show their spells, Grand Qi faced unprecedented changes and fluctuations.<br/><br/>Fang Wang continued his seclusion, going out for a few days every five years, visiting Fang Residence and Fang Realm to see his family.<br/><br/>During Fang Wang’s absence, Fang Yin gave birth to a son and a daughter. When Fang Wang returned, he saw his younger siblings, now teenagers. He was actually quite pleased about it, feeling relieved about one of his concerns. With a brother and sister, he wasn’t afraid there would be no one to care for his parents in their old age, and he also gifted each of his siblings a magic artifact as a meeting present.<br/><br/>Someday, he would travel the world.<br/><br/>Decades passed, and the Fang Family disciples had spread throughout the Nine Great Sects. The Fang Residence also relocated to the Imperial City, becoming the most powerful Duke’s Mansion under the emperor’s feet. This once caused turmoil in the court, but Zhao Qi suppressed it single-handedly, even making multiple visits to the Fang Residence himself.<br/><br/>In the blink of an eye, twelve years had passed since Gu Li went south.<br/><br/>That year, Fang Wang’s cultivation reached the eighth layer of the Condensation Spirit Realm, not far from the ninth layer.<br/><br/>No one knew his exact level of cultivation, but the cultivation world knew that the Sword Saint Fang Wang was in seclusion. When he would emerge, the heavens in the Grand Qi Cultivation Realm would rise even higher. One day, the voice of a disciple was heard outside the dwelling:<br/><br/>“Elder Brother Fang, there’s a letter for you.”<br/><br/>The Great Abyss Gate Affairs Hall had a dedicated institution for receiving letters. Only if the recipient was confirmed to be within the Great Abyss Gate, would they send disciples to deliver the letter; otherwise, it would be temporarily stored in the Affairs Hall. Additionally, helping with the delivery of letters was a task for disciples to earn contribution points.<br/><br/>Fang Wang gave Xiao Zi a look, and she immediately darted over.<br/><br/>As the mountain gate opened, the disciple screamed, clearly a newcomer who had never seen Xiao Zi before.<br/><br/>The gate closed again, and Xiao Zi brought the letter to Fang Wang with it clamped in her mouth.<br/><br/>“Couldn’t be Miss Gu, could it? She mentioned wanting to write to you,” Xiao Zi said with a hint of jealousy.<br/><br/>Fang Wang took the letter, unwrapped the outer paper, and pulled out the seven sheets of paper within.<br/><br/>The first sheet started with, “Elder Brother Fang, how have you been?” It was indeed from Gu Li.<br/><br/>Fang Wang was quite interested, as it was rare for someone to write to him, and he wanted to see what Gu Li had written.<br/><br/>In the letter, Gu Li shared her experiences after going to sea.<br/><br/>She and the Gu Family Disciples drifted on the sea for a full three years before reaching a cluster of islands inhabited solely by cultivators. The first two sheets described what she saw and heard on the high seas: the towering river in the sky, sea demons larger than mountains, ghost ships floating at night, and so on, which piqued Fang Wang’s intense interest.<br/><br/>According to what Gu Li mentioned, the largest Cultivation force she came into contact with at sea was known as the Eternal Life Pavilion, which reportedly has over a hundred Cultivation Sects within it. The Canglan Academy she joined is one of them.<br/><br/>When a Yellow Glyph Envoy from the Eternal Life Pavilion visited their academy, it actually forced the secluded elders of their academy to come out of seclusion, and Gu Li mentioned that their academy’s head was at the Ninth Level of the Condensation Realm.<br/><br/>Yellow Glyph Envoy?<br/><br/>Upon reading this, Fang Wang couldn’t help but think of his own Yellow Glyph Sword Sovereign Order.<br/><br/>Could it be that this order also comes from the Eternal Life Pavilion?<br/><br/>However, he did not know whether the status of a Yellow Glyph Sword Sovereign was higher than that of a Yellow Glyph Envoy.<br/><br/>Continuing to read on, the rest was mostly everyday occurrences of cultivation. Gu Li was doing well and hadn’t encountered any trouble; even if she had, it was unlikely she would mention it in a letter.<br/><br/>The last part of the letter read:<br/><br/>“In the boundless Canghai, where sects stand in great numbers, geniuses are as plentiful as the stars beyond our realm. Should elder brother come here, it would be like the bright sun descending, causing the multitude of stars to diminish.”<br/><br/>Fang Wang smiled, folded the letter neatly, and put it back into the envelope. He initially wanted to burn it, but then he changed his mind and stored the letter inside the Dragon Jade Ring.<br/><br/>Xiao Zi, who could read, perched on Fang Wang’s shoulder and read the entire letter. It excitedly said, “Master, the sea seems so interesting. When shall we<br/><br/>Fang Wang calmly responded, “Let’s wait a little longer. There’s no rush.” He hadn’t yet reached the Cross-Void Realm, so he wasn’t in any hurry.<br/><br/>The cultivation environment at sea would definitely be more dangerous than in Grand Qi. If he were to go, he needed to at least possess the strength to dominate a level higher than the Cross-Void Realm.<br/><br/>Zhao Zhen floated over and exclaimed with emotion, “Master has such high talent, yet remains so cautious. One day, he will surely achieve immortality.”<br/><br/>“There you go flattering again. Go practice!” Xiao Zi scolded with widened serpentine eyes.<br/><br/>Zhao Zhen was frustrated but still obediently retreated.<br/><br/>After returning from the Zhui Tian Secret Realm, Xiao Zi inexplicably learned a spell that allowed Zhao Zhen to cultivate. By absorbing the Ghost Qi from Zhao Zhen, it grew stronger, which resulted in its Demonic Qi mixing with Ghost Qi.<br/><br/>Thus, Zhao Zhen became the cultivation tool for Xiao Zi, practicing painstakingly every day.<br/><br/>Fang Wang did indeed speak up for Zhao Zhen. If it weren’t for Xiao Zi’s intervention, Zhao Zhen’s spirit would have already been dispersed by him, and he could feel that Zhao Zhen was also growing stronger, indicating that Xiao Zi had left him room to improve.<br/><br/>Fang Wang continued his cultivation practices.<br/><br/>His only goal now was to break through to the Cross-Void Realm!<br/><br/>Time passed by swiftly.<br/><br/>Disciples who ventured out all had their exciting tales to tell, while Fang Wang, who remained in his cave dwelling, was oblivious to the world’s affairs and only focused on cultivation.<br/><br/>Three years later, Fang Wang finally reached the Ninth Level of the Condensation Realm, at the age of seventy-four!<br/><br/>A seventy-four-year-old at the Ninth Level of the Condensation Realm—Fang Wang was curious to question the world, who else could claim the same?<br/><br/>On this day, as he was about to continue his assault on the Cross-Void Realm, he felt a spiritual wave from his disciple token and immediately took it out.<br/><br/>“Fang Wang, come visit.”<br/><br/>The voice of Guang Qiuxian emerged, sounding extremely weak.<br/><br/>Fang Wang silently put the token back into the Dragon Jade Ring, stood up, and walked towards the sect’s gate.<br/><br/>Xiao Zi had heard Guang Qiuxian’s words, so it did not follow along.<br/><br/>It didn’t take long.<br/><br/>Fang Wang entered the Shiyuan Hall, which was immersed in silence, with not even the sound of his footsteps audible.<br/><br/>He walked up to the steps and looked at the meditating Guang Qiuxian.<br/><br/>After eighteen years, Guang Qiuxian was a shadow of his former self, considerably emaciated, his back hunched, his long beard covering his face, presenting the image of a candle flickering in the wind.<br/><br/>“Greetings, Sect Leader.”<br/><br/>Fang Wang bowed in respect, his gaze towards Guang Qiuxian unchanged.<br/><br/>Guang Qiuxian looked at him with cloudy eyes that no longer held the brilliance of the past and asked weakly, “Fang Wang, what realm have you reached now?”<br/><br/>Fang Wang hesitated for a moment before replying, “Ninth Level of the<br/><br/>Condensation Realm.”<br/><br/>Guang Qiuxian’s life was nearing its end, and Fang Wang wanted to give him some joy.<br/><br/>The invasion by the Demonic Dao years ago had dealt Guang Qiuxian irreversible damage, and his age was already advanced. There was no power left to turn the tide.<br/><br/>“Ninth Level of the Condensation Realm… good… very good… I am now over four hundred years old, and after breaking through the Condensation Realm, I was stuck at the third level, unable to make further progress… Indeed, everyone has their destiny. The third layer of the Condensation Realm was mine, but yours is yet to be known…”<br/><br/>Guang Qiuxian spoke with a tone of contemplation, relief, and joy. On the verge of death, he no longer held onto many regrets.<br/><br/>He raised his right hand, from which flew out three wooden tokens; Fang Wang caught them immediately and saw three names on them.<br/><br/>Two surnamed Fang, one surnamed Zhou.<br/><br/>“Choose one to be the next Sect Leader… Perhaps their cultivation is not yet sufficient, but the Great Abyss Gate will do its utmost to cultivate them,” Guang Qiuxian said with a faint smile.<br/><br/>Fang Wang hesitated and said, “Sect Leader, there’s really no need for this…”<br/><br/>Guang Qiuxian spoke, “Fang Wang, both you and I understand the situation, but it depends on whether you acknowledge the nurturing you’ve received from the Great Abyss Gate.”<br/><br/>Fang Wang took a deep breath and lifted a wooden token, saying, “Then let’s choose her..”\t\t\t\t\t\t</div>", "images": {}, "success": true}