{"id": 123, "url": "https://www.novelhall.com/i-became-an-immortal-on-mortal-realm-32879/14297080.html", "title": "Chapter 123 - Chapter 123: Chapter 120: Ji Rutian, A Marriage Contract", "volume": 2, "volume_title": "Volume 2", "body": "<h1>Chapter 123 - Chapter 123: Chapter 120: Ji Rutian, A Marriage Contract</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 123: Chapter 120: Ji Rutian, A Marriage Contract<br/><br/>Translator: 549690339<br/><br/>Fang Wang was unaware of the internal disputes stirred up by the other sects because of him. In fact, he no longer considered the other sects of Grand Qi significant.<br/><br/>Since his revenge, Fang Wang’s heart had completely transformed into that of a cultivator.<br/><br/>He desired longevity, to become an immortal, to ensure that his family lived peacefully and securely while still alive.<br/><br/>As he began his seclusion, time sped by.<br/><br/>Half a year later, the Great Abyss Gate became bustling, with representatives from the major sects coming to visit, creating a genial atmosphere. Eventually, it was agreed that the Great Abyss Gate would host a tournament among the Nine Great Sects of Grand Qi to foster friendship, with all sects providing resources as rewards for the victorious disciples.<br/><br/>The Chi Devil Sect and Green Cicada Valley were no longer counted, and the Jin Xiao Sect, along with a new sect founded by various noble families, became two of the Nine Great Sects.<br/><br/>The tournament was set to take place three years later. With the eager visits of the major sects, the Great Abyss Gate gradually assumed the posture of the leading cultivation sect in Grand Qi.<br/><br/>The entire Great Abyss Gate held Fang Wang in even greater esteem, because everyone knew that all of this was brought about by him.<br/><br/>One day, a visitor came for Fang Wang, and it was Zhou Xue.<br/><br/>Xiao Zi went to open the door and welcomed Zhou Xue into the dwelling.<br/><br/>“Naughty woman, long time no see!” Xiao Zi greeted her.<br/><br/>Zhou Xue smiled at it but didn’t respond, heading straight for Fang Wang instead.<br/><br/>Seeing Zhou Xue approaching, Fang Wang stood up, walked to the table, and sat down. He looked at Zhou Xue, who still preferred to wear red. Her crimson garments were now even more impressive, the hem of her clothes fluttering behind her like tail feathers. Her long hair was coiled up, adorned with a golden hairpin and red jade accessories, lending her the allure of a woman and the formidable aura of a powerful individual.<br/><br/>After thousands of years, Fang Wang felt that Zhou Xue had become much more attractive, with an indescribable charm that made her even more stunning.<br/><br/>Zhou Xue began to speak, “Snake demon, you go out first, and take your gourd with you.”<br/><br/>At her words, Xiao Zi was stunned and angrily said, “Why are you driving me away as soon as you arrive?”<br/><br/>Zhou Xue looked at Fang Wang, who immediately said, “Go out for a walk.”<br/><br/>Xiao Zi was clearly dejected, drooping its snake head as it approached the Soul Devouring Gourd. With its demonic power, it grabbed the Soul Devouring Gourd and then left with it.<br/><br/>Boom—<br/><br/>After Xiao Zits departure, the gates closed again.<br/><br/>Fang Wang curiously asked, “How did you know that gourd belonged to it?”<br/><br/>Zhou Xue raised her hand, took out a wine flask and two jade cups. As she poured the wine, she said, “Its demonic power is faint on that ghost instrument, too subtle for most, but not for my senses.”<br/><br/>She pushed one of the jade cups in front of Fang Wang, smiling as she said, “Try it, I brought this wine from outside.”<br/><br/>Fang Wang immediately picked up the jade cup to taste the wine.<br/><br/>“Aren’t you afraid I’ve poisoned it?” Zhou Xue asked teasingly.<br/><br/>While savoring the wine, Fang Wang responded, “You’re the person I trust most. If I can’t even trust you, who else can I trust?”<br/><br/>Afraid?<br/><br/>I am the owner of the Heavenly Body!<br/><br/>Fang Wang thought proudly to himself, then relished the thought that the wine was delicious. The liquor flowed down his throat, revitalizing his blood and qi, clearing his head and refreshing his spirit, and even increased his Spiritual Power by a bit, equivalent to several days of accumulation.<br/><br/>Hearing Fang Wang’s words, Zhou Xue felt emotional, “I thought you’d gain a deeper understanding of human nature after roaming the world. Once, I suffered because I trusted others too easily.”<br/><br/>She always felt that Fang Wang had changed significantly, not only in aura but also in temperament.<br/><br/>“That’s because in your previous life, you could only rely on yourself. In this life, you have me and the Fang Family. You can trust me the same way I trust you,” replied Fang Wang with a smile, and then he praised the wine.<br/><br/>“Tsk tsk, what fine wine. Where did you acquire it? Can this wine enhance cultivation?”<br/><br/>Zhou Xue, still immersed in Fang Wang’s words, replied to his question, “This wine comes from overseas, called Cleansing Spirit Wine, crafted over a thousand years using the finest Heavenly Materials and Earthly Treasures. Its primary function isn’t cultivation but to heal injuries and weaken the Heart<br/><br/>Demon. Truly, if one used it for cultivation, it would be an extravagant waste.” She then capped the wine flask next to her and pushed it toward Fang Wang.<br/><br/>“Remember, one cup is enough each time, don’t drink too much,” Zhou Xue cautioned.<br/><br/>Fang Wang displayed a smile and did not refuse.<br/><br/>Zhou Xue looked at Fang Wang once more, praising, “Your blood and qi are incredibly strong, far surpassing the Condensation Spirit Realm. It seems you’ve had an extraordinary encounter in the Zhui Tian Secret Realm.”<br/><br/>Fang Wang replied, “Not bad. I’ve obtained other legacies of the Great Saint. I have a technique called Mountain River Town Heaven Fist; do you want to learn it? I can teach you.”<br/><br/>Upon hearing this, Zhou Xue’s brows lifted, and she said, “Mountain River<br/><br/>Town Heaven Fist is an extraordinary technique, possessing the wonders of Divine Skills. An Ascender has made it famous in The Upper Realm. It’s remarkable that you have had such a fortune. This life has already changed so much from the previous one. Some people and events that should have appeared did not, and it’s hard to say what influence this will have on the future.”<br/><br/>Fang Wang asked, “Which people haven’t appeared?”<br/><br/>Zhou Xue smiled and said, “When I went to the Great Saint’s Grotto-Heaven, didn’t I mention a peerless genius with the Heaven Yuan Spirit Treasure might come forward? But he did not appear. Not only that, but he should also have made a name for himself in the Zhui Tian Secret Realm, yet we heard nothing about him there.”<br/><br/>Fang Wang had already forgotten this conversation and asked curiously,<br/><br/>“What’s that person’s name?”<br/><br/>Zhou Xue didn’t hide anything and said, “Ji Rutian will be one of the Ascenders in the future. His family, the Ji Family, is a household that has been passed down for tens of thousands of years on this continent. Since he came of age, he has left the Ji Family to seek his own Immortal fate.”<br/><br/>Fang Wang narrowed his eyes and asked, “Is he very powerful?”<br/><br/>Zhou Xue smiled and said, “Of course he’s powerful, but you might not be weaker than him now. It’s not just because he possesses the Heaven Yuan Spirit Treasure, he also has Hongtian Destiny. To be honest, in my previous life, I had no idea how strong he was, as I didn’t have much contact with him. Most of what I know about his prowess comes from what others have told me.”<br/><br/>“Before his ascension, who was stronger, he or Xu Qiuming?” Fang Wang pressed.<br/><br/>Zhou Xue shook her head and said, “They never fought each other. Don’t measure Xu Qiuming by his current state. Xu Qiuming truly soared to the sky after leaving Grand Qi. The current praises of the Seven Dynasties for Xu<br/><br/>Qiuming are far from enough. He is not just a sword surpassing the Heaven Yuan; he is a sword that triumphs over it. The world is vast, not all those who reach the pinnacle of strength will partake in a decisive battle, and they may have no interaction with each other at all.”<br/><br/>Upon hearing this, Fang Wang suddenly felt like he was getting ahead of himself.<br/><br/>Mustn’t be careless!<br/><br/>If he has opportunities, could others not have them too?<br/><br/>“However, you’ve mastered the Solaris Scripture, Nine Dragons Divine Transformation Art, and Mountain River Town Heaven Fist. Even without great opportunities in the future, you will still stand proudly among the people of Mortal Realm,” Zhou Xue said with a smile.<br/><br/>Fang Wang didn’t disclose all the ultimate arts he had mastered. He had intended to pass on the Mountain River Town Heaven Fist to Zhou Xue, only to find that she was not interested.<br/><br/>So, he proposed the Yin Yang Xuan Ming Zhen Gong as a second option, but she rejected that as well.<br/><br/>“I have my own path to walk. What is the inheritance of the Great Saint to me? I don’t even hold it in high regard,” Zhou Xue said with a hint of unruliness, finally exuding the air of a Demonic Cultivator.<br/><br/>Fang Wang didn’t insist. He then brought up the subject of the Vast Qi Sect.<br/><br/>“No worries, the Jin Xiao Sect has already gone to look for the Dragon Vein Spirit Stone. Once they find it, the plans for the Cultivation Dynasty will still go ahead. By then, the other Sects won’t have any issues with you and the Great Abyss Gate. As for the Vast Qi Sect, in my opinion, even without the Jin Xiao Sect, they wouldn’t be a match for you. You just focus on your cultivation,” Zhou Xue said meaningfully.<br/><br/>Fang Wang felt as though he was being seen through. On second thought, it was normal. After all, Zhou Xue had ascended, and the heroes of The Upper<br/><br/>Realm certainly surpassed those of the Mortal Realm. Perhaps his progress in Mortal Realm seemed exaggerated, but it might be nothing in The Upper Realm.<br/><br/>He wondered how he compared to Zhou Xue now, who was stronger?<br/><br/>Zhou Xue, sensing his gaze, casually placed her right arm on the table, propping up her chin with her hand, and looked at him with a teasing look, asking with a smile, “You’re not wondering who’s stronger between you and me, are you?”<br/><br/>Fang Wang gave a cough and said, “I am, after all, your husband. Naturally, I’m a bit competitive and hope to be stronger than you. That way, I can protect you.”<br/><br/>“Haha, husband? That’s just a marriage contract. Once grandpa and my uncles are gone, that piece of paper will be useless.”<br/><br/>Zhou Xue’s words were clearly a rejection, but her eyes gave Fang Wang the feeling that she was challenging him.<br/><br/>Fang Wang wanted to say more, but Zhou Xue shifted the topic to talk about the current situation of the Fang Family, and Fang Wangs thoughts also changed.<br/><br/>Several hours later.<br/><br/>The doors to the cave dwelling opened, and Fang Wang saw Zhou Xue off.<br/><br/>He stood at the cave entrance, staring at Zhou Xue’s departing figure, lost in thought.<br/><br/>Dusk had already fallen.<br/><br/>At that moment, the doors of a nearby cave dwelling opened, and Fang Wang glanced over to see Gu Li coming out. She had changed into traveling clothes and was wearing a bamboo hat.<br/><br/>Under Fang Wang’s gaze, she just nodded slightly, not saying much, and left directly on her flying sword.<br/><br/>Fang Wang snapped back to reality and couldn’t help but smile.<br/><br/>In the vast Mortal Realm, all those who cultivate are pursuing their own opportunities, struggling against their own fate; he, too, must diligently cultivate for his own goals.<br/><br/>In the Grand Chu Dynasty, the Vast Qi Sect.<br/><br/>This Sect was located between peaks, each mountain surrounded by spectacular currents of air stirring up the clouds. Inside a grand hall, the elders of the Vast Qi Sect were standing in two rows, like courtiers attending an audience.<br/><br/>The Cliff Hermit, Xu Guang, stood in the hall, with the Cliff Hermit looking embarrassed and Xu Guang bowing his head, fists clenched.<br/><br/>“So, you mean to say that you didn’t even get a chance to test Fang Wang’s strength and were scared away?<br/><br/>A figure standing higher up, with their back to them, said so, dressed in tight-fitting golden robes, tall and straight, wearing a jade crown pointing to the sky. Judging from this figure’s back, it was as if an Immortal Monarch had descended to the Mortal Realm.<br/><br/>He slowly turned around, and his features were very youthful, appearing to be just over twenty years old, with handsome features and his left hand resting behind his waist.<br/><br/>Looking down condescendingly at the Cliff Hermit, the Cliff Hermit felt ashamed and bowed his head.<br/><br/>The others in the hall looked at each other, but no one spoke, the atmosphere was tense.<br/><br/>“Just by clenching his fist, he scared you away. Such might—it seems to be the Mountain River Town Heaven Fist. He indeed earned that person’s recognition,” the man in golden robes said with a soft chuckle.<br/><br/>On hearing this, the Cliff Hermit asked, curious, “Ji… Sect Master, what kind of ultimate art is the Mountain River Town Heaven Fist?”<br/><br/>The man in golden robes lifted his right hand and gently clenched it. In an instant, the entire palace trembled, and a fearsome pressure enveloped everyone.<br/><br/>The Cliff Hermit’s expression changed, and he cried out in fear, “You… can do it<br/><br/>Xu Guang also looked up, his face turning pale, and he couldn’t help but step back..\t\t\t\t\t\t</div>", "images": {}, "success": true}