{"id": 121, "url": "https://www.novelhall.com/i-became-an-immortal-on-mortal-realm-32879/14296792.html", "title": "Chapter 121 - Chapter 121: Chapter 118: Let Them Live, Or Let Them Die?", "volume": 2, "volume_title": "Volume 2", "body": "<h1>Chapter 121 - Chapter 121: Chapter 118: Let Them Live, Or Let Them Die?</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 121: Chapter 118: Let Them Live, or Let Them Die?<br/><br/>Translator: 549690339<br/><br/>It took Xiao Zi less than two days to travel from Grand Wei to the Great Abyss Gate.<br/><br/>Standing on the head of the snake, Fang Wang looked at the ten peaks of the Great Abyss Gate from afar, a smile appearing on his face.<br/><br/>Seen from a distance, the Great Abyss Gate amidst the clouds appeared like an Immortal Gateway of the Mortal Realm, vast and ethereal.<br/><br/>For Xiao Zi and Zhao Zhen, although years had passed since their return, they did not feel much sentimentality. Xiao Zi had already burrowed back into the Soul-Devouring Gourd, not wanting to see anyone.<br/><br/>It was different for Fang Wang, who hadn’t returned for a thousand years. Seeing the Great Abyss Gate again stirred emotions within him.<br/><br/>Fang Wang took a deep breath, his face breaking into a smile.<br/><br/>He did not have Xiao Zi reduce in size but instead flew toward the Great Abyss Gate in such a majestic manner.<br/><br/>When he arrived at the mountain gate, the disciples standing guard were initially frightened by Xiao Zi’s Demonic Qi, but as soon as they recognized Fang Wang’s face, they cried out in surprise.<br/><br/>“It’s Brother Fang!”<br/><br/>“Really, Brother Fang, you’ve finally returned!”<br/><br/>“This is great, Brother Fang, the Great Abyss Gate needs you right now!”<br/><br/>“Exactly, the Vast Qi Sect is just too bullying, sticking around and refusing to leave!”<br/><br/>Fang Wang saw them grow angry as they spoke and couldn’t help but ask curiously what had happened.<br/><br/>The several disciples guarding the mountain began to talk all at once about the Vast Qi Sect.<br/><br/>After listening for a while. Fang Wang finally understood<br/><br/>So, the Vast Qi Sect from Grand Chu wants to insist on having him practice their ways?<br/><br/>And furthermore, the Vast Qi Sect had sent someone over, sticking around and refusing to leave the Great Abyss Gate?<br/><br/>Fang Wang’s gaze immediately grew colder.<br/><br/>No matter if the Vast Qi Sect truly wished to nurture him, such an attitude was simply too domineering. Besides, had they considered his own stance? “No matter, they shall be made to leave today.”<br/><br/>Fang Wang said calmly, and with that, he rode on Xiao Zi and flew into the Great Abyss Gate.<br/><br/>Along the way, Xiao Zi’s more than ten Zhang-long body was enshrouded in Demonic fog, resembling a dragon among the clouds, quite spectacular, turning the heads of the passing disciples, some of whom, not recognizing him, thought a demon had invaded, especially since Fang Wang was dressed in black.<br/><br/>Fortunately, it wasn’t long before someone recognized Fang Wang.<br/><br/>“It’s Elder Brother Fang Wang!”<br/><br/>Someone exclaimed, and this immediately caused a wave of exclamations to rise and fall.<br/><br/>The prestige of Fang Wang was indeed too high. Now within the Great Abyss Gate, no one could match him, not even the Sect Leader. All disciples took Fang Wang as their goal, proud to be in the same sect as him.<br/><br/>More and more disciples flew on their swords to observe from a distance, not daring to come too close.<br/><br/>Fang Wang directed Xiao Zi to fly towards the Main Meridian. Although the mountain-guarding disciples spoke angrily, the matter still had to be discussed with Guang Qiuxian to avoid any exaggerated accounts.<br/><br/>The news spread rapidly, and disciples from all the nine peaks flew out, eager to witness the current grace of Fang Wang.<br/><br/>Thus, Fang Wang rode the demon snake towards the Main Meridian followed by a magnificent procession of disciples, which to the unaware looked like he might be embarking on some great endeavor.<br/><br/>At the Main Meridian, within a courtyard.<br/><br/>The man in white robes opened his eyes and raised his eyebrows slightly, saying, “Such strong Demonic Qi, it’s almost on par with the Great Demon King.”<br/><br/>The elder in gray robes also opened his eyes. Sitting under the eaves, he looked into the distance and could see Fang Wang standing atop the demon snake.<br/><br/>His extraordinary hearing soon caught the name shouted by the disciples following Fang Wang.<br/><br/>“Fang Wang. ”<br/><br/>The elder in gray robes whispered softly. Upon hearing this name, the man in white under the tree stood up at once, his gaze following the direction from which Fang Wang was flying, his eyes filled with fighting spirit.<br/><br/>Without waiting for his master to speak, the man in white robes flew towards Fang Wang.<br/><br/>At the same time, peak masters, elders, and direct disciples from various veins came out of seclusion, all of them roused by Xiao Zi’s Demonic Qi. As soon as they emerged, they saw disciples rushing past their caves while shouting Fang Wang’s name.<br/><br/>Fang Wang had returned!<br/><br/>Even the peak masters and elders were excited at this news.<br/><br/>“Fang Wang, I am Xu Guang, an inner sect disciple from the Vast Qi Sect of Grand Chu. I’ve heard you possess the Heaven Yuan Spirit Treasure, so allow me to see today whether you are worthy of being recruited by our sect!”<br/><br/>The man in white robes blocked Fang Wang’s path and spoke coldly. He raised his right hand, and a long sword materialized in his grasp.<br/><br/>Xiao Zi stopped, sensing the opponent’s strength, certainly no match for itself.<br/><br/>However, Xiao Zi was cunning. Though it stopped, it raised its snake head up high, allowing Fang Wang to look down on Xu Guang from above.<br/><br/>Fang Wang lifted his chin slightly and asked, “Where is your master?”<br/><br/>Xu Guang raised his sword, pointing it at Fang Wang, and said, “There’s no need for my master to take action. First let me measure your abilities!”<br/><br/>“Stop!”<br/><br/>An explosive shout came. Yang Yuanzi arrived rapidly, his face flushed with anger, with the Third Vein elders following him in the same condition.<br/><br/>Guang Qiuxian, Zhao Chuanqian, Greedy Sleeper, and others arrived as well, even Vice Sect Leader Chai Yi was present.<br/><br/>“How audacious, you dare to draw your sword within my Great Abyss Gate!”<br/><br/>Yang Yuanzi stood in front of Xiao Zi, pointing angrily at Xu Guang and berating him.<br/><br/>In an instant, the gathering disciples joined the scolding, emboldened by their numbers. They had long been displeased with Xu Guang, having not dared to reproach him before, but now they took the opportunity to vent their anger freely.<br/><br/>“Just him? What qualification does he have to challenge our Elder Brother?”<br/><br/>“I heard long ago that a cultivator from Grand Chu has been lingering in Great Abyss Gate and refuses to leave, trying to hold Fang Wang hostage. So, it’s true.”<br/><br/>“Isn’t this a slap in the face of our Great Abyss Gate? To draw a sword within<br/><br/>Great Abyss Gate is utterly despicable!”<br/><br/>“Brother Fang, kill him!”<br/><br/>“Heh, any Tom, Dick, or Harry dares to pop up.”<br/><br/>As Xu Guang listened to the lower realm cultivators cursing him, his expression grew increasingly unpleasant, and just as he was about to explode, a gentle voice arrived:<br/><br/>“Guang’er, show no disrespect!”<br/><br/>Seeing a grey-robed elder flying over, he came to Xu Guang’s side, and while raising his hand as a gesture of respect towards Guang Qiuxian, he said with a smile, “My disciple is somewhat unruly, I hope Guang Fellow Daoist will not be angry. Naturally, we cannot draw our swords within Great Abyss Gate.”<br/><br/>Without waiting for Guang Qiuxian to respond, he turned towards Fang Wang, saying with a smile, “Fang Wang, I am a Supreme Elder from Vast Qi Sect, Cliff Daoist. I would like to invite you to cultivate at Vast Qi Sect. With your talent, and with the assistance of Vast Qi Sect, you will surely reach the Cross -Void Realm, and even aspire to higher realms.”<br/><br/>“Grand Chu has fully transitioned into a Cultivation Dynasty a hundred years ago and has also explored vast territories beyond the imagination of the other six dynasties. The Cultivation World is vast; why confine yourself to the barbaric lands of Grand Qi?”<br/><br/>These words showed no respect for Great Abyss Gate, darkening the faces of all the high-ranking cultivators to the extreme, their eyes burning with fury. If looks could kill, Cliff Daoist would have been reduced to dust by now.<br/><br/>Cliff Daoist ignored the gazes around him and looked at Fang Wang with a smile, growing more and more satisfied with him.<br/><br/>Fang Wang tilted his head slightly, looking down on Cliff Daoist, and said, “So it’s you who wants to take me away?”<br/><br/>Cliff Daoist replied with a smile, “It’s an invitation, a sincere one at that, for you to cultivate at Vast Qi Sect. We…” His words froze unfinished.<br/><br/>Boom! Boom! Boom!<br/><br/>All ten peaks of Great Abyss Gate trembled as spiritual energy from heaven and earth surged crazily towards Fang Wang, leaving everyone staring at him, dumbfounded.<br/><br/>Fang Wang raised his right hand, forming a fist, and white flame converged on it, drawing in spiritual energy from all directions. An unimaginable terrifying aura burst from within him, causing everyone in Great Abyss Gate to stop breathing for a moment and feel a heavy sensation in their chests.<br/><br/>For Cliff Daoist and Xu Guang facing him, the sensation was even more dreadful—an almost suffocating oppressiveness that enveloped them. They felt that if they tried to speak again, they would explode on the spot.<br/><br/>“How is this possible… What kind of aura is this…”<br/><br/>Cliff Daoist of the Cross-Void Realm shook all over, his cloudy eyes wide open, forehead covered in cold sweat.<br/><br/>Xu Guang, even more so, turned pale without a trace of his former arrogance, his eyes filled with endless fear.<br/><br/>In their pupils, Fang Wang’s posture was supremely dominating, and that raised right fist seemed to hold their fate.<br/><br/>The rest of Great Abyss Gate was equally shocked, and although Fang Wang had intentionally concentrated his aura, the sense of oppression they felt was still present.<br/><br/>Guang Qiuxian, Zhao Chuanqian, Yang Yuanzi, Greedy Sleeper, and all the other high-rankers of Great Abyss Gate couldn’t believe their eyes as they gazed at Fang Wang.<br/><br/>Returned after three years abroad, how had Fang Wang grown this strong?<br/><br/>Among the direct disciples, Ye Xiang looked at Fang Wang with eyes filled with admiration.<br/><br/>He knew he could never catch up to Fang Wang in this lifetime, but even so, he wanted to become as strong as possible, even if just a fraction of Fang Wang’s elegance.<br/><br/>“Sect Leader, do you say we let them live, or die?”<br/><br/>Fang Wang maintained his fist, the oppressive power of the Mountain River Town Heaven Fist enveloping Great Abyss Gate and causing the firmament to gather thunderclouds.<br/><br/>It was as if the heavens could feel Fang Wang’s emotions and were joining in his wrath!<br/><br/>Coming to his senses, Guang Qiuxian quickly said, “Of course, they can’t die. They were rude, but their offenses do not warrant death.”<br/><br/>Fang Wang fixed his gaze on Cliff Daoist, and said, “Apologize to Great Abyss<br/><br/>Gate.”<br/><br/>The terrifying murderous intent locked on Cliff Daoist, making it almost impossible for him to breathe. He could only grit his teeth and say, “Sorry…”<br/><br/>“Louder.”<br/><br/>“This poor Daoist apologizes to Great Abyss Gate!”<br/><br/>Cliff Daoist shouted begrudgingly, not feeling humiliated or angry, only endless fear.<br/><br/>Fang Wang glanced at Xu Guang, and the frightened Xu Guang quickly followed suit with an apology, stripped of any hint of his previous talent’s pride. “Leave Great Abyss Gate within ten breaths.”<br/><br/>Fang Wang relaxed his fist and spoke slowly. Upon hearing this, Cliff Daoist quickly bowed to him with a cupped fist, then hastily flew away with Xu Guang, in as disgraceful a manner as could be.<br/><br/>At the same time, the terrifying aura that caused Great Abyss Gate to tremble vanished completely, allowing everyone to breathe a sigh of relief and regain their composure. Their gazes towards Fang Wang were filled with admiration.<br/><br/>“How is this young man so powerful…”<br/><br/>Chai Yi looked at Fang Wang, her beautiful eyes filled with fear.<br/><br/>The undercover agent from Jin Xiao Sect was a bit panicked.<br/><br/>Because Fang Wang was destined to become the next Sect Leader of Great Abyss Gate, and he knew she was from Jin Xiao Sect.<br/><br/>The world fell silent, everyone still absorbed in Fang Wang’s display of power.<br/><br/>Yang Yuanzi’s face was flushed with excitement, but he was choked with emotions and could not speak.<br/><br/>“Fellow Daoist uncles and elders, shall we go to Shiyuan Hall to talk?”<br/><br/>Fang Wang revealed a smile, utterly different from before, not wanting to scare these elders.<br/><br/>As soon as Guang Qiuxian heard this, he hastily agreed, “Yes, to Shiyuan Hall, let’s go!”<br/><br/>He took the lead, flying towards Shiyuan Hall.<br/><br/>Fang Wang leaped up, leaving a message before flying towards the top of the main meridian mountain: “Xiao Zi, just wander around as you like, but don’t frighten the disciples.”<br/><br/>Xiao Zi immediately shrank in size, its Demonic Qi fading away, then flew towards Fang Zigeng in the crowd, hoping that Fang Zigeng would show it around.<br/><br/>As Xiao Zi lunged towards him, the disciples around Fang Zigeng scattered, and then, overwhelming cheers erupted throughout Great Abyss Gate..\t\t\t\t\t\t</div>", "images": {}, "success": true}