{"id": 124, "url": "https://www.novelhall.com/i-became-an-immortal-on-mortal-realm-32879/14297081.html", "title": "Chapter 124 - Chapter 124: Chapter 121: The So-Called Immortal Fate, Fang Wang’S Divine Image", "volume": 2, "volume_title": "Volume 2", "body": "<h1>Chapter 124 - Chapter 124: Chapter 121: The So-Called Immortal Fate, Fang Wang’S Divine Image</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 124: Chapter 121: The So-Called Immortal Fate, Fang Wang’s Divine Image<br/><br/>Translator: 549690339<br/><br/>“The Mountain River Town Heaven Fist is a fist technique capable of breaking heaven itself. This technique is unfathomably profound; I have only achieved minor success with it. But compared to Fang Wang, how does it fare?<br/><br/>The man in golden robes looked down at the cliffside hermit with a light chuckle and asked.<br/><br/>He then released his right fist, and everyone in the hall breathed a sigh of relief.<br/><br/>The aura that emitted from the man in golden robes when he clenched his fist was terrifying—even those of high cultivation felt an overwhelming urge to kneel before him.<br/><br/>The cliffside hermit’s forehead was covered in beads of sweat the size of beans as he replied, “I cannot compare them. I can only say that both are powers I can only aspire to.”<br/><br/>The man in golden robes swept his gaze over everyone in the hall and said, “You all once asked what I could bring to the Vast Qi Sect as its Sect Master.<br/><br/>How about this peerless technique?”<br/><br/>At these words, everyone’s eyes lit up, and immediately, one of the elders gave thanks to the man in golden robes.<br/><br/>The others, coming back to their senses, also thanked the man in golden robes.<br/><br/>The man in golden robes turned his gaze back to the cliffside hermit and said, “I will overlook your and your disciple’s failure this time, but such a situation must not occur again. Do not take on tasks if you are not confident about them.<br/><br/>Do you understand?”<br/><br/>The cliffside hermit and Xu Guang breathed a sigh of relief and hastily expressed their gratitude to the Sect Master.<br/><br/>A woman on the left side spoke up, “Sect Master, how shall we deal with the matter of Fang Wang next?”<br/><br/>The man in golden robes turned away, his back facing everyone, and said, “From what he has reported, Fang Wang is no longer someone the Vast Qi Sect can touch. Let it go.”<br/><br/>“But it’s very likely that Liang Xunqiu died at the hands of Fang Wang… So many cultivators saw Liang Xunqiu confront Fang Wang, Xiao Chen, and Lanxin Xianzi, and now only Fang Wang is left alive…”<br/><br/>An elder hesitated to say that after the incident at Zhui Tian Secret Realm, Grand Chu lost its number one talent, a national pillar Great Cultivator. Now the Cultivation World is brimming with criticism, and immense pressure is mounting against the Vast Qi Sect. As a sect that supports the nation, if the Vast Qi Sect does nothing, how will it convince the masses?<br/><br/>Without looking back, the man in golden robes leisurely said, “If the Vast Qi<br/><br/>Sect doesn’t act, others will. If Grand Qi falls and there is no longer a Great<br/><br/>Abyss Gate, where will Fang Wang turn to?”<br/><br/>Everyone exchanged confused looks, not understanding which power the Sect Master was referring to.<br/><br/>However, they did not dare to pursue someone whom even the cliffside hermit could not bring back.<br/><br/>The competition organized by the Great Abyss Gate proceeded as scheduled, with the Great Abyss Gate experiencing unprecedented liveliness. The geniuses of the entire Grand Qi Cultivation Realm gathered here, and the leader of the Suspended Vast Sword Sect, Xu Qiuming, personally led a team to attend.<br/><br/>Fang Wang did not attend this event, and none of the major sects had any objections. The leaders of the sects were already fearful of facing Fang Wang. It was the disciples below them, however, who were disappointed.<br/><br/>Even if disappointed, no one dared to force the issue.<br/><br/>With Fang Wang absent, the sects’ talents displayed their divine abilities, and the competition proceeded smoothly. Disciples from all sects achieved good results, and the event was deemed a success.<br/><br/>One day, Fang Hanyu, accompanied by Fang Family Disciples, came to visit Fang Wang. To lighten the mood, Fang Hanyu had Fang MO talk about the grand competition among the nine sects.<br/><br/>Fang Wang listened with rapt attention, and other Fang Residence disciples occasionally chimed in, no longer feeling the awkwardness that came with facing Fang Wang alone.<br/><br/>The names they mentioned the most were Xu Qiuming and Ye Xiang.<br/><br/>Since the conclusion of Zhui Tian Secret Realm, Xu Qiuming had achieved the Condensation Spirit Realm. Although he did not participate in this competition, he showcased his Sword Array to the various sects, challenging the younger generation to break through it as part of their competition. His display educated the younger ones about the gap between themselves and Grand Qi’s second talent.<br/><br/>Xu Qiuming had personally admitted that he was far from Fang Wang’s equal. Most of the younger generation had never seen Fang Wang in action; thus, Fang Wang acquired an even more mythical reputation in their minds.<br/><br/>“Han Yu also showcased his talent. He’s probably not far behind Ye Xiang,” Fang MO pondered aloud.<br/><br/>Fang Ziqing nodded and said, “That’s right, Brother Han Yu’s Nine Dragons<br/><br/>Divine Transformation Art is unmatched.”<br/><br/>Since Fang Wang demonstrated the Nine Dragons Divine Transformation Art, its divine skill had spread far and wide. No one was surprised that Fang Hanyu also knew this divine skill after all, they were brothers, and few dared to trouble him. And those who did were killed by him.<br/><br/>Upon hearing this, Fang Hanyu humbly said, “Ye Xiang has an Earth Origin Spirit Treasure, and his combat talent is excellent as well. Compared to him, I still have a long way to go.”<br/><br/>Fang Wang smiled. He thought Fang Hanyu was being modest.<br/><br/>Fang Hanyu, having broken through to the Profound Heart Realm and wielding the Absolute Heart Evil Eye and the Sword Saint’s Sword Qi, might not be weaker than Ye Xiang.<br/><br/>Moreover, Fang Hanyu wielded a Sword Spirit that surpassed the usual Earth Origin Spirit Treasure. It was a Lifespirit Treasure crafted for him by the Sword<br/><br/>Saint. Zhou Xue had mentioned that as Fang Hanyu’s control over the Sword Saint’s Sword Qi grew stronger, his Lifespirit Treasure’s grade would also rise, reaching the heavenly grade would not be difficult.<br/><br/>With the divine skill inheritance from the Ji Hao Sect, the Sword Saint’s Sword Qi inheritance, and the Absolute Heart Evil Eye, Fang Hanyu had already defied heaven and altered his fate, possessing the qualifications to contend with the world’s foremost talents. However, he was overshadowed by Fang Wang.<br/><br/>When others mentioned him, it was easy to think of Fang Wang. And compared to Fang Wang, he naturally seemed unremarkable.<br/><br/>“Brother Wang, what realm are you at now? Is the Condensation Spirit Realm hard to break through?” Fang Xin asked curiously.<br/><br/>Three years had passed since Fang Wang returned to the Great Abyss Gate, advancing only a minor realm to the fourth layer of the Condensation Spirit Realm. With such a pace, he felt slow, so he remarked, “Indeed it is hard to break through, incomparable to previous realms.”<br/><br/>Upon hearing this, Fang Hanyu knew Fang Wang’s cultivation speed was definitely not slow. He simply didn’t bother to point it out.<br/><br/>Fang Hanyu changed the subject and said, “By the way, Zi Geng has headed south to the sea, saying he’s seeking immortal fate. Who knows when he’ll return?”<br/><br/>To the sea?<br/><br/>Fang Wang asked, “Did he inform his family?”<br/><br/>Fang Hanyu nodded, “The Fang Residence fully supports him.”<br/><br/>Fang Xin smiled and said, ‘Grandfather now considers him the fourth great talent and values him highly.”<br/><br/>“And Zhou Xue also thinks highly of him,” added Fang Hanyu.<br/><br/>Zhou Xue held a particularly high status in the hearts of those at the Fang Residence, especially among the young disciples who had come for cultivation; they had all received her care at some point.<br/><br/>“Then let him go,” Fang Wang said with a smile, “who knows, by the time he returns, he might have become a Great Cultivator surpassing Grand Qi.”<br/><br/>Afterward, Fang Hanyu brought up the Cultivation World of Grand Qi, indicating that overall, peace had been restored, and the nine schools were coexisting harmoniously without any major conflicts.<br/><br/>The Emperor Zhao Qi was also very capable, providing hope to the commoners who went to mine the Dragon Vein. They could return home at the latest after ten years, and if they performed well, they could return even earlier and receive a reward from the court. With the issuance of various people-friendly decrees, the commoners stopped complaining and even begged for the opportunity to mine the Dragon Vein.<br/><br/>The reason the court had money was because the Great Abyss Gate took the lead in forcing various noble families to donate money, thus creating the world as it is today.<br/><br/>Throughout the ages, as long as the country’s territory had not significantly diminished, if the commoners and the court were without money, it naturally meant the noble families had amassed it.<br/><br/>In conclusion, Fang Hanyu gave high praise to Zhao Qi for his sensibleness.<br/><br/>Zhao Qi sent people to promote Fang Wang’s name among the populace and even had temples and statues erected in his honor, proclaiming him the Immortal who saved Grand Qi.<br/><br/>Fang Wang, having his roots in the Fang State Duke’s Mansion, found this identity made it easier for the common people to accept him.<br/><br/>Fang Wang was both amused and dismayed; he had not expected Zhao Qi to employ such tactics.<br/><br/>And so, it was not until dusk that Fang Hanyu finally departed with his clan members.<br/><br/>Xiao Zi climbed onto the desk and said, “Master, Fang Hanyu’s aura of killing intent is growing stronger, aren’t you worried?”<br/><br/>Fang Wang, with a calm expression, replied, “He is certainly aware of it himself, and what use is it for me to worry?”<br/><br/>True Combat Technique could only temporarily set aside emotions, but it couldn’t really quiet the mind, and with Fang Hanyu only practicing the Nine Dragons Divine Transformation Art, which already took a long time, how could he find the time to train in the more complex True Combat Technique?<br/><br/>Zhao Zhen floated out of the Soul Devouring Gourd and chuckled, “I actually think he can carve out his own path; he has a fierce determination in him.” Fang Wang no longer paid them any mind and closed his eyes once more.<br/><br/>Continue the cultivation!<br/><br/>Having spent nearly five thousand years in the Heavenly Palace, those difficult times had passed; ten years of seclusion in reality was nothing to him.<br/><br/>Although his strength was already formidable, as Great Cultivators of the Cross-Void Realm were now frequently appearing before him, he had to enhance his cultivation and not fall behind.<br/><br/>As spring passed and autumn arrived, ten years swiftly went by.<br/><br/>Fang Wang’s cultivation had reached the sixth layer of the Condensation Spirit Realm. For these ten years, he was undisturbed, until this day, when he suddenly opened his eyes.<br/><br/>Not just him, Xiao Zi and Zhao Zhen were also awakened, and they looked up.<br/><br/>The Third Peak was slightly trembling, as if there were an earthquake, but it was minor; what mattered more was that the spiritual energy inside the cave dwelling was starting to increase.<br/><br/>“Could it be…”<br/><br/>Zhao Zhen suddenly thought of something, his face revealing a mix of surprise and excitement.<br/><br/>Fang Wang immediately stood up and walked out of the cave dwelling.<br/><br/>He went to the edge of the cliff and looked out to see that the spiritual energy of the other mountains was also surging greatly. Mists of spiritual energy visible to the naked eye were rising from the ground upward.<br/><br/>To be precise, it was the land overflowing with spiritual energy, and the spiritual energy between heaven and earth was increasing rapidly!<br/><br/>Fang Wang faintly sensed an indescribable pressure from under the earth, as if it were Heavenly Might.<br/><br/>“Indeed, Grand Qi has finally become a Cultivation Dynasty!” Zhao Zhen exclaimed excitedly.<br/><br/>The disciples from the other mountains came out of seclusion one after another, some astonished, some afraid, some ecstatic; the news spread quickly.<br/><br/>“Grand Qi has succeeded in becoming immortal!”<br/><br/>A disciple flew on his sword, shouting loudly. He was not alone – many disciples flew back and forth among the peaks to spread this word.<br/><br/>At this moment, Gu Li’s cave dwelling gate moved, and Zhao Zhen quickly hid inside the Soul Devouring Gourd to avoid being noticed.<br/><br/>Gu Li walked out of her cave dwelling and made her way to Fang Wang’s side. Gazing at the magnificent view of heaven and earth, she expressed, “Decades of planning have finally succeeded.”<br/><br/>Fang Wang looked at her and noticed that she too had reached the first layer of the Profound Heart Realm. Although not as advanced as Fang Hanyu, her progress rate in cultivation was definitely fast.<br/><br/>“This is a happy occasion for everyone.” Fanz Wang said softly.<br/><br/>Gu Li turned her head to look at him, her eyes bright and clear behind the veil, and said softly, “I’m getting ready to leave.”<br/><br/>Fang Wang asked, “Where to?”<br/><br/>Gu Li replied, “Heading south to the sea. The original plan was to head north seeking immortal fate once reaching the Profound Heart Realm, but with Heaven’s Larceny Saint Sect emerging in the north and their domineering actions becoming evident from what they did in Grand Qi, my father has arranged for me to go overseas in search of immortal fate.”<br/><br/>Fang Wang nodded and said, “That’s good. I wish you a smooth journey.”<br/><br/>Even if the spiritual energy of heaven and earth in Grand Qi were to increase, it would only make cultivation easier, but without higher and profound Taoist teachings, how would one compete for higher realms? The Condensation Spirit Realm was already the limit in Grand Qi!\t\t\t\t\t\t</div>", "images": {}, "success": true}