{"id": 127, "url": "https://www.novelhall.com/i-became-an-immortal-on-mortal-realm-32879/14297595.html", "title": "Chapter 127 - Chapter 127: Chapter 124 Mortal Realm True Immortal, Carefree Immortal", "volume": 2, "volume_title": "Volume 2", "body": "<h1>Chapter 127 - Chapter 127: Chapter 124 Mortal Realm True Immortal, Carefree Immortal</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 127: Chapter 124 Mortal Realm True Immortal, Carefree Immortal<br/><br/>Translator: 549690339<br/><br/>“Is there anything else besides this matter?”<br/><br/>Fang Wang continued to ask. His mind was preoccupied with just one thing: breaking through to the Cross-Void Realm, so he wanted to conclude this government assemblv as auicklv as Dossible.<br/><br/>Indeed, I’m not suited to be a Sect Leader.<br/><br/>Fang Wang lamented inwardly, becoming even more resolute in his decision to leave.<br/><br/>Chai Yi started discussing other matters, regarding the ownership of the Dragon Veins. Grand Qi had already activated forty-nine Dragon Veins. The spiritual energy around the Dragon Veins was the most concentrated, and all the major schools wanted to compete for them, but they couldn’t simply take them by force; they had to reason out their claims.<br/><br/>After she finished, Zhao Chuanqian followed with his opinion.<br/><br/>The other Peak Masters and Elders would also offer suggestions, and finally, Fang Wang would make the final decision.<br/><br/>Put plainly, the Sect Leader was there to make decisions and also to shoulder the blame. If things went well, the credit went to the Sect Leader. If they failed, it was also the Sect Leader’s fault. Fang Wang felt this was quite fair.<br/><br/>After more than an hour of deliberation, everyone finally left.<br/><br/>As the door closed, Fang Wang breathed a sigh of relief and continued his training.<br/><br/>His cultivation was about to reach its limit, and he would soon break through. The Solaris Scripture recorded the methods for breaking through to the Cross-Void Realm.<br/><br/>At this level, breaking through required facing tribulation.<br/><br/>Many Great Cultivators died during their tribulation, so to prepare for the tribulation, one would make full-proof plans. Fang Wang, however, was not worried. His physical body was extremely strong, and with many Great<br/><br/>Perfection techniques at his disposal, it would be hard even if he wanted to die.<br/><br/>In the Grand Qi Imperial City, located in the central region of the land, the Plains of Fang Yuan spanned a thousand miles of flatland. The mountains around the Imperial City were not high, but the scenery was beautiful.<br/><br/>Within the Imperial Palace.<br/><br/>Xu Qiuming sat cross-legged on the eaves of the Imperial Palace, while the court officials walking toward the palace below craned their necks to look at him.<br/><br/>“Is that the Xu Qiuming from the Suspended Vast Sword Sect? His demeanor truly befits that of an immortal.”<br/><br/>“It’s said he’s one of the top Great Cultivators in the Grand Qi Cultivation Realm.”<br/><br/>“I wonder what kind of grace Sword Saint Fang Wang possesses.”<br/><br/>“Xu Qiuming is already a famous Great Cultivator renowned across seven dynasties; with him here, surely no one can harm His Majesty.”<br/><br/>“I wonder what important matter brought His Majesty to summon him for protection. ”<br/><br/>Xu Qiuming had been there for several days now, attending court each day, so all the court officials had seen him, and his name had spread throughout the alleys of the Imperial City.<br/><br/>Fang Yin, Fang Wang’s father, was walking among the crowd and also glanced at Xu Qiuming.<br/><br/>As the court officials filed into the palace, Xu Qiuming slowly opened his eyes. From his vantage point, he could overlook the entire Imperial City.<br/><br/>“Is it coming soon?”<br/><br/>Xu Qiuming murmured to himself, his Sword Intent expressing a sense of unease that forewarned of imminent danger.<br/><br/>The stronger the opponent, the less panicked he was; instead, he was filled with anticipation.<br/><br/>Ever since his time in the Zhui Tian Secret Realm, his Sword Intent had soared to the skies. Except when facing Fang Wang, he felt he would not lose again. Facing that mysterious being who claimed to be an immortal, he was eager for a fight.<br/><br/>Following his gaze, rolling thunderclouds appeared on the horizon, oppressively dense.<br/><br/>Great Abyss Gate, Shiyuan Hall.<br/><br/>Fang Wang stood up and walked out of Shiyuan Hall. Seeing this, Xiao Zi quickly shouldered the Soul Devouring Gourd and followed.<br/><br/>After walking out of the hall, he looked around and finally decided to face the tribulation in the empty square below.<br/><br/>Heavy snow fell, and the world seemed vast and boundless, with mountain peaks hidden in the mist as if they were Mountain Gods—mysterious and majestic. The accumulated snow covered the square, leaving no stone visible. He proceeded to the center of the square and began to sit in meditation.<br/><br/>Xiao Zi floated in the air, asking with a mix of nervousness and anticipation,<br/><br/>“Master, are you going to start crossing the tribulation?”<br/><br/>Zhao Zhen popped out of the gourd, his face filled with excitement, saying, “Crossing the tribulation is something that only appears in myths. This means that our lord has transcended mortal flesh.”<br/><br/>Fang Wang, with his eyes closed, replied, “That’s right. When the time comes, keep your distance. The might of the heavens is vast and could easily expel demons and slay spirits.”<br/><br/>He immediately began to practice the Solaris Scripture.<br/><br/>Nature’s spiritual energy surged towards him, forming a whirlwind visible to the naked eye around him that grew increasingly stronger, sweeping up the surrounding snow as if in a blizzard.<br/><br/>Time ticked away, moment by moment.<br/><br/>Approximately two hours later, the spiritual energy from the heavens and earth converged above the square, causing the sea of clouds above to churn violently as it gathered heavenly might.<br/><br/>High -level Cultivators from the Nine Veins Mountain and the Main Meridian emerged from seclusion, rushing through the immense snowfall from all directions. When they caught sight of Fang Wang’s figure, they were all taken aback.<br/><br/>“What is Fang Wang doing?”<br/><br/>“Could he be practicing some spell?”<br/><br/>“Is it the Nine Heavens Azure Thunder Sword Formation?”<br/><br/>“This isn’t right; he’s absorbing nature’s spiritual energy. It feels somewhat like Spiritual Refinement, but the power is greater.”<br/><br/>The Tai Yuan Sect Disciples discussed among themselves, curious about what Fang Wang was doing.<br/><br/>Vice Sect Leader Chai Yi, Inheritance Elder Zhao Chuanqian, Greedy Sleeper, and other high-ranking members also arrived. Seeing Fang Wang, they were just as astonished.<br/><br/>“He is crossing the tribulation to break through!” Chai Yi’s brows furrowed as she enunciated each word.<br/><br/>Breaking through the tribulation?<br/><br/>Everyone was stunned, and an elder cautiously asked, “Why does one need to face tribulation upon breakthrough?”<br/><br/>No sooner had he spoken than he regretted it, for he realized that Fang Wang was breaking through to a lofty realm far beyond his understanding.<br/><br/>Greedy Sleeper lamented, “Beyond the Condensation Spirit Realm… truly, it is the will of the Immortals.”<br/><br/>Many cultivators spend their entire lives unable to reach the Condensation<br/><br/>Spirit Realm, and even if they do, advancing further is immensely difficult. But Fang Wang was different; from the moment he set foot on the path of cultivation, he seemed to have faced no bottlenecks. His journey was smooth, constantly challenging the limits and shattering the world’s perception of him. “Everyone, form the formation to prevent the tribulation from affecting the<br/><br/>Nine Veins, ”<br/><br/>Zhao Chuanqian said, his face stern as always.<br/><br/>Upon hearing this, the cultivators scattered, returning to their respective veins to gather their direct disciples.<br/><br/>Within less than the time it takes an incense stick to burn, all disciples of the Great Abyss Gate had heard that Fang Wang was about to face the tribulation to break through.<br/><br/>Tribulation!<br/><br/>Since the founding of the Great Abyss Gate, no one had ever faced one.<br/><br/>More and more disciples left their caves and flew on their swords to watch, bringing life to the Great Abyss Gate in the midst of winter.<br/><br/>Meanwhile.<br/><br/>Above the Imperial City, where the seasons differed from the Great Abyss Gate and the weather was milder, thunderclouds were also rolling menacingly in the sky.<br/><br/>At this moment, citizens and nobles alike were looking up at the firmament, some standing in the street, others pushing open windows and leaning out, and even soldiers on the city walls were looking up.<br/><br/>In the high sky, two figures were confronting each other, one of whom was Xu Qiuming.<br/><br/>Xu Qiuming stood tall, a sword shadow radiating silver light floating behind him, like a sword spirit. Terrifying sword qi spilled from his body, surging forth and piercing through the clouds, creating a hole over thirty feet wide that looked as if the sky had been torn apart.<br/><br/>Xu Qiuming’s sword intent was like a rainbow, fierce and powerful, but it did not intimidate his adversary.<br/><br/>“Not bad sword intent, but unfortunately, the grade of your Lifespirit Treasure is lacking. You’re not Fang Wang,”<br/><br/>said a speaker who was an old man in a ragged Dao robe. He was thin, with protruding cheekbones and chaotic white eyebrows, his tiger-like eyes examining Xu Qiuming with an aggressive gaze.<br/><br/>Xu Qiuming kept a poker face, but inwardly he was astonished.<br/><br/>Such profound aura!<br/><br/>He had never seen such a person before; the Dao robe elder seemed like an unfathomable ocean, inscrutable, with an indescribable aura of dead silence around him, as if symbolizing death.<br/><br/>“I am Xu Qiuming of the Suspended Vast Sword Sect. May I have the honor of knowing your name?” asked Xu Qiuming coldly.<br/><br/>The Dao robe elder broke into an unrestrained laugh, scoffing at Xu Qiuming, “My name? I am a True Immortal living among mortals, you may call me the Carefree Immortal!”<br/><br/>As soon as he finished speaking, the Carefree Immortal suddenly raised his hand, and from his sleeve came a red poisonous snake, shooting at Xu Qiuming.<br/><br/>Xu Qiuming’s eyes narrowed, and instead of retreating, he advanced, attacking the Carefree Immortal head-on. In an instant, the sword spirit behind him disappeared.<br/><br/>A streak of sword light dazzled the heavens and earth, causing everyone in the city to close their eyes.<br/><br/>Boom!<br/><br/>An ear-splitting roar erupted, and violent winds swept through the heavens and earth. Numerous sword qi burst forth from the high sky, sweeping across the horizons.<br/><br/>Xu Qiuming charged up to Carefree Immortal, his fingers as if they were swords, thrusting fierce sword qi, but the Carefree Immortal easily dodged them all.<br/><br/>In the face of Xu Qiuming’s sword qi, Carefree Immortal dodged swiftly. While Xu Qiuming’s movements seemed faster, too quick for the naked eye to capture, everyone within the Imperial City could clearly see Carefree Immortal’s figure.<br/><br/>“Hahahaha! Little lad, daring to fight a True Immortal, you’re going to die a miserable death!”<br/><br/>Laughing uncontrollably, the Carefree Immortal followed with a flick of his finger, fast as lightning, striking Xu Qiuming’s right shoulder.<br/><br/>Xu Qiuming’s expression instantly froze as an unimaginable force pierced his shoulder. Accompanied by a thunderous explosion, his figure shot backward, plummeting like a meteor from beyond and crashing into the Imperial Palace.<br/><br/>Boom!<br/><br/>A huge palace collapsed under the impact, dust billowing skyward.<br/><br/>The Carefree Immortal maintained his pointing gesture, and a circle of force was spreading out in front of him. His smile was full of arrogance.<br/><br/>“How daring of a mere Condensation Spirit Realm cultivator to defy me, an Immortal!”<br/><br/>The Carefree Immortal said scornfully, but his expression changed immediately upon finishing his words.<br/><br/>The ground trembled slightly, felt by everyone in the city, especially within the Imperial Palace where the tremors became more violent, causing pieces of stone and wood to lift into the air.<br/><br/>From within the billowing dust, a figure slowly emerged, it was Xu Qiuming!<br/><br/>The right shoulder of Xu Qiuming bore a large, gory hole, but it didn’t bend his physique. At that moment, he held his sword spirit in his grip.<br/><br/>An indescribable Sword Intent enveloped the entire Imperial City. Whether they were cultivators, martial heroes, or soldiers, anyone in possession of a sword felt it singing, as if greeting the sovereign of the Sword Dao.<br/><br/>More and more people began holding onto their sword hilts, fearing their swords would fly out.<br/><br/>The Carefree Immortal squinted his eyes, marveling, “Such a profound Sword Intent from a little Condensation Spirit Realm. It seems, youngster, you have the perception to transcend the limits of a Lifespirit Treasure. Indeed, the heavens have not failed me!”<br/><br/>Xu Qiuming lifted his sword and pointed it at the Carefree Immortal. At this moment, with his hair disheveled and black locks wildly fluttering, he looked even more domineering.<br/><br/>Great Abyss Gate, Main Meridian.<br/><br/>Fang Wang still maintained his meditation posture, now suspended in mid-air. The thunderclouds above had already begun to show signs of lightning and thunder, their heavenly might suffusing the air with oppression.<br/><br/>The Main Meridian was now surrounded by a massive light formation. All disciples of the Great Abyss Gate watched eagerly from outside the array, some excited, some fearful, and some brimming with anticipation.<br/><br/>Suddenly, Fang Wang’s eyes opened as a massive lightning serpent, swift as a startled swan, shot down at him but dispersed before it could strike.<br/><br/>Body-protecting Divine Barrier!\t\t\t\t\t\t</div>", "images": {}, "success": true}