{"id": 137, "url": "https://www.novelhall.com/i-became-an-immortal-on-mortal-realm-32879/14301472.html", "title": "Chapter 137 - Chapter 137: Chapter 134: The Immortal Of This Era, Tian Yuan Becomes A Disciple", "volume": 2, "volume_title": "Volume 2", "body": "<h1>Chapter 137 - Chapter 137: Chapter 134: The Immortal Of This Era, Tian Yuan Becomes A Disciple</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 137: Chapter 134: The Immortal of This Era, Tian Yuan Becomes a Disciple<br/><br/>Translator: 549690339<br/><br/>“Seeking death? Hahaha—”<br/><br/>The demonically charming man let out a thunderous laugh as if he’d heard the funniest joke in the world, an incredibly domineering aura enveloping the entire sea area.<br/><br/>His fierce gaze turned to Fang Wang, cold and brimming with murderous intent, and he said icily, “Human Cultivator, remember my name, I am one of the Seventy-Two Kings of the Demon Palace, Black Zen King. Tell me your name!”<br/><br/>Although he was angry, he could sense that Fang Wang was very strong.<br/><br/>Fang Wang replied, “If you insist on seeking death, then please remember, the one who will kill you is Fang Wang!”<br/><br/>He slowly raised his right hand, gradually clenching it into a fist, and in an instant, an aura even more domineering than the Black Zen King’s erupted, causing the sea to heave with monstrous waves.<br/><br/>The Chu Family Cultivators were all shocked as they watched Fang Wang. Having roamed these seas for so long, it was the first time they had felt such a terrifying presence.<br/><br/>Chu Song was even more curious about Fang Wang’s cultivation level; he conservatively estimated that Fang Wang was at least two major realms above him.<br/><br/>“Fang Wang… It sounds familiar…”<br/><br/>A cultivator murmured to himself. No one answered him, as all eyes were firmly fixed on the standoff between Fang Wang and Black Zen King.<br/><br/>Fang Wang tossed the Six Harmonies and Eight Desolations Seal backward from his left hand, then stepped through the air towards the Black Zen King.<br/><br/>Sensing the tyrannical might of the Mountain River Town Heaven Fist, the<br/><br/>Black Zen King was both shocked and furious. He immediately lifted his great<br/><br/>sword, bellowing, “My children, tear the prey to pieces, leave this one to me!”<br/><br/>His voice thundered, and hundreds of thousands of monster beasts all around roared in response, charging towards the fleet.<br/><br/>The Black Zen King leapt up, with two flood dragons breaking free from the ropes of the white jade palanquin behind him, instantly rushing towards him, quickly transforming into two black sashes wrapping around his shoulders, greatly augmenting his aura.<br/><br/>The Black Zen King raised his great sword high, striking furiously at Fang Wang.<br/><br/>Before the sword could fall, the sea below Fang Wang parted, the sea within several miles collapsing spectacularly.<br/><br/>The Six Harmonies and Eight Desolations Seal grew even larger at a faster rate, covering the fleet. With ten thousand golden rays falling, it rapidly formed a golden light barrier to protect the fleet.<br/><br/>Facing the oncoming Black Zen King, Fang Wang surged upwards with explosive force, his right fist bringing a heaven-breaking momentum.<br/><br/>His fist shattered the firmament!<br/><br/>The Black Zen King’s complexion abruptly changed, sensing an extreme threat; he exerted all his might, channeling all his demonic power into the blade.<br/><br/>Boom!<br/><br/>Fang Wang soared upwards, clashing with the Black Zen King, their tremendous forces colliding and creating a bright light that shone across sky and sea, causing everyone and every beast to instinctively close their eyes. Then, a terrifying strong wind descended from the heavens.<br/><br/>Hundreds of thousands of monster beasts, as if crazed, threw themselves at the fleet but were stopped by the golden light of the Six Harmonies and Eight Desolations Seal. Soon, a sea of blood formed outside the golden light, and the monsters in the sky attacked the huge Seal, but their strength couldn’t shake the Six Harmonies and Eight Desolations Seal.<br/><br/>The Chu Family Cultivators regained their vision and turned around to look up at the Six Harmonies and Eight Desolations Seal in the sky.<br/><br/>Chu Song and Chu Yin did the same, both father and son agape, unable to believe their eyes.<br/><br/>What treasure is this?<br/><br/>How could it become so large?<br/><br/>Even Chu Song, a cultivator in the Condensation Spirit Realm, mistook what he saw for an encounter with an Immortal from the Mortal Realm.<br/><br/>Chu Song noticed the text at the bottom of the Six Harmonies and Eight Desolations Seal, reading unconsciously, “As eternal as heaven and earth, the reason they can endure is that they do not exist for themselves… that is the way of immortality…”<br/><br/>His spirit lifted—could the inscriptions at the bottom of the Seal be the method to immortality?<br/><br/>“Look, up in the sky!”<br/><br/>A female cultivator exclaimed, causing all the Chu Family Cultivators to turn their heads.<br/><br/>In the sky, Fang Wang stood proud, holding up his right arm, his right fist piercing through the Black Zen King’s chest and holding him up above his head. Demon blood continuously spilled down. The Black Zen King’s great sword was shattered, and his face showed fear and twitched with horror.<br/><br/>Hiss—<br/><br/>Many Chu Family Cultivators gasped, and some even rubbed their eyes.<br/><br/>The once seemingly invincible Black Zen King had been defeated by Fang Wang in a single move?<br/><br/>Fang Hanyu and Xiao Zi both heaved a sigh of relief.<br/><br/>Zhao Zhen spread his hands, saying, ‘What were you worrying about? That’s<br/><br/>Fang Wang! ”<br/><br/>Despite his words, the excitement in his eyes betrayed him; he was far from as calm as he appeared.<br/><br/>Looking up, they saw the cloud of Demonic Qi above the Black Zen King had been blasted open, over a hundred feet across and still expanding, clear evidence of how terrifying Fang Wang’s punch had been.<br/><br/>“Damn it…”<br/><br/>The Black Zen King’s body shook, his chest continuously spewing blood, even from his mouth, his face contorted with bulging veins, in extreme agony.<br/><br/>Fang Wang looked at him and asked, “What are you searching for?”<br/><br/>The Black Zen King gritted his teeth and said, “True Dragon… there’s a True<br/><br/>Dragon on your ship… if I eat it, I will transform into a dragon…”<br/><br/>Before he could finish, he suddenly transformed into a Black Python, opening his wide, blood-filled maw at Fang Wang.<br/><br/>Fang Wang’s left fist struck upwards, once again unleashing the Mountain River Town Heaven Fist.<br/><br/>With a blast!<br/><br/>The upper body of the Black Zen King instantly turned into a mist of blood, and the clouds of demons in the sky were once again dispersed.<br/><br/>Blood rained down like a shower, and Fang Wang ignited the Solaris True Fire on his body, keeping the demon blood from contaminating him.<br/><br/>Fang Wang withdrew his hand, holding a demon core in his right hand.<br/><br/>The surface of the demon core roiled with black qi, as if something was trying to escape; it was the Primordial Spirit of the Black Zen King, firmly suppressed within the demon core by Fang Wang’s right hand.<br/><br/>Fang Wang turned around and looked down at the endless horde of monster beasts, which had lost their reason. Only a few noticed that the Black Zen King had died and quickly burrowed into the seabed, while many more were attracted by the scent of a True Dragon.<br/><br/>True Dragons should have been able to deter the monsters, but Xiao Zi really wasn’t up to scratch.<br/><br/>Fang Wang plunged downward, swiftly transforming into a Black Dragon.<br/><br/>Nine Dragons Divine Transformation Art!<br/><br/>This scene startled the Chu Family cultivators, who mistook Fang Wang for a transformed monster.<br/><br/>The Black Dragon powerfully tore through the midst of the monster tide; wherever it passed, flesh and blood flew, and not a single monster beast could withstand its rampage.<br/><br/>The Black Dragon circled around in golden light, tearing apart countless monsters.<br/><br/>“I remember now! He is the Heaven Yuan Sword Saint, Fang Wang from Grand Qi, who is said to possess the Heaven Yuan Spirit Treasure. He’s the only one in the seven states to the south of the continent throughout history. He also inherited the Nine Dragons Divine Transformation Art from Ji Hao Sect, allowing him to transform into a dragon!” a cultivator exclaimed, immediately reassuring many others.<br/><br/>At least he’s human, not a real demonic dragon…<br/><br/>Heaven Yuan Spirit Treasure!<br/><br/>These four words caused more and more cultivators to turn their heads toward<br/><br/>Chu Yin.<br/><br/>Caught in a daze, Chu Yin could hear his own heartbeat, stronger than it had ever been. He thought blankly, “Is the Heaven Yuan Spirit Treasure really that powerful?”<br/><br/>He had already idolized and revered Fang Wang, and now, knowing that Fang Wang, too, was a Heaven Yuan Spirit Treasure just like him, he felt an even closer connection.<br/><br/>Fang Hanyu mused, “Using the same Nine Dragons Divine Transformation Art, although I treat it as a killing technique, it’s not nearly as exquisite as Fang Wang’s.”<br/><br/>Zhao Zhen kept turning around, his gaze following the form of the Black Dragon.<br/><br/>After rampaging several rounds, the monster tide completely dispersed, and the monster beasts fled in panic, with the vast majority diving into the seabed.<br/><br/>From high above, the grand and immense Six Harmonies and Eight Desolations Seal cast down a golden light screen, protecting several miles of the sea surface, while beyond the light, the vast sea was blood-red, covering an even greater area.<br/><br/>The blood-red sea seemed to boil, churning endlessly.<br/><br/>The Black Dragon flew towards the Law Ship and dissipated mid -air, with Fang<br/><br/>Wang flying back while raising his hand to retrieve the Six Harmonies and Eight Desolations Seal into his possession, then with a flip of his left hand, the seal disappeared.<br/><br/>Watching Fang Wang’s figure, Chu Song sincerely exclaimed, “He’s truly an<br/><br/>Immortal.”<br/><br/>Fang Wang landed, and with a wave of his hand, numerous demon cores fell onto the deck. He then said, “Go and collect the demon cores.”<br/><br/>Fang Hanyu, Xiao Zi, and Zhao Zhen immediately set into action.<br/><br/>Chu Song also instructed, “Hurry and help our benefactor collect the demon cores. Whoever dares to keep them for themselves will see no mercy from me!”<br/><br/>Over a hundred cultivators eagerly jumped into the sea, not so much for the demon cores, but rather because they witnessed the Immortal-like presence.<br/><br/>Fang Wang looked at the demon core of the Black Zen King and thought to himself, “I need to find a way to prevent Xiao Zi from attracting more monsters. There are seventy-two kings in that Monster Palace; they’re not to be underestimated.”<br/><br/>At that moment, Chu Song, with Chu Yin, flew forward, both landing on the deck and immediately kneeling and kowtowing to Fang Wang.<br/><br/>Fang Wang glanced at them and asked, “What is the meaning of this?”<br/><br/>Chu Song hurriedly replied, “Firstly, to thank our benefactor for the rescue; secondly, we hope you will take my son as your disciple. He possesses the potential of the Heaven Yuan, and when he grows up, he will surely honor and repay you!”<br/><br/>Potential of the Heaven Yuan?<br/><br/>Fang Wang looked at Chu Yin. The boy seemed ordinary, with weak Spiritual Power, having not yet completed Spiritual Refinement.<br/><br/>wait!<br/><br/>Fang Wang narrowed his eyes, his gaze piercing through Chu Yin’s forehead, catching a glimpse of a light glimmering within his soul.<br/><br/>That’s the Treasured Spirit Space!<br/><br/>How could there be a Treasured Spirit Space without having completed Spiritual Refinement?<br/><br/>Could it be that he really is a Heaven Yuan Spirit Treasure?<br/><br/>Chu Song, worried Fang Wang might disbelieve, introduced, “We come from the Chu Family. My name is Chu Song. Our family has an ancestor who has lived for eight hundred years, a master of divination, who foretold that my son has the potential of the Heaven Yuan. This matter is a secret of our Chu Family.”<br/><br/>Fang Wang asked, “Aren’t you afraid that I might scheme against him, or take his spirit treasure?”<br/><br/>Chu Song replied, “Without you, both father and son would have perished. Moreover, you yourself are a Heaven Yuan Spirit Treasure. Cultivators will eventually seek to establish lineage. Looking around the world, Heaven Yuan Spirit Treasures are hard to come by, and, if any exist, they are held by ancient families and sects. Why not take my son?”<br/><br/>Fang Wang turned to Chu Yin and asked, “What is your name?”<br/><br/>Chu Yin nervously replied, “My name is Chu Yin…”<br/><br/>“Then I’ll take you as my disciple for now. However, I can’t guide you in cultivation just yet. I’ve only just entered the ocean and need to find an island to establish a place of Cultivation. For now, you will continue to practice with your family. One day, when my name is known across the ocean, you will find me. If you succeed, it means we truly have the fate of master and disciple. How does that sound?” Fang Wang spoke calmly.<br/><br/>Chu Yin was about to speak when Chu Song interrupted him, hastily agreeing.<br/><br/>Fang Wang nodded and turned away.<br/><br/>Chu Song immediately performed a salute, then took Chu Yin and left.<br/><br/>In the time that followed, the Chu Family cultivators flew in one by one, placing the demon cores down and leaving without daring to speak to Fang Wang, or even gathering the courage to look at him.<br/><br/>After about half an hour, Fang Hanyu, Xiao Zi, and Zhao Zhen finally returned to the ship, the deck piled with demon cores and other treasures of flesh and blood, the haul massive..\t\t\t\t\t\t</div>", "images": {}, "success": true}