{"id": 138, "url": "https://www.novelhall.com/i-became-an-immortal-on-mortal-realm-32879/14301719.html", "title": "Chapter 138 - Chapter 138: Chapter 135: The Envoy, The Style Of Eternal Life Pavilion", "volume": 2, "volume_title": "Volume 2", "body": "<h1>Chapter 138 - Chapter 138: Chapter 135: The Envoy, The Style Of Eternal Life Pavilion</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 138: Chapter 135: The Envoy, The Style of Eternal Life Pavilion<br/><br/>Translator: 549690339<br/><br/>The sun shone brightly as a Law Ship sailed alone across the boundless ocean, as tiny as a falling leaf, seemingly on the verge of being swallowed by the vast expanse of water.<br/><br/>Inside the loft, Fang Wang sat facing Xiao Zi on the table and asked, “Have you learned it?”<br/><br/>“The Breathless Natural Technique is a bit difficult, but I’ve memorized it. Just give me some time, young master,” Xiao Zi replied.<br/><br/>Xiao Zi itself possessed a certain method of concealing its aura, but now that they had come to sea, it proved ineffective, so Fang Wang passed on the Breathless Natural Technique taught by Zhou Xue to see if it could mask the True Dragon’s aura.<br/><br/>Truth be told, now whenever Fang Wang looked at Xiao Zi, he couldn’t help feeling that it didn’t resemble a True Dragon at all.<br/><br/>Or is it that the True Dragons are different from what he had imagined?<br/><br/>Fang Wang nodded. There was plenty of time, and it would be fine as long as Xiao Zi practiced earnestly.<br/><br/>“By the way, young master, are you really going to take that kid as your disciple?” Xiao Zi asked curiously.<br/><br/>The Chu Family’s fleet had parted ways with them, heading in different directions.<br/><br/>Chu Yin was going to Canglan Academy to cultivate first. Speaking of which, Fang Wang remembered that Gu Li was at Canglan Academy.<br/><br/>Playing with the Demon Core of the Black Zen King, Fang Wang answered casually, “We’ll see. If he truly is a genius of heaven, taking him under my wing wouldn’t be a problem. If not, the Chu Family will probably drop the idea before they even meet me.”<br/><br/>As for Chu Yin, Fang Wang held a flicker of expectation but not much, mainly because Zhou Xue had never mentioned this name.<br/><br/>Of course, the Mortal Realm’s top powers were numerous, and Zhou Xue’s silence did not necessarily mean Chu Yin wouldn’t achieve great heights.<br/><br/>“If he really is a genius of heaven, even if he’s not as good as you, young master, he’ll be stronger than Xu Qiuming,” Xiao Zi remarked with a sigh.<br/><br/>Because Fang Wang often expressed admiration for Xu Qiuming, Xiao Zi had come to view him as a benchmark for talent.<br/><br/>“Eat the Demon Core outside if you want, and hurry up and get stronger so you can deal with those troubles yourself in the future,” Fang Wang said, not wishing to continue the conversation.<br/><br/>Upon hearing this, Xiao Zi immediately dashed out.<br/><br/>Fang Wang began to probe into the Demon Core of the Black Zen King with his<br/><br/>divine sense, which contained the Primordial Spirit of the demon; he wanted to use some techniques to learn about the Demon Palace.<br/><br/>With the loss of a great king and due to Xiao Zi, Fang Wang estimated that they would inevitably have dealings with the Demon Palace in the future.<br/><br/>Such is the way of the world. Even if Fang Wang wished to hide, troubles would find him, and mere evasion was useless. Only by overcoming each obstacle could one truly follow the righteous path!<br/><br/>Time passed, and since the catastrophe of the Black Zen King, Fang Wang and his company hadn’t encountered any major troubles. They occasionally dealt with sea monsters or pirates, which could be resolved without Fang Wang’s intervention.<br/><br/>A month had gone by.<br/><br/>During this time, they encountered more and more Cultivators—some flying with swords, some sailing on ships, and some who actively communicated with Fang Hanyu. Fang Hanyu did not refuse, using these interactions to learn about the ocean.<br/><br/>This sea area was known as the Southern Celestial Sea, immensely vast. Even for Condensation Spirit Realm Cultivators, it would be difficult to traverse it in a lifetime. It was said that the sea in the central area was so high that it touched the sky—at least that’s how it sounded, mystical and unbelievable, and something Fang Hanyu couldn’t comprehend.<br/><br/>Inside the loft.<br/><br/>The two brothers sat facing each other.<br/><br/>Fang Wang began, “Master’s lair is close by. After that, are you going to accompany me in traveling the ocean, or will you head straight to that Sword Cultivator sea area?”<br/><br/>Fang Hanyu thought for a moment and said, “Let’s just split up. Though it’s reassuring to follow you, it’s too easy to become lax. I don’t want to develop that kind of mindset.”<br/><br/>Fang Wang smiled and didn’t try to persuade him further.<br/><br/>Fang Hanyu asked, “Do you want to find an island to settle down? The islands here in the sea have a strong Cultivation atmosphere. You’re not short of Spirit Stones; you could surely find an excellent cave abode. That way, you can also avoid the Demon Palace from finding you.”<br/><br/>The Black Zen King’s Demon Core had already been swallowed by Xiao Zi. Fang Wang learned about the strength of the Demon Palace, which was definitely within the top three forces of demons in the Southern Celestial Sea. Each of the seventy-two great kings commanded a million Demon Soldiers, and above them all was the Demon Emperor.<br/><br/>“We’ll see,” Fang Wang said with a soft laugh, intending to find an island to enter deep seclusion.<br/><br/>He now had a jumbled collection of supreme methodologies, and he wanted to try fusing them. The Three Great True Cultivations could be merged, and so could the Nine Dragons Divine Transformation Art and the Mountain River Town Heaven Fist.<br/><br/>To strike with a fist and summon a dragon—that would truly be majestic!<br/><br/>Though powerfully satisfying, Mountain River Town Heaven Fist’s brute fighting style felt somewhat unbecoming for a high-level Cultivator, and it seemed somewhat inconsistent with the grace of Cultivation.<br/><br/>Fang Hanyu didn’t say much more, continuing with the information he gathered through his interactions that day.<br/><br/>On the deck, Xiao Zi coiled up, occasionally flicking its tongue out as if it were resting, but in reality, it was cultivating the Breathless Natural Technique.<br/><br/>Time continued to flow.<br/><br/>Following the guidance of the Yellow Glyph Sword Sovereign Order, five days later they sailed into a cluster of islands. There were hundreds of islands with countless Cultivators and numerous ports.<br/><br/>Once ashore, Fang Hanyu immediately stowed away the Law Ship into his storage bag.<br/><br/>They progressed until they finally found Sword Saint’s lair atop a high mountain. With the Yellow Glyph Sword Sovereign Order, Fang Wang opened the cave’s entrance without effort.<br/><br/>The cave was vast, spanning over a thousand square meters, filled with various plants, pulsing with Spiritual Energy, forming a natural ecosystem all its own.<br/><br/>“You pick whatever you want; I’ll take the rest,” Fang Wang said directly, not even bothering to check.<br/><br/>Fang Hanyu wasn’t bashful and began selecting immediately, while Xiao Zi and Zhao Zhen also went to look around excitedly.<br/><br/>Meanwhile, Fang Wang stepped out of the cave entrance, standing at the edge of the cliff to appreciate the view of the islands.<br/><br/>Countless flying creatures circled in the sky above, with pavilions situated on various islands, forming towns, marketplaces, and even cities. As far as the eye could see, figures of Cultivators were coming and going in all directions.<br/><br/>The bustling Zhui Tian City of Grand Wei was nowhere near as prosperous as this place, not to mention Grand Qi.<br/><br/>Putting aside the level of prosperity, the scenery alone was beautiful, making Fang Wang feel refreshed and even more looking forward to the years of maritime Cultivation that lay ahead.<br/><br/>After a while,<br/><br/>a Cultivator arrived flying on a gourd. This was a man in grey attire, wearing a scholar’s hat, with two swords strapped to his back. He landed beside Fang Wang, glanced at the cave dwelling, and then cautiously approached Fang Wang to perform a ceremonial greeting.<br/><br/>“May I ask what your relationship is with Sword Saint?” the man in grey inquired.<br/><br/>Fang Wang shot him a glance and said, “I am a disciple of Sword Saint.”<br/><br/>Although he was not sure of the man’s origins, Fang Wang was not afraid he might cause trouble. Surely his enemies wouldn’t have been lying in wait here for decades, right?<br/><br/>Upon hearing this, the man in grey continued, “My name is Qu Xunhun, a personal envoy of Sword Sovereign of the Yellow Glyph. It’s been many years since Sword Saint left, may I inquire about his current well-being?”<br/><br/>Fang Wang raised an eyebrow, turned to look at Qu Xunhun who raised his right hand and produced the Yellow Glyph Sword Sovereign Order.<br/><br/>Qu Xunhun’s face changed drastically. He immediately knelt down, touching his forehead to the ground, and said, “Qu Xunhun pays his respects to the Yellow Glyph Sword Sovereign!”<br/><br/>Fang Wang said, “Stand up. My teacher has already passed on, and he entrusted the Yellow Glyph Sword Sovereign Order to me.”<br/><br/>Envoys of the Eternal Life Pavilion fall into two categories: those who serve only the pavilion itself and those who serve the twenty-four True Persons and seventy-two Sovereigns of Arms. A True Person can have four personal envoys to aid them, while a Sovereign of Arms can only have one. The lowest cultivation level of a personal envoy is the Cross -Void Realm.<br/><br/>“In the future, Sword Lord, you may command me as you wish,” Qu Xunhun said as he got to his feet, not asking further about Sword Saint.<br/><br/>Eternal Life Pavilion respects the token, not the person!<br/><br/>Fang Wang felt contemplative in his heart. He had thought Qu Xunhun was loyal to Sword Saint until he showed his identity, but after hearing that the Yellow Glyph Sword Sovereign Order had a new owner, Qu Xunhun no longer brought up Sword Saint.<br/><br/>Is this the style of the Eternal Life Pavilion?<br/><br/>Indeed, I like it!<br/><br/>Fang Wang was also not shy about it and said, “I want to find an island suitable for cultivation here, preferably far from the influence of the Demon Palace. Do you have any advice?”<br/><br/>Qu Xunhun solemnly replied, “Although there are many undiscovered regions in the Southern Celestial Sea, those places are too dangerous, often accompanied by natural disasters and demon calamities. Sword Lord can completely purchase an island suitable for setting up a cultivation ground, away from the Demon Palace. This is something I can manage.”<br/><br/>Fang Wang thought for a moment and asked, “What is the price for an island?”<br/><br/>“The cheapest would be ten million Superior Spirit Stones, but since you are the Sword Sovereign of the Yellow Glyph, I can negotiate on your behalf, and we might reduce the price by at least half. With some luck, we might even get an island for free, though that would involve calling in favors…” Qu Xunhun pondered.<br/><br/>Ten million Superior Spirit Stones!<br/><br/>Oh, boy!<br/><br/>Taiyuan Gate Direct Disciples receive only ten Superior Spirit Stones a month. Without carrying out any missions, would it take eighty-three thousand years for a Direct Disciple to barely afford an island?<br/><br/>Fang Wang merely marveled at the gap between land and sea; he wasn’t short on Spirit Stones. His spoils of war were plentiful, and because they involved various treasures, Heavenly Materials and Earthly Treasures, he couldn’t assess their worth, but ten million Superior Spirit Stones were a trifle to him.<br/><br/>“You weigh it out. I’m not lacking in Spirit Stones. I’m curious to see how you handle this,” Fang Wang said with a light chuckle.<br/><br/>“Fine, in no more than a month, I shall select a suitable island for you,” Qu Xunhun replied, and then with a bow, he took his leave.<br/><br/>Fang Wang watched him depart, and after a good while, he went back into his cave dwelling and shut the mountain gates.<br/><br/>He was preparing to cultivate in his dwelling while waiting for Qu Xunhun’s return.<br/><br/>A month went by quickly.<br/><br/>Qu Xunhun arrived on time, impeccable in his timing.<br/><br/>The mountain gates opened, and Qu Xunhun walked into the cave dwelling, with Fang Wang inviting him to take a seat.<br/><br/>Qu Xunhun reached the table but did not sit down. Instead, he raised his hand and took out three Jade Slips, laying them on the table, and said softly, “These are three islands I’ve selected for you. They all belong to the sphere of influence of righteous sects, who take it upon themselves to slay demons and exorcise evil. Should the Demon Palace attack, they could protect you. The prices are….”\t\t\t\t\t\t</div>", "images": {}, "success": true}