{"id": 131, "url": "https://www.novelhall.com/i-became-an-immortal-on-mortal-realm-32879/14300412.html", "title": "Chapter 131 - Chapter 131: Chapter 128: Insane, The World’S Number One", "volume": 2, "volume_title": "Volume 2", "body": "<h1>Chapter 131 - Chapter 131: Chapter 128: Insane, The World’S Number One</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 131: Chapter 128: Insane, The World’s Number One<br/><br/>Madman<br/><br/>Translator: 549690339<br/><br/>Hearing Xu Qiuming’s words, the carefree immortal couldn’t help but let out a sneer. He opened his eyes, looked at Xu Oäuming, and asked, “What realm is that Fang Wang?”<br/><br/>Unfazed, Xu Qiuming replied, “Condensation Spirit Realm, but his strength cannot be measured by his realm alone.”<br/><br/>“I heard they say you also have the combat prowess that transcends realms. Do you know why you were defeated by my hand?” the carefree immortal asked contemptuously.<br/><br/>Xu Qiuming frowned.<br/><br/>The carefree immortal revealed a defiant and fierce smile, saying, “Since you are to be sacrificial offerings, I shall let you gain some insight. Above the Condensation Spirit Realm is the Cross-Void Realm, and above that is the<br/><br/>Golden Body Realm. As for me, I am not just a novice in the Golden Body Realm; I have reached the fourth layer of the Golden Body Realm. And though my Lifespirit Treasure is not a Heaven Yuan Spirit Treasure, it is indeed an exceptional Earth Origin Spirit Treasure. Do you think Fang Wang can overcome two grand realm levels to kill me?”<br/><br/>Upon hearing this, both Xu Qiuming and the Seven Dynasties Emperor’s complexions drastically changed.<br/><br/>Even Xu Qiuming, who had full confidence in Fang Wang, and Zhao Qi felt a sense of despair at this moment.<br/><br/>Raising his arms, the carefree immortal looked at the eighty-one flags in the sky and laughed maniacally, “Not only that, but I have also set up the Kun Long Huan Tian Formation. The moment Fang Wang steps into the formation, he will be unable to escape, even with wings. Now, I’m quite curious to see whether Fang Wang is willing to relinquish his so-called righteous valor.” A silence fell upon the cliff-side, and no one responded.<br/><br/>The words “Golden Body Realm” echoed in everyone’s minds like thunder from the ninth heaven, leaving them dazed and not fully comprehending the carefree immortal’s subsequent words.<br/><br/>In the north, on a continuous stretch of ice mountains, five thousand cultivators of the Great Abyss Gate swept through like a blistering wind.<br/><br/>As they reached this region, the sky gradually darkened.<br/><br/>Chai Yi looked back at Fang Wang and said, “Fang Wang, Apex Mountain is less than five hundred miles from us now.”<br/><br/>All eyes turned expectantly to Fang Wang.<br/><br/>Fang Wang patted Fang Hanyu by his side and then leapt up, standing on his Flying Sword, soaring to the front of the group.<br/><br/>Without any words, he accelerated towards the horizon, disappearing into the blizzard in the blink of an eye.<br/><br/>“Do you think our Master Fang Wang can win?”<br/><br/>“What are you talking about? Of course, he can win. Maybe by the time we get there, the carefree immortal’s head will already have been severed.” “So calm. That’s the spirit of the number one person of the seven dynasties.”<br/><br/>“Carefree immortal? More like the carefree old demon! ”<br/><br/>The Tai Yuan Sect Disciples discussed animatedly. While the elders remained silent, their eyes also betrayed their anticipation.<br/><br/>Meanwhile.<br/><br/>Fang Wang raced through the cold wind, the wind and snow tossing his black hair. Xiao Zi emerged from his embrace, climbing onto his shoulder and looking forward with him.<br/><br/>“Master, how many moves will you need to defeat the enemy?” Xiao Zi asked excitedly, clearly not taking the carefree immortal seriously.<br/><br/>In its view, the carefree immortal had not shown great strength, and as for defeating Xu Qiuming, could Xu Qiuming compare to its master?<br/><br/>Fang Wang’s face was indifferent as he coolly said, “Let’s use our full strength.”<br/><br/>He stimulated his Combat Heart to increase speed, and he could acutely sense the presence of the formation.<br/><br/>Because Zhou Xue had revealed the existence of the Kun Long Huan Tian Formation in advance, Fang Wang dared not be negligent and immediately used the True Combat Technique to sense the presence of the Kun Long Huan Tian Formation.<br/><br/>Indeed, there it was!<br/><br/>Right up ahead, it was of an immense range, and even contained a pulse of Heavenly Might that made one’s heart palpitate.<br/><br/>He related it to Heavenly Might because it reminded Fang Wang of the heavenly thunder during a tribulation; the two pressures felt very similar.<br/><br/>Speeding all the way.<br/><br/>As he approached the range of the Kun Long Huan Tian Formation, Fang Wang took out The Six Harmonies and Eight Desolations Seal and flung it with his hand. The seal flew into the air, quickly disappearing into the darkness above.<br/><br/>Xiao Zi blinked but did not inquire further, as it realized the enemy might be right ahead and it was imperative not to expose their master’s intentions.<br/><br/>Fang Wang slowly spoke, “Help me deliver a message.”<br/><br/>Upon hearing this, Xiao Zi immediately raised its serpent head:<br/><br/>“Carefree old demon! My master, Grand Qi Sword Saint, Sect Leader of the Great Abyss Gate Fang Wang, is coming. You evil fiend, prepare to meet your end!”<br/><br/>Although Xiao Zi’s voice was feminine, it echoed under the Gloomy Firmament with the help of demonic power, carrying it far away, even shaking the ice mountains slightly and causing avalanches.<br/><br/>As the sound carried, the cultivators lurking from various sects were jolted awake.<br/><br/>At the location of the Vast Qi Sect.<br/><br/>Xu Guang jumped to his feet, agitated, saying, “Fang Wang has arrived!”<br/><br/>The next second, realizing his lack of composure, he quickly silenced himself and glanced at the others, only to see that they too had stood up, becoming tense.<br/><br/>Fang Wang’s name, after the conclusion of the Zhui Tian Secret Realm event, had become extremely well known.<br/><br/>Many cultivators believed that Xiao Chen, Liang Xunqiu, and Lanxin Xianzi had perished at the hands of Fang Wang. As such, Fang Wang’s deterrence power was immense. Furthermore, the news of Cliff Daoist having approached Fang Wang only to be rebuffed with failure, added a touch of terror to Fang Wang’s reputation.<br/><br/>Yang Jiner got excited, clenched her fist, and said, “Let’s go watch the drama unfold!”<br/><br/>Cliff Daoist said in a low voice, “We mustn’t, it’s too dangerous!”<br/><br/>As his voice fell, Yang Jiner jumped onto the back of a white tiger, and with a roar, the tiger leapt into the air, breaking through the formation, its paws treading on the wind, hurtling towards Apex Mountain.<br/><br/>The cultivators from the other sects also stood up, and some who considered their cultivation deep and profound could not help but go to watch the battle. Regardless, Fang Wang represented the righteous path. As long as he could hold off the carefree immortal, these spectators would not be in any great danger.<br/><br/>Atop the sheer cliff.<br/><br/>The carefree immortal abruptly opened his eyes, quickly standing up, and with a flourish of his arms, the eighty-one flags above his head swiftly ascended, disappearing into the darkness above.<br/><br/>After doing all this, he then revealed a cold smile.<br/><br/>Xu Qiuming furrowed his brows tightly, wanting to warn Fang Wang, but his Spiritual Power had been drained, and his voice could not carry far.<br/><br/>The Seven Dynasties Emperor, aware of what the carefree immortal was doing, cursed loudly.<br/><br/>“Old devil! You won’t die a good death!”<br/><br/>“Fang Wang! Be careful, he’s forming a formation!”<br/><br/>“Man acts, Heaven watches; old devil, today you will undoubtedly die!”<br/><br/>“You bastard, I’ll fuck your mother!”<br/><br/>The carefree immortal ignored their curses. He soared into the air, his robes fluttering, his face revealing a maniacal smile.<br/><br/>“Fang Wang! Come on! Let this immortal see how impressive the Heaven Yuan Spirit Treasure really is!”<br/><br/>The carefree immortal laughed unrestrainedly, his voice louder than Xiao Zits, allowing the people of the Great Abyss Gate hundreds of miles away to hear him quickly.<br/><br/>Hearing the carefree immortal’s words, Zhao Chuanqian immediately urged the formation to speed up.<br/><br/>Xu Qiuming shakily rose to his feet and turned to look into the distance, his eyes filled with anticipation.<br/><br/>At this point, he could only believe in Fang Wang.<br/><br/>“Fang Wang, you are the only peer I have ever admired in my life. You must win… I won’t allow you to lose…”<br/><br/>Xu Qiuming thought fiercely, resolving that if Fang Wang were defeated, he would take his own life instantly, denying the carefree immortal the opportunity to sacrifice him.<br/><br/>All of a sudden, he saw a golden light appear in the darkness of the distance, growing ever brighter, causing his pupils to slowly dilate.<br/><br/>Fang Wang had arrived!<br/><br/>Standing on a flying sword, Fang Wang conjured a Golden Scale White Feather Robe, with strands of golden dragon essence swirling around him, making him the most dazzling presence in the gloomy firmament.<br/><br/>Xiao Zi rapidly grew larger and settled under Fang Wang’s feet, while Fang Wang’s flying sword flew into the Dragon Jade Ring.<br/><br/>Standing on the dragon-like purple snake and arrayed in his Golden Scale White Feather Robe, Fang Wang’s presence was now fully revealed, looking down on all creation!<br/><br/>Fang Wang did not take out his Lifespirit Treasure. Two strands of hair, resembling dragon whiskers, fluttered in front of his forehead, revealing his handsome young face, his eyes sharp and cold, shining with cold light even under the cover of night.<br/><br/>That was the symbol of the True Combat Technique!<br/><br/>Xiao Zi soared into the air, elevating Fang Wang to look down from high above at the carefree immortal atop the cliff.<br/><br/>The distance between the two closed rapidly, and soon they were within two hundred zhang. Xiao Zi then came to a halt.<br/><br/>Fanc Wang looked down at the carefree immortal. saving. “Is it vou who<br/><br/>wishes to challenge me?”<br/><br/>The tone was indifferent but carried an extremely arrogant aura.<br/><br/>Looking at Fang Wang, the spirits of the Seven Dynasties Emperor were lifted, and despite knowing that the carefree immortal was a Golden Body Realm being, he couldn’t help but hope for Fang Wang.<br/><br/>Some people, just by their presence, can give others peace of mind.<br/><br/>Fang Wang had reached such a stature!<br/><br/>He made the Seven Dynasties Emperor facing sure peril forget despair. “Challenge? This immortal wants to devour you!”<br/><br/>The carefree immortal showed a ferocious grin, his visage exceedingly fierce.<br/><br/>“Elder Fang Wang, he is above the Cross-Void Realm, in the Golden Body<br/><br/>Realm, and moreover, at the fourth layer! ” Zhao Qi quickly shouted a warning.<br/><br/>A shadow emerged from the Soul Devouring Gourd at Xiao Zi’s back, and it was Zhao Zhen, who flew off and looked towards Zhao Qi.<br/><br/>Seeing him, Zhao Qi’s face changed dramatically, his eyes filled with both hatred and fear.<br/><br/>Fang Wang remained expressionless, coldly saying, “Golden Body Realm<br/><br/>Fourth Layer, is that strong?”<br/><br/>As these words fell, everyone was taken aback, even the carefree immortal’s face turned unnatural.<br/><br/>Fang Wang raised his right hand, slowly clenching it into a fist.<br/><br/>Instantly, a terrifyingly supreme aura burst forth, pressing down on endless mountains of ice. Centered on him, ice mountains in all directions began to violently tremble, with those closer to him shuddering even more violently.<br/><br/>Some of the sharp, straight icebergs even collapsed, turning into countless chunks of ice and kicking up swathes of snow mist.<br/><br/>The cultivators who had rushed from all directions were terrified, stopping in their tracks, their faces showing fear. “What kind of aura is this?”<br/><br/>“Is it Fang Wang, or the carefree immortal?”<br/><br/>“Not sure…”<br/><br/>“So terrifying, my cultivation at the second layer of the Condensation Spirit Realm is utterly suppressed, my Spiritual Power has stalled, unable to be mobilized… ”<br/><br/>Yang Jiner also stopped, her beautiful eyes wide, her mouth slightly agape.<br/><br/>She thought to herself in shock, “This kind of aura… Perhaps even the old ones in my clan cannot achieve it… It’s Fang Wang’s aura! He has grown so powerful…”<br/><br/>The swiftly advancing cultivators from the Great Abyss Gate also felt Fang Wang’s aura.<br/><br/>They knew it too well!<br/><br/>When Fang Wang had previously cornered Yadaoren and Xu Guang, he had displayed such a presence, but now the oppression far exceeded that time.<br/><br/>Fang Hanyu also felt moved; as Fang Wang’s closest brother, even he did not know Fang Wang had grown so strong…<br/><br/>Meanwhile.<br/><br/>The carefree immortal faced the greatest pressure; at this moment, his smile had grown forced, and he stared intently at Fang Wang, asking coldly, “What ultimate technique is this?”<br/><br/>At that time, Fang Wang was not only gathering the Mountain River Town Heaven Fist but also activating the Heavenly Body. White flames swirled around him, reflecting off the golden dragon essence, making him seem like a divine god from the heavens descending.<br/><br/>With an indifferent expression, he looked down at the carefree immortal, “This is the unique ultimate technique of my master, the Descending Dragon Great Saint, the Mountain River Town Heaven Fist. If you can withstand this punch of mine, I will allow you to kneel and beg for mercy.”<br/><br/>Xu Qiuming and the Seven Dynasties Emperor had thought the carefree immortal was the epitome of arrogance, but upon hearing Fang Wang’s words, they truly understood what it meant to be brash.<br/><br/>Fang Wang’s brashness wasn’t mockery, it was absolute confidence in his own strength!\t\t\t\t\t\t</div>", "images": {}, "success": true}