{"id": 136, "url": "https://www.novelhall.com/i-became-an-immortal-on-mortal-realm-32879/14301471.html", "title": "Chapter 136 - Chapter 136: Chapter 133 The Talent Of The Heavenly Origin, Demon Palace Great King", "volume": 2, "volume_title": "Volume 2", "body": "<h1>Chapter 136 - Chapter 136: Chapter 133 The Talent Of The Heavenly Origin, Demon Palace Great King</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 136: Chapter 133 The Talent of the Heavenly Origin, Demon Palace Great King<br/><br/>Translator: 549690339<br/><br/>Late at night, the sea ebbed and flowed. The Law Ship had special prohibitions that prevented the people on board from feeling the slightest bump.<br/><br/>Fang Wang did not stay in the attic; instead, he sat on the deck, cultivating through Qi Gathering.<br/><br/>The Spiritual Energy of the sea was indeed richer than that of the land. Even the opening of the Dragon Vein by Grand Qi could not compare, no wonder so many cultivators headed southward.<br/><br/>However, the sea was also more dangerous. Gu Li had mentioned in her letter that even with many people and great strength, there would be casualties when they went out to sea.<br/><br/>Fang Wang grew more eager to establish a Daoist place of practice on the sea.<br/><br/>Monopolizing an island rich in Spiritual Energy, devoted to Cultivation, and occasionally taking disciples, also seemed rather interesting.<br/><br/>Boom!<br/><br/>The distant sea surface suddenly exploded as a mysterious big fish leaped out, then dove into the water and disappeared without a trace.<br/><br/>The waves were uncertain, and a dense fog slowly appeared in the distance, making the night even more terrifying.<br/><br/>Fang Wang recognized at a glance that the mist was a fog of Demonic Qi.<br/><br/>A great battle was getting closer and closer!<br/><br/>Fang Hanyu came over and said, “I scanned around with my divine sense, and just the number of monsters I’ve detected has already exceeded one hundred thousand. How many did you see?”<br/><br/>Fang Wang spat out a number, “Three hundred thousand.”<br/><br/>Upon hearing this, Fang Hanyu’s eyelids twitched violently.<br/><br/>So many monsters…<br/><br/>And they showed no signs of attacking, clearly waiting for something.<br/><br/>“If we keep waiting, by the time you go to kill the Demon King, we won’t be able to defend ourselves…” Fang Hanyu expressed his worries.<br/><br/>Fang Wang looked into the distance and said, “Don’t worry, I will protect you all with the Treasured Spirit.”<br/><br/>Upon hearing this, Fang Hanyu immediately felt assured.<br/><br/>Behind them, Xiao Zi and Zhao Zhen also breathed a sigh of relief; this was their greatest concern.<br/><br/>Suddenly, Fang Wang looked in one direction and whispered, “There’s someone.”<br/><br/>Fang Hanyu turned his head to look, only to see a light appearing at the end of the sea, flickering in and out of sight. There, the fog of Demonic Qi churned, and the seawaters raged, as if a battle was taking place.<br/><br/>“Bring them over, after all, they are suffering because of us. Don’t mention Xiao Zits matter,” Fang Wang instructed.<br/><br/>Fang Hanyu, now at the Profound Heart Realm, immediately leaped up and transformed into a white rainbow, speeding away.<br/><br/>Fang Wang watched intently, ready to defend Fang Hanyu against any powerful monsters that might attack him.<br/><br/>Soon, a battle erupted, and growls from afar resonated across the sea under the cover of night, adding to the dread.<br/><br/>A stick of incense later, a fleet of ships approached, totaling nine, with the largest being five times the size of the Law Ship beneath Fang Wang’s feet.<br/><br/>Fang Hanyu returned to the ship and reported, “I told them to follow us.”<br/><br/>Fang Wang nodded slightly, his divine sense picking up that among that fleet, there were three Condensation Spirit Realm cultivators, and the rest varied in cultivation levels. Surprisingly, there were also mortals, numbering over two hundred in total.<br/><br/>This kind of team was enough to sail the sea; it was only their bad luck that they encountered Fang Wang and others, incurring misfortune.<br/><br/>While Fang Wang had killed many people, he did not enjoy involving innocent bystanders without reason.<br/><br/>“Continue onward. I estimate that the great battle will erupt by tomorrow.”<br/><br/>After dropping these words, Fang Wang turned and returned to the center of the deck to meditate.<br/><br/>Meanwhile, on the largest ship in the rear.<br/><br/>Inside the grand hall, a dozen people were gathered.<br/><br/>The leader was a middle-aged man with a full beard. He was dressed in black robes, his face grim as he said in a deep voice, “We’ve really fallen on hard times to encounter such a tide of demons. I’ve passed through this sea area hundreds of times, and this is the first time I’ve encountered such a situation.<br/><br/>Now, we can only pray that the powerful person behind that man is strong<br/><br/>enough.”<br/><br/>The expressions on the other people’s faces were not good either.<br/><br/>A young man in blue anxiously asked, “Father, can we really survive this catastrophe?”<br/><br/>The bearded man answered, “On our journey here, we’ve encountered attacks from monsters multiple times. But upon reaching this place, those monsters don’t dare to come close. This indicates that the cultivator named Zhuge Liang didn’t boast without merit; his ship has a Great Cultivator on board.”<br/><br/>He looked around at everyone and said, “During this period, keep everyone on high alert. Additionally, send some refreshments and wine that can restore Spiritual Power to Zhuge Liang and his group. No matter what, they’ve shown us kindness.”<br/><br/>Upon hearing this, everyone promptly agreed.<br/><br/>The bearded man waved his hand, and the people started to leave one after another, soon leaving only him and his son in the grand hall.<br/><br/>“Father, I’ve already told you, I don’t want to practice Cultivation… and yet you insist on sending me to Canglan Academy…” the young man in blue said with a downcast expression.<br/><br/>The bearded man glared at him and said sternly, “Yin’er, the old ancestor in our family has deduced that you possess innate talent. How can you not cultivate? And even if your father agreed, the Chu Family would not.”<br/><br/>Chu Yin clenched his teeth and said, “I don’t want to cultivate. What’s so good about Cultivation? Mother hated it the most; she often said that if only you were a mortal, our family could stay together for a lifetime…”<br/><br/>The bearded man, named Chu Song, listened to his son’s words with a displeased look on his face.<br/><br/>Chu Song had many sons, and Chu Yin was merely the offspring from one of his visits ashore; their relationship was not that deep. Had it not been for the family valuing Chu Yin, would he have spoken so softly and comfortingly? Looking at his cowardly and anxious son, Chu Song felt nothing but jealousy.<br/><br/>Why should this brat possess innate talent?<br/><br/>The more Chu Song looked at his son, the more he felt he did not resemble him, but the ancestor’s deductions could not be wrong.<br/><br/>“Go and rest,” Chu Song said, his tone somewhat heavy.<br/><br/>Chu Yin hesitated to speak and eventually left with his head drooping, even forgetting to bow.<br/><br/>Chu Song watched his retreating figure and shook his head. Listening to the roars of beasts coming in waves from outside the window, he began to worry again.<br/><br/>He wondered if they could safely get through this calamity.<br/><br/>As the sun rose, its light skimmed across the sea surface, revealing the silhouettes of monster beasts on the water, with fish and beasts of all kinds, surrounded by Demonic Qi, which made their figures appear as if hidden in a mist.<br/><br/>All the monster beasts were heading in the same direction.<br/><br/>Looking up, thousands of monster birds were circling in the sky, occasionally letting out shrill cries, creating an overwhelmingly oppressive atmosphere.<br/><br/>Chu Song flew next to Fang Wang and the others aboard their Law Ship on his sword. His gaze was drawn to Zhao Zhen, but after a brief glance, he cupped his hands towards Fang Hanyu, who was meditating on the deck, and said, “Brother Zhuge, with so many monster beasts, what do you think, should we discuss a combat strategy?”<br/><br/>Fang Hanyu glanced at Fang Wang next to him, saw his unmoving stance, then slanted his gaze towards Chu Song and said, “Just stay calm on the ship and do nothing. That’s the best strategy. We will lead you through the siege.”<br/><br/>Upon hearing this, Chu Song frowned and couldn’t help but look towards Fang Wang. He couldn’t see through Fang Wang and was curious about the level of his cultivation.<br/><br/>When he returned to his own ship, a group of Chu Family Cultivators immediately surrounded him, inquiring about the situation. Chu Song relayed<br/><br/>Fang Hanyu’s words exactly, leaving everyone looking at each other in dismay.<br/><br/>“Could they be planning to use us as bait?” a woman cautiously asked.<br/><br/>Chu Song’s eyes flickered as he said, “Let’s wait and see. It shouldn’t be the case. If so, they wouldn’t have helped us last night and would have just taken the opportunity to flee. But, we still need to remain vigilant.”<br/><br/>Everyone felt there was some sense in that, and their unease was slightly relieved.<br/><br/>Time continued to pass.<br/><br/>The sun was hanging high in the sky but was obscured by the Demonic Qi, making the ocean dark and oppressive.<br/><br/>As it neared noon,<br/><br/>Fang Wang suddenly opened his eyes and softly said, “They’re coming!” Boom!<br/><br/>An earth-shattering sound came from the end of the sea horizon, as if some enormous creature had suddenly surged out of the water.<br/><br/>Fang Hanyu, Xiao Zi, and Zhao Zhen focused their eyes to see two Jiao dragons appearing behind countless monster beasts, pulling a palanquin made of white jade soaring into the sky.<br/><br/>Those two Jiao dragons were at least thirty feet long, with double claws and no dragon horns but long hair on their tails, roaring wildly in the sky with echoes that never ceased.<br/><br/>The Chu Family fleet behind was also stirred, and Cultivators immediately took to the air to look. When they saw the two Jiao dragons, they were all frightened.<br/><br/>“What is that?”<br/><br/>“Not good, could it be the forces of the Demon Palace from the seabed?”<br/><br/>“The Demon Palace? The legendary demon race force that exists under the sea?<br/><br/>Impossible, isn’t that just a myth?”<br/><br/>“To command so many creatures, it’s certainly not something an ordinary Demon King can do, and the use of Jiao dragons as carriers does seem to match the legend of the Demon Palace Great King.”<br/><br/>“What’s going on? We’re not harboring any treasure, are we? Is there any need for such a grand mobilization?”<br/><br/>The Chu Family Cultivators were anxious and fearful, as they already felt an overwhelmingly powerful Demonic Qi hiding in that white jade palanquin.<br/><br/>Chu Song’s complexion was extremely grim, and even Chu Yin on the ship was shivering.<br/><br/>The two Jiao dragons in the sky looped around several times before slowly coming to a stop, facing the direction of Fang Wang and the others.<br/><br/>The white jade palanquin slowly rose higher, with the Jiao dragons unable to obscure it. The curtain was lifted, and a demonic-looking man with horns on his head stepped out. He was clad in silver chain mail and a black cape, with eerily pale skin, and his handsome features seemed fierce and terrifying due to the Demonic Qi between his brows.<br/><br/>“I did not expect to find True Dragon Qi here.”<br/><br/>The demonic man muttered to himself, and as he spoke, he licked his lips, revealing a greedy expression.<br/><br/>He leapt up and strode through the air towards Fang Wang’s Law Ship.<br/><br/>Fang Wang didn’t say a word and also flew up to meet him in the air.<br/><br/>All of the Chu Family could see him, including Chu Yin who stayed on the ship.<br/><br/>Fang Wang was dressed in black clothes, his long hair casually tied at the back of his head, with a Treasured Sword at his waist. Just looking at his silhouette gave off the impression of an extraordinary Sword Cultivator.<br/><br/>For some reason, the moment Fang Wang appeared, the pressure on the Chu Family Cultivators decreased sharply, and the overwhelming demonic power that enveloped them was mostly nullified.<br/><br/>Chu Yin’s heartbeat quickened as he looked at Fang Wang’s silhouette.<br/><br/>He had always been resentful of cultivation because his mother had died at the hands of a Cultivator. Coupled with his resistance to the Chu Family, he felt that Cultivators were not good people.<br/><br/>But for some reason, the silhouette of Fang Wang brought about an expectation in his heart for the first time.<br/><br/>He hoped that Fang Wang would win and that he himself could become someone like Fang Wang.<br/><br/>Surrounded by monsters on all sides, even the sky filled with countless monster birds circling, such a desperate situation, yet that man dared to stand out alone!<br/><br/>Chu Yin stared blankly at the silhouette of Fang Wang.<br/><br/>The demonic man didn’t stop his steps. As he walked towards Fang Wang, he raised his hand, and a large knife surrounded by Demonic Qi appeared in his hand, the blade glinting with a cold light.<br/><br/>“Human Cultivator, do you wish to defy this king?”<br/><br/>The demonic man slightly lifted his chin, looking down on Fang Wang with disdain.<br/><br/>Fang Wang raised his left hand, gathering the Six Harmonies and Eight<br/><br/>Desolations Seal, and looked emotionlessly at the demonic man, saying, “Reptile, are you seeking death?”\t\t\t\t\t\t</div>", "images": {}, "success": true}