{"id": 139, "url": "https://www.novelhall.com/i-became-an-immortal-on-mortal-realm-32879/14301720.html", "title": "Chapter 139 - Chapter 139: Chapter 136: Heavenly Sect And Biyou Island,", "volume": 2, "volume_title": "Volume 2", "body": "<h1>Chapter 139 - Chapter 139: Chapter 136: Heavenly Sect And Biyou Island,</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 139: Chapter 136: Heavenly Sect and Biyou Island,<br/><br/>Breakthrough in Cultivation [Third Release, Requesting Monthly Tickets]<br/><br/>Translator: 549690339<br/><br/>The prices for the three sea islands offered by Qu Xunhun varied greatly, with the most expensive requiring hundreds of millions of Superior Spirit Stones, while the cheapest still cost forty million. In addition to the size of the sea islands, it also relates to the strength of the powers that govern them.<br/><br/>Fang Wang had originally wanted to find sea islands not ruled by any power, but after hearing from Qu Xunhun, he felt that having the protection of a power was a good thing, especially since he was the Sword Sovereign of the Yellow Glyph from the Eternal Life Pavilion, and no faction would dare to confront him openly.<br/><br/>There are countless cultivation powers in the Southern Celestial Sea, but the only one that can truly be called the overlord is the Eternal Life Pavilion!<br/><br/>Fang Wang took out two storage bags and asked Qu Xunhun to help him sell them, to which Qu Xunhun agreed.<br/><br/>After he had left, Fang Wang began to read the content of the Jade Slip with his divine consciousness. Through the Jade Slip, he could observe the outline and size of the sea islands.<br/><br/>Several days later, Qu Xunhun returned, holding only one storage bag. Fang Wang checked it and found it was full of Superior Spirit Stones.<br/><br/>“I’ll choose Biyou Island.”<br/><br/>Fang Wang said to Qu Xunhun. During this time, he had gathered all the treasures from the cave dwelling into the Dragon Jade Ring. Fang Hanyu had taken away less than a fifth of them, and he was planning to plant those Heavenly Materials and Earthly Treasures on Biyou Island.<br/><br/>Qu Xunhun nodded and asked, “Shall we set out now?”<br/><br/>Fang Wang nodded, stood up, and Xiao Zi hopped onto his shoulder.<br/><br/>As both of them walked out of the cave dwelling and accompanied by the closing of the mountain gate, the dwelling would become an ownerless abode.<br/><br/>Qu Xunhun took out his gourd and let Fang Wang sit behind him.<br/><br/>The gourd sped away quickly, leaving the archipelago behind.<br/><br/>On their way, Qu Xunhun started to introduce Biyou Island.<br/><br/>Biyou Island is located within the maritime domain controlled by the Heavenly Sect, a sect established over five thousand years ago, one of the major righteous factions. It boasts over a million disciples and more than one hundred islands under its control, among which Biyou Island is one of the highest-tier islands.<br/><br/>Although the Heavenly Sect is not a subsidiary of the Eternal Life Pavilion, they have always had good relations. They welcomed Fang Wang’s arrival with open arms.<br/><br/>To take over Biyou Island, Fang Wang had to pay one hundred and twenty million Superior Spirit Stones. This was not the original price; the Heavenly Sect had shown goodwill. If Fang Wang had further needs, he could negotiate with the Heavenly Sect, who were willing to establish a deeper relationship with him.<br/><br/>Even though the Heavenly Sect had given a discount, Fang Wang didn’t owe them anything, which pleased him greatly.<br/><br/>“On the sea, do the major factions wage wars over maritime domains?” Fang Wang asked curiously.<br/><br/>Qu Xunhun answered, “Of course, Spirit Vein islands are coveted by all factions. You needn’t worry. At sea, there are rules. Islands sold by a sect won’t be forcibly reclaimed. If such a thing happened, they would be despised and even attacked by everyone. The Heavenly Sect is known as a formidable faction. With their protection, you won’t be disturbed in your cultivation on a regular basis.”<br/><br/>Fang Wang was very interested in the cultivation culture of the sea and continued to inquire.<br/><br/>It turned out that not all islands were suitable for cultivation. Islands like Biyou Island had been refurbished by the Heavenly Sect, with complete provisions for the transmission of Spiritual Energy and protective island formations around them—all these incurred costs.<br/><br/>If it weren’t for a sect’s refurbishment, a solitary island could easily be swallowed by the sea.<br/><br/>Qu Xunhun then mentioned the recent momentum of the Heavenly Sect. Two hundred years ago, the sect produced a prodigy of the Heaven Yuan, and now this prodigy had achieved the Golden Body Realm, shaking all four seas.<br/><br/>Even in the sea, prodigies of the Heaven Yuan type were extremely rare. Once such a talent appeared, they would be vied for by powers from all sides.<br/><br/>Canglan Academy, located amongst four sea islands, had numerous pavilions standing on the sea surface, forming an academy on the sea.<br/><br/>At this moment, in a courtyard, dozens of disciples were seated in meditation, looking forward to where an elderly man was leading Chu Yin up the steps.<br/><br/>Gu Li was also among the disciples, curiously watching Chu Yin like the others.<br/><br/>Chu Yin’s Spiritual Power was weak; it was clear he hadn’t been cultivating for long. But being in their courtyard indicated that Chu Yin had extremely high talent.<br/><br/>“This new disciple is named Chu Yin, from the Chu Family of the Northern Sea.<br/><br/>You might have heard of them. Although young, Chu Yin is a prodigy of the Heaven Yuan, and thus has been directly admitted into the academy’s Court of Saintly Talents,” the elder said with a smile, pride evident on his face.<br/><br/>Chu Yin was nervous and dared not speak, merely greeting his senior brothers and sisters with a fist salute.<br/><br/>“A prodigy of the Heaven Yuan? Really?”<br/><br/>“Tsk tsk, no wonder he can enter our courtyard directly.”<br/><br/>“The Chu Family, I’ve heard of them, a family with a decent foundation that’s active along the coast of the Northern Continent.”<br/><br/>“I didn’t expect a prodigy of the Heaven Yuan to join our academy. Why not pledge to those major sects?”<br/><br/>“Hahaha, don’t you know that our academy leader and the Chu Family’s ancestor are close friends?”<br/><br/>The disciples immediately became excited, with some discussing and others greeting Chu Yin.<br/><br/>Gu Li remained silent. Her face veiled, her beautiful eyes simply watched Chu Yin quietly.<br/><br/>“A prodigy of the Heaven Yuan… I wonder how he’s been doing recently…” Gu Li’s thoughts drifted off to Fang Wang.<br/><br/>Having come to the sea, her horizons had broadened. In Grand Qi, there was only one prodigy of the Heaven Yuan, but at sea, she had already heard of many names. However, when she considered the life stories of these prodigies, she felt that even among the talents of the Heaven Yuan, there were disparities.<br/><br/>Fang Wang definitely was among the utmost prodigies of the Heaven Yuan!<br/><br/>Looking at the timid Chu Yin, Gu Li felt he couldn’t possibly compare to Fang Wang.<br/><br/>From the first day she knew Fang Wang, he had been so spirited, even before he had begun the Heavenly Yuan Spirit Treasure refinement. That sharpness was unforgettable.<br/><br/>The thoughts of the disciples around her differed. As Chu Yin stepped down from the platform, they were all enthusiastic.<br/><br/>Although Chu Yin seemed timid now, they all knew that once he accomplished Spiritual Refinement, he would inevitably become a child of the heavens.<br/><br/>It’s no exaggeration to say that Chu Yin would be the strongest connection they had ever made, and it was essential to establish a good relationship with him.<br/><br/>Qu Xunhun was fast, and in less than ten days, they arrived at the Heavenly Sect’s sea territory and flew towards Biyou Island.<br/><br/>Biyou Island was no small island, stretching a hundred miles in length and up to sixty miles in width, with mountains and lakes, and many spiritual herbs were planted on it.<br/><br/>From afar, Fang Wang could already feel the abundant Spiritual Energy of Biyou Island.<br/><br/>It was very rich!<br/><br/>At the first glance of Biyou Island, Fang Wang fell in love with it, as it didn’t differ much from the description in the Jade Slip.<br/><br/>Qu Xunhun landed on the sandy beach, where two cultivators of the Heavenly Sect were waiting.<br/><br/>These two greeted Fang Wang very warmly and with a humble attitude, showing none of the arrogance characteristic of those in the Cross -Void Realm. According to Qu Xunhun’s introduction, both were elders of the Heavenly Sect.<br/><br/>Fang Wang took out Spirit Stones and had the two Heavenly Sect elders settle the account.<br/><br/>Half an hour later.<br/><br/>The two elders took their leave with a bow, and Fang Wang now held a jade token in his hand. The token was engraved with the characters “Biyou”, and it could control all the formations and prohibitions on the island. Moreover, it required ownership recognition. Once recognized, Biyou Island would have no affiliation with the Heavenly Sect, despite being located within their sea territory.<br/><br/>With a thought from Fang Wang, a thick fog began to rise from the sea surrounding Biyou Island, quickly enveloping it.<br/><br/>What a good formation!<br/><br/>Fang Wang found the Heavenly Sect’s Magic Artifact craftsmanship to be very impressive; when he activated the Biyou Jade Token, there was no sense of delay, feeling as though the formation was activated in an instant, utilizing the surrounding Spiritual Energy, not his own Spiritual Power.<br/><br/>“If you don’t have urgent matters, you could also cultivate on the island, and leave whenever you wish to,” Fang Wang said to Qu Xunhun, and then he took out some treasures from the Dragon Jade Ring to give to Qu Xunhun, all of which were Heavenly Materials and Earthly Treasures of over a thousand years old.<br/><br/>Qu Xunhun didn’t refuse and hurriedly thanked Fang Wang.<br/><br/>Afterwards, Fang Wang headed into the island, while Xiao Zi shot into the forest in a flash. Fang Wang, however, took his time, strolling along to appreciate his new property.<br/><br/>Qu Xunhun then left Biyou Island without staying behind to cultivate.<br/><br/>He wasn’t familiar with Fang Wang, and since there was a servant-master relationship, he didn’t dare to cultivate under Fang Wang’s watchful eye. He knew one thing very well: the more he knew, the more dangerous it was.<br/><br/>At the foot of the eastern mountains of Biyou Island, a row of pavilions had been built, in front of which was a small lake teeming with various fish that occasionally leaped out of the water. The surrounding flowers, plants, and trees were lush and picturesque.<br/><br/>Fang Wang arrived at this place after exploring and found the Spiritual Energy here was the richest, far surpassing the cave abode of the Great Abyss Gate.<br/><br/>The Spiritual Energy mainly surged from the small lake, no wonder the<br/><br/>Heavenly Sect built the pavilions here, as the Spirit Eye was situated here.<br/><br/>Fang Wang walked onto an open wooden platform, which faced the lake, and he began to sit and cultivate.<br/><br/>After such a delay, it was time to seriously cultivate and raise his level of Cultivation!<br/><br/>Once cultivation became tedious, he would then consider integrating Spells.<br/><br/>Fang Wang removed his Bamboo Hat and began to conduct his Cultivation exercise.<br/><br/>Biyou Island was now shrouded in thick fog, veiling even the Firmament above. After a brief period of darkness, sunlight began to pour down again, as the thick fog above gradually turned transparent, allowing the sun to re-emerge.<br/><br/>Day turned to night, and night to day, in a repeated cycle.<br/><br/>Fang Wang closed his eyes, and three years passed.<br/><br/>He finally made a breakthrough to the second level of the Cross-Void Realm!<br/><br/>Considering that the Spiritual Energy of Biyou Island far surpassed that of Grand Qi, yet it still took him three years, one could imagine just how difficult it was to progress in the Cross-Void Realm.<br/><br/>Fang Wang set a temporary goal for himself; that was to reach the Golden Body Realm within fifty years!<br/><br/>He took out a great quantity of Heavenly Materials and Earthly Treasures from the Dragon Jade Ring, placing them on the grass beside the lake, and then ordered Xiao Zi and Zhao Zhen to take care of planting them.<br/><br/>After giving his instructions, he resumed his seated cultivation.<br/><br/>Xiao Zi looked at Zhao Zhen and said earnestly, “I need to cultivate. You must carefully plant these, making no mistakes, or I’ll have your soul scatter to the winds!”<br/><br/>Zhao Zhen sighed. He knew it would be like this.<br/><br/>However, as a ghost, using his ghostly powers to plant flowers and grass was more interesting than cultivating, especially since most of the ghostly powers ho “Illtivntpd hp nhcnrhpd hi’ Vinn 7i<br/><br/>Within a brightly lit grand hall, numerous cultivators dressed in white robes gathered. The two elders of the Heavenly Sect who once received Fang Wang were also present.<br/><br/>A white-haired man sat cross-legged on a precious chair, his long hair loose and his long beard covering his hands, but his facial features and skin looked young.<br/><br/>He was the Sect Master of the Heavenly Sect, Real Man Linya.<br/><br/>“Sect Master, please say something. Brother Ye has reappeared in the Mortal Realm, representing the Jin Xiao Sect. What is that Jin Xiao Sect anyway? I have never even heard of them!” A corpulent Daoist stood up and said, his face full of anger.<br/><br/>Real Man Linya did not open his eyes, but replied calmly, “Brother Ye has long been expelled from our Heavenly Sect. What sect he joins has nothing to do with us.”<br/><br/>The corpulent Daoist argued, “Didn’t we agree back then that as soon as the period of suppression was over, we would take him back in?”<br/><br/>One of the elders who had received Fang Wang shook his head, “If he does not wish to return, why insist on it? Moreover, he killed two of our Heavenly Sect disciples.. Sect Master, we must eradicate the Jin Xiao Sect to uphold the reputation of the Heavenly Sect!”\t\t\t\t\t\t</div>", "images": {}, "success": true}