{"id": 130, "url": "https://www.novelhall.com/i-became-an-immortal-on-mortal-realm-32879/14299723.html", "title": "Chapter 130 - Chapter 130: Chapter 127: Eternal Life Pavilion, The Seventy-Two Weapon Lords", "volume": 2, "volume_title": "Volume 2", "body": "<h1>Chapter 130 - Chapter 130: Chapter 127: Eternal Life Pavilion, The Seventy-Two Weapon Lords</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 130: Chapter 127: Eternal Life Pavilion, The Seventy-Two Weapon Lords<br/><br/>Translator: 549690339<br/><br/>After chatting with Zhou Xue for half an hour, Fang Wang took Xiao Zi and moved back to the Third Vein’s cave dwelling, leaving Shiyuan Hall to Zhou<br/><br/>Xue.<br/><br/>Upon returning to his cave dwelling, Fang Wang took out the Yellow Glyph Sword Sovereign Order that Sword Saint had passed on to him. He sent his divine consciousness into it, and when he encountered an obstructing force, he brazenly broke through it.<br/><br/>Having reached the Cross-Void Realm, his divine consciousness far surpassed what it had been before, and he could also unlock the secrets of the Yellow Glyph Sword Sovereign Order.<br/><br/>As Sword Saint had said, once he surpassed the Condensation Spirit Realm, he would be able to refine the Order, which would guide him overseas to inherit the true legacy of Sword Saint.<br/><br/>Quickly, his divine consciousness came into contact with the restrictions on the Yellow Glyph Sword Sovereign Order. He sent his Spiritual Power into it, following his consciousness to refine the restrictions.<br/><br/>The Yellow Glyph Sword Sovereign Order was of a much higher grade than Great Abyss Gate’s disciple tokens. Although it was not comparable to the<br/><br/>Dragon Jade Ring, it felt even more advanced than supreme Magic Artifacts.<br/><br/>It took a full three hours, but Fang Wang finally refined it and had the Yellow Glyph Sword Sovereign Order recognize him as its master.<br/><br/>The moment the refinement was successful, a flood of memories poured into Fang Wang’s mind.<br/><br/>Eternal Life Pavilion!<br/><br/>Twelve Pavilion Masters, twenty-four True Immortals, seventy-two War Sovereigns, Eternal Envoys…<br/><br/>This represented a hierarchy of status from high to low, with each rank further divided into four levels: Heaven, Earth, Profound, and Yellow. Fang Wang’s Yellow Glyph Sword Sovereign Order belonged to the lowest tier of the seventy-two War Sovereigns. Even so, the seventy-two War Sovereigns were powerholders of the Eternal Life Pavilion, enjoying tremendous power and benefits.<br/><br/>These memories also recorded the subsidiary sects of the Eternal Life Pavilion. Astonishingly there were more than a hundred, and Grand Chu’s Vast Qi Sect was also one of them.<br/><br/>Let alone a War Sovereign, even a lower-ranked Eternal Envoy had the authority to command subsidiary sects to work for them.<br/><br/>Within the Eternal Life Pavilion, ranks were stringent. Lower-ranked individuals could not presume to act against their superiors. Even if they suffered injustices, they had to convey their grievances to the Eternal Life Pavilion. If they acted on their own, they would face pursuit and execution by the Eternal Life Pavilion.<br/><br/>There was also a very special rule: if the power orders of any rank within the Eternal Life Pavilion were acquired and refined by others, that person could directly join the Eternal Life Pavilion. The Pavilion only recognized the order, not the person.<br/><br/>After absorbing this vast amount of memory, Fang Wang sent his divine consciousness into the Yellow Glyph Sword Sovereign Order once more. Immediately afterward, he saw an illusory map similar to the one inside the<br/><br/>Great Disciple’s Token of Great Abyss Gate, but the map inside the Yellow Glyph Sword Sovereign Order was much larger.<br/><br/>Fang Wang’s consciousness rose higher, and he could actually look down upon the entire continent.<br/><br/>From his lofty vantage point, he could see why Grand Qi was referred to as a barbaric land compared to the whole continent; it was merely a speck. Considering that Grand Qi was already larger than the Huaxia of Fang Wang’s previous life, this showed how astonishingly vast the continent was.<br/><br/>As Fang Wang’s consciousness rose higher and he looked toward the ocean, the continent became tiny. He saw numerous green dots. If he focused on a green dot, he could automatically read its information.<br/><br/>All were subsidiary forces and strongholds of the Eternal Life Pavilion, densely scattered throughout the ocean. Their scope far exceeded the continent where Grand Qi was located. Just by looking at the map, Fang Wang could feel the power of the Eternal Life Pavilion—a behemoth within the Cultivation World.<br/><br/>Within the map, Fang Wang also saw other continents of various sizes, but the continent where Grand Qi was located was not the largest. On the edge of the map, only part of a continent was visible, yet it already appeared terrifyingly expansive.<br/><br/>The Yellow Glyph Sword Sovereign Order contained many more mysteries, including communication; Fang Wang could send messages to other War Sovereigns and Eternal Envoys and even issue direct orders to subsidiary forces.<br/><br/>He was curious—wasn’t the Eternal Life Pavilion afraid of their enemies obtaining the tokens?<br/><br/>Time flew by, and another four months passed.<br/><br/>Fang Wang’s cultivation growth was slow; he had never felt progress this sluggish. It seemed he would indeed have to go out to sea where the ocean’s spiritual energy was far superior to that of the continent.<br/><br/>Within the Yellow Glyph Sword Sovereign Order, Fang Wang located Sword Saint’s cave dwelling. He planned to visit it later; there might be many treasures there.<br/><br/>On this day.<br/><br/>Fang Wang gathered the high -ranking members of Great Abyss Gate, convened<br/><br/>in Shiyuan Hall, and announced his plans to head to Apex Mountain.<br/><br/>“Then go, the other sects have already started to go one after another, preparing to besiege the Carefree Immortal. Other dynasties’ sects are also rushing over, wanting to save their own Emperors,” Chai Yi said. Fang Wang said, “Actually, I alone would be sufficient.”<br/><br/>Yang Yuanzi frowned and said, “Don’t be negligent. What if the Carefree Immortal has a contingency plan, or if other Cultivation forces attack you while both you and your enemies are weakened? What then?”<br/><br/>Fang Wang heard this and felt it made sense.<br/><br/>Zhou Xue, seated on the Sect Leader’s cushion, said, “In that case, let the Vice Sect Leader personally select people to accompany Fang Wang on his mission to eliminate the old devil Carefree.”<br/><br/>Hearing that Chai Yi would follow, everyone immediately accepted the decision without objections.<br/><br/>Zhao Chuanqian proactively approached Chai Yi, saying he also wanted to accompany them. Chai Yi did not refuse.<br/><br/>Half a day later, Fang Wang, Chai Yi, and Zhao Chuanqian, leading five thousand disciples, flew toward the North Border. Even the weakest of these disciples were in the Soul Sculpting Realm; more than five hundred were in the Spirit Elixir Realm, and over a hundred were in the Profound Heart Realm, including elders from various veins.<br/><br/>Zhao Chuanqian flew at the front on his sword, holding a large banner that harnessed nature’s spiritual energy to create a gale that enveloped everyone, greatly increasing their speed and conserving their Spiritual Power.<br/><br/>Fang Hanyu flew beside Fang Wang, his face still covered with cloth to avoid startling people.<br/><br/>“What are the chances of victory?” Fang Hanyu asked softly. Fang Wang looked straight ahead and said calmly, “Fifty percent.”<br/><br/>Fang Hanyu remained silent.<br/><br/>Along the way, the other disciples frequently glanced at Fang Wang, including<br/><br/>Ye Xiang, who had grown up, because they all knew that the battle at Apex Mountain was destined to be a decisive battle between Fang Wang and the Xiaoyao Demon, and their role was merely to provide support.<br/><br/>That Xiaoyao Demon had easily defeated Xu Qiuming!<br/><br/>Of course, they were full of confidence in Fang Wang, but they were curious about what a magnificent battle it would be.<br/><br/>“When will you head south?” Fang Hanyu suddenly asked again. Fang Wang glanced at him and said, “Why? Do you want to come with me?” Fang Hanyu snorted and said, “Of course not, just curious, that’s all.”<br/><br/>“It won’t be long now,” Fang Wang replied.<br/><br/>The spiritual energy of this continent could no longer satisfy him, even though he had awakened the Dragon Vein; the spiritual energy was only suitable for cultivators of lower realms.<br/><br/>Once he went overseas, he planned to find an island and establish his own Cave Heaven, just like those great powers of ancient times. Perhaps one day, after he left, his Cave Heaven would become a secret realm for later generations to venture into, just like the Great Saint’s Grotto-Heaven or the Zhui Tian Secret Realm.<br/><br/>The brothers started chatting occasionally. Fang Hanyu also wanted to head south to seek opportunities. In the end, the brothers decided to go together; it was better to have someone to rely on.<br/><br/>In the North Border, at Apex Mountain, fierce winds and snowstorms raged, as numerous cultivators meditated on a mountainside. They had established a formation that blocked out the wind and snow.<br/><br/>They were from the Vast Qi Sect of Grand Chu, with Daoist Yaodao and Xu Guang meditating in front of a campfire, and Yang Jiner, who had had exchanges with Fang Wang in Zhui Tian City, was also there.<br/><br/>“When do we act? Are we still going to save the Emperor?” Yang Jiner asked.<br/><br/>She was still dressed in yellow, with more refined makeup than years before, and a white tiger lay by her side.<br/><br/>Xu Guang’s expression was emotionless as he said, ‘We’re no match for the Xiaoyao Immortal, we can’t be hasty. We will take action when Fang Wang confronts the Xiaoyao Immortal.”<br/><br/>Yang Jiner clicked her tongue in wonder and said, “You all really have so much confidence in Fang Wang. It seems he truly scared you to the core.”<br/><br/>Upon hearing this, Xu Guang glared angrily at her, and she unapologetically glared back, forcing Xu Guang to hold back his frustration.<br/><br/>Yang Jiner sighed and spread her hands, “I should have made a good connection with Fang Wang when we were in Zhui Tian City. What a pity, now that he has become the leading cultivator of the Seven Dynasties, even if I tried to ingratiate myself with him, he probably wouldn’t spare me a glance.”<br/><br/>Back then, she had cultivated on the same level of the cultivation tower as Fang Wang and Hu PO Xie. Although she was interested in Fang Wang, she hadn’t been overly enthusiastic.<br/><br/>Who would have known that in just a few years, Fang Wang had transformed from the number one genius of the Seven Dynasties into the number one Great Cultivator of the Seven Dynasties.<br/><br/>Xu Guang’s expression turned extremely ugly because the title of number one cultivator of the Seven Dynasties was built on crushing their master and disciple.<br/><br/>Daoist Yaodao paid no attention to Yang Jiner’s words. He meditated at the edge of the formation, gazing into the distance.<br/><br/>At this great height, the firmament was dim, and the distant mountain peaks appeared like looming demons. Daoist Yaodao could feel an exceptionally oppressive force.<br/><br/>He was secretly horrified, wondering what realm the Xiaoyao Immortal was in?<br/><br/>Daoist Yaodao himself was at the third layer of the Cross-Void Realm, and at this moment, he couldn’t determine who was stronger between Fang Wang and the Xiaoyao Immortal, as both were far beyond his strength.<br/><br/>“Ji Rutian, what is your background, and how did you lure out such an old monster like the Xiaoyao Immortal?”<br/><br/>Daoist Yaodao thought quietly to himself. Just thinking of Ji Rutian made him uneasy.<br/><br/>He always felt that Ji Rutian would not treat the Vast Qi Sect well, but the Vast Qi Sect was utterly helpless against Ji Rutian, and Ji Rutian had shown goodwill, making all the weak elders bow their heads in submission.<br/><br/>At this moment, it wasn’t just the Vast Qi Sect; there were more than twenty sects and factions gathered around the fringes of Apex Mountain, most of whom came to rescue their respective dynasty’s Emperor. Of course, to them, the Emperor wasn’t essential to save; it was just for show, and to investigate the intentions of the Xiaoyao Immortal, so none of them took any action.<br/><br/>All the sects were waiting for one person!<br/><br/>The Grand Qi Sword Saint, Fang Wang!<br/><br/>At the center of Apex Mountain.<br/><br/>Atop a sheer cliff, the Xiaoyao Immortal meditated on a stone platform, with eighty-one great banners floating above him. Each banner bore different mythical beast patterns that fluttered and rustled in the wind.<br/><br/>The captive Grand Chu Emperor couldn’t help but ask, “With so many cultivators’ auras from all directions, why do you let them be?”<br/><br/>Grand Chu had transformed into a Cultivation Dynasty over a hundred years ago, so the Grand Chu Emperor’s cultivation was the highest among the Emperors. He could sense some cultivators’ auras, occasionally drawing near and then swiftly slipping away.<br/><br/>The Xiaoyao Immortal, without opening his eyes, laughed disdainfully, “Since they want to watch the excitement, let them come. When I capture Fang Wang as a sacrifice, they, too, will become sacrifices.”<br/><br/>The North Border Emperor sneered, “You call yourself an Immortal, and yet you need to offer sacrifices?”<br/><br/>“Mortals will be mortals. I don’t have the time to explain to you. Just think about any regrets you might have, and do not repeat them in your next life,” the Xiaoyao Immortal huffed dismissively.<br/><br/>All of a sudden, Xu Qiuming spoke up, “You will regret giving Fang Wang a year. The Heaven Yuan Spirit Treasure is just how the world sees him, but his talent cannot be defined by it alone..”\t\t\t\t\t\t</div>", "images": {}, "success": true}