{"id": 134, "url": "https://www.novelhall.com/i-became-an-immortal-on-mortal-realm-32879/14300740.html", "title": "Chapter 134 - Chapter 134: Chapter 131: Unprovokable Figures, Internal Strife Within The Vast Qi Sect [Third Release, Request For Monthly Pass]", "volume": 2, "volume_title": "Volume 2", "body": "<h1>Chapter 134 - Chapter 134: Chapter 131: Unprovokable Figures, Internal Strife Within The Vast Qi Sect [Third Release, Request For Monthly Pass]</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 134: Chapter 131: Unprovokable figures, Internal strife within the Vast Qi Sect [Third Release, Request for Monthly Pass]<br/><br/>Translator: 549690339<br/><br/>Inside the cave dwelling, Fang Wang put down the Yellow Glyph Sword Sovereign Order, a hint of anticipation in his eyes.<br/><br/>He was unsure whether the Vast Qi Sect could uncover any trace of Ji Rutian’s whereabouts.<br/><br/>The Wandering Immortal should have been targeting Ji Rutian, but now that Ji Rutian had disappeared, Fang Wang always felt he needed to do something. He couldn’t let the Great Abyss Gate start the investigation, fearing it would cause them trouble, so it was best to have the Vast Qi Sect—one of the subordinate forces of the Eternal Life Pavilion—take on the task.<br/><br/>With the Yellow Glyph Sword Sovereign Order, Fang Wang could converse directly with the holder of the order within the Vast Qi Sect.<br/><br/>It had to be said, just on the point of token communication, the Eternal Life Pavilion was streets ahead of the Great Abyss Gate. Fang Wang’s own disciple tokens could send orders to his disciples, but their tokens could not send messages back. In terms of the development of magic artifacts, they were far behind the Eternal Life Pavilion.<br/><br/>But that was normal. In the same world, there would inevitably be differences in the levels of development, similar to the varying technological levels of different countries on Earth in his previous life.<br/><br/>After tucking the Yellow Glyph Sword Sovereign Order into the Dragon Jade Ring, Fang Wang stood up and stretched his limbs.<br/><br/>Calculating the time, the half-year period should be almost up.<br/><br/>Fang Wang was beginning to look forward to his journey south.<br/><br/>First to find the Sword Saint’s grotto, then to find an island to establish his own field of cultivation, fully committed to cultivation, far from the mundane world—the thought alone invigorated him.<br/><br/>Just then.<br/><br/>Footsteps of disciples landing could be heard at the entrance of the mountain gate, followed by a voice, “Brother Fang Wang, your letter.”<br/><br/>Fang Wang immediately gave Xiao Zi a look, and with a whoosh, Xiao Zi darted out.<br/><br/>The mountain gate opened and closed; this time, the disciple delivering the letter wasn’t startled.<br/><br/>Xiao Zi, holding the envelope in its mouth, came before Fang Wang. Fang Wang took it and sat down to open the letter.<br/><br/>Unfolding it, he saw it was another letter from Gu Li. Curious about what she would recount this time, he began to read intently.<br/><br/>Xiao Zi climbed onto his shoulder, joining him in reading the letter.<br/><br/>Unlike before, this time Gu Li mentioned many old acquaintances from the Grand Qi Cultivation Realm in her letter, mainly narrating the recent developments of the cultivators from Grand Qi who had traveled south.<br/><br/>She also mentioned Fang Zigeng.<br/><br/>Fang Zigeng had actually made a name for himself at sea. Gu Li heard that Fang Zigeng had taken a personal envoy of the Eternal Life Pavilion as his master, which utterly changed his fate.<br/><br/>Although the entire letter was about other people’s experiences, Fang Wang could sense Gu Li’s intentions—she was hoping he would head south sooner.<br/><br/>“Tch, even that reticent Fang Zigeng can make a splash? It seems that surviving at sea isn’t too difficult,” Xiao Zi teased.<br/><br/>Fang Wang folded up the letter and casually said, “Don’t underestimate him. Before setting sail, he went through many life-and-death crises and always managed to survive. It seems to be good luck, but in fact, it’s his own hard work.”<br/><br/>He greatly admired the tenacity of Fang Zigeng, who was truly committed to cultivation without seeking fame, solely for the benefit of cultivation.<br/><br/>“Xu Qiuming also plans to set sail. Let’s see if he can keep up with you. In Grand<br/><br/>Qi, he is the second only to you, but at sea, if you become the foremost, and he remams nameless, ne won’t even Deneve your consolations,” Mao Ll smcKerea, clearly eager to see Xu Qiuming falter.<br/><br/>Fang Wang smiled and thought to himself that Xu Qiuming was someone who aimed to reach the pinnacle of the mortal realm.<br/><br/>Xu Qiuming was actually very strong, but his brilliance was overshadowed by Fang Wang, plus he constantly encountered enemies beyond his own realm by two major levels.<br/><br/>Others might mock Xu Qiuming, but Fang Wang valued him highly and had great expectations for him.<br/><br/>This Brother Xu was in no way inadequate; he was just always playing in high-end leagues.<br/><br/>Afterward, Fang Wang, accompanied by Xiao Zi, left the cave dwelling. He intended to spend his contributions to his sect and give some gifts to his family members, for who knows what year or month it would be when he returned next time.<br/><br/>In the blink of an eye, ten days later.<br/><br/>Fang Hanyu finally came looking for Fang Wang, claiming they could set off now.<br/><br/>“By the way, Zhou Xue has already explained everything to the higher-ups, and the elders had no objections. They only hoped we could leave quietly and avoid spreading the news about you leaving the Great Abyss Gate. Later, we’ll pretend that you are in seclusion,” Fang Hanyu stood in front of Fang Wang and said earnestly.<br/><br/>Fang Wang felt the same and naturally had no objections, but he still wanted to meet Zhou Xue.<br/><br/>Seemingly seeing through his thoughts, Fang Hanyu said, “Zhou Xue left the Great Abyss Gate again a few days ago. Before leaving, she asked me to tell you that if you encounter a person named Yang Du at sea, do not associate with him and stay as far away as possible.”<br/><br/>Yang Du?<br/><br/>Fang Wang raised an eyebrow, puzzled, as he had never heard Zhou Xue mention this before.<br/><br/>He silently noted down the name and said, “Let’s go, we’ll spend a month at the Fang Family and then head south.”<br/><br/>Fang Hanyu had no objections, and the two brothers set out immediately.<br/><br/>Two months later, Fang Wang and his brother arrived at Sword Heaven Marsh.<br/><br/>As the name of the Tian Sheng of Grand Qi spread, Sword Heaven Marsh gained even more fame, and the number of cultivators temporarily staying there far exceeded the past; Song Jinyuan had also recruited many more Sword Servants.<br/><br/>Fang Wang and his brother, wearing bamboo hats, went straight to Song Jinyuan without revealing their whereabouts.<br/><br/>The three met in a room on an upper floor.<br/><br/>Song Jinyuan exclaimed, “After so many years, you have reached the Cross-Void Realm and even become the number one cultivator of the seven dynasties. Impressive. That Wandering Immortal is said to have a cultivation of the fourth level of the Golden Body Realm, which would make him a powerful figure even at sea. Did he really not last a single move against you?”<br/><br/>Before Fang Wang could reply, Xiao Zi on his shoulder laughed proudly, “Of course, at that time my young master punched through his golden body with a single blow, and he completely despaired!”<br/><br/>“A single punch?”<br/><br/>Song Jinyuan frowned and couldn’t help but ask, “Fang Wang, why don’t you use a sword? You are the Sword Saint’s Successor, after all. How come you always prefer using spears or hand-to-hand combat in a fight? It’s so improper! ”<br/><br/>Xiao Zi gave him a glare and said, “Is the Sword Saint really that remarkable?<br/><br/>My young master is also the successor of the Descending Dragon Great Saint.<br/><br/>Do you know about the Descending Dragon Great Saint? The Great Saint’s<br/><br/>Grotto-Heaven and Zhui Tian Secret Realm are both legacies left by the<br/><br/>Descending Dragon Great Saint!”<br/><br/>At these words, Song Jinyuan was moved, and even Fang Hanyu looked at Fang Wang with surprise.<br/><br/>Fang Wang coughed artificially and said, “These are but empty titles. Whether it’s the Sword Saint or the Descending Dragon Great Saint, they are both my masters and deserve my respect equally. In my heart, there is no distinction between their status. The reason I don’t use a sword is that my opponents are too weak to merit it.”<br/><br/>These words made Song Jinyuan feel much better.<br/><br/>Song Jinyuan gave a wry smile and said, “Although I have gained some insight into the Celestial Sword Intent, it’s only superficial. You are not even a hundred years old yet, and you can already master so many profound techniques. Why is there such a vast difference between people?”<br/><br/>Fang Hanyu chuckled and said, “Brother, don’t compare yourself with him. I’m still studying the Nine Dragons Divine Transformation Art, while his Nine Dragons Divine Transformation Art has already reached the Black Dragon Realm.”<br/><br/>The two looked at each other and suddenly, they both felt much better.<br/><br/>Yes, indeed.<br/><br/>Without comparing themselves to Fang Wang, they were still extraordinary among their peers.<br/><br/>“By the way, have you heard about what happened to the Vast Qi Sect?” Song Jinyuan changed the subject and asked.<br/><br/>As Grand Qi transformed into a Cultivation Dynasty, the Cultivators of the seven dynasties have become increasingly interlinked, and news of significant events from the other six were reaching Grand Qi. Inside Sword Heaven Marsh, many cultivators hailed from these other six dynasties.<br/><br/>“What happened to the Vast Qi Sect?” Fang Hanyu asked curiously.<br/><br/>Song Jinyuan clicked his tongue in amazement and said, “There was internal strife within the Vast Qi Sect, and the entire sect attacked their Sect Master, causing severe damage to the sect and countless casualties. Moreover, their Sect Master has disappeared. I believe he is called Ji Rutian, a man of unfathomable strength.”<br/><br/>Fang Wang’s expression turned odd.<br/><br/>Ji Rutian was hiding within the Vast Qi Sect as the Sect Master?<br/><br/>Fang Wang couldn’t help but feel inside, ‘Is the Yellow Glyph Sword Sovereign Order that effective?’<br/><br/>He had merely given a casual command, without issuing a kill order, and it made the Vast Qi Sect directly betray their Sect Master.<br/><br/>The Eternal Life Pavilion, as terrifying as ever!<br/><br/>“Now, the Vast Qi Sect has made a fool of itself and has become a laughingstock among the seven dynasties. However, this Ji Rutian has sparked curiosity—who he is, exactly, has left people wondering. It’s said that he became the Sect Master shortly after joining the Vast Qi Sect, which was also one of the reasons for the uprising. No one had heard of this name before.” After finishing his words, Song Jinyuan picked up a cup of hot tea and began to indulge in its taste.<br/><br/>Xiao Zi had witnessed Fang Wang issuing commands with the Yellow Glyph Sword Sovereign Order and now it merely flicked its tongue, without uttering a word.<br/><br/>Fang Wang asked, “Was that Ji Rutian injured?”<br/><br/>Song Jinyuan shook his head and said, “I don’t know about that, but facing the siege of the entire Vast Qi Sect, it would be impossible for him to come out unscathed.”<br/><br/>That was an Ascender, an existence that could command respect even in the Upper Realm. Fang Wang truly didn’t believe the Vast Qi Sect could harm Ji<br/><br/>Rutian.<br/><br/>No matter what, with such an uproar, Zhou Xue was bound to know. Could it be that Zhou Xue left the Great Abyss Gate previously just to pursue Ji Rutian?<br/><br/>Fang Wang was not too worried about Zhou Xue, though; with the advantage of rebirth, he didn’t believe that Ji Rutian in this life could surpass Zhou Xue, especially within the first hundred years of Cultivation.<br/><br/>“I came here mainly to say farewell, as we are preparing to venture south,” Fang Wang began to address the real purpose of his visit.<br/><br/>Upon hearing this, Song Jinyuan asked eagerly, “Do you need me to accompany you? I was born overseas and am quite familiar with the area.”<br/><br/>Fang Wang shook his head and said, “No need. You continue to meditate on the Celestial Sword Intent here. We’re not going away forever. But don’t let news of our trip south get out. If the Fang Family faces any danger, I hope you can help. ”<br/><br/>Song Jinyuan immediately replied, “Don’t worry. I’ve already joined the Fang Family, so naturally, I’ll do my part. Right now, there are many Fang Family disciples practicing swordsmanship in Sword Heaven Marsh.”<br/><br/>Fang Wang raised his cup, using tea in place of wine, to toast Song Jinyuan.<br/><br/>Song Jinyuan hurriedly raised his cup in return.<br/><br/>Half an hour later, Fang Wang and Fang Hanyu flew out of Sword Heaven Marsh. Both were clad in black, each wearing a bamboo hat—one with his eyes covered and the other wearing a fox mask. Their sword-flying speed was incredibly fast, and in the blink of an eye, they had vanished into the horizon.<br/><br/>Along the way, Fang Wang took out his First Disciple’s Token, extended his consciousness into it, and searched for the light spot representing Gu Li’s location.<br/><br/>Unfortunately, he found nothing.<br/><br/>It felt as though he had lost all signal.<br/><br/>Fang Wang had initially thought of telling Gu Li not to send letters anymore, but now it seemed pointless. Besides, the Great Abyss Gate would keep his letters safe, so it didn’t really matter whether or not Gu Li wrote to him.<br/><br/>“Fang Wang, want to see who’s faster?” Fang Hanyu suddenly challenged.<br/><br/>Upon hearing this, Fang Wang asked with a smile, “Are you serious?<br/><br/>Fang Hanyu snorted and said, “Of course, Zhou Xue taught me the White Rainbow Evasion Technique, and I’ve already mastered it. You may not be as fast as I am.”<br/><br/>The White Rainbow Evasion Technique?<br/><br/>Fang Wang laughed and immediately nodded his agreement.<br/><br/>Fang Hanyu immediately transformed into a white rainbow and accelerated forward.<br/><br/>Fang Wang swiftly followed.<br/><br/>Racing through the sky, Fang Hanyu felt nervous, unsure if the White Rainbow Evasion Technique could narrow the speed gap between him and Fang Wang.<br/><br/>Just as this thought crossed his mind, a white rainbow suddenly shot past him, and in the blink of an eye, it had disappeared into the horizon..\t\t\t\t\t\t</div>", "images": {}, "success": true}