{"id": 132, "url": "https://www.novelhall.com/i-became-an-immortal-on-mortal-realm-32879/14300413.html", "title": "Chapter 132 - Chapter 132: Chapter 129: The Power Of Heaven, The Despair Of The Carefree Immortal", "volume": 2, "volume_title": "Volume 2", "body": "<h1>Chapter 132 - Chapter 132: Chapter 129: The Power Of Heaven, The Despair Of The Carefree Immortal</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 132: Chapter 129: The Power of Heaven, The Despair of the Carefree Immortal<br/><br/>Translator: 549690339<br/><br/>“Kneel and beg for mercy?”<br/><br/>Upon hearing Fang Wang’s words, the carefree Immortal’s expression turned unsightly. In his right hand, he concentrated and formed a bronze compass, from which wisps of green smoke emanated, condensing into wolf-headed, humanoid phantom demons. They howled in all directions, bared their teeth, and clawed, trying to break free from the compass’s confines.<br/><br/>Looking up at the high and mighty Fang Wang, and feeling his overbearing and peerless aura, the carefree Immortal’s eyes brimmed with jealousy and rage.<br/><br/>“Fang Wang, you are indeed strong, but do you really think you’ve won?” said the carefree Immortal coldly, as his left hand began to form incantations.<br/><br/>Fang Wang looked down upon him and said, “Is that not the case?”<br/><br/>The reason he didn’t take action wasn’t that Fang Wang was overly arrogant— he simply wanted the carefree Immortal to reveal his full strength. He intended to crush him under a domineering stance in front of the watching sects of the Seven Dynasties, so that in days to come, when Fang Wang was gone, any sects thinking of opposing the Great Abyss Gate would have to weigh their ability to withstand Fang Wang’s wrath.<br/><br/>Without responding further, as the carefree Immortal continued his spellcasting with his left hand, the tremors between heaven and earth grew more intense. In addition to the Mountain River Town Heaven Fist, another power akin to Heavenly Might descended.<br/><br/>In the far distance, streaks of light appeared against the dark edge of the sky— eighty-one in total, surrounding Apex Mountain. These lights rapidly absorbed nature’s spiritual energy and then burst forth with blue gleams, linking with each other and forming a blue sky curtain that encircled an area with a hundred-mile radius.<br/><br/>The cultivators of the Seven Dynasties who had come to spectate all took steps back, fearing being drawn into the formation.<br/><br/>Yang Jiner sat astride a white tiger, her eyes fixed and serious as she slowly uttered five words: “Kun Long Huan Tian Formation!”<br/><br/>Accompanying the descent of the Kun Long Huan Tian Formation, the carefree Immortal once again revealed a deranged smile. Xu Qiuming and the Emperors of the Seven Dynasties were feeling the pressure of this formation for the first time, and their faces turned pale.<br/><br/>“Fang Wang, do you know the origin of this formation?” the carefree Immortal laughed triumphantly, his greedy eyes unable to hide behind his mad grin.<br/><br/>Fang Wang looked down upon him and said lightly, “Kun Long Huan Tian Formation, that’s it?”<br/><br/>At these words, the carefree Immortal’s smile instantly froze.<br/><br/>Fang Wang clenched his right fist and raised his left hand towards the sky with a tug, his voice rose: “You think you can replace Heaven with this? Now behold the force that represents Heaven itself!”<br/><br/>A terrifying oppressive fear, more frightening than the Kun Long Huan Tian Formation’s pressure, replaced it, causing everyone to involuntarily look up.<br/><br/>In the darkened firmament, golden lines appeared, lighting up rapidly to form characters. The golden characters emerged in the gloomy sky, illuminating the entire Gloomy Apex Mountain.<br/><br/>Even those at the Great Abyss Gate, three hundred miles away, could see it.<br/><br/>Fang Hanyu raised his head, murmuring softly, “The way that can be told of is not an unvarying way; the names that can be named are not unvarying names…”<br/><br/>All who saw were dumbfounded, as if witnessing a miracle.<br/><br/>The range of the golden characters in the sky covered hundreds of miles, and the glow of the golden light continued to strengthen. These characters seemed to be falling.<br/><br/>The carefree Immortal’s eyes widened, and he asked tremblingly, “What supreme skill is this?”<br/><br/>Fang Wang tilted his chin up and hummed softly, “Supreme skill? This is my Lifespirit Treasure. You wanted to obtain the Heaven Yuan Spirit Treasure, didn’t you? Today, let me show you just how unattainable what you covet really is!”<br/><br/>Xiao Zi’s eyes also looked upwards, her serpentine pupils filled with shock and excitement.<br/><br/>Zhao Zhen found it unbelievable.<br/><br/>Could the tiny Six Harmonies and Eight Desolations Seal possess such divine skills?<br/><br/>As huge golden characters descended, the Kun Long Huan Tian Formation suffered an impact. Azure rainbows flared in the sky, and the spiritual energy within the formation surged wildly, with wind, snow, and shattered ice dancing chaotically. Those imprisoned in cages, including Xu Qiuming, clung to their confines as the cliffs trembled violently as though a mountain collapse was imminent.<br/><br/>Ice mountains within hundreds of miles of the formation began to collapse in succession, the world thundered, as if the apocalypse had arrived, and the rising snow fog looked like fierce flames burning in all directions.<br/><br/>The carefree Immortal’s complexion underwent a drastic change, clearly feeling the terrifying pressure bearing down on the Kun Long Huan Tian Formation.<br/><br/>“How is this possible…”<br/><br/>The carefree Immortal was petrified with fear. In an instant, he launched an attack toward Fang Wang, his right hand holding the bronze compass as he fiercely aimed it at Fang Wang.<br/><br/>The wolf-headed humanoid demons atop the compass howled as they charged out, growing larger in size—each more massive than Xiao Zi and with an intimidating presence.<br/><br/>Fang Wang’s eyes narrowed, and suddenly he leaped off Xiao Zi’s head, like a streak of golden light, sweeping across the sky. In the blink of an eye, Fang Wang was in front of the carefree Immortal, and the wolf-headed demons along the path burst apart sequentially.<br/><br/>So fast!<br/><br/>The carefree Immortal’s pupils dilated, and he instinctively swung his palm towards Fang Wang.<br/><br/>Fang Wang’s fist was faster, as it punched straight through the carefree Immortal’s chest. The terrifying force of the punch continued onward, shattering a series of ice mountains on its path, and the fierce winds lifted all the cages on the cliff into the air.<br/><br/>With a boom!<br/><br/>The azure light curtain in the sky was forcefully dispersed, and together with the overwhelming power of the Six Harmonies and Eight Desolations Seal, the Kun Long Huan Tian Formation was shattered.<br/><br/>As the formation exploded, the resulting shockwave stirred the spiritual energy between heaven and earth, lashing out in all directions. Sects from the Seven Dynasties promptly formed their own formations to withstand the tempest, and cultivators in the air did the same, using their Lifespirit Treasures to resist.<br/><br/>A giant ice boulder, twenty feet tall, hurtled directly toward Yang Jiner. The white tiger swung its paw and shattered it immediately.<br/><br/>The howling winds completely exposed Yang Jiner’s face as she held tightly onto the white tiger, her gaze fixed on the enormous golden characters in the firmament.<br/><br/>As the golden characters fell, their outlines gradually became more defined.<br/><br/>“That is…”<br/><br/>Yang Jiner’s expression was one of utter disbelief, not just her, but all the cultivators who witnessed the scene drew a cold breath, doubting their own eyes.<br/><br/>Even the five-thousand cultivators of the Great Abyss Gate felt the same, including Vice Sect Leader Chai Yi and Fang Hanyu.<br/><br/>What did they see?<br/><br/>A giant jade seal, spanning hundreds of miles in length and width, floated in the sky. With their vision, they couldn’t begin to estimate its immense size. In front of this seal, all the peaks within the ten-thousand-mile glacier seemed insignificant.<br/><br/>It was as if an immense immortal god was pressing down a divine seal from beyond the heavens, crushing towards the mortal realm. The sea of clouds in the sky was dispersed, and rolling snow mists surrounded the giant jade seal, forming a spectacular vortex. Even those in the Condensation Spirit Realm had to muster all their strength to withstand it.<br/><br/>Xiao Zi exerted demonic power to protect its body, avoiding being blown away by the strong wind.<br/><br/>Zhao Zhen floated on its back, looking at Fang Wang’s silhouette.<br/><br/>Fang Wang slowly lifted his right arm, holding the Leisurely Immortal aloft in the air.<br/><br/>The golden inscriptions on the base of The Six Harmonies and Eight Desolations Seal showered down ten thousand rays of golden light, one of which shone upon the body of the Leisurely Immortal.<br/><br/>The Leisurely Immortal spat out a mouthful of blood, which nearly splashed onto Fang Wang’s arm before being dried up by the Solaris True Fire, leaving not a trace behind.<br/><br/>The golden light shone on Fang Wang’s face, his expression so stern.<br/><br/>The Leisurely Immortal, with a face full of pain, looked at Fang Wang with fear and asked in a trembling voice, “Who exactly are you…?”<br/><br/>After all, he was from the Golden Body Realm, his flesh incredibly powerful, and yet somebody had punched straight through it.<br/><br/>He’d roamed this continent for so long but had never encountered such a terrifying fist.<br/><br/>He could feel that it wasn’t just the Mountain River Town Heaven Fist Fang Wang had used; his own physical strength was terrifyingly strong…<br/><br/>How could such a mighty being possibly emerge from a barbarous land like Grand Qi?<br/><br/>Even if it was the Heaven Yuan Spirit Treasure, there had to be a limit!<br/><br/>Fang Wang stared at him and said, “You dare to challenge me without even knowing my origins? Are you ready to die?”<br/><br/>The Leisurely Immortal suddenly panicked. He tried to let his Primordial Spirit escape his body, but was horrified to find that his Primordial Spirit couldn’t detach from his flesh.<br/><br/>It was the golden light!<br/><br/>This light actually had a repressive effect on the Primordial Spirit, and it was incredibly potent!<br/><br/>The Leisurely Immortal was utterly alarmed and quickly said, “Fang Wang! I was wrong! I…”<br/><br/>Thump!<br/><br/>Fang Wang’s left palm acted as a blade, severing the head of the Leisurely Immortal. ‘l’nen ms ngnt arm Ignitea witn solans ‘rrue Fire, Durmng tne Leisurely Immortal’s body.<br/><br/>His gaze sharpened, and a bracelet from the Leisurely Immortal’s right wrist flew out, landing in his belt.<br/><br/>Fang Wang turned around and landed in the icy ruins below. He tossed the<br/><br/>Leisurely Immortal’s corpse aside to burn, the golden light from The Six Harmonies and Eight Desolations Seal still shining on the Leisurely Immortal, subjecting his Primordial Spirit to agony, with no escape possible.<br/><br/>Fang Wang, holding the Leisurely Immortal’s head, approached the cage containing Zhao Qi, tore the prison door open, then raised his hand and tore open the distant Xu Qiuming’s prison door from afar. The Talisman Paper on the cages couldn’t resist his formidable power at all.<br/><br/>“Thank you, senior, for your rescue!”<br/><br/>Zhao Qi was incredibly excited, readily kneeling before Fang Wang, even beginning to kowtow.<br/><br/>Xiao Zi landed, and Zhao Zhen snorted, “Kid, you really have no imperial demeanor at all!”<br/><br/>Zhao Qi looked up at Zhao Zhen, silent and expressionless, his eyes filled with resentment.<br/><br/>Xiao Zi couldn’t help saying, “Did you have any imperial demeanor when you knelt before my young master?”<br/><br/>Zhao Zhen immediately felt awkward and could only turn his head away.<br/><br/>Fang Wang spoke up, “Xiao Zi, accompany Zhao Qi to rescue the other emperors. ”<br/><br/>Upon hearing this, Zhao Qi immediately cast an appreciative look at Fang Wang.<br/><br/>He knew that Fang Wang was giving him support, instantly making the other emperors indebted to him.<br/><br/>He didn’t argue, quickly stood up, and walked briskly away, with Xiao Zi closely following.<br/><br/>Fang Wang turned around, looking at the Leisurely Immortal being burned by the Solaris True Fire, and thought to himself, “Golden Body Realm? Truly a golden body, it’s so hard to burn!”<br/><br/>His Solaris True Fire was no ordinary flame!<br/><br/>At this time, Xu Qiuming approached him, his face a complex mixture of emotions, as he bent forward to bow to Fang Wang.<br/><br/>Fang Wang looked at him and smiled, “Brother Xu, why such formality?”<br/><br/>Xu Qiuming lifted his head and said, “You saved my sister and rescued me twice. I have no way to repay you in this life. If there’s anything you ever need, just give the word. Even if it’s to face death, I, Xu Qiuming, will not hesitate!”<br/><br/>He spoke with utmost seriousness, making Fang Wang struggle to keep smiling.<br/><br/>Seeing the sadness in Xu Qiuming’s eyes, Fang Wang solemnly said, “Brother Xu, I believe your words and hope you won’t be disheartened. Looking at this world, you are the only one I consider a rival. Your defeat this time was not because of lacking talent, but because you faced an opponent that one cannot possibly defeat at your current realm.”<br/><br/>Upon hearing this, Xu Qiuming was touched, but he also knew realistically that he was far from being Fang Wang’s rival.<br/><br/>“Fang Wang, rest assured, I will not give up on my cultivation. You will always be the goal I pursue. No matter what, you are my lifesaver, and I am at your beck and call!” Xu Qiuming said earnestly, his voice loud as if to let the Seven Dynasties Emperor witness his resolve.\t\t\t\t\t\t</div>", "images": {}, "success": true}