{"id": 133, "url": "https://www.novelhall.com/i-became-an-immortal-on-mortal-realm-32879/14300737.html", "title": "Chapter 133 - Chapter 133: Chapter 130: The Name Of Tian Sheng, The Decree Of The Sword Sovereign Of The Yellow Glyph", "volume": 2, "volume_title": "Volume 2", "body": "<h1>Chapter 133 - Chapter 133: Chapter 130: The Name Of Tian Sheng, The Decree Of The Sword Sovereign Of The Yellow Glyph</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 133: Chapter 130: The Name of Tian Sheng, The Decree of the Sword Sovereign of the Yellow Glyph<br/><br/>Translator: 549690339<br/><br/>Fang Wang did not immediately retract The Six Harmonies and Eight Desolations Seal, but let it high hang, deterring the sects of the Seven Dynasties.<br/><br/>He turned to look at the body of the carefree Immortal, which, under the incineration of the Solaris True Fire, finally began to be burned away.<br/><br/>“Is that your Heaven Yuan Spirit Treasure, are you a Dual Destiny Spirit?” Xu Qiuming asked, looking up at the firmament, unable to help himself.<br/><br/>The majestic Six Harmonies and Eight Desolations Seal was simply too awe-inspiring. No matter how many times Xu Qiuming looked at it, he was amazed.<br/><br/>He had never seen such a massive Spirit Treasure!<br/><br/>Fang Wang smiled and said, “That’s right. ”<br/><br/>Having many spirit treasures, exposing two wasn’t an issue for him; it just right increased his deterrence.<br/><br/>Xu Qiuming fell silent.<br/><br/>Dual Destiny Heavenly Origin?<br/><br/>After a while, Xiao Zi arrived with the emperors of the Seven Dynasties. After they landed, they looked at the still-burning body of the carefree Immortal and all fell silent, mainly because they didn’t know what to say.<br/><br/>This battle had completely overturned their imaginations; the carefree Immortal was an existence akin to a terrestrial Immortal God for them, yet such a powerful being was killed by a punch from Fang Wang.<br/><br/>They had fantasized about Fang Wang winning, but they had not imagined it would be this easy.<br/><br/>Looking back at the preceding battle, they all felt only one thing: these two were not opponents on the same level!<br/><br/>At this moment, the people of Great Abyss Gate rushed over, followed by disciples from other sects.<br/><br/>Zhao Chuanqian landed beside Fang Wang, about to inquire, but his gaze turned to something burning not far away. Sensing something, he couldn’t help but ask, “Where is the carefree Immortal?”<br/><br/>Fang Wang replied, “As you can see.”<br/><br/>Zhao Chuanqian was moved, and the others all looked towards the burning mass — they were all cultivators and naturally heard Fang Wang’s words.<br/><br/>“Is that the old demon, the carefree one?”<br/><br/>“Tsk, look at what Brother Fang is holding in his hand.”<br/><br/>“Brother Fang is indeed powerful, but what is that thing in the sky?” “I’ve always said that the old demon carefree is no match for Brother Fang.”<br/><br/>“Even though we didn’t participate in this great battle, witnessing the just display was worth the journey.”<br/><br/>Disciples of the Taiyuan Sect chattered amongst themselves, unable to help but look up at The Six Harmonies and Eight Desolations Seal in the sky.<br/><br/>More and more sects arrived, retrieving their respective emperors. The leaders of those sects came to Fang Wang to pay their respects, and Fang Wang, without much enthusiasm, nodded in response. None of the sects got offended; instead, they were excited.<br/><br/>The Vast Qi Sect also arrived, but the cliff hermit did not dare to approach. When Fang Wang’s gaze swept over him, he hurriedly saluted from afar.<br/><br/>After the body of the carefree Immortal was completely incinerated, Fang Wang tossed his head to Zhao Qi, saying, “Hang it on the Imperial City walls as a warning to the world.”<br/><br/>Zhao Qi hurriedly caught it.<br/><br/>Fang Wang, not waiting for him to speak, looked at Zhao Chuanqian and said,<br/><br/>“I’m heading back first.”<br/><br/>So many sects gathered here that it would probably take a while for them to disperse, and he wanted to leave first.<br/><br/>Zhao Chuanqian nodded, with no objections.<br/><br/>Fang Wang leaped into the air, landing on Xiao Zits serpent head. Under the watchful eyes of all, he raised his right hand, and the massive Six Harmonies and Eight Desolations Seal rapidly shrank and fell into his hand. Many cultivators were left slack-jawed by this scene.<br/><br/>Could that Seal be Fang Wang’s Heaven Yuan Spirit Treasure?<br/><br/>Xiao Zi sped away, swiftly vanishing into the snowstorm.<br/><br/>An elder of the Suspended Vast Sword Sect exclaimed, “I suddenly feel that Sword Saint is not sufficient to describe his strength. He has surpassed the Sword Saints of old.”<br/><br/>Upon these words, many cultivators agreed.<br/><br/>Although they had not witnessed with their own eyes how the carefree Immortal died, they had clearly seen the scene of The Six Harmonies and Eight Desolations Seal breaking the formation.<br/><br/>The younger generation, including Xu Qiuming, Fang Hanyu, Ye Xiang, and even Xu Guang, who had been humiliated by Fang Wang before, all looked in the direction Fang Wang had left with reverence in their eyes.<br/><br/>Xu Guang indeed held a grudge against Fang Wang, but the battle of that day made him dare not hold onto his hatred any longer. His heart was filled only with boundless admiration.<br/><br/>The next morning.<br/><br/>Fang Wang returned to the cavern dwelling of the Great Abyss Gate. He sat cross-legged on the white jade bed, took out the bracelet of the carefree Immortal, and began to refine it.<br/><br/>An hour later, the prohibitions within the bracelet were broken by Fang Wang, and the content revealed a massive amount of Spirit Stones, Spiritual Energy Pills, Heavenly Materials and Earthly Treasures, as well as Refining Materials, and more.<br/><br/>Immensely wealthy!<br/><br/>Fang Wang poured all the contents into the Dragon Jade Ring at once, and then destroyed the bracelet.<br/><br/>He feared that there might still be people behind the carefree Immortal, so it was better to deal with it cleanly.<br/><br/>Xiao Zi lay on the table, curiously asking, “Master, are you heading south next?”<br/><br/>Fang Wang rolled his neck and said, “Wait for Han Yu a bit, no rush for this moment.”<br/><br/>Having reached the first layer of the Cross-Void Realm, he indeed should head overseas to pursue higher realms.<br/><br/>Xiao Zi asked no further, crawling into the pool to begin its cultivation.<br/><br/>After witnessing the battle of yesterday, it was filled with a surge of emotion, wanting to engage in arduous cultivation.<br/><br/>It wasn’t until seven days later that the five thousand cultivators of the Taiyuan Sect returned, also bringing back the news of the carefree Immortal’s execution by Fang Wang, causing a sensation throughout the entire sect.<br/><br/>Fang Hanyu returned to visit Fang Wang and informed him that he had some matters to attend to, requesting Fang Wang wait for him for half a year. Fang Wang had no objections, of course.<br/><br/>In the days that followed, the news of Fang Wang slaying the Wandering Immortal spread throughout the seven dynasties.<br/><br/>The Wandering Immortal had captured the Emperor of the Seven Dynasties, causing his name to spread far and wide. In a short span of time, he was portrayed as the world’s greatest devil. Now, the title of the Wandering Immortal had become a stepping stone for Fang Wang.<br/><br/>All the sects of the Seven Dynasties proclaimed Fang Wang as the foremost cultivator among the Seven Dynasties, stating that the Wandering Immortal had been killed by Fang Wang in a single move!<br/><br/>The emperors had personally witnessed Fang Wang punch through the Wandering Immortal’s flesh, instantly robbing him of his combat abilities, therefore, in their eyes, Fang Wang had indeed slain the Wandering Immortal with a single move.<br/><br/>The emperors detested the Wandering Immortal and deliberately belittled him, which paradoxically made Fang Wang’s name more mysterious and godlike.<br/><br/>The name of The Six Harmonies and Eight Desolations Seal also spread throughout the Seven Dynasties; Fang Wang had intentionally leaked it to those present at the time. As he expected, the name of the first Heaven Yuan Spirit Treasure in the history of the Seven Dynasties spread, becoming a legend within the Cultivation World of the Seven Dynasties.<br/><br/>Fang Wang finally used a title of his own.<br/><br/>Tian Sheng!<br/><br/>Wielding the Seal of Heaven, he cast down demons and forged a saintly name!<br/><br/>In the Grand Chu Dynasty, within the Vast Qi Sect.<br/><br/>Atop the grand hall, over a hundred cultivators gathered, including Cliff Daoist, Xu Guang, Yang Jiner among them.<br/><br/>Yang Jiner looked at the man in golden robes standing atop the stairs in front of her, her eyes filled with suspicion.<br/><br/>Xu Guang was narrating the great battle between Fang Wang and the Wandering Immortal. Although the battle ended quickly, Xu Guang specifically emphasized the might of The Six Harmonies and Eight Desolations Seal, leaving all those present deeply moved.<br/><br/>The man in golden robes held his right hand in front of his stomach and his left behind his back, remaining composed throughout.<br/><br/>After Xu Guang finished speaking, he said in a heavy tone, “Sect Master, we must not provoke Fang Wang. Doing so would bring the risk of destruction to the Vast Qi Sect!”<br/><br/>The Cliff Daoist and the elders and disciples who had been to Apex Mountain nodded in agreement, still feeling apprehensive when recalling the battle.<br/><br/>Only those who had personally witnessed the aura of Fang Wang and The Six Harmonies and Eight Desolations Seal could understand the true terror that Fang Wang represented.<br/><br/>In any case, they dared not oppose Fang Wang, and if the Sect Master insisted, they would rather leave the sect.<br/><br/>The man in golden robes observed the expressions of everyone in the hall and slowly said, “By slaying a fourth-level Golden Body Realm opponent, Fang Wang is indeed powerful and not to be provoked. From this day forward, we shall not inquire further into Fang Wang and the Great Abyss Gate’s affairs and will try to maintain good relations with the Great Abyss Gate.”<br/><br/>Upon hearing this, everyone breathed a sigh of relief and unanimously agreed.<br/><br/>At this moment, an elder stepped forward and asked, “May I ask the Sect Master, do you know the Wandering Immortal?”<br/><br/>The hall instantly fell silent.<br/><br/>The man in golden robes had previously said that someone would destroy Grand Qi and the Great Abyss Gate, and just then the Wandering Immortal came out of nowhere; it couldn’t be a coincidence.<br/><br/>The Vast Qi Sect was a righteous sect of Grand Chu, and also a national supporting sect. The capture of their emperor had shamed the Vast Qi Sect, and the situation was also a source of frustration for them.<br/><br/>Already dissatisfied with the Sect Master who had not been in the position for long, someone now could no longer hold back.<br/><br/>The man in golden robes smiled calmly and asked, “If I say I do not know him, would you believe me?”<br/><br/>The elder who had challenged him said sternly, “The Vast Qi Sect is a famous righteous sect. We may employ some tactics for dynastic conflicts, but we must never do anything that goes against virtue or harms Grand Chu!”<br/><br/>With one person taking the lead, more and more people stood up to rebuke the man in golden robes.<br/><br/>The man in golden robes remained unruffled, speaking softly, “Have you all forgotten? The reason we had to deal with Fang Wang was because you suspected that Liang Xunqiu died at his hands.”<br/><br/>An elder spoke up righteously, “Even so, we must not collude with demonic outsiders!”<br/><br/>His words restored the crowd’s righteousness, which had been wavering due to their own guilty consciences.<br/><br/>The man in golden robes was still collected, but his left hand behind his back was clenched into a fist.<br/><br/>Just then.<br/><br/>A gust of strong wind swept into the grand hall, startling everyone into turning their heads to look. They saw an old man with white hair and a white robe appear out of thin air above the grand hall.<br/><br/>He was tall, holding a horsetail whisk, with a long beard reaching his abdomen, exuding an aura of Immortal Aura and Daoist Bones.<br/><br/>“Greetings to the Grand Ancestor!”<br/><br/>Cliff Daoist hurriedly knelt down, and with him, all the others knelt as well.<br/><br/>To think that someone who a Grand Elder like Cliff Daoist would call a Grand Ancestor—what stature did this make him?<br/><br/>The white-robed old man ignored his juniors around him and looked at the man in golden robes, asking, “Are you Ji Rutian?<br/><br/>The man in golden robes narrowed his eyes and said, “I did not expect the Vast<br/><br/>Qi Sect to harbor someone like you. Why have you not shown yourself before?”<br/><br/>The white-robed old man raised his left hand, and a token appeared in the palm of his hand, carved with two characters on it.<br/><br/>Eternal!<br/><br/>The white-robed old man spoke out, “By the command of the Sword Sovereign of the Yellow Glyph from the Eternal Life Pavilion, the Vast Qi Sect is to investigate the whereabouts of Ji Rutian. Junior, you have offended the Eternal Life Pavilion and also joined the Vast Qi Sect. What exactly are you up to?”<br/><br/>Ji Rutian raised his eyebrows and asked, “The Eternal Life Pavilion? What is the relationship between the Vast Qi Sect and the offshore Eternal Life Pavilion?”<br/><br/>The other Vast Qi Sect cultivators were also puzzled. They had never heard of the Eternal Life Pavilion, as going to sea from the south was only a recent trend, and few who went ever returned.<br/><br/>The white-robed old man answered, “The Vast Qi Sect could be established only with the support of the Eternal Life Pavilion, a relationship known only to the successive Sect Masters after they step down.”<br/><br/>“Since the Sword Sovereign of the Yellow Glyph wishes to investigate you, I might as well just capture you to prevent you from leading the Vast Qi Sect astray.”<br/><br/>Ji Rutian laughed. He lifted his hand and rubbed his forehead, expressing his resignation as he said, “The Eternal Life Pavilion, the Sword Sovereign of the Yellow Glyph… just hearing it sounds troublesome. Never mind, I was only looking to use you temporarily anyway.”<br/><br/>His smile then vanished, and his expression turned stern.. Looking down at the white-robed old man, he said, “Old man, do you think you have what it takes to capture me? Do you know who you are facing?”\t\t\t\t\t\t</div>", "images": {}, "success": true}