{"id": 135, "url": "https://www.novelhall.com/i-became-an-immortal-on-mortal-realm-32879/14301175.html", "title": "Chapter 135 - Chapter 135: Chapter 132: Monsters Rampant, The True Identity Of Xiao Zi", "volume": 2, "volume_title": "Volume 2", "body": "<h1>Chapter 135 - Chapter 135: Chapter 132: Monsters Rampant, The True Identity Of Xiao Zi</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 135: Chapter 132: Monsters Rampant, The True Identity of Xiao Zi<br/><br/>Translator: 549690339<br/><br/>The southern coastal regions of Grand Qi have always been uninhabited; although they are marked as part of Grand Qi Kingdom’s territory, that’s only because other dynasties couldn’t claim them. So, the founding emperor of Grand Qi simply included them into the national map.<br/><br/>Years ago, Qi Gaozu had dispatched an army to head south, and they eventually saw the ocean. However, on their round trip, nearly half of the soldiers were lost because they encountered too many spirit demons and evil spirits along the way. This incident has always been treated as a taboo, not to be discussed openly at court.<br/><br/>The royal family did not want the people below to know that cultivating to immortality was a real possibility, as that could undermine the Heavenly Might of the royal authority. Myths were permitted, but they had to remain illusory and never taken as reality.<br/><br/>When Fang Wang heard Zhao Zhen mention these incidents, he couldn’t help but reflect on the importance of one’s understanding.<br/><br/>With limited understanding, the younger him thought that Grand Qi was the center of the entire world, not realizing that Grand Qi was quite small.<br/><br/>One dusky evening, Fang Wang and Fang Hanyu arrived at the seaside, where Fang Hanyu produced a ship, five Zhang in length, with a two-story pavilion on deck. According to Fang Hanyu, it was a Superior Grade Magic Artifact.<br/><br/>Since a trend began in the seven states to head south in search of fortuitous opportunities for cultivation, such Magic Artifacts started to be produced in large quantities and were very expensive, even more so than flying artifacts of the same grade.<br/><br/>Fang Wang, accompanied by Xiao Zi, stepped onto the Law Ship. He went up to the second floor alone and began to meditate and practice.<br/><br/>Xiao Zi summoned Zhao Zhen, asking him to help steer the vessel. After some brief instructions from Fang Hanyu, Zhao Zhen got the hang of it. As the Law Ship sailed out, Fang Hanyu sat on the deck and began his own practice.<br/><br/>Zhao Zhen didn’t feel the slightest sense of being enslaved; on the contrary, he found piloting the ship quite interesting.<br/><br/>The sun set and the moon rose; the ocean was silent, without even the sound of waves.<br/><br/>Fang Wang stepped out of the pavilion and stood on the balcony to appreciate the moonlight on the sea. The bright moon seemed even larger than when observed from land, as if it might fall at any moment.<br/><br/>“The moon rises above the sea; we share this moment at the End of the Sky.”<br/><br/>Fang Wang couldn’t help but sigh with emotion, which made Fang Hanyu, Xiao Zi, and Zhao Zhen turn their heads.<br/><br/>Fang Hanyu couldn’t help but ask, “By the way, what’s the meaning of the scripture at the bottom of the Six Harmonies and Eight Desolations Seal? Is it some kind of supreme technique?”<br/><br/>Fang Wang stretched and smiled, saying, “Nothing much, just an air of mystery.”<br/><br/>The underside of the Six Harmonies and Eight Desolations Seal was inscribed with the Tao Te Ching by Laozi. When he crafted the seal, he had thought about making it immensely large, preferably so big that it would block out the sun. Once enlarged, the scriptures at its base would become visible. And if there were profound and enigmatic words on it, it would appear even more imposing.<br/><br/>Indeed, the reality was just as he had envisioned. In the battle at Apex Mountain, various cultivators memorized a portion of the Tao Te Ching, and some even began to study it, believing that these words could be some kind of supreme technique or a sealing spell.<br/><br/>“What do you plan to do after we find the master’s Cave Heavens?” Fang Wang asked.<br/><br/>Fang Hanyu answered, “I’m not as gifted as you, so I can’t just find a place to cultivate in solitude. I must seek out my own opportunities. I plan to follow the path of a Sword Cultivator. I’ve heard from Senior Martial Brother Song that there’s a sea region where the Sword Dao culture is very strong. I intend to make my mark there.”<br/><br/>Fang Wang naturally wouldn’t discourage him. Everyone has their own path, just like him—even with Zhou Xue, a reborn person by his side, he wished to carve out his own path.<br/><br/>Fang Hanyu also harbored the heart of a strong man and even aspired to compete with Fang Wang.<br/><br/>The brothers continued their casual chatting, rarely enjoying such a moonscape, occasionally mentioning childhood memories, with Xiao Zi chiming in from time to time, causing constant laughter on the ship.<br/><br/>rne nlgnt grew aeeper.<br/><br/>The Law Ship traveled a thousand Li a day. It wasn’t particularly fast, but not too slow either, mainly because Fang Wang and the others were first-timers at sea and proceeded cautiously.<br/><br/>The previous few days were uneventful, with no encounters with formidable monsters or other cultivators.<br/><br/>The vast Canghai seemed to have only their ship left, with not even a single island in sight.<br/><br/>On the tenth day at sea.<br/><br/>“Look quickly!”<br/><br/>Xiao Zi exclaimed, causing Fang Wang, Fang Hanyu, and Zhao Zhen to open their eyes wide in disbelief.<br/><br/>All they could see on the eastern horizon was an immense entity, resembling a mountain on the move. On closer inspection, it turned out to be a black-furred elephant. Just the part of its body above the water was five hundred Zhang tall, and its two long and curved tusks were at least three hundred Zhang. It was an exaggerated sight.<br/><br/>Most crucially, all four of the elephant’s limbs were submerged in the water, hidden from view.<br/><br/>“What level of monster is this?” Zhao Zhen couldn’t help asking.<br/><br/>Xiao Zi replied, “I’m not sure, but it’s definitely the strongest monster I’ve ever seen. ”<br/><br/>As soon as Xiao Zi’s words fell, a powerful divine consciousness swept over them, causing Fang Hanyu to stand up abruptly, fearing that the monster might attack.<br/><br/>Fang Wang also stepped out of the pavilion, gazing towards the distant colossal demon.<br/><br/>The black-furred demon elephant glanced at them without taking any action. Even this one look brought enormous pressure to Fang Hanyu, Xiao Zi, and Zhao Zhen.<br/><br/>Fortunately, the demon elephant was moving in a different direction than theirs. After a while, it disappeared at the edge of the sea.<br/><br/>Xiao Zi let out a sigh of relief.<br/><br/>Fang Hanyu remarked, “The sea is indeed dangerous. Thankfully, these monsters are not as aggressive as those on land.”<br/><br/>Zhao Zhen chuckled and said, “That’s not necessarily true. It’s just because there are stronger beings here. Do you think it was looking at us just now? No, it was looking at the master.”<br/><br/>Upon hearing this, Fang Hanyu and Xiao Zi turned their heads to find Fang Wang surrounded by strands of white aura.<br/><br/>Fang Wang promptly closed his Heavenly Gang Acupoint, restoring his normal blood circulation, and calmly said, “That demon is strong, probably even stronger than the Carefree Immortal. We’re not lucky; such creatures should be rare, or else those cultivators who traveled south would have perished in great numbers. ”<br/><br/>Fang Hanyu felt the reasoning was sound and became even more curious about Fang Wang’s strength.<br/><br/>It seemed that when confronting the Carefree Immortal, Fang Wang had not exerted his full power.<br/><br/>Such a terrifying monster was actually scared away by Fang Wang…<br/><br/>The Law Ship continued forward, heading in the direction Fang Wang had pointed out. Using the Yellow Glyph Sword Sovereign Order, Fang Wang predicted they would need to travel for another month.<br/><br/>However, along the way, monsters appeared from time to time, and generally, they were all quite strong. Because of their wariness toward Fang Wang’s presence, these creatures would watch for a while before retreating.<br/><br/>Seven days later.<br/><br/>A monstrous bird with a wingspan of a hundred Zhang soared overhead. Its body was like that of a fish, its wings like those of an eagle, and its tail like that of a lion. As it flapped its wings, fierce winds howled fiercely.<br/><br/>At this point, Fang Hanyu could not sit still any longer and immediately called for Fang Wang.<br/><br/>Fang Wang went up to the deck, his black clothes flapping in the sea breeze. His gaze turned to the distant horizon; he could feel the demonic Qi growing heavier from all directions.<br/><br/>This suggested that the monsters they had encountered earlier might be sentinels, with a large number of them surrounding them from under the sea.<br/><br/>“Could there be something on the ship that is attracting them?” Zhao Zhen speculated.<br/><br/>Fang Wang’s first thought was of himself. Could it be that the qi and blood of his Heavenly Body were too powerful?<br/><br/>But that was not right; the more powerful it was, the less likely those weak monsters would dare to approach.<br/><br/>Suddenly, Fang Wang looked toward Xiao Zi.<br/><br/>Fang Hanyu and Zhao Zhen could not help but follow his gaze, seeing Xiao Zi lying on the railing with blinking serpentine eyes, looking innocent.<br/><br/>“Young master, what do you mean by that? You don’t think it’s me attracting them, do you?” Xiao Zi said with grievance.<br/><br/>Fang Wang did not reply but just stared steadily at Xiao Zi.<br/><br/>All along, he had felt that Xiao Zi was no ordinary creature. This fellow was not afraid of poison or evil spirits, could rapidly strengthen itself by consuming the flesh and blood of monsters, and had mastered many spells from the Great Saint’s Grotto-Heaven.<br/><br/>Moreover, this creature had not been able to transform…<br/><br/>No matter how one looked at it, Xiao Zi did not seem like an ordinary serpent monster…<br/><br/>Xiao Zi, frightened by Fang Wang’s gaze, immediately jumped onto Fang Wang’s shoulder and rub his face with its serpent head, acting spoiled, “Young master, it’s really not me, I’m also unclear about why so many monsters are approaching…”<br/><br/>Fang Wang grabbed it and lifted it in front of him, asking, “Are you sure you fell into the Great Saint’s Grotto-Heaven by accident? And those evil spirits, why did they capture you instead of killing you?”<br/><br/>Xiao Zi widened its snake eyes and muttered, “Sure… I guess… It seems like that was the case…”<br/><br/>The more it spoke, the less convinced it sounded.<br/><br/>Fang Wang couldn’t help but roll his eyes, while Fang Hanyu and Zhao Zhen also felt surprised.<br/><br/>Could it be that these monsters were approaching because of Xiao Zi?<br/><br/>Now that they thought about it, they too felt that this serpent monster was off.<br/><br/>They had never seen such a serpent with profound and unfathomable strength. Also, for a non-transformed creature, its personality was too lively, almost as if a human had taken possession of a serpent’s body.<br/><br/>Facing Fang Wang’s scrutiny, Xiao Zi helplessly said, “Alright, I admit I have no recollection of anything before my cultivation. I just encountered so many monsters and cultivators who stumbled into the Great Saint’s Grotto-Heaven that I assumed I had accidentally fallen in as well…”<br/><br/>“Then why did you make up such a believable story?” Fang Wang retorted coldly.<br/><br/>“If I didn’t make it believable, I was afraid you would kill me. Young master, you have such a heavy hand. That sword thrust you gave me back then still hurts…” Xiao Zi said with a grievance.<br/><br/>Fang Wang was at a loss for words.<br/><br/>Xiao Zi hastily added, “Young master, I truly have no idea why they are fixating on me. I’m unaware of my own origins… please, don’t be angry!”<br/><br/>Having been with Xiao Zi for so many years, Fang Wang naturally wouldn’t really be angry, but he was very curious about Xiao Zi’s true background.<br/><br/>Thinking about it, Fang Wang had encountered an Artifact Spirit within the<br/><br/>Zhui Tian Secret Realm but did not come across one in the Great Saint’s Grotto-Heaven.<br/><br/>On closer thought, aside from him bringing a living creature out, he had not heard of any other cultivator bringing out creatures from inside.<br/><br/>Could it be…<br/><br/>Fang Wang’s gaze toward Xiao Zi changed, causing Xiao Zi to tremble with fear.<br/><br/>“Young master, don’t kill me. I swear I’ll be good. I won’t lie to you anymore…” Xiao Zi said with a crying tone.<br/><br/>Zhao Zhen, who had always been oppressed by Xiao Zi, showed a schadenfreude expression.<br/><br/>Fang Wang let go of it and said, “Then you should try to recall carefully, and see if you can remember anything.”<br/><br/>Fang Hanyu walked to the edge of the ship, looking into the distance, and said, “Fang Wang, if this continues, we will eventually be trapped.”<br/><br/>Fang Wang was not worried; he calmly said, “Navigating the sea requires more resources; it’s an excellent opportunity to kill these monsters for their cores and to improve our combat abilities. Han Yu, you aren’t scared, are you?”<br/><br/>“Scared? Impossible!”<br/><br/>Fang Hanyu immediately took out his sword, ready and eager for battle. Zhao Zhen asked, “Should we strike first?”<br/><br/>Fang Wang replied, “With such a formation, these monsters surely have a leader behind them. Rather than waste Spiritual Power, it’s better to wait for it to show itself. Once we kill it, our predicament will naturally be resolved..”\t\t\t\t\t\t</div>", "images": {}, "success": true}