{"id": 140, "url": "https://www.novelhall.com/i-became-an-immortal-on-mortal-realm-32879/14302025.html", "title": "Chapter 140 - Chapter 140: Chapter 137: Nine Dragons Tyrant Fist Great Perfection", "volume": 2, "volume_title": "Volume 2", "body": "<h1>Chapter 140 - Chapter 140: Chapter 137: Nine Dragons Tyrant Fist Great Perfection</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 140: Chapter 137: Nine Dragons Tyrant Fist Great Perfection<br/><br/>Translator: 549690339<br/><br/>The Heavenly Sect has dominated the ocean for five thousand years, and among the righteous paths, it is considered a rather domineering sect that never tolerates even a speck of sand in its eyes.<br/><br/>Now that the traitor has harmed the disciples of the Heavenly Sect, most of the higher-ups are filled with righteous indignation.<br/><br/>The plump Daoist who spoke up for junior brother Ye was quickly silenced by the denouncements of the others and did not dare to bring up taking Ye back into the sect.<br/><br/>Linya Daoist slowly opened his eyes, looked at everyone in the hall, and said, “Since that’s the case, then we must capture Ye Canghai and by the way, investigate the Jin Xiao Sect. If Ye Canghai could be entrusted by the Jin Xiao Sect, it must be extraordinary, perhaps originating from other seas or continents.”<br/><br/>Upon hearing this, the cultivators agreed immediately.<br/><br/>A female cultivator stood up and said, “Sect Master, the Sword Sovereign of the Yellow Glyph has resided on Biyou Island for three years. Should we send someone to visit him? He has obtained the Yellow Glyph Sword Sovereign Order from the Sword Saint, so his strength must be extraordinary. If he could give guidance to our disciples, it would be beneficial.”<br/><br/>At the mention of the Sword Sovereign of the Yellow Glyph, the expressions of everyone in the hall became subtle.<br/><br/>Ever since Fang Wang moved to Biyou Island, many have paid attention, hoping to take the opportunity to win over Fang Wang, but unfortunately, there has been no chance.<br/><br/>Linya Daoist said, emotionless, “We must not disturb him. The Sword Sovereign of the Yellow Glyph possesses profound cultivation, and most crucially, we cannot discern if he is righteous or evil. We cannot allow our disciples to go astray. With the Sword Sovereign of the Yellow Glyph residing at the Heavenly Sect, we have already got an advantage; we should not harbour inappropriate desires. Since ancient times, the Warlords of the Eternal Life Pavilion have not been easy to provoke, because this status is earned through battle.”<br/><br/>His words won the approval of many.<br/><br/>Someone exclaimed, “The Sword Saint ranks among the top two within the<br/><br/>Warlords of the Yellow Glyph and could even be on par with the Xuanzi Bingjun. That such a figure could lose the possession of the Sword Monarch Order.”<br/><br/>The others chimed in.<br/><br/>“Maybe the Sword Saint’s time was drawing near, and he voluntarily passed it on to another.”<br/><br/>“You’re thinking too much. Even if he did pass it on, the recipient must possess the strength to gain the Sword Saint’s approval, otherwise it would be easy to lose the order.”<br/><br/>“It’s a pity; we follow the righteous path and maintain good relations with the<br/><br/>Eternal Life Pavilion, otherwise, I too would like to contend for the Yellow<br/><br/>Glyph Sword Sovereign Order.”<br/><br/>“Haha, the Warlord’s Commands of the Eternal Life Pavilion are the hardest to seize. After so many years of succession, each Warlord is a dominant figure in their own realm, and many have significant backgrounds. Be careful not to play with fire and get burned.”<br/><br/>Qu Xunhun did not reveal the relationship between Fang Wang and the Sword Saint, which led the Heavenly Sect to believe that Fang Wang had taken it by force from the Sword Saint.<br/><br/>Linya Daoist closed his eyes, and the elders began to discuss other matters.<br/><br/>The influence of the Heavenly Sect is distributed over a wide range, involving countless matters, so each meeting involves lengthy discussions.<br/><br/>Biyou Island.<br/><br/>Having broken through to the second level of the Cross-Void Realm, Fang Wang cultivated for five more years before reaching the third level of the Cross-Void Realm.<br/><br/>He was eighty-three years old; his pace of cultivation was considered fast. The genius of the Heavenly Sect took two hundred years to reach the Golden Body Realm, while he was certain to reach it before the age of one hundred fifty.<br/><br/>On this day, Fang Wang rose and walked in the mountains and fields.<br/><br/>It must be said, Zhao Zhen had quite a talent for planting. He arranged the Heavenly Materials and Earthly Treasures by different types, with certain color distinctions, turning the hillsides behind the pagoda buildings colorful and diverse.<br/><br/>After a while.<br/><br/>Fang Wang arrived at a cliff where he could overlook Spirit Eye Lake and most of Biyou Island. The view was expansive; as he looked out, the mist shrouding Biyou Island would slowly become transparent with his gaze, allowing him to see the situation on the sea clearly.<br/><br/>Xiao Zi was in the sea, followed by a large group of shrimp, crabs, and fish, like they were patrolling Biyou Island.<br/><br/>Fang Wang found it amusing and watched for a while before withdrawing his gaze.<br/><br/>He raised his right fist and looking at it, fell into deep thought.<br/><br/>He was contemplating how to combine the Mountain River Town Heaven Fist and the Nine Dragons Divine Transformation Art. With the time he spent in the Heavenly Palace, his actual lifespan had exceeded five thousand years, with the vast majority of that time dedicated to cultivation. This experience had drastically transformed his comprehension; after all, people do grow.<br/><br/>Fang Wang did not throw a punch; he just stood quietly on the cliff in contemplation.<br/><br/>As he entered a state of self-forgetfulness, day turned to night, and dusk fell. From beginning to end, he did not move; he seemed as if he was frozen in place.<br/><br/>At the pagoda, Xiao Zi looked toward Fang Wang in the distance and asked curiously, “What is the young master thinking about?”<br/><br/>Zhao Zhen lay on the Soul Devouring Gourd, reclining to one side, and yawned, saying, “Maybe he’s comprehending the Dao. It is said that highly skilled cultivators sense the natural world and create their own cultivation techniques. ”<br/><br/>Xiao Zi drew back her gaze and looked at Zhao Zhen, flicked her tongue out, and said, “I plan to train an army of Demon Soldiers; you’ll teach them cultivation when you’re free.”<br/><br/>At this, Zhao Zhen rolled his eyes, unamused, and responded, “Those shrimp and crab generals you’ve picked have the intelligence of three or four-year-old children; how can they cultivate? Besides, I’m human, not a demon, and I don’t understand Demon Spells.”<br/><br/>Xiao Zi huffed, “It’s precisely because their intelligence is low that I want you to teach them. I only need to impart the technique to you, then you’re responsible for training them until they learn. You don’t have the right to refuse.”<br/><br/>Zhao Zhen fell silent.<br/><br/>Without waiting for a response, Xiao Zi began to teach the methods of Qi Gathering for demons.<br/><br/>The night on Biyou Island was like water, not at all desolate, filled with the chirping of insects and the sound of waves crashing from all directions.<br/><br/>A night went by, with Fang Wang remaining unmovable.<br/><br/>And so, a full ten days passed.<br/><br/>Fang Wang moved his feet, facing the sea. He took a deep breath, throwing a punch from his waist. He controlled his Spiritual Power so well to avoid damaging Biyou Island.<br/><br/>With one punch, a Qi Dragon burst forth from his fist, but alas, just ten feet out, it dissipated.<br/><br/>Fang Wang was not discouraged and continued to try.<br/><br/>The Mountain River Town Heaven Fist and the Nine Dragons Divine Transformation Art were both extremely fierce spells, the former aimed at the physical body and space, while the latter was the ultimate destructive force, even capable of damaging souls, evil spirits, and formations.<br/><br/>If combined, the two would truly achieve the capability of breaking all things.<br/><br/>On this day, Fang Wang threw tens of thousands of punches, consuming nearly half of his Spiritual Power. Even on Biyou Island, he dared not let himself be in a state of spiritual deficiency, so he began to gather Qi to restore his Spiritual<br/><br/>Power.<br/><br/>As he gathered Qi, he pondered.<br/><br/>An idea suddenly sprang to mind.<br/><br/>If he could merge the Mountain River Town Heaven Fist and the Nine Dragons Divine Transformation Art into a practicable Spell, would he be able to enter the Heavenly Palace, where, with its blessing, he would surely train faster than if he practiced bit by bit?<br/><br/>Moreover, entering the Heavenly Palace would save time!<br/><br/>As soon as the thought came to him, Fang Wang started to work on it; he no longer contemplated how to merge the full power, but rather how to combine the two methods of circulating Qi.<br/><br/>Every Spell is cast from the inside out, with the pathway of absorbing Spiritual Energy and mobilizing Spiritual Power, and the sequence through the meridians determining whether the Spell can be cast.<br/><br/>He began to meditate deeply.<br/><br/>At this moment, he finally felt what it was like to be a Cultivator seeking the way, daily delving into the Dao without a care for worldly affairs.<br/><br/>Time swiftly passed by.<br/><br/>In the blink of an eye.<br/><br/>Two months had passed.<br/><br/>This day, Fang Wang once again combined a new set of Cultivation Techniques, having failed countless times before, but this time, he suddenly felt the world spinning around him and, abruptly opening his eyes, found himself inside the Heavenly Palace.<br/><br/>A smile broke across his face.<br/><br/>It worked!<br/><br/>“Indeed, the tests by the Great Saint are not pointless actions. It turns out it was here…” Fang Wang sighed in his heart. For this fusion of Spells, he used the method he had practiced while training in the Heavenly Gang Saint Body Technique.<br/><br/>The practice method of the Heavenly Gang Saint Body Technique was confusing, with its dazzling array of sequences that made it difficult to discern the correct method. In reality, however, the key to practice was on the walls, much like how the key points of merging two Spells were in his mind. He tried over and over again using his previous methods and finally succeeded.<br/><br/>It has to be said, the Heavenly Palace was quite domineering.<br/><br/>Only he could do such a thing; if it were someone else, even if they had the idea, it would be difficult to be sure if their idea was feasible unless they tried every creative thought over time. But how many years does one have in a lifetime?<br/><br/>This success provided a new approach for integrating Cultivation Techniques in the future.<br/><br/>Fang Wang stopped thinking further and sat down to meditate, reviewing the latest fusion of Cultivation Techniques. In an instant, more and more insights emerged in his mind, providing him with even more ideas.<br/><br/>His method of merging was somewhat rough, but with the help of the Heavenly Palace, the new Spell became exquisite and profound.<br/><br/>After sitting in meditation for several hours, Fang Wang organized the brand new Cultivation Technique and began to cultivate this fist technique.<br/><br/>With the foundation of Great Perfection’s Mountain River Town Heaven Fist and the Nine Dragons Divine Transformation Art, Fang Wang cultivated the new technique with ease.<br/><br/>It took him less than five years to master the new fist technique.<br/><br/>However, to cultivate it to the Great Perfection Realm would still take time.<br/><br/>Great Perfection represented the most perfect state of the technique and its limit. Even the creator could not reach the limit at the outset.<br/><br/>The Heavenly Palace knew not of years or months.<br/><br/>By the time Fang Wang had cultivated the new fist technique to the Great Perfection Realm, he looked back to find that fifty-six years had passed.<br/><br/>Fang Wang muttered to himself, “I’ll call it Nine Dragons Tyrant Fist.”<br/><br/>As his words fell, his vision blurred.<br/><br/>When he opened his eyes again, he was back on the cliff top.<br/><br/>He stood up, stretched lazily in the bright sunlight.<br/><br/>Comfy!<br/><br/>These fifty-six years had been the most enjoyable for him, not boring in the slightest!<br/><br/>After merging the Nine Dragons Divine Transformation Art and the Mountain River Town Heaven Fist into the Nine Dragons Tyrant Fist, it was not just a simple combination—the power was now even more terrifying!<br/><br/>Fang Wang was already looking forward to the invasion of the Demon Palace, his fists unleashing like dragons, rampaging through the Demon Soldiers.<br/><br/>He leaped up, soaring like a white crane into the sky, flying directly to the pavilions.<br/><br/>Fang Wang landed beside Xiao Zi and asked, “Are you bullying Zhao Zhen again?”<br/><br/>Xiao Zi was practicing, startled by his sudden appearance, and quickly replied, “Not at all. I’m just getting him to help train the Demon Soldiers. Master, Biyou Island is so vast; we should train a force of Demon Soldiers to protect the island and also help us gather intelligence on the outside.”<br/><br/>Fang Wang picked it up, rubbing its snake head, and said, “I have no objections to training Demon Soldiers, but don’t keep oppressing him. Think about it, have I ever overexploited you?”<br/><br/>Upon hearing this, Xiao Zi blinked and replied, “Alright, I’ll bully him less from now on.”<br/><br/>Afterward, Fang Wang inquired about Xiao Zi’s condition and whether it felt anything special about its bloodline.<br/><br/>Xiao Zi answered truthfully, saying that ever since it knew it had a True Dragon Bloodline, it had been extremely excited. Unfortunately, no matter what it did, it could not transform into a dragon, and now it could only hope for advancement in its cultivation.<br/><br/>Perhaps when its realm was higher, it would naturally become a dragon.<br/><br/>As they chatted, Xiao Zi noticed that Fang Wang seemed in a very good mood, making it feel ticklish all over..\t\t\t\t\t\t</div>", "images": {}, "success": true}