{"id": 149, "url": "https://www.novelhall.com/i-became-an-immortal-on-mortal-realm-32879/14303289.html", "title": "Chapter 149 - Chapter 149: Chapter 146: Southern Celestial Four Heroes, Sword Qj Dead Sea", "volume": 2, "volume_title": "Volume 2", "body": "<h1>Chapter 149 - Chapter 149: Chapter 146: Southern Celestial Four Heroes, Sword Qj Dead Sea</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 149: Chapter 146: Southern Celestial Four Heroes, Sword Qj Dead Sea<br/><br/>Translator: 549690339<br/><br/>Zhu Yan indeed wasn’t boasting; when it came to matters of the sea, he knew a great deal and spoke at length about Jiu You True Person. He recounted all the deeds of Jiu You True Person since the time he became renowned.<br/><br/>Born in an archipelago academy, Jiu You True Person first became famous for stealing the academy’s treasure and killing the academy’s head. After that, he disappeared for fifty years, and when he reappeared, he had achieved the Condensation Spirit Realm. By executing Sword Sovereign of the Yellow Glyph, his name spread far and wide.<br/><br/>Later on, Jiu You True Person executed the Sword Sovereigns with the characters Xuan, Di, and Tian, advancing step by step to a high position in the Eternal Life Pavilion. The reason for his controversy was that all the opponents he killed were his close friends.<br/><br/>“This man killed his master and his friends, stopping at nothing to rise to power, which I greatly disdain. However, my father actually admires him, saying that no matter what means he uses, at least he has always been growing stronger. Perhaps he could become one of the strongest beings in this world.” As Zhu Yan said this, he was visibly indignant.<br/><br/>Xiao Zi couldn’t help but dart over, saying, “He is indeed stronger than you. You foolishly challenged my master and kept saying you weren’t afraid of dying, but what was the result?”<br/><br/>Zhu Yan’s face instantly turned crimson, and he was very angry. Yet in front of Fang Wang, he dared not make a scene and could only lower his head.<br/><br/>Fang Wang glanced at Xiao Zi, frightening her into shrinking back.<br/><br/>This fellow’s bearing is insufficient. If he were let loose, even if he became a Demon King, he would probably be betrayed and executed by his own subordinates one day.<br/><br/>Better to keep him by my side for entertainment!<br/><br/>Fang Wang looked at Zhu Yan, saying, “The karma between you and me prevents me from making you my disciple, but I do need a mount. If you are willing, I will do my best to cultivate you without stinting on my legacy. If you’re unwilling, then leave.”<br/><br/>Zhu Yan suddenly looked up, his expression one of astonishment.<br/><br/>His face changed rapidly from green to red. He felt humiliated, yet he could not bear to leave. After the previous battle, he was convinced that Fang Wang was even stronger than his own father—such an aura he had never encountered before. He even believed that Fang Wang possessed unimaginably powerful body cultivation techniques.<br/><br/>Xiao Zi urged, “If you feel humiliated, then leave quickly!”<br/><br/>Zhao Zhen floated over, saying, “Yes, being a mount is quite shameful. After all, he is a favored son of heaven who has enjoyed riches and pleasures to the extreme. Even if the chance to become an immortal through longevity were in front of him, the price would be enduring hundreds, or even more, years of tedium. Not just this favored son of heaven, but even ordinary mortals like me would give up.”<br/><br/>Zhu Yan took a deep breath, looked at Fang Wang, and said solemnly, “Senior, please forgive my impudence. The matter of becoming a mount isn’t just about me—it would also affect my father’s reputation. Could you please show me your true strength, at least to give me the resolve to face my father later on?” His gaze was intense as he stared at Fang Wang, filled with expectation.<br/><br/>Fang Wang smiled, saying, “Since that’s the case, I’ll let you feel my cultivation state.”<br/><br/>After speaking, he closed his eyes.<br/><br/>Zhu Yan was puzzled—what was there to see about a cultivation state?<br/><br/>Just then, Fang Wang suddenly radiated a vast aura. As it rose crescendo by crescendo, nature’s spiritual energy surged madly into his body. Zhu Yan’s eyes widened, and his mouth slowly dropped open.<br/><br/>What kind of Qi Gathering speed is this?<br/><br/>And this aura…<br/><br/>Gazing at Fang Wang, who was surrounded by white flames, Zhu Yan suddenly saw an indefinable radiance that inexplicably gave him the urge to bow down in worship.<br/><br/>“Senior… I… I think I can make a decision now…”<br/><br/>Clouds and winds surged above the sea, where every year, people stirred up the winds of change in the world. As the Sword Sovereign of the Yellow Glyph retreated into seclusion for many years, his fame began to wane, while other figures captured the attention of the world.<br/><br/>Canglan Academy.<br/><br/>Beyond the cultivation, disciples of the Saint Talent Hall began to discuss worldly matters again. They were seated in meditation, cultivating and conversing simultaneously.<br/><br/>“Have you heard? The Southern Celestial Four Heroes, a once-in-a-century event, have emerged, and our region has no one on the list.”<br/><br/>“I’ve heard. They are Chen Shang, Dugu Wenhun, Ji Haotian, and Zhu Yan the<br/><br/>Immortal.’<br/><br/>“I haven’t heard of them—are they that strong?”<br/><br/>“All four of them are transcendental beings who have surpassed the Golden<br/><br/>Body Realm, and success depends on being under five hundred years old.”<br/><br/>“Hiss—these people surpassed the Golden Body Realm in less than five hundred years? That’s just preposterous!”<br/><br/>Gu Li was cultivating with her eyes closed, likewise listening.<br/><br/>The Southern Celestial Four Heroes, a title that sounded quite impressive.<br/><br/>She decided to include this information in her letter, believing Fang Wang would be very interested in such a title.<br/><br/>Suddenly, someone curiously asked who among the four should be considered the leader of the Southern Celestial Four Heroes.<br/><br/>Someone said, “Naturally, it’s Zhu Yan the Immortal, one of the twenty-four real people of the Eternal Life Pavilion, and his strength is second to none.”<br/><br/>Others had different opinions, “I think Dugu Wenhun has the qualifications to be the leader of the Four Heroes. He alone stormed into the Grand Yu Dynasty, executed Qiyun Tianzi under everyone’s gaze, and then left with poise. Although a hundred years have passed, the tale is still widely spread!”<br/><br/>“Chen Shang was born in the Soul Sculpting Realm, possessed a Heaven Yuan<br/><br/>Spirit Treasure, and lost it to someone else. Later, he reforged a Heaven Yuan<br/><br/>Spirit Treasure at the Spirit Elixir Realm. Already able to contend with the Golden Body Realm in the Condensation Realm, who knows how terrifying his strength is now? Although he doesn’t have many battle achievements, his innate talent is definitely the highest!”<br/><br/>“Ji Haotian, from a Qiyun Tianzi to a Cultivator, naturally possesses the True Dragon aura, impervious to demons. He once fought five Golden Body Realm cultivators and was undefeated. Besides, he is the only one among the four with a large sect’s backing; he should be the leader of the Four Heroes!”<br/><br/>Disciples with humble family backgrounds listened as scions of great families discussed the Southern Celestial Four Heroes, all revealing longing expressions.<br/><br/>The Southern Celestial Four Heroes, indeed, each one stood out from the crowd.<br/><br/>Some people wondered if Chu Yin would become one of the Southern Celestial Four Heroes, which quieted the yard down.<br/><br/>Heaven Yuan Spirit Treasures were rare, but possessing one didn’t guarantee becoming one of the Southern Celestial Four Heroes!<br/><br/>Since Chu Yin was not in the yard, the disciples were silent; if he were there, surely they would be singing his praises.<br/><br/>Just then, an elder descended from the sky, landing in the courtyard. All the disciples rose to their feet and bowed respectfully to him.<br/><br/>The elder held a horsetail whisk, exuding an immortal aura and daoist bones. He looked around at everyone and slowly asked, “Is there anyone who wishes to devote themselves to the path of sword cultivation?”<br/><br/>No sooner had he spoken, a number of disciples stood up, a full third of those present, including Gu Li.<br/><br/>The elder smiled with satisfaction and said, “The Sword Qi Dead Sea is about to recede, and the Jianhun Tomb will soon appear. Canglan Academy is preparing to lead disciples to seek the Sword Soul opportunities. We depart today; those who wish to go, get your belongings ready!” The Sword Qi Dead Sea, the Jianhun Tomb!<br/><br/>Most disciples appeared puzzled, but a very few were excited.<br/><br/>Gu Li had not heard of the Jianhun Tomb, but the words “Sword Soul opportunity” were fatally attractive for a sword cultivator like her.<br/><br/>To catch up with Fang Wang, she needed to seek opportunities to make up for the gap in talent!<br/><br/>Having arrived at sea, she heard many tales of defying the heavens and changing fate. As long as one was young, everything was hopeful!<br/><br/>After Zhou Xue’s departure, Fang Wang devoted himself to cultivation. His goal was to reach the Golden Body Realm within thirty years to have a better chance of dealing with Jiu You True Person in the Eternal Life Pavilion trial.<br/><br/>After witnessing Fang Wang’s cultivation stance, Zhu Yan willingly became Fang Wang’s mount, and Fang Wang did not disappoint him, directly passing on the True Combat Technique to Zhu Yan.<br/><br/>Zhu Yan had a powerful physical body but lacked temperament; the True Combat Technique was perfect for ensuring he maintained a pure combat heart during battles.<br/><br/>Excited by the heritage of the True Combat Technique, Zhu Yan felt fortunate, as it was his first encounter with such a cultivation technique dedicated to combat, and he was more grateful for his decision.<br/><br/>Following the Sword Sovereign of the Yellow Glyph, he might truly obtain the fate to achieve immortality.<br/><br/>Fang Wang also learned about Zhu Yan’s lineage: he was a half-breed, his father being a Roc Bird from the top echelons of demon bloodlines, though not as powerful as the ancient Rocs. His mother was a fox spirit.<br/><br/>This made Fang Wang marvel—the Cultivation World had no reproductive barriers.<br/><br/>Although Zhu Yan was a half-breed, his true form was that of a Roc Bird, a mutated one, and his talent surpassed that of most of his siblings.<br/><br/>Time passed.<br/><br/>In the blink of an eye.<br/><br/>Ten years flew by.<br/><br/>Fang Wang had reached the eighth layer of the Cross-Void Realm, with twenty more years to break through to the Golden Body Realm.<br/><br/>One day, Qu Xunhun visited Fang Wang, bringing the Heavenly Dao Spirit Stones that he had been wanting.<br/><br/>In Grand Qi, Heavenly Dao Spirit Stones were rare, monopolized by the major sects, but at sea, they were not such scarce items.<br/><br/>Qu Xunhun glanced at Zhu Yan, who was cultivating by the lake not far away, then turned to Fang Wang and said, “Sword Lord, would you like to hear about the recent major events at sea?<br/><br/>Since he had come, he naturally wanted to perform well.<br/><br/>The inclusion of Zhu Yan in Fang Wang’s ranks made Qu Xunhun more respectful and expectant of Fang Wang.<br/><br/>“Let’s hear it,” Fang Wang said as he took a storage bag and checked the Heavenly Dao Spirit Stones inside.<br/><br/>There weren’t just one or two Heavenly Dao Spirit Stones but thousands. They could be piled into a Suling Platform. Heavenly Dao Spirit Stones could automatically absorb nature’s spiritual energy. Once the Suling Platform was built, there was no more worry.<br/><br/>Qu Xunhun began to speak of the turbulent affairs at sea, starting with the Southern Celestial Four Heroes.<br/><br/>Fang Wang was especially interested in the name Ji Haotian and wondered about his relation to Ji Rutian. As for the other three, it was his first time hearing of them.<br/><br/>Then, Qu Xunhun mentioned the Jianhun Tomb of the Sword Qi Dead Sea.<br/><br/>“The Sword Qi Dead Sea recedes every few hundred years, and this time, a million sword cultivators went to compete for the Sword Soul opportunities.<br/><br/>However, the most dramatic part of this Sword Soul struggle was that the one who seized the Ten Thousand Year Sword Spirit was a young cultivator who had just stepped into the Condensation Spirit Realm, by the name of Fang Hanyu, ” Qu Xunhun remarked with amazement.<br/><br/>“What? Fang Hanyu?” Xiao Zi suddenly rushed over, and Zhao Zhen and Zhu Yan also curiously listened as Qu Xunhun recounted the affairs at sea.<br/><br/>Qu Xunhun was taken aback and asked, “Could it be that Sword Lord knows Fang Hanyu?”<br/><br/>Instead of responding, Fang Wang asked, “What is the Ten Thousand Year Sword Spirit?”<br/><br/>Qu Xunhun replied, “A Sword Soul is the obsession that remains after a sword cultivator’s death, containing one’s Sword Intent. The longer it exists, the stronger the Sword Soul becomes. In this competition, only Fang Hanyu obtained the Ten Thousand Year Sword Spirit. He comes from the Chenjian Sect, but those protecting him weren’t from the sect; rather, they were several powerful cultivators with mysterious origins.”<br/><br/>“Now the name of Fang Hanyu has spread throughout the world, and countless sword cultivators desire to seize the Ten Thousand Year Sword Spirit within him..”\t\t\t\t\t\t</div>", "images": {}, "success": true}