{"id": 144, "url": "https://www.novelhall.com/i-became-an-immortal-on-mortal-realm-32879/14302615.html", "title": "Chapter 144 - Chapter 144: Chapter 141 Great Perfection Of Heavenly Dao", "volume": 2, "volume_title": "Volume 2", "body": "<h1>Chapter 144 - Chapter 144: Chapter 141 Great Perfection Of Heavenly Dao</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 144: Chapter 141 Great Perfection of Heavenly Dao<br/><br/>True Skill, Surpassing the Great Saint [Third Release, Seeking Monthly Votes]<br/><br/>Translator: 549690339<br/><br/>Fang Wang didn’t know when he had slipped into a state of self-forgetfulness.<br/><br/>In his eyes, there was no Biyou Island, no world, only the Heavenly Gang Saint<br/><br/>Body Technique, True Combat Technique, and the Yin Yang Xuan Ming Zhen Gong, which were constantly revolving before him, piecing together into new Cultivation Techniques.<br/><br/>With the existence of the Heavenly Palace, each time he created a new Technique, he didn’t cultivate it but cast it aside to start anew.<br/><br/>Again and again, in this way.<br/><br/>Then, one day.<br/><br/>He was jolted awake, feeling as if the world was spinning before his eyes. By the time he came to his senses, he was already inside the Heavenly Palace.<br/><br/>Fang Wang felt somewhat dazed, but after calming himself for a while, a smile appeared on his face.<br/><br/>He had finally succeeded!<br/><br/>“No wonder the sages of ancient times spent a thousand autumns reaching enlightenment, creating these Cultivation Techniques far more difficult than cultivating them.”<br/><br/>Fang Wang sighed with emotion. Without the Heavenly Palace, he felt that he could never have fused the Three Great True Cultivations in his lifetime. His success was because he didn’t need to cultivate to verify the effectiveness of his Techniques. If someone else tried to cultivate an inferior technique, they might go insane and perish.<br/><br/>He was only briefly contemplative; he soon began to organize his thoughts.<br/><br/>The Heavenly Gang Saint Body was an enhancement to the body, the True<br/><br/>Combat Technique elevated the spirit and senses, and the Yin Yang Xuan Ming Zhen Gong delved into the nature of the world. The world was divided into yin and yang; understanding yin and yang was key to understanding the Dao of the world.<br/><br/>What incredible effects would the fusion of the three bring about?<br/><br/>Fang Wang looked forward with anticipation.<br/><br/>Just organizing his thoughts took several years. During this time, the Heavenly Palace helped him perfect his Technique, making the new Cultivation Technique even more flawless.<br/><br/>Next was to cultivate the True Skill!<br/><br/>He initially thought it wouldn’t take much time on top of reaching Great Perfection in the Three Great True Cultivations. But Fang Wang had underestimated the challenge of cultivating this entirely new Technique.<br/><br/>By the time he reached minor accomplishment, he looked back and realized five hundred years had passed!<br/><br/>His heart began to tremble.<br/><br/>He clenched his teeth and continued to cultivate.<br/><br/>Another three hundred years went by before he cultivated the new Technique to Great Completion.<br/><br/>After mastering the Three Great True Cultivations, it took eight hundred years to reach Great Completion. It was hard to imagine how long it would take a normal person to reach this stage in their cultivation.No, perhaps they might never even achieve minor accomplishment!<br/><br/>However, the hardest part was progressing from Great Completion to Great Perfection!<br/><br/>Fang Wang’s initial surprise at the new Technique had been worn away by time, and his heart grew numb once again.<br/><br/>He didn’t know how he had persisted until he reached the Realm of Great Perfection. Looking back, he realized it had been one thousand four hundred and twenty years since he had first entered the Heavenly Palace.<br/><br/>This was the longest he had ever stayed!<br/><br/>Fang Wang’s eyes were empty, his entire being emanated a profound sense of twilight years, and he muttered to himself, “The fusion of the three Techniques truly mirrors the Heavenly Dao. Let’s call it the Heavenly Dao True Skill.”<br/><br/>As he spoke, everything before his eyes shattered, and his consciousness was pulled back to reality.<br/><br/>When he opened his eyes again, he saw Spirit Eye Lake and the fog-enshrouded sea in the distance, bright with light. He glanced around and happened to see Xiao Zi staring at him.<br/><br/>Their eyes met, and Xiao Zi’s heart trembled.<br/><br/>Could it be…<br/><br/>Xiao Zi was very sensitive to Fang Wang’s state and was shocked.<br/><br/>Had Fang Wang successfully fused the Mountain River Town Heaven Fist, the Nine Dragons Divine Transformation Art, and now even the Three Great True Cultivations?<br/><br/>Impossible!<br/><br/>How many years had it been?<br/><br/>Xiao Zi had stayed in the Great Saint’s Grotto-Heaven for over three hundred years and knew how difficult the Three Great True Cultivations were to master. Throughout history, only those who managed to cultivate one Technique stood supreme in the world, aside from the Great Saint who created them. Fang Wang was the first to master all three!<br/><br/>If he really did fuse the Three Great Techniques, he would have surpassed the Great Saint!<br/><br/>At that moment, Fang Wang emitted a fearsome and oppressive aura.<br/><br/>The Heavenly Dao True Skill automatically absorbed nature’s spiritual energy, constantly strengthening his Spiritual Power and vigor!<br/><br/>Fang Wang didn’t even need to cultivate deliberately. From now on, when he unleashed the Combat Heart, it wouldn’t consume Spiritual Power; he could harness the spiritual energy of nature, and the same applied when contemplating yin and yang. This meant he would save the consumption of Spiritual Power in future battles.<br/><br/>The Three Great True Cultivations didn’t include a powerful Inner Strength. If<br/><br/>Fang Wang were to merge the Solaris Scripture into the Heavenly Dao True Skill, he couldn’t imagine how fast he would cultivate, nor how his Spiritual Power would transform.<br/><br/>The strength of a Cultivation Technique lay not just in the speed of cultivation but also in the quality of Spiritual Power.<br/><br/>Many cultivators dominated their realm because their Spiritual Power was far stronger than others. Fang Wang’s Solaris Spiritual Power was an example of this.<br/><br/>As the Heavenly Dao True Skill was activated, the sea of clouds in the sky began to churn, gradually darkening and forming thunderclouds.<br/><br/>Not only above Biyou Island but across the entire sky of the Southern Celestial Sea, and even farther, the phenomenon occurred.<br/><br/>A terrifying Heavenly Might enveloped the earth, and countless beings looked up.<br/><br/>The Disciples of the Heavenly Sect did so, as did Gu Li and Chu Yin staying in the Canglan Academy, and Ye Canghai and Fang Xun who were on their way.<br/><br/>Fang Hanyu, who was comprehending the sword on the cliff, looked up to see thunderclouds rolling in the sky, drowning out the sound of the waterfall behind him.<br/><br/>He frowned, puzzled by what was happening.<br/><br/>In Grand Qi, at the Great Abyss Gate.<br/><br/>The doors to the Shiyuan Hall opened, Zhou Xue stepped out slowly, stopping before the stairs. Her delicate brows were furrowed, a look of astonishment in her beautiful eyes.<br/><br/>“A resonance with the Heavenly Dao, Divine Skills revealed… But this is the Mortal Realm, how could such a phenomenon appear?”<br/><br/>Zhou Xue was confused, realizing that fate had radically changed, and the course of humanity had deviated from the history of her previous life. She gazed at the thunderclouds in the sky and fell into deep thought.<br/><br/>At the same time.<br/><br/>In Grand Wei, within the Zhui Tian Secret Realm.<br/><br/>The white-haired elder who had once guided Fang Wang in practicing the<br/><br/>Mountain River Town Heaven Fist and the Heavenly Gang Saint Body Technique appeared by the lake, his brows furrowed as he made calculations with his fingers, but could deduce nothing.<br/><br/>“What’s going on… Could it be the descent of Heavenly Might from The Upper Realm? That shouldn’t be… I had clearly severed…” the white-haired elder muttered to himself, his face filled with worry.<br/><br/>Once the Heavenly Dao True Skill is invoked, the world undergoes extraordinary changes!<br/><br/>It can indeed shock the heavens and move ghosts and gods to tears!<br/><br/>On Biyou Island.<br/><br/>Fang Wang slowly rose to his feet, he could see that the phenomena in the sky covered an extremely far range, and there was no distinction of strength, which meant that no one would associate it with him.<br/><br/>Of course, there was one demon that would.<br/><br/>At this moment, Xiao Zi opened her huge snake mouth with a stunned expression.<br/><br/>The other little demons shivered and discussed amongst themselves what could have possibly happened.<br/><br/>Fang Wang did not sever the tie with the Heavenly Dao True Skill; he spread his arms wide, indulging in the baptism of nature’s spiritual energy.<br/><br/>He didn’t even need to actively cultivate; his cultivation level grew faster than the speed of meditative practice in former days.<br/><br/>This feeling was too wondrous, causing his numbed heart to stir slightly.<br/><br/>After fourteen hundred and twenty years of arduous cultivation, Fang Wang’s mentality had completely changed because he had experienced too much.<br/><br/>For instance, at this moment, he saw numerous spirits on Biyou Island kneeling and worshiping the celestial phenomena, which were not island ghosts but projections from the Underworld.<br/><br/>The phenomena caused by the Heavenly Dao True Skill not only affected the Mortal Realm but the Underworld as well!<br/><br/>“If the Heavenly Dao True Skill is like this, I wonder what becoming an Immortal feels like…”<br/><br/>Fang Wang thought this to himself with an impassive face.<br/><br/>After two integrations of different Cultivation Techniques, he had immense confidence in becoming an Immortal within the Mortal Realm.<br/><br/>Zhou Xue said that one cannot become an Immortal in the Mortal Realm and must ascend, but what if he merged all the Cultivation Techniques in the world, could he then become an Immortal on Earth?<br/><br/>Feeling the vast Heavenly Might, Fang Wang thought it might be possible.<br/><br/>It is not that the Mortal Realm cannot bear the existence of Immortal Gods but rather the Mortal Realm lacks the correct methods.<br/><br/>If this vast Heavenly Might can be withstood, what’s to prevent the birth of an Immortal God?<br/><br/>In that moment, a towering ambition rose in Fang Wang’s heart, his pupils turned golden, the effect of using the Heavenly Dao True Skill, or to be precise, Divine Skills.<br/><br/>The Yin and Yang of the world came into his view, leading his heart into an unprecedented state of openness.<br/><br/>Perhaps the reason one cannot become an Immortal in the human world is due to the lack of Heavenly Dao or Immortal Laws, but what if he became the Heavenly Dao of the Mortal Realm and pioneered Immortal Laws, could he perhaps overturn the order of the Upper and Lower Realms, subvert the Underworld beneath the Mortal Realm, and create a realm of True Immortals superior to The Upper Realm?<br/><br/>Fang Wang’s thoughts scattered as his ambition soared.<br/><br/>This time, he did not roar to vent his emotions; as the Heavenly Dao True Skill absorbed spiritual energy, the resentment in his heart dissipated.<br/><br/>He was refining the Heart of the Heavenly Dao!<br/><br/>Xiao Zi watched Fang Wang for a long time, and for some reason, it always felt that Fang Wang radiated a kind of brilliance.<br/><br/>If there truly were a divine aura of Immortality, perhaps it was the radiance emanating from him.<br/><br/>Zhao Zhen, holding the Soul Devouring Gourd, drifted over. He intended to ask Fang Wang what had happened, but upon seeing him, he couldn’t help but stop.<br/><br/>Standing on the wooden platform and looking up at the Firmament, Fang Wang’s posture was erect, his white clothes fluttering, and the sunlight shone upon him, preventing Zhao Zhen from approaching and even instinctively evoking a desire to worship.<br/><br/>He knelt down just like the spirits in Fang Wang’s eyes, staring dumbfounded at Fang Wang.<br/><br/>The Heavenly Dao True Skill, merging with the heavens and earth, peeks into the order of Yin and Yang!<br/><br/>The living beings in the Mortal Realm could only sense that his aura was mighty, whereas everything in the Underworld could feel his Heavenly Dao breath.<br/><br/>Of course, the Heavenly Dao aura on him was different from that of the Cultivation’s Heavenly Dao, which is ethereal; his Heavenly Dao breath, which he’d created, was like the midday sun in the Mortal Realm, burning hot and sacred.<br/><br/>Gradually, the little demons also noticed something unusual about Fang Wang.<br/><br/>Xiao Zi snapped out of her daze and hurriedly urged, “A Great Demon might be attacking, my children, follow me!”<br/><br/>Upon hearing this, the naive little demons immediately clamored and followed her away.<br/><br/>Fang Wang paid them no mind and continued to enjoy the cleansing of heaven and earth.<br/><br/>His physique was transforming; he was transcending the Heavenly Body, achieving an unprecedented type of constitution.<br/><br/>He immersed himself within it, observing Yin and Yang, transforming his Dao heart, reshaping a new worldview.<br/><br/>The celestial phenomena in the Firmament lasted for a full hour before dissipating, shaking the entire world.<br/><br/>As the phenomena vanished, Fang Wang’s momentum remained unchanged, and the speed at which he absorbed Spiritual Energy did not slow down, staying consistent as before.<br/><br/>The disappearance of the celestial phenomena seemed to prove that this world had acknowledged Fang Wang’s existence.<br/><br/>The sun set and the moon rose, night fell.<br/><br/>Fang Wang came to the beach, looking at the sea, his gaze piercing through it.<br/><br/>Water reflects everything and is also the boundary between the realms of Yin and Yang, and the sea is the largest boundary of them all.<br/><br/>Fang Wang was very interested in the Netherworld. He wondered if the Netherworld has its own order, or if the beings in the Netherworld were muddle-headed, waiting for the arrival of their reincarnation..\t\t\t\t\t\t</div>", "images": {}, "success": true}