{"id": 141, "url": "https://www.novelhall.com/i-became-an-immortal-on-mortal-realm-32879/14302026.html", "title": "Chapter 141 - Chapter 141: Chapter 138: Sooner Or Later A Renowned Name Across The Sea, Ye Canghai Arrives On The Island", "volume": 2, "volume_title": "Volume 2", "body": "<h1>Chapter 141 - Chapter 141: Chapter 138: Sooner Or Later A Renowned Name Across The Sea, Ye Canghai Arrives On The Island</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 141: Chapter 138: Sooner or Later A Renowned Name Across the Sea, Ye Canghai Arrives on the Island<br/><br/>Translator: 549690339<br/><br/>Having just completed practicing the Nine Dragons Tyrant Fist, Fang Wang gave himself a five-day vacation, during which he spent time with Xiao Zi and Zhao Zhen, teaching the magical creatures.<br/><br/>The little demons Xiao Zi had gathered were not large in size; none of them had transformed into human form, and only a very few could speak the human language. Spending time with these little demons, Fang Wang found himself enjoying their company.<br/><br/>After five days, Fang Wang returned to the Spirit Eye Lake to continue his cultivation.<br/><br/>Cultivation was the most important thing!<br/><br/>Fang Wang had thought about integrating cultivation techniques, but the difficulty was too great—it was not as simple as creating the Nine Heavens Tyrant Fist.<br/><br/>Even if the Three Great True Cultivations were integrated together, they still wouldn’t be Inner Strength. Fang Wang planned to add the Solaris Scripture to them next time.<br/><br/>What kind of unparalleled Divine Skill would result from combining the Three Great True Cultivations with the mysterious Solaris Scripture?<br/><br/>Fang Wang could not imagine, but just thinking about it made him feel the immense difficulty. It would be better to first increase his cultivation level.<br/><br/>After moving to Biyou Island, Fang Wang began to live the cultivation life he desired—undisturbed, able to farm, truly at ease.<br/><br/>It was half a year later when someone came to visit Fang Wang. It wasn’t just anyone—it was his personal envoy, Qu Xunhun.<br/><br/>Fang Wang took out the Biyou Jade Token and created an opening in the formation guarding the front of the island, allowing Qu Xunhun to enter.<br/><br/>Qu Xunhun flew swiftly to Fang Wang, gave a deep bow, and then said, “The<br/><br/>Heavenly Sect has run into quite a bit of trouble recently. Has it disturbed you?”<br/><br/>Fang Wang opened his eyes to look at him and said, “Not at all, what has happened?”<br/><br/>Qu Xunhun answered, “Two hundred years ago, a peerless genius of the Heavenly Sect, Ye Canghai, offended the Eternal Life Pavilion. As punishment from the Sect Master, he was imprisoned in the Northern Sea. This move allowed Ye Canghai to escape a deadly fate. In recent years, Ye Canghai suddenly  reappeared at sea and slaughtered many cultivators. Including disciples of the Heavenly Sect. Now the Heavenly Sect is pursuing Ye Canghai, who has taken refuge in a mysterious sect called the Jin Xiao Sect. Now every sect at sea is investigating the origins of the Jin Xiao Sect.”<br/><br/>Jin Xiao Sect?<br/><br/>Could Zhou Xue’s hand reach so far?<br/><br/>Fang Wang sighed to himself. He knew Zhou Xue would not stay idle; he had thought she would target the Heaven’s Larceny Saint Sect in the northern part of the continent, but he did not expect the Jin Xiao Sect to move southward.<br/><br/>Speaking of which, the Jin Xiao Sect has never shown the full extent of its vast number of cultivators, relying instead on individual strength of their cultivators. Reviewing the multiple actions of the Jin Xiao Sect, they have always been carried out by individuals or small groups. No one has ever seen the full extent of the Jin Xiao Sect’s power, and this has caused the sect to appear unfathomable.<br/><br/>“As Ye Canghai causes more and more trouble, other sects continue to pressure the Heavenly Sect. After all, the Heavenly Sect once sheltered Ye Canghai. If it weren’t for the Heavenly Sect, Ye Canghai would have died long ago, and none of these issues would have arisen. The current Heavenly Sect is in a state of disarray, constantly sending out disciples,” said Qu Xunhun, his words filled with a sense of irony at the twists of fate.<br/><br/>Fang Wang, curious, asked, “What realm is Ye Canghai in now?” Qu Xunhun replied, “The third layer of the Golden Body Realm.” “That high?” “If he wasn’t, would the Heavenly Sect have no way to deal with him?”<br/><br/>“True.”<br/><br/>Fang Wang suddenly became curious about whether Ye Canghai would attack the Heavenly Sect.<br/><br/>If Ye Canghai came to Biyou Island, should Fang Wang show mercy?<br/><br/>Qu Xunhun asked, “Does the Sword Lord have any instructions?”<br/><br/>Fang Wang shook his head and said, “No, thank you for coming to inform me about this.”<br/><br/>Qu Xunhun took out a Jade Slip and placed it in front of Fang Wang, saying, “This contains information about Ye Canghai. I shall take my leave now.” Fang Wang nodded, and Qu Xunhun immediately departed.<br/><br/>Once Qu Xunhun had left Biyou Island, Fang Wang then activated the True<br/><br/>Combat Technique and used his divine consciousness to inspect the Jade Slip.<br/><br/>It’s always wise to be cautious. Fang Wang remained vigilant around Qu<br/><br/>Xunhun.<br/><br/>After a while, Fang Wang put down the Jade Slip. It did indeed contain information about Ye Canghai, even a segment showing Ye Canghai fighting, allowing Fang Wang to see his true face.<br/><br/>Ye Canghai, unlike ordinary cultivators, had mediocre talent in spells but excelled in body cultivation. He could tear Great Demon Kings apart with his bare hands, possessing boundless strength.<br/><br/>The information recorded that Ye Canghai had a Heart Demon, prone to emotional instability, with a particular vulnerability to soul-based attacks. Details about the Magic Artifacts he often used and his Lifespirit Treasure were also recorded in the Jade Slip.<br/><br/>Fang Wang couldn’t help but marvel at the power of the Eternal Life Pavilion for gathering such detailed information.<br/><br/>He, however, was not concerned—Golden Body Realm cultivators weren’t a threat to him.<br/><br/>He could kill a Golden Body Realm cultivator with one punch as soon as he stepped into the Cross -Void Realm, not to mention having now reached the third layer of the Cross-Void Realm and mastered an even stronger Nine Dragons Tyrant Fist.<br/><br/>Fang Wang closed his eyes and resumed his cultivation.<br/><br/>In the boundless ocean, an isolated island stood on the water.<br/><br/>On its beach, a fire blazed with a middle-aged man meditating next to it, while a young man sat beside, grilling meat.<br/><br/>The middle-aged man wore a black robe with python patterns and a bronze crown pointing skyward. His broad shoulders and his brow bore a vertical frown line from long periods of scowling.<br/><br/>The young man grilling meat appeared to be a little over twenty years old, had handsome features, and would be instantly recognizable to Fang Wang.<br/><br/>This young man was Fang Wang’s own younger brother, Fang Xun.<br/><br/>Fang Xun looked toward the middle-aged man and asked, “Senior, do we really have to be at loggerheads with the Heavenly Sect?”<br/><br/>The middle-aged man was Ye Canghai, who had recently been causing turmoil in the maritime world.<br/><br/>Upon hearing Fang Xun’s words, Ye Canghai opened his eyes and snorted, “It’s not that I want to clash with them to the death; it’s they who won’t let go!”<br/><br/>“Why don’t we change our names and lie low for a while?” Fang Xun suggested earnestly.<br/><br/>Ye Canghai glanced at him and snorted, “I, Ye Canghai, have lived for more than four hundred years. When have I ever lain low? Impossible! Absolutely impossible!”<br/><br/>Fang Xun pursed his lips and said no more.<br/><br/>Seeing his expression, Ye Canghai said with resignation, “Don’t worry, I will help you change your fate. The Demon Monarch saved me; I will not forget this debt of gratitude.”<br/><br/>Fang Xun couldn’t help but ask curiously, “Do you know my sister-in-law? How strong is she actually?”<br/><br/>Ye Canghai shook his head and said, “Only a brief encounter, but given that she is the sole disciple of the Demon Monarch, she naturally won’t be weak. You lad are quite lucky to have your sister-in-law plead with her master on your behalf. ”<br/><br/>Upon hearing this, Fang Xun immediately became proud, “That’s only natural. My sister-in-law and my brother are more than just husband and wife, they have faced many troubles together, so naturally, she looks out for me.” Mentioning Fang Wang, Fang Xun’s expression turned melancholic.<br/><br/>“The vast sea, when will I ever find my brother…” Fang Xun sighed.<br/><br/>Ye Canghai snorted, “I heard that your brother Fang Wang possesses the<br/><br/>Heaven Yuan Spirit Treasure and has achievements like slaying those in the Golden Body Realm. Such a figure, even if you met him, you’d only hold him back. Stop dreaming and wait for me to change your fate. Even though you are brothers, with such a huge disparity in talents and cultivation, you’ll eventually become like strangers.”<br/><br/>Fang Xun blew on the grilled fish on the stick and said, “I am well aware of this, which is exactly why I headed south. A genius like my brother could make a name for himself even at sea. Let me tell you, back in the day…”<br/><br/>Ye Canghai’s face twitched, clearly impatient.<br/><br/>This kid is always boasting about his brother.<br/><br/>Ye Canghai felt he was exaggerating, but since Fang Wang was someone the Jin Xiao Sect made a point of protecting, he naturally couldn’t be bothered to question it.<br/><br/>If it wasn’t for this connection, he would really like to test what kind of a freak Fang Wang truly was!<br/><br/>“Stop boasting. There are plenty of geniuses at sea, like a sky full of stars.<br/><br/>Speak again when your brother makes a name for himself.”<br/><br/>“My brother will sooner or later become famous across the vast sea,” Fang Xun said.<br/><br/>“Heh,” Ye Canghai chuckled.<br/><br/>Six years slipped away, and Fang Wang made another breakthrough, reaching the fourth layer of the Cross-Void Realm.<br/><br/>He felt his cultivation speed had increased slightly, originally thinking it would take seven or eight years to break through, perhaps it was related to his contemplation of merging Cultivation Techniques during training.<br/><br/>This gave Fang Wang the idea of merging Cultivation Techniques.<br/><br/>After stabilizing his cultivation, Fang Wang took out a scroll that recorded a Spell, which he had prepared specifically to enter the Heavenly Palace.<br/><br/>Because of his previous experiences, Fang Wang was reluctant to enter the Heavenly Palace after possessing certain strengths; it was simply too torturous.<br/><br/>But now, with a strong interest in merging Cultivation Techniques, he wanted to try a strategy.<br/><br/>Soon, he memorized the essentials of this Spell, then entered the Heavenly Palace.<br/><br/>After entering the Heavenly Palace, Fang Wang did not cultivate the Spell, but began pondering the Three Great True Cultivations and the Solaris Scripture.<br/><br/>At first, there seemed to be no anomalies; he even thought he was close to success.<br/><br/>However, in less than three days, he began to suffer from inexplicable headaches and couldn’t focus his attention.<br/><br/>When he gave up pondering the Cultivation Techniques, the headaches disappeared.<br/><br/>Over and over again, after several attempts, Fang Wang completely gave up; he couldn’t use the time meant for cultivating a Spell in the Heavenly Palace to practice other Spells or Cultivation Techniques.<br/><br/>With no other choice, he quickly mastered this Spell and left the Heavenly Palace in just thirteen years.<br/><br/>Fang Wang opened his eyes and looked at the Spirit Eye Lake in front of him, letting out a breath.<br/><br/>A loophole failed…<br/><br/>After opening his eyes, he found his head still ached a bit, indicating that it was not just a sensation from within the Heavenly Palace, but a physical reaction.<br/><br/>After sitting quietly for some time, Fang Wang resumed his contemplation.<br/><br/>He decided to merge the Cultivation Techniques early. Only by successfully merging them could he speed up his cultivation.<br/><br/>Merging four different Cultivation Techniques was extremely difficult, so Fang Wang decided to start by merging the Three Great True Cultivations. Once that was done, he would then merge the Solaris Scripture.<br/><br/>When his senses returned, Fang Wang stood up and went to the beach, listening to the sound of the waves crashing ashore as he began to seek enlightenment.<br/><br/>In reality, time slipped by like a fleeting horse, never to return.<br/><br/>In the blink of an eye.<br/><br/>Two more years passed.<br/><br/>Fang Wang still hadn’t succeeded, but he didn’t give up, only growing more stubborn.<br/><br/>Without a successful merging, he swore he wouldn’t rest!<br/><br/>One day, in the afternoon.<br/><br/>While sitting motionless, Fang Wang suddenly felt a weak breath moving through the heavy fog ahead; the breath obviously lost its direction, going around in circles.<br/><br/>He looked intently and raised his eyebrows.<br/><br/>Isn’t that Ye Canghai?<br/><br/>Fang Wang remembered Ye Canghai’s face from the Jade Slip; Ye Canghai at the moment seemed ragged, covered in blood, walking on the sea, staggering as he moved.<br/><br/>Fang Wang took out the Biyou Jade Token, and with a thought, the fog in front of Ye Canghai dispersed, prompting him to instinctively move in the direction of the clearing fog.<br/><br/>After a while.<br/><br/>From the heavy fog above the sea in front of Fang Wang, a figure walked out— it was none other than Ye Canghai.<br/><br/>When Ye Canghai emerged from the fog, his face showed surprise and joy, but then, his eyes were drawn to Fang Wang, and his brows involuntarily furrowed.<br/><br/>He immediately rushed towards Fang Wang.<br/><br/>Moving like thunder.<br/><br/>Just as he was about to reach Fang Wang, Fang Wang’s voice sounded, “Better heal your injuries first, if you attack me now, you’ll die a very ugly death.”<br/><br/>Upon hearing this, Ye Canghai immediately halted..\t\t\t\t\t\t</div>", "images": {}, "success": true}