{"id": 146, "url": "https://www.novelhall.com/i-became-an-immortal-on-mortal-realm-32879/14302957.html", "title": "Chapter 146 - Chapter 146: Chapter 143 Molding Sword Soul, Emperor Zhu", "volume": 2, "volume_title": "Volume 2", "body": "<h1>Chapter 146 - Chapter 146: Chapter 143 Molding Sword Soul, Emperor Zhu</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 146: Chapter 143 Molding Sword Soul, Emperor zhu<br/><br/>Translator: 549690339<br/><br/>Hearing Fang Hanyu’s inquiry, Zhou Xue pulled out an oil lamp, the flame flickered as if it could extinguish at any moment.<br/><br/>“To forge a Sword Soul, a Sword Soul is akin to a Lifespirit Treasure. Looking across the lands at all Sword Cultivators, few indeed possess a Sword Soul, and this one is an exceptional rarity, seen once in a thousand years,” Zhou Xue said<br/><br/>softly.<br/><br/>Fang Hanyu recognized this oil lamp, which could create an invisible barrier to block prying eyes. Zhou Xue would always bring out this lamp when she spoke with him.<br/><br/>The words ‘Sword Soul’ greatly stirred Fang Hanyu’s heart.<br/><br/>“Where is it? How can I obtain it?” Fang Hanyu pressed.<br/><br/>Zhou Xue revealed a smile, her eyes filled with teasing, “This opportunity is fraught with danger, but once successful, your name shall resound through the realm, and all Sword Cultivators will regard you as the target for all arrows.”<br/><br/>Fang Hanyu said, “I don’t care, the path of cultivation is inherently about contending with others and fighting the heavens.”<br/><br/>Zhou Xue nodded, expressing admiration, “You’ve indeed grasped the essence. If you don’t go, let alone catching up to Fang Wang, I fear you might be surpassed by Fang Zigeng.”<br/><br/>Upon hearing this, Fang Hanyu asked curiously, “How is Zi Geng doing now? What kind of opportunity has he obtained?”<br/><br/>Picking up a tea cup, Zhou Xue spoke leisurely, “This fellow is even more ruthless than you. In pursuit of immortality, he has replaced his sinews and bones, enduring agonies worse than death, and the Cultivation Technique he practices is the most difficult one in the world.”<br/><br/>Fang Hanyu frowned, not because he feared being surpassed by Fang Zigeng, but worried for him.<br/><br/>“Alright, the following information you must remember firmly. You must strive for this opportunity yourself, certain key pieces of information cannot be treated carelessly,” Zhou Xue said sternly.<br/><br/>Fang Hanyu snapped back to attention and nodded seriously.<br/><br/>Separated from the rest of the world, Biyou Island rapidly witnessed three years go by, and Fang Wang broke through to the sixth level of the Cross-Void Realm.<br/><br/>To have reached the sixth level of the Cross-Void Realm at the age of ninety-nine, he had high hopes to achieve the Golden Body Realm before turning one hundred and twenty, a pace far surpassing that genius of the Heavenly Sect who possessed the Heaven Yuan Spirit Treasure.<br/><br/>With no immediate needs in cultivation, Fang Wang did not think of leaving the island, planning to continue cultivating until he broke through to the Golden Body Realm.<br/><br/>He once tried to send a message to the Great Abyss Gate using the token of the Great Abyss Gate’s chief disciple, but failed. Ever since arriving at sea, far from Grand Qi, the token had lost its effect.<br/><br/>One day, Fang Wang took some time to guide the Monsters in their movement techniques. Although these Monsters had not taken human form, after years of cultivation, the least intelligent among them was as sensible as a twelve-year-old child, capable of understanding his words.<br/><br/>Watching these little monsters tumble and crash into each other, a smile never left Fang Wang’s face.<br/><br/>Xiao Zi lay atop a nearby large rock, watching Fang Wang, shaking its head, puzzled by the meaning of all this.<br/><br/>Boom!<br/><br/>A thunderous roar came from the west, originating outside the island, startling the Monsters who turned to look, as did Fang Wang, whose gaze penetrated the rolling fog, seeing the situation at the horizon.<br/><br/>There, an enormous creature hovered at the edge of the sea, a giant whale, a hundred Zhang long, with a majestic build, like a mountain.<br/><br/>Fang Wang narrowed his eyes, seeing beneath the whale a man with a bare chest, holding the whale aloft with both arms. The whale’s tail thrashed, trying to struggle, but it couldn’t break free from his grasp.<br/><br/>At that moment, the bare-chested man was looking toward Biyou Island, and he violently tossed the whale in Fang Wang’s direction.<br/><br/>In an instant, Fang Wang vanished from his spot. Then, Xiao Zi and the other Monsters saw a large gap blasted through the mist over the sea, creating an intense visual shock that made them tremble. When they opened their eyes again, they saw an enormous whale flying toward them.<br/><br/>Before they could react, the whale suddenly stopped midair. On a closer look, they saw Fang Wang’s figure.<br/><br/>Fang Wang seemed tiny compared to the huge whale, but he was holding it back. With a casual flick of his right hand, using the Sky Capturing Palm, he sent the whale into the distant sea, causing hundreds of Zhang high waves, a spectacular sight.<br/><br/>Fang Wang then looked toward the bare-chested man in the distance. The man had a strong physique, and from his muscles alone, one could feel the terrifying power. His wild appearance and the savage smile revealing two sharp fangs, his long hair dancing untamed.<br/><br/>Monster!<br/><br/>Fang Wang asked, “Are you courting death?”<br/><br/>The provocation from the other party left no room for misunderstanding, and even if there was a misunderstanding, Fang Wang was ready to teach him a lesson.<br/><br/>“Are you the Sword Sovereign of the Yellow Glyph?” the bare-chested man asked with a sinister smile.<br/><br/>Fang Wang raised his right hand, condensing the Heavenly Palace Halberd. It had been a long time since he had used this Spirit Treasure, and it was time to let it taste blood.<br/><br/>Seeing this, the bare-chested man was not frightened but instead became excited, his body quivering. He licked his lips and said with a smile,<br/><br/>“Remember, this king is called Zhu Yan. Having heard that you killed Ye<br/><br/>Canghai with a single punch, this king wishes to experience your fist!”<br/><br/>“How dare you!”<br/><br/>A thunderous shout came, and a streak of white light raced through the air, swiftly moving between Fang Wang and Zhu Yan. The light dispersed to reveal the figure of the Cliff-edge True Person.<br/><br/>Cliff-edge True Person turned to face Zhu Yan, his expression icy cold, as he said, “Zhu Yan, this is the domain controlled by the Heavenly Sect, do not provoke trouble, or do not blame me for disregarding the friendship I have with your father!”<br/><br/>Clutching the Heavenly Palace Halberd, Fang Wang felt puzzled.<br/><br/>Wasn’t the Heavenly Sect a righteous sect famed for slaying Monsters and demons? How did they come to be associated with Monsters?<br/><br/>Fang Wang had thought this man was the ruler of a Demon Emperor’s palace and was prepared to take lethal action.<br/><br/>Zhu Yan continued to laugh cruelly, “Senior, Ye Canghai was your junior brother, and he died at the hands of the Sword Sovereign of the Yellow Glyph.<br/><br/>Do you truly not feel the slightest pain?”<br/><br/>Master Lin Cliff said emotionlessly, “Ye Canghai got what he deserved; don’t seek revenge for him. This has nothing to do with you.”<br/><br/>“I’m not looking to avenge him. I genuinely want to test the might of the Sword Sovereign of the Yellow Glyph. Xuanyuan Xin is strong, but his power lacks a bit of oomph. Fighting him is no fun; he only knows how to dodge. Elder, step aside, today I must spar with the Sword Sovereign of the Yellow Glyph!” Zhu Yan said in a cold voice.<br/><br/>Master Lin Cliff frowned.<br/><br/>Fang Wang spoke up, “When I bought Biyou Island, the Heavenly Sect did promise me that no one would disturb me.”<br/><br/>Hearing this, Master Lin Cliff raised his hand. Within the palm, a white gourd condensed as his aura suddenly changed, making even Fang Wang raise an eyebrow.<br/><br/>Such a strong aura, far surpassing Ye Canghai!<br/><br/>Fang Wang thought to himself that before he had cultivated the Heavenly Dao True Skill, if he were to become enemies with Master Lin Cliff, it probably wouldn’t be an easy task to kill him.<br/><br/>Seeing Master Lin Cliff get serious, Zhu Yan curled his lips and said, “Elder, I didn’t expect you to protect an outsider like this. Could it be that Ye Canghai isn’t actually dead, that the Sword Sovereign of the Yellow Glyph spared his life for you?”<br/><br/>Master Lin Cliff squinted and said, “Stop talking nonsense. Leave immediately and do not disturb the Sword Sovereign of the Yellow Glyph’s cultivation!”<br/><br/>Zhu Yan turned his gaze behind Master Lin Cliff to Fang Wang and shouted, “Hey, Sword Sovereign of the Yellow Glyph, if you don’t have the confidence right now, it’s okay. Wait until you’re stronger, then find me anytime. I’ll always be up for a fight.”<br/><br/>With that, he turned around to leave.<br/><br/>“Hold on.”<br/><br/>Fang Wang’s voice sounded out, stopping Zhu Yan, who excitedly turned around with a fighting spirit in his eyes as he looked at Fang Wang.<br/><br/>Master Lin Cliff stepped aside and looked at Fang Wang, “Sword Lord, don’t mind him. This kid is acting wildly just because his father is Emperor Zhu; why stoop to his level?”<br/><br/>Fang Wang asked calmly, “What realm is this Emperor Zhu at?”<br/><br/>Master Lin Cliff frowned and said, “He reached the Mahayana Realm five hundred years ago and is a famous Demon Emperor of the Southern Celestial<br/><br/>Sea. ”<br/><br/>Mahayana?<br/><br/>Fang Wang looked at Zhu Yan and said, “Challenging me could get you killed.<br/><br/>Think it through because if you die, your father might seek revenge for you. Won’t it be a pity if you meet your father in the underworld simply because you rashly provoked me?”<br/><br/>At these words, Zhu Yan’s expression instantly darkened.<br/><br/>Master Lin Cliff looked at Fang Wang with surprise.<br/><br/>How arrogant!<br/><br/>He wanted to speak but stopped himself, wanting to persuade Fang Wang but also fearing he might hurt Fang Wang’s pride and anger him further.<br/><br/>“Good! Very good!”<br/><br/>Zhu Yan’s anger dissipated, and through gritted teeth he said, “Master Lin Cliff, listen well, my duel today with the Sword Sovereign of the Yellow Glyph has nothing to do with any other cause and effect. If I die, tell my father not to seek revenge for me; it was my own doing!”<br/><br/>As his voice fell, billowing Demonic Qi wafted from his body with an oppressive force.<br/><br/>Fang Wang turned to Master Lin Cliff and asked, “Are all the talents from the sea this brainless?<br/><br/>Master Lin Cliff showed a helpless expression, bowed with clasped hands, and said, “I hope the Sword Lord won’t…”<br/><br/>Boom!<br/><br/>Before he could finish speaking, a terrifying aura surged forth, and a cold gleam swept past him, the powerful blast sending his long hair flying. His eyes widened in disbelief as he looked at Fang Wang.<br/><br/>Fang Wang held his pose after throwing the Heavenly Palace Halberd, with a cold expression on his face. That look in his eyes made even Master Lin Cliff’s heart tremble.<br/><br/>Master Lin Cliff quickly turned around, no longer sensing Zhu Yan’s aura.<br/><br/>He saw the Heavenly Palace Halberd hovering in front of Zhu Yan, the halberd’s tip less than five centimeters away from his nose, with the terrifying aura whipping his hair about. Cuts opened on his face, resembling cracked stone, with crisscrossing fissures as trickles of blood seeped out. Moments later, his face was covered in blood, and his wide-open eyes were filled with horror, reflecting the image of the Heavenly Palace Halberd.<br/><br/>Zhu Yan’s aura had been forcefully dispersed, the Demonic Qi dissipating like fog. His entire body shook with extreme fear.<br/><br/>At this moment, he lost all his previous defiance and arrogance, standing frozen in the air, his mind a blank.<br/><br/>All was silent between heaven and earth!<br/><br/>Xiao Zi saw this and breathed a sigh of relief. Zhu Yan’s aura had made it uneasy as if it had encountered a sworn enemy.<br/><br/>The other little monsters couldn’t see what was happening from that far away, but they could see the clouds in the sky torn into two halves, a sight most spectacular. That scene was deeply etched into their minds.<br/><br/>Master Lin Cliff turned back to Fang Wang and hurriedly said, “Sword Lord, please don’t kill him. I beg you!”<br/><br/>If the cultivators of the Heavenly Sect saw this, they would never believe that their esteemed Sect Master would speak so humbly to someone.<br/><br/>Fang Wang’s expression remained indifferent as he said, “You already owe me a favor. How will you repay me if you owe me another?”<br/><br/>Hearing this, Master Lin Cliff clenched his teeth and said, “Then I’ll owe you two favors. As long as it’s within my power, please command me!”<br/><br/>Fang Wang ignored him and looked at Zhu Yan, “Little monster, do you want to live?”<br/><br/>These words clearly reached Zhu Yan’s ears, instantly snapping him back to reality. His ears were filled with nothing but his own intense heartbeat, like war drums.<br/><br/>He instinctively opened his mouth, wanting to plead for mercy.\t\t\t\t\t\t</div>", "images": {}, "success": true}