{"id": 145, "url": "https://www.novelhall.com/i-became-an-immortal-on-mortal-realm-32879/14302616.html", "title": "Chapter 145 - Chapter 145: Chapter 142: The Strength Of The Jin Xiao Sect", "volume": 2, "volume_title": "Volume 2", "body": "<h1>Chapter 145 - Chapter 145: Chapter 142: The Strength Of The Jin Xiao Sect</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 145: Chapter 142: The Strength of the Jin Xiao Sect<br/><br/>Translator: 549690339<br/><br/>The night was like water, and the surface of the sea shimmered, exuding a chill.<br/><br/>Fang Wang stood by the shore, his gaze piercing through the sea to spy into the Underworld, with the scenes of the Netherworld reflected in his pupils.<br/><br/>The Underworld was darker than the Mortal Realm, with no sun shining, but the moon hung high, and lost souls wandered aimlessly on the land, all without a purpose.<br/><br/>Fang Wang watched for a long time, his eyes filled with desolation.<br/><br/>He saw no order, no rules, or perhaps the scope of his vision was too limited.<br/><br/>A night passed, and Fang Wang did not immediately begin his cultivation; instead, he strolled around Biyou Island. Having been cooped up in the Heavenly Palace for one thousand four hundred and twenty years, he needed to relax properly.<br/><br/>Even without cultivating, his rate of cultivation growth was faster than before.<br/><br/>The Heavenly Dao True Skill allowed his body to automatically cultivate nature’s spiritual energy. Even if he did not activate the Solaris Scripture, the spiritual energy within his body would automatically transform into Solaris Spiritual Power, and it did not affect his ability to do anything else.<br/><br/>In the days that followed, Fang Wang occasionally offered guidance to the monsters under Xiao Zits command. Those monsters discovered that it was very comfortable to stay beside Fang Wang. Wherever he went, the spiritual energy would concentrate, and he even purified it, which delighted the monsters.<br/><br/>At first, they did not dare to approach Fang Wang, after all, he was their master’s master.<br/><br/>Latter, they found that Fang Wang treated them much more kindly than Xiao<br/><br/>Zi did, so they became bolder.<br/><br/>On this day.<br/><br/>Fang Wang was sitting on a rock by the sea, fishing, surrounded by all kinds of little monsters.<br/><br/>A blue-shell turtle asked, “My Lord, what’s the point of fishing? We can catch fish for you, and with your vast divine skills, there’s no fish you can’t catch.”<br/><br/>It was the most articulate among the monsters, while the others could only echo in agreement, unable to speak such long sentences as it could.<br/><br/>Fang Wang replied softly with a laugh, “What I want is not the outcome, but to enjoy the time spent in the process.”<br/><br/>The blue-shell turtle did not understand and was about to ask more questions when a snake tail coiled around its head and flung it backwards.<br/><br/>“Scatter at once. Don’t bother the young master with nothing important. If I find out again, be careful, or I’ll eat you!”<br/><br/>Xiao Zi’s voice came, scaring the little monsters into a swift retreat, rushing into the sea.<br/><br/>Xiao Zi then climbed onto Fang Wang’s shoulder, and with a resentful tone said, “Young master, don’t get too close to them. If it goes on for too long, be careful lest they get carried away. Lately, they’ve even started to talk back to me.”<br/><br/>Fane Wane answered casually. “Obedience doesn’t necessarily mean loyalty.<br/><br/>How to make them truly convinced and respect you is what you need to consider.’<br/><br/>Xiao Zi flickered its tongue and looked at Fang Wang, asking softly, “Isn’t it good to be obedient?”<br/><br/>“Obedience is naturally good, but think about it, if you were them, and your master treated you this way, one day, if you were in a desperate situation and your master was defeated, would you flee or stay and fight to the death to protect them?”<br/><br/>Upon hearing Fang Wang’s question, Xiao Zi instinctively wanted to brown-nose, but it quickly realized that Fang Wang was not chiding it. It fell silent, carefully recalling its own attitude towards the little monsters.<br/><br/>It then thought of Fang Wang’s attitude towards itself.<br/><br/>When it first pledged allegiance to Fang Wang, it was out of desperation, to survive, but after having been together for so long, its mentality had long since changed.<br/><br/>It began to ponder why it had grown inseparable from the young master.<br/><br/>Fang Wang smiled and asked, “How many demon soldiers do you want?” Xiao Zi blinked and said, “Let’s train a thousand to start with.”<br/><br/>“What are your thoughts for the future? Do you want to go out and establish your own domain?”<br/><br/>“I wouldn’t want that. I just want to follow the young master and build a demon army. Biyou Island is quite vast, and it needs some minions.”<br/><br/>“Is that true?”<br/><br/>“Of course, young master. Sooner or later you’ll ascend to become an immortal, and I must cling to your coattails, hehe.”<br/><br/>“You sure are a dreamer. What if I don’t ascend?”<br/><br/>“Then I’ll stay in the Mortal Realm with the young master, and if there’s a next life, after I reincarnate as a human, I’ll continue to serve you.”<br/><br/>Fang Wang raised his hand and rubbed its snake head. Whether what it said was true or just flattery, these words did cheer Fang Wang up.<br/><br/>Afterward, Xiao Zi started to recall the scene when it first met Fang Wang. As one person and one monster reminisced, the floodgates of memory were fully opened.<br/><br/>Thinking about it, the companion who had stayed with him the longest in this life was Xiao Zi, the snake.<br/><br/>Fang Wang felt quite moved in his heart and secretly thought that if there was a way in the future, then he would do his best to help Xiao Zi become a dragon, not letting its long companionship be in vain.<br/><br/>Fang Wang relaxed this way for two years. During those two years, he traveled through mountains and waters, occasionally planting flowers and teaching the little monsters. Even so, his cultivation smoothly broke through to the fifth level of the Cross-Void Realm.<br/><br/>The entire process was very easy, as simple as drinking water and eating food.<br/><br/>On this day.<br/><br/>Qu Xunhun came again to visit Fang Wang.<br/><br/>Fang Wang activated the formation, allowing him onto the island.<br/><br/>Qu Xunhun came before Fang Wang, bent over to pay his respects, with a posture even lower than before.<br/><br/>The news of Fang Wang killing Ye Canghai with a single punch had spread throughout the ocean, and he naturally had heard of it. With such strength, he had to tread carefully.<br/><br/>“Sword Lord, the Blade Master of the Mysterious Glyph has invited the great powers of the sea to discuss the Dao. Do you have any thoughts on this?” Qu Xunhun asked softly.<br/><br/>Fang Wang replied, “I’m not interested. Did you come to me just for this?”<br/><br/>Qu Xunhun hurriedly explained, “The Blade Master of the Mysterious Glyph and the Sword Saint were once good friends, which is why I came to ask you<br/><br/>specifically. If you do not wish to go, there’s no trouble; I can decline on your behalf. Moreover, the movements of the Jin Xiao Sect in the sea are becoming more frequent, and I worry they may target you, so I came to report the intelligence to you.”<br/><br/>Upon hearing this, Fang Wang became interested and asked, “Has the Eternal<br/><br/>Life Pavilion already started investigating the Jin Xiao Sect?”<br/><br/>Qu Xunhun nodded, “Naturally, any emerging power will be investigated by the Eternal Life Pavilion. I have obtained the most comprehensive intelligence on the Jin Xiao Sect especially for you.”<br/><br/>Having said that, he lifted his right hand to present a jade slip.<br/><br/>Fang Wang took the jade slip and praised, “You’re thoughtful.”<br/><br/>“It’s my duty. If Sword Lord has no other commands, then I shall take my leave,” Qu Xunhun said respectfully, and upon seeing Fang Wang nod, he promptly took his leave with a bow.<br/><br/>Only after he left Biyou Island did Fang Wang pick up the jade slip. He was very interested in the intelligence on the Jin Xiao Sect, for he still didn’t know how powerful the Jin Xiao Sect was.<br/><br/>As his divine consciousness probed into the jade slip, a vast amount of information flooded into Fang Wang’s mind.<br/><br/>The intelligence on the Jin Xiao Sect was more extensive than he had anticipated, recording nearly a hundred people, including the Demon Monarch and Zhou Xue.<br/><br/>The Demon Monarch, with an unknown origin and cultivation, suspected to be in the Mahayana Realm, possessing a pair of Spirit Treasures…<br/><br/>Zhou Xue, a direct disciple of the Taiyuan Gate, the sole disciple taught by the Demon Monarch, eighth layer of the Profound Heart Realm, possessing an Earth Origin Spirit Treasure…<br/><br/>Cao Ran, Tu Caiyi, Xiao Kuang, Ye Canghai, and so on…<br/><br/>Among them, the intelligence about Ye Canghai was marked as life or death unknown; it seems the Eternal Life Pavilion suspects that Ye Canghai’s death on Biyou Island was part of the Heavenly Sect’s scheme.<br/><br/>Overall, the Jin Xiao Sect was indeed powerful, with more than ten cultivators reaching the Cross-Void Realm, including four who had attained the Golden Body Realm; this was not even the full strength of the Jin Xiao Sect.<br/><br/>Fang Wang couldn’t help but exclaim at the rapid growth of the Jin Xiao Sect.<br/><br/>If the Jin Xiao Sect had been this strong from the start, they would have swept through Grand Qi by now, which further confirmed a certain speculation in Fang Wang’s mind.<br/><br/>As for Zhou Xue being only at the eighth layer of the Profound Heart Realm, Fang Wang didn’t believe it; he directly equated Zhou Xue’s cultivation with that of the Demon Monarch.<br/><br/>The Mahayana, a realm beyond the Golden Body! Even at sea, Mahayana cultivators were hard to come by. Reaching this level, one was almost fathoming one’s life’s destiny, yet the Mahayana Realm was not the pinnacle of human cultivation; Fang Wang knew there were several more substantial realms beyond, based on the layers of the Solaris Scripture’s techniques.<br/><br/>After browsing through, Fang Wang burned the jade slip.<br/><br/>With the Jin Xiao Sect and Zhou Xue growing so quickly, he couldn’t afford to be lazy.<br/><br/>Fang Wang prepared to cultivate earnestly; he walked up to the wooden platform in front of Spirit Eye Lake and began to sit in meditation and cultivate.<br/><br/>As he started his Qi Gathering practice, visible wind and waves were generated around him, with a vast amount of spiritual energy pouring into his body. Gradually, above his head, a whirl appeared in the sky, and even the clouds followed suit, spinning around.<br/><br/>All the creatures on the island turned involuntarily to look.<br/><br/>Zhao Zhen, who was watering the flowers, turned to look, secretly amazed, “What kind of cultivation technique has he mastered that gives me this sensation…”<br/><br/>Ever since Fang Wang created the Heavenly Dao True Skill, Zhao Zhen didn’t dare to approach him, feeling a kind of indescribable reverence that was instinctive and even more intense than being suppressed by Xiao Zi.<br/><br/>Zhao Zhen tried to cast aside these stray thoughts and continued watering.<br/><br/>Without realizing, he had grown accustomed to this kind of life—before he started cultivating, he would never have imagined he could be content with such a life.<br/><br/>Below the blue sky, floating islands hung above the sea at varying heights, with waterfalls plummeting from the higher islands down to the sea, booming mightily.<br/><br/>Fang Hanyu was meditating on a cliff of one of the floating islands next to a waterfall, the mist engulfing him.<br/><br/>At the moment, his eyes were closed, holding a sword in his hand. Under the sunlight, the sword appeared elusive and indistinct; it was his treasured weapon, composed of the Sword Qi of the Sword Saint.<br/><br/>“Brother Fang, a woman called Zhou Xue has come to visit you; do you recognize her?” a voice came from the Token at Fang Hanyu’s waist.<br/><br/>Upon hearing this, Fang Hanyu opened his eyes, picked up the Token, and said,<br/><br/>“I know her; let her come up.”<br/><br/>Standing up, he dusted off his robes, and looked around, curious where Zhou Xue might be coming from.<br/><br/>Before long, Zhou Xue arrived, dressed in red and wearing a bamboo hat, gliding through the clouds, led by a male cultivator.<br/><br/>Seeing that it was indeed Zhou Xue, Fang Hanyu smiled, and after Zhou Xue landed, he invited her to sit down at a stone table beneath a tree.<br/><br/>While pouring tea for Zhou Xue, he asked, “What brings you here?”<br/><br/>Having been separated from Fang Wang for many years, and having joined a sect by himself, he inevitably missed his kin.<br/><br/>Zhou Xue removed her bamboo hat, revealing her exquisite yet cold features, and with a smile, she said, “Having put the affairs of the Taiyuan Gate in order, I naturally need to seek opportunities for myself. There’s something I want in this sea.”<br/><br/>Fang Hanyu asked, “Have you seen Fang Wang? He must miss you a lot.”<br/><br/>Zhou Xue glanced at him and said, “You also received the Sword Saint’s legacy; you should know the Sword Sovereign of the Yellow Glyph is him. He is now faring well, so why should I go to see him? I have an opportunity here, suitable for Sword Cultivators. Would you care to pursue it?”<br/><br/>Fang Hanyu’s curiosity piqued, and he asked, “What opportunity?”<br/><br/>He didn’t know that Zhou Xue had been reborn, but ever since he began the path of cultivation, Zhou Xue had often looked after the Fang Family Disciples, and most of his opportunities were the result of intelligence provided by Zhou Xue. In his mind, Zhou Xue might not be as powerful as Fang Wang, but she certainly knew more than Fang Wang..\t\t\t\t\t\t</div>", "images": {}, "success": true}