{"id": 147, "url": "https://www.novelhall.com/i-became-an-immortal-on-mortal-realm-32879/14302958.html", "title": "Chapter 147 - Chapter 147: Chapter 144 Roc Bird, Ascenders_1", "volume": 2, "volume_title": "Volume 2", "body": "<h1>Chapter 147 - Chapter 147: Chapter 144 Roc Bird, Ascenders_1</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 147: Chapter 144 Roc Bird, Ascenders_1<br/><br/>Translator: 549690339<br/><br/>Just as the plea for mercy reached the edge of his lips, Zhu Yan suppressed it once again.<br/><br/>He was born proud, and had never been so humble even in front of his father…<br/><br/>At the moment, Master Lin Ya was also watching him, signaling with his eyes for Zhu Yan to bow his head, yet those eyes felt like two knives piercing Zhu Yan’s heart deeply.<br/><br/>But the Heavenly Palace Halberd still hung before him, and its terrifying edge made him dare not speak the words, “I do not submit.”<br/><br/>Recalling the terrifying experience just now, Zhu Yan’s heart still trembled. “It seems you are unwilling to bow, in that case, prepare to die!”<br/><br/>Fang Wang’s voice sounded, his words cold and indifferent. As they fell, the Heavenly Palace Halberd quivered, startling Zhu Yan into hastily shouting:<br/><br/>“I want to live! I was wrong! I submit!”<br/><br/>After speaking, Zhu Yan gasped for air, his face covered in blood that would not stop flowing down, devoid now of his earlier arrogance.<br/><br/>He was certain that Fang Wang would indeed dare to kill him!<br/><br/>Despite his earlier arrogance and indifference to life and death, in truth, he had never experienced a real threat to his life. His previous life had been smooth sailing, and all his enemies had been cruelly slain by him. Not to mention a brush with death, he hadn’t even suffered humiliation before.<br/><br/>Then the Heavenly Palace Halberd suddenly retracted, swiftly returning to Fang Wang’s hand.<br/><br/>Zhu Yan and Master Lin Ya both looked toward Fang Wang, their gazes different, but both filled with fear of Fang Wang’s strength.<br/><br/>They finally understood why Ye Canghai had been defeated.<br/><br/>Zhu Yan, even more, realized the state of mind Ye Canghai must have had when facing Fang Wang, where all pride and face meant nothing—an afterthought to survival, followed by relief and regret in their hearts. Fang Wang turned to Master Lin Ya and smiled, “I won’t see you out. Farewell.”<br/><br/>With that, he clasped his hands in a gesture of respect towards Master Lin Ya, who hastily returned the gesture.<br/><br/>Fang Wang didn’t look at Zhu Yan again but turned and rapidly flew back to Biyou Island. Right after that, the thick fog around Biyou Island gathered again, concealing the island from view.<br/><br/>Zhu Yan remained in the same spot, staring blankly at Biyou Island.<br/><br/>Master Lin Ya flew to his side, heaved a sigh, and said, “The world is vast. There are mountains beyond mountains, heavens beyond the heavens. Your father is not the strongest either. There are always those who won’t give him face. In your future actions, do not be reckless, for not every time will your luck be this good.”<br/><br/>Seeing Zhu Yan’s dispirited appearance, Master Lin Ya suddenly felt that this might actually be a good thing.<br/><br/>He was a sworn brother to the Emperor, and he had watched Zhu Yan grow up, naturally hoping he would become better.<br/><br/>Zhu Yan took a deep breath and asked, “Senior, between Sword Lord and my father, who is stronger?”<br/><br/>Master Lin Ya thought for a moment and said, “Hard to say. Sword Lord did not show his true capabilities just now. The might of this Sword Lord is beyond that of the Yellow Glyph, you should think about what kind of a figure the<br/><br/>Sword Saint was, even able to overcome the Xuanzi Bingjun. Receiving the Yellow Glyph Sword Sovereign Order from the Sword Saint, this Sword Lord’s strength is unfathomable. In the future, he might well be the Earth Characters Weapon Monarch. ”<br/><br/>Zhu Yan listened, lost in a daze, his bloodied face still reliving the previous sensations, and just the thought of it made him uncontrollably shudder in fear.<br/><br/>“Let’s go.”<br/><br/>Master Lin Ya passed by Zhu Yan, but when he had flown about thirty feet away, he noticed that Zhu Yan hadn’t moved at all. He couldn’t help but turn back, frowning at Zhu Yan.<br/><br/>Zhu Yan was trembling, his hands clenched into fists.<br/><br/>“Senior, you go back. I want to stay here!”<br/><br/>“What? Have you lost your mind?”<br/><br/>Master Lin Ya instantly became furious, thinking how this young fool was always messing around.<br/><br/>Zhu Yan, without turning back, said, “I am not seeking death. I want to take him as my master. The halberd he threw earlier was purely due to physical strength; I can feel that his body is extremely powerful, definitely the strongest I have encountered, even stronger than my father’s. I must take him as my master!”<br/><br/>With that, he flew towards Biyou Island.<br/><br/>Master Lin Ya watched him intently.<br/><br/>As Zhu Yan reached the edge of the thick fog, he shouted loudly, “Senior, I wish to take you as my master, and I’m willing to serve you. Please give me a chance!”<br/><br/>Inside Biyou Island, no voice came from Fang Wang, but Zhu Yan was not in a hurry. He transformed into a huge roc bird, his body covered with black feathers, prostrating himself on the sea, his stature majestic and powerful. From a distance, he appeared like a massive black lion perched on the sea.<br/><br/>Seeing this, Master Lin Ya’s tightly furrowed brow relaxed, and he smiled, turning away.<br/><br/>At that moment, a large number of Heavenly Sect disciples arrived, drawn by the intense aura previously displayed during the confrontation between Fang Wang and Zhu Yan, which had alarmed the entire Heavenly Sect.<br/><br/>Elsewhere.<br/><br/>Inside Bivou Island.<br/><br/>Xiao Zi leaned close to Fang Wang and asked, “Young Master, will you accept him?”<br/><br/>Fang Wang sat on the edge of a wooden platform, closing his eyes, and said,<br/><br/>“Let’s see how long he can kneel first.”<br/><br/>Unexpectedly, Zhu Yan turned out to be a roc bird, his true form quite handsome indeed.<br/><br/>But this fool had offended him, and still wanted to take him as a master—it was sheer fantasy.<br/><br/>Best to leave him hanging for a while longer!<br/><br/>Fang Wang continued his cultivation, realizing that he was encountering more and more opponents of the Golden Body Realm; he must reach this level soon, lest he be disgraced.<br/><br/>Xiao Zi did not disturb him any further and turned to leave.<br/><br/>Days went by, with Zhu Yan prostrating motionless on the sea, almost like a stone statue. Even when storms came, and fierce winds and pouring rain beat down on him, he remained completely still, letting the waves churn around him.<br/><br/>Two years passed in the blink of an eye.<br/><br/>News of Zhu Yan challenging the Sword Sovereign of the Yellow Glyph, being chastised, and then seeking to become his disciple had spread throughout the Heavenly Sect and even across the seas.<br/><br/>Zhu Yan, the son of Emperor Zhu, possessed a special bloodline and was also a top genius of his time, such that even he knelt before the Sword Sovereign of the Yellow Glyph, drawing many cultivators to the vicinity of Biyou Island to witness the spectacle. However, out of respect for Zhu Yan’s status, they dared not offend him and could only watch from a distance.<br/><br/>Biyou Island, by the sea.<br/><br/>Xiao Zi and Zhao Zhen were looking at the enormous figure shrouded in the dense fog. Xiao Zi couldn’t help but criticize, “Is this guy asleep or what?”<br/><br/>Zhao Zhen chuckled and said, “Of course not. The halberd strike from our master earlier almost scared him to death. How could he sleep through that?”<br/><br/>Xiao Zi, flicking her tongue, asked, “What if the young master decides to take him in? What then?”<br/><br/>Zhao Zhen countered, “Do you not like that idea?”<br/><br/>“His aura makes me uncomfortable.”<br/><br/>“That means his bloodline is no ordinary one. After all, you possess the True Dragon Bloodline. If he can make a True Dragon feel uncomfortable, his qualifications won’t be weak. If that’s the case, he is indeed very likely to be taken under our master’s wing.” “Really?”<br/><br/>Xiao Zi suddenly felt displeased.<br/><br/>Zhao Zhen chuckled and said, “Actually, this could be an opportunity for you.” Xiao Zi looked at him, a puzzled expression in her eyes.<br/><br/>Zhao Zhen said meaningfully, “The reason the master hasn’t taken him in might be because he’s waiting for you to make a move. Think about it, this guy challenged the master; how could the master possibly take him as a disciple? If word spread, how would people view our master? However, the fact that the master hasn’t rejected him suggests that he is indeed interested in his strength and talent. If you could take the initiative to win him over and bring him into your fold, and then the master guides his cultivation, wouldn’t everyone be happy?<br/><br/>“You would gain a powerful Demon General, the master would gain a valuable pawn, and once the word of this spreads, it would certainly enhance the master’s reputation far and wide. As for Zhu Yan, he would receive guidance from the master. As long as he can become stronger, he certainly wouldn’t mind what his status is.”<br/><br/>Upon hearing this, Xiao Zi opened her serpent eyes wide and pressed, “Is that true?”<br/><br/>Zhao Zhen smiled and said, “False. How could we speculate on the master’s thoughts? But whether true or false, if you could subdue Zhu Yan, it would only bring benefits to the master, and no harm.”<br/><br/>Xiao Zi fell into deep thought.<br/><br/>That very day, Xiao Zi took Zhao Zhen to sea to subdue Zhu Yan.<br/><br/>Who knew that Zhu Yan would snort in disdain, opening a single Roc Bird eye to look down upon them, saying, “What are you to command me? Reach the<br/><br/>Golden Body Realm first then talk!”<br/><br/>Xiao Zi was fuming mad, bursting into curses, which enraged Zhu Yan severely. However, he dared not act against them because of Fang Wang’s face and could only return the insults.<br/><br/>An extraordinary swearing match unfolded between the two demons on the sea.<br/><br/>Xiao Zi stubbornly refused to concede, while Zhu Yan had been holding back for too long.<br/><br/>Their exchange of insults lasted five days and nights, until Zhao Zhen almost fell asleep.<br/><br/>“Quite the lively scene, isn’t it?”<br/><br/>A light chuckle came, startling Xiao Zi, Zhu Yan, and Zhao Zhen, prompting them to turn their heads, only to see a woman in red who had appeared out of nowhere behind them in the sky.<br/><br/>Xiao Zi widened her serpent eyes and asked in a slightly hoarse voice, “How did you get here?”<br/><br/>Zhu Yan was secretly alarmed; he had failed to notice her approach.<br/><br/>At such a close distance, if she had intended to attack him by surprise, she most likely would have succeeded.<br/><br/>The woman in red lifted her head, and beneath her bamboo hat, a delicate and charming face was revealed. She looked down at Xiao Zi and said with a smile, “I came to check on my husband—got a problem with that? Continue your quarrel; I’m going inside.”<br/><br/>With that, Zhou Xue flew into the mist.<br/><br/>Xiao Zi trembled with rage.<br/><br/>Zhu Yan couldn’t help but ask, “Is she the Sword Lord’s partner?”<br/><br/>Xiao Zi glared and cursed, “She’s not. She’s a bad woman. I suggest you be careful not to provoke her; she’s extremely vicious!”<br/><br/>Zhao Zhen was curious; Zhou Xue had surprisingly appeared in this place, and he had also noticed Zhu Yan’s reaction.<br/><br/>To think that someone of the Golden Body Realm could be so visibly affected…<br/><br/>And Zhao Zhen, recalling some facts, looked frightened.<br/><br/>“What do you think? Isn’t my island quite decent?”<br/><br/>Fang Wang stood before Zhou Xue and pointed toward the gallery of pavilions and mountains behind him, asking with a smile that could hardly conceal his pride.<br/><br/>Zhou Xue nodded and said, “Indeed, it’s quite nice, and you’re really generous. It must’ve cost a fortune.”<br/><br/>Fang Wang smiled and said, “Since I don’t need spirit pills or Heavenly Materials and Earthly Treasures to help with my cultivation, I might as well buy a place of practice. If you ever want to cultivate, you can come anytime and stay as long as you like.”<br/><br/>Zhou Xue walked forward to the edge of the wooden platform and looked down upon Spirit Eye Lake. She said softly, “That Roc Bird is no simple creature. You should take him in.”<br/><br/>Upon hearing this, Fang Wang raised his eyebrows and asked, “How extraordinary is he?”<br/><br/>Zhou Xue turned to face him and said, “In my past life, he ascended to The<br/><br/>Upper Realm with me. Although he was not as strong as Xu Qiuming, he did ascend. In The Upper Realm, he became the mount for a great power, which promised him limitless prospects.”<br/><br/>A mount?<br/><br/>Fang Wang suddenly thought it wouldn’t be appropriate to take Zhu Yan as a disciple. It wouldn’t look good.<br/><br/>He asked curiously, “In the past life, how many people ascended with you?”<br/><br/>Zhou Xue replied, “Including me, just nine. Each ascension can only accommodate nine, all of them beings of great destiny. I’ll guide you on how to ascend in the future, but knowing too soon won’t do you any good.”<br/><br/>Fang Wang narrowed his eyes and asked, “Is ascension a must? From what I’ve heard of your experience, ascending might not be such a good thing..”\t\t\t\t\t\t</div>", "images": {}, "success": true}