{"id": 148, "url": "https://www.novelhall.com/i-became-an-immortal-on-mortal-realm-32879/14303284.html", "title": "Chapter 148 - Chapter 148: Chapter 145 Jiu You Legacy", "volume": 2, "volume_title": "Volume 2", "body": "<h1>Chapter 148 - Chapter 148: Chapter 145 Jiu You Legacy</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 148: Chapter 145 Jiu You Legacy<br/><br/>Translator: 549690339<br/><br/>Upon hearing Fang Wang’s inquiry, Zhou Xue blinked her eyes and stared at him intently, emitting sounds of wonder and amazement.<br/><br/>Just as Fang Wang was about to press for an answer, he heard her reply,<br/><br/>“Without Ascension, one cannot become an Immortal. Without becoming an Immortal, eternal life is unattainable. Even though Ascension might not grant the freedom and leisure one desires, it ultimately forges a path to survival.” When she spoke those words, Zhou Xue’s face bore a resolute expression.<br/><br/>Fang Wang, hearing this, chose not to continue. To him, the idea of becoming an Immortal in the Mortal Realm was just a hypothesis, meaningless to discuss without having achieved it first.<br/><br/>He changed the subject and asked, “How long do you intend to stay at sea this time?”<br/><br/>Zhou Xue turned her gaze back to the lake and said, “I won’t return to Grand Qi for decades. The Fang Family and Great Abyss Gate have both been arranged properly. I have to seek the opportunity I desire.”<br/><br/>“What opportunity do you still need?”<br/><br/>“I’m not like you, with an extraordinary destiny and unparalleled aptitude. My body’s talents are mediocre. Even with past life experiences, I must seek out opportunities. If I want to walk a different path than in my previous life, I need to strive for the opportunities I didn’t have before,” Zhou Xue spoke leisurely, as if discussing a trivial, everyday matter.<br/><br/>Feeling the distance between them narrowing as he listened to her speak, Fang<br/><br/>Wang approached her and said, “Stay on Biyou Island for two years.”<br/><br/>Zhou Xue glanced at him and said, “Why, do you want me to teach you something?”<br/><br/>Fang Wang shook his head with a wry smile, “No. I want to teach you something.”<br/><br/>Three months later.<br/><br/>Xiao Zi and Zhao Zhen stood by the lake, looking at the two on the wooden platform. Zhou Xue took out an oil lamp, preventing them from hearing what the two were discussing. They couldn’t even discern the conversation from their lip movements. However, they saw Zhou Xue’s brows tightly furrowed while Fang Wang’s face remained calm.<br/><br/>In these three months, Fang Wang taught Zhou Xue the Heavenly Dao True Skill.<br/><br/>Having learned so many peerless techniques from Zhou Xue, he naturally wanted to reciprocate.<br/><br/>He wasn’t afraid of Zhou Xue surpassing him in the Heavenly Dao True Skill either. His greatest advantage was the speed of his cultivation, unmatched by anyone, and he intended to integrate even more techniques into the Heavenly Dao True Skill in the future.<br/><br/>Which is to say, the current Heavenly Dao True Skill was merely the basic version!<br/><br/>Zhou Xue looked up at Fang Wang, her eyes filled with complexity, and asked, “Did you really create it?”<br/><br/>Fang Wang’s smile curved upward as he responded, “I’ve integrated the Three Great True Cultivations from Ji Hao Sect and meditated for many years before achieving enlightenment. What do you think?”<br/><br/>Taking a deep breath, Zhou Xue said, “Even in The Upper Realm, this technique would be considered superior. Common sense dictates that such a technique shouldn’t originate from the Mortal Realm. Could the phenomenon from years ago have been caused by you?”<br/><br/>“Perhaps.”<br/><br/>Zhou Xue smiled, her face reflecting a mixture of emotions.<br/><br/>Time and again, Fang Wang surprised her. She couldn’t help but compare him with the peerless geniuses she had heard of in her past life, and greater ambitions began to take shape in her heart.<br/><br/>Perhaps her greatest gain from reincarnation was not walking an unprecedented path but ensuring Fang Wang’s survival.<br/><br/>Was this genius, who should have made all the proud geniuses of the world look pale, destined to die before even beginning his Cultivation journey?<br/><br/>Fang Wang quite enjoyed her gaze—with not only the satisfaction of repaying a debt but also the gratification of recognition.<br/><br/>Zhou Xue looked at Fang Wang and said earnestly, “This technique must not be taught to others, including the Fang Family. First, it would bring significant trouble; second, the technique is profound and elusive. Even if you teach it to your family members, they would not be able to master it in their lifetime. Based on my judgment, even if I were to cultivate this technique, I’m afraid it would be difficult to achieve Great Completion before Ascension.”<br/><br/>Fang Wang wasn’t surprised. After all, it had taken him one thousand four hundred and twenty years to cultivate the Heavenly Dao True Skill to Great Perfection!<br/><br/>Plus, the time spent on the Three Great True Cultivations altogether exceeded three thousand one hundred years!<br/><br/>And that was three thousand years of doing nothing else but sleeping, fully dedicated to cultivation!<br/><br/>How long would it take others to reach the same level?<br/><br/>“I’m not that foolish. I’m only teaching you, especially since you’ve also taught me many techniques. No one has had a greater impact on my path of cultivation than you,” Fang Wang replied.<br/><br/>This was the truth. The Solaris Scripture alone earned him the qualifications to pursue all kinds of opportunities!<br/><br/>Otherwise, even in possession of the Heavenly Palace, he would have had to start with the most basic techniques and work his way up. Perhaps he could eventually acquire the Three Great True Cultivations, but it would take much longer.<br/><br/>Zhou Xue and Fang Wang looked at each other, falling into a brief silence.<br/><br/>After a moment, Zhou Xue remarked with emotion, “What a remarkable Heavenly Dao True Skill. It truly deserves to be named after the Heavenly Dao. I will start by memorizing the foundational practice. I will cultivate it.”<br/><br/>The fact that an Immortal Venerable was willing to learn it spoke volumes of the Heavenly Dao True Skill’s power.<br/><br/>Fang Wang couldn’t resist asking, “What is your current strength? How does it compare to the Mahayana Realm?”<br/><br/>Zhou Xue blinked and said, “The same as you. Although my realm has not reached the Mahayana Realm, I possess the strength to compete with it.”<br/><br/>Fang Wang waved his hand, “I certainly can’t compete with the Mahayana<br/><br/>Realm; I haven’t even fought with it.”<br/><br/>Soon after, Zhou Xue stood up, and Fang Wang followed suit.<br/><br/>“There is something I have been hesitant about, but now I am not,” Zhou Xue said, looking towards the horizon.<br/><br/>Fang Wang asked what it was.<br/><br/>Zhou Xue replied, “I want you to help me kill someone.”<br/><br/>Fang Wang narrowed his eyes and asked, “Who?”<br/><br/>Zhou Xue answered calmly, “The Jiu You True Person of the Eternal Life Pavilion. He was one of the Ascenders from our past life, and in that life, he became the greatest disaster of the Southern Celestial Sea. He opened the Jiu You Spring Eye in the Southern Celestial Sea, disrupting the order of Yin and Yang. With the Spring Eye wide open, countless evil spirits emerged, bringing calamity to the living, and he did it all to gain the Jiu You heritage in the Underworld. Following that, both the human clan’s sects and the Demon Race’s forces hunted him, but to no avail. In the end, he became one of the most powerful beings in the Mortal Realm. Only the Great Saint who possessed the Nine Lives Precious Spirit could suppress him, yet not kill him.”<br/><br/>“In about thirty years, the Eternal Life Pavilion will host an internal trial where both the twenty-four True Persons and the seventy-two Sword Lords can go. Assassinating the Jiu You True Person during the trials is the best opportunity. Doing so could also elevate you to True Person status. Moreover, during this trial, the Jiu You True Person will receive a Jiu You opportunity which he will use later to prepare for the Jiu You Spring Eye plan. I am not one of the pavilion’s Sword Lords, and I have an opportunity that I cannot afford to miss. The timing is just around the trial’s schedule, and the two locations are far apart.”<br/><br/>Upon hearing this, Fang Wang couldn’t help but ask, “Are you doing this for all living beings?<br/><br/>Zhou Xue’s gaze turned icy as she said, “Of course I’m not that righteous. Apart from the hatred in the Mortal Realm, we have an even greater grudge after Ascending. In our past life, my disciples and I suffered many attacks from powerful enemies, among them the Jiu You True Person.”<br/><br/>Fang Wang remained silent.<br/><br/>This was the first time Zhou Xue had mentioned her cause of death.<br/><br/>Zhou Xue looked at him and said, “I didn’t have this intention originally. It was only after hearing about your victory over Ye Canghai that I started thinking this way. But Ye Canghai is nothing compared to the Jiu You True Person, so I only thought about it until now. You have created the Heavenly Dao True Skill, and its might is sufficient to kill the Jiu You True Person.”<br/><br/>“The Jiu You heritage is the most mysterious of inheritances. Even after my<br/><br/>Ascension in the previous life, I couldn’t fülly unravel the mysteries of the Jiu You heritage. Yet one thing is for certain: the Jiu You True Person who obtained this heritage is the most enigmatic and unrestrained among those of us who Ascended.”<br/><br/>Locking eyes with her, Fang Wang said, “Alright.”<br/><br/>“You don’t need to feel obligated. The actions of the Jiu You True Person afterward benefited only himself. The number of creatures that died because of him reached tens of millions and is incalculable,” Zhou Xue added.<br/><br/>Fang Wang laughed and said, “Your enemies are my enemies. In Grand Qi, I stand out sharply, but there are very few who dare to trouble me or the Fang Family. It must be you who have been resolving these matters behind the scenes. ”<br/><br/>Seeing his smile, Zhou Xue’s icy demeanor also melted away as she said with a gentle laugh, “The Jiu You True Person is ruthless. There will be at least three True Persons who will die by his hand during the trials. You must be careful. If you cannot defeat him, then give up and leave it to me to solve later.”<br/><br/>Fang Wang shrugged and said, “If I really can’t beat him, I will run. After all, while the green hills last, there’ll be wood to burn.”<br/><br/>Zhou Xue shook her head, smiling in spite of herself, then turned and waved her hand, saying, “I’m off.”<br/><br/>“So soon? Don’t we still have thirty years?” Fang Wang quickly asked.<br/><br/>“I plan to create a Great Saint for the Fang Family and secure three more Ascension spots. There’s no time to waste.”<br/><br/>Zhou Xue didn’t look back; she lifted her hand, and the oil lamp flew into her sleeve. She then rose into the air and swiftly flew into the dense fog by the sea, disappearing from sight.<br/><br/>Without Fang Wang needing to activate the Formation, she deftly maneuvered through the fog several times and easily exited the Formation.<br/><br/>Fang Wang watched the direction she left in, suddenly feeling a pang of guilt.<br/><br/>His contributions to the Fang Family paled in comparison to Zhou Xue’s efforts. In fact, his peaceful Cultivation life, untroubled by familial issues, was largely thanks to Zhou Xue.<br/><br/>Xiao Zi quickly approached Fang Wang with curiosity, asking, “Young Master, what were you two discussing? It took so long.”<br/><br/>Fang Wang answered, “Nothing much. Go and call Zhu Yan in.”<br/><br/>“Ah? You are taking him as your disciple?”<br/><br/>“Go now!”<br/><br/>“Okay!”<br/><br/>Xiao Zi immediately sprang into action, while Fang Wang took out the Biyou Jade Token and opened the Formation in front of Zhu Yan.<br/><br/>Soon after, Zhu Yan, having assumed human form, came to Fang Wang cautiously. He knelt before Fang Wang, his forehead touching the ground.<br/><br/>Xiao Zi and Zhao Zhen stood not far away, watching them with curiosity.<br/><br/>Fang Wang asked, “What do you know about the affairs of the sea?”<br/><br/>Zhu Yan quickly lifted his head and said, “I was born in the Southern Celestial Sea, and I know nearly everything about it. Sword Lord, what would you like to know? Or is there someone in particular you wish to inquire about?”<br/><br/>Fang Wang looked at him and asked, “Do you know of the Jiu You True Person?”<br/><br/>Zhu Yan nodded and said, “Of course, one of the Eternal Life Pavilion’s twenty-four True Persons. The Jiu You True Person once paid a visit to my father.”<br/><br/>Could the Sword Lord be aiming for a position among the True Persons?<br/><br/>So ruthless?<br/><br/>I like it!<br/><br/>Repressing his excitement and feeling as though he was about to become a part of Fang Wang’s faction, Zhu Yan said.<br/><br/>Without any change in expression, Fang Wang commanded, “Continue.”<br/><br/>Zhu Yan excitedly began to elaborate, “The Jiu You True Person is truly talented, the youngest of the twenty-four True Persons, but also the most controversial. He did not become a True Person through the cultivation of the Eternal Life Pavilion but advanced to that position step by step through slaughter. He killed… the commanders of Heaven, Earth, Profundity, and<br/><br/>Yellow….”\t\t\t\t\t\t</div>", "images": {}, "success": true}