{"id": 142, "url": "https://www.novelhall.com/i-became-an-immortal-on-mortal-realm-32879/14302258.html", "title": "Chapter 142 - Chapter 142: Chapter 139: The Realm Of The Sword Sovereign Of The Yellow Glyph_L", "volume": 2, "volume_title": "Volume 2", "body": "<h1>Chapter 142 - Chapter 142: Chapter 139: The Realm Of The Sword Sovereign Of The Yellow Glyph_L</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 142: Chapter 139: The Realm of the Sword Sovereign of the Yellow Glyph_l<br/><br/>Translator: 549690339<br/><br/>Ye Canghai stared at Fang Wang, his gaze flickering as he pondered Fang Wang’s words.<br/><br/>Was it a threat, or was it well-intentioned advice?<br/><br/>Ye Canghai slowly retreated; he was seriously injured and indeed needed a place and time to heal.<br/><br/>He noticed that the thick fog he had passed on his way here had closed up again, indicating the other party intended to conceal his tracks.<br/><br/>Whether it was well-intentioned or not, he had no choice but to stay here for the time being.<br/><br/>Ye Canghai moved a hundred yards away and sat down by the seaside to meditate, facing Fang Wang directly with nothing to obstruct their view.<br/><br/>Fang Wang closed his eyes, continuing to reflect on the integration of cultivation techniques.<br/><br/>Enjoying the caress of the sea breeze, he felt quite comfortable, but Ye Canghai was not so relaxed.<br/><br/>Ye Canghai couldn’t see through Fang Wang, and his instincts told him that Fang Wang was very strong.<br/><br/>On the first day, Ye Canghai was on full alert, fearing that Fang Wang would make a move, yet Fang Wang didn’t even open his eyes.<br/><br/>Seven consecutive days passed.<br/><br/>Xiao Zi came looking for Fang Wang and saw Ye Canghai. It approached Fang<br/><br/>Wang and asked in a low voice, “Young Master, who is he?”<br/><br/>Fang Wang, without opening his eyes, answered, “A man of fate; don’t go near him, he is very dangerous to you.”<br/><br/>Xiao Zi grew even more curious upon hearing these words, and Ye Canghai’s brow furrowed.<br/><br/>What did he mean by “dangerous to you”?<br/><br/>Could he only pose a threat to a demon snake?<br/><br/>Ye Canghai was infuriated internally and decided to teach Fang Wang a lesson once his injuries had healed.<br/><br/>Of course, if Fang Wang didn’t play any tricks, he wouldn’t kill Fang Wang either. Fang Wang had allowed him onto the island, which was tantamount to saving his life.<br/><br/>Xiao Zi did not linger and left quickly; with Ye Canghai around, it had to set aside its own matters.<br/><br/>In the days that followed, cultivators occasionally passed by outside the thick<br/><br/>fog but no one dared to offend or disturb Biyou Island.<br/><br/>On the thirteenth day after Ye Canghai arrived on the island, his strength had mostly recovered. He opened his eyes and looked at Fang Wang, asking, “Do you know who I am?”<br/><br/>Fang Wang opened his eyes, meeting Ye Canghai’s gaze in the air, and said,<br/><br/>“The traitor of the Heavenly Sect, Ye Canghai, right?”<br/><br/>Upon hearing this, Ye Canghai narrowed his eyes and said, “If you know who I am, why would you help me? If the real people of the Lin Cliff become aware, they will not let you go; this too would be a crime of betrayal against the sect.” “I saved you, not for the Heavenly Sect, but because of your other identity.”<br/><br/>“Which identity?”<br/><br/>“The Jin Xiao Sect.”<br/><br/>Ye Canghai was taken aback. He immediately stood up, faced Fang Wang with a cold expression, and asked sternly, “Who exactly are you, and what are your intentions?”<br/><br/>Fang Wang didn’t answer his question. Instead, he remarked, “You may have betrayed the Heavenly Sect, but they seem to not want to kill you. It’s been quite a while, and no one has bothered me; surely, your escape didn’t go completely unnoticed.”<br/><br/>Cultivators from the Heavenly Sect passed by outside the fog from time to time, suggesting that the Heavenly Sect suspected that Ye Canghai had escaped to Biyou Island.<br/><br/>Ye Canghai said coldly, “Who on earth are you?”<br/><br/>Fang Wang was about to reply when Ye Canghai’s voice followed:<br/><br/>“Since you won’t say, then I will force it out of you!”<br/><br/>Before his words fell, a gust of strong wind hit them, bringing with it waves of dust and sand.<br/><br/>With a boom!<br/><br/>A layer of energy blocked Ye Canghai’s right palm, preventing it from advancing any further.<br/><br/>There he stood before Fang Wang, his robe violently billowing, his feet planted in the sand, as a terrifying surge of energy devastated the beach, making the sea churn and the mountains on the island tremble.<br/><br/>Xiao Zi and Zhao Zhen, who were training demon soldiers in the shallow sea, couldn’t help but turn to look, both the demon and the ghost showing shocked expressions.<br/><br/>Such an overwhelming aura!<br/><br/>Ye Canghai was moved, his pupils dilated; even with all his strength, his right palm could not push forward.<br/><br/>Fang Wang, who had activated his Body-protecting Divine Barrier, slowly stood up. He looked at Ye Canghai from the side with a condescending gaze and asked, “Legend says you possess boundless strength and can tear apart Great Demons with your bare hands, but your current performance is somewhat disappointing to me.”<br/><br/>These words deeply stung Ye Canghai as his eyes instantly reddened.<br/><br/>“You’re courting death!”<br/><br/>Ye Canghai roared lowly, his voice resembling the growl of a primeval beast. His aura suddenly surged, dispersing the clouds in the sky.<br/><br/>Fang Wang’s gaze sharpened as his right hand broke through the Body-protecting Divine Barrier and locked onto Ye Canghai’s neck with lightning speed, lifting him into the air and quickly ascending a thousand yards high.<br/><br/>Ye Canghai wanted to resist, but being locked by Fang Wang, he was unable to move at all.<br/><br/>Suddenly, Fang Wang released him, causing him to retreat in shock.<br/><br/>The two had already rushed out of Biyou Island’s Formation, and the cultivators wandering around Biyou Island felt their aura and turned to look.<br/><br/>“It’s Ye Canghai!”<br/><br/>A cultivator exclaimed, while other people’s attention was on Fang Wang.<br/><br/>They all guessed Fang Wang’s identity.<br/><br/>Eternal Life Pavilion, Sword Sovereign of the Yellow Glyph!<br/><br/>Ever since the Sword Sovereign of the Yellow Glyph had moved to Biyou Island, there had been frequent discussions about him within the Heavenly Sect.<br/><br/>On the seas, the reputation of the Sword Sovereign of the Yellow Glyph was immense, even surpassing some of the Xuanzi Warlords. The name of the Sword Saint was widely spread, and given that Fang Wang had obtained the Sword Sovereign from the Sword Saint, his existence naturally sparked curiosity.<br/><br/>Ye Canghai steadied himself. He activated his cultivation technique, and the Spiritual Power within his body turned into scorching flames that enveloped him. A pair of black bracelets formed on his wrists, their surfaces gleaming with a cold light.<br/><br/>He could no longer care about being discovered by the Heavenly Sect cultivators; all he wanted now was to defeat Fang Wang!<br/><br/>Fang Wang raised his right hand, slowly forming it into a fist. An indescribable, terrifying pressure enveloped heaven and earth, and Ye Canghai, who faced Fang Wang directly, felt it most acutely, prompting a reaction from him.<br/><br/>What kind of momentum is this…<br/><br/>So overwhelmingly domineering!<br/><br/>Ye Canghai’s heart stirred with shock and awe. At this moment, he reminisced about the battle that took place over two hundred years ago, when he had felt this same sense of helplessness.<br/><br/>A white flame overflowed from Fang Wang’s body, and his eyes turned exceptionally cold. He declared in a chilling voice, “This punch is named Nine Dragons Tyrant Fist. You are the first to face it, and you will be the first to die by its hand!”<br/><br/>His voice echoed under the firmament, clear enough for those Heavenly Sect cultivators to hear.<br/><br/>Ye Canghai, as if facing a formidable enemy, immediately circulated his cultivation, and from the black bracelets on his wrists flames arose, forming into two black lions.<br/><br/>Just at this moment!<br/><br/>Fang Wang fiercely thrust his fist forward, a punch that shocked the heavens and earth!<br/><br/>Whine—<br/><br/>The sound of a dragon’s roar exploded, causing cultivators from the Heavenly Sect, Ye Canghai, Xiao Zi, and Zhao Zhen to momentarily falter. Under their stunned and frozen gazes, Fang Wang’s punch unleashed a black dragon that swept across the sky, an unstoppable force bearing down on Ye Canghai.<br/><br/>Despite being overwhelmed, Ye Canghai still instinctively swung his fist, and his twin fists launched forward, the two black lions rapidly growing in size, as large as mountains, charging towards the front in intersecting paths.<br/><br/>Boom!<br/><br/>The black dragon tore through the two black lions with an extremely domineering stance, swiftly passing over Ye Canghai’s body and continuing its rampage, leaving behind two trails of qi in the sky that extended to the horizon, a truly magnificent sight.<br/><br/>Ye Canghai trembled all over, his long hair flying chaotically, blood uncontrollably spouting from his mouth. He looked at Fang Wang in disbelief and stammered, “You… who exactly are you?”<br/><br/>No sooner had he spoken than his body violently exploded, turning into a mist of blood that dispersed in the air.<br/><br/>This scene left the Heavenly Sect cultivators dumbfounded.<br/><br/>Fang Wang waved his sleeve, dispersing the blood mist in the sky, then flew back to Biyou Island. A great fog billowed up, quickly re-shrouding Biyou Island once again. “Ye Canghai is dead!”<br/><br/>On the wooden platform beside Spirit Eye Lake on Biyou Island.<br/><br/>Xiao Zi and Zhao Zhen looked curiously at the fallen Ye Canghai on the ground.<br/><br/>At this moment, Ye Canghai was unconscious, covered in blood, and looked incredibly disheveled.<br/><br/>Fang Wang stood to one side, looking at the sky, when a voice reached his ears, “Many thanks, fellow Daoist. I will remember this favor. If there’s anything in the future, you may directly instruct the Heavenly Sect.”<br/><br/>Fang Wang smiled. Such a grand tone—it must be the Sect Master of the Heavenly Sect!<br/><br/>When Ye Canghai had erupted with momentum earlier, Fang Wang felt a divine sense far stronger than Ye Canghai’s sweep over him, and he immediately guessed what was happening. That’s why he brought Ye Canghai up to the skies above Biyou Island to battle.<br/><br/>He even deliberately said a few words. The powerful divine sense did not take this opportunity to come over, which showed that it was not an enemy of Ye Canghai, but was there to protect him.<br/><br/>Fang Wang had no intention of killing Ye Canghai to begin with, so he conveniently did a favor, helping Ye Canghai put on an act.<br/><br/>“That guy’s momentum was so strong just now, but he couldn’t even catch a single punch from the young master. Young master, did you create Nine Dragons Tyrant Fist yourself?” Xiao Zi curiously asked.<br/><br/>Fang Wang nodded, “I created it by combining Mountain River Town Heaven<br/><br/>Fist and Nine Dragons Divine Transformation Art. How’s its power?”<br/><br/>Xiao Zi opened her snake mouth, exclaiming, “It’s absurdly powerful…” Zhao Zhen’s gaze towards Fang Wang was very complicated.<br/><br/>Mountain River Town Heaven Fist and Nine Dragons Divine Transformation Art were both profound and sublime techniques. Fang Wang, not yet a hundred years old, had managed to combine these two techniques to create an even more powerful fist technique, displaying such insight…<br/><br/>Zhao Zhen became more certain of one thing; even possessing the Heaven Yuan Spirit Treasure, it would be hard to compare with Fang Wang. Fang Wang’s insight was more terrifying than the treasure’s talent!<br/><br/>To easily combine the techniques created by a Great Saint..<br/><br/>Zhao Zhen recalled the expectations the Great Saint had for Fang Wang. Now it seemed that Fang Wang truly could combine the Three Great True Cultivations into a set of even stronger techniques!<br/><br/>In the Heavenly Sect, the grand hall was silent as the grave.<br/><br/>Some people looked uncomfortable, some had schadenfreude grinning on their faces, others were visibly cautious, each harboring their own thoughts.<br/><br/>“It’s good that Ye Canghai died by the hands of the Sword Sovereign of the Yellow Glyph; at least this matter can be deemed concluded,” a female elder stood up and said.<br/><br/>Her words broke the silence, leading other cultivators to speak up in turn.<br/><br/>“With just one punch, the Sword Sovereign of the Yellow Glyph killed Ye Canghai. No wonder he could snatch the Yellow Glyph Sword Sovereign Order from the Sword Saint.”<br/><br/>“With such cultivation, why doesn’t he compete for the Warlord’s Command of the Xuanzi Glyph?”<br/><br/>“This is good news. Having such a powerful figure open a Dao Field in our waters will certainly boost the prestige of the Heavenly Sect. I propose we publicize this matter.”<br/><br/>“You’re right! We must publicize it. Not only can it shut the mouths of other big sects, but it will also enhance the reputation of our Heavenly Sect.”<br/><br/>“But… Ye Junior Brother was, after all, one of our Heavenly Sect, shouldn’t we have dealt with him ourselves? Today the Sword Sovereign of the Yellow Glyph didn’t consult us; what if in the future he becomes a threat to us?”<br/><br/>While most cultivators were excited, there were still a few who held concerns.<br/><br/>Sect Master Lin Cliff True Person slowly opened his eyes and said, “Let’s leave it at that. Had Ye Canghai escaped, it would’ve caused even more trouble. On this matter, the Heavenly Sect owes the Sword Sovereign of the Yellow Glyph a favor. Indeed, we should publicize it.”<br/><br/>Once he spoke, the matter was settled.<br/><br/>Those elders of Ye Canghai’s generation had a feeling of sorrow for another’s misfortune and could only sigh.<br/><br/>“Sect Master, in your opinion, at what realm does the Sword Sovereign of the Yellow Glyph stand?”<br/><br/>An attractive young man stood out; he bore a proud air and an aristocratic demeanor..\t\t\t\t\t\t</div>", "images": {}, "success": true}