{"id": 143, "url": "https://www.novelhall.com/i-became-an-immortal-on-mortal-realm-32879/14302261.html", "title": "Chapter 143 - Chapter 143: Chapter 140: Gaining Fame In The Ocean, Pursuing Trivial Details", "volume": 2, "volume_title": "Volume 2", "body": "<h1>Chapter 143 - Chapter 143: Chapter 140: Gaining Fame In The Ocean, Pursuing Trivial Details</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 143: Chapter 140: Gaining Fame in the Ocean, Pursuing Trivial Details<br/><br/>Translator: 549690339<br/><br/>The real person facing the cliff turned to the handsome young man who had asked the question and answered calmly, ‘Ye Canghai was at the third layer of the Golden Body Realm, and even though he was injured, his strongest aspect was his physical body. The Sword Sovereign of the Yellow Glyph killed him with just one punch, which suggests that his realm could very well surpass the<br/><br/>Golden Body Realm.”<br/><br/>Surpass the Golden Body Realm!<br/><br/>Upon hearing this, the cultivators in the hall were not surprised but felt it was only to be expected.<br/><br/>The handsome young man furrowed his brow, seemingly lost in thought.<br/><br/>The real person facing the cliff continued leisurely, “Xin’er, don’t try to challenge the Sword Sovereign of the Yellow Glyph. Since ancient times, those who have vied for the Warlord’s Command have always been the fierce and battle-hungry type, and he comes from the Eternal Life Pavilion. If you provoke him and die by his hand, Heavenly Sect can only swallow this grievance.”<br/><br/>The handsome young man, named Xuanyuan Xin, furrowed his brow even tighter upon hearing this.<br/><br/>The others joined in to dissuade him.<br/><br/>Xuanyuan Xin was a Heaven Yuan Spirit Treasure and the greatest hope of the Heavenly Sect, yet the Sword Sovereign of the Yellow Glyph was not someone Heavenly Sect could afford to provoke.<br/><br/>Xuanyuan Xin snorted, “I’m not that reckless!”<br/><br/>Upon his words, everyone finally felt at ease and then began to discuss the true identity of the Sword Sovereign of the Yellow Glyph.<br/><br/>With such ability, he certainly wasn’t a nobody.<br/><br/>Biyou Island.<br/><br/>Ye Canghai had been unconscious for a full three days and nights. When he woke up, the wounds on his body had scabbed over, and his life force had somewhat recovered. During that time, Fang Wang had fed him quite a few precious herbs.<br/><br/>He opened his eyes to a blue sky filling his vision, his mind in a haze.<br/><br/>“I’m not dead?”<br/><br/>Ye Canghai muttered to himself, subconsciously lifting his right hand to inspect it.<br/><br/>“Of course you’re not dead. Had I wished to kill you, I wouldn’t have let you<br/><br/>onto the island,” came a voice, startling Ye Canghai into hastily getting up. His gaze locked onto Fang Wang not far away.<br/><br/>Ye Canghai instinctively took a few steps back, but then he regained his senses and asked cautiously, “You won’t kill me?”<br/><br/>The battle they had previously, where he was utterly defeated without the ability to fight back, instilled fear in him, a fear that came from facing death.<br/><br/>He had truly thought he was going to die then.<br/><br/>His Golden Body was incredibly powerful; within the Golden Body Realm, he was certainly among the elite because he was a body cultivator. But the body he trusted the most had been shattered by Fang Wang with a single punch.<br/><br/>Shattered, that was his sensation.<br/><br/>“Why would I kill you? I told you before, the reason I saved you was due to your association with Jin Xiao Sect,” Fang Wang replied.<br/><br/>Ye Canghai was at a loss for words.<br/><br/>After calming down, he reflected on the previous conflict and realized that indeed, he had been the first to strike.<br/><br/>Ye Canghai took a deep breath, bent down with a fist to palm salute, and said, “I was reckless. I thank you, senior, for your grace both in saving my life and for your forgiveness. What do you wish for me to do?”<br/><br/>Fang Wang smiled, “Leave now. The Heavenly Sect shouldn’t make things difficult for you. But you’d better keep a low profile and not be so hot- tempered. ”<br/><br/>Hearing that Fang Wang had no demands, Ye Canghai felt even more ashamed.<br/><br/>He realized he had encountered a true sage and once again made a gesture of respect to Fang Wang.<br/><br/>He hesitated for a moment, then couldn’t help asking, “May I dare to ask for a senior’s name? I simply wish to remember the kindness you’ve shown to me…”<br/><br/>Fang Wang chuckled, “Fang Wang.”<br/><br/>Ye Canghai silently took note, then suddenly, as if struck by a thought, his eyes widened and he hurriedly asked, “Could you be from Grand Qi?”<br/><br/>Fang Wang nodded, and at that moment, Xiao Zi leaped out from the lake and said, “The Tian Sheng of Grand Qi is indeed my young master!”<br/><br/>Ye Canghai felt as if he had been struck by lightning, his mouth agape, wanting to say something but unable to speak as countless thoughts clogged his throat. Fang Wang couldn’t help but ask, “What? Are you surprised?”<br/><br/>Ye Canghai struggled to compose himself and said, “I am acquainted with your brother Fang Xun. I have often heard him mention you…”<br/><br/>In the end, he still chose to regard Fang Wang as a senior.<br/><br/>In the Cultivation World, strength was revered, and besides, he owed Fang Wang his life.<br/><br/>“Fang Xun? How did you come to know him?” Fang Wang asked with a frown.<br/><br/>Considering the timeline, Fang Xun should only be around thirty-four years old. No matter how gifted, he was unlikely to have surpassed the Spirit Elixir Realm, so how could he have come to know Ye Canghai?<br/><br/>Ye Canghai began to explain how he met Fang Xun, and when Fang Wang learned that Zhou Xue had introduced them, he immediately felt relieved. After Ye Canghai finished speaking, Fang Wang asked, “Where is Fang Xun<br/><br/>Although the time he spent with his siblings was short and they had more than fifty years age difference, blood relations nonetheless made him naturally concerned for Fang Xun’s safety.<br/><br/>Ye Canghai responded, “I’ve arranged for him to cultivate on a group of islands, waiting for me to find a treasure that could change his fate.”<br/><br/>Fang Xun’s talent was average, and his Lifespirit Treasure was of the lower grade Mysterious Origin. In fact, such a grade wasn’t considered low in the Cultivation World, but due to Fang Wang’s presence, it made him appear quite mediocre. Therefore, he wanted to follow in Fang Hanyu’s footsteps and obtain the Absolute Heart Evil Eye, which could change one’s destiny, but Zhou Xue arranged another opportunity for him and sent him southward to be taken care<br/><br/>of by Ye Canghai.<br/><br/>Fang Wang didn’t hold Zhou Xue accountable for possibly placing Fang Xun in danger. Fang Xun had grown up and should have his own life. Everyone has aspirations, and if Zhou Xue could offer him hope, that was already a great kindness.<br/><br/>“What rare and precious treasures do you need? I’ll see if I have any, ” Fang Wang offered.<br/><br/>Ye Canghai shook his head, “What he needs are not Heavenly Materials and Earthly Treasures but Five Elements Dao Stones. I came to the Heavenly Sect this time for one such stone. Although I’ve been severely injured, I’ve successfully acquired it.”<br/><br/>Fang Wang fell silent.<br/><br/>After a few moments, he couldn’t help asking, “For you, was it worth it?”<br/><br/>Canghai carelessly spoke, “I owe a life debt to the Demon Monarch, and now all I do for Fang Xun is to repay that favor. Besides, these five sects happen to be my sworn enemies.”<br/><br/>Overhearing this, Fang Wang’s impression of Canghai changed. He said, “Since that’s the case, if you can truly change Fang Xun’s fate, then consider it repaying the favor you owe me.”<br/><br/>But Canghai shook his head, speaking earnestly, “That’s a separate matter. I appreciate your kind intentions, and I take them to heart. As long as I live in this world, I uphold the virtue of righteousness. I will do everything in my power to help Fang Xun change his fate. If you ever need me in the future, just say the word. Even if it is through a sea of flames and blades, I, Canghai, will have no fear!”<br/><br/>Fang Wang looked at Canghai and felt that his words were not empty—Canghai truly meant what he said.<br/><br/>After nightfall, Canghai departed, his figure vanishing into the dense fog.<br/><br/>Xiao Zi laid on Fang Wang’s shoulder, watching Canghai’s retreating figure, and remarked with feeling, “This guy certainly has some backbone.”<br/><br/>Fang Wang didn’t comment further. He plucked Xiao Zi off his shoulder and tossed her aside, continuing to ponder the integration of cultivation techniques.<br/><br/>“Master, may I bring a few monsters with decent talents here to cultivate?” Xiao Zi cautiously inquired.<br/><br/>Fang Wang grunted in acknowledgement, too lazy to say more.<br/><br/>Xiao Zi immediately expressed her gratitude, then quickly left.<br/><br/>For Fang Wang, Canghai was merely an interlude.<br/><br/>Canghai’s presence had confirmed Fang Wang could sweep through the Golden Body Realm. Next, he was to fully integrate cultivation techniques, and create a Divine Skill that even Great Saints couldn’t imagine.<br/><br/>Within Canglan Academy, in the Saint Talent Court.<br/><br/>The disciples entered one by one, preparing to receive teachings. Gu Li still wore her veil, not walking alongside anyone.<br/><br/>“Did you hear? Canghai was killed by the Sword Sovereign of the Yellow Glyph!”<br/><br/>“Tsk, I’ve heard about it too, it’s unbelievable. They say Canghai was punched to death.”<br/><br/>“The Nine Dragons Tyrant Fist sounds very formidable, I heard it was created by the Sword Sovereign of the Yellow Glyph.”<br/><br/>“The Heavenly Sect couldn’t do anything to Canghai, but he was unlucky to flee into Biyou Island where the Sword Sovereign of the Yellow Glyph was cultivating, and got beaten to death there.”<br/><br/>“I heard that Canghai desperately pleaded with the Sword Sovereign of the Yellow Glyph, but in the end, the sovereign wouldn’t soften his heart—it was too brutal.”<br/><br/>Gu Li listened to her fellow disciples discussing the maritime upheaval, silently taking note without voicing her opinion.<br/><br/>When she heard that the predecessor Sword Sovereign of the Yellow Glyph was the Sword Saint, she couldn’t help but worry.<br/><br/>The Warlord’s Command of the Eternal Life Pavilion recognizes the mandate, not the person. Could it be that the Sword Saint returned to Grand Qi because the Sword Monarch Order was taken from him?<br/><br/>If that were the case, as a disciple of the Sword Saint, wouldn’t Fang Wang become an enemy of the current Sword Sovereign of the Yellow Glyph?<br/><br/>Gu Li frowned, her worries intensifying.<br/><br/>She had no doubt about Fang Wang’s talents, but the Sword Sovereign of the Yellow Glyph’s performance was clearly stronger than the Golden Body Realm, definitely a centuries-old formidable being.<br/><br/>She decided to write a letter back to Fang Wang after returning, informing him of this so that he would have some awareness of the Sword Sovereign of the Yellow Glyph’s strength.<br/><br/>At that moment, Chu Yin entered the court, causing the other disciples to immediately surround him.<br/><br/>Chu Yin, who had completed Spiritual Refinement, had a heroic aura and no longer carried the timid demeanor from before, now embodying the image of a proud genius.<br/><br/>“Junior Brother Chu, which master have you pledged to?” one female disciple curiously asked.<br/><br/>The others looked at Chu Yin with curiosity as well, to which Chu Yin shook his head, “I haven’t taken any master here. Before entering the academy, I had already pledged to a master, and he will be the only master I recognize in this life.”<br/><br/>It was the first time he spoke of this matter, revealing a look of admiration and anticipation when mentioning his master.<br/><br/>The disciples were curious and pressed him to reveal his master’s identity.<br/><br/>Chu Yin raised an eyebrow, proudly chuckled, and said, “One day, when my master’s name shakes the Southern Celestial Sea, I will tell you then, that person is my master! ”<br/><br/>His words left everyone imagining the figure of a seclusive, dedicated cultivator of old.<br/><br/>To them, someone capable of accepting Chu Yin as a disciple must be powerful. The lack of fame suggested a hidden expert.<br/><br/>In this vast world, not all cultivators were competitive or sought fame and fortune—there were many who secluded themselves to cultivate and focused solely on seeking the Dao.<br/><br/>Gu Li was also curious about which Great Cultivator would take a talent like Chu Yin as a disciple.<br/><br/>After Canghai’s departure, Fang Wang began to sit in meditation.<br/><br/>This sitting lasted three years.<br/><br/>During those three years, he didn’t practice cultivation, but delved into understanding the Dao, because if he were to circulate his power, it would interfere with his contemplation of the cultivation techniques’ pathways.<br/><br/>He had cycled through over a thousand fusion schemes and gradually began to find the right feeling, his state of mind growing calmer.<br/><br/>By the Spirit Eye Lake, a dozen monsters followed Xiao Zi in their practice. They included crabs, lobsters, sea turtles, birds, and more, varying in species and none too large in size. All aligned side by side, they made for a comical sight.<br/><br/>Xiao Zi looked at Fang Wang, continuously flicking out her serpent tongue.<br/><br/>In these three years, Fang Wang hadn’t caused any disturbances in the spiritual energy, indicating he wasn’t cultivating, which concerned Xiao Zi.<br/><br/>She feared Fang Wang was fixating overly.<br/><br/>Could Fang Wang succeed in a matter of years what the Descending Dragon Great Saint had failed to achieve in a lifetime?<br/><br/>As Xiao Zi hesitated over whether to advise Fang Wang, he suddenly closed his eyes. Following that, he opened them again, and an overwhelmingly oppressive aura exploded from within him..\t\t\t\t\t\t</div>", "images": {}, "success": true}