{"id": 154, "url": "https://www.novelhall.com/i-became-an-immortal-on-mortal-realm-32879/14304629.html", "title": "Chapter 154 - Chapter 154: Chapter 151: Breaking Through The Golden Body Realm", "volume": 2, "volume_title": "Volume 2", "body": "<h1>Chapter 154 - Chapter 154: Chapter 151: Breaking Through The Golden Body Realm</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 154: Chapter 151: Breaking Through the Golden Body Realm<br/><br/>Translator: 549690339<br/><br/>Fang Wang did not know how widespread his reputation had become, but after that battle, no sword cultivator dared to come to Biyou Island, and he knew he had succeeded.<br/><br/>Fang Hanyu, Qin Hong, and Qin Tang joining did not make Biyou Island any livelier; all three of them needed time to recuperate.<br/><br/>Fang Wang’s Spiritual Power recovered very quickly. While the other three were still healing, he continued his cultivation.<br/><br/>Helping Fang Hanyu was a small matter; the most important thing was still the trial at the Eternal Life Pavilion.<br/><br/>In the blink of an eye.<br/><br/>Half a year had gone by.<br/><br/>One day, Qin Hong and Qin Tang came to visit Fang Wang to thank him for saving their lives and for offering them refuge.<br/><br/>“Fang Hanyu is my clan member. You saved him, and I saved you; it’s only right and proper. You two need not worry about it,” Fang Wang said with a light laugh.<br/><br/>The four of them sat around a wooden table while Zhao Zhen was serving them wine.<br/><br/>Although it wasn’t the first time seeing Zhao Zhen, every time Fang Hanyu saw Zhao Zhen’s respectful demeanor, he felt uncomfortable in his heart.<br/><br/>This was once the Emperor of Grand Qi.<br/><br/>Fang Wang opened his mouth and asked, ‘What do you two plan to do next?”<br/><br/>Qin Hong replied, “We are ordered by the Demon Monarch to protect Fang Hanyu until we bring him back to the Jin Xiao Sect. What comes next still depends on what Fang Hanyu decides to do.”<br/><br/>All three looked at Fang Hanyu, who pondered and then said, “I shall stay on the island for another five years. I’ll leave once I have control over the Ten Thousand Year Sword Spirit.”<br/><br/>Upon hearing this, Qin Hong turned to look at Fang Wang, who nodded with a smile, “If that’s the case, both of you might as well stay. My Biyou Island is also considered a prime cultivation spot.”<br/><br/>“Not just prime, this island must be very expensive, right?” Qin Tang asked curiously.<br/><br/>Fang Wang revealed the price, which made Qin Tang gasp, while Qin Hong thought it was somewhat cheap; probably the status of Sword Sovereign of the Yellow Glyph played a role.<br/><br/>Qin Hong was curious about Zhu Yan’s identity and couldn’t help asking.<br/><br/>Fang Wang did not hide anything. Upon hearing that Zhu Yan, the seventh son of the imperial family, had become Fang Wang’s mount, both father and daughter were shocked. However, thinking of Fang Wang’s performance, they also found it reasonable.<br/><br/>Fang Hanyu looked at Fang Wang, feeling a multitude of emotions in his heart.<br/><br/>No matter how vast the world was, Fang Wang always made all other talents pale in comparison.<br/><br/>The four of them chatted for several hours before dispersing. Fang Wang took it as a relaxation and felt quite good about it.<br/><br/>In the following time, Fang Hanyu gradually mastered the Ten Thousand Year Sword Spirit until a year later when he was finally able to wield the power of the Ten Thousand Year Sword Spirit as he wished.<br/><br/>That night, Fang Hanyu sat on a cliff, facing the sea breeze, his heart communicating with the Ten Thousand Year Sword Spirit.<br/><br/>“Brat, stay away from that guy!”<br/><br/>“He’s too dangerous. He is definitely not from the Mortal Realm; he must be an incarnation from The Upper Realm. Ten thousand years ago, when the Descending Dragon Great Saint defied the will of The Upper Realm, there were beings from The Upper Realm who descended. I saw them, and I didn’t expect that such a being could still exist in the Mortal Realm!”<br/><br/>The Ten Thousand Year Sword Spirit spoke of Fang Wang with a tone full of fear.<br/><br/>Fang Hanyu found this amusing. He had grown up with Fang Wang since childhood and knew Fang Wang’s background very well.<br/><br/>However, as the Ten Thousand Year Sword Spirit became more and more exaggerated, he also began to waver.<br/><br/>Could Fang Wang truly be an incarnation of an Immortal God from The Upper Realm?<br/><br/>He suddenly recalled something. When he was a child, he overheard the old servants in his household discussing that Fang Wang was the reincarnation of a monster. At his birth, Grand Qi experienced a violent rainstorm for seven whole days.<br/><br/>His expression became peculiar as he couldn’t help but look towards the brightly lit pavilion complex in the distance.<br/><br/>“All beings from The Upper Realm are evil; they see the mortals in the Mortal Realm as ants, manipulable at will, trampling them whenever they please. And if they remain in the Mortal Realm, they certainly have their mission to fulfill…<br/><br/>The Ten Thousand Year Sword Spirit went on with increasing zeal, while Fang Hanyu listened with growing impatience.<br/><br/>He could believe that Fang Wang was a reincarnated Immortal God, but he would never believe that Fang Wang was a demon that would slaughter the masses. He knew too well that Zhao Qi’s rise to power and the improvements to the livelihood of Grand Qi’s people were all thanks to Fang Wang’s staunch support.<br/><br/>Cultivators often treated mortals like ants too. Yet Fang Wang was kinder and more compassionate than most cultivators.<br/><br/>After cutting off contact with the Ten Thousand Year Sword Spirit, Fang Hanyu cast aside distracting thoughts and began to cultivate.<br/><br/>Five years had passed, and Fang Wang had reached the Cross-Void Realm Ninth Level.<br/><br/>That day, Fang Hanyu and the others bid their farewells.<br/><br/>Fang Wang watched them depart and, after they left the island, reactivated the formation.<br/><br/>Over the five years, occasionally there were sword cultivators who came near Biyou Island, but they only dared to watch from a distance; no one dared to invade Biyou Island.<br/><br/>With Qin Hong possessing the strength of the fourth level of the Golden Body Realm and Qin Tang being at the third level of the Cross-Void Realm, and with the protection of this father-daughter pair, they should be able to return safely to the Jin Xiao Sect. Moreover, the attention focused on them now was not as intense as before.<br/><br/>Fang Wang continued his cultivation, preparing to break through to the Golden Body Realm in one go and then create his sixth Lifespirit Treasure.<br/><br/>Afterward, he could wait for the trial at the Eternal Life Pavilion to commence while studying swordsmanship in the meantime.<br/><br/>Zhu Yan was still cultivating the True Combat Technique, and Xiao Zi was also cultivating. As the first batch of little monsters had grown up, they began to take turns teaching other monsters how to cultivate, and a level division began to emerge.<br/><br/>Another vear passed.<br/><br/>That evening, Fang Wang sensed something and immediately took out the Yellow Glyph Sword Sovereign Order. He probed it with his divine sense, and soon he heard an authoritative voice:<br/><br/>“In ten years, the Eternal Life Pavilion will hold an internal trial. The location, rewards, and specific time for this trial can be checked through the token.” An ancient voice followed Fang Wang’s divine sense, entering into his mind.<br/><br/>At last, it has come!<br/><br/>Although it was a bit off from the time Zhou Xue mentioned, the discrepancy wasn’t large.<br/><br/>Fang Wang immediately used the Yellow Glyph Sword Sovereign Order to locate the trial site, and quickly found it. In the illusory map, the trial site was marked with an extremely bright purple-red light spot, brighter than all the others.<br/><br/>As soon as his divine consciousness touched it, a large amount of information flooded his mind.<br/><br/>The trial had no specific rules; it was simply a secret realm discovered by the<br/><br/>Eternal Life Pavilion, where True Persons, Warriders, kin, and disciples of the Eternal Life Pavilion were allowed to enter and seek treasures. There was no prohibition against killing each other, but extra tokens could be submitted to the Eternal Life Pavilion in exchange for treasures.<br/><br/>In addition, the Eternal Life Pavilion also announced many treasures that could be exchanged for, which could only be obtained with resources from within the trial.<br/><br/>It is worth mentioning that the Eternal Life Pavilion’s internal trials, although brutal, were not compulsory; they were based on a registration system.<br/><br/>Fang Wang was not interested in those treasures; he was only interested in Jiu You True Person.<br/><br/>This was the first time Zhou Xue had asked him to do something, and after his investigations, he found that Jiu You True Person indeed had a notorious reputation. To exterminate such a scoundrel, he bore no psychological burden.<br/><br/>Before that, he had to first achieve the Golden Body Realm!<br/><br/>All he needed to do was leave a few months for travel.<br/><br/>Fang Wang put down the Yellow Glyph Sword Sovereign Order and continued his cultivation.<br/><br/>After Fang Hanyu and the other two left, he began to cultivate without any reservations, not fearing the leakage of the aura of the Heavenly Dao True Skill, and the monsters on Biyou Island had already gotten used to his presence.<br/><br/>As Fang Wang harbored the intent to break through, his vast aura enveloped the entire island, to the extent that even Zhu Yan couldn’t help but turn to look in his direction.<br/><br/>Fang Wang couldn’t care about that now; he had to break through!<br/><br/>With the Heavenly Dao True Skill, which transcended the ordinary, and the assistance of the Solaris Scripture, everything seemed to naturally fall into place. He didn’t encounter any resistance.<br/><br/>After more than half a year had passed,<br/><br/>Fang Wang finally reached the critical moment for his breakthrough, with the nature’s spiritual energy frantically entering his body, refining his physique.<br/><br/>A Golden Body is not just a name. When reaching this realm, the physical body truly undergoes a transformation. In the previous realms, cultivators improved their cultivation level, divine consciousness, and soul, but the strong spiritual power also required a robust body to withstand it. Thus, the Golden Body Realm was established.<br/><br/>Only by reaching the Golden Body Realm and transforming the physical body beyond the mortal could one pursue even higher levels of cultivation.<br/><br/>As Fang Wang began his breakthrough, he did not encounter a heavenly tribulation.<br/><br/>The Heavenly Dao True Skill earned him the recognition of the heavens and earth. From then on, his cultivation would no longer be against the Heavenly Dao: naturallv, there would be no talk of crossing tribulations.<br/><br/>For other cultivators, the situation was different: the higher the realm, the more terrifying the thunder tribulation. In the seas, the success rate of breaking through from the Cross-Void Realm to the Golden Body Realm was less than fifty percent, meaning that half of the people attempting to achieve the Golden Body Realm would die and vanish from the Dao.<br/><br/>Zhu Yan came to the edge of Spirit Eye Lake, feeling Fang Wang’s presence. Suddenly, he realized something and looked astonished.<br/><br/>“This movement of spiritual energy… Could it be that he’s just starting to break into the Golden Body Realm?”<br/><br/>This conjecture seemed absurd to Zhu Yan, but when he thought of Fang Wang’s age, it seemed very likely.<br/><br/>In other words, Fang Wang could wield the power of the Mahayana Realm while still in the Cross-Void Realm?<br/><br/>Zhu Yan racked his brains but could not think of anyone with battle talent comparable to Fang Wang!<br/><br/>But Fang Wang had no idea what Zhu Yan was thinking; he was focused on his breakthrough.<br/><br/>Several days later.<br/><br/>The vast aura that enshrouded Biyou Island had dissipated, and all the monsters breathed a sigh of relief.<br/><br/>Fang Wang had officially advanced to the Golden Body Realm, radiating white light from his body, with wisps of energy continually emerging. His physical strength had made a tremendous leap. At this moment, his spiritual power was also strengthening.<br/><br/>The entire breakthrough process met with no obstructions, which was a testament to the power of the Heavenly Dao True Skill—a completely perfect supporting cultivation technique.<br/><br/>Fang Wang continued to consolidate his cultivation level. The oppressive force of the Heavenly Dao faded, but around him, within a hundred feet, nature’s spiritual energy vehemently rushed toward him, causing even Zhu Yan to dare not approach.<br/><br/>A month later.<br/><br/>The rate of increase of Fang Wang’s cultivation level leveled off, and his cultivation was fully consolidated. He stood up and headed to the Suling Platform on the mountain.<br/><br/>After Qu Xunhun delivered the Heavenly Dao Spirit Stones, Zhu Yan and Zhao Zhen helped construct a Suling Platform.<br/><br/>Zhu Yan watched Fang Wang fly towards the Suling Platform with astonishment.<br/><br/>He initially thought the Suling Platform was prepared for future disciples, but why had the master gone there right after his breakthrough?<br/><br/>He then entertained a bold guess.<br/><br/>Under his gaze, Fang Wang landed on the Suling Platform and began to meditate.<br/><br/>Now, Zhu Yan was utterly convinced.<br/><br/>The master was embarking on Spiritual Refinement!<br/><br/>“It makes sense, his talent is beyond what Heaven Yuan Spirit Treasures can define. If he has multiple Lifespirit Treasures, then that would make sense. Indeed, worthy of being the reincarnation of an Immortal,” Zhu Yan thought, and soon diverted his gaze.<br/><br/>No matter how inconceivable Fang Wang’s performances were by now, Zhu Yan could accept them.<br/><br/>What should the sixth Lifespirit Treasure be shaped into? Fang Wang wondered as he sat on the Suling Platform.<br/><br/>His current Lifespirit Treasures were the Heavenly Palace Halberd, Rainbow<br/><br/>Sword, Qiankun Fan, Reincarnation Bell, and the Six Harmonies and Eight Desolations Seal. Although he rarely needed to use Lifespirit Treasures, he still chose to perfect his strength as much as possible.<br/><br/>One day, he would encounter an opponent that required all his strength to aereat..\t\t\t\t\t\t</div>", "images": {}, "success": true}