{"id": 159, "url": "https://www.novelhall.com/i-became-an-immortal-on-mortal-realm-32879/14305468.html", "title": "Chapter 159 - Chapter 159: Chapter 156 Hope The True Person Gives Face 1", "volume": 2, "volume_title": "Volume 2", "body": "<h1>Chapter 159 - Chapter 159: Chapter 156 Hope The True Person Gives Face 1</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 159: Chapter 156 Hope the True Person Gives Face 1<br/><br/>Translator: 549690339<br/><br/>Engulfed in a fierce battle, Zhu Yan gradually lost his sanity, especially with more and more spectators emerging from all directions, which further agitated him.<br/><br/>As a prodigy and the Son of the Demon Emperor, his reputation mattered to him since childhood, as he needed to outshine his brothers. He was unclear if his father had been invited to this trial at the Eternal Life Pavilion, but the news of the battle would certainly spread. If he were to be defeated, his father would undoubtedly regard him with even greater disdain.<br/><br/>With this thought, Zhu Yan’s face began to transform demonically, and as he attacked wildly, he gradually lost control of his transformed body.<br/><br/>When a Great Demon is forced to reveal its true form during a battle, it signifies being driven into a corner.<br/><br/>A transformed demon wouldn’t easily show its true form, not because they aspire to be human, but rather they pursue a certain demeanor. Demon history is even longer than that of humans; legend has it that the creator of the human race was a demon which, after transforming, created humans in the image of demons, allowing humans to be born at a height that most demons long to reach.<br/><br/>Zhu Yan sprouted wings on his back, and demon qi swirled around his fists like two balls of black flames ferociously burning. His attacks became even more disorderly, causing many Great Cultivators to shake their heads in regret.<br/><br/>Compared to his elder brother, Zhu Li, he still falls short!<br/><br/>Just then, a voice reached Zhu Yan’s ears, “This is a good opportunity to practice your True Combat Technique.”<br/><br/>Fang Wang’s voice!<br/><br/>Upon hearing this, Zhu Yan’s expression lifted, and he immediately put the True Combat Technique mental method into practice. Although he hadn’t mastered the True Combat Technique, he was thoroughly familiar with its mental method.<br/><br/>His onslaught slowed as he continued to attack while recalling the True Combat Technique, which made many Great Cultivators raise their eyebrows in surprise.<br/><br/>How did this youngster manage to calm down amid extreme anger?<br/><br/>Inside the house.<br/><br/>A smile played on Fang Wang’s lips as he withdrew his divine consciousness, no longer paying attention.<br/><br/>He sensed an aura somewhat similar to Zhu Yan’s but much more powerful, far beyond the Golden Body Realm. It must belong to that Zhu Emperor.<br/><br/>With Zhu Yan’s father present, even if the Tianzi Sword Monarch could win, it wouldn’t be possible to kill Zhu Yan!<br/><br/>Moreover, Zhu Yan might not necessarily lose!<br/><br/>Tang Changbai also perceived a faint killing intent locking onto him, causing a silent alarm in his heart and forcing him to restrain himself, not daring to fight with all his might.<br/><br/>The Zhu Emperor has arrived!<br/><br/>This put Tang Changbai in a difficult spot, caught between a rock and a hard place.<br/><br/>If he were to cease fighting, it would be a blow to his own face.<br/><br/>But continuing the fight would also lead to disgrace.<br/><br/>Zhu Yan, however, wasn’t concerned with such things; he was seeking the sensation of the True Combat Technique in battle, and gradually, he seemed to have grasped a marvelous feeling.<br/><br/>All things in heaven and earth seemed to halt in his eyes, even Tang Changbai’s movements slowed.<br/><br/>After the time it takes an incense stick to burn.<br/><br/>“Enough, both of you should stop, the tolerance of Eternal Life Pavilion has its limits!”<br/><br/>A cold voice echoed between heaven and sea, snapping Zhu Yan back to reality. Tang Changbai also pulled back, ceasing his swordplay.<br/><br/>Tang Changbai snorted coldly, “Do not think this matter ends here. I will await your master in the trial!”<br/><br/>Unable to probe Fang Wang’s real strength this time left him quite unsatisfied, but before the watchful eyes of the crowd. he had to talk tough to recover face.<br/><br/>A chill returned to Zhu Yan’s calm face as he responded coldly, “You will regret uttering these words!”<br/><br/>Tang Changbai no longer wasted his breath and left with a flick of his sleeve.<br/><br/>Zhu Yan glanced in a certain direction, then flew back to the residence of the Sword Sovereign of the Yellow Glyph.<br/><br/>The moment he landed, Xiao Zi, Zhao Zhen, and Chu Yin came forward to welcome him; they were excited, for they viewed the recent battle as a tie.<br/><br/>To Xiao Zi, Zhao Zhen, and Chu Yin, both Zhu Yan and Tang Changbai exuded an aura that was fear-inspiring.<br/><br/>Qu Xunhun shook his head, then soared away.<br/><br/>Zhu Yan didn’t linger for long in conversation and quickly retreated to another courtyard, contemplatively recollecting the wonderful sensation he experienced during the battle.<br/><br/>This fight spread rapidly, and although Fang Wang of the Yellow Glyph Sword Sovereign Order had not shown himself, his reputation had been broadcasted across the islands.<br/><br/>A piece of news circulated swiftly, containing the Zhu Emperor’s response to an inquiry about his opinion on Zhu Yan’s choice. Surprisingly, the Zhu Emperor wasn’t angry but uttered a meaningful statement:<br/><br/>“Everything has its destiny. The path he walks may not be laughable.”<br/><br/>Time flew rapidly, Fang Wang stayed in the residence without stepping out. During this period, the Eternal Life Pavilion buzzed with more activity, and even Xiao Zi and Chu Yin couldn’t resist going out to enjoy the excitement, fortunately without causing trouble.<br/><br/>Three months later, the internal trial of the Eternal Life Pavilion was about to begin.<br/><br/>A violent roar came from the sky, followed by a hoary voice:<br/><br/>“The internal trial of the Eternal Life Pavilion is about to begin. Trial participants and honored guests, please enter the Eternal Life Tower.”<br/><br/>Fang Wang opened his eyes, rose, and after some thought, changed into a set of black clothes.<br/><br/>It reflected his mood!<br/><br/>Fang Wang stepped out of the room, followed by the others. Qu Xunhun, who had been waiting in the courtyard, saw that everyone was assembled and said,<br/><br/>“Sword Lord, follow me.”<br/><br/>He leaped up, with the rest closely behind.<br/><br/>Looking up, I saw towering amidst the stars above the floating islands, an enormous tower built of redwood and golden bricks. Each floor had large lanterns hanging on all sides, bright and luminous, with cultivators and demons flying in every direction. As they approached the massive tower, their figures shrank until they seemed to disappear.<br/><br/>“They will be able to watch the battles from within the Eternal Life Tower, so you don’t need to worry about their safety. Once the trial is over and you leave the secret realm, you will return to the Eternal Life Tower,” Qu Xunhun said, turning back to Fang Wang.<br/><br/>Fang Wang nodded slightly, his gaze lingering on the Eternal Life Tower, his heart filled with curiosity.<br/><br/>What rank could this treasure be?<br/><br/>It must surpass Magic Artifacts and reach the rank of Magical Artifacts, and not of a low level either!<br/><br/>Speeding along, Fang Wang drew a lot of attention, none of which he cared about.<br/><br/>Under Qu Xunhun’s guidance, they reached the fourth floor and flew through a window. The window itself was extravagantly large, with both its length and breadth measuring a hundred Zhang.<br/><br/>Landing on the ground and looking around, the place was teeming with people. The corridors of the Eternal Life Tower were exceedingly spacious, with countless cultivators and demons scattered across the floor, each engaged in their conversations, bustling with activity.<br/><br/>Fang Wang’s eyes were drawn to a red column of light in the distance. The diameter of the red light was at least three hundred zhang, resembling magma surging upwards. Standing on the spacious corridor, one did not need to squeeze to the edge to see the red column.<br/><br/>“That’s the transportation formation. When the trial begins, you simply fly into it. With the Yellow Glyph Sword Monarch Order, you can enter the trial, while the others can use it to watch the battles. During the watching process, the Eternal Life Pavilion will also regularly hold auctions,” Qu Xunhun explained, and just by looking at this formation, Fang Wang could feel the profound foundation of the Eternal Life Pavilion.<br/><br/>It was hard to imagine what kind of cultivator could establish such a formation.<br/><br/>“Are you also participating in the trial?” Xiao Zi asked curiously, perching on Fang Wang’s shoulder.<br/><br/>Qu Xunhun nodded, “It’s a rare opportunity. I have to consider it for myself.”<br/><br/>“I really want to go in there too,” Xiao Zi remarked wistfully.<br/><br/>Qu Xunhun just smiled and did not respond.<br/><br/>Participants weren’t allowed to bring their Demon Pets, and he couldn’t change that rule.<br/><br/>The group headed toward the edge of the rooftop, which had no railing, offering a view of the scene below and allowing them to look up at the floors above.<br/><br/>“Fang Daoist friend, you’ve finally arrived.”<br/><br/>A familiar voice called out, and Fang Wang turned to look, seeing the leader of the Heavenly Sect, Linya Daoist, approaching with a group of cultivators.<br/><br/>The Heavenly Sect was on good terms with the Eternal Life Pavilion, so their invitation was to be expected. In fact, Heavenly Sect had been in the Southern Celestial Heaven for a year already.<br/><br/>Fang Wang greeted Linya Daoist with a smile.<br/><br/>Zhu Yan raised an eyebrow, looking at a man, and said, “Xuanyuan Xin, you’re here too. After this is over, shall we have a fight?”<br/><br/>Xuanyuan Xin, the top genius of the Heavenly Sect, Heaven Yuan Spirit Treasure.<br/><br/>Faced with Zhu Yan’s challenge, Xuanyuan Xin shook his head, “I don’t want to fight with you. A brute like you doesn’t understand the true essence of cultivation. Fighting you would be of no help to my practice.”<br/><br/>Zhu Yan grew exasperated and stepped forward to continue bickering with Xuanyuan Xin. The two obviously had a great relationship, and the Heavenly Sect cultivators did not stop them, instead turning their gaze to Fang Wang.<br/><br/>They were too curious about this Sword Sovereign of the Yellow Glyph!<br/><br/>Fang Wang looked very young, but his bearing fit perfectly with what the Heavenly Sect cultivators fantasized.<br/><br/>Even clad in black robes, he couldn’t hide his immortal aura.<br/><br/>As time passed, more and more sects entered the Eternal Life Tower. Fang Wang also took notice of the Eternal Life Pavilion disciples.<br/><br/>In addition to the Twenty-Four True Persons, the Seventy-Two Generals, and countless envoys, the Eternal Life Pavilion also cultivated its own disciples. Their number was not inferior to any large sect, and this confidence in acknowledging orders rather than persons was backed by the True Persons, Generals, and envoys who served to manage affairs for the Eternal Life Pavilion and balance the subordinate powers.<br/><br/>Seeing Heavenly Sect conversing with Fang Wang, other Generals and sects plucked up their courage to come forth and make his acquaintance.<br/><br/>It was always good to have more friends when away from home, and Fang<br/><br/>Wang did not refuse. His demeanor quickly made him the center of attention on the floor.<br/><br/>Even a True Person took the initiative to befriend Fang Wang, a man named Tiance True Person, whose strength was in the top five. He was very enthusiastic, creating a favorable impression for Fang Wang.<br/><br/>The other floors were just as lively. The title of Sword Sovereign of the Yellow Glyph was significant, but not yet significant enough to overshadow everyone in the Eternal Life Tower.<br/><br/>Fang Wang heard someone mention that Jiuyang True Person was on the ninth floor, having a pleasant conversation with the Mahayana cultivators.<br/><br/>Jiuyang True Person, one of the Southern Celestial Four Heroes, was a figure whose strength could no longer be defined by the Mahayana Realm. He was one of the strongest beings under five hundred years old on this ocean, with only three others on par with him.<br/><br/>Dugu Wenhun, Chen Shang, Ji Haotian!<br/><br/>An hour later, the trial had yet to begin.<br/><br/>Another True Person came to befriend Fang Wang, coincidentally Jiu You True Person.<br/><br/>Wearing a black robe embroidered with many ghostly patterns, Jiu You True Person had his hair flowing loose, his skin pale, moving as if a fierce ghost wandering among the living. His presence made cultivators around Fang Wang retreat.<br/><br/>“Fang Wang, right? I am Jiu You True Person. Your deeds are very much to my liking, and I would be pleased to befriend someone like you, ” Jiu You True Person said with a smile, though his grin was chilling.<br/><br/>Many cultivators had curious looks on their faces, wondering how Fang Wang would respond.<br/><br/>Fang Wang sized up Jiu You True Person for a moment and replied with a smile, “Funny you should mention it. The reason I’m here for the trial is precisely because of you, True Person.”<br/><br/>Jiu You True Person raised an eyebrow, asking with interest, “For me? Do we have a history?”<br/><br/>Fang Wang smiled, ‘Well, I want to kill you. I hope you’ll do me the honor of seeking me out first when we enter the trial..”\t\t\t\t\t\t</div>", "images": {}, "success": true}