{"id": 151, "url": "https://www.novelhall.com/i-became-an-immortal-on-mortal-realm-32879/14303846.html", "title": "Chapter 151 - Chapter 151: Chapter 148: Fang Wang Save Me! [Third Release, Request For Monthly Pass]", "volume": 2, "volume_title": "Volume 2", "body": "<h1>Chapter 151 - Chapter 151: Chapter 148: Fang Wang Save Me! [Third Release, Request For Monthly Pass]</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 151: Chapter 148: Fang Wang Save Me! [Third Release, Request for Monthly Pass]<br/><br/>Translator: 549690339<br/><br/>The night air was slightly cool as the sea breeze passed through the thick fog and entered Biyou Island.<br/><br/>Lamps were lit in front of the pavilion by Spirit Eye Lake, casting a mesmerizing glow on the scenery.<br/><br/>Fang Wang, who was in the midst of cultivating, suddenly sensed something and took out the Yellow Glyph Sword Sovereign Order. The voice of Qu Xunhun came from within, “Sword Lord, I have located Fang Hanyu’s whereabouts.<br/><br/>Currently, sixteen Dao Sects and countless Loose Cultivators are chasing him. He is heading toward the Heavenly Sect, and it’s very likely that he is seeking refuge with you. He should arrive at Biyou Island in two more days.” Upon hearing this, Fang Wang immediately replied, “Alright, I am aware now.” So many people were hunting Fang Hanyu?<br/><br/>Fang Wang wasn’t worried about Fang Hanyu bringing trouble to him; if Fang<br/><br/>Hanyu was driven to seek him out, it seemed he truly had no other option left.<br/><br/>It had been only half a year since Zhu Li’s departure, and Fang Wang was still far from reaching the ninth level of the Cross-Void Realm. However, he was confident that he could break through to the Golden Body Realm within ten years, especially since he was only one hundred and twelve years old.<br/><br/>Early the next day, Fang Wang got up and went to the seashore. He conjured the Rainbow Sword, sword in hand, and closed his eyes facing the sea.<br/><br/>He began to ponder the fusion of sword techniques.<br/><br/>He wanted to integrate the Celestial Sword Intent with the Jinghong Divine Sword Art. It might not be completed before Fang Hanyu’s arrival, but Fang Hanyu’s predicament inspired him to revisit the Sword Dao.<br/><br/>Zhu Yan flew in the sky, gazing at Fang Wang’s silhouette for a while before returning to Xiao Zi, who was on the other side of the island, instructing a monster on the beach.<br/><br/>“How does the master fare with his Sword Dao?” Zhu Yan asked curiously.<br/><br/>Xiao Zi huffed, “The young master’s Sword Dao is naturally unmatched in this world. His true strength isn’t his fists but the sword in his hand. When he draws his sword, that’s when he’s truly serious.”<br/><br/>Upon hearing this, Zhu Yan felt both ashamed and invigorated.<br/><br/>The stronger Fang Wang was, the more it proved his choice was correct.<br/><br/>“Forget it, I should continue practicing the True Combat Technique.”<br/><br/>Zhu Yan shook his head with a wry smile and turned to leave.<br/><br/>Above the Canghai Sea, a huge Jade Sword flew over island after island, leaving behind myriad traces of Sword Qi.<br/><br/>The man in plain clothes was still riding the sword while his daughter, the woman dressed in blue, stood behind Fang Hanyu, operating five swords. As the five swords waved, countless sword shadows crisscrossed the skies, and the overwhelming Sword Qi rampaged in an unpredictable pattern, wreaking havoc on the numerous Sword Cultivators in the rear.<br/><br/>Thousands of Sword Cultivators pursued them in great numbers, some riding<br/><br/>Flying Swords, others surrounded by swirling Sword Qi. The leading Sword Cultivators, while chasing, unleashed their Swordsmanship, but their Sword Qi temporarily failed to penetrate the Sword Array of the woman in blue.<br/><br/>“Father, my Spiritual Power is almost depleted!”<br/><br/>The woman in blue said urgently, her face weary.<br/><br/>Before the man in plain clothes could respond, Fang Hanyu stood up and said,<br/><br/>“Let me do it!”<br/><br/>The woman in blue glanced at him and scolded, “Stop messing around, your injuries have not yet healed, be careful of backlash from the Sword Soul!”<br/><br/>With the Absolute Heart Evil Eye open, Fang Hanyu looked like a fierce ghost. A smile appeared on his face as he said, “Miss Qin, we have entered the Heavenly Sect’s territory; Biyou Island should not be far. According to the person Mr. Qin captured before, it should take no more than two hours to reach Biyou Island. Let me take over; once we get to Biyou Island, we’ll be safe.”<br/><br/>“But…”<br/><br/>“Let him do it!”<br/><br/>The man in plain clothes cut off his daughter, his tone heavy.<br/><br/>Hearing this, the woman in blue had no choice but to step back behind Fang Hanyu. Fang Hanyu’s gaze intensified, and a giant sword shadow formed of Sword Qi appeared in front, blocking the incoming multitude of Sword Qi.<br/><br/>The man in plain clothes looked back at Fang Hanyu, his eyes full of meaning.<br/><br/>He thought to himself, “Sword Qi Treasure Spirit, Ten Thousand Year Sword Soul, if this child survives this ordeal, he might truly become my greatest reliance in the future…”<br/><br/>Fang Hanyu raised his right hand, and streaks of Sword Qi overflowed from his palm. Upon closer inspection, tiny sword shadows seemed to be swirling. These Sword Qi rapidly coalesced into a blood-red Broad Sword.<br/><br/>Gripping this sword, Fang Hanyu’s right hand trembled violently as if he could no longer hold on to it.<br/><br/>“You’ve just entered the Condensation Spirit Realm; trying to use the power of the Sword Soul is very dangerous!” Qin Tang exclaimed, her blue clothing flapping wildly in the wind, her hair whipped into disarray.<br/><br/>He suddenly lifted the sword, pointing it at the many Sword Qi pursuing them from behind. The blood-red Broad Sword unleashed a bloody rainbow that swept across the sky, immediately scattering the large army of Sword Cultivators in the distance.<br/><br/>But he couldn’t withdraw the sword and had to hold it with both hands.<br/><br/>“Such recklessness!”<br/><br/>Qin Tang muttered under her breath. She immediately sat down to cultivate as she had already run out of Elixirs from being chased for so long. Now, if she wanted to restore her Spiritual Power, she had no choice but to sit and cultivate.<br/><br/>“How dare you intrude into the territory of the Heavenly Sect!”<br/><br/>A bellowing voice came, and figures approached swiftly from the front of the Jade Sword, their presence formidable.<br/><br/>Qin Hong immediately shouted, “We are close friends of the Sword Sovereign of the Yellow Glyph and wish to visit him!”<br/><br/>He was not sure of the relationship between the Sword Sovereign of the Yellow Glyph and the Heavenly Sect, but since the Sword Sovereign had chosen to reside in the sea area of the Heavenly Sect, he guessed their relationship couldn’t be too bad.<br/><br/>Upon hearing this, the Heavenly Sect cultivators immediately stepped aside, not daring to obstruct them.<br/><br/>They wanted to stop the pursuing army of Sword Cultivators from behind, but those people did not announce their sects and instead made their move, attempting to forcefully break through!<br/><br/>On the next leg of their journey, Fang Hanyu and his companions occasionally encountered disciples from the Heavenly Sect. Claiming to know the Sword Sovereign of the Yellow Glyph as an excuse, Qin Hong drove straight through without stopping for a moment. With the impediments from the Heavenly Sect’s disciples, they temporarily evaded the enemy’s pursuit.<br/><br/>Qin Hong didn’t slow down, fearing they would be caught.<br/><br/>Fang Hanyu wanted to sheath his sword but was unable to retract it. He could only hold it with both hands, the tip angled downward, conserving as much Spiritual Power as possible.<br/><br/>“Since you recognize me as your master, why won’t you obey me?”<br/><br/>Fang Hanyu roared in his heart, furious to the extreme.<br/><br/>A sinster voice echoed in his heart: “I have existed for ten thousand years and have seen numerous Sword Cultivators. If you want me to obey you, kid, you’re not qualified yet. Release your killing intent, slaughter all those you’ve seen, starting with the father and daughter behind you. That woman’s five Sword Spirits are delectable; let me devour them!”<br/><br/>“Impossible!”<br/><br/>Fang Hanyu defiantly replied in his mind. He had long noticed that he had developed a difficult-to-control killing intent, but this intent hadn’t changed his nature.<br/><br/>The father and daughter Qin Hong had saved him from a matter of life and death—he would rather die than harm his saviors!<br/><br/>“Indulge in your killing intent, and you can become the strongest Sword<br/><br/>Cultivator. A sword is a weapon, and a weapon is meant for slaughter. The Sword Cultivator who created me slaughtered well over ten million beings in his lifetime. You have the potential to become the next him. Don’t waste your talent; take action!”<br/><br/>The Sword Soul continued to tempt Fang Hanyu, who clenched his teeth and no longer responded, trying his utmost to suppress his Treasure Spirit.<br/><br/>“Just hold on a little longer. Once we reach Biyou Island, I’ll help you suppress him!”<br/><br/>Qin Hong said without looking back, accelerating once again as the Jade Sword’s speed surged.<br/><br/>His Spiritual Power was nearly depleted; he could only trust Fang Hanyu now and rush to Biyou Island as quickly as possible!<br/><br/>An hour swiftly passed.<br/><br/>There were no pursuers behind the Jade Sword, only the anomalies of air streams where the Jade Sword had zoomed past and the blood-red Sword Qi left by Fang Hanyu’s Treasure Spirit.<br/><br/>In just one hour, Fang Hanyu’s Spiritual Power was almost drained, and his form was tottering.<br/><br/>“Is that Biyou Island ahead? The person before mentioned that Biyou Island is shrouded in dense fog.”<br/><br/>Qin Hong’s voice arose, causing Fang Hanyu’s eyes to widen. He bit his teeth and then bellowed, “Fang Wang, save me!”<br/><br/>This roar was earth-shattering, startling even Qin Tang, who was in the midst of Qi Gathering.<br/><br/>Just as Qin Tang was about to speak, Qin Hong’s voice rang out again: “The fog has dispersed; it seems that it really is Biyou Island!”<br/><br/>Qin Tang immediately turned her head to look.<br/><br/>There was an island enshrouded in dense fog ahead. As the fog dispersed, the contours of the island became visible.<br/><br/>Just as Qin Hong was about to open his mouth to inquire about Fang Hanyu, a sudden gust of wind blew, startling him so much that his eyes bulged. He vaguely saw a streak of white rainbow light and instinctively turned his head, his pupils rapidly shrinking. He immediately slowed down the Jade Sword.<br/><br/>Noticing her father’s gaze, Qin Tang followed his glance back. Before she had fully turned her head, she heard a voice, “Why such a loud roar? Afraid I’m asleep?”<br/><br/>Qin Tang looked in the direction of the voice and saw a man in white standing beside Fang Hanyu, with flowing robes and whirling black hair, his profile handsome and carrying a faint smile.<br/><br/>Who else could it be but Fang Wang?<br/><br/>Fang Wang’s right hand reached around the front of Fang Hanyu, gripping his hands, resting on the blood-red Broad Sword.<br/><br/>Hm?<br/><br/>Fang Wang seemed to sense something, and his expression subtly changed.<br/><br/>Fang Hanyu, gritting his teeth with difficulty, said: “My Treasure Spirit has been possessed by a Ten Thousand Year Sword Spirit and is out of control; be careful… it might…”<br/><br/>Fang Wang’s expression turned stern, and with a slight exertion of force in his right hand, the aura of the blood-red Broad Sword dissipated in an instant. Then, the sword transformed into a phantom and vanished.<br/><br/>Before Fang Hanyu could finish speaking, he suddenly felt his hands go empty, the suffocating power of the Sword Spirit retracted into his body, and he was instantly relieved.<br/><br/>His eyes widened in disbelief as he stammered to Fang Wang, “You… how did you…”<br/><br/>Fang Wang quirked an eyebrow and said, “To be so troubled by a mere Sword Spirit, it seems your Sword Dao isn’t strong enough yet. When will you be able to catch up to me?”<br/><br/>Fang Hanyu opened his mouth but held back his words.<br/><br/>Qin Tang’s eyes widened in disbelief, unable to trust what she had seen. All this time, she was the closest to Fang Hanyu and knew full well the power of the Ten Thousand Year Sword Spirit.<br/><br/>Yet, upon this man’s arrival, the Ten Thousand Year Sword Spirit was subdued?<br/><br/>Qin Hong also turned his head, marveling at Fang Wang.<br/><br/>Fang Wang glanced at Qin Hong and said with a light laugh, “Let’s enter the island. It’s time for a period of recuperation within.”<br/><br/>Regaining her composure, Qin Tang said, “There are many Sword Cultivators chasing us!”<br/><br/>Fang Wang gently supported Fang Hanyu’s arm, turning him around, and said witn an alr ot noncnalance, “Nlanyg I wonder It tnelr bones could till tms sea area?<br/><br/>At those words, Qin Tang wasn’t sure how to respond, feeling that this man was incredibly arrogant.<br/><br/>Qin Hong sized up Fang Wang, noting a resemblance to Fang Hanyu. He had previously thought Fang Hanyu had the talent of a genius, but standing beside Fang Wang, even with his Absolute Heart Evil Eye, he felt completely overshadowed.<br/><br/>There was something indescribable about Fang Wang that made it difficult to look away, even with just one glance.\t\t\t\t\t\t</div>", "images": {}, "success": true}