{"id": 150, "url": "https://www.novelhall.com/i-became-an-immortal-on-mortal-realm-32879/14303837.html", "title": "Chapter 150 - Chapter 150: Chapter 147: The Reincarnation Of An Immortal, Unrivaled Under The Heavens", "volume": 2, "volume_title": "Volume 2", "body": "<h1>Chapter 150 - Chapter 150: Chapter 147: The Reincarnation Of An Immortal, Unrivaled Under The Heavens</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 150: Chapter 147: The Reincarnation of an Immortal, Unrivaled Under the Heavens<br/><br/>Translator: 549690339<br/><br/>Hearing about the deeds of Fang Hanyu, Fang Wang thought of Zhou Xue and guessed that the Jin Xiao Sect must have made a move, otherwise, with Fang Hanyu’s strength, obtaining the Ten Thousand Year Sword Spirit would have been nearly impossible.<br/><br/>“Where is Fang Hanyu now?” Fang Wang asked.<br/><br/>He was worried that the Chenjian Sect couldn’t protect Fang Hanyu.<br/><br/>Qu Xunhun answered, “His whereabouts are currently unknown. It’s been three years since he acquired the Ten Thousand Year Sword Spirit.”<br/><br/>Fang Wang nodded, “If there is any news of Fang Hanyu’s whereabouts, inform me with the Token.”<br/><br/>“Understood!”<br/><br/>Qu Xunhun agreed, then talked about some of the tempestuous events at sea. After the time it took to burn incense, he took his leave.<br/><br/>Xiao Zi came to Fang Wang’s side and asked, “Young Master, are you worried about Fang Hanyu?”<br/><br/>Fang Wang closed his eyes and said, “Do not worry. To become a true power, one must go through countless hardships. Let him resolve this on his own.”<br/><br/>“What if a Great Cultivator of the Golden Body Realm makes a move against him?” Xiao Zi pressed.<br/><br/>Fang Wang snorted lightly and said, “Then we will see if he has the fate to live until I learn of it.”<br/><br/>Not far away, Zhu Yan silently took note of the name Fang Hanyu and continued to cultivate.<br/><br/>The True Combat Technique was vast and profound. After ten years of practice, although he had not mastered it, he increasingly found the technique remarkable. Most importantly, Fang Wang had said that once he mastered the True Combat Technique, he would be taught even stronger Cultivation Techniques, including Spells.<br/><br/>The very True Combat Technique made him see the possibility of surpassing his father. If he could learn even stronger exceptional skills, the thought alone thrilled him.<br/><br/>Zhao Zhen floated by the lake, and upon seeing him trembling all over again, he couldn’t help but shake his head.<br/><br/>“Geniuses tend to be arrogant, always thinking they can master all the Divine Skills in the world…”<br/><br/>Thinking this, Zhao Zhen turned to find those little monsters.<br/><br/>The days on Biyou Island passed in tranquility.<br/><br/>However, there is no place in the world that remains peaceful forever. After several months, someone came to break the serenity of Biyou Island.<br/><br/>“Is the seventh brother here?”<br/><br/>A thunderous shout came from beyond the thick fog, sounding like a giant bell. Zhu Yan abruptly opened his eyes and looked to Fang Wang, saying, “Master, my eldest brother Zhu Li has arrived. May I let him in to inform him of my decision?”<br/><br/>Fang Wang took out the Biyou Jade Token, and with a thought, the dense fog began to disperse in the direction from which Zhu Li’s voice came.<br/><br/>Zhu Yan rose and flew off.<br/><br/>After a while.<br/><br/>Zhu Yan returned with a valiant man, the two bearing a strong resemblance to each other. However, Zhu Li was taller than Zhu Yan, clad in black scale armor, with a Roc Iron Crown on his forehead, exuding a formidable aura.<br/><br/>Zhu Li’s face was frosty, the fiery rage in his eyes almost spilling out, while Zhu Yan wore a face full of anticipation, not knowing what the brothers had discussed.<br/><br/>The brothers flew above Spirit Eye Lake, and Zhu Li looked at Fang Wang and said in a deep voice, “Sword Lord, you dare let my younger brother serve as your mount? You show no respect to my emperor father!”<br/><br/>Fang Wang slowly opened his eyes, his gaze calm as he looked toward him. Xiao Zi retorted, “Ask your brother, did my Young Master ever force him?”<br/><br/>Zhu Li, trying to control his anger, said, “My seventh brother tells me that your fist is the strongest in the world; let me experience it then. If you truly are that strong, I will not stop my brother from being your mount and will even help you persuade my emperor father!”<br/><br/>Zhu Yan quickly made a gesture of respect and said, “Master, please do not kill him. Just scare him a bit.”<br/><br/>“Kill me? Ha! Zhu Yan, you truly are a failure!”<br/><br/>Zhu Li glared at Zhu Yan, his tone laced with frustration and disappointment.<br/><br/>Fang Wang rose into the air, sighing and saying, “Well then, for the sake of Zhu Yan, I will let you experience it—this one time only. My fist is meant for slaying enemies.”<br/><br/>Zhu Li scoffed, “I’ve seen plenty of fists meant for killing enemies. I hope the Sword Lord can convince me!”<br/><br/>Under the blue sky, a massive gap appeared in the thick fog surrounding Biyou Island. Following the gap, a swath of clouds in the firmament was torn asunder, stretching all the way to the horizon.<br/><br/>The flora on Biyou Island quivered, then gradually returned to calm.<br/><br/>At this moment, Zhu Li was sweating profusely, his pupils shaking, his body trembling. The iron crown on his forehead had flown off, his long hair in disarray, and next to his left ear, a fist lingered less than four centimeters away from his ear, which was bleeding.<br/><br/>“I… concede,” Zhu Li uttered with a trembling voice, eyes full of fear and despair.<br/><br/>Fang Wang slowly withdrew his fist without saying a word and turned to fly back to the wooden platform to continue his meditation and cultivation.<br/><br/>Zhu Yan hurriedly flew to Zhu Li’s side and pulled him towards the beach.<br/><br/>Xiao Zi and Zhao Zhen showed no surprise, but the little monsters were overwhelmingly excited.<br/><br/>On the beach, Zhu Yan laughed triumphantly, “Big brother, now you<br/><br/>understand my choice! He is no ordinary man. Following him, I may be ridiculed for the next few hundred years, but ultimately, even as his mount, I shall be revered by all beings.”<br/><br/>Zhu Li came back to his senses. He wanted to say there was nothing so divine, but the harrowing experience had not yet left him, and the mere thought made him shudder uncontrollably.<br/><br/>Countless emotions converged, and Zhu Li could only spit out one word: “Fine.”<br/><br/>He heavily patted Zhu Yan on the shoulder, then turned and left, taking advantage of the fog not having gathered yet, to leave this place.<br/><br/>Zhu Yan looked at his desolate and cold back, a smile appearing on his face as he secretly thought, “Father didn’t pass on the true teachings to me, only to you, but I will make you regret it. Sooner or later, when you recall today, you will regret not having followed in my footsteps!”<br/><br/>Intimidating Zhu Li didn’t bring Fang Wang any pleasure, he continued to cultivate.<br/><br/>Meanwhile, Zhu Yan chatted with Xiao Zi and Zhao Zhen, hiding together.<br/><br/>Upon hearing that Zhu Li was at the seventh layer of the Golden Body Realm, Xiao Zi and Zhao Zhen’s eyelids twitched violently.<br/><br/>It was then that they realized just how terrifying Fang Wang’s strength was.<br/><br/>Xiao Zi and Zhao Zhen had watched Fang Wang grow up, and being the closest to Fang Wang, they couldn’t comprehend his rate of growth.<br/><br/>“Let me tell you, I hate my eldest brother the most, to be precise, I despise all my brothers and sisters. They look down on my mother because she is a fox spirit, and have excluded me since childhood. My brother’s visit this time seems caring, but in reality, it was an opportunity for him to suppress me. I understand all this…”<br/><br/>Zhu Yan said with his arms folded across his chest and a stream of curses.<br/><br/>Upon hearing this, Zhao Zhen immediately empathized, as he too felt this way being in the royal family.<br/><br/>After Zhu Yan finished speaking, Xiao Zi’s impression of him changed, and couldn’t help but comfort him: “It’s fine, following our young master is the greatest fortune in the world. You may be a mount, but there’s no difference between you and us. Let me tell you, our young master is only one hundred eleven years old, do you know what that means?”<br/><br/>“What? One hundred…<br/><br/>Zhu Yan’s eyes widened in astonishment, he exclaimed and, the next second, he quickly shut his mouth, fearing Fang Wang would see him.<br/><br/>Zhao Zhen nodded and said, “That’s right, I can vouch for it. Such age, yet he can sweep through the Golden Body Realm, even we don’t know how strong he truly is. If this isn’t an Immortal reincarnated, what is?”<br/><br/>Zhu Yan was stunned, unable to speak. As a genius, he understood what Fang Wang’s age represented.<br/><br/>Impossible!<br/><br/>Such a terrifying talent shouldn’t exist in the Mortal Realm!<br/><br/>Which meant that the Sword Lord really could be an Immortal reincarnated…<br/><br/>Zhao Zhen sighed, “You might not believe it, but I was supposed to die by his hands…”<br/><br/>He began to recount his own past, and Xiao Zi didn’t stop him.<br/><br/>Zhu Yan listened intently, his expression growing complicated. By the time he finished, only excitement remained.<br/><br/>He tried to view Fang Wang from Zhao Zhen’s perspective and found it truly terrifying. Fang Wang, having no important figure supporting him, relied solely on his own comprehension and talent to reach this day, he was convinced that Fang Wang wasn’t a mere mortal.<br/><br/>Perhaps, challenging the Sword Sovereign of the Yellow Glyph was the most fortuitous decision of his life!<br/><br/>In the future, his status as a mount might become his most proud identity!<br/><br/>Above the boundless ocean, a huge Jade Sword sped along, brimming with Sword Qi, unstoppable.<br/><br/>Atop the Jade Sword sat three figures, with a middle-aged man in plain clothes at the very front – his face weathered, meditating as he piloted the sword. Behind him was a woman in blue, also meditating, but occasionally looking back at the man behind her. That man was none other than Fang Hanyu.<br/><br/>Fang Hanyu’s eyes were tightly closed, with a blood -colored vertical line between his eyebrows, faintly emitting a golden glow.<br/><br/>“Kid, are you really going to find that so-called Sword Sovereign of the Yellow Glyph? The mere Yellow Glyph Monarch can’t protect you; what exactly is your relationship with him?” the man in plain clothes asked without turning his head.<br/><br/>The woman in blue turned and said, “Yes, if it really won’t do, let’s leave the ocean, return to the Jin Xiao Sect.”<br/><br/>Fang Hanyu replied, “No, the main base of the Jin Xiao Sect is in Grand Qi. If we go back, it will bring catastrophe upon Grand Qi. Let’s go to Biyou Island. The Sword Sovereign of Biyou Island possesses abilities surpassing that of the<br/><br/>Yellow Glyph Monarch! I believe in him!”<br/><br/>The man in plain clothes sighed and said, “Well then, let’s go. But at the earliest, it will take half a month to get there. I hope we can hold out that long.”<br/><br/>The woman in blue scoffed, “Dad, didn’t you boast about being invincible in the world? How come the first time you take me out for training, we’re being chased so pitifully?”<br/><br/>The man in plain clothes blushed, mumbling, “How would I have known the Demon Monarch had arranged such a dangerous mission for me? This kid’s really ruthless too, gaining the approval of the Ten Thousand Year Sword Spirit. The hatred he’s attracted is just too much; who knows what kind of monsters will pop up next…”<br/><br/>“Hmph, so you’re not invincible after all!”<br/><br/>“Cough, cough, in the sea from which your mother and I come, your dad is indeed invincible…”<br/><br/>This father-daughter pair started to bicker, and Fang Hanyu felt extremely guilty listening to their conversation.<br/><br/>However, recalling the achievements of the Sword Sovereign of the Yellow Glyph he had heard of earlier, his heart filled with fervor.<br/><br/>He knew that Fang Wang had inherited the Sword Monarch Order, so he regarded Fang Wang as hope.<br/><br/>If it were other tribe members, Fang Hanyu would fear getting them involved, but Fang Wang often told him that if he encountered trouble he couldn’t resolve, to find him early to avoid irreversible tragedies and regrets.<br/><br/>“Fang Wang, you often boast that you have never been defeated. This time, you better not fail… I’ve brought you a great treasure!”<br/><br/>Fang Hanyu thought frowningly, then opened his eyes, the blood pupil and green iris of the Absolute Heart Evil Eye were so frightening and sinister.<br/><br/>Just at that moment, sounds of tearing through the air came from behind.<br/><br/>“Dammit, these guys really don’t know when to stop. Precious daughter, form up, let’s make sure they come but never return,” the man in plain clothes cursed. As his words fell, the woman in blue immediately stood up, turned toward the back of Fang Hanyu, and with a wave of her right hand, five Treasured Swords materialized around her.\t\t\t\t\t\t</div>", "images": {}, "success": true}