{"id": 157, "url": "https://www.novelhall.com/i-became-an-immortal-on-mortal-realm-32879/14304725.html", "title": "Chapter 157 - Chapter 157: Chapter 154 Tianzi Sword Monarch? Not Enough!_L", "volume": 2, "volume_title": "Volume 2", "body": "<h1>Chapter 157 - Chapter 157: Chapter 154 Tianzi Sword Monarch? Not Enough!_L</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 157: Chapter 154 Tianzi Sword Monarch? Not Enough!_l<br/><br/>Translator: 549690339<br/><br/>Teaching Xiao Zi the Executioner Immortal Ghost God Sword, Fang Wang mainly did it to release his pent-up emotions. Of course, if Xiao Zi wanted to continue learning in the future, he would not be stingy with his guidance.<br/><br/>However, given Xiao Zits comprehension abilities, who knows how many years it would take to master the technique.<br/><br/>In the following year, Fang Wang was busy guiding Xiao Zi and the other demons, even Zhao Zhen and Zhu Yan received his guidance, creating an atmosphere of fervent cultivation across Biyou Island.<br/><br/>A year later, Fang Wang began to sleep.<br/><br/>Nothing on the island could pique his interest anymore; he needed to dream in order to weave interesting things to entertain himself.<br/><br/>With the Heavenly Dao True Skill anyway, even without cultivating, his cultivation level was constantly growing, albeit at a slower pace.<br/><br/>Time flew by swiftly.<br/><br/>Five years later, a young Taoist came to visit Fang Wang, calling out “Master” from beyond the fog.<br/><br/>It was Chu Yin!<br/><br/>When Fang Wang first arrived at sea, he had met Chu Yin briefly and had agreed to a mentor-disciple relationship. Decades had passed, and Chu Yin had finally come looking.<br/><br/>This genius with the Heaven Yuan Spirit Treasure had already reached the Spirit Elixir Realm and was not far from the Profound Heart Realm. When they last met, Chu Yin had just started on the path of cultivation. His cultivation speed was considered fast, but in Fang Wang’s eyes, it seemed somewhat slow.<br/><br/>This was the Heaven Yuan Spirit Treasure after all!<br/><br/>Fang Wang immediately opened the formation to let him onto the island. Xiao Zi and Zhao Zhen went to greet him; they were very curious about this talent of Heaven Yuan and wanted to see what changes he had undergone over the years.<br/><br/>Once Chu Yin came before Fang Wang, he immediately kowtowed, overcome with emotion.<br/><br/>Fang Wang was lying on a large rock, basking in the sun, his face covered with the fox mask hence gifted by Qing Wan’er of the Mountain God clan.<br/><br/>Zhu Yan scrutinized Chu Yin, questioning why this boy deserved to be a disciple.<br/><br/>“Master, are you still willing to acknowledge me?”<br/><br/>Chu Yin looked up cautiously and asked. After emerging from seclusion and learning that the Sword Sovereign of the Yellow Glyph’s real name was Fang Wang, he immediately packed his bags and hurried over, fearing that Fang Wang might have moved away.<br/><br/>Fang Wang did not remove the fox mask, but instead asked indifferently, “Chu Yin, how old are you this year? Chu Yin quickly replied, “Almost sixty-five years old…”<br/><br/>“What realm are you in?”<br/><br/>“Eighth level of the Spirit Elixir Realm…” Chu Yin lowered his head in shame.<br/><br/>Zhu Yan snorted, “At sixty-five years old, with only such cultivation, how dare you seek a master? When I was your age, I had already reached the Profound Heart Realm, unmatched within it!”<br/><br/>Xiao Zi and Zhao Zhen were also somewhat disappointed, harboring the same doubt in their hearts. Does he really possess the Heaven Yuan Spirit Treasure?<br/><br/>Chu Yin, with a face full of shame, said, “I don’t know why… my breakthrough speed is not fast…”<br/><br/>Fang Wang raised his hand and slightly shifted the mask to reveal one eye, examining Chu Yin closely.<br/><br/>Facing his gaze, Chu Yin immediately lowered his head, not daring to look him in the eye.<br/><br/>Eh?<br/><br/>There’s something off about this kid!<br/><br/>Fang Wang discovered that although Chu Yin’s realm was low, his Spiritual Power was extremely abundant. Previously, he had compared Chu Yin with Zhu Yan, which made him think Chu Yin’s Spiritual Power was average. But upon closer observation, the kid’s Spiritual Power was almost on par with Xiao Zits demonic power.<br/><br/>It should be known that Xiao Zi was also equivalent to the sixth or seventh level of the Condensation Spirit Realm; its cultivation was steadily rising, often venturing out to sea to hunt demonic beasts, not only relying on cultivation as a means to become stronger.<br/><br/>That is to say, Chu Yin’s power at the Spirit Elixir Realm is comparable to the Condensation Spirit Realm?<br/><br/>Could it be that the reason for his slow cultivation speed was that he needed more Spiritual Power than others to break through at each level?<br/><br/>As Fang Wang took a serious look at Chu Yin, Zhu Yan and Xiao Zi did the same, and soon, they saw the peculiarity of Chu Yin’s physique, their gazes turning strange.<br/><br/>Fang Wang said, “Show me your cultivation technique.”<br/><br/>Upon hearing this, Chu Yin quickly sat down cross-legged and began to cultivate, with nature’s spiritual energy pouring into his body.<br/><br/>A great wind started to blow!<br/><br/>Zhu Yan, Xiao Zi, and Zhao Zhen were shocked once again by the speed at which he absorbed Spiritual Energy.<br/><br/>Fang Wang fell into deep contemplation.<br/><br/>Could it be that the power of the Heaven Yuan Spirit Treasure was not just in its strength, but also in granting its owner a unique physique?<br/><br/>Or perhaps, it was precisely because of the special nature of his physical body, so strong, that it could nurture the Heaven Yuan Spirit Treasure?<br/><br/>Fang Wang felt that his guess was likely true. He could tell that Chu Yin’s cultivation technique was not particularly profound, at least not enough to match his Heaven Yuan Spirit Treasure.<br/><br/>“That’s enough.”<br/><br/>Fang Wang spoke again, and Chu Yin immediately stopped, looking anxiously towards Fang Wang.<br/><br/>“I will pass on a cultivation technique to you. If you can master it, I will take you as my disciple. Are you willing?”<br/><br/>Fang Wang asked calmly. Chu Yin dared not refuse and immediately thanked Fang Wang.<br/><br/>As he looked up, Fang Wang’s right forefinger pointed at his forehead, and in an instant, a powerful spiritual sense forcefully invaded his mind, rendering his entire body rigid.<br/><br/>Passing on the technique!<br/><br/>Xiao Zi was secretly puzzled; when the young master taught me the sword, why not pass it on like this?<br/><br/>Could it be…<br/><br/>He wanted to spend more time with me?<br/><br/>Xiao Zi felt it was possible. It believed that its efforts to ingratiate itself were useful. When had the young master ever truly been angry?<br/><br/>Indeed, all men are the same; it’s just that some are better at hiding it.<br/><br/>Xiao Zi became even more eager to transform. Maybe the young master was also waiting for it to do so.<br/><br/>Zhu Yan hesitated, wanting to learn as well, but when he thought of his True Combat Technique, he was too embarrassed to speak up.<br/><br/>Before meeting Fang Wang, he truly considered himself a genius, one who could learn any cultivation technique, but the True Combat Technique proved genuinely challenging for him.<br/><br/>Though it was difficult, Zhu Yan had made continuous progress with the True Combat Technique, and he believed that given time, he would eventually master it.<br/><br/>After a while, Fang Wang withdrew his right hand, covering his face with the mask again, and said, “Take him to cultivate near Spirit Eye Lake. Do not disturb my cultivation before he succeeds.”<br/><br/>Xiao Zi and Zhu Yan immediately took the order, and Zhao Zhen floated in the air, also pondering the mysteries of the Heaven Yuan Spirit Treasure.<br/><br/>Fang Wang did not think too much about it; no matter how strong his disciple became, he would only ever be an assistant. After all, he could never surpass him.<br/><br/>He continued to indulge in his grand dreams.<br/><br/>In the last dream, he had returned to Earth, living like a savior as the only cultivator on the planet. Suddenly tired of it, he desired a change in lifestyle.<br/><br/>However.<br/><br/>Six months later, Chu Yin visited Fang Wang, claiming to have completed the first level of the Solaris Scripture.<br/><br/>Fang Wang was surprised by his speed and immediately imparted the second level of the cultivation technique to him.<br/><br/>Another half year passed, and Chu Yin had learned that as well.<br/><br/>Interested, Fang Wang then taught him the cultivation methods for the first six of the Jinghong Divine Sword Art’s sword techniques.<br/><br/>Two years later, Fang Wang had advanced to the second level of the Golden Body Realm, while Chu Yin had still not mastered even the first level of the Jinghong Divine Sword Art; he couldn’t even find the opportunity to begin.<br/><br/>One day, Fang Wang gathered them, preparing to head to the Eternal Life Pavilion. With four months until their appointment and the journey long, they would have to start early.<br/><br/>Qu Xunhun had already arrived outside the mist, waiting, and brought with him a magnificent Redwood Great Ship.<br/><br/>“Master, may I join you?” Chu Yin curiously asked.<br/><br/>Fang Wang smiled and said, “Then let’s go together.”<br/><br/>Chu Yin’s face immediately brightened with a smile, mainly because when he addressed Fang Wang as master, Fang Wang did not refuse.<br/><br/>With that, the group quickly packed up and left Biyou Island to board Qu Xunhun’s ship.<br/><br/>Fang Wang stepped onto the deck, stretched lazily, and the sunlight shone on his white clothes. His posture was languid, yet every movement carried an air of transcendence.<br/><br/>Qu Xunhun approached him, secretly astonished.<br/><br/>Every time he saw Fang Wang, he felt that Fang Wang had changed significantly, with an increasingly profound and inscrutable aura that was unimaginable.<br/><br/>“Sword Lord, do you have anyone in mind for this internal trial?” Qu Xunhun asked softly.<br/><br/>The Redwood Great Ship had already started its voyage at a rapid pace, yet it caused no waves as it seemingly flew above the water, a sight both magical and captivating, drawing Xiao Zi, Zhao Zhen, and Chu Yin to discuss at the ship’s edge.<br/><br/>Fang Wang glanced at Qu Xunhun and asked with a smile, “What do you think my goal is?”<br/><br/>Qu Xunhun replied respectfully, “With your abilities, taking down the Tianzi Sword Monarch should not be difficult, and he is also participating in this trial.”<br/><br/>The internal trials of the Eternal Life Pavilion had two functions: to seek fortune and to compete for status. With every trial, there was infighting and slaughtering among the martial monarchs.<br/><br/>In Qu Xunhun’s view, it seemed Fang Wang was not lacking in resources for cultivation, so he must be aiming for a higher status.<br/><br/>“The Tianzi Sword Monarch? That’s not enough,” Fang Wang said with a hint of a smile.<br/><br/>Qu Xunhun’s expression shifted slightly and he immediately said, “Then shall I introduce you to the twenty-four true persons?<br/><br/>Fang Wang nodded, then lay down on the deck, using his left arm as a pillow.<br/><br/>Qu Xunhun sat down to meditate. Seeing Fang Wang lying down, he dared not stand, and began to share intelligence about the twenty-four true persons.<br/><br/>Among the twenty-four true persons, the most powerful was one of the Southern Celestial Four Heroes, the Extreme Yang True Person, with only Canghai True Person capable of contesting his strength.<br/><br/>Canghai True Person possessed the Heaven Yuan Spirit Treasure and had an exceptional aptitude for water-based cultivation techniques and spells. It was rumored that he could harness the power of the Canghai.<br/><br/>Although Qu Xunhun did not directly name names, Fang Wang discerned four words from his words.<br/><br/>Not to be provoked!<br/><br/>He continued to introduce the other true persons.<br/><br/>After discussing nine others, Qu Xunhun finally mentioned Jiu You True Person, indicating a relatively high rank among the twenty-four.<br/><br/>Speaking of Jiu You True Person, Qu Xunhun didn’t have much information, only that he was ruthless, proficient in the Ghost Path, and caution was advised in dealings with him because of his history of betraying friends, which gave him a terrible reputation.<br/><br/>Afterward, Fang Wang listened as if for amusement; his main target was Jiu<br/><br/>You True Person.<br/><br/>Half an hour later, Qu Xunhun excused himself.<br/><br/>Fang Wang then closed his eyes. He was not sleeping; now that he was out and about, he wanted to enjoy the sea breeze and contemplate his future cultivation path.<br/><br/>He had already mastered many peerless skills to Great Perfection, any of which could occupy other geniuses for a lifetime of study, and this was why he could defeat enemies beyond his realm.<br/><br/>The sea breeze carried a tinge of saltiness, and occasionally monstrous birds slashed across the sky, their cries piercing the air.<br/><br/>During the rest of the sea voyage, they occasionally encountered other cultivators, but none dared disturb them. The speed of their ship alone revealed that they were not ordinary cultivators.<br/><br/>Fang Wang did not lie down the whole time; he began to give Chu Yin cultivation guidance.<br/><br/>He passed on some simple spells to Chu Yin and found that Chu Yin’s aptitude was mediocre, except for the Qi Gathering Technique, where the young man’s talent was astonishing.<br/><br/>He immediately taught Chu Yin the rest of the Solaris Scripture’s mental methods, eager to see how many years it would take for him to learn them<br/><br/>fully..\t\t\t\t\t\t</div>", "images": {}, "success": true}