{"id": 156, "url": "https://www.novelhall.com/i-became-an-immortal-on-mortal-realm-32879/14304724.html", "title": "Chapter 156 - Chapter 156: Chapter 153: Executioner Immortal Ghost God Sword Great Perfection", "volume": 2, "volume_title": "Volume 2", "body": "<h1>Chapter 156 - Chapter 156: Chapter 153: Executioner Immortal Ghost God Sword Great Perfection</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 156: Chapter 153: Executioner Immortal Ghost God Sword Great Perfection<br/><br/>Translator: 549690339<br/><br/>Fang Wang opened his eyes and looked at the grand hall within the Heavenly Palace, a look of anticipation spreading across his face with a smile.<br/><br/>“The Executioner Immortal Great Saint is also a Great Saint, his lifelong effort should be very strong, right?”<br/><br/>“If it’s less than five hundred years, it would be unbecoming of a Great Saint’s prestige!”<br/><br/>The strongest swordsmanship ultimate art in Fang Wang’s possession was the Sword Saint’s Celestial Sword Intent, but the title ‘Saint’ in ‘Sword Saint’ was just a term of respect, not truly signifying a saint of the Sword Dao. In his view, the Sword Saint should have a considerable gap compared to the Executioner Immortal Great Saint.<br/><br/>Fang Wang closed his eyes, recalling the moves and the mental method of the Executioner Immortal Ghost God Sword.<br/><br/>The figure of the Executioner Immortal Great Saint emerged in his mind, his sword moves sharp, his sword momentum astonishing.<br/><br/>After a long time.<br/><br/>Fang Wang condensed the Rainbow Sword and began practicing his swordsmanship.<br/><br/>First, he would master the sword moves to perfection, then pursue a higher realm!<br/><br/>Filled with a fighting spirit, Fang Wang started to focus on practicing the sword, losing track of time as only the sound of his sword cutting the air resounded endlessly inside the Heavenly Palace.<br/><br/>Without knowing how much time passed, when Fang Wang felt exhausted, he had still not mastered the Executioner Immortal Ghost God Sword.<br/><br/>He steeled his heart, refusing to look back at the clock, choosing instead to practice until he could look again.<br/><br/>Time continued to slip away.<br/><br/>By the time Fang Wang finally mastered the Executioner Immortal Ghost God Sword, he looked back to find that six hundred years had passed!<br/><br/>He had only just mastered it, not yet reaching Great Completion, let alone the Great Perfection Realm!<br/><br/>It must be known that Fang Wang had already mastered swordsmanship ultimate arts like the Jinghong Divine Sword Art, Nine Heavens Azure Thunder Sword Formation, Celestial Sword Intent, and Divine Nurturing Sword Qi to the Great Perfection. His understanding and foundation of Sword Dao far exceeded others, yet even so, it took him six hundred years just to master the Executioner Immortal Ghost God Sword.<br/><br/>Impressive!<br/><br/>The Executioner Immortal Great Saint truly did not boast in vain; an ordinary mortal who wished to master the Executioner Immortal Ghost God Sword might have already reached the Mahayana Realm, to achieve Great Completion —which is two levels higher than Mahayana—might still not be possible.<br/><br/>Fang Wang revitalized his spirit, working hard to reflect on the strength of the Executioner Immortal Ghost God Sword, and after adjusting his mindset, he continued practicing the sword.<br/><br/>From minor completion to Great Completion, he spent another five hundred years!<br/><br/>One thousand one hundred years, and that was without sleeping or cultivating in any other form, only practicing the sword, equivalent to two or three thousand years for other cultivators practicing the sword.<br/><br/>Next was the most difficult Great Perfection Realm!<br/><br/>This was probably a state of perfection that not even the Executioner Immortal<br/><br/>Great Saint could achieve!<br/><br/>Fang Wang’s heart began to tremble.<br/><br/>He felt he was still too young, having underestimated Fang Hanyu’s words and overestimated his own swordsmanship attainment.<br/><br/>After eight hundred years, Fang Wang finally practiced the Executioner Immortal Ghost God Sword to Great Perfection!<br/><br/>This sword had surpassed the expectations of mere mortals; its Sword Intent could absorb the will of all things from the Underworld. To say it exaggeratedly, this sword had no upper limit!<br/><br/>One thousand nine hundred years, this was the first time Fang Wang had secluded himself for so many years in one sitting…<br/><br/>When he opened his eyes again, the Executioner Immortal Great Saint was still swinging his sword, demonstrating the moves for him.<br/><br/>Fang Wang did not stop him, staring blankly at the Executioner Immortal Great Saint.<br/><br/>The Executioner Immortal Great Saint had been observing Fang Wang’s expression the entire time and could clearly sense a huge change in his emotions, but he did not stop.<br/><br/>Fang Wang, with his Great Perfection Executioner Immortal Ghost God Sword, judged the Executioner Immortal Great Saint’s swordsmanship to be rough and full of flaws.<br/><br/>Even though the Executioner Immortal Great Saint deliberately made the sword moves simple and easy to understand, Fang Wang could tell at a glance that the Great Saint had only barely reached Great Completion.<br/><br/>Just like that.<br/><br/>After demonstrating the sword moves ten times, the Executioner Immortal<br/><br/>Great Saint slowly sheathed his sword and looked expressionlessly at Fang Wang, asking, “Junior, how much have you remembered?”<br/><br/>He did not hold out much hope because Fang Wang’s state was clearly amiss.<br/><br/>Fang Wang replied, “Pretty much.”<br/><br/>His expression was indifferent, a far cry from his previous polite demeanor; not that he was putting on airs on purpose, but he did not realize this, having just been in seclusion for one thousand nine hundred years, his heart numb.<br/><br/>“Oh? Pretty much? Then show me, let this old man have a look,” the Executioner Immortal Great Saint said, raising an eyebrow, and tossed his wooden sword to Fang Wang.<br/><br/>Fang Wang caught the sword with one hand, adjusting his grip, and asked,<br/><br/>“May I know what level the predecessor thinks I can achieve?”<br/><br/>Upon hearing that, the Executioner Immortal Great Saint sensed Fang Wang’s pride and couldn’t help but laugh to himself. It seemed this young man had not grasped the true essence of the Executioner Immortal Ghost God Sword and remembered only the moves.<br/><br/>“Swing the sword. If you can surprise this old man, I wouldn’t mind giving you another opportunity!”<br/><br/>Upon hearing this, a smile finally appeared on Fang Wang’s face.<br/><br/>He had previously exploded a fortune in the Heavenly Body due to cultivating the Heavenly Gang Saint Body Technique; he hoped this time would be the same.<br/><br/>Fang Wang slowly raised his sword, not yet performing any sword moves, but as he did so, a cold Sword Intent burst forth. Wisps of Sword Qi seeped from the wooden sword in his hand, flowing up his arm to his back, gradually coalescing into a ghostly divine shadow.<br/><br/>This ghostly figure had broad shoulders and a narrow waist, resembling a human in shape but pitch-black as if clad in divine armor. Even without seeing its face, it exuded an unyieldingly dominant aura. It too held a sword shadow in its hand, with a blade so long it surpassed its own height.<br/><br/>The Ghostly Divine Sword of the Executioner Immortal Ghost God Sword!<br/><br/>This ghostly figure was a reflection of Fang Wang’s heart, also understood as an embodiment of his Sword Intent!<br/><br/>Different people’s Executioner Immortal Ghost God Swords would manifest<br/><br/>ghostly figures of different postures and strengths!<br/><br/>The Executioner Immortal Great Saint’s eyes widened, unable to maintain the dignity of a Great Saint, and he asked tremulously, “How… how is this possible! Had you practiced this before?”<br/><br/>Fang Wang looked at his sword-wielding hand, and the ghostly figure behind him mirrored his movements.<br/><br/>He responded with a question, “Could it be that the predecessor has left legacies elsewhere?”<br/><br/>Executioner Immortal Great Saint fell silent.<br/><br/>Actually, the moment he had asked, he regretted it. It was just because he was so shocked that he had neglected the past.<br/><br/>This was the pride of his life’s cultivation…<br/><br/>This youngster understood after watching ten times?<br/><br/>How could that be possible…<br/><br/>Executioner Immortal Great Saint could not accept it; he stared intently at Fang Wang and asked, “Is there anyone else in the world who knows this sword technique? Any similar swordsmanship?”<br/><br/>In those years, he had dominated the world with the Executioner Immortal Ghost God Sword, and countless people had seen the demeanor of this sword; he had reason to suspect that someone had imitated his swordsmanship.<br/><br/>Fang Wang, growing a bit impatient, sensed that with the appearance of the ghostly divine being, he was able to break through the illusionary realm. Thus, he spoke directly, “If senior does not believe it, you are free to doubt all you want. My Executioner Immortal Ghost God Sword has already surpassed yours. Would Senior like to see the Great Perfection Realm that you have never reached?”<br/><br/>Upon hearing this, Executioner Immortal Great Saint was stunned, and then, infuriated with embarrassment, he said in a deep voice, “Junior, do you really think that by merely watching my sword moves ten times you could perform this sword technique to a realm that surpasses mine?”<br/><br/>Fang Wang lifted the wooden sword in his hand, and the ghostly divine being behind him did the same. In an instant, the sword in the hands of the ghostly divine being burst forth with a soaring Sword Qi, black flames fiercely burning, actually piercing through the dark space, creating a pale, gaping hole.<br/><br/>An unimaginable, vast oppressive force enveloped Executioner Immortal Great Saint, causing him to be involuntarily moved.<br/><br/>He could feel Fang Wang’s Sword Intent was very pure, indicating it had not yet begun to absorb the Underworld’s will. This was enough to prove that Fang<br/><br/>Wang had just learned it; but, even if it was newly taught, the strength of this Sword Intent…<br/><br/>At this moment, Executioner Immortal Great Saint was filled with a sense of defeat looking at Fang Wang.<br/><br/>The culmination of his life’s work had been learned by a junior in a short amount of time, and even surpassed his own accomplishments.<br/><br/>It was hard for anyone to accept this.<br/><br/>Fang Wang spoke up, “Senior’s Swordsmanship Ultimate Arts are truly formidable. In my life, I have already learned many ultimate arts, including the Three Great True Cultivations of Descending Dragon Great Saint; however, none of them can compare to the Executioner Immortal Ghost God Sword. Through this sword, I can sense the depths of Senior’s Sword Dao attainment. You’re definitely the foremost practitioner of the Sword Dao in my current knowledge, unmatched in this era. As for the past and the future, I cannot judge.”<br/><br/>These words made Executioner Immortal Great Saint feel better, yet his face still bore a bitter smile.<br/><br/>The black space began to collapse, as if a mirror had shattered.<br/><br/>Executioner Immortal Great Saint looked up at Fang Wang and took a deep breath before asking, “Junior, tell me your name.”<br/><br/>Fang Wang replied, “Junior is named Fang Wang, ‘Fang’ as in square, and<br/><br/>‘Wang’ as in hope.”<br/><br/>Executioner Immortal Great Saint followed with, “Good, I will remember your name. You can keep my Jian Shi. It will guide you to my tomb, where you can inherit my Sword Intent, saving you ten thousand years of detours. However, you must at least reach the Celestial Qiankun Mirror to break through the prohibitions of my tomb.”<br/><br/>Upon hearing this, Fang Wang immediately expressed his gratitude.<br/><br/>The Executioner Immortal Ghost God Sword requires the absorbing of the Underworld’s will. The Executioner Immortal Great Saint during his life must have absorbed a massive amount of the Underworld’s will. If it could be assimilated, it would indeed save him many years of detours.<br/><br/>A smile appeared on Executioner Immortal Great Saint’s face, and this time, it was filled with anticipation.<br/><br/>Following that.<br/><br/>Fang Wang’s consciousness returned to reality.<br/><br/>He opened his eyes, and what caught his sight was the purple jade stone in his hand. A smile appeared on his face.<br/><br/>Not only had he mastered a formidable ability, but he’d also obtained a great opportunity!<br/><br/>Not bad at all!<br/><br/>Fang Wang reached out with his consciousness into the Jian Shi again. This time, his consciousness entered into darkness, and deep within the darkness was a light, which he could align with a direction in reality.<br/><br/>The Celestial Qiankun Realm?<br/><br/>Fang Wang was temporarily unclear on what the Celestial Qiankun Mirror was, and would need to investigate it later.<br/><br/>He withdrew his consciousness, placed the Jian Shi inside the Dragon Jade Ring, and then stood up.<br/><br/>I must relax for a bit!<br/><br/>Fang Wang found Xiao Zi, who was still chatting with Zhu Yan and suddenly dragged her away.<br/><br/>“Hey, Young Master, where are you taking me?”<br/><br/>“To a place without demons.”<br/><br/>“Ah? Okay, okay!”<br/><br/>Xiao Zi instantly became excited and even sent a triumphant glance toward<br/><br/>Zhu Yan.<br/><br/>Zhu Yan wore a strange expression, wondering to himself if the master really fancied this sort of thing.<br/><br/>He shook his head and walked toward his place of cultivation, preparing to continue his training.<br/><br/>The True Combat Technique was quite difficult, preventing him from dedicating himself to it constantly out of fear of hindering his cultivation advancement.<br/><br/>Fang Wang brought Xiao Zi to the beach, set her down, and under her expectant gaze, he said, “Having nothing better to do, I thought I’d like to train you for a bit.”<br/><br/>Xiao Zits eyes lit up, asking, “How will you train me?”<br/><br/>Looking down on her, Fang Wang said, “Don’t you love practicing swordsmanship? I will teach you.”<br/><br/>“Are you ready?”<br/><br/>Fang Wang raised his hand and motioned. A wooden branch flew into his hand, another branch flew towards Xiao Zi, landing in front of her.<br/><br/>Xiao Zi hurriedly picked up the branch with her mouth.<br/><br/>“This sword is named Executioner Immortal Ghost God Sword. If mastered to great completion, you can reign unbeatable in the Mortal Realm,” Fang Wang said softly. After speaking, he began to wield the sword.<br/><br/>On hearing this, Xiao Zi became even more excited, her snake eyes intently<br/><br/>focusing on Fang Wang..\t\t\t\t\t\t</div>", "images": {}, "success": true}