{"id": 155, "url": "https://www.novelhall.com/i-became-an-immortal-on-mortal-realm-32879/14304630.html", "title": "Chapter 155 - Chapter 155: Chapter 152: The Sixth Lifespirit Treasure, Executioner Immortal Great Saint", "volume": 2, "volume_title": "Volume 2", "body": "<h1>Chapter 155 - Chapter 155: Chapter 152: The Sixth Lifespirit Treasure, Executioner Immortal Great Saint</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 155: Chapter 152: The Sixth Lifespirit Treasure, Executioner Immortal Great Saint<br/><br/>Translator: 549690339<br/><br/>With the Heavenly Palace Halberd, Rainbow Sword, and Qiankun Fan for offense, and the Reincarnation Bell and The Six Harmonies and Eight Desolations Seal for defense and sealing, Fang Wang felt that he could consider other aspects.<br/><br/>Support-type Lifespirit Treasure!<br/><br/>An idea gradually formed in Fang Wang’s mind.<br/><br/>He decided to create an endurance and defensive type of Lifespirit Treasure, preferably one that could accumulate defensive power.<br/><br/>He thought of robes or armor, with the external defense of The Six Harmonies and Eight Desolations Seal, and the clothing on his body for inner defense; a double layer for increased survival.<br/><br/>If it could store Spiritual Power, that would be even better.<br/><br/>A Lifespirit Treasure, unlike a Magic Artifact, is inherently part of the cultivator. If it could bear excess Spiritual Power, it would be more efficient in transferring to Fang Wang’s body.<br/><br/>However, condensing a Lifespirit Treasure requires the consumption of Spiritual Power, so few cultivators keep their Lifespirit Treasure materialized at all times. Fang Wang possesses the Heavenly Dao True Skill and is constantly absorbing nature’s spiritual energy, which allows him to maintain the Lifespirit Treasure materialized externally all the time.<br/><br/>He began to ponder how to shape a Lifespirit Treasure that could store Spiritual Power.<br/><br/>Fang Wang had previously tried to store Spiritual Power within the Golden Scale White Feather Robe, but that power could only be used to activate the defensive restrictions of the robe.<br/><br/>He suddenly thought of incorporating the characteristic of the Heavenly Dao True Skill into this new Lifespirit Treasure, allowing it to maintain the rhythm of absorbing nature’s spiritual energy, so it could exist independently and even store combat Spiritual Power.<br/><br/>Wait a minute!<br/><br/>Rather than creating a robe, why not shape a crown!<br/><br/>While Fang Wang’s whole body can absorb nature’s spiritual energy, if he shaped it into a robe, the coverage would be too extensive and could interfere with his cultivation. If he shaped a crown, placed at the top of the head, it would only divert a portion of the spiritual energy when absorbing.<br/><br/>In this way, he could still wear the Golden Scale White Feather Robe and form a triple defense!<br/><br/>Once Fang Wang confirmed his idea, he immediately began to act.<br/><br/>He had already felt the opportunity for Spiritual Refinement!<br/><br/>It must be said, the Heavenly Dao Spirit Stones collected by Qu Xunhun were indeed of high quality, making him feel more at ease than when he performed Spiritual Refinement back in Grand Qi.<br/><br/>Gradually, fierce flames began to rise around Fang Wang, surging towards his head—an indication that the process of Spiritual Refinement was starting.<br/><br/>Ever since he mastered the Heavenly Dao True Skill, his Solaris True Fire had turned white, a white with radiance. As the Solaris True Fire gathered at the top of his head, he became the brightest presence on Biyou Island, turning heads of monsters engrossed in their own cultivation.<br/><br/>By evening.<br/><br/>Xiao Zi, Zhu Yan, and Zhao Zhen came over to Fang Wang, their gazes all fixed on his crown.<br/><br/>The crown, worn on Fang Wang’s forehead, allowed his black hair to cascade down its form, with two dragon whisker-like strands in front of his face and long locks beside his ears. Most of his long hair was at the back of his head. The front of the crown was carved with a dragon head, with two dragon horns curving toward the top, twenty centimeters long and full of metallic luster, almost like two scimitars, with the whole being a fusion of platinum color.<br/><br/>The dragon head was chosen mainly to match the Heavenly Palace Halberd and the Golden Scale White Feather Robe.<br/><br/>Nature’s spiritual energy poured into Fang Wang’s crown, visibly flowing along the two dragon horns, accentuating his stately figure.<br/><br/>Zhu Yan couldn’t help but exclaim, “What a magnificent crown, Master. Could this be the Lifespirit Treasure you’ve condensed? It’s actually capable of absorbing Spiritual Energy on its own.”<br/><br/>Xiao Zi nodded in agreement, while Zhao Zhen felt emotional inside.<br/><br/>Even the world’s number one True Dragon Emperor couldn’t possibly possess such grandeur, could he?<br/><br/>“Hmm, this crown is called the Heavenly Dao Imperial Dragon Crown.”<br/><br/>Fang Wang said softly as he summoned the Golden Scale White Feather Robe and materialized the Heavenly Palace Halberd in his hand, with strands of golden dragon essence swirling around him.<br/><br/>Under the twilight, Fang Wang’s divine radiance became even more noticeable, dazzling Xiao Zi, Zhu Yan, and Zhao Zhen.<br/><br/>Usually dressed in white robes, Fang Wang appeared like an ethereal and exalted sage, but now he seemed more like a celestial War God, exuding an unmatched, lofty presence as if to say ‘who dares challenge me, who stands above all.’<br/><br/>For the first time, Zhu Yan truly felt an invincible aura emanating from a person, even his own father didn’t possess such an aura.<br/><br/>Fang Wang looked over his attire, quite pleased. Very stylish indeed.<br/><br/>Being stylish is a lifelong affair!<br/><br/>The Heavenly Dao Imperial Dragon Crown is not only capable of absorbing nature’s spiritual energy but also contains powerful defensive prohibitions, created with the mysteries of the Heavenly Body. The more Spiritual Energy it contains, the stronger its defense. As for how much Spiritual Energy it can store, its limit is unknown for the time being.<br/><br/>Because it is a Lifespirit Treasure, as Fang Wang’s cultivation level increases, so will its strength continue to grow.<br/><br/>Fang Wang put away his attire, leaving only the Heavenly Dao Imperial Dragon Crown on top of his head, and spoke, “All right, you should all continue your cultivation. In a few years, I plan to participate in the internal trials of the Eternal Life Pavilion.”<br/><br/>Upon hearing this, Zhu Yan’s eyes lit up, and he quickly said, “Master, take me with you, please. I’ve heard that the internal trials of the Eternal Life Pavilion are extremely thrilling. Every time they conduct internal trials, they invite many great sects to watch, and my father has been invited before, but sadly, he only took my elder brother.”<br/><br/>Fang Wang nodded with a smile. As one of the seventy-two Warlords, not only could he participate in internal trials but he could also bring others to watch. He had indeed planned to bring Xiao Zi, Zhao Zhen, and Zhu Yan along to broaden their horizons.<br/><br/>Xiao Zi, curious about the internal trials of the Eternal Life Pavilion, asked Fang Wang, who asked Zhu Yan to explain to it while he went to his usual spot for meditation.<br/><br/>Fang Wang took out the Purple Jade Stone that Fang Hanyu had given him, feeling that his mentality had become somewhat frivolous and that he needed to retreat to the Heavenly Palace to calm down.<br/><br/>Fang Hanyu had touted the swordsmanship within the Purple Jade Stone to the skies, and Fang Wang wanted to see just how formidable it could be.<br/><br/>Fang Wang sent his divine sense into the Purple Jade Stone, immediately feeling a powerful force isolating his divine sense, causing it a stinging pain.<br/><br/>Uh-oh?<br/><br/>This is no simple matter!<br/><br/>Fang Wang’s spiritual consciousness was so strong, yet it was unable to break through the power within this purple jade stone.<br/><br/>Suddenly, he remembered Fang Hanyu’s suggestion to use Sword Qi. He lifted his left hand, using his finger as a sword, and pointed it at the purple jade stone.<br/><br/>A streak of Sword Qi shot into it!<br/><br/>Fang Wang’s right hand trembled slightly, he again used his spiritual consciousness to probe it, and the mysterious power had been breached, but when his spiritual consciousness penetrated the purple jade stone, he felt a wave of dizziness.<br/><br/>When he opened his eyes again, he found himself in a dark space with an island ahead. He instinctively rushed over, arriving on the island, and when he looked down, he saw his own body there as well.<br/><br/>What’s going on?<br/><br/>Fang Wang frowned, unable to feel his Primordial Spirit or Golden Body, proving that he hadn’t truly crossed into this space but his consciousness had fallen into some sort of illusionary realm.<br/><br/>Even with his cultivation at the Golden Body Realm, he could not escape this space.<br/><br/>Fang Wang remained calm, stepping forward to walk deeper into the island. The island was not large, filled with reefs of varying sizes, resembling some sort of formation.<br/><br/>Circumventing the cluster of reefs, he saw an old man standing on the sandy beach, holding a wooden sword, motionless.<br/><br/>This old man was draped in a tattered black robe, his long hair flowing, and just by observing his figure, one could sense his Sword Qi.<br/><br/>Sharp to the extreme!<br/><br/>“Dare I ask, what year is it now?”<br/><br/>The old man in the black robe asked, not turning around to look at Fang Wang, and the right hand holding the wooden sword also remained still.<br/><br/>As Fang Wang approached, he said, “There are so many dynasties in the world, with changes of eras. How can I tell the year to a senior like you?”<br/><br/>The old man in the black robe fell silent.<br/><br/>Then Fang Wang seemed to remember something and said, “Does the senior know the Descending Dragon Great Saint? It has been ten thousand years since the Descending Dragon Great Saint’s demise.”<br/><br/>Upon hearing this, the old man in the black robe turned to look at him, revealing a face full of age, wind, and frost, and it was dotted with age spots. His eyes were hollow, lifeless.<br/><br/>“So much time has passed. Before I became petrified, the Descending Dragon Great Saint had just acquired the title of Great Saint; having achieved the status of a Great Saint, he should have at least another ten thousand years of life,” the old man in the black robe said softly.<br/><br/>Fang Wang continued, “The Descending Dragon Great Saint challenged the heavens and fought against the host of immortal gods, ultimately perishing. That battle was earth-shattering and is now considered a myth.”<br/><br/>“Oh? Challenging immortal gods? It seems he did inherit our will,” the old man in the black robe said faintly.<br/><br/>Curious, Fang Wang asked, “May I know the senior’s name?”<br/><br/>The old man in the black robe turned to look at him and said, “The world calls me the Executioner Immortal Great Saint. Have you heard of me?<br/><br/>Fang Wang hesitated, unsure how to answer.<br/><br/>“As the years pass, it’s rare for one Great Saint to emerge, but looking back through the ages, there have been many Great Saints. It’s normal for you not to know my name , ”<br/><br/>said the Executioner Immortal Great Saint calmly. His tone shifted as he continued, “Junior, you being able to come here means your Sword Qi has passed my test. Next, I will pass on to you the ultimate arts of the Sword Dao. Before you, more than ten people came to receive the legacy, and without exception, all failed. Are you prepared?”<br/><br/>Fang Wang bowed with cupped hands and said, “I am ready. Please impart your teachings, senior.”<br/><br/>The Executioner Immortal Great Saint lifted the wooden sword in his hand, pointing it horizontally at Fang Wang, and said, “This swordsmanship is called the Executioner Immortal Ghostly Divine Sword, which absorbs the power of the spirits and gods from the Underworld to forge the power to execute immortals. Once one has reached minor accomplishment, they can traverse the Canghai, and upon reaching Great Completion, they are unmatched in the Mortal Realm.”<br/><br/>Fang Wang asked, “If one’s cultivation realm is insufficient, can one be unmatched in the Mortal Realm after achieving Great Completion of the Executioner Immortal Ghostly Divine Sword?”<br/><br/>The Executioner Immortal Great Saint looked at him, his eyes showing a slight ripple, and he said faintly, “Junior, do you think the lifelong work of this old man is something trivial? Even if your cultivation reaches the realm of<br/><br/>Celestial Qiankun, you might not be able to master my swordsmanship to Great Completion. ”<br/><br/>Fang Wang could only say, “I was presumptuous.”<br/><br/>He could not escape this space and had to show respect to the Executioner Immortal Great Saint.<br/><br/>The realm of Celestial Qiankun, what kind of realm was that? This was the first time Fang Wang had heard of such a realm.<br/><br/>“Watch carefully.”<br/><br/>The Executioner Immortal Great Saint began to wield his sword. His sword moves were not fast; it seemed as if he was intentionally allowing Fang Wang to remember them.<br/><br/>Fang Wang watched intently.<br/><br/>As the sword moves became more numerous, the Executioner Immortal Great<br/><br/>Saint started to increase the speed of his movements.<br/><br/>After a period equivalent to the burning of an incense stick.<br/><br/>“Next is the second round; you must also remember the chant,” the Executioner Immortal Great Saint continued, not waiting for Fang Wang’s response, he went on with his swordplay.<br/><br/>“Peering into the Yin to break the Yang, heaven and earth converge at the divine pivot; the sword is void, the heart is the reality, the heart follows the movement of the sword, the sword follows the intent of the heart…”<br/><br/>Fang Wang listened intently, with his mastery of the Heavenly Dao True Skill akin to always having the Combat Heart activated, allowing him to enter a state of complete focus at any moment.<br/><br/>After one round, the third round began!<br/><br/>Even though the movements were the same in every round, they revealed different mysteries!<br/><br/>This set of sword techniques carried the profundity of the Qi Gathering Technique, using the sword to absorb the force of souls and spirits from the Underworld!<br/><br/>By the seventh round, Fang Wang’s field of vision began to spin, and a familiar<br/><br/>sensation arrived.\t\t\t\t\t\t</div>", "images": {}, "success": true}