{"id": 158, "url": "https://www.novelhall.com/i-became-an-immortal-on-mortal-realm-32879/14305467.html", "title": "Chapter 158 - Chapter 158: Chapter 155: The Origin Of Southern Celestial Heaven, The Strength Of Tianzi Sword Monarch_L", "volume": 2, "volume_title": "Volume 2", "body": "<h1>Chapter 158 - Chapter 158: Chapter 155: The Origin Of Southern Celestial Heaven, The Strength Of Tianzi Sword Monarch_L</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 158: Chapter 155: The Origin of Southern Celestial Heaven, The Strength of Tianzi Sword Monarch_l<br/><br/>Translator: 549690339<br/><br/>Eternal Life Pavilion is located in the central region of the Southern Celestial Sea. There, sects and schools stand in great number, any of which would be stronger than the leading sects of the various sea regions. Eternal Life Pavilion is one of the most powerful forces there, unrivaled in terms of the reach of its influence. Their affiliated forces span across all regions of the Southern Jade<br/><br/>Sea and even extend to some of the continents.<br/><br/>Above the ocean, the Redwood Great Ship sped along.<br/><br/>Fang Wang lay on the deck, covering his face with a fox mask. He wasn’t asleep but listening to Zhu Yan introducing Eternal Life Pavilion to Xiao Zi, Zhao Zhen, and Chu Yin.<br/><br/>Although Chu Yin had been at sea for many years, he knew little about the power structure of the Southern Celestial Sea. He was only aware that Eternal Life Pavilion was an enormous force but had never looked into it in detail.<br/><br/>Qu Xunhun occasionally interrupted, adding information to help Zhu Yan’s explanation.<br/><br/>Such days were far from dull, adding a touch of joy to their sea voyage.<br/><br/>After a long conversation, everyone returned to their cultivation.<br/><br/>Chu Yin continued to cultivate the Solaris Scripture; he had found confidence in this scripture and considered it extremely potent. He eagerly anticipated bringing his practice of the Solaris Scripture to Great Completion.<br/><br/>Qu Xunhun paid close attention to Chu Yin, recognizing him as a talent of heaven. Even within Eternal Life Pavilion, someone like him would be highly valued.<br/><br/>A disciple of heaven and a mount of the Son of the Demon Emperor.<br/><br/>This Sword Lord certainly had lofty ambitions!<br/><br/>In the blink of an eye, a month had passed.<br/><br/>That day.<br/><br/>“Look ahead!” Xiao Zi exclaimed, prompting everyone on the ship to open their eyes.<br/><br/>Using his divine sense, Fang Wang saw a tremendous mountain appearing at the end of the ocean horizon, its sides stretching boundlessly, resembling the edge of the world, as if the end of the ocean was trapped by a wall created by the heavens.<br/><br/>Upon closer inspection, it wasn’t a mountain at all, but the ocean surface rising!<br/><br/>Observing the oceanic mountain, Fang Wang estimated it to be at least two thousand Zhang high, equivalent to more than six thousand meters, which was quite exaggerated.<br/><br/>“The area ahead is the true Southern Celestial Sea, the central locus of this ocean, known as Southern Celestial Heaven,” Qu Xunhun spoke, his face showing a look of fervor. Apparently, he didn’t often return here, so it was understandable that he felt excited.<br/><br/>Zhu Yan was visiting for the first time as well and thus had an expression of longing on his face.<br/><br/>Xiao Zi, Zhao Zhen, and Chu Yin were completely mesmerized.<br/><br/>With magic, Qu Xunhun accelerated the Redwood Great Ship. The closer they got to Southern Celestial Heaven, the more they could sense its majesty.<br/><br/>Gradually, they saw other Law Ships also sailing towards Southern Celestial Heaven.<br/><br/>Before long, the Redwood Great Ship began to tilt backward, as it was climbing an incline that grew steeper.<br/><br/>Xiao Zi, Zhu Yan, Chu Yin, and Zhao Zhen went to the side of the ship and could see there was no mountain below, only water.<br/><br/>Truly, a huge section of the sea surface had bulged upward, and the water was actually flowing upwards, which was very mysterious.<br/><br/>Fang Wang also probed with his divine sense, his perception diving into the sea. He saw countless fish and demon beasts swimming in the waters of Southern Celestial Heaven, but no buildings or formations. Notably, the Spiritual Energy here was abundant, welling up from the sea bed to the surface and perhaps that was why the water flowed upwards.<br/><br/>As they rose higher and the Redwood Great Ship sailed onto Southern Celestial Heaven, the ship ceased tilting, and as its front half settled down, everyone was astonished by the scene before them.<br/><br/>In the firmament ahead, stars seemed to be laid out, with floating islands suspended above the ocean’s surface, and countless islands below. They saw magic artifacts and mounts, and saw Cultivators soaring on their swords.<br/><br/>Sprawling demonic beasts occasionally burst from the ocean, and rows of flying creatures streaked across the sky. They even saw demonic dragons riding the clouds. As strong winds blew towards them, they couldn’t help but feel exhilarated.<br/><br/>Such rich Spiritual Energy!<br/><br/>“Sword Master, shall I take you to the abode of the Sword Sovereign of the Yellow Glyph to settle down before the trial begins?<br/><br/>Qu Xunhun approached Fang Wang respectfully and asked.<br/><br/>Fang Wang replied casually, “Arrange as you see fit.”<br/><br/>Qu Xunhun took the order and steered the Law Ship in another direction.<br/><br/>Along the way, Xiao Zi, Zhao Zhen, Zhu Yan, and Chu Yin engaged in endless discussion, even Zhu Yan from the Golden Body Realm was amazed.<br/><br/>Half an hour later.<br/><br/>The Redwood Great Ship docked at the port of an island. After Fang Wang and the others disembarked, Qu Xunhun stowed the ship in his sleeve and then led Fang Wang and the others towards a town not far away. The town occupied a quarter of the island’s area and was surrounded by mountains on three sides, quite majestic.<br/><br/>Along the way, some people greeted Qu Xunhun, and Fang Wang drew many glances. His demeanor was so distinctive that it was difficult for onlookers to shift their gaze away after a mere glance.<br/><br/>Next, there was Zhu Yan, who made no effort to hide his powerful demonic qi, causing the Cultivators along the road to give way.<br/><br/>Chu Yin felt that the Cultivators here were strong, and many were even beyond his perception, which made him nervous.<br/><br/>Many people knew Qu Xunhun and were aware of his status, and they also knew he served the Sword Sovereign of the Yellow Glyph.<br/><br/>Over the years, the Sword Sovereign of the Yellow Glyph had been quite prominent, especially after the battle at Biyou Island where he slaughtered over ten thousand Sword Cultivators, including five from the Golden Body Realm. He had already been dubbed the strongest Yellow Glyph Monarch.<br/><br/>Fang Wang’s arrival was clearly for the contention of a higher Monarch’s<br/><br/>Command !<br/><br/>In no time, the news spread rapidly.<br/><br/>Under Qu Xunhun’s guidance, Fang Wang and the others arrived at a residence with three courtyards and dozens of rooms.<br/><br/>Fang Wang casually picked a room to stay in. Xiao Zi insisted on accompanying him, then handed the Soul Devouring Gourd to Zhao Zhen for him to control.<br/><br/>Zhu Yan and Chu Yin found their own rooms to settle in, while Qu Xunhun left to collect intelligence on other real people for Fang Wang.<br/><br/>Less than an hour had passed when someone came to disturb them.<br/><br/>“May I ask if the Sword Sovereign of the Yellow Glyph is present?”<br/><br/>A domineering voice resounded throughout the island, causing all the cultivators and demons on the island to soar into the sky and look towards the residence of the Sword Sovereign of the Yellow Glyph.<br/><br/>‘l’ne speaker was a man In a black robe, embroidered Witn a lite11Ke golden eagle, his wide sleeves and hem fluttering in the wind. His face was stern, his eyes as fierce as a bear’s, and the stubble around his mouth added an extra touch of dominance.<br/><br/>Clang!<br/><br/>A door opened, and Zhu Yan, dressed in a tight black outfit, stepped out. He looked up at the man in the black robe and asked with evident annoyance, “Who are you, daring to disturb my master’s peace? Are you seeking death?”<br/><br/>The man in the black robe had an expressionless face as he said, “I am Tang Changbai, the Tianzi Sword Monarch. Your master killed my disciple, and I need him to give me an explanation.”<br/><br/>As soon as these words were spoken, the other cultivators who were watching began to discuss among themselves.<br/><br/>Chu Yin, Xiao Zi, and Zhao Zhen had also arrived in the courtyard, their hearts stunned by the aura of Tang Changbai.<br/><br/>“Even if it’s true that my master killed your disciple, it would mean that your disciple was inferior in skill. If he provoked my master and died, he got what he deserved. I advise you to leave quickly, or I will kill you myself!” Zhu Yan said with a ferocious laugh. His black clothes fluttered, revealing his strong muscles, and an overwhelmingly powerful aura erupted, shaking the entire island!<br/><br/>Golden Body Realm!<br/><br/>Tang Changbai narrowed his eyes, while the cultivators watching from a distance were alarmed to find that the Sword Sovereign of the Yellow Glyph had a demon pet from the Golden Body Realm.<br/><br/>Tang Changbai seemed to think of something and said sarcastically, “Could you be Zhu Yan, the seventh son of the Demon Emperor? I heard you became the mount of the Sword Sovereign of the Yellow Glyph. I didn’t think it was true.<br/><br/>Aren’t you afraid of disgracing the Demon Emperor?”<br/><br/>Zhu Yan laughed proudly. “What disgrace? You’re not even worthy of carrying my master’s shoes. Beat it, or I’ll make you regret it!”<br/><br/>“Hmph, truly…” Tang Changbai began, but before he could finish, a strong gust of wind hit him. Zhu Yan threw a punch at him. Shocked, Tang Changbai quickly leapt away. The force of the punch was domineering, soaring into the sky and dispersing the clouds.<br/><br/>Zhu Yan twisted his neck, revealing a cruel smile. Demonic Qi twined around his body as he lunged towards Tang Changbai again.<br/><br/>He had always been proud and disdainful, especially in his confrontation with Fang Wang years before. His cultivation over the years hadn’t changed his nature one bit.<br/><br/>He had long been itching to fight a proper battle and prove his strength to his master.<br/><br/>Although Zhu Yan was only at the second level of the Golden Body Realm, he was confident he could sweep through it!<br/><br/>Inside the house.<br/><br/>Fang Wang lay on his bed as the house—and indeed the entire island— trembled. Even though Tang Changbai and Zhu Yan were fighting high above in the sky, their powerful auras still affected many other islands and attracted more and more cultivators and demons to watch the battle.<br/><br/>In the Southern Celestial Heaven, demons were common sights. The transformed demons could coexist peacefully with human cultivators without any discrimination.<br/><br/>The news of the fight between the Tianzi Sword Monarch and the son of the Demon Emperor spread quickly.<br/><br/>Fang Wang could feel that Tang Changbai’s cultivation was even stronger, significantly above Zhu Yan’s, but he was not in a hurry to intervene. This was a good opportunity to test Zhu Yan.<br/><br/>To win with equal cultivation meant one was simply a cut above in skill. A genius must be able to overcome the gap in cultivation levels to win!<br/><br/>The clamor of the battle between the two Golden Body Realm great cultivators was immense, earth-shattering in its intensity.<br/><br/>Fang Wang picked up on many powerful presences arriving, some even far surpassing the aura of the Tianzi Sword Monarch.<br/><br/>Mahayana Realm!<br/><br/>Unperturbed, Fang Wang continued to lie on his bed, observing the battle with his divine consciousness.<br/><br/>Qu Xunhun hurried back and arrived in Fang Wang’s room, bowing as he said, “Sword Lord, we really shouldn’t kill the Tianzi Sword Monarch. If we must do it, it should happen during the trial. The Eternal Life Pavilion may recognize the Warlord’s Command but not the person who holds it, but that’s outside the Southern Celestial Heaven. Here, members of the Eternal Life Pavilion must not kill each other.”<br/><br/>With eyes still closed, Fang Wang replied nonchalantly, “Don’t worry, Zhu Yan won’t be able to kill him.”<br/><br/>Qu Xunhun thought to himself that although Zhu Yan couldn’t kill him, you, sir, certainly could!<br/><br/>Seeing that Fang Wang had no intention of killing, Qu Xunhun could only bow and leave.<br/><br/>Zhu Yan and Tang Changbai fought fiercely above the clouds, with Sword Qi crisscrossing and scattering in all directions. Zhu Yan, wrapped in Demonic Qi, kept pressing towards Tang Changbai, each punch and kick releasing a vast amount of Demonic Qi, shaking the firmament.<br/><br/>This sea area belonged to the territory of the Eternal Life Pavilion, which reacted swiftly. A large number of cultivators began to form formations to protect the various islands, not interfering with the battle between Tang Changbai and Zhu Yan. Even those forming formations eagerly watched the battle.<br/><br/>Tang Changbai lived up to his name as the Tianzi Sword Monarch, his swordsmanship unparalleled. The Sword Spirit in his hand danced, bursting with Sword Intent, fierce and swift.<br/><br/>Zhu Yan relied solely on his fists, shattering Sword Qi, continuously closing in on Tang Changbai. But every time he neared, Tang Changbai managed to quickly widen the distance, which only infuriated Zhu Yan more.<br/><br/>At first glance, Tang Changbai seemed to be toying with Zhu Yan, but not many mocked Zhu Yan. Instead, they sang praises of him.<br/><br/>“What is the origin of this demon? He can fight across six minor realms and hasn’t been hurt yet.”<br/><br/>“The seventh son of the Demon Emperor, Zhu Yan, is said to have become a disciple of the Sword Sovereign of the Yellow Glyph.”<br/><br/>“The Sword Sovereign of the Yellow Glyph, Fang Wang? Interesting, he really did come.”<br/><br/>“Haha, the strength of Fang Wang is certainly not just that of the Sword<br/><br/>Sovereign of the Yellow Glyph. Who do you think he’s got his eyes on?”<br/><br/>“It must be the Tianzi Sword Monarch, which is why Tang Changbai initiated this confrontation, to test the waters. If he really can’t match Fang Wang, he’ll probably opt out.”<br/><br/>“True enough, Tang Changbai, that old fox, has too many disciples to seek revenge for just one.”\t\t\t\t\t\t</div>", "images": {}, "success": true}