{"id": 153, "url": "https://www.novelhall.com/i-became-an-immortal-on-mortal-realm-32879/14304348.html", "title": "Chapter 153 - Chapter 153: Chapter 150: Renowned Across The Four Seas, The Name Of Fang Wang", "volume": 2, "volume_title": "Volume 2", "body": "<h1>Chapter 153 - Chapter 153: Chapter 150: Renowned Across The Four Seas, The Name Of Fang Wang</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 153: Chapter 150: Renowned Across the Four Seas, The Name of Fang Wang<br/><br/>Translator: 549690339<br/><br/>Fang Wang suddenly released his right hand that was holding the Rainbow<br/><br/>Sword, and with a grab towards the sky, amid the watchful eyes of Fang Hanyu, Zhu Yan, and others, several white beams of light were captured in his palm.<br/><br/>Everything happened too quickly!<br/><br/>They had just witnessed the physical bodies of five Golden Body Realm Great Cultivators exploding, and then they saw Fang Wang retract his hand.<br/><br/>Fang Wang lifted his left hand, made a fist, and directly pressed it into his right palm, as if he was performing a fist salute, the movement not particularly forceful, his posture casual, but it was this seemingly negligent action that made the hearts of everyone behind him tremble.<br/><br/>They knew that the Primordial Spirits of those five Golden Body Realm cultivators had been annihilated!<br/><br/>Killing Golden Body cultivators seemed too easy, didn’t it?<br/><br/>This was what Zhu Yan, Qin Hong, and Qin Tang thought. While Xiao Zi and Zhao Zhen were shocked, they did not find it inconceivable.<br/><br/>Fang Wang saw some Primordial Spirits flying out from the seabed, but he did not intervene. Those Primordial Spirits were not very strong and would serve well to spread the news for him.<br/><br/>All the sword shadows in the firmament disappeared as if they had never been there, the vast aura vanishing into nothingness.<br/><br/>“Go pick up the storage bags from the seabed.”<br/><br/>Fang Wang instructed, and Xiao Zi and Zhao Zhen immediately rushed out.<br/><br/>As the Celestial Sword Intent dissipated, everything between heaven and sea returned to normal, only the sea water in front of Fang Wang and the others was now dyed red.<br/><br/>Fang Wang stored the Rainbow Sword within his body, turned around, and walked towards the interior of the island. As he passed by Fang Hanyu, he patted Fang Hanyu on the shoulder, signaling him to follow.<br/><br/>Zhu Yan quickly approached Fang Wang, excitedly asking, “Master, what was that swordsmanship just now?”<br/><br/>“Celestial Sword Intent, the lifelong comprehension of the Sword Saint, the previous Sword Sovereign of the Yellow Glyph.”<br/><br/>“Really? Although the Sword Saint is revered, he’s known for his nonviolent style. Could he create such Sword Intent?”<br/><br/>“Some people have low realms because their talents are limited, but physical talent and comprehension have always been two different things. Otherwise, how would there be myths of comprehending the Dao and becoming an Immortal?”<br/><br/>“That’s true.”<br/><br/>Watching the departing figures of Fang Wang and Zhu Yan, Qin Hong and Qin Tang had yet to regain their senses, their minds filled with the magnificent sight of the Celestial Sword Intent covering the expanse between heaven and<br/><br/>sea.<br/><br/>Fang Hanyu stood up, saying, “Let’s go, it’s time to rest properly.”<br/><br/>A smile hung on his face, and his heart swelled with pride.<br/><br/>On the way here, Qin Hong and Qin Tang had been questioning the Sword Sovereign of the Yellow Glyph, worried that even traveling to Biyou Island wouldn’t be enough to fend off the enemies pursuing them.<br/><br/>Now, Fang Wang had proven his strength!<br/><br/>But…<br/><br/>Fang Hanyu glanced at Fang Wang’s retreating figure, inwardly astonished:<br/><br/>“This kid… is way too powerful…”<br/><br/>He believed Fang Wang could win, but he never expected Fang Wang to single-handedly face thousands, including five Golden Body Realm cultivators…<br/><br/>Those were cultivators of the Golden Body Realm!<br/><br/>And they had been powerless to resist…<br/><br/>Having wandered the seas for many years, Fang Hanyu considered himself well-traveled and well-informed, yet he found no one who could compare to Fang Wang.<br/><br/>He wondered to himself, how had the Fang Family, this measly nest, raised such a golden phoenix?<br/><br/>Qin Tang hurried over to Fang Hanyu, asking in a low voice, “Didn’t you say earlier that Fang Wang is your brother?” “That’s right, what about it?”<br/><br/>“If he’s your brother, then how old is he…”<br/><br/>“One hundred and twelve, I believe. I hope Miss Qin won’t spread the word, to avoid unnecessary trouble.”<br/><br/>Qin Tang fell silent, and Qin Hong, following behind, felt his eyelids twitch furiously.<br/><br/>More than the battle itself, Fang Wang’s age shocked them.<br/><br/>Could such a terrifying genius truly exist in the world?<br/><br/>Meanwhile.<br/><br/>In the clouds at the edge of the sky, the real person Lin Cliff stood shoulder to shoulder with a group of Heavenly Sect elders, all silent. Aside from Lin Cliff, fear was etched on everyone’s faces.<br/><br/>An elder swallowed nervously and asked cautiously, “If… Sword Lord wanted to destroy our Heavenly Sect, would it be as easy as flipping his hand?”<br/><br/>No one answered him; they all just looked towards Lin Cliff.<br/><br/>Lin Cliff closed his eyes, saying, “Fortunately, we are on good terms with him.<br/><br/>His strength is to our advantage, understand?”<br/><br/>The elders were all astute, comprehending the implications of his words.<br/><br/>Upon reaching the wooden platform, Fang Wang began to sit in meditation and cultivate.<br/><br/>He let out a sigh of relief in his heart.<br/><br/>Damn it!<br/><br/>Thank goodness he had killed his enemies, or it would have been a real embarrassment!<br/><br/>This battle had cost Fang Wang a third of his Spiritual Power, hoping it would deter the Sword Cultivators who had yet to arrive.<br/><br/>After Fang Hanyu had settled Qin Hong and Qin Tang, he came to sit next to Fang Wang, cultivating while looking at Fang Wang, and asked, “Don’t you have anything you want to ask me?”<br/><br/>Because there were others present, Fang Wang’s Qi Gathering was very restrained, not leaking the slightest hint of the Heavenly Dao True Skill.<br/><br/>“With this creating such a stir in the world, what more do I need to ask?” Fang Wang spoke without even opening his eyes.<br/><br/>Fang Hanyu shot him a glare and said, “I’ve brought you a treasure, aren’t you curious to see it?”<br/><br/>“You know me, I have no need for magical artifacts or cultivation treasures.”<br/><br/>“Of course, I know. What I’ve got is a mysterious Purple Jade Stone inscribed with Swordsmanship Ultimate Arts. The guardian Ten Thousand Year Sword<br/><br/>Spirit said these arts could allow one to reign invincible in the Mortal Realm.”<br/><br/>Upon hearing this, Fang Wang opened his eyes, and Fang Hanyu immediately took out an egg-sized Purple Jade Stone and then handed it to Fang Wang.<br/><br/>“I’ve tried it; there are powerful prohibitions inside, and my Sword Qi simply cannot break through,” Fang Hanyu said with a look of anticipation on his face. “The Sword Spirit said that only Sword Qi can break through.”<br/><br/>Fang Wang placed the purple jade stone into the Dragon Jade Ring and said, “In some time, I will practice it again, and once I have mastered it, I will teach you. For now, focus on healing your injuries.”<br/><br/>Fang Hanyu nodded and then closed his eyes.<br/><br/>The news that the Sword Sovereign of the Yellow Glyph had slaughtered tens of thousands of Sword Cultivators spread like a whirlwind across the Southern Celestial Sea. This feat included the slaying of five renowned Great Cultivators at the Golden Body Realm and involved nearly twenty Sword Dao sects. It was enough to stir up excited discussions among Cultivators of all seas.<br/><br/>For the first time, the name Fang Wang resounded across the ocean, no longer masked by the title of the Sword Sovereign of the Yellow Glyph!<br/><br/>Canglan Academy.<br/><br/>Gu Li listened as other disciples excitedly discussed the battle achievements of the Sword Sovereign of the Yellow Glyph, and she quietly breathed a sigh of relief.<br/><br/>She had also been to the Sword Qi Dead Sea and was aware of Fang Hanyu’s plight. With her sectmate bond with Fang Hanyu, plus his relationship with Fang Wang, she naturally did not want Fang Hanyu to come to harm.<br/><br/>When she heard that the Sword Sovereign of the Yellow Glyph had powerfully slaughtered tens of thousands of Sword Cultivators, she was shocked, especially since it included the leaders of the Golden Body Realm.<br/><br/>The Golden Body Realm! Having witnessed the grand battles of Golden Body Realm Cultivators at the Sword Qi Dead Sea, which were akin to the fights of legendary figures, she dared not even imagine what kind of cultivation it would take to become so powerful.<br/><br/>Yet, soon after returning, she heard that the Sword Sovereign of the Yellow Glyph had slain five Grand Cultivators of the Golden Body Realm!<br/><br/>It was unbelievable!<br/><br/>“Right, the true name of the Sword Sovereign of the Yellow Glyph has also spread. Guess what his name is?” a female disciple said excitedly.<br/><br/>A male disciple, who held a folding fan, laughed and replied, “Fang Wang. His name has already spread far and wide. Indeed, someone of the strength of the Sword Sovereign of the Yellow Glyph shouldn’t possess such power. If we say that Fang Wang is the Tianzi Sword Monarch, I doubt anyone would question it.”<br/><br/>Fang Wang?<br/><br/>Gu Li’s beautiful eyes widened as she immediately stood up and asked, “Which Fang Wang?”<br/><br/>The other disciples all turned to look at her, each with a hint of astonishment, for Gu Li usually wasn’t this agitated.<br/><br/>As soon as she asked the question, Gu Li regretted it.<br/><br/>Who else could the Fang Wang that saved Fang Hanyu be?<br/><br/>Not likely the same sound, it must be him. He had come to the seas!<br/><br/>And with the demeanor of a conqueror, no less!<br/><br/>Gu Li sat back down, her eyes filled with admiration and excitement.<br/><br/>The disciples looked at the almost bewitched Gu Li, puzzled, and they gathered around, curious to ask whether she Imew Fang Wang.<br/><br/>Before she could speak, another disciple from the Gu Family seemed to have an epiphany and said, “Right, the premier Cultivator possessing the Heaven Yuan Spirit Treasure in our Grand Qi is also named Fang Wang, and he has an excellent relationship with my sister. The family head once said that he intended to betroth my sister to Fang Wang!”<br/><br/>The courtyard erupted into excitement.<br/><br/>Gu Li felt a mix of embarrassment and anger, glaring at the Gu Family disciple, signaling him to shut up, but it was in vain. The disciple, equally agitated, began to recount the legendary tales of Fang Wang to the other disciples. After a long discussion, someone brought up a question, “How old is the Fang Wang you know! Even it he were only two hundred years old, he couldn’t possibly surpass the Golden Body Realm!”<br/><br/>With that remark, everyone fell silent, and the Gu Family disciple was taken aback.<br/><br/>Indeed.<br/><br/>The ages didn’t match up!<br/><br/>But Gu Li did not question it; she was convinced that the Sword Sovereign of the Yellow Glyph was the Fang Wang she knew!<br/><br/>Under the blue sky and white clouds, islands clustered together, long vines connecting them, as numerous Cultivators flew back and forth on their swords.<br/><br/>On one of the islands, halfway up the mountain, there stood a loft building with a small courtyard in front, where a profusion of flowers and plants were being tended to by a man with white hair, watering the plants.<br/><br/>Dressed in a gray robe, his white hair was extremely long. At first glance, he looked like an old man; however, his face appeared only to be in his thirties or forties. If Fang Wang were here, he would have recognized him immediately.<br/><br/>Fang Zigeng!<br/><br/>After many years, the image and temperament of Fang Zigeng had transformed completely.<br/><br/>At that moment, a group of young disciples flew in, landing in the courtyard, buzzing with excitement.<br/><br/>“Master! Master! The Sword Sovereign of the Yellow Glyph has gained new battle achievements!”<br/><br/>“My heavens, the Sword Sovereign of the Yellow Glyph actually slaughtered tens of thousands of Sword Cultivators in one battle, including many elders and sect masters from various sects!”<br/><br/>“I heard it even involved the Golden Body Realm!”<br/><br/>“So powerful, the Sword Sovereign of the Yellow Glyph stuns the world every time he takes action.”<br/><br/>“The name Fang Wang is now thoroughly established, and it’s unclear what realm he’s reached.”<br/><br/>Fang Zigeng did not pay much attention at first, but upon hearing the name Fang Wang, he turned sharply, eyes fixed on the disciple who had mentioned it, and asked, “Fang Wang? Which two characters?”<br/><br/>The disciple, frightened by his master’s gaze, hurriedly replied, “Not sure, but it should be the same surname as Fang Hanyu.”<br/><br/>“Fang Hanyu?” Fang Zigeng was fully excited and immediately put down the watering can to approach the disciples, urging them to clarify their information.<br/><br/>Seeing their master’s rare interest in the affairs of the celestial seas, the disciples all started recounting their stories, each more exuberant than the last.<br/><br/>Youth always aspire to be legendary heroes renowned throughout the world.<br/><br/>As Fang Zigeng heard about Fang Hanyu obtaining the Ten Thousand Year Sword Spirit, a smile appeared on his face. Although he did not know how strong the Ten Thousand Year Sword Spirit was, it must be an extraordinary opportunity.<br/><br/>But when he heard his disciples describe the battle at Biyou Island, he was stunned.<br/><br/>Had Fang Wang grown to such an extent?<br/><br/>Fang Zigeng had thought that with Zhu Xue’s guidance and his incredible fortunes, he might not be able to surpass Fang Wang but should at least have hope of catching up. Now, comparing their achievements, he realized how vast the gap was…<br/><br/>He was still rushing towards the Condensation Spirit Realm, while Fang Wang had already slaughtered tens of thousands at the Condensation Spirit Realm?<br/><br/>And among them, there were those in the Cross-Void Realm and the Golden Body Realm….\t\t\t\t\t\t</div>", "images": {}, "success": true}