{"id": 152, "url": "https://www.novelhall.com/i-became-an-immortal-on-mortal-realm-32879/14304347.html", "title": "Chapter 152 - Chapter 152: Chapter 149: Using Canghai As The Sword_L", "volume": 2, "volume_title": "Volume 2", "body": "<h1>Chapter 152 - Chapter 152: Chapter 149: Using Canghai As The Sword_L</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 152: Chapter 149: Using Canghai as the Sword_l<br/><br/>Translator: 549690339<br/><br/>“We must not take this lightly, especially when we stop. The sword cultivators we face will only become more numerous. By then, even Heavenly Sect will have to bow its head,” Qin Hong said earnestly.<br/><br/>Fang Wang smiled and said, “No matter, let them come in droves, and they’ll die in droves. If it comes to a point where we can’t beat them, we’ll just flee.”<br/><br/>Qin Hong did not continue to persuade him. Just by the glimpses of Fang Wang’s speed and how he subdued the Ten Thousand Year Sword Spirit with a flick of his hand, he knew he was no match for Fang Wang.<br/><br/>Perhaps Fang Wang was not arrogantly overestimating himself, but truly possessed such overpowering strength that he feared no enemies.<br/><br/>The group of four flew into Biyou Island, with Xiao Zi, Zhao Zhen, and Zhu Yan coming over to watch the excitement.<br/><br/>Landing on the beach, Fang Hanyu immediately began meditating to cultivate, and Qin Tang did the same.<br/><br/>After sheathing his sword, Qin Hong looked to the horizon with a grave expression and said, “It seems the deterrent force of Heavenly Sect is lower than I had anticipated.”<br/><br/>Fang Wang also sensed a great deal of sword intent from afar. Those who dared to chase after Fang Hanyu were all people of no small ability in the Sword Dao.<br/><br/>“Master, let me take action for you when the time comes!” Zhu Yan said with a vicious smile, itching for a fight as he rubbed his hands together.<br/><br/>He might not have grasped the full situation, but he could feel the aura from afar—a large number of sword cultivators were attacking, which, to him, was an opportunity.<br/><br/>Zhu Yan always felt a thorn in his side for not having the chance to display his true might to Fang Wang, fearing that Fang Wang would underestimate him.<br/><br/>He was, in fact, very strong.<br/><br/>“No need, I’ll handle it myself. Even if you could win, you would likely face endless troubles afterward. I want to fight a battle that deters anyone from daring to trespass again,” Fang Wang said calmly.<br/><br/>Upon hearing his words, everyone looked at him. Zhu Yan, even more expectant, asked, “Do you plan to use a sword or your fists?”<br/><br/>Use a sword?<br/><br/>Qin Hong and Qin Tang surreptitiously felt a sense of awe. They had long heard rumors about the Sword Sovereign of the Yellow Glyph. The Nine Dragons Tyrant Fist was already world-famous, and subconsciously, they had thought the Sword Sovereign of the Yellow Glyph practiced physical cultivation. Now it seemed that was not the case.<br/><br/>Of course, since he competed for the title of Sword Sovereign, he naturally had to be skilled with a sword.<br/><br/>“Since the enemy are all sword cultivators, naturally, I will confront them with a sword. Using the Rainbow Sword as my blade, let’s see if I can bury their sword intent.”<br/><br/>Fang Wang looked toward the sky and spoke casually. Under his command, the large fog around Biyou Island maintained a huge gap, as if inviting someone into a trap.<br/><br/>“It has been many years since I’ve seen you wield a sword, don’t disappoint me,” Fang Hanyu spoke, opening his eyes with difficulty, full of anticipation.<br/><br/>Fang Wang raised his right hand, and the hilt of the Rainbow Sword appeared in his palm. He gripped it smoothly while the sword blade did not materialize, only the hilt.<br/><br/>Qin Hong, Qin Tang, and Zhu Yan looked at the Rainbow Sword, curiously wondering.<br/><br/>Is this his Lifespirit Treasure?<br/><br/>Zhu Yan thought of the Heavenly Palace Halberd. Could his master have dual Lifespirit Treasures?<br/><br/>At that moment, an extremely strong surge of sword intent approached, causing the fog around Biyou Island to roil violently, as if it would be dispersed at any moment, with the sea surface churning up terrifying waves.<br/><br/>Suddenly, a streak of sword light raced over, rapidly halting several hundred Zhang above Biyou Island. As the sword light dissipated, a man with a full head of white hair and a robust figure appeared. His hands were clasped behind his back, and his face, though not aged, was topped by a white beard. Wearing a green robe fluttering in the wind, he looked quite imposing.<br/><br/>“Sword Sovereign of the Yellow Glyph, you wish to have a part in the Ten Thousand Year Sword Spirit as well?”<br/><br/>The white-haired man spoke, his voice exuding a powerful sense of oppression.<br/><br/>Following that, Fang Wang’s voice emerged, “Why not wait for the others to arrive?”<br/><br/>Upon hearing this, the white-haired man slightly narrowed his eyes and didn’t rush into action immediately.<br/><br/>Zhu Yan whispered, “Master, this man is the Great Elder of Night Sword Sect, Qingying Daoist, at the second level of the Golden Body Realm.”<br/><br/>Fang Wang remained unperturbed.<br/><br/>Soon, wave after wave of powerful presences approached, quickly reaching Qingying Daoist’s vicinity, with even more sword cultivators flying in vast numbers.<br/><br/>“May I ask Sword Lord, do you insist on protecting the one being pursued?”<br/><br/>The voice reached Fang Wang’s ears, unmistakably the use of the Sound<br/><br/>Transmission Technique by a real person from Heavenly Sect standing near<br/><br/>the cliff.<br/><br/>Fang Wang pinpointed the direction of the Heavenly Sect’s real person who was hiding behind a cloud. He replied using the Sound Transmission Technique, “Heavenly Sect need not intervene, just watch.”<br/><br/>He was giving Heavenly Sect a way out. Clearly, Heavenly Sect did not dare confront so many sword cultivators. Doing so would make enemies no matter the outcome.<br/><br/>Fang Wang was not afraid; he roamed free in the world.<br/><br/>The arrival and halt of Qingying Daoist and other Great Cultivators caused the subsequent sword cultivators to stop as well, not daring to act rashly. The number of sword cultivators in the sky kept increasing.<br/><br/>“Is that Biyou Island ahead? Is the island’s master that Sword Sovereign of the Yellow Glyph who slew Ye Canghai?”<br/><br/>“The Sword Sovereign of the Yellow Glyph has the backing of Eternal Life Pavilion; it’s not easy to take action.”<br/><br/>“What’s there to fear? With so many of us, can Eternal Life Pavilion hold us all accountable? All we need to do is kill everyone on the island!”<br/><br/>“There is only one Ten Thousand Year Sword Spirit; it’s not easy to snatch<br/><br/>away.”<br/><br/>“Facing our impressive forces, the Sword Sovereign of the Yellow Glyph won’t still insist on protecting Fang Hanyu, will he?”<br/><br/>The sword cultivators discussed animatedly, their numbers continuously growing, quickly surpassing ten thousand and still increasing.<br/><br/>Looking from Biyou Island, the sword qi of over ten thousand sword cultivators changed the color of the firmament, with waves below continuously roiling, and a strong wind rising between the sky and sea.<br/><br/>Zhu Yan came to Fang Wang’s side, ceaselessly introducing the identities of those powerful cultivators. There were five sword cultivators who had reached the Golden Body Realm, more than three hundred who had surpassed the<br/><br/>Cross-Void Realm, with the lowest realm being the Condensation Spirit Realm.<br/><br/>Qin Hong and Qin Tang’s expressions grew increasingly grave. Qin Tang looked at Fang Wang, hesitating to speak—he wanted to persuade Fang Wang to make a move earlier, to eliminate some enemies in advance, making it easier to face the impending dangers.<br/><br/>But Qin Tang saw that Fang Hanyu did not show the slightest hint of worry. Those Absolute Heart Evil Eyes even flickered with an excited brilliance, which filled her with confusion.<br/><br/>Could it be that the Sword Sovereign of the Yellow Glyph has already surpassed the Golden Body Realm?<br/><br/>“Sword Sovereign of the Yellow Glyph, do you truly intend to die protecting Fang Hanyu? What is your relationship with him?”<br/><br/>Some sword cultivators shouted loudly; they saw Fang Hanyu sitting behind Fang Wang, meditating and practicing. This indicated that Fang Wang was not intending to hoard Fang Hanyu for himself, but that the two were acquainted from the beginning.<br/><br/>No wonder Fang Hanyu fled in this direction!<br/><br/>“His surname is Fang, and mine is too. My name is Fang Wang, what relationship do you think we have?”<br/><br/>Fang Wang’s voice followed, resonating under the firmament—not particularly loud, but clearly audible to the ears of each sword cultivator.<br/><br/>Suddenly, tens of thousands of cultivators burst into uproar, hurling curses. “No wonder, turns out Fang Hanyu has come to seek refuge with a senior relative!”<br/><br/>“Let’s all attack together. A Ten Thousand Year Sword Spirit, this could be our only chance in this lifetime!”<br/><br/>“Fang Wang? Never heard of him. His greatest identity must be as the Sword Sovereign of the Yellow Glyph!”<br/><br/>“Since he’s not from a highly reputable clan, why should we be cautious?<br/><br/>“They couldn’t be father and son, could they?”<br/><br/>Hearing the conversations in the distance, Fang Hanyu’s face quickly turned green, while Qin Hong and Qin Tang seemed to think of something, faces showing shock.<br/><br/>Suddenly!<br/><br/>Fang Wang slowly raised the hilt of his sword. In the sunlight, a white light of a sword blade extended along the hilt, instantly capturing the attention of Zhu<br/><br/>Yan, Qin Hong, Qin Tang.<br/><br/>“Kill!”<br/><br/>Seeing Fang Wang lift his sword, Qingying Daoist immediately shouted the command. As his words fell, he was the first to charge toward Fang Wang, with the Golden Body Realm Great Cultivators flanking him doing the same.<br/><br/>Their target was all to seize Fang Hanyu!<br/><br/>Fang Wang shifted his right foot slightly, and in that instant, his entire aura underwent a drastic transformation as he simultaneously invoked the Heavenly Dao True Skill and the Celestial Sword Intent.<br/><br/>An immense Sword Intent swept across the sky and sea at a terrifying speed, catching Zhu Yan and tens of thousands of sword cultivators off-guard. In that moment, the speed of everything slowed down, the flight speed of tens<br/><br/>Realm moved as slow as turtles, while those in the Condensation Spirit Realm seemed to be frozen in mid-air.<br/><br/>The dazzling white light illuminated the faces of Fang Hanyu, Zhu Yan, Qin Hong, Qin Tang, Xiao Zi, and Zhao Zhen.<br/><br/>As the light and dark of the world altered, their gazes were all concentrated on Fang Wang; they unconsciously opened their mouths, eyes widened in shock.<br/><br/>Fang Wang’s robes flapped violently, his body shone with white light—that was the brilliance of the Celestial Sword Intent, and the white flames of the Heavenly Dao True Skill burned fiercely around him. In everyone’s eyes, his figure was like an immortal god descending from the heavens.<br/><br/>They were like the tens of thousands of sword cultivators in the distance, unable to move, overwhelmed by an indescribable pressure, feeling as if they were facing the heavens themselves.<br/><br/>Then, Fang Hanyu, Zhu Yan, and the others turned their pupils towards the ocean as sword shadows rushed out from the sea. These seemed unaffected by time and space, encircling all the sky’s sword cultivators with unbelievable speed as everything else nearly came to a halt.<br/><br/>Qingying Daoist’s pupils constricted, his right hand raised as he attempted to fend off the sword shadows cutting towards him.<br/><br/>The other Golden Body Realm Great Cultivators did the same, though their movements appeared painfully slow.<br/><br/>“With the Canghai as my sword…”<br/><br/>Qin Hong’s eyes widened, his pupils trembling; his heart surged with shock and awe.<br/><br/>Having lived for hundreds of years, it was the first time he saw such an immense Sword Intent!<br/><br/>Was this truly a realm a sword cultivator could achieve?<br/><br/>Amidst a sword light erupting from the center of the Firmament’s battlefield, all colors were stripped from the sky and sea. Fang Hanyu, Zhu Yan, and the others closed their eyes. But as soon as they closed their eyes, they felt their physical freedom return, and they immediately opened them again.<br/><br/>The sword light between the sky and sea had vanished, and they witnessed a scene they could never forget.<br/><br/>Sword cultivators fell like rain, bleeding profusely, not even a wail of pain to be heard. The turbulent sea was quickly dyed crimson.<br/><br/>The five Golden Body Realm Great Cultivators had not fallen, but their bodies were pierced with sword shadows, thousands of holes in their golden bodies, blood incessantly falling.<br/><br/>Qingying Daoist still maintained the gesture of waving his arm, using his finger as a sword!<br/><br/>The other four Golden Body Realm Great Cultivators had just condensed their Lifespirit Treasures, all swords, their hands trembling as they gazed at Fang Wang, their eyes filled with fear and despair.<br/><br/>“How is this… possible…”<br/><br/>One of the Golden Body Realm elders said tremblingly, feeling a domineering Sword Intent rampaging inside his body, destroying his meridians and acupoints, gradually dissolving his golden body.<br/><br/>Fang Wang’s gaze was icy as he raised the Rainbow Sword, pointing it at the five Great Cultivators. Almost instantly, the numerous sword shadows on their bodies surged out from their flesh, at first glance, as if they were pulled out by an invisible hand, but in reality, they brutally pierced through the golden bodies.<br/><br/>The five Golden Body Realm Great Cultivators burst into bloody mist one after another, their bodies turning into blood clouds, and their Primordial Spirits tried to escape, but Fang Wang wasn’t going to let them have their way..\t\t\t\t\t\t</div>", "images": {}, "success": true}