{"id": 161, "url": "https://www.novelhall.com/i-became-an-immortal-on-mortal-realm-32879/14305602.html", "title": "Chapter 161 - Chapter 161: Chapter 158 The Congenital Heavenly Body, An Even More Terrifying Existence", "volume": 2, "volume_title": "Volume 2", "body": "<h1>Chapter 161 - Chapter 161: Chapter 158 The Congenital Heavenly Body, An Even More Terrifying Existence</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 161: Chapter 158 The Congenital Heavenly Body, An Even More Terrifying Existence<br/><br/>Translator: 549690339<br/><br/>“This person is called Yang Du, and he’s just a madman!”<br/><br/>Zhu Yan muttered under his breath, his words filled with irritation. Xiao Zi grew even more curious and asked, “How is he mad?”<br/><br/>Zhu Yan took a deep breath and said, “My father once saved him and even brought him back to our territory. During his recovery, this scoundrel assassinated many Demon Generals and consumed their flesh and blood. After his deeds were exposed, my father tore him in half and threw him into the sea. Yet, this scoundrel still managed to survive. Since then, he has been attacking our Demon Soldiers out of vengeance, entangling us for nearly a hundred years. That’s when it finally came to a stop.”<br/><br/>Surprised, Xiao Zi asked, “He ate your Demon Generals, why didn’t you eat him?”<br/><br/>“This guy’s flesh is poisonous. My father took one bite and his physical body nearly collapsed… And who would have thought that after being torn in half, he could still come back to life…”<br/><br/>Talking about this incident, Zhu Yan was quite frustrated.<br/><br/>Zhao Zhen asked with curiosity, “Is Yang Du a Sword Lord, or a disciple of the Eternal Life Pavilion?”<br/><br/>Zhu Yan speculated, “He should be a Sword Lord. If he were a disciple of the Eternal Life Pavilion, why would he be in such a miserable state?”<br/><br/>The cultivators nearby were also discussing Yang Du, whose reputation was not good.<br/><br/>“When did this scoundrel join the Eternal Life Pavilion?”<br/><br/>“Pity, we didn’t see who it was that severely injured him earlier.”<br/><br/>“Fang Wang shouldn’t have saved him; this is like raising an ungrateful wolf.” “Speaking of which, what exactly is his constitution? Is he truly immortal?” “Where in the world is there an undying body? It’s just that the location of his vital point is unknown.”<br/><br/>An undying body?<br/><br/>Xiao Zi, Zhao Zhen, and Chu Yin grew even more curious about Yang Du and continued to question Zhu Yan.<br/><br/>Meanwhile.<br/><br/>Fang Wang continued on his journey. He had only one standard when it came to saving people, and that was if he liked the look of them.<br/><br/>If he found them agreeable, he would save them; if not, he would turn a blind eye and expect nothing in return.<br/><br/>The world is vast, and one may only meet certain people once in a lifetime.<br/><br/>Traversing on his Flying Sword, Fang Wang mulled things over in his mind.<br/><br/>“The Jiu You True Person should be going after the Jiu You legacy by now.<br/><br/>Otherwise, if he wanted to find me, it wouldn’t be through such a fluke. The Jiu You legacy…”<br/><br/>Fang Wang was curious. The name of the Jiu You True Person was the same as that of the Jiu You legacy. Was it a coincidence, or had the Jiu You True Person already obtained a part of the Jiu You legacy?<br/><br/>He felt it was more likely the latter. The Jiu You True Person probably had obtained clues early on, which is why he killed his way into the Eternal Life Pavilion and used the pavilion’s powerful intelligence-gathering abilities to look for the Jiu You legacy.<br/><br/>With that in mind, he might as well start looking for the Jiu You legacy too!<br/><br/>Fang Wang remembered Zhou Xue mentioning that once the Jiu You True Person obtained the Jiu You legacy, he would open the Jiu You Spring Eye and then enter the Underworld, implying that the Jiu You legacy was linked to the Underworld.<br/><br/>His eyes shifted as he began to peer into the Underworld.<br/><br/>The separation of Yin and Yang does not mean that the two are independent worlds; in fact, they overlap. It’s just that the beings from both realms hardly come into contact. Using the Heavenly Dao True Skill, Fang Wang peered into the Underworld as he traveled.<br/><br/>Looking directly into the Abandoned Heavenly Secret Realm might not reveal the Jiu You legacy; it would require a special clue. But peering into the Underworld might reveal that the Jiu You legacy wasn’t as deeply hidden as believed.<br/><br/>Thus, while flying, Fang Wang continued to peer into the Underworld along the way.<br/><br/>About two hours later.<br/><br/>Fang Wang suddenly noticed billowing dust at the edge of the sky in a certain direction. It was a scene from the Underworld, invisible if one’s eyes returned to normal, with no anomalies in the Mortal Realm’s sky.<br/><br/>His mind stirred, and he flew toward that direction.<br/><br/>At that moment.<br/><br/>A voice came from behind:<br/><br/>“Benefactor, wait for me!”<br/><br/>Upon hearing this, Fang Wang turned his head and saw a man in tattered robes flying toward him. It was the same man he had helped earlier with two Spiritual Energy pills.<br/><br/>This guy recovers his qi and blood so fast!<br/><br/>How long has it been?<br/><br/>Interested, Fang Wang stopped to wait for the man to fly up to him.<br/><br/>The man was slim, but his exposed muscles were incredibly strong. His face was not handsome, but his eyes exuded a sharp, imposing presence. “I am Yang Du, I thank you, benefactor, for your help!”<br/><br/>The man said with a fist and palm salute, grinning and showing off a row of yellowed teeth.<br/><br/>Yang Du?<br/><br/>Fang Wang narrowed his eyes, scrutinizing Yang Du more closely.<br/><br/>He remembered Zhou Xue had once mentioned that there was one person nobody should provoke, and that was Yang Du.<br/><br/>Could it be this same person?<br/><br/>Fang Wang replied, “It was a mere trifle, mere Spiritual Energy pills can’t save a person. The fact that you survived is mainly because you’re strong enough.”<br/><br/>Yang Du laughed, “Regardless, without your Spiritual Energy pills, I would have missed this trial. Those guys purposefully drained my Spiritual Power and sealed off all my Qi Gathering acupoints. While they can’t kill me, if I continued like this, I would be thrown out without encountering any opportunities, which would be more agonizing than death itself.”<br/><br/>Fang Wang asked with a smile, “Oh? Who is so vicious?”<br/><br/>Yang Du shrugged, “Some brats raised by the Eternal Life Pavilion. Their talents are not bad, but they are narrow-hearted and can’t stand my presence.” Fang Wang nodded and said, “In that case, you should go in search of your fortune.”<br/><br/>Although he was intrigued by Yang Du, he had to kill the Jiu You True Person first.<br/><br/>This was the first task Zhou Xue had asked him to do, and he had to complete it well.<br/><br/>“Wait, I have yet to ask for your name,” Yang Du quickly asked.<br/><br/>“Fang Wang.<br/><br/>“Is it the Sword Sovereign of the Yellow Glyph?” “Mm.”<br/><br/>“Then this is perfect. How about we have a little spar?”<br/><br/>Yang Du revealed an excited smile. He twisted his neck and said with a laugh, “Don’t worry, it’s just a spar. While I am cruel and bloodthirsty, I never lay a hand on those who have helped me.”<br/><br/>Fang Wang asked with a half-smile, “Really?”<br/><br/>He actually wanted to provoke the person Zhou Xue said was not to be provoked.<br/><br/>Back then, before entering the Great Saint’s Grotto-Heaven, Zhou Xue had also listed some people he should not provoke. Looking back now, all of those people looked up to him.<br/><br/>Fang Wang’s confidence was not blind—it was the confidence that came from over eight thousand years of seclusion in the Heavenly Palace!<br/><br/>He could tell that Yang Du’s cultivation probably hadn’t reached the Mahayana Realm but was still within the Golden Body Realm. Among those in the same realm, he truly feared no one.<br/><br/>Yang Du said with a laugh, “Really.”<br/><br/>Inside the Eternal Life Tower, cultivators and monsters who were paying attention to Fang Wang noticed this scene. Although they couldn’t hear anything, they could feel the tense and electric atmosphere between the two men.<br/><br/>Zhu Yan looked forward to Fang Wang with anticipation, hoping he would kill Yang Du.<br/><br/>Fang Wang raised his right hand and clenched his fist under Yang Du’s watchful eyes.<br/><br/>In an instant, a terrifyingly supreme aura burst forth from inside him, covering the whole world and instantly enveloping Yang Du.<br/><br/>Yang Du was moved. Surprise showed in his eyes, which quickly turned to excitement.<br/><br/>“Good! Good! Good!”<br/><br/>Yang Du was so excited that his whole body trembled, a strand of blood qi escaping from his body.<br/><br/>The corners of Fang Wang’s mouth lifted slightly as he silently stimulated the<br/><br/>Heavenly Dao True Skill. In an instant, the might of the Mountain River Town Heaven Fist surged, like a sudden burst from a dike. If what Yang Du had faced before was a mountain breeze, what he faced now was an apocalyptic hurricane!Yang Du’s smile suddenly froze, and his body trembled even more violently. This time it was not excitement, but fear.<br/><br/>Fang Wang looked at his own fist, then turned his gaze to Yang Du and smiled as he asked, “Do you really want to take a hit from my fist?”<br/><br/>Yang Du swallowed hard and said with difficulty, “Patron… it’s not that I have to take it…”<br/><br/>Fang Wang raised an eyebrow and said, “Hmm?”<br/><br/>He slowly pushed his fist toward Yang Du.<br/><br/>Yang Du hastily raised his arms, shouting, “I was wrong! I was truly wrong! I shouldn’t have provoked you!”<br/><br/>This scene, captured in the Eternal Life Tower, made the spectators wear strange expressions. They could judge what he was saying by the shape of Yang Du’s mouth, and his expression was utterly terrified, as if he had encountered the most horrifying thing in the world.<br/><br/>Xiao Zi and Zhao Zhen understood what Fang Wang’s fist clenching represented.<br/><br/>Xiao Zi turned her head to Zhu Yan and asked, “That’s it?”<br/><br/>Zhu Yan coughed lightly, “Naturally, the master is exceptional. What are perceived as tough enemies by others count for nothing before the master, right?”<br/><br/>Several cultivators noticed that the ground in the scene seemed to be trembling slightly. It seemed that Fang Wang was using some sort of spell, frightening Yang Du into submission without even throwing a punch.<br/><br/>Fang Wang released his right fist and flew up to Yang Du, scaring him into trying to dodge, but he was restrained by a press on his shoulder.<br/><br/>Pressing down on Yang Du’s shoulder, Fang Wang leaned over to his ear and whispered, “Saving you was simply because I found you pleasing to the eye. If there is a next time, don’t blame me for sucking out your soul and turning you into a ghost soldier, condemned to never transcend.”<br/><br/>Yang Du stiffened, managing an awkward smile, “There won’t be a next time…”<br/><br/>Fang Wang, hearing this response, patted his shoulder and then turned and left.<br/><br/>Yang Du watched his retreating figure, words on the tip of his tongue but remaining unspoken.<br/><br/>“Who exactly is he that he instills such fear in me…”<br/><br/>Yang Du had never encountered such a being before, and he was terrified at heart. He felt that his immortal body might not be so immortal in front of Fang Wang!<br/><br/>After much hesitation, he still chose to fly in the opposite direction, not daring to bother Fang Wang again.<br/><br/>While flying on his sword, Fang Wang pondered, “Is his body an innate Heavenly Gang Saint Body? It indeed seems different from the Heavenly Gang<br/><br/>Saint Body Technique. ”<br/><br/>When Yang Du’s blood qi surfaced, Fang Wang had seen the thirty-six Heavenly Gang Star Acupoints in his body.<br/><br/>It was definitely a Heavenly Body!<br/><br/>Even stronger than the Heavenly Gang Saint Body Technique he had initially trained.<br/><br/>Interesting.<br/><br/>The corners of Fang Wang’s mouth lifted, as he started looking forward to Yang Du’s future.<br/><br/>He was not afraid of Yang Du growing stronger. He had also trained in the<br/><br/>Heavenly Body and had even created the stronger Heavenly Dao True Skill. As he continued to perfect it, the innate Heavenly Body wouldn’t be able to catch up to him.<br/><br/>The life-long enemy of the Descending Dragon Great Saint would fall to his hands!<br/><br/>Defeating the peak of the Heavenly Body was the only way he would fulfill the long-standing wish of the Descending Dragon Great Saint!<br/><br/>The news of Fang Wang scaring away Yang Du quickly spread inside the Eternal Life Tower. Yang Du’s fame was not universal, but the major powers all knew of him and his immortal body, which was hard to ignore.<br/><br/>Fang Wang had intimidated Yang Du with just a clenched fist—did Fang Wang possess a spell that could slay the immortal body?<br/><br/>No matter what, in everyone’s heart, Yang Du had become Fang Wangs defeated opponent.<br/><br/>At the very least, Fang Wang was even more terrifying than Yang Du!<br/><br/>Those who could not afford to provoke Yang Du certainly could not afford to provoke Fang Wang!<br/><br/>Meanwhile.<br/><br/>Fang Wang was gazing into the Netherworld, flying toward the faint trail of smoke on the horizon.<br/><br/>It was farther than he had imagined. As he drew closer, the smoke on the horizon grew larger.<br/><br/>Good grief!<br/><br/>That wasn’t smoke at all but countless souls drifting in the air, dense and numerous, encompassing both humans and monsters. They kept climbing upwards as if trying to break free from something.\t\t\t\t\t\t</div>", "images": {}, "success": true}