{"id": 163, "url": "https://www.novelhall.com/i-became-an-immortal-on-mortal-realm-32879/14305947.html", "title": "Chapter 163 - Chapter 163: Chapter 160: Slaying Immortals And Ghosts, The Number One Sword Of The Southern Celestial! 1", "volume": 2, "volume_title": "Volume 2", "body": "<h1>Chapter 163 - Chapter 163: Chapter 160: Slaying Immortals And Ghosts, The Number One Sword Of The Southern Celestial! 1</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 163: Chapter 160: Slaying Immortals and Ghosts, The Number One Sword of the Southern Celestial! 1<br/><br/>Translator: 549690339<br/><br/>The Sword of Jiu You!<br/><br/>As the words of Jiu You True Person fell, the ghostly realm centered around him once again violently surged and expanded dozens of miles around. In an instant, the ghostly fog enveloped a hundred-mile radius, and countless ghosts rose from the mist, all of them howling as they looked towards Fang Wang.<br/><br/>Turning the human world into a ghostly realm, filled with the wails and sobs of souls!<br/><br/>From the perspective of Jiu You True Person’s scene, Fang Wang appeared very insignificant.<br/><br/>From Fang Wang’s perspective, the vast ghost realm seemed boundless and endless, extremely oppressive.<br/><br/>Inside the Eternal Life Pavilion, some people were anxiously anticipating, while others were making mocking comments. Seeing the momentum of Jiu You True Person, they knew that the ghostly deity behind Fang Wang was extraordinary, but separated by the formation, they couldn’t feel it.<br/><br/>Jiu You True Person began to swing his sword where he stood, with sword flashes one after another. His sword-swinging speed became faster and faster, creating afterimages that dazzled the eyes.<br/><br/>Fang Wang saw through Jiu You True Person’s gathering of sword momentum. Seeing this, he did not strike, but instead stepped through the air towards Jiu You True Person.<br/><br/>As Jiu You True Person’s sword momentum grew stronger, rolling thunderclouds churned in, and the world quickly darkened.<br/><br/>“What is he waiting for?”<br/><br/>Xuanyuan Xin, the top talent of the Heavenly Sect, couldn’t help but ask, as it was obvious to any discerning eye that Jiu You True Person was preparing for an attack, yet Fang Wang had not made a move.<br/><br/>Lin Cliff True Person’s expression grew solemn as he speculated, “Perhaps Fang<br/><br/>Wang is facing a suppression we cannot feel.”<br/><br/>Each of Jiu You True Person’s swords raised a storm, quickly forming a world-ending hurricane that swept across heaven and earth.<br/><br/>The wild wind rushed towards Fang Wang, dishevelling the dragon beard-like nair In tront or ms toreneacl ana nis slaeDurns. ‘l’ne Heavenly Dao Imperial Dragon Crown shimmered with a faint golden light, and his black clothes billowed violently as if they were about to burst open at any moment.<br/><br/>At that moment, Fang Wang burst out in golden light, and the Golden Scale White Feather Robe appeared on his body. Strands of golden dragon energy spiraled around him, with the sound of dragon chants resonating incessantly.<br/><br/>With the Golden Scale White Feather Robe on, Fang Wang’s aura suddenly changed, lighting up the eyes of the majority of the spectators inside the<br/><br/>Eternal Life Tower. Female cultivators and demonesses were amazed by Fang Wang’s image, and even male cultivators and demons had to admit that at this moment, Fang Wang exuded an extraordinary elegance.<br/><br/>Boom—<br/><br/>Thunder roared, and the countless wicked ghosts within the ghost realm started to roar. They screamed their lungs out at Fang Wang, with teeth bared and claws waving, all becoming crazed, wanting to break free from the invisible shackles and tear Fang Wang to shreds!<br/><br/>Suddenly, Jiu You True Person turned around, holding the sword with one hand, and with a natural swing, he slashed at Fang Wang.<br/><br/>A terrifying sword qi, condensed from ghostly forces, swept across the sky and struck Fang Wang head-on.<br/><br/>Almost instantly, the Heavenly Dao Imperial Dragon Crown burst forth with divine light, forming a white protective barrier to shield Fang Wang, hard resisting the sword qi.<br/><br/>As the sword qi dissipated, the white barrier did not break, moving forward with Fang Wang’s steps.<br/><br/>Jiu You True Person’s face turned pale with shock, and he swung his sword again. This time, it was not just one sword, but multiple terrifying sword qi that spanned the sky and fell wildly on Fang Wang. However strong his offensive, he just couldn’t break through the protective shield of the Heavenly Dao Imperial Dragon Crown.<br/><br/>Fang Wang’s mouth curled into a smile, as this Lifespirit Treasure was created with the secrets of the Heavenly Dao True Skill, its defensive power far surpassing that of the Golden Scale White Feather Robe.<br/><br/>And so, Fang Wang advanced against the sword qi. As the white light barrier continuously neutralized the sword qi of Jiu You True Person, beams of light visible to the naked eye formed in front of him, making him the most eye-catching existence between heaven and earth.<br/><br/>At this moment, the inside of the Eternal Life Tower fell into silence, all the spectators no longer discussing but fixated on the scenes of Jiu You True Person and Fang Wang.<br/><br/>Some were shocked, some fearful, some envious, some pleasantly surprised.<br/><br/>After Jiu You True Person rapidly unleashed five hundred swords, he soared into the air, sword pointed at Fang Wang. The ghostly fog suddenly burst apart, and an endless number of wicked ghosts erupted with an earth-shattering momentum, charging towards Fang Wang one after the other, occupying half of heaven and earth.<br/><br/>The momentum was overwhelming, and unstoppable!<br/><br/>All the spectators inside the Eternal Life Tower dared not blink.<br/><br/>Fang Wang’s eyes turned cold, and he powerfully raised his sword to strike, the movements of the ghostly deity synchronized, as a nearly thirty feet long sword shadow followed suit.<br/><br/>The Executioner Immortal Ghost God Sword!<br/><br/>With one slash, the sword energy swept through the space like ink spilled across the canvas of the world, running for hundreds of miles, sweeping away everything in its path.<br/><br/>Jiu You True Person’s eyes bulged, and instinctively, he tried to lift his sword to defend. The Executioner’s sword qi passed over his physical body with unthinkable speed.<br/><br/>With one sweep, all the wicked ghosts along the way burst consecutively, turning into faint glimmering lights that scattered in the air. This one sword bisected the ghostly realm that covered a hundred miles!<br/><br/>The thunderclouds above were directly split apart, and the land below formed a hugely exaggerated gully as dust and earth soared into the sky.<br/><br/>This sword was too fast!<br/><br/>After Fang Wang swung his sword, an ear-splitting boom resounded through the world, as if everything had exploded!<br/><br/>Rolling clouds of dust rose up, the boundless ghostly fog drifted away with the wind, and countless stones and sand whirled up!<br/><br/>Inside the Eternal Life Pavilion, the red light pillar trembled slightly, shocking all the spectators awake.<br/><br/>“What kind of swordsmanship is this?”<br/><br/>“Hiss—This one sword actually shook the transfer formation of the Eternal Life<br/><br/>Tower!”<br/><br/>“Jiu You True Person already possesses the power to dominate the Mahayana Realm, and yet Fang Wang’s sword is even stronger!”<br/><br/>“The Sword Sovereign of the Yellow Glyph is naturally the strongest in the Sword Dao…”<br/><br/>“Such a terrifying sword, what is the origin of that ghostly shadow?”<br/><br/>Xiao Zi, Zhao Zhen, Zhu Yan, Chu Yin, and many other spectators were dumbstruck.<br/><br/>They were the ones closest to Fang Wang, yet it was also their first time seeing this swordsmanship.<br/><br/>On normal days, they never saw Fang Wang practice swordplay. Could it be that Fang Wang could also comprehend the sword in his Great Dream of Spring and Autumn?<br/><br/>Within the Qi Tian’s secret realm.<br/><br/>Jiu You True Person remained in the air with his sword-raising posture, his body trembling, his face filled with disbelief and despair.<br/><br/>Evil spirits from all directions burst apart, turning into specks of luminescence, as his ghost realm and sword array were both shattered by Fang Wang’s single strike.<br/><br/>Jiu You True Person could not accept this fact, nor could he accept the impending fate of his death.<br/><br/>After the Executioner Immortal Ghost God Sword Qi swept over his physical body, his soul could not leave its shell, meaning he had no means of escape.<br/><br/>“You… What swordsmanship is this…”<br/><br/>Jiu You True Person asked with a trembling voice, his right hand shaking the most violently.<br/><br/>Fang Wang spat out five words, “Executioner Immortal Ghost God Sword.”<br/><br/>Jiu You True Person’s pupils dilated abruptly, and with a loud bang, his body turned into a mist of blood, the mist scattering downwards, leaving behind a glow—that was the soul dispersion after being struck.<br/><br/>Fang Wang brandished his sword again, and the ghost god followed suit.<br/><br/>The spectacular Sword Qi that spanned the heavens and earth appeared once more, this time sweeping across the entire firmament, taking away all specks of light, leaving no evil spirit in the world.<br/><br/>Fang Wang collected all the ghostly souls with one strike, transforming them into the power of the Executioner Immortal Ghost God Sword.<br/><br/>He then lifted his left hand, made a motion through the air, and a storage bag quickly fell into his hand.<br/><br/>The material of this storage bag was not bad; in fact, it was even more durable than Jiu You True Person’s body. He casually attached it to his belt. At the same time, a commotion broke out in the Eternal Life Pavilion.<br/><br/>“Jiu You True Person is dead?”<br/><br/>“To think he was killed by a single strike, what realm is Fang Wang exactly?”<br/><br/>“It must be above Mahayana!”<br/><br/>“Not necessarily, it could just be Mahayana, but his swordsmanship is profound. That sword is definitely the strongest I’ve ever seen,” someone<br/><br/>commented.<br/><br/>“The number one sword in the Southern Celestial, none other than him!”<br/><br/>“One of the twenty-four true personas of the Eternal Life Pavilion has finally been replaced, and so early in the trial at that. This trial is more thrilling than ever before. ”<br/><br/>All sects and noble families were in awe of Fang Wang’s strength, and even the cultivators of the Eternal Life Pavilion felt the same.<br/><br/>No one felt sorrow for Jiu You True Person because the strength displayed by Fang Wang far surpassed that of Jiu You True Person, signifying that the Eternal Life Pavilion had gained an even more powerful true person!<br/><br/>“Hahaha! Jiu You True Person is nothing but this!”<br/><br/>Xiao Zi said excitedly, laughing; indeed, any formidable enemy was no match before the Young Master.<br/><br/>Zhu Yan was in a daze; with his insight, it was clear to him how terrifying Jiu You True Person’s sword array and ghost realm were, and yet such strong techniques were shattered by a single strike from Fang Wang.<br/><br/>A Mahayana realm cultivator was killed by a single strike, body and soul utterly destroyed!<br/><br/>Chu Yin and Zhao Zhen were full of admiration, Fang Wang’s every move refreshed their understanding and stirred their hearts.<br/><br/>Xuanyuan Xin took a deep breath and murmured, “I am far from his equal.” A plump elder beside him said with a wry smile, “It’s not just you. Even if everyone in the Heavenly Sect were to band together, I fear we wouldn’t withstand a single strike from him. After this trial, Fang Wang’s name will thunder throughout the Southern Celestial Sea. This is absolute strength!”<br/><br/>The Jiu You Real Person stroked his beard; however, his expression was very complex. He said in a low voice, “The number one sword of the Southern Celestial has emerged.”<br/><br/>Fang Wang was unaware of the commotion outside. After executing Jiu You True Person, he took a deep breath, a smile appeared on his face, and he thought to himself, “I have avenged you. It’s a pity that you did not witness this strike of mine.”<br/><br/>He turned and flew towards the dilapidated courtyard.<br/><br/>Meanwhile.<br/><br/>Two hundred miles away, Yang Du stood atop a sea of clouds, the winds whipping his tattered robes. At that moment, his forehead was covered in cold sweat, and his eyes were filled with fear.<br/><br/>He had witnessed Fang Wang’s sword execution of Jiu You True Person!<br/><br/>Although he possessed an immortal body, what he feared the most were cultivators of the Ghost Path, their formidable spiritual consciousness often causing him trouble.<br/><br/>Jiu You True Person was among the twenty-four true personas, the existence he dreaded the most.<br/><br/>Such an existence was executed by Fang Wang with a single strike, and he could sense that Fang Wang’s sword was also tainted with the Ghost Path.<br/><br/>“He wasn’t joking…”<br/><br/>Yang Du thought of Fang Wang’s words and couldn’t help shivering, hastily turning around to flee.<br/><br/>He resolved that he would take a detour whenever he saw Fang Wang in the future!<br/><br/>He was still young and needed time to grow; there was no need to stubbornly clash with such a Great Cultivator of insurmountable cultivation!<br/><br/>Elsewhere.<br/><br/>Fang Wang returned to the side of the ancient well, his gaze fixated on it, eyebrows tightly knit.<br/><br/>Ever since he executed the Executioner Immortal Ghost God Sword, he had been hearing a faint voice calling to him, the voice emanating from this very well.<br/><br/>The arrival of Jiu You True Person suggested that the Jiu You legacy lay at the bottom of the well, and he was hesitating whether to seize Jiu You True Person’s legacy.<br/><br/>It would be a waste not to seize it!<br/><br/>Fang Wang recalled Zhou Xue mentioning that Jiu You True Person was the freest and most mysterious among the Ascenders, perhaps possessing abilities not constrained by The Upper Realm.<br/><br/>He withdrew the Rainbow Sword into his body, his right hand conjuring the<br/><br/>Heavenly Palace Halberd, and his left the Six Harmonies and Eight Desolations Seal. Dressed in the Golden Scale White Feather Robe, he leaped into the ancient well.<br/><br/>Inside the Eternal Life Tower, the image of Fang Wang stopped; it didn’t follow him into the well.<br/><br/>A cultivator turned to a friend beside him, cautiously asking, “Did he just conjure two more Lifespirit Treasures?”\t\t\t\t\t\t</div>", "images": {}, "success": true}