{"id": 167, "url": "https://www.novelhall.com/i-became-an-immortal-on-mortal-realm-32879/14306627.html", "title": "Chapter 167 - Chapter 167: Chapter 164: Great Perfection Of Jiuyou Zizaishu, Carefree And Unrestrained", "volume": 2, "volume_title": "Volume 2", "body": "<h1>Chapter 167 - Chapter 167: Chapter 164: Great Perfection Of Jiuyou Zizaishu, Carefree And Unrestrained</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 167: Chapter 164: Great Perfection of Jiuyou Zizaishu, Carefree and Unrestrained<br/><br/>Translator: 549690339<br/><br/>Facing Fo Ling’s inquiry, Fang Wang asked expressionlessly, “What does it matter whether I understand it or not?”<br/><br/>The Golden Buddha looked down at Fang Wang, its expression changing once again as it spoke with a mocking smile, “If you understand, then this seat will bestow upon you a great opportunity; if you do not, your life and death are uncertain. ”<br/><br/>“Don’t trust him, this fellow is extremely cunning. Go directly behind the Golden Buddha, there you’ll find the Jiu You inheritance you seek!”<br/><br/>The urgent voice of Qi Tian, the Demon Venerable, came through.<br/><br/>Fang Wang couldn’t help asking, “If I obtain the inheritance, what will you do if<br/><br/>I don’t save you?”<br/><br/>Qi Tian, the Demon Venerable, was silent for a moment before saying, “To tell you the truth, as long as you can shake the Golden Buddha, I will be able to break through the seal. Although my cultivation is sealed, the Grand An Qi<br/><br/>Yuan and other evil spirits simply cannot stop me.”<br/><br/>Upon hearing this, Fang Wang stepped towards the Golden Buddha.<br/><br/>Fo Ling’s voice followed, “Are you sure he’s worthy of your trust? Why not believe me? Just show me your understanding of the Buddha’s teachings on the pillar, and I will bestow upon you the inheritance behind me, and even grant you a powerful magical artifact.”<br/><br/>“Don’t trust him; I ended up like this because I believed what he said initially!” Qi Tian, the Demon Venerable, said through gritted teeth.<br/><br/>Fang Wang didn’t stop, and gradually, he came to one side of the Golden Buddha. He noticed that there was a distance between the Golden Buddha and the wall, and on the wall behind the Golden Buddha was a large hole emanating a ghastly glow that was chilling to behold.<br/><br/>More than that, at the entrance of the hole was a massive skeleton, stuck between the Golden Buddha and the wall, looking like the upper half of a giant, with a skull covered in cracks.<br/><br/>Fang Wang didn’t touch the Golden Buddha; he stood in the gap between the<br/><br/>Golden Buddha and the wall, his gaze fixed on the text on the back of the<br/><br/>Golden Buddha—indeed, there were writings!<br/><br/>Without Fo Ling revealing itself, Fang Wang read carefully.<br/><br/>The great hall was silent.<br/><br/>In the darkness outside the grand doors, no longer were there the figures of wandering spirits. Fang Wang memorized the text on the back of the Golden Buddha while staying alert to his surroundings.<br/><br/>“Sigh.”<br/><br/>The sigh of Qi Tian, the Demon Venerable, conveyed a sense of helplessness.<br/><br/>He felt that he had been completely open and genuine, even playing the emotional card, but unfortunately, Fang Wang paid no heed, and he gradually lost the belief that this would be his opportunity to escape his bonds.<br/><br/>Fang Wang had no idea what Qi Tian, the Demon Venerable, was thinking, as he just wanted to understand the Jiu You inheritance.<br/><br/>The mysterious cultivation technique behind the Golden Buddha appeared even more complex than the Vajra Invincible Saint Body and the Great Celestial Infinite Scripture. Fang Wang, with the foundation of Yin Yang Xuan Ming Zhen Gong, could see that this technique involved yin and yang; maybe Qi Tian, the Demon Venerable, was telling the truth.<br/><br/>If Qi Tian, the Demon Venerable, had not deceived him, Fang Wang didn’t mind saving him.<br/><br/>After a while,<br/><br/>Fang Wang sorted out the correct order for cultivation and committed it to memory before entering the Heavenly Palace again.<br/><br/>Once inside the Heavenly Palace, Fang Wang opened his eyes, clicking his tongue in wonder.<br/><br/>It was true!<br/><br/>This golden hall had no traps at all, and all the cultivation techniques presented were proven authentic by the test of the Heavenly Palace.<br/><br/>This made Fang Wang even more curious about the origins of the Grand An Resentment Temple, wondering which great being had created this temple and left behind so many opportunities.<br/><br/>However, he was also very aware that these cultivation techniques, being so profound and unfathomable, would lead cultivators to think that there were no dangers within the hall. Once immersed, they would certainly be attacked later.<br/><br/>Perhaps Qi Tian, the Demon Venerable, had suffered this misfortune in such a manner.<br/><br/>Fo Ling was waiting for him to lower his guard!<br/><br/>Fang Wang didn’t think further. Since he had already arrived at the Heavenly Palace, regardless of how long he stayed, only a moment would pass in the real world.<br/><br/>Fo Ling had set a trap with the inheritance of the golden hall, but unfortunately, it had encountered Fang Wang.<br/><br/>But…<br/><br/>“Damn… how long do I need to retreat this time…”<br/><br/>Fang Wang vowed in his heart, this would be the last time.<br/><br/>Yes, the last time of his journey in the Netherworld!<br/><br/>In the face of the urging from Fo Ling and Qi Tian, the Demon Venerable, he even felt an impulse to destroy the Grand An Resentment Temple.<br/><br/>Being confined for too long isn’t good!<br/><br/>Fang Wang invigorated his spirit and began the inheritance cultivation.<br/><br/>This technique was named Jiuyou Zizaishu!<br/><br/>As Qi Tian, the Demon Venerable, had said, with this technique in hand, one could freely traverse the realms of yin and yang, to be precise, no matter where he went, he could instantly enter the Netherworld of that land and also return to the Mortal Realm at any moment!<br/><br/>An extremely domineering technique for escaping!<br/><br/>All along, Fang Wang lacked escape methods, believing that if he wanted to flee, no one could stop him. However, no such spell existed in the world. Even the White Rainbow Evasion Technique and Black Hawk Technique taught by Zhou Xue were merely about speed.<br/><br/>Unlike Jiuyou Zizaishu, if he couldn’t defeat an enemy, he would directly enter the Netherworld, escape and gain distance there. After distancing himself from the enemy, he could jump back to the Mortal Realm—simply invincible.<br/><br/>In the Mortal Realm, very few cultivators could enter the Netherworld, apart from opportunities like the Qi Tian Secret Realm. So far, Fang Wang had only encountered two individuals capable of entering the Netherworld, both were Great Saints.<br/><br/>The specific mysteries of Jiuyou Zizaishu would only be clear after cultivating it to proficiency!<br/><br/>Fang Wang took interest and focused on cultivation.<br/><br/>Even after cultivating the Yin Yang Xuan Ming Zhen Gong to Great Perfection, Jiuyou Zizaishu still felt unfathomably profound to Fang Wang.<br/><br/>As years passed,<br/><br/>When Fang Wang finally mastered Jiuyou Zizaishu, he looked back and saw that six hundred years had passed.<br/><br/>And this was just the initial mastery!<br/><br/>Fang Wang cursed inwardly, not knowing how long it took Jiu You True Person in his past life.<br/><br/>He gritted his teeth and continued cultivating.<br/><br/>Not comparing with others, but with himself!<br/><br/>No matter the pace, as long as he mastered it, he had reached the end.<br/><br/>By the time Fang Wang cultivated Jiuyou Zizaishu to Great Completion, looking back, he saw it had taken another nine hundred years.<br/><br/>At Great Completion, Jiuyou Zizaishu allowed for free travel between the realms of yin and yang at incredible speed, capable of disregarding any formation or restriction.<br/><br/>At this level, unless one was killed instantly, it was nearly impossible to be killed at all.<br/><br/>No wonder Zhou Xue said that Jiu You True Person was the most mysterious, least constrained.<br/><br/>Fang Wang continued his cultivation, Great Completion was not enough; he aimed for the Great Perfection Realm.<br/><br/>The belief that sustained him now was singular, to witness for himself just how powerful the Jiuyou Zizaishu at Great Perfection really was!<br/><br/>But he underestimated the difficulty of reaching Great Perfection in the Jiuyou Zizaishu.<br/><br/>His heart gradually became numb, even frantic, but even when he wanted to give up, it was futile.<br/><br/>If he didn’t succeed, he couldn’t leave!<br/><br/>Every time Fang Wang was about to give up, he would think of his clansmen, think of Zhou Xue, constantly inspiring himself.<br/><br/>Finally.<br/><br/>He succeeded.<br/><br/>Jiuyou Zizaishu Great Perfection!<br/><br/>At the moment of success, Fang Wang felt as though his soul was sublimating.<br/><br/>From now on, he would truly be free and unrestrained!<br/><br/>The Jiuyou Zizaishu was not just for traversing the Mortal Realm and Netherworld; it could also pass directly through any material object, including magical artifacts. This process required the activation of Spiritual Power, and the stronger and more numerous the objects passed through, the more Spiritual Power was consumed.<br/><br/>In other words, from now on, nothing could trap him, unless a Divine Skill surpassing the Jiuyou Zizaishu was used, which may not even exist in the Mortal Realm, and even if they did, how many could master it?<br/><br/>Looking back, Fang Wang realized he had spent a total of two thousand six hundred years practicing the Jiuyou Zizaishu!<br/><br/>He had spent a total of more than five thousand four hundred years in meditation in this golden hall!<br/><br/>This number was significant!<br/><br/>The environment of the Heavenly Palace shattered, and Fang Wang returned to reality. He opened his eyes, and his aura changed abruptly.<br/><br/>Almost instantly, he had captured the Mortal Realm.<br/><br/>With just a thought, he could directly jump back to the Mortal Realm without going through that old well.<br/><br/>This sensation was incredibly mysterious, bringing a hint of pleasure to his numbed and bored heart.<br/><br/>Fang Wang turned around and walked to the right side of the Golden Buddha.<br/><br/>“What, are you giving up? Not going to try more?”<br/><br/>The voice of Fo Ling rang out, full of seduction.<br/><br/>Facing the side of the Golden Buddha, Fang Wang slowly raised his right hand and placed it on the Buddha.<br/><br/>“What are you trying to do?” The tone of Fo Ling became angry.<br/><br/>“Junior Brother!”<br/><br/>The voice of Qi Tian, the Demon Venerable, came with a surprise — he had already despaired, not expecting Fang Wang to disregard the Jiuyou inheritance and choose to save him instead.<br/><br/>He immediately realized that Fang Wang had just been confirming the authenticity of the Jiuyou inheritance.<br/><br/>Fang Wang remained indifferent, without uttering a word, he pushed with force.<br/><br/>In an instant, the Golden Buddha trembled, causing the entire Grand An<br/><br/>Resentment Temple to vibrate, and the countless lost souls in the darkness<br/><br/>emitted pitiful howls.<br/><br/>“Courting death!”<br/><br/>A golden light suddenly burst from the evil face of the Golden Buddha, attacking Fang Wang.<br/><br/>Boom!<br/><br/>The golden light swept past Fang Wang, sliding along the ground for thirty feet before revealing the figure of a Buddha.<br/><br/>This was a gaunt Buddha draped in a kasaya, with twelve golden beads floating behind his head; the face of the Golden Buddha was his face.<br/><br/>He turned his head abruptly, looking incredulously at Fang Wang, and tremblingly asked, “How… how did you do it?”<br/><br/>Fang Wang had used the Great Perfection of the Jiuyou Zizaishu; in that instant, he allowed his physical body to pass through Fo Ling, creating the appearance that Fo Ling had passed through him.<br/><br/>The Great Perfection Jiuyou Zizaishu was incredibly exquisite. As soon as Fang Wang had the thought, his body would instinctively activate the technique, with an extremely fast reaction.<br/><br/>Without exaggeration, if Fang Wang had endless Spiritual Power and continuously maintained the Jiuyou Zizaishu, no one could kill him.<br/><br/>Alas, having endless Spiritual Power was even harder to achieve than the Great Perfection Jiuyou Zizaishu.<br/><br/>Fang Wang did not answer Fo Ling; his right arm thrust violently, pushing the Golden Buddha a hundred feet away, revealing the entrance behind him.<br/><br/>“You…”<br/><br/>Fo Ling trembled all over, seemingly realizing something, he stopped attacking Fang Wang.<br/><br/>As the Golden Buddha moved away, the giant skeleton fell down, turning into powder the moment it touched the ground.<br/><br/>The gaping hole in the wall unleashed a terrible gust of wind, howling through the tunnel as if ghosts and wolves were wailing.<br/><br/>“Hahahaha—<br/><br/>Qi Tian, the Demon Venerable, laughed unrestrainedly. This time, he was not using the Sound Transmission Technique; his laughter echoed throughout the Grand An Resentment Temple.<br/><br/>Fo Ling’s face grew dark as he stared intently at Fang Wang, not even glancing at the hole.<br/><br/>From the darkness outside the golden hall, the voices of the Grand An Qi Yuan arose:<br/><br/>“Not good, that guy is going to escape!”<br/><br/>“What’s going on, why is the master letting someone from the Mortal Realm push aside the Buddha statue?”<br/><br/>“Could that person be stronger than the master?”<br/><br/>“Impossible…”<br/><br/>“What exactly is happening…”<br/><br/>Fang Wang turned around, giving Fo Ling a sideways glance, his expression indifferent, which made Fo Ling’s heart shudder.<br/><br/>Fo Ling clenched his teeth, “Don’t tell me… impossible… could it be you’ve already received the Jiuyou inheritance before?”<br/><br/>Fang Wang did not reply, just quietly waited.<br/><br/>The trembling of the Grand An Resentment Temple grew more violent, and the laughter of Qi Tian, the Demon Venerable, grew louder and louder.<br/><br/>Not just the Grand An Resentment Temple, the entire mountain seemed on the verge of collapse, the ground shuddering and the mountains swaying.<br/><br/>Boom!<br/><br/>The hole in the wall suddenly spewed out rolling black Demonic Qi, which rushed into the darkness outside the gate. The Demonic Qi spread throughout the temple as if it were about to devour everything.<br/><br/>Fanc Wang cast a glance at it. and within the billowing Demonic Oi. a figure began to condense.\t\t\t\t\t\t</div>", "images": {}, "success": true}