{"id": 160, "url": "https://www.novelhall.com/i-became-an-immortal-on-mortal-realm-32879/14305601.html", "title": "Chapter 160 - Chapter 160: Chapter 157 The Trial Begins, Calamity_1", "volume": 2, "volume_title": "Volume 2", "body": "<h1>Chapter 160 - Chapter 160: Chapter 157 The Trial Begins, Calamity_1</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 160: Chapter 157 The Trial Begins, Calamity_1<br/><br/>Translator: 549690339<br/><br/>“I want to kill you!”<br/><br/>As Fang Wang’s words rang out, all nearby cultivators and demons were stunned, even the smile on Jiu You True Person’s face froze.<br/><br/>Silence spread swiftly, and more and more cultivators and demons turned their heads to stare at Fang Wang with strange looks in their eyes.<br/><br/>Such arrogance!<br/><br/>To want to kill Jiu You True Person, and to make Jiu You True Person come to him willingly…<br/><br/>Utter disdain!<br/><br/>This was the thought of everyone who heard him. They previously thought Fang Wang to be amiable, or at least someone who understood etiquette. Little did they expect him to utter such mad talk, which was a complete affront to Jiu You True Person’s dignity, sealing a deadly enmity!<br/><br/>Zhu Yan and Xiao Zi were fired up; this was the Fang Wang they knew.<br/><br/>Chu Yin swallowed hard, coming to a new understanding of his master.<br/><br/>At a distance, Tian Can True Person, who was exchanging pleasantries with other Great Cultivators, looked towards Fang Wang with interest.<br/><br/>He was the first True Person to actively seek friendship with Fang Wang, and he had had a good first impression. To see Fang Wang so arrogant with the other True Persons aroused his curiosity even more.<br/><br/>“Are you serious?” Jiu You True Person stared at Fang Wang and asked coldly.<br/><br/>Fang Wang ignored the gazes of the people around him and met Jiu You True<br/><br/>Person’s eyes, saying, “I hope that True Person takes me seriously.”<br/><br/>The reason for his arrogance was to make a statement to Jiu You True Person, so that the latter wouldn’t simply head for the Jiu You inheritance during the trial and leave him with nothing.<br/><br/>The trials of Eternal Life Pavilion would certainly connect to a vast secret realm.<br/><br/>“Very well, then I hope you don’t disappoint me!”<br/><br/>Jiu You True Person left these words behind and left with a flick of his sleeve.<br/><br/>Once he departed, others crowded around Fang Wang, some advising him to be careful, others praising his audacity.<br/><br/>In the Eternal Life Pavilion and the sea beyond, Jiu You True Person’s reputation was not good; many found him disagreeable, but given his profound cultivation, few dared to openly rebuke him.<br/><br/>Jiu You True Person was known for rigorously exacting revenge; most who offended him met with terrible fates.<br/><br/>Qu Xunhun looked towards Fang Wang, almost wanting to say something but stopped.<br/><br/>Like this, the conflict between Fang Wang and Jiu You True Person quickly spread throughout all five levels of the Pavilion.<br/><br/>Xuanyuan Xin of Heavenly Sect regarded Fang Wang from a distance, murmuring with relief, “It’s fortunate that I did not challenge him back then.”<br/><br/>Lin Ya True Person stroked his beard, saying, “Fang Wang is extraordinary; I originally thought he would set his sights on Tianzi Sword Monarch, but it turns out he’s aiming for the position among the twenty-four True People.”<br/><br/>The other elders of Heavenly Sect felt similarly relieved that their sect was on good terms with Fang Wang; they were also very curious about the impending showdown between Fang Wang and Jiu You True Person.<br/><br/>Time continued to pass.<br/><br/>About another hour later, the sound of a bell rang from the top of the tower, causing all cultivators and demons within each level to fall silent.<br/><br/>“The internal trial of Eternal Life Pavilion will soon begin; this trial will connect to the Qi Tian Secret Realm.”<br/><br/>“The Qi Tian Secret Realm is a vast secret realm discovered by Eternal Life Pavilion 130 years ago, abound with countless opportunities, and not yet fully understood by the Pavilion.”<br/><br/>Qi Tian Secret Realm!<br/><br/>Fang Wang then heard a buzz of excitement from around him, and soon, the name Qi Tian Demon Emperor came up.<br/><br/>He felt as if he had heard the name before.<br/><br/>wait!<br/><br/>The white-haired elder in the Zhui Tian Secret Realm had mentioned that a demon had learned the Mountain River Town Heaven Fist five thousand years ago, who was coincidentally named Qi Tian.<br/><br/>Interesting.<br/><br/>Xiao Zi and Zhao Zhen came to the same realization and looked at Fang Wang, but Fang Wang seemed indifferent.<br/><br/>The mysterious voice went on to introduce the Qi Tian Secret Realm and even spoke of Qi Tian Demon Emperor.<br/><br/>Qi Tian Demon Emperor was the most powerful demon in the Southern<br/><br/>Celestial Sea three thousand years ago, commanding over tens of Demon<br/><br/>Emperors, with countless demon soldiers. The current ruler of the Monster Palace was one of Qi Tian Demon Emperor’s Demon Emperors, who now bears the title Demon Venerable.<br/><br/>Although the Monster Palace’s Demon Venerable is strong, he is far from matching Qi Tian Demon Emperor in the eyes of the world.<br/><br/>Legend has it that Qi Tian Demon Emperor nearly ascended to immortality, but after failing, he fell into a demonic fit and mysteriously disappeared, with no one knowing whether he was dead or alive.<br/><br/>After Eternal Life Pavilion finished introducing the Qi Tian Secret Realm, it announced the start of the trial.<br/><br/>Boom—<br/><br/>The red column of light inside Eternal Life Tower erupted with terrifying pressure that shook the entire structure; the strong winds forced cultivators and demons at the edges of the platforms to retreat, fearing they might be swept up in it.<br/><br/>Name after name, disciples, True Persons, Soldier Sovereigns, and envoys of Eternal Life Pavilion flew into the red column of light. Qu Xunhun nodded towards Fang Wang before being the first to fly into the column.<br/><br/>“Young Master, we’ll wait for you,” Xiao Zi said, unable to hide its reluctance.<br/><br/>Since following Fang Wang, it had rarely been apart from him, so it was a bit worried.<br/><br/>Fang Wang patted its snake head soothingly, took it off, then leapt into the red column of light, his black clothes quickly disappearing into it.<br/><br/>Upon entering the red column, Fang Wang took out the Yellow Glyph Sword Sovereign Order, and immediately felt a powerful force envelop him.<br/><br/>With a sense of the world spinning, Fang Wang found himself unable to move.<br/><br/>Unlike the previous forays into the Zhui Tian Secret Realm and the Great Saint’s Grotto-Heaven, this time, the teleportation took even longer.<br/><br/>After all the trial participants entered the red column of light, the surface of the red light displayed scene after scene of the world, showcasing the conditions within the Qi Tian Secret Realm.<br/><br/>On the other side, it took what felt like half a stick of incense in time before Fang Wang felt his body plummeting, the mysterious power covering him disappearing.<br/><br/>He opened his eyes, and what appeared before him was an expansive and desolate land with barren mountains and rivers crisscrossed by gorges and fissures, while dense dark clouds filled the sky above, as if heavy rain was imminent.<br/><br/>He was a thousand feet from the ground, closing the distance rapidly.<br/><br/>He didn’t rush to steady his form but instead turned his head to look around. There wasn’t a soul in sight in any of the eight directions; he seemed to be the only person within a ten-mile radius.<br/><br/>Before he entered the red beam, at least a thousand people had entered for the trial, which highlighted the vastness of the Qi Tian Secret Realm.<br/><br/>Fang Wang picked a direction, and a Flying Sword shot out from his Dragon Jade Ring, upon which he stepped and flew off.<br/><br/>His black robe fluttered in the wind, the first Superior Grade Spiritual Weapon, the Qingjun Sword, hung at his waist, and he wore the Heavenly Dao Imperial Dragon Crown on his head. Fang Wang looked imposing, and at this moment, his figure appeared above the red column of light within the Eternal Life Pavilion, attracting many glances.<br/><br/>Hundreds of scenes emerged on the red column of light, and the fact that Fang Wang could occupy a frame by himself was indicative of how highly the Eternal Life Pavilion regarded him.<br/><br/>Xiao Zi, Zhu Yan, Zhao Zhen, and Chu Yin quickly moved to the platform directly facing where Fang Wang was, but they weren’t the only ones. Many were curious about Fang Wang’s performance and came over, including the members of the Heavenly Sect.<br/><br/>Fang Wang, however, was unaware of the outside world’s situation. He flew with his sword, enjoying the scenery along the way.<br/><br/>Unlike the Zhui Tian Secret Realm and the Great Saint’s Grotto-Heaven, though vast, the Qi Tian Secret Realm did not have as much Spiritual Energy as the former two and was even lacking in vitality.<br/><br/>Fang Wang suddenly remembered something and took out the Yellow Glyph Sword Sovereign Order, hoping to use the Illusory Map within it, but unfortunately, it was unsuccessful.<br/><br/>After entering the Qi Tian Secret Realm, the Illusory Map inside the Yellow Glyph Sword Sovereign Order had become ineffective.<br/><br/>He could only put the Yellow Glyph Sword Sovereign Order back into the Dragon Jade Ring and started sensing which direction had the thickest concentration of Spiritual Energy.<br/><br/>Places with dense Spiritual Energy often harbored treasures, and such places were more likely to attract trial participants.<br/><br/>Having sped for hundreds of miles, Fang Wang slowed down. Following his gaze, one could see an endless wasteland ahead with a swamp situated on it that was nearly a hundred feet in diameter, surrounded by dark green poisonous gases with dozens of trial participants encircling the swamp.<br/><br/>With one glance, Fang Wang did not see Jiu You True Person, and he was quite disappointed.<br/><br/>However, the trial participants here were not weak; several had unfathomable cultivation levels, even comparable to the Tianzi Sword Monarch Tang Changbai.<br/><br/>Fang Wang’s eyes pierced through the rolling poison fog and saw a purple flower standing in the center of the swamp, with three blood-red fruits the size of fists growing beneath its petals.<br/><br/>The Heavenly Dao True Skill contained the mysteries of the Yin Yang Xuan<br/><br/>Ming Zhen Gong, which allowed Fang Wang’s eyes to directly peer into the Underworld; he saw that around the purple flower was a gigantic crocodile spirit lurking, watching the trial participants outside the swamp, who were oblivious to its presence.<br/><br/>Beings of the Underworld, spirits of the Mortal Realm cannot perceive.<br/><br/>Fang Wang paid it no heed and immediately flew off in another direction.<br/><br/>Finding Jiu You True Person was his primary goal; after killing Jiu You True Person, he would then search for treasures!<br/><br/>His actions sparked discussions among many Cultivators and demons within the Eternal Life Pavilion.<br/><br/>“Tsk, tsk, he looked once and left. Does he look down on that treasure, or does he have another goal?”<br/><br/>“It’s obvious. He’s looking for Jiu You True Person.”<br/><br/>“This one is a fierce character who slaugh tered five people at the Golden Body<br/><br/>Realm in one battle; I truly don’t know how he got into trouble with Jiu You<br/><br/>True Person.”<br/><br/>“Quick, look at Jiu You True Person, he also seems to be searching for something.”<br/><br/>The clash between Fang Wang and Jiu You True Person clearly alarmed the higher-ups in the Eternal Life Pavilion, hence why the images of Fang Wang and Jiu You True Person were placed one above the other, snugly adjacent.<br/><br/>In the following several hours, Fang Wang visited more than a dozen places where Heavenly Materials and Earthly Treasures grew but never encountered Jiu You True Person.<br/><br/>He wasn’t in a hurry; the trial would last a year, and he had plenty of time to search methodically.<br/><br/>After a year, his Yellow Glyph Sword Sovereign Order would take him out of the trial.<br/><br/>It’s worth noting that if the Token is lost, one can only stay within the Qi Tian Secret Realm.<br/><br/>The Qi Tian Secret Realm had no distinction between day and night, no matter where one went; the scenery was always overcast and dim.<br/><br/>One day, as Fang Wang was flying with his sword, his gaze suddenly turned toward the ground, where he spotted a pile of broken stones with an injured man lying amongst them, covered in wounds.<br/><br/>However, he had not a single Storage Bag or Storage Ring on him, obviously having been robbed.<br/><br/>Fang Wang immediately took out two superior-grade Spiritual Energy Pills from his Dragon Jade Ring and tossed them to the man before continuing on his way.<br/><br/>To him, the two Spiritual Energy Pills were insignificant. He had simply felt that the man had a strong physique but was drained of Spiritual Power, which is why he had given him two pills, uncertain if they would save the man’s life.<br/><br/>The man lying in the pile of stones was quite young. He struggled to open his eyes and lifted his right hand to grab the two Spiritual Energy Pills beside him, shakily stuffing them into his mouth.<br/><br/>As the Spiritual Energy entered his body, his eyes changed. He turned his head to look in the direction Fang Wang had departed, his eyes flickering, his thoughts unclear.<br/><br/>Fang Wang was unaware of whom he had saved or the impact his action had on the occupants of the Eternal Life Pavilion.<br/><br/>It was simply a gesture he made in passing, and not the first time he had acted this way.<br/><br/>“Why did the master save him? He is a disaster!” Zhu Yan couldn’t help but say, his tone indignant.<br/><br/>Xiao Zi asked curiously, “Who is he? Is he very powerful?”\t\t\t\t\t\t</div>", "images": {}, "success": true}