{"id": 162, "url": "https://www.novelhall.com/i-became-an-immortal-on-mortal-realm-32879/14305946.html", "title": "Chapter 162 - Chapter 162: Chapter 159 Fang Wang Battles Jiu You True Person 1", "volume": 2, "volume_title": "Volume 2", "body": "<h1>Chapter 162 - Chapter 162: Chapter 159 Fang Wang Battles Jiu You True Person 1</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 162: Chapter 159 Fang Wang Battles Jiu You True Person 1<br/><br/>Translator: 549690339<br/><br/>Fang Wang did not slow down after discerning the situation on the horizon; instead, he sped up a bit.<br/><br/>So many ghosts, maybe they really have something to do with the Jiu You inheritance.<br/><br/>After flying another twenty or thirty miles, Fang Wang finally saw the source of the ghosts—it was actually an ancient well.<br/><br/>The terrain ahead was undulating, and a dilapidated courtyard was situated between the mountains, with a dead tree on the north side that didn’t have a single leaf. The courtyard was surrounded by houses with broken roofs and dilapidated walls, and that well was in the center of the courtyard, continuously emitting ghosts crawling out from it.<br/><br/>Without peering into the Netherworld, the courtyard just seemed desolate because it had an open view in all directions; from a distance, it didn’t appear horrifying. Moreover, the Spiritual Energy in this area was very thin, unlike a place that nurtures Heavenly Materials and Earthly Treasures, so there were no other creatures nearby.<br/><br/>Fang Wang flew into the courtyard and stood not far from the old well, carefully observing it.<br/><br/>He sent his divine sense into the well and then activated the Heavenly Dao True Skill.<br/><br/>In an instant, his divine sense felt a strong suction force in the well, trying to pull him into its depths, causing him to promptly retract his divine sense. Fang Wang frowned, hesitant whether to enter the well and take a look.<br/><br/>He then decided to wait in the courtyard.<br/><br/>He went to a corner of the wall to sit cross-legged, leaning against the courtyard wall, and began to close his eyes for a short rest.<br/><br/>This well was likely an entrance to the Netherworld, and having been in the Qi Tian Secret Realm for so long, he felt that if there was any place most likely to contain the Jiu You inheritance, it would be at the bottom of this well.<br/><br/>Anyway, it was not easy to search for the Jiu You True Person, so he might as well wait and see.<br/><br/>Just like that, Fang Wang kept sitting still for the following days, and the Cultivators and monsters who were watching him did not leave but continued to stare at him.<br/><br/>In fact, the scenes of other trial participants were mostly the same; it wasn’t possible for everyone to be exciting all the time, and the Eternal Life Pavilion did not let the atmosphere cool down, regularly holding auction events. If a thrilling combat erupts, the auction would pause.<br/><br/>The Eternal Life Pavilion also allowed all guests to provide items for the auction, but they were appraised for value. Only treasures of immense worth could make it onto the auction stage.<br/><br/>Even Zhu Yan, Xiao Zi, Zhao Zhen, and Chu Yin were attracted by the auctions.<br/><br/>In the blink of an eye, more than half a month had passed.<br/><br/>During this time, trial participants occasionally flew overhead, but Fang Wang remained undetected thanks to his effortless and natural Cultivation Technique, quietly cultivating and occasionally observing the ghosts in the old well.<br/><br/>The ghosts could not see Fang Wang, as not all beings of the Netherworld could peep into the mortal realm; the separation of Yin and Yang applies not only to the mortal realm.<br/><br/>One day, Fang Wang suddenly sensed something and abruptly opened his eyes.<br/><br/>He looked up to see rolling flames sweeping across the Firmament, with the momentum of the fire waves as fast and ferocious as thunder. In less than five breaths’ time, it extended to the horizon.<br/><br/>Such strong Spiritual Power!<br/><br/>This was Fang Wang’s first time feeling such potent Spiritual Power; the sky-filling fire waves were all formed by the convergence of Spiritual Power, showing how robust the Spiritual Power of the practitioner was.<br/><br/>He immediately thought of one name.<br/><br/>Ji Yang True Person!<br/><br/>One of the Southern Celestial Four Heroes, and the most powerful figure in this trial; he was best at fire-related Spells.<br/><br/>The names of the Twenty-Four True Persons all relate to their paths of Cultivation. The fire of Ji Yang True Person is said to be the strongest flame in the Southern Celestial Sea.<br/><br/>Fang Wang couldn’t help but compare the fire in the sky to his own Solaris True Fire.<br/><br/>They can’t be compared!<br/><br/>The main reason was the difference in cultivation; the Spiritual Power in that fire wave was vast, and even the most ordinary fire, when gathered to such an overwhelming extent, would not be weak.<br/><br/>However, Fang Wang was full of confidence in his Solaris Scripture. The Solaris Scripture also recorded higher realms, indicating that the Solaris True Fire itself was among the most powerful flames in the world. Although Ji Yang True Person was one of the Southern Celestial Four Heroes, he had not yet reached the pinnacle of the mortal world.<br/><br/>The raging sea of fire was unstoppable. It took quite a while for it to finally disappear at the ends of heaven and earth, and from beginning to end, Fang Wang did not catch a glimpse of Ji Yang True Person’s figure; all of this seemed like a phenomenal event of the Firmament.<br/><br/>Fang Wang watched silently as the sea of fire disappeared into the distance.<br/><br/>Although he was strong, he still had a long way to go.<br/><br/>Once this trial was over, he planned to integrate the Heavenly Dao True Skill with the Solaris Scripture and fuse it with all of the Sword Dao he had mastered.<br/><br/>What this world never lacked was geniuses, so he could not be arrogant, especially since he had not yet reached the pinnacle of the mortal world.<br/><br/>He closed his eyes and continued to wait for the Jiu You True Person.<br/><br/>Nine days later.<br/><br/>Fang Wang opened his eyes once more, this time with a smile on his face, because he sensed the breath of Jiu You True Person.<br/><br/>At the same time, inside the Eternal Life Tower.<br/><br/>“Jiu You True Person is about to meet Fang Wang!”<br/><br/>Someone exclaimed, immediately attracting more people to the scenes of Fang Wang and Jiu You True Person, ready to watch the battle.<br/><br/>Up to now in the trial, there had been many battles, but the strongest had only been at the Golden Body Realm level, and there had been no combat at the Mahayana Realm level, so this battle was drawing much attention. “Tch, Fang Wang actually managed to wait out for Jiu You True Person!” “Could this courtyard contain some secrets?”<br/><br/>“It doesn’t seem so, but obviously Fang Wang anticipated that Jiu You True Person would come here. From this point of view, Fang Wang holds the initiative.”<br/><br/>“Has there ever been a precedent in the Eternal Life Pavilion of a Sword Sovereign of the Yellow Glyph slaying a True Person?”<br/><br/>“Hey, don’t underestimate Jiu You True Person, this guy may be despicable, but his strength is indeed unfathomable.”<br/><br/>As people voiced their support for Jiu You True Person’s chances of winning, more and more related discussions emerged. Fang Wang had a high reputation, but it was just recent years after all, while Jiu You True Person was a true Mahayana Realm Cultivator!<br/><br/>Xiao Zi, hearing more and more voices in support of Jiu You True Person, couldn’t help but huff softly.<br/><br/>Zhao Zhen and Zhu Yan became tense.<br/><br/>Neither of them had ever clashed with a cultivator of the Mahayana Realm, and knowing that Fang Wang was only at the Golden Body Realm, they couldn’t help but worry.<br/><br/>Chu Yin, however, had a face full of anticipation; he believed his master would prove himself.<br/><br/>He couldn’t forget the scene where Fang Wang transformed into the Black Dragon; even now, thinking about it, his heart surged with emotion.<br/><br/>Under the watchful eyes of the crowd, Jiu You True Person proceeded forward, stepping on dark ghost clouds. His figure was terrifying, and his target was the dilapidated courtyard where Fang Wang was staying.<br/><br/>“Could it be hidden there?”<br/><br/>The Jiu You True Person glanced at the compass in his hand, his eyes flickering as he silently pondered.<br/><br/>The needle on the compass trembled incessantly but kept pointing straight ahead, with only minor fluctuations.<br/><br/>He began to slow down, gradually approaching the courtyard ahead.<br/><br/>Just then, a figure leapt from the courtyard and looked down at him mid-air.<br/><br/>Jiu You True Person frowned, his eyes revealing a daunting intent to kill as he coldly asked, “Is it you, what are you doing here?”<br/><br/>His voice clearly reached Fang Wang’s ears without echoing through heaven and earth.<br/><br/>Fang Wang, clad in black, slowly lifted his right hand, a sword hilt condensing in his palm. Holding the hilt, he slightly raised his chin and said, “It seems there’s an entrance to the Netherworld here; could it be that’s what you’re after?”<br/><br/>At these words, Jiu You True Person’s face instantly darkened.<br/><br/>He stared intently at Fang Wang, his thoughts flashing like lightning.<br/><br/>In an instant, many possibilities came to mind.<br/><br/>After being provoked by Fang Wang, he had been pondering what karma existed between Fang Wang and himself, but despite much thought, he could not comprehend it.<br/><br/>Now, he suddenly thought of a possibility that made him very angry.<br/><br/>“And you, did you also come for it?” Jiu You True Person asked coldly. He too condensed a long sword, slender with a black blade that emitted a cold glint.<br/><br/>Strands of Ghost Qi seeped from the blade, quickly condensing into ghostly figures that spread around Jiu You True Person.<br/><br/>Fang Wang stared at him and smiled, “Of course not, I came for you, but I am aware you’re looking for it.”<br/><br/>Jiu You True Person’s eyes burst with a chilling light as he harshly asked, “Who are you, exactly?”<br/><br/>Boom!<br/><br/>A terrifying aura erupted from within him; rolling Ghost Qi spilled out from his body, his black robe wildly fluttering, and the ghost fog spreading rapidly, covering a range of hundreds of feet in an instant and still expanding.<br/><br/>Within the vast ghost fog, ghosts began appearing one after another – humans and demons alike, as if awakening and rising together, creating a spectacular scene.<br/><br/>Inside the Eternal Life Tower, discussions arose again; the ongoing auction was halted, and the scene with Fang Wang and Jiu You True Person zoomed in, overshadowing other scenes, making it clear for all spectators from all floors and directions.<br/><br/>“This fellow’s Ghost Domain has strengthened even further.”<br/><br/>“How many beings had to die for this?”<br/><br/>“No wonder he’s been so low-profile these years; turns out he’s been collecting ghosts in the dark.”<br/><br/>“Fang Wang is in trouble unless he possesses a spell that counters the Ghost<br/><br/>Path. ”<br/><br/>“What sect does Jiu You True Person’s cultivation technique belong to? Why can’t I see through it at all?”<br/><br/>As Jiu You True Person cast his Ghost Domain, more and more spectators were curious about how strong his real power was.<br/><br/>Zhao Zhen showed a smile, no longer feeling anxious.<br/><br/>Zhu Yan noticed the change in his expression and couldn’t help but ask, “Could it be that the master is proficient in spells that counter the Ghost Path?” Zhao Zhen smiled and said, ‘What do you think? Just look at me.”<br/><br/>Upon hearing this, Zhu Yan also revealed an excited smile. The cultivators around them overheard their conversation, making them even more eager for the upcoming battle.<br/><br/>Fang Wang, watching the growing Ghost Domain and the increasing number of ghosts appearing, slightly raised his eyebrows; the Rainbow Sword in his hand burst forth with a white light blade.<br/><br/>“Didn’t I say it? I’m Fang Wang, the one who will kill you.”<br/><br/>Fang Wang’s smile curled up at the corner of his mouth, looking so arrogant in the eyes of Jiu You True Person.<br/><br/>Boom!<br/><br/>Suddenly, Fang Wang unleashed his own Sword Intent, a momentum so powerful that it scattered the clouds in the sky and caused the mountains below to tremble, while the eaves of the dilapidated courtyard were shaken, shedding sand and stones continuously.<br/><br/>A vast Sword Intent enveloped heaven and earth, and behind him, it took the form of a ghostly god.<br/><br/>A pitch-black ghostly figure, resembling him in stature, also held a sword in hand.<br/><br/>As the ghostly figure appeared, sounds of astonishment rose one after another within the Eternal Life Tower, while Jiu You True Person’s brows furrowed tightly.<br/><br/>Fang Wang raised his sword, pointing from afar at Jiu You True Person, and the ghostly god raised its sword in the exact same posture.<br/><br/>“Come, let me see the prowess of one of the Twenty-Four True Persons; don’t disappoint me!”<br/><br/>As Fang Wang spoke, his body gradually emitted a white flame, and his eyes turned cold!<br/><br/>Heavenly Dao True Skill!<br/><br/>Facing Jiu You True Person, Fang Wang decided to take it seriously.<br/><br/>Jiu You True Person held aloft his black sword, pointing it towards the firmament, his face becoming ferocious, a cruel smile appearing as he chillingly said, “Wait until I draw out your soul, then I’ll understand your true origin. Boy, you have successfully angered me, and soon you will witness swordsmanship that I have never used before!”<br/><br/>“The Sword from Jiu You!”\t\t\t\t\t\t</div>", "images": {}, "success": true}