{"id": 174, "url": "https://www.novelhall.com/i-became-an-immortal-on-mortal-realm-32879/14309113.html", "title": "Chapter 174 - Chapter 174: Chapter 171: The Great Saint’S Fate, The Number Of The Path Of Immortality", "volume": 2, "volume_title": "Volume 2", "body": "<h1>Chapter 174 - Chapter 174: Chapter 171: The Great Saint’S Fate, The Number Of The Path Of Immortality</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 174: Chapter 171: The Great Saint’s Fate, The Number of The Path of Immortality<br/><br/>Translator: 549690339<br/><br/>“Yang Du can be that formidable?” Fang Wang asked in surprise.<br/><br/>Zhou Xue poured herself another cup of wine and said, “Those who reach the pinnacle of the Mortal Realm all possess many great opportunities. Just like Xu Qiuming, his talents in the vast sea are merely mediocre. Once Yang Du’s Heavenly Body reaches Great Completion, he will be able to vie for even more significant opportunities.”<br/><br/>Something suddenly occurred to Fang Wang, and he said, “You aren’t plotting against Ji Rutian, are you?”<br/><br/>Zhou Xue smiled and replied, “The Ji Family has a person who understands fate, and now the Fang Family has one too. Don’t worry, even if some of Ji Rutian’s opportunities end up with you, he will still be able to grow.”<br/><br/>Fang Wang then asked, ‘Was Chu Yin formidable in his past life?”<br/><br/>Chu Yin possessed the Heaven Yuan Spirit Treasure and was his first disciple. He held great expectations for him.<br/><br/>Zhou Xue thought for a moment and said, “I’ve never heard of it.”<br/><br/>“He possesses the Heaven Yuan Spirit Treasure.”<br/><br/>“The Heaven Yuan Spirit Treasure is impressive, but only up to the Mahayana<br/><br/>Realm. Above the Mahayana Realm is the Nirvana Realm. In the Nirvana Realm, it’s possible to reshape one’s Lifespirit Treasure, breaking through its limit and even surpassing the Heaven Yuan Spirit Treasure.”<br/><br/>This was the first time Zhou Xue had revealed information about something beyond the Heaven Yuan Spirit Treasure.<br/><br/>Fang Wang squinted and asked, “Has anyone been born with a Lifespirit Treasure that surpasses the Heaven Yuan Spirit Treasure?<br/><br/>Zhou Xue laughed and said, “Naturally, there are some, but they are very rare in the Mortal Realm. Most cultivators who surpass the Heaven Yuan Spirit<br/><br/>Treasure in the Mortal Realm do so through reshaping in the Nirvana Realm. The gap between the Nirvana Realm and the Mahayana Realm is immense. It’s a realm of transcendence. Once one steps into the Nirvana Realm, life is prolonged, and one truly embarks on the Path of Immortality.”<br/><br/>“As for the Chu Yin you mentioned, he must be your disciple, right? You needn’t worry about him. Perhaps he didn’t achieve fame in his past life because he died on the cultivation journey. Meeting you, his fate has already changed. Our very existence has altered the course of this world, resulting in those destined for great fame to die by our hands prematurely, but also those fated to die may live on and create new legends.”<br/><br/>“Do not underestimate the people of the world; perhaps there are even more formidable figures yet to emerge.”<br/><br/>As she said this, Zhou Xue’s eyes shone with a faint light when she looked at Fang Wang.<br/><br/>In this new era, the most extraordinary figure was right before her eyes.<br/><br/>Fang Wang felt there was truth in her words. The world had changed, and the past lives could only serve as references. Perhaps because of his and Zhou Xue’s arrival, the future of the world would become stronger and more intense.<br/><br/>Afterward, Fang Wang inquired about Yang Du’s past experiences.<br/><br/>Zhou Xue shared what she knew, and although Fang Wang wanted to ask about other Ascenders, Zhou Xue refused to reveal more. According to her, while she wanted to change fate, she didn’t wish to completely alter everyone else’s destiny. Certain individuals could not be preempted because, in the future, she needed these people to unlock specific opportunities.<br/><br/>The two chatted over drinks for several hours.<br/><br/>Later on, Fang Wang began to teach the Jiuyou Zizaishu. Originally, Zhou Xue had only wanted to oblige his sense of reciprocity, but she hadn’t expected the Jiuyou Zizaishu to be so extraordinary!<br/><br/>Seeing Zhou Xue moved by the technique, Fang Wang felt extremely satisfied.<br/><br/>Time flew by.<br/><br/>Two months passed.<br/><br/>One day, Zhou Xue prepared to leave.<br/><br/>“After I leave, you must practice diligently and not be lazy all day,” Zhou Xue admonished, for she had noticed that Fang Wang spent his days in leisure and did not resemble a cultivator.<br/><br/>Fang Wang replied helplessly, “I know, you’ve said it several times. I’m just relaxing for a bit.”<br/><br/>Though he hadn’t cultivated much, he was close to making a breakthrough, a detail he didn’t elaborate on.<br/><br/>Zhou Xue could sense that his body was continuously absorbing nature’s spiritual energy. She just felt he could be doing it faster.<br/><br/>Zhou Xue nodded and said, “This technique truly is exceptional. I will practice it diligently. This technique alone is enough for me to repay you for your guidance. Don’t keep it on your mind all the time.”<br/><br/>She meant these words sincerely; she did not want Fang Wang to always feel indebted to her.<br/><br/>“I understand. Take care of yourself, and if you need my help, just send someone for me,” Fang Wang responded.<br/><br/>Zhou Xue had shared her goal with him; she wanted to dominate the Southern Celestial Sea with the Jin Xiao Sect. Though the Jin Xiao Sect already had quite a few strong cultivators, Fang Wang felt it wasn’t enough. He was willing to help her achieve her goal.<br/><br/>“Hmm.”<br/><br/>Zhou Xue gave a nod, then stood up and walked out of the house. Fang Wang followed behind, watching her fly towards the sky and helping her to activate the Formation.<br/><br/>No sooner had she left, Xiao Zi found Fang Wang.<br/><br/>“Master, what have you been doing inside the house for two months?” Xiao Zi asked, with an unmistakable hint of displeasure in its tone.<br/><br/>Fang Wang looked at it and, blinking, said, “What is it to you what my wife and<br/><br/>“I… young master…”<br/><br/>Xiao Zi was frustrated but didn’t know what to say.<br/><br/>Fang Wang couldn’t be bothered with it and walked toward the lake.<br/><br/>Zhou Xue’s departure did not impact Biyou Island. Several months later, Fang Wang made a breakthrough to the third level of the Golden Body Realm.<br/><br/>Even without cultivating, he maintained the pace of his breakthroughs.<br/><br/>One day,<br/><br/>Another unusual celestial phenomenon appeared, with tumultuous thunderclouds obscuring the sun. At first glance, there was no end in sight, and the thick fog surrounding Biyou Island surged with the wind.<br/><br/>A vast Heavenly Might enveloped the entire ocean as all beings on the island looked up.<br/><br/>Fang Wang, too, opened his eyes, curiously wondering.<br/><br/>Could it be Zhou Xue again? But that couldn’t be right!<br/><br/>She had only just left…<br/><br/>Fang Wang thought silently; he was not worried. Just the Heavenly Dao True Skill alone could cause an extraordinary phenomenon between heaven and earth. Once he continued to integrate the skills, he would be able to cause even greater celestial phenomena.<br/><br/>He was not integrating them now; he was just relaxing.<br/><br/>This display of Heavenly Might lasted for half an hour, shorter than the duration caused by Zhou Xue, but the difference was not substantial.<br/><br/>The white-haired elder stared intently at him and said sternly, “The aura you just displayed was not the Heavenly Gang Saint Body.”<br/><br/>Ji Rutian landed in front of him, facing him, and smiled, “The Heavenly Gang Saint Body Technique is profound and unfathomable. To truly cultivate it, perhaps a hundred more years would still not be enough for Great Completion. I just extracted the essence of it and combined it with the cultivation technique I’m currently practicing. Although the process was difficult, I have finally succeeded.”<br/><br/>In Grand Wei, within the Zhui Tian Secret Realm.<br/><br/>Inside the ancient city, a white-haired elder looked up at a figure slowly descending from the sky, took a deep breath, and asked, “What exactly is your origin?<br/><br/>Ji Rutian, dressed in black, descended while examining his physique. He exclaimed, “The Heavenly Gang Saint Body truly is unparalleled in the world.”<br/><br/>The white-haired elder stared intently at him and said sternly, “The aura you just displayed was not the Heavenly Gang Saint Body.”<br/><br/>Ji Rutian landed in front of him, facing him, and smiled, “The Heavenly Gang Saint Body Technique is profound and unfathomable. To truly cultivate it, perhaps a hundred more years would still not be enough for Great Completion.<br/><br/>Upon hearing this, the white-haired elder’s gaze became nuanced.<br/><br/>Suddenly, Ji Rutian bowed to him and said, “Thank you for the guidance, Great Saint. I shall certainly live up to the name of the Heavenly Gang Saint Body.” Great Saint!<br/><br/>Upon hearing this, the white-haired elder’s aura transformed suddenly, a tremendously domineering pressure enveloping the ancient city, causing it to tremble.<br/><br/>The white-haired elder, who was the Descending Dragon Great Saint, stared at Ji Rutian with an indifferent expression and said, “Junior, what exactly is your origin? If you do not speak, beware lest I make it so you cannot leave.”<br/><br/>Ji Rutian remained unfazed and replied, “My Mountain River Town Heaven Fist comes from the founding ancestor of Ji Hao Sect, Zhu Changsheng.”<br/><br/>“Oh? Is Zhu Changsheng still alive?”<br/><br/>“Yes, my master is wholeheartedly pursuing The Path of Immortality; his goal is to become a Great Saint like you.”<br/><br/>Hearing that Ji Rutian was a disciple of Zhu Changsheng, the Descending Dragon Great Saint’s expression eased.<br/><br/>The Descending Dragon Great Saint said with emotion, “The times really are different. I did not expect to meet two such extraordinary talents within a hundred years.”<br/><br/>Ji Rutian asked curiously, “May I ask, senior, who the other person is?”<br/><br/>The Descending Dragon Great Saint spoke with a smile that was not quite a smile, “You are of similar age; maybe you will compete with each other in the future. I shall not mention his name.”<br/><br/>Ji Rutian narrowed his eyes and asked, “Could it be Fang Wang?”<br/><br/>“Oh? You know him?” The Descending Dragon Great Saint’s interest grew even more.<br/><br/>Ji Rutian shook his head slightly and said, “I know him, but he does not know me; his talent is truly extraordinary.”<br/><br/>The Descending Dragon Great Saint chuckled and did not continue discussing Fang Wang; instead, he said, “Junior, you are too young; you are not ready to create your own cultivation technique just yet. I have given Fang Wang a task, which is to integrate the Three Great True Cultivations. If you can do it as well, you may come to find me again. Whichever of you can integrate the Three Great True Cultivations sooner, to him I will grant even greater fortune.” Upon hearing this, Ji Rutian inquired, “May I ask, senior, is it an opportunity related to the path of a Great Saint?”<br/><br/>The Descending Dragon Great Saint glanced at him coldly and said, “Go back.”<br/><br/>Ji Rutian did not ask further and immediately bowed, then turned and left, swiftly flying out of the space.<br/><br/>The Descending Dragon Great Saint murmured to himself: “Great Saint fate, The Path of Immortality fortune, there indeed exists someone with both kinds of fate coexisting. Zhu Changsheng, you have succeeded, you truly found such a seedling. But to use such a prodigy to pass the tribulation, are you really prepared?”<br/><br/>Time flies swiftly.<br/><br/>In the blink of an eye, eight years had passed, and Fang Wang smoothly broke through to the fourth level of the Golden Body Realm without actively cultivating.<br/><br/>His mindset completely relaxed, he prepared to begin cultivating with all his might.<br/><br/>One day, Chu Yin found Fang Wang.<br/><br/>Fang Wang looked at the twelve spheres of Solaris True Fire floating behind his head, silent for a long time.<br/><br/>Chu Yin, restless, broke the silence and asked, “Master, have I practiced wronglv?”<br/><br/>He had cultivated the Solaris Scripture to the ninth level and his cultivation base had also broken through to the first level of the Profound Heart Realm on its own. Delighted, he came to visit Fang Wang, hoping to get his master’s recognition.<br/><br/>Fang Wang replied, “You haven’t practiced wrongly. It seems you are suited for Qi Gathering techniques. Here’s what we’ll do: I will pass on another cultivation technique to you, which can increase your reserves of Spiritual Power.” Chu Yin immediately expressed his gratitude to Fang Wang.<br/><br/>Fang Wang looked at him, moved.<br/><br/>What talent is this?<br/><br/>It’s ridiculously incredible!<br/><br/>Although Chu Yin’s Solaris Scripture was only at Great Completion and not on par with his own, how long had Chu Yin been cultivating?<br/><br/>Fang Wang felt challenged, but thinking of Chu Yin’s other cultivation talents, he found his balance again.<br/><br/>He then began to teach Chu Yin the Great Celestial Infinite Scripture.<br/><br/>Chu Yin’s Spiritual Power was already substantial compared to cultivators of the same realm. If he also cultivated the Great Celestial Infinite Scripture, what would become of him?<br/><br/>Thus, an hour later, Chu Yin left with grand aspirations.<br/><br/>No sooner had he gone than someone else came to visit Fang Wang.<br/><br/>Fang Hanyu!<br/><br/>He looked grim, clearly having encountered trouble.<br/><br/>Fang Wang opened the Formation, and Fang Hanyu immediately entered the island, quickly approaching Fang Wang.. Before Fang Wang could speak, Fang Hanyu said gravely, “Fang Wang, Fang Xun is dead!”\t\t\t\t\t\t</div>", "images": {}, "success": true}