{"id": 170, "url": "https://www.novelhall.com/i-became-an-immortal-on-mortal-realm-32879/14307158.html", "title": "Chapter 170 - Chapter 170: Chapter 167 Shariputra, True Man Of The Heavenly Dao_L", "volume": 2, "volume_title": "Volume 2", "body": "<h1>Chapter 170 - Chapter 170: Chapter 167 Shariputra, True Man Of The Heavenly Dao_L</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 170: Chapter 167 Shariputra, True Man of the Heavenly Dao_l<br/><br/>Translator: 549690339<br/><br/>Atop the mountain peak, Fang Wang’s Yang energy had transformed into a fireball over two hundred Zhang in diameter, its scorching light causing everything within a thousand li to be enveloped in high temperatures. Now, no more challengers dared to watch him.<br/><br/>Fang Wang opened his eyes and slowly stood up.<br/><br/>He lifted his arms, and the Yang energy violently retracted into his body, causing the entire world to darken in an instant.<br/><br/>Looking around, countless pieces of rubble and dust floated everywhere. With the disappearance of the Yang energy, all suspended objects slowly fell down, as if the earth was sinking, a sight of unparalleled grandeur. Fang Wang, feeling his Vajra Invincible Saint Body, showed a look of fascination on his face.<br/><br/>At this moment, within the Eternal Life Pavilion, all onlookers who were<br/><br/>paving attention felt the transformation of his physical prowess. Althouzh his stature seemed unchanged, his aura was entirely different.<br/><br/>“He must have obtained some kind of supremely powerful body cultivation technique. ”<br/><br/>“Indeed, this is no longer a change that could be brought about by Heavenly Materials and Earthly Treasures.”<br/><br/>“Could the Demon Venerable Qi Tian possess such unique knowledge?” “Unclear, the Demon Venerable Qi Tian is, after all, the stuff of legends.” “What do you think, could Fang Wang stand toe-to-toe with True Person Jiu<br/><br/>You?”<br/><br/>As soon as someone compared Fang Wang to True Person Jiu You, it immediately sparked controversy, and the voices of dissent became louder and spread quickly.<br/><br/>True Person Jiu You was one of the Southern Celestial Four Heroes, similarly renowned for his fire attribute.<br/><br/>Now, Fang Wang’s fire prowess was evidently strong, but when compared to True Person Jiu You, most onlookers scoffed.<br/><br/>The Southern Celestial Four Heroes didn’t get their reputation from their connections; each one fought their way up and at least dominated the maritime world for two hundred years. Fang Wang’s momentum was strong, but he was just getting started. How could he compare to the long-established True Person Jiu You?<br/><br/>Xiao Zi heard these voices and was quite dissatisfied, but it was not appropriate to argue with those people.<br/><br/>Zhu Yan remarked with feeling: “The Southern Celestial Four Heroes are indeed tough characters. Even my father gets tense facing them. They’ve transcended the definition of genius, and since five thousand years ago, the Four Heroes have been among the top existences in the Southern Celestial Sea.”<br/><br/>Zhao Zhen chuckled: “Perhaps the era of the Southern Celestial Four Heroes will end with this generation.”<br/><br/>Zhu Yan looked at him, asking what he meant.<br/><br/>Zhao Zhen’s expression was profound: “The Four Heroes sound impressive, but it also implies that the gap between them isn’t wide. They’re not unparalleled in the world.”<br/><br/>Zhu Yan was stunned for a moment, then laughed along, his eyes filled with anticipation.<br/><br/>Regardless, voices were already making comparisons between Fang Wang and True Person Jiu You. Before the trials of the Eternal Life Pavilion, Fang Wang had a renowned name but nobody dared to place him against the Southern Celestial Four Heroes.<br/><br/>Chu Yin had not uttered a word. He looked at Fang Wang with eyes full of longing.<br/><br/>In his eyes, Fang Wang was the strongest!<br/><br/>What Southern Celestial Four Heroes? None of them were worth mentioning!<br/><br/>Fang Wang soared upwards. This time, he wasn’t standing on a Flying Sword. His burning Yang energy was sufficient to free him from the pull of the earth’s gravity and it did not even consume Spiritual Power.<br/><br/>There was still some time left before the end of the trial, and he intended to relax properly. He wouldn’t seek out any more unique skills, but of course, should he come across any Heavenly Materials and Earthly Treasures, he wouldn’t pass them up.<br/><br/>Clad in black, Fang Wang strolled through the sky, his garment’s hem whipped by the swirling sands. He looked at the chaos wrought upon the world by his own actions, and he had many thoughts.<br/><br/>For the other challengers, only more than half a year had passed, but for him, it had been over five thousand years.<br/><br/>The process of cultivating the Vajra Invincible Saint Body had calmed his mind considerably, but there was still a measure of ferocity at the bottom of his heart.<br/><br/>In this way, Fang Wang roamed the Qi Tian secret realm. All treasures that caught his eye, he would snatch directly, regardless of how many people were contesting for them. He simply didn’t care and forcefully took them.<br/><br/>In just seven short days, Fang Wang had gathered more Heavenly Materials and Earthly Treasures than he had in the previous nine months. In this process, a number of people also died at his hands.<br/><br/>The vast majority of challengers sensing his aura dared not to resist.<br/><br/>Days passed by.<br/><br/>With only half a month left to the end of the Qi Tian secret realm trial, Fang Wang’s notoriety had completely spread. He became the most daunting presence of this trial, even more dangerous than True Person Jiu You.<br/><br/>True Person Jiu You was aloof; not every treasure could catch his fancy, but Fang Wang was different. He was like a madman, robbing whenever he saw a treasure.<br/><br/>More than half of the surviving challengers had encountered Fang Wang and experienced his aura, their fear of him outweighing their anger.<br/><br/>Fang Wang’s tyranny also stirred up no small amount of discussion within the Eternal Life Tower, with all onlookers noting the change in his personality. Some even wondered if he had gone mad with obsession?<br/><br/>Fortunately, Fang Wang had not gone on a mass killing spree, which eased the tension of the high-ranking members of the Eternal Life Pavilion, but disappointed various factions.<br/><br/>One day.<br/><br/>Qu Xunhun found Fang Wang, covered in blood and in extreme disarray, nothing like his former imposing self as an envoy.<br/><br/>Fang Wang watched him intently, an indifferent look in his eyes as he relayed his purpose.<br/><br/>“Sword Lord, I’ve discovered a great opportunity, it’s a Shariputra. It took me four months to obtain it, but as soon as I emerged, it was seized by a disciple of the Inner Cabinet. They’ve gone too far… If Sword Lord is interested, I can take you there. I would rather the Shariputra end up in your hands than to let them have it cheaply!” Qu Xunhun rarely displayed such indignation, he was always composed before.<br/><br/>Fang Wang arched an eyebrow and said, “Lead the way.”<br/><br/>Delighted, Qu Xunhun hurriedly thanked Fang Wang and then turned to lead the way.<br/><br/>Fang Wang kept his eyes on Qu Xunhun’s retreating figure, contemplating.<br/><br/>Who is this guy again?<br/><br/>Would asking directly be too offensive?<br/><br/>The five thousand plus years Fang Wang spent in seclusion wasn’t spent sleeping, unlike those who slept for five thousand years; he was continuously delving into cultivation. Aside from the people he cared about, many others had been forgotten.<br/><br/>But his cultivation was there, and after thinking for a while, he remembered.<br/><br/>So it was his envoy.<br/><br/>Qu Xunhun’s actions vastly satisfied Fang Wang, convincing him that he too should offer Qu Xunhun his support.<br/><br/>High in the sky, Qu Lingcang’s long hair was in disarray, half his face covered in blood, his hands gripping a halberd shaft, his whole body trembling.<br/><br/>He had been impaled through the chest by Fang Wang’s Heavenly Palace Halberd, suspended mid-air.<br/><br/>This scene plunged the Eternal Life Pavilion into momentary silence, until someone broke the quiet, and the majority of onlookers began to discuss among themselves.<br/><br/>It turned out that Qu Lingcang was a genius meticulously cultivated by the Eternal Life Pavilion, possessing a Heaven Yuan Spirit Treasure and ranking among the top five in his generation of disciples, his strength greater than that of most True Persons.<br/><br/>Such a formidable genius was defenseless in front of Fang Wang.<br/><br/>Fang Wang looked up, his eyes coldly fixed on Qu Lingcang, and demanded,<br/><br/>“Where is the Shariputra?”<br/><br/>Qu Lingcang tried to break free, but Fang Wang’s Spiritual Power was suppressing him, making it impossible to escape, which filled him with despair.<br/><br/>“You…,” Qu Lingcang gritted his teeth.<br/><br/>Fang Wang interrupted, “You have one last chance. I’ve killed enough for today, but if you try my patience, I don’t mind taking one more life.” Qu Lingcang met Fang Wang’s gaze, his heart racing.<br/><br/>In that moment, he believed Fang Wang truly dared to kill him.<br/><br/>Gnashing his teeth, Qu Lingcang raised his right hand, and two rays of light flew from his sleeve towards Fang Wang.<br/><br/>When the light faded, two wooden beads appeared before Fang Wang, each about the size of an egg.<br/><br/>Fang Wang raised an eyebrow, why were there two?<br/><br/>Hadn’t Qu Xunhun said there was only one?<br/><br/>No matter!<br/><br/>Fang Wang willed his mind, and directly stored the two Shariputras inside the Dragon Jade Ring. With a jerk of his right arm, Qu Lingcang was sent flying like a falling star, streaking across ten miles before crashing against a mountain wall, raising a cloud of dust.<br/><br/>Qu Xunhun stood dumbfounded, watching the direction in which Qu Lingcang fell, disbelieving his own eyes.<br/><br/>How mighty Qu Lingcang was, seemingly unbeatable in his eyes, yet so fragile before Fang Wang.<br/><br/>Fang Wang turned his head to look at him and said, ‘With his cultivation, he could have easily killed you. Since he spared your life, I spared his. That’s fair, don’t you think?”<br/><br/>Snapping out of his daze, Qu Xunhun hurriedly cupped his fists and said, “Sword Lord speaks the truth, thank you for taking my side.”<br/><br/>“Hmm, let’s go then.”<br/><br/>Fang Wang turned and flew in a certain direction.<br/><br/>Qu Xunhun hesitated for a moment, then decided to follow Fang Wang.<br/><br/>“Sword Lord, after this trial ends, you can ascend to the rank of a True Person. Do you plan to inherit the name of Jiu You True Person, or will you choose a new True Person’s command and take a new name?” Qu Xunhun asked respectfully.<br/><br/>Fang Wang casually asked, “Is it troublesome to change the command?”<br/><br/>“Not at all, it only takes half a day. I can take you there when the time comes.”<br/><br/>“Then let’s go for a new one. Jiu You doesn’t suit me.” “What name does the Sword Lord wish to take?”<br/><br/>“Let’s go with Heavenly Dao.” “Heavenly Dao True Person?”<br/><br/>“Hmm.”<br/><br/>Qu Xunhun inwardly marveled, what an audacious name for a True Person.<br/><br/>The figures of the two rapidly vanished into the horizon.<br/><br/>As the dust settled, Qu Lingcang’s figure became visible. His white robes were shredded into strips of cloth, his body embedded into the mountain, with the surrounding walls full of cracks.<br/><br/>His chest continued to bleed profusely, a tragic sight, yet since his chest still rose and fell, it was evident that he was not dead.<br/><br/>Qu Lingcang, his hair disheveled, struggled to lift his head. His eyes, red with blood, looked in the direction where Fang Wang had gone. He twisted his mouth into a smile, murmuring to himself, “So strong… Another monster is born…”<br/><br/>He began to laugh, bitter though it was, bearing no resentment.<br/><br/>The gap in strength was too great, and his defeat was utterly convincing.<br/><br/>Fang Wang having spared his life, he felt fortunate; had it been someone else, he might not have survived.<br/><br/>This was a trial, after all. Even if Fang Wang had executed him, a member of the Inner Cabinet, the Eternal Life Pavilion would not have taken issue, and might even seek to recruit Fang Wang to display their magnanimity.<br/><br/>Qu Lingcang took a deep breath, preparing to climb up, when suddenly, a mocking laugh rang out:<br/><br/>“Yo, isn’t this our Brother Qu? How come you’re in such a sorry state after just a few months?”<br/><br/>Yang Du now hovered in front of him, looking down with condescension.<br/><br/>Qu Lingcang’s pupils dilated in alarm, and he said through gritted teeth, “Fang Wang is indeed strong. If you were to face him, you wouldn’t fare any better than I did.”<br/><br/>“How laughable. I am indestructible. While you’re lying here, I would have already fully healed. You really are pathetic,” Yang Du sneered.<br/><br/>Qu Lingcang replied coldly, “Yang Du, what do you want?”<br/><br/>Yang Du curled his lips into a cruel smile and said coldly, “You and your lackeys sealed me together; did you forget? I, Yang Du, am long on memory.” Qu Lingcang slowly lowered his head, as if resigning to fate.<br/><br/>Yang Du raised his hand towards his head, and just as he was about to touch him, Qu Lingcang’s voice rose:<br/><br/>“You think you can take advantage of my defeat to Fang Wang? You are underestimating my Middle-grade Heavenly Origin Precious Spirit!”\t\t\t\t\t\t</div>", "images": {}, "success": true}