{"id": 179, "url": "https://www.novelhall.com/i-became-an-immortal-on-mortal-realm-32879/14310025.html", "title": "Chapter 179 - Chapter 179: Chapter 176: The Great Divine Dynasty,", "volume": 2, "volume_title": "Volume 2", "body": "<h1>Chapter 179 - Chapter 179: Chapter 176: The Great Divine Dynasty,</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 179: Chapter 176: The Great Divine Dynasty,<br/><br/>Natural Justice_l<br/><br/>Translator: 549690339<br/><br/>Hearing Fang Wang’s words, the faces of the four Nirvana Realm Great Cultivators guarding Emperor Chongyuan turned ugly in an instant, and they immediately ran their spiritual power, unleashing all their strength. Fang Wang’s eyes narrowed as he fiercely thrust his right arm downward.<br/><br/>Boom!<br/><br/>Dust and shockwaves swept up chaotically as the four Great Cultivators quickly flew out of the rolling dust clouds. They landed on the ruins, sliding back several dozen feet, their arms that had just contended with Fang Wang trembling, and their faces extremely pale.<br/><br/>What kind of power was this?<br/><br/>This was the first time they had encountered such formidable power, and even the strongest demons they had previously faced did not possess such terrifying strength.<br/><br/>They looked intently and saw that within the swirling dust, Fang Wang’s imposing aura dispersed the dust clouds as he held up Emperor Chongyuan with one hand.<br/><br/>At that moment, Emperor Chongyuan was covered in blood, not because Fang Wang was lifting him, but because Fang Wang’s right fist had pierced through his chest, lifting him into the air.<br/><br/>“Was it you who sent someone to kill my brother?”<br/><br/>Fang Wang asked coldly, his gaze sharp as a knife, piercing through Emperor Chongyuan’s heart and plunging the monarch of Xuan Dynasty into despair.<br/><br/>Emperor Chongyuan dared not shout any longer, his voice trembling as he said, “l was also forced… Xiu Yang had been favored by the Second Prince of the Great Divine Dynasty since she was young. Xuan Dynasty is weaker than the Great Divine Dynasty, and we had to form a marriage alliance. Xiu Yang ran away and even married another man and had a child. The Second Prince of the Great Divine Dynasty flew into a rage, pressuring me for an explanation, and I had no choice but to…”<br/><br/>The Great Divine Dynasty?<br/><br/>Fang Wang had not heard of it before, but he silently noted this matter.<br/><br/>He only half-believed Emperor Chongyuan’s words. The Emperor’s previous demeanour was still fresh in his mind, insulting the deceased Fang Xun, claiming he wanted to kill him, believing Fang Xun was unworthy of his daughter. It seemed likely that there was pressure from the Great Divine Dynasty, but it was also possible Emperor Chongyuan himself had intended to kill Fang Xun.<br/><br/>Fang Wang had no interest in considering the matter from Emperor Chongyuan’s perspective. Killing someone warranted death in return, a principle as clear as heaven and earth!<br/><br/>“Do you dare to bear this hatred? If you dare, I’ll only kill you and not harm a single citizen of your lands. But if you do not, don’t blame me for not being able to restrain my killing intent,” Fang Wang asked coldly.<br/><br/>At these words, Emperor Chongyuan became utterly panic-stricken, shouting frantically, “You can’t kill me… You cannot kill me… If you dare kill me, you and Fang Jing, that monstrous child, will not live either…”<br/><br/>Boom!<br/><br/>Fang Wang’s right fist burst forth with terrifying spiritual power, directly shattering Emperor Chongyuan’s physical body, turning it into a mist of blood.<br/><br/>“You…”<br/><br/>This scene completely enraged the four Nirvana Realm Great Cultivators, who had thus far not dared to act rashly. They each took out their Lifespirit Treasures, their auras exploding as they took to the sky, their presence causing the entire ruins of the Imperial Palace to tremble.<br/><br/>Simultaneously, a powerful presence from Green Mountain descended from the heavens, piercing through the thunderclouds and allowing sunlight to shower down, illuminating Fang Wang.<br/><br/>In the sunlight, Fang Wang was the only bright entity between heaven and earth, while everything else plunged into darkness. The Formation’s light barrier outside the Imperial Palace began to dissolve as cultivators flew in one by one, each radiating a terrifying intent to kill.<br/><br/>The murder of the Emperor was the greatest shame for his subjects!<br/><br/>At this moment, they no longer cared for the protection of the citizens; they must execute Fang Wang!<br/><br/>Green Mountain, his hair disheveled, looked down at Fang Wang, his eyes emitting a chilling murderous intent. Above him stood a golden bell, its surface teeming with countless beasts and spirits striving to break free.<br/><br/>“Good! Fang Wang, you have taken everything to the extreme. Today, we must all exert our fullest effort to execute you, not just killing you, but slaughtering all of your clan to demonstrate the might of the Xuan Dynasty!”<br/><br/>The voice of Green Mountain resounded throughout heaven and earth, making everyone feel as if they were trapped in a chilling cellar.<br/><br/>The other four Nirvana Realm Great Cultivators again surrounded Fang Wang, and behind them was a vast array of cultivators, all conjuring their Lifespirit Treasures or holding Magic Artifacts. Looking around, their numbers grew ever more, like a tide surging toward the Imperial Palace.<br/><br/>Hearing Green Mountain’s words, Fang Wang was undisturbed. He gently patted Fang Jing’s back, comforting him, “Don’t be afraid. Your uncle will take you out of here. But before we leave, your uncle has to avenge your parents.”<br/><br/>Upon hearing this, Fang Jing stopped trembling. He raised his head and stretched out his hand to tidy Fang Wang’s slightly disheveled hair.<br/><br/>Fang Wang gave him a smile, a stark contrast to the killing god he had been moments before. Fang Jing didn’t say a word but simply lowered his head again, clinging tightly to Fang Wang.<br/><br/>“Master, why don’t you use your sword?” Xiao Zi asked excitedly.<br/><br/>The more enemies there were, the more excited it became, devoid of fear.<br/><br/>This situation reminded it of the battles in Green Cicada Valley and against the Chi Devil Sect. It had been a long time since it fought side by side with its master.<br/><br/>“I don’t need a sword to kill them.”<br/><br/>After saying this, Fang Wang soared into the air, the air around him blazing fiercely as flames of yang energy continuously emerged and expanded. The white flames of the Heavenly Dao True Skill interwoven as his aura kept rising, creating visible shockwaves rippling outward with each increase in his power.<br/><br/>At this moment, Fang Wang no longer concealed his strength.<br/><br/>He entirely unleashed the full yang energy of his Vajra Invincible Saint Body, quickly reaching peak condition!<br/><br/>His yang energy formed a shining entity, even more radiant than the blazing sun, causing all cultivators who saw him to be moved. ‘What is this cultivation technique?” “No, it’s his vital energy, the power of his physical body!”<br/><br/>“Hiss— What kind of constitution is this?”<br/><br/>“Could it be an ancient sacred body? Where on earth did this guy come from?”<br/><br/>The cultivators discussed among themselves, Green Mountain, and the four Nirvana Realm Great Cultivators were equally shocked, and even Xiao Zi, who was closest to Fang Wang, couldn’t help but gape in awe.<br/><br/>What is this aura?<br/><br/>Xiao Zi could confirm it was definitely not the Heavenly Body!<br/><br/>Could it be that the young master has cultivated another, stronger physique?<br/><br/>Real Person Qingshan’s face was overcast as he stared intently at Fang Wang and asked in a deep voice, “Just who exactly are you, and what physique do you possess?”<br/><br/>Fang Wang continued to rise higher, even surpassing Real Person Qingshan. When he arrived below the sea of clouds, he appeared like the proud sun above the human world. The common people and cultivators within the Imperial City who were still fleeing all turned their heads to look at him, their eyes filled with awe and fear.<br/><br/>“I have already told you my name, and as for my physique, remember, I am of the Vajra Invincible Saint Body. It is an honor for you all to witness the divine might of the Vajra Invincible before your deaths!”<br/><br/>Fang Wang’s indifferent voice rang out as he completely released his yang energy, piercing through the clouds above and causing the stones below to shake and fly upward.<br/><br/>The Vajra Invincible Saint Body!<br/><br/>Millions of Xuan Dynasty common folk and cultivators were all shaken by this name.<br/><br/>Enraged, Real Person Qingshan suddenly waved his horsetail whisk, and the golden bell above his head followed, crashing towards Fang Wang. In mid-flight, it rapidly enlarged, the bell becoming a thousand feet tall, resembling a giant mountain of the mortal world, magnificent and unstoppable.<br/><br/>Fang Wang raised his right fist, and the terrifying might of the Mountain River Town Heaven Fist erupted, causing the lands within ten thousand miles to tremble.<br/><br/>He punched towards the golden bell, using the Nine Dragons Tyrant Fist!<br/><br/>Roar—<br/><br/>The dragon’s roar exploded as a majestic and domineering Black Dragon shot out following his right fist, shattering the golden bell with an extremely overbearing stance.<br/><br/>At the same time, four Nirvana Realm Great Cultivators simultaneously activated their cultivation techniques, their Spiritual Power bursting forth, a myriad of light filled the heavens and earth, enveloping the entire Imperial City.<br/><br/>An unprecedented great battle broke out completely!<br/><br/>Beneath the cloudless skies, the mountain ranges undulated.<br/><br/>Atop the peaks of these mountains, forests were interspersed with flags under the shade of trees, at first glance, ripples could faintly be seen in this expanse of the firmament.<br/><br/>In the wilderness, countless cultivators sat meditating, thousands in number. Ye Canghai, who had once strayed into Biyou Island, was also here.<br/><br/>They all sat in meditation around a mysterious woman in red, who donned a blood-red mask revealing only her eyes, and was enveloped in a chilling demonic aura that warned others not to approach.<br/><br/>Jin Xiao Sect, Demon Monarch!<br/><br/>Suddenly, a cultivator descended from the sky, landing in front of the Demon Monarch, stopping two yards away as he half-knelt on the ground, holding a token in his hand, and spoke in a grave voice, “Reporting to the Sect Hierarch, news from our spy has come in, Tian Dao Fang Wang is causing havoc in the Imperial City, Xuan Dynasty’s Emperor has been killed by Fang Wang!”<br/><br/>Upon hearing this, all Jin Xiao Sect Cultivators opened their eyes, including the Demon Monarch.<br/><br/>Underneath the Demon Monarch’s mask, her eyes were a pair of golden blood pupils, sharp and terrifying, emanating an ineffable sense of oppression. “Tian Dao Fang Wang? How did he get here?”<br/><br/>“He must be avenging his brother, Fang Xun. He can even kill the Xuan Dynasty Emperor—what level has his cultivation reached?”<br/><br/>“Good, he’s finally made his move. After all, this matter began because of his brother. It can’t always be us from the Jin Xiao Sect making all the effort, right?”<br/><br/>“Haha, Emperor Chongyuan is dead? Excellent, damn it, that arrogant emperor actually claimed he would annihilate our Jin Xiao Sect, totally overestimating himself! ”<br/><br/>“Sect Hierarch, shall we make a move? To support Fang Wang!”<br/><br/>All cultivators were excited. Those who had come here were at least of the Cross-Void Realm, belonging to the elite forces of the Jin Xiao Sect. They feared not the Xuan Dynasty because they had clashed multiple times, growing even more hateful of the Xuan Dynasty and wishing for its downfall.<br/><br/>The Demon Monarch slowly stood up and, standing tall, said, “Let’s go. But we do not need to support Fang Wang. Instead, we shall clear his path of escape.” Her tone was indifferent, betraying no emotion.<br/><br/>As her words fell, she transformed into a mass of demonic energy and dissipated on the spot, with other Jin Xiao Sect Cultivators rising up in flight, beginning to act.<br/><br/>As Ye Canghai flew, he looked towards the direction of the Xuan Dynasty’s Imperial City, his heart secretly astounded, “Fang Wang, just how powerful are you… to dare rush into the Xuan Dynasty alone…”<br/><br/>He knew that the Xuan Dynasty had Nirvana Realm Great Cultivators, and not just one!<br/><br/>But the thought of Fang Wang’s bearing filled him with confidence in Fang Wang.<br/><br/>How could such a man of spirit fall at the Xuan Dynasty?<br/><br/>Thunderclouds roiled violently, with flashes of lightning and roars of thunder. Cultivators and Magic Artifacts crisscrossed the sky while various Spells constantly emerged. The once prosperous Imperial City had now been completely turned into ruins.<br/><br/>Looking around, bloodstains were seen atop the broken walls and ruins!<br/><br/>A large number of cultivators lay in the ruins, their gazes fixed on a dazzling figure, who was Fang Wang.<br/><br/>Fang Wang’s eyes were bloodshot as he chased after Real Person Qingshan. At this moment, Real Person Qingshan was covered in wounds, in extreme disarray, his horsetail whisk nowhere to be found.<br/><br/>Faced with the relentless pursuit of Fang Wang, Real Person Qingshan kept casting spells. His spells were mighty and far stronger than the other cultivators, but upon landing on Fang Wang, they were directly scattered by the yang energy of the Vajra Invincible Saint Body, causing no harm whatsoever.<br/><br/>At this moment, horror was visible in Real Person Qingshan’s eyes..\t\t\t\t\t\t</div>", "images": {}, "success": true}