{"id": 182, "url": "https://www.novelhall.com/i-became-an-immortal-on-mortal-realm-32879/14312529.html", "title": "Chapter 182 - Chapter 182: Chapter 179: Fame Shakes The Emperor Sea, The Three Immortals Of The Emperor Sea", "volume": 2, "volume_title": "Volume 2", "body": "<h1>Chapter 182 - Chapter 182: Chapter 179: Fame Shakes The Emperor Sea, The Three Immortals Of The Emperor Sea</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 182: Chapter 179: Fame Shakes the Emperor Sea, The Three Immortals of the Emperor Sea<br/><br/>Translator: 549690339<br/><br/>Another slant of sun set.<br/><br/>The ocean was shimmering with waves, and on an island, Fang Wang lay on the rocks, his mask over his face, seemingly asleep.<br/><br/>Fang Jing sat by the fire, with Xiao Zi beside him, flicking her tongue out while eyeing two fish roasting on the fire, while Zhao Zhen squatted nearby, examining a pile of storage bags—these were all of the relatively lower grade.<br/><br/>The storage bags and storage rings from the Golden Body Realm, the Mahayana Realm, and the Nirvana Realm were all on Fang Wang’s person, to avoid any traps that could potentially scare the soul out of Zhao Zhen in fright.<br/><br/>Fang Jing turned his head to look at Fang Wang, his eyes filled with worry, and he asked in a low voice, “Could Uncle have been injured?”<br/><br/>Though he was young, his experiences far surpassed those of his peers, and with his uncle having fought for so long, he worried that Uncle was not as relaxed as he appeared on the surface.<br/><br/>Xiao Zi fixed her gaze on the roasted fish and said, “How could he be injured?<br/><br/>I’ve never seen your uncle get hurt.”<br/><br/>Upon hearing this, Fang Jing’s eyes widened, and he quickly asked, “Why is<br/><br/>Uncle so formidable?”<br/><br/>He had seen his parents’ manner of fighting, which simply could not compare to that of his uncle.<br/><br/>“That’s because your uncle is the most talented person in the world, the reincarnation of an Immortal. When you grow up and look back on this period of battle, you will realize just how unbelievably powerful your uncle is,” Xiao Zi chuckled with a tone full of admiration.<br/><br/>Upon hearing this, Fang Jing couldn’t help but look towards Fang Wang again, his eyes filled with longing.<br/><br/>He too wanted to become as powerful as his uncle.<br/><br/>Fang Wang appeared to be asleep, but in reality, he was reviewing the previous battles.<br/><br/>This was the first time he had fought for such an extended period, and fighting with all his might was something he hadn’t experienced in tens of thousands of years, so he was still feeling an emotional surge, needing to sort out his thoughts and summarize the experience.<br/><br/>Besides meditating, combat was another way to grow stronger in cultivation. Through this great battle, Fang Wang distinctly felt he had become stronger.<br/><br/>This made him look forward to the upcoming challenges.<br/><br/>He was planning to challenge the strongest among the various Grand Qi sects to establish his fame.<br/><br/>His battle with the Xuan Dynasty would surely shake the Emperor Sea, but it was not enough, as the impact of rumors paled compared to the deterrence brought about by witnessing something firsthand.<br/><br/>A night passed.<br/><br/>The next day at noon, just after Fang Jing had finished eating the fish cooked by Xiao Zi, Fang Wang called him over.<br/><br/>He stood obediently in front of Fang Wang, clueless as to why his uncle had summoned him.<br/><br/>Fang Wang dusted the sand off his head and asked, “Do you want to cultivate?”<br/><br/>Upon hearing this, Fang Jing’s eyes instantly lit up, and he nodded vigorously like a pecking chicken, saying, “Uncle, teach me, I want to be as strong as you.”<br/><br/>Fang Wang smiled and said, “You have the power your father left inside you. You’ll have to work hard in the future and not let him down.”<br/><br/>It was that power Fang Xun had left that had allowed Fang Jing to break free from the restraints of that brocaded man in the Imperial City, a magical power indeed.<br/><br/>This power was obtained by Fang Xun with the guidance of Zhou Xue, merging the Five Elements Dao Stone, defying fate.<br/><br/>He wanted to see how strong this fate-defying inheritance would be in Fang Jing.<br/><br/>As soon as Fang Wang mentioned his father, the smile on Fang Jing’s face disappeared, and he suddenly felt sad.<br/><br/>Seeing him upset, Fang Wang felt troubled too, and immediately said, “I will teach you the Heavenly Dao True Skill. It is the most difficult cultivation technique in the world; are you brave enough to learn it? If not, I can pass down another technique to you.”<br/><br/>Fang Jing looked up earnestly and said, “I want to learn, I dare to learn!” Fang Wang then began to impart the Heavenly Dao True Skill.<br/><br/>The Heavenly Dao True Skill was a fusion of the Three Great True Cultivations, extremely challenging, yet reaching minor completion would allow one to dominate a region!<br/><br/>To achieve the Great Perfection like Fang Wang was to have the qualifications to be invincible in the world!<br/><br/>Fang Jing listened intently, not wanting to disappoint Fang Wang.<br/><br/>However, after Fang Wang finished explaining once, Fang Jing frowned with a perplexed look, visibly annoyed.<br/><br/>Fang Wang wasn’t in a rush. He told him to meditate, then placed his right hand on his shoulder, guiding his cultivation with his own Spiritual Power.<br/><br/>Within a vast, empty chamber, the cultivators of the Eternal Life Pavilion meditated around a transmission formation; Dugu Wenhun was still there.<br/><br/>A cultivator in green clothes hastily entered, rushing to the formation, then bowed to the surrounding cultivators, saying, “Seniors, please activate the formation; I have important intelligence to bring back to the Eternal Life Pavilion.”<br/><br/>Upon hearing this, several cultivators opened their eyes, one of them asked, “Is it confidential?”<br/><br/>The green-clad cultivator shook his head, “Not confidential, the whole Emperor Sea is abuzz with the news.”<br/><br/>“Oh? What has happened?”<br/><br/>“Someone has invaded the Xuan Dynasty, named Fang Wang, claiming to be Tian Dao.”<br/><br/>As soon as these words were uttered, everyone in the chamber opened their eyes; they had odd expressions as they remembered seeing Fang Wang leave from this very place. How long had it been?<br/><br/>Fang Wang had actually stormed straight into the Xuan Dynasty!<br/><br/>“What’s his status now?” another cultivator asked.<br/><br/>The green-clad cultivator took a deep breath, his face full of reverence, and said, “He descended upon the Xuan Dynasty Imperial City alone, executed Emperor Chongyuan, and later faced the siege of millions of cultivators from the Xuan Dynasty’s Cultivation World. He killed over two million enemies, causing the Xuan Dynasty cultivators to bow their heads before he finally left with an air of superiority. Now, no one knows his whereabouts.”<br/><br/>Silence!<br/><br/>The chamber fell into stillness, and Dugu Wenhun’s expression also froze. A burly cultivator hurriedly asked, “Is that true?”<br/><br/>Upon hearing this, the cultivator in green became anxious and said, “It’s true. As Emperor Chongyuan has perished, the Ancestral Emperor has issued a decree proclaiming to all the kin of the sects that whoever kills Tian Dao Fang Wang will become the next emperor of the Emperor Sea Mysterious Dynasty!”<br/><br/>He then excitedly asked, “I’ve heard the name Tian Dao Fang Wang before from my fellow sect members. Is he really from the Eternal Life Pavilion?” At his words, the cultivators looked at one another in surprise.<br/><br/>Dugu Wenhun suddenly rose to his feet, transforming into a gust of wind that whistled away, while the other cultivators remained in shock. They started to press the cultivator in green for more intelligence details, and he recounted all that he had discovered.<br/><br/>The Thirteen Protecting Dynastic Sects, utterly defeated!<br/><br/>The renowned Pillar of the Xuan Dynasty across the ages, the Real Person of Green Mountain, has fallen!<br/><br/>The Four Great Cultivators of the Nirvana Realm of the Xuan Dynasty, slaughtered by Fang Wang, body and soul annihilated!<br/><br/>Wait a minute!<br/><br/>One by one, the formidable names that shook Emperor Sea became the bones beneath Fang Wang’s feet, and the Great Cultivators of the Eternal Life Pavilion listened with ever-growing horror.<br/><br/>High above the Canghai, the hundred-zhang-long Xiao Zi, like a Purple<br/><br/>Dragon cruising through the sky, tore the sea of clouds into flowing wisps.<br/><br/>Fang Wang and Fang Jing sat meditating on the serpent’s head; the young Fang Jing had already started his cultivation. Under Fang Wang’s guidance for half a month, he had begun to master the foundational incantations of the Heavenly Dao True Skill.<br/><br/>The Heavenly Dao True Skill had its own techniques for Qi Gathering and could also form Heavenly Spiritual Power, but its primary focus was tempering the body, aiming to cultivate the Heavenly Body.<br/><br/>As Fang Jing began his cultivation, Fang Wang could feel the mysterious power within his body transforming his physical form, making his innate talent grow stronger and stronger.<br/><br/>However, the current Fang Jing had not yet reached the pinnacle of innate talent, far from comparable to Zhu Yan or Chu Yin, but was equivalent to Xu Qiuming from Grand Qi.<br/><br/>As he grew older, his talent would reach another height, and Fang Wang looked forward to that day.<br/><br/>“Young Master, there’s a large presence of cultivators ahead, apparently a sect.<br/><br/>Shall we go there?”<br/><br/>Xiao Zi asked, its tone full of anticipation.<br/><br/>It became excited knowing what Fang Wang intended to do.<br/><br/>Fang Wang opened his eyes and said softly, “Although the strongest is only in the Golden Body Realm, let’s go. Consider it the first battle.”<br/><br/>Upon hearing this, Xiao Zi immediately accelerated, stirring the sea of clouds and causing Fang Jing to yell out in shock.<br/><br/>Below the firmament, Xiao Zi, floating in the air, quivered with excitement. Fang Jing stood on its head, his mouth agape in awe, while Zhao Zhen, floating beside him, wore a look that said “I knew it.”<br/><br/>Below them was a cluster of islands teeming with cultivators, some in the air, others on the islands, with an even more impressive group of cultivators forming a formation at the horizon. All of them gaped in the same direction.<br/><br/>There, Fang Wang stood in mid-air with a man, his white robe billowing intensely. He pressed one hand on the man’s shoulder, forcing him to kneel in mid-air. Upon closer inspection, the man’s knees were bleeding.<br/><br/>“How is this possible…”<br/><br/>Lin Cheng knelt before Fang Wang, trembling, his forehead covered in beads of cold sweat.<br/><br/>He had the cultivation of the fifth layer of the Golden Body Realm, considered among the top in this sea region. Even if placed in any sea region of Emperor Sea, he could walk dominantly as there were few old monsters from the Mahayana Realm who showed themselves.<br/><br/>Yet, such a powerful figure had no power to resist Fang Wang. Without even using a single spell, Fang Wang forced him to kneel, immobilized.<br/><br/>The islands below were the main islands of the Sea Cloud Sect, and the tens of tnousanas or disciples remammg on me Islana couldn’t Deneve cnelr eyes. Their Sect Master, who they almost considered invincible, was being pinned down by a mysterious person without the ability to move.<br/><br/>It was like a mortal being touched by an Immortal, and this mortal was their respected Sect Master, the very person they aspired to become.<br/><br/>“Who exactly are you…”<br/><br/>Lin Cheng raised his head, struggling to speak as he wished to maintain his authority before his disciples, but fear enveloped his heart, sensing the breath of death.<br/><br/>Fang Wang looked down at him and said calmly, “I am called Fang Wang, and you may address me as Tian Dao. I come from beyond the Xuan Sea. The Emperor of your Xuan Dynasty ordered the murder of my brother, so I crossed the sea and killed him. But I feel it is not enough. I must defeat the entire Emperor Sea, and you are just the beginning.”<br/><br/>His voice was calm and light, but it clearly reached the ears of all the disciples of the Sea Cloud Sect.<br/><br/>Tian Dao Fang Wang!<br/><br/>Everyone remembered this name and instantly felt fear.<br/><br/>To call oneself Tian Dao, how arrogant…<br/><br/>But the fearsome strength that Fang Wang showed left them unable to doubt or disdain him.<br/><br/>Fang Wang released his right hand and then turned and left.<br/><br/>Lin Cheng stood up, trembling. He stared at Fang Wang’s retreating figure, hesitating whether to take action, but in the end, he gave up.<br/><br/>However, being humiliated in full view of everyone was hard to bear.<br/><br/>He clenched his teeth and shouted, “Defeating me is nothing. If you can defeat The Three Immortals of the Emperor Sea, only then can you truly claim to have defeated the entire Emperor Sea!”<br/><br/>Fang Wang stopped, glanced over sideways, and gave Lin Cheng a look that inadvertently made him step back.<br/><br/>“Since that’s the case, then you can spread the word for me. Tian Dao Fang Wang is always ready to welcome the challenge from The Three Immortals of the Emperor Sea.”<br/><br/>After speaking, Fang Wang leaped up and landed on Xiao Zits head. Xiao Zi twisted its huge serpentine body and quickly flew towards the horizon.<br/><br/>From start to finish, the cultivators of the Sea Cloud Sect dared not make a move, nor did they dare to obstruct.<br/><br/>Watching Fang Wang’s retreating figure, they all realized something.<br/><br/>The tides of the Emperor Sea were about to change!\t\t\t\t\t\t</div>", "images": {}, "success": true}