{"id": 185, "url": "https://www.novelhall.com/i-became-an-immortal-on-mortal-realm-32879/14313152.html", "title": "Chapter 185 - Chapter 185: Chapter 182: The True Age Of Fang Wang, The Ninth Arrival 1", "volume": 2, "volume_title": "Volume 2", "body": "<h1>Chapter 185 - Chapter 185: Chapter 182: The True Age Of Fang Wang, The Ninth Arrival 1</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 185: Chapter 182: The True Age of Fang Wang, The Ninth Arrival 1<br/><br/>Translator: 549690339<br/><br/>Lü Xianming opened the conversation and began to voice his hardships, growing more and more despondent as he spoke. The green-robed Taoist did not interrupt him, listening quietly.<br/><br/>After a long while,<br/><br/>Lü Xianming sighed and said, “Taoist priest, what do you think I should pursue in life?”<br/><br/>Since childhood, he had been competitive and felt that life had lost its direction and meaning because he couldn’t be the best in the world.<br/><br/>The green-robed Taoist chuckled and said, “Those who come to my Heart-Enlightening Pavilion and sit in meditation for a while all ask similar questions; I can’t give an answer.”<br/><br/>Lü Xianming looked up at him, let out a sigh, and then, looking at the stone statue in front of him, he asked, “Taoist priest, what is the origin of this statue?”<br/><br/>The green-robed Taoist stroked his beard and answered, “He is the Hongxuan Emperor.”<br/><br/>The Hongxuan Emperor!<br/><br/>Lü Xianming’s expression grew subtle; the name was well-known in the Emperor Sea, and of course, he had heard of it.<br/><br/>“I remember the Hongxuan Emperor didn’t look like this; wasn’t he depicted with three heads and six arms?” Lü Xianming asked curiously.<br/><br/>The green-robed Taoist answered with a smile, “The Hongxuan Emperor has a thousand Dharma forms, representing the myriad faces of the people. Do you know the story behind this particular representation of the Hongxuan Emperor?”<br/><br/>Lü Xianming stared at the stone statue of the Hongxuan Emperor, finding it very ordinary and seeing nothing extraordinary about it.<br/><br/>The green-robed Taoist continued, “This Hongxuan Emperor was born with supernatural phenomena accompanying his arrival. His birth brought seven days and nights of torrential rains to his continent, with disasters occurring everywhere. Thus, he was deemed an ill omen star and suffered the exclusion and fear of his tribesmen from an early age… until his talents unfolded…”<br/><br/>Lü Xianming was captivated by the story and turned his head to look at him.<br/><br/>“From the moment the Hongxuan Emperor began his cultivation, for the first three hundred years, he was unrivaled in the world. Like you, he could even fight across two major realms, until later on, when he met another genius of the era who was a hundred years older than him. That person defeated him with an overwhelming stance, turning him into a laughingstock.”<br/><br/>“After wallowing in defeat for several years, the Hongxuan Emperor dedicated himself to cultivation, secluded himself for enlightenment, and after two hundred years, he created the Heavenly Emperor Imperial Mirror, astonishing the heavens and earth, moving ghosts and gods to tears. Regrettably, when he sought to find his fated enemy for revenge, that person had already perished, becoming the greatest regret of the Hongxuan Emperor.”<br/><br/>The words of the green-robed Taoist made Lü Xianming frown.<br/><br/>The green-robed Taoist spoke with profound meaning, “Since ancient times, there have been many eternal champions whose fame never fades. Not everyone is invincible throughout their life. The Descending Dragon Great Saint was also defeated by the Heavenly Body, and like the Hongxuan Emperor, he found his opponent gone when he sought revenge. The adversaries you face now seem invincible, but can you be sure that when you reach the pinnacle of the human world, they will still exist?”<br/><br/>Lü Xianming was moved.<br/><br/>“A person’s life is long, and the road to cultivation is endless. Everyone has their own tribulations, yet all tribulations are insignificant in the face of time.<br/><br/>Once vou overcome them and look back, the obstacles that seem insurmountable now will only make you smile,” the green-robed Taoist said solemnly.<br/><br/>Finally, a spark of spirit appeared in Lü Xianming’s eyes. He stood up and bowed to the green-robed Taoist.<br/><br/>“Thank you for your guidance, Spring-Autumn Taoist. Although I still can’t let go, at least I have a glimmer of hope,” Lü Xianming said with a forced smile.<br/><br/>Suddenly, the Spring-Autumn Taoist laughed and said, “Since that is the case, I have an opportunity here, if you dare to take it.”<br/><br/>“What opportunity?”<br/><br/>“The Hongxuan Emperor’s legacy opportunity.”<br/><br/>“Hmm?”<br/><br/>The fog pervaded, and the sea was dark and gloomy, oppressive and thrilling.<br/><br/>Fang Jing was peeking around with his little head, while Fang Wang sat by his side, quietly looking ahead.<br/><br/>Having flown for half a month following Dugu Wenhun, they had encountered some troubles along the way, all of which were resolved by Dugu Wenhun.<br/><br/>Dugu Wenhun, possessing the cultivation of the Ninth Layer of the Mahayana Realm, emitted a much stronger aura in battle than usual, earning Fang Wang’s respect.<br/><br/>Although Dugu Wenhun was powerful, in terms of talent, he might not be comparable to Yang Du or Chu Yin; he was nearly five hundred years old, over three hundred years older than Fang Wang.<br/><br/>“We’ll reach the Emperor’s Tomb Island after passing through this area, at most two hours,” Dugu Wenhun’s voice came from beside him.<br/><br/>Fang Wang glanced at him and asked, “You seem very familiar with this place.”<br/><br/>Dugu Wenhun answered with a smile, “I won’t lie to you, I’ve been here two hundred years ago, and the Three Immortals of the Emperor Sea beat me so hard I couldn’t find my way.”<br/><br/>Xiao Zi expressed confusion, “Why did the Three Immortals of the Emperor Sea spare your life?”<br/><br/>“It was merely a normal competition for opportunities. The Three Immortals of the Emperor Sea are called immortals not only for their profound cultivation but also because they truly have the disposition of immortals. This is also why, when the Xuan Dynasty was in turmoil, they did not intervene, for they have lived even longer than the dynasty and do not recognize it,” Dugu Wenhun replied.<br/><br/>Hearing this, Xiao Zi grew more curious and continued to inquire about the deeds of the Three Immortals of the Emperor Sea.<br/><br/>They moved on.<br/><br/>Fang Wang noted that there were innate prohibitions along the way that could easily lead to getting lost. Dugu Wenhun led them through the only way out.<br/><br/>Two hours later.<br/><br/>Fang Wang finally caught sight of the Emperor’s Tomb Island.<br/><br/>In the midst of the dense fog, the Emperor’s Tomb Island appeared like a giant hand, with four mountain peaks standing side by side on the island.<br/><br/>Upon entering the island, Fang Wang landed with Fang Jing, Xiao Zi shrank and perched on his shoulder, and Dugu Wenhun walked ahead, continuing to lead the way.<br/><br/>Having arrived at the Emperor’s Tomb Island, Dugu Wenhun no longer spoke, and the journey thereafter was silent.<br/><br/>After passing through a rainforest, they came to a valley nestled between two peaks, with wild grass rampant inside. The valley was frightfully sinister, due to the dense clouds overhead, and as the cold wind blew, the vegetation swayed like waves.<br/><br/>Fang Wang saw three stone pillars erected in three corners of the valley, each with a person meditating on top. The three stone pillars formed a triangle, and in the center was a round altar covered with green moss.<br/><br/>Dugu Wenhun clasped his fists in salute and asked with a smile.<br/><br/>As soon as these words were spoken, the Three Immortals of the Emperor Sea opened their eyes, one by one. These three people were ragged, their hair disheveled, and even their faces could not be clearly discerned. “Is it you? I remember you. What’s your name again?”<br/><br/>“Ha—A thousand autumns in a great dream, which year is it tonight?”<br/><br/>“Tired, and still wanting to sleep.”<br/><br/>Listening to the Three Immortals of the Emperor Sea, Dugu Wenhun answered each one of them.<br/><br/>Upon learning that two hundred years had passed, the Three Immortals of the Emperor Sea felt deeply moved and started to chat among themselves, no longer paying attention to Dugu Wenhun, let alone Fang Wang and Fang Jing, who were completely ignored by them.<br/><br/>Fang Wang watched the Three Immortals of the Emperor Sea with a sense of peculiarity in his heart.<br/><br/>Contrary to what he had imagined, why did these three seem crazy?<br/><br/>“Before we last fell asleep, what was the issue we were discussing? That’s right, whether there was an end of the sea, you ask that Dugu lad, he doesn’t belong to the Emperor Sea and must have been running about everywhere these two hundred years.”<br/><br/>“There is no end of the sea at all, third brother, have you forgotten? We have traveled the world for hundreds of years, and there is no such thing as the end of the sea.”<br/><br/>“Boring, this world is a sphere with no central land; whoever is the strongest becomes the center of the human world. You two are just senile,” one of them retorted.<br/><br/>The more the Three Immortals of the Emperor Sea talked, the more agitated they became, and even began to curse loudly. Before long, the three immortals became anxious.<br/><br/>Boom!<br/><br/>The three burst forth with terrifying momentum at once, causing the entire Emperor Tomb Island to tremble. Fang Wang’s expression sharpened. He used his own aura to protect Fang Jing and Xiao Zi.<br/><br/>Almost simultaneously, the Three Immortals of the Emperor Sea turned their heads to look at him, their eyes sharp and terrifying in the dim valley.<br/><br/>Dugu Wenhun circulated his power, feigning calm, but his gaze couldn’t help but steal a glance at Fang Wang.<br/><br/>He secretly marveled.<br/><br/>Fang Wang faced the aura of the Three Immortals of the Emperor Sea with such an unperturbed demeanor; he could even feel the Three Immortals increase their own aura, but they could not shake Fang Wang at all.<br/><br/>Fang Jing subconsciously clung to Fang Wang’s arm, looking at the Three Immortals of the Emperor Sea with a face full of unease.<br/><br/>Soon, the Three Immortals of the Emperor Sea retracted their gaze, no longer displaying their previous lunacy, now looking solemnly at Fang Wang.<br/><br/>“The younger generation is formidable, truly remarkable.”<br/><br/>“Can someone in the fourth layer of the Golden Body Realm surpass us? Am I mad, or have I not woken up yet?”<br/><br/>“My, my, look at his talent; he seems to be not even a hundred and fifty years<br/><br/>old. ”<br/><br/>The Three Immortals of the Emperor Sea marveled, their words causing Dugu Wenhun to be visibly moved, looking at Fang Wang incredulously.<br/><br/>Dugu Wenhun had always felt that Fang Wang was about the same age as himself, having lived four to five hundred years. Even so, being able to slay Nirvana Realm Great Cultivators at the age of four to five hundred was already inconceivable.<br/><br/>Fang Wang was actually not even a hundred and fifty years old?<br/><br/>And merely in the fourth layer of the Golden Body Realm?<br/><br/>Dugu Wenhun was astounded.<br/><br/>Although the Three Immortals of the Emperor Sea had divulged Fang Wang’s true cultivation and age, they were not frightened, rather they reverted to their previous crazy behavior.<br/><br/>They began to talk about the talented individuals they’d met in the past and even compared the ancient Great Saints with Fang Wang.<br/><br/>Seeing that they had no intention of making a move, Dugu Wenhun tentatively asked, “Respected seniors, we’d like to take the Hongxuan Emperor’s trial, may we attempt it this time?”<br/><br/>Upon hearing this, the Three Immortals of the Emperor Sea instantly quieted down.<br/><br/>They simultaneously turned their gaze to Fang Wang and after a moments’ silence, they cast spells at the same time, striking towards the altar.<br/><br/>Boom!<br/><br/>The altar burst forth with intense light, and within the light, a purple beam appeared, gradually enlarging to form a gate.<br/><br/>“Go ahead, we have lost hope. If we can see our descendants gain the legacy of the Hongxuan Emperor in our lifetime, then we could die content.”<br/><br/>“That’s right.”<br/><br/>“Yes.”<br/><br/>The Three Immortals of the Emperor Sea stated in succession, and Fang Wang could not help but smile. As soon as one of them spoke, the other two followed suit, without fail.<br/><br/>Dugu Wenhun promptly paid his respects and then gave Fang Wang a look, following him into the intense light of the altar.<br/><br/>Fang Wang took Fang Jing’s hand and quickly followed, disappearing into the bright light.<br/><br/>In an instant, Fang Wang felt a powerful restraining force; in the blindness that ensued, he instinctively wanted to activate the Jiuyou Zizaishu; fortunately, he restrained himself in time.<br/><br/>Soon, Fang Wang felt himself land and immediately opened his eyes.<br/><br/>He found himself still inside the valley, standing on the altar, but now there were no stone pillars around, nor the Three Immortals of the Emperor Sea.<br/><br/>Fang Jing, Xiao Zi, and Dugu Wenhun were also nowhere in sight.<br/><br/>Fang Wang frowned, looking up, his eyes locked on the cliff wall. A golden-haired monkey was clinging to it, watching him with mocking eyes. “You’ve come, this is already the ninth time.”<br/><br/>The golden-haired monkey spoke with a voice full of vicissitude, making Fang Wang’s frown deepen. Just as he intended to inquire further, the golden-haired monkey spoke again:<br/><br/>“While unusual, you haven’t come as often as her, who is concerned about you; she has come fifty times.”<br/><br/>“Of course, you can’t compare to him; that little fellow has come more than a hundred and thirty thousand times. I’ve lost count. I really don’t want to see him anymore—he’s so dull and stubborn..”\t\t\t\t\t\t</div>", "images": {}, "success": true}