{"id": 188, "url": "https://www.novelhall.com/i-became-an-immortal-on-mortal-realm-32879/14315038.html", "title": "Chapter 188 - Chapter 188: Chapter 185: The Heavenly Emperor Imperial Mirror Great Perfection, Unprecedented_L", "volume": 2, "volume_title": "Volume 2", "body": "<h1>Chapter 188 - Chapter 188: Chapter 185: The Heavenly Emperor Imperial Mirror Great Perfection, Unprecedented_L</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 188: Chapter 185: The Heavenly Emperor Imperial Mirror Great Perfection, Unprecedented_l<br/><br/>Translator: 549690339<br/><br/>The Heavenly Emperor Imperial Mirror is similar to the Heavenly Dao True Skill, not just a simple Cultivation Technique or Spell, but a comprehensive cultivation compendium, encompassing all things, and even more profound than the Heavenly Dao True Skill.<br/><br/>From this perspective, the Descending Dragon Great Saint is no match for the Hongxuan Emperor.<br/><br/>It’s true. Both the Descending Dragon Great Saint and the Hongxuan Emperor perished opposing The Upper Realm, but the difference is, the Descending Dragon Great Saint defied the heavenly will on earth, while the Hongxuan Emperor went straight to heaven and wreaked havoc in The Upper Realm.<br/><br/>As Fang Wang reviewed the Heavenly Emperor Imperial Mirror, he reflected with emotion.<br/><br/>Of course, he had never witnessed the full glory of the Descending Dragon Great Saint and the Hongxuan Emperor, so it was difficult to judge, but at the very least, both were beings that The Upper Realm feared.<br/><br/>Once he had consolidated his thoughts, he began cultivating the Heavenly Emperor Imperial Mirror.<br/><br/>The Heavenly Emperor Imperial Mirror is divided into seven layers, each with its distinct signature Divine Skills, ascending from low to high: Heavenly Emperor Avatar, Heavenly Emperor Mountain, Heavenly Emperor River, Heavenly Emperor Temple, Heavenly Emperor Soldiers, Heavenly Emperor Coffin, Heavenly Emperor Dynasty.<br/><br/>The Heavenly Emperor Avatar used by the Hongxuan Emperor during battle was actually the most basic Divine Skill of the Heavenly Emperor Imperial Mirror!<br/><br/>To manifest higher-level Divine Skills, one’s cultivation level must improve. Each layer of the Heavenly Emperor Imperial Mirror represents a different major realm, starting with the Mahayana Realm!<br/><br/>In other words, to unleash the Heavenly Emperor Dynasty, one must surpass the Mahayana Realm by six major realms!<br/><br/>This astonished Fang Wang.<br/><br/>What realm did the Hongxuan Emperor reach in the end?<br/><br/>And how distant is the Great Saint?<br/><br/>Thus, Fang Wang began his cultivation of the Heavenly Emperor Imperial Mirror.<br/><br/>Years passed, and when he mastered the first layer, it took him fully two hundred years!<br/><br/>Bear in mind, he was already experienced, with over thirteen thousand years of cultivation as his foundation, but it still took two hundred years, which shows how powerful the Heavenly Emperor Imperial Mirror is.<br/><br/>He did not feel bored but continued cultivating.<br/><br/>The second layer took him a full three hundred years. The Heavenly Palace was very exquisite, allowing Fang Wang to wield the Heavenly Emperor Mountain.<br/><br/>The Heavenly Emperor Mountain could not only attack but also seal enemies, very domineering!<br/><br/>For the third layer, Fang Wang spent five hundred years…<br/><br/>He had not even completed half of it, and already a thousand years had passed.<br/><br/>He couldn’t help but grit his teeth and continue cultivating. He constantly recalled the words of the Hongxuan Emperor, convincing himself that he had already died eight times. Only by thinking so was he able to muster more determination to cultivate.<br/><br/>Thus, Fang Wang plunged into the tedious and prolonged years of cultivation.<br/><br/>Once he had mastered the seventh layer of the Heavenly Emperor Imperial Mirror, he looked back and realized he had been cultivating for four thousand years.<br/><br/>But it wasn’t over yet!<br/><br/>He aimed to cultivate the Heavenly Emperor Imperial Mirror to the level of Great Perfection, a realm perhaps even the Hongxuan Emperor had never reached.<br/><br/>Fang Wang felt somewhat dazed. He took a whole month to rest, constantly altering the scenery of the Heavenly Palace to dispel the boredom in his heart. Sadly, he found it not very effective, so he continued to immerse himself in arduous cultivation.<br/><br/>This session lasted for two thousand one hundred years!<br/><br/>Heavenly Emperor Imperial Mirror Great Perfection!<br/><br/>At that moment of achievement, Fang Wang felt a surge of emotion. Reaching the Great Perfection Realm, he could simultaneously wield seven kinds of Divine Skills, and not just one.<br/><br/>Heavenly Emperor Avatar, Heavenly Emperor Mountain, Heavenly Emperor<br/><br/>River, Heavenly Emperor Temple, Heavenly Emperor Soldiers, Heavenly Emperor Coffin, and Heavenly Emperor Dynasty all appeared at once, as imposing as a sudden downpour, incredibly domineering!<br/><br/>As long as his Spiritual Power was sufficient, he could even destroy worlds!<br/><br/>Of course, all this presupposed that his realm fulfilled the requirements of the seventh layer of the Heavenly Emperor Imperial Mirror, for the Heavenly Palace could not influence the mortal world.<br/><br/>Cultivating the Heavenly Emperor Imperial Mirror took a total of six thousand one hundred years!<br/><br/>Once more, Fang Wang surpassed his previous record for the longest time<br/><br/>spent in seclusion.<br/><br/>At the moment he got up, the Heavenly Palace shattered.<br/><br/>He opened his eyes to find his consciousness had returned to the Illusionary Realm. The golden-haired monkey was looking at him smugly, its gaze filled with provocation.<br/><br/>“How is it? How much did you remember? You didn’t forget everything, did you? If you ask me, I can tell you again,” boasted the golden-haired monkey proudly.<br/><br/>Fang Wang’s gaze was numb, his aura suddenly dropped, creating an oppressive atmosphere.<br/><br/>He stared at the golden-haired monkey and asked, “Why did you say earlier that I wasn’t suitable? Why did you say that?”<br/><br/>The golden-haired monkey found his mood strange but still replied, “Of course, because you didn’t learn in the previous eight times. In the eight times you were here before, each time after receiving the legacy, you shook your head and gave up, saying you couldn’t learn it.”<br/><br/>Upon hearing this, Fang Wang immediately surmised that his experience in this lifetime was different from what the golden-haired monkey had mentioned about the previous eight times.<br/><br/>If those eight times had really been him, he couldn’t have feigned it.<br/><br/>At most, he would have been modest, but he would never have hidden his progress.<br/><br/>If he had learned it, he had learned it!<br/><br/>This had been his attitude when facing other Great Saints in the past.<br/><br/>“What do you feel this time?” the golden-haired monkey asked with raised eyebrows, its face full of challenge. The Heavenly Emperor Imperial Mirror was its pride, and it would find it hard to accept if someone truly mastered it.<br/><br/>People are like that, contradictory about many things.<br/><br/>It both hoped someone could inherit its legacy and worried that someone might indeed take it over and surpass itself.<br/><br/>Fang Wang replied, “Profound and indeed difficult to cultivate.”<br/><br/>At that, the corners of the golden-haired monkey’s mouth curved up. But before it could speak, Fang Wang raised his hand, condensing a golden Token, engraved with the word “Heavenly” on it.<br/><br/>Heavenly Emperor’s Command!<br/><br/>This was the most fundamental Spell of the Heavenly Emperor Imperial Mirror, battling with the Token, possessing formidable penetrating power, and able to seal the opponent’s Spiritual Power. It could even imprison the opponent’s Primordial Spirit, preventing it from escaping the body!<br/><br/>The condensing of the Heavenly Emperor’s Command indicated that Fang Wang had learned it.<br/><br/>Upon hearing this, the expression on the golden-haired monkey’s face instantly turned horrific as it cried out in disbelief, “How could that be possible!”<br/><br/>Fang Wang said with an emotionless face, “I will not let down your reputation.”<br/><br/>The golden-haired monkey trembled all over, looking at the Heavenly Emperor’s Command in Fang Wang’s hand, as a storm of shock and awe raged in its heart.<br/><br/>“Impossible… It can’t be…”<br/><br/>Seeing such a reaction from the monkey did not bring Fang Wang any satisfaction; his heart had already sunk into a deathly stillness.<br/><br/>Six thousand one hundred years of seclusion had worn away many of his emotions.<br/><br/>“Do you have any last words? I am ready to leave,” Fang Wang said.<br/><br/>The golden-haired monkey came back to its senses, scrutinizing Fang Wang closely before saying in a deep voice, “You are different from the previous eight times, what exactly have you experienced? Right, your Fate Halberd has an additional blade…<br/><br/>Fang Wang asked, “What does an additional blade represent?”<br/><br/>The golden-haired monkey took a deep breath and shook its head, “The secrets of heaven must not be revealed…<br/><br/>As its voice fell, the monkey suddenly retreated to the mountain wall. The Heavenly Emperor’s Command floated in front of it, less than three centimeters away.<br/><br/>It hurriedly cried out, “I truly cannot reveal more, the will of heaven has its own dictates; the words I’ve already spoken have backfired on my soul. If I continue, I might be utterly dispersed…”<br/><br/>Disbelieving, it looked toward Fang Wang, realizing at that moment that it could no longer trap Fang Wang in its illusionary realm, and that he could escape at any moment or even destroy its realm.<br/><br/>Fang Wang retracted the Heavenly Emperor’s Command and said, “Sorry, I couldn’t restrain myself.”<br/><br/>He had figured it out. Although the golden-haired monkey appeared enigmatic and all-knowing, it was actually very fragile. Not only was it trapped here, but its soul would also disperse if the Emperor’s Tomb Island were to be destroyed.<br/><br/>The golden-haired monkey swallowed nervously and said, “You should go. I hope that next time… never mind, I hope we never meet again…”<br/><br/>Not meeting again was also a blessing in disguise.<br/><br/>Fang Wang gave it a deep look and said, “If one day I attain the Dao and you need me to do something for you, I will come to help you, to repay the debt of this legacy.”<br/><br/>After speaking, he vanished into thin air, using the Jiuyou Zizaishu to leap directly out of the illusionary realm.<br/><br/>The golden-haired monkey stood there in a daze, muttering to itself, “How could there be such a major change… It seems they were successful… They all did it for him, tsk tsk, what kind of monster did they actually save…” “Did they encounter an untouchable existence, so they came to his rescue?”<br/><br/>Fang Wang stepped out from the intense light of the altar, and as soon as he did, Xiao Zi threw herself into his arms.<br/><br/>“Young Master, did you succeed?” Xiao Zi asked expectantly.<br/><br/>She had failed, but she believed that the Young Master would certainly pass the test set by the Hongxuan Emperor.<br/><br/>Fang Wang nodded slightly, sending Xiao Zi into an excited frenzy, which moved Dugu Wenhun and The Three Immortals of the Emperor Sea.<br/><br/>“Brother Fang, you have received the Hongxuan Emperor’s legacy?” Dugu Wenhun could not help asking, his tone anxious.<br/><br/>Fang Wang took a deep breath, basking in the baptism of the sunlight. He raised his arms and stretched his body.<br/><br/>Six thousand one hundred years!<br/><br/>Who could understand what he had endured during those six thousand one hundred years?<br/><br/>“Kid, spit it out, did you really get it?” “Exactly, come on, tell us!”<br/><br/>“Ah! Impossible! It can’t be!”<br/><br/>The Three Immortals of the Emperor Sea began to descend into madness once again, with one even standing up, ready to attack Fang Wang.<br/><br/>In an instant, Fang Wang’s eyes narrowed, and he moved at an extreme speed, sweeping his sleeve and sending out three Heavenly Emperor’s Commands that hit each of the immortals in the chest, piercing their flesh.<br/><br/>Everything happened so quickly that even Dugu Wenhun, who was at the Nineth Layer of the Mahayana Realm, did not see Fang Wang’s movements clearly.<br/><br/>The faces of The Three Immortals of the Emperor Sea drastically changed as they trembled and found themselves unable to move. They looked down in horror at the Heavenly Emperor’s Commands embedded in their chests. Dugu Wenhun and Xiao Zi followed their gaze and saw the Heavenly Emperor’s Commands.<br/><br/>“This…”<br/><br/>Dugu Wenhun stared fixedly at one of the Heavenly Emperor’s Commands, unable to forget this token. The Hongxuan Emperor had easily suppressed him using such a command…<br/><br/>Not only had Fang Wang obtained the legacy, but he had also learned it directly?<br/><br/>The Three Immortals of the Emperor Sea, sealed by the Heavenly Emperor’s Commands, could not speak, but their eyes were filled with terror.<br/><br/>They recognized the token too, having been defeated by the Hongxuan Emperor with such a command several times. It was because of their repeated failures that they had become mad.<br/><br/>Facing an impossible task, anyone would be stressed.<br/><br/>When Fang Wang displayed the Heavenly Emperor’s Command, in their eyes, his figure gradually merged with that of the Hongxuan Emperor.<br/><br/>Fang Wang glanced at them, and the Heavenly Emperor’s Commands on their bodies instantly dissipated, leaving the three immortals feeling relieved and collapsing onto the stone pillars.<br/><br/>The valley fell silent.<br/><br/>Fang Wang always felt he had forgotten something and reflected carefully until it suddenly dawned on him.<br/><br/>He turned around sharply to look, his gaze penetrating the bright light of the altar, and then he sighed with relief.<br/><br/>Fang Jing had actually passed the trial and was now receiving the legacy of the Hongxuan Emperor.<br/><br/>The Hongxuan Emperor he faced was a youth, even younger-looking than him…<br/><br/>Fang Wang’s lips curled up in a smile, impressed that Fang Jing had secured such a fortune.<br/><br/>“Heavenly Emperor’s Command, you’ve learned it so quickly, you haven’t disappointed me,” a light laughter echoed through the valley, startling everyone to turn their heads, and Fang Wang’s face finally broke into a smile..\t\t\t\t\t\t</div>", "images": {}, "success": true}