{"id": 189, "url": "https://www.novelhall.com/i-became-an-immortal-on-mortal-realm-32879/14315039.html", "title": "Chapter 189 - Chapter 189: Chapter 186: The Heavenly Emperor Coffin, Three Immortals Bow Down", "volume": 2, "volume_title": "Volume 2", "body": "<h1>Chapter 189 - Chapter 189: Chapter 186: The Heavenly Emperor Coffin, Three Immortals Bow Down</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 189: Chapter 186: The Heavenly Emperor Coffin, Three Immortals Bow Down<br/><br/>Translator: 549690339<br/><br/>“The wicked woman is here!”<br/><br/>Xiao Zi climbed onto Fang Wang’s shoulder and muttered, looking in the direction of its serpentine eyes, only to see Zhou Xue leading a group of Jin Xiao Sect Cultivators flying towards them.<br/><br/>Zhou Xue had changed into red clothing, with a red base and black patterns, resembling some kind of divine bird that perched on her robe, exquisite and magnificent, lifelike, her wide sleeves catching the wind, her demeanor extraordinary.<br/><br/>Dugu Wenhun’s gaze fell on Zhou Xue, his brows tightly knit, revealing a hint of wariness in his eyes.<br/><br/>Zhou Xue flew up to Fang Wang and landed in front of him, with a group of Jin Xiao Sect Cultivators following suit. Their gazes were all fixated on Fang Wang, their eyes burning with fervor.<br/><br/>Tian Dao Fang Wang!<br/><br/>They secretly marveled, this presence matched what they had imagined.<br/><br/>Fang Wang already possessed an air of transcendence, and after having recently completed his 6,000-year seclusion, he exuded a sense of time-worn experience, making one feel at a single glance that he had weathered the trials and tribulations of the mortal realm for eons, fully fitting their image of an enlightened sage, an Immortal of the human world.<br/><br/>“Are you also here for the heritage?” Fang Wang asked Zhou Xue.<br/><br/>It had been more than six thousand years, and he kind of missed her.<br/><br/>Zhou Xue nodded with a smile, “Coming to Emperor Sea, naturally I want to try for Emperor Sea’s greatest heritage. I’ll arrange for them to enter the Formation first.”<br/><br/>After saying so, she turned around and gestured for the other Jin Xiao Sect Cultivators to follow, then walked to the altar and began to channel her spiritual power into it.<br/><br/>As a mysterious light burst forth, a powerful beam shot up into the sky, causing the Three Immortals of the Emperor Sea to widen their eyes in shock and bewilderment.<br/><br/>“How is she able to activate the Formation?”<br/><br/>“Has she been here before?”<br/><br/>“Told you not to sleep so soundly, you wouldn’t listen.”<br/><br/>The Three Immortals of the Emperor Sea grumbled, drawing the Jin Xiao Sect Cultivators’ attention towards them.<br/><br/>Seeing Zhou Xue moving so confidently and informed, Fang Wang realized that in a past life, she must have also visited this place. He decided he would have a chat with her later about those words of the Hongxuan Emperor. At that moment, a white-haired man approached Fang Wang. “Fang Wang, it has been a long time.”<br/><br/>Fang Zigeng said with a smiling face and a gentle voice.<br/><br/>His white hair juxtaposed with black attire, gave him an appearance of a Demonic Dao overlord, even though his facial features were ordinary.<br/><br/>Fang Wang looked at Fang Zigeng with a sense of puzzlement in his heart.<br/><br/>Xiao Zi, however, was sizing up Fang Zigeng, wistfully saying, “Fang Zigeng, you’ve changed quite a bit, eh? How did your hair turn white? You better be careful, don’t end up like Fang…”<br/><br/>It suddenly stopped speaking, nervously glancing towards Fang Wang.<br/><br/>Only when he heard the name Fang Zigeng, did Fang Wang remember that he was one of his cousins.<br/><br/>Among the nine individuals from the Fang Residence who had joined the Great Abyss Gate, Fang Zigeng was one of them, highly valued by Zhou Xue, and often praised by Fang Hanyu for his tenacity. He hardly ever indulged in leisure, dedicating himself to rigorous cultivation.<br/><br/>Indeed, in his generation of disciples, aside from Zhou Xue, Fang Hanyu, he had the best relationship with Fang Zigeng—though it had almost slipped his mind.<br/><br/>Fang Wang flashed a smile and said, “Indeed, it has been many years. You have actually reached the Condensation Spirit Realm Second Layer; your fortune has been quite considerable.”<br/><br/>Fang Zigeng, with his unremarkable talent and lacking significant opportunities like Fang Hanyu, had managed to reach the Condensation Spirit Realm Second Layer at such an age, which was quite commendable.<br/><br/>Fang Zigeng replied with modest laughter, “It’s all thanks to Zhou Xue’s promotion, but it’s a pity. The resources she invested in me, if placed on someone else, would at least have reached the Cross-Void Realm by now. I feel somewhat as if I have let her down.”<br/><br/>He appeared calm, but inside, he was quite nervous.<br/><br/>This cousin of his was too imposing, and as the gap between them widened, and with the years apart, it was natural for him to feel anxious.<br/><br/>As Fang Wang recalled more about Fang Zigeng, he warmly wrapped an arm around his shoulder and laughed, “No talk of letting anyone down; we’re all family.”<br/><br/>Having said that, he introduced Fang Zigeng to Dugu Wenhun and explained that Fang Zigeng was his cousin<br/><br/>Dugu Wenhun, whose mood was rather complex at first, was startled into action and quickly smiled as he greeted Fang Zigeng.<br/><br/>Sharp as he was, Dugu Wenhun immediately grasped the implication behind Fang Wang’s words.<br/><br/>Not many years ago, Fang Wang had caused a great uproar in the Xuan Dynasty for the sake of a brother, and now another brother had appeared. Dugu Wenhun saw this as an opportunity.<br/><br/>Even though he had not passed the Hongxuan Emperor’s heritage assessment, Fang Wang had, and perhaps he could attain the heritage through Fang Wang.<br/><br/>Thus, Dugu Wenhun took the initiative to chat with Fang Zigeng, who was no longer the shy, reserved young man he used to be, engaging with Dugu Wenhun with ease and composure.<br/><br/>The Three Immortals of the Emperor Sea remained silent. In the past, they would have been enraged, for they had long regarded Emperor’s Tomb Island as their own territory, and could not tolerate such a din of noisy people running amok.<br/><br/>But the intimidation from Fang Wang’s Heavenly Emperor’s Command was so great that they dared not make a sound.<br/><br/>The Jin Xiao Sect Cultivators gradually stepped onto the altar and into the Formation, with Zhou Xue joining them thereafter. Seeing this, Fang Wang prompted Fang Zigeng to also enter.<br/><br/>The valley then quieted down.<br/><br/>Fang Wang continued to wait for Fang Jing.<br/><br/>Elsewhere.<br/><br/>Zhou Xue found herself within the Illusionary Realm, still in the same valley, facing the Golden-haired Monkey alone.<br/><br/>The Golden-haired Monkey leapt down from the mountain wall and, looking at<br/><br/>Zhou Xue, reflected, “So you have come as well.”<br/><br/>Zhou Xue teased, “How many times have I been here now?”<br/><br/>The Golden -haired Monkey scratched its head and replied, “The fifty-first time.”<br/><br/>It scrutinized Zhou Xue carefully, feeling that something about her was off as well.<br/><br/>Zhou Xue stared at it, her eyes deep as she said, “You said fifty times before, and that’s correct. I used to think you were just a crazy monkey…”<br/><br/>The golden-haired monkey became anxious upon hearing this and cursed,<br/><br/>“You’re the crazy one. Every time you come, you insult me. I am the Hongxuan<br/><br/>Emperor, the founder of the Imperial Dao, who swept through The Upper<br/><br/>Realm. Show some respect to me!”<br/><br/>Zhou Xue snorted, “So defeating you at the same realm means I can gain the inheritance?”<br/><br/>“Hmm, that’s right. Why? You feel confident? You’ve failed all fifty times before! ”<br/><br/>“Let’s try then. If I win, I don’t want that Heavenly Emperor Imperial Mirror; I want you to tell me the location of a Heavenly Emperor Coffin.”<br/><br/>As soon as these words came out, the face of the golden-haired monkey darkened in an instant. It stared intently at Zhou Xue and asked coldly, “Who are you, really?”<br/><br/>Zhou Xue smiled, then raised her right hand, and billowing Demonic Qi poured out from the palm, burning like fierce flames.<br/><br/>Atop the altar, Fang Jing stumbled out from the intense light, rubbing his eyes. As he surveyed the valley and saw Fang Wang, his eyes lit up immediately, and he rushed over.<br/><br/>“Uncle, I received the inheritance, but I can’t remember it…”<br/><br/>Fang Jing said with a grievance as he approached Fang Wang.<br/><br/>At this moment, Fang Wang stood in front of the rock wall, his gaze fixed on the moss growing there. Hearing Fang Jing’s words, Fang Wang chuckled, “It’s fine if you can’t remember. Once you’ve mastered the Heavenly Dao True Skill and Nine Dragons Tyrant Fist, your uncle will teach you the Hongxuan Emperor’s inheritance.”<br/><br/>Upon hearing this, Fang Jing’s face broke into a smile, and he nodded obediently.<br/><br/>Hearing Fang Wang’s willingness to teach the inheritance to others, Dugu Wenhun’s heart raced, and The Three Immortals of the Emperor Sea also looked at Fang Wang, their eyes burning with eagerness.<br/><br/>The Three Immortals of the Emperor Sea leapt down from the stone pillars and knelt behind Fang Wang, startling Fang Jing so much that he quickly stepped aside.<br/><br/>“Predecessor, please teach us. We are willing to be your oxen and horses!”<br/><br/>“Yes, the three of us have sought the Hongxuan Emperor’s inheritance all our lives, asking for nothing else.”<br/><br/>“As long as you are willing to teach us, we will be your servants from now on.”<br/><br/>The three immortals said unanimously, looking up at Fang Wang with earnest desire on their faces.<br/><br/>Fang Wang didn’t turn around but said calmly, “It’s not out of the question. Follow me later.”<br/><br/>The Three Immortals of the Emperor Sea were overjoyed and thanked Fang Wang profusely.<br/><br/>Dugu Wenhun opened his mouth but ultimately couldn’t shed his pride. With so much life ahead of him, how could he bring himself to serve Fang Wang so soon?<br/><br/>Fang Jing watched The Three Immortals of the Emperor Sea, seemingly deep in thought.<br/><br/>Xiao Zi came before The Three Immortals of the Emperor Sea, boasting, “From now on following my young master, you’ll need to learn the rules; I will teach you…”<br/><br/>It began to talk incessantly, and the three Great Cultivators of the ninth layer of Nirvana Realm listened attentively, afraid of missing a single word.<br/><br/>Soon, Jin Xiao Sect Cultivators began to emerge from the Formation, one after another, all of them disheartened.<br/><br/>Fang Zigeng also came out.<br/><br/>He approached Fang Wang and, responding to Xiao Zits inquiry, said helplessly, “The Condensation Spirit Realm’s Hongxuan Emperor was too strong; I had no chance to fight back.”<br/><br/>Fang Wang wasn’t disappointed, as Fang Zigeng was average in both cultivation and combat talent. The one thing remarkable about him was his survival talent. He could always stay alive, no matter how dangerous the environment.<br/><br/>Since the beginning of cultivation, Fang Wang had saved Fang Hanyu several times, but he had never needed to save Fang Zigeng because he didn’t need to.<br/><br/>More and more Jin Xiao Sect Cultivators came out, while Zhou Xue remained in the Formation. Fang Wang was curious about what kind of exchange Zhou Xue and the golden-haired monkey would have.<br/><br/>Jin Xiao Sect Cultivators discussed the Hongxuan Emperor’s tests among themselves while also sneaking glances at Fang Wang.<br/><br/>In the end, unable to contain their curiosity, some approached Fang Wang, seeking to befriend him.<br/><br/>When faced with the Jin Xiao Sect Cultivators, Fang Wang didn’t put on airs, engaging in simple conversations with the visitors. Suddenly, the valley was bustling with activity once more.<br/><br/>Two hours later.<br/><br/>Jin Xiao Sect had two people who hadn’t come out yet, causing speculation among the cultivators.<br/><br/>“Zhou Xue and Xiao Kuang haven’t come out yet; they might have a chance.”<br/><br/>“Nonsense, Zhou Xue is the Demon Monarch’s sole disciple; naturally, her talent is immense. Xiao Kuang is equally formidable, and his swordsmanship could easily dominate his peers, even fighting across realms.”<br/><br/>“If both of them gain the Hongxuan Emperor’s inheritance, how strong will our Jin Xiao Sect become in the future?”<br/><br/>“It’s tough contending for the title of the first genius within the Jin Xiao Sect.<br/><br/>Apart from Xiao Kuang, there are also two other exceptional geniuses with<br/><br/>Heaven Yuan Spirit Treasures. Unfortunately, they didn’t come.”<br/><br/>Listening to the conversations of the Jin Xiao Sect Cultivators, Xiao Zi grew interested and joined in the discussion. With Fang Wang present, the Jin Xiao Sect Cultivators dared not ignore Xiao Zi.<br/><br/>Dugu Wenhun, having heard about Zhou Xue’s betrothal to Fang Wang, warmed up to the Jin Xiao Sect unexpectedly and started actively chatting with the sect’s cultivators.<br/><br/>At that moment, a figure emerged on the altar, not Xiao Kuang but Zhou Xue.<br/><br/>Zhou Xue stood at the edge of the altar and said, “Everyone, let’s stay on<br/><br/>Emperor’s Tomb Island for a few days.”<br/><br/>With her high prestige within the Jin Xiao Sect, the cultivators naturally didn’t dare object. They became curious about the fortunes that the last remaining Xiao Kuang would encounter.<br/><br/>Zhou Xue gave Fang Wang a look, and the two leaped up, flying to the peak of a thousand-foot-tall mountain.<br/><br/>The clouds roiled, and the cold wind was bone-chilling.<br/><br/>Zhou Xue once again took out the oil lamp, isolating them from any prying eyes.<br/><br/>Fang Wang stretched out lazily, then sat at the edge of the cliff, turning to look at her and asking, “Did that monkey tell you any strange things?”<br/><br/>Zhou Xue sat down beside him and said softly with a smile, “You’ve been here nine times, I’ve been here fifty-one times, and does someone coming ten thousand times count as strange?”\t\t\t\t\t\t</div>", "images": {}, "success": true}