{"id": 181, "url": "https://www.novelhall.com/i-became-an-immortal-on-mortal-realm-32879/14311486.html", "title": "Chapter 181 - Chapter 181: Chapter 178: The Xuan Dynasty Bows Down_1", "volume": 2, "volume_title": "Volume 2", "body": "<h1>Chapter 181 - Chapter 181: Chapter 178: The Xuan Dynasty Bows Down_1</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 181: Chapter 178: The Xuan Dynasty Bows Down_1<br/><br/>Translator: 549690339<br/><br/>Dusk fell, and the setting sun was like blood.<br/><br/>The roaring between heaven and earth continued endlessly, the vast land was engulfed in flames, and the fierce wind swept wildly. Countless cultivators fell one after another, all charging in the same direction. On their journey, corpses kept flying towards them, forcing them to dodge abruptly.<br/><br/>Terror filled the eyes of each cultivator. In their pupils, a flame as bright as the sun was burning fiercely, more dazzling than the setting sun.<br/><br/>That sun was the manifestation of Fang Wang’s yang energy.<br/><br/>Millions of cultivators were sieging Fang Wang, with the front-line cultivators constantly casting spells for long-range attacks. Fang Wang, impeded by a group of Nirvana Realm Great Cultivators, would occasionally punch towards the distant cultivators. His punches alone could sweep away swathes of people, those below the Golden Body Realm would be blown away for hundreds of miles, and if one’s cultivation was even lower, they might fall on the spot.<br/><br/>Fang Wang, having fought for half a day, was still dominant, fully displaying the might of the Vajra Invincible Saint Body.<br/><br/>On the side of the Xuan Dynasty, everyone was filled with fear towards him.<br/><br/>“Why isn’t he fleeing?”<br/><br/>“Damn it, he’s holding a child and being besieged by so many of us, yet he still doesn’t fall behind; who exactly is this fellow?”<br/><br/>“What? He’s the elder brother of Princess Xiu Yang’s husband? Isn’t that the royal family?”<br/><br/>“Wait a minute, what exactly happened during my retreat? A member of the royal family rebelling?”<br/><br/>“His Majesty is confused, I said it long ago, we should never have gotten so close with the Great Divine Dynasty…”<br/><br/>As the war reached a stalemate, the cultivators began to inquire about the cause of this calamity. Those who learned the truth all thought it ridiculous.<br/><br/>The Princess eloped, His Majesty gave the order to kill, and the result was that the deceased’s brother had come from the Southern Celestial Sea to the Xuan Dynasty in Emperor Sea?<br/><br/>This is ridiculous…<br/><br/>The Great Cultivators from the sects other than the royal clan were all cursing. Such a trivial matter had brought the Xuan Dynasty its greatest catastrophe since its founding—outrageous!<br/><br/>But now, as the saying goes, they were riding a tiger and found it hard to dismount; they had to kill Fang Wang.<br/><br/>With so many people dead in the Xuan Dynasty, all the sects had lost disciples. Even if they were still frightened of Fang Wang’s strength, they had to fight with all their might.<br/><br/>This enmity could no longer be resolved!<br/><br/>The Xuan Dynasty had already suffered heavy losses. If Fang Wang were to escape, the prestige of the Xuan Dynasty in Emperor Sea would surely collapse, Emperor Sea would face internal strife, and even the surrounding seas might take the opportunity to invade Emperor Sea.<br/><br/>If Fang Wang died within the Xuan Dynasty, although it would bring shame to the dynasty, its deterrence would remain, and any invaders would surely die!<br/><br/>But…<br/><br/>When the eyes of the cultivators of the various sects in the Xuan Dynasty landed on Fang Wang, all their hearts raced. Such a powerful being, how can one emerge victorious?<br/><br/>Boom!<br/><br/>Fang Wang turned and kicked a cultivator who tried to attack him from behind. With that one kick, the cultivator felt his internal organs churn as if the seas and rivers were overturning, and his soul nearly soared out of his body.<br/><br/>He tumbled for dozens of miles and crashed into the ground, his fate unknown.<br/><br/>This scene made the other Great Cultivators even more hesitant to approach Fang Wang.<br/><br/>That person was a top genius of Emperor Sea known throughout the world, and with a cultivation of the ninth level of the Golden Body Realm, he was able to contend with the Nirvana Realm. Before this battle, he had almost never been defeated.<br/><br/>In this battle, the people closest to Fang Wang in Emperor Sea became even more renowned!<br/><br/>But Fang Wang didn’t care about their reputations; he just wanted to keep on killing!<br/><br/>The night passed.<br/><br/>As the first rays of dawn pierced the darkness, countless figures were still fighting on the chaotic battlefield.<br/><br/>Amidst the ruins of the devastated land, bodies lay everywhere, with more corpses embedded in the mountains that had been blasted apart and chopped down.<br/><br/>The world was silent; the cultivators from the Xuan Dynasty had grown numb; they no longer communicated, continually fighting, continually searching for Fang Wang’s figure.<br/><br/>Fang Wang was still entangled by more than twenty Nirvana Realm Great Cultivators. These fellows worked together seamlessly, taking turns to exhaust him, such that he hadn’t slain a single Nirvana Realm Great Cultivator all night.<br/><br/>Even so, over a hundred cultivators from the Mahayana Realm and Golden Body Realm had died at Fang Wang’s hands. Over a hundred thousand from the Cross-Void Realm and Condensation Spirit Realm combined had also perished, with lower realm cultivators keeping their distance. The cause of their deaths was almost always due to the aftershocks of the battle.<br/><br/>Suddenly!<br/><br/>Fang Wang came to an abrupt stop, and those Great Cultivators who had been on edge all night, suddenly saw him stop and also paused in their tracks.<br/><br/>The masters and elders of the various sects raised their hands, signaling the others to stop as well.<br/><br/>Under their watch, Fang Wang took out a small bottle from the Dragon Jade Ring, poured out two elixirs, and said softly, “Jing’er, are you hungry? Open your mouth.”<br/><br/>Although Fang Jing hadn’t fought, being bound to Fang Wang for a day and night left him sore and exhausted. Hearing his uncle’s words, he opened his mouth instinctively.<br/><br/>This scene deeply wounded the cultivators of the Xuan Dynasty’s Thirteen Sects and the royal family.<br/><br/>An elder in white robes with an immortal aura and Daoist bones took a step forward and shouted angrily, “Tian Dao Fang Wang, what exactly do you intend to do?”<br/><br/>Initially, they all thought they were chasing after Fang Wang, especially since he was still carrying a child. But that wasn’t the case.<br/><br/>The cultivators of the Xuan Dynasty were both afraid and humiliated.<br/><br/>Fang Wang gently patted Fang Jing’s back and looked towards the enemies in all directions. Although the Heavenly Dao Imperial Dragon Crown was still on his head, his hair was slightly disheveled, with stray strands fluttering across his face, making him appear even more wild.<br/><br/>“Your emperor has killed my brother and sister-in-law. I bid him to exterminate himself as retribution. You chase after me relentlessly and still ask what I want to do? Don’t you find that laughable?”<br/><br/>Fang Wang’s voice rang out, touching the hearts of the many cultivators.<br/><br/>The foremost Nirvana Realm Great Cultivators raised their eyebrows, relieved in their hearts; Fang Wang’s words indicated there might be room for negotiation!<br/><br/>However, before they could speak, Fang Wang’s voice sounded again, “I offer you two choices: either kneel and beg for mercy, or be eradicated by me. I can still accompany you in battle!”<br/><br/>Filled with murderous intent, his words echoed under the Firmament for a long time, leaving the millions of cultivators as if they were in a frigid cellar.<br/><br/>Upon hearing these words, the Nirvana Realm Great Cultivators of the Xuan Dynasty’s Thirteen Sects flew into a tremendous rage.<br/><br/>“Audacious! Do you truly believe you can single-handedly slaughter your way through the Cultivation World of my Xuan Dynasty?”<br/><br/>“Good! Very good! Then let’s fight to the death!”<br/><br/>“Fang Wang, don’t think your opponents are limited to us. Your name has already spread to all forces within the Emperor Sea, the entire Emperor Sea will hunt you down, you won’t be able to escape the Emperor Sea!”<br/><br/>“Then bring it on. I want to see whether it’ll be you who are fearful of death first, or whether you, Fang Wang, will be the one to fall!”<br/><br/>“All disciples obey, set up the formation, vow to die and execute the demonic Fang Wang! ”<br/><br/>The Great Cultivators of each sect issued their orders. The morale of the millions of Cultivators surged dramatically, their rage overtook them, and they had forgotten fear; their minds were filled with a single thought.<br/><br/>Execute Fang Wang!<br/><br/>Fang Wang raised his hand, condensing the Rainbow Sword, and once again a ghostly god. He grew weary of this war, ready to swiftly end it before welcoming the next battle!<br/><br/>To kill one is to kill!<br/><br/>To kill a million is also to kill!<br/><br/>Since both parties have reasons not to cease, let’s see the true mettle under our hands!<br/><br/>Fang Wang’s eyes were incomparably cold as he raised the Rainbow Sword, while the ghostly god behind him did the same.<br/><br/>At noon.<br/><br/>To the west of the continent, upon the mountain ranges, Jin Xiao Sect Cultivators were scattered around, with the Demon Monarch meditating at the summit, facing the vast sea, the sound of the waves so clamorous.<br/><br/>She remained calm while the other Jin Xiao Sect Cultivators could not settle down, whispering among themselves, all discussing Fang Wang.<br/><br/>Every half an hour, a Jin Xiao Sect scout would bring news, keeping them updated on the latest intelligence regarding the grand battle between Fang Wang and the Xuan Dynasty. Their concern turned into admiration, and now their hearts were filled with awe.<br/><br/>They even began to fear confronting Fang Wang!<br/><br/>The Jin Xiao Sect could not shake the Xuan Dynasty, but Fang Wang could. Facing a being far stronger than themselves, and with such a heavy propensity for killing, how could they not be afraid?<br/><br/>Just then, a Cultivator descended from the sky, kneeling before the Demon Monarch; all the Jin Xiao Sect Cultivators turned in unison to look at the scout, awaiting his report.<br/><br/>“To report to the Sect Hierarch, Fang Wang has broken through the encirclement and is now heading toward us.”<br/><br/>The Demon Monarch opened her eyes and looked at him, asking softly, “Is he injured?”<br/><br/>The Cultivator hurriedly replied, “It’s not clear, but…”<br/><br/>“Hmm?”<br/><br/>“The number of Xuan Dynasty Cultivators who have fallen by his hand exceeds two million. Those sects could not contend with Fang Wang and knelt to beg for mercy; Fang Wang has just left…”<br/><br/>No sooner had these words been uttered than the thousands of Jin Xiao Sect Cultivators were in an uproar. Ye Canghai’s mouth hung open, unable to maintain his usual aloof demeanor.<br/><br/>Fang Wang actually made the Xuan Dynasty bow down?<br/><br/>The reporting Cultivator lifted his head, adding, “Fang Wang has noticed our scouts and sent a message for you: he has instructed us to withdraw, there’s no need to reinforce him. He does not wish to leave the Emperor Sea for the time being…”<br/><br/>Does not wish to leave the Emperor Sea?<br/><br/>The hearts of the Jin Xiao Sect Cultivators throbbed wildly, sensing the madness and ruthlessness in Fang Wang.<br/><br/>He actually intends to continue the desperate fight?<br/><br/>Merely for the death of a brother, to be this insane…<br/><br/>At this moment, all Jin Xiao Sect Cultivators made up their minds that they must never provoke anyone tied to Fang Wang in the future, like that Fang Hanyu—they must form good ties!<br/><br/>The Demon Monarch stood up, turning around with a swish of her sleeves, facing the sea, and ordered, “Since Heavenly Dao does not require our assistance, then let’s not disturb him any further. Let’s go, it’s time to attend to the other significant matter for which we have come!”<br/><br/>All Jin Xiao Sect Cultivators immediately rose to their feet, their gazes fixed on the Demon Monarch, yet they couldn’t help but imagine the scenes of Fang Wang battling the Xuan Dynasty in their minds.<br/><br/>Simultaneously.<br/><br/>Thousands of miles away, Fang Wang stood upon the head of Xiao Zi, his hands naturally hanging at his sides, not condensing even a single Lifespirit Treasure.<br/><br/>Fang Jing lay sleeping at his feet, his frail body curled up.<br/><br/>The Golden Scale White Feather Robe was draped over Fang Wang, the golden dragon energy still present but faint upon closer inspection.<br/><br/>Fang Wang’s Spiritual Power was nearing depletion. Even with the Vajra Invincible Saint Body, he felt a hint of weariness. Heavenly Dao True Skill was voraciously absorbing nature’s spiritual energy, swiftly converting it into Spiritual Power.<br/><br/>Fang Wang’s eyes still held traces of murderous intent, his entire body emanated a terrifying aura.<br/><br/>“It’s a pity, not being able to wipe out all those creatures…”<br/><br/>Fang Wang thought to himself, referring to the Nirvana Realm Great Cultivators.<br/><br/>Although he had slain half his enemies, none of those in the Nirvana Realm had perished, at most severely injured.<br/><br/>The previous four Nirvana Realm Great Cultivators he had killed did so because they exerted all their strength to cast the Heavenly Exorcising Execution Array, leading to a depletion of Spiritual Power, compounded by their already badly wounded bodies, which gave him the opportunity to execute them.<br/><br/>The Nirvana Realm Great Cultivators he encountered later appeared furious but were in fact very cautious. They took turns wearing Fang Wang down, making it difficult for him to execute them.<br/><br/>Unable to harm Fang Wang and even less able to stop his rampage, they all took care of themselves. When the number of enemies killed by Fang Wang surpassed two million, these Nirvana Realm Great Cultivators could no longer endure and bowed their heads in admission of wrong.<br/><br/>They feared all their disciples would be executed by Fang Wang, so they had no choice but to bow.<br/><br/>While the Cultivators of this continent might have been terrified by Fang Wang’s killings, he felt it wasn’t enough!<br/><br/>Next, he planned to sweep across all powers in the Emperor Sea, not to kill, but to make all forces within the Emperor Sea Cultivation World aware of his strength, so in the future they wouldn’t dare to plot or provoke the Fang<br/><br/>Family!\t\t\t\t\t\t</div>", "images": {}, "success": true}