{"id": 180, "url": "https://www.novelhall.com/i-became-an-immortal-on-mortal-realm-32879/14311485.html", "title": "Chapter 180 - Chapter 180: Chapter 177: Summoning The Heavenly Exorcising Execution Array, Nirvana Falls_L", "volume": 2, "volume_title": "Volume 2", "body": "<h1>Chapter 180 - Chapter 180: Chapter 177: Summoning The Heavenly Exorcising Execution Array, Nirvana Falls_L</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 180: Chapter 177: Summoning the Heavenly Exorcising Execution Array, Nirvana Falls_l<br/><br/>Translator: 549690339<br/><br/>The battle had been going on for the duration of an incense stick when Fang Wang used the Nine Dragons Tyrant Fist only four times, relying on physical strength for the rest.<br/><br/>Through combat, Fang Wang had completely adapted to the Vajra Invincible Saint Body!<br/><br/>The vast majority of spells couldn’t harm his physical body, and those aimed at the soul fared even worse, unable to penetrate his yang energy. The Vajra Invincible Saint Body was truly domineering!<br/><br/>Fighting across two major realm boundaries!<br/><br/>Well deserving of its great reputation even in The Upper Realm!<br/><br/>Fang Wang’s confidence grew as he fought; he had clearly grasped the strength of the Nirvana Realm and determined that today he would kill to establish his fear-inspiring name.<br/><br/>He intended to kill until the descendants of the Xuan Dynasty no longer dared to seek revenge against the Fang Family, and he even aimed to intimidate the backing Great Divine Dynasty!<br/><br/>He wanted to make the Great Divine Dynasty weigh the consequences of provoking Fang Wang for the sake of so-called face!<br/><br/>Fang Wang wanted their -consideration of the cost to grow, the greater the better!<br/><br/>With this thought, Fang Wang sped up again, swiftly moving through the ruins, slaying any cultivator who cast spells at him along the way.<br/><br/>Although Green Mountain Sage was of the Nirvana Realm, he wasn’t as fast as Fang Wang, and soon, he was once again within close reach of Fang Wang.<br/><br/>“Fang Wang! Cease your arrogance!”<br/><br/>Green Mountain Sage shouted angrily, masking the fear inside as he drew out a Green Jade Dust Brush and waved it quickly. The horsetail whisk stirred up a violent wind, countless green arrows raining down like a fierce storm engulfing Fang Wang; the momentum was massive, sweeping over dozens of miles and lifting dust hundreds of feet high.<br/><br/>Enveloped in yang energy flames, Fang Wang emerged from the green arrow rain, twisting his body and smashing his fist toward Green Mountain Sage.<br/><br/>Even though he was carrying Fang Jing, Fang Wang’s actions were unhindered, like a drawn bow. The Golden Scale White Feather Robe expanded, and just by looking at his posture, one could feel his overbearing power.<br/><br/>Faced with this punch, Green Mountain Sage instinctively raised his left arm to block, his left hand clutching a silver pearl which burst into dazzling bright light.<br/><br/>Just like before, Fang Wang’s fist was unstoppable, shattering the silver pearl then landing on Green Mountain Sage, who vomited blood and was sent flying, tearing through the dust waves in the air.<br/><br/>This scene plunged the surrounding cultivators from the Xuan Dynasty into despair.<br/><br/>“Who exactly is he… We are simply no match!”<br/><br/>“Relying solely on physical strength, he can counter so many of us… Heavenly<br/><br/>Dao… Could he truly be an Immortal among men?”<br/><br/>“Damn it, is it worth it just to please the Great Divine Dynasty?”<br/><br/>“The Emperor died right before our eyes, this is an unprecedented shame for the Xuan Dynasty. Forget those concerns, Tian Dao Fang Wang must die, otherwise how can the Xuan Dynasty intimidate the world?”<br/><br/>“Why haven’t the Thirteen Protecting Dynastic Sects come yet? Even the legendary Great Cultivator Green Mountain Sage of the Xuan Dynasty is no match for Fang Wang. How can we possibly fight him?”<br/><br/>While the Xuan Dynasty cultivators were in panic, the earth trembled mightily, and golden light curtains rose from the four corners of the world, quickly connecting, forming a huge grid with a length and width of a hundred miles. The golden light grid continually rose higher, piercing through the Sea of Thunderclouds.<br/><br/>An immense oppressive force descended, causing Fang Wang to stop in his tracks. He turned to look and saw four figures casting spells outside the golden light grid, unmistakably those four Nirvana Realm Great Cultivators from before.<br/><br/>All four were badly wounded, some with severed arms, others with pierced chests, faces bloodied, and the most severely injured now only an upper torso. And yet, they were still able to cast spells.<br/><br/>A look of madness appeared on their faces as surging Spiritual Power poured into the golden light grid, the Formation’s might increasing steadily.<br/><br/>Inside the Formation, the tens of thousands of Xuan Dynasty cultivators all felt unease, fearfully looking towards the Firmament.<br/><br/>‘What are you doing? Have you gone mad?”<br/><br/>Green Mountain Sage’s roar came from within the Formation as he emerged from the ruins, turned into a bloodied figure, looking extremely miserable.<br/><br/>Fang Wang glanced toward him, feeling slightly moved. Cultivators of the Nirvana Realm were indeed hard to kill.<br/><br/>Outside the Formation, the half-bodied Nirvana Realm Great Cultivator, with a ghastly face, yelled hoarsely, “He must die! He must die! If he survives, it will be an endless scourge. We can no longer care about the consequences!”<br/><br/>The other three shouted in unison, “Heavenly Exorcising Execution Array, begin!”<br/><br/>As their words fell, an unimaginable pressure descended from the sky. Fang Wang and the tens of thousands of Xuan Dynasty cultivators looked up to see the billowing thunderclouds scatter, countless meteors falling, varied in size, with the largest nearly taking up the entire interior of the Heavenly Exorcising Execution Array, close to a hundred miles in diameter.<br/><br/>In an instant, Fang Wang felt a mysterious suppressive force upon him, slowing the flow of Spiritual Power within his body.<br/><br/>Even with the Vajra Invincible Saint Body and Heavenly Dao True Skill, Fang Wang felt constrained, let alone other cultivators; most were already unable to move.<br/><br/>Like a madman, Green Mountain Sage rushed toward the edge of the Formation’s golden light curtain, but his speed was far slower than before, and the meteors from above were unbelievably fast.<br/><br/>Accompanied by the screams and shouts of tens of thousands of cultivators, countless meteors smashed down fiercely.<br/><br/>Boom! Boom! Boom…<br/><br/>Within the Heavenly Exorcising Execution Array, dust clouds rose, filling the entire space, as if a terrifying demon were trying to break free from its shackles.<br/><br/>The whole continent trembled, and even the common people still fleeing and the cultivators on their way to help could hear those terrifying roars. Looking around, the mountains and rivers, lakes, and streams they were near all quaked violently.<br/><br/>The group from the Jin Xiao Sect also heard the terrifying rumblings, despite being ten thousand miles away from the Imperial City.<br/><br/>“What’s going on?”<br/><br/>“It’s coming from the direction of the Imperial City…”<br/><br/>“What kind of force is this?”<br/><br/>“Hiss… Could Tian Dao Fang Wang alone cause such an impact?”<br/><br/>Jin Xiao Sect Cultivators were continuously alarmed and terrified at heart.<br/><br/>Even the Demon Monarch, shrouded in demonic aura at the forefront, couldn’t help but turn to look in the direction of the Imperial City; her eyes flickered with an unknown light, pondering something.<br/><br/>The Heavenly Exorcising Execution Array lasted for the duration of half a cup of tea. The entire Imperial City sank hundreds of feet into the ground; beyond the Formation, everywhere was cliff breaks, collapsing mountains, and a scene of complete disarray stretching for ten thousand miles. The heavens and the earth were covered in dust, dim and oppressive.<br/><br/>Four Nirvana Realm Great Cultivators floated in the air; they were panting heavily, their bodies trembling. It was evident that the activation of the Formation had exhausted all their Spiritual Power.<br/><br/>Their eyes were filled with bloodshot lines. The deployment of this Array squeezed not only their bodies but also filled their hearts with pressure, because they knew that after this battle, they would bear the infamy of atrocious crimes.<br/><br/>The entire Xuan Dynasty suffered from the repercussions of this Array. Cities far away were unharmed due to their Protective City Formations, but the mountains and rivers outside the cities were riddled with cracks.<br/><br/>The terrifying impact of the Heavenly Exorcising Execution Array even caused the edges of the continent to surge with shock waves and tsunamis, displaying the strength of the Array.<br/><br/>A gust of wind blew past, scattering the dust outside of the Heavenly Exorcising Execution Array, revealing its shape. Inside the golden light screen, everything was rock due to the intense and continuous collisions that had compressed countless stones together, forming a mountain. The mountain was a hundred miles wide and its height was incalculable, piercing through the clouds with no visible peak.<br/><br/>Even some crevices at the bottom of the mountain were still oozing blood.<br/><br/>Silence!<br/><br/>Oppression!<br/><br/>Seeing this scene, the four Nirvana Realm Great Cultivators showed smiles on their faces, all letting out a sigh of relief.<br/><br/>Despite the tremendous cost, they had finally sealed Fang Wang!<br/><br/>Boom—<br/><br/>At that moment, the meteoric mountain within the golden light screen began to tremble, and from the cracks on the mountain’s surface, threads of<br/><br/>Yang-energy flames leaked out, startling the four Nirvana Realm Great Cultivators as their eyes widened in disbelief.<br/><br/>“Impossible!” “He… how could he…”<br/><br/>“How can this be…”<br/><br/>Three of them spoke with trembling voices, their faces filled with shock and despair. The fourth, sensing things were turning sour, turned and fled.<br/><br/>With a thunderous roar that shook heaven and earth, the meteoric mountain burst apart, and with it, the Heavenly Exorcising Execution Array was also shattered. The fierce wind howled in all directions; debris flew violently, as if the apocalypse had arrived, devastating everything.<br/><br/>Countless stones fell, revealing the figure of Fang Wang holding the Rainbow Sword in his right hand. The Yang-energy flames soared a thousand feet high, and floating above his head was a vast and immense seal.<br/><br/>The Six Harmonies and Eight Desolations Seal!<br/><br/>Behind Fang Wang, spectral figures condensed. As he raised the Rainbow Sword, the ghosts did likewise, and a powerful suction force erupted, drawing the wind towards the ghost. It was absorbing the souls present here.<br/><br/>The Heavenly Exorcising Execution Array had claimed the lives of tens of thousands of Cultivators, all elites of the Xuan Dynasty, including True Person Green Mountain who had also been sealed here.<br/><br/>Fang Wang could see their souls, with True Person Green Mountain wearing an expression full of resentment.<br/><br/>Xiao Zi cautiously opened her eyes and seeing herself unharmed, she let out a sigh of relief.<br/><br/>Fang Jing also looked up, just in time to see the spectral figure’s form, which flashed with a strange glint in his eyes.<br/><br/>At this moment, the ghost raising its sword deeply imprinted itself in his heart, an image never to be forgotten.<br/><br/>Fang Wang suddenly sheathed his sword and vanished into thin air.<br/><br/>He swiftly pursued one of the Nirvana Realm Great Cultivators; the four of them were exhausted from setting up the Formation, their speed greatly reduced.<br/><br/>Fang Wang caught up and with one strike of the sword eliminated the physical body and absorbed the soul!<br/><br/>One breath, one sword strike, slaying a Nirvana being!<br/><br/>After four breaths, all four Nirvana Realm Great Cultivators had fallen!<br/><br/>Fang Wang also plundered their Storage Rings, stuffing them all into his belt.<br/><br/>He lifted his sword and flew in a certain direction. To resist the earlier<br/><br/>Heavenly Exorcising Execution Array, he had used up a third of his Spiritual<br/><br/>Power. After cultivating the Great Celestial Infinite Scripture, his Spiritual Power was a thousand times what it had been before; this showed the strength of the Array. Had it not been for the Great Celestial Infinite Scripture, if he had withstood the force with his physical body, even if he had endured, he would have been injured.<br/><br/>Numerous stones flew in all directions, igniting flames due to their high velocity rubbing against the air. The scene was spectacular. One could hardly count how many meteors were falling.<br/><br/>Fang Wang outpaced each meteor, flying towards the sea.<br/><br/>However, before he had flown far, powerful presences approached from ahead.<br/><br/>Nirvana Realm!<br/><br/>Fang Wang slightly furrowed his brow, sensing the breath of at least twenty Nirvana Realm beings. Moreover, there were plenty more Cultivator presences following behind the Nirvana Realm Great Cultivators, far surpassing the number of enemies he had previously faced in the Imperial City.<br/><br/>The real fierce battle was about to begin!<br/><br/>Fang Wang slowed down, and the Heavenly Dao Imperial Dragon Crown flowed with divine light, infusing the reserved Spiritual Power into his body.<br/><br/>Fang Jing looked up at Fang Wang, asking softly, “Uncle, are you alright?”<br/><br/>Fang Wang glanced at him, his sharp gaze instantly softening. He showed a smile and said, “These small fries haven’t given your uncle much trouble yet.”<br/><br/>Fang Jing was touched by his smile and broke into one as well. It was then that he truly appeared like an eight-year-old boy, smiling innocently..\t\t\t\t\t\t</div>", "images": {}, "success": true}