{"id": 183, "url": "https://www.novelhall.com/i-became-an-immortal-on-mortal-realm-32879/14312530.html", "title": "Chapter 183 - Chapter 183: Chapter 180 Xu Qjuming’S Shock, Fang Jing’S Thoughts", "volume": 2, "volume_title": "Volume 2", "body": "<h1>Chapter 183 - Chapter 183: Chapter 180 Xu Qjuming’S Shock, Fang Jing’S Thoughts</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 183: Chapter 180 Xu Qjuming’s Shock, Fang Jing’s Thoughts<br/><br/>Translator: 549690339<br/><br/>Dark clouds obscured the sky, with distant rumbles of thunder, and a drizzle fell, sprinkling over an expansive island with undulating mountains where beastly birds could be seen sweeping through the air.<br/><br/>Several cities adorned the island.<br/><br/>In one of the cities surrounded by green hills, bustling streets were filled with cultivators, some clad in straw raincoats, others using magic artifacts to avoid the rain, seemingly unaffected.<br/><br/>Down a narrow alley, a man dressed in black held a paper umbrella as he descended along the mossy stone steps. A treasured sword was attached to his waist, its sheath turning rainwater into steam upon contact, which then evaporated into wisps of white vapor.<br/><br/>He made his way to an overhang and gently knocked on the door, from which an elderly voice responded, “Who is knocking?”<br/><br/>“Xu Qiuming.”<br/><br/>The man under the paper umbrella spoke, revealing himself to be Xu Qiuming.<br/><br/>Having left Grand Qi for many years, Xu Qiuming’s appearance hadn’t changed much. Although he had grown taller, he still resembled a sixteen- or seventeen-year-old boy, but his eyes were sharp, full of spirit and vitality.<br/><br/>As his voice faded, the door opened, and Xu Qiuming stepped inside.<br/><br/>The room was a bright hall where many cultivators gathered, some examining treasures, others holding secret tomes, and yet some seated opposite each other drinking. It was only after he advanced seven steps that the clamor of voices reached him.<br/><br/>The door closed on its own as Xu Qiuming entered the hall. The interior was sectioned into various areas, with bookshelves lining the walls and a square redwood table in the center where two elderly cultivators were busy with accounts.<br/><br/>At first glance, it did not seem like a gathering place for cultivators, but rather a hidden sanctuary for people from the Jianghu.<br/><br/>Xu Qiuming approached the table and looked towards the elder in front, asking, “Any news on the item I’m looking for?”<br/><br/>The elder, dressed in plain clothes with a red nose and bleary eyes, appeared to be inebriated. He glanced at Xu Qiuming and said, “It’s you again. How could it be so quick? You’re looking for a magical artifact, a sword no less. It’s hard to come by. Just wait. I’ve already passed your request to those above. The Demon Monarch values you highly; he will find it sooner or later.”<br/><br/>Xu Qiuming nodded and replied, “I will not forget the Demon Monarch’s favor.<br/><br/>By the way, how are things in Emperor Sea? When are they returning?”<br/><br/>When Fang Xun was killed, many Jin Xiao Sect cultivators died as well, causing an uproar within the sect. Everyone in the sect was thrilled with the Demon Monarch leading the Great Cultivators of Jin Xiao Sect to Emperor Sea to avenge their grievances against the Xuan Dynasty.<br/><br/>They had joined Jin Xiao Sect precisely because of its fierce reputation.<br/><br/>Fearless of heaven and earth, and always avenging any slight against them!<br/><br/>Having heard this news, Xu Qiuming had been paying close attention. He was not focused on the Demon Monarch but on Fang Wang. Fang Wang’s name was quite renowned within the Jin Xiao Sect. He was the betrothed of the Demon Monarch’s sole disciple and had made a reputation for himself at sea. For the members of Jin Xiao Sect, Fang Wang was one of their own.<br/><br/>After the death of Fang Xun, the relationship between Xu Qiuming and Fang Wang became known, and everyone within the sect was curious about what Fang Wang would do.<br/><br/>Xu Qiuming believed that Fang Wang would definitely take action, but the Emperor Sea Mysterious Dynasty was just too far away. An ordinary cultivator could not reach it in their lifetime.<br/><br/>Upon hearing this, the elder in plain clothes suddenly widened his bloodshot eyes. He picked up the jug from the table, downed it in one gulp, wiped his mouth, and laughed, “Smoothly, extremely smoothly!”<br/><br/>“Hahaha, the Xuan Dynasty is doomed!”<br/><br/>Loud laughter echoed as a man approached, holding a jug of wine. Hearing Xu Qiuming speak of Emperor Sea, other cultivators gathered around.<br/><br/>“Tian Dao Fang Wang has taken action, cutting through Xuan Dynasty. I think Xuan Dynasty is going to collapse.”<br/><br/>“Fang Wang is one of our own, right? He even saved Ye Canghai before. His move is equivalent to Jin Xiao Sect taking action.”<br/><br/>“It’s incredible. Though we have talked about it more than once, I still get excited thinking about it. How did he do it?”<br/><br/>“Xu Qiuming, didn’t you say you also come from Grand Qi? You even said Fang<br/><br/>Wang is your savior. Tell us, what kind of existence is Fang Wang?<br/><br/>“Fang Wang is not even two hundred years old, is that true? If this gets out, the so-called Southern Celestial Four Heroes would become a joke.”<br/><br/>Hearing that Fang Wang had cut through the Xuan Dynasty, Xu Qiuming immediately grabbed the man and asked what exactly happened. The crowd started to talk over each other, becoming increasingly excited.<br/><br/>As he listened, Xu Qiuming became dumbfounded.<br/><br/>This wasn’t the first time he was astounded by Fang Wang’s feats, but now, hearing about Fang Wang’s terrifying record in Emperor Sea, he felt the shock anew.<br/><br/>He couldn’t understand, how did Fang Wang do it?<br/><br/>Among the group of Xuan Dynasty cultivators who had executed Fang Xun, there were several Mahayana. They fought so fiercely that even the Vice Hierarch of Jin Xiao Sect was gravely wounded. That surely was not the full strength of Xuan Dynasty. Fang Wang had single-handedly stormed into the Xuan Dynasty Imperial Palace, and he managed to make cultivators in the Xuan Dynasty Cultivation World beg for mercy?<br/><br/>Could there be a realm higher than Mahayana?<br/><br/>But even if there was, how strong would Fang Wang have to be to massacre Xuan Dynasty?<br/><br/>When Xu Qiuming first heard about the Mahayana Realm, he was excited, feeling that he had finally entered the Cultivation World. But in just a few years, the Mahayana Realm seemed like nothing in front of Fang Wang…<br/><br/>Observing Xu Qiuming stunned, many couldn’t help but smile; this genius of the sect, who had been gaining momentum, had finally been taken aback.<br/><br/>Xu Qiuming joined Jin Xiao Sect less than twenty years ago, yet with his self-created Sword Dao, he had won the Demon Monarch’s favor. With the ability of the Cross-Void Realm, he challenged a Great Cultivator of the Golden Body Realm and managed to last half an hour before defeat, a battle that spread his fame throughout the sect.<br/><br/>The higher the realm, the greater the disparity in each major tier. For most cultivators, the ninth layer of Cross-Void Realm had basically no chance against the first layer of Golden Body Realm. Xu Qiuming, at the fourth layer of Cross-Void Realm, managed to clash with a Great Cultivator of Golden Body Realm, and the battle left a profound impact on all the sect’s cultivators.<br/><br/>After a while, Xu Qiuming came back to his senses; he took a deep breath and immediately turned to leave.<br/><br/>Other cultivators called out to him, but he didn’t look back.<br/><br/>Some of the older cultivators showed a look of concern; they feared Xu Qiuming might be traumatized. The Jin Xiao Sect was still in its growing phase, and a genius like Xu Qiuming represented the future of the sect — naturally, they didn’t wish for him to die young or develop psychological barriers.<br/><br/>Fang Wang’s exploits in the Xuan Dynasty had not only spread within the Jin Xiao Sect but had also gone wild in the Eternal Life Pavilion; they even began to reach other major sects in the Southern Celestial Sea, but not to the Cultivation World where there were barriers to information – Ants are unaware of the eagles’ struggle.<br/><br/>Above the vast mountains where dust filled the air, countless cultivators hovered in midair or stood atop the forest peaks, all looking in the same direction – towards a stretch of open land with no trees for several miles, offering a clear view.<br/><br/>A man in a purple robe stood frozen in place, his eyes wide and his body trembling, with cold sweat covering his face. His robe was embroidered with a qilin, oh so imposing, but his current posture seemed fragile and humble.<br/><br/>In his eyes, the reflection of a fist could be seen.<br/><br/>This fist was halted right in front of his face, less than twenty centimeters away, and beyond his head in the distance, a large mountain a few miles away had been pierced through, creating a huge hole dust swirling and rubble still cascading down.<br/><br/>The owner of this fist was none other than Fang Wang.<br/><br/>Fang Wang was wearing a straw hat, dressed in white, leading Fang Jing with his left hand, while his right fist stopped in front of the man in the purple robe. Xiao Zi lay on Fang Wang’s shoulder, constantly flicking her tongue and bobbing her head as she stared at the man in the purple robe.<br/><br/>Fang Jing’s hair was tousled by the wind; his eyes widened and his mouth opened unconsciously, now looking at the man in the purple robe, now at Fang Wang.<br/><br/>He had been cultivating the Heavenly Dao True Skill for half a year and had gained some understanding of Spiritual Power; he was no longer the naive boy he once was.<br/><br/>When the man in the purple robe attacked, the momentum had terrified him, inciting an instinctual fear.<br/><br/>However, the man in the purple robe, who once seemed invincible and possessed of divine might, was now scared witless by Fang Wang’s single punch, standing petrified on the ground, trembling uncontrollably.<br/><br/>Fang Wang’s right fist slowly pushed forward, but the man in the purple robe was so frightened that he immediately knelt down, his forehead touching the ground as he said with a quivering voice, “Heavenly Dao senior… I was wrong!”<br/><br/>Whoosh—<br/><br/>The tens of thousands of spectator cultivators erupted into an uproar; they hadn’t expected the man in the purple robe to capitulate.<br/><br/>This man in a purple robe was a cultivator of the eighth level of the Mahayana Realm, having lived over nine hundred years. It was his prestige and cultivation that had drawn them to join forces in the pursuit against Fang Wang.<br/><br/>Fang Wang looked down at him and asked, “Don’t you know that five Nirvana<br/><br/>Realm cultivators died before in the imperial city of the Xuan Dynasty?”<br/><br/>Over the past half year, he had swept through over thirty sects, clans, and islands; no one was his match, nearly all defeated in a single move. He came across cowards and, also hard nuts who would not bear to beg for mercy even in death – but he never killed any of them.<br/><br/>He had already killed too much in the Xuan Dynasty before, there was no need to kill anymore. Continuing to kill would only set him and Emperor Sea as sworn enemies, which would be detrimental.<br/><br/>By not killing but only defeating them now, he could potentially cause the various forces of Emperor Sea to resent the Xuan Dynasty for provoking him in the first place.<br/><br/>The man in the purple robe looked up, panic-stricken, “I didn’t know… The Xuan Dynasty didn’t say; they only mentioned that you slaughtered over two million cultivators and were abhorred by both humans and gods. How hateful, the Xuan Dynasty actually harbors ill intentions!”<br/><br/>Fang Wang’s expression remained unchanged as he said, “So, do you submit now?”<br/><br/>“I submit! I do! Senior, please give me a chance… I’ll certainly help you expose the evil deeds of the Xuan Dynasty. It was the Xuan Dynasty who was at fault from the beginning, yet despite witnessing your strength, they still commanded us to entangle with you — their hearts are deserving of punishment!” the man in the purple robe pleaded excitedly.<br/><br/>Those cultivators who were watching the fight all had high cultivation levels and superior hearing; they heard the conversation between Fang Wang and the man and began discussing among themselves.<br/><br/>Had the Xuan Dynasty really concealed such crucial information? What were their intentions?<br/><br/>To send them to their deaths?<br/><br/>Fang Wang withdrew his fist and then, leading Fang Jing, moved forward, brushing past the man in the purple robe.<br/><br/>Fang Jing looked back at the man in the purple robe, who happened to look up at Fang Jing at the same moment.<br/><br/>Confronted with the boy, the man in the purple robe forced a smile, his expression trying to appear kind and friendly, causing Fang Jing to pause in confusion.<br/><br/>During the year he was taken to the Xuan Dynasty Imperial Palace, he had seen too many hideous faces – even the middle-aged Palace Maiden who took care of him occasionally couldn’t contain her emotions and complained about his father.<br/><br/>Now, following his great uncle, no one dared to show him indifference, even with their backs to his great uncle.<br/><br/>Gradually, a seed began to grow in Fang Jing’s heart.<br/><br/>In just a few steps, Fang Wang ascended into the sky, the cultivators in front making way for him without dare to obstruct, and some even bowed to pay their respects to Fang Wang.<br/><br/>Xiao Zi looked at Fang Jing and saw him deep in thought, so she asked, “What are you thinking?”<br/><br/>Fang Jing replied, “I’m thinking of Auntie Qi who looked after me in the palace. I don’t know her current situation, whether she’s dead or alive…<br/><br/>Xiao Zi blinked and said, “In the palace, you were too scared to open your eyes and didn’t see, but I saw that the young master used his punch to send her out of the battlefield. Although I don’t know what happened after she landed, with the young master’s capability, if he didn’t want to kill her, she naturally wouldn’t die. Whether she can avoid the Xuan Dynasty’s punishment depends on her own fate; we can’t possibly take her with us..”\t\t\t\t\t\t</div>", "images": {}, "success": true}