{"id": 187, "url": "https://www.novelhall.com/i-became-an-immortal-on-mortal-realm-32879/14313807.html", "title": "Chapter 187 - Chapter 187: Chapter 184: Fight With All Might, The Youth Are To Be Feared", "volume": 2, "volume_title": "Volume 2", "body": "<h1>Chapter 187 - Chapter 187: Chapter 184: Fight With All Might, The Youth Are To Be Feared</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 187: Chapter 184: Fight with All Might, The Youth are to be Feared<br/><br/>Translator: 549690339<br/><br/>Hearing Fang Wang’s words, the Hongxuan Emperor did not get angry; instead, he laughed even louder. He immediately charged at Fang Wang with his halberd, with a thousand clones moving in unison to besiege him.<br/><br/>Lacking ranged spells and equipped only with close combat techniques, Fang Wang fought alone against the thousand Hongxuan Emperor clones, moving so fast that afterimages appeared, but within three breaths’ time, he began to falter and sustain injuries.<br/><br/>Although the Combat Heart allowed him to fight with all his might, the overwhelming number of enemies, each with formidable strength, was naturally too much for him to withstand.<br/><br/>The clones of the Hongxuan Emperor were not only as powerful as the original, but they also possessed the ability to anticipate his moves, which was quite domineering.<br/><br/>Fang Wang finally felt the pressure, truly worthy of being an ancient powerhouse who established the Imperial Dao!<br/><br/>Even so, he still refused to use the Executioner Immortal Ghost God Sword, wanting to relish the sensation of his physical body being struck.<br/><br/>This Illusionarv Realm was wonderful, giving him the feelinz of a real battle.<br/><br/>However, since he had mastered the Great Perfection Jiuyou Zizaishu, he could sense that this was not reality, but only a close semblance; if he were to activate Jiuyou Zizaishu, he could perceive the existence of his actual physical body.<br/><br/>The thousand clones took turns assaulting Fang Wang, catching him off guard, yet the Hongxuan Emperor did not take him lightly, instead becoming more cautious.<br/><br/>“What’s happening, what kind of physique is this?”<br/><br/>The Hongxuan Emperor was inwardly shocked; something suddenly occurred to him, causing his pupils to constrict.<br/><br/>While swiftly swinging his Single -Edged Halberd, he asked, “Have you cultivated the Vajra Invincible Saint Body?”<br/><br/>Fang Wang stopped resisting, letting the Hongxuan Emperor’s attacks batter his body, and said with a light chuckle, “That’s right!”<br/><br/>The Hongxuan Emperor’s fists and feet could not harm him at all. The bladed weapons could pierce his skin—probably high-grade Magical Artifacts—but even so, his injuries healed rapidly.<br/><br/>The mysteries of the Heavenly Body!<br/><br/>The Heavenly Body of Yang Du was known as the undying physique!<br/><br/>Although Fang Wang was not a congenital Heavenly Body, he had trained the Heavenly Gang Saint Body Technique to Great Perfection, not inferior to the innate Heavenly Body, even stronger, in fact!<br/><br/>Seeing his self-healing speed, the Hongxuan Emperor was secretly alarmed; he did not think much about it, since he didn’t know much about the Vajra Invincible Saint Body.<br/><br/>The stronger Fang Wang was, the more excited the Hongxuan Emperor became.<br/><br/>It had been a long time since he had a fight that was so thoroughly invigorating!<br/><br/>“Come on, Fang Wang, show me your full strength!”<br/><br/>The Hongxuan Emperor laughed loudly, leaping into the air to a height of tens of thousands of feet. The thousand clones flew toward him, ascending like a rain of arrows, spectacular beyond compare.<br/><br/>Fang Wang looked up, sensing that the Hongxuan Emperor was gathering momentum. He did not intervene; instead, he released the Heavenly Palace Halberd and condensed the Rainbow Sword.<br/><br/>In an instant, a ghostly divine figure appeared behind him. After the battle with the Xuan Dynasty and the absorption of more than two million lost souls, the ghostly figure was even more terrifying, standing three hundred feet tall with a sword that seemed to hang in the sky like the Celestial Trench.<br/><br/>The thousand clones landed behind the Hongxuan Emperor, who burst forth with immense Spiritual Power. Among the clones, an enormous figure materialized, unmistakably the Hongxuan Emperor himself, but vastly different in appearance, transformed into a being with three heads and eighteen arms, each arm wielding a Single-Edged Halberd, dazzling as if he were a thousand-armed Buddha.<br/><br/>This figure stood over a thousand feet tall, as if it could reach up and break through the Firmament!<br/><br/>The ghostly figure behind Fang Wang seemed to sense a threat, emitting a crazed roar towards the Firmament.<br/><br/>Without consciousness, the ghostly figure’s reactions represented what was in Fang Wang’s heart.<br/><br/>Facing the Hongxuan Emperor’s thousand-foot figure, Fang Wang was excited; this was the exhilarating feeling of meeting his match.<br/><br/>Fang Wang revealed a smile, his black hair flowing wildly. He smiled audaciously and arrogantly as he prepared to unleash his strongest sword strike!<br/><br/>The Executioner Immortal Ghost God Sword versus the Heavenly Emperor Imperial Mirror!<br/><br/>Clouds gathered densely overhead, and a light drizzle fell, sprinkling on Emperor’s Tomb Island.<br/><br/>Inside the valley, the column of light above the altar had not dissipated.<br/><br/>Dugu Wenhun emerged from it, his entire demeanor dejected, his face filled with disappointment.<br/><br/>The Three Immortals of the Emperor Sea opened their eyes to look at him, and seeing his expression, they teased him in turn.<br/><br/>“Youngster Dugu, don’t be disappointed; after all, no one can pass the trial of the Hongxuan Emperor.”<br/><br/>“Indeed, unless someone more talented than the Hongxuan Emperor himself appears, that kid just now is probably out of luck.”<br/><br/>“Exactly, the Hongxuan Emperor is an existence even more formidable than a Great Saint.”<br/><br/>Listening to the words of The Three Immortals of the Emperor Sea, Dugu Wenhun let out a wry smile, his gaze then fell upon Xiao Zi who was lying on a rock, flickering its tongue out at him.<br/><br/>Dugu Wenhun didn’t notice Fang Wang; his expression complex.<br/><br/>He took a deep breath and turned to The Three Immortals of the Emperor Sea, asking, “During the two hundred years I was absent, has no one come to undertake the trial?”<br/><br/>The Three Immortals of the Emperor Sea answered immediately.<br/><br/>“It’s hard to say; we were asleep.”<br/><br/>“Who could sneak in while we were sleeping? And besides, they would also need to research how to activate this formation.”<br/><br/>Hearing their responses, Dugu Wenhun felt a bit more at ease.<br/><br/>Xiao Zi inquired curiously, “Hey, Dugu Wenhun, when you went inside, did you also challenge the Hongxuan Emperor of your own realm all by yourself?”<br/><br/>Dugu Wenhun looked at it and nodded, “That’s right, the Mahayana Realm Hongxuan Emperor was just too strong…”<br/><br/>He was visibly scared just thinking about the battle previously.<br/><br/>In the Southern Celestial Sea, he could be considered a top-tier talent, but facing an ancient colossus like the Hongxuan Emperor, he truly felt his mediocrity.<br/><br/>The world is vast, and the Southern Celestial Sea is merely a part of the Mortal Realm. Through the long passage of time, having one individual remembered through the ages is challenging enough, let alone someone as dazzling in history as the Hongxuan Emperor. Compared with him, Dugu Wenhun felt as inconsequential as a sparrow next to a Phoenix.<br/><br/>Xiao Zi muttered, “How bizarre, the young master hasn’t come out—I can understand that—but why hasn’t Fang Jing come out yet? Surely he isn’t also facing the Hongxuan Emperor of the same realm?”<br/><br/>At these words, Dugu Wenhun stood stunned, as did The Three Immortals of the Emperor Sea.<br/><br/>“Eh? That child hasn’t yet undergone Spiritual Refinement, if the Hongxuan<br/><br/>Emperor were to fight him with the cultivation of the Qi Refining Realm…”<br/><br/>“So that’s how it is, no wonder there are so many powerful prohibitions around Emperor’s Tomb Island, it’s to prevent those of lower realms from entering. The higher the realm, the stronger the Hongxuan Emperor one faces. Looking at it this way, wasn’t that child actually the most likely to succeed?”<br/><br/>“How could that be possible? Even if the Hongxuan Emperor suppressed his cultivation to the Qi Refining Realm, he would still be no match for that child, unless the Hongxuan Emperor manifested himself in the state of his own childhood.”<br/><br/>The Three Immortals of the Emperor Sea began to argue, and Dugu Wenhun’s expression turned fascinating.<br/><br/>He felt an inexplicable uneasiness in his heart.<br/><br/>Xiao Zi thought the same, although Fang Jing hadn’t undergone Spiritual Refinement, he practiced the prince’s Heavenly Dao True Skill and the Nine Dragons Tyrant Fist.<br/><br/>The waves churned incessantly, furiously terrifying, as strands of sunlight pierced through the rolling dark clouds and showered down.<br/><br/>Fang Wang and the Hongxuan Emperor floated in the high sky, both gasping for air, faces showing fatigue.<br/><br/>The Hongxuan Emperor’s forehead was covered in cold sweat, but he was still smiling, a smile of excitement. He stared intently at Fang Wang, sighing, “Youth is to be feared, youth is indeed to be feared.”<br/><br/>Fang Wang held the Rainbow Sword in one hand and the Heavenly Palace Halberd in the other; the Six Harmonies and Eight Desolations Seal hovered above his right shoulder, and the Reincarnation Bell floated above his left. Five Lifespirit Treasures emerged, the bloodstains on his face quickly scabbing over and the spots of blood thereafter falling off.<br/><br/>This battle, he had truly given his all.<br/><br/>Only the Jiuyou Zizaishu had he not used.<br/><br/>Fang Wang spoke, “Thanks for going easy. However, I understand that this is far from your true strength. Many powerful spells and Divine Skills, those should be unusable by the Mahayana Realm, right?”<br/><br/>Indeed, the Heavenly Emperor Imperial Mirror was powerful, but he could feel that during the fight, the Hongxuan Emperor instinctively used many useless moves, gestures guided by habit.<br/><br/>The Hongxuan Emperor laughed heartily, “Loss is loss.”<br/><br/>He swept his sleeve fiercely, and suddenly, the world spun around. Shortly after, Fang Wang found himself back in the valley.<br/><br/>The sunlight was bright, and he was still on the sacrificial altar, his body’s injuries and fatigue having vanished, as if he had never experienced the prior battle.<br/><br/>The Hongxuan Emperor was gone, only the Golden-haired Monkey stood before him.<br/><br/>Fang Wang asked, “Are you really the Hongxuan Emperor?”<br/><br/>The Hongxuan Emperor was a famous powerhouse of the human race, how could he be a monkey?<br/><br/>The Golden -haired Monkey crossed its arms and laughed heartily, “Only you would not be fooled by me. Fine, I admit it, I’m not the real Hongxuan Emperor. I’m just one-thousandth of a remnant soul. The true self has thousands of faces and forms, all kinds of appearances.”<br/><br/>Fang Wang narrowed his eyes, asking, “Then may I ask, are other remnant souls of the Hongxuan Emperor also left in the Mortal Realm?”<br/><br/>The Golden-haired Monkey chuckled, “That I can’t tell you. Of course, I actually don’t know either. After all, I am not the true self. I am just a substitute for the true self to suffer, suppressed here, unable to see the outside world, nor communicate with other remnant souls.” “Then, are those words you said before true?”<br/><br/>“What do you think?”<br/><br/>Fang Wang suppressed the urge to strike again, doing his best to calm his emotions.<br/><br/>The Golden-haired Monkey said with a mocking smile, “The seventh time you came, you shared some words that whether destiny exists depends on one’s own heart. If you believe it does, then it exists; if you don’t, then it doesn’t. Regardless of its existence, you need only strive with all your might to become strong—that would be the best outcome.”<br/><br/>Fang Wang said calmly, “He failed, didn’t he?”<br/><br/>The Golden-haired Monkey neither agreed nor disagreed.<br/><br/>“Teach me the Heavenly Emperor Imperial Mirror,” Fang Wang requested.<br/><br/>The Golden-haired Monkey nodded and said, “Then listen carefully, I will only say it once.”<br/><br/>Fang Wang sat down on the altar, listening attentively as it began to recite.<br/><br/>“Connect to Purple Subtlety above and Jiu You below. He who is above all beings is an emperor; the one above all methods is the Imperial Dao. Focus your mind, plant the seed of wisdom, think of heaven and earth…” The voice of the Golden-haired Monkey meandered through the air.<br/><br/>This explanation lasted for two hours.<br/><br/>A full two hours, and that was just one iteration—it indicated just how vast the mental method of the Heavenly Emperor Imperial Mirror was.<br/><br/>After listening, Fang Wang closed his eyes to recall and memorize the teaching.<br/><br/>The Golden-haired Monkey teased, “The eighth time you came, you remembered after hearing it once. Surely you won’t do worse this time, will you?”<br/><br/>No sooner had its voice faded than Fang Wang felt the world spinning around him.<br/><br/>He abruptly opened his eyes to find himself in the Heavenly Palace.<br/><br/>The Heavenly Emperor Imperial Mirror was real!<br/><br/>Seeing this, the Golden-haired Monkey seemed not as deceitful as it had appeared.<br/><br/>Perhaps its words could be trusted.<br/><br/>If its words were true, it also meant that Fang Wang might have already died eight times.<br/><br/>Fang Wang wasn’t frightened; instead, he felt more firm in his resolve.<br/><br/>Perhaps his failure was due to ascending too early or provoking the Upper Realm.<br/><br/>He didn’t believe that if he fused all the peerless Cultivation Techniques of the Mortal Realm, he wouldn’t be able to break free from fate! Now, he would start with the Heavenly Emperor Imperial Mirror!\t\t\t\t\t\t</div>", "images": {}, "success": true}