{"id": 184, "url": "https://www.novelhall.com/i-became-an-immortal-on-mortal-realm-32879/14313065.html", "title": "Chapter 184 - Chapter 184: Chapter 181: Hongxuan Emperor, Lü Xianming", "volume": 2, "volume_title": "Volume 2", "body": "<h1>Chapter 184 - Chapter 184: Chapter 181: Hongxuan Emperor, Lü Xianming</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 184: Chapter 181: Hongxuan Emperor, Lü Xianming<br/><br/>Translator: 549690339<br/><br/>The waves slapped against the desk, crashing onto the rocks like shattering crystals.<br/><br/>A youth in white stood atop a rock, facing the sea, ceaselessly throwing punches—it was Fang Jing.<br/><br/>Another year had passed, Fang Jing was nearly ten, and compared to his time at the Xuan Dynasty Imperial Palace, he seemed like a different person. He now had the air of a young man, and although his face was covered with sweat, his eyes were resolute, and he brimmed with vitality.<br/><br/>Not far away, Fang Wang lay on the beach sunbathing, still using the Fox Mask to hide his face. He appeared to be sleeping, but in reality, he was pondering how to integrate all his swordsmanship.<br/><br/>Xiao Zi, looking at Fang Jing’s small figure practicing punches, exclaimed, “Young Master, how does this boy’s talent keep growing?<br/><br/>It watched Fang Jing from the start of his cultivation—he was initially mediocre, but gradually, his natural talent seemed to improve. This feeling was strange, yet it truly felt that way.<br/><br/>Shouldn’t talent be fixed from birth?<br/><br/>Xiao Zi couldn’t understand, but Fang Jing’s increasing talent was good news for the Young Master.<br/><br/>Zhu Yan, Yang Du, Chu Yin—each was a once-in-a-millennium genius. Now adding Fang Jing to the mix, when these four became renowned across the world, what would the Young Master’s status be then?<br/><br/>Fang Wang didn’t join the conversation, focusing on his own thoughts.<br/><br/>It wasn’t until dusk trespassed that Fang Jing finally ceased his punches and began to sit and gather Qi, without the need for Fang Wang or Xiao Zi to prompt him. He didn’t feel tired; in fact, he thought his cultivation speed was too slow.<br/><br/>Fang Jing practiced the Heavenly Dao True Skill and Nine Dragons Tyrant Fist daily because both techniques were so profound, he always felt his aptitude was insufficient, prompting him to redouble his efforts.<br/><br/>The path that Fang Wang set for Fang Jing was these two Cultivation Techniques, and he had instructed him to practice only these two divine skills in his lifetime.<br/><br/>Learning much didn’t necessarily mean strength, but if he could bring the Heavenly Dao True Skill and Nine Dragons Tyrant Fist to Great Completion, Fang Jing would be qualified to roam the world freely.<br/><br/>The night passed.<br/><br/>As the sun rose in the east, Fang Jing stood up again, throwing punches towards the sea with more power than the day before. His posture bore an air reminiscent of Fang Wang, almost like looking at a younger Fang Wang, which made Xiao Zi feel nostalgic.<br/><br/>Close to noon, a figure skimmed over from the horizon, drawing Fang Jing’s attention, but he didn’t stop punching.<br/><br/>Xiao Zi and Zhao Zhen, however, became alert. Xiao Zi slithered over to Fang Wang’s side, rubbing its snake head against Fang Wang’s waist.<br/><br/>The figure swiftly flew into the island, keeping an appropriate distance as it passed by Fang Jing.<br/><br/>Fang Jing turned his head to look at the figure, full of curiosity.<br/><br/>Dugu Wenhun landed on the beach and walked toward Fang Wang, smiling as he said, “Brother Fang, you really made me search hard for you.”<br/><br/>Xiao Zi remembered him from the time they passed through the Eternal Life Pavilion’s teleportation formation; Dugu Wenhun had been in that cavern.<br/><br/>Seeing that the newcomer was a cultivator from the Eternal Life Pavilion, Xiao Zi relaxed.<br/><br/>Xiao Zi asked, “Who are you? State your name.”<br/><br/>Dugu Wenhun replied with a laugh, “I am Dugu Wenhun. Although I am not a part of the Eternal Life Pavilion, I am on good terms with them. Brother Fang, you are truly formidable, wreaking havoc on the Xuan Dynasty and pushing it to the brink of collapse with your power alone. I too once ventured alone into a<br/><br/>Fate Dynasty and executed the emperor, but that dynasty was merely one among many in the Southern Celestial Sea and cannot compare to the Xuan Dynasty. On this point, I am no match for Brother Fang, and I am convinced by your strength.”<br/><br/>Xiao Zi found itself viewing him favorably after his pleasant flattery.<br/><br/>Fang Wang rose to his feet, removing the Fox Mask, and looked at Dugu Wenhun.<br/><br/>This name seemed familiar.<br/><br/>Fang Wang thought carefully and soon remembered—wasn’t this Dugu Wenhun, one of the Southern Celestial Four Heroes?<br/><br/>The last time he heard rumors of the Southern Celestial Four Heroes, he was told that Dugu Wenhun was most likely to become the leader of the Four Heroes, meaning that in the eyes of the majority of cultivators, he was stronger than Realperson Jiyang, Chen Shang, and Ji Haotian.<br/><br/>As Fang Wang scrutinized him, Dugu Wenhun maintained his smile, although he was somewhat surprised internally.<br/><br/>In such a short time since their first meeting, Fang Wang gave him an even more dangerous impression.<br/><br/>Smiling, Fang Wang asked softly, “May I inquire, what brings Taoist Dugu to seek me out?”<br/><br/>Hearing this, Dugu Wenhun inwardly breathed a sigh of relief—he had indeed been afraid that Fang Wang, bloodthirsty from his recent battles, would be ready to fight at the slightest disagreement.<br/><br/>Dugu Wenhun replied with a smile, ‘May I ask, Brother Fang, if you are aware of the greatest legend of Emperor Sea?”<br/><br/>Fang Wang shook his head slightly, and Dugu Wenhun didn’t keep him in suspense, saying immediately, “Emperor Sea is named after an emperor, the Hongxuan Emperor, who met his end in these waters. Over the centuries, those emperors and sovereigns who reached the pinnacle of power in their Fate Dynasties would come to Emperor Sea in their twilight years to be buried within.”<br/><br/>“The reason why the Xuan Dynasty is named such is also due to its Ancestral Emperor’s reverence for the Hongxuan Emperor. The Hongxuan Emperor has fallen for fifty thousand years, and his tomb lays hidden within the depths of Emperor Sea. I have come to seek you out, hoping to join forces with you to venture into the imperial tomb of the Hongxuan Emperor.”<br/><br/>Fang Wang, upon hearing this, shook his head and said, “If it’s for the sake of opportunity, then please return, I’m not interested.”<br/><br/>He already had enough opportunities on him, and did not wish to seek more.<br/><br/>Dugu Wenhun was not in a hurry either, He laughed and said, “The Hongxuan<br/><br/>Emperor was far from simple. Since ancient times, cultivators in the Mortal<br/><br/>Realm either aimed for saintliness or ascension as their path. The Hongxuan Emperor founded the Imperial Dao, leveraging the fate of his dynasty to achieve longevity on par with heaven and earth. Sadly, like the Descending Dragon Great Saint who lived ten thousand years ago, he faced suppression from The Upper Realm and eventually perished. It was, in fact, due to the fate of the Hongxuan Emperor that the Descending Dragon Great Saint sought to sever the connections between the Mortal Realm and The Upper Realm, which in the end led to his tragic death and the dispersal of his dao.”<br/><br/>“Though the Hongxuan Emperor was no Great Saint, he was not necessarily weaker than one. In fact, one could even say he was stronger. The Heavenly Emperor Imperial Mirror he created is considered the number one Divine Skill in the Mortal Realm by the Seven Seas and Fifteen Continents, and he was the first of the Mortal Realm’s mightiest to challenge the authority of The Upper<br/><br/>Realm’s deities.”<br/><br/>Dugu Wenhun paused for a moment, then added, “In these two years, you’ve defeated hundreds of schools and are renowned far and wide. You claim you want to sweep through the Emperor Sea. If that’s the case, you must defeat The Three Immortals of the Emperor Sea, who represent the most apparent powerful forces in the Emperor Sea. The Three Immortals are waiting right in front of the Hongxuan Emperor’s imperial tomb. They’ve reached a bottleneck in their cultivation and seek the Heavenly Emperor Imperial Mirror to fathom the mysteries of heaven. ”<br/><br/>Fang Wang asked, “What realm are The Three Immortals of the Emperor Sea<br/><br/>Dugu Wenhun replied, “The ninth layer of the Nirvana Realm. They have been stuck at this level for more than five hundred years. Should they surpass the Nirvana Realm, there would surely be a heavenly sign.”<br/><br/>“Haven’t there been unusual celestial phenomena recently?”<br/><br/>“Those were not celestial phenomena of a realm above Nirvana. It must be that a sage has created a Saint Method that resonates with the world, and Brother Fang is among them, correct?”<br/><br/>Dugu Wenhun asked with a chuckle, clearly shaken by Fang Wang’s strength. He was convinced that Fang Wang possessed unimaginable supreme techniques.<br/><br/>Fang Wang didn’t deny it but asked instead, “If only the ninth layer of Nirvana<br/><br/>Realm is considered the peak in the Emperor Sea, it seems that both the<br/><br/>Emperor Sea and the Southern Celestial Sea are not very strong.”<br/><br/>Dugu Wenhun shook his head and said with a sense of nostalgia, “Naturally.<br/><br/>Both the Emperor Sea and the Southern Celestial Sea are the fringes of the Mortal Realm. Ever since the Descending Dragon Great Saint defied the heavens, the three seas and four continents he once unified have faced the exhaustion of fate. Nirvana Realm is indeed far from the level of Great Saints, but I can feel that both the Southern Celestial Sea and Emperor Sea are on the rise, giving birth to many once-in-a-millennium geniuses. What comes next will surely be a golden age, and you, Tian Dao Fang Wang, are the iconic figure of this era.”<br/><br/>His gaze was piercing as he looked at Fang Wang, leaving Fang Wang unsure of the sincerity behind his words.<br/><br/>“If that’s the case, then let’s go. I indeed look forward to meeting The Three Immortals of the Emperor Sea,” Fang Wang said immediately, to which Dugu Wenhun smiled.<br/><br/>Fang Wang gestured to Fang Jing, who immediately ran over.<br/><br/>Xiao Zi swiftly enlarged, and Fang Wang, holding Fang Jing’s hand, stepped onto the snake’s head, while Dugu Wenhun took the lead. He pulled out a jade flute that expanded to a length of ten zhang, then he sat cross-legged on the flute, guiding the way and conversing with Fang Wang.<br/><br/>Being curious about the Emperor Sea, Fang Wang asked many questions, and Dugu Wenhun answered each one with patience.<br/><br/>When Xiao Zi asked who among the Southern Celestial Four Heroes was the strongest, Dugu Wenhun confidently replied that it was himself. However, he also said that the Southern Celestial Four Heroes would become a thing of the past because with Fang Wang’s emergence, the Southern Celestial Sea would no longer see unparalleled geniuses stand toe-to-toe in rivalry, a statement that Xiao Zi found quite pleasing.<br/><br/>Fang Wang felt that Dugu Wenhun was overly enthusiastic, so he kept his guard up in case Dugu Wenhun had other schemes in mind.<br/><br/>In a Taoist temple, a man in a Dao Robe sat meditating on a cushion, not cultivating but staring blankly at a stone statue in front of him.<br/><br/>His name was Lü Xianming, considered the greatest talent of the Xuan<br/><br/>Dynasty, as well as the most esteemed young prodigy of the Emperor Sea.<br/><br/>At this moment, he appeared completely devoid of any prodigious grace, his demeanor one of desolation.<br/><br/>“Benefactor Lü has been sitting in meditation for a year now. Haven’t you come to terms with it yet?”<br/><br/>A voice came from outside the temple as a Taoist priest holding a horsetail whisk walked in, came beside Lü Xianming, and started lighting incense.<br/><br/>Lü Xianming didn’t look at him, responding with a numb tone, “If the Taoist priest were me, would you have come to terms with it?”<br/><br/>The Taoist priest in the green robe chuclded lightly, “What’s there to come to terms with? Has Benefactor Lü never been defeated since childhood?”<br/><br/>Hearing this, Lü Xianming immediately became agitated and through clenched teeth said, “Of course I’ve been defeated, but this time is different. In the past, after defeat, I could see hope for catching up. But Fang Wang is different—he’s too strong. Perhaps he truly is a manifestation of the Heavenly Dao. In front of the Heavenly Dao, I am just a mere mortal, not worth mentioning…”<br/><br/>He had just reached two hundred years of age, with a cultivation at the ninth layer of the Golden Body Realm, strong enough to sweep through the Mahayana Realm and even fight to a standstill with Nirvana Realm Great Cultivators.<br/><br/>He was the most formidable talent the Emperor Sea had seen in nearly ten thousand years. Some Nirvana Realm Great Cultivators even claimed he possessed the potential of a Great Saint. Hence, he received the Xuan Dynasty’s heavy endorsement, was brought into officialdom with no burdensome duties, and enjoyed the dynasty’s grooming. Once, he thought he was the main character of this world, capable of having whatever he wished for.<br/><br/>Until the arrival of the Heavenly Dao…<br/><br/>He couldn’t withstand a single kick from Fang Wang!<br/><br/>Just one kick!<br/><br/>The opponent had not used any Spell, but with just a turn and a kick, he was left without the strength to fight, his Golden Body nearly shattered.<br/><br/>He couldn’t forget lying in the ruins, writhing in agony and holding his own body while looking up at Fang Wang demonstrating his might..<br/><br/>After that battle, Lü Xianming gave up on cultivating.<br/><br/>He felt cultivation was meaningless. If he couldn’t become the strongest in the world, he would eventually fade into the dust of the ages.. Those who are remembered in history are all the strongest of an era, and compared to Fang Wang, he feared he wouldn’t even qualify as a rival…\t\t\t\t\t\t</div>", "images": {}, "success": true}