{"id": 186, "url": "https://www.novelhall.com/i-became-an-immortal-on-mortal-realm-32879/14313806.html", "title": "Chapter 186 - Chapter 186: Chapter 183: Fang Wang’S Great Battle With The Hongxuan Emperor", "volume": 2, "volume_title": "Volume 2", "body": "<h1>Chapter 186 - Chapter 186: Chapter 183: Fang Wang’S Great Battle With The Hongxuan Emperor</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 186: Chapter 183: Fang Wang’s Great Battle with the Hongxuan Emperor<br/><br/>Translator: 549690339<br/><br/>The ninth time?<br/><br/>And there are two other people, who have come fifty and one hundred and thirty thousand times?<br/><br/>Fang Wang stared intently at the golden-haired monkey and asked, “What do you mean? Have you seen me before?”<br/><br/>The insanity of The Three Immortals of the Emperor Sea gave him reason to suspect that this monkey was also crazy.<br/><br/>Of course, perhaps this monkey was talking about some incredible things.<br/><br/>Fang Wang had memories from his previous life on Earth and had also encountered the reborn Zhou Xue, which forced him to believe in some seemingly incredulous things.<br/><br/>In the cultivation world, what is so unbelievable?<br/><br/>Immortals themselves are omnipotent.<br/><br/>The golden-haired monkey leapt down from the mountain wall, landing on the grassy ground. The cloudy skies above parted, sunlight streamed down upon it, dispelling the darkness of the valley.<br/><br/>The golden-haired monkey scratched its head and laughed, “This is your ninth time coming here, undergoing my trials. You might not understand, and not just you—she and he don’t understand either. All I can say is that some secrets of the universe must not be revealed.”<br/><br/>Fang Wang narrowed his eyes and asked, “Is it an illusionary realm, or have I and others experienced life after life, encountering you each time?”<br/><br/>The golden-haired monkey was not surprised and said wistfully, “It still has to be you, much smarter than the other two. That woman, on the other hand, is more accepting of this, getting stronger with each life, just like you. The one who’s come the most is mediocre at best, almost no progress at all; he asks endlessly every time, to the point where it annoys me immensely.” A man and a woman?<br/><br/>Fang Wang’s thoughts raced, quickly considering many possibilities.<br/><br/>“I am still interested in you; after all, we are people with the same destiny. Those two are too mediocre; conversing with them is exhausting. I am always looking forward to you,” the golden-haired monkey giggled. Fang Wang asked, “Are those two connected to me in any way?” “Of course they’re related; they all come because of you.”<br/><br/>“Oh?”<br/><br/>Fang Wang fell into thought and couldn’t help but ask, “Could their names be<br/><br/>Zhou Xue and Ji Rutian?”<br/><br/>He guessed Ji Rutian because the man acted strangely, and his past life experiences greatly overlapped with Fang Wang’s.<br/><br/>The golden-haired monkey twisted its neck and said, “I cannot reveal the Heavenly Dao, but seeing that we get along, I can disclose a little. You only guessed one person right.”<br/><br/>Seeing Fang Wang wanted to ask more, the golden-haired monkey spoke with a hint of mystery, “Actually, they all came for you, searching over and over for the most powerful legacy in the world. They do not speak of each other, only you. Strange, isn’t it?”<br/><br/>Fang Wang asked, “Are you the Hongxuan Emperor?”<br/><br/>Upon hearing this, the golden-haired monkey crossed its arms and proudly said, “That’s right! I am the Hongxuan Emperor, who founded the Imperial Dao. Back in my day, I chose not to ascend but directly entered The Upper Realm, sweeping all the powers there, which invited jealousy from the immortals. Those dogs… no, they’re really not worth mentioning at all!”<br/><br/>Seeing the golden-haired monkey speak so crudely, Fang Wang found it difficult to associate it with the Hongxuan Emperor.<br/><br/>Fang Wang frowned and asked, “If this is not an illusionary realm, then what is it? If you have transcended time with your cultivation, then how could you have fallen? Could it be that the immortals are stronger than you? If so, you can monitor reincarnation, so why can’t they?”<br/><br/>The golden-haired monkey was stunned, it began to pace around, scrutinizing Fang Wang closely.<br/><br/>“Something’s not right, you seem different, interesting,” the golden-haired monkey murmured in amazement as it circled Fang Wang.<br/><br/>Fang Wang asked again, “The people following me, will they also come to this illusionary realm?”<br/><br/>He still held a skeptical attitude towards the golden-haired monkey’s words.<br/><br/>Because if the golden-haired monkey could truly see through rebirth or reincarnation, wouldn’t that be remarkable?<br/><br/>If you think about it too much, the conspiracy theories just get deeper and more terrifying.<br/><br/>The golden-haired monkey laughed, “They are undergoing my legacy trial. Only you do not need to face my legacy. My Heavenly Emperor Imperial Mirror is not suitable for you. I simply want to have a chat with you.”<br/><br/>“To be honest, I am not as strong as you imagine. The only reason I can glimpse these inconceivable matters is that I, desperate to survive, cast away my lingering spirit outside the realms of yin and yang to evade the pursuit of Immortal Gods. I never expected it to work, escaping the eyes of Heavenly Dao. Now I cannot change fate; I can only observe the development of the mortal world from here, and I can’t see beyond this place. It’s a rather mystical state, also an eternal curse,” the monkey said, its tone turning somber.<br/><br/>Fang Wang calmly said, “Is that so? Aren’t you afraid I’ll reveal your whereabouts?”<br/><br/>The golden-haired monkey laughed cryptically upon hearing this, “Heh, you won’t because you’re never going to ascend.”<br/><br/>Fang Wang’s expression shifted slightly.<br/><br/>The golden-haired monkey leapt up, returning to the mountainside.<br/><br/>Fang Wang continued to ask some more questions, but regrettably, the golden-haired monkey simply wouldn’t answer anything regarding him or the other two, insisting that some secrets of the universe must not be revealed.<br/><br/>This monkey spoke ceaselessly when it came to the affairs of the Hongxuan Emperor, really treating Fang Wang as a confidant.<br/><br/>After listening for a while, Fang Wang interrupted, “Let’s talk about the legacy trial. I want to give it a try.”<br/><br/>After a moment’s hesitation, the golden-haired monkey said, “Come then. To obtain my legacy, you must defeat me at the same realm.” “The lower the realm, the easier it is to pass the trial.”<br/><br/>The lower the better?<br/><br/>Fang Wang thought of the innate prohibitions surrounding Emperor’s Tomb Island and silently rebuked, You just don’t want to pass on the Heavenly Emperor Imperial Mirror, do you!<br/><br/>Fang Wang sensed that he could use Jiuyou Zizaishu to escape, and he wasn’t the least bit panicked, so he said, “If that’s the case, then fight me with your Mahayana Realm cultivation!”<br/><br/>The Golden-haired Monkey glared with wide eyes and said, “You are only at the fourth layer of the Golden Body Realm, are you sure?”<br/><br/>“Hmm.”<br/><br/>“Good, very good, you truly are Fang Wang. Although this time you seem more restrained than the previous eight times, the madness in your bones is still there. Indeed, people like us should be mad, ” the Golden-haired Monkey said, not angry but smiling. As its voice fell, it leapt up, flying to the summit of a thousand-yard high peak, where the sunlight shone down, and it suddenly burst forth with momentum.<br/><br/>A tremendous momentum descended, enveloping the entire Emperor’s Tomb Island.<br/><br/>Fang Wang looked up and saw that this momentum was much stronger than that of The Three Immortals of the Emperor Sea, but he believed the Golden-haired Monkey had indeed suppressed its realm to the Mahayana Realm.<br/><br/>It was normal for the Hongxuan Emperor, who had always been a peerless prodigy, to be stronger than The Three Immortals of the Emperor Sea, who were at the ninth layer of Nirvana Realm, during his Mahayana Realm time.<br/><br/>“Hahahaha, it’s been a long time since we sparred, Fang Wang, don’t disappoint me!”<br/><br/>The Golden -haired Monkey let out a hearty laugh as it stomped its foot, shattering the thousand-yard peak instantly, and then swooped down toward Fang Wang.<br/><br/>Countless fragments of rocks fell like rain, with a tremendous force, as Fang Wang threw a punch.<br/><br/>Boom!<br/><br/>Fang Wang’s fist collided with the Golden -haired Monkey’s, and in an instant, the entire Emperor’s Tomb Island collapsed, with the surrounding sea water raising towering waves.<br/><br/>Fang Wang raised his eyebrows, impressed by the great strength!<br/><br/>The Golden -haired Monkey’s face contorted fiercely with excitement, laughing loudly, “Good, good, good!”<br/><br/>Fang Wang suddenly burst forth with the Yang Energy of the Vajra Invincible Saint Body and sent the Golden-haired Monkey flying with a punch, then followed by leaping into the air.<br/><br/>The Golden-haired Monkey soared several thousand yards high, passing through wave upon wave of cloud sea. It suddenly stabilized its figure and conjured a Great Halberd with one hand, pitch-black, with a single-edged blade, rimmed with black scales between the head and the shaft, and a tail end like a beast’s tail.<br/><br/>It raised the Single-Edged Halberd high and smashed it down with rage.<br/><br/>A Black Dragon broke through the sky, opening its huge maw to bite at the Golden – haired Monkey.<br/><br/>In front of the Black Dragon, the Golden-haired Monkey appeared as insignificant as dust, but its momentum was in no way inferior to the Black Dragon’s. It grinned wildly, struck down with a halberd, and with an overwhelmingly domineering air, scattered the Black Dragon.<br/><br/>The Black Dragon exploded like smoke, Fang Wang dispersed the black smog, and punched at the Golden-haired Monkey.<br/><br/>Fang Wang was too fast. The Golden-haired Monkey instinctively lifted the halberd to defend, the shaft blocking Fang Wang’s punch, and was directly repelled dozens of miles away.<br/><br/>The Golden-haired Monkey rolled its neck and flexed its fingers that grasped the Single -Edged Halberd. Suddenly, it lifted the single-edged blade high and yelled, “Fang Wang, bring out your Lifespirit Treasure!”<br/><br/>The Single -Edged Halberd burst forth with ferocious black Qi, rushing towards the heavens, causing the Firmament to change colors.<br/><br/>An unfathomable momentum erupted from the Golden-haired Monkey’s body. Its golden fur instantly turned black and then shed entirely, transforming into a mighty man covered in black scale armor.<br/><br/>Hongxuan Emperor!<br/><br/>The Hongxuan Emperor’s eyes were fierce, his features handsome, his face overbearing, and his black hair danced wildly as if black flames burned furiously.<br/><br/>Fang Wang, holding the Heavenly Palace Halberd, charged forward.<br/><br/>Clang!<br/><br/>As the two halberds collided, they emitted a deafening roar, with a terrifying impact that shook the Firmament. Below, the sea surface was pressed down, instantly forming a giant trough of a hundred miles in diameter, which continued to expand.<br/><br/>Fang Wang raised his eyebrows and locked eyes with the Hongxuan Emperor.<br/><br/>The corners of the Hongxuan Emperor’s mouth curled up, revealing a defiant smile. This ancient power twisted his neck, and surprisingly, two heads sprung forth, followed by four more arms. Three heads and six arms!<br/><br/>Boom!<br/><br/>Their momentum exploded, repelling each other. Fang Wang was repelled by someone’s momentum for the first time.<br/><br/>He instantly felt excited, showing a smile as well. The two collided at high speed and began to fiercely exchange blows.<br/><br/>As their halberds clashed non-stop, their figures moved swiftly and irresistibly!<br/><br/>Fang Wang was secretly astonished; although it was one-on-one, he felt as if he were facing several Hongxuan Emperors, and this feeling grew increasingly strong.<br/><br/>The Hongxuan Emperor seemed to be able to predict Fang Wang’s attacks and even find his flaws. However, because the Heavenly Dao True Skill contained the intricacies of the True Combat Technique, Fang Wang could quickly counter.<br/><br/>For a moment, they fought without a clear superior.<br/><br/>This was the first time Fang Wang had fought against a being comparable to a Great Saint, and he became more and more excited as the battle raged on.<br/><br/>He didn’t use Swordsmanship, relying solely on his Vajra Invincible Saint Body and the Heavenly Dao True Skill to contend with the Hongxuan Emperor.<br/><br/>Suddenly!<br/><br/>The Hongxuan Emperor swung his six arms, repelled Fang Wang, and then activated a spell. A thousand phantoms flew out from his body, all of them clones of the Hongxuan Emperor.<br/><br/>“Hahaha, Fang Wang, you are very strong, but sadly, I still have the advantage. Although I suppressed my cultivation to the Mahayana Realm to fight you, it’s just the cultivation that is suppressed, not my combat experience, which far surpasses yours. Even if you lose, you will still be better than how I was back in the Mahayana Realm!” laughed the Hongxuan Emperor, the thousand clones each showing different expressions as if they had their own emotions.<br/><br/>Fang Wang rotated the Heavenly Palace Halberd in one hand and casually pointed at the Hongxuan Emperor, proudly laughing, “It’s not an advantage. You are facing me, the one who has inherited the legacies of the Descending<br/><br/>Dragon Great Saint, the Grand An Divine Emperor, and the Executioner Immortal Great Saint.. Even if you lose, you’d still be superior to any other being in this world, aside from me!”\t\t\t\t\t\t</div>", "images": {}, "success": true}