{"id": 190, "url": "https://www.novelhall.com/i-became-an-immortal-on-mortal-realm-32879/14315506.html", "title": "Chapter 190 - Chapter 190: Chapter 187: Unifying Emperor Sea, Peacock Holy King", "volume": 2, "volume_title": "Volume 2", "body": "<h1>Chapter 190 - Chapter 190: Chapter 187: Unifying Emperor Sea, Peacock Holy King</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 190: Chapter 187: Unifying Emperor Sea, Peacock Holy King<br/><br/>Translator: 549690339<br/><br/>“That’s right, have you been here in a past life?” Fang Wang stared at Zhou Xue and asked.<br/><br/>Knowing Zhou Xue had heard similar words eased his mind a bit, at least there wasn’t the loneliness of facing destiny alone.<br/><br/>Zhou Xue nodded, her gaze shifting toward the vast fog at the horizon, saying, “I have, but unfortunately, I did not pass the test. The Hongxuan Emperor of that time was unbeatable to me. Before my ascension, only one person had succeeded in inheriting from the Hongxuan Emperor, and that person chose not to ascend. He didn’t ascend not for lack of opportunity, but to carry on the will of the Hongxuan Emperor and stay in the Mortal Realm.”<br/><br/>“You shouldn’t take the Hongxuan Emperor’s words too seriously. Perhaps he really could see something, but what he saw before was definitely not you or me. At least in my past life, he never mentioned you to me. This shows that my rebirth has become an unpredictable factor, something he couldn’t see through. If even he couldn’t see it through, then why care about those things from the past he talked about?”<br/><br/>Fang Wang also felt that he was different from the previous eight times the Hongxuan Emperor mentioned, and he couldn’t help shaking his head, realizing he was becoming attached.<br/><br/>Speaking of which, although his actual age was over twenty thousand years old, he spent most of that time cultivating and hadn’t experienced much, unlike Zhou Xue. She had traversed the world and ascended to the Upper Realm, what hadn’t she seen?<br/><br/>Fang Wang turned to look at Zhou Xue’s profile, a lock of her black hair resting on her face, illuminated by the lamp’s light, which he found quite appealing.<br/><br/>“Did you pass the test?” Fang Wang asked.<br/><br/>He could see Fang Jing’s test results, but not Zhou Xue’s.<br/><br/>Zhou Xue, a reborn person, was no younger than Fang Wang in terms of real age. Fang Wang still didn’t know how many years she had lived in her past life.<br/><br/>Zhou Xue answered, “I did. I defeated the Hongxuan Emperor in the Cross-Void Realm.’<br/><br/>“The Cross-Void Realm? You haven’t reached the Golden Body Realm?” Fang Wang raised an eyebrow and asked.<br/><br/>Zhou Xue glanced at him and huffed, “I did reach it, but I used a Secret<br/><br/>Technique to suppress my realm, and the Hongxuan Emperor didn’t notice.”<br/><br/>Upon hearing this, Fang Wang couldn’t help but ask out of curiosity, “How did you compare to the Hongxuan Emperor in your previous life? Who was stronger?”<br/><br/>Zhou Xue shook her head slightly and said, “I couldn’t surpass the illustrious Hongxuan Emperor, but the Secret Technique I used is special. The creator of the technique might not be inferior to the Hongxuan Emperor.”<br/><br/>Fang Wang felt a sense of admiration inside. It seemed Zhou Xue hadn’t been running around in vain these years; she had gathered quite a collection of inheritances.<br/><br/>“What’s the background of Xiao Kuang? How has he managed to stay this long?” Fang Wang asked with curiosity.<br/><br/>Before entering the Formation, none of the cultivators from the Jin Xiao Sect had caught his attention, and Xiao Kuang’s realm wasn’t high either. Zhou Xue said with profound meaning, “He is just a discard.”<br/><br/>At this statement, Fang Wang narrowed his eyes.<br/><br/>Zhou Xue brushed her hair from her forehead and said, “Before coming here, he had already made up his mind. He was a man about to die, lending his body for the resurrection of the Hongxuan Emperor could perhaps offer him a sliver of hope.”<br/><br/>What a gutsy move!<br/><br/>Thinking to revive the Hongxuan Emperor?<br/><br/>“I’m here not in pursuit of the Heavenly Emperor Imperial Mirror, but for another matter. By the way, I’m recruiting the Hongxuan Emperor. One day, I will contend with the Upper Realm, and the Hongxuan Emperor happens to share a similar vendetta,” Zhou Xue said calmly.<br/><br/>Fang Wang was silent.<br/><br/>Zhou Xue said no more, her gaze drifting, lost in thought.<br/><br/>After a long while.<br/><br/>Fang Wang broke the silence, saying, “I’ll join the Jin Xiao Sect too. Before you ascend, I’ll lend you a helping hand.”<br/><br/>Zhou Xue turned to look at him, her eyes showing a subtle smile, saying,<br/><br/>“Before ascending? It seems you’ve also chosen to stay in the Mortal Realm? That’s good. For the multitude of souls, ascending is indeed the only path, but for a rare genius like you, staying might be a good thing.”<br/><br/>“But forget about joining the Jin Xiao Sect. You walk your own path, no need to follow me, and avoid unnecessary trouble. When I really need your help, I definitely won’t hesitate to ask,” she replied.<br/><br/>Fang Wang nodded slightly after hearing this.<br/><br/>Zhou Xue took a deep breath and said, “I’m sorry, it was my inadequacy that failed to protect him.”<br/><br/>Fang Wang hesitated for a moment before realizing she was referring to Fang Xun.<br/><br/>It wasn’t that he was heartless; it was mainly because he’d spent six thousand one hundred years inside the Heavenly Palace, and he hadn’t reacted right away.<br/><br/>“It’s not your fault. You can’t always be watching over him. In his pursuit of love, he acted recklessly and even implicated many cultivators from the Jin Xiao Sect,” Fang Wang replied, feeling some regret when mentioning this.<br/><br/>No matter how strong he was, there were some things he couldn’t change.<br/><br/>Then, Zhou Xue changed the subject and started talking about the Fang Family’s situation. She had planted cultivators in Grand Qi, who reported on the Fang Family’s condition every year.<br/><br/>At the foot of the mountain.<br/><br/>Fang Zigeng was meditating in a corner of the valley, gazing at the peak, his eyes filled with envy.<br/><br/>In their batch of Fang Family Disciples, many had made a name for themselves, and the original nine cultivators had now become the pillars of the Fang Family, the objects of envy for the younger generations. Fang Zigeng had also become the top disciple of the Fang Residence, just behind Fang Wang, Zhou Xue, and Fang Hanyu.<br/><br/>But all along, Fang Zigeng knew that there was an insurmountable gap between him and Fang Wang’s trio, which included their relationship.<br/><br/>He wanted to truly belong.<br/><br/>He wasn’t discouraged, though; he took a deep breath and continued his Cultivation.<br/><br/>With enough effort, perhaps one day, he could make Fang Hanyu’s trio into a quartet.<br/><br/>In the blink of an eye.<br/><br/>Half a day had passed.<br/><br/>The bright light on the altar finally yielded a figure, causing cheers among the cultivators of the Jin Xiao Sect.<br/><br/>Zhou Xue stood up, saying, “It’s time to leave.”<br/><br/>Fang Wang nodded, having talked with her for so long, his mood had improved a great deal, and much of the bitterness of six thousand one hundred years dissipated.<br/><br/>Just as Zhou Xue was about to leap down, she suddenly thought of something, turned her head back, and cautioned, “Don’t push yourself too hard, and if there’s anything troubling or difficult, you can always come to me.”<br/><br/>Fang Wang’s lips curled into a smile; he put the jade bracelet on his right wrist and followed her down into the valley.<br/><br/>After landing, Fang Wang saw Xiao Kuang surrounded by admirers like stars around the moon. Xiao Kuang was dressed in dark purple brocade clothes, broad-shouldered and slim-waisted, with a treasured saber hanging from his waist. His demeanor was indifferent, but his eyes were full of aggression.<br/><br/>Those eyes…<br/><br/>Hongxuan Emperor!<br/><br/>Fang Wang retracted his gaze and waved to Fang Jing, saying, “Let’s go, it’s time for us to leave.”<br/><br/>Fang Jing and Xiao Zi quickly closed in on him, while Dugu Wenhun and The Three Immortals of the Emperor Sea hurriedly rose to their feet to follow his pace.<br/><br/>After taking seven steps, Fang Wang seemed to remember something, turned his head to look, and his gaze met Fang Zigeng’s from within the crowd. Fang Zigeng was looking at him too.<br/><br/>Fang Wang smiled at him and transmitted his voice, “If you still consider me as a brother, you can always come to me when you encounter trouble. Looking at your white hair, I feel somewhat distressed.”<br/><br/>With that, Fang Wang turned and left.<br/><br/>Fang Zigeng was stunned for a moment, then laughed out loud.<br/><br/>Time had passed, and circumstances had changed, but Fang Wang was still the same Fang Wang he remembered, his words as unconventional as ever.<br/><br/>Xiao Kuang, surrounded by the cultivators of Jin Xiao Sect, watched the retreating figure of Fang Wang, couldn’t help but curl his lips, revealing a glint of fighting spirit in his eyes.<br/><br/>“You little brat, wait until I reach the Celestial Qiankun Realm, then I’ll show you the true power of the Heavenly Emperor Imperial Mirror!”<br/><br/>Thinking of the scene where he defeated Fang Wang, Xiao Kuang grew excited.<br/><br/>Above the boundless ocean, Fang Wang sat atop Xiao Zi’s snakehead, with Fang Jing beside him.<br/><br/>Zhao Zhen drifted out of the Soul Devouring Gourd, glancing from time to time at Dugu Wenhun and The Three Immortals of the Emperor Sea on either side.<br/><br/>His heart was filled with emotion, as his master was indeed a man of destiny, attracting powerful figures wherever he went.<br/><br/>“Brother Fang, where are you planning to go next?” Dugu Wenhun turned his head to ask, knowing well that Fang Wang was three hundred years his junior, yet he still addressed him as a brother, and when he spoke the word “brother, ” his heart was tumultuous.<br/><br/>Fang Wang replied, “Back to the Southern Celestial Sea.”<br/><br/>Zhou Xue was preparing to replace the Xuan Dynasty and unify the Emperor Sea; therefore, there was no need for him to continue the battle. In fact, his fame had already spread throughout the Emperor Sea.<br/><br/>Dugu Wenhun hesitated, on the verge of speaking yet restraining himself.<br/><br/>Fang Wang glanced at him and said with a smile, “I know what’s on your mind; come back with me to Biyou Island. Then, I will teach you all together.”<br/><br/>Upon hearing this, Dugu Wenhun was overjoyed and also full of perplexity. He asked, “Brother Fang, what do you need me to give in return?<br/><br/>Fang Wang looked ahead again, speaking calmly, “You don’t need to give anything. If you encounter any members of the Fang Family in trouble in the future, I hope you can lend a hand.”<br/><br/>Dugu Wenhun quickly replied, “It’s what I should do, and that still wouldn’t repay the grace of your inheritance.”<br/><br/>“You need not worry; to teach one is to teach, to teach two is to teach. If you really ask why I’m willing to teach, then all I can say is that I hope for more strong figures in this mortal realm—that would be interesting.”<br/><br/>Fang Wang’s answer made Dugu wennun respect mm greatly, and even ‘l’ne Three Immortals of the Emperor Sea looked at him with a different gaze.<br/><br/>If anyone else had said those words, they might have been skeptical, but for some reason, when those words came from Fang Wang, they just believed him.<br/><br/>“Little… Elder, you truly are a profound master, no wonder you inherited the legacy of the Hongxuan Emperor.”<br/><br/>“Since ancient times, those who become Great Saints are people whose breadth and vision are unimaginable to the masses; Elder of the Heavenly Dao is certainly destined to become a Great Saint.”<br/><br/>“It’s not just about becoming a Great Saint; surpassing the Hongxuan Emperor is not out of the question!”<br/><br/>The Three Immortals of the Emperor Sea spoke in unison, their words filled with flattery.<br/><br/>Fang Jing also looked at his great uncle with admiration, deciding in his heart not only to become as strong as his great uncle but also to become a powerful figure like him.<br/><br/>“People say that The Three Immortals of the Emperor Sea are the strongest in the Emperor Sea; is this true?” Fang Wang asked, casually lifting his hand to ruffle Fang Jing’s small head.<br/><br/>The Three Immortals of the Emperor Sea shook their heads at this question. “Of course not, we are no match for the Peacock Sage King.”<br/><br/>“Exactly, the Peacock Sage King is the strongest in the Emperor Sea, but it lives in seclusion in the depths of the Emperor Sea, and no one can find its traces.”<br/><br/>“Eight hundred years ago, we had a confrontation with the Peacock Sage King and almost perished.”<br/><br/>The Peacock Sage King?<br/><br/>Fang Wang turned to look at Dugu Wenhun, who shook his head and said, “I have never heard of this name, as I was not born in the Emperor Sea.”<br/><br/>The Three Immortals of the Emperor Sea continued to introduce the Peacock Sage King.<br/><br/>“The Peacock Sage King is the strongest genius in the history of the Demon Race in the Emperor Sea, possessing the qualities to become a Great Saint of the Demon Race. Unfortunately, it keeps a low profile and is hard to track down.”<br/><br/>“Luckily, the Peacock Sage King has no interest in the power struggle of the Emperor Sea; otherwise, the Xuan Dynasty would have been destroyed long ago.”<br/><br/>“The Peacock Sage King is even uninterested in the legacy of the Hongxuan Emperor. It came to Emperor’s Tomb Island and dug everywhere, but steadfastly refused to enter the formation and accept the legacy..”\t\t\t\t\t\t</div>", "images": {}, "success": true}