{"id": 196, "url": "https://www.novelhall.com/i-became-an-immortal-on-mortal-realm-32879/14368885.html", "title": "Chapter 196 - Chapter 196: Chapter 193: The Legend Of Dugu Wenhun", "volume": 2, "volume_title": "Volume 2", "body": "<h1>Chapter 196 - Chapter 196: Chapter 193: The Legend Of Dugu Wenhun</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 196: Chapter 193: The Legend of Dugu Wenhun<br/><br/>Translator: 549690339<br/><br/>Accompanied by the crash of thunder, the entirety of Yang Hu County was startled awake; cultivators within Southern Hills City emerged one after another from their homes, gazing towards the horizon in every direction.<br/><br/>Three hundred li away from Southern Hills City, under the vault of heaven, roiling dark clouds swept out like a tidal wave. Figures of cultivators stood upon the clouds, with dozens of large banners billowing in the wind, each one embroidered with the bold characters “Heaven’s Larceny.”<br/><br/>Colossal demonic beasts loomed among the Heaven’s Larceny Saint Sect’s cultivators, baring their fangs and claws, occasionally letting out roars and whinnies.<br/><br/>Chou Tianjun, Ji Rutian, and other great cultivators stood at the forefront of this cloud sea, each one exuding an awe-inspiring presence. Yet, leading them was not Chou Tianjun but a towering man nearly two meters tall. Clad in a dragon-patterned black robe and crowned with a golden diadem adorned with strands of beads, he bore the regal air of an emperor. A broadsword stood before him, his hands resting on the hilt, his eyes sharp as a hawk’s, cheeks bristled with stubble, further emphasizing his wild and domineering aura.<br/><br/>“Saint Venerate, Southern Hills City is near,”<br/><br/>a cultivator called out, turning his head to address Chang Shengzun, prompting the other senior cultivators of Heaven’s Larceny Saint Sect to turn their attention to him as well.<br/><br/>With an expressionless face, Chang Shengzun spoke, “Continue advancing. Fang Wang must have felt our presence by now. This true man of the Heavenly Dao will surely answer the battle.”<br/><br/>True man of the Heavenly Dao!<br/><br/>Anticipation shone on the faces of the Heaven’s Larceny Saint Sect cultivators.<br/><br/>Having already dominated this continent, once they unified the land, the next step was to set foot into the ocean—thus, they were quite curious about the strength of the Eternal Life Pavilion, the overlord of the seas.<br/><br/>Before coming here, they had learned that among the twenty-four true men of the Eternal Life Pavilion, each counted as a first-rate power. This battle was not only to capture the Heaven Yuan Spirit Treasure but also a probe into the strength of the Eternal Life Pavilion.<br/><br/>“All of us against Fang Wang, he surely won’t be able to hold out, right?”<br/><br/>“Tsk tsk, I wonder if he will abandon the Fang Family, leave Grand Qi and run away?”<br/><br/>“Trust in the Saint Venerate; he won’t escape.”<br/><br/>“Damn it, some of my people tried to infiltrate Fang Residence and never came back. I must settle this account with Fang Wang.”<br/><br/>“Ji Rutian, the time has come for you to prove who has greater talent between you and Fang Wang.”<br/><br/>The great cultivators in the front row chatted and laughed casually, showing no fear of Fang Wang.<br/><br/>Ji Rutian remained silent, his gaze consistently fixed ahead, his right hand resting behind his waist clenched into a fist.<br/><br/>The dark cloud sea moved swiftly, passing over mountain ranges and startling the common populace in various cities, cultivators on mountain paths, and villagers, all of whom looked up with expressions of fear and amazement.<br/><br/>The momentum of the Heaven’s Larceny Saint Sect was truly oppressive.<br/><br/>A moment later…<br/><br/>Ji Rutian suddenly narrowed his eyes, not only him, but the other chattering great cultivators also fell silent, locking their eyes on the distant horizon.<br/><br/>There, two figures hung suspended in the sky, awaiting them.<br/><br/>They were none other than Dugu Wenhun and Zhu Yan.<br/><br/>Dugu Wenhun stood with his hands naturally at his sides, his deep purple brocade clothes fluttering in the wind, exuding the majestic aura of a powerful figure.<br/><br/>Zhu Yan stood with his arms wrapped in front of his chest, chin slightly raised, with a look of deranged laughter on his face, eying the vast army of the Heaven’s Larceny Saint Sect with disdain.<br/><br/>He had been waiting for this day for too long. Ever since he became a disciple of Fang Wang, he had seldom had the chance to flex his strength, and his nature craved battle.<br/><br/>“One has reached the Nirvana Realm,” Dugu Wenhun stated evenly.<br/><br/>The Nirvana Realm was not enough to drive him away; after all, he had crossed hands with The Three Immortals of the Emperor Sea. Even though he was soundly defeated, he had set those immortals as his benchmark.<br/><br/>Zhu Yan scoffed, “Having the audacity to trouble my master, they must be quite confident. The Nirvana Realm is yours to deal with, the rest are mine.”<br/><br/>Dugu Wenhun glanced at him but did not argue.<br/><br/>“Which of you is Tian Dao Fang Wang?”<br/><br/>Chou Tianjun exclaimed loudly, his voice booming like thunder, resonating through heaven and earth.<br/><br/>Most believed Zhu Yan resembled Fang Wang due to the similarity in their ages, while Ji Rutian, who was about the same age, was only at the Golden Body Realm.<br/><br/>In the Cultivation World, it was not unusual for some to absorb the blood and treasures of demonic creatures in pursuit of a powerful physique, gradually emanating Demonic Qi.<br/><br/>Moreover, Zhu Yan’s vitality was visibly formidable; it was rumored that Tian Dao Fang Wang favored using his fists.<br/><br/>Ji Rutian’s gaze was fixed on Dugu Wenhun.<br/><br/>Dugu Wenhun also felt Ji Rutian’s staring and did not look towards Chang Shengzun but kept his eyes on Ji Rutian.<br/><br/>While Chang Shengzun was indeed powerful, the cultivation accumulated through age did not catch his attention; he could tell that Ji Rutian was young.<br/><br/>And Ji Rutian exuded a dangerous aura that did not align with his realm.<br/><br/>“Do you think my master needs to personally intervene to block you? Ridiculous! Remember, I am the Roc Bird Zhu Yan, under the command of the Heavenly Dao!”<br/><br/>Zhu Yan declared proudly, his features turning demonic, with a pair of Roc wings budding from his back.<br/><br/>Following up, Dugu Wenhun spoke, “I am Dugu Wenhun, serving the Heavenly Dao. If you do not recognize my name, then let us have a duel!”<br/><br/>Dugu Wenhun!<br/><br/>At the mention of this name, the great cultivators of the Heaven’s Larceny Saint Sect could not help but be moved.<br/><br/>They had investigated the Southern Celestial Sea and were familiar with the renown of Dugu Wenhun.<br/><br/>One of the Southern Celestial Four Heroes, Dugu Wenhun!<br/><br/>And many regarded him as having the potential to lead the Four Heroes of the Southern Celestial!<br/><br/>Ji Rutian furrowed his brow, intently observing Dugu Wenhun.<br/><br/>A female Heavenly Monarch glanced at Ji Rutian and asked, “Ji Rutian, your brother Ji Haotian is also one of the Southern Celestial Four Heroes. What is his assessment of Dugu Wenhun?”<br/><br/>The other great cultivators turned to look at him.<br/><br/>Ji Rutian answered, “Unfathomable.”<br/><br/>The rest of the great cultivators frowned—the Fang Residence, under Fang Wang, had recruited two formidable warriors. Suddenly, the upcoming battle didn’t seem so straightforward to them.<br/><br/>“Dugu Wenhun, Zhu Yan, I will remember your names. I did not expect that in the process of capturing Fang Wang, I would also come across you two geniuses. Good, I will take you all back with us,”<br/><br/>Chang Shengzun’s voice rang out, cold and brimming with barely concealed murderous intent.<br/><br/>He was flanked by Great Cultivators who took to the skies, each summoning their own Lifespirit Treasures. Ji Rutian did the same; his Lifespirit Treasure was a crimson sword.<br/><br/>Zhu Yan burst into mad laughter and took the lead in attacking Heaven’s Larceny Saint Sect. Despite many enemies with cultivation levels higher than his, he charged fearlessly.<br/><br/>Dugu Wenhun followed closely behind, his right hand swiftly forming a long spear. The spear was a zhang long, its body silver and its tip like ice, exuding a bone-chilling frost.<br/><br/>The great battle officially erupted!<br/><br/>Zhu Yan, like a meteor falling, broke into the ranks of Heaven’s Larceny Saint Sect. Ji Rutian and Chou Tianjun went after Dugu Wenhun.<br/><br/>However, Dugu Wenhun’s speed suddenly surged, swift as a startled swan, slipping through between them.<br/><br/>So fast!<br/><br/>Ji Rutian and Chou Tianjun instinctively glanced at Dugu Wenhun, their pupils constricting.<br/><br/>Dugu Wenhun charged towards Chang Shengzun with his spear, his movement so quick that the Great Cultivators of Heaven’s Larceny Saint Sect couldn’t react in time.<br/><br/>Boom!<br/><br/>Chang Shengzun raised his palm to strike, meeting the tip of Dugu Wenhun’s spear head-on, his cold qi spreading tens of miles away, shaking the sea of dark clouds.<br/><br/>“With Mahayana Realm ninth layer yet such spiritual power, it seems you possess at least a top-tier Heaven Yuan Spirit Treasure!”<br/><br/>Chang Shengzun stared at Dugu Wenhun and sneered.<br/><br/>Dugu Wenhun’s mouth curved into a defiant smile. He was gentle in front of Fang Wang, but that was far from his true nature.<br/><br/>He held the spear in one hand and thrust it forward, breaking through Chang Shengzun’s spiritual power. The cold qi swept like a wind, blowing away hundreds of Heaven’s Larceny Saint Sect’s cultivators, tearing a spectacular stream in the firmament above.<br/><br/>Chang Shengzun dodged to the side and sent a palm strike towards Dugu Wenhun’s back.<br/><br/>Instantly, Dugu Wenhun turned into a series of afterimages, evading the strike, which made Chang Shengzun’s expression even more astonished, and then excited.<br/><br/>“Good! Then let this venerable one show you the might of the Nirvana Realm!”<br/><br/>Chang Shengzun roared with laughter, his aura erupting completely, earthshaking, the whole Grand Qi enveloped by his oppressive might, even affecting neighboring dynasties.<br/><br/>Hundreds of miles away, Southern Hills City erupted with noise as countless cultivators flew from the city, looking towards the horizon where thunderclouds roiled and lights flashed—that was the manifestation of the Great Cultivators’ spiritual power.<br/><br/>Inside the courtyard.<br/><br/>Fang Bai felt the overwhelming aura that enveloped heaven and earth and couldn’t help but swallow.<br/><br/>He hadn’t even seen the enemy, yet he felt a chilling sense of imminent death.<br/><br/>It was hard to imagine how terrifying the enemy was.<br/><br/>Fang Jing put a hand on his shoulder, making him turn his head.<br/><br/>Fang Jing gave Fang Bai a look, prompting him to glance unconsciously towards Fang Wang.<br/><br/>Fang Wang remained seated, his face instead showing a playful expression.<br/><br/>“This aura feels a bit familiar, as if I’ve encountered it somewhere.”<br/><br/>“Eh, I have that feeling too.”<br/><br/>“With age, it’s normal to not remember clearly. Back in the day, we also visited the nearby seas; maybe we came across that person.”<br/><br/>The Three Immortals of the Emperor Sea muttered among themselves, unaffected by the pressure of the Nirvana Realm, causing even Fang Hanyu to look their way.<br/><br/>Fang Wang spoke up, “Among you three immortals, who is willing to take a trip?”<br/><br/>“I’ll go!”<br/><br/>“Let me go!”<br/><br/>“Let the second brother go.”<br/><br/>The Three Immortals of the Emperor Sea responded in unison, giving two answers.<br/><br/>Fang Wang nodded, “Qian Xian, you go.”<br/><br/>The Three Immortals of the Emperor Sea, ranked in descending order of age, were Yu Xian, Qian Xian, and Chen Xian. The three were sworn brothers, but time had made them appear as close as blood relatives, indistinguishable from one another.<br/><br/>Upon hearing this, Qian Xian chuckled and vanished from the spot, leaving Fang Bai’s eyes wide with amazement.<br/><br/>Xiao Zi observed, “Come to think of it, we’ve never seen the three immortals make a move.”<br/><br/>Zhao Zhen also popped out of the Soul Devouring Gourd, eager to see the excitement.<br/><br/>Hearing Xiao Zi’s comment, Fang Hanyu curiously asked, “You’ve never seen them take action? How did those seniors…”<br/><br/>Yu Xian shook his head, “To our shame, we hadn’t even begun to act before we were suppressed by our master.”<br/><br/>“Yes, the master was too strong; we didn’t have the slightest chance to fight back,” Chen Xian added.<br/><br/>This made Fang Hanyu and Fang Bai look towards Fang Wang with curious and admiring eyes.<br/><br/>Fang Wang casually remarked, “What do you think, should I take a trip to Heaven’s Larceny Saint Sect?”<br/><br/>Upon hearing this, everyone froze. Though he spoke lightly, they all felt his murderous intent.<br/><br/>Elsewhere.<br/><br/>Zhu Yan was engulfed in successive layers of encirclement. Surrounded and attacked by several Mahayana practitioners, he found himself on the receiving end of blows, but his vigorous vitality meant that despite taking numerous spells to his body, he was not seriously harmed.<br/><br/>Chang Shengzun and Dugu Wenhun clashed fiercely, but inevitably, the Nirvana Realm had the upper hand.<br/><br/>Each of his palms was ferocious and overbearing. He didn’t even summon his Lifespirit Treasure or wield the great sword in his left hand, suppressing Dugu Wenhun with one palm alone.<br/><br/>Even though their battle took place thousands of zhang in the sky, their oppressive might still made the ground below tremble, with some mountains even beginning to split apart.<br/><br/>Ji Rutian, sword in hand, approached the battle. His gaze fixed on Dugu Wenhun.\t\t\t\t\t\t</div>", "images": {}, "success": true}