{"id": 193, "url": "https://www.novelhall.com/i-became-an-immortal-on-mortal-realm-32879/14315958.html", "title": "Chapter 193 - Chapter 193: Chapter 190: I Wonder If Heaven’S Larceny Saint Sect Is As Tough To Deal With As Emperor Sea", "volume": 2, "volume_title": "Volume 2", "body": "<h1>Chapter 193 - Chapter 193: Chapter 190: I Wonder If Heaven’S Larceny Saint Sect Is As Tough To Deal With As Emperor Sea</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 193: Chapter 190: I Wonder If Heaven’s Larceny Saint Sect is as Tough to Deal With as Emperor Sea<br/><br/>Translator: 549690339<br/><br/>Fang Wang’s return shook the entire Fang Residence to its core. Homing pigeons left the Fang Residence, flying in all directions, while the news spread throughout Southern Hills City.<br/><br/>In front of the Manor’s Main Courtyard, Fang Family Disciples formed circles upon circles, and there were even people on the walls, all looking towards the great hall, eager to catch a glimpse of Fang Wang’s grace. “Is it really Grandfather Fang Wang who has returned?”<br/><br/>“With such a commotion, it must be true.”<br/><br/>“I wonder what realm Uncle Fang Wang has reached by now. He is Grand Qi<br/><br/>Cultivation Realm’s number one genius. By now, he’s probably surpassed the<br/><br/>Condensation Spirit Realm and reached an even higher realm.”<br/><br/>“You brats, not even having reached the Spirit Elixir Realm, dare to ponder over Fang Wang’s realm. Truly ignorant of the immensity of heaven and earth.”<br/><br/>“Has Grandfather Fang Wang returned because Heaven’s Larceny Saint Sect is moving southward?”<br/><br/>Fang Family Disciples from different generations discussed fervently, all very excited.<br/><br/>Fang Wang was the most dazzling person in Fang Family history and their greatest pride. Now, as everyone in Grand Qi could access the Qi Gathering techniques and Cultivation World legends naturally flowed among the common folk—propelled by both the imperial court and the Nine Great Sects—Fang Wang had become a symbolic figure of Grand Qi, elevating its status in the southern regions of the continent.<br/><br/>Inside the great hall, Fang Wang was catching up with his grandfather and uncles. His father, Fang Yin, was serving in the Imperial City and would not be able to return for another two days.<br/><br/>Fang Meng listened enthusiastically to Fang Wang’s overseas experiences, and so did the other Fang Family elders.<br/><br/>On the other hand, Xiao Zi, Dugu Wenhun, Chu Yin, Zhu Yan, Qu Xunhun, and The Three Immortals of the Emperor Sea, led by Fang Hanyu, settled in. They were also very interested in the Fang Family, curious about what kind of family could produce a person like Fang Wang.<br/><br/>Gradually, as they learned about Fang Wang’s life, they couldn’t help but marvel.<br/><br/>That Fang Wang could slay Cultivators before even starting his Cultivation journey and save his family from life-and -death crises was truly incredible.<br/><br/>The more incredible it seemed, the more convinced they became that Fang Wang was indeed an Immortal reincarnate.<br/><br/>In this world of Cultivation, there were no shortage of legends about Immortal Gods descending to the mortal plane.<br/><br/>It wasn’t until dusk fell that Fang Wang finally managed to escape the curiosity of his elders, retreating to the courtyard he used to live in.<br/><br/>For the next while, Fang Wang planned to stay at the Fang Residence for a few years to integrate his Swordsmanship.<br/><br/>The next morning, he informed everyone else of his decision, and no one objected. To them, it didn’t matter where Fang Wang went—they would follow. The location was not important; what mattered was sticking with Fang Wang.<br/><br/>Introduced by Fang Hanyu, the Fang Family elders realized that the individuals following Fang Wang were all significant figures far beyond those in Grand Qi Cultivation Realm, and the Fang Family dared not neglect them.<br/><br/>Fang Meng even took the initiative to seek out The Three Immortals of the Emperor Sea and make their acquaintance.<br/><br/>All four seemed frail with age, but the actual age gap between them was massive. Upon learning that The Three Immortals of the Emperor Sea had lived for over two thousand years, Fang Meng couldn’t help but show his utmost respect.<br/><br/>Through The Three Immortals of the Emperor Sea, Fang Meng learned about Fang Wang’s deeds in the Emperor Sea and fell silent.<br/><br/>It was not surprise that he felt; Fang Wang had killed many enemies in Grand Qi and understood why he slaughtered millions for his brother. It was just that he felt sorrow.<br/><br/>Once upon a time, he had been the pillar of the Fang Family, but now, in the face of his descendants’ hardships, he could do nothing.<br/><br/>He began to drink his sorrows away while The Three Immortals of the Emperor Sea poured him more wine and pressed him for stories of Fang Wang’s childhood. Their curiosity about Fang Wang knew no bounds; having lived so long and seen countless geniuses, none could compare to Fang Wang.<br/><br/>Dugu Wenhun, Zhu Yan, and Chu Yin practiced their Cultivation in their respective courtyards while Qu Xunhun wandered around Southern Hills City, trying to understand the local scene.<br/><br/>Fang Jing mingled with the young boys and girls of the Fang Family under the guidance of Fang Hanyu, and he was not at all shy.<br/><br/>“Back in the Xuan Dynasty Imperial Palace, the heavens and earth were dark as night. My uncle, carrying me, was surrounded by circle upon circle of foes. They even formed a Formation, beyond anyone’s imagination how terrifying it was. The stars in the sky fell madly, affecting an area a hundred li across, piling up into a towering mountain that reached into the clouds…”<br/><br/>Fang Jing sat on an artificial hill in the pond, gesticulating as he spoke, with hundreds of young boys and girls gathered around the pond, listening tensely to The tale of that earthshattering battle grew more and more captivating, and even adult members of the Fang Family and servants passing by couldn’t help but stop and listen to his story.<br/><br/>Since Fang Wang’s return, every courtyard in the Fang Residence buzzed with talk about him.<br/><br/>As for the protagonist, Fang Wang secluded himself in his courtyard to comprehend the Dao, undisturbed by anyone; Fang Meng had issued an order that no one was to enter his courtyard without Fang Wang’s permission.<br/><br/>Meanwhile, the news of Fang Wang’s return spread throughout the Grand Qi Cultivation Realm. From the second day of his return, Cultivators continuously arrived at Southern Hills City, stirring up more and more bustle.<br/><br/>The delegation was led by Vice Sect Leader Chai Yi and Inheritance Elder Zhao Chuanqian.<br/><br/>Fang Wang received them in his courtyard. They were all very excited and uneasy to see Fang Wang, and through the Jin Xiao Sect, they had heard of the reputation Fang Wang made for himself in the Southern Celestial Sea.<br/><br/>After decades, they were no longer on the same level as him, unable to even fathom his realm.<br/><br/>Fang Wang greeted them with a smile, inquired about Great Abyss Gate’s recent situation, and chatted casually.<br/><br/>Great Abyss Gate’s members felt much more at ease with Fang Wang’s demeanor.<br/><br/>After a good while of conversation, Zhao Chuanqian broached a subject that silenced Fang Wang.<br/><br/>Fang Wang’s master at Great Abyss Gate, Yang Yuanzi, had passed away. After Sect Leader Guang Qiuxian’s death, Yang Yuanzi fell into despair, eventually dying of depression.<br/><br/>The loss of Guang Qiuxian and Lu Yuanjun left Yang Yuanzi without any attachments, and coupled with years of injuries, the heartbroken man reached the end of his life.<br/><br/>“Your master’s last words were a lament, having such a disciple as you,” said Greedy Sleeper, reflectively. “He said he would be waiting in heaven, eager for you to reach heights he never dared to imagine.”<br/><br/>Fang Wang fell silent. Although Yang Yuanzi did not die out of hatred, the departure of an old friend still inevitably brought some sadness to his heart.<br/><br/>The high-ranking members of the Great Abyss Gate felt similar, as Yang Yuanzi was to them a fellow sect member they had spent half their lifetimes with.<br/><br/>The Vice Sect Leader Chai Yi shifted the topic, saying, “Now that Heaven’s Larceny Saint Sect is moving southward, looking at their momentum, it will sweep across Grand Qi within ten years. Fang Wang, did you come back for this reason?”<br/><br/>The Great Abyss Gate had witnessed the strength of Heaven’s Larceny Saint Sect long ago.<br/><br/>Years ago, Heaven’s Larceny Saint Sect nearly collapsed the Grand Qi Cultivation Realm with just two people. If it weren’t for Fang Wang’s intervention, the righteous sects of the Grand Qi Cultivation Realm would have been overthrown.<br/><br/>Fang Wang nodded and said, “That’s right. Have you had any contact with<br/><br/>Heaven’s Larceny Saint Sect? What is their attitude?”<br/><br/>Chai Yi answered, “We’ve had contact. Their stance is very tough. Grand Qi must submit to them. Although they promised they would protect Grand Qi, the Cultivation Realm of Grand Qi must surrender half of its yearly Spirit Stone production. Furthermore, each year, a hundred geniuses must be sent to Heaven’s Larceny Saint Sect for cultivation. They claim it’s to help us cultivate talent, but their ambitions are as clear as day.”<br/><br/>Fang Wang then asked, “What about the dynasties that have surrendered? How are they faring now?”<br/><br/>Upon hearing this, Greedy Sleeper cursed angrily, “Those spineless fools have turned around and are now helping Heaven’s Larceny Saint Sect to attack other dynasties.”<br/><br/>The other cultivators of the Great Abyss Gate joined in cursing angrily. Fang Wang’s expression remained unchanged, but inwardly he couldn’t help but retort, “In a past life, you submitted as well!”<br/><br/>After a long while.<br/><br/>Once everyone had cursed to their satisfaction, Fang Wang asked, “Does Heaven’s Larceny Saint Sect know about my experiences in the Southern<br/><br/>Celestial Sea?”<br/><br/>Chai Yi bitterly smiled and said, “I sent someone to deliver the message, but that disciple’s Spirit Elixir was destroyed. Heaven’s Larceny Saint Sect sent back a message saying that you had joined the Eternal Life Pavilion and would not return. Even if you did, they said, don’t claim you’re the Tian Sheng of the<br/><br/>Eternal Life Pavilion, even if you were a saint, you would not be able to thwart<br/><br/>Heaven’s Larceny Saint Sect’s unification of the continent.”<br/><br/>Zhao Chuanqian said solemnly, “In reality, their words were even harsher.<br/><br/>Heaven’s Larceny Saint Sect is indeed formidable. Since the battle with the Chi Devil Sect, the Great Abyss Gate has joined forces with the Jin Xiao Sect to investigate the north, searching for clues about Heaven’s Larceny Saint Sect’s true strength. To date, we haven’t ascertained it, but their boldness in not fearing the Eternal Life Pavilion certainly means they’re confident.”<br/><br/>He paused, then continued, “Fang Wang, what realm have you actually achieved? If we’re not sure, perhaps we should let it be. We’ve discussed it, and if it’s really not feasible, then we should consider relocating southward, to the Southern Celestial Sea, and establish ourselves there, just like the Jin Xiao Sect did.’<br/><br/>The others all looked at Fang Wang with anticipation and anxiety.<br/><br/>“I wonder if Heaven’s Larceny Saint Sect is as tough to deal with as the Emperor Sea. Since they want to come, let them come. Spread the word that I have returned. If Heaven’s Larceny Saint Sect still wants to come, then I will test their mettle,” said Fang Wang, his tone casual and undisturbed.<br/><br/>The Emperor Sea?<br/><br/>Zhao Chuanqian, Greedy Sleeper, and the others exchanged looks of confusion. They had not heard of the Emperor Sea, nor had the Jin Xiao Sect informed them, as it pertained to the sect’s development.<br/><br/>Chai Yi revealed a smile, saying, “Then we will follow your lead. I, too, wish to witness the grandeur of Tian Sheng.”<br/><br/>After that, Fang Wang continued to chat with them for a good half-hour before they said their farewells, not daring to disturb him further.<br/><br/>Fang Wang did not take Heaven’s Larceny Saint Sect to heart.<br/><br/>No matter how strong Heaven’s Larceny Saint Sect was, it could not possibly be stronger than the Eternal Life Pavilion. If they were that powerful, would they need to linger on the mainland?<br/><br/>The ocean’s resources were even more abundant, and the spiritual energy was much richer.<br/><br/>After seeing off the group from the Great Abyss Gate, Fang Wang continued to study the Sword Dao.<br/><br/>He wanted to combine the Jinghong Divine Sword Art, the Celestial Sword Intent, and the Executioner Immortal Ghost God Sword. Even with the Heavenly Palace, it required a great deal of time.<br/><br/>He planned to merge them two at a time, making the process easier.<br/><br/>First, he would combine the Jinghong Divine Sword Art with the Executioner Immortal Ghost God Sword!<br/><br/>Days passed in this way.<br/><br/>Ever since Fang Wang and the others returned, Fang Residence bustled like New Year’s every day. Sects and noble families from all over Grand Qi took turns visiting Fang Residence, and such liveliness lasted for a whole year.<br/><br/>With the melting snow.<br/><br/>In front of the eaves, Fang Wang sat meditating on the steps, his brow furrowed in deep thought.<br/><br/>Suddenly, his body trembled.<br/><br/>His consciousness had entered the Heavenly Palace.<br/><br/>His eyes opened, and looking at the Heavenly Palace, he couldn’t help but sigh and mutter to himself, “Even though I don’t want to come, I can’t resist.” Despite his sighs, his face was full of smiles.<br/><br/>He had a rough idea about merging the Jinghong Divine Sword Art with the Executioner Immortal Ghost God Sword!<br/><br/>Once successful, his Executioner Immortal Ghost God Sword would become even more powerful.<br/><br/>The fusion of peerless arts does not simply add one to one to equal two, or even three. Sometimes the fusion of certain arts could exhibit effects several times more profound.<br/><br/>His idea was to condense thirty-six ghostly gods, unsure whether it would be successful.\t\t\t\t\t\t</div>", "images": {}, "success": true}