{"id": 192, "url": "https://www.novelhall.com/i-became-an-immortal-on-mortal-realm-32879/14315957.html", "title": "Chapter 192 - Chapter 192: Chapter 189: Seas Change Into Mulberry Fields, Returning To One’S Old Home", "volume": 2, "volume_title": "Volume 2", "body": "<h1>Chapter 192 - Chapter 192: Chapter 189: Seas Change Into Mulberry Fields, Returning To One’S Old Home</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 192: Chapter 189: Seas Change into Mulberry Fields, Returning to One’s Old Home<br/><br/>Translator: 549690339<br/><br/>Fang Wang asked Fang Hanyu to stay behind, and after resting for a few days, he prepared to return to Grand Qi.<br/><br/>Upon hearing that Fang Wang was going out, Zhu Yan, Chu Yin, and Qu<br/><br/>Xunhun all expressed their desire to follow, and even more so did The Three Immortals of the Emperor Sea, they simply wanted to cultivate the Heavenly Emperor Imperial Mirror with Fang Wang.<br/><br/>After thinking about it, Fang Wang decided to take everyone with him, assigning the monsters the task of guarding Biyou Island.<br/><br/>When it was time to leave, Yang Du bid farewell to Fang Wang. He had memorized all the mental methods of True Combat Technique, and his cultivation would be the same anywhere he went; plus, he had his own opportunities to pursue.<br/><br/>Fang Wang didn’t stop him, letting him go directly.<br/><br/>Qu Xunhun brought out his Law Ship, which was different from the previous one, even larger and grander, being a hundred Zhang long with six floors; in modern-day terms, it was almost as huge as an aircraft carrier.<br/><br/>Fang Wang lay on the eaves at the top of the pavilion, basking in the sun, while others practiced cultivation or chatted on the deck.<br/><br/>Fang Hanyu sat cross-legged next to Fang Jing, looking at everyone on the ship with a sense of unreality still lingering in his heart.<br/><br/>Three cultivators of the ninth layer of Nirvana Realm, a sea prodigy of the<br/><br/>Nineth Layer of the Mahayana Realm, and the Golden Body Realm Son of the Demon Emperor.<br/><br/>Just these five people alone would be enough to sweep the continent, right?<br/><br/>And then there was Fang Wang!<br/><br/>How strong exactly was Fang Wang to make the Great Cultivators of the ninth layer of Nirvana Realm willingly serve him…<br/><br/>When Fang Hanyu previously heard about Fang Wang’s achievements in Emperor Sea at the Jin Xiao Sect, he was filled with surging emotions, but when he learned about the cultivation level and background of The Three Immortals of the Emperor Sea, he couldn’t help but be shocked.<br/><br/>Xiao Zi looked at Dugu Wenhun and teasingly asked, “Yang Du has left, and you’ve heard the teachings of the Heavenly Emperor Imperial Mirror too, so why aren’t you leaving? Do you have other plans? If you intend to pledge loyalty, do it early; don’t miss the chance. As time passes, your status will only get lower.”<br/><br/>Dugu Wenhun stood in front of the railing at the edge of the ship, overlooking the scenery at the edge of the sea. Hearing Xiao Zi’s question, he chuckled softly and turned his head to look up at Fang Wang on the rooftop, saying, “Brother Fang, now that the number of people following you is increasing, why not establish a sect?”<br/><br/>As soon as these words were uttered, Zhu Yan, Chu Yin, and Qu Xunhun all showed interest.<br/><br/>Zhao Zhen, floating in the air, clapped and cheered, “Good, I think it’s a wonderful idea; indeed we could establish a sect.”<br/><br/>The young Fang Jing stood up and shouted, “Uncle, I think it’s possible!”<br/><br/>Xiao Zi cursed under her breath; this Dugu Wenhun didn’t want to be a servant nor a mount, but he sure had ideas.<br/><br/>Fang Wang, who was sunbathing, spoke nonchalantly, “Found a sect? Troublesome, I don’t want to worry about it. If I really wanted to be a sect hierarch, I would have become one long ago.”<br/><br/>He was someone who had even refused the position of the Great Abyss Gate’s Hierarch.<br/><br/>“Actually, founding a sect isn’t necessarily about power, and you don’t have to manage it. In the early days of humanity, the powerful founded sects not for control, but to gather like-minded people and to propagate their own teachings. In such sects, there’s no intrigue, no power struggle; everyone just seeks the Dao. Brother Fang, you already have the heart to teach; why not establish such a sect? With your ability, perhaps you can bring a breath of fresh air to this murky world.”<br/><br/>Dugu Wenhun spoke earnestly, and his words made everyone fall into contemplation.<br/><br/>He continued, “The Hongxuan Emperor, the Descending Dragon Great Saint— all once brought prosperity and glory to the Mortal Realm, but they perished for opposing the Immortal Gods. Sometimes I wonder if there are really gods born superior to others. If there are true Immortal Gods, then why do so many sufferings persist in the Mortal Realm? Did the Immortal Gods abandon humanity, or are they not as divine as we think, lacking the divinity to shelter the people?”<br/><br/>“Regardless of the case, the Immortal Gods are not that important. They even fear the development of the Mortal Realm. What is the difference between the Mortal Realm and The Upper Realm? Perhaps it is because the Mortal Realm has too much strife, and people only seek their own benefits when cultivating, with profound methods forever held in the hands of a few sects. It is this disparity that allows those sects to maintain a sense of superiority, forever lofty and high above.”<br/><br/>These words made even Fang Wang see Dugu Wenhun in a new light.<br/><br/>Speaking of which, he did not understand Dugu Wenhun very well, only knowing that he was one of the Southern Celestial Four Heroes.<br/><br/>The young Fang Jing also fell into deep thought because of Dugu Wenhun’s words.<br/><br/>Dugu Wenhun added, “There are countless opportunities in the world, and there have been many sages and emperors since ancient times. The Southern Celestial Sea also has chances not inferior to the Heavenly Emperor Imperial<br/><br/>Mirror, but what I admire most is the Hongxuan Emperor. He refused The Upper Realm, defied the Immortal Gods, and even though he died, he lived a life of brilliance. He will forever shine brightly and live eternally in the hearts of the people.”<br/><br/>At that moment, Fang Wang’s voice floated down:<br/><br/>“If I were to establish a sect and made you the deputy sect leader, could you guarantee that the sect would develop as you have described?”<br/><br/>Dugu Wenhun’s eyes lit up, “Of course I can guarantee it. I’ve lived for more than four hundred years and know plenty of cultivators and monster cultivators. I can gather a like-minded group.”<br/><br/>“There’s no need for that. Those who come for the purpose of founding a sect have ulterior motives. I will think more about this matter.’<br/><br/>Fang Wang casually replied, and Dugu Wenhun, with words on the tip of his tongue, ultimately decided to suppress his thoughts.<br/><br/>Some things indeed should not be rushed unnecessarily.<br/><br/>“What do you think, if the young master were to establish a sect, what name should it have?” Xiao Zi asked enthusiastically, sparking a lively debate among those on the ship.<br/><br/>Everyone began to fantasize about it.<br/><br/>Fang Wang was also pondering Dugu Wenhun’s words.<br/><br/>Because of Zhou Xue’s existence, he too felt that The Upper Realm was not as wonderful as portrayed. After ascending, one would lose freedom; it seemed like the Mortal Realm was kept like livestock by The Upper Realm.<br/><br/>Judging from the words of the Descending Dragon Great Saint and Executioner<br/><br/>Immortal Great Saint, it seemed that as soon as a great saint emerged in the Mortal Realm, they would draw the attention of The Upper Realm. If too powerful, they could even bring about their own demise.<br/><br/>If he were to stay in the Mortal Realm, why should he not be prepared to stand alone against The Upper Realm?<br/><br/>Of course, compared to trusting others, Fang Wang trusted himself more.<br/><br/>He was willing to guide others, allowing more powerful individuals to emerge in the Mortal Realm, but he would not go out of his way to cultivate power and delay his own cultivation.<br/><br/>Just like the Xuan Dynasty, despite its overall strength, not one person could contend with Fang Wang, which allowed him to slaughter at will.<br/><br/>If he wasn’t strong enough, it would lead to the enemy ruthlessly slaughtering his people.<br/><br/>Fang Wang’s thoughts gradually drifted away, as he began to contemplate integrating all of his swordsmanship to make the Executioner Immortal Ghost God Sword even more powerful!<br/><br/>Although the Heavenly Emperor Imperial Mirror was formidable, its power was limited by his current realm, preventing Fang Wang from fully unleashing its divine might.<br/><br/>He needed to create an even stronger killing move!<br/><br/>At the very least, when facing more than twenty cultivators of the Nirvana Realm, he wouldn’t be unable to kill even one.<br/><br/>In Grand Qi, Southern Hills City.<br/><br/>Dozens of years had passed, and Southern Hills City had grown to become the second largest city in Grand Qi, surpassed only by the Imperial City. In terms of prosperity, it was even more flourishing than the Imperial City.<br/><br/>The Fang State Duke’s Mansion held an even more extraordinary status, with the townspeople all knowing that the Fang Residence was protected by an immortal.<br/><br/>The current Fang Residence was thriving with over ten thousand family members. This number didn’t even include those Fang family members who were pursuing cultivation elsewhere or serving in the government.<br/><br/>Within a courtyard.<br/><br/>Lady Jiang, Fang Wang’s mother, sat in a small pavilion, sipping tea while watching the goldfish in the pond, even though her gaze was distant.<br/><br/>She was 160 years old now, and although she had taken the Cultivation World’s Youth-preserving Elixir, the signs of age on her face were difficult to hide.<br/><br/>At this moment, a richly dressed woman, accompanied by a group of maids, approached amid joyous laughter and raucous chatter, breaking the silence in the courtyard.<br/><br/>Lady Jiang snapped back to reality and looked at her daughter, Fang Ling, with displeasure. “You’re always so boisterous and lacking in propriety. Remember, you are about to become the chief disciple of the Great Abyss Gate.”<br/><br/>Fang Ling, with her carefree nature, sat next to Lady Jiang and poured herself a cup of tea, laughing as she said, “Mother, what’s so good about being the chief disciple? It might sound prestigious, but in reality, it’s just a bottleneck that those without immortal fate can strive for. I don’t want it, but those Great Abyss Gate elders insist on it. I know they don’t really care about me; they have their eyes on my brother. Without me, he might never come back in his lifetime.”<br/><br/>Lady Jiang glared at her. “Nonsense, how could your brother possibly not return?”<br/><br/>Fang Ling stuck out her tongue playfully. “Oh, I mean, he looks down on this land of Grand Qi. I heard from the seniors of the Jin Xiao Sect that he’s now a Heavenly Dao True Man of the Eternal Life Pavilion! Mother, you might not know this, but the Eternal Life Pavilion is a sect thousands of times more formidable than the Great Abyss Gate.”<br/><br/>She began to excitedly recount Fang Wang’s many exploits, and Lady Jiang listened intently, her face beaming with pride.<br/><br/>Having a son like Fang Wang was indeed her greatest pride in life.<br/><br/>After Fang Ling finished speaking and was pouring herself more tea, Lady Jiang sighed and said, “Ah, your second brother doesn’t have the same kind of good fortune as your elder brother. Lacking in talent, he insisted on making his way overseas. He even got married and had children without telling us. You mustn’t be so reckless as to casually promise yourself to a man of unknown origin, you hear?”<br/><br/>When Fang Ling heard her mother mention Fang Xun, she too began to feel saddened.<br/><br/>She and Fang Xun were twins, grown up together, and very close. The death of Fang Xun had left her in grief for a full two years.<br/><br/>For a while, both mother and child fell silent.<br/><br/>After a long while.<br/><br/>Excited commotion echoed from afar, and even the Fang family cultivators were seen flying across the courtyard sky, heading straight for the grand entrance of the Fang Residence.<br/><br/>Lady Jiang asked, surprised, “What’s with all this commotion?”<br/><br/>As a cultivator herself, Fang Ling had exceptional hearing. She stood frozen on her seat as if struck by lightning.<br/><br/>Lady Jiang shook her, bringing her back to her senses. “My brother is back! My elder brother is back!”<br/><br/>Fang Ling suddenly stood up, exclaiming excitedly.<br/><br/>On hearing this, Lady Jiang too leapt to her feet in excitement, knocking over her chair and staggering a little, only to be steadied by a hand gripping her wrist. She turned her head to look and, upon seeing the face of the person holding her, her eyes instantly reddened.<br/><br/>“Wang’er…” Lady Jiang called out in surprise, tears uncontrollably welling up in her eyes.<br/><br/>Fang Wang watched Lady Jiang’s face, maintaining a smile, though his heart was filled with a multitude of emotions.<br/><br/>To Lady Jiang, it might have been just a few decades since they last saw each other.<br/><br/>But for Fang Wang, it was nearly twenty thousand years.<br/><br/>As the saying goes, time flies, how truly apt.<br/><br/>With a thousand words stuck in his throat, Fang Wang found himself at a loss for words. Instead, he presented Fang Jing, who was standing behind him, to the forefront, and said with a smile, “Mother, do you see who this is?” Lady Jiang’s gaze shifted to Fang Jing and she instinctively said, “Xun’er…”<br/><br/>Fang Jing felt a bit nervous; he recalled his granduncle’s words and carefully said, “Grandmother, my name is Fang Jing.”<br/><br/>Lady Jiang embraced Fang Jing tightly, crying as she spoke, “My dear grandson, you’ve suffered so much over these years…”<br/><br/>Fang Ling was also very moved as she looked at Fang Wang, her eyes filled with admiration, surprise, and a mix of many other emotions.<br/><br/>She had heard the numerous legends about Fang Wang; there were even some things she had not shared with her family, such as Fang Wang’s solo expedition into the Emperor Sea..\t\t\t\t\t\t</div>", "images": {}, "success": true}