{"id": 198, "url": "https://www.novelhall.com/i-became-an-immortal-on-mortal-realm-32879/14404420.html", "title": "Chapter 198 - Chapter 198: Chapter 195 Two Bright Suns, Cause And Effect", "volume": 2, "volume_title": "Volume 2", "body": "<h1>Chapter 198 - Chapter 198: Chapter 195 Two Bright Suns, Cause And Effect</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 198: Chapter 195 Two Bright Suns, Cause and Effect<br/><br/>Translator: 549690339<br/><br/>The Saint Spirit stared at Fang Wang. vet did not take further action. He smiled<br/><br/>enigmatically, his thoughts unknowable.<br/><br/>Fang Wang watched the Saint Spirit, his expression indifferent as he too sensed the aura of the Saint Spirit.<br/><br/>Zhou Xue had previously mentioned that the Heaven’s Larceny Saint Sect had resurrected a Saint Spirit in a past life. Eventually, the Saint Spirit broke free from the control of the Heaven’s Larceny Saint Sect, leading to its destruction. The continent was plunged into misery, and had it not been for an extraordinary fighter from the Mortal Realm who stepped in to annihilate the Saint Spirit, the consequences would have been unimaginable.<br/><br/>The Saint Spirit before him was indeed fearsome, but not to the extent that it required the intervention of an extraordinary fighter from the Mortal Realm.<br/><br/>After all, realms beyond Nirvana existed, and the Hongxuan Emperor created the Heavenly Emperor Imperial Mirror, which was six major realms higher than the Mahayana Realm. Furthermore, it was very possible that the Heavenly Emperor Imperial Mirror was just a turning point for the Hongxuan Emperor, rather than the end.<br/><br/>Amidst the rolling dust between the distant mountains, Dugu Wenhun flew out, his body covered in blood, his hair crown gone, and his hair a mess, appearing utterly disheveled.<br/><br/>On the ground, a pile of shattered stones split apart, and Ji Rutian climbed out. He swayed as he stood atop the ruins, looking even more miserable than Dugu Wenhun.<br/><br/>Ji Rutian wiped the blood from the corner of his mouth and muttered to himself, “Just one strike nearly shattered my body… truly terrifying.”<br/><br/>His gaze settled on Fang Wang.<br/><br/>Fang Wang, elevated in stature, was clad in untainted white robes, emanating the presence of an Immortal Monarch gracing the Mortal Realm. His bearing caused all the disciples of the Heaven’s Larceny Saint Sect in the distance to turn their attention to him.<br/><br/>Chang Shengzun appeared on the shoulder of the Saint Spirit, looking down at<br/><br/>Fang Wang, and asked, “Are you Tian Dao Fang Wang?”<br/><br/>Fang Wang countered, “How many saints like this does the Heaven’s Larceny Saint Sect have?”<br/><br/>Upon hearing this, Chang Shengzun burst into laughter and said, “Naturally, not a few. The Heaven’s Larceny Saint Sect will cultivate the strongest Saint Spirits. Come now, Fang Wang, join us, follow us in unifying the Mortal Realm, and achieve what the ancient saints and emperors could not.”<br/><br/>Fang Wang replied coldly, “Resurrecting a Saint Spirit requires millions of departed souls, if not more. How many innocent lives have you taken, yet you dare talk about surpassing the ancient saints?”<br/><br/>Chang Shengzun scoffed and laughed, “Since ancient times, those who have achieved great things have all ascended over a mountain of bones. As long as we succeed and then bring prosperity to future generations, posterity will still sing our praises and may even deify us.”<br/><br/>From afar, a deafening roar resounded, as The Three Immortals of the<br/><br/>Emperor Sea made their move, sweeping away the cultivators of the Heaven’s Larceny Saint Sect. Even the Heavenly Monarchs were no match for the assault of the three powerhouses at the ninth layer of Nirvana Realm.<br/><br/>Fang Wang locked eyes with Chang Shengzun, saying, “It seems you summoned so many cultivators here to use them as sacrificial pawns?”<br/><br/>Chang Shengzun laughed heartily, then his gaze turned murderous as he chillingly asked, “Fang Wang, will you bow down?”<br/><br/>At his feet, the Saint Spirit seemed to sense something, then roared, its sharp cries echoing between heaven and earth.<br/><br/>The Saint Spirit raised its arms and miraculously conjured two giant spiritual artifacts—a battle-ax and a shield, both cloaked in black shadows, terrifyingly morbid, with countless souls crawling out from them, trying to escape but utterly unable to leave the artifacts. At first glance, there appeared to be black flames clinging to the weapons, flickering incessantly.<br/><br/>The Saint Spirit fixated on Fang Wang and suddenly uttered human words,<br/><br/>“Eat… eat… I want… you…”<br/><br/>Listening to this voice, Dugu Wenhun and Ji Rutian felt a chill to their bones.<br/><br/>Within Southern Hills City, millions of cultivators and commoners heard this voice, and all were seized with an uncontrollable shiver.<br/><br/>Gu Li and Gu Tianxiong stood on the courtyard wall, observing the posture of the Saint Spirit. With their level of cultiva tion, they could vaguely catch sight of Fang Wang’s figure.<br/><br/>“What is that thing?” Gu Tianxiong asked, swallowing hard and trying to suppress his horror.<br/><br/>Gu Li did not respond, for she too did not recognize this spirit. A look of concern filled her eyes.<br/><br/>The aura of the Saint Spirit was too terrifying; even Gu Li, who had cultivated overseas for decades, had never felt such an aura before.<br/><br/>Cold!<br/><br/>It was the ultimate coldness, laced with murderous intent!<br/><br/>Fang Wang raised his right hand and beckoned to the Saint Spirit with a cocky gesture, exuding an air of nonchalant arrogance.<br/><br/>Seeing this, Chang Shengzun immediately jumped away, and the Saint Spirit charged at Fang Wang. Its gigantic body, over three hundred Zhang tall, whipped up a strong wind, sweeping towards Fang Wang with overwhelming force.<br/><br/>Dugu Wenhun and Ji Rutian stared intently at Fang Wang.<br/><br/>In an instant, Fang Wang slightly bowed his head and glanced at Ji Rutian from the corner of his eye.<br/><br/>Ji Rutian’s pupils dilated. He saw Fang Wang’s gaze, and their eye contact made his heart skip a beat.<br/><br/>Although Fang Wang was looking askance at Ji Rutian below, his right fist swung fiercely toward the Saint Spirit.<br/><br/>The roar of a dragon erupted!<br/><br/>A ferocious and domineering Black Dragon followed Fang Wang’s fist and emerged, like a demon dragon from another realm, piercing through the Saint Spirit’s chest with an outrageously powerful impact and streaking across the sky, vanishing from sight.<br/><br/>The Saint Spirit came to a sudden halt, still holding the two sacred artifacts in its hands. Its soul shivered as it slowly looked down at the hole in its chest, its trembling growing more intense.<br/><br/>“That is…”<br/><br/>Ji Rutian furrowed his brow. He knew Fang Wang had mastered the Mountain River Town Heaven Fist, but the fist move just now was definitely not the Mountain River Town Heaven Fist!<br/><br/>It contained the divine might of the Mountain River Town Heaven Fist, but was far stronger!<br/><br/>Dugu Wenhun was equally shocked. After clashing with the Saint Spirit, he<br/><br/>Imew the terror of its strength and the swiftness of its movements. Even Qian Xian at the ninth layer of Nirvana Realm could not evade the Saint Spirit’s attacks, yet Fang Wang managed to heavily injure the Saint Spirit with a single strike.<br/><br/>What a difference in power!<br/><br/>Dugu Wenhun once again admired Fang Wang’s profound cultivation from the bottom of his heart.<br/><br/>Chang Shengzun hovered in the sky, his smile frozen.<br/><br/>“How is this possible…”<br/><br/>Chang Shengzun clenched the great saber in his hands, sensing the terror of the Saint Spirit. Even though he could manipulate the Saint Spirit, being close to it made him feel afraid.<br/><br/>Fang Wang shifted his gaze to the Saint Spirit, the punch just now was merely a demonstration for Ji Rutian.<br/><br/>Ever since he heard the name Ji Rutian, it had captured his attention.<br/><br/>In this life, his experiences closely mirrored those of Ji Rutian in a former life, and he wanted to test whether Ji Rutian possessed the Mountain River Town<br/><br/>Heaven Fist.<br/><br/>From the look in Ji Rutian’s eyes, it was clear he recognized the Mountain River Town Heaven Fist.<br/><br/>With the probing over, it was time to put an end to the Saint Spirit!<br/><br/>At that moment, the Saint Spirit raised his head, his expression twisted into one of ferocity, rage burning in his eyes. He roared at Fang Wang, abruptly lifting his shield high and smashing it towards Fang Wang. In an instant, black light burst from the colossal shield, enveloping Fang Wang.<br/><br/>Boom!<br/><br/>Fang Wang erupted with boundless Yang Energy, like a volcano bursting forth, scorching flames of Yang Energy surging into the sky, directly scattering the black light and even destroying half of the massive shield, forcing the Saint Spirit to retreat subconsciously.<br/><br/>The rampant Yang Energy burned wildly, with Fang Wang’s white garments billowing intensely. Within the flames, his skin faintly shimmered with golden light, his expression as formidable as that of a deity, turning him into a blazing sun visible to all within the cities far and near.<br/><br/>At first glance, it seemed as if two suns had appeared in the sky!<br/><br/>Ji Rutian’s brows were tightly knitted, his sword-hand trembling slightly. Fear filled his heart, “This isn’t the Heavenly Body… His physical form is even stronger than the Heavenly Body. Could it be that the Descending Dragon Great Saint has another inheritance? No, this isn’t the inheritance of the Descending<br/><br/>Dragon Great Saint!”<br/><br/>Fang Wang soared into the air, flying higher than the Saint Spirit, looking down at him from above.<br/><br/>In that moment, he was like a sun deity gazing down upon a demon roaming the Mortal Realm!<br/><br/>For the first time, fear appeared on the face of the Saint Spirit.<br/><br/>Fang Wang lifted his right hand, and the Rainbow Sword appeared in his grip, followed by the emergence of seven ghostly divine beings, encapsulating the Saint Spirit.<br/><br/>All seven ghostly divine beings stood a hundred yards tall, and although they were not as immense as the Saint Spirit, their collective aura overwhelmed him!<br/><br/>Chang Shengzun’s eyes widened, disbelieving what he saw.<br/><br/>Dugu Wenhun was frightened, “What kind of spell is this?”<br/><br/>Fang Wang raised the Rainbow Sword, and the seven ghostly divine beings followed suit, their sword blades all aimed at the Saint Spirit.<br/><br/>The Saint Spirit looked around in panic, emitting a fierce roar, his massive soul body suddenly burst apart, countless lost souls swept across all directions like a torrential downpour, submerging Fang Wang and the seven ghostly divine beings in an overwhelming tide of souls.<br/><br/>Suddenly!<br/><br/>Streams of black Sword Qi swept across the world like brushstrokes of ink, and in the blink of an eye, the lost souls filling the air were annihilated, then transformed into wisps of black energy that bore into the bodies of the seven ghostly divine beings.<br/><br/>Ji Rutian watched Fang Wang’s silhouette intently, his expression solemn, he struggled to control his emotions, maintaining an appearance of calm.<br/><br/>Dugu Wenhun, witnessing how Fang Wang so effortlessly vanquished the Saint Spirit, wore a look of shock on his face.<br/><br/>The Three Immortals of the Emperor Sea, who were sweeping through the Heaven’s Larceny Saint Sect in the distance, also noticed this scene. “What swordsmanship is that?” “No wonder he could defeat Hongxuan Emperor of the same realm…”<br/><br/>“Hiss… how is that possible…”<br/><br/>The Three Immortals of the Emperor Sea cried out in astonishment, causing the Great Cultivators of the Heaven’s Larceny Saint Sect to turn their heads to look, their eyes wide with despair.<br/><br/>Soul energy swirled towards the seven ghostly divine beings, torming black whirlwinds, while Fang Wang in their midst reached the peak of his aura.<br/><br/>His expression remained unchanged; eradicating the Saint Spirit did not bring him any joy.<br/><br/>The Vajra Invincible Saint Body feared no evil specters, and the Zhu Xian Jing Hong Sword could even devour the power of such malevolence!<br/><br/>It wasn’t an exaggeration to say that if the Saint Spirit were merely a soul body, it would be his natural nemesis!<br/><br/>He turned his attention to Chang Shengzun, and that single glance instantly jolted Chang Shengzun to his senses. His figure flickered, dissipating into explosive Demonic Qi.<br/><br/>Suddenly, Fang Wang swung his sword, and the seven ghostly divine beings all sliced toward a single direction.<br/><br/>Seven streaks of Ghostly Divine Sword Qi cut across the sky, racing towards a rapidly flying Chang Shengzun, who instinctively looked back. Before he could evade, the seven strikes of Ghostly Divine Sword Qi arrived with a speed that rendered him incapable of reaction.<br/><br/>Boom!<br/><br/>Chang Shengzun’s physical body was annihilated; just like the Saint Spirit, he exploded into oblivion, leaving countless lost souls to suddenly appear.<br/><br/>This time, Fang Wang did not swing his sword because he could see that the lost souls inside Chang Shengzun still held their consciousness, unlike those within the Saint Spirit, which had been left with only soul shells and malice, unable to find salvation.<br/><br/>The Yin Yang Xuan Ming Zhen Gong allowed Fang Wang to see through the essence of soul bodies!<br/><br/>Since these innocent lost souls still had the chance for reincarnation, he was willing to leave behind a trace of kindness.<br/><br/>After all, there were countless untamable, un-reincarnatable evil specters beneath the heavens, and the Underworld was filled with numerous such wandering spirits.<br/><br/>Fang Wang turned around to face Ji Rutian.<br/><br/>Ji Rutian, as if facing a formidable enemy, took a deep breath, surprisingly soared into the sky, choosing to confront Fang Wang.<br/><br/>“The Heaven’s Larceny Saint Sect’s purpose in capturing you was to offer you as a vessel for the Saint Spirit. The true strength of the Saint Spirit lies in having a physical body,” Ji Rutian said.<br/><br/>Fang Wang pointed his sword at him and asked, “Do we have any karma?”\t\t\t\t\t\t</div>", "images": {}, "success": true}