{"id": 199, "url": "https://www.novelhall.com/i-became-an-immortal-on-mortal-realm-32879/14404421.html", "title": "Chapter 199 - Chapter 199: Chapter 196 Zhou Tian Daoist Skill, Red Dust Celestial Emperor", "volume": 2, "volume_title": "Volume 2", "body": "<h1>Chapter 199 - Chapter 199: Chapter 196 Zhou Tian Daoist Skill, Red Dust Celestial Emperor</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 199: Chapter 196 Zhou Tian Daoist Skill, Red Dust Celestial Emperor<br/><br/>Translator: 549690339<br/><br/>Facing Fang Wang’s gaze, Ji Rutian remained composed as he replied, “I recognize you, and you might not recognize me, no, perhaps you do recognize me.”<br/><br/>When Fang Wang had swung a punch at the Saint Spirit earlier, he had deliberately glanced at him, and the technique he used was imbued with the essence of the Mountain River Town Heaven Fist. This could not have been a coincidence.<br/><br/>“I was once the Master of the Vast Qi Sect, and having heard of your reputation, I sent people to recruit you. Perhaps my subordinates were rude and you refused. It’s quite funny, actually. Afterwards, it was the Vast Qi Sect who recommended that I personally issue an order to recruit you. When the effort failed, they turned and blamed me instead.”<br/><br/>Ji Rutian spoke nonchalantly and continued, “Later, I joined the Heaven’s Larceny Saint Sect, and I took on the task of subduing the Chu Dynasty. I killed seventy percent of the Vast Qi Sect’s cultivators.”<br/><br/>Fang Wang eyed him sideways, “Oh? Give me one reason not to kill you.”<br/><br/>Originally, he didn’t harbor much hostility towards Ji Rutian, but Ji Rutian had once conspired with the Vast Qi Sect against him, and now he had joined the Heaven’s Larceny Saint Sect to capture him. Fang Wang was not that magnanimous.<br/><br/>Hearing this, Ji Rutian didn’t panic. He held up his sword, pointing it at Fang Wang, and laughed, “If you want to kill me, fine. It will be a good opportunity for me to test the power of the Heavenly Dao. Let’s see just how strong you are, being the same age as me.”<br/><br/>With those words, Fang Wang realized that Ji Rutian had been targeting him all along.<br/><br/>Fang Wang retracted the Rainbow Sword, and the seven imposing ghosts vanished with it.<br/><br/>“If you can withstand one punch from me, I will spare your life,” Fang Wang said expressionlessly.<br/><br/>Ji Rutian smiled and immediately stretched out his left hand, index and middle fingers outstretched, slicing across the sword blade. His blood sprayed out, and the blade was engulfed in a crimson flame. The blood-colored blaze burned fiercely, with flames reaching hundreds of meters high.<br/><br/>Seeing Ji Rutian ready, Fang Wang slowly raised his right hand, gradually clenching it into a fist.<br/><br/>In an instant, a terrifying pressure enveloped heaven and earth, and every living being in Grand Qi could feel it, causing everyone in Southern Hills City to shiver in dread, not knowing the situation, and fearing a more terrifying demon was about to attack.<br/><br/>Fang Wang walked on air towards Ji Rutian.<br/><br/>Instead of retreating, Ji Rutian advanced, leaping into the air and slashing towards Fang Wang with his sword. As the sword tip pointed to the sky, the Sword Intent pierced the heavens, and blood-light covered the earth.<br/><br/>In almost an instant, Ji Rutian charged in front of Fang Wang and swung his sword at Fang Wang’s head.<br/><br/>Dugu Wenhun frowned, not expecting Ji Rutian to have such fast movement.<br/><br/>NO!<br/><br/>It was some kind of secret technique!<br/><br/>Boom!<br/><br/>Accompanied by a thunderous roar, a tumultuous wave of energy swept across the sky, unstoppable, churning the sea of clouds like the ocean under a storm, with waves crashing tumultuously.<br/><br/>Ji Rutian stood before Fang Wang, his sword less than twenty centimeters from Fang Wang’s head, but even that short distance became an insurmountable life-and-death gap.<br/><br/>Fang Wang’s right fist had pierced through Ji Rutian’s chest, with blood continuously gushing from the wound as Ji Rutian spat out blood from his mouth.<br/><br/>Fang Wang, showing no expression and radiating white flames, exhibited the power of the Heavenly Dao True Skill. This aura prevented Ji Rutian’s blood from splattering on his face and used the Spiritual Power of the Heavenly Dao True Skill to fend off Ji Rutian’s sword.<br/><br/>With difficulty, Ji Rutian raised his eyes to Fang Wang, his face revealing a smile. He grinned wildly, and through gritted teeth, said, “Indeed, it is the<br/><br/>Mountain River Town Heaven Fist… and your mastery far surpasses mine…<br/><br/>Your destiny is truly the strongest of this era…”<br/><br/>Fang Wang stared at him without retracting his fist, allowing him to continue. Ji Rutian showed no fear of imminent death. Staring intently at Fang Wang while coughing up blood, he said, ‘When I was born, a diviner in my clan foresaw someone with a destiny that clashed with mine, born on the same year, same month, and same day as I… and so I traveled southward… Your growth was too rapid…”<br/><br/>Fang Wang asked, “Are you not afraid that I will hunt you down later?”<br/><br/>He finally understood; Ji Rutian possessed a sort of secret technique that made him unafraid of death. Ji Rutian’s soul was dissipating faster than the life forces in his flesh and blood.<br/><br/>Despite mastering many ultimate techniques, Fang Wang could not forcibly prevent the dispersal of his soul.<br/><br/>Ji Rutian stretched his mouth into a smile and said, “It’s destiny, not something you can escape from simply because you’re afraid. Fang Wang, my destined nemesis, you had better survive well. I want to witness you at the pinnacle of the Mortal Realm. Only by defeating you like that can I break free from fate…”<br/><br/>Boom!<br/><br/>All of a sudden, Ji Rutian’s body exploded, his flesh scattering in all directions.<br/><br/>Fang Wang remained indifferent and mumbled to himself, “Destiny? What utter nonsense.”<br/><br/>He flew towards Southern Hills City; as for the distant Heaven’s Larceny Saint Sect, he left it to the Three Immortals of the Emperor Sea and others to handle; there was no need for him to step in again.<br/><br/>Dugu Wenhun watched Fang Wang’s retreating figure, hesitating to speak.<br/><br/>He had always known Fang Wang was strong, but only today did he genuinely feel it.<br/><br/>He suddenly felt very fortunate about his previous decision, his gaze growing even more resolute.<br/><br/>As Fang Wang stepped through the air above Southern Hills City, cheers rose throughout the city, starting with the Fang Family cultivators, then spreading to cultivators from all walks, and finally, the common people.<br/><br/>Soon, everyone knew that the person in the sky was Fang Wang, and his return signified the end of this ordeal.<br/><br/>Earlier, the visage of the Saint Spirit had been terrifying, coupled with the horrifying aura and pressure that rose and fell, most people in the city were anxious. The name of the Heaven’s Larceny Saint Sect had already spread across Grand Qi in previous years, and they all knew that if Fang Wang were defeated, Grand Qi would surely be consumed by the Heaven’s Larceny Saint Sect.<br/><br/>Fortunately, Fang Wang won!<br/><br/>The once formidable Heaven’s Larceny Saint Sect was no match for Grand Qi’s number one man!<br/><br/>Back in his courtyard, Xiao Zi and the others all rushed to him excitedly, even Fang Bai looked up to Fang Wang with eyes full of admiration.<br/><br/>Fang Wang looked at Fang Hanyu and said, “I plan to return to Sword Heaven Marsh to cultivate. From now on, you’ll stand guard over the Fang Residence for me. As long as the Heaven’s Larceny Saint Sect dares to march into Grand Qi, I’ll be able to sense it immediately. With my speed, I can be back to Fang<br/><br/>Residence in no time.”<br/><br/>Fang Hanyu nodded without objection, the visage of the Saint Spirit still lingered in his mind.<br/><br/>Fang Wang walked to the stone table beside him and began to taste the tea, while the others discussed the strengths of the Three Immortals of the Emperor Sea, Dugu Wenhun, and Zhu Yan.<br/><br/>Although in this battle Fang Wang still appeared very dominant, he decided not to be reckless and to first surge in cultivation level before anything else.<br/><br/>The Heaven’s Larceny Saint Sect and Ji Rutian each had their own trump cards. The Heaven’s Larceny Saint Sect possessed the Saint Spirit, the strongest of which could even threaten the entire Mortal Realm, while Ji Rutian had the Cicada Shedding Technique. Although he was still hiding the Heavenly Emperor Imperial Mirror, he could not be consumed by the power of his ultimate technique.<br/><br/>His own cultivation level was what mattered most!<br/><br/>Meanwhile.<br/><br/>On the other side of the world, inside a cave.<br/><br/>Ji Rutian, who was meditating on a stone bed, opened his eyes, which were surprisingly purple, giving off a ghostly aura in the dark cavern.<br/><br/>Blood trickled from the corner of his mouth. He wiped the blood and muttered softly, “Fang Wang, I thought I had overestimated you, but it turns out I still underestimated you in the end. How could there be such a genius in this world?<br/><br/>It’s truly enviable.”<br/><br/>He looked down at his right palm where nine red moles were visible; one of them was fading.<br/><br/>After a while.<br/><br/>Footsteps were heard in the cave tunnel ahead; Ji Rutian wiped the blood seeping from the corner of his mouth again and looked up.<br/><br/>“Your aura is in such disarray, have you sacrificed a cycle of your Zhou Tian Daoist Skill?”<br/><br/>A hoary voice came through, and a black-robed elder appeared. He had white hair and a long white beard that reached down to his belly, a cold face, and eyes that held a sharp chill.<br/><br/>Ji Rutian answered, “Yes, that avatar was killed by Fang Wang.”<br/><br/>Speaking of the incident, his tone was calm and light, as if it were a minor matter not worth mentioning.<br/><br/>The black-robed elder started calculating upon hearing this.<br/><br/>“Strange indeed, you two have established karma, yet I still cannot deduce it, as if this person does not exist in this world,” murmured the black-robed elder.<br/><br/>Ji Rutian looked at the black-robed elder and asked, “Master, if I can cultivate the Zhou Tian Daoist Skill to Great Completion, can I truly become an Immortal?”<br/><br/>The black-robed elder raised his hand to stroke his beard and said, “Naturally, you are the disciple I’ve chosen. Facing a genius like Fang Wang is not a bad thing. Throughout history, every strong figure who has reached the summit has encountered tough rivals. The stronger Fang Wang becomes, the greater the enhancement to your Dao heart will be if you can defeat him.”<br/><br/>Ji Rutian then inquired, “Fang Wang and I were born on the same day, same month, same year. Master, why didn’t you choose Fang Wang but chose me instead?”<br/><br/>The black-robed elder sat down on the spot, continuously calculating fate with his hands while replying, “You have your own destined Immortal fate, do not worry too much.”<br/><br/>Ji Rutian fell silent for a moment before asking again, ‘What is our next move?”<br/><br/>The black-robed elder’s hands burst into light, with many tiny and mysterious runes swirling in his palms.<br/><br/>He closed his eyes and slowly said, “We should go in search of the Cave<br/><br/>Heavens of the Red Dust Celestial Emperor.”<br/><br/>“Who is the Red Dust Celestial Emperor? Why haven’t I heard of him?” Ji Rutian asked with surprise, for he was familiar with many legends and myths within the Ji Family.<br/><br/>The black-robed elder answered, “The Red Dust Celestial Emperor was an Immortal God who came from the Upper Realm. He spent a million years in the Mortal Realm and became one with it.”<br/><br/>Upon hearing this, Ji Rutian couldn’t help but smile.<br/><br/>An Immortal God?<br/><br/>Fang Wang, I wonder if you will be able to obtain the Immortal Law!<br/><br/>At twilight.<br/><br/>In the courtyard, Zhu Yan was sitting in a corner meditating and healing his injuries, looking very ragged.<br/><br/>The Three Immortals of the Emperor Sea and Dugu Wenhun stood in front of Fang Wang, analyzing the origin of the Saint Spirit.<br/><br/>“According to those guys, the Saint Spirit is transformed from ancient demon spirits, so we really have to be careful.”<br/><br/>“Legends say that long ago, a group of heaven demons descended upon the Mortal Realm and brought calamity that lasted for thousands of years. After these heaven demons were executed, their souls wandered the Mortal Realm, undetectable even by the Great Saints, who couldn’t completely eradicate them.”<br/><br/>“The Heaven’s Larceny Saint Sect is playing with fire, ancient demon spirits are not something they can control.”<br/><br/>The Three Immortals of the Emperor Sea said in unison, looking very worried.<br/><br/>In the end, they even offered to confront the Heaven’s Larceny Saint Sect.<br/><br/>Dugu Wenhun added, “The Heaven’s Larceny Saint Sect has more than one Saint Spirit under its control. We cannot be careless.”<br/><br/>The Three Immortals of the Emperor Sea chimed in:<br/><br/>“Let us brothers take care of it. Even if we truly encounter a Saint Spirit that is an overwhelming foe, we will still be able to escape.”<br/><br/>“Escape? Dying for the peace of the Mortal Realm would be glorious, wouldn’t<br/><br/>“Speaking of which, the five Saint Venerates of the Heaven’s Larceny Saint Sect might have once received our guidance. It’s only right for us to resolve this matter.”<br/><br/>After thinking for a moment, Fang Wang ultimately declined; he asked the Three Immortals of the Emperor Sea to remain at the Fang Residence and stand guard first, giving him time to cultivate.<br/><br/>With his current strength, he had few rivals. Even the Three Immortals of the Emperor Sea were no match for him, but he felt he should not be careless.<br/><br/>He would first make a breakthrough into the Mahayana Realm!\t\t\t\t\t\t</div>", "images": {}, "success": true}