{"id": 191, "url": "https://www.novelhall.com/i-became-an-immortal-on-mortal-realm-32879/14315514.html", "title": "Chapter 191 - Chapter 191: Chapter 188: Heaven’S Larceny Saint Sect Heads South", "volume": 2, "volume_title": "Volume 2", "body": "<h1>Chapter 191 - Chapter 191: Chapter 188: Heaven’S Larceny Saint Sect Heads South</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 191: Chapter 188: Heaven’s Larceny Saint Sect Heads South<br/><br/>Translator: 549690339<br/><br/>Speaking of the Peacock Great Saint, The Three Immortals of the Emperor Sea went on and on, also depicting the image of the Peacock Great Saint.<br/><br/>Although the Peacock Great Saint had a human shape, he still bore the appearance of a peacock, a peacock with a human-like silhouette, and was immensely huge. Legend had it that there were moving mountains deep in the Emperor Sea, which were actually the Peacock Great Saint swimming around.<br/><br/>Dugu Wenhun had also heard of this legend and thus struck up a conversation with The Three Immortals of the Emperor Sea about it.<br/><br/>With the four of them joining, the journey was less lonely.<br/><br/>On the way, they occasionally encountered pirates at sea. The Three Immortals of the Emperor Sea deliberately left survivors and announced their names.<br/><br/>After repeated battles, the story of The Three Immortals of the Emperor Sea joining under Tian Dao Fang Wang spread far and wide, growing intensively.<br/><br/>This was not at the behest of Fang Wang. After learning why Fang Wang had come to the Emperor Sea, The Three Immortals had decided to act accordingly.<br/><br/>Besides trying to please Fang Wang, they also hoped to directly sever the chain of hatred between the Emperor Sea and Fang Wang, preventing more cultivators from the Emperor Sea from coming to die needlessly.<br/><br/>If they were no match for Fang Wang when united, what chance did the other cultivators from the Emperor Sea stand?<br/><br/>Fang Wang tacitly approved, since The Three Immortals of the Emperor Sea were willing to accommodate him, he naturally did not bother with the slaughter. He wasn’t someone who deligh ted in killing, even though his hands were already stained with much blood.<br/><br/>This incident, however, made him regard The Three Immortals of the Emperor Sea in a higher light.<br/><br/>Despite appearing mad and unruly, these three indeed bore the grace of immortals.<br/><br/>As immortals, The Three Immortals of the Emperor Sea were already the stuff of legends. When the news spread to all the major forces in the Emperor Sea, Fang Wang’s reputation soared to new heights. The Emperor Sea dared not seek vengeance against Fang Wang anymore, turning their resentment towards the Xuan Dynasty instead.<br/><br/>The same internal strife plagued the Xuan Dynasty. So many cultivators had perished, and unlike Grand Qi, the Xuan Dynasty was already a Cultivation Dynasty, meaning that the deaths involved all levels of their society. The Xuan Dynasty could not pacify all classes, naturally leading to an unprecedented turbulence.<br/><br/>Especially when the truth spread, everyone in the Xuan Dynasty felt it ridiculous.<br/><br/>Just to please a Prince from the Great Divine Dynasty, His Majesty actually killed his own son-in-law, drove his own daughter to death, and brought shame and disgrace upon the Xuan Dynasty.<br/><br/>A month later.<br/><br/>Fang Wang and others arrived at the stronghold of the Eternal Life Pavilion and stepped into the cave dwelling.<br/><br/>The Great Cultivators guarding the place opened their eyes and, upon seeing Fang Wang, they quickly stood up, not daring to be negligent.<br/><br/>“Fang Wang, you’re finally back.”<br/><br/>“You’re not injured, are you?”<br/><br/>“If there’s anything Eternal Life Pavilion can help with, just ask.”<br/><br/>“That’s right, the Pavilion Master has already ordered us to fully support you.”<br/><br/>The Great Cultivators chattered away, their tones earnest, a stark contrast to Fang Wang’s first visit to the Emperor Sea.<br/><br/>Dugu Wenhun couldn’t suppress a chuckle, while The Three Immortals of the Emperor Sea brought up the rear, looking around curiously.<br/><br/>Fang Jing had grown used to seeing others trying to please his great uncle and remained composed as usual.<br/><br/>Fang Wang spoke up, “There’s no need for you to trouble yourselves. I’m preparing to return. Start the formation.”<br/><br/>Upon these words, someone immediately began to activate the transmission formation.<br/><br/>A muscular man looked towards Dugu Wenhun and asked with a frown, “Dugu<br/><br/>Wenhun, why are you following Tian Dao?”<br/><br/>Dugu Wenhun replied with a smile, “I plan to cultivate with him.”<br/><br/>All the Great Cultivators were astonished. They knew Dugu Wenhun’s character — how proud and arrogant he was, never submitting to anyone. And he intended to cultivate under Fang Wang?<br/><br/>And what about the three scruffy old men in the back, each emanating a formidable aura?<br/><br/>The crowd wished to inquire more, but with Fang Wang there, they did not dare to continue.<br/><br/>In the end, they watched as Fang Wang and the others departed.<br/><br/>In the Southern Celestial Sea, Canglan Academy.<br/><br/>Gu Li, dressed in tight-fitting blue clothes and carrying a sword case, flew out of the island. She wore a bamboo hat and had her face covered with a pale veil, with only her charming eyes visible.<br/><br/>She stopped, turned around, and looked at Canglan Academy where she had spent decades. There was no reluctance in her eyes, only determination.<br/><br/>At that moment, a young Taoist flew out of the academy and quickly approached her, chuckling, “Cousin, let’s go together, eh? The ocean is vast, and it’s dangerous to wander alone.”<br/><br/>Gu Li glanced at him and said, “There’s no need.”<br/><br/>The young Taoist laughed heartily, “Cousin, are you going to find the real person Tian Dao Fang Wang? I’d like to meet him too. Your cousin here could speak on your behalf, perhaps bring you two together.”<br/><br/>“Forget it, what’s your cultivation level? Would he listen to you? Moreover, I don’t plan to find him for now; I’m going to head back to Grand Qi first.”<br/><br/>Gu Li shook her head, her tone free and easy. When she spoke of Fang Wang, there was no regret or disappointment.<br/><br/>The stronger Fang Wang became, the greater her motivation for cultivation was.<br/><br/>She wanted to work hard in her cultivation, to catch up to Fang Wang as much as possible, rather than dwell on petulant emotions.<br/><br/>“Return to Grand Qi for what?” the young Taoist asked, puzzled.<br/><br/>Cultivators like them rarely went back. The spiritual energy and opportunities in Grand Qi paled in comparison to those at sea, so naturally, they didn’t wish to return.<br/><br/>“A sect known as Heaven’s Larceny Saint Sect in the northern part of the continent is preparing to move southward. The Gu Family needs me. After dealing with this matter, I’ll return to sea,” Gu Li replied.<br/><br/>The young Taoist clicked his tongue in wonder, “Heaven’s Larceny Saint Sect is no small matter. You should quickly persuade the Gu Family to move south, away from Grand Qi. Though Grand Qi has become a Cultivation Dynasty, catching up with the Southern Celestial Sea is nearly impossible. Not to mention, Heaven’s Larceny Saint Sect is eyeing them covetously.”<br/><br/>Gu Li no longer responded. With a slight nod, she turned and left.<br/><br/>The young Taoist didn’t persist either. Hearing the words ‘Heaven’s Larceny Saint Sect’ made him feel it was troublesome, and he immediately flew in another direction.<br/><br/>After their departure, more cultivators began leaving Canglan Academy.<br/><br/>Elsewhere.<br/><br/>Heavenly Sect, Biyou Island.<br/><br/>The thick fog parted, revealing Zhuyan, Chu Yin, Yang Du, and Qu Xunhun, along with a host of monsters gathered at the seaside, eagerly gazing at the figures emerging from within the fog.<br/><br/>Xiao Zi, like a flood dragon, burst out with Fang Wang, Fang Jing, and Zhao Zhen on its head. Upon seeing Fang Jing, everyone on the island was stunned.<br/><br/>Does the master have a child?<br/><br/>Yang Du’s gaze was captured by Dugu Wenhun, his brows furrowing as he clearly recognized him.<br/><br/>The Three Immortals of the Emperor Sea came up at the rear, thoroughly enjoying their observation of Biyou Island with great interest.<br/><br/>Upon landing, Fang Wang and Fang Jing disembarked, and the people on the island came crowding around, all of them very excited.<br/><br/>Hearing Qu Xunhun’s account, they naturally knew about the commotion Fang<br/><br/>Wang had caused in Grand Qi. Qu Xunhun was the most excited of all; as Fang<br/><br/>Wang’s reputation trembled through Emperor Sea, his status within Eternal Life Pavilion soared. Many significant figures sent him messages praising his actions and promised him many benefits.<br/><br/>It was no exaggeration to say that his compensation had been elevated even above that of a Heavenly General, which only strengthened his resolve to follow Fang Wang.<br/><br/>“Alright, let’s enter the island. Rest for three days. After three days, gather around to listen to my teachings, as I will impart to you the Heavenly Emperor Imperial Mirror,” Fang Wang said before vanishing on the spot.<br/><br/>Chu Yin asked curiously, “What is the Heavenly Emperor Imperial Mirror?”<br/><br/>With widened eyes and swallowing his saliva, Zhuyan answered, “It is the Hongxuan Emperor’s peerless cultivation technique, said to have reached the creation of Immortal Gods.”<br/><br/>Turning to Dugu Wenhun, Yang Du clicked his tongue in wonder, “Dugu<br/><br/>Wenhun, one of the Southern Celestial Four Heroes, why are you here as well? Aren’t you known for not following anyone?”<br/><br/>Dugu Wenhun?<br/><br/>The crowd turned their curious gaze towards Dugu Wenhun. The reputation of the Southern Celestial Four Heroes had been resounding over the years, and naturally, they had heard of it.<br/><br/>With a smile, Dugu Wenhun said, “Indeed, I bow to no one, but I do honor the Heavenly Dao. He is bound to become the Mortal Realm’s Heavenly Dao; being a Great Saint is far from his ultimate potential.”<br/><br/>This statement garnered positive feelings from those present.<br/><br/>Indeed, quite insightful!<br/><br/>We are all fellows on the same path!<br/><br/>“By the way, let me introduce to you these individuals. They are the Three Immortals of the Emperor Sea, all at the ninth layer of Nirvana Realm in cultivation, and henceforth will serve as slaves to the young master, awaiting my command,” Xiao Zi said proudly, the words ‘Nirvana Realm’ causing everyone to twitch nervously.<br/><br/>The Three Immortals of the Emperor Sea were not angry but rather expressed dissatisfaction, “Xiao Zi, so these are the monsters you’ve raised? They are too weak, and their aptitudes are mediocre.”<br/><br/>“Hehe, I value them not for their aptitude, which is why I think highly of them,” someone quipped.<br/><br/>“Is there somewhere nice for me to lie down?<br/><br/>Watching the capricious behavior of the Three Immortals of the Emperor Sea, everyone looked at each other in disbelief, doubting that they were as formidable as they claimed.<br/><br/>Having heard of the Three Immortals of the Emperor Sea, Qu Xunhun was secretly shocked.<br/><br/>There were missions to eliminate the Three Immortals within the Eternal Life Pavilion, ranked at the highest level, which nobody dared to accept.<br/><br/>Such formidable beings serving Fang Wang as slaves made Qu Xunhun believe that Fang Wang’s current strength and influence were enough to shake the Eternal Life Pavilion.<br/><br/>At the very least, Eternal Life Pavilion had no sway over Fang Wang!<br/><br/>After returning to Biyou Island, life became peaceful.<br/><br/>Fang Wang delivered teachings on the island; Xiao Zi’s subordinates, the monsters, also came to listen, but the Heavenly Emperor Imperial Mirror was far too profound. In less than three days, only Dugu Wenhun, Yang Du, Zhuyan, and the Three Immortals of the Emperor Sea remained to continue listening.<br/><br/>Chu Yin was only suited for cultivating techniques, while Fang Jing was busy practicing the Heavenly Dao True Skill and the Nine Dragons Tyrant Fist.<br/><br/>Time flew like an arrow.<br/><br/>In the blink of an eye, two years had passed.<br/><br/>Having recently emerged from a 6,100-year retreat, Fang Wang hadn’t cultivated in these two years. Nonetheless, his cultivation was improving at a rate unmatched by others on the island.<br/><br/>He was getting ever closer to the fifth layer of the Golden Body Realm.<br/><br/>On this day.<br/><br/>Fang Wang lay on the side of a cliff halfway up the mountain, his body tilted, looking down at Fang Jing practicing his punches on the beach below.<br/><br/>The twelve-year-old Fang Jing was growing, now a graceful young man with sword-like eyebrows and starry eyes, a tall figure dressed in a tight-fitting white garment. His long hair was tied behind his head, and each punch he threw was vigorous, splitting the waves.<br/><br/>Fang Wang took out the Biyou Jade Token, and with a thought, the mist in front vanished; soon after, a streak of sword light rushed towards him. The sword light landed swiftly beside Fang Wang, and it was none other than Fang Hanyu.<br/><br/>Fang Hanyu’s gaze fell on Fang Jing and he said, “Indeed, under your care, he truly grows better.”<br/><br/>Without turning his head, Fang Wang asked, “Did you come just to see the kid?”<br/><br/>Fang Hanyu sighed, “Grand Qi is in trouble. Though Jin Xiao Sect’s focus is now in Emperor Sea and they still have some power in Grand Qi, I worry it may not be enough to hold back the threat.”<br/><br/>“What’s the matter?”<br/><br/>“Remember the Heaven’s Larceny Saint Sect? They have moved south, already annexing the Chu, Han, and Hong dynasties, aiming for a unified continent. I’m afraid the Fang Family will be in jeopardy. If you have no pressing matters lately, perhaps you could return with me.”<br/><br/>Fang Hanyu said, his face filled with concern. Previously, he might have trusted in Jin Xiao Sect, but with the incidents involving Fang Xun, he believed caution was necessary, especially as most of the Fang Family remained in Grand Qi.<br/><br/>Upon hearing this, Fang Wang’s eyes narrowed as he said, “The Heaven’s<br/><br/>Larceny Saint Sect, of course, I haven’t forgotten.”<br/><br/>With Lu Yuanjun’s backing from the Heaven’s Larceny Saint Sect, Fang Wang had to consider that they might target the Fang Family..\t\t\t\t\t\t</div>", "images": {}, "success": true}