{"id": 194, "url": "https://www.novelhall.com/i-became-an-immortal-on-mortal-realm-32879/14316140.html", "title": "Chapter 194 - Chapter 194: Chapter 191 Capturing Fang Wang", "volume": 2, "volume_title": "Volume 2", "body": "<h1>Chapter 194 - Chapter 194: Chapter 191 Capturing Fang Wang</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 194: Chapter 191 Capturing Fang Wang<br/><br/>Translator: 549690339<br/><br/>Relying on the Great Perfection understanding of Jinghong Divine Sword Art and Executioner Immortal Ghost God Sword, Fang Wang only took a hundred years to master it, and two hundred years to reach Great Completion.<br/><br/>After thoroughly reaching Great Perfection, he looked back and found that this seclusion had taken a total of five hundred and seven years.<br/><br/>Not bad!<br/><br/>Not too long!<br/><br/>Fang Wang looked around at the thirty-six Ghostly Divine Swords, wearing a smile on his face.<br/><br/>Transformed into thirty-six entities, the overall ghostly power hadn’t increased, but with the increase in numbers, his future absorption rate of the Power of the Netherworld would skyrocket. As long as the speed of absorbing the Netherworld’s power went up, the strength of the Ghostly Divine Swords would naturally grow stronger as well.<br/><br/>Suddenly, Fang Wang toyed with the idea of another trip to the Underworld, although he didn’t know if doing so would bring about any dire consequences.<br/><br/>As the illusion of the Heavenly Palace crumbled, Fang Wang’s consciousness returned to reality.<br/><br/>He opened his eyes and looked towards the Firmament.<br/><br/>He wondered whether executing the Zhu Xian Jing Hong Sword would cause a phenomenal reaction from heaven and earth.<br/><br/>He decided to hold back, worried that too many heavenly phenomena might alarm some old monsters between heaven and earth, or perhaps even stir the Upper Realm.<br/><br/>Fang Wang stood up and stretched his limbs.<br/><br/>He had intended to fuse with the Celestial Sword Intent but now thought there was no need to rush. He should focus on his practice for the time being.<br/><br/>With each breakthrough in realm, he would integrate a supreme technique.<br/><br/>The Heavenly Dao True Skill could still be merged with Solaris Scripture and Great Celestial Infinite Scripture, the Zhu Xian Jing Hong Sword could also be combined with the Nine Heavens Azure Thunder Sword Formation and Divine Nurturing Sword Qi. His journey was still long.<br/><br/>Lengthy, but at least he had something to strive for!<br/><br/>After moving around for a while, Fang Wang stepped out of the courtyard.<br/><br/>Along the way, the house servants and Fang Family Disciples cleaning the residence were all stunned upon seeing him, even forgetting to pay their respects.<br/><br/>Fang Wang nodded and smiled at them, which made them incredibly excited.<br/><br/>A short while later, Fang Wang arrived at the Northern District of Fang Residence. The residence was already large, like a city within a city. It had expanded even more lavishly, and there was a Combat Practice Plaza for disciples to practice martial arts and cultivation.<br/><br/>At that moment. the Combat Practice Plaza was filled with hundreds of vounz Fang Family boys and girls practicing swordsmanship and punching. They represented only a small part of the Fang Family Disciples. Many more were gathering Qi in their rooms, and others were adventuring outside. Fang Wang had heard from his grandfather that the Fang Family Members now numbered over ten thousand.<br/><br/>Fang Wang approached the edge of the plaza and swiftly locked his gaze onto Fang Jing.<br/><br/>Fang Jing was practicing his punches, and no one dared to come within fifteen meters of him. Although he did not activate his Spiritual Power, each of his punches created sharp bursts of punching force.<br/><br/>Fang Jing was also close to achieving Spiritual Refinement. Fang Wang wondered what rank of Lifespirit Treasure he would be able to mold.<br/><br/>The Fang Residence had already established a Spirit Sculpting Tower. Most of the Fang Family Disciples refined their spirits within the residence before setting out to explore or joining Cultivation Sects. The footprints of the Fang Family Disciples had now extended beyond Grand Qi to other neighboring dynasties.<br/><br/>“Uncle!”<br/><br/>Upon noticing Fang Wang, Fang Jing called out in surprise, immediately running towards him.<br/><br/>Upon hearing this, all the young men and women on the plaza turned instinctively to look. Those who hadn’t seen Fang Wang were stunned, but those who had met him before quickly became excited, revealing his identity.<br/><br/>Hearing that the man was the Fang Family’s Immortal Fang Wang, all the young disciples were invigorated, rushing towards him like a tide, gazing at Fang Wang in admiration.<br/><br/>Fang Wang ruffled Fang Jing’s hair. Facing the looks of many juniors, he felt a sudden playful impulse.<br/><br/>“What a sunny day! Spring is about to warm the blooming flowers. How about I teach you a set of swordsmanship? Would you like to learn?” Fang Wang asked with a smiling face.<br/><br/>Upon hearing his words, all the Fang Family Disciples were excited, clamoring in agreement.<br/><br/>Fang Wang raised his right hand, and the hilt of the Rainbow Sword appeared in his grasp, followed by a blade of white light erupting forth, causing an amazed outcry.<br/><br/>The Fang Family Disciples may have had some experience but had never seen such an extraordinary Lifespirit Treasure. They were all dazzled by its appearance.<br/><br/>“Let me through.”<br/><br/>Fang Wang said with a smile, and the youngsters immediately made way for him.<br/><br/>The news of Fang Wang offering guidance to the junior members quickly spread, attracting more and more Fang Family Members to watch. Even the officials and cultivators temporarily visiting the Fang Residence heard the news and came over.<br/><br/>High above the layers of cloud-seas, a massive city hung in the sky, its soil base resembling a floating island, with cultivators coming and going in every direction, bustling with activity.<br/><br/>In the center of the city, a giant palace housed a golden sphere over ten meters in diameter, floating midair. Inside it reflected an entire world, where dozens of cultivators were battling chaotically.<br/><br/>Surrounding the golden sphere stood a dozen individuals, each with an extraordinary presence. Ji Rutian was among them.<br/><br/>Dressed in white with golden threads, Ji Rutian had an imposing posture, with his right hand resting behind his waist, standing tall. His head was adorned with a Golden Dragon Jade Crown. Simply standing there, without uttering a word, he gave off the impression that he was a favored child of heaven.<br/><br/>“The talents of these young cultivators are quite good, though it’s a bit of a pity.”<br/><br/>“What’s there to pity? Out of a hundred, only one can survive. It’s the rule of Heaven’s Larceny Saint Sect. Those promising seeds that die prove that their fate wasn’t strong enough to warrant pity.”<br/><br/>“That genius with the dual Treasure Spirits is in danger.”<br/><br/>“Though he has dual Treasure Spirits, it’s unfortunate that they are only of<br/><br/>Mysterious Origin grade.”<br/><br/>“This southern dynasty is too weak. After so many years, they haven’t discovered a single Heaven Yuan Treasure Spirit.”<br/><br/>The Great Cultivators of Heaven’s Larceny Saint Sect engaged in heated discussions, inevitably mentioning Fang Wang when it came to the Heaven Yuan Treasure Spirit.<br/><br/>Fang Wang was renowned throughout the seven dynasties, already a legendary talent, and naturally they had taken notice of him.<br/><br/>A female cultivator looked towards Ji Rutian, covering her mouth with a smile as she asked, “Ji Rutian, you were once the Sect Master of the Vast Qi Sect and wanted to capture Fang Wang. Do you know what realm he is in? Fang Wang has already sent word, eager to test the mettle of our Heaven’s Larceny Saint<br/><br/>Sect.”<br/><br/>Ji Rutian focused on the golden light sphere, his expression unchanged, calmly saying, “If you ask me, I don’t know what realm he’s in either, but I advise you to give up on Grand Qi. What’s the loss of a piece of Grand Qi? Don’t land yourselves in trouble. Even if Fang Wang can’t stop you now, what about later?<br/><br/>When he grows up, that will be a disaster for Heaven’s Larceny Saint Sect.”<br/><br/>A middle-aged man glanced at him and snorted, “Fang Wang is as old as you are, and you’ve just recently broken through to the Golden Body Realm and received the true transmission from the Descending Dragon Great Saint. Are you still afraid of him?”<br/><br/>The others all looked towards Ji Rutian, their eyes filled with wariness, and it was clear they did not get along well with Ji Rutian.<br/><br/>Ji Rutian calmly said, “It’s not about fear. I just find no need to provoke him, as the benefits provided by Grand Qi are far outweighed by the crisis Fang Wang poses. ”<br/><br/>“Great Abyss Gate of Grand Qi has already declared to the world that if Heaven’s Larceny Saint Sect backs down, how will they govern this land?” another person asked.<br/><br/>Ji Rutian stopped responding and concentrated on watching the battle.<br/><br/>Just then, a black-robed cultivator swiftly flew into the hall, half-kneeling behind everyone, saying, “Report, Chang Shengzun is heading south with Saint Spirits. He has sent a message ahead to summon all Heavenly Monarchs and Monarch’s Envoys in the south to prepare to capture Fang Wang. Before he arrives, we must not stir the grass and startle the snake!” Upon hearing this, everyone exchanged glances.<br/><br/>Ji Rutian remained stoic.<br/><br/>Leading them was a man in purple robes, named Chou Tianjun. He waved at the black-robed cultivator, who immediately withdrew after giving a salute.<br/><br/>Chou Tianjun looked towards the others and said, “Now that you’ve heard the orders, no matter what Fang Wang’s strength is, get ready for battle.”<br/><br/>He then set his gaze on Ji Rutian, saying, “Ji Rutian, you’ve recently joined Heaven’s Larceny Saint Sect. Although you’ve already proven your strength, you also need to accrue merits. I expect you not to shirk your duty in capturing Fang Wang.”<br/><br/>Ji Rutian shook his head with a chuckle, saying, “Although I advise against confronting Fang Wang, I will naturally obey orders from above. It’s just as well; I’ve been curious to witness Fang Wang’s capabilities.”<br/><br/>His smile transformed from genial to confident, and his gaze seemed to fear no one in the world.<br/><br/>Chou Tianjun nodded in satisfaction and returned his attention to the golden light sphere.<br/><br/>In Southern Hills City, at the Fang Residence.<br/><br/>Dugu Wenhun, Zhu Yan, The Three Immortals of the Emperor Sea, Xiao Zi, and Zhao Zhen stood atop a courtyard wall, watching the young boys and girls in the Combat Practice Plaza.<br/><br/>It wasn’t just them; every nearby yard was crowded, with some even flying on swords overhead to get a better view of Fang Wang instructing the juniors in swordsmanship.<br/><br/>“Do you understand what he’s doing?” Zhu Yan nudged Dugu Wenhun with his elbow, asking.<br/><br/>Dugu Wenhun stared intently at Fang Wang’s sword-wielding figure, softly saying, “The sword moves aren’t fast, but they clearly contain some profound mysteries. I can’t see through exactly what they are. This set of swordsmanship is no ordinary technique, and it might even be…”<br/><br/>“Even what?”<br/><br/>“Nothing.”<br/><br/>Dugu Wenhun silently finished the thought in his mind.<br/><br/>…it might even rival the Heavenly Emperor Imperial Mirror!<br/><br/>Of course, even he couldn’t believe such speculation.<br/><br/>Fang Wang was only in his early 140s, to have mastered the Heavenly Emperor Imperial Mirror was remarkable enough, but to also command a technique no less significant than the Imperial Mirror? Unbelievable.<br/><br/>And he knew that Fang Wang had received the legacy of the Descending Dragon Great Saint.<br/><br/>The expressions of The Three Immortals of the Emperor Sea were gravely serious. Glancing at each other, they all saw the shock reflected in their eyes.<br/><br/>The other spectators didn’t think too deeply; they were simply amazed at Fang<br/><br/>Wang’s elegance.<br/><br/>Fang Wang himself let out a soft sigh while swinging his sword.<br/><br/>He had been holding back, not revealing the Zhu Xian Jing Hong Sword, for fear of attracting heavenly anomalies. Yet even when he was just performing basic sword moves, he occasionally felt the impending approach of Heavenly Might.<br/><br/>It was a rather alarming and thrilling sensation.<br/><br/>Fang Wang then sheathed his sword, looked towards the juniors before him, and smiled, “Learn as much as you remember, there’s no need to forcibly memorize it all.”<br/><br/>Upon hearing this, the young boys and girls let out a sigh of relief. Fang Wang’s sword moves weren’t overly complex, but there were just too many, taking almost half an hour to demonstrate, which left their minds dizzy.<br/><br/>Fang Jing wasn’t practicing swordsmanship, but while practicing his boxing, he kept his gaze on Fang Wang, letting out a soft sigh, silently admitting to himself that he lacked the talent for swordsmanship.<br/><br/>“What if someone were to memorize them all?”<br/><br/>A voice came from the back of the crowd. Fang Wang looked up to see a 13 or 14-year-old boy in green clothes. The young boys and girls turned their heads, the speaker being a notably handsome youth who stood among the crowd, his complexion somewhat cold.<br/><br/>Facing the many eyes set upon him, the green-clothed boy appeared calm yet his hand clenching the sword trembled.<br/><br/>Fang Wang looked at the green-clothed youth and smiled, “Then come and show me.’<br/><br/>He had already noticed the lad; while everyone else followed along, mimicking his sword moves, this one simply stood there, motionless, intently watching<br/><br/>him..\t\t\t\t\t\t</div>", "images": {}, "success": true}