{"id": 195, "url": "https://www.novelhall.com/i-became-an-immortal-on-mortal-realm-32879/14316141.html", "title": "Chapter 195 - Chapter 195: Chapter 192: Attack Of The Heaven I S Larceny Saint Sect", "volume": 2, "volume_title": "Volume 2", "body": "<h1>Chapter 195 - Chapter 195: Chapter 192: Attack Of The Heaven I S Larceny Saint Sect</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 195: Chapter 192: Attack of the Heaven I s Larceny Saint Sect<br/><br/>Translator: 549690339<br/><br/>Under the watchful eyes of everyone, the young man in green clothes walked up to Fang Wang. It was the first time he had been stared at by so many people at once, and his youthful heart inevitably felt apprehensive.<br/><br/>The young man looked up and met Fang Wang’s gaze. With a warm smile on his face, Fang Wang encouraged him with his eyes, easing his tension significantly.<br/><br/>He took a deep breath, raised the wooden sword in his hand, and began to swing it.<br/><br/>Everyone stared at him, curious to see if he could remember all the sword moves.<br/><br/>As the young man began to swing his sword, the moves were initially a bit stiff. But once he closed his eyes, the moves became fluid, as if he had been practicing for many years. “Eh? Could this kid be a swordsmanship prodigy?”<br/><br/>“Isn’t that Fang Bai?”<br/><br/>“The boy is usually introverted, not much for talking. Now he seems to be seizing the opportunity.”<br/><br/>“When you think about it, Fang Bai does resemble Fang Wang somewhat. Who would have thought before the family’s calamity, Fang Wang had such profound martial arts?”<br/><br/>“If Fang Bai could reach half, no, even a tenth of Fang Wang’s cultivation, the Fang Family would be truly established in the Cultivation World.”<br/><br/>The Fang Family members outside the Combat Practice Plaza discussed among themselves. The Fang Residence was large, with many children and not everyone knew Fang Bai.<br/><br/>Dugu Wenhun, Zhu Yan, and The Three Immortals of the Emperor Sea initially didn’t care, but as Fang Bail s sword moves became more fluid, their expressions changed.<br/><br/>With a serious face, Zhu Yan said, “This kid is not simple. He’s not just displaying sword moves, he’s also using this opportunity to understand the sword.”<br/><br/>Dugu Wenhun exclaimed, “Indeed, a family that could produce someone like Heavenly Dao wouldn’t be simple. Even if ordinary before, as Heavenly Dao’s cultivation rises, his fate will also affect the Fang Family. There’s a sign that the Fang Family is on the rise.”<br/><br/>The Three Immortals of the Emperor Sea agreed:<br/><br/>“Any family that produces a Great Saint will see their fate soar.”<br/><br/>“Fang Wang isn’t just going to become a Great Saint, I believe he will surpass the Great Saint.”<br/><br/>“Pity, I do not favor the Sword Dao. Although the Sword Dao is strong, it’s too solitary and difficult to encompass the grand path.”<br/><br/>Elsewhere.<br/><br/>Fang Wang focused on Fang Bai, his admiration growing stronger.<br/><br/>A promising seedling has finally appeared in the Fang Family. Fang Hanyu was talented, but it was due to Zhou Xue’s various enhancements, first the Absolute Heart Evil Eye, then the help in obtaining the Ten Thousand Year Sword Spirit. In terms of innate talent, Fang Hanyu was not considered an extraordinary prodigy.<br/><br/>Fang Bai swung his sword faster and faster, his execution of the swordsmanship even quicker than Fang Wang’s.<br/><br/>When he finished his moves, the entire Combat Practice Plaza fell silent. Fang Bai opened his eyes and nervously looked towards Fang Wang. Although<br/><br/>he was confident, how could he not be nervous in front of the legend of Grand<br/><br/>Fang Wang smiled at him and asked, “Did you know about your talent before?”<br/><br/>After a moment’s hesitation, Fang Bai said, ‘When I was five, I realized I had a photographic memory watching several uncles practice swordsmanship.”<br/><br/>“Have you practiced swordsmanship in these years?”<br/><br/>“Yes.”<br/><br/>“Does anyone know?”<br/><br/>As Fang Bai said this, he felt somewhat guilty because his father and grandfather were also watching from a distance.<br/><br/>Fang Wang smiled even more, ruffled Fang Bail s hair, and said with a laugh, “Come to my courtyard when you’re free. I’ll teach you swordsmanship.”<br/><br/>At these words, all the Fang Family members were moved, and the younger generation looked at Fang Bai with envy and astonishment.<br/><br/>Everyone realized that another exceptional talent was about to emerge from the Fang Family!<br/><br/>Fang Bai was also very excited. He hurriedly thanked Fang Wang, who promptly steadied him so that he didn’t have to bow.<br/><br/>“Alright, you all continue,” Fang Wang said and turned to leave. The people outside the Combat Practice Plaza started approaching Fang Wang.<br/><br/>“Do not disturb Fang Wang, everyone make way, unless Fang Wang approaches you himself.”<br/><br/>A commanding voice sounded. Fang Wang turned to look and saw his eldest uncle, Fang Shi, standing on the courtyard wall with a stern face. At his words, everyone stopped in their tracks.<br/><br/>Fang Wang smiled and nodded at his uncle. Fang Shi saw his gaze and smiled as well.<br/><br/>With Fang Shi’s command, no one dared to disturb Fang Wang any further. Fang Wang began to wander through the Fang Residence and stealthily left to roam the streets of Southern Hills City – revisiting places he loved as a child.<br/><br/>That day, the name of Fang Bai spread throughout the Fang Residence, and even to the entire Cultivation World.<br/><br/>Favored by Fang Wang, Fang Bai was bound to become famous in the Cultivation World as long as he did not perish prematurely.<br/><br/>The next day at noon, Fang Bai cautiously entered Fang Wang’s courtyard.<br/><br/>Fang Wang decided to pass on the Executioner Immortal Ghost God Sword to Fang Bai, first mastering the Ghostly Divine Sword, then moving on to the Zhu Xian Jing Hong Sword.<br/><br/>Fang Bai showed an exceptional understanding of the Sword Dao, but to master the Ghostly Divine Sword would take more than a few years.<br/><br/>The Ghostly Divine Sword left Fang Bai astonished. Since he started with the Sword Dao, he found it easy, with no sword techniques that could confound him; his strength was greater than others at the same realm because of it.<br/><br/>For the first time, he encountered a sword technique he could not see through, especially when the ghosts and deities manifested, he was in awe.<br/><br/>Is this really the Sword Dao?<br/><br/>Teaching a prodigy was very satisfying. Fang Wang only taught him the sword moves and mental method on the previous three days. Afterward, when Fang Bai came to his courtyard, he practiced on his own without disturbing Fang Wang’s Qi Gathering.<br/><br/>As Fang Wang began to gather Qi seriously, spiritual energy from heaven and earth rushed wildly into his body, alarming the entire city and the broader Grand Qi Cultivation Realm.<br/><br/>This speed of Qi Gathering was too exaggerated!<br/><br/>Even a spectacular tornado rose above Southern Hills City, fortunately, it did not affect Southern Hills City.<br/><br/>The Spiritual Energy from the entire Grand Qi Cultivation Realm surged towards Southern Hills City, making various sects and noble families incredibly anxious. However, they soon discovered the truth; it was Fang Wang who was gathering Qi.<br/><br/>One man gathering Qi was actually affecting the territory of an entire dynasty!<br/><br/>This was almost too exaggerated!<br/><br/>For a while, Fang Wang’s status in the hearts of the people of Grand Qi skyrocketed, and whether Fang Wang had become an Immortal and how strong his realm was became a topic of passionate discussion throughout the lands of Grand Qi.<br/><br/>Two years later, the anomaly above Southern Hills City suddenly disappeared because Fang Wang had broken through to the fifth layer of the Golden Body Realm.<br/><br/>He began to think about integrating the essence of the Sword Dao again.<br/><br/>In these two years, the number of cultivators in Southern Hills City had exploded. Emperor Zhao Qi even ordered the expansion of Southern Hills City, intending to make it the first great city in all of Grand Qi. This move, although met with opposition from the entire court, was resolutely executed and eventually came to fruition.<br/><br/>In the courtyard.<br/><br/>Fang Wang sat on the stone steps, cradling Xiao Zi in his arms, stroking its head while watching Fang Jing and Fang Bai spar.<br/><br/>The two weren’t using Spiritual Power but were purely relying on swordsmanship and fist techniques to battle.<br/><br/>It’s worth mentioning that the two were about the same age, not even five months apart, and their fight was evenly matched.<br/><br/>Fang Bai truly was a once-in-a-lifetime Sword Dao genius, but Fang Jing was no less exceptional; inheriting his father’s fate-defying power, he occasionally managed to suppress Fang Bai.<br/><br/>If they had used Spiritual Power, Fang Jing would have won long ago.<br/><br/>Xiao Zi stuck out its tongue and laughed, “Young Master, do you think they can compare with Chu Yin?”<br/><br/>In its eyes, Chu Yin was simply outrageous.<br/><br/>Ever since Chu Yin mastered the Solaris Scripture, even Dugu Wenhun and The Three Immortals of the Emperor Sea were astonished by his rate of improving his Spiritual Power.<br/><br/>Perhaps Chu Yin’s combat skills weren’t that strong, but with his robust Spiritual Power, he was more than capable of sweeping away all geniuses of the same realm.<br/><br/>“Who can tell when it comes to the future?”<br/><br/>Fang Wang spoke calmly; he suddenly realized his own mindset was growing old.<br/><br/>Watching Fang Jing and Fang Bai exuding the spirits of their youthful days gave him a feeling of gratification.<br/><br/>Perhaps his grandfather, Fang Meng, saw him with the same kind of sentiment.<br/><br/>It was a good feeling.<br/><br/>Xiao Zi was about to say more when suddenly, a clap of thunder exploded. The sound was so loud it shook heaven and earth. Fang Jing and Fang Bai, who were practicing their skills, both stopped and turned to look towards the horizon.<br/><br/>They were sweating profusely, with hair sticking to their faces. Standing side by side, they indeed looked like blood brothers.<br/><br/>Fang Wang raised his eyes to look and remained composed.<br/><br/>He saw towering thunderclouds rolling in from the horizon, dark clouds pressing down on the city, creating an oppressive feeling of an impending catastrophe<br/><br/>“Young Master, something’s happening,” Xiao Zi said intently. Its cultivation was not weak, and it could sense powerful auras rapidly approaching Southern Hills City.<br/><br/>At that moment, Chu Yin, Zhu Yan, Qu Xunhun, Dugu Wenhun, The Three Immortals of the Emperor Sea, and Fang Hanyu all arrived in Fang Wang’s courtyard.<br/><br/>Dugu Wenhun exclaimed, “I can’t believe there are still so many Great<br/><br/>Cultivators on the mainland.”<br/><br/>Zhu Yan said excitedly, “Master, don’t you lift a finger. Let me take action for you!”<br/><br/>As a peerless genius of the Golden Body Realm, his physical strength was immense; even when facing cultivators from the Mahayana Realm, he feared nothing.<br/><br/>Following that, Dugu Wenhun laughed and said, “I can also take action. Come to think of it, I’ve never shown my strength before all of you.”<br/><br/>Fang Bai looked at these people with eyes full of curiosity.<br/><br/>It was said that the people accompanying Fang Wang were rarely seen Great Cultivators, but what their actual realms were was known to very few.<br/><br/>Fang Jing nudged him with his elbow and whispered with a chuckle, “Wait until you leave Grand Qi and wander the world, then you will understand how high the status of those under my great uncle is.”<br/><br/>This made Fang Bai even more curious about Zhu Yan and the others.<br/><br/>Fang Wang did not get up; after a thought, he said, “If that’s the case, then let Dugu Wenhun and Zhu Yan fight. Remember, try to avoid affecting the civilians in all the lands and cities as much as possible.”<br/><br/>Dugu Wenhun nodded with a smile while Zhu Yan became even more enthusiastic, his appearance turning demonic, half his face turning into a Roc Bird and the other half a fox, startling Fang Bai.<br/><br/>Meanwhile.<br/><br/>Inside a residence in Southern Hills City.<br/><br/>Gu Li stood in the courtyard, gazing at the anomaly on the horizon, her expression grave.<br/><br/>Gu Tianxiong strode into her courtyard, cursing as he spoke, “Heaven’s Larceny<br/><br/>Saint Sect really has some nerve to come directly to Southern Hills City.”<br/><br/>Gu Li spoke calmly, “It seems the Heaven’s Larceny Saint Sect has made up its mind to swallow Grand Qi.”<br/><br/>“It’s said that Heaven’s Larceny Saint Sect loves to collect geniuses; perhaps in their eyes, Fang Wang’s value has already surpassed that of Grand Qi,” Gu Tianxiong speculated.<br/><br/>He then sighed, “Although Fang Wang is different from the past, he still treats me the same as always. Why won’t you go see him?”<br/><br/>Gu Li shook her head slightly and said, “Seeing him would only disturb my peace of mind, and even if we met, what would we talk about? Being in Southern Hills City and sensing his cultivation momentum is already satisfying enough for me. I need to work even harder to catch up to him.”<br/><br/>Gu Tianxiong wanted to protest, wanting to say, my dear daughter, even if you work your hardest, you can’t possibly catch up to him.<br/><br/>But then he reconsidered; even if she couldn’t catch up, being motivated by Fang Wang, Gu Li would surpass the limits she would have otherwise reached, which was also something to be happy about..\t\t\t\t\t\t</div>", "images": {}, "success": true}