{"id": 197, "url": "https://www.novelhall.com/i-became-an-immortal-on-mortal-realm-32879/14368888.html", "title": "Chapter 197 - Chapter 197: Chapter 194: The Ji Family Brothers, The Descent Of The Saint Spirit", "volume": 2, "volume_title": "Volume 2", "body": "<h1>Chapter 197 - Chapter 197: Chapter 194: The Ji Family Brothers, The Descent Of The Saint Spirit</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 197: Chapter 194: The Ji Family Brothers, The Descent of the Saint Spirit<br/><br/>Translator: 549690339<br/><br/>Dugu Wenhun’s spear was like a cold dragon, each thrust exuding a vast chill that had now approached the outskirts of Southern Hills City.<br/><br/>Chang Shengzun’s right palm swirled with turquoise flames, his palm strikes fierce and authoritative, the force of his punches swept across ten thousand li of sky, even when he was intentionally holding back.<br/><br/>The Grand Qi Dynasty was one of Heaven’s Larceny Saint Sect’s targets for annexation. If it were to be destroyed, their plans would be tantamount to failure, and naturally, he did not wish to harm the land and people of Grand Qi.<br/><br/>The two ascended continuously, moving away from the ground.<br/><br/>As their distance from the ground increased, their battle became even more intense.<br/><br/>Dugu Wenhun’s spear technique was sharp and domineering. When his cold aura covered the firmament, his figure blurred, not because he was evading, but because his movements were getting faster.<br/><br/>In the end, Chang Shengzun also drew his sword. With a sweep of his blade, he scattered the cold air that had enveloped thousands of li of the firmament.<br/><br/>Dugu Wenhun’s eyes narrowed, his right hand wielding the spear, thrusting rapidly forward. Countless spear glows burst forth, like the Milky Way crisscrossing the Firmament, silver light flickering between heaven and earth.<br/><br/>Chang Shengzun raised his sword to block, his figure instantly engulfed by the myriad spear glows.<br/><br/>The silver light illuminated Ji Rutian’s face below, who wore a smile, the crimson long sword in his hand flickering with a blood-like glow.<br/><br/>“Tch tch, a mighty Nirvana Realm figure actually bullying a junior.”<br/><br/>A voice tinged with mockery rang out. After Chang Shengzun had slashed through the spear glows, he turned to look, only to see a scruffy elder treading the air, approaching from the horizon.<br/><br/>It was Qian Xian!<br/><br/>Even after following Fang Wang, the Three Immortals of the Emperor Sea still refused to change their clothes, claiming that this was their true selves.<br/><br/>Chang Shengzun narrowed his eyes and his gaze suddenly shifted.<br/><br/>Dugu Wenhun did not take the opportunity to launch a sneak attack on Chang Shengzun. Glancing at Qian Xian, he immediately dived down to support Zhu Yan.<br/><br/>However, he had only descended a thousand zhang when Ji Rutian stopped him.<br/><br/>Dugu Wenhun looked down at Ji Rutian and said, “Your aura seems familiar. Have we met before?”<br/><br/>Ji Rutian held his sword and smiled, “My elder brother’s name is Ji Haotian.”<br/><br/>“Oh? Ji Haotian actually has a brother. How come I’ve never heard him mention it? Could it be you really are from the legendary Ji Family?” Dugu Wenhun said with a cold laugh.<br/><br/>Ji Rutian raised the sword in his hand, placing it vertically in front of him, the blade obscuring half his face. A glimmer of greed shone in his eyes as he said, “Brotherly bonds in the Ji Family aren’t as harmonious as those in mortal families. The last time I saw my elder brother was when I was seven. He told us of his experiences in the Southern Celestial Sea and mentioned you, extolling you to the highest degree.”<br/><br/>Upon hearing this, Dugu Wenhun’s expression flickered slightly.<br/><br/>He had known Ji Haotian for less than two hundred years, which meant that this person from the Ji Family was less than two hundred years old.<br/><br/>Dugu Wenhun raised his spear, pointing it diagonally toward him, and said, “Since that’s the case, let me see how much you differ from your elder brother.”<br/><br/>The look in Ji Rutian’s eyes intensified as he suddenly slashed his sword towards Dugu Wenhun.<br/><br/>This sword set the firmament ablaze with fire, and its light could be seen across all the states and counties of Grand Qi.<br/><br/>Dugu Wenhun thrust his spear, surging Spiritual Power transforming into an unstoppable stream of spear light. The two forces of Spiritual Power collided high in the sky, unleashing a terrifying gale that ravaged all directions, as if heralding the apocalypse.<br/><br/>Elsewhere.<br/><br/>Qian Xian flew up to Chang Shengzun, the two now less than a hundred zhang apart.<br/><br/>Chang Shengzun asked, “Elder, what brings you here? Could it be that Dugu Wenhun is your disciple?”<br/><br/>Qian Xian replied with a chuckle, “Why ask what you already know? The Heavenly Dao is not something you can provoke.”<br/><br/>Upon hearing this, Chang Shengzun’s brows furrowed deeply as he pressed on, “What is your relationship with Fang Wang, Elder?”<br/><br/>“Now that I serve the Heavenly Dao, what do you think our relationship is?” Qian Xian countered, trying to recollect where he had seen Chang Shengzun, but his recent centuries immersed in dreams had made him forget much of the past.<br/><br/>Chang Shengzun’s expression shifted between dark and light at the answer.<br/><br/>Boom—<br/><br/>A dreadful maelstrom raged from below, lifting the robes and hair of the two, who remained steadfastly immobile.<br/><br/>Qian Xian’s smile held a hint of menace as he said, “Although I can’t recall where I’ve seen you, since you recognize me, consider carefully whether you want to act against me. I am not as easygoing as my elder brother. I will strike to kill.”<br/><br/>Chang Shengzun lifted his left arm, his sleeves flapping wildly in the wind as strands of black qi poured from them.<br/><br/>Qian Xian’s face shifted slightly as he frowned and asked, “What is this evil thing?”<br/><br/>Chang Shengzun, his face twisted, laughed, “Elder, while you once offered guidance to our kind, the great plan of Heaven’s Larceny Saint Sect cannot be hindered. Allow me to have you witness the pride of Heaven’s Larceny Saint Sect?”<br/><br/>With a loud boom, his sleeve shattered, releasing billows of black qi that instantly enveloped the firmament. As Qian Xian looked around, the black fog drowned him, and he caught a glimpse of a figure moving rapidly through it.<br/><br/>“Elder, behold the Saint Spirit of Heaven’s Larceny Saint Sect, born from an ancient evil soul. See for yourself if it has the right to unite the Mortal Realm,” said Chang Shengzun, his mocking laughter echoing from an indiscernible direction.<br/><br/>Qian Xian’s eyes narrowed, and a terrifyngly formidable aura erupted from within him, causing the swirling black fog to spin violently and grow louder.<br/><br/>Dugu Wenhun and Ji Rutian, engrossed in battle, turned to look, both frowning.<br/><br/>The Heaven’s Larceny Saint Sect’s Great Cultivators assaulting Zhu Yan also glanced sideways. The sect’s cultivators, busy forming arrays in the distance, all showed ecstatic expressions.<br/><br/>“It’s the Saint Spirit! The Saint Spirit is being resurrected!”<br/><br/>“Never thought I’d witness the descent of the Saint Spirit in our lifetime!”<br/><br/>“The legend turns out to be true…”<br/><br/>“With the Saint Spirit’s descent, to unite the Mortal Realm, to seek the Dao amid the mortal dust, only we of Heaven’s Larceny hold the key!”<br/><br/>“Such terrifying aura, what realm does the Saint Spirit truly belong to?”<br/><br/>The cultivators of Heaven’s Larceny Saint Sect were wildly excited, and some even knelt in the air to worship.<br/><br/>Dugu Wenhun looked out and saw, beyond the rolling black fog that surrounded Chang Shengzun and Qian Xian, an immense and terrifying soul spirit circling the outer layer of the fog.<br/><br/>The upper body of the soul spirit was that of a man, while the lower body was a dragon’s, with a scorpion-like tail. From a distance, the figure was eerie and horrifying. It wasn’t flying but crawling rapidly around the layer of black fog, and this sight was particularly terrifying in the dim world.<br/><br/>Even Ji Rutian’s eyes betrayed a hint of wariness.<br/><br/>“What, you don’t know what this thing is?”<br/><br/>Dugu Wenhun asked coldly, his gaze firmly fixed on the Saint Spirit.<br/><br/>Ji Rutian replied, “Of course I know. I just didn’t think they had not exaggerated.”<br/><br/>“The cataclysm of this continent has arrived, no, the apocalypse of the entire Mortal Realm is about to begin.”<br/><br/>A look of madness then appeared in Ji Rutian’s eyes as he turned his head towards Dugu Wenhun, challenging him, “Dugu Wenhun, do you dare join forces with me to challenge the might of the Saint Spirit?”<br/><br/>Dugu Wenhun looked at him in surprise and asked, “You want to betray Heaven’s Larceny Saint Sect?”<br/><br/>“Heaven’s Larceny Saint Sect is merely a stepping stone for me. I had advised them not to provoke Fang Wang. They did not listen. I thought they were overly arrogant, but now, it seems they planned to use Fang Wang’s body for the resurrection of the Saint Spirit. Since you serve Fang Wang, you should be aware of how terrifying his talents are. If the Saint Spirit obtains his body…”<br/><br/>Ji Rutian spoke calmly, leaving his sentence hanging, but it was enough to make Dugu Wenhun come to a decision.<br/><br/>Boom!<br/><br/>A massive hole was blasted through the black fog, and wisps of white flame surged out. Following that, Qian Xian stepped out.<br/><br/>The originally lean figure of Qian Xian had become burly. He tore off his upper garment, revealing a well-built body inked with a mysterious black beast that resembled both a bear and a bull. The white flames were escaping from the tattoo on his body.<br/><br/>Qian Xian’s eyes glinted with a strong light, and even his mouth and nose expelled hot breath.<br/><br/>He turned and looked up at the massive Saint Spirit above him. In front of the Saint Spirit, he seemed as insignificant as an ant.<br/><br/>The Saint Spirit stopped and looked down at him with a cruel smile on its face.<br/><br/>“Hmph!”<br/><br/>Qian Xian turned and struck with his palm, conjuring up a vast mirage of mountains and rivers that materialized out of thin air above the Firmament, striking head-on and scattering the rolling black fog.<br/><br/>The Saint Spirit raised a hand and effortlessly crushed the mountain and river projection.<br/><br/>Immediately after, the Saint Spirit issued a shrill and piercing scream that echoed throughout the continent.<br/><br/>Inside Fang Residence in Southern Hills City.<br/><br/>Fang Wang stood up and tossed Xiao Zi aside.<br/><br/>Fang Jing, Fang Bai, Fang Hanyu, Chu Yin, Qu Xunhun, and the Two Immortals of the Emperor Sea all looked towards the horizon. They could see the terrifying form of the Saint Spirit, and even the complexions of the Two Immortals at the ninth layer of Nirvana Realm looked terrible.<br/><br/>Without waiting for Fang Wang’s orders, the two immortals vanished from their spot, heading to support Qian Xian.<br/><br/>At this moment, Qian Xian and the Saint Spirit were already engaged in an intense battle, soaring up as they fought. Qian Xian struck out with his palms repeatedly, with various spells bursting forth, creating a tremendous clamor that never ceased to resound, audible in every corner of Grand Qi.<br/><br/>The Saint Spirit resisted with its soul body. Freshly introduced to combat, it seemed unpolished at first, but as the battle erupted, its movements became increasingly swift, even landing hits on Qian Xian.<br/><br/>Qian Xian was struck by the scorpion tail and sent flying hundreds of miles away. Just as he stabilized his form, the Saint Spirit was already upon him, its gaping maw open, ready to devour him.<br/><br/>Boom!<br/><br/>A colossal fist shadow came from the side, unexpectedly sending the Saint Spirit flying.<br/><br/>As the Saint Spirit stabilized itself and shook its head, it turned to look and saw that it was Ji Rutian’s Mountain River Town Heaven Fist.<br/><br/>“Ji Rutian, do you realize what you are doing?”<br/><br/>Chang Shengzun’s voice came, laced with murderous intent.<br/><br/>Dugu Wenhun charged at the Saint Spirit with his spear, but the Saint Spirit roared in anger, suddenly dispersing into black mist to dodge the attack.<br/><br/>Before Dugu Wenhun could react, the Saint Spirit reappeared behind him, striking with a palm. His body was nowhere near as large as the Saint Spirit’s palm, and upon being hit heavily, he plummeted like a falling meteor, smashing through a series of mountains.<br/><br/>Seeing this, Ji Rutian immediately invoked his power, condensing a Golden Bell Phantom around his body. Carrying the bell shadow, he charged at the Saint Spirit.<br/><br/>Just then, Yu Xian and Chen Xian arrived at Qian Xian’s sides.<br/><br/>“Second brother, are you alright?”<br/><br/>“You’ve lost strength!”<br/><br/>They voiced simultaneously, to which Qian Xian replied with a grave expression, “He’s absorbing my cultivation.”<br/><br/>Cultivation?<br/><br/>Yu Xian and Chen Xian immediately turned to face the Saint Spirit.<br/><br/>Ji Rutian’s Golden Bell Phantom was shattered by the Saint Spirit’s tail, and he fell straight down, breaking through the ground and kicking up billowing dust.<br/><br/>Yu Xian took a deep breath and said, “This evil spirit has the fate to destroy the world; it must be eradicated. Prepare…”<br/><br/>Before he could finish his sentence, a figure appeared before them, causing Yu Xian to halt mid-speech.<br/><br/>Fang Wang!<br/><br/>Fang Wang, dressed in white, looked towards the distant Saint Spirit and softly said, “You go deal with Heaven’s Larceny Saint Sect.”<br/><br/>Hearing this, The Three Immortals of the Emperor Sea did not insist and immediately vanished into the air, leaving behind Qian Xian’s words: “Do not make contact with him; he will absorb your cultivation, not just Spiritual Power!”<br/><br/>If Spiritual Power is absorbed, one can recover by Qi Gathering, but if cultivation is absorbed, it might cause one’s realm to fall!<br/><br/>The gaze of the Saint Spirit suddenly fell on Fang Wang, and a twisted smile spread across its sinister face.\t\t\t\t\t\t</div>", "images": {}, "success": true}