{"id": 202, "url": "https://www.novelhall.com/i-became-an-immortal-on-mortal-realm-32879/14477879.html", "title": "Chapter 202 - Chapter 202: Chapter 199: Cataclysmic Disaster, Heavenbreaking Realm", "volume": 3, "volume_title": "Volume 3", "body": "<h1>Chapter 202 - Chapter 202: Chapter 199: Cataclysmic Disaster, Heavenbreaking Realm</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 202: Chapter 199: Cataclysmic Disaster, HeavenBreaking Realm<br/><br/>Translator: 549690339<br/><br/>“Do you know Li Qingsong?”<br/><br/>Fang Wang asked, looking around as he surveyed the illusionary realm.<br/><br/>Ever since Zhou Xue gave him this jade bracelet on the Emperor’s Tomb Island, he had studied it and found that it contained restrictions, but he didn’t dare to forcibly break through them. It was clear that the object was meant for Zhou Xue to contact him, and damaging it would not be good.<br/><br/>This was still the first time Zhou Xue had used this treasure to contact him. He had originally thought they would communicate through spiritual consciousness, but he didn’t expect it to be able to manifest an illusionary realm for face-to-face communication.<br/><br/>Coming to stand before him, Zhou Xue said softly, “In a previous life, when the Heaven’s Larceny Saint Sect revived the Saint Spirit and caused a great disaster, I was a believer of the Heaven’s Larceny Saint Sect and also faced life-and-death tribulations. In times of crisis, I was fortunate to be saved by Li Qingsong. Not only did he save me, but he also rescued other cultivators from the Heaven’s Larceny Saint Sect. He can be considered a greatly benevolent person. Later, he was gravely injured by the Sect Master of Heaven’s Larceny<br/><br/>Saint Sect, Wen Li, but he still fought desperately to protect us as we escaped. In the years that followed, he continuously saved cultivators in danger across the continent, until the Saint Spirit broke free from Wen Li’s control and slaughtered the land. Li Qingsong also fell during this time.”<br/><br/>“Without Li Qingsong, I would have died inside the Heaven’s Larceny Saint Sect in my previous life. There are countless great cultivators in the world, but few possess a heart for the greater world. Li Qingsong was one of them.” These words changed Fang Wang’s perspective of Li Qingsong.<br/><br/>It had been only three years since the Saint Spirit appeared, and Li Qingsong had rushed over from the East Immortal Sea, showing that he truly cared for the world.<br/><br/>Fang Wang had thrown only one punch previously because he acknowledged that Li Qingsong was here to rid the world of demons.<br/><br/>If not, Li Qingsong’s offense would have been more than just a simple punch.<br/><br/>“Of course, people are complex, with different sides. If he truly poses a threat to you, you need not hesitate,” Zhou Xue added as she looked Fang Wang over as if he were an exceedingly rare treasure.<br/><br/>Fang Wang couldn’t help asking, “Why do you look at me like that?”<br/><br/>Zhou Xue replied, “I’m marveling at your opportunities. The fist technique you used earlier is not simple, and the swordsmanship before that should be the Executioner Immortal Ghost God Sword of the Executioner Immortal Great Saint, yet it seems different.”<br/><br/>Fang Wang raised his left hand and said, “Can you sense my spiritual power through this jade bracelet?”<br/><br/>Zhou Xue nodded, “Only when you are fighting. If you mind, you can place it in the storage ring and take it out when you need to contact me.”<br/><br/>Fang Wang smiled, the corners of his mouth turning up, “Then let you sense it. It’ll be good pressure for you. Don’t think that having the experience of a past life means you can relax. I’m very strong.”<br/><br/>Zhou Xue shook her head with amusement. “You’ve been pressuring me already. Compared to myself at the same stage in my previous life, there’s a world of difference. Aside from my previous cultivation experiences, you’ve also played a significant role. I can’t let myself be surpassed by you, let alone left behind. ”<br/><br/>“Oh? You mean to say that I’m still not quite as good as you now?” Fang Wang asked with narrowed eyes.<br/><br/>Looking directly at him, Zhou Xue said, “I didn’t say that. But I have my own confidence. ”<br/><br/>The two looked at each other, their eyes sparking with competitive spirit for the first time.<br/><br/>Although their relationship was excellent and they relied on each other for survival, on the path of cultivation, they both hoped the other would grow stronger, yet neither wanted to lose to the other.<br/><br/>Zhou Xue had the pride of her past life’s cultivation, and Fang Wang had the desire to be the strongest.<br/><br/>After looking at each other for a few moments, they both started to laugh.<br/><br/>“By the way, you mentioned the Sect Master of Heaven’s Larceny Saint Sect, Wen Li, earlier. How strong is he? Has he reached the Celestial Qiankun Realm?” Fang Wang inquired.<br/><br/>Zhou Xue gave Fang Wang a glance and said, “The Celestial Qiankun Realm is the realm below that of a Great Saint, at the pinnacle of the Mortal Realm. There are many realms between the Nirvana Realm and the Celestial Qiankun<br/><br/>Realm. Although Wen Li is strong, he is far from touching the Celestial<br/><br/>Qiankun Realm. He is above the Nirvana Realm, in the Heaven-Breaking Realm.”<br/><br/>Heaven-Breaking Realm!<br/><br/>This was the first time Fang Wang had heard this name. Even the Three Immortals of the Emperor Sea did not know what the realm above Nirvana was, but they already stood at the pinnacle of the Emperor Sea. This puzzled him.<br/><br/>He followed up by asking, “Is Li Qingsong in the Heaven-Breaking Realm?”<br/><br/>Zhou Xue shook her head, “His cultivation is at the ninth layer of the Nirvana Realm, but the ultimate techniques of the Descending Dragon Mountain are even more profound.”<br/><br/>Curious, Fang Wang asked, “The Nirvana Realm is already the pinnacle of cultivation in the Southern Celestial Sea, Emperor Sea, and this continent, yet it’s so far from the Celestial Qiankun Realm. Is this the case everywhere else, or is our region just more backward?”<br/><br/>Zhou Xue replied, “The reason is the latter. Ten thousand years ago, when the Descending Dragon Great Saint became the sole Great Saint between heaven and earth, ruling over many seas and continents, his Saint Palace was built on this continent. After suffering suppression by the Immortal Gods of The Upper Realm, his rule ended, and this region also suffered from celestial oppression, resulting in weak fate and spiritual energy buried underground. The great cultivation sects and ancient families of other regions avoided this place like the plague. Over time, a cultivation barrier formed.”<br/><br/>“Since ancient times, this has been the case; the prosperous region of the world is determined by the greatest cultivator. The strong set the center of the mortal realm.”<br/><br/>Fang Wang fell into deep thought upon hearing this.<br/><br/>With a meaningful tone, Zhou Xue said, “After I ascend, although I can’t descend to the lower realms or spy on the Mortal Realm, I’ve heard other Immortal Gods of The Upper Realm mention that within a thousand years after my ascension, this Mortal Realm will enter an unprecedentedly prosperous era. Because of this, the Immortal Gods from The Upper Realm will descend time and again. If you choose to stay in the Mortal Realm and want to be the first under heaven, then you cannot afford to relax. You are strong now and possess many opportunities, but that doesn’t mean you can’t be surpassed by someone later.”<br/><br/>Upon hearing this, Fang Wang raised his eyebrows, “Really? That’s just perfect. This way, I won’t be lonely in the Mortal Realm.”<br/><br/>Within the illusionary realm of Fang Residence, the sun shone brightly, and the two stood in the courtyard, their shadows merging together in the sunlight.<br/><br/>Afterward, Fang Wang asked Zhou Xue some questions about the Saint Spirit, to which she answered everything she knew.<br/><br/>According to her, for the Saint Spirit to truly resurrect, it needed to find a strong body. The Saint Spirit Fang Wang had encountered three years prior had not yet formed fully. What’s more, the Sect Master of Heaven’s Larceny Saint Sect, Wen Li, would have the Saint Spirits devour each other to create the strongest Saint Spirit, a process that required time.<br/><br/>After discussing the Heaven’s Larceny Saint Sect, Fang Wang also inquired about Zhou Xue’s situation in the Emperor Sea.<br/><br/>Zhou Xue said things were going well and that she might even give him a surprise later, which made him start to look forward to it.<br/><br/>Having not seen each other for years, they talked for two hours before finally ending the conversation.<br/><br/>Fang Wang opened his eyes, touched the jade bracelet on his left wrist with his right hand, and then got up to leave the room, ready to continue his cultivation.<br/><br/>Zhou Xue, feeling the might of the Zhu Xian Jing Hong Sword and the Mountain River Town Heaven Fist, still had some confidence, which gave Fang Wang even more motivation to cultivate.<br/><br/>One certainly couldn’t be weaker than their fiancée!<br/><br/>Ever since the news of Heaven’s Larceny Saint Sect moving south reached<br/><br/>Grand Qi, the hearts of people everywhere were filled with apprehension. Even commoners had heard various legends about Heaven’s Larceny Saint Sect, and some sects and noble families took advantage of the chaos to cause trouble.<br/><br/>However, since Fang Wang’s return a few years ago, the restless Grand Qi had suddenly stabilized. Even the surrounding dynasties began to resist Heaven’s<br/><br/>Larceny Saint Sect, knowing they were not an invincible existence, at least the Grand Qi Sword Saint, Fang Wang, could easily suppress the invading army of Heaven’s Larceny Saint Sect!<br/><br/>The news of Fang Wang exterminating the Saint Spirits also spread within Heaven’s Larceny Saint Sect, causing much unrest among its followers, for the Saint Spirits were their faith.<br/><br/>In the following years, Fang Wang’s fame spread wider and wider, his name officially reaching across dozens of mainland dynasties and becoming known far and wide.<br/><br/>Another three years passed.<br/><br/>Fang Wang was very close to the seventh layer of the Golden Body Realm, but on that day, he was disturbed and involuntarily opened his eyes to look north.<br/><br/>Following his gaze, thunderclouds roiled in the northern sky, bringing an overwhelming pressure.<br/><br/>Fang Wang could feel that someone was fighting in a distant place, and one of the energies was unmistakably Li Qingsong from the Descending Dragon Mountain.<br/><br/>It seemed Li Qingsong was waging a great battle against Heaven’s Larceny Saint Sect.<br/><br/>Dugu Wenhun appeared behind Fang Wang, his expression grave, “Heaven’s Larceny Saint Sect actually has someone who can contend with Li Qingsong, shouldn’t we take the Fang Family and retreat?”<br/><br/>He had never expected such a great war to erupt on a backward continent like this!<br/><br/>Being at the Nineth Layer of the Mahayana Realm, he shuddered at the pressure coming from the horizon.<br/><br/>Fang Wang calmly said, “What retreat? Don’t rush, things haven’t reached that point yet. Take a closer look, there’s no evil presence of Saint Spirits within that overwhelming pressure, which means it’s Cultivators fighting against Li Qingsong.”<br/><br/>Dugu Wenhun, upon hearing this, couldn’t help but frown, “Even if it’s not the<br/><br/>Saint Spirits, it’s still not to be underestimated.”<br/><br/>In his heart, Fang Wang was mysterious and unfathomable, but the fact that Fang Wang had chosen to go into seclusion to cultivate in preparation for the battle against Heaven’s Larceny Saint Sect meant something, didn’t it?<br/><br/>It meant that even Fang Wang was not absolutely sure!<br/><br/>If even Fang Wang had no certainty against such a terrifying force, Dugu Wenhun naturally did not want to take a risk.<br/><br/>“If you are afraid, you can leave first.”<br/><br/>Fang Wang closed his eyes and said softly.<br/><br/>The living conditions on the ocean were tougher than on the mainland, many of the Fang Family members had mediocre cultivation talents, and it wasn’t good for everyone to go to the sea. Moreover, if they fled this time, when they faced a similar crisis in the future, they would definitely want to flee again.<br/><br/>Fang Wang had already learned from Zhou Xue that Li Qingsong had been entangled with Heaven’s Larceny Saint Sect for decades in his previous life, so this battle, while frightening, was just the beginning of the chaos, far from the real great disaster.<br/><br/>As long as he reached the Mahayana Realm, with his supreme techniques, he just might be able to execute Sect Master Wen Li of Heaven’s Larceny Sect!<br/><br/>By then, he would also be able to wield the Divine Skills of the first layer of the Heavenly Emperor Imperial Mirror, the Heavenly Emperor Avatar!<br/><br/>Dugu Wenhun hesitated for a moment, then bowed to Fang Wang and returned to his own quarters.<br/><br/>If Fang Wang wouldn’t leave, then he would risk his life to accompany him!<br/><br/>He refused to believe that a calamity powerful enough to end the world could emerge from this barbaric land!<br/><br/>The earth-shattering battle lasted a full three hours. After the boundless pressure dissipated, people in the dynasties across the continent were left trembling with fear.<br/><br/>Even the Demon Race on the continent felt the impending disaster, predicting even greater turbulence ahead.<br/><br/>Amongst the mountains and fields, in a forest clearing.<br/><br/>Suddenly, two figures emerged from the grass as if they had jumped up from underground, unmistakably Li Qingsong and Li Tianjue.<br/><br/>As soon as Li Qingsong appeared, he collapsed to the ground, spitting out a mouthful of blood. He quickly sat in meditation, channeling his qi with both hands.<br/><br/>At this moment, his Dao robe was torn, his hair disheveled, a far cry from his usual Immortal Aura and Daoist Bones.<br/><br/>Li Tianjue was also covered in wounds, her eyes full of fear.<br/><br/>As Li Qingsong channeled his qi, he coughed up blood, which was actually black, indicating he was deeply poisoned.<br/><br/>Li Tianjue took a deep breath, began setting up formations around them to isolate any prying from the outside world.<br/><br/>After completing this, she sat down beside Li Qingsong to meditate, channeling her qi to heal while saying softly, “Master, shouldn’t we retreat, or seek help from the Descending Dragon Mountain? This calamity is not something the two of us can resolve….”\t\t\t\t\t\t</div>", "images": {}, "success": true}