{"id": 204, "url": "https://www.novelhall.com/i-became-an-immortal-on-mortal-realm-32879/14491191.html", "title": "Chapter 204 - Chapter 204: Chapter 201: Mahayana Enlightenment, Above The Heavenly Origin", "volume": 3, "volume_title": "Volume 3", "body": "<h1>Chapter 204 - Chapter 204: Chapter 201: Mahayana Enlightenment, Above The Heavenly Origin</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 204: Chapter 201: Mahayana Enlightenment, Above the Heavenly Origin<br/><br/>Translator: 549690339<br/><br/>First, Li Qingsong headed north, followed by the Fang Family, the Peacock Saint King, and The Three Immortals of the Emperor Sea also moving northwards. Fang Wang seemed calm on the surface, but in fact, he also felt a sense of urgency growing within.<br/><br/>Previously, listening to Zhou Xue’s description didn’t give him a deep impression, but now being in the midst of it, he could truly feel the threat posed by Heaven’s Larceny Saint Sect. Not to mention the movement north, the number of people fleeing southwards was increasing, and even within Sword<br/><br/>Heaven Marsh, one could feel the tense atmosphere enveloping the continent.<br/><br/>Fang Wang could only focus on his cultivation, striving to become as strong as possible.<br/><br/>Inside Sword Heaven Marsh, Xiao Zi, Zhao Zhen, Chu Yin, and Dugu Wenhun were also earnestly cultivating. Among them, Chu Yin’s cultivation speed was the fastest. He had already mastered the Great Celestial Infinite Scripture and, with the addition of the Solaris Scripture, his Qi Gathering speed was quite astonishing—of course, this was also thanks to Fang Wang.<br/><br/>Fang Wang’s Heavenly Dao True Skill stimulated the Spiritual Energy underground, causing the Spiritual Energy within Sword Heaven Marsh to be far more abundant than before, even surpassing that within Biyou Island.<br/><br/>Time quickly passed by.<br/><br/>As the seasons changed, the Ling Wu above the lake of Sword Heaven Marsh surged chaotically.<br/><br/>In each following year, powerful oppressive auras of battles would frequently erupt from the north, including the aura of Li Qingsong and other unknown ones.<br/><br/>It’s worth mentioning that the Peacock Saint King’s aura never appeared, as if he had not engaged in battle.<br/><br/>The Peacock Saint King had left a deep impression on Fang Wang, so he was very concerned about his actions.<br/><br/>He worried that the Peacock Saint King might become a vessel for a Saint Spirit of Heaven’s Larceny Saint Sect. He always felt that the Heaven’s Larceny Saint Sect wouldn’t be ended by anyone else but him; otherwise, in his previous life, the Mortal Realm’s strongest wouldn’t have taken action.<br/><br/>Perhaps in his previous life, the Peacock Saint King had also come to this continent.<br/><br/>It wasn’t until nearly five years had passed that Fang Wang finally made a breakthrough to the ninth layer of the Golden Body Realm.<br/><br/>Such speed of breakthrough was extremely fast. This wasn’t the Profound Heart Realm or Condensation Spirit Realm—it was the Golden Body Realm, which was above the Cross-Void Realm. Many people were stuck on the first layer of the Golden Body Realm, unable to break through to the second layer in their lifetime.<br/><br/>In that year, during the latter half, Song Jinyuan returned with people.<br/><br/>When he left, he brought a hundred people, yet he returned with three to four hundred, though most of the familiar faces were gone, the majority being children.<br/><br/>“The north has fallen into complete chaos, rife with turmoil and slaughter. The<br/><br/>Demonic Sects of the various dynasties, under the banner of Heaven’s Larceny Saint Sect, act wantonly—soul refining, gu raising, indulgence in pleasures; they stop at no evil…”<br/><br/>Song Jinyuan sat beside Fang Wang and spoke gravely.<br/><br/>Just having been away for a few years, he seemed to have aged significantly, even more so than when he had experienced the death of his master.<br/><br/>Fang Wang was silent for a moment, then said, “Then treat the people you have brought back well. From now on, teach them the way of the sword. The Celestial Sword Intent can also be imparted to them.”<br/><br/>Song Jinyuan gave a wry smile and said, “I used to think that you casually teaching others the Sword Dao of our master was disrespectful. Now it seems you were the one with foresight. If all of the supreme skills in the world were not hidden away in the hands of individuals and were open for everyone to cultivate, even if they don’t succeed, their strength would at least increase, and their ability to protect themselves would be stronger. In times of such chaos, they would have a greater hope to survive.”<br/><br/>Fang Wang consoled him, “Don’t think too much about it, good and evil will eventually be repaid.”<br/><br/>“Alas, even though that’s the case, when will the retribution for Heaven’s Larceny Saint Sect come,” Song Jinyuan sighed deeply.<br/><br/>Fang Wang calmly said, “Just a few more years.”<br/><br/>Song Jinyuan heard the implication in his words and quickly advised, “Fang Wang, don’t be reckless. I know you are strong, but with just the strength of one person, it’s impossible to reverse the situation. We should see how Protecting Heaven Sect acts. Protecting Heaven Sect is temporarily formed by the righteous sects from thirty-seven dynasties, and the number of their adherents is still growing. If you want to act, then wait for Protecting Heaven Sect to start a war with Heaven’s Larceny Saint Sect, then you can aid<br/><br/>Protecting Heaven Sect.”<br/><br/>Fang Wang did not explain but instead asked, “What about the conduct of<br/><br/>Protecting Heaven Sect?”<br/><br/>“They are indeed a group of heroes with a concern for the common people. I have lived and fought alongside them. Even though some joined out of sheer passion and are afraid when faced with life and death, they are truly engaged in the act of saving others,” Song Jinyuan said with a look of sentiment.<br/><br/>He began to recount his experiences over the years.<br/><br/>He led a hundred Sword Servants northward and encountered a group of young Cultivators who wanted to join Protecting Heaven Sect. After discussion, they joined the Sect together.<br/><br/>Along the way, they fought demons and relieved the suffering of the afflicted. Despite the hardships and constant life-or-death battles, when Song Jinyuan recalled them. his face was filled with satisfaction- Only when talking about<br/><br/>Heaven’s Larceny Saint Sect did his face show hate and fear.<br/><br/>Fang Wang looked at Protecting Heaven Sect in a new light, having originally thought them to be a ragtag group, never expecting them to gain momentum.<br/><br/>However, Zhou Xue had never mentioned Protecting Heaven Sect, fearing that their end was tragic.<br/><br/>The two talked for a long time before Song Jinyuan stood up to leave.<br/><br/>The people he brought back livened up Sword Heaven Marsh. The young Cultivators and children all wanted to meet Fang Wang because he was the only one thus far who had defeated Heaven’s Larceny Saint Sect head-on. Although it wasn’t the full force of the Sect, over half of their army was killed or injured, and what’s more, a Saint Venerate died at his hand.<br/><br/>Within Heaven’s Larceny Saint Sect, under Sect Hierarch Wen Li, the highest position belonged to the five Saint Venerates.<br/><br/>The fame of Fang Wang, who had slain Chang Shengzun, soared greatly, spreading across the entire continent, and he was already seen by the Cultivators of various dynasties as one of the top Great Cultivators in the world.<br/><br/>This world, of course, refers to the world of the continent.<br/><br/>Song Jinyuan did not allow these people to disturb Fang Wang. Although Sword Heaven Marsh had become lively, the area where Fang Wang cultivated remained quiet.<br/><br/>How long it would take to break through from the ninth layer of the Golden Body Realm to the Mahayana Realm, Fang Wang wasn’t sure. He could only cast aside all distracting thoughts and concentrate on his cultivation.<br/><br/>The higher the realm, the greater the transformation of each major realm. The Mahayana Realm was also a critical junction.<br/><br/>Legend has it that Mahayana is the limit that Mortals can reach, and in ancient times, it was the pinnacle of cultivation, until a sage of antiquity created the Nirvana Realm. Reaching the Nirvana Realm allows one’s Lifespirit Treasure to transform, starting at the Heaven Yuan grade.<br/><br/>Of course, this kind of Heaven Yuan Spirit Treasure is of a later grade, and there is still a gap compared to those Cultivators whose Lifespirit Treasures are of the Heaven Yuan grade from the start, so above Heaven Yuan, there are still higher grades.<br/><br/>For Cultivators who own a Heaven Yuan Spirit Treasure and undergo the tribulation of Nirvana, their Spirit Treasure can reach a grade above Heaven Yuan. Therefore, even though Cultivators of the Nirvana Realm at least possess a Heaven Yuan Spirit Treasure, there’s still a disparity.<br/><br/>Fang Wang reflected on the descriptions of the Mahayana Realm and Nirvana Realm by The Three Immortals of the Emperor Sea and Dugu Wenhun, while simultaneously stimulating the Solaris Scripture.<br/><br/>Although the Solaris Scripture was a nine-layered mental method, it recorded many breakthrough techniques. There were three layers above the Mahayana Realm, which meant the creator of the Solaris Scripture was at least three major realms higher than the Mahayana Realm.<br/><br/>He wondered if the creator of the Solaris Scripture had any fame in the Mortal Realm?<br/><br/>Fang Wang decided that once the matters with Heaven’s Larceny Saint Sect were settled, he would integrate the Heavenly Dao True Skill with the Solaris Scripture. He already possessed no small number of Divine Skills and felt it was time to enhance his Qi Gathering Technique.<br/><br/>Spiritual Power was the foundation and source of true strength!<br/><br/>As Fang Wang calmed his mind, he began to forget his surroundings.<br/><br/>He even stopped being vigilant about whether someone would approach him, fully immersing himself in the understanding of the Mahayana Realm.<br/><br/>The sun set, the moon rose, and the clouds in the sky began to churn faster, as did the speed of the birds and beasts that flew by; the scene of the world seemed to be sped up.<br/><br/>Spring left and autumn arrived, followed by the descent of winter snow. The heavy snow fell on Fang Wang, his Yang Energy gradually radiating outwaras, causmg me snow co melt ana rormmg a spectacular mist arouna him.<br/><br/>Within the mist, his figure was indistinct.<br/><br/>Xiao Zi lay on the wooden railing in front of the loft’s door, sticking out her tongue and staring at Fang Wang.<br/><br/>Aside from cultivation, she spent most of her time like this, watching Fang Wang. She had lost interest in everything else in Sword Heaven Marsh, only caring for Fang Wang.<br/><br/>Day after day, she did not find it dull. Watching Fang Wang cultivate, her heart also calmed down, and she even had her own insights.<br/><br/>In the blink of an eye, another three years passed.<br/><br/>The 165 -year-old Fang Wang opened his eyes to a vibrant spring landscape and a majestic mountain peak opposite him, a flash of enlightenment sparked in his eyes.<br/><br/>He gradually found the feeling of the Mahayana Realm.<br/><br/>Gathering his thoughts, his divine sense covered Sword Heaven Marsh, and then he slightly raised his eyebrows, stood up, and disappeared from the spot.<br/><br/>Several miles away, by the lakeside pavilion, Gu Tianxiong stood on the grass, holding a long sword and facing the great lake, immersed in comprehending the Celestial Sword Intent.<br/><br/>Fang Wang appeared out of thin air behind him, undetected.<br/><br/>Turning his head, Fang Wang could sense Gu Li’s presence inside the pavilion.<br/><br/>Having not seen her for more than twenty thousand years, he had not forgotten about Gu Li. Since he embarked on the path of cultivation, he had seen many people, but the number of true friends he had made could be counted on one hand, and Gu Li was one of them.<br/><br/>“Brother Gu, it seems you are not suited for Celestial Sword Intent. You might as well focus on cultivating the Divine Nurturing Sword Qi, ” Fang Wang said.<br/><br/>Upon hearing this, Gu Tianxiong was so startled that he trembled all over. Turning around and seeing Fang Wang, he was immediately overjoyed.<br/><br/>“Brother Fang, how come you’re here? Weren’t you in seclusion?” Gu Tianxiong asked excitedly.<br/><br/>He approached enthusiastically and patted Fang Wang on the shoulder, very happy.<br/><br/>Fang Wang smiled and replied, “How could I not greet you when Brother Gu has arrived?”<br/><br/>In truth, he mainly wanted to take a break after sitting in meditation for many years, to relax.<br/><br/>The next breakthrough would not depend on Qi Gathering but on comprehension.<br/><br/>In the Mahayana Realm, one understands nature and the way humans also exist within it.<br/><br/>Fang Wang felt Gu Li stand up from behind him and walk to the door, but she stopped and did not push it open.<br/><br/>“Hahaha, it’s been decades since we last met, Brother Fang. Although you have now become a great hero, you still treat old friends as you did before, which I greatly admire. But the Divine Nurturing Sword Qi you told me to study just now, how do I go about studying that? Isn’t it just nurtured inside the body?” Gu Tianxiong laughed heartily, curious to inquire.<br/><br/>He was curious about Fang Wang’s understanding of the Divine Nurturing Sword Qi since he had asked Gu Li to pass it on to Fang Wang.<br/><br/>Fang Wang smiled without saying a word, then took a step to the side.<br/><br/>His gaze sharpened, and his eyes suddenly emitted a sword light.<br/><br/>Whoosh!<br/><br/>A Sword Qi burst forth from his eyes and rushed towards the lake surface at an extremely fast speed.<br/><br/>Gu Tianxiong’s hair fluttered in the breeze created by the Sword Qi, and he widened his eyes in shock, instinctively turning to look after it. With his<br/><br/>Profound Heart Realm cultivation, he could barely catch sight of a streak of<br/><br/>sword light.<br/><br/>Such fast Sword Qi!<br/><br/>Suddenly!<br/><br/>The Divine Nurturing Sword Qi came striking towards him, and in an instant, he was enveloped by a terrifying pressure, making him unable to move.<br/><br/>When the Divine Nurturing Sword Qi reached him, it suddenly curved, beginning to revolve around his body. The indescribable pressure dissipated, leaving only the sharp sound of wind echoing in his ears.<br/><br/>Watching the Divine Nurturing Sword Qi encircling him, Gu Tianxiong became excited..\t\t\t\t\t\t</div>", "images": {}, "success": true}