{"id": 209, "url": "https://www.novelhall.com/i-became-an-immortal-on-mortal-realm-32879/14492302.html", "title": "Chapter 209 - Chapter 209: Chapter 206: Thousand Eyes Great Saint, Decisive Battle At Great Saint Mountain", "volume": 3, "volume_title": "Volume 3", "body": "<h1>Chapter 209 - Chapter 209: Chapter 206: Thousand Eyes Great Saint, Decisive Battle At Great Saint Mountain</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 209: Chapter 206: Thousand Eyes Great Saint, Decisive Battle at Great Saint Mountain<br/><br/>Translator: 549690339<br/><br/>Fang Wang journeyed northward, frequently changing direction. Wherever the Demonic Qi was dense, he would head there and commence his slaughter. Occasionally, Dugu Wenhun would also lend a hand, but with every battle, Fang Wang would unleash the Zhu Xian Jing Hong Sword, absorbing the souls of the Heaven’s Larceny Saint Sect’s Demonic Cultivators, bolstering his own ghostly spirits.<br/><br/>For the many years of wrongdoing by the Heaven’s Larceny Saint Sect, Fang Wang showed no mercy, regardless of whether they had just joined the sect.<br/><br/>What he sought was to stop killing with killing, to carve out a clear and bright Qiankun!<br/><br/>Since heading north, Fang Wang hadn’t encountered a single Cultivator of the Nirvana Realm, although he met several from the Mahayana Realm. There was no need for Fang Wang to act personally, as Dugu Wenhun could easily slaughter them, allowing Fang Wang’s ghostly spirits to capture their souls.<br/><br/>In the blink of an eye, a month had passed.<br/><br/>The reputation of Fang Wang had thoroughly spread, and the entire continent was buzzing with news that Fang Wang was hunting down the members of the Heaven’s Larceny Saint Sect everywhere, which both heartened the Protecting Heaven Sect and sent chills down the spines of the Heaven’s Larceny Saint Sect.<br/><br/>The four Great Saints dared not face Fang Wang, and Sect Hierarch Wen Li had yet to show himself, which plunged the Heaven’s Larceny Saint Sect into turmoil.<br/><br/>Within a ruined stone hall, the Lord of the Protecting Heaven Church Shen Buhui, Li Tianjue, and a host of the sect’s higher-ups were gathered, and the atmosphere was brimming with excitement.<br/><br/>“Hahaha, the situation is looking great. As Tian Dao Fang Wang rolls in, the activities of the Heaven’s Larceny Saint Sect are swiftly diminishing.”<br/><br/>“We cannot be complacent, after all, Wen Li and the four Great Saints have yet to make a move.”<br/><br/>“Fang Wang has killed a Great Saint, and after his retreat, I believe the four Great Saints dare not contend with him.”<br/><br/>“Now it’s just a matter of who is stronger between Fang Wang and Wen Li.”<br/><br/>“Alas, the strength of old devil Wen Li is indeed inconceivable. What realm is he at exactly? It feels like he’s on a completely different level from us Cultivators. I even think he might be deliberately letting us live.”<br/><br/>Shen Buhui sat on a broken table, listening to his subordinates’ discussions. When the talk turned to whether Wen Li was intentionally letting them live, the arguing was endless, and finally, all eyes were on Shen Buhui.<br/><br/>Shen Buhui looked at his right hand, with wisps of white vapor weaving around his fingers.<br/><br/>Expressionless, he said, “Naturally, it’s deliberate. If he had annihilated us, a second Protecting Heaven Sect would stand up, and with us alive, they can flaunt their might, attract more followers, and we can also bring them a steady stream of souls.”<br/><br/>His words silenced everyone present. Their hearts were heavy.<br/><br/>Someone asked, “Why don’t we ally with Fang Wang, and have him fight alongside us?”<br/><br/>Li Tianjue replied, “We’ve already sent envoys to invite him. Whether he missed them or refused, we do not know.”<br/><br/>Just then, the sound of something tearing through the air was heard.<br/><br/>A Great Cultivator of the Protecting Heaven Sect wearing black clothes hurriedly raised his hand in front of Shen Buhui, grabbed a streak of white light, and trembled under the force contained within it.<br/><br/>“Who’s there?”<br/><br/>Instantly, dozens of Cultivators vanished from the hall to check the situation.<br/><br/>The black-clothed Cultivator flipped open his right palm to reveal a white jade in his hand. As everyone looked closely, a phantom emerged from it—a middle-aged man in a red robe, with a ferocious face and eyebrows brimming with murderous intent.<br/><br/>“To all from the Protecting Heaven Sect, you must come to Great Saint Mountain by noon tomorrow for a life-and-death battle. Should you fail to arrive, or come late, the four hundred thousand captives of the Protecting Heaven Sect will be slaughtered on Great Saint Mountain. We will extract their souls, strip their bones, refine their tendons and temper their blood, ensuring a fate worse than death, full of regret for this Mortal Realm visit!”<br/><br/>“Remember, Shen Buhui, you must be there, waiting only until noon tomorrow!”<br/><br/>The man in the red robe let out a hideous laugh, and with those words, he vanished into thin air. The white jade then shattered, turning into fine powder that dispersed.<br/><br/>The Protecting Heaven Sect’s leadership exploded in anger, hurling curses.<br/><br/>It turned out that the man in the red robe was none other than Saint Hong—one of the five Great Saints of the Heaven’s Larceny Saint Sect!<br/><br/>This man had the most frequent dealings with the Protecting Heaven Sect!<br/><br/>Li Tianjue furrowed her brows and said, “We must be there by tomorrow noon, so it seems they’ve laid a trap for you, either to get rid of you or to covet your power. Fang Wang has become a threat to them; they must act in advance. Considering Fang Wang’s recent whereabouts, he is at a considerable distance across the Eight Dynasties Land, and he will be hard to reach within a day.”<br/><br/>Shen Buhui calmly said, “Does that mean in Wen Li’s eyes, Fang Wang is a bigger threat than me?”<br/><br/>Li Tianjue sighed, “After all, Fang Wang has slain a Great Saint, and even my master greatly fears him.”<br/><br/>Speaking of her master, a worried look flashed in Li Tianjue’s eyes.<br/><br/>She had not heard any news of Li Qingsong’s whereabouts for several years, and she feared something had happened to him.<br/><br/>Shen Buhui slowly stood up, causing the Cultivators who were cursing in anger to halt and turn their gazes towards him.<br/><br/>“Issue the command to mobilize the Thirty-Six Sub-halls. We set out in one hour, heading for Great Saint Mountain!”<br/><br/>Shen Buhui stated decisively, allowing no room for argument. The others fell silent, but eventually, under his piercing gaze, everyone backed down and began to spread the command.<br/><br/>Soon, only Shen Buhui and Li Tianjue remained in the hall.<br/><br/>Li Tianjue looked at Shen Buhui and said, “This time is different from the past. Wen Li is likely to appear. Are you ready to face him? He has let you grow, most likely planning to make your body a vessel for a demonic soul. This tribulation is fraught with mortal peril.”<br/><br/>Shen Buhui’s eyes became cold as he replied, “Rumors say Wen Li has three eyes, a divine being by birth. I don’t believe it. I, too, was born a favored child of heaven. At seven, I underwent Spiritual Refinement, possessed of a talent of the highest order. By twenty-five, I reached the Spirit Elixir Realm, and by forty, the Profound Heart Realm, my aura uncontained…”<br/><br/>“I wish to kill Wen Li, not just for all under heaven, but to avenge my kin. Wen Li stole the souls of my parents and ancestors; without avenging this grudge, my life would be meaningless. Even in death, I must go!”<br/><br/>“Previously, I was uncertain, but now, having amassed immense Fate, I am confident.”<br/><br/>He turned to look at Li Tianjue with a softened gaze, and said, “Tianjue, I owe you, for you have shown me hope of vengeance. Perhaps you think I’m not yet worthy, but I believe you underestimate the might of the Wanhua Haoshi Technique you taught me. It is strong, so strong that I feel I can achieve anything I wish.”<br/><br/>His right hand tightened, and the white vapors at his fingertips dissipated.<br/><br/>Li Tianjue wanted to say something but paused, as she couldn’t really judge how strong Shen Buhui was now. Although she was skilled in the art of wielding Spiritual Power over all things, she had never gathered the Fate of so many Cultivators before.<br/><br/>Shen Buhui turned and took a few steps forward, looking towards the sky outside the hall, and said with a light laugh, “I’ll take on the title of the Savior then.”<br/><br/>His silhouette made Li Tianjue feel as if he had changed.<br/><br/>He reminded her somewhat of her eldest senior brother.<br/><br/>He was a far cry from the bedraggled figure she had rescued back then.<br/><br/>With a smile, Li Tianjue no longer thought about Wen Li’s schemes, knowing full well they were traps but the Protecting Heaven Sect had to keep the appointment nonetheless.<br/><br/>Under the night sky, Fang Wang, Xiao Zi, and Dugu Wenhun were meditating by a fire, with Zhao Zhen also hovering in the air, holding a Shariputra in his hand.<br/><br/>Since the inner trials of the Eternal Life Pavilion had ended, Zhao Zhen spent his free time studying the two Shariputras. Decades had passed without piercing their mysteries, but he hadn’t given up, showing an almost obsessive persistence.<br/><br/>“Having killed so many Demonic Cultivators, Wen Li still has yet to appear; it seems he truly fears you,” Dugu Wenhun said with a chuckle.<br/><br/>Fang Wang was roasting wild chicken, but his body was continuously absorbing nature’s spiritual energy.<br/><br/>Dugu Wenhun continued, “The more I hear about the legends of Wen Li, the more curious I become. The path of his cultivation is extremely strange. Rumors say that the eye growing on his chest might be some Great Saint Legacy.”<br/><br/>Xiao Zi asked curiously, “Which Great Saint?”<br/><br/>Dugu Wenhun replied, “Thousand Eyes Great Saint. One eye possesses one Divine Skill. He was a Great Saint from a hundred thousand years ago, also a questioned one. During his era, there was a great event of ascension, with nine beings ascending to immortality. He failed to seize the opportunity for ascension, and only a thousand years later, at the end of his life, did he attain the status of a Great Saint, piercing the heavens and governing the Mortal Realm for less than a thousand years before dying.”<br/><br/>“He is known as the shortest-reigning Great Saint in the Mortal Realm. Speaking of which, no one really knows how long a Great Saint can live. Some have ruled the Mortal Realm for tens of thousands of years, like Immortal Kings of the Mortal Realm, while others, invincible in their era, broke through the void and pursued higher paths of Dao. Yet no Great Saint has ever appeared alive before us.”<br/><br/>Surprised by this, Xiao Zi asked, “Does that mean becoming a Great Saint doesn’t necessarily grant eternal life?”<br/><br/>With a sense of melancholy, Dugu Wenhun answered, “Yes, at least I haven’t heard of anyone in the world who truly has eternal immortality. Though there are such legends from ancient times, if one were truly immortal, why have they not lived until today? Of course, another possibility is that the heavens and earth are vast, and I am simply not qualified to encounter such beings.”<br/><br/>Talking about Great Saints and eternal life piqued Xiao Zi’s interest, and she kept asking questions, while Dugu Wenhun shared his own experiences.<br/><br/>Fang Wang also listened attentively, interested in those Great Saints whose names lived on through the ages.<br/><br/>He was unsure whether the term “Great Saint” denoted a realm or a kind of Fate or status.<br/><br/>Even if Wen Li possessed a Great Saint Legacy, he was unafraid.<br/><br/>Great Saint Legacy?<br/><br/>He had two of them, as well as the legacies of two Great Emperors who were no less formidable than Great Saints!<br/><br/>They continued on their journey until daylight arrived.<br/><br/>That morning, they encountered another group of followers of the Heaven’s Larceny Saint Sect. Fang Wang didn’t leave any survivors, since his message had already spread throughout the continent.<br/><br/>He had already admonished the Demonic Cultivators to leave the sect, so those who still dared to do evil in the name of the Heaven’s Larceny Saint Sect, upon being encountered by him, naturally could not be spared.<br/><br/>Until noon.<br/><br/>Fang Wang’s nine ghost gods had yet to disperse when he suddenly sensed a surge of an extremely strong aura from the distance, far surpassing that of the battles from the past years.<br/><br/>Dugu Wenhun, Xiao Zi, and Zhao Zhen all turned their heads to look in that direction and were shocked.<br/><br/>Such a terrifying aura!<br/><br/>Their first thought was of Wen Li, the Lord of the Heaven’s Larceny Sect!<br/><br/>Fang Wang remained composed and took the nine ghost gods into his body, then said, “Let’s go and see whether it’s a god or a specter.”<br/><br/>In the Heaven’s Larceny Saint Sect, Wen Li was hailed as a divine being, which made Fang Wang all the more interested in him.<br/><br/>Meanwhile.<br/><br/>At another part of the world, the Great Saint Mountain.<br/><br/>The Great Saint Mountain stood upon a deserted plain, appearing like a towering giant from a distance. It was said that the Descending Dragon Great Saint had attained enlightenment there; his followers piled up a mountain as a statue for sacred offerings. Standing at three thousand feet, the Great Saint Mountain was the largest man-made wonder on the continent.<br/><br/>At that moment, countless Demonic Cultivators hovered in front of Great Saint Mountain. They were densely packed, and their Demonic Qi called forth rolling thunder clouds.<br/><br/>On the ground below, more than a million Cultivators from the Protecting Heaven Sect stood. Together, they reached out their hands forward, all their Spiritual Power converging toward Shen Buhui at the forefront.<br/><br/>Shen Buhui raised his right hand towards the heavens, and the surging Spiritual Power formed a massive shield of light. The dazzling glow and the wind it whipped up swept across the lands for a hundred thousand miles.<br/><br/>Following his gaze, one could see five figures suspended high in the sky, among them was Saint Hong who had declared war on them the day before.<br/><br/>Facing off against Shen Buhui was a Saint Spirit resembling a human with three heads and six arms. Its soul-body blazed like red flames, almost two zhang tall. Its genderless face had distinct features but no visible hair. It was oppressing Shen Buhui with a single palm.<br/><br/>Shen Buhui, gathering the Spiritual Power of a million Cultivators, still couldn’t push back against its Spiritual Power.<br/><br/>“The art of wielding boundless Spiritual Energy? Truly a lesser generation than the last,” it said.\t\t\t\t\t\t</div>", "images": {}, "success": true}