{"id": 206, "url": "https://www.novelhall.com/i-became-an-immortal-on-mortal-realm-32879/14491527.html", "title": "Chapter 206 - Chapter 206: Chapter 203: Mahayana Realm, The Seventh Lifespirit Treasure", "volume": 3, "volume_title": "Volume 3", "body": "<h1>Chapter 206 - Chapter 206: Chapter 203: Mahayana Realm, The Seventh Lifespirit Treasure</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 206: Chapter 203: Mahayana Realm, The Seventh Lifespirit Treasure<br/><br/>Translator: 549690339<br/><br/>Xiao Zi arrived at the pavilion behind the wooden bridge, her serpentine eyes fixed intently on Fang Wang.<br/><br/>Dugu Wenhun, Chu Yin, Song Jinyuan, and all the cultivators within Sword Heaven Marsh stepped out of their respective houses, or turned their heads to look in Fang Wang’s direction.<br/><br/>Gu Tianxiong and Gu Li also came to the lakeside. Looking into the distance along the shore, they could see the majestic Spiritual Fog churning violently, more imposing than the surrounding mountains. Within that dense fog, Fang Wang’s silhouette flickered in and out of view, faintly revealing an aura like the fire of the sun, its Yang Energy.<br/><br/>“Such terrifying momentum, what kind of realm is he attempting to break through?” Gu Tianxiong muttered, his face filled with surprise and envy.<br/><br/>Longing shone in Gu Li’s eyes.<br/><br/>She did not know when she could reach the heights Fang Wang now had, or even if she would ever have such an opportunity in this lifetime.<br/><br/>Although Fang Wang inspired her, she was well aware of her own talents.<br/><br/>Knowing it was difficult, she still wanted to give it her all and try.<br/><br/>Elsewhere.<br/><br/>Dugu Wenhun came up to Xiao Zi and exclaimed with emotion, “Such momentum for a Mahayana Realm breakthrough is truly extraordinary.”<br/><br/>Xiao Zi laughed proudly, “That’s only natural, you haven’t seen how formidable my young master is.”<br/><br/>Dugu Wenhun continued, “The transformation brought about by breaking through to the Mahayana Realm is stronger than any prior realm. It’s no exaggeration to say that upon reaching Mahayana Realm, one is halfway to transcending the mortal coil, with a lifespan that can extend up to three thousand years.”<br/><br/>Feeling Fang Wang’s momentum, he became even clearer about the gap between himself and Fang Wang.<br/><br/>Standing at the head of the bridge, Fang Wang swallowed the Earth Spirit Qi, and gradually the entire Sword Heaven Marsh began to tremble slightly, affecting a thousand miles around, with the southern ocean stirring up waves, furiously crashing against the coast.<br/><br/>Fang Wang appeared to stand still, but was in fact channeling his divine skill, pushing towards the Mahayana Realm. Meanwhile, he contemplated his seventh Lifespirit Treasure!<br/><br/>So far, he had the Heavenly Palace Halberd, the Rainbow Sword, the Qiankun Fan, the Reincarnation Bell, The Six Harmonies and Eight Desolations Seal, and the Heavenly Dao Imperial Dragon Crown – an arsenal that was both offensive and defensive, with abilities for sealing, soul capturing, and storing Spiritual Power. Regarding the seventh Lifespirit Treasure, he had yet to make a decision.<br/><br/>This time, he decided to ask his heart, to ask the Heavenly Palace!<br/><br/>He wanted to see if the Heavenly Palace could help him create a Lifespirit Treasure that was no less formidable than the Heavenly Palace Halberd.<br/><br/>To date, his strongest Lifespirit Treasure remained the Heavenly Palace Halberd, inherently infused with a powerful and mysterious force that amplified as his cultivation rose.<br/><br/>Fang Wang closed his eyes and focused on the breakthrough.<br/><br/>Boom——<br/><br/>Sudden thunderclouds gathered, and the Heavenly Might overshadowed the land, thrilling everyone within Sword Heaven Marsh. Many flew to the mountain tops or hovered above the lake, watching Fang Wang shrouded in thick fog, eager to witness the breakthrough of Grand Qi’s number one figure.<br/><br/>“With such a display… does anyone know which realm he is breaking through?”<br/><br/>“It must be a realm above the Cross-Void Realm.”<br/><br/>“Legend has it that Fang Wang is not yet two hundred years old; one can hardly imagine how strong he will be when he reaches a thousand.”<br/><br/>“He is the Sword Saint, and he can make all geniuses in the world pale in comparison. Once his breakthrough is successful, perhaps he will be able to put an end to the calamity brought by the Heaven’s Larceny Saint Sect.”<br/><br/>“Pay close attention, it’s the Celestial Sword Intent!”<br/><br/>The sword cultivators discussed among themselves, and soon someone exclaimed in shock, prompting everyone to sense attentively, and to their delight, they discovered that the entire Sword Heaven Marsh was permeated with the Celestial Sword Intent.<br/><br/>It was Fang Wang’s Celestial Sword Intent he intentionally released for everyone to perceive.<br/><br/>Gu Li closed her eyes and felt the vastness of the Celestial Sword Intent, a boundless respect arising in her heart.<br/><br/>Any sword cultivator facing this Celestial Sword Intent would realize the insignificance of their own Sword Dao. Gu Li felt that her Sword Dao might not even qualify as a Sword Dao.<br/><br/>At the same time.<br/><br/>In a far distant sea region, an immense red bird soared through the air, much like a Phoenix.<br/><br/>Zhou Xue stood at the forefront of the bird, her red dress fluttering. She looked ahead, standing beside her was a man, none other than Xiao Kuang, possessed by the Hongxuan Emperor.<br/><br/>Zhou Xue seemed to sense something, and couldn’t help but raise her right hand, looking at the jade bracelet on her wrist. She showed a smile, her eyes complex with relief, surprise, as well as envy and wonder.<br/><br/>Even with her knowledge of the Upper Realm, she couldn’t comprehend how Fang Wang had grown to this point.<br/><br/>Such a person, fortunately, was her close ally. If he were an enemy, how terrifying that would be.<br/><br/>“What’s the matter?” asked the Hongxuan Emperor.<br/><br/>Zhou Xue replied calmly, “Nothing much, someone has just made a breakthrough.”<br/><br/>The Hongxuan Emperor raised an eyebrow, “It’s not that monster, Fang Wang, is it?”<br/><br/>Zhou Xue glanced at him and said, “He’s not a monster.”<br/><br/>“Haha, well, he’s certainly not normal. It’s a good thing there was no one like him around during my prime, or else…” The Hongxuan Emperor shook his head, clicking his tongue in amazement.<br/><br/>To this day, he hadn’t told Zhou Xue that Fang Wang challenged and won against his Golden Body Realm self while still in the Mahayana Realm…<br/><br/>It was outrageous!<br/><br/>To deal with other cultivators, he only needed to use the most basic Heavenly Emperor’s Command, but even the Heavenly Emperor Avatar was not enough against Fang Wang.<br/><br/>Wait a minute!<br/><br/>Fang Wang’s breakthrough…<br/><br/>Wouldn’t it mean he’s about to achieve the Mahayana Realm, making him capable of wielding the Heavenly Emperor Avatar?<br/><br/>The smile faded from the Hongxuan Emperor’s face, turning solemn.<br/><br/>“You’ll have to take the next target on, don’t let down the majesty of the Great Emperor,” Zhou Xue said, changing the subject.<br/><br/>The Hongxuan Emperor looked up, snorted, “That’s a trivial matter. But I do want to see if the other party is as divine as you say. Does he really have the qualifications of a Great Saint? Can there really be two in this era?”<br/><br/>Zhou Xue smiled, “Who says there can only be one Great Saint in an era? During the Grand An Divine Dynasty, there were quite a few Great Saints among humans. It was by suppressing many Great Saints that the Grand An Divine Emperor became one of the most eminent figures in the vast annals of history.”<br/><br/>The Hongxuan Emperor glanced at her and said, “You truly are different than before, to even know about things from the Grand An Divine Dynasty period.”<br/><br/>Zhou Xue neither agreed nor disagreed, her gaze fixed ahead, but she placed her hands behind her back, her left hand touching the jade bracelet on her right wrist.<br/><br/>…<br/><br/>Since the gathering of thunderclouds, Heavenly Might was vast, yet there was no thunder falling.<br/><br/>This was the effect of the Heavenly Dao True Skill. Fang Wang dared to use the name of Heavenly Dao because this skill had already merged with nature and been recognized by this world.<br/><br/>Although there was no thunder, his breakthrough was not instantly successful.<br/><br/>It took several hours before his cultivation finally broke through its shackles, his Spiritual Power surged dramatically, his energy soaring into the sky, Yang Energy piercing through the rolling thunderclouds, allowing sunlight to fall down and shine on everyone in Sword Heaven Marsh.<br/><br/>Every person had their eyes closed, perceiving the Celestial Sword Intent of Fang Wang.<br/><br/>The sunlight made their shadows appear hazy and ethereal.<br/><br/>As Fang Wang’s Spiritual Power began to surge, he took the opportunity to begin Spiritual Refinement.<br/><br/>At the bottom of the lake, there were abundant Heavenly Dao Spirit Stones for his Spiritual Refinement, and it must be said that Sword Saint was indeed exceptional. Despite his cultivation not reaching the Mahayana Realm, he managed to create such a sacred place for cultivation, making it very difficult for others to create a second Sword Heaven Marsh.<br/><br/>It was not just Spiritual Refinement, but also the wonderful effect of stirring the Earth Spirit Qi.<br/><br/>According to Zhou Xue, the Spiritual Energy of this continent should be suppressed and sealed by the Immortal Gods of The Upper Realm, and it was unknown how Sword Saint created the Formation that could stir the Earth Spirit Qi.<br/><br/>Moreover, one wouldn’t notice this during regular cultivation; only by mastering a peerless Divine Skill like the Heavenly Dao True Skill could one draw on the Earth Spirit Qi.<br/><br/>In Biyou Island, one could not absorb so much Earth Spirit Qi, indicating its relation to the Heavenly Dao True Skill, but the Heavenly Dao True Skill was not the key.<br/><br/>Fang Wang just briefly pondered, quickly entering the Treasured Spirit Space with his consciousness.<br/><br/>He had always harbored an ambition, which was to understand the origins of the Heavenly Palace.<br/><br/>It wasn’t that he was wary of the Heavenly Palace; everything he had today was thanks to the Heavenly Palace. But the more powerful it was, the more curious he became.<br/><br/>He had a bold idea.<br/><br/>The seventh Lifespirit Treasure, to directly refine the Heavenly Palace itself!<br/><br/>This was a probe!<br/><br/>As soon as this thought emerged, Solaris True Fire and Heavenly Dao Qi Flame overflowed from his body, surging toward the top of his head.<br/><br/>When the outline of the Heavenly Palace appeared in the Treasured Spirit Space, it suddenly shattered. This also prevented the appearance of the Heavenly Palace’s shape above his head in reality.<br/><br/>As expected, it didn’t work!<br/><br/>However, at the moment the Heavenly Palace Lifespirit Treasure shattered, Fang Wang felt a faint, indescribable, and mysterious force.<br/><br/>Suddenly!<br/><br/>A light appeared from the darkness within the Treasured Spirit Space. Amidst the obscurity, Fang Wang saw the Heavenly Palace hidden within his body that he had been unable to find.<br/><br/>The doors of the Heavenly Palace opened, a stream of golden light emerged, penetrating the darkness and traveling to his Treasured Spirit Space.<br/><br/>This distance was peculiar, Fang Wang couldn’t make it out, yet he saw it happen.<br/><br/>Accompanying the arrival of the golden light in his Treasured Spirit Space, it quickly condensed, forming a piece of Golden Silk Ribbon.<br/><br/>At the same time, in reality, Solaris True Fire and Heavenly Dao Qi Flame swiftly surged toward the top of his head, continuously condensing to form the shape of a long ribbon.<br/><br/>Looking at the Golden Silk Ribbon, Fang Wang inexplicably felt a sense of familiarity, as if he had seen it somewhere before but couldn’t remember where.<br/><br/>Regardless, his probe was considered a success. Following the Heavenly Palace Halberd, the Heavenly Palace helped him refine another Lifespirit Treasure.<br/><br/>As the Golden Silk Ribbon became increasingly solid, Fang Wang gradually began to feel its power.<br/><br/>Outside.<br/><br/>Dugu Wenhun and Xiao Zi stood in front of the attic entrance, watching Fang Wang’s Spiritual Refinement from a close distance.<br/><br/>Zhao Zhen also floated out of the Soul Devouring Gourd, their eyes filled with emotion as they looked at the mysterious Lifespirit Treasure above Fang Wang’s head.<br/><br/>Solaris True Fire and Heavenly Dao Qi Flame above Fang Wang’s head grew larger and stronger, causing the new Lifespirit Treasure to grow larger and float towards the Firmament.<br/><br/>Thirty feet long!<br/><br/>Fifty feet long!<br/><br/>A hundred feet long!<br/><br/>The Lifespirit Treasure continued to grow, like a long ribbon violently fluttering. From a distance, amidst the Ling Wu, it resembled a True Dragon writhing, as if trying to break free from its shackles.<br/><br/>Before long, the Lifespirit Treasure had grown to a hundred feet tall!<br/><br/>Majestic and domineering!<br/><br/>Dugu Wenhun was wide-eyed and trembling, murmuring, “How is this possible… How can a Lifespirit Treasure be so vast upon its creation…”<br/><br/>Could it be…<br/><br/>He suddenly thought of something.<br/><br/>“Above the Heavenly Origin!”<br/><br/>Dugu Wenhun uttered four words, his face full of shock.<br/><br/>Xiao Zi curiously asked, “Above the Heavenly Origin? Are you talking about the rank of Lifespirit Treasures?”<br/><br/>Dugu Wenhun took a deep breath and said, “That’s right. It’s well known that Human Cultivator Lifespirit Treasures have Heavenly Origin as the highest innate rank before reaching the Nirvana Realm to breakthrough. But I’ve seen a record in a secret place, stating that there are sacred talents in this world born with Lifespirit Treasures above the Heavenly Origin… He has not yet reached the Nirvana Realm, so this Lifespirit Treasure naturally counts as an innate one…”<br/><br/>A Lifespirit Treasure with multiple lives!<br/><br/>And it could even surpass the Heavenly Origin!<br/><br/>Dugu Wenhun felt his entire worldview shattering.\t\t\t\t\t\t</div>", "images": {}, "success": true}