{"id": 208, "url": "https://www.novelhall.com/i-became-an-immortal-on-mortal-realm-32879/14492299.html", "title": "Chapter 208 - Chapter 208: Chapter 205: The Heavenly Dao Moves North, The Number One Person Under The Heavens", "volume": 3, "volume_title": "Volume 3", "body": "<h1>Chapter 208 - Chapter 208: Chapter 205: The Heavenly Dao Moves North, The Number One Person Under The Heavens</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 208: Chapter 205: The Heavenly Dao Moves North, The Number One Person Under the Heavens<br/><br/>Translator: 549690339<br/><br/>With Dugu Wenhun’s imposing presence enveloping the entire ancient city, demonic cultivators flew out one after another, resembling a swarm of bees leaving their nest. The spectacle was truly magnificent.<br/><br/>Fang Wang turned his head, looking at the demonic cultivator he subdued, and spoke softly, “Tell me, where is Wen Li, the Sect Master of Heaven’s Larceny Saint Sect?”<br/><br/>Before landing, he had gathered all the sounds of the city into his ears, aware that all the demonic cultivators here were from the Heaven’s Larceny Saint Sect.<br/><br/>The subdued demonic cultivator trembled as he spoke, “The Sect Master’s whereabouts… How could we possibly… know…”<br/><br/>A chill flashed through Fang Wang’s eyes.<br/><br/>At that moment, Dugu Wenhun landed on the city wall. His movement technique cast multiple afterimages as he darted among the demonic cultivators, each one’s acupoints precisely struck and immobilized. None of them could react throughout the process.<br/><br/>Dugu Wenhun stopped in front of an elderly demonic cultivator. He reached out with his right hand, grabbing the face of the cultivator, and suddenly extracted the soul from the body, which showed an expression of horror.<br/><br/>Before Dugu Wenhun could speak, the soul of the demonic cultivator dispersed on its own.<br/><br/>Dugu Wenhun frowned and continued attempting. Fang Wang used his Yin Yang Xuan Ming Zhen Gong to observe these souls, but could not discern anything, indicating that this curse was not weaker than the Yin Yang Xuan Ming Zhen Gong.<br/><br/>Only when all the souls of the demonic cultivators on the city wall had been forced to disperse did Dugu Wenhun stop. His gaze then turned to the demonic cultivators above the ancient city, his eyes ice-cold.<br/><br/>The moment they had flown out of the city, they were overwhelmed by his imposing presence, unable to move, only able to look at him with terror.<br/><br/>Fang Wang spoke, “Kill nine out of ten, let one go.”<br/><br/>Upon hearing this, Dugu Wenhun immediately took action, and the heavens and earth resounded with intermittent screams of agony. Blood rained down like a pour, falling toward the ancient city.<br/><br/>After a few moments, all was silent.<br/><br/>“Spread the word that I, Fang Wang, will exterminate the followers of the Heaven’s Larceny Saint Sect. Those who wish to live, leave the sect immediately, or ask your Sect Master to come to me,” Fang Wang’s voice followed, cold in tone.<br/><br/>After his words fell, Dugu Wenhun’s oppressive aura dissipated, and the surviving demonic cultivators scurried away in panic.<br/><br/>In the city, the doors of houses were flung open, and figures emerged, covered in wounds and filth—all in chains, men and women, old and young, mostly women. They dared to come out only upon hearing Fang Wang’s voice.<br/><br/>Fang Wang looked down and in a flash, sword shadows arose from the streets, swiftly severing the chains of the prisoners. This spectacle made Dugu Wenhun raise an eyebrow.<br/><br/>Could this be the Celestial Sword Intent of the Sword Saint?<br/><br/>More unrestrained than the Sword Intent of the Sword Saint back in the day.<br/><br/>Fang Wang said, “You are all cultivators. Rest here for a day before you leave. You may also help me spread the word that Fang Wang of the Grand Qi vows to annihilate Heaven’s Larceny Saint Sect.”<br/><br/>The horrific state of the people in the city clearly showed that they had suffered inhuman torture, but Fang Wang had no time for sympathy.<br/><br/>After saying this, he turned and left.<br/><br/>Dugu Wenhun hurriedly followed, equally indifferent to the fates of these people. In the Cultivation World, he had seen too much of such things.<br/><br/>“What’s next?” Xiao Zi turned to look at Fang Wang and asked.<br/><br/>Fang Wang, his eyes on the path ahead, said, “No need to search anymore, just start a massacre. Kill until Wen Li comes to me personally.”<br/><br/>His previous killing spree in the Emperor Sea was for revenge.<br/><br/>But this time, he was on a killing spree to save people!<br/><br/>With every action he took, he could save many lives. Why search blindly for Wen Li’s whereabouts?<br/><br/>Dugu Wenhun couldn’t help but look at Fang Wang, secretly amazed.<br/><br/>Fang Wang was usually kind and amiable, but at times like these, his killing intent was heavier than anyone else’s, leading Dugu Wenhun to wonder about his true nature.<br/><br/>No matter what kind of person Fang Wang was, Dugu Wenhun knew that Heaven’s Larceny Saint Sect’s catastrophe had arrived!<br/><br/>At noon, amidst the mountain ranges, gunpowder smoke lingered in the air. As far as the eye could see, there were bodies strewn everywhere, the ground pockmarked, and a piece of the forest dyed red from the blood, a shocking sight to behold.<br/><br/>Disciples from the Protecting Heaven Sect were meditating and healing their wounds everywhere, the atmosphere heavy.<br/><br/>Fang Jing and Fang Bai were meditating halfway up the mountain, facing the grand army of the Protecting Heaven Sect.<br/><br/>A scar from a burn marred Fang Bai’s forehead, the flesh blurred and unable to form a scab for a long time. Yet his face remained stern, as if he couldn’t feel the pain.<br/><br/>Fang Jing was doing better. Although his white attire was soaked in blood, he didn’t sustain many injuries. He was gazing down at the recuperating army of the Protecting Heaven Sect.<br/><br/>“How long will this war last? Why do the followers of Heaven’s Larceny Saint Sect keep increasing?” Fang Jing murmured despairingly.<br/><br/>Fang Bai, with his eyes closed, replied calmly, “The world is in turmoil, those in Cultivation pursue their own gain. Who would abandon their obsession with eternal life for the peace of the world, and how many can restrain their inner demons from running wild? As long as the Heaven’s Larceny Saint Sect is unthreatened, their numbers will only grow.”<br/><br/>Taking a deep breath, Fang Jing said, “It’s okay, wait till my eldest uncle makes a move.”<br/><br/>Fang Bai, who usually bickered with Fang Jing, didn’t retort. His admiration for Fang Wang was no less than Fang Jing’s because he had experienced the mystery of the Executioner Immortal Ghost God Sword. How could someone who mastered that swordsmanship not reign supreme and be invincible in the world?<br/><br/>Just then, a cultivator flew in from the horizon, speeding along while shouting loudly, “Tian Dao Fang Wang has headed north, vowing to exterminate the Heaven’s Larceny demons!”<br/><br/>He repeated these words continuously, causing more and more cultivators to open their eyes, including Fang Bai.<br/><br/>Fang Jing was momentarily stunned, not expecting his words to be so prophetic. Soon after, he stood up and laughed heartily.<br/><br/>Not just him, many people were getting excited.<br/><br/>The name Tian Dao Fang Wang is now known throughout the continent, recognized by everyone!<br/><br/>“It’s Fang Wang, he finally made his move!”<br/><br/>“I heard from Grand Qi cultivators before that Fang Wang was in seclusion to prepare for a life-and-death battle with the Sect Master of Heaven’s Larceny Saint Sect, Wen Li!”<br/><br/>“He’s finally come!”<br/><br/>“I wonder where he is now.”<br/><br/>“Fang Wang is the one who executed a Saint Venerate, after all. To date, the other four Saint Venerates still stand as untouchable existences for our Protecting Heaven Sect.”<br/><br/>There were at least three hundred thousand cultivators in this area alone, just a small part of the Protecting Heaven Sect. The sect’s influence spread over more than twenty dynasties to the north, with dozens of battlefields active every day. A hundred years ago, they could have swept across the land, but now they seem powerless against Heaven’s Larceny Saint Sect.<br/><br/>The Protecting Heaven Sect was rapidly expanding, and so was Heaven’s Larceny Saint Sect. However, because Heaven’s Larceny Saint Sect acted without any scruples and attracted more powerful individuals, their overall strength far surpassed that of the Protecting Heaven Sect, which recruited almost without any entry requirements as long as one was willing to oppose Heaven’s Larceny Saint Sect, so they were largely reliant on willpower and hatred for support.<br/><br/>Since the founding of the Protecting Heaven Sect, none of their battles could compare to the battle at Grand Qi, where Fang Wang had slain a Saint Venerate and a Saint Spirit, a feat still widely sung about today.<br/><br/>Fang Bai also stood up, a smile finally appearing on his stern face. He could clearly feel everyone’s morale soar, no longer as somber, as if hope had been sighted.<br/><br/>It wasn’t just here that people were talking; the news was spreading everywhere. Protecting Heaven Sect cultivators were spreading the news, as were demonic cultivators from Heaven’s Larceny Saint Sect, and even loose cultivators wanting to fish in troubled waters were talking, suggesting that a small spark could soon start a wildfire.<br/><br/>Two days later, more news came from Protecting Heaven Sect cultivators.<br/><br/>“Tian Dao Fang Wang has executed two Heavenly Monarchs of Heaven’s Larceny Saint Sect and slain three hundred thousand demons!”<br/><br/>Another day passed.<br/><br/>“Tian Dao Fang Wang has executed Liu Han, a true disciple of Heaven’s Larceny Saint Sect, and destroyed Heaven’s Larceny Saint Sect’s branch in Ming State!”<br/><br/>After that, almost every day, news would arrive, further exhilarating the injured cultivators of Protecting Heaven Sect.<br/><br/>In less than five days, they could no longer contain themselves and expressed a desire to follow Fang Wang into battle. The leading Great Cultivator of Protecting Heaven Sect agreed, as even he felt his blood boil listening to these battle reports.<br/><br/>In fact, the news was delayed. Fang Wang was slaying enemies faster than the news of his victories could spread.<br/><br/>Some thirty thousand li away, the grassland was stained with blood, the earth scarred as if bombarded by meteorites, with countless bodies falling, cries of anguish, weeping, and battle roars filling the air incessantly.<br/><br/>Black Sword Qi streaked across the sky, each sweep executing a swath of demonic cultivators, causing blood to rain down in torrents, a spectacular sight to behold.<br/><br/>Fang Wang stepped through the air, with Xiao Zi perched excitedly on his shoulder, eagerly watching ahead.<br/><br/>Following behind, Dugu Wenhun looked around in amazement. Nine ghostly divine swords floated around them, continuously swinging, while Fang Wang hadn’t even drawn the Rainbow Sword.<br/><br/>Above the plains, Protecting Heaven Sect cultivators were scattered about, some healing, some fighting. Whatever they were doing, when they saw Fang Wang and the nine ghostly divine swords, they were all excited and invigorated, their morale greatly boosted.<br/><br/>In contrast, members of Heaven’s Larceny Saint Sect were terrified, almost scared out of their wits, and didn’t dare to resist Fang Wang. They immediately turned and fled, but they were nowhere near as fast as the Zhu Xian Jing Hong Sword.<br/><br/>The nine ghostly divine swords swung in unison, with a systematic rhythm that was neither too fast nor too slow. The Sword Qi swept out in all directions, unstoppable.<br/><br/>At that moment, Fang Wang seemed to be driving away and toying with the demonic cultivators of Heaven’s Larceny Saint Sect, making all the Protecting Heaven Sect cultivators look up to him as though he were an Immortal.<br/><br/>“Is that Tian Dao Fang Wang?”<br/><br/>“So powerful… Can cultivation really achieve such strength?”<br/><br/>“Truly like an Immortal, his power alone surpasses all of us combined. What profound skill could he be using…”<br/><br/>“Before I heard that Fang Wang was heading north, I didn’t understand why people were excited. Now I understand… he truly is the number one person in the world!”<br/><br/>“The hope of victory has arrived!”<br/><br/>As Fang Wang walked towards the horizon, cheers erupted across the battlefield, wave upon wave.<br/><br/>Dugu Wenhun listened to the cheers and felt a subtle emotion stirring within him.<br/><br/>Born on the high seas, he had fought ceaselessly, but always for himself or for his sect’s missions. This was the first time he was fighting to save the lives of the common folk.<br/><br/>How should he describe this feeling…<br/><br/>Quite good, actually.<br/><br/>Dugu Wenhun looked towards Fang Wang’s retreating figure. He walked so casually, but his steps were so determined.<br/><br/>He couldn’t help but remind, “Aren’t you afraid that Wen Li might suddenly appear when you’re using up so much Spiritual Power?<br/><br/>Fang Wang didn’t even turn his head as he replied, “Using up? What’s there to use up?”<br/><br/>Upon hearing this, Dugu Wenhun paid closer attention and noticed the Heavenly Dao Imperial Dragon Crown on Fang Wang’s head. There were very slight fluctuations of Spiritual Power that were flowing into Fang Wang.<br/><br/>Could it be…<br/><br/>Dugu Wenhun’s expression changed, revealing a trace of fear.<br/><br/>It was not frightening to have a powerful enemy, but what was truly terrifying was an enemy who, while being powerful, also had an endless supply of Spiritual Power…\t\t\t\t\t\t</div>", "images": {}, "success": true}