{"id": 203, "url": "https://www.novelhall.com/i-became-an-immortal-on-mortal-realm-32879/14477880.html", "title": "Chapter 203 - Chapter 203: Chapter 200 Protecting Heaven Sect, The Peacock Flies North", "volume": 3, "volume_title": "Volume 3", "body": "<h1>Chapter 203 - Chapter 203: Chapter 200 Protecting Heaven Sect, The Peacock Flies North</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 203: Chapter 200 Protecting Heaven Sect, The Peacock Flies North<br/><br/>Translator: 549690339<br/><br/>Li Qingsong, his eyes closed, gritted his teeth and said, “We can ask for support from Dragon Mountain, but we must not leave. Heaven’s Larceny Saint Sect has nurtured so many cultivators to feed the souls of demons, and they’re killing mortals everywhere, stealing souls and spirits. If we leave, tens of thousands of people will die each day on this continent!”<br/><br/>After hearing this, Li Tianjue wanted to speak but hesitated.<br/><br/>Just the thought of the previous great battle made her shudder, but with her master so determined, she had to calm herself.<br/><br/>After a long silence, Li Tianjue spoke again, “Master, why don’t we form an alliance with the major sects on the continent? We could also ask Fang Wang for help. He has eradicated demons before, showing that he, too, is an enemy of Heaven’s Larceny Saint Sect.”<br/><br/>Li Qingsong opened his eyes, frowning in deep thought.<br/><br/>For a long time.<br/><br/>Li Qingsong sighed, “Forget it, you go. With your cultivation, you can’t help your teacher, but you have the power to protect yourself on this continent. It’s best to change your discipleship test to gaining experience in the mortal world. I’ll stay behind alone to confront Heaven’s Larceny Saint Sect.”<br/><br/>“Master, why put yourself through this? You simply…” Li Tianjue became anxious, but with the words on the tip of her tongue, she held back, not wishing to hurt her master’s pride.<br/><br/>Li Qingsong turned to look at her and said, “Your master is also aware of the gap between himself and the Hierarch of Heaven’s Larceny Sect. Dragon Mountain has the duty to save the world and lives. Rest assured, I will not be reckless and will focus on saving lives instead of confronting the Hierarch of Heaven’s Larceny Sect.”<br/><br/>“But…’<br/><br/>“Tianjue, this world is about to face a great change. I’ve long said that you were born in the wrong era. Your temperament will be your downfall. Rather than facing greater setbacks later, you should take this opportunity to train here.” Li Qingsong sighed, causing Li Tianjue great distress.<br/><br/>“After some time, when your spiritual power has recovered, you will set off. As for how to proceed, it will be up to you. Your master won’t interfere, and this time, you can do as you please.”<br/><br/>With that, Li Qingsong closed his eyes, and a black aura slowly emerged from his brow, his face showing a pained expression.<br/><br/>Li Tianjue ultimately did not have the courage to say she would stay.<br/><br/>She simply did not want to face the Hierarch of Heaven’s Larceny Sect or the terrifying demons ever again.<br/><br/>The world’s situation had become unpredictable due to Heaven’s Larceny Saint Sect, and rebellions had appeared in every kingdom on the continent, some wanting to overthrow the control of Heaven’s Larceny Saint Sect, others enraged by their kingdom’s cowardice, yearning to rise up.<br/><br/>The most peaceful place was Grand Qi, as it was the only territory on the continent that had made Heaven’s Larceny Saint Sect suffer a loss.<br/><br/>Fang Wang, entrusted with the hopes of Grand Qi, remained in Sword Heaven Marsh, focusing on his cultivation.<br/><br/>Time flew by.<br/><br/>Five years passed swiftly, and at the end of this year, as winter snow arrived, Fang Wang advanced to the eighth level of the Golden Body Realm amidst the vast snowflakes.<br/><br/>A handsome young man approached him from behind, who was none other than Fang Jing.<br/><br/>The grown Fang Jing greatly resembled his father, Fang Xun, but with an even more outstanding aura, exuding a carefree and unrestrained demeanor.<br/><br/>Fang Jing, looking at his great-uncle’s silhouette, had eyes filled with fervor. Fang Wang’s every breakthrough would release a powerful aura, which allowed everyone within Sword Heaven Marsh to discern when he was advancing.<br/><br/>Breaking through a minor realm every three to four years, especially at higher levels, even Dugu Wenhun couldn’t help but marvel.<br/><br/>“Great Uncle, the family has sent a message. A sect called Protecting Heaven Sect has emerged in the north, with the intention of opposing Heaven’s Larceny Saint Sect. The major kingdoms’ sects are all supporting it one after another. Jin Xiao Sect and Great Abyss Gate have sent disciples to join, and our ancestor has ordered our family to join. He says that when the world shared difficulty, the men of the Fang Family cannot hide in a corner enjoying comfort. He also ordered me and Fang Bai to return to train.”<br/><br/>Fang Jing said excitedly.<br/><br/>Fang Wang opened his eyes and asked, “Did the family mention where you will be sent to support?”<br/><br/>Fang Jing laughed, “Great Uncle, rest assured, with our level of cultivation, how can we oppose Heaven’s Larceny Saint Sect? At most, we’ll deal with those demon heretics who misbehave under the banner of Heaven’s Larceny Saint Sect. ”<br/><br/>Fang Wang thought for a moment and said, “Then go. Indeed, the path of cultivation is not just about arduous practice, but remember one thing…”<br/><br/>“Ah, I know, I won’t fall for any girl,” Fang Jing quickly interjected, sounding rather helpless.<br/><br/>Fang Wang, with his back to Fang Jing, grunted, “It’s not that you shouldn’t fall for someone. It’s to wait until you’re strong enough, then you can.”<br/><br/>“I understand, just like you and Aunt Zhou Xue, with just a marriage certificate.”<br/><br/>“Hmph, go now. Remember, you and Fang Bai need to support each other and try not to separate.”<br/><br/>“Haha, don’t worry! I’m off!” Fang Jing cheered, then leaped into the sky, heading towards the distant forest.<br/><br/>Fang Wang turned and muttered to himself, “Unbelievable, this kid’s grown so tall. ”<br/><br/>Though he had spent two thousand years in the Heavenly Palace, it was a solitary existence. Watching a junior grow before his eyes evoked a different sentiment in him.<br/><br/>At that moment, Xiao Zi climbed onto his shoulder and teased, “What’s the matter? My lord, can’t bear to part with him?”<br/><br/>Fang Wang replied, “Not exactly, but I am indeed a bit worried.”<br/><br/>After all, Fang Jing was a child he had saved from a mountain of corpses and a<br/><br/>sea of blood. In his heart, Fang Wang had come to treat Fang Jing as his own son.<br/><br/>“My lord, the name of Wen Li, the Hierarch of Heaven’s Larceny Sect, has even reached Sword Heaven Marsh. The influence of Heaven’s Larceny Saint Sect truly is formidable,” Xiao Zi remarked with a sigh.<br/><br/>Although Sword Heaven Marsh was sealed off, cultivators often passed by, and Song Jinyuan, out of a sense of chivalry, would let them stay a night. Through the comings and goings of these cultivators, they also kept abreast of the world’s affairs.<br/><br/>More and more people were heading southward, wishing to sail away from the calamities brought by Heaven’s Larceny Saint Sect.<br/><br/>Fang Wang did not reply but closed his eyes again.<br/><br/>“The people of this world have hailed Wen Li, the Hierarch of Heaven’s Larceny Sect, as the number one Great Cultivator. My lord, when you’re ready to confront him, be sure to take me with you. I want to see for myself what this number one Great Cultivator looks like. There are rumors he has three eyes, though I wonder if that’s true,” Xiao Zi prattled on.<br/><br/>Fang Wang did not stop it, although he remained silent, he was actually listening intently.<br/><br/>Xiao Zi knew Fang Wang’s attitude and, seeing that he did not scold her, she spoke more and more vigorously.<br/><br/>On that day, Fang Jing and Fang Bai left Sword Heaven Marsh.<br/><br/>It wasn’t just them leaving, Song Jinyuan also led a group of Sword Servants northward, and he had inherited the chivalry of the Sword Saint too.<br/><br/>Sword Heaven Marsh became much more desolate.<br/><br/>Nevertheless, Fang Wang didn’t care and continued his cultivation.<br/><br/>He had already reached the eighth layer of the Golden Body Realm, and in a few more years, he hoped to achieve the Mahayana Realm.<br/><br/>By then, his strength would undergo a tremendous improvement.<br/><br/>The snowfall this year lasted longer than usual, as if symbolizing the hearts of the people in the world.<br/><br/>As winter left and spring arrived, Sword Heaven Marsh welcomed the vibrant spring scenery.<br/><br/>The ice on the lake surface had melted, but the fog was still thick, different from before, now it was a Spiritual Energy fog rising from the ground.<br/><br/>On this day.<br/><br/>Fang Wang, who was meditating at the end of the bridge, opened his eyes and looked up at the mountain top opposite.<br/><br/>Ever since the sudden visit of Li Qingsong and his apprentice, he had kept an extra vigilant eye out while cultivating.<br/><br/>He sensed a strong aura speeding over from the ocean to the south.<br/><br/>Inscrutable!<br/><br/>If Li Qingsong’s aura was nearly ethereal, then this powerful aura was pure strength, and it was the first time Fang Wang had ever felt such a presence.<br/><br/>He did not stand up, as the other party might not have come for him since he did not sense any divine sense or killing intent.<br/><br/>Dugu Wenhun came to stand behind Fang Wang, his expression grave, looking towards the mountain top across from them.<br/><br/>Chu Yin also walked out from the house, his many years of secluded cultivation made him even more composed, his whole body exuded a Mount Tai-like presence, as if not even a collapsing sky could crush his shoulders. “Such a vast cultivation aura… is this Demonic Qi?”<br/><br/>Chu Yin mumbled to himself. As he usually practiced Qi Gathering, his perception of Spiritual Power and demonic power became sharper. He deduced that an extremely terrifying monster was flying towards them.<br/><br/>He was not panicked at all because his master was nearby.<br/><br/>Soon, under the watchful eyes of Fang Wang and Dugu Wenhun, a giant figure suddenly appeared on the mountain top opposite, showing the head of a peacock that was even larger than the entire mountaintop.<br/><br/>The peacock’s head feathers were gold and blue, with strands of gold that seemed like mysterious patterns imprinted on its body. Its eyes were black with a pair of golden pupils, within which seemingly housed two bright suns.<br/><br/>Just the exposed head was at least hundreds of Zhang high!<br/><br/>In front of this peacock head, everything else seemed insignificant, even the vast sky didn’t seem so lofty.<br/><br/>The Peacock Saint King!<br/><br/>Fang Wang immediately thought of the strongest being in the Emperor Sea mentioned by The Three Immortals of the Emperor Sea.<br/><br/>The enormous peacock’s gaze fell on Fang Wang as if it wanted to see through him.<br/><br/>The next second, the giant peacock leaped up, and in an instant, the sky and earth darkened, everyone in Sword Heaven Marsh who looked up was stunned with wide eyes.<br/><br/>They saw an immensely large peacock flying over the sky of Sword Heaven Marsh, its form resembling that of a human, but its body characteristics were entirely that of a peacock without any sign of transformation, which was quite strange.<br/><br/>Its body was covered with golden feathers, like a surging sea of fire sweeping across the Firmament.<br/><br/>Soon, the giant peacock disappeared into the horizon, heading north.<br/><br/>Dugu Wenhun took a deep breath, saying with emotion, “First the Descending Dragon Mountain, and now this creature, matters are becoming increasingly serious.”<br/><br/>Fang Wang shifted his gaze away and closed his eyes, saying, “It’s not our business; continue cultivating. You too, should hasten your practice, try to break through to the Nirvana Realm soon, and don’t let me surpass you.” On hearing this, Dugu Wenhun nodded.<br/><br/>Although he was far from Fang Wang’s strength, he did not want to see Fang<br/><br/>Wang making consecutive breakthroughs while his own realm remained stagnant, for he was one of the Southern Celestial Four Heroes, representing the highest talent of the Southern Celestial Sea.<br/><br/>Dugu Wenhun turned to leave, but the image of the peacock’s majestic figure still lingered in his mind.<br/><br/>Having lived for over four hundred years, it was the first time he had encountered such a divine and majestic beast, which could even be described as a divine beast; it lacked the demonic air of monsters, possessing only the divine presence of the strong.<br/><br/>No sooner had Dugu Wenhun returned to his house than The Three Immortals of the Emperor Sea appeared behind Fang Wang.<br/><br/>“The Peacock Saint King has come!”<br/><br/>“I didn’t expect Heaven’s Larceny Saint Sect to have provoked him; Master, let’s head north!”<br/><br/>“Now that the world is in chaos, it’s clear that Heaven’s Larceny Saint Sect has no intention against Grand Qi, so why don’t we exorcise Demons? If we take action, we could at least save tens of millions of people.”<br/><br/>The Three Immortals of the Emperor Sea said unanimously, excited after seeing the figure of the Peacock Saint King, having traveled thousands of li from Southern Hills City and flown to Sword Heaven Marsh.<br/><br/>Fang Wang, thinking that his grandfather Fang Meng had sent people north, indeed had no reason to keep The Three Immortals of the Emperor Sea with the Fang Family, so he nodded. Seeing this, The Three Immortals of the Emperor Sea immediately vanished on the spot..\t\t\t\t\t\t</div>", "images": {}, "success": true}