{"id": 205, "url": "https://www.novelhall.com/i-became-an-immortal-on-mortal-realm-32879/14491192.html", "title": "Chapter 205 - Chapter 205: Chapter 202 The Visage Of An Immortal", "volume": 3, "volume_title": "Volume 3", "body": "<h1>Chapter 205 - Chapter 205: Chapter 202 The Visage Of An Immortal</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 205: Chapter 202 The Visage of an Immortal<br/><br/>Translator: 549690339<br/><br/>“Brother Fang, how can your Divine Nurturing Sword Qi be so…”<br/><br/>Gu Tianxiong was so excited that he didn’t know how to describe it, Fang Wang’s Divine Nurturing Sword Qi was incredibly fast, and its sharpness was beyond his imagination.<br/><br/>What’s more important was Fang Wang’s control over the Divine Nurturing Sword Qi, which was not easy to manipulate. Being able to accurately kill enemies was already commendable, after all, to kill the enemy, the Sword Qi must be fast, and speed made it very difficult to control.<br/><br/>At least he couldn’t make his Divine Nurturing Sword Qi circle around a person at such speed without harming them.<br/><br/>Fang Wang smiled and said, “I can give you some guidance. Would you like to learn?”<br/><br/>As he spoke, the Divine Nurturing Sword Qi drilled into his eyes.<br/><br/>Divine Nurturing Sword Qi required time to accumulate, so he seldom used it in combat. However, with his rate of Qi Gathering, the strength of his Divine<br/><br/>Nurturing Sword Qi was increasing at a pace unmatched by anyone in the Gu Family.<br/><br/>“Of course, I want to learn, but won’t it disturb your cultivation?” Gu Tianxiong hesitated.<br/><br/>He knew why Fang Wang was in seclusion here.<br/><br/>To deal with the Heaven’s Larceny Saint Sect!<br/><br/>With Fang Wang’s current abilities, he certainly had the qualifications to influence the world. If Gu Tianxiong’s interference caused Fang Wang to emerge later, how many innocent lives would be lost?<br/><br/>Fang Wang smiled and said, “Haste does not bring success. I’ve been preparing for a breakthrough lately, and what I need is enlightenment on the state of mind. Teaching you might bring me some good insights.”<br/><br/>He then turned his head and said, “Miss Gu, why not come out and listen? This Divine Nurturing Sword Qi was given to me by you, after all. It’s time I repaid you.”<br/><br/>Hearing this, Gu Tianxiong was stunned for a moment, then turned his head with a look of expectation on his face.<br/><br/>Over the years, whether in Southern Hills City or at Sword Heaven Marsh, Gu Li had not sought to see Fang Wang. Gu Tianxiong clearly understood his daughter’s thoughts. In his opinion, if there were genuine feelings, they should interact more. Over time, Fang Wang was very likely to forget her.<br/><br/>Gu Tianxiong was confident in his daughter’s appearance and talents, but that also depended on the comparison. With Fang Wang now famous across the ocean, he must have met many proud daughters of heaven.<br/><br/>He couldn’t even begin to imagine the kind of romantic involvement someone like Fang Wang, a favored child of heaven, would have around him. The mere thought made him envious.<br/><br/>Clang!<br/><br/>The door opened, and Gu Li, dressed in blue, walked out. She was not wearing a veil, her makeup was delicate, and in terms of appearance and demeanor, she was definitely a woman who could make one’s eyes light up.<br/><br/>She walked up to Fang Wang and spoke softly, “It’s been a long time.”<br/><br/>Looking at Fang Wang, she appeared calm, but both Fang Wang and Gu Tianxiong could feel her nervousness.<br/><br/>Fang Wang smiled and said, “After many years, Miss Gu seems to have become estranged from me. What about our agreement to have a challenge?”<br/><br/>At his words, Gu Li, for some reason, immediately relaxed quite a bit and hummed softly, “I would like to, but how can I catch up to your realm?”<br/><br/>Fang Wang blinked and said, “How about I use the power of the Ninth Level of<br/><br/>Profound Heart Realm to compete with you? Although you have reached the First Layer of Spirit Condensation Realm, the nature of my Spiritual Power is there.”<br/><br/>Upon hearing this, Gu Li immediately said, “Okay, I want to see how strong a<br/><br/>Real Person of the Heavenly Dao is.”<br/><br/>Gu Tianxiong stood by, watching with a smile. Gu Li had found an opportunity at Canglan Academy and had become the person with the highest cultivation in the Gu Family, the pride of the Gu Family. He also wanted to see how powerful his daughter was.<br/><br/>Of course, he didn’t think Gu Li could win, but her opponent was Fang Wang, who would surely not hurt his own daughter.<br/><br/>Like that.<br/><br/>A stick of incense later.<br/><br/>Gu Li, who was kneeling by the lake, wiped the blood from the corner of her mouth. With one hand covering her abdomen and a pained expression on her face, she couldn’t even lift her sword with her right hand.<br/><br/>“Brother Fang! You…”<br/><br/>Gu Tianxiong stomped anxiously, wanting to get angry, but afraid that Fang Wang had other intentions.<br/><br/>Fang Wang ignored Gu Tianxiong, staring at Gu Li, and said, “Absolute speed is absolute power. If your Divine Nurturing Sword Qi and your Sword Intent are fast enough, you too can possess such power.”<br/><br/>Gu Li tried to stand up, but after taking a punch from Fang Wang, she felt her internal organs churn. She forced a smile and said through gritted teeth, “As long as it’s fast enough, I can be like you?”<br/><br/>Being defeated by Fang Wang with a single punch, she wasn’t angry but rather joyful because she could feel Fang Wang’s sincerity.<br/><br/>When Fang Wang struck her, it seemed like a kind of Sword Intent surged from his eyes, reaching hers. She couldn’t specify what it was, but she felt some change within her.<br/><br/>Fang Wang smiled and said, “The difference between strength and weakness is always temporary. Who can tell the future? Perhaps one day you will become the number one female cultivator in the world.”<br/><br/>Why the number one in the world?<br/><br/>Because that one was about to ascend.<br/><br/>Fang Wang didn’t truly think highly of Gu Li; he just wanted to encourage her.<br/><br/>But his words indeed provided Gu Li with unprecedented motivation.<br/><br/>Gu Li staggered to her feet and, looking at Fang Wang, said, “Don’t lie to me. I’ll take it seriously. From now on, becoming stronger will be my top priority.”<br/><br/>Fang Wang waved to her and said, “I’ll be waiting for your next challenge.”<br/><br/>Gu Tianxiong looked at them and couldn’t shake the feeling that things were developing in an odd direction.<br/><br/>The sky was tilled witn crimson glow and the remnants ot clouds were like patches, stretching to the horizon with no end in sight.<br/><br/>Under the vault of heaven, there lay an endless wasteland. At this moment, the land was covered with seated figures, all human cultivators, men and women alike, both young monks and aged Taoists. They all sat facing the same direction, arranged in rows and columns, their number impossible to count — a spectacular sea of people.<br/><br/>Looking past this human sea towards the direction they faced, a few hundred li away, atop a precipice, stood three figures, two men and a woman – none other than Li Tianjue of the Descending Dragon Mountain.<br/><br/>The man at the forefront wore a robe of white embroidered with blue, his posture gallant, his face handsome. His long hair was coiled under a silver crown, adorned with a fiery red pearl, from which flames seemed to surge. His wide sleeves and the waterfall-like hem of his robe fluttered in the wind, displaying his natural nobility.<br/><br/>The man beside him seemed less remarkable, garbed in deep purple brocade clothes, his face bearing scars that added a chilling air to his demeanor.<br/><br/>“Tianjue, now that my Protecting Heaven Sect commands such a vast influence, with your All-Encompassing Breath Technique to gather fate, we shall surely be able to eradicate the demon Wen Li!” the blue-robed man declared with a triumphant smile, as if he held the whole world in his hands.<br/><br/>He was Shen Buhui, Lord of the Protecting Heaven Church.<br/><br/>Li Tianjue shook her head slightly and said, “It’s still not enough. Though we have many people, their fate is not strong. Even if you succeed, you may not be a match for my master, let alone Wen Li.”<br/><br/>At these words, Shen Buhui turned to look at her, frowning with inquiry, “Is<br/><br/>Wen Li truly that fearsome?”<br/><br/>Recalling the battle from years past, Li Tianjue shuddered involuntarily, took a deep breath, and said, “He is not only powerful himself, but also commands the Demonic Soul. We must not underestimate him. Since you’re the Lord of the<br/><br/>Protecting Heaven Church, if you encounter him, he will surely try to kill you.”<br/><br/>“If that’s the case, why not invite your master to join the Protecting Heaven Sect? If I can harness his fate, we might stand a chance against Wen Li, ” Shen Buhui suggested with a frown.<br/><br/>Li Tianjue replied with a wry smile, “The All-Encompassing Breath Technique of Descending Dragon Mountain can only accumulate the fate of those who are unaware of the technique. Otherwise, the clash of fate would be against the<br/><br/>Heavenly Dao.”<br/><br/>Shen Buhui’s brow furrowed deeper.<br/><br/>Li Tianjue seemed to remember something and spoke thoughtfully, “If you could persuade Fang Wang to join, his fate would surely help you. His fate might even surpass that of my master.”<br/><br/>Shen Buhui’s brows relaxed as he asked, “Fang Wang of Grand Qi?”<br/><br/>Li Tianjue nodded with a smile.<br/><br/>Shen Buhui revealed a smile and said, “Easy; I have two trusted juniors under me who are members of the Fang Family. I’ll have them plead on my behalf.<br/><br/>After all, I’m merely borrowing fate, not stripping away cultivation.”<br/><br/>Li Tianjue cautioned him, “True, the All-Encompassing Breath Technique only borrows fate, but long and frequent use can harm one’s lifespan. You must be cautious in its use.”<br/><br/>Shen Buhui, with a sweep of his sleeve and a spirited, forthright tone, said, “Now, with catastrophe upon us, even if Shen Buhui perishes from the depletion of fate, I would not shy away, so long as I can destroy Heaven’s Larceny Saint Sect. Never mind my lifespan, even my life itself is not too great a price to pay!”<br/><br/>With these words, Li Tianjue’s gaze towards him grew more nuanced.<br/><br/>The man beside them showed an even greater look of admiration.<br/><br/>Shen Buhui then turned to Li Tianjue, gazing at her tenderly, and softly said,<br/><br/>“My life was saved by you. I should have died under the venomous grasp of<br/><br/>Saint Hong. If I survive this disaster, my life will be yours.”<br/><br/>“I don’t need your life.”<br/><br/>“Haha, that might be an exaggeration, but my feelings for you…” “I’ve told you before, my heart belongs only to my senior brother.”<br/><br/>“You say your senior brother is so formidable. You’ve even sought help from<br/><br/>Descending Dragon Mountain, so why hasn’t he come? Is he afraid of Heaven’s<br/><br/>Larceny Saint Sect, or does he not care for you?”<br/><br/>“He’s merely preoccupied with seclusion, unaware of this affair. My senior brother is destined to become a Great Saint. In time, when he succeeds, not even Wen Li will compare.”<br/><br/>Li Tianjue said solemnly, thinking of someone else when she uttered these words. Fang Wang. Her master said her senior brother couldn’t compare to Fang Wang, something she couldn’t accept at heart.<br/><br/>Especially over these many years, as the continent’s living beings suffer disasters and the land bears the scars of war, why hasn’t Fang Wang stepped forward? This is his homeland, after all.<br/><br/>If her senior brother knew of such calamities, he would indeed come!<br/><br/>Observing Li Tianjue’s conviction, Shen Buhui shook his head with a smile, his gaze drifting into the distance as he murmured, “I hope to meet your senior brother one day, to see for myself his immortal stature.”<br/><br/>For him, the annihilation of Heaven’s Larceny Saint Sect far outweighed any romantic matters!<br/><br/>Li Tianjue, too, looked into the distance, where the impressive sea of people seemed insignificant in her eyes. Strong as the Protecting Heaven Sect was, she felt it was not enough.<br/><br/>Sword Heaven Marsh.<br/><br/>Two years had passed since he advised Gu Li and Gu Tianxiong that day.<br/><br/>During those two years, Fang Wang meditated at the head of the bridge, contemplating the Mahayana realm.<br/><br/>And at last, on this day, he found the opportunity for a breakthrough!<br/><br/>Fang Wang suddenly opened his eyes, as wisp upon wisp of white flame kindled upon his body, rapidly growing in strength.<br/><br/>“So this is the realm of Mahayana, ” he said to himself.<br/><br/>Fang Wang stood up and began to circulate his cultivation; spiritual energy from heaven and earth furiously converged onto him.<br/><br/>In this instant, everyone within Sword Heaven Marsh could feel his vast presence, as if the Heavenly Dao itself had descended, its divine might vast and boundless..\t\t\t\t\t\t</div>", "images": {}, "success": true}