{"id": 200, "url": "https://www.novelhall.com/i-became-an-immortal-on-mortal-realm-32879/14456470.html", "title": "Chapter 200 - Chapter 200: Chapter 197: Sect Hierarch Of Heaven I S", "volume": 2, "volume_title": "Volume 2", "body": "<h1>Chapter 200 - Chapter 200: Chapter 197: Sect Hierarch Of Heaven I S</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 200: Chapter 197: Sect Hierarch of Heaven I s<br/><br/>Larceny, Disaster Descends from the Sky<br/><br/>Translator: 549690339<br/><br/>The day after the Heaven’s Larceny Saint Sect’s attack, the clamor about the sect within Southern Hills City was yet to subside. Fang Wang rose early, taking Xiao Zi, Chu Yin, Dugu Wenhun, Fang Jing, and Fang Bai with him to Sword Heaven Marsh.<br/><br/>Qu Xunhun, Zhu Yan, and The Three Immortals of the Emperor Sea stayed behind at the Fang Family residence to guard against the Heaven’s Larceny Saint Sect’s invasion.<br/><br/>Within half an hour, they arrived at Sword Heaven Marsh.<br/><br/>Compared to several decades ago, Sword Heaven Marsh was much quieter. Song Jinyuan was still there, comprehending the Celestial Sword Intent.<br/><br/>He was meditating by the lakeside and, seeming to sense something, he opened his eyes and saw several figures in the sky. He immediately stood up.<br/><br/>Fang Wang, Chu Yin, Dugu Wenhun, Fang Jing, and Fang Bai stood under the scorching sun, their outlines mysterious. Xiao Zi even more so, circling like a dragon, exuding an overwhelming presence.<br/><br/>“Brother, it’s been a long time.”<br/><br/>Fang Wang’s voice suddenly drifted down, startling Song Jinyuan into a closer look. As soon as he clearly recognized Fang Wang, a look of joy spread across his face.<br/><br/>“Fang Wang! ”<br/><br/>Fang Wang and his party descended, and after many years, Song Jinyuan excitedly grasped Fang Wang’s wrist, chiding him for not coming to see him when he returned to the continent.<br/><br/>It turns out that news of Fang Wang’s return had spread through Grand Qi long ago, and in the past two years, the occasional sword cultivator had come hoping to encounter Fang Wang.<br/><br/>Old friends reunited naturally had much to discuss, so Xiao Zi led the others away, not wishing to disturb them.<br/><br/>Dugu Wenhun walked alone by the lake, his heart marvelling, “What a splendid geomantic layout, with the marvelous aspect of a dragon engulfing heaven and earth. The Sword Saint is indeed extraordinary.”<br/><br/>In his youth, he had seen the Sword Saint, whose talent was mediocre, but who possessed a sword intent that transcended his own realm. Moreover, the Sword Saint’s conviction not to kill left a deep impression on him.<br/><br/>On the way here, he had heard that Fang Wang had inherited the Sword Saint’s legacy, piquing his interest in Sword Heaven Marsh.<br/><br/>Song Jinyuan sat by the lake with Fang Wang, inquiring about his experiences out at sea, to which Fang Wang tersely replied.<br/><br/>Upon learning that Fang Wang had become a Heavenly Dao True Person of the Eternal Life Pavilion, Song Jinyuan was shocked.<br/><br/>He knew Fang Wang was divinely talented, but how many years had it been?<br/><br/>He had surpassed the Sword Saint’s two or three hundred years of effort!<br/><br/>The gap between the Sword Sovereign of the Yellow Glyph and the twenty-four True Persons was immense; to him, the True Persons were legends, mythical figures of the sea’s Cultivation World, and he had never imagined his junior brother would achieve the rank of Heavenly Dao True Person.<br/><br/>After a long conversation, Fang Wang finally revealed his purpose. He had come to cultivate in seclusion here to face the threat of the Heaven’s Larceny Saint Sect.<br/><br/>Song Jinyuan was delighted, offering to drive the sword cultivators of Sword Heaven Marsh away so no one would disturb him.<br/><br/>And so, Fang Wang sat down at the wooden bridge where he often meditated, facing the lake, using Qi Gathering Meditation.<br/><br/>However.<br/><br/>As Fang Wang activated the Heavenly Dao True Skill, the winds and clouds in the heavens changed color, and the spiritual energy within Sword Heaven Marsh surged crazily towards him. The lake surface even whipped up a spiritual energy fog visible to the naked eye, swirling towards Fang Wang like a tornado.<br/><br/>Song Jinyuan, who hadn’t left, turned his head to see the spiritual energy vortex above Fang Wang’s head and widened his eyes in amazement.<br/><br/>What kind of cultivation technique is this?<br/><br/>Song Jinyuan considered himself worldly, but he had never seen anyone practice Qi Gathering with such spectacle.<br/><br/>He watched for quite some time before finally leaving.<br/><br/>The Sword Servants of Sword Heaven Marsh, upon hearing that Fang Wang had returned, were all incredibly exhilarated. Even just by watching the spiritual energy vortex caused by him from a distance, they felt an indescribable excitement. Unknowingly, Fang Wang’s image in their hearts had surpassed the former Sword Saint.<br/><br/>Fang Bai was born with an extraordinary talent for the Sword Dao. Under Xiao Zits introduction, Song Jinyuan began teaching Fang Bai swordsmanship.<br/><br/>At that moment, Song Jinyuan did not realize just how frightening Fang Bai’s comprehension of the Sword Dao was.<br/><br/>In a wide and gloomy great hall, a female cultivator dressed in blue paced swiftly forward, her head bowed and her frame trembling.<br/><br/>After walking ten miles through the great hall, she reached the end of the hall, knelt before a flight of stone steps, pressed her forehead to the ground, and said with a quivering voice, “Reporting to the Sect Hierarch… Chang Shengzun, along with the Saint Spirit, headed south to capture Fang Wang, the number one cultivator of Grand Qi, and the entire army… has been wiped out… The Saint Spirit has also been slain by Fang Wang…”<br/><br/>As her words fell, the great hall went silent, devoid of any sound.<br/><br/>The blue-clad female cultivator knelt on the ground, not daring to lift her head, barely even breathing.<br/><br/>After a long while.<br/><br/>“So it’s destroyed, what are you afraid of?”<br/><br/>A dispassionate voice came from atop the stone steps, causing the female cultivator in blue to shiver as if she were in a cold cellar, trembling even more fiercely.<br/><br/>“Lift your head. You are one of the seventy-two Heavenly Monarchs of the Heaven’s Larceny Saint Sect. Such cowardice is unseemly,” the cool voice rang out again, prompting the female cultivator in blue to hurriedly look up.<br/><br/>Atop the stone steps, there was a huge ice bed emitting wisps of cold air, and in the center of the ice bed sat a figure meditating.<br/><br/>It was a disheveled man dressed in black, his robe embroidered with exquisite runes and a ring of fur around the collar, fluttering without wind. His chest was bared, and on it, a massive, horrifying vertical eye, larger than his head, with a pupil that moved.<br/><br/>The man slowly raised his head, his black hair spread out like a cascading waterfall. Untied, yet it did not seem disheveled; instead, there was an indescribable beauty to it. An attractive yet indifferent face was revealed, his pupils devoid of life, and on his brow stuck a red cicada.<br/><br/>Sect Master of Heaven’s Larceny Saint Sect!<br/><br/>Gazing down at the female cultivator in green below, he said indifferently, “This seat suddenly recalls, what assurance did you give when you borrowed the Saint Spirit from this seat?”<br/><br/>From behind him in the darkness, several shadows flickered for an instant, like evil spirits hiding in the shadows.<br/><br/>The female cultivator in green spoke with trepidation, “Sect Master, it was Fang Wang who was too strong. The Saint Spirit we resurrected possessed the power to sweep through the Nirvana Realm, but in front of Fang Wang…”<br/><br/>The Sect Master of Heaven’s Larceny Sect narrowed his eyes and said, “Oh? So this matter is not your fault?”<br/><br/>“Please punish us, Sect Master!”<br/><br/>The female cultivator in green suddenly kowtowed fiercely, and fresh blood quickly spread beneath her head.<br/><br/>The Sect Master of Heaven’s Larceny Sect continued to ask, “Are you the only one who returned alive?”<br/><br/>“Among the Heavenly Monarchs, only I have come back. Some disciples have defected, including Ji Rutian…”<br/><br/>The female cultivator in green replied cautiously, her voice trembling.<br/><br/>“Ji Rutian, huh? I didn’t expect him to reveal himself so soon. It seems that junior called Fang Wang is indeed formidable. Tell me, what exactly happened?”<br/><br/>Hearing the words of the Sect Master of Heaven’s Larceny Sect, the female cultivator in green hastily recounted the previous great battle.<br/><br/>After a long time,<br/><br/>The hall fell into silence once again.<br/><br/>The Sect Master of Heaven’s Larceny Sect spoke somberly, “1 did not expect the Executioner Immortal Ghost God Sword to reappear in the Mortal Realm.<br/><br/>Indeed, what a good fortune, your defeat is not wrongful.”<br/><br/>Upon hearing this, the female cultivator in green breathed a sigh of relief. She subconsciously looked up, her eyes suddenly widening, as she saw a giant red cicada hovering in front of her, its mouth full of sharp spikes, slightly writhing.<br/><br/>Her body instantly stiffened, cold sweat pouring down like rain across her pretty face.<br/><br/>“Although not wrongful, I’m still somewhat displeased. You might as well die.”<br/><br/>No sooner had the voice of the Sect Master of Heaven’s Larceny Sect sounded than the female cultivator in green tried to turn and flee, but before she could move, the red cicada fiercely bit down on her head, blood spurting out, as the cicada began to chew.<br/><br/>The only noise left in the hall was the sound of the red cicada chewing, casting an eerie silence.<br/><br/>The Sect Master of Heaven’s Larceny Sect closed his eyes once again, and as he did, several ghostly shadows with fangs bared emerged behind him, as if ready to devour him.<br/><br/>“Fang Wang… calling himself the Heavenly Dao, interesting. It seems my grand plan is coming to fruition.”<br/><br/>The voice of the Sect Master of Heaven’s Larceny Sect echoed in the hall, accompanied by a series of chilling laughter.<br/><br/>Three years later, within Sword Heaven Marsh.<br/><br/>Fang Wang successfully broke through to the sixth level of the Golden Body Realm, and during these three years, Heaven’s Larceny Saint Sect had not invaded Grand Qi again.<br/><br/>More cultivators came to Sword Heaven Marsh, but they were all stopped by the Sword Servants. At first, some tried to force their way through, until Dugu Wenhun unleashed his own aura, scaring the cultivators away like startled birds.<br/><br/>During these three years, Fang Jing and Fang Bai successively achieved Spiritual Refinement; Fang Jing condensed a Great Halberd, this youngster even managed to condense a Lower Grade Heavenly Origin Precious Spirit—truly, the fortune bestowed upon Fang Xun by Zhou Xue was destiny altering.<br/><br/>Fang Bai condensed a sword, a Superior-Tier Earthly Origin Precious Spirit, also considered a genius.<br/><br/>What made Fang Bai stand out even more was his Sword Dao aptitude. Within three years, he had learned all the swordsmanship of the sword cultivators in Sword Heaven Marsh. Of course, it was just the basics—unable to unleash the true power of these sword techniques mainly due to his insufficient cultivation level.<br/><br/>Additionally, Fang Bai had a preliminary understanding of Celestial Sword Intent, which greatly stimulated Song Jinyuan.<br/><br/>In just three years, Fang Bai’s comprehension of Celestial Sword Intent surpassed decades of Song Jinyuan’s day- to-day comprehensions—his Dao Heart almost collapsed.<br/><br/>Fang Jing and Fang Bai had grown up. Both their appearances and physiques could be described as handsome and striking; they didn’t let Fang Wang down.<br/><br/>That day, Fang Wang had consolidated his cultivation level and was ready to continue training.<br/><br/>The Spiritual Energy in Grand Qi was far inferior to that of the seas, but he found that as he began to consume Spiritual Energy voraciously, vast Spiritual Energy started to emerge from beneath Sword Heaven Marsh.<br/><br/>It seems that Sword Saint’s choice of this place was meaningful!<br/><br/>The Earth Spirit Qi from the bottom of Sword Heaven Marsh could keep up with Fang Wang’s pace of Qi Gathering!<br/><br/>This made Fang Wang interested in the land beneath this continent, but what he needed to focus on now was cultivation; other matters would have to wait.<br/><br/>“Are you Tian Dao Fang Wang?”<br/><br/>A voice echoed in the mountains of Sword Heaven Marsh.<br/><br/>Fang Wang opened his eyes to look, locking onto two figures on a distant mountaintop. To his surprise, he had not noticed their approach.<br/><br/>“With the emergence of Demons, the Heavenly Dao retreats. Master, we should hurry on our journey,” another voice spoke, seemingly that of a woman..\t\t\t\t\t\t</div>", "images": {}, "success": true}