{"id": 201, "url": "https://www.novelhall.com/i-became-an-immortal-on-mortal-realm-32879/14456472.html", "title": "Chapter 201 - Chapter 201: Chapter 198: Descending Dragon Mountain, Great Saint Fate [Seeking Monthly Pass]", "volume": 3, "volume_title": "Volume 3", "body": "<h1>Chapter 201 - Chapter 201: Chapter 198: Descending Dragon Mountain, Great Saint Fate [Seeking Monthly Pass]</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 201: Chapter 198: Descending Dragon Mountain, Great Saint Fate [Seeking Monthly Pass]<br/><br/>Translator: 549690339<br/><br/>Fang Wang fixed his gaze and saw a man and a woman standing atop the mountain peak. The man seemed to be in his forties or fifties, dressed in a deep blue Dao robe, holding a horsetail whisk, with two wooden swords on his back. His face was stern, his eyes like an eagle’s, locked onto Fang Wang.<br/><br/>The woman beside him looked to be just over twenty, with a fair appearance, wearing a form-fitting Dao robe that exuded the air of a martial heroine.<br/><br/>Dugu Wenhun immediately appeared beside Fang Wang, furrowing his brows, and whispered, “He actually came.”<br/><br/>Fang Wang did not rise; instead, he asked, “May I know the names of you two?”<br/><br/>His voice also echoed across the expanse of Sword Heaven Marsh, startling all the Sword Servants. Song Jinyuan, Fang Jing, Fang Bai, Chu Yin, and others stepped on their swords and flew to midair, poised and ready for confrontation.<br/><br/>Xiao Zi came to stand behind Fang Wang, warily watching the two figures perched atop the distant peak.<br/><br/>“I am from Descending Dragon Mountain, named Li Qingsong, and she is my disciple, Li Tianjue.”<br/><br/>The Dao-clad man spoke, and these were names Fang Wang had not heard before.<br/><br/>Dugu Wenhun transmitted his voice, “Descending Dragon Mountain comes from the eastern seas, a sacred place with tens of thousands of years of heritage. Legend has it that in ancient times, a True Dragon rampaged through the Mortal Realm, and an Immortal subdued the True Dragon. To prevent such a calamity from arising again, he took a few village children as disciples on a mountain. After a hundred years of tutelage, the Immortal left, and those village children established Descending Dragon Mountain. The Descending Dragon Great Saint once cultivated at Descending Dragon Mountain and is its most outstanding disciple. He took pride in this as well.”<br/><br/>So there really is a connection with the Descending Dragon Great Saint.<br/><br/>Fang Wang stood up and asked, “May I know why you have come?”<br/><br/>Li Qingsong looked down at Fang Wang and said, “Demons have been born on this continent, the divine providence concealed. My disciple and I have come specifically to subdue these demons. On our way, we heard that you were here, so we took the opportunity to see for ourselves. After all, the commotion you’ve caused in the Emperor Sea is no small matter.”<br/><br/>Li Tianjue followed with, “I advise you not to use the name of the Heavenly Dao lightly. The Heavenly Dao is not something to be fabricated; it truly exists. Be careful not to incur its wrath.”<br/><br/>Hearing this, Fang Wang couldn’t clearly grasp Lee Qingsong’s attitude.<br/><br/>Was it really just a chance encounter?<br/><br/>Dugu Wenhun said, “The affairs of the Emperor Sea, if you two have inquired, you would Imow began with the Xuan Dynasty.”<br/><br/>Li Qingsong calmly said, “I have no connection with the Emperor Sea. I simply wish to advise you to refrain from killing, not to exploit great cultivation to act recklessly. On the road to becoming a Saint, a Saint’s heart is very important. I see a Saintly aspect in you, and I hope you will not go astray.”<br/><br/>Xiao Zi listened with displeasure, yet could also tell that there was something extraordinary about these two individuals, and could only swallow his anger for the time being.<br/><br/>Fang Wang remained silent, focusing on sensing Li Qingsong’s cultivation level.<br/><br/>The cultivation techniques of these two were very peculiar, completely devoid of any aura.<br/><br/>Suddenly!<br/><br/>Li Qingsong appeared in front of Fang Wang out of nowhere and struck towards Fang Wang with a palm.<br/><br/>This time, with preparation, Fang Wang’s eyes sharpened, a powerful burst of Yang Energy erupted, blocking Li Qingsong’s palm. Xiao Zi was directly blown away by the Yang Energy, and Dugu Wenhun also retreated explosively.<br/><br/>The wooden bridge turned to dust, and the lake surface collapsed. Fortunately, both individuals directed their Spiritual Power at each other and did not cause too much destruction to Sword Heaven Marsh.<br/><br/>Li Qingsong retracted his palm and slowly backed away. He hovered above the lake surface, his Dao robe billowing, hair dancing in the wind, looking very much like an Immortal who could ascend to heaven at any moment.<br/><br/>“You carry the aroma of the Heavenly Gang Saint Body Technique but your constitution is another type of supreme Yang body. This is indeed a great fortune. I wonder, how are you related to the Descending Dragon Great Saint?” asked Li Qingsong.<br/><br/>Li Tianjue on the mountain peak squinted her eyes, looking at Fang Wang with surprise.<br/><br/>She didn’t expect Fang Wang to block her master’s palm.<br/><br/>Fang Wang, with his usual composure, replied, “There is a secret realm of the<br/><br/>Descending Dragon Great Saint on this land, where I learned the Heavenly<br/><br/>Gang Saint Body Technique.”<br/><br/>Upon hearing this, Li Qingsong remarked, “So it is. In that case, you also have a connection with Descending Dragon Mountain. My disciple is a descendant of the Descending Dragon Great Saint.”<br/><br/>“Since there is such a cause and effect, I shall not trouble you further. After my disciple and I subdue the demon, we will come to visit you.”<br/><br/>With that, Li Qingsong turned to leave.<br/><br/>“Wait!”<br/><br/>Fang Wang suddenly called out to Li Qingsong.<br/><br/>Li Qingsong turned his head back to look at Fang Wang, his pupils suddenly shrinking. Fang Wang had already reached behind him, eyes intensely cold, swinging a fist toward him.<br/><br/>Boom!<br/><br/>Li Qingsong was sent flying through the sky by Fang Wang’s punch, piercing through layers of clouds, ascending three thousand feet before stabilizing his form.<br/><br/>“Master!”<br/><br/>Li Tianjue cried out in alarm, turning her head to look at Fang Wang, her right hand holding out a bronze mirror, with its light shimmering in preparation for Fang Wang’s actions.<br/><br/>Fang Wang floated above the lake, slowly retracting his fist. The distant Sword Servants were all shocked as they looked towards him.<br/><br/>That punch, which seemed not to hit them, made them inexplicably feel on the verge of annihilation.<br/><br/>Dugu Wenhun intently looked at Fang Wang’s silhouette, secretly astounded. What shocked him was Fang Wang’s control of power. That punch could have turned the surrounding thousand miles to ruins, yet it didn’t.<br/><br/>Li Qingsong descended from the heavens, stopping a hundred feet above the lake. His right hand held the horsetail whisk and his left hand was placed behind his waist, his brows furrowed as he asked, “What do you mean by this?”<br/><br/>Fang Wang replied, “You gave me a palm, I gave you a punch. An eye for an eye. When you come again another day, I shall receive you with proper hospitality.” Li Qingsong seemed stronger than The Three Immortals of the Emperor Sea!<br/><br/>But the gap was not huge!<br/><br/>The moment Fang Wang struck Li Qingsong, his aura leaked out, and from that surge of energy, if he gave it his all, he might be able to kill Li Qingsong.<br/><br/>Li Qingsong looked deeply at Fang Wang and said, ‘Well, my apologies, your talent indeed qualifies you to enter the Descending Dragon Mountain. When I return, I will explain in detail.”<br/><br/>“Tianjue, let’s go.”<br/><br/>Having said that, Li Qingsong flew towards the north, and Li Tianjue quickly followed, glancing back at Fang Wang as if she wanted to memorize his face.<br/><br/>Only after the master and disciple duo had departed did Xiao Zi turn to Dugu<br/><br/>Wenhun and ask, “Hey, do you know them?”<br/><br/>Dugu Wenhun took a deep breath and said, “Two hundred years ago, after I failed at the Emperor’s Tomb Island, I sought opportunities everywhere to make myself stronger. Thus, I went to the East Immortal Sea. Luckily, at a Daoist site, I had the fortune to meet Li Qjngsong. He is a real person of Descending Dragon Mountain, with profound and inscrutable cultivation. He holds a revered position in the East Immortal Sea. Unlike the Eternal Life Pavilion or the Xuan Dynasty, they do not concern themselves with worldly affairs. The cultivators there only study the Dao within the mountain and have long held the reputation of Immortal Mountain Gates.”<br/><br/>He looked at Fang Wang with a complicated gaze.<br/><br/>Fang Wang had given Li Qingsong a punch, and Li Qingsong actually endured it.<br/><br/>What did this imply?<br/><br/>Meanwhile, Fang Wang pondered the heavenly secrets and the Heavenly Dao discussed by master and disciple Li Qingsong.<br/><br/>The first time he used the Zhu Xian Jing Hong Sword against the Saint Spirit, it didn’t cause any celestial phenomena; could it be related to the Saint Spirit?<br/><br/>It seemed that the two from Li Qingsong were headed for the Heaven’s Larceny Saint Sect; he would let them test the depths of that sect.<br/><br/>Fang Wang turned and flew to the lakeside, ready to continue cultivating.<br/><br/>The sixth layer of the Golden Body Realm wasn’t enough!<br/><br/>However, before that, he needed to build a new bridge.<br/><br/>The Sword Servants, meanwhile, were all abuzz, curious about the origins of Descending Dragon Mountain.<br/><br/>Elsewhere.<br/><br/>After flying a hundred miles, Li Tianjue couldn’t help but ask, “Master, that person dared to attack you, yet you weren’t angry. Could it be because he has received the inheritance of our ancestor?”<br/><br/>Li Qingsong shook his head and moved his left hand from behind his waist to the front for Li Tianjue to see.<br/><br/>Li Tianjue saw his left hand shaking uncontrollably, which made her concerned.<br/><br/>Li Qingsong took a deep breath and said, “Such a domineering Mountain River Town Heaven Fist, with its destructive force echoing in the palm of my hand. I could only suppress it with my cultivation, unable to completely eliminate the punch’s force in a short time. Such a technique with destructive power could be controlled so freely, precisely focused on my left palm alone; his mastery of Mountain River Town Heaven Fist surpasses everyone from Descending Dragon Mountain and the Descending Dragon Saint Clan.”<br/><br/>“How is that possible…” Li Tianjue was stunned.<br/><br/>Li Qingsong said with a sigh, “What my senior brother spoke of, the era of great contention, is indeed upon us. When we return, we must pay a proper visit to Fang Wang. I have a premonition that the name Fang Wang will echo throughout the Mortal Realm.”<br/><br/>Li Tianjue, regaining her senses, asked, “How does he compare to my senior brother?” Her tone was somewhat anxious.<br/><br/>“Your senior brother is not his equal. Let’s see how his fate unfolds. It’s best not to provoke him. Since ancient times, those who become Great Saints once their fate emerges, become unstoppable unless your senior brother can also carve out a Great Saint’s fate.”<br/><br/>Li Qingsong said with a sigh, his tone full of satisfaction.<br/><br/>Although he had lost face in front of Fang Wang, fortunately, this young man had made a good connection with Descending Dragon Mountain.<br/><br/>Li Tianjue fell silent, still somewhat incredulous.<br/><br/>To her, her senior brother had always been a child of heaven, radiant and dazzling.<br/><br/>But recalling the previous encounter with Fang Wang, she had to admit there was something remarkably charismatic about him, perhaps what her master referred to as the Grand Saint’s fate?<br/><br/>“Let’s proceed to our demon subduing mission. This also serves as your test for completing your apprenticeship,” Li Qingsong’s words broke Li Tianjue’s reverie, and the master and disciple continued to fly north.<br/><br/>At a lake within Sword Heaven Marsh, Fang Jing proudly looked at Fang Bai and laughed, “See? My uncle’s fist is very strong, even stronger than swordsmanship.”<br/><br/>The grown-up Fang Jing exuded a dashing and unrestrained air of a knight-errant, while Fang Bai, true to his sword training, was enveloped in a swordsman’s chilliness.<br/><br/>Hearing Fang Jing’s words, Fang Bai snorted coldly, “Ancestor Fang’s fist technique is naturally strong, but his most formidable skill is surely swordsmanship. You don’t understand; you can’t see through the mysteries of his swordsmanship.”<br/><br/>Fang Wang was three generations older than Fang Bai, so Fang Bai usually addressed him as Ancestor Fang, a title that was also endorsed by the Fang Residence elders. They believed they would eventually pass away, and only Fang Wang had the potential for eternal life, even immortality. They also hoped that the relationship between Fang Wang and the Fang Family would continue, so that if the family faced difficulty in the future, they could ask this venerable ancestor for help.<br/><br/>Fang Jing laughed and beckoned to Fang Bai, saying, “This time I won’t use my Lifespirit Treasure; let’s have a match with our fists, shall we?”<br/><br/>Upon hearing this, Fang Bai turned and walked away.<br/><br/>Although Fang Jing hadn’t mastered Mountain River Town Heaven Fist, the power contained within his fists was terrible, beyond what Fang Bai could contend with.<br/><br/>Fang Bai had full confidence in his understanding of swordsmanship and believed that given time, he would surpass Fang Jing, but for now, he needed to avoid his edge.<br/><br/>From a distance, inside a pavilion,<br/><br/>Fang Wang sat at a table, starting to drink tea. The wooden bridge had been destroyed, and Song Jinyuan was calling people to rebuild it, requiring him to wait for half an hour, which was a good opportunity for him to rest.<br/><br/>Suddenly, the Jade Bracelet on Fang Wang’s left hand emitted a bright light, from which a spiritual consciousness fluctuated. His mind stirred as he sent his own spiritual consciousness into it.<br/><br/>The next second, his consciousness arrived in an illusory space. The space changed color and quickly transformed into the likeness of Fang Residence. He was standing in the courtyard.<br/><br/>Zhou Xue walked up a small path, her smile beaming toward Fang Wang, “Was that the aura of Li Qingsong from Descending Dragon Mountain just now? I didn’t expect you to have crossed hands with him..”\t\t\t\t\t\t</div>", "images": {}, "success": true}