{"id": 207, "url": "https://www.novelhall.com/i-became-an-immortal-on-mortal-realm-32879/14491528.html", "title": "Chapter 207 - Chapter 207: Chapter 204: Heaven Bound Golden Silk, Heaven’S Larceny Mysterious Technique", "volume": 3, "volume_title": "Volume 3", "body": "<h1>Chapter 207 - Chapter 207: Chapter 204: Heaven Bound Golden Silk, Heaven’S Larceny Mysterious Technique</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 207: Chapter 204: Heaven Bound Golden Silk, Heaven’s Larceny Mysterious Technique<br/><br/>Translator: 549690339<br/><br/>After the Golden Silk had formed, this Spiritual Refinement was considered a success, and what Fang Wang needed to do next was consolidate his cultivation.<br/><br/>As the thunderclouds in the sky dissipated, Fang Wang still stood at the head of the bridge, eyes closed, consolidating his cultivation. The new Lifespirit Treasure above his head had grown to a thousand feet tall, making it impossible for the Ling Wu of Sword Heaven Marsh to shroud it. In the wind, it twisted violently, resembling a living dragon, and not just any dragon, but a radiant Golden Dragon!<br/><br/>Those who had awoken from the Celestial Sword Intent were quickly drawn to the sight of the thousand-foot Golden Silk.<br/><br/>“What is that?”<br/><br/>“Is it a Magical Artifact? Or some kind of Spell manifestation?”<br/><br/>“Wait, it seems to be hovering above Senior Fang Wang’s head…”<br/><br/>“Look closely, isn’t that a scene of Spiritual Refinement?”<br/><br/>“What realm is Senior Fang at, that he is only now undergoing Spiritual Refinement?”<br/><br/>The Cultivators discussed animatedly, some amazed, some puzzled, until someone brought up the notion of multiple Lifespirit Treasures, causing an even greater uproar.<br/><br/>Gu Li and Gu Tianxiong stood by the lake, equally dazzled by the thousand-foot Golden Silk.<br/><br/>“With such talent, and to have multiple Lifespirit Treasures…” Gu Tianxiong murmured, his tone complex.<br/><br/>Facing the mysterious thousand-foot Golden Silk, anyone would feel as if they were looking up at the traces of an Immortal.<br/><br/>Gu Li’s eyes were filled with wonder, but instead of envy, she felt happy and excited for Fang Wang. With such a Lifespirit Treasure following his breakthrough, he would surely have a better chance in the fight against Heaven’s Larceny Saint Sect.<br/><br/>All of Grand Qi knew that Fang Wang was bound to head north. Given all his past achievements, he had never feared powerful enemies and peril. Now, retreating into Sword Heaven Marsh was a clear sign he was preparing for a decisive battle.<br/><br/>If he wished to avoid conflict, he could simply have gone south, away from Grand Qi.<br/><br/>At the same time.<br/><br/>Outside Sword Heaven Marsh, a Cultivator flew in on his sword, noticing the thousand-foot Golden Silk at the edge of the sky.<br/><br/>The Golden Silk peered out from around the peaks surrounding Sword Heaven Marsh. Though only partially visible, the golden light it emitted was incredibly eye-catching.<br/><br/>“What’s that…” the Cultivator marveled, his eyes wide as he murmured to himself.<br/><br/>He was a member of the Protecting Heaven Sect, named Wu Lin, sent by Shen Buhui to extend an invitation to Fang Wang.<br/><br/>He slowed his pace, cautiously flying towards Sword Heaven Marsh.<br/><br/>Elsewhere.<br/><br/>Fang Wang was deeply immersed in his own breakthrough, oblivious to the outside world. This state persisted for a full seven days and nights.<br/><br/>When he opened his eyes, his soaring cultivation began to stabilize, and he looked up to see the two-thousand-foot Golden Silk above his head, his gaze steady.<br/><br/>“Let’s call it the Heaven Bound Golden Silk,”<br/><br/>Fang Wang muttered to himself, setting the name for this Lifespirit Treasure. In an instant, the Heaven Bound Golden Silk burst into a dazzling golden light, illuminating the entire world. Every citizen and Spirit Demon across Grand Qi saw a flash in the sky.<br/><br/>The Heaven Bound Golden Silk swiftly burrowed back inside Fang Wang, disappearing from sight.<br/><br/>The seventh Lifespirit Treasure was completed!<br/><br/>Like the Heavenly Palace Halberd, it was created by the Heavenly Palace and contained special powers. Fang Wang was very much looking forward to its performance.<br/><br/>He twisted his neck, turning around to walk towards the pavilion.<br/><br/>Xiao Zi, Dugu Wenhun, and Song Jinyuan immediately approached to greet him, with Zhao Zhen following, his face full of reverence.<br/><br/>Fang Wang caught Xiao Zi who rushed towards him, stroked the snake’s head, and asked, “How old am I this year?”<br/><br/>Xiao Zi looked up at him, blinking her snake eyes, and said, “Master, you are one hundred and sixty-seven years old.”<br/><br/>Dugu Wenhun’s eyelids twitched uncontrollably. He knew Fang Wang was young, but hearing his actual age still sent a shock through him.<br/><br/>It’s just not fair!<br/><br/>Fang Wang looked at Dugu Wenhun and inquired, “Throughout history, has there been a Mahayana Cultivator at one hundred and sixty-seven years old?”<br/><br/>Dugu Wenhun responded with a bitter smile, “As far as I know, no, and even if there were, they couldn’t compare to you. While your realm is at the Mahayana, your actual strength already surpasses the Nirvana Realm.”<br/><br/>To describe a genius like Fang Wang was beyond him.<br/><br/>Fang Wang smiled and then instructed, “We’ll rest for a day, and head north tomorrow to vanquish demons and execute Wen Li!”<br/><br/>To vanquish demons and execute Wen Li!<br/><br/>He didn’t say these words with high-pitched intensity, but they were infused with self-assurance.<br/><br/>Only he knew the changes that the breakthrough in the Mahayana Realm brought him, which could truly be described as a complete transformation!<br/><br/>He was fully confident in dealing with Wen Li! After all, Li Qingsong had fought Wen Li many times over the years and had not been directly executed, proving that, although Wen Li was powerful, he was not yet strong enough to easily crush Li Qingsong.<br/><br/>And Fang Wang believed he could.<br/><br/>“Great!”<br/><br/>Xiao Zi immediately became excited, and Dugu Wenhun showed a look of anticipation.<br/><br/>Seizing the opportunity, Song Jinyuan mentioned, “Fang Wang, someone from the Protecting Heaven Sect has come looking for you. They want to invite you to join their sect. They said Fang Jing and Fang Bai have already joined. The Protecting Heaven Sect is only temporary, and once Heaven’s Larceny Saint Sect has been destroyed, it will disband and not bind anyone. Do you want to meet him?”<br/><br/>If it had been someone else, he would have declined on behalf of Fang Wang immediately, but since it concerned the Protecting Heaven Sect, he felt it was necessary to mention it.<br/><br/>Upon hearing the names Fang Jing and Fang Bai, Fang Wang immediately nodded, “Let him come.”<br/><br/>“Now?”<br/><br/>“Hmm.”<br/><br/>Fang Wang nodded and leaped up, landing on the roof, stretching languidly as he basked in the sunlight.<br/><br/>Song Jinyuan immediately went to call the visitor.<br/><br/>Soon, Wu Lin from the Protecting Heaven Sect arrived. He stood in front of the pavilion, gazing up at Fang Wang on the rooftop.<br/><br/>Fang Wang, clad in a white robe, stood there like an Immortal from the Heavenly Palace descending to the Mortal Realm. The Heavenly Dao Imperial Dragon Crown on his head held two streams of Spiritual Energy, and his white robe fluttered slightly, exuding an otherworldly charm. Wu Lin had never seen such an extraordinary man.<br/><br/>“Why has my young master been invited to join the Protecting Heaven Sect? Once he joins, what will be expected of him?”<br/><br/>Xiao Zi lay on Fang Wang’s shoulder, speaking up to ask.<br/><br/>Admiringly, Wu Lin thought to himself that it was truly fitting for the Grand Qi Sword Saint that even the snake on his shoulder was out of the ordinary.<br/><br/>Wu Lin immediately clasped his fists in response, conveying Shen Buhui’s instructions and explaining the functions of the Mass Qi Technique from Mount Descending Dragon.<br/><br/>Upon hearing that the Sect Hierarch of the Protecting Heaven Sect wished to borrow Fang Wang’s fate, Dugu Wenhun laughed, while Song Jinyuan frowned.<br/><br/>Zhao Zhen said with a chuckle, “Gathering fate to confront Heaven’s Larceny Saint Sect, even though the fate will be returned, doesn’t this mean that your Sect Hierarch is not entirely confident about dealing with Heaven’s Larceny Saint Sect, is that right?”<br/><br/>Wu Lin hesitated before speaking, “Heaven’s Larceny Sect runs rampant across the land, and Wen Li, the old demon, is unrivaled. Who could be absolutely certain?”<br/><br/>“My young master is!”<br/><br/>Xiao Zi glared at Wu Lin, clearly annoyed.<br/><br/>Fang Wang softly laughed and said, “It’s alright, he’s not to blame; he’s just the messenger. Go back and tell your Sect Hierarch that I won’t be joining your sect. I plan to go directly to Heaven’s Larceny Saint Sect and eradicate Wen Li. Perhaps by the time you return to the Protecting Heaven Sect, Wen Li will already have fallen.”<br/><br/>Wu Lin was taken aback.<br/><br/>“By the way, do you know where the lair of Heaven’s Larceny Saint Sect is?” Fang Wang suddenly remembered to ask.<br/><br/>Wu Lin shook his head and replied, “The movements of Heaven’s Larceny Saint Sect are mysterious. Although there are strongholds throughout the north, no one knows where their main base is. A senior once attempted to search souls, but the result was that the cultivator was struck by a lethal curse cast by a Grand Saint of their sect and died on the spot.”<br/><br/>Upon hearing this, Fang Wang smiled and waved his hand, indicating that Wu Lin could leave.<br/><br/>Song Jinyuan immediately dragged him away with a face as dark as thunder.<br/><br/>It was no wonder this young man insisted on speaking to Fang Wang face to face—so this was his scheme.<br/><br/>Wu Lin wanted to resist, but his cultivation was weaker than Song Jinyuan’s, and moreover, with Fang Wang present, he did not dare act rashly.<br/><br/>An hour later, Fang Wang located Gu Tianxiong and Gu Li, had a chat with them, and explained his intentions.<br/><br/>The father-daughter duo wanted to follow Fang Wang northward, but he declined because his target was the lair of Heaven’s Larceny Saint Sect.<br/><br/>That day, news of Fang Wang’s journey northward spread far and wide.<br/><br/>Early the next morning, Fang Wang took Xiao Zi and flew north. Dugu Wenhun followed closely behind, while Chu Yin was left at Sword Heaven Marsh to continue his cultivation.<br/><br/>This time, Fang Wang did not use Xiao Zi as his mount because her speed was not as fast as his.<br/><br/>Dugu Wenhun followed behind Fang Wang, quietly reflecting, “So decisive and efficient—as befitting a name derived from the Heavenly Dao.”<br/><br/>He felt that Fang Wang was concerned for the well-being of all living beings and did not wish to waste time, which increased his admiration for Fang Wang.<br/><br/>There are countless powerful beings in the world, but few with a great sense of justice. Although Sword Saint is not the most powerful, the mere fact that he has left a lasting impression demonstrates the loftiness of his character.<br/><br/>Previously he felt pity for the Sword Saint—if the Sword Saint had possessed supreme talent, it would have been a blessing for the world, bringing forth another Immortal on earth.<br/><br/>Now, it seems, Fang Wang is the Sword Saint with such supreme talent.<br/><br/>Of course, he wasn’t as stubborn as the Sword Saint.<br/><br/>Dugu Wenhun had his reservations about the stance on not killing. Some people deserved to be killed; eliminating them was actually a blessing for all beings.<br/><br/>In a spacious and dimly lit hall, Wen Li, the Sect Hierarch of Heaven’s Larceny Sect, sat cross-legged on an ice bed, constantly channeling his powers with his hands enveloped in Demonic Qi. A giant eye on his chest twisted and turned relentlessly, creating a disturbing sight.<br/><br/>The shadows behind him continued to flicker with mysterious ghostly figures, enormous and chilling, constantly shifting shape. One moment they resembled people running past, the next they looked like beasts stampeding through.<br/><br/>“Your heart is restless; what are you afraid of?”<br/><br/>A cold voice echoed, indistinguishable between male or female.<br/><br/>With his eyes closed, Wen Li said, “The situation has escalated beyond my control, decades ahead of the original plan. It seems as though some variable is affecting me from the shadows.”<br/><br/>“Oh? Who do you think it is? Is it Li Qingsong from Mount Descending Dragon, or the Peacock Saint King who threatened you before, or could it be Fang Wang—the only blemish of Heaven’s Larceny Saint Sect?”<br/><br/>“I’m not sure, but my unease is growing stronger.”<br/><br/>“So you’re taking a risk?”<br/><br/>“The countless bones beneath my feet will not allow me to fail. Whichever the variable might be, as the one who usurps the heavens, I can surely turn the variable into a constant!”<br/><br/>“The Heaven’s Larceny Mysterious Technique brings fortune and disaster; it must be used with caution.”<br/><br/>Wen Li stopped responding, his hands kept shifting through gestures, and the surging Demonic Qi seemed to grow more violent.<br/><br/>The hall fell into silence once again.<br/><br/>Dusk descended, and the sky was suffused with a red glow.<br/><br/>A streak of white light sped forth, and not long after, another figure followed closely behind—it was Fang Wang and Dugu Wenhun.<br/><br/>They had flown over dozens of dynasties and traversed countless miles. Along the way, whenever Fang Wang encountered civilians harmed by Demonic Cultivators, he would intervene. As for conflicts between cultivators that did not bear the flag of Heaven’s Larceny Saint Sect, he rarely interfered.<br/><br/>In the mountain forest ahead lay an ancient city with Demonic Cultivators stationed on its walls.<br/><br/>Within thousands of miles, nearly all cultivators were Demonic Cultivators. Since Fang Wang did not know the exact location of Heaven’s Larceny Saint Sect, he headed towards where the Demonic Cultivators converged.<br/><br/>Atop the city wall, a Demonic Cultivator suddenly noticed something in the sky. He was just about to speak out when a gust of wind roared in, startling all the Demonic Cultivators on the wall, causing them to raise their arms to shield their faces.<br/><br/>The first to notice the unusual phenomenon, this Demonic Cultivator was rendered stiff, his face covered in cold sweat, his pupils dilated. He saw a hand resting on his shoulder, immobilizing him.<br/><br/>The other Demonic Cultivators lowered their arms and took a clear look, spotting Fang Wang’s figure, prompting them to immediately ready their Lifespirit Treasures for battle.<br/><br/>“If you wish to die, then make your move!”<br/><br/>Xiao Zi, perched on Fang Wang’s shoulder, spoke with a cold smirk, while the assembly of Demonic Cultivators looked at the purple snake on his shoulder with bizarre expressions.<br/><br/>Then, Dugu Wenhun flew in, his presence unconcealed. The pressure of being in the Ninth Layer of the Mahayana Realm gave the Demonic Cultivators a sense of dread as if facing a cataclysm.\t\t\t\t\t\t</div>", "images": {}, "success": true}