{"id": 216, "url": "https://www.novelhall.com/i-became-an-immortal-on-mortal-realm-32879/14498108.html", "title": "Chapter 216 - Chapter 216: Chapter 213: The Number One Cultivation Technique Of All Time, Taixuan Shenxiao Scripture", "volume": 3, "volume_title": "Volume 3", "body": "<h1>Chapter 216 - Chapter 216: Chapter 213: The Number One Cultivation Technique Of All Time, Taixuan Shenxiao Scripture</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 216: Chapter 213: The Number One Cultivation Technique of All Time, Taixuan Shenxiao Scripture<br/><br/>Translator: 549690339<br/><br/>Grand Wei, Zhui Tian Secret Realm.<br/><br/>On the vast lakeshore, Fang Wang and the white-haired elder were sitting meditating on the grass, with Xiao Zi playing in the lake, while Zhao Zhen hovered nearby, his gaze fixed on the white-haired elder.<br/><br/>“I witnessed your battle with the Thousand Eyes Great Saint, and it was fearsome for someone so young,”<br/><br/>the white-haired elder said, his tone full of emotion.<br/><br/>It had only been so many years, yet Fang Wang had grown so strong.<br/><br/>Fang Wang smiled and asked, “Should I address you as the Descending Dragon Great Saint?”<br/><br/>Having returned, armed with the knowledge of the Heavenly Dao True Skill, Fang Wang sensed the aura of the Heavenly Gang Saint Body Technique within the white-haired elder.<br/><br/>The white-haired elder was not surprised but instead retorted, “Shouldn’t it be ‘master’?”<br/><br/>Immediately, Fang Wang clasped his fists, nodded, and said, “Master, please accept your disciple’s respect.”<br/><br/>The Descending Dragon Great Saint couldn’t help but stroke his beard and laugh heartily, contently saying, “Good, neither arrogant nor rash. Merely acknowledging me as your master will sooner or later save you once.”<br/><br/>“Then I hope that day never comes,” Fang Wang laughed and said.<br/><br/>Despite his invincibility in battle, it was only true for this continent and the two nearby seas. The Mortal Realm was vast, and above the vast sky, Immortal Gods existed. Defeating the Thousand Eyes Great Saint would not lead him to underestimate the Great Saints.<br/><br/>Regardless, the Heavenly Dao True Skill, which originated from the Three Great True Cultivations, was the capital that allowed Fang Wang to dominate the world. This master, the Descending Dragon Great Saint, was truly deserving of the title!<br/><br/>Not just the Descending Dragon Great Saint, but any senior who passed on their skills to him—as long as they were not his enemy—he would always remember the favor.<br/><br/>“Today I am here to impart the Heavenly Dao True Skill to master,” Fang Wang said casually, turning to look at the Descending Dragon Great Saint.<br/><br/>The Descending Dragon Great Saint asked, “Heavenly Dao True Skill? What is that?”<br/><br/>Fang Wang replied, “It’s my creation, based on your Three Great True Cultivations.”<br/><br/>“Oh? What?”<br/><br/>The Descending Dragon Great Saint was laughing one second, and his face changed dramatically the next, his shoulder even trembling.<br/><br/>Fang Wang raised an eyebrow and asked, “Well? Interested in learning it?”<br/><br/>“Yes!”<br/><br/>The Descending Dragon Great Saint blurted out, without a trace of shame in seeking teachings from a disciple.<br/><br/>Fang Wang did not drag his feet and immediately began to impart the mental method of the Heavenly Dao True Skill.<br/><br/>The Descending Dragon Great Saint listened intently, his expression growing more solemn by the moment, and soon his eyes showed excitement.<br/><br/>A full hour passed before Fang Wang finally finished speaking.<br/><br/>Imparting the Heavenly Dao True Skill to the Descending Dragon Great Saint, Fang Wang felt different than when facing others; he was anxious, looking forward to the Descending Dragon Great Saint’s reaction.<br/><br/>The Descending Dragon Great Saint closed his eyes, reflecting carefully.<br/><br/>After a long while,<br/><br/>the Descending Dragon Great Saint opened his eyes and exhaled a turbid breath, his eyes complex as he sighed, “I am not as good as you.”<br/><br/>Those simple five words were enough to satisfy Fang Wang completely.<br/><br/>Fang Wang modestly smiled and said, “This skill was completed on the foundation you laid, master. Without you, there would be no Heavenly Dao True Skill.”<br/><br/>The Descending Dragon Great Saint looked at him deeply and said, “I have remembered this skill, and this favor is enough to offset the grace of the Three Great True Cultivations’ transmission. In fact, I owe you a favor. Should there be a day I revive, I will assuredly repay you.”<br/><br/>Fang Wang curiously asked, “Could the Great Saint truly be immortal?”<br/><br/>The Descending Dragon Great Saint shook his head with a wry smile, “Immortal? How difficult it is. It’s merely that a Great Saint’s lifespan is long. I am already thirty thousand years old; to mortals, it’s an eternity, but for a Great Saint, that’s still early. A Great Saint’s life is not in the flesh, but in the soul.”<br/><br/>“May I ask master, in the world today, how many Great Saint and Great Emperor souls are lurking?” Fang Wang followed up.<br/><br/>The Descending Dragon Great Saint stroked his beard and smiled, “I am not sure, but extinguishing a Great Saint is not so easy. The Upper Realm can only destroy our physical bodies. Just like the Thousand Eyes Great Saint you’ve encountered before, he continues to scheme even after being suppressed.”<br/><br/>“By the way, be wary of the Great Saints you come across in the future. Not all Great Saints are righteous, and there are naturally evil Great Saints. After all, the position of a Great Saint is not achieved through good deeds but by being the strongest,” the Descending Dragon Great Saint cautioned.<br/><br/>Fang Wang nodded; he was curious about the Thousand Eyes Great Saint, so he pressed on to ask about his exploits.<br/><br/>The Descending Dragon Great Saint began to relay what he knew about the Thousand Eyes Great Saint.<br/><br/>The Thousand Eyes Great Saint had a life full of hardships; as a child, his parents perished in the wars of the Mortal Realm. As he grew, his sect was destroyed by other sects, and his life was full of such turmoil and suffering. He reached the realm of Celestial Qiankun, but unfortunately, in that era of prodigies, he failed to secure one of the nine ascension spots.<br/><br/>However, he was not destroyed by this setback; instead, he continued to travel the world, seeking opportunity. Later, he obtained the Heaven’s Larceny Mysterious Technique, defying fate and forging a new path to Great Saint by stripping away the fortunes of other Great Saints.<br/><br/>Later, the Thousand Eyes Great Saint was dreaded by the Upper Realm. After a hundred-year battle, his true body was suppressed, but through the Heaven’s Larceny Mysterious Technique, his soul wandered the Mortal Realm, looking for an opportunity.<br/><br/>The Descending Dragon Great Saint spoke pensively, “This predecessor even took an eye from my corpse, claiming it was for the sake of the Mortal Realm. From what I see, he only seeks revenge. Yet his revenge is aimed at the Upper Realm; in this regard, we are on the same boat.”<br/><br/>Fang Wang continued to inquire about the Upper Realm, but the Descending Dragon Great Saint shook his head, refusing to divulge.<br/><br/>“There are deities three feet above one’s head, and the heavenly secrets must not be revealed. As much as I loathe them, I have to admit their power. Once you start to inquire about them, they will sense it, and this capability is beyond what you can imagine,” the Descending Dragon Great Saint lamented. Clearly, he too had once probed into such matters.<br/><br/>The master and disciple continued their discussion, and through the Descending Dragon Great Saint, Fang Wang gained a clearer understanding of the Mortal Realm, which was larger than he had imagined.<br/><br/>Beyond the Seven Seas and Fifteen Continents, there exists another half of the world. Initially, the Descending Dragon Great Saint realized the threat from The Upper Realm and deliberately divided the Mortal Realm into several regions to prevent it from collapsing due to his own actions.<br/><br/>Thousands of years have passed, and the Descending Dragon Great Saint doesn’t know what the other end of that distant world looks like. However, powerful presences often come from afar over those thousands of years, sometimes triggering extraordinary phenomena in heaven and earth.<br/><br/>“Over the years, I have often deduced the fate of the Mortal Realm. Since the Grand An Divine Dynasty, the most prosperous era is about to arrive. Although you are strong now, your fate is just one of the countless stars in the world, and it has not yet become the brightest. Throughout history, many Great Saints were not the most gifted of their era; they were merely the ones who had the last laugh,” the Descending Dragon Great Saint warned, afraid that Fang Wang would become arrogant.<br/><br/>Fang Wang smiled and said, “Thank you for the guidance, Master. I am well aware.”<br/><br/>Then he asked, “Master, what is the strongest cultivation technique in this world?”<br/><br/>This was what he cared about the most. After the matter with the Heaven’s Larceny Saint Sect was settled, the next step was to cultivate through the years. Relying on the Sword Heaven Marsh left by the Sword Saint, he did not intend to venture out to sea but to focus on cultivating in the Sword Heaven Marsh. As for Biyou Island, it could be handed over to Fang Hanyu, who still needed to gain more experience in the world.<br/><br/>Upon hearing this, the Descending Dragon Great Saint pondered for a moment and then asked, “Are you asking about the present or throughout all history?”<br/><br/>Fang Wang narrowed his eyes and replied, “Of course, throughout all history.”<br/><br/>“If we’re talking about the number one technique of all time, then it would naturally be the Taixuan Shenxiao Scripture!”<br/><br/>“How strong is it?”<br/><br/>“As for how strong, I do not know. It’s a technique that the Great Saints of all generations have sought after.”<br/><br/>With a look of longing, the Descending Dragon Great Saint said, “Legend has it that the Taixuan Shenxiao Scripture was created by an ancient Immortal God who opened up this realm. It is because of his will that the Mortal Realm has never been obliterated by The Upper Realm.”<br/><br/>Taixuan Shenxiao Scripture!<br/><br/>Fang Wang noted the name, his eyes revealing a yearning.<br/><br/>Afterward, he inquired about other techniques, and the Descending Dragon Great Saint listed what he considered to be the top ten Divine Skills of the world. In his view, the Heavenly Dao True Skill could make it into the top ten, but it would not be ranked very high, because among the Great Saints, he did not stand out.<br/><br/>Fang Wang didn’t feel that the Descending Dragon Great Saint was putting him down – after all, the Heavenly Dao True Skill was based on the legacy of the Descending Dragon Great Saint and indeed could not possibly be the strongest technique in history.<br/><br/>After a while.<br/><br/>Fang Wang prepared to rest, and Zhao Zhen approached, holding two Shariputras and asking the Descending Dragon Great Saint about them.<br/><br/>“Two Shariputras, your fortune is not small,” the Descending Dragon Great Saint said meaningfully, as he had noticed them already but had not spoken up.<br/><br/>Thus, they began to study the Shariputras together, while Fang Wang stood up and walked along the lake’s edge.<br/><br/>Seven days later.<br/><br/>They finally left the Zhui Tian Secret Realm. The Descending Dragon Great Saint stood by the lake, watching Fang Wang’s departing figure, and murmured softly, “This teacher-student bond is one I hardly deserve. I really look forward to the day when I can revive and compete with the heroes of the current world.”<br/><br/>It took Fang Wang just one hour to travel from Grand Wei to Grand Qi Jian Tian Ze.<br/><br/>After returning to Sword Heaven Marsh, he summoned Song Jinyuan, Gu Li, Gu Tianxiong, and Chu Yin.<br/><br/>Seeing Fang Wang return safely, all four of them breathed a sigh of relief.<br/><br/>“What’s the matter? Has the news not come down yet?” Xiao Zi jumped down from Fang Wang’s shoulder, landed on Gu Li’s shoulder, and asked with a smile.<br/><br/>Gu Tianxiong asked anxiously, “Brother Fang, please tell us, what’s the situation in the north? Did you encounter Wen Li? We’ve already heard that you were pursuing the Heaven’s Larceny Saint Sect in the north, but we’re not clear on the specifics.”<br/><br/>The others all stared intently at Fang Wang.<br/><br/>Seeing that there were no injuries on him, Gu Li had her suspicions.<br/><br/>In her eyes, whatever Fang Wang set out to do, he would never fail.<br/><br/>Fang Wang smiled and said, “Although it was troublesome, fortunately, it’s been resolved. Peaceful times are ahead.”<br/><br/>Upon hearing this, everyone was moved, and Gu Tianxiong’s breathing quickened.<br/><br/>“Where was the trouble? Our young master killed Wen Li with just two punches and easily annihilated the resurrected Thousand Eyes Great Saint. Just you wait, legends are starting to stir,” Xiao Zi shouted, her snake eyes widening.<br/><br/>Killed Wen Li with just two punches!<br/><br/>Everyone was shocked, and there was talk of the Thousand Eyes Great Saint?<br/><br/>Was it the Great Saint from the legends?<br/><br/>Even Gu Li and Chu Yin looked at Fang Wang with disbelief.<br/><br/>Surpassing a Great Saint before the age of two hundred?<br/><br/>“Don’t listen to its nonsense; that Great Saint wasn’t in his true form,” Fang Wang casually explained.<br/><br/>This explanation caused even more astonishment among the crowd.<br/><br/>At the same time, the news of Fang Wang’s decisive battle with the Heaven’s Larceny Saint Sect had reached Grand Qi, and upon hearing it, the Nine Great Sects of Grand Qi and various families were initially incredulous, then overjoyed.<br/><br/>They had imagined countless possibilities, including the possibility of Fang Wang’s victory, but never that Fang Wang would kill Wen Li with just two punches!<br/><br/>What kind of strength was that?<br/><br/>Instantly, various powers sent emissaries to congratulate the Fang Family with lavish gifts, even beginning discussions on how to commemorate Fang Wang’s deeds.<br/><br/>They wanted Fang Wang to feel their goodwill!\t\t\t\t\t\t</div>", "images": {}, "success": true}