{"id": 213, "url": "https://www.novelhall.com/i-became-an-immortal-on-mortal-realm-32879/14497372.html", "title": "Chapter 213 - Chapter 213: Chapter 210 I Am Not Satisfied", "volume": 3, "volume_title": "Volume 3", "body": "<h1>Chapter 213 - Chapter 213: Chapter 210 I Am Not Satisfied</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 213: Chapter 210 I Am Not Satisfied<br/><br/>Translator: 549690339<br/><br/>Witnessing the resurrection of so many by the Thousand Eyes Great Saint, even helping those seriously wounded to heal, Fang Wang remained indifferent.<br/><br/>In fact, he had already heard from Zhou Xue that the Saint Spirit of Heaven’s Larceny Saint Sect possessed an extraordinary ability. Lu Yuanjun acted on behalf of Heaven’s Larceny Saint Sect merely to resurrect the Saint Spirit and then have the Saint Spirit resurrect his own mother.<br/><br/>However, Fang Wang could see that the so-called resurrection was nothing but a deception.<br/><br/>He, with the Yin Yang Xuan Ming Zhen Gong at his command, could see the lifespans of living beings. All those resurrected by the Saint Spirit had only one day of life left. After one day, their Yang Energy would be exhausted, and they would cease to exist.<br/><br/>He could see through it, but the other cultivators could not. They were all frightened by this scene, not knowing whether to be thrilled or terrified.<br/><br/>With such abilities, wasn’t the Thousand Eyes Great Saint equivalent to an Immortal God?<br/><br/>Yet, from the words of the Thousand Eyes Great Saint, it was clear he wasn’t performing benevolent deeds. Instead, he wanted their lives, and even the cultivators of Heaven’s Larceny Saint Sect, upon seeing the red cicada in the sky, were struck with fear.<br/><br/>This was the instinctive fear of facing death.<br/><br/>Wen Li looked at his own flesh and laughed wildly, looking up at the high-flying red cicada, he laughed, “I was indeed right. You haven’t deceived me. You’re not my Heart Demon…”<br/><br/>Fang Wang ignored Wen Li, his gaze fixed on the soaring red cicada, waiting for its next move.<br/><br/>The red cicada burst out with a strong light again, and in an instant, those resurrected people vanished, and the healed ones returned to their severely wounded state.<br/><br/>This sight awakened the cultivators on the ground as from a dream, leaving them all with a feeling of melancholy.<br/><br/>Death, after all, was irreversible.<br/><br/>“Such is the power of the Saint Spirit, capable of giving life and death, fulfilling every desire in the world, even compensating for regrets. Fang Wang, do you have any regrets, anyone you wish to bring back to life? As long as you do not oppose me, I can satisfy you,” the red cicada said from on high, wings fluttering.<br/><br/>Fang Wang asked, “If I do not oppose you, what fate awaits the people below, including Heaven’s Larceny Saint Sect?”<br/><br/>The red cicada replied, “I know you want to play mind games, but I don’t mind. They all must die. The very purpose of founding Heaven’s Larceny Saint Sect was to create a body for the Saint Spirit.”<br/><br/>Upon hearing these words, all cultivators of Heaven’s Larceny Saint Sect turned ashen, and the four Saint Venerates, already incapacitated, showed expressions of regret.<br/><br/>What good was regret?<br/><br/>They had fallen into a desperate situation; neither Fang Wang nor the Thousand Eyes Great Saint would let them live.<br/><br/>Fang Wang smiled and asked, “Compensating regrets, resurrecting? I just wonder how long your resurrection technique allows the dead to stay in the Mortal Realm?”<br/><br/>The red cicada remained silent, still suspended in the air.<br/><br/>The sound of its fluttering wings grew louder, and suddenly lightning flashed, causing the Firmament behind it to darken.<br/><br/>Before the darkening was due to dense clouds, but now the darkness was a fading of daylight, the bright sun gradually disappearing.<br/><br/>On the ground, the light had faded from everyone’s faces.<br/><br/>In the dim Firmament, countless huge eyes appeared again, and from them emerged streams of Saint Spirits. They soared towards the red cicada and merged into its body, making the red cicada continuously swell.<br/><br/>Xiao Zi watched, its snake body trembling, but it didn’t urge Fang Wang to act, trusting in his confidence.<br/><br/>In less than five breaths, the red cicada grew as massive as a mountain, its presence fully unveiled, enveloping the whole world. At that moment, the entire continent could feel its might.<br/><br/>At the same time.<br/><br/>On a distant ocean.<br/><br/>Amid a storm with howling winds and lightning, the Hongxuan Emperor was confronting a man clad in Silver Armor.<br/><br/>In the palm of the Hongxuan Emperor floated the Heavenly Emperor’s Command. He looked at his opponent with a mocking smile on his face.<br/><br/>The man in Silver Armor held a large flag that violently flapped in the storm. Beneath his helmet, it was hard to tell whether his face was wet with rain or sweat, his eyes filled with unwillingness.<br/><br/>“Who are you, exactly…”<br/><br/>The man in Silver Armor said through gritted teeth, his voice low and heavy.<br/><br/>With a twist of his neck, the Hongxuan Emperor laughed, “Me? Just a minor cultivator from Jin Xiao Sect. Junior, come join the Jin Xiao Sect. Your potential is not yet fully realized; I can make you stronger, even powerful enough to suppress this entire ocean.”<br/><br/>The man in Silver Armor fell silent.<br/><br/>Just as the Hongxuan Emperor was about to say more, he suddenly felt something and abruptly turned his head.<br/><br/>His eyes turned cold as he muttered, “It’s him. That old man is really up to something. Who could push him to this extent? This direction, could it be that boy…”<br/><br/>“Tsk tsk, what a time to be alive when even a Great Saint finds scheming so challenging?”<br/><br/>A Great Saint?<br/><br/>The man in Silver Armor was startled, clearly impressed yet perplexed.<br/><br/>After earlier exchanges, he had sensed the Hongxuan Emperor’s unfathomable depth and did not believe him to be a madman. Could it be that he knew a Great Saint who had withdrawn from the world?<br/><br/>His heart wavered. What was the origin of this Jin Xiao Sect?<br/><br/>Had his own domain, this vast ocean, truly fallen behind?<br/><br/>Great Saint Mountain was enveloped in night; the Firmament above was densely studded with stars, a stunningly beautiful panorama that yet filled those on the ground with despair.<br/><br/>All eyes were focused on the enormous red cicada, larger than the moon in the sky, covering a third of the night sky, and exuding an oppressive atmosphere.<br/><br/>Atop the giant red cicada’s head, a hand studded with eyes struggled to climb out. Soon, another eye-studded hand emerged, striving to break free of the red cicada’s husk.<br/><br/>Fang Wang watched the red cicada calmly, allowing the Thousand Eyes Great Saint to be reborn.<br/><br/>At this moment.<br/><br/>Dugu Wenhun flew over and stopped beside Fang Wang, looking up at the huge red cicada in the sky, his face showing a look of amazement, “Aren’t you going to make a move? His aura has increased so…”<br/><br/>He was shocked again.<br/><br/>Wen Li’s prior momentum had already sent shivers down his spine, and yet, there was a presence far surpassing even Wen Li’s.<br/><br/>Thousand Eyes Great Saint!<br/><br/>Just thinking of the Great Saint’s legend, Dugu Wenhun felt his pressure soar.<br/><br/>Fang Wang looked up at Thousand Eyes Great Saint and said softly, “I am not satisfied.”<br/><br/>Not satisfied?<br/><br/>Dugu Wenhun was stunned.<br/><br/>Although these words were light, they echoed through heaven and earth, pulling back the minds of all those on the ground to reality.<br/><br/>Everyone could feel the confidence behind Fang Wang’s words.<br/><br/>Not satisfied!<br/><br/>At that moment, atop the red cicada in the sky, a body emerged—it was a man revealing only his upper half. He suddenly leaned back, his long hair flying about, and his exposed upper body was covered in eyes, a horrifying sight.<br/><br/>All those eyes were looking down at Fang Wang as the voice of Thousand Eyes Great Saint sounded, “Not satisfied? You’re not satisfied with my power?”<br/><br/>Thousand Eyes Great Saint then burst into loud laughter, as if hearing the world’s greatest joke.<br/><br/>Fang Wang raised his right hand, materializing the Heavenly Palace Halberd, “If this is the extent of your power, then I would advise you to stop here. In consideration of your past as a Great Saint, I would prefer not to destroy you. Shouldn’t a Great Saint take the protection of the common folk as their duty?”<br/><br/>Thousand Eyes Great Saint leaned forward, his face also full of eyes, even one on his tongue. He laughed angrily, “Ha ha ha ha! The duty to protect the common folk?”<br/><br/>“Who said that!”<br/><br/>Boom!<br/><br/>Thousand Eyes Great Saint leapt out from the red cicada, his aura erupting completely, causing the ground to tremble violently!<br/><br/>Inside the Zhui Tian Secret Realm.<br/><br/>The white-haired old man transformed from Descending Dragon Great Saint suddenly opened his eyes, furrowed his brow, and muttered to himself, “This aura… it’s him… Calculating the days, why has it come early… What exactly happened to you, elder?”<br/><br/>Fang Wang, unaware of Descending Dragon Great Saint’s shock, held the Heavenly Palace Halberd in one hand, pointing it diagonally at Thousand Eyes Great Saint, “Come, let me see the Divine Skills of a Great Saint.”<br/><br/>Boom!<br/><br/>Fang Wang unleashed an aura in no way inferior to that of Thousand Eyes Great Saint. Heavenly Dao True Skill and Vajra Invincible Saint Body were simultaneously activated, with white flames surging forth, shooting straight into the night sky.<br/><br/>Dugu Wenhun turned his head and then his eyes widened.<br/><br/>It wasn’t just him, but Xiao Zi in Fang Wang’s arms and everyone on the ground were all dumbstruck.<br/><br/>Behind Fang Wang, a golden silhouette emerged, a thousand zhang tall, the very image of a Heavenly Emperor Avatar!<br/><br/>With a wave of the Heavenly Emperor Avatar’s arms, countless more arms appeared, as if a single body had grown a thousand arms, dazzling to behold.<br/><br/>Thousand Eyes Great Saint paused and narrowed his eyes, “Heavenly Emperor Imperial Mirror, have you received the inheritance of the Hongxuan Emperor?”<br/><br/>Dugu Wenhun was shocked.<br/><br/>Was this the true Divine Skill of the Heavenly Emperor Imperial Mirror?<br/><br/>The form of the Heavenly Emperor Avatar, resembling Fang Wang, emitted a vast, domineering aura, and in the presence of this Avatar, Dugu Wenhun instinctively wanted to kneel.<br/><br/>It dawned on him then that the Hongxuan Emperor he had faced in Emperor’s Tomb Island had never used the Heavenly Emperor Imperial Mirror.<br/><br/>Not only had Fang Wang defeated the Hongxuan Emperor, but he had also mastered the Heavenly Emperor Imperial Mirror in just a few decades!<br/><br/>What terrifying talent!<br/><br/>As Heavenly Dao True Skill was activated, fighting spirit was all that occupied Fang Wang’s mind; his gaze became piercingly sharp. He leaped up, reaching the same height as Thousand Eyes Great Saint, and calmly said, “You know of the Hongxuan Emperor? Then let me ask, were you stronger in your prime, or was the peak Hongxuan Emperor superior?”<br/><br/>On the ground, all Cultivators looked up at the Heavenly Emperor Avatar behind Fang Wang, as if they were worshiping an Immortal God.<br/><br/>Not just them, from all directions, many Cultivators who were rushing over also caught sight of the majestic figure of the Heavenly Emperor Avatar and Thousand Eyes Great Saint. Of course, the Heavenly Emperor Avatar was the most eye-catching of all.<br/><br/>“What is that?”<br/><br/>Fang Bai, standing on the Flying Sword, widened his eyes in astonishment, unable to maintain his usual cool demeanor.<br/><br/>Fang Jing had never seen the Heavenly Emperor Avatar, but he inexplicably thought of the Heavenly Emperor’s Command that the Hongxuan Emperor had bestowed upon him. He could be sure that the formidable aura ahead belonged to his great uncle; could that mysterious figure resembling his great uncle be the first stage of the Heavenly Emperor Imperial Mirror, the Heavenly Emperor Avatar?<br/><br/>He was astounded as well.<br/><br/>Because the Hongxuan Emperor had told him, if he could manifest the Heavenly Emperor Avatar within a thousand years, he could dominate the Mortal Realm…<br/><br/>How many years had passed since the journey to Emperor’s Tomb Island?<br/><br/>Fang Jing suddenly felt that he was not a genius; it was his great uncle who was unparalleled in the world.<br/><br/>Upon hearing Fang Wang’s question, Thousand Eyes Great Saint sneered, “That answer, after you die, you can go ask the Hongxuan Emperor.”<br/><br/>Boom!<br/><br/>Thousand Eyes Great Saint suddenly charged at Fang Wang, moving so fast that the eyes of all the spectators couldn’t keep up.<br/><br/>Accompanied by a tremendous roar, Thousand Eyes Great Saint was blocked by an arm of the Heavenly Emperor Avatar, and below the Avatar, Fang Wang remained expressionless, “Let’s try not to harm the mortal spirits, shall we?”<br/><br/>Thousand Eyes Great Saint wasn’t frightened but laughed even more madly, greed evident in all his eyes. He sneered, “Fine!”\t\t\t\t\t\t</div>", "images": {}, "success": true}