{"id": 212, "url": "https://www.novelhall.com/i-became-an-immortal-on-mortal-realm-32879/14493898.html", "title": "Chapter 212 - Chapter 212: Chapter 209: Two Fists Dominate The World, Disaster Descends With The Dragon", "volume": 3, "volume_title": "Volume 3", "body": "<h1>Chapter 212 - Chapter 212: Chapter 209: Two Fists Dominate The World, Disaster Descends With The Dragon</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 212: Chapter 209: Two Fists Dominate the World, Disaster Descends with the Dragon<br/><br/>Translator: 549690339<br/><br/>Facing Wen Li’s inquiry, Fang Wang did not respond.<br/><br/>The cultivators of the Protecting Heaven Sect and the Heaven’s Larceny Saint Sect came back to their senses, all of them were shocked, and many cultivators from the Heaven’s Larceny Saint Sect even turned and fled.<br/><br/>The four Saint Venerates were stunned. Although it was apparent that Wen Li had not completely perished, the ability to eradicate Wen Li’s flesh with a single punch was beyond their imagination.<br/><br/>They were chilled to the bone, uncertain whether to retreat or to fight.<br/><br/>If they retreated, should Wen Li survive, the consequences would be unimaginable. But to confront Fang Wang…<br/><br/>It was not a wise move!<br/><br/>Fang Wang stared at Wen Li and said, “Show me the power of the Saint Spirit.”<br/><br/>He wanted to decide the fate of Qiankun with one battle, to break the world’s fear of Saint Spirits, to ensure the complete dissolution of the Heaven’s Larceny Saint Sect, to establish his own image of absolute strength, so that wherever he went in the future, the world would not dare to provoke the Fang Family.<br/><br/>Of course, he still had a bit of a warlike heart.<br/><br/>He wanted to see just how strong he really was, now that he had reached the Mahayana Realm!<br/><br/>Upon hearing these words, Wen Li’s skeleton slowly retreated, and rolling Demonic Qi emerged from his eyes.<br/><br/>Dark clouds in the sky started to roil violently, followed by the appearance of huge eyes out of thin air above, dense and innumerable, casting their gaze down on all living beings.<br/><br/>All who looked up were horrified, unsure if they were caught in an illusion, with some people even unable to stop themselves from rubbing their eyes.<br/><br/>At a glance, it was impossible to see just how many eyes there were.<br/><br/>As these eyes scanned in different directions, anyone who was observed by them couldn’t help but jump in fear, feeling a chill down their spine.<br/><br/>Fang Wang suddenly glanced at the Saint Spirit with three heads and six arms. The Saint Spirit, previously about to devour Shen Buhui alive, suddenly stopped, hesitated for a moment, and then threw Shen Buhui down.<br/><br/>Shen Buhui, who was falling through the air, had already come to his senses and saw Fang Wang’s recent glance, understanding that Fang Wang had saved him.<br/><br/>With his physical body, even if he fell, he wouldn’t die.<br/><br/>The Saint Spirit’s three pairs of eyes stared at Fang Wang with a strange look, and then flew towards Wen Li’s skeleton.<br/><br/>Fang Wang did not intervene, watching as the Saint Spirit and Wen Li’s skeleton merged together.<br/><br/>Gradually, the soul body of the Saint Spirit began to condense flesh, and its three heads transformed into Wen Li’s face, each showing different expressions: one fearful, one jealous, and one filled with hatred.<br/><br/>“Fang Wang, you are indeed strong, stronger than I had anticipated,” said Wen Li. “I never thought I’d reach the point where I’d use my own body as a container for the Saint Spirit. Since it has come to this, you have no reason to remain alive!”<br/><br/>At that moment, Wen Li leaped up, spreading his six arms, as a giant red cicada emerged from behind him, becoming immensely huge. Its wingspan alone was no less than five hundred zhang in diameter, leaving cultivators from both sects wide-eyed and speechless.<br/><br/>The three-headed and six-armed Wen Li emitted a sense of madness, as a cold and gloomy wind swept through heaven and earth.<br/><br/>“Great Saint, please lend me your strength!” Wen Li shouted as he looked up, accompanied by three eerie roars, like that of ferocious beasts.<br/><br/>Rumble—<br/><br/>The world trembled mightily, and all the giant eyes in the sky turned towards Wen Li. Suddenly, numerous Saint Spirits flew out from these eyes, each a soul body, with forms both human and monstrous.<br/><br/>They lifted their hands in unison, striking towards Wen Li from afar. Beams of light burst from the palms of their hands and landed on Wen Li, causing his aura to surge higher and higher.<br/><br/>This scene made the cultivators of the Protecting Heaven Sect extremely uneasy.<br/><br/>“What’s happening, why isn’t Fang Wang making a move?”<br/><br/>“Are those all demon souls? Why are there so many…”<br/><br/>“That face… isn’t that Chen Qing, a disciple of our sect?”<br/><br/>“My disciple Cheng Zhixun is there too…”<br/><br/>“It turns out the Heaven’s Larceny Demon Sect was recruiting talents to serve as vessels for their demon souls… Damn it…”<br/><br/>There was a time of cursing, swearing, and wailing in the world.<br/><br/>Seeing so many Saint Spirits descend, as if a myriad of Immortal Gods were overlooking the Mortal Realm, the Heaven’s Larceny Saint Sect members were all stirred up.<br/><br/>With such a show of force, they could win!<br/><br/>The figure of Wen Li within the blaze of light quivered, and his body also began to grow larger, rapidly exceeding ten zhang in height.<br/><br/>He lifted his left three arms, his three palms facing Fang Wang, and the three faces revealed an arrogant expression as they said in unison, “Fang Wang, witness this extraordinary power, and remember, it comes from the Thousand Eyes Great Saint!”<br/><br/>As the words fell, three black orbs formed in front of his palms, like black holes, madly devouring the spiritual energy of nature, stirring up a devastating wind.<br/><br/>Some people, depleted of Spiritual Power and with heavily injured bodies, were even swept up toward the sky, including Shen Buhui and Li Qingsong.<br/><br/>Fang Wang’s lips curled upward, and he suddenly threw a punch, his right fist aimed skyward. A Black Dragon, with bared fangs and claws, burst forth and charged towards Wen Li.<br/><br/>Boom!<br/><br/>As the Black Dragon’s head approached Wen Li, its tail had not yet formed, as if there was a space-time tunnel in front of Fang Wang’s fist, through which this terrifying Black Dragon emerged.<br/><br/>Wen Li’s triple pupils involuntarily dilated, unable to react because the distance was less than a thousand zhang.<br/><br/>The Black Dragon, with its absolutely dominant stature, tore through Wen Li’s body, and with the force of a collapsing mountain, pierced through the clouds in the sky. The countless giant eyes shattered like an illusion breaking with the ripples.<br/><br/>“This punch, I call the Nine Dragons Tyrant Fist.”<br/><br/>Fang Wang’s voice echoed between heaven and earth, the Black Dragon disappearing into the zenith, as light streamed down through the huge gap in the clouds, shining on the earth.<br/><br/>The cultivators from both sects stood in place once again, disbelieving what they had seen.<br/><br/>The image of the Black Dragon was deeply etched into their minds, unforgettable for life. Looking along their gaze, between Fang Wang and the Firmament, there was no longer any sign of Wen Li’s figure; this time, not even bones were left behind.<br/><br/>With the dissipation of Wen Li’s aura, those who had soared into the air followed in descent, Shen Buhui looked up at the elevated Fang Wang, bathed in sunlight, and felt a trace of divinity.<br/><br/>He had never seen such a dazzling existence.<br/><br/>“Nine Dragons Tyrant Fist…”<br/><br/>Who knows how many people were murmuring that name.<br/><br/>Fang Wang turned his head, looking down at the four Saint Venerates and the Heaven’s Larceny Saint Sect army from afar, as he spoke, “Kneel.”<br/><br/>In that moment, the four Saint Venerates, as well as those Demonic Cultivators who had not fled, all felt his gaze and heard the command to kneel; most instinctively knelt in mid-air.<br/><br/>The four Saint Venerates’ eyelids twitched wildly, hesitating for a moment before bowing their heads to kneel.<br/><br/>As they knelt, all of the remaining Heaven’s Larceny Saint Sect Cultivators fell to their knees.<br/><br/>With only two punches, Fang Wang had ended this catastrophe that had lasted for decades!<br/><br/>Fang Wang, high above, stood beneath the sunlight, while the tens of thousands of Heaven’s Larceny Saint Sect Cultivators lay under the shadows of the clouds—an image of light and darkness, high and low, one against tens of thousands, tens of thousands kneeling before him!<br/><br/>The scene froze, deeply moving everyone present.<br/><br/>The Cultivators of the Protecting Heaven Sect were moved, and soon someone broke the silence, with cheers echoing to the heavens, countless people weeping for joy.<br/><br/>“We won!”<br/><br/>“My god, with two punches, two punches he killed Wen Li, soul and all, not a trace left behind!”<br/><br/>“Nine Dragons Tyrant Fist… truly the supreme skill in all the lands!”<br/><br/>“Wen Li is dead, Wen Li is dead! Hahaha——”<br/><br/>“We finally won, we can finally go home…”<br/><br/>Cheers reverberated between heaven and earth, the storm between the heaven and earth gradually subsiding.<br/><br/>Fang Wang’s gaze condensed, Divine Nurturing Sword Qi burst forth from his eyes, piercing through Saint Hong at an incredibly fast speed, the other three Saint Venerates couldn’t even react before they too were pierced by the Divine Nurturing Sword Qi, their Spiritual Power rapidly dissipating.<br/><br/>The four changed color drastically, looking toward Fang Wang in terror.<br/><br/>Fang Wang expressionless, said, “All you demons fall down and await the Protecting Heaven Sect’s judgment, your lives and deaths shall be decided by the Protecting Heaven Sect.”<br/><br/>The overbearing pressure of the Heavenly Dao True Skill forcibly pushed tens of thousands of Demonic Cultivators down, as the Cultivators of the Protecting Heaven Sect looked at the Demonic Cultivators with eyes full of madness and hatred.<br/><br/>Fang Wang was giving them a chance to vent, having battled for decades, and he had thrown two satisfying punches, but what about the righteous Cultivators of Protecting Heaven Sect?<br/><br/>If victory could not lead to revenge, it would forever remain regretful!<br/><br/>Xiao Zi, in Fang Wang’s arms, excitedly asked, “Master, is it over?”<br/><br/>Fang Wang calmly replied, “That’s far from it.”<br/><br/>He lifted his right hand and waved it towards the sky, with a casual flick, the clouds covering the firmament instantly dispersed, a gesture that seemed to pull daylight back into reality, making everyone’s eyelids jump in surprise.<br/><br/>Before they could marvel, their gaze shifted to the firmament.<br/><br/>A giant red cicada floated beneath the bright sun; it was Wen Li’s red cicada, it was still alive.<br/><br/>Fang Wang looked up at the red cicada and said, “Are you the Thousand Eyes Great Saint?”<br/><br/>The red cicada looked down at Fang Wang and in an appreciative tone said, “Junior, you are even more outstanding than all the favored children of heaven that this Saint has encountered in the past. In whatever era, a being like you would shine the brightest; unfortunately, you insist on obstructing my path.”<br/><br/>Thousand Eyes Great Saint!<br/><br/>All those between heaven and earth were shaken, they had not heard this name before, but the two words ‘Great Saint’ were enough to instill them with fear.<br/><br/>Even the Heaven’s Larceny Saint Sect was frightened, could the Sect Hierarch’s red cicada be the incarnation of a Great Saint?<br/><br/>Could it be that the Sect Hierarch was also a pawn?<br/><br/>“It’s not that I’m blocking your way, it’s that your path takes the lives of all under heaven,” Fang Wang replied, his voice free of any emotion, seemingly not considering the Great Saint a threat.<br/><br/>He had long sensed the aura of the Thousand Eyes Great Saint; this was his true opponent.<br/><br/>Clearly, the Thousand Eyes Great Saint was not in his peak condition, yet the prospect of challenging a Great Saint filled him with anticipation.<br/><br/>The red cicada spoke softly, “Are the lives of the mortals below us of any importance? How many years can those below you live? They are merely specks of dust in the ever-turning wheel of the mortal realm. If they could become part of this Saint’s enlightenment, their lives would have value. Fang Wang, do you know the origins of what are called Saint Spirits?”<br/><br/>Fang Wang just looked at him.<br/><br/>The red cicada continued, “The so-called Saint Spirits are the souls of the Extraterrestrial Demon Race from ancient times. They once swept across the Mortal Realm and not even The Upper Realm could control them. They were born with inconceivable abilities, controlling life and death, fate, and fortune in their hands; for example, they could resurrect the dead.”<br/><br/>A bright light burst forth from the eyes of the red cicada, sweeping across heaven and earth.<br/><br/>In an instant, white bones began to coalesce in the sky, eventually forming Wen Li’s figure.<br/><br/>Besides Wen Li, figures of Cultivators who had been reduced to ashes began taking shape, and likewise, figures started to appear on the ground.<br/><br/>Shen Buhui slowly stood up, he looked at his own hands, his face showing shock.<br/><br/>He distinctly felt his vitality returning…<br/><br/>Impossible…<br/><br/>Instead of feeling delighted, he watched the towering red cicada with fear.<br/><br/>Li Qingsong also stood up, he stared tightly at the red cicada, his turbid eyes filled with incredulity, muttering to himself, “Thousand Eyes Great Saint… so it is… the calamity originates from accommodating the dragon… the calamity originates from accommodating the dragon…”\t\t\t\t\t\t</div>", "images": {}, "success": true}