{"id": 217, "url": "https://www.novelhall.com/i-became-an-immortal-on-mortal-realm-32879/14500432.html", "title": "Chapter 217 - Chapter 217: Chapter 214: Heavenly Dao Xuan Gong, The True Dragon Mountain Legacy", "volume": 3, "volume_title": "Volume 3", "body": "<h1>Chapter 217 - Chapter 217: Chapter 214: Heavenly Dao Xuan Gong, The True Dragon Mountain Legacy</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 217: Chapter 214: Heavenly Dao Xuan Gong, the True Dragon Mountain Legacy<br/><br/>Translator: 549690339<br/><br/>Grand Qi, Luo State, Yang Hu County, Southern Hills City.<br/><br/>The entrance to the Fang Family Mansion was crowded with people. Although populous, there was no disorder; everyone quietly awaited.<br/><br/>A female cultivator in white clothes pushed through the crowd—Fang Xin, who once followed Fang Wang to the Great Abyss Gate. A hundred years had passed, and she had become a cultivator in her own right. The Fang Family disciples at the front gate did not recognize her, but when she produced her Fang Family token, they respectfully made way.<br/><br/>Fang Xin entered the mansion and saw the spacious courtyard crowded with cultivators, still lively and bustling.<br/><br/>She was not surprised, and a proud smile spread across her face.<br/><br/>“I’m telling you, when I traveled north before, I had seen the strength of the Heaven’s Larceny Demon Sect’s Heavenly Monarch. That guy was truly terrifying—one palm strike almost annihilated our entire sect. If the Heavenly Monarch is so powerful, imagine how formidable the Sect Hierarch Wen Li must be.”<br/><br/>“Fang Wang is the number one person in the world. It’s normal for people to die at his hands. Think about it, since he burst onto the scene, has anyone ever managed to wound him?”<br/><br/>“To defeat Wen Li with only two punches—it’s too enviable. I really want to witness the majesty of the Nine Dragons Tyrant Fist.”<br/><br/>“Tsk tsk, that’s the number one fist technique in the world. You think it’s something you can aspire to?”<br/><br/>“I wonder when Fang Wang will return. I really want to witness his magnificent presence.”<br/><br/>The entire Fang Residence buzzed with discussions like these, as lively as if it were the New Year.<br/><br/>Fang Xin walked down the corridors and saw Fang Mo, who was one of the nine Great Cultivators from the Great Abyss Gate. She grabbed Fang Mo’s arm and asked, “Are they all back?”<br/><br/>Fang Mo, much steadier than before and radiating the air of a Great Cultivator, turned his head to look at Fang Xin and smiled, “Everyone’s back except for Fang Wang, Zhou Xue, and Zi Geng.”<br/><br/>“Hasn’t the chaos brought by Heaven’s Larceny Saint Sect ended? How come brother Fang Wang still hasn’t returned?” Fang Xin asked with a frown.<br/><br/>“They say he went to the Sword Heaven Marsh to cultivate. He’s such a cultivation fanatic; how could he have time to rest?” Fang Mo shook his head with a wry smile.<br/><br/>Hearing this, Fang Xin laughed, agreeing with the sentiment.<br/><br/>Afterward, the two of them walked towards the deeper part of the mansion, chatting and laughing.<br/><br/>For the Fang Family Disciples of Fang Wang’s generation, every return to the Fang Residence was profoundly nostalgic, for they had experienced two distinct eras of the Fang Family and understood how ordinary the Fang Family once was.<br/><br/>With deep emotion, they always felt gratitude toward Fang Wang.<br/><br/>In the Fang Residence, no one envied Fang Wang, for without him, the Fang Family would have been exterminated more than a hundred years ago. Nowadays, whenever a Fang Family disciple entered the Cultivation World, they all carried Fang Wang’s favor—Fang Wang would always be the ultimate trump card for the Fang Family Disciples in the Cultivation World.<br/><br/>Many Fang Family disciples had escaped death simply by invoking Fang Wang’s name.<br/><br/>Fang Wang was so young that people in the Grand Qi Cultivation Realm dared not provoke the Fang Family, unless faced with a deadly feud that forced them to take action.<br/><br/>Fang Yin, Fang Wang’s father, had also returned. During these days, he was the busiest person in the Fang Residence, while Lady Jiang, Fang Wang’s mother, was the happiest person there.<br/><br/>One month after Heaven’s Larceny Saint Sect was exterminated, Fang Wang’s reputation peaked, solidifying his name associated with the Heavenly Dao. Heaven’s Larceny Saint Sect had brought unprecedented dark times to the continent for decades, and Fang Wang, who ended this dark era, naturally became the embodiment of the Heavenly Dao in the hearts of the people.<br/><br/>Grand Qi’s status soared as a result, with various nations, sects, and tribes eagerly sending envoys to Grand Qi.<br/><br/>Meanwhile, Fang Wang at Sword Heaven Marsh began to research the fusion of cultivation techniques.<br/><br/>He was preparing to fuse the Heavenly Dao True Skill and the Solaris Scripture.<br/><br/>Even though he wasn’t at the Fang Residence, Sword Heaven Marsh became bustling because of him, forcing Song Jinyuan to increase the number of Sword Servants. Gu Tianxiong even volunteered to bring a batch of disciples from the Gu Family to serve as Sword Servants for Fang Wang.<br/><br/>For the Gu Family disciples, their admiration for Fang Wang was boundless, and they competed to become Sword Servants for him.<br/><br/>By the lakeside.<br/><br/>Gu Tianxiong, looking into the distance at Fang Wang’s figure in the Ling Wu, asked softly, “Won’t you say goodbye?”<br/><br/>Gu Li’s gaze remained calm as she put her veil back on and replied, “No need, the relationship between him and me won’t be affected by something so sentimental; we’ll meet again in the future.”<br/><br/>Having said this, she leaped up, sword in hand, and quickly disappeared over the other side of the mountain.<br/><br/>Gu Tianxiong sighed and shook his head slightly.<br/><br/>He turned his gaze back to Fang Wang, a curious smile on his face.<br/><br/>In the maelstrom of the mortal world, the noise never ceased; tales of Fang Wang defeating Wen Li with two punches and overcoming the revived Great Saint continued to be told for many years to come, inspiring a new generation of cultivators as they entered the Cultivation World.<br/><br/>Five years later.<br/><br/>Fang Wang finally figured it out and entered the state of mind necessary to venture into the Heavenly Palace.<br/><br/>With the Heavenly Palace advantage, it still took five years of steadfast meditation to fuse the Heavenly Dao True Skill and the Solaris Scripture, which goes to show the difficulty of the task.<br/><br/>Fang Wang opened his eyes and looked around at the familiar environment of the Heavenly Palace, a smile on his face.<br/><br/>The great battle five years ago had left him irritable. He seemed modest on the surface, but deep down, he was filled with pride, feeling himself nearing invincibility. He needed to cool down.<br/><br/>Five years, ten years—none were enough to settle his mind.<br/><br/>It would take five hundred years of composure!<br/><br/>Fang Wang invigorated his spirit and began to practice the new cultivation technique.<br/><br/>After some time.<br/><br/>Mastery alone wouldn’t stop Fang Wang; even if he practiced the cultivation technique to Great Completion, he didn’t rest.<br/><br/>He cultivated all the way to Great Perfection!<br/><br/>By the time his cultivation was complete, he looked back and realized that 730 years had passed.<br/><br/>The Heavenly Palace shattered, and Fang Wang reopened his eyes. From the perspective of reality, his gaze transitioned from an air of arrogance to an indifferent one in the blink of an eye.<br/><br/>“Indeed, cultivation is truly about cultivating the heart.”<br/><br/>Fang Wang murmured to himself, a faint smile appearing on his face.<br/><br/>The fusion of the Heavenly Dao True Skill and the Solaris Scripture allowed his Spiritual Power to become even purer; he cultivated a completely new flame, which he named the True Heavenly Fire.<br/><br/>The new cultivation technique was named Heavenly Dao Xuan Gong!<br/><br/>The True Heavenly Fire was even more domineering than the Solaris True Fire!<br/><br/>Fang Wang prepared to continue integrating techniques, aiming to merge Heavenly Dao Xuan Gong with the Infinite Sun Skill so that the cultivation techniques in his possession would all be unified.<br/><br/>He didn’t plan to rest and started to run his cultivation technique immediately.<br/><br/>As he did so, an immense Heavenly Might descended, thunderclouds surged in the sky with great momentum, leading many Sword Cultivators within Sword Heaven Marsh to look up.<br/><br/>Fang Wang’s mouth curved up slightly; apparently, Li Qingsong was right.<br/><br/>The Demonic Soul comes forth, Heavenly Secrets retreat.<br/><br/>With the demise of Heaven’s Larceny Saint Sect, Heavenly Secrets reemerged!<br/><br/>Fang Wang remained unmoved. Celestial phenomena were not a tribulation crossing; though they seemed frightening, no thunder would actually fall.<br/><br/>Although he was calm, the cultivators of Sword Heaven Marsh and all the common folk across the world became extremely anxious. The chaos caused by Heaven’s Larceny Saint Sect had only subsided five years ago, and the people were afraid of its resurgence, especially since the disaster had involved a Great Saint.<br/><br/>For a time, everyone across the land was in a state of panic. Song Jinyuan even wanted to visit Fang Wang, but seeing him still meditating, he could only restrain himself.<br/><br/>A full hour passed before the Heavenly Might dispersed, the thunderclouds in the sky cleared, and the sunlight finally fell.<br/><br/>Fang Wang calculated the time, finding that it was somewhat longer than what the Heavenly Dao True Skill had caused, by about half an hour.<br/><br/>He closed his eyes, continuing to ponder the integration of the cultivation techniques.<br/><br/>But the turmoil caused by this celestial event didn’t dissipate; the various sects and clans across the land took precautions. Unseen, Fang Wang propelled the development of the cultivation world on the continent.<br/><br/>Heavenly Dao Xuan Gong’s automatic Qi Gathering was faster than that of Heavenly Dao True Skill, and two years later, Fang Wang naturally made a breakthrough to the second layer of the Mahayana Realm.<br/><br/>Seven years to break through from the first layer to the second layer of the Mahayana Realm was an exceedingly fast pace, and Fang Wang hadn’t even focused on cultivating; it was the automatic cultivation by Heavenly Dao Xuan Gong.<br/><br/>That year, The Three Immortals of the Emperor Sea, Dugu Wenhun, and three others returned: Li Qingsong, Li Tianjue, and Shen Buhui.<br/><br/>Fang Wang stood up and met with everyone inside the loft.<br/><br/>The Three Immortals of the Emperor Sea talked nonstop, mainly about the situation in the north; Dugu Wenhun and Li Tianjue occasionally interjected with mostly compliments. In contrast, Li Qingsong and Shen Buhui were very quiet.<br/><br/>Shen Buhui kept glancing at Fang Wang, his eyes filled with gratitude and curiosity.<br/><br/>Li Qingsong’s face had only half recovered, covered with scars, making him look quite frightening.<br/><br/>After a long conversation, Li Tianjue finally expressed his thanks, “Fang Wang, thank you. If not for you, the Jin Xiao Sect wouldn’t have saved my master and Shen Buhui.”<br/><br/>Upon hearing this, Fang Wang knew that Zhou Xue wanted to repay a favor from a former life and had attributed the deed to him.<br/><br/>“It’s nothing, I hope that the Jin Xiao Sect will manage to garner friendship from Descending Dragon Mountain in the future,” Fang Wang said with a smile.<br/><br/>Li Tianjue hastily nodded, saying, “Of course, I’ll tell my father as soon as I return.”<br/><br/>Dugu Wenhun teased, “Does your father hold a high position at Descending Dragon Mountain?”<br/><br/>Li Tianjue glanced at him and said, “Our Li Family is the direct lineage of the Descended Dragon Great Saint. Descending Dragon Mountain has only ever produced one Great Saint. Do you think that’s a high position?”<br/><br/>At this moment, Li Qingsong gave a deliberate cough and looked at Fang Wang, saying, “Apologies, my disciple isn’t very formal in speaking. Your achievements and legacy are more than enough for Descending Dragon Mountain to treat you generously.”<br/><br/>“Fang Wang, come back with us to Descending Dragon Mountain. Descending Dragon Mountain will bestow its spiritual legacy upon you, to help you in your future conflicts with the Thousand Eyes Great Saint.”<br/><br/>As soon as these words came out, everyone became curious, including The Three Immortals of the Emperor Sea, who looked at Li Qingsong in astonishment.<br/><br/>Li Qingsong sighed and said, “The Thousand Eyes Great Saint is extremely cunning. When the Great Saint fell, his head was buried in Descending Dragon Mountain, yet the Thousand Eyes Great Saint, by possessing a Cultivator, misled him into joining Descending Dragon Mountain. He not only learned the secret arts of the mountain but also stole the Great Saint’s eyes, which has become the greatest shame in the history of Descending Dragon Mountain.”<br/><br/>Dugu Wenhun asked, “Are you saying all the eyes on his body belong to the Great Saint?”<br/><br/>Li Qingsong looked at him and shook his head saying, “I wouldn’t know about that.”<br/><br/>People began discussing the Thousand Eyes Great Saint.<br/><br/>After talking for a good half-hour, Fang Wang finally saw them off.<br/><br/>As for going to Descending Dragon Mountain, Fang Wang said he wanted to wait for a while and go later. Li Qingsong initially wanted to persuade him further, but when Fang Wang mentioned that he wanted to accompany his parents in their old age, Li Qingsong gave up.<br/><br/>“The path of cultivation is long. People often overlook the passage of time. As the years go by, looking back, some people who have left will never be encountered again. Your choice is not wrong. Even if the sky were to fall, family is the most important.”<br/><br/>Li Qingsong said with a sigh, then he took his leave.<br/><br/>Li Tianjue hurriedly followed, and Shen Buhui bowed deeply to Fang Wang. Throughout it all, he hadn’t spoken a word; Fang Wang almost thought he was mute.<br/><br/>“How about you? Are you leaving as well?” Fang Wang asked The Three Immortals of the Emperor Sea and Dugu Wenhun with a smile.<br/><br/>All four expressed their desire to follow him and study the Heavenly Emperor Imperial Mirror.<br/><br/>The Heavenly Emperor Imperial Mirror was profoundly complex, and even with their remarkable skills, it would take decades to master.\t\t\t\t\t\t</div>", "images": {}, "success": true}