{"id": 211, "url": "https://www.novelhall.com/i-became-an-immortal-on-mortal-realm-32879/14493897.html", "title": "Chapter 211 - Chapter 211: Chapter 208 The Descent Of The Heavenly Dao, Unrivaled Under The Heavens", "volume": 3, "volume_title": "Volume 3", "body": "<h1>Chapter 211 - Chapter 211: Chapter 208 The Descent Of The Heavenly Dao, Unrivaled Under The Heavens</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 211: Chapter 208 The Descent of the Heavenly Dao, Unrivaled Under the Heavens<br/><br/>Translator: 549690339<br/><br/>How fast Fang Wang was moving at full speed, Xiao Zi couldn’t tell, but she couldn’t see the surroundings clearly at all and could only sense the approach of many powerful auras from afar.<br/><br/>During the flight, Fang Wang deliberately released a trace of his aura.<br/><br/>Even though it was just a trace, he believed Wen Li would feel it!<br/><br/>On the other side.<br/><br/>In front of the Great Saint Mountain.<br/><br/>Dark clouds churned, and sandstorms filled the air as columns of Earth Spirit Qi, resembling dragon pillars, connected heaven and earth like a miracle; however, there was an eerie stillness between heaven and earth.<br/><br/>Cultivators from the Protecting Heaven Sect fell to the ground, their legs giving way, kneeling on the earth with faces filled with despair and unwillingness, all gazing in the same direction.<br/><br/>In the sky, Li Qingsong, covered in blood, was held in one hand by Wen Li. Li Qingsong’s Dao Robe was torn, arms and legs dangling lifelessly, swaying in the wind.<br/><br/>Wen Li, dressed in a deep purple robe, was surrounded by Demonic Qi, forming a series of demonic shadows behind him, each with a different posture, all hunched over, looking down at Li Qingsong in his hand.<br/><br/>The Protecting Heaven Sect fell into despair while the Heaven’s Larceny Saint Sect was also extremely anxious, for Wen Li’s strength had already made them uneasy, especially the demonic shadows behind Wen Li, which even Demonic Cultivators would fear.<br/><br/>And now, something was amiss!<br/><br/>It wasn’t just Li Qingsong who was defeated; Shen Buhui was too.<br/><br/>Shen Buhui fared even worse, hoisted overhead by a right arm of the Saint Spirit, limbs pointing downward, face up to the sky, his forearms and shanks gone, dripping with blood.<br/><br/>At that moment, Shen Buhui’s consciousness was faint; he could feel his life force slipping away as past scenes flashed before his eyes: the family joy of his childhood, the drifting and wandering after growing up, and the days spent with Li Tianjue.<br/><br/>“So it turns out… I’m really not the protagonist in the story… can’t be the savior…” Shen Buhui bitterly thought. He struggled to glance over, seeing Li Qingsong in the distance, also awaiting death.<br/><br/>He knew the other was Li Tianjue’s master.<br/><br/>This was the first time he had seen Li Tianjue’s most proud master, and he had imagined countless scenarios of meeting Li Qingsong, never expecting it would be under these circumstances.<br/><br/>To die together.<br/><br/>Suddenly, a lot of the resentment in Shen Buhui’s heart dissipated.<br/><br/>Yes, at least there was someone to accompany him in death.<br/><br/>What was there to fear in death?<br/><br/>Saint Hong came to Wen Li’s side, asking cautiously, “Sect Hierarch, why haven’t you killed them yet?”<br/><br/>He tried not to look at the demonic shadows behind Wen Li.<br/><br/>Despite the imposing presence of the five Saint Venerates within the Heaven’s Larceny Saint Sect, ranked just below one person, only they knew just how vast the gap between themselves and Wen Li was.<br/><br/>Once, the five Saint Venerates joined forces against Wen Li and were executed by him in a very short time. Only after resurrection through another’s body did they become as ‘loyal’ as they are now.<br/><br/>Wen Li tipped back his head slightly, looking down at Li Qingsong in his hand, and said, “Wait for someone to arrive before killing them.”<br/><br/>“Who?”<br/><br/>Wen Li didn’t answer again but instead stared at Li Qingsong, saying coldly, “Such a pitiable state for the grand mage of Jianglong Mountain. Even I’m somewhat heartbroken to see this, sorry, I might have been a bit too harsh earlier.”<br/><br/>Following his gaze, Li Qingsong’s face was a bloody mess, and apart from his teeth, one could barely make out his features—especially his eye sockets, which were devoid of eyes, as if mauled by some terrible beast, horrifying to the extreme.<br/><br/>Li Qingsong’s mouth spat out blood, seemingly still conscious.<br/><br/>Curiosity filled Saint Hong’s heart. Who exactly was the Sect Hierarch waiting for?<br/><br/>Just then.<br/><br/>He suddenly sensed something, quickly looking towards the horizon, and he was not the only one; the other three Saint Venerates also looked that way.<br/><br/>After a few breaths, the Great Cultivators from both the Heaven’s Larceny Saint Sect and the Protecting Heaven Sect also sensed an aura.<br/><br/>The Protecting Heaven Sect was not made up of just Loose Cultivators; most of the Cultivators following Shen Buhui to the decisive battle were elite members from various sects, including many leaders and elders.<br/><br/>“Someone’s coming!”<br/><br/>“Who is it?”<br/><br/>“This aura… something’s off…”<br/><br/>“Who could it be? Is the Sect Hierarch waiting for them?”<br/><br/>“Could it be that the Heaven’s Larceny Demon Sect isn’t killing us because they’re waiting for that person? Who’s worth waiting for by Wen Li, the old demon?”<br/><br/>Cultivators from both sects were discussing among themselves. The Protecting Heaven Sect Cultivators didn’t flee because they were waiting for death, but because following Shen Buhui’s crushing defeat, their Fate had been completely severed, and each one suffered backlash, their Spiritual Power dissipating, leaving them like ordinary mortals, and ones that were exhausted at that.<br/><br/>With discussions filling the space between heaven and earth, an overbearing and unmatched aura descended; at that moment, everyone felt an immense pressure.<br/><br/>Such pressure made them feel as though the majesty of Heavenly Dao had arrived.<br/><br/>If Wen Li’s pressure was evil and cold, this pressure was absolutely domineering.<br/><br/>They had never felt such pressure, inducing an instinctive reverence in them.<br/><br/>Wen Li narrowed his eyes, looking towards the horizon, while the demonic shadows behind him stopped trembling and turned their heads in unison, restless and uneasy.<br/><br/>Even Li Tianjue in the distance, who had been reluctant to leave, felt that mysterious pressure.<br/><br/>The pressure seemed familiar to her, though she wasn’t sure if it was an illusion.<br/><br/>Suddenly thinking of someone, hope shone in her eyes.<br/><br/>Could it be him?<br/><br/>Boom—<br/><br/>The earth groaned and trembled, shaking the majestic Great Saint Mountain that had stood for ten thousand years—a commotion not caused by the previous battle.<br/><br/>Such might…<br/><br/>The hearts of the million cultivators from the Protecting Heaven Sect quickened, and an unrealistic idea rose in their minds.<br/><br/>There was a name that had recently been thunderous, the hope of the Protecting Heaven Sect and even the entire continent!<br/><br/>In their hearts, this name might carry even more weight than Shen Buhui.<br/><br/>They respected Shen Buhui, but when it came to the odds of overthrowing the Heaven’s Larceny Saint Sect, they felt that the name in their hearts held more hope!<br/><br/>A white rainbow shot from the ends of heaven and earth, stirring up a breathtaking wind, instantly dispersing the dust waves along its path, unstoppable.<br/><br/>Before anyone had time to see clearly, Wen Li’s purple robe violently fluttered, and the demonic shadow behind him flickered like a candle in the wind, almost extinguished.<br/><br/>All eyes turned to the space in front of Wen Li, where a figure appeared in the air, swathed in white aura, less than fifteen yards from Wen Li.<br/><br/>The newcomer was Fang Wang!<br/><br/>“It’s him!”<br/><br/>Li Tianjue thought excitedly, having never felt such surprise before.<br/><br/>Not just her, but other cultivators within the Protecting Heaven Sect who had seen Fang Wang before also plunged into immense joy.<br/><br/>“It’s Tian Dao Fang Wang!”<br/><br/>“The Grand Qi Sword Saint has come!”<br/><br/>“My heavens, wasn’t he in the Grand Lan Dynasty? That’s tens of thousands of miles away from here, across the Eight Directions Great Dynasty.”<br/><br/>“Could it be that the Sect Hierarch arranged this in advance?”<br/><br/>“Such a strong aura… can he defeat Wen Li?”<br/><br/>The name Fang Wang spread rapidly, with the Protecting Heaven Sect cheering and the Heaven’s Larceny Saint Sect panicking and restless.<br/><br/>The name Fang Wang held tremendous deterrent power for the Heaven’s Larceny Saint Sect because Saint Hong died at his hands, and despite Fang Wang’s wanton slaughter of their cultivators for a month, the Sect Hierarch had still not made a move against him, a stance that inevitably caused unease among the believers.<br/><br/>Wen Li’s gaze fell on Fang Wang, his hair still fluttering, the giant eye revealed on his chest also staring at Fang Wang, a red cicada crawled out from behind him, perching on his shoulder and fixing its gaze on Fang Wang.<br/><br/>Xiao Zi poked her head out from Fang Wang’s embrace, staring at the red cicada, and kept flicking her tongue.<br/><br/>As Wen Li scrutinized Fang Wang, Fang Wang likewise observed him.<br/><br/>Eyes met, and neither man showed fear in their gaze.<br/><br/>The state of Li Qingsong seemed to have no impact on Fang Wang; seeing this, Wen Li suddenly released his right hand, and Li Qingsong fell.<br/><br/>Fang Wang did not attempt to catch him, still focusing on Wen Li.<br/><br/>Then, Saint Spirit flew in carrying Shen Buhui, who glanced at Fang Wang with the corner of his eye, his mind shaking.<br/><br/>Who is this divine being?<br/><br/>Shen Buhui saw for the first time a man of such imposing presence; just standing there, he exuded an invincible aura that made Shen subconsciously believe this man to be the most powerful existence in the world!<br/><br/>Severely wounded, he couldn’t hear sounds, so he couldn’t identify Fang Wang.<br/><br/>Eventually, Wen Li broke the silence. Licking his lips, he smiled and said, “You’re Fang Wang? Such robust vitality. There are no signs of Nirvana on you, yet your presence already threatens my realm. It turns out there’s indeed fate.”<br/><br/>Fang Wang stared indifferently at him and said, “Wen Li, are you ready to embrace death? Would you prefer to die under my fist or by my sword?”<br/><br/>Arrogance!<br/><br/>His voice, unreserved, reached the ears of everyone—this was the feeling of all present.<br/><br/>Fang Wang wasn’t just showing off; he spoke this way to instill confidence in the Protecting Heaven Sect, to prevent the severely injured from dying instantly, and also to intimidate the followers of the Heaven’s Larceny Saint Sect.<br/><br/>Most importantly, he had the confidence to do it!<br/><br/>At his words, Wen Li froze, then burst into loud laughter, even clutching his belly.<br/><br/>Fang Wang raised his right hand, flipping his palm; he was deciding which side of his fist to use to kill Wen Li.<br/><br/>Wen Li suddenly lowered his head, glaring intensely at Fang Wang and said coldly, “I’ve always been waiting for a suitable vessel. Li Qingsong didn’t suffice, Shen Buhui is even less qualified. Fang Wang, you finally show up. You say you can kill me with one punch; let me feel your power.”<br/><br/>His voice trailing off, the demonic shadow behind him suddenly lunged at Fang Wang, growing rapidly, causing Xiao Zi to feel as if the heavens and earth instantly darkened.<br/><br/>Wen Li’s move was so swift that it left both sects’ cultivators too stunned to react.<br/><br/>Boom!<br/><br/>A terrifying punch wind dispersed Wen Li’s demonic shadow, sweeping along its path, almost hitting the Great Saint Mountain, extending to the ends of the earth and sky.<br/><br/>The cultivators from the Heaven’s Larceny Saint Sect felt as if they had just brushed past the gates of death, instinctively looking up to the sky, and then, everyone’s mouth hung open, their eyes unwittingly widened.<br/><br/>Even the blurred vision of Shen Buhui instinctively widened as he looked down, the Saint Spirit beneath him trembling slightly.<br/><br/>There, Fang Wang stood with his punching posture, and in front of him, only a white skeleton remained.<br/><br/>It was clearly Wen Li’s skeleton!<br/><br/>And every bone was covered in cracks, as if it would crumble at any moment.<br/><br/>Fang Wang slightly lifted his chin, looking down on Wen Li’s skeleton indifferently and said, “I only used thirty percent of my strength, and you couldn’t bear it. Is this the Heaven-Breaking Realm?”<br/><br/>The skeleton trembled violently, the cracks in the bones slowly healing, and wisps of blood reformed in the chest, rapidly coalescing into a giant eye. This eye, full of blood vessels, lost its former indifference, filled instead with terror.<br/><br/>“You… who exactly are you…” Wen Li’s voice rang out, tinged with fear.\t\t\t\t\t\t</div>", "images": {}, "success": true}