{"id": 219, "url": "https://www.novelhall.com/i-became-an-immortal-on-mortal-realm-32879/14518014.html", "title": "Chapter 219 - Chapter 219: Chapter 216: Supreme Saint Body, The Sword Immortal Emerges", "volume": 3, "volume_title": "Volume 3", "body": "<h1>Chapter 219 - Chapter 219: Chapter 216: Supreme Saint Body, The Sword Immortal Emerges</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 219: Chapter 216: Supreme Saint Body, The Sword Immortal Emerges<br/><br/>Translator: 549690339<br/><br/>Fang Wang had never heard of such a Great Saint Legacy before, but recalling his mother’s words, he said, “I’ll let The Three Immortals of the Emperor Sea take their chance. The Supreme Divine Record might be an extraordinary legacy, but if Fang Zigeng is unwilling, I must save him.”<br/><br/>Zhou Xue nodded and said, “It’s good to let them try, at least it will make the Supreme Sect Leader value Fang Zigeng more.”<br/><br/>Afterwards, Fang Wang asked her how she had been doing in the Emperor Sea.<br/><br/>Zhou Xue briefly recounted her experiences; Jin Xiao Sect had taken root in the Emperor Sea, even supporting a power regime. Since the dissolution of the Xuan Dynasty, many power regimes had risen in the Emperor Sea, ushering in a period of turmoil, which provided a great opportunity for Jin Xiao Sect.<br/><br/>Fang Wang listened with keen interest.<br/><br/>Once she had finished talking about Jin Xiao Sect, she began to speak, “You now carry several threads of Great Saint fate. In the future, you must be even more careful. Perhaps Fang Zigeng’s opportunity arises because of you. Those Great Saint wills hiding in the shadows have set their sights on you. Some are looking forward to your performance, while others are plotting against you.”<br/><br/>Fang Wang chuckled softly, “Meet the soldiers with a block, ward off the water with soil. There’s no escaping it anyway.”<br/><br/>“By the way, when will you be willing to tell me the name of that strongest being who possesses the Nine Lives Precious Spirit?”<br/><br/>According to Zhou Xue, among the nine Ascenders of the past, the strongest was the one who possessed the Nine Lives Precious Spirit, who could still stir up storms in The Upper Realm even after ascending.<br/><br/>Zhou Xue shook her head and said, “I can’t tell you. He’s not of your generation. One day, you will meet him. He’s not like Ji Rutian, who likes to scheme. Once he makes his move, he will surely attract the attention of the entire world.”<br/><br/>Fang Wang found her thoughts inscrutable and did not press further.<br/><br/>Could it be she thinks I’m not as good as the one with the Nine Lives Precious Spirit?<br/><br/>Thinking this, Fang Wang felt a surge of even greater motivation to cultivate.<br/><br/>The two talked for half an hour more before they left the Illusionary Realm.<br/><br/>Fang Wang immediately summoned The Three Immortals of the Emperor Sea, recounted the situation to them, and dispatched them to the Supreme Sect. The Three Immortals agreed without hesitation and set off that very day.<br/><br/>Fang Wang decided to take the rare opportunity to rest and to preach to Sword Heaven Marsh’s sword cultivators, not wishing to disappoint these people who had guarded this place for so many years.<br/><br/>… Emperor Sea, Supreme Sect.<br/><br/>Within a colossal island where lofty peaks soared into the clouds, at the foot of a mountain, Fang Zigeng sat cross-legged in meditation.<br/><br/>His hair was still white, fluttering in the wind. Compared to years ago, his skin appeared even more lustrous, making the otherwise plain-faced man seem quite striking.<br/><br/>A graceful figure descended from the sky, a woman in an azure lotus dress, her figure elegant and appearance stunning, like an immortal descended from the heavens, her eyes and brows exuding charm.<br/><br/>“Husband, you have been in arduous cultivation for five years. Why not take a break? Let me take you out for a walk?” Luo Yi said softly, her eyes filled with affection as she gazed at Fang Zigeng, her gaze tender enough to melt the hearts of most men.<br/><br/>Fang Zigeng did not even open his eyes as he said, “I only wish to cultivate. I advise you to cultivate more as well. With the Emperor Sea in turmoil and Great Cultivators emerging frequently, the more chaotic it becomes, the harder we must strive in cultivation.”<br/><br/>Luo Yi sat beside him, gently resting her head on his shoulder.<br/><br/>Fang Zigeng’s body stiffened slightly but he did not pull away.<br/><br/>“Husband, are you blaming me?” Luo Yi asked softly, eyes downcast.<br/><br/>Fang Zigeng did not respond.<br/><br/>Luo Yi continued, “You told me to wait for you until you are powerful, but exactly what realm counts as powerful, I can’t wait that long. And, by having you join the Supreme Sect, you could grow faster. Don’t worry, as long as I’m here for a day, my father won’t make things difficult for you, and I will even help you inherit his mantle. I have already secured a spot for you to temper the Supreme Saint Body. Even if it fails, it will transform your physical body.”<br/><br/>Fang Zigeng slowly opened his eyes, his gaze looking down at Luo Yi resting on his shoulder, his expression calm.<br/><br/>Suddenly reminded of something, Luo Yi asked, “Do you want to know the news about Tian Dao Fang Wang? I heard he’s done earth-shattering things again.”<br/><br/>“What things?” Fang Zigeng’s expression changed, asking curiously.<br/><br/>“A sect called Heaven’s Larceny Saint Sect emerged in the Descending Dragon Continent. The sect had six Nirvana Realm cultivators causing chaos across the continent, and Tian Dao Fang Wang single-handedly thwarted Heaven’s Larceny Saint Sect, even defeating the resurrected Thousand Eyes Great Saint.”<br/><br/>As she spoke, Luo Yi looked up at Fang Zigeng, her eyes filled with curiosity. “Does your Fang Family ancestry have some extraordinary background?”<br/><br/>Fang Zigeng smiled and said, “All I know is that without Fang Wang, there would be no Fang Family today, nor would there be the me of today.”<br/><br/>Seeing him smile, Luo Yi pouted and said, “I’ve found that you only smile when mentioning Fang Wang, but never mind. Once you’ve mastered the Supreme Saint Body and become the Supreme Sect Leader, you will thank me then.”<br/><br/>Upon hearing this, Fang Zigeng fell silent.<br/><br/>“Speaking of which, my father agreed to let you enter the Supreme Pond in part because of Fang Wang. He has already ordered gifts prepared, planning to send his adopted son to the Descending Dragon Continent to visit the Fang Family.”<br/><br/>Luo Yi mused, sensing her father’s shift in attitude ever since the news of Fang Wang’s victory over Thousand Eyes Great Saint arrived.<br/><br/>Fang Zigeng’s expression flickered slightly as he said, “I thank you and your father.”<br/><br/>Hugging his arm, Luo Yi said with a smile, “Husband, why thank me? I believe in you, that you will one day be stronger than Fang Wang. I am not wrong about people. You will definitely shake the world and surpass my father.”<br/><br/>“That’s impossible. I can’t compare to Fang Wang.”<br/><br/>Fang Zigeng shook his head, his voice even.<br/><br/>Luo Yi was about to speak when a white crane descended from the sky, landing in front of them with a female voice, “Miss, Yuan Xie, the chief disciple of Dragon Sect, has arrived. He comes with ill intentions and his likely target is your husband.”<br/><br/>Upon hearing this, Luo Yi’s expression changed, she stood up immediately, leaving a message before mounting the crane and leaving:<br/><br/>“Husband, you continue your cultivation, I’ll be back shortly.”<br/><br/>Fang Zigeng looked up, watching as the woman and crane disappeared over the other side of the mountain, his gaze growing cold as he murmured, “The Supreme Saint Body? A laughable mortal body. Can it compare to my Zhou Tian Daoist Skill?”<br/><br/>He closed his eyes and continued his cultivation practice.<br/><br/>After the Three Immortals of the Emperor Sea departed, Fang Wang lectured Sword Heaven Marsh’s sword cultivators for seven days before he continued his training. This matter spread throughout the Grand Qi Cultivation Realm and even across the entire continent, leading to an increasing number of visitors to Sword Heaven Marsh.<br/><br/>Two years later, Fang Bai also returned and spent his days deciphering swordsmanship by the lakeside, not interacting with others.<br/><br/>That same year, the Three Immortals of the Emperor Sea returned. They conveyed Fang Zigeng’s message to Fang Wang, assuring him not to worry as he hadn’t been forced into anything.<br/><br/>Since Fang Zigeng had said so, Fang Wang naturally stopped worrying and put the matter out of his mind.<br/><br/>The Three Immortals of the Emperor Sea left with laughter and chatter, looking rejuvenated after having sparred with the Supreme Sect Leader, as if they were experiencing a second spring, with plans to find a place for a brotherly duel in magic.<br/><br/>Fang Wang sent a message to Fang Bai to summon him.<br/><br/>“Why did you come back alone? Where is Fang Jing?” Fang Wang asked as he stood on the bridge, sizing up Fang Bai beside him.<br/><br/>After many years, Fang Bai clearly had suffered some kind of setback, lacking the spirit in his eyes he once had.<br/><br/>Fang Bai replied, “I was defeated by a sword cultivator and no longer desire to traverse the world. As for Fang Jing, he obtained a clue to an inheritance and thus has traveled northward to the sea.”<br/><br/>Fang Wang shook his head with a wry smile, “Just one failure, and you fall into such despondence?”<br/><br/>“He’s about the same age as me. I’ve received your Sword Dao inheritance, yet I couldn’t defeat him… I’ve shamed you!” Fang Bai said with red eyes, then knelt before Fang Wang.<br/><br/>“Ancestor Fang, please bestow upon me a stronger swordsmanship. I don’t want to lose again!” Fang Bai pleaded, forehead pressed against the bridge, teeth clenched.<br/><br/>Fang Wang looked down at him and asked, “You were defeated by a sword cultivator of your age? What’s his name?”<br/><br/>“He calls himself a Sword Immortal. I’m not aware of his origins. I was defeated by him in two sword strikes…”<br/><br/>Sword Immortal?<br/><br/>Quite the arrogance!<br/><br/>Fang Wang smiled and said, “Focus on mastering the Executioner Immortal Ghost God Sword. You haven’t truly mastered it yet. Once you do, you’ll be able to defeat him.”<br/><br/>Fang Bai looked up and hurriedly said, “He recognized my swordsmanship, saying that my Executioner Immortal Ghost God Sword is strong, but not as good as his.”<br/><br/>Upon hearing this, Fang Wang’s eyes narrowed.<br/><br/>Someone recognized the Executioner Immortal Ghost God Sword?<br/><br/>Seems like a significant background.<br/><br/>“Once you’ve mastered the Executioner Immortal Ghost God Sword, I’ll teach you an even more advanced swordsmanship. From now on, stay in Sword Heaven Marsh,” Fang Wang pondered and said.<br/><br/>Fang Bai nodded, got up to pay respects, and then departed.<br/><br/>Fang Wang turned to look at the lake, his lips curving slightly upward.<br/><br/>“It looks like this continent is about to change.”<br/><br/>Fang Wang mused to himself, sensing over the years various auras emerging from different directions of the continent, some dueling, some breaking through, all with significant cultivation levels, origins unknown.<br/><br/>He had a premonition that soon someone would come looking for him.<br/><br/>And he was not afraid.<br/><br/>After admiring the lake view for half an hour, Fang Wang continued his cultivation.<br/><br/>In the blink of an eye, another three years passed.<br/><br/>Fang Wang smoothly broke through to the Fourth Layer of the Mahayana Realm. Next, he chose not to integrate cultivation techniques but to cultivate until he reached the Nirvana Realm.<br/><br/>The Nirvana Realm could elevate the grade of his Lifespirit Treasures. He was curious to see if his seven Lifespirit Treasures would undergo a transformation.<br/><br/>In the autumn of that year, the surrounding peaks of Sword Heaven Marsh were tinged with desolation, creating a unique ambiance.<br/><br/>Leaves fell in abundance, sprinkling atop the lake surface, resembling little sprites dancing among the Ling Wu mist.<br/><br/>Fang Wang slowly opened his eyes, his gaze directed toward the opposite mountaintop.<br/><br/>He was somewhat puzzled.<br/><br/>Why do all those who come looking for trouble prefer to gaze down upon him from the opposite mountaintop?<br/><br/>“Now that you are here, won’t you announce your name?”<br/><br/>Fang Wang spoke, his tone calm.<br/><br/>The stranger had been present for half a stick of incense’s time, trying hard to suppress his aura, but he couldn’t escape Fang Wang’s perception.<br/><br/>Since the Three Immortals of the Emperor Sea were not in Sword Heaven Marsh, being out at sea sparring, apart from Fang Wang, no one else noticed the arrival of this person.<br/><br/>“I come from the Southern Celestial Sea, my name is Chen Shang. Hearing that Tian Dao has slain Nirvana Realm Great Cultivators and defeated the manifest Thousand Eyes Great Saint, I have come to seek guidance,” a cold voice echoed through Sword Heaven Marsh, prompting all cultivators to open their eyes and look in that direction.<br/><br/>Dugu Wenhun appeared out of nowhere behind Fang Wang, gazing at the figure atop the distant mountaintop, and said, “Chen Shang, you think you’re qualified to challenge Tian Dao? I advise you to leave quickly. Challenging Tian Dao is a death wish.”<br/><br/>Chen Shang, one of the Southern Celestial Four Heroes!<br/><br/>Born in the Soul Sculpting Realm, he nurtured a Heaven Yuan Spirit Treasure, but during his childhood, it was taken from him, and he remade the Heaven Yuan Spirit Treasure in the Spirit Elixir Realm.<br/><br/>Chen Shang was the most unique among the Southern Celestial Four Heroes, with a life full of battles, victories and defeats alike. While others grew stronger through cultivation, he grew stronger through battle.\t\t\t\t\t\t</div>", "images": {}, "success": true}