{"id": 214, "url": "https://www.novelhall.com/i-became-an-immortal-on-mortal-realm-32879/14497373.html", "title": "Chapter 214 - Chapter 214: Chapter 211: Undying And Indestructible, Sweeping Across Heaven Breaking", "volume": 3, "volume_title": "Volume 3", "body": "<h1>Chapter 214 - Chapter 214: Chapter 211: Undying And Indestructible, Sweeping Across Heaven Breaking</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 214: Chapter 211: Undying and Indestructible, Sweeping Across Heaven Breaking<br/><br/>Translator: 549690339<br/><br/>Good!<br/><br/>This single word rang out like the furious shout of Heavenly Gods, shaking the nine heavens and echoing endlessly.<br/><br/>Fang Wang and Thousand Eyes Great Saint exchanged glances and simultaneously vanished into thin air. In an instant, day and night switched as the star-filled sky disappeared, with the transition happening in the blink of an eye.<br/><br/>Before anyone could react, an overwhelmingly powerful gust bore down from the horizon, flipping many people over onto the ground.<br/><br/>Dugu Wenhun instinctively turned his head, his black hair whipped about by the fierce wind, his eyes filled with disbelief.<br/><br/>Thousands of miles away, Thousand Eyes Great Saint raised his right palm, from which countless eyes spat out an uncountable shower of arrows made of ice. The massive onslaught was like a glacial river from ancient times, covering hundreds of miles.<br/><br/>Fang Wang’s face was filled with an excited smile. Behind him, the Heavenly Emperor Avatar wielding the Heavenly Palace Halberd’s shadow swung ceaselessly, warding off the vast torrent of arrows.<br/><br/>The Heavenly Emperor Avatar had a thousand arms, using only one to block Thousand Eyes Great Saint’s attack.<br/><br/>The eyes on Thousand Eyes Great Saint’s face flickered with cold light before he suddenly disappeared.<br/><br/>Almost instantaneously, he appeared in front of Fang Wang and struck his chest with a palm. Accompanied by a thunderous boom, a fearsome Yang Energy burst forth, flinging him away.<br/><br/>Fang Wang raised his eyebrows, feeling a powerful sealing force entering his body, causing his Spiritual Power to stall momentarily. Fortunately, his Vajra Invincible Saint Body was strong enough to directly dispel Thousand Eyes Great Saint’s sealing spell with Yang Energy.<br/><br/>Thousand Eyes Great Saint’s expression shifted, but he did not cease his assault. He continuously struck with his palms, moving with agility, as if endless incarnations of Thousand Eyes Great Saint charged at Fang Wang in succession, relentless, each palm strike incredibly powerful.<br/><br/>For the first time, Fang Wang felt the weight of such a heavy palm and grew even more exhilarated.<br/><br/>The two continued their fight, shifting positions. Each exchange sent them hurtling hundreds of miles apart, and wherever they passed, dust billowed and mountains trembled.<br/><br/>Thousand Eyes Great Saint kept changing his spells and Divine Skills, now summoning thunder, now distorting space to suppress, now making Fang Wang’s view erratic and unpredictable, but Fang Wang, with his Combat Heart, remained utterly unaffected.<br/><br/>One of the Heavenly Emperor Avatar’s arms suddenly produced The Six Harmonies and Eight Desolations Seal. The golden seal grew to a thousand feet in size, smashing down on Thousand Eyes Great Saint like a mountain.<br/><br/>An eye on Thousand Eyes Great Saint’s forehead burst forth with a Cang wood, which rapidly grew and split into countless branches, swiftly wrapping around The Six Harmonies and Eight Desolations Seal, preventing it from falling.<br/><br/>Then, the Rainbow Sword, Qiankun Fan, and Reincarnation Bell appeared one after another, each falling into the hands of the Heavenly Emperor Avatar, resembling the Magic Artifacts of Heavenly Gods, each displaying their divine skills with absolute domineering presence.<br/><br/>Thousand Eyes Great Saint leaped into the air, transforming into a thousand-foot-tall figure. He swept his arm toward Fang Wang, his arm’s numerous eyes unleashing myriad Divine Skills that caused the land to shimmer with seven-colored glows and the ground to reflect images of lotuses, fierce beasts, lightning, and mountain shadows.<br/><br/>Throughout the intense battle, they moved rapidly, inciting fear and despair in cultivators, monsters, and common folk along their path.<br/><br/>Fang Jing, Fang Bai, and other Protecting Heaven Sect cultivators were pinned to the ground by the gusts. As they looked up, they could not make out the movements of the Heavenly Emperor Avatar and Thousand Eyes Great Saint, seeing only their vague silhouettes. Even so, they were profoundly shaken.<br/><br/>Is this the level a cultivator can achieve?<br/><br/>Fang Wang and Thousand Eyes Great Saint fought high in the sky, and despite their best efforts to avoid letting their spells reach the ground, the sheer force of their presence made the earth tremble, sand fly, and lakes surge.<br/><br/>Fang Bai’s eyes widened as he looked towards the sky, where the two figures fought like creators of the cosmos, his heart surging with emotions.<br/><br/>A cultivator should aspire to such heights!<br/><br/>Not just him, all who witnessed this battle felt a mix of shock, admiration, and boundless hope.<br/><br/>Fang Wang’s Heavenly Emperor Avatar once again brought forth a Lifespirit Treasure, the Heaven Bound Golden Silk.<br/><br/>One arm of the Heavenly Emperor Avatar waved the Heaven Bound Golden Silk, sweeping across the sky, scattering clouds in every direction and striking Thousand Eyes Great Saint, rapidly binding him.<br/><br/>As the Heaven Bound Golden Silk contracted, it pulled Thousand Eyes Great Saint close, and Fang Wang, seemingly tiny as an ant, threw a punch.<br/><br/>Nine Dragons Tyrant Fist!<br/><br/>Sing!<br/><br/>The World-ending Black Dragon roared forth, piercing Thousand Eyes Great Saint’s chest, and with that, Thousand Eyes Great Saint vanished into smoke.<br/><br/>Fang Wang did not let his guard down. He turned and threw another punch, and another black dragon emerged to attack, but this time, Thousand Eyes Great Saint sidestepped, brushing past the dragon as his left palm struck towards the Heavenly Emperor Avatar, a golden Sword Blade emerging from the center of his palm.<br/><br/>Boom—<br/><br/>The chest of the Heavenly Emperor Avatar was pierced through, the sheer force causing Fang Wang’s physical body to tremble.<br/><br/>The smile on Fang Wang’s face grew even richer; he wasn’t troubled by Thousand Eyes Great Saint’s strength, but found it extremely exciting instead.<br/><br/>After cultivating for twenty thousand years, he had never before fought so freely and intensely!<br/><br/>The expression on Thousand Eyes Great Saint grew more somber, and even though his face was full of eyes, one could see how heavy his heart was.<br/><br/>“Descending Dragon Great Saint, Hongxuan Emperor… and the Vajra Invincible Saint Body created by Grand An Divine Emperor! What good fortune!”<br/><br/>While wielding his Divine Skills, Thousand Eyes Great Saint murmured in a deep voice.<br/><br/>In the tempest, Fang Wang’s hair flew wildly, his white robes flapped dramatically, and he held the Heavenly Palace Halberd aloft, laughing loudly, “Good fortune is indeed good, but Great Saint, you have much more than me. It seems a legacy is not about having more, but rather about having quality!”<br/><br/>The Heavenly Emperor Avatar, with the shadow of the Heavenly Palace Halberd clenched in its hand, smashed down in anger. Thousand Eyes Great Saint, towering at a thousand feet, couldn’t evade in time. He was sent flying, his motion stirring up a pressure wave that swept across a million miles. Trees whipped up a green tidal wave that sent countless leaves and dust spiraling into the Firmament.<br/><br/>Thousand Eyes Great Saint leaped over mountains, lakes, and rivers, suddenly stabilizing his figure. His chest’s skin split open to reveal a massive eye, which erupted with dreadful black light. The pupil released an endless destructive aura that charged headlong towards Fang Wang.<br/><br/>Clang—<br/><br/>The Heavenly Emperor Avatar used the Reincarnation Bell to block the attack, black light igniting strands of black flames on the surface of the bell, setting the firmament ablaze. Fang Wang’s forward momentum was shaken, and he came to a stop.<br/><br/>Hundreds of miles away, atop a mountain, The Three Immortals of the Emperor Sea appeared out of thin air before a cliff, gazing at the distant battle with expressions of shock on their faces.<br/><br/>“That’s the avatar of the Heavenly Emperor Imperial Mirror!”<br/><br/>“Our master is so powerful, who is his enemy if not Wen Li?”<br/><br/>“With so many eyes, could it be the legendary Thousand Eyes Great Saint?”<br/><br/>The Three Immortals of the Emperor Sea had been roaming the north for years. They had once intruded into a branch of the Heaven’s Larceny Saint Sect, nearly killed by Wen Li, and since then, they dared not act rashly and began to engage in acts of salvation.<br/><br/>They had lived for so many years, seen much and knew much, but they had never witnessed a battle so intense and magnificent.<br/><br/>Both Fang Wang and the Thousand Eyes Great Saint displayed combat prowess far beyond the Nirvana Realm.<br/><br/>On the faces of the three immortals, light constantly shifted colors, indicating the display of different spells.<br/><br/>Suddenly, the Three Immortals of the Emperor Sea’s expressions changed dramatically as they saw the Thousand Eyes Great Saint getting blasted above their heads by Fang Wang, making them feel as though the heavens and the earth darkened in an instant.<br/><br/>Looking up, the Thousand Eyes Great Saint was still two thousand feet away from them, yet even this distance made them feel the breath of death.<br/><br/>Fang Wang, accompanied by the Heavenly Emperor Avatar, assaulted with overwhelming force, while the Thousand Eyes Great Saint raised his arms, radiating dazzling bright light. In an instant, The Three Immortals of the Emperor Sea were blinded, and Fang Wang sensed a mighty Yin and Yang energy tugging at him.<br/><br/>The Thousand Eyes Great Saint intended to pull him into the Underworld!<br/><br/>Moving with the intention, Fang Wang allowed himself to be pulled along.<br/><br/>Once the blinding light faded, the surrounding heavens and earth remained the same except The Three Immortals of the Emperor Sea were nowhere to be seen, leaving only Fang Wang and the Thousand Eyes Great Saint. Compared to the Mortal Realm, this world was dark with no sun in the sky.<br/><br/>Fang Wang stopped and asked, “Does each of the eyes on your body represent a different Divine Skill?”<br/><br/>The Thousand Eyes Great Saint sneered in response, “Correct, the eyes on this saint’s body belong to one thousand Great Saints and Great Emperors. Unfortunately, my true body is suppressed, and I can only manifest through an avatar.”<br/><br/>So exaggerated?<br/><br/>Narrowing his eyes, Fang Wang then asked, “The power of the Saint Spirit is clearly unrealistic; do you intend to use its power to resurrect your true body?”<br/><br/>Upon hearing this, the Thousand Eyes Great Saint burst into angry laughter.<br/><br/>“Resurrect my true body? This saint is immortal, why would I need to be resurrected? Youngster, only when you become a Great Saint will you understand what this saint is plotting. But you won’t have that chance. If the Heavenly Emperor Avatar is your strongest forte, then are you ready to die?”<br/><br/>As the words of the Thousand Eyes Great Saint fell, the thousand eyes on his body opened wide. In an instant, the entire firmament was covered with giant eyes, as numerous as stars, all staring intensely at Fang Wang, emitting various terrifying auras.<br/><br/>The Heavenly Emperor Avatar behind Fang Wang disappeared, as did the Heavenly Palace Halberd. He pulled out the Rainbow Sword, and thirty-six Ghostly Divine Spirits appeared out of nowhere, facing the firmament in all directions.<br/><br/>“The Executioner Immortal Ghost God Sword? No, why do you have so many ghostly spirits?” the Thousand Eyes Great Saint asked gravely.<br/><br/>Fang Wang grew more curious about the Thousand Eyes Great Saint. This saint, who had disappeared a hundred thousand years ago, knew about the Hongxuan Emperor from fifty thousand years ago and the Descending Dragon Great Saint from ten thousand years ago, and now even the secret techniques of the Executioner Immortal Great Saint.<br/><br/>Dangerous!<br/><br/>No more holding back!<br/><br/>Fang Wang’s voice followed, “Inherited from the Executioner Immortal Ghost God Sword, but this is the Zhu Xian Jing Hong Sword I created!”<br/><br/>He swung the sword, and almost simultaneously, the thirty-six Ghostly Divine Spirits swung their swords in unison.<br/><br/>It was not just one swing of their swords, but a rapid succession of crazed slashes, with waves of domineering Ghostly Divine Sword Qi constantly striking out in all directions of heaven and earth.<br/><br/>The Thousand Eyes Great Saint realized something was amiss and hastily dodged but the speed and density of the Ghostly Divine Sword Qi were too fast. After avoiding it numerous times, he had to use Divine Skills to defend.<br/><br/>Boom! Boom! Boom…<br/><br/>The Underworld was bombarded with the frenzied onslaught of the Zhu Xian Jing Hong Sword, leaving the Thousand Eyes Great Saint horrified that these sword energies were not erratic attacks, but all targeted towards his eyes.<br/><br/>Each of his teleportation jumps via Divine Skills landed him under a giant eye in the sky, and as one after another giant eye avatar was extinguished, his own strength was affected as well.<br/><br/>“How can this be… How can he discern illusion from reality…” The Thousand Eyes Great Saint shouted inside his mind.<br/><br/>He had previously manifested this avatar in the Mortal Realm to confound Fang Wang, but this time, he poured his soul’s will into the Thousand Eyes Avatar, making the giant eyes in the sky no longer an illusion.<br/><br/>Fang Wang’s Heavenly Dao True Skill allowed his Combat Heart to exceed the sensitivity of the True Combat Technique, unleashing killing intent without restraint.<br/><br/>No matter how many Divine Skills the Thousand Eyes Great Saint used, he just couldn’t resist the Ghostly Divine Sword Qi when Fang Wang went all out!<br/><br/>As one giant eye after another was eradicated in the firmament, the Thousand Eyes Great Saint’s momentum plummeted.<br/><br/>“How can the gap be so wide… Can the Mahayana Realm really sweep the Heaven-Breaking Realm? And he’s up against me…”<br/><br/>The eyes on the Thousand Eyes Great Saint’s face all revealed a look of terror, then his figure vanished within the vast expanse of Ghostly Divine Sword Qi.\t\t\t\t\t\t</div>", "images": {}, "success": true}