{"id": 210, "url": "https://www.novelhall.com/i-became-an-immortal-on-mortal-realm-32879/14492819.html", "title": "Chapter 210 - Chapter 210: Chapter 207: Descending Dragon Formation, Someone Is Coming", "volume": 3, "volume_title": "Volume 3", "body": "<h1>Chapter 210 - Chapter 210: Chapter 207: Descending Dragon Formation, Someone Is Coming</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 210: Chapter 207: Descending Dragon Formation, Someone is Coming<br/><br/>Translator: 549690339<br/><br/>Generation after generation has become weaker!<br/><br/>The words of the Saint Spirit with three heads and six arms echoed between heaven and earth, especially the last six words, which struck the hearts of the Protecting Heaven Sect cultivators like a heavy hammer.<br/><br/>Over a million Protecting Heaven Sect cultivators looked towards the Saint Spirit with three heads and six arms in despair.<br/><br/>Before coming here, they had already lent their fate to Shen Buhui. Facing the Heaven’s Larceny Saint Sect, Shen Buhui initially displayed an inspiring aura that uplifted them, an aura of strength they had never felt before. But this inspiration was completely shattered with the arrival of the Saint Spirit.<br/><br/>Shen Buhui was actually suppressed by a mere raise of the Saint Spirit’s hand; even though they all collectively channeled their Spiritual Power to support Shen Buhui, they still could not shake the Saint Spirit.<br/><br/>At this moment, everyone could feel the power of the Saint Spirit; they only felt their own Spiritual Power resisting against the entire sky.<br/><br/>When the entire sky presses down, how could the beings of the Mortal Realm resist?<br/><br/>Shen Buhui clenched his teeth fiercely. He was feeling the pressure most acutely and could not believe that his current strength was unable to shake the Saint Spirit of the Heaven’s Larceny Saint Sect!<br/><br/>On the side of the Heaven’s Larceny Saint Sect, everyone looked fanatically at the silhouette of the Saint Spirit, as if looking up to a deity.<br/><br/>Saint Hong and the other three Saint Venerates all displayed a sneer. A motley crew thinking to shake the foundation that the Heaven’s Larceny Saint Sect had built up for hundreds of years?<br/><br/>“Saint Spirit, why not take action and exterminate them?” urged Saint Hong.<br/><br/>Upon hearing this, the head on the left side of the Saint Spirit turned towards him, gazing down with an indifferent look, and asked, “Are you ordering me?”<br/><br/>Saint Hong’s face instantly turned ugly, and he said in a deep voice, “Don’t forget the Hierarch’s command!”<br/><br/>The Saint Spirit turned back, and its right hand slowly pressed down.<br/><br/>Boom—<br/><br/>The wasteland trembled violently, raising a magnificent wave of dust that engulfed the million Protecting Heaven Sect cultivators. Shen Buhui’s right arm bent instantly, shattered the ground beneath his feet, and his face was painted with the color of pain.<br/><br/>Hundreds of miles away, behind a stretch of clouds, Li Tianjue stood on a golden compass with her eyebrows tightly knitted.<br/><br/>Li Tianjue dared not confront Wen Li any longer due to the terrifying experience she faced with Li Qingsong years earlier. Shen Buhui didn’t press her either, after all, she wasn’t from this continent, and even her indirect guidance was a benevolent act.<br/><br/>She looked from afar at the figure of the Saint Spirit, her eyes filled with confusion. She had heard what the Saint Spirit had said just now.<br/><br/>“How could it recognize the All-Encompassing Breath Technique? Could it be related to the Descending Dragon Mountain?”<br/><br/>Li Tianjue’s heart was filled with unease. Shen Buhui was clearly no match for the Saint Spirit. If things continued as they were, the situation was dire.<br/><br/>Although she had no romantic feelings for Shen Buhui, they had spent so many years together. Seeing Shen Buhui facing mortal danger, she couldn’t help but feel anxious.<br/><br/>But what use was anxiety?<br/><br/>Even if she took action, it would only mean sending one more soul to its death.<br/><br/>“Get away—”<br/><br/>A voice roared exhaustingly loud, only to see Shen Buhui’s barrier of Spiritual Power suddenly expand, pushing upward against the Saint Spirit’s palm force.<br/><br/>This roar invigorated the spirits of the million Protecting Heaven Sect cultivators; they looked towards the front. The dust cloud couldn’t hide Shen Buhui’s figure; he soared upward at the forefront, his body bursting into flames, the blinding light of fire becoming the brightest existence between heaven and earth.<br/><br/>It was not flames, but blood transformed!<br/><br/>Shen Buhui’s robes were torn, veins bulged on his forehead, his skin cracked and bled continuously; fate re-condensed on him into a feathered garment, his momentum soared by leaps and bounds, shaking heaven and earth, even the majestic Great Saint Mountain trembled in response.<br/><br/>The Demonic Cultivators of the Heaven’s Larceny Saint Sect in the sky were moved and began discussing fervently.<br/><br/>“What Secret Technique is this?”<br/><br/>“Such a terrifying aura, it seems like the Heavenly Might one would only encounter during a tribulation…”<br/><br/>“It seems the Lord of the Protecting Heaven Sect isn’t going down so easily.”<br/><br/>“It’s just a futile struggle. He’s definitely not a match for the Saint Spirit.”<br/><br/>“Presumably, he has used some kind of Secret Technique, preparing to fight to the death.”<br/><br/>The three pairs of eyes of the Saint Spirit focused on Shen Buhui, a hint of surprise flickering in them.<br/><br/>With a boom!<br/><br/>Shen Buhui suddenly burst through the Spiritual Power of both sides, his right hand unknowingly condensed into a long sword, stabbing forward with extreme speed.<br/><br/>The four Great Saints didn’t have time to react; the Saint Spirit hastily twisted its body, but still Shen Buhui sliced off one of its arms.<br/><br/>Shen Buhui then stopped, swinging his sword towards the Saint Spirit. At this moment, his face was covered in blood, a layer of light clothing draped over him, the white light of the feathered garment gradually dyed with blood.<br/><br/>He swung his sword rapidly, creating countless afterimages, all of them Shen Buhui’s figure, as if they were Sword Qi clones, simultaneously swinging out Sword Qi from all directions, engulfing the Saint Spirit.<br/><br/>The Saint Spirit vanished on the spot, forcing the four Great Saints to hastily channel their powers to defend. The countless Sword Qi struck them, bursting into a magnificent surge of energy in the sky, sweeping across the Firmament, like a sea under a storm, with waves roaring and raging.<br/><br/>Shen Buhui then turned and quickly moved to attack the Saint Spirit, which was a hundred miles away.<br/><br/>The three faces of the Saint Spirit showed a mocking, contemptuous smile as the arm Shen Buhui had cut off grew back. The six arms were stretched out, each palm coalescing a black pearl. Facing the approaching Shen Buhui, the Saint Spirit pushed forward with all six hands, the black pearls bursting with immense Demonic Qi.<br/><br/>At a glance, it looked like a giant black blossom blooming in the sky, obscuring the sun. From within the black blossom erupted countless indistinguishable Demonic Spirits, all riding fierce horses and clad in armor, their figures like a charging army of thousands, unstoppable.<br/><br/>Shen Buhui, his eyes now filled with blood, held the sword in his right hand forward, while his left hand quickly forming a spell at his waist and tapping on the sword handle. All his Spiritual Power poured into the sword blade, turning the long sword into an ultimate streak of white light, piercing through the Demonic Spirit army.<br/><br/>Crack!<br/><br/>The Saint Spirit raised its hand and caught Shen Buhui’s long sword, the sword trembling but unable to break free.<br/><br/>“Interesting, but this is your limit.”<br/><br/>The voice of the Saint Spirit rang out, inflaming Shen Buhui’s eyes with a surge of murderous intent.<br/><br/>He charged at the Saint Spirit once again, engaging in an earth-shattering great battle. One man and one spirit, soaring into the skies and burrowing into the earth, their speed so fast that the cultivators from both sects could hardly keep up with them.<br/><br/>The four Great Saints emerged from the midst of the Sword Qi, looking exceedingly disheveled with their hair in disarray and injuries all over their bodies, indicating just how powerful Shen Buhui’s sword strike had been.<br/><br/>In the distance.<br/><br/>Li Tianjue’s beautiful eyes widened, amazed by Shen Buhui’s performance.<br/><br/>How could he possess such strength?<br/><br/>In both momentum and speed, Shen Buhui’s performance far exceeded his usual state, even seeming to be stronger than the Saint Venerate of Heaven’s Larceny Saint Sect.<br/><br/>“He is sacrificing his own life.”<br/><br/>A voice came from behind, causing Li Tianjue to turn her head and then joyfully call out, “Master!”<br/><br/>Li Qingsong, holding a horsetail whisk, was seen flying swiftly towards her, stopping beside her.<br/><br/>“Master, you…” Li Tianjue’s eyes reddened as she looked at her master, her heart swirling with a multitude of emotions.<br/><br/>Li Qingsong looked into the distance, saying, “The person you’ve chosen is not bad. Although not powerful enough, such valor does not disgrace the face of Great Saint Mountain.”<br/><br/>Li Tianjue smiled, about to speak, when Li Qingsong began to cast a spell.<br/><br/>“Tianjue, leave. Wen Li has already arrived. I am preparing to embrace death alongside Shen Buhui to fight for more time,” Li Qingsong said calmly. In his right hand, he held the horsetail whisk, seemingly writing in mid-air, while his left hand continually changed seals, strands of visible white mist exuding from his body.<br/><br/>Upon hearing this, Li Tianjue instantly became anxious and asked urgently, “Master, why must you embrace death, and what time are you trying to fight for?”<br/><br/>Li Qingsong answered, “Someone is coming.”<br/><br/>“Who?”<br/><br/>Boom!<br/><br/>Li Qingsong suddenly unleashed a formidable aura, flinging Li Tianjue away. With his burst of aura, those from Heaven’s Larceny Saint Sect far in the distance took notice of his presence.<br/><br/>“It’s that old fellow!”<br/><br/>Saint Hong glared at Li Qingsong, his face contorted with hatred in his eyes.<br/><br/>He had fought Li Qingsong before and had he not been saved by the Sect Hierarch in time, he might have died at Li Qingsong’s hands.<br/><br/>The four Great Saints immediately rushed towards Li Qingsong, but as they set off, the ground trembled violently, cracks appearing on the surface, startling the cultivators of the Protecting Heaven Sect into soaring into the sky. They watched as streams of Earth Spirit Qi burst out like volcanic eruptions, dispersing the dust and debris between heaven and earth.<br/><br/>The Saint Spirit noticed this scene, frowning.<br/><br/>“Descending Dragon Formation, it seems I have underestimated your status at Great Saint Mountain,” a cold voice echoed through the heavens and earth, sending chills to everyone as if they were in a frigid cellar.<br/><br/>Wen Li!<br/><br/>Hearing his words, Li Qingsong’s expression remained calm as he spoke, “Wen Li, although I do not know your connection with Great Saint Mountain, countless misdeeds will lead to your own destruction. The path you walk is not permitted by the Heavenly Dao.”<br/><br/>“The Heavenly Dao does not permit? Laughable. Even if the Heavenly Dao does not permit, does that mean you can face the Heavenly Dao?” Wen Li’s voice rang out again, this time accompanied by an overwhelming murderous intent that penetrated the heavens and the earth.<br/><br/>Whoosh! Whoosh!<br/><br/>Fang Wang and Dugu Wenhun streaked under the firmament, with Dugu Wenhun frowning and saying, “That seems to be the ‘Descending Dragon Formation’ of Great Saint Mountain.”<br/><br/>Xiao Zi was coiled on Fang Wang’s shoulder, turned her head, and asked, “Is it powerful?”<br/><br/>Dugu Wenhun replied, “I once saw Li Qingsong use it when I was listening to lectures at the East Immortal Sea. It allows one to harness nature’s spiritual energy, temporarily boosting strength, but the longer it is used and the greater the strength is boosted, the greater the toll on the body. According to Li Qingsong, if one is strong enough, they could even harness the Spiritual Energy of the entire Mortal Realm.”<br/><br/>Hearing this, Xiao Zi muttered, “Why does Great Saint Mountain have so many methods that borrow from others and the powers of nature?”<br/><br/>Dugu Wenhun said, “When one’s cultivation reaches the limit of their innate potential, naturally they can only seek methods beyond themselves. Great Saint Mountain’s ability to borrow the power of heaven and earth is what allows their teachings to endure.”<br/><br/>He glanced at Fang Wang, wanting to say something but then held back.<br/><br/>“Dugu Wenhun, I’m going ahead.”<br/><br/>Fang Wang left that remark behind and suddenly accelerated, turning into a white rainbow that quickly vanished over the horizon.<br/><br/>So fast!<br/><br/>Dugu Wenhun was inwardly shocked. He sped up too, but no matter how fast he went, he could no longer see Fang Wang’s figure.<br/><br/>Within the white light, Xiao Zi burrowed into Fang Wang’s embrace, then poked out her head and raised her eyes to ask, “My lord, there are so many powerful presences ahead. Can the Protecting Heaven Sect really withstand them?”<br/><br/>Fang Wang looked ahead, his voice soft, “They cannot. This battle has been staged for me.”<br/><br/>He had already felt the presences of Wen Li, Li Qingsong, and others, among which Wen Li’s presence dwarfed the rest.<br/><br/>With such a disparity in strength, if it were him, he could end the war in an extremely short period. But Wen Li had not done so.<br/><br/>Fang Wang faintly guessed Wen Li’s intentions, and his eyes gradually turned cold.<br/><br/>He hoped Wen Li’s strength would not disappoint him!\t\t\t\t\t\t</div>", "images": {}, "success": true}