{"id": 218, "url": "https://www.novelhall.com/i-became-an-immortal-on-mortal-realm-32879/14500433.html", "title": "Chapter 218 - Chapter 218: Chapter 215: Two Hours, Supreme Divine Record", "volume": 3, "volume_title": "Volume 3", "body": "<h1>Chapter 218 - Chapter 218: Chapter 215: Two Hours, Supreme Divine Record</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 218: Chapter 215: Two Hours, Supreme Divine Record<br/><br/>Translator: 549690339<br/><br/>After Li Qingsong and his companions left, Fang Wang’s life became tranquil again, as he focused on comprehending the cultivation techniques.<br/><br/>Three months later, Fang Hanyu traveled south to visit him, declaring his intention to continue adventuring through the world.<br/><br/>Fang Wang handed over the token of Biyou Island to Fang Hanyu, who did not refuse. The brothers shared a jug of wine, and after drinking heartily for several hours, Fang Hanyu left, reeking of alcohol.<br/><br/>In the following years, Fang Family members would frequently visit, and every year Fang Wang would return home to spend a few days with his mother.<br/><br/>Four years later, he finally achieved enlightenment.<br/><br/>Heavenly Dao Xuan Gong combined with the Great Celestial Infinite Scripture, he had already thought of a new name for it.<br/><br/>Heavenly Dao Immensity Scripture!<br/><br/>Fang Wang cultivated in the Heavenly Palace for six hundred years, bringing the Heavenly Dao Immensity Scripture to Great Perfection.<br/><br/>The profundity of the Great Celestial Infinite Scripture lay in the depth of stored Spiritual Power, but it did not bring about an essential change in the nature of Spiritual Power, so its practice demanded less time than the cultivation of the Heavenly Dao Xuan Gong.<br/><br/>By the time Fang Wang opened his eyes, his entire demeanor had changed, his eyes exuding an immense pressure.<br/><br/>The Heavenly Gang Saint Body Technique, True Combat Technique, Yin Yang Xuan Ming Zhen Gong, Solaris Scripture, and the Great Celestial Infinite Scripture—each of these five supreme teachings could benefit one for a lifetime, even giving one the qualification to strive for the pinnacle of the Mortal Realm. He had amalgamated these five teachings to create the tremendously powerful Heavenly Dao Immensity Scripture, and the transformation this brought to him was significant.<br/><br/>Fang Wang began to operate his power.<br/><br/>Boom—Boom—Boom—<br/><br/>The familiar extraordinary phenomenon of heaven and earth descended once again, but Fang Wang remained unmoved, voraciously devouring nature’s spiritual energy.<br/><br/>The absorption rate of Spiritual Energy by the Heavenly Dao Immensity Scripture far surpassed that of the Heavenly Dao True Skill. In an instant, the Spiritual Energy of Sword Heaven Marsh surged into his body, alarming all cultivators.<br/><br/>As the phenomenon appeared, the Sword Cultivators began to discuss amongst themselves.<br/><br/>“With such Heavenly Might, could it be that the previous incidents were also caused by the Sword Saint?”<br/><br/>“Definitely! If it were really the Heaven’s Larceny Saint Sect making a comeback, why has there been no movement over the years?”<br/><br/>“Elder Fang is truly remarkable; the commotion caused by his cultivation is terrifying.”<br/><br/>“To me, Sword Heaven Marsh seems extraordinary. The speed at which Elder Heavenly Dao absorbs Spiritual Energy is terrifying, yet it did not drain Sword Heaven Marsh dry in an instant.”<br/><br/>“One can hardly imagine how strong Elder Heavenly Dao will be at five hundred years of age, let alone a thousand…”<br/><br/>Although they were influenced by Fang Wang, not a single Sword Cultivator complained; on the contrary, they were excitedly discussing the developments.<br/><br/>Those who came to Sword Heaven Marsh were all admirers of Fang Wang. Compared to their daily arduous practice and comprehension of the sword, they were more eager to receive guidance from Fang Wang.<br/><br/>Now, with such momentum from Fang Wang, it seemed like he was on the verge of a breakthrough, making them wonder if he would instruct them in the Celestial Sword Intent after his breakthrough.<br/><br/>This time, the extraordinary phenomenon lasted for two full hours.<br/><br/>The Great Celestial Infinite Scripture allowed one’s Spiritual Power to grow a thousandfold, and Fang Wang’s Spiritual Power had already been boosted by it. When he completed the Heavenly Dao Immensity Scripture, his Spiritual Power surged once again.<br/><br/>The feeling was too wonderful!<br/><br/>Not only did his Spiritual Power surge, but his rate of Spiritual Energy absorption also greatly exceeded that of the past, and he could feel the endless Earth Spirit Qi as well.<br/><br/>Sword Heaven Marsh was like a gaping hole on the surface of the earth, with endless Earth Spirit Qi gushing from beneath, furiously entering his body. No matter how terrifying his rate of absorption, Sword Heaven Marsh could satisfy him.<br/><br/>Chu Yin stepped out of the loft, gazing from afar at Fang Wang with utmost admiration in his eyes.<br/><br/>Due to his innate physical talent, his Spiritual Power was thousands of times that of those in the same realm, and this gap was still growing. His rate of Spiritual Energy absorption was equally monstrous, yet when compared to his master’s, he fell far behind.<br/><br/>He even suspected that his master’s physique might share the same characteristics as his or even surpass his own.<br/><br/>Even if that were true, it would be normal. In his eyes, his master was the foremost genius and the most powerful being in the world.<br/><br/>After seven consecutive days of cultivation, Fang Wang deliberately slowed down to allow other cultivators in Sword Heaven Marsh to practice peacefully.<br/><br/>Like this, another three years passed.<br/><br/>Fang Wang advanced to the third level of the Mahayana Realm. Many years had passed since the disturbance caused by Heaven’s Larceny Saint Sect, and the continent had regained its vitality, with more and more young cultivators and heroic figures gaining renown.<br/><br/>Fang Jing and Fang Bai became the most dazzling figures among the youth of Grand Qi, both having reached the Profound Heart Realm and sweeping through all opponents unbeaten.<br/><br/>Fang Jing, with the Nine Dragons Tyrant Fist, which he had yet to master completely, had made a tremendous name for himself. He was bold enough to proclaim the name of the fist technique, which was regarded by the world as the number one fist technique.<br/><br/>Fang Bai, with his excellent talent for Sword Dao, was called the Sword Saint’s Successor. Everyone believed that the title of Sword Saint no longer suited Fang Wang and surmised that with Fang Wang’s Sword Dao inheritance, Fang Bai would surely become the next Sword Saint.<br/><br/>On this day,<br/><br/>Fang Wang returned to the Fang Residence with Xiao Zi, chatting with his mother, Lady Jiang, in the courtyard.<br/><br/>Lady Jiang, who was almost two hundred years old, looked quite well. Although her cultivation talent was extremely mediocre, with the aid of various Heavenly Materials and Earthly Treasures, her lifespan had been greatly extended.<br/><br/>Fang Wang’s sister, Fang Ling, was also there, chattering non-stop about the tales of the Southern Celestial Sea.<br/><br/>As Fang Wang’s name was well-known throughout the Southern Celestial Sea, many factions paid close attention to him. Consequently, his great battle with the Heaven’s Larceny Saint Sect had also spread across the seas. Because of him, the information barrier between the mainland and the Southern Celestial Sea was diminishing, and the entire continent was thriving.<br/><br/>“Xu Qiuming was besieged by seven kings of the Demon Palace. To save the lives of the island’s inhabitants, Xu Qiuming did not flee. He fought bitterly for a whole day and slew all seven kings. The entire Demon Palace is now hunting him down. Many people think Xu Qiuming would find a place to hide, but he didn’t. Instead, he kills his way into the Demon Palace’s territories from time to time. With every appearance, his Sword Intent grows stronger…”<br/><br/>Fang Ling spoke of Xu Qiuming with a look of admiration on her face.<br/><br/>Xu Qiuming was making his move!<br/><br/>It was quite the momentum, reminiscent of Fang Wang back in the Southern Celestial Sea.<br/><br/>Fang Wang was not surprised, after all, Zhou Xue had said that Xu Qiuming would become one of the strongest in the Mortal Realm, only lacking the opportunity to ascend. In this life, Xu Qiuming might achieve even higher accomplishments.<br/><br/>Lady Jiang was not interested in the battles and killings in the Cultivation World; she treated them as stories. She was happy as long as Fang Wang kept her company – the topic of their conversation didn’t matter.<br/><br/>After Fang Ling finished speaking, she picked up her teacup, and Xiao Zi couldn’t help but tease, “You’re not falling for Xu Qiuming, are you?”<br/><br/>Fang Ling was not embarrassed; she held her chin up and snorted with a laugh, “And why not? It’s too bad I don’t know him.”<br/><br/>Sword Cultivators were popular among cultivators, especially the strong ones. Coming from Grand Qi, Xu Qiuming naturally became an existence many Grand Qi cultivators aspired to.<br/><br/>Xiao Zi laughed, “Want to meet him? Just ask your brother. Xu Qiuming owes your brother his life.”<br/><br/>Upon hearing this, Fang Ling’s eyes widened as she looked at Fang Wang, asking, “Really?”<br/><br/>Before Fang Wang could reply, Lady Jiang interjected, “This girl daydreams all day and is restless; don’t listen to her nonsense. Besides, this Xu Qiuming sounds like a wanderer of the End of the Sky – how could he stop for the sake of love?”<br/><br/>In her opinion, it would be best if Fang Ling married someone from Grand Qi and did not leave Grand Qi.<br/><br/>Could Xu Qiuming, no matter how strong or brilliant, compare to her son?<br/><br/>Her requirements for Fang Ling’s marriage were not high; she just wanted her to live a carefree life without leaving Grand Qi.<br/><br/>Fang Wang just smiled and did not say anything.<br/><br/>He did not oppose the idea of Fang Ling marrying Xu Qiuming, but Xu Qiuming himself might not be willing. He also did not want emotions to hinder the rise of one of the Mortal Realm’s strongest.<br/><br/>Of course, if the two were fated to be together, that would be another matter.<br/><br/>Fang Ling, dissatisfied, began to argue with Lady Jiang, determined to marry Xu Qiuming.<br/><br/>The mother and daughter argued for a while, and then Fang Ling turned back to Fang Wang, asking, “Brother, what kind of person is Zi Geng?”<br/><br/>Upon hearing this, Fang Wang gently swirled his teacup and asked, “Why suddenly ask about him? Is there news of him?”<br/><br/>Fang Zigeng was diligent in his cultivation; Fang Wang always felt assured about him.<br/><br/>In Fang Wang’s opinion, even if Fang Hanyu met his end roaming one day, Fang Zigeng would still be alive.<br/><br/>But when would Fang Zigeng make a name for himself?<br/><br/>“I heard from people in the Jin Xiao Sect that the daughter of the leader of the Emperor Sea’s number one sect, the Supreme Sect, has taken a liking to brother Zigeng. She even forcefully abducted him back to the sect to get married. Tsk, what sort of luck is that?” Fang Ling said with a face full of curiosity.<br/><br/>Hearing this left Fang Wang stunned as well.<br/><br/>Lady Jiang frowned and asked, “How can the Supreme Sect conduct itself so domineeringly?”<br/><br/>Fang Zigeng had grown up under her care, just like Fang Wang. She naturally felt dissatisfied with a marriage forced upon him without his parents’ consent.<br/><br/>Fang Ling laughed, “Mother, the Supreme Sect is not weaker than the Heaven’s Larceny Demon Sect we knew before. The Supreme Sect Leader only has one daughter. It’s said that when she was out gaining experience, she was attacked by the Demon Race and suffered grave injuries. While unconscious, she was fortunate to be saved by Fang Zigeng. Afterwards, she had people forcefully take Fang Zigeng away. The Jin Xiao Sect even tried to rescue him, but once they learned that the Supreme Sect Leader truly treated him as a son-in-law and even passed on his ultimate technique to him, the Jin Xiao Sect gave up.”<br/><br/>“That doesn’t mean they can just force a marriage; what kind of behavior is that?” Lady Jiang said discontentedly.<br/><br/>Fang Wang laughed, “Mother, don’t worry, I’ll ask Zhou Xue about it later. She’s in Emperor Sea, so she is sure to know more.”<br/><br/>Lady Jiang nodded, “If Zigeng is unwilling, you must rescue him. After all, he’s your brother too.”<br/><br/>Fang Wang nodded, agreeing that if Fang Zigeng was indeed unwilling, he would indeed have to save him.<br/><br/>Fang Ling then said dreamily, “It’s said that the daughter of the Supreme Sect Leader is breathtakingly beautiful, and also a famed prodigy of Emperor Sea. Yet she fell head over heels for brother Zigeng all because of his life-saving grace. Could it be that brother Zigeng is no longer the man he once was?”<br/><br/>Lady Jiang sighed, “Zigeng’s parents are already deceased, and he’s been cultivating alone outside. Who knows how the Supreme Sect is treating him.”<br/><br/>Fang Wang then began to comfort her.<br/><br/>Early the next morning, Fang Wang took Xiao Zi back to Sword Heaven Marsh.<br/><br/>He took out the Jade Bracelet and contacted Zhou Xue.<br/><br/>Soon, he felt the fluctuation of Zhou Xue’s spiritual consciousness, and he immediately sent his own consciousness into the Jade Bracelet, following it to the Illusionary Realm of Fang Residence.<br/><br/>Fang Wang directly asked about Fang Zigeng’s situation.<br/><br/>“The Supreme Sect Leader’s daughter, Luo Yi, most likely genuinely likes him. But whether the boy is suffering, I don’t know. After all, it’s a great opportunity. He has the chance to obtain the Supreme Divine Record, so I didn’t intervene,” Zhou Xue replied, clearly not taking the matter too seriously.<br/><br/>Fang Wang asked, “What is this Supreme Divine Record?”<br/><br/>Zhou Xue raised an eyebrow with a smile, “The Supreme Divine Record endows one with the qualifications to challenge the Great Saint. Do you want it? If you do, I could go rescue Fang Zigeng, snatch Luo Yi for you, and let you inherit the Supreme Divine Record.”<br/><br/>Fang Wang rolled his eyes and said with annoyance, “Don’t talk nonsense. Luo Yi is now equivalent to our sister-in-law; we must show her respect.”<br/><br/>Zhou Xue laughed, then explained, “The Supreme Divine Record is the legacy of a Great Saint. It can also be considered a curse; it only passes to one heir, and only to males, not females. If it attaches to a woman, it can only be passed to a man through their union. The Supreme Divine Record has its own consciousness. Luo Yi’s heartfelt devotion towards Fang Zigeng might be influenced by the record. Luckily, the Supreme Sect Leader is unaware of this. In a past life, Luo Yi became a formidable strength, possessing the qualification to ascend and to prove herself as a Great Saint. Sadly, she was killed by that person with the Nine Lives Precious Spirit.”\t\t\t\t\t\t</div>", "images": {}, "success": true}