{"id": 215, "url": "https://www.novelhall.com/i-became-an-immortal-on-mortal-realm-32879/14498107.html", "title": "Chapter 215 - Chapter 215: Chapter 212: The Great Peace Heritage, Miao Wufa", "volume": 3, "volume_title": "Volume 3", "body": "<h1>Chapter 215 - Chapter 215: Chapter 212: The Great Peace Heritage, Miao Wufa</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 215: Chapter 212: The Great Peace Heritage, Miao Wufa<br/><br/>Translator: 549690339<br/><br/>The Underworld realm settled into stillness, all dust settled.<br/><br/>Thousand Eyes Great Saint lay amidst the ruins, covered in blood, most of the eyeballs on his body burst open. At a glance, it looked as though he was strewn with blood-filled pits, a scene of extreme desolation, devoid of any majesty befitting a Great Saint.<br/><br/>Fang Wang landed beside him, looking down and said, “This battle has ended with your defeat. However, you have made me realize the power of a Great Saint, and I admire your strength. It’s just the path you have chosen, I do not agree with.”<br/><br/>With difficulty, Thousand Eyes Great Saint managed a smile and said, “Once… I was like you, taking it upon myself to protect the common folk. But they abandoned me, Fang Wang, if one day, the place you protect faces an insurmountable catastrophe, they will abandon you as well…”<br/><br/>Fang Wang’s gaze remained undisturbed as he replied softly, “I protect others simply because it’s in my nature; I never expect others to protect me.”<br/><br/>Thousand Eyes Great Saint’s smile was bitter. He sighed and said, “It’s a pity. I’ve dragged you into the Underworld. Leaving won’t be as easy as you think. I hope when I awaken next, your name is still known in the Mortal Realm.”<br/><br/>As his voice faded, Thousand Eyes Great Saint’s body turned to ash.<br/><br/>Fang Wang turned his head toward the horizon as Xiao Zi poked her head out from his embrace and asked cautiously, “Young Master, is this the Underworld? No wonder it’s so chillingly cold and uncomfortable… Can we get out of here?”<br/><br/>Being a monster, it too felt averse to the Underworld, utterly uncomfortable.<br/><br/>Fang Wang confirmed, “Yes, this is the Underworld.”<br/><br/>“Damn Thousand Eyes Great Saint, Young Master, what should we do?”<br/><br/>“Don’t panic.”<br/><br/>Fang Wang gazed into the distance, responding nonchalantly.<br/><br/>With Jiuyou Zizaishu at his disposal, he could directly leap back to the Mortal Realm. Jiuyou Zizaishu couldn’t transport other beings between the Underworld and Mortal Realm, but Xiao Zi was different. Fang Wang had cast Soul-Binding Curse on Xiao Zi, making her akin to a Magical Artifact he possessed, recognizing him as her master, hence she could follow him between realms.<br/><br/>That was also why Fang Wang dared to bring Xiao Zi into battle.<br/><br/>However, he was in no hurry to leave, sensing an aura approaching at an inconceivably fast speed.<br/><br/>Seeing Fang Wang so composed, Xiao Zi’s nervousness dissipated, turning to look in the direction he was staring at.<br/><br/>In less than the time it took for five breaths, Xiao Zi felt an overwhelmingly strong presence approaching, causing a suffocating sensation, and it trembled in fear in Fang Wang’s arms.<br/><br/>A fog rose at the edge of the world, murky and deep, highly oppressive. As the fog advanced, all mountains, no matter how tall, were consumed like sand and stone.<br/><br/>The fog swallowed mountains and rivers, unstoppable!<br/><br/>Xiao Zi’s serpentine eyes widened, holding its breath.<br/><br/>Within the rolling fog, a colossal figure flickered in and out of view.<br/><br/>Fang Wang turned to face the massive figure. He couldn’t see through the figure’s aura, but since it had not taken the chance to strike him during his battle with Thousand Eyes Great Saint, and had instead communicated with him, it likely harbored no ill intent.<br/><br/>He wanted to see what the figure wanted from him.<br/><br/>When the fog stopped less than fifty li from Fang Wang, it paused, and the mysterious figure hidden within spoke, “You have mastered Jiuyou Zizaishu?”<br/><br/>Fang Wang asked in return, “Could it be that you are the Ghost Emperor?”<br/><br/>The Ghost Emperor, the Crown Prince of the Grand An Divine Dynasty, a powerful being in the Underworld that suppressed Qi Tian Demon Venerable!<br/><br/>Within the gloomy fog gleamed a pair of eerie green eyes, staring at Fang Wang as it said, “Correct. I am the Ghost Emperor.”<br/><br/>“You guessed right, I have indeed mastered Jiuyou Zizaishu.”<br/><br/>A smile appeared on Fang Wang’s face as he faced the mysterious and formidable Ghost Emperor, neither overbearing nor humble.<br/><br/>He could sense that the Ghost Emperor was far stronger than Thousand Eyes Great Saint had been, clearly an opponent beyond his current capabilities. However, with Jiuyou Zizaishu in hand, he could return to the Mortal Realm at any moment.<br/><br/>The Ghost Emperor’s voice sounded again, “My imperial father once decreed that whoever masters Jiuyou Zizaishu is qualified to inherit the Grand An Divine Dynasty.”<br/><br/>Fang Wang asked with curiosity, “How many years has it been since the Grand An Divine Dynasty fell?”<br/><br/>“So many years, it’s difficult to count. The Mortal Realm has likely already forgotten the Grand An Divine Dynasty.”<br/><br/>“Then, how can I inherit it?”<br/><br/>“Although the Grand An Divine Dynasty has perished, its Fate and heritage still lie hidden in the world.”<br/><br/>Hearing this, Fang Wang felt overwhelmed.<br/><br/>After all, Descending Dragon Great Saint had granted him the key to Tai Cang Immortal Mansion, and now he was to receive the inheritance of the Grand An Divine Dynasty?<br/><br/>Quite troublesome indeed.<br/><br/>For the time coming, Fang Wang did not intend to leave Grand Qi, planning to cultivate peacefully in Sword Heaven Marsh, accompanying his parents for the remainder of their lives.<br/><br/>As Fang Wang remained silent, the Ghost Emperor continued, “You don’t need to seek out the heritage of the Grand An Divine Dynasty. When the time is right, it will find you. You need only give me an answer, whether you are willing to accept it.”<br/><br/>Fang Wang asked, “What must I give in return?”<br/><br/>The Ghost Emperor explained, “The downfall of the Grand An Divine Dynasty began with a calamity from The Upper Realm. Once you receive the Grand An Divine Dynasty’s Fate, you will be marked by The Upper Realm. Of course, the cause and effect will fall upon you only from the time you receive the Grand An Divine Dynasty’s Fate.”<br/><br/>Once again, Fang Wang fell silent.<br/><br/>The Ghost Emperor continued, “Given your talents, if you ascend, you will lose your freedom in the Mortal Realm. If you lacked ambition, perhaps life would be pleasant, but if you regard yourself as exceptional, ascending is but entering a cage. If you don’t ascend, even becoming a saint in the Mortal Realm, The Upper Realm will not tolerate you.”<br/><br/>Fang Wang asked with a smile, “So you’re saying, other than bowing to The Upper Realm, I’m left with no option but a dead end?”<br/><br/>“For someone with talents like yours, indeed so. I ended up like this because I defied The Upper Realm,” sighed the Ghost Emperor.<br/><br/>“Once, how glorious and flourishing was the Grand An Divine Dynasty, being able to lead the common people beyond the heavens, to explore vistas beyond the world. Since the Grand An Divine Dynasty, I have peered into the Mortal Realm from the Underworld, never seeing a second dynasty like it.”<br/><br/>Hearing the words of the Ghost Emperor, Fang Wang wasn’t too surprised, after all, Zhou Xue had said something similar before.<br/><br/>Xiao Zi, however, was filled with curiosity, but she dared not interrupt.<br/><br/>Fang Wang asked, “May I dare to ask the Ghost Emperor, if one does not ascend, is there a way to become immortal in the Mortal Realm?”<br/><br/>The Ghost Emperor replied, “Of course there is. The history of this Mortal Realm is beyond your imagination. The Upper Realm has always suppressed the Mortal Realm because they fear its potential threat.”<br/><br/>Fang Wang asked, perplexed, “If that’s the case, why doesn’t the Upper Realm simply exterminate the Mortal Realm?”<br/><br/>The Ghost Emperor laughed and said, “Before the Grand An Divine Dynasty, there indeed was such a time, but it provoked a Supreme Saint.”<br/><br/>“What is a Supreme Saint?”<br/><br/>“Indescribable, I am not clear on it either.”<br/><br/>Fang Wang paused for a moment and said, “If that’s the case, then I am willing to accept the Grand An Divine Dynasty.”<br/><br/>A hint of laughter appeared in the Ghost Emperor’s voice, “Good, you have courage. Return now. When the time is ripe, the fate of the Grand An Divine Dynasty will find you. Moreover, the snake in your arms is no simple creature. It bears the remnants of a True Dragon, its fortune and misfortune unpredictable.”<br/><br/>As his voice fell, those deep green eyes disappeared, and the dense fog dispersed along with them.<br/><br/>Xiao Zi was anxious and quickly said, “Young Master, don’t listen to him, don’t take me as a curse.”<br/><br/>Fang Wang raised his hand to stroke her head and smiled, “What do you take me for? Isn’t a True Dragon even more fitting to accompany me?”<br/><br/>With that thought, Fang Wang immediately leapt out of the Underworld with her.<br/><br/>Xiao Zi only felt the world spinning around her, and when she opened her eyes again, the world was bright.<br/><br/>Although the surroundings hadn’t changed, Xiao Zi could clearly feel that she had returned to the Mortal Realm, no longer feeling discomfort.<br/><br/>Fang Wang turned and flew south. The traces of the previous battle were still evident in the world, with dust and smoke pervading the air.<br/><br/>“Young Master, where shall we go next?”<br/><br/>“Let’s make a trip to Zhui Tian Secret Realm.”<br/><br/>“Aren’t we going to look for Dugu Wenhun and the others?”<br/><br/>“They will find their way back to Sword Heaven Marsh on their own.”<br/><br/>“Speaking of which, Young Master, you are really powerful. Even the revived Great Saints are no match for you. Is there no one in the Mortal Realm who can stand against you?”<br/><br/>“That was not the full strength of the Great Saint.”<br/><br/>“I don’t care. Young Master is the strongest. Young Master, once I transform, I will become your Saint Consort.”<br/><br/>“Do not speak foolishly.”<br/><br/>“It’s not foolishness. The Descending Dragon Great Saint established three thousand Saint Consorts, including many demon consorts. I have seen some of their portraits. Hehe, Young Master, if you want to see, wait until I transform, and I will show them to you.”<br/><br/>After the confrontation between Fang Wang and the Thousand Eyes Great Saint ceased, everyone before Great Saint Mountain breathed a sigh of relief.<br/><br/>Caught beneath the battle of two peerless mighty powers, even the four Saint Venerates at Nirvana Realm felt as if they could be obliterated at any moment.<br/><br/>Li Tianjue went over to heal Li Qingsong while the Protecting Heaven Sect had surrounded the cultivators of Heaven’s Larceny Saint Sect. Although some had escaped their net, the cultivators from Heaven’s Larceny Saint Sect didn’t dare to resist, and the situation was quickly stabilized.<br/><br/>Since Fang Wang had disabled the four great Saint Venerates, Dugu Wenhun alone could easily subdue them.<br/><br/>As Li Tianjue healed Li Qingsong, she looked sorrowfully towards Shen Buhui, who was surrounded in the distance.<br/><br/>“Tianjue… you don’t need to waste your Spiritual Power… your teacher can’t make it… Before I die, I have one last task to entrust to you…” Li Qingsong said weakly, his face a bloody mess, spitting blood as he spoke.<br/><br/>Li Tianjue immediately broke down in tears, unable to stop them from pouring out as she lowered her head and bit her lip.<br/><br/>“You must… invite Fang Wang to… Descending Dragon Mountain… the karma between Wen Li and Thousand Eyes Great Saint is not yet over… only Fang Wang can put an end to them…”<br/><br/>Li Qingsong’s words were incredibly difficult to say, his face was a blur of flesh and blood.<br/><br/>If it had been a lower-cultivation individual with such severe injuries, they would have been dead by now.<br/><br/>In the distance, Shen Buhui’s situation was also dire. His injuries were not fatal, but the price of the All-Encompassing Vitality Technique had exhausted his life span.<br/><br/>At that moment, his face was filled with smiles, devoid of any fear of death.<br/><br/>Seeing the demise of Heaven’s Larceny Saint Sect before dying, he had no regrets left.<br/><br/>He slightly turned his head, and the surrounding Protecting Heaven Sect cultivators made way, understanding who he wanted to see.<br/><br/>Gazing at Li Tianjue from afar, Shen Buhui’s heart was filled with fondness, and he thought to himself, “Tianjue… no, Miss Li, may this lifetime spare you from such tribulations, and may all your wishes come true…”<br/><br/>Li Tianjue felt his gaze and inevitably looked up, her eyes meeting his across the space.<br/><br/>She couldn’t bring herself to abandon her master to care for Shen Buhui.<br/><br/>At least Shen Buhui had the Protecting Heaven Sect to guard him, while her master had only her.<br/><br/>Just then, she heard footsteps behind her, and she instinctively turned to look, but a gust of wind passed by on her other side, startling her. When she turned back, she saw a scholar-dressed man half-kneeling next to Li Qingsong.<br/><br/>Li Tianjue frowned and asked, “Who are you?”<br/><br/>The scholar with a gentle and subtle appearance, carrying a bookcase on his back, looked over Li Qingsong and said, “From the Jin Xiao Sect, reviver of the dead, Ghost Saint Hand, Miao Wufa.”\t\t\t\t\t\t</div>", "images": {}, "success": true}