{"id": 229, "url": "https://www.novelhall.com/i-became-an-immortal-on-mortal-realm-32879/14539245.html", "title": "Chapter 229 - Chapter 229: Chapter 226: The Eighth Lifespirit Treasure, Sixth Order Of Dao Yuan", "volume": 3, "volume_title": "Volume 3", "body": "<h1>Chapter 229 - Chapter 229: Chapter 226: The Eighth Lifespirit Treasure, Sixth Order Of Dao Yuan</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 229: Chapter 226: The Eighth Lifespirit Treasure, Sixth Order of Dao Yuan<br/><br/>Translator: 549690339<br/><br/>“Of course, I’m here to hunt a True Dragon.”<br/><br/>Faced with Xiao Zi’s question, the Hongxuan Emperor raised his eyebrows and smiled.<br/><br/>Upon hearing this statement, everyone’s gaze toward him changed, becoming hostile, which surprised him.<br/><br/>He had observed earlier that these cultivators were not Fang Wang’s Sword Servants, so why were they so loyal to Fang Wang?<br/><br/>The Three Immortals of the Emperor Sea and Dugu Wenhun appeared, surrounding the Hongxuan Emperor.<br/><br/>They examined the Hongxuan Emperor with astonished eyes.<br/><br/>Back on Emperor’s Tomb Island, they had been impressed by Xiao Kuang, for he had stayed the longest during the assessment. However, it was unclear whether he had received the Hongxuan Emperor’s legacy.<br/><br/>They did not know that Xiao Kuang had been possessed by the Hongxuan Emperor, but compared to before, Xiao Kuang’s cultivation had improved dramatically.<br/><br/>Even the Three Immortals of the Emperor Sea, strong as the ninth layer of Nirvana Realm, felt danger from Xiao Kuang as he was now.<br/><br/>The Hongxuan Emperor grinned and said, “Don’t be nervous, I’m just joking. Our Jin Xiao Sect is on good terms with Tian Dao Fang Wang, and even if I were to hunt dragons, I wouldn’t choose his dragon.”<br/><br/>After these words were spoken, the tense atmosphere immediately eased, but many still looked at him warily.<br/><br/>The Hongxuan Emperor then smiled and said, “Now that all kinds of monsters are transforming into dragons, it has thoroughly disrupted the mortal realm’s affairs, and many hidden sects have emerged. Do you know why the mass monster transformation has occurred?”<br/><br/>The cultivators shook their heads, all unaware, but their curiosity was piqued by his words.<br/><br/>“This was caused by a True Dragon called Xian Long, who is the last True Dragon in the world, suppressed on an island. Historically, whenever the True Dragon Clan faced the danger of extinction, they would use a Secret Technique, invoking the fate of the True Dragon Clan to awaken monsters with Dragon Race bloodlines, causing them to transform into True Dragons.”<br/><br/>“The saying ‘The dragon bore nine children, and from those nine children came many monsters’ is not without basis. The dragon’s promiscuity was all in preparation for the future…”<br/><br/>The Hongxuan Emperor started to share ancient legends, even attracting the attention of the Three Immortals of the Emperor Sea.<br/><br/>Dugu Wenhun frowned, feeling that this man was off, not just in his rapid advancement in cultivation but also in his changed demeanor, as he didn’t seem like a man of words before.<br/><br/>And he had stayed so long during the Hongxuan Emperor’s legacy assessment…<br/><br/>Gradually, Dugu Wenhun noticed that the Hongxuan Emperor’s words and actions bore a striking resemblance to the Golden-haired Monkey he had met during the assessment.<br/><br/>He suddenly felt a chill.<br/><br/>Could it be…<br/><br/>Dugu Wenhun looked intently at the Hongxuan Emperor, and the Hongxuan Emperor even threw him a glance that made him quickly turn his head away.<br/><br/>The more he thought about it, the more uneasy he felt, but he was able to calm himself with Fang Wang present.<br/><br/>Since Fang Wang had defeated the revived Thousand Eyes Great Saint, Dugu Wenhun had labeled him as invincible in his heart.<br/><br/>Even though Fang Wang said the Thousand Eyes Great Saint was not his true body, Dugu Wenhun still admired him greatly.<br/><br/>The safest place in the world was by Fang Wang’s side!<br/><br/>At the bridgehead, a spectacular mist of Earth Spirit Qi formed, covering a several dozen zhang radius of the lake area, obscuring the specifics of Fang Wang’s situation.<br/><br/>White flames surged toward the top of Fang Wang’s head, condensing into an orb larger than his head.<br/><br/>The eighth Lifespirit Treasure, Fang Wang hoped to lean towards Heaven and Earth.<br/><br/>He thought of black holes.<br/><br/>He wanted to create a Lifespirit Treasure that could devour everything and also carve out its own little heaven and earth within.<br/><br/>Such a treasure would be best shaped as a bead.<br/><br/>The Zhu Xian Jing Hong Sword also had the marvel of devouring, albeit only the Power of the Underworld, which was enough inspiration for Fang Wang, making this creation not too difficult.<br/><br/>His Spiritual Refinement had entered the final stage, and Spiritual Energy was rushing to him faster and faster.<br/><br/>In his Treasured Spirit Space, his other Lifespirit Treasures were also absorbing Earth Spirit Qi.<br/><br/>They were about to transform!<br/><br/>Nirvana Realm was supposed to be the Nirvana of Lifespirit Treasures. Fang Wang believed his heart’s nirvana meant his treasures wouldn’t transform; however, this wasn’t the case. They were just waiting for the birth of the new treasure to transcend together.<br/><br/>With a thunderous rumble—<br/><br/>As nature’s spiritual energy madly surged toward Fang Wang, streaks of lightning began to appear out of nowhere above the surface of Sword Heaven Marsh.<br/><br/>The eloquent Hongxuan Emperor suddenly turned his head to look, and others were also startled.<br/><br/>Fierce winds howled, making their robes seem ready to rip at any moment.<br/><br/>“What’s happening?”<br/><br/>“Could it be that he has broken through again?”<br/><br/>“This suction is so strong, what is Elder Fang doing?”<br/><br/>“We must evacuate quickly, or the consequences will be dire!”<br/><br/>Cultivators buzzed with anxious discussion, and many immediately opted to evacuate, while the Sword Servants of Sword Heaven Marsh hesitated.<br/><br/>It was then that Fang Wang’s voice rang out:<br/><br/>“Everyone temporarily leave Sword Heaven Marsh and return after a few days.”<br/><br/>Hearing this, Song Jinyuan didn’t hesitate to issue the evacuation order.<br/><br/>The Hongxuan Emperor’s brows furrowed; he didn’t linger and also chose to evacuate.<br/><br/>The peaks surrounding Sword Heaven Marsh trembled, countless leaves and pebbles flew towards Fang Wang.<br/><br/>In less than half an hour, a gigantic ball of light appeared above Sword Heaven Marsh, as nature’s spiritual energy madly surged toward it, and fierce winds swept across everything.<br/><br/>Building after building shattered, the cliffs of mountain peaks began to collapse, as if the apocalypse had descended.<br/><br/>From afar, the Hongxuan Emperor gazed at the ball of light with eyes full of wariness.<br/><br/>“What kind of Treasured Spirit is that… What exactly is this kid creating?”<br/><br/>It was not unusual to have multiple Lifespirit Treasures, but he could sense that Fang Wang’s Lifespirit Treasure was just beginning its Nirvana.<br/><br/>What did this imply?<br/><br/>Fang Wang’s treasure was innately a Heavenly Essence, and it might even reach a rank above Heavenly Essence.<br/><br/>The more he learned about this kid, the more terrifying he seemed.<br/><br/>The Hongxuan Emperor hesitated in his heart. Should he really seek a sparring match with Fang Wang in the future?<br/><br/>Even with his lifetime’s worth of cultivation experience, he felt he couldn’t keep up with Fang Wang, who was merely exploring with his innate talent.<br/><br/>The Hongxuan Emperor thought of a certain legend, and his eyes became unfocused.<br/><br/>Nine days later.<br/><br/>All the mountains surrounding Sword Heaven Marsh had disappeared, the level of the lake had significantly dropped, and the woods in all directions heaved in disarray, with dust filling the air.<br/><br/>The wild winds that raged between heaven and earth began to weaken, and a white ball of light over a thousand feet in diameter hovered above Sword Heaven Marsh. Even a hundred miles away, one could feel its magnificence.<br/><br/>In the distance, the cultivators who had escaped from Sword Heaven Marsh all stared at the huge ball of light with shock on their faces. Cultivators from other directions were continuously arriving, and everyone who witnessed the light ball was terrified.<br/><br/>At this moment, Fang Wang still sat cross-legged on the wooden bridge. He slowly opened his eyes, raised his right hand, and the giant ball of light in the sky began to shrink, rapidly falling into his palm. It now appeared only as large as a walnut, silver-white in color, with mysterious golden patterns adorning its surface.<br/><br/>“Let’s call it the Town World Bead.”<br/><br/>Fang Wang spoke softly, and the Town World Bead shimmered in response, as if accepting the name.<br/><br/>During these nine days, the Town World Bead had undergone Spiritual Refinement and Nirvana, and had already far surpassed the might of any other treasures he had crafted before. The other treasures had also gone through Nirvana, all transforming successfully.<br/><br/>The most direct manifestation was that Fang Wang’s vitality and Spiritual Power had intensified more than tenfold, especially since he had just made a breakthrough into the Nirvana Realm.<br/><br/>Without any exaggeration, he was now capable of killing his own self from the Nineth Layer of the Mahayana Realm with a single punch!<br/><br/>Fang Wang looked at the Town World Bead with a smile on his face.<br/><br/>“Eight Lifespirit Treasures, almost reaching the number nine. I wonder if I can surpass this numeral.”<br/><br/>Fang Wang thought expectantly. Based on the situation of creating one Lifespirit Treasure per realm tier, there were still several major realms above him, so he could continue to create Lifespirit Treasures.<br/><br/>Of course, nine might already be the ultimate number, and upon reaching nine Lifespirit Treasures, he might not be able to craft any more.<br/><br/>Fang Wang took the Town World Bead into his body and then sent a telepathic message to Song Jinyuan, instructing him to bring people back.<br/><br/>The Hongxuan Emperor appeared out of thin air behind him, remarking, “Your treasure has at least reached the sixth rank of Dao Essence.”<br/><br/>Fang Wang turned to look at him and asked, “Above Heavenly Essence is Dao Essence?”<br/><br/>The Hongxuan Emperor nodded, “Dao Essence has nine ranks, each can also be divided into peerless, superior, intermediate, and inferior grades. After Nirvana, treasures that can surpass two ranks of Dao Essence are qualified to exceed the Heaven-Breaking Realm.”<br/><br/>He paused for a moment and said, “Since ancient times, those whose treasures reached the fifth rank of Dao Essence have all had the chance to become a Great Saint, and ascension was not difficult. You are different. Other Great Cultivators may have multiple Lifespirit Treasures, but there will undoubtedly be a primary one. The grade of the primary treasure will have a gap from the others, but all of your treasures… are above the sixth rank of Dao Essence.”<br/><br/>“How did you determine that?” Fang Wang asked.<br/><br/>The Hongxuan Emperor answered, “I have a Lifespirit Treasure of the sixth rank of Dao Essence.”<br/><br/>Fang Wang was reminded that the grade of the Heavenly Palace Halberd should be far beyond the sixth rank of Dao Essence. His treasures also had a hierarchy, but since they were all too strong, it was difficult for others to distinguish.<br/><br/>After this Nirvana, his previous seven treasures had all undergone earth-shattering enhancements, each possessing the power to move mountains and seas. As to how powerful they really were, only actual combat could prove it.<br/><br/>Fang Wang twisted his neck and asked, “May I know what brings you to me, senior?”<br/><br/>After his breakthrough, his Spiritual Power was so abundant that he was eager for a battle to vent his energy.<br/><br/>The Hongxuan Emperor was not surprised that Fang Wang recognized him. He chuckled softly, “I wanted to ask you to help me deal with someone, the same person the Lord Demon of the Jin Xiao Sect is eager to subdue.”<br/><br/>Fang Wang smiled and asked, “Who is this person that requires you and me to join forces to bring down?”<br/><br/>“Zhu Rulai of the Divine Sect.”<br/><br/>“Hmm?”<br/><br/>The Hongxuan Emperor explained, “Zhu Rulai is the strongest in the Cang Tranquil Ming Sea. I’m not clear about his exact cultivation level, but it is definitely above the Heaven-Breaking Realm. He was once a disciple of the Buddhist Sect and later practiced both Buddhist and demonic arts, establishing the Divine Sect. In past eras, he had the talent to compete for the Great Saint, and ascension was not difficult for him. The Demon Monarch thinks highly of him and hopes that you and I can subdue him. My current body is too weak to deal with the Heaven-Breaking Realm, so I need your help.”<br/><br/>Above the Heaven-Breaking Realm!<br/><br/>Fang Wang thought for a moment and said, “Let me rest for a few days, how about that?”<br/><br/>The Hongxuan Emperor smiled, “Of course, that’s no problem. By the way, Zhu Rulai can also be considered as half of my disciple, even though he does not hold me in esteem. But don’t underestimate him.”<br/><br/>Fang Wang squinted and asked, “How long has he lived?”<br/><br/>The Hongxuan Emperor shrugged, “If we count carefully, it’s close to seven hundred years. My legacy is not just on Emperor’s Tomb Island. While what he inherited is not the Heavenly Emperor Imperial Mirror, it is the most sinister Cultivation Technique of mine.”<br/><br/>Calling one’s own Cultivation Technique sinister?<br/><br/>Fang Wang chuckled and looked forward even more to subduing Zhu Rulai.<br/><br/>Seeing Fang Wang laugh, the Hongxuan Emperor couldn’t help but join in the laughter.<br/><br/>The mere thought of Fang Wang and Zhu Rulai clashing in battle excited him.\t\t\t\t\t\t</div>", "images": {}, "success": true}