{"id": 225, "url": "https://www.novelhall.com/i-became-an-immortal-on-mortal-realm-32879/14525508.html", "title": "Chapter 225 - Chapter 225: Chapter 222: Ninth Layer Of The Mahayana Realm, Ten Thousand Demons Transform Into Dragons_1", "volume": 3, "volume_title": "Volume 3", "body": "<h1>Chapter 225 - Chapter 225: Chapter 222: Ninth Layer Of The Mahayana Realm, Ten Thousand Demons Transform Into Dragons_1</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 225: Chapter 222: Ninth Layer of the Mahayana Realm, Ten Thousand Demons Transform into Dragons_1<br/><br/>Translator: 549690339<br/><br/>“If you can’t subdue it, then you are not worthy of becoming a Great Saint.”<br/><br/>The man in black spoke without turning his head, his tone indifferent.<br/><br/>Ji Rutian heard these words and was not angered. Instead, he asked with a smile, “Master, at my realm, could you have subdued the True Dragon’s vital essence?”<br/><br/>The man in black replied, “If the me back then had the guidance of the me now, naturally I could have subdued it. But even so, I wasn’t able to attain the status of a Great Saint.”<br/><br/>Ji Rutian fell into contemplation.<br/><br/>The master and disciple continued on their way, passing through the forest and arriving at the foot of the mountain.<br/><br/>This massive peak had few dense trees and offered a wide view. Looking up from the base of the mountain, it appeared incredibly majestic, akin to a primordial divine mountain. Its peak was shrouded in dense smoke, sporadically ejecting rocks and sand.<br/><br/>Ji Rutian muttered to himself, “Is this the True Dragon that presides over all the other demons? Its aura is truly terrifying.”<br/><br/>The man in black spoke, “Xian Long, it’s been many years. Do you still retain your will?”<br/><br/>The islands were silent, the sun shone on the mountain, continually expanding the lit area.<br/><br/>“Hmph, Zhu Changsheng, you’ve come again. And this time you’ve brought along a greenhorn. Does he really think he can obtain this king’s vital essence?”<br/><br/>A voice, ancient and oppressive, rang out, reminiscent of an aging emperor possessing an innate authority.<br/><br/>The man in black was actually the founding ancestor of the Ji Hao Sect, Zhu Changsheng!<br/><br/>Confronted with Xian Long’s scorn, Zhu Changsheng spoke, “You’ve been suppressed here, your power waning. Are you truly confident about facing both my disciple and me?”<br/><br/>After his words, silence fell upon heaven and earth once more.<br/><br/>Zhu Changsheng waited a moment, then began ascending the mountain, with Ji Rutian hurrying to follow.<br/><br/>Rumble, rumble—<br/><br/>The mountain started to tremble, and lava poured down like waterfalls through the thick smoke, cascading towards the base and sending scorching air in every direction.<br/><br/>Zhu Changsheng’s black robes fluttered. His expression remained cold and detached, unabated by Xian Long’s daunting presence.<br/><br/>Ji Rutian smiled, his eyes filled with anticipation.<br/><br/>“The strength of a True Dragon… I wonder if, upon obtaining it, I can contend with Fang Wang.”<br/><br/>Ji Rutian’s thoughts lingered on Fang Wang.<br/><br/>Ever since his clone fought with Fang Wang, he had set Fang Wang as his ultimate goal.<br/><br/>He firmly believed that if he could defeat Fang Wang, then he would be the person with the greatest talent and life potential in this world, the Great Saint of this era would be his for the taking!<br/><br/>Under the blue sky and surrounded by peaks, Sword Heaven Marsh was filled with numerous sword cultivators standing on the lake, contemplating the Sword Dao.<br/><br/>Fang Bai and Xu Qiuming stood opposite each other with closed eyes, ripples emanating across the lake’s surface beneath their feet.<br/><br/>Suddenly.<br/><br/>Xu Qiuming opened his eyes and gazed upon Fang Bai, his look one of admiration.<br/><br/>Fang Bai slowly opened his eyes, bright and clear. Looking at Xu Qiuming, he asked, “Senior, what is the name of this Sword Intent?”<br/><br/>Xu Qiuming smiled and said, “The Sword Intent of Selflessness, forget oneself, forget everything. There is only the sword. The sword can destroy everything and also create everything. My Sword Intent is that the sword is everything.”<br/><br/>“The Sword Intent of Selflessness…”<br/><br/>Fang Bai murmured to himself, his eyes gleaming with even more intensity. He exclaimed, “This Sword Intent is remarkable, it feels even stronger than the Celestial Sword Intent.”<br/><br/>He had already grasped the Celestial Sword Intent, so he was qualified to assess the strengths of the two Sword Intents.<br/><br/>Xu Qiuming shook his head and chuckled, “Any Sword Intent can grow, there is none that is absolutely powerful. It still depends on the person. Take the Celestial Sword Intent, for instance, no one can surpass the Heavenly Dao.”<br/><br/>Fang Bai took a deep breath and said, “I have someone I must defeat. Senior, thank you for imparting your Sword Intent to me. I will not tarnish your reputation.”<br/><br/>Xu Qiuming waved his hand and turned away, looking towards the horizon and speaking leisurely, “It’s time for me to leave, to continue in pursuit of my Sword Dao.”<br/><br/>“Senior, won’t you say goodbye to Ancestor Fang?” Fang Bai asked respectfully.<br/><br/>Xu Qiuming vanished into thin air above the lake, leaving behind a voice, “There will never be a permanent farewell between him and me, so what’s the need for goodbyes?”<br/><br/>Fang Bai stood stunned, then shook his head with a wry smile.<br/><br/>Elsewhere.<br/><br/>At the mist-enshrouded bridgehead, Xiao Zi looked towards Fang Bai’s direction and mused, “Isn’t this kid’s Sword Dao comprehension too exaggerated? He’s learned Xu Qiuming’s Sword Intent so quickly.”<br/><br/>Fang Wang gazed at the eastern sky and replied softly, “His comprehension of the Sword Dao is indeed high, at least for now I haven’t found anyone with a higher comprehension than his.”<br/><br/>In his eyes, it wouldn’t be surprising if Fang Bai surpassed Xu Qiuming.<br/><br/>Fang Wang himself was an anomaly, and wasn’t Fang Bai one as well?<br/><br/>“`<br/><br/>One could even say that the existence of the Fang Family is the greatest variable in this world, for in my past life, the Fang Family was eradicated, and a prodigy like Fang Bai didn’t even have the chance to be born.<br/><br/>Ever since Fang Bai lost to the Sword Immortal, this lad’s temperament has changed, cultivating even more diligently. Previously, relying on his quick wits, he would occasionally slack off, but now, he meditates on the sword all day, his Sword Intent growing stronger with each passing day.<br/><br/>“Looking at it this way, it’s only a matter of time before Fang Jing is surpassed, even left far behind,” Xiao Zi said with a taunting laugh, excited at the thought of Fang Jing being defeated by Fang Bai.<br/><br/>Fang Wang no longer responded; whether Fang Bai or Fang Jing would achieve greater heights in the future wasn’t his concern—descendants have their own luck.<br/><br/>Xiao Zi noticed his gaze and couldn’t help but ask, “Young Master, what are you looking at?”<br/><br/>Fang Wang replied softly, “I cannot see, but I can feel.”<br/><br/>Upon hearing this, Xiao Zi’s curiosity grew even stronger.<br/><br/>It was about to press for an answer when its serpentine body suddenly trembled, its heartbeat thundering through its sensory world like war drums.<br/><br/>An indescribable sense of terror surged in its heart, giving it the feeling of facing the apocalypse.<br/><br/>“Young Master…” Xiao Zi called out with difficulty.<br/><br/>Fang Wang turned to look at it and raised his right hand to place it on Xiao Zi’s snakehead, protecting it with his own Spiritual Power.<br/><br/>In that instant, Xiao Zi felt itself enveloped in a comfortable warmth, and the discomfort vanished immediately, allowing it to breathe a sigh of relief.<br/><br/>“It seems a change of era is imminent,” Fang Wang muttered to himself.<br/><br/>Xiao Zi couldn’t help but look to the east, its gaze slightly vacant.<br/><br/>An hour later, Fang Wang finally removed his right hand from Xiao Zi.<br/><br/>Fang Wang closed his eyes and said, “Cultivate diligently; your tribulation may be imminent.”<br/><br/>At these words, Xiao Zi immediately leapt onto a lotus on the lake’s surface and began to absorb Earth Spirit Qi.<br/><br/>Time flies like an arrow, life is fleeting; mankind grows up and ages, births and deaths come one after another, continuing the cycle without end, all things following the same law.<br/><br/>Twenty-four years later.<br/><br/>On this day, Fang Wang finally reached the Nineth Layer of the Mahayana Realm.<br/><br/>Over the years, he had returned to the Fang Residence only once, for the low-key celebration of his two-hundredth birthday with his parents, after which he returned to continue his secluded cultivation.<br/><br/>He opened his eyes and murmured, “The Nirvana Realm is near; when the time comes, I can recast a Lifespirit Treasure, and enhance all my Lifespirit Treasures. I should be able to withstand the upcoming tribulations.”<br/><br/>Twenty-four years earlier, he had sensed an aura far surpassing that of the heavens from far off in the east, terrifying even him. That was why he had devoted himself so urgently to cultivation.<br/><br/>This aura seemed to be connected to Xiao Zi, often causing it distress; this indicated the aura was related to the True Dragon. Fang Wang couldn’t tell if this was good or bad and could only prepare for the worst.<br/><br/>At some point, Fang Wang had grown accustomed to the feeling of being unmatched, and this unknown yet powerful force made him feel a sense of urgency.<br/><br/>Though belligerent by nature, that was when he had absolute certainty of victory. If he encountered an enemy he couldn’t be sure of, he wouldn’t dare look for a fight and would move to strike down the threat as swiftly as possible.<br/><br/>Fang Wang stood up and began to stretch his limbs. Before long, he felt a wave of spiritual consciousness emanating from the Jade Bracelet on his right hand—it was Zhou Xue. He immediately sent his own spiritual consciousness into it.<br/><br/>It was still the Illusionary Realm of the Fang Residence.<br/><br/>Zhou Xue was sitting in a pavilion, beckoning to him.<br/><br/>After many years, Zhou Xue wore a delicate and magnificent red jade crown on her head, her long hair neatly arranged beneath it, her bearing radiating the dignity of a ruler.<br/><br/>Fang Wang entered the pavilion and asked, “Did you contact me because you sensed that I stopped cultivating?”<br/><br/>Zhou Xue nodded and said, “Correct. Congratulations on breaking through to the Nineth Layer of the Mahayana Realm. Your pace of cultivation is truly disheartening. If it weren’t for my possession of the Immortal Law of the Upper Realms, I would see no hope of catching up with you.”<br/><br/>Fang Wang raised an eyebrow and inquired, “Didn’t you say that Immortal Law and Divine Skills cannot be cultivated in the human world?”<br/><br/>“Indeed, they cannot. But I’ve found a treasure that can elude the Heavenly Dao. What, you want to learn? If you do, without a treasure to conceal it, you’ll surely draw the attention of the Upper Realm. Even if you don’t wish to ascend later, you will face endless trouble,” Zhou Xue said with a light laugh.<br/><br/>Fang Wang watched her closely and said, “In that case, I shall not learn it. The cultivation techniques of this world may not necessarily be inferior to the Immortal Law of the Upper Realms.”<br/><br/>Zhou Xue raised her hand to support her fair chin and said, “There might indeed be Dao techniques hidden among mankind that are no less powerful than Immortal Law. Otherwise, there wouldn’t be cases of the lower realms challenging the higher, and not just once. However, acquiring such Dao techniques won’t be easy for you.”<br/><br/>Fang Wang asked, “Tell me, what do you want? You didn’t come just to congratulate me.”<br/><br/>Zhou Xue’s smile curled up as she said, “Take good care of that snake beside you; it’s about to transform into a dragon, and it will bring calamities upon you.”<br/><br/>“Oh? Be more specific,” Fang Wang pressed.<br/><br/>Zhou Xue began, “The founders of the Ji Hao Sect, Zhu Changsheng and Ji Rutian, seek to claim the True Dragon Vital Essence. Little do they know that the True Dragon has inherited the legacy of the Ancient True Dragon Race. During the thousands of years it’s been suppressed, it has been cultivating all the while. Using the power of Zhu Changsheng and Ji Rutian to break its seal, it has transformed into the True Dragon Vital Essence and merged with the world. From now on, any demon with even a trace of the True Dragon Bloodline will transform into a dragon. Dragons being the most noble of all demons and rich in treasures, humans and demons alike will hunt down members of the True Dragon Clan in a frenzy.”<br/><br/>Fang Wang frowned and asked, “Did you know Ji Rutian had such plans? Why didn’t you intervene?”<br/><br/>Zhou Xue laughed, “Because I, too, desire the treasures of the True Dragon, and I have much to gain.”<br/><br/>“Furthermore, when myriad demons transform into dragons, the incarnated True Dragon Vital Essence, Xian Long, will choose a descendant to become the Dragon King, bringing great calamity to the human world. This will also be one of the reasons for the descent of the Upper Realms in the future.”<br/><br/>Fang Wang couldn’t help asking, “Who will this Dragon King be?”<br/><br/>Zhou Xue shook her head, “The fates of the heavens and earth have already changed; the Dragon King won’t be the same as before. If it’s your Xiao Zi, you need to be careful. Once it transforms into the Dragon King, the Soul-Binding Curse will no longer suppress it, and it will awaken the memories of the True Dragon Clan, revealing its true nature.\t\t\t\t\t\t</div>", "images": {}, "success": true}