{"id": 227, "url": "https://www.novelhall.com/i-became-an-immortal-on-mortal-realm-32879/14538452.html", "title": "Chapter 227 - Chapter 227: Chapter 224 True Dragon Princess", "volume": 3, "volume_title": "Volume 3", "body": "<h1>Chapter 227 - Chapter 227: Chapter 224 True Dragon Princess</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 227: Chapter 224 True Dragon Princess<br/><br/>Translator: 549690339<br/><br/>Hearing Fang Zigeng’s words, Luo Yi didn’t tense up; she instead covered her mouth and chuckled, “When my father entered the Supreme Pond back then, he received a similar warning. Don’t worry, my father has always been concerned about this issue. Ever since you saved me, I have not gone out alone.”<br/><br/>Fang Zigeng nodded and reached out to take Luo Yi’s hand.<br/><br/>Sitting down with him, Luo Yi leaned her head on his shoulder, and the couple began to chat softly.<br/><br/>The five shadows behind Fang Zigeng didn’t dissipate with the end of his cultivation; they continued to sit in meditation, even capable of absorbing nature’s Spiritual Energy.<br/><br/>The news of monsters transforming into dragons wasn’t only obtained by the Supreme Sect; seas and continents all over the world received the message, with monsters transforming into dragons everywhere in the Mortal Realm.<br/><br/>The appearance of True Dragons was enough to drive Human Cultivators and monsters wild.<br/><br/>Yin<br/><br/>A dragon’s chant echoed throughout Grand Qi, audible to every being in the realm. Inside Sword Heaven Marsh, Sword Cultivators turned their heads to look, and even The Three Immortals of the Emperor Sea and Dugu Wenhun appeared on the rooftops, gazing into the distance.<br/><br/>“Is this… a dragon?”<br/><br/>“Yes, it definitely is a dragon, exactly like the ones described in legends.”<br/><br/>“A place like Grand Qi is actually hiding a True Dragon?”<br/><br/>The Three Immortals of the Emperor Sea were extremely excited and immediately vanished from the rooftops, with Dugu Wenhun following close behind.<br/><br/>They had lived for so long, and this was their first time seeing a True Dragon; naturally, they were excited.<br/><br/>Over Sword Heaven Marsh’s lake area, the white light of a Formation shot up into the sky, making it impossible for onlookers to see inside.<br/><br/>At this moment, the interior presented a spectacular sight.<br/><br/>The purple cocoon that Xiao Zi had transformed into was over thirty meters in diameter, its purple aura swirling around, and the gusts of wind it created caused Fang Wang’s hair to flutter as he sat by the lakeside.<br/><br/>Upon closer inspection, one could see a huge figure, twisting inside the cocoon, with a form highly similar to a dragon’s.<br/><br/>Deer antlers, serpentine body, four claws—its movements exuded an overwhelming sense of oppression.<br/><br/>Zhao Zhen couldn’t help but approach Fang Wang and whispered, “Master, could you send me out? I can hardly stand it…”<br/><br/>As soon as he heard this, Fang Wang immediately sent the Soul Devouring Gourd and Zhao Zhen outside the Formation.<br/><br/>The might of a True Dragon was not only domineering in appearance but also emitted a Dragon’s Authority that reigned supreme over all creatures, a bloodline suppression.<br/><br/>The Authority of a True Dragon could subdue monsters and shake evil spirits. Zhao Zhen felt his soul could disperse at any moment, an extremely uncomfortable sensation.<br/><br/>After sending Zhao Zhen out, Fang Wang didn’t open his eyes and continued his cultivation.<br/><br/>Ripples spread across the lake in front of him as he used his Spiritual Power to strengthen the Formation, enhancing the isolating effect to prevent Xiao Zi from being exposed.<br/><br/>The influence of the True Dragon exceeded his expectations; he could feel more and more Cultivators’ presences heading in the direction of Grand Qi’s True Dragon, and even auras from the Nirvana Realm were closing in on Grand Qi.<br/><br/>Fang Wang diverted his attention back and continued to perceive the Nirvana Realm.<br/><br/>He was getting closer to making a breakthrough.<br/><br/>In the following month, the news of the True Dragons appearing spread wildly across the continent. Monsters were transforming into dragons in nearly every dynasty; some were subduing dragons, some were killing dragons, and some righteous sects stood up to protect the dragons. For a while, Grand Qi, which had been peaceful for decades, was plunged into turmoil again.<br/><br/>Grand Qi was merely a microcosm of the larger situation in the world, with the emergence of True Dragons stirring up conflicts all over the Mortal Realm.<br/><br/>A new era was beginning to unfold.<br/><br/>Days passed.<br/><br/>The process of Xiao Zi’s transformation into a dragon lasted for two full years. When she regained consciousness, True Dragons had appeared in various places across the world. The cultivation level of these True Dragons was based on their level before the transformation; those with higher cultivation before the transformation underwent more significant changes.<br/><br/>Inside the Formation, the purple cocoon dissipated like smoke, revealing a nearly sixty-meter-long Purple Dragon. Its body was elegant, with Purple Dragon Scales shimmering coldly under the sunlight, dragon whiskers fluttering like flames, and its horns so long they nearly matched the length of its head.<br/><br/>Its dragon eyes trembled slightly, then slowly opened, revealing a pair of eyes like jade, sparkling and mysterious.<br/><br/>Xiao Zi’s gaze had become utterly different from before; the mischievousness and playfulness were gone, replaced by majesty.<br/><br/>True Dragon, a race that soars above all living beings!<br/><br/>Xiao Zi felt an unprecedented strength.<br/><br/>Transforming into a dragon in one fell swoop was more effective than hundreds of years of its cultivation.<br/><br/>Xiao Zi slowly lowered its eyes, its gaze falling on the figure meditating by the lake, yet its expression did not change.<br/><br/>The purple Demonic Qi surged within the Formation, making everything appear so mystical. Xiao Zi hovered in the air, quietly gazing down at Fang Wang.<br/><br/>After a long time.<br/><br/>Xiao Zi lowered its head, bringing its Dragon Head close to Fang Wang.<br/><br/>Its dragon mouth stopped in front of Fang Wang, with two whiskers fluttering as if they were long scarves, giving the impression of an invisible dancer twirling gracefully, displaying her dance.<br/><br/>Fang Wang, with his eyes closed, asked, “How do you feel?”<br/><br/>Xiao Zi’s Dragon Head, akin to the size of a loft, could swallow Fang Wang in one bite. It looked down at Fang Wang and softly answered, “Very good, better than I have ever felt before.”<br/><br/>It was still the same charming female voice, but compared to its former vulnerability, it now had a tone of arrogance.<br/><br/>Fang Wang opened his eyes and made eye contact with it.<br/><br/>Tsk tsk.<br/><br/>This aura is already comparable to that of someone in the Mahayana Realm, such a drastic metamorphosis.<br/><br/>Could it truly have been chosen as the Dragon King?<br/><br/>Xiao Zi softly said, “I’ve really transformed into a dragon and awakened the memories of my past. I was the last princess of the True Dragon Clan. The Descending Dragon Great Saint kept my soul in the Great Saint’s Grotto-Heaven until one day, a serpent sneaked into the Great Saint’s Grotto-Heaven, giving me a chance. In truth, even without Xian Long’s sacrifice, my dragon soul would’ve influenced this serpent body and turned it into a dragon sooner or later.”<br/><br/>A wistful look appeared in its eyes.<br/><br/>Fang Wang calmly asked, “Then what should your name be now?”<br/><br/>Xiao Zi snapped back to reality, staring intently at Fang Wang, remaining silent.<br/><br/>The ripples on the lake’s surface came to a halt, and apart from the sound of the wind, there was no other noise between heaven and earth.<br/><br/>A while later.<br/><br/>A smile appeared on Fang Wang’s face.<br/><br/>Xiao Zi blinked and smiled, “Naturally it’s still Xiao Zi, young master. I’ve promised to accompany you for a lifetime, no, for eternity.”<br/><br/>As its words fell, it suddenly shrank and plunged directly into Fang Wang’s arms.<br/><br/>Even when shrunken, it still looked quite large; its dragon body was nearly two meters long. It hooked its forepaws over Fang Wang’s shoulders and stuck out its tongue, seeking to lick Fang Wang’s face.<br/><br/>Fang Wang held it back, saying with annoyance, “You’ve turned into a dragon now, so why do you still have this habit?”<br/><br/>Xiao Zi playfully said, “Young master, it’s because I like you. Have you ever seen me lick anyone else before?”<br/><br/>Even though it said that, Fang Wang still restrained it.<br/><br/>“Tell me about your changes,” Fang Wang said softly.<br/><br/>Xiao Zi began to recount the memories of its awakening.<br/><br/>In the era of the Descending Dragon Great Saint, the True Dragon Clan had already been driven to the brink of extinction. They hid in the deep sea, far from human beings, isolated from the world, until the Descending Dragon Great Saint appeared.<br/><br/>The Descending Dragon Great Saint, in order to prove his name, slaughtered half of the True Dragon Clan and forced the survivors to become his mounts and pets. When Xiao Zi was born, its father was already the mount of the Descending Dragon Great Saint. Before it had grown up, it witnessed Immortal Gods descending to the mortal realm. Ultimately, the Descending Dragon Great Saint fell, and all Saint Spirits associated with him, including it, died.<br/><br/>When its dragon soul awoke, it was already in the Great Saint’s Grotto-Heaven.<br/><br/>As it turned out, its father had anticipated this calamity and begged the Descending Dragon Great Saint to save his soul. The Descending Dragon Great Saint agreed, and Xiao Zi’s dragon soul wandered the Great Saint’s Grotto-Heaven with the souls of the Descending Dragon Great Saint, his generals, and maidservants.<br/><br/>Day after day, until one day, Xiao Zi accidentally entered the body of a serpent. It originally wanted to leave, but the Descending Dragon Great Saint sealed its memories.<br/><br/>“The Descending Dragon Great Saint sealed my memories, probably calculating something. Young master, you shouldn’t think too highly of him,” Xiao Zi cautioned.<br/><br/>Now, when speaking of the Descending Dragon Great Saint, its tone was indignant, stripped of any former reverence.<br/><br/>Fang Wang nodded and then said, “Tell me about the Immortal Gods of the Upper Realm.”<br/><br/>He had always been curious about the Upper Realm, viewing the Immortal Gods there as hypothetical enemies, wanting to understand their intelligence in advance.<br/><br/>Xiao Zi’s dragon body trembled and said, “Young master, the Immortal Gods are truly terrifying. The Descending Dragon Great Saint was an invincible presence in the human world, with plenty of cultivators in the Heaven-Breaking Realm under him, and there were even more powerful beings beyond the Heaven-Breaking Realm. But the Upper Realm only sent one Immortal God to suppress the Descending Dragon Great Saint and his regime…”<br/><br/>Shuddering at the memory of that ancient past, Xiao Zi continued.<br/><br/>Fang Wang listened intently.<br/><br/>Xiao Zi had not seen the true form of that Immortal God, only a palm larger than the entire Descending Dragon Continent falling down. The might of that single palm made it lose consciousness instantly, and when it awoke, only the dragon soul remained, with details of that battle learned from other perished souls.<br/><br/>So the time passed, a whole hour.<br/><br/>After hearing Xiao Zi recount the past, Fang Wang was deeply stirred and said, “For now, you should not go out. Wait until I break through, and then we will leave this Formation together. Right now, all living beings in the world are hunting True Dragons, and I need greater strength to protect you.”<br/><br/>Xiao Zi obediently coiled up beside him and said softly, “Don’t worry, young master. I’ve let go of the past of the Dragon Race; I won’t cause you any trouble.”<br/><br/>Fang Wang asked, “If all the dragons in the world were slaughtered, leaving only you, would you be content?”<br/><br/>“Of course, I would be content. What do the present-day True Dragons have to do with me? They’re just mixed-blood monsters with a bit of True Dragon Bloodline. Once you become the strongest in the human world, we can still have dragon children and grandchildren and recreate the True Dragon Clan,” Xiao Zi said indifferently.<br/><br/>Fang Wang’s mouth twitched. Although dragons are nobler than snakes, he wasn’t quite ready for that taste.<br/><br/>“Quit having such crooked thoughts!”<br/><br/>Fang Wang vigorously rubbed Xiao Zi’s dragon head, noting that the furry dragon head was more enjoyable to touch than a slick snake head.<br/><br/>Xiao Zi laughed but said no more.<br/><br/>Afterward, Fang Wang began his cultivation practice, while Xiao Zi lay beside him, curling its body around him and continued to sleep.<br/><br/>It wanted to seek the ancestral legacy of the True Dragon Clan in its dreams.<br/><br/>Over these two years, observing Xiao Zi’s transformation, Fang Wang had already conceived thoughts of Nirvana. He was not far from his breakthrough.<br/><br/>He even began to contemplate creating his eighth Lifespirit Treasure!<br/><br/>This time, he did not want to borrow the power of the Heavenly Palace but rather wanted to create a treasure that embodied Nirvana!<br/><br/>Days passed.<br/><br/>Every day, cultivators visited and departed from Sword Heaven Marsh, and the various conflicts stirred up by the True Dragons became a common topic of conversation among cultivators during their leisure time.<br/><br/>Nowadays, subduing a True Dragon had become a mark of a Great Cultivator.<br/><br/>What could be more splendid than riding dragons and roaming the universe?<br/><br/>The Three Immortals of the Emperor Sea also hunted a dragon and distributed its treasures between Chu Yin and Fang Bai, nurturing great hopes for these two juniors.\t\t\t\t\t\t</div>", "images": {}, "success": true}