{"id": 221, "url": "https://www.novelhall.com/i-became-an-immortal-on-mortal-realm-32879/14518016.html", "title": "Chapter 221 - Chapter 221: Chapter 218 There Is Only One Man In This World Who Can Call Himself Sword Immortal", "volume": 3, "volume_title": "Volume 3", "body": "<h1>Chapter 221 - Chapter 221: Chapter 218 There Is Only One Man In This World Who Can Call Himself Sword Immortal</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 221: Chapter 218 There is Only One Man in This World Who Can Call Himself Sword Immortal<br/><br/>Translator: 549690339<br/><br/>Since Miao Wufa had stated that he only wished to keep one soul, Fang Wang naturally wanted to fulfill his request!<br/><br/>It wasn’t just Miao Wufa whom Fang Wang satisfied, but also the many sword cultivators who were witnessing it for the first time. As he clenched his fist, the oppressive might of the Nine Dragons Tyrant Fist enveloped the entire heavens and earth, moving everyone present.<br/><br/>Even those cultivators who had previously experienced the Nine Dragons Tyrant Fist once again felt their hearts tremble.<br/><br/>The smile on Miao Wufa’s face froze, and his gaze became solemn.<br/><br/>Fang Wang let out a soft chuckle, then swung his fist.<br/><br/>This punch was as swift as ever, so fast that Miao Wufa had no chance to react.<br/><br/>Miao Wufa was not a cultivator of the Mahayana Realm but of the first layer of the Nirvana Realm, which was why he stood out among the many challengers.<br/><br/>The Black Dragon surged out fiercely, crossing his physical body in an instant. The Black Dragon’s speed was indeed too fast, so fast that everyone’s eyes couldn’t keep up.<br/><br/>Yin<br/><br/>Before the dragon’s chant ceased, both the Black Dragon and Miao Wufa’s figures had vanished, with the pressure of the Nine Dragons Tyrant Fist lingering still in the Mortal Realm.<br/><br/>The world fell silent.<br/><br/>All the challengers felt a lingering fear in their hearts, thinking that Miao Wufa had died.<br/><br/>At that moment, Miao Wufa’s soul manifested high in the sky, his face full of fear.<br/><br/>Fang Wang asked, “How was that punch?”<br/><br/>Miao Wufa looked towards Fang Wang and managed a strained smile, “You live up to your reputation, I concede…”<br/><br/>Fang Wang smiled and turned to fly back to the wooden bridge, followed by thunderous cheers from Sword Heaven Marsh.<br/><br/>The outcome was not unexpected, but just witnessing Tian Dao in action satisfied everyone, making their journey worthwhile.<br/><br/>After his defeat, Miao Wufa did not leave Sword Heaven Marsh. He smartly chose to stay and recover from his injuries, leaving the challengers who wished to plot against him seething in silence.<br/><br/>This battle quickly spread throughout the world, and Miao Wufa’s name from Jin Xiao Sect became the talk amongst cultivators everywhere.<br/><br/>Though Miao Wufa had lost, he was the first cultivator bold enough to request to be left with only his soul, which made people very curious about how high his realm truly was.<br/><br/>As Miao Wufa’s name shook the world, the reputation of Jin Xiao Sect on the continent grew even stronger.<br/><br/>The challenges at Tian Dao continued, and Fang Wang had no intention of stopping them.<br/><br/>It’s worth mentioning that towns and sects began to appear in the mountains and forests surrounding Sword Heaven Marsh.<br/><br/>Before, it was difficult to see anyone from the Condensation Spirit Realm or the Cross-Void Realm in Grand Qi. Nowadays, the name of the Golden Body Realm has spread throughout Grand Qi; there are countless Mahayana cultivators walking in the mountains and fields of Grand Qi.<br/><br/>Three years had passed in the blink of an eye.<br/><br/>Fang Wang successfully broke through to the fifth layer of the Mahayana Realm. Although Sword Heaven Marsh was crowded, it did not affect his cultivation. Although he was indifferent, his cultivation opened the eyes of all the visitors.<br/><br/>His Qi Gathering speed and momentum were simply too astonishing!<br/><br/>Over the past three years, Fang Wang had maintained the practice of acting once a month. He made Grand Qi the place with the most intense cultivation atmosphere on the continent in recent years, causing other dynasties to envy but dare not play tricks on Grand Qi.<br/><br/>Inside a pavilion in Sword Heaven Marsh.<br/><br/>Song Jinyuan, looking at the people standing in the hall, said, “If you are here to deliver gifts to the Fang Family, then go to Southern Hills City. Tian Dao will not personally receive you.”<br/><br/>These people were from Emperor Sea Supreme Sect, and the man leading them, who called himself Luo Chen, gave Song Jinyuan a profound and unfathomable impression, but Song Jinyuan was not afraid.<br/><br/>Who would dare to cause trouble in Sword Heaven Marsh?<br/><br/>With Fang Wang’s support, Song Jinyuan dared to be unyielding to anyone!<br/><br/>“Could you give me a chance to challenge Tian Dao?” Luo Chen asked seriously. Faced with Song Jinyuan’s refusal, he was not angry.<br/><br/>People from Emperor Sea knew Fang Wang’s terror more than those from the mainland.<br/><br/>In the eyes of people around the world, Fang Wang was a savior, but to the beings of Emperor Sea, Fang Wang was a killing god who had disrupted the Emperor Sea’s stability that had lasted for a thousand years. No matter how proud Luo Chen was by nature, he did not dare to offend Fang Wang.<br/><br/>Song Jinyuan laughed and said, “I’m not in a position to decide that. You need to defeat or convince the current strongest challenger. As long as you succeed, once you take a punch from Tian Dao, your name will resound throughout the world.”<br/><br/>Luo Chen fell silent for a moment, then smiled, “Alright.”<br/><br/>Having said that, he bowed and prepared to lead his people away.<br/><br/>“Wait, considering the marital alliance between the Supreme Sect and the Fang Family, I will give you a heads up. The current strongest challenger, one of the Four Heroes of Southern Celestial Sea, goes by the name Ji Haotian. He is extraordinarily powerful. You might want to visit the Fang Family first and avoid him, then come back next month to challenge,” Song Jinyuan said.<br/><br/>Luo Chen paused in his steps and without turning back said, “Ji Haotian? Never heard of him.”<br/><br/>In the face of Tian Dao Fang Wang, he might yield, but there was no second person on this continent worthy of his awe!<br/><br/>As for the Southern Celestial Sea, he paid it no mind as well!<br/><br/>A few days later.<br/><br/>“I am Ji Haotian, hailing from the Southern Celestial Sea, here to experience the Nine Dragons Tyrant Fist of Tian Dao!”<br/><br/>A booming voice echoed through Sword Heaven Marsh, causing countless cultivators who had been waiting to look up, focusing their gazes upon Ji Haotian in the sky.<br/><br/>Ji Haotian was dressed in a black robe, exuding an imposing manner, with a royally domineering presence in every move. He bore a strong resemblance to Ji Rutian, but appeared even more imposing.<br/><br/>Luo Chen and the disciples of Supreme Sect stood by the lake, their gazes complex as they looked at him.<br/><br/>“Wonder if this guy can force Tian Dao to unleash a second punch.”<br/><br/>“He is indeed strong. Feels like he can contend with the Nirvana Realm.”<br/><br/>“Has there been a Nirvana Realm cultivator challenging Tian Dao before?”<br/><br/>“Not sure, but I guess Ji Haotian will be the strongest challenger.”<br/><br/>Listening to the discussions of other disciples behind him, Luo Chen tried to calm his emotions.<br/><br/>It wasn’t just them; other cultivators were also discussing Ji Haotian’s strength.<br/><br/>Over the past month, Ji Haotian had shown tremendous strength, practically sweeping away all other challengers, which made many place their hopes in him.<br/><br/>Could Ji Haotian force Tian Dao to launch a second punch?<br/><br/>Fang Wang soared into the air, matching Ji Haotian’s altitude, and asked, “What is your relationship with Ji Rutian?”<br/><br/>Ji Haotian frowned and said, “He is my younger brother. I don’t know why Tian Dao is acquainted with him?”<br/><br/>Fang Wang smiled and replied, “I’ve seen him a few times. He’s very strong. To have two geniuses like you in one family, I fear you might produce a prodigy.”<br/><br/>Upon hearing this, Ji Haotian wasn’t pleased, but his eyes instead revealed a murderous intent, not toward Fang Wang, but towards Ji Rutian.<br/><br/>He took a deep breath and said, “Is that so? It seems I must go back and meet this brother of mine, to see what he is capable of now.”<br/><br/>Fang Wang didn’t say any more and raised his right hand, slowly clenching it into a fist.<br/><br/>The domineering pressure descended once again!<br/><br/>Like the challengers before him, Ji Haotian’s expression turned grave in an instant.<br/><br/>He had estimated Fang Wang’s strength as highly as possible, but when he truly felt the might of the Nine Dragons Tyrant Fist, he was still shocked to the core.<br/><br/>Dugu Wenhun and The Three Immortals of the Emperor Sea stood side by side. He murmured softly with a sigh, “His fist increasingly possesses the might of Heavenly Might.”<br/><br/>The Three Immortals of the Emperor Sea agreed in unison, then started comparing the strength of the Heavenly Emperor Imperial Mirror and the Nine Dragons Tyrant Fist.<br/><br/>Under the gaze of all, Fang Wang threw his punch.<br/><br/>This punch was still earth-shattering!<br/><br/>After the punch, Ji Haotian was still in the air, not even raising his hand, motionless.<br/><br/>When the terrifying pressure swept past, everyone looked up, their eyes settling on him to see Ji Haotian with his eyes wide, bloodshot with fear.<br/><br/>In his pupils, the ferocious dragon head of the Black Dragon still lingered, filling him with fear.<br/><br/>Fang Wang could feel that Ji Haotian’s Spiritual Power was comparable to the Nirvana Realm, so this time his punch was heavier than the previous ones. Although he retracted his strength in time, not injuring Ji Haotian, it was enough to leave a psychological shadow on him.<br/><br/>Fang Wang withdrew his fist and turned to fly downwards.<br/><br/>Boom!<br/><br/>Sword Heaven Marsh erupted into chaos.<br/><br/>Ji Haotian, who had high expectations placed upon him, ended up like the other challengers before him, without even a chance to react defensively.<br/><br/>Luo Chen was also frightened. When he lost to Ji Haotian, Ji Haotian had given him a feeling of invincibility.<br/><br/>Such a powerful figure was unable to respond in the face of Tian Dao.<br/><br/>Just thinking about the terrifying pressure that flashed by earlier, he couldn’t imagine what it felt like to face that punch head-on.<br/><br/>Sword Heaven Marsh descended into an uproar, as Fang Wang’s figure landed on the bridgehead, obscured by the mist.<br/><br/>Ji Haotian stood still in the air for a long time before leaving.<br/><br/>No one stopped him. Although he had appeared embarrassed in front of Tian Dao, over this month he had proven his strength.<br/><br/>“I told you, no one in this world can withstand a punch from Tian Dao. Tian Dao used two punches to kill Wen Li because the first punch was just a probe,” said Gu Tianxiong with his arms crossed over his chest and an air of smugness, as if he were Tian Dao himself.<br/><br/>The surrounding Sword Servants followed with exclamations. Over the years, every challenger arrived with an invincible aura, but in the face of Fang Wang, they all seemed to crumble.<br/><br/>In their hearts, Fang Wang had become an invincible existence in the world!<br/><br/>On the edge of the continent, waves crashed against the rocks on the beach.<br/><br/>A young man in white stood on a rock, continuously swinging his sword. There were only sword moves, no Sword Qi, and the moves were limited to two types.<br/><br/>Draw the sword!<br/><br/>Vertical slash!<br/><br/>Again and again!<br/><br/>Over and over, tirelessly.<br/><br/>Occasionally, waves splashed onto him, but he remained unmoved, continuing to practice his swordsmanship even though he was soaked through.<br/><br/>The setting sun dipped towards the end of the sea level, and at that moment, a figure approached across the waves from the horizon.<br/><br/>It was a handsome man in blue with two swords at his waist and a bamboo hat resting on his head, his gaze sharp and cold.<br/><br/>It was Xu Qiuming!<br/><br/>Xu Qiuming’s gaze fell on the young man in white, his steps unhurried.<br/><br/>After a while.<br/><br/>He came ashore and took seven steps on the sand. He stopped, his figure perfectly aligning with the young man in white, ten paces apart.<br/><br/>Xu Qiuming spoke, “Your sword is not simple.”<br/><br/>The young man in white stopped and glanced sidelong at Xu Qiuming, “Your Sword Intent is also not simple, the strongest I’ve ever seen.”<br/><br/>“I am Xu Qiuming.”<br/><br/>“You may call me the Sword Immortal.”<br/><br/>“Oh?”<br/><br/>Xu Qiuming turned around, slightly raised his head, and looked down on the Sword Immortal with a cold tone, “In this world, only one person can call himself Sword Immortal.”<br/><br/>Unafraid, the Sword Immortal asked, “Are you suggesting yourself?”<br/><br/>“Not me, it’s Tian Dao Fang Wang.” Xu Qiuming stared back as he spoke.<br/><br/>Upon hearing this, the Sword Immortal’s brow furrowed slightly.<br/><br/>Xu Qiuming continued, “I had intended to experience Tian Dao’s Nine Dragons Tyrant Fist, but since I’ve encountered you, why don’t we have a spar? To speak only of Sword Dao and not of life or death.”<br/><br/>The Sword Immortal calmly replied, “My swordsmanship is handed down from a Great Saint. Once I draw my sword, to not speak of life or death is difficult.”<br/><br/>“Is that so? Well then, it’s perfect. I want to try out the Great Saint’s swordsmanship.”<br/><br/>Xu Qiuming’s right hand rested on the hilt of one of his swords at his waist. As his words fell, the trees swaying in the wind nearby came to a standstill.\t\t\t\t\t\t</div>", "images": {}, "success": true}