{"id": 220, "url": "https://www.novelhall.com/i-became-an-immortal-on-mortal-realm-32879/14518015.html", "title": "Chapter 220 - Chapter 220: Chapter 217: The World Shaken, The Wind Of Heavenly Dao", "volume": 3, "volume_title": "Volume 3", "body": "<h1>Chapter 220 - Chapter 220: Chapter 217: The World Shaken, The Wind Of Heavenly Dao</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 220: Chapter 217: The World Shaken, The Wind of Heavenly Dao<br/><br/>Translator: 549690339<br/><br/>“I wish to experience the might of the Nine Dragons Tyrant Fist.”<br/><br/>Chen Shang’s voice echoed within Sword Heaven Marsh, drawing more and more sword cultivators to the lakeside, peering at his silhouette.<br/><br/>They had never heard the name Chen Shang before, but since he claimed to hail from the Southern Celestial Sea, it was apparent he was no ordinary person.<br/><br/>People from the mainland inherently harbored a wariness towards the overseas cultivation world, a fear rooted in the unknown.<br/><br/>“You wish to experience the Nine Dragons Tyrant Fist? Don’t forget, eighty years ago, you nearly died by my hands. Even I couldn’t withstand his punch!” Dugu Wenhun taunted coldly.<br/><br/>Fang Wang could sense his intention to save Chen Shang; there was no need for him to intervene otherwise.<br/><br/>However, the current Fang Wang harbored no intent to kill. In his view, normal sparring and exchange of pointers were acceptable.<br/><br/>Chen Shang did not resort to any trickery; he faced him head-on. Fang Wang was willing to let Chen Shang learn from his fist and, incidentally, establish the prestige of the Nine Dragons Tyrant Fist.<br/><br/>“I’ve lost to many in life, but to the same person, I will not lose a second time. I will constantly surpass strong opponents. Dugu Wenhun, you’re no longer my match. I appreciate your concern, but my mind is made up. Should I die under the fist of the Heavenly Dao, it’s of no consequence. I, Chen Shang, have cultivated for over three hundred years and have no more attachments.”<br/><br/>Chen Shang’s voice rose, allowing everyone to feel his resolute determination.<br/><br/>Dugu Wenhun wanted to say more, but at that moment, Fang Wang stood up.<br/><br/>“Since it’s a spar, why talk of life and death? Isn’t it right for cultivators to duel and exchange pointers?”<br/><br/>Fang Wang spoke gently, his words spreading throughout Sword Heaven Marsh, instantly dissipating the tense atmosphere. Everyone could feel the magnanimous aura about him.<br/><br/>Indeed, he is the greatest cultivator under the heavens!<br/><br/>Impressive!<br/><br/>Standing on the peak, Chen Shang, dressed like a swordsman, positioned himself at the edge of a cliff. His robe was covered in patches, his face unshaven, and his weathered features framed by long hair carelessly tied back with a jade hairpin.<br/><br/>At first glance, it was hard to associate him with the reputation of one of the Southern Celestial Four Heroes. Compared to Dugu Wenhun, he seemed lacking in both appearance and aura.<br/><br/>Yet, his most striking feature was his eyes, the sharpness within rare in the world.<br/><br/>Hearing Fang Wang’s words, Chen Shang raised both hands in salute towards Fang Wang, saying, “Thank you. Regardless of the outcome, I owe you a favor.”<br/><br/>Dugu Wenhun inwardly sighed with relief. Just as he was about to speak, Fang Wang leapt into the air.<br/><br/>Chen Shang followed suit, stepping high into the skies, with all eyes within Sword Heaven Marsh fixed upon the two of them.<br/><br/>The pair confronted each other a thousand feet high, a hundred yards apart.<br/><br/>Chen Shang raised his right palm; nature’s spiritual energy surged towards the palm of his hand, a mighty aura coalescing.<br/><br/>“I’ve hit a bottleneck in my cultivation. I’m curious to see how strong you are, having defeated the Great Saint,” Chen Shang said, fixing his gaze on Fang Wang.<br/><br/>Fang Wang laughed, “Do you wish to pit your ultimate technique against my fist?”<br/><br/>“Accumulating precious spirits is pointless. I stand no chance against you. What I must do is survive your fist as best as I can,” Chen Shang replied.<br/><br/>Fang Wang shook his head with a chuckle and, without saying more, slowly raised his right hand, forming it into a fist.<br/><br/>A domineering presence far surpassing Chen Shang instantly enveloped all of nature, causing Chen Shang’s complexion to turn solemn, while all the sword cultivators of Sword Heaven Marsh couldn’t help but be moved.<br/><br/>Chen Shang’s aura was concentrated in his palm, whereas Fang Wang’s aura faced the whole world, overwhelming and irresistible.<br/><br/>Utterly dominant!<br/><br/>Gu Tianxiong stood by the lakeside, looking up at Fang Wang’s silhouette, and muttered, “He could’ve been the Sword Saint, but wastes his talent flinging punches every day.”<br/><br/>Fang Wang stared at Chen Shang, asking, “Are you ready?”<br/><br/>Taking a deep breath, Chen Shang realized only when Fang Wang clenched his fist just how strong Fang Wang must be to have defeated the Great Saint.<br/><br/>Even if the Great Saint was possibly not at his peak, he was still the Great Saint!<br/><br/>Chen Shang raised his palm, with spiritual power flowing from the center, swiftly swirling around his body as though flames were burning upon him.<br/><br/>Fang Wang’s mouth curved slightly upward and he swung his fist ferociously, his punch as swift as the torrential flow of ancient times, too fast for Chen Shang’s eyes to keep up.<br/><br/>Hum<br/><br/>The sound of a dragon’s roar exploded!<br/><br/>In Chen Shang’s pupils appeared the image of a Black Dragon’s head, its gaping maw lunging at him.<br/><br/>Damn!<br/><br/>Chen Shang stiffened, unable to lift his right palm.<br/><br/>Under the watchful eyes of all sword cultivators in Sword Heaven Marsh, a black dragon suddenly appeared but vanished in the blink of an eye, as if it was an illusion.<br/><br/>Everyone understood it was no illusion; the instant the black dragon appeared, they all felt a breath of death.<br/><br/>All were frightened, their skin crawling with fear, even Dugu Wenhun felt a secret shock.<br/><br/>Though not as imposing as when Fang Wang faced off against Heaven’s Larceny Saint Sect, he always felt Fang Wang had grown much stronger, and this intuition made him feel ashamed.<br/><br/>Compared to Fang Wang, the Southern Celestial Four Heroes seemed like a joke.<br/><br/>Fang Wang withdrew his fist, his eyes falling on Chen Shang, whose face was covered in cold sweat. Behind him, the firmament showed no trace of clouds, and the forests upon the great earth still shook violently, like tumultuous waves.<br/><br/>Fang Wang had already retracted his power, sparing Sword Heaven Marsh any impact. But even so, his presence was frighteningly imposing.<br/><br/>Chen Shang, one of the Southern Celestial Four Heroes, stood there, his expression dumbstruck.<br/><br/>Chen Shang, a veteran of countless battles, had encountered numerous formidable enemies but had never felt such a terrifying sensation before.<br/><br/>He was not suppressed by the momentum, but he had no chance to react just now. Facing the Nine Dragons Tyrant Fist, he directly lost the power to resist.<br/><br/>Dugu Wenhun had never seen Chen Shang in such a state before. Even if Chen Shang were defeated or facing death in the past, he always seemed extremely dangerous. But now, he looked so downcast, exuding a spirit of timidity and weakness throughout his body.<br/><br/>Fang Wang opened his mouth and asked, “How was my fist?”<br/><br/>Chen Shang regained his senses. He found his palms trembling uncontrollably. Raising his eyes to look at Fang Wang, he took a deep breath and said, “Worthy of being the world’s number one fist. I yield, thank you for sparing my life.”<br/><br/>Fang Wang smiled, turned, and flew down. Cheers followed from within Sword Heaven Marsh.<br/><br/>Although Chen Shang did not care about the gazes of others, such a crushing defeat was hard for him to bear. After saluting Fang Wang across the distance, he turned and left.<br/><br/>Dugu Wenhun immediately followed him.<br/><br/>Fang Wang landed at the head of the bridge, with Xiao Zi promptly coming up to flatter him.<br/><br/>The Sword Cultivators discussed in small groups, all of them very excited.<br/><br/>Chu Yin stood at the gate, wondering if he should learn a set of fist techniques since, even though his Spiritual Power was vast, he lacked a domineering combat method.<br/><br/>Fang Bai stood by the lake, his eyes filled with confusion.<br/><br/>Gu Tianxiong began to boast about his acquaintance with Fang Wang again, saying he had recognized Fang Wang’s extraordinary abilities long before Fang Wang became famous. He even disregarded their seniority to become sworn brothers, which earned the admiration of other Sword Cultivators.<br/><br/>Fang Wang continued to start his Cultivation.<br/><br/>He had a feeling that such troubles wouldn’t be few, but he was also looking forward to them.<br/><br/>And sure enough.<br/><br/>Two months later, the second person came to experience Fang Wang’s Nine Dragons Tyrant Fist, also a Cultivator from the Mahayana Realm, from overseas.<br/><br/>Fang Wang did not kill, only using his fist to scare.<br/><br/>This Mahayana Realm Cultivator was so frightened that he knelt in front of Fang Wang on the spot, faring even worse than Chen Shang.<br/><br/>His performance led the Sword Cultivators of Sword Heaven Marsh to think he was only at the Condensation Spirit Realm or the Cross-Void Realm.<br/><br/>Although the Cultivation communities of the different dynasties of the continent had opened communication, for the vast majority of Cultivators, the Mahayana Realm was unheard of.<br/><br/>After that, almost every month, someone came to challenge Fang Wang’s Nine Dragons Tyrant Fist.<br/><br/>The fourth challenger was at the Nirvana Realm, not from the Eternal Life Pavilion but a hidden Cultivator from the sea, who was also left with a shattered Dao heart by Fang Wang’s fist.<br/><br/>Not even the Black Dragon could penetrate their flesh. Just facing the might of the Nine Dragons Tyrant Fist was more than they could bear.<br/><br/>The news spread quickly, and the whole continent knew that the strong ones were taking turns to experience the might of the Nine Dragons Tyrant Fist. This led to more and more Cultivators heading south to join the excitement at Sword Heaven Marsh.<br/><br/>The number of powerful Cultivators in the Grand Qi Cultivation Realm continued to increase, and the Cultivation Techniques flowing into the Grand Qi Cultivation Realm became more numerous. Some families even moved to Grand Qi just to be closer to the Fang Family, to borrow from the Heavenly Dao’s wind.<br/><br/>Fang Wang had not expected his mercy to drive the development of the Grand Qi Cultivation Realm.<br/><br/>Later on, the number of challengers increased to the point where there were several people challenging Fang Wang in a single month. Therefore, Fang Wang instructed Dugu Wenhun to accept only one challenger per month from now on. As for whom the spot would be given to, he left the challengers to decide amongst themselves. But there was one condition: No loss of life was to occur.<br/><br/>A year later, Fang Wang’s image in the hearts of people around the world became even more imposing. With just one fist, he demonstrated his might and also made people realize the demeanor of a Cultivation master.<br/><br/>Gradually, a culture of gentlemanly duels emerged within Grand Qi, where disciples could exchange pointers without risking their lives, only to delve into the Dao.<br/><br/>This culture spread across the entire continent.<br/><br/>Who would force the Heavenly Dao to strike a second time became a favorite topic among Cultivators around the world.<br/><br/>In the scorching summer days.<br/><br/>The lakeside of Sword Heaven Marsh was full of Cultivator figures, as were the surrounding mountains—even the shapes of monsters could be seen.<br/><br/>At the bridgehead, Fang Wang stood up and stretched.<br/><br/>Countless eyes fell on him. No one thought him lazy; instead, they saw something profound in his posture.<br/><br/>“I am Miao Wufa from the Jin Xiao Sect, and I seek guidance from the Heavenly Dao. I hope the Heavenly Dao’s Nine Dragons Tyrant Fist can injure me, not just scare me like before.”<br/><br/>Accompanying this slightly arrogant voice, a figure flew high into the sky.<br/><br/>Fang Wang soared into the air to meet Miao Wufa at the same height, sizing him up.<br/><br/>Was this the one who saved Li Qingsong and Shen Buhui, the Ghost Saint Hand?<br/><br/>After that great battle ended, Fang Wang had inspected the Yang Energy of Li Qingsong and the others. Their lifespan had been set, and he had not expected them to survive. It spoke volumes about the height of Miao Wufa’s healing abilities.<br/><br/>Since he was from the Jin Xiao Sect, Fang Wang naturally would not be provoked by Miao Wufa’s challenge.<br/><br/>Fang Wang smiled and asked, “What degree of injury do you wish to receive?”<br/><br/>Miao Wufa appeared like a scholar powerless to truss a chicken, but he exuded a cold, serpentine aura. He licked his lips and with a sinister smile said, “Just leave me one soul.”<br/><br/>Discussions arose everywhere in Sword Heaven Marsh, and the Cultivators on the mountaintops exhibited indignant expressions. Many among them also wished to challenge the Heavenly Dao but unfortunately had been defeated by Miao Wufa.<br/><br/>Now, many challenged the Heavenly Dao hoping to make a name for themselves worldwide, as their opponent was no longer the Heavenly Dao but others, making it seemingly easier.<br/><br/>After over a year, it had evolved into a tradition that whoever challenged the Heavenly Dao was bound to become famous, because in the following month, all sects across the world would investigate their background, and the public was curious about the origins of those who dared to challenge the Heavenly Dao.<br/><br/>Naturally, many were dissatisfied that Miao Wufa managed to grab the spot.<br/><br/>Fang Wang narrowed his eyes and asked, “Are you ready?”<br/><br/>Miao Wufa’s shoulders shook, and a blast of white light emerged from the box on his back. A white paper umbrella popped out above his head, from which light poured down, forming a shield around him.<br/><br/>He displayed an excited, frenzied smile, waiting for Fang Wang to strike.\t\t\t\t\t\t</div>", "images": {}, "success": true}