{"id": 226, "url": "https://www.novelhall.com/i-became-an-immortal-on-mortal-realm-32879/14525509.html", "title": "Chapter 226 - Chapter 226: Chapter 223 Xiao Zi Transforms Into A Dragon, Taoist Heart Reaches Nirvana", "volume": 3, "volume_title": "Volume 3", "body": "<h1>Chapter 226 - Chapter 226: Chapter 223 Xiao Zi Transforms Into A Dragon, Taoist Heart Reaches Nirvana</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 226: Chapter 223 Xiao Zi Transforms into a Dragon, Taoist Heart Reaches Nirvana<br/><br/>Translator: 549690339<br/><br/>Xiao Zi will become the Dragon King?<br/><br/>Fang Wang, upon hearing Zhou Xue’s words, did not question it. Xiao Zi had been following him, influenced by his fate, and it was not impossible that it could become a Dragon King.<br/><br/>As Fang Wang drew nearer to the Nirvana Realm, he could indeed feel the existence of fate in the obscurity of the universe.<br/><br/>The so-called fate is not just luck but also the momentum formed by one’s life experiences. If the will of Xian Long had already dispersed throughout the world, formless and intangible, it was natural that it could observe Xiao Zi.<br/><br/>“Did you discover Ji Rutian’s movements, or did you already know of this matter in a past life?” Fang Wang asked.<br/><br/>Zhou Xue gave him a look and said, “Of course I found out. In this life, Ji Rutian’s fate clashes with yours; how could I not investigate? In my previous life, I only knew of Zhu Changsheng regarding the True Dragon Calamity, and the people of the world were unaware of the relationship between Ji Rutian and Zhu Changsheng.”<br/><br/>Fang Wang’s face showed curiosity, and he continued, “You actually managed to track down Ji Rutian. Did he not discover it?”<br/><br/>Zhou Xue snorted, “I assigned someone to follow Ji Rutian. That person doesn’t have other skills, but is an expert in hiding. Perhaps Zhu Changsheng could detect him, but Ji Rutian certainly could not. Based on the intelligence I have, although Zhu Changsheng is Ji Rutian’s master, Zhu Changsheng clearly has his own schemes, and I even suspect that he wants to seize Ji Rutian’s body.”<br/><br/>Fang Wang couldn’t help but smile upon hearing this.<br/><br/>Indeed, not everyone could have a smooth sailing journey. The nine Ascenders of the past must have experienced countless hardships to seize the opportunity for ascension.<br/><br/>From the past life, Ji Rutian was the one who had the last laugh.<br/><br/>As for Zhu Changsheng, Fang Wang did not feel much. The pinnacle of Ji Hao Sect was not comparable to Heaven’s Larceny Saint Sect.<br/><br/>Fang Wang then asked, “How many innocent lives will be involved in this True Dragon Catastrophe?”<br/><br/>Upon hearing this, Zhou Xue began sizing him up, as if seeing him anew.<br/><br/>Made uncomfortable by her gaze, Fang Wang couldn’t help but ask, “Why are you looking at me like that?”<br/><br/>Zhou Xue shook her head slightly and said, “Are you playing the savior, and have you grown accustomed to it? After saving the Jiu You Spring Eye calamity once, do you want to save from the True Dragon Calamity too? As you cultivate longer, you’ll realize that every calamity involving the mortal world is predetermined. You can block it once, twice, but can you keep on stopping it? Today you prevent the True Dragon Calamity, but it might entail another type of calamity and cause-and-effect.”<br/><br/>“Moreover, for the human race, this catastrophe is also a great opportunity. With your power alone, you won’t be able to stop it. By then, many Cultivators may come to seize the True Dragon by your side.”<br/><br/>Fang Wang said irritably, “Who says I want to play savior? I just want to assess the threat level of this calamity.”<br/><br/>Zhou Xue chuckled, “Is that so? I hope the righteousness in your bones doesn’t harm you. After all, Cultivation is about battling against the heavens. Cultivators only care about people who are relevant to their interests. Today, the Cultivators of this land may be grateful to you, but perhaps one day, your strength will make them feel it’s a calamity.”<br/><br/>Fang Wang said with a curled lip, “I save people following my heart, and I don’t care how they see me afterward. I only believe in my own strength. And don’t talk about me; you claim to be a Demonic Cultivator, but I see you as quite sentimental. You even saved Li Qingsong, who was already dying.”<br/><br/>“Who says demons can’t be sentimental?”<br/><br/>“Forget about it, let’s not talk about this anymore. Do you know of the Ascension Stairway?”<br/><br/>“Of course, I know; it’s a grand event for Cultivators worldwide. Why, are you interested?”<br/><br/>“That’s right, I want to participate. Going together, perhaps?”<br/><br/>“You want to compete with me?”<br/><br/>“Heh, you found me out,” Fang Wang said.<br/><br/>The two of them chatted in this bickering manner, and talking with Zhou Xue, Fang Wang felt his sense of urgency diminishing substantially.<br/><br/>Zhou Xue also maintained her smile, finding it strange to herself; although she considered him a junior, every time they talked, her mood inadvertently brightened.<br/><br/>After a long while.<br/><br/>Fang Wang opened his eyes and continued to stretch his limbs, enjoying the scenery of Sword Heaven Marsh.<br/><br/>The True Dragon Calamity, huh?<br/><br/>Let’s see how Xiao Zi changes. If it still cherishes him and wants to follow him, then even if it becomes a Dragon King sought after by the entire world, he would protect it.<br/><br/>If Xiao Zi wants to leave after becoming the Dragon King, Fang Wang would not stop it.<br/><br/>Fang Wang’s thoughts gradually withdrew, and he noticed that Sword Heaven Marsh had also changed.<br/><br/>The color of the lake water had changed, and the surrounding woods had also changed. These all were traces of the years.<br/><br/>Fang Wang began to experience these changes, and his heart quieted along with them.<br/><br/>From the Ninth Layer of the Mahayana Realm to the Nirvana Realm, the realization needed for the breakthrough was much more than before. Fang Wang had to ponder what Nirvana truly meant.<br/><br/>What kind of effect should the Nirvana he sought be?<br/><br/>The Heavenly Dao Immensity Scripture recorded the mental methods to break through to the Nirvana Realm, but the mental methods only recorded how to gather Qi and practice the techniques – high-level breakthroughs required the realization of one’s own path.<br/><br/>The Nirvana Realm was not a realm of martial arts; Cultivation required the comprehension of all things between heaven and earth.<br/><br/>Only by gaining insight into everything in the world can one become a True Immortal unconstrained by anything.<br/><br/>Fang Wang stood at the head of the bridge, slowly closing his eyes as time seemed to accelerate. Day turned to night, and the cycles of day and night passed by.<br/><br/>He stood there for a full year, and both Song Jinyuan and Xiao Zi, seeing his posture, didn’t dare to disturb him.<br/><br/>On this night.<br/><br/>Zhao Zhen hovered by the lotus pond, opening his eyes and looking at a lotus flower. In the heart of the flower, two Shariputras were placed.<br/><br/>This was a method provided by the Descending Dragon Great Saint, suggesting that placing the Shariputras in a place abundant with Spiritual Energy might yield miraculous effects.<br/><br/>Fang Wang had handed over the two Shariputras to him for decades, and he had never fully mastered them, which had become his fixation. He constantly guarded the Shariputras as he cultivated, never leaving them for a moment.<br/><br/>Zhao Zhen seemed to sense something, turned his head, and saw Xiao Zi coiled on a wooden stake by the lake, its mouth open, facing the bright moon.<br/><br/>Perceiving something off about Xiao Zi, and considering their connection through the Soul Devouring Gourd, Zhao Zhen asked, “What’s wrong?”<br/><br/>Xiao Zi did not answer. Its mouth opened slightly wider, then contracted a bit, but remained open all the while.<br/><br/>After observing for a while, Zhao Zhen thought it was cultivating and didn’t think much of it, starting his own cultivation practice as well.<br/><br/>While Xiao Zi gathered Qi for cultivation, the progress was its own, but when Zhao Zhen cultivated, he still had to contribute most of it to Xiao Zi.<br/><br/>By the time morning came, Xiao Zi shuddered all over, its serpentine eyes regaining clarity as it murmured to itself, “Strange… that dream felt so real…”<br/><br/>It didn’t dwell on it, as its heart had been uneasy in recent years, and dreaming was normal.<br/><br/>And so it was.<br/><br/>Four months passed in the blink of an eye.<br/><br/>One night, as Fang Wang was in the midst of cultivation, he suddenly opened his eyes and disappeared from where he was.<br/><br/>He arrived at Xiao Zi’s usual practice area, only to see Xiao Zi suspended above the lake surface, spiritual energy rushing toward it, intertwining with its demonic Qi, forming a purple cocoon with its silhouette becoming hazy within.<br/><br/>Fang Wang did not intervene but stood by the lake, quietly observing Xiao Zi.<br/><br/>The Three Immortals of the Emperor Sea and Dugu Wenhun suddenly appeared behind Fang Wang, their expressions odd.<br/><br/>Curiously, Dugu Wenhun asked, “What’s happening to it?”<br/><br/>The Three Immortals of the Emperor Sea followed with an answer.<br/><br/>“It seems to be transforming.”<br/><br/>“Unlike the typical transformation of a demonic creature, its aura is also changing.”<br/><br/>“Indeed, this change far exceeds the transformations brought about by a breakthrough in realm.”<br/><br/>Fang Wang remained silent, his gaze fixed on Xiao Zi.<br/><br/>After a long while.<br/><br/>Unable to bear their incessant chatter, Fang Wang finally said, “Retreat, and tell Senior Brother Song no one may approach this area henceforth.”<br/><br/>Upon hearing this, the four of them could only bow and take their leave, glancing back every three steps, curious about Xiao Zi’s transformation.<br/><br/>Zhao Zhen occasionally looked back at Xiao Zi, feeling no concern with Fang Wang present.<br/><br/>The night passed.<br/><br/>The purple cocoon enveloping Xiao Zi grew larger, more than two zhang in diameter and was still absorbing spiritual energy, even capable of drawing from the Earth Spirit Qi at the bottom of Sword Heaven Marsh.<br/><br/>Fang Wang closed his eyes, carefully sensing the process of Xiao Zi’s transformation into a dragon.<br/><br/>From snake to dragon, is it not a form of Nirvana?<br/><br/>Throughout the year, Fang Wang had been contemplating his own Nirvana, not merely that of his Lifespirit Treasure, but that would not suffice.<br/><br/>He wanted to be the strongest in the Mortal Realm, even surpassing the Upper Realm, meaning each of his breakthroughs had to be different from those of other cultivators.<br/><br/>At that moment, Fang Wang suddenly thought of his Combat Heart.<br/><br/>The power of the spirit was immense. The True Combat Technique didn’t directly increase a cultivator’s power, but once activated, it could leapfrog actual combat strength, not only by dispelling distractions but also by unifying intent with the body, resulting in reactions far surpassing the norm.<br/><br/>With a new thought in mind, Fang Wang began meditating right there.<br/><br/>Upon receiving Fang Wang’s orders, Song Jinyuan dispatched people to lay out a formation, separating the area where Fang Wang and Xiao Zi were. The formation could block both sight and divine sense, leaving those outside unable to sense anything within. This was a Formation method taught by the Three Immortals of the Emperor Sea.<br/><br/>In the days that followed, cultivators within Sword Heaven Marsh could clearly feel the speed at which spiritual energy flowed toward the large formation increasing.<br/><br/>Emperor Sea, Supreme Sect.<br/><br/>Fang Zigeng sat in meditation on the mountain peak, his hands continuously moving, behind him five shadows radiating with a silvery glow, their silhouettes identical to his own.<br/><br/>Years had passed, and Fang Zigeng still had white hair, which now gleamed faintly, failing to make him seem aged but instead imparting an ethereal and transcendent air.<br/><br/>A graceful figure descended from the sky and landed beside him—his wife, Luo Yi.<br/><br/>Luo Yi turned her head, noticed the five shadows, and secretly wondered which Cultivation Technique her husband was practicing.<br/><br/>She looked at Fang Zigeng and spoke softly, “Husband, recently there have been many monsters transforming into dragons at sea, some even becoming True Dragons. A True Dragon’s entire body is a treasure. I’ve already sent people to hunt them, and surely their spoils will strengthen your physique.”<br/><br/>Fang Zigeng responded, “Thank you.”<br/><br/>Luo Yi continued with a question, “Husband, have there been any clues about the Supreme Saint Body?”<br/><br/>Hearing this, Fang Zigeng opened his eyes and gave a wry smile, “Though I have undergone the baptism of the Supreme Pond and my physical body has strengthened a lot, I still can’t grasp the mysteries of the Supreme Saint Body. Have others had any revelations?”<br/><br/>Luo Yi shook her head, “How could they? The Supreme Sect hasn’t produced a Supreme Saint Body for two thousand years. Don’t worry, once I collect the dragon treasures, perhaps you will comprehend it.”<br/><br/>Fang Zigeng turned to look at her, hesitated for a moment, and said, “True Dragons are the stuff of legend, but now we see monsters transforming into dragons… Actually, while in the Supreme Pond, I met someone, presumably the will of a predecessor from the Supreme Sect. He said that the Supreme Sect would face a catastrophe. What exactly the catastrophe is, or when it will strike, he couldn’t foresee. You must be cautious in your endeavors outside.”\t\t\t\t\t\t</div>", "images": {}, "success": true}