{"id": 222, "url": "https://www.novelhall.com/i-became-an-immortal-on-mortal-realm-32879/14518019.html", "title": "Chapter 222 - Chapter 222: Chapter 219: The Birth Of The Demon Venerable, The Final Battle", "volume": 3, "volume_title": "Volume 3", "body": "<h1>Chapter 222 - Chapter 222: Chapter 219: The Birth Of The Demon Venerable, The Final Battle</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 222: Chapter 219: The Birth of the Demon Venerable, The Final Battle<br/><br/>Translator: 549690339<br/><br/>After defeating Ji Haotian, Fang Wang continued to cultivate, with engaging in a duel once a month becoming his leisure amid cultivation.<br/><br/>Less than ten days after Ji Haotian left, Fang Wang, who was cultivating, opened his eyes.<br/><br/>He sensed two sources of Sword Intent.<br/><br/>“Xu Qiuming, eh? Compared to before, you’ve truly become a different person. And the other one…”<br/><br/>A smile spread across Fang Wang’s face, delighted by Xu Qiuming’s growth.<br/><br/>Since Xu Qiuming had no chance to ascend, he would remain in the Mortal Realm to keep Fang Wang company. Being invincible could become lonely after a time  the stronger Xu Qiuming got, the more Fang Wang could spar with him.<br/><br/>As for Xu Qiuming’s opponent…<br/><br/>He was no simple character!<br/><br/>Fang Wang could feel that the other’s sword bore a resemblance to the Executioner Immortal Ghost God Sword in its ingenuity, though it wasn’t the Ghostly Divine Sword itself.<br/><br/>He immediately thought of the Sword Immortal that Fang Bai had mentioned before.<br/><br/>Indeed, this person was quite young, only about a decade older than Fang Bai.<br/><br/>Xu Qiuming was superior in cultivation, but his opponent was stronger in the Sword Dao, making it hard to determine the superior combatant for a while.<br/><br/>After watching for a while, Fang Wang was sure—this Sword Immortal’s mastery of the Sword Dao was definitely a Great Saint Legacy, not weaker than the Executioner Immortal Ghost God Sword.<br/><br/>Gradually, others within the Sword Heaven Marsh also picked up on the sword duel by the sea, and people started heading over to join the excitement.<br/><br/>Since the commotion of the Heavenly Dao challenge had escalated, duels frequently erupted amongst the Great Cultivators across Grand Qi. As Fang Wang was in Grand Qi, cultivators contended in duels that sought victory, not life or death—this made others dare to spectate.<br/><br/>Fang Wang closed his eyes and continued to cultivate.<br/><br/>Neither Xu Qiuming nor that Sword Immortal could match Dugu Wenhun, let alone be a threat to him.<br/><br/>His only reason for opening his eyes had been to feel the presence of someone familiar.<br/><br/>Approximately half an hour had passed when the grand sword duel concluded without a victor.<br/><br/>In Fang Wang’s view, Xu Qiuming had won.<br/><br/>At just over two hundred years old, Xu Qiuming’s self-created Sword Dao was already capable of contending with the Swordsmanship Ultimate Arts of the Great Saint—this was truly frightening.<br/><br/>Fang Wang was very curious about what Xu Qiuming had gone through, as his Sword Intent reminded Fang Wang of mountains of corpses and seas of blood.<br/><br/>After the battle concluded, Xu Qiuming’s presence moved towards the Sword Heaven Marsh.<br/><br/>Waitng until the next day of the challenge, just as Fang Wang had expected, Xu Qiuming succeeded in seizing the right to challenge.<br/><br/>Despite being merely at the third layer of the Golden Body Realm, Xu Qiuming defeated several challengers from the Mahayana Realm. As his background was unearthed by various powers, the cultivators of Grand Qi once again remembered this once foremost talent of the nation.<br/><br/>Fang Wang faced off with Xu Qiuming high in the sky, both of them sharing a smile.<br/><br/>Xu Qiuming’s robes began to stir as he gazed at Fang Wang with a piercing look and said, “I know that I’m no match for you. If this were a battle to the death, you could reduce me to ashes with a single punch. But ever since my epiphany with the sword, my path of cultivation has been too smooth. I can feel my Sword Intent growing faster than my cultivation, and I’m afraid of becoming arrogant. That is why I wanted to learn the extent of the gap between us.”<br/><br/>Fang Wang replied with a smile, “Your progress is indeed rapid, you truly are the sword cultivator I’m most hopeful for.”<br/><br/>Their conversation was overheard by many cultivators within Sword Heaven Marsh, and their gazes towards Xu Qiuming changed.<br/><br/>In these years, it was the first time Fang Wang had praised another cultivator so highly.<br/><br/>Xu Qiuming had already emanated his own Sword Intent, which was both murderous and embodied the cold sharpness of a sword, causing the entire Sword Heaven Marsh to fall silent.<br/><br/>“Although we are old acquaintances, I won’t hold back. I’ll make you wish to face my second punch,” Fang Wang said, suppressing his smile.<br/><br/>Xu Qiuming’s eyes were fierce, almost mirroring the intensity of Fang Wang when he unleashed his Combat Heart.<br/><br/>Fang Wang’s lips curled up slightly and suddenly he threw a punch.<br/><br/>He did not hold back, instead bringing forth an aura akin to when he faced Ji Haotian.<br/><br/>Keep in mind, Ji Haotian was at the Nineth Layer of the Mahayana Realm, a match for the Nirvana Realm!<br/><br/>Hum<br/><br/>The dragon’s roar echoed between heaven and earth. Xu Qiuming’s hair, caught by the wind, billowed wildly as his robe seemed like it would tear apart.<br/><br/>He didn’t move an inch, but the Sword Intent emanating from his body dissipated the moment the dragon’s roar sounded.<br/><br/>All eyes were on Xu Qiuming, who looked dazed and completely bewildered.<br/><br/>As the deafening clamor filled Sword Heaven Marsh, Xu Qiuming was still not back to his senses.<br/><br/>In his world, the scene of the Black Dragon rushing at him replayed over and over.<br/><br/>Fear!<br/><br/>Regret!<br/><br/>Despair!<br/><br/>A myriad of emotions enveloped his heart.<br/><br/>When he regained clarity, Fang Wang was no longer in sight.<br/><br/>At that moment, Xu Qiuming was filled with intense relief—he was fortunate his challenger was Fang Wang, for if any other opponent possessed such terrifying power, he would be dead.<br/><br/>Xu Qiuming took a deep breath and turned his head towards the wooden bridge where Fang Wang was. There, enveloped in fog, Fang Wang’s location was obscured.<br/><br/>He dove headfirst down, planning to stay in Sword Heaven Marsh for a while. As soon as he landed, many cultivators immediately surrounded him.<br/><br/>Losing to Heavenly Dao isn’t a disgrace. Xu Qiuming had already demonstrated his Sword Intent, which was indeed very powerful and worthy of establishing good relations with various sects.<br/><br/>Following Xu Qiuming, more and more overseas Great Cultivators hastened to the scene, resulting in the challengers in the subsequent months all arriving from the surrounding seas. The cultivators of the continent truly couldn’t compare to those from overseas, but with Fang Wang present, all the dynasties on the continent saw a glimmer of hope for ascension.<br/><br/>The sun and moon rotated, the seasons changed.<br/><br/>In the blink of an eye, four years had passed.<br/><br/>One day, after Fang Wang finished his punch, he overlooked the fearful expressions of the challengers and said, “The final year, one year from now, I will no longer accept challenges.”<br/><br/>Having said that, he descended, and his words plunged Sword Heaven Marsh into a buzz of commotion.<br/><br/>Everyone had anticipated this day would come, but upon hearing these words, they still felt regret.<br/><br/>Over the years, Fang Wang accepted a challenge every month, greatly boosting the prestige of the continent. The name of Descending Dragon Continent had now spread across the surrounding seas and even to other continents, allowing the cultivators of Descending Dragon Continent to take pride in their heritage. When they ventured out to sea for experiences, they were no longer as easily discriminated against as they had been decades earlier.<br/><br/>In less than seven days, the news about Fang Wang’s final year spread throughout the continent, inducing even more hidden powers to become restless.<br/><br/>In the Southern Celestial Sea, thunderclouds blanketed the firmament, and seas of clouds churned, with bursts of lightning flickering in and out of visibility like swift dragons.<br/><br/>The fierce winds howled across the ocean. One by one, creatures of all shapes and sizes emerged from the sea, countless demon birds carrying tumbling Demonic Qi flew in from the horizon. All of them were heading in one direction.<br/><br/>That direction was a lone island, surrounded by towering waves, seeming as though it could be submerged by the sea at any moment. On looking around, countless monsters were advancing on the island from all directions.<br/><br/>The intermittent lightning that struck down illuminated the island, where a figure was sitting atop the mountain.<br/><br/>This was an elderly man, lazily reclining on a stone chair, wearing a black robe made from beast skins that still had hair attached. He was resting his face in one hand.<br/><br/>If Fang Wang were here, he would certainly recognize this man’s identity.<br/><br/>Qi Tian, the Demon Venerable!<br/><br/>Five thousand years ago, Qi Tian, the Demon Venerable, had mastered the Mountain River Town Heaven Fist. Three thousand years ago, he became the strongest monster in the Southern Celestial Sea, commanding over ten Demon Emperors. The current Master of the Monster Palace had been one of the Demon Emperors under his command back then.<br/><br/>He was once a peerless powerhouse who had nearly seized the chance to ascend to immortality!<br/><br/>A Roc Bird cried out in the sky, flapping its wings as it approached. Its wings spanned a thousand zhang, radiating formidable demonic might. Just as it nearly reached the island, it rapidly transformed into a human shape and landed before Qi Tian, the Demon Venerable.<br/><br/>Zhu Yan, one of the Demon Emperors of the Southern Celestial Sea, was a descendant of the legendary Roc Bird!<br/><br/>Zhu Yan, brawny in stature, clad in a black jade robe, crowned with a purple phoenix-winged cap, had a face somewhat resembling Zhu Yan’s, but his presence was more oppressive.<br/><br/>He kneeled on one knee before Qi Tian, the Demon Venerable, and saluted with clasped hands, saying, “Reporting to the Demon Venerable, I have persuaded four Demon Emperors and thirty-nine Demon Kings to return under your command, and they are now on their way here.”<br/><br/>Qi Tian, the Demon Venerable, looked at him and said softly, “You have worked hard. What is the stance of the Monster Palace?”<br/><br/>Zhu Yan frowned and replied, “That guy doesn’t want to join. He’s saying that the Monster Palace suffered heavy losses because of Xu Qiuming and needs time to recover.”<br/><br/>Qi Tian, the Demon Venerable, narrowed his eyes and laughed coldly, “In that case, let’s take action against the Monster Palace and unify the demon race in the Southern Celestial Sea.”<br/><br/>At that moment, a mass of Demonic Qi emerged beside Zhu Yan. The Demonic Qi dissipated, revealing a woman with a seductive figure and bewitching features.<br/><br/>She swayed her hips as she stepped forward and smiled, “Honorable one, why not make a trip to Descending Dragon Continent? Nowadays, all seas and continents regard the human race as supreme, and Tian Dao is the most powerful genius of the human race in nearly five hundred years. If you can slay him, it will surely boost the prestige of the demon race, and all the demon kings are likely to come forth and pledge allegiance to you.”<br/><br/>Upon hearing this, Zhu Yan frowned. After all, his son served Tian Dao as a mount, but he didn’t intervene, preferring to hear Qi Tian, the Demon Venerable’s, thoughts.<br/><br/>Qi Tian, the Demon Venerable, snorted, “You forget to tell them all, Tian Dao Fang Wang is my junior brother. How could I possibly harm him? Moreover, the reason I was able to return from the Underworld was thanks to his rescue. Do not plot against him from now on, or you will not be spared my wrath.”<br/><br/>As these words were spoken, Zhu Yan and the female demon were taken aback, not expecting Qi Tian, the Demon Venerable, to have such a relationship with Fang Wang.<br/><br/>The female demon carefully inquired, “Honorable one, if you wish to wage war across the world and Tian Dao is the Tian Dao of the Eternal Life Pavilion, won’t that be troublesome?”<br/><br/>Qi Tian, the Demon Venerable, replied calmly, “No matter. If the Eternal Life Pavilion falls, then the title of Tian Dao becomes irrelevant. Moreover, the pavilion can’t control him anyway.”<br/><br/>He stood up, scanning the demonic army in all directions with a smile creeping onto his lips, and said, “It’s about time. Let’s move.”<br/><br/>Zhu Yan and the female demon immediately soared into the air to pass on the orders.<br/><br/>Another year passed, with winter’s snow blanketing Sword Heaven Marsh in a vast expanse of white.<br/><br/>Since Fang Wang set the final year, the subsequent challengers were mostly Nirvana Realm Great Cultivators all from overseas, and as time progressed, the level of their cultivation grew stronger.<br/><br/>Unknowingly, the time had come for the last challenge of the year.<br/><br/>The number of cultivators in Sword Heaven Marsh reached an unprecedented peak. The same was true for Grand Qi; every state, every city was filled with the figures of cultivators. The forests within a thousand li of Sword Heaven Marsh were no longer silent and eerie.<br/><br/>There were duels on all sides of Sword Heaven Marsh, and all were between Great Cultivators, resulting in many cultivators watching from the sky.<br/><br/>On the lakeshore, atop the wooden bridge.<br/><br/>Fang Wang opened his eyes and stretched languidly.<br/><br/>Xiao Zi crawled over from his waist, prompting him to instinctively reach out and stroke its head.<br/><br/>At that moment, The Three Immortals of the Emperor Sea appeared behind Fang Wang, all speaking at once as if a crowd was chattering.<br/><br/>“Master, some old immortal has shown up.”<br/><br/>“I didn’t expect that fellow to still be alive. You should be careful.”<br/><br/>“He really has no shame, over four thousand years old and still getting involved in these kinds of affairs.”\t\t\t\t\t\t</div>", "images": {}, "success": true}