{"id": 228, "url": "https://www.novelhall.com/i-became-an-immortal-on-mortal-realm-32879/14538453.html", "title": "Chapter 228 - Chapter 228: Chapter 225: Breaking Through To The Nirvana Realm, Heart Of The Heavenly Dao", "volume": 3, "volume_title": "Volume 3", "body": "<h1>Chapter 228 - Chapter 228: Chapter 225: Breaking Through To The Nirvana Realm, Heart Of The Heavenly Dao</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 228: Chapter 225: Breaking Through to the Nirvana Realm, Heart of the Heavenly Dao<br/><br/>Translator: 549690339<br/><br/>After initiating his breakthrough sprint, Fang Wang ignored the hustle and bustle of the outside world.<br/><br/>Earth Spirit Qi rushed into his body like crazy, while Xiao Zi, having transformed into a dragon, was not affected at all and even had a look of fascination on her face.<br/><br/>Relying on the Heavenly Dao Immensity Scripture, Fang Wang did not need to pass through tribulations, so there was no fear of harming it.<br/><br/>One month later.<br/><br/>Fang Wang formally commenced his breakthrough.<br/><br/>Even though a grand formation isolated this lake area, his aura still disturbed the entire Sword Heaven Marsh.<br/><br/>The Three Immortals of the Emperor Sea, who were fishing by the lake, couldn’t help but glance over, their faces showing astonishment.<br/><br/>“The aura of the Nirvana Realm… Is he about to break through to the Nirvana Realm so soon?”<br/><br/>“Good gracious, he was already terrifying at the Mahayana Realm. How strong will he become when he reaches the Nirvana Realm?”<br/><br/>“Too fast, how many years has it been from the Mahayana Realm to the Nirvana Realm?”<br/><br/>They were already so astonished, let alone other Sword Cultivators.<br/><br/>Fang Wang’s age had long been widely known across the continent, and all Cultivators knew that Fang Wang was very young, powerful enough as he was, and now breaking through again, it was unimaginable to conceive what realm he would reach.<br/><br/>For a time, discussions rose and fell within Sword Heaven Marsh.<br/><br/>There were even those who pondered whether, after a successful Heavenly Dao breakthrough, he would go out to hunt True Dragons?<br/><br/>True Dragons were scattered throughout the world, and lately a trend had formed among Great Cultivators to compete over the strength of their True Dragon mounts and pets.<br/><br/>Of course, there were also those curious about whether the snake demon by Fang Wang’s side would transform into a dragon, as it had often clamored about doing so before disappearing in the past two years, likely undergoing its own transformation.<br/><br/>Boom—<br/><br/>Rolling thunderclouds surged and gathered, with Heavenly Might vast and all-encompassing.<br/><br/>Every Cultivator in Sword Heaven Marsh could feel the Heavenly Might, and they couldn’t help but worry whether this tribulation would destroy Sword Heaven Marsh?<br/><br/>Many Cultivators who were staying temporarily began to retreat, but the Sword Servants of Sword Heaven Marsh were not flustered; they believed Fang Wang would not harm them, and if there was real danger, he would certainly warn them.<br/><br/>However, though the thunderclouds churned, the heavenly thunder was nowhere to be seen.<br/><br/>Within the formation, Earth Spirit Qi poured wildly into Fang Wang’s body. He moved the gathered Spiritual Energy to his heart, intending to let his heart undergo Nirvana.<br/><br/>Heart of the Heavenly Dao!<br/><br/>What is the Heart of the Heavenly Dao? It is a heart that endures as long as heaven and earth. Fang Wang wasn’t sure whether he could achieve it, but he was determined to try his utmost.<br/><br/>During Xiao Zi’s dragon transformation, Fang Wang noticed that the circulation and pulsation of True Dragon vitality had a certain pattern, which was related to the generation of Spiritual Energy by the plants of the world. Perhaps True Dragons inherently carried the mysteries of the universe within, thus enabling them to become the superior species among all beings.<br/><br/>Fang Wang did not wish to become a True Dragon but aimed to attain, and even surpass, a lineage as noble as that of the True Dragons.<br/><br/>If he succeeded, his heart would continue to beat indefinitely, even catalyzing stronger vitality.<br/><br/>Even if he died and his soul disintegrated, his heart would still keep beating.<br/><br/>Once this step was successful, he could continue to shape other organs in the future, and even allow his entire fleshly body to undergo Nirvana transformation, ultimately achieving immortality.<br/><br/>Enduring as long as heaven and earth is the first stage of immortality, and what the second stage might be, he would wait until he reached the first stage to find out.<br/><br/>Fang Wang immersed himself within, as the mental method from the Heavenly Dao Immensity Scripture spun wildly, drawing more and more Earth Spirit Qi into his body. Sword Heaven Marsh’s lake trembled, and the surrounding mountains subtly quaked.<br/><br/>Xiao Zi awoke and instinctively looked toward Fang Wang.<br/><br/>She did not disturb Fang Wang but quietly retreated to one side.<br/><br/>Secretly, she was astounded, feeling the changes in Fang Wang’s aura which made her uneasy.<br/><br/>In the process of refining his heart, Fang Wang had entered the state of Combat Heart; he was in the most perfect state of concentration, recalling the laws of the universe while managing his own vitality and Spiritual Power.<br/><br/>Gradually, white flames appeared on his body, growing increasingly bright.<br/><br/>Half an hour later, the area within the formation was shrouded in intense light, losing all color. Xiao Zi, hiding not far away, could only make out Fang Wang’s silhouette and could no longer see his true form.<br/><br/>It was not just within the formation; from the outside world, the formation’s column of energy looked like a pillar of light, becoming increasingly bright and drawing the attention of more and more Cultivators.<br/><br/>Chu Yin stood by the lake, feeling his master’s aura. His heartbeat quickened, and his eyes showed excitement.<br/><br/>“This feeling…”<br/><br/>Chu Yin closed his eyes, intently feeling his master’s breakthrough aura, and as if guided by an invisible force, he seemed to find the direction for his own cultivation.<br/><br/>He had some talent that surpassed Mortals in terms of Inner Strength, but as his cultivation level increased, he also began to ponder his path.<br/><br/>Fang Bai walked to the lakeside, gazing into the distance and closed his eyes as well.<br/><br/>Time flew by swiftly. Fang Wang, lost in his breakthrough, saw his cultivation level rise continually. Even though the grand formation isolated him, his momentum still disturbed the entire Grand Qi Cultivation Realm.<br/><br/>Various sects and noble families sent out Disciples to investigate. After learning that this formidable aura came from Sword Heaven Marsh, they all breathed a sigh of relief.<br/><br/>Today, Fang Wang was still seen as a protective deity in the hearts of the people of Grand Qi.<br/><br/>Seven days later, all Cultivators within Sword Heaven Marsh were meditating, experiencing the essence of Fang Wang’s aura.<br/><br/>The thunderclouds lingered in the sky for a long time but Sword Heaven Marsh did not darken; instead, dazzling white light shone on each person’s face, some frowned, some smiled, and some were anxious.<br/><br/>Ever since Fang Wang’s aura enveloped Sword Heaven Marsh, Cultivators found their sensitivity to nature’s Spiritual Energy had increased and so they began to cultivate. To their delight, they gained new insights during their practice.<br/><br/>However, the help brought by Fang Wang was ultimately limited, and now many had reached a bottleneck in comprehending their own Cultivation Techniques.<br/><br/>Inside the grand formation.<br/><br/>Fang Wang was still enveloped in bright light, his figure blurred. At his heart was a golden flame that burned fiercely, so bright that not even the strong light could conceal its presence.<br/><br/>He had successfully broken through.<br/><br/>The first layer of Nirvana Realm!<br/><br/>His aura no longer surged violently, but his flesh was undergoing a transformation.<br/><br/>The Spirit Pill, Heavenly Gang Star Acupoint, and his heart were all absorbing nature’s spiritual energy, thereby giving birth to strong Spiritual Power, among which his heart could create even stronger qi and blood.<br/><br/>It was a wonderful feeling, Fang Wang was not sure whether he had succeeded, but his heart had indeed undergone a transformation.<br/><br/>The Heart of the Heavenly Dao!<br/><br/>The sound of his heartbeat was unprecedentedly strong, each beat resonating like the rumbling of the earth, which in turn activated the Vajra Invincible Saint Body.<br/><br/>Even Fang Wang himself was surprised by the strong vitality of the Heart of the Heavenly Dao.<br/><br/>Such vitality might truly last as long as heaven and earth!<br/><br/>Fang Wang began to operate the mental method of the Nirvana Realm to stabilize his cultivation.<br/><br/>Gradually, the bright light on his body began to fade.<br/><br/>Half a day later, the Formation reverted to its original state, and the cultivators within Sword Heaven Marsh woke up one after another.<br/><br/>“Has Senior Fang’s breakthrough ended? Why hasn’t the heavenly tribulation fallen?”<br/><br/>“What a remarkable transformation, he even bestowed us with the opportunity to comprehend the Dao during his breakthrough, truly worthy of the Heavenly Dao.”<br/><br/>“The aura just now was so vast, what realm do you think Senior Fang has reached now?”<br/><br/>“All I know is that no one in the Ninth Layer of Breaking Heaven Realm is a match for Senior Fang, now I’m more curious about how many major realms there are between Condensation Spirit Realm and Heaven-Breaking Realm?”<br/><br/>“You’re merely at the Profound Heart Realm, why worry so much?”<br/><br/>Sword Heaven Marsh regained vitality, with cultivators discussing among themselves.<br/><br/>The Three Immortals of the Emperor Sea did the same. They were all at the ninth layer of the Nirvana Realm, and they felt even more shocked by Fang Wang’s aura.<br/><br/>“What cultivation technique is he practicing?”<br/><br/>“It must be his own creation, it feels that his own magical abilities are just as good as the Heavenly Emperor Imperial Mirror.”<br/><br/>“With Nirvana accomplished, I wonder how his actual combat power compares to other realms.”<br/><br/>The three began to reminisce about their own breakthroughs to the Nirvana Realm in the past. Comparing themselves now, they felt even more ordinary.<br/><br/>Those who could reach Nirvana Realm were once-in-a-millennium geniuses from all seas and continents, but compared to Fang Wang, they truly felt their talents were mediocre.<br/><br/>Fang Wang was unaware of others’ thoughts, focusing intently on solidifying his cultivation.<br/><br/>When the thunderclouds in the sky finally dispersed, the strong sound of a heartbeat echoed within Sword Heaven Marsh, once again surprising the cultivators.<br/><br/>Within the Formation.<br/><br/>Xiao Zi listened to Fang Wang’s heartbeat, her dragon eyes filled with amazement.<br/><br/>Fang Wang looked no different from before the breakthrough, the white aura around him had disappeared, and only the sound of his heartbeat, like muffled thunder, echoed endlessly, nearly deafening.<br/><br/>He felt that the transformation of the Heart of the Heavenly Dao was complete, and it was time to contemplate Spiritual Refinement.<br/><br/>The eighth Lifespirit Treasure!<br/><br/>Within his Treasured Spirit Space, a deep black groove had appeared, next to the Heavenly Palace Halberd, Rainbow Sword, Qiankun Fan, Reincarnation Bell, The Six Harmonies and Eight Desolations Seal, and Heaven Bound Golden Silk.<br/><br/>The Heavenly Dao Imperial Dragon Crown was atop his head.<br/><br/>Fang Wang stood up, his eyes sharpening as the Formation dissipated, and he walked towards the bridgehead where he usually practiced.<br/><br/>At the bottom of the lake there lay a Spiritual Refinement Formation that could aid him in refining his spirit.<br/><br/>Now that he had broken through and Spiritual Refinement would not take too long, he wasn’t worried about Xiao Zi causing any trouble.<br/><br/>Xiao Zi immediately soared into the sky, displaying her dragon body that reigned supreme over all creatures, flying freely.<br/><br/>“She really transformed into a dragon…”<br/><br/>Dugu Wenhun stood in front of a pavilion, watching Xiao Zi and murmuring to himself.<br/><br/>He had hunted a True Dragon before and could feel that Xiao Zi was stronger than other True Dragons.<br/><br/>More and more cultivators were drawn by Xiao Zi, her aura comparable to that of the Mahayana Realm made cultivators dare not act rashly, and The Three Immortals of the Emperor Sea who recognized her identity were even less likely to cause trouble.<br/><br/>Soon, Xiao Zi’s identity spread, and learning that this dragon was transformed from the demon snake by Fang Wang’s side, the cultivators completely dispelled any ill thoughts.<br/><br/>Xiao Zi was very smug, attracting many cultivators around her as she boasted of her current strength, occasionally displaying her True Dragon’s innate spells, eliciting exclamations from the cultivators.<br/><br/>On the other side, Fang Wang sat down at the bridgehead to meditate.<br/><br/>Song Jinyuan wanted to find him, but seeing him meditating again, he had no choice but to give up.<br/><br/>Fang Wang calmed his mind and focused his consciousness on his Treasured Spirit Space.<br/><br/>Before long, white aura began to emanate from his body and converge above his head.<br/><br/>At the same time.<br/><br/>At the peak of a mountain in Sword Heaven Marsh, a figure walked to the edge of a cliff, it was the Hongxuan Emperor inhabiting the body of Xiao Kuang of the Jin Xiao Sect.<br/><br/>“I didn’t expect that such a True Dragon could be born in this world, truly a good skill. The True Dragon Clan should not be underestimated,” thought the Hongxuan Emperor, once he first saw Xiao Zi, although he recognized her dragon soul, he still looked down on her, thinking her talent was too poor, but now he was surprised by such a transformation.<br/><br/>The Hongxuan Emperor leapt up and flew towards Sword Heaven Marsh, he didn’t disturb Fang Wang who was refining his spirit, but instead landed behind the cultivators surrounding Xiao Zi.<br/><br/>Suddenly catching sight of him, Xiao Zi couldn’t help but widen her dragon eyes and said, “Why have you come?”\t\t\t\t\t\t</div>", "images": {}, "success": true}