{"id": 223, "url": "https://www.novelhall.com/i-became-an-immortal-on-mortal-realm-32879/14524517.html", "title": "Chapter 223 - Chapter 223: Chapter 220: The Immortal, Ascension Stairway", "volume": 3, "volume_title": "Volume 3", "body": "<h1>Chapter 223 - Chapter 223: Chapter 220: The Immortal, Ascension Stairway</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 223: Chapter 220: The Immortal, Ascension Stairway<br/><br/>Translator: 549690339<br/><br/>Xiao Zi climbed onto Fang Wang’s shoulder, flicking her snake tongue she asked, “Who is this ‘too old to die’ person; can you speak clearly?”<br/><br/>The Three Immortals of the Emperor Sea answered in unison, their voices still in harmony.<br/><br/>“He calls himself Heavenly Lord, claiming to dwell in agelessness and immortality.”<br/><br/>“We had encountered him when we were over two hundred years old. At the time, we were full of vim and vigor, thinking that the three of us brothers together could traverse the world without equal—but we came close to being killed by him.”<br/><br/>“This old brute, he just loves to strike at geniuses, utterly shameless!”<br/><br/>Heavenly Lord?<br/><br/>Eternal life?<br/><br/>Pretty cocky!<br/><br/>Fang Wang’s eyebrows lifted ever so slightly, his eyes brimming with anticipation.<br/><br/>The Three Immortals of the Emperor Sea continued, recounting the deeds of this Heavenly Lord.<br/><br/>The origin of the Heavenly Lord was shrouded in mystery; no one knew whence he came. He traveled the world, fond of exchanging pointers with geniuses, and his level of cultivation was also a mystery.<br/><br/>The former master of the Eternal Life Pavilion had sparred with him and had been suppressed with a flip of his hand.<br/><br/>Besides exchanging pointers with others, he also loved to guide cultivators of mediocre talent, so he had quite a good reputation. But since he had disappeared for hundreds of years, the Cultivation World found it hard to remember him.<br/><br/>The Three Immortals of the Emperor Sea felt that the Heavenly Lord was stronger than Wen Li, and perhaps even stronger than the resurrected Thousand Eyes Great Saint; Fang Wang’s desire to subjugate the Heavenly Lord with one fist would be difficult.<br/><br/>Fang Wang, however, did not care. Over these years, his strength had also skyrocketed, and he wanted to see just how strong the Heavenly Lord was.<br/><br/>The next day at noon, the Heavenly Lord descended upon Sword Heaven Marsh.<br/><br/>This Heavenly Lord was dressed in a white robe, with the hair of a crane but the face of a child, his frame slightly stooped, seemingly not powerful at all. But there was an Immortal aura about him, and the peach wood staff in his hand emitted a faint mist, making him appear even more ethereal.<br/><br/>There was also a peach on the staff, pale with a hint of blush, making one salivate at first glance.<br/><br/>Walking along the riverbank, the Heavenly Lord cheerfully instructed the cultivators he met, attracting a great deal of attention. The more people watched him, the broader the smile on his face became.<br/><br/>Fang Wang only glanced at him once before returning to his cultivation.<br/><br/>Xiao Zi, however, was quite interested in him and so she joined the excitement.<br/><br/>The Three Immortals of the Emperor Sea blocked the Heavenly Lord’s path, surrounded him, and bombarded him with questions.<br/><br/>“Old thing, what brings you here?”<br/><br/>“Living over four thousand years, how come you’re not dead yet?”<br/><br/>“You aren’t also thinking of challenging our master, are you?”<br/><br/>Over four thousand years!<br/><br/>This remark changed the expressions of the surrounding cultivators. So many years had passed, and the Three Immortals of the Emperor Sea had proven their strength; their fame shook the continent, and cultivators knew that under Heavenly Dao, there were three old cultivators with profound cultivation, stronger than the Saint Venerate of Heaven’s Larceny Saint Sect.<br/><br/>The Heavenly Lord stroked his beard and chuckled, “Why, can this old man not challenge Heavenly Dao? I am the Heavenly Lord, and if Heavenly Lord battles Heavenly Dao, would it not become a glorious tale?”<br/><br/>Upon hearing this, the Three Immortals of the Emperor Sea grew even more annoyed and began to curse the Heavenly Lord.<br/><br/>More and more cultivators gathered, a cultivator of over four thousand years old was quite intimidating, at least they had never seen someone like that.<br/><br/>Hearing the Heavenly Lord wanted to challenge Heavenly Dao, many expressed their dissatisfaction immediately.<br/><br/>Luo Chen of the Supreme Sect stepped forward and said, “Senior, if you want to challenge Heavenly Dao, you need to convince everyone. You have to get past me first.”<br/><br/>The Heavenly Lord glanced at him and nodded with a smile.<br/><br/>Then, a group of cultivators flew high into the sky to exchange pointers.<br/><br/>Luo Chen gathered his Lifespirit Treasure; it was a feather fan. The aura of the Mahayana Realm burst forth, enveloping heaven and earth. He waved the fan, and in an instant, the firmament changed color as a massive flame bird with a wingspan of a thousand zhang plummeted down, eclipsing the sun.<br/><br/>The Heavenly Lord shook his head with a chuckled, “All flash and no substance.”<br/><br/>As his voice fell, he disappeared from his spot.<br/><br/>Luo Chen’s pupils shrank suddenly, and he instinctively swung his fan behind him.<br/><br/>A single finger suddenly pressed against his back, immobilizing him completely.<br/><br/>“How you managed to attain the Mahayana Realm is beyond me; too disappointing,” the voice of the Heavenly Lord came from behind, causing Luo Chen’s face to turn green instantly.<br/><br/>Day by day passed, and finally, the last day to challenge Heavenly Dao arrived. The area around Sword Heaven Marsh was filled with cultivators far and wide. Even the sky was dotted with many Magic Artifacts and mounts hovering, waiting for Heavenly Dao to make a move.<br/><br/>By the lake, the Heavenly Lord stretched lazily, picked up his peach wood staff, stood up, and then stepped into the air as if there was an invisible staircase beneath his feet.<br/><br/>All eyes between heaven and earth were on him.<br/><br/>Over these days, the Heavenly Lord had defeated other challengers; he had subdued seven cultivators of the Nirvana Realm with just one move each. Throughout it all, he had not shown any sign of his own aura, and every fight had seemed as effortless as clouds drifting in the gentle breeze. This also made the cultivators who had come to watch the battle hold him in great anticipation.<br/><br/>“Has he truly lived for over four thousand years?”<br/><br/>“It must be true, the Three Immortals of the Emperor Sea said so themselves.”<br/><br/>“Gosh, isn’t he virtually immortal then?”<br/><br/>“More than his age of over four thousand years, I am even more curious – is Heavenly Dao truly not even two hundred years old?”<br/><br/>“Tsk tsk, if that’s true, given such a huge age gap, today we might witness the second punch of Heavenly Dao, and perhaps even two punches won’t be enough to defeat this Heavenly Lord.”<br/><br/>“Thank Heavens for Heavenly Dao, otherwise how could we bear witness to so many Great Cultivators, let alone see one who is ageless and immortal?”<br/><br/>Amidst the uproar, the Heavenly Lord seemed to enjoy the atmosphere. He walked up into the heavens, reaching heights greater than the surrounding mountain peaks, looking down as his gaze penetrated through the mist by the lakeside.<br/><br/>Suddenly, the mist was scattered by a gust of wind that soared upwards, everyone’s robes billowing in the turbulence, and they instinctively looked up.<br/><br/>The Heavenly Venerate looked up at Fang Wang approaching and stroked his beard with a smile, “Quick indeed, it’s no wonder you’re the Heavenly Dao.”<br/><br/>Fang Wang gazed calmly at the Heavenly Venerate and asked, “Your excellency has cultivated to profound levels and lived for over four thousand years, well-read and knowledgeable, why would you show interest in my Nine Dragons Tyrant Fist?”<br/><br/>Upon these words, those who had doubts about the Heavenly Venerate were all deeply moved.<br/><br/>The world fell silent, all cultivators and monsters held their breath and concentrated, listening to the dialogue between two supreme beings.<br/><br/>The Heavenly Venerate chuckled, “Your technique is no simple matter, it can cause a phenomenon between heaven and earth. Even an old man like me, who has lived four thousand seven hundred years, has never seen such an imposing fist technique. Today, the old man seeks to learn from you, not only to experience the Nine Dragons Tyrant Fist but also to test you. If you can satisfy the old man, I will grant you a great opportunity.”<br/><br/>Four thousand seven hundred years!<br/><br/>All the spectators looked at the Heavenly Venerate with changed expressions.<br/><br/>For a moment, the image of the Heavenly Venerate in their eyes grew immense, making the onlookers worry for Fang Wang.<br/><br/>The corners of Fang Wang’s mouth lifted, and he asked, “May I ask, what realm have you achieved, Excellency?”<br/><br/>The Heavenly Venerate laughed briefly, “Ninth Layer of the Heaven-Breaking Realm, young friend, have you ever heard of this level?”<br/><br/>Heaven-Breaking Realm?<br/><br/>What realm is that?<br/><br/>This was the question on everyone’s mind, they looked at Fang Wang anxiously, waiting for his response.<br/><br/>Gu Tianxiong gazed at the sky and muttered, “As expected, an old monster has been provoked; this is a crashing of the scene…”<br/><br/>Fang Wang raised his right hand, slowly clenched his fist, and said, “Let’s see if you from the Ninth Layer of the Breaking Heaven Realm can withstand my punch.”<br/><br/>The terrifying pressure of the Nine Dragons Tyrant Fist erupted, making the mist above Sword Heaven Marsh’s lake surface come to a standstill.<br/><br/>The Heavenly Venerate narrowed his eyes, lifted his left hand, and beckoned to Fang Wang.<br/><br/>He seemed scornful, but his right hand, holding the peach wood staff, was clenched tight.<br/><br/>“This youngster…”<br/><br/>Originally, the Heavenly Venerate wanted to probe, but now, he put away his contempt and prepared to fully withstand Fang Wang’s punch.<br/><br/>If he couldn’t withstand it, the loss of face would be enormous.<br/><br/>The Heavenly Venerate did not want to hear those three juniors from Emperor Sea taunting and mocking him for taking a fall.<br/><br/>Fang Wang smiled coldly; this time, he activated the Heavenly Dao Immensity Scripture, his body ignited with white flames, elevating the surrounding oppressive might as though imposing the Heavenly Might upon the living beings.<br/><br/>This vast pressure was felt by all beings across the continent.<br/><br/>The Heavenly Venerate’s pupils shrank suddenly, cursing inwardly that the youngster was absurdly strong.<br/><br/>Boom!<br/><br/>Amid an ear-deafening roar, all the spectators within and around Sword Heaven Marsh felt as if the heavens and earth were collapsing; their senses failed them in an instant, and even a blinding light flashed before their eyes, causing them to close their eyes reflexively.<br/><br/>Those with profound cultivation were the first to open their eyes, then stared wide-eyed.<br/><br/>Fang Wang stood in front of the Heavenly Venerate, his right fist stopping beside the Heavenly Venerate’s ear. Along the line of his fist, one could see a visible crack in the firmament, dark and sinister, as if the sky had split, with no end to the fissure in sight.<br/><br/>More and more cultivators opened their eyes, their gazes landing on Fang Wang and the Heavenly Venerate.<br/><br/>This was the first time Fang Wang had closed in on his opponent for a killing blow.<br/><br/>The Heavenly Venerate seemed unharmed, but no one doubted the might of Fang Wang’s punch just now.<br/><br/>It was terrifying!<br/><br/>Even cultivators at the Nirvana Realm were scared by that punch, feeling as though the world was about to end, still enveloped by an extreme sense of panic that they could not shake off.<br/><br/>Fang Wang’s gaze was not on the Heavenly Venerate’s face, but towards the horizon. The Heavenly Venerate’s hair whipped about, he appeared unmovable as a mountain, yet at that moment, his face was filled with terror.<br/><br/>Such terror, he couldn’t control!<br/><br/>Sweat the size of soybeans even beaded on the Heavenly Venerate’s forehead. It was clear that the force of the punch still lingered, and his heart had yet to calm.<br/><br/>“May I ask, my friend, are you convinced by my punch, or not?”<br/><br/>Fang Wang’s voice rose, his tone indifferent, clearly reaching the ears of all spectators.<br/><br/>At that moment, even Xiao Zi, Zhao Zhen, and Chu Yin tensed up, staring intently at the Heavenly Venerate.<br/><br/>The Three Immortals of the Emperor Sea trembled with excitement; they had never seen the Heavenly Venerate so disheveled.<br/><br/>The Heavenly Venerate’s lips trembled, his mouth opening and closing, and after a long few breaths, he finally expelled one word, “Convinced…”<br/><br/>“Hm?” Fang Wang’s tone held some dissatisfaction.<br/><br/>“I am convinced!”<br/><br/>The Heavenly Venerate was startled into a jolt, hastily shouting loudly.<br/><br/>Unlike others, the momentum of Fang Wang’s punch was concentrated upon him; his experience was completely different from the rest. He even felt a killing intent.<br/><br/>If that punch had hit him, he might not have withstood it!<br/><br/>An unprecedented panic made the Heavenly Venerate disregard his own reputation.<br/><br/>Fang Wang withdrew his fist, the overwhelming pressure vanished, the mist over the lake surface continued to churn, the surrounding peaks trembled dramatically, and the forests swayed.<br/><br/>In less than three breaths’ time, cheers thundered!<br/><br/>This mysterious Great Cultivator, who had lived for four thousand seven hundred years, still could not withstand a punch from Tian Dao Fang Wang!<br/><br/>That made the cultivators and monsters, who worshipped and revered Fang Wang, exceedingly excited.<br/><br/>Fang Wang turned, ready to leave.<br/><br/>The Heavenly Venerate came back to his senses and called out hastily, “Wait! Little… Fellow Daoist Heavenly Dao, the old man invites you to ascend the Ascension Stairway!”\t\t\t\t\t\t</div>", "images": {}, "success": true}