{"id": 224, "url": "https://www.novelhall.com/i-became-an-immortal-on-mortal-realm-32879/14524518.html", "title": "Chapter 224 - Chapter 224: Chapter 221: Celestial Court Legend, The Calamity Of The True Dragon", "volume": 3, "volume_title": "Volume 3", "body": "<h1>Chapter 224 - Chapter 224: Chapter 221: Celestial Court Legend, The Calamity Of The True Dragon</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 224: Chapter 221: Celestial Court Legend, The Calamity of the True Dragon<br/><br/>Translator: 549690339<br/><br/>Hearing the words of the Heavenly Official, Fang Wang remained unmoved and swiftly flew into the dense fog, disappearing from view.<br/><br/>“From now on, I will not accept challenges; if someone else comes to challenge me, please be prepared for the possibility of death and obliteration,” Fang Wang declared, his voice echoing under the vault of heaven, officially putting an end to the event that had lasted for many years.<br/><br/>Although the spectators felt a tinge of regret, they were more excited.<br/><br/>They were curious about the origins of the Heavenly Official and even more curious about the nature of the Heaven-Breaking Realm and how far it was from them.<br/><br/>They knew only one thing: even the Ninth Layer of the Breaking Heaven Realm couldn’t withstand a single punch from the Heavenly Dao.<br/><br/>The Cultivators from various major forces made up their minds to avoid provoking Tian Dao Fang Wang at all costs and to strive to be on good terms with the Fang Family.<br/><br/>The Heavenly Official hovered in the air, his speech halted as if he had heard something. He turned his head, looking at the celestial scar that extended to the ends of the earth and heaven, feeling a chill in his heart.<br/><br/>“It’s good that it was just a sparring match; if I had encountered him privately…” he thought to himself. His greatest joy in life was educating geniuses. Most of them were arrogant, which often led them to desperately fight against him. This was also why The Three Immortals of the Emperor Sea disliked him so much.<br/><br/>Just then, The Three Immortals of the Emperor Sea flew up to him, and he sighed helplessly.<br/><br/>The thing he had feared most had still happened.<br/><br/>“Is that all? Why didn’t the master kill you?” one said.<br/><br/>“Old man, having regrets now, are you?” another taunted.<br/><br/>“Tsk tsk, weren’t you very arrogant? Why don’t you dare take the second punch?” the third mocked.<br/><br/>Elsewhere.<br/><br/>Back on the wooden bridge, Fang Wang sat down in meditation again, preparing to continue his assault on the sixth layer of the Mahayana Realm.<br/><br/>As for the Ascension Stairway mentioned by the Heavenly Official, he was not interested. Before breaking through to the Nirvana Realm, he didn’t feel like wandering around.<br/><br/>He couldn’t always fight across realms; he also wanted to suppress others with his realm.<br/><br/>The excitement would eventually disperse. Under the driving away efforts of people like Song Jinyuan and Dugu Wenhun, in less than five days, Sword Heaven Marsh returned to the tranquility it had known for many years, but the battle between Fang Wang and the Heavenly Official had sent shockwaves across the world.<br/><br/>Legends about the Heavenly Official were continuously unearthed by the populace, particularly by those in nearby seas. As they gathered more and more information, they were astounded by the existence of the Heavenly Official and even more incredulous at Fang Wang’s strength.<br/><br/>The thought of Tian Dao Fang Wang, supposedly two hundred years old, forcing the four thousand seven hundred years old Heavenly Official to yield with a single punch was beyond belief!<br/><br/>With the years’ performance of Fang Wang, the reputation of the Southern Celestial Four Heroes had long faded into irrelevance in the Southern Celestial Sea. Fang Wang was now the strongest genius in the hearts of the people, and he had even become the number one Cultivator of the Southern Celestial Sea.<br/><br/>Indeed, the Southern Celestial Sea regarded Tian Dao Fang Wang as one of their own, for after all, Fang Wang was one of the twenty-four True Immortals of the Eternal Life Pavilion.<br/><br/>The appearance of the Heavenly Official had thoroughly elevated Tian Dao Fang Wang to a divine status, providing a perfect ending to the prolonged contest of power.<br/><br/>Half a month later.<br/><br/>Fang Wang finally agreed to meet the Heavenly Official.<br/><br/>The Heavenly Official walked out of the mist and approached Fang Wang from behind, looking somewhat anxious. He cleared his throat and spoke, “Fellow Daoist, I truly came to bring you an opportunity. The previous offense was simply to test your strength, and it turns out that I overestimated myself.”<br/><br/>Without turning his head, Fang Wang asked, “What opportunity?”<br/><br/>“The Ascension Stairway, it’s the greatest opportunity at sea. To ascend the stairway is to gain the fortunes of the Celestial Court. The stairway appears once every thousand years, and it’s an opportunity that all the great powers of the world vie for. There are two hundred and seven years left until its next emergence.”<br/><br/>“The Celestial Court?”<br/><br/>“The Celestial Court was founded in ancient times by human emperors. Back then, there were no Ascenders, nor the concept of Immortal Gods. To protect all living beings, human emperors established the Celestial Court and bestowed the powers of Immortal Gods upon top fighters of the age. Although the initial Celestial Court reigned supreme above all creatures, it was under the control of human emperors. However, with each succeeding generation of emperors, the Celestial Court began to go unchecked. Rebellions against the Celestial Court even erupted among various races in the Mortal Realm. Throughout the vast expanse of time, the Celestial Court was overthrown multiple times, and each time reestablished by strong beings, until it was ultimately destroyed by true Immortal Gods of The Upper Realm, vanishing into the long river of history. However, the Celestial Court amassed many powerful legacies during its many eras of rule, and it still persists in the Mortal Realm,” the Heavenly Official said, his tone filled with a sense of nostalgia.<br/><br/>This version of the Celestial Court was different from the legends Fang Wang had heard in his previous life on Earth.<br/><br/>The creation of Immortal Gods by humans seemed reasonable.<br/><br/>Fang Wang then asked, “Compared to the Tai Cang Immortal Mansion, how does the Celestial Court measure up?”<br/><br/>The Tai Cang Immortal Mansion was an opportunity bestowed upon him by the Descending Dragon Great Saint. While the Ascension Stairway emerged once every thousand years, the Tai Cang Immortal Mansion was even more extraordinary, appearing only once every ten thousand years. The Descending Dragon Great Saint established the Three Great True Cultivations for the sake of the Tai Cang Immortal Mansion.<br/><br/>The Heavenly Official was taken aback, and he remarked with a sense of longing, “I didn’t expect you to know of the Tai Cang Immortal Mansion. It’s a legend even more mysterious than the Celestial Court, and nobody knows the origins of the Tai Cang Immortal Mansion. Yet, each time it has opened, it has created a Great Saint. In terms of opportunity, it’s more profound than the Ascension Stairway, but alas, I don’t have a single clue regarding the Tai Cang Immortal Mansion.”<br/><br/>“Could it be that you have found clues to the Tai Cang Immortal Mansion?”<br/><br/>In response to the Heavenly Official’s inquiry, Fang Wang calmly replied, “If I had, why would I need to ask you? I’ve only heard the name before and was curious. Since the Ascension Stairway won’t appear for another two hundred and seven years, let’s talk about it when the time comes.”<br/><br/>In two hundred and seven years, what realm would he have reached?<br/><br/>He planned to merge all Mortal Realm cultivation techniques, so he didn’t finalize any commitment. If he was free at that time, it might be worth a visit.<br/><br/>The Heavenly Official took out a scroll from his sleeve and said, “This scroll contains the location of the Ascension Stairway. The stairway is not just about chasing opportunities, but also about making a name for oneself in the Mortal Realm. This continent is too small, even if you include the Southern Celestial Sea and the Emperor Sea, it’s still very small. Your reputation as Tian Dao should spread further. When the time comes, the great powers of the world will gather to ascend the stairway together. The higher one climbs, the stronger they are.”<br/><br/>Fang Wang rose to his feet, faced him, took the scroll, and then asked, “Is this Ascension Stairway controlled by the force behind you?”<br/><br/>If the Ascension Stairway were available to anyone, why would Heavenly Official bother to strive for it, to pursue what exactly?<br/><br/>The Heavenly Official chuckled and said, “The Ascension Stairway, how could it be something that common folk can control? I merely wish to witness the elegance of a Great Saint before I depart this life.”<br/><br/>“Since ancient times, Cultivators either ascend to immortality or become saints in the Mortal Realm. Ascenders are common, but Great Saints are a rare sight. I, an old man, have lived for more than four thousand seven hundred years, and I’ve only seen the remnant soul of an ancient Great Saint, never having truly experienced the elegance of one. I wander the world for two reasons: one is to pass the remainder of my now meaningless life; the other is to find talents worthy of the Great Saint status. Before I met you, I thought many geniuses could become Great Saints, but after meeting you, only then did I realize the destiny of a Great Saint is as the legends say, radiating brightness that dims all other geniuses in the world.”<br/><br/>The eyes of the Heavenly Official were ablaze as he stared at Fang Wang. Ever since he learned that Fang Wang was not yet two hundred years old, he was utterly astonished and filled with endless expectations for Fang Wang.<br/><br/>The Descending Dragon Continent is a backward place in the Mortal Realm, yet it has given birth to such a genius. What heights will Fang Wang reach once he travels to those sacred places of Cultivation?<br/><br/>Fang Wang softly chuckled, “You flatter me, my friend.”<br/><br/>With the Heavenly Official presenting such humility, it was only natural for Fang Wang not to put on airs. The two of them began to converse.<br/><br/>A full half an hour later, the Heavenly Official finally took his leave with a beaming smile.<br/><br/>Although this old fellow loved to bully the younger generation, it was just a bad habit; he had not killed any juniors. Otherwise, the Three Immortals of the Emperor Sea would not have survived.<br/><br/>“The Ascension Stairway… A grand event under Heaven? Then I must join in on the excitement.”<br/><br/>The corners of Fang Wang’s mouth lifted, and his eyes were filled with anticipation.<br/><br/>The Heavenly Palace has been closed for twenty thousand years, and besides pursuing longevity, one must not miss out on appearing as a saint before others!<br/><br/>Fame and fortune, Fang Wang never shunned them!<br/><br/>Fang Wang sat down again and began to practice his Qi Gathering cultivation technique.<br/><br/>As the sun set and the moon rose, two months passed in a flash.<br/><br/>On this day, Fang Wang successfully broke through to the sixth layer of the Mahayana Realm.<br/><br/>Many Cultivators had already left Grand Qi, making it much quieter. But compared to before Fang Wang accepted challenges, the present-day Grand Qi had already been infused with many new forces of Cultivation. It might not be the strongest dynasty on the continent, but it was certainly the first among the seven kingdoms.<br/><br/>The status of the Great Abyss Gate rose along with the tide, given that Fang Wang still belonged to them. Various sects and kingdoms actively sought the favor of the Great Abyss Gate, leading to a drastic increase in their Cultivation resources.<br/><br/>Fang Wang’s words still held significant deterrent power. After he announced that he would no longer accept challenges, no Cultivator dared to cause trouble in Sword Heaven Marsh, though there was a constant stream of Cultivators who wished to serve as Sword Servants there.<br/><br/>It’s no exaggeration to say that the strength of Sword Heaven Marsh now surpassed that of the various sects of Grand Qi, and this was without taking into account the Three Immortals of the Emperor Sea and Dugu Wenhun.<br/><br/>As night fell, the surface of the lake glistened with ripples.<br/><br/>Xiao Zi approached Fang Wang and gently asked, “Young Master, your two-hundredth birthday is approaching. Your mother wishes to celebrate it for you. What do you think?”<br/><br/>Xiao Zi typically handled messages from the Fang Family to avoid disturbing Fang Wang with trivial matters.<br/><br/>“No need for that. I’ll just return on that day. Making a big deal out of it might not be good,” Fang Wang replied. He was about to turn one hundred and ninety-six and didn’t feel much about the upcoming two hundred, especially since he had spent twenty thousand years in secluded Cultivation in the Heavenly Palace.<br/><br/>Upon hearing this, Xiao Zi nodded.<br/><br/>She didn’t leave, but stayed by Fang Wang’s side, quietly accompanying him.<br/><br/>“Who knows how long this peaceful life will last,” Xiao Zi suddenly remarked with emotion.<br/><br/>Without opening his eyes, Fang Wang asked, “Why such sentimentality? Don’t you enjoy adventures?”<br/><br/>After a moment’s hesitation, Xiao Zi said, “Young Master, I don’t know why, but these past few years, every night, I feel restless and can hardly calm down. It’s as if a great calamity is about to befall us.”<br/><br/>“Could it be your True Dragon Bloodline is attracting trouble again?”<br/><br/>“Not sure, perhaps.”<br/><br/>“Then why don’t you diligently practice your Cultivation and strive to transform into a dragon as soon as possible?”<br/><br/>“I don’t even know how to become a dragon…”<br/><br/>A man and a snake sat at the bridgehead, whispering under the moonlight, their shadows elongating on the wooden bridge.<br/><br/>At dawn, the first ray of sunlight broke through the sky, casting its warmth over the archipelago.<br/><br/>Ji Rutian, clad in golden robes, walked along the beach at the edge of the island, with a black-robed elder leading the way.<br/><br/>Ji Rutian looked ahead and saw a towering peak piercing the clouds, with stones occasionally tumbling down, kicking up dust and debris.<br/><br/>He inquired, “Master, is that the aura of a True Dragon awakening?”<br/><br/>As the black-robed elder advanced, he answered, “There are scarcely more than a handful of True Dragons in the world. This one has lived for nine thousand years; its father was once the mount of the Descending Dragon Great Saint. Its Cultivation is profound and unfathomable.”<br/><br/>Ji Rutian narrowed his eyes and asked, “With such a significant background and my level of Cultivation, can I subdue its vitality?”\t\t\t\t\t\t</div>", "images": {}, "success": true}