{"id": 237, "url": "https://www.novelhall.com/i-became-an-immortal-on-mortal-realm-32879/14553649.html", "title": "Chapter 237 - Chapter 237: Chapter 234: The Foremost Dojo Of The Mortal Realm", "volume": 3, "volume_title": "Volume 3", "body": "<h1>Chapter 237 - Chapter 237: Chapter 234: The Foremost Dojo Of The Mortal Realm</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 237: Chapter 234: The Foremost Dojo of the Mortal Realm<br/><br/>Translator: 549690339<br/><br/>Seeing Fang Wang silent, Tai Xi thought he was considering her words, so she continued to persuade him, “That Daoist site contains the ultimate techniques and magical artifacts of the Hongxuan Emperor, as well as methods related to the fate of becoming a Heaven Emperor. Such an opportunity is rare.”<br/><br/>Fang Wang snapped back to reality and shook his head, “Forget it, I won’t go.”<br/><br/>After speaking, he patted Xiao Zi’s head. Xiao Zi immediately understood and sped up.<br/><br/>This time, Tai Xi didn’t pursue him further.<br/><br/>As she watched Fang Wang disappear into the horizon, she shook her head and thought to herself, it was a pity.<br/><br/>Fang Wang’s name was familiar to her too. His defeat of the revived Thousand Eyes Great Saint had brought his name to the attention of the major forces across the various seas and continents. Although the investigation revealed that it was not the Thousand Eyes Great Saint’s true body, Fang Wang’s performance could not be taken lightly.<br/><br/>With such a reputation, how could Tai Xi not feel regret?<br/><br/>She believed that even if Fang Wang wasn’t the world’s greatest talent, he most certainly ranked among the best, and she couldn’t possibly find a stronger cultivator in the Nirvana Realm.<br/><br/>Tai Xi had her phoenix turn around, heading away from the direction in which Fang Wang had gone.<br/><br/>Returning to Sword Heaven Marsh from the Cang Ji Mysterious Sea took Xiao Zi ten days. Along the way, they enjoyed the scenery, which was rather pleasant.<br/><br/>When they arrived back at Sword Heaven Marsh, rows of stylish buildings had been constructed on the lakeshore, which had a unique charm.<br/><br/>Fang Wang immediately summoned Dugu Wenhun.<br/><br/>Seeing Fang Wang return so quickly, a smile appeared on Dugu Wenhun’s face. He asked, “What do you need me for? Just give the word. Although practicing the Heavenly Emperor Imperial Mirror every day is fulfilling, not having any action for too long feels quite dull.”<br/><br/>Fang Wang sat at the table, sipping the spiritual tea brewed by Song Jinyuan while speaking, “Do you know of the Tiangong Sect?”<br/><br/>He then gestured with his eyes for Dugu Wenhun to sit down.<br/><br/>Dugu Wenhun blinked in surprise and said, “I know of them, what do you want to construct?”<br/><br/>He sat down, picked up the teapot, and poured more tea for Fang Wang.<br/><br/>Fang Wang replied, “I want to rebuild Sword Heaven Marsh, and here I wish to establish my own Daoist site. Ideally, it will promote progress in the Grand Qi Cultivation Realm. I’ve heard Tiangong Sect even has the capability to create Fairyland?”<br/><br/>Dugu Wenhun chuckled upon hearing this and said, “Creating Fairyland is just their boast, but their constructing ability is indeed powerful. They are one of the oldest sects and have helped Great Saints and Great Emperors build Daoist sites many times. This is also why they have lasted through the ages. Relying on their network, there are few powers in the Mortal Realm that would dare to target them. Moreover, the Tiangong Sect does not compete for cultivation resources but sustains its disciples entirely by constructing wondrous Daoist sites. They have an excellent reputation and seldom make enemies.”<br/><br/>“Their life’s pursuit is to create sanctified grounds, Daoist sites, and wonders that will be revered for eternity. By the way, Great Saint Mountain, where the recent great battle with Heaven’s Larceny Saint Sect took place, is a masterpiece of the Tiangong Sect.”<br/><br/>This was the first time Fang Wang had heard of a sect with such a style of conduct, which seemed like a group of dreamers and quite out of place in the Cultivation World.<br/><br/>However, he would be reassured to leave professional work to the professionals.<br/><br/>“Can you help me find someone from the Tiangong Sect?” Fang Wang asked.<br/><br/>Dugu Wenhun pondered, “I do know where they are active. Leave this matter to me. Give me half a year, will that work?”<br/><br/>“Hmm, thank you for this.”<br/><br/>“Don’t mention it. I am your future Vice Sect Hierarch, after all. I’ll be running errands for you.” Dugu Wenhun said with a laugh, now showing less formality, as he had decided to follow Fang Wang for the rest of his life.<br/><br/>Fang Wang replied with a smile, “When you return, I will personally teach you for a month, focusing solely on the Heavenly Emperor Imperial Mirror.”<br/><br/>Dugu Wenhun’s eyes lit up, and he quickly stood up to thank Fang Wang.<br/><br/>After chatting for a few more moments, Dugu Wenhun left eagerly.<br/><br/>Alone in the room, Fang Wang thought about contacting Zhou Xue, but considering she probably already sensed his battle with Zhu Rulai through the jade bracelet on his wrist, there was no need.<br/><br/>No, I must not volunteer to act…<br/><br/>It would be beneath my dignity!<br/><br/>Fang Wang rose to his feet, stepped out of his room, and arrived at the familiar bridgehead to begin his Qi Gathering cultivation.<br/><br/>According to his previous plan, he would consider integrating rare skills every time he made a breakthrough in a major realm, but he had unexpectedly come across the Formless Zhou Tian Technique.<br/><br/>The damage from the past nine thousand eight hundred years still had not dissipated.<br/><br/>That he was able to settle down and cultivate was already an achievement.<br/><br/>In fact, he had wanted to indulge himself for a while, but on second thought, he knew such ideas were unacceptable.<br/><br/>He wanted to make Qi Gathering a leisure activity for himself.<br/><br/>Indeed, he could only hypnotize himself with this thought.<br/><br/>The news of Fang Wang’s battle with Zhu Rulai hadn’t spread, and people across Grand Qi didn’t even know he had left the nation.<br/><br/>Sword Heaven Marsh, on the other hand, had become lively. Xiao Zi began to show off her talents to other sword cultivators, sparking a wave of competitive cultivation within Sword Heaven Marsh.<br/><br/>In the blink of an eye.<br/><br/>Half a year swiftly passed by.<br/><br/>One day, Dugu Wenhun returned, bringing with him two elderly cultivators.<br/><br/>These two men were dressed in simple cloth robes and indeed bore the air of craftsmen. They didn’t go to see Fang Wang immediately but walked along the lake, discussing as they went.<br/><br/>“I didn’t expect this place to have the dragon-attracting technique.”<br/><br/>“I wonder which disciple of our sect did this, although the technique is a bit immature.”<br/><br/>“Despite the dragon-transformation technique, it cannot change such fate.”<br/><br/>“Heavenly Dao has gained such renown recently, choosing this place to establish his Daoist temple, what a pity.”<br/><br/>The two Tiangong Sect cultivators discussed, while in the distance, on the wooden bridge, Dugu Wenhun was introducing the pair to Fang Wang.<br/><br/>“One is named Qiao Xuan, and the other Qiao Li. They are brothers, raised in the Tiangong Sect since childhood, over a thousand years old. Although the cultivators are only in the Golden Body Realm, they are highly respected, and even cultivators in the Nirvana Realm would not dare to disregard them. When they heard I was managing affairs on behalf of Heavenly Dao, they approached proactively.”<br/><br/>Dugu Wenhun pointed to the two men and spoke, Fang Wang nodded slightly; he could hear the conversation between Qiao Xuan and Qiao Li.<br/><br/>Could it be that Sword Saint had once joined the Tiangong Sect?<br/><br/>After hearing the two men reveal the secrets of Sword Heaven Marsh, Fang Wang looked forward to them even more.<br/><br/>A good half-hour passed before Qiao Xuan and Qiao Li approached Fang Wang and Dugu Wenhun. They bowed with clasped hands and introduced themselves.<br/><br/>“Heavenly Dao, I will speak frankly. If you choose this place as your Daoist temple, it will be hard to create something that surpasses the Great Saint’s Grotto-Heaven or the Zhui Tian Secret Realm,” Qiao Xuan said earnestly.<br/><br/>Upon hearing this, Fang Wang asked curiously, “Were the Great Saint’s Grotto-Heaven and Zhui Tian Secret Realm built by your Tiangong Sect?”<br/><br/>Qiao Li nodded and said, “Indeed, our sect’s annals do contain such records. Although the Great Saints possess the power to create worlds, they still ask for the help of the Tiangong Sect, because we can help them perfect their Daoist temples and secret realms, including the arrangement of prohibitions.”<br/><br/>Xiao Zi peeked her head out from behind Fang Wang and asked in puzzlement, “If that’s the case, why don’t you just go and take the treasures inside?”<br/><br/>Qiao Xuan frowned and said, “The very foundation of the Tiangong Sect is to not engage in worldly strife or vie for external possessions. If any disciple dares to excavate the abodes of ancient powerhouses, the sect’s enforcers would punish them.”<br/><br/>Fang Wang patted Xiao Zi’s head and looked at Qiao Xuan and Qiao Li, saying, “Indeed, the fate here has declined, but as you say, your life’s goal is to create a Daoist temple that amazes the mortal realm. I have a concept for the number one Daoist temple in the mortal realm. Why don’t you listen to it and then decide whether you want to undertake it?”\t\t\t\t\t\t</div>", "images": {}, "success": true}