{"id": 236, "url": "https://www.novelhall.com/i-became-an-immortal-on-mortal-realm-32879/14553259.html", "title": "Chapter 236 - Chapter 236: Chapter 233: The Reincarnation Of The True Buddha, Suzhen Palace", "volume": 3, "volume_title": "Volume 3", "body": "<h1>Chapter 236 - Chapter 236: Chapter 233: The Reincarnation Of The True Buddha, Suzhen Palace</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 236: Chapter 233: The Reincarnation of the True Buddha, Suzhen Palace<br/><br/>Translator: 549690339<br/><br/>“The Absolute Emperor is just a legend, no one knows if he truly existed,” scoffed the Hongxuan Emperor, seemingly quite dissatisfied with the Absolute Emperor.<br/><br/>Miao Wufa glanced at him and asked, “What you’re saying, if you have to see to believe, then should I not believe in the Great Saint’s existence just because I haven’t seen him?”<br/><br/>The Hongxuan Emperor then said, “The Hongxuan Emperor was a Great Emperor from fifty thousand years ago, and not a single Great Emperor has been born in the last thirty thousand years. Tell me, the Hongxuan Emperor has never seen the Absolute Emperor, in what year was the Absolute Emperor born? And, is there any legacy of the Absolute Emperor in the world today?”<br/><br/>Miao Wufa glared back and said, “What basis do you have for this? Are you really taking yourself for the Hongxuan Emperor? How could the Hongxuan Emperor know about the Mortal Realm after his death? Could it be that a Great Emperor couldn’t have emerged in these twenty thousand years?”<br/><br/>Zhu Rulai then interjected, “I have received the legacy of the Hongxuan Emperor. He left his legacy in many places in the Mortal Realm, but that doesn’t necessarily mean it was the strongest. In my view, the mysterious and elusive legacy of the Absolute Emperor is even more powerful.”<br/><br/>The Hongxuan Emperor nearly spat blood.<br/><br/>Fang Wang’s lips slightly curled, unsure whether these two recognized the Hongxuan Emperor’s identity, or if they truly thought this way. It was quite hurtful.<br/><br/>Thus it was that Miao Wufa and Zhu Rulai jointly disparaged the Hongxuan Emperor, with the Hongxuan Emperor himself desperately trying to promote his own name. However, facing an additional mouth on the other side, he simply couldn’t win the argument.<br/><br/>“My Heaven and Earth God-Transforming Technique is a legacy of the Hongxuan Emperor. It’s been proven that Fang Wang possesses potential that surpasses that of the Hongxuan Emperor.”<br/><br/>Zhu Rulai stated seriously, his gaze towards Fang Wang turning reverent.<br/><br/>After the great battle had cooled down, he began to feel a sense of fear.<br/><br/>This battle made him realize the drawbacks of the Heaven and Earth God-Transforming Technique. He had relied too much on it before, putting the cart before the horse. Fortunately, he had encountered Fang Wang first. If he had faced a mortal enemy, he might not even be able to escape, for the Cangji Sea of Oblivion was his true form.<br/><br/>The Hongxuan Emperor remained silent, and from the twitching of his eyelids, it was clear that his heart was far from calm.<br/><br/>“Enough about those ancient legends, let’s talk about the Buddhist Sect.”<br/><br/>Fang Wang cut them off, fearing that the discussion would provoke the Hongxuan Emperor to a rampage.<br/><br/>Zhu Rulai’s expression darkened at the mention of the Buddhist Sect.<br/><br/>Miao Wufa taunted, “The Buddhist Sect is full of pretentious folks. When it comes to Buddhist nature, even an ordinary monk would do better. They claim to walk the world, saving the suffering sentient beings, yet they only rescue exceptional orphans. Zhu Rulai was one of them.”<br/><br/>“Once you join the Buddhist Sect, you cannot betray it, you must serve the Sect for life, and spread the teachings everywhere. Zhu Rulai didn’t want to be a puppet of the Buddhist Sect, so he left. But his departure was seen as a provocation to the Buddhist Sect, and from time to time, they would send people to try and kill him.”<br/><br/>Zhu Rulai said expressionlessly, “Although the Buddhist Sect is overbearing, my life was saved by the Sect, and I was raised by them. I cannot possibly become an enemy of the Sect.”<br/><br/>“Ts, you practice demonic arts and are still so benevolent? No wonder your disciples were subdued by the Buddhist Sect,” Miao Wufa’s words made Zhu Rulai’s face turn extremely sour.<br/><br/>“How strong is the Buddhist Sect really?”<br/><br/>This was what Fang Wang was truly concerned about, not those debts of gratitude and revenge.<br/><br/>Miao Wufa shook his head and said, “Even though I have a lot of disdain for the Buddhist Sect, I must admit that they are strong. And in this era, it’s said that a true Buddha has been born within the Sect. It’s rumored that this true Buddha is a reincarnation of a Buddhist spirit from The Upper Realm. How strong exactly, no one really knows. Recently, the Buddhist Sect has been zealously slaying dragons, dispatching the Eighteen True Buddhas. Their strength is immense; a Nirvana Realm Great Cultivator of the Jin Xiao Sect had his spirit treasure shattered by one of the True Buddhas and will need at least a few hundred years to heal.”<br/><br/>He revealed all the intelligence that he knew, and even Zhu Rulai’s countenance became somber, clearly unaware of these reports.<br/><br/>Ever since the True Dragon emerged, powers from all over have been dragon hunting, and he was no exception.<br/><br/>The Flood Dragon group surrounding this island had been transformed by a certain True Dragon.<br/><br/>Fang Wang listened carefully. Miao Wufa said a lot, but he couldn’t clarify the realms of the high-ranking members of the Buddhist Sect. However, using Zhu Rulai as a reference, the Buddhist Sect might be the strongest Sect he has encountered so far.<br/><br/>“What’s the origin of the dragon at the bottom of the sea?” Fang Wang asked.<br/><br/>He could feel a vast and ancient breath from the bottom of the sea, one that was far more powerful than Xiao Zi, possibly the Dragon King Zhou Xue had mentioned.<br/><br/>Zhu Rulai replied, “This monster was once the most powerful creature in the Cangji Sea of Oblivion. After becoming a dragon, it caused havoc and I suppressed it at the bottom of the sea. Its demonic power is very peculiar, causing the monsters in this area to continuously transform into dragons, though they couldn’t reach the level of a True Dragon.”<br/><br/>Without the True Dragon Bloodline, I’ve seen an ordinary fish spirit transform into a Flood Dragon. That shows the dragons at the bottom of the sea are not simple, and if there’s a king among them, then he’s the Dragon King,” added Miao Wufa.<br/><br/>Fang Wang asked other questions, and Zhu Rulai, sincere in his attitude, shared everything he knew.<br/><br/>Like that.<br/><br/>Half an hour later, Fang Wang got up, ready to take his leave, while the Hongxuan Emperor planned to stay, representing the Jin Xiao Sect in discussions with Zhu Rulai.<br/><br/>“By the way, Fang Wang, Sword Heaven Marsh probably won’t satisfy your cultivation needs. Sooner or later, you’ll need to forge your own cultivation grounds. If you need it, you can seek out the Tiangong Sect. They’re dedicated to creating cultivation grounds and wonders of the Mortal Realm. As long as you can pay the price, they can even build you a slice of Fairyland,” Miao Wufa suddenly mentioned, extolling the Tiangong Sect.<br/><br/>Fang Wang raised his hand without looking back.<br/><br/>He quickly left on Xiao Zi, vanishing into the horizon.<br/><br/>Zhu Rulai, Miao Wufa, and the Hongxuan Emperor stood side by side, watching Fang Wang’s departing figure, each with their own thoughts.<br/><br/>“In this era of great contention, who is qualified to be his adversary?” Zhu Rulai exclaimed sincerely.<br/><br/>The Hongxuan Emperor murmured, “With his background, looking across history, there are probably very few who could contend with him.”<br/><br/>He firmly believed that Fang Wang was the reincarnation of the Grand An Divine Emperor.<br/><br/>Before his own ascension, the Grand An Divine Emperor was the mythological figure he admired most.<br/><br/>Because of this conjecture, his impression of Fang Wang began to change.<br/><br/>Speaking out with profound meaning, Miao Wufa said, “By the way, don’t you think the Demon Monarch is also no simple character?”<br/><br/>Zhu Rulai frowned, and the Hongxuan Emperor shook his head, lost in thought.<br/><br/>Under the twilight, above the sea level, a Purple Dragon roamed the sky, its form majestic and beautiful.<br/><br/>“Young Master, that dragon beneath the island wants to create its own Dragon Race and has asked me to persuade you to rescue it,” Xiao Zi suddenly spoke up.<br/><br/>Not having spoken until now, it couldn’t hold back any longer.<br/><br/>“Then why didn’t you say so earlier?”<br/><br/>“Humph, I don’t want to rescue him. What is he anyway? The True Dragon Race should only be created by you and me, Young Master. I’ve even thought of a name; how about ‘True Dragon Celestial Race’?”<br/><br/>“Hmm?”<br/><br/>Fang Wang, meditating upon the Dragon Head, stretched out his hand and pressed it on its head, exerting a slight force, causing it to cry out in pain and hurriedly admit its mistake.<br/><br/>Fang Wang hummed, “If you want to become the Dragon King, you have to be the strongest dragon. Don’t disgrace your status as a princess of the True Dragon Race.”<br/><br/>“Understood, once we return, I’ll focus on my cultivation. Now that I’ve transformed, I’ll definitely shock Chu Yin and Zhu Yan!”<br/><br/>Xiao Zi said proudly with a laugh that echoed over the sea surface. Fang Wang wasn’t bothered by the noise and let it chatter on.<br/><br/>He was thinking about another matter.<br/><br/>That was Tiangong Sect, as mentioned by Miao Wufa.<br/><br/>The Formation at the bottom of Sword Heaven Marsh had been damaged by the Town World Bead.<br/><br/>Indeed, it was time for him to establish his own cultivation place.<br/><br/>He could later ask Qu Xunhun and Dugu Wenhun about Tiangong Sect.<br/><br/>Now strong enough, chances were just an addition to his strength, not an essential competition; it was also time to give back to the land that had nurtured him.<br/><br/>Where the Great Saints reside is the center of the Mortal Realm, and he, Fang Wang, should have such ambition too!<br/><br/>Of course, he should still compete for good opportunities encountered during adventures outside.<br/><br/>Whistle—<br/><br/>A shrieking cry came from the edge of the sky, and Fang Wang looked up to see a gigantic firebird approaching with its wings outstretched, the heat waves assaulting him first.<br/><br/>Xiao Zi was not afraid at all, tilting its head back and letting out a dragon’s roar that was deafening.<br/><br/>Very quickly.<br/><br/>The firebird flew past Xiao Zi, and Fang Wang noticed a figure standing on the firebird’s back, but he didn’t pay it any mind.<br/><br/>“Fellow Daoist, please hold a moment.”<br/><br/>A pleasing female voice came from behind. The firebird turned and chased after them with flapping wings.<br/><br/>Xiao Zi, thirty zhang in length, looked as small as an eel in front of it, which annoyed Xiao Zi.<br/><br/>On the back of the firebird stood a woman in white, her garments as white as snow, her waist wrapped with a colorful sash, her head adorned with a feathered crown, her beauty capable of toppling cities, with willowy eyebrows and apricot eyes, and a pair of lovely eyes fixed on Xiao Zi.<br/><br/>Amidst the roaring flames, the woman in white appeared like an immortal descending from heaven, not fearing any mortal flame.<br/><br/>“Fellow Daoist, your True Dragon has an excellent appearance. Are you interested in a trade? Just state your demands, and I will fulfill them to the best of my ability,” the woman in white said, the more she looked at Xiao Zi, the more she liked it.<br/><br/>Without waiting for Fang Wang to speak, Xiao Zi indignantly said, “Would you be willing to serve as a concubine or a slave for my master?”<br/><br/>As soon as these words were spoken, the woman in white frowned.<br/><br/>Fang Wang helplessly said, “Do not speak nonsense.”<br/><br/>He turned his head to look at the woman in white and said, “This dragon is unruly and only suitable to stay with me.”<br/><br/>Nirvana Realm cultivation level!<br/><br/>She seemed to have an impressive background, and the firebird beneath her feet was not afraid of the dragon’s might; it was unknown what kind of race it was.<br/><br/>The woman in white was not angry; instead, she shifted her gaze to Fang Wang and said, “I come from Suzhen Palace, and my name is Tai Xi. May I know your esteemed name?”<br/><br/>“Eternal Life Pavilion, Fang Wang,” Fang Wang casually replied.<br/><br/>“Fang Wang? Are you Tian Dao Fang Wang?”<br/><br/>Tai Xi raised her eyebrows, curiously asking.<br/><br/>Fang Wang nodded and said, “If there is nothing else, let’s part ways here.”<br/><br/>Upon hearing this, Tai Xi had no choice but to slow down the firebird.<br/><br/>Her eyes flickered, pondering something.<br/><br/>After a while, she once again brought the firebird beside Xiao Zi and said, “I heard that Fellow Daoist is only a little over two hundred years old; may I ask what realm you are in?”<br/><br/>“I mean no harm; it just so happens that I have an opportunity that requires assistance. If Fellow Daoist is still in the Nirvana Realm, why not join me?”<br/><br/>Fang Wang gazed ahead, calmly asking, “What opportunity is it?”<br/><br/>Hearing the question, Tai Xi showed a smile and followed up by saying, “This opportunity stems from one of Hongxuan Emperor’s cultivation places. It can only be assessed by five Nirvana Realm cultivators; no more, no less. Moreover, they must be at the Nirvana Realm level. I’ve organized four Nirvana Realm cultivators before, but unfortunately, they lacked enough strength and failed. If Fellow Daoist could help, our chances of success would be much higher.”<br/><br/>Hongxuan Emperor’s legacy?<br/><br/>Zhu Rulai had not lied; this person indeed left opportunities everywhere.\t\t\t\t\t\t</div>", "images": {}, "success": true}