{"id": 238, "url": "https://www.novelhall.com/i-became-an-immortal-on-mortal-realm-32879/14553650.html", "title": "Chapter 238 - Chapter 238: Chapter 235: The Story Of Generations", "volume": 3, "volume_title": "Volume 3", "body": "<h1>Chapter 238 - Chapter 238: Chapter 235: The Story Of Generations</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 238: Chapter 235: The Story of Generations<br/><br/>Translator: 549690339<br/><br/>Hearing Fang Wang’s words, Qiao Xuan and Qiao Li grew interested.<br/><br/>They naturally didn’t believe in the “Number One Daoist Site in the Mortal Realm,” but they were very interested in Fang Wang himself. Given Fang Wang’s talent and abilities, he had the potential to reach the pinnacle among mortals, and perhaps his name would go down in history. If so, Fang Wang’s Daoist site could also become legendary, which was exactly what they desired.<br/><br/>The Tiangong Sect’s disciples pursued not longevity, nor becoming immortals, but rather the culmination of their life’s ultimate learnings.<br/><br/>Having reached the age of understanding destiny, Qiao Xuan and Qiao Li had built many cave dwellings and wonders, even crafting mountains and lakes throughout their lives. Unfortunately, their past achievements had not been satisfying.<br/><br/>Mainly because they hadn’t met the right person.<br/><br/>They had chosen prodigies before, most of whom had met early deaths, resulting in their cave dwellings and Daoist sites being destroyed or seized, eventually falling into ruin.<br/><br/>A saying circulated within the Tiangong Sect: it is better to choose a person and build a Daoist site to help them become a great saint than to build one for a great saint.<br/><br/>When a Daoist site is built for a great saint, people only remember the saint. But by helping someone become a saint, future generations will also speak of the Tiangong Sect when they talk about that saint.<br/><br/>“Please, speak.”<br/><br/>Qiao Xuan said, his eyes full of anticipation.<br/><br/>Fang Wang smiled and said, “Let’s talk inside the house.”<br/><br/>After saying that, he turned and walked towards the loft. Qiao Xuan, Qiao Li, and Dugu Wenhun immediately followed, while Xiao Zi slipped away, ready to spread the news.<br/><br/>The establishment of a Daoist site by Tian Dao in Sword Heaven Marsh would surely excite Grand Qi.<br/><br/>Xiao Zi understood Fang Wang well; since Fang Wang wanted to establish a Daoist site at Sword Heaven Marsh, it meant he intended to benefit the land of Grand Qi. It was good to spread the news sooner rather than later.<br/><br/>Once inside the house and seated, Fang Wang began to share his ideas.<br/><br/>“I want to build a mountain next to Sword Heaven Marsh, the taller the better, with various restrictions placed upon it forbidding flight. One must ascend on foot. The higher one’s realm, the greater the suppression they’ll face. In the future, I’ll live at the summit, making this mountain the number one sanctum for seeking the Dao in the mortal realm. Mortals can come to seek the Dao, but they must reach the top of the mountain…”<br/><br/>Fang Wang spoke enthusiastically.<br/><br/>After explaining the overall concept, he started discussing the details.<br/><br/>Dugu Wenhun showed a look of admiration; truly befitting of a man who carried the name of Heavenly Dao. In building a Daoist site, he considered leaving opportunities for future generations, a vision worthy of sainthood!<br/><br/>Qiao Xuan and Qiao Li had heard such grand but empty ideas before, but it was their first time hearing that the intent behind establishing a Daoist site was to leave opportunities for others. Other cultivators’ ideas centered mainly around cultivation, focusing on the concentration and compression of spiritual energy.<br/><br/>When Fang Wang finished speaking, Qiao Li could not help but ask, “If such a Daoist site is successfully established, it truly could become the number one Daoist site under heaven. But constructing the number one majestic peak alone would take many years. Even if we devoted the latter half of our lives to it, we might not succeed.”<br/><br/>Fang Wang laughed and said, “I am only two hundred and twenty-three years old now; I can wait. Even if you two cannot complete it, your descendants could take over. If one wishes to be the number one in the mortal realm, or even for all eternity, it takes not only difficulty of construction but also a story. Generation after generation of the Qiao Family of the Tiangong Sect toiling to build this mountain, wouldn’t such a spirit be more likely to be remembered for ages?”<br/><br/>Qiao Xuan and Qiao Li exchanged glances, each noticing the excitement in the other’s eyes.<br/><br/>“Even with our lifespan, if I lower my demands, it might not be possible to create the most perfect masterpiece of your lives. However, if we extend the timeframe, allowing generations to continue building, in the meantime, the cultivators who visit me will also spread the word, and it will surely become a beautiful tale. If one day I prove my sainthood, I will treat the Qiao Family and the Tiangong Sect kindly. Although it may sound arrogant, I believe if I can’t become a great saint, then which genius in this world can? Of course, on the path of cultivation, opportunity is also crucial, and it all depends on your choice.”<br/><br/>“Moreover, with a longer cycle, there is more time to gather the necessary resources, isn’t there?”<br/><br/>Fang Wang spoke earnestly, very sincerely, and indeed, Qiao Xuan and Qiao Li were moved.<br/><br/>Qiao Xuan stood up and said, “Heavenly Dao, we need to discuss this matter back home. At the latest, two years from now, we will come to visit you.”<br/><br/>Fang Wang nodded with a smile, and then had Dugu Wenhun see them off.<br/><br/>After the three left, Song Jinyuan entered the room, excitedly asking, “Are you really planning to create a Daoist site at Sword Heaven Marsh?”<br/><br/>Fang Wang smiled and said, “Indeed, and I’m going to erect a statue for the Sword Saint in the future. Everyone who has granted me their legacy can leave their statue in the Daoist site, what do you think?”<br/><br/>Song Jinyuan was stunned for a moment, then said with emotion, “Good, very good. You’re certainly the most worthwhile disciple Master has ever taken in this lifetime. In terms of repaying our teacher, I’m no match for you.”<br/><br/>Fang Wang laughed and replied, “Song Senior Brother, the Daoist site will still need your management in the future. You must cultivate well; at the very least, you should survive beyond the day the Daoist site is successfully established.”<br/><br/>Song Jinyuan glanced at him, not angry but rather proudly said, “Don’t worry, I’ve already begun to comprehend the Celestial Sword Intent; living another five hundred years won’t be a problem.”<br/><br/>The two chatted for a while longer, with Song Jinyuan mainly curious about what kind of Daoist site Fang Wang wanted to create. After hearing Fang Wang’s vision, he felt his blood boil with excitement and asked if he should recruit Sword Servants.<br/><br/>Fang Wang indicated that it should happen naturally, without any special recruitment.<br/><br/>That month, news about Heavenly Dao Fang Wang’s plan to establish a Daoist site at Sword Heaven Marsh spread throughout Grand Qi, causing discussions among major Cultivation Sects and noble families alike.<br/><br/>The Great Abyss Gate was the first to send representatives with a large number of Spirit Stones, expressing that Heavenly Dao’s Daoist site would bless Grand Qi. As a Cultivation Sect of Grand Qi, it was proper for the Great Abyss Gate to contribute its strength.<br/><br/>Seeing Great Abyss Gate behave this way, other cultivation sects hurriedly followed suit, some even started to compete, and in no time, Sword Heaven Marsh became lively once again.<br/><br/>Fang Wang accepted everything on the list and had Song Jinyuan announce the quantity of spirit stones gifted by the various forces; one reason was to show gratitude, the other was to help them boost their fame.<br/><br/>Even though he didn’t disclose the value of the gifts, the various forces had already started their open and covert battles. Why not repay them with some fame?<br/><br/>Gradually, the news spread far and wide, and the sects all over the continent began sending gifts to Sword Heaven Marsh. Major sects and great clans understood that if Heavenly Dao established his way on the continent, as long as he was alive, the continent would surely soar because of him.<br/><br/>Moreover, Heavenly Dao had no desire for power; otherwise, with his current strength and reputation, he could completely sweep across the continent, establish his own sect, but he didn’t. He didn’t even deliberately support Great Abyss Gate. Such a Heavenly Dao earned the respect of most sects. In their hearts, Fang Wang was the true cultivator.<br/><br/>In the blink of an eye,<br/><br/>the seasons changed, and a year passed by swiftly.<br/><br/>That year, Fang Bai headed north, preparing to undergo further training, and Chu Yin accompanied him, but Fang Wang only allowed them to train within this continent.<br/><br/>After Fang Bai, the Fang Family birthed another batch of geniuses. Coming to Sword Heaven Marsh to comprehend sword intent had become a necessary journey for Fang Family disciples, and Fang Wang didn’t refuse them.<br/><br/>That year, Fang Wang felt Zhou Xue’s divine consciousness transmit from the jade bracelet, and he immediately sent his divine consciousness into it.<br/><br/>He was still inside the Fang Residence Illusion Realm.<br/><br/>He saw Zhou Xue’s figure, her expression somewhat cold. Upon seeing Fang Wang, she finally showed a smile.<br/><br/>“What’s happened? What’s wrong?” Fang Wang asked, as he seldom saw Zhou Xue wear such an expression.<br/><br/>Could it have something to do with the Buddhist Sect?<br/><br/>Zhou Xue spoke, “Fang Zigeng has had an accident.”<br/><br/>Upon hearing this, Fang Wang’s eyebrows instantly furrowed, and his eyes turned sharp.<br/><br/>Ever since Fang Xun’s incident, Fang Wang had been afraid that another peer from his clan would face misfortune, and it turned out it had still happened, and this time, it was Fang Zigeng.<br/><br/>Within the Fang Family, aside from Zhou Xue, Fang Hanyu, it was Fang Zigeng who had the closest relationship with Fang Wang, even closer than with his younger sister Fang Ling. After all, they had been disciples of Great Abyss Gate together and had experienced many trials and tribulations.<br/><br/>Fang Zigeng was low-profile and acted even more prudently than Fang Hanyu. What kind of trouble could he have gotten into?<br/><br/>“Supreme Sect?” Fang Wang asked, his voice laced with chill.<br/><br/>Zhou Xue sighed, “Supreme Sect has been annihilated, not a single one left. Fang Zigeng was implicated. The culprit is a cultivator known as the Extremely Evil Old Immortal. His cultivation isn’t weak, and he can detect my divinations. I can’t catch him for now.”<br/><br/>“And Zigeng? Is he dead?” Fang Wang asked, noticeably anxious.<br/><br/>“No, he’s not. I can feel he’s still alive, and his aura is quickly strengthening, but since he’s constantly by the side of the Extremely Evil Old Immortal, he’s ultimately in danger. The annihilation of Supreme Sect happened years ago. I didn’t mention it to you earlier because I didn’t want to worry you, and even if you knew, you wouldn’t be able to track down the Extremely Evil Old Immortal,” explained Zhou Xue. Hearing this, Fang Wang immediately breathed a sigh of relief.<br/><br/>I thought as much.<br/><br/>Fang Zigeng, that guy, always manages to turn danger into safety. He couldn’t have died so easily.<br/><br/>Zhou Xue remarked with emotion, “Speaking of which, Fang Zigeng’s luck is truly extraordinary. A long time ago, he accidentally obtained a piece of the Heaven’s Larceny Saint Sect’s Saint Spirit Demon Soul. His survival this time is probably related to that fragment. I can sense his aura merging with the Saint Spirit Demon Soul, and I’m not sure if he survived his past life.”<br/><br/>Astonished, Fang Wang asked, “Wasn’t the Fang Family completely exterminated in his past life?”<br/><br/>“The Fang Family was indeed thoroughly annihilated, but there were always some who escaped death. Am I not the best example? Although, I also searched for Fang Family members afterward but to no avail,” Zhou Xue said, shaking her head. Then, looking at Fang Wang, she smiled, “Thinking back, those of us who struggled to survive may have been blessed by you. I was able to escape from that cultivator’s hands. Surely it was because you were holding him back. It’s just a pity that I didn’t get to witness your heroics at that time.”<br/><br/>Fang Wang replied with a laugh, “A man must protect his home; even if he dies, his life in this world is not wasted.”<br/><br/>He had no doubt that if there really were a past life, and he found himself ignorant of the opponent’s power while his family faced calamity, he would certainly fight to the death.<br/><br/>He indeed sought longevity, but he didn’t fear death!<br/><br/>After all, he had already died once; to him, some things were more important than mere survival.<br/><br/>“Did you contact me today because you found out where the Extremely Evil Old Immortal is?” Fang Wang, changing the subject, asked—he was also very concerned about Fang Zigeng and wanted to rescue him as soon as possible.<br/><br/>Zhou Xue shook her head and said, “The Extremely Evil Old Immortal is moving away from Descending Dragon Continent. Even if I showed you the direction, you couldn’t possibly catch up. His cultivation is above Heaven-Breaking Realm. As for which level of Divine Passage Realm he is on, I can’t calculate for now. In my past life, I never heard of this person’s name.”<br/><br/>“Today, besides informing you of this matter, there’s another issue regarding Xiao Zi. Her identity as the princess of the True Dragon Clan has been exposed. I don’t know who’s behind it, but it will surely bring you trouble in the future.”\t\t\t\t\t\t</div>", "images": {}, "success": true}