{"id": 239, "url": "https://www.novelhall.com/i-became-an-immortal-on-mortal-realm-32879/14554540.html", "title": "Chapter 239 - Chapter 239: Chapter 236 An Impossible Assessment", "volume": 3, "volume_title": "Volume 3", "body": "<h1>Chapter 239 - Chapter 239: Chapter 236 An Impossible Assessment</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 239: Chapter 236 An Impossible Assessment<br/><br/>Translator: 549690339<br/><br/>“Could it be the Ji Family? Haven’t you mentioned that the Ji Family has someone who knows his heavenly fate?” Fang Wang asked.<br/><br/>Although he no longer regarded Ji Rutian as a threat, after all, Ji Rutian was an Ascender from his previous life, and Fang Wang could not kill him yet, so he naturally had some concerns.<br/><br/>Zhou Xue answered, “Maybe, it’s possible, in any case, just be careful.”<br/><br/>Fang Wang nodded.<br/><br/>Zhou Xue hesitated for a moment, then said softly, “Even though I’ve lived again, I can’t possibly protect everyone around me, and neither can you, anything could happen in the future. No matter what it is, don’t act impulsively, you can discuss it with me first.”<br/><br/>Fang Wang replied annoyedly, “The way you say it, it’s as if I’m some kind of reckless brute. When I went to the Emperor Sea, I was confident, have you forgotten about the Jiuyou Zizaishu?”<br/><br/>“Yes, indeed, you were confident. With the Jiuyou Zizaishu, you could indeed move freely, but nothing is absolute, it’s always wiser to be cautious.”<br/><br/>“Don’t worry, I’m very stable.”<br/><br/>In front of Zhou Xue, Fang Wang revealed his true self. He was always reserved around others, only showing his real feelings in front of Zhou Xue and Xiao Zi.<br/><br/>Zhou Xue stepped forward, raised her right hand, and placed her index finger on Fang Wang’s heart, looking straight into his eyes as she asked, “Have you already brought the Formless Zhou Tian Technique to Great Completion?”<br/><br/>Upon hearing this, Fang Wang answered, “I guess it’s complete, but whether it’s Great Completion, I’m not sure.”<br/><br/>Sorry!<br/><br/>It’s not Great Completion!<br/><br/>It’s Great Perfection!<br/><br/>However, Fang Wang planned to keep a card up his sleeve and not reveal too much.<br/><br/>Zhou Xue’s eyes became complicated as she shook her head slightly, then stepped back.<br/><br/>“That’s it then, I wish you smooth progress in building your daoist field.”<br/><br/>Leaving these words behind, Zhou Xue turned and left.<br/><br/>Just as Fang Wang wanted to speak, the illusionary realm shattered.<br/><br/>Fang Wang opened his eyes and murmured, “Was she stung?”<br/><br/>On reflection, it made sense. Zhou Xue from his former life hadn’t even managed to reach Great Completion with the Formless Zhou Tian Technique. In just this short span of time, it would indeed be startling to anyone else.<br/><br/>He wasn’t worried, though. Zhou Xue was a reborn person. The final look in her eyes just now was filled with an unwillingness to admit defeat.<br/><br/>Fang Wang would not become complacent; he needed to practice even harder, maintaining the pressure on Zhou Xue.<br/><br/>Yes, if Zhou Xue wanted to surpass her previous life, she needed his pressure.<br/><br/>Fang Wang’s lips curled into a smile as he continued his cultivation.<br/><br/>Breaking through the minor realms within the Nirvana Realm was more difficult than the earlier realms. Even with the Heavenly Dao Immensity Scripture, it was not possible for him to break through a minor realm every three to four years, but he still felt his cultivation growing quickly, and that was enough to satisfy him.<br/><br/>Qi Cultivation, Spiritual Refinement, Spirit Pill, Xuan Heart, Condensation, Crossing Void, Golden Body, Mahayana, Nirvana, Heaven Breaking, Divine Skills!<br/><br/>He wondered what lay beyond the Divine Passage Realm and how far it was from the Celestial Qiankun?<br/><br/>Fang Wang immersed himself in his cultivation with anticipation.<br/><br/>As for Fang Zigeng’s affairs, Fang Wang decided not to relay them back to the Fang Family, to avoid worrying his family members. Besides, he always felt that Fang Zigeng could turn calamity into a fortuitous opportunity.<br/><br/>Perhaps for Fang Zigeng, this was also a great chance!<br/><br/>As winter passed and spring arrived, when the winter snow in Sword Heaven Marsh had just melted, Qiao Xuan and Qiao Li returned, and they brought a dozen cultivators with them.<br/><br/>Fang Wang received Qiao Xuan and others in the attic.<br/><br/>Qiao Xuan said excitedly, “Tian Dao, we’ve accepted your proposal, and the Tiangong Sect will even provide some resources for you. These people are all disciples from the Qiao Clan, here to meet with you and finalize the details. More Tiangong Sect cultivators will come in the future to build your daoist field together. Also, the Qiao Clan will relocate near Sword Heaven Marsh. We hope you can agree to this.”<br/><br/>The other Qiao Clan disciples were also excited. Some looked at Fang Wang with eyes filled with admiration, clearly having heard of Fang Wang’s exploits.<br/><br/>Fang Wang laughed, “That is indeed good, Sword Heaven Marsh welcomes you all.”<br/><br/>Following this, Qiao Li began to introduce the cultivators accompanying them. These people were related to them within three generations and constituted the backbone of the Qiao Clan, well-versed in the art of Tiangong.<br/><br/>Seeing Fang Wang’s easygoing attitude, the Qiao Clan cultivators relaxed and started to express their admiration.<br/><br/>“Tian Dao senior, did you really defeat the resurrected Thousand Eyes Great Saint?”<br/><br/>“You’ve made a name for yourself in the Emperor Sea. To this day, various factions of the Xuan Dynasty curse you. It’s truly delightful. The Xuan Dynasty has always been domineering. Back when I was young, I helped them build an imperial tomb, but they were unsatisfied and didn’t even pay me.”<br/><br/>“I have a good friend, also one of the twenty-four elders of the Eternal Life Pavilion. He said you’re not even on the same level as them, and they even feel that their pavilion master is no match for you.”<br/><br/>“Is it true that The Three Immortals of the Emperor Sea are cultivating under your tutelage?”<br/><br/>“On other continents too, legends about you are being told. I’ve long wished to meet you.”<br/><br/>Dugu Wenhun did not anticipate the Qiao Clan disciples would hold Fang Wang in such high regard. Both Qiao Xuan and Qiao Li could only smile wryly.<br/><br/>It couldn’t be helped; there were countless geniuses in the world, but very few could defeat a Great Saint, even if that saint was not in his true form. That was enough to mythologize Fang Wang.<br/><br/>What was key was that Fang Wang was only a little over two hundred years old!<br/><br/>A Nirvana Realm cultivator in his early two hundreds—wherever he went, his speed of cultivation was enough to make geniuses despair.<br/><br/>They chatted for a full half-hour before Qiao Xuan and Qiao Li took their leave with the younger generations. Next, they would scope out Sword Heaven Marsh for a while to decide where to construct the daoist field.<br/><br/>Fang Wang had asked if they needed his help in mountain-shaping.<br/><br/>Qiao Xuan smiled contentedly and said, “Moving and shaping mountains is the expertise of the Tiangong Sect. How could we let the employer lend a hand? It’d be a joke if word got out. Just watch.”<br/><br/>These words increased Fang Wang’s anticipation toward the Tiangong Sect.<br/><br/>One month later, the Tiangong Sect’s name had spread throughout Grand Qi, and it was the first time the Grand Qi Cultivation Realm had come into contact with such a sect, with many sending representatives to form alliances.<br/><br/>More and more disciples from the Qiao Clan arrived, and after assessing the terrain, they did not immediately start constructing mountains. Instead, they began demarcating the land. This action nearly enclosed the entirety of the southern region of Grand Qi, encompassing a territory nearly five thousand li in radius, all the way to the southern seas. When the Emperor of Grand Qi learned of this, he directly promised support and ordered the citizens of the southern cities to start relocating to the north. The matter caused an uproar across the lands, and although the local populace was dissatisfied, the compensation provided by the Fang Family in the form of food, money, and goods quelled the unrest.<br/><br/>This affair caused dissatisfaction among many of the Fang Family Disciples, but Fang Meng had the final say on the matter, depleting the Fang Family’s secular wealth. This only caused grievances among those of the Fang Family Disciples with mediocre cultivation aptitude. As for the Fang Family Members who were pursuing the path of cultivation, these resources were of little significance.<br/><br/>On this day.<br/><br/>Qiao Xuan sought out Fang Wang.<br/><br/>“What is this mountain called? We’re ready to erect a stele,” Qiao Xuan asked.<br/><br/>Fang Wang pondered and said, “Call it Kunlun.”<br/><br/>Kunlun?<br/><br/>Qiao Xuan mulled over the name, sensing its profound mysteries.<br/><br/>He immediately left to prepare the stele.<br/><br/>By choosing the name Kunlun, Fang Wang wanted to remind himself of his past life, not the past life of Zhou Xue, but that of Earth, the cradle of the Huaxia civilization.<br/><br/>The name Kunlun quickly spread far and wide.<br/><br/>Heavenly Dao, Kunlun!<br/><br/>Beneath the blue sky, waves crashed against the shore.<br/><br/>From a cave halfway up an island, several figures emerged, one of which was the Tai Xi Celestial Maiden from Suzhen Palace, who had once met Fang Wang.<br/><br/>A total of five people, each with a rather unpleasant expression.<br/><br/>A woman in purple robes spoke, “This assessment surely doesn’t intend for anyone to pass. Each person has to defeat an opponent from the Heaven-Breaking Realm, then join forces to fight against an opponent beyond the Heaven-Breaking Realm. Where in the world can one find such powerful cultivators in the Nirvana Realm?”<br/><br/>As soon as she spoke, the other three began to complain as well.<br/><br/>“Exactly, and the Heaven-Breaking Realm opponent is not simple. It nearly exhausted all my Spiritual Power, and I didn’t get any rest before we had to jump into the second layer of the assessment.”<br/><br/>“Even the recently famous Tian Dao Fang Wang would fail, right? The strength of the Divine Passage Realm is unparalleled, not something the Nirvana Realm can contend with, much like the difference between immortals and mortals.”<br/><br/>“What a pity, I lost an important Magical Artifact, a huge loss indeed.”<br/><br/>Tai Xi pondered their words and thought of Fang Wang, feeling that he might be up to the task.<br/><br/>The four were elite disciples from major sects who came with full confidence but found their defeat difficult to accept. They could only malign the Hongxuan Emperor to soothe their bruised egos.<br/><br/>A man in white robes looked toward Tai Xi and said, “Celestial Maiden Tai Xi, let’s leave this matter be, there are plenty of other opportunities in the world.”<br/><br/>“Hmph, such a waste of my time!”<br/><br/>A man in black robes flicked his sleeves and departed, vanishing into the horizon, leaving the rest feeling somewhat awkward.<br/><br/>Tai Xi calmed herself, saluted the other three, and said, “Thank you, fellow Daoists, for lending your support. I owe you a favor for this. If you ever need my help in the future, just ask.”<br/><br/>The three did not blame her; instead, they comforted her.<br/><br/>After a while, they parted ways.<br/><br/>Tai Xi rode away on a fiery bird.<br/><br/>“Celestial Maiden, where to next?” The fiery bird spoke as if it was a young girl talking.<br/><br/>Tai Xi looked to the horizon with a deep and distant gaze, “To the Descending Dragon Continent.”<br/><br/>“Do you still wish to ask Tian Dao Fang Wang for help?”<br/><br/>“Yes, I have already failed twice in this opportunity, and I must succeed by any means necessary, or I won’t be able to live with myself.”<br/><br/>“What if Fang Wang refuses again?”<br/><br/>“We shall see when the time comes. He must have something he needs help with, especially since, as far as I know, he lacks a distinguished family background.”<br/><br/>Hearing this, the fiery bird no longer persuaded but simply spread its wings, accelerating its pace.<br/><br/>One month later.<br/><br/>They saw the coastline of the Descending Dragon Continent, and Tai Xi soared into the air, with the fiery bird transforming into a surge of flames that followed her, condensing into a fiery red hairpin that nestled in her hair.<br/><br/>Tai Xi flew toward the shore and noticed many cultivators gathered there. There were teleportation arrays erected, with a continuous stream of cultivators coming and going and carrying rocks.<br/><br/>“Hmm? The Tiangong Sect?”<br/><br/>Tai Xi quickly recognized the identity of these cultivators. Two hundred years ago, when Suzhen Palace was constructing a secret realm, it was the Tiangong Sect that was called upon. The memory was still fresh in her mind.<br/><br/>Such a large number of Tiangong Sect cultivators being deployed suggested a significant figure must be establishing a daoist site or secret realm on the Descending Dragon Continent.<br/><br/>The first person Tai Xi thought of was Fang Wang.<br/><br/>With a slight smile on her lips, she felt destiny might still favor her, as she stumbled upon such an opportunity just upon her arrival.<br/><br/>Elsewhere.<br/><br/>In Sword Heaven Marsh, Fang Wang was taking a rare break from cultivation, spending time with his grandfather, parents, and a host of clan elders by the lake, discussing the plans for Kunlun in the distance.\t\t\t\t\t\t</div>", "images": {}, "success": true}