{"id": 235, "url": "https://www.novelhall.com/i-became-an-immortal-on-mortal-realm-32879/14553258.html", "title": "Chapter 235 - Chapter 235: Chapter 232: The True Identity Of Fang Wang, Absolute Emperor", "volume": 3, "volume_title": "Volume 3", "body": "<h1>Chapter 235 - Chapter 235: Chapter 232: The True Identity Of Fang Wang, Absolute Emperor</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 235: Chapter 232: The True Identity of Fang Wang, Absolute Emperor<br/><br/>Translator: 549690339<br/><br/>The battle had persisted for an hour, and the entire Cangji Ming Sea was plunged into chaos. Countless monsters fled toward other sea regions, and the human factions, families, and tribes hidden on various islands were also fleeing.<br/><br/>The terrifying devouring power of the Town World Bead brought disaster to all the regions of the Cangji Ming Sea, with even the nearby sea waters being affected.<br/><br/>Fang Wang had already done his best to direct the Town World Bead’s devouring power downward. Otherwise, if the bead’s power were to be fully released in all directions, it would be a true catastrophe.<br/><br/>As the saying goes, when Immortals fight, mortals suffer, but Fang Wang could not care less.<br/><br/>If mortals were fighting, they wouldn’t pay attention to the ants beneath their feet either.<br/><br/>Now it all depended on when Zhu Rulai would bow his head.<br/><br/>For Zhu Rulai, conceding was actually redemption. After all, without Zhou Xue’s intervention, he would have died decades later, but the matter of his rebirth could not be discussed with others.<br/><br/>In fact, Zhu Rulai was already close to his breaking point.<br/><br/>He wasn’t worried about the myriad beings in the Cangji Ming Sea; rather, he feared that his Heaven and Earth God-Transforming Technique might collapse if the Town World Bead continued to devour as it was doing. Then he would face the danger of death and the dissolution of his path.<br/><br/>But to be defeated by Fang Wang like this, he was truly unwilling.<br/><br/>“Your real body is acting more and more slowly. If you cannot fight against it, then just submit. The Jin Xiao Sect does not wish to turn you into a laboring ox or horse. We simply value you and want to save you. You should have already sensed the calamity you will face,” said Fang Wang. His voice rose up, and not even the roar of the tempest could conceal his words.<br/><br/>Zhu Rulai paid no attention and once again manifested his true form. Only with his true form could he break through the defensive area of the Heaven Bound Golden Silk.<br/><br/>This time, he transformed into a Golden Buddha, standing eight zhang tall, holding a Buddhist staff. With a sweep of the staff, it swept across the sky, followed by countless ghostly souls, as if united in pushing the staff forward.<br/><br/>Clang!<br/><br/>Fang Wang caught the shadow of the staff with his flesh body, sounding as if a golden bell had been struck, deafening anyone who heard it.<br/><br/>Zhu Rulai completely broke down. He stopped and shouted angrily, “What exactly is your constitution?”<br/><br/>“Have you ever heard of the Heavenly Body?”<br/><br/>Fang Wang glanced sidelong at his true form and asked in a soft voice. He wasn’t in a hurry to slay Zhu Rulai. Since Zhu Rulai wanted to talk, they could talk.<br/><br/>“The Heavenly Body… ”<br/><br/>Zhu Rulai’s face changed drastically, and the Hongxuan Emperor looked at Fang Wang with a strange expression.<br/><br/>“Have you ever heard of the Vajra Invincible Saint Body?”<br/><br/>“What is that?”<br/><br/>Zhu Rulai displayed a look of confusion, while the Hongxuan Emperor jumped in fright, trembling all over.<br/><br/>Could it really be him?<br/><br/>“I have cultivated both the Heavenly Body and the Vajra Invincible Saint Body. Even without using any treasures, I can kill you with one punch. You should already feel the gap between us. Do you still want to continue the fight?” Fang Wang spoke calmly, his tone nonchalant, yet his words exuded an oppressive force.<br/><br/>Xiao Zi lifted up her dragon head, admiringly staring at her master.<br/><br/>It’s always the master who manifests his divinity!<br/><br/>Seriously domineering!<br/><br/>Zhu Rulai’s expression fluctuated between dark and light, his fists tightly clenched.<br/><br/>Fang Wang spoke again, “Being defeated by me may be hard for you to accept, but in not many years, you will take pride in having exchanged blows with me.”<br/><br/>Zhu Rulai glared at Fang Wang furiously, his eyes full of bloodshot lines, and then he burst into a laughter filled with anger.<br/><br/>“Good! Very good!”<br/><br/>Zhu Rulai’s cold voice said, and the entire ocean began to boil, which was a manifestation of his fury.<br/><br/>Bu Jian Temple, the sunlight was bright and cheerful.<br/><br/>Within a courtyard, Fang Wang, Hongxuan Emperor, Zhu Rulai, Miao Wufa were seated around a table, while Xiao Zi was conversing with the flood dragons at the edge of the island.<br/><br/>“Tsk tsk, so you chose to bow your head in a fit of rage?” Miao Wufa said to the stern-faced Zhu Rulai.<br/><br/>Half an hour had passed since the battle had ended, and Zhu Rulai appeared uninjured, but his aura was extremely unstable.<br/><br/>The Town World Bead had swallowed too much seawater, akin to sucking his blood, how could he not be affected in the slightest?<br/><br/>Zhu Rulai said calmly, “Aren’t you afraid of me dying? What, now you want me to die?”<br/><br/>Miao Wufa shook his head with a chuckle, his gaze turning to Fang Wang with a strange sparkle in his eyes, and he asked out of curiosity, “Fang Wang, are you really only a little over two hundred years old?”<br/><br/>As Hongxuan Emperor poured himself some wine, he hummed, “In my opinion, he is definitely the reincarnation of some ancient powerhouse. Even with exceptional talent, reaching the Nirvana Realm in a little over two hundred years is already unimaginable, let alone mastering so many supreme techniques to the point of transformation. It doesn’t make sense any other way. There’s only one possibility, he was born knowing these supreme techniques, hence no time was needed to cultivate them.”<br/><br/>Miao Wufa nodded in agreement, in his eyes, Fang Wang was an Immortal reincarnated, in any case, definitely not a Mortal.<br/><br/>Before meeting Fang Wang, Zhu Rulai had been the most unbelievably talented individual he had ever seen. Yet even the powerful Zhu Rulai—with the advantage of age—was no match for Fang Wang.<br/><br/>Fang Wang glanced at the Hongxuan Emperor and said, “Then tell me, which ancient powerhouse am I?”<br/><br/>“If I’m not mistaken, you are the Grand An Divine Emperor, Grand An’s last Great Emperor,” Hongxuan Emperor said with a burning gaze.<br/><br/>Fang Wang raised his eyebrows, not expecting Hongxuan Emperor to guess quite accurately.<br/><br/>The Vajra Invincible Saint Body had been learned within the Grand An Resentment Temple.<br/><br/>Seeing Fang Wang moved, Hongxuan Emperor took a deep breath, stood up, and bowed to Fang Wang, saying, “I pay my respects to my senior.”<br/><br/>Zhu Rulai and Miao Wufa exchanged glances, then stood up and saluted Fang Wang.<br/><br/>Fang Wang said irritably, “Do you really believe that? To be frank, I have indeed received the legacy of the Grand An Divine Dynasty, and the Vajra Invincible Saint Body is one of them, but I am not the Grand An Divine Emperor. The son of the Grand An Divine Emperor has not perished; be careful not to offend him.”<br/><br/>Hongxuan Emperor quickly sat down and asked, “Have you been to the Underworld?”<br/><br/>Fang Wang glanced at him and said, “I have, what about it?”<br/><br/>“I never thought that the Ghost Emperor would still be in the Underworld, back in the day…” Hongxuan Emperor began to say, when suddenly recalling Zhu Rulai and Miao Wufa’s presence, he quickly fell silent.<br/><br/>Zhu Rulai and Miao Wufa were very curious—what about back in the day?<br/><br/>This person seemed to be far from ordinary, could he also have a significant background?<br/><br/>Fang Wang laughed softly, “Back in the day, were you the renowned Hongxuan Emperor? Another Great Emperor from the Mortal Realm comparable to the Grand An Divine Emperor?”<br/><br/>“I am not the Hongxuan Emperor, and besides, how could the Hongxuan Emperor compare to the Grand An Divine Emperor?”<br/><br/>Hongxuan Emperor panicked, frantically making eye signals at Fang Wang.<br/><br/>Fang Wang ignored him and started sipping his wine.<br/><br/>Zhu Rulai and Miao Wufa felt Hongxuan Emperor’s behavior was contrived; his attempt to cover up only made them more skeptical.<br/><br/>“If you’re the Hongxuan Emperor, then I might as well be the Absolute Emperor,” Miao Wufa said irritably.<br/><br/>Upon hearing this, Hongxuan Emperor slammed the table and glared at Miao Wufa.<br/><br/>Miao Wufa’s remark was a clear suggestion that Hongxuan Emperor was inferior to the Absolute Emperor.<br/><br/>Fang Wang asked out of curiosity, “Who is the Absolute Emperor?”<br/><br/>Miao Wufa answered, “The Absolute Emperor was the last Great Emperor in the Mortal Realm. From ancient times to now, the debate over the strengths and weaknesses of the Imperial Dao and the Saint Dao has been ongoing, but the Absolute Emperor once made the Mortal Realm revere emperors over saints, with saints beneath emperors. He once captured Immortal Gods from The Upper Realm to play music and dance for his amusement, and he was never punished by the Immortal Gods of The Upper Realm. His death remains a mystery to this day.”\t\t\t\t\t\t</div>", "images": {}, "success": true}