{"id": 231, "url": "https://www.novelhall.com/i-became-an-immortal-on-mortal-realm-32879/14540953.html", "title": "Chapter 231 - Chapter 231: Chapter 228: Bu Jian Temple, Divine Buddha’S Eye", "volume": 3, "volume_title": "Volume 3", "body": "<h1>Chapter 231 - Chapter 231: Chapter 228: Bu Jian Temple, Divine Buddha’S Eye</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 231: Chapter 228: Bu Jian Temple, Divine Buddha’s Eye<br/><br/>Translator: 549690339<br/><br/>The Cangji Minghai lay to the north of the Descending Dragon Continent, separated from it by two seas, whose level of cultivation surpassed that of the Descending Dragon Continent but not quite reaching that of the Southern Celestial Sea.<br/><br/>Fang Wang rode the dragon, leaping over mountains, rivers, and lakes. The common people and cultivators along the way who saw Xiao Zi’s majestic dragon form couldn’t help but shout in amazement, and some even knelt down to worship.<br/><br/>Having just completed a closed-door cultivation of nine thousand eight hundred years, Fang Wang had not yet fully released the pressure in his heart, so he did not conceal himself, while Xiao Zi wanted to show off. The more attention it attracted, the more excited it became.<br/><br/>The Hongxuan Emperor had been observing Fang Wang the entire way, for he wished to know whether Fang Wang had been possessed.<br/><br/>Such talent, who wouldn’t be envious?<br/><br/>Unfortunately, until they left the Descending Dragon Continent, he had not detected any clues.<br/><br/>The seas to the north were much like the Arctic and Antarctic of Earth in his past life, with ice covering the surface of the sea and icebergs drifting, as far as the eye could see, a vast expanse of white.<br/><br/>Standing on the Dragon Head, Fang Wang looked down at the icy surface and could sense the boundless vitality within the ocean.<br/><br/>This place was the breeding ground for the Demon Race, rarely visited by humans. In terms of Demonic Qi alone, it was already no less potent than the Southern Celestial Sea.<br/><br/>“The True Dragon Clan emerges into the world; this is not a good omen. In the future, the Demon Race might also become powerful. I have heard that in the last five hundred years, the Demon Race has produced an extraordinary genius. In another five hundred years, the times will change; it will be an era incredibly unfair to geniuses, for there will be too many of them,” said the Hongxuan Emperor as he traveled on clouds, stroking his beard and laughing.<br/><br/>Xiao Zi asked curiously, “You speak as if you’re a Great Saint yourself. Just who are you really?”<br/><br/>Having followed Fang Wang for so many years, Xiao Zi had seen much of the world and could tell that Xiao Kuang was very different from the way he had been on Emperor’s Tomb Island.<br/><br/>It suspected that Xiao Kuang had been overtaken!<br/><br/>Full of confidence, the Hongxuan Emperor said, “To reach the status of a Great Saint, I believe it’s not impossible for me!”<br/><br/>“Oh, so does that mean the era five hundred years from now will be a nightmare for geniuses, but your era?” Xiao Zi mocked.<br/><br/>“Of course not,” the Hongxuan Emperor scoffed. “According to my observations, the coming era will see more than one Great Saint. It will be a brilliant era reminiscent of the time of the Grand An Divine Dynasty. Little demon, you may have transformed into a dragon, but you are still far from reaching the realm of a Great Saint. Cultivate well, and don’t waste the opportunity Fang Wang has given you.”<br/><br/>When one ascends to the heavens, even their pets and poultry ascend with them.<br/><br/>As long as Fang Wang did not die, Xiao Zi would surely rise above all living beings. The Hongxuan Emperor even believed that Fang Wang could nurture several Great Saints.<br/><br/>In most eras, there was only one Great Saint in the Mortal Realm, but this was not an absolute rule.<br/><br/>If the strongest person in the Mortal Realm far exceeded the Great Saint, then several Great Saints could emerge in the Mortal Realm!<br/><br/>Xiao Zi wanted to retort, but it felt that the other’s words were not meant to be scornful, so it changed the subject, “In your opinion, does Zhu Rulai have the potential to be a Great Saint?”<br/><br/>The Hongxuan Emperor laughed. “If the information from the Jin Xiao Sect is accurate, his talent indeed holds promise for becoming a Great Saint. But throughout history, becoming a Great Saint doesn’t only depend on one’s talent. Many Great Saints weren’t the strongest talents of their times.”<br/><br/>When he spoke these words, his gaze turned towards Fang Wang.<br/><br/>Fang Wang certainly surprised him, but such strength was far from sufficient to claim supremacy in the Mortal Realm. He always felt that geniuses as formidable as Fang Wang tended to have short lives.<br/><br/>Otherwise, Fang Wang would not have met him nine times.<br/><br/>Although this Fang Wang was far more talented than the previous eight incarnations, who could say for certain what the future held?<br/><br/>Fang Wang remained silent throughout, the brim of his bamboo hat covering his eyes, making him appear mysterious and dangerous.<br/><br/>Along the way, Xiao Zi and the Hongxuan Emperor chatted incessantly, making the journey less tedious.<br/><br/>Fang Wang did not speak, but listened to their conversation all along.<br/><br/>The Hongxuan Emperor spoke of ancient legends from the past, which both Fang Wang and Xiao Zi found very interesting.<br/><br/>In a sea area of the vast and silent Ming Sea, the skies were filled with dark clouds and a continuous drizzle fell. The water was dark, oppressive and horrifying.<br/><br/>Huge black flood dragons churned on the sea surface, resembling giant arches overlapping one another, creating a dazzling and confusing sight.<br/><br/>Deep within the dragon swarm, a solitary island stood amidst the raging waves. The rain on the island was torrential, as if trying to shatter the isolated land.<br/><br/>On the island there was a temple, and above its gate hung a signboard with three large characters.<br/><br/>Bu Jian Temple.<br/><br/>All courtyards within the temple grounds were deserted, and the rainwater striking the ground stirred up muck and muddy puddles.<br/><br/>In the central hall, candlelight flickered, casting long shadows across the hall.<br/><br/>Inside, a monk sat in meditation, reciting scriptures while rhythmically striking a wooden fish. The sound of his voice was masked by the rain, and his robust body made the black kasaya he wore barely contain him.<br/><br/>At that moment, a figure approached from the rainy night outdoors. It was a scholar carrying a paper umbrella – Miao Wufa from the Jin Xiao Sect.<br/><br/>Miao Wufa entered the hall, folded his umbrella, and leaned it next to the door. He took off the bookcase from his back, wiped the rainwater from his body, and smiled, “Zhu Rulai, such a heavy rain indicates that your mind is in turmoil. Since you dread the pressure from the Buddhist Sect, why not join the Jin Xiao Sect with me?”<br/><br/>The monk was none other than Zhu Rulai!<br/><br/>Zhu Rulai paid no attention to Miao Wufa.<br/><br/>Miao Wufa continued, “I heard the Demon Lord sent two Great Cultivators to capture you, one of whom is Tian Dao Fang Wang. You must have heard of his exploits. Over the years, his reputation has terrified both continents and oceans. If you encounter him, you are likely to lose.”<br/><br/>Zhu Rulai’s left hand, which held the wooden fish, stopped. He spoke softly, “Although Fang Wang is strong, he is but a junior. It is impossible for someone younger than me to surpass me. Surely you’re not comparing me to that Heaven’s Larceny Saint Sect, are you?”<br/><br/>Miao Wufa shook his head, “He’s really not simple. I advise you to be careful, you cannot afford to be careless.”<br/><br/>Zhu Rulai slowly stood up.<br/><br/>In an instant, the torrential rain outside the hall ceased, and even the raindrops could be seen suspended in mid-air.<br/><br/>“In the vast and silent Ming Sea, no one can defeat me, not Fang Wang, not the Buddhist Sect. You should leave; I don’t want to involve you,” Zhu Rulai said, looking at the Buddha statue before him.<br/><br/>This Buddha statue stood on one leg, with an arm reaching toward the sky in a posture of swinging, showing a powerful sense of aesthetic strength, yet it had no face.<br/><br/>Miao Wufa shrugged, “That won’t do. If you’re in mortal danger, I can still save your life.”<br/><br/>“You have saved me many times.”<br/><br/>“Saving you a hundred thousand times couldn’t compare to the one time you saved me.”<br/><br/>Zhu Rulai turned around, looked at him, and as his eyes opened, they revealed golden irises, conferring upon him a divine and majestic presence.<br/><br/>Miao Wufa averted his gaze, dissatisfied, “Don’t look at me with those divine Buddha eyes of yours; I always feel like you have ulterior motives.”<br/><br/>Zhu Rulai took a step forward, brushed past him, and walked straight out the door.<br/><br/>“Come on, I know you’re here not just to save me, but also to gather intelligence for the Jin Xiao Sect. Tonight, I’ll let you see my greatest trump card. Take it back to the Demon Monarch; I want to see if she has the courage to come in person.”<br/><br/>Zhu Rulai did not look back as he spoke. Miao Wufa quickly shouldered his bookcase and followed, picking up his paper umbrella as he crossed the threshold.<br/><br/>“I’m afraid Fang Wang will arrive before I can take it back to the Jin Xiao Sect.”<br/><br/>“No matter, for your sake, I will spare his life. When the time comes, I’ll let the Demon Monarch come personally to redeem him.”\t\t\t\t\t\t</div>", "images": {}, "success": true}