{"id": 232, "url": "https://www.novelhall.com/i-became-an-immortal-on-mortal-realm-32879/14540958.html", "title": "Chapter 232 - Chapter 232: Chapter 229: Achievement, Extremely Evil Old Immortal_1", "volume": 3, "volume_title": "Volume 3", "body": "<h1>Chapter 232 - Chapter 232: Chapter 229: Achievement, Extremely Evil Old Immortal_1</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 232: Chapter 229: Achievement, Extremely Evil Old Immortal_1<br/><br/>Translator: 549690339<br/><br/>Beneath the azure sky, a Purple Dragon weaved through the sea of clouds, its Purple Dragon Scales shimmering with a crystal-like cold light under the sunlight.<br/><br/>Fang Wang sat upon the Dragon Head, eyes closed, and even without driving his Cultivation Technique, filaments of Spiritual Energy coiled around his body like fluttering white silk.<br/><br/>“We should arrive at the Cang Ji Ming Sea in four days. Our speed isn’t fast, so Jin Xiao Sect must have passed on the message to Zhu Rulai already,” said the Hongxuan Emperor, his gaze fixed on the distance, his eyes brimming with anticipation.<br/><br/>Xiao Zi turned its head, curiously asking, “What do you mean? Is Jin Xiao Sect tipping off Zhu Rulai?”<br/><br/>Unable to suppress a chuckle, the Hongxuan Emperor replied, “We are going to subdue Zhu Rulai, not kill him, so of course we should offer courtesy before using force.”<br/><br/>All of a sudden, Fang Wang spoke, “Zhu Rulai is indeed extraordinary; his destiny pervades the entire Cang Ji Ming Sea.”<br/><br/>Upon hearing this, the Hongxuan Emperor sharply turned his head, giving Fang Wang an odd look.<br/><br/>“The entire Cang Ji Ming Sea? Could it mean that the Cang Ji Ming Sea isn’t as vast as the Southern Celestial Sea?” Xiao Zi’s tone was filled with confusion.<br/><br/>Fang Wang did not answer; he silently practiced his technique.<br/><br/>Taking a deep breath, the Hongxuan Emperor said with a hint of awe, “To be able to spy into destiny from the Nirvana Realm, just how advanced is your cultivation, Fang Wang?”<br/><br/>He was once again astonished by Fang Wang.<br/><br/>Considering how far they were from the Cang Ji Ming Sea, Fang Wang’s ability to sense Zhu Rulai’s destiny and see through his methods was beyond the definition of a genius.<br/><br/>He began to seriously suspect that, like himself, Fang Wang’s body was possessed by an ancient Great Cultivator.<br/><br/>It was impossible to be so acutely aware of destiny with just two hundred years of cultivation!<br/><br/>He had already discovered Zhu Rulai’s destiny covering the Cang Ji Ming Sea, and feared a fierce battle was imminent, even feeling that Fang Wang might be at a disadvantage.<br/><br/>Now it seemed he was going to be disappointed.<br/><br/>Tsk tsk, was there really no one in this world who could give Fang Wang a hard time?<br/><br/>The Hongxuan Emperor was filled with emotion; though the Descending Dragon Great Saint had brought a catastrophe to the Descending Dragon Continent and surrounding seas, he had also provided Fang Wang with the best environment for growth.<br/><br/>Those supreme beings of the human world had no reason to cross half the world to kill a prodigy.<br/><br/>Fang Wang was unaware of the Hongxuan Emperor’s thoughts, having already started practicing the Formless Zhou Tian Technique.<br/><br/>He could feel Zhu Rulai was not simple; anticipating the upcoming battle would require his full strength, he feared drawing the attention of supreme beings. Therefore, he began mastering the Formless Zhou Tian Technique in advance to avoid future detection.<br/><br/>The mental method of the Formless Zhou Tian Technique was incredibly complex, and even Fang Wang, who had reached Great Perfection, had to follow its rules.<br/><br/>This technique was more like a physical constitution; as long as the transformation was complete, he could maintain its powerful effects.<br/><br/>And so, time ticked away, second by second.<br/><br/>Xiao Zi casually chatted with the Hongxuan Emperor.<br/><br/>About two hours passed.<br/><br/>Boom<br/><br/>The previously cloudless sky suddenly gathered thunderclouds, rumbling thunder startling the Hongxuan Emperor, while Xiao Zi thought Zhu Rulai might have come to attack early.<br/><br/>They had not felt anything unusual with Fang Wang; the Formless Zhou Tian Technique, being a secretive Divine Skill, would not reveal itself upon mastery, right?<br/><br/>Only the mysterious workings of fate could detect him, and so the force of Heavenly Might arrived, as if to warn him.<br/><br/>Fang Wang remained indifferent, continuing to practice his technique.<br/><br/>The Hongxuan Emperor glanced at Fang Wang but did not perceive any connection between him and the phenomenon, and thus, he turned his gaze away.<br/><br/>If Fang Wang was so composed, how could he, a Great Emperor, show weakness?<br/><br/>Two hours later, Fang Wang successfully completed the circulation of the Formless Zhou Tian Technique, bringing himself into the Great Perfection Realm of the technique.<br/><br/>The thunderclouds above dissipated along with the vast Heavenly Might in an instant, surprising both the Hongxuan Emperor and Xiao Zi.<br/><br/>The Hongxuan Emperor instinctively looked towards Fang Wang, intending to discuss the event, but in the next second, his eyes widened.<br/><br/>Carefully observing Fang Wang, who showed no change, he shockingly realized he could not sense Fang Wang’s presence.<br/><br/>He instinctively closed his eyes and probed with his divine sense, encountering something even more horrifying.<br/><br/>He could detect every existence between heaven and earth with his divine sense, except for Fang Wang.<br/><br/>Even though Fang Wang was right before his eyes, when he used only his divine sense to locate him, he couldn’t detect Fang Wang at all.<br/><br/>How could this be!<br/><br/>The Hongxuan Emperor opened his eyes wide, scrutinizing Fang Wang, the wariness in his gaze growing ever stronger.<br/><br/>“It has finally dispersed; not sure if it was Zhu Rulai who brought about the disturbance,” Xiao Zi remarked.<br/><br/>Glanzing at the Hongxuan Emperor, it noticed he was looking at Fang Wang with a complex expression.<br/><br/>Its dragon eyes brightened—could it be that the Heavenly Might just now had been brought by their young master?<br/><br/>Fang Wang had yet to open his eyes, and he certainly wasn’t going to admit to it.<br/><br/>After mastering the Formless Zhou Tian Technique, others wishing to trace him in the future could only use mundane methods, such as gathering intelligence, and could no longer trace him using their own inference, divine sense, Spells, or Divine Skills.<br/><br/>Refreshing!<br/><br/>Though Fang Wang’s strength had not increased, the moment he mastered the Formless Zhou Tian Technique, his sense of security skyrocketed, as if he had finally shaken off the shackles that bound him.<br/><br/>Seeing Fang Wang’s composure, the Hongxuan Emperor could only suppress the shock in his heart.<br/><br/>The journey that followed fell into silence. The usually talkative Hongxuan Emperor became as reticent as a gourd, and Xiao Zi, sensing that something was amiss, dared not make any rash moves. It feared that saying the wrong thing would cause trouble for its young master.<br/><br/>Above the ground, thick smoke billowed, and a sky-covering cloud of ash cast the world into darkness.<br/><br/>Lava spread between the mountains, devoid of any greenery. Looking around, one could even see many skeletons, like a human purgatory.<br/><br/>On the middle of a volcano, there was a pool over a hundred zhang in diameter. The lava boiled within, bubbling with bubbles of varying sizes, and many skulls bobbed up and down. Among them, one human head had not yet completely turned into a skeleton.<br/><br/>That face, astonishingly, was Fang Zigeng’s.<br/><br/>Fang Zigeng’s white hair had been burned away, his skull covered in scars, creating a terrifying spectacle.<br/><br/>Beside the lava pool, a tattered old man sat on the ground. In front of him was a small tripod with herbs steaming inside.<br/><br/>The old man had dark skin and hands rough as tree bark. His long eyebrows concealed his eyes, and the firelight cast his shadow long and menacing, like a demon baring its fangs and claws.<br/><br/>At that moment…<br/><br/>Fang Zigeng’s brows furrowed, and he showed an expression of pain.<br/><br/>“Eh? You actually survived,” the old man said, raising his eyes in surprise, with a hint of trepidation in his tone.<br/><br/>After a few breaths…<br/><br/>Fang Zigeng suddenly opened his eyes, taking deep breaths, his eyes bloodshot.<br/><br/>Glancing at the old man, murderous intent burst forth in his gaze as he shouted angrily, “Old devil! May you not die a good death!”<br/><br/>The old man laughed, replying, “Whether I die a good death is uncertain to me, but I know for sure that you are living a fate worse than death.”<br/><br/>At these words, Fang Zigeng became agitated. He seemed to feel a trembling in his head and instinctively looked downward. His pupils dilated with despair flooding his eyes.<br/><br/>Beneath the lava, only a skeleton remained of his flesh below the neck; no wonder he had felt no sensation.<br/><br/>He had never suffered such a fate before and truly felt death closing in. The unknown destiny ahead terrified him, and thinking of his wife, his heart plunged into despair.<br/><br/>Seeing his look, the old man showed a triumphant smile and said, “You guessed right, those people are dead, right beside you, yet you’re the only survivor.”<br/><br/>Fang Zigeng looked up at him, eyes filled with hatred, and asked through gritted teeth, “Why did you…”<br/><br/>On hearing this, the old man said contemptuously, “Why should I explain my actions? If there’s anyone to blame, blame the Supreme Sect for not recognizing what’s above them. Daring to snatch the dragon bones I wanted—destroying your sect is letting you off lightly. If it were back in my younger days, I would’ve tormented you for years before killing you.”<br/><br/>Fang Zigeng closed his eyes in pain.<br/><br/>“Boy, if you survive this, I’ll take you as my disciple. You can even seek revenge against me in the future. Dying at the hands of my own disciple wouldn’t be a wasted life for me, after all, I killed my own master,” the old man said, his tone turning wistful as he spoke.<br/><br/>Hearing the possibility of revenge made Fang Zigeng open his eyes again.<br/><br/>He asked through clenched teeth, “I’ve been reduced to this ghostly state. Can I really be brought back to life?”<br/><br/>The old man chuckled while stroking his beard, “Why not? Regenerating flesh and blood is not difficult. Boy, you may hate me now, but you’ll be grateful to me in the future. I won’t just change your fate; I’ll cut off all your ties. Without any burdens, no one in this world will be able to deal with you.”<br/><br/>Fang Zigeng fell silent.<br/><br/>The old man looked at him and marveled, “I see, it’s an ancient demonic soul that has protected you. Such luck indicates you have great destiny. Just right, after surviving this ordeal, the ancient demonic soul will merge with your soul. Combined with my inheritance, dominating the world and vying for the position of Great Saint is not impossible.”<br/><br/>Fang Zigeng felt heavy-hearted, but he knew hate was useless. He needed to become stronger to avenge his wife and the Supreme Sect.<br/><br/>He did not bring up the Fang Family or Fang Wang, as this old demon undeniably possessed the most dreadful power he had ever witnessed. He didn’t want to cause trouble for his family.<br/><br/>Besides, his vendetta must be settled by him alone!<br/><br/>Fang Zigeng’s expression gradually became calm, and he asked, “If you’re taking me as your disciple, why don’t you tell me your name?”<br/><br/>The old man smiled proudly, “I have many names. Since you want vengeance against me, remember the name that’s most reviled. Remember, I am known as the Extremely Evil Old Immortal.”<br/><br/>The Extremely Evil Old Immortal…<br/><br/>Fang Zigeng had never heard of this name, but it mattered little to him.<br/><br/>He resolved that no matter how painful or tough the road ahead, he would survive!<br/><br/>At that moment, the Extremely Evil Old Immortal calculated with his fingertips, his brows furrowing. He stood up and leaped into the air, reaching out towards the volcano where Fang Zigeng was.<br/><br/>Instantly, the mountain trembled, and the volcano, over three hundred zhang tall, rose from the earth.<br/><br/>Fang Zigeng looked up in disbelief.<br/><br/>In his eyes, the Extremely Evil Old Immortal rapidly grew in size, as if becoming taller than the heavens.<br/><br/>The Extremely Evil Old Immortal lifted his hand, and the entire volcano shrank into his palm—not because he got bigger but because the volcano got smaller. It nestled in his palm, the mountain range spanning miles shrinking into his grip. Fang Zigeng became smaller than a grain of sand by comparison.<br/><br/>“How odd indeed, the Supreme Sect has somehow drawn such prophetic pursuit. I wonder which old, undying being is involved,” the Extremely Evil Old Immortal muttered, his voice resonating like thunder in Fang Zigeng’s ears.\t\t\t\t\t\t</div>", "images": {}, "success": true}