{"id": 230, "url": "https://www.novelhall.com/i-became-an-immortal-on-mortal-realm-32879/14539246.html", "title": "Chapter 230 - Chapter 230: Chapter 227 Great Perfection Of The Formless Zhou Tian Technique", "volume": 3, "volume_title": "Volume 3", "body": "<h1>Chapter 230 - Chapter 230: Chapter 227 Great Perfection Of The Formless Zhou Tian Technique</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 230: Chapter 227 Great Perfection of the Formless Zhou Tian Technique<br/><br/>Translator: 549690339<br/><br/>“Hmm, Zhu Rulai is indeed the target of the Jin Xiao Sect. It was I who recommended the Demon Monarch to order his capture, alive—don’t kill him.”<br/><br/>Within the Illusionary Realm, Zhou Xue stood before Fang Wang and said so.<br/><br/>She scrutinized Fang Wang, her gaze settling on his chest.<br/><br/>Fang Wang, curious, asked, “Why does the Jin Xiao Sect want to subdue him?”<br/><br/>Zhou Xue replied without shifting her eyes, “Zhu Rulai—he did not ascend in his previous life, nor did he become a Great Saint. It wasn’t because his talent was lacking, but because he died on his path of growth. Considering the time, in another thirty years, he will be strangled. The Buddhist Sect will rally against him—both out of vengeance for his betrayal and because he subdued the Dragon King of the True Dragon Clan. The Buddhist Sect is a stumbling block for the Jin Xiao Sect. Subduing Zhu Rulai will help us better deal with the Buddhist Sect.”<br/><br/>The Buddhist Sect!<br/><br/>In Grand Qi, Buddha Cultivators were rare, but not so at sea. Moreover, the reputation of the Buddhist Sect was widespread. Fang Wang had heard Qu Xunhun recount many legends about the Buddhist Sect.<br/><br/>The Buddhist Sect was mysterious and powerful; even Qu Xunhun had only come into contact with limited information.<br/><br/>“Zhu Rulai is not simple. If you hadn’t made such a breakthrough over these years, I wouldn’t have set this matter in motion so soon,” Zhou Xue continued.<br/><br/>Hearing this, Fang Wang felt gratified, and followed up with a question, “Who is the strongest in the Jin Xiao Sect? Is it the Hongxuan Emperor?”<br/><br/>Zhou Xue offhandedly said, “Of course not. He is a Great Saint reincarnated, and I can’t fully trust him. I’ve concealed another powerful figure specifically to check him, but that person is mad and erratic. I’ve left him in a secret realm to cultivate his mind.”<br/><br/>Fang Wang couldn’t help but express his amazement, “How did you manage that? To get so many powerful individuals to yield.”<br/><br/>Zhou Xue appeared somewhat proud as she replied, “Even the most powerful cultivators have regrets, and talents destined to die young are all the easier to gather. I only need to offer them what they most desire in order to make them serve me.”<br/><br/>“What does the Hongxuan Emperor want?”<br/><br/>“He wants revenge.”<br/><br/>“Did you reveal to him your rebirth?”<br/><br/>“Of course not. I merely said that I had received a prophetic dream from The Upper Realm. Isn’t that what you taught me? To concoct an imaginary mentor. I really have been to The Upper Realm, and simply by speaking of matters there, I can make him believe me.”<br/><br/>Fang Wang immediately felt reassured.<br/><br/>In his view, the matter of rebirth must not be disclosed to a third party—it was far too dangerous.<br/><br/>Just like his Heavenly Palace, he hadn’t even mentioned it to Zhou Xue.<br/><br/>Zhou Xue’s eyes grew increasingly bright. She asked softly, “Your Cultivation Technique has improved again, and your heart is no longer a mortal one. Remarkable.”<br/><br/>Without hesitation, Fang Wang shared his insights and experience concerning the Heart of the Heavenly Dao.<br/><br/>To let the physical body live as long as the heavens and the earth, achieving immortality, and then to look forward to an even higher stage.<br/><br/>At that time, he would have to find something that would endure longer than the heavens and the earth.<br/><br/>Zhou Xue listened intently, the admiration in her eyes growing ever more intense. Gradually, she even showed a hint of reverence.<br/><br/>In her past life, she was an Immortal Venerable in The Upper Realm; though not among the top echelon, she was far beyond the reach of anyone in the Mortal Realm. Fang Wang’s idea was not unheard of in The Upper Realm, yet Fang Wang had never been there.<br/><br/>After Fang Wang finished speaking, Zhou Xue praised him, “To have such insights without having ascended, you are on the right path.”<br/><br/>“Since you now possess a sacred heart, I have a technique that I should also pass onto you.”<br/><br/>As she said this, she took two steps back, looked at Fang Wang, and mused, “I didn’t expect this day to come so quickly. You’re just over two hundred years old, and you give me hope.”<br/><br/>“Hope for revenge?”<br/><br/>“No, hope for overthrowing The Upper Realm.”<br/><br/>At her words, Fang Wang’s gaze shifted slightly, not expecting Zhou Xue’s ambition to be so vast.<br/><br/>But that was good!<br/><br/>He feared Zhou Xue would cower before The Upper Realm’s power.<br/><br/>After all, the more you know, the more you fear.<br/><br/>Just like the Descending Dragon Great Saint, Fang Wang once believed that his struggle against the Immortal Gods of The Upper Realm was awe-inspiring, even imagining the Descending Dragon Great Saint standing alone against a sky full of Immortal Gods. But in fact, the Descending Dragon Great Saint was suppressed by a single palm from an Immortal God.<br/><br/>“What Cultivation Technique will you pass onto me?” Fang Wang asked expectantly.<br/><br/>Zhou Xue’s lips curved upwards as she said, “The Formless Zhou Tian Technique. This is an ultimate teaching from The Upper Realm, an absolute Immortal Law. Once mastered, no one, including those from The Upper Realm, can scrutinize you. Attaining Great Completion, you can even avoid the heavenly calculations. No divine being will be able to deduce your actions, and your cultivation cannot be devoured by others, no other being can possess your body. Besides, it has many other profound secrets.”<br/><br/>“Its creator was an ancient divine being from The Upper Realm. He once descended to the Mortal Realm to gain experience and left behind a fragmentary script, known as the Zhou Tian Daoist Skill.”<br/><br/>Upon hearing this, Fang Wang immediately became interested, “Then I want to learn it. I want to grow quietly in the Mortal Realm and then surpass all beings in The Upper Realm.”<br/><br/>Zhou Xue gathered her skirts and sat down cross-legged. Fang Wang followed suit and began meditating.<br/><br/>She commenced imparting the Formless Zhou Tian Technique to Fang Wang, who listened intently.<br/><br/>He realized that Zhou Xue’s transmission of the technique this time was completely different from before. Her voice radiated a mysterious charm, and by simply listening to her voice, he gained many insights, to the point that he didn’t even clearly hear what Zhou Xue was saying.<br/><br/>He gradually closed his eyes, and ethereal figures began to rise from within Fang Wang’s body—then drifted away, one after another, all bearing his form.<br/><br/>Zhou Xue continued the transmission, keeping her gaze fixed on him, her eyes filled with anticipation.<br/><br/>Time flowed swiftly.<br/><br/>After a full five hours, Zhou Xue finally concluded the transmission.<br/><br/>She sealed her lips and quietly stared at Fang Wang.<br/><br/>Fang Wang kept his eyes closed, his brow furrowed deeply.<br/><br/>“The Formless Zhou Tian Technique is considered a Divine Skill. If cultivated successfully, one is qualified for unrestrained freedom. When I obtained it in my past life, my fate was already bound to an Immortal sect. I’ve always wanted to use this technique to break free from those restraints, but sadly, before it could reach Great Completion, I met my death.”<br/><br/>Zhou Xue spoke of her past life, sighing endlessly.<br/><br/>“Don’t feel too pressured, after all, you are still a long way from entering the Celestial Qiankun Realm. With your talent, it is not impossible for you to master this technique before reaching that realm,” she said.<br/><br/>No sooner had her words fallen than Fang Wang’s furrowed brow relaxed, followed by a slow opening of his eyes.<br/><br/>Fang Wang’s gaze met Zhou Xue’s, and in that instant, she could sense the change in him.<br/><br/>This wasn’t the first time!<br/><br/>Similar occurrences had happened when Fang Wang received her legacy in the past.<br/><br/>Zhou Xue couldn’t help asking, “How do you feel?”<br/><br/>Fang Wang took a deep breath and said, “Profound and magnificent!”<br/><br/>Upon hearing this, Zhou Xue also breathed a sigh of relief.<br/><br/>She had been genuinely startled just now, thinking that Fang Wang might have mastered the Formless Zhou Tian Technique within just a few hours.<br/><br/>“Let’s leave it at that for now, I need to think this over,” said Fang Wang as he stood up, his face expressionless.<br/><br/>Zhou Xue also stood up and reminded him, “If you feel you can’t defeat Zhu Rulai, or if there are unforeseen changes, you can give up on this matter.”<br/><br/>Fang Wang nodded and then left the Illusionary Realm.<br/><br/>Realizing he was back in reality, Fang Wang opened his eyes to find that Sword Heaven Marsh had entered the night. Since all surrounding mountains had been devoured by the Town World Bead, there was nothing to obstruct the view, and the sky was filled with stars, as if one could pluck the stars and capture the moon with an outstretched hand.<br/><br/>Fang Wang’s gaze was numb, the starlight unable to be reflected in his eyes.<br/><br/>Damn!<br/><br/>Fang Wang wanted to roar in frustration, but he restrained himself.<br/><br/>The Formless Zhou Tian Technique had taken him nine thousand eight hundred years!<br/><br/>Nine thousand eight hundred years! He had never gone through such a long period of seclusion!<br/><br/>He had just managed to control his emotions in front of Zhou Xue, afraid that she would notice something amiss.<br/><br/>Such a Divine Skill, had he mastered it in an instant, he worried it would bring unnecessary trouble, so he had also held back from Zhou Xue.<br/><br/>Formless Zhou Tian Technique, Great Perfection!<br/><br/>Now, those untouchable elements of fate, cause and effect, and destiny became sensitive to Fang Wang; these ethereal things actually existed in a way beyond the understanding of other beings.<br/><br/>Like now, as he looked at the cultivators of Sword Heaven Marsh, he saw countless threads of cause and effect, threads of fate interweaving together, complex and dizzying to behold.<br/><br/>The Formless Zhou Tian Technique could only help him avoid detection, calculation, and the probing of fate. Fate, cause and effect, and destiny were areas he could not yet touch.<br/><br/>Being able to glimpse their existence was enough to satisfy Fang Wang.<br/><br/>Beyond avoiding deduction, the Formless Zhou Tian Technique also possessed combat Divine Skills that could transfer all soul-based spells and Divine Skills back to the attacker!<br/><br/>That’s quite domineering!<br/><br/>The higher one’s realm, the more one relies on soul-based spells because, within the same realm, it is difficult to defeat an opponent with just spells and Spiritual Power.<br/><br/>Fang Wang tried not to think about the Formless Zhou Tian Technique. He even refrained from activating it, planning to use it after some time.<br/><br/>Once he activated the Formless Zhou Tian Technique even once, his cause and effect, fate, and destiny would disappear from the view of the Heavenly Dao, undetectable to anyone.<br/><br/>It is worth mentioning that the Formless Zhou Tian Technique shares similarities with the Jiuyou Zizaishu. It was on the foundation of the Great Perfection Jiuyou Zizaishu that Fang Wang was able to cultivate the Formless Zhou Tian Technique within ten thousand years. Without it, he couldn’t imagine how long he would have to remain in the Heavenly Palace.<br/><br/>From now on, he would have to be more cautious around Zhou Xue. What she is currently passing on are Immortal Laws, which could easily land him in trouble!<br/><br/>As the moon fell and the sun rose, the Sword Servants of Sword Heaven Marsh continued planting flowers and herbs, improving the desolate surroundings.<br/><br/>At noon, Fang Wang bid farewell to Song Jinyuan, Dugu Wenhun, and others. He would accompany the Hongxuan Emperor to the Cang Desolate Ghost Sea, naturally bringing Xiao Zi along.<br/><br/>Once everyone knew he would return within a year at most, they did not insist on joining him.<br/><br/>Xiao Zi manifested her true form, traversing the skies as a True Dragon. Fang Wang stood atop the Dragon Head, dressed in black clothes and a bamboo hat, slightly bowing his head, leaving only his fair jaw visible to others.<br/><br/>The Hongxuan Emperor flew alongside, casting an envious glance at him.<br/><br/>He too wanted to ride a dragon, but Xiao Zi refused him. Out of respect for Fang Wang, he backed down.<br/><br/>“Hey, Fang lad, what happened to you last night? You seem a bit off,” the Hongxuan Emperor couldn’t help asking, taken aback at the first sight of Fang Wang that day.<br/><br/>Fang Wang was emanating an indescribable aura of dusk and death, appearing very gloomy, which made even him feel a chill.<br/><br/>In his memory, Fang Wang had always shown a sunny, cheerful, and easygoing temperament. He even wondered if Fang Wang had been possessed last night.<br/><br/>Fang Wang didn’t look up, calmly replying, “I probably just didn’t sleep well.”<br/><br/>“Didn’t sleep well? Does someone in the Nirvana Realm still need to sleep?” the Hongxuan Emperor didn’t believe it.<br/><br/>Xiao Zi glared at him and said, “What do you know? My master likes to cultivate and deduce Cultivation Techniques in dreams. How could a mortal guess the ways of an Immortal?”<br/><br/>The Hongxuan Emperor chuckled. He really wanted to ask, do you even know what I am?<br/><br/>But he refrained!\t\t\t\t\t\t</div>", "images": {}, "success": true}