{"id": 234, "url": "https://www.novelhall.com/i-became-an-immortal-on-mortal-realm-32879/14551588.html", "title": "Chapter 234 - Chapter 234: Chapter 231 Heaven And Earth God-Transforming Technique", "volume": 3, "volume_title": "Volume 3", "body": "<h1>Chapter 234 - Chapter 234: Chapter 231 Heaven And Earth God-Transforming Technique</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 234: Chapter 231 Heaven and Earth God-Transforming Technique<br/><br/>Translator: 549690339<br/><br/>Along with the Town World Bead unleashing its terrifying devouring force, both the sky and the sea trembled.<br/><br/>Mighty waves were drawn into the Town World Bead and vanished, and the Town World Bead did not continue to grow; its devouring speed was incredibly exaggerated, and a small island in the distance was even swept up by the fierce winds and flew towards it.<br/><br/>Xiao Zi kept retreating, activating all its Spiritual Power, barely offsetting the fearsome suction force of the Town World Bead.<br/><br/>The Hongxuan Emperor stood motionless in the air, his gaze fixed intently on the Town World Bead.<br/><br/>Fang Wang stood atop the Town World Bead, his robes rustling in the wind, his gaze fixed on the distance, from his vantage point he could see the sea’s surface sinking at a visible rate, while the base of the Town World Bead was frenziedly devouring the seawater, forming a magnificent sea curtain.<br/><br/>“It’s coming.”<br/><br/>The Hongxuan Emperor lifted his eyes and then uttered two words.<br/><br/>A vast oppressive force descended, startling Xiao Zi to look up, only to see a golden star twinkling at the zenith of the sky, growing rapidly larger, accompanied by a pressure so terrifying that even Xiao Zi, who was comparable to the Mahayana Realm, felt a sense of dread.<br/><br/>Boom<br/><br/>A huge Buddha Bead radiating endless golden light fell from the sky, larger than the Town World Bead, falling all the way down, its surface blazing with Qi flames, unstoppable in momentum.<br/><br/>Standing high above on the golden Buddha Bead was the figure of Zhu Rulai, looking down at Fang Wang from a lofty height, his eyes extremely cold and indifferent, as if looking at a mere insect.<br/><br/>Before the golden Buddha Bead could collide with the Town World Bead, the horrifying pressure already made the sea’s surface sink, and waves over a thousand feet high rose in the distance, an awe-inspiring spectacle.<br/><br/>In an instant, Fang Wang clenched his fist once more, his body twisting to the side, his physique like a drawn great bow, his right fist striking out from his waist.<br/><br/>With this punch, all beings in the vast silent sea could feel that aura of destruction!<br/><br/>Whin<br/><br/>The dragon’s cry exploded, shaking the heavens and the earth!<br/><br/>An imposing and ferocious Black Dragon followed Fang Wang’s right fist, soaring upwards, striking the golden Buddha Bead with a speed that Xiao Zi and the Hongxuan Emperor could hardly follow with their eyes.<br/><br/>Zhu Rulai’s pupils suddenly constricted, facing such a domineering secret technique for the first time, feeling as if he was contending with Divine Skills.<br/><br/>Accompanied by a terrifyingly loud noise, the giant golden Buddha Bead was directly shattered by the Black Dragon, and Zhu Rulai dodged instinctively.<br/><br/>In just a moment, the Black Dragon directly penetrated the Firmament, a terrifying black hole appearing above the sky, its diameter indiscernible.<br/><br/>The Hongxuan Emperor was visibly shaken, having heard of the might of the Nine Dragons Tyrant Fist before but never taking it seriously, thinking it could not compare to his own Heavenly Emperor’s Imperial Mirror.<br/><br/>But now, upon witnessing it, it was truly frightening!<br/><br/>How could it feel like Fang Wang held back when he used this move in the Illusionary Realm during the assessment?<br/><br/>This was not a qualitative change that could simply come from an increase in cultivation level.<br/><br/>The destructive power contained in Fang Wang’s punch made the Hongxuan Emperor think of a certain ancient powerful being.<br/><br/>When the dragon’s cry ceased, the shocking waves continued unabated on the sea, growing more intense, while the Town World Bead devoured the ocean like a gluttonous beast.<br/><br/>Fang Wang retracted his fist, a smile appearing on his face, and he asked aloud, “If this is the extent of your strength, why not join the Jin Xiao Sect? The Jin Xiao Sect will bring you greater opportunities and help you fend off enemies you cannot defeat.”<br/><br/>As his voice fell, tumultuous figures surged out of the churning sea, assembled from the seawater, all of them in the likeness of Zhu Rulai.<br/><br/>Sea water avatars!<br/><br/>Fang Wang swept his gaze over them, it was impossible to count how many sea water avatars there were, not just in this sea area, but the entire surface of the silent sea was spawning such sea water avatars.<br/><br/>As Fang Wang probed with his divine sense, he could not tell which was the true body.<br/><br/>“This is the Heaven and Earth God-Transforming Technique. As long as one merges their Fate with a stretch of heaven and earth, it makes that expanse of heaven and earth part of themselves. This is not my creation; I was once obsessed with it when I obtained it but, regrettably, it led to the downfall of my own domain. You need to be cautious, once the Heaven and Earth God-Transforming Technique reaches Great Completion, one can dominate invincibly within their realm. As for its drawbacks, I’ll tell you all about them after you defeat it,” said the Hongxuan Emperor’s voice, entering Fang Wang’s ears.<br/><br/>Heaven and Earth God-Transforming Technique?<br/><br/>Never heard of it!<br/><br/>Fang Wang was unconcerned, his right foot stamped lightly and the Town World Bead beneath him vibrated intensely, its devouring force surged, and the closer sea water avatars were directly absorbed by it.<br/><br/>“Then let us see if your avatars can satisfy my Town World Bead!” Fang Wang thought to himself, to merge as one with the silent sea?<br/><br/>Then he would make the silent sea disappear, and see how Zhu Rulai would panic then!<br/><br/>The Town World Bead began to grow in size, and as it became larger, its suction force kept increasing, and even Xiao Zi’s dragon body was nearly unable to withstand it, unable to escape.<br/><br/>Fang Wang glanced at it, extended a move through the air, and pulled Xiao Zi to his side; Xiao Zi then shrank and burrowed into his arms.<br/><br/>The Hongxuan Emperor, however, forcefully maintained his composure, struggling to resist the suction force of the Town World Bead.<br/><br/>He was even embarrassed to flee; after all, he was a Great Emperor who had once caused a ruckus in The Upper Realm, how could he be frightened into a panic flight by a junior’s Lifespirit Treasure?<br/><br/>“Young Master, that Zhu Rulai doesn’t dare to fight you,” exclaimed Xiao Zi excitedly.<br/><br/>No sooner had the words fallen than a multitude of sea water avatars attacked, their speed incredibly fast, faster than Wen Li, at the first level of the Heaven-Breaking Realm; before Xiao Zi could react, Fang Wang raised his right hand, and the Heaven Bound Golden Silk suddenly appeared, swept across and rapidly extended, covering a hundred miles in its sweep, with the water avatars all dissipating.<br/><br/>The Town World Bead, now over two thousand feet in diameter, radiated endless bright light, visible from any corner of the silent sea by all creatures.<br/><br/>It was as if a bright sun had fallen from the sky, punishing the entire ocean, with waters from all regions surging towards it, unstoppable and incessant.<br/><br/>Above the Town World Bead, the Heaven Bound Golden Silk flowed like the Milky Way, its emitted golden light just as eye-catching.<br/><br/>Countless sea water avatars, one after another, charged towards Fang Wang, all scattered by the Heaven Bound Golden Silk.<br/><br/>These sea water avatars were not only rushing towards Fang Wang but also casting Spells yet, regrettably, their Spells could not harm Fang Wang and could not even penetrate the protective range of the Heaven Bound Golden Silk.<br/><br/>Within the confines of the Heaven Bound Golden Silk, Fang Wang watched the battle unfold with tranquility.<br/><br/>He suddenly raised his palm and struck towards the sky. Zhu Rulai’s true body descended from the heavens, his flesh burning with golden flames as he dived downwards. His right palm was facing down, inside which a golden ‘Buddha’ character was condensed.<br/><br/>Boom!<br/><br/>Their palms clashed from afar, setting off a wave of air that swept across tens of thousands of miles. Fang Wang’s right arm did not even tremble, but Xiao Zi in front of him was pressed down by the might of Zhu Rulai, nearly suffocating.<br/><br/>Zhu Rulai stared at Fang Wang, his eyes filled with wariness.<br/><br/>He had not expected Fang Wang to possess two such powerful Lifespirit Treasures. Having heard of Fang Wang’s deeds, he had assumed Fang Wang was a Body Cultivator.<br/><br/>Zhu Rulai then began to chant mantras, and as the sounds of Buddha’s voice emerged, Xiao Zi only felt the world turning upside down, extremely uncomfortable as if her dragon body was being pressed by mountains, becoming heavier and heavier.<br/><br/>Fang Wang’s eyes sharpened, and the Heavenly Dao Qi Flame around his body surged. His right arm forcefully exerted pressure, causing Zhu Rulai’s complexion to drastically change.<br/><br/>He only felt an unstoppable Spiritual Power assault him, and the sleeve on his right arm instantly shattered into ash.<br/><br/>Zhu Rulai was sent flying, his cassock turned to ash and his flesh disappeared amidst the immense Spiritual Power.<br/><br/>One force to subdue ten guilds!<br/><br/>Fang Wang’s palm was purely a suppression with Spiritual Power!<br/><br/>The Heavenly Dao Immensity Scripture made his Spiritual Power far surpass that of Zhu Rulai, even though Zhu Rulai was two major realms higher than him!<br/><br/>Fang Wang did not withhold his power; this one palm was enough to turn Zhu Rulai into ashes. The surging stream of Spiritual Power seemed as if it would break through the firmament, even more spectacular than the black holes above in the sky.<br/><br/>Fang Wang dared to be so earnest because he had seen through the mysteries of the Heaven and Earth God-Transforming Technique.<br/><br/>Zhu Rulai had already merged with the Cang Abyssal Sea, so even if he died, as long as the Cang Abyssal Sea remained, he could be reborn.<br/><br/>It seemed unsolvable, but the flaw was also very obvious.<br/><br/>To kill Zhu Rulai, it was necessary to make the Cang Abyssal Sea disappear, and Fang Wang just happened to possess such ability.<br/><br/>Boom<br/><br/>The Town World Bead trembled, still growing madly in size, while the diameter of the sea wave it sucked up below was also rapidly increasing.<br/><br/>“Could he really do it?” The Hongxuan Emperor furrowed his brow, his heart filled with dread.<br/><br/>The power of the Town World Bead far surpassed his imagination. If the Town World Bead could devour the Cang Abyssal Sea, once Fang Wang was powerful enough, couldn’t he devour the entire Mortal Realm?<br/><br/>And that mysterious ribbon was equally extraordinary. Zhu Rulai’s water clone seemed vulnerable, but in fact, it was because the Heaven Bound Golden Silk bound them at the moment of contact, sealing their Spiritual Power. Without Spiritual Power, the water clone was just seawater.<br/><br/>What shocked the Hongxuan Emperor the most was Fang Wang’s insight, which allowed him to quickly perceive the weakness of Zhu Rulai’s Heaven and Earth God-Transforming Technique.<br/><br/>Zhu Rulai was going to lose!<br/><br/>Now, he was curious about one thing: Would Fang Wang really devour the entire Cang Abyssal Sea?<br/><br/>Fang Wang did not know what the Hongxuan Emperor was thinking, but he indeed had plans to swallow the entire Cang Abyssal Sea.<br/><br/>It all depended on when Zhu Rulai would bow his head!<br/><br/>And so, the endless water clones were blocked by the Heaven Bound Golden Silk, while Zhu Rulai occasionally revealed his true body, using spells, and even Divine Skills.<br/><br/>His eyes could even emit beams of light that could injure Fang Wang’s skin.<br/><br/>Of course, that was Fang Wang deliberately using the back of his hand to test.<br/><br/>This move was powerful!<br/><br/>But his physique was stronger, with the Vajra Invincible Saint Body combined with the Heavenly Body, his flesh was far stronger than it appeared.<br/><br/>Zhu Rulai, seeing that his Divine Skill only managed to graze Fang Wang’s skin, was nearly scared out of his wits.<br/><br/>“How is this possible…”<br/><br/>Just as this thought arose in Zhu Rulai’s mind, he was annihilated by Fang Wang’s Divine Nurturing Sword Qi.<br/><br/>Fang Wang kept switching supreme arts to combat Zhu Rulai, displaying each of the supreme arts he mastered, killing Zhu Rulai’s true body in different ways.<br/><br/>The distant Hongxuan Emperor’s expression grew increasingly serious.<br/><br/>This youngster…<br/><br/>How does he possess so many profound legacies?<br/><br/>He must be the reincarnation of an ancient powerhouse!<br/><br/>Yes!<br/><br/>From his supreme arts, one could surely see some clues.<br/><br/>With so many Great Saint Legacies, the one Fang Wang was most proficient in must be his own supreme art.<br/><br/>The Hongxuan Emperor watched Fang Wang closely, but his heart gradually sank.<br/><br/>Why did he feel that Fang Wang’s use of the Heavenly Emperor’s Command was even more formidable than his own?<br/><br/>This ‘formidable’ was not about the lethality but rather in the application of the same level of mastery over the Heavenly Emperor’s Command.<br/><br/>It was not just his Heavenly Emperor’s Command; Fang Wang had an extremely high level of proficiency in his other supreme arts, as if he were the creator of these arts.<br/><br/>The Hongxuan Emperor suddenly thought of someone.<br/><br/>Could it be that Fang Wang was the reincarnation of that person?<br/><br/>The more he thought about it, the more he felt it was possible, and the way he looked at Fang Wang completely changed.\t\t\t\t\t\t</div>", "images": {}, "success": true}