{"id": 233, "url": "https://www.novelhall.com/i-became-an-immortal-on-mortal-realm-32879/14551587.html", "title": "Chapter 233 - Chapter 233: Chapter 230: Suppressing The Dao Power Of The Heavenly Dao In The Human Realm_1", "volume": 3, "volume_title": "Volume 3", "body": "<h1>Chapter 233 - Chapter 233: Chapter 230: Suppressing The Dao Power Of The Heavenly Dao In The Human Realm_1</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 233: Chapter 230: Suppressing the Dao Power of the Heavenly Dao in the Human Realm_1<br/><br/>Translator: 549690339<br/><br/>After four days, Fang Wang, the Hongxuan Emperor, and Xiao Zi finally arrived at the Mysterious Sea.<br/><br/>As soon as they entered the Mysterious Sea, Fang Wang felt an instant oppressive force between the sky and the sea, a sight so evident even mortals could perceive it.<br/><br/>There were no clouds in the sky, but it was dim as if dusk were approaching. The sun hung in the sky, at first glance one might mistake it for the bright moon.<br/><br/>The waves tumbled continuously without a sound, this boundless ocean was extremely oppressive. Xiao Zi, always lively and free, couldn’t help but feel nervous upon arrival here.<br/><br/>“Upon entering this realm, Zhu Rulai will definitely notice. Be ready for battle at any moment.”<br/><br/>The Hongxuan Emperor said solemnly, ever since Fang Wang had mastered the Formless Zhou Tian Technique, he hadn’t smiled again, his demeanor as oppressive as the Mysterious Sea itself.<br/><br/>Fang Wang stretched languidly, then asked, “What do you think, should I suppress him with the Heavenly Emperor Imperial Mirror, or should I do it in my strongest form?”<br/><br/>At these words, the Hongxuan Emperor couldn’t help but widen his eyes in surprise, cursing, “You brat! Are you looking down on the Heavenly Emperor Imperial Mirror?”<br/><br/>You brat?<br/><br/>Could it be…<br/><br/>Xiao Zi suddenly thought of something, and her view of the Hongxuan Emperor changed.<br/><br/>Fang Wang replied calmly, “The Heavenly Emperor Imperial Mirror is profound and vast, but it demands much from one’s realm. How could the Nirvana Realm unleash its true power?”<br/><br/>On hearing this, the Hongxuan Emperor felt somewhat better.<br/><br/>Just as he was about to speak, Fang Wang’s voice rang out, “Forget it, I’ll suppress him with my own means. It’ll be a good opportunity to test my new treasure.”<br/><br/>The Hongxuan Emperor, thinking of the treasure that he recognized as a sixth-order Dao essence, revealed a look of anticipation in his eyes.<br/><br/>Xiao Zi, feeling Fang Wang’s confidence, immediately sped up, eager to witness her master’s formidable prowess.<br/><br/>This was to be the master’s first battle after breaking through to the Nirvana Realm!<br/><br/>Boom<br/><br/>A thunderous roar came from ahead, breaking the silence between the heaven and the sea, as if divine beings were declaring their sovereignty, filled with a sense of oppression.<br/><br/>Meanwhile,<br/><br/>On the other end of the ocean, within the Bu Jian Temple surrounded by dragons, Zhu Rulai stood in the courtyard, gazing into the distance.<br/><br/>Miao Wufa approached him and asked, “What’s wrong? Has Fang Wang already arrived?”<br/><br/>Zhu Rulai’s face was expressionless as he said, “That’s right, he is considering which way to suppress me.”<br/><br/>Miao Wufa was taken aback, then burst into uproarious laughter.<br/><br/>Zhu Rulai didn’t get angry but his gaze turned even colder.<br/><br/>“Hahaha, isn’t he so arrogant? Let me tell you, he is definitely the most arrogant person I’ve ever seen. His arrogance isn’t bluster or swagger, but an attitude in his actions, contemptuous of all, truly believing he is invincible under the heavens,” Miao Wufa said with a laugh, even theatrically wiping the corners of his eyes to brush away non-existent tears.<br/><br/>“However, your Divine Skills may not be incapable of defeating him,” Miao Wufa said in earnest as he saw Zhu Rulai’s indifference.<br/><br/>Remembering the Divine Skills Zhu Rulai had shown him before, he was still deeply shaken to this day.<br/><br/>That was a strength no ordinary Cultivator could achieve!<br/><br/>Zhu Rulai levitated, leaving behind only one sentence, “Who’s stronger and who’s weaker will soon be clear. Just stay here and watch.”<br/><br/>His tone was full of confidence, not taking Fang Wang into consideration at all.<br/><br/>Fang Wang arrogant?<br/><br/>He, Zhu Rulai, was even more so!<br/><br/>Boom<br/><br/>Thunderclouds billowed, and the waves surged with increasing ferocity. A vast and oppressive might enshrouded the ocean as torrential downpours added to the grandeur of the scene.<br/><br/>Xiao Zi advanced through the downpour, its dragon breath causing the rainwater to evaporate upon approach, creating a mist around it as if it were soaring amongst the clouds.<br/><br/>The Hongxuan Emperor enjoyed the pelting rain, and although he was drenched, his excitement only grew.<br/><br/>It was fast approaching!<br/><br/>Between Fang Wang and Zhu Rulai, no matter who won or lost, he would be delighted.<br/><br/>Both of them were talents that irked him.<br/><br/>Ahead, the thunderclouds churned violently, quickly coalescing into the giant figure of a seated Buddha—magnificent in stature and dominating most of the firmament.<br/><br/>It was the very image of Zhu Rulai!<br/><br/>As the thunderclouds roiled, the figure of Zhu Rulai became blurred, and the more indistinct it became, the stronger the oppressive force it emitted.<br/><br/>“Tian Dao Fang Wang, I have heard that you are the current world’s number one talent,” said Zhu Rulai, his voice booming like thunder but his tone indifferent.<br/><br/>Fang Wang stood atop Xiao Zi’s head, slightly lifting his gaze. Underneath the bamboo hat, his young and handsome face emerged as he said with a soft laugh, “The number one talent is quite an exaggeration. Don’t tell me you have already traveled everywhere in this world?”<br/><br/>“Naturally, I haven’t traveled everywhere in the world, but this world lies within my sight,” Zhu Rulai replied. “Fang Wang, come. Use your strongest means to challenge me. Suppressing me will not be easy. You are not facing a mere mortal but the power of this ocean itself!”<br/><br/>As his voice fell, the boundless ocean rose, swirling into tornadoes from all directions like water dragons. Upon closer inspection, the figures of flood dragons could be seen within the tornadoes.<br/><br/>A smile crept across Fang Wang’s face as he lifted his right hand, condensing the Town World Bead.<br/><br/>Upon the Town World Bead’s emergence, it swiftly ascended, bursting forth with dazzling white light, dispelling the darkness between heaven and sea.<br/><br/>“You’re also not facing a mere mortal, but the Dao Power that suppresses the human realm!” Fang Wang’s words were filled with arrogance, even the thunder could not mask them.<br/><br/>“Hmph!” Zhu Rulai let out a cold snort as the thundercloud-formed majestic figure raised its palm toward the Town World Bead. In an instant, countless tornadoes across the ocean simultaneously swept towards the Town World Bead.<br/><br/>In the vastness of sky and sea, the Town World Bead seemed so insignificant, ready to be submerged by the fierce storm at any moment, let alone the oceanic forces attacking from all directions.<br/><br/>Xiao Zi’s draconic eyes widened, staring intently at the Town World Bead.<br/><br/>The Hongxuan Emperor did the same.<br/><br/>The Town World Bead trembled violently. In the blink of an eye, it grew from the size of a walnut to a thousand zhang in diameter. It was as if a sun had appeared out of nowhere above the sea, bringing daylight to the gloomy sky and waters in an instant.<br/><br/>Fang Wang appeared atop the Town World Bead in an instant, standing proudly. The bamboo hat drifted away with the wind, revealing the Heavenly Dao Imperial Dragon Crown. Accompanied by the activation of the Heavenly Dao Immensity Scripture, white flames ignited around him, and his entire demeanor changed abruptly, resembling a deity descending from the heavens.<br/><br/>He thrust a punch towards the sky, not using the Nine Dragons Tyrant Fist, relying only on the sheer force of his physical body to punch.<br/><br/>Boom!<br/><br/>The terrifying punch swept away the thundercloud figure of Zhu Rulai in an instant, shattering the endless clouds across the sky, and the vast dark seas suddenly became bright.<br/><br/>All the creatures on the islands could not help but look up, and even the monsters from the depths of the sea emerged, gazing in shock at the firmament.<br/><br/>As Fang Wang maintained his punching stance, in the eyes of the Hongxuan Emperor and Xiao Zi, he seemed to have shattered the heavens with a single punch, breaking the dark sky, with the numerous tornadoes converging upon him, exploding into nothingness. Centered on the Town World Bead, the sea surface below collapsed violently, spreading out as if an invisible titanic force were suppressing it.<br/><br/>Dominant!<br/><br/>The Hongxuan Emperor couldn’t help but exclaim that this young man truly had an imposing aura.<br/><br/>He had witnessed countless talented individuals, but Fang Wang’s dominance was the most unique. It was not a posture he put on, but something that radiated from his very bones.<br/><br/>Before he had time to ponder further, the Town World Bead unleashed a terrifying suction force. The originally collapsing sea surface rose, surging towards it, and a gale swept between heaven and sea. It even threatened to engulf him and Xiao Zi into the Town World Bead.<br/><br/>“This young man… Could it be…” The Hongxuan Emperor seemed to guess something, his eyes widening in disbelief.\t\t\t\t\t\t</div>", "images": {}, "success": true}