{"id": 246, "url": "https://www.novelhall.com/i-became-an-immortal-on-mortal-realm-32879/14573590.html", "title": "Chapter 246 - Chapter 246: Chapter 243: Li Dai, The Enchanting Phoenix", "volume": 3, "volume_title": "Volume 3", "body": "<h1>Chapter 246 - Chapter 246: Chapter 243: Li Dai, The Enchanting Phoenix</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 246: Chapter 243: Li Dai, The Enchanting Phoenix<br/><br/>Translator: 549690339<br/><br/>The elder stared at Fang Wang for a long while before breaking the silence, reflecting, “Youth is to be feared, remarkable. What is this era like now? Could you describe it to me?”<br/><br/>A grand era?<br/><br/>Fang Wang thought for a moment and said, “Many predecessors told me that the coming era will be comparable to the grandeur of the Grand An Divine Dynasty. Are you familiar with the Grand An Divine Dynasty?”<br/><br/>He couldn’t just say that this era didn’t even have a Great Saint, which would be too embarrassing. It’s better to say it this way, as it would be easier to provoke the other party.<br/><br/>Upon hearing about the Grand An Divine Dynasty, a smile appeared on the elder’s face as he reflected, “If that’s the case, then that’s wonderful. I came from the last years of the Grand An Divine Dynasty myself. I’ve forgotten many things and only remember that the soil of my hometown was very soft. I longed to fly to the heavens and dive into the seas, but afterwards, the Divine Dynasty fell and the Mortal Realm faced an era of turmoil like never before.”<br/><br/>“It was an era when all clans rose together, and it was the darkest of times for the human race. Right before my fall, I finally saw a glimmer of hope for the human race’s rise.”<br/><br/>Intrigued, Fang Wang asked, “What kind of dark era was that? Could a Great Saint not protect the human race at that time?”<br/><br/>“Great Saint? Haha.”<br/><br/>The elder laughed a little and started walking down the steps.<br/><br/>His gaze fixed on Fang Wang, in the empty inn his look was like that of a vengeful ghost, numb yet with a hint of hatred.<br/><br/>“Great Saints, who climbed upon heaps of white bones to achieve their status in the heavens and earth? They would not protect the human race. On the contrary, they were the greatest threat to the human race.”<br/><br/>Fang Wang frowned at the elder’s words.<br/><br/>Fang Wang, puzzled, asked, “With all the different races rising, why would Great Saints still persecute the human race?”<br/><br/>The elder said slowly, “Because Great Saints did not come from the human race.”<br/><br/>Fang Wang’s frown deepened.<br/><br/>“Are you from the human race?”<br/><br/>“Of course I am!”<br/><br/>Fang Wang hurriedly said, not wanting to be mistaken for a member of the Demon Race and be unjustly burdened with sins. That would be too wrongful.<br/><br/>Unexpectedly, even the Formless Zhou Tian Technique could have a day when it would backfire on him.<br/><br/>The elder smiled and said, “Indeed, if you were from the Demon Race, you wouldn’t have said those things earlier.”<br/><br/>Fang Wang watched as he walked down the stairs, stopping about seven steps away from him.<br/><br/>Fang Wang then asked, “May I have the honor of knowing your esteemed name?”<br/><br/>“My name… It’s been too long; I can’t remember. I think it was Li Dai…”<br/><br/>Li Dai?<br/><br/>Fang Wang carefully pondered and was sure he had not heard this name before.<br/><br/>The elder, staring at Fang Wang, said in a soft voice, “Junior, I would like to make a deal with you.”<br/><br/>“Please speak, senior.”<br/><br/>“Find my grave, and I will bestow upon you a great opportunity.”<br/><br/>“What kind of great opportunity?”<br/><br/>Instead of agreeing immediately, Fang Wang inquired.<br/><br/>Fang Wang did not completely trust ancient powerful beings; most inheritances were about mutual benefits. Since it was a deal, he needed to get the details clear.<br/><br/>Li Dai sat down at a table. He poured himself a bowl of wine and, with trembling hands, lifted the bowl and downed it in one gulp.<br/><br/>“A supreme treasure,” Li Dai turned to look at Fang Wang and said softly.<br/><br/>Fang Wang frowned and said, “Can’t you say it’s a cultivation technique, divine skills, or something of that sort?”<br/><br/>With the Lifespirit Treasure already in hand, he did not need any other magical artifacts. In his view, magical artifacts and magic artifacts were external objects, and true strength lay in one’s own path of cultivation.<br/><br/>Hearing this, Li Dai stared at him, revealing an eerie smile, “This supreme treasure will allow you to lord over all beings and turn the heavens and earth upside down.”<br/><br/>“I suppose obtaining this supreme treasure won’t be easy, and such treasures often come with entangling karma. Compared to a supreme treasure, I am in need of cultivation techniques more,” Fang Wang said confidently, not desperate for this opportunity.<br/><br/>Li Dai fell silent.<br/><br/>Fang Wang waited patiently.<br/><br/>After a long time,<br/><br/>Li Dai finally said, “In that case, come and find me when you are ready to set out, and I will grant you my strongest cultivation technique, which is as valuable as the supreme treasure.”<br/><br/>Fang Wang smiled and immediately thanked him, “Thank you, senior.”<br/><br/>After speaking, he withdrew his consciousness.<br/><br/>In reality, Fang Wang’s eyes regained their brightness; he tossed the bronze mirror into the Dragon Jade Ring, then stood up and flashed into the courtyard of The Three Immortals of the Emperor Sea.<br/><br/>These days, The Three Immortals of the Emperor Sea were engrossed in studying the Heavenly Emperor Imperial Mirror, desiring nothing else. Their courtyard was always noisy, with powerful energy occasionally overflowing. The cultivators of Sword Heaven Marsh had grown accustomed to it and even spread legends that three old immortals were living in Sword Heaven Marsh.<br/><br/>The legend of The Three Immortals of the Emperor Sea elevated Fang Wang’s status in the hearts of the mainland’s cultivators.<br/><br/>Fang Wang stood in the center of the courtyard, looking around. The Three Immortals of the Emperor Sea were lying on the ground, head to head, seemingly practicing some unique technique.<br/><br/>He walked a few steps, looked down at Chen Xian, who was ranked third among them, and asked, “Have you ever heard the name Li Dai?”<br/><br/>In seeing Fang Wang, Chen Xian didn’t immediately jump up, but asked listlessly, “Li Dai? Is that a person’s name?”<br/><br/>“Yes.”<br/><br/>“I haven’t heard of it, brother, second brother, what about you?”<br/><br/>“Nor have I.”<br/><br/>“I seem to have heard about it.”<br/><br/>Qian Xian got up with a turn of his body, and as he did so, the aura of both Yu Xian and Chen Xian became chaotic, each spitting out a mouthful of blood against the sky.<br/><br/>The two hastily got up and glared at Qian Xian angrily.<br/><br/>Qian Xian remained indifferent, stroking his chin, starting to think hard.<br/><br/>Seeing that he was considering matters for Fang Wang, Yu Xian and Chen Xian could only suppress their anger and strive to calm themselves down.<br/><br/>Fang Wang found it amusing that these three were so old yet still engaged in daily squabbles, which he thought kept them from being lonely.<br/><br/>“I remember now. I saw the name Li Dai in a legend, from the barbaric era when countless races rose together, humans were prey to demons, where a great human shaman crossed five seas to hunt down a demon phoenix, boosting the morale of our human race.”<br/><br/>Qian Xian said thoughtfully, his tone somewhat hesitant, as if he was trying hard to recall the details.<br/><br/>Fang Wang looked at him and pressed, “What else?”<br/><br/>“That’s it. This is just one of the many legends within a remnant realm I visited. I remember it because that demon phoenix was depicted majestically, vividly, as if it could fly out from the wall. I remember its posture even to this day,” Qian Xian reminisced, his face showing a look of intoxication.<br/><br/>Fang Wang was speechless, how could you be so fascinated by a monster? Could it be that it had transformed into a human?<br/><br/>Chen Xian suddenly realized something and said, “I remember now too. That demon phoenix had the upper body of a human, and it was a woman, unclothed. You old rascal, still thinking about it to this day. How lecherous! You’re a disgrace to us, The Three Immortals of the Emperor Sea!”<br/><br/>Qian Xian’s face turned red, and he retorted stiffly, “Nonsense, don’t you also remember it?”<br/><br/>The Three Immortals of the Emperor Sea began bickering again.<br/><br/>Fang Wang listened for a while but soon lost interest and silently left.<br/><br/>Back on the wooden bridge, Fang Wang stopped dwelling on it and concentrated on cultivation.<br/><br/>First, reach the Heaven-Breaking Realm!<br/><br/>After reaching the Heaven-Breaking Realm, he would also need to fuse his unique skills. The earlier delay with the Formless Zhou Tian Technique had put off this main task. He couldn’t afford another delay during the next breakthrough.<br/><br/>Upon Fang Jing’s return, sword cultivators from Sword Heaven Marsh would occasionally come to spar, and sometimes he would boast about his life experiences. One day, he unintentionally revealed the existence of the Wind Clan, leading to Sword Heaven Marsh’s cultivators spreading the word, even to the major sects across the continent.<br/><br/>Having heard that a mysterious force called the Wind Clan might come to Sword Heaven Marsh to trouble the Heavenly Dao, the major powers were not afraid but rather excited, seeing it as an opportunity.<br/><br/>Thus, they sent Great Cultivators to Sword Heaven Marsh and ordered other disciples to investigate the Wind Clan at sea.<br/><br/>Ever since the concept came from Kunlun, many sects reached a consensus: Kunlun would surely become a sacred place. Moreover, given its vastness, if they could occupy a piece of land in Kunlun or have their children enter it, it would be greatly beneficial.<br/><br/>Three years later.<br/><br/>Fang Wang opened his eyes and looked across the lake, where he saw a figure in red standing on the other side, staring at him from a distance.<br/><br/>It was Zhou Xue.<br/><br/>When Zhou Xue saw him open his eyes, she suddenly turned into multiple afterimages and rushed toward him, arriving by his side in the blink of an eye. She then sat down next to him and even patted his shoulder.<br/><br/>“Your movement skills are really fast,” Fang Wang said softly in admiration.<br/><br/>Zhou Xue glanced at him and laughed, “No matter how fast I am, I can’t escape your eyes.”<br/><br/>Fang Wang smiled and asked, “What brings you back all of a sudden? Is it because of something?”<br/><br/>Zhou Xue replied, “My father is about to reach his life’s end, I came back to see him off on his last journey.”<br/><br/>Once she spoke these words, Fang Wang fell silent.<br/><br/>Zhou Xue’s adoptive father was Fang Wang’s Fourth Uncle, Fang Zhen, who was nearly three hundred years old. Living up to this day definitely made him a long-lived person.<br/><br/>Not just Fang Wang, the senior members of his family who had mediocre talent in cultivation were still unable to surpass the Spirit Elixir Realm, relying solely on various elixirs to maintain their life force and energy, with their end potentially near at any time.<br/><br/>Fang Wang thought of his own parents and remembered their remaining lifespan, feeling somewhat dejected.<br/><br/>“Can’t even the Celestial Immortal Venerable bestow longevity on people?” Fang Wang asked.<br/><br/>Zhou Xue shook her head slightly and said, “Every person has their own fate regarding lifespan, breaking through realms can rewrite that fate, so cultivation is said to be defying the heavens. But mortals are ultimately mortals, each with their own fate, which cannot be forced. I could bestow a life-changing technique on Fang Xun because his talents surpass those in the Fang Residence, making him worthy of it.”<br/><br/>“True immortality is very rare even in The Upper Realm, and reincarnation is not necessarily a bad thing. With our influence on their fate, even if they are reborn, they will have a good next life.”<br/><br/>Fang Wang remained silent.<br/><br/>Zhou Xue then said, “If one lives a life without regrets, that’s more or less enough. Don’t think too much about it.”<br/><br/>Fang Wang laughed and said, “Of course, I won’t overthink it; after all, I’ve died once before.”<br/><br/>Zhou Xue thought he was referring to the life before his rebirth.<br/><br/>She shook her head with a smile, no longer dwelling on the topic.<br/><br/>Fang Wang then started to inquire about the origins of Li Dai.<br/><br/>Zhou Xue had actually heard of Li Dai and with a flicker in her eyes, she said, “When I first heard this name, I had already ascended. They say that a disaster burst forth in the Mortal Realm, and Li Dai was denounced by the Immortal Gods as a sorcerer. Why, have you encountered him?”<br/><br/>Fang Wang did not hide anything and told her the whole story, also handing her the bronze mirror.<br/><br/>After hearing his words, Zhou Xue immediately probed into the mirror with her divine sense.<br/><br/>There was a booming sound!<br/><br/>An air wave burst forth, and Fang Wang’s hair fluttered wildly; he squinted slightly.<br/><br/>The prohibitions within the mirror had returned to their original state, yet Zhou Xue could forcefully breach them so effortlessly, indicating her considerable strength.<br/><br/>Fang Wang did not disturb Zhou Xue but quietly observed her profile.<br/><br/>It was the first time he had closely admired Zhou Xue’s features.\t\t\t\t\t\t</div>", "images": {}, "success": true}