{"id": 243, "url": "https://www.novelhall.com/i-became-an-immortal-on-mortal-realm-32879/14572549.html", "title": "Chapter 243 - Chapter 243: Chapter 240: Saintly Emperor Certification, Two Choices", "volume": 3, "volume_title": "Volume 3", "body": "<h1>Chapter 243 - Chapter 243: Chapter 240: Saintly Emperor Certification, Two Choices</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 243: Chapter 240: Saintly Emperor Certification, Two Choices<br/><br/>Translator: 549690339<br/><br/>“Since that’s the case, then this Emperor will satisfy you!”<br/><br/>The Hongxuan Emperor raised an arm and swept it forward, and instantly, the momentum of the ten Great Saint Generals surged, each brandishing their Divine Weapons that emitted various glows.<br/><br/>One of the slightly slender Saint Generals took out a large bow, quickly drew it, and released a volley that resembled a meteor shower, arrows of light streaking across the sky, as if a sea of stars was plummeting to the earth.<br/><br/>Another Saint General landed amidst the ruins, striking the ground with a scepter in hand. A visible wave of air burst from the bottom of the staff, followed by a dense network of fiery lines on the surface of the earth, which, from a high vantage point, looked like mysterious and complex characters rapidly spreading to form a Formation map.<br/><br/>Four Saint Generals simultaneously raised their treasured artifacts, and surging Spiritual Power turned into multicolored rays of light, rising rapidly and converging at an incredible speed into a Formation.<br/><br/>In a moment, Fang Wang found himself trapped within a ten-thousand-mile radius.<br/><br/>He did not show any sign of nervousness; rather, he stood the Heavenly Palace Halberd upright before him. His black hair suddenly fluttered upward as if it were flames, fervently burning, as if the Heavenly Dao Imperial Dragon Crown might barely contain it.<br/><br/>Fang Wang released all restraints and tapped into the true power of the Heavenly Palace Halberd.<br/><br/>Boom—<br/><br/>Accompanying a burst of dazzling silver light that swept across all living things, Tai Xi, Xiao Zi, and Zhao Zhen instinctively closed their eyes, only to open them again the next second.<br/><br/>Their eyes sparkled with an unusual luster, their expressions changing as well. Xiao Zi instinctively opened her Dragon Mouth, while Zhao Zhen’s eyes widened.<br/><br/>In the dimly lit world, the terrestrial fire burned intensely, countless stars descended, and all around were the auroras that hung in the sky.<br/><br/>In the midst of all these spectacular scenes, a halberd casting silver light stood between heaven and earth, ten thousand zhang tall, precisely the silhouette of the Heavenly Palace Halberd.<br/><br/>The Heavenly Palace Halberd hadn’t grown larger; it was still in Fang Wang’s hands. It was just that its power had manifested its own divine semblance.<br/><br/>Feeling the immense strength from within the Heavenly Palace Halberd, Fang Wang’s lips curved upward, and he swung the halberd mightily.<br/><br/>The ten-thousand-zhang silhouette of the halberd swept across heaven and earth, obliterating countless starlight arrows, violently shattering the surrounding Formation light barriers, and instantly extinguishing the vast terrestrial fires on the land.<br/><br/>The whole world seemed to darken in an instant!<br/><br/>Fang Wang leaped up, piercing through the Sea of Thunderclouds, and sunlight began to fall, shining upon the desolate earth, with countless specks of dust, debris, and bits of grass dancing in the light.<br/><br/>Before Tai Xi, Xiao Zi, and Zhao Zhen could react, the Sea of Thunderclouds above them suddenly exploded, the powerful pressure of the wind forcing them to retreat, and the forest ahead was uprooted as the world seemed on the brink of collapse.<br/><br/>Above them all, Fang Wang shone like the sun, with Yang Energy burning fiercely, the blaze stretching over a hundred miles. He brandished the Heavenly Palace Halberd, bringing it down with a single slash.<br/><br/>With that slash, numerous Black Dragons rode the surge of the blast, rushing toward the ten Great Saint Generals, competing to get ahead!<br/><br/>Nine Dragons Tyrant Fist!<br/><br/>Fang Wang infused this Fist Technique into the Heavenly Palace Halberd, channeling Spiritual Power into the staff at the moment of the swing, combining the power of the Fist Technique with that of the Heavenly Palace Halberd to display even greater strength.<br/><br/>With this slash, he unleashed over a hundred Black Dragons, each one fierce and ferocious, rushing towards the Saint Generals while swelling rapidly, like ancient True Dragons descending from the sky, wreaking havoc across the Mortal Realm.<br/><br/>The speed of the dragon group was unimaginable, leaving the Saint Generals no option but to raise their treasured artifacts in defense.<br/><br/>Boom! Boom! Boom…<br/><br/>Their treasured artifacts were shattered one after another, some were pierced through their bodies, some were sent flying, and still others were devoured by the Black Dragons.<br/><br/>Centered around Fang Wang, from the perspective above his head, the dragons burst forth on the surface of the earth like blooming flowers, causing turmoil in all directions. The sky and land stirred up an overwhelming wave of dust, and there stood Fang Wang, a celestial being proud above the Mortal Realm.<br/><br/>In the fierce wind, Tai Xi shielded Xiao Zi and Zhao Zhen with her Spiritual Power. The cliff beneath her crumbled, her white clothes billowed violently, her hair danced wildly and even strands obscured her face. With wide, beautiful eyes, she gazed up at the celestial figure in the distance.<br/><br/>Within the blazing Yang Energy flame, Fang Wang appeared minuscule, especially compared to the ten-thousand-zhang long silhouette of the halberd, like a speck of dust. Yet Tai Xi clearly saw his figure.<br/><br/>She was overwhelmed.<br/><br/>What a posture it was?<br/><br/>She had never seen such a domineering figure, with a single halberd strike sending ten Divine Passage Realm Ninth Level Great Saint Generals into defeat. She even felt that if Fang Wang desired, he could destroy this little piece of heaven and earth.<br/><br/>In the distance, the Hongxuan Emperor’s thousand-zhang divine semblance remained immovable amidst the storm, his thousand arms seemingly revealing some profound truth of the Imperial Dao. He stared intently at Fang Wang, his expression shifting from shock to delight, and then to admiration.<br/><br/>This was Fang Wang’s first time fighting with his strongest Spiritual Power, unleashing the ultimate power of the Heavenly Palace Halberd. With a single strike, the figures of the Ten Great Saint Generals were successively extinguished, with the few who withstood the Black Dragons turning to ash within seconds.<br/><br/>The Nine Dragons Tyrant Fist contained the ultimate power of destruction!<br/><br/>The Heavenly Palace Halberd was imbued with the Mysterious Power of the Heavenly Palace!<br/><br/>The melding of these two forces, based on Fang Wang’s Spiritual Power, displayed the most powerful battle technique of his life!<br/><br/>Fang Wang’s hair fluttered, and the defiance on his face was gone. He gazed into the distance at the Hongxuan Emperor. The ten-thousand-zhang silhouette of the halberd beside him dissipated, turning into specks of starlight that adorned the bright vault of heaven.<br/><br/>The blaze of his Yang Energy likewise dispersed, with sunlight bathing his figure as if he were clothed in immortal robes.<br/><br/>The Hongxuan Emperor swung his arm again, and all at once, the world dimmed.<br/><br/>Tai Xi and Xiao Zi only felt as if the world was spinning, and it took several breaths before they had the sensation of landing.<br/><br/>They both felt a hand supporting them, and upon opening their eyes, they saw Fang Wang.<br/><br/>Fang Wang’s right hand was supporting Tai Xi’s arm, his left hand holding up Xiao Zi’s Dragon Head. Below them lay an abyss, and they stood atop a lone peak, its summit spanning only a two-zhang radius, with fierce winds howling as if to sweep them into the unfathomable depths.<br/><br/>In that dim world, only this lone peak existed, darkness extending in every direction, with wisps of fog undulating in the obscurity.<br/><br/>As if the night sky suddenly opened a pair of gigantic eyes, those were the eyes of Hongxuan Emperor.<br/><br/>In front of these eyes, Fang Wang, Tai Xi, and Xiao Zi were like dust. When Zhao Zhen floated out from the Soul Devouring Gourd, even he couldn’t help being startled by the colossal eyes in the sky.<br/><br/>“Fang Wang, you truly are a pleasant surprise to this emperor. Throughout the ancient and modern times, at least this emperor has never seen a talent like you. Your achievements in the future will only exceed mine, and perhaps your target will be that lone figure on the path of the Great Dao.”<br/><br/>The voice of Hongxuan Emperor resounded, the tone ancient and heavy, giving the feeling that endless years were rushing towards one’s face, with countless springs and autumns flickering by in an instant.<br/><br/>Just hearing his voice evoked a sense of melancholy and loss.<br/><br/>Fang Wang spoke up and asked, “May I ask, senior, who is this lone figure you speak of?”<br/><br/>“When you become a Saint or certify as Emperor, you will see for yourself.”<br/><br/>“Then may I ask, senior, which do you think is better, the Saint Dao or the Emperor Dao?”<br/><br/>Fang Wang voiced the doubt that he had harbored for a long time.<br/><br/>Great Saint or Great Emperor, who is stronger?<br/><br/>The eyes of Hongxuan Emperor were calm, like an ancient well at the end of time, having already witnessed all the splendor of the world and the peerless figures within the vast history.<br/><br/>“This answer also requires you to explore for yourself.”<br/><br/>“Let’s talk about inheritance. You now have two choices: one is to acquire all of my supreme cultivation techniques; the other is to acquire my fate.”<br/><br/>The words of Hongxuan Emperor moved Tai Xi.<br/><br/>All the supreme cultivation techniques?<br/><br/>How numerous are the techniques controlled by a Great Emperor?<br/><br/>Tai Xi felt no envy, instead, she thought that Fang Wang was worthy of such treatment.<br/><br/>The battle they had witnessed earlier made this favored daughter of the heavens feel as if she’d witnessed divinity. In her eyes, Fang Wang had already become the representative of the Great Saint.<br/><br/>The other geniuses might hope to compete for the position of the Great Saint, but to her, Fang Wang felt like the Great Saint of this era.<br/><br/>No one could compete!<br/><br/>Fang Wang asked, “What is the difference? Especially the senior’s fate.”<br/><br/>He remembered Ghost Emperor, who had also bestowed the fate of the Grand An Divine Dynasty upon him, though the time was not yet ripe. When the moment was right, this fate would find him.<br/><br/>“By acquiring the techniques, you will easily follow in the footsteps of this emperor’s Emperor Path. By acquiring my fate, this fate will not guide your cultivation, but will make you stronger and also attract karma. If you take my fate, you will become the common enemy of all those contending for sainthood and emperorship, but as long as you defeat them, whether you become a Saint or certify as Emperor, you will surpass the ordinary Great Saint and Great Emperor and ascend dramatically.”<br/><br/>Hongxuan Emperor explained it simply, causing Tai Xi and Xiao Zi to feel nervous.<br/><br/>Both of these choices sounded very appealing. They dared not make a sound, afraid to disturb Fang Wang’s thoughts.<br/><br/>“Why can’t I have both?” Fang Wang asked.<br/><br/>Hongxuan Emperor was silent for a moment, then spoke mournfully, “Although this emperor has fallen, there may still be a chance for revival. Junior, do not be too greedy. This emperor has left behind an inheritance, also to live up to the expectations of the masses.”<br/><br/>After much consideration, Fang Wang decided, “Then I choose fate.”<br/><br/>With the Formless Zhou Tian Technique at his disposal, even if he took on the fate, he wouldn’t fear being calculated by karma.<br/><br/>Besides, he already possessed the fate of the Grand An Divine Dynasty. Why not see it through to the end?<br/><br/>As for the cultivation techniques, there were plenty in the world, and he could continue to search for them, but fate was hard to come by.<br/><br/>Hongxuan Emperor narrowed his eyes, and a blinding light burst forth, quickly enveloping Fang Wang.<br/><br/>Fang Wang felt a warm sensation throughout his body, an indescribable and unexplainable feeling. He sensed that he was undergoing a transformation, but didn’t feel a significant increase in strength.<br/><br/>“Junior, the era of great contention is about to arrive. The Emperor Saints are reviving, new Saints and Emperors of later generations are rising, and those lofty Immortal Gods are spying. Let this emperor see whether you are born in response to the epoch, or if this era of great strife has emerged because of your birth!”<br/><br/>The voice of Hongxuan Emperor carried an indescribable solemnity.<br/><br/>In the darkness, a bright light flashed, forcing even Fang Wang to close his eyes.<br/><br/>The next second, Fang Wang found himself back in the tunnel. When he opened his eyes, Tai Xi and Xiao Zi were still closing theirs, teetering as though they might fall.<br/><br/>After a few moments, they finally opened their eyes.<br/><br/>Xiao Zi, excited, asked Fang Wang, “Young Master, how does it feel to have the Emperor’s fate?”<br/><br/>Fang Wang, looking at his own hands, answered, “For now, I don’t feel much.”<br/><br/>His gaze shifted to Tai Xi.<br/><br/>Tai Xi was staring at him, as if sensing something. She turned her head and saw a jade pendant floating behind her.<br/><br/>“Girl, inside this jade pendant is a cultivation technique created by this emperor for the Empress. If cultivated successfully, it could possibly make you a female Emperor. Your connection to him means you possess great fate. This emperor will also anticipate your performance.”<br/><br/>The voice of Hongxuan Emperor echoed in the tunnel.\t\t\t\t\t\t</div>", "images": {}, "success": true}