{"id": 245, "url": "https://www.novelhall.com/i-became-an-immortal-on-mortal-realm-32879/14573585.html", "title": "Chapter 245 - Chapter 245: Chapter 242: Opportunity Knocks", "volume": 3, "volume_title": "Volume 3", "body": "<h1>Chapter 245 - Chapter 245: Chapter 242: Opportunity Knocks</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 245: Chapter 242: Opportunity Knocks<br/><br/>Translator: 549690339<br/><br/>Fang Wang and Fang Hanyu stood shoulder to shoulder at the head of the bridge as Fang Hanyu recounted his experiences over the years.<br/><br/>To temper his Sword Dao, guided by the Ten Thousand Year Sword Spirit, he crossed many seas and headed to the Sword Sect where the Ten Thousand Year Sword Spirit had been born. After tens of thousands of years, that Sword Sect no longer existed, but he discovered remnants of Sword Intent amidst the ruins.<br/><br/>After absorbing that Sword Intent, his mastery of the Sword Dao surpassed that of the vast majority of Sword Cultivators under five hundred years of age.<br/><br/>Then, he entered the Devil’s Abyss, where he honed his Sword Intent amid slaughter and met an old predecessor who had lived for four thousand years and hid deep in the Devil’s Abyss to evade the Heavenly Dao.<br/><br/>Fang Hanyu didn’t know the old predecessor’s name nor his level of cultivation. The man taught him a Sword technique that enabled him to fuse all his various Sword Intents into a new Sword Dao.<br/><br/>During this period, he also met a woman, but she had long since passed away, with only her wandering soul remaining. They spent ten years together, and in the end, Fang Hanyu helped her soul transcend.<br/><br/>Fang Hanyu didn’t go into details, but Fang Wang could feel the melancholy in his heart—it was no wonder his face bore such signs of age.<br/><br/>“That’s quite the tale,” Fang Wang said with a laugh. “It could make for quite the story. Those adventurers from the pugilistic world love hearing such tales.”<br/><br/>Fang Hanyu rolled his eyes but felt significantly better. He had returned this time because he wanted to vent, and the only person he could completely open up to was Fang Wang.<br/><br/>Fang Hanyu sighed, “I finally understand why you never get emotionally involved. Even with a woman like Zhou Xue, you could restrain yourself from expressing your feelings. Love is indeed something to avoid, as getting involved means losing oneself.”<br/><br/>Fang Wang arched an eyebrow and laughed proudly, “My boy, sincere cultivation is the true path, especially for Sword Cultivators. Love is an obstacle on the road to the Sword Dao. If you want to achieve great success in the Sword Dao, you can’t afford to be involved in love.”<br/><br/>“Get lost.”<br/><br/>The two brothers began to shove each other, reverting to their childish ways, showing none of the demeanor of Great Cultivators.<br/><br/>After chatting for a long time, Fang Hanyu brought up Fang Zigeng, and the atmosphere turned somber.<br/><br/>“Trust him,” Fang Wang said as he took a deep breath. “I think he’s got great luck and will turn danger into safety. I’m more worried about you dying on the path of cultivation.”<br/><br/>Hearing this, Fang Hanyu wasn’t angered. He felt the same way.<br/><br/>“Next time you come back, bring those monsters from Biyou Island with you. Xiao Zi is missing them,” Fang Wang suddenly said.<br/><br/>Fang Hanyu nodded and smiled, asking, “When the day comes that Kunlun is established, can I also reside in the mountains?”<br/><br/>Fang Wang patted his shoulder and pointed towards the sky, “Probably right about there, halfway up the mountain, where you can establish a sword arena. You will be a challenge on Kunlun, testing the resolve of those seeking the path. By then, you can also take on disciples, and in several hundred years, I will surely be famous in the Mortal Realm. With countless geniuses coming to Kunlun, your Sword Dao will not be disparaged.”<br/><br/>“That would be great. I’ll stop everyone, so you won’t get any disciples.”<br/><br/>“Just don’t get surpassed by the younger generation. Although your Sword Intent is strong, it is still not as good as Xu Qiuming’s. By now, he must be even stronger, and there are plenty of sword geniuses in the world who are better than him.”<br/><br/>“Xu Qiuming, huh? Just wait till I meet him next time, and I’ll show him who’s boss,” Fang Hanyu said spiritedly, prompting a smile from Fang Wang.<br/><br/>Sorry, brother, but the one you’ve set your sights on is the number one Sword Dao prodigy in the world.<br/><br/>Fang Wang intentionally provoked Fang Hanyu with the mention of Xu Qiuming to ensure Hanyu wouldn’t slack off in his future cultivation.<br/><br/>Even if Fang Hanyu never defeats Xu Qiuming in his lifetime, as long as he can keep up with Xu Qiuming’s pace, he will rise above the common folk.<br/><br/>Fang Wang felt he really needed to try hard, as Fang Hanyu owed him a bow of thanks.<br/><br/>After talking with Fang Wang for several hours, Fang Hanyu left. He planned to return to the Fang Residence to visit his parents for a few days, then travel to the Fang Realm to leave behind his Sword Intent for the younger disciples to comprehend.<br/><br/>Having heard Fang Hanyu’s story, Fang Wang felt more motivated than ever.<br/><br/>In the future, he too wished to travel the Mortal Realm to see sights he had never seen before and hoped to meet some different people.<br/><br/>But before that, he had to reach the Heaven-Breaking Realm.<br/><br/>Fang Wang sat down and continued his cultivation.<br/><br/>With his eyes closed, the gears of time began to turn faster.<br/><br/>Usually, no one disturbed him, allowing him to focus wholly on his cultivation.<br/><br/>By the time he broke through to the sixth layer of the Nirvana Realm, nine years had passed.<br/><br/>He opened his eyes, and they shone brightly, with a hint of sharpness.<br/><br/>He immediately sent a message to someone within Sword Heaven Marsh.<br/><br/>Before long, a man dressed in black approached—it was none other than Fang Xun’s son, Fang Jing.<br/><br/>Many years had passed since they last saw each other, and he had reached the seventh layer of the Condensation Spirit Realm, his aura comparable to that of a Cross-Void Realm cultivator.<br/><br/>Fang Jing looked much the same as before. He walked up behind Fang Wang and seemed uneasy. He glanced around and then knelt behind Fang Wang.<br/><br/>“Uncle, please punish me; I’ve caused you trouble!” he said.<br/><br/>Fang Wang didn’t say a word, and Fang Jing explained why.<br/><br/>Since the turmoil of the Heaven’s Larceny Saint Sect ended, Fang Jing had ventured north, leaving the continent and crossing several seas. Along the way, he righted wrongs, helping those in need, which was extremely fulfilling.<br/><br/>But in the end, he hit a snag.<br/><br/>To save a female Cultivator who had been drugged, he ended up offending the leader of a certain sect. That leader sent people to attack him, and when they could not defeat him, he killed them in return.<br/><br/>I thought it was over, but it turned out that the Sect Master came from the Wind Clan, a Great Saint Noble House with ancestors who were Great Saints, and this Sect Master was a direct descendant of the Wind Clan, though only of average talent, hence his establishing of a new sect.<br/><br/>Fang Jing had heard that the Wind Clan acted tyrannically, especially when it came to the life and death of their kin; a century ago, a Mahayana Realm cultivator had killed a member of the Wind Clan, and within five years, was hunted down and slain by the clan, his body and dao both extinguished.<br/><br/>If even a Mahayana Realm cultivator could be killed, Fang Jing was naturally afraid, so he fled back to his home.<br/><br/>“Uncle, I didn’t want to cause trouble, but when I see someone being bullied, how can I not help?” Fang Jing said with feigned grievance. “Didn’t our great-grandfather teach us that a man must stand tall and uphold righteousness? It’s just that I didn’t expect that guy to have such a formidable background. I thought of my father, so I fled home early to avoid causing you to travel far and commit slaughter once again.”<br/><br/>Fang Wang snorted, “You are not your father; if you die, you die. I would not go on a killing spree because of you.”<br/><br/>“Ah, Uncle, you just say that, but if I really died, you’d surely ignore it. Yet, I can’t die – I still have to take care of you.”<br/><br/>“Alright, at least you’ve grown thick-skinned enough not to feign toughness.”<br/><br/>“That’s right, a person only lives once; one must know one’s limits.”<br/><br/>Fang Jing smiled with a hint of pride and quietly breathed a sigh of relief, sensing that his uncle was not blaming him.<br/><br/>He seemed to recall something and then took out a bronze mirror, saying, “Uncle, this was given to me by a female cultivator before she died. I reckon the Wind Clan member was looking for this artifact, which is why he poisoned her and tried to dishonor her. Unfortunately, although I intervened, she still died from the poison. This mirror must have some significant origin; please have a look, as I cannot discern its secrets.”<br/><br/>Fang Wang raised his right hand, and with a gesture from afar, the bronze mirror flew into his palm.<br/><br/>“Go and cultivate,” Fang Wang spoke.<br/><br/>Fang Jing smiled, stood up, hesitated for a moment, then asked, “About the Wind Clan…”<br/><br/>“Let’s see if they dare to come. If they do, we’ll see if they want to talk or fight.”<br/><br/>Upon hearing this, Fang Jing inwardly admired his uncle’s domineering presence.<br/><br/>Having traveled far and wide for many years, he considered himself well-informed, but none of the cultivators he met could compare to his uncle, at least not in terms of spirit and presence.<br/><br/>After paying his respects and departing, Fang Wang looked at the bronze mirror in his hand, a smile appearing on his face.<br/><br/>“Is this the fate of the Great Emperor? Even if I cultivate continuously, fortune still knocks on my door?”<br/><br/>Fang Wang felt moved, sensing the tremendous fate contained within the mirror the moment he laid eyes on it.<br/><br/>It definitely harbored a great opportunity!<br/><br/>Fang Wang sent his divine consciousness into the mirror and immediately felt a powerful restraining force.<br/><br/>Tough to break through!<br/><br/>Probably even a Heaven-Breaking Realm cultivator would struggle to break this restriction.<br/><br/>Fang Wang’s eyes hardened as he activated the Heavenly Dao Immensity Scripture.<br/><br/>With a boom!<br/><br/>The bronze mirror erupted with a powerful force, dispersing the surrounding spiritual fog and stirring up waves on the lake’s surface, alarming the majority of cultivators within the Sword Heaven Marsh.<br/><br/>When they sensed the direction of the blast, they all calmed down.<br/><br/>At the same time Fang Wang’s consciousness entered the bronze mirror and stepped into an illusionary realm.<br/><br/>He opened his eyes and found himself standing in a desolate wilderness, with the night sky like water, the moon mostly obscured by clouds, leaving the stars unseen.<br/><br/>There was an inn on the hillside ahead, brightly lit and with smoke curling up from its chimney.<br/><br/>Fang Wang immediately strode toward the inn and upon arriving, saw four characters on its signboard.<br/><br/>Desolate Heaven Inn.<br/><br/>Fang Wang crossed the threshold and entered the inn, finding it empty, yet every table was set with food and drinks.<br/><br/>His gaze turned to the stairs leading to the second floor, where he saw a shadow emerge on the corridor wall, slowly approaching.<br/><br/>Soon, an old man appeared at the top of the stairs, looking down at Fang Wang.<br/><br/>The old man stooped, his hair a mess, holding a wooden staff that seemed like a random branch.<br/><br/>He didn’t seem to be associated with the inn but more like an old beggar.<br/><br/>“Junior, what is your name, that I cannot deduce your presence? It seems you have attained a high level of cultivation,” said the old man, his voice both ancient and authoritative.<br/><br/>Fang Wang responded, “I am named Fang Wang, and I received a mirror left by my senior. I hope I have not disturbed you?”<br/><br/>The old man started to descend the stairs, pausing with each step, almost inducing the urge to support him.<br/><br/>“Disturbing me is not the issue, I’ve waited for so long I thought there would be no one left to awaken me,” the old man spoke faintly, his gaze fixed on Fang Wang as if trying to see through him.<br/><br/>“Judging from your divine consciousness, I cannot ascertain your cultivation level, but since you broke through my restriction, you must have reached the fifth level of the Divine Passage Realm, right?”<br/><br/>Faced with his inquiry, Fang Wang hesitated for a moment before replying, “To be honest, I am still but in the Nirvana Realm.”<br/><br/>As these words left his mouth, the old man abruptly stopped his descent, squinting his eyes and staring sharply at Fang Wang.\t\t\t\t\t\t</div>", "images": {}, "success": true}