{"id": 241, "url": "https://www.novelhall.com/i-became-an-immortal-on-mortal-realm-32879/14566740.html", "title": "Chapter 241 - Chapter 241: Chapter 238: Cheng Clan, Arrogant", "volume": 3, "volume_title": "Volume 3", "body": "<h1>Chapter 241 - Chapter 241: Chapter 238: Cheng Clan, Arrogant</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 241: Chapter 238: Cheng Clan, Arrogant<br/><br/>Translator: 549690339<br/><br/>The Hongxuan Emperor’s inheritance site lies in the same direction as the Cangji Minghai, located in a sea area adjacent to it.<br/><br/>En route, Tai Xi asked Fang Wang if he knew about the commotion in the Cangji Minghai a few years back, to which Fang Wang replied that he had merely passed by the fringes of the sea area and didn’t delve deep into it.<br/><br/>The battle between Fang Wang and Zhu Rulai, though grand in scale, had its news suppressed by Zhu Rulai. Still, rumors leaked, suggesting that Zhu Rulai was nearly killed by a mysterious and mighty being, but who this being was remained unknown to anyone.<br/><br/>“That Divine Sect’s Zhu Rulai is above the Heaven-Breaking Realm, a Divine Passage Realm Great being. Such an existence, for mortals, is akin to an Immortal God. My master had dealings with Zhu Rulai and claimed he was one of the greatest geniuses of our time. Unfortunately, I have yet to witness his elegance.”<br/><br/>Tai Xi sighed as she spoke of Zhu Rulai, her eyes curiously glancing at Fang Wang.<br/><br/>Zhu Rulai was the strongest prodigy she had heard of when she was younger, while Fang Wang was the strongest prodigy she knew of now.<br/><br/>“One of the top two? Has your master ever traveled to the Mortal Realm? I’ve heard that the other half of the Mortal Realm is even more powerful, rich in fate, brimming with talent. Can Zhu Rulai compare with the people there?” Fang Wang asked.<br/><br/>He wasn’t doubting Tai Xi’s master but was genuinely curious.<br/><br/>Tai Xi shook her head and said, “Of course not, the Mortal Realm is vast. However, I did hear about the existence of the other half of the Mortal Realm. My master’s master once ventured there, but unfortunately returned insane. Whatever she encountered there, no one knows, but since then, Suzhen Palace has ceased exploring that other half of the Mortal Realm.”<br/><br/>Fang Wang followed up with curiosity, “Is Suzhen Palace all female?”<br/><br/>Tai Xi nodded and said, “Suzhen Palace only accepts female disciples, and they must not marry or engage with anyone, lest they dissipate their Yin element.”<br/><br/>She seemed to think of something, her words laden with deep meaning, “If that friend you mentioned is a girl you like, I could arrange for her to be an Outer Sect Disciple and still receive the treatment of a Direct Disciple. Outer Sect Disciples don’t have as many rules, and they can still leave Suzhen Palace in the future.”<br/><br/>Fang Wang had already mentioned Gu Li’s name, asking Tai Xi to look after her. Hearing her offer, he shook his head with a wry smile.<br/><br/>“Let her decide for herself,” Fang Wang answered.<br/><br/>A fair lady, a gentleman’s good mate; to say Fang Wang had no feelings for Gu Li was impossible, but this slight fondness wasn’t enough to make him want to spend his life with her. Even with Zhou Xue, Fang Wang hoped to maintain a competitive relationship.<br/><br/>He didn’t want to commit to anyone for life just yet and also hoped that Gu Li would prioritize her cultivation.<br/><br/>If Gu Li chose to cut off romantic ties and immerse herself in cultivation, he wouldn’t mind.<br/><br/>It wasn’t that he had never loved; in his previous life on Earth, he had girlfriends – more than one, yet none ended well before his demise.<br/><br/>In Earth’s modern society, money was the most important thing, but in this world, cultivation rank was most important. While love could break the barriers of money and cultivation, he didn’t want to live that kind of life.<br/><br/>He believed that once he reached the pinnacle in the Mortal Realm, he wouldn’t be lacking in love.<br/><br/>Of course, what he might lack is not the love others have for him, but his love for others.<br/><br/>At least for now, no woman had appeared who made him want to throw caution to the wind.<br/><br/>Fang Wang and Tai Xi chatted casually on their journey, drawing their relationship closer, not as distant as before.<br/><br/>Xiao Zi and the phoenix competed somewhat in speed, both very fast.<br/><br/>After six days of rapid flight,<br/><br/>at noon on the seventh day, Tai Xi told Fang Wang to slow down.<br/><br/>Fang Wang immediately asked Xiao Zi to decelerate, sensing multiple powerful presences ahead, the weakest among them at the Mahayana Realm, with two auras from the Heaven-Breaking Realm.<br/><br/>“That guy actually intends to steal my opportunity!”<br/><br/>Tai Xi spoke with a cold voice, her elegant brows tightly furrowed.<br/><br/>Xiao Zi curiously asked, “Who? Are they strong?”<br/><br/>Tai Xi replied, “The person is named Cheng Tiance, from the Cheng Clan. Our Clan’s ancestors gave birth to a Great Saint. Even though it’s been tens of thousands of years, with the Great Saint’s bloodline, their foundation has remained strong. I had invited Cheng Tiance for the inheritance assessment, and after his failure, he feigned dissatisfaction, saying I wasted his time. Unexpectedly, he has returned with his clan in tow to kill.”<br/><br/>Towards the end, she bit her lip, eyes filled with anger.<br/><br/>Fang Wang raised an eyebrow and asked, “You can’t handle him?”<br/><br/>Tai Xi shook her head, “Certainly not, but they have many people, and I’m worried…”<br/><br/>“Let’s go, matters of destiny belong to those capable of seizing them. Besides, you discovered it first. Looking at it, they can’t grasp this opportunity, so it’s better left to you and me,” Fang Wang said nonchalantly, no longer seeing the Heaven-Breaking Realm as a threat.<br/><br/>Tai Xi was momentarily surprised before smiling lightly. She then waved her sleeve and said, “Since that is the case, I shall borrow the power of Heavenly Dao this time.”<br/><br/>Feeling its master’s spirit, the phoenix immediately flapped its wings to speed up, and Xiao Zi, not to be outdone, followed suit.<br/><br/>The presence of the True Dragon and the phoenix soon alerted the Cheng Clan’s cultivators.<br/><br/>They were currently on an island, where the visages of cultivators covered the mountains and fields, easily numbering five or six hundred people.<br/><br/>A man in black stood at a cave entrance, turning his head towards the sky, his eyebrows knitted and a look of disdain in his eyes.<br/><br/>He was Cheng Tiance, with the ninth layer of Nirvana Realm cultivation, one of the top geniuses of the Cheng Clan.<br/><br/>All the cultivators at the Nirvana Realm gathered by Tai Xi were at the ninth layer, powerful enough to challenge and defeat Heaven-Breaking Realm opponents in the assessment.<br/><br/>“The Tai Xi Celestial Maiden from the Suzhen Palace has arrived. Be respectful, after all, the Palace Leader and my father have ties,” Cheng Tiance said.<br/><br/>The other Cheng Clan cultivators all knew the origins of this opportunity and shook their heads, chatting in small groups, mostly jesting about what the Tai Xi Celestial Maiden would do when faced with them.<br/><br/>Soon, the figures of Xiao Zi and the phoenix approached from the sky.<br/><br/>Many of the Cheng Clan cultivators frowned, puzzled.<br/><br/>Why is there someone on the back of the True Dragon?<br/><br/>They had not detected Fang Wang’s presence just moments before.<br/><br/>They all presumed Tai Xi Celestial Maiden had come alone, and the dragon and the bird were overlooked by them.<br/><br/>Cheng Tiance frowned as well, his gaze firmly fixed on Fang Wang.<br/><br/>The higher one’s cultivation, the more they trusted their spiritual perception. They judged opponents not by sight, but by sensing the opponent’s aura with their spiritual perception.<br/><br/>They couldn’t detect Fang Wang’s presence with their spiritual perception, and even when Fang Wang had appeared before their eyes, they still couldn’t sense him, as if he didn’t exist at all. What did this imply?<br/><br/>Either Fang Wang had cultivated some mysterious technique, or his cultivation was far superior to theirs.<br/><br/>Whichever the case may be, they could not afford to take him lightly.<br/><br/>The firebird and Xiao Zi quickly halted above the island, while Tai Xi looked down at the Cheng Clan cultivators with a cold expression and asked, “Cheng Tiance, what is the meaning of this?”<br/><br/>Cheng Tiance didn’t answer her question, instead, he continued to stare at Fang Wang and asked, “May I ask for the name of this fellow Taoist?”<br/><br/>Looking down at him, Fang Wang responded expressionlessly, “Fang Wang.”<br/><br/>Fang Wang?<br/><br/>The Cheng Clan cultivators furrowed their brows, all somewhat puzzled.<br/><br/>Suddenly, a female cultivator asked in astonishment, “Are you Tian Dao Fang Wang?”<br/><br/>Tian Dao Fang Wang!<br/><br/>The faces of everyone changed drastically, clearly all having heard of the name Tian Dao.<br/><br/>Tian Dao Fang Wang was known for having slain a Great Cultivator of the Heaven-Breaking Realm; even cultivators within the Heaven-Breaking Realm found it difficult to slay one of their own, let alone a cultivator of the Nirvana Realm.<br/><br/>Most importantly, Fang Wang had also exterminated the Thousand Eyes Great Saint, who sought resurrection!<br/><br/>Defeating the Great Saint was an achievement that had resonated through the ages—no one dared to underestimate Fang Wang, even though the Thousand Eyes Great Saint was not in his true form.<br/><br/>Cheng Tiance’s demeanor shifted, but he soon revealed a smile, clasped his fist in greeting, and said, “It turns out to be Tian Dao. Taoist Friend, I am from the Cheng Clan, named Cheng Tiance. I have long heard of your illustrious deeds, and have always wanted to form an acquaintance with you. I never expected to encounter you here.”<br/><br/>In the face of Fang Wang, he dared not show any disdain.<br/><br/>Fang Wang scanned the Cheng Clan cultivators and asked, “I presume you have already attempted the trial here. How about letting us try?”<br/><br/>Cheng Tiance’s face showed delight as he asked, “Of course, it’s possible. With the Taoist Friend joining us, we will certainly succeed.”<br/><br/>“Sorry, I am here accompanying the Tai Xi Celestial Maiden.”<br/><br/>Fang Wang said unapologetically, having received many gifts from Tai Xi Celestial Maiden, he naturally had to do something in return.<br/><br/>The smile on Cheng Tiance’s face stiffened, but he quickly recovered his composure. He turned to look at the Tai Xi Celestial Maiden and asked with a smile, “Celestial Maiden, how about joining forces? The failure last time was due to those three weaklings.”<br/><br/>Tai Xi Celestial Maiden huffed, “No need, let the two of us try first. If we fail, then we will turn to you.”<br/><br/>Cheng Tiance’s eyes flickered, and he followed up with a smile, “Good, the two of you please go ahead.”<br/><br/>With that, he gestured towards the cave entrance.<br/><br/>Fang Wang immediately leaped forward, landing at the cave entrance, while Xiao Zi quickly shrank and settled onto his shoulder.<br/><br/>Tai Xi Celestial Maiden descended, transforming the firebird into a red hairpin; she walked toward the cave entrance while inserting the hairpin into her hair.<br/><br/>The Cheng Clan cultivators all kept their eyes on them, with no one daring to obstruct them.<br/><br/>Only when they had disappeared into the tunnel did the crowd break their silence.<br/><br/>“So he is Tian Dao Fang Wang, indeed quite arrogant.”<br/><br/>“Were you to extinguish a Great Saint, would you not be arrogant?”<br/><br/>“Just the two of them trying to pass the trial, a bit overconfident, aren’t they? The hardest part of the assessment is the second stage, with opponents from the Divine Passage Realm.”<br/><br/>“Let them try. It’s not good to offend Tian Dao directly.”<br/><br/>“Indeed, Tian Dao is extremely domineering. When the Emperor Sea Mysterious Dynasty killed his brother, he actually massacred the entire dynasty.”<br/><br/>Cheng Tiance’s eyes grew colder as he looked toward the tunnel.<br/><br/>Inside the tunnel.<br/><br/>Fang Wang asked, “Isn’t it said that there must be five from the Nirvana Realm?”<br/><br/>Tai Xi Celestial Maiden smiled, “There are just five Nirvana Realm slots, but the opponents are five from the Heaven-Breaking Realm. I can’t just bring two or three people to break through, can I? Besides, even a team of five couldn’t make it through.”<br/><br/>She turned her head towards Fang Wang, her beautiful eyes intently fixed on him, and asked, “Friend, how many from the Heaven-Breaking Realm would you like to handle?”<br/><br/>Fang Wang, looking ahead, said, “Just watch, Celestial Maiden. Since I’ve taken so many resources from you, I should repay you. For this trip, you just wait to receive the inheritance.”<br/><br/>Tai Xi Celestial Maiden was quietly astonished.<br/><br/>This man was truly audacious!<br/><br/>Although she felt Fang Wang was overly arrogant, she couldn’t help but have even greater expectations for him.<br/><br/>Fang Wang had already received the inheritance of the Hongxuan Emperor, so he was naturally full of confidence.<br/><br/>Now, he was curious about one thing—whether there might be a trace of the Hongxuan Emperor’s soul inside?<br/><br/>If there was, would the Hongxuan Emperor recognize him?\t\t\t\t\t\t</div>", "images": {}, "success": true}