{"id": 249, "url": "https://www.novelhall.com/i-became-an-immortal-on-mortal-realm-32879/14575009.html", "title": "Chapter 249 - Chapter 249: Chapter 246: Sky-Stepping Realm, The Greatest Prodigy Through The Ages", "volume": 3, "volume_title": "Volume 3", "body": "<h1>Chapter 249 - Chapter 249: Chapter 246: Sky-Stepping Realm, The Greatest Prodigy Through The Ages</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 249: Chapter 246: Sky-Stepping Realm, The Greatest Prodigy Through the Ages<br/><br/>Translator: 549690339<br/><br/>Xiao Zi felt the pressure, as imposing as the might of heaven, and couldn’t help but stop, her dragon body tensing up.<br/><br/>Beneath them, the sea surface had no islands in sight, looking like a giant blue-green water globe with no visible end.<br/><br/>Fang Wang and Xiao Zi stood in the air, appearing extremely insignificant. The winds and waves between heaven and sea had ceased, and an oppressive atmosphere was spreading.<br/><br/>Fang Wang’s expression was indifferent as his gaze flicked around, watching every direction of the world.<br/><br/>Suddenly, figures stepped through the air from different directions, a total of seven people, both men and women, each with an extraordinary aura.<br/><br/>As they got closer to Fang Wang, their footsteps sounded in Xiao Zi’s heart like heavy hammers.<br/><br/>“Tian Dao Fang Wang, you indeed carry yourself with poise.”<br/><br/>“For the mortals of the continent, you sure have the guts.”<br/><br/>“This kid is not simple at all. My divine sense can’t even probe him. It seems he has cultivated some unique skills.”<br/><br/>“He’s the first in ancient and modern times with such talent, entwined with a great fate, always something that surprises us.”<br/><br/>“Fang Wang, since you’re willing to come out, we naturally won’t trouble your Fang Family, nor the Descending Dragon Continent. After all, our Saint Clans have produced a Great Saint, so you can be assured of our reputation.”<br/><br/>These seven individuals were from the seven Saint Clans, with each of their auras surpassing the Divine Passage Realm!<br/><br/>Fang Wang, standing on Xiao Zi’s head, surveyed the seven people and asked calmly, “What do you all wish to discuss with me by calling me out here?”<br/><br/>The seven paused simultaneously, maintaining a thousand zhang distance from Fang Wang, which was but a mere step for them.<br/><br/>Their eyes reflected different views towards Fang Wang: greed, surprise, joy, and jealousy filled with hate.<br/><br/>An elder in a python-patterned black robe spoke up, “Fang Wang, all seven of us are at the Sky-Stepping Realm. Even with your exceptional talent, surely you cannot transcend the Heaven Breaking and Divine Skills to fight against us in the Sky-Stepping Realm with your Nirvana Realm cultivation.”<br/><br/>Sky-Stepping Realm!<br/><br/>A seductive woman in purple robes smiled at Fang Wang, “Why don’t you join our Song Clan? I assure you peace.”<br/><br/>As these words were spoken, the other Sky-Stepping Realm Great Cultivators glared at her angrily.<br/><br/>“Song Han Xianzi, such words should not be spoken!” a withered-haired old Taoist snorted coldly.<br/><br/>Song Han Xianzi quickly gestured with her hands, smilingly saying, “Feng Wuzong fellow Taoist, I was just joking. Why take it so seriously?”<br/><br/>The others began to speak up as well, seemingly not very familiar with each other, all calling out their names directly.<br/><br/>Feng Wuzong, Song Han Xianzi, Qiu Ya Zhenren, Han Huitian, Yu Ling Long, Ji Zhan, Liu Jun.<br/><br/>Fang Wang’s eyes fell on Feng Wuzong; the Wind Clan had pursued Fang Jing, and unexpectedly, they had joined hands with other Saint Clans.<br/><br/>Feng Wuzong appeared very cold, his gaze as chilling as a cold blade, making one shiver.<br/><br/>Fang Wang then turned his attention to Ji Zhan; carrying the surname Ji, he must be related to Ji Rutian.<br/><br/>These seven were indeed formidable; each gave Fang Wang an extremely strong sense of oppression. Since he set foot on the cultivation path, this was the first time he had faced such a peril.<br/><br/>Although these seven were not as oppressive as the Ghost Emperor, with the Fang Family involved, Fang Wang couldn’t just use the Jiuyou Zizaishu to escape outright.<br/><br/>His left hand quietly touched the Jade Bracelet held in his right hand, then he waited for the seven clan Great Cultivators to finish speaking.<br/><br/>He noticed that apart from these seven, there were many other strong presences in the distance. It seemed the Seven Saint Clans were very wary of him, deploying seven Sky-Stepping Realm individuals but still not enough, truly giving him face.<br/><br/>Feng Wuzong looked at Fang Wang with a cold voice, “Fang Wang, your clansman Fang Jing has slaughtered the progeny of my Wind Clan; this account must be settled.”<br/><br/>He was dressed in a Green Robe, holding a Jade Cane with green flames coiling around it, looking quite sinister.<br/><br/>Ji Zhan was cloaked in a black robe, wearing deep green armors underneath, with Dragon Heads on his shoulders, and long hair coiled beneath a White Jade Iron Crown; standing in the skies, he radiated an unrivaled aura. His expression was indifferent as he looked down on Fang Wang, “Fang Wang, come with us. Don’t think about resisting; it’s just asking for suffering. For someone in the Nirvana Realm to confront the Sky-Stepping Realm is like a Mortal facing Immortals, without any chance of victory.”<br/><br/>Han Huitian scrutinized Fang Wang, seemingly pondering.<br/><br/>Yu Ling Long wore a veil, draped in a radiantly white dress like a celestial maiden descending to earth, she too was observing Fang Wang.<br/><br/>Liu Jun did not speak much, but his gaze towards Fang Wang was full of greed, as if wishing he could devour him whole.<br/><br/>Qiu Ya Zhenren followed up, saying, “Let’s seal him and take him back for a final decision. Given our special status, we can’t stay here too long, as it would damage the reputation of the Saint Clans.”<br/><br/>Their tone of voice completely disregarded Fang Wang, nearly causing Xiao Zi to explode with anger, her dragon eyes threatening to burst into flames.<br/><br/>Fang Wang cracked his neck as the seven people’s gazes locked on to him, a terrifying intent to kill enveloping him, nearly causing Xiao Zi to fall.<br/><br/>“If you gentlemen wish to invite me to go with you, that’s not out of the question. However, before that, do any of you seven dare to take a punch from me?”<br/><br/>Fang Wang said expressionlessly, his right foot shifting slightly to shield Xiao Zi with his Spiritual Power.<br/><br/>In an instant, Xiao Zi let out a long sigh, as if a great burden had been lifted; her gaze towards the seven held a trace of fear.<br/><br/>“Nine Dragons Tyrant Fist? It seems you have great confidence in your punch. Since that’s the case, allow me to take your punch. After all, it wouldn’t sound good for us to bully the young with our greater numbers,” Han Huitian snorted coldly and stepped forward, beckoning Fang Wang to him.<br/><br/>Among the seven, Han Huitian’s energy and blood could be counted as one of the strongest, and the sense of oppression he exerted was also the most evident; of course, it’s also possible that the other six were restraining their prowess.<br/><br/>Han Huitian’s robe billowed intensely, his hair dancing as if fierce flames were blazing. Visible qi erupted from his body forming dragon-shaped environs around him. At first glance, it was as if nine Qi Dragons were coiled around him, silently roaring at Fang Wang.<br/><br/>Hearing Han Huitian’s words, the other six all showed a mocking expression and none of them stopped him.<br/><br/>They were all curious about Fang Wang’s true strength.<br/><br/>Although rumors said that Fang Wang was of the Nirvana Realm, when they stood before him, they actually couldn’t see through Fang Wang’s cultivation level, which inevitably made them feel a bit more wary in their hearts.<br/><br/>Fang Wang slowly raised his right hand, forming it into a fist.<br/><br/>As he clenched his fist, a sense of Heavenly Might enveloped the ocean, moving the seven Great Cultivators from the Saint Clans.<br/><br/>Song Hanxianzi sighed and said, “Just this fist’s might alone, I fear even those in the Divine Passage Realm would struggle to withstand. No wonder you are so confident. Impressive, indeed. It’s fortunate that we did not send juniors of the Divine Passage Realm here or we might have faced severe losses.”<br/><br/>Liu Jun’s eyes gleamed with even more greed, and his body began to tremble.<br/><br/>Han Huitian snorted coldly and said, “Junior, come then. Let me show you the gap between us!”<br/><br/>Boom!<br/><br/>His momentum surged wildly, and the nine Qi Dragons expanded a hundredfold, each towering ten thousand feet, stirring the clouds and overlooking the entire ocean.<br/><br/>Fang Wang’s eyes narrowed, and in an instant, white flames erupted around his body. He crossed a thousand feet in almost no time and arrived before Han Huitian, his right fist carrying destructive power as he struck out.<br/><br/>Boom!<br/><br/>The earth and sky roared, terrifying shockwaves swept out from the center of the two men, and the sea below kicked up circular horrific waves that rapidly expanded in all directions.<br/><br/>With one punch, Fang Wang scattered the clouds in the sky, and his fist was blocked by Han Huitian’s Qi.<br/><br/>Han Huitian’s robes fluttered with noise, as though they would be torn apart at any moment, but his body remained immovable as his gaze stayed fixed on Fang Wang.<br/><br/>Fang Wang stood before him, body slightly angled, his right fist hanging in front of Han Huitian’s face, less than half a meter away, with the head of a Black Dragon twisting around his fist.<br/><br/>Suddenly.<br/><br/>One of Han Huitian’s Qi Dragons scattered abruptly, causing the other six to show concern. Their gazes became dangerous in an instant as they all surrounded Fang Wang, encircling him completely.<br/><br/>The seven instantly obscured Fang Wang from view.<br/><br/>Ji Zhan’s right hand even landed on Fang Wang’s shoulder as he said coldly, “Junior, you’ve thrown your punch. Are you ready to come with us now?”<br/><br/>Han Huitian’s complexion looked somewhat unsightly. Song Hanxianzi, Yu Ling Long, Autumn Cliff True Person, Liu Jun, and Feng Wuzong all stared intently at Fang Wang. They were only five steps away from Fang Wang as if the net of heaven and earth had trapped him.<br/><br/>Fang Wang’s mouth curled slightly upwards as he slowly withdrew his fist and said, “Sky-Stepping Realm truly lives up to its reputation. I am indeed no match for you, so I shall accompany you on this journey.”<br/><br/>He then turned around, looked at Ji Zhan, and slightly tipped his chin up, saying, “Senior, could you step aside? I need to bring my dragon along with me.”<br/><br/>Ji Zhan narrowed his eyes, a dangerous glint flashing within them.<br/><br/>Fang Wang stared back fearlessly.<br/><br/>Song Hanxianzi exchanged a look with Ji Zhan, and after a moment of silence, he eventually stepped aside.<br/><br/>Fang Wang immediately flew towards Xiao Zi, settling atop Xiao Zi’s Dragon Head.<br/><br/>“We’ll go with them,” Fang Wang said as he sat down cross-legged, speaking softly.<br/><br/>Xiao Zi hastened towards the seven, while using the Sound Transmission Technique to Fang Wang, “Master, are we really not going to fight to the death?”<br/><br/>It was the first time Xiao Zi had seen Fang Wang be suppressed and its heart sank into despair.<br/><br/>“There’s no need. Let’s follow them for now. They probably don’t want to kill me, simply to seize my body. If we fought desperately, even if we escaped, the Descending Dragon Continent would likely suffer the fallout,” Fang Wang answered using the Sound Transmission Technique, looking ahead.<br/><br/>The seven, who seemed like True Immortals, stood shoulder to shoulder. They stood on the horizon, appearing so transcendent.<br/><br/>Seeing Fang Wang so compliant, Han Huitian retracted his momentum and turned to lead the way.<br/><br/>Song Hanxianzi fell in beside Fang Wang, leaned over to look at him, and said with a smile, “Fang Wang, how old are you this year?”<br/><br/>“Not yet three hundred years old.”<br/><br/>“Tsk tsk, to possess such strength at less than three hundred years old, it seems what they said was right, you truly are the greatest talent since ancient times. You should avoid resisting later, we will not kill you. You could live several more decades at least.”<br/><br/>Fang Wang fell silent and did not respond further.<br/><br/>Song Hanxianzi wore an expression of sincere concern, covered her mouth with a smile and said, “Several decades might see your strength increase by leaps and bounds. Perhaps by then, you might even be able to break free.”<br/><br/>The six people ahead appeared indifferent to her words and continued to lead the way.<br/><br/>Fang Wang glanced at Song Hanxianzi and asked, “Why keep me for several decades? Have you not decided who will seize my body, or are you waiting for me to grow stronger before you do it?”<br/><br/>Song Hanxianzi’s smile grew wider, and she coquettishly raised an eyebrow at Fang Wang, “You really are clever, guessing all correctly.”<br/><br/>“How about spending these last decades with me in cultivation, giving you a taste of the most exquisite pleasures of the mortal realm?”<br/><br/>Upon hearing this, Xiao Zi abruptly raised its head, wanting to shake her off.<br/><br/>“Humph!”<br/><br/>Han Huitian’s cold snort came again, and after laughing a few times, Song Hanxianzi flew toward the other six.\t\t\t\t\t\t</div>", "images": {}, "success": true}