{"id": 242, "url": "https://www.novelhall.com/i-became-an-immortal-on-mortal-realm-32879/14566741.html", "title": "Chapter 242 - Chapter 242: Chapter 239: The Ten Great Saint Generals, Divine Passage Realm Ninth Level", "volume": 3, "volume_title": "Volume 3", "body": "<h1>Chapter 242 - Chapter 242: Chapter 239: The Ten Great Saint Generals, Divine Passage Realm Ninth Level</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 242: Chapter 239: The Ten Great Saint Generals, Divine Passage Realm Ninth Level<br/><br/>Translator: 549690339<br/><br/>The tunnel was long, and every twenty steps, Fang Wang could feel the intricacies of the restrictive enchantments, one layer after another, making the path ahead increasingly spacious and even the light became brighter.<br/><br/>After traveling several miles, a strong light appeared ahead, and Fang Wang followed Tai Xi out of the cave mouth.<br/><br/>Xiao Zi laid on Fang Wang’s shoulder, instinctively closing its eyes, then opened them to look around. Its dragon eyes widened, revealing a sparkle in its gaze.<br/><br/>In front of them stretched continuous green hills, dense forests, and at a glance, all they could see was a vast and majestic scenery, as wide as the sky and as beautiful as a painting.<br/><br/>They stood in front of the cave mouth, with a cliff ahead of them and a dense green forest below.<br/><br/>Fang Wang stepped forward to the edge of the cliff and patted Xiao Zi’s dragon head, who immediately understood and backed off.<br/><br/>At that moment, a soul emerged from the Soul Devouring Gourd on its back—it was Zhao Zhen, who also wanted to join in on the excitement.<br/><br/>Tai Xi looked into the distance and said, “The Heavenly Emperor Avatar of the Hongxuan Emperor will appear soon. In my two previous trials, I faced adversaries with different spells and Divine Skills, so I can’t give you specific advice.”<br/><br/>“No need.”<br/><br/>Fang Wang replied casually as he began to stretch his muscles.<br/><br/>It had been a long time since he’d fought.<br/><br/>No, it was a contest of spells!<br/><br/>Fang Wang began to look forward to this trial, hoping it would be stronger than the Emperor’s Tomb Island.<br/><br/>Tai Xi was also curious about Fang Wang’s strength. She stood in front of the cave mouth, her gaze fixed on the horizon.<br/><br/>Suddenly.<br/><br/>A strong gust of wind swept in from the horizon, shaking the trees of the mountains and forests like waves of green, majestic and unparalleled.<br/><br/>Fang Wang and Tai Xi’s clothes were billowed by the wind, their temples and hair fluttering, yet their eyes did not blink.<br/><br/>A towering figure with a thousand arms and three heads stepped through the air from the horizon—the Heavenly Emperor Avatar of the Hongxuan Emperor.<br/><br/>The thousand-foot-tall Hongxuan Emperor was imposing and brimming with authority; he loomed in the sky like a divine sovereign guarding the Firmament, as if no evil could pass his checkpoint as long as he stood there.<br/><br/>The Hongxuan Emperor didn’t speak. His triple gaze fell on Fang Wang, his eyebrows slightly furrowed.<br/><br/>Fang Wang took the initiative and said, “Aren’t there supposed to be five at the Heaven-Breaking Realm?”<br/><br/>The Hongxuan Emperor’s gaze was deep as he replied, “Haven’t you already received my legacy?”<br/><br/>At his words, Tai Xi looked at Fang Wang in astonishment.<br/><br/>So it turned out that Fang Wang’s refusal of her was not because he found it a hassle, but because he had already received the Hongxuan Emperor’s legacy…<br/><br/>Fang Wang smiled and said, “Someone entrusted me with this task. Furthermore, Your Highness the Great Emperor left countless legacies in the Mortal Realm; surely receiving one doesn’t equate to possessing your entire legacy?”<br/><br/>The Hongxuan Emperor was silent.<br/><br/>After a long while.<br/><br/>“Since you want to take the challenge for her, we must do it differently. You have only one trial, which is to face ten adversaries at the Divine Passage Realm. Defeat them, and you shall receive the legacy,” the Hongxuan Emperor said slowly.<br/><br/>Tai Xi widened her eyes in shock, urgently asking, “Your Highness, you are a well-known Great Emperor in history, perhaps the strongest of all. How can you go back on your word? If you are not willing to grant the legacy, just say so outright.”<br/><br/>In her view, befriending Fang Wang was more valuable than receiving the legacy of the Hongxuan Emperor. After all, she had invested so much, and if Fang Wang died here, the loss would be tremendous.<br/><br/>With Nirvana Realm cultivation and monstrous talent, how could he possibly defeat ten Divine Passage Realm cultivators united?<br/><br/>Tai Xi’s impression of the Hongxuan Emperor plummeted, feeling that he was not living up to the status of a Great Emperor.<br/><br/>The Hongxuan Emperor disregarded Tai Xi and calmly looked at Fang Wang.<br/><br/>Fang Wang curiously asked, “Different souls, different wills?”<br/><br/>The Hongxuan Emperor replied, “It’s just that over the long years, different temperaments have emerged. One day, when three thousand souls unite, you will all see my true self.”<br/><br/>Tai Xi saw Fang Wang seemed ready to accept the challenge and instantly became anxious, “Fang Wang, do not accept the challenge. Here, wounds are real, not illusions, and you could even be in mortal peril. I can continue to assist with the affairs of Kunlun, and if you want to repay me, there will be plenty of opportunities later. There’s no need to be so stubborn this time.”<br/><br/>Fang Wang turned his head and glanced at her sideways with a smile. “Immortal, thank you for your kindness, but you underestimate the Great Emperor’s vision and magnanimity. He is not creating difficulties for me; he’s giving me a chance to perform, perhaps even granting us a legacy far exceeding its original worth.”<br/><br/>The corners of the Hongxuan Emperor’s lips lifted as he drew a circle with one arm in front of him. A giant ring of light emerged, followed by the appearance of ten pitch-black figures stepping forward, each seemingly a Heavenly Emperor Avatar, with different stances and holding different Magical Artifacts. Even without seeing their true faces, they exuded an oppressive aura.<br/><br/>“These ten are the Ten Great Saint Generals under my command, who have swept across the Mortal Realm for me, each a once-in-a-millennium talent. In history, their legends may still linger. Previously, other juniors who came to accept the legacy were defeated by just one of them. Now, you face ten of them united. Prove your talent, Fang Wang. If you can defeat them with the cultivation of the Nirvana Realm against their Divine Passage Realm, I will grant you a great opportunity and will not neglect the girl behind you,” the Hongxuan Emperor’s voice introduced the identities of the ten shadows.<br/><br/>Fang Wang soared into the air, white flames igniting around his body, and he laughed, “Then I hope Your Highness can make them stronger, let them bring forth the power of the Divine Passage Realm Ninth Level!”<br/><br/>The Hongxuan Emperor narrowed his eyes, Tai Xi was moved, and Xiao Zi and Zhao Zhen became excited.<br/><br/>“Nirvana Realm against ten powerful Divine Passage Realm Ninth Level figures, junior, are you certain of this? You were originally facing only the first level of the Divine Passage Realm,” the Hongxuan Emperor’s voice turned cold.<br/><br/>Fang Wang raised his right hand, and the Heavenly Palace Halberd materialized in his grasp. He swung it, sending gusts swirling around him.<br/><br/>When he took out the Heavenly Palace Halberd, it meant he was serious.<br/><br/>The Heavenly Palace Halberd was his mightiest Lifespirit Treasure. Since reaching Nirvana, it had awakened even more terrifying powers, but he had never found the opportunity to use them.<br/><br/>This time, he wanted ten Divine Passage Realm Ninth Level figures to test his limits!<br/><br/>“Precisely! Very well! You are even more audacious than I was back in the day, so let me wait and see!” the Hongxuan Emperor suddenly burst into laughter. His laughter hadn’t even settled when the Ten Great Saint Generals exploded with a fearsome and unparalleled aura.<br/><br/>In an instant, the mountains beneath them crumbled, numerous bits of rubble and dust soared into the sky, and rolling thunderclouds crazily swept in, rapidly darkening the world.<br/><br/>The peak where Tai Xi and Xiao Zi were also trembled violently, on the verge of collapse at any moment.<br/><br/>Outside, the island began to tremble, and all Cheng Clan cultivators could feel a series of heart-palpitating auras.<br/><br/>Cheng Tiance’s face drastically changed as he secretly felt alarmed. He carefully counted and realized, to his astonishment, there were the auras of ten Divine Passage Realm cultivators.<br/><br/>Years ago, he had challenged a Saint General, and the memory of the aura was still fresh in his mind; he couldn’t have made a mistake.<br/><br/>Had the difficulty of the evaluation increased?<br/><br/>Cheng Tiance was both shocked and secretly thrilled.<br/><br/>Fang Wang?<br/><br/>You’re so arrogant, now let’s see what you’re going to do!<br/><br/>Inside the dim world, the ten Saint Generals swiftly shrank in size and then circled around Fang Wang. Even in their reduced form, they still stood thirty feet tall, imposing and majestic.<br/><br/>Fang Wang held the Heavenly Palace Halberd in one hand; both the Heavenly Gang Star Acupoint of the Heavenly Body and the Yang Energy of the Vajra Invincible Saint Body were fully stimulated, the intense flames making him seem like a dazzling sun in the mortal realm, his aura no less inferior than that of the Saint Generals.<br/><br/>Tai Xi watched the battle nervously, utterly astounded in her heart.<br/><br/>Fang Wang always appeared profound and inscrutable on ordinary days, she never imagined that Fang Wang in battle would display such an attitude.<br/><br/>With a demeanor that asked, “Who but me?” and an air of invincibility!<br/><br/>The Ten Great Saint Generals simultaneously shot fierce light from their eyes and almost at the same time, attacked Fang Wang.<br/><br/>With a bang!<br/><br/>A wind as devastating as the end of the world swept across all directions, and even Tai Xi had to activate her Spiritual Power to fend off the windstorm.<br/><br/>Fang Wang and the Ten Great Saint Generals moved with lightning speed, opting not to use long-range spells or Divine Skills in their battle, relying solely on their physical bodies and combat methods.<br/><br/>Fang Wang swung the Heavenly Palace Halberd rapidly. In his hands, the Heavenly Palace Halberd exhibited earth-shaking and terrifying power, each swing capable of raising energy that could cover thousands of miles. The cold light twinkled in the firmament, and as their figures constantly shifted, they resembled stars twinkling across the sky.<br/><br/>Clang!<br/><br/>Fang Wang’s halberd came crashing down, and the world itself seemed on the brink of splitting apart. A Saint General was directly struck down, crashing through the surface of the ground.<br/><br/>He then turned and swept his halberd across, the domineering power causing visible ripples in space, sweeping the energy of this strike towards two Saint Generals!<br/><br/>A furious roar descended from the sky, and a Saint General wielding a large blade was seen furiously slashing down. The blade was twined with purple lightning, connecting heaven and earth, as if splitting the entire world in two.<br/><br/>Fang Wang raised his halberd to block, and a terrifying force, unimaginable in magnitude, pressed him down, crashing between the mountains. His feet shattered peaks, collapsing the ground underneath, sending countless rocks flying up as if from a volcanic eruption.<br/><br/>Fang Wang’s hair whipped about, the corners of his mouth lifted into a smile, revealing excitement in his eyes.<br/><br/>“This is more like it!”<br/><br/>Fang Wang roared, the surging Yang Energy flames bursting out, directly repelling the Saint General above him. He then leapt up, but two Saint Generals immediately attacked him from both sides.<br/><br/>Without waiting for him to change techniques, a figure suddenly appeared in front of him, a blindingly bright light landing on him, rendering him immobile, his pupils dilating dramatically.<br/><br/>Boom! Boom! Boom…<br/><br/>The heavens and earth roared continuously, shaking violently. Even Tai Xi, strong as she was at the ninth layer of Nirvana Realm, could only barely catch glimpses of Fang Wang and the Ten Great Saint Generals, unable to discern their movements.<br/><br/>“So fast… their physiques alone are so incredibly powerful…”<br/><br/>Tai Xi was horrified, feeling that even if she gave her all in the battle, she would be obliterated in an instant.<br/><br/>The aura of the Divine Passage Realm Ninth Level was simply too terrifying!<br/><br/>Just facing their aura was enough to suppress one’s speed, reactions, and all other senses.<br/><br/>Xiao Zi clung tightly to the ground, the Soul Devouring Gourd was blown away, and Zhao Zhen’s soul body was like a flickering candle in the wind, on the verge of extinction, yet he watched Fang Wang with a feverish look in his eyes.<br/><br/>Although he didn’t know how strong the Nirvana Realm and Divine Passage Realm were, he knew how unbelievable it was for someone of the Nirvana Realm to battle against ten cultivators at the Ninth Level of the Divine Passage Realm.<br/><br/>And by the looks of it, Fang Wang had the power to fight!<br/><br/>Boom!<br/><br/>Fang Wang smashed through a mountain, flying backward at high speed, right hand tightly clutching the Heavenly Palace Halberd. Despite being covered in blood, he was excited.<br/><br/>He was testing, testing the limits of the Heavenly Body!<br/><br/>The attack of the Saint General was painful for him but also made his blood boil.<br/><br/>“Predecessor, if your Ten Great Saint Generals only have this much strength, don’t blame me for sweeping them aside!”<br/><br/>Fang Wang’s voice resounded, majestic and lofty, covering all the clamor between heaven and earth.\t\t\t\t\t\t</div>", "images": {}, "success": true}