{"id": 248, "url": "https://www.novelhall.com/i-became-an-immortal-on-mortal-realm-32879/14574454.html", "title": "Chapter 248 - Chapter 248: Chapter 245: The Seven Great Saint Clans", "volume": 3, "volume_title": "Volume 3", "body": "<h1>Chapter 248 - Chapter 248: Chapter 245: The Seven Great Saint Clans</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 248: Chapter 245: The Seven Great Saint Clans<br/><br/>Translator: 549690339<br/><br/>Zhou Xue returned less than half a year later when Fang Wang received the news: the Fang Family called him back.<br/><br/>He saw Uncle Fang Zhen for the last time.<br/><br/>Although Fang Zhen faced the end of his life, he always wore a smile, giving off a sense of a final radiance, and he kept talking to Fang Wang, with words mostly aimed at defending his relationship with Zhou Xue.<br/><br/>Zhou Xue had been away for many years, and Fang Zhen worried about her growing apart from Fang Wang.<br/><br/>Compared to other men, Fang Zhen trusted Fang Wang more and hoped Fang Wang could hold onto Zhou Xue’s heart.<br/><br/>Fang Wang could only agree, thinking to himself how difficult it would be to tether your daughter who’s destined to ascend.<br/><br/>On the third day after seeing Fang Wang, Fang Zhen closed his eyes for good, and while Fang Zhen’s funeral was not meant to be grand, many sects and noble families came to pay their respects because he was Fang Wang’s uncle.<br/><br/>Overall, the funeral was bittersweet. Although the Fang Family Members felt some melancholy, they did not fall into sadness or depression.<br/><br/>Fang Zhen seemed to have started the changing of the guard within the Fang Family; in the years that followed, many of Fang Wang’s elders reached the end of their lives, even his own parents were nearing theirs.<br/><br/>Because of this, Fang Wang began to spend more time with his parents.<br/><br/>Three months after mourning for Fang Zhen, Zhou Xue left the Fang Residence, leaving the Descending Dragon Continent. Before she left, she visited Fang Wang, and the two spent a night alone in the house. Upon her departure, Xiao Zi glared at her, angered but dared not speak out.<br/><br/>Fang Wang’s solitary time with her was only to pass on the essence of the Jiuyou Zizaishu and Formless Zhou Tian Technique to aid her cultivation.<br/><br/>The perceptiveness of the Immortal Venerable was indeed terrifying. Fang Wang felt it wouldn’t take her many years to master the two secret techniques and reach Great Completion, though Great Perfection was uncertain.<br/><br/>Fang Wang’s own ability to practice his own supreme techniques to the level of Great Perfection was not merely a matter of time; he also had the aid of the Heavenly Palace.<br/><br/>Years passed.<br/><br/>Kunlun, opposite Sword Heaven Marsh, became taller, and more disciples from the Tiangong Sect were arriving. According to Qiao Xuan, the Tiangong Sect had started to regard Kunlun as one of the four major projects within the sect, which made Fang Wang curious about what other three marvels could compare to Kunlun?<br/><br/>Regrettably, even when he pressed for answers, Qiao Xuan refused to say more, which made Fang Wang even more reassured about the Tiangong Sect, as they seemed very responsible towards their master.<br/><br/>Seven years later, Fang Wang had reached the seventh layer of the Nirvana Realm.<br/><br/>That year, his father Fang Yin reached the end of his days.<br/><br/>In the last month of Fang Yin’s life, Fang Wang, Fang Ling, and Fang Jing returned to the Fang Residence to be with their parents, living the mundane life of mortals as a family of five.<br/><br/>At noon, in the courtyard.<br/><br/>Fang Wang was accompanying his parents as they watched Fang Jing and Fang Ling spar with their swordsmanship.<br/><br/>Fang Yin sat in the place of honor, his appearance belying the fact that he was over forty and did not look like someone on the brink of death.<br/><br/>Fang Yin said with a laugh, “Watching the two of them, I feel that the future of the Fang Family will surely be bright, especially under your leadership.”<br/><br/>Lady Jiang peeled an orange for Fang Yin, her face also wearing a smile.<br/><br/>Fang Wang nodded and answered, “Father, don’t worry, I will take good care of them.”<br/><br/>Fang Yin then said, “Your grandfather has high hopes for you, but as your father, I wish for you to put yourself above the Fang Family. The heights you’ve reached today have nothing to do with the Fang Family. Even though the Fang Family has set upon the path of cultivation, it ultimately cannot keep up with your pace.”<br/><br/>He turned to look at Fang Wang, his eyes filled with pride and pity.<br/><br/>For over two hundred years, Fang Wang had made a resounding name for himself. Others always praised Fang Wang’s strength, but every time Fang Yin and Lady Jiang heard of Fang Wang’s exploits, they were worried and pained for him.<br/><br/>Having lived nearly three hundred years, and Fang Wang having left the Fang Residence at age sixteen, they always felt they owed him.<br/><br/>“I’ll be careful, you needn’t worry about me,” Fang Wang said with a smile.<br/><br/>If he were to ascend, he would naturally have to sever ties with the Fang Family, but if he were to remain in the Mortal Realm, and since the Fang Family would always be under his watch, then he ought to take care of them.<br/><br/>It is because humans are guided by emotions that they are human.<br/><br/>Fang Wang thus spent the time chatting with his parents, appearing joyous and without a hint of sadness.<br/><br/>Fang Ling and Fang Jing also endeavored to maintain the jovial atmosphere, to prevent Fang Yin’s final years from being marked by sorrow.<br/><br/>Everyone in the Fang Residence knew why Fang Wang had come back, so they went to great lengths to decline visitors seeking Fang Wang and the Fang Residence, keeping it as tranquil as possible.<br/><br/>However.<br/><br/>On the day when only seven days of Fang Yin’s life remained, a letter dropped from the sky into Fang Wang’s yard, landing right before him.<br/><br/>Xiao Zi immediately came over and picked up the letter with her mouth.<br/><br/>Fang Wang opened his eyes and took the letter from her. He unfolded it and read slowly, his expression unchanged.<br/><br/>Curious, Xiao Zi dared not come too close to peek at the letter.<br/><br/>After a while, Fang Wang handed the letter to Xiao Zi, who took it eagerly, laid it on the ground, and examined it closely. Her dragon eyes widened, and her body shook.<br/><br/>“This… Master, we cannot trust it. There must be a scheme!”<br/><br/>Xiao Zi looked up and said angrily.<br/><br/>Fang Wang said expressionlessly, “If someone could deliver this letter to me without anyone the wiser, it means they truly have the power to destroy a continent. Even if they can’t destroy a continent, wiping Grand Qi off the map would be a piece of cake for them.”<br/><br/>Xiao Zi became immediately tense upon hearing this and urged, “Master, if they’re asking you to come out, surely it’s a trap. You can’t go recklessly. These seven great Saint Clans don’t seem simple.”<br/><br/>“And isn’t this a crucial time?”<br/><br/>Xiao Zi was referring to the fact that Fang Wang’s father was nearing his mortality.<br/><br/>Fang Wang looked up towards the horizon, where he could feel an extremely strong presence locking onto Grand Qi, a presence much more powerful than the Divine Passage Realm.<br/><br/>It was not just this presence; from other directions, he sensed danger too. Once war broke out, it was likely to lead to a devastating loss of life, affecting both the Fang Residence and Sword Heaven Marsh as well.<br/><br/>He felt an unprecedented pressure.<br/><br/>Life indeed could not always be smooth sailing; he had finally encountered his own calamity.<br/><br/>Fang Wang stood up and said, “There’s no escape, they have only given me half a day to consider, I have to face it.”<br/><br/>Upon hearing this, Xiao Zi hurriedly raised its dragon form and said, “In that case, Young Master, take me with you!”<br/><br/>Fang Wang had intended to refuse, but thinking of Xiao Zi’s True Dragon Bloodline, he realized that leaving it behind might invite another wave of powerful enemies. This would not only put Xiao Zi in trouble but could also bring trouble to Grand Qi.<br/><br/>If they were to leave, with the face of the Tiangong Sect and Suzhen Palace, no one would come to disrupt the construction of Kunlun.<br/><br/>Fang Wang nodded slightly, and Xiao Zi immediately manifested its true form, allowing Fang Wang to ride it and leave.<br/><br/>He hesitated for a moment, then said, “Wait a moment.”<br/><br/>He teleported to the courtyard where his parents were. At that moment, Fang Jing was sharing his adventures from the End of the Sky; Fang Yin, Lady Jiang, and Fang Ling were listening intently, occasionally burst into laughter at his comical tales.<br/><br/>Fang Wang appeared beside Fang Ling and looked at his parents, saying, “Father, Mother, I need to step out for a while.”<br/><br/>As soon as he spoke, Fang Jing also stopped and looked at him in surprise.<br/><br/>Why would Fang Wang be going out at this critical juncture?<br/><br/>Fang Yin, after spending over a hundred years at the imperial court, asked, “Is there trouble?”<br/><br/>“No trouble, just a matter to take care of, but it’s quite far, and I’m not sure when I’ll return,” Fang Wang replied softly.<br/><br/>Fang Yin looked at him and smiled, saying, “You have your own matters, and as your father, I shouldn’t hold you back. You’ve spent enough time with me. Don’t let it delay you. I am very satisfied and have no regrets. There’s no need for you to watch over me all the time. Even if I were to pass away right now, it wouldn’t be a big deal, because you all must continue with your lives.”<br/><br/>Lady Jiang followed with, “Yes, Wang, go on with your business. In these last few days, your mother will accompany your father. Your matters are more important than our lives or deaths.”<br/><br/>Fang Ling and Fang Jing looked at Fang Wang; they both sensed something was amiss but believed Fang Wang would be able to handle it.<br/><br/>Fang Wang smiled and then proceeded to kowtow three times to Fang Yin, before turning to kowtow to Lady Jiang.<br/><br/>With the Yin Yang Xuan Ming Zhen Gong, he could see a person’s Yang Energy. Lady Jiang’s days were also numbered, and her life force was diminishing faster and faster. She might appear calm, but he guessed she too wished to leave this world with Fang Yin.<br/><br/>After kowtowing, Fang Wang got up and smiled at his parents. He then turned to Fang Ling and Fang Jing to give a few words of instruction before leaping up. Xiao Zi flew out from a courtyard of the Fang Residence, quickly catching Fang Wang.<br/><br/>Fang Yin and Lady Jiang watched as Fang Wang flew away on the dragon, both with smiles on their faces.<br/><br/>“Husband, doesn’t Wang look like an Immortal?”<br/><br/>“Riding a dragon through the Mortal Realm, he has long become an Immortal.”<br/><br/>“Yes, how did we manage to give birth to an Immortal?”<br/><br/>“Hahaha, isn’t it because of my good seed?”<br/><br/>“Oh, stop it.”<br/><br/>“My dear, don’t worry, Wang will be alright. His achievements in the future are beyond our imagination. To be his parents for a lifetime is already the fortune of a hundred lifetimes for us.”<br/><br/>“I certainly believe in him. I just feel that becoming an Immortal is not necessarily all that great. I hope Xue can accompany him forever, so he won’t be so lonely.”<br/><br/>Fang Ling and Fang Jing listened quietly, but they could no longer smile.<br/><br/>Xiao Zi’s speed was very fast, heading westward, and in less than an hour it flew out of the continent.<br/><br/>During the flight, Xiao Zi was very nervous, its dragon eyes scanning around, but with its current realm, it could not detect presences beyond the Divine Passage Realm.<br/><br/>Fang Wang stood at the Dragon Head, calmly looking ahead.<br/><br/>The ocean to the west of the Descending Dragon Continent was vast, and the islands were denser than in other sea regions. From high above, they appeared as pebbles scattered across the blue-green sea, a limitless view that was refreshing to the soul.<br/><br/>Fang Wang could feel those powerful presences aimed at the Descending Dragon Continent shifting their focus to follow him.<br/><br/>Streams of divine consciousness swept frantically over his mortal frame, lingering on Xiao Zi.<br/><br/>The Great Cultivators could not capture Fang Wang’s figure, so they focused on Xiao Zi, making it feel even more uneasy, as if it were thornbacked.<br/><br/>Soon, Fang Wang saw two figures appearing on the horizon to the left and right. Clearly, they were not reassured, and, unable to track Fang Wang with their divine consciousness, they had to get closer to observe his movements with their own eyes.<br/><br/>Fang Wang did not stop, trying to put as much distance as possible between himself and the Descending Dragon Continent.<br/><br/>He believed the seven Saint Clans would not target the Fang Family directly, as their ultimate target was him.<br/><br/>Another hour passed, and then a terrifying aura arrived:<br/><br/>“That’s enough, stop here!”<br/><br/>A voice full of majesty rang out, its tone brimming with an oppressive force, as if the heavens themselves were bellowing, with Heavenly Might sweeping across.\t\t\t\t\t\t</div>", "images": {}, "success": true}