{"id": 244, "url": "https://www.novelhall.com/i-became-an-immortal-on-mortal-realm-32879/14572550.html", "title": "Chapter 244 - Chapter 244: Chapter 241: When One Man Gains Enlightenment, Even His Pets Ascend To Heaven", "volume": 3, "volume_title": "Volume 3", "body": "<h1>Chapter 244 - Chapter 244: Chapter 241: When One Man Gains Enlightenment, Even His Pets Ascend To Heaven</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 244: Chapter 241: When One Man Gains Enlightenment, Even His Pets Ascend to Heaven<br/><br/>Translator: 549690339<br/><br/>Tai Xi accepted the jade pendant, her face showing delight, and then she bowed towards the cave tunnel and said, “Thank you for the inheritance, Senior. This junior will strive hard in her cultivation and not let Senior down.”<br/><br/>Fang Wang followed with a gesture of salute.<br/><br/>“Fang Wang, from now on, don’t involve yourself with my legacy anymore, and give other descendants a chance,”<br/><br/>the voice of the Hongxuan Emperor sounded again, this time with a hint of helplessness in his tone.<br/><br/>Fang Wang replied with a smile, “Actually, I didn’t want to come.”<br/><br/>Tai Xi quickly added, “That’s right, Senior, it was me who asked him over and over again to come, it won’t happen again.”<br/><br/>The voice of the Hongxuan Emperor did not respond again.<br/><br/>Fang Wang and Tai Xi exchanged a glance, then the two of them turned and left.<br/><br/>Xiao Zi lay on Fang Wang’s shoulder, its dragon body now much larger than the serpentine form of the past, almost as big as Fang Wang himself. It asked incessantly and excitedly, as if it too received the fate of the Hongxuan Emperor.<br/><br/>Once they exited the cave entrance, they were met with a barrage of gazes settled upon them.<br/><br/>The expressions of the Cheng Clan cultivators fluctuated, the earlier commotion was truly terrifying, spawning endless speculation. But fortunately, Fang Wang and Tai Xi emerged so soon.<br/><br/>Coming out so quickly meant that they likely failed.<br/><br/>Cheng Tiance fixed his gaze on Fang Wang, sensing that Fang Wang had undergone some indescribable changes, and so he asked, “Was your venture a success, Fellow Cultivator?”<br/><br/>Tai Xi was about to speak, but Fang Wang interrupted, “Not really. Continue with your efforts, we should be leaving.”<br/><br/>After saying that, Xiao Zi soared into the sky, revealing its true form, and Fang Wang rode upon the dragon, with Tai Xi following closely behind.<br/><br/>The Cheng Clan cultivators turned their gaze towards Cheng Tiance, awaiting his orders.<br/><br/>Cheng Tiance’s expression changed from dark to light, but in the end, he didn’t dare to stop Fang Wang and the others.<br/><br/>He turned towards the entrance of the cave and said in a deep voice, “Let the next group enter and see if the inheritance still remains.”<br/><br/>“Yes!”<br/><br/>The Cheng Clan cultivators answered in unison.<br/><br/>Elsewhere, Xiao Zi and the fiery bird traveled at an extremely fast pace, quickly widening the distance by hundreds of miles.<br/><br/>Tai Xi stood on the fiery bird, turning her head to look at Fang Wang and mused, “I hadn’t realized you appeared to be bold and unconstrained yet possess such careful and detailed thought.”<br/><br/>Gazing at the horizon, Fang Wang said, “The inheritance of the Hongxuan Emperor is something you won’t be able to master in a short amount of time. As long as you haven’t mastered it, if you don’t speak of it, no one will know you’ve received the inheritance. The Hongxuan Emperor naturally wouldn’t speak either, so why attract trouble before it’s necessary?”<br/><br/>“Even the smallest of flies, buzzing incessantly around one’s ears, can be bothersome,”<br/><br/>Tai Xi nodded with a smile, her eyes sparkling as she looked at Fang Wang. Beyond the inheritance, the previous great battle had exhilarated her; she couldn’t calm her emotions. In her heart, Fang Wang had become the world’s number one talent, and she even developed an admiration for him.<br/><br/>Having lived for hundreds of years, this was the first time she had such feelings for a man younger than herself. To be precise, apart from her master, she had never admired anyone else to this extent.<br/><br/>Today, she truly widened her horizons.<br/><br/>As the two chatted along the way, Tai Xi increasingly displayed the demeanor of a young girl, her tone cheerful, and Fang Wang worried that she might develop feelings for him.<br/><br/>But since she hadn’t confessed, he couldn’t simply reject her outright; how awkward would that be?<br/><br/>Moreover, Suzhen Palace was about severing emotions and questioning the path; Tai Xi would not fall in love in this life.<br/><br/>An hour later.<br/><br/>Five great cultivators from the Cheng Clan emerged from the cave entrance, all injured and in a state of disarray.<br/><br/>“We failed, but the inheritance should still be there. The Hongxuan Emperor didn’t mention the situation of Fang Wang and Tai Xi. A Saint General of the Divine Passage Realm is really too strong. With just the two of them, they were naturally defeated quickly,” said an elder solemnly, his voice reflecting the fear he felt.<br/><br/>Cheng Tiance took a deep breath, his eyes hardening, and said sternly, “Continue to recuperate; we must obtain the Great Emperor’s inheritance!”<br/><br/>Ten days later, Fang Wang and Xiao Zi returned to Sword Heaven Marsh, while Tai Xi parted ways with him on the road, preparing to return to Suzhen Palace to seclude herself and ponder the Hongxuan Emperor’s inheritance.<br/><br/>Fang Wang sat cross-legged at the head of the bridge, beginning to feel the Hongxuan Emperor’s fate.<br/><br/>He could sense the fate upon him but was only able to perceive without fully comprehending the specifics of this fate.<br/><br/>Even without clarity, Fang Wang was filled with interest.<br/><br/>Ever since mastering the Formless Zhou Tian Technique, he could sense fate and causality and was very curious about such profound and mysterious things.<br/><br/>By understanding fate and causality, one could deduce a person’s life and even predict the future. Such abilities are essential for Immortal Gods.<br/><br/>In Fang Wang’s view, if one only had great combat power, no matter how strong, it was meaningless. Real Immortal Gods have omnipotent abilities, including predicting the future and seeing true foundations.<br/><br/>After carefully feeling for a while, he suddenly realized that his own fate was influencing the fate of the other Fang Family Disciples within Sword Heaven Marsh.<br/><br/>Now, this was interesting.<br/><br/>The stronger the fate, the smoother one’s life experiences and the more likely one is to encounter chances, reducing the possibility of developing a Heart Demon.<br/><br/>Could it be that the Great Emperor’s fate granted by the Hongxuan Emperor not only affected him but also the Fang Family?<br/><br/>Truly, when one person attains enlightenment, even their poultry and dogs ascend to heaven.<br/><br/>After feeling for half an hour, Fang Wang finally withdrew his thoughts.<br/><br/>Perhaps his cultivation was insufficient, and forced comprehension was pointless. It would be better to become stronger first.<br/><br/>It was time to attempt breaking into the Heaven-Breaking Realm!<br/><br/>After clashing with a cultivator at the ninth level of the Divine Passage Realm, Fang Wang urgently wanted to improve his cultivation, viewing the Nirvana Realm as wholly insufficient.<br/><br/>Fang Wang closed his eyes, preparing for a long-term seclusion.<br/><br/>Clouds churned and dust billowed over a landscape strewn with volcanoes as far as the eye could see.<br/><br/>Halfway up one volcano, Fang Zigeng sat cross-legged within the magma, bubbles continuously surfacing with heat that made the very space around him ripple.<br/><br/>The Extremely Evil Old Immortal sat by the pool, a small cauldron before him holding several souls, male and female alike, that floated like ghostly shadows, enduring agony.<br/><br/>“Not bad, you have the potential to cultivate a saintly physique that hardly ever emerges through the ages,” the Extremely Evil Old Immortal praised.<br/><br/>“Your aptitude is mediocre, and even with the integration of a demon soul, it won’t change your foundation. But your temperament is quite good. Enduring such pain isn’t something that hatred alone can fortify. To some extent, you’re also a genius.”<br/><br/>Unmoved by the praise from the Extremely Evil Old Immortal, Fang Zigeng continued to cultivate with his eyes closed.<br/><br/>At that moment, the earth beside the Extremely Evil Old Immortal began to shift, and a skeletal hand emerged, clawing its way up. Soon, an entire skeleton stood beside him.<br/><br/>“Old Immortal, the Heart-Centering Ice Solution you asked for was seized by a power of Fate. That power has experts as numerous as clouds, and we alone cannot retrieve it,” the skeleton knelt on the ground and said, its voice ancient and feeble.<br/><br/>The Extremely Evil Old Immortal calmly said, “In a few days, you lead the way; I will go and slaughter them, a fine opportunity to refine millions of souls for this lad, recreating his Lifespirit Treasure.”<br/><br/>Upon hearing this, the skeleton re-submerged into the earth as if it had never appeared.<br/><br/>Fang Zigeng opened his eyes, staring at the Extremely Evil Old Immortal, and inquired, “What treasure requires millions of souls?”<br/><br/>The Extremely Evil Old Immortal sneered, “It’s naturally a treasure that surpasses the heavenly primal. Lad, you will bear unimaginable karma and sins. In time, everyone might become your enemy. Even if you kill me, life will not be easy for you hereafter. Either you keep killing until you reach the Saintly Emperor Certification, or you become a scourge upon the world, to be eradicated by a savior, granting others the chance to ascend.”<br/><br/>Fang Zigeng was not frightened but instead cracked a smile, murmuring to himself, “Really? Well, if I could become a savior, that would indeed be a good thing.”<br/><br/>Suddenly, cries and screams erupted from within the cauldron, desperate and hair-raising.<br/><br/>The Extremely Evil Old Immortal remained indifferent, continuing his incantations, making the cries grow fainter and fainter.<br/><br/>Fang Zigeng watched the scene, silent. He had no sympathy to spare for others, not even for himself.<br/><br/>Time marched on.<br/><br/>Thirty years slipped by in an instant, and the Mortal Realm was greeted with a new vitality.<br/><br/>Thirty years later, Fang Wang had reached the fifth level of the Nirvana Realm. His rate of cultivation still rapid, given that Dugu Wenhun, who had previously cultivated at a higher level, barely managed to break through the first level of the Nirvana Realm a few years ago, while The Three Immortals of the Emperor Sea still could not touch the barrier of the Heaven-Breaking Realm, having reached the limits of their lifetimes.<br/><br/>Today’s Sword Heaven Marsh was busier than thirty years ago. Behind the trees opposite Fang Wang Lake, the outline of a mountain range was visible. Looking up, the mountain was teeming with figures.<br/><br/>One day, Fang Wang opened his eyes and stretched languidly.<br/><br/>He slowly stood up and began to limber up.<br/><br/>After a while, a figure crossed the wooden bridge.<br/><br/>It was Fang Hanyu.<br/><br/>Decades passed, and Fang Hanyu’s bearing had become even more distinguished. Clothed in a robe of cyan and blue, a sword hanging at his waist, the years had smoothed the youth from his face, and the stubble did not make him look unkempt but rather lent him an air of effortless freedom.<br/><br/>He stopped behind Fang Wang, his lips curving into a smile as he softly chuckled, “Zhou Yu, it’s been a long time.”<br/><br/>Without turning, Fang Wang smiled and said, “Kong Ming, after decades, your Sword Intent surged dramatically, completely transformed.”<br/><br/>Suddenly, Fang Hanyu drew his sword, pointing it towards Fang Wang, his gaze sharply intensifying. A terrifying Sword Intent erupted, pausing even the mist above the lake.<br/><br/>In that instant, the entire Sword Heaven Marsh felt Fang Hanyu’s Sword Intent.<br/><br/>Gu Tianxiong, who was playing chess with someone, turned his head to look and murmured, “Such strong Sword Intent, who could it be? In that direction… It should not be Fang Wang; to him, it would be far too weak.”<br/><br/>He didn’t dwell on it and continued his game.<br/><br/>The Sword Cultivators on the lake who were contemplating their swords also wondered but were not unsettled.<br/><br/>No one in the world could threaten Fang Wang.<br/><br/>“My sword, is it qualified to challenge you?” Fang Hanyu squinted at Fang Wang and asked.<br/><br/>Fang Wang turned, tilting his head haughtily as he smirked, “Far from enough.”<br/><br/>No sooner had he spoken than Fang Wang lunged at Fang Hanyu.<br/><br/>So fast!<br/><br/>Fang Hanyu’s pupils shrunk instantly, his Sword Intent dispersing forthwith.<br/><br/>Fang Wang’s finger, posed as a sword, hovered over Fang Hanyu’s forehead, tousling his hair.<br/><br/>Fang Hanyu stood there dumbfounded for quite some time before he managed a wry smile and sheathed his sword.<br/><br/>Fang Wang withdrew his hand and looked him over.<br/><br/>This lad has had quite the fortune.<br/><br/>He has reached the eighth level of the Cross-Void Realm!<br/><br/>Fang Hanyu sighed and said, “These past years, I’ve come across no small amount of fortune, quite a transformation. I never aimed to surpass you, but I thought at least we could spar. Alas, even if you have always been here in Sword Heaven Marsh, you’re not someone I can catch up with.”<br/><br/>He sounded disheartened, yet his face was filled with smiles.\t\t\t\t\t\t</div>", "images": {}, "success": true}