{"id": 240, "url": "https://www.novelhall.com/i-became-an-immortal-on-mortal-realm-32879/14554541.html", "title": "Chapter 240 - Chapter 240: Chapter 237: The Future Palace Master, The Momentum Of Fang Wang", "volume": 3, "volume_title": "Volume 3", "body": "<h1>Chapter 240 - Chapter 240: Chapter 237: The Future Palace Master, The Momentum Of Fang Wang</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 240: Chapter 237: The Future Palace Master, The Momentum of Fang Wang<br/><br/>Translator: 549690339<br/><br/>Ever since the Qiao Clan of the Tiangong Sect began constructing Kunlun, Fang Wang had Dugu Wenhun assist with the coordination, while he himself focused on cultivation.<br/><br/>With Qiao Xuan and Qiao Li leading the Qiao Clan, they seldom sought out Dugu Wenhun, allowing him more time for cultivation as well.<br/><br/>The construction of Kunlun was a significant event, even recognized by the Emperor of Grand Qi as a timeless achievement for Grand Qi. The Emperor of Grand Qi dispatched soldiers from various regions to guard the borders of Kunlun, forbidding mortals from disturbing the site.<br/><br/>Yet, despite this, a steady stream of cultivators still went to observe.<br/><br/>By the shores of Sword Heaven Marsh.<br/><br/>Xiao Zi, Gu Tianxiong, Zhao Zhen, and a group of sword cultivators stood by the lakeside, discussing Kunlun as they watched the dust rise in the distant sky.<br/><br/>“The Tiangong Sect is extraordinary indeed, managing to transport rocks and mountains over such long distances.”<br/><br/>“It’s not just transportation—they’ve also moved mountains from the seabed. It’s astounding.”<br/><br/>“At this rate, how many years will they need to keep moving mountains?”<br/><br/>“My master said, it is the passage of years that lends weight. The Qiao Clan is prepared to move mountains for generations. And who among you could be sure to witness the day when Kunlun’s construction is complete?”<br/><br/>Xiao Zi’s words left the others feeling helpless. Though her words were hurtful, they were indeed the truth.<br/><br/>They might not live to see the day when Kunlun is completed.<br/><br/>Merely fantasizing about Kunlun filled their hearts with anticipation.<br/><br/>It was hard to imagine that the highest mountain and the grandest daoist temple in the mortal realm would be established across the lake.<br/><br/>Now, looking out, the view was open. What a spectacular sight it would be if Kunlun were to appear on the other side of the lake?<br/><br/>Elsewhere.<br/><br/>Fang Wang sat cross-legged on a wooden bridge, surrounded by Ling Wu mist that made his figure appear intermittently.<br/><br/>The outside clamor did not affect him; the Heart of the Heavenly Dao allowed him to block out perception of the external world.<br/><br/>He slowly opened his eyes and calculated with his fingers.<br/><br/>Two years of cultivation had gone by, and the construction of Kunlun had continued for two years as well.<br/><br/>After two years, the shadow of Kunlun was still not visible, but the southern horizon was always shrouded in rising dust.<br/><br/>With a thought, Fang Wang sent a psychic message to Song Jinyuan.<br/><br/>Before long, Song Jinyuan arrived at the bridge with a woman, who was none other than Tai Xi from Suzhen Palace.<br/><br/>After showing the way, Song Jinyuan turned and left. Standing behind Fang Wang, Tai Xi raised her hand in a salute and smiled, “Tai Xi from Suzhen Palace meets the Dao Friend again. Hearing that you wish to build a daoist temple, I’ve traveled far and wide. I never imagined that the temple you speak of is for the benefit of future generations. Your foresight is admirable.”<br/><br/>Fang Wang did not rise, but with his back to Tai Xi, he asked, “Miss, could it be that you have come again concerning the inheritance of the Hongxuan Emperor?”<br/><br/>“To tell you the truth, that is indeed the case. Since we last parted, I led a group to challenge it once more, but alas, we suffered a bitter defeat.”<br/><br/>Tai Xi spoke of this matter with a slight shake of her head, seemingly frustrated.<br/><br/>Fang Wang did not respond.<br/><br/>Tai Xi continued, “The matter of Kunlun is a plan spanning a hundred, or even a thousand years. Relying solely on the resources of Grand Qi, or even this continent, it would be difficult to achieve the results you desire. I can provide long-term support for you.”<br/><br/>“Miss, you should consider carefully whether it is worth it.”<br/><br/>“Regardless of what the Hongxuan Emperor’s inheritance may be, the opportunity to win you over and establish a relationship with you is worthwhile.”<br/><br/>Tai Xi spoke earnestly, her eyes fixed on the fading figure of Fang Wang in the mist, filled with anticipation.<br/><br/>In recent months, Tai Xi indeed brought a multitude of resources, including special ores, Heavenly Materials and Earthly Treasures, materials for forbidden rituals, and more. At the very least, Qiao Xuan and Qiao Li were very satisfied. Fang Wang took note of all this.<br/><br/>“What is your position in Suzhen Palace?” Fang Wang’s voice rose again.<br/><br/>He had previously inquired about Suzhen Palace from The Three Immortals of the Emperor Sea and learned that the palace came from a distant region of the sea, did not engage in power struggles and, like Descending Dragon Mountain, was considered a secluded cultivation sect with profound heritage.<br/><br/>Tai Xi replied, “I am the eldest disciple of Suzhen Palace, and the future palace master.”<br/><br/>Her claim was somewhat bold, as the struggle for the position of palace master was uncertain, but she needed such a promise to negotiate for herself.<br/><br/>Fang Wang was silent for a moment before finally saying, “Tell me about it then, what is the nature of that inheritance trial?”<br/><br/>Tai Xi’s eyebrows lit up with joy as she hurriedly recounted her previous experiences.<br/><br/>Nirvana Realm fighting the Heaven-Breaking Realm, then challenging the Divine Passage Realm?<br/><br/>Interesting!<br/><br/>The trial set by the Hongxuan Emperor was as stringent as ever, almost as if he had no intention of passing it on to the next generation.<br/><br/>Fang Wang chuckled softly, “Rest here for a few years. Once I make a breakthrough in my minor realm, I will accompany you to give it a try. Once I start cultivating, I prefer not to leave things half-finished.”<br/><br/>Hearing this, Tai Xi quickly replied, “Of course, there’s no problem. Please continue your cultivation, Dao Friend; I won’t disturb you any longer.”<br/><br/>After speaking, she promptly saluted and then turned to leave.<br/><br/>Fang Wang did not dwell on it and continued his cultivation.<br/><br/>In his view, this matter was just a minor affair. If it could garner the support of Suzhen Palace, then it would be quite favorable indeed.<br/><br/>Tai Xi’s identity had not spread throughout Sword Heaven Marsh, but from that day forward, Sword Heaven Marsh gained a celestial maiden. Any male cultivator who witnessed her grace remembered her vividly and even discussed her out of curiosity in their private conversations.<br/><br/>By the seaside.<br/><br/>A stone tower had been constructed on the beach, standing two hundred zhang tall. At the top of the tower was a spacious hall where Qiao Xuan, Qiao Li, and several elders were seated in meditation. In front of them hovered a phantom image of a mountain that was subtly shifting in shape.<br/><br/>The Qiao Clan cultivators were envisioning the mountainous landscape of Kunlun, as well as the specifics of each restriction and formation.<br/><br/>At that moment, a young disciple hurried over from the entrance, approached Qiao Xuan from behind, whispered a couple of sentences, and then stood up to leave.<br/><br/>Qiao Xuan could not help but laugh, “Who would have thought Tian Dao would have such fortune, to have the Tai Xi Celestial Maiden, the head disciple of Suzhen Palace, contribute so much.”<br/><br/>Upon hearing this, the other elders revealed smiles.<br/><br/>“These two are indeed made for each other, both among the top talents of men and women.”<br/><br/>“I actually think the Tai Xi Celestial Maiden is far inferior to Tian Dao.”<br/><br/>“That’s inevitable. Even our Tiangong Sect places high hopes on Tian Dao Fang Wang. It’s only natural for Suzhen Palace to want to get involved.”<br/><br/>“This is a good thing. To build the Mortal Realm’s number one daoist site indeed requires an immeasurable amount of resources. Relying solely on the wealth of the Qiao Clan and Tian Dao would be difficult. The support from Suzhen Palace is worth more than the entire Descending Dragon Continent combined.”<br/><br/>“It is just unknown whether this is Tai Xi’s personal wish or the stance of Suzhen Palace.”<br/><br/>“That doesn’t matter. The Tai Xi Celestial Maiden will sooner or later become the palace master, a Great Saint. She will continuously attract folks who assist in the dao. Tian Dao’s fate has been determined; it is simply waiting to soar to the heavens.”<br/><br/>The people discussing Fang Wang’s future all wore smiles on their faces.<br/><br/>Because of Fang Wang, they saw not only the greatest hope of their lives but also a brighter future for the Qiao Clan. Therefore, they were full of affection and anticipation for Fang Wang, considering him one of their own.<br/><br/>Meanwhile, various powers that had been keeping an eye on the Qiao Clan also obtained intelligence.<br/><br/>Mysterious forces were continuously bestowing resources to Tian Dao, an endless stream of immeasurable value.<br/><br/>This shook quite a few powers, and immediately there were sects sending large quantities of Spirit Stones.<br/><br/>The construction materials needed for Kunlun were very special, hard for sects in the continent to obtain, so they could only present Spirit Stones, believing the Qiao Clan could procure the needed materials.<br/><br/>In the Mortal Realm, Spirit Stones were the universal currency because they could help living beings cultivate. Even the Demon Race used Spirit Stones for transactions.<br/><br/>Suddenly, Sword Heaven Marsh became lively again. Gradually, cultivators from beyond the continent arrived, with some wanting to befriend Fang Wang and others wishing to catch a glimpse of Kunlun’s appearance.<br/><br/>Another two years passed.<br/><br/>Fang Wang finally made a breakthrough to the second layer of the Nirvana Realm, and the breakthrough of such minor realms no longer surprised him.<br/><br/>“It’s a pity I can’t create too much disturbance. Hopefully, the Tiangong Sect will satisfy me,” Fang Wang thought to himself. In his vision for Kunlun, he had mentioned Earth Spirit Qi. The Tiangong Sect had a way to introduce Earth Spirit Qi into Kunlun. Once that happened, he could gather Qi without inhibitions and not worry about affecting Grand Qi.<br/><br/>He stood up and walked towards the lake.<br/><br/>He followed the path to Gu Tianxiong, who was standing on the lake’s surface, eyes closed as if comprehending the sword.<br/><br/>Suddenly, he reached out, grabbed toward the lake, and caught a goldfish in his hand. Then he opened his eyes and smiled.<br/><br/>“Big Brother Gu, you spend your days not practicing the sword, nor returning to the Gu Family. Can you really calm your mind?” Fang Wang’s voice came from behind, startling Gu Tianxiong so that he almost let the goldfish escape.<br/><br/>The fish here had entered the realm of demon creatures, after all, they absorbed Earth Spirit Qi all year round. Some fishes could even expel Sword Qi, which had once caused panic in Sword Heaven Marsh.<br/><br/>Gu Tianxiong laughed, “Of course, I can. I’ve already passed on the position of the family head to the younger generation. I just like staying in Sword Heaven Marsh—most here are Sword Cultivators, and they are wanderers from all over. Talking to them is extremely interesting.”<br/><br/>Fang Wang chuckled and inquired, “What about Miss Gu, any news from her lately?”<br/><br/>Gu Tianxiong replied, “Last year, news came that she joined a master from Suzhen Palace. But I haven’t really heard of Suzhen Palace before. My daughter is grown now; I’ll let her be. After all, you’re not interested in her.”<br/><br/>As he spoke, there was a tinge of grievance in his tone.<br/><br/>After all, it was about his beloved daughter, and his heart surely leaned towards Gu Li.<br/><br/>Suzhen Palace?<br/><br/>What a coincidence?<br/><br/>Fang Wang kept a neutral expression, but his mind was filled with curiosity. He decided to ask Tai Xi about it later.<br/><br/>The two chatted for a while before Fang Wang finally left.<br/><br/>In the following five days, Fang Wang wandered inside Sword Heaven Marsh to relax, which excited those cultivators who were seeing Fang Wang for the first time.<br/><br/>After five days, Fang Wang, accompanied by Xiao Zi, found Tai Xi, and they quickly left Sword Heaven Marsh.<br/><br/>Xiao Zi revealed her true form, and Tai Xi also pulled out the hairpin from her head, manifesting into a phoenix. The two rode the dragon and stepped on the phoenix, a spectacular sight against the ocean sky.<br/><br/>“Celestial Maiden, has Suzhen Palace recently been developing towards the surrounding seas?” Fang Wang turned his head to ask.<br/><br/>Upon hearing this, Tai Xi giggled softly and replied, “Indeed. Since four years ago, after I sent a message to my sect, the elders have been very supportive. I’ve been going with the flow, looking to recruit disciples in the seas around Descending Dragon Continent and to develop closer to it. Since I’m the future palace master and Kunlun will take hundreds of years to establish, I have to assist Tian Dao for many years.”<br/><br/>Listening to her, Fang Wang felt somewhat reassured in his heart.<br/><br/>Tai Xi blinked and asked, “Tian Dao friend, is there someone related to you who has joined Suzhen Palace? Feel free to mention her name, and I’ll definitely take care of her.”\t\t\t\t\t\t</div>", "images": {}, "success": true}