{"id": 247, "url": "https://www.novelhall.com/i-became-an-immortal-on-mortal-realm-32879/14574453.html", "title": "Chapter 247 - Chapter 247: Chapter 244: What Is A Person Of Destiny", "volume": 3, "volume_title": "Volume 3", "body": "<h1>Chapter 247 - Chapter 247: Chapter 244: What Is A Person Of Destiny</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 247: Chapter 244: What is a Person of Destiny<br/><br/>Translator: 549690339<br/><br/>Fang Wang watched Zhou Xue for a while before withdrawing his gaze, waiting for her outcome.<br/><br/>Sitting beside Zhou Xue, Fang Wang realized he couldn’t sense the depth of her cultivation. Her aura was present, yet as natural as all things in heaven and earth.<br/><br/>Although Zhou Xue had been reborn, she had cultivated for over two hundred years in this life. It was possible she had already become an Immortal, just with an insufficient realm.<br/><br/>Fang Wang always felt that measuring the essence of life with cultivation realms was too superficial, especially as his own cultivation grew higher. He increasingly realized that Cultivation wasn’t merely about becoming stronger.<br/><br/>So he quietly felt Zhou Xue’s aura and pondered over his own path of Cultivation.<br/><br/>After a long time.<br/><br/>Zhou Xue raised her eyes and passed the bronze mirror to Fang Wang.<br/><br/>“He wants to resurrect, and although I’ve heard in The Upper Realm that he’s brought disaster to the Mortal Realm, that’s just The Upper Realm’s judgment. If the saints and Great Emperors of the Mortal Realm don’t obey them, they’ll be labeled as demons. It’s unreliable. We only need to consider what he can bring us,” she said.<br/><br/>“I heard you want a Cultivation Technique. I support you, but even the most powerful treasures can bring great karma if they’re not forged by oneself. Who knows what kind of entanglements his karma could bring. I suggest you wait until you reach the Heaven-Breaking Realm before deciding whether to help him. After all, he’s not lacking a hundred years or so.”<br/><br/>Zhou Xue spoke earnestly, Fang Wang placed the bronze mirror inside the Dragon Jade Ring and slowly nodded.<br/><br/>Zhou Xue followed with a teasing tone, “I can tell that in his past life he didn’t achieve Saintly Emperor Certification. Probably was at the Celestial Qiankun Realm. Even if he has any schemes, you should be able to handle it.”<br/><br/>A Saint or a Great Emperor?<br/><br/>Fang Wang suddenly felt disappointed and his interest in Li Dai’s Cultivation Technique waned significantly.<br/><br/>Zhou Xue saw through his thoughts but did not continue to persuade.<br/><br/>“By the way, if I inherit the fate of a saint or a Great Emperor, and not just one type of fate, is that a good or a bad thing?” Fang Wang asked.<br/><br/>Zhou Xue listened and said meaningfully, “For others, blessings and catastrophes are interdependent, and it’s more likely to be a disaster. But for you, who has perfected the Formless Zhou Tian Technique, there are only benefits. The true intricacies of the Formless Zhou Tian Technique will become more powerful as you absorb more fate.”<br/><br/>“It’s like this opportunity. It’s as though the Great Emperor’s fate is helping you from the shadows. Since ancient times, saints and emperors have been the darlings of heaven and earth. Once they become saints or emperors, heaven and earth help them naturally.”<br/><br/>Fang Wang also thought so. The Hongxuan Emperor’s fate was helping him in the shadows.<br/><br/>“Can you teach me the method of fate?” Fang Wang looked at Zhou Xue and asked softly.<br/><br/>He found himself asking Zhou Xue for Cultivation Techniques and heritage without any psychological burden increasingly.<br/><br/>Zhou Xue shook her head and said, “Your realm isn’t high enough. You can only sense fate but can’t cultivate the way of fate. Once you reach the Celestial Qiankun Realm, you can start to delve into the way of fate. To do so prematurely will only lead to your doom.”<br/><br/>“Didn’t you say that the Ji Family has a person who knows his destiny? Has he reached the Celestial Qiankun Realm?” Fang Wang asked.<br/><br/>Zhou Xue replied, “I’m not sure about that. I’m also investigating the Ji Family’s background. I originally thought they were hidden on this continent, but they moved out completely two hundred years ago. Maybe they predicted our existence. The Ji Family is not simple; they might become our strong opponents once we reach the pinnacle of the Mortal Realm.”<br/><br/>Fang Wang raised an eyebrow, “Are they bound to become enemies?”<br/><br/>Zhou Xue shrugged and said, “Like the positions for ascension, there are only nine. I want half of them, and the rest will naturally compete.”<br/><br/>Indeed.<br/><br/>Fang Wang smiled, his eyes becoming sharp.<br/><br/>If they were to compete, he would not fear the Ji Family.<br/><br/>No matter how many families came along, he would fight for Zhou Xue, for the Fang Family!<br/><br/>The two continued to sit on the bridge, talking about Zhou Xue’s experiences over the years.<br/><br/>After she spoke for an hour, Zhou Xue suddenly inquired, “What about the Tai Xi Celestial Maiden from the Suzhen Palace?”<br/><br/>“Hm? What about her?” Fang Wang asked in surprise.<br/><br/>How did she know about the Tai Xi Celestial Maiden?<br/><br/>Goodness!<br/><br/>There were spies from the Jin Xiao Sect in the Sword Heaven Marsh!<br/><br/>Zhou Xue said with a half-smile, “The Tai Xi Celestial Maiden is the future leader of the Suzhen Palace and will become one of the foremost figures in the Celestial Qiankun Realm. Moreover, she’s unparalleled in beauty and talent in the Mortal Realm. If you have feelings for her, I will help you break the rules of the Suzhen Palace in the future.”<br/><br/>Fang Wang rolled his eyes and said, “What are you talking about? I haven’t taken an interest in her.”<br/><br/>“The Suzhen Palace indeed has a profound heritage, wealth, and power. My Jin Xiao Sect is still growing and can’t support you the way the Suzhen Palace can. I actually think that if you could secure the Suzhen Palace leader, it would be beneficial. If Kunlun succeeds, your name, Fang Wang, will be everlasting,” Zhou Xue said with a smiling tone.<br/><br/>Fang Wang couldn’t take it anymore and quickly gestured with his hands, “Stop it, don’t test me anymore, be careful I really capitulate. I’m not as steadfast as I appear to be.”<br/><br/>Zhou Xue gave him a glance and then stood up, saying, “Alright, I should leave.”<br/><br/>She turned and walked away, taking a few steps.<br/><br/>Fang Wang turned around and said spontaneously, “Although that marriage contrato was fake, I kept my word before it was torn apart. You should do the same.”<br/><br/>Zhou Xue stopped walking and huffed, “Whether it’s true or not, I have the final say. Originally, you wanted to establish it, and I indulged you. In the future, whether it gets torn apart, you’ll have to indulge me.”<br/><br/>As her voice faded, she became a breeze and quickly disappeared behind the attic cluster.<br/><br/>Fang Wang, watching the direction she left in, smiled and muttered to himself, “As I thought, all women are the same.”<br/><br/>Below the vast sky, the endless clear blue.<br/><br/>Surrounded by peaks lay a lake within an archipelago, upon which a small pavilion sat in the center.<br/><br/>Ji Rutian, dressed in golden robes, flew swiftly to the pavilion, already occupied by his elder brother, Ji Haotian.<br/><br/>Ji Haotian was sipping tea. He glanced at Ji Rutian and softly said, “We haven’t seen each other for so many years, and you have truly transformed. It seems the Heavenly Dao has not deceived me.”<br/><br/>Ji Rutian sat opposite him, put his right arm on the table, stared at him, and asked with a smile, “I heard you challenged the Heavenly Dao and couldn’t withstand even a single punch?”<br/><br/>Ji Haotian countered, “Can you withstand it?”<br/><br/>“Haha, big brother, what do you think? If Fang Wang were not a reincarnated Great Saint Emperor, could there really be such an outstanding prodigy in the world?” Ji Rutian laughed a few times, his expression turning serious as he earnestly asked.<br/><br/>Ji Haotian remained silent.<br/><br/>Perhaps Fang Wang did not regard him highly, but Fang Wang had shattered his perspective on life.<br/><br/>Before meeting Fang Wang, he had seen too many geniuses, and even the other three of the Southern Celestial Four Heroes did not catch his eye, as he believed his talent was unmatched in the world.<br/><br/>But then Fang Wang came out of nowhere.<br/><br/>Fang Wang’s growth rate shattered his beliefs. Only later did he understand why in ancient times there were Great Emperors and Great Saints who dominated an era, why there were so many geniuses capable of standing shoulder to shoulder with him, and why this era was still considered to be a time of decline.<br/><br/>The reason might just be that Fang Wang had not yet emerged.<br/><br/>Seeing Ji Haotian fall silent, Ji Rutian no longer spoke. The brothers, each with their own thoughts, were preoccupied with the same person.<br/><br/>Some time passed.<br/><br/>A white-robed elder flew towards them.<br/><br/>Seeing this, Ji Rutian and Ji Haotian quickly stood up, clasped their fists, and saluted, “We pay our respects to Daoist Master Chunqiu.”<br/><br/>Daoist Master Chunqiu stroke his beard with a smile, raised his hand to indicate they should sit down, and he himself sat between them, placing the horsetail whisk he carried on the table.<br/><br/>“When you two were born, the Ji Family asked me to calculate your fate, both of you possessing great Fate. Yet, lately, your Fates have been dwindling, I presume you have encountered Fang Wang.”<br/><br/>Daoist Master Chunqiu softly chuckled, his eyes smiling in a profound and elusive manner.<br/><br/>Ji Haotian asked, “Daoist Master, could you calculate Fang Wang’s fate, is he a person of destiny?”<br/><br/>Daoist Master Chunqiu shook his head and said, “I can’t calculate it, can’t see through it. The so-called person of destiny is never predetermined but fought over. Both of you can become persons of destiny. However, unfortunately, you met Fang Wang. If he lived in any other era, he would be a lifelong rival to the Great Saints and Great Emperors. If he survives his challenges, his status among the Saint Emperors will be incalculable.”<br/><br/>Ji Haotian frowned.<br/><br/>A sharp light flashed in Ji Rutian’s eyes.<br/><br/>Ignoring the changes in their expressions, Daoist Master Chunqiu continued, “In the Emperor Sea, there is a prodigy named Lü Xianming whose Fate also changed upon meeting Fang Wang. Oddly, after his defeat to Fang Wang, his Fate didn’t weaken but grew stronger.”<br/><br/>Ji Haotian raised an eyebrow and asked, “The prophesied saintly talent from the Lü Family also lost to Fang Wang?”<br/><br/>“Mhm, he’s still comprehending the Dao in my Enlightenment Hall to this day. This young man is truly remarkable, sitting under a tree and about to grasp a Cultivation Technique that can lead to sainthood. The younger generation is indeed fearsome,” Daoist Master Chunqiu remarked emotionally.<br/><br/>Ji Rutian then asked, “Daoist Master, did you summon us brothers here just to praise Fang Wang? We’ve personally experienced Fang Wang’s prowess.”<br/><br/>Daoist Master Chunqiu shook his head and said, “Naturally not. I summoned you here indeed for Fang Wang, which is also the wish of the Ji Family and the other six Saint Clans. With Fang Wang’s peerless talent shaking the ancient and modern times, the seven clans are intent on seizing his physical body.”<br/><br/>Upon hearing this, Ji Rutian’s brow furrowed tightly.<br/><br/>Ji Haotian, perplexed, asked, “What do you mean? Does the Ji Family want us brothers to kill Fang Wang? Impossible!”<br/><br/>Ji Rutian stared intently at Daoist Master Chunqiu.<br/><br/>“Not at all. Your father entrusted me to witness which of you two brothers is stronger. The stronger will have the right to vie for Fang Wang’s body. Today, only one of you will survive. The victor will then compete with the other six clans for Fang Wang’s body.”<br/><br/>When Daoist Master Chunqiu’s words settled, the gentle breeze over the lake stilled.<br/><br/>Ji Haotian and Ji Rutian were not shocked; both brothers appeared composed, and even their brows relaxed.<br/><br/>“Our father doesn’t want to come and collect the corpse of his sons himself?” Ji Haotian asked, his voice growing somewhat hoarse.<br/><br/>Ji Rutian said with sarcasm, “He has always been like this, treating his children as pawns. If a pawn dies, it dies; he would never come in person.”<br/><br/>Daoist Master Chunqiu stayed silent, beginning to pour himself a cup of tea.<br/><br/>Ji Haotian stood up and looked down at Ji Rutian, saying, “Rutian, although we haven’t seen much of each other since childhood, as brothers, I will take this fated battle seriously. Afterwards, I will bury you and erect a monument in your memory.”<br/><br/>Ji Rutian laughed, looked up at Ji Haotian, and said, “Big brother, if you die, I won’t bury you. I will simply scatter your ashes over this lake.”\t\t\t\t\t\t</div>", "images": {}, "success": true}