{"id": 252, "url": "https://www.novelhall.com/i-became-an-immortal-on-mortal-realm-32879/14575798.html", "title": "Chapter 252 - Chapter 252: Chapter 249: Heavenly Yang Energy, True Immortal Of The Mortal Realm", "volume": 3, "volume_title": "Volume 3", "body": "<h1>Chapter 252 - Chapter 252: Chapter 249: Heavenly Yang Energy, True Immortal Of The Mortal Realm</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 252: Chapter 249: Heavenly Yang Energy, True Immortal of the Mortal Realm<br/><br/>Translator: 549690339<br/><br/>Fang Wang’s words echoed within the prison cell, and throughout the entire Underground Palace, making all who heard them feel a chill in their hearts.<br/><br/>Without raising his voice, he conveyed a profound sense of murderous intent and hostility.<br/><br/>Madness!<br/><br/>Han Huitian trembled all over, his face showing a look of agony.<br/><br/>Song Han Xianzi quickly asked, “What’s wrong with you?”<br/><br/>Qiu Ya Zhenren and Liu Jun guarded against Fang Wang while looking anxiously at Han Huitian.<br/><br/>Han Huitian raised his hand, pointing at Fang Wang, and shakily said, “He… cannot…”<br/><br/>As his voice trailed off, Han Huitian collapsed to the ground with a thud, face-first, his life force cut off instantly.<br/><br/>This scene made Qiu Ya Zhenren, Song Han Xianzi, and Liu Jun’s eyelids twitch uncontrollably, and they couldn’t help but feel fear.<br/><br/>Han Huitian was a Sky-Stepping Realm Cultivator!<br/><br/>How could he suddenly fall to the ground?<br/><br/>They could clearly feel that Han Huitian’s breath had ceased, which meant that Han Huitian was dead.<br/><br/>Song Han Xianzi seemed to realize something, her enticing eyes widened in shock as she exclaimed, “Could it be that he was backfired upon during soul possession?”<br/><br/>Only when the soul is completely dissipated, could such a manner of death occur.<br/><br/>The vitality of a Sky-Stepping Realm’s flesh body isn’t so easily severed!<br/><br/>Fang Wang closed his eyes and continued to absorb Spiritual Energy, the speed of his consumption increasing rapidly, and the rate at which his vitality strengthened became even more exaggerated.<br/><br/>Suddenly, Song Han Xianzi glanced toward Xiao Zi, just as she intended to make a move, Fang Wang appeared in front of her out of thin air.<br/><br/>White flames burned fiercely around Fang Wang, causing his black hair to billow away, his eyes shining like torches, full of murderous energy.<br/><br/>Song Han Xianzi froze, her eyes grew sharp, and she suddenly raised her palm to strike Fang Wang.<br/><br/>However, Fang Wang was faster.<br/><br/>Their fists and palms collided!<br/><br/>Boom!<br/><br/>Song Han Xianzi was blasted through the prison wall, her figure disappearing into the darkness.<br/><br/>Qiu Ya Zhenren and Liu Jun were visibly shaken, immediately coalescing their own Lifespirit Treasures, preparing for battle.<br/><br/>Fang Wang looked at his right fist, the Black Dragon’s head dispersing, with flames still enveloping his fist, and dissatisfaction flickered in his eyes.<br/><br/>Still not strong enough!<br/><br/>He turned around to face Qiu Ya Zhenren and Liu Jun, not making a move against them but instead frantically absorbing nature’s spiritual energy. The Spiritual Energy from the entire Underground Palace, even from outside, surged towards him with growing intensity.<br/><br/>He intended to transform into the Heavenly Gang Supreme Yang Tyrant Body in one go!<br/><br/>Xiao Zi immediately came to his side, and despite the Yang Energy flames around him, she did not burn but instead felt a warm sensation.<br/><br/>Rumble—<br/><br/>The Underground Palace shook even more violently, prompt Qiu Ya Zhenren and Liu Jun to exchange glances and vanish on the spot.<br/><br/>Xiao Zi looked at Fang Wang eagerly and asked, “Master, can we break out now?”<br/><br/>“Not yet.”<br/><br/>Fang Wang turned to face the passageways outside the prison cells, where the prisoners in each cell looked at him with excited eyes.<br/><br/>The prisoners saw a hope of breaking free in Fang Wang.<br/><br/>“I knew it, Senior, you weren’t captured by them at all. It was intentional, a deliberate ruse to destroy their little realm!” Yang Du shouted excitedly, altering the way the other prisoners looked at Fang Wang.<br/><br/>Indeed, Fang Wang was different from them; he was not brought in a disheveled state, but rather seemed to have been invited, with his demeanor leaving a deep impression and not a single injury on his body.<br/><br/>“Senior, save us!”<br/><br/>“I come from the Chen Family, a Saint Clan as well. If you save me, my family will definitely help you against these seven Saint Clans!”<br/><br/>“That’s right, I’m the top disciple of Xuan Han Sect, and I’m eligible to say such words.”<br/><br/>“The Qiu Clan is nothing but beasts, having always had friendly relations with my family, yet now they covet my constitution.”<br/><br/>“Although I don’t have a notable family background, at the very least, I’m at the Nirvana Realm level of cultivation. One day, I will definitely fight them to the death!”<br/><br/>The prisoners clamored, as if they were drowning people clutching at a life-saving straw.<br/><br/>Yang Du, on the other hand, became smug as he muttered to himself, “It seems that the old Taoist was right. My fate is formidable indeed, always able to turn dangers into safety. I indeed am a talent suited to be a Great Saint…”<br/><br/>He couldn’t help but look at Fang Wang.<br/><br/>He had heard a legend that during the era of the Grand An Divine Dynasty, Great Saints were not the pinnacle of the human race.<br/><br/>If he were to become a Great Saint, then Fang Wang would be the number one in the Mortal Realm!<br/><br/>Anyone else would be dissatisfied and unwilling, but if it was Fang Wang, he could accept it, he even thought it was only right.<br/><br/>Fang Wang did not respond to them but was instead immersed in the transformation into the Heavenly Gang Supreme Yang Tyrant Body.<br/><br/>Gradually, the corridors of the Underground Palace began to crack, and cracks appeared on the walls of the cells, exciting the prisoners even more.<br/><br/>Outside the Underground Palace, thunderclouds roiled, and torrential rains fell. Looking out, there was a gigantic sea island surrounded by seawater, currently experiencing tumultuous waves as if engulfed in a storm.<br/><br/>Song Han Xianzi, Liu Jun, and Qiu Ya Zhenren hovered above the island, forming a Formation, their Spiritual Power condensing into a shield covering the entire island.<br/><br/>At that moment, Ji Zhan, Feng Wuzong, and Yu Ling Long appeared.<br/><br/>Ji Zhan asked in a deep voice, “What happened? Where’s Han Huitian?”<br/><br/>Qiu Ya Zhenren answered swiftly, “Fang Wang seems to have practiced some wondrous technique; his physique is undergoing a transformation, and when Han Huitian attempted to possess his body, he was backfired upon and has died.”<br/><br/>Hearing this, Ji Zhan and the others’ faces turned pale with shock.<br/><br/>Yu Ling Long took the initiative, assisting in the formation process, supported by Ji Zhan and Feng Wuzong.<br/><br/>Feng Wuzong furrowed his brows and asked, “Do we seal him, or kill him?”<br/><br/>Their strength was not much different from Han Huitian’s, and since Han Huitian had failed in his possession, it was likely that their own attempts would be perilous at best—let alone for the lower-level juniors.<br/><br/>Ji Zhan rapidly made a decision, “Suppress him with all your might, forget about the other prisoners!”<br/><br/>The others all unleashed their full power.<br/><br/>Boom! A loud noise!<br/><br/>The island below suddenly burst apart, countless fragments of rock shooting up into the air, tearing through everything amidst the torrential rain.<br/><br/>Ji Zhan, Feng Wuzong, and the other six were forced to retreat, the formation they were about to establish instantly shattered, with figures flying out in succession.<br/><br/>“Hahaha! We’ve escaped!”<br/><br/>“Thanks to Elder Fang, I will never forget your kindness!”<br/><br/>“Your grandpa Qiu is out again!”<br/><br/>“Kill! Damn it, all these dogs deserve to die!”<br/><br/>“Ecstatic, I never thought I could escape!”<br/><br/>Various laughing voices resounded throughout the heavens and earth, not even obscured by the thunder.<br/><br/>Ji Zhan roared with fury, and powerful auras exploded from all directions, Great Cultivators from the seven clans arriving one after another.<br/><br/>Feng Wuzong spoke up, “Let the others capture these guys; we’ll join hands to suppress Fang Wang!”<br/><br/>Without his direction, the others had already locked their sights on Fang Wang.<br/><br/>After the island exploded, a massive whirlpool appeared, resembling the mouth of the abyss, as if terrifying beasts might leap out of the darkness at any moment.<br/><br/>Fang Wang floated above the whirlpool, nature’s spiritual energy rushing towards him, and his body’s white Yang Energy made him appear like a blazing sun, dispelling the darkness in this night-like world.<br/><br/>Xiao Zi coiled around him, not feeling discomfort but rather excitement.<br/><br/>Fang Wang deliberately channeled Spiritual Energy into Xiao Zi’s body, even guiding it in cultivating the Heavenly Gang Supreme Yang Tyrant Body.<br/><br/>With Xiao Zi’s physical qualification, it was impossible to directly transform into the Heavenly Gang Supreme Yang Tyrant Body, but Fang Wang did this to enhance its physique.<br/><br/>The Demon Race itself is known for its strong physical bodies, especially the True Dragons, whose dragon power has always been regarded as the strongest force among beings.<br/><br/>Ji Zhan, Feng Wuzong, Sung Han Immortal, Yu Ling Long, Liu Jun, and Autumn Cliff True Person quickly surrounded Fang Wang, each condensing their Lifespirit Treasure, looking fierce and ready.<br/><br/>Fang Wang ignored them, focusing on his practice.<br/><br/>Together, the six unleashed their spells, six powerful spells combined with the terrifying Spiritual Power of the Sky-Stepping Realm striking Fang Wang.<br/><br/>The whole dim world was instantly brought into daylight, distant cultivators already engaged in battle were swept up by terrible gusts, all turning around in horror to look towards Ji Zhan and the others.<br/><br/>Yang Du shielded his face with an arm, his eyes filled with terror.<br/><br/>“Just what realm are these people at, the mere aftershocks are almost too much for me to bear…”<br/><br/>His gaze pierced through Ji Zhan and the others, attempting to catch a glimpse of Fang Wang, but alas, he could not see Fang Wang.<br/><br/>Ji Zhan and the rest stared intently at Fang Wang, where within the light of Spiritual Power, the changes in Fang Wang’s flesh became faintly visible, flesh tearing scenes could be glimpsed, yet Fang Wang’s figure did not fade, nor did it change at all.<br/><br/>This sight sent a chill through the hearts of Ji Zhan and the others.<br/><br/>What kind of monster is this?<br/><br/>With their view, they could naturally see the details of Fang Wang’s condition.<br/><br/>Fang Wang’s skin kept being destroyed and reborn, flesh flying, yet the speed of his flesh regeneration was astoundingly fast.<br/><br/>Sung Han Immortal, Autumn Cliff True Person, and Liu Jun all thought of the harsh words Fang Wang had said before.<br/><br/>Fang Wang wanted to annihilate their family clans!<br/><br/>They suddenly felt a shiver go through them.<br/><br/>Xiao Zi, within the bright light, looked at Fang Wang’s silhouette with worry. Fang Wang protected it with the Jiuyou Zizaishu, keeping it unharmed from the Spiritual Power attacks of Ji Zhan and the others, whereas he himself relished in suffering.<br/><br/>Even the body of the Heavenly Gang Supreme Yang Tyrant Body in the face of attacks would feel pain, but he needed this pain.<br/><br/>One reason was to understand the might of the Heavenly Gang Supreme Yang Tyrant Body, and the second was to increase his own malevolence.<br/><br/>He needed to ensure that he wouldn’t have a trace of mercy in the upcoming slaughter!<br/><br/>Feng Wuzong raised his hand and conjured a fiery red gourd, threw it skywards, which then turned over, pouring out streams of molten lava that expanded rapidly, as if a crimson celestial river descended from the heavens onto Fang Wang and Xiao Zi.<br/><br/>Xiao Zi, protected by the Jiuyou Zizaishu, was unaffected.<br/><br/>Fang Wang, however, confronted the lava with his physical body. The temperature of the lava was extremely high, far exceeding that of ordinary volcanic magma.<br/><br/>Under such an attack, Fang Wang’s rate of absorption of Spiritual Energy from heaven and earth surged.<br/><br/>“Soon… very soon…” Fang Wang murmured within the magma, exhaling a breath of turbid air.<br/><br/>Before long, his body no longer scattered flesh and blood, his flesh became even more robust, his vigorous blood qi churning within his body, and Heavenly Gang Star Acupoints continuously gushed out Yang Energy, which was also being transformed.<br/><br/>He called it Heavenly Yang Energy!<br/><br/>Supreme Yang!<br/><br/>Seeing that his treasure could not harm Fang Wang, Feng Wuzong’s expression grew even uglier.<br/><br/>The previously injured Sung Han Immortal, with disheveled hair, bit her lip and pulled out a red ribbon from her left sleeve with her right hand.<br/><br/>With a wave of the red ribbon, a mist of red spread out, the torrential rain unable to disperse it, and the red mist quickly enveloped Fang Wang.<br/><br/>The red mist blended with the lava, making the entire space twist and writhe.<br/><br/>Fang Wang twisted his neck, the divine light in his eyes dispelling the red mist and lava before his face, revealing his countenance, so cold and stern, with white energy pouring from his eyes like a True Immortal descending into the mortal world.\t\t\t\t\t\t</div>", "images": {}, "success": true}