{"id": 259, "url": "https://www.novelhall.com/i-became-an-immortal-on-mortal-realm-32879/14579141.html", "title": "Chapter 259 - Chapter 259: Chapter 256: Emperor Donggong, Changing The Mortal Realm", "volume": 3, "volume_title": "Volume 3", "body": "<h1>Chapter 259 - Chapter 259: Chapter 256: Emperor Donggong, Changing The Mortal Realm</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 259: Chapter 256: Emperor Donggong, Changing the Mortal Realm<br/><br/>Translator: 549690339<br/><br/>“Since the Buddhist Sect insists on involving itself with karma, then let me see what capabilities the Buddhist Sect has to dare support such an injustice in this world!”<br/><br/>When Fang Wang’s momentum reached its peak, his voice thundered like a storm, invigorating all followers.<br/><br/>What of the Buddhist Sect?<br/><br/>The Heavenly Dao feared nothing!<br/><br/>Upon hearing Fang Wang’s words, the Thousand-Zhang Golden Buddha said no more.<br/><br/>His palms pressed together, though he did not speak, chants of Buddha resonated through heaven and earth, leaving listeners in a trance, as if thousands of Buddhas were reciting scriptures in unison.<br/><br/>Fang Wang, advancing through the air, felt an invisible force of suppression, which was neither Spiritual Power nor divine consciousness nor soul thought. It was the first time he had encountered such a special power.<br/><br/>However, even though it was his first encounter, he was not afraid!<br/><br/>With the blessing of the Heavenly Dao Immensity Scripture, Fang Wang’s senses remained clear, unaffected. He leaped into the air, halberd smashing down.<br/><br/>In that moment, the innate power of the Heavenly Palace Halberd merged with Fang Wang’s Spiritual Power, and under the command of the Heavenly Gang Supreme Yang Tyrant Body, even the space twisted.<br/><br/>The Thousand-Zhang Golden Buddha reacted swiftly, striking with his palm the instant Fang Wang leapt up.<br/><br/>Boom—<br/><br/>An ear-splitting roar echoed in the ears of all followers and Buddha Cultivators as a world-destroying gale, centered on the two fighters, swept across all directions of heaven and earth.<br/><br/>Mountains crumbled, forests were uprooted, and grass, dirt, and stones were swept into the sky.<br/><br/>All followers executed their power to resist with their own Spiritual Power, but they were still pushed back by this terrifying windstorm.<br/><br/>“So strong…”<br/><br/>Yang Du’s eyes widened. He was not speaking of Fang Wang, but of the Thousand-Zhang Golden Buddha.<br/><br/>To think that even Qiu Shenji would be repelled by Fang Wang’s power, yet the Golden Buddha stood immovable, as the most firm and unyielding statue between heaven and earth.<br/><br/>“Amitabha…”<br/><br/>The majestic voice of the Thousand-Zhang Golden Buddha rang out once again, accompanied by rays of Buddha’s light, instantly brightening the entire world, and in an instant, all things lost their color.<br/><br/>Fang Wang felt a scorching breath, a heat that even the Heavenly Gang Supreme Yang Tyrant Body found uncomfortable, somewhat similar to the suppressive force brought on by the earlier chanting.<br/><br/>The Buddhist Sect was not simple!<br/><br/>But if this was the extent of their strength, the Buddhist Sect had no right to back the Yu Clan!<br/><br/>Fang Wang’s gaze became even colder.<br/><br/>He was not merely a two-hundred-year-old talent, he was a long-living Cultivator who had gone through the hardships of time!<br/><br/>His power was not from innate talent, but from the accumulation of long and tedious years of Cultivation!<br/><br/>“Today, be it Dao, Buddha, or even the Immortal Gods in the heavens, none shall protect the Yu Clan!”<br/><br/>Fang Wang’s words reverberated through heaven and earth and even reached within the territory of the Yu Clan.<br/><br/>In the midst of mountains, several Yu Clan Cultivators stood in front of a pavilion, and all were stirred by Fang Wang’s words.<br/><br/>“Who exactly is Fang Wang? Even the Buddhist Sect’s Golden Buddha cannot suppress him?”<br/><br/>“Is he really just at the Nirvana Realm in his Cultivation?”<br/><br/>“It’s said that his physique is even more terrifying than the legendary Heavenly Body, and without exaggeration, as long as he continues to grow, he will be the next Descending Dragon Great Saint, or even surpass him!”<br/><br/>“No wonder Yu Ling Long was coveting his body.”<br/><br/>“If even the Buddhist Sect cannot contain Fang Wang, what then?”<br/><br/>It was not just them; all over the domain of the Yu Clan, in every corner where there were people, Fang Wang’s strength was the subject of astonishment.<br/><br/>In front of the pavilion, Yu Lingyun, clad in a green long gown, listened to the discussions of other clan members, his expression grim.<br/><br/>He was the most talented of his generation within the Yu Clan, having reached the Nirvana Realm in Cultivation. He had never imagined that during his growth, the Yu Clan would encounter such a calamity, with an enemy even younger than himself.<br/><br/>Both at the Nirvana Realm in Cultivation, he could not understand how Fang Wang’s momentum could reach such a terrifying level?<br/><br/>His heart was filled with shock and anger.<br/><br/>His anger was not directed at Fang Wang, but at his family’s actions!<br/><br/>Contending for Fang Wang’s body implied they looked down on his talent, feeling he was not Fang Wang’s equal.<br/><br/>Even if the facts did point that way, it was still hard for him to accept.<br/><br/>In this moment, Yu Lingyun suddenly felt a strong impulse to step forward and challenge Fang Wang, to prove himself.<br/><br/>With Fang Wang currently facing the suppression of the Buddhist Sect, there might be a chance.<br/><br/>But deep in his heart, another voice told him that he must not go, for it would be such a pity to die here.<br/><br/>The current Fang Wang was different from his former adversaries; he wouldn’t be concerned about the other’s Yu Clan disciple status. Once they started fighting, he would surely strike to kill.<br/><br/>Above the sea of clouds, a giant island was suspended, with circles of fog forming around it. Amidst the mountains on the island sat a vast city bustling with activity. Many cultivators flew above the streets, and one could also spot magical beasts and exotic creatures.<br/><br/>In the center of the city, within a massive palace, over a thousand cultivators had gathered, among them Tai Xi from Suzhen Palace.<br/><br/>All eyes turned to the figure seated on a white crystal throne atop the steps, a man in a white robe with golden threads, wearing a beaded jade crown. Embroidered on his robe were two five-clawed Golden Dragons, his brows exuded an imperial majesty, as if he were an emperor among men.<br/><br/>“Your Majesty, the actions of these seven clans have spread far and wide, resulting in an immeasurable impact. This will surely tarnish the masses’ perception of the Great Saint, and we must not condone it!”<br/><br/>An elder spoke out loudly; at his words, a contentious debate immediately ensued.<br/><br/>“This matter has yet to be thoroughly investigated; we cannot simply deal with it conclusively. However, Fang Wang indeed executed many members of the Qiu Clan.”<br/><br/>“Ridiculous! It seems that your Luo Clan wears the same trousers as the Qiu Clan.”<br/><br/>“Do you know why these rumors spread so quickly? Because the seven clans captured many talents from great sects and noble families. With the seven clans being so audacious, even if you look down upon sympathizing with Fang Wang, you should still consider your own situation. If we let this slide, be wary in the future that your descendants will be the ones captured by them.”<br/><br/>“That’s not all; if we don’t punish the seven clans, more Saint Clans and Imperial Clans are bound to follow suit, and sooner or later, it will become a colossal disaster for the Mortal Realm.”<br/><br/>“Indeed, we must severely punish these seven saintly clans. They have disgraced the mighty name of the Great Saint. I propose stripping them of their saintly status and severing their fate with the Saint Clans!”<br/><br/>Most people supported the severe punishment of the seven Great Saint Clans. Their reasoning was simple: today, the seven clans dared to capture genius disciples from various sects; tomorrow, they might dare to capture the genius offspring of other Saint Clans—who could tolerate this?<br/><br/>Those who supported the seven Great Saint Clans were either on good terms with them or belonged to the Saint Clans themselves. They viewed the situation as a struggle against the Saint Clans by Tian Dao Fang Wang, or even as a rebellion by the lowest echelons of the Cultivation World against the Saint Clans—it was no longer just about the capture of talents.<br/><br/>Tai Xi tugged on the sleeve of a middle-aged woman in front of her. The woman turned her head and glared, causing Tai Xi to suppress her impatience.<br/><br/>“Enough.”<br/><br/>The man seated on the high seat spoke, instantly quieting everyone down.<br/><br/>He was Emperor Donggong, one of the strongest candidates likely to achieve emperorship in his era.<br/><br/>Emperor Donggong, with an expressionless face, said, “I am quite interested in Tian Dao Fang Wang. Someone tell me, what kind of person is Fang Wang?”<br/><br/>As soon as he spoke, Tai Xi could not hold back any longer and said, “I know Fang Wang. He is a genius with a heart for the world, possessing a great kindness. Throughout the rise of Fang Wang, he has never killed the innocent indiscriminately. His massacres were only triggered when his kin were harmed; it’s the same this time. The seven clans took advantage of the death of Fang Wang’s parents to force his surrender, causing him to miss the final farewell to his parents. This is why Fang Wang has gone mad.”<br/><br/>“Fang Wang is building Kunlun, which may seem to be just for his own cultivation, but that’s not the case. He constructs Kunlun for the sake of future generations…”<br/><br/>She began to talk about Fang Wang’s vision for Kunlun, and as she spoke, a curious look appeared in Emperor Donggong’s eyes.<br/><br/>The rest of the palace audience was also captivated, with feelings ranging from admiration to disdain and scorn as they listened to the concept for Kunlun.<br/><br/>When she finished, an elder stood up and said, “Tiangong Sect can vouch for Fang Wang; he truly thinks this way. Otherwise, he could have sought a blessed land rich in resources for himself. Everyone should be aware that the Descending Dragon Continent is depleted of fate, hardly a holy land for cultivation.”<br/><br/>As the representative of the Tiangong Sect spoke, many others stood up in support.<br/><br/>Emperor Donggong casually said, “It seems that Fang Wang indeed has a heart full of great kindness. However, no man is a sage; when faced with the safety of loved ones, anyone can lose their reason. I can understand that. It is said that the Mortal Realm is on the cusp of an unprecedented golden age, but you should all be aware that such an age also signifies great calamities, especially with the oppression from The Upper Realm. If Fang Wang continues to grow, he will undoubtedly become a tremendous asset to the Mortal Realm.”<br/><br/>Those who had originally supported the seven Great Saint Clans all changed color, their faces turning grim.<br/><br/>A valiant man clad in Silver Armor spoke, “Your Majesty, the Buddhist Sect has already gone to support the Yu Clan. No matter how formidable Fang Wang is, he is but a youth of over two hundred years. It will be difficult for him to survive this ordeal.”<br/><br/>Emperor Donggong pondered for a moment and then said, “Emperor Tao, would you be willing to assist Fang Wang?”<br/><br/>At these words, people immediately became restless.<br/><br/>“Your Majesty, please reconsider! The matter has not been fully investigated!” A frantic old woman spoke out, and following her plea, many others began to protest.<br/><br/>This incited further debate among the cultivators from the opposing camp.<br/><br/>“Enough. If you want a thorough investigation, then Fang Wang must survive,” Emperor Donggong commanded sternly, his domineering presence quieting the entire great hall.<br/><br/>The man known as Emperor Tao immediately rose into the air and, from above, bowed to Emperor Donggong, saying, “Your Majesty, I am willing to help Fang Wang. Such talent is rare in a hundred thousand years. It would be too regrettable if he died in the Nirvana Realm.”<br/><br/>“Hmm, go then,” replied Emperor Donggong, and Emperor Tao instantly transformed into a rainbow light that vanished from the palace.<br/><br/>A smile appeared on Tai Xi’s face, her lips curving upward.<br/><br/>She had finally repaid Fang Wang.<br/><br/>Emperor Donggong spoke again, “Continue telling me about Fang Wang, starting from his birth. I had not expected to encounter such a prodigy during my lifetime. It’s truly a great fortune for the human race and a blessing for the Eastern Mortal Realm. He is a sign that the Eastern Mortal Realm is catching up with the Western Mortal Realm.”<br/><br/>The cultivators in the hall looked at each other, and eventually, one person stood up. It was not Tai Xi or a cultivator from the Tiangong Sect, but a Taoist, none other than Daoist Master Chunqiu from Emperor Sea.<br/><br/>Daoist Master Chunqiu’s first words caused an uproar in the hall:<br/><br/>“Your Majesty, Fang Wang is neither a saintly nor an imperial talent. He will pioneer a new level of existence in heaven and earth, just like the Great Saint who emerged out of the blue in the past, astonishing past and present and transforming the entire Mortal Realm.”\t\t\t\t\t\t</div>", "images": {}, "success": true}