{"id": 250, "url": "https://www.novelhall.com/i-became-an-immortal-on-mortal-realm-32879/14575010.html", "title": "Chapter 250 - Chapter 250: Chapter 247: Fang Wang’S Determination", "volume": 3, "volume_title": "Volume 3", "body": "<h1>Chapter 250 - Chapter 250: Chapter 247: Fang Wang’S Determination</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 250: Chapter 247: Fang Wang’s Determination<br/><br/>Translator: 549690339<br/><br/>Fang Wang, Xiao Zi, and the others including Han Huitian and Song Han Fairy flew for half a day, landing on an island covered in a dense forest, which concealed a transmission formation.<br/><br/>As they entered the formation, Fang Wang saw figures coming from all directions within the forest, all of whom were cultivators from the seven Saint Clans. Their eyes, looking at Fang Wang, were filled with greed.<br/><br/>Fang Wang also saw a familiar face.<br/><br/>Ji Rutian.<br/><br/>Fang Wang’s gaze met with Ji Rutian’s. Ji Rutian was expressionless, and their eyes collided in the empty space between them, yet neither spoke a word.<br/><br/>Shortly, the formation activated.<br/><br/>Fang Wang and Xiao Zi, along with Han Huitian and the others, disappeared inside the formation, while Ji Rutian entered the formation with the rest of the cultivators.<br/><br/>Half an hour passed.<br/><br/>Inside the dim underground palace, Fang Wang walked into a prison cell, which was surprisingly luxurious, with beds, tables, chairs, layered brocades, and walls inlaid with pearls and jade. At first glance, it didn’t look like a cell but rather a resplendent bedroom, and it was quite spacious.<br/><br/>Xiao Zi roamed about, while Fang Wang sat down in the center of the cell and started meditating.<br/><br/>Feng Wuzong closed the cell door and sealed it with a seal. He gave Fang Wang a cold glance before he turned and left.<br/><br/>Fang Wang’s cell was located at the far end of the underground palace, against the wall. Along both sides, there were rows of cells of varying sizes. Many imprisoned cultivators and monsters curiously approached their cell doors to scrutinize Fang Wang.<br/><br/>“Feng Wuzong, who is this person? You actually captured him personally,” asked an old man clad in tattered clothes, holding onto the iron bars of his cell door with a sly smile.<br/><br/>Feng Wuzong didn’t look at him and said calmly as he walked away, “Tian Dao Fang Wang, the current number one genius in the land. It was not I who captured him.”<br/><br/>With that, he turned into a series of afterimages and vanished into the darkness.<br/><br/>Tian Dao Fang Wang!<br/><br/>This name stirred up much commotion among the prisoners, and those who had not heard of him before started asking around. Soon, Fang Wang’s exploits spread throughout the underground palace.<br/><br/>Fang Wang discovered that although the cell was cast with many powerful restraints and seals, spiritual energy seeped through the ground, allowing for cultivation.<br/><br/>His Heavenly Dao Immensity Scripture was automatically absorbing nature’s spiritual energy, but he didn’t plan to focus on cultivation. Instead, he prepared to fuse the Heavenly Gang Saint Body Technique with the Vajra Invincible Saint Body in this place.<br/><br/>With the Heavenly Dao Immensity Scripture and the Formless Zhou Tian Technique at his disposal, Fang Wang feared no soul extraction techniques. He could even escape using Jiuyou Zizaishu if he wished.<br/><br/>But he didn’t want to escape—yet.<br/><br/>He appeared calm, but inside he was filled with a murderous intent.<br/><br/>The seven Saint Clans threatened him using the Fang Family, crossing a line he could not tolerate, and they did so during a critical period for his parents.<br/><br/>His anger wouldn’t be quelled until he eradicated the Indestructible Seven Clans.<br/><br/>In a battle of wits, he could afford to show mercy, but against those who persecuted him ruthlessly, he would surely retaliate tenfold against his enemies!<br/><br/>Just as he had once faced the Emperor Sea Mysterious Dynasty!<br/><br/>Xiao Zi came over and cautiously asked, “Young Master, even if we surrender without resistance, can we be sure they will spare the Fang Family?”<br/><br/>It always felt like Fang Wang had the strength to break free, but the Fang Family held him back.<br/><br/>“Don’t worry, I have asked someone to go back and protect the Fang Family.”<br/><br/>Fang Wang spoke with eyes closed, naturally having asked Zhou Xue for help.<br/><br/>He didn’t need Zhou Xue to save him, just to protect the Fang Family.<br/><br/>He intended to eradicate the seven Saint Clans alone—anything less wouldn’t satisfy him!<br/><br/>Upon hearing this, Xiao Zi understood that Fang Wang had asked Zhou Xue for help.<br/><br/>It had always felt that Zhou Xue was not simple, unfathomably deep, and behind her was the Jin Xiao Sect.<br/><br/>If Fang Wang was considered the number one genius among cultivators, then Jin Xiao Sect would be the number one genius among sects, with a growth speed that was simply unimaginable.<br/><br/>Fang Wang paid no further attention to Xiao Zi and focused on fusing the Cultivation Techniques.<br/><br/>Although the Heavenly Gang Saint Body Technique had already been integrated into the Heavenly Dao Immensity Scripture, he could fuse the two Body Cultivation Techniques separately to transform his physique.<br/><br/>The Heavenly Body was known for its reborn flesh and bones, its physical firmness akin to the heavens, embodying the utmost hardness and ferocity.<br/><br/>The Vajra Invincible Saint Body radiated Yang Energy like flames, making the body as tough as vajra, also predominated by a powerful and overbearing strength.<br/><br/>Though both constitutions had their strengths, they both followed the path of dominance and therefore, fusing them should be smoother.<br/><br/>In a bright great hall, cultivators from the seven Saint Clans gathered together, with seven thrones side by side atop the steps, occupied by Feng Wuzong, Song Han Fairy, Qiuya Zhenren, Han Huitian, Yu Ling Long, Ji Zhan, and Liu Jun.<br/><br/>The cultivators from the seven clans stood in seven columns in the hall, easily numbering in the hundreds, with Ji Rutian among them.<br/><br/>Song Han Fairy spoke up, “The debate over the possession of this precious body should begin, shouldn’t it? That boy’s talent is no joke. If left unchecked over time, who knows what he will cultivate into.”<br/><br/>Qiuya Zhenren suggested, “Shall we extract his soul beforehand?”<br/><br/>Ji Zhan shook his head, “The matter of assigning possession could take a long negotiation, and extracting his soul prematurely could affect the vitality of the precious body. Unless someone occupies his body first, I think it would be difficult to satisfy everyone no matter the choice.”<br/><br/>The other Sky-Stepping Realm Great Cultivators joined the discussion, and Liu Jun even proposed that one of the seven among them should inherit Fang Wang’s precious body.<br/><br/>The eyes of the genius cultivators from the seven clans twinkled as they all held interest in Fang Wang’s flesh.<br/><br/>A physique that could withstand the Divine Passage Realm despite being in the Nirvana Realm was surely an Immortal’s precious body!<br/><br/>“Such precious bodies contain immense fate; once they are taken over, there will undoubtedly be extraordinary signs between heaven and earth. Everyone, prepare to set up the formation. Let’s isolate this small world from the secular one. As for who shall inherit the mystic body, how about each of the seven of us proposes one kind of trial? The children of the seven clans will participate together, and whoever performs the best in the seven trials will inherit the mystic body. Henceforth, regardless of which clan’s child inherits the mystic body, the seven of us clans shall become the closest allies, advancing and retreating together to support the rise of a Great Saint.”<br/><br/>Ji Zhan pondered and spoke, his words gaining approval from the others.<br/><br/>Night fell upon the Fang Family Mansion.<br/><br/>In Fang Yin’s courtyard, Zhou Xue was keeping him, Lady Jiang, and Fang Ling company in a small pavilion.<br/><br/>“Sister-in-law, my brother… he really won’t have any trouble, right? He’s already been gone for three days,” Fang Ling asked with worry.<br/><br/>Zhou Xue poured a cup of tea for Lady Jiang, smiling as she said, “You’re underestimating your brother. Now that his fate has solidified, anyone who becomes his enemy can only meet a pitiful end.”<br/><br/>Fang Yin stroked his beard with a laugh, saying, “Indeed, no one can match Wang’er.”<br/><br/>Zhou Xue looked at Fang Yin with a smile and said, “Uncle Five, rest assured. I will not leave the Fang Family before Fang Wang returns and will order someone to keep an eye on his Kunlun.”<br/><br/>Fang Yin nodded, but a flicker of worry crossed the depth of his eyes.<br/><br/>How could parents not worry about their children?<br/><br/>Yet they understood, especially at such a critical juncture, they needed to remain calm and composed.<br/><br/>The calmer they were, the more at peace the Fang Family, and even Grand Qi and the continent could be!<br/><br/>After all, Fang Wang had bid farewell to his fourth uncle, Fang Zhen, and unavoidably, people would speculate since he had not been present at his own parents’ passing.<br/><br/>Zhou Xue began to talk about overseas affairs, quickly capturing Fang Ling’s attention. Fang Yin and Lady Jiang also wore smiles, but what they were truly thinking remained hidden.Inside the grand hall, the floor was covered with blue ice, the cold currents swirling. Various sacred beast statues were surrounded by the cold, looking lifelike.<br/><br/>Suspended below the apex of the sky were orbs of light, with mystic characters orbiting around them, as if following some special law of motion.<br/><br/>Tai Xi was sitting in meditation in a pool, her clothes soaked and clinging to her body, outlining her perfect curves. Her hands were constantly changing signs, her brows furrowed tightly, and it was unclear whether the liquid on her fair face was sweat or water from the pool.<br/><br/>Just then, the sound of footsteps approached, and a female disciple hurried to the edge of the pool, saluting with a fist and saying, “Senior Sister, there has been trouble. Tian Dao Fang Wang has been taken away by the Saint Clans, and it’s not just one. Several Saint Clans have joined forces to take him away.”<br/><br/>Upon hearing this, Tai Xi opened her eyes, which were as cold as ice. She furrowed her brows and asked, “Do we know which Saint Clans are involved?”<br/><br/>“So far, we know of the Han Clan, Wind Clan, and Song Clan,” was the response.<br/><br/>A glint of killing intent flashed in Tai Xi’s eyes.<br/><br/>The female disciple cautiously asked, “Senior Sister, with the Saint Clans joining hands to take him, I’m afraid the prospects are dire. Should we still support Kunlun?”<br/><br/>“Of course, we must. And we must send even more resources to strengthen Fang Wang’s position. I believe he will surely turn danger into safety,” Tai Xi stated without hesitation.<br/><br/>“But…”<br/><br/>“There are no buts. The very fact that the Saint Clans have taken him jointly has already proved his potential. Moreover, how can the Saint Clans truly cooperate without internal conflict? They might even start fighting among themselves over Fang Wang,” Tai Xi said as she waved her sleeve and then closed her eyes.<br/><br/>With no other choice upon hearing this, the female disciple resigned, saluting and retreating.<br/><br/>After she left the grand hall, Tai Xi opened her eyes and murmured softly, “Fang Wang, you should be able to handle this difficulty…”<br/><br/>Within the mysterious Underground Palace, Fang Wang sat in meditation in a jail cell, focusing on devising methods of fusion.<br/><br/>Outside the other cell doors, there were always people observing Fang Wang, their gazes filled with curiosity.<br/><br/>Fang Wang had been confined here for half a year, his mind completely engrossed in comprehending the Dao and forgetting all external concerns, free of any stray thoughts.<br/><br/>Every day, he would conceive different methods of fusion, yet he had been failing for half a year.<br/><br/>But the more he failed, the less he was anxious.<br/><br/>Whether it was the Heavenly Gang Saint Body Technique or the Vajra Invincible Saint Body, Fang Wang had already mastered both to the state of Great Perfection. In particular, these two constitutions had similarities, making him feel closer to success.<br/><br/>That day.<br/><br/>A group of cultivators came through the dark corridor depths, escorting a man. His robe was tattered, his hair a mess, his body covered in stains of dried blood, looking utterly disheveled.<br/><br/>He showed only one eye, which contemptuously scanned the prisoners on either side.<br/><br/>But when his gaze rested on Fang Wang, his pupils suddenly constricted.<br/><br/>“Elder… impossible…”<br/><br/>The man cried out in astonishment, his tone laden with shock.<br/><br/>This man was none other than Yang Du, the innate Heavenly Body!<br/><br/>After being captured, Yang Du was not at all panicked, feeling that with his Heavenly Body, these people could not harm him. However, seeing that Fang Wang was also detained here, he suddenly became alarmed.<br/><br/>Fang Wang was a formidable being capable of killing him with a single punch!<br/><br/>If even Fang Wang could not escape this calamity, how could he possibly flee?<br/><br/>“Behave yourself. Your Heavenly Body will become a sacrifice for the Heavenly Dao mystic body, and if you want your remaining days to be comfortable, don’t entertain any foolish ideas!” a cultivator beside him said coldly.\t\t\t\t\t\t</div>", "images": {}, "success": true}