{"id": 257, "url": "https://www.novelhall.com/i-became-an-immortal-on-mortal-realm-32879/14578167.html", "title": "Chapter 257 - Chapter 257: Chapter 254: Spreading Across The World, Taiqing Xuanjiao", "volume": 3, "volume_title": "Volume 3", "body": "<h1>Chapter 257 - Chapter 257: Chapter 254: Spreading Across The World, Taiqing Xuanjiao</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 257: Chapter 254: Spreading Across the World, Taiqing Xuanjiao<br/><br/>Translator: 549690339<br/><br/>Yang Du landed beside Fang Wang, his gaze fixed on the corpse impaled on the Heavenly Palace Halberd.<br/><br/>Although the person’s hair was disheveled, and their face was a bloody, indistinct mess, making it impossible to discern their true features, Yang Du could recognize that the body was none other than the clan leader of the Qiu Clan, Qiu Shenji.<br/><br/>Tsk tsk, this guy really did die.<br/><br/>Yang Du had never doubted Fang Wang’s strength, but Qiu Shenji’s previous aura had been so overwhelming that such a formidable figure’s miserable death was inevitably sigh-inducing.<br/><br/>“Senior, what should we do next?” Yang Du cautiously asked.<br/><br/>Fang Wang, with eyes closed, said, “Rest for a few days, then head to the next Saint Clan.”<br/><br/>Yang Du nodded and immediately turned to relay the order.<br/><br/>Unwittingly, he had become the leader of the prisoners through his association with Fang Wang. In the Underground Palace prison, many prisoners had escaped, and those who stayed did so not only for vengeance but also with the intention of following Fang Wang.<br/><br/>The seven great Saint Clans did not just target descendants of prominent families; more often, they aimed to capture untethered geniuses like Fang Wang.<br/><br/>Xiao Zi emerged from Fang Wang’s embrace, having shrunk to a tiny size, merely twenty centimeters long.<br/><br/>It looked up at Fang Wang and asked softly, “Young Master, are you all right?”<br/><br/>In the battle with Qiu Shenji, Xiao Zi had also expended a great deal of effort, channeling its Spiritual Power into the Heavenly Palace Halberd, which left it extremely fatigued.<br/><br/>Fang Wang’s eyes remained closed as he focused on his cultivation, and while recuperating, he responded, “I’m fine. After a few days of rest, my Spiritual Power will recover.”<br/><br/>The clash with Qiu Shenji had drained all of Fang Wang’s Spiritual Power, even depleting what was stored inside the Heavenly Dao Imperial Dragon Crown.<br/><br/>The Spiritual Power at the Sky-Stepping Realm was in no way comparable to that of the Nirvana Realm. Plus, Qiu Shenji had tried to flee during the fight; had Fang Wang not mastered the Jiuyou Zizaishu, he might have easily let Qiu Shenji escape.<br/><br/>Killing Qiu Shenji had proven to be quite difficult.<br/><br/>Despite the difficulty, Fang Wang had made significant gains.<br/><br/>This was his first time engaging in an all-out battle to the death, and it was incredibly exhilarating.<br/><br/>After the great battle, Fang Wang even sensed an increase in the speed at which he absorbed nature’s spiritual energy.<br/><br/>Furthermore, Qiu Shenji’s soul had been absorbed by the wraith, significantly enhancing his Zhu Xian Jing Hong Sword, more so than if he had devoured a million souls.<br/><br/>With some of his Spiritual Power recovered, Fang Wang’s taut nerves eased slightly.<br/><br/>He thought for a moment, then sent his divine consciousness into the Jade Bracelet.<br/><br/>Soon, Zhou Xue’s divine consciousness appeared within the bracelet, pulling his into an Illusionary Realm.<br/><br/>It was still a courtyard within the Fang Residence where Fang Wang saw Zhou Xue.<br/><br/>Fang Wang took a deep breath and said, “Thank you.”<br/><br/>Zhou Xue gazed steadily at him and replied, “I am also a member of the Fang Family. Why speak of thanks?”<br/><br/>“How is the Fang Residence holding up now? The actions of the Saint Clans shouldn’t always be so decisive,” Fang Wang asked.<br/><br/>Zhou Xue smiled and said, “Indeed, they have attacked Grand Qi several times, but with me here, you can rest assured.”<br/><br/>Fang Wang fell silent for a moment, then said, “I am still not satisfied, and it may trouble you further down the line.”<br/><br/>Having avenged only one clan so far, he could not shake off his inner turmoil.<br/><br/>“Whatever you wish to do, go ahead. Even if it turns the world upside down, I will stand by you. I will protect the Fang Residence,” Zhou Xue nodded and said.<br/><br/>She continued, “Among the seven great Saint Clans you face, the Yu Clan is probably the strongest. The Yu Clan has not only produced a Great Saint but also nearly gave birth to a second one. Unfortunately, that individual ultimately failed against the Descending Dragon Great Saint, becoming stepping stone for his ascent. The Yu Clan of this generation is also exceptional, having a genius who once fought Xu Qiuming at his peak and nearly killed him.”<br/><br/>“Oh? And what became of him?”<br/><br/>“Naturally, Xu Qiuming killed him. Perhaps that is the fate of the Yu Clan; they have always been but stepping stones for the strongest under the heavens.”<br/><br/>“It seems, then, that eradicating a Saint Clan is quite difficult.”<br/><br/>“Of course, Saint Clans have branches spread far and wide. Even if a clan is exterminated, there will always be descendants rising to restore the family. This is the fate of a Great Saint. Those who achieve sainthood have a bloodline that is eternal. In this regard alone, the Great Emperor is inferior to the Great Saint,” Zhou Xue’s voice contained a hint of wistfulness.<br/><br/>Fang Wang’s brow furrowed slightly.<br/><br/>After that, Fang Wang asked a few more questions about the recent state of the Fang Family, and from beginning to end, he did not mention his own parents, nor did Zhou Xue.<br/><br/>This time, the two did not talk for long.<br/><br/>After withdrawing his divine consciousness, Fang Wang continued with his Qi Gathering to restore his Spiritual Power.<br/><br/>Seven days later.<br/><br/>Fang Wang, riding a dragon, departed. This time, another prisoner led the way. Their next target was the Han Clan.<br/><br/>The Han Clan was located in a nearby sea area, the closest Saint Clan to the Qiu Clan. The guide had once fallen in love with a woman from the Han Clan, only to be ultimately betrayed. His hatred for the Han Clan ran deep.<br/><br/>After the battle with the Qiu Clan, the prisoners’ confidence in Fang Wang reached its apex.<br/><br/>During those seven days, all had bathed and dressed in new clothes, each looking distinguished and far from their previous disheveled state as lowly prisoners.<br/><br/>They hastened forward at full speed, heading toward the Han Clan.<br/><br/>Two days later, they arrived at the Han Clan’s territory. Fang Wang broke through the spatial barriers and barged in, only to find that the Han Clan had long since abandoned the place.<br/><br/>The Qiu Clan had no precedent to refer to, but the Han Clan was different—they knew the fate of the Qiu Clan and naturally dared not act recklessly.<br/><br/>The escape of the Han Clan left their followers both furious and extremely excited.<br/><br/>Having been free for some time, they had calmed down. Aside from seeking revenge, they were considering the future; Fang Wang’s ability to scare an entire Great Saint Noble House into fleeing made him a formidable leader worth following.<br/><br/>Fang Wang continued forward in search of the next noble house.<br/><br/>Upon the earth, a dense fog swirled, revealing series of mountain ridges like the spine of a fearsome beast, daunting and terrifying.<br/><br/>At the foot of one mountain, an inn sat, partially concealed in the fog, with figures emerging and entering through its doors.<br/><br/>The inn was a hubbub of activity. Patrons clinked their glasses, drinking boisterously and discussing the major events of the Cultivation World.<br/><br/>Xu Qiuming sat alone at a small table in the corner, nursing a cup of hot wine, sipping and listening to the conversations around him.<br/><br/>“Have you heard? Some Great Saint families are capturing geniuses from all over to steal their bloodline and fate—even Tian Dao Fang Wang has suffered this catastrophe.”<br/><br/>“Fortunately, they captured Tian Dao Fang Wang; otherwise, this issue would never have come to light.”<br/><br/>“Indeed, those Great Saint families are a disgrace to the name of the Great Saints. If Fang Wang hadn’t broken free, who knows how many geniuses they would have killed.”<br/><br/>“It’s said that those seven saintly families held themselves as paragons of virtue, the law enforcers of the Cultivation World. Unexpectedly, they’ve stirred up such a scandal.”<br/><br/>“Those sects and families that had disciples captureD are already making trouble, and even other Saint Clans have stepped forward, denouncing the evil deeds of these seven families.”<br/><br/>“More than that, I’m curious about Tian Dao Fang Wang’s next moves. After he razed the Qiu clan, he’s now hunting down the other six families.”<br/><br/>Xu Qiuming’s eyes sparkled at the mention of Fang Wang.<br/><br/>In recent days, wherever he went, he heard cultivators and monsters discussing this topic. The actions of the seven Great Saint families were broadcasted by surviving prisoners, spreading rapidly among humans and demons alike.<br/><br/>Xu Qiuming had decided to set out to support Fang Wang after hearing about this matter.<br/><br/>Now with his Sword Intent at Great Completion, he believed he could be of assistance to Fang Wang.<br/><br/>Clang!<br/><br/>The inn’s door was thrust open as several cultivators entered, their fearsome presence enveloping the inn and silencing everyone, their eyes filled with fear, even the innkeeper’s.<br/><br/>The leading cultivator snorted, “What would you mortals know? Would my Yu Clan engage in such acts? Kneel down before me or I shall let you die here. Do you understand?”<br/><br/>Boom!<br/><br/>A powerful aura burst from him, breaking through the inn’s roof and causing the entire building to tremble, as numerous cultivators frantically knelt down.<br/><br/>More and more cultivators began to kneel; Xu Qiuming calmly drained his cup of wine and smashed it on the floor.<br/><br/>The Yu Clan cultivators turned to look at him, their eyes filled with dangerous intent.<br/><br/>Xu Qiuming stood up, looked down at them, and said, “I’m not like you; I don’t want to humiliate you, but you all must die.”<br/><br/>As his words fell, the eyes of the Yu Clan cultivators flashed with the light of swords.<br/><br/>Under the twilight sky, the setting sun was like spilt blood.<br/><br/>In the firmament above, a vast black hole appeared, with figures emerging from it. Behind them trailed a divine Purple Dragon, upon whose head stood a black-clothed man wearing a Fox Mask.<br/><br/>It was Fang Wang and his group.<br/><br/>Yang Du flew beside Xiao Zi, cursing, “This Liu Clan, just like the previous Han Clan, Song Clan, and Wind Clan, all fled. And the Ji Clan is shrouded in mystery; no one knows where their domain is. It seems we can only go after the Yu Clan now.”<br/><br/>Fang Wang didn’t respond, allowing him to continue venting.<br/><br/>The other followers were cursing as well, yet their faces were filled with smiles.<br/><br/>These Saint Clans were all avoiding confrontation, and once word spread of their behavior, they would have their moment to triumph!<br/><br/>Just then, a white crane rushed toward them, carrying a beautiful woman in white on its back, her aura pure and filled with the essence of an Immortal.<br/><br/>“May I ask, who is Fellow Daoist Fang Wang?”<br/><br/>The voice of the woman in white was heard, cold yet strangely calming to the restless heart.<br/><br/>Yang Du looked up, hands on hips, and asked, “Who are you, and why not introduce yourself first?”<br/><br/>“I am Yu Zhen, known as Daoist Yu Zhen, born of the Yu Clan, disciple of Taiqing Xuanjiao. I have come here hoping to resolve the grudges,” the woman in white introduced herself.<br/><br/>As soon as they heard she was from the Yu Clan, the followers instinctively wanted to curse her, but the mention of “Taiqing Xuanjiao” stalled their anger, with even Yang Du looking moved.<br/><br/>Xiao Zi, who had never heard of Taiqing Xuanjiao before—it hadn’t experienced much before dying with the True Dragon Clan, and its soul had always remained in the Great Saint’s Grotto-Heaven—spoke without any hesitation, “You foul woman, speaking so grandly as if you were something special, daring to come here to resolve our grievances. Why don’t you die first and show us the stance of the Yu Clan?”<br/><br/>Quickly, Yang Du sent a message to Fang Wang, “Elder, Taiqing Xuanjiao is no ordinary faction. They have a long history and, it is said, once every three thousand years, they could produce an Immortal. I’ve only heard some legends about them. We’d better be cautious.”<br/><br/>Fang Wang looked up slightly, his eyes beneath the mask fixing on Daoist Yu Zhen, and he spoke calmly, “Then you should think carefully whether you are representing the Yu Clan or Taiqing Xuanjiao.”<br/><br/>Boom!<br/><br/>The domineering pressure of the Nine Dragons Tyrant Fist enveloped the sky and earth. The once-composed Daoist Yu Zhen’s expression changed dramatically.\t\t\t\t\t\t</div>", "images": {}, "success": true}