{"id": 255, "url": "https://www.novelhall.com/i-became-an-immortal-on-mortal-realm-32879/14577648.html", "title": "Chapter 255 - Chapter 255: Chapter 252: Despair Descends!_1", "volume": 3, "volume_title": "Volume 3", "body": "<h1>Chapter 255 - Chapter 255: Chapter 252: Despair Descends!_1</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 255: Chapter 252: Despair Descends!_1<br/><br/>Translator: 549690339<br/><br/>When Xiao Zi attached herself to the Heavenly Palace Halberd, dragon roars echoed out from within the halberd and reverberated beneath the firmament.<br/><br/>All the prisoners’ gazes were fixed on Fang Wang, who wielding the Heavenly Palace Halberd, looked so supremely dominant.<br/><br/>“His strongest isn’t his fists?”<br/><br/>Yang Du felt shocked, his eyes burning with an even more intense fervor.<br/><br/>Xiao Zi’s voice rang in Fang Wang’s ear, “Young Master, your Lifespirit Treasure is so powerful, and your Yang Qi is really hot! I feel like I’m about to be melted by you.”<br/><br/>Fang Wang, wearing a fox mask, had a calm gaze and ignored Xiao Zi’s antics.<br/><br/>He had already sensed the presence of the Qiu Clan’s Minor World.<br/><br/>Without any superfluous words, he took the halberd and charged forward.<br/><br/>Ahead was a desolate wasteland under a scorching sun that burned the earth and yellow sand filled the air. The presence of the Qiu Clan Great Cultivators was hidden within the wasteland ahead, but their figures were imperceptible to the naked eye.<br/><br/>After three steps, Fang Wang suddenly accelerated.<br/><br/>All the prisoners only felt a terrifying wind pressure coming at them, forcing them to circulate their Spiritual Power for defense.<br/><br/>In their field of vision, Fang Wang suddenly vanished, and with a gust of wind, a huge black hole appeared in the sky.<br/><br/>The prisoners couldn’t help but open their mouths wide, especially the leading burly guide who was completely dumbstruck.<br/><br/>With their awareness, they naturally realized that Fang Wang had forcefully broken through the Qiu Clan’s World barrier.<br/><br/>Penetrating the spatial barrier of a Minor World is exceedingly difficult, let alone the Minor World of a Great Saint Noble House like the Qiu Clan, which has existed for who knows how long. With the passage of time, it had long since become a world of its own.<br/><br/>The terror of Fang Wang breaking through space with his physical body was unimaginable.<br/><br/>Within the Qiu Clan’s World, countless floating islands hung above a sea of clouds. Looking down, there was a boundless ocean, and the number of islands in the sky was uncountable; it was impossible to see how many there were with a single glance, and there was a bright sun shining above.<br/><br/>Blue skies and white clouds—it was a scenery as beautiful as a painting.<br/><br/>At this moment, on every floating island, Cultivators were on full alert, most of them discussing how powerful the enemy must be to make the clan leader order full defenses.<br/><br/>Suddenly!<br/><br/>BOOM!<br/><br/>A black hole abruptly appeared in the sky, and violent winds surged out towards all the floating islands of the Qiu Clan. Instantly, a grey-robed man appeared at the forefront of the islands, his right hand forward, using his own Spiritual Power to resist.<br/><br/>Almost immediately, the grey-robed man furrowed his brows and swiftly raised his left hand, using both palms to resist the winds, creating a massive energy shield, larger than a mountain.<br/><br/>He fixed his gaze, and in front of the black hole in the sky, a figure appeared.<br/><br/>It was Fang Wang!<br/><br/>Fang Wang’s black robe flapped intensely; strands of Yang Qi leaked from his collar and sleeves, and the eyes of the fox mask also emitted white flames. A zhang-long Heavenly Palace Halberd was encircled by a phantom of a Purple Dragon.<br/><br/>Countless Divine Senses and gazes shot towards him—he was imperceptible to Divine Sense and those who could see him were terrified.<br/><br/>The aura and image of Fang Wang were unmistakably dangerous!<br/><br/>“Who is he?”<br/><br/>“Such a terrifying aura, what cultivation level does he possess?”<br/><br/>“He actually forced his way through the World barrier… Impossible…”<br/><br/>“Just one person?”<br/><br/>“Prepare for battle!”<br/><br/>All the floating islands erupted in a thunderous clamor as countless Cultivators rose up like a swarm of arrows, each condensing their Lifespirit Treasures in midair.<br/><br/>Fang Wang’s gaze sharpened as he charged towards the nearest floating island.<br/><br/>The grey-robed man conjured a long whip, ready to fight, but Fang Wang smashed through his physical body in a fierce collision.<br/><br/>Blood mist exploded!<br/><br/>With a deafening roar, Fang Wang pierced through a floating island, and immediately after, that island erupted with terrifying Yang Qi flames, like a volcanic eruption. The island split apart, instantly turning numerous Cultivators to ash.<br/><br/>CLANG!<br/><br/>Fang Wang’s Heavenly Palace Halberd was blocked by a pagoda; the clash of two mighty forces created visible, fearsome ripples that repelled floating islands in all directions. Below, the sea surface rose in great waves that continually collapsed into a gigantic vortex, a sight incredibly majestic.<br/><br/>The Qiu Clan patriarch Qiu Shenji, holding the pagoda, had eyes filled with terror.<br/><br/>Such great power!<br/><br/>At that moment, he truly understood that the true person of Qiu Ya had not exaggerated.<br/><br/>This was the first time he had encountered such terrifying physical strength. With his ninth layer Sky-Stepping Realm cultivation, he could tell that Fang Wang had not used his Spiritual Power at all.<br/><br/>The fox mask concealed Fang Wang’s face, preventing Qiu Shenji from probing his expression with Divine Sense, but his eyes were so cold, chilling Qiu Shenji to the core.<br/><br/>BANG!<br/><br/>Fang Wang kicked Qiu Shenji away with a full-strength blow, sending him crashing into a floating island.<br/><br/>He swiftly lifted the halberd and charged toward the closest floating island!<br/><br/>His goal was not to fight, but to kill!<br/><br/>The suppressed rage of two thousand four hundred years erupted at this moment!<br/><br/>Fang Wang thrust his halberd, and with surging Spiritual Power coupled with the Heavenly Palace Halberd’s own force, he transformed into nine ferocious Black Dragons. They were like the creator of the universe, splattering nine strokes of ink across this landscape, submerging the floating islands in their path.<br/><br/>Nine Dragons Tyrant Fist!<br/><br/>Wherever the Black Dragon went, destruction followed!<br/><br/>“How dare you!”<br/><br/>Qiu Shenji’s furious voice thundered over, turning into a falling cadence, a beam of golden light shone on Fang Wang, rendering him immobile.<br/><br/>Qiu Shenji emerged from the billowing dust, holding a treasure tower high in his right hand. A window on the treasure tower opened, and the golden light burst forth from within.<br/><br/>More and more Qiu Clan Great Cultivators rushed to kill, swiftly surrounding Fang Wang. They quickly cast spells, and in less than two breaths’ time, they successfully established a Formation. A white light curtain rose from the seabed, reaching straight to the Firmament, trapping Fang Wang within the Formation.<br/><br/>Qiu Shenji’s face contorted with rage, right hand supporting the tower, left hand flipping and slamming down with a gust that bore down like a weight. A Golden Giant Palm fell from the sky, descending next to him, like the collapse of Mount Tai, smashing towards Fang Wang bathed in golden light.<br/><br/>This palm was ten miles wide, containing immense pressure, and even the Qiu Clan Cultivators forming the array couldn’t help but be shaken to the core.<br/><br/>At this moment, a group of prisoners charged from a black hole, just in time to witness the scene of Fang Wang being suppressed. They widened their eyes, about to speak, but then they saw Fang Wang, almost as if teleporting, break free from the golden light, passing through the Formation, and shattering a floating island with his halberd.<br/><br/>“Impossible…”<br/><br/>Qiu Shenji’s eyes bulged; he had previously deduced that Fang Wang’s constitution might resist sealing, but what he had employed was his strongest Lifespirit Treasure, forming one of the Qiu Clan’s most exquisite great formations.<br/><br/>How did Fang Wang just step out of the great Formation as if nothing had happened?<br/><br/>He didn’t have time to think further, immediately pursuing Fang Wang for the kill.<br/><br/>With the agility of the ninth level of the Sky-Stepping Realm, he almost instantly traversed behind Fang Wang.<br/><br/>He struck Fang Wang’s back with his palm, and there was a ripping sound; Fang Wang’s black clothes burst apart, revealing his upper body, his frame staggering before killing in another direction.<br/><br/>Fang Wang’s upper body’s Heavenly Gang Star Acupoint had been activated, his body’s raging flame patterns vivid and lifelike. Streams of white fiery Qi surged from the acupoints, and as he sprinted at high speed, he seemed to be wearing a cloak of flames, awe-inspiring and majestic.<br/><br/>Qiu Shenji rapidly pursued.<br/><br/>Fang Wang swung his halberd again, but Qiu Shenji blocked it with his left arm.<br/><br/>Fang Wang’s speed was so fast that Qiu Shenji could only barely keep up, reacting reflexively to block.<br/><br/>With that block, Qiu Shenji felt his left arm go numb.<br/><br/>Fang Wang’s knee slammed into his chest, the terrible force dissipated Qiu Shenji’s Spiritual Power shield, his breastbone instantly caved in, and like a fallen star, he was once again blasted through a floating island.<br/><br/>Fang Wang couldn’t bother to spare Qiu Shenji a glance, abruptly turning his head, his eyes shooting forth Divine Nurturing Sword Qi.<br/><br/>The Sword Qi lashed out, tearing through the air, heading toward the Cultivators on that floating island.<br/><br/>With each second, more than three people died a violent death.<br/><br/>True Person Qiu Ya, alongside a group of Cultivators with breaths in the Divine Passage Realm and even the Sky-Stepping Realm, came to the fight, quickly surrounding Fang Wang. Countless spells and Divine Skills rained down on him.<br/><br/>This time, Fang Wang didn’t use the Jiuyou Zizaishu, but withstood it all with the Heavenly Gang Supreme Yang Tyrant Body.<br/><br/>Aside from Qiu Shenji, he simply didn’t take anyone else’s spells or Divine Skills seriously.<br/><br/>He charged forward, brandishing his overwhelming Spiritual Power. The Qiu Clan Great Cultivators standing in his way were terrified to their very core.<br/><br/>Fang Wang, like a tiger among sheep, initiated a brutal massacre.<br/><br/>The Great Cultivators desperately tried to stop him, but to no avail. Qiu Shenji blocked him time and again, but without being able to kill Fang Wang, he couldn’t restrain him either.<br/><br/>Whenever he employed sealing techniques, Fang Wang would break free using the Jiuyou Zizaishu; should he face a Formation of over a hundred people, Fang Wang would similarly escape with the Jiuyou Zizaishu.<br/><br/>The prisoners watched these scenes unfold, their excitement mounting.<br/><br/>In their eyes, Fang Wang was not incapable of killing the top-level Cultivators of the Qiu Clan; it seemed more like he was vengefully forcing the Qiu Clan’s Great Cultivators to watch their kin fall one by one, to quell the rage in his heart.<br/><br/>Yang Du roared and charged into the battlefield, with other prisoners promptly following.<br/><br/>After so many years, Yang Du’s Heavenly Body had greatly improved. His performance was very impressive, though still not as formidable as Fang Wang.<br/><br/>While fighting, he glanced over at Fang Wang.<br/><br/>Why was the senior so enraged?<br/><br/>Had the senior entered the seven clans’ prison not to save him?<br/><br/>Fang Wang was unaware of Yang Du’s thoughts, his Heart of the Heavenly Dao having entered a state of absolute focus, consumed by a single emotion.<br/><br/>Kill!<br/><br/>Boom! Boom! Boom…<br/><br/>One after another, the floating islands exploded, countless Qiu Clan Cultivators scattered like bees from a disturbed hive, their cries, shouts, and clamors filled the air.<br/><br/>Fang Wang’s figure danced everywhere, with hundreds of Qiu Clan Great Cultivators following closely behind him; each time they caught up to Fang Wang, he always managed to break free.<br/><br/>Qiu Shenji had never felt so powerless; he could feel that Fang Wang couldn’t kill him, which meant Fang Wang was not as terrifyingly strong as he seemed, but Fang Wang’s constitution was inconceivably resilient.<br/><br/>“How can such a body exist in this world…”<br/><br/>Qiu Shenji roared inwardly, signalling all the Qiu Clan to start evacuating with a transmitted message.<br/><br/>Fang Wang didn’t care about such things; wherever there were more people, that’s where he went, and even if Qiu Clan Great Cultivators protected their kin, they couldn’t stand against Fang Wang’s Jiuyou Zizaishu and overpowering strength.<br/><br/>Flesh and sand fell like torrential rain, making the already turbulent sea surface ripple even more, seeming as if it had become riddled with a thousand holes.<br/><br/>“Hahaha! What exhilaration! What thrill!”<br/><br/>Yang Du burst into laughter; his cultivation placed among the Qiu Clan meant there were too many who could subdue him, but to them, Fang Wang’s menace was so great that even if Great Cultivators wanted to suppress him, they couldn’t divert their attention from Fang Wang because he was unpredictable, and might strike at any moment.<br/><br/>Such an enemy had already struck fear, even despair, into every member of the Qiu Clan!\t\t\t\t\t\t</div>", "images": {}, "success": true}