{"id": 256, "url": "https://www.novelhall.com/i-became-an-immortal-on-mortal-realm-32879/14577649.html", "title": "Chapter 256 - Chapter 256: Chapter 253 Turmoil", "volume": 3, "volume_title": "Volume 3", "body": "<h1>Chapter 256 - Chapter 256: Chapter 253 Turmoil</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 256: Chapter 253 Turmoil<br/><br/>Translator: 549690339<br/><br/>Grand Qi, Fang Residence.<br/><br/>Zhou Xue stood on the eaves, gazing at the Fang Family Disciples in the square far away, her expression calm, but her heart was anything but.<br/><br/>She was feeling the aura coming from within the Jade Bracelet.<br/><br/>“What kind of physique is this, that even in the Nirvana Realm it could be so formidable, I fear it might already be comparable to the Sky-Stepping Realm.”<br/><br/>Zhou Xue thought in confusion.<br/><br/>She couldn’t figure it out, she could accept that Fang Wang’s talents towered above mortals, but she couldn’t understand where he got so many cultivation techniques, let alone possess such creativity.<br/><br/>She couldn’t help but feel fortunate, luckily Fang Wang was her person, if such a person became an enemy, how desperate his enemies would be.<br/><br/>Zhou Xue couldn’t help thinking back to over two hundred years ago when Fang Wang climbed through her window, not imagining that the young man would grow to such heights today.<br/><br/>And this was only in the Mortal Realm, what would it be like when Fang Wang became an Immortal?<br/><br/>A figure suddenly appeared beside her, it was the Hongxuan Emperor.<br/><br/>Hongxuan Emperor said, “Zhu Rulai has already arrived, what exactly happened that you summoned so many masters?”<br/><br/>Zhou Xue looked into the distance and said, “A Saint Clan is about to attack the Fang Family.”<br/><br/>“Saint Clan? Which one?” Hongxuan Emperor frowned and asked.<br/><br/>“Don’t worry, it has nothing to do with your descendants, it’s nothing to do with you,” Zhou Xue casually replied.<br/><br/>Hongxuan Emperor chuckled, “I have no descendants.”<br/><br/>Zhou Xue didn’t question it and said softly, “Go down and get ready.”<br/><br/>Hongxuan Emperor’s eyes turned and he asked, “Is that boy Fang Wang causing trouble? Was the prior anomaly in heaven and earth caused by him?”<br/><br/>“It’s not that he’s causing trouble, it’s just that those beings in high places think they can do whatever they want, provoking him, and he will be the scourge of those Saint Clans,” Zhou Xue glanced at him, her voice somewhat cold.<br/><br/>Hongxuan Emperor smiled and then vanished from the eaves.<br/><br/>Above the wilderness, the scorching sun burned the earth, and a huge black hole floating above the mountain range appeared like a black sun, even more eye-catching than the bright sun in the sky.<br/><br/>Suddenly!<br/><br/>Figures rushed out from within the black hole, all of them in a sorry state, all Qiu Clan Cultivators.<br/><br/>A streak of black Sword Qi burst from the black hole, sweeping past them quickly, their fleshly bodies instantly obliterated, leaving only souls, as the black Sword Qi continued its path towards the horizon.<br/><br/>The souls of the Qiu Clan Cultivators hung in the sky, each showing a look of despair and pain, following that, their souls shattered, turning into specks of light absorbed into the black hole, disappearing from sight.<br/><br/>At the same time, within the Qiu Clan’s World, there was only one in ten of the floating islands left in the sky.<br/><br/>Fang Wang held the Rainbow Sword in his right hand and the Heavenly Palace Halberd in his left, with ghostly spirits condensing behind him; this ghostly spirit had already surpassed a thousand feet in height, with its right arm brandishing a ghostly sword while a Black Dragon coiled around it, which was incredibly frightening.<br/><br/>A group of Qiu Clan Great Cultivators looked at the ghostly spirit, eyes filled with fear.<br/><br/>Qiu Shenji was dishevelled and covered in blood, with one hand supporting a tower and the other holding a flag, the gold-edged black flag was stained with bloodstains.<br/><br/>Fang Wang lifted his sword towards another direction, and the ghostly spirit also raised its sword; that direction was where a group of Qiu Clan Cultivators was trying to flee this world.<br/><br/>Qiu Shenji’s eyes were almost turning into beads of blood as he made another move, but Fang Wang had already swung his sword.<br/><br/>Zhu Xian Jing Hong Sword!<br/><br/>The Sword Qi swept over, and another several dozen Qiu Clan Cultivators were obliterated, and the ghostly spirit’s aura also increased a notch.<br/><br/>Qiu Shenji’s Spiritual Power hit Fang Wang but was directly neutralized by his Heavenly Gang Supreme Yang Tyrant Body, without even activating the Jiuyou Zizaishu.<br/><br/>The battle had been going on for several hours with more than a hundred thousand Qiu Clan people killed by Fang Wang’s hand, and a part of the Qiu Clan people had escaped.<br/><br/>Not just the middle and lower-level cultivators, many elite Qiu Clan Great Cultivators had also perished.<br/><br/>Qiu Ya Zhenren was beaten to death by Fang Wang, his fleshly body was punched into a mist of blood seven times, and his soul was absorbed by the ghostly spirit.<br/><br/>Now the Qiu Clan’s Great Cultivators no longer hoped to suppress Fang Wang, all they wanted was to drag out the time as much as possible to give the younger generation a chance to escape.<br/><br/>Qiu Shenji looked at Fang Wang, feeling utterly powerless.<br/><br/>He had used all his tricks, but he just couldn’t hurt Fang Wang.<br/><br/>Qiu Ya Zhenren didn’t exaggerate, rather he had underestimated how powerful Fang Wang’s physical body was.<br/><br/>Fang Wang truly couldn’t kill him in a short time, but if the battle continued indefinitely, he might not survive Fang Wang’s hands.<br/><br/>Qiu Shenji’s mind suddenly entertained the thought of retreating.<br/><br/>Fighting on was meaningless, the remaining Qiu Clan people who had not fled were mostly mediocre in cultivation talent, and there was no point in desperately saving them.<br/><br/>Once this thought emerged, Qiu Shenji immediately ordered, “Everyone, retreat!”<br/><br/>Having said this, he turned and struck a palm towards the horizon, piercing the firmament with one blow and creating a massive spatial rift, and he turned into a rainbow light, fleeing into it.<br/><br/>Fang Wang immediately gave chase, quickly disappearing into the darkness.<br/><br/>“Yang Du, leave the others for you to kill!”<br/><br/>Fang Wang’s voice echoed in the broken world, and upon hearing this, Yang Du grinned, his smile cruel.<br/><br/>Qiu Shenji and Fang Wang flew out from the small world, both of them moving at breakneck speeds, over mountains and desolate plains, as fast as thunder.<br/><br/>Qiu Shenji did not expect Fang Wang to dare to chase after him, as previously, Fang Wang was mostly defensive against him, mainly focusing on slaughtering his people.<br/><br/>“Damn it, I, Qiu Shenji, never imagined I would be driven to such a state by a junior of the Nirvana Realm… If this gets out, how can I show my face in the Mortal Realm?”<br/><br/>The more Qiu Shenji thought about it, the angrier he became, unable to restrain his killing intent.<br/><br/>He abruptly stopped, turned around, and looked at Fang Wang.<br/><br/>Fang Wang, wielding two Lifespirit Treasures, came charging in; the specters behind him suddenly vanished, and his body burst forth with blazing Yang Energy, turning into the sun itself.<br/><br/>He stowed away the Rainbow Sword into the Treasured Spirit Space and, with one hand, wielded the Heavenly Palace Halberd to attack Qiu Shenji.<br/><br/>Avoiding a head-on confrontation with Qiu Shenji before was mainly for the sake of revenge. Now, with most people inside the Qiu Clan’s World having been slain by him, it was time to deal with Qiu Shenji.<br/><br/>After battling for several hours, Fang Wang had a clear understanding of Qiu Shenji’s strength and methods.<br/><br/>Not killing the strongest of the Qiu Clan would render his retaliation pointless and leave hidden dangers.<br/><br/>Fang Wang silently spurred on the Heavenly Dao Immensity Scripture, reaching the peak of his momentum.<br/><br/>In the previous encounter with Qiu Shenji, he had relied mainly on his physical strength to resist. This time, in a one-on-one fight, he intended to give his all in a battle to the death.<br/><br/>Qiu Shenji swung the large flag in his hand, causing black flames to spill out on the flag’s surface, drawing a gigantic black circle of fire around him, like a portal to a different time and space. It surged with black mist, quickly turning into darkness, and within that darkness, a pair of blood-red eyes opened.<br/><br/>Underneath Fang Wang’s mask, his eyes remained unchanged, but he sensed the aura of the Underworld.<br/><br/>Qiu Shenji actually planned to summon a sinister entity from the Underworld to fight!<br/><br/>This guy really has a lot of tricks up his sleeve.<br/><br/>Unfortunately for him, Fang Wang’s Heavenly Dao Immensity Scripture, Formless Zhou Tian Technique, and Heavenly Gang Supreme Yang Tyrant Body all had repressive effects on the evils of the Underworld.<br/><br/>Fang Wang didn’t utter a word, but the killing intent in his eyes grew colder still.<br/><br/>Under the blue sky, high mountains stretched in a continuous chain, and atop one of these peaks stood a huge gate, guarded by four cultivators.<br/><br/>Suddenly.<br/><br/>The giant gate emitted a bright light, and a trembling figure walked in. His clothes were tattered, his hair was wild, and his body was covered in wounds.<br/><br/>Upon seeing the scenery of the world in front of him, his legs gave way, and he knelt on the ground.<br/><br/>The four cultivators frowned and looked at each other, showing puzzled expressions. They were about to inquire when the mysterious man suddenly looked up:<br/><br/>“Father—”<br/><br/>His cry was hoarse and piercing, startling the birds in the forests below the mountain.<br/><br/>The four cultivators were shocked, and one of them, recalling something, cautiously asked, “Are you Junior Brother Lu?”<br/><br/>At that moment, the sound of tearing through the air approached, and a middle-aged man appeared before the mysterious man, his expression full of excitement as he held him up, asking with a trembling voice, “Lin… you’re still alive… you’re still alive…”<br/><br/>The wounded Lu Lin lifted his head, eyes brimming with tears that he couldn’t stop, and gritted his teeth, “Father… I almost couldn’t see you again… The Han Clan laid a trap, captured me, and imprisoned me. I’ve endured nearly sixty years of torture. If not for Tian Dao Fang Wang’s intervention, I would’ve been better off dead…”<br/><br/>Upon hearing this, the middle-aged man’s eyes widened in rage, and he spoke in a deep voice, “The Han Clan? Why would they capture you?”<br/><br/>“It’s not just the Han Clan, but also the Qiu, Yu, Ji, Song, Wind, and Liu Clans. These seven clans joined forces to capture cultivators and monsters with exceptional talent. I was subjected to their experiments with numerous poisons; they even took my blood and organs…”<br/><br/>The more Lu Lin spoke, the more agitated he became, the sheer injustice apparent in his voice, which caused the complexions of the oncoming cultivators to change dramatically.<br/><br/>It wasn’t long before Lu Lin passed out.<br/><br/>The middle-aged man picked him up, and one of the cultivators hesitantly said, “Sect Master, the Saint Clans have a great influence and powerful foundations…”<br/><br/>“What of the Saint Clans? I will make them pay a price. Spread this far and wide, I want all cultivators to know of their vile deeds! Even if it causes upheaval, I will make these Saint Clans pay!” the middle-aged man declared, holding back his fury.<br/><br/>The sky responded, clouds amassing and thunder rumbled as if even the heavens were enraged!<br/><br/>In the dark and gloomy world, the clouds rolled and thunder struck intermittently.<br/><br/>Yang Du led over four hundred prisoners who all bore wounds and looked worn out, but the murderous intent in their eyes had yet to dissipate.<br/><br/>“Everyone, brace yourselves and search for our senior’s trace!”<br/><br/>Yang Du shouted loudly, his voice betraying his exhaustion.<br/><br/>Two days had passed since the battle with the Qiu Clan began, and Fang Wang had pursued Qiu Shenji. After two more hours of fierce fighting, the combat finally ceased. Subsequently, they were all searching for any sign of Fang Wang.<br/><br/>The intensity of Fang Wang and Qiu Shenji’s battle was so immense that they could follow the pressure left by the fight, but since the two were not only casting spells but also moving, they just couldn’t catch up.<br/><br/>A whole day went by.<br/><br/>Only when the pressure from the battle had faded did the land return to tranquility, leaving them without direction.<br/><br/>The memory of that overwhelming pressure still left them terrified.<br/><br/>They could only wonder if Tian Dao Fang Wang had managed to kill the patriarch of the Qiu Clan.<br/><br/>As they moved forward, Yang Du suddenly sensed something and looked in one direction. Following his gaze, on a ridge against the horizon was a figure sitting in meditation, back turned to them, with the setting sun perfectly poised in front of them.<br/><br/>It’s the senior!<br/><br/>Yang Du recognized Fang Wang’s figure at a glance, and his gaze shifted to the side of Fang Wang.<br/><br/>The Heavenly Palace Halberd stood beside Fang Wang, its blade impaling a corpse, its blood long since drained.\t\t\t\t\t\t</div>", "images": {}, "success": true}