{"id": 251, "url": "https://www.novelhall.com/i-became-an-immortal-on-mortal-realm-32879/14575797.html", "title": "Chapter 251 - Chapter 251: Chapter 248: Heavenly Gang Supreme Yang Tyrant Body Great Perfection!", "volume": 3, "volume_title": "Volume 3", "body": "<h1>Chapter 251 - Chapter 251: Chapter 248: Heavenly Gang Supreme Yang Tyrant Body Great Perfection!</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 251: Chapter 248: Heavenly Gang Supreme Yang Tyrant Body Great Perfection!<br/><br/>Translator: 549690339<br/><br/>Fang Wang seemed deaf to Yang Du’s shouts, never responding, not even opening his eyes.<br/><br/>Yang Du could only shut his mouth, until he was pushed into the cell and the cell door closed. Ignoring the cultivator who was sealing the formation, his gaze remained fixed on Fang Wang from afar.<br/><br/>Xiao Zi saw him and blinked at him.<br/><br/>Suddenly, Yang Du remembered that in recent years, demons had been transforming into dragons all over the world. Could it be that the snake demon that followed his senior had also become a dragon?<br/><br/>He scrutinized Xiao Zi closely, the more he looked, the more he felt the resemblance.<br/><br/>That cheekiness was something he had never seen in other demons.<br/><br/>Seeing Xiao Zi sending signals with her eyes and turning to look at Fang Wang, who seemed completely uninjured and not at all disheveled, Yang Du’s body shook with realization.<br/><br/>Could it be…<br/><br/>Something occurred to Yang Du, and he immediately became exhilarated.<br/><br/>He nodded at Xiao Zi and then turned around, imitating Fang Wang, and started to cultivate.<br/><br/>Xiao Zi tilted its head, puzzled. What was the kid nodding at?<br/><br/>It had just been teasing Yang Du with its eyes, how has he become so wretched after so many years?<br/><br/>Who would have thought that Yang Du would nod back, excited, looking almost insane!<br/><br/>Xiao Zi stopped pondering and lay down beside Fang Wang, continuing its cultivation.<br/><br/>Because of the fluctuations around Fang Wang absorbing spiritual energy, everyone assumed he was cultivating and thus did not call out to him or try to engage in conversation.<br/><br/>Just like that.<br/><br/>Three months had passed.<br/><br/>On this day.<br/><br/>Fang Wang’s consciousness shook, the familiar sensation finally arrived.<br/><br/>After a moment of dizziness, he opened his eyes and found himself within the Heavenly Palace.<br/><br/>His expression unchanged, he immediately began practicing a new body cultivation technique.<br/><br/>Unlike before, this time, Fang Wang was resolute; he wanted to master it quickly!<br/><br/>The Heavenly Gang Saint Body Technique had taken him nine hundred and sixty years, while the Vajra Invincible Saint Body had taken him one thousand seven hundred years. Even though there were similarities between the two, mastering their fusion was likely to start at a thousand years.<br/><br/>Inside the Heavenly Palace, time sped by.<br/><br/>Year after year, Fang Wang devoted himself to cultivation, with the Heavenly Palace altering its environment following his state of mind.<br/><br/>After five hundred years, Fang Wang had mastered the new technique, and his body had transformed.<br/><br/>Another seven hundred years passed before he reached Great Completion.<br/><br/>With a body of Great Completion, merging the qualities of the Heavenly Body and the Vajra Invincible Saint Body, his strength was not only more potent but also several levels higher.<br/><br/>The journey from Great Completion to Great Perfection was excruciating, but driven by fury toward the seven Saint Clans, Fang Wang gritted his teeth and continued his cultivation.<br/><br/>Throughout the process, he hardly ever stopped to rest.<br/><br/>He knew this would fester resentment in his heart, but that was exactly the resentment he wanted.<br/><br/>By the time he had thoroughly mastered Great Perfection, a total of two thousand four hundred years had passed in the blink of an eye!<br/><br/>Fang Wang then exited the Heavenly Palace.<br/><br/>Back in the cell, his eyes suddenly flew open, a faint white flame exuding from them, and his pupils flashed with white light, as if they hid two bright suns.<br/><br/>He immediately began to exercise his powers, frantically devouring the spiritual energy from the cell floor, refining his brand-new body.<br/><br/>Boom——<br/><br/>The violent spiritual energy made the ground tremble, awakening Xiao Zi and the other prisoners in their cells.<br/><br/>More and more prisoners approached the cell door. Because of the ward on the doors, they couldn’t sense Fang Wang’s aura but could only discuss among themselves.<br/><br/>“What’s going on?”<br/><br/>“It’s the spiritual energy underground that’s rioting.”<br/><br/>“This has never happened before.”<br/><br/>“Could it be that they’re setting up some formation?”<br/><br/>“No idea.”<br/><br/>The prisoners buzzed with excitement, while Yang Du looked towards Fang Wang only to meet his gaze.<br/><br/>In the dim Underground Palace, the cell holding Fang Wang was the brightest, his glowing eyes making it difficult for anyone to look away once they caught sight of them.<br/><br/>“This is…”<br/><br/>Yang Du gripped the iron bars tightly, his eyes flashing with excitement.<br/><br/>More and more people noticed Fang Wang’s anomaly, and as the violent spiritual energy poured into his body, his robes flapped wildly, and even Xiao Zi was forced to retreat.<br/><br/>“Young master…”<br/><br/>Xiao Zi watched Fang Wang with concern. It could feel a towering resentment, one even more significant than when Fang Wang had penetrated the Xuan Dynasty.<br/><br/>Fang Wang murmured to himself, “Heavenly Gang combined with Vajra Invincible, let’s call it ‘Heavenly Gang Supreme Yang Tyrant Body’ then.”<br/><br/>Transforming the Saint Body into the Tyrant Body, the very word ‘tyrant’ signified his readiness to be domineering!<br/><br/>He would disregard right and wrong, good and evil; he was determined to make all of the seven Saint Clans pay for Han Huitian and the six others’ deeds!<br/><br/>Upon hearing this, Xiao Zi’s dragon body shook.<br/><br/>Heavenly Gang Supreme Yang Tyrant Body!<br/><br/>Could it be that the young master had merged the Heavenly Gang Saint Body with the Vajra Invincible Saint Body?<br/><br/>Xiao Zi’s blood boiled with excitement. It knew Fang Wang wouldn’t sit idly by; his arrival was to shift the battle away to spare the Fang Family from the war’s impact.<br/><br/>Boom<br/><br/>Suppressed thunderous sounds began to resonate inside the Underground Palace, and the prisoners became even more curious, all of them staring at Fang Wang.<br/><br/>Fang Wang’s anomaly and the trembling of the Underground Palace were clearly connected!<br/><br/>Just then, a procession of figures appeared in front of Fang Wang’s prison gate.<br/><br/>It was Han Huitian, Qiuyan Zhenren, Songhan Xianzi, and Liu Jun.<br/><br/>The four Sky-Stepping Realm Great Cultivators looked at Fang Wang with furrowed brows. When their eyes met his, their hearts all skipped a beat.<br/><br/>“Go in!”<br/><br/>Han Huitian said in a deep voice, following up by starting to remove the seals on the prison gate.<br/><br/>Elsewhere.<br/><br/>Within a loft, Feng Wuzong and Ji Zhan sat across from each other drinking wine.<br/><br/>Ji Zhan looked out the window, where thunderclouds rolled in and obscured the bright moon, adding to the oppressive atmosphere. He withdrew his gaze and smiled, “We should thank our friend for capturing Tian Dao Fang Wang this time. Without your calculations, we would have returned without any success, much to the dishonor of the Saint Clans.”<br/><br/>The corner of Feng Wuzong’s mouth lifted in a cold smirk. “Blame Fang Wang for having a nephew who likes to meddle. I heard that Fang Jing loves to act the hero, so I purposely protected that woman in secret, allowing her to escape to Fang Jing’s vicinity before letting the Wind Clan’s descendants strike.”<br/><br/>Ji Zhan chuckled and shook his head, “Aren’t you afraid that your junior would kill Fang Jing?”<br/><br/>“I made my move as well when they fought,” said Feng Wuzong, expressionless.<br/><br/>Ji Zhan raised an eyebrow and looked at him with a changed gaze, sighing, “Ruthless enough. In that case, only our two families can possess the treasure body.”<br/><br/>Feng Wuzong snorted, “He’s just a junior with mediocre talent. His death is no loss. But since there has been a sacrifice, indeed the treasure body can only be claimed by us. It would be nice if the other families can gain any advantage.”<br/><br/>Ji Zhan’s nonchalant response came with a smirk, “Then let’s discuss how our two families should share the treasure body. I have a suggestion, no matter which family possesses the body, we must establish a marital alliance and preserve the bloodline. What do you think?”<br/><br/>“That is a good proposal.”<br/><br/>Feng Wuzong expressed his admiration, and the two exchanged a smile.<br/><br/>A bolt of heavenly thunder struck down, and the lightning cast their shadows on the wall, resembling two clawed and fanged demons.<br/><br/>Inside the cell.<br/><br/>Qiuyan Zhenren and Liu Jun held Fang Wang’s shoulders, while Songhan Xianzi stood behind Fang Wang, blocking Xiao Zi.<br/><br/>“What are you trying to do?”<br/><br/>Xiao Zi yelled angrily, ready to pounce on Songhan Xianzi at any moment.<br/><br/>Fang Wang’s indifferent voice rang out, “Xiao Zi, just stay aside. They can’t do anything to me.”<br/><br/>As these words were spoken, Songhan Xianzi covered her mouth and chuckled, “Young friend Tian Dao is indeed full of confidence. It’s no wonder you dared to come with us. Could it be that you’ve mastered some miraculous technique during this half year that you think can defeat the seven of us in the Sky-Stepping Realm?”<br/><br/>Fang Wang did not reply.<br/><br/>Han Huitian stood in front of Fang Wang, gathering Spiritual Power in his right palm. He said in a grave tone, “There’s something wrong with this kid’s treasure body. Just to be safe, I’ll extract his soul first!”<br/><br/>As he spoke, his right palm landed on Fang Wang’s head.<br/><br/>Fang Wang’s mouth curved upward. He offered no resistance and continued to absorb Spiritual Energy.<br/><br/>Streams of Yang Energy surged out of his body, instantly igniting into flames, causing Qiuyan Zhenren and Liu Jun, who were holding him, to frown deeply. They had to use their own Spiritual Power to resist it.<br/><br/>Han Huitian’s expression changed drastically, and a look of astonishment crossed his eyes. He gritted his teeth, “Impossible… How can you be without a soul?”<br/><br/>Without a soul?<br/><br/>Qiuyan Zhenren, Songhan Xianzi, and Liu Jun all froze, wondering if they had heard wrong.<br/><br/>Han Huitian then increased his Spiritual Power, refusing to believe it. Fang Wang’s state clearly showed signs of conscious awareness, impossible for someone in a soulless state.<br/><br/>Boom!<br/><br/>Fang Wang’s Yang Energy erupted, sending Qiuyan Zhenren, Liu Jun, and Songhan Xianzi flying back. The terrifying flames of Yang Energy burned fiercely, turning everything inside the cell to ash.<br/><br/>The firelight cast onto Han Huitian’s face, and suddenly a hint of joy flickered in his eyes.<br/><br/>“Something’s not right, I will possess him first!”<br/><br/>Han Huitian said solemnly, then his Primordial Spirit left his body, diving into Fang Wang’s forehead.<br/><br/>Qiuyan Zhenren and the others were shocked and panicked. They couldn’t worry about anything else and rushed forward, once again holding Fang Wang down.<br/><br/>At the same time, Han Huitian arrived inside Fang Wang’s body. He seemed to be in the depths of the universe, all around was pitch black. He looked around.<br/><br/>He saw a bright light and immediately rushed towards it.<br/><br/>Soon, he saw Fang Wang’s Primordial Spirit, meditating in the darkness, emitting bright light from all over his body.<br/><br/>Han Huitian’s eyes gleamed with greed, and with a ferocious smile, he charged forward.<br/><br/>The eyes of Fang Wang’s closed-eyed Primordial Spirit suddenly opened, and he laughed eerily.<br/><br/>In reality.<br/><br/>Fang Wang and Han Huitian were both frozen in place, but Fang Wang’s Yang Energy was still growing.<br/><br/>“Damn it, are we really going to let him possess the body?” Liu Jun said unwillingly.<br/><br/>Songhan Xianzi’s eyes flickered, “What if we attack him now?”<br/><br/>Qiuyan Zhenren said in a deep voice, “If we attack now, he will surely be seriously injured, effectively declaring war with the Han Family. Besides, Fang Wang’s condition is truly abnormal.”<br/><br/>He used his own Spiritual Power to suppress Fang Wang’s body, but he couldn’t hold it down.<br/><br/>He could feel an unimaginable force accumulating within Fang Wang, ready to burst forth.<br/><br/>Not just him, even Songhan Xianzi and Liu Jun felt it, which is why they didn’t attack Han Huitian.<br/><br/>From a distance, Yang Du shouted, “Hey, you four, for offending my senior, you will all die miserably. Don’t forget the fate of Emperor Sea Mysterious Dynasty, be careful or your Saint Clans may follow in the Xuan Dynasty’s footsteps.”<br/><br/>As soon as these words were spoken, the faces of Songhan Xianzi and the others changed slightly, and their eyes revealed terrifying killing intent.<br/><br/>Puff—<br/><br/>Han Huitian suddenly spat out blood, and a white light shot out from Fang Wang’s forehead, entering Han Huitian’s body. Han Huitian staggered backwards.<br/><br/>He clutched his chest, opened his eyes wide with bloodshot eyes, and said with a trembling voice, “You… who exactly are you?”<br/><br/>Upon hearing this, Songhan Xianzi, Qiuyan Zhenren, and Liu Jun were all startled and quickly retreated to the edges of the cell.<br/><br/>Fang Wang’s black hair danced wildly, and he still sat on the ground without rising. He slightly lifted his chin, looking at Han Huitian with a cold gaze.<br/><br/>“He is right. The fate of the Xuan Dynasty is what awaits you Saint Clans.\t\t\t\t\t\t</div>", "images": {}, "success": true}