{"id": 254, "url": "https://www.novelhall.com/i-became-an-immortal-on-mortal-realm-32879/14576754.html", "title": "Chapter 254 - Chapter 254: Chapter 251: Success, Revenge!", "volume": 3, "volume_title": "Volume 3", "body": "<h1>Chapter 254 - Chapter 254: Chapter 251: Success, Revenge!</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 254: Chapter 251: Success, Revenge!<br/><br/>Translator: 549690339<br/><br/>Ji Zhan and his five companions fled, and thereafter, no one hindered Fang Wang’s practice.<br/><br/>After a full three hours passed, the violent winds within the broken small world subsided, the thunderclouds in the sky began to disperse, and the invisible, intangible Heavenly Might had also vanished.<br/><br/>Yang Du, along with over four hundred prisoners, all stared at Fang Wang, dumbstruck.<br/><br/>Fang Wang still floated in the air, his body bare, with streams of white flame-like energy circling around him, conveniently providing modesty. His upper body was covered with golden flame patterns, and at the interstices of these patterns were nodes shining like blazing suns, the manifestations of the Heavenly Gang Star Acupoints. Faint strands of white energy were escaping from these acupoints, forming ribbons that wrapped around his body and trailed behind him, making the golden flame patterns on his body even brighter.<br/><br/>There was also a golden fine line on his forehead, curving like a delicate flame, adding a touch of majesty to his originally beautiful and perfect face.<br/><br/>Fang Wang looked down, observing his physique and feeling the torrential power and Yang Energy within himself.<br/><br/>At this moment, his body had become an indestructible vajra-like entity!<br/><br/>His self-healing ability far surpassed that of the Heavenly Body, and in terms of the hardness of his flesh, muscles, and bones, he was much stronger than before!<br/><br/>Moreover, there was an almost infinite and vigorous Yang Energy!<br/><br/>In the future, even if he ran out of Spiritual Power, he could continue to fight using Yang Energy.<br/><br/>The power of Supreme Yang had a strong restraining effect on souls, evil spirits, and extreme Yin monsters.<br/><br/>With just this body alone, he was already several times more powerful than before.<br/><br/>This is the formidable aspect of a physique cultivation technique, once mastered, it could immediately transform one, and during the transformation, Fang Wang’s cultivation had greatly increased, bringing him close to the Nirvana Realm Eighth Layer, saving him years of arduous practice.<br/><br/>Seeing Fang Wang in such a state, the four hundred prisoners looked up as if witnessing an Immortal’s descent.<br/><br/>This piece of the small world was already in ruins, with space at the edge of the sky collapsing; more and more darkness swallowed the sky, and the few rays of sunlight that remained shone down on Fang Wang.<br/><br/>Xiao Zi coiled behind him, her dragon eyes filled with admiration as she gazed at him.<br/><br/>Fang Wang slowly opened his mouth and asked, “Which clan is the closest from here?”<br/><br/>At his words, a man dressed as a traveler bellowed loudly, “The Qiu Clan, I know where their clan territory is!”<br/><br/>These prisoners were no unknown figures; among them were humans and monsters. Many cultivators and monsters had dealings with the seven great noble houses, so it was not unusual for them to know the locations of the Saint Clans.<br/><br/>“Lead the way,” Fang Wang spoke softly, yet his voice thundered through the heavens and seas. He ascended and landed atop Xiao Zi, then took a black robe from the Dragon Jade Ring and donned it.<br/><br/>The traveler immediately led the way, the prisoners stepped aside, watching as Fang Wang flew past them, following behind Xiao Zi.<br/><br/>Yang Du flew alongside Xiao Zi, level with the dragon’s head, and excitedly asked, “Senior, were you just practicing the Heavenly Body?”<br/><br/>He knew that Fang Wang had a Cultivation Technique for practicing the Heavenly Body.<br/><br/>With a calm face, Fang Wang replied, “What I have cultivated is the Heavenly Gang Supreme Yang Tyrant Body.”<br/><br/>The Heavenly Gang Supreme Yang Tyrant Body?<br/><br/>All the prisoners took note of this name and after careful thought could not recall ever hearing it from memory.<br/><br/>But one thing they were sure of was that the Heavenly Gang Supreme Yang Tyrant Body was powerful!<br/><br/>The six Great Cultivators had taken turns attacking him for so long, but without lifting a finger, Fang Wang remained unscathed. Such a physique was indeed worthy of the title ‘Tyrant Body’!<br/><br/>With the guidance of the traveling man, Xiao Zi dove into a spatial rift, emerging high above a continent. Below them lay rolling mountains and intersecting rivers. The thunderclouds in the sky had not yet completely dispersed, a testament to the world celebrating Fang Wang’s mastery of the Heavenly Gang Supreme Yang Tyrant Body.<br/><br/>The traveler only paused briefly before quickly determining the direction, speeding forward, with Xiao Zi and the other prisoners following suit at increased speed.<br/><br/>In the Underground Palace, the seven Saint Clans had not restricted their cultivation. Even after experiencing a great battle, they still had the Spiritual Power to fly.<br/><br/>They were all unbearably excited, eager to see the Qiu Clan’s land flow with blood.<br/><br/>Inside a gloomy palace, the grand door suddenly opened.<br/><br/>Qiu Cliff, looking somewhat disheveled, rushed in like a gale, stopped before the steps, and gritted his teeth, “Clan Leader, disaster has struck. We couldn’t suppress Fang Wang, Han Huitian is dead, and Fang Wang wants revenge. With those prisoners guiding him, he’s likely to make his way to our clan territory.”<br/><br/>Atop the steps sat a person in meditation on a cushion, clad in white with a black cape draped over. His face appeared to be in his early forties, and his presence was not overly strong, but rather, he exuded a gentle temperament.<br/><br/>Hearing Qiu Cliff’s message, Qiu Shenji opened his eyes.<br/><br/>Without a change in expression, Qiu Shenji asked, “What about the others?”<br/><br/>“They all fled. Ji Zhan used a secret technique from the Ji Family, expending much of his vitality, and despite our combined efforts, we couldn’t execute Fang Wang. Fang Wang’s precious body is too strong, absolutely a physique that is a marvel of the ages. Compared to the rank of his spirit, his physique is even more terrifying!” Qiu Cliff said through gritted teeth.<br/><br/>Remembering what had transpired, fear filled his eyes.<br/><br/>The unknown was the most terrifying!<br/><br/>In his view, Fang Wang’s lack of action was due to his practice. Before the technique was even completed, they were powerless against him. Once the technique was perfected…<br/><br/>Unable to imagine what would happen once Fang Wang entered the Qiu Clan territory, the thought alone sent shivers down his spine.<br/><br/>With a furrowed brow, Qiu Shenji said, “Your cultivation stands at the fourth layer of the Sky-Stepping Realm. Across the Qiu Clan, you rank among the top five in strength. Yet you are in such panic. Should the Qiu Clan really flee?”<br/><br/>Qiu Ya the Real Person gritted his teeth and said, “Clan Leader, I suggest we migrate…”<br/><br/>“Nonsense, the Qiu Clan’s foundation has been passed down for forty thousand years. Although it’s not what it once was, how can we relocate our ancestral land? Tell me everything that happened to you previously, I don’t believe that Fang Wang could be strong enough to annihilate the entire Qiu Clan, isn’t he not even three hundred years old?”<br/><br/>Qiu Shenji said in a deep voice, finally losing his composure, his tone laced with a hint of anger.<br/><br/>Qiu Ya the Real Person took a deep breath and recounted everything he had witnessed and heard.<br/><br/>As Qiu Shenji listened, a look of astonishment appeared in his eyes, and his brows furrowed tighter and tighter.<br/><br/>After a long while.<br/><br/>Qiu Shenji’s eyes flickered, and he said, “Fang Wang took action against Song Han the Fairy and she only sustained some internal injuries?”<br/><br/>Qiu Ya the Real Person nodded and said, “That’s correct, but this can’t be used to measure Fang Wang’s strength, after all…”<br/><br/>“How can it not? You just can’t kill Fang Wang, but if he could kill you, wouldn’t he have done so? To leap from not being able to kill you to the strength needed to exterminate the Qiu Clan, throughout history, no Cultivation Technique could achieve this level of power, only the legendary techniques that reportedly turn one into an Immortal on the spot could do so, and those are all made-up. If Fang Wang really became an Immortal, there would be nowhere for us to flee to.”<br/><br/>Qiu Shenji snorted coldly, and upon hearing this, Qiu Ya the Real Person calmed down.<br/><br/>Right.<br/><br/>Fang Wang had not shown any power that could threaten them, except that his physical body seemed almost indestructible.<br/><br/>Isn’t the Heavenly Body said to be the so-called immortal physique?<br/><br/>“Perhaps Fang Wang’s constitution is stronger than the Heavenly Body, not only possessing formidable self-healing ability but also able to guard against soul possession and sealing, which is why you could do nothing against him,” Qiu Shenji speculated.<br/><br/>Although Qiu Ya the Real Person felt a sense of anger as if he were being played with, thinking back on Fang Wang’s previous energy and gaze, he still felt somewhat afraid.<br/><br/>He hesitated, “What if Fang Wang really poses a threat to the Qiu Clan, what then?”<br/><br/>Qiu Shenji stood up and huffed, “Our Qiu Clan is a Great Saint Noble House that has stood in the Mortal Realm for over forty thousand years. Throughout history, how many troubles have we encountered? How could we be shaken by one man alone? Even if there were truly any unexpected turn of events, we’d simply retreat. Besides, the Qiu Clan has descendants in many places in the Mortal Realm; wanting to completely exterminate us is wishful thinking!”<br/><br/>“Summon all the clan elders and prepare to face Fang Wang. I want to see on what basis this young man dares to claim himself the Heavenly Dao!”<br/><br/>These words, brimming with boldness, stirred Qiu Ya the Real Person’s pride as well. He immediately nodded and went down to issue the orders.<br/><br/>The Qiu Clan was located within a continent that was even larger than the Descending Dragon Continent, with an even more flourishing atmosphere of Cultivation. Along the way, Fang Wang and his companions attracted many curious gazes, constantly scanned by divine consciousnesses.<br/><br/>The prisoners following Fang Wang were not easy targets; having been imprisoned for years, each harbored resentment. Thus, when faced with inquisitive divine consciousnesses, they didn’t hesitate to retaliate.<br/><br/>Fang Wang stood on the Dragon Head, silently looking into the distance.<br/><br/>He could feel the Qiu Clan’s momentum.<br/><br/>To be accurate, it was the aura of Qiu Ya the Real Person and a group of powerful Cultivators. Was the Qiu Clan preparing to battle him?<br/><br/>Fang Wang admitted that he was indeed not strong enough to effortlessly crush those in the Sky-Stepping Realm, but even without a huge disparity, he was ready to battle.<br/><br/>He wanted the Qiu Clan to feel his killing intent!<br/><br/>Fang Wang took a Fox Mask out of the Dragon Jade Ring and put it on his face; it was given to him by Qing Wan’er of the Mountain God Clan.<br/><br/>The current Mountain God Clan had become a famous and powerful spirit clan in Grand Qi, even revered by the royal family as divine beasts, and Qing Wan’er had become strong enough to stand on her own. During their previous meeting at the Fang Residence, after so many years, Qing Wan’er acted quite reserved around him.<br/><br/>“Young Master, I have a secret technique that can assist you in battle, I wonder if you would disdain it,” Xiao Zi suddenly said.<br/><br/>Only Fang Wang’s eyes were visible beneath the Fox Mask, and they were cold. He asked, “What secret technique is it?”<br/><br/>“I can transform into a weapon or a Magical Artifact; this is one of the True Dragon Clan’s native Divine Skills that I awoken to during my earlier transformation into a dragon. However, even with this transformation, my strength will not surge dramatically,” Xiao Zi explained with a tone of pride.<br/><br/>Such are the bestowed advantages of the True Dragon Clan, innately possessing Divine Skills!<br/><br/>Fang Wang fell silent for a moment, then materialized the Heavenly Palace Halberd and said, “When the time comes, coil around it.”<br/><br/>The Heavenly Palace Halberd was already engraved with dragon patterns, and if an actual True Dragon took hold of it, it would truly be formidable.<br/><br/>“Okay!”<br/><br/>Xiao Zi said excitedly, concerned that the Young Master might reject it.<br/><br/>Meanwhile, Yang Du was vehemently inciting the prisoners at the back, hoping that all the prisoners would join the battle. Even if they couldn’t take on the Qiu Clan’s Great Cultivators, they could at least kill some of the Qiu Clan’s underlings.<br/><br/>After all, they weren’t like Fang Wang and hadn’t been treasured by the seven Saint Clans. During the years they were imprisoned, they often suffered from sealing and endured torture because the Saint Clans wanted to understand their natural talents and treasures, even using them as test subjects for spiritual medicines, causing them indescribable suffering.<br/><br/>Some female Cultivators and female Monsters suffered devastation beyond what ordinary people could imagine.<br/><br/>They, too, harbored a deep resentment in their hearts!<br/><br/>As they flew by, mountain ranges and rivers rapidly moved in reverse below them.<br/><br/>After a long while.<br/><br/>The leading burly guide shouted, “Predecessor, we’re almost there!”<br/><br/>Upon hearing this, Xiao Zi let out a long cry, and then transformed into a purple light that flew towards the Heavenly Palace Halberd. A Purple Dragon coiled around the shaft, then entered into it, turning into scales.\t\t\t\t\t\t</div>", "images": {}, "success": true}