{"id": 253, "url": "https://www.novelhall.com/i-became-an-immortal-on-mortal-realm-32879/14576753.html", "title": "Chapter 253 - Chapter 253: Chapter 250 Worldwide Change, Unique Achievements Through The Ages", "volume": 3, "volume_title": "Volume 3", "body": "<h1>Chapter 253 - Chapter 253: Chapter 250 Worldwide Change, Unique Achievements Through The Ages</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 253: Chapter 250 Worldwide Change, Unique Achievements through the Ages<br/><br/>Translator: 549690339<br/><br/>Jian Feng Wuzong and Song Han Fairy’s spells failed to shake Fang Wang’s physical body, with Ji Zhan, Qiu Ya Zhenren, Liu Jun, and Yu Ling Long following suit, casting Divine Skills, lights of various colors dazzling between heaven and earth, and even more scorching waves of air rose from the tumultuous sea.<br/><br/>Lava, poison fog, thunder, cold winds, and so on, with numerous spells and Divine Skills falling on Fang Wang one after another. His physical body stood suspended in the air, unmoving.<br/><br/>He slowly lifted his eyes, the Heavenly Dao Imperial Dragon Crown burst forth with vast divine light, the incoming Spiritual Energy formed multicolored streaks of clouds, twisting with the winds, no amount of spells could conceal his figure.<br/><br/>The robes on Fang Wang’s body had already torn apart, leaving only a few Magical Artifacts on him, the Heavenly Yang Energy shielding his lower body, with the upper body that he exposed, although covered in blood stains, it was clear to see that his physical body contained terrifying power.<br/><br/>He looked from afar at Ji Zhan and the six from Feng Wuzong, saying, “If this is all the strength you possess, then you certainly cannot kill me.”<br/><br/>The Heavenly Body combined with the Vajra Invincible Saint Body, his physical body had reached a point where it couldn’t be measured by realms!<br/><br/>This was his first real sensation of the self-healing ability of the Heavenly Body, or more precisely, the self-healing power of the Heavenly Gang Supreme Yang Tyrant Body!<br/><br/>From a distance, while battling, Yang Du finally caught sight of Fang Wang.<br/><br/>“The predecessor’s Heavenly Body indeed went ahead of me…”<br/><br/>Yang Du admired inwardly, his gaze towards Fang Wang filled with fervor.<br/><br/>The six of them had such a formidable aura, he had lived for so long, this was the first time he encountered such a powerful aura, yet their combined efforts couldn’t shake the senior’s physical body.<br/><br/>The gap was so vast!<br/><br/>Ji Zhan and the others grew more fearful as the battle progressed, holding nothing back, they were resolute in their decision to slay Fang Wang, and even this small piece of heaven and earth began to collapse due to their Spiritual Power.<br/><br/>But no matter how they cast their spells, they just could not annihilate Fang Wang’s physical body.<br/><br/>Yu Ling Long even used a sealing spell, but her sealing spell entered Fang Wang’s body like a stone sinking into the sea, without the slightest impact or response.<br/><br/>Fang Wang made no counterattacks, but they could all feel his blood energy increasing at an inconceivable speed.<br/><br/>They dared not imagine how powerful Fang Wang would be once his divine body achieved Great Completion.<br/><br/>“No good! We can’t kill him!”<br/><br/>Liu Jun gritted his teeth and said, his hands continuously casting spells, spells and Divine Skills coming out in succession, dazzling and effortless.<br/><br/>His gaze towards Fang Wang no longer held greed but fear.<br/><br/>At that moment, they neither could retreat nor continue the fight, finding themselves caught between a rock and a hard place.<br/><br/>The thought of Fang Wang achieving success and breaking free caused him to break out in cold sweat, his heart filled with dread.<br/><br/>Fang Wang would certainly seek vengeance on them, vengeance upon their clans!<br/><br/>Ji Zhan took a deep breath, bellowed with rage, “Everyone, channel your Spiritual Power into my body.”<br/><br/>Feng Wuzong seemed to think of something, his complexion changed, and he asked, “Could it be that you want to use…”<br/><br/>“Hurry up!”<br/><br/>Ji Zhan shouted sternly, and upon hearing that, Feng Wuzong, Song Han Fairy, Liu Jun, Yu Ling Long, and Qiu Ya Zhenren immediately went behind him, channeling their Spiritual Power into his body.<br/><br/>In an instant, Ji Zhan’s aura soared, his hands danced in front of him, his palms moving like two fishes, the speed of his gestures growing faster, seemingly writing characters in front of him.<br/><br/>Soon, a huge golden compass phantom condensed in front of him, its surface etched with mysterious runes, moving in unfathomable trajectories, and as the golden compass grew larger, a terrifying might condensed within.<br/><br/>Fang Wang fixed his gaze upon it, squinting his eyes.<br/><br/>Ji Zhan roared, his palms pushing forward suddenly, the golden compass expanding fiercely, erupting with countless golden beams. On closer inspection, those were streams of golden flames, like a meteor shower, illuminating the whole world, striking towards Fang Wang with different curving arcs.<br/><br/>The momentum was vast; the thunder clouds were shredded, and the terrifying waves below collapsed.<br/><br/>Countless golden flames passed through Fang Wang and Xiao Zi, their figures disappearing. The golden flames were clearly extraordinary, impermeable to sight, and beyond the reach of divine senses for investigation.<br/><br/>Ji Zhan tensed his mind, maintaining his offensive. Beams of golden flames intertwined, blasting into the ocean and piercing through the clouds in the Firmament, both heaven and sea suffering the destruction wrought by this spell.<br/><br/>Pfft—<br/><br/>Ji Zhan couldn’t help but spurt a jet of blood, splashing on the golden compass and immediately evaporating.<br/><br/>He did not stop, but maintained his offensive.<br/><br/>Expectation filled the eyes of the five people behind him.<br/><br/>With such a Divine Skill, it truly might be possible to annihilate Fang Wang!<br/><br/>As this small piece of heaven and earth continued to shatter, the fierce wind howled in, carrying with it copious Spiritual Energy.<br/><br/>Simultaneously, thunderclouds also rolled over Grand Qi, a tremendous Heavenly Might enveloping all creatures.<br/><br/>Fang Residence.<br/><br/>Zhou Xue stood under the eaves, looking to the sky. Her left hand touched the Jade Bracelet on her right wrist, her eyes revealing a look of anticipation.<br/><br/>“With such a phenomenon, what extraordinary Cultivation Technique are you practicing…”<br/><br/>Zhou Xue murmured to herself, her tone filled with emotion and expectation.<br/><br/>In her previous life, before her ascension, there were almost no such phenomena in the Mortal Realm, so she was very eager to see Fang Wang’s current fortune.<br/><br/>In that moment, a figure appeared beside her—it was Chai Yi, the Vice Sect Leader of Great Abyss Gate, whose true identity was Tu Caiyi, the Jin Xiao Sect Dong Shitian King.<br/><br/>“Another mysterious cultivator has infiltrated Grand Qi, now heading for Southern Hills City,” said Tu Caiyi softly.<br/><br/>Zhou Xue’s expression was indifferent as she replied softly, “Capture them, and if they resist violently, then kill them.”<br/><br/>“Yes!”<br/><br/>After Tu Caiyi acknowledged, she disappeared on the spot.<br/><br/>Zhou Xue continued to gaze at the phenomenon in the sky, her thoughts unknown.<br/><br/>Suzhen Palace.<br/><br/>On an island, Gu Li sat cross-legged under a tree adorned with pink blossoms that occasionally fell. She gazed up at the firmament.<br/><br/>Rolling thunderclouds shrouded the sky, and the pressure of heavenly might was extremely oppressive.<br/><br/>For some reason, Gu Li couldn’t help but think of Fang Wang.<br/><br/>After so many years, she wondered if he was safe and what realm his cultivation had attained.<br/><br/>Ever since Tai Xi returned, Gu Li’s status at Suzhen Palace had soared. She wasn’t naive; she understood she was being given special care, but this unexplained concern unsettled her, especially since Suzhen Palace did not forbid her to marry or form a cultivation partnership, which worried her even more.<br/><br/>In the end, she met Tai Xi and learned that Tai Xi had given her special consideration on account of Fang Wang, which greatly relieved her.<br/><br/>Receiving Fang Wang’s favor did not make Gu Li feel ashamed or disgraced; on the contrary, she felt a secret delight.<br/><br/>Determined to repay Fang Wang in the future, she began to devote herself to intensive cultivation, scarcely resting.<br/><br/>At this moment, within Suzhen Palace, it wasn’t just Gu Li who was concerned for Fang Wang; Tai Xi felt the same.<br/><br/>Tai Xi stood before the gate of her Daoist palace, also looking up at the sky.<br/><br/>Her intuition told her that this anomaly was very likely related to Fang Wang.<br/><br/>The Saint Clans capturing Fang Wang were probably eyeing his physical body.<br/><br/>Recalling Fang Wang’s performance during the Hongxuan Emperor’s assessment, her worries gradually dissipated.<br/><br/>He was so powerful, he couldn’t possibly have fallen.<br/><br/>But why couldn’t she settle her heart?<br/><br/>Within the collapsing miniature world, Ji Zhan gasped for air, his hair had turned white, and he looked significantly older. His lips were cracked, his complexion pale.<br/><br/>Feng Wuzong, the Song Clan’s Cold Immortal Maiden, and the others were also exhausted, but they hadn’t paid the same price as Ji Zhan. They anxiously gazed ahead.<br/><br/>A giant fireball with a diameter of over ten thousand zhang floated in midair, its golden flames slowly dispersing.<br/><br/>Unable to see the specific situation inside, they waited with bated breath.<br/><br/>As the golden flames continued to spread, their hearts sank and their bodies began to tremble when Xiao Zi’s dragon head came into view.<br/><br/>The thirty zhang-long Xiao Zi coiled within the sea of fire, with Fang Wang in front of it.<br/><br/>Fang Wang continued to absorb nature’s spiritual energy voraciously, sunlight scattered over his upper body, revealing a perfect physique—muscular without being bulky, embodying a majestic aesthetic of power that appeared both human and beast-like at just a glance.<br/><br/>White flames kept spilling from his eyes, and a fine line now marked his brow.<br/><br/>“How is this possible… Impossible…”<br/><br/>Ji Zhan trembled, his eyes bloodshot, unable to accept the reality before him.<br/><br/>He had used a secret technique and expended half of his life force to weaken his lifespan, gathering the spiritual power of other five Sky-Stepping Realm cultivators, yet he could not annihilate Fang Wang who was in the Nirvana Realm?<br/><br/>He couldn’t comprehend, and he was on the verge of collapse.<br/><br/>The other five felt the same, their gaze towards Fang Wang filled with terror. At that moment, they regretted their actions.<br/><br/>Fang Wang looked at them with myriad feelings welling up inside him.<br/><br/>What an overbearing secret technique!<br/><br/>He had only endured it for five breaths and felt close to his limit, forcing him to use the Jiuyou Zizaishu to protect himself.<br/><br/>Though he appeared calm and untroubled, surviving the ordeal had drained most of the Spiritual Power from the Heavenly Dao Imperial Dragon Crown.<br/><br/>There was no denying that Ji Zhan’s secret technique was formidable.<br/><br/>He feared that even if he achieved the Heavenly Gang Supreme Yang Tyrant Body, he would not be able to withstand this technique with ease.<br/><br/>When Fang Wang’s gaze fell upon the six Great Cultivators, they were so frightened they seemed to shatter, vanishing from the spot immediately.<br/><br/>They had fled!<br/><br/>The cultivators from the seven clans who had been capturing prisoners seemed to receive a message and began to abandon battle, following each other into a rift in the sky, escaping from this miniature world.<br/><br/>Fang Wang didn’t give chase but continued to absorb the spiritual energy of nature.<br/><br/>Yang Du flew over, maintaining a distance of ten li, and called out loudly, “Senior, how do you plan to deal with the seven Saint Clans?”<br/><br/>At his words, the remaining prisoners turned their expectant gazes towards Fang Wang.<br/><br/>“The Ji Clan, Wind Clan, Liu Clan, Qiu Clan, Song Clan, Yu Clan, Han Clan—if anyone knows the location of their clan territories, you may stay and lead the way for me. I will flatten them, exterminate their entire clans.”<br/><br/>Fang Wang’s voice rang out, his tone indifferent.<br/><br/>The prisoners didn’t react with fear but became excited instead.<br/><br/>Having been captured by the seven Saint Clans meant they were either current top talents or powerful rulers in their own right. They had all been tortured and held deep hatred for the seven Saint Clans, naturally hoping to see them annihilated.<br/><br/>Instantly, the prisoners started declaring their willingness to guide Fang Wang or even to boost his morale.<br/><br/>Aside from a few prisoners who fled, more than four hundred stayed behind, waiting for Fang Wang to succeed.<br/><br/>Spiritual Energy surged toward Fang Wang—a clear sign he was practicing a powerful cultivation technique. They were curious and full of anticipation.<br/><br/>They had witnessed the recent battle, and in their view, the six from the Ji Clan were no match for Fang Wang!\t\t\t\t\t\t</div>", "images": {}, "success": true}