{"id": 258, "url": "https://www.novelhall.com/i-became-an-immortal-on-mortal-realm-32879/14578168.html", "title": "Chapter 258 - Chapter 258: Chapter 255: Justice For All, Buddhist Sect", "volume": 3, "volume_title": "Volume 3", "body": "<h1>Chapter 258 - Chapter 258: Chapter 255: Justice For All, Buddhist Sect</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 258: Chapter 255: Justice for All, Buddhist Sect<br/><br/>Translator: 549690339<br/><br/>Feeling the might of the Nine Dragons Tyrant Fist, Daoist Yu Zhen’s heart was struck with overwhelming shock and awe. She had long known that Fang Wang was formidable; otherwise, he wouldn’t have pushed the seven Great Saint Clans to their wits’ end. However, only when she faced Fang Wang did fear truly grip her.<br/><br/>She suddenly realized that she had been reckless and should not have directly sought out Fang Wang.<br/><br/>The reason she dared to come was that she had understood the causes and consequences; the seven Great Saint Clans had not harmed the Fang Family but merely failed to conspire against Fang Wang. Perhaps the murderous intent in his heart had already diminished significantly considering the many people from the Qiu Clan he had killed.<br/><br/>Yet, she had still underestimated the fury within Fang Wang.<br/><br/>This puzzled her, and her intuition told her that there might be something the Yu Clan had hidden from her in the letter they sent.<br/><br/>The over four hundred followers didn’t feel as uncomfortable as Daoist Yu Zhen, but they could all sense the power of Fang Wang’s fist. Seeing Daoist Yu Zhen moved to action, they all felt a sense of satisfaction in their hearts.<br/><br/>What of the Taiqing Xuanjiao?<br/><br/>The Heavenly Dao they followed had no fear of the Taiqing Xuanjiao!<br/><br/>Fang Wang simply watched Daoist Yu Zhen, waiting for her to make a decision.<br/><br/>Under the scrutiny of all present, Yu Zhen Daoist had no choice but to say through gritted teeth, “I am naturally here representing Taiqing Xuanjiao… I too wish for peace in the world. If you continue with the slaughter, you will become a demon, and how will all cultivators in the world view you… Murder is paid for with life, it’s only fair. The seven Great Saint Clans have wronged you, but you have already killed so many. Isn’t it time to…”<br/><br/>At this point, she couldn’t go on. Fang Wang had not interrupted her, but his gaze made her increasingly lose confidence.<br/><br/>Fang Wang then asked, “Does Taiqing Xuanjiao aspire to uphold justice for all under heaven?”<br/><br/>“Not to uphold, but to strive for the world’s justice.”<br/><br/>“Then may I ask how Taiqing Xuanjiao plans to confront the actions of the seven Great Saint Clans? Don’t tell me the seven Great Saint Clans are innocent and I’m the one being unreasonable?”<br/><br/>“Of course not, you have indeed been wronged, but fighting fire with fire, using killing to stop evil, is truly not the best course of action. If this continues…”<br/><br/>Daoist Yu Zhen’s pupils constricted as she saw Fang Wang raising his fist, scaring her into silence.<br/><br/>Fang Wang calmly said, “If you can withstand my punch, I will no longer pursue the Yu Clan. Do you dare?”<br/><br/>Upon hearing his words, Daoist Yu Zhen’s face paled.<br/><br/>The followers began to mock her openly.<br/><br/>“Sacrifice yourself to bring peace to the world, isn’t that a noble cause?”<br/><br/>“From what I see, she’s all talk and no action, putting on a virtuous front.”<br/><br/>“Justice for all? Peace in the world? Ridiculous, we’ve all lived for hundreds of years. Are we still playing children’s word games?”<br/><br/>“What’s this? Hasn’t Taiqing Xuanjiao taught its disciples any responsibility?”<br/><br/>“Indistinct right and wrong, it seems Taiqing Xuanjiao is not as just as the legends say.”<br/><br/>The words of Daoist Yu Zhen had completely incensed the followers.<br/><br/>When they were tortured, where was Taiqing Xuanjiao?<br/><br/>Instead of confronting the seven Great Saint Clans right away, Taiqing Xuanjiao had come to pressure them into letting the matter go. How could they tolerate this?<br/><br/>Of course, the most important reason they dared to ridicule her was that Fang Wang had pressured Daoist Yu Zhen into speaking in low tones.<br/><br/>Daoist Yu Zhen’s expression flickered. Her intuition told her that if Fang Wang’s punch were to come, it would be a lethal move.<br/><br/>Eventually, she couldn’t overcome the fear in her heart. With gritted teeth, she said, “In that case, do as you please.”<br/><br/>Having said that, she turned to leave.<br/><br/>“Wait!”<br/><br/>When Fang Wang’s voice reached her, Daoist Yu Zhen instinctively turned back to look, only to see a Black Dragon in her eyes, bearing its fangs and claws as it pounced on her, its roar exploding in her ears like the sky collapsing.<br/><br/>With a boom!<br/><br/>A black dragon, not so gigantic, passed through her body and rushed towards the horizon, disappearing from view.<br/><br/>Daoist Yu Zhen’s eyes were wide as blood poured from her mouth. Her body trembled, unable to utter a word.<br/><br/>Fang Wang stood atop Xiao Zi, calmly watching her, and said, “That punch was because you come from the Yu Clan. I spared you as a courtesy to Taiqing Xuanjiao. If there is a next time, Taiqing Xuanjiao won’t be able to save you. Then, I’ll have to ask Taiqing Xuanjiao myself if their actions are always this domineering.”<br/><br/>In his eyes, Daoist Yu Zhen had come alone, which was clearly not Taiqing Xuanjiao’s idea. If Taiqing Xuanjiao had truly wanted to back up a family, how could they only send a disciple of that family?<br/><br/>Daoist Yu Zhen waved the banner of Taiqing Xuanjiao to protect the Yu Clan.<br/><br/>Hearing his words, Daoist Yu Zhen wiped the blood from the corner of her mouth, painstakingly paid her respects, and then turned to leave.<br/><br/>Yang Du excitedly said, “Her daring to plead for the Yu Clan suggests they haven’t left yet, right? We must hurry and not let them escape.”<br/><br/>Fang Wang nodded, and upon seeing this, Yang Du immediately ordered the guide to quicken the pace.<br/><br/>Daoist Yu Zhen, heading in the same direction as them, saw Fang Wang and his group catching up, so she landed in the mountains and valleys below to begin healing her injuries with her powers.<br/><br/>Fang Wang ignored her petty tricks and continued onward.<br/><br/>In the mountains, Daoist Yu Zhen healed while looking into the distance. The sparse trees didn’t fully obscure her vision, and Fang Wang’s retreating figure was etched deeply into her heart.<br/><br/>She felt the domineering energy in her body, her eyes filled with anxiety.<br/><br/>Even though she had confidence in the Yu Clan, facing a powerful opponent like Fang Wang, she feared the Yu Clan might be at a disadvantage.<br/><br/>After the interlude with Daoist Yu Zhen, Fang Wang and his companions traveled at full speed.<br/><br/>Six days later.<br/><br/>They finally arrived near the territory of the Yu Clan, hidden within the habitat of the Demon Race, along the way, monsters could be seen everywhere in the tall mountains and deep forests, some as huge as mountains lying between peaks; if one didn’t get close, it would be hard to distinguish them as beasts.<br/><br/>“Awooooo—”<br/><br/>On a mountaintop, a demon wolf as large as a wild buffalo howled at the sky. In an instant, the howling of myriad beasts resonated from all directions, shaking the heavens and earth, causing the forests to tremble.<br/><br/>Fang Wang stood atop Xiao Zi, unaffected.<br/><br/>The followers were not afraid either; even the weakest among them had reached the Mahayana Realm of cultivation, so they did not fear these monsters, especially with a strong cultivator like Fang Wang present.<br/><br/>Fang Wang narrowed his eyes; he sensed the presence of a small world.<br/><br/>He raised his right hand and waved forward, the Heavenly Palace Halberd appeared out of nowhere by his side, and with terrifying speed, it shot towards the horizon.<br/><br/>Boom!<br/><br/>The blue sky at the horizon was pierced by the Heavenly Palace Halberd; the heavens shattered like a mirror, revealing a vast dark void.<br/><br/>Still so domineering!<br/><br/>Although the followers had witnessed Fang Wang’s domineering power more than once, each time they saw it, they were astounded.<br/><br/>The destruction wrought by such formidable power held a beauty that most cultivators aspired to.<br/><br/>Fang Wang and his companions did not slow down and continued to fly forward.<br/><br/>Fang Wang raised his hand to call back the Heavenly Palace Halberd, Xiao Zi clearly felt a powerful presence within the Yu Clan territory; it immediately shrank and entered into the Heavenly Palace Halberd, coating the halberd with a layer of dragon scales. A shadow of a Purple Dragon entwined around the Heavenly Palace Halberd, like a dragon soul, making the halberd’s aura even stronger.<br/><br/>“Amitabha, Benefactor Fang, you have already killed so many people. Has the hatred in your heart not yet dissipated?”<br/><br/>A stern voice echoed through the heavens and earth, and immediately thereafter, a huge Golden Buddha flew out of the dark void, seated on a golden lotus pedestal. Even while sitting, it was a thousand zhang tall, its whole body appearing as if crafted from gold, with rigid features exuding an imposing aura without anger.<br/><br/>Around the Thousand-Zhang Golden Buddha, numerous golden halos of varying sizes continued to appear, followed by the emergence of Buddhas from within.<br/><br/>“The Buddhist Sect! How did they get here?”<br/><br/>Yang Du clenched his teeth, his face grave.<br/><br/>The followers who recognized the identity of the Buddhist Sect also showed changed expressions.<br/><br/>First Taiqing Xuanjiao, now the Buddhist Sect; the energy of the Seven Great Saint Clans was beyond their imagination.<br/><br/>They involuntarily looked towards Fang Wang, who wore a Fox Mask, and combined with the Formless Zhou Tian Technique, no one could peer into his expression.<br/><br/>Fang Wang began to accelerate, flying alone towards the many Buddha Cultivators of the Buddhist Sect; his silhouette gave his followers a sense of unstoppable determination, as if to say, “Who else but me?”<br/><br/>“Amitabha!”<br/><br/>The voice of the Golden Buddha sounded again, and as the words fell, a thunderous rumbling descended from the sky, followed by a domineering pressure.<br/><br/>All the followers instinctively looked up to see countless golden palm imprints appearing in the sky, falling like meteors to the earth with immense momentum, their edges aflame. The area they covered spanned over a hundred li, targeting Fang Wang.<br/><br/>Fang Wang lifted his right hand, thrusting forward with his halberd, and nine huge Black Dragons shot out rapidly, twisting their bodies with the frenzied energy of dancing demons as they attacked the Buddha Cultivators of the Buddhist Sect.<br/><br/>In the blink of an eye, eighteen Buddha Cultivators appeared before the giant Golden Buddha, sweeping their palms forward simultaneously.<br/><br/>Boom!<br/><br/>A burst of golden light erupted, a golden barrier formed before the Thousand-Zhang Golden Buddha, blocking the impact of the nine Black Dragons, but it only caused them to pause; the golden barrier immediately shattered and the eighteen Buddha Cultivators spat blood as they were flung back.<br/><br/>The Thousand-Zhang Golden Buddha then pushed forward with his palm, dispersing the nine Black Dragons. The black mist spread, enveloping the Thousand-Zhang Golden Buddha as if black flames were swirling around him.<br/><br/>The myriad golden palm imprints landed on Fang Wang, failing to shake his frame; he retracted his halberd and stepped forward in midair.<br/><br/>Golden palm imprints exploded around him, like a grandiose display of golden fireworks. His advancing form had the air of invincibility about it, which excited his followers, while the faces of the Buddha Cultivators were marked with solemnity as they furrowed their brows.<br/><br/>“Amitabha, the prowess of your Nine Dragons Tyrant Fist truly lives up to its name, Benefactor Fang. To execute a fist technique using your Lifespirit Treasure, it seems your mastery of this technique has reached its pinnacle. With such talent, why choose to be a demon? If you cultivate with dedication, perhaps you could become a Great Saint. Then, you would have the power to establish order in the Mortal Realm.”<br/><br/>The voice of the Thousand-Zhang Golden Buddha rose again, tone commanding, showing no indication of his emotions.<br/><br/>Fang Wang, under the onslaught of countless palm imprints, reflected the golden light on his Fox Mask, making his gaze sparkle with strange light.<br/><br/>His voice resonated, “Does the Buddhist Sect truly wish to become involved in this karma?”<br/><br/>The Thousand-Zhang Golden Buddha replied, “Amitabha, the Yu Clan once showed grace to the Buddhist Sect, which obliges us to lend aid. Benefactor, the causality of your situation still requires investigation, and it is not yet clear who orchestrated these matters. Moreover, the other Saint Clans have fled, leaving only the Yu Clan. Why not give the Yu Clan a chance to explain?”<br/><br/>“If they wish to explain, why doesn’t the Yu Clan Patriarch come out?”<br/><br/>“Benefactor Fang’s divine skills are unparalleled, and this humble monk feels compelled to mediate. I hope that you can restrain your desire to kill.”<br/><br/>White flames erupted from Fang Wang’s body, as the Heavenly Dao Immensity Scripture was activated, causing his aura to surge vastly.\t\t\t\t\t\t</div>", "images": {}, "success": true}