{"id": 261, "url": "https://www.novelhall.com/i-became-an-immortal-on-mortal-realm-32879/14580808.html", "title": "Chapter 261 - Chapter 261: Chapter 258: Divine Power To Sever Fate", "volume": 3, "volume_title": "Volume 3", "body": "<h1>Chapter 261 - Chapter 261: Chapter 258: Divine Power To Sever Fate</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 261: Chapter 258: Divine Power to Sever Fate<br/><br/>Translator: 549690339<br/><br/>Emperor Tao and Dust-Light Divine Monk chatted while flying, their cultivation so profound that they traveled at incredible speeds.<br/><br/>After a long time.<br/><br/>They finally arrived at the battlefield where Fang Wang and the Suppressing Evil Golden Buddha had clashed. All that met their eyes was a land riddled with wounds, not a single spot left intact. The air was thick with the acrid smell of scorched earth and blood, rendering the whole world murky and turbid.<br/><br/>Emperor Tao raised his eyebrows, his gaze becoming ice cold.<br/><br/>Dust-Light Divine Monk sighed and said, “Only the Buddha Cultivator’s aura remains; it seems we are too late.”<br/><br/>Without responding, Emperor Tao sped up, with Dust-Light Divine Monk closely behind him.<br/><br/>The two of them swept across hundreds of miles before coming to a halt together. Following their gaze, one could see a Golden Buddha sitting cross-legged amidst the ruins, with a severed mountain face behind it, still splattered with blood.<br/><br/>The Suppressing Evil Golden Buddha!<br/><br/>Emperor Tao and Dust-Light Divine Monk didn’t look at the Suppressing Evil Golden Buddha; their focus was on a figure in the air.<br/><br/>Fang Wang!<br/><br/>At this moment, Fang Wang’s black clothes were torn, barely covering his body. His fox mask was, however, unscathed. He held the Heavenly Palace Halberd in one hand, floating in midair. The phantom of a Purple Dragon coiled around the halberd, and despite the chaos of the world around him, his dominant aura was like that of a demonic god.<br/><br/>Emperor Tao scrutinized Fang Wang, his eyes growing brighter.<br/><br/>Dust-Light Divine Monk stared at Fang Wang with a slight frown.<br/><br/>Glancing over, Fang Wang asked, “Have you two also come to aid the Yu Clan?”<br/><br/>He had felt Dust-Light Divine Monk’s aura earlier, which was similar to that of the Suppressing Evil Golden Buddha, but even more unfathomable and mysterious. However, the other party had shown no killing intent, and they also would not be this slow, so he had spared the Suppressing Evil Golden Buddha, waiting to see the attitude of those who approached.<br/><br/>After days of fierce battle, the Suppressing Evil Golden Buddha had lost its ability to fight. The Reincarnation Bell had absorbed most of its soul, transferring it into the Ghost Divine Body. Even if it survived, its cultivation would regress.<br/><br/>Emperor Tao smiled and said, “Of course, we are here to assist you. Otherwise, why would we not have made a move?”<br/><br/>With palms pressed together, Dust-Light Divine Monk added, “Amitabha, thank you for your mercy.”<br/><br/>His cultivation was so profound that he could tell at a glance that the Suppressing Evil Golden Buddha had lost its will to fight, and had Fang Wang wished to kill it, it would have been dead before he even arrived.<br/><br/>What astonished him the most was that on the way here, he had not detected Fang Wang’s presence at all, not even with his divine senses.<br/><br/>He was now even more interested in Fang Wang.<br/><br/>Fang Wang turned to face them, waiting for them to state their intentions.<br/><br/>Emperor Tao continued, “I am here by Emperor Donggong’s command to ensure you justice. Emperor Donggong is the ruler of the Eastern Mortal Realm, wielding the world’s righteousness.”<br/><br/>Following, Dust-Light Divine Monk said, “My Dharma name is Dust-Light, with a deep connection to the Buddhist Sect. Foreseeing their unjust actions, I have come to intervene. I did not expect that you, on your own, would be able to suppress the Golden Buddha of the Buddhist Sect. Truly, your talent is unparalleled in the world.”<br/><br/>Both of them had studied Fang Wang and knew of his youth. In their eyes, Fang Wang was a peerless genius, at least there was no such talent in the Eastern Mortal Realm.<br/><br/>Fang Wang calmly asked, “I’m not sure how you intend to handle this matter. Are you here to mediate, or to punish the seven Saint Clans?”<br/><br/>He had never heard of Emperor Donggong, who claimed to be a ruler. Why had Zhou Xue never mentioned him?<br/><br/>It seemed Emperor Donggong’s time was running out.<br/><br/>Emperor Tao said, “The foundations of the seven clans are incalculable. To my knowledge, apart from the Qiu Clan and the Yu Clan, the other clans have already withdrawn. Your relentless pursuit will only fall into their traps. Come with me to meet Emperor Donggong, for if he establishes the truth, he can strip the Great Saint’s fate from the seven clans. This would be more effective than your current chase.”<br/><br/>Following, Dust-Light Divine Monk said, “Amitabha, the Buddhist Sect has gone astray, and I must properly enlighten them. You need not worry about the Buddhist Sect seeking retribution for this. As for the Yu Clan, I’m sure they have already paid the appropriate price.”<br/><br/>Meet Emperor Donggong?<br/><br/>Fang Wang’s brows furrowed beneath the mask. He did not know Emperor Donggong, and if Emperor Donggong was affiliated with the seven clans, wouldn’t he be walking into a trap?<br/><br/>Even with Jiuyou Zizaishu at his disposal, Emperor Donggong was clearly one of the strongest beings in half the Mortal Realm, and he could not afford to be careless.<br/><br/>Just then, Fang Wang suddenly felt a fluctuation of consciousness from the jade bracelet on his right hand.<br/><br/>Immediately, he sent his consciousness into the bracelet.<br/><br/>“Go see Emperor Donggong, he won’t harm you,” Zhou Xue’s voice came through.<br/><br/>Upon hearing this, Fang Wang’s mind cleared, and he transmitted another matter into the bracelet.<br/><br/>He pulled his consciousness back, and rather than answering immediately, he feigned hesitation.<br/><br/>Neither Emperor Tao nor Dust-Light Divine Monk were in a rush.<br/><br/>Dust-Light Divine Monk flew to the Suppressing Evil Golden Buddha, looked down at him, and said, “Amitabha, you have used the teachings of Buddha not to save lives, but for selfish scheming, contravening morality and human ethics. Do you have any regrets?”<br/><br/>The Suppressing Evil Golden Buddha struggled to lift his eyes, which looked cloudy and lost. He was unable to answer Dust-Light Divine Monk.<br/><br/>With a sigh, Dust-Light Divine Monk raised his hand and, astonishingly, brought the Suppressing Evil Golden Buddha into his sleeve.<br/><br/>Before long, a group of cultivators and monsters flew in from afar.<br/><br/>All of them were followers of Fang Wang. After this battle, their numbers had dwindled to fewer than four hundred, but upon seeing Fang Wang’s figure, all their faces lit up with exhilarated smiles.<br/><br/>Fang Wang spoke, “Like me, they have all been imprisoned by the seven clans, and they can testify to the crimes of the clans.”<br/><br/>Emperor Tao laughed, “Fang Wang, this affair is already known throughout the land. An investigation would merely be a formality; the seven clans will be severely punished without need for their testimony.”<br/><br/>Upon hearing this, Fang Wang turned to look at Yang Du and the others and said, “You have followed me through many battles, and I understand your intentions. If you have nowhere else to go, then head to Grand Qi Sword Heaven Marsh. When Kunlun is established in the future, you will be my first followers. Are you willing?”<br/><br/>At these words, the followers were overjoyed and repeatedly thanked Fang Wang.<br/><br/>“Senior, they are…” Yang Du asked with a frown.<br/><br/>Fang Wang replied, “They are here to assist me. You need not worry, and if I wished to leave, no one could keep me.”<br/><br/>Yang Du found this to be reasonable and nodded immediately.<br/><br/>Emperor Tao, however, looked at Fang Wang with a surprised expression. Such confidence?<br/><br/>But then he remembered that he hadn’t noticed Fang Wang’s presence before and couldn’t help thinking that maybe Fang Wang hadn’t been exaggerating.<br/><br/>Perhaps Fang Wang wasn’t the strongest, but he surely possessed some of the most formidable escape techniques.<br/><br/>Yang Du left with the followers, and Fang Wang took the Heavenly Palace Halberd back into the Treasured Spirit Space, with Xiao Zi revealing her form.<br/><br/>Fang Wang caught the exhausted Xiao Zi in his arm and then looked at Emperor Tao and said, “Let’s go.”<br/><br/>Emperor Tao smiled and nodded, then looked at the Dust-Light Divine Monk.<br/><br/>The Dust-Light Divine Monk said, “Amitabha, you may go. I need to make a trip to the Buddhist Sect.”<br/><br/>Emperor Tao bowed respectfully to him and then flew westward, with Fang Wang following closely behind.<br/><br/>The Dust-Light Divine Monk hovered in the air as he watched Fang Wang’s departing figure, finger-calculating and wearing an odd expression.<br/><br/>“A man beyond the reach of fate, how strange…”<br/><br/>The continent where the Yu Clan resided belonged to one of the Seven Seas and Fifteen Continents, a landmass far larger than the Descending Dragon Continent. According to Emperor Tao, the Descending Dragon Continent could no longer be counted among the fifteen continents since most of its territory sank beneath the sea during a great war ten thousand years ago.<br/><br/>Through Emperor Tao, Fang Wang also learned about the Seven Seas, including the Emperor Sea and the Southern Celestial Sea, which are part of the Seven Seas. The remaining five seas were even more vast and divided into many marine regions.<br/><br/>Aside from those five seas, the Southern Celestial Sea itself was divided into numerous marine regions. Even in Fang Wang’s view, this mortal realm was truly vast, far exceeding the Earth of his previous life.<br/><br/>Emperor Donggong dwelt on the Human Emperor Continent in the Canghai, governed by a powerful dynasty known as the Grand Yu Divine Dynasty. Established for four thousand years, it never expanded beyond the continent. The people of this dynasty devoted themselves to studying the Dao, aiming to achieve the heights of the Grand An Divine Dynasty. Emperor Donggong was the master of this divine dynasty, pursuing the path to becoming a Great Emperor.<br/><br/>The same was true for Emperor Tao, who once served as the emperor of a dynasty favored by fate. After his abdication, he became a disciple of Emperor Donggong, jointly pursuing the Imperial Dao.<br/><br/>In Emperor Tao’s descriptions, Emperor Donggong was a true Great Cultivator and an enlightened man. Whenever there was great turmoil in the world, all clans and sects would request his intervention because Emperor Donggong possessed the Divine Power to Sever Fate.<br/><br/>He could sever the fate of any clan, sect, or dynasty in the world. With his intervention, the Seven Clans could be eradicated.<br/><br/>Fang Wang became interested in the divine powers of Emperor Donggong. What sort of divine skill could sever someone’s fate?<br/><br/>Seven days later.<br/><br/>The two flew into the vast Canghai, taking two more days to reach the Human Emperor Continent from its edge.<br/><br/>After a full nine days, Fang Wang finally witnessed the splendor of the Grand Yu Divine Dynasty.<br/><br/>As soon as they flew into the continent, Fang Wang was hit by a surge of spiritual energy so potent that it made him stop in his tracks.<br/><br/>What a magnificent spiritual energy!<br/><br/>Cultivating in this place, the efficiency would be dozens, even hundreds of times greater than in Grand Qi, and the spiritual energy here was even purer.<br/><br/>Xiao Zi was equally astonished, her dragon eyes widened in admiration, “Such spiritual energy is comparable to that of the Descending Dragon Continent in its prime.”<br/><br/>Emperor Tao laughed and said, “Due to the failure of the Descending Dragon Great Saint, Emperor Donggong has insisted on following the path of the Grand An Divine Dynasty. The construction beneath this continent has been ongoing for over four thousand years. Rather than aiming to dominate the world, Emperor Donggong hopes to create a second Grand An Divine Dynasty.”<br/><br/>The Grand An Divine Dynasty!<br/><br/>Fang Wang realized that as he came into contact with people of higher and higher levels, the frequency with which the name Grand An Divine Dynasty was mentioned also increased.<br/><br/>On the Human Emperor Continent, cities stood in great numbers, each with its own great formation. Here, humans and monsters coexisted, and Fang Wang saw almost no conflict in his flight—both cultivators and monsters were in cultivation.<br/><br/>Aside from the cities, the expanse outside was also filled with figures dedicated to cultivation.<br/><br/>Fang Wang was astounded. How many years would Grand Qi have to develop to have such a cultivation atmosphere?<br/><br/>The hardest thing for humans to overcome is the heart of strife and self-interest. To have a divine dynasty where all beings are focused on cultivation seemed nearly impossible in Fang Wang’s eyes before.<br/><br/>The differentiation between the weak and the strong was destined to create social classes, or so he previously thought.<br/><br/>Before long, Fang Wang, following Emperor Tao, entered the Imperial City.<br/><br/>The scale of the Imperial City was definitely the largest Fang Wang had ever seen, yet he barely had time to take it all in before Emperor Tao led him into the Imperial Palace of Emperor Donggong.<br/><br/>Along the way, there were surprisingly few guards.<br/><br/>Eventually, Fang Wang landed in a garden, and his gaze fell upon a man in a small pavilion.<br/><br/>It was Emperor Donggong.<br/><br/>Emperor Donggong set down his wine cup and looked at Fang Wang, then his eyes locked onto the Dragon Jade Ring on Fang Wang’s right finger.\t\t\t\t\t\t</div>", "images": {}, "success": true}