{"id": 269, "url": "https://www.novelhall.com/i-became-an-immortal-on-mortal-realm-32879/14583850.html", "title": "Chapter 269 - Chapter 269: Chapter 266: The Power Of Extinction_1", "volume": 3, "volume_title": "Volume 3", "body": "<h1>Chapter 269 - Chapter 269: Chapter 266: The Power Of Extinction_1</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 269: Chapter 266: The Power of Extinction_1<br/><br/>Translator: 549690339<br/><br/>When the Zhu Xian Jing Hong Sword was unleashed, the towering ghostly god stood over five hundred zhang tall upon the earth, with the vast river before it resembling a mere ditch. Both Hong Xian’er and Xu Qiuming were witnessing such a stance of the ghostly god for the first time and were deeply shocked.<br/><br/>The astonishment brought by the ghostly god was not just due to its size but also the terrifying aura it emitted. Merely a glance at it made both feel as if they were facing death itself.<br/><br/>It was not just them; the Night Monarch on the opposite shore felt the same.<br/><br/>Looking at the stature of the ghostly god, the Night Monarch was moved, and his eyes revealed a color of excitement.<br/><br/>“Sword Dao… it is Sword Dao… never did I imagine that such Sword Dao existed in this world…”<br/><br/>The Night Monarch spoke with a trembling voice, his body shaking with excitement.<br/><br/>The ghostly god might seem unrelated to Sword Dao, yet as a sword cultivator, the Night Monarch could feel the Sword Intent within the ghostly god.<br/><br/>To be precise, this ghostly god was a manifestation of Sword Intent!<br/><br/>The Night Monarch grinned and suddenly burst into a hearty laugh, exclaiming, “Junior, come and slay me. If I perish by your hand, all my Sword Intent shall become yours!”<br/><br/>He then raised his right hand, with vigor surging from the center of his palm, condensing into a long sword. The sword blade was a blue-green color, with strands of Sword Qi winding from the tip down to the hilt, creating an extraordinary momentum.<br/><br/>A surge of Sword Intent burst forth, making the morning sky display a deep blue river of stars, with countless stars adorning it, turning the heavens and earth into a scene of enchantment.<br/><br/>Fang Wang lifted the Rainbow Sword, and the ghostly god also raised its sword.<br/><br/>The Night Monarch’s face showed a wild grin, and laughing loudly said, “Fang Wang, remember my Sword Intent. This is the Sword Intent cultivated over four thousand years!”<br/><br/>“This one stroke…”<br/><br/>Before he could finish, Fang Wang suddenly struck with his sword, and the ghostly god did the same.<br/><br/>The speed of this stroke was extremely fast, so fast that even Hong Xian’er’s eyes could hardly keep up.<br/><br/>The Night Monarch instinctively struck back, and as he lifted up his Lifespirit Treasure sword, the great river was torn asunder, and a chilling cold burst forth from the ground, but alas, the rising cold could not match the speed of the ghostly god’s sword strike.<br/><br/>Still, there was that terrible Sword Qi like ink across the heavens and earth, devouring everything in its path.<br/><br/>The Night Monarch’s pupils dilated suddenly, subconsciously raising his sword to block.<br/><br/>Boom—<br/><br/>The black Sword Qi engulfed his figure, and in the direction of the land below him, a massive ravine was cleaved, and even the majestic mountains at the horizon were split in two in an instant.<br/><br/>Xu Qiuming instinctively widened his eyes, unable to believe what he was seeing.<br/><br/>Such fast Sword Qi!<br/><br/>Such terrifying destructive power!<br/><br/>Before he could come to his senses, a thunderous roar followed, shaking the heavens and earth. It was the impact of the Sword Qi dispersing the Night Monarch’s Sword Intent.<br/><br/>Emperor Donggong in the distant Imperial Palace opened his eyes and looked toward the sky outside the palace, muttering to himself, “Such Sword Intent, yet still untraceable by divine sense. Fang Wang, what kind of legacy do you carry within you? The legacy of the Descending Dragon Great Saint and the Absolute Emperor are but parts of you. I truly look forward to your future, wondering if there will be a chance to witness you at your peak.”<br/><br/>Emperor Donggong chuckled and then closed his eyes, saying, “Night Monarch, go ahead and scout the path to the Underworld for me.”<br/><br/>Dust flew up, and the chilling cold clung to the broken earth like flames.<br/><br/>The Night Monarch, with his robe torn to shreds, stood amid the rubble, gasping heavily, his sword-holding hand trembling. He could no longer maintain the composure he had before.<br/><br/>Following his gaze, the ghostly god—more towering than the mountains—hovered in front of him, its ghost sword’s tip less than ten zhang away. Compared to the terrifying figure of the ghostly god, that distance meant the ghost sword could easily reach out and impale him with a mere nudge.<br/><br/>“Three strokes… I never imagined I could only withstand three strokes…”<br/><br/>The Night Monarch said with a bitter smile. His sword kept shattering and reforming; he had exerted all his strength but couldn’t make his Lifespirit Treasure come together again.<br/><br/>Rumble—<br/><br/>Rumbling thunderclouds suddenly gathered, a tremendous Heavenly Might descended, and the morning sunlight was quickly obscured.<br/><br/>Across the river, Xiao Zi, Hong Xian’er, and Xu Qiuming were all staring intently at the head of the ghostly deity.<br/><br/>Xiao Zi was excited, Hong Xian’er was shocked, and Xu Qiuming simply couldn’t understand the battle that had just taken place.<br/><br/>Suspended behind the ghostly deity’s head were streams of black Qi that coiled like dragons around a scroll of darkness. Its shape was visible, though the engravings on the scroll were unclear. The scroll spun chaotically, and from a distance, it appeared even larger than the ghostly deity’s head, as if it were the manifestation of some Divine Skill, eerie and profound.<br/><br/>It was the Mie Jue Divine Tome!<br/><br/>Fang Wang had already mastered the Mie Jue Divine Tome to the Great Perfection and could display it simultaneously with other Divine Skills. He had infused the Sword Qi of the Zhu Xian Jing Hong Sword with the extinctive power of the Mie Jue Divine Tome, which allowed him to destroy the Lifespirit Treasure of the Sky-Stepping Realm in just two strikes.<br/><br/>Compared to when he was hunting down the seven clans, he had undergone a complete transformation.<br/><br/>The Mie Jue Divine Tome could extinguish not only destiny and bloodlines but also Lifespirit Treasures!<br/><br/>Having suppressed his fury for thirteen thousand years, Fang Wang already harbored a deep resentment. Now that someone had come to him seeking death, he naturally showed no mercy!<br/><br/>Furthermore, he could feel that the Night Monarch wanted to kill him!<br/><br/>It was a perfect opportunity to test the power of the Mie Jue Divine Tome!<br/><br/>The Mie Jue Divine Tome came with the Extinction Divine Art. Fang Wang was now invoking the mental method of the Extinction Divine Art, generating Extinction Divine Power within himself and merging it with his own Spiritual Power, imbuing his strength with the might of annihilation!<br/><br/>This trial pleased him greatly, finding the Mie Jue Divine Tome not only comprehensive but also perfectly compatible with various supreme techniques, which made him respect the Absolute Emperor even more.<br/><br/>“What did you say your sword was, earlier? Sorry, I interrupted you before. You can finish now, before you die, so you’ll have no regrets.”<br/><br/>Fang Wang floated in front of the ghostly deity, looking down on the Night Monarch with an indifferent expression and asked.<br/><br/>The Night Monarch looked up at him, laughing bitterly, “Junior, you really have the manner of my younger days, truly… a damn good actor…”<br/><br/>Fang Wang’s face remained expressionless as he once again raised the Rainbow Sword in his hand.<br/><br/>The vast Heavenly Might continued unabated, the thunder sounding suppressed and frightful, as if the heavens and the earth were wailing for the Great Perfection’s Mie Jue Divine Tome.<br/><br/>The ghostly deity also raised his sword, as even more mysterious black Qi burst forth from the Mie Jue Divine Tome behind his head.<br/><br/>The Night Monarch slowly bowed his head, realizing he was not only unable to condense his Lifespirit Treasure but even his body was on the verge of collapse, with his organs continuously rupturing and his Primordial Spirit likewise in tatters.<br/><br/>A domineering and unimaginable Mysterious Power was ravaging him.<br/><br/>Somehow, it made him think of extinction.<br/><br/>This power was extinguishing his very existence.<br/><br/>The Night Monarch hung his head, his disheveled hair obscuring his face, and he murmured to himself in a low voice, “Senior Brother… I never imagined you would pass on this supreme technique to him… nor did I expect him to master it so quickly… Haha, compared to him, Senior Brother, your talent is nothing special…”<br/><br/>Fang Wang swung his sword down, and the ghostly deity did the same.<br/><br/>A sword stroke fell, and the colors of heaven and earth faded!<br/><br/>A black Sword Qi descended, and the Night Monarch disappeared amidst the crumbling earth.<br/><br/>The wild wind howled towards Hong Xian’er, Xu Qiuming, and Xiao Zi, snapping them back to their senses.<br/><br/>“This aura… It’s like my father’s back then…”<br/><br/>Hong Xian’er’s eyes widened in disbelief, murmuring to herself, her voice trembling.<br/><br/>The Mie Jue Divine Tome!<br/><br/>It had to be the Mie Jue Divine Tome!<br/><br/>In just half a year, Fang Wang had already learned the Mie Jue Divine Tome?<br/><br/>At that moment, she felt as bewildered as Xu Qiuming did when he first saw her use the Celestial Sword Intent, finding the world utterly absurd.\t\t\t\t\t\t</div>", "images": {}, "success": true}