{"id": 260, "url": "https://www.novelhall.com/i-became-an-immortal-on-mortal-realm-32879/14579145.html", "title": "Chapter 260 - Chapter 260: Chapter 257: All Things Perish, Dust-Light Divine Monk", "volume": 3, "volume_title": "Volume 3", "body": "<h1>Chapter 260 - Chapter 260: Chapter 257: All Things Perish, Dust-Light Divine Monk</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 260: Chapter 257: All Things Perish, Dust-Light Divine Monk<br/><br/>Translator: 549690339<br/><br/>Inside the Yu Clan’s heaven and earth.<br/><br/>Mountains crumbled, the earth was scarred, the air was filled with rolling dust and smoke, as if it were the end of times.<br/><br/>The Thousand-Zhang Golden Buddha hovered in the sky, its aura still domineering, but its Golden Body had lost an arm, and was full of pits and dents, with traces of halberd slashes and the imprints of punches and kicks, leaving one unable to imagine the fierce battle it had endured.<br/><br/>In front of him stood Fang Wang, proud and unyielding against the firmament, his black clothes torn, yet seeming even more ferocious.<br/><br/>In the distance, his followers were battling with the cultivators of the Yu Clan, and explosions occurred spectacularly across the skyline from time to time.<br/><br/>On the desolate and chaotic ruins of the land below, lay many Buddha cultivators and Yu Clan cultivators, most of them dead, and even those still alive had lost their ability to fight.<br/><br/>They all looked up at Fang Wang in the sky with fear and despair.<br/><br/>“How can he be so powerful…”<br/><br/>“Damn it, even the master can’t do anything against him.”<br/><br/>“Is this guy’s Spiritual Power endless? After battling for so long, he still maintains his peak condition.”<br/><br/>“At this rate, the Suppressing Evil Golden Buddha is afraid he won’t be able to withstand…”<br/><br/>“It’s not that the Suppressing Evil Golden Buddha isn’t strong enough, it’s that Fang Wang’s Heavenly Body is too inconceivable…”<br/><br/>Fang Wang, holding the Heavenly Palace Halberd, looked at the still formidable Suppressing Evil Golden Buddha before him with some emotion.<br/><br/>This person is very strong, even stronger than Qiu Shenji.<br/><br/>No wonder he dares to come forward!<br/><br/>If Fang Wang had not mastered the Heavenly Gang Supreme Yang Tyrant Body, it would have been difficult for him to last this long under the siege of the Suppressing Evil Golden Buddha and many other Great Cultivators.<br/><br/>Now, even after fighting for a day and a night, Fang Wang was still unwearied.<br/><br/>It’s time to use Divine Skills!<br/><br/>Fang Wang’s gaze hardened, and he lifted his left hand, causing the Yu Clan’s heaven and earth to tremble violently. Chunks of rock and sand rose into the air, many dead bodies and wounded were also swept up.<br/><br/>The Suppressing Evil Golden Buddha sensed something, and his right arm began casting a spell, conjuring a massive golden lotus in front of him that faced Fang Wang.<br/><br/>Two immense pressures enveloped the entire heaven and earth, drawing the attention of cultivators who were fighting in the distance.<br/><br/>Fang Wang immediately amplified his Spiritual Power and activated his Divine Skills with the fastest speed.<br/><br/>Boom—<br/><br/>The land shattered, innumerable rocks and dirt flew toward the firmament, gathering above his head, and a mountain rapidly took shape, expanding at an extremely fast pace as a ferocious storm broke out between heaven and earth.<br/><br/>“Amitabha!”<br/><br/>The voice of the Suppressing Evil Golden Buddha rang out as the massive golden lotus before him bloomed, its countless petals shooting towards Fang Wang like a shower of arrows.<br/><br/>In flight, these petals displayed different phantasms, like a series of scroll paintings, each hiding a universe that burst forth, revealing all living beings, dazzling onlookers.<br/><br/>Fang Wang in the air, with a stab of his halberd in hand, nine Black Dragons irresistibly charged forth, colliding with the myriad universes of flowers, bright light bursting forth, illuminating the entire heaven and earth.<br/><br/>In the distance.<br/><br/>Yang Du was fighting against the Yu Clan’s number one prodigy, Yu Lingyun. There was a gap in their cultivations, and Yang Du was no match, but using his Heavenly Body, he was able to hold Yu Lingyun at bay.<br/><br/>It was precisely because of Yang Du’s Heavenly Body that Yu Lingyun completely gave up the idea of challenging Fang Wang.<br/><br/>No matter how one looked at it, Fang Wang’s Heavenly Body was stronger than Yang Du’s.<br/><br/>Yu Lingyun continued casting spells while looking into the distance. Even separated by thousands of miles, he felt fear from the aura of Fang Wang and the Suppressing Evil Golden Buddha.<br/><br/>In front of these two, he truly felt as insignificant as an ant.<br/><br/>Suddenly.<br/><br/>His pupils shrank.<br/><br/>Looking in the direction of his gaze, a vast mountain suddenly appeared among the intense light on the horizon, growing rapidly as if it were about to burst through the firmament, a spectacle beyond compare.<br/><br/>“Heavenly Emperor Mountain! I never thought you would receive the legacy of the Hongxuan Emperor!”<br/><br/>The Suppressing Evil Golden Buddha stared at the magnificent mountain above, speaking deliberately and with a heavy tone.<br/><br/>Fang Wang leaped up, landing on the peak of the mountain. With a stomp of his right foot, the thousands of Zhang tall Heavenly Emperor Mountain pressed down on the Suppressing Evil Golden Buddha, twisting the entire Yu Clan’s heaven and earth, nearly collapsing it.<br/><br/>The Suppressing Evil Golden Buddha struck out with his palm, a blaze igniting upon it, Buddha’s light brilliantly filling the entire heaven and earth.<br/><br/>With a thunderous boom!<br/><br/>The Yu Clan’s heaven and earth erupted, everything obliterated!<br/><br/>At the same time, in the real world, the black hole suspended above the mountains suddenly expanded, a fierce wind howling out, the surrounding space filled with dense cracks, as if the firmament were about to shatter.<br/><br/>One after another, cultivators burst out from the black cracks, all in a sorry state, including followers of Fang Wang, as well as Buddha Sect cultivators and Yu Clan cultivators, all wounded, some even engulfed in flames.<br/><br/>Just as they escaped, a terrifying bright light burst from within the black hole, the surrounding space instantly shattering, revealing the figures of Fang Wang and the Suppressing Evil Golden Buddha.<br/><br/>They clashed in battle once more, with the Suppressing Evil Golden Buddha having shrunk to ten Zhang tall, yet still colossal compared to Fang Wang.<br/><br/>Fang Wang swung the Heavenly Palace Halberd swiftly, while the Suppressing Evil Golden Buddha wielded a Golden Buddha Staff with one hand. Their movements were extremely fast, no one able to discern their exact techniques. They could only see the two soaring and diving around, leaving broken earth and scattered clouds in their wake. It was as if two Immortal Gods were locked in fierce battle, their mere presence sufficient to obliterate any obstructions along their path.<br/><br/>“Hahaha! Your Yu Clan territory has still been destroyed! Thrilling! What does it matter if you have the support of the Buddhist Sect?”<br/><br/>Yang Du laughed wildly, which made Yu Lingyun and the other Yu Clan cultivators look unsightly, each of them bellowing as they charged towards him.<br/><br/>In this battle, more than a dozen of Fang Wang’s followers fell, while the Yu Clan suffered over ten thousand casualties.<br/><br/>The Yu Clan had already evacuated the members with low cultivation levels in advance, leaving only those with a certain combat power behind. The lowest realm among them was the Condensation Spirit Realm, while Fang Wang’s followers were at least in the Mahayana Realm, showing a disparity in the average cultivation levels between the two sides.<br/><br/>Clang! Clang! Clang…<br/><br/>The Heavenly Palace Halberd struck the Golden Buddha Staff repeatedly, each blow generating visible spatial ripples.<br/><br/>The physical strength of the Suppressing Evil Golden Buddha was absolutely the strongest Fang Wang had ever encountered, fortunately, the Suppressing Evil Golden Buddha didn’t possess the terrifying self-healing ability of the Heavenly Gang Supreme Yang Tyrant Body.<br/><br/>As the Yu Clan’s world crumbled, the expression on the face of the Suppressing Evil Golden Buddha grew more serious, and he stopped speaking. An invisible killing intent enveloped Fang Wang.<br/><br/>This Golden Buddha was starting to harbor murderous intent!<br/><br/>After such a prolonged battle, Fang Wang didn’t care about his opponent’s state of mind; if it came down to attrition, he would exhaust the Golden Buddha to death!<br/><br/>The two’s nimble maneuvers grew faster and faster, covering an ever-increasing range. Wherever they passed, mountains collapsed and rivers surged, bringing about a catastrophe to the land.<br/><br/>Fang Wang intentionally flew higher, trying to avoid involving the innocent people as much as possible, but the Suppressing Evil Golden Buddha kept pressing downward.<br/><br/>“Is this the compassion of the Buddhist Sect?”<br/><br/>Fang Wang mocked, no wonder Zhou Xue regarded the Buddhist Sect as an enemy.<br/><br/>There might be true Buddhas in the world, but they don’t necessarily belong to the Buddhist Sect.<br/><br/>“Their death is on you, Fang Wang. Your obstinacy is the cause of this catastrophe!” the Suppressing Evil Golden Buddha said coldly.<br/><br/>Fang Wang snorted, “Then what role do you play in this karma? Am I the knife in your hands? Are you truly a Buddha, or just a demon clad in hypocrisy?”<br/><br/>“Posterity will judge. Suppressing you is the task I ought to do!”<br/><br/>The voice of the Suppressing Evil Golden Buddha was authoritative and sonorous, as if he truly had the well-being of people at heart and feared neither life nor death.<br/><br/>Fang Wang immediately used the Jiuyou Zizaishu and passed through the body of the Suppressing Evil Golden Buddha. Following that, he leaped up and rushed tens of thousands of Zhang into the sky, forcing the Suppressing Evil Golden Buddha to pursue him.<br/><br/>Fang Wang drew the Rainbow Sword and executed the Zhu Xian Jing Hong Sword, a spectre of gods and demons appeared behind him.<br/><br/>The Suppressing Evil Golden Buddha had already witnessed this Divine Skill; those Yu Clan cultivators who had been executed by Fang Wang had their souls devoured by this specter.<br/><br/>Swoosh!<br/><br/>A sound of piercing the sky sped past below the firmament, as a silver rainbow light penetrated through the layers of clouds, unstoppable in its advance.<br/><br/>The silver rainbow light was none other than Emperor Tao.<br/><br/>Emperor Tao’s Silver Armor emitted strands of silver aura. His cape fluttered in the wind, and the tiger eyes on his helmet looked as if they could come alive at any moment.<br/><br/>Suddenly.<br/><br/>Emperor Tao seemed to sense something, his gaze shifted in a certain direction, and his speed subsequently slowed down.<br/><br/>A streak of cyan light approached at an incredibly fast speed, quickly matching pace with him.<br/><br/>As the cyan light dissipated, an old monk wearing tattered robes appeared. He was emaciated, with his ribcage showing through his chest and a disheveled appearance, but the eyes beneath his white eyebrows shone with exceptional brightness.<br/><br/>“Fellow Daoist seems unfamiliar, may I ask for your name?” Emperor Tao inquired.<br/><br/>The old monk replied with a smile, “Amitabha, this monk’s Dharma name is Dust-Light. I have lived in seclusion for two thousand years, usually chanting scriptures in a temple of a certain dynasty. Perhaps fellow Daoist has not heard of my Dharma name.”<br/><br/>Emperor Tao frowned and asked, “Are you the Dust-Light Divine Monk who suppressed the Nine-Headed Demon Ancestor and sealed the Jiu You Spring Eye back in the day?”<br/><br/>“I didn’t expect anyone to remember my deeds, haha. Fellow Daoist, are you going to be involved in the affairs of Tian Dao Fang Wang and the seven Great Saint Clans?” Dust-Light Divine Monk asked with a laugh, speaking kindly.<br/><br/>Emperor Tao squinted his eyes, continuing to fly while asking, “Indeed, what about you, Divine Monk?”<br/><br/>“Amitabha, I indeed am,” the monk confirmed.<br/><br/>“May I ask whom the Divine Monk is here to assist?”<br/><br/>“Naturally, to assist justice.”<br/><br/>“Where does justice lie?”<br/><br/>“Fang Wang is overly murderous, but there is a reason behind it. The seven Saint Clans have committed heinous crimes. If we speak of justice, it’s certainly not on the side of the Saint Clans.”<br/><br/>Hearing this, a smile appeared on Emperor Tao’s face, saying, “I act on orders from Emperor Donggong to assist Fang Wang. With the Divine Monk’s help, it would be most welcome.”<br/><br/>Dust-Light Divine Monk stroked his beard with a smile, “I’ve often heard that Emperor Donggong is benevolent, with a heart for all living beings. This time he is not shielding the seven Saint Clans. His ancestor did not choose wrong, nor did the Descending Dragon Great Saint take on the wrong disciple.”<br/><br/>Once their stances were clear, the two got along even more amiably.<br/><br/>“I wonder about the Divine Monk’s relationship with the Buddhist Sect. It is said that all Buddha Cultivators come from the Buddhist Sect, is that true?” Emperor Tao asked curiously.<br/><br/>He had an intuition that Dust-Light Divine Monk’s participation could not be disconnected from the Buddhist Sect.<br/><br/>Dust-Light Divine Monk looked into the distance and said, “Amitabha. Indeed, I came from the Buddhist Sect, but unfortunately, I violated the sect rules many years ago and was cast out. It is embarrassing to say, but after so many years, the Buddhist Sect has come to this day, unable to distinguish right from wrong, and I am partly to blame.”<br/><br/>“The power of the Buddhist Sect is vast, perhaps even Emperor Donggong doesn’t dare to deal with them. Since that’s the case, let me handle it. After all, the current Buddha Lord is also considered my grand-disciple.”\t\t\t\t\t\t</div>", "images": {}, "success": true}