{"id": 266, "url": "https://www.novelhall.com/i-became-an-immortal-on-mortal-realm-32879/14581520.html", "title": "Chapter 266 - Chapter 266: Chapter 263: The Highest Talent In A Hundred Thousand Years", "volume": 3, "volume_title": "Volume 3", "body": "<h1>Chapter 266 - Chapter 266: Chapter 263: The Highest Talent In A Hundred Thousand Years</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 266: Chapter 263: The Highest Talent in a Hundred Thousand Years<br/><br/>Translator: 549690339<br/><br/>Facing Zhou Xue’s inquiry, Fang Wang nodded in response.<br/><br/>It was a secret that could not be kept, even Emperor Donggong had noticed it, so there was no need to hide it from Zhou Xue.<br/><br/>“The Mie Jue Divine Tome is no trivial matter; it is a complete set of peerless techniques. Once mastered, there’s no need to practice other spells to become an emperor,” Zhou Xue praised.<br/><br/>Fang Wang couldn’t help but ask, “If it’s that powerful, do you want to learn it?”<br/><br/>Zhou Xue slightly shook her head, “It’s not that the more you learn, the stronger you become. Some cultivation techniques conflict with each other. Moreover, each person has their path. Mastering one is better than knowing many.”<br/><br/>Fang Wang thought about it, and indeed, not everyone was like him, possessed of the Heavenly Palace.<br/><br/>Time cost, lifespan limitations, and the limits of energy, these factors would restrict cultivators from learning more cultivation techniques, spells, and divine skills.<br/><br/>“Why haven’t you mentioned Emperor Donggong to me before? Could it be that he is going to die?” Fang Wang asked.<br/><br/>Zhou Xue nodded, “Calculating the days, he probably has thirty or forty years left before he falls. I initially thought you wouldn’t have any interaction with him, so I didn’t mention him to you. How many powerhouses are there in this world? Surely, I can’t tell you about all of them, can I?”<br/><br/>“Even though Emperor Donggong will die, he has reopened the path of the emperor for the Mortal Realm. After I ascended, I heard that an emperor was born in the Mortal Realm.”<br/><br/>After hesitating for a moment, Fang Wang revealed all his interactions with Emperor Donggong.<br/><br/>After listening, Zhou Xue revealed a smile and said, “He did not miscalculate, but you need not feel burdened. Even without you, Emperor Donggong would have fallen, and his descendants would have met a tragic end. Less than fifty years after his fall, the Grand Yu Divine Dynasty was overthrown, and within two hundred years, his entire clan was slaughtered, becoming one of the greatest tragedies in the Mortal Realm. That Hong Xian’er, I’ve heard of her too, an astonishing talent, the only one among the descendants of Emperor Donggong who had hope to become an emperor.”<br/><br/>Become an emperor?<br/><br/>Fang Wang raised his eyebrow, surprised that the blunt, foul-mouthed Hong Xian’er had such potential.<br/><br/>Zhou Xue continued, “A hundred years later, the descendants of Emperor Donggong faced their clan’s annihilation. Under the siege of the Holy Clans, Imperial Clans, Hong Xian’er, with one foot into the realm of the Great Emperor, swept away all her enemies. Unfortunately, this also exhausted her fate, her life force nearly depleted, and her spirit dissipated. It’s no exaggeration to say, she was the most talented woman in the Mortal Realm for the past hundred thousand years. If you could marry her, your support in the Mortal Realm would be much greater should you choose to stay.”<br/><br/>The most talented woman in a hundred thousand years?<br/><br/>For the first time, Fang Wang became curious about Hong Xian’er.<br/><br/>Zhou Xue laughed and said, “You’re really strange. Not just geniuses, even normal mortals entertain all sorts of thoughts. With your capabilities, could it be that you have never experienced a woman’s touch? Why do I feel like you see women as floods and savage beasts, avoiding them at all costs?”<br/><br/>Fang Wang widened his eyes, and said irritably, “How could that be? I’m just focused on cultivating. Once I become invincible in the Mortal Realm, not to mention pursuing a harem of three thousand beauties, I should at least have a hundred wives and concubines to enjoy ultimate bliss.”<br/><br/>“Really? Then let’s wait and see.”<br/><br/>“Then just wait.”<br/><br/>Hearing Fang Wang’s response, Zhou Xue stared intently at him, making him feel inexplicably uneasy.<br/><br/>Suddenly.<br/><br/>Zhou Xue burst into laughter, laughing so heartily that she swayed.<br/><br/>This was the first time Fang Wang had seen her laugh like that, and just as he was about to ask more, Zhou Xue suddenly restrained her laughter and said seriously, “Enough about matters of children and women, they are secondary. Take advantage of Emperor Donggong’s time left to practice well with him, and if you want to maintain the Grand Yu Divine Dynasty, that’s fine too. When the time comes, I will aid you.”<br/><br/>What a bold claim!<br/><br/>Fang Wang was curious about the current strength of the Jin Xiao Sect.<br/><br/>Setting aside Zhou Xue, the revived Immortal Venerable, the Jin Xiao Sect also had the resurrected Hongxuan Emperor, a true Great Emperor. Moreover, according to Zhou Xue, she had mysterious powers capable of restraining the Hongxuan Emperor.<br/><br/>Adding the extraordinarily talented Zhu Rulai and Xu Qiuming…<br/><br/>The Jin Xiao Sect had deep waters indeed.<br/><br/>“By the way, do you know anything about the Absolute Emperor?” Fang Wang asked.<br/><br/>Zhou Xue was not surprised by the question, as she too knew that the creator of the Mie Jue Divine Tome was the Absolute Emperor.<br/><br/>“The Absolute Emperor is a very mysterious Great Emperor. The death of the Descending Dragon Great Saint is actually related to the Absolute Emperor, and even the Celestial Court of the Upper Realm could not trace his whereabouts. The Descending Dragon Great Saint obtained part of the Absolute Emperor’s legacy, which led to the dissatisfaction of the Immortal Gods. The same is true for Emperor Donggong today, whose doom originated from the Upper Realm. You, on the other hand, need not worry. With the Formless Zhou Tian Technique perfected, you can evade the scrutiny of the Upper Realm.”<br/><br/>“About the Absolute Emperor, I don’t know much, but one thing is for sure, he is not from the Mortal Realm. When he appeared, he was already invincible under the heavens, and after staying active in the Mortal Realm for a few hundred years, he disappeared. He is legendary even in the Upper Realm, undefeated.”<br/><br/>Zhou Xue’s words took Fang Wang by surprise.<br/><br/>He suddenly understood the Hongxuan Emperor’s words; no wonder the Hongxuan Emperor doubted the Absolute Emperor’s actual existence, as the Absolute Emperor was not a person of the Mortal Realm.<br/><br/>It seemed that the Absolute Emperor was a powerful being from the Upper Realm who descended to the Mortal Realm in disguise.<br/><br/>Afterward, Fang Wang inquired about the situation of the Fang Family.<br/><br/>In these three years, many cultivators from Saint Clans infiltrated Grand Qi to kill the Fang Family Disciples, but they were stopped by the Jin Xiao Sect, and even Divine Passage Realm Great Cultivators appeared, who were repelled by Zhu Rulai.<br/><br/>It wasn’t until Emperor Donggong severed the fate of seven clans that this situation ceased. Overall, the Fang Family had survived this calamity.<br/><br/>Within the Imperial City of the Grand Yu Divine Dynasty.<br/><br/>Xu Qiuming walked on the bustling streets, gazing at the prosperity on both sides, never stopping to linger.<br/><br/>Having been at sea for two centuries, Xu Qiuming considered himself well-traveled, yet this was the first time he encountered such a booming city.<br/><br/>The passersby all possessed cultivation, and Cultivators and monsters with incomprehensible levels of power could be seen everywhere.<br/><br/>How strong must this Grand Yu Divine Dynasty be?<br/><br/>And how powerful was Emperor Donggong, the master of the Grand Yu Divine Dynasty?<br/><br/>Xu Qiuming grew even more worried about Fang Wang’s safety, for no matter how strong Fang Wang was, facing such a formidable figure in the world, he would surely be helpless.<br/><br/>Everyone outside said that Emperor Donggong was backing Fang Wang, but Xu Qiuming always felt uneasy. What if Emperor Donggong also coveted Fang Wang’s talent?<br/><br/>Having been saved by Fang Wang twice, Xu Qiuming felt obliged to return the favor, so he undertook the long journey across the vast ocean, all the way to the Canghai.<br/><br/>As he walked among the crowds in the thriving Imperial City, having already made a name for himself in the Southern Celestial Sea, Xu Qiuming also couldn’t help feeling uneasy.<br/><br/>Here, he felt completely insignificant. If Fang Wang were in danger, how would he be able to rescue him?<br/><br/>As Xu Qiuming walked, he pondered this question.<br/><br/>“Past fifty thousand years, future fifty thousand years, cause and effect, fate and fortune all lie within me; the mysteries of reincarnation are fully revealed before my eyes…”<br/><br/>A yelling voice came from up ahead, capturing Xu Qiuming’s thoughts.<br/><br/>Xu Qiuming looked up and saw an old Taoist standing on the balcony of the second floor of an inn, shouting as he held a wooden staff in his left hand. The staff was draped with a white cloth that bore four large characters.<br/><br/>Decipher Destiny and Fate!<br/><br/>Many cultivators had gathered in front of the inn’s entrance, pointing and discussing the old Taoist.<br/><br/>Unable to see through the old Taoist’s cultivation level, Xu Qiuming did not find the man’s words laughable, and this seemed to be the consensus of the people downstairs as well.<br/><br/>In Imperial City, it is rare to encounter charlatans, and so, more and more people gathered, with Xu Qiuming joining the crowd out of curiosity to see what the fuss was about.<br/><br/>“Hey, old man, can you really decipher destiny?”<br/><br/>A female voice rang out, drawing the attention of everyone, including Xu Qiuming.<br/><br/>Xu Qiuming saw a woman in a blue dress sweeping through the air, her garment fluttering like a blue rosy cloud.<br/><br/>What a beautiful woman!<br/><br/>Even Xu Qiuming, who had seen many stunning ladies, was astonished by her appearance.<br/><br/>The arrival was none other than Hong Xian’er.<br/><br/>Some cultivators who recognized Hong Xian’er bowed and greeted her, and the name of the seven princesses quickly spread, causing Xu Qiuming to frown and a cold look to flicker in his eyes.<br/><br/>So, this woman is Emperor Donggong’s daughter!<br/><br/>Xu Qiuming decided to seize Hong Xian’er and force her to reveal Fang Wang’s whereabouts.<br/><br/>Although he could not gauge Hong Xian’er’s cultivation level, he felt confident that he should be able to capture her.<br/><br/>Hong Xian’er landed beside the old Taoist, hands on her hips, scrutinizing the Taoist and snorting, “Decipher Destiny and Fate? Then let me ask you, who is the strongest in the land today?”<br/><br/>The old Taoist was not flustered at all and asked cheerfully, “I am known as the Solitary Life Elder. May I inquire, Your Highness, are you asking about cultivation or some other aspect?”<br/><br/>“Of course, it’s about cultivation. Just tell me, who is the strongest in the land?”<br/><br/>“Hehe, let me calculate. It’s not Emperor Donggong.”<br/><br/>The words of the Solitary Life Elder made Hong Xian’er’s face turn cold instantly. Not just her—most of the people downstairs started looking at the Solitary Life Elder with disapproval.<br/><br/>Xu Qiuming raised an eyebrow, surprised by the old man’s audacity. Was he courting death or did he have confidence to claim that Emperor Donggong was not the strongest under his very nose?<br/><br/>Hong Xian’er stared intently at the Solitary Life Elder and demanded, “Then who is the strongest?”<br/><br/>The Solitary Life Elder stroked his beard and chuckled, “There are countless great figures in the world, like the fish of rivers and seas, there is currently no strongest in the land, but in five hundred years, the strongest will emerge spectacularly.”<br/><br/>“Stop speaking in riddles. Just say a name!” Hong Xian’er said impatiently.<br/><br/>The Solitary Life Elder glanced at her and laughed, “The strongest in five hundred years will be your fiancé as of now.”<br/><br/>Hearing this, Hong Xian’er was momentarily stunned. Her engagement with Fang Wang wasn’t completely set yet, nor was it widely known, so how did this old man know?<br/><br/>If it was about who would be the future strongest, Hong Xian’er could only recognize Fang Wang.<br/><br/>For someone in the Nirvana Realm to defeat a practitioner in the Sky-Stepping Realm, she thought there had been none before and possibly none to come.<br/><br/>The cultivators below started gossiping curiously—who was the seven princess’s fiancé?<br/><br/>Just as Hong Xian’er was about to ask further, the Solitary Life Elder suddenly pointed at her and declared, “You have the potential of a Great Emperor, yet your fate is fraught with calamities. However, your recent fortunes are changing, clearly related to your unfathomable fiancé.”<br/><br/>The Solitary Life Elder then looked down to the crowd, pointing at one cultivator after another.<br/><br/>“You, born to wealth and remarkable cultivation, but struck by a rare poison, are destined never to have children.”<br/><br/>“You, orphaned from a young age, have made it this far by a great destiny—there’s no saying you can’t reach the Divine Passage Realm in the future.”<br/><br/>“You, destined to encounter seven emotional calamities, with the seventh looming. Be careful, for this one might cost you your life.”<br/><br/>“You, born with the mark of a saint, were meant to die… Huh?”<br/><br/>As the Solitary Life Elder pointed out each individual, his words deeply affected them. After pointing out three people, their reactions convinced other cultivators of his abilities.<br/><br/>However, as he pointed at Xu Qiuming, his smile suddenly froze and his gaze fixed intently on Xu Qiuming.\t\t\t\t\t\t</div>", "images": {}, "success": true}