{"id": 267, "url": "https://www.novelhall.com/i-became-an-immortal-on-mortal-realm-32879/14582598.html", "title": "Chapter 267 - Chapter 267: Chapter 264 Half An Imperial Edict", "volume": 3, "volume_title": "Volume 3", "body": "<h1>Chapter 267 - Chapter 267: Chapter 264 Half An Imperial Edict</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 267: Chapter 264 Half an Imperial Edict<br/><br/>Translator: 549690339<br/><br/>The Solitary Life Elder’s gaze made Xu Qiuming quite uncomfortable, and at the same time, he pondered the words of the Solitary Life Elder.<br/><br/>Do I possess the Saintly nature?<br/><br/>The destiny of a Great Saint?<br/><br/>But will I die?<br/><br/>Xu Qiuming was both excited and uneasy by what he said.<br/><br/>Who wouldn’t want to become a Great Saint?<br/><br/>Yet if the Solitary Life Elder could truly foresee destiny, he might very well die on the Saintly Path.<br/><br/>The cultivators gathered in front of the inn were all taking measure of Xu Qiuming, not recognizing him, so they were curious about his identity.<br/><br/>Hong Xian’er glanced at Xu Qiuming, uninterested in this cultivator with the Saintly nature, and instead turned back to the Solitary Life Elder, pressing him, “Speak! Why don’t you continue?”<br/><br/>The expression on the Solitary Life Elder’s face grew even more peculiar as he said, “His fate is changing too, he may not die, and the Saintly nature is becoming more solidified…”<br/><br/>Upon these words, the street erupted in astonishment.<br/><br/>Doesn’t this mean that Xu Qiuming will certainly become a saint?<br/><br/>That would be a Great Saint!<br/><br/>Immediately, there were those who refused to accept this.<br/><br/>“Are you a Great Saint, to so assuredly declare another’s saintly fate?”<br/><br/>“That’s right, what do you know about being a Great Saint? I think you’ve got something, but not much, don’t spout nonsense.”<br/><br/>“Perhaps those three before are his men?”<br/><br/>“Ridiculous, mortals daring to discuss the Great Saint?”<br/><br/>“Old man, tell us, which Great Saint, which Great Emperor do you belong to?”<br/><br/>Various mocking words rose, some even cursed openly, feeling that the Solitary Life Elder was first disrespectful to Emperor Donggong, then brazenly declared a Great Saint, how could the Imperial City tolerate such a charlatan?<br/><br/>Hong Xian’er also felt annoyed. She could see that Xu Qiuming contained a powerful Sword Intent, but such Sword Intent was not enough to threaten her. She had even seen swordsmanship geniuses stronger than Xu Qiuming, so why could he become a saint?<br/><br/>In Hong Xian’er’s view, to become a saint required fate, opportunity, but talent is the most fundamental, the most indispensable.<br/><br/>Only with the strongest talent, coupled with opportunity, is there hope to become a Saint!<br/><br/>Xu Qiuming, on the other hand, was calm and collected, eager to hear what the Solitary Life Elder would say next.<br/><br/>Suddenly, the Solitary Life Elder disappeared on the stairway, startling Hong Xian’er into sharply contracting her pupils.<br/><br/>So fast!<br/><br/>Immediately afterward, Hong Xian’er sensed something and flashed onto the eaves.<br/><br/>She saw the Solitary Life Elder standing on the eaves, looking in the direction of the Imperial Palace with a complex gaze.<br/><br/>Hong Xian’er stared at him and asked, “May I ask of your origins, senior?”<br/><br/>The Solitary Life Elder did not look at her, but spoke in a deep voice, “I have come because the emperor of the Grand Yu Divine Dynasty has offended the heavens; I wanted to see if I could bring some changes for you, but it turns out you already have the greatest variable.”<br/><br/>Before Hong Xian’er could ask more, the Solitary Life Elder vanished on the spot.<br/><br/>“Little girl, when you prove to be an Emperor, I will bring you a significant gift.”<br/><br/>To prove to be an Emperor?<br/><br/>Hong Xian’er was moved; she couldn’t track the Solitary Life Elder’s whereabouts, not even a trace of his aura was left.<br/><br/>Such skill made the Solitary Life Elder’s image in her heart rise further, and at the same time, she felt a sneaking joy.<br/><br/>Could she prove to be an Emperor?<br/><br/>From birth, her talents had been different from others. She was the one with the strongest talent among the children of the crown prince, which is why many of her sisters were married off, and she was not. With such talent, Emperor Donggong couldn’t bear to marry her off.<br/><br/>However, the Great Emperor was so distant, even her previously most-admired father had begun to give up this goal, so naturally, she could not have absolute confidence.<br/><br/>Hong Xian’er pondered on the spot for a moment, then disappeared from the eaves, deciding to go find Emperor Donggong.<br/><br/>Half a quarter of an hour later.<br/><br/>Inside the Imperial Palace.<br/><br/>Emperor Donggong sat on the throne with a face full of emotion and said, “Solitary Life Senior is indeed still alive. I wonder how old he is now.”<br/><br/>Upon hearing this, Hong Xian’er’s eyes widened in surprise as she curiously asked, “Father, you know him?”<br/><br/>She had not expected that the old man from before was her father’s senior!<br/><br/>It was fortunate that she hadn’t attacked him earlier.<br/><br/>Emperor Donggong nodded and said, “When I was just over three hundred years old, I had the fortune of encountering him. At the time, I thought he was a swindler, claiming that I had half an imperial fate, which would allow me to have the qualifications to strike for Great Emperor status but not the chance to step into it. As it turns out, he was right; I have stood at the pinnacle of the Eastern Mortal Realm, yet still unable to touch the Great Emperor.”<br/><br/>“At that time, he gave me a suggestion, one that I have always remembered. If I fail, I will use his suggestion.”<br/><br/>Hong Xian’er asked instinctively, “What suggestion?”<br/><br/>“With only half an imperial fate, if I were to produce a child who also had only half an imperial fate, that would make a complete imperial fate,” Emperor Donggong laughed, looking at Hong Xian’er with eyes full of love, pride, and many other emotions.<br/><br/>Upon hearing this, Hong Xian’er immediately understood his meaning, and hastily said, “Father, don’t talk nonsense; you will surely overcome your calamity. The Solitary Life Elder just said, I will prove to be an Emperor; I don’t need your sacrifice.”<br/><br/>“Foolish child, how do you know he wasn’t referring to the fate after I’ve made up my mind?”<br/><br/>The reply of Emperor Donggong stunned Hong Xian’er.<br/><br/>She thought for a moment and said, “But he also mentioned Fang Wang, saying Fang Wang is the greatest variable, and I might change because of him…”<br/><br/>Emperor Donggong shook his head and said, “He indeed will change your fate, but he cannot change mine. He truly has terrifying talents, far surpassing mine, but he’s too young. My calamity comes from The Upper Realm; he won’t be able to help me. As long as he can help you, I’ll have no worries.”<br/><br/>Hong Xian’er became anxious, preparing to continue her persuasion.<br/><br/>Emperor Donggong raised his hand and said, “Enough, Xian’er, don’t worry about so much. The path to proving to be an Emperor needs to be taken one step at a time. Instead of worrying about this, you should go down and cultivate properly. People have their own destinies; why should those who cultivate add to their troubles unnecessarily?”<br/><br/>Hong Xian’er’s hands clenched within her sleeves, while her brows furrowed tightly.<br/><br/>She was filled with discontent in her heart.<br/><br/>If she had the same talent as Fang Wang, able to slay those in the Sky-Stepping Realm before the age of three hundred, she would certainly be invincible in the Mortal Realm by now, and she would be able to help her father transcend his tribulation.<br/><br/>Inside Qianyang Palace.<br/><br/>After the assessment ended, Fang Wang had stayed in Qianyang Palace for over half a year, itching to go out for a wander.<br/><br/>He had been cooped up in the Heavenly Palace for thirteen thousand years and truly didn’t wish to stay in an enclosed space any longer.<br/><br/>Consequently, he took Xiao Zi and left through the great doors of Qianyang Palace.<br/><br/>Zhui Feng immediately appeared before him and asked, “Where are you planning to go?”<br/><br/>Fang Wang raised an eyebrow and asked, “What? Am I only allowed to stay in Qianyang Palace?”<br/><br/>He could use the Jiuyou Zizaishu to escape, so he wasn’t afraid at all; he was only concerned about the attitude of Emperor Donggong.<br/><br/>Zhui Feng hesitated and said, “Of course not, but…”<br/><br/>“But what?”<br/><br/>As Zhui Feng was about to answer, his expression suddenly changed. He then bowed with his hands clasped and said, “His Majesty has decreed that you may come and go as you please. You can even return directly to the Fang Family. Whenever you visit the Grand Yu Divine Dynasty in the future, Qianyang Palace will still be yours.”<br/><br/>He then stepped aside and gestured for Fang Wang to proceed as he wished.<br/><br/>Fang Wang looked back at the Imperial Palace and immediately leaped into the air, flying out of the Imperial City.<br/><br/>“Young Master, where shall we go next?” Xiao Zi asked excitedly, although the Spiritual Energy in Qianyang Palace was abundant, it also preferred not to stay in one place all the time.<br/><br/>Fang Wang replied, “Let’s wander around the Grand Yu Divine Dynasty for a bit. The place is abounding with Spiritual Energy; it really would be a pity to leave.”<br/><br/>The Grand Yu Divine Dynasty was vast, far surpassing Grand Qi. It would be quite nice to observe the local customs and the scenery of the Cultivation World here.<br/><br/>His departure from Qianyang Palace was mainly for a change of heart.<br/><br/>When Fang Wang flew out of the Imperial City, he immediately drew many gazes, yet no one dared to follow him. Anyone who could fly out of the Imperial City so brazenly must be extraordinary. After all, both civil and military officials entering the palace had to walk; flight was not allowed.<br/><br/>Soon, Fang Wang left the Imperial City, his speed not too fast.<br/><br/>“Fang Wang!”<br/><br/>An exclamation of surprise reached him, prompting Fang Wang to stop.<br/><br/>“Fang Wang, wait for me!”<br/><br/>Another female voice came through, and Fang Wang looked back to see Hong Xian’er flying over from the forest canopy, while Xu Qiuming, who had called him earlier, was in the forest.<br/><br/>Xu Qiuming saw the figure of Hong Xian’er and frowned involuntarily.<br/><br/>He remembered the Solitary Life Elder saying that Hong Xian’er could become an Emperor.<br/><br/>Fang Wang remembered Hong Xian’er too; after all, he mentioned her during his chat with Zhou Xue. This girl was the most talented in the last hundred thousand years.<br/><br/>As for Xu Qiuming…<br/><br/>He looked somewhat unfamiliar.<br/><br/>With thirteen thousand years gone by, it was natural for forgotten acquaintances to fade from memory, especially since these thirteen thousand years had been spent focusing on Cultivation, with his thoughts constantly occupied by the Mie Jue Divine Tome.<br/><br/>Fang Wang turned to Xu Qiuming, furrowing his brows.<br/><br/>Xiao Zi, lying on his shoulder, couldn’t help but speak up, “Well, Xu Qiuming, you’ve managed to make your way here? It seems you have made great progress.”<br/><br/>Xu Qiuming remembered that Fang Wang had raised a purple snake, so seeing the Purple Dragon, he immediately associated it with that purple snake.<br/><br/>So it was Xu Qiuming.<br/><br/>Fang Wang’s brows unfurled as he said, “Xu Qiuming, what brings you here?”<br/><br/>Hong Xian’er came to Fang Wang’s side and also turned to look at Xu Qiuming, not expecting the two to know each other.<br/><br/>Wait a minute, the Solitary Life Elder originally foretold that Xu Qiuming would die, but later divined that his fate had changed. Could it be…<br/><br/>It must be so!<br/><br/>Hong Xian’er turned her head toward Fang Wang, her eyes full of anticipation.<br/><br/>Xu Qiuming replied, “I’ve come for you. I was worried…”<br/><br/>He did not continue, as after all, Hong Xian’er was the Seventh Princess.<br/><br/>Fang Wang immediately understood his meaning and said with a sigh, “From the Southern Celestial Sea to Canghai is not a short journey.”<br/><br/>Xu Qiuming asked, “Are you alright?”<br/><br/>“I’m fine, don’t worry about me. Emperor Donggong has treated me very well,” Fang Wang replied, nodding.<br/><br/>Xiao Zi then said, “It’s not just fine, they even want to marry his daughter to the Young Master, look, this is her, the Seventh Princess of the Grand Yu Divine Dynasty.”<br/><br/>“Hmph, am I lacking in some way? If anyone in this world is worthy of Fang Wang, at least in the Eastern Mortal Realm, there’s no woman more suitable for him than me,” Hong Xian’er declared defiantly, hands on hips and chest puffed out.<br/><br/>Xu Qiuming immediately understood – the Seventh Princess was to be Fang Wang’s fiancee.<br/><br/>In that case, the Solitary Life Elder’s words were not in vain.<br/><br/>He had indeed almost perished, saved by Fang Wang, and everything matched up…<br/><br/>He could become a Great Saint, Fang Wang could become the number one in the world…<br/><br/>He felt that such fate was wonderful and exactly the future he wanted.<br/><br/>Fang Wang spoke up, “I’d like to explore the Grand Yu Divine Dynasty. Xu Qiuming, will you join me?”<br/><br/>Xu Qiuming laughed and said, “I couldn’t ask for more.”<br/><br/>“Take me with you. I’m a princess, and I’m most familiar with the Grand Yu Divine Dynasty,” Hong Xian’er eagerly added.<br/><br/>Fang Wang didn’t know why she was excited but considering that he had no immediate plans to leave the Grand Yu Divine Dynasty, he nodded in agreement.\t\t\t\t\t\t</div>", "images": {}, "success": true}