{"id": 264, "url": "https://www.novelhall.com/i-became-an-immortal-on-mortal-realm-32879/14580814.html", "title": "Chapter 264 - Chapter 264: Chapter 261: Thirteen Thousand Years, Mie Jue Divine Tome Great Perfection", "volume": 3, "volume_title": "Volume 3", "body": "<h1>Chapter 264 - Chapter 264: Chapter 261: Thirteen Thousand Years, Mie Jue Divine Tome Great Perfection</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 264: Chapter 261: Thirteen Thousand Years, Mie Jue Divine Tome Great Perfection<br/><br/>Translator: 549690339<br/><br/>Emperor Donggong’s words fell, and the hall plunged into silence. Fang Wang could tell from their expressions that it seemed they already knew Emperor Donggong was about to face his calamity.<br/><br/>The lifespan of a living being indicates how long one can live, yet there are many who die prematurely. Not necessarily will one die when their lifespan is not yet exhausted, but surely will one die when their lifespan is nearing its end.<br/><br/>Hong Xian’er spoke up, “Father, how will you test us?”<br/><br/>Her query snapped everyone back to reality.<br/><br/>Emperor Donggong’s gaze sharpened, and the palace doors slammed shut.<br/><br/>“Within the Mie Jue Divine Tome, there is a Divine Skill called the Cataclysmic Badlands, which can transport you into an Illusionary Realm. I will soon thrust you into the most dreadful dire straits you fear. The three who perform the most outstandingly will receive my inheritance,” Emperor Donggong explained.<br/><br/>A prince furrowed his brow and asked, “Shouldn’t everyone who passes receive the inheritance? Father, the calamity is imminent, the stronger we are, the better we can protect your empire.”<br/><br/>As soon as these words were uttered, they immediately garnered the agreement of others.<br/><br/>Emperor Donggong snorted, “It’s uncertain whether even three among you can break through the Cataclysmic Badlands. Furthermore, to rashly bestow it upon you would only bring misfortune to those insufficiently strong. Do you realize how many covet this inheritance? Even if you do not speak of it, there are powerful beings between heaven and earth who can deduce such causality.”<br/><br/>The crowd exchanged looks, and eventually, no one else dared to question further.<br/><br/>Emperor Donggong swept his gaze over everyone, his eyes filled with affection as he looked at his beloved children. Finally, his gaze rested on Fang Wang, filled with profound meaning.<br/><br/>“Let’s begin the assessment then.”<br/><br/>Emperor Donggong’s authoritative voice rose, and as his words ended, the entire palace turned pitch black instantly, as if everyone was suddenly engulfed by darkness.<br/><br/>Fang Wang then felt a powerful surge of spiritual consciousness attack him, passing through his flesh.<br/><br/>All around him, everyone had become immobilized, their gazes frozen.<br/><br/>Only Fang Wang, Zhui Feng, and Emperor Donggong retained their consciousness.<br/><br/>“Hmm?”<br/><br/>Emperor Donggong sounded surprised, his eyes firmly fixed on Fang Wang.<br/><br/>Seeing that Fang Wang was still awake, Zhui Feng’s eyes took on a strange gleam.<br/><br/>Fang Wang cleared his throat and said, “Sorry, I have cultivated a peculiar Cultivation Technique that renders me immune to any interference from spiritual consciousness or soul sense.”<br/><br/>The Formless Zhou Tian Technique is damn impressive!<br/><br/>Indeed, one of the peerless techniques from The Upper Realm, even the Immortal Venerable hadn’t mastered it till death!<br/><br/>Emperor Donggong took a deep breath and said, “I did not expect you to harbor a technique no less amazing than the Mie Jue Divine Tome. No wonder you have achieved so much.”<br/><br/>Fang Wang replied, “It’s just an auxiliary Divine Skill, with no offensive power.”<br/><br/>Emperor Donggong was silent.<br/><br/>Zhui Feng was also inwardly astonished.<br/><br/>It appeared that even without Emperor Donggong’s intervention, Fang Wang inherently possessed a Fate that surpassed Emperor Donggong’s.<br/><br/>A constitution stronger than the Heavenly Body, the innate Heaven Yuan Spirit Treasure, coupled with that mysterious auxiliary Divine Skill, Zhui Feng suddenly realized Fang Wang seemed to have no weaknesses.<br/><br/>If there were any faults to pick, it would only be that he was too young and needed time to catch up in cultivation.<br/><br/>But…<br/><br/>This youngster managed to slay a Great Cultivator in the Sky-Stepping Realm with just a cultivation in the Nirvana Realm, a feat unheard of throughout the ages!<br/><br/>Fang Wang felt a bit awkward, having inadvertently revealed the Formless Zhou Tian Technique. Now, what was he supposed to do?<br/><br/>Fortunately, though he appeared to be less than two hundred years old, he was actually almost thirty-five thousand years old. He knew how to keep his composure.<br/><br/>Emperor Donggong slowly spoke up, “Since it’s so, then you are considered to have passed, and you may inherit my legacy.”<br/><br/>“I…”<br/><br/>“No need for more words, I intended to pass it to you anyway; it was just a formality. Such is the way of the world, give and take, then comes rapport. Fang Wang, I know you dislike troubles, but I will eliminate the trouble of the seven clans for you. Can you really repay that with just one future favor?”<br/><br/>Emperor Donggong’s steady gaze faced Fang Wang, rendering him silent.<br/><br/>“If I do not extinguish these seven clans, do you believe your enemies will be limited to them? I have acted for you, their enmity falls upon me, and in the future, it will fall upon my descendants as well. Can you feign ignorance to such a debt?”<br/><br/>Emperor Donggong’s words pounded on Fang Wang’s heart like a series of heavy blows.<br/><br/>Fang Wang had to admit, Emperor Donggong made sense. If he ignored this debt, he would not be Fang Wang.<br/><br/>To reciprocate kindness and seek revenge for enmity was his principle as a human being.<br/><br/>Fang Wang took a deep breath and said, “Your Majesty, aside from making me succeed the Grand Yu Divine Dynasty, I can agree to anything else. Just to be clear, I do not intend to ascend in the future. As long as I am alive, I can protect the Grand Yu Divine Dynasty for one more day.”<br/><br/>“Additionally, there is the matter of marriage with Princess. To be frank, I am already betrothed, and I fear I may disappoint your good intentions.”<br/><br/>Emperor Donggong raised an eyebrow and said, “Stay in the Mortal Realm? I see the way you act; you do not seem like one who clings to life and fears death. Could it be that you have your own goals?”<br/><br/>Fang Wang nodded, but did not elaborate.<br/><br/>Emperor Donggong then laughed, “As for your marriage with Xian’er, that is my bottom line. My daughter is not only beautiful; she is also the most talented, her Fate so elusive that even I cannot fathom it. You must accept, for in my heart, she’s even more important than the Grand Yu Divine Dynasty. Looking across the world, only by entrusting her to you can I be at ease.”<br/><br/>“I value not just your talent but more importantly, the way you conduct yourself, the care you show for your family, your attitude towards passing on the teachings, and so on. These are the reasons why I entrust Xian’er to you. Besides, how can you be so sure that your fiancée would object to your marriage with Xian’er?”<br/><br/>Towards the end, his expression turned exceptionally serious, filled with a sense of oppression.<br/><br/>Feeling the pressure, Fang Wang realized this was not a situation that could be resolved with fists.<br/><br/>“Let’s start with the inheritance. They’ll probably need some more time. I’ll give you a head start to experience the profundity of the Mie Jue Divine Tome,” Emperor Donggong revealed a smile.<br/><br/>Fang Wang nodded, his face showing a look of anticipation.<br/><br/>Emperor Donggong raised his hand, and a beam of light shot into Fang Wang’s forehead at an extremely fast speed.<br/><br/>This time, Fang Wang didn’t have immunity because the beam of light was infused into his body via Spiritual Power, causing him to fall into a trance.<br/><br/>Zhui Feng, seeing Emperor Donggong retract his hand, couldn’t help but ask, “Your Majesty, do you think he will follow the Saint Dao or the Imperial Dao?”<br/><br/>Emperor Donggong’s gaze was deep as he said, “I cannot see through him, I have lived for so many years, and he is the most unfathomable existence I have encountered. But one thing is certain, he will surely surpass me. I can assist him on his path of growth, and that will be my great opportunity.”<br/><br/>Zhui Feng fell silent. He looked back at Fang Wang, his eyes shifting, not knowing what he was thinking.<br/><br/>After a long while.<br/><br/>Fang Wang finally completed the inheritance of the Mie Jue Divine Tome. When he opened his eyes, he found himself within the Heavenly Palace.<br/><br/>This made him rate Emperor Donggong even higher, as this emperor truly was generous, bestowing upon him the complete Mie Jue Divine Tome without any deceit.<br/><br/>Fang Wang adjusted his mindset and began to meditate and study the Mie Jue Divine Tome.<br/><br/>The Mie Jue Divine Tome was similar to the Heavenly Emperor Imperial Mirror; it was a set of cultivation technique, including spells, Divine Skills, and even a Qi Gathering Technique.<br/><br/>If one achieved Great Completion with the Mie Jue Divine Tome, one could extinguish anything and everything!<br/><br/>Humans, demons, fiends, immortals, gods, and all things in heaven and earth!<br/><br/>Just by contemplating this technique, Fang Wang could feel the ruthless determination of its creator.<br/><br/>This Absolute Emperor was no simple character!<br/><br/>So far, the Saint Emperors that Fang Wang had come into contact with included the Descending Dragon Great Saint, Executioner Immortal Great Saint, Thousand Eyes Great Saint, Hongxuan Emperor, and Absolute Emperor; perhaps even the Ghost Emperor of the Underworld might be a Great Emperor.<br/><br/>He wondered, who among these powerful beings was stronger at their peak?<br/><br/>Fang Wang felt that the Thousand Eyes Great Saint and Absolute Emperor might be a notch above the rest. The Thousand Eyes Great Saint collected the eyes of one thousand Great Saints and Great Emperors, making his cultivation and scheming unfathomable.<br/><br/>The strength of the Absolute Emperor was something Fang Wang could sense from the Mie Jue Divine Tome.<br/><br/>Fang Wang suspected that the Descending Dragon Great Saint might also have received the inheritance of the Absolute Emperor, as the Mountain River Town Heaven Fist and the Nine Dragons Divine Transformation Art were the ultimate powers of destruction and annihilation, a force that was also present in the Mie Jue Divine Tome.<br/><br/>The Mie Jue Divine Tome had many Divine Skills, not divided into levels, with the Extinction Divine Skill being just one of them. There was even the venomous Divine Skill that could trace bloodlines and annihilate one’s lineage.<br/><br/>These were considered side methods; the strongest Divine Skill within the Mie Jue Divine Tome was named after itself, the Mie Jue Divine Tome. A palm strike releasing the Tome could extinguish everything, and anyone who touched the Mie Jue Divine Tome would be directly reduced to ash, unless there was a vast difference in cultivation levels.<br/><br/>As time passed, Fang Wang’s anticipation for the Mie Jue Divine Tome grew.<br/><br/>However, the more powerful the secret technique, the longer it took.<br/><br/>When Fang Wang had practiced all of the Mie Jue Divine Tome to minor completion, he suddenly realized that four thousand years had passed.<br/><br/>This time, he didn’t feel bored or numb. Instead, he was full of motivation.<br/><br/>For some reason, he felt a deep affinity with the Mie Jue Divine Tome.<br/><br/>He continued to cultivate.<br/><br/>From minor completion to major completion of the Mie Jue Divine Tome, he spent another three thousand years.<br/><br/>Even though Fang Wang’s heart had long been as steadfast as a rock, he began to feel stretched thin.<br/><br/>He could only grit his teeth and continue to cultivate.<br/><br/>He had already mastered the Mie Jue Divine Tome. What was left was to review what he had learned, to constantly refine it, and this process was monotonous.<br/><br/>Not knowing how much time had passed, Fang Wang finally cultivated the Mie Jue Divine Tome to Great Perfection.<br/><br/>After he had cultivated the Mie Jue Divine Tome to Great Perfection, fine lines of golden flame appeared between his eyebrows, indicative of the Heavenly Gang Supreme Yang Tyrant Body. Soon after, a black line emerged beside the golden flame lines, symmetrically, like two curved knives slanting upwards, making him appear even more majestic.<br/><br/>Looking back, he found that cultivating the Mie Jue Divine Tome had taken thirteen thousand years in total.<br/><br/>He had become too lazy to calculate the odd years.<br/><br/>Once again, Fang Wang had set a new personal record for the longest time spent in secluded cultivation. But what mattered most was that Fang Wang had become strong enough, with a not-insignificant comprehension of various Dao, which could have taken an unimaginable amount of time had he attempted to learn this divine tome at a lower realm.<br/><br/>As the Heavenly Palace shattered, Fang Wang’s consciousness returned to reality. He opened his eyes to find himself still surrounded by darkness. The princes and princesses were still receiving their inheritances, all wearing expressions of pain, including Hong Xian’er.<br/><br/>“What’s the matter?”<br/><br/>Emperor Donggong’s voice came through, prompting Fang Wang to turn and look.<br/><br/>At this moment, Emperor Donggong was looking at Fang Wang with surprise.<br/><br/>Not just him; Zhui Feng’s gaze was also somewhat peculiar.<br/><br/>Both had been closely observing Fang Wang, discussing their understanding of him, so when Fang Wang woke up, they were the first to notice. The moment he opened his eyes, they felt a chilling murderous aura radiating from him.<br/><br/>Zhui Feng was just confused, suspecting that Fang Wang might have deviated in his cultivation.<br/><br/>Emperor Donggong, on the other hand, was far less composed on the inside than he appeared on the outside.<br/><br/>The aura of the Mie Jue Divine Tome!<br/><br/>Could it be…<br/><br/>A ludicrous idea formed in Emperor Donggong’s mind, causing him to feel wary of Fang Wang, and for a moment he even considered killing Fang Wang, but he quickly quelled the thought.<br/><br/>After calming down, his trepidation gradually turned to elation.\t\t\t\t\t\t</div>", "images": {}, "success": true}