{"id": 263, "url": "https://www.novelhall.com/i-became-an-immortal-on-mortal-realm-32879/14580811.html", "title": "Chapter 263 - Chapter 263: Chapter 260 Hong Xian’Er, Mie Jue Divine Tome", "volume": 3, "volume_title": "Volume 3", "body": "<h1>Chapter 263 - Chapter 263: Chapter 260 Hong Xian’Er, Mie Jue Divine Tome</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 263: Chapter 260 Hong Xian’er, Mie Jue Divine Tome<br/><br/>Translator: 549690339<br/><br/>After settling in Qianyang Palace, Fang Wang devoted himself to cultivation, while the turmoil of the world continued unabated.<br/><br/>The news that Emperor Donggong had taken Tian Dao Fang Wang under his wing spread, and it buoyed the spirits of those forces dissatisfied with the seven Saint Clans. They began to aggressively unearth scandals of the Saint Clans. Shortly, the seven Saint Clans became infamous across all seas and continents.<br/><br/>Their actions also made the masses start to question the integrity of other Saint Clans.<br/><br/>The public sentiment was fiery, causing unease and instability in the Cultivation Worlds everywhere.<br/><br/>The major powers were waiting for Emperor Donggong’s judgment. Would he deal with the seven Saint Clans?<br/><br/>Such rumors gradually reached Grand Qi, and as the realms of the cultivators entering Grand Qi grew higher, the Cultivation World of Grand Qi began to engage with the true affairs of the Mortal Realm.<br/><br/>In response, the entire Grand Qi was incensed, especially since the seven clans had threatened the lives of Grand Qi’s denizens during Fang Wang’s parents’ critical period. This deepened the hatred of all Grand Qi’s inhabitants, both human and monster, towards the seven clans, and elevated Fang Wang’s stature in their hearts even more.<br/><br/>This was most clearly reflected in the increasing number of people going to Kunlun to offer their assistance, which pleased the Tiangong Sect and the Qiao Clan. With Fang Wang’s prestige, the hope for Kunlun’s construction became even greater.<br/><br/>It was not until two years later that a piece of news reached Grand Qi.<br/><br/>Emperor Donggong had severed the fate of the Han, Ji, Qiu, Liu, Yu, Song, and Feng seven Saint Clans, stripping them of their saintly status!<br/><br/>At first, the people of Grand Qi did not understand the significance of this, but as more information poured into Grand Qi, they came to comprehend Emperor Donggong’s status and what severing fate entailed.<br/><br/>Grand Qi was exhilarated!<br/><br/>It was not just Grand Qi, the entire continent as well as the surrounding seas felt the same, especially the Eternal Life Pavilion in the Southern Celestial Sea. The Pavilion Master ordered a proactive outreach for good relations with the Fang Family.<br/><br/>The protagonist of these events, Fang Wang, was concentrating on cultivating in Qianyang Palace.<br/><br/>He had been cultivating for three years at this point.<br/><br/>Fang Wang’s cultivation had reached the eighth layer of the Nirvana Realm, and the ninth layer was not far off. Before moving into Qianyang Palace, he had been close to breaking through to the eighth layer.<br/><br/>One day, the voice of Zhui Feng echoed outside Qianyang Palace.<br/><br/>“Fang Wang, His Majesty invites you to participate in the assessment,” called Zhui Feng’s voice from outside the gate.<br/><br/>Fang Wang opened his eyes and got up.<br/><br/>He stepped out of the pool, and his dampness evaporated. He then changed into white clothes and headed towards the gate, with Xiao Zi flying swiftly to land on his shoulder.<br/><br/>Pushing open the gate, Fang Wang saw Zhui Feng standing next to a woman dressed in a beautiful blue skirt, her graceful figure and long hair coiled atop her head epitomized dignity. Her delicate and beautiful features made her seem like she had stepped out of a painting; unrealistically beautiful. At that moment, she was studying Fang Wang with wide eyes.<br/><br/>Zhui Feng introduced her to Fang Wang, “This is the Seventh Princess, Princess Yingxue.”<br/><br/>Fang Wang looked at Princess Yingxue and was about to introduce himself when Princess Yingxue spoke first, “Fang Wang, it’s rumored that you’ve slain Qiu Shenji and defeated the Suppressing Evil Golden Buddha. Is that true?”<br/><br/>Her eyes sparkled as they fixed on Fang Wang. With such an arresting gaze from a woman of her beauty, it would be hard for any man to remain indifferent.<br/><br/>Fang Wang nodded slightly, seeing no point in concealing the truth.<br/><br/>Princess Yingxue immediately approached Fang Wang, her quick movement startling Xiao Zi into shivering.<br/><br/>“You’re really that powerful? I’ve heard you’re not yet three hundred years old, is that true? Fang Wang, don’t worry, my father has already cut off the seven clans’ fate for you, they won’t have good days ahead. Bad luck will haunt them, and when breaking through, they’ll encounter heart demons. Within a century, they will be extinct,” Princess Yingxue said excitedly, laughing as she made fists and waved them through the air.<br/><br/>Fang Wang was amused by her actions and laughed, “Then I must thank His Majesty later.”<br/><br/>“Hehe, my real name is Hong Xian’er. From now on you can call me Xian’er; we cultivators don’t need to follow the formalities of the secular world,” said Hong Xian’er, who was Princess Yingxue, with the carefree attitude of a heroic figure from the jianghu.<br/><br/>Xiao Zi watched Hong Xian’er with a wary eye, sensing that this woman had ulterior motives!<br/><br/>Zhui Feng reminded her, “Seventh Princess, we should go, His Majesty is waiting.”<br/><br/>“You lead the way, and I’ll chat with Fang Wang,” she said, waving a dismissive hand, and Zhui Feng began to lead the way.<br/><br/>Fang Wang and Hong Xian’er walked side by side, with Hong Xian’er inquiring about Fang Wang’s experiences while imprisoned by the seven clans. He did not refuse her and briefly described his ordeal.<br/><br/>“Han Huitian also died at your hands, right? That old man deserved to die. He even attempted to introduce his worthless son to my father as a candidate for my consort, totally overestimating his worth. That son of his oppressed ordinary women and seized female disciples from small sects, a complete brute. To spawn such a brute, he was no better himself. Good riddance!” Hong Xian’er cursed fluently, her graceful appearance contrasted sharply with her coarse language.<br/><br/>Not only did she curse Han Huitian, she went on to verbally assail Qiu Shenji and the Suppressing Evil Golden Buddha with even more vulgar language, especially when cursing the Suppressing Evil Golden Buddha, she went as far as to include his mother.<br/><br/>Fang Wang was rather speechless. How had Emperor Donggong raised such a daughter?<br/><br/>Though her words were crass, listening to her curse these people, Fang Wang found it quite satisfying.<br/><br/>“The Buddhist Sect is nothing but a bunch of sanctimonious hypocrites. No, that’s too kind to them. If it weren’t for my father being alive, this world would probably have become their realm of chaos. I know some of them, to avoid breaking their sect rules, would deliberately massacre entire families, leaving only an exceptionally talented orphan to then take in as a disciple…”<br/><br/>By the time Hong Xian’er finished speaking, her cheeks were puffed out with anger, and although red and rosy, it made her look not frightening but rather adorable.<br/><br/>Xiao Zi was also swayed by her words, joining her in cursing the Suppressing Evil Golden Buddha. Xiao Zi remembered the words the Buddha had directed at Fang Wang, and when she repeated them, Hong Xian’er became even angrier and even began to curse the Suppressing Evil Golden Buddha.<br/><br/>Zhui Feng, walking ahead, seemed to have gotten used to it and neither opened his mouth nor looked back.<br/><br/>When they finally arrived in front of the Imperial Palace’s main hall, Hong Xian’er at last stopped talking and gave Xiao Zi an appreciative look.<br/><br/>Xiao Zi felt the same way, finding this girl more agreeable than Zhou Xue, Gu Li, and Tai Xi, and to her taste.<br/><br/>Once they entered the hall, Fang Wang saw dozens of figures, men and women alike, and they all turned to look at him.<br/><br/>Emperor Donggong sat at the head of the hall and, seeing Hong Xian’er walking beside Fang Wang with a flushed little face, he couldn’t help but smile.<br/><br/>“This girl showing such a shy expression beside a man, it seems she has taken a liking…” Emperor Donggong’s eyes grew more pleased as he looked at Fang Wang.<br/><br/>The princes and princesses made way, each looking at Fang Wang with different expressions. Following Zhui Feng, Fang Wang approached the front and saluted Emperor Donggong.<br/><br/>Emperor Donggong said with a cheerful tone, “This must be the world-renowned Tian Dao Fang Wang, who isn’t yet three hundred years old, yet has the ability to slay Sky-Stepping Realm great cultivators.”<br/><br/>The princes and princesses had already investigated Fang Wang’s background, but even so, hearing their father confirm Fang Wang’s age, they couldn’t help but be shocked.<br/><br/>How did this guy cultivate?<br/><br/>“It seems, Fang Wang, you have the potential to achieve the Saintly Emperor Certification,” said a prince with a laugh.<br/><br/>Emperor Donggong replied, “Indeed, I believe so too, and that is why I wish to betroth the Seventh Princess to Fang Wang, and from then on, we shall all be one family.”<br/><br/>At these words, Hong Xian’er’s beautiful eyes widened in astonishment as she turned to gaze at her father.<br/><br/>Fang Wang clearly noticed the anger in her eyes, but it faded quickly.<br/><br/>Hong Xian’er spun her eyes around and said with feigned coquetry, “Father, that doesn’t seem right. Fang Wang has someone in his heart.”<br/><br/>“A true man should have more than one wife and several concubines, just like your father, and your brothers. Who has only one woman? As long as you focus on your cultivation, you will be the one who will always accompany Fang Wang. All those fair-weather women will return to dust, and I am betrothing you to Fang Wang in hopes that he can lead you to greater heights,” said Emperor Donggong nonchalantly.<br/><br/>Fang Wang was about to decline politely, but Emperor Donggong raised his hand and interrupted, “Enough, Fang Wang, we’ll talk about this matter later. You and Xian’er have not truly spent time together yet, do not refuse hastily. Today, we’ll talk about the matter of inheritance.”<br/><br/>The other princes looked at Fang Wang eagerly; if Fang Wang became family, it would be different for them.<br/><br/>Some of the princesses showed envy. With Fang Wang’s undeniable talents, he was bound to become an imposing figure in the mortal realm, and where could they find such a man?<br/><br/>“Fang Wang, I have already severed the fates of the seven clans. Your vengeance is accounted for. In at most a hundred years, these clans will completely disappear from the mortal realm, either dying in their tribulations or from disasters and diseases. You need not worry,” Emperor Donggong said with a stroke of his beard and a smile.<br/><br/>Fang Wang found that Emperor Donggong was brimming with Yang Energy and had at least four thousand years of Yang Energy left. It seemed that using the divine skill to cut the fate of the clans didn’t affect him much.<br/><br/>This made Fang Wang even more curious about what kind of fate Emperor Donggong had.<br/><br/>After the inheritance issue was settled, he had to find time to ask Zhou Xue.<br/><br/>While thinking this, Fang Wang expressed gratitude for Emperor Donggong’s noble gesture.<br/><br/>Emperor Donggong continued, “This divine skill comes from the Mie Jue Divine Tome, which is the inheritance of the Absolute Emperor, the last Great Emperor of the mortal realm who vanished over twenty thousand years ago, after appearing for only a few hundred years. This has led later generations to doubt his existence. I doubted it too, until I received his inheritance.”<br/><br/>Mie Jue Divine Tome!<br/><br/>Absolute Emperor!<br/><br/>Everyone in the hall was moved by this revelation, including Zhui Feng.<br/><br/>“Father, when did you receive the Absolute Emperor’s inheritance?”<br/><br/>“Legend has it the Absolute Emperor ascended to immortality, is that true?”<br/><br/>“The legends I heard say the Absolute Emperor entered Jiu You.”<br/><br/>“To think that the Absolute Emperor really existed. If one managed to cultivate the Mie Jue Divine Tome, wouldn’t that mean becoming the second Absolute Emperor?”<br/><br/>“Father, are you going to pass the Mie Jue Divine Tome to us, or just the divine skill to sever fate?”<br/><br/>The princes and princesses were all excited, their eyes fervent.<br/><br/>Fang Wang too began to hope, never expecting he might receive divine skills from the Absolute Emperor himself.<br/><br/>With the Mie Jue Divine Tome, he intended to challenge the belief of the Hongxuan Emperor with his Heavenly Emperor Imperial Mirror, to see if he would still doubt its existence.<br/><br/>Emperor Donggong’s eyes turned sharp as he said, “Indeed, I intend to pass on the Mie Jue Divine Tome to you, but only three among you will receive it. My children are far more numerous than just you, and I have chosen you because you meet my criteria for inheritance. Before the assessment, I must tell you plainly that I sense my time of demise is approaching. Perhaps within a few hundred years, I will fall. To stand firm in the future, you must unite; you all know how many powers I have offended over the years.”\t\t\t\t\t\t</div>", "images": {}, "success": true}