{"id": 265, "url": "https://www.novelhall.com/i-became-an-immortal-on-mortal-realm-32879/14581517.html", "title": "Chapter 265 - Chapter 265: Chapter 262 God Record Vs. God Record_1", "volume": 3, "volume_title": "Volume 3", "body": "<h1>Chapter 265 - Chapter 265: Chapter 262 God Record Vs. God Record_1</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 265: Chapter 262 God Record vs. God Record_1<br/><br/>Translator: 549690339<br/><br/>Fang Wang regained his senses and spoke, “I’m fine, it’s just that the Mie Jue Divine Tome is too profound, causing me to feel somewhat lost.”<br/><br/>His voice was a bit hoarse, and his tone carried an indescribable duskiness, mixed with a fierce resolve.<br/><br/>This fierce resolve was nurtured from studying the Mie Jue Divine Tome, and it would be difficult to return to his former self in a short time.<br/><br/>Zhui Feng breathed a sigh of relief. From Fang Wang’s response, he hadn’t fallen into devilment.<br/><br/>Emperor Donggong’s gaze was subtle, fixated on Fang Wang.<br/><br/>Fang Wang met his eyes and could feel the Mie Jue Divine Tome within him.<br/><br/>It was not surprising that Emperor Donggong had cultivated the Mie Jue Divine Tome, but upon closer inspection, Fang Wang deemed his mastery to be only at an elementary level.<br/><br/>If he could sense Emperor Donggong’s Mie Jue Divine Tome, then naturally Emperor Donggong could sense his as well.<br/><br/>Thus, he faced Emperor Donggong’s gaze openly and unabashedly.<br/><br/>A silent stillness enveloped the dark Illusionary Realm, and Zhui Feng, sensing something amiss in the atmosphere, couldn’t see through it.<br/><br/>After a long while.<br/><br/>Emperor Donggong suddenly smiled.<br/><br/>Fang Wang also withdrew his gaze and began to observe the others.<br/><br/>Princes and Princesses had already begun to tremble, fear creeping over their faces.<br/><br/>“The Cataclysmic Badlands, indeed not bad. In the future, my Kunlun could also adopt this method to test those seeking the Dao,” Fang Wang thought to himself as he also strived to adjust his own mindset.<br/><br/>The tedium of thirteen thousand years was understood by him alone.<br/><br/>Perhaps not many of the Great Saints could meditate in seclusion for thirteen thousand years straight; at least the Descending Dragon Great Saint hadn’t.<br/><br/>Having experienced the trials in the Heavenly Palace before, Fang Wang no longer emitted the malignant aura or felt the need to vent as he used to.<br/><br/>He just needed some quiet time.<br/><br/>Time ticked away second by second.<br/><br/>Suddenly.<br/><br/>Hong Xian’er opened her eyes, gasping heavily, her face drenched in cold sweat.<br/><br/>“Xian’er, to cultivate the Mie Jue Divine Tome, you need even firmer resolve,” Emperor Donggong spoke.<br/><br/>Coming back to her senses, Hong Xian’er instinctively wanted to argue. She suddenly glanced towards Fang Wang, her beautiful eyes widened in shock, and she asked in astonishment, “How much faster were you than me?”<br/><br/>Fang Wang’s expression was neutral as he said, “Not much faster, just a moment ago.”<br/><br/>Zhui Feng had a strange expression on his face but said nothing.<br/><br/>Emperor Donggong smiled without comment.<br/><br/>Hong Xian’er approached Fang Wang, looking at him with surprised admiration, and remarked, “You are truly ruthless, to kill so many people just like that?”<br/><br/>Fang Wang was puzzled, not knowing what she was talking about.<br/><br/>“Everyone fears different things and faces different trials,” came the voice of Emperor Donggong, which enlightened Hong Xian’er with realization.<br/><br/>Turning around, Hong Xian’er faced Emperor Donggong and asked, “Father, could you see what I went through?”<br/><br/>Emperor Donggong nodded and replied, “Yes, you’re most afraid of fratricidal strife, hence you killed all your brothers and sisters.”<br/><br/>With an eye roll and an exasperated tone, Hong Xian’er retorted, “What are you saying, Father? It was clearly your illusion that forced them against me, leaving me no choice but to strike.”<br/><br/>Emperor Donggong said, “Their intent to kill was already evident, yet you hesitated for some time. Xian’er, when Father is no longer in this world, the only person you can trust is yourself.”<br/><br/>These earnest words made Fang Wang curious about what Emperor Donggong’s own tribulation might be.<br/><br/>Fang Wang did not rashly offer any help; after all, as one of the mightiest in the human world, how could Emperor Donggong’s tribulation be something he could interfere with?<br/><br/>Merely killing Qiu Shenji from the Sky-Stepping Realm was already enough to exhaust him.<br/><br/>“Oh, Father, don’t you always say that everyone has their tribulations, and as long as you break through them, you can achieve Nirvana and become stronger? It’s both a trial and a fate, isn’t it?” Hong Xian’er spoke indifferently, showing no concern for her father’s worries.<br/><br/>Emperor Donggong couldn’t help but chuckle, looking at Fang Wang, he said, “Fang Wang, this girl of mine may seem naive, but she is actually quite astute. If she ever plays tricks on you, you’ll have to bear with it.”<br/><br/>Upon hearing this, Hong Xian’er said in a wronged tone, “Father, are you really going to marry me off to him? Although he’s outstanding, I don’t want to marry. I have ambitions just like you; how can the love between men and women compare to proving oneself as an emperor?”<br/><br/>This actually made Fang Wang look at Hong Xian’er in a new light.<br/><br/>Fang Wang liked people with lofty goals, regardless of gender, one should never prioritize romantic affairs.<br/><br/>Emperor Donggong said cheerfully, “Do you think that marrying Fang Wang means you’ll have to be a wife and mother, living in luxury like your sisters? You’re mistaken. With him, you’ll face numerous hardships and get to travel the world, seeing all its wonders. Isn’t that what you long for?”<br/><br/>Hearing this, Hong Xian’er fell silent.<br/><br/>Fang Wang cleared his throat and said, “This matter requires further discussion, no hurry, no hurry.”<br/><br/>Thirteen thousand years had passed, and he had almost forgotten about this matter.<br/><br/>Admittedly, Hong Xian’er was extremely beautiful, ranking among the top in terms of looks among all the women he had met. But if it was just about appearance, he was not lacking in women.<br/><br/>Emperor Donggong smiled and said no more.<br/><br/>Hong Xian’er then glared at Fang Wang.<br/><br/>Fang Wang pretended not to notice.<br/><br/>In the subsequent waiting time, Hong Xian’er and Emperor Donggong chatted casually, occasionally commenting on other princes and princesses.<br/><br/>After a full five hours, just as Hong Xian’er was about to lose her patience, Emperor Donggong finally dissolved the Illusionary Realm.<br/><br/>Fang Wang was actually okay, having just spent a dry thirteen thousand years sitting.<br/><br/>The darkness faded, and everyone returned to the main hall.<br/><br/>Xiao Zi, who was perched on Fang Wang’s shoulder, woke up. It looked up, saw Fang Wang, and heaved a sigh of relief, choking up, “Master, you actually thought about killing me just now. Even though it was an Illusionary Realm, it still made me very sad.”<br/><br/>Fang Wang glanced at it and retorted, “Knowing it was an Illusionary Realm, why didn’t you kill me?”<br/><br/>“Even in an Illusionary Realm, I’d rather die by your hand than kill you,” Xiao Zi said in a lovesick tone.<br/><br/>“Tch.”<br/><br/>Hong Xian’er snorted coldly.<br/><br/>The others gradually woke up, filling the great hall with noise.<br/><br/>“Zhui Feng, take Fang Wang down,” ordered Emperor Donggong.<br/><br/>Zhui Feng immediately obeyed; Fang Wang turned around, took a couple of steps, then suddenly remembered something, turned back, and made a respectful gesture towards Emperor Donggong.<br/><br/>Hong Xian’er watched Fang Wang with suspicion, sensing something was off with him.<br/><br/>Thus, Fang Wang left with Xiao Zi, while the princes and princesses looked towards Emperor Donggong with unease.<br/><br/>Hong Xian’er turned back and asked, “Father, didn’t Fang Wang pass the test? Only the two of us cleared it, so he should be among the top three performers. Why aren’t you passing him on? Could it be because he doesn’t want to marry me?”<br/><br/>Upon hearing this, all the princes and princesses looked at her. They were not surprised but felt envious.<br/><br/>Emperor Donggong answered, “Fang Wang hasn’t cultivated our family’s mental method. Even if we were to pass it on to him, it would have to be done separately. Today, we talk about you first.”<br/><br/>The palace doors then closed.<br/><br/>Elsewhere.<br/><br/>Fang Wang, with Xiao Zi, returned to Qianyang Palace, sat cross-legged, and extended his consciousness into the Jade Bracelet, waiting for Zhou Xue’s response.<br/><br/>After a while, ripples of Zhou Xue’s consciousness emanated from the Jade Bracelet.<br/><br/>Fang Wang immediately delved his consciousness into it and entered the Illusionary Realm.<br/><br/>Zhou Xue appeared before Fang Wang, and upon seeing him, she arched her eyebrows and asked, “Did you even master the Mie Jue Divine Tome?”\t\t\t\t\t\t</div>", "images": {}, "success": true}