{"id": 262, "url": "https://www.novelhall.com/i-became-an-immortal-on-mortal-realm-32879/14580809.html", "title": "Chapter 262 - Chapter 262: Chapter 259: The Seniority Of Fang Wang", "volume": 3, "volume_title": "Volume 3", "body": "<h1>Chapter 262 - Chapter 262: Chapter 259: The Seniority Of Fang Wang</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 262: Chapter 259: The Seniority of Fang Wang<br/><br/>Translator: 549690339<br/><br/>“Your Majesty, this is Fang Wang.”<br/><br/>Emperor Tao approached the pavilion and introduced Fang Wang to Emperor Donggong.<br/><br/>Fang Wang clasped his fists in a salute and said, “Junior Fang Wang, greets Your Majesty.”<br/><br/>Perched on his shoulder, Xiao Zi stared curiously at Emperor Donggong, her eyes somewhat odd.<br/><br/>Fang Wang noticed Emperor Donggong’s gaze but did not cover up the Dragon Jade Ring; perhaps Emperor Donggong had some connection with the Descending Dragon Great Saint.<br/><br/>Emperor Donggong withdrew his gaze, saying with emotion, “With such talent, and having inherited from the Great Saint, Fang Wang, you are remarkable. For ten thousand years, so many have sought the legacy of the Descending Dragon Great Saint, but you are the only one to have obtained the Dragon Jade Ring. It seems you have indeed been acknowledged by the Descending Dragon Great Saint.”<br/><br/>Fang Wang replied neither humbly nor arrogantly, “The Descending Dragon Great Saint indeed agreed to take me as his disciple; this is my fortune.”<br/><br/>He had more than one mentor, and the Three Great True Cultivations from the Descending Dragon Great Saint were the foundation and core of the Heavenly Dao Immensity Scripture, naturally qualifying him as his mentor. He would not allow his current achievements to make him conceited, disregarding past kindness.<br/><br/>“Disciple?”<br/><br/>Emperor Tao was visibly moved and looked at Fang Wang with a new light in his eyes.<br/><br/>Emperor Donggong, however, was not surprised and laughed, “The Dragon Jade Ring is after all a symbol of the Descending Dragon Great Saint’s identity—an object that cannot be stolen even if one wished to. If we speak of seniority, Fang Wang, you are now akin to my grand-mentor.”<br/><br/>Hearing this, Fang Wang hastily said, “Junior dares not accept such an honor.”<br/><br/>Emperor Donggong laughed heartily and replied, “It’s alright. This relation can be kept in mind, from now on we are all family.”<br/><br/>Emperor Tao was inwardly astonished.<br/><br/>Fang Wang had become Emperor Donggong’s grand-mentor, skyrocketing to the heavens, securing the greatest backer in the Eastern Mortal Realm.<br/><br/>Fang Wang, however, did not feel any surprise. He felt that Emperor Donggong’s fate was nearing its end and could not protect him for long.<br/><br/>Emperor Donggong motioned for Fang Wang to enter the pavilion and gave Emperor Tao a look, prompting him to salute and then leave.<br/><br/>Only Fang Wang, Emperor Donggong, and Xiao Zi remained in the garden.<br/><br/>After sitting down, Xiao Zi suddenly asked, “What is your relation to Hong Chen?”<br/><br/>Emperor Donggong was taken aback, looked at her, and answered, “He is my grandfather, how do you know of his name?”<br/><br/>Xiao Zi looked at Fang Wang, and seeing him nod, proudly revealed her origin.<br/><br/>When Emperor Donggong heard that Xiao Zi was actually a princess from the True Dragon Clan under the Descending Dragon Great Saint, he became solemn with respect. Could it be that even this little dragon’s seniority was higher than his?<br/><br/>He suddenly felt that with Fang Wang and Xiao Zi together, even without his support, they could rise and shake the world.<br/><br/>“After ten thousand years, the legacy of the Descending Dragon Great Saint remains. However, the cultivators from those major forces dare not touch the cause and effect of The Upper Realm, and the lesser beings with humble roots cannot gain the Great Saint’s acknowledgment. Your emergence might be the sign of an approaching golden age. Fang Wang, rest assured, I will punish those seven Holy Clans rigorously. Next, you can cultivate here under my guidance. How does that sound?” Emperor Donggong said with emotion, his tone becoming serious toward the end.<br/><br/>Fang Wang hesitated, “I’m afraid I might cause trouble for my senior.”<br/><br/>“What trouble? If your seniority weren’t higher than mine, I would even wish to take you as my disciple. Having a disciple like you, even if I fail to achieve my own success, I could descend to the nine springs with a smile.” Emperor Donggong laughed.<br/><br/>For some reason, Fang Wang sensed regret in his words.<br/><br/>And Fang Wang felt this regret was not directed at him but at Emperor Donggong himself.<br/><br/>He thought of Emperor Donggong’s lifelong pursuit of becoming a Saintly Emperor and how Emperor Donggong might feel his limits approaching, hence the regret.<br/><br/>If Emperor Donggong had become a Saintly Emperor, Fang Wang would have heard of his name from Zhou Xue long ago.<br/><br/>Emperor Donggong started talking about his own Grand Yu Divine Dynasty, his words filled with pride. He began with its developmental history, introduced the current foundation of the Divine Dynasty, and ultimately talked about the future plans for the Grand Yu Divine Dynasty.<br/><br/>Even Xiao Zi listened with rapt attention.<br/><br/>A Divine Dynasty where humans and demons coexist, where all beings aspire to cultivate and there is no internal strife, only the ambition to surpass The Upper Realm, how could such a dynasty not make humans and demons yearn for it?<br/><br/>Emperor Donggong sighed, then poured himself a cup of wine and drained it in one gulp.<br/><br/>Fang Wang asked, “May I know why Your Majesty sighed?”<br/><br/>Emperor Donggong said melancholically, “The entire dynasty awaits my ascent to Emperorhood, and so does half the Mortal Realm. They all think I am the most likely to become Emperor. Indeed, when looking across the land, this is true. But from my own perspective, the day I become Emperor seems distant and unachievable, even though I have reached the pinnacle of Mortal Realm cultivation. To me, the title of Great Emperor is still elusive.”<br/><br/>“If I fail to become Emperor, everything I have established might crumble. Although I have descendants, they can barely be considered talented. Let alone becoming Emperor, the likelihood of them reaching even half my level is slim.”<br/><br/>Fang Wang didn’t know how to comfort him; some things in this world can be achieved with effort, but some are simply out of reach, no matter how hard one tries.<br/><br/>He had not yet faced the challenge of achieving Saintly Emperor Certification; he didn’t even understand the mysteries of a Great Saint or Great Emperor.<br/><br/>Emperor Donggong looked at him and said with a laugh, “I possess a Divine Power to Sever Fate, which enables me to cut the fate of Holy Clans, and this is why all the clans and sects in the world submit to me. They do not respect me for my righteousness; they are simply afraid I will deal with them, and they hope to use me to tackle enemies they cannot themselves defeat. Having been in this position for so long, I increasingly feel the need for my legacy to continue, to maintain this measure of law for the world, so that the Holy Clans, Imperial Clans will remain mindful.”<br/><br/>Fang Wang couldn’t help asking, “Does using the Divine Power to Sever Fate come with a price?”<br/><br/>Emperor Donggong laughed, “Of course, any Divine Skills involving fate and causality, the stronger they are, the greater the price. If I were to eradicate the fate of the seven clans, it would cost me five hundred years of yang life.”<br/><br/>Fang Wang fell silent.<br/><br/>Xiao Zi also looked at Emperor Donggong with new respect, never having expected that the emperor would sacrifice so much for Fang Wang.<br/><br/>“How about it, Fang Wang, would you like to inherit my Divine Skills, or even my Grand Yu Divine Dynasty?” Emperor Donggong’s words were bold and startling, making Fang Wang look up and Xiao Zi’s dragon eyes widen.<br/><br/>Frowning, Fang Wang said, “Your Majesty, we’ve only just met, and you place such great trust in me; I fear it’s inappropriate. Moreover, your descendants would not agree.”<br/><br/>With a teasing smile, Emperor Donggong said, “If you just defeat them, wouldn’t that solve the issue? Besides, I can betroth my most beautiful daughter to you to help your Fang Family rise to power. The land of Grand Qi is too small for you, and not fitting.”<br/><br/>Fang Wang fell silent once more.<br/><br/>Unable to hold herself back, Xiao Zi said, “Wow, Emperor Donggong, so that was your plan. Makes sense, given that my master will sooner or later become a saint, and might even surpass the Great Saints. Leaving your descendants in my master’s care is indeed the best plan. But we must consider the order; the position of the principal wife is open for discussion. I am a princess of the True Dragon Clan, and my status and position may not be beneath that of your daughter.”<br/><br/>Hearing this, Emperor Donggong burst into hearty laughter.<br/><br/>Fang Wang patted Xiao Zi’s head and said to Emperor Donggong, “How about this: you pass down your Divine Skills to me, and the Grand Yu Divine Dynasty remains with your descendants. Should they encounter any trouble in the future, I will surely lend a hand.”<br/><br/>Emperor Donggong raised his eyebrows and said, “My Grand Yu Divine Dynasty is among the top dynasties in the Eastern Mortal Realm, simply not expansive. Are you sure you do not want it?”<br/><br/>Fang Wang responded, “Compared to benefits, I care more about responsibility. My temperament does not suit bearing such a heavy burden.”<br/><br/>Emperor Donggong looked deeply at Fang Wang and said, “You may stay for now. In three years, I will invite you to join my heirs in a test, and only those who pass may inherit my Divine Skills.”<br/><br/>Interested in the Divine Power to Sever Fate, which would benefit him in eradicating his enemies once and for all, Fang Wang nodded in agreement.<br/><br/>Emperor Donggong tapped the table with his wine cup. Instantly, a figure appeared out of nowhere, knelt on one knee, and saluted with a fist.<br/><br/>This person wore black armor, was lean, with a cold face, and a single strand of white hair on his forehead, making his aura all the more striking.<br/><br/>“Zhui Feng, take him to stay at Qianyang Palace,” Emperor Donggong ordered.<br/><br/>Upon hearing this, Zhui Feng cast a surprised glance at Fang Wang and then took the command.<br/><br/>Fang Wang stood up, saluted Emperor Donggong with a fist, and followed Zhui Feng away.<br/><br/>Emperor Donggong remained seated in the pavilion, watching Fang Wang walk away.<br/><br/>Qianyang Palace, located in the southern district of the Imperial Palace, was quiet along the way. Fang Wang and Xiao Zi admired the scenery as they followed.<br/><br/>Fang Wang noticed that there were very few people inside the Imperial Palace, which seemed quite deserted.<br/><br/>Only after half a stick of incense’s time did they finally arrive in front of Qianyang Palace.<br/><br/>Zhui Feng pushed open the main door, revealing a resplendent and spacious hall before Fang Wang and Xiao Zi, as overwhelming Spiritual Energy rushed toward them.<br/><br/>“If you have any needs, just speak, and someone will hear,” Zhui Feng said. After bowing to Fang Wang, he turned and left.<br/><br/>Xiao Zi hurried into the hall while Fang Wang cautiously used his divine sense to scan the area for danger before entering.<br/><br/>He hooked his left hand towards the door from his waist, and it slammed shut with a thunderous sound.<br/><br/>“Master, Emperor Donggong seems to truly hold you in high regard,” Xiao Zi remarked.<br/><br/>Inside Qianyang Palace, the decor was luxurious, with beds for resting, tables and chairs for hosting guests, and even side halls for practicing Spells.<br/><br/>Approaching a pond in the center of the main hall, Fang Wang said, “Let’s practice here for three years first.” After the long battles, he was tired and needed Qi Gathering to recover his state of mind.<br/><br/>He entered the pond, sat down to meditate and began to cultivate.<br/><br/>Xiao Zi wandered around the hall, curious about everything inside.<br/><br/>Dark clouds churned, and lightning flashed with the roar of thunder.<br/><br/>At the foot of a mountain, the ground was pitted with holes, and corpses were strewn everywhere; it was a shocking sight. At this moment, more than a dozen Cultivators were standing on the bloodied earth, looking up at a figure on the summit with faces filled with despair and fear.<br/><br/>“Who are you… and why do you oppose the Han Clan?” An elderly man asked with a trembling voice. Looking closer, one could see that each of their feet was buried in the soil, with blood spreading up their boots.<br/><br/>Boom!<br/><br/>A bolt of lightning struck, illuminating the figure on the mountain top.<br/><br/>It was Fang Zigeng.<br/><br/>Fang Zigeng was dressed in a red robe, with white hair billowing in the wind, and his face, half covered in eerie black patterns, emotionlessly gazed down at the Han Clan Cultivators. A chillingly sinister aura emanated from him.<br/><br/>“Blame your clan’s elders for their lack of foresight, for they set their sights on Fang Wang,” Fang Zigeng’s indifferent voice rang out. He then raised his hand, and the Great Cauldron rose behind him, suspended in the air, its mouth turned towards the Han Clan Cultivators at the mountain foot.\t\t\t\t\t\t</div>", "images": {}, "success": true}