{"id": 268, "url": "https://www.novelhall.com/i-became-an-immortal-on-mortal-realm-32879/14582604.html", "title": "Chapter 268 - Chapter 268: Chapter 265: Seeking Death Is The Easiest Thing", "volume": 3, "volume_title": "Volume 3", "body": "<h1>Chapter 268 - Chapter 268: Chapter 265: Seeking Death Is The Easiest Thing</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 268: Chapter 265: Seeking Death is the Easiest Thing<br/><br/>Translator: 549690339<br/><br/>With Hong Xian’er and Xu Qiuming keeping him company, Fang Wang’s subsequent journey was far from dull, primarily because Hong Xian’er and Xiao Zi chattered incessantly, seeming to have an endless stream of conversation.<br/><br/>Fang Wang and Xu Qiuming walked behind them, and Fang Wang had Xu Qiuming share his experiences over the years, which Xu Qiuming did without any concealment.<br/><br/>Xu Qiuming’s experiences were also rich, no less significant than Fang Hanyu’s, and even more spectacular.<br/><br/>In his pursuit of the Sword Dao, he had experienced all kinds of emotional entanglements, including the love between men and women as well as the bonds of close friendship. He faced betrayal and witnessed people he cared about die before his eyes, powerless to help them.<br/><br/>Now, he had grown up and possessed the demeanor of a master of the Sword Dao, but only he knew the bitterness behind his growth.<br/><br/>Not just him, any powerful figure who had grown significantly could have their experiences written into a lengthy saga.<br/><br/>As Xu Qiuming shared his experiences, Xiao Zi would occasionally interject, and Hong Xian’er introduced the scenery along the way, increasingly uplifting Fang Wang’s spirits.<br/><br/>Half a day later, dusk fell.<br/><br/>They stopped beside a large river. Under the fiery sky, the river waves surged, bringing a strong breeze that caused their robes to flap violently.<br/><br/>“Let’s rest here for the night. I’ll also take the opportunity to give some pointers to Xu Qiuming,” Fang Wang said.<br/><br/>Hearing this, Xu Qiuming was elated, and neither Hong Xian’er nor Xiao Zi had any objections.<br/><br/>Curious, Hong Xian’er asked, “Fang Wang, you understand the Sword Dao?”<br/><br/>In her mind, Fang Wang was most famous for his formidable physical body, especially the Nine Dragons Tyrant Fist, which was already renowned far and wide.<br/><br/>Xiao Zi laughed proudly and said, “The thing my master is best at is the Sword Dao.”<br/><br/>Xu Qiuming nodded and added, “That’s right, in our Grand Qi, he is known as the Sword Saint.”<br/><br/>Hong Xian’er’s gaze towards Fang Wang changed. How had he cultivated?<br/><br/>Not even three hundred years old, he had achieved exceptional skill on the paths of fist techniques, swordsmanship, and body cultivation—it was truly beyond comprehension.<br/><br/>Now that the conversation had reached this point, Fang Wang naturally had to demonstrate.<br/><br/>He raised his right hand, and in an instant, the torrential flow of the river halted, and a vast Sword Intent enveloped heaven and earth.<br/><br/>Celestial Sword Intent!<br/><br/>Fang Wang’s Celestial Sword Intent was at the Great Perfection Realm, so the higher his cultivation, the stronger his Sword Intent; he didn’t even need to work on enhancing his Celestial Sword Intent.<br/><br/>The moment this Sword Intent appeared, both Hong Xian’er and Xu Qiuming were moved.<br/><br/>Even Hong Xian’er, who was at the ninth level of the Divine Passage Realm, was stunned. The mere presence of this Sword Intent made her feel utterly no match for Fang Wang.<br/><br/>Keep in mind, she was a peerless genius who could dominate her own realm and even fight beyond it!<br/><br/>Hong Xian’er had always believed that Fang Wang’s talent was greater than her own, and his strength as well, especially since she found it difficult to slay someone at the Sky-Stepping Realm.<br/><br/>But only after truly feeling Fang Wang’s Sword Intent did she realize she had underestimated him.<br/><br/>No wonder her father was so insistent on pushing her towards Fang Wang. After careful consideration, it was in fact she who was reaching above her station.<br/><br/>Xu Qiuming was equally shocked; he knew Fang Wang’s Sword Intent couldn’t be weak, but he had no idea it was this formidable.<br/><br/>It was like looking up at a towering mountain!<br/><br/>Suddenly, Xu Qiuming felt an overwhelming sense of helplessness, even despair.<br/><br/>At that moment, Fang Wang patted his shoulder and said, “What are you thinking about? You are the Sword Dao talent I hold in the highest regard. You will definitely become the world’s second-best Sword Cultivator. In the future, you will be my only rival in the Sword Dao.”<br/><br/>Fang Wang could tell what he was thinking just by looking at him.<br/><br/>Xu Qiuming was a future supreme being, and his strength could only increase, not weaken, because of this variable!<br/><br/>Upon hearing this, a spark lit up in Xu Qiuming’s eyes, and he couldn’t help asking, “Do you really think so?”<br/><br/>“Nonsense. I’ve even encountered the seven Great Saint Clans, and I’ve slain those mighty beings at the Sky-Stepping Realm. Why would I lie to you? You can ask Xiao Zi; I’ve only ever said such things to you,” Fang Wang said earnestly.<br/><br/>“Indeed,” Xiao Zi followed.<br/><br/>It remembered Fang Wang saying the same thing to the Fang Family’s swordsmanship prodigy Fang Bai.<br/><br/>Xu Qiuming smiled, feeling inspired, and took a deep breath, “It seems my mental state is lacking. Even if I’m not as good as you, I need to possess an invincible heart filled with absolute confidence just like you.”<br/><br/>“You will eventually be invincible. After all, we aren’t enemies. In five hundred years, anyone who becomes our enemy would be truly pitiful, wouldn’t they?” Fang Wang said with a soft chuckle.<br/><br/>These words sent Xu Qiuming’s blood boiling.<br/><br/>Hong Xian’er, on the other hand, didn’t understand. In her opinion, Xu Qiuming’s talent was really quite ordinary, so she could only attribute it to Fang Wang’s loyalty.<br/><br/>Such a man had even more allure!<br/><br/>He was much stronger than those geniuses who were arrogant simply because of their talent.<br/><br/>Fang Wang began to explain the Celestial Sword Intent to Xu Qiuming, while Hong Xian’er stood aside, listening.<br/><br/>Although the river was still, the river breeze continued, fluttering Fang Wang’s hair. Looking at his profile, Hong Xian’er suddenly thought of Kunlun.<br/><br/>It seemed he truly possessed a heart full of righteousness.<br/><br/>She could feel that the Sword Intent Fang Wang passed on was very profound; he wasn’t deceiving Xu Qiuming nor did he avoid her presence.<br/><br/>She had heard before that Fang Wang would generously offer guidance to seekers of the way without expecting anything in return. Now that she had witnessed it, she was thoroughly convinced.<br/><br/>The sunset gradually gave way, followed by the approaching night.<br/><br/>The moon set and the sun rose.<br/><br/>As the early morning sun swept across the river, Fang Wang and the two others still stood by the riverside, Xu Qiuming and Hong Xian’er immersing themselves in Fang Wang’s Celestial Sword Intent, not feeling the slightest fatigue.<br/><br/>Xiao Zi lost interest after listening for half the night and dozed off to the side.<br/><br/>Fang Wang withdrew the Celestial Sword Intent, and a rumbling sound resounded between heaven and earth, like the roar of mighty rivers.<br/><br/>Xu Qiuming and Hong Xian’er were jolted awake.<br/><br/>Xu Qiuming exclaimed with emotion, “The mysteriousness of the Celestial Sword Intent is deeper than I imagined. Sword Heaven Marsh’s Celestial Sword Intent cannot compare with yours at all, perhaps because you are at a higher stage of cultivation.”<br/><br/>Fang Wang smiled and said, “My master Sword Saint’s Celestial Sword Intent is indeed quite good, at the very least his direction is remarkable. If his talent were like yours or mine, he too could have become a Saint.”<br/><br/>This time, Xu Qiuming did not think that Fang Wang was merely comforting him, as even the Solitary Life Elder had said he possessed the constitution of a Saint.<br/><br/>Suddenly, Hong Xian’er raised her hand, and the torrential rivers came to an abrupt halt, even the sound of the wind ceased, the clouds in the sky became stationary, everything quieted down, and Xu Qiuming also felt an immense pressure, turning his head slowly as his eyeballs moved sluggishly.<br/><br/>Everything slowed down, but Xu Qiuming’s thoughts did not.<br/><br/>Fear was evident in his eyes.<br/><br/>How could this be!<br/><br/>Fang Wang, however, was unaffected. He turned his head to look at Hong Xian’er with a look of astonishment.<br/><br/>Xiao Zi was completely immobilized, unable to move.<br/><br/>Hong Xian’er pouted and said, “So this is the Celestial Sword Intent? It’s quite easy to learn, but to reach your level, I still need to cultivate further.”<br/><br/>Fang Wang asked curiously, “Are you skilled in the Sword Dao?”<br/><br/>Hong Xian’er shook her head and said, “I don’t like swords, but I can learn anything. After all, a Great Emperor should be all-powerful, how could he only focus on one path?”<br/><br/>Xu Qiuming fell silent.<br/><br/>Fang Wang’s eyes condensed, and he directly dispelled Hong Xian’er’s Celestial Sword Intent, causing her hair to flutter, her eyes widened, looking somewhat bewildered.<br/><br/>Xu Qiuming and Xiao Zi felt a huge relief.<br/><br/>Xu Qiuming looked at Hong Xian’er with a complex gaze.<br/><br/>Xiao Zi cursed, “What are you doing, trying to kill someone? I think you haven’t mastered it at all. The young master’s Celestial Sword Intent is at ease to control, but yours is hard to manage.”<br/><br/>Upon hearing this, Hong Xian’er didn’t get angry but instead felt it made sense. She turned to Fang Wang, blinked, and said, “Fang Wang, will you teach me Celestial Sword Intent later? I think I can incorporate the Celestial Sword Intent into my self-created cultivation technique.”<br/><br/>A self-created cultivation technique?<br/><br/>Xu Qiuming felt even worse.<br/><br/>Xiao Zi snorted, “What is a self-created cultivation technique? Does it compare with my young master’s Heavenly Dao Immensity Scripture? That is based on the Three Great True Cultivations of the Descending Dragon Great Saint, integrated with numerous supremely strong techniques!”<br/><br/>“What? Fang Wang, have you already achieved the Dao?” Hong Xian’er was shocked again.<br/><br/>Xu Qiuming clenched his fists within his sleeves.<br/><br/>Fang Wang replied with a modest smile, “Just a minor path, it’s nothing significant. If you both wish to learn, I can teach you.”<br/><br/>He would not starve his master by teaching his disciples; he would constantly strengthen his own techniques. Moreover, the Heavenly Dao Immensity Scripture was not something that could be learned in a few hundred or a thousand years.<br/><br/>“Then I want to learn!” Hong Xian’er declared unabashedly.<br/><br/>Xu Qiuming looked at Hong Xian’er with mixed feelings.<br/><br/>He realized that Hong Xian’er’s comprehension far surpassed his own, and her open-mindedness was greater. Hearing Fang Wang’s offer instinctively made him want to decline, but what about Hong Xian’er? She directly expressed her desire to learn.<br/><br/>This showed Hong Xian’er had the determination to seize every opportunity!<br/><br/>Just as Fang Wang was about to speak, he suddenly sensed something and turned his head toward the opposite side of the river.<br/><br/>On the opposite bank of the great river, a figure stood.<br/><br/>It was a man in a black robe with grey hair, but a youthful face. He stood there, exuding a domineering presence that made one feel pressured just by glancing at him.<br/><br/>“It’s him, the Night Monarch,” Hong Xian’er frowned.<br/><br/>Xiao Zi couldn’t help but ask, “Is he very strong?”<br/><br/>“Night Monarch, with the cultivation of the fifth level of the Sky-Stepping Realm, is a fellow disciple of my father Emperor. He was once my father Emperor’s formidable opponent. Although he can no longer catch up with my father Emperor, his strength is definitely great, and he is also a Sword Cultivator,” said Hong Xian’er with a furrowed brow and a solemn expression.<br/><br/>The Night Monarch on the opposite bank asked, “Are you Tian Dao Fang Wang?”<br/><br/>Fang Wang countered, “May I inquire what matter you have with me?”<br/><br/>“Your Sword Intent is strong, I need you to come and kill me,” the Night Monarch stated calmly.<br/><br/>Fang Wang frowned.<br/><br/>Xu Qiuming and Xiao Zi became alert as well, for the other’s words sounded more like a threat.<br/><br/>Hong Xian’er seemed to recall something and said in a low voice, “He is nearing his end, not many years left to live. These years, he has been seeking the strongest sword talent, claiming he wants to die at the hands of a remarkable junior and pass on his Sword Dao. But he has killed many sword geniuses, and he is still not dead.”<br/><br/>The Night Monarch spoke with a cold voice, “It’s because they were too weak to kill me, so naturally they were killed by me. Could it be that the renowned Tian Dao Fang Wang lacks confidence?”<br/><br/>Fang Wang narrowed his eyes and asked, “Does your excellency wish to die under the sword, or under the fist?”<br/><br/>He didn’t bother to ponder the motives of those seeking death.<br/><br/>In his view, seeking death was the easiest thing!<br/><br/>The Night Monarch answered, “Naturally, under the sword.”<br/><br/>Fang Wang raised his right hand, and the Rainbow Sword appeared in it out of thin air.<br/><br/>A gust of wind erupted, causing Hong Xian’er and Xu Qiuming to instinctively turn their heads to look behind them, their eyes widening in shock. They saw a towering ghostly figure coalescing behind them.\t\t\t\t\t\t</div>", "images": {}, "success": true}