{"id": 277, "url": "https://www.novelhall.com/i-became-an-immortal-on-mortal-realm-32879/14736003.html", "title": "Chapter 277 - Chapter 277: Chapter 274: The Human Emperor Passes Away, Eighteen Land Immortals", "volume": 3, "volume_title": "Volume 3", "body": "<h1>Chapter 277 - Chapter 277: Chapter 274: The Human Emperor Passes Away, Eighteen Land Immortals</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 277: Chapter 274: The Human Emperor Passes Away, Eighteen Land Immortals<br/><br/>After entering the city, Fang Wang practiced his cultivation daily, while Hong Xian’er couldn’t sit still, going out to gather intelligence every day.<br/><br/>A month later.<br/><br/>On this morning.<br/><br/>As Fang Wang sat cross-legged gathering Qi, floating in the middle of the hall, a sudden shout came from outside the window:<br/><br/>“The Heavens have abandoned our Grand Yu Divine Dynasty! The Emperor has passed away!”<br/><br/>Upon hearing this, Fang Wang immediately opened his eyes.<br/><br/>Hong Xian’er, who had been meditating on the bed, vanished into thin air and flashed onto the bustling streets, stopping a man in plain clothes who was shouting all over the place.<br/><br/>“Is it true?”<br/><br/>Hong Xian’er stared intently at the man in plain clothes, asking in a deep voice.<br/><br/>Blinded by Hong Xian’er’s beauty but meeting her gaze, the man’s heart pounded uncontrollably, a nameless panic enveloping him.<br/><br/>He hastily replied, “It’s true, the Crown Prince has already issued a decree, proclaiming it throughout the land!”<br/><br/>Hong Xian’er stood frozen, her hands tightly clenched into fists inside her sleeves.<br/><br/>Not just her, all the Cultivators passing by stopped in their tracks; even the shop owners on both sides of the street were stunned, and soon the whole street fell silent.<br/><br/>After a few moments, a wailing broke the silence.<br/><br/>Looking out the window, Fang Wang saw that it wasn’t Hong Xian’er who was crying, but a shopkeeper’s wife. Her cries triggered more crying; even men found their eyes reddening.<br/><br/>“How is this possible! The Emperor is unrivaled under the heavens, how could he have passed away?”<br/><br/>“Could it be that he exhausted his lifespan helping Fang Wang?”<br/><br/>“I think it’s the work of those Saint Clans, detestable…”<br/><br/>“He was Emperor Donggong, the one with the most hope in the Mortal Realm to become an Emperor, how could he die before achieving that…”<br/><br/>“It can’t be true, I don’t believe it, I’m going to the Imperial City now!”<br/><br/>The street fell into a noisy, uproarious state.<br/><br/>Fang Wang appeared out of nowhere beside Hong Xian’er, grabbed her by the shoulders, and brought her back inside the inn.<br/><br/>Hong Xian’er wasn’t crying, but her eyes were bloodshot; she tried hard to suppress her emotions.<br/><br/>She looked at Fang Wang and said, “Fang Wang, I need to go back and see my father for the last time. You don’t need to follow me, I’ll find you afterwards.”<br/><br/>After saying this, she disappeared inside the inn.<br/><br/>Xiao Zi flew to Fang Wang’s side and said anxiously, “There was no sign at all, the Immortal Gods’ methods are still so terrifying. Young master, don’t act recklessly, you’re indeed very powerful now, but you haven’t reached the point where you can contend with the Immortal Gods of The Upper Realm. If you catch the attention of the Immortal Gods, you will certainly be regarded with jealousy.”<br/><br/>Fang Wang looked out the window; his heart was far from as calm as he appeared.<br/><br/>In the past month, he hadn’t sensed any strong battle aura, meaning Emperor Donggong was killed by the Immortal Gods without anyone noticing.<br/><br/>If it had been an earth-shattering battle, he would have accepted it; at least he could get a hint of how strong the Immortal Gods truly were.<br/><br/>But now…<br/><br/>Fang Wang became even more wary of the Immortal Gods of The Upper Realm.<br/><br/>However, he thought of Emperor Donggong’s last instructions and could only sigh, saying, “Let’s go, to the Imperial City.”<br/><br/>The Formless Zhou Tian Technique and the Jiuyou Zizaishu were his trump cards. Zhou Xue had said that by mastering the Formless Zhou Tian Technique, one could avoid the probing of Immortal Gods. Even if spotted, one could always flee to the Underworld.<br/><br/>According to his current knowledge, the Netherworld should be independent from the Mortal Realm and The Upper Realm; otherwise, there wouldn’t be so many Great Saints and Great Emperors hiding there.<br/><br/>Hearing Fang Wang’s decision, Xiao Zi howled in distress, but it didn’t keep on persuading and followed Fang Wang obediently.<br/><br/>Fang Wang followed the trail of Hong Xian’er’s aura; she flew extremely fast and returned to the Imperial Palace in less than half a cup of tea’s time.<br/><br/>Fang Wang, who followed soon after, found a place to stay in the Imperial City.<br/><br/>The Imperial City hadn’t suffered any destruction, but most of the shops and inns were shut tight; the Cultivators and citizens on the streets burnt paper money and wailed, a sorrowful atmosphere enveloping the city.<br/><br/>Fang Wang stood by the window sill, looking at the Imperial Palace.<br/><br/>Emperor Donggong’s faithful servant Zhui Feng appeared beside Fang Wang, presenting a Jade Slip with both hands, saying, “This is a message the Emperor left for you.”<br/><br/>Fang Wang took the Jade Slip and probed it with his divine sense.<br/><br/>He quickly withdrew his divine sense and crushed the Jade Slip.<br/><br/>“Don’t worry, I’ll keep my promise,” said Fang Wang expressionlessly.<br/><br/>Zhui Feng nodded and was about to leave when Fang Wang suddenly glanced at him, asking, “Did the Emperor fall on his own, or was it foul play?”<br/><br/>The Jade Slip contained only Emperor Donggong’s last instructions to him. He learned that while he was creating the Nine Lives Precious Spirit, Emperor Donggong had used the fate of the Grand Yu Divine Dynasty to conceal the heavenly secrets, doing him a great favor.<br/><br/>This action kept the people of the world in the dark about his creation of the Nine Lives Precious Spirit and prevented the Immortal Gods in heaven from noticing his existence.<br/><br/>Such kindness made Fang Wang’s hostility towards the Immortal Gods of The Upper Realm even greater.<br/><br/>Zhui Feng hesitated for a moment before saying, “I’m not clear myself. The night before the Emperor passed, I saw him. The next morning, word got out that the Emperor passed. When I went to see him, his life essence was drained, as if…”<br/><br/>“Like what?”<br/><br/>“Like he had been dead for over a thousand years, his body already desiccated by the wind…”<br/><br/>As he spoke of this, a look of terror appeared on Zhui Feng’s face.<br/><br/>He knew all too well how powerful Emperor Donggong was, and for that exact reason, he held even greater fear for Cang.<br/><br/>Someone as formidable as Emperor Donggong had met such a grim death, and that too without any commotion.<br/><br/>Fang Wang remained silent.<br/><br/>Zhui Feng performed a salutation and quietly took his leave.<br/><br/>Fang Wang continued standing at the windowsill, gazing into the horizon, lost in thought.<br/><br/>At that moment, the jade bracelet on his hand transmitted a consciousness fluctuation. He immediately turned around, walked into the room, and then sent his consciousness into the jade bracelet.<br/><br/>Inside the Fang Residence Illusion Realm.<br/><br/>Fang Wang saw Zhou Xue again. After many years, her dignity and imposing manner had become even more pronounced. Her attire had also changed to become more domineering, with a red robe defined by black patterns tightly hugging her figure, simultaneously accentuating her physique and exerting an overwhelming presence.<br/><br/>Zhou Xue also picked up on the changes in Fang Wang. She touched her chin and exclaimed with amazement, “This feeling is very similar to that genius of the Nine Lives Precious Spirit, with an indescribable aura of spirit.”<br/><br/>Fang Wang asked, “Who exactly is that genius of the Nine Lives Precious Spirit, and why won’t you reveal his name?”<br/><br/>Zhou Xue smiled and said, “Because I also don’t know his former name. It was only when he shook the heavens with his fame at the age of five hundred that I learned his title. I only knew that he wasn’t much older than me, maybe by a few decades at most, so he could be considered my peer. He called himself Emperor Saint, embodying both the Great Emperor and Great Saint lineages. Although he had not achieved the status of Great Emperor or Great Saint before his ascension, he managed to do so afterward. He remains a dazzling prodigy in The Upper Realm, both a Great Saint and a Great Emperor.”<br/><br/>“And I don’t want to interfere with his growth for now.”<br/><br/>Fang Wang furrowed his brow.<br/><br/>Zhou Xue continued, “Emperor Donggong’s calamity indeed came ahead of time. A few days ago, I sensed the aura of The Upper Realm. Today, you are even closer to this lingering presence. I advise you not to approach Emperor Donggong’s corpse within the next year.”<br/><br/>Fang Wang looked at her and asked, “You can detect the aura of The Upper Realm?”<br/><br/>Zhou Xue nodded and huffed, “Don’t forget, in The Upper Realm, I am considered an Immortal Venerable. Although an Immortal Venerable isn’t all-powerful, the domain I rule over far surpasses your imagination.”<br/><br/>Fang Wang described Emperor Donggong’s death and inquired how the Immortal Gods of The Upper Realm could have done it.<br/><br/>Zhou Xue fell silent for a moment before saying, “It should be some kind of fate-manipulating technique. However, it would be difficult for Immortal Gods to kill Emperor Donggong without descending. I suspect Emperor Donggong did not resist, using it to lull the Immortal Gods of The Upper Realm into thinking that the Mortal Realm still fears them.”<br/><br/>Fang Wang narrowed his eyes and asked, “Are you saying there’s a significant information gap between the Mortal Realm and The Upper Realm?”<br/><br/>Information gap?<br/><br/>Zhou Xue found the term novel and pondered over it before replying, “Of course, The Upper Realm can hardly directly observe the Mortal Realm. Only those supremely powerful beings who find it inconvenient to descend when they sense anomalies in the Mortal Realm would dispatch Immortal Gods to descend. The distance between the Mortal Realm and The Upper Realm is far beyond your imagination. Speaking of which, we owe it to the Supreme Saint from the history of the Mortal Realm. It was his fate that isolated the Mortal Realm from The Upper Realm, leaving a sliver of hope for the Mortal Realm.”<br/><br/>Looking at Fang Wang with suspicion, Zhou Xue scrutinized him carefully.<br/><br/>Fang Wang, puzzled, asked, “What’s wrong?”<br/><br/>“I always feel that your memory isn’t that good. We’ve had conversations like this before.”<br/><br/>Zhou Xue stated calmly, gazing at Fang Wang.<br/><br/>Fang Wang sensed something was amiss, offered a few casual explanations, and then took his leave from Zhou Xue.<br/><br/>Before parting, Zhou Xue reminded him, “The calamity of the Grand Yu Divine Dynasty is fast approaching. Act according to your abilities. I have already asked the Hongxuan Emperor to come and support you.”<br/><br/>Fang Wang frowned and said, “What’s the use of bringing him here? Do you really expect him to save me?”<br/><br/>Zhou Xue explained, “After all, he is a Great Emperor and can guide the next sovereign of the Grand Yu Divine Dynasty to reverse the situation, allowing you to disengage sooner.”<br/><br/>After thinking it over, Fang Wang nodded in agreement.<br/><br/>He really knew nothing about governing a nation and the Imperial Dao.<br/><br/>The news of Emperor Donggong’s demise spread quickly, plunging the entire Human Emperor Continent into sorrow. In less than half a month, the Grand Yu Divine Dynasty grew tense.<br/><br/>The Crown Prince should have succeeded the throne, but several princes and ministers united to prevent it. Suddenly, the Imperial City became a place of shifting alliances, with large numbers of Cultivators coming and going every day.<br/><br/>Fang Wang did not attend Emperor Donggong’s funeral, but he remained in the Imperial City and had met with Hong Xian’er during that time.<br/><br/>Hong Xian’er was grateful that Fang Wang had come to the Imperial City because she knew she had been capricious and should not have returned so early.<br/><br/>Another month passed.<br/><br/>Hong Xian’er came to find Fang Wang at the inn where he was staying and said, “I need you to do me a favor.”<br/><br/>Fang Wang looked at her and asked, “What do you need?”<br/><br/>“My fourth brother is leading his army to the Imperial City. The throne remains unsettled because his power is too great. Before our father died, he clearly promised to support my elder brother, but now he has gone back on his word. I want you to stop him, prevent him from entering the city, and ideally make him bow his head,” Hong Xian’er said earnestly.<br/><br/>She then produced a golden Token with the character ‘Dong’ inscribed on it, edged with dragon patterns.<br/><br/>“This is my father’s Token, which was originally given to me. Now I am giving it to you. You can pretend it is a decree from my father before his death to suppress them. Aside from controlling a large army, my fourth brother also has the support of the Taiqing Xuanjiao. I heard that two of the eighteen Land Immortals are accompanying him, and even the weakest of the eighteen Land Immortals is of the Sky-Stepping Realm. This is why I am asking for your help. If my elder brother takes action, the Grand Yu Divine Dynasty will undoubtedly fall into civil strife. And those old monsters of the dynasty are wavering and have decided not to take action. I really don’t know what kind of bewitchment my fourth brother has used; they don’t even listen to the decree from when my father was alive.”<br/><br/>After speaking, Hong Xian’er was somewhat nervous, worried that Fang Wang would find it difficult to comply.<br/><br/>Fang Wang accepted the imperial Token into the Dragon Jade Ring and said softly, “I will let the world know that although the Grand Yu Divine Dynasty no longer has Emperor Donggong at the helm, it has the protection of Heavenly Dao.”<br/><br/>“The eighteen Land Immortals? Let them witness the true stature of Immortal Gods!”\t\t\t\t\t\t</div>", "images": {}, "success": true}