{"id": 276, "url": "https://www.novelhall.com/i-became-an-immortal-on-mortal-realm-32879/14680663.html", "title": "Chapter 276 - Chapter 276: Chapter 273: Tianling Body, A Glimpse From The Upper Realm", "volume": 3, "volume_title": "Volume 3", "body": "<h1>Chapter 276 - Chapter 276: Chapter 273: Tianling Body, A Glimpse From The Upper Realm</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 276: Chapter 273: Tianling Body, A Glimpse from the Upper Realm<br/><br/>Translator: 549690339<br/><br/>Inside the tower, Fang Wang stood examining the dark golden chainmail that adorned his body, as the fiery yang energy blazed upon his armor. The dragon horns of the Heavenly Dao Imperial Dragon Crown spilled forth streams of qi that flickered slightly, making him, amidst the flames, appear akin to a devil emerging from Jiu You, exuding an oppressive aura.<br/><br/>At that moment, Fang Wang’s physique was undergoing a transformation.<br/><br/>The nature’s spiritual energy rushed crazily into his body, reshaping his muscles and flesh.<br/><br/>His other seven Lifespirit Treasures involuntarily condensed and appeared around him, forming a large circle.<br/><br/>The Heavenly Palace Halberd, Rainbow Sword, Qiankun Fan, Reincarnation Bell, The Six Harmonies and Eight Desolations Seal, Heaven Bound Golden Silk, Town World Bead!<br/><br/>And the Heavenly Dao Imperial Dragon Crown atop his head!<br/><br/>During the process of sculpting, Fang Wang found that his perception of the other treasures had become increasingly clear and that he had even established a closer connection with them.<br/><br/>He was immersed in these wonderful changes, unable to extricate himself.<br/><br/>All the onlookers outside gazed at the figure within the golden column of light, growing more and more reverent with each look.<br/><br/>This reverence stemmed from the unknown and the imposing aura of that figure.<br/><br/>The more Hong Xian’er watched, the more she felt that shadowy figure was Fang Wang.<br/><br/>She secretly wondered, Wasn’t he undergoing Spiritual Refinement? How come it seemed as if he was cultivating some sort of divine skill?<br/><br/>Time continued to pass.<br/><br/>More than half a day’s time had gone by.<br/><br/>The torrential downpour over the Human Emperor Continent continued, and the golden column of light above the Spirit Sculpting Tower began to dissipate, with the mysterious silhouette within vanishing from sight.<br/><br/>Inside the tower, the qi flames on Fang Wang’s body were dissipating, and a smile spread across his face.<br/><br/>The ninth Lifespirit Treasure, Tianling Body!<br/><br/>The Tianling Body would allow Fang Wang to possess the special abilities of all his Lifespirit Treasures. That is to say, even without condensing his Lifespirit Treasures, he could still wield their powers. Moreover, from now on, his physical body could switch into the state of his Lifespirit Treasures. In some specific situations, this trait might save his life.<br/><br/>This round of Spiritual Refinement had significantly increased Fang Wang’s cultivation level, saving him two to three years of arduous practice.<br/><br/>With a smile tugging at the corner of his mouth, Fang Wang stepped away.<br/><br/>It wasn’t long before he reached the first floor of the tower and pushed open the great doors.<br/><br/>There was no sunlight in the sky, the firmament was misty, and although formations isolated it, the sound of the downpour hitting the formations was particularly loud.<br/><br/>Fang Wang, dressed in white, looked up. He seemed unchanged.<br/><br/>Hong Xian’er and Xiao Zi quickly flew over and landed in front of him.<br/><br/>“Fang Wang, have you achieved the Nine Lives Precious Spirit?” Hong Xian’er asked curiously.<br/><br/>Far across the lake, Guang Mengwang was watching him from a distance. As for the other cultivators, they did not dare to disturb Fang Wang, they could only watch him from afar, trying to remember his true face.<br/><br/>Fang Wang nodded, making no attempt to hide the truth.<br/><br/>Hong Xian’er clicked her tongue in wonder, her eyes filled with envy as she looked at him.<br/><br/>Xiao Zi, on the other hand, lifted its Dragon Head proudly, as if it was the one who had achieved the Nine Lives Precious Spirit.<br/><br/>“Let’s go. After thanking your royal brother, we shall return to our previous cultivation spot,” Fang Wang said, and Hong Xian’er naturally had no objections.<br/><br/>She was very curious about Fang Wang’s nine Lifespirit Treasures but knew they could not be displayed here.<br/><br/>Afterward, they flew towards Guang Mengwang.<br/><br/>Facing Fang Wang, Guang Mengwang was very enthusiastic, hosting them until deep into the night before Fang Wang, Hong Xian’er, and Xiao Zi could finally take their leave.<br/><br/>Under the night sky, above the mountain forests.<br/><br/>Whoosh! Whoosh! Whoosh!<br/><br/>Hong Xian’er and Xiao Zi flew swiftly, kicking up leaves along the way, while Fang Wang followed behind them.<br/><br/>Different from Hong Xian’er’s forward-leaning flying posture, Fang Wang remained upright from beginning to end. At first glance, it didn’t seem like he was flying, but repeatedly blinking through the air as if teleporting.<br/><br/>As Fang Wang moved forward, he savored the marvels of the Tianling Body.<br/><br/>He let his physical body turn into Lifespirit Treasure, making his speed faster and his body lighter.<br/><br/>The downpour continued, yet not a single raindrop could touch him.<br/><br/>Fang Wang knew that the deluge was due to him, which puzzled him as this natural phenomenon persisted longer than those extraordinary skills, and he found it somewhat exaggerated.<br/><br/>After all, in his view, the Nine Lives Precious Spirit did not give him a qualitative leap.<br/><br/>He experienced a seven-day and seven-night downpour when he was born, and now another seven days and nights, leading him to question himself.<br/><br/>Was it because he came from Earth and his soul was not accepted by nature, or because of the Heavenly Palace?<br/><br/>Boom, boom, boom—<br/><br/>The continuous thunder from the clouds above made the rain-drenched forest feel oppressive and thrilling.<br/><br/>Fang Wang suddenly sensed something and flashed beside Xiao Zi, drawing it into his right hand with Sky Capturing Palm, then appeared beside Hong Xian’er, grabbing her shoulder with his left hand.<br/><br/>The next second, they appeared in the forest, their figures concealed by the dense foliage.<br/><br/>Xiao Zi turned to ask, “Master, what’s wrong?”<br/><br/>Hong Xian’er also looked towards Fang Wang, but her eyes were filled with disbelief.<br/><br/>So fast!<br/><br/>And she couldn’t even resist.<br/><br/>Hong Xian’er had sparred with Fang Wang before and was somewhat aware of Fang Wang’s strength, but he had never been as unfathomable as he was now.<br/><br/>Suppressed by Fang Wang’s Spiritual Power, the Spiritual Energy within her froze. It was the first time she had ever felt such a thing.<br/><br/>Fang Wang spoke softly, “Don’t speak. Pretend you don’t know I’m beside you and chat casually, not mentioning my name or anything about me.”<br/><br/>Having said that, Fang Wang released his hands, and both Hong Xian’er and Xiao Zi immediately realized that something was amiss.<br/><br/>“Your royal brother is really something, making a fuss like a mortal, insisting on drinking for so long, look now, we’re delayed,” Xiao Zi immediately spoke with dissatisfaction in her voice.<br/><br/>Hong Xian’er walked to one side and sat down cross-legged, harrumphing, “Hmph, why didn’t you say anything at that time, afraid of offending him?”<br/><br/>Xiao Zi moved to the tree beside her, continuing to complain to Hong Xian’er about Guang Mengwang.<br/><br/>Under the night sky, thunder roared intermittently, as if Heavenly Dao itself were growling; the mountain forest in the storm swayed with the wind, but Hong Xian’er and Xiao Zi, using their own Spiritual Power, withstood the wind and rain, unaffected.<br/><br/>Fang Wang leaned against the tree trunk, his gaze directed towards the night sky.<br/><br/>Hong Xian’er and Xiao Zi pretended to chat while also looking up at the night sky.<br/><br/>The branches shook violently, along with the leaves, obstructing their view, but fortunately, they could see through the hindrance with their divine senses.<br/><br/>The storm clouds in the night sky churned fiercely, Heavenly Might was vast and oppressive, but that was it.<br/><br/>Hong Xian’er and Xiao Zi did not spot the enemy, puzzled in their hearts, yet they dared not ask.<br/><br/>An enemy that could make Fang Wang this tense was certainly terrifying.<br/><br/>Fang Wang stared intently at the night sky, his sword-like brows deeply furrowed.<br/><br/>Following his gaze, the thunder clouds above tumbled incessantly, and gradually, the moon appeared, now and then obscured.<br/><br/>Suddenly!<br/><br/>The expressions on the faces of Hong Xian’er and Xiao Zi changed drastically, Fang Wang immediately sent a message to them, “Withdraw your gaze, pretend you haven’t seen anything.”<br/><br/>Hearing this, they quickly looked away, continuing their feigned conversation.<br/><br/>Behind the thunder clouds, within the moon, an eye appeared, not occupying the entire moon, only one-tenth of its size, but even so, it was enough to send shivers down one’s spine.<br/><br/>This eye was surveilling the land below, its gaze calm, without any flicker of emotion.<br/><br/>Fang Wang did not use his divine sense, he moved his feet slightly, using the forest to shield himself.<br/><br/>Earlier, he had felt a faint divine sense sweep over him; although it was very weak, when it brushed past him, he experienced an intense sense of unease like never before, startling him into hiding at once.<br/><br/>“Such divine sense… such a technique, could it be The Upper Realm?”<br/><br/>Fang Wang was inwardly shocked; he was unsure whether the gaze from The Upper Realm was attracted by his anomaly with heaven and earth, or if it was meant for Emperor Donggong.<br/><br/>While chatting with Xiao Zi, Hong Xian’er’s gaze also turned towards Fang Wang, her beautiful eyes filled with worry.<br/><br/>She too thought of The Upper Realm.<br/><br/>Although Emperor Donggong had not specifically spoken to her about his impending calamity, who in the world today could slay her father?<br/><br/>Only Immortal Gods from The Upper Realm!<br/><br/>The Upper Realm had always been wary of Immortal Gods, and the Divine Dynasty’s emperors and Great Saints. Her father’s aspiration to become a Great Emperor would naturally draw attention.<br/><br/>If that truly was the eye of The Upper Realm, then it meant her father’s calamity was imminent.<br/><br/>Fang Wang couldn’t comfort her because he was still unclear about the situation.<br/><br/>Even if Immortal Gods from The Upper Realm intended to deal with Emperor Donggong, he was powerless to intervene; his strength was still too weak.<br/><br/>The eye in the moon surveyed for a long time, for the duration of an incense stick burning; and as a cloud moved across the moon, the eye vanished without a trace.<br/><br/>Fang Wang breathed a sigh of relief internally; when the mysterious eye disappeared, his discomfort immediately vanished.<br/><br/>The forest fell into silence; Hong Xian’er and Xiao Zi closed their eyes, pretending to be tired from the chat, but in reality, they were both trying to contain their inner fear.<br/><br/>An hour later.<br/><br/>It was only then that Fang Wang spoke, “All right, you can relax now.”<br/><br/>Upon hearing this, Hong Xian’er was the first to open her eyes, asking, “Fang Wang, do you think it’s the moment of calamity for my father? Should I go back and warn him?”<br/><br/>Fang Wang replied, “If it truly is his calamity, he will certainly foresee it much sooner than either of us. Moreover, you’ve known about this for quite some time now; if you go back now, you would be failing to honor your father’s wishes. Instead of rescuing your father, you should be more concerned about how to preserve the Grand Yu Divine Dynasty afterwards.”<br/><br/>Hong Xian’er fell silent.<br/><br/>Xiao Zi then nervously asked, “Young Master, if it truly was an Immortal God descending from The Upper Realm, we can’t stay in the Human Emperor Continent.”<br/><br/>It had once been a princess of the True Dragon Clan and had witnessed the scene of an Immortal God suppressing the Descending Dragon Great Saint, and with it, all beings of the Descending Dragon Continent were buried.<br/><br/>Fang Wang recalled what Zhou Xue had said: only after Emperor Donggong’s fall would the Grand Yu Divine Dynasty face its downfall, suggesting that The Upper Realm’s eradication of Emperor Donggong was not done by descending to the Mortal Realm in person.<br/><br/>This made sense, since Emperor Donggong wasn’t a true Great Emperor, surely the Immortal Gods had numerous ways to destroy him.<br/><br/>“We won’t go to the cultivation site next. Let’s find a large city to settle down in and keep abreast of worldly affairs,” Fang Wang said.<br/><br/>He might not be able to contend with Immortal Gods from The Upper Realm, but he could deal with other sects in the Mortal Realm.<br/><br/>Emperor Donggong had treated him so generously; he must ensure the survival of the Grand Yu Divine Dynasty!<br/><br/>Hong Xian’er took a deep breath and nodded slightly. Following his gaze, she looked down, her mood somber.<br/><br/>The next morning, Fang Wang and Hong Xian’er appeared within a city; the two checked into an inn, sharing the same room.<br/><br/>After closing the door, Xiao Zi finally emerged from Fang Wang’s sleeve, growing in size as it did.<br/><br/>Fang Wang sat cross-legged in the hall, he levitated, starting his cultivation.<br/><br/>This city was ranked high within the Grand Yu Divine Dynasty, and the Cultivation atmosphere was exceptionally strong; every room in this inn was equipped with its own Spiritual Energy Gathering Formation and isolation enchantments.<br/><br/>Meanwhile, Hong Xian’er walked to the windowsill, looking out at the bustling street scene, her eyes dim.<br/><br/>Xiao Zi, unusually quiet, floated to Hong Xian’er’s side, silently keeping her company without making a sound.<br/><br/>It too had experienced such sorrow and could empathize with Hong Xian’er’s feelings.\t\t\t\t\t\t</div>", "images": {}, "success": true}