{"id": 271, "url": "https://www.novelhall.com/i-became-an-immortal-on-mortal-realm-32879/14586262.html", "title": "Chapter 271 - Chapter 271: Chapter 268: Tai You, The So-Called Calamity", "volume": 3, "volume_title": "Volume 3", "body": "<h1>Chapter 271 - Chapter 271: Chapter 268: Tai You, The So-Called Calamity</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 271: Chapter 268: Tai You, the So-Called Calamity<br/><br/>Translator: 549690339<br/><br/>As his cultivation grew stronger and his age increased, Fang Wang became increasingly aware of the influence of the Hongxuan Emperor’s fate.<br/><br/>Over the years, he encountered more and more chances, and although it was related to his fame, fate also influenced destiny in subtle ways.<br/><br/>The Sword Intent of the Night Monarch had doubled Fang Wang’s own Sword Intent—after all, the Night Monarch was a Great Cultivator of the Sky-Stepping Realm, and even in his twilight years, his Sword Intent remained vast and powerful.<br/><br/>Fang Wang stood on the bridge, staring at the scenery of the Underworld, lost in thought.<br/><br/>His gaze gradually shifted upward, to watch the shadow of an old woman meditating by the stream in the Underworld. She was dressed in a wide and tattered grey robe. Two bamboo sticks held her white hair up behind her head. Her back was hunched, and she appeared aged and decrepit.<br/><br/>Fang Wang could not gauge her strength, for the realms of Yin and Yang separated them—he could peer into the Underworld, but he remained in the Mortal Realm.<br/><br/>Hong Xian’er found his behavior strange but didn’t think much of it. She walked off the wooden bridge toward the stream.<br/><br/>Fang Wang’s expression changed when he saw Hong Xian’er walking toward the position of the old woman. He subconsciously wanted to warn her, but he thought it would be too odd to do so directly since the realms of Yin and Yang were separated.<br/><br/>As Hong Xian’er drew closer to the old woman, Fang Wang had no choice but to speak up, “Hong Xian’er.”<br/><br/>Hong Xian’er stopped in her tracks, turned to look at him, her face filled with confusion.<br/><br/>The mountain breeze blew, fluttering her dress and the locks of hair by her ears. She was so beautiful, merging with the world around her into a single picture. But in Fang Wang’s eyes, she was at risk of being devoured by this world any moment, which made her seem less beautiful.<br/><br/>“What is it?” Hong Xian’er asked, her cheeks puffing up with annoyance. She had told Fang Wang time and time again to call her Xian’er instead of Miss Hong, Seventh Princess, or Hong Xian’er; other names felt too distant. Despite this, Fang Wang still insisted on irritating her.<br/><br/>Fang Wang pointed across the stream with a smile and said, “You look even more beautiful from this angle. Stand here.”<br/><br/>At his words, Hong Xian’er blushed and exclaimed in wonder, “I didn’t expect such sweet talk from someone with a wooden head like you?”<br/><br/>While her words were ironic, she faithfully leaped to the opposite side of the stream.<br/><br/>Fang Wang shook his head with a smile, “Back in the day in Southern Hills City, I was nicknamed Fang Xunhuan. How could I be wooden-headed”<br/><br/>Hong Xian’er glowered and huffed, “As I thought, no good comes from men!”<br/><br/>Fang Wang couldn’t help but laugh. He found it amusing how women from any world seemed to love saying that.<br/><br/>“Hey, Fang Wang, when are you going to spar with me?” Hong Xian’er asked while still meditating. Over the last two years, many had come to challenge Fang Wang, making her itch for a fight. She was competitive by nature, otherwise, she wouldn’t have achieved her current level.<br/><br/>Fang Wang replied, “Once you have integrated the Celestial Sword Intent with your Dao, then we can spar.”<br/><br/>His gaze returned to the old woman across the stream in the Underworld.<br/><br/>Coincidentally, Hong Xian’er’s position was directly facing the old woman.<br/><br/>The old woman was now looking directly at him. Her aged face, like tree bark, opened her murky eyes and stared intently at him.<br/><br/>Even battle-hardened Fang Wang felt a chill in his heart from her gaze.<br/><br/>Fortunately, being separated by Yin and Yang, Fang Wang remained calm. He didn’t believe she could directly cross the barrier between realms to trouble him—a feat even the Ghost Emperor couldn’t achieve.<br/><br/>When Hong Xian’er saw Fang Wang’s gaze shift away, she pursed her lips and continued to ponder the Celestial Sword Intent.<br/><br/>Fang Wang fearlessly locked eyes with the Underworld’s old woman.<br/><br/>Suddenly, the old woman opened her mouth. Though no sound could carry to the Mortal Realm, Fang Wang could read her lips.<br/><br/>“Do you wish to intervene with destiny”<br/><br/>Fang Wang narrowed his eyes and responded with his own mouth shape, “Whose destiny, and what kind of destiny?”<br/><br/>The old woman raised her right hand, tremblingly pointing across the stream. Her gaze never strayed from Hong Xian’er as she said, “Her destiny. She should not have Emperor’s destiny. She should die. If she can contribute to this Great Saint before death, it would not be in vain.”<br/><br/>Great Saint?<br/><br/>Fang Wang moved his mouth again, “May I ask, which Great Saint are you?”<br/><br/>He was starting to understand—the old woman was targeting Hong Xian’er.<br/><br/>He remembered Zhou Xue’s words, that Hong Xian’er would almost reach the Great Emperor Realm in over a hundred years, yet, after one battle, she would vanish into ashes.<br/><br/>He had thought that Hong Xian’er had pushed herself to the limit of her talents by draining her vitality. Now, it seemed there might be other forces at work.<br/><br/>Such as this mysterious Great Saint.<br/><br/>The old woman stared at Fang Wang and uttered two words, “Tai You.”<br/><br/>Tai You?<br/><br/>Fang Wang had never heard this name before. He followed up, “Senior, how can she be spared?”<br/><br/>Tai You slowly stood up, and Fang Wang watched as Hong Xian’er’s Primordial Spirit did the same, raising her hand towards the lake and mobilizing the Celestial Sword Intent.<br/><br/>She seemed to be cultivating, but to Fang Wang, she appeared like a puppet on strings controlled by Tai You—this scene was unsettling.<br/><br/>Tai You’s right hand made a slight gesture, and Hong Xian’er mimicked the motion.<br/><br/>Through it all, Tai You’s gaze remained fixed on Fang Wang, as if threatening him.<br/><br/>Fang Wang’s brow furrowed, a cold light flashing in his eyes.<br/><br/>He had promised Emperor Donggong to protect Hong Xian’er. How could he break his promise<br/><br/>Then Tai You’s mouth moved again, “You cannot save her. Someone intends to bestow half of the Emperor’s fate upon her, which will bring her calamity. The process has already begun; you cannot stop it. It’s better for her to be of use to this Great Saint rather than dying to fate. Should this Great Saint be resurrected one day, I may grant you an opportunity.”<br/><br/>Seeing this, Fang Wang disappeared on the spot and appeared before Hong Xian’er.<br/><br/>He patted Hong Xian’er’s head lightly, and her Primordial Spirit returned to her body. She looked up and asked, “What’s wrong?”<br/><br/>Fang Wang asked, “Did you feel any discomfort just now?”<br/><br/>Hong Xian’er frowned and said, “No, what’s wrong with you? You’ve been acting strange since just now.”<br/><br/>Not far away, Xu Qiuming appeared uneasy.<br/><br/>If he wasn’t hallucinating, just now Fang Wang seemed to have been speaking to an empty space, as if he was saying something.<br/><br/>Xiao Zi was still in the sky, unaware of what was happening on the ground.<br/><br/>Fang Wang calmly said, “It’s nothing, I just saw a Great Saint. She said you have a predestined fate, and someone wants to pass on half of a Great Emperor’s mandate to you, which instead will bring you a catastrophe.”<br/><br/>In the Underworld, Tai You couldn’t help but frown, not expecting Fang Wang to directly convey her message.<br/><br/>Upon hearing this, Hong Xian’er’s face drastically changed.<br/><br/>Xu Qiuming was also scared. A Great Saint?<br/><br/>He wouldn’t question Fang Wang’s words and immediately began to look around vigilantly.<br/><br/>The havoc the Thousand Eyes Great Saint brought upon the Descending Dragon Continent had left him with a poor impression of Great Saints, making him wary of them.<br/><br/>Hong Xian’er was initially skeptical upon hearing the first half of Fang Wang’s statement, but upon hearing the latter half, her heart surged with shock.<br/><br/>Half of a Great Emperor’s mandate!<br/><br/>Her father had mentioned such a thing to her!<br/><br/>Hong Xian’er nervously asked, “Where is this Great Saint?”<br/><br/>Fang Wang replied, “In the Underworld, right in front of you, where you were about to sit just now.”<br/><br/>As he spoke, Fang Wang raised his hand and pointed in Tai You’s direction.<br/><br/>Under the broad daylight, Hong Xian’er and Xu Qiuming looked across the stream, where there was nothing but a meadow. There was no sign of a Great Saint, not even an insect could be seen.<br/><br/>Both felt an eerie chill creeping up from their feet, rushing straight to the crown of their heads.<br/><br/>The most terrifying thing is the unknown, especially when the unknown is a Great Saint!<br/><br/>Hong Xian’er, subconsciously standing up, moved closer to Fang Wang, her gaze fixed intently across the stream.<br/><br/>At that moment, Tai You also stood up. She looked at Fang Wang and said, “Junior, you won’t be able to protect her, be careful not to die by her hand.”<br/><br/>After speaking, Tai You turned around, walked into the depths of the forest, and soon vanished without a trace, as if she had never been there.<br/><br/>“Fang Wang, what should I do?” Hong Xian’er bit her lip and asked in a low voice.<br/><br/>She was almost clinging to Fang Wang’s chest.<br/><br/>Fang Wang didn’t hug her as expected but instead looked in the direction where Tai You had left, saying, “You only have a little over a hundred years. I’ll pass on a cultivation technique to you. If you can master it, you might break free from fate.”<br/><br/>He surmised that the so-called half of a Great Emperor’s mandate came from Emperor Donggong, who, before falling, gave his own fate and cultivation to Hong Xian’er, thinking it would help her. Little did he know that Immortal Gods from The Upper Realm and Great Saints from the Underworld could track fate and thus scheme against Hong Xian’er.<br/><br/>If that were the case, as long as Hong Xian’er mastered the Formless Zhou Tian Technique, she could avoid these predictions and schemes involving fate.<br/><br/>Mastering the Formless Zhou Tian Technique in a hundred years seemed virtually impossible to Fang Wang,<br/><br/>but when he thought about how Hong Xian’er had grasped the Celestial Sword Intent overnight, he felt there was hope.<br/><br/>Although it took Fang Wang nine thousand eight hundred years to cultivate the Formless Zhou Tian Technique, in reality, it was just a moment in time.<br/><br/>Even if Hong Xian’er couldn’t master the Formless Zhou Tian Technique within a hundred years, Fang Wang believed that he might be able to help her deal with those destined enemies after a hundred years, as long as she wasn’t in a hopeless situation. There would be no need to step half a foot into the Great Emperor Realm.<br/><br/>“Then I must learn it!” Hong Xian’er immediately responded.<br/><br/>She didn’t ask what the technique was; she trusted that Fang Wang wouldn’t harm her.<br/><br/>This trust came not only from the two years they spent together but also because she believed in her father’s arrangements.<br/><br/>Fang Wang turned around, leaving behind a statement, “Let’s go. Find a place to cultivate, to avoid those challengers. We’ll start a closed-door cultivation.”<br/><br/>“Why not go back to the Imperial Palace to cultivate?” Hong Xian’er asked with surprise.<br/><br/>“The calamity of your father is not something you and I can intervene. Why do you think your father wanted you to follow me?”<br/><br/>Fang Wang’s words left Hong Xian’er silent, hastening to keep up with his pace.<br/><br/>Xu Qiuming quickened his steps to catch up.<br/><br/>Fang Wang decided, after imparting the Formless Zhou Tian Technique to Hong Xian’er, to begin his attempt to break through to the Heaven-Breaking Realm.<br/><br/>Having encountered another Great Saint, who knows what he would face next; he needed to become stronger as quickly as possible, and not wallow in his current strength.<br/><br/>Indeed, he was powerful now, but not yet powerful enough to be fearless against any entity.<br/><br/>Xiao Zi quickly flew down and landed on Fang Wang’s shoulder, whispering, “Master, was there something on the ground just now? I heard someone speaking to me.”<br/><br/>As he moved forward, Fang Wang asked, “What did she say to you?”<br/><br/>“She said that my tribulation is near, which made me so angry I wanted to curse her, but I didn’t know where she was,” Xiao Zi said in frustration.<br/><br/>Another tribulation?<br/><br/>Fang Wang’s eyes turned cold, thinking that it was not fate but certain entities scheming against him when his companions kept encountering tribulations.<br/><br/>Being someone who had mastered the Formless Zhou Tian Technique and couldn’t be traced by divination or captured with divine sense, the only option left was to scheme against the people around him, to trap him.<br/><br/>Speaking of the Formless Zhou Tian Technique, logically, Tai You shouldn’t have been able to track him with divine sense. So, did she see him with her eyes a moment ago?<br/><br/>What kind of eyes could see across the boundaries of life and death?<br/><br/>The Yin Yang Xuan Ming Zhen Gong?\t\t\t\t\t\t</div>", "images": {}, "success": true}