{"id": 272, "url": "https://www.novelhall.com/i-became-an-immortal-on-mortal-realm-32879/14586263.html", "title": "Chapter 272 - Chapter 272: Chapter 269: Xu Chonggua, Heavenly Earth Slaying Immortals Sword Great Perfection", "volume": 3, "volume_title": "Volume 3", "body": "<h1>Chapter 272 - Chapter 272: Chapter 269: Xu Chonggua, Heavenly Earth Slaying Immortals Sword Great Perfection</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 272: Chapter 269: Xu Chonggua, Heavenly Earth Slaying Immortals Sword Great Perfection<br/><br/>Translator: 549690339<br/><br/>“What kind of remarkable technique is this, so difficult to practice? Compared to it, the Celestial Sword Intent is nothing more than a child’s babble…”<br/><br/>Above the sea of clouds, mountain peaks emerged, one after another, and on the top of one of these mountains stood Hong Xian’er in a yellow dress, by Fang Wang’s side, wailing incessantly.<br/><br/>She even held her face with both hands in an exaggerated posture.<br/><br/>Fang Wang was sitting in meditation at the edge of a cliff, his black hair floating slightly, eyes closed, listening to Hong Xian’er’s complaints.<br/><br/>“A whole ten years, a full decade, do you have any idea how I’ve endured these years? You’ve already broken through to the Heaven-Breaking Realm, while I haven’t even entered the path; is there something wrong with this cultivation technique?”<br/><br/>Hong Xian’er squatted next to Fang Wang, speaking in a dejected tone.<br/><br/>From childhood, she had been a prodigy, bathed in the glow of adoration, able to easily master any cultivation technique, but these ten years posed a wall she could not climb.<br/><br/>Really, no matter how she practiced, it just didn’t work!<br/><br/>She clearly had the mental method, had the experience taught by Fang Wang, and yet, it didn’t work. She began to doubt herself; perhaps she was not a true genius?<br/><br/>This thought had been plaguing her heart for years, impossible to dispel.<br/><br/>Without opening his eyes, Fang Wang said, “If you can’t learn it, when your calamity descends in over a hundred years, then you will have no escape from disaster.”<br/><br/>Although he was prepared to save Hong Xian’er, he still wanted to push her.<br/><br/>After all, she was the most talented cultivator in the past hundred thousand years.<br/><br/>“But it’s really hard!” pouted Hong Xian’er, feeling very aggrieved.<br/><br/>At that moment, Xiao Zi poked her Dragon Head out from among the sea of clouds, imposing as a mountaintop, colossal and majestic. Her whiskers fluttered, and her dragon eyes, full of life, stared intently at Hong Xian’er, saying, “If one cannot break through their own limits, what kind of genius are they? They are nothing but waste living off the conditions bestowed by their parents!”<br/><br/>Upon hearing this, Hong Xian’er grew furious and cursed, “You stinking dragon, just you wait, I will definitely learn it!”<br/><br/>With that, she turned and walked aside, continuing to cultivate the Formless Zhou Tian Technique.<br/><br/>Meanwhile, Fang Wang continued to consolidate his cultivation.<br/><br/>Last year, he had broken through to the first layer of the Heaven-Breaking Realm and had smoothly advanced by leveraging the Heavenly Dao Immensity Scripture without needing to overcome tribulation.<br/><br/>The Heaven-Breaking Realm did not make him complacent; after all, his adversaries had already appeared in the Divine Passage Realm and the Sky-Stepping Realm, and he had even heard from Hong Xian’er of the existence of the True Soul Realm.<br/><br/>Although Hong Xian’er had said the dragons of the True Soul Realm were elusive, appearing only occasionally and were old undying monsters, past experiences told him that as soon as he heard the name of a realm, it would not be long before he encountered it.<br/><br/>The matters concerning the Seven Clans were settled, and next, Fang Wang only wanted to focus on cultivation in peace.<br/><br/>The spiritual energy of the Grand Yu Divine Dynasty far exceeded that of the Descending Dragon Continent, making it an excellent place for cultivation. He could contact Zhou Xue, who had already dispatched Fang Family disciples to assist with the affairs of Kunlun, so it was fine even if he did not return.<br/><br/>With Xiao Zi and Hong Xian’er as his companions in cultivation, life was far from dull.<br/><br/>It’s worth mentioning that Xu Qiuming had left ten years ago.<br/><br/>He had said he needed to continue searching for Sword Dao opportunities and couldn’t always rely on what Fang Wang taught; he wanted to carve out his own path.<br/><br/>Xu Qiuming had headed west, and Fang Wang suspected he wanted to go to the Western Mortal Realm, though he did not point it out.<br/><br/>Everyone has their own pursuits, and Fang Wang had no desire to become the guardian of everyone around him. He couldn’t do it, nor was it necessary. Everyone has their own fate; if one dies on the path of their own pursuit, then it can be considered a worthy death.<br/><br/>Several days later.<br/><br/>Fang Wang’s cultivation had become completely stable, and he began contemplating the fusion of Sword Dao.<br/><br/>He planned to integrate the Zhu Xian Jing Hong Sword with the Celestial Sword Intent to see what kind of marvelous effect it could achieve.<br/><br/>Once he merged the new Sword Dao, he could look for a location to create a new treasured spirit.<br/><br/>As he entered the state of enlightenment, time quickly passed by.<br/><br/>Each day he experienced failure, with the Heavenly Palace present, he did not need to validate; he simply had to keep trying.<br/><br/>Three months later.<br/><br/>Thunder clouds appeared in the sky, and Heavenly Might began to descend.<br/><br/>Fang Wang opened his eyes to see that this celestial phenomenon was not caused by him; he had not yet succeeded.<br/><br/>The previous phenomenon caused by the Mie Jue Divine Tome lasted for three hours, and it was unknown how long this one would last.<br/><br/>Fang Wang never underestimated the people of the world; there were plenty of geniuses, and there were those cultivators who devoted their entire lives and suddenly understood in an instant, always someone capable of causing a celestial phenomenon.<br/><br/>However, he was soon moved.<br/><br/>From within the rolling thunder clouds, golden lotus petals drifted down like a golden rain, dispelling the clouds surrounding the mountain peak.<br/><br/>“This is…”<br/><br/>Hong Xian’er looked up at the firmament with surprise on her face.<br/><br/>Xiao Zi swiftly slid next to Fang Wang, anxiously looking up at the sky.<br/><br/>Fang Wang could feel that these golden lotus petals were not harmful but were instead manifestations of concentrated spiritual energy that could be absorbed.<br/><br/>He raised his hand, caught a golden lotus petal, which instantly shattered and turned into streams of golden essence that entered his body.<br/><br/>“Hmm?”<br/><br/>Fang Wang was taken aback. He discovered that hidden within the golden lotus petal was a path of the Dao, a relatively basic Qi Gathering technique.<br/><br/>Hong Xian’er caught a golden lotus petal and realized the same.<br/><br/>She mused, “I’ve heard from my father, the emperor, that whenever someone with an extraordinary destiny is born, celestial phenomena emerge. Those who create heavenly or earth-shattering cultivation techniques or divine skills can also cause celestial phenomena. But such phenomena can be good or bad; some merely announce the birth to the people below, some cause suffering, while others use the phenomena to benefit the people. It appears that a great sage has been born.”<br/><br/>A great sage?<br/><br/>Fang Wang raised an eyebrow. He had caused several celestial phenomena himself, but he had no direct connection with the Heavenly Might, unable to utilize these phenomena to transmit teachings to the masses.<br/><br/>Everywhere I looked, golden rain was falling as far as the eye could see. Citizens in the city, farmers in the fields, and wild beasts in the deep forests were all drawn to the golden lotus petals, freezing in place upon contact.<br/><br/>The golden rain lasted for the time it takes an incense stick to burn, while this special phenomenon of heaven and earth continued for two full hours.<br/><br/>The fortuitous event was perhaps not on par with the Mie Jue Divine Tome, but it was undoubtedly one of the greatest blessings of our time, especially since the creator of the Mie Jue Divine Tome, the Absolute Emperor, was not a mortal of this world.<br/><br/>After receiving the inheritance of the cultivation technique from the golden lotus petals, Fang Wang also learned the name of the one who created this fortune.<br/><br/>Xu Chonggua!<br/><br/>Fang Wang no longer dwelt on this and continued to forge his own Sword Dao.<br/><br/>Hong Xian’er also felt stimulated, with geniuses emerging in this era and a Great Saint born, she too desired to make a name for herself and was not content with lagging behind.<br/><br/>In the blink of an eye.<br/><br/>Several months passed, and Fang Wang reached the age of two hundred and ninety-three.<br/><br/>On this day, he finally succeeded.<br/><br/>When he opened his eyes again, he had arrived at the Heavenly Palace.<br/><br/>The fusion of Celestial Sword Intent with the Zhu Xian Jing Hong Sword transformed all beings into Sword Intent ghostly spirits, creating a ghostly divine domain of heaven and earth. This fusion endowed Fang Wang’s Swordsmanship with the profound mysteries of a Sword Array.<br/><br/>Fang Wang had already thought of a name.<br/><br/>Heavenly Earth Slaying Immortals Sword!<br/><br/>He would never forget the Sword Saint, his true mentor in every sense of the word.<br/><br/>Living in this world of cultivation, he had seen too many people: the Great Saints and Great Emperors were just powerful beings or demons in his eyes, and even the Immortal Gods of The Upper Realm seemed selfish and arrogant.<br/><br/>The only one who truly deserved to be called an immortal was the Sword Saint, bound by mortal flesh; with his non-lethal Swordsmanship, he commanded respect and left a good name both in Grand Qi and the Southern Celestial Sea.<br/><br/>Fang Wang began to practice the Heavenly Earth Slaying Immortals Sword.<br/><br/>Unlike the comprehensiveness of the Mie Jue Divine Tome and the complexity of the Formless Zhou Tian Technique, the Heavenly Earth Slaying Immortals Sword was not so difficult to cultivate.<br/><br/>It took Fang Wang only five hundred years to master the Heavenly Earth Slaying Immortals Sword to the level of Great Perfection!<br/><br/>The mastery took only two hundred years; it was the Great Perfection that was extremely difficult.<br/><br/>While it took only five hundred years to practice the Heavenly Earth Slaying Immortals Sword, in Fang Wang’s view, it had become one of his trump cards, and he was eager to see how it would perform.<br/><br/>With the Sword Intent unleashed, the world would turn into a ghostly divine domain, and countless ghostly spirits would emerge. How desperate would those who face this Sword feel?<br/><br/>Fang Wang exited the Heavenly Palace, then opened his eyes.<br/><br/>He looked up at the sky, silently gathering the Sword Intent of the Heavenly Earth Slaying Immortals Sword.<br/><br/>Boom—<br/><br/>As expected, a celestial phenomenon arrived. Fang Wang tried to connect himself with the Heavenly Might, wishing to bring fortune to all beings, but regrettably, he could not sense the true Heavenly Dao.<br/><br/>Hong Xian’er opened her eyes, looking at him in amazement, feeling the profoundness of Fang Wang’s Sword Intent.<br/><br/>“You… how did you cause this celestial phenomenon?” Hong Xian’er couldn’t help asking.<br/><br/>The sound of thunder echoed from the sea of clouds, as if the gods of thunder were roaring.<br/><br/>Fang Wang remained calm and said, “I have just comprehended a set of Swordsmanship.”<br/><br/>“What Swordsmanship? Is it related to Celestial Sword Intent?”<br/><br/>“Yes, I have combined Celestial Sword Intent with a Great Saint’s Swordsmanship, and this Sword is called the Heavenly Earth Slaying Immortals Sword.”<br/><br/>Hong Xian’er’s beautiful eyes widened at Fang Wang’s answer.<br/><br/>“Wait! You also possess the Swordsmanship of a Great Saint? Are you not yet three hundred years old? How did you find so many inheritances? Even if you did, how did you manage to learn them? Besides, your cultivation is not weak at all!” Hong Xian’er exclaimed anxiously.<br/><br/>At that moment, she was utterly bewildered.<br/><br/>She suddenly regretted coming out with Fang Wang.<br/><br/>Comparing oneself with others could indeed be infuriating.<br/><br/>She also finally understood why Xu Qiuming left—to walk his own path, fearing the discouragement!<br/><br/>Xiao Zi boasted, “My young master must have been a great Immortal God from the heavens in his previous life; such a being is beyond the comprehension of you mortals!”<br/><br/>The concept of past and present lives was deeply ingrained in the hearts of all beings, as all creatures had past lives, so Xiao Zi always believed Fang Wang was the reincarnation of an Immortal God.<br/><br/>Hong Xian’er looked complexly at Fang Wang, unsure of what to say.<br/><br/>Gazing at the sky, Fang Wang said, “Would you like to learn? I can teach you. If you can’t learn the Formless Zhou Tian Technique, you can start with something else.”<br/><br/>Hong Xian’er, without the Heavenly Dao Immensity Scripture, could not practice on her own. If she continued to fruitlessly probe the Formless Zhou Tian Technique, she would be wasting time.<br/><br/>Upon hearing this, Hong Xian’er retorted, “That’s perfect, let’s spar and allow me to feel the power of your Swordsmanship.”<br/><br/>Fang Wang stood up and said softly, laughing, “As you wish.”<br/><br/>Suddenly stomping his foot, the entire sky darkened instantly, as if night had fallen, and towering shadows emerged from the roiling clouds surrounding the mountain peak, as if great mountains rose from the earth, creating an oppressive aura.<br/><br/>Hong Xian’er and Xiao Zi instinctively turned to look, their mouths agape in astonishment.<br/><br/>From all directions, fearsome ghostly spirits stood up from within the sea of clouds; at a glance, it was impossible to see their end or count how many there were.<br/><br/>They both remembered the performance of the ghostly spirits when Fang Wang slew the Lord of Night. With just one being so formidable, what terror would thousands upon thousands multiply to?<br/><br/>Hong Xian’er, with her profound cultivation, sensitively realized that the space was changing, with an invisible force sealing off miles of the Firmament.\t\t\t\t\t\t</div>", "images": {}, "success": true}