{"id": 278, "url": "https://www.novelhall.com/i-became-an-immortal-on-mortal-realm-32879/14736008.html", "title": "Chapter 278 - Chapter 278: Chapter 275: Law Of Heaven And Earth, Immortal Descends To The Mortal World", "volume": 3, "volume_title": "Volume 3", "body": "<h1>Chapter 278 - Chapter 278: Chapter 275: Law Of Heaven And Earth, Immortal Descends To The Mortal World</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 278: Chapter 275: Law of Heaven and Earth, Immortal Descends to the Mortal World<br/><br/>An immortal’s bearing?<br/><br/>Ever since Fang Wang had left, Hong Xian’er was still recounting his words, always feeling that Fang Wang wasn’t just boasting, and it might have something to do with the creation of the Nine Lives Precious Spirit.<br/><br/>Hong Xian’er returned to the Imperial Palace and sought out Crown Prince Hong Shou.<br/><br/>Hong Shou, nearly four thousand years old, looked exceedingly majestic clad in the Crown Prince’s golden robe, resembling a second Emperor Donggong. His cultivation wasn’t low either, having reached the Seventh Level of the Sky-Stepping Realm.<br/><br/>Upon hearing that Fang Wang was willing to lend a hand, Hong Shou heaved a sigh of relief, his face breaking into a smile as he said, “This Fang Wang indeed seems to be a man of great loyalty and affection. He could have simply left and not waded into these troubled waters.”<br/><br/>Hong Xian’er huffed, “Of course, Father’s discernment is exceptional. The man he has taken an interest in definitely cannot be wrong.”<br/><br/>As she spoke, a rare smile appeared on her face.<br/><br/>Hong Shou sighed and said, “I hope Fang Wang can suppress my fourth brother. It’s also my incompetence, unable to win over everyone. Following Father’s departure, it’s unexpected that so many in court have opposed me.”<br/><br/>Hong Xian’er looked at him and said, “Don’t you think that there are too many who oppose you?”<br/><br/>Upon hearing this, Hong Shou frowned and asked, “What do you mean by that…?”<br/><br/>“Let’s wait and see how Fang Wang performs. You should prepare to face the enemies outside the dynasty. Recently, the number of scouts infiltrating the Human Emperor Continent has been increasing, and the catastrophe of the Grand Yu Divine Dynasty is approaching.” After speaking, Hong Xian’er turned and left.<br/><br/>Hong Shou sat on the throne with a dark expression on his face.<br/><br/>Green hills rolled under a clear sky, while solitary egrets soared.<br/><br/>Fang Wang was seated on a mountaintop, not cultivating but instead admiring the magnificent scenery before him.<br/><br/>Xiao Zi lay beside him, curiously asking, “Young Master, are we just going to wait here?”<br/><br/>Fang Wang replied, “Hmm, they are heading in this direction.”<br/><br/>He had already locked onto the direction of the fourth Prince’s army. The powerful presence of over a million was converging, and not just him, but many cultivators within the Imperial City had felt it as well, the entire city bracing for a big enemy.<br/><br/>Xiao Zi had also sensed the presence of the enemy troops and was simply curious about how Fang Wang planned to stop the army. Moreover, the location wasn’t far from Imperial City. Once the battle commenced, the people in the city could quickly arrive, and those with profound cultivation could even watch the battle directly from there.<br/><br/>It knew the Young Master was about to demonstrate his saintliness!<br/><br/>It was very eager to see how strong Fang Wang had become after creating the Nine Lives Precious Spirit!<br/><br/>Meanwhile.<br/><br/>A thousand miles away, rolling clouds churned as a million-strong army stood upon them, together with numerous large demon pets, mounts, and spirit beasts, advancing unstoppably forward.<br/><br/>At the forefront of the army stood a handsome man in python-patterned golden clothing with a black cloak draped over his shoulders. His palms rested on the hilt of his sword as his sharp gaze fixed ahead.<br/><br/>The fourth Prince, Hong Chen.<br/><br/>Hong Chen bore some resemblance to Hong Shou, only younger in facial features, with a hint of wildness between his brows, giving him an unruly demeanor.<br/><br/>At this moment, two elders stood by Hong Chen’s sides—two of the Land Immortals from the Taiqing Xuanjiao.<br/><br/>On the left was the Earth-Evading Land Immortal, sporting a slightly fat figure with friendly eyes, always squinting in mirth, as he fanned himself. He chuckled as he said, “This Crown Prince has yet to come to stop us. Has he set up an inescapable trap, or has he already given up on the throne?”<br/><br/>The Thunder-Commanding Land Immortal stood tall and sturdy, dressed in a green robe with a long sash draped over his shoulders. His hair was tied back within a dark golden crown, and two large flags were crossed behind him. With thick brows and tiger-like eyes, his face bore a formidable countenance.<br/><br/>Hearing the Earth-Evading Land Immortal’s words, the Thunder-Commanding Land Immortal remained silent.<br/><br/>Fourth Prince Hong Chen snorted, “My eldest brother is good in all aspects but is indecisive. Otherwise, I wouldn’t have contested with him. If he were to become Emperor, facing the Holy Clans and Imperial Clans in the future, I fear we would continuously give ground.”<br/><br/>The Earth-Evading Land Immortal beamed, “Indeed, Emperor Donggong acted with an iron fist, and to inherit his Grand Yu Divine Dynasty, one must follow the path of dominance. Otherwise, those forces suppressed by Emperor Donggong will surely backbite.”<br/><br/>Hong Chen glanced at Earth-Evading Land Immortal and inquired, “Your sect has disciples from the Yu Clan. I wonder, what is your sect’s stance on my father’s actions?”<br/><br/>“The Seven Clans committed acts of injustice and deserved to be eliminated. Yu Zhen, the Taoist, acted rashly in the name of Taiqing Xuanjiao, and for this, he has been punished by my fellow disciples to reflect upon his actions for a thousand years, stripped of the Yu Clan’s fate. From now on, he asks for nothing in the secular world, only for the Law of Heaven and Earth,” Earth-Evading Land Immortal answered.<br/><br/>Hong Chen withdrew his gaze and continued looking ahead.<br/><br/>The soldiers in the million-strong army behind him discussed the upcoming battle, with most of them exhilarated. If Hong Chen claimed the throne, they would all be treated as heroes.<br/><br/>A few were concerned about whether this battle would bring calamity to the Grand Yu Divine Dynasty.<br/><br/>Since Emperor Donggong had established the Grand Yu Divine Dynasty four thousand years ago, there had never been any internal strife!<br/><br/>The clouds churned rapidly, and Hong Chen’s army crossed mountains and cities. Wherever they passed, the cultivators and demon beasts of the Grand Yu Divine Dynasty fled in panic.<br/><br/>Time quickly passed.<br/><br/>“We are five hundred miles from Imperial City. Today, we will breach the gates in one fell swoop!”<br/><br/>A burly general, clad in heavy armor, raised his greatsword and shouted with all his might. His voice echoed through the heavens and even reached inside Imperial City.<br/><br/>Imperial City was thrown into an uproar.<br/><br/>“That’s General Cheng Chu’s voice!”<br/><br/>“The army of the fourth Prince is coming!”<br/><br/>“Who would have thought to really start a war so soon after the Emperor’s death. It’s chaos, all chaos!”<br/><br/>“Damn it, the most accomplished general of Grand Yu has drawn his sword against the Imperial City, how could His Majesty rest in peace in the netherworld?”<br/><br/>“What about the Crown Prince? Why hasn’t he mobilized the troops yet?”<br/><br/>The people in the city were in turmoil, while the civil and military officials had already gathered inside the Imperial Palace, and Crown Prince Hong Shou was soothing them.<br/><br/>Upon hearing that Tian Dao Fang Wang was preparing for battle, the civil and military officials remained anxious, feeling it was overly presumptuous for the Crown Prince to rely on just one person, Fang Wang, to counter the army of the Fourth Prince.<br/><br/>Hong Xian’er appeared on top of the city walls, gazing into the distance.<br/><br/>The mountains in the horizon soared high, majestic and stunning, showing no signs of danger.<br/><br/>A figure appeared beside her, it was none other than Emperor Tao, who had previously been sent by Emperor Donggong to meet Fang Wang.<br/><br/>Emperor Tao, clad in Silver Armor, looked into the distance and said, “Do you think Fang Wang can succeed? The armies of the Grand Yu Divine Dynasty are not something that can be compared with just taking out the seven clans, not to mention the assistance of two Land Immortals.”<br/><br/>Hong Xian’er casually replied, “Where are these Land Immortals from, shameless, Fang Wang will certainly succeed.”<br/><br/>Emperor Tao looked at her in surprise and teased, “How many years has it been since our always proud Seventh Princess has been so smitten with a man? It’s really quite rare.”<br/><br/>“That’s because you don’t know his might. One day, you’ll trust him just as I do.” Hong Xian’er snorted, her face involuntarily breaking into a smile.<br/><br/>Just at that moment, the roar of General Cheng Chu came from the horizon:<br/><br/>“Who are you to dare block the path of my army? State your name!”<br/><br/>“Tian Dao Fang Wang.”<br/><br/>Fang Wang’s voice was soft, lacking the aggressive tone of Cheng Chu, but it clearly reached the ears of all beings between heaven and earth.<br/><br/>Upon hearing this, Hong Xian’er and Emperor Tao stopped their idle chat and turned their gaze towards the distance.<br/><br/>The Imperial City also fell silent, Fang Wang’s name had already spread throughout the Grand Yu Divine Dynasty, and under Emperor Donggong’s deliberate promotion, everyone knew that Fang Wang was the current top genius of the world and a peerless powerhouse who had swept through the seven Saint Clans.<br/><br/>At the same time.<br/><br/>In the distance.<br/><br/>Atop the mountains, the sea of clouds carrying a million-strong army came to a halt, and the Fourth Prince Hong Chen frowned as he looked ahead, joined in his scrutiny by the Land Immortals who wielded the power of burrowing and thunder respectively.<br/><br/>The army behind them was somewhat restless; the name of Fang Wang was indeed awe-inspiring, possessing a certain deterrent power for them.<br/><br/>The last significant act of Emperor Donggong during his lifetime was to protect Fang Wang. Now that Fang Wang had appeared, could it be the will of Emperor Donggong?<br/><br/>Although they were stirring a civil war, just the thought of Emperor Donggong made their hearts waver.<br/><br/>In front, Fang Wang stood suspended in the air, with Xiao Zi perched on his shoulder.<br/><br/>Xiao Zi was curiously looking at Fang Wang, as it had wanted to enlarge itself to let him ride the dragon and reveal his holiness, but he had refused.<br/><br/>The Fourth Prince Hong Chen spoke up, “Fang Wang, I have heard of you. Even my imperial father called you the number one genius in the world. Serve me, and when I ascend to the throne, I will cultivate you as a priority, helping you to strike for the position of a Great Saint in the legends.”<br/><br/>This was the first time Fang Wang had seen Hong Chen; when Emperor Donggong passed on the Mie Jue Divine Tome, Hong Chen was not present. It seemed that Hong Chen had long been abandoned.<br/><br/>Of course, there was another possibility, that Emperor Donggong merely went through the motions, mainly intending to pass the Mie Jue Divine Tome to Hong Xian’er.<br/><br/>“I have received great kindness from His Majesty Emperor Donggong, and I have promised him to protect the Grand Yu Divine Dynasty and to guard the Seventh Princess. As long as I live, I will not allow turmoil within the Grand Yu Divine Dynasty, nor will I allow it to face the threat of annihilation. Fourth Prince, if you insist on defying the imperial edict, don’t blame Fang Wang for being impolite.”<br/><br/>Fang Wang replied, his voice resonating through heaven and earth again, reaching into the Imperial City.<br/><br/>Hearing these words, many civilians and cultivators within the Imperial City had tears in their eyes, not because they were moved by Fang Wang, but because they missed their all-powerful Emperor Donggong.<br/><br/>Hearing Fang Wang’s words, Hong Chen laughed, his expression twisted with malice.<br/><br/>Without waiting for his command, a figure leaped past him towards Fang Wang.<br/><br/>It was General Cheng Chu, wielding a great saber wrapped in fierce energy, his figure rugged as a wild bear, and his presence suggested an unstoppable force.<br/><br/>Cheng Chu sneered, “Fang Wang, I’ve heard that you can slay those in the Sky-Stepping Realm. Let this general see if you truly have such ability today!”<br/><br/>The corners of Fang Wang’s mouth lifted, and his figure abruptly enlarged.<br/><br/>Cheng Chu’s pupils contracted, unconsciously slowing down, and he was not the only one; the entire million-strong army was taken aback, each soldier looking up, eyes wide and mouths opening unconsciously.<br/><br/>In an incredibly short time, Fang Wang had grown tens of thousands of feet tall.<br/><br/>The Xiao Zi on his shoulder now seemed smaller than an insect, equally astonished as it looked at Fang Wang’s enlarged face.<br/><br/>“This…”<br/><br/>Xiao Zi said tremblingly, as if experiencing a dream.<br/><br/>What Fang Wang used was the Tianling Body. His Six Harmonies and Eight Desolations Seal and Town World Bead could enlarge, so naturally, he could as well, effectively wielding a kind of Divine Skill.<br/><br/>At that moment, Fang Wang thought of the Law of Heaven and Earth from the myths of his previous life.<br/><br/>Fang Wang lifted his right hand and conjured the Heavenly Palace Halberd, which also grew in size, exceeding even his own height to reach nearly twenty thousand feet long.<br/><br/>The enlargement of the Heavenly Palace Halberd was not due to the Tianling Body, but rather its inherent power.<br/><br/>Only after shaping the Tianling Body could Fang Wang harness its true power.<br/><br/>Fang Wang, tens of thousands of feet tall, wielding a twenty thousand-foot-long Heavenly Palace Halberd, stood proudly under the Firmament, with the Fourth Prince Hong Chen and his million-strong army looking up at him as if they were mortals beholding an Immortal descending to Earth.\t\t\t\t\t\t</div>", "images": {}, "success": true}