{"id": 279, "url": "https://www.novelhall.com/i-became-an-immortal-on-mortal-realm-32879/14775993.html", "title": "Chapter 279 - Chapter 279: Chapter 276 Unbelievably Strong", "volume": 3, "volume_title": "Volume 3", "body": "<h1>Chapter 279 - Chapter 279: Chapter 276 Unbelievably Strong</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 279: Chapter 276 Unbelievably Strong<br/><br/>“What kind of spell is this?”<br/><br/>“Am I under an illusion? How did he suddenly get so big?”<br/><br/>“It must be some sort of Divine Skill, although he has not yet reached the Divine Passage Realm, he is after all the world’s number one talent.”<br/><br/>“Hss… Even His Majesty doesn’t possess such a stature, does he?”<br/><br/>“No wonder he dares to come alone…”<br/><br/>The Fourth Prince’s million soldiers discussed animatedly; even the weakest of these soldiers was in the Condensation Spirit Realm, while some commanders had even reached the Heaven-Breaking Realm, Divine Passage Realm, and Sky-Stepping Realm. They were truly the cream of the Grand Yu Divine Dynasty’s crop. The youngest among them was over two hundred years old, experienced and well-informed, but they had never seen such Divine Skills before.<br/><br/>Even the Earth-Dodging Immortal and Thunder-Wielding Immortal by Hong Chen’s side were moved.<br/><br/>Xiao Zi, perched on Fang Wang’s shoulder, widened its eyes. For some reason, seeing Fang Wang’s towering presence, it was inexplicably reminded of a scene from ten thousand years past.<br/><br/>With a sweep of the Heavenly Palace Halberd in his hand and gripping it with one hand, Fang Wang pointed at the million-strong army and said indifferently, “Would any of you care to test the sharpness of the halberd in my hand?”<br/><br/>Boom!<br/><br/>He erupted with the aura of the Heavenly Gang Supreme Yang Tyrant Body, shaking heaven and earth and whipping up a fierce wind that caused many soldiers to instinctively raise their arms to shield themselves.<br/><br/>Hong Chen’s hair was blown about, revealing his face completely. At that moment, his expression was incredibly complex.<br/><br/>He said gravely, “Cheng Chu, what are you staring at? Kill him!”<br/><br/>Upon hearing this, Cheng Chu, still in shock and fear, came back to his senses, leapt into the air, raised his great sword with both hands, and furiously slashed down.<br/><br/>A sword slash descended, its light dazzling between heaven and earth, the blade’s aura like a celestial river smashing down, spanning thousands of zhang.<br/><br/>If it were a different opponent, such an attack would be visually stunning, but in front of Fang Wang, it seemed rather ordinary.<br/><br/>Fang Wang, towering at a height of ten thousand zhang, equivalent to more than thirty thousand meters, faced no mountain on the Earth of his previous life that could match his stature. Moreover, he was holding an even more exaggerated Heavenly Palace Halberd.<br/><br/>Fang Wang’s right arm trembled, and with it the Heavenly Palace Halberd, generating a terrifying force that directly dispersed Cheng Chu’s blade aura.<br/><br/>Cheng Chu vanished into thin air, and in the next second, he reappeared behind Fang Wang. With an empty hand, he took out a gourd. He fiercely inhaled something from the gourd and then sprayed it out towards Fang Wang.<br/><br/>With a loud bang, a vast sea of fire surged forth from his mouth. It was so immense that it instantly engulfed the upper half of Fang Wang’s body, whipping up a terrifyingly hot wind throughout the whole world.<br/><br/>Hong Chen raised his hand to fend it off, summoning a purple glow to form a Spiritual Energy shield around his body.<br/><br/>Behind him, the million-strong army began to form up into battle lines under the orders of their generals.<br/><br/>While Cheng Chu was still spewing fire, Fang Wang turned and swept the Heavenly Palace Halberd toward him.<br/><br/>So fast!<br/><br/>Cheng Chu’s pupils suddenly constricted. He dodged instinctively, but was still sent flying by the force of Fang Wang’s halberd swing, crashing through a series of mountains and disappearing into the mass of rock.<br/><br/>The Earth-Dodging Immortal couldn’t help but remark, “Truly worthy of being the number one talent of the Eastern Mortal Realm. His Divine Skills are not just for show; his speed remains incredible.”<br/><br/>The Thunder-Wielding Immortal calmly said, “Yes, his physical strength is formidable. He is superior to the vast majority of the Sky-Stepping Realm cultivators, and even when compared to demons of a similar level, his physical strength is not weaker.”<br/><br/>Hong Chen asked, “Both of you, are you capable of suppressing him?”<br/><br/>The Thunder-Wielding Immortal answered, “Although it will be troublesome, it shouldn’t be difficult.”<br/><br/>“Suppression is harder than killing. The Fourth Prince really values talent,” said the Earth-Dodging Immortal meaningfully.<br/><br/>Hong Chen remained noncommittal, his gaze fixed on Fang Wang.<br/><br/>“Shouldn’t be difficult?”<br/><br/>Fang Wang’s voice suddenly came through, startling Hong Chen, the Thunder-Wielding Immortal, and the Earth-Dodging Immortal, as an overwhelming pressure enveloped them.<br/><br/>The Thunder-Wielding Immortal immediately drew two large banners from his back, and the Earth-Dodging Immortal took out a mirror. Both were on high alert.<br/><br/>Hong Chen exerted himself to the fullest in his cultivation, but still he was forced to step back by the oppressive force, a look of terror in his eyes.<br/><br/>They saw Fang Wang gazing at them from the horizon, his ten thousand zhang figure as if ready to shatter the heavens.<br/><br/>The Thunder-Wielding Immortal and the Earth-Dodging Immortal seemed to sense something and instinctively looked all around.<br/><br/>Suddenly, black ghost gods began to slowly rise from amongst the mountains, each holding a ghostly sword, all identical, gigantic in size, and hundreds of zhang tall.<br/><br/>In the woods, by the lakes, on hill slopes, atop mountains, and in the rivers—every direction was filled with the looming figures of ghost gods emerging endlessly, with no end in sight.<br/><br/>An indescribable sense of oppression covered Hong Chen and the others. The faces of the million soldiers arranging themselves in battle formations turned pale; they sensed the breath of death.<br/><br/>Heavenly Earth Slaying Immortals Sword!<br/><br/>The oppressive might of the Slaying Immortals enveloped heaven and earth, and the deathly chill from the Underworld made all beings within thousands of li feel as if they were in a cold cellar.<br/><br/>“What kind of formation is this? How could it have appeared without any warning…”<br/><br/>The Thunder-Wielding Immortal frowned tightly, muttering to himself.<br/><br/>“Elder brother, don’t bother with that, let’s attack together!” the Earth-Dodging Immortal said coldly.<br/><br/>In the distance, Cheng Chu kept attacking relentlessly, but Fang Wang easily repelled him every time. Despite Cheng Chu’s use of various Divine Skills, capable of destroying heaven and earth, he could not injure Fang Wang.<br/><br/>To Fang Wang, Cheng Chu’s strength was not even comparable to Qiu Shenji’s.<br/><br/>Fang Wang was now stronger than during the great battle against Qiu Shenji, having not only made a major breakthrough in his cultivation but also mastered the Mie Jue Divine Tome and Heavenly Earth Slaying Immortals Sword, and he had fashioned the Nine Lives Precious Spirit.<br/><br/>Let alone Cheng Chu, even if he were to fight Qiu Shenji again, Fang Wang felt confident that he could easily slay him!<br/><br/>However, this battle was not for the sake of killing the enemy, but for securing stability within; if it was possible not to kill, then no killing would take place.<br/><br/>Boom! Boom!<br/><br/>The Earth-Burrowing Immortal and Thunder-Holding Immortal exploded with terrifying might, far surpassing Cheng Chu. The denizens of the entire Human Emperor Continent were shaken to their core.<br/><br/>In the distance.<br/><br/>The skies above the Imperial City were filled with figures. Countless cultivators watched the battle from afar; they could not capture Fang Wang’s figure with their divine senses, but seeing the invaders being beaten back and forth, they could sense Fang Wang’s strength.<br/><br/>On the city walls, Emperor Tao clicked his tongue in wonder, “What peculiar cultivation technique has this kid practiced, that his figure is completely undetectable, and it’s even impossible to discern what Divine Skills he’s using? Those guys look like they’ve seen a ghost.”<br/><br/>Hong Xian’er pouted.<br/><br/>Having trained for ten years without success in that peculiar technique, its unpredictably ghostly effects made sense to her now.<br/><br/>Countless figures streaked past them overhead, all heading towards the battlefield.<br/><br/>Hong Xian’er spoke up, “Let’s go have a look too.”<br/><br/>Emperor Tao nodded, his tone mocking, “I was worried about him before, but now I’m more concerned that he might wipe out the Grand Yu Divine Dynasty’s elite army.”<br/><br/>The two took to the skies and swiftly vanished on the horizon.<br/><br/>Only the Great Cultivators of the Grand Yu Divine Dynasty dared to fly towards the battlefield; and not just from the Imperial City, but Great Cultivators from other cities and mountains were also on their way.<br/><br/>Hong Xian’er and Emperor Tao were incredibly fast. Before long, they had reached the edge of the battlefield. They slowed their speed, their eyes widened in shock.<br/><br/>Gazing ahead, the landscape was filled with spectral figures, and at the edge of the world, Fang Wang’s towering figure was especially awe-inspiring.<br/><br/>Even Hong Xian’er was taken aback.<br/><br/>She couldn’t understand how Fang Wang had grown so huge.<br/><br/>Emperor Tao was even more astonished. The scene before him greatly challenged his perceptions.<br/><br/>He had lived for so many years and had never seen such a presence before.<br/><br/>In a daze, he thought Fang Wang had surpassed Emperor Donggong, as if he saw not a genius, but a proud Immortal God standing above the Mortal Realm.<br/><br/>Ghosts and gods swung their swords in one direction, countless streaks of black Sword Qi crisscrossing the heavens and earth.<br/><br/>The Earth-Burrowing Immortal and Thunder-Holding Immortal struggled desperately. The Earth-Burrowing Immortal would burrow into the earth from time to time, but the spectral warriors could do the same, pursuing him underground until they forced him out.<br/><br/>The Thunder-Holding Immortal wielded his lightning spells, flashing with thunder, as if he were surrounded by heavenly lightning. Faced with the Sword Qi, he resisted by waving his flag and hurling thunder, displaying the awesome power of thunder that shook the skies. Yet he was still overwhelmed by the sheer number of spectral warriors attacking him, and despite killing many, an endless stream of them kept emerging.<br/><br/>All these spectral warriors were manifestations of Fang Wang’s Spiritual Power. The Spiritual Power from the Heavenly Dao Immensity Scripture was vast, and during a hard-fought battle in the Ninth Layer of the Ascending Sky Realm, Fang Wang could afford to squander his power for days on end. Now that he had broken through to the Heaven-Breaking Realm, his Spiritual Power was naturally more boundless.<br/><br/>Moreover, he could switch the effects of his Tianling Body to those of the Heavenly Dao Imperial Dragon Crown, which also caused his physical body to absorb nature’s spiritual energy even faster. He could even achieve a balance between the speed of absorbing Spiritual Energy and the rate of expending Spiritual Power.<br/><br/>To some extent, possessing the Tianling Body meant he had an inexhaustible supply of Spiritual Power.<br/><br/>The Tianling Body eliminated the need for the Heavenly Dao Imperial Dragon Crown to absorb Spiritual Energy before merging it into his body, making the process much more efficient.<br/><br/>Fang Wang stood tall between heaven and earth, looking down on the struggled resistance of the Earth-Burrowing Immortal and the Thunder-Holding Immortal.<br/><br/>Cheng Chu, however, was immobilized within the palm of Fang Wang’s left hand, only able to watch the great battle ahead in horror.<br/><br/>It was an utterly one-sided battle!<br/><br/>The Earth-Burrowing Immortal and the Thunder-Holding Immortal kept trying to get closer to Fang Wang but were unfortunately blocked by the spectral warriors. Not only were the spectral warriors powerful, but the mysterious pressure between heaven and earth was growing stronger, making their movements slower and slower.<br/><br/>The arrayed million soldiers realized, to their fear, that they could not form their formations. Every time they were about to succeed, the formations would break apart.<br/><br/>Prince Hong Chen stood upon the clouds with a dark expression, watching this scene.<br/><br/>Fang Wang had not let the spectral warriors attack them. Instead, he let them join in watching the battle.<br/><br/>The mountains below had been leveled to the ground, with billowing clouds of dust filling the space between heaven and earth, like the chaotic world of primordial times.<br/><br/>More and more Great Cultivators arrived, and upon seeing Fang Wang’s figure, everyone was deeply moved and even dumbstruck.<br/><br/>“Is that Tian Dao Fang Wang?”<br/><br/>“What Divine Skills are these?”<br/><br/>“Legend has it that Fang Wang’s body is stronger than the Heavenly Body, could this be his true form?”<br/><br/>“Are those two from Taiqing Xuanjiao’s eighteen Land Immortals? Their might is truly tremendous, but unfortunately, they’re still being suppressed.”<br/><br/>“What’s the origin of Fang Wang? Couldn’t really be as the legends say, that he is an Immortal Monarch reincarnated from above?”<br/><br/>The faces of the Earth-Burrowing Immortal and the Thunder-Holding Immortal became even uglier.<br/><br/>They had come to support Prince Hong Chen, and if they were to flee, it wouldn’t just be their own faces that were lost, but also the face of Taiqing Xuanjiao.<br/><br/>Fang Wang had already humiliated Yu Zhen, and if they too were defeated by Fang Wang and the news spread, wouldn’t Taiqing Xuanjiao be trampled under Fang Wang’s feet?<br/><br/>Fang Wang looked down on them and said, “If this is the extent of Taiqing Xuanjiao’s eighteen Land Immortals’ strength, then I am greatly disappointed. How about this, I join your Taiqing Xuanjiao and you crown me as the Heavenly Emperor of the Mortal Realm?”\t\t\t\t\t\t</div>", "images": {}, "success": true}