{"id": 273, "url": "https://www.novelhall.com/i-became-an-immortal-on-mortal-realm-32879/14597397.html", "title": "Chapter 273 - Chapter 273: Chapter 270: The Aptitude Of The Nine Lives Precious Spirit", "volume": 3, "volume_title": "Volume 3", "body": "<h1>Chapter 273 - Chapter 273: Chapter 270: The Aptitude Of The Nine Lives Precious Spirit</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 273: Chapter 270: The Aptitude of the Nine Lives Precious Spirit<br/><br/>Translator: 549690339<br/><br/>The Heavenly Earth Slaying Immortals Sword appeared, and countless gigantic ghost gods emerged from the mist. The sword array of ghost gods formed in an extremely short period of time.<br/><br/>Xiao Zi also felt the oppressive force of the sword array domain.<br/><br/>Hong Xian’er leaped up and flew high into the sky. She stretched out her arms, her Spiritual Power bursting forth, her yellow clothes fluttering intensely, like a cluster of yellow flames, gradually turning golden.<br/><br/>The vast Spiritual Power of the Divine Passage Realm Ninth Level condensed a golden-red sun behind her, within which a phoenix tumbled, spreading its wings, displaying the elegance of the divine bird.<br/><br/>This was Fang Wang’s first time seeing Hong Xian’er in her battle stance.<br/><br/>One must say, Hong Xian’er’s strength was indeed formidable; her momentum was nearly catching up to Qiu Shenji.<br/><br/>Fang Wang’s mouth curved upward, as he had no intention of holding back.<br/><br/>If they were to fight, he had to win!<br/><br/>Fang Wang did not want to lose, even in pretense!<br/><br/>Under the gloomy firmament, myriads of ghost gods wielding swords rose, all lifting their swords together, aiming at Hong Xian’er.<br/><br/>Qi Dynasty, Sword Heaven Marsh.<br/><br/>Fang Bai, dressed in black, stood by the lake, gazing up at the thunderclouds in the sky.<br/><br/>The Sword Heaven Marsh was still bustling today, with sword cultivators getting sword enlightenment on the lake surface, and many, like him, were also watching the firmament.<br/><br/>“It must be Ancestor Fang…”<br/><br/>With eyes full of admiration, Fang Bai thought to himself.<br/><br/>Having followed Fang Wang in learning the Executioner Immortal Ghost God Sword from an early age, he could sense that this unusual heavenly phenomenon was related to the Executioner Immortal Ghost God Sword.<br/><br/>At that moment, a figure appeared beside him, none other than Dugu Wenhun.<br/><br/>Dugu Wenhun patted his shoulder and asked with a smile, “What are you looking at? If you’re diligent in your cultivation, sooner or later you too can cause such heavenly phenomena.”<br/><br/>Fang Bai shifted his gaze to Dugu Wenhun and said, “Senior, when did you return? Did everything go smoothly?”<br/><br/>Dugu Wenhun shrugged and replied with a smile, “Don’t worry, there aren’t many in the Southern Celestial Sea who can trap me. Everything went well.”<br/><br/>He then looked towards the mountainous outline across the lake. Over the years, Kunlun had formed a mountain range stretching thousands of miles. At first glance, the land on the opposite side of the lake seemed to rise high above the rest.<br/><br/>“Recently, a Sword Immortal reappeared in Grand Qi, said to have come hearing of your fame,” Dugu Wenhun said with a laugh.<br/><br/>Now over one hundred sixty years of age and with extraordinary talent, Fang Bai had become one of the pillars of the Grand Qi Cultivation Realm. As for Fang Jing, after the Wind Clan was annihilated, he went roaming again, thus his name as a genius was rarely mentioned in Grand Qi.<br/><br/>Upon hearing the name ‘Sword Immortal’, Fang Bai’s brows involuntarily furrowed.<br/><br/>Dugu Wenhun twisted his neck and laughed, “Lü Xianming, the foremost talent of Emperor Sea, has also come to Grand Qi and even joined the Great Abyss Gate. When the time comes, you go challenge the Sword Immortal, and I will teach Lü Xianming a lesson.”<br/><br/>Fang Bai nodded. After hesitating for a moment, he asked, “Senior, when will Ancestor Fang return?”<br/><br/>Although there were messages that Fang Wang had gained the favor of Emperor Donggong, since Fang Wang had not returned, Fang Bai still felt some concern.<br/><br/>“Who knows, but he’ll return sooner or later. You need to cultivate well, so that you can surprise him when he returns. Grand Yu Divine Dynasty under Emperor Donggong is one of the most powerful kingdoms of fate in the world and is filled with talents. His requirements for you will surely be even higher when he returns,” Dugu Wenhun said meaningfully.<br/><br/>He was curious about the Grand Yu Divine Dynasty, but unfortunately, it was too far away, and he had to stay here to guard Kunlun since he had agreed to be Fang Wang’s deputy Sect Hierarch.<br/><br/>After the calamity of the Seven Clans, Dugu Wenhun felt even more certain about Fang Wang’s future; Fang Wang had become unstoppable. He believed that there were no future calamities capable of thwarting Fang Wang.<br/><br/>As long as he clung to Fang Wang’s coattails, it was possible for him to touch upon the word ‘Immortal.’<br/><br/>Fang Bai listened and nodded.<br/><br/>A look of anticipation appeared in his eyes.<br/><br/>His Executioner Immortal Ghost God Sword already had a style of its own, which was also the reason he could stand proudly in the Grand Qi Cultivation Realm.<br/><br/>He always believed that the swordsmanship taught by Ancestor Fang was the strongest.<br/><br/>He looked up at the firmament again, feeling the vast Heavenly Might, as if he could see Ancestor Fang undergoing tribulation in the sky.<br/><br/>What realm has Ancestor Fang reached by now?<br/><br/>How splendid is his world?<br/><br/>As the morning sun rose, slicing through the lake surface, the water sparkled. In the middle of the lake sat a tall tower, its reflection continuously swaying on the surface of the lake.<br/><br/>On the lakeside, Hong Xian’er stood shoulder to shoulder with a middle-aged man, with Xiao Zi lying on Hong Xian’er’s shoulder, as they all gazed at the distant tower.<br/><br/>The middle-aged man stroked his beard and exclaimed thoughtfully, “Tian Dao Fang Wang seems to be in the Nirvana Realm, right? He can still create a Lifespirit Treasure; it seems he could be the legendary genius possessing the Nine Lives Precious Spirit from ancient times.”<br/><br/>Hong Xian’er gazed at the tower, somewhat entranced.<br/><br/>She remembered Fang Wang telling her a few days ago that he was going to find a place for Spiritual Refinement; she thought it was a joke then, but it turned out to be true.<br/><br/>The Nine Lives Precious Spirit was, after all, the Lifespirit quality representing the highest talent in legends!<br/><br/>The only Nine Lives Precious Spirit user Hong Xian’er knew of was the ancient Great Saint.<br/><br/>Xiao Zi laughed proudly, “My master has already reached the Heaven-Breaking Realm and just defeated the Princess of the Divine Passage Realm Ninth Level a few days ago.”<br/><br/>Hong Xian’er rolled her eyes, wanting to throw it down.<br/><br/>On hearing this, the middle-aged man couldn’t help but ask curiously, “Xian’er, is that true?”<br/><br/>He was a prince of the Grand Yu Divine Dynasty, known to the world as Guang Mengwang, Emperor Donggong’s son, two hundred years Hong Xian’er’s senior.<br/><br/>As the brawniest among Emperor Donggong’s descendants, Guang Mengwang had been the top talent in the Grand Yu Divine Dynasty before Hong Xian’er became famous. Since then, he had devoted himself to cultivation and rarely showed himself.<br/><br/>“Hmm, he has indeed reached the Heaven-Breaking Realm. I’m no match for him at all. With his current abilities, I’m afraid he could sweep through the Sky-Stepping Realm and even challenge the old monsters of the True Soul Realm.”<br/><br/>Hong Xian’er nodded, speaking of this matter without a hint of shame. Instead, she even showed a look of admiration.<br/><br/>She paused before continuing, “Only by facing him in person can one understand his strength, brother. Do not speak of today’s events; his talent has already shocked the world. If the matter of the Nine Lives Precious Spirit were to spread further, I’m afraid…”<br/><br/>Guang Mengwang stroked his beard and chuckled, “Brother naturally understands this. Besides, sooner or later, he is family. How could I harm my brother-in-law?”<br/><br/>However, his gaze towards the tall tower was very complex.<br/><br/>He never expected that his Spirit Molding Ground would welcome such a prodigiously talented individual.<br/><br/>At the same time, the surface of the lake churned, and Spiritual Energy from heaven and earth surged crazily towards the high tower, its momentum growing stronger and stronger.<br/><br/>The robes of Hong Xian’er and Guang Mengwang fluttered in the breeze.<br/><br/>Guang Mengwang suddenly said, “Although I have not been summoned by our father, I have received his letter. His doomsday is approaching, and that means the doomsday of the Grand Yu Divine Dynasty and the Hong family is approaching as well.”<br/><br/>Hong Xian’er remained silent.<br/><br/>“If Father were to pass away, the Grand Yu Divine Dynasty would surely be besieged by all sides. It will be very difficult to defend the realm. Xian’er, I want to entrust you with a task, can I?” Guang Mengwang turned his head to look at Hong Xian’er, his tone somber.<br/><br/>Hong Xian’er glanced at him and asked, “What is it?”<br/><br/>“Take my wife and children and follow Fang Wang to Kunlun,” Guang Mengwang spoke to Hong Xian’er earnestly.<br/><br/>Upon hearing this, Hong Xian’er’s brows furrowed tightly.<br/><br/>Xiao Zi laughed, “Of course it can be done. Becoming a little Daoist in Kunlun in the future is also a great fortune.”<br/><br/>Guang Mengwang couldn’t help laughing. He did not find Xiao Zi impolite; on the contrary, he found her amusing.<br/><br/>Staring intensely at Guang Mengwang, Hong Xian’er asked, “Brother, do you really believe we can’t overcome this disaster?”<br/><br/>Guang Mengwang’s smile faded as he said, “You know Father. With his cultivation, he is nearly fathomless in Heavenly Dao. His entrusting you to Fang Wang’s care is the clearest indication he could give.”<br/><br/>“I must stay behind, and so must our other brothers. Father has erased the fate of more than ten races and sects. Once he falls, we must face similar retributions. We cannot escape. If we scatter, we will just be hunted and killed one by one. We must stick together. With Fang Wang’s protection, we have no concerns about your safety. Moreover, if we die and the Hong family is extinguished, I believe the various powers of the world will not trouble you, especially since Fang Wang has gained considerable prestige through the matter of the Seven Clans.”<br/><br/>Hearing this, Hong Xian’er couldn’t help but sigh.<br/><br/>Boom!<br/><br/>From the top of the tower in the center of the lake, a brilliant light burst forth, soaring upwards into the clouds.<br/><br/>It was a golden column of light that kept expanding, with an awe-inspiring momentum.<br/><br/>Guang Mengwang and Hong Xian’er looked over, both moved.<br/><br/>Such a powerful aura!<br/><br/>Behind Hong Xian’er, an illusory sun formed involuntarily, while above Guang Mengwang’s head, a gourd took shape.<br/><br/>The siblings looked at each other’s Lifespirit Treasures, their pupils inadvertently dilating.<br/><br/>“Is your treasured spirit also out of control?” Hong Xian’er asked in a deep voice.<br/><br/>Taking a deep breath, Guang Mengwang replied, “Yes…”<br/><br/>At the same time.<br/><br/>Within every city under the Grand Yu Divine Dynasty, the Lifespirit Treasures of all cultivators manifested involuntarily, trembling violently as if facing a natural enemy.<br/><br/>Inside the Imperial Palace.<br/><br/>Emperor Donggong opened his eyes. Around him, four spheres of light formed, each containing a distinct Lifespirit Treasure.<br/><br/>He furrowed his brows, calculated with his fingers, and a look of shock appeared in his eyes.<br/><br/>“I can’t discern… that direction… Xian’er is there, and so is he!”<br/><br/>Emperor Donggong murmured to himself, his tone unable to conceal his astonishment.<br/><br/>Ever since meeting Fang Wang, it was not the first time that Fang Wang’s performance had shocked him.<br/><br/>This time was even more outrageous—Fang Wang was actually shaping a treasured spirit powerful enough to make the world’s treasures tremble.<br/><br/>Emperor Donggong’s mind raced, and he immediately raised both hands, casting a spell, his hands continuously forming various incantations.<br/><br/>With a boom!<br/><br/>His Spiritual Power erupted, sweeping across the Imperial Palace and striking towards the entire Grand Yu Divine Dynasty.<br/><br/>“Fang Wang, since I have chosen to bet on you, I’ll go all in. I will deceive heaven and earth for you. Let’s see if you can surpass the ancient luminaries…”<br/><br/>Emperor Donggong spoke to himself. Toward the end, he chuckled self-deprecatingly, “The wheel of fortune turns; heaven and earth lend their power. There was a time when my fate was at its peak, the great talents of ancient and modern times all assisted me, and now I find myself aiding a junior in the same way.”<br/><br/>From self-mockery to hearty laughter, then to anticipation, the expression on Emperor Donggong’s face changed rapidly.<br/><br/>Elsewhere.<br/><br/>Inside the high tower, Fang Wang sat cross-legged on the ice bed, surrounded by Heavenly Dao’s supreme solar flames, which surged towards the sphere above his head, forming a massive fireball.<br/><br/>Fang Wang’s eyes were closed, his consciousness not within the Treasured Spirit Space, but inside the Heavenly Palace.<br/><br/>At this moment, Fang Wang stood inside the Heavenly Palace hall, with a luminous and mysterious figure standing ten paces in front of him.<br/><br/>Fang Wang frowned tightly. This time, as he was shaping his treasured spirit, he initially had his own plans, but he hadn’t expected the Heavenly Palace to forcefully shatter his treasured spirit, just as it did with the Heavenly Palace Halberd before.<br/><br/>He looked ahead, confused.<br/><br/>Why does this figure look somewhat like himself?\t\t\t\t\t\t</div>", "images": {}, "success": true}