{"id": 270, "url": "https://www.novelhall.com/i-became-an-immortal-on-mortal-realm-32879/14583853.html", "title": "Chapter 270 - Chapter 270: Chapter 267: Fang Wang’S Tribulation", "volume": 3, "volume_title": "Volume 3", "body": "<h1>Chapter 270 - Chapter 270: Chapter 267: Fang Wang’S Tribulation</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 270: Chapter 267: Fang Wang’s Tribulation<br/><br/>Translator: 549690339<br/><br/>The Ghostly Divine Sword Qi gradually dissipated, but the world was still shrouded in darkness, the rolling thunderclouds had not scattered, and the might of the heavens was still fermenting.<br/><br/>The dust settled, and in the trench nearly a hundred zhang deep, the figure of Night Monarch was nowhere to be seen.<br/><br/>Fang Wang floated in the air, raised his hand and beckoned, drawing a Golden Silk Storage Bag into his grasp.<br/><br/>A wave of wind swept towards him, which he did not resist because it was the Sword Intent of Night Monarch.<br/><br/>Night Monarch had not lied; if he died, he would bestow his Sword Intent on the one who killed him. Because of this, Fang Wang had shown mercy, not devouring his soul and even retracting some of his annihilative power to allow him a chance at reincarnation.<br/><br/>The Ghostly Divine behind Fang Wang dissipated, but the Mie Jue Divine Tome remained.<br/><br/>He closed his eyes, absorbing the Sword Intent of Night Monarch while circulating the mental method of the Mie Jue Divine Tome, allowing his Heavenly Gang Supreme Yang Tyrant Body to adapt to the power of the Mie Jue Divine Tome.<br/><br/>Xiao Zi looked at Hong Xian’er with a smug smile and said, “How about that? My master’s reputation is well-deserved, isn’t it?”<br/><br/>Hong Xian’er snapped back to reality and exclaimed, “It’s not just well-deserved; his talent far surpasses legend.”<br/><br/>Xu Qiuming looked up at Fang Wang’s silhouette, his eyes filled with admiration.<br/><br/>Thinking back now, encountering Fang Wang in Grand Qi was the greatest fortune of his life.<br/><br/>“Back then, when I followed the young master into the world of the Qiu Clan, I was the sharpest weapon in the young master’s hand…” Xiao Zi began to boast about their previous battle experiences, getting more and more excited, and although Hong Xian’er and Xu Qiuming didn’t believe it had that kind of strength, they did believe Fang Wang did.<br/><br/>After a full half-hour, Fang Wang ceased his cultivation practice and turned to fly towards the great river.<br/><br/>The thunderclouds in the sky had not yet scattered, and the thunder was oppressive, but no lightning struck.<br/><br/>“Let’s go, let’s see what lies afar,” Fang Wang said with a smile as he landed, appearing as if he had not just been through a battle, much less slain a Sky-Stepping Realm Great Cultivator.<br/><br/>Hong Xian’er and Xu Qiuming nodded and followed Fang Wang, walking northward along the river.<br/><br/>Xiao Zi floated in the air and curiously asked Hong Xian’er, “Princess Seven, your father is Emperor Donggong; you must be quite familiar with the realms of cultivation, right?”<br/><br/>Xu Qiuming had long wanted to ask what the Sky-Stepping Realm was, but he feared showing his ignorance, so he had held back.<br/><br/>Hong Xian’er glanced at Xiao Zi and said, “From low to high, cultivation levels are Qi Cultivation, Spiritual Refinement, Spirit Pill, Xuanxin, Condensation, Du Xu, Golden Body, Mahayana, Nirvana, Heaven Breaking, Divine Skills, Sky-Stepping, True Soul, Celestial Qiankun. Someone in the Sky-Stepping Realm is already considered a first-class powerhouse in the Mortal Realm, living up to four thousand years. Someone in the True Soul Realm can live at least six thousand years; with an undying true soul, their body does not perish. As for Celestial Qiankun, that is the pinnacle of the Mortal Realm, able to live for tens of thousands of years, as long-lived as the heavens and the earth.”<br/><br/>Upon hearing this, Xu Qiuming was struck with a surge of shock.<br/><br/>To reach the Sky-Stepping Realm above Mahayana, one must surpass Nirvana, Heaven Breaking, and Divine Skills?<br/><br/>Fang Wang’s true strength is only two grand realms away from the pinnacle of the Mortal Realm?<br/><br/>Xiao Zi wasn’t surprised; it sighed and said, “That being said, those old fellows who served the Descending Dragon Great Saint back in the day might still be alive.”<br/><br/>Hong Xian’er said calmly, “After the Descending Dragon Great Saint was suppressed by the Immortal Gods, his surviving subordinates cut off all fate and causality with him and fled to the Western Mortal Realm. They even set up a barrier, dividing the Mortal Realm in two, where only cultivators who reach the True Soul Realm are able to cross the barrier.”<br/><br/>The Western Mortal Realm!<br/><br/>Fang Wang had previously heard about it from Emperor Donggong, but his understanding was not deep.<br/><br/>Xiao Zi was curious and inquired further about the situation in the Western Mortal Realm.<br/><br/>Xu Qiuming was hearing this for the first time and felt like he was only now truly grasping the vastness of the Mortal Realm.<br/><br/>Hong Xian’er had never been to the Western Mortal Realm, but Emperor Donggong had, so naturally, she had heard about it. She shared what she knew.<br/><br/>The overall strength of the Western Mortal Realm is greater than that of the Eastern Mortal Realm, mainly because the Eastern Mortal Realm suffered collateral damage from the Descending Dragon Great Saint. The Western Mortal Realm temporarily has no Great Saints or Emperors, but there are more cultivators at higher realms.<br/><br/>For a long time, the beings of the Western Mortal Realm have seen the Eastern Mortal Realm as a forbidden and cursed land. Thus, almost no mighty beings from the Western Mortal Realm come to the Eastern Mortal Realm, while Great Cultivators in the True Soul Realm from the Eastern Mortal Realm need to gain the approval of the Western Mortal Realm to enter it.<br/><br/>Hong Xian’er was clearly annoyed with the existence of the Western Mortal Realm, and as she spoke, she started cursing it.<br/><br/>She thought that splitting the Mortal Realm in half was nothing but an attempt to escape responsibility and fear of the Immortal Gods.<br/><br/>How unworthy of being cultivators!<br/><br/>After they left, more cultivators arrived at the battlefield where Fang Wang fought Night Monarch, investigating the situation.<br/><br/>Upon undulating mountains, the sparse woods were a backdrop to a landscape strewn with corpses, their blood painting some of the trees, adding terror to the scene.<br/><br/>A figure stood atop the pile of bodies, his right hand holding an elderly man.<br/><br/>It was indeed Ji Rutian!<br/><br/>Ji Rutian, dressed in black with gold trim and donning the Demon Jiao Purple Crown, his cloak fluttering in the wind, the bloodstains on it turning into strands of blood essence drifting away.<br/><br/>A stray lock of hair hung loosely over Ji Rutian’s forehead, sticking to his face as he lifted his eyes, his gaze icy cold.<br/><br/>The elderly man he held aloft struggled to open one eye, his expression filled with relief, and with a pained smile, the elder said:<br/><br/>“You… indeed… did not disappoint me… The future of the Ji Family is in your hands now…”<br/><br/>Crack!<br/><br/>Ji Rutian snapped the elder’s neck, extinguishing his last spark of life with his Spiritual Power.<br/><br/>His right hand released its grip, and the elder’s corpse fell down, rolling off the pile of bodies.<br/><br/>From beginning to end, Ji Rutian’s expression remained unchanged.<br/><br/>“You seem more composed than I had anticipated,”<br/><br/>a voice came from behind. A man in red robes hovered in mid-air, watching his silhouette.<br/><br/>Ji Rutian turned his head to look at him and asked, “Master, have I now evaded the catastrophe brought by Emperor Donggong?”<br/><br/>Zhu Changsheng nodded slightly and said, “Yes, you’ve evaded it. Emperor Donggong’s divine skills are indeed extraordinary, truly worthy of being one of the mightiest figures feared in the Mortal Realm. Before his fall, you cannot act in the name of the Ji Family.”<br/><br/>Ji Rutian furrowed his brows and asked, “Emperor Donggong’s fall? How long will that take? Haven’t you said that there’s no one in the Eastern Mortal Realm who can be his opponent?”<br/><br/>When Emperor Donggong eradicated the fate of the seven clans, even at the End of the Sky, Ji Rutian felt as if he were about to die.<br/><br/>Only those who had suffered under Emperor Donggong’s methods truly knew the terror of Emperor Donggong.<br/><br/>Zhu Changsheng turned his head, gazing into the distance, and said softly, “No one in the Mortal Realm can be his rival, but there are those above the Mortal Realm who can.”<br/><br/>Above the Mortal Realm?<br/><br/>Ji Rutian was moved. He suddenly thought of something and couldn’t help asking, “If the Upper Realm sends down Immortal Gods, would Fang Wang encounter a catastrophe?”<br/><br/>After surviving the tragedy of the seven clans, he had completely given up on competing with Fang Wang. If it weren’t for his early detection of something amiss and his escape, he probably would have died already.<br/><br/>In his eyes, Fang Wang was an unreasonable existence, the favorite of the Heavenly Dao.<br/><br/>How can a person be so talented without any limits?<br/><br/>Fang Wang’s cultivation speed was acclaimed as the best in the world, and his actual combat power was even more inconceivable.<br/><br/>The Immortal Gods are wary of the Mortal Realm; they should take notice of Fang Wang, right?<br/><br/>In the past, Ji Rutian considered himself extraordinary. The stronger Fang Wang became, the more excited Ji Rutian felt. But now, he could no longer muster that excitement. The feeling of being unable to catch up no matter how hard he tried left him powerless.<br/><br/>He was born on the same day as Fang Wang; because of this, he knew better than anyone how incredible Fang Wang’s achievements were.<br/><br/>“Perhaps. I used to think that he would certainly attract the attention of the Upper Realm, but now it seems not necessarily. I can no longer deduce his actions; it’s as if he doesn’t exist at all, yet his legend continues to be forged,”<br/><br/>Zhu Changsheng spoke in a calm tone, making it impossible to gauge his inner thoughts.<br/><br/>Ji Rutian’s brows furrowed even more deeply.<br/><br/>“Stop thinking about him. An existence like his isn’t something you should worry about. He is the ordeal for all the mightiest figures in this Mortal Realm. Next, come with me to meet an old friend. I heard he has cultivated a disciple about your age who has developed his Poison Body. I want to see whether his disciple is more formidable or mine is,”<br/><br/>Zhu Changsheng looked back at Ji Rutian and spoke dismissively.<br/><br/>Ji Rutian also laughed and said, “A peer? Apart from Fang Wang, I really haven’t taken anyone else seriously.”<br/><br/>A fighting spirit flashed in his eyes. Having endured too many blows over the years and now having personally buried his own clansmen, he needed to vent his emotions.<br/><br/>“Let’s go.”<br/><br/>Zhu Changsheng flew toward the horizon; Ji Rutian immediately followed.<br/><br/>After traveling some distance, Ji Rutian couldn’t help but look back at the mountainside littered with the corpses of his kin, a melancholic look in his eyes.<br/><br/>Human Emperor Continent, like most continents in the Mortal Realm, had the sun and the moon, the cycle of seasons. Fang Wang traveled on foot through Grand Yu Divine Dynasty with the company of Xiao Zi, Hong Xian’er, and Xu Qiuming.<br/><br/>Before they knew it, two years had passed.<br/><br/>Over these two years, Fang Wang hadn’t been focused on cultivation, but through autonomous cultivation of the Heavenly Dao Immensity Scripture, he smoothly broke through to the ninth layer of Nirvana Realm, aided by the abundant Spiritual Energy of the Grand Yu Divine Dynasty.<br/><br/>His fame had also spread throughout the Grand Yu Divine Dynasty. His previous reputation was built on pursuing the seven Saint Clans, and now the cultivators in the Grand Yu Cultivation World had genuinely felt his strength. Ever since the news of Night Monarch dying by his hand spread, challengers visited him daily.<br/><br/>Fang Wang, much like his earlier days in Sword Heaven Marsh, defeated them in sparring rather than killing them, after all, not everyone was as reckless as Night Monarch.<br/><br/>His demeanor also endeared him to the people of Grand Yu, causing his once bloodthirsty image to transform into that of a profoundly enlightened individual.<br/><br/>On ordinary days, Fang Wang would enjoy the scenery while also instructing Xu Qiuming and Hong Xian’er in the cultivation of Celestial Sword Intent. Every day was fulfilling, and his Dao heart had completely recovered.<br/><br/>One day, they arrived at the halfway point of a green mountain, with a winding stream flowing down the slope. A stone bridge spanned the stream, where small fish and crabs swam. Flourishing plants and trees adorned both sides, a vibrant greenery filling the view.<br/><br/>Fang Wang stopped on the bridge, a smile appearing on his face as he watched the creatures in the stream.<br/><br/>This scenery gave him the sensation of returning to his rural hometown from a previous life.<br/><br/>Hong Xian’er, not noticing his halt, nearly bumped into him—but her outstanding cultivation allowed her to react swiftly.<br/><br/>Xu Qiuming was ten paces behind, using his fingers as a sword, practicing his technique, while Xiao Zi frolicked among the clouds, looking majestic and vigorous.<br/><br/>“Why have you stopped? Is no one challenging you?” Hong Xian’er asked with a puzzled look on her face.<br/><br/>Fang Wang replied, “I would like to stop here for a while.”<br/><br/>His gaze fixed on the stream; he had the ability to peer into the Underworld. At this moment, beside this stream in the Underworld, a silhouette was seen meditating, its reflection shimmering on the surface of the water.\t\t\t\t\t\t</div>", "images": {}, "success": true}