{"id": 275, "url": "https://www.novelhall.com/i-became-an-immortal-on-mortal-realm-32879/14680662.html", "title": "Chapter 275 - Chapter 275: Chapter 272: The Ninth Lifespirit Treasure Successfully Shaped", "volume": 3, "volume_title": "Volume 3", "body": "<h1>Chapter 275 - Chapter 275: Chapter 272: The Ninth Lifespirit Treasure Successfully Shaped</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 275: Chapter 272: The Ninth Lifespirit Treasure Successfully Shaped<br/><br/>Translator: 549690339<br/><br/>“What does that mean? Are you a manifestation of my inner self, or are you another consciousness of mine?”<br/><br/>Fang Wang asked in surprise. He thought about his descent into this life. After all, he had retained the memories of his previous life. He had no knowledge of the process from his past life to this one, unable to discern whether he had been reincarnated or had taken over the body of an infant.<br/><br/>The True God of the Heavenly Palace suddenly threw back his head and burst into uproarious laughter. At the end of his laughter, he even released his right hand that had been grasping the Heavenly Palace Halberd and held his belly with both hands.<br/><br/>Seeing him laugh so maniacally, Fang Wang was quite speechless.<br/><br/>After laughing for a while, the True God of the Heavenly Palace finally raised a hand, pointed at Fang Wang, and said, “Do you still think you’ve traveled through time? That I am the consciousness of the original owner of this body?”<br/><br/>He was almost in tears, and his words took Fang Wang by surprise.<br/><br/>“Can you feel my inner thoughts?” Fang Wang asked with a frown.<br/><br/>The True God of the Heavenly Palace straightened up, laughing as he said, “Alright, stop overthinking it. I am you, not some fleshly body’s original owner, nor some soul from a past life. I am merely the true self reflected by the Heavenly Palace. Your nature has always been like this; it’s only because you’ve stayed in the Heavenly Palace for so long that your true nature has been worn away.”<br/><br/>Hearing this, Fang Wang fell into deep thought.<br/><br/>Upon reflection, it indeed seemed to be the case.<br/><br/>Nowadays, people around him called him gentle, yet the original him was not like that at all. He could be wild, he loved to laugh, and he was carefree and unrestrained.<br/><br/>“Have you figured it out?” The True God of the Heavenly Palace asked with a smile.<br/><br/>Fang Wang looked up at him and asked, “Do you mean that I’ve been focusing too much on pursuing supreme skills and neglecting myself?”<br/><br/>The True God of the Heavenly Palace stared at him and said, “Don’t you think you’ve mastered too many supreme skills already? Why bother exhausting your mind over them?”<br/><br/>Fang Wang asked, “With just the Heavenly Palace Halberd, could I actually be unrivaled in the world?”<br/><br/>“Exactly, have you forgotten? When you were born, it caused a vision between heaven and earth. That torrential rain lasted for a full seven days and nights, longer than any phenomena you’ve ever encountered. Zhou Xue, although a reborn individual with knowledge of The Upper Realm, had not witnessed the visions at your birth. She underestimated your true potential.”<br/><br/>The True God of the Heavenly Palace spoke seriously, and his words made Fang Wang doubtful.<br/><br/>Could it be that he was naturally a prodigy?<br/><br/>Unable to help himself, Fang Wang asked, “Then do you know the origins of the Heavenly Palace?”<br/><br/>The True God of the Heavenly Palace shook his head and said, “I’m not sure, but one thing is certain: the Heavenly Palace belongs to you. There are no marks of anyone else here.”<br/><br/>Fang Wang was silent for a moment, then pressed on, “Do you remember what the Hongxuan Emperor said before? I’ve seen him eight times, and I’ve failed every time. If he wasn’t spouting nonsense, does it mean my past lives or perhaps parallel timelines?”<br/><br/>The True God of the Heavenly Palace countered, “Regardless of its truth, what does it have to do with you?”<br/><br/>“If the Heavenly Palace belongs to me, then it means that I’ve failed eight times while possessing it. Doesn’t this indicate that the power of the Heavenly Palace is not enough to see me through?”<br/><br/>“That only shows they haven’t researched the power of the Heavenly Palace Halberd to its utmost. In this world, the Lifespirit Treasure is the most relied upon power for a Cultivator. Those who pursue other supreme skills, Divine Skills, and Magical Artifacts, do so only because they’ve reached the limits of their talents!”<br/><br/>The True God of the Heavenly Palace said in annoyance. Seeing him angry, Fang Wang, on the contrary, calmed down.<br/><br/>Only to hear Fang Wang muttering to himself, “The path I’m walking now is not wrong. After all, no matter how long I stay in the Heavenly Palace, it’s just a moment in reality. Perhaps the previous eight failures were because I couldn’t bear the tedium of cultivating inside the Heavenly Palace, just as you’ve said, relying solely on the power of the Heavenly Palace Halberd.”<br/><br/>The True God of the Heavenly Palace glared at him but said nothing.<br/><br/>Fang Wang stared back at him and said, “This is the real test, right?”<br/><br/>The True God of the Heavenly Palace didn’t answer.<br/><br/>Fang Wang stepped forward and as he walked, he said, “I will research the power of the Heavenly Palace Halberd in the future, but I won’t stop what I’m doing now. I believe that by absorbing all the Cultivation Techniques and Divine Skills, I can create a true Immortal Law. The Immortal Gods of The Upper Realm pride themselves as such, but if they really were omnipotent, they would have wiped out the Mortal Realm long ago. They are merely stronger Cultivators. Indeed, the Heavenly Palace Halberd has given me great power, but in my eyes, the Heavenly Palace is guiding me towards becoming an Immortal.”<br/><br/>With every step he took, the Heavenly Palace began to tremble, trembling more and more fiercely.<br/><br/>His voice grew louder and louder until, at last, it rang out like a great bell, echoing endlessly.<br/><br/>The True God of the Heavenly Palace was moved; he seemed to freeze in place, wanting to retreat, but unable to do so.<br/><br/>In the end, as Fang Wang collided with him, he burst into pieces and dissolved into scattered stars of light.<br/><br/>Fang Wang’s left foot fell, and the stars of light that had been the True God of the Heavenly Palace clung to him. In an instant, the Heavenly Palace shattered, and he opened his eyes to find himself back inside the tall tower.<br/><br/>He looked up at his head, only to see a body condensing within the fireball above, curled up and unrecognizable for the moment.<br/><br/>The ninth Lifespirit Treasure!<br/><br/>Fang Wang suddenly realized that the ninth treasure was none other than his physical body!<br/><br/>He closed his eyes and looked toward the Treasured Spirit Space, seeing his own silhouette appear in a notch, situated amongst the other eight Lifespirit Treasures.<br/><br/>At the same time.<br/><br/>Outside the high tower, within a golden column of light more than a hundred zhang in diameter, instead of ascending dragons, a terrifying figure began to rise slowly.<br/><br/>That was the figure of the True God of the Heavenly Palace, clad in armor, wearing a dragon helmet, with divine flames fluttering like phoenix wings.<br/><br/>Through the golden column of light, no one could see his true face, but just the sight of this figure was enough to inspire awe in anyone.<br/><br/>“What is that?” Guang Mengwang’s eyes widened in astonishment as he exclaimed.<br/><br/>Hong Xian’er was also shocked, instinctively fearing that something was about to happen to Fang Wang.<br/><br/>At that moment, Xiao Zi’s voice rang out, “Don’t worry, my young master is fine; just watch what happens next.”<br/><br/>With the Soul-Binding Curse in place, it could sense its master’s safety.<br/><br/>At this moment, Fang Wang was not injured or under attack, instead, his aura was surging!<br/><br/>Boom—<br/><br/>Suddenly, thunder roared in the sky, followed by a storm cloud that swept in from the horizon, changing the weather dramatically and causing anxiety among the Cultivators by the lake.<br/><br/>Before they could discuss what was happening, a downpour began!<br/><br/>The heavy rain fell on the great formation created by the Cultivators under Guang Mengwang’s command, creating ripples as if the firmament itself were undulating, a magnificent sight to behold.<br/><br/>This rainstorm covered the entire Human Emperor Continent, but it affected only the Human Emperor Continent.<br/><br/>Emperor Donggong stood in front of the Imperial Palace gate, watching this apocalyptic downpour, and muttered to himself, “The Nine Lives Precious Spirit has emerged, the heavens and earth wail; this young man has truly awakened his talents.”<br/><br/>“What a pity, it’s a bit late. My own tribulation is likely imminent,” he added.<br/><br/>He raised his hands and continued his spell, manipulating the fate of the Grand Yu Divine Dynasty, shielding this display of Heavenly Might from beyond the continent. From now on, only the creatures of this continent would know of these events—anymore, any being not from this continent would forget everything upon leaving.<br/><br/>This was one of the Divine Skills from the Mie Jue Divine Tome, the Extinction Memory!<br/><br/>Elsewhere.<br/><br/>Within the high tower, the fireball above Fang Wang’s head descended, and the body within it fused with his own. He then stood up, his body’s flames gradually solidifying into the armor of the True God of the Heavenly Palace.<br/><br/>Now, his figure was identical to the enormous figure inside the golden column of light atop the tower!\t\t\t\t\t\t</div>", "images": {}, "success": true}