{"id": 274, "url": "https://www.novelhall.com/i-became-an-immortal-on-mortal-realm-32879/14597398.html", "title": "Chapter 274 - Chapter 274: Chapter 271: True God Of The Heavenly Palace, The Power Of The Heavenly Palace Halberd", "volume": 3, "volume_title": "Volume 3", "body": "<h1>Chapter 274 - Chapter 274: Chapter 271: True God Of The Heavenly Palace, The Power Of The Heavenly Palace Halberd</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 274: Chapter 271: True God of the Heavenly Palace, The Power of the Heavenly Palace Halberd<br/><br/>Translator: 549690339<br/><br/>The Heavenly Palace was silent as Fang Wang confronted the mysterious figure radiating strong light.<br/><br/>Fang Wang discovered that he temporarily couldn’t leave the Heavenly Palace, nor could he ascertain the situation with Spiritual Refinement.<br/><br/>It seemed that to leave, he first had to understand the figure in front of him.<br/><br/>Fang Wang took a step forward, and almost simultaneously, the mysterious figure also took a step, mimicking his action with exactly the same speed.<br/><br/>Fang Wang’s right foot involuntarily stopped mid-air, and the other did the same.<br/><br/>This made Fang Wang frown. Could the other party be a manifestation of his mirror image?<br/><br/>Whilst Fang Wang was puzzled, the strong light from the mysterious figure suddenly burst apart, sending a violent surge of air toward Fang Wang.<br/><br/>Boom!<br/><br/>Fang Wang was forced to slide backward, shaking the entire Heavenly Palace violently.<br/><br/>He squinted his eyes, and upon closer examination after the strong light dispersed, he saw the mysterious figure’s true face. It was exactly like his own, except for the fact that it was clad in dark golden chainmail, with a shoulder guard like a dragon’s head and a belt like python scales. Bracers and boots twinkled with extraordinary divine light, and the helmet’s dragon horns emitted two golden flames resembling fluttering phoenix wings.<br/><br/>The armored Fang Wang raised his right hand, and surprisingly, a Heavenly Palace Halberd materialized in it.<br/><br/>Fang Wang, robed in white, resembled a mortal ascetic who had attained the Dao, while this mysterious Fang Wang appeared like a War God from The Upper Realm, exuding an aura that commanded respect from all.<br/><br/>The mysterious Fang Wang slowly raised his chin, showing a defiant smile, looking down on Fang Wang, and said, “You have cultivated too many supreme arts, neglecting your own strength. To create your ninth Lifespirit Treasure and break free from your own shackles, you must first defeat me.”<br/><br/>Clang!<br/><br/>He fiercely planted the Heavenly Palace Halberd into the ground, waves of visible shock rapidly expanded, causing an instant change in the environment within the Heavenly Palace. In the blink of an eye, they found themselves upon a vast and boundless land.<br/><br/>The Firmament was so blue, and the distant mountains rose and fell unevenly, with the grass and flowers at Fang Wang’s feet swaying gently in the wind.<br/><br/>Fang Wang looked at the mysterious Fang Wang, fearless, and softly asked, “Then please enlighten me. However, how should I address you?”<br/><br/>The mysterious Fang Wang raised his halberd, pointed it at Fang Wang, tilted his head with a smile, and said, “I’m also called Fang Wang, or you can call me the True God of the Heavenly Palace.”<br/><br/>The True God of the Heavenly Palace?<br/><br/>Fang Wang raised an eyebrow, but before he could contemplate further, the True God of the Heavenly Palace suddenly stepped forward, and with that single step, a thousand miles of land shattered.<br/><br/>Almost instantaneously, Fang Wang instinctively flew backwards, only to see the tip of the True God of the Heavenly Palace’s halberd mere centimeters from his face.<br/><br/>As he flew backwards, Fang Wang’s right hand conjured up a Heavenly Palace Halberd, and Divine Nurturing Sword Qi burst forth from his eyes.<br/><br/>The True God of the Heavenly Palace turned his head to dodge the Divine Nurturing Sword Qi.<br/><br/>Everything happened too quickly. In just a brief two breaths, the two traversed thousands of miles. Dust and stones flew up as they passed, reaching the sky.<br/><br/>Fang Wang gripped his Heavenly Palace Halberd and swung it down furiously. When the halberds collided, the resulting shockwaves pulverized the surrounding mountains.<br/><br/>Their gazes locked, eyes turning sharp and fierce.<br/><br/>Heart of the Heavenly Dao!<br/><br/>Almost simultaneously, both their auras erupted. Fang Wang’s Heavenly Gang Supreme Yang Saint Body ignited, ripping his white robe and revealing his robust physique. The thirty-six Heavenly Gang Star Acupoints on his upper body appeared, with Yang Energy flames spilling out from them, wrapping his entire being in blazing flames, his aura losing nothing to that of the armored True God of the Heavenly Palace.<br/><br/>With a focused look in his eyes, Fang Wang let the Divine Nurturing Sword Qi merge into his body and charged towards the True God of the Heavenly Palace.<br/><br/>The True God of the Heavenly Palace did the same, and the two collided rapidly, alternating positions and halberd shadows. The halberd glowed, and from a distance, the sky seemed to explode continually. Their presence made the earth tremble and mountains collapse.<br/><br/>As Fang Wang’s consciousness battled within the Heavenly Palace, his aura began to emanate, causing the tower where he was undertaking Spiritual Refinement to tremble.<br/><br/>Guang Mengwang, Hong Xian’er, and Xiao Zi stood by the lake, looking up at the golden column of light above the tower. The golden light shone on their faces, casting a play of light and shadows.<br/><br/>Inside the golden column of light, dragons rose one after another, merging into the sea of clouds and disappearing without end.<br/><br/>The howling wind startled the mountains and forests around the great lake, prompting Guang Mengwang’s cultivators to fly out from their caves and gather around the lake.<br/><br/>“What’s going on? Such a terrifying pressure!”<br/><br/>“That’s the Spirit Sculpting Tower. Could someone be undergoing Spiritual Refinement?”<br/><br/>“With such an impressive display, could it be that another unprecedented talent has been born?”<br/><br/>“The prince is also here, so it should be fine. It’s probably a prodigy fostered by the prince.”<br/><br/>“Tch, the prodigies emerging in the world today are one more exaggerated than the next. With such a display, what grade of Lifespirit Treasure do you think this person will create?”<br/><br/>The cultivators discussed this above the lake, with a few Great Cultivators flying toward Guang Mengwang to inquire about the situation.<br/><br/>Guang Mengwang simply stated that someone was undergoing Spiritual Refinement and did not disclose their identity.<br/><br/>As Fang Wang’s aura grew more and more exaggerated, Guang Mengwang couldn’t contain himself and began ordering his subordinates to form arrays to isolate his villa.<br/><br/>The wind blew through his hair as he stared intently at the golden column of light atop the Spirit Sculpting Tower, filled with anticipation.<br/><br/>He began to admire Emperor Donggong.<br/><br/>If such a genius were to die under the oppression of the seven clans, it would indeed be a loss to the mortal world.<br/><br/>Now, Fang Wang was alive and revealing even greater talents, making Guang Mengwang confident in him.<br/><br/>Perhaps their Hong Family could truly rely on Fang Wang to get through this calamity!<br/><br/>Hong Xian’er, however, hadn’t thought that far ahead. She watched the golden column of light while pondering her own Dao.<br/><br/>She was competitive by nature, so seeing Fang Wang becoming stronger didn’t discourage her, but rather, bolstered her fighting spirit.<br/><br/>She didn’t want to lose to anyone, even Fang Wang, whose prospects seemed out of reach for now!<br/><br/>Boom! Boom! Boom!<br/><br/>The sound of thunder continuously resounded as Fang Wang, bare-chested, wielded the Heavenly Palace Halberd with the Mie Jue Divine Tome floating behind his head, his body ablaze with golden flames. As he swung the Heavenly Palace Halberd, a cold gleam shot from his eyes, tracing two curved lines of light.<br/><br/>The True God of the Heavenly Palace likewise brandished the Heavenly Palace Halberd, but he did not deploy the Mie Jue Divine Tome. From beginning to end, he relied only on the Heavenly Palace Halberd and his physical strength.<br/><br/>Fang Wang realized the Heavenly Palace Halberd in his opponent’s hands was more powerful than his own.<br/><br/>After half an hour of combat, neither could gain the upper hand, regardless of the Divine Skills Fang Wang unleashed, the True God of the Heavenly Palace was either fast enough to dodge or could counter with his formidable physical strength and the divine power of the Heavenly Palace Halberd.<br/><br/>Fang Wang suddenly became aware that he had been neglecting his study of the Heavenly Palace Halberd.<br/><br/>He had always known the Heavenly Palace Halberd was his strongest Lifespirit Treasure, containing unimaginable power, yet he was so immersed in various peerless techniques that he had overlooked focusing on the Heavenly Palace Halberd.<br/><br/>Could the appearance of the True God of the Heavenly Palace be a reminder of this?<br/><br/>Fang Wang thrust his halberd forward, and nine Black Dragons appeared out of thin air, ferociously attacking the True God of the Heavenly Palace.<br/><br/>The True God of the Heavenly Palace bent at the waist and swung his halberd, a terrifying surge of energy sweeping across the firmament like an ocean wave, forcefully scattering the nine Black Dragons. Fang Wang held the halberd with one hand in front of him, using his Spiritual Power to resist.<br/><br/>The golden flames trailing behind him stretched a hundred zhang, making Fang Wang appear as if he were cloaked in an imposing golden cape.<br/><br/>The True God of the Heavenly Palace once again approached Fang Wang. His strikes with the Heavenly Palace Halberd were no longer chaotic but became orderly, one move flowing into the next, increasingly rapid and powerful.<br/><br/>As Fang Wang countered each move, he was shocked to feel his Heavenly Gang Supreme Yang Tyrant Body’s blood and Qi shuddering.<br/><br/>Since achieving the Heavenly Gang Supreme Yang Tyrant Body, it was the first time Fang Wang had felt such a sensation.<br/><br/>The power of the Heavenly Palace Halberd was injuring his physique!<br/><br/>Though the impact was minor, such power made Fang Wang even more interested in the Heavenly Palace Halberd.<br/><br/>“If this is all you’ve got, you’re going to die. Don’t think just because it’s only your consciousness inside the Heavenly Palace that as long as I extinguish you, I can replace your will and become a brand new you!”<br/><br/>The True God of the Heavenly Palace sneered with a ferocious smile, another sweep of his halberd slicing through ten thousand li of the heavens, unstoppable.<br/><br/>Fang Wang unleashed Jiuyou Zizaishu, directly moving through the force of the Heavenly Palace Halberd, as he stabbed toward the True God’s halberd.<br/><br/>This was his first time using Jiuyou Zizaishu. The True God of the Heavenly Palace, taken aback, was struck by Fang Wang and sent tumbling away.<br/><br/>Fang Wang pursued, continuing the attack.<br/><br/>This battle was longer than he had imagined.<br/><br/>Day after day passed.<br/><br/>Even with the upper hand, Fang Wang could not kill the True God of the Heavenly Palace in one strike.<br/><br/>The True God of the Heavenly Palace was the same. Both revealed completely different physiques, Fang Wang with powerful blood and Qi, while the True God of the Heavenly Palace possessed endless Spiritual Power.<br/><br/>In the blink of an eye.<br/><br/>A month passed.<br/><br/>They were still engaged in fierce battle, the area having turned into a desolate wasteland of chaos, the world around them dim, their figures relentlessly shimmering, darting ceaselessly.<br/><br/>Up to this point, Fang Wang had come to rely solely on his physical strength for combat. Having used his other Lifespirit Treasures to no avail against the True God of the Heavenly Palace, and with his Spiritual Power drained, he had no choice but to engage in a grueling battle with the Heavenly Palace Halberd.<br/><br/>Fang Wang was not impatient; instead, his heart fell into a state of lucid emptiness.<br/><br/>The True God of the Heavenly Palace, rapidly swinging his halberd, seemed to sense Fang Wang’s inner peace, his lips curving into a slight smile.<br/><br/>The True God of the Heavenly Palace kept quiet, focusing on the fight.<br/><br/>Time continued to rush by.<br/><br/>Month after month passed.<br/><br/>The altitude of Fang Wang and the True God of the Heavenly Palace’s battle steadily declined. After an unknown period, they lost the ability to fly, confined to ground combat on the shattered earth. Their speed in swinging the halberds remained unaffected, fierce and rapid, too fast for ordinary eyes to follow.<br/><br/>Clang!<br/><br/>Their halberds clashed once more, and this time, both came to a halt.<br/><br/>Fang Wang looked at the True God of the Heavenly Palace and slowly asked, “If I were to stop, would this battle also cease?”<br/><br/>The True God of the Heavenly Palace sneered, “You know the peculiar nature of the Heavenly Palace. No matter how long passes here, it’s but a moment outside. Do you want to stop?”<br/><br/>Fang Wang did not respond; instead, he swung his halberd once more, demonstrating his resolve through action.<br/><br/>The great battle continued!<br/><br/>Fang Wang closed his eyes, feeling the Heavenly Palace Halberd intently, fighting on instinct.<br/><br/>The True God of the Heavenly Palace didn’t disturb him with words, engaging him silently.<br/><br/>As time kept slipping by, Fang Wang gradually entered a state of self-forgetfulness.<br/><br/>One year!<br/><br/>Five years!<br/><br/>Ten years!<br/><br/>A hundred years!<br/><br/>Suddenly, Fang Wang felt as if he had stepped into the void, stumbling slightly, then opened his eyes to find himself back inside the Heavenly Palace, his body free from exhaustion and his Spiritual Power fully restored.<br/><br/>He looked ahead, and the True God of the Heavenly Palace was watching him, the Heavenly Palace Halberd by his side, a wisp of strange white vapor swirling around the weapon.<br/><br/>Fang Wang similarly placed his Heavenly Palace Halberd on the ground and asked the True God of the Heavenly Palace, “Who are you, exactly? And what is the origin of the Heavenly Palace?”<br/><br/>The True God of the Heavenly Palace lifted his chin, regaining his haughty demeanor. He looked down at Fang Wang with a smile and said, “I am you.”\t\t\t\t\t\t</div>", "images": {}, "success": true}