{"id": 289, "url": "https://www.novelhall.com/i-became-an-immortal-on-mortal-realm-32879/14820307.html", "title": "Chapter 289 - Chapter 289 Chapter 286: The Most Difficult Secret Techniques Of The Twelve Dao Sects", "volume": 3, "volume_title": "Volume 3", "body": "<h1>Chapter 289 - Chapter 289 Chapter 286: The Most Difficult Secret Techniques Of The Twelve Dao Sects</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 289 Chapter 286: The Most Difficult Secret Techniques of the Twelve Dao Sects<br/><br/>“May I ask which Great Emperor has reincarnated?” Fang Wang looked at the Ghost Emperor and inquired, his face showing no sign of emotional fluctuations.<br/><br/>The Ghost Emperor answered, “His name cannot be spoken directly as it would be taboo. It won’t be long before he comes to challenge you. If you defeat him, he will acknowledge you as his master.”<br/><br/>Fang Wang thought for a moment and said, “Then I accept.”<br/><br/>No matter what, if it could ensure a better reincarnation for his parents, then taking on the cause and effect of a Great Emperor was of no concern – besides, this might not necessarily be a bad thing.<br/><br/>The Ghost Emperor spoke no more and his figure disappeared into the darkness, as if he had never been there.<br/><br/>Fang Wang shifted his gaze back to his parents’ tombstones, reflecting on his life during the first sixteen years of this incarnation.<br/><br/>Even after more than fifty thousand years in the Heavenly Palace, the memories of his childhood in Southern Hills City remained crystal clear.<br/><br/>Fang Wang also thought of his parents from his previous life.<br/><br/>How many farewells had been buried in the mortal world’s incessant toils?<br/><br/>Though Fang Wang felt a slight regret and melancholy, he was not saddened, for as one of the living, it was natural for him to forge ahead with vigor.<br/><br/>And so he did.<br/><br/>Fang Wang stayed by the graves for seven days and seven nights before he returned to Sword Heaven Marsh.<br/><br/>As soon as he was back in Sword Heaven Marsh, Dugu Wenhun sought him out, pulling him into a pavilion where Hong Chen and Song Jinyuan were waiting.<br/><br/>“Now that Wangdao is initially established, we do not expect you to manage everything, but the basic framework of Wangdao must be set,” Dugu Wenhun said earnestly.<br/><br/>Fang Wang took a seat, looked at the three of them, and asked, “Do you have any good suggestions? Since we are not establishing a sect, our hierarchy should be different from theirs.”<br/><br/>Song Jinyuan began to make suggestions, and Fang Wang listened intently.<br/><br/>Dugu Wenhun closed the door, sat next to Fang Wang, and occasionally interjected, while Hong Chen sipped tea silently, never speaking.<br/><br/>After listening for a while, Fang Wang realized the proposals of Dugu Wenhun and Song Jinyuan were merely other sects’ structures by different names, fundamentally no different.<br/><br/>Once the two had finished, Fang Wang pondered and said, “The titles at various levels are not an issue, as long as they align with Wangdao. You’re right, when there are many people, absolute equality is not possible. I intend to establish the Twelve Dao Sects of Wangdao. The Twelve Dao Sects of Wangdao will hold a status equivalent to that of a Deputy Dao Master. The Deputy Dao Masters can summon the Twelve Dao Sects to act, and the Twelve Dao Sects also have the power to refuse. Every hundred years, all cultivators in the sect can gather at Kunlun. Every member has the right to veto. If a Golden Immortal is rejected by fifty percent of the disciples, they will be stripped of their Golden Immortal status. If more than twenty percent reject, I will personally investigate that Golden Immortal’s life and deeds.”<br/><br/>Deputy Dao Master!<br/><br/>Twelve Dao Sects!<br/><br/>Veto power!<br/><br/>Dugu Wenhun and Song Jinyuan were stunned, and Hong Chen looked up, her eyes filled with surprise.<br/><br/>Song Jinyuan furrowed his brow and said, “This may not be a good idea. If the middle and lower layers have veto power, they might become tools for internal strife within the sect. Any faction or kingdom, if populous enough, will eventually see internal conflicts.”<br/><br/>Fang Wang replied, “It’s difficult to find a perfect solution in the world, but at least I can ensure that every disciple in Wangdao has their own power, no matter how insignificant. I believe the combined strength of people’s wills can be very powerful.”<br/><br/>Dugu Wenhun asked, “Is the veto power only for the Twelve Dao Sects?”<br/><br/>“Yes, that’s enough. Too many checks and balances would be counterproductive,” Fang Wang replied softly.<br/><br/>Hong Chen couldn’t help but say, “Such a decision could indeed lead Wangdao down a unique path. But how do we select the Twelve Dao Sects?”<br/><br/>Fang Wang answered, “There’s no rush to choose the Twelve Dao Sects. I will decide on them one by one.”<br/><br/>Hong Chen said, “If that’s the case, I can craft dao tokens of different grades for Wangdao. It will require a considerable expenditure…”<br/><br/>Fang Wang raised his hand and said, “I will take out all the Spirit Stones and Spiritual Energy Pills I currently have and contribute seventy percent of the resources.”<br/><br/>Dugu Wenhun laughed and said, “Rest assured, over the years, Sword Heaven Marsh has accumulated a considerable foundation, thanks to your reputation. We have countless who come bearing gifts and wanting to support our influence.”<br/><br/>Creating a Dao is not something you can achieve simply by paying lip service to it; taking disciples naturally involves a commitment and an expenditure, not to mention that the construction of Kunlun itself is a time-consuming and costly major project.<br/><br/>The four of them delved into a detailed discussion on the resources needed for founding their own Dao. Adding up the costs, Fang Wang realized that being powerful didn’t mean he could casually start a sect. Recruiting disciples wasn’t difficult, but supporting them was.<br/><br/>Hong Chen was also prepared to impart teachings to the disciples entering the Dao and to establish a set of Daoist cultivation techniques unique to Wangdao, with the intention of Fang Wang adding his own secret techniques to it later.<br/><br/>Fang Wang found that Hong Chen really knew a lot; he had knowledge in every aspect and even assured that he could teach the relevant spells.<br/><br/>Intelligence, communication, sealing, inheritance, formations, and so on – Hong Chen had his own set of spells to pass down in each category.<br/><br/>However, Fang Wang had not yet seen Hong Chen’s spells or divine skills, and he was not sure of their effectiveness.<br/><br/>The more Hong Chen boasted, the less at ease Fang Wang felt.<br/><br/>After a long while, Fang Wang asked Dugu Wenhun and Song Jinyuan to leave, wishing to spend time alone with Hong Chen.<br/><br/>“Senior,” Fang Wang began.<br/><br/>Hong Chen said, “Since you are the Dao Master and I am your subordinate, you should no longer address me as senior. It could affect your governance. From now on, just call me Hong Chen.”<br/><br/>After considering for a moment, Fang Wang said, “I hear you possess countless Daoist techniques. Could you possibly transmit one to me? The more difficult, the better.”<br/><br/>Hong Chen had promised to support him fully!<br/><br/>He wanted to see just how far this full support extended.<br/><br/>Hong Chen replied calmly, “Do you really want the more difficult, the better?”<br/><br/>Fang Wang smiled and said, “Actually, my intention is to test your limits. This way, you can also gauge mine.”<br/><br/>After thinking for a bit, Hong Chen asked, “Which type of Daoist technique would you like to learn?”<br/><br/>“Anything is fine; I just want the most difficult one,” Fang Wang answered, prompting Hong Chen to narrow his eyes.<br/><br/>Hong Chen suddenly laughed, “In that case, I will transmit to you a supreme technique that even I have not mastered.”<br/><br/>Upon hearing this, Fang Wang raised an eyebrow and asked, “Could it perhaps be a technique from The Upper Realm?”<br/><br/>Hong Chen shook his head, “Hmm, it’s something I acquired while roaming the myriad worlds during my time as the Heaven Emperor. It’s called the Immeasurable Pure Bone Technique. Once mastered, the bones throughout one’s body can transform into Immaculate Dao Bones.”<br/><br/>Immeasurable Pure Bone Technique!<br/><br/>Fang Wang knew at once that it sounded like a body cultivation technique and became immediately interested.<br/><br/>Compared to flashy divine skills, he preferred the direct approach of overpowering strength!<br/><br/>If he could kill with a single punch, he really didn’t want to unsheathe his sword!<br/><br/>Moreover, the Heavenly Palace Halberd’s power was related to physical strength; the stronger the body, the more power the halberd could exert.<br/><br/>Without hesitation, Fang Wang said, “Alright, transmit it to me now.”<br/><br/>He was already eager to become stronger.<br/><br/>Increase in cultivation level might be hard to achieve rapidly, but a transformation in the body could lead to a qualitative change. This was indeed why Fang Wang could fight across two major realms.<br/><br/>Hong Chen gave him a profound look and began to recite the technique.<br/><br/>The first sound was incomprehensible to Fang Wang; Hong Chen was not speaking the language of the Mortal Realm. Just as Fang Wang began to frown, he suddenly started to understand Hong Chen’s words.<br/><br/>It was still not the mortal tongue, but as it came from Hong Chen’s mouth, Fang Wang could understand.<br/><br/>Impressive!\t\t\t\t\t\t</div>", "images": {}, "success": true}