{"id": 287, "url": "https://www.novelhall.com/i-became-an-immortal-on-mortal-realm-32879/14820003.html", "title": "Chapter 287 - Chapter 287 Chapter 284 Hope For Instruction", "volume": 3, "volume_title": "Volume 3", "body": "<h1>Chapter 287 - Chapter 287 Chapter 284 Hope For Instruction</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 287 Chapter 284 Hope for Instruction<br/><br/>Hong Chen’s words were very pessimistic, exuding an aura of death as if he had endured countless hardships and held no hope for anything.<br/><br/>Fang Wang was not angry, he stared at Hong Chen and said, “If Senior truly thought so, you probably wouldn’t have come to find me.”<br/><br/>Hong Chen looked steadily at Fang Wang, seemingly lost in thought.<br/><br/>Hongxuan Emperor did not interject again; he quietly awaited Hong Chen’s decision.<br/><br/>His expression was full of meaningful subtlety, with a reminisce flashing in his eyes.<br/><br/>Hong Chen spoke, “I can help you establish the sect, but I shall not partake in fate, hold any power, nor resolve any conflicts for you. If, after five hundred years, your sect still exists, then I shall enter the fray and help you build the foremost sect in the world.”<br/><br/>Hearing such boldness from the other party, a new idea suddenly occurred to Fang Wang, he couldn’t help but ask, “Do you know of Jin Xiao Sect?”<br/><br/>Hong Chen replied calmly, “I’m not obliged to assist anyone, going through birth, old age, sickness, and death, passing on, living a plain life is also fine.”<br/><br/>Hongxuan Emperor hastily said, “Kid, stop thinking about that woman. This one is a Heaven Emperor, it’s always been him picking people. His choice of you means you are already the most outstanding person of this era. Jin Xiao Sect doesn’t have this fortune, and Zhou Xue aimed for ascension, which contradicts the philosophy of Heaven Emperor.”<br/><br/>Upon listening, Fang Wang felt it made sense.<br/><br/>He then asked, “May I ask Senior, what should my sect be called? What do I need to prepare?”<br/><br/>Hong Chen didn’t respond; instead, he raised his right hand, stretched out two fingers, dipped them briefly into the alcohol, and then flicked them across the tabletop.<br/><br/>“Look at it,” Hong Chen said quietly.<br/><br/>Fang Wang involuntarily turned his gaze to the tabletop where the alcohol began to flow and actually gathered into three characters.<br/><br/>Greed!<br/><br/>Heaven!<br/><br/>Dao!<br/><br/>Fang Wang frowned.<br/><br/>Hong Chen said, “Choose one of these three characters as the name of your sect. These are three characters tied to your destiny. Choose wisely, for the name will set the fate of your sect.”<br/><br/>Hongxuan Emperor remarked with amazement, “Greed is indeed fitting; you’re always thinking of protecting everyone around you and absurdly aiming to master all the ultimate teachings. As for Heaven and Dao, even more so, proclaiming the Heavenly Dao, undertaking the deeds of Heavenly Dao, truly audacious.”<br/><br/>Suddenly, Fang Wang reached out, swiping his hand across the table, yet the characters on the tabletop didn’t change.<br/><br/>Hong Chen said, “This is a kind of destiny art that reveals the Dao you pursue in your life. These Daos are not imposed by me, they are your own. Unless you can convince yourself right now that you have an entirely new Dao, they won’t change, won’t increase, and surely won’t decrease.”<br/><br/>Fang Wang’s eyes shifted, he activated his Tianling Body, and swiped again.<br/><br/>Almost instantaneously, Hong Chen’s pupils contracted sharply.<br/><br/>As Fang Wang waved his hand, the three characters on the table merged into one.<br/><br/>Hope!<br/><br/>The Hongxuan Emperor’s eyes went wide, his expression one of utter disbelief.<br/><br/>Fang Wang spoke up, “Let’s call it the Hope Sect. It will aim for what people aspire to in life, for the other shore of cultivation. All beings have their hopes, and this sect will be where followers cultivate to realize their own hopes while shouldering the hopes of all beings.”<br/><br/>Hong Chen appeared somewhat lost in thought, gazing at the character on the table, muttering, “Hoping for what people aspire to in life, for the other shore of cultivation…”<br/><br/>“How… How did you do it?” Hongxuan Emperor asked with wide eyes, his voice trembling.<br/><br/>Fang Wang reverted to his Heavenly Gang Supreme Yang Tyrant Body, silently watching Hong Chen.<br/><br/>Hong Chen looked up at Fang Wang, his eyes ablaze, “There’s no need to wait five hundred years; I’ll support you with all my strength.”<br/><br/>At those words, Hongxuan Emperor looked incredulously towards Hong Chen, exclaiming, “Old man! You inspected me for a thousand years, and even when I became an emperor, you were still not satisfied, you never spoke of fully supporting me!”<br/><br/>“You’re different from him; you’re too ordinary.”<br/><br/>“What? I, the Hongxuan Emperor, ordinary?”<br/><br/>Hongxuan Emperor felt like he’d been struck by lightning, his face turning red with anger.<br/><br/>Ignoring him, Hong Chen’s intense gaze fixed on Fang Wang, he said, “I never expected the legend to be true… indeed, my fate was not to perish!”<br/><br/>“What legend am I part of?” Fang Wang asked.<br/><br/>Hong Chen shook his head and said, “Heavenly secrets must not be revealed. Some words, once spoken, can invite calamity. It’s better for you not to know.”<br/><br/>Fang Wang asked, “If you intend to assist me, may I inquire as to what you seek?”<br/><br/>Hong Chen countered, “Given that you know I am the Heaven Emperor and are aware of my current plight, what do you think I desire?”<br/><br/>“Revenge?”<br/><br/>“Hmm, as long as you continue to grow stronger, sooner or later you will confront The Upper Realm, and the hatred between the two worlds has already reached an irreconcilable stage, so my vengeance aligns with the path you tread.”<br/><br/>“I’m not afraid. If that’s the case, then thank you for your support. Could you tell me what I need to prepare if I wish to establish a sect?”<br/><br/>While asking, Fang Wang poured another drink for Hong Chen.<br/><br/>He had learned in the Grand Yu Divine Dynasty that when a fate of a sect or a great teaching is established, various ceremonies are held to gather the fate of heaven and earth and partake in the creation of all things.<br/><br/>Hong Chen replied, “You need not do anything special. Just proclaim the declaration of the establishment of your sect. What you said earlier can serve as the words of the sect’s foundation. Focus on your Cultivation, I will aid you. Is that young man named Dugu Wenhun supposed to be your deputy sect leader?”<br/><br/>“Correct, elder, I’m sorry, I’ve already made a promise to him… ”<br/><br/>“No need for explanations. I have no interest in the position of deputy sect leader; I only need to work from the shadows.”<br/><br/>Hong Chen waved his hand, his words tinged with a hint of admiration.<br/><br/>Afterward, Fang Wang sought advice from Hong Chen on the matter of establishing a sect.<br/><br/>Hong Chen recounted the various sects he had seen, as if telling mythical tales, enthralling Fang Wang.<br/><br/>The Hongxuan Emperor stood by, lost in a daze.<br/><br/>An hour later.<br/><br/>The three of them walked out of the attic. Fang Wang excused himself with a word to Hong Chen, then left alone.<br/><br/>The Hongxuan Emperor, without a farewell, staggered toward the lakeside.<br/><br/>Unknowingly, the Hongxuan Emperor found himself at the edge of the lake, sitting on a stone in a daze.<br/><br/>“Hey, Xiao Kuang, what did Fang Wang just talk to you about?” Gu Tianxiong came over, curiously asking.<br/><br/>This fellow was considered an old-timer at Sword Heaven Marsh, and by virtue of his brotherly relationship with Fang Wang, his status was extraordinary, even with his modest Cultivation.<br/><br/>The Hongxuan Emperor came back to his senses and took a deep breath, “Have you ever heard of the legend of the Hongxuan Emperor?”<br/><br/>Gu Tianxiong raised an eyebrow, “The Hongxuan Emperor of Emperor Sea? Of course, I have heard of him. The Great Emperor who established the Imperial Dao fifty thousand years ago, what about it? You’re thinking of learning the Hongxuan Emperor’s legacy? It’s a coincidence, Brother Fang knows how to do so. If you wish to learn, he would probably teach you.”<br/><br/>Upon hearing this, the Hongxuan Emperor couldn’t help feeling dejected and curiously asked, “If you know Fang Wang is willing to teach so many unique skills, why don’t you seek his guidance? Isn’t fishing all day boring for you?”<br/><br/>“With my mediocre aptitude, what’s there to learn? Why waste the precious time of life? When looking back at the end, all I’d see is the tedium of Cultivation; that’s simply too meaningless,” Gu Tianxiong said with a wave of his hand.<br/><br/>The Hongxuan Emperor looked at him with newfound respect, not expecting such open-mindedness.<br/><br/>The Hongxuan Emperor then asked, “Since you’ve heard of the Hongxuan Emperor, what do you think of his aptitude? Was it ordinary?”<br/><br/>“Ordinary? It depends on who you compare him to. After all, he was a Great Emperor. Even if ordinary, he can’t be that ordinary.”<br/><br/>“What about compared to Fang Wang?”<br/><br/>“Well, that’s definitely ordinary. Compared to Brother Fang, what’s the Hongxuan Emperor? Can the light of a grain of rice dare to compete with the Bright Moon?”\t\t\t\t\t\t</div>", "images": {}, "success": true}