{"id": 283, "url": "https://www.novelhall.com/i-became-an-immortal-on-mortal-realm-32879/14819099.html", "title": "Chapter 283 - Chapter 283 Chapter 280: Not Necessarily More Knowledgeable About This Technique Than Me", "volume": 3, "volume_title": "Volume 3", "body": "<h1>Chapter 283 - Chapter 283 Chapter 280: Not Necessarily More Knowledgeable About This Technique Than Me</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 283 Chapter 280: Not Necessarily More Knowledgeable About This Technique Than Me<br/><br/>“The Lifespirit Treasure transformed from a Great Saint’s very own? Could it be housing the remnant soul of the Great Saint?” Fang Wang asked, uninterested in the Magical Artifact.<br/><br/>He possessed nine Lifespirit Treasures and had no need for Magical Artifacts; he only wanted to pursue the ultimate techniques of the world, then merge them into his own Heavenly Dao Method.<br/><br/>Hong Xian’er replied, “Indeed, it’s the transformation after the Great Saint achieved transcendence. When a Saint Treasure is born, its Precious Spirit emerges with entirely new spiritual intelligence. So far, I haven’t heard of any Great Saint using a Saint Treasure to seize and inhabit the bearer.”<br/><br/>Fang Wang shook his head, “Forget it, I’m not interested. If you want to go, then go ahead.”<br/><br/>After all, Hong Xian’er was of the Sky-Stepping Realm, the most talented woman in a hundred thousand years. Provided she wasn’t besieged by the major Saint Clans, she was essentially invincible, especially since she was merely going to the vicinity of the Human Emperor Continent. Should any trouble arise, Fang Wang could act in time to help.<br/><br/>Hong Xian’er looked at him steadily and sighed, “That’s true. With your talent, you wouldn’t covet a Saint Treasure. It seems like you’ve never even used a Magical Artifact; instead, you always use your own Precious Spirits. I envy you—if one were to create nine different types of Precious Spirits with the Nine Lives Precious Spirit, indeed there’d be no need for Magical Artifacts.”<br/><br/>Fang Wang smiled, “I actually think you don’t need them either.”<br/><br/>“I still have to go, even if I myself don’t fancy it. It could be left for the Grand Yu Divine Dynasty. Ever since the Emperor Father passed away, quite a number of old monsters left the Divine Dynasty. On the surface, it doesn’t seem to have affected the Grand Yu Divine Dynasty, but in reality, the top-notch power has diminished by nearly half,” Hong Xian’er sighed.<br/><br/>Fang Wang had no words of comfort to offer, so he could only wish her success.<br/><br/>Hong Xian’er started discussing matters of cultivation with Fang Wang. She had not yet given up on the Formless Zhou Tian Technique, despite its complexity. Defiant, she was determined to master it and, in her spare time, she would study the Formless Zhou Tian Technique.<br/><br/>Fang Wang patiently guided her, sharing his understanding of the Formless Zhou Tian Technique. Just a few words from him benefited her immensely. After less than half an hour of conversation, she excitedly took her leave.<br/><br/>Before departing, she excitedly said, “Fang Wang, you’re a true genius. If the creator of this technique met you, they would surely want you as a disciple.”<br/><br/>Fang Wang watched her leaving figure and thought to himself: “Perhaps the one who created the Formless Zhou Tian Technique doesn’t understand it better than I do.”<br/><br/>Then, Fang Wang continued his cultivation.<br/><br/>If he could breakthrough to the Divine Passage Realm before leaving the Grand Yu Divine Dynasty, that would be the best!<br/><br/>At midday, the sun shone brightly over a mansion.<br/><br/>In a small pavilion, two individuals sat opposite each other, drinking tea—one of them was none other than Daoist Master Chunqiu from Emperor Sea.<br/><br/>Daoist Master Chunqiu picked up his teacup and blew on the steam rising from it, his posture casual.<br/><br/>Sitting opposite him was an elderly man, with the visage of a youthful old man, curved spine, holding a cane even while seated.<br/><br/>“Daoist Master, it seems Fang Wang has no intention of leaving. If he doesn’t go away, won’t our opportunity never come?” the elderly man asked, his voice raspy.<br/><br/>Daoist Master Chunqiu smiled and said, “Fang Wang’s fate is already set. To succeed, we indeed must avoid his edge. Nevertheless, the tribulation of the Grand Yu Divine Dynasty will come sooner or later, and if the tribulation is grave enough, Fang Wang might not be able to handle it.”<br/><br/>The old man narrowed his eyes and inquired, “What kind of tribulation is it? What can an old man like me do?”<br/><br/>Daoist Master Chunqiu said, “Just watch and wait. Entering the game too early will only make it harder to extricate oneself. After all, Fang Wang is the biggest variable. Throughout history, there haven’t been many like him—every one of them has succeeded. Either they become the mightiest Great Saint in the Mortal Realm or ascend to The Upper Realm to become rulers of the heavens. Facing Fang Wang, you must always keep a heart wary of defeat; the moment you let your guard down, you’ll only harm yourself.”<br/><br/>The elderly man laughed bitterly, “How would I dare to compete with him? It’s just that he insists on protecting the Grand Yu Divine Dynasty, and that makes me anxious.”<br/><br/>“Forget about me; many Holy Clans and Imperial Clans are also watching with bated breath. For four thousand years, Emperor Donggong has oppressed us terribly. There is so much hatred to be vented. If Fang Wang truly shoulders everything for Emperor Donggong, how could we be satisfied?”<br/><br/>Daoist Master Chunqiu did not respond, and he set down his teacup, dipping his right index finger into the water. Then he wrote on the tabletop, and where the tea traced, golden characters miraculously appeared.<br/><br/>The elder peered closely and read aloud, “Pure Yang…”<br/><br/>“There’s no end to it.”<br/><br/>Daoist Master Chunqiu spoke, causing the elder to halt.<br/><br/>The elder furrowed his brows, lost in troubled thought.<br/><br/>After a few moments, as if struck by a sudden realization, the elder’s eyes went wide with excitement and he asked, “Could it be that he… he’s actually still alive?”<br/><br/>Daoist Master Chunqiu said with profound meaning, “You should be clear about his grudges with Emperor Donggong.”<br/><br/>The elder revealed a smile, expressing his feelings, “It is still the Daoist Master with vast divine skills; this old man does not know how to repay you. May I ask, Master, in aiding the many Holy Clans with their troubles and difficulties, what is it you seek?”<br/><br/>“Of course, this old man is not questioning you, but if I do not reciprocate, my heart will not be at peace.”<br/><br/>Daoist Master Chunqiu laughed and said, “All I desire is to make this Mortal Realm stronger. Who says the Holy Clans can’t surpass their ancestors? To me, the Holy Clans are the likeliest to give birth to Great Saints, after all, the bloodline of a Great Saint is right there, and the imprint of a Great Saint is branded within your blood.”<br/><br/>These words filled the elder with immense respect towards him, and with hands quivering, the elder lifted his hand to pour tea for him.<br/><br/>The second year after Hong Xian’er had left, Fang Wang felt a strong aura of combat from the north, but since he did not sense any presence stronger than Hong Xian’er, he remained indifferent.<br/><br/>In the third year, a great battle erupted in the Sky-Stepping Realm in the north, shaking the earth and heavens.<br/><br/>In the fourth year, Fang Wang felt an immense oppressive force, even with his current level of cultivation, he was startled, and it must have been a Saint Treasure.<br/><br/>It wasn’t until the fifth year that Hong Xian’er returned.<br/><br/>“It infuriates me, these Holy Clans are shameless!” Hong Xian’er, sitting at the table, slammed her hand down in anger and began cursing the Holy Clans.<br/><br/>Fang Wang, who was meditating on the bed, heard the names of many Holy Clans and opened his eyes. He saw Hong Xian’er with her cheeks puffed up, red with anger, and it was difficult to imagine she was a Great Cultivator of the Sky-Stepping Realm.<br/><br/>Fang Wang chuckled softly, “Didn’t you beat them till they were miserable?”<br/><br/>He had sensed Hong Xian’er’s battles before, when she was surrounded by five Sky-Stepping Realm cultivators. Despite being only at the first tier of the Sky-Stepping Realm, Hong Xian’er still had the upper hand. It was only difficult for her to end the battle since other cultivators from different realms had taken the Saint Treasure away.<br/><br/>With annoyance, Hong Xian’er said, “This time they could send five Sky-Stepping Realm cultivators to surround me, next time they will surely send ten or even more. In my view, the Saint Treasure is just a decoy, they’re testing my strength, testing the limits of the Grand Yu Divine Dynasty.”<br/><br/>Fang Wang couldn’t help but view her in a new light; this girl was not as careless as she appeared to be on the surface, but rather clear-headed.<br/><br/>“No worries, if there is a next time, I will fight alongside you. No matter how many come from the Sky-Stepping Realm, we will kill them all, how about that?” Fang Wang said with a smile.<br/><br/>Upon hearing this, Hong Xian’er immediately showed a look of satisfaction. Throwing an appreciative glance at Fang Wang, she added, “It was not in vain that I risked my life to seize a secret technique for you.”<br/><br/>She raised her right hand, and out of thin air, a piece of beast skin appeared in her palm.<br/><br/>“This is a secret technique from the master of that Saint Treasure, found within the secret realm where the Saint Treasure was located, placed in the same great hall. It must be extraordinary,” Hong Xian’er explained while tossing the beast skin to Fang Wang.\t\t\t\t\t\t</div>", "images": {}, "success": true}