{"id": 285, "url": "https://www.novelhall.com/i-became-an-immortal-on-mortal-realm-32879/14819589.html", "title": "Chapter 285 - Chapter 285 Chapter 282: Kunlun Formation, Fang Wang Returns", "volume": 3, "volume_title": "Volume 3", "body": "<h1>Chapter 285 - Chapter 285 Chapter 282: Kunlun Formation, Fang Wang Returns</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 285 Chapter 282: Kunlun Formation, Fang Wang Returns<br/><br/>Hearing Hong Xian’er’s words, Fang Wang couldn’t help but twitch the corner of his mouth, feeling both touched and a bit pained.<br/><br/>“No need to rush like that. Cultivation is more important. Learning too much all at once can actually hinder the improvement of your cultivation level,” Fang Wang said earnestly.<br/><br/>He appeared to be only three hundred and twelve years old, but in fact, he had already lived for fifty-four thousand years.<br/><br/>Looking over the Mortal Realm, he suspected that he was the longest-living person there.<br/><br/>Those deceased Great Saints don’t count; they are just lingering souls, nothing more.<br/><br/>Hong Xian’er nodded with a smile, but she snorted in her heart and cursed silently, “Damn man, dodging my hand!”<br/><br/>She continued to seek clarification on her confusions about the Lingxiao Divine Sect, and Fang Wang answered seriously. During this process, she made many attempts to latch onto Fang Wang’s arm, but he skillfully avoided her each time.<br/><br/>Gradually, Hong Xian’er started to get serious, attempting to grasp him as he dodged, and soon the two began to move about continuously.<br/><br/>While guiding her in the way of the Lingxiao Divine Sect, though Fang Wang couldn’t make her grasp it fully in a short period, he could help her catch the feeling of it, which would be beneficial to her future cultivation.<br/><br/>The Lingxiao Divine Sect’s technique was not just a mere movement skill; it was also a comprehensive Escape Skill, and if it were only about speed, then one would still be far from mastering the Lingxiao Divine Sect.<br/><br/>After sparring like this for several days, Hong Xian’er finally left, and Fang Wang moved around the Grand Yu Divine Dynasty.<br/><br/>Since Emperor Donggong’s fall, the Grand Yu Divine Dynasty hadn’t faced major turmoil, but there were frequent cases of oppression, which was far from the peaceful times of the past.<br/><br/>As Fang Wang traveled, he helped those in need whenever he saw injustice, without deliberately concealing his name.<br/><br/>Thus, the various deeds of Pilgrimage Fang Wang, acting chivalrously, spread throughout the Grand Yu Divine Dynasty, making the citizens feel even closer to him.<br/><br/>Before he knew it,<br/><br/>two years had passed, and it was only then that Fang Wang returned to Pilgrimage Manor. After two years of relaxation, his mood had returned to what it was initially.<br/><br/>Upon his return, he saw Zhui Feng right away.<br/><br/>Zhui Feng approached him and said, “Pilgrimage, the teleportation formation between the Grand Yu Divine Dynasty and Sword Heaven Marsh has been completed. Would you like to give it a try?”<br/><br/>Upon hearing this, Fang Wang immediately nodded and said, “Let’s go, lead the way.”<br/><br/>He followed by sending a message to Xiao Zi, who quickly flew over, leaped the courtyard wall, and landed on his shoulder.<br/><br/>The teleportation formation was built within the Imperial Palace to prevent unrelated people from using this Formation to enter Sword Heaven Marsh and cause trouble. Fang Wang understood the emperor’s intention; placing it in the Imperial Palace meant that in the future, his Kunlun would be the trump card of the Grand Yu Divine Dynasty.<br/><br/>One must say, this emperor indeed had daring plans. On the surface, he showed no apprehension toward Fang Wang and seemed not to fear that Fang Wang might become an enemy in the future.<br/><br/>After entering the Imperial Palace, Fang Wang saw that the number of Palace Maidens, guards, and eunuchs was plentiful, more lively than during Emperor Donggong’s era.<br/><br/>All along the way, Fang Wang received much attention, as people in the palace seemed to recognize him.<br/><br/>Zhui Feng noticed Fang Wang’s perplexity and explained with a smile, “Last year, when you exorcised demons at the ancient lake, you saved a person among them who was recognized as a painting saint of the Grand Yu Divine Dynasty. He captured your likeness in a painting, and the emperor felt it was very lifelike. He chose one and had it copied by the tens of thousands and posted it throughout every city of the Grand Yu Divine Dynasty. His Majesty said that the people of the Grand Yu must know the face of the Pilgrimage, to prevent any ignorant person from offending you.”<br/><br/>Fang Wang commented with a sigh, “His Majesty is indeed thoughtful.”<br/><br/>Truth be told, he had only seen the emperor Hong Shou a handful of times, and it was mostly Hong Shou visiting him with a very humble posture, leaving Fang Wang with nothing to complain about.<br/><br/>Under Zhui Feng’s guidance, Fang Wang and Xiao Zi arrived at a square where they found guards in attendance, each with an extraordinary presence.<br/><br/>Fang Wang saw the teleportation formation situated on a stone platform, with three massive stone pillars arranged in a triangle. Each pillar was embedded with various colored Spirit Stones and covered in dense, esoteric runes.<br/><br/>Seen from afar, this nearly hundred-foot-tall formation was quite magnificent—it could become a landmark in any city of Grand Qi, famous throughout the world.<br/><br/>“This formation can teleport thirty people at once. It is up to you to name it,” Zhui Feng said.<br/><br/>Fang Wang pondered for a moment then said, “Let’s call it the Kunlun Formation.”<br/><br/>Zhui Feng, hearing this, showed delight in his eyes and quickly shouted, “Engrave a stele, name it the Kunlun Formation!”<br/><br/>No sooner had the words been spoken than a stone stele rose in front of the formation’s steps, and the surface immediately bore three red characters.<br/><br/>Kunlun Formation!<br/><br/>The characters were as red as blood, gleaming under the sunlight.<br/><br/>Fang Wang and Zhui Feng continued forward, and at that moment, a figure appeared beside Fang Wang, accompanying him.<br/><br/>It was the Hongxuan Emperor.<br/><br/>“I heard you’re returning to Kunlun; take me with you, I’d like to go back and take a look as well,” the Hongxuan Emperor said with a smile.<br/><br/>In his years at the Grand Yu Divine Dynasty, he had become the master of the next crown prince and held great influence in the court, held in high esteem by Emperor Hong Shou.<br/><br/>Fang Wang gave a slight nod without saying much.<br/><br/>Soon, Fang Wang, Xiao Zi, and the Hongxuan Emperor stood within the Kunlun Formation. Zhui Feng clapped his hands, and dozens of figures appeared outside the formation. They all cast their spells and activated the Kunlun Formation.<br/><br/>Fang Wang also wanted to experience the strength of the Grand Yu Divine Dynasty’s formation skills.<br/><br/>Boom, boom, boom—<br/><br/>The platform trembled, and the three giant pillars accumulated a great force of Spiritual Power. The overwhelming pressure alarmed all the Cultivators and transformed monsters within the Imperial City.<br/><br/>Fang Wang estimated that the combined Spiritual Power harnessed by these guards was almost on par with the Spell strength of a Divine Passage Realm Great Cultivator.<br/><br/>It seemed that achieving long-distance teleportation was not so simple after all.<br/><br/>The three giant pillars burst out into brilliant light, and the figures of Fang Wang, the Hongxuan Emperor, and Xiao Zi disappeared within the glow.<br/><br/>At the same time.<br/><br/>Grand Qi, Sword Heaven Marsh.<br/><br/>Boom!<br/><br/>Countless cultivators turned their heads, only to see a stupendous light rising from the side of a lake in Sword Heaven Marsh, piercing through the sea of clouds and forming a vast and spectacular vortex of air currents.<br/><br/>Gu Tianxiong, with half-white hair, turned his head to look, a look of excitement flashing across his face as if he thought of something. He immediately threw down his fishing rod and stood up, quickly walking towards the distant pillar of light.<br/><br/>“Old Gu, not fishing anymore?” an old man couldn’t help but ask.<br/><br/>Without turning his head, Gu Tianxiong waved his hand and said, “Fishing my ass, without using Spiritual Power, I can’t catch anything at all. These beasts are almost becoming cunning!”<br/><br/>The other sword cultivators on the lake were curious about the origin of the light pillar, but this was Sword Heaven Marsh, where masters were as common as clouds, and it was the safest place in Grand Qi, so they were not alarmed in the slightest.<br/><br/>Meanwhile, in front of a group of pavilions, a gigantic light pillar connected heaven and earth, making the land tremble and the strong winds howl, with the surrounding pavilions shaking.<br/><br/>Song Jinyuan, Dugu Wenhun, The Three Immortals of the Emperor Sea, and others appeared one after another in front of the light pillar, all showing looks of excitement.<br/><br/>“Is Master coming back?”<br/><br/>Chu Yin appeared beside Dugu Wenhun and asked nervously.<br/><br/>Dugu Wenhun laughed and said, “Who else but him can use the Formation of the Grand Yu Divine Dynasty?”<br/><br/>At that moment, a colorful halo suddenly appeared at the top of the giant light pillar, descending from the sky at tremendous speed, crashing into the base of the Formation light pillar and unleashing a powerful presence from within the pillar that made everyone raise their arms to guard against it.<br/><br/>The bright light quickly dissipated, and two figures appeared within the Formation, one of whom had a Purple Dragon on his shoulder.<br/><br/>“Pretty fast, not bad.”<br/><br/>Fang Wang’s light laughter sounded, his tone filled with praise.<br/><br/>The voice of the Hongxuan Emperor followed, “Such a long distance, and still so fast, and the stability of the Formation is not bad either. It seems the Grand Yu Divine Dynasty really put in some effort, and they didn’t let you down.”<br/><br/>When everyone opened their eyes and saw Fang Wang clad in a pristine white garment, they all became excited.<br/><br/>Fang Wang stepped down from the stairway and greeted with a smile, “My friends, it’s been a while, how have you been?”<br/><br/>Everyone immediately surrounded him, talking nonstop.<br/><br/>The Three Immortals of the Emperor Sea were already noisy enough, and with the addition of Chu Yin and Zhu Yan, it became even noisier. Dugu Wenhun and Song Jinyuan stood to the side, smiling without saying anything.<br/><br/>“Senior!”<br/><br/>Yang Du descended from the sky, rushing excitedly towards Fang Wang, trying to push through The Three Immortals of the Emperor Sea, but his cultivation was not enough.<br/><br/>Old friends like Fang Bai, Qu Xunhun, Gu Tianxiong and others also arrived one after another, making the open space in front of the Kunlun Formation lively.<br/><br/>Fang Wang was not the least bit annoyed and laughed as he interacted with them.<br/><br/>Everyone could not see through Fang Wang’s cultivation, their intuition told them that Fang Wang was no longer the same, and seeing him treating them as before, the worries and pressures in their hearts immediately dissipated.<br/><br/>“Let’s go, let’s talk inside, and by the way, try the fine wine I’ve brewed over the years,” Song Jinyuan said with a smile, looking at Fang Wang with curiosity in his eyes, wondering about Fang Wang’s experiences over the years.<br/><br/>Fang Wang nodded and walked with everyone towards a nearby pavilion.<br/><br/>Elsewhere.<br/><br/>Several miles away, on a large rock by the lake, two figures sat in meditation, one elderly and the other young and handsome. They were Hong Chen and Lü Xianming.<br/><br/>Gazing into the distance, Lü Xianming murmured, “Could it be that he has returned? Why can’t I feel his presence.”<br/><br/>He was once the number one genius of the Emperor Sea. When Fang Wang ventured into the Emperor Sea Mysterious Dynasty alone to avenge his brother, Lü Xianming, who was a guest at the dynasty, joined in the encirclement against Fang Wang and ended up being kicked and disabled by Fang Wang.<br/><br/>That battle completely changed Lü Xianming’s life.<br/><br/>Thinking of Fang Wang made Lü Xianming very nervous, not knowing whether Fang Wang would accept him.<br/><br/>His intuition told him that Fang Wang probably did not even remember him.<br/><br/>“He has already transcended destiny; even the Immortal Gods in heaven cannot sense him, let alone you,” Hong Chen spoke up, his gaze fixed on the fishing rod in his hand.<br/><br/>He was dressed in a deep blue Dao Robe, with disheveled hair and a face that bore the marks of time, giving the impression of someone serious and unsmiling.<br/><br/>Lü Xianming turned to look at him and asked, “The Immortal Gods in heaven can’t sense him? How do you know that?”<br/><br/>Hong Chen did not respond again.<br/><br/>Inside the pavilion, after half an hour of drinking with old friends, Fang Wang began to recount his experiences over the years.<br/><br/>Fang Wang spoke lightly, but as everyone put themselves in his shoes, they felt despair and secretly admired him.<br/><br/>Only he could have fought his way out of such dire straits and even buried the seven Great Saint Clans in the end.<br/><br/>After a while.<br/><br/>Fang Wang finished recounting his experiences and inquired about the situation in Sword Heaven Marsh.<br/><br/>Song Jinyuan gave him a brief overview and said, “Fang Wang, now that there are so many cultivators in Sword Heaven Marsh, just taking in Sword Servants is no longer enough to resolve the situation. What do you think about establishing a sect to prepare for Kunlun’s future? An old senior once said that if Kunlun wants to become the premier holy land under heaven, it must be supported by a sect and also…”<br/><br/>He relayed Hong Chen’s proposal.<br/><br/>Fang Wang listened attentively, and after he finished, he asked curiously, “Who is this senior? Is he still in Sword Heaven Marsh?”\t\t\t\t\t\t</div>", "images": {}, "success": true}