{"id": 286, "url": "https://www.novelhall.com/i-became-an-immortal-on-mortal-realm-32879/14819590.html", "title": "Chapter 286 - Chapter 286 Chapter 283: Heaven Emperor, Nine-Faced Divine Luo_1", "volume": 3, "volume_title": "Volume 3", "body": "<h1>Chapter 286 - Chapter 286 Chapter 283: Heaven Emperor, Nine-Faced Divine Luo_1</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 286 Chapter 283: Heaven Emperor, Nine-Faced Divine Luo_1<br/><br/>“He calls himself Hong Chen and is still in Sword Heaven Marsh. He said he wants to meet you, and if you can satisfy him, he will assist you in establishing the most powerful sect in the world,” Song Jinyuan said.<br/><br/>The Hongxuan Emperor, who had been silent and drinking alone, voiced his surprise.<br/><br/>Fang Wang glanced at him, and Dugu Wenhun followed up by saying, “This Senior Hong Chen is no ordinary figure, with unfathomable cultivation and even the ability to divine fate. If we can keep him, it would be a great help to our future sect.”<br/><br/>Gu Tianxiong sneered and said, “He’s all mystical and cryptic. When he met me before, he even said I was truly blessed with good fortune, that I should have died long ago. It made me want to punch him!”<br/><br/>Hearing this, Fang Wang raised an eyebrow, becoming even more curious about Hong Chen.<br/><br/>If it weren’t for Fang Wang’s presence in this life, Gu Tianxiong would have brought disaster upon his clan in Sword Heaven Marsh and died long ago. From this perspective, Hong Chen indeed seemed to possess the ability to know fate.<br/><br/>The Hongxuan Emperor raised an eyebrow but remained silent.<br/><br/>One by one, people began sharing their own interactions with Hong Chen, and everyone’s opinion of him grew even higher.<br/><br/>Fang Wang joked, “If I were to bring Hong Chen into the sect, whom should I give the position of deputy sect leader to?”<br/><br/>Dugu Wenhun replied earnestly, “I’d be willing to yield it to him. The sect you establish is sure to possess the greatest destiny in the mortal realm, and as long as one has influence within the sect, they are certain to rise high.”<br/><br/>Seeing his seriousness, Fang Wang couldn’t help but shake his head and smile.<br/><br/>“In that case, I’ll meet him. Who will go call him over?” Fang Wang asked.<br/><br/>Song Jinyuan immediately took on the errand and quickly left the house.<br/><br/>The others began to inquire about the name of Fang Wang’s sect.<br/><br/>Fang Wang pondered the issue as well.<br/><br/>Indeed, it was time to establish a sect. Only then could he better protect the people around him and cultivate in peace.<br/><br/>In the future, he could join forces with the Jin Xiao Sect. With their two sects united, they could dominate the world together and relieve Zhou Xue of some pressure.<br/><br/>Fang Wang wasn’t worried that doing so would cause him to drift apart from Zhou Xue. He had already discussed this topic with her, and Zhou Xue supported his decision to establish a sect. Since Zhou Xue would eventually ascend with the Jin Xiao Sect, if he wished to stay in the mortal world, he would need to have his own sect to protect the Fang Family for generations to come.<br/><br/>Choosing a name, though, was a delicate matter and required careful consideration!<br/><br/>Before long, Song Jinyuan returned, followed by Hong Chen.<br/><br/>Upon seeing Hong Chen, the Hongxuan Emperor was visibly moved, his brows furrowing deeply.<br/><br/>Fang Wang said, “You may all leave now. I will speak with Xiao Kuang and Senior Hong Chen.”<br/><br/>The others didn’t overthink it, considering that the Hongxuan Emperor represented the Jin Xiao Sect, the relations with Fang Wang being unquestionable.<br/><br/>Soon, only the three of them remained in the grand hall, even Xiao Zi left with the others.<br/><br/>Fang Wang smiled and said, “Senior, please take a seat.”<br/><br/>Hong Chen walked to the table, lifting his garment hem and sat down.<br/><br/>Fang Wang took a new cup and poured wine for him.<br/><br/>The Hongxuan Emperor said, “Should I address you as Heaven Emperor?”<br/><br/>Heaven Emperor?<br/><br/>Fang Wang was surprised inwardly, but his expression remained impassive.<br/><br/>Throughout the ages, myths have been countless, with Great Saints, Great Emperors, Immortal Gods appearing in various versions. But to be called Heaven Emperor, that suggests one is the chief among Immortal Gods.<br/><br/>Hong Chen took the cup Fang Wang handed to him and said, “If you still recognize that, you may call me by it.”<br/><br/>“Tsk, tsk, are you still alive today, or have you already reincarnated?” the Hongxuan Emperor asked curiously.<br/><br/>Hong Chen replied, “Even in the vast Celestial Qiankun, it is very difficult for a physical body to live up to fifty thousand years; besides, I have not reached that level. Since we parted, I have reincarnated twenty-five times.”<br/><br/>The Hongxuan Emperor marveled, “Though it is reincarnation, the fact that you can always awaken your true self-consciousness, isn’t that equivalent to being immortal?”<br/><br/>“It’s merely a curse, and not the blissful eternity that you mortals yearn for.”<br/><br/>Hearing Hong Chen’s answer, the Hongxuan Emperor turned to Fang Wang, teasingly asked, “I call him a Heaven Emperor, aren’t you surprised? I guess you must be astonished, just holding it in and pretending to be calm.”<br/><br/>Fang Wang laughed and said, “Naturally, but I can’t show weakness in front of my seniors, right?”<br/><br/>The Hongxuan Emperor had a knowing look on his face as he raised an eyebrow at Hong Chen and said, “I’ll tell you, this young man is much more formidable than I am. You should take a good look. I disappointed you back then, but this young man might be able to help you break the curse. And he is very wary of The Upper Realm, having inherited the legacies of many Great Saints. I would bet that you have never met a talent like him.”<br/><br/>After listening, Hong Chen remained indifferent and said, “Fang Wang, three hundred and twelve years old, second layer of the Heaven-Breaking Realm, indeed quite rare to encounter, but I have met talents even stronger than him.”<br/><br/>“Is that so?”<br/><br/>“Thirty thousand years ago, I took on a disciple, born with nine Lifespirit Treasures, not needing realm advancement to forge the treasures anew. He reached the seventh layer of the Heaven-Breaking Realm at the age of three hundred and achieved the status of a Great Saint before a thousand years had passed. He ascended as a Great Saint to The Upper Realm and became a person highly valued by the Immortal Court Heaven Emperor.”<br/><br/>“Oh? That powerful?”<br/><br/>The Hongxuan Emperor was visibly moved and stroked his chin in deep thought.<br/><br/>Fang Wang too hadn’t expected that there once was such a genius; he was amazed…<br/><br/>And still not the strongest talent?<br/><br/>Although realm is not the only measure of strength, the scale of the other’s talent still surprised Fang Wang.<br/><br/>Suddenly, the Hongxuan Emperor thought of something, his eyes widening as he cursed angrily, “Could it be that most faithful dog of the Immortal Court Heaven Emperor, the Nine-Faced God Luo?”<br/><br/>Hong Chen remained silent.<br/><br/>The Hongxuan Emperor spat out in contempt, “Damned thing! No wonder that guy has been after me all this time. So there was this cause and effect!”<br/><br/>Hong Chen looked at Fang Wang and asked, “What is your ambition? I want to hear it from your own mouth.”<br/><br/>Fang Wang answered, “In the mortal world, to integrate all paths into a unique Immortal Law, to preach to the multitude of living beings, to provide the world with truly beneficial Immortal Gods.”<br/><br/>“For the mortal world? You don’t desire to ascend and become one of those immortals?”<br/><br/>“So far, I haven’t seen any acts of The Upper Realm’s Immortal Gods; they seem more like arrogant beings claiming to be Immortal Gods. In my view, the world needs its own Immortal Gods, or rather, every living being can become gods and immortals.”<br/><br/>Fang Wang replied with sincerity, for that was indeed how he felt.<br/><br/>The Hongxuan Emperor opened his mouth, instinctively wanting to scoff, but he already had some understanding of Fang Wang. Fang Wang was indeed generous, and would offer guidance to anyone who sought his teachings.<br/><br/>The Sword Cultivators within Sword Heaven Marsh, even newcomers, could retrieve Fang Wang’s Swordsmanship within Sword Heaven Marsh, and the essence of Fang Wang’s Sword Intent was ever-present for others to comprehend.<br/><br/>Even his most prized Heavenly Emperor Imperial Mirror, Fang Wang dares to impart freely to others. The Hongxuan Emperor was almost furious when he learned of it but felt consoled after calming down.<br/><br/>Hong Chen, looking at Fang Wang, said softly, “In the past, there were others who thought as you do, but after witnessing the might of The Upper Realm’s Immortal Gods and facing their recruitment, all bowed their heads.”<br/><br/>“The way of The Upper Realm has always been to first bring you to despair, make you submit, and then consider whether to recruit you.”<br/><br/>Fang Wang responded, “I have never been someone willing to submit. If it comes down to it, I’d rather die.”<br/><br/>The Hongxuan Emperor nodded and said, “I actually believe him when he says that; this kid really is that kind of person. The things he’s done, he’s faced oppression with no fear of life and death, going into battle with that mindset.”<br/><br/>Hong Chen shook his head and said, “Since ancient times, those who become Saintly Emperors share mostly the same experiences, but it is precisely because they’re undefeated that when they realize their own insignificance, they become vulnerable. You are strong now, but it doesn’t necessarily mean you will remain so. The stronger you get, the more responsibilities you bear, the less able you are to accept failure.”\t\t\t\t\t\t</div>", "images": {}, "success": true}