{"id": 288, "url": "https://www.novelhall.com/i-became-an-immortal-on-mortal-realm-32879/14820004.html", "title": "Chapter 288 - Chapter 288 Chapter 285: Pioneering The Way, The Reincarnation Of The Great Emperor", "volume": 3, "volume_title": "Volume 3", "body": "<h1>Chapter 288 - Chapter 288 Chapter 285: Pioneering The Way, The Reincarnation Of The Great Emperor</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 288 Chapter 285: Pioneering the Way, the Reincarnation of the Great Emperor<br/><br/>The sunlight was brilliant, and the peaks of Kunlun Mountain lay across the sky like a wall beside Sword Heaven Marsh.<br/><br/>Figures hovered in the air, and the lakeside was also filled with people’s silhouettes, with exclamations sounding from time to time. One could see Fang Wang floating in mid-air, his left hand behind his waist and his right hand using a finger as a sword, constantly changing sword techniques.<br/><br/>With each flick of his finger, a figure formed of Sword Qi in front of him would mimic the movement with a sword strike, the techniques alternating between fierce and graceful.<br/><br/>Hong Chen, Hongxuan Emperor, Gu Tianxiong, Yang Du, Chu Yin, Zhu Yan, Lü Xianming, Fang Bai, and so forth, all Cultivators from Sword Heaven Marsh, were gathered here. Looking out, it was impossible to count how many were present.<br/><br/>Although Lü Xianming did not practice swordsmanship, he could tell that the swordplay demonstrated by Fang Wang was very ordinary, but it carried an indescribable mystery.<br/><br/>Yang Du stood amidst the crowd, boasting about the past war of the seven tribes, and the people around were utterly fascinated, with occasional echoes of agreement from those who had once been prisoners of the tribes.<br/><br/>Hong Chen and Dugu Wenhun stood shoulder to shoulder, looking up at Fang Wang.<br/><br/>“After establishing the sect, you’ll need to organize people specifically for gathering intelligence from around the world. At that time, I will teach them some escape skills and divination techniques. There are many watching our Sect Hierarch, and someone even approached me for inheritance, aiming to oppose Fang Wang,” Hong Chen said.<br/><br/>Upon hearing this, Dugu Wenhun frowned and asked, “Did you give it to him?”<br/><br/>Hong Chen calmly replied, “Mhm, I gave the lad the Ancestral Summoning Technique, causing a rift between him and his disciple. After this tribulation, one of them will inevitably die, and the survivor will hardly emerge for centuries.”<br/><br/>Dugu Wenhun grew even more curious and pressed, “Who were they?”<br/><br/>“I’ll tell you later.”<br/><br/>“Had you decided to assist Fang Wang even before coming to Sword Heaven Marsh?”<br/><br/>“Mhm.”<br/><br/>Dugu Wenhun couldn’t help but feel sad for that master and disciple, yet at the same time, he was exhilarated. With such a powerful ally planning for Fang Wang, the road ahead could only be smoother!<br/><br/>Hong Chen continued to instruct on the subdivision of branches after establishing the sect and the direction of the sect’s rules, with Dugu Wenhun listening attentively.<br/><br/>Hong Chen wasn’t just offering suggestions; he was even prepared to pass on techniques to various branches of the Wangdao, some of which simply mentioning their uses excited Dugu Wenhun.<br/><br/>Fang Wang dissected the Sword Dao and sword techniques he knew into simple and understandable moves, which impressed many high-level Cultivators, who admired him even more.<br/><br/>Tian Dao Fang Wang truly had the demeanor of a grandmaster!<br/><br/>To make the difficult art easy to understand, which is the hardest!<br/><br/>After a long while.<br/><br/>Fang Wang sheathed his sword and turned to look over everyone by the lakeside, slowly saying, “I hear many hope that I will establish a sect. Initially, I was resistant, feeling that it’s nice for one to be free, but after some experiences, I realized that there are things one person alone can’t accomplish.”<br/><br/>Founding a sect!<br/><br/>At these words, all the Cultivators became excited. Most of those remaining in Sword Heaven Marsh had come admiring Fang Wang and naturally hoped he would found a sect to undertake a grand cause with them!<br/><br/>“I will establish a sect in Kunlun, named after aspiration. It will be guided by the directions one hopes to take in life, and by the distant shores one seeks in Cultivation. Those who join must pursue their own aspirations but also must not fail the hopes of all beings. Cultivators should not only seek for themselves but also bear the righteousness of Immortals.”<br/><br/>As Fang Wang spoke, he looked around at all the Cultivators in Sword Heaven Marsh.<br/><br/>Hearing Fang Wang’s words, many Cultivators wavered. To take on the great responsibility of the world clearly meant following the righteous path; not every Cultivator aspired to righteousness—”good” and “evil” were ambiguous terms in the Cultivation World.<br/><br/>What Cultivator doesn’t live for themselves? Given a chance to turn their fortunes, they would risk even threats of heavens’ wrath.<br/><br/>While some were uncertain, naturally, there were also those who were hopeful.<br/><br/>Fang Wang continued, “I was initially opposed to founding a sect and calling it Wangdao, but now, seeing everyone here, I suddenly feel that being confined by the name of a sect can become a cliché. The sect I want to create, although it carries great meaning, will not have so many rigid rules or absolute hierarchies.”<br/><br/>“I hope that those who join can exchange Taoist teachings amicably, without hoarding knowledge, and collectively seek to forge a path of Immortal Law.”<br/><br/>“This significance deviates from that of a sect; it resembles more a gathering of like-minded individuals. It would be better to create a path instead—let’s rename the Wangdao to Wangdao, about aspiration!”<br/><br/>“Throughout history, there have been teachings and dynasties associated with fate, but there has never been a path of fate.”<br/><br/>“Today, I, Fang Wang, will be the first to forge a new path, create a Dao!”<br/><br/>Boom!<br/><br/>As Fang Wang’s words fell, the entire Sword Heaven Marsh was invigorated.<br/><br/>So were those who had been wavering.<br/><br/>Since ancient times, all pioneers could etch their names in history forever, much more so for Fang Wang, who strides as the world’s foremost genius. His bold declaration might very well succeed!<br/><br/>Standing by the lakeside, Hong Chen gently stroked his beard and smiled as he praised, “He’s quite remarkable, carving out a new path. It may seem like merely a change of title, but if he succeeds, the implications will be altogether different.”<br/><br/>Dugu Wenhun laughed and said, “Of course, no matter the era, he would be the most dazzling and exceptional presence.”<br/><br/>Inside Sword Heaven Marsh, shouts rose wave upon wave, deafening, ultimately converging into two unanimous words.<br/><br/>Wangdao!<br/><br/>“Whoever wishes to join the Dao, can seek out Dugu Wenhun. You shall all join me in building Kunlun, building Wangdao!”<br/><br/>Fang Wang spoke again and then vanished into the air.<br/><br/>Though he disappeared, the uproar within Sword Heaven Marsh grew more intense.<br/><br/>Fang Wang went directly to Southern Hills City, using the powers of the Lingxiao Divine Sect to cross the vast territory of the Grand Qi in what seemed like an instant.<br/><br/>Compared to several decades ago, Southern Hills City had undergone significant changes. Its territory had expanded manyfold. Fang Wang arrived at a cemetery – it was the Fang Family’s burial ground, part of Southern Hills City’s forbidden lands, heavily guarded, and only Fang Family members were permitted entry.<br/><br/>With Fang Wang’s capabilities, he naturally reached the place unnoticed.<br/><br/>He soon stood before his parents’ tombstones, silent and motionless.<br/><br/>Sunset gave way to moonrise, and night fell.<br/><br/>Fang Wang’s figure did not move, his gaze fixed continuously on the tombstones.<br/><br/>When the time was unknown, Fang Wang finally shifted his gaze to the side.<br/><br/>Under the nearby tree, there were no figures, not even an insect.<br/><br/>Fang Wang’s eyes seemed to pierce through the barrier between yin and yang, seeing into the Underworld where a dark and mysterious figure stood under the tree, less than two zhang away.<br/><br/>Seeing this figure, Fang Wang instantly thought of the Ghost Emperor.<br/><br/>The former Ghost Emperor exuded an imposing aura with an overwhelming presence. This Ghost Emperor was almost the same height as him, making for a very different visual impact.<br/><br/>“Ghost Emperor?” Fang Wang asked softly.<br/><br/>“Many years have passed, and you haven’t disappointed me with your growth,” came the reply.<br/><br/>“Thank you for the compliment, Your Majesty.”<br/><br/>“Do you feel regret for your parents?”<br/><br/>“What do you mean, Your Majesty?”<br/><br/>“I can ensure your parents are reborn into a good life. Though the coming era is a golden age, it will be fraught with calamities. If they are not reborn well, it would be the darkest of times for them.”<br/><br/>“What would I need to give in return?”<br/><br/>Fang Wang asked calmly, not angered by the veiled threat.<br/><br/>The Ghost Emperor stared at Fang Wang and said, “I wish to recommend someone to you, a reincarnation of a Great Emperor. Let him join your Wangdao. I originally intended to nurture him to become an emperor once more, but I have changed my mind. Let him follow you. Only you can command him, and he will become your most distinguished force.”\t\t\t\t\t\t</div>", "images": {}, "success": true}