{"id": 280, "url": "https://www.novelhall.com/i-became-an-immortal-on-mortal-realm-32879/14775994.html", "title": "Chapter 280 - Chapter 280: Chapter 277 Pilgrimage To The Heavenly Dao", "volume": 3, "volume_title": "Volume 3", "body": "<h1>Chapter 280 - Chapter 280: Chapter 277 Pilgrimage To The Heavenly Dao</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 280: Chapter 277 Pilgrimage to the Heavenly Dao<br/><br/>Heavenly Emperor of the Mortal Realm?<br/><br/>Upon hearing Fang Wang’s words, the faces of the Escaping Land Immortal and the Thunder-Holding Immortal turned extremely ugly. Especially as more and more spectators arrived, they knew Fang Wang was doing this intentionally.<br/><br/>Now they could neither retreat nor fight, trapped in a dilemma.<br/><br/>Fang Wang could guess the agony in their hearts, but he remained indifferent, allowing the ghostly spirits to continue their assault.<br/><br/>If he wanted to kill these two, they wouldn’t last more than ten breaths. He simply wanted to show the world his strength, to let everyone know that even without Emperor Donggong, there was still him, Fang Wang!<br/><br/>Hong Chen kept his eyes fixed on the battle ahead. He didn’t issue any commands and seemed lost in thought.<br/><br/>The million soldiers behind him couldn’t hide their fear. Their morale plummeted. Facing such an opponent, they saw no hope of victory.<br/><br/>The generals also withheld orders, as they could tell Fang Wang harbored no intent to kill.<br/><br/>Watching the Escaping Land Immortal and the Thunder-Holding Immortal, one could see they were not weak. In fact, they were terrifyingly strong. Their Divine Skills and Spells were beyond comprehension, possessing immense destructive power, capable of flattening mountains and splitting lakes with ease. Yet, within Fang Wang’s mysterious Formation, all their efforts seemed futile.<br/><br/>More and more Great Cultivators from the Grand Yu Divine Dynasty arrived, as did spies from various powers outside the mainland. They all wanted to gauge the true extent of Fang Wang’s strength.<br/><br/>The matter of the Seven Clans had already spread throughout the Eastern Mortal Realm. Fang Wang’s name had also entered the sights of various great powers in the Eastern Mortal Realm. All the great powers felt that Fang Wang had grown strong, but nobody knew just how much.<br/><br/>“What kind of Divine Skills is this? How can he be so enormous?”<br/><br/>“Before coming here, his presence was completely undetectable. Who would have thought he could have… surely it surpasses five thousand zhang?”<br/><br/>“More than that, at least ten thousand zhang. Particularly, the Lifespirit Treasure in his hand is incredibly domineering. Perhaps its grade has reached Dao Origin Fifth Order, or even higher.”<br/><br/>“Truly, the Grand Yu Divine Dynasty’s Fate is unceasing. Emperor Donggong has just passed, and now there has arisen another Heavenly Dao.”<br/><br/>“It’s not so much that Emperor Donggong has passed, but that Emperor Donggong was perhaps judicious and insightful, daring to stand against the Saint Clans for Fang Wang, whom he had never met before. This level of courage and vision is unparalleled.”<br/><br/>The Great Cultivators at the edge of the battlefield engaged in fervent discussion. They were both terrified of Fang Wang’s power and in awe of Emperor Donggong.<br/><br/>Following this battle, they could be certain that the Grand Yu Divine Dynasty would not crumble with the fall of Emperor Donggong, at least not in the short run.<br/><br/>The emotions of Cheng Chu, in Fang Wang’s hand, were even more complex.<br/><br/>He had followed Emperor Donggong for three thousand years, achieving numerous merits, and had also witnessed Emperor Donggong’s formidable presence. Yet he had never been so deeply shaken.<br/><br/>After his shock subsided, his heart held no fear, but was instead filled with relief.<br/><br/>His life was nearing its end and he would live at most another two or three hundred years. If he could see the Grand Yu Divine Dynasty continue to prosper, then he could die without regrets.<br/><br/>With these thoughts, a smile appeared on his face.<br/><br/>“It seems the two of you have no strength left to resist. Since that’s the case, prepare to die!”<br/><br/>Fang Wang’s voice echoed again, cold as ice, plunging the entire world into a chilling abyss.<br/><br/>As soon as his words fell, almost all the spectators were moved.<br/><br/>They saw Yang Energy flames spilling out from Fang Wang’s enormous body, swiftly gathering behind his head, resembling the sun descending upon the Mortal Realm. Immensely vast and terrifyingly hot, the rolling dust beneath surged violently, and the broken earth trembled once again.<br/><br/>The Escaping Land Immortal and the Thunder-Holding Immortal, surrounded by the ghostly spirit army, were deeply affected. They felt a horrifying aura that made their Primordial Spirits tremble with dread.<br/><br/>Their gaze unavoidably turned toward the distance, towards the great sun behind Fang Wang’s head where the outline of the Mie Jue Divine Tome was faintly visible. Unfamiliar with the Mie Jue Divine Tome, they could still sense it was beyond their ability to withstand.<br/><br/>Prince Hong Chen stood above the clouds, his robes fluttering noisily. His eyes slowly widened.<br/><br/>“That is… how is it possible…”<br/><br/>Hong Chen murmured to himself, his voice trembling.<br/><br/>Emperor Tao beside Hong Xian’er exclaimed in disbelief, “Impossible! The emperor’s supreme art…”<br/><br/>Behind Hong Chen, within the army of a million, the aging generals who had lived for a thousand years were stirred, their eyes brimming with tears.<br/><br/>At that moment, Fang Wang’s imposing figure overlapped with the memory of Emperor Donggong in their eyes.<br/><br/>Unmistakably correct!<br/><br/>Fang Wang had received the true transmission from His Majesty!<br/><br/>Hong Xian’er, watching the Mie Jue Divine Tome concealed within the bright sun, felt for the first time an admiration for Fang Wang that turned into reverence.<br/><br/>She and Fang Wang had both received the inheritance of the Mie Jue Divine Tome, and while she had yet to master it, Fang Wang could already use it, and with such formidable might!<br/><br/>As the power of the Mie Jue Divine Tome fused into the Heavenly Earth Slaying Immortals Sword, the Escaping Land Immortal and the Thunder-Holding Immortal’s complexions drastically changed. For the first time, they felt such a strong aura of death.<br/><br/>The Escaping Land Immortal quickly shouted, “Wait a moment!”<br/><br/>Fang Wang remained impassive as all the ghostly spirits between heaven and earth began to ignite with a strange white aura, appearing even more terrifying. The whole world seemed to transform into a Jiu You Purgatory, eerily daunting.<br/><br/>“We admit defeat! We acknowledge our defeat!”<br/><br/>The Escaping Land Immortal called out loudly, while at the same time trying to flee toward the horizon. His speed was greatly reduced, and intermittently ghostly spirits blocked his way. As soon as he spoke, he was cut down by a ghostly spirit with a single sword strike.<br/><br/>He took advantage of the momentum to dive into the ground, and in less than the time of three breaths, tens of miles away, the earth roared as his figure burst out from the billowing dust, followed closely by an incessant stream of ghosts and deities.<br/><br/>Although Thunder Holding Immortal was silent, he too began to retreat, waving his pair of flags furiously. The thunder spells were wild like tens of thousands of serpents writhing, rampaging through heaven and earth, leaving ghosts and deities to shy away and the ground to explode as if the end of the world had come.<br/><br/>He seemed unstoppable, but his speed was clearly decreasing.<br/><br/>The might of the Heavenly Earth Slaying Immortals Sword was growing as the Mie Jue Divine Tome gathered, increasing the suppressive force on all beings within the formation.<br/><br/>The million-strong army trembled, with those of lower cultivation already kneeling above the clouds, the sea of clouds beneath their feet threatening to burst at any moment.<br/><br/>At that moment.<br/><br/>Prince Hong Chen loudly asked, “Fang Wang, do you have my father emperor’s token?”<br/><br/>Upon hearing this, Fang Wang released the Heavenly Palace Halberd and raised his right hand, presenting the command given by Hong Xian’er. Illuminated by Spiritual Power, the token emitted a huge phantom, clearly displaying the patterns and text on it.<br/><br/>Seeing this, Hong Chen immediately knelt on one knee, clenched his fist, and shouted, “Hong Chen pays his respects to the saint of the Heavenly Dao!”<br/><br/>As these words were spoken, the entire battlefield was in an uproar.<br/><br/>The escaping Earth Fleeing Immortal and Thunder Holding Immortal were emotionally stirred by this revelation.<br/><br/>Thunder Holding Immortal revealed a cold smile, “So it is, truly a clever calculation!”<br/><br/>Following suit, Hong Chen called out, “I beseech the saint of the Heavenly Dao to spare the two land immortals of the Taiqing Xuanjiao!”<br/><br/>Fang Wang put away the imperial command into the Dragon Jade Ring, and he turned his head to catch a glimpse of Hong Xian’er in the distance.<br/><br/>Hong Xian’er nodded towards him, making his gaze all the more intriguing.<br/><br/>“In that case, would the fourth prince be willing to revere the crown prince as emperor?” Fang Wang asked again, looking at Hong Chen.<br/><br/>Hong Chen declared loudly, “I will follow the saint’s will completely!”<br/><br/>The ghosts and deities between heaven and earth turned into Ghost Qi, dissipating like smoke.<br/><br/>The Earth Fleeing Immortal and Thunder Holding Immortal let out a sigh of relief as they stopped and turned to look at Fang Wang in the distance, their expressions complex.<br/><br/>The Earth Fleeing Immortal opened his mouth, wanting to say something, but in the end, he refrained.<br/><br/>Thunder Holding Immortal snorted coldly and left with a flick of his sleeve.<br/><br/>Fang Wang underwent a transformation and returned to his normal size, with the Heavenly Palace Halberd disappearing from his hand.<br/><br/>Xiao Zi lay on his shoulder, still feeling as if in a dream.<br/><br/>Cheng Chu, released by Fang Wang, steadied himself. Looking at Fang Wang in front of him, he gave a wry smile and said, “Cheng Chu is humbled. Besides His Majesty, you are the second person I utterly respect!”<br/><br/>In front of Fang Wang, he felt utterly defenceless, played with in the palm of his hand.<br/><br/>Instead of being angry, he was instead looking forward to the future of the Grand Yu Divine Dynasty.<br/><br/>Hong Xian’er and Emperor Tao appeared out of nowhere beside Fang Wang, with Emperor Tao looking at Fang Wang with a strange expression.<br/><br/>“Fang Wang, thank you. I apologize for not telling you the whole truth. It was also my father’s arrangement before his death, after all…” Hong Xian’er started to speak, but Fang Wang raised his hand to interrupt her.<br/><br/>“Don’t worry, I understand. With His Majesty gone, those undercurrents were bound to surface. Today I have shown my strength and have repelled the Taiqing Xuanjiao; those who harbour ill intentions will now have to weigh their options carefully,” Fang Wang said with a light chuckle.<br/><br/>No wonder the crown prince was unguarded. He had thought the crown prince really trusted him, but it was Emperor Donggong’s calculation.<br/><br/>Fang Wang, owing so many great favors to Emperor Donggong, naturally wouldn’t mind such a scheme. After all, he was committed to protecting the Grand Yu Divine Dynasty at all costs, and offending other powers for the dynasty’s sake was something that was bound to happen eventually.<br/><br/>Hong Chen flew over, saying helplessly, “Since my father’s death, I’ve heard too many things; the words I’ve heard almost made me lose my composure. Those fools really take me for an ignorant man. If my Grand Yu Divine Dynasty falls into internal strife, it will surely perish.”<br/><br/>He then scrutinized Fang Wang, his eyes ablaze, “Fang Wang, from now on you will be the saint of the Grand Yu Divine Dynasty. Don’t worry, you won’t need to bother yourself with anything. If the Grand Yu Divine Dynasty ever faces trouble, then you can take action. Our Hong Family won’t take advantage of you for nothing; the Grand Yu Divine Dynasty will provide strong support for Kunlun until its establishment.”<br/><br/>Fang Wang was not modest in his response. His fate was tied to that of the Grand Yu Divine Dynasty, and there was no need to be so pedantic about it.<br/><br/>In the distance, the onlookers realized what was happening and began to withdraw. None dared to approach Fang Wang too closely; his previous form was simply too terrifying.<br/><br/>Afterwards, Hong Chen invited Fang Wang to head to the Imperial City together, and naturally, Fang Wang did not decline.<br/><br/>Along the way, Hong Chen was very enthusiastic, and the million-strong army behind them was excited beyond measure. Having supported the fourth prince in his endeavor, they were all inwardly anxious about bearing the stigma of rebellion, but thankfully it was a false alarm.<br/><br/>Following this incident, they regained hope for the future of the Grand Yu Divine Dynasty.<br/><br/>The older generation of soldiers began to spread the word, and more and more soldiers learned that Fang Wang’s previous display of Divine Skills was one of Emperor Donggong’s secret arts. In other words, the future Fang Wang would also master the Divine Skill that eradicates fate, thus suppressing the world, which greatly excited all the soldiers.<br/><br/>Upon their return to the Imperial City, Fang Wang courteously declined an invitation from Hong Chen and went back to the inn with Xiao Zi to cultivate.<br/><br/>Hong Xian’er followed Hong Chen into the palace.<br/><br/>Fang Wang believed Zhou Xue’s words, so he decided not to enter the Imperial Palace for a year.<br/><br/>In the following month, the news of the fourth prince’s submission spread, and so did the tales of Fang Wang’s towering stature, with the title of the saint becoming increasingly deified!<br/><br/>Six months later, during the enthronement ceremony of Crown Prince Hong Shou, the entire Grand Yu Divine Dynasty was caught up in jubilation.\t\t\t\t\t\t</div>", "images": {}, "success": true}