{"id": 281, "url": "https://www.novelhall.com/i-became-an-immortal-on-mortal-realm-32879/14817698.html", "title": "Chapter 281 - Chapter 281 Chapter 278: The Hongxuan Emperor’S Wariness", "volume": 3, "volume_title": "Volume 3", "body": "<h1>Chapter 281 - Chapter 281 Chapter 278: The Hongxuan Emperor’S Wariness</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 281 Chapter 278: The Hongxuan Emperor’s Wariness<br/><br/>Prince Hong Shou ascended the throne without a hitch, and the entire Imperial City erupted into jubilation. Fang Wang was invited, but he politely declined.<br/><br/>Regardless of the outside world’s bustling excitement, he remained indifferent.<br/><br/>His Heart of the Heavenly Dao allowed him to forget external matters and remain unaffected.<br/><br/>Before he knew it, two years had passed since the rebellion by the fourth prince.<br/><br/>Over these two years, Fang Wang’s cultivation had progressed, but it was still insufficient to break through. Even for him, it was exceedingly difficult to reach a minor realm in the Heaven-Breaking Realm within ten years.<br/><br/>On this day.<br/><br/>Zhui Feng came once again to seek out Fang Wang.<br/><br/>“Now that the new emperor has ascended the throne, I won’t be residing in the Qianyang Palace anymore. Right, how is the preparation for the teleportation formation I mentioned before coming along?” Fang Wang spoke first.<br/><br/>Even though Hong Shou was very enthusiastic, Fang Wang still wanted to keep his distance from the Imperial Palace. After all, there were karmic consequences associated with Emperor Donggong in the palace, and Fang Wang had to be cautious.<br/><br/>Cautious growth, no recklessness allowed!<br/><br/>Zhui Feng replied, “The Human Emperor Continent is far too distant from the Descending Dragon Continent. The people arranged by His Majesty have probably not yet arrived. Please be patient.”<br/><br/>Since the great battle two years ago, Zhui Feng felt respect towards Fang Wang and spoke to him using respectful language.<br/><br/>Fang Wang nodded. He was starting to miss Sword Heaven Marsh.<br/><br/>Although the Spiritual Energy in the Human Emperor Continent was more abundant, being away from home for a long time naturally made him homesick, and Zhou Xue would not be able to guard the Fang Family forever.<br/><br/>“Otherwise, I’ll arrange for a residence to be built for you, where the Spiritual Energy is no less than that of Qianyang Palace,” suggested Zhui Feng.<br/><br/>He felt it was beneath Fang Wang’s dignity to stay in an inn, and it would not sound good if it got out.<br/><br/>Xiao Zi looked at Fang Wang with eager eyes. It didn’t want to stay in an inn, mainly because the place was too small.<br/><br/>Fang Wang thought for a moment and said, “Alright, but the most important thing is still the teleportation formation. You’d better prepare the materials in advance.”<br/><br/>“Rest assured, His Majesty attaches great importance to this matter and often reminds us,” Zhui Feng said with a nod.<br/><br/>After that, the two did not talk much. Zhui Feng took his leave.<br/><br/>Fang Wang then went to the window sill, overlooking the streets below.<br/><br/>The Imperial City remained bustling, but the number of powerful cultivators gathering around this inn had been increasing, which was another reason Fang Wang agreed to move out.<br/><br/>Xiao Zi approached and asked, “Young Master, do you plan on settling down in the Grand Yu Divine Dynasty in the future?”<br/><br/>Fang Wang replied, “Of course not. Although the Spiritual Energy here is plentiful, at higher realms, the demand for Spiritual Energy is not as great. What’s more important is enlightenment. Once the Grand Yu Divine Dynasty stabilizes, I will continue to wander the world with you, collecting the unique skills of the world.”<br/><br/>The cultivation in the Heaven-Breaking Realm is different from the previous realms. Although it still requires Qi Gathering, the most important aspect is the enlightenment of nature and the heavens. To “break heaven” is to break free from the shackles and confines of the universe on oneself.<br/><br/>Cultivation is important, but so is collecting the unique skills of the world.<br/><br/>After all, for Fang Wang, no matter how long he stayed in the Heavenly Palace, in reality, it was but a moment. This meant he didn’t need to wait to reach a cultivation bottleneck before seeking out unique skills.<br/><br/>Fang Wang then turned his gaze in a certain direction of the Imperial City.<br/><br/>He could sense Hong Xian’er’s aura.<br/><br/>She was about to make a breakthrough.<br/><br/>The Sky-Stepping Realm!<br/><br/>Fang Wang felt reflective, wondering how long it would take him to reach the Sky-Stepping Realm.<br/><br/>How strong would he be in the Sky-Stepping Realm?<br/><br/>Xiao Zi became excited and began to recount the legends it had heard in the city over the past two years. The Grand Yu Divine Dynasty was certainly one of the most powerful dynasties in the Mortal Realm, and all sorts of extraordinary events could be heard here.<br/><br/>Fang Wang, while sensing Hong Xian’er’s aura, listened to Xiao Zi’s stories.<br/><br/>Speaking of opportunities, Fang Wang still had several in his possession: the Tai Cang Immortal Mansion, the tomb palace of the Executioner Immortal Great Saint, and the chance given by the ancient power Li Dai.<br/><br/>He planned to pursue these opportunities when he reached higher realms.<br/><br/>Years have passed, and it must be said that Xiao Zi’s storytelling skills have improved greatly, which Fang Wang found quite interesting.<br/><br/>An hour later, Fang Wang finally entered a state of cultivation.<br/><br/>Time continued to rush by.<br/><br/>Fang Wang immersed himself in Qi Gathering cultivation, while outside the inn, days and nights cycled on, the prosperity having nothing to do with him.<br/><br/>Another three years went by.<br/><br/>On this day, Zhui Feng came to visit him once more. Fang Wang’s residence had been successfully constructed. The residence’s scenic view and various formations were built to the highest standards of the Grand Yu Divine Dynasty.<br/><br/>Fang Wang, with Xiao Zi in tow, followed Zhui Feng towards the Pilgrimage Manor.<br/><br/>The Pilgrimage Manor had become the largest estate within the Imperial City, which also led to numerous commoners and cultivators loitering around the estate.<br/><br/>As Fang Wang arrived at the entrance of the Pilgrimage Manor, he suddenly caught sight of a familiar figure.<br/><br/>The person also spotted Fang Wang and excitedly rushed over.<br/><br/>Zhui Feng drew his sword, stating coldly, “Halt!”<br/><br/>The Hongxuan Emperor slowed down, looking annoyed as he said, “I’m here to find Fang, the little guy!”<br/><br/>Zhui Feng turned to look at Fang Wang, who nodded and said, “Let’s go in. We can talk inside the manor.”<br/><br/>Upon hearing this, Zhui Feng sheathed his sword and continued to lead the way.<br/><br/>The Hongxuan Emperor came to Fang Wang’s side, and the two walked shoulder to shoulder. The Hongxuan Emperor chuckled and said, “It’s been years since we last met, yet you, lad, certainly know how to stir up trouble. When I was at your stage, I didn’t cause nearly as much commotion.”<br/><br/>Zhui Feng, walking ahead, couldn’t help but roll his eyes.<br/><br/>Did this man dare to compare himself with the pilgrims of the Grand Yu Divine Dynasty?<br/><br/>He’s completely ignorant of the world!<br/><br/>Fang Wang calmly replied, “It was not my wish.”<br/><br/>If it were up to him, he would rather forego the fame of recent years and the inheritance of the Mie Jue Divine Tome, choosing instead to fulfill his filial duties on the death anniversary of his parents.<br/><br/>To him, opportunity was not the most important thing, for he had plenty of time to seek fortune.<br/><br/>The Hongxuan Emperor remarked with a sigh, “Such is life; no matter how strong one is, one cannot have everything their way, because there will always be karma you can’t fight against.”<br/><br/>Fang Wang nodded slightly.<br/><br/>The little purple fox lying on his shoulder stared at him doubtfully, seeming to sense something and looking at him with a peculiar expression.<br/><br/>“Did Zhou Xue tell you the reason she asked you to come?” Fang Wang asked.<br/><br/>The Hongxuan Emperor raised his chin and said pridefully, “If they want my guidance for the Grand Yu Divine Dynasty, they’ll have to see if they have any promising talents. Emperor Donggong could be considered one, but sadly he couldn’t defy fate. Speaking of which, it’s still the Descending Dragon Great Saint’s fault. Ten thousand years seem long to mortals, but it’s just like a day in The Upper Realm. The Upper Realm has not yet let down its guard against the Mortal Realm. Emperor Donggong was born at an inopportune time.”<br/><br/>Zhui Feng couldn’t resist turning his head and asking, “May I ask who you are, sir? You must surely be a powerful figure whose name shakes the world!”<br/><br/>The Hongxuan Emperor glanced at him and said, “Junior, you are not yet qualified to know my name.”<br/><br/>Zhui Feng was immediately annoyed and was about to speak when Fang Wang cut in, “This person is named Xiao Kuang, deeply favored with the Hongxuan Emperor’s inheritance. I invited him here to instruct the Grand Yu Divine Dynasty in the ways of governing through fate, to help the Dynasty grow stronger, and possibly to cultivate a Great Emperor.”<br/><br/>Hongxuan Emperor!<br/><br/>Zhui Feng’s expression changed. Naturally, they knew who the Hongxuan Emperor was—a Great Emperor from fifty thousand years ago, and rumored to be the founder of the current emperor’s way!<br/><br/>The Hongxuan Emperor waved his hand and said, “That’s not set in stone. Even if the Hongxuan Emperor himself were alive, it would be very difficult to cultivate a Great Emperor. The ancient Great Emperors tested one’s natural talent even more than Great Saints, and this has led to the name of the Great Emperor being forgotten by all beings for a long stretch of time. The Hongxuan Emperor pioneered a new path for Great Emperors, using the fate of governing to carve out a new route. If the fate of the realm is strong enough, the sovereign can become an emperor.”<br/><br/>Upon hearing this, Zhui Feng felt the Hongxuan Emperor was unfathomable and dared not say any more.<br/><br/>Afterward, Zhui Feng began introducing Fang Wang to the Pilgrimage Manor.<br/><br/>The Hongxuan Emperor looked around, occasionally expressing his amazement.<br/><br/>In his words, the Grand Yu Divine Dynasty wasn’t treating him as a pilgrim but as an emperor.<br/><br/>Thus, Fang Wang settled down in the Pilgrimage Manor, and on that day, the Hongxuan Emperor followed Zhui Feng to visit the current emperor in the Imperial Palace.<br/><br/>The next day at noon, the Hongxuan Emperor came to visit Fang Wang.<br/><br/>Inside the great hall.<br/><br/>The Hongxuan Emperor criticized, “This emperor of the Grand Yu Divine Dynasty won’t live much longer and has no chance of becoming an emperor. No wonder he treated you so generously. I can only choose from his offspring, but considering his talent, I guess his progeny won’t be much better.”<br/><br/>“How about you marry the seventh Princess and have a child? The seventh Princess’s talent is not simple. She seems even stronger than me back in the day. A child born from the two of you, I can’t even imagine what kind of freak that would be.”<br/><br/>Xiao Zi had gone out, so the Hongxuan Emperor didn’t bother concealing his identity.<br/><br/>Fang Wang rolled his eyes and said irritably, “Your children are the real freaks.”<br/><br/>The Hongxuan Emperor chuckled and asked, “What do you think of my suggestion? This is also what the Grand Yu Emperor intends.”<br/><br/>Fang Wang shook his head and said, “Having children means one more concern. Until I rid myself of the threat from The Upper Realm, I will not consider having children.”<br/><br/>The Hongxuan Emperor raised an eyebrow and said, “I think you’re worried about Zhou Xue, aren’t you? That’s right, the woman is ruthless and cruel, her domineering approach is no less than mine was. Your first child can only be hers.”<br/><br/>Fang Wang rolled his eyes and said irritably, “How is that possible? When I say one, she wouldn’t dare to say two.”<br/><br/>“Really?”<br/><br/>“That’s right, but only in private. In front of others, I definitely have to give her face. Don’t provoke her, or you’ll suffer.”<br/><br/>“Heh, sometimes I doubt if that girl is the reincarnation of some powerful being. The cultivators she recruits are all extraordinary. Apart from you, I’ve already seen several talents in the Jin Xiao Sect who possess the potential of Great Saints. I can’t imagine where she finds them. And there’s one more…”<br/><br/>At the end, the Hongxuan Emperor held back, his expression quite gloomy.<br/><br/>Fang Wang pressed, “And there’s one more what?”<br/><br/>The Hongxuan Emperor waved his hand, saying, “Never mind. Next, I will stay with you in the Grand Yu Divine Dynasty. When you leave, remember to remind me. I can’t track your aura. If you leave without a Word, I won’t be able to follow.”<br/><br/>Fang Wang guessed it was the mysterious and insane powerhouse Zhou Xue had mentioned. It seems that the person had a significant background, enough to make the illustrious Hongxuan Emperor feel vexed.<br/><br/>The two chatted for another half an hour, and only then did the Hongxuan Emperor reluctantly depart.<br/><br/>Fang Wang found him quite talkative.<br/><br/>After that, Fang Wang continued his cultivation.<br/><br/>As long as no one invaded the Grand Yu Divine Dynasty, he would keep cultivating until Hong Xian’er overcame her own tribulations. Then, he would wander the heavens and earth.<br/><br/>He enjoyed these tranquil days right now.<br/><br/>Yes, peaceful and serene times.<br/><br/>Below the rolling thunderclouds, the ocean churned with towering waves, ready to swallow the fragmented islands at any moment amid the terrifying swells.<br/><br/>Within the ruins of an island, as the swirling dust settled, the figure of Ji Rutian emerged, kneeling on the ground. His hair was in disarray, his golden clothes torn, and his face smeared with streaks of blood, appearing utterly disheveled.<br/><br/>He looked up at the firmament, his eyes full of unwillingness.\t\t\t\t\t\t</div>", "images": {}, "success": true}