{"id": 282, "url": "https://www.novelhall.com/i-became-an-immortal-on-mortal-realm-32879/14817699.html", "title": "Chapter 282 - Chapter 282 Chapter 279: The Ji Family Bloodline, Known As Hong Chen", "volume": 3, "volume_title": "Volume 3", "body": "<h1>Chapter 282 - Chapter 282 Chapter 279: The Ji Family Bloodline, Known As Hong Chen</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 282 Chapter 279: The Ji Family Bloodline, Known as Hong Chen<br/><br/>Following Ji Rutian’s gaze, there hung a white-haired figure in the sky, set against the backdrop of rolling thunderclouds, resembling a devil suspended in the void, surrounded by clusters of cyan flames.<br/><br/>It was none other than Fang Zigeng!<br/><br/>Fang Zigeng was dressed in a black robe, the collar adorned with dark red beast fur that fluttered lightly in the wind. His expression was indifferent, his gaze empty and numb as he looked down at Ji Rutian without a hint of compassion.<br/><br/>Fang Zigeng raised his right hand, conjuring a horsetail whisk made of white bone for its handle, with long bristles like white hair, and a small skull on the end, emanating an endlessly bone-chilling aura.<br/><br/>Ji Rutian looked up at him, grinding his teeth in anger.<br/><br/>“Damn it… Why has it come to this… Who exactly is he…”<br/><br/>Ji Rutian was extremely frustrated in his heart; he couldn’t accept being defeated by a second person other than Fang Wang, especially since the opponent was considered his peer.<br/><br/>To be defeated by Fang Wang, he had consoled himself for many years.<br/><br/>To be defeated by Fang Zigeng, he simply could not comfort himself!<br/><br/>“Alright, let’s stop here.”<br/><br/>A voice drifted from afar, tinged with a hint of pride.<br/><br/>In the distance, two figures hovered in the sky, none other than the Extremely Evil Old Immortal and Zhu Changsheng.<br/><br/>The Extremely Evil Old Immortal smiled triumphantly, “How about that? My disciple is not bad, right?”<br/><br/>Zhu Changsheng’s face was expressionless, showing no sign of pleasure or anger. He calmly said, “Indeed not bad. Apart from your Extremely Evil Poison Body, he has cultivated another constitution. He must have practiced the Supreme Divine Record; the fusion of two powerful forces has given him qualifications to compete with the world’s top geniuses.”<br/><br/>“However, it seems that the bond between you and your disciple is rather shallow; you will die at his hand.”<br/><br/>The Extremely Evil Old Immortal stroked his beard and chuckled, “This old man has lived long enough and has wanted to die for a while. If I could die at the hands of a disciple who satisfies me, then I would die without regrets.”<br/><br/>He glanced at Zhu Changsheng with a teasing smile, “Is your disciple really the one fated by the Heavenly Dao? Old man here doesn’t think he looks the part; he is indeed a genius, but compared to one fated by the Heavenly Dao, he seems quite ordinary.”<br/><br/>Zhu Changsheng looked towards the distant Ji Rutian and spoke softly, “His destiny has changed, and I blame myself for being powerless. My own fate is changing as well, and many things have become difficult to handle.”<br/><br/>The Extremely Evil Old Immortal turned his head to size up Zhu Changsheng, quickly stroking his chin, lost in thought.<br/><br/>Fang Zigeng flew over and asked emotionlessly, “Is it over?”<br/><br/>He blatantly ignored Zhu Changsheng.<br/><br/>Since he always regarded the Extremely Evil Old Immortal as an enemy, naturally, he would not respect the close friend of the Extremely Evil Old Immortal.<br/><br/>The Extremely Evil Old Immortal replied with a cheerful laugh, “It’s over. Next, we shall head to the final place to resolve the karma between you and me. Either you die or I perish.”<br/><br/>Upon hearing this, Fang Zigeng’s eyes showed a flicker of emotion for the first time.<br/><br/>Zhu Changsheng asked, “Old man, why choose this place for your duel? Who exactly is trying to kill you? There shouldn’t be many in this Eastern Mortal Realm who can trouble you, right?”<br/><br/>The Extremely Evil Old Immortal shrugged and said, “To be honest, I’m not sure myself. But I can feel someone is deducing my whereabouts. You understand, to deduce the movements of beings like us, their realm can’t be low; likely, they are some ancient, undying folks.”<br/><br/>Zhu Changsheng couldn’t help but look at Fang Zigeng, intuition telling him that the mysterious existence hunting the Extremely Evil Old Immortal was somehow related to Fang Zigeng.<br/><br/>“Junior, what is your name?” Zhu Changsheng asked.<br/><br/>Fang Zigeng remained indifferent, not answering or even glancing at Zhu Changsheng.<br/><br/>The Extremely Evil Old Immortal burst into laughter, “This kid is full of hatred and has no interest in communicating with you. Where’s the thing?”<br/><br/>Zhu Changsheng, unbothered, waved his hand, and a bag flew out, landing in the Extremely Evil Old Immortal’s hands.<br/><br/>The Extremely Evil Old Immortal immediately turned and left, with Fang Zigeng closely following behind.<br/><br/>Ji Rutian flew over, but his speed was too slow; all he could do was shout angrily, “Who exactly are you?”<br/><br/>Fang Zigeng didn’t look back, as if he hadn’t heard Ji Rutian’s words.<br/><br/>Ji Rutian watched his figure disappear into the sky, his face turning extremely ugly.<br/><br/>Zhu Changsheng turned to look at Ji Rutian, his gaze cold.<br/><br/>Ji Rutian’s eyes flickered slightly as he lowered his gaze.<br/><br/>After a while,<br/><br/>When the vast ocean returned to calm, Zhu Changsheng finally spoke, “Disciple, it seems that I have miscalculated your fate. The surviving Fang Wang has taken your destiny, and in an era where not advancing means retreating, with every failure, your fate, your lifeline, continuously declines. You have lost the qualifications to compete for the chosen one of the Heavenly Dao.”<br/><br/>Ji Rutian lowered his head, breathing more rapidly as his body was covered in wounds.<br/><br/>Zhu Changsheng took a step forward, and the boundless ocean below suddenly stilled.<br/><br/>Ji Rutian suddenly laughed, covering his forehead with his right hand, the laughter growing louder and even turning hysterical towards the end.<br/><br/>Zhu Changsheng stepped closer, his expression growing increasingly stern.<br/><br/>Ji Rutian violently raised his head, his eyes wide open with bloodshot madness. He spat blood from his mouth and coldly said, “You taught me the Zhou Tian Daoist Skill, just for this day, didn’t you!”<br/><br/>Zhu Changsheng responded calmly, “We both know what need not be said aloud. Do you still intend to resist now? Even if you hadn’t experienced this tragic defeat, you wouldn’t be my match. The Zhou Tian Daoist Skill was taught to you by me, and naturally, I have ways to counter it.”<br/><br/>Ji Rutian sneered contemptuously, “Zhou Tian Daoist Skill… Zhou Tian Daoist Skill… You really take pride in it, don’t you? Didn’t you realize just now? That guy obviously also knows the Zhou Tian Daoist Skill, he simply didn’t exhibit it, that’s all…”<br/><br/>Zhu Changsheng frowned, but his footsteps did not halt.<br/><br/>“How can such a commonly known cultivation technique be considered a supreme skill… Indeed, in the end, what I can rely on is still the bloodline of my Ji Family…” Ji Rutian laughed, a wretched sound.<br/><br/>The fresh blood on his face quickly gathered on his forehead, forming a raised scab. Then, with a snap, the scab broke open, revealing an eye.<br/><br/>Zhu Changsheng’s brows furrowed even more tightly.<br/><br/>The eye on Ji Rutian’s forehead moved restlessly, spinning several rounds before finally fixing its gaze on Zhu Changsheng, filled with greed.<br/><br/>“Descendant, is he the ignorant one who wishes to take possession of you?”<br/><br/>A cold voice echoed between heaven and earth, stirring Zhu Changsheng.<br/><br/>Wiping the blood from the corner of his mouth, Ji Rutian gritted his teeth and said, “Rather than letting him take possession, it would be better to relinquish this flesh to our ancestor…”<br/><br/>Zhu Changsheng laughed, a laugh filled with self-mockery, and he murmured to himself, “Great Saint, truly a resentful spirit that does not disperse.”<br/><br/>In Grand Qi, Sword Heaven Marsh.<br/><br/>On the open ground in front of a cluster of pavilions by the lake, dozens of cultivators were building a stone platform.<br/><br/>Dugu Wenhun, Fang Bai, Chu Yin, The Three Immortals of the Emperor Sea, Zhu Yan, and Song Jinyuan stood to the side, watching.<br/><br/>“Tsk tsk, worthy of being cultivators from the Grand Yu Divine Dynasty, the restrictions they’ve implemented are quite exquisite.”<br/><br/>“Indeed, I really want to take a trip to the Grand Yu Divine Dynasty.”<br/><br/>“The Grand Yu Divine Dynasty is so far from the Descending Dragon Continent, can they really construct a teleportation array over such a great distance?”<br/><br/>The Three Immortals of the Emperor Sea discussed animatedly, their endless chatter making the space buzz with noise.<br/><br/>Song Jinyuan turned his head to look at Dugu Wenhun and smiled, “It seems Fang Wang will be returning soon. After so many years, he must have grown beyond recognition.”<br/><br/>Dugu Wenhun laughed, “More than his cultivation, I’m more interested in when he will start his own sect. There are simply too many beings that look up to him, and Sword Heaven Marsh can no longer contain them.”<br/><br/>The incident with the Seven Clans had made Fang Wang famous throughout the lands. Now, the cultivators visiting Sword Heaven Marsh came from increasingly diverse origins, even Dugu Wenhun and The Three Immortals of the Emperor Sea had broadened their horizons, learning of worlds they previously knew nothing about.<br/><br/>“When the time comes, I’ll also advise him. After all, the strength of one person is ultimately limited. If he can unite the vast powers, it would be more beneficial to the Mortal Realm,” Song Jinyuan said.<br/><br/>There was nothing he could do, the cultists within Sword Heaven Marsh were reaching higher and higher levels of cultivation, and even he was persuaded.<br/><br/>When a Great Cultivator with Heaven-Breaking Realm cultivation solemnly told him he wished to serve Fang Wang as a Sword Servant, Song Jinyuan was stunned. He had specifically asked The Three Immortals of the Emperor Sea what the Heaven-Breaking Realm was, and upon meeting that person, they directly addressed him as a senior.<br/><br/>The spectacle of that day was vivid in his memory.<br/><br/>If they could really unite the power within Sword Heaven Marsh, how strong would that be?<br/><br/>Song Jinyuan felt that it was necessary for Kunlun, the number one Daoist sect in the world, to be matched with the number one teaching.<br/><br/>Dugu Wenhun looked at Chu Yin and said with a smile, “Chu Yin, once your master returns, you should also go out and gain experience. That day when you clashed palms with the True Man of Extreme Yang, it made you quite famous. After another two hundred years of cultivation, you will be one of the new Southern Celestial Four Heroes.”<br/><br/>Chu Yin shook his head, “I don’t want to go on adventures. I only want to cultivate. Going out would only cause trouble for my master. I’m not strong enough. They say my Spiritual Power is boundless, but compared to master’s vast Spiritual Power, I still have a long way to go.”<br/><br/>Dugu Wenhun couldn’t help but crack a smile, feeling that this young man was overly cautious.<br/><br/>Even Fang Bai couldn’t help but seek out adventures from time to time, not to mention Fang Jing. After the Wind Clan was exterminated, he only returned once, and it was to leave his children at Sword Heaven Marsh, entrusting them to their care.<br/><br/>Zhu Yan, with arms crossed, snorted, “What Southern Celestial Four Heroes? They no longer hold any influence. With the master here, the Descending Dragon Continent surpasses the Southern Celestial Four Heroes. Why not take the name of Kunlun and establish the four heroes of the world? And at the same time bolster Kunlun’s prestige.”<br/><br/>As soon as he said this, everyone looked at him with surprise.<br/><br/>Zhu Yan’s face reddened, and he said stubbornly, “Why are you looking at me with such a gaze?”<br/><br/>Song Jinyuan said with emotion, “I didn’t expect you to come up with such an idea.”<br/><br/>The Three Immortals of the Emperor Sea followed with teasing, speaking in unison, which infuriated Zhu Yan and made him want to explode in anger.<br/><br/>He suppressed his rage and said, “It was an old senior who talked to me the other day. He said that a true Great Saint must be known throughout the world, a being desired by all living creatures. Having Kunlun alone is not enough for the master; he also needs fame that is recognized by all under heaven.”<br/><br/>Dugu Wenhun became interested and asked, “What’s the surname and name of that old senior? Can you take me to meet him?”<br/><br/>“He calls himself Hong Chen. Let’s go; he’s currently fishing with Gu Tianxiong.” Zhu Yan answered and turned to lead the way.<br/><br/>Dugu Wenhun immediately followed his steps.<br/><br/>The others continued to discuss the teleportation array of the Grand Yu Divine Dynasty.<br/><br/>Meanwhile.<br/><br/>Far away in the Grand Yu Divine Dynasty, Fang Wang was not cultivating for once because today Hong Xian’er was visiting him.<br/><br/>Nine years had passed since the Hongxuan Emperor came, and Fang Wang had successfully reached the second level of the Heaven-Breaking Realm.<br/><br/>“Fang Wang, do you want a great opportunity?” Asked Hong Xian’er excitedly as she approached Fang Wang.<br/><br/>Fang Wang looked at her, waiting for her to continue.<br/><br/>She said exuberantly, “In the Northern Sea, a Saint Treasure has emerged. The Saint Treasure is the transformation of a Great Saint’s Lifespirit Treasure. Obtaining one Saint Treasure would allow one to dominate the world!”\t\t\t\t\t\t</div>", "images": {}, "success": true}