{"id": 284, "url": "https://www.novelhall.com/i-became-an-immortal-on-mortal-realm-32879/14819104.html", "title": "Chapter 284 - Chapter 284 Chapter 281 Lingxiao Divine Sect Great Perfection", "volume": 3, "volume_title": "Volume 3", "body": "<h1>Chapter 284 - Chapter 284 Chapter 281 Lingxiao Divine Sect Great Perfection</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 284 Chapter 281 Lingxiao Divine Sect Great Perfection<br/><br/>Fang Wang took the beast skin, and instead of checking the ultimate skill within immediately, he looked at Hong Xian’er, saying, “Your Emperor father has been incredibly kind to me, not only saving me, and standing up for justice on my behalf, but also covering up the secrets of heaven for me. You don’t need to go on making sacrifices for me; I will keep my promise to protect the Grand Yu Divine Dynasty.”<br/><br/>Upon hearing this, Hong Xian’er’s beautiful eyes widened, and she said irritably, “Stinky man, do you think I’m good to you just because of my father?”<br/><br/>“Hmm?”<br/><br/>“I’m not talking to you anymore!”<br/><br/>Hong Xian’er slapped the table and rose, vanishing from the room in an instant.<br/><br/>Fang Wang, holding the beast skin, couldn’t help but chuckle.<br/><br/>This girl is quite interesting.<br/><br/>It seems Emperor Donggong has protected her well; no matter how old she is, she still has the demeanor of a daughter.<br/><br/>Fang Wang extended his divine sense into the beast skin, as he was still somewhat interested in the ultimate skill within; after all, it was likely to be an ultimate skill of the Great Saint.<br/><br/>The beast skin contained a powerful prohibition, but Fang Wang’s divine sense shattered it effortlessly.<br/><br/>After a while, Fang Wang became solemn.<br/><br/>He opened his eyes, his expression hesitant.<br/><br/>This ultimate skill is not simple!<br/><br/>One look and it’s clear it’s life-consuming!<br/><br/>Luckily, the lifespan spent in the Heavenly Palace isn’t real.<br/><br/>Fang Wang suddenly thought of the True God of the Heavenly Palace, recalling how he had vowed to follow a path of absorbing all the world’s ultimate skills, but now he hesitated, wasn’t this a slap to his own face?<br/><br/>Damn it!<br/><br/>In the future, no matter how many come my way, I’ll learn them all!<br/><br/>I don’t believe cultivation can drive me insane!<br/><br/>Fang Wang took a deep breath, closed his eyes again, and continued to comprehend the ultimate skill within the beast skin.<br/><br/>After a while, Fang Wang’s consciousness entered the Heavenly Palace.<br/><br/>“Lingxiao Divine Sect…”<br/><br/>Fang Wang opened his eyes, looking at the familiar Heavenly Palace, and muttered to himself.<br/><br/>He felt as if he’d just left the Heavenly Palace not long ago.<br/><br/>He didn’t ponder any longer and began to fathom the Lingxiao Divine Sect.<br/><br/>The Lingxiao Divine Sect was a divine skill that combined movement, escape, and traversal abilities; mastered to Great Completion, one could traverse the Firmament, which made Fang Wang curious if he could use this divine skill to directly travel to The Upper Realm.<br/><br/>Half an hour later, Fang Wang began cultivating the Lingxiao Divine Sect.<br/><br/>His figure kept changing within the Heavenly Palace.<br/><br/>Whenever he mastered a level of the Lingxiao Divine Sect, he would continue to switch the illusions within the Heavenly Palace to facilitate his cultivation.<br/><br/>Years went by swiftly.<br/><br/>By the time Fang Wang mastered the Lingxiao Divine Sect, a thousand years had passed.<br/><br/>The Lingxiao Divine Sect seemed to be just a mobility divine skill, but it was extremely complex in reality; he had to practice movement techniques in different environments, including various dangerous scenarios. Fortunately, the Heavenly Palace was powerful enough to satisfy all his imaginings.<br/><br/>However, this was just minor achievement!<br/><br/>Minor achievement was not enough!<br/><br/>Fang Wang continued cultivating.<br/><br/>Not yet having reached Great Completion, he felt weary, even frustrated, but he could only try to control his impatience.<br/><br/>After an indeterminate amount of time, he finally cultivated the Lingxiao Divine Sect to Great Completion.<br/><br/>After Great Completion came Great Perfection…<br/><br/>From Great Completion to Great Perfection, Fang Wang felt the duration even more protracted.<br/><br/>By the time he finally reached the Great Perfection Realm and looked back at the year clock hanging in the Heavenly Palace, 5800 years had passed.<br/><br/>Fang Wang found that the time spent was shorter than expected, but the actual process felt like it surpassed ten thousand years of cultivation, perhaps because the practice of the Lingxiao Divine Sect was too monotonous.<br/><br/>Regardless, he had finally learned it.<br/><br/>The Heavenly Palace shattered, and Fang Wang opened his eyes along with it.<br/><br/>He vanished into thin air from within the room and appeared atop the eaves.<br/><br/>The lofts of Pilgrimage Manor were very tall, and standing on the eaves, one could overlook most of the Imperial City’s landscape. Birds of unparalleled beauty circled above the city as if part of a scroll painting.<br/><br/>Fang Wang looked up at the firmament, and his figure vanished once again as he surged upwards at extreme speed.<br/><br/>The next second, he stopped.<br/><br/>At this moment, darkness hung over his head, and below was the firmament; he couldn’t even see the earth or the ocean, just the endlessly white clouds with no end in sight in any direction.<br/><br/>Fang Wang realized that the Human Emperor Continent was indeed like Earth, spherical in shape, but this sphere was far more colossal than Earth.<br/><br/>He then looked upwards, only to find that his Great Perfection Lingxiao Divine Sect powers could not leap out; an extremely powerful force separated him from beyond the firmament.<br/><br/>The gap between Fang Wang and this force was too great—so vast that not even the Great Perfection Lingxiao Divine Sect powers could bridge it.<br/><br/>Soon after, he vanished from where he was and appeared out of thin air on the edge of the Human Emperor Continent, standing on the rocks, gazing at the endless ocean.<br/><br/>Waves crashed against the shore, and a chilled sea breeze whispered.<br/><br/>The magnificent view before him captivated Fang Wang, gradually brightening his mood.<br/><br/>The sound of the waves became the sole noise by his ear, boisterous yet casting his heart into tranquility.<br/><br/>After a while, a figure landed next to Fang Wang.<br/><br/>It was Hong Xian’er.<br/><br/>Fang Wang had felt Hong Xian’er’s energy flitting about chaotically and guessed she might be looking for him. Thus, he deliberately leaked a trace of his energy, and the Sky-Stepping Realm’s Hong Xian’er indeed had a swift reaction.<br/><br/>“How did you suddenly pop up here?” Hong Xian’er asked, puzzled.<br/><br/>Fang Wang, looking at the sea, replied, “I came out to clear my mind.”<br/><br/>Hong Xian’er hummed, “I thought after I ran off, you ran off, too.”<br/><br/>Her eyes carried a slight grievance.<br/><br/>Fang Wang glanced at her and said, “Do you want to learn the unique skills of the Soaring Clouds Great Saint?”<br/><br/>The Soaring Clouds Great Saint was the founder of the Lingxiao Divine Sect!<br/><br/>Upon seeing these Divine Skills, Fang Wang felt that the Soaring Clouds Great Saint was no less formidable.<br/><br/>Hong Xian’er replied with a touch of annoyance, “What, just how long did I give you, and you’ve already mastered the unique skills of the Soaring Clouds Great Saint? You’re bluffing me.”<br/><br/>Fang Wang reached out, grasped her arm, and both vanished from the spot.<br/><br/>A few breaths later, they returned to the rocks, their cloaks billowing and hair floating in the wind.<br/><br/>Hong Xian’er’s eyes widened in astonishment.<br/><br/>In just a few moments, Fang Wang had taken her to the extreme edges of the Human Emperor Continent.<br/><br/>It was too fast!<br/><br/>She suspected she had been ensnared by an illusionary realm, but she felt slight variations in the Spiritual Energy of each location.<br/><br/>Hong Xian’er, who had lived for so many years, was intimately familiar with every part of the Human Emperor Continent. Her recent impressions could not have been wrong.<br/><br/>“Could this be the unique skill you taught me?” Hong Xian’er swallowed nervously and asked cautiously.<br/><br/>Fang Wang answered, “This technique is easier to cultivate than the previous ones I’ve shown you. I can teach it to you if you want to learn, interested?”<br/><br/>Hong Xian’er quickly nodded, intensely curious whether Fang Wang had ever learned it before, yet she also felt that he couldn’t have.<br/><br/>Without another word, Fang Wang began to impart the Lingxiao Divine Sect knowledge.<br/><br/>Teaching others and practicing oneself were entirely different experiences!<br/><br/>The sun set and the moon rose.<br/><br/>The next morning came.<br/><br/>Hong Xian’er continuously moved about on the sandy beach, thrilled beyond measure.<br/><br/>Fang Wang watched her and thought to himself that the girl indeed had remarkable talent.<br/><br/>However, to master the Lingxiao Divine Sect would still take time; not a feat that could be accomplished in a mere hundred years.<br/><br/>Hong Xian’er approached Fang Wang and excitedly asked, “This Divine Skill is very subtle. Fang Wang, your mastery of it is profound. I feel that if I were to cultivate it myself, it certainly wouldn’t be as easy as you teaching me. You’ve never learned it before?”<br/><br/>Fang Wang smiled and said, “If I tell you I’ve never learned it before, would you believe me?”<br/><br/>Hong Xian’er nodded and said, “I believe! Absolutely! I’ll trust anything you say! This is amazing! I’ll definitely keep collecting Great Saint skills for you!”<br/><br/>Fang Wang shook his head with a chuckle, “There’s no need; don’t let it hinder your own cultivation.”<br/><br/>“Hehe, I have my own selfish reasons; you learn first and then teach me—it’s efficient!” Hong Xian’er laughed with pride. She subconsciously tried to lift her arm to grasp Fang Wang’s arm, but, unfortunately, he evaded it naturally.\t\t\t\t\t\t</div>", "images": {}, "success": true}