{"id": 297, "url": "https://www.novelhall.com/i-became-an-immortal-on-mortal-realm-32879/14835135.html", "title": "Chapter 293 - Chapter 293 Chapter 290: Hanging By A Thread, Revival", "volume": 3, "volume_title": "Volume 3", "body": "<h1>Chapter 293 - Chapter 293 Chapter 290: Hanging By A Thread, Revival</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 293 Chapter 290: Hanging by a Thread, Revival<br/><br/>The sky roiled with surging waves of air, making the vault of heaven seem as if it were fluctuating and could shatter at any moment.<br/><br/>All the Great Cultivators of the Grand Yu Divine Dynasty stared upwards, agape with shock, as Fang Wang still maintained his punching posture, facing them sideways, his right arm enshrouded with a mist of blood, with Li Chunyang’s figure no longer visible.<br/><br/>The ferociously approaching Li Chunyang had unexpectedly been killed by Fang Wang with a single punch!<br/><br/>Previously, Li Chunyang’s momentum had been no laughing matter; he had even easily shattered the Imperial City’s Protective City Formation.<br/><br/>One must know that the Protective City Formation of the Imperial City could not be forcefully breached even by those in the Sky-Stepping Realm, and it could withstand the impact of the True Soul Realm!<br/><br/>How rare the True Soul Realm is!<br/><br/>Hong Xian’er was also dumbfounded, disbelieving her own eyes.<br/><br/>She had heard Emperor Donggong talk about Li Chunyang when she was young, holding him in high esteem. Even though Li Chunyang had been dead for four thousand years, Emperor Donggong still considered him the greatest troublemaker of his life.<br/><br/>Li Chunyang was the number one talent from four thousand years ago, and such a being had been killed by Fang Wang with a single punch, and in a cross-realm feat at that!<br/><br/>What did this imply?<br/><br/>The coming flourishing age was truly no empty talk. With Fang Wang present, the foremost talents of past eras would be nothing but this, and talents of this era, in order to catch up to him, would certainly challenge even higher limits.<br/><br/>Fang Wang, however, was unaware of Hong Xian’er and others’ thoughts. To eradicate Li Chunyang, he had used Dao Power.<br/><br/>Although he had not yet completely transformed into Immaculate Dao Bones, his Dao Power had been cultivated, and with his Great Perfection expertise, he deployed it as naturally as moving his arm.<br/><br/>He could sense that Li Chunyang’s Pure Yang Saint Body was extraordinary, and Li Chunyang also possessed the power of the Mie Jue Divine Tome, so his seemingly casual punch was actually with full force, without mercy.<br/><br/>He couldn’t be bothered to concern himself with Li Chunyang’s origins and who was plotting behind the scenes; he simply killed with one punch!<br/><br/>He wanted to use this punch to warn those who schemed in the shadows!<br/><br/>Fang Wang opened his mouth, expelled a breath, and blew away the blood mist in front of him. Then he sat down with his legs crossed and continued to absorb nature’s spiritual energy, refining his body.<br/><br/>Li Chunyang’s attack not only caused the Imperial City’s Protective City Formation to collapse, but even the fate formation meant to mask Fang Wang’s aura was broken.<br/><br/>Fang Wang wasn’t worried about exposing himself; he possessed the Formless Zhou Tian Technique, and The Upper Realm couldn’t probe him. At most, it would cause a disturbance in the Mortal Realm, and only those close by would be able to perceive him.<br/><br/>Elsewhere.<br/><br/>At the edge of the Human Emperor Continent.<br/><br/>Daoist Master Chunqiu stood on a rock, gazing in the direction of the Imperial City.<br/><br/>Wisps of black qi emerged from the sandy ground beside him, coalescing into a semi-transparent old man, appearing like a phantom image.<br/><br/>The old man solemnly said, “Li Chunyang is dead, fortunately, I sensed something was wrong beforehand and disengaged from him before the battle commenced. I didn’t expect him to be unable to withstand a single punch from Fang Wang.”<br/><br/>Daoist Master Chunqiu responded calmly, “Don’t underestimate the Pure Yang Saint Body. As long as a breath of Pure Yang remains, he can resurrect. If not for Emperor Donggong possessing the Mie Jue Divine Tome, there aren’t many in this world who could thoroughly annihilate him.”<br/><br/>Upon hearing this, the old man’s expression eased, and he then raised his eyes to look into the distance, asking, “What cultivation technique do you think Fang Wang is practicing? This commotion is too exaggerated.”<br/><br/>Daoist Master Chunqiu pondered and said, “Thunder roars, yet the blessings of the Heavenly Dao are not evident; it is likely related to his physical body.”<br/><br/>“It’s also unknown what constitution Fang Wang possesses. It is said that Kunlun still holds a Heavenly Body. If this continues, a mighty force will inevitably gather around him, capable of shaking the Mortal Realm.”<br/><br/>“That’s normal too, for his talents, for the vast majority, the benefits of allying with him far outweigh the costs of becoming his enemy.”<br/><br/>The response from Daoist Master Chunqiu left the old man in silence.<br/><br/>Every time he thought about Fang Wang, the old man’s feelings were complex. He was not aiming to target Fang Wang, but rather, to take revenge on the Hong Family. Alas, Fang Wang was resolutely defending the Grand Yu Divine Dynasty, and this vexed him greatly.<br/><br/>Not everyone understood the extent of Fang Wang’s power. In the eyes of many descendants of the Saint Clans, Fang Wang might be the foremost talent in the world, but he was no match for the Saint Clans. They did not fear Fang Wang; instead, they looked forward to challenging him.<br/><br/>The elder’s Saint Clan was just as such, with the voices below clamoring more and more to attack the Grand Yu Divine Dynasty. He was on the verge of not being able to withstand it anymore.<br/><br/>Emperor Donggong had suppressed the Saint Clans for four thousand years, and all the major Saint Clans had dealings with each other. The will to overthrow the Grand Yu Divine Dynasty had already become a force, only waiting for a decision on when to attack.<br/><br/>As the elder pondered the affairs of the Saint Clan, Daoist Master Chunqiu was also in deep thought, though it was unknown what he was thinking about.<br/><br/>Time slowly passed.<br/><br/>After the duration of an incense stick burning, the elder couldn’t help but break the silence and asked, “Is the Pure Yang Saint Body still in the process of resurrection?”<br/><br/>Daoist Master Chunqiu did not answer, his expression becoming increasingly somber.<br/><br/>After a while, Daoist Master Chunqiu took a deep breath and said, “Let’s go. He is completely dead, and his fate has completely dispersed.”<br/><br/>Having said that, Daoist Master Chunqiu turned around. The elder was stunned for a moment, then hurriedly followed his pace.<br/><br/>“Daoist Master, what should we do next?” the elder asked, walking beside Daoist Master Chunqiu.<br/><br/>Just as Daoist Master Chunqiu was about to answer, his expression suddenly changed drastically. He immediately began to cultivate, and a visibly ominous aura appeared between his eyebrows.<br/><br/>The elder asked anxiously, “What’s wrong with you?”<br/><br/>Daoist Master Chunqiu’s eyes showed a hint of dread as he whispered, “Someone is… cursing me… Fang Wang has a master behind him!”<br/><br/>Upon hearing these words, the elder’s face changed dramatically.<br/><br/>“Let’s go!”<br/><br/>Daoist Master Chunqiu said gravely, not daring to look back.<br/><br/>The two leaped up and quickly disappeared at the end of the sea horizon.<br/><br/>The celestial phenomenon caused by Fang Wang lasted for a full two days and nights. During these two days and nights, the entire Human Emperor Continent was thrown into turmoil. Fortunately, the cities of the Grand Yu Divine Dynasty all had Protective City Formations. Except for the Imperial City, which was attacked by Li Chunyang, other cities had injuries but no deaths as a result.<br/><br/>On that day, the Heavenly Might dissipated.<br/><br/>Sunshine pierced through the sea of thunderclouds, showering the Grand Yu Divine Dynasty.<br/><br/>Hong Xian’er stood on the eaves, looking up at Fang Wang’s figure, who sat high in the sky surrounded by seas of clouds at a distance of at least a hundred miles. The scene was majestic.<br/><br/>People stood on the eaves of various buildings throughout the Imperial City, gazing upward as if beholding the shadow of an immortal.<br/><br/>The silver light on Fang Wang was slowly fading away.<br/><br/>He had completely transformed into Immaculate Dao Bones, and his cultivation broke through to the third layer of the Heaven-Breaking Realm!<br/><br/>The same invincible mindset he had experienced in the Heavenly Palace emerged again. Fang Wang felt the power within him, feeling as if everything between Heaven and Earth had changed, even the sound of the wind became clearer, and the invisible Spiritual Energy took on strands of different colors, drifting through the world.<br/><br/>He took out a white robe from the Dragon Jade Ring while the silver light had not yet completely dissipated, and donned it. This made him appear even more mysterious, like an Immortal God descending from heaven.<br/><br/>Meanwhile.<br/><br/>Far away on the Descending Dragon Continent, by the lake of Sword Heaven Marsh.<br/><br/>Hong Chen was meditating on a boulder. He held a fishing rod in one hand and gathered four wooden blocks from his lap into the other.<br/><br/>“Senior, what are you fiddling with? You can’t even concentrate on fishing. Be careful I might catch a big one and utterly embarrass you!”<br/><br/>The voice of Gu Tianxiong came from beside.<br/><br/>Hong Chen replied calmly, “Don’t talk about big ones. If you can catch a fry, you win. I’ll agree to grant your daughter an exceptional Cultivation Technique.”\t\t\t\t\t\t</div>", "images": {}, "success": true}