{"id": 294, "url": "https://www.novelhall.com/i-became-an-immortal-on-mortal-realm-32879/14820584.html", "title": "Chapter 294 - Chapter 292 Chapter 289: The Assault Of The Pure Yang Saint Body", "volume": 3, "volume_title": "Volume 3", "body": "<h1>Chapter 294 - Chapter 292 Chapter 289: The Assault Of The Pure Yang Saint Body</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 292 Chapter 289: The Assault of the Pure Yang Saint Body<br/><br/>Under the sunlight, the silver light on Fang Wang’s body became even more dazzling. The surrounding sea of clouds churned violently, expanding hundreds of zhang away from him, with only thunder able to reach him.<br/><br/>After enduring an extremely painful process, Fang Wang felt a strong and unique power being born from his Immaculate Dao Bones, stimulating his flesh.<br/><br/>This power was not like Spiritual Power, it was similar to physical strength, yet it existed independently. Fang Wang called it Dao Power.<br/><br/>Dao Power burgeoned from the Immaculate Dao Bones, tempering his Heavenly Gang Supreme Yang Tyrant Body, and even caused his Yang Energy to grow.<br/><br/>The transformation after the agony was exceedingly wondrous.<br/><br/>Fang Wang couldn’t help but raise his head, even spreading his arms.<br/><br/>Below, the old Cultivators who had exerted all their strength to form the Formation looked at his posture, trembling with fear. They had used the fate of the Grand Yu Divine Dynasty to suppress the celestial phenomena caused by Fang Wang, suffering from increasingly severe backlash, which made them acutely aware of Fang Wang’s terror.<br/><br/>They could feel Fang Wang’s transformation, an evolution that was beyond their understanding and defied their knowledge.<br/><br/>Fang Wang’s aura had transformed from human to another existence, neither demon nor monster.<br/><br/>The fear that struck the soul directly made the old Cultivators think of one word.<br/><br/>Immortal!<br/><br/>Wrong!<br/><br/>Not Immortal!<br/><br/>For some reason, they felt inexplicably that Fang Wang was even more transcendent than an Immortal.<br/><br/>At this moment, the Protective City Formation of the Imperial City, formed by the concerted efforts of hundreds of thousands of Cultivators, was also gazing at Fang Wang’s figure, their faces showing fervent admiration.<br/><br/>Fang Wang was definitely the most extravagant prodigy they had ever seen, having joined the Grand Yu Divine Dynasty only a few years ago, but always making earth-shattering moves.<br/><br/>As the Heavenly Might induced by Fang Wang grew stronger, protective formations were activated in cities across the Grand Yu Divine Dynasty. Giant screens of light enveloped the mountains and rivers of the Human Emperor Continent.<br/><br/>The news of Fang Wang practicing swiftly spread to every corner of the Grand Yu Divine Dynasty, easing the panic and unrest among the Dynasty’s citizens.<br/><br/>Years ago, Fang Wang, with a body tens of zhang tall, had repelled two Land Immortals from the Taiqing Xuanjiao, his name resonating through the Grand Yu Divine Dynasty. That battle made him a god in the hearts of the Dynasty’s people.<br/><br/>Now that Fang Wang was about to become even stronger, the people were naturally overjoyed.<br/><br/>Boom—<br/><br/>Accompanied by a roar as if heaven and earth were resonating, a rainbow of light streaked in from the edge of the Human Emperor Continent, tearing across the firmament as if to split it in two, unstoppable.<br/><br/>This rainbow moved at an incredible speed, whipping up gusts of wind and ravaging half of the Grand Yu Divine Dynasty’s territory.<br/><br/>In the blink of an eye, it had already reached the front of the Imperial City.<br/><br/>The hundreds of thousands of Cultivators forming the formation for the Imperial City subconsciously turned back, but before they could discern the direction of the sound, intense flames illuminated their faces.<br/><br/>Boom!<br/><br/>The rainbow smashed through the Imperial City’s Protective Formation with a domineering force, causing hundreds of thousands of Cultivators to be thrown back, spitting blood. Accompanying the shattering of the Formation’s light screen, violent winds ran rampant throughout the city, and the rainbow of light adjusted its course, soaring upward, aiming for Fang Wang.<br/><br/>“How insolent!”<br/><br/>An elder clad in a gray Dao Robe raised his hand to strike, his overflowing Spiritual Power condensing into a dark gray Dao Mountain, crashing down fiercely, blotting out the sky and sun.<br/><br/>The mysterious rainbow light swept powerfully across the Dao Mountain, scattering the congregation of old cultivators who were amassing the fate of the Grand Yu Divine Dynasty with unstoppable momentum. Already straining, they were hit by the impact, and immediately, some burst into showers of blood, dissipating into a mist of gore.<br/><br/>The rainbow light violently collided with Fang Wang, dispersing the sea of clouds above and revealing a clear sky that stretched for ten thousand miles, even the myriads of heavenly thunder were shattered.<br/><br/>As the light faded, a man in black with a bamboo hat floating before Fang Wang appeared. In his right hand, he held a flute, the bottom end of which was pressed against Fang Wang’s chest but had not pierced through his skin.<br/><br/>Silver light shone upon the man’s face, his pupils dilating suddenly as a flash of astonishment crossed his eyes.<br/><br/>Fang Wang, whose true face was obscured by the silver light, asked in an indifferent tone, “Who might you be, sir, and from whence do you come?”<br/><br/>With a slight tilt of his head, the man in black looked down upon Fang Wang and responded, “Li Chunyang, a cultivator long forgotten by the Mortal Realm.”<br/><br/>Fang Wang stood up and rose higher, towering over Li Chunyang, looking down upon him.<br/><br/>Li Chunyang raised his head to meet his gaze and asked with interest, “What extraordinary skill have you practiced? I sense the aura of the Vajra Invincible Saint Body on you.”<br/><br/>Looking down at him, Fang Wang asked indifferently, “I have cultivated the Heavenly Gang Supreme Yang Tyrant Body, a domineering form I created by fusing the Vajra Invincible Saint Body with the Heavenly Body. Would you like to experience its might?”<br/><br/>As for the Immaculate Dao Bones, Fang Wang felt it was better not to mention them. If they attracted the envy of The Upper Realm, that could lead to trouble.<br/><br/>“The Heavenly Gang Supreme Yang Tyrant Body…”<br/><br/>Li Chunyang murmured to himself before tilting the flute in his hand, and the wooden box behind him suddenly turned into a floating powder, drifting away as tendrils of black mist emerged like tentacles, quickly enveloping his body.<br/><br/>The bamboo hat flew into the distant rolling dust clouds and vanished.<br/><br/>Strong cultivators arrived one after the other, intending to encircle Li Chunyang, but upon seeing Fang Wang raise his hand, signaling them to back off, they instantly stopped. However, they did not retreat and stood with a fierce glare fixed on Li Chunyang.<br/><br/>Suddenly, Hong Xian’er’s voice arose from below, “Fang Wang, Li Chunyang was considered by my father emperor to be the most troublesome enemy and also the premier talent of the Eastern Mortal Realm four thousand years ago!”<br/><br/>After hearing this, Fang Wang remained unmoved, still waiting for Li Chunyang to absorb the power within the wooden box.<br/><br/>As the black mist dissipated, Li Chunyang’s true form was revealed. His black clothes were overlaid with a layer of scales, and his garments fluttered as if he was a humanoid beast, while the flute in his hand had transformed into a long saber wreathed in black flames.<br/><br/>Li Chunyang looked up, half of his face covered in black flame patterns, his features twisted into a fearsome visage. His hair danced wildly as he stared defiantly at Fang Wang, radiating a terrifying murderous intent.<br/><br/>“The Heavenly Gang Supreme Yang Tyrant Body? Claiming to be domineering, how very arrogant! Fang Wang, why don’t I let you experience my Pure Yang Saint Body, a physique of my own creation acknowledged by the Descending Dragon Great Saint!”<br/><br/>With a spirited declaration, Li Chunyang soared upward, matching Fang Wang’s height, the saber pointing towards him.<br/><br/>As his words fell, a vast oppressive force enveloped heaven and earth; every creature within the Imperial City felt the temperature soaring rapidly, and the flora in every courtyard wilted before their very eyes.<br/><br/>Fang Wang raised his right hand, slowly clenched his fist, and a more overwhelming pressurizing force descended, causing Li Chunyang to show concern.<br/><br/>Boom!<br/><br/>Li Chunyang’s eyes widened, for he only perceived a blur in front of him. Fang Wang had closed in on him too swiftly for him to react, and Fang Wang’s right fist punched straight through his chest. Blood sprayed from his back, blooming into a tragically beautiful blood flower in mid-air.<br/><br/>“So fast… how is this possible…”<br/><br/>Li Chunyang’s pupils contracted, unable to believe what he was thinking.<br/><br/>He did not panic but immediately activated his powers, calling upon the Pure Yang Spiritual Power within his Pure Yang Saint Body.<br/><br/>Li Chunyang burst into black flames, but as soon as the flames rose less than thirty feet, Fang Wang’s right arm trembled, and Li Chunyang’s physical body abruptly dispersed into a blood mist, the fearsome impact force sweeping in all directions, scouring the sea of clouds at the horizon.<br/><br/>The Firmament seemed to have been cleansed of all impurities in an instant, turning into a blank slate.\t\t\t\t\t\t</div>", "images": {}, "success": true}