{"id": 290, "url": "https://www.novelhall.com/i-became-an-immortal-on-mortal-realm-32879/14820308.html", "title": "Chapter 290 - Chapter 290 Chapter 287: The Great Perfection Of Dao Bone, An Unrivaled State Of Mind", "volume": 3, "volume_title": "Volume 3", "body": "<h1>Chapter 290 - Chapter 290 Chapter 287: The Great Perfection Of Dao Bone, An Unrivaled State Of Mind</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 290 Chapter 287: The Great Perfection of Dao Bone, An Unrivaled State of Mind<br/><br/>The loft echoed with the words of Hong Chen, as Fang Wang gradually closed his eyes.<br/><br/>After a full two hours later, Hong Chen finally stopped speaking and ceased to impart his teachings, he poured himself some tea and quietly watched Fang Wang.<br/><br/>“I wonder how much he could comprehend.”<br/><br/>Entertaining such thoughts, anticipation shimmered in Hong Chen’s eyes.<br/><br/>Although he hadn’t mastered the Immeasurable Pure Bone Technique, he believed that Fang Wang could, it was merely a matter of time.<br/><br/>Fang Wang slowly opened his eyes and met Hong Chen’s gaze.<br/><br/>In that instant, Hong Chen’s expression shifted slightly, not knowing why, he sensed a change in Fang Wang’s temperament the moment he opened his eyes.<br/><br/>This feeling was subtle, and Hong Chen wasn’t certain if it was an illusion, after all, his cultivation in this life was far from as formidable as it was at his peak.<br/><br/>Fang Wang took a deep breath and said, “Immeasurable Pure Bone, the flawless and pure Dao Bones, these bones truly qualify as Immortal Bones, undying, indestructible, truly inconceivable.”<br/><br/>Hong Chen raised an eyebrow and said, “I didn’t expect you to have already glimpsed its power within the Body Cultivation Technique. Whether it truly confers immortality and indestructibility, I am not sure, but even if it does, it would only pertain to these Dao Bones. If a cultivator’s natural life comes to an end, or their soul is seized, that would be tantamount to death.”<br/><br/>Fang Wang’s face turned indifferent as he said, “Undying and indestructible is merely one of its traits, Immeasurable Pure is where its true power lies.”<br/><br/>Upon hearing this, Hong Chen narrowed his eyes and scrutinized Fang Wang closely.<br/><br/>The room fell into silence.<br/><br/>After quite a while.<br/><br/>Hong Chen broke the silence and asked, “How much have you understood, and how many years do you think you will need to master it?”<br/><br/>Fang Wang lifted his right hand, revealing one index finger.<br/><br/>“Ten percent comprehension?” Hong Chen asked.<br/><br/>Fang Wang shook his head, “That’s the time it will take to master it.”<br/><br/>“A thousand years to master?”<br/><br/>“Not so.”<br/><br/>“A hundred years? Have you truly penetrated its mysteries?”<br/><br/>Hong Chen’s brows furrowed tightly, his eyes showing some disappointment.<br/><br/>He acknowledged Fang Wang as the foremost talent in his eyes, but the Immeasurable Pure Bone Technique was not an ordinary skill, even if placed in the Upper Realm, it was among the strongest and most difficult to acquire techniques.<br/><br/>Fang Wang stood up, saying, “Thank you for the guidance.”<br/><br/>After that, he turned and left.<br/><br/>The door was pushed open, and Fang Wang stepped onto the grass. The sunlight spilled down on him, and he spread his arms, closing his eyes once more.<br/><br/>Hong Chen watched Fang Wang’s retreating figure from inside the house, wondering why, but he always felt that Fang Wang had changed, emanating an indescribably strong and increasingly intense presence.<br/><br/>Fang Wang stood still for a good while before disappearing from the spot.<br/><br/>He quickly found Xiao Zi, picked her up, and took her to the front of the Kunlun Formation. He directly activated the Kunlun Formation with his own Spiritual Power.<br/><br/>Throughout the process, Xiao Zi didn’t have time to react.<br/><br/>Xiao Zi’s dragon eyes widened as she pulled over the Soul Devouring Gourd from afar, while Zhao Zhen was holding two Shariras, likewise dumbfounded.<br/><br/>Boom—<br/><br/>The Kunlun Formation roared to life, loud and earth-shattering.<br/><br/>One by one, figures appeared outside the formation. Dugu Wenhun urgently shouted, “Dao Master, when will you return?”<br/><br/>Bright light ascended from the Formation stone platform, engulfing Fang Wang’s silhouette, as his voice drifted out, “In some years. I’m leaving Wangdao in your care.”<br/><br/>The bright light surged, taking Fang Wang and Xiao Zi with it.<br/><br/>Dugu Wenhun’s black clothes billowed dramatically, as he looked up, his face displaying a wry smile. He had absolutely not anticipated Fang Wang’s departure to be so abrupt.<br/><br/>However, he felt more excitement than anything else, as Fang Wang trusted him so strongly, he must make full use of his abilities to not let Fang Wang down!<br/><br/>On the other side.<br/><br/>After a period of transmission, Fang Wang arrived back at the Imperial Palace of the Grand Yu Divine Dynasty with Xiao Zi. Ignoring the gazes of the palace guards, he leaped out of the Imperial Palace and returned to his own Pilgrimage Manor.<br/><br/>“You all cultivate by yourselves.”<br/><br/>Leaving behind these words, Fang Wang entered his cultivation loft, leaving Xiao Zi alone in the courtyard, dumbfounded.<br/><br/>Zhao Zhen floated out from the Soul Devouring Gourd and asked, “What’s wrong with the master?”<br/><br/>Xiao Zi had no idea and was just as curious.<br/><br/>Soon, they felt nature’s spiritual energy surging towards Fang Wang’s loft. They were immediately relieved; as long as Fang Wang was truly cultivating, it meant that nothing serious had happened.<br/><br/>Inside the room.<br/><br/>Fang Wang was seated in meditation, his hands constantly forming seals, his expression grim. As he continued to cultivate, a smile began to spread across his face, growing increasingly exuberant.<br/><br/>This was the first time he had started to cultivate immediately after leaving the Heavenly Palace, not because the time spent practicing the Immeasurable Pure Bone Technique was too short, but on the contrary, it was too long!<br/><br/>It directly set a new record for the longest single cultivation retreat he had ever had in the Heavenly Palace.<br/><br/>The Mie Jue Divine Tome had taken him thirteen thousand years, the Formless Zhou Tian Technique nine thousand eight hundred years!<br/><br/>These two supreme techniques were already mighty, but the time spent on the Immeasurable Pure Bone Technique was even more astonishing!<br/><br/>Thirty-nine thousand years!<br/><br/>There were moments when Fang Wang nearly collapsed, but when he persevered and achieved Great Perfection, excitement took over.<br/><br/>He could no longer afford to vent his emotions; he only wanted to practice the Immeasurable Pure Bone Technique in reality!<br/><br/>The Immeasurable Pure Bone Technique was compatible with all Body Cultivation Techniques because most Body Cultivation focused on training muscles, bones, and blood, whereas the Immeasurable Pure Bone Technique transformed the very essence of the body!<br/><br/>This bone was impervious to any force’s corruption, eternally indestructible. By cultivating these bones, one’s sensitivity to all forces and paths would be greatly enhanced.<br/><br/>Beyond its many mysteries, the Immeasurable Pure Bone Technique inherently contained tremendous power!<br/><br/>This power was not simply physical strength but a special kind of force.<br/><br/>As Fang Wang cultivated, he reminisced about that attitude within the Heavenly Palace, looking down on everything, unrivaled in the world.<br/><br/>Never had a cultivation technique given Fang Wang such immense confidence.<br/><br/>When his Immeasurable Pure Bone Technique reached Great Perfection, he truly had an invincible confidence.<br/><br/>This confidence was not derived from comparison but arose naturally from within.<br/><br/>This was a cultivation technique that not even the Heaven Emperor could master!<br/><br/>Fang Wang felt that thirty-nine thousand years still did not represent the difficulty of the Immeasurable Pure Bone Technique. With his achievements in many Great Perfection cultivation techniques, he was undoubtedly the number one talent in the Mortal Realm, and perhaps even a genius in the Upper Realm. Yet, it still took him so much time to master this technique, cultivating ceaselessly without eating or drinking.<br/><br/>He even felt that without the Heavenly Palace, no matter how much time he spent, he might not be able to succeed!<br/><br/>The Red Dust Celestial Emperor was the best proof; as a Celestial Emperor, his talents must surpass all beings in the Mortal Realm!<br/><br/>The greatest strength of the Heavenly Palace was enabling Fang Wang to master any cultivation technique!<br/><br/>Boom<br/><br/>The spiritual energy of nature surging towards Fang Wang reached a new intensity, shocking the entire Imperial City and causing countless cultivators to turn their heads and look.<br/><br/>Even within the Imperial Palace, cultivators flew out.<br/><br/>Hong Xian’er appeared out of nowhere next to Xiao Zi, curiously asking, “What cultivation technique is your young master practicing?”<br/><br/>She could feel the change in the nature’s spiritual energy, which was not the pattern of Qi Gathering that occurred during a breakthrough.<br/><br/>Xiao Zi shook its head and said, “I don’t know either. The master has so many supreme techniques, cultivating another one is only to be expected.”<br/><br/>It had no interest in Fang Wang’s cultivation; even if Fang Wang were practicing an Immortal Law, it would find it normal.<br/><br/>Boom<br/><br/>Rolling thunderclouds gathered swiftly from all directions of the firmament, moving at extreme speed as if the sky changed color in an instant.\t\t\t\t\t\t</div>", "images": {}, "success": true}