{"id": 299, "url": "https://www.novelhall.com/i-became-an-immortal-on-mortal-realm-32879/14835139.html", "title": "Chapter 295 - Chapter 295 Chapter 292: There Are Skies Beyond Skies", "volume": 3, "volume_title": "Volume 3", "body": "<h1>Chapter 295 - Chapter 295 Chapter 292: There Are Skies Beyond Skies</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 295 Chapter 292: There Are Skies Beyond Skies<br/><br/>Hearing Fang Wang’s response, Zhou Xue’s lips curled up in amusement. She found that no matter how strong the kid was, he still spoke in a way that seemed to be begging for a beating. But she actually quite liked Fang Wang’s audacious spirit.<br/><br/>“The opponent this time is naturally not something Jiu You True Person can compare to. In fact, Jiu You True Person died quite unjustly. If he had obtained the inheritance of Jiu You, he would definitely be one of the strongest in the Mortal Realm,” she said.<br/><br/>Fang Wang didn’t have any doubts. His Jiuyou Zizaishu, Vajra Invincible Saint Body, and Great Celestial Infinite Scripture were all obtained by pursuing the inheritance of Jiu You. It was highly likely that Jiu You True Person had also inherited these supreme techniques, or even gained the recognition of the Ghost Emperor and obtained the fate of the Grand An Divine Dynasty. Following this line of thought, a Jiu You True Person who had grown in such a way would indeed be terrifying.<br/><br/>The Jiuyou Zizaishu was Fang Wang’s biggest trump card, without a doubt. The Vajra Invincible Saint Body and Great Celestial Infinite Scripture were also important components of the Heavenly Dao Immensity Scripture and the Heavenly Gang Supreme Yang Tyrant Body, which indicated the high value of the Jiu You inheritance.<br/><br/>“This time, I’m asking you to deal with the Buddhist Sect. I want to flatten the Buddhist Sect, and I won’t let you act alone; Zhu Rulai will accompany you there,” Zhou Xue said in a soft voice.<br/><br/>A look of anticipation appeared in her eyes.<br/><br/>The Buddhist Sect?<br/><br/>Upon hearing this, Fang Wang immediately raised his eyebrows in surprise. He had no good impression of the Buddhist Sect. During the conflict with the seven clans, the Suppressing Evil Golden Buddha of the Buddhist Sect had obstructed him. Had he not been strong enough, he might have perished then and there. He already had a grudge against the Buddhist Sect!<br/><br/>“Good, when do we start?” asked Fang Wang.<br/><br/>He was very much looking forward to a fight after many years of inaction.<br/><br/>The battle with Li Chunyang was nothing much; he hadn’t been satisfied with the fight.<br/><br/>“Three years from now, you will return to Sword Heaven Marsh, and I will have someone take you to the Buddhist Sect,” Zhou Xue said.<br/><br/>Fang Wang curiously asked, “Why three years?”<br/><br/>“During these three years, I need to find a way to weaken the fighting power of the Buddhist Sect. The factions within the Buddhist Sect are complex. In terms of their top combat power, the Buddhist Sect has several cultivators at the True Soul Realm. You should already know that above the Sky-Stepping Realm is the True Soul Realm. Among them, there is an ancient Buddha who is comparable to Celestial Qiankun. Although he hasn’t reached the Celestial Qiankun Realm yet, his power is enough to contend with Celestial Qiankun. I will find a way to prevent him from using his full strength,” she explained, to which Fang Wang almost spoke, then held his tongue.<br/><br/>He wanted to say not to weaken that ancient Buddha, but as the words reached his lips, he held them back.<br/><br/>He couldn’t be careless!<br/><br/>He absolutely couldn’t develop an excessively overconfident attitude.<br/><br/>Zhou Xue seemed to have sensed his thoughts and said, “The True Soul Realm cultivator you previously faced was unstable in fate, probably expelled by the Mie Jue Divine Tome, not a true True Soul Realm. Your strength should be able to match a True Soul Realm cultivator, but don’t be blindly confident. That ancient Buddha is not simple. In another fifty years, he will be able to reach Celestial Qiankun, and he can even perceive the Buddhist practices in the Upper Realm.”<br/><br/>“The Upper Realm also has a Buddhist Sect?” Fang Wang asked curiously.<br/><br/>Zhou Xue smiled and said, “Naturally, everything that exists in the Mortal Realm exists in the Upper Realm, only stronger.”<br/><br/>Fang Wang continued to ask, “Above the Upper Realm, is there a higher world? Or to put it another way, is the Upper Realm a part of the universe, or is it a world in and of itself, with endless space-time beyond it?”<br/><br/>In his previous life on Earth, when he would read novels about immortals and fantasy, their cosmology resembled stacking boxes, layer upon layer, with heavens beyond heavens, and beyond that, even more heavens.<br/><br/>Zhou Xue’s smile carried a teasing tone, “Whether there’s a higher world above the Upper Realm, I don’t know. But outside the Upper Realm, it’s not just endless space. The Mortal Realm we live in belongs to a vast universe, and there are other Mortal Realms beyond. However, the space beyond the Upper Realm is a forbidden zone. Being expelled from the Upper Realm is the greatest punishment there. The specifics, well, you will know when you go to the Upper Realm in the future.”<br/><br/>“Oh, I forgot, you don’t want to ascend, so I’m not sure if there will still be such opportunities for you.”<br/><br/>In response to Zhou Xue’s teasing, Fang Wang didn’t deny it.<br/><br/>His Lingxiao Divine Sect might actually allow him to travel to the Upper Realm!<br/><br/>However, his cultivation was not strong enough yet. Once he became strong enough, even without ascending, he could freely enter The Upper Realm with the help of Lingxiao Divine Sect.<br/><br/>Fang Wang was indeed looking forward to The Upper Realm.<br/><br/>Afterward, Fang Wang started to inquire about the past of the Red Dust Celestial Emperor. Zhou Xue indeed knew about the Red Dust Celestial Emperor and narrated his story one by one.<br/><br/>The Red Dust Celestial Emperor was the mentor of the Heavenly Emperor of the Celestial Court of The Upper Realm, not just the Heavenly Emperor, but even the first War God of the Celestial Court and many other powerful Immortal Gods were his disciples.<br/><br/>The Red Dust Celestial Emperor went through endless cycles of reincarnation, always seeking revenge. Yet, the powerful beings he raised ultimately joined the Celestial Court, cutting off their karma with him, a very tragic end.<br/><br/>Fang Wang began to sympathize with the Red Dust Celestial Emperor.<br/><br/>From the Red Dust Celestial Emperor’s perspective, this was indeed an inescapable curse, one of extreme despair.<br/><br/>The Red Dust Celestial Emperor taught Fang Wang the Immeasurable Pure Bone Technique, and with just this opportunity, Fang Wang must seek justice for him!<br/><br/>Three years passed quickly.<br/><br/>Time could alleviate everything and even obliterate it all. The common people of Grand Yu Divine Dynasty were once again caught up in new prevailing matters, and the battle between Fang Wang and Li Chunyang, due to its vague details, was soon forgotten.<br/><br/>This day.<br/><br/>The Kunlun Formation in Sword Heaven Marsh activated again, its intense light illuminating Sword Heaven Marsh and also brightening the distant Kunlun.<br/><br/>On the vast Kunlun Mountain, countless cultivators and demons looked back, all attracted by the light of the formation.<br/><br/>Fang Wang, accompanied by Xiao Zi, stepped out of the Kunlun Formation, with Xiao Zi carrying the Soul Devouring Gourd on her back.<br/><br/>Without waiting for Fang Wang to speak, Xiao Zi quickly slipped away; just then, Dugu Wenhun, Song Jinyuan, and others appeared on the open ground in front of the Kunlun Formation.<br/><br/>“I have returned this time to do something for Jin Xiao Sect and cannot stay for long,” Fang Wang said, initiating the conversation.<br/><br/>Dugu Wenhun smiled and said, “No problem, we won’t hold you up. Let’s go. The Red Dust senior has researched a Magic Artifact, designed especially for the Disciples of the Way of Hope. No matter the distance, we’ll be able to contact each other without needing you to return in person.”<br/><br/>Upon hearing this, Fang Wang immediately became interested and followed Dugu Wenhun and others away.<br/><br/>They made their way to a complex of pavilions in the core area of Sword Heaven Marsh and entered a great hall where Fang Wang saw Red Dust.<br/><br/>Red Dust stood up, looking at Fang Wang with a complex expression in his eyes.<br/><br/>Dugu Wenhun picked up a dark golden Token with the character “Wang” engraved on the back, its strokes vast and deep, while the front bore the words “Dao Master.”<br/><br/>He handed the Token to Fang Wang, introducing it, “This Token is called the ‘Wangdao Command.’ It does not change owners and binds with the disciple’s soul. It can trace the presence, lock onto karma, and the Token will only disperse if the disciple’s soul disperses. Such a treasure is unheard of to me.”<br/><br/>Fang Wang toyed with the Wangdao Command, sensing the restrictions within it—there were forty-nine, intricate and complex. Some of the restrictions were beyond his understanding.<br/><br/>He looked up at Red Dust, smiling, “Red Dust, you’ve put in great effort. This is indeed a great accomplishment. Why don’t you become the first of the Twelve Dao Sects? I’ll name it Xuan Zong; what do you think?”<br/><br/>Red Dust intended to refuse, but suddenly had a thought and nodded, saying, “I shall follow the Dao Master’s arrangement.”<br/><br/>Song Jinyuan then asked, “Fang Wang, speaking of the Twelve Dao Sects, shouldn’t there be a Sword Sect? Do you think we should make arrangements for it early on? It can’t be that Sword Heaven Marsh’s sword cultivators lack someone to take on the role of Sword Sect. If this gets out, the disciples below might…”\t\t\t\t\t\t</div>", "images": {}, "success": true}