{"id": 291, "url": "https://www.novelhall.com/i-became-an-immortal-on-mortal-realm-32879/14820581.html", "title": "Chapter 291 - Chapter 291 Chapter 288: Unsuppressable Phenomena, Known By All Creatures", "volume": 3, "volume_title": "Volume 3", "body": "<h1>Chapter 291 - Chapter 291 Chapter 288: Unsuppressable Phenomena, Known By All Creatures</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 291 Chapter 288: Unsuppressable Phenomena, Known by All Creatures<br/><br/>As celestial phenomena emerged, the activity at the Pilgrimage Manor grew increasingly intense, with nature’s Spiritual Energy rushing madly toward the manor, the sound of the wind it raised audible to all living beings in the city.<br/><br/>Cultivators soared into the sky to look on, while Demon Pets and spiritual beasts trembled.<br/><br/>At the Imperial Palace, in front of the main hall, Hong Shou stood with his hands behind his back, his gaze fixed on the distant Pilgrimage Manor. There, a spectacular whirlwind had formed overhead, its apex touching thunderclouds, morphing into a massive vortex that almost covered the entire Imperial City.<br/><br/>Zhui Feng appeared beside Hong Shou and whispered, “Your Majesty, it’s the Pilgrimage in training. He just couldn’t wait to cultivate after returning from the Kunlun Formation, and who knows what opportunity he obtained in Grand Qi.”<br/><br/>Hong Shou sighed, “He has only been back a few days, and even if he has obtained a great opportunity, look at this momentum. It’s truly inconceivable. Even if you acquired a world-defying cultivation technique, could you create such a disturbance in such a short time? This clearly isn’t the start of his cultivation but rather close to mastery.”<br/><br/>Hearing this, Zhui Feng’s expression changed.<br/><br/>Meanwhile, the entire Imperial City was discussing Fang Wang, curious about what extraordinary cultivation technique he was practicing.<br/><br/>Fang Wang himself was unaware of the outside world’s situation— he couldn’t wait to cultivate the Immaculate Dao Bones.<br/><br/>As time passed, Heavenly Might intensified more and more.<br/><br/>One after another, figures flew out from the Imperial City, hovering below the thunderclouds. Most of them looked elderly, and even those with young faces bore an air of late twilight.<br/><br/>“What in the world is this kid up to?”<br/><br/>“It seems the late emperor guessed right. With Fang Wang here, we old bones won’t get any rest from trouble.”<br/><br/>“Trouble is all right. For the future of Grand Yu, even if we die, we must conceal his Fate, especially from The Upper Realm.”<br/><br/>“Let’s get to it, old pals. Cast the spells and let’s chat.”<br/><br/>“What do you think Fang Wang is practicing? His energy doesn’t resemble Emperor Donggong’s Mie Jue Divine Tome at all.”<br/><br/>The old Cultivators discussed among themselves as they cast spells, their Spiritual Power stirring the sea of clouds above, mobilizing the entire Grand Yu Divine Dynasty’s Fate to isolate the celestial phenomena.<br/><br/>At first, they were quite relaxed, chatting and laughing.<br/><br/>But an hour later, their faces all darkened.<br/><br/>Two hours later, some gritted their teeth, and some even shivered.<br/><br/>An old woman said in a trembling voice, “It won’t hold… Why has it become like this?”<br/><br/>No one responded, everyone else was struggling to hold on.<br/><br/>Inside the Pilgrimage Manor.<br/><br/>Hong Xian’er was looking up at the sky, her face showing a look of surprise, murmuring to herself, “Even they can’t suppress Fang Wang’s celestial phenomena?”<br/><br/>She wasn’t unfamiliar with celestial phenomena; she had caused an hour-long phenomena before and knew that her father, the emperor, had suppressed Fang Wang’s attempt to shape the Nine Lives Precious Spirit, an act that had become a taboo in the Grand Yu Divine Dynasty, forbidden to be disclosed. In fact, once out of the Grand Yu Divine Dynasty, common cultivators would be affected by Emperor Donggong’s Divine Skills and forget this matter.<br/><br/>If the Nine Lives Precious Spirit’s celestial phenomena could be concealed, and this time it couldn’t.<br/><br/>What did that imply?<br/><br/>It implied that Fang Wang’s current opportunity surpassed that of the Nine Lives Precious Spirit!<br/><br/>This made Hong Xian’er intensely curious. She couldn’t help but look at Xiao Zi and asked, “Who has your master encountered?”<br/><br/>Upon hearing this, Xiao Zi snorted and said, “Who he has met, how could I tell you? You haven’t even begun your journey yet!”<br/><br/>Begun her journey?<br/><br/>Hong Xian’er was taken aback, then her pretty face blushed. She glared at Xiao Zi, picked it up, and began to knead it whimsically.<br/><br/>Beside her, Zhao Zhen suddenly noticed that the windows of the building where Fang Wang stayed became bright, and the light was still growing stronger.<br/><br/>Inside the room.<br/><br/>Fang Wang, sitting cross-legged in midair within the grand hall, glinted with silver light. He had shed his robe, sitting bare-skinned. Although the silver light obscured his skin, the Heavenly Gang Star Acupoints on his upper body were visible, forming thirty-six golden spots that continuously emitted a white flame, tracing the patterns of the Heavenly Gang Supreme Yang Tyrant Body on his body.<br/><br/>Suddenly, Fang Wang’s eyes snapped open, dazzling beams shooting forth. With a boom, he burst through the roof, shooting towards the firmament at an incredible speed.<br/><br/>Hong Xian’er reflexively looked up but couldn’t keep up with Fang Wang’s speed.<br/><br/>Almost instantly, a huge hole appeared in the clouds above, and a group of elderly cultivators from the Grand Yu Divine Dynasty, who were setting up a formation, felt a strong gust of wind blowing up from below. Their robes flapped violently, their figures nearly shaken back as they all looked up.<br/><br/>Amidst the hole in the sea of clouds, bathed in sunlight, a mysterious figure shone with silver light, standing beneath the sunshine, as nature’s spiritual energy from the heavens and the earth surged towards him.<br/><br/>The spiral of Spiritual Energy connected to the Pilgrimage Manor rose with him, converging into an even more magnificent whirlwind towards Fang Wang, causing all the buildings in the Imperial City to tremble.<br/><br/>“Form the formation!”<br/><br/>Accompanied by a resounding shout, a huge light barrier sprang up from the walls at the edge of Imperial City. Within three breaths’ time, a light screen formed, sheltering the entire Imperial City.<br/><br/>Countless cultivators rose like a shower of arrows from every street, gathering below the light screen, looking up at Fang Wang’s form.<br/><br/>At that moment, Fang Wang was enduring a pain unimaginable to ordinary people.<br/><br/>Bone cracking, bone forming, bone disintegrating, bone shedding…<br/><br/>Destruction for rebirth!<br/><br/>A transition from old to new!<br/><br/>Fang Wang had previously experienced this process in the Heavenly Palace. It had almost led to his collapse then, and even now, the pain was intense, but fortunately, he could endure it.<br/><br/>Under the watchful eyes of all, he could not afford to lose face!<br/><br/>As his bones began to shed and transform, the speed at which he absorbed Spiritual Energy became even more overbearing. Thousands of heavenly thunders wove around him, as if the heaven and earth were refusing the birth of the Immaculate Dao Bones.<br/><br/>On the edge of the Human Emperor Continent, waves crashed against the shore, thunderclouds churned above in the sky, oppressively heavy.<br/><br/>A figure stepped onto the shallows, stirring up splashes of water, advancing steadily onto the land. This was a man in black clothing bordered with red, carrying a long wooden box on his back, a flute attached to his belt. He stopped, lifted his head to gaze at the firmament, and from beneath his bamboo hat, a weathered face was revealed, his numb eyes flickering with a trace of movement.<br/><br/>“Such Heavenly Might… interesting… Emperor Donggong, is this your harbored hope?”<br/><br/>The man in black murmured, his tone laced with a hint of mockery.<br/><br/>“Don’t underestimate Fang Wang. That kid was able to slay a Sky-Stepping Realm cultivator with his Nirvana Realm cultivation. Now that he has stepped into the Heaven-Breaking Realm, his strength must certainly be measured with the True Soul Realm.”<br/><br/>A voice came from behind the man in black.<br/><br/>The man in black snorted, “Well, I’d like to see just how strong this unparalleled genius of ancient and modern times truly is. Just right, he is about to refine some kind of remarkable Cultivation Technique, so I will wait for his success!”<br/><br/>“Foolish! Take this opportunity to strike. Even if you can’t kill him, you might cause him to deviate into madness!”<br/><br/>The mysterious voice urged again, desperate in tone.<br/><br/>The man in black remained indifferent.<br/><br/>The mysterious voice angrily said, “Pure Yang! Don’t forget how you were defeated by Emperor Donggong! Losing is not fearful! What’s fearful is being careless and losing twice. Do you really think you can gamble once more? This is your only chance!”<br/><br/>On hearing this, the man in black was finally moved, his brows furrowed, and a cold light flickered in his eyes.<br/><br/>The mysterious voice continued to persuade, “It’s time for revenge, time to declare your return to the entire Mortal Realm. You were once a more dazzling figure than Emperor Donggong. Now, does anyone even know who you are?”<br/><br/>“As long as you slay Fang Wang, all beings under the heavens will know your name, and Emperor Donggong’s Mie Jue Divine Tome will not be able to suppress you!”\t\t\t\t\t\t</div>", "images": {}, "success": true}