{"id": 298, "url": "https://www.novelhall.com/i-became-an-immortal-on-mortal-realm-32879/14835136.html", "title": "Chapter 294 - Chapter 294 Chapter 291: Mortal Realm’S Number One Treasure", "volume": 3, "volume_title": "Volume 3", "body": "<h1>Chapter 294 - Chapter 294 Chapter 291: Mortal Realm’S Number One Treasure</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 294 Chapter 291: Mortal Realm’s Number One Treasure<br/><br/>Hearing Red Dust’s words, Gu Tianxiong immediately showed a look of surprise and joy. He excitedly asked, “You can’t deceive me; my treasured daughter is deeply favored by Fang Wang. Otherwise, with my cultivation, I wouldn’t have stayed in Sword Heaven Marsh and been treated so generously.”<br/><br/>Red Dust stared at the lake surface and did not continue the conversation.<br/><br/>Gu Tianxiong followed up with another question, “Senior, tell me, who can become one of the Twelve Dao Sects? What are the standards for the Twelve Dao Sects?”<br/><br/>Red Dust said indifferently, “Besides being powerful, the Twelve Dao Sects must also have a unique Dao lineage, like the Sword Sect, Body Sect, Soul Sect, Talisman Sect, and so on. In the short term, it’s impossible for the Wangdao to fill all twelve positions.”<br/><br/>“You mean Fang Wang doesn’t think highly of those Great Cultivators in Sword Heaven Marsh right now?”<br/><br/>“It’s not that he looks down on them, it’s just that the standards must be set high. Don’t be fooled by the mysterious air those cultivators put on; in the grand scheme of the Mortal Realm, they’re still lacking. Currently, no one in the Wangdao is stronger than the Dao Master, and you should know the Dao Master is only just over three hundred years old.”<br/><br/>The response from Red Dust plunged Gu Tianxiong into deep thought.<br/><br/>He was contemplating how to pull his daughter Gu Li into the Wangdao.<br/><br/>If he doesn’t let her return soon, she might lose her place in Fang Wang’s heart forever.<br/><br/>Like the Tai Xi Celestial Maiden from Suzhen Palace, who sends disciples every year with gifts, loudly proclaiming that they are from Suzhen Palace’s Tai Xi Celestial Maiden. Almost every cultivator and monster across the Descending Dragon Continent knows that Fang Wang has a confidante known as the Tai Xi Celestial Maiden.<br/><br/>Red Dust suddenly sighed, interrupting Gu Tianxiong’s train of thought.<br/><br/>Gu Tianxiong turned to him and asked, “Senior, why do you sigh?”<br/><br/>Red Dust spoke solemnly, “How can an ant understand the journey of an eagle.”<br/><br/>Gu Tianxiong raised his eyebrows, feeling insulted, yet he didn’t dare to retort.<br/><br/>Fine!<br/><br/>You’re the senior, you be lofty!<br/><br/>Gu Tianxiong immediately turned his head to focus on fishing. He had to win this round and make that old guy teach him his ultimate techniques!<br/><br/>Inside Pilgrimage Manor, within the courtyard.<br/><br/>Hong Xian’er stood next to Fang Wang, looking around with a strange expression on her face.<br/><br/>Xiao Zi and Zhao Zhen were observing the Shariputra in the courtyard pond, not interrupting them.<br/><br/>Fang Wang put down his tea cup and said irritably, “Stop looking; can you actually spot something new?”<br/><br/>Hong Xian’er sat down, her gaze fixed on Fang Wang, and said, “I keep feeling like you’ve changed a lot, but I can’t quite put my finger on what exactly has changed.”<br/><br/>“Gotten stronger, what else could it be?”<br/><br/>“No, it’s not just that. You don’t seem human anymore; you have the aura of Heavenly Materials and Earthly Treasures, and the presence you exude is mesmerizing.”<br/><br/>“Hey, miss, could you show some restraint?”<br/><br/>Fang Wang said sternly, causing Hong Xian’er to roll her eyes at him.<br/><br/>Hong Xian’er asked seriously, “Really, how strong are you now? Li Chunyang seems even more formidable than the Sky-Stepping Realm, probably cultivated to True Soul Realm, yet he was felled by one punch from you…”<br/><br/>Fang Wang shook his head as he replied, “I’m not sure how strong I am now, but I hope that the day when I find out just how strong I am never comes.”<br/><br/>Hong Xian’er twitched the corner of her mouth.<br/><br/>Since when was he so pretentious?<br/><br/>“If you don’t work hard at cultivating, you’ll eventually be left behind. You won’t be able to catch up with half of the Heaven Emperor’s decree,” Fang Wang said, staring at Hong Xian’er.<br/><br/>Bang!<br/><br/>Hong Xian’er slammed the table and stood up, glaring as she said, “Impossible, just you wait! I’ll breakthrough to the True Soul Realm before you!”<br/><br/>After speaking, she vanished from the spot, and Fang Wang followed suit with a smile.<br/><br/>He had purposely provoked her because he really didn’t want to continue answering.<br/><br/>Once I’ve gotten stronger, that’s all there is to it. What’s there to ask?<br/><br/>I, Fang Wang, just don’t love to inquire about how much stronger others have gotten!<br/><br/>Once Hong Xian’er had left, Fang Wang could finally enjoy some peace and quiet. Though the entire Grand Yu Divine Dynasty was now discussing him, as long as no one disturbed the Pilgrimage Manor, all was well.<br/><br/>While drinking tea, Fang Wang felt the natural world around him.<br/><br/>Having cultivated the Immeasurable Pure Bone Technique, he began to sense some of the elements between heaven and earth that were even harder to detect than Spiritual Energy, the fundamental elements that constituted the world.<br/><br/>These included the well-known elements of the five phases, among others. Everything, from towering mountains and buildings to flowers and trees, was made up of different elements.<br/><br/>Fang Wang wasn’t clear about the nature of these elements, but he could sense their presence.<br/><br/>Instinct told him that these elements would be key to his future cultivation path.<br/><br/>Dao bones…<br/><br/>Could these be the rules of heaven and earth, or perhaps the rules of the Great Dao?<br/><br/>Fang Wang had studied Sword Arrays, which could guide some of the forces of heaven and earth to unleash power far beyond what was put in through Spiritual Power.<br/><br/>Fang Wang reflected silently while feeling the natural world around him.<br/><br/>The sun set and the moon rose, and the night passed.<br/><br/>Early the next day, Fang Wang returned to his room to cultivate. He had just seated himself on his bed for meditation when he suddenly felt something and extended his divine consciousness into the Dragon Jade Ring.<br/><br/>His consciousness entered the Illusionary Realm.<br/><br/>Upon opening his eyes, he saw Zhou Xue before him.<br/><br/>Zhou Xue was dressed in Red Lotus Black Clothes and wore the Purple Jade Qilin Crown. She looked spirited and formidable, her brows revealing a sharp and forceful aura that was quite overpowering.<br/><br/>Fang Wang raised an eyebrow. With his current level of insight, it was clear to him that Zhou Xue’s constitution was anything but ordinary.<br/><br/>Zhou Xue was likewise sizing up Fang Wang. Her pupils suddenly dilated, as if she had understood something.<br/><br/>After a moment of silence, Fang Wang was the first to break the calm and asked, “What’s the matter? We haven’t seen each other in a few years, and you don’t know what to say? You don’t have someone else in your heart now, do you?”<br/><br/>Zhou Xue’s gaze returned to normal, and she calmly said, “Could it be the Immeasurable Pure Bone Technique passed down by the Red Dust Celestial Emperor?”<br/><br/>Fang Wang wasn’t surprised that Zhou Xue knew of the existence of the Red Dust Celestial Emperor, but he was amazed that she knew about the Immeasurable Pure Bone Technique.<br/><br/>“Do you know it too?” Fang Wang couldn’t help but ask.<br/><br/>Zhou Xue shook her head and said, “How could I know it? That’s a Dao bone legend from the Upper Realm. In my past life, I only heard of it, never having seen it with my own eyes. Even the Immortal Court doesn’t have anyone who possesses Dao bones.”<br/><br/>“It’s good that you are in the Mortal Realm. If you had cultivated Dao bones in the Upper Realm, your flesh, blood, and bones would be treasures sought after by the powerful. It’s not just monsters who would want to eat you; even human Immortal Gods would want to dig out your bones. You haven’t just gotten stronger; you’ve become the Mortal Realm’s most wondrous treasure.”<br/><br/>After saying this, she even intentionally licked her lips while giving him a blazing look, seeming quite bewitching.<br/><br/>Fang Wang lifted his right arm, brought it close to her, and chuckled, “Do you want my bones? Feel free to knock a piece off.”<br/><br/>Zhou Xue was stunned for a moment, then teasingly said, “One piece is not enough.”<br/><br/>“Then tell me how many pieces you want,” Fang Wang replied.<br/><br/>Zhou Xue gave him a deep look and asked, “Are you serious?”<br/><br/>Fang Wang smiled and said, “Why don’t you take away one of my ribs? Missing one won’t matter much.”<br/><br/>Zhou Xue rolled her eyes at him and said coldly, “I don’t want it, and don’t you dare give your bones to anyone else!”<br/><br/>Fang Wang replied irritably, “Do you really think I’m a fool? I’d give it to you because our relationship is the closest, you know.”<br/><br/>Hearing this, Zhou Xue smiled, a smile full of satisfaction.<br/><br/>She then said, “Since that’s the case, there’s a favor I’d like to ask of you. Would you be willing?”<br/><br/>Fang Wang nodded and said, “Go ahead. It must be something if you’re coming to me personally. I’m quite looking forward to it. I just hope it’s not too simple. The request from Jiu You True Person left me somewhat disappointed.”\t\t\t\t\t\t</div>", "images": {}, "success": true}