{"id": 308, "url": "https://www.novelhall.com/i-became-an-immortal-on-mortal-realm-32879/14859639.html", "title": "Chapter 304 - Chapter 304 Chapter 301: Celestial Qiankun, Eclipse!_1", "volume": 4, "volume_title": "Volume 4", "body": "<h1>Chapter 304 - Chapter 304 Chapter 301: Celestial Qiankun, Eclipse!_1</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 304 Chapter 301: Celestial Qiankun, Eclipse!_1<br/><br/>Fang Wang felt the sudden presence of a potent aura. Having heard Su Xuan’s murmurs to himself, he curiously asked, “Who is the person coming?”<br/><br/>Su Xuan replied, “According to Zhou Xue, this man is named the Unrighteous True Buddha. He calls himself unrighteous, dissatisfied with the Buddhist Sect’s sanctimonious principles. However, his dharma name has brought shame to the Sect, and therefore he has been hidden away. It is said that he is on the verge of stepping into the Celestial Qiankun Realm, making him the most powerful presence in the Sect.”<br/><br/>On the verge of stepping into the Celestial Qiankun Realm?<br/><br/>Fang Wang raised an eyebrow, a glint of fighting spirit in his eyes. Just as he was about to inquire further, suddenly, a shower of golden light fell, illuminating the entire broken Realm of the Buddhist Sect, compelling him to look up involuntarily.<br/><br/>Not just him, but also Zhou Xue, Zhu Rulai, and the Buddhist Sect disciples in the distance, all looked up, their faces filled with emotion.<br/><br/>“I seem to have underestimated you,”<br/><br/>Zhou Xue squinted her eyes, murmuring to herself, her emotions indiscernible from her tone.<br/><br/>Zhu Rulai peered into the sky. The firmament, riddled with black cracks, was now covered by waves of gold. In just a few breaths’ time, all living creatures within this realm felt as though they had been transported to another world.<br/><br/>Boom! Boom! Boom…<br/><br/>The battered earth erupted in a series of explosions, and one by one, stone statues burst forth from the ground and flew into the sky, each Buddha in a different pose, densely packed and beyond count.<br/><br/>In the blink of an eye, more than a million statues floated in the sky, and their number continued to grow.<br/><br/>Golden light rippled across the golden firmament as if a golden ocean hung upside down, an immense aura enveloping everything, intensifying the oppressive sensation felt by all beings in this realm.<br/><br/>Fang Wang raised an eyebrow. He spoke up, “This sensation is quite peculiar, it seems as though we’ve entered some sort of formation.”<br/><br/>“This is the spiritual vision of the Celestial Qiankun; he has pulled us into his Celestial Qiankun. Here, he is an omnipotent Immortal God,” Su Xuan said softly, looking up.<br/><br/>Fang Wang could feel that mysterious aura continuing to strengthen, as if a terrifying entity was rapidly approaching. Even with his current strength, he felt the pressure mounting.<br/><br/>The Unrighteous True Buddha was entirely different from the other Buddhist Sect Cultivators; he seemed to exist on another level altogether.<br/><br/>“Fortunately, he has not yet fully realized the Celestial Qiankun; this spiritual vision is not as sturdy as it seems,” Su Xuan said cryptically.<br/><br/>He turned to Fang Wang, a mocking smile on his lips, “Young man, you must be curious about your own limits, aren’t you? Care to give it a try?”<br/><br/>Fang Wang did not respond verbally. Instead, he let his actions speak, as the Tianling Body’s armored battle attire reattached itself over his white clothing, and the Heavenly Palace Halberd condensed as well.<br/><br/>“Hmph! Dare to destroy my Buddhist Sect, you are truly courting death. No matter where you come from, today, all of you shall sink into Avici Hell!”<br/><br/>An authoritative voice rang out, and as soon as these words were spoken, the world that had been bathed in golden light instantly turned into a blood-red one. The statues suspended in the sky all opened their eyes, each gaze shooting out terrifying blood-red lights.<br/><br/>Rumble rumble rumble—<br/><br/>Before anyone could react, a deafening roar descended from the heavens, as a massive palm rapidly fell down, its size ballooning so quickly it blotted out the sky, giving everyone in this realm the sense of impending doom.<br/><br/>Zhou Xue raised a hand, sensing something suddenly. Her right hand then dropped down.<br/><br/>Zhu Rulai materialized myriad avatars, preparing to confront the sky-covering palm descending from above. Out of the corner of his eye, he glimpsed something and his pupils abruptly constricted.<br/><br/>Not just him—more and more people turned to look, all in a state of stunned disbelief, including those with a Divine Heart.<br/><br/>There, on the horizon, a figure was rapidly growing larger—unmistakably, it was Fang Wang!<br/><br/>With a thunderous roar that shook heaven and earth,<br/><br/>Fang Wang grasped the Heavenly Palace Halberd with both hands, raised it above his head, and blocked the sky-covering palm. His feet dragged across the ground, carving out two massive ravines as dust billowed around him, engulfing mountains in its wake.<br/><br/>Even as a colossus, Fang Wang seemed minuscule beneath that overwhelming palm, yet he continued to grow larger still!<br/><br/>A hundred thousand feet was not his limit!<br/><br/>The Six Harmonies and Eight Desolations Seal can become as large as he can!<br/><br/>His feet abruptly stopped, his towering figure ignited with the flames of yang energy, and nine Black Dragons emerged from the tip of the Heavenly Palace Halberd, swiftly surrounding and covering the giant hand that blotted out the sky as if nine dragons were lifting this hand.<br/><br/>In everyone’s eyes, Fang Wang’s momentum was growing along with his enlarging stature, shaking the earth and mountains, bringing immense shock to all who witnessed it.<br/><br/>Zhou Xue saw this scene and was slightly stupefied.<br/><br/>Su Xuan’s eyes widened as he muttered, “What legacy is this?”<br/><br/>He stood behind Fang Wang, and from his perspective, Fang Wang looked as if he was connecting heaven and earth, almost filling his entire field of vision.<br/><br/>One hundred and fifty thousand zhang!<br/><br/>Two hundred thousand zhang!<br/><br/>Two hundred and fifty thousand zhang!<br/><br/>The earth and heavens quaked tremendously, and within this apocalyptic, blood-colored Illusionary Realm, the Buddhist Sect Disciples felt as though they were witnessing Immortal Gods in the world.<br/><br/>No!<br/><br/>It was more than Immortal Gods!<br/><br/>It was the creator god who opened the heavens and the earth!<br/><br/>Boom!<br/><br/>The giant hand that covered the sky suddenly exploded, turning into rolling black mist; Fang Wang felt an unstoppable force hit him, causing him to stagger backward involuntarily, as blazing flames surged out from within the black mist, scattering everywhere across the heavens and earth.<br/><br/>Fang Wang retreated seven steps, crossing a distance of a hundred li. He steadied his form, swung the Heavenly Palace Halberd to sweep away the black mist and flames above the Firmament, and a figure appeared before his eyes.<br/><br/>It was a monk wearing a Black Kasaya, embroidered with patterns of evil spirits. He sat cross-legged on a black lotus seat, with one hand on his knee in a wild posture, staring intently at Fang Wang, his handsome and indifferent face filled with murderous intent.<br/><br/>The Unrighteous True Buddha!<br/><br/>He appeared to be of average human size, yet the aura he emitted was even stronger than that of Fang Wang.<br/><br/>The millions of stone statues suspended in all directions simultaneously turned their bodies to face Fang Wang. The faces of each statue began to shed their stone layers, revealing deep purple skin, as if demons were about to come to life.<br/><br/>The Unrighteous True Buddha’s right hand condensed a Golden Vajra, its head adorned with golden chains and tiny skull beads dangling at the ends, swinging it towards Fang Wang.<br/><br/>Almost instantly, the world before Fang Wang’s eyes transformed dramatically. He saw millions of evil spirits rushing toward him, densely packed, occupying his entire vision and senses.<br/><br/>His eyes sharpened, and the Heart of the Heavenly Dao allowed him to discard all distracting thoughts as he thrust his halberd forward.<br/><br/>The Heavenly Palace Halberd shot out fiercely, over thirty thousand zhang in length; its charge was so domineering it could destroy all the mountains and peaks of the world!<br/><br/>Hum—<br/><br/>The Heavenly Palace Halberd suddenly stopped. The Unrighteous True Buddha raised his left hand, and with the index finger of his left hand, he blocked the Heavenly Palace Halberd through the air.<br/><br/>This scene was like a child stopping Mount Tai, the stark contrast in their sizes creating a visually stunning impact.<br/><br/>With a push of his left index finger, the Unrighteous True Buddha actually flicked the Heavenly Palace Halberd away, sending it flying ten thousand li away, smashing into distant mountains. The blade of the halberd pierced through the ground, its shaft still towering above the surrounding peaks.<br/><br/>Before Fang Wang could retrieve the Heavenly Palace Halberd, the Unrighteous True Buddha suddenly appeared in front of him.<br/><br/>With an evil smile across his face, the Unrighteous True Buddha once again swung his Golden Vajra, striking directly at Fang Wang.\t\t\t\t\t\t</div>", "images": {}, "success": true}