{"id": 301, "url": "https://www.novelhall.com/i-became-an-immortal-on-mortal-realm-32879/14852645.html", "title": "Chapter 297 - Chapter 297 Chapter 294: Ancestor Buddha Of The Present World, Shenxin", "volume": 4, "volume_title": "Volume 4", "body": "<h1>Chapter 297 - Chapter 297 Chapter 294: Ancestor Buddha Of The Present World, Shenxin</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 297 Chapter 294: Ancestor Buddha of the Present World, Shenxin<br/><br/>Inviting Zhu Rulai to join Wangdao was merely a jest from Fang Wang, who aimed to bolster Zhu Rulai’s confidence with such a proposition, never expecting the fellow to take it seriously.<br/><br/>Fang Wang hesitated, “If you were to join, what about the Jin Xiao Sect? How about this, if the Jin Xiao Sect ascends in the future and you don’t wish to ascend, then come to me. I shouldn’t poach directly; the Jin Xiao Sect and Wangdao are allies, advancing and retreating as one. Your presence will be the same anywhere.”<br/><br/>Zhu Rulai shook his head, “That was indeed Zhou Xue’s idea. She took a liking to a disciple from the Buddhist Sect and was afraid that, after I annihilated the Buddhist Sect, being in the same sect would cause trouble for me. Therefore, she suggested I join Wangdao, which coincidentally is in need of people. Of course, if you prefer that I don’t join, I’m willing to abstain.”<br/><br/>With things having reached this point, it was naturally difficult for Fang Wang to refuse, and he could only say, “After this matter is settled, I will ask Zhou Xue. If she truly wishes for you to join Wangdao, I naturally won’t object, and in the Twelve Dao Sects, there will certainly be a place for you.”<br/><br/>Zhou Xue had once evaluated Zhu Rulai, saying he possessed the potential of a Great Saint, yet he died under the siege of the Buddhist Sect.<br/><br/>Not all those who fail are of common talent, nor do only the most gifted always have the last laugh. Sometimes, fate is more important than natural talent.<br/><br/>Fang Wang and Zhou Xue had already changed the destinies of most people in this world. Who would ascend in the future, who would achieve Saintly Emperor Certification, was now an unknown!<br/><br/>As Fang Wang and Zhu Rulai hurried towards the Buddhist Sect, they chatted and grew increasingly close.<br/><br/>Atop a resplendent golden hall, two rows of monks with proud postures and dignified faces stood shoulder to shoulder, facing each other like guardians.<br/><br/>Above their heads floated numerous lotus thrones of various sizes, with Buddhas of different forms and postures – some as large as mountains, some reclining, others with fingers knotted resting on their knees – creating a dizzying display.<br/><br/>In front of the hall stood a hundred-feet-tall Golden Buddha, robust in figure and solemn in face, with eyes closed. However, a vertical eye on his forehead was open, staring at a monk kneeling before him on the ground.<br/><br/>This monk, clad in simple robes and appearing somewhat frail, had his forehead firmly pressed to the floor.<br/><br/>The vertical-eyed Golden Buddha spoke slowly, “Shenxin, your master has committed a grave violation. No amount of kneeling will make a difference. The Buddha cannot show partiality to anyone, not even if he is my own disciple and your master.”<br/><br/>Upon hearing this, the monk known as Shenxin lifted his head, revealing a handsome face, and urgently said, “Ancestor Buddha, my master has committed a grave violation, but it was because he was tricked by demons that he mistakenly harmed the innocent. Even if he must be punished, it is not necessary to destroy his spirit and seize his precious soul.<br/><br/>“My master has lived for three thousand years and saved countless beings. This time, he sought to save others and accidentally entered a demonic barrier created by demons, mistaking innocent beings for evil spirits and killing them. ‘An eye for an eye’ is the natural law of heaven and earth, but there must be consideration of primary and secondary causes. To fall back ten thousand steps, my master has saved millions of beings. Does not the merit of these deeds outweigh the sin of mistakenly killing a few hundred?”<br/><br/>The Ancestor Buddha remained expressionless and said, “Amitabha, we monks must be strict with ourselves. Merits and demerits offset each other, and this is how the Demons and heretics forgive themselves. Not taking life can sometimes be harder than saving life. Shenxin, if you fail to comprehend this, you have no right to inherit the Shariputra. Leave now.”<br/><br/>“But…” Shenxin grew anxious, ready to speak, as the surrounding Buddha Cultivators all began to chant in unison, their voices thunderous.<br/><br/>“Leave!”<br/><br/>“Leave!”<br/><br/>“Leave!”<br/><br/>It was as if billions of voices were shouting in unison, overwhelming Shenxin’s soul, turning his face deathly pale. He quickly stood up, performed the ritual prostration, and retreated.<br/><br/>He walked unsteadily towards the entrance of the great hall; the monks along the way remained expressionless as if they did not see him pass.<br/><br/>Fang Wang didn’t know how long he had walked, but he finally stepped out of the great hall, like a burden had been lifted from his shoulders. He wiped the sweat from his forehead and looked back, only to hear the sound of sutra chanting from within the hall—the figure of the ancestral Buddha was no longer visible.<br/><br/>Fang Wang’s expression was somber as he turned and descended the steps.<br/><br/>Red clouds spread across the sky, resembling dusk. He looked around and realized he was at the peak of the highest mountain, from which all other mountains seemed small. Numerous temples and monasteries dotted the other peaks, all part of the same expansive scenery.<br/><br/>Walking down the steps in a daze, Fang Wang didn’t return to his own monastery until nightfall.<br/><br/>He went to the stone bed inside the room, leaned against the wall with his arms around his knees, and buried his face in his arms.<br/><br/>Moonlight streamed through the window next to him, casting an elongated shadow of his figure.<br/><br/>Suddenly, another shadow emerged within his own, bearing a similar shape. This shadow turned around to face him.<br/><br/>“You should understand that the reason your master’s sin is so grave is because he harmed innocent people from the Saint Clans. Had they been merely mortals, not to mention your master, even an ordinary disciple wouldn’t have been brought before the Precept Hall,” a cold voice said.<br/><br/>Fang Wang’s body stiffened.<br/><br/>The cold voice continued, “Your master’s sin lies not in the killing, but in his dispute with the contemporary ancestral Buddha over Buddhist doctrine. Why bother yourself with it? Besides, your master is no good man.”<br/><br/>Upon hearing this, Fang Wang abruptly looked up, his eyes bloodshot, and shouted angrily, “Don’t talk nonsense! What do you know? You’re just my Heart Demon. Could you possibly see what I can’t?”<br/><br/>The cold voice chuckled, “You’re right, I can indeed see. Although I am you, I do not need to rely on your eyes to discern this world.”<br/><br/>Fang Wang fell silent.<br/><br/>“Actually, I know who killed your parents, your brothers, and sisters. Do you want to see the scene from that time?” the cold voice tempted.<br/><br/>Fang Wang clenched his teeth and said, “I won’t look, it’s all fake!”<br/><br/>“Do you think the contemporary ancestral Buddha and those Golden Buddhas can’t see me? With their cultivation, how could they simply say that you’re distracted? In fact, they’ve been waiting for me, not you.”<br/><br/>“What do you mean?”<br/><br/>Fang Wang’s complexion changed dramatically. He had been tormented by his Heart Demon for two hundred years and had often consulted his seniors within the sect, only to be told that he was too restless and that more chanting would do. At first, he believed them, but the Heart Demon persisted.<br/><br/>The shadow on the ground spread its hands and said, “The Buddhist Sect values your talent. Your master killed your family and brought you to the sect for this reason. Don’t be fooled by your master’s feud with the contemporary ancestral Buddha—it’s just a struggle for power. Your master will be fine, but you, you might be in trouble. Tian Dao Fang Wang’s sudden rise has caused the Buddhist Sect to feel threatened. They can’t wait for you any longer. They want to drive you mad so that I can take possession and fully unveil your talent.”<br/><br/>“Impossible… impossible…”<br/><br/>Fang Wang’s voice trembled, his body beginning to shake as well.<br/><br/>Then, seven more shadows appeared on the ground. Along with Fang Wang’s shadow, there were now nine shadows in total, all facing him.<br/><br/>“These mortals mistakenly believe I am your Heart Demon. They couldn’t be more wrong. I am you, you are me. They wish to control us, but why should we comply? Fang Wang, wake up. You’ve always lived in a deception. Why not live freely and unrestrained like Fang Wang?”\t\t\t\t\t\t</div>", "images": {}, "success": true}