{"id": 309, "url": "https://www.novelhall.com/i-became-an-immortal-on-mortal-realm-32879/14859752.html", "title": "Chapter 305 - Chapter 305 Chapter 302: The Power Of Celestial Qiankun_1", "volume": 4, "volume_title": "Volume 4", "body": "<h1>Chapter 305 - Chapter 305 Chapter 302: The Power Of Celestial Qiankun_1</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 305 Chapter 302: The Power of Celestial Qiankun_1<br/><br/>Facing the Golden Vajra of the Unrighteous True Buddha, Fang Wang could only execute the Lingxiao Divine Sect’s maneuvers, retreating backward, while using his arm to block the attack, because the adversary’s attack speed was simply too fast.<br/><br/>With a clang!<br/><br/>Fang Wang was sent flying hundreds of miles away, and the Unrighteous True Buddha raised an eyebrow, looking at Fang Wang with an expression of surprise.<br/><br/>Fang Wang felt a cold force infiltrating his body, recklessly ravaging his internal organs. He immediately exerted his power, and the Spiritual Power of the Heavenly Dao Immensity Scripture combined with the yang energy of the Heavenly Gang Supreme Yang Tyrant Body quickly purged this cold force.<br/><br/>“Such a strong physique, kid, state your name,” the Unrighteous True Buddha spoke, his voice commanding, yet his face was adorned with a cold and arrogant smile, a stark contrast to his tone.<br/><br/>Fang Wang then shrank to a normal size, transforming back from his enlarged form. He lifted his right arm, and the Heavenly Palace Halberd in the distance shot up from the ground, flying towards him. Shrinking rapidly in midair, it returned to its normal size and fell into his hand.<br/><br/>“Fang Wang.”<br/><br/>Fang Wang uttered his name, his face bearing an excited smile.<br/><br/>Such strong power!<br/><br/>Such quick speed!<br/><br/>Having spent days cultivating within the Heavenly Palace, Fang Wang had nearly forgotten the feeling of encountering a formidable enemy.<br/><br/>The Unrighteous True Buddha gave him a tremendous sense of oppression and the utmost thrill of danger!<br/><br/>The more powerful the enemy, the more excited Fang Wang became. At that moment, he suddenly understood that the Immaculate Dao Bones had brought about not only a physical metamorphosis but a transformation of his mental method as well.<br/><br/>A conviction that he was the strongest emerged deep within his heart!<br/><br/>This confidence flowed through his Dao Bones, throughout his muscles and bones, reaching the depths of his soul, filling his entire being with self-assurance. No matter how powerful an existence he faced, his flesh and spirit would not be subdued; henceforth, he knew not what fear was.<br/><br/>“Fang Wang? Good name!”<br/><br/>The Unrighteous True Buddha expressed his admiration and then vanished from his spot, appearing almost instantly in front of Fang Wang.<br/><br/>The great battle ignited once again!<br/><br/>Boom!<br/><br/>The collision between the Heavenly Palace Halberd and the Golden Vajra unleashed a terrifying shockwave; the ground within a radius of ten thousand miles collapsed instantly, as dust billowed into the sky and stones flew chaotically.<br/><br/>Zhou Xue raised her hand, shielding herself from the direction of Fang Wang and the Unrighteous True Buddha’s fight, a terrifying tempest swept through, and a vast red barrier protected her, Zhu Rulai, and all the Buddha Cultivators who had surrendered.<br/><br/>This spectacle caused the Buddhist Sect Cultivators to turn their heads in astonishment, not expecting this woman to possess such profound cultivation.<br/><br/>Zhu Rulai cast a deep glance at Zhou Xue and then continued to watch the fierce battle between Fang Wang and the Unrighteous True Buddha.<br/><br/>With the heavens and the earth roaring, Fang Wang and the Unrighteous True Buddha kept shifting positions, causing explosions at the horizon’s end. All the spectators were continually turning, following their movements.<br/><br/>Fang Wang rapidly wielded the Heavenly Palace Halberd with each strike formidable and forceful; the Unrighteous True Buddha’s movement technique was equally exquisite, not only keeping up with Fang Wang’s Lingxiao Divine Sect maneuvers but also dodging the attacks of the Heavenly Palace Halberd.<br/><br/>The Unrighteous True Buddha swirled the Golden Vajra with his right hand, while his left hand kept forming incantations. The strange chanting of the Buddha reemerged, sounding throughout heaven and earth just as when the Unrighteous True Buddha had arrived, but this time, his Buddhist chanting caused the spirits of all beings to become enraptured. Those Buddhist Sect Cultivators under Zhou Xue’s protection painfully clutched their heads.<br/><br/>Fang Wang was also affected, but luckily the Heart of the Heavenly Dao allowed him to retain as much rationality as possible, so his attack did not slow down.<br/><br/>The Unrighteous True Buddha’s left hand suddenly clenched into a fist, which turned to gold, and he struck Fang Wang’s chest with a punch.<br/><br/>Boom!<br/><br/>The half of the heaven and earth behind Fang Wang shattered instantly, the sky turned into countless blood-red shards, the earth into broken stones, and his body was sent flying.<br/><br/>Before Fang Wang had flown out a hundred zhang, his eyes focused, and he forcefully stabilized his form. Then, a fierce Yang energy ignited all over him, converging in his mind to form twelve orbs of flame, like twelve small suns orbiting behind his head. The golden flames on the dragon horns of the Heavenly Dao Imperial Dragon Crown soared, stretching up to ten zhang.<br/><br/>At this moment, Fang Wang’s aura reached another height!<br/><br/>Zhou Xue, Zhu Rulai, and the Buddha Cultivators could all feel his astonishing momentum, especially the Buddhist Sect Cultivators, each of them terrified. Outside the red light shield, everything was breaking and vanishing; this land was facing its downfall.<br/><br/>This was the first time Fang Wang seriously fought using the Heavenly Dao Immensity Scripture; he was not purely a body cultivator!<br/><br/>Feeling Fang Wang’s powerful aura, the Unrighteous True Buddha’s black kasaya billowed violently, and he revealed a crazed smile, praising, “A tyrannical physique, and profound mental methods that dazzle through ancient and modern times, Fang Wang, you are qualified to be a Saintly Emperor. No wonder those old immortals said that what’s to come will be an unprecedented golden age for the human world. I didn’t believe it before, but seeing you, I believe.”<br/><br/>“In the future, you will surely be an existence beyond my reach, but snuffing out a genius can also be quite interesting!”<br/><br/>“Feel the power of the Celestial Qiankun!”<br/><br/>The Unrighteous True Buddha’s last sentence came out as a roar, and in the shattered blood-red sky and earth, the stone statues with faces revealed raised their palms, striking towards Fang Wang.<br/><br/>In an instant, fragments of the sky, rocks of the earth, and all vegetation were hurled at Fang Wang, as if the entire world was collapsing in on itself with him at the center.<br/><br/>For the first time, Fang Wang saw a scene of world destruction. He glanced over and saw, amid the chaos and dimness, Zhou Xue’s red light shield still held; he immediately felt relieved.<br/><br/>He placed the Heavenly Palace Halberd next to him and raised his left hand, with the Town World Bead forming in the center of his palm. Then, rising into the air, it floated above his head.<br/><br/>In an instant, the diameter of the Town World Bead grew to a thousand zhang and then erupted with a terrifying swallowing force, drawing all things from heaven and earth within it.<br/><br/>This spectacle made the Unrighteous True Buddha raise an eyebrow.<br/><br/>The Unrighteous True Buddha let go of the Golden Vajra, his right hand forming a palm in front of his mouth. He began to recite a strange and incomprehensible scripture, and as the Buddhist sounds emerged, specks of golden light formed in front of him, continuously concentrating to quickly mold into a huge golden disc. The disc was divided into six sections, each revealing a different dharma aspect: humans, demons, and monsters.<br/><br/>Amid the howling wind, Fang Wang’s black hair fluttered. He looked at the Unrighteous True Buddha, flexed the fingers of his right hand holding the Heavenly Palace Halberd, and suddenly leaped forward, vaulting over the Town World Bead with a halberd strike aimed at the Unrighteous True Buddha.<br/><br/>Under the blessing of the Heavenly Dao Immensity Scripture, his speed far surpassed that of before!<br/><br/>The Unrighteous True Buddha’s pupils shrank as he thrust his right palm forward fiercely, the giant golden disc moving with speed not inferior to Fang Wang’s to smash into him.<br/><br/>Boom!<br/><br/>A vast golden shockwave burst forth, shattering everything in its path.<br/><br/>Zhou Xue frowned, pushing her right arm forward with force, and the red light shield expanded many times over. Her robes fluttered violently, outlining her perfect figure.<br/><br/>Within the golden shockwave, a Black Python and a fierce ghost clung to Fang Wang’s body, golden chains entwining his limbs. A female ghost approached him, reaching out her white hand towards Fang Wang’s forehead.<br/><br/>“Such a perfect physique should be offered to the True Buddha,” the female ghost said with a laugh, her voice seductive, stirring the imagination and captivating all beings.<br/><br/>However, as soon as her hand touched Fang Wang’s forehead, her expression changed drastically, letting out a piercing scream.\t\t\t\t\t\t</div>", "images": {}, "success": true}