{"id": 307, "url": "https://www.novelhall.com/i-became-an-immortal-on-mortal-realm-32879/14859638.html", "title": "Chapter 303 - Chapter 303 Chapter 300 Hongxuan Emperor And Descending Dragon Great Saint", "volume": 4, "volume_title": "Volume 4", "body": "<h1>Chapter 303 - Chapter 303 Chapter 300 Hongxuan Emperor And Descending Dragon Great Saint</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 303 Chapter 300 Hongxuan Emperor and Descending Dragon Great Saint<br/><br/>Fang Wang looked toward Su Xuan and Dust-Light Divine Monk, curious about the identities of these two.<br/><br/>Both of them emitted a presence not inferior to that of the current Descending Dragon Great Saint, especially Su Xuan, who carried an aura that felt familiar to Fang Wang, as if he had experienced it somewhere before.<br/><br/>When Zhou Xue saw his gaze, she immediately introduced them, saying, “This is a cultivator from our sect named Su Xuan, and this is Dust-Light Divine Monk, whom you have met.”<br/><br/>Dust-Light Divine Monk?<br/><br/>After a moment of thought, Fang Wang suddenly remembered that the one who had come to the aid of the Suppressing Evil Golden Buddha when he was opposing the Buddhist Sect had been the Dust-Light Divine Monk; it was just that time had passed, and he had forgotten the man’s face.<br/><br/>The Dust-Light Divine Monk had not made a move against Fang Wang back then, so Fang Wang did not bear much hatred towards him and did not keep him in mind.<br/><br/>Su Xuan spoke up, “Boy, what is your relationship with Descending Dragon Great Saint and Hongxuan Emperor?”<br/><br/>Fang Wang replied, “I have received their legacies; they both could be considered my masters.”<br/><br/>To regard the Descending Dragon Great Saint and Hongxuan Emperor as his own masters did not seem to Fang Wang to be a loss of face, even though he was confident of surpassing them both.<br/><br/>To remember a favor received was a principle Fang Wang always adhered to in life.<br/><br/>Even if someone said in the future that his success was due to the legacies of many Great Saints and Great Emperors, he would not mind, for these predecessors had indeed helped him.<br/><br/>“No! Absolutely not!” Su Xuan exclaimed with wide eyes, his tone full of dissatisfaction.<br/><br/>Fang Wang looked at him in surprise. Was this guy crazy?<br/><br/>Su Xuan then said, “Boy, come with me. We need to talk in private.”<br/><br/>Fang Wang looked over at Zhou Xue, only to see her smiling and nodding, so he decided to comply with Su Xuan’s request, and the two flew off towards the horizon.<br/><br/>Zhu Rulai was curious but did not say much; he was well aware of the relationship between Zhou Xue and Fang Wang.<br/><br/>“I want to take these people to join Wangdao and create a new Buddhist Sect,” Zhu Rulai said earnestly.<br/><br/>Zhou Xue nodded and then raised her hand to point at someone, saying, “You can take anyone else, but that person must belong to me.”<br/><br/>She was pointing at Shenxin.<br/><br/>Shenxin was not surprised by her pointing; after all, Fang Wang had mentioned this before.<br/><br/>Zhu Rulai looked at Shenxin and asked curiously, “Is this child extremely talented?”<br/><br/>“He is the Nine Lives Precious Spirit. What do you think?” Zhou Xue said with a light laugh, her tone slightly mocking.<br/><br/>Zhu Rulai’s pupils contracted. He did not question Zhou Xue’s words because he had seen too many incredible people in the Jin Xiao Sect.<br/><br/>He shook his head and exclaimed, “With such talent, it’s indeed worth it for you to take him under your wing.”<br/><br/>Zhou Xue’s smile seemed to both jest and not jest as she said, “It’s not just that. I’m afraid following Fang Wang will cause him to lose confidence, a disservice to the talent of the Nine Lives Precious Spirit.”<br/><br/>Zhu Rulai froze. Was Shenxin not a match for Fang Wang?<br/><br/>Could it be…<br/><br/>Thinking back to the previous great battle when Fang Wang had used his Lifespirit Treasure, Zhu Rulai suddenly guessed a possibility and couldn’t help but show a wry smile on his face.<br/><br/>He was actually thinking of comparing himself to Fang Wang!<br/><br/>Elsewhere.<br/><br/>Fang Wang followed Su Xuan to an area of ruins. Su Xuan extended his right index finger and drew a circle on the ground around them. As soon as they were enclosed, a layer of restrictive formation sprang up from the ground, separating them from the outside world.<br/><br/>Fang Wang found such methods very interesting.<br/><br/>Indeed, while Fang Wang appeared to be well-rounded, his attainments in restrictions and formations were mediocre, certainly not as profound as those of immortal gods.<br/><br/>Su Xuan looked at Fang Wang with a serious expression and said, “The Descending Dragon Great Saint is considered a disciple of the Hongxuan Emperor, and you can’t regard them as your masters at the same time—it would muddle the seniority!”<br/><br/>Huh?<br/><br/>Fang Wang asked in surprise, “What do you mean? How do you know this? You’re not somewhere in the middle of that lineage, are you?”<br/><br/>“That’s right, I am a disciple of the Hongxuan Emperor, and I am also the master of the Descending Dragon Great Saint. Of course, the Hongxuan Emperor has more than one disciple, and the Descending Dragon Great Saint has more than one master, but we must not confuse this line of master-disciple seniority. Although that old fellow Hongxuan Emperor is somewhat ineffectual, his achievements are still there,” Su Xuan snorted.<br/><br/>Fang Wang raised an eyebrow and asked, “May I ask how long senior has lived?”<br/><br/>Su Xuan folded his arms and pondered, “Nearly fifty-five thousand years, I suppose.”<br/><br/>“Is senior perhaps also a Great Saint?”<br/><br/>“I used to be, but I was stripped of my saintly title and am barely clinging to life.”<br/><br/>“Great Saints can be stripped of their titles?”<br/><br/>“Otherwise, if that were not the case, I would have perished along with the Hongxuan Emperor long ago. To survive, I had to bear karma, and I have spent most of my years in a confused and tormented state.”<br/><br/>Fang Wang grew even more curious and began to inquire about that period.<br/><br/>Su Xuan did not hold back and began to recount those years.<br/><br/>When the Hongxuan Emperor was at his peak, his birth was accompanied by celestial phenomena—an incessant, heavy rain that poured for three days and nights. The spiritual energy in the continent where he lived ascended, attracting the attention of the Hongxuan Emperor, who then took him back and taught him cultivation.<br/><br/>He achieved the status of Great Saint at two thousand years old, becoming the second person in the mortal realm to do so. People around the world even believed he had the potential to surpass the Hongxuan Emperor.<br/><br/>However, as the Upper Realm plotted against the mortal realm, the Hongxuan Emperor flew into a rage, ascended to the Upper Realm, and caused a great commotion, setting off a war between the two realms. The mortal realm was no match for the Upper Realm, and Su Xuan was suppressed by one of the immortal gods, fortunate to be rescued by the Hongxuan Emperor.<br/><br/>The Hongxuan Emperor realized he was not yet a match for the Upper Realm, so he forcefully stripped Su Xuan of his Great Saint title. At that time, Su Xuan was not even three thousand years old, and even as a Great Saint, he was no match for the Hongxuan Emperor.<br/><br/>Afterward, the Hongxuan Emperor faced his fate alone, and Su Xuan, like Xiao Zi, barely survived by clinging to life.<br/><br/>In the following years, Su Xuan lay low in the mortal realm, cultivating three Great Saints, including the Descending Dragon Great Saint. Unfortunately, all the Great Saints who came after him met untimely deaths.<br/><br/>“It’s a shame about the Descending Dragon. Although he was a late bloomer, his understanding of the Dao surpassed all the previous Great Saints after his ascension. He even uncovered the existence of the Tai Cang Immortal Mansion. Alas, he was targeted by the Upper Realm and died prematurely. If he had lived to the age the Hongxuan Emperor had, he might well have survived,” lamented Su Xuan.<br/><br/>Speaking of the Descending Dragon Great Saint, his face was full of regret.<br/><br/>Fang Wang couldn’t help but ask, “It seems that those Great Saints didn’t truly die, as their souls remain in the mortal realm. If you miss him, why don’t you go find him?”<br/><br/>“Dead is dead, what use are lingering souls? They might at most leave some inheritance for their descendants. Do you think they should come back to life? Even the Thousand Eyes Great Saint, who put all his effort into resurrection, was still pressed down by you, wasn’t he?” Su Xuan said dismissively.<br/><br/>“Well reasoned, may I ask if senior has ever met the Absolute Emperor?”<br/><br/>Fang Wang was very curious about the Absolute Emperor. Zhou Xue had said the Absolute Emperor came from the Upper Realm, and Fang Wang wondered what the Absolute Emperor had done in the mortal realm.<br/><br/>Upon hearing the name of the Absolute Emperor, Su Xuan’s face turned unnatural and he said, “Don’t inquire about him. He comes from the Upper Realm, and although he brought benefits to the mortal realm, our stances are ultimately different. Also, don’t go seeking his inheritance.”<br/><br/>Seeing his expression, Fang Wang guessed that he probably had encountered the Absolute Emperor and probably hadn’t defeated him.<br/><br/>Just as Su Xuan was about to say more, a Buddhist chant descended from the sky, resounding throughout the Realm of the Buddhist Sect.<br/><br/>Looking up, Su Xuan raised an eyebrow and muttered to himself, “Interesting, to think someone could withstand my karmic curse technique. No wonder that girl Zhou Xue asked me to come here.”\t\t\t\t\t\t</div>", "images": {}, "success": true}