{"id": 305, "url": "https://www.novelhall.com/i-became-an-immortal-on-mortal-realm-32879/14858677.html", "title": "Chapter 301 - Chapter 301 Chapter 298 The Gap Of Nine Lives Precious Spirit_1", "volume": 4, "volume_title": "Volume 4", "body": "<h1>Chapter 301 - Chapter 301 Chapter 298 The Gap Of Nine Lives Precious Spirit_1</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 301 Chapter 298 The Gap of Nine Lives Precious Spirit_1<br/><br/>Boom!<br/><br/>A Golden Buddha crashed to the ground, lifting up clouds of dust hundreds of feet high, with specks of golden blood splattering within the rolling dust waves.<br/><br/>More and more figures of Buddha Cultivators fell from the sky, accompanied by a rain of blood, as black cracks spread across the Firmament.<br/><br/>Fang Wang was still fighting. Since executing the current patriarch of the Buddhist Sect, no one within could stand against him. The eighteen Golden Buddhas earlier were a surprise, but alas, these eighteen Golden Buddhas didn’t last long against him either.<br/><br/>Fang Wang slowed his offensive and began to observe Zhu Rulai’s battle.<br/><br/>Previously, Zhu Rulai’s Heaven and Earth God-Transforming Technique had used the Sombre Dark Sea as his incarnation. As long as the Sombre Dark Sea was indestructible, he would not die and could create endless incarnations. This time was different; Fang Wang could clearly feel that Zhu Rulai’s Heaven and Earth God-Transforming Technique had significantly improved.<br/><br/>Who knows what he had fused with to create so many avatars?<br/><br/>Even with Fang Wang’s level of cultivation, he couldn’t see through it.<br/><br/>He suspected that Zhu Rulai was hiding something.<br/><br/>“Disciples of the Buddhist Sect, listen. You all believe that your lives were saved by the Buddhist Sect, not realizing that it was the Buddhist Sect that caused your origins. The Buddhist Sect coveted our talents, so they killed our families, leaving us with no distractions and grateful for their adoption and teaching. If there is still a shred of conscience in your hearts, then think carefully, is the Buddhist Sect you see truly righteous?”<br/><br/>“The Buddha founded the Buddhist Sect for the sake of all sentient beings, to reduce the sins of the world. Yet today’s Buddhist Sect has become a source of sin!”<br/><br/>Zhu Rulai’s voice rose, not as a single person speaking, but all his incarnations fighting and speaking in unison. Their voices drowned out all other roaring sounds between heaven and earth, reaching the ears of all Buddha Cultivators.<br/><br/>Fang Wang had swept away most of the Buddhist Sect’s high-ranking officials, causing their morale to plummet. Many disciples of the Buddhist Sect were already wavering, and upon hearing Zhu Rulai’s words, they were moved.<br/><br/>The disciples of the Buddhist Sect were originally supposed to undergo trials in the mortal world, and many had their suspicions about their origins but dared not accept the truth. Even if they believed the truth, they could not give up the status and benefits brought by the Buddhist Sect. Especially when they began to take disciples in the same manner, they understood the intentions behind the Buddhist Sect’s actions even more.<br/><br/>Only by severing karma could they cultivate more effectively!<br/><br/>Now facing the danger of life and death, they naturally wanted to survive.<br/><br/>Zhu Rulai’s words seemed to tell them that there was still a chance to turn back!<br/><br/>Fang Wang noticed that not a single disciple of the Buddhist Sect had fled; they either hid and watched from a distance or continued to fight fiercely.<br/><br/>Suddenly.<br/><br/>Fang Wang caught sight of someone. The moment his gaze swept over that person, he involuntarily paused.<br/><br/>Shen Xin felt Fang Wang’s gaze and subconsciously avoided it. Just as he was about to turn around, he saw Fang Wang, causing him to quickly retreat in shock.<br/><br/>“You…”<br/><br/>Shen Xin was greatly startled, his right hand moving behind him on instinct, condensing nine black Sharira in his palm.<br/><br/>Fang Wang stared intently at Shen Xin, not knowing why, but upon seeing this person, his blood began to boil. It wasn’t a reaction from the Heavenly Gang Supreme Yang Tyrant Body, but from the Tianling Body.<br/><br/>He inexplicably felt that the other person also possessed the Nine Lives Precious Spirit.<br/><br/>This sensation was strange, but it was certainly there.<br/><br/>Fang Wang raised the Heavenly Palace Halberd, with its tip aimed at Shen Xin, and asked, “Do you possess the Nine Lives Precious Spirit?”<br/><br/>Hearing this, Shen Xin’s face turned ugly. Being well aware of the disparity between himself and Fang Wang, he naturally feared being killed for the Nine Lives Precious Spirit.<br/><br/>As Fang Wang paused, not a single Great Cultivator from the Buddhist Sect dared to rescue Shen Xin.<br/><br/>Shen Xin gave a self-deprecating smile, then lifted his eyes to Fang Wang. He slightly raised his chin, looking at Fang Wang with an arrogant and defiant gaze, and said, “That’s right, you too. If you fear my future, then kill me!”<br/><br/>“Taunting me? Aren’t you afraid that I might really kill you?”<br/><br/>“Then kill me. I’ve long since wanted to leave this wretched world. Even if I die, my fate will carry me on to reincarnate, and I will eventually return to the mortal realm. That is the power of the Nine Lives Precious Spirit. You should understand that you can only kill me in this life, not truly eradicate me.”<br/><br/>Shen Xin looked at Fang Wang with an expression utterly devoid of fear.<br/><br/>Fang Wang’s eyes grew sharp, and his right hand suddenly let go, as the Heavenly Palace Halberd fiercely attacked Shen Xin.<br/><br/>Boom!<br/><br/>A spectacular vacuum area was blasted through the rolling dust behind Shen Xin, stretching to the end of heaven and earth. Shen Xin’s monk robes tore apart, nearly becoming shredded rags, and his eyes involuntarily widened.<br/><br/>The Heavenly Palace Halberd was right in front of his eyes!<br/><br/>“So fast… How is this possible…”<br/><br/>Shen Xin trembled all over. The oppressive feeling from that brief moment made his heart pound with fear, and he instinctively gasped for air, while his right hand behind his back shook uncontrollably, with nine black shariras faintly visible.<br/><br/>“This aura… How is it possible! His halberd…”<br/><br/>“Don’t provoke him! He carries the aura of the Mie Jue Divine Tome. Damn it, what is his relationship with the Absolute Emperor?”<br/><br/>“Not just the Absolute Emperor, but also the aura of the Hongxuan Emperor, the one who once caused upheaval in the Immortal Court.”<br/><br/>“No wonder he is so powerful, having amassed so much inheritance and destiny at a little over 300 years old…”<br/><br/>Many voices echoed in Shen Xin’s mind, all his own, each with different emotions.<br/><br/>Cold sweat covered his forehead, and his chest heaved violently, his mouth opening unconsciously.<br/><br/>“You don’t seem as strong as you look,” Fang Wang’s voice reached Shen Xin’s ears. He then withdrew his own momentum, no longer intimidating Shen Xin.<br/><br/>Shen Xin felt a huge relief and his face flushed red. Lowering his head, he clenched his teeth and asked, “What exactly do you want to do to me?”<br/><br/>Fang Wang calmly said, “Join the Jin Xiao Sect and cultivate well. When you’re strong enough, come and challenge me. There’s also a disparity between Nine Lives Precious Spirits, and I want to see who is stronger, you or me.”<br/><br/>Upon hearing this, Shen Xin raised his head and looked at Fang Wang with disbelief.<br/><br/>Fang Wang retracted the halberd and turned to leave.<br/><br/>Shen Xin hastily asked, “Why the Jin Xiao Sect?”<br/><br/>Without turning back, Fang Wang replied, “Because I was commissioned by the Jin Xiao Sect to come here. The Jin Xiao Sect wants to annihilate the entire Buddhist Sect, sparing only your life.”<br/><br/>Shen Xin stood frozen in place, confused. He had never heard of the Jin Xiao Sect, so he wondered why they would want to save him.<br/><br/>He had only awakened the Nine Lives Precious Spirit the night before.<br/><br/>Watching Fang Wang continue his massacre, Shen Xin took a deep breath and clenched his fists.<br/><br/>He did not sympathize with the Buddhist Sect; in fact, he disliked it even more than Fang Wang did. However, seeing Fang Wang’s elegance filled him with an endless yearning.<br/><br/>He wanted to be strong just like Fang Wang!<br/><br/>“Once I grow up, you will regret this. But since you didn’t kill me, after I defeat you, I too will spare you once…” Shen Xin thought to himself, looking at Fang Wang’s continuously shifting figure.<br/><br/>He didn’t notice that the many voices in his mind had unusually quieted down.<br/><br/>Elsewhere.<br/><br/>Outside the Realm of the Buddhist Sect.<br/><br/>Looking around, one saw only devastation, with mountains collapsed and forests overturned.<br/><br/>Within a ruin, the Dust-Light Divine Monk knelt amidst the rubble, covering his chest. Blood welled out from between his fingers, and he gritted his teeth, raising his eyes to behold the demonic figure in the sky, filled with fear.\t\t\t\t\t\t</div>", "images": {}, "success": true}