{"id": 304, "url": "https://www.novelhall.com/i-became-an-immortal-on-mortal-realm-32879/14858057.html", "title": "Chapter 300 - Chapter 300 Chapter 297: The Boundless Sea Of Buddha, Settling Karma", "volume": 4, "volume_title": "Volume 4", "body": "<h1>Chapter 300 - Chapter 300 Chapter 297: The Boundless Sea Of Buddha, Settling Karma</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 300 Chapter 297: The Boundless Sea of Buddha, Settling Karma<br/><br/>Gazing at the distant eighteen Thousand-Zhang Golden Buddhas and feeling their powerful aura, Fang Wang was not nervous. Instead, he became even more excited.<br/><br/>“I hope you’ll take a beating better than the last one!”<br/><br/>Fang Wang laughed loudly, facing the distant eighteen Golden Buddhas, and fiercely thrust the halberd.<br/><br/>The roar of a dragon exploded!<br/><br/>Nine Black Dragons emerged from the halberd’s tip, rapidly growing in size. As their heads almost collided with the eighteen Golden Buddhas, their tails had yet to appear, as if only half of the dragons’ bodies protruded from another space, showcasing their immense size.<br/><br/>The eighteen Golden Buddhas shouted in unison, and in an instant, golden light burst forth, sweeping across the heavens and earth. The nine Black Dragons, with their teeth and claws bared, instantly froze in place.<br/><br/>Fang Wang’s black hair fluttered as the hem of his clothes under his mail shook violently, along with the two golden flames on his Heavenly Dao Imperial Dragon Crown. He narrowed his eyes and looked ahead as a vast golden light swept toward him.<br/><br/>Not just him, but other Buddha Cultivators engaged in combat also turned their heads to look, as it was clear that most had never encountered such Divine Skills before.<br/><br/>Zhu Rulai and his clones also turned their heads, their expressions serious.<br/><br/>Centered around the eighteen Golden Buddhas, rings of golden light continuously spread out, enveloping the entire Realm of Buddhist Sect. As the golden light expanded, desolate lands sprouted golden lotuses, while golden petals floated down from the sky. An invisible pressure shrouded the Realm of Buddhist Sect.<br/><br/>Fang Wang also felt suppressed. It was his first time encountering such Divine Skills, somewhat like a Formation, yet different.<br/><br/>Even as a Sky-Stepping Realm Great Cultivator, faced with such Divine Skills, they would probably see their strength reduced by seventy to eighty percent. Even someone as strong as Fang Wang could feel the solidification of Spiritual Power and vitality within him.<br/><br/>“Amitabha! If the donor is still unwilling to lay down his butchering knife, then it can only be left to us to deliver you from suffering.”<br/><br/>“Fang Wang, you proclaim yourself as the Heavenly Dao yet act against the Heavenly Dao. Are you not afraid of divine punishment?”<br/><br/>“Amitabha, why bother talking nonsense with him, let him experience the might of the endless Buddha sea!”<br/><br/>“Repent in the Buddhist laws!”<br/><br/>The eighteen Golden Buddhas spoke one after another, some angry, some mocking, some pitying, with varying emotions.<br/><br/>Countless eyes fell on Fang Wang. The nine Black Dragons in front of him were still suspended in mid-air, and he seemed to have been subdued, unable to move.<br/><br/>In the distance.<br/><br/>Shenxin floated in mid-air, he too was suppressed and unable to move. As he saw Fang Wang standing motionless, his heart both relaxed and regretted.<br/><br/>The relief came from escaping a calamity, but he regretted that Fang Wang, a fellow Nine Lives Precious Spirit, might fall at this point.<br/><br/>Before last night, Fang Wang was an object of his admiration, and he too wished to indulge in swift justice and righteousness across the world like Fang Wang.<br/><br/>“The endless Buddha sea? Daring to claim endlessness at this level?”<br/><br/>Fang Wang’s laughter suddenly resonated, catching everyone off guard. Before the Buddha Cultivators could react, they saw flames of Yang Energy surrounding Fang Wang’s body.<br/><br/>With a vigorous push of the Heavenly Palace Halberd he held, the originally motionless Nine Black Dragons suddenly lunged forward, scattering the eighteen Golden Buddhas with an utterly domineering attitude. Those with lower cultivation immediately coughed up blood and were sent flying.<br/><br/>Fang Wang then sprang into action, instantaneously appearing in front of an upside-down Golden Buddha. With a sweep of the Heavenly Palace Halberd, he bisected its waist!<br/><br/>The slaughter began once more!<br/><br/>The formidable pressure that had enveloped the Realm of Buddhist Sect instantly dissipated, and the Buddha Cultivators, no longer overwhelmed with fear, hurriedly rejoined the battle.<br/><br/>Zhu Rulai once again faced a siege; Fang Wang was too strong, and cultivators below the Sky-Stepping Realm could only turn to attack Zhu Rulai.<br/><br/>Now that Zhu Rulai had reached the Sky-Stepping Realm, as long as no Great Cultivator in the True Soul Realm appeared, he was confident in standing invincible, regardless of the number of enemies.<br/><br/>The battle continued, and the avatars of Zhu Rulai multiplied, soon outnumbering the Buddha Cultivators who were besieging him.<br/><br/>After breaking through the endless Buddha Sea, Fang Wang completely lost his composure. He entered the state of Combat Heart, casting aside all distractions, leaving only the intent to kill.<br/><br/>He would not forget how the Buddhist Sect and the seven families suppressed him!<br/><br/>After all, this matter was related to missing the last day with his parents!<br/><br/>Atop a cliff stood two figures, one of whom was unmistakably Zhou Xue.<br/><br/>Zhou Xue was dressed in a red-patterned black garment; her posture was dignified. Her long hair was coiled up beneath a hair crown in which a golden phoenix was inlaid, its body bent over in flight, wingtips emitting faint red auras. Beneath her willow brows, her eyes were detached; her red lips gave her a captivating beauty as well as a sense of oppression.<br/><br/>Standing beside her was an old man, gaunt to the bone and shorter than she was; his clothes were ragged and his hair was a mess, resembling a bird’s nest.<br/><br/>“This young man is actually a Nine Lives Precious Spirit; such a rarity. Casting a glance across the myriad people of the Mortal Realm, it’s difficult to encounter one even in ten thousand years. Moreover, there’s another Nine Lives Precious Spirit hidden within this small world. Could it be that this realm is indeed resurging?” The old man said in a low voice as he put his hands behind his back. He even coughed, hunching over more, seeming very weak.<br/><br/>Zhou Xue looked towards the horizon, only to see a huge black hole hanging there, with violent winds and dust continually pouring out, as if it were the end of the world.<br/><br/>“This realm is indeed about to resurge, but his potential cannot be measured by that of a Nine Lives Precious Spirit,” Zhou Xue said softly, her lips curling up involuntarily.<br/><br/>The old man clicked his tongue in amazement, “That Nine Lives Precious Spirit has the aura of Buddha; could it be related to The Upper Realm? You destroyed the Buddhist Sect for him?”<br/><br/>“That’s just one of the reasons. The Buddhist Sect had long been tainted by the Upper Realm; taking it out earlier would give me less trouble,” Zhou Xue replied, not waiting for the old man to continue questioning. She spoke again, “Get ready. Someone is coming.”<br/><br/>The old man twisted his neck, chuckling, “Forgot how many years it’s been since I’ve fought. If I count carefully, I haven’t battled since the Descending Dragon Great Saint died—a shame the opponent isn’t of the Celestial Qiankun Realm.”<br/><br/>Zhou Xue glanced at him and said, “Although the opponent is not of Celestial Qiankun, you’re not at your peak either; don’t be careless.”<br/><br/>A sound of tearing air approached from behind them, and as they turned to look, they saw a monk flying toward them—it was the Dust-Light Divine Monk who had previously joined Emperor Tao of the Grand Yu Divine Dynasty to find Fang Wang.<br/><br/>The Dust-Light Divine Monk also spotted Zhou Xue and the old man, and his brows involuntarily furrowed.<br/><br/>Stepping forward, the old man’s disheveled white hair suddenly fluttered, growing longer and turning black, wildly dancing in the air. His appearance became rebellious, and his gaze toward the Dust-Light Divine Monk was full of mockery.<br/><br/>The Dust-Light Divine Monk sensed danger and slowed down, calling out, “Where do you two come from?”<br/><br/>The old man grinned and said, “Do you need to ask? We’re obviously here to destroy your Buddhist Sect!”<br/><br/>“Amitabha, this monk is not a person of the Buddhist Sect, but rather here to settle cause and consequence to avoid catastrophe upon all beings.”<br/><br/>“Heh, what are you to speak such words? Stop pretending, fight me. If you kill me, you can go and settle your cause and consequence; if you don’t, then prepare to die!” the old man said with a cold laugh. He then leapt up, and as he stepped into the air, the bright daytime firmament instantly darkened, become utterly black.<br/><br/>The Dust-Light Divine Monk knitted his brows tightly. He looked up, and within the pitch-black night sky, dots of starlight emerged, slowly growing larger.\t\t\t\t\t\t</div>", "images": {}, "success": true}