{"id": 306, "url": "https://www.novelhall.com/i-became-an-immortal-on-mortal-realm-32879/14858678.html", "title": "Chapter 302 - Chapter 302 Chapter 299 Great Saint Su Xuan_1", "volume": 4, "volume_title": "Volume 4", "body": "<h1>Chapter 302 - Chapter 302 Chapter 299 Great Saint Su Xuan_1</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 302 Chapter 299 Great Saint Su Xuan_1<br/><br/>“With such strength, you dare to settle karma? Junior, do not underestimate the world and think too highly of yourself!”<br/><br/>A voice filled with ridicule descended from the sky, deeply wounding the Dust-Light Divine Monk.<br/><br/>The Dust-Light Divine Monk lowered his head to look at his right hand, where the skin was festering and blood blisters were continuously forming, making it impossible to heal.<br/><br/>“Dust-Light Divine Monk, two thousand years ago you suppressed the Nine-Headed Demon Ancestor, stopped the chaos of Jiu You. You are indeed one of the few who truly possesses great merit in this world. However, your excessive care for the Buddhist Sect is starting to outweigh your good deeds. It seems you have assisted many beings oppressed by the Buddhist Sect, yet you haven’t disciplined its disciples, causing them to become even more rampant.”<br/><br/>“Have you not realized that during the two thousand years you hid your identity, the Buddhist Sect worsened in its ways?”<br/><br/>Zhou Xue’s voice drifted from afar, making the Dust-Light Divine Monk’s expression grow even more gloomy.<br/><br/>The elder in the high sky discontentedly said, “What now? Am I not allowed to kill him either?”<br/><br/>“Don’t you think it’s a pity for him to die just like this? He forced you to use your true form’s divine skills.”<br/><br/>“Hmph, he has some strength, but it’s not much. If I were serious, he wouldn’t survive a single move.”<br/><br/>Although the elder snorted coldly, his complexion improved.<br/><br/>The Dust-Light Divine Monk struggled to raise his head, gritting his teeth, he asked, “Who exactly are you…? Your spiritual understanding and your cultivation don’t match…”<br/><br/>Looking down from on high, the elder said, “There’s no harm in telling you. My name is Su Xuan.”<br/><br/>“Su Xuan…”<br/><br/>The Dust-Light Divine Monk muttered to himself, suddenly realizing something, his expression drastically changed, and he asked with a trembling voice, “Could you be that Great Saint of legend?”<br/><br/>Su Xuan sneered, “I didn’t think you’d know of my deeds. Since that’s the case, I’ll give you a way out, but you’ll have to bow down to us and renounce all your karma with the Buddhist Sect.”<br/><br/>The eyes of the Dust-Light Divine Monk dimmed instantly.<br/><br/>Zhou Xue floated in midair, looking towards the black hole that led to the Realm of Buddhist Sect, and said, “The Buddhist Sect is about to be destroyed. The current World-honored Buddha has fallen, and it seems that the strongest of the unrighteous Buddhas will be absent from the catastrophe of the Buddhist Sect.”<br/><br/>At her words, the Dust-Light Divine Monk’s expression fluctuated between hope and despair.<br/><br/>He then turned to look in Zhou Xue’s direction, teeth clenched, and asked, “Who exactly are you? What have you done to the unrighteous Buddha?”<br/><br/>Zhou Xue did not look at him; her gaze stayed fixed on the horizon. She replied calmly, “I haven’t done much, just looked after him a bit, in the same manner as his previous conduct.”<br/><br/>The Dust-Light Divine Monk’s expression drastically changed, and his gaze towards Zhou Xue revealed fear—fear he hadn’t shown even in the face of Su Xuan.<br/><br/>Within the shattered realm of the Buddhist Sect, the sounds of war had already ceased, with rolling dust clouds blanketing the desolate earth, corpses lay everywhere, some areas even stained red with blood, the scene was extremely mournful.<br/><br/>Fang Wang flew out of the dust, holding the Heavenly Palace Halberd in one hand. The blade of the halberd was adorned with two corpses, one a Golden Buddha and the other a monk, their blood dripping down from their chins, fingertips, and toes.<br/><br/>Clothed in Dark Golden Chainmail, Fang Wang was like a demon god, unscathed. He flew along, eventually landing atop a pile of mountains.<br/><br/>Here originally stood a peak a thousand feet tall. After being bombarded, only two hundred feet remained.<br/><br/>At this moment, Zhu Rulai was present there, before him knelt tens of thousands of Buddhist Sect disciples, nearly all of them injured. Filled with fear, their gazes turned towards Fang Wang.<br/><br/>While Zhu Rulai was certainly strong, Fang Wang displayed an almost invincible demeanor that drove them to despair.<br/><br/>This battle, Fang Wang thoroughly shattered their pride.<br/><br/>They could not think of anyone who could save them now. The most powerful World-honored Buddha of their time had been fiercely executed by Fang Wang. Ninety percent of their Golden Buddhas had died, and the rest could only bow their heads in defeat.<br/><br/>Zhu Rulai turned his head to look at Fang Wang, his gaze equally complex.<br/><br/>The ferocity of Fang Wang’s battle posture was truly terrifying, but what chilled him to the bone was that Fang Wang hadn’t utilized any other Lifespirit Treasures.<br/><br/>Zhu Rulai couldn’t forget the horrific devouring force of the Town World Bead.<br/><br/>Fang Wang casually tossed a corpse from the Heavenly Palace Halberd onto the ground and said with a sigh, “The Buddhist Sect is indeed strong, but it still disappoints me.”<br/><br/>While the core strength of the Buddhist Sect was indeed plentiful, they lacked a presence that could restrain him!<br/><br/>Ordinary cultivators in the True Soul Realm were already incapable of stopping Fang Wang!<br/><br/>Moreover, Fang Wang felt that the Buddhist Sect had too few in the True Soul Realm; so far, only the current Ancestral Buddha was available. Clearly, the Buddhist Sect was still hiding stronger forces, but whether they were all restrained by Zhou Xue or purposely concealed was unknown.<br/><br/>No matter how it was, after today’s battle, the Buddhist Sect was essentially trampled!<br/><br/>Even if there were True Soul Realm members hiding, rebuilding the Buddhist Sect without a thousand years would be difficult for them to return to their peak.<br/><br/>Zhu Rulai spoke up, “As of now, you have truly grown up, stepping out of the category of a mere genius.”<br/><br/>Fang Wang removed his armor, and withdrew his Tianling Body, reverting to his white-clothed form; he said softly with a chuckle, “I still fall short by a long way, I’m just an ordinary cultivator in the third level of the Heaven-Breaking Realm, not even close to your Divine Passage Realm.”<br/><br/>Upon hearing this, the corners of Zhu Rulai’s mouth twitched, suddenly feeling very hurt.<br/><br/>Cultivators from the Heaven-Breaking Realm and Divine Passage Realm below all had their mouths agape with disbelief at what they heard.<br/><br/>Such a powerful Fang Wang was only in the third level of the Heaven-Breaking Realm?<br/><br/>In the previous battle, beside employing the Nine Dragons Tyrant Fist, Fang Wang did not use any other offensive spells or Divine Skills; he relied on his physical body alone to withstood the entire Buddhist Sect. The surviving Buddhist Sect Cultivators all felt that Fang Wang had not yet given his all.<br/><br/>This supreme genius of the world still possessed greater power!<br/><br/>However, some of them had not expected Fang Wang’s realm to be lower than their own.<br/><br/>They looked up to the Buddhist Sect as mere ants gaze at the sky, yet Fang Wang, whose realm was beneath theirs, fought the Buddhist Sect like an elephant treading an anthill!<br/><br/>A dragon’s roar sounded; Xiao Zi came flying rapidly. Landing before Fang Wang it exclaimed eagerly, “Master, may I have your Dragon Jade Ring? I’ll help you collect the riches of the Buddhist Sect!”<br/><br/>Fang Wang immediately removed the Dragon Jade Ring and opened its restraints; following that, Xiao Zi summoned Zhao Zhen from the Soul Devouring Gourd, instructing Zhao Zhen to grasp the Dragon Jade Ring. Then, twisting its dragon form, Xiao Zi disappeared into the rolling dust.<br/><br/>Listening to Xiao Zi’s brazen bandit-like words, the Buddhist Sect Cultivators all felt desolate.<br/><br/>“Good, you truly haven’t disappointed me.”<br/><br/>Another voice came; Fang Wang turned to look and saw Zhou Xue flying over, followed by Su Xuan and the Dust-Light Divine Monk.<br/><br/>Seeing Zhou Xue arrive, a smile appeared on Fang Wang’s face, and he playfully asked, “Why have you come? Don’t tell me you’re worried about me?”<br/><br/>As Zhou Xue flew up to him, surveying him, she said, “Only when standing right before you can one feel the strength of your physique; such a constitution will surely one day become saintly in the flesh.”<br/><br/>Su Xuan also surveyed Fang Wang, his eyes revealing a look of surprise.<br/><br/>The Dust-Light Divine Monk’s gaze was complex; the last time he saw Fang Wang, though Fang Wang had defeated the Suppressing Evil Golden Buddha, to him, Fang Wang had still been under control, feeling that Fang Wang sparing the Suppressing Evil Golden Buddha was a way of showing goodwill to him.<br/><br/>How many years has it been since?<br/><br/>Seeing Fang Wang again, just perceiving his physical body, the Dust-Light Divine Monk experienced a heart-pounding sensation.<br/><br/>Fang Wang’s burning blood and qi were more terrifying than any demon or ferocious beast in the world!\t\t\t\t\t\t</div>", "images": {}, "success": true}