{"id": 302, "url": "https://www.novelhall.com/i-became-an-immortal-on-mortal-realm-32879/14852655.html", "title": "Chapter 298 - Chapter 298 Chapter 295: Flatten The Buddhist Sect", "volume": 4, "volume_title": "Volume 4", "body": "<h1>Chapter 298 - Chapter 298 Chapter 295: Flatten The Buddhist Sect</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 298 Chapter 295: Flatten the Buddhist Sect<br/><br/>The dawn sunlight danced across the mountains of the Buddhist Sect, with winding rivers snaking through them, their surfaces glinting with a golden sheen.<br/><br/>Clang!<br/><br/>The door burst open, and Shenxin stepped out, seemingly unchanged from the day before; however, when he lifted his gaze, it was utterly different, endowing his visage with an unstoppable sharp vigor.<br/><br/>Gazing at the proud sun on the horizon, Shenxin couldn’t help but stretch languidly and murmur to himself, “I never realized the scenery here was this captivating before.”<br/><br/>A smile bloomed across his face, exuding an exuberant spirit.<br/><br/>Boom!<br/><br/>The Firmament far away suddenly shattered, and a huge black hole appeared out of nowhere, bringing with it terrifying gales that swept across the world with an apocalyptic force.<br/><br/>Instinctively raising an arm to shield himself, the temple where Shenxin resided trembled violently. Outside its walls rose a translucent white light screen, fending off the domineering windstorm.<br/><br/>Sounds of resounding bells came from all directions, deafening and unceasing.<br/><br/>Lowering his arm, Shenxin squinted into the distance, only to see a colossal Purple Dragon flying through the vast black hole in the sky, its four claws treading on clouds, majestic and awe-inspiring.<br/><br/>With Shenxin’s keen vision, he could see a tall figure standing atop the dragon’s head.<br/><br/>“So, this is the Realm of Buddhist Sect? The Spiritual Energy here is indeed richer than that of the Saint Clans,”<br/><br/>“Compared to before, the Spiritual Energy has indeed become more abundant.”<br/><br/>The voices of Fang Wang and Zhu Rulai echoed through the Realm of Buddhist Sect, chatting casually as if they didn’t take the Buddhist Sect to heart at all.<br/><br/>Powerful figures streaked over Shenxin’s head, and from every mountain peak in front of him, Golden Buddhas and monks soared into the air, like thousands of arrows launching skywards, a sight of spectacular grandeur.<br/><br/>Shenxin had been in the Buddhist Sect for over three hundred years, yet this was the first time he saw such a display of might.<br/><br/>“Who is that person?”<br/><br/>Shenxin inwardly marveled, wondering what kind of powerhouse could force their way into the Realm of Buddhist Sect?<br/><br/>What was key was that he, now awakened to his true self, couldn’t see through Fang Wang’s cultivation level.<br/><br/>Fang Wang stood atop Xiao Zi’s head, his gaze sweeping around, seeing Buddha Cultivators everywhere, countless in number, with over twenty Golden Buddhas among them.<br/><br/>Golden Buddha, that is the Sky-Stepping Realm!<br/><br/>It must be said, the foundation of the Buddhist Sect is indeed strong.<br/><br/>Zhu Rulai flew next to Xiao Zi, looking toward the Buddhist Sect with a nostalgic expression. He then spread his arms, and a terrifying aura burst forth from his body.<br/><br/>Fang Wang glanced at him, inwardly satisfied.<br/><br/>Zhu Rulai had successfully stepped into the Sky-Stepping Realm!<br/><br/>That guy was obviously practicing some Secret Technique to conceal his cultivation level, now revealing his true strength.<br/><br/>Sensing Fang Wang’s gaze, Zhu Rulai inwardly sighed.<br/><br/>This momentum was originally prepared for you, but sadly, you have grown even faster.<br/><br/>As Zhu Rulai thought this, his gaze sharpened, and his voice thundered throughout the land, “Present-time Elder, won’t you show yourself? With only them, they cannot stop the one beside me!”<br/><br/>Countless gazes and spiritual perceptions fell upon Fang Wang. He twisted his neck, lifting his right hand, and conjured the Heavenly Palace Halberd.<br/><br/>This time, he intended to fight solely with the strength of his Immaculate Dao Bones and Heavenly Gang Supreme Yang Tyrant Body.<br/><br/>When bone and body united, Dao Power and Yang Energy combined, he wanted to see just how formidable his body could be.<br/><br/>Fang Wang ascended into the sky, and he activated the Tianling Body, which is not merely a physique but also his ninth Lifespirit Treasure, so it could merge with his Heavenly Gang Supreme Yang Tyrant Body.<br/><br/>In an instant, a Dark Golden Chainmail clad his body, while from the dragon horns of the Heavenly Dao Imperial Dragon Crown atop his head, two golden streams of energy sprung forth, extending two zhang long, wildly fluttering.<br/><br/>Clothed in white, Fang Wang appeared to be full of Immortal charm, like a highly attained sage; yet now, he seemed like a War God who wielded the laws of heaven and earth, imperiously formidable.<br/><br/>Almost instantaneously, every living being within the Buddhist Sect felt Fang Wang’s presence.<br/><br/>Shenxin was deeply moved, his eyes fixated on Fang Wang.<br/><br/>Multiple voices echoed in his heart simultaneously:<br/><br/>“He is also a Nine Lives Precious Spirit!”<br/><br/>“This guy is just like you!”<br/><br/>“Could he also be a reincarnation of an Immortal God from The Upper Realm?”<br/><br/>“That halberd is no simple weapon!”<br/><br/>For the first time, Shenxin felt the voices inside him tense, as if facing a natural enemy. One must know that even when facing the contemporary ancestors of the Buddhist Sect, these voices were usually contemptuous.<br/><br/>Fang Wang grew along with it, rapidly becoming ten thousand zhang tall, which made all the Buddha Cultivators who rushed over widen their eyes; no matter how serious their expressions were usually, they couldn’t maintain their composure at this moment.<br/><br/>Zhu Rulai turned his head to look and couldn’t help but be moved.<br/><br/>The ten thousand zhang tall Fang Wang towered straight up to the sky, as the two golden flames of the Heavenly Dao Imperial Dragon Crown seemed about to burst through the Firmament.<br/><br/>Dominant!<br/><br/>Majestic!<br/><br/>Unreachable!<br/><br/>Fang Wang held the Heavenly Palace Halberd in his right hand, slanting it toward the highest peak in the distance, and said, “Wangdao Fang Wang, I have come to settle karma. Back in the day, the Buddhist Sect forcefully intervened in my karma with the seven Great Saint Clans, even wanting to kill me. Today, I will flatten the Buddhist Sect. Everyone, have you thought about how you want to die?”<br/><br/>“Jin Xiao Sect’s Zhu Rulai, has also come to settle karma. For centuries, the Buddhist Sect has hunted me, killed my family, and disciples. The Buddhist Sect is not benevolent, so I will destroy the Buddhist Sect and establish a new Buddha Dao!”<br/><br/>Zhu Rulai also shouted, his tone filled with more murderous intent than Fang Wang’s wildness.<br/><br/>Wangdao Fang Wang!<br/><br/>Zhu Rulai!<br/><br/>All Buddha Cultivators were moved, especially by the name of Fang Wang.<br/><br/>The Suppressing Evil Golden Buddha had once suffered a miserable defeat at the hands of Fang Wang and was still healing in seclusion to this day. That was decades ago, and with Fang Wang’s talent, how strong must he be now?<br/><br/>Looking up at Fang Wang’s majestic figure, all the Buddha Cultivators felt a great disaster looming.<br/><br/>Without waiting for their response, Fang Wang lifted his left hand, and clenched his fist.<br/><br/>Boom!<br/><br/>The entire Realm of Buddhist Sect trembled violently, the ground cracked open, and thunder and lightning appeared out of nowhere in the sky, as if the whole world was about to collapse.<br/><br/>Mountain River Town Heaven Fist!<br/><br/>Fang Wang’s simple clenching of his fist made all the Buddha Cultivators within the Buddhist Sect feel an indescribable pressure.<br/><br/>“Amitabha! Do you truly wish to ceaselessly fight to the death?”<br/><br/>A cold voice resounded, as a Golden Buddha flew up from the highest peak in the distance, growing rapidly to a thousand zhang tall, radiating ten thousand zhang of golden light. At first glance, though the aura was not as strong as Fang Wang’s, it was not much less.<br/><br/>The contemporary ancestral Buddha!<br/><br/>Fang Wang could feel that the other’s momentum far surpassed the Sky-Stepping Realm, definitely a True Soul Realm powerhouse, incomparable to the Suppressing Evil Golden Buddha he had encountered before.<br/><br/>He was not apprehensive, but instead, he became more excited. With a grin, he lowered his left fist and crouched down.<br/><br/>In the distance, the contemporary ancestral Buddha suddenly opened his eyes, the vertical eye on his forehead emitting a terrifying golden light that was over a hundred zhang in diameter. During its flight, it rapidly expanded, sweeping across the sky with unstoppable momentum and striking Fang Wang’s armor.<br/><br/>Boom!<br/><br/>Fang Wang’s figure trembled slightly, but he wasn’t repelled, bearing the Divine Skills of the contemporary ancestral Buddha as he smashed down with a punch!<br/><br/>This punch was no longer the Mountain River Town Heaven Fist, but the Nine Dragons Tyrant Fist!<br/><br/>His punch shattered ten thousand li of land, and the terrifying shockwave swept wildly in all directions. Everything in its path crumbled, trees were uprooted, and rivers flew upwards, coiling toward the Firmament.<br/><br/>Black Dragons burst forth from the earth, encircling Fang Wang, their Dragon Heads soaring up as if to break through the sky.<br/><br/>In the midst of the storm, Shenxin resisted with his own Spiritual Power. His pupils shook violently, fearfully looking at the figure in the sky that resembled a demonic god.\t\t\t\t\t\t</div>", "images": {}, "success": true}