{"id": 303, "url": "https://www.novelhall.com/i-became-an-immortal-on-mortal-realm-32879/14858048.html", "title": "Chapter 299 - Chapter 299 Chapter 296 The Strongest Physical Body In The Human World_1", "volume": 4, "volume_title": "Volume 4", "body": "<h1>Chapter 299 - Chapter 299 Chapter 296 The Strongest Physical Body In The Human World_1</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 299 Chapter 296 The Strongest Physical Body in the Human World_1<br/><br/>“Insolence!”<br/><br/>The voice of the current ancestral Buddha rang out, and this time, the murderous intent in his tone could not be concealed.<br/><br/>Numerous Golden Buddhas swiftly moved to attack Fang Wang, an array of Divine Skills and Spells coming at him from all directions, earth-shattering and overwhelmingly powerful.<br/><br/>Fang Wang didn’t dodge; he took the onslaught with his body, tens of thousands of Spells and Divine Skills exploding upon him. His Spiritual Power burst forth like fireworks of various colors. Amidst it all, he stood firm as Mount Tai, immovable.<br/><br/>He rose to his feet and leaped up, his ten-thousand-feet figure stirring up a terrifying gale that forced the nearby Buddha Cultivators to retreat.<br/><br/>Tracing a perfect arc across the Firmament, Fang Wang held the Heavenly Palace Halberd in his right hand and thrust downward, aiming directly at the highest peak within the Realm of Buddhist Sect.<br/><br/>The current ancestral Buddha stood before the highest peak. He raised his arms and brought his palms together, his ten thousand feet of golden light becoming even more dazzling. His vertical eye once again burst forth with golden beams, directing them at Fang Wang, with Buddha silhouettes within the beams rushing towards Fang Wang at an even faster pace.<br/><br/>At first glance, it was as if ten thousand Buddhas and Arhats were charging at Fang Wang.<br/><br/>Fang Wang, wielding the halberd, smashed down with fury, oppressively suppressing them. Those Buddha silhouettes dissipated into smoke the moment they touched the Heavenly Palace Halberd.<br/><br/>He pressed down domineeringly, unstoppable in his advance!<br/><br/>The current ancestral Buddha’s expression changed dramatically, and he immediately pushed his palms upwards.<br/><br/>With a loud boom!<br/><br/>Under the watchful eyes of other Buddha Cultivators, the current ancestral Buddha was directly smashed into the ground by Fang Wang, and the highest peak crumbled along with him. Rocks flew chaotically, ravaging the land, with countless Buddha Cultivators and Divine hearts frantically seeking cover.<br/><br/>Divine heart watched from the air, gazing at Fang Wang’s towering figure. After the highest peak was demolished by Fang Wang, tens of thousands of powerful Buddha Cultivators charged at him, creating a scene of spectacular grandeur.<br/><br/>“What kind of Divine Skills are these? And this power…”<br/><br/>Divine heart’s eyes widened, thinking in terrified shock.<br/><br/>Fang Wang’s presence was no joke; Divine heart had lived for such a long time, but this was the first time he felt such an overwhelming aura that made him shrink back in fear.<br/><br/>Who else but I, fearless in the face of everything!<br/><br/>Zhu Rulai was also startled by Fang Wang’s performance, but he quickly snapped back to his senses and immediately launched an offensive. His goal was simple, to destroy the Realm of Buddhist Sect!<br/><br/>If this realm were to collapse, the fortunes of the Buddhist Sect would greatly diminish!<br/><br/>However, as soon as Zhu Rulai made his move, a great number of Buddha Cultivators surrounded him. Now having reached the Sky-Stepping Realm, he was incredibly strong, executing the Heaven and Earth God-Transforming Technique, splitting into thousands of Dharma Form doppelgangers, each one an army in themselves, with each incarnation able to use different Spells and Divine Skills.<br/><br/>Fang Wang, holding the Heavenly Palace Halberd, moved freely in all directions, destroying mountains one after another, with temples atop them being reduced to flat ground in succession.<br/><br/>In less than the time for ten breaths, the Realm of Buddhist Sect was turned into chaos, the land shrouded in billowing dust.<br/><br/>Fang Wang transformed once more, shrinking to his original size, and began to actively attack those powerful Buddha Cultivators.<br/><br/>He stepped upon the Lingxiao Divine Sect, his form darting through the air, arriving beside a Golden Buddha in one step, his halberd sweeping horizontally and instantly turning that Golden Buddha into a mist of blood. He then flickered towards other Buddha Cultivators.<br/><br/>The Golden Buddhas’ bodies couldn’t withstand his single strike, but luckily their Primordial Spirits survived, preventing them from dying and their Dao from vanishing. However, the Buddha Cultivators beneath the level of Golden Buddha weren’t so lucky; they couldn’t withstand a single strike from his halberd.<br/><br/>As Fang Wang swept through, none could stand in his way, like a tiger entering a flock of sheep, mercilessly slaughtering.<br/><br/>No matter what kind of Spells or Divine Skills hit him, he acted as if unscathed, completely unaffected.<br/><br/>The Heavenly Gang Supreme Yang Tyrant Body was already formidable, indestructible, and with the support and transformation of the Immaculate Dao Bones, his physical body had reached a new height. He could confidently say he was the strongest in the human realm.<br/><br/>Without using any ultimate techniques, Fang Wang relied solely on his body to defeat all powerful enemies.<br/><br/>His speed was incredibly fast, the majority of Buddha Cultivators could not keep up with him. All they could see were bursts of blood mist appearing throughout the land, the visual clash instilling immense panic.<br/><br/>“How can he be so powerful…”<br/><br/>“With just two people they dared to force their way into the Buddhist Sect?”<br/><br/>“Damn it, they say Emperor Donggong is protecting Fang Wang, but with Fang Wang’s strength, does he even need protection?”<br/><br/>“Start the formation, we must suppress this demon!”<br/><br/>“Claiming to be the Heavenly Dao, his arrogance knows no bounds, today we must annihilate him!”<br/><br/>Buddha Cultivators were discussing and cursing in alarm, watching as Fang Wang wreaked havoc. They were both angry and frightened, and although the vast majority of them couldn’t join the battle—since there were only two targets—Fang Wang’s erratic movements made everyone feel a significant threat.<br/><br/>The Present Ancestor Buddha blocked Fang Wang’s path once again, exhibiting three heads and six arms, with different Buddhist relics in each of his six hands. He even rose from his lotus position, leapt into the air, and approached Fang Wang for close-quarters combat.<br/><br/>Clang!<br/><br/>The Heavenly Palace Halberd clashed with a Buddhist staff, and the Present Ancestor Buddha’s face drastically changed. Even the vertical eye on his forehead began to bleed, his hand shaking as he held the staff.<br/><br/>Fang Wang’s lips curled into a smile, and with a fierce thrust of his right arm, he sent a terrifying force that strongly repelled the Present Ancestor Buddha.<br/><br/>Unforgiving when gaining the upper hand, Fang Wang pursued, wildly swinging the Heavenly Palace Halberd, consecutively smashing it toward the Present Ancestor Buddha.<br/><br/>Without any pattern, he struck wildly, but his speed was so fast that the Present Ancestor Buddha could only defend in panic, and soon his Golden Body sustained hits.<br/><br/>The two of them fought while sweeping across the Firmament, creating violent storms in their path, unstoppable.<br/><br/>Soon, the Golden Body of the Present Ancestor Buddha was drenched in blood.<br/><br/>“It seems that even the Buddha is but mortal flesh and bone!”<br/><br/>Fang Wang’s voice resounded, making the Present Ancestor Buddha’s third eye flare with rage.<br/><br/>“Fang Wang, you’re courting death!”<br/><br/>The Present Ancestor Buddha roared in anger, immediately waving the treasure pagoda in his hands. The pagoda rammed forward; its numerous small windows flung open simultaneously, and countless demons surged out, engulfing Fang Wang in a black ocean.<br/><br/>The Present Ancestor Buddha then dug out the vertical eye on his forehead and violently crushed it.<br/><br/>Boom!<br/><br/>The ocean of demons was dispersed by a tyrannical force, and the Heavenly Palace Halberd, transformed into a beam of silver light, forcefully pierced through the Present Ancestor Buddha’s Golden Body, flinging him across ten thousand miles and smashing him into a pile of ruins.<br/><br/>Blood couldn’t stop pouring from the mouth of the Present Ancestor Buddha, his legs and six arms trembling, trying to struggle free, only to find a powerful suction force within the Heavenly Palace Halberd holding him tightly, preventing his escape.<br/><br/>Fang Wang appeared out of thin air above the Present Ancestor Buddha, who looked up at Fang Wang, his eyes full of rage.<br/><br/>“Provoking the Buddhist Sect, Fang Wang, you’ve sown this karma, you will never recover!”<br/><br/>Behind Fang Wang, the Mie Jue Divine Tome condensed and unfurled like a scroll. He lifted his fist and swung it down.<br/><br/>Spiritual Power transformed into a black river, engulfing the Present Ancestor Buddha.<br/><br/>The black river hit the ground, turning into a surging fog that rapidly spread, covering a thousand miles in an instant.<br/><br/>Fang Wang raised his hand and summoned the Heavenly Palace Halberd back into his grip. He turned around to see eighteen Golden Buddhas standing side by side, less than a hundred miles away from him.<br/><br/>All these Golden Buddhas were a thousand feet tall, each in a different posture: some were seated in meditation, some lying on their sides, some in a horse stance, some standing on one leg, and some even stood upside down. They were all staring fixedly at Fang Wang.<br/><br/>Their auras had merged, emitting an even more terrifying presence than the Present Ancestor Buddha!\t\t\t\t\t\t</div>", "images": {}, "success": true}