{"id": 300, "url": "https://www.novelhall.com/i-became-an-immortal-on-mortal-realm-32879/14835142.html", "title": "Chapter 296 - Chapter 296 Chapter 293: The Second Greatest Genius In The World", "volume": 3, "volume_title": "Volume 3", "body": "<h1>Chapter 296 - Chapter 296 Chapter 293: The Second Greatest Genius In The World</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 296 Chapter 293: The Second Greatest Genius in the World<br/><br/>“Let’s do this, release the news that in twenty years, Wangdao will select the Sword Sect in Sword Heaven Marsh. Only Sword Cultivators may register to participate,”<br/><br/>Fang Wang pondered, a problem he had previously considered.<br/><br/>Song Jinyuan had already said that he was not qualified to be one of the Twelve Dao Sects, and Fang Wang had other arrangements for him. If he chose Fang Bai or another Sword Servant to lead the Sword Sect, they would lack strength. Although there were powerful Sword Cultivators within Sword Heaven Marsh, the place was a mixed bag, and without understanding them, Fang Wang would not casually promote someone to be one of the Twelve Dao Sects.<br/><br/>Upon hearing this, Song Jinyuan immediately showed a smile.<br/><br/>He understood that his own followers weren’t qualified to be the Sword Sect, but just the selection of the Sword Sect taking place in Sword Heaven Marsh, and allowing the cultivators of Sword Heaven Marsh to register and compete, was enough; at least it would save face for Sword Heaven Marsh.<br/><br/>Fang Wang sat in his chair, beginning to assimilate his own Wangdao Command, while Dugu Wenhun continued reporting on the construction of Wangdao.<br/><br/>In just a few years, the number of Disciples of the Way of Hope had already surpassed five hundred thousand, with the threshold set at the Spirit Elixir Realm, with disciples from all different realms, the highest being three at Divine Passage Realm.<br/><br/>There were seven in the Heaven-Breaking Realm, more than twenty in the Nirvana Realm, and over three hundred in the Mahayana Realm.<br/><br/>It might not compare with the Grand Yu Divine Dynasty, but such power was considered massive in the surrounding seas, even surpassing the Eternal Life Pavilion.<br/><br/>Fang Wang had already sensed the numerous powerful auras within Sword Heaven Marsh, but even he did not expect that there were three Divine Passage Realm cultivators who had joined Wangdao.<br/><br/>The Divine Passage Realm, an existence totally out of reach in the past for the Descending Dragon Continent, the Southern Celestial Sea, and the Emperor Sea.<br/><br/>Let alone the Divine Passage Realm, even the Heaven-Breaking Realm was unheard of by many!<br/><br/>The Three Immortals of the Emperor Sea of the ninth layer of Nirvana Realm were near invincible existence.<br/><br/>This clearly showed how great Fang Wang’s prestige was.<br/><br/>After Dugu Wenhun finished speaking, Fang Wang said, “We must maintain good control of Wangdao’s rules; we cannot allow anyone to tarnish Wangdao’s reputation. Apart from the Twelve Dao Sects, we will specially establish a Supervision Branch responsible for overseeing disciples’ unjust and improper actions.”<br/><br/>Hong Chen praised, “It is great that you have such thoughts. Without rules, there is no circle. Any powerful force must have its own good order, especially during its growth phase.”<br/><br/>His gaze fell upon the Wangdao Command in Fang Wang’s hands, his eyes flickering with a strange light.<br/><br/>This kid…<br/><br/>How did he assimilate it so quickly?<br/><br/>Hong Chen was surprised in his heart but then remembered that Fang Wang might have mastered the Immeasurable Pure Bone Technique, and he no longer found it so astonishing.<br/><br/>“That’s a Dao Bone…”<br/><br/>Hong Chen looked at Fang Wang with mixed feelings.<br/><br/>Although he had not mastered the Immeasurable Pure Bone Technique, he had felt the aura of the Dao Bone during its transmission, and he was certain that the previous heaven and earth phenomena were definitely related to the Immeasurable Pure Bone Technique.<br/><br/>Thinking about the timing…<br/><br/>Hong Chen’s eyelids twitched wildly, he strongly suspected that Fang Wang himself was a Dao Bone but hadn’t awakened, and the Immeasurable Pure Bone Technique had helped him to awaken his own Dao Bone.<br/><br/>This was the only way he could understand it. A secret technique he couldn’t master in tens of thousands of years of cultivation in the Upper Realm, how could it be mastered by a mere mortal?<br/><br/>He admitted that when he taught the technique to Fang Wang, he intended to put pressure on him. He thought this kid was too presumptuous; anyway, there was no way the kid could learn it, so he wasn’t afraid of revealing this secret technique.<br/><br/>However…<br/><br/>Damn it, he really did learn it!<br/><br/>When Hong Chen felt the phenomena of heaven and earth caused by Fang Wang, an unstoppable jealousy and even some breakdown emerged in his heart.<br/><br/>Fortunately, he was the Heaven Emperor, who had been through storms unimaginable by mortals, and in the end, he managed to restrain himself.<br/><br/>After the negative emotions subsided, Hong Chen held infinite expectations for Fang Wang, believing that he was undoubtedly the greatest opportunity of his life.<br/><br/>Dugu Wenhun and Song Jinyuan listened intently to Fang Wang’s words, and it wasn’t until an hour had passed that the two of them took their leave.<br/><br/>Fang Wang was alone with Hong Chen, and the two talked about who knows what. When Hong Chen left through the grand doors, his face was brimming with smiles, a stark contrast to his usual solemn demeanor.<br/><br/>Several days later.<br/><br/>Jin Xiao Sect Cultivators came to visit Fang Wang, informing him that Zhu Rulai was waiting for him in the southern face of Kunlun.<br/><br/>Fang Wang, taking Xiao Zi with him, set out on his journey.<br/><br/>Years had passed, and Kunlun had become majestic, the most magnificent spectacle in Grand Qi, sprawling for thousands of miles. As far as the eye could see, mountainsides were blanketed with teleportation arrays that transported various kinds of rocks, Spirit Stones, and so on.<br/><br/>At the southern face of Kunlun, at the foot of the mountain, stood a colossal stone stele, ten Zhang in height, with three large characters engraved upon it.<br/><br/>Southern Kunlun!<br/><br/>In front of the stone stele stood a figure, none other than Zhu Rulai.<br/><br/>Zhu Rulai, dressed in his black kasaya, approached with the wind.<br/><br/>Clothed in white, Fang Wang descended upon the dragon, looked down at Zhu Rulai, and smiled, “Fellow Daoist, it has been a long time, how have you been?”<br/><br/>Zhu Rulai raised his eyes towards Fang Wang and found that Fang Wang remained unfathomable, which made him sigh inwardly.<br/><br/>He had been diligently cultivating for years, and his cultivation level had greatly risen, drawing ever closer to the Sky-Stepping Realm. He had finally regained some self-confidence, but now, facing Fang Wang again, he felt that the gap between them was widening.<br/><br/>Although Fang Wang wasn’t exuding an overwhelming aura, he made Zhu Rulai feel somewhat unworthy.<br/><br/>“I thought I had made great progress, but seeing you, I realize I’ve only been looking at the sky from the bottom of a well,” said Zhu Rulai earnestly.<br/><br/>Fang Wang chuckled softly, “You flatter me, fellow Daoist. Let’s go, we can talk as we walk, tell me about the Buddhist Sect.”<br/><br/>Zhu Rulai nodded, leaped up, and started leading the way.<br/><br/>Xiao Zi quickly caught up, keeping pace alongside him.<br/><br/>Zhu Rulai began to narrate the recent situation of the Buddhist Sect.<br/><br/>The Buddhist Sect’s support for the seven Great Saint Clans had too significant an impact, leading to widespread criticism of the Buddhist Sect, and its internal factions took this opportunity to cause trouble, plunging the sect into turmoil and revealing numerous scandals, some of which involved Zhu Rulai himself. This was the reason for Zhu Rulai’s action against the Buddhist Sect.<br/><br/>In Zhu Rulai’s words, the Buddhist Sect had rotted, and he wanted to rebuild a new Buddhist Sect!<br/><br/>Fang Wang had heard from Zhou Xue that Zhu Rulai was an orphan taken in and raised by the Buddhist Sect, but the truth was that Zhu Rulai had extraordinary talents from birth that brought disaster to his own family; it was his master who killed his family and then took him in.<br/><br/>Zhu Rulai’s life seemed powerful but was actually filled with sorrow.<br/><br/>He had once harbored a heart full of justice and compassion, but after offending the Buddhist Sect, under their slander, all those he had saved turned against him, cursing him. Disheartened, he withdrew into the vastness of the Southern Celestial Sea until he grew stronger and eventually founded the Divine Sect.<br/><br/>“Such a Buddhist Sect really should be destroyed. Rest assured, fellow Daoist, with you and me joining forces, the Buddhist Sect will surely not withstand,” Fang Wang consoled.<br/><br/>Zhu Rulai’s mood improved, and he felt a trace of gratitude towards Fang Wang.<br/><br/>He was grateful for Fang Wang’s recognition of his strength.<br/><br/>Fang Wang sighed, “If you hadn’t already joined Jin Xiao Sect, I would have wanted to pull you into my Wangdao, to become one of the Twelve Dao Sects. You certainly are the most talented genius I have ever seen. I look forward to clashing with you at the summit of the Mortal Realm once more. It’s such challenges that make life interesting.”<br/><br/>Zhu Rulai, buoyed by Fang Wang’s words, couldn’t help but ask, “Do you really see me that way?”<br/><br/>Xiao Zi couldn’t help but roll her eyes, but she kept silent.<br/><br/>“Of course, do you doubt yourself? That’s not the mindset fitting for the second greatest talent under the heavens,” said Fang Wang, feigning dissatisfaction.<br/><br/>Zhu Rulai couldn’t help but smile, saying, “Actually, Zhou Xue wanted me to join Kunlun, but I was hesitant. She said you wouldn’t ascend and that we were kindred spirits who could create great things together in the Mortal Realm.”\t\t\t\t\t\t</div>", "images": {}, "success": true}