{"id": 314, "url": "https://www.novelhall.com/i-became-an-immortal-on-mortal-realm-32879/14861079.html", "title": "Chapter 310 - Chapter 308 Chapter 305: Chance In The Sea Of Void, Struggle Of The Sword Sect", "volume": 4, "volume_title": "Volume 4", "body": "<h1>Chapter 310 - Chapter 308 Chapter 305: Chance In The Sea Of Void, Struggle Of The Sword Sect</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 308 Chapter 305: Chance in the Sea of Void, Struggle of the Sword Sect<br/><br/>Fang Wang looked at the Unjust True Buddha and sighed, “His Celestial Qiankun Totem is so powerful, how much stronger must the actual Celestial Qiankun be?”<br/><br/>Zhou Xue replied, “The Celestial Qiankun is the pinnacle of cultivation in the Mortal Realm, whether for becoming a Saintly Emperor or not, it breaks through the limits of the Mortal Realm, surpasses fate, and even the most talented individuals, if they cannot reach the Celestial Qiankun Realm, would not possibly slay the Celestial Qiankun, something that no skill can compensate for.”<br/><br/>That exaggerated?<br/><br/>Although Fang Wang was surprised, he did not question it. In today’s battle with the Unjust True Buddha, he indeed gave his all. Although he had many Divine Skills and exceptional techniques that he had not used, whether it was Spiritual Power or the strength of his flesh, he had held nothing back. If Zhou Xue had not stepped in, he estimated he would have had to fight for a while longer to slay the Unjust True Buddha, and it was not certain he would have been able to retain him.<br/><br/>Zhou Xue’s destructive power was slightly weaker than his, but every strike she made weakened the Unjust True Buddha, which proved Zhou Xue’s strength.<br/><br/>Worthy of being the reborn Immortal Venerable, she truly was extraordinary.<br/><br/>He possessed the Heavenly Palace, and any skill could reach Great Perfection in an instant, but for Zhou Xue, she likewise did not need to delve into exceptional techniques; in a certain sense, both of them had the same advantage.<br/><br/>Fang Wang’s mastery over exceptional techniques was stronger, at the realm of Great Perfection, reaching the peak of perfection.<br/><br/>Apart from mastering many exceptional techniques, Zhou Xue also had premonitions of the Mortal Realm’s future.<br/><br/>Despite what Fang Wang had told Xu Qiuming, Zhu Rulai, Yang Du, and others, regarding them as his biggest rivals, in reality, his greatest rival in his heart was Zhou Xue.<br/><br/>This rival was not an enemy, but a positive competitor; in front of him and Zhou Xue, no genius could possibly catch up to them, only watch their backs from afar, forever out of reach.<br/><br/>Zhou Xue raised her hand and grabbed in the air towards Unjust True Buddha’s forehead, his stone-cold forehead cracked open, and a Sharira flew out, landing in her hand.<br/><br/>Fang Wang raised an eyebrow and asked, “Do you need the Shariputra?”<br/><br/>Zhou Xue replied, “To leave it to the disciples of Jin Xiao Sect. Obtaining a Shariputra is a matter of opportunity, who comprehends it will depend on their own fortune, and I cannot intervene.”<br/><br/>Fang Wang nodded, thinking that Zhao Zhen still had not succeeded in studying the Shariputra.<br/><br/>Afterward, Zhou Xue took out a scroll and sealed the body of the Unjust True Buddha inside it.<br/><br/>Fang Wang was curious why she would keep the body.<br/><br/>Noticing his gaze, Zhou Xue explained, “Just in case, like the Thousand Eyes Great Saint, who digs up the eyes of Saint Emperors everywhere. Although the Unjust True Buddha has not truly stepped into the Celestial Qiankun Realm, with his cultivation, preserving his body for ten thousand years is not difficult.”<br/><br/>That’s thorough enough.<br/><br/>But why not just burn it to ashes?<br/><br/>Fang Wang was puzzled, but he did not ask aloud. Everyone had their secrets, and perhaps Zhou Xue intended to practice some forbidden arts; after all, she had once said that before ascending, she was a Demonic Cultivator.<br/><br/>Zhou Xue stored the scroll in her Storage Ring and then turned around to face the ocean, where the turbulent waves had not yet calmed.<br/><br/>“What’s wrong? Aren’t we going back?” Fang Wang asked, his tone one of surprise. Could it be that the Buddhist Sect had another move?<br/><br/>Zhou Xue gazed at the sea and pondered, “This seems to be the Sea of Void. I remember there’s a big opportunity hidden here. I came here before ascending and failed, didn’t get the opportunity. Do you want to try it with me?”<br/><br/>Upon hearing this, Fang Wang’s face showed hesitation.<br/><br/>“Don’t worry, besides Su Xuan, I have arranged for others to go to the Buddhist Sect. Your treasured snake demon will be fine,” Zhou Xue teased.<br/><br/>Fang Wang solemnly said, “Xiao Zi is not a snake demon, she’s a True Dragon.”<br/><br/>“Hehe, is there a difference?”<br/><br/>“There is a difference indeed.”<br/><br/>“Let’s go find a place to rest for a few days and recover our Spiritual Power before we go in search of opportunities.”<br/><br/>“Are you tired?”<br/><br/>“Why, are you in a hurry?”<br/><br/>“Not really, then let’s go. Find an isolated island. Speaking of which, I’ve never spent time with you alone.”<br/><br/>Fang Wang said with a smile, and as he spoke, he even winked at Zhou Xue. Unfortunately, Zhou Xue did not respond. She leapt into the air and flew towards the end of the heavenly sea.<br/><br/>Fang Wang quickly followed behind her.<br/><br/>He suddenly realized that he was quite restrained in the presence of Gu Li, Tai Xi, and Hong Xian’er, but when it came to Zhou Xue, he always wanted to get some verbal advantage.<br/><br/>In front of Kunlun, within Sword Heaven Marsh, countless Sword Cultivators were scattered everywhere. Some were fishing by the lake, others were discussing swordsmanship, some were comprehending their swords on the surface of the lake, and even in the air, there were people practicing their sword techniques. At a glance, there were too many to count.<br/><br/>“That Cang Qi Demon Emperor was right in front of me, not even ten steps away. He questioned whether I really intended to protect the people of the Northern Yan Pass. I told him that as a Cultivator, the sword in our hands is to guard the common people. Even if I were to die on this path, I would have no regrets…”<br/><br/>Fang Wang’s nephew, Fang Jing, stood with hands on hips, recounting his glorious experience. Around him were about two hundred young Cultivators, and most looked at him with admiration in their eyes.<br/><br/>In the distance.<br/><br/>Gu Tianxiong, Hong Chen, and Fang Bai were fishing. Fang Bai glanced at the non-stop talking Fang Jing and snorted. “That kid really knows how to brag. I wonder how capable he actually is.”<br/><br/>“I think he’s done for, not at all like the demeanour of his great-uncle. My brother Fang Wang is not that ostentatious,” Gu Tianxiong said with a chuckle.<br/><br/>Fang Bai sighed as if lamenting something.<br/><br/>“Don’t underestimate him. He has concealed his aura. His strength is considerable, at least among the best of his peers. He must have received some great legacy. After all, he’s the nephew of a Dao Master; it’s normal for Fate to bless him,” Hong Chen said calmly as he watched his fishing rod.<br/><br/>Upon hearing this, Gu Tianxiong looked at Fang Jing surprised, while Fang Bai paused and then smiled expectantly.<br/><br/>“Fang Jing is not contending for the position in the Sword Sect. Your rival is not him, but someone else.”<br/><br/>Dugu Wenhun came up behind Fang Bai and said with a smile.<br/><br/>Fang Bai turned around and asked, “Who?”<br/><br/>His strength was not the strongest in Sword Heaven Marsh, not even first tier, but since he was aiming for the Sword Sect, it had to be about swordsmanship. The Sword Servants of Sword Heaven Marsh had placed their hopes on him, and his talent for the Sword Dao had already been proven.<br/><br/>Dugu Wenhun said with a smile, “Xu Qiuming. Have you heard this name? The Jin Xiao Sect sent a message that the Demon Monarch agreed to let Xu Qiuming leave, and on behalf of Xu Qiuming, sent a letter. He intends to contend for the position in the Sword Sect. In his own words, only he is worthy to be the Sword Sect of the Dao Master.”<br/><br/>Xu Qiuming!<br/><br/>Fang Bai’s expression changed slightly. He had certainly heard this name. In the Grand Qi Cultivation Realm, there were two legendary figures, and Xu Qiuming was second only to one.<br/><br/>Xu Qiuming had not only proven himself on the mainland but also made a significant name for himself in the surrounding seas.<br/><br/>What’s crucial is that it’s said that Tian Dao Fang Wang had repeatedly mentioned Xu Qiuming as his biggest rival in the Sword Dao.<br/><br/>Confronted with such a genius, it was natural for Fang Bai to feel pressured, but pressure can also become a driving force.<br/><br/>If he could defeat Xu Qiuming, how would Ancestor Fang view him?\t\t\t\t\t\t</div>", "images": {}, "success": true}