{"id": 310, "url": "https://www.novelhall.com/i-became-an-immortal-on-mortal-realm-32879/14859753.html", "title": "Chapter 306 - Chapter 306 Chapter 303 How Many Years Have We Not Joined Forces_1", "volume": 4, "volume_title": "Volume 4", "body": "<h1>Chapter 306 - Chapter 306 Chapter 303 How Many Years Have We Not Joined Forces_1</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 306 Chapter 303 How Many Years Have We Not Joined Forces_1<br/><br/>“Aaahhh—”<br/><br/>Amid the chaotic golden energy waves, the female ghost screamed with all her might, her voice filled with pain.<br/><br/>Beset by demons, Fang Wang lifted his eyes; they were so cold. Yang energy blazed fiercely all over him, incinerating the demons clinging to his body to ash.<br/><br/>Behind him, the Town World Bead continued to voraciously devour everything within heaven and earth, causing the Unrighteous True Buddha’s Celestial Qiankun Totem to begin collapsing.<br/><br/>Fang Wang looked toward the distant Unrighteous True Buddha, lifted the Heavenly Palace Halberd in his right hand, and pointed it at Unrighteous True Buddha.<br/><br/>“Is this the power of Celestial Qiankun?”<br/><br/>As Fang Wang’s voice echoed, nothing in the world could drown out his words.<br/><br/>The Unrighteous True Buddha did not get angry; instead, he laughed eerily. He lifted his left hand high above his head, and statues from afar rapidly flew toward him, pressing into the palm of his hand as if a mountain were growing larger.<br/><br/>“Immune to soul attacks? Your cultivation technique really surprises me,” said the Unrighteous True Buddha, laughing, his voice still authoritative.<br/><br/>Millions of stone statues converged to form a mountain larger than the Town World Bead. Just as Fang Wang was about to act, the mountain suddenly vanished.<br/><br/>A thunderous boom sounded from behind; Fang Wang glanced back, only to see the huge mountain striking the Town World Bead.<br/><br/>The Town World Bead immediately devoured the mountain. However, as the mountain shattered, rolling blood qi rapidly enveloped the Town World Bead, completely surrounding it and halting its world-shaking devouring force abruptly.<br/><br/>Without giving Fang Wang a moment to think, the Unrighteous True Buddha killed his way back to his front.<br/><br/>Fang Wang instinctively raised his halberd to block, and the two engaged in battle once more.<br/><br/>In the distance.<br/><br/>Su Xuan flew into the red protective barrier, arriving next to Zhou Xue, and remarked with emotion, “Isn’t that kid too exaggerated? Using Heaven-Breaking Realm cultivation to push a Semi-Celestial Qiankun being to this point.”<br/><br/>Zhou Xue looked at Fang Wang with her lips curling up, softly-laughing, “Of course, any talent would pale in comparison to him.”<br/><br/>Boom!<br/><br/>The blood-red world suddenly shattered; a fierce wind swept everything out of heaven and earth.<br/><br/>Zhou Xue’s Spiritual Power shield also trembled violently, causing the Buddhist Sect Cultivators within its protection to feel dizzy and disoriented. She glanced in a certain direction, raised her hand, and forcibly pulled Xiao Zi into her own barrier.<br/><br/>Xiao Zi had already fainted. Floating above its head, Zhao Zhen breathed a sigh of relief, gratefully looking at Zhou Xue.<br/><br/>“Help me protect them.”<br/><br/>Zhou Xue dropped these words and vanished from the spot.<br/><br/>Su Xuan quickly raised his hand to maintain the barrier with his own power, his gaze chasing after Fang Wang.<br/><br/>The sky instantly brightened, and they seemed to arrive in a whole new world below with rolling mountains and scenic landscapes.<br/><br/>Fang Wang and the Unrighteous True Buddha were nowhere to be seen; at this moment, they were fighting above the sea.<br/><br/>The two maneuvered swiftly, clashing continuously. The Unrighteous True Buddha kept switching magical artifacts, empowering his spells and divine skills with the artifacts’ power, each move imbued with destructive force.<br/><br/>Fang Wang had already taken the Town World Bead back inside his body and continued to fight with the Heavenly Palace Halberd. The twelve small suns still floated behind his head, with the flames on them growing more vigorous and showing signs of merging. Behind them, a black tome was gathering.<br/><br/>The Mie Jue Divine Tome!<br/><br/>The Unrighteous True Buddha obviously recognized the Mie Jue Divine Tome. Seeing Fang Wang condensing the tome, he immediately grew desperate, his momentum completely erupting as he attacked frantically, even forsaking defense.<br/><br/>The Heavenly Palace Halberd struck him, repelled by his Spiritual Power, but Fang Wang still refused to concede, repeatedly smashing down, making it very uncomfortable for the opponent, shaking the qi and blood within his body.<br/><br/>Fang Wang infused the power of the Mie Jue Divine Tome into the Heavenly Palace Halberd, causing black flames to ignite on it. Now, the Unrighteous True Buddha dared not take Fang Wang’s moves head-on and was forced to dodge, which also slowed his offensive momentum.<br/><br/>Fang Wang grew more and more excited as the battle raged on. The Unrighteous True Buddha was truly strong, the strongest opponent he had faced so far, but the gap was closing, and he reveled in the delightful sensation of chasing down an enemy.<br/><br/>He even felt he might have a chance to execute the Unrighteous True Buddha!<br/><br/>Once again, the Unrighteous True Buddha dodged the Heavenly Palace Halberd, his left hand forming a Buddhist Seal and smashing it onto Fang Wang in an attempt to seal him. Unfortunately, Fang Wang shrugged his shoulder, forcibly dispelling the seal, and followed with a swing of his halberd towards his face.<br/><br/>Boom!<br/><br/>The two crashed into the sea, charging back and forth, creating a deep trench that seemed to split the sea surface in an instant, with no end in sight—a visually stunning scene.<br/><br/>Many monsters in the sea were directly shattered by their aura, their flesh and blood swept away with the waves.<br/><br/>Underwater, Fang Wang continued to entangle the Unrighteous True Buddha, gradually gaining the upper hand.<br/><br/>The Divine Skills of the Unrighteous True Buddha were indeed formidable, and even Fang Wang’s Heavenly Gang Supreme Yang Tyrant Body began to shed blood. Fortunately, it was still within his self-healing range.<br/><br/>Several dozen breaths later.<br/><br/>The two burst out of the sea and flew into a continent. Fang Wang struck with the Nine Dragons Tyrant Fist against the Unrighteous True Buddha’s Buddhist Fist, and their overwhelming powers flattened the mountains below, utterly domineering.<br/><br/>Fang Wang raised an eyebrow and flew upward, trying to draw the Unrighteous True Buddha away from the ground. However, the Unrighteous True Buddha remained indifferent.<br/><br/>“You really are kind.”<br/><br/>The cold sneer of the Unrighteous True Buddha rang out, when suddenly, he swung the Golden Vajra in his hand and a rolling blood mist spread along his black kasaya, swiftly covering the land and sweeping toward the ends of the world at an incredible speed. Where it passed, all vegetation withered, wild beasts turned to bones, and insects and ants petrified.<br/><br/>A cold light flashed in Fang Wang’s eyes, ready to intervene.<br/><br/>Just then.<br/><br/>The Unrighteous True Buddha seemed to sense something and instinctively turned his head, glancing behind him from the corner of his eye, only to see a figure appearing behind him.<br/><br/>Zhou Xue!<br/><br/>Zhou Xue, in black clothes with her long hair fluttering and a stern face, struck his back with her right palm at a sharp speed, and a dark red sword blade emerged from her palm.<br/><br/>Pft!<br/><br/>The sword pierced through the Unrighteous True Buddha’s back, causing him to kick at Zhou Xue in shock.<br/><br/>Zhou Xue raised her arm to block, but was still sent flying hundreds of feet. She glanced at her left arm that she had used to block, shook it slightly, and then, flicking her sword, her eyes focused back on the Unrighteous True Buddha.<br/><br/>The Unrighteous True Buddha turned around, intending to kill Zhou Xue, but his expression changed in an instant. Immediately, he pressed acupuncture points on himself, mobilizing the Spiritual Power inside to suppress the violent energy within.<br/><br/>Fang Wang descended from the sky, landing behind the Unrighteous True Buddha, flanking him with Zhou Xue.<br/><br/>“What incredible speed, her Escape Skill is extraordinary,” Fang Wang thought to himself. He hadn’t seen how Zhou Xue had appeared behind the Unrighteous True Buddha at all, and her speed was also very fast.<br/><br/>Zhou Xue lifted her sword, pointing it at the Unrighteous True Buddha, and said with a slight laugh, “Fang Wang, how many years has it been since we last fought side by side?”<br/><br/>Fang Wang looked at her and replied, “Three hundred years, I suppose.”<br/><br/>“Just one year shy of three hundred,” she said. “He has gained much insight from his battle with you. If we let him escape, he will become a force to be reckoned with in the Celestial Qiankun. Thus, he must die here.”<br/><br/>Zhou Xue spoke as if she were alone, completely ignoring the Unrighteous True Buddha’s presence, making his face turn extremely sour.\t\t\t\t\t\t</div>", "images": {}, "success": true}