{"id": 319, "url": "https://www.novelhall.com/i-became-an-immortal-on-mortal-realm-32879/14864864.html", "title": "Chapter 309 - Chapter 309 Chapter 306 Great Silence Palace_1", "volume": 4, "volume_title": "Volume 4", "body": "<h1>Chapter 309 - Chapter 309 Chapter 306 Great Silence Palace_1</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 309 Chapter 306 Great Silence Palace_1<br/><br/>The nights of the Sea of Void were chilly, with a sea breeze whistling, yet it did not chill one to the bone.<br/><br/>On a secluded island, the bonfire’s light flickered like the stars in the deep night, ethereal and on the verge of vanishing at any moment.<br/><br/>Fang Wang and Zhou Xue sat in meditation beside the fire, shoulder to shoulder. They did not speak, each absorbed in their own thoughts.<br/><br/>Fang Wang didn’t feel awkward; instead, he found it very comfortable. Just sitting quietly like this was quite nice, thinking of nothing and doing nothing.<br/><br/>A long time passed.<br/><br/>Zhou Xue broke the silence, asking, “Are you really deciding not to ascend?”<br/><br/>Fang Wang turned his head to look at Zhou Xue, and asked with a smile, “What? You don’t wish for me to stay in the mortal realm anymore? Didn’t you agree before?”<br/><br/>“With your current talent, plus the path I’ve laid out for you, we wouldn’t have a hard time getting a foothold in The Upper Realm, it would just require bowing our heads and enduring for some time. I’m afraid your pride will bring you immense trouble if you stay in the human world. You should be able to feel the changes in yourself, which I guess are the changes brought about by the Immaculate Dao Bones.”<br/><br/>Zhou Xue spoke earnestly, her face illuminated by the firelight, her expression calm and inscrutable.<br/><br/>Fang Wang didn’t answer but countered with a question, “Do you have to ascend?”<br/><br/>In his eyes, the Upper Realm wasn’t so great. Many powerful beings, aware of the dangers, still sought to ascend, aiming for higher opportunities, which he didn’t need.<br/><br/>“Some grudges must be avenged. Even though everything has restarted, the memories of hatred are still present. Besides, I’m not sure if I have been reborn into the past or have come to another identical alternate universe,” Zhou Xue’s gaze fell onto the bonfire.<br/><br/>Upon hearing this, Fang Wang laughed and said, “One shouldn’t put all their eggs in one basket. I’ll stay and grow in the human world, but if you run into trouble in The Upper Realm, I will come to rescue you.”<br/><br/>Zhou Xue gave him a sidelong glance and said, “You think you can just go to The Upper Realm whenever you want?”<br/><br/>Fang Wang laughed and replied, “I really could in the future.”<br/><br/>He then went on to simply describe the mysteries and origins of the Lingxiao Divine Sect.<br/><br/>After listening, Zhou Xue said with emotion, “I had felt your movement technique was extraordinary before, but I didn’t expect it to be another supreme teaching from a Great Saint. Although I don’t know much about the Lingxiao Great Saint, judging from the Lingxiao Divine Sect, his accomplishments are far from simple.”<br/><br/>“Do you want to learn it? I can teach you.”<br/><br/>“Never mind that. If I want to descend, I have my own methods. If I need you, there are ways to let you know. Why waste time learning, and besides, your Jiuyou Zizaishu is enough for me to cultivate.”<br/><br/>The conversation flowed as the two chatted nonstop, occasionally erupting into laughter.<br/><br/>Above the bonfire, the flames danced with the wind, casting their flickering shadows.<br/><br/>A long time passed.<br/><br/>“By the way, I’m curious, how big is the difference between Great Saints, Great Emperors, and Immortal Gods?” Fang Wang suddenly changed the subject and asked.<br/><br/>The Great Saints and Great Emperors he had encountered were no match for The Upper Realm, with the Descending Dragon Great Saint even defeated by an Immortal God, which greatly heightened the reverence Fang Wang had for Immortal Gods.<br/><br/>Zhou Xue answered, “It’s difficult to make a direct comparison. Great Saints and Great Emperors represent a certain status within heaven and earth, rather than a realm — much like the Immortal Gods. Saints, Emperors, and Immortals all have different levels of mastery. A powerful Great Saint or Great Emperor can roam The Upper Realm unbeaten. Precisely for this reason, The Upper Realm has been unable to subdue the lower realms, resorting to various means to suppress them instead.”<br/><br/>Upon hearing this, Fang Wang relaxed.<br/><br/>This indicated that in terms of upper limits, the human world might not be inferior to The Upper Realm.<br/><br/>“You mentioned before about the Nine Lives Precious Spirit, is that the kid from the Buddhist Sect?” Fang Wang followed up with a question.<br/><br/>Zhou Xue shook her head and said, “He is a reincarnated Buddhist child from The Upper Realm. In his previous life, after awakening his true self, he caused a ruckus in the Eastern Mortal Realm and soon left the mortal world. He didn’t compete for the opportunity to ascend. The Nine Lives Precious Spirit you’re talking about is from the Western Mortal Realm. Once the Ascension Stairway ends, the barriers between the Eastern Mortal Realm and the Western Mortal Realm will dissolve, ushering in an era of strife in the mortal world.”<br/><br/>“The Western Mortal Realm is stronger than the Eastern Mortal Realm. In the initial two hundred years, the prodigies of the Western Mortal Realm dominated the scene, until later on, other talents from the Eastern Mortal Realm caught up and stood toe-to-toe with them.”<br/><br/>Zhou Xue talked about the trends of the future, and Fang Wang listened attentively. Perhaps the future had already changed, but the general direction wouldn’t change. He and Zhou Xue were not yet powerful enough to change the whole human realm.<br/><br/>As the moon set and the sun rose, a night passed.<br/><br/>At the break of dawn, Fang Wang followed Zhou Xue as they flew toward the distance. Their speed was very fast; not long after they took off, there was a competitive edge between them and they began chasing each other.<br/><br/>Half a day later, they arrived at a sea area. The seawater here was deep and oppressive under the rolling clouds.<br/><br/>They plunged into the water and rapidly dived to the seabed.<br/><br/>“Is the inheritance at the bottom of the sea?”<br/><br/>Fang Wang communicated through spiritual energy, as the demonic qi in this sea area was extremely dense, making it the sea area with the heaviest demonic qi he had ever seen.<br/><br/>There must be a Great Demon hidden in the seabed!<br/><br/>“Yes, we might also encounter hidden demonic races. Don’t be negligent. On the land, the demonic races are not as powerful as the human races, but the most terrifying of their kind are hidden at the bottom of the sea. Before my ascension in my previous life, the humans could not completely understand the conditions of the seabeds of all sea areas; many places were forbidden territories for the human cultivators, who dared not set foot there,” Zhou Xue said without turning her head, her tone revealing no emotion.<br/><br/>Fang Wang’s intuition told him they would inevitably encounter demonic races!<br/><br/>The things people least hope to happen often end up occurring.<br/><br/>The two continued to dive, sinking into the darkness. With their spiritual senses, they moved unhindered and did not slow down.<br/><br/>The depths of this seabed were so exaggerated that Fang Wang felt he had dived thousands of miles and still had not reached the bottom.<br/><br/>Finally!<br/><br/>He saw a forest-green luminescence appearing below, growing larger and larger.<br/><br/>Eventually, he and Zhou Xue landed in front of the grand entrance of a colossal palace; the doors were a hundred zhang high, with four large characters inscribed on the plaque above them.<br/><br/>Great Silence Palace!<br/><br/>“This place holds a Cave Heaven and was once the Dao Palace of Emperor Extinction. This Emperor Extinction was no ordinary figure; even in the Celestial Court of the Upper Realm, he left a formidable reputation. He was one of the few who could make a scene in the Immortal Court and still hold a position as an Immortal Official,” Zhou Xue introduced with a hint of anticipation in her voice.<br/><br/>Fang Wang said with a smile, “You’re not telling me that after ascending, you heard his legend and regretted not fighting harder, and that’s why you can’t stop thinking about it?”<br/><br/>“You’ve guessed right, but that doesn’t please me,” Zhou Xue responded, and then took a step forward. She walked up to the great doors and pushed them open with her palm.<br/><br/>As the doors opened, countless bubbles burst forth, dazzling to the eye. Fang Wang then felt a burst of vigorous spiritual energy rush towards him.<br/><br/>Zhou Xue’s robe billowed, she twisted her waist and stepped forward, Fang Wang following closely behind.<br/><br/>After entering the Great Silence Palace, the doors closed behind them. The dim passage ahead became bright, and the seawater instantly receded, flowing away through the cracks along the edges of the corridors.<br/><br/>On the walls, there were murals of various creatures depicted, all in red, as if they were painted with fresh blood.<br/><br/>Their footsteps echoed; the further forward they went, the broader and brighter the palace corridor became.<br/><br/>Fang Wang looked at the pictures on the walls along the way, feeling as if he was looking at history. The demonic creatures varied in posture and race, and some murals even depicted scenes of combat.\t\t\t\t\t\t</div>", "images": {}, "success": true}