{"id": 317, "url": "https://www.novelhall.com/i-became-an-immortal-on-mortal-realm-32879/14863801.html", "title": "Chapter 313 - Chapter 311 Chapter 308: Extinction Traceless Step, Only Three Survive", "volume": 4, "volume_title": "Volume 4", "body": "<h1>Chapter 313 - Chapter 311 Chapter 308: Extinction Traceless Step, Only Three Survive</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 311 Chapter 308: Extinction Traceless Step, Only Three Survive<br/><br/>Human Cultivators may not pay much attention to the affairs of the Demon Race, but the demons have always kept an eye on humanity, and Fang Wang’s reputation over the years has simply grown too large.<br/><br/>Having annihilated and resurrected the Thousand Eyes Great Saint, vanquished the Seven Great Saint Clans, and then inherited Emperor Donggong’s legacy, no one could match his prominence. He had already proven himself as the top prodigy in the world.<br/><br/>Ying Cang Hai, Ming Hai Lin, Chen Yao, and Shen Jiu Jiao could be considered the foremost prodigies of their respective demon palaces. They naturally paid attention to human prodigies, and in regards to Fang Wang, they held no doubts, only envy and fear.<br/><br/>Fang Wang’s combat achievements were very intimidating!<br/><br/>At least to the Demon Race, he was seen as a god of slaughter!<br/><br/>“The four of you needn’t be tense, he’s not a bloodthirsty man. As long as there is no conflict, everyone can leave safely,” Zhou Xue said with a smile. Her gentle smile eased the tension of the four demons.<br/><br/>Shen Jiu Jiao took a deep breath and said, “Don’t worry, we are all here for the inheritance, we won’t cause trouble.”<br/><br/>The other three demons nodded, even the coldest-looking Ming Hai Lin appeared timid.<br/><br/>Fang Wang looked at Zhou Xue and asked, “Where is the inheritance?”<br/><br/>Zhou Xue turned around and said, “Let’s go. It’s up ahead and requires skill to unlock.”<br/><br/>The four demons from Ying Cang Hai hurriedly followed, but they remained alert, keeping a safe distance.<br/><br/>Zhou Xue led the way, and after about a hundred steps, she stopped and began to walk back and forth. At first, it seemed she was wandering aimlessly, but gradually, Fang Wang and the four demons realized that her walk was quite exquisite, containing some profound mystery of heaven and earth, making them inexplicably feel like they were about to understand something profound.<br/><br/>Before long, the mist within the Great Silence Palace surged towards them, revealing a series of stone pillars in the distance.<br/><br/>Each pillar was densely covered with text and diagrams, dizzyingly complex.<br/><br/>The mist from all directions converged in front of Zhou Xue, quickly forming a human figure.<br/><br/>This scene made the four demons tense, while Fang Wang looked around.<br/><br/>When the mist dissipated, it revealed a vast square with a smooth and flat surface, its diameter easily surpassing a hundred miles.<br/><br/>Hmm…<br/><br/>It looked like a perfect battleground!<br/><br/>Thinking this, Fang Wang’s gaze then fell on the figure in front of Zhou Xue.<br/><br/>The figure was pitch black with only a silhouette visible, draped in long hair, with two sharp horns protruding from its head—a clear sign of the Demon Race.<br/><br/>Upon seeing him, the faces of the four demons from Ying Cang Hai changed slightly, as if they sensed something.<br/><br/>“Youngster of the Human Race, since when did you learn the Extinction Traceless Step? You shouldn’t have been here before,” the mysterious figure spoke, his tone indifferent, exuding an aura of unprovoked authority.<br/><br/>Zhou Xue replied proudly but respectfully, “Reporting to the senior, I learned the Extinction Traceless Step in another place and also gained clues about the opportunity here.”<br/><br/>The four demons from Ying Cang Hai looked at Zhou Xue with astonishment, perplexed. Hadn’t she said she had been here before?<br/><br/>Though confused, they didn’t question it; they weren’t bold enough to offend Fang Wang yet.<br/><br/>The mysterious figure fell silent for a moment, then said, “In that case, prepare to accept the evaluation.”<br/><br/>As this statement was made, the four demons showed signs of surprise, they had not expected it to be this straightforward!<br/><br/>They didn’t think it would be easy, especially since Zhou Xue used the Extinction Traceless Step—anything associated with ‘extinction’ was bound not to be simple.<br/><br/>The mysterious figure raised his arms, and in an instant, the huge palace underwent a sudden change. The surroundings didn’t change, but the lighting did—it became as bright as day.<br/><br/>“The first test is that only three among you will live to inherit my trial,” the mysterious figure declared, referring to his own trial, making it clear that he must be Emperor Extinction.<br/><br/>Three?<br/><br/>The faces of the four demons changed dramatically.<br/><br/>Fang Wang couldn’t help but look at Zhou Xue, suddenly having an idea in his mind.<br/><br/>This woman can’t really be that terrifying, can she!<br/><br/>Zhou Xue turned around, looked at the four members of the Demon Race, and smiled as she asked, “Do you want to back out? There’s still time.”<br/><br/>Upon hearing this, the expressions of the four demons fluctuated between gloom and uncertainty as they looked at each other.<br/><br/>With gritted teeth, the dragon-like demon said, “Given how things have progressed, how can we back out? If this got out, how could we continue to stand in the Demon Palace!”<br/><br/>Ying Cang Hai took a deep breath and said, “That’s right, the path against the heavens should always be pursued relentlessly—how can we be timid and shrink back?”<br/><br/>Chen Yao and Ming Hai Lin didn’t make a sound, but their attitudes were very clear, their eyes resolutely fixed on Fang Wang.<br/><br/>They all regarded Fang Wang as the strongest opponent.<br/><br/>Emperor Extinction soared into the air, allowing them to fight amongst themselves.<br/><br/>Fang Wang took a step forward, twisted his neck, and said, “You said, who should live?”<br/><br/>Zhou Xue chuckled, pointing at Ying Cang Hai, and smiled, “Let’s pick this eagle then.”<br/><br/>Arrogant!<br/><br/>The attitude in the eyes of the two instilled a mix of shock and anger in the four demons, and while Ying Cang Hai was furious, he couldn’t help but breathe a sigh of relief deep inside.<br/><br/>Fang Wang gestured to the four demons and said, “Come on then, if you must die, you should die in an upright battle, shouldn’t you?”<br/><br/>At those words, the four demons roared lowly and burst forth with their demon might, attacking Fang Wang en masse.<br/><br/>The dragon-shaped demon’s upper body transformed into a dragon’s form, and with a single step, he reached Fang Wang. His dragon claw swept across sharply, exuding a chilling air.<br/><br/>His speed was extremely fast, yet Fang Wang was faster.<br/><br/>Fang Wang slightly turned his body, his right leg lifted like a whip sweeping across, and struck the dragon’s head of the demon. The terrible force sent the dragon spinning and tumbling away, constantly smashing against the ground, until it flew to the wall of the palace a hundred miles away. The dragon’s body embedded itself into the wall, around which spiderweb-like cracks appeared.<br/><br/>Ying Cang Hai flapped his wings and flew up, his wings beating towards Fang Wang, countless feathers transforming into a rain of arrows descending with great momentum.<br/><br/>Fang Wang threw a punch, and a Black Dragon burst out. The rain of arrows was indeed spectacular but was no match for the Black Dragon. The Black Dragon roared as it rushed forward, scattering all the arrows and hitting Ying Cang Hai, blasting him towards the Firmament.<br/><br/>Chen Yao and Ming Hai Lin’s expressions changed drastically. They were scared and hastened to retreat, not daring to approach Fang Wang.<br/><br/>They each pulled out their Magical Artifacts and cast Spells, attacking Fang Wang from a distance.<br/><br/>Fang Wang took a step out, and a sudden gust of wind arose, dispersing the lightning and poison fog unleashed by the two demons, and in one step, he arrived in front of Ming Hai Lin.<br/><br/>“How is this possible… What on earth is he…”<br/><br/>Ming Hai Lin was shocked, his heart filled with terror. Subconsciously, he lifted his Magical Artifact, ready to defend against Fang Wang’s attack.<br/><br/>Fang Wang slammed his fist down, directly pulverizing Ming Hai Lin’s body into a cloud of blood.<br/><br/>One-hit kill!<br/><br/>Ming Hai Lin was merely at the Divine Passage Realm, how could he withstand a punch from Fang Wang?<br/><br/>The dragon-like demon’s cultivation was a bit stronger, on the verge of stepping into the Sky-Stepping Realm, and Fang Wang could have killed him in a second too, but intentionally spared him the chance, taking an attitude of watching the spectacle unfold.<br/><br/>After slaying Ming Hai Lin, Fang Wang turned around to look at Chen Yao.<br/><br/>Chen Yao’s delicate face turned pale in an instant. Seeing Fang Wang about to kill her, she quickly knelt down and shouted loudly, “Please…”<br/><br/>Before she could finish her plea, Fang Wang had already reached her. Bright light shone down, and as Chen Yao looked up, she couldn’t discern his expression, seeing only a pair of cold eyes.<br/><br/>Boom!<br/><br/>The ground shattered, and dust flew up, covering Fang Wang’s figure.<br/><br/>Ying Cang Hai fell from the sky, his black armor already shattered, his body drenched in blood. He looked towards Fang Wang’s direction, his eyes filled with fear.<br/><br/>“How is this possible…”\t\t\t\t\t\t</div>", "images": {}, "success": true}