{"id": 313, "url": "https://www.novelhall.com/i-became-an-immortal-on-mortal-realm-32879/14861078.html", "title": "Chapter 309 - Chapter 307 Chapter 304 Reincarnation Of The Celestial Immortal Venerable_1", "volume": 4, "volume_title": "Volume 4", "body": "<h1>Chapter 309 - Chapter 307 Chapter 304 Reincarnation Of The Celestial Immortal Venerable_1</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 307 Chapter 304 Reincarnation of the Celestial Immortal Venerable_1<br/><br/>“Hehe, do you really think you can kill me?”<br/><br/>The Unrighteous True Buddha laughed coldly, and as his words fell, he stomped fiercely, causing the firmament to change color in an instant, turning blood red again.<br/><br/>Fang Wang looked up and felt that familiar oppressive sensation, it seemed they were once again wrapped in the Unrighteous True Buddha’s Celestial Qiankun Totem.<br/><br/>Zhou Xue pointed her sword at the Unrighteous True Buddha and said, “Once entangled in the Celestial Qiankun’s totem, that marks the beginning of defeat, unless your Celestial Qiankun totem is stronger than your opponent’s. Additionally, don’t recklessly merge your true self with the Celestial Qiankun totem, doing so will make you its weakness.”<br/><br/>Clearly, her words weren’t meant for the Unrighteous True Buddha but for Fang Wang.<br/><br/>Upon hearing this, the Unrighteous True Buddha’s face greatly changed. He stared dead at Zhou Xue and asked in a deep voice, “Who are you, a reincarnation of which godly being?”<br/><br/>To be able to point out the weaknesses of the Celestial Qiankun, Zhou Xue must have once reached the Celestial Qiankun Realm!<br/><br/>Zhou Xue tilted her head slightly, looking askance at the Unrighteous True Buddha, and said, “I am a reincarnation of the Celestial Immortal Venerable, do you believe it?”<br/><br/>“Celestial Immortal Venerable?”<br/><br/>The Unrighteous True Buddha was stunned for a moment, followed by a look upward and a crazed, furious laugh.<br/><br/>He suddenly looked down, his gaze burning with anger at Zhou Xue, and said coldly, “Do you take me for a three-year-old child?”<br/><br/>Boom!<br/><br/>With a single step, the Unrighteous True Buddha shattered the ground and, in one stride, reached Zhou Xue, swinging his Golden Vajra down at her.<br/><br/>Zhou Xue turned around, her dark red long sword spinning. She seized the momentum to backhand her sword, slashing upwards.<br/><br/>As the sword blade clashed with the Golden Vajra, a streak of blood-colored Sword Qi shot up from the ground, soaring into the firmament; the Unrighteous True Buddha took flight, tilting his head to dodge the Sword Qi, his gaze fixed on Zhou Xue, showing a hint of fear.<br/><br/>Just then!<br/><br/>Fang Wang appeared behind the Unrighteous True Buddha, sweeping his halberd across, striking the latter’s waist and sending him crashing, smashing through the earth.<br/><br/>The entire continent was already ablaze due to the Unrighteous True Buddha’s transformation, countless innocent beings caught in the crossfire, annihilated in the blink of an eye.<br/><br/>Boom!<br/><br/>The Unrighteous True Buddha flew out from the depths of the earth, his face now covered in blood, unable to hold back the fresh blood gushing from his mouth, his eyes threaded with blood vessels.<br/><br/>Fang Wang and Zhou Xue attacked simultaneously, not giving him a chance to regain his footing, unleashing a fierce barrage.<br/><br/>The Unrighteous True Buddha, outnumbered, could not withstand the onslaught of Fang Wang and Zhou Xue, despite the earth-shattering power of his Golden Vajra.<br/><br/>“Is that sword your Lifespirit Treasure? Not bad at all!” Fang Wang said, swiftly wielding his Heavenly Palace Halberd.<br/><br/>Zhou Xue’s swordsmanship was equally fast; unlike the domineering power of the Heavenly Palace Halberd, her sword was sharper, each stroke casting Sword Qi of great destructive force, tearing through the bloody skies and cleaving the earth.<br/><br/>“Hmm, it took me two hundred years to forge it successfully. This sword is named the Reverse Absolute Sword, don’t underestimate it. I prepared it especially for you.”<br/><br/>As Zhou Xue swung her sword, she spoke, her movements exquisite, not the slightest bit inferior to Fang Wang’s Lingxiao Divine Sect style, constantly shifting positions, making it impossible for the Unrighteous True Buddha to land a hit on her.<br/><br/>Fang Wang raised his halberd and stabbed forward; nine Black Dragons emerged, overwhelming the already injured Unrighteous True Buddha. Even though he blocked with his Golden Vajra, he was still sent flying back, blood pouring ceaselessly from his mouth.<br/><br/>“Prepared especially for me? What do you mean?”<br/><br/>“Even though you’re strong, I don’t like to lose. Haven’t you said before that we should have a match someday? I have no intention of losing to you.”<br/><br/>“Haha, to defeat your fiancé, you sure have high ambitions!”<br/><br/>“Sorry, I’ve never been a delicate lady. If you want to rely on me, I don’t mind.”<br/><br/>As they talked, they continued their relentless assault. The Unrighteous True Buddha grew increasingly passive, and his rage swelled.<br/><br/>“This is… bullying… too much…”<br/><br/>The Unrighteous True Buddha’s heart roared with rage, and far away the ground shook violently. From within the sea of fire emerged statue after statue, identical to those seen before.<br/><br/>Zhou Xue’s foot pressed against his chest, propelling her to leap upwards. With one hand raised high, she brought down her sword. The Sword Qi stretched for ten thousand miles, possessing the might to sever the heavens and the earth. A crack appeared in the blood-red firmament, as if it were split in two.<br/><br/>“It’s time to end him, Fang Wang. Use your strongest Divine Skill, and don’t be weaker than me!”<br/><br/>Zhou Xue’s voice rang out as the Unrighteous True Buddha was slashed down by her Sword Qi, kneeling amidst the surging sea of fire.<br/><br/>Upon hearing this, Fang Wang leaped up, releasing the Heavenly Palace Halberd from his right hand to condense the Rainbow Sword.<br/><br/>The Zhu Xian Jing Hong Sword was activated!<br/><br/>A thousand-zhang tall ghostly deity coalesced behind him, with the Mie Jue Divine Tome floating behind the deity. The power of annihilation connected to the ghostly deity in the form of dark mist, enhancing its daunting presence.<br/><br/>Just then!<br/><br/>The Unrighteous True Buddha let out a long, exhaustive howl, covered in blood and looking utterly pitiful. After his howl, he furiously pounded the earth with his fists.<br/><br/>Accompanying his strikes, the entire continent began to split, and columns of magma erupted, an immense spectacle to behold.<br/><br/>The statues turned in unison, raising their palms toward the Unrighteous True Buddha.<br/><br/>Zhou Xue held the Reverse Absolute Sword horizontally in front of her, the blade separating her eyes. Her gaze was icy cold as she began to chant rapidly. The Reverse Absolute Sword ignited with a blood-colored flame, and her incantations were profound and incomprehensible. Fang Wang was hearing such language for the first time.<br/><br/>“All of you, die!”<br/><br/>The Unrighteous True Buddha slammed his fists into the ground, bellowing with all his might. Before his voice had even faded, the blood-colored world suddenly collapsed. All things of heaven and earth crashed towards Fang Wang and Zhou Xue. Millions of statues transformed into Golden Buddhas and rushed at them, each raising a palm forward with a formidable momentum.<br/><br/>Fang Wang slightly raised his eyebrows, surprised by the statues’ impressive energy.<br/><br/>“Kill him!”<br/><br/>As Zhou Xue’s voice reached him, Fang Wang immediately swung his sword, and the ghostly deity behind him mimicked the motion to strike as well.<br/><br/>Together in the air, they both swung their swords toward the Unrighteous True Buddha. The blood-colored Sword Qi and the black Ghostly Divine Sword Qi fell at the same time. The former moved faster, leading the way, and the two Sword Qis crossed each other, forming a cross with a length and width of ten thousand miles, a spectacular spectacle.<br/><br/>Boom!<br/><br/>The Sword Qi struck down, shattering the continent. All the rocks surging toward them were crushed by the Sword Qi. The sword light burst forth, swallowing their figures.<br/><br/>It was uncertain how much time had passed when Fang Wang’s vision returned. He heard the sound of churning seawater and opened his eyes to look.<br/><br/>He still hovered in midair, while below him, the sea roared with terrifying waves. A fragmented island on the sea surface could be submerged at any moment, and the Unrighteous True Buddha knelt upon it.<br/><br/>To be precise, this wasn’t an island but what remained of the shattered continent. Looking down from above, the rough sea was dotted with such islands.<br/><br/>Zhou Xue appeared beside him, saying, “Go down.”<br/><br/>After speaking, she was the first to dive down.<br/><br/>Fang Wang followed, keeping pace beside her. “Thank you. Let his soul be given to my sword.”<br/><br/>Zhou Xue calmly replied, “My sword’s main function was to seal him to prevent his escape. It was always meant for you to do the killing. There’s no need for thanks.”<br/><br/>Fang Wang teased, “Your Spiritual Power is so vast, I almost believed your bluff.”<br/><br/>They landed in front of the Unrighteous True Buddha.<br/><br/>By then, the Unrighteous True Buddha’s life force had been severed, his soul absorbed by the Sword Qi of the Zhu Xian Jing Hong Sword, his body now a hollow shell, his flesh beginning to petrify.<br/><br/>He still wore a fierce, angry expression. Until death, he never showed any sign of fear or despair.\t\t\t\t\t\t</div>", "images": {}, "success": true}