{"id": 320, "url": "https://www.novelhall.com/i-became-an-immortal-on-mortal-realm-32879/14864865.html", "title": "Chapter 310 - Chapter 310 Chapter 307: The Nine Palaces Of The Demon Race, Fang Wang’S Prestige", "volume": 4, "volume_title": "Volume 4", "body": "<h1>Chapter 310 - Chapter 310 Chapter 307: The Nine Palaces Of The Demon Race, Fang Wang’S Prestige</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 310 Chapter 307: The Nine Palaces of the Demon Race, Fang Wang’s Prestige<br/><br/>Fang Wang was immersed in the murals of the Great Silence Palace, and gradually, his thoughts were pulled into the Illusionary Realm.<br/><br/>The murals on the walls came to life, with more and more creatures flying out from them, unfolding the stories within the murals before his eyes.<br/><br/>The Demon Race also had its own friendships and feuds, cultural heritages; Fang Wang saw the rise and fall of tribes and dynasties, as well as those heroic Great Demons. The choices they made when facing life-and-death trials also touched Fang Wang.<br/><br/>He didn’t know how much time had passed.<br/><br/>A hand rested on Fang Wang’s shoulder, drawing his consciousness back to reality. The creatures before him vanished instantly, and the moving scenes dissipated as well.<br/><br/>Fang Wang’s eyes regained their clarity. He came back to his senses and turned his head to look at Zhou Xue, asking, “What’s wrong? Is there danger?”<br/><br/>Actually, he could leave the Illusionary Realm at any time, but he was interested in the history depicted on the walls.<br/><br/>Zhou Xue looked ahead and said, “Do you feel that the Demon Race is as flesh and blood as the Human Cultivators, valuing friendship and righteousness, with only their bloodlines being different?”<br/><br/>Fang Wang nodded.<br/><br/>“That is Emperor Extinction’s intention. Never sympathize with the Demon Race. Indeed, there are good demons, but with different positions, your pity and favor might harm you,” Zhou Xue spoke softly with a cold tone.<br/><br/>Fang Wang chuckled, “I naturally understand this principle. I just find it interesting; how could I possibly come to like the Demon Race because of that?”<br/><br/>As they moved forward, Zhou Xue said, “The blood feud between Human Cultivators and the Demon Race cannot be clearly stated; it’s not just in this Mortal Realm, but also in other mortal realms as well as the Upper Realm, where humanity and demons vie for the title of Heavenly Dao’s master. You don’t feel it deeply; once you go to the Upper Realm, you’ll know how strong the Demon Race is. The demons of the Upper Realm are no weaker than humans, and in many cases, even stronger. Many of the Immortal Gods who stand at the top are descended from the Demon Race.”<br/><br/>Hearing this, Fang Wang allowed his imagination to wander about the Upper Realm.<br/><br/>All along their way, the palace corridor seemingly had no end, but with Zhou Xue narrating the enmity between the two races, the journey wasn’t dull.<br/><br/>In the meantime, Fang Wang reminded Zhou Xue to be wary of eavesdropping, but she was confident in herself.<br/><br/>“Back when you overheard my soliloquy, it left a shadow over me. After years of cultivation, my strongest skill is not the sword, nor the sealing spells, but my ability to sense and deduce,” Zhou Xue joked, causing Fang Wang to look away guiltily.<br/><br/>Eavesdropping on a young lady’s room indeed sounds unavoidably unsavory.<br/><br/>Speaking of predictive ability, Fang Wang couldn’t help but mention the fate of Hong Xian’er and the Grand Yu Divine Dynasty, curious if Zhou Xue could deduce it.<br/><br/>Zhou Xue mentioned that the fate of the Grand Yu Divine Dynasty and Hong Xian’er had changed, but to truly transform it, they would have to overcome tribulation; only by breaking through the tribulation could they be reborn.<br/><br/>Half an hour passed.<br/><br/>They finally arrived at the end. The place where they stood was no longer the palace corridor, resembling a realm of its own, and looking sideways, they couldn’t even see the walls; the distance was shrouded in a faint mist.<br/><br/>Zhou Xue stopped walking and said, “Unfortunately, there are demons coming to compete with us for the opportunity.”<br/><br/>Fang Wang spread out his divine consciousness but didn’t capture any Demonic Qi. He asked, “How far away are they?”<br/><br/>“They’ve just approached the Great Silence Palace. Let’s wait for them. Anyone who can find the Great Silence Palace is no simple character.”<br/><br/>Zhou Xue said so and raised her hand to point at the edge, “Those pillars in the mist contain various spells that Human Cultivators can also cultivate. If you’re interested, you can go take a look.”<br/><br/>“Are they profound?”<br/><br/>“Average.”<br/><br/>Hearing Zhou Xue say they were average, Fang Wang became even more interested and disappeared from his spot.<br/><br/>In the blink of an eye.<br/><br/>An hour later, Fang Wang returned to Zhou Xue’s side, sensing the presence of demons. It wouldn’t be long before they arrived.<br/><br/>Zhou Xue turned her head to Fang Wang and asked, “How did it go?”<br/><br/>“I’ve learned ten spells,” Fang Wang replied.<br/><br/>Zhou Xue looked at him skeptically, scanning him up and down, “Why do I feel that you’re not excited?”<br/><br/>Fang Wang smiled and said, “How could that be? I was just savoring the spells we just witnessed.”<br/><br/>What a joke!<br/><br/>With the life experience he had accumulated, what was closing up for eleven hundred years in the Heavenly Palace?<br/><br/>Fang Wang thought to himself as he chose ten different spells. Although there were many more, he felt it was enough.<br/><br/>After all, the legacy of Emperor Extinction awaited him.<br/><br/>“Is this the Dao Palace of Emperor Extinction?”<br/><br/>“The restrictions here are truly profound; the illusions on the walls reveal no flaws.”<br/><br/>“Don’t get too excited so soon. Throughout history, numerous Demon Kings and Demon Emperors have come here, and in the past ten thousand years, not a single demon has obtained the legacy of Emperor Extinction.”<br/><br/>“The fate of heaven and earth is surging, times have changed, the present is not like the past, and among us, there must be one who can inherit it.”<br/><br/>Laughter echoed around, full of mutually flattering intentions.<br/><br/>As Fang Wang and Zhou Xue turned around, they saw four figures emerging from the distant mist, appearing to be three men and one woman, each retaining some demon race characteristics such as beast ears, wings, and horns.<br/><br/>Quickly, the four demons also spotted Fang Wang and Zhou Xue, and their laughter stopped abruptly as four streams of killing intent locked onto them.<br/><br/>Fang Wang snorted coldly, and a tyrannical aura burst forth, startling the Great Silence Palace and causing the ground to tremble, which made the four demons hurriedly retract their killing intent.<br/><br/>A male demon in black armor with wings quickly clasped his fists and said, “I apologize, we did not mean to offend.”<br/><br/>Fang Wang did not believe a word of their excuse; had he not been strong enough, his fate would have been quite dismal.<br/><br/>Zhou Xue asked, “What are your names, and which Demon Palace from the bottom of the sea do you come from?”<br/><br/>The black-armored male quickly introduced himself, “My name is Ying Cang Hai, from the ninth Demon Palace of the Sea of Void, and they are…”<br/><br/>He introduced the three demons beside him one by one.<br/><br/>From the first Demon Palace, Ming Hai Lin.<br/><br/>From the third Demon Palace, Chen Yao.<br/><br/>From the sixth Demon Palace, Shen Jiu Jiao.<br/><br/>Zhou Xue’s voice carried a smile that was not quite a smile, “So you are all the talents from the nine palaces of the Sea of Void’s Demon Race. Since we have met by fate, let’s go to the inheritance assessment together.”<br/><br/>Upon hearing this, the four demons looked at one another, surprised by Zhou Xue’s easygoing response.<br/><br/>They suppressed the caution in their hearts and managed to show a forced smile.<br/><br/>Ying Cang Hai asked curiously, “Could it be that you understand the assessment for Emperor Extinction’s legacy?”<br/><br/>Fang Wang also glanced at Zhou Xue, not understanding why she wanted to take the assessment together with them.<br/><br/>Zhou Xue nodded with a smile and said, “To tell the truth, I’ve been here before and have some understanding. Emperor Extinction’s legacy is not intended for one person alone, nor is it exclusive; all of us have a chance at it, so why bother fighting so bitterly here?”<br/><br/>At her words, the smiles on the four demons’ faces grew richer, and their gazes towards Zhou Xue softened.<br/><br/>The sole female demon, Chen Yao, laughed and said, “Sister is right; we’re all seekers of the way, so why delay here.”<br/><br/>Ming Hai Lin, watching Fang Wang, asked, “May I know both of your names?”<br/><br/>Zhou Xue answered, “My name is Zhou Xue, not well-known. He is called Fang Wang, known as Tian Dao. Have you heard of him?”<br/><br/>Tian Dao Fang Wang?<br/><br/>The four demons’ expressions changed drastically as they retreated in unison, keeping their distance from Fang Wang.\t\t\t\t\t\t</div>", "images": {}, "success": true}