{"id": 323, "url": "https://www.novelhall.com/i-became-an-immortal-on-mortal-realm-32879/14864869.html", "title": "Chapter 313 - Chapter 313 Chapter 310 Unimaginable Talent_1", "volume": 4, "volume_title": "Volume 4", "body": "<h1>Chapter 313 - Chapter 313 Chapter 310 Unimaginable Talent_1</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 313 Chapter 310 Unimaginable Talent_1<br/><br/>Just as Fang Wang was lost in a whirlwind of thoughts, Ying Cang Hai, who was in the distance, stirred.<br/><br/>Fang Wang and Zhou Xue looked up at him, only to see Ying Cang Hai’s body trembling, his head shaking incessantly.<br/><br/>“It seems he still needs time to adapt,” Zhou Xue said softly.<br/><br/>Fang Wang raised an eyebrow, then asked using the Sound Transmission Technique, “Right, you said that Emperor Extinction was ranked among the immortals, so why does he need to be resurrected?”<br/><br/>“The Red Dust Celestial Emperor was once a Heaven Emperor, so why has he met such a fate?” Zhou Xue asked in return via the Sound Transmission Technique.<br/><br/>Alright then!<br/><br/>That made sense!<br/><br/>Fang Wang thought the Celestial Court of the Upper Realm was truly complicated.<br/><br/>“The power struggles in the Upper Realm are far more terrifying than in the Mortal Realm because if they lose, it is an endless calamity with no hope of revival. Even the strongest Heaven Emperor in the Immortal Court could be pulled down from the throne and plunged into an eternal curse of torment,” Zhou Xue continued with a sigh, speaking through the Sound Transmission Technique.<br/><br/>Fang Wang also remembered what Zhou Xue had said before, that the powerful beings and geniuses she recruited all had their own regrets and hatreds; it seemed that Emperor Extinction had his too.<br/><br/>“Right, those four demons from earlier are not simple in terms of talent. You deliberately waited for them, could it be that you have a grudge from a previous life? If it was just about finding a vessel, you would have prepared one before coming here,” Fang Wang continued to ask, still using the Sound Transmission Technique.<br/><br/>“Yes, they are not only the top talents of the demon race from the Sea of Void, but they are also among the best in the entire Eastern Mortal Realm. They have talents that rival even Hong Xian’er, except they lack the Emperor’s Fate Mandate. In a previous life, they ravaged the mortal world, preying on the human race, so your killing them could be considered ridding the humans of a scourge. I foresaw that they were about to head to the Great Silence Palace, which is why I brought you here in advance,” she answered.<br/><br/>“In their previous life, those four demons were exterminated by the Nine Lives Precious Spirit of the Western Mortal Realm. That battle brought the Nine Lives Precious Spirit fame throughout the world and won the admiration of all in the Eastern Mortal Realm, making him the truly first genius of the Mortal Realm,” Zhou Xue said with a certain implication in her tone when she mentioned the Nine Lives Precious Spirit.<br/><br/>Fang Wang had heard Zhou Xue praise the genius of the Nine Lives Precious Spirit more than once.<br/><br/>He didn’t believe it; was he now inferior to that person?<br/><br/>Yet, intuition told him that Zhou Xue might be deliberately using that person to provoke him, and he couldn’t fall for it.<br/><br/>The two of them chatted intermittently using the Sound Transmission Technique.<br/><br/>After a long while.<br/><br/>Ying Cang Hai finally regained his composure, as Fang Wang and Zhou Xue’s gazes turned to him, waiting for him to open his eyes.<br/><br/>Suddenly!<br/><br/>Ying Cang Hai opened his eyes and abruptly leapt forward, charging towards Fang Wang and Zhou Xue. A gust of wind blew Fang Wang’s black hair, and with a single step forward, he positioned himself in front of Zhou Xue and threw a punch.<br/><br/>Bang!<br/><br/>Their fists collided, unleashing a terrifying shockwave that swept across the palace, causing Fang Wang’s white clothes to billow violently, almost to the point of tearing.<br/><br/>Fang Wang narrowed his eyes, thinking, “Such strong power!”<br/><br/>Ying Cang Hai’s cold eyes also showed a hint of surprise as he spoke admiringly, “Your physique is the most potential-laden I have ever seen. Even though my vessel is of a higher realm than yours and belongs to the demon race, bolstered by my fist technique, it still couldn’t shake you.”<br/><br/>Fang Wang looked at him and humbly said, “Senior’s punching power is indeed formidable, incomparable to any Mortal Realm fist techniques.”<br/><br/>Both sides withdrew their fists, and the tense atmosphere instantly relaxed.<br/><br/>Ying Cang Hai, also known as Emperor Extinction, turned to Zhou Xue and said, “Junior, reviving me requires more than just a vessel—I’m sure you are prepared. After bringing me back, what do you need me to do?”<br/><br/>Zhou Xue met his gaze squarely and replied, “I have founded the Jin Xiao Sect, and we will ascend together in the future. I will resurrect many emperors and Great Saints who have enmity with the Immortal Court. In the Mortal Realm, you will act on my behalf seven times. When the time comes for our ascent, if Jin Xiao Sect is fully prepared, I will attack the Immortal Court, and then you will have the chance to rescue your daughter.”<br/><br/>At her words, Fang Wang distinctly felt a murderous intent targeting Zhou Xue, coming from Emperor Extinction.<br/><br/>Emperor Extinction stared intently at Zhou Xue and asked, “Who exactly are you?”<br/><br/>“The Immortal Court has existed for countless eons, and there are more than just you who harbor enmity towards it. As for my identity, I mustn’t reveal it for now, as it would bring about even greater karma, detrimental to both you and me,” Zhou Xue said calmly.<br/><br/>She really knew how to act!<br/><br/>Fang Wang was very pleased with Zhou Xue’s performance; she had a bit of his flair.<br/><br/>Emperor Extinction stared intently at Zhou Xue, but her expression did not change.<br/><br/>The palace fell into silence.<br/><br/>About the time it took to brew half a pot of tea later, Emperor Extinction closed his eyes, took a deep breath, and then opened his eyes. He said solemnly, “Since that’s the case, let’s begin the inheritance. I have two inheritances in my possession, one is the most powerful body cultivation technique I have, and the other is one of my most precious treasures. Make your choice.”<br/><br/>Zhou Xue looked towards Fang Wang.<br/><br/>Fang Wang pondered and said, “I want the body cultivation technique.”<br/><br/>Although his physical body was already terrifying, he would never disdain becoming even stronger.<br/><br/>There is no limit to strength!<br/><br/>Zhou Xue nodded and said, “Then pass the technique to him first.”<br/><br/>Emperor Extinction raised his right hand, and with a gesture, the pillars in all directions trembled violently. Characters made of light flew out from the pillars and rapidly surged towards Fang Wang.<br/><br/>Fang Wang did not resist; the characters made of light shrank quickly and entered his forehead, and he then closed his eyes.<br/><br/>Emperor Extinction turned to Zhou Xue and asked, “Which ancient powerful figure is this lad a reincarnation of?”<br/><br/>Zhou Xue’s lips curled into a smile as she answered, “He is not a reincarnation. He is a prodigy that I discovered, and he even saved me before. Isn’t that incredible?”<br/><br/>Emperor Extinction nodded and said, “Indeed it is very incredible. That punch earlier, I did not hold back, and even though this body is weak, my realm is higher than his. How many more geniuses like him does the Jin Xiao Sect have?”<br/><br/>“How could there be so many? His talent is the strongest.”<br/><br/>“How many Great Saints and Great Emperors have you revived so far?”<br/><br/>“Including you, a total of four. I’m only a little over three hundred years old this lifetime, I still need time.”<br/><br/>“It seems, then, that your talents in this life are not lacking either.”<br/><br/>“It’s just an accumulation of opportunities,” Zhou Xue replied.<br/><br/>Zhou Xue conversed with Emperor Extinction, who was quite interested in the Jin Xiao Sect. Zhou Xue did not hide anything and simply introduced the situation of the Jin Xiao Sect.<br/><br/>After she finished, Emperor Extinction remarked with emotion, “You have great ambition, and your development direction is very similar to the structure of the Immortal Gods in the Immortal Court. You must have really stayed in the Immortal Court, and even the Red Dust Celestial Emperor trusts you. Your identity is unimaginable; perhaps you are the senior.”<br/><br/>Zhou Xue laughed and said, “The Red Dust Celestial Emperor’s choice wasn’t me, but Fang Wang.”<br/><br/>Emperor Extinction laughed and asked, “What is your relationship with him? You seem to trust him immensely and he does the same. Earlier, when he exchanged blows with me, it was his instinct to protect you.”<br/><br/>After a moment of silence, Zhou Xue said, “It’s just a marriage contract.”<br/><br/>Upon hearing this, Emperor Extinction could not help but burst into laughter.<br/><br/>Just at this moment.<br/><br/>Emperor Extinction turned to look at Fang Wang, who was beside him. During their conversation, all the characters of light had already merged into Fang Wang’s forehead, and he had been in a state of enlightenment for quite a while.<br/><br/>Fang Wang slowly opened his eyes, his gaze profound.<br/><br/>Zhou Xue looked at him, her eyes filled with a different light.<br/><br/>Emperor Extinction said, “If it’s difficult to comprehend, there’s no need to rush. After all, your realm is not high enough. Mastering it will require time to settle.”\t\t\t\t\t\t</div>", "images": {}, "success": true}