{"id": 329, "url": "https://www.novelhall.com/i-became-an-immortal-on-mortal-realm-32879/14874278.html", "title": "Chapter 319 - Chapter 319 Chapter 316: Limit, One Sword", "volume": 4, "volume_title": "Volume 4", "body": "<h1>Chapter 319 - Chapter 319 Chapter 316: Limit, One Sword</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 319 Chapter 316: Limit, One Sword<br/><br/>“It seems the Nine Extremes Blood Sacrifice Technique of Great Perfection has its own profound mysteries,”<br/><br/>Fang Wang looked up at the Sword Immortal performing the blood sacrifice ritual on himself and thought so.<br/><br/>He discovered that not only could he see the limits of the Sword Immortal, but he could also forcibly undo the opponent’s Nine Extremes Blood Sacrifice Technique, meaning he could revert an opponent, who’d reached their limit, back to their original state, though their lifespan wouldn’t return and death would still come as it should.<br/><br/>The Nine Extremes Blood Sacrifice Technique of Great Perfection could, in essence, suppress anyone who mastered the Nine Extremes Blood Sacrifice Technique, unless the opponent also reached the Great Perfection Realm.<br/><br/>Such a suicidal secret technique, it was estimated that no one would study it to the extreme.<br/><br/>As Fang Wang thought, he soared into the sky.<br/><br/>He raised his right hand, and the Rainbow Sword materialized in his grasp. Under the watchful eyes of the martial arts cultivators of Sword Heaven Marsh, he flew towards the golden layer of light in the sky.<br/><br/>Yang Du stared intently at the Sword Immortal and murmured, “This is no joking matter…”<br/><br/>He couldn’t understand how the Sword Immortal could have improved his cultivation so rapidly?<br/><br/>It went against all reason!<br/><br/>It was as if a mortal suddenly possessed the power to destroy heavens and earth, completely disregarding the rules of cultivation!<br/><br/>Hong Chen stood by the lakeside, his gaze sharpening, as he muttered to himself, “Nine Extremes Blood Sacrifice… Xuan You Great Teaching…”<br/><br/>Fang Wang passed through the golden light layer and arrived at the same height as the Sword Immortal.<br/><br/>The two exchanged glances, and the Sword Immortal’s face, twisted and vicious, had eyes filled with bloodshot madness as he looked at Fang Wang.<br/><br/>Fang Wang did not understand why he had performed the Nine Extremes Blood Sacrifice Technique, nor where he had learned it from, but since he had come, he must die.<br/><br/>Fang Wang lifted the Rainbow Sword and a ghostly figure formed out of nowhere behind him, not massive, standing only thirty feet tall, with a form identical to his own.<br/><br/>He silently activated the Extinction Divine Force.<br/><br/>This would be his first time unleashing the Extinction Divine Force!<br/><br/>He wanted to see how much the Extinction Divine Force could enhance his ultimate skills.<br/><br/>As the Extinction Divine Force surged, Fang Wang’s white clothes fluttered. The Rainbow Sword in his hand emitted a blinding sword light, while the ghostly figure’s sword also burst with a dark glow, causing the surrounding space to violently fluctuate.<br/><br/>“Aaahhh—”<br/><br/>The Sword Immortal suddenly let out a piercing scream, and from within the vast blood-colored Sword Qi, a silhouette that looked identical to him emerged from his body.<br/><br/>Fang Wang narrowed his eyes, quietly amazed.<br/><br/>For some reason, upon seeing the silhouette next to the Sword Immortal, Fang Wang felt an inexplicable palpitation, as if he had encountered a natural enemy. It was an eerie feeling, one he had never experienced before.<br/><br/>As soon as he saw the silhouette, he felt a strong urge to destroy it.<br/><br/>The Sword Immortal looked down, panting heavily with his face covered in blood and sweat. His gaze at Fang Wang was like that of a cornered wild beast, fierce and indifferent.<br/><br/>His momentum was nearly reaching its limit, and every living being in the Descending Dragon Great Saint could sense it, filling them with terror.<br/><br/>Even the cultivators within Sword Heaven Marsh, despite the separation by formations, could feel the Sword Immortal’s presence. At this moment, none dared to make a noise, all holding their breath and looking up at the Sword Immortal with rapt attention.<br/><br/>Fang Bai’s complexion was extremely ugly, his Dao heart nearly collapsing.<br/><br/>How could the Sword Immortal have become so strong?<br/><br/>He simply could not understand…<br/><br/>At this moment, the Sword Immortal felt an unprecedented power. He was intoxicated by this might, feeling as if he were invincible.<br/><br/>He looked up at Fang Wang, his mouth curving into a smile, his white hair dancing wildly like raging flames. He spoke, “Fang Wang, I finally have the opportunity to fight you. I’ve sought you out, not out of hatred, but purely to prove who between us is stronger.”<br/><br/>Fang Wang looked at him and said, “Are you certain? Who imparted this technique to you? Are you sure they simply wanted to help you achieve your goal, or are you merely a pawn in their game, a piece they are moving forward and aiding?”<br/><br/>Upon hearing this, the Sword Immortal laughed, “Perhaps you guessed right. There are no selfless favors in this world. It won’t hurt to tell you; a Great Saint by the name of Sword You passed this secret technique to me. If you manage to survive, you can fight him.”<br/><br/>“Even if I am but a pawn, it doesn’t matter. At the very least, he allowed me to experience the ultimate sword in the world. The only way I can repay him is by fighting you.”<br/><br/>Fang Wang, expressionless, said, “Since you are aware, then you can’t have been deceived. Come then, let me see your limit.”<br/><br/>The Sword Immortal raised his right hand, and a long sword condensed in the palm of his hand. The mysterious shadow beside him did the same. At first glance, it appeared similar to Fang Wang, having one shadow, the only difference being one in black and one in white.<br/><br/>The shadow then merged into the Sword Immortal’s body, and in an instant, his aura exploded violently, dispersing the bloody Sword Qi surrounding him, and a domineering and unparalleled Sword Intent enveloped heaven and earth.<br/><br/>The golden layer of light below rippled, akin to a lake’s surface during rain, yet boundless and spectacular to the extreme.<br/><br/>The Sword Immortal lifted the sword in his right hand, and the vast Sword Intent gathered upon it.<br/><br/>“This sword, is named Eternal Sword!”<br/><br/>With those words, the Sword Immortal leaped, swinging his sword in a fluid motion, a slash that rendered all colors of the world dull in its wake.<br/><br/>In that moment, everything halted, save for the expanding sword light which threatened to engulf Fang Wang.<br/><br/>Fang Wang’s eyes sharpened as he raised his sword to strike.<br/><br/>And so did the specter!<br/><br/>Extinction Divine Force fused with the Sword Qi, slicing out alongside the specter’s Sword Blade; this strike unleashed thousands of black Sword Qi.<br/><br/>All that remained in the world were shades of black and white. The Sword Immortal, sensing Fang Wang’s Sword Qi, couldn’t help but widen his eyes.<br/><br/>“How is this possible…”<br/><br/>The Sword Immortal’s ferocious face drowned in the sword light as the two terrifying Sword Qi collided, shaking heaven and earth, rendering ninety percent of the beings in Grand Qi deaf in an instant, blinding them as well.<br/><br/>The dazzling sword light was visible to the creatures in all surrounding seas.<br/><br/>At the Southern Celestial Sea, on an island, Fang Hanyu walked midway up a mountain. Turning around, he saw the sword light stretching his shadow long, squinting his eyes involuntarily.<br/><br/>“Such a terrifying Sword Intent… Who could be fighting?”<br/><br/>Fang Hanyu was secretly shocked; wasn’t that direction the way to the Descending Dragon Continent?<br/><br/>He was not panicked; the Descending Dragon Continent of today was nothing like the past.<br/><br/>Encountering such Sword Intent now, his sense of urgency grew stronger. In recent decades, he had met more and more powerful beings. Despite his rapidly advancing cultivation, he felt that there were more people stronger than him, and he knew this was not an illusion, but that a world-shaking era had brought forth many strong individuals.<br/><br/>Though Fang Hanyu dared not compare himself to Fang Wang, he didn’t wish to fall too far behind him.<br/><br/>After all, they were a trio; he didn’t want to be left behind!<br/><br/>For a long time, the vast sword light enveloped Sword Heaven Marsh, and how much time had passed before the colors of heaven and earth were restored was unknown.<br/><br/>There, the figures of Fang Wang and the Sword Immortal revealed themselves. At that moment, Fang Wang still maintained the posture of wielding his sword for a slash, and so did the Sword Immortal, who was above, with Fang Wang below.<br/><br/>“I didn’t expect… my… limit… couldn’t withstand even one of your swords…”<br/><br/>The Sword Immortal trembled all over, speaking with difficulty and a breathless voice, the sharpness in his eyes fading, and his pupils becoming blurred.<br/><br/>His body was full of cracks, with flecks of sword light seeping out, as if he might shatter at any moment, with his vitality rapidly escaping.<br/><br/>Fang Wang looked at the Sword Immortal, his eyebrows slightly raising. In that moment, the Treasured Spirit Space within him revealed the Heavenly Palace.\t\t\t\t\t\t</div>", "images": {}, "success": true}