{"id": 328, "url": "https://www.novelhall.com/i-became-an-immortal-on-mortal-realm-32879/14872782.html", "title": "Chapter 318 - Chapter 318 Chapter 315: The So-Called Number One In The World", "volume": 4, "volume_title": "Volume 4", "body": "<h1>Chapter 318 - Chapter 318 Chapter 315: The So-Called Number One In The World</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 318 Chapter 315: The So-Called Number One in the World<br/><br/>My name is Xu Yan, and I was born in a village in the Grand Wei Dynasty.<br/><br/>Since childhood, I’ve been emotionally indifferent, unconcerned about everything around me.<br/><br/>In my seventh year, an injured Cultivator stormed into my village, slaughtering indiscriminately, with no one to stop him. I was hidden by my parents in a cellar and escaped that calamity—or at least that’s what I thought.<br/><br/>The Cultivator claimed to be from Heaven’s Larceny Saint Sect. He extracted the souls of all the villagers, including my parents and siblings. Afterwards, he took me under his wing and taught me swordsmanship.<br/><br/>The tragic death of my family stirred the still waters of my heart for the first time. I hated someone for the first time, I was angry for the first time.<br/><br/>Since I grasped a sword at the age of seven, I felt a connection with the Sword Dao. Whenever I swung my sword, I could see a figure ahead of me copying my movements. At first, he followed my swordplay, but after I finished a set of moves, he started to outpace me, and gradually, he began leading me in practice.<br/><br/>Later, I learned that I was the only one who could see that figure. The Cultivator from Heaven’s Larceny Saint Sect thought I was developing a demonic obstruction from hatred and was greatly disappointed in me.<br/><br/>For the following ten years, I followed him around, witnessing his reckless deeds. Gradually, three companions joined my side, sharing similar fates. I couldn’t understand why the Cultivator taught us, but for the sake of revenge, I could only endure.<br/><br/>His realm was the Cross-Void Realm, a realm nearly godlike, and I had no idea how long it would take to catch up to him.<br/><br/>After ten years, he suddenly departed, and at last my three companions and I gained our freedom. We fled as far as possible, joining forces with the Cultivators from Protecting Heaven Sect to hunt down those from Heaven’s Larceny Saint Sect, trying to vent our hatred.<br/><br/>But Heaven’s Larceny Saint Sect was too powerful. The Cultivators from Protecting Heaven Sect saw no hope, and the mood in our group turned increasingly gloomy.<br/><br/>Until one day, I heard the name Tian Dao Fang Wang. I heard he was fiercely hunting the Demonic Cultivators of Heaven’s Larceny Saint Sect. My companions were elated, and through them, I learned that Fang Wang was the most talented person in the world.<br/><br/>At that time, I wondered, can a genius really turn the tide of the world?<br/><br/>Fang Wang was much younger than my vengeful mentor.<br/><br/>Afterward, we encountered fewer and fewer Demonic Cultivators from Heaven’s Larceny Saint Sect, and only then did I start to feel the influence of the world’s most talented.<br/><br/>Although I had yet to meet him, I could already sense his strength.<br/><br/>One day, heaven and earth trembled, making us, who were on the road, extremely anxious. I witnessed a scene I would never forget: two figures, like Heavenly Gods, battling in the sky. Wherever they went, mountains crumbled and forests were uprooted.<br/><br/>Those two figures even manifested giant forms, one ethereal, the other as if a true body, while my companions and I, like ants on the ground, looked up at their might.<br/><br/>When they drifted away, everything I could see had turned to ruins.<br/><br/>Such power should be capable of revenge, right?<br/><br/>It wasn’t until later that I learned those two figures were Tian Dao Fang Wang and Thousand Eyes Great Saint.<br/><br/>The Great Saint, a mythic figure who was said to contend with the Immortal Gods of the heavens, had actually been resurrected to aid Heaven’s Larceny Saint Sect. This blurred the lines between good and evil for me. However, the strength of Tian Dao Fang Wang showed me that only the powerful could claim the role of savior.<br/><br/>After Thousand Eyes Great Saint was vanquished and Heaven’s Larceny Saint Sect disbanded, I thought my vengeful mentor had also died, and from then on, my three companions and I could start a new life.<br/><br/>Lin Ya was the only girl among the four of us. I always saw her as a sister, but one day, she told me she liked me and wanted to marry me. Having only known hatred in my heart since childhood, I didn’t know what love was. To start a new life, I agreed to her proposal.<br/><br/>We married in the deep mountains, with only those two brothers who had shared our fates as guests.<br/><br/>That night was beautiful, and I finally understood what happiness was.<br/><br/>The next day, when I woke up, I found myself with a heavy head and felt extremely unwell. I stumbled out of bed and walked out the door, and just as I was about to call out, I saw three corpses in the courtyard.<br/><br/>My wife and my two brothers.<br/><br/>I felt as if the sky had collapsed, until I saw a figure standing on the opposite wall. The rage that had been suppressed for half my life erupted completely. I screamed, conjuring my Lifespirit Treasure, and then I desperately took up my sword and charged.<br/><br/>But, being only of the Spirit Elixir Realm, I was no match for him.<br/><br/>In the end, I fell. My master grabbed my hair and whispered in my ear the torment he had inflicted on Lin Ya and my two brothers.<br/><br/>I had never felt so powerless before, and I finally understood that I was not the chosen one in the stories, I was not Fang Wang, but rather a common soul struggling in the sea of suffering.<br/><br/>My master told me that he took us in because he wanted to choose the most talented among us for a soul-snatching process, and since I had the highest cultivation, I survived until the end.<br/><br/>In desperation, I faced the fate of being soul-snatched.<br/><br/>However.<br/><br/>I didn’t die.<br/><br/>Amidst my master’s agonized howls, I awakened my second Lifespirit Treasure. It turned out that the figure I saw every time I practiced my swordsmanship was my Lifespirit Treasure. Unlike the one I was aware of, this one didn’t require shaping; it was a treasure born with me.<br/><br/>My master failed to snatch my soul and fell before me, whereas I took hold of the power of this Lifespirit Treasure for the first time.<br/><br/>From then on, if I witnessed a swordsmanship technique once, I could master it. Others thought I had an extraordinary insight into the Sword Dao, but they didn’t know that while they had only performed it once for me, my Lifespirit Treasure replayed it countless times before my eyes. This feeling was marvelous, as if I gained memories out of thin air.<br/><br/>Later, I entered the Profound Heart Realm, and in my dreams, I received the inheritance of a Great Saint.<br/><br/>He called himself Sword You, drawn to me by my Lifespirit Treasure and willing to bestow his Sword Dao upon me, believing I would become a Sword Immortal.<br/><br/>I accepted, and I began to become invincible.<br/><br/>Even those with two realms higher cultivation couldn’t withstand my strongest sword attack.<br/><br/>Later on, I found Fang Bai, the disciple of Fang Wang, who was considered by Fang Wang to be a prodigy in Sword Dao. Unfortunately, this supposed prodigy could not withstand a single strike from my sword either.<br/><br/>The swordsmanship genius who even Fang Wang admired proved to be so easily defeated that my impression of Fang Wang diminished greatly.<br/><br/>Afterward, I set challenging Fang Wang as my goal and continued to cultivate. My cultivation had to be at least two major realms lower than Fang Wang’s before I could challenge him.<br/><br/>Years later, I finally broke through to the Mahayana Realm, and I felt I was qualified to challenge Fang Wang.<br/><br/>However, my Great Saint master Sword You communicated with me in a dream; he said I could never catch up to Fang Wang, who had even slain beings from the half-step Universe Realm.<br/><br/>I didn’t know how mighty the Universe Realm was, but I realized that it seemed I couldn’t catch up to Fang Wang no matter how hard I tried.<br/><br/>Master told me he had a method that could take me directly to the ultimate limit of my life. Fang Wang would ascend sooner or later, leaving me with not much time. If I waited any longer, Fang Wang would ascend, and then it would be difficult for me to challenge him.<br/><br/>I don’t know when it started, but Fang Wang became an obsession in my heart. I couldn’t tell why I wanted to chase after him, but after my wife and brothers died, chasing Fang Wang had become the only reason I lived.<br/><br/>If I could reach that goal directly, why live any longer?<br/><br/>This mortal world is terrible, and I don’t want to come back again.<br/><br/>So, I accepted the last inheritance from my master.<br/><br/>Boom—<br/><br/>The Sword Immortal’s blood-red Sword Qi was more than a hundred zhang in diameter, even opening a huge vortex in the Sea of Thunderclouds. His black hair swiftly turned white, his face veined with bulging blood vessels, looking fierce beyond belief.<br/><br/>Unimaginable pain tormented him, but he felt as if he was about to be set free.<br/><br/>He looked down at Fang Wang still standing at the bridgehead below, his eyes brimming with the will to fight.<br/><br/>Fang Wang, I shall not disappoint you!<br/><br/>I am indeed the greatest Sword Dao genius in the world; I was born a Sword Immortal!\t\t\t\t\t\t</div>", "images": {}, "success": true}