{"id": 327, "url": "https://www.novelhall.com/i-became-an-immortal-on-mortal-realm-32879/14872781.html", "title": "Chapter 317 - Chapter 317 Chapter 314: Sword Immortal Attacks, Resolute In Facing Death", "volume": 4, "volume_title": "Volume 4", "body": "<h1>Chapter 317 - Chapter 317 Chapter 314: Sword Immortal Attacks, Resolute In Facing Death</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 317 Chapter 314: Sword Immortal Attacks, Resolute in Facing Death<br/><br/>“Who?”<br/><br/>Fang Wang did not turn his head when he asked, and although he momentarily couldn’t feel those invisible power struggles, he believed Hong Chen wouldn’t speak recklessly.<br/><br/>Hong Chen answered, “It’s a cultivator named Daoist Master Chunqiu. He wanders the Mortal Realm, predicting fortunes for the Holy Clans and Imperial Clans. He has tried to calculate against you several times; within Sword Heaven Marsh, there’s a disciple named Lü Xianming who has also received guidance from him. Daoist Master Chunqiu has always hinted that he should see you as an enemy, but fortunately, he trusts you enough not to wish to oppose you.”<br/><br/>Upon hearing this, Fang Wang smiled and said, “This disciple called Lü Xianming has quite good awareness. In the future, he can be trained as a key figure.”<br/><br/>“The main point is this Daoist Master Chunqiu. Although I have retaliated against him, I cannot trace his whereabouts. He is still plotting against you, and he will become a major problem in the future,” Hong Chen said seriously.<br/><br/>Fang Wang turned his head and asked, “Then what can you do?”<br/><br/>Hong Chen shook her head.<br/><br/>Fang Wang laughed, “If that’s the case, then forget about him. You defend against his divination curses, and I’ll focus on my cultivation. When he shows his face someday, I’ll slap him dead with one palm.”<br/><br/>Hong Chen smiled and said, “That’s exactly what I was thinking. Although your strength has been continually increasing, your cultivation level is somewhat lagging. I’m worried that you might get too immersed in your innate talent and perception, neglecting the most important cultivation.”<br/><br/>Fang Wang turned back and said, “Don’t worry, I won’t. Unless an opportunity falls into my lap, I’m actually quite afraid of acquiring secret techniques.”<br/><br/>Hong Chen didn’t quite understand what he meant, but she roughly guessed his intentions, smiled, nodded, then cupped her fists in salute and turned to leave.<br/><br/>Fang Wang closed his eyes and continued to cultivate.<br/><br/>As he closed his eyes, time began to fly by.<br/><br/>After Zhu Rulai joined Wangdao with tens of thousands of Buddhist Sect disciples and established a new Buddhist Sect, Wangdao’s reputation skyrocketed. Just the power of the Buddhist Sect alone was enough to make Wangdao the strongest force in both the Descending Dragon Continent and the surrounding seas. The soon-to-be-established Sword Sect thus attracted even more attention.<br/><br/>As more and more people wanted to participate in the Sword Sect selection, Dugu Wenhun approached Fang Wang and suggested postponing the selection day, so as to give more people a chance.<br/><br/>Naturally, Fang Wang had no objections since he could reach the Grand Yu Divine Dynasty through the Kunlun Formation at any moment if danger arose.<br/><br/>After Fang Wang made the decision, Wangdao spread the news that not only was the Sword Sect selection day postponed, but the threshold was also raised, which attracted many more high-level great cultivators.<br/><br/>Time flew by.<br/><br/>In the blink of an eye, ten years had passed.<br/><br/>Fang Wang’s cultivation had reached the fourth level of the Heaven-Breaking Realm. He was still meditating at the bridgehead, striving for a higher cultivation level.<br/><br/>Sword Heaven Marsh had become unusually lively, resulting in overfilling crowds in cities within three thousand miles.<br/><br/>Dugu Wenhun commanded that no outsiders were allowed into Kunlun, and Zhu Rulai’s Buddhist Sect was tasked with the defense.<br/><br/>As the future sanctuary of Wangdao, it could not allow people to enter during the grand event of the Sword Sect selection—even if Kunlun was not yet finished, the prestige had to be established in advance.<br/><br/>One day, a discordant voice resounded throughout Sword Heaven Marsh.<br/><br/>“Tian Dao Fang Wang, where are you? I, in the name of a Sword Immortal, have come to challenge you!”<br/><br/>A voice full of arrogance rang out, startling countless cultivators within Sword Heaven Marsh to look up, only to see a figure descending from the sky.<br/><br/>He was dressed in white, standing tall and handsome, with a long sword in hand—the man standing proudly in the sky truly looked like a Sword Immortal descended from heaven, unparalleled in the world.<br/><br/>Countless gazes and senses fell upon him, yet he remained indifferent. His eyes were fixed on a place in Sword Heaven Marsh surrounded by dense fog; he had heard that the place where Tian Dao cultivated was covered in Ling Wu.<br/><br/>“How presumptuous! What do you take yourself for? Daring to challenge our Dao Master!”<br/><br/>A thunderous shout burst forth, and Yang Du appeared out of nowhere in front of the Sword Immortal.<br/><br/>Yang Du was dressed in a black robe with a sash, fluttering in the breeze as he haughtily stared at the Sword Immortal, his eyes glinting dangerously.<br/><br/>Before the Sword Immortal could respond, one figure after another appeared in succession, surrounding him.<br/><br/>The Three Immortals of the Emperor Sea, Dugu Wenhun, Zhu Yan, Zhu Rulai, Fang Bai, and several Sword Servants with profound realms all watched the Sword Immortal with fierce determination.<br/><br/>Fang Bai fixed his gaze intently on the Sword Immortal, unable to forget the experience of being defeated by a single strike of the Sword Immortal’s blade.<br/><br/>Surrounded, the Sword Immortal remained unperturbed, emitting his own Sword Intent. A fierce Sword Qi soared into the sky, dispersing the sea of clouds, shaking heaven and earth.<br/><br/>The cultivators of Sword Heaven Marsh looked up, and the majority were visibly moved by the sight.<br/><br/>By a lakeside, Xu Qiuming stood alone, still donning his bamboo hat. He slightly raised his head, eyes looking towards the sky, a hint of surprise flickering in his eyes.<br/><br/>He had crossed swords with the Sword Immortal as well, and over the years, he had greatly improved. However, he had not expected the Sword Immortal’s progress to be so immense.<br/><br/>“Stand down.”<br/><br/>A detached voice sounded, causing Yang Du and others to be emotional, for the owner of the voice was Fang Wang.<br/><br/>Dugu Wenhun looked deeply at the Sword Immortal and said, “Let’s go.”<br/><br/>The others naturally did not dare object. They all retreated, not choosing to land, but instead moving to a distant part of the sky to continue watching the Sword Immortal.<br/><br/>The Sword Immortal’s gaze remained fixed in one direction, and under his scrutiny, the dense fog began to disperse.<br/><br/>Not only he, but many cultivators also looked in Fang Wang’s direction, watching the bridgehead appear.<br/><br/>Seated in meditation on the bridgehead, Fang Wang slowly opened his eyes, following that with an elongated stretch.<br/><br/>“Use your secret technique. Since you’ve already resolved to die, why hesitate?”<br/><br/>Fang Wang’s voice rang out once more, stirring the Sword Immortal.<br/><br/>Even though the Great Perfection’s Nine Extremes Blood Sacrifice Technique was as much a death sentence as when first learned, Fang Wang could sense the technique’s aura and discern its true meaning.<br/><br/>He could even see the limits of others who possessed the Nine Extremes Blood Sacrifice Technique.<br/><br/>Once the Sword Immortal deployed the Nine Extremes Blood Sacrifice Technique, his strength would reach another level, perhaps even stronger than the Unrighteous True Buddha!<br/><br/>Seeing the Sword Immortal’s limit, Fang Wang harbored an expectation.<br/><br/>The Sword Immortal took in a deep breath, his eyes turning sharp, and said, “Very well! As you wish!”<br/><br/>Boom!<br/><br/>The Sword Immortal’s Sword Qi surged, quickly turning blood red. The skin he revealed bulged with veins, including his face, and his pupils even seemed to be disappearing.<br/><br/>Earth-shattering!<br/><br/>Mountains shook, lakes trembled, as if the apocalypse had arrived!<br/><br/>Dugu Wenhun immediately commanded the tens of thousands of Disciples of the Way of Hope from Sword Heaven Marsh to form up, each channeling their Lifespirit Treasure, held high above their heads.<br/><br/>Though their cultivation levels varied, they had long practiced this formation, which was taught by Hong Chen.<br/><br/>In an instant, a pale golden layer of light rose up, isolating heaven from earth, not just Sword Heaven Marsh, but the entire Descending Dragon Continent was separated by the golden light.<br/><br/>The Sword Immortal stood atop the golden light barrier, beginning to howl in agony. The blood-red Sword Qi grew even thicker, summoning rolling thunder.<br/><br/>“What is that?”<br/><br/>“Such terrifying momentum, what kind of evil technique is this?”<br/><br/>“Isn’t his rate of power increase a bit too exaggerated?”<br/><br/>“Sword Immortal? Could it really be the reincarnation of a heavenly Sword Immortal?”<br/><br/>“To think we would witness a battle of the ages before the Sword Sect’s selection.”<br/><br/>Discussion arose from every corner of Sword Heaven Marsh, everyone marveling at the Sword Immortal’s power, yet no one panicked because they believed Fang Wang would win.\t\t\t\t\t\t</div>", "images": {}, "success": true}