{"id": 326, "url": "https://www.novelhall.com/i-became-an-immortal-on-mortal-realm-32879/14870145.html", "title": "Chapter 316 - Chapter 316 Chapter 313: Nine Extremes Blood Sacrifice Technique, Great Perfection!", "volume": 4, "volume_title": "Volume 4", "body": "<h1>Chapter 316 - Chapter 316 Chapter 313: Nine Extremes Blood Sacrifice Technique, Great Perfection!</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 316 Chapter 313: Nine Extremes Blood Sacrifice Technique, Great Perfection!<br/><br/>Fang Wang, though deeply conflicted, clenched his teeth and continued to listen.<br/><br/>Even if it were true, he had no choice but to learn it.<br/><br/>This concerned the life and death of Hong Xian’er.<br/><br/>The reason he was compelled to do so wasn’t out of his deep love for Hong Xian’er, but rather because of Emperor Donggong’s care for him. Having received such immense kindness, he was obliged to use all his might to protect both the Grand Yu Divine Dynasty and Hong Xian’er.<br/><br/>Hong Xian’er kept speaking, and as she saw Fang Wang’s expression grow increasingly solemn, her heart skipped a beat. She focused even more on recalling Tai You’s Saint Method, daring not to make a mistake.<br/><br/>After a long time.<br/><br/>Once Hong Xian’er finished speaking, she looked nervously at Fang Wang only to see him with closed eyes.<br/><br/>“How is it? Is it true or false?” Hong Xian’er asked, her voice tense.<br/><br/>Fang Wang slowly opened his eyes and looked at her with a vacant gaze, startling her. She quickly asked, “What’s wrong? Is there deceit in the method?”<br/><br/>Fang Wang took a deep breath, his tone complex, “There is no deceit, it truly is an exceptional and ancient Cultivation Technique. However, its cost is great, sacrificing one’s own fate, life span, and longevity to push one’s potential to the limit, thus attaining the peak strength one is capable of.”<br/><br/>Hong Xian’er asked skeptically, “Is she really that kind-hearted?”<br/><br/>“No, once you use this technique, you will inevitably face death. She must be coveting your body. As your fate and life span are sacrificed, she can then take over your body, to deceive heaven and pass unseen. As for how she would restore her longevity, that I do not know,” mused Fang Wang.<br/><br/>Having said this, he stood up and walked towards the room’s door.<br/><br/>Hong Xian’er asked, “Where are you going?”<br/><br/>“To clear my mind. Don’t practice this technique. No matter what tribulations you face, I will stand in front of you, protect you completely. If anyone wants you dead, they’ll have to get through me first.”<br/><br/>Fang Wang left these serious words behind. The reason he was so grave wasn’t that he was expressing his care for Hong Xian’er, but because he was about to explode with emotion, fearing that he could no longer restrain himself.<br/><br/>Hearing his words, Hong Xian’er stood still, her ears swiftly turning red.<br/><br/>The door opened, and Fang Wang vanished quickly.<br/><br/>Hong Xian’er stared in the direction he had left, her gaze becoming hazy.<br/><br/>“Damn man… always stirring my heart…”<br/><br/>Fang Wang arrived on Kunlun Mountain. Years had passed, and Kunlun had grown vast, making it easy for him to find a secluded spot.<br/><br/>He stood on a cliff, looking down at the magnificent landscape, with the stunning beauty of Sword Heaven Marsh and the majestic undulating mountain ranges in the distance filling his view.<br/><br/>Fang Wang took a deep breath, earnestly trying to calm his emotions.<br/><br/>The Extinction Divine Force had just made him seclude himself for eight thousand years, and after only one year of rest, Tai You’s Saint Method had him seclude himself within Heavenly Palace for another eleven thousand years!<br/><br/>Nine Extremes Blood Sacrifice Technique!<br/><br/>That was the name of Tai You’s Saint Method!<br/><br/>This technique was terrifying, chiefly because it could be used only once in a lifetime, and only in desperate circumstances as a last resort, often ending with mutual destruction.<br/><br/>Even if Fang Wang practiced the Nine Extremes Blood Sacrifice Technique to Great Perfection, he couldn’t change its essence. It couldn’t be used as a routine combat technique. Once a sacrifice was made, it would be a sacrifice of all life span, fate, and longevity.<br/><br/>Fang Wang also finally understood why Hong Xian’er from his past life could awaken during battle, reach the echelon of Half-step Great Emperor, sweep all enemies before her, and then fall— it was all due to the Nine Extremes Blood Sacrifice Technique.<br/><br/>“I hope there never comes a day when I need to use the Nine Extremes Blood Sacrifice Technique,”<br/><br/>Fang Wang thought silently. This secret technique didn’t require him to practice it in reality. Once learned, it could be performed at any time, just like the Extinction Divine Force. Only Cultivation Techniques and physical conditioning needed to be carried out in reality to adapt the body to them.<br/><br/>The breeze blew gently, stirring his black hair and his thoughts along with it.<br/><br/>He had enough ultimate techniques by now, and it was time to properly cultivate and accumulate prowess.<br/><br/>He hoped that Zhou Xue and Hong Xian’er would stop sending him opportunities.<br/><br/>He was quite despicable in this regard, unable to refuse an opportunity when it came, and then nearly collapsing after each occurrence.<br/><br/>Just then, a figure flew over—remarkably, it was Qiao Xuan of the Tiangong Sect, who was also the main person responsible for the construction plans of Kunlun.<br/><br/>Qiao Xuan looked even older, with hair full of silver and a somewhat hunched back.<br/><br/>Seeing Fang Wang, he was quite surprised and said with a smile, “I didn’t expect to run into you here. I can finally relax now that I’ve seen you. I was actually worried that I might die before getting the chance. I need to tell you about who will take over the Kunlun project.”<br/><br/>Fang Wang nodded with a smile and replied, “Whoever you choose, I’ll trust.”<br/><br/>For Qiao Xuan’s talk of approaching death, he had no comfort to offer. Death was inevitable, and they, as cultivators, had long grown indifferent to life and death.<br/><br/>Qiao Xuan’s smile grew even brighter as he began to discuss the arrangements after his death.<br/><br/>Fang Wang listened carefully, filled with gratitude for Qiao Xuan. Although the grand plan of Kunlun was established for him, he had not contributed much. Even if the Qiao Clan did it for eternal glory, their contribution deserved his serious attention.<br/><br/>An hour later.<br/><br/>Qiao Xuan finally left, satisfied. Just as he soared into the sky, he suddenly remembered something, turned his head with a smile and said, “Dao Master, if by chance you become an Immortal one day, and you encounter my reincarnation, you must take me to Kunlun. Let me witness in person the grandeur of Kunlun after it’s built.”<br/><br/>Fang Wang smiled and responded, “If such a day comes, I will take you there.”<br/><br/>Qiao Xuan bowed and then departed.<br/><br/>Fang Wang suddenly felt the transience of life.<br/><br/>Life in the Heavenly Palace was monotonous for a hundred thousand years, but every time he came out, his surroundings hadn’t changed. Yet, it was the time in reality that was true—people he knew would die, things he had seen would vanish, and all of this, he was momentarily powerless to retain.<br/><br/>Fang Wang didn’t feel sad. On the contrary, he began to embrace this sensation.<br/><br/>There was a sense of wistfulness, yet it was tinged with an indescribable beauty.<br/><br/>The passing of life is not always a cause for sorrow, sometimes it’s as beautiful as birth itself.<br/><br/>If the world were always filled with the same people, it would lose its intrigue. The cycle of renewal is the fundamental law that allows the world to function.<br/><br/>Of course, Fang Wang admitted to being a hypocrite. He could accept that the world changes, but he desired immortality for himself.<br/><br/>Day turned to night and night to day.<br/><br/>Fang Wang stood atop the mountain for three days and nights. During that time, many passersby noticed him, but seeing that he was in meditation, they dared not disturb him.<br/><br/>Meanwhile, news that Wangdao of the Twelve Dao Sects had established the Buddhist Sect spread quickly, and the fame of Zhu Rulai shook the continent as tales of his exploits rapidly disseminated.<br/><br/>The news of the Buddhist Sect being destroyed by Fang Wang and the Jin Xiao Sect also reached the Descending Dragon Continent. With the Jin Xiao Sect pushing the narrative, scandals of the Buddhist Sect erupted, enhancing Fang Wang’s image even further.<br/><br/>In the blink of an eye, three months had passed.<br/><br/>After sending Hong Xian’er into the Kunlun Formation, Fang Wang went to the bridge where he used to meditate to continue his cultivation.<br/><br/>He prepared to wait for the establishment of the Sword Sect.<br/><br/>As the Dao Master, he had to be present at the establishment of any of the Twelve Dao Sects, otherwise, the prestige of the Sects couldn’t be established.<br/><br/>No sooner had he sat down than Hong Chen suddenly walked up to him and began, “Lately, many beings have attempted to calculate the fate of Wangdao, and there are even those scheming against the Fang Family. All have been cursed by me and have suffered for it, but there is one who I cannot put out of my mind; I must discuss this with you.”\t\t\t\t\t\t</div>", "images": {}, "success": true}