{"id": 325, "url": "https://www.novelhall.com/i-became-an-immortal-on-mortal-realm-32879/14870144.html", "title": "Chapter 315 - Chapter 315 Chapter 312: The True And False Of Saint Method, Trouble Is Brewing", "volume": 4, "volume_title": "Volume 4", "body": "<h1>Chapter 315 - Chapter 315 Chapter 312: The True And False Of Saint Method, Trouble Is Brewing</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 315 Chapter 312: The True and False of Saint Method, Trouble is Brewing<br/><br/>Hearing Tai You’s words, Hong Xian’er didn’t take them at face value, instead, her heart filled with caution.<br/><br/>The mention of Fang Wang made her even more wary, feeling that the other party intended not just to calculate against her, but also against Fang Wang.<br/><br/>Hong Xian’er asked, “If I believe you, and obtain the Great Emperor’s Power, what will I have to pay? Don’t tell me that you’re helping me out of kindness and that I won’t have to pay any price.”<br/><br/>The tea on the ground flowed again, forming rows of new text.<br/><br/>“This Saint can only provide the Saint Method. With your talent, you have a chance to obtain the Great Emperor’s Power, but if your mind becomes cluttered during cultivation, you may veer off onto the wrong path, even reducing your lifespan. The reason this Saint helps you, besides our similar destinies, is also to add another Great Emperor to the Mortal Realm. It would be such a pity if you were to die in an undeserved calamity.”<br/><br/>“Your tribulation doesn’t originate from the life or death fates of the Mortal Realm, but from your father the emperor, who has aroused the apprehension of the Upper Realm. Are you truly willing to perish in such a tribulation?”<br/><br/>Hong Xian’er furrowed her brows tightly, lost in thought.<br/><br/>Tai You didn’t reveal more text, waiting for her decision.<br/><br/>After a long time,<br/><br/>Hong Xian’er spoke, “First pass me the Saint Method, I want to see if your Saint Method is as formidable as you claim.”<br/><br/>The tea on the ground surged and converged into one large character.<br/><br/>“Good.”<br/><br/>After leaving the Sea of Void, Fang Wang, Zhou Xue, and Emperor Extinction hurried to the location of the Buddhist Sect.<br/><br/>Upon arriving at the Buddhist Sect, Fang Wang, taking Xiao Zi, Zhu Rulai, and the disciples who had surrendered, departed.<br/><br/>Zhou Xue, Su Xuan, Emperor Extinction, along with a group of Jin Xiao Sect Cultivators stood on the cliff, watching Fang Wang and the others leave.<br/><br/>Su Xuan retracted his gaze and then looked at Emperor Extinction. He sent a message to Zhou Xue asking, “The monster you brought back, why does it seem so extraordinary?”<br/><br/>“Indeed, it is like you.”<br/><br/>Zhou Xue replied telepathically, surprising Su Xuan.<br/><br/>Emperor Extinction sensed Su Xuan’s gaze, turned to look at him, and said, “Are you very curious about me?”<br/><br/>The Jin Xiao Sect Cultivators all turned their attention towards the two of them.<br/><br/>With a cold face, Su Xuan snorted, “Indeed curious, we’ll find a chance to talk later.”<br/><br/>Emperor Extinction’s lips curved up, his gaze at Su Xuan carrying a teasing air.<br/><br/>Zhou Xue didn’t intervene in their posturing, her face also revealing an inscrutable smile.<br/><br/>The Jin Xiao Sect had been laying plans far and wide for many years, establishing teleportation formations in seas and continents everywhere, considerably shortening the journey for Fang Wang and the others.<br/><br/>During the journey, Zhu Rulai noticed that Fang Wang had become more silent and reserved, a change in him, but Zhu Rulai didn’t point it out.<br/><br/>Xiao Zi, however, was used to it and guessed that Fang Wang must have obtained a powerful inheritance and needed time to adjust.<br/><br/>One month later.<br/><br/>Fang Wang and the others returned to Grand Qi Jian Tian Ze. This time, he had brought back tens of thousands of Buddhist Sect Cultivators, causing a huge stir. After telling Hong Chen and Dugu Wenhun about appointing Zhu Rulai as one of the Twelve Dao Sects, he washed his hands of the matter, leaving Jian Tian Ze alone to roam around Grand Qi.<br/><br/>Descending Dragon Continent had always been at peace, but with many kingdoms existing under that peace, there were undercurrents at play. Grand Qi’s territory continued to expand, with many forces contributing to the Qi Dynasty in hopes of currying favor with Fang Wang.<br/><br/>The Fang Family grew even more tightly bound with the royal family of Grand Qi through multiple marriages.<br/><br/>And so, a year passed by swiftly.<br/><br/>On this day.<br/><br/>Fang Wang, carrying a wine pot, entered Jian Tian Ze. Jian Tian Ze was still bustling. After a year of relaxation, he had regained his usual demeanor, his face carrying a warm and sunny smile, attracting the gazes of cultivators along the way.<br/><br/>Most of the cultivators in Jian Tian Ze nowadays had never seen Fang Wang, so his presence didn’t cause a big commotion. However, after walking a hundred paces, he was finally recognized by some of the old-timers of Jian Tian Ze.<br/><br/>“Fang Wang, brother!”<br/><br/>Gu Tianxiong ran to Fang Wang’s side excitedly, warmly throwing an arm around his shoulder.<br/><br/>As soon as the name Fang Wang was mentioned, all the surrounding cultivators became excited, their breathing turning rapid.<br/><br/>Fang Wang remembered Gu Tianxiong, mainly his daughter, after all, Gu Li had given him a peerless cultivation technique, and of course, Gu Li’s beauty was also a memorable point.<br/><br/>“Big brother Gu, long time no see, want to find a place to drink?”<br/><br/>Fang Wang smiled and asked. This past year had been quite joyful for him and he wanted to boast to Gu Tianxiong a bit, and even discuss and exchange ideas.<br/><br/>In his memory, this Big Brother Gu knew how to have a good time.<br/><br/>Upon hearing this, Gu Tianxiong immediately nodded happily and was about to agree when suddenly something seemed to come to him. His expression turned solemn as he spoke in a low voice, “An immortal has come looking for you, and I’ve seen her. She’s indeed beautiful, unlike any woman of the mortal realm. It’s said that you two are engaged. Brother, don’t forget about my daughter; she’s practicing cultivation hard now just to catch up with you. She doesn’t even come back to see me anymore. I think she’s developed some mental blocks, all because of you. In the future, even if it’s just a place as a concubine, that would be fine.”<br/><br/>On hearing this, Fang Wang thought that Zhou Xue might have returned. He immediately spread out his divine senses but didn’t capture any sight of Zhou Xue. Instead, he saw someone else.<br/><br/>Hong Xian’er.<br/><br/>Why had she come?<br/><br/>Without giving it much thought, Fang Wang continued to go out drinking with Gu Tianxiong.<br/><br/>As long as Hong Xian’er was fine, there was nothing worth his concern.<br/><br/>And so, it was not until the next day’s early morning that Fang Wang finally returned to his own loft. By then, Hong Xian’er was already waiting there.<br/><br/>“Oh, are you done chatting? Is his precious daughter beautiful?” Hong Xian’er asked.<br/><br/>Fang Wang sat at the table, looking into her eyes and smiled, “Looks are secondary. Miss Gu and I are good friends who met when we joined the sect, and she has imparted her family’s secret cultivation techniques to me. To me, she is indeed a friend I care about.”<br/><br/>Hong Xian’er snorted, “Big men and their dilly-dallying—if you want to marry, then marry; if you want to take a concubine, do so. When it comes to matters of love, you are no match for my father. The women he fancies can enter his chamber the very same evening.”<br/><br/>As Fang Wang was about to pour tea, he couldn’t help but laugh at these words, wondering what Emperor Donggong would think if he heard them.<br/><br/>“Alright, what is it that you wanted to see me about?” Fang Wang asked seriously.<br/><br/>Hong Xian’er didn’t continue to tease him, but instead shared her own experiences.<br/><br/>Tai You!<br/><br/>Upon hearing this name, Fang Wang frowned; this Great Saint hadn’t given up after all.<br/><br/>He completely didn’t buy the idea of Tai You showing kindness to Hong Xian’er.<br/><br/>Following that, Hong Xian’er said, “I asked her to impart the Saint Method to me. Your aptitude and comprehension are higher than mine, so you judge for yourself whether there’s any deceit in this.”<br/><br/>Fang Wang looked at her with admiration and said, “You are indeed clever and rational. If you fell for someone else’s schemes out of fear of involving me, I would be facing an even tougher situation.”<br/><br/>“Nonsense, I am the daughter of the Human Emperor; I’ve seen my share of crafty plots. Let’s talk about the Saint Method first,” Hong Xian’er said earnestly.<br/><br/>Fang Wang nodded, “Tell me about it.”<br/><br/>Hong Xian’er immediately cast a spell to create a barrier, isolating the loft.<br/><br/>She began to describe the Saint Method, and Fang Wang listened intently.<br/><br/>He too was curious to see if Tai You was playing a trick.<br/><br/>As he listened, his expression grew unnatural.<br/><br/>This cultivation technique…<br/><br/>It didn’t seem fake, and it was profound!<br/><br/>Oh no, something was about to happen!\t\t\t\t\t\t</div>", "images": {}, "success": true}