{"id": 324, "url": "https://www.novelhall.com/i-became-an-immortal-on-mortal-realm-32879/14864871.html", "title": "Chapter 314 - Chapter 314 Chapter 311: Extinction Divine Force, Great Perfection!", "volume": 4, "volume_title": "Volume 4", "body": "<h1>Chapter 314 - Chapter 314 Chapter 311: Extinction Divine Force, Great Perfection!</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 314 Chapter 311: Extinction Divine Force, Great Perfection!<br/><br/>Facing the consolation of Emperor Extinction, Fang Wang took a deep breath and tried hard to calm his emotions.<br/><br/>“What’s the matter?” Zhou Xue asked with a smile. “Could it be that you’ve been struck a blow?”<br/><br/>A hint of disappointment flickered in Emperor Extinction’s eyes.<br/><br/>It seemed he had overestimated Fang Wang’s talent. After all, even in The Upper Realm, his secret technique was extremely difficult to cultivate.<br/><br/>Fang Wang shook his head but remained silent.<br/><br/>Zhou Xue didn’t share Emperor Extinction’s disappointment. Instead, she asked, “Could it be that it’s too simple and has left you disappointed?”<br/><br/>Emperor Extinction glanced at her, a trace of displeasure in his eyes.<br/><br/>How could his secret technique possibly be simple?<br/><br/>Fang Wang shook his head again and finally spoke up, “The Extinction Divine Force is profound and unfathomable, far beyond any Mortal Realm technique. It’s exactly this that has left me exhausted.”<br/><br/>Extinction Divine Force!<br/><br/>This was Emperor Extinction’s body cultivation secret technique.<br/><br/>To reach Great Perfection, Fang Wang had spent nearly eight thousand years within the Heavenly Palace!<br/><br/>One should know that he had the foundation of the Heavenly Gang Supreme Yang Tyrant Body and had been cultivating for many years; this alone spoke to the difficulty of mastering this technique.<br/><br/>This technique could enhance his physique, and it didn’t conflict with his other bodily techniques—in fact, it could perfectly complement them.<br/><br/>Fang Wang could feel his strength about to make another leap forward.<br/><br/>Unable to help himself, Emperor Extinction said, “You’ve just received the inheritance, and already you’re exhausted? There’s no need for such flattery, Junior. Your talent must be supported by pride. Every supreme being who has reached the apex is an arrogant creature.”<br/><br/>The comment made Fang Wang feel somewhat displeased, and he responded immediately, “I’ve learned it.”<br/><br/>“Hmm, this… What? You’ve learned it?”<br/><br/>Emperor Extinction, deeply moved, stared and spoke with a sense of affronted anger.<br/><br/>Did this kid really think that just because he, the emperor, was dead, he was no longer great?<br/><br/>Dare to deceive and belittle his secret technique!<br/><br/>Fang Wang raised his right fist, and in an instant, he burst forth with a terrifying aura. His pupils turned to gold, and his demeanor took on the reverence of a deity, full of oppressiveness.<br/><br/>Emperor Extinction’s eyes widened, his body trembling, hardly believing his own eyes.<br/><br/>Zhou Xue blinked and smiled. She wasn’t surprised. In fact, she felt a thrill of excitement but restrained herself; she couldn’t let Fang Wang become complacent.<br/><br/>“Truly… Did you learn it before?” Emperor Extinction asked in shock, unable to believe what he was seeing.<br/><br/>Zhou Xue spoke up, “Predecessor, that’s your secret technique. If he had known it before, you would have been able to feel it. He’s just that talented. He’s the foundation of all my ambitions.”<br/><br/>Fang Wang couldn’t help but look towards Zhou Xue. Was this her way of confessing?<br/><br/>Emperor Extinction, with burning eyes, stared at Fang Wang’s fist and started circling around him.<br/><br/>“The Divine Force flows from within to the outside, encircling the body like a dragon. It’s not as simple as just learning it; you’ve achieved Great Completion. Among my disciples, the number who have reached this realm can be counted on one’s fingers, and they all spent over ten thousand years to get there,” Emperor Extinction remarked with amazement.<br/><br/>Great Completion in just over ten thousand years?<br/><br/>Fang Wang felt somewhat disheartened. A ten-thousand-year period inside the Heavenly Palace was even longer than ten thousand years of cultivation in the real world.<br/><br/>The more Emperor Extinction looked at him, the more pleased he became. He slapped Fang Wang on the shoulder, feeling the sharpness of the Extinction Divine Force, and then his expression suddenly turned strange.<br/><br/>“What’s wrong?” Zhou Xue asked.<br/><br/>Emperor Extinction shook his head slightly and said, “It’s nothing.”<br/><br/>He released his grip and walked to one side, though his heart was far from as calm as he appeared on the surface; in fact, it was as if a storm had been stirred.<br/><br/>This youngster’s mastery of the Extinction Divine Force…<br/><br/>Emperor Extinction created the Extinction Divine Force, and he spent his whole life studying it. His perception of the Extinction Divine Force far exceeded that of other Cultivators. His intuition told him that although Fang Wang’s Extinction Divine Force might not be as strong as his, in terms of mastery, it was likely to surpass his.<br/><br/>How is that possible?<br/><br/>It was only then that Emperor Extinction understood what Zhou Xue meant when she described Fang Wang as being inconceivable.<br/><br/>He thought of a legend from The Upper Realm and looked at Fang Wang with eager eyes.<br/><br/>“Alright, Fang Wang, you continue your cultivation over there. I need to assist my elder in breaking his seal,” Zhou Xue said to Fang Wang, who nodded and then walked to one side.<br/><br/>Emperor Extinction gathered up his robes and sat down to meditate right where he was, his gaze unable to move away from Fang Wang.<br/><br/>Zhou Xue stood behind him, her right palm striking toward his head from a distance, remotely activating Spiritual Power that caused intense spatial distortions to ripple around him.<br/><br/>Meanwhile, Fang Wang wandered aimlessly. Seeing those stone pillars inscribed with Spells and Divine Skills annoyed him.<br/><br/>He now really wanted to escape the Great Silence Palace and find a place to clear his mind.<br/><br/>For some reason, he suddenly longed for the cities of Mortals, an atmosphere devoid of Cultivators and Monsters. He decided that once this matter was settled, he would return to Grand Qi and find a city to live in seclusion for a leisurely year.<br/><br/>A full half-hour passed before Zhou Xue finally stopped.<br/><br/>Fang Wang watched from a distance and distinctly felt that Emperor Extinction’s aura had changed, undergoing some indescribable transformation.<br/><br/>Emperor Extinction opened his eyes and stood up. He lifted his hand and gestured, and a giant stone pillar in the distance shattered to reveal a bright light that flew out and quickly fell into Zhou Xue’s hands.<br/><br/>Zhou Xue held it, the light dissipating to reveal a jade ruler—a green ruler marked with white patterns.<br/><br/>Her lips curved into a smile as she tucked the green ruler into her sleeve, then turned to Fang Wang and said with a smile, “Let’s go. It’s time to leave.”<br/><br/>Emperor Extinction twisted his neck and walked ahead toward the Great Silence Palace’s gate, a look of anticipation in his eyes.<br/><br/>He began to look forward to his new life upon revival!<br/><br/>In the Human Emperor Continent, within the Grand Yu Divine Dynasty.<br/><br/>Within a palace in the Imperial City, Hong Xian’er, clad in a yellow dress, meditated on a cushion, her hands continuously casting spells and channeling powers, with plumes of white mist emerging from her body. These plumes swirled above her head, vaguely forming some kind of image exuding an air of mystery.<br/><br/>Suddenly.<br/><br/>Hong Xian’er opened her eyes and asked in a stern voice, “Who’s there? Show yourself! I know you’re here!”<br/><br/>No one responded, but she did not take it lightly, her beautiful eyes scanning every corner of the hall.<br/><br/>Clang!<br/><br/>A table leg on a nearby table suddenly snapped, causing the teaware on it to crash to the floor, splashing tea all over.<br/><br/>Hong Xian’er’s figure disappeared, then reappeared next to the table. She focused her gaze on the tea spilled on the ground.<br/><br/>She saw the tea droplets forming lines of text:<br/><br/>“This Saint’s name is Tai You. I share a similar destiny with you. This Saint wishes to make a deal with you, to help you escape your fate.”<br/><br/>Upon hearing this, Hong Xian’er said scornfully, “A deal? Fate? You don’t even dare to show yourself, how can you help me?”<br/><br/>The text formed by the tea on the ground started changing again, transforming into another message:<br/><br/>“Your father transferred his Emperor’s Fate Mandate onto you, so you now possess a complete Emperor’s Fate Mandate. But your tribulation is approaching, and the one destined to be your partner is indeed powerful; however, you should understand that he has not yet reached the point of being invincible in the Mortal Realm. Your calamity could also involve him.”<br/><br/>“Should you acquire this Saint’s Saint Method, you would gain the Great Emperor’s Power ahead of time, sweep away all formidable enemies in this world, and shatter all the chains of fate.”\t\t\t\t\t\t</div>", "images": {}, "success": true}