{"id": 322, "url": "https://www.novelhall.com/i-became-an-immortal-on-mortal-realm-32879/14864867.html", "title": "Chapter 312 - Chapter 312 Chapter 309: Revival Of The Great Emperor_1", "volume": 4, "volume_title": "Volume 4", "body": "<h1>Chapter 312 - Chapter 312 Chapter 309: Revival Of The Great Emperor_1</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 312 Chapter 309: Revival of the Great Emperor_1<br/><br/>plaintext<br/><br/>Ming Hai Lin and Chen Yao were killed in a split second by Fang Wang, leaving only Ying Cang Hai and Shen Jiu Jiao.<br/><br/>Ying Cang Hai in the high sky had not expected the two demons to die so quickly.<br/><br/>He indeed felt that he was no match for Fang Wang, but how could he have expected the gap to be so large?<br/><br/>Fang Wang flew out of the rolling dust and advanced toward Ying Cang Hai, causing Ying Cang Hai’s complexion to fluctuate between shades of fear and anger.<br/><br/>Emperor Extinction, from beginning to end, had not uttered a word, nor was he surprised by Fang Wang’s strength, while Zhou Xue watched the scene play out with a mocking look in her eyes.<br/><br/>“Damn it…”<br/><br/>Ying Cang Hai gritted his teeth with hate. The four of them were the most outstanding talents from the Undersea Demon Palace, having lived for hundreds of years, so full of pride and hard to come by rivals. They had never imagined they would face such a day.<br/><br/>Just then, a strong gust of wind came from behind, startling him into turning around subconsciously.<br/><br/>Boom!<br/><br/>A gigantic dragon claw came at him head-on, cutting him in half at the waist.<br/><br/>Ying Cang Hai’s eyes widened, his bloodshot eyes filled with disbelief.<br/><br/>The one who had struck was none other than Shen Jiu Jiao!<br/><br/>Shen Jiu Jiao’s eyes were blood red, and as he lifted his dragon claw, a fierce flame ignited in the palm of his hand, ready to sweep forth.<br/><br/>With a snap!<br/><br/>Fang Wang appeared out of thin air in front of him, grabbing his wrist.<br/><br/>Shen Jiu Jiao’s face drastically changed, and he quickly said, “If you let me kill him, you can also pass this trial and conserve Spiritual Power, why not let us fight amongst ourselves?”<br/><br/>Fang Wang raised his chin, his body soaring up, looking down at him and said, “She has already said that the surviving demon is not you, and besides, to kill you, why waste Spiritual Power?”<br/><br/>Shen Jiu Jiao was enraged and panicked; he abruptly broke his own arm and vanished from the spot, reappearing dozens of miles away, terrified, he looked back at Fang Wang.<br/><br/>He turned his head toward Emperor Extinction and shouted, “I forfeit! I give up!”<br/><br/>Fang Wang did not immediately make a move, but instead looked to Emperor Extinction, waiting for his response.<br/><br/>“Once you participate, there is no turning back, how could the descendants of the demon ancestors be so cowardly and afraid of death?”<br/><br/>Emperor Extinction said coldly, and as his words fell, Fang Wang suddenly appeared in front of Shen Jiu Jiao.<br/><br/>Shen Jiu Jiao’s pupils constricted, he opened his mouth widely, and a blast of firelight burst forth.<br/><br/>Fang Wang’s leg swept out in a horizontal strike, and before Shen Jiu Jiao could spew fire, a kick exploded his body, dispersing his soul together with the smoke.<br/><br/>Too fast!<br/><br/>In the face of beings below the Sky-Stepping Realm, Fang Wang truly did not take them seriously.<br/><br/>However, after he had killed Shen Jiu Jiao, he felt a profound sense of emotion.<br/><br/>Without realizing it, he had become so powerful, recalling when he faced the Heaven-Breaking Realm, he felt pressured.<br/><br/>To others, his growth was incredibly rapid, but only he knew his actual age was approaching a hundred thousand years.<br/><br/>Fang Wang no longer dwelled on it and turned to fly towards Zhou Xue.<br/><br/>Ying Cang Hai, who had been cut at the waist, had not died; he endured the agony, allowing his body to reconnect and grow new flesh, his face a complex mixture of emotions as he watched Fang Wang’s retreating figure.<br/><br/>Fang Wang landed beside Zhou Xue, and the two turned their gaze toward Emperor Extinction.<br/><br/>Emperor Extinction spoke, “The second trial is the march through the Illusionary Realm. I will pull you into different Illusionary Realms, and you will need to conquer a force. The strongest beings in the Illusionary Realm will be two major realms above you, and your task is to execute all living beings you see.”<br/><br/>Two major realms above?<br/><br/>Fang Wang raised an eyebrow.<br/><br/>Zhou Xue’s lips curled upwards, but she remained silent.<br/><br/>Ying Cang Hai’s face turned ashen; he knew he was finished.<br/><br/>Emperor Extinction immediately waved his sleeve, and Fang Wang was instantly pulled into the Illusionary Realm.<br/><br/>Eagle Canghai slowly descended from the sky, sitting cross-legged on the ground, his eyes and eyebrows tightly shut.<br/><br/>“Eh?”<br/><br/>Emperor Extinction let out a sound of surprise and looked toward Zhou Xue, only to see that she had not been dragged into the Illusionary Realm but was smiling at him instead.<br/><br/>“Your cultivation technique is not simple, could it be that you come from The Upper Realm?” Emperor Extinction asked.<br/><br/>Zhou Xue smiled and said, “Where I come from is not important, what’s important is whether you want to live or not?”<br/><br/>“What? Junior, do you also wish to resurrect the deceased Great Emperors?” Emperor Extinction’s voice sounded, still as calm as before.<br/><br/>Zhou Xue replied, “There’s nothing impossible in this world, if you truly were content with this, you wouldn’t have left behind a remnant soul, would you? Almost all the deceased Great Emperors and Great Saints are the same; you all have regrets in your hearts. You were meant to live forever, not to end like this.”<br/><br/>Emperor Extinction fell silent.<br/><br/>After a few moments, just as he was about to speak, his gaze suddenly swept toward Zhou Xue’s side where Fang Wang stood, his eyes tightly closed.<br/><br/>Zhou Xue also glanced at Fang Wang and said annoyedly, “Stop pretending.”<br/><br/>Upon hearing this, Fang Wang then opened his eyes and coughed feignedly, saying, “Senior, my apologies, I have also cultivated a certain remarkable technique, which doesn’t allow me to fully immerse myself in the illusionary arts.”<br/><br/>The Formless Zhou Tian Technique!<br/><br/>And it was Great Perfection!<br/><br/>Previously, when they entered the palace, it was not his consciousness that entered the Illusionary Realm, but rather the images on the walls appeared before his eyes, from which he could exit at any time. As for such illusionary arts that caused the consciousness to sink, the Formless Zhou Tian Technique would automatically evade it.<br/><br/>Emperor Extinction once again fell silent.<br/><br/>The palace was engulfed in silence.<br/><br/>Fang Wang was somewhat curious; this inheritance trial seemed far too easy, and he wondered whether Emperor Extinction would grant their wishes as easily.<br/><br/>Zhou Xue said nothing and quietly waited for Emperor Extinction’s decision.<br/><br/>After a while, Emperor Extinction finally asked in a low voice, “Girl, you had that Eagle Demon stay behind, what are you scheming?”<br/><br/>Zhou Xue replied, “This is my sincerity. This demon body, among the four demons, has the strongest aptitude and vitality, and can barely serve as your vessel. I wonder if the senior is willing?”<br/><br/>As expected!<br/><br/>Fang Wang knew Zhou Xue wasn’t so benevolent to bring the four demons into the trial without motive.<br/><br/>Isn’t this the same method used for the resurrection of the Hongxuan Emperor?<br/><br/>Emperor Extinction took a few steps forward, his figure flickering continuously, and after three steps, he entered Eagle Canghai’s body. At this moment, Eagle Canghai’s face showed a pained expression, clearly not at ease in the Illusionary Realm.<br/><br/>Under the watchful eyes of Fang Wang and Zhou Xue, Emperor Extinction entered Eagle Canghai’s body.<br/><br/>Fang Wang couldn’t help asking, “Are the Great Emperors and Great Saints revived so easily?”<br/><br/>“Of course not, it’s a certain soul-binding spell that traps them. I can help to unravel some of it, allowing their remnant souls to seize bodies and be reborn, that’s not a true revival. If they want to come back to life, they will need to make more effort,” Zhou Xue replied softly.<br/><br/>Fang Wang suddenly realized, now it made sense.<br/><br/>“In fact, many Great Saints and Great Emperors have methods to resurrect parts of their souls; it’s just that they dare not, for fear of provoking pursuit from The Upper Realm. Although their souls are as everlasting as the mortal world, they also do not wish to suffer the torments of The Upper Realm,” Zhou Xue continued.<br/><br/>As everlasting as the mortal world?<br/><br/>Upon hearing this, Fang Wang obtained a deeper understanding of the Great Saints and Great Emperors.<br/><br/>He then thought of Executioner Immortal Great Saint, who claimed to have achieved moksha, uncertain whether the Great Saint’s moksha meant a saintly demise or was a cicada sloughing its shell, hiding somewhere in dormant seclusion.<br/><br/>Tsk, tsk.<br/><br/>Fang Wang also recalled some words of Executioner Immortal Great Saint and suspected that behind the Great Saints and Great Emperors, there was a grander scheme at play.<br/><br/>Perhaps one day, all the Great Saints and Great Emperors from ancient to modern times will resurrect!<br/><br/>What kind of golden age would that be?\t\t\t\t\t\t</div>", "images": {}, "success": true}