{"id": 332, "url": "https://www.novelhall.com/i-became-an-immortal-on-mortal-realm-32879/14875290.html", "title": "Chapter 322 - Chapter 322 Chapter 319 The Name Of The Dao Sect, The Great Emperor Of Divine Beings", "volume": 4, "volume_title": "Volume 4", "body": "<h1>Chapter 322 - Chapter 322 Chapter 319 The Name Of The Dao Sect, The Great Emperor Of Divine Beings</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 322 Chapter 319 The Name of the Dao Sect, The Great Emperor of Divine Beings<br/><br/>Facing the inquiry of Tai Xi Celestial Maiden, Gu Li slightly nodded and stepped forward. As she walked, she said, “That must be Kunlun. Before I left, there were no mountains as tall as that here.”<br/><br/>The thought of soon meeting Fang Wang made Gu Li’s heart flutter with unease.<br/><br/>Over the years, even as she practiced in Suzhen Palace, she often heard legends about Fang Wang.<br/><br/>When she first arrived at Suzhen Palace, it felt as though she had entered a brand new realm. The Daoist practice ground of Suzhen Palace was more magnificent than any she had seen before, and the depth of their Daoist teachings far exceeded her imagination. She felt as though she had stepped directly into the gates of immortality.<br/><br/>However, the wonder she felt did not last long before Fang Wang’s reputation forcefully intruded into her life at Suzhen Palace.<br/><br/>Listening to fellow disciples and elders in awe of Fang Wang’s strength, Gu Li felt a sense of pride as well as disbelief.<br/><br/>She never doubted Fang Wang’s talents, but the spread of his reputation was simply too quick.<br/><br/>He always managed to accomplish earth-shattering feats.<br/><br/>Now, as she once again set foot on the Descending Dragon Continent, her heart inevitably grew anxious.<br/><br/>Anticipating and yet fearing the meeting with Fang Wang, her emotions were indescribable.<br/><br/>Tai Xi Celestial Maiden seemed to notice her nervousness and thus said with a smile, “Don’t think too much. He surely cares, and not to mention his request for me to take care of you, your father Gu Tianxiong still receives good care within Sword Heaven Marsh, despite his cultivation being at the bottom. That shows your place in Fang Wang’s heart.”<br/><br/>As Fang Wang grew stronger, Tai Xi Celestial Maiden felt a sense of crisis. She feared falling behind him, and the same was true for Suzhen Palace.<br/><br/>To secure the support of Fang Wang and Wangdao, she needed to build a close alliance between the two forces.<br/><br/>The disciples of Suzhen Palace were forbidden to marry, and Tai Xi Celestial Maiden had to abide by this rule. Thus, she revered Fang Wang without any romantic feelings and shifted her plans towards Gu Li.<br/><br/>Gu Li was perfect for this, not a formal disciple of Suzhen Palace, yet she trained there.<br/><br/>Once Gu Li bore a daughter with Fang Wang, she planned to bring the child into Suzhen Palace, thereby securing a stable relationship between the palace and Fang Wang forever.<br/><br/>Hearing the words of Tai Xi Celestial Maiden, Gu Li’s tense feelings slightly eased, and she cast a grateful look towards her.<br/><br/>From the moment they met, Tai Xi Celestial Maiden had taken good care of her.<br/><br/>Of course, she was aware that all this was because of Fang Wang, but the grace of assistance should not be ignored.<br/><br/>Elsewhere.<br/><br/>Sword Heaven Marsh was bustling with excitement.<br/><br/>Xu Qiuming, clad in grey, strolled beside the lake. As he observed the thriving scene of Sword Heaven Marsh today, his face was filled with emotion.<br/><br/>Beside Xu Qiuming was another person, a Daoist in a loose, dark Dao robe, holding a horsetail whisk, and carrying a Peach Wood Sword on his back, with a scholar’s hat on his head. He looked around curiously, as if searching for someone.<br/><br/>“Stop looking. He has practiced some kind of extraordinary technique. Unless he shows up before you, you will not be able to find him,” said Xu Qiuming with a hint of amusement in his voice.<br/><br/>The Daoist said with longing, “Indeed remarkable. Even with my divination and perception abilities, he remains elusive. No wonder he dares to call himself Heavenly Dao.”<br/><br/>Xu Qiuming looked towards the group of Sword Cultivators who were on the lake, comprehending the Celestial Sword Intent, and said, “Sword Heaven Marsh is truly formidable now. It seems becoming the Sword Sect will not be so easy for me.”<br/><br/>The Daoist turned his head, patted his shoulder, and laughed, “What is there to fear? It’s all about Sword Dao, you will not lose. Tell me, what should I call my sect? Wangdao already has Xuan Zong, Buddhist Sect, and Sword Sect. My Dao sect must surpass them in grandeur.”<br/><br/>He spoke casually, as if the position in the Dao Sect had already been destined for him.<br/><br/>“It doesn’t necessarily have to be grandiose; it mainly needs to reflect your Dao. This is about future discipleship. As long as your lineage is strong enough, even if you choose the most ordinary title, it will still resonate through the heavens,” calmly stated Xu Qiuming. The fighting spirit in his eyes grew stronger as he sensed the numerous powerful Sword Intents.<br/><br/>With Fang Wang attracting so many Great Cultivators to come and pledge allegiance, how powerful had he become now?<br/><br/>Fang Wang, cultivating within the mist of Ling Wu, was unaware of the arrival of Xu Qiuming and Gu Li. He was deeply focused on cultivation, with no mind to spare for others.<br/><br/>Since the establishment of Wangdao, every day saw new disciples joining. Whenever a powerful rival attacked, Fang Wang didn’t need to lift a finger, so he was able to cultivate in peace.<br/><br/>Five years had passed since the Sword Immortal had challenged him.<br/><br/>In those five years, he had come increasingly close to the fifth level of the Heaven-Breaking Realm.<br/><br/>No matter how tumultuous and earth-shattering the noise within Sword Heaven Marsh was, he remained unmoved, wholly devoted to seeking the Way.<br/><br/>Time swiftly flowed by in the process of Fang Wang’s cultivation until suddenly, a strong aura disturbed him.<br/><br/>He opened his eyes and looked, a trace of surprise flashing in his gaze.<br/><br/>He saw two figures in the sky above Sword Heaven Marsh colliding wildly, moving so fast that mere mortals couldn’t catch them with the naked eye. The two individuals were casting Spells with extreme speed, and the phenomena formed by Spiritual Power blossomed constantly in the air.<br/><br/>A golden light layer rose within Sword Heaven Marsh, protecting the land.<br/><br/>Two Sky-Stepping Realm Cultivators!<br/><br/>Fang Wang raised his eyebrows. Decades ago, it would have been difficult for him to encounter even one Sky-Stepping Realm Cultivator, but now two of them had come to his domain to duel, staying far above the ground and clearly showing respect for Sword Heaven Marsh, which was very sensible of them.<br/><br/>At this moment, Hong Chen emerged from the Ling Wu behind him and walked up to stand behind him.<br/><br/>“Your fate has arrived. I didn’t expect a reincarnated Great Emperor to come and join you!” said Hong Chen, his voice tinged with excitement.<br/><br/>A reincarnated Great Emperor?<br/><br/>Fang Wang was stunned for a moment, then suddenly remembered something.<br/><br/>That’s right, the Ghost Emperor had mentioned sending a reincarnation of a Great Emperor to assist him.<br/><br/>He had nearly forgotten about it.<br/><br/>He focused his gaze, trying to determine which one was the reincarnated Great Emperor.<br/><br/>Soon, one of them convinced him that they were indeed the reincarnation of a Great Emperor!<br/><br/>“This Emperor is no ordinary person. Could it be him…?” murmured Hong Chen.<br/><br/>Looking at the Firmament, Fang Wang asked, “Who is it?”<br/><br/>“The Divine Emperor of the Grand An Divine Dynasty. This person is the son of the last emperor of the Grand An Divine Dynasty, the An Tian Emperor. During the Grand An Divine Dynasty’s battle with The Upper Realm, he once fought his way into The Upper Realm and caused quite a stir,” whispered Hong Chen.<br/><br/>The An Tian Emperor?<br/><br/>The father of the Ghost Emperor?<br/><br/>So the imperial title of the Grand An Divine Emperor was “An Tian”.<br/><br/>Fang Wang inwardly marveled. To think that among the children of An Tian Emperor, there were two Great Emperors, which made him more curious about the Grand An Divine Dynasty.<br/><br/>One could hardly imagine how strong the Grand An Divine Dynasty was when it was destroyed.<br/><br/>“The Divine Emperor was born with a celestial phenomenon, a golden light burst forth from his body, penetrating the barriers between two realms, alarming The Upper Realm. It was his birth that brought calamity to the Grand An Divine Dynasty. Ultimately, he perished in The Upper Realm, and who would have thought his soul would reincarnate,” uttered Hong Chen with emotion.<br/><br/>Upon hearing this, Fang Wang felt a surge of excitement in his heart.<br/><br/>This Emperor had such an extraordinary background!<br/><br/>Fang Wang looked attentively. The reincarnated Divine Emperor wielded a Peach Wood Sword in battle. He did not gather any spirit creatures, nor did he use any powerful Magical Artifacts. No matter what supreme techniques his opponent utilized, he always countered with a single sword strike, appearing as calm as a breeze and as light as a cloud.<br/><br/>The two seemed as though they were not combatants of the same realm!\t\t\t\t\t\t</div>", "images": {}, "success": true}