{"id": 334, "url": "https://www.novelhall.com/i-became-an-immortal-on-mortal-realm-32879/14876233.html", "title": "Chapter 324 - Chapter 324 Chapter 321: The Dao Sect Philosophy, The Greatest In Ten Thousand Years", "volume": 4, "volume_title": "Volume 4", "body": "<h1>Chapter 324 - Chapter 324 Chapter 321: The Dao Sect Philosophy, The Greatest In Ten Thousand Years</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 324 Chapter 321: The Dao Sect Philosophy, The Greatest in Ten Thousand Years<br/><br/>In the room, Jiang Shenming sat at the table, his body trembling slightly, and cold sweat seeped from his face, making the atmosphere oppressively tense.<br/><br/>Standing behind him, Fang Wang held a rigid posture, completely still, his gaze unnervingly calm.<br/><br/>After a long ten breaths, Jiang Shenming still couldn’t break free, his face turning beet red with utter frustration.<br/><br/>He could accept losing to Fang Wang, having learned of Fang Wang’s combat achievements, he was certain he wasn’t his match.<br/><br/>But he couldn’t accept the humiliation of his defeat!<br/><br/>The other party had held him down with just one hand!<br/><br/>And didn’t let a single bit of his energy leak!<br/><br/>Even a True Soul Realm Great Cultivator couldn’t achieve this feat.<br/><br/>Upon seeing his complexion, Song Jinyuan couldn’t help but speak up, “Dao Friend Jiang, won’t you relent? The stronger Master of Dao of Hope becomes, the more worth following he is, isn’t he?”<br/><br/>Hearing this, the previously angry Jiang Shenming calmed down.<br/><br/>He had nearly forgotten his original intent.<br/><br/>He exhaled, finding that as his body relaxed, the pressure exerted by Fang Wang actually lessened.<br/><br/>This…<br/><br/>He couldn’t help but turn to look at Fang Wang, who was staring at him and said, “You are indeed strong, but in the future, you will be the master of the Dao Sect, representing the lineage of the Dao of Hope. You must bear the heart capable of embracing thousands of disciples. Whether you become a saint or an emperor, you need to possess such magnanimity.”<br/><br/>Jiang Shenming’s previous attitude in the battle with the man in black had left Fang Wang somewhat worried about his future as the master of the Dao Sect, so he took this opportunity to give him a pounding reminder.<br/><br/>“Saintly Emperor certification? You think I can achieve that?” asked Jiang Shenming, surprised.<br/><br/>Song Jinyuan looked at Fang Wang with equal surprise.<br/><br/>Such high praise!<br/><br/>It had been many years since a Great Saint or a Great Emperor had emerged in the Mortal Realm—these were beings of legend.<br/><br/>Hearing Jiang Shenming’s words, Fang Wang realized that the rascal didn’t know he was the reincarnation of a Great Emperor.<br/><br/>On second thought, that was also right, after all, Emperor Shenming had once caused an uproar in The Upper Realm, offending powers there, and the Ghost Emperor naturally feared revealing his identity.<br/><br/>If it weren’t for Hong Chen by Fang Wang’s side, he wouldn’t have known of Jiang Shenming’s identity, only that there was a connection with the royal family of the Grand An Divine Dynasty.<br/><br/>“Of course, you can. Do you not have this confidence? Dao of Hope’s purpose isn’t to vie for power or influence, but to pursue a path of cultivation that seeks truth and advancement together. In my eyes, all twelve Dao Sects have the potential to reach Saintly Emperor Certification. Hence, I value potential and character over sheer strength,” Fang Wang said calmly.<br/><br/>Jiang Shenming was stunned.<br/><br/>Fang Wang let go, then took a seat opposite him, gesturing for Song Jinyuan to sit as well.<br/><br/>Fang Wang personally poured a cup of tea for Jiang Shenming and said, “Your talent should not be limited to your physique. In our previous exchange, I could feel that you were holding back. There’s a powerful force within you. A typical True Soul Realm cultivator would likely be no match for you. I am willing to accept you into the Dao of Hope, to let you establish the Divine Sect, but you need to carefully consider what the Divine Sect will teach.”<br/><br/>To become one of the twelve Dao Sects, you must be generous to your disciples and not overly guarded against disciples from other Dao Sects. Of course, I will also be generous to you. I can teach you a Body Cultivation Technique beyond the Vajra Invincible Saint Body, which I created based on the Vajra Invincible Saint Body.”<br/><br/>Jiang Shenming was still surprised by Fang Wang’s philosophy for his Dao Sect when he suddenly heard that Fang Wang also knew the Vajra Invincible Saint Body, and his eyes widened in disbelief.<br/><br/>Fang Wang didn’t explain further and directly stimulated the Yang Energy within his body, turning his pupils golden and strands of Yang Energy seeping out from his body.<br/><br/>Jiang Shenming’s pupils dilated suddenly.<br/><br/>Such potent Yang Energy!<br/><br/>Even his father, who had been hailed as the strongest genius of their family for ten thousand years, did not possess such powerful yang energy.<br/><br/>“How did you…” Jiang Shenming asked with a trembling voice.<br/><br/>Fang Wang smiled and said, “I have naturally received a legacy. Your decision to join the Dao of Hope should be based on more than just hearing my name. Surely, there must be a force guiding you in the dark, right?”<br/><br/>Jiang Shenming felt a storm surge in his heart, and his eyes filled with reverence when he looked at Fang Wang.<br/><br/>Song Jinyuan, however, could not understand. But he was not confused, for Fang Wang was no longer an existence he could comprehend.<br/><br/>Jiang Shenming took a deep breath and said, “I understand. Then my Divine Sect will not focus on body cultivation. I will pass on my divine cultivation.”<br/><br/>“Divine cultivation?”<br/><br/>The one who replied was Song Jinyuan, who was quite interested.<br/><br/>Jiang Shenming said with a proud smile, “Since I was born, my dreams have been longer than others. A single night’s dream can last a thousand years. In my dreams, it’s as if I am going through cycles of reincarnation. I have fused the cultivation from each life in my dreams to create my divine path of cultivation. I’ve already established a complete system. If I had lived in the ancient times, I would surely have become a great saint.”<br/><br/>Song Jinyuan looked skeptical but did not speak disrespectfully.<br/><br/>Fang Wang said with a smile, “Let’s wait and see what happens. After the Sword Sect is established, the Divine Sect will be born as well. There is no ranking among the Twelve Dao Sects; they are all equal in status, and there will be no distinction between strong and weak in the future. I will disband a Dao Sect not because it is too weak, but only if it violates the Dao of Hope’s moral principles. So, I hope you won’t overemphasize comparisons in the future. The disciples’ character is more important.”<br/><br/>Jiang Shenming found Fang Wang to be frighteningly correct and wondered if he was putting on an act.<br/><br/>Regardless, he would join the Dao of Hope first!<br/><br/>“I will remember that,” Jiang Shenming said solemnly.<br/><br/>You are the Dao Master, you have the final say!<br/><br/>Fang Wang was very satisfied with Jiang Shenming’s attitude and looked forward to the day when the Twelve Divine Sects would come together.<br/><br/>Afterward, the two of them began to chat leisurely. Jiang Shenming was very interested in Fang Wang’s exploits of sweeping across the seven Saint Clans. Although those clans were not as powerful as his own Jiang family, the incident had a profound impact and had also sparked a heated debate within his family.<br/><br/>As for boasting… Fang Wang was quite good at that, and he hadn’t boasted in many years. Facing a reincarnated Great Emperor, he was in the mood to indulge.<br/><br/>Over the next ten or so years, the Sword Sect’s selection officially began. Due to the large number of cultivators participating, it was difficult to make selections within days or months, so the event lasted for three years without conclusion.<br/><br/>This selection became the most grandiose event on the Descending Dragon Continent in ten thousand years. Under the arrangements of Dugu Wenhun and Hong Chen, the skies above Grand Qi turned into a battlefield for sword cultivators. With the Dao of Hope formations sealing off the area, the common people of Grand Qi could lift their heads to witness battles akin to those of immortals. This further solidified the Dao of Hope’s formidable reputation in the hearts of the people.<br/><br/>From the beginning to the end, Fang Wang had not made an appearance, but tales of him guiding cultivators in their cultivation often emerged from Sword Heaven Marsh. It was said that Fang Wang taught the Dao to people regardless of their cultivation level or background, choosing only by fate, which made the image of the Dao Master even more towering.<br/><br/>In the blink of an eye, seventeen years had passed since Jiang Shenming became a disciple of Fang Wang.<br/><br/>Fang Wang’s cultivation level had also risen from the fourth layer of the Heaven-Breaking Realm to the sixth layer.<br/><br/>On this day.<br/><br/>Atop Kunlun, on a cliff, Fang Wang stood shoulder to shoulder with Gu Li.<br/><br/>The spring breeze fluttered their robes and hair. Fang Wang smiled and said, “You have been back for seventeen years, but this is our first time alone together.”<br/><br/>He glanced at Gu Li’s delicate profile, recalling the memories of their past interactions.<br/><br/>For him, that was a hundred thousand years ago, and many of the memories had become blurred.<br/><br/>Gu Li glanced at him but quickly looked away when their eyes met. She asked, “Has the Sword Sect been selected? Why do those sword cultivators who failed still get to display their Sword Dao?”<br/><br/>Fang Wang chuckled softly and said, “If we were to judge the Sword Sect based on strength, what would make it different from any ordinary sect?”\t\t\t\t\t\t</div>", "images": {}, "success": true}