{"id": 330, "url": "https://www.novelhall.com/i-became-an-immortal-on-mortal-realm-32879/14874279.html", "title": "Chapter 320 - Chapter 320 Chapter 317: Sword Spirit Physique, Xuan You Great Teaching_1", "volume": 4, "volume_title": "Volume 4", "body": "<h1>Chapter 320 - Chapter 320 Chapter 317: Sword Spirit Physique, Xuan You Great Teaching_1</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 320 Chapter 317: Sword Spirit Physique, Xuan You Great Teaching_1<br/><br/>“How could the Heavenly Palace appear? Could it be because…”<br/><br/>Fang Wang thought in astonishment. This was the first time the Heavenly Palace had actively appeared in his Treasured Spirit Space.<br/><br/>Ghostly Divine Sword Qi was absorbing the soul of the Sword Immortal, and the Heavenly Palace, stationed within the Treasured Spirit Space, suddenly threw open its gates, letting out a ghostly wind.<br/><br/>As the Sword Immortal’s soul was drawn into Fang Wang’s body, a beam of light was peeled off and entered the Heavenly Palace, after which the palace closed its gates and vanished.<br/><br/>The whole process was only perceptible to Fang Wang; the masses beneath the golden layer of light could not see it, their gazes all fixed on the body of the Sword Immortal.<br/><br/>As his lifeforce completely dissipated, his physical form turned to ash and scattered with the wind.<br/><br/>The previously god-like Sword Immortal might no longer exist, but his strength was still profoundly shocking to everyone in Sword Heaven Marsh.<br/><br/>Their swordsmanship, as if splitting heaven and earth, was magnificent, a sight they would never forget for the rest of their lives.<br/><br/>Fang Wang sheathed the Rainbow Sword, and the ghostly specter behind him disappeared.<br/><br/>The Sword Immortal’s might, built upon the Nine Extremes Blood Sacrifice Technique, surpassed that of the Unrighteous True Buddha in Spiritual Power, but his real combat strength might not necessarily have been enough to defeat the Unrighteous True Buddha.<br/><br/>He lacked the signature moves of Celestial Qiankun!<br/><br/>As he descended, Dugu Wenhun immediately transmitted a message to all the Disciples of the Way of Hope who had formed the formation, instructing them to dissolve it. The golden layer that covered the Descending Dragon Continent rapidly dissipated.<br/><br/>Boom!<br/><br/>The entire Sword Heaven Marsh was abuzz with excitement, and the clamor shook the heavens!<br/><br/>“So strong! No wonder he dares to call himself a Sword Immortal.”<br/><br/>“Sadly, the Dao Master was known as the Sword Saint before he attained the title of Heavenly Dao!”<br/><br/>“Indeed, the Sword Intent of both is far beyond our imagination. Prior to this, I couldn’t have imagined sword intent could be so powerful.”<br/><br/>“The fact that the Dao Master can slay that Sword Immortal with a single strike is truly frightening, it reveals a great gap between the two.”<br/><br/>“Nonsense, our Dao Master is not only the world’s number one talent but also the true number one. Who can force him to exert his full strength?”<br/><br/>The Disciples of the Way of Hope were greatly inspired, and the cultivators who had come to watch the commotion at the Sword Sect were equally excited. Having witnessed such a battle, they felt their horizons had been broadened, and it would become their proudest anecdote to share.<br/><br/>Fang Wang then returned to the loft where he resided, closing the door behind him. No one else dared to disturb him rashly.<br/><br/>He sat down on the bed to meditate, closed his eyes, and directed his thoughts into the Treasured Spirit Space.<br/><br/>He wanted to search for the Heavenly Palace but couldn’t catch even a glimpse. Just as he was about to give up, his consciousness was suddenly yanked, and when he opened his eyes again, he was astonished to find himself standing in the grand hall of the Heavenly Palace.<br/><br/>He really made it inside!<br/><br/>This time, he hadn’t practiced any ultimate arts!<br/><br/>Fang Wang looked around, and suddenly, specks of light appeared in front of him. They swiftly coalesced into the Sword Immortal’s silhouette.<br/><br/>As expected, he had been drawn here by the Sword Immortal’s silhouette.<br/><br/>For some reason, upon seeing that silhouette within the Heavenly Palace, his instincts urged him to draw closer.<br/><br/>He did not resist his instincts and stepped forward. As he reached the silhouette, it directly shattered and flowed into his body.<br/><br/>In an instant, a vast expanse of memory flooded into his mind.<br/><br/>All of them were the memories of the Sword Immortal!<br/><br/>The memories flashed rapidly, but fortunately, his cultivation was profound enough that he didn’t collapse under the onslaught.<br/><br/>After a while.<br/><br/>Fang Wang finally fused with the memories. He slowly opened his eyes, a hint of melancholy in his gaze.<br/><br/>He had not expected the Sword Immortal to have such a past. Previously, he had thought the Sword Immortal must have been the favored child of some great family, a natural-born genius with immense cultivation. But it turned out that the Sword Immortal’s destiny was fraught with hardships, and he had reached today’s heights only after enduring innumerable sufferings.<br/><br/>Moreover, Fang Wang had played a significant role in the Sword Immortal’s life.<br/><br/>Fang Wang didn’t remember him, but he had always taken Fang Wang as his goal.<br/><br/>Even the Sword Immortal once greatly admired Fang Wang, but this admiration was replaced by hatred after the death of his wife and two younger brothers.<br/><br/>Apart from feeling emotional about the Sword Immortal’s destiny, Fang Wang was also surprised by the Sword Immortal’s Lifespirit Treasure.<br/><br/>That light and shadow was practically another Heavenly Palace!<br/><br/>Moreover, the light and shadow spared the Sword Immortal from the dull torment of time, though of course, it couldn’t compare to the Heavenly Palace. At least it was only suitable for the Sword Dao and couldn’t help its master in cultivating other methods.<br/><br/>Now, Fang Wang had fused with the light and shadow, and from today onwards, he would possess the same talents as the Sword Immortal!<br/><br/>This kind of light and shadow was like his Tianling Body, having a name of its own.<br/><br/>Sword Spirit Physique!<br/><br/>In other words, Fang Wang now possessed the tenth Lifespirit Treasure!<br/><br/>And this meant that Fang Wang could own even more such treasures in the future!<br/><br/>Fang Wang took a deep breath, suppressing the surprise in his heart.<br/><br/>The Sword Spirit Physique would help him quickly master the ultimate arts of swordsmanship in the world. He would then use the Heavenly Palace to integrate them, inevitably creating swordsmanship ultimate arts that surpassed those of the Upper Realm!<br/><br/>“Since I’ve come in, then this is just the right…”<br/><br/>Fang Wang thought so, but as the thought emerged, the Heavenly Palace suddenly shattered, and he was forcibly expelled from it.<br/><br/>He opened his eyes to find himself back in reality.<br/><br/>What a pity!<br/><br/>He still had not fully mastered the Heavenly Palace.<br/><br/>Fang Wang’s eyes grew sharp as a Ghost Divine Body appeared in front of him.<br/><br/>With a single thought, the soul of the Sword Immortal emerged from within the Ghost Divine Body.<br/><br/>The soul of the Sword Immortal couldn’t help but open his eyes, looking around in confusion. When he saw Fang Wang, he was startled, thinking that he had not died after all. But when he looked down, his expression changed dramatically.<br/><br/>His face showed a complex mixture of emotions: there was regret, loneliness, anger, hatred, and a hint of resignation.<br/><br/>Fang Wang did not disturb him, allowing him to come to terms with everything.<br/><br/>The Sword Immortal looked up at him and asked, “Why did you keep my soul?”<br/><br/>Fang Wang calmly replied, “My understanding of the Nine Extremes Blood Sacrifice Technique is higher than yours, which is why I could preserve your soul. But your life has ended, there’s no chance of revival. Follow the order of reincarnation and be reborn, I wish you a good life in the next world.”<br/><br/>Upon hearing this, the Sword Immortal burst into laughter.<br/><br/>He laughed with self-ridicule, laughed helplessly.<br/><br/>“I don’t want to be reborn. Just absorb my soul. I can feel your Sword Intent can devour souls to strengthen yourself, perhaps you came to have sympathy for me after accessing my memories, but I think it’s not necessary,” said the Sword Immortal while staring at Fang Wang earnestly.<br/><br/>After some thought, Fang Wang said, “I will give you time to think. Don’t rush; if you wish to be reborn, I have ways to ensure you have a good rebirth.”<br/><br/>With that, he didn’t wait for the Sword Immortal’s answer and had the Ghost Divine Body devour the Sword Immortal.<br/><br/>A Lifespirit Treasure at the Great Perfection stage like the Executioner Immortal Ghost God Sword could freely control absorption; if it had been any other legacy, once the Ghost Divine Body swallowed a soul, it would be nearly impossible to spit it back out.<br/><br/>He could keep the Sword Immortal within the Ghost Divine Body, giving him time to think it over.<br/><br/>With the Ghost Divine Body dissipating, Fang Wang spoke, “Come in.”<br/><br/>Hong Chen had been waiting in the courtyard, and the bustle of Sword Heaven Marsh was only just beginning.<br/><br/>Soon, Hong Chen pushed the door open. After closing the door behind him, he turned around with a smile and said, “I guessed that this battle couldn’t have injured you and that you must have gained some insight, so here I am.”<br/><br/>Fang Wang looked at him and asked, “Do you know of Sword Ghost Great Saint?”<br/><br/>Hong Chen nodded and replied, “I do, he comes from the Xuan You Great Teaching!”\t\t\t\t\t\t</div>", "images": {}, "success": true}