{"id": 336, "url": "https://www.novelhall.com/i-became-an-immortal-on-mortal-realm-32879/14877676.html", "title": "Chapter 326 - Chapter 326 Chapter 323: Inescapable Fate, On The Verge Of Death", "volume": 4, "volume_title": "Volume 4", "body": "<h1>Chapter 326 - Chapter 326 Chapter 323: Inescapable Fate, On The Verge Of Death</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 326 Chapter 323: Inescapable Fate, On the Verge of Death<br/><br/>After arriving at the Grand Yu Divine Dynasty’s Imperial Palace, Fang Wang didn’t return to his own Pilgrimage Manor but followed Zhui Feng to visit Emperor Hong Shou.<br/><br/>Inside Hong Shou’s sleeping quarters, many ministers and cultivators gathered, and Hong Xian’er was also there.<br/><br/>Upon seeing Fang Wang, the dim light in Hong Xian’er’s eyes instantly brightened.<br/><br/>Fang Wang nodded to everyone and then walked over to the bed. Hong Shou had become as thin as a dried corpse. At first glance, it was quite shocking; his eyes were bulging, and it seemed like only skin and bones remained, without a trace of flesh.<br/><br/>When Hong Shou saw Fang Wang, he managed to show a difficult smile and said weakly, “Fang Wangdao, you have finally come back…”<br/><br/>Fang Wang furrowed his brow.<br/><br/>With his mastery of the Yin Yang Xuan Ming Zhen Gong, he could instantly see Hong Shou’s remaining lifespan.<br/><br/>Less than one year!<br/><br/>How could this be?<br/><br/>Although Hong Shou was already nearing his life’s end and could not live for hundreds of years, it didn’t add up to having less than a year of life remaining.<br/><br/>He looked closely at Hong Shou, trying to see if his soul had been damaged.<br/><br/>Unfortunately, he couldn’t discern the cause of the illness.<br/><br/>Fang Wang asked, “Your Majesty, how are you feeling?”<br/><br/>Hong Shou replied with a forced smile, “Recently, I haven’t been feeling as bad, but I fear that my days are numbered… However, I have already taken care of my affairs, so you need not worry too much… The real calamity of the Grand Yu Divine Dynasty is only beginning… Rather than saving me, you must be more careful not to get involved with this kind of disaster…”<br/><br/>Upon hearing this, Fang Wang’s heart couldn’t help but sink.<br/><br/>Hong Xian’er stepped forward and said, “That’s right, the real catastrophe is just starting. Those hidden enemies will surely launch a full-scale attack on the Grand Yu Divine Dynasty.”<br/><br/>Emperor Tao spoke up from the side, “Fang Wangdao, knowing this is actually enough. Your urgent priority is to cultivate earnestly at the Pilgrimage Manor and become as strong as possible so that you can protect the people of the Grand Yu Divine Dynasty. As for the current epidemic, we will find a way to contain it.”<br/><br/>The other ministers took turns advising him. They would not question Fang Wang; they too regarded him as their greatest hope.<br/><br/>After the battle with the Buddhist Sect, Fang Wang had already proven to be a top-tier power, demonstrating his strength.<br/><br/>Fang Wang was not one to put on airs; he nodded in agreement.<br/><br/>He talked with Hong Shou for a few more sentences before leaving, with Hong Xian’er following him.<br/><br/>Hong Shou tilted his head, watching Fang Wang leave the sleeping quarters.<br/><br/>After a long time.<br/><br/>He asked, “My lords… Do you think… Fang Wang can help the Grand Yu Divine Dynasty overcome this tribulation…”<br/><br/>His tone was full of anxiety, for even in death, he didn’t want to see the Grand Yu Divine Dynasty destroyed.<br/><br/>Zhui Feng replied, “Fang Wangdao’s strength is enough to sweep through the True Soul Realm. There aren’t many in the Mortal Realm with the power of Celestial Qiankun, and he hasn’t made a move in decades; his strength must have surely soared.”<br/><br/>At these words, the others began to express their sentiment.<br/><br/>Even though Fang Wang had just appeared before them, recalling his achievements still felt unbelievable.<br/><br/>They couldn’t imagine how Fang Wang managed it!<br/><br/>They all were looking forward to Fang Wang, so what they said was to comfort Hong Shou, gradually easing the worry from his face.<br/><br/>Elsewhere.<br/><br/>Hong Xian’er accompanied Fang Wang back to the Pilgrimage Manor. Fang Wang stopped in his tracks, glanced at Hong Xian’er, and asked, “What now? You’re not going to cultivate but instead you follow me? A man and a woman alone together is not appropriate.”<br/><br/>Hong Xian’er glared at him and huffed, “So what? Do you dare do anything to me?”<br/><br/>“That’s hard to say; I’ve recently been practicing a sinister art, and have many wicked thoughts—be careful I don’t play the overbearing king.”<br/><br/>“Who’s the overbearing king? Why play the king?”<br/><br/>“It’s just that…”<br/><br/>Fang Wang was flustered by her, suddenly at a loss for words.<br/><br/>Hong Xian’er stepped forward, her forehead nearly touching his nose, a fresh scent wafted into his nostrils, making him inexplicably want to smell more.<br/><br/>“Hmph, how far have you and your Gu Shimie developed?” Hong Xian’er asked.<br/><br/>Fang Wang’s eyes widened as he stepped back, feigning shock, “You actually sent someone to Sword Heaven Marsh to be a spy!”<br/><br/>Hong Xian’er snorted, “You are the Master of Dao of Hope; many are watching you. Seeing you go up to Kunlun with a woman—now that’s a rarity.”<br/><br/>“Fine, we just chatted about poetry and scenery, nothing more.”<br/><br/>“Really?”<br/><br/>“If there’s no trust in a person’s heart, no matter what I say, you won’t believe it.”<br/><br/>“Tch, I won’t tease you anymore. Ever since Tai You fought you, she hasn’t come looking for me. But some time ago, she sent me a message, saying that the Grand Yu Divine Dynasty is unavoidable doom, with forces from The Upper Realm pushing this calamity. She told me to remind you not to get involved in any karma during this tribulation,” Hong Xian’er said seriously.<br/><br/>Fang Wang squinted and asked, “What? Is she trying to make amends?”<br/><br/>Hong Xian’er nodded, “That seems to be the case, otherwise I can’t think of any motive for her to say this.”<br/><br/>So it seems Tai You and Sword You have nothing to do with the catastrophe of the Grand Yu Divine Dynasty?<br/><br/>Are they just trying to take advantage of the situation to possess Hong Xian’er’s body?<br/><br/>Fang Wang fell into deep thought.<br/><br/>Hong Xian’er quietly watched him, the breeze gently sweeping the courtyard, both of them standing in silence.<br/><br/>After a long while.<br/><br/>Fang Wang looked at Hong Xian’er, “When you have time, help me bring Xiao Zi over.”<br/><br/>Hong Xian’er came back to her senses and nodded, “I will.”<br/><br/>With that, she disappeared from the courtyard.<br/><br/>Fang Wang curled his lips, muttering to himself, “All that ferocity, and she just runs off?”<br/><br/>He then chuckled and walked towards his cultivation hall, ready to focus on his practice.<br/><br/>The sixth layer of the Heaven-Breaking Realm was not enough, Fang Wang desperately wanted to reach the Divine Passage Realm!<br/><br/>Qi Cultivation nine layers, Spiritual Refinement, Spirit Pill, Mystic Heart, Condensation, Crossing Void, Golden Body, Mahayana, Nirvana, Heaven Breaking, Divine Skills, Ascend Beyond, True Soul, Celestial Qiankun!<br/><br/>He was still far from Celestial Qiankun and must seize the time to enhance his cultivation level.<br/><br/>Always fighting beyond his realm wasn’t right!<br/><br/>He too wanted to bully the Heaven-Breaking Realm talents with the strength of Celestial Qiankun.<br/><br/>Boom, rumble—<br/><br/>Rolling thunder clouds churned incessantly, the sound of thunder like a chorus of dragons growling, making heaven and earth oppressive.<br/><br/>Below was a range of mountains, rivers of lava cutting through the wilderness as if the earth was split open, the air between heaven and earth filled with visible wisps of soot.<br/><br/>As far as the eye could see, there were figures meditating everywhere along the edges of the lava, all clad in uniform black robes adorned with a pattern of the six paths of reincarnation on their backs, wearing white masks that only revealed their eyes. Under the dim firmament, they looked like so many fierce ghosts.<br/><br/>Atop a mountain peak.<br/><br/>Extremely Evil Old Immortal walked to the cliff’s edge, looking towards a nearby figure, he asked, “What’s the origin of these people? Why have I never encountered their aura before?”<br/><br/>Standing next to him was an old man dressed in a blue robe with a very long hem trailing on the ground. He held a horsetail whisk in his hand, his long beard flowing. Crane-white hair coiled beneath a jade crown, his face appearing to be in his fifties, with bright, spirited eyes.<br/><br/>“I cannot tell you their origin. Your time is running short, why have you come to see me?” the blue-robed old man glanced at Extremely Evil Old Immortal, asking indifferently.<br/><br/>Extremely Evil Old Immortal chuckled, “True, my time is running out, but before I die, I want to leave something for my disciple.”<br/><br/>“What? Will someone as evil as you actually pity your disciple?”<br/><br/>“Perhaps it’s the rare kindness of a dying man. I have tormented my disciple too much, but the thought that he’s the only one in the world to inherit my mantle makes me fear his death at the hands of others. I can torment him all I like, but I won’t allow others to humiliate him,” Extremely Evil Old Immortal snorted.\t\t\t\t\t\t</div>", "images": {}, "success": true}