{"id": 338, "url": "https://www.novelhall.com/i-became-an-immortal-on-mortal-realm-32879/14882033.html", "title": "Chapter 328 - Chapter 328 Chapter 325: Demon Sword Chaos, Sharira Resurrection", "volume": 4, "volume_title": "Volume 4", "body": "<h1>Chapter 328 - Chapter 328 Chapter 325: Demon Sword Chaos, Sharira Resurrection</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 328 Chapter 325: Demon Sword Chaos, Sharira Resurrection<br/><br/>After communing with Hong Chen, Fang Wang continued to seclude himself for cultivation.<br/><br/>Hong Chen assured him that he could focus on his practice, promising to handle everything. If enemies seriously threatened to attack, he would calculate it in advance and inform him.<br/><br/>In the time that followed, the Imperial Palace’s Kunlun Formation was activated from time to time, and more and more Wangdao Cultivators descended upon the Grand Yu Divine Dynasty.<br/><br/>These Wangdao Cultivators wielded special Talisman Paper, saving those stricken by misfortune everywhere. In less than three years, the name of Wangdao spread to every corner of the Grand Yu Divine Dynasty. The New Emperor further decreed Wangdao to be the saintly way of the Grand Yu Divine Dynasty, catapulting their fame to its zenith.<br/><br/>With the actions of Wangdao, the dark clouds looming over the Grand Yu Divine Dynasty finally dispersed.<br/><br/>Yet, the common people of the Grand Yu Divine Dynasty knew that a war of unparalleled scale was imminent!<br/><br/>More and more dynasties, sects, and noble families started to sever ties with the Grand Yu Divine Dynasty. Messages poured into the Imperial Palace, like the forewarning signals of approaching war.<br/><br/>On this day,<br/><br/>Fang Wang stepped out of his door, and upon entering the courtyard, he happened to see Zhao Zhen admiring a Shariputra in the pond.<br/><br/>Unable to resist, he asked with a smile, “After all these years, you still haven’t given up, huh?”<br/><br/>Zhao Zhen turned and replied with a resigned smile, “Anyway, there’s not much else to do. Even if it’s cultivating, I still have to contribute it to that snake.”<br/><br/>Fang Wang began to discuss the Shariputra with Zhao Zhen, asking him what he had observed over the years. He recalled and shared his insights.<br/><br/>The reason Fang Wang came out was primarily to relax for half a day.<br/><br/>For a cultivator of his realm, missing half a day of cultivation didn’t amount to much.<br/><br/>At the same time, he hesitated whether to seek out some legacies, such as the unique techniques of the Dragon Subduing Mountain, the Sword Qi of the Executioner Immortal Great Saint, and so on. But he worried that the journey might cause delays, with no one knowing when the enemy might arrive.<br/><br/>Even if Hong Chen could sense it in advance, the lead time would not total many days.<br/><br/>Of course, there was no real need for him to pursue these legacies. His current strength was formidable. With his Extinction Divine Force combined with his Heavenly Gang Supreme Yang Tyrant Body, he was confident he could sweep away any opponents beneath the Celestial Qiankun Realm.<br/><br/>As for facing the Celestial Qiankun, he would have to employ every technique without holding back!<br/><br/>The Jiuyou Zizaishu was his greatest trump card!<br/><br/>The Jiuyou Zizaishu was not merely a means of escape; it could also become a killing stroke in battle.<br/><br/>The amount of time spent in the Heavenly Palace might not determine the value of a technique. Those that required longer time to master either encompassed numerous methods, like the Heavenly Emperor Imperial Mirror and the Mie Jue Divine Tome, or involved understanding the true essence of heaven and earth or one’s own fateful limits, like the Immeasurable Pure Bone Technique and the Nine Extremes Blood Sacrifice Technique. Although the Jiuyou Zizaishu primarily allowed for traversal and etherealness without significant destructive power, its practical effects were formidable.<br/><br/>While listening to Zhao Zhen’s account, Fang Wang pondered over his own ultimate techniques.<br/><br/>Elsewhere,<br/><br/>The Imperial Palace’s Kunlun Formation was activated once more, and one after another, figures stepped out of it. Leading them was Xu Qiuming.<br/><br/>Following Xu Qiuming was Lü Xianming, the once foremost prodigy of the Emperor Sea. Lü Xianming gazed at the resplendent Imperial Palace with eyes full of curiosity.<br/><br/>The Imperial Palace of the Emperor Sea Mysterious Dynasty was no match for the Imperial Palace of the Grand Yu Divine Dynasty.<br/><br/>No sooner had they emerged from the formation than an Imperial Palace General approached to greet them.<br/><br/>“We’ve heard that a Demon Sword has appeared in the Grand Yu Divine Dynasty and have specially come to subdue it,” Xu Qiuming declared.<br/><br/>The Imperial Palace General nodded, “His Majesty has already ordered us to deal with this. I will personally take you there. The Demon Sword is becoming more uncontrollable by the day. Apart from the chaos it causes on its own, the number of cultivators who have died fighting over it is also increasing. We must subdue it at the earliest.”<br/><br/>Xu Qiuming asked in surprise, “Aren’t there many Great Cultivators within the Grand Yu Divine Dynasty, including powerful Sword Cultivators? Why seek the help of Wangdao Sword Sect?”<br/><br/>“The sword possesses a power that even those in the Sky-Stepping Realm can hardly subdue. Its Sword Spirit said that it must be subdued by Sword Intent. Since you are from the Wangdao Sword Sect, perhaps your cultivation might not be considered first-rate in the Mortal Realm, but your understanding of Sword Intent and Sword Dao has already garnered acclaim. That’s why His Majesty has requested your help,” the Imperial Palace General explained.<br/><br/>Wangdao’s reputation was immense, and in recent years, it had grown even more so within the Grand Yu Divine Dynasty. Placed just below Dao Master Fang Wang, the Twelve Dao Sects naturally became the focus of the world’s attention.<br/><br/>Upon hearing this, Xu Qiuming narrowed his eyes and said, “A power that even the Sky-Stepping Realm cannot subdue? Now that has piqued my interest.”<br/><br/>Lü Xianming asked, “Recently, the Grand Yu Divine Dynasty has been facing continuous tribulations. Has this Demon Sword appeared in the past and belonged to the Grand Yu Divine Dynasty, or is it appearing for the first time with no historical records?”<br/><br/>The Imperial Palace General looked at him, his expression grave as he said, “It is appearing for the first time, we are still investigating the origin of this Demon Sword, and for now, we have not yet found any clear information.”<br/><br/>Lü Xianming wanted to ask more, but Xu Qiuming spoke first, “Then let’s go. Our task concerns the Demon Sword, and we are not concerned with other matters. The Mystic Sect of Dao of Observation has already begun their investigation.”<br/><br/>Upon hearing this, the Imperial Palace General couldn’t help but raise his eyebrows.<br/><br/>Out of the Twelve Dao Sects of Observation that were currently established, only the Xuan Zong, Buddhist Sect, Sword Sect, and the Divine Sect had been established. Among these, the Xuan Zong was the most peculiar, not being a sect dedicated to combat. However, in recent years, most of the Wangdao Cultivators who saved the Grand Yu Divine Dynasty were from the Xuan Zong. Now, hearing that the Xuan Zong was also gathering intelligence made the Imperial Palace General very interested in them.<br/><br/>At the same time, he could feel the trust that the Sword Cultivator Xu Qiuming placed in the Xuan Zong.<br/><br/>Who exactly is this person known as Hong Chen?<br/><br/>He stopped thinking about it further and began leading the way.<br/><br/>The sun set and the moon rose.<br/><br/>The sky above the Imperial Palace changed swiftly, a sea of clouds surging, alternating between sunny and overcast.<br/><br/>Until one day.<br/><br/>Fang Wang, who was in the midst of cultivation, suddenly opened his eyes. He arched an eyebrow, a look of surprise flashing across his eyes.<br/><br/>Such powerful Sword Intent!<br/><br/>Fang Wang then felt something and immediately gathered his ghostly deities, and the soul of a Sword Immortal emerged within the body of the ghostly deity.<br/><br/>The Sword Immortal, curled up like a newborn, had not yet opened his eyes.<br/><br/>Not even two breaths had passed since he appeared before he suddenly opened his eyes, turned his head to look outside the window, and murmured to himself, “This Sword Intent…”<br/><br/>“You felt it too?” Fang Wang asked.<br/><br/>The distant Sword Intent made Fang Wang’s own Sword Intent quiver, and so with a move of his mind, he let the Sword Immortal out to feel it.<br/><br/>The Sword Immortal took a deep breath and said, “Yes, it’s a very strong Sword Intent, it makes me have a strong urge to pursue it…”<br/><br/>Fang Wang’s lips curved into a smile as he asked, “How is it? Do you still wish to die now?”<br/><br/>The Sword Immortal landed, took a look at Fang Wang, then turned and walked over to the window.<br/><br/>The sunlight shone on him, making his soul form appear translucent, as though it could vanish at any moment.<br/><br/>“This Sword Intent is even stronger than yours; why don’t you pursue it?” the Sword Immortal asked Fang Wang, his back to him.<br/><br/>Fang Wang replied, “I am not purely a Sword Cultivator, and Sword Dao is not my strongest skill.”<br/><br/>Upon hearing this, the Sword Immortal shuddered all over.<br/><br/>He fell silent.<br/><br/>After a while.<br/><br/>The Sword Immortal then asked, “I do not wish to be reborn, but I wish to come back to life. Could you lend me one of the shariputra in your yard to let me rebuild my physical body?”<br/><br/>Fang Wang raised an eyebrow and asked, “Do you know how to use a shariputra?”<br/><br/>The Sword Immortal turned, glancing at Fang Wang out of the corner of his eye. Bathed in the sunlight, his expression was cold and stern as he softly said, “I once learned a swordsmanship technique which can rebuild a physical body using an object infused with cultivation. Those two shariputra contain a powerful cultivation.”<br/><br/>“I sense not only that supreme Sword Intent, but also many strong Sword Intents from far away are approaching. A great calamity is being born here. By staying here, it seems that the Heavenly Dao is yet again protecting a kingdom.”<br/><br/>“Perhaps I can help you shoulder some of the burden.”\t\t\t\t\t\t</div>", "images": {}, "success": true}