{"id": 335, "url": "https://www.novelhall.com/i-became-an-immortal-on-mortal-realm-32879/14877669.html", "title": "Chapter 325 - Chapter 325 Chapter 322 The Descent Of The Great Mandate Tribulation", "volume": 4, "volume_title": "Volume 4", "body": "<h1>Chapter 325 - Chapter 325 Chapter 322 The Descent Of The Great Mandate Tribulation</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 325 Chapter 322 The Descent of the Great Mandate Tribulation<br/><br/>“Are you referring to talent in the way of the sword?” Gu Li asked curiously.<br/><br/>Fang Wang smiled and said, “Exactly, whoever’s Sword Dao can make the Disciples of the Way of Hope submit and even aspire to emulate, that person can become the master of the Sword Sect.”<br/><br/>Gu Li couldn’t help but say, “I think everyone has already made their choice in their hearts when it comes to sword cultivators.”<br/><br/>“Who?”<br/><br/>“Naturally, you.”<br/><br/>“Ha ha.”<br/><br/>Fang Wang shook his head with a wry smile, his white robes fluttering. His smile had an ethereal quality to it, yet it wasn’t off-putting in the least; at least, it caused Gu Li’s heart to tremble slightly.<br/><br/>Gu Li gave him a sideward glance and said irritably, “What are you laughing at?”<br/><br/>Fang Wang replied with a smile, “Although you speak the truth, I certainly wouldn’t choose myself as the master of the Sword Sect.”<br/><br/>“Your skin is really thick,” she said.<br/><br/>“As a Dao Master, one naturally needs to combine the strengths of the Twelve Dao Sects, understanding a little of each.”<br/><br/>“A little? Your humility is asking for a beating.”<br/><br/>“I’m not being humble; you misheard me,” he said.<br/><br/>Standing atop a cliff, they bantered back and forth, each word from one prompting an uplifted corner of the mouth in the other, making the atmosphere increasingly pleasant.<br/><br/>Time continued to pass.<br/><br/>Two years later, the selection for the master of the Sword Sect finally came to an end. At the same time, the Deputy Dao Master of the Wangdao, Dugu Wenhun, announced the simultaneous establishment of both the Sword Sect and the Divine Sect, with Jiang Shenming, a Cultivator of the Sky-Stepping Realm, as the master of the Divine Sect!<br/><br/>Dugu Wenhun specifically highlighted the Sky-Stepping Realm, causing shockwaves among the various powers of the world; this was a high realm that even the ordinary Holy Clans and Imperial Clans found difficult to attain.<br/><br/>On this day.<br/><br/>In one of the great halls, Fang Wang sat at the head seat. This Dao palace was built over several years by the efforts of Hong Chen and Song Jinyuan. Until the complete construction of Kunlun, it served as the council hall for the Wangdao.<br/><br/>Fang Wang was seated on a jade chair, not luxurious, but emanating an atmosphere of grandeur.<br/><br/>Figures stood in the hall, all of them the higher-ups of the newly founded Wangdao, wielding the authority to govern its order.<br/><br/>Xu Qiuming and Jiang Shenming stood in the center of the hall, both exuding a powerful presence without any intention of reining it in.<br/><br/>Dugu Wenhun stood before the steps, turned to face Xu Qiuming, and said, “Xu Qiuming, with the cultivation of the fifth level of the Nirvana Realm, you’ve created the ‘Selfless Sword Dao’, ‘Three Thousand Divine Swords Technique’, ‘Firmament Extinction Sword’, and so on. Although you’re not the strongest sword cultivator within the Wangdao, your mastery of Sword Dao has been recognized by the Wangdao. We hope the Sword Dao you’ve established will be passed down within the Wangdao and even spread its glory throughout the Mortal Realm.”<br/><br/>“Remember, in the Wangdao, strength is not the key; it’s the contribution to the way of cultivation and to the living beings of the Mortal Realm that are most important.”<br/><br/>Xu Qiuming nodded and said, “I will devote myself to cultivating the Sword Dao and will not be stingy with it.”<br/><br/>Fang Wang revealed a smile and waved his hand, a silver Token flying out from his sleeve. It was a silver Token with ‘Wang’ inscribed on the back and ‘Sword Sect’ on the front.<br/><br/>This was a Wangdao Token forged by Hong Chen, embedding numerous prohibitions, akin to a Magical Artifact.<br/><br/>Xu Qiuming accepted the Dao Sect Token and a smile appeared on his face.<br/><br/>Fang Wang looked at Xu Qiuming, his heart full of emotion.<br/><br/>Indeed, no matter how the path of fate may twist and turn, those who are destined to reach the summit will always shine brightly if they survive.<br/><br/>The speed at which Xu Qiuming’s cultivation level rose was incredibly fast; although he couldn’t keep up with Fang Wang, reaching the fifth level of the Nirvana Realm at his age, which was less than five hundred years, was certainly top-notch in the Mortal Realm.<br/><br/>In these years, Xu Qiuming had shown all his ultimate sword techniques in Grand Qi, winning over countless Cultivators, and even those of higher realms sang praises for him.<br/><br/>Hong Chen also had high praises for him.<br/><br/>Without the fate of Holy Dao, a heart of the sword prevails over heaven!<br/><br/>Dugu Wenhun began to announce Jiang Shenming as the master of the Divine Sect while Hong Chen, Song Jinyuan, Zhu Rulai, The Three Immortals of the Emperor Sea, Yang Du, Zhu Yan, and others watched the scene with smiles.<br/><br/>Yang Du silently cheered himself on, thinking, “I possess the Heavenly Body just like the seniors; I must work hard. This Body Cultivation Sect has to be mine!”<br/><br/>He heard that Jiang Shenming wanted to establish a Body Cultivation Sect, but Fang Wang refused him, and he immediately understood that the Body Cultivation Sect was what his predecessors had left for him!<br/><br/>Alas, his power was still modest, inadequate to command respect.<br/><br/>Chu Yin, as Fang Wang’s first disciple, also harbored such lofty ambitions, and he had already planned the name for his own Dao Sect.<br/><br/>Spirit Sect, the Sect of Spiritual Power!<br/><br/>With a focus on improving one’s cultivation!<br/><br/>After receiving the Token, Jiang Shenming was equally thrilled and even made faces at Xu Qiuming, as the two had come together and received the Token of the Dao Sect, which was extremely satisfying.<br/><br/>Just as Fang Wang was about to speak, a rumbling sound came from outside the hall.<br/><br/>Dugu Wenhun sensed it and smiled, “It’s the Kunlun Formation; probably that Immortal lady has arrived.”<br/><br/>The others likewise showed smiles, knowing that Fang Wang had two fiancées, one was Zhou Xue of the Jin Xiao Sect, and the other was Hong Xian’er, the former seventh princess of the Grand Yu Divine Dynasty. Among them, Hong Xian’er was the more renowned, a genuine Sky-Stepping Realm cultivator!<br/><br/>Jiang Shenming chimed in, “It’s not her aura.”<br/><br/>He knew Hong Xian’er, having met her before when the Emperor Donggong was still in power during a visit the Jiang family paid to Donggong, at which time he encountered Hong Xian’er.<br/><br/>Fang Wang also sensed it, stood up, and with a word disappeared in front of the Jade Chair:<br/><br/>“Continue, I’ll go take a look.”<br/><br/>The rest of the group exchanged glances, and Hong Chen stepped forward, saying, “Regarding the establishment of the Sword Sect and Divine Sect, we still need to discuss further. The Twelve Dao Sects lack unified order and classification, which you’ll need to determine yourselves.”<br/><br/>Jiang Shenming couldn’t help but mutter, “The Dao Master sure has a lot of free time.”<br/><br/>“Hmm?” Hong Chen glanced over at him.<br/><br/>Jiang Shenming hurriedly shook his head.<br/><br/>For some reason, he felt inexplicably intimidated in the presence of Hong Chen, experiencing an indescribable sensation.<br/><br/>This feeling was odd; he felt he could defeat Hong Chen, yet also felt that provoking Hong Chen would bring misfortune.<br/><br/>Elsewhere.<br/><br/>Fang Wang approached the Kunlun Formation where Zhui Feng had just stepped out, and promptly greeted him.<br/><br/>“Saint, the Grand Yu Divine Dynasty is in trouble,” Zhui Feng said gravely.<br/><br/>Upon hearing this, Fang Wang immediately said, “Let’s go, back to the Grand Yu Divine Dynasty. We’ll talk on the way.”<br/><br/>Zhui Feng nodded, and the two stepped onto the Kunlun Formation, with nearby Disciples of the Way of Hope simultaneously casting spells to activate the Formation.<br/><br/>Soon, the Kunlun Formation was activated again.<br/><br/>Bright light rose up as Zhui Feng quickly recounted the events occurring within the Grand Yu Divine Dynasty.<br/><br/>Since the year before last, plagues had frequently busted out across the Grand Yu Divine Dynasty, a top-tier dynasty in the Mortal Realm that had not experienced such epidemics for over two thousand years.<br/><br/>Initially, the Grand Yu Divine Dynasty didn’t take it too seriously, just tasked with investigating and eradicating the epidemic.<br/><br/>However, the plagues reemerged as soon as they were stamped out, and in just two short years, tens of millions of citizens died. Not only that, but the success rate of Cultivators undergoing tribulation had fallen to twenty percent, with a high risk of Heart Demon attacks.<br/><br/>Most crucially, the Emperor had fallen ill!<br/><br/>And no matter the treatment, he could not recover, even after many venerable beings were called for treatment, none could cure him.<br/><br/>Panic had already enveloped the Grand Yu Divine Dynasty!<br/><br/>After hearing this, Fang Wang’s heart sank.<br/><br/>The retaliation against the Grand Yu Divine Dynasty had finally begun!<br/><br/>This time, the enemies were clever, not choosing a direct assault, but rather employing these elusive tactics to dissolve the Grand Yu Divine Dynasty first!\t\t\t\t\t\t</div>", "images": {}, "success": true}