{"id": 331, "url": "https://www.novelhall.com/i-became-an-immortal-on-mortal-realm-32879/14875289.html", "title": "Chapter 321 - Chapter 321 Chapter 318: The Division Of Strength Between Ancient And Modern Times", "volume": 4, "volume_title": "Volume 4", "body": "<h1>Chapter 321 - Chapter 321 Chapter 318: The Division Of Strength Between Ancient And Modern Times</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 321 Chapter 318: The Division of Strength between Ancient and Modern Times<br/><br/>Xuan You Great Teaching?<br/><br/>Fang Wang’s eyebrows lifted, the word “幽” sparking boundless conjecture. With Tai You hiding in the Underworld, could it be that the Xuan You Great Teaching was a sect from the Underworld?<br/><br/>Hong Chen began to introduce the Xuan You Great Teaching, saying, “A long time ago, before the Mortal Realm had ruling dynasties, it had races and then sects. The Xuan You Great Teaching is one of those ancient sects that has been around for a very long time. They imparted Saint Methods and cultivated many Great Saints. Their prolonged strength led them to lose their way, and they began to see themselves as the sovereigns of the Mortal Realm. With such arrogance, many calamities occurred, bringing suffering to countless beings.”<br/><br/>“Later on, the Xuan You Great Teaching disappeared for some unknown reason. As Heaven Emperor, the first time I learned about this sect was during my visit to the Underworld. They had considerable influence there and were trying to control reincarnation, which displeased me. So I led the Immortal Court to lay siege to them.”<br/><br/>“The war lasted many years. Although the Immortal Court suppressed the Xuan You Great Teaching, the Immortal Court was also greatly weakened. After that, I no longer underestimated the sects from this Mortal Realm and began to actively develop the Immortal Court.”<br/><br/>At this point, he paused.<br/><br/>Fang Wang narrowed his eyes and asked, “Could it be that the Celestial Court of the Upper Realm’s wariness towards the Mortal Realm began with you?”<br/><br/>Hong Chen shook his head and replied, “I am partly responsible, but even without me, this situation would have formed. In the end, the Mortal Realm possesses the potential to threaten the Upper Realm. Those Mortal Realms that are incapable of opposing the Upper Realm will ultimately be annihilated, while only a few Mortal Realms can remain untouched by the Upper Realm. This Mortal Realm is among them, as that Supreme Saint still protects it to this very day.”<br/><br/>His tone was filled with emotion and reverence for that Supreme Saint.<br/><br/>Fang Wang asked, “Have you ever seen the Supreme Saint?”<br/><br/>Hong Chen shook his head, saying, “He is an existence even more ancient than me. When I was born, he was already the stuff of legends.”<br/><br/>“Then have you seen the Grand An Divine Dynasty?”<br/><br/>“I have seen that. At the time, I was merely a Celestial General,” said Hong Chen with a nod.<br/><br/>Hong Chen paused and then continued, “The Grand An Divine Dynasty was indeed powerful. They even established friendly relations with the Upper Realm, with many from their dynasty ascending and their royal descendants creating families in the Upper Realm. The Vajra Invincible Saint Body is considered one of the foremost domineering constitutions in the Upper Realm. The Grand An Divine Dynasty was not destroyed by the Immortal Court but by other forces of the Upper Realm, which even the Immortal Court had to treat with considerable caution.”<br/><br/>Upon hearing this, Fang Wang became curious and asked, “Is the Upper Realm not ruled by the Immortal Court?”<br/><br/>Hong Chen said with emotion, “Once, the Immortal Court indeed did rule, but like the Great Saints of the Mortal Realm, it could not rule forever. Before I was overthrown, I tried to unify the Upper Realm through the Immortal Court, continually waging wars that left Immortal Gods exhausted and filled with resentment, which gave my ill-fated disciple the opportunity.”<br/><br/>Speaking of this matter, his tone was neither hateful nor emotional, as if he had long since come to terms with it.<br/><br/>“So, dare I ask, which is more formidable—the Grand An Divine Dynasty or the Xuan You Great Teaching?” Fang Wang curiously inquired.<br/><br/>More than the scheming of the Xuan You Great Teaching, he was curious about the relative strength of top powers from different eras.<br/><br/>Hong Chen pondered for a moment and then said, “It’s difficult to compare. Although I witnessed the prosperity of the Grand An Divine Dynasty, I never saw their strength firsthand, and the Xuan You Great Teaching hiding in the Underworld is far from as powerful as it was in its prime.”<br/><br/>“However, now that we know it is the doing of the Xuan You Great Teaching, we can plan accordingly.”<br/><br/>Fang Wang nodded. He was not overly concerned about the Xuan You Great Teaching lurking in the shadows.<br/><br/>What is a sect that can only hide in the dark and scheme?<br/><br/>Unless the Xuan You Great Teaching could kill its way to the Mortal Realm.<br/><br/>The two talked for a long time, and Hong Chen intended to impart a Sword Array after the establishment of the Sword Sect, one that could vanquish evil and stabilize souls, specifically prepared for the Xuan You Great Teaching.<br/><br/>Fang Wang naturally had no objections. If Hong Chen was willing to contribute, that was good news.<br/><br/>The Underworld.<br/><br/>The world was shrouded in darkness, amidst the undulating wilderness, the ancient Tai You paced forward, her wooden staff thudding dully against the ground.<br/><br/>She pressed on until at last she halted on a hillside, and following her gaze, there lay two massive mountains ahead with a gap between them, forming a deep and seemingly bottomless canyon, like an abyss.<br/><br/>“The plan has failed, and Hong Xian’er will likely never trust me again,”<br/><br/>Tai You spoke, her voice echoing endlessly into the canyon.<br/><br/>From the darkness of the canyon, a breeze emerged, bringing a voice, “Our layout was not mistaken, we just underestimated Fang Wang’s strength. His talent cannot be measured by any genius of the past; he is the strongest talent ever. Now that we have failed, our chances are few.”<br/><br/>Tai You furrowed her brows and said, “I have never underestimated Fang Wang, but he has thwarted our grand plans.”<br/><br/>“Emperor Donggong could stand at the pinnacle of an era; naturally, his vision and audacity wouldn’t lose to anyone. He made the right move. Facing the unknown us, he dared to place all his hopes on Fang Wang, leaving us in the shadows powerless. He has won,”<br/><br/>the voice within the canyon praised, admiring Emperor Donggong.<br/><br/>Tai You looked helpless, sighing, “Let’s think about how to proceed from now on. We’ve waited so long for a congenital Dao Origin Spirit Treasure, and yet it died so pathetically.”<br/><br/>“Let it be dead. I still have a piece in play.”<br/><br/>“Who?”<br/><br/>“A talent that should have been invincible had his fate changed. If we nurture him well, he might become a significant part of our plan.”<br/><br/>“The grand struggle of the Mortal Realm is fast approaching, and the celestial fortune granted by the Upper Realm to the Mortal Realm is almost upon us. We cannot afford to miss it again.”<br/><br/>“Mmm, don’t worry, the hidden agents we have left in the Mortal Realm are about to surface.”<br/><br/>The Underworld was swept with an eerie chill as Tai You and the voice in the canyon conspired, their conversation no longer including the name Fang Wang.<br/><br/>The news of the Sword Immortal’s challenge against Fang Wang quickly spread, and Sword Heaven Marsh had become the nexes of attention for various forces. The earth-shattering battle between Fang Wang and the Sword Immortal naturally drew much interest.<br/><br/>This also led to an increasing number of Cultivators heading to the Descending Dragon Continent, eager to witness Fang Wang’s elegance.<br/><br/>By the seashore, Cultivatresses descended, looking like Immortals, with Tai Xi Celestial Maiden from Suzhen Palace leading them.<br/><br/>Trailing behind her was Gu Li, clad in a blue garment, carrying a sword case on her back, her face partially veiled, revealing eyes as deep and mysterious as a secluded pool.<br/><br/>“So this is the Descending Dragon Continent? The Spiritual Energy is nothing special.”<br/><br/>“Nonsense, after all, this place was once a forbidden zone. Being restored to this extent is already quite good.”<br/><br/>“Indeed, look, isn’t that Kunlun?”<br/><br/>“The oppressive force from that battle earlier reached Suzhen Palace, yet the Descending Dragon Continent looks unscathed. This Wangdao is extraordinary.”<br/><br/>“Naturally, he’s the genius valued by our elder sister. The construction of Kunlun also owes much to our elder sister’s efforts,”<br/><br/>the Cultivatresses from Suzhen Palace discussed, their interest piqued by Kunlun and Wangdao.<br/><br/>Tai Xi Celestial Maiden turned her head, looking at Gu Li with a smile, “Gu Shimie, this is your homeland, why not come forward and lead the way?”\t\t\t\t\t\t</div>", "images": {}, "success": true}