{"id": 333, "url": "https://www.novelhall.com/i-became-an-immortal-on-mortal-realm-32879/14876232.html", "title": "Chapter 323 - Chapter 323 Chapter 320: Divine Sect, Fang Wang’S Suppressive Power", "volume": 4, "volume_title": "Volume 4", "body": "<h1>Chapter 323 - Chapter 323 Chapter 320: Divine Sect, Fang Wang’S Suppressive Power</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 323 Chapter 320: Divine Sect, Fang Wang’s Suppressive Power<br/><br/>“Is that all you’ve got?”<br/><br/>The reincarnation of the Divine Emperor as a Taoist said with a face full of scornful smile, his hand shaking the Peach Wood Sword, dispersing the raging wind and fire that assaulted him.<br/><br/>His opponent was a burly man clad in black, his robe adorned with the scales of a demonic beast and his belt made of Jiao skin, exuding a powerful and domineering aura. A black lantern floated above his head, from which thousands of spells burst forth.<br/><br/>Facing the Taoist’s mockery, the man in black revealed an angry expression as he began to cast spells with all his might.<br/><br/>The Taoist, a reincarnation of the Divine Emperor named Jiang Shenming, had come with Xu Qiuming. He aimed to become one of the Twelve Dao Sects. Therefore, he chose one of the greatest Cultivators within Sword Heaven Marsh to prove himself.<br/><br/>Jiang Shenming seemed to sense something and glanced towards a place in Sword Heaven Marsh surrounded by Ling Wu.<br/><br/>With a smile curling at the corner of his mouth, he turned back to the man in black, loosening his grip on the Peach Wood Sword. The sword stood erect before him, resisting the overwhelming Spiritual Power that surged like a blue ocean, submerging him, yet the Peach Wood Sword created an absolutely safe domain around him.<br/><br/>“I’m done playing with you.”<br/><br/>Jiang Shenming muttered, and as his voice fell, with a bang, a golden flame erupted from within him, piercing through the blue Spiritual Power ocean, soaring into the sky, reaching for the heavens.<br/><br/>Yang Energy!<br/><br/>The blistering Yang Energy caused the whole firmament to change color.<br/><br/>“That is…”<br/><br/>On a pavilion, Yang Du stood at the edge of the second-floor balcony, gripping the railing tightly, his gaze fixed on the Firmament.<br/><br/>“The Vajra Invincible Saint Body, it’s been a long time since I’ve seen it.”<br/><br/>Hong Chen murmured from behind Fang Wang.<br/><br/>Fang Wang could naturally tell that Jiang Shenming was using the Vajra Invincible Saint Body and it wasn’t just at minor completion; it was at Great Completion.<br/><br/>Indeed!<br/><br/>He is worthy of being one of the Twelve Dao Sects!<br/><br/>Jiang Shenming’s cultivation had grown to a peerlessly strong level, and coupled with his talent, sweeping through the Sky-Stepping Realm was no difficult task.<br/><br/>Not directly challenging Fang Wang meant Jiang Shenming was already convinced.<br/><br/>Fang Wang thought to himself, it seemed that the deterrent effect of his fight with the Sword Immortal was still strong.<br/><br/>Jiang Shenming, having activated the Vajra Invincible Saint Body, looked like a sun god standing in the sky as he brandished his sword towards the man in black. With this charge, the vast ocean of Spiritual Energy was instantly dispersed.<br/><br/>Almost in an instant, he reached the man in black.<br/><br/>The man in black’s pupils constricted, retreating instinctively as the black lantern behind him moved to the front, its fire bursting forth, transforming into ferocious and terrifying Black Dragons that lunged at Jiang Shenming.<br/><br/>With one slice of his sword, Jiang Shenming cut down the Black Dragons, cleaved through the sea of clouds in the sky, and a wave of Yang Energy surged up, as if splitting the heavens and the earth in two.<br/><br/>This strike was extremely tyrannical; even with the Wangdao’s great array shielding it, every creature could feel the heat of his Sword Qi.<br/><br/>The black lantern in front of the man in black was directly shattered by the strike, and he was sent flying back, spitting blood.<br/><br/>Standing by the lake, Xu Qiuming narrowed his eyes, filled with a fighting spirit.<br/><br/>The Tai Xi Celestial Maiden, Gu Li, and a group of Palace Maiden cultivators from Suzhen Palace had just entered Sword Heaven Marsh. As they walked through the woods, they looked up at the battle in the sky, all deeply moved.<br/><br/>“Who is this person? He’s so strong!”<br/><br/>“Isn’t that Jiang Shenming from the Jiang family?”<br/><br/>“Have you seen him before?”<br/><br/>“Mhm, the Jiang family ancestors once gave birth to a Great Emperor, one of the eternal Imperial Clans of the present age. I visited the Jiang family when I was a child with the elders of my clan. Jiang Shenming and I are the same age, not over a thousand years old.”<br/><br/>“What realm has he reached? He feels stronger than the Heaven-Breaking Realm.”<br/><br/>“Heaven-Breaking Realm? He’s already surpassed the Divine Passage Realm.”<br/><br/>Listening to her juniors’ discussion, the Tai Xi Celestial Maiden couldn’t help but speak out.<br/><br/>She gazed deeply at Jiang Shenming’s retreating figure, her eyes filled with a sense of lament.<br/><br/>Had Jiang Shenming come to challenge Fang Wang?<br/><br/>What a pity, yet another peerless genius was about to have his Dao heart shattered!<br/><br/>Above in the sky, Jiang Shenming, oblivious to the thoughts of the onlookers below, twisted his neck and revealed a ferocious grin. Yang Energy burned fiercely around his body, causing his Dao Robe to flutter like flames, with an aura that was truly formidable.<br/><br/>Just as he was about to fly toward the man in black, a voice sounded:<br/><br/>“All who come to Sword Heaven Marsh are guests—why resort to such hostility? Let us cease the conflict. If you wish to see me, you are welcome to come down and find a place to talk.”<br/><br/>Fang Wang’s voice rose, echoing within Sword Heaven Marsh.<br/><br/>Upon hearing Fang Wang’s words, Jiang Shenming halted, and the Yang Energy dissipating rapidly from his body. He sheathed his Peach Wood Sword in its scabbard on his back and plummeted downward.<br/><br/>The man in black flew in from a distance, blood smeared at the corner of his mouth, yet his robe was undamaged, not appearing disheveled, at least from the outside.<br/><br/>At the bridgehead.<br/><br/>Fang Wang stood up and said, “Let Dugu Wenhun attend to the injured cultivator while I meet with this Great Emperor reincarnated alone.”<br/><br/>Hong Chen nodded and then vanished from atop the bridge.<br/><br/>Fang Wang stretched his body and turned to walk toward the pavilion. With his steps, the Ling Wu enveloping the wooden bridge dispersed.<br/><br/>After a stick of incense had burned.<br/><br/>Inside a pavilion, Fang Wang and Jiang Shenming sat together while Song Jinyuan poured tea for them. His gaze occasionally flickered towards Jiang Shenming.<br/><br/>Jiang Shenming, eyes gleaming, looked at Fang Wang and asked, “What do you think? Is my strength qualified to be one of the Twelve Dao Sects?”<br/><br/>Instead of answering, Fang Wang countered with a question: “The Twelve Dao Sects each have their own unique Dao traditions. What is your Dao tradition?”<br/><br/>Jiang Shenming replied, “Since there’s already a Buddhist Sect, then I shall call it Divine Sect, focusing on Body Cultivation.”<br/><br/>Fang Wang shook his head.<br/><br/>Jiang Shenming furrowed his brow and asked, “What? Is the name Divine Sect already taken?”<br/><br/>Zhu Rulai’s former sect was indeed called the Divine Sect, but now he has established the Buddhist Sect.<br/><br/>Fang Wang responded, “The Dao tradition of Body Cultivation doesn’t suit you. At least, you don’t possess the strongest physique.”<br/><br/>At these words, Jiang Shenming’s face underwent a drastic change.<br/><br/>He subconsciously wanted to slam the table, but as his palm almost hit it, he stopped. Suppressing his anger, he asked, “Whose physique is stronger than mine?”<br/><br/>Fang Wang looked at him and said, “You ought to have stronger supreme arts. Your Vajra Invincible Saint Body is merely a legacy of your bloodline, isn’t it?”<br/><br/>Jiang Shenming stared at Fang Wang in astonishment, not expecting Fang Wang to know of his origins.<br/><br/>As he was about to answer, Fang Wang suddenly vanished and reappeared behind him, his right hand pressing on Jiang Shenming’s shoulder.<br/><br/>“If you can stand up, I will agree to your establishment of the Body Cultivation Sect,” Fang Wang’s voice followed, his tone indifferent.<br/><br/>Jiang Shenming was stunned and then flew into a towering rage. He immediately tried to rise, but Fang Wang’s palm seemed like a mountain pressing down on him, immobilizing him.<br/><br/>He quickly channeled the Yang Energy inside his body, and his Vajra Invincible Saint Body erupted forth!<br/><br/>However, something terrifying happened.<br/><br/>His Yang Energy couldn’t escape his body!<br/><br/>An unimaginable force of suppression prevented his Yang Energy from flooding out of his flesh. He had never felt anything like it; even when fighting across realms, he could always rely on his Vajra Invincible Saint Body to carve a way out or break through seals.<br/><br/>How could this be possible…<br/><br/>Song Jinyuan stood aside, watching the scene with great interest, remaining silent, amused at how Fang Wang subdued the fiercely radiant Jiang Shenming.\t\t\t\t\t\t</div>", "images": {}, "success": true}