{"id": 337, "url": "https://www.novelhall.com/i-became-an-immortal-on-mortal-realm-32879/14882032.html", "title": "Chapter 327 - Chapter 327 Chapter 324: Doom God, Time Of Ascension", "volume": 4, "volume_title": "Volume 4", "body": "<h1>Chapter 327 - Chapter 327 Chapter 324: Doom God, Time Of Ascension</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 327 Chapter 324: Doom God, Time of Ascension<br/><br/>The green-robed elder, upon hearing the words of the Extremely Evil Old Immortal, couldn’t help but look him over with surprise, seemingly unable to believe he had such awareness.<br/><br/>Displeased by the scrutiny, the Extremely Evil Old Immortal snorted, “What are you looking at? I’m about to die at the hands of my disciple. Won’t you grant an old man’s final request before death?”<br/><br/>The green-robed elder calmly said, “I intend to confront Tian Dao Fang Wang, and your disciple has cause and effect with the Fang Family, perhaps a close connection with Fang Wang.”<br/><br/>“He has already taken the evil path and will inevitably stand against Fang Wang. You needn’t worry. However, I warn you, don’t use him as your sword, after all, you still owe this old man a life,” the Extremely Evil Old Immortal said sternly, staring at the green-robed elder.<br/><br/>The green-robed elder withdrew his gaze, looking into the distance, and said ethereally, “Once I flatten the Grand Yu Divine Dynasty, I will take care of your disciple for you.”<br/><br/>Upon hearing this, the Extremely Evil Old Immortal finally nodded in satisfaction.<br/><br/>He then asked, “Fang Wang is at the height of his power, do you really intend to clash with him to the death? Why must you obliterate the Grand Yu Divine Dynasty? How deep is your hatred?”<br/><br/>“As deep as the sea, and it’s not just me who wants to eradicate them. Behind me stand many forces, those with grievances, those without grievances but with conflicts in fate, they are everywhere. The fate of the Grand Yu Divine Dynasty has run out; it must perish. Fang Wang, no matter how strong, is deluding himself if he thinks he can protect Emperor Donggong single-handedly.”<br/><br/>The green-robed elder responded, his words making the Extremely Evil Old Immortal even more curious about the powers standing behind the green-robed elder.<br/><br/>However, he knew better than to ask about these matters, as it would be taboo.<br/><br/>Turning around, the Extremely Evil Old Immortal said, “Don’t you die before me, leaving someone else to take care of your orphan. I don’t have that many connections.”<br/><br/>The green-robed elder did not respond, and the Extremely Evil Old Immortal leapt up, quickly vanishing into the horizon.<br/><br/>It wasn’t until the presence of the Extremely Evil Old Immortal had completely disappeared that the green-robed elder murmured to himself, “Whether I live or die is not in my control.”<br/><br/>The Emperor has passed away!<br/><br/>This news spread quickly throughout the Grand Yu Divine Dynasty, plunging it, already in dire straits, deeper into the abyss. Not just the common people, but also the various sects and clans of the Cultivation World began to waver, contemplating whether to flee the Grand Yu Divine Dynasty.<br/><br/>Pestilence, Heart Demons…<br/><br/>Unseen and untouchable dangers shrouded the Grand Yu Divine Dynasty; the unknown was the most terrifying of all.<br/><br/>The full court of civil and military officials, as well as the Great Cultivators of the Grand Yu Divine Dynasty, were unable to trace the root of the disaster and could only help the people of the world as best they could. When Hong Xian’er brought Xiao Zi to the Pilgrimage Manor, another person arrived.<br/><br/>That was Hong Chen.<br/><br/>Hong Chen did not disturb Fang Wang but left on her own.<br/><br/>It wasn’t until four years later, just after Fang Wang had broken through to the seventh level of the Heaven-Breaking Realm and was still consolidating his cultivation, that Hong Chen came to visit.<br/><br/>After entering the hall, Hong Chen sat down across from Fang Wang at the table, the two of them drinking in silence.<br/><br/>With a somber expression, Hong Chen said, “The Immortal Gods of the Upper Realm have made their move.”<br/><br/>“What?”<br/><br/>Fang Wang frowned, questioning the seriousness of the Upper Realm Immortal Gods’ intervention.<br/><br/>Why hadn’t the Immortal Gods appeared in person?<br/><br/>Not beating around the bush, Hong Chen continued, “Based on my investigation over the years, it should be the work of the Doom God from the Celestial Court. The heavenly timing is not yet right for the Immortal Gods to descend to the Mortal Realm, but the Celestial Court has always been wary of the Mortal Realm, with the Heaven Emperor even cultivating his own secret agents among humans. Those who have received the inheritance of the Immortal Gods wield the Power of Doom of the Doom God.”<br/><br/>“The Celestial Court has many methods up its sleeve, like lending their mana to believers in the Mortal Realm, seemingly helping their followers but in reality using them to carry out their own schemes.”<br/><br/>“If you insist on strongly protecting the Grand Yu Divine Dynasty, even with extraordinary abilities, you will catch the attention of those in the Upper Realm, and that is not a good thing.”<br/><br/>Fang Wang fell silent, deep in thought.<br/><br/>Hong Chen did not disturb him and continued to wait.<br/><br/>After a long time.<br/><br/>Fang Wang finally spoke up, “If I do protect the Grand Yu Divine Dynasty, will the Celestial Court of the Upper Realm send down Immortal Gods?”<br/><br/>“They will, but it will be eight hundred years later during the Ascension period.”<br/><br/>“Eight hundred years later?”<br/><br/>“Are you surprised, thinking you can use these eight hundred years to catch up with the gap? But don’t delude yourself, even with your natural talent, catching up to Immortal Gods is not the work of a thousand years. The pinnacle of the Mortal Realm is the Celestial Qiankun, with no further breakthroughs possible. Even if you achieve the status of a Great Saint or a Great Emperor, the gap remains vast. Haven’t you said before that you don’t wish to ascend? Then you’d best control your heart. Every time the period of Ascension approaches, you must hide yourself away until you truly possess the power to stand shoulder to shoulder with Immortal Gods.”<br/><br/>Hong Chen spoke earnestly and with great emphasis.<br/><br/>Fang Wang fell into deep thought again.<br/><br/>Hong Chen added, “Even if you come forward now, it’s not certain you’d win. I’ve deduced that the forces against the Grand Yu Divine Dynasty have complicated karma. Just the Holy Clans, Imperial Clans alone count over a hundred. You’re almost opposing half of the Eastern Mortal Realm.”<br/><br/>After hearing this, Fang Wang couldn’t help but laugh, “Emperor Donggong really knows how to make enemies.”<br/><br/>Hong Chen said, “Rather than saying he made enemies, it’s more accurate to say he is feared. They worry about the Grand Yu Divine Dynasty giving rise to a second Emperor Donggong. The Mie Jue Divine Tome hangs over the heads of all clans in the Mortal Realm like a sword. This time, you don’t have Emperor Donggong to uphold justice for you. Once you make a move, it will inevitably be a fight to the death.”<br/><br/>He looked at Fang Wang very seriously.<br/><br/>Fang Wang looked back at him and asked, “If war breaks out, can I count on you to lead Wangdao to protect Grand Qi, even the Descending Dragon Continent?”<br/><br/>Hong Chen narrowed his eyes, pronouncing each word distinctly, “When one attains greatness over countless corpses, if you fail, countless people will be implicated—your clan members, your disciples, your close friends, and even the people you love.”<br/><br/>Fang Wang responded with a counter-question, “If one always worries about implicating others, then what can ever be done? Even if I do nothing and hide away, they will still face their own crises. I don’t care about all that; I simply follow my heart. Some things, I must do.”<br/><br/>The two men stared intently at each other, the atmosphere turning heavy.<br/><br/>Suddenly.<br/><br/>Hong Chen began to laugh, his beard quivering as he said, “Good, good, good! Excellent!”<br/><br/>Fang Wang raised an eyebrow and asked, “What? Amused by my folly?”<br/><br/>“If one cannot stand up against half of the Mortal Realm for the sake of righteousness and loyalty, how will you dare to defy Immortal Gods with the risk of the Mortal Realm being bathed in blood?” Hong Chen said, his tone full of admiration.<br/><br/>He continued, “Don’t worry, I will not only help you shield the Descending Dragon Continent, but I will also lead Wangdao to defend the Grand Yu Divine Dynasty. It’s time the entire Mortal Realm recognized the existence and strength of Wangdao.”<br/><br/>“This battle is not only for victory but also to resound through the Mortal Realm!”<br/><br/>Fang Wang asked, “Aren’t you afraid that making myself known to the Celestial Court prematurely will keep me from avenging you later?”<br/><br/>Hong Chen chuckled, “Do you really think the Upper Realm hasn’t noticed you? It’s just that they can’t deduce your specific fate and karma, that’s all. When the time of Ascension comes, they’ll certainly take action. Since it’s inevitable sooner or later, why not assist you in becoming a Saintly Emperor before the period of Ascension?”<br/><br/>Fang Wang teased, “But you’ve said, a Great Saint, a Great Emperor is still far from contending with the Immortal Gods.”<br/><br/>“That’s for others, you are different. Besides, even if you die, I can simply die and reincarnate,” replied Hong Chen.<br/><br/>Hearing such a roguish remark from Hong Chen, Fang Wang pointed at him and shook his head, unable to suppress a smile.\t\t\t\t\t\t</div>", "images": {}, "success": true}