{"id": 339, "url": "https://www.novelhall.com/i-became-an-immortal-on-mortal-realm-32879/14885640.html", "title": "Chapter 329 - Chapter 329: Chapter 326: Nine Lives Nirvana Sword Technique Great Perfection, Rebirth!", "volume": 4, "volume_title": "Volume 4", "body": "<h1>Chapter 329 - Chapter 329: Chapter 326: Nine Lives Nirvana Sword Technique Great Perfection, Rebirth!</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 329: Chapter 326: Nine Lives Nirvana Sword Technique Great Perfection, Rebirth!<br/><br/>“You want to be resurrected, naturally you can, but you must pass on this swordsmanship ultimate art to me,”<br/><br/>Fang Wang replied, his heart filled with surprise. Was there really a sword technique that could bring people back to life?<br/><br/>Truly extraordinary!<br/><br/>Zhao Zhen had studied the two shariras for so long, he couldn’t just hand them over because the sword immortal said so. Fang Wang had to consider Zhao Zhen’s interests as well.<br/><br/>The enmity between Fang Wang and Zhao Zhen had long since ended. Zhao Zhen had served as an ox and horse for three hundred years, which was enough to settle his debt, and the events of those years were driven by interests to begin with.<br/><br/>The sword immortal looked at Fang Wang and said, “It certainly can be done. I will dedicate all my learning to Wangdao, and if you do not despise me, I am willing to join Wangdao in the future.”<br/><br/>Fang Wang revealed a smile and said, “How could I possibly despise a talent like you?”<br/><br/>The sword immortal spoke calmly, “My lifespirit treasure has already been absorbed by you. I am afraid I will be mediocre in the future.”<br/><br/>Fang Wang shook his head slightly and said, “Haven’t you noticed? Its form is just like you. It was never about it defining you, it was about your presence that defined it.”<br/><br/>The sword immortal looked puzzled and asked, “What do you mean by that?”<br/><br/>“You will understand in time,”<br/><br/>As Fang Wang’s words fell, Zhao Zhen, with a sharira in hand, flew over. Upon seeing the sword immortal, he was slightly moved.<br/><br/>Fang Wang gave a brief introduction. Upon hearing that the sword immortal could be resurrected with the help of a sharira, he showed no nervousness, but instead a look of anticipation.<br/><br/>Zhao Zhen generously handed over the sharira to the sword immortal.<br/><br/>The sword immortal looked at him, nodded slightly, and then gently tossed the sharira upward before burrowing into it.<br/><br/>The sharira remained suspended in midair, beginning to tremble as it frantically absorbed nature’s spiritual energy.<br/><br/>Fang Wang could feel that this process would not be quick, so he went to the side to sit in meditation and cultivate, while Zhao Zhen stood and watched.<br/><br/>Outside, the mysterious Sword Intent caused a sensation across the Grand Yu Divine Dynasty. Countless figures quickly flew out of the Imperial City to join the excitement.<br/><br/>Time continued to move forward.<br/><br/>Three days later, the mysterious Sword Intent finally vanished.<br/><br/>However, less than ten days later, the Sword Intent erupted again, this time in another corner of the Grand Yu Divine Dynasty, causing another sensation across the lands.<br/><br/>In the blink of an eye.<br/><br/>Two years passed.<br/><br/>That day.<br/><br/>Fang Wang opened his eyes to see a glowing orb floating in front of him. It was the transformed sharira, its surface swirling with threads of Spiritual Power radiance, intertwined with silver Sword Intent, forming an exquisite sight.<br/><br/>Zhao Zhen floated in from the window, looking expectantly at the sword immortal.<br/><br/>The silhouette of the sword immortal’s body could now be seen in the orb, curled up like an unborn baby, and the orb’s speed of absorbing nature’s spiritual energy was increasing rapidly.<br/><br/>A smile crept across Fang Wang’s face as he marveled inwardly.<br/><br/>Indeed!<br/><br/>This fellow’s lifespirit treasure could actually be reshaped!<br/><br/>That is somewhat terrifying.<br/><br/>Fang Wang thought of his Heavenly Palace and the words of the True God of the Heavenly Palace.<br/><br/>Although the Heavenly Palace could absorb the lifespirit treasures of other extraordinary beings, it could not completely obliterate them, indicating that the gap between the sword immortal’s Sword Spirit Physique and the Heavenly Palace was not insurmountable.<br/><br/>Just then,<br/><br/>Accompanied by a sound like shattering mirrors, the sword immortal suddenly stretched out his body, the light orb shattered, and countless star-like lights scattered, making the hall seem like a galaxy had burst into bloom.<br/><br/>The sword immortal landed on the ground, his skin as white as jade, his black hair fluttering. Fang Wang took out a white robe from the Dragon Jade Ring and threw it to him. He caught it swiftly and dressed at an incredible speed.<br/><br/>The Sword Immortal, who seemed like an Immortal Monarch from the heavens, had returned!<br/><br/>The Sword Immortal felt the qi and blood within his body and a smile appeared on his face. From his eyes, one could tell he was struggling to contain his excitement.<br/><br/>“What a fortune, splendid!”<br/><br/>Zhao Zhen couldn’t help but exclaim.<br/><br/>Fang Wang smiled and said, “Xu Yan, now teach us that set of swordsmanship of yours.”<br/><br/>The Sword Immortal, whose real name was Xu Yan, nodded in agreement. He immediately began to recite the mental method and sword technique, using the process to also feel his newly revived physical body.<br/><br/>This set of swordsmanship that enabled revival was a sword technique, with no specific sword moves but more like a cultivation technique, except this technique did not mobilize Spiritual Power but Sword Intent.<br/><br/>Fang Wang listened attentively; as soon as Xu Yan finished, he went straight into the Heavenly Palace.<br/><br/>Xu Yan paused, looked at Fang Wang and said, “This is not purely swordsmanship, even if you… will also need time to practice.”<br/><br/>What he meant to say was even if you obtained my Lifespirit Treasure, it would still be difficult to master this sword technique in one go.<br/><br/>However, Zhao Zhen was standing by. He couldn’t reveal this matter, as it would also become one of Fang Wang’s secret weapons in the future.<br/><br/>Although Xu Yan died at the hands of Fang Wang, he held no ill will toward him, even filled with gratitude. Since his birth, apart from his wife and two brothers, no one had treated him better than Fang Wang, who had always been the person he aspired to become.<br/><br/>At that moment, Fang Wang opened his eyes just as they met Xu Yan’s gaze.<br/><br/>Instantly, Xu Yan inexplicably felt his heart skip a beat.<br/><br/>Fang Wang’s eyes were profound, showing no emotion, yet for some reason, Xu Yan always felt that he became more imposing.<br/><br/>“The Nine Lives Nirvana Sword Technique, impressive. Using the Nirvana of the Lifespirit Treasure, one can continually break through their limits. This technique is no less extraordinary than your knack for achieving limit-breaking cultivation, and could even be said to complement each other…”<br/><br/>Fang Wang stared at Xu Yan, speaking earnestly.<br/><br/>The Nine Lives Nirvana Sword Technique, which he had practiced for one thousand five hundred years, was not difficult to train to Great Perfection. The main challenges were achieving Great Completion and Great Perfection; reaching the Great Perfection Realm allowed him to see through the essence of the Nine Lives Nirvana Sword Technique.<br/><br/>To embrace death for life!<br/><br/>Rebirth through Nirvana!<br/><br/>With each death, one could use an object of cultivation to revive, with ‘objects of cultivation’ being what a Great Cultivator transforms into after death. Those revived by the Nine Lives Nirvana Sword Technique could inherit the cultivation and fortune of their object’s previous owner, thereby acquiring greater aptitude.<br/><br/>Of course, there were also drawbacks.<br/><br/>Objects of cultivation were hard to find, and they had to be from cultivators with a higher level of cultivation than one’s own, making each successive attempt harder than the last, with nine as the limit.<br/><br/>And once used, one must start over with the physical body.<br/><br/>For example, if Fang Wang were reborn, he would have to start from scratch with the Heavenly Gang Supreme Yang Tyrant Body as well as the various other extraordinary skills. Of course, starting over didn’t pose much trouble for Fang Wang, but he didn’t need such methods to become stronger.<br/><br/>After each Nirvana, the cultivator would gain new insights into cultivation techniques, meaning they had to relearn a completely new Nine Lives Nirvana Sword Technique after Nirvana.<br/><br/>The key point was, upon reaching the Great Perfection of the Nine Lives Nirvana Sword Technique, one could obtain the opportunity for true rebirth!<br/><br/>Now that was terrifying!<br/><br/>That is to say, after undergoing Nirvana nine times, Fang Wang could choose to sacrifice his own cultivation, invert time and space, and walk the path of cultivation once again.<br/><br/>However, this choice must be voluntary and not the result of being killed by someone else.<br/><br/>After all, who could choose to be reborn at the peak of their condition for no reason?<br/><br/>This technique led Fang Wang to speculate even more about Zhou Xue’s rebirth.<br/><br/>“Complement each other? What do you mean?” Xu Yan asked with a frown, puzzled.<br/><br/>Whether it was the Nine Extremes Blood Sacrifice Technique or the Nine Lives Nirvana Sword Technique, he had merely mastered them superficially and could not see through the true nature of these two extraordinary skills.<br/><br/>Asking him to perform the Nine Extremes Blood Sacrifice Technique now would be impossible; he had even forgotten how to execute it.\t\t\t\t\t\t</div>", "images": {}, "success": true}