{"id": 344, "url": "https://www.novelhall.com/i-became-an-immortal-on-mortal-realm-32879/14887743.html", "title": "Chapter 334 - Chapter 334: Chapter 331: Daoist Xuanzhi Vs. Fang Wang!", "volume": 4, "volume_title": "Volume 4", "body": "<h1>Chapter 334 - Chapter 334: Chapter 331: Daoist Xuanzhi Vs. Fang Wang!</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 334: Chapter 331: Daoist Xuanzhi vs. Fang Wang!<br/><br/>Can we wipe out the Grand Yu Divine Dynasty and execute Fang Wang today?<br/><br/>Upon hearing the words of the Mysterious Finger Daoist, the Grand Wu Emperor was startled and reminded, “This Fang Wang is no ordinary man. The Unjust True Buddha of the Buddhist Sect, who was said to be half a step into the realm of Celestial Qiankun, died at his hand. There was also a mysterious cultivator who claimed to be a Sword Immortal, displaying a momentum surpassing the True Soul Realm, yet he was easily slain by Fang Wang.”<br/><br/>In preparation for the assault on the Grand Yu Divine Dynasty, the Grand Wu God Dynasty had been preparing for many years. Since Emperor Donggong perished, the Grand Wu Emperor had dispatched people to reside in Sword Heaven Marsh permanently, constantly updating on the latest information about Fang Wang.<br/><br/>The Mysterious Finger Daoist raised his right hand, extending his index finger, and pointed towards the horizon.<br/><br/>He slightly lifted his chin and said, “Your Majesty, the power of Celestial Qiankun is beyond your imagination. The so-called geniuses are merely comparisons among mortals. What is Celestial Qiankun? It is to stand as high as heaven and earth!”<br/><br/>Boom——<br/><br/>His right index finger suddenly burst forth with a cyan light rainbow, shooting towards the sky, not dissipating as it traveled, appearing like a cyan line extending forth.<br/><br/>Under everyone’s gaze, the Mysterious Finger Daoist disappeared into the cyan light rainbow.<br/><br/>The Grand Wu Emperor and his soldiers were unable to feel his presence, nor could their spiritual consciousness catch up; it was as if he had vanished into thin air.<br/><br/>The Grand Wu Emperor’s black dragon robe wildly fluttered in the wind, and he squinted in the direction of the extending cyan light rainbow, pondering something.<br/><br/>After hesitating for a moment, he spoke, “Send an order to the State Preceptor to prepare to awaken Grand Wu!”<br/><br/>To awaken Grand Wu?<br/><br/>This made all the soldiers uneasy, but they dared not object.<br/><br/>…<br/><br/>On the Human Emperor Continent, along the western coast.<br/><br/>Countless cultivators were stationed here, establishing pavilions and stone towers along the edge of the continent, stretching over thousands of miles, and even onto the lofty mountains inland.<br/><br/>An endless stream of cultivators, mounts, and magical artifacts came and went from the seashore, constructing a magnificent bridge in the sky as if spanning the entire ocean.<br/><br/>A group of cultivators sat around a campfire on the beach, discussing the situation.<br/><br/>Ye Xiang lamented, “The opponents we’ve encountered recently are getting stronger and stronger. I don’t know how much longer this defense line can hold.”<br/><br/>Ye Xiang, once a disciple of the Tai Yuan Sect who had participated in the Nine Veins Combat Method and Great Saint’s Grotto-Heaven alongside Fang Wang, had joined Wangdao without hesitation upon hearing of its establishment. Even though he hadn’t seen Fang Wang since, he remained full of fighting spirit, as he genuinely liked the principles of Wangdao.<br/><br/>The others around him were also former Tai Yuan Sect Disciples, and this connection brought them closer after joining Wangdao.<br/><br/>Zhou Xing Shi, with his aged face, said, “No need to worry. If the Dao Master has yet to appear, it means everything is still within control.”<br/><br/>He and Fang Wang had become disciples of the Tai Yuan Sect on the same day. After witnessing Fang Wang perform Spiritual Refinement, he was inflicted with the Eternal Poison Spring-Autumn Worm by Fang Wang’s master, Yang Yuanzi, and thereafter remained loyal to Fang Wang.<br/><br/>Now, his strength, status, and reputation fell far behind Fang Wang. Occasionally reminiscing about the past, Zhou Xing Shi felt some regret, thinking that the Eternal Poison Spring-Autumn Worm was actually an opportunity.<br/><br/>Fang Chen of the Fang Family spoke up, “I heard from my kin in the Jin Xiao Sect that Dao Master Fang Wang has now swept through the True Soul Realm. He refrains from acting because he is waiting for the arrival of beings beyond the True Soul Realm.”<br/><br/>The True Soul Realm!<br/><br/>All present yearned for it.<br/><br/>Before coming to the Grand Yu Divine Dynasty, they had never heard the words ‘True Soul Realm’. It was only after encountering it on the battlefield.<br/><br/>That god-like stature, those world-shattering divine skills, and spells made them feel no different from mortals.<br/><br/>How strong must Fang Wang be to kill such formidable beings with ease?<br/><br/>How far is he from becoming the true number one in the Mortal Realm?<br/><br/>As thoughts flew through everyone’s minds, a terrifying oppressive force suddenly attacked, startling them into instinctively turning their heads to look.<br/><br/>It was not only them; all the cultivators and monsters along the coastal region turned their heads in the same direction.<br/><br/>The sky turned a shade of blue, and the blue light was intensifying. An unimaginable pressure was bearing down, and before the cultivators could respond, a fierce wind wreaked havoc upon them.<br/><br/>The sea suddenly collapsed, lifting two rows of terrifying waves as if an invisible giant rod had smashed down with utmost domination.<br/><br/>Following that, they suddenly saw a blue sun appear at the edge of the sky, growing larger.<br/><br/>Immediately, dozens of cultivators materialized above the sea, casting spells in unison to form a light shield that obscured the sky and sun, with Emperor Tao notably among them.<br/><br/>At the same time.<br/><br/>Inside Pilgrimage Manor in the Imperial City.<br/><br/>Fang Wang stood next to Zhao Zhen, deep in thought, when he suddenly vanished; Xiao Zi, not far away, only noticed a blur before disappearing as well.<br/><br/>Boom!<br/><br/>A column of blue light swept across the boundless ocean with an unstoppable force, raising two rows of waves more than a thousand feet tall.<br/><br/>It was so fast, faster than lightning!<br/><br/>In the blink of an eye, it was about to hit the coast of the Human Emperor Continent.<br/><br/>Dozens of great cultivators exerted all their strength, the dazzling blue light shining on their faces as they widened their eyes.<br/><br/>The powerful Spiritual Power shield was directly shattered by the blue light column, sending dozens of great cultivators flying backward, vomiting blood. Countless cultivators and monsters stationed along the coast all felt a terrifying sensation as if the world was crumbling.<br/><br/>Before they had time to think further, an even more formidable waves stormed in from the inland. The cultivators in the sky felt someone flash by their side, followed by the abrupt cessation of the horrifying force that was hitting them.<br/><br/>They fixed their gaze and saw a figure.<br/><br/>“Pilgrimage…”<br/><br/>Emperor Tao widened his eyes, muttering to himself.<br/><br/>Fang Wang stood resolute against the blue light column, halting it fifty miles from the continent’s edge. In the distance, the bridge hanging in the sky had been scattered, with people, magical artifacts, and monsters plunging into the ocean. Others turned around and looked back in terror at the blue light column.<br/><br/>Fang Wang stood proudly in the firmament, not lifting a hand, his Yang Energy forming a blazing inferno around him, like a sun holding back the blue column.<br/><br/>Xiao Zi clung tightly to Fang Wang’s shoulder, trembling all over, her dragon eyes filled with excitement.<br/><br/>Fang Wang took a step forward, walking on air, pressing against the blue light column. As he moved forward, the pressure felt by all beings behind him began to weaken.<br/><br/>“It’s Fang Wang!”<br/><br/>Xu Tian Jiao exclaimed with delight, not just her, but exclamations started to rise from the coastal area.<br/><br/>The cultivators of the Grand Yu Divine Dynasty had been continuously hoping for Fang Wang. Although the news told them Pilgrimage hadn’t taken action to face a stronger opponent, cultivators who had suffered from the chaos of war couldn’t help thinking the worst.<br/><br/>At this moment, Fang Wang’s figure was deeply imprinted in the eyes of countless beings.<br/><br/>That white robe of his was so wondrously unusual!<br/><br/>“So you are Tian Dao Fang Wang? Quick to react, aren’t you?”<br/><br/>The voice of Dao Master Xuan Zhi rang out, cold and stern, echoing between heaven and earth, chilling the hearts of those who heard it.<br/><br/>Emperor Tao and dozens of great cultivators saw a figure inside the blue light column moving swiftly toward them, reaching Fang Wang in the blink of an eye.<br/><br/>It was Dao Master Xuan Zhi himself!<br/><br/>Dao Master Xuan Zhi, less than two yards from Fang Wang, appeared and the vast blue light column that spanned the sky dissipated. Countless divine senses and gazes swept towards the two of them.<br/><br/>Dao Master Xuan Zhi tilted his chin up, looking down at Fang Wang with disdain as he raised his right hand, pointing his index finger at Fang Wang and said, “Junior, are you ready to die?”\t\t\t\t\t\t</div>", "images": {}, "success": true}