{"id": 341, "url": "https://www.novelhall.com/i-became-an-immortal-on-mortal-realm-32879/14885651.html", "title": "Chapter 331 - Chapter 331: Chapter 328: Grand Wu God Dynasty, The Strongest Of The Era", "volume": 4, "volume_title": "Volume 4", "body": "<h1>Chapter 331 - Chapter 331: Chapter 328: Grand Wu God Dynasty, The Strongest Of The Era</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 331: Chapter 328: Grand Wu God Dynasty, The Strongest of the Era<br/><br/>Hearing Hong Chen’s words, Fang Wang hesitated for a moment but still nodded in agreement.<br/><br/>Indeed, he had no reason to protect the Grand Yu Divine Dynasty with his strength alone, and he could also trust those around him, giving the Wangdao Cultivators a chance to show themselves.<br/><br/>If the Grand Yu Divine Dynasty wanted to truly endure, it had to rely on its own strength.<br/><br/>War comes with growing pains, but only through blood and tears can true strength be forged.<br/><br/>Hong Chen went on to briefly share some intelligence, mainly about which of the Holy Clans might attack the Grand Yu Divine Dynasty, even predicting the timing of some attack plans.<br/><br/>Fang Wang couldn’t help but regard Hong Chen highly, uncertain if Hong Chen had deduced this information or if he had sent someone to infiltrate the enemy ranks.<br/><br/>Regardless, having Hong Chen around indeed gave Fang Wang peace of mind.<br/><br/>Fang Wang was not as clear about the current strength of Wangdao as Hong Chen was, and he trusted Hong Chen very much, not the least bit afraid that Hong Chen would betray him. It was this trust that allowed Hong Chen to act freely without any restraint.<br/><br/>After Hong Chen finished reporting the intelligence, Fang Wang hesitated for a moment before saying, “If you can reconcile it in your heart, you might actually ask the Jin Xiao Sect for help. Their strength is not simple, and the Demon Monarch’s tactics are very impressive, in no way inferior to mine.”<br/><br/>Fang Wang nodded and said, “I will consider it.”<br/><br/>Hong Chen raised his hand in salute and then turned to leave.<br/><br/>Even though he was once the Heaven Emperor of The Upper Realm, he still maintained proper etiquette towards Fang Wang, knowing his place well. His example also influenced the entire Wangdao, shaping its unique rites.<br/><br/>Fang Wang closed his eyes and continued to cultivate.<br/><br/>A month later, a tremendous battle aura erupted from the west, with Fang Wang unfamiliar with both powerful auras. He remained indifferent and focused on cultivating.<br/><br/>This great battle lasted several days before it finally ended.<br/><br/>Three months later, the west saw a surge of auras filled with murderous intent.<br/><br/>The catastrophe for the Grand Yu Divine Dynasty officially erupted!<br/><br/>In the blink of an eye, four years passed.<br/><br/>Fang Wang reached the Eighth Layer of the Heaven-Breaking Realm.<br/><br/>Lately, he noticed that the Spiritual Energy inside the Pilgrimage Manor had become richer. He guessed it was arranged by the Grand Yu Emperor, which made him feel favorable towards him.<br/><br/>Hmm, knows how to get along with others.<br/><br/>One day, as Fang Wang was cultivating, striving to breach the Ninth Layer of the Heaven-Breaking Realm, he suddenly sensed a presence and opened his eyes.<br/><br/>Soon, Hong Xian’er briskly entered the hall, with Xiao Zi following behind her, a vigilant look on her face.<br/><br/>Hong Xian’er was dressed in a long robe of blue and white, with a headband of white crystals on her forehead, adding an ethereal quality to her already perfect features.<br/><br/>She walked in front of Fang Wang and sat down cross-legged, asking curiously, “The Jin Xiao Sect has also come, I hear it was at your invitation?”<br/><br/>Fang Wang opened his eyes and responded, “I haven’t invited them yet, they have already arrived?”<br/><br/>Hong Xian’er nodded, clicking her tongue in wonder, “The Jin Xiao Sect is something else, hiding an old monster at the Ninth Level of the True Soul Realm. It’s said that Zhou Xue, the sole disciple of the Jin Xiao Sect Demon Monarch, is your fiancée?”<br/><br/>Fang Wang smiled and said, “Right, didn’t I mention earlier that I have a fiancée?”<br/><br/>Hong Xian’er pouted and replied, “Hmph, of course I remember. Your fiancée is not too shabby, daring to meddle in the affairs of the Grand Yu Divine Dynasty at this critical moment. Even though she came for you, the Grand Yu Divine Dynasty indeed owes her a favor.”<br/><br/>Ever since the Sea of Devils invaded the Grand Yu Divine Dynasty four years ago, new enemies kept emerging. Now, there were battlefields in every direction of the Human Emperor Continent, placing immense pressure on the Grand Yu Divine Dynasty. Other than Wangdao willing to support the Grand Yu Divine Dynasty, it seemed as if the Human Emperor Continent had been cut off from the outside world, and even some internal sects and noble families had defected. As a member of the Divine Dynasty’s royal family, Hong Xian’er was frequently in battle as well, facing tremendous pressure.<br/><br/>The appearance of the Jin Xiao Sect uplifted both her and everyone in the Grand Yu Divine Dynasty, especially since the Jin Xiao Sect’s first battle deployed a Great Cultivator at the Ninth Level of the True Soul Realm!<br/><br/>“`<br/><br/>This is truly bringing firewood in snowy weather!<br/><br/>“Did you come to me today just to thank her? Is there nothing else?” Fang Wang asked.<br/><br/>He was already eager to break through to the Divine Passage Realm!<br/><br/>By then, his power would soar.<br/><br/>Celestial Qiankun, perhaps, was not unbeatable!<br/><br/>Of course, this was under the pretense that Fang Wang was being modest, given that he had long killed two beings a half-step into the Celestial Qiankun Realm.<br/><br/>Hong Xian’er replied, “Of course not. I am here to give you a heads-up, a Great Cultivator of the Celestial Qiankun Realm is about to make a move. Prepare yourself.”<br/><br/>“How come? If you can gather information on the Celestial Qiankun, why doesn’t that Celestial Qiankun act now?” Fang Wang asked, puzzled.<br/><br/>Hong Xian’er took a deep breath and said, “That Celestial Qiankun has just finished his retreat and has been invited by the Grand Wu God Dynasty. The Grand Wu God Dynasty is one of the few Divine Dynasties in the Eastern Mortal Realm that can compete with the Grand Yu Divine Dynasty. Their territories far exceed those of the Grand Yu Divine Dynasty, and we have already investigated that the Grand Wu God Dynasty is preparing for war, clearly aiming at us.”<br/><br/>The Grand Wu God Dynasty!<br/><br/>Fang Wang had heard about it from Hong Chen before, who said that the biggest adversary in this calamity was the Grand Wu God Dynasty, and those Holy Clans, Imperial Clans were all watching the actions of the Grand Wu God Dynasty, which had the fate of the Celestial Qiankun within it.<br/><br/>Regarding the upcoming great war, Fang Wang was not nervous at all; instead, he was excited.<br/><br/>“Then let them come, and let’s see if I can set the Qiankun in one battle,” Fang Wang murmured softly to himself.<br/><br/>Hong Xian’er gave him a glance and said, “You are indeed very powerful, but to end this calamity in one battle is impossible. After all, the forces involved are countless. Even if you are the strongest of this era, they will wage a long war, trying to find your weak points, or even exhaust you to death, not to mention, you have not yet been recognized as the strongest of this era.”<br/><br/>Fang Wang laughed and said, “Then I will plow through half of the Mortal Realm, just watch. Once this calamity passes, the title of the strongest of the era shall have a successor.”<br/><br/>His tone was not arrogant, but the spirit revealed in his words was overwhelmingly dominating.<br/><br/>Hong Xian’er looked at his face, and for a moment, her gaze became blurred, and she forgot to continue the conversation.<br/><br/>“Hey, hey, hey, I am still here, stinky woman, don’t get spring fever here!” Xiao Zi’s unhappy voice came through, breaking Hong Xian’er out of her reverie.<br/><br/>Hong Xian’er shot Xiao Zi a glance, then stood up, turned around, and left. Xiao Zi hurriedly followed, as if keeping an eye on her.<br/><br/>Fang Wang watched her leaving figure and asked, “Who is the most prominent person on the outside right now?”<br/><br/>“Your Wangdao’s Divine Sect, Jiang Shenming!”<br/><br/>Hong Xian’er didn’t even turn her head to answer, her tone carrying annoyance, as if she had a distaste for Jiang Shenming.<br/><br/>Upon hearing this name, Fang Wang just smiled and was not surprised.<br/><br/>A reincarnation of the Emperor Divine, how could he not become renowned?<br/><br/>Although Wangdao might not have a Great Cultivator of the True Soul Realm, some individuals’ strengths cannot be measured by their realms.<br/><br/>Fang Wang closed his eyes and continued cultivating.<br/><br/>Meanwhile.<br/><br/>Above the ocean, the surface collapsed, forming a gigantic vortex over a hundred miles in diameter. From high above, the bottom of the vortex looked pitch black like an abyss, seemingly bottomless.<br/><br/>Jiang Shenming, dressed in a cyan Dao Robe, stood in the sky, holding the Peach Wood Sword, gazing down indifferently. His voice then resounded:<br/><br/>“Junior, is this the extent of your strength? Daring to challenge Wangdao? The Luo Clan’s sky seems to have blinded your vision. An ant challenging the vast heavens will die a miserable death.”\t\t\t\t\t\t</div>", "images": {}, "success": true}