{"id": 345, "url": "https://www.novelhall.com/i-became-an-immortal-on-mortal-realm-32879/14890456.html", "title": "Chapter 335 - Chapter 335: Chapter 332: Celestial Qiankun, That’S It?", "volume": 4, "volume_title": "Volume 4", "body": "<h1>Chapter 335 - Chapter 335: Chapter 332: Celestial Qiankun, That’S It?</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 335: Chapter 332: Celestial Qiankun, That’s it?<br/><br/>Facing the right index finger of the mystic, Fang Wang remained indifferent. He stared expressionlessly at the mystic and said, “If you don’t display your Celestial Qiankun Totem, the only one who will die is you.”<br/><br/>His voice also resonated through heaven and earth, instantly calming the nervous and uneasy hearts of the countless beings behind him.<br/><br/>This confident tone was as if he would not fear even if the sky fell!<br/><br/>The beings of the Grand Yu Divine Dynasty remembered all of Fang Wang’s past deeds, their eyes brimming with anticipation.<br/><br/>The mystic heard Fang Wang’s words and couldn’t help but burst into laughter, a scornful, frantic laughter.<br/><br/>As the laughter rang out, the firmament changed color, and the starry sky appeared overhead, quickly covering the entire sky. In an instant, it was as if the sky had vanished, and the earth and the ocean were suddenly in the midst of the universe with thousands of stars twinkling above, amazing countless beings.<br/><br/>Gigantic fingers flew out from among the myriad of stars, all aiming for Fang Wang. Each finger was larger than a mountain, and the closer they got, the stronger the oppression felt.<br/><br/>In less than three breaths, thousands of huge fingers hovered beneath the starry sky, all pointing towards the Human Emperor Continent. The diameter of each finger exceeded five hundred zhang, crowding the sky and leaving all living beings on the ocean and the continent dumbfounded, unable to believe their own eyes.<br/><br/>“This…”<br/><br/>“What is that?”<br/><br/>“My heavens, am I under an illusion?”<br/><br/>“It’s over… It’s all over…”<br/><br/>“How is this possible? Could he be an Immortal God descending from the heavens?”<br/><br/>Not only were there thousands of massive fingers hanging in the sky, but also a terrifying oppressive force enveloped the continent and the ocean. Especially in the area near the western edge of the Human Emperor Continent, the Spiritual Power and demonic power of all beings were suppressed, rendering them unable to move.<br/><br/>The mystic stood sideways to Fang Wang, his right index finger ignited with a cyan flame, and he asked, “Are you satisfied now?”<br/><br/>Boom!<br/><br/>Before Fang Wang could reply, a cyan beam erupted from the mystic’s right index finger, directly hitting Fang Wang. Fang Wang’s Yang Energy surged, but he was still engulfed by the rapidly expanding cyan beam.<br/><br/>The corners of the mystic’s mouth turned up, but at that moment, a figure suddenly emerged from the cyan beam in front of him.<br/><br/>It was none other than Fang Wang!<br/><br/>The mystic’s pupils shrank, and he instinctively pushed his finger forward, revealing a sharp edge at his fingertip.<br/><br/>Fang Wang threw a punch. Fist met finger, and instantly the mystic’s index finger fractured. Fang Wang’s fist then powerfully shattered the mystic’s right arm before hitting him squarely in the chest.<br/><br/>Dark light burst forth, and in an instant, the world lost color.<br/><br/>The sky full of massive fingers shattered like broken mirrors, and so did the starry sky. The azure vault of heaven reappeared, making all beings feel as if they had been transported to another world.<br/><br/>Before they could react, a deafening roar filled the air. Fang Wang threw a punch that created a staggering air wave, tearing a huge black rift in the firmament, stretching to the horizon with no end in sight.<br/><br/>Everything happened too quickly!<br/><br/>From the mystic’s first move to Fang Wang’s punch that shattered his Celestial Qiankun Totem, it was all in the blink of an eye.<br/><br/>“Celestial Qiankun, is this all?”<br/><br/>Fang Wang’s voice rang out, the terrifying wind from his punch still howling. The robes of the cultivators fluttered violently as they squinted in the direction of Fang Wang.<br/><br/>The cultivators capable of participating in the battle were all powerful, and they could see things a hundred miles away, especially with no obstructions above the ocean.<br/><br/>They saw Fang Wang standing proudly in the sky, lifting his right arm above his head, holding up the mystic’s body. The sunlight shone down, and Fang Wang’s right fist was buried in the mystic’s chest. Blood gushed like a spring along Fang Wang’s arm, cascading down.<br/><br/>“Ah…”<br/><br/>The mystic couldn’t help but open his mouth, spewing out a mouthful of blood in reverse. The blood had not yet reached Fang Wang when it was turned into flame by the scorching Yang Energy.<br/><br/>Shaking all over, the mystic’s eyes filled with bloodshot lines as he stared at Fang Wang with disbelief and asked in a trembling voice, “How… how is this possible…”<br/><br/>Fang Wang lifted his gaze, his eyes so indifferent that the mystic felt a tremor in his heart. Fang Wang spoke in an emotionless tone, “Didn’t you know that the biggest flaw of the Celestial Qiankun Totem is that its user is within the Totem itself?”<br/><br/>Xuanzhi the Daoist’s pupils suddenly dilated, and just as he was about to finish speaking, Fang Wang’s right arm trembled, and Xuanzhi the Daoist turned to flying ashes and vanished!<br/><br/>With one punch, he burst a Celestial Qiankun!<br/><br/>The dozens of Great Cultivators from the Grand Yu Divine Dynasty who were behind were all dumbstruck, unable to believe their own eyes.<br/><br/>Fang Wang still maintained his punching posture, with a smile curling up at the corner of his mouth.<br/><br/>The Heavenly Gang Supreme Yang Tyrant Body, Nine Dragons Tyrant Fist, and Extinction Divine Force united!<br/><br/>In his palm, he still clenched the Mie Jue Divine Tome!<br/><br/>All were at the Great Perfection Realm!<br/><br/>Only then could he achieve the effect of exterminating Xuanzhi the Daoist with a single punch!<br/><br/>He seemed to punch casually and effortlessly, but in reality, he had exerted all his strength—he wanted to make it seem as if the Celestial Qiankun was nothing in front of him!<br/><br/>“Young master… so strong…”<br/><br/>Xiao Zi was leaning on Fang Wang’s shoulder and couldn’t help but exclaim.<br/><br/>As Fang Wang’s closest companion who had been with him the longest, it could not comprehend the speed of Fang Wang’s growth.<br/><br/>Fang Wang retracted his fist and casually grasped a Storage Ring from the air, then turned around and said, “Let’s go, it’s time to clean up the battlefield!”<br/><br/>This farce should come to an end!<br/><br/>The moment Xuanzhi the Daoist appeared, Fang Wang distinctly felt three powerful divine senses sweep over him, in no way inferior to Xuanzhi the Daoist.<br/><br/>Possessing the Formless Zhou Tian Technique, he wasn’t worried about being spied upon at all; however, with the fall of Xuanzhi the Daoist, those three Celestial Qiankun would likely be deterred as well.<br/><br/>Xiao Zi became excited and began to shout loudly.<br/><br/>Fang Wang didn’t bother with greetings either, stepping toward the north; after five steps, he disappeared from the sight of all living beings.<br/><br/>A brief silence fell upon the world, followed by a thunderous uproar.<br/><br/>“Sss—this is too strong!”<br/><br/>“Celestial Qiankun, that’s a mythic realm above the True Soul Realm. It’s said that only Emperor Donggong of the Grand Yu Divine Dynasty reached that realm in the past.”<br/><br/>“How could the saint be so powerful? Why didn’t he take action before?”<br/><br/>“Nonsense, he obviously didn’t make a move because he was in seclusion. Don’t overlook his age; he’s only in his three hundreds. A ten-year seclusion could bring him great progress!”<br/><br/>“Hahaha! Heaven bless our Grand Yu! I want to see who else dares to contend with the saint!”<br/><br/>“Could it be that the saint has reached the heights of Emperor Donggong?”<br/><br/>Cries of cheer and shouts reverberated over the oceans and continents, with countless people weeping for joy. The decades of grueling war had worn the people of the Grand Yu down, and today, Fang Wang’s punch revitalized their spirits.<br/><br/>Because they saw hope!<br/><br/>At the edge of the sea.<br/><br/>Xu Tian Jiao gazed dazedly in the direction where Fang Wang departed, just like countless other female Cultivators.<br/><br/>Recalling her past encounters with Fang Wang in the Great Saint’s Grotto-Heaven, she suddenly felt as if those memories were unreal, possibly conjured up by her own imagination?<br/><br/>She wasn’t sure, but there was one thing she was certain of—she and Fang Wang were impossible.<br/><br/>The gap was too large!<br/><br/>Even she couldn’t convince herself that she was in any way worthy of Fang Wang.<br/><br/>While Ye Xiang and the others were invigorated and excited, they also harbored similar complex emotions. After all, they had witnessed Fang Wang’s rise from obscurity to reigning supreme over the world, feeling the sensation of a myth coming to life.\t\t\t\t\t\t</div>", "images": {}, "success": true}