{"id": 340, "url": "https://www.novelhall.com/i-became-an-immortal-on-mortal-realm-32879/14885641.html", "title": "Chapter 330 - Chapter 330: Chapter 327: Luo Tian, Demon Lord, Fang Wang’S Opponent", "volume": 4, "volume_title": "Volume 4", "body": "<h1>Chapter 330 - Chapter 330: Chapter 327: Luo Tian, Demon Lord, Fang Wang’S Opponent</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 330: Chapter 327: Luo Tian, Demon Lord, Fang Wang’s Opponent<br/><br/>Fang Wang smiled and said, “The subtleties within, you shall comprehend them later. Zhao Zhen, take him to find a courtyard in the Pilgrimage Manor to settle down and get familiar with his new body.”<br/><br/>Still savoring the Nine Lives Nirvana Sword Technique, Zhao Zhen snapped back to reality and hurriedly led the way.<br/><br/>Xu Yan nodded, followed up with a fist and palm salute to Fang Wang, and then departed with Zhao Zhen.<br/><br/>After they left, Fang Wang muttered to himself, “His cultivation has indeed skyrocketed a lot, but unfortunately, this Shariputra’s cultivation is not as high as his previous peak state.”<br/><br/>He could feel that Xu Yan now possessed a cultivation comparable to the Sky-Stepping Realm, which for Xu Yan, was indeed a blessing in disguise.<br/><br/>The Nine Lives Nirvana Sword Technique was indeed alluring!<br/><br/>However, unfortunately, Shariputras were rare, and it was even harder to find objects of higher cultivation than these two Shariputras.<br/><br/>Moreover, Fang Wang, being in the Great Perfection Realm, could see all the flaws of the Nine Lives Nirvana Sword Technique, such as the inevitable loss of certain memories after resurrection through Nirvana.<br/><br/>Therefore, Fang Wang’s craving for the Nine Lives Nirvana Sword Technique was not that strong.<br/><br/>He hadn’t reached a point of no return yet. Using Shariputra to perform Nirvana and boost his cultivation was probably not a good idea now. If an enemy were to attack during this period and disrupt the Nirvana process, he would be utterly obliterated.<br/><br/>Resurrection through Nirvana seemed to defy the heavens, but the Nirvana process itself was a period of vulnerability when he would be completely defenseless.<br/><br/>The higher the realm, the longer the Nirvana process would take.<br/><br/>Fang Wang didn’t ponder any further and began his cultivation.<br/><br/>In the days that followed, Fang Wang would often feel bursts of strong Sword Intent and Sword Qi within the Pilgrimage Manor; Xu Yan was continuously consolidating his supreme technique.<br/><br/>Fang Wang could feel the looming disaster of the Grand Yu Divine Dynasty drawing ever closer.<br/><br/>In the Grand Yu Divine Dynasty, within the Imperial Palace, upon the great hall for discussions,<br/><br/>The newly enthroned Grand Yu Emperor sat regally upon the dragon throne. He appeared very young, his facial expressions restrained. Rows and columns of civil and military officials stood before him, exuding a sense of oppressive might.<br/><br/>“The Demon Sword has been subdued by Xu Qiuming of the Wangdao Sword Sect, and this sword has drawn the downfall of thousands of cultivators, including over three hundred who had reached the Mahayana Realm in their cultivation.”<br/><br/>“The scripture of the Grand An Divine Dynasty has been acquired by the Demon King. However, the number of casualties caused by this scripture is incalculable. In the process of seizing it, the Demon King has mistakenly killed many, causing widespread discontent.”<br/><br/>“A senior elder of the Taiqing Xuanjiao has passed away in the Eastern Barbarian Long Ridge, and his Lifespirit Treasure has turned into a Magical Artifact, which has also provoked cultivators from surrounding states to fight over it, and the number of casualties remains unclear.”<br/><br/>“A Spirit Vein eruption occurred in Xu Yang Royal City, and the cultivators within were struck by the force from the heart of the earth. Many cultivators lost control during their cultivation due to this force, leading to severe casualties.”<br/><br/>As his subjects continuously reported situations from various places, the Grand Yu Emperor felt his head growing heavy.<br/><br/>Everyone knew the calamity facing the Grand Yu, and they could even feel the impending disaster, but as the enemy had yet to appear, they kept suffering from natural and man-made disasters, and even internal strife. Under such circumstances, the strength of the Grand Yu Divine Dynasty dwindled, unable to be curbed.<br/><br/>As Emperor, he faced the greatest pressure directly.<br/><br/>And this pressure was growing incessantly.<br/><br/>The Grand Yu Emperor gripped the armrests of his throne tightly, striving to remain composed.<br/><br/>Just then, a soldier flew swiftly into the great hall, knelt at the steps, and paid his respects to the Grand Yu Emperor, with everyone’s gaze turning towards him.<br/><br/>“Your Majesty, an honored one from the Luo Clan, the Demon Lord Luo Tian, has sent a challenge, wishing to duel with the Divine Dynasty’s strongest warrior!” the soldier said in a solemn voice that echoed through the hall.<br/><br/>At these words, everyone’s face changed.<br/><br/>It’s here!<br/><br/>Grand Yu Emperor leaned forward and asked, “What is the origin of this Luo Tian Demon Lord?”<br/><br/>An elderly minister spoke up, “Luo Tian Demon Lord is one of the strongest within the Luo Clan, who challenged our Great Ancestor a thousand years ago. After a crushing defeat, he fell into the Sea of Devils, succumbed to demonhood, and made a name for himself as a Demon Lord.”<br/><br/>“A thousand years ago, he had already reached the ninth level of the True Soul Realm!”<br/><br/>The ninth level of the True Soul Realm!<br/><br/>The Grand Yu Emperor’s face changed drastically. He knew what the True Soul Realm signified: it was nearly the pinnacle of the Mortal Realm, as anything beyond—the Celestial Qiankun was almost mythical. At least in the Grand Yu Divine Dynasty, only Emperor Donggong attained the Celestial Qiankun Realm before passing away.<br/><br/>The Grand Yu Emperor quickly asked, “Did the Luo Tian Demon Lord mention when he will come? Where will the decisive battle take place?”<br/><br/>The soldier raised his head and replied, “He said that in one year’s time he would wait at the End of Heaven’s Edge to the west of the mainland. If the Divine Dynasty does not send someone to battle, he will lead four hundred demonic sects from the Sea of Devils to invade the Divine Dynasty, drawing out the souls of the Grand Yu’s citizens to forge demon banners!”<br/><br/>“Audacious!”<br/><br/>The Grand Yu Emperor roared in fury, unable to contain his Spiritual Power, which manifested as dragon-shaped flames encircling his body.<br/><br/>The civil and military ministers in the hall were equally enraged, denouncing Luo Tian Demon Lord’s arrogance. Soon, the grand hall was plunged into an uproar.<br/><br/>After a long while.<br/><br/>The Grand Yu Emperor, with a grim face, asked, “Are there any cultivators in the court at the True Soul Realm?”<br/><br/>The hall fell silent in an instant.<br/><br/>After a few breaths, Emperor Tao spoke up, “Your Majesty, ordinary cultivators of the True Soul Realm are no match for Luo Tian Demon Lord. We must find a Great Cultivator at the ninth level of the True Soul Realm. We can only seek help from the old ancestors of the major sects. One year is not a long time; Your Majesty should personally request their assistance.”<br/><br/>Hearing this, the Grand Yu Emperor looked even more displeased.<br/><br/>He couldn’t help asking, “Does Wangdao have any cultivators who can contend with Luo Tian Demon Lord?”<br/><br/>Emperor Tao shook his head and said, “Except for the Dao Master of Pilgrimage, there are no True Soul Realm Great Cultivators in Wangdao. Since Pilgrimage is in seclusion, it’s best not to disturb him. Luo Tian Demon Lord is definitely not the ultimate enemy of the Grand Yu Divine Dynasty. Asking the Dao Master to take action now would be disadvantageous for us.”<br/><br/>His words were met with agreement from the other ministers. The Grand Yu Divine Dynasty had a profound heritage, and all the ministers present wielded enormous influence, each with their own intelligence networks.<br/><br/>Just thinking about that information made them shudder.<br/><br/>The Grand Yu Emperor’s expression fluctuated as he fell into silence.<br/><br/>In the month that followed, news of Luo Tian Demon Lord’s impending attack spread like wildfire across the Human Emperor Continent. Even though the Grand Yu Divine Dynasty tried to suppress the information, it could not be contained, as if it had taken on a life of its own.<br/><br/>Tales of Luo Tian Demon Lord’s terrifying martial exploits also spread, leaving the citizens of the Grand Yu Divine Dynasty anxious and feeling as though a great disaster was imminent. Everyone knew that Luo Tian Demon Lord was just the beginning of the calamity, with certainly more enemies to follow.<br/><br/>Emperor Donggong had offended too many forces while quelling the Mortal Realm!<br/><br/>Months passed.<br/><br/>When less than half a month remained before the day of the decisive battle, Hong Chen paid a visit to Fang Wang.<br/><br/>Fang Wang sat with his eyes closed, Qi gathering while asking, “When will this Luo Tian Demon Lord arrive?”<br/><br/>Although he had been cultivating all this time, he occasionally heard the discussions of the cultivators in the Imperial City, which kept him informed about the state of the world.<br/><br/>A mere ninth level of the True Soul Realm dares to cause trouble?<br/><br/>Death!<br/><br/>Hong Chen replied, “He has already arrived and is waiting at the End of Heaven’s Edge. You don’t need to take action. Let the Grand Yu Divine Dynasty take the brunt first. When they can almost no longer hold out, Wangdao will make a move. Continue your cultivation and strive to become stronger. Your adversary is that person who wields the power of the Doom God, who is likely at the Celestial Qiankun Realm. He is extremely cautious and has always wanted to test your capabilities. You have already slain two existences at the Half-Step Universe Realm, which is enough to make you feared by those at the Celestial Qiankun Realm.”\t\t\t\t\t\t</div>", "images": {}, "success": true}