{"id": 343, "url": "https://www.novelhall.com/i-became-an-immortal-on-mortal-realm-32879/14887742.html", "title": "Chapter 333 - Chapter 333: Chapter 330: Today, We Can Destroy Dayu", "volume": 4, "volume_title": "Volume 4", "body": "<h1>Chapter 333 - Chapter 333: Chapter 330: Today, We Can Destroy Dayu</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 333: Chapter 330: Today, We Can Destroy Dayu<br/><br/>“`<br/><br/>Merely mastering divine skills does not qualify one for the Divine Passage Realm.<br/><br/>Fang Wang had already mastered divine skills, but he wasn’t in the Divine Passage Realm. Now, having reached the Eighth Layer of the Heaven-Breaking Realm, he had begun to comprehend the mysteries of the Divine Passage Realm.<br/><br/>The Divine Passage Realm is the state where one creates divine skills!<br/><br/>Such divine skills, like a Lifespirit Treasure, involve creating new divine skills!<br/><br/>Fang Wang mastered many divine skills, but none truly belonged to him, so he was very interested in creating his own divine skills.<br/><br/>The fact that he killed two cultivators of the Sky-Stepping Realm instantly with the Great Perfection Extinction Divine Record tonight was one of his attempts.<br/><br/>He no longer needed those imposing divine skills; he needed something simpler and more direct. He believed that amassing the immense power of the Extinction Divine Record was far less impactful than the shock he delivered to Xu Yan by concealing the Extinction Divine Record within his palm.<br/><br/>Fang Wang closed his eyes, gathering Qi while pondering over all his divine skills.<br/><br/>Deciding which type of divine skill to create was worth considering.<br/><br/>The night after the incident gradually brightened and then darkened once more, signifying the passage of days and nights.<br/><br/>Fights were unceasing at the edge of the Human Emperor Continent, with endless enemies attacking from overseas. In the Imperial City, countless soldiers flew in and out every day, creating a tense atmosphere.<br/><br/>Several months later.<br/><br/>Hong Chen found Xu Yan, said something to him, and he nodded before leaving the Pilgrimage Manor.<br/><br/>The Pilgrimage Manor remained peaceful; besides Xiao Zi occasionally going out, Zhao Zhen still sat inside the small pond, gazing at the water and comprehending the mysteries of the Nine Lives Nirvana Sword Technique.<br/><br/>He didn’t want to be a ghost forever. This cultivation world was too fascinating, and he too wished to resurrect and carve out a reputation of his own.<br/><br/>Time flew by, and five years passed in the blink of an eye.<br/><br/>The sky over the Grand Yu Divine Dynasty wasn’t clear anymore but shrouded with dark clouds. Even the Imperial City was engulfed in darkness, its walls constantly gathering formations, guarding against something unknown.<br/><br/>Suddenly, a sword light pierced through the darkened heavens and earth, prompting figures to fly out from the Imperial City to look in the direction of the sword light. Even Zhao Zhen, who was deep in contemplation, opened his eyes to watch.<br/><br/>In the Northern territory of the Human Emperor Continent, a blizzard obscured the sky; the mountain peaks, revealing only their ridges, resembled the scaly armor of an ancient monstrous beast, fierce and boundless.<br/><br/>Numerous cultivators hovered above these ridges, led by Xu Qiuming with Xu Yan among them. There were dozens of them, all Sword Cultivators of the Looking Path.<br/><br/>In front of them, amidst the heavy snow at the horizon, a horrifying monstrous entity surfaced, with many huge tentacles. Given the distance, its true form remained obscured, but its sheer size was evident from its outline, where the mountains it passed were no more than steps.<br/><br/>At the moment, Xu Qiuming and the others were not focused on the monstrous entity in the distance but were instead looking back.<br/><br/>In the direction they gazed, a swath of the vast sky was cleaved by a sword light descending from above. The sword light was so bright that not even the covering snow could conceal it.<br/><br/>Xu Yan squinted his eyes, murmuring to himself, “That’s a very powerful Sword Intent.”<br/><br/>In Xu Qiuming’s hand was a Broad Sword that emanated a bloody aura. Below the hilt seemed to be a kirin breathing out the sword blade, with mysterious patterns resembling natural sceneries etched on the edges—it was hard to discern whether they depicted a sea of flames or a grassy landscape.<br/><br/>This was the Demon Sword he had subdued years ago.<br/><br/>The Demon Sword trembled and buzzed crisply.<br/><br/>The sword light on the horizon was growing larger, clearly approaching their position.<br/><br/>Xu Qiuming turned around and looked toward the distant mysterious monster, saying, “This Sword Intent is coming from within the Divine Dynasty. It must be someone coming to assist us, preparing to confront that abomination!”<br/><br/>The other Sword Cultivators followed his gaze, their eyes fierce.<br/><br/>“I never expected the Grand Yu Sword Lunatic, a figure of legends, to be still alive. Perfect, let this master taste the most pure and powerful Sword Intent in the world!” sneered a voice from the direction where the mysterious monster was, filled with murderous intent.<br/><br/>Without a word, Xu Yan transformed into a streak of sword light and charged forward. As soon as his figure was obscured by the snow, powerful bursts of Sword Qi erupted, scattering the snow in the heavens and earth. The very ground trembled, and the mountain ranges below were set off into avalanches.<br/><br/>Xu Qiuming was about to act when a strong wind blew from behind, tousling his hair. His pupils dilated as he caught a glimpse of a figure that brushed past him.<br/><br/>“`<br/><br/>“What is that…?”<br/><br/>…<br/><br/>Another two years had passed, and Fang Wang had finally reached the Ninth Layer of the Heaven-Breaking Realm.<br/><br/>Ever since that fateful encounter seven years ago, when two mysterious cultivators from the Sky-Stepping Realm had met their end at Fang Wang’s hands, no more enemies had dared to infiltrate the Pilgrimage Manor.<br/><br/>Fang Wang had been prepared to charge into the Divine Passage Realm in one go, but the terrifying pressure of battles from all around the Grand Yu Divine Dynasty made him realize he could no longer remain idle.<br/><br/>He stood up to stretch his muscles and called for Hong Chen to enter.<br/><br/>In the past year, Hong Chen had been staying inside the Pilgrimage Manor, occasionally going out but mostly within the Imperial City. He had not been participating in the war, but rather planning strategies here.<br/><br/>Soon, Hong Chen arrived.<br/><br/>He saluted Fang Wang and then said, “It seems the Dao Master has already felt it; four cultivators of the Celestial Qiankun Realm are about to make their move, three of whom have recently confirmed their reach into that realm. It is likely that the powers from The Upper Realm have guided them.”<br/><br/>Four cultivators of the Celestial Qiankun Realm!<br/><br/>Fang Wang spoke, “I only sensed numerous True Soul Realm and Sky-Stepping Realm battles on various fronts. How long until those four Celestial Qiankun arrive?”<br/><br/>Hong Chen answered, “Soon. They are also hesitating. If they decide to, they could descend onto the battlefield at any moment.”<br/><br/>“The Grand Yu Divine Dynasty can probably hold out for another three to four years, but if a Celestial Qiankun intervenes, it will be hard to withstand even a day.”<br/><br/>This was the power of Celestial Qiankun, the pinnacle of human cultivation!<br/><br/>Fang Wang inquired, “The Wangdao and Jin Xiao Sect should have already shown their strength, right?”<br/><br/>“Indeed, the Dao Sects have proven themselves, and so have the Daoist elders of each sect,” Hong Chen replied.<br/><br/>He paused for a moment and then added, “You can make your move at any time, as long as you have the confidence to slay those of the Celestial Qiankun.”<br/><br/>Fang Wang nodded, took a step towards the door, with Hong Chen following closely behind.<br/><br/>As the two stepped out of the door, Fang Wang’s voice rang out.<br/><br/>“Xiao Zi, do you wish to follow me into battle?”<br/><br/>“Naturally, I am willing. But, won’t I just be a burden to you now?”<br/><br/>“Without you, slaying enemies would simply be too dull.”<br/><br/>“All right, then I will join you, my lord!”<br/><br/>…<br/><br/>Blue skies and white clouds made for a pleasant scenery.<br/><br/>On a cliffside, two rows of soldiers clad in golden armor stood as steadfast as peaks, stretching from the cliff all the way into the depths of the forest, covering several miles at the least.<br/><br/>Two figures walked between the rows of soldiers, one in a dragon-embroidered black robe, the other in a fitted Dao robe—both exuded an immense sense of oppression with every gesture and movement.<br/><br/>The Grand Wu Emperor looked at the man in the Dao robe next to him, a smile appearing on his majestic face, “For this trip to Grand Yu, we are troubled by your efforts, senior.”<br/><br/>The man in the Dao robe appeared to be just past forty, with two strands of white hair at his temples that added to his dignified air. He calmly said, “Since it’s the will of Heaven, there is no trouble at all.”<br/><br/>Xuan Zhi Daoist, of the Celestial Qiankun Realm!<br/><br/>All the soldiers standing guard were extraordinary cultivators, but none dared look directly at Xuan Zhi Daoist. With each step Xuan Zhi Daoist took, it felt as if he was stepping on their hearts, causing discomfort and heaviness in their chests.<br/><br/>The Grand Wu Emperor asked with a laugh, “May I ask, senior, when you will arrive at the Grand Yu Divine Dynasty? So that I may give the orders in advance.”<br/><br/>“When?”<br/><br/>Xuan Zhi Daoist stopped in his tracks, glanced at the Grand Wu Emperor with a cold gaze, and said, “Today, I can reach Grand Yu. Today, I can annihilate Grand Yu. And today, I can execute Tian Dao Fang Wang!”\t\t\t\t\t\t</div>", "images": {}, "success": true}