{"id": 347, "url": "https://www.novelhall.com/i-became-an-immortal-on-mortal-realm-32879/14893136.html", "title": "Chapter 337 - Chapter 337: Chapter 334: Assault Of The Holy Clans, Imperial Clans", "volume": 4, "volume_title": "Volume 4", "body": "<h1>Chapter 337 - Chapter 337: Chapter 334: Assault Of The Holy Clans, Imperial Clans</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 337: Chapter 334: Assault of the Holy Clans, Imperial Clans<br/><br/>“`<br/><br/>Whoosh whoosh——<br/><br/>The desolate cold wind was sweeping wildly above the sea of clouds, fluttering Fang Wang’s black hair. His black clothes were like blazing flames. The muscle lines exposed on his chest were so perfect, and the palpable sense of strength that surged forth made him seem overwhelmingly oppressive.<br/><br/>Fang Wang stood on Xiao Zi’s head, with his right arm raised. The Heavenly Palace Halberd materialized in his hand. He spun the Heavenly Palace Halberd with one hand and a smile appeared on his face.<br/><br/>As his cultivation grew higher, the power displayed by the Heavenly Palace Halberd also became stronger, and it was still very fitting for his strength.<br/><br/>Feeling the power of the Heavenly Palace Halberd, Xiao Zi couldn’t help but ask, “Has the enemy arrived?”<br/><br/>Fang Wang replied, “Yes, they have arrived. This time the enemy is different from before. You can get ready now.”<br/><br/>Upon hearing this, Xiao Zi instantly contracted and burrowed into the Heavenly Palace Halberd, causing purple dragon scales to appear on its surface.<br/><br/>Fang Wang’s speed slowed down, but he did not stop and continued to fly forward with the momentum.<br/><br/>There were no traces of ice or snow in this area. Green mountains stretched on with rivers crisscrossing below. From the high sky, the view was magnificent and picturesque.<br/><br/>At that moment, the sky changed colors. The firmament instantly turned to dusk, with the crimson twilight covering the sky. Meteors appeared on the horizon, falling with immense momentum, igniting waves of raging flames.<br/><br/>The mountains on the land were quickly replaced by volcanoes, and billowing smokes rose up, rendering the entire world murky.<br/><br/>With an expressionless face, Fang Wang reflected inwardly, “The Spirit Elephant of Celestial Qiankun is indeed useful.”<br/><br/>He did not sense the presence of the enemy, indicating that they were outside the range of the Spirit Elephant.<br/><br/>The Spirit Elephant of Celestial Qiankun was not an illusion but existed like a small world, with special rules, which strongly suppressed those trapped within. This suppression was not only physical but also affected the soul and senses.<br/><br/>“Fang Wang, just who are you?”<br/><br/>An imposing voice sounded, the tone heavy. Although Fang Wang was trapped in his Spirit Elephant, the speaker still did not dare to be careless.<br/><br/>“Although Xuanzhi Daoren has just stepped into the Celestial Qiankun, that is still a genuine Celestial Qiankun. How could the Heaven-Breaking Realm possibly slay someone from the Celestial Qiankun? This person must have a significant background.”<br/><br/>“Emperor Donggong is not to be underestimated. If he can stake everything on one person, there must be a reason behind it, perhaps the reincarnation of a Great Emperor.”<br/><br/>Two other voices joined, their tones equally tense.<br/><br/>Fang Wang looked up and asked, “What kind of interest could make you target the Grand Yu Divine Dynasty so? Or, what kind of power has compelled you?”<br/><br/>“Celestial Qiankun, as tall as heaven and earth, but it seems, in the eyes of another group of people, it is still but a mere ant.”<br/><br/>His tone was indifferent, as if he did not regard the three of the Celestial Qiankun highly.<br/><br/>“Hmph! Since you understand, why be so stubborn!”<br/><br/>The first imposing voice rose again, concealing a murderous intent.<br/><br/>Fang Wang raised the Heavenly Palace Halberd and pointed it obliquely at the firmament, saying, “Perhaps it’s because I am stronger than you.”<br/><br/>Whoosh——<br/><br/>The Heavenly Palace Halberd ignited with yang energy flames. Behind Fang Wang, the silhouette of the Mie Jue Divine Tome emerged, dark and mysterious.<br/><br/>“Hmph!”<br/><br/>A cold snort sounded, and everything between heaven and earth began to rage. Mountains crumbled and the lava within the volcanoes erupted, transforming into countless fire dragons that attacked Fang Wang.<br/><br/>The sky was collapsing, the earth was rising, and all things seemed to come to life, all aiming to kill Fang Wang.<br/><br/>At that moment, Fang Wang appeared to be contending against the entire world.<br/><br/>He was far from panicked; instead, his face bore a defiant smile.<br/><br/>He immediately smashed the Heavenly Palace Halberd onto the earth.<br/><br/>Boom!<br/><br/>The Heavenly Palace Halberd pierced the ground at incredible speed. Subsequently, the desolate land shattered, and a terrifyingly formidable power erupted, causing the world to lose its color.<br/><br/>“`<br/><br/>Meanwhile, elsewhere,<br/><br/>Above the mountains, three figures stood suspended in the air. All three were beings of the Celestial Qiankun Realm, known respectively as Zhu Lang Mountain Lord, Ancestral Master Jiangmo, and Dao Nineteen.<br/><br/>Zhu Lang Mountain Lord, dressed in deep yellow Dao Robes, had a dramatic change in expression as he said in a grave voice, “My Spirit Elephant can’t hold him back!”<br/><br/>The crane-haired yet youthful-looking lord exhibited panic in his eyes, unable to maintain the composure of an enlightened sage.<br/><br/>“How laughable, it seems your Spirit Elephant is unstable. You still need another thousand years of cultivation!”<br/><br/>The speaker was Dao Nineteen, clad in form-fitting black attire with dark gold scale armor draped over his shoulders, white beast fur lining the collar, and a cape fluttering violently behind him. Atop his forehead rested a crown reminiscent of dragon bones.<br/><br/>His presence was the mightiest, resembling a devastating evil king of world destruction!<br/><br/>Ancestral Master Jiangmo, holding a horsetail whisk, exuded an immortal aura and Daoist bones. His long eyebrows concealed his eyes, giving off an air of profound inscrutability; he remained silent, his thoughts unknown.<br/><br/>Zhu Lang Mountain Lord’s face darkened, about to say something, when he suddenly retreated explosively. Not just him—Ancestral Master Jiangmo and Dao Nineteen did likewise.<br/><br/>The space between the three shattered like glass, and fierce Yang Energy flames, as if pouring from a different dimensional space, instantly covered the Firmament within a thousand miles, plunging the entire land into a sea of fire.<br/><br/>Fang Wang stepped out from the midst of the inferno, looking down upon the three Celestial Qiankun beings, and said in a detached tone, “Gentlemen, no more chatting, today we’re here to decide life and death.”<br/><br/>He raised his right arm, and the Heavenly Palace Halberd flew out from the flames behind him into his hand.<br/><br/>Zhu Lang Mountain Lord, Ancestral Master Jiangmo, and Dao Nineteen each conjured their own Lifespirit Treasures, ready to fight.<br/><br/>Fang Wang vanished into thin air, instantly appearing behind Dao Nineteen, and swept the Heavenly Palace Halberd across.<br/><br/>Lingxiao Divine Sect!<br/><br/>His speed of movement was so fast that it caught all three Celestial Qiankun beings off-guard.<br/><br/>Clang—!<br/><br/>Dao Nineteen reacted quickly enough, instinctively blocking with his Demon Blade, but he was still struck by Fang Wang and flew out, disappearing from the Human Emperor Continent in the blink of an eye, his life and death uncertain.<br/><br/>Zhu Lang Mountain Lord and Ancestral Master Jiangmo each cast spells, flanking Fang Wang from both sides.<br/><br/>Their fighting spirit exploded, startling the entire Human Emperor Continent, surpassing even the might of Xuan Zhi Dao Ren from before.<br/><br/>…<br/><br/>Above the Endless Ocean, colossal ships advanced, some on the surface of the water, others in the air. They varied in size and shape—the largest being like mountains, with cities founded upon them, the smallest akin to flood dragons, guarding beside the leviathan vessels.<br/><br/>The largest ship bore a flag with a single massive character inscribed on it.<br/><br/>Qin!<br/><br/>On its deck, a middle-aged man in a Brocade Robe held one hand behind his back, a thumb ring on his thumb, which he was spinning.<br/><br/>The wind ruffled his sideburns as he gazed into the distance.<br/><br/>Suddenly, the winds that buffeted the ship intensified, billowing his robe and changing his expression.<br/><br/>“Set sail, level the Grand Yu Divine Dynasty!”<br/><br/>He shouted at the top of his voice, resounding beneath the Firmament, stirring the hearts of all the Cultivators aboard the ships.<br/><br/>Boom! Boom! Boom…<br/><br/>All the ships erupted with Spiritual Power waves, their speed surging dramatically, leaving behind spectacular trails in the sky, tearing the sea into countless areas.<br/><br/>Not only the Qin family, but many Holy Clans, Imperial Clans were also converging on the Human Emperor Continent.<br/><br/>Above the skies of the Human Emperor Continent, thunderclouds tumbled, casting the Grand Yu Mortal Realm into darkness.<br/><br/>The true calamity had only just begun to descend!\t\t\t\t\t\t</div>", "images": {}, "success": true}