{"id": 346, "url": "https://www.novelhall.com/i-became-an-immortal-on-mortal-realm-32879/14890457.html", "title": "Chapter 336 - Chapter 336: Chapter 333: Number One Or Two In The Mortal Realm", "volume": 4, "volume_title": "Volume 4", "body": "<h1>Chapter 336 - Chapter 336: Chapter 333: Number One Or Two In The Mortal Realm</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 336: Chapter 333: Number One or Two in the Mortal Realm<br/><br/>From the western battlefield to the northern frontier of the Human Emperor Continent, Fang Wang took only a dozen steps. The clamor of the western battlefield had just begun when he already arrived at the encampment in the northern frontier.<br/><br/>Although the northern frontier of the Human Emperor Continent was covered in incessant snowfall, it was filled with countless Cultivators. From the sky above, one could see the huge figures of magical beasts dragging various Heavenly Materials and Earthly Treasures, Magical Artifacts, and Magic Artifacts.<br/><br/>The blizzard whirled, and looking in the direction of the encampment, one could vaguely see flames on the horizon.<br/><br/>Fang Wang had already sensed a powerful aura from the True Soul Realm, as well as numerous traces of Demonic Qi.<br/><br/>In this area, there were also figures of Wangdao Cultivators and Jin Xiao Sect Cultivators; Zhu Rulai and the reincarnated Shenxin of the Upper Realm’s Buddhist child were both present, yet neither had joined the battle at this point.<br/><br/>Xiao Zi swiftly enlarged and landed under Fang Wang’s feet, carrying him forward as they flew.<br/><br/>Over the years, Xiao Zi’s cultivation had also been increasing continuously. Although it couldn’t catch up with Fang Wang, it was still considered a Great Demon. It revealed a two-hundred-zhang-long dragon body, radiating Dragon Qi, which turned the passing snowflakes into scorching vapor.<br/><br/>Accompanied by a dragon’s roar, all the Cultivators and Monsters below turned their heads to look, with innumerable gazes locking onto Xiao Zi.<br/><br/>Xiao Zi hadn’t enjoyed such attention in a long time and was extremely excited. It deliberately didn’t fly at full speed, allowing more and more people to see Fang Wang on its head.<br/><br/>Many people were curious about who he was.<br/><br/>It wasn’t until Wangdao Cultivators recognized Fang Wang’s identity that the news spread quickly, invigorating more and more Cultivators.<br/><br/>“The pilgrimage has come!”<br/><br/>Someone shouted with arms raised high, their voice filled with extreme excitement.<br/><br/>Zhu Rulai stepped out from the loft, standing on the terrace and looking up at the figures of Fang Wang and Xiao Zi. Even from a distance, he still made out Fang Wang’s figure, and a smile appeared on his face.<br/><br/>In the distance, beneath an old tree covered in snow where Shenxin was meditating, he opened his eyes and looked. Ripples appeared in his usually calm eyes.<br/><br/>Xiao Zi flew over the encampment, heading toward the distant flames.<br/><br/>Standing on the Dragon Head, Fang Wang gazed intently ahead and saw countless Monsters wreaking havoc, putting the Cultivators from the Grand Yu Divine Dynasty, Wangdao, and Jin Xiao Sect in fierce combat.<br/><br/>Hovering in the center of the Monster army was a figure wearing a wide and long black robe. The man had two horns on his forehead, wild and disheveled hair, and his face was covered with bizarre, green lines that resembled numerous small snakes.<br/><br/>The robed man also saw the figure of Xiao Zi and immediately narrowed his eyes. He had clearly felt the momentum of the battle from the western edge of the Human Emperor Continent but couldn’t see exactly what had happened.<br/><br/>The battle had erupted suddenly and ended just as quickly, leaving the robed man hesitating, unsure whether to retreat.<br/><br/>He was Yi Zun, the unparalleled Demon Lord from the Sea of Devils.<br/><br/>“Riding a Purple Dragon… could it be the pilgrimage from the Grand Yu Divine Dynasty?” Yi Zun frowned as he speculated.<br/><br/>As soon as this thought crossed his mind, he immediately considered retreating.<br/><br/>Boom!<br/><br/>A terrifying gust of wind swept in, startling Yi Zun, who was contemplating his next move. His complexion drastically changed as he lifted his arm reflexively. However, a forefinger pressed against his forehead with even greater speed.<br/><br/>Suddenly, Fang Wang appeared before him, creating a vacuum behind him. Ferocious and terrifying Monsters were blown to either side, creating a spectacular scene.<br/><br/>Looking down at Yi Zun, Fang Wang asked, “Do you know the one from earlier, the Celestial Qiankun?”<br/><br/>Yi Zun was completely stiff, feeling an endless tide of murderous intent lock onto him, making his True Soul tremble within.<br/><br/>“I know him… Xuan Zhi Dao Ren, he comes from the Nine Heavens Ocean… Are you Tian Dao Fang Wang?” Yi Zun forced himself to remain composed and answered truthfully.<br/><br/>Fang Wang stared at him and asked, “What do you think of Daoist Xuan Zhi’s finger technique?”<br/><br/>Yi Zun hurriedly replied, “It’s one of the best in the Mortal Realm. He has shaped his right index finger into his Lifespirit Treasure, seemingly casual, but that finger is actually his strongest means of slaying enemies…”<br/><br/>Whoosh——<br/><br/>A surge of powerful energy burst forth from Fang Wang’s right index finger, piercing through Yi Zun’s forehead, and brilliant blood blossoms bloomed from the back of Yi Zun’s head.<br/><br/>“You…”<br/><br/>Yi Zun’s eyes widened, the blue veins on his face suddenly protruding, transforming into several venomous snakes lunging at Fang Wang.<br/><br/>But these venomous snakes turned to ash the moment they were about to touch Fang Wang, and not just them, Yi Zun’s physical body did as well.<br/><br/>Fang Wang casually took the two storage pouches from his waist and attached them to his own belt.<br/><br/>The eighth level True Soul Realm Cultivator Yi Zun had no power to fight back in his hands!<br/><br/>“Dao Power combined with the force of the Mie Jue Divine Tome is still somewhat forced; these two domineering powers are difficult to fuse,” Fang Wang thought to himself.<br/><br/>Dao Power is the force of the Immeasurable Pure Bone Technique, starkly different from Spiritual Power, with extremely terrifying penetrative power. Just now, one finger pierced through Yi Zun’s physical body and True Soul.<br/><br/>Of course, Fang Wang could have increased his attack range and directly turned Yi Zun into ash, but he wanted to test his finger technique, just piercing Yi Zun’s forehead, which was not enough to annihilate Yi Zun. Inside that powerful surge of energy, besides Dao Power, it also harbored the force of the Mie Jue Divine Tome; unfortunately, these two powers could not fuse. After the Dao Power dissipated, the destructive force of the Mie Jue began to destroy Yi Zun.<br/><br/>Seeing the previously invincible Yi Zun being forcibly slain by Fang Wang, the Grand Yu Divine Dynasty, Wangdao, Jin Xiao Sect, and the Great Demons under Yi Zun’s command were all dumbfounded, unable to believe their eyes.<br/><br/>Just then, a powerful gale from the west of the Human Emperor Continent swept in; it was the aftermath of the battle between Fang Wang and Daoist Xuan Zhi, now reaching here.<br/><br/>The strong wind brought up a blizzard, ravaging the mountains and land, causing countless Cultivators to raise their arms to shield their faces.<br/><br/>They struggled to look upwards, just in time to see Fang Wang’s figure moving rapidly, one after another Monster turning into a mist of blood. In less than a moment, the entire sky seemed to be tinged red with blood.<br/><br/>When Fang Wang stopped, he calculated that he had slain over one hundred thousand Great Demons, all of them strong. Any one of them could have blood-washed Grand Qi three hundred years ago.<br/><br/>Fang Wang raised his hand to beckon, and Xiao Zi immediately flew to him, carrying him forward.<br/><br/>The carnage had not ended!<br/><br/>The Grand Yu Divine Dynasty, Wangdao, and the Jin Xiao Sect had suffered from wars for so many years, but it was not just scaring the enemy away that would end their ordeal; Fang Wang intended to stop killing with killing, making sure that half the Mortal Realm would not dare to invade Grand Yu again!<br/><br/>Whoosh——<br/><br/>Fang Wang took out a piece of black clothing and quickly changed into it, so fast that it seemed as though the white robes turned into black robes in the fluttering.<br/><br/>Before long, he heard a tremendous uproar behind him, bringing a smile to the corner of his mouth.<br/><br/>Zhu Rulai watched Fang Wang’s departing figure, his eyes filled with a sense of loss.<br/><br/>He had crossed hands with Yi Zun and been injured, which was why the Great Cultivators of the Grand Yu Divine Dynasty had replaced him to allow him to recuperate first.<br/><br/>He had a premonition that the gap between him and Fang Wang would only grow wider.<br/><br/>The feeling of being overtaken and rapidly left behind by a junior was not pleasant at all.<br/><br/>Zhu Rulai gave a wry smile to himself, but he was not discouraged; instead, his eyes became more resolute.<br/><br/>One day, he was certain that he would stand beside Fang Wang and have the world remember his name.\t\t\t\t\t\t</div>", "images": {}, "success": true}