{"id": 349, "url": "https://www.novelhall.com/i-became-an-immortal-on-mortal-realm-32879/14895398.html", "title": "Chapter 339 - Chapter 339: Chapter 336: Canghai’S Massacre", "volume": 4, "volume_title": "Volume 4", "body": "<h1>Chapter 339 - Chapter 339: Chapter 336: Canghai’S Massacre</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 339: Chapter 336: Canghai’s Massacre<br/><br/>Ancestral Master Jiangmo subconsciously turned his head to look, catching Fang Wang’s gaze out of the corner of his eye, and in that moment, his Dao Heart trembled.<br/><br/>His left hand, poised at his waist, immediately flipped over to cast a spell, and a resplendent white light burst forth from within him, forming the illusion of a Great Cauldron that swiftly expanded in size.<br/><br/>Boom!<br/><br/>Fang Wang’s right fist, carrying the tyrannical power to destroy everything, smashed down, brutally shattering the illusion of the Great Cauldron and then landing on the back of Ancestral Master Jiangmo.<br/><br/>The sound of breaking bones was crisp and piercing!<br/><br/>Ancestral Master Jiangmo coughed up blood. His body fell like a meteor towards the ground, piercing through the earth.<br/><br/>Fang Wang then turned around, moving to attack Zhu Lang Mountain Lord, with the Heavenly Palace Halberd flying back into his hand, the blade still coated with Dao Nineteen’s bloodstains.<br/><br/>The color drained from Zhu Lang Mountain Lord’s face. He spread his arms wide, and behind him, clouds churned, and a crimson moon rose, occupying half the sky. In front of this crimson moon, all things could feel their own insignificance.<br/><br/>Just then, an earth-shattering aura erupted from all directions, and Fang Wang abruptly stopped.<br/><br/>So many from the Sky-Stepping Realm, the True Soul Realm!<br/><br/>Fang Wang instantly guessed the truth—those Saint Clans, Imperial Clans were launching a full-scale attack on the Human Emperor Continent.<br/><br/>Zhu Lang Mountain Lord, disheveled, felt it too and cried out loudly, “With such a heavenly momentum, the Grand Yu Divine Dynasty is impossible to withstand. Regardless of whether you are Emperor Donggong, you should understand that everything must comply with heaven’s will. Even the Grand Yu Divine Dynasty was established over another powerful dynasty’s fate!”<br/><br/>“Change between the old and new is the eternal, unchanging order of heaven and earth. Only by breaking the old order and rebuilding a new pattern can this world step into an era of great contention!”<br/><br/>“The fate of the Grand Yu Divine Dynasty is too weighty. Only by sharing it with all living beings can we promote the development of the Mortal Realm. You must not oppose the common people any longer!”<br/><br/>Strands of peculiar aura emerged from the crimson moon, seeping into Zhu Lang Mountain Lord’s body, making his presence begin to soar.<br/><br/>Fang Wang withdrew his gaze and looked back at Zhu Lang Mountain Lord, calmly saying, “Do you think you can represent all living beings?”<br/><br/>He raised the Heavenly Palace Halberd high, slicing through the Firmament with one strike. Instantly, a black rift appeared in the sky, stretching hundreds of miles. He then aimed his halberd at Zhu Lang Mountain Lord.<br/><br/>Whoosh—<br/><br/>Out of the black rift in the sky surged a wild river, golden in color, with a magnificent presence, like an ancient Golden Dragon breaking through heaven.<br/><br/>Zhu Lang Mountain Lord stared intently. It seemed he thought of something, and exclaimed in disbelief, “Heavenly Emperor River! How is that possible!”<br/><br/>The Heavenly Emperor River, the third level Divine Skill of the Heavenly Emperor Imperial Mirror, could only be unleashed by someone at the Heaven-Breaking Realm!<br/><br/>Zhu Lang Mountain Lord had also sought the legacy of the Hongxuan Emperor but no matter which realm he reached, he could never defeat the Hongxuan Emperor of the same realm. Although he failed, he had witnessed many Divine Skills of the Heavenly Emperor Imperial Mirror and was profoundly impressed.<br/><br/>With the emergence of the Heavenly Emperor River, its torrent swelled violently, like an enraged ancient Golden Dragon, claws bared, pouncing toward Zhu Lang Mountain Lord, and in the blink of an eye, it reached him.<br/><br/>Zhu Lang Mountain Lord pushed forward with both arms, and the immense crimson moon swept past him to meet the oncoming Heavenly Emperor River.<br/><br/>Roar—<br/><br/>The Heavenly Emperor River engulfed both Zhu Lang Mountain Lord and the crimson moon. The river was so vast that it resembled the legendary Heavenly River encountered by the goddess Nüwa during her sky-mending, descending from the heavens, pouring onto the human world, drowning mountains and forests alike.<br/><br/>Dao Nineteen and Ancestral Master Jiangmo, both seriously wounded on the ground, had no time to dodge and were likewise engulfed by the Heavenly Emperor River.<br/><br/>Inside the Heavenly Emperor River, Zhu Lang Mountain Lord stood behind the crimson moon, the violent torrent battering against it, causing his white hair and robes to be desperately tugged backward. He clenched his teeth, using all his strength to resist.<br/><br/>“Damn… His Heavenly Emperor River is even stronger than that of the Hongxuan Emperor at the Heaven-Breaking Realm…”<br/><br/>Zhu Lang Mountain Lord thought in despair, his arms trembling as they continued to be pulled closer to his chest.<br/><br/>Meanwhile.<br/><br/>On the many battlefields across the Human Emperor Continent, one could feel the imposing pressure from Fang Wang and Zhu Lang Mountain Lord. Those who turned to look could even see a golden hue on the horizon, beautiful as an Illusionary Realm.<br/><br/>South.<br/><br/>Tens of thousands of Jin Xiao Sect Cultivators were facing towards the horizon of the sea. Following their gaze, at the end of the sea surface, the firmament displayed numerous black holes of varying sizes. Ships flew out from them, along with enormous demonic beasts and Magical Artifacts, in a vast and oppressive tide.<br/><br/>Looking back, Hongxuan Emperor’s expression changed slightly as he muttered to himself, “This kid, he’s actually managed to… to utilize it to such an extent.”<br/><br/>Next to him, Su Xuan glanced back and said, “The Heavenly Emperor Imperial Mirror of Hongxuan Emperor, the amount of heritage he has mastered is truly extensive, and each one seems to surpass its original owner.”<br/><br/>Upon hearing this, Hongxuan Emperor’s expression changed slightly again, and he said solemnly, “Surpass the original owner? I’m not so sure. After all, the strength of a Great Emperor lies in his realm.”<br/><br/>Su Xuan remained silent.<br/><br/>At that moment, a Cultivator from the Jin Xiao Sect raised the Jin Xiao banner high and bellowed, “Prepare for battle, defend this place to the death!”<br/><br/>“Through the ages for all eternity, let Jin Xiao shine brilliantly!”<br/><br/>As his words dropped, countless Jin Xiao Sect Cultivators rose into the sky like a shower of arrows. Hongxuan Emperor and Su Xuan also soared up, charging toward the horizon.<br/><br/>An earth-shattering battle erupted!<br/><br/>This place was the last to engage in combat, as other coastal regions had already started their battles.<br/><br/>…<br/><br/>While Zhulang, the mountain lord, was struggling to resist, a shadowy figure appeared behind him from thin air, a pitch-black ghostly deity.<br/><br/>The Executioner Immortal Jing Hong Sword!<br/><br/>More precisely, the Heavenly Earth Slaying Immortals Sword!<br/><br/>With all of heaven and earth as the Sword Intent, the Sword Intent transformed into a ghostly deity!<br/><br/>The ghostly deity wielded the sword in a single slash, cutting Zhulang, the mountain lord, in half at the waist, along with the destruction of the Red Moon following suit. The wild river surged forth, washing over the severed halves of Zhulang’s body.<br/><br/>Zhulang felt the world spin around him as he heavily crashed to the ground. The water from the Heavenly Emperor River soaked him, causing his Spiritual Power and vitality to begin dissipating, and the wounds on his body were unable to heal on their own.<br/><br/>This agony drove his will to sink, as if he were plummeting into a boundless hell.<br/><br/>He couldn’t even muster a single thought of resistance.<br/><br/>He felt this was his destiny.<br/><br/>His eyelids grew heavier, and his consciousness gradually sank into darkness.<br/><br/>High in the sky, Fang Wang held the Heavenly Palace Halberd in his right hand and the Rainbow Sword in his left, his golden aura burning wildly as if he were an undying solar deity.<br/><br/>“My Lord, what kind of Divine Skills are these? They are truly formidable; even divine sense cannot penetrate them,” came Xiao Zi’s exclamation from inside the Heavenly Palace Halberd, her tone filled with admiration.<br/><br/>Looking across, the entire land was engulfed by a golden sea, burying everything beneath the river water, akin to the Canghai slaughtering the world!<br/><br/>Fang Wang replied, “Hongxuan Emperor’s legacy, the Heavenly Emperor River, not bad at all.”<br/><br/>He raised the Rainbow Sword, with a ghostly deity condensing behind him. The deity mimicked his movements, slashing out a black Sword Qi that was fiercely sharp, like a black crescent moon descending from the sky, leaving a ravine thousands of feet long in its wake.<br/><br/>In the ravine, Dao Nineteen lay in a pool of blood. His vision grew blurry, unable to see Fang Wang’s figure clearly until his vision was filled with gold.<br/><br/>The Heavenly Emperor River came, submerging his body.<br/><br/>The mightiest part of the Heavenly Emperor River wasn’t its impact force but rather the corrosive and suppressive powers within its water, which made this Divine Skill very suitable to deal with enemies who had lost their ability to fight or were gravely injured.\t\t\t\t\t\t</div>", "images": {}, "success": true}