{"id": 348, "url": "https://www.novelhall.com/i-became-an-immortal-on-mortal-realm-32879/14893137.html", "title": "Chapter 338 - Chapter 338: Chapter 335: Which Sacred Being, The Origin Of Fang Wang!", "volume": 4, "volume_title": "Volume 4", "body": "<h1>Chapter 338 - Chapter 338: Chapter 335: Which Sacred Being, The Origin Of Fang Wang!</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 338: Chapter 335: Which Sacred Being, The Origin of Fang Wang!<br/><br/>“`<br/><br/>Whoosh——<br/><br/>The rain fell along the dark clouds, quickly turning into a downpour, pounding the earth and all its creatures.<br/><br/>In the mountains and forests, there stood a bamboo building. At the window sill of the second floor, a man in white was sitting in meditation, a sword placed on his legs. His hands were pressing on the sword blade, and he slowly opened his eyes, looking out the window at the torrential rain. Beyond the distant mountaintop, one could see the likeness of thunder.<br/><br/>Fang Hanyu gazed at the scene outside the window, his sword-like eyebrows involuntarily furrowing.<br/><br/>“Your heart is in turmoil. Are you worried about that brother of yours?”<br/><br/>A cold voice emerged from the sword in his hands—it was the Ten Thousand Year Sword Spirit he had obtained earlier.<br/><br/>Fang Hanyu said, “This time it’s different. It’s said that many Holy Clans and Imperial Clans want to bring down the Grand Yu Divine Dynasty.”<br/><br/>“If you can see that clearly, let alone Fang Wang, who is in the midst of it. Who asked him to meddle with the Grand Yu Divine Dynasty, to defy the heavens? It’s simply impossible. I advise you not to go to your death. With your current realm, you wouldn’t be of any help to him; you wouldn’t even count as cannon fodder. The Grand Yu Divine Dynasty can be considered the center of the Eastern Mortal Realm. The calamities it brings about make those in the Mahayana Realm no different from mortals,” said the Ten Thousand Year Sword Spirit, its voice complex.<br/><br/>Fang Hanyu did not answer, just let his gaze towards the window become more erratic.<br/><br/>At that moment, footsteps sounded from behind him.<br/><br/>A woman with a head of white hair approached. She appeared to be in her early twenties, with long hair that touched the ground. She was dressed in white and had a red silk belt wrapped around her waist, her face cold yet beautiful. She carried a steaming ceramic kettle in her hand.<br/><br/>She sat at the table, poured herself a cup of tea, and spoke softly, “Your goal is the Ascension Stairway in twenty years. Even if Fang Wang cannot withstand the siege of a hundred races, he can still escape. But if you cannot find your footing on the Ascension Stairway, when the great era of contention arrives, you won’t even have the qualifications to compete.”<br/><br/>Fang Hanyu turned and asked, “Master, does Fang Wang and the Grand Yu Divine Dynasty really stand no chance at all?”<br/><br/>The white-haired woman put down the teacup, pointed her right index finger across the space towards the cup, then waved it towards the ground. The tea rose from the cup, splashing onto the floor.<br/><br/>“All things have their own destiny. Fang Wang is defying not just half of the Mortal Realm but also the will of the heavens. If this water could turn into fire, then he would have a chance,” the white-haired woman said calmly.<br/><br/>Fang Hanyu immediately stood up, looking at the tea on the ground. Seeing that the water stains showed no sign of change, a look of disappointment spread across his brow.<br/><br/>The white-haired woman then said, “Fang Wang must have cultivated some extraordinary skill that I cannot foresee. This is the future of the Grand Yu Divine Dynasty I deduced. The death fate of the Grand Yu Divine Dynasty remains unchanged, which is to say, after this catastrophe, the Grand Yu Divine Dynasty will no longer exist.”<br/><br/>Upon hearing this, Fang Hanyu’s frown deepened.<br/><br/>He was about to speak when suddenly, the tea on the ground ignited into fierce flames, quickly growing from small sparks to the size of a bonfire.<br/><br/>The white-haired woman’s expression changed instantly, and she began to make calculations with her fingers.<br/><br/>Fang Hanyu’s face showed a look of surprise, and he couldn’t help but look at the white-haired woman.<br/><br/>The white-haired woman muttered to herself, “Imperial Qi rises again, Purple Subtlety re-emerges. Not only will the Grand Yu Divine Dynasty not perish, but it will also give birth to a Great Emperor…”<br/><br/>“Fang Wang… who in the world are you?”<br/><br/>Hearing his master’s words, Fang Hanyu breathed a sigh of relief, but at the same time, he was secretly puzzled. Could his brother truly be the reincarnation of some ancient powerful being?<br/><br/>…<br/><br/>In the Human Emperor Continent, in the eastern region.<br/><br/>The boundless Sea of Thunderclouds covering the firmament was cleaved in two, and looking down, a chasm so deep that its bottom was unseen split the earth, extending to the ends of the horizon. The fissure was no less than fifty miles wide, with the surrounding mountainous terrain completely collapsed, and dust and debris billowing into the air.<br/><br/>Fang Wang floated in the sky, holding the Heavenly Palace Halberd in one hand. He was clad in Dark Golden Chainmail, with strands of golden flame emerging from the armor. Atop his head was the Heavenly Dao Imperial Dragon Crown, with two strands of golden flame overflowing from the dragon horns, fluttering like phoenix wings, over two zhang long. He looked like a War God hovering in the air.<br/><br/>The Tianling Body!<br/><br/>“`<br/><br/>Nine small suns hovered behind Fang Wang, followed by a gigantic scroll suspended in the air—it was the Mie Jue Divine Tome!<br/><br/>The Mie Jue Divine Tome unfurled over a hundred yards long, with eerie, deadly auras swirling around it, dark and oppressive.<br/><br/>The purple dragon scales of the Heavenly Palace Halberd slightly opened and closed, signifying Xiao Zi’s excited heart.<br/><br/>Looking down from above, Fang Wang’s right hand suddenly released the Heavenly Palace Halberd. With a heaven-shaking roar, the halberd burst forth with terrifying speed, tearing through the firmament and hurtling hundreds of miles to crash into a mountain already halfway shattered.<br/><br/>Shattered rocks flew explosively, and the barren ground shook violently.<br/><br/>A painful wail came from within the rolling clouds of dust. Scorching fresh blood dispersed the dirt, revealing Dao Nineteen lying within the ruins. The Heavenly Palace Halberd was embedded in his chest, with blood gushing crazily down the blade.<br/><br/>Dao Nineteen’s face was covered in blood—gritting his teeth, he struggled to turn his head and saw his Lifespirit Treasure shattered, turned into dozens of blade shards embedded among the rubble.<br/><br/>“How is this possible… Why…”<br/><br/>Dao Nineteen ground his teeth, muttering hatefully to himself.<br/><br/>They were the Celestial Qiankun, three of them joining forces and yet they couldn’t handle Fang Wang!<br/><br/>Less than half an incense stick’s time since the battle had started, and he was about to lose his ability to fight. Had it not been for Zhu Lang Mountain Lord and Ancestral Master Jiangmo restraining the enemy, he feared he might have fallen.<br/><br/>This speculation filled him with panic and despair.<br/><br/>Since he had entered the Divine Passage Realm, he had never felt so powerless. Even when facing enemies a whole realm higher than him, if he couldn’t win, he could still escape.<br/><br/>But now, to be defeated by someone of a lower realm!<br/><br/>Dao Nineteen distinctly felt a mysterious and terrifying force within the Heavenly Palace Halberd ravaging his body—his Spirit Pill, mystical heart, muscles and bones were disappearing in ways he couldn’t comprehend.<br/><br/>He clenched his teeth hard, his hands gripping the blade of the Heavenly Palace Halberd. His face was distorted with rage as he said coldly, “After three thousand years of cultivation, I’ve abandoned everything. How could I fall here before my ascension!”<br/><br/>High above, Zhu Lang Mountain Lord and Ancestral Master Jiangmo once again attacked Fang Wang. Their movements and speed were extremely fast, dazzling to the eyes.<br/><br/>Zhu Lang Mountain Lord’s Lifespirit Treasure was a scroll of paintings, from which mountains continuously flew out—volcanoes, ice mountains, gold mountains, mountains of poisonous fog, etc. Even as a mountain drew near Fang Wang, it slowed the generation of his Spiritual Power, among various other effects.<br/><br/>Ancestral Master Jiangmo wielded his horsetail whisk, causing the light and dark of the world to shift. In a flash, he tried to drag Fang Wang into his Spirit Elephant’s domain, but he couldn’t confine Fang Wang for even a moment’s time.<br/><br/>“Mie Jue Divine Tome… Could you be the reincarnation of Emperor Donggong?”<br/><br/>Ancestral Master Jiangmo’s voice sounded, heavy with gravity.<br/><br/>Considering Fang Wang was only just over three hundred years old, even if he had received the heritage of the Mie Jue Divine Tome, how could he have cultivated to such a profound level?<br/><br/>Inconceivable!<br/><br/>He suspected that Fang Wang himself mastered the Mie Jue Divine Tome. Only a handful of people in the world had mastered it, and the only one he could think of was Emperor Donggong.<br/><br/>Did Emperor Donggong shed his mortal shell and evade fate?<br/><br/>Fang Wang didn’t answer him, instead stepping onto the Lingxiao Divine Sect and appearing directly behind Ancestral Master Jiangmo. His right fist was raised high, his body spinning to the side in midair.<br/><br/>At that moment, Fang Wang’s face was cold, his eyes filled with bone-chilling killing intent.<br/><br/>The Heart of the Heavenly Dao ensured there were no distractions in his mind, only the intent to kill!\t\t\t\t\t\t</div>", "images": {}, "success": true}