{"id": 342, "url": "https://www.novelhall.com/i-became-an-immortal-on-mortal-realm-32879/14885655.html", "title": "Chapter 332 - Chapter 332: Chapter 329: The Killing Intent Of Pilgrimage Manor", "volume": 4, "volume_title": "Volume 4", "body": "<h1>Chapter 332 - Chapter 332: Chapter 329: The Killing Intent Of Pilgrimage Manor</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 332: Chapter 329: The Killing Intent of Pilgrimage Manor<br/><br/>Following Jiang Shenming’s gaze, a figure was suspended in the midst of the huge vortex, a man dressed in black with disheveled hair and covered in blood, holding a long spear emitting a red glow in his hand.<br/><br/>Facing humiliation from Jiang Shenming, Luo Yue felt naturally angry, but he struggled to contain it.<br/><br/>“Emperor Donggong has already fallen, this is divine punishment; his Grand Yu Divine Dynasty ought to be destroyed, or else the heavens will not forgive the Mortal Realm!”<br/><br/>Luo Yue looked up at Jiang Shenming and shouted solemnly, his black clothes fluttered intensely as if to showcase the tension and turmoil within him.<br/><br/>Jiang Shenming slowly raised the Peach Wood Sword in his hand, his gaze cold and fierce.<br/><br/>“Emperor Donggong oppressed the Mortal Realm, annihilating countless clans, can such hatred be simply dissipated with his death? Moreover, Emperor Donggong was too selfish; he had the power to dominate the world yet dared not unite the Mortal Realm, because he feared the jealousy from The Upper Realm. So, he lingered here, not daring to allow the Grand Yu Divine Dynasty to step beyond.”<br/><br/>“He seemed to be protecting the common folk of the world, but in reality, he was just balancing the Holy Clans, Imperial Clans to prevent any threats to the Grand Yu Divine Dynasty. Does such an emperor of the human race deserve the name of a Sovereign?”<br/><br/>The more Luo Yue spoke, the more agitated he became, his eyes reddened, seemingly holding deep grudges against Emperor Donggong.<br/><br/>Jiang Shenming was expressionless, looking down at him, and asked, “Am I Emperor Donggong?”<br/><br/>Luo Yue was stunned.<br/><br/>“Am I of the royal family of the Grand Yu Divine Dynasty?”<br/><br/>“Am I a subject of the Grand Yu Divine Dynasty?”<br/><br/>“Why do you tell me all this?”<br/><br/>Jiang Shenming shouted fiercely, the more he spoke the stronger the oppressive feeling became, silencing the entire ocean, as horrifying waves hung in the air, the droplets shining like stars in the sky.<br/><br/>Luo Yue’s face turned pale. Just as he was about to strike with his spear, Jiang Shenming suddenly dove down, like a meteor falling.<br/><br/>Boom!<br/><br/>The boundless ocean exploded, terrifying waves reached for the skies as if the entire world was erupting, the scene shockingly magnificent.<br/><br/>…<br/><br/>Late at night, under a sky with sparse moon and stars.<br/><br/>Within Pilgrimage Manor.<br/><br/>Xu Yan, who was cultivating inside the house, suddenly opened his eyes and vanished from the room.<br/><br/>He appeared out of thin air in the courtyard, his gaze fixed on two figures standing on the edge of a roof, wearing wide black robes and white masks on their faces, revealing only their eyes. In the moonlight, these two figures seemed like fierce ghosts.<br/><br/>The moment Xu Yan appeared, the two mysterious figures locked their eyes onto him.<br/><br/>Xu Yan’s expression became stern, and just as he was about to take action, suddenly two blades were positioned at his throat and heart, freezing his body instantly.<br/><br/>“So fast!”<br/><br/>Xu Yan was secretly alarmed. After his Nirvana resurrection, he had reached the Sky-Stepping Realm, and over the years, he had been re-cultivating his past techniques.<br/><br/>He in the Sky-Stepping Realm couldn’t even keep up with the speed of the two mysterious figures.<br/><br/>“Don’t let out any breath, or you won’t be the only one to die,” a cold female voice entered Xu Yan’s ears, using the Sound Transmission Technique.<br/><br/>The other mysterious figure added through the Sound Transmission Technique, “Are you Fang Wang?”<br/><br/>Xu Yan was puzzled, but he quickly understood.<br/><br/>Fang Wang had cultivated a unique technique that made it impossible to detect his presence; it was only by seeing him with one’s eyes that he could be discovered.<br/><br/>Inside Pilgrimage Manor, along with Xu Yan, Xiao Zi and Zhao Zhen were cultivating. Fang Wang’s estate had flows of Spiritual Energy but no trace of human presence, whereas Xu Yan was still adjusting to his new body, making his Qi Gathering most evident and thus easily mistaken for Fang Wang.<br/><br/>Xu Yan remained expressionless and spoke softly, “Since you’ve guessed my identity, why use the Sound Transmission Technique? The prohibitions in this Pilgrimage Manor are numerous; they isolate the inside from the outside, which you should be able to feel.”<br/><br/>The mysterious woman then spoke, “Sky-Stepping Realm? Your cultivation is indeed higher than the rumors suggested.”<br/><br/>The other person said, “Fang Wang, do not stubbornly protect the Grand Yu Divine Dynasty, that is a path of no return. Why not join the Grand Wu God Dynasty? The Grand Wu Emperor has high expectations for you and hopes you can help the Grand Wu God Dynasty become a godlike dynasty that shines through the ages, creating a brand new era of prosperity. If you decide to join, the emperor is willing to crown you Pilgrim and grant you the same treatment you enjoyed in the Grand Yu Divine Dynasty.”<br/><br/>Hearing these words, Xu Yan was secretly alarmed; although he had not heard of the Grand Wu God Dynasty, their sincerity was indeed substantial.<br/><br/>However, he was not Fang Wang, he couldn’t make the decisions, he was only stalling for time, trying to extract intelligence.<br/><br/>“The Grand Wu God Dynasty sent you just to win me over?” Xu Yan asked with a cold expression.<br/><br/>The mysterious woman snorted coldly, “Why wouldn’t we when you are the number one talent in the world?”<br/><br/>Her impatience was evident, mainly because they had captured the target so easily, which led her to believe that Fang Wang’s fame exceeded his actual strength.<br/><br/>“Don’t play tricks, just come with us,” the mysterious man beside her said gravely. A blade in his hand flashed with cold light, and Xu Yan distinctly felt a chilly Spiritual Power seeping into his body, sealing his Spirit Pills and meridians.<br/><br/>All of a sudden, Xu Yan turned into Sword Qi and dispersed, causing the pupils of both mysterious individuals to shrink abruptly.<br/><br/>The duo instinctively turned around and fixed their gaze, only to see Xu Yan standing on the distant courtyard wall, backlit by the moon, watching them with an icy look.<br/><br/>“Worthy of Tian Dao Fang Wang, indeed not so easy to handle,” the mysterious man sneered with a hint of excitement in his tone.<br/><br/>Just then,<br/><br/>a pair of hands pressed down on their shoulders, making them feel as though struck by lightning, their bodies stiffened, and they subconsciously turned their heads, only to see Fang Wang standing behind them.<br/><br/>“How is this possible…”<br/><br/>“You…”<br/><br/>Fear showed in their eyes as they were pinned down by Fang Wang, feeling as if a great mountain was pressing on them, rendering them unable to move, while a power difficult to describe suppressed their Spiritual Power from flowing out.<br/><br/>They were practitioners of the Sky-Stepping Realm!<br/><br/>Seeing Fang Wang appear, Xu Yan couldn’t help but smile, amazed in his heart.<br/><br/>If these two mysterious people were fast, then Fang Wang was like a ghost, appearing without any warning.<br/><br/>“You want to recruit me?” Fang Wang’s indifferent voice resounded, sending shivers down their spines.<br/><br/>The mysterious woman struggled to turn her head, but in vain; she could only try to glance at Fang Wang with the corners of her eyes.<br/><br/>“Fang… Tian Dao, we came here with sincerity,” the mysterious man said, his voice trembling, an unprecedented fear enveloping their hearts.<br/><br/>As practitioners of the Sky-Stepping Realm, they had no power to resist.<br/><br/>Even when facing Great Cultivators of the True Soul Realm, they wouldn’t be so powerlessly crushed to death.<br/><br/>With a slight squeeze of his hands, Fang Wang turned the two Sky-Stepping Realm cultivators into flying ash in an instant, even their masks disappeared without a trace.<br/><br/>Xu Yan was startled by this scene.<br/><br/>What kind of Spell was that?<br/><br/>Divine Skills?<br/><br/>It definitely wasn’t Swordsmanship!<br/><br/>If it had been Swordsmanship, he could have seen through it at a glance.<br/><br/>Fang Wang retracted his hands, looked at Xu Yan, and said, “From now on, if you are sure they are enemies, just kill them. Intelligence is indeed important, but trying to extract information through simple conversations is underestimating others.”<br/><br/>Having said that, he disappeared into thin air.<br/><br/>Xu Yan stood on the courtyard wall, carefully contemplating Fang Wang’s words.<br/><br/>Meanwhile,<br/><br/>Fang Wang returned to the room, sat cross-legged, lifted his right hand, and looked at his palm with a rising smile on his lips.<br/><br/>In the palm of his hand, there appeared a scroll, the Mie Jue Divine Tome.<br/><br/>Being able to use the Mie Jue Divine Tome to directly kill two Great Cultivators of the Sky-Stepping Realm was not solely the effect of Great Perfection but also a result of his improved cultivation.<br/><br/>Even Great Cultivators of the True Soul Realm would find it difficult to do so casually.\t\t\t\t\t\t</div>", "images": {}, "success": true}