{"id": 352, "url": "https://www.novelhall.com/i-became-an-immortal-on-mortal-realm-32879/14896413.html", "title": "Chapter 342 - Chapter 342: Chapter 339 Divine Skills Choose Their Master, The Aura Of Immortal Divine", "volume": 4, "volume_title": "Volume 4", "body": "<h1>Chapter 342 - Chapter 342: Chapter 339 Divine Skills Choose Their Master, The Aura Of Immortal Divine</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 342: Chapter 339 Divine Skills Choose Their Master, The Aura of Immortal Divine<br/><br/>“This kid’s mastery of the Heavenly Emperor Imperial Mirror has already surpassed me…”<br/><br/>The Hongxuan Emperor gazed at the firmament, feeling deeply moved in his heart.<br/><br/>With his discerning eye, he could tell that the seeker of The Path of Immortality was no ordinary being of the Celestial Qiankun, and he still had a bout of concern for Fang Wang.<br/><br/>Even if one possessed numerous supreme skills, how to overcome such a gap?<br/><br/>In the Grand Yu Divine Dynasty, within the Imperial City.<br/><br/>Hong Chen was sitting cross-legged on the eaves, looking up at the illusions in the sky; his gaze was calm, without a hint of worry.<br/><br/>Fang Wang had already activated the Heart of the Heavenly Dao, casting aside all distractions, only desiring to defeat the seeker of The Path of Immortality.<br/><br/>The Six Harmonies and Eight Desolations Seal collided head-on with the seeker of The Path of Immortality, who took out a treasure pagoda and forcibly blocked the seal.<br/><br/>From the vertical eye on his forehead, strange white flames erupted, spiraling around the Six Harmonies and Eight Desolations Seal and transforming into countless strands, attempting to entangle Fang Wang.<br/><br/>Fang Wang brandished the Heavenly Palace Halberd, intercepting the white flames coming from all directions.<br/><br/>Boom, boom, boom—<br/><br/>The Town World Bead high above was swallowing everything in the world; countless fragments of stone flew up from the black mist and poured into the bead, along with the corpses of Zhuzhuang Mountain Lord, Dao Nineteen, and the Ancestral Master Jiangmo.<br/><br/>The seeker of The Path of Immortality kicked the Reincarnation Bell away, the resounding bell tone made him frown, but he still stepped right in front of Fang Wang, his left hand hitting Fang Wang’s chest, rapidly changing hand shapes and casting a series of dozen or so incantations in succession.<br/><br/>Fang Wang only trembled, then suddenly opened his mouth, releasing Divine Nurturing Sword Qi from it; the seeker of The Path of Immortality reacted extremely quickly, tilting his head to dodge, but his right ear was still sliced in half, blood spraying everywhere.<br/><br/>Everything happened extremely fast; in the blink of an eye, the two exchanged hundreds of blows.<br/><br/>“So it turns out that even you, who represent the heavens, can bleed!”<br/><br/>Xiao Zi’s voice rang out; its mocking words sparked anger in the eyes of the seeker of The Path of Immortality.<br/><br/>The seeker of The Path of Immortality once again split into shadows, this time in the thousands, making it difficult for Fang Wang to distinguish where his true body was.<br/><br/>If he could not discern the true from the false, then he would eradicate them all!<br/><br/>Fang Wang’s gaze turned sharp; ghostly figures rose from the vast mist on the ground, swiftly wielding their swords, numerous and indiscernible Ghostly Divine Sword Qi struck out, completely unstructured, plunging the entire world into a chaotic and shattered atmosphere.<br/><br/>The shadows of the seeker of The Path of Immortality were obliterated one by one, while his true body soared into the sky, vanishing into the clouds.<br/><br/>The Heavenly Emperor Avatar turned around, holding the enormous Rainbow Sword, and struck upwards toward the sky; a sword strike powerful enough to cut through any mountain in the mortal realm soared up, attempting to slash through heaven itself.<br/><br/>With a bang!<br/><br/>The rumbling thunderclouds suddenly split open, and a golden, boundless giant palm descended from the heavens; in front of this giant palm, the thousand-zhang-tall Heavenly Emperor Avatar was as insignificant as grains of sand on the ground.<br/><br/>Fang Wang raised his halberd to block it, the Heavenly Dao Imperial Dragon Crown bursting with dazzling radiance, the surging Spiritual Power stored within being mobilized by him.<br/><br/>When the Ghostly Divine Sword Qi collided with the golden giant palm, the originally massive sword qi was instantly blocked, and the descent of the golden giant palm also slowed.<br/><br/>“Man’s desire to conquer heavens is but a foolish fantasy!”<br/><br/>The voice of the seeker of The Path of Immortality sounded; he stood atop the golden giant palm, looking down at Fang Wang below who was resisting him.<br/><br/>This scene, witnessed by countless beings on the Human Emperor Continent, left them all with shaken spirits.<br/><br/>The seeker of The Path of Immortality, seemingly a Heavenly God descended to the mortal realm, with his Divine Skills, astonished each and every onlooker, also causing the morale of the Grand Yu Divine Dynasty, Wangdao, and the Jin Xiao Sect to plummet.<br/><br/>In the Descending Dragon Continent, within the Zhui Tian Secret Realm.<br/><br/>By a lakeside, Descending Dragon Continent watched the sky above the lake alongside his servants, where the lake’s surface shimmered with light that cast the grand battle between Fang Wang and the Daoist in search of immortals.<br/><br/>At the time of their death at the hands of Fang Wang, the Lanxin Fairy and Liang Xunqiu, who now stood among the crowd watching the battle, were tense, not even daring to blink.<br/><br/>Years ago, they, along with Fang Wang and Xiao Chen, had ventured into the Zhui Tian Secret Realm to compete for the ancient techniques of the Descending Dragon Great Saint. Though they all died at Fang Wang’s hand, they died convinced of his superiority. Their souls received the pity of the Descending Dragon Great Saint, which turned their misfortune into a blessing.<br/><br/>How many years had passed since then?<br/><br/>Fang Wang had grown to such an extent that he was facing an enemy representing The Upper Realm!<br/><br/>The words of the Daoist in search of immortals that reached inside the Zhui Tian Secret Realm, with his high-and-mighty tone, incited resentment in both the Lanxin Fairy and Liang Xunqiu, as well as the other ghosts, who all hoped for Fang Wang to win.<br/><br/>Standing at the forefront, the Descending Dragon Great Saint stroked his beard as he watched the battle, his white robe fluttering slightly in the wind, his thoughts unknown.<br/><br/>“Great Saint, could this man truly be an Immortal Divine descending to the mortal realm?” Liang Xunqiu couldn’t help but ask.<br/><br/>The other ghosts looked towards the Descending Dragon Great Saint as well.<br/><br/>They had all grown up listening to the legends of the Descending Dragon Great Saint, whose most famous feat was challenging the Heavenly Gods.<br/><br/>“He’s still far from being a true Immortal Divine. His strength is not yet enough to claim the title of the strongest in the Mortal Realm, and he’s no match for Fang Wang. But he’s clever, and he’s chosen his location well, which could actually pose a threat to Fang Wang with the force of an Immortal Divine.”<br/><br/>The Descending Dragon Great Saint spoke leisurely, his tone so calm that one could not discern his emotions.<br/><br/>At the same time.<br/><br/>Fang Wang dispersed the Golden Giant Palm, tumbling through the air. His body rapidly grew in size until he stood ten thousand feet tall, like a true god of heaven and earth, with the yang energy flames transforming into golden dragon auras, making him the most dazzling existence in all the land without end.<br/><br/>The Heavenly Emperor Avatar contracted into his body, but his Lifespirit Treasures did not vanish; instead, they hovered behind him.<br/><br/>He swung the Heavenly Palace Halberd upwards in a sweeping motion. The Daoist in search of immortals instinctively crossed his arms to block, protecting his body with Spiritual Power, but was still repelled.<br/><br/>Fang Wang closed his eyes, leaped forward, and his body returned to its original size; still, he charged at the Daoist in search of immortals once more.<br/><br/>The torrential onslaught forced the Daoist to defend with increasing difficulty.<br/><br/>“What’s going on? This is another kind of power… How many methods of Great Saints and Great Emperors has he cultivated?”<br/><br/>Surging waves of shock arose in the heart of the Daoist in search of immortals, and his anger intensified.<br/><br/>He found that Fang Wang had started to abandon his defense, and the Spiritual Power that he struck into Fang Wang’s body was almost instantly negated by a profound and Mysterious Power.<br/><br/>This was not Spiritual Power, not raw physical strength, nor was it the previously mysterious and domineering energy. It was another kind of power that the Daoist in search of immortals had never experienced before.<br/><br/>The Daoist refused to believe in defeat, exerting all his strength to unleash his Divine Skills, but he couldn’t harm Fang Wang at all.<br/><br/>The battle once again became deadlocked, providing a sigh of relief to the beings on the warring Human Emperor Continent.<br/><br/>At this moment, Fang Wang entered a wondrous state.<br/><br/>Before this, while in secluded cultivation, he always pondered what kind of Divine Skills he should create, but his heart was indecisive, teeming with too many ideas.<br/><br/>Now, in the midst of battle, Fang Wang gradually found a mysterious feeling.<br/><br/>Instead of choosing the Divine Skills himself, why not let the Divine Skills choose him?<br/><br/>In the battle, as he deployed all his Divine Skills back and forth, their powers would guide him to create a brand new Divine Skill unique to him.<br/><br/>And with this Divine Skill, he hoped to have the power to slay an Immortal Divine!<br/><br/>Although the Daoist in search of immortals was not an Immortal Divine, Fang Wang felt an aura completely different from ordinary beings on him, perhaps that of the Doom God!\t\t\t\t\t\t</div>", "images": {}, "success": true}