{"id": 359, "url": "https://www.novelhall.com/i-became-an-immortal-on-mortal-realm-32879/14902256.html", "title": "Chapter 349 - Chapter 349: Chapter 346: Divine Passage Realm Seventh Layer, Longevity God Ages", "volume": 4, "volume_title": "Volume 4", "body": "<h1>Chapter 349 - Chapter 349: Chapter 346: Divine Passage Realm Seventh Layer, Longevity God Ages</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 349: Chapter 346: Divine Passage Realm Seventh Layer, Longevity God Ages<br/><br/>Jiang Shenming stood up, and the pouring rain fell on him, unable to wet his robe. Under his gaze, a gigantic True Dragon emerged from the surface of the sea, revealing only its dragon head, yet it was a thousand zhang high, exuding an overwhelming presence.<br/><br/>This dragon seemed to be a Black Dragon. Its horns were not sharp but immensely large, like two small mountains perched above its eyes. Its scales were dark black, with dark red meridians faintly visible between them.<br/><br/>This Black Dragon had a fierce appearance and radiated boundless malevolent energy. As its maw opened and closed, it released intense, scorching turpidity.<br/><br/>The man in the straw raincoat looked up at the Black Dragon, not afraid but filled with curiosity.<br/><br/>Suddenly!<br/><br/>The sea ahead exploded again, and one by one, Black Dragons rose up. There were eight in total, looking identical to the first one. They rose from the seabed, their dragon bodies connected; it wasn’t nine dragons, but a Nine-Headed Dragon!<br/><br/>Only half of the Nine-Headed Dragon’s body was visible, with a pair of foreclaws emerging above the water. Even so, it towered over ten thousand zhang, covering the sky and plunging the wooden boat into darkness.<br/><br/>Jiang Shenming narrowed his eyes, muttering to himself, “This aura, why does it feel familiar?”<br/><br/>“I did not expect to encounter a member of the Jiang clan just after breaking my seal!”<br/><br/>A deep and domineering voice sounded, like the continuous rumble of divine thunder, shaking Canghai.<br/><br/>Jiang Shenming’s mouth curved into a smile, his hands on his hips as he laughed, “You beast, judging by your aura, you must have reached the True Soul Realm by now. You are indeed strong, but unfortunately, you’ve encountered me, and you still dare to be disrespectful. You’ve made a costly mistake!”<br/><br/>He soared into the air, his Dao Robe flapping vigorously.<br/><br/>All of the Nine-Headed Dragon’s eighteen eyes locked onto Jiang Shenming, their gazes sharp as if they could pierce him.<br/><br/>The man in the straw raincoat stood at the prow, looking up at the confrontation between Jiang Shenming and the Nine-Headed Dragon. He was not at all panicked; he simply wiped the seawater from his face, his eyes shining as he gazed toward the Firmament.<br/><br/>He was eager to witness an earth-shattering great battle.<br/><br/>…<br/><br/>Time flew like an arrow, and twenty years had passed.<br/><br/>Fang Wang broke through from the fifth layer of the Divine Passage Realm directly to the seventh, and the eighth layer was not far off.<br/><br/>He was preparing to cultivate until he reached the Sky-Stepping Realm. Once he attained the Sky-Stepping Realm, it would be time to set out.<br/><br/>By now, he was four hundred twenty-four years old, nearly surpassing the maximum age limit of the Southern Celestial Four Heroes. He too wanted to take advantage of his age, still considered that of a genius, to sweep across the world.<br/><br/>Nine Lives Precious Spirits, holy geniuses with imperial talents, resurrected Great Saints—he would defeat them all!<br/><br/>Unwittingly, Fang Wang had cultivated such a competitive spirit.<br/><br/>He could bestow lineage to strangers, but he also harbored a heart seeking fame and fortune, and what he sought was the title of the strongest.<br/><br/>While Fang Wang was still cultivating, Xiao Zi carefully flew to him, twisting and turning.<br/><br/>Fang Wang, with his eyes closed, asked, “What is it?”<br/><br/>Xiao Zi’s eyes spun as he said, “Master, is it not your responsibility to save the people of Cang?”<br/><br/>“Speak plainly, what’s happened outside?”<br/><br/>“Hehe, not to hide it from you, Master, but a foreign demon has appeared in the Mortal Realm, slaughtering people wantonly. Over the years, I have spread your fame for you, letting the name ‘Tiandao Fangwang’ enter the Mortal Realm. In fact, many of your effigies have been erected to receive offerings, so people have come to this demon-free forbidden land, praying for you to take action and eliminate the demon.”<br/><br/>Xiao Zi’s tone became more serious as he spoke.<br/><br/>Fang Wang countered, “Can’t you handle it?”<br/><br/>“I have to ask for your permission first, don’t I? If you agree, then I can take action to avoid bringing trouble upon you,” Xiao Zi replied with a plea.<br/><br/>Fang Wang snorted, “Go then. It’s time for you to gain some experience, you can’t always bully beings weaker than you.”<br/><br/>Xiao Zi hurriedly thanked Fang Wang, then with a whoosh, she disappeared into the forests and mountains.<br/><br/>Fang Wang then opened his eyes, a smile appearing on his face.<br/><br/>To his surprise, Xiao Zi had actually developed a compassionate heart.<br/><br/>The Xiao Zi of the past was never like this.<br/><br/>It seemed that the mortal’s offerings did have an effect.<br/><br/>Despite how Fang Wang usually commanded Xiao Zi, in reality, Xiao Zi was the one he cared about the most.<br/><br/>Xiao Zi had been his companion for nearly four hundred years. Basically, wherever he went, he would bring Xiao Zi along, and every battle he fought was accompanied by Xiao Zi—a fact that even Zhou Xue could not match.<br/><br/>He could not afford to let any harm come to Xiao Zi.<br/><br/>“Demons from beyond the heavens?”<br/><br/>Fang Wang’s gaze twinkled as he looked into the distance.<br/><br/>…<br/><br/>Boom, rumble—<br/><br/>Thunderclouds rolled, and a bolt of lightning struck, illuminating the murky world. One could see across the endless mountains, littered with the carcasses of humans and beasts. They were not all skeletons; some bones still clung to rotten flesh.<br/><br/>In some sparse woods, bodies drenched in blood hung from trees, a ghastly sight. Looking around, it was a sea of bones and a forest of flesh, resembling purgatory on earth.<br/><br/>Moving forward, a vast expanse of uneven white bones stretched into the distance, and atop a peak made of piled skulls, a white-haired figure sat cross-legged on a skull that resembled that of a tiger or a leopard. His clothes were tattered, revealing a pale and emaciated skin, and he wore prayer beads around his neck.<br/><br/>This person’s face was also pale, except for his black and red lips. He had no eyebrows, and his forehead was covered with tiny, dense eyes, like those of a spider. His hands rested on his knees, his fingernails as long as his fingers, still dripping with blood.<br/><br/>He was bowing his head, a soft breathing sound emanating from his mouth.<br/><br/>A hundred miles away,<br/><br/>A group of cultivators hid behind a mound of flesh. A cultivator in a gray robe held a bronze mirror reflecting the image of the white-haired figure, with two cultivators behind him holding flags to maintain a protective barrier.<br/><br/>The other cultivators looked around with fear and disgust, dreading the blood and flesh from falling onto themselves.<br/><br/>“This demon is asleep; now’s a good chance,” a middle-aged female cultivator said with a grave voice, her tone barely concealing her hatred.<br/><br/>The gray-robed cultivator spoke softly, “We cannot act rashly. It’s said that this demon is cruel and cunning, enjoying to toy with his prey. Perhaps he isn’t asleep at all, or even if he is, he can remain vigilant.”<br/><br/>The other cultivators chimed in.<br/><br/>“What should we do then? Waiting around like this isn’t a solution.”<br/><br/>“Indeed, in a year’s time, this demon is set to slaughter the Xuanhuang Continent, which is the heart of the Mortal Realm. Once he has slain everyone there, the Mortal Realm will be utterly destroyed…”<br/><br/>“Damn it, this demon calls himself the Longevity God Ages. I believe his longevity comes from devouring the masses.”<br/><br/>“So many bodies, and it seems they have not been dead for long. How is this possible?”<br/><br/>“Already six Mahayana Realm masters have died at his hands. Although we, being in the Golden Body Realm, outnumber him, it’s difficult to directly kill a Mahayana Realm cultivator. Therefore, facing the even stronger Longevity God Ages, we must find a way to exploit his weaknesses.”<br/><br/>The gray-robed cultivator’s brow furrowed tightly; he had been pondering strategies but had come up with nothing. Upon arriving here, he found that the many powerful magical artifacts he had prepared were useless, unable to trigger any prohibitions. This made him panic, suspecting that Longevity God Ages was waiting for their move.<br/><br/>Hum—<br/><br/>Suddenly, a dragon’s roar exploded, startling the cultivators into looking up, only to see a majestic Purple Dragon descending from the clouds. Wherever it passed, thunderclouds dispersed, and sunlight poured down, as if light was driving away the darkness.\t\t\t\t\t\t</div>", "images": {}, "success": true}