{"id": 355, "url": "https://www.novelhall.com/i-became-an-immortal-on-mortal-realm-32879/14897454.html", "title": "Chapter 345 - Chapter 345: Chapter 342: Ominous Curse, Traversing Heaven And Earth", "volume": 4, "volume_title": "Volume 4", "body": "<h1>Chapter 345 - Chapter 345: Chapter 342: Ominous Curse, Traversing Heaven And Earth</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 345: Chapter 342: Ominous Curse, Traversing Heaven and Earth<br/><br/>Hearing the words of the Ghost Emperor, Fang Wang asked curiously, “What is the origin of this place?”<br/><br/>As for the matters of the Doom God descending to the mortal realm, that would be many years later, by which time he would not need the help of the Ghost Emperor.<br/><br/>In fact, he didn’t need it now either; even if he couldn’t win a fight, he had means to escape.<br/><br/>Fang Wang dared to be reckless because he had the confidence.<br/><br/>The Jiu You Freedom Technique was his life-saving trump card; the reason he normally didn’t use it was that he didn’t want to expose it too early.<br/><br/>No matter how powerful a divine skill, once used too often, sooner or later enemies would study it and discover its flaws and countermeasures.<br/><br/>The Jiu You Freedom Technique allowed for travel between the realms of yin and yang, and the Lingxiao Divine Sect could even enable him to traverse between heaven and earth.<br/><br/>The Ghost Emperor explained, “This realm is called the Endless Land, located between the realms of yin and yang. It was once a prosperous Mortal Realm, but after a great war between immortals and mortals, the ruler of the Mortal Realm, before dying, ripped this realm apart, preserving it such that even divine celestial beings dare not invade, for they would be stained with ominous karmic consequences. However, although this realm was preserved, its beings endure an eternal curse and suffering, filled with resentment towards the former ruler of the Mortal Realm.”<br/><br/>“Ominous karmic consequences? Why then did the Pursuer of the Immortal Path bring me to this realm to fight?” Fang Wang asked curiously.<br/><br/>The Ghost Emperor answered, “Such karmic consequences take time to manifest. The longer you stay in the Endless Land, the more you’ll suffer from these karmic curses, until you are doomed forever, completely unable to leave the Endless Land.”<br/><br/>That’s really harsh!<br/><br/>Fang Wang couldn’t help but ask, “Then why can Your Majesty come here?”<br/><br/>“The Endless Land is not far from the Underworld, and I have also been afflicted with a similar curse, so I’m not afraid. However, I can’t send you out; you’ll have to find your own way.”<br/><br/>At the words of the Ghost Emperor, Fang Wang couldn’t help but stimulate the mental method of the Jiu You Freedom Technique.<br/><br/>He found that he really couldn’t sense the Underworld.<br/><br/>The Jiu You Freedom Technique allowed him to traverse the yin and yang realms, but it wasn’t a lateral movement. When he jumped into the Underworld, he was still in the same place, just isolated by the rules of the Underworld.<br/><br/>Of course, it wasn’t that he couldn’t use the Jiu You Freedom Technique without the separation of yin and yang. The Jiu You Freedom Technique also had the ability to dematerialize, and even in the Endless Land, he could use it.<br/><br/>“Even with the Jiu You Freedom Technique, you can’t just jump out,” the Ghost Emperor said.<br/><br/>The Jiu You Freedom Technique was passed down from the Grand An Resentment Temple, which was the Ghost Emperor’s place of practice; naturally, he knew of its existence.<br/><br/>Fang Wang promptly bowed, saying, “Regardless, I thank Your Majesty for the rescue; I will take good care of Jiang Shenming.”<br/><br/>After speaking, he deployed the Lingxiao Divine Sect Technique and disappeared on the spot.<br/><br/>All was silent in the world.<br/><br/>The Ghost Emperor stood in the darkness at the edge of the sky, silent.<br/><br/>Time passed, and only then did he silently disappear into the darkness, as if he had never appeared.<br/><br/>…<br/><br/>Smack!<br/><br/>Fang Wang landed on the ground. He looked up to find himself on a cliff, with a dense forest behind him. Following his gaze to the horizon, it was blood-red. It was twilight.<br/><br/>He furrowed his brow.<br/><br/>The spiritual energy of this place was starkly different from that of the Eastern Mortal Realm where he resided. As his divine sense spread out, he couldn’t see any human tracks, only various colossal beasts akin to mountains.<br/><br/>He had already used the Lingxiao Divine Sect’s powers to shuttle through different worlds a number of times, each realm differing from the last, some even the size of the Mortal Realm comparable to the Descending Dragon Continent.<br/><br/>Though capable of traversing heaven and earth, the Lingxiao Divine Sect couldn’t track the very fabric of these realms, leaving him utterly uncertain of where to leap next.<br/><br/>At this moment, a divine consciousness fluctuation transmitted from the jade bracelet in Fang Wang’s hand. He promptly set down the Heavenly Palace Halberd and allowed Xiao Zi to stand guard while he extended his own spiritual consciousness into the bracelet.<br/><br/>It was still the illusionary realm within Fang Residence.<br/><br/>Zhou Xue strode quickly to Fang Wang and asked, “Can you not return?”<br/><br/>Fang Wang raised an eyebrow and inquired, “How do you know? Could it be that this jade bracelet can capture my location?”<br/><br/>“After you were pulled into the Land of No End, your presence never descended upon the Mortal Realm we’re in, but I can sense your rapid movement, occasionally stopping, indicating you’ve lost your direction.”<br/><br/>Zhou Xue explained, pausing briefly before continuing, “This jade bracelet can only connect to you, it can’t pinpoint your location unless you’re in the same Mortal Realm as me. The rules differ between the worlds, and maintaining our link has already taken much of my effort.”<br/><br/>Upon hearing this, Fang Wang’s mood sank instantly.<br/><br/>Damn it!<br/><br/>I can’t really be unable to return, can I?<br/><br/>Fang Wang had anticipated many possibilities for this battle, but he had not foreseen this situation.<br/><br/>“Don’t worry,” Zhou Xue reassured him, “since you have the ability to traverse worlds, you can take your time. The forces besieging the Grand Yu Divine Dynasty have retreated. The confidence they had gathered was shattered by you. I will follow this victory and push back, attacking until they dare not assail the Divine Dynasty again. Take your time to find the Mortal Realm we’re in. You can ask about the Descending Dragon Great Saint, whose legends are spread both in the Eastern and Western Mortal Realm. The Descending Dragon Great Saint has never been to any other realms.”<br/><br/>“I’m just worried it might take a long time.”<br/><br/>“Decades, centuries, I will wait for you.”<br/><br/>“And what about a millennium?”<br/><br/>“After a millennium, I’ll have ascended to The Upper Realm. By then, I’ll be able to use many Immortal methods to find you easily as long as you’re not dead.”<br/><br/>Zhou Xue spoke with a trace of pride, and at this, Fang Wang felt reassured.<br/><br/>Fang Wang teasingly asked, “The enemies I’ve provoked and the messes I need to clean up have increased by a lot. Can you handle it? There’s already a Great Saint scheming against me.”<br/><br/>Zhou Xue rolled her eyes and said, “Even though my cultivation can’t keep up with yours, I am still an Immortal Venerable reborn. It’s only the Xuan You Great Teaching that is scheming against you, and I’m scheming against them as well. I let you face the Seeker of Immortality alone because I knew you had mastered the Jiu You Freedom Technique.”<br/><br/>“You knew I might not be able to return from the start?”<br/><br/>“No, I predicted the Ghost Emperor would make a move given your command of the Vajra Invincible Saint Body, but I didn’t expect you to possess another power to traverse the realms. Before I could warn you, you had already started,” Zhou Xue said, her tone laced with helplessness.<br/><br/>Changing the subject, she mentioned, “Actually, this is not necessarily a bad thing. You aim to become an Immortal and surpass the Great Saints and Great Emperors in the Mortal Realm. If you can establish your fame in even more Mortal Realms and significantly increase your Fate, it might not be impossible.”<br/><br/>Fang Wang sighed and said, “It’s a pity I might miss the opportunity of the Ascension Stairway.”<br/><br/>Zhou Xue cheerfully responded, “After this battle, your fame will certainly shake the Eastern Mortal Realm and even spread within the Western Mortal Realm. Why rely on the Ascension Stairway for renown? As for the opportunity it offers, it might be useful to you but is not necessarily critical.”<br/><br/>She looked at Fang Wang, clicking her tongue in amazement, “You kid, you’ve even cultivated the Immeasurable Pure Bone. It seems the Red Dust Celestial Emperor truly values you. Honestly, I’m no match for you now; only after ascending can I hope to surpass you.”<br/><br/>With his spirits high, Fang Wang laughed, “If you can’t catch up now, you will be even further behind in the future.”<br/><br/>In front of Zhou Xue, he could hardly be modest.<br/><br/>Zhou Xue huffed, “When the time comes, I will show you what it means to be an Immortal Venerable.”\t\t\t\t\t\t</div>", "images": {}, "success": true}