{"id": 353, "url": "https://www.novelhall.com/i-became-an-immortal-on-mortal-realm-32879/14896931.html", "title": "Chapter 343 - Chapter 343: Chapter 340: Immortal And Indestructible, Not Tolerated By Cang", "volume": 4, "volume_title": "Volume 4", "body": "<h1>Chapter 343 - Chapter 343: Chapter 340: Immortal And Indestructible, Not Tolerated By Cang</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 343: Chapter 340: Immortal and Indestructible, Not Tolerated by Cang<br/><br/>Having cultivated for over three hundred years, Fang Wang had practiced the Sword Dao, inherited the Body Cultivation Technique, and mastered a myriad of differently-typed Daoist Magic Divine Passage. Yet, he had never judged which path he truly wanted to pursue.<br/><br/>Even if he integrated the Myriad Laws of the Mortal Realm and created a peerless technique that could instantly make one an Immortal, that technique must still have its own position.<br/><br/>Fang Wang could not yet consider the methods of becoming an Immortal, but he now had to think about what kind of Divine Skills his Divine Passage Realm ought to create.<br/><br/>The higher the realm of a Cultivator, the more Divine Skills and spells they mastered, but no matter how high their realm, every Cultivator had their own Dao.<br/><br/>Fang Wang immersed himself in his thoughts while battling.<br/><br/>Even with his eyes closed, he could fight on instinct and continuously unleash Divine Skills.<br/><br/>“This is…”<br/><br/>Xiao Zi felt the Mysterious Power within Fang Wang’s body and was greatly surprised.<br/><br/>Gradually, the golden Yang Energy around Fang Wang’s body turned silvery white, and his entire presence no longer seemed as aggressive as before, yet it bore an image of vast, profound majesty.<br/><br/>The pressure felt by the seeker of the immortal path was growing ever greater; he began to show gaps in his defenses, suffering from consecutive attacks.<br/><br/>The most lethal aspect was that his Spiritual Power shield could no longer protect him, making him have to move with full speed, dodging and retaliating simultaneously.<br/><br/>The two of them fought from heaven to earth, their battlefield continuously expanding. Each movement allowed them to effortlessly traverse hundreds of miles, shattering all the high mountains in their path and collapsing the rivers they passed.<br/><br/>The Endless Land seemed as dark as the Underworld of Jiu You, but it was actually inhabited by living beings, which were like specters. Faced with the grand battle between Fang Wang and the seeker of the immortal path, they fled in panic. Although their appearances varied, they shared one common trait: their bodies emitted a ghostly glow.<br/><br/>Suddenly, Fang Wang grasped the seeker of the immortal path’s head and pressed it against the ground, dragging him for thousands of miles. While this did not cause him serious injury, the humiliation cut deep.<br/><br/>He could not understand how Fang Wang had suddenly become stronger.<br/><br/>Or was it that Fang Wang had never been serious to begin with?<br/><br/>At the moment, the illusions reflecting their figures continuously tracked their shadows. Even if the spectators couldn’t see the specifics of the battle, they could tell that the seeker of the immortal path was being dominated by Fang Wang.<br/><br/>Above the sea, countless Law Ships floated, with a chaotic battle raging in front. Flames of war rose to the sky, and the waves surged.<br/><br/>Under a flag embroidered with the character ‘真,’ a woman in palace attire stood on the deck. Her hands were placed before her abdomen, her posture graceful, her face veiled in black, her dense black hair coiled within a Phoenix Crown. Looking up at the battle in the Firmament, her eyes brimmed with unusual colors.<br/><br/>“Tiandao Fangwang… just who are you to be so divine… Can even the inheritors of the Immortal Divine not contend with you?”<br/><br/>The palace-clad woman muttered to herself, her tone complex.<br/><br/>It wasn’t just her; leaders from hundreds of Saint Clans and Imperial Clans throughout the Human Emperor Continent felt shaken by Fang Wang’s strength.<br/><br/>Under their unified assault, the Human Emperor Continent could barely hold up; the battlefront was incessantly shrinking, and the day they would breach the Human Emperor Continent was not far off.<br/><br/>Despite such an advantage, the hearts of all combatants grew increasingly uncertain.<br/><br/>The battle within the illusions in the sky was too terrifying!<br/><br/>Even if they could win, after flattening the Grand Yu Divine Dynasty, could they withstand the wrath of Tiandao Fangwang?<br/><br/>While the Cultivators of the Grand Yu Divine Dynasty, Wangdao, and the Jin Xiao Sect were at a disadvantage, their spirits were quite the opposite. With such a preeminent power protecting them, how could they lose?<br/><br/>“Hahahaha! Thrilling! How thrilling!”<br/><br/>Jiang Shenming, clad in a Dao Robe, laughed maniacally. He charged recklessly through the air, unstoppable wherever he went. Even Great Cultivators of the True Soul Realm couldn’t withstand his power and could only evade his sharp edge.<br/><br/>He was the most dominant presence on the battlefield!<br/><br/>A million miles away.<br/><br/>Sword Qi crisscrossed the heavens and earth, sealing off an area of a hundred miles. Sword Immortal Xu Yan stepped through the air with his sword, freezing all enemies in midair. Struck by beams of Sword Qi, as Xu Yan passed, they turned into a mist of blood.<br/><br/>Yang Du, the Three Immortals of the Emperor Sea, Zhu Yan, Lü Xianming, and other Cultivators of Wangdao showcased their might across various battlefronts.<br/><br/>Despite being outnumbered, they were without fear because they had the Dao Master fighting alongside them.<br/><br/>Elsewhere.<br/><br/>Within the Endless Realm, Fang Wang had forgotten about time, forsaken all distractions, and immersed himself in the enlightenment of his own cultivation.<br/><br/>The Immeasurable Pure Bone was displaying its effects, with a faint shadow of a skeleton visible on his skin, yet shrouded by the silvery white Yang Energy, making it difficult to discern without close inspection.<br/><br/>His opponent, however, the seeker of the immortal path, saw everything clearly.<br/><br/>And he began to fear.<br/><br/>“Who… who exactly are you?” the disheveled and blood-covered seeker of the immortal path asked through clenched teeth.<br/><br/>He didn’t realize that his voice, empowered by the Heavenly Gods, had reached the Human Emperor Continent.<br/><br/>This rule was originally meant to break the spirits of all beings on the Human Emperor Continent and incidentally establish his prestige, but now it was causing panic among the various clans.<br/><br/>Was this existence, comparable to the Immortal Divine, unable to be stopped?<br/><br/>Fang Wang did not answer the seeker of the immortal path and continued his offensive.<br/><br/>The seeker of the immortal path raged, feeling that Fang Wang was disparaging him!<br/><br/>“Presumptuous… I have inherited the Great Saint Legacy and have also received the compassion of the Heavenly Gods… How dare you insult me!”<br/><br/>The seeker of the immortal path’s roar, filled with near insanity, echoed through the skies of the Human Emperor Continent and resounded within the Endless Realm.<br/><br/>The Great Saint Legacy!<br/><br/>The compassion of the Heavenly Gods?<br/><br/>The creatures were terrified. The background of the seeker of the immortal path was truly frightening, even his allies among the various clans felt alarmed.<br/><br/>Suddenly!<br/><br/>The seeker of the immortal path embraced Fang Wang, forcefully stopping his assault. The two halted in mid-air, with the impact of their clashing auras sweeping across everything within a thousand miles.<br/><br/>“Creature abhorred by the heavens, feel the wrath of the Immortal Divine!”<br/><br/>The seeker of the immortal path roared ferociously, and with a loud boom, his physical body burst into terrifying white flames, instantly engulfing Fang Wang. A pillar of fire soared into the sky, like a white light splitting the darkened world in two.<br/><br/>On all the battlefields around the Human Emperor Continent, more and more combatants began to cease fighting, pulling away from one another as they all looked up towards the Firmament.<br/><br/>They all heard the seeker of the immortal path’s crazed screams, so hysterical that it drowned out all other sounds between heaven and earth.<br/><br/>It was hard to imagine the pain that the seeker of the immortal path was undergoing, but they realized that the decisive battle between the two was about to conclude.<br/><br/>Zhou Xue, in a red dress, stood atop a blood-stained ruin, her face expressionless as she gazed up at the Firmament. However, her right hand gripping the Reverse Absolute Sword was clenched tightly.<br/><br/>In the Firmament’s phantom image, the terrifying white flame occupied most of the image; the seeker of the immortal path continued to scream, while the armor on Fang Wang seemed to be melting away, his silhouette visibly smaller.<br/><br/>“Fang Wang! Your flesh is not as strong as you believed…”<br/><br/>The seeker of the immortal path laughed maniacally, his laughter filled with murderous and hateful intent.<br/><br/>Just then, a hand suddenly landed on his right shoulder, or more precisely, a hand bone.<br/><br/>His eyes widened in shock, and before he could react, another hand bone landed on his left shoulder.<br/><br/>Boom!<br/><br/>The white sea of fire suddenly parted, and countless onlookers, heads tilted back, focused their gaze as their eyes widened in disbelief.<br/><br/>They saw the seeker of the immortal path being torn in half by someone – it was Fang Wang’s doing!<br/><br/>At that moment, Fang Wang had transformed into a skeleton, his flesh scarce and with only one eye on his face, resembling a demon from Jiu You.<br/><br/>As the white sea of fire dispersed, his skeleton rapidly regenerated flesh at a speed visible to the naked eye!\t\t\t\t\t\t</div>", "images": {}, "success": true}