{"id": 350, "url": "https://www.novelhall.com/i-became-an-immortal-on-mortal-realm-32879/14895403.html", "title": "Chapter 340 - Chapter 340: Chapter 337: Disciple Of The Great Saint, Seeking The Lord Of The Path Of Immortality", "volume": 4, "volume_title": "Volume 4", "body": "<h1>Chapter 340 - Chapter 340: Chapter 337: Disciple Of The Great Saint, Seeking The Lord Of The Path Of Immortality</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 340: Chapter 337: Disciple of the Great Saint, Seeking the Lord of the Path of Immortality<br/><br/>Fang Wang swung his sword again, and as the ghostly sword struck down, black Sword Qi once again cleaved toward the land submerged by the Heavenly Emperor River, this time with the Ancestral Master Jiangmo as his target.<br/><br/>Another trench thousands of fathoms long appeared, splitting the golden ocean, and although the Ancestral Master Jiangmo used his horsetail whisk to defend, the passing Sword Qi vanquished the whisk, reducing it to ashes, causing his physical body to stumble backward a step and then kneel on the ground.<br/><br/>Blood spurted from his mouth, splattering the ground as golden waves surged atop the cliffs to his left and right, crashing toward him.<br/><br/>“To slay an Immortal…”<br/><br/>The Ancestral Master Jiangmo’s voice trembled. He no longer had the strength to lift his head, clearly feeling his soul being extracted.<br/><br/>What seemed like Fang Wang’s casual two strikes were actually him exerting his full strength, enough to reap the lives of these two Celestial Qiankun beings!<br/><br/>The ghostly god stood proudly against the heavens, Mie Jue Divine Tome spread across the sea of clouds, and all that remained between heaven and earth was the surging sound of the Heavenly Emperor River.<br/><br/>Fang Wang’s face was expressionless as he waited for the three Celestial Qiankun beings to fall.<br/><br/>It must be said, the vitality of the Celestial Qiankun was extremely strong, and these three individuals were somewhat more advanced in their cultivation than Daoist Xuan Zhi, not perishing instantly despite the successive assaults of his many Divine Skills.<br/><br/>But their end was near.<br/><br/>In less than ten breaths’ time, Zhulang Mountain Lord’s soul was absorbed by the Ghostly Divine Sword Qi, and his life essence was cut off.<br/><br/>After him, Dao Nineteen and the Ancestral Master Jiangmo, still trying to employ other methods within the Heavenly Emperor River, found the erosion of their will by the river to be far beyond their expectations, and they quickly lost their fighting spirit.<br/><br/>Boom—<br/><br/>The thunderclouds churned overhead, with bursts of thunder rolling in the sky.<br/><br/>Fang Wang seemed to sense something and looked up. He felt that the thunderclouds were not the result of their battle’s pressure but contained some heavenly might.<br/><br/>Gradually, Fang Wang had an epiphany.<br/><br/>The fall of Celestial Qiankun caused heaven and earth to mourn!<br/><br/>This heavenly might was drawn by the fall of Daoist Xuan Zhi, while the mourning of Zhulang Mountain Lord, Dao Nineteen, and the Ancestral Master Jiangmo was still gathering strength.<br/><br/>Fang Wang glanced down, and the Rainbow Sword in his hand disappeared. He then reached down with his left hand across the void to capture several Storage Rings.<br/><br/>Once he had completely absorbed the souls of the three Celestial Qiankun beings, with a thought, the Heavenly Emperor River covering the earth dissipated as if the land had shed its golden coat, and strands of golden mist shone throughout the heavens and earth, even illuminating the thunderclouds.<br/><br/>“Young master, are they…” Xiao Zi’s excited voice emerged, but before it could finish, it abruptly stopped.<br/><br/>An incredibly terrifying pressure descended, and as Fang Wang looked up, he saw the thunderclouds starting to rotate, forming a magnificent vortex, with a patch of utter darkness at its center, foreboding and fearsome.<br/><br/>One after another, figures descended from it, all dressed in black robes, marked with a disc on which six figures in various forms were evenly distributed, resembling representations of the six paths of reincarnation. They also wore pure white masks, revealing only a pair of eyes.<br/><br/>Fang Wang thought of the mysterious individuals who had previously infiltrated Pilgrimage Manor and realized they must be the companions of these subjects.<br/><br/>The number of these individuals was immense, flowing in endlessly. Quickly dispersing, they floated above Fang Wang, a thousand fathoms apart. At a glance, there were at least a hundred thousand, and their number was still rapidly increasing.<br/><br/>Fang Wang’s gaze settled on an elder in green robes, who was not wearing a mask, his face showing signs of age, his eyes extremely cold as he looked down upon Fang Wang as one would on an ant on the ground.<br/><br/>Very strong!<br/><br/>Fang Wang could clearly feel that this green-robed elder was stronger than the previous three Celestial Qiankun beings.<br/><br/>However, not strong enough to unsettle him!<br/><br/>The green-robed elder gazed down at Fang Wang and slowly said, “To execute four Celestial Qiankun, Fang Wang, your strength indeed exceeds my expectations. After this battle, the fate of the Eastern Mortal Realm will surely decline significantly. Do you know how long it takes to cultivate a Celestial Qiankun?”<br/><br/>Fang Wang twisted his neck and said, “If I kill you, will there be anyone else who dares to challenge me?”<br/><br/>The green-robed elder let out a cold snort, suddenly raising his arm to sweep it across. Tens of thousands of masked figures clapped their hands simultaneously, their flesh instantly turning into black mist. Their black robes billowed violently, and the vast expanse of black mist spread out, quickly darkening the sky.<br/><br/>Fang Wang paid careful attention and sensed that the black mist was transformed from flesh and blood, still retaining the scent of blood and flesh.<br/><br/>These people were actually sacrificing themselves!<br/><br/>The whole world dimmed in an instant, as Fang Wang was dragged into a realm within the Celestial Qiankun Totem.<br/><br/>This totem unfolded even faster than the four Great Cultivators of Celestial Qiankun Fang Wang had encountered before, leaving him no time to evade.<br/><br/>The earth fell into darkness, and the corpses of Zhulang Mountain Lord, Dao Nineteen, and Ancestral Master Jiangmo were devoured by the darkness.<br/><br/>“It’s him! He’s the disciple of the Descending Dragon Great Saint, Cultivator Xunxian!”<br/><br/>Xiao Zi cried out in shock, revealing the identity of the green-robed elder.<br/><br/>The disciple of the Descending Dragon Great Saint?<br/><br/>Doesn’t that mean he’s lived for over ten thousand years?<br/><br/>How did he survive?<br/><br/>Fang Wang looked at the green-robed elder known as Cultivator Xunxian, his eyebrows slightly raised.<br/><br/>Cultivator Xunxian, expressionless, said, “So it is the princess of the True Dragon Clan. It seems my master, despite his recklessness, left behind many strategies. However, it is a pity—just like his fate, his schemes will fail under the feet of the vast heavens.”<br/><br/>Boom!<br/><br/>He burst into black flames that engulfed his entire body, his white hair dancing in the flames.<br/><br/>Thunderbolts fell from the thunderclouds above, all striking him. With each thunderstrike he endured, his aura grew increasingly powerful.<br/><br/>At the same time.<br/><br/>In the external world, thunder rumbled within the clouds above the Human Emperor Continent, and the lightning illuminated a scene of Fang Wang confronting Cultivator Xunxian.<br/><br/>The scene was viewed from behind Fang Wang, looking up at Cultivator Xunxian, who towered above, absorbing the formidable thunderbolts, appearing utterly invincible. He raised his right hand, and the horsetail whisk in his hand also began to absorb the lightning.<br/><br/>On the edges of the Human Emperor Continent, all the beings embroiled in battle couldn’t help but notice this scene.<br/><br/>Inside the Grand Yu Divine Dynasty, it was the same—the masses of commoners and cultivators came outside their houses to look up at the sky.<br/><br/>Within the Imperial Palace.<br/><br/>The Grand Yu Emperor stepped out of the grand hall, standing on the steps and gazing at the illusion within the thundercloud on the horizon, his brows furrowed.<br/><br/>Hong Xian’er was in the midst of a fierce battle with a True Soul Realm cultivator, her gaze glancing up towards the sky, her delicate brows tightly knitted.<br/><br/>Anyone who saw this scene could sense Cultivator Xunxian’s power, and as the Heavenly Might descended, they could even hear Cultivator Xunxian’s voice.<br/><br/>“All of you watch carefully, this will be the fate of those who defy the vast heavens!”<br/><br/>As Cultivator Xunxian’s voice imprinted itself in the hearts of all beings, the figure in the illusion suddenly swung his horsetail whisk, striking at Fang Wang.<br/><br/>With this sweep, the thunderclouds burst forth with millions of lightning bolts, the bright light overpowering, causing the entire Human Emperor Continent to lose its colors, affecting all the battlefields.<br/><br/>Within the realm of the Celestial Qiankun Totem.<br/><br/>Fang Wang leaped up, his Tianling Body fused with the Heavenly Gang Supreme Yang Tyrant Body, withstanding the deluge of thunderbolts. In the blink of an eye, he charged right before Cultivator Xunxian, thrusting his Heavenly Palace Halberd with fury.<br/><br/>Cultivator Xunxian’s eyes widened, and the skin on his forehead suddenly split open, from which a vertical eye emerged, shooting out a terrifying beam of light that struck Fang Wang head-on.\t\t\t\t\t\t</div>", "images": {}, "success": true}