{"id": 357, "url": "https://www.novelhall.com/i-became-an-immortal-on-mortal-realm-32879/14900860.html", "title": "Chapter 347 - Chapter 347: Chapter 344: The Fourth Layer Of The Divine Passage Realm, A Mortal Realm Legend", "volume": 4, "volume_title": "Volume 4", "body": "<h1>Chapter 347 - Chapter 347: Chapter 344: The Fourth Layer Of The Divine Passage Realm, A Mortal Realm Legend</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 347: Chapter 344: The Fourth Layer of the Divine Passage Realm, A Mortal Realm Legend<br/><br/>Xiao Zi gazed at the dark area ahead, her dragon mouth agape in shock at the sight before her.<br/><br/>At the edge of the darkness, the earth was cleaved, leaving only half of the mountains, with rocks continually sliding down. Looking along both sides of the cliff, no end could be seen, and the depths of darkness were impenetrable.<br/><br/>Xiao Zi turned to look at Fang Wang, who maintained his fist clenched, his white clothes fluttering wildly as if ablaze.<br/><br/>Fang Wang seemed to feel her gaze and slowly opened his eyes, a glimmer of light flashing within.<br/><br/>When their eyes met, Xiao Zi’s heart skipped a beat, and she involuntarily shifted her gaze away.<br/><br/>“Let’s call it the Great Returning Void Palm!”<br/><br/>Fang Wang murmured to himself; as his words fell, his right hand erupted with a surge of energy that spread a hundred yards before finally dissipating.<br/><br/>A smile played upon his lips. This divine skill was a creation of his, combining the mysteries of many divine skills he had mastered; as the name implied, it was meant to turn the target into nothingness!<br/><br/>The Extinction Divine Force and Dao Power had given him much inspiration. He could use different powers to execute the Great Returning Void Palm, and since it was newly created, it could still be refined further.<br/><br/>Fang Wang began to concentrate on his practice, consolidating his cultivation.<br/><br/>It took a full half-year before his cultivation was completely solidified.<br/><br/>He stood up, landing by the lake, with Xiao Zi immediately following suit.<br/><br/>“Where to next?” Xiao Zi asked expectantly.<br/><br/>Fang Wang looked back. The half of the world he had destroyed remained engulfed in darkness. However, this world hadn’t collapsed because of it; he could even feel the world repairing itself, though the process would be unbearably long.<br/><br/>“We’ll travel a few more times. If we still can’t find the way back, then we’ll continue to cultivate until I reach the Sky-Stepping Realm, and then resume our journey,” Fang Wang answered, igniting a gleam in Xiao Zi’s eyes.<br/><br/>Then, he grabbed her, vanishing from the spot.<br/><br/>The next second, they were thousands of miles away.<br/><br/>He appeared in midair, looking down to see a burly man garbed in beast skins barely covering his modesty. This man was kneeling on a cliff, sculpting a human figure from mud, its posture exactly that of Fang Wang in meditation.<br/><br/>Xiao Zi was quite surprised by this scene.<br/><br/>The burly man seemed to sense something and looked up. Upon seeing Fang Wang and Xiao Zi, his face turned fierce. He was about to stand up and roar when he seemed to recognize something. Excitement flashed across his face, and he began to kowtow to Fang Wang incessantly.<br/><br/>Fang Wang couldn’t understand his language but could feel his emotions.<br/><br/>It was a strange feeling.<br/><br/>When Fang Wang previously used the Great Returning Void Palm, he felt the presence of living beings in this direction, so he chose another way.<br/><br/>There weren’t many creatures in this realm, mostly colossal fierce beasts, so seeing a human was a rarity for Fang Wang.<br/><br/>Fang Wang raised his right hand, extending his index finger to point at the burly man from afar, who, upon seeing his finger, froze instantly.<br/><br/>A beam of silver light shot out from Fang Wang’s fingertip, splitting in two and entering the eyes of the burly man.<br/><br/>Curious, Xiao Zi asked, “Young Master, why do you impart your power to him?”<br/><br/>Fang Wang’s expression was serene as he answered, “Having achieved the Divine Passage Realm in this world, and destroyed half of it, if I can leave behind my teachings, it would serve as recompense.”<br/><br/>Upon hearing this, Xiao Zi looked again at the burly man with renewed interest.<br/><br/>After the time it took for an incense stick to burn, Fang Wang finally retracted his hand, then disappeared into the air with Xiao Zi.<br/><br/>The burly man remained kneeling in the same place, his eyes dull, as lifeless as the mud sculpture beside him.<br/><br/>Time passed, and the burly man suddenly came to, confusedly looking around, his eyes gradually regaining clarity.<br/><br/>He stood up and began to bellow in all directions, but no answer came.<br/><br/>He squatted down in front of the clay figure and wrote two characters in the mud with his finger.<br/><br/>Fang Wang.<br/><br/>These characters were crooked and awkward to look at, barely recognizable.<br/><br/>The burly man took a step back, knelt, and worshiped these two characters with utmost devotion.<br/><br/>…<br/><br/>After shuttle-hopping seven times, Fang Wang still hadn’t found his way back. In this period, he had come across three different worlds inhabited by humans, but no one had heard of the Descending Dragon Great Saint.<br/><br/>At present, he was staying within a certain realm.<br/><br/>The spiritual energy of this realm was extremely abundant, on par with that of the Human Emperor Continent. However, this world was not large, only about the size of the Southern Celestial Sea, and the strongest creature there was only at the Mahayana Realm.<br/><br/>There were traces of dynasties and races here, and at first glance, it seemed no different from the Eastern Mortal Realm he came from, only weaker.<br/><br/>He suspected that this Mortal Realm had not existed as long as his own, which would explain why the top cultivators here were not as advanced as those in his place of origin.<br/><br/>If his speculation was correct, it meant that upon the birth of every realm, the spiritual energy was very dense. Most places in the Eastern Mortal Realm had less spiritual energy than this world, possibly due to the karmic suppression of the Immortal Divine beings or the actions of the Western Mortal Realm.<br/><br/>Regardless, Fang Wang intended to cultivate in this world until he reached the Sky-Stepping Realm.<br/><br/>“Build me a pavilion,” he said, before delving his spiritual sense into the Jade Bracelet.<br/><br/>Xiao Zi sighed, somewhat regretting not bringing the Soul Devouring Gourd along, as Zhao Zhen should have been the one to handle such trifling matters.<br/><br/>They stood in the woods, located between two tall mountains, where the forest was dense and shrouded in mist, seeming like a celestial realm within the world of mortals.<br/><br/>Soon, Fang Wang established contact with Zhou Xue. Over the years, the Grand Yu Divine Dynasty and Jin Xiao Sect continued their expansionist aggression, attacking those Saint Clans and Imperial Clans. The Grand Yu Emperor was clever, willing to accept those who surrendered, which prevented the various clans from uniting once again.<br/><br/>Wangdao returned to Grand Qi and continued his devoted quest for the Path of Immortality.<br/><br/>Wangdao was different from other sects; they didn’t seek to expand their power. Assisting the Grand Yu Divine Dynasty only served to repay the debt to the Dao Master. Once the Divine Dynasty’s calamities were over, their goal was to pursue The Path of Immortality and seek eternal life together.<br/><br/>And so, time accelerated its pace further.<br/><br/>Days and months interchanged in the mountains, and seasons changed.<br/><br/>One year was like a day.<br/><br/>After reaching the Divine Passage Realm, Fang Wang’s cultivation speed increased. Of course, each minor realm within the Divine Passage Realm required far more spiritual energy than the previous realms had.<br/><br/>Fang Wang’s cultivation efforts were immense, almost startling half of the Mortal Realm. Spiritual energy surged from all directions, a massive force causing the forest within five hundred li to be engulfed in a white expanse.<br/><br/>Cultivators arrived to investigate, only to encounter a True Dragon within the mist, sending them fleeing in panic.<br/><br/>Thus, word of a True Dragon cultivating in the area spread far and wide.<br/><br/>With Xiao Zi’s cultivation level being the strongest in this Mortal Realm, there was nothing for Fang Wang to worry about as it stood guard.<br/><br/>Five years later, Fang Wang reached the second layer of the Divine Passage Realm.<br/><br/>His progress in cultivation was faster than he had anticipated. He felt it was related to his Immeasurable Pure Bone. In his previous battle with the Seeker of Immortal Path, his flesh was burned away, and for the first time, his Immeasurable Pure Bone was exposed to damage, which fully activated it. Now, his cultivation efficiency surpassed any previous rate.<br/><br/>He continued his cultivation.<br/><br/>Five years on, he reached the third layer of the Divine Passage Realm.<br/><br/>After another six years, he had reached the fourth layer of the Divine Passage Realm!<br/><br/>This sensation of continuous breakthroughs fascinated him, and his determination to advance even further solidified.<br/><br/>He would not leave until he broke through to the Sky-Stepping Realm!\t\t\t\t\t\t</div>", "images": {}, "success": true}