{"id": 356, "url": "https://www.novelhall.com/i-became-an-immortal-on-mortal-realm-32879/14897455.html", "title": "Chapter 346 - Chapter 346: Chapter 343: Breakthrough To The Divine Passage Realm!", "volume": 4, "volume_title": "Volume 4", "body": "<h1>Chapter 346 - Chapter 346: Chapter 343: Breakthrough To The Divine Passage Realm!</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 346: Chapter 343: Breakthrough to the Divine Passage Realm!<br/><br/>Fang Wang opened his eyes, and after chatting with Zhou Xue for a while, his heart settled down.<br/><br/>He believed that Zhou Xue could take good care of the Grand Yu Divine Dynasty, Wangdao, and the Fang Family.<br/><br/>“The Spiritual Energy here is not bad, so why not cultivate here first?”<br/><br/>Fang Wang murmured to himself. He didn’t know how long it would take to return; dangers were uncertain along the way, so it was best to get stronger first.<br/><br/>Once stronger, his speed of traversing would significantly increase, and he would be more efficient.<br/><br/>He had already attained the Ninth Layer of the Heaven-Breaking Realm and should break through to the Divine Passage Realm!<br/><br/>Xiao Zi came up to Fang Wang and asked, “Young Master, are we not going back?”<br/><br/>“Perhaps, are you scared?”<br/><br/>As Fang Wang asked in return, he leaped up, starting to look for the place most abundant in nature’s spiritual energy.<br/><br/>Xiao Zi hurriedly followed, landing on his shoulder, and chuckled, “Of course I’m not scared. This is pretty good; now I’m the only one by the young master’s side, with no other bad women around.”<br/><br/>Fang Wang was speechless and said no more.<br/><br/>The Spiritual Energy in this realm was different from that in the Eastern Mortal Realm, and he was also curious about it. Would absorbing different Spiritual Energy help his strength?<br/><br/>One hour later, Fang Wang found a suitable place where the Spiritual Energy was not only abundant but also without any ferocious beast that could threaten Xiao Zi within ten thousand miles.<br/><br/>Fang Wang sat cross-legged in the air above the lake surface, with great mountains standing on three sides of the lake. Only the south side was mountain-free. The wind whistled through the pass, echoed among the mountains, and fluttered Fang Wang’s robes.<br/><br/>Xiao Zi couldn’t sit still and began wandering around.<br/><br/>…<br/><br/>Grand Yu Divine Dynasty, Imperial City, Pilgrimage Manor.<br/><br/>Zhou Xue and Hong Chen sat facing each other in a small pavilion, with an oil lamp on the table, flickering dim light.<br/><br/>“Heaven Emperor, it seems you have high expectations for Fang Wang; his aptitude is unparalleled. He might cultivate the Immeasurable Pure Bone to such an extent, surely you’ve put much effort into it,” Zhou Xue said softly with a smile.<br/><br/>Hong Chen shook his head, his eyes turned complex, “I only taught him the methods of cultivation, and that just once. His achievements today are all thanks to his own insight.”<br/><br/>With that, he couldn’t help but pour himself a cup of hot tea. His hands were trembling slightly; it was clear that his heart was not at peace.<br/><br/>Zhou Xue was taken aback upon hearing this.<br/><br/>For a time, the pavilion sank into silence, with only the sound of the wind blowing leaves in the courtyard.<br/><br/>After a while, Hong Chen broke the silence, “His attainment of the Dao Bone might have already surpassed that one. Regardless, he has completely grown up. Those deceased Great Saints, Great Emperors can’t scheme against him, including the Immortal Divines in the heavens. They can only pray that the time of ascension comes soon.”<br/><br/>Zhou Xue looked at him and calmly inquired, “This Mortal Realm has already undergone many changes, his fate is indeed peerless. But nothing is absolute, he still needs your guidance and strategy.”<br/><br/>Hong Chen nodded, “Rest assured, I now care more about his safety and future than you do.”<br/><br/>They both lifted their teacups and toasted each other.<br/><br/>…<br/><br/>The sky was covered in fiery clouds, the world grew dark, and mists of poison permeated the mountains.<br/><br/>With white hair and bare chest, Fang Zigeng hovered in mid-air, his right hand holding a bloody arm.<br/><br/>He looked down at the Extremely Evil Old Immortal lying on the mountainside, his gaze cold and detached.<br/><br/>At this moment, the Extremely Evil Old Immortal had lost all his limbs and even his eyes had been gouged out, the entire person lying in a pool of blood, a picture of extreme misery.<br/><br/>The Extremely Evil Old Immortal could no longer fight, and he seemed to be without pain, even sporting a twisted smile at the corners of his mouth.<br/><br/>“Not bad… you have surpassed me… but your cultivation is still not enough… if you wish to be unparalleled in the world like Tiandao Fang Wang, you need to cultivate harder…”<br/><br/>The Extremely Evil Old Immortal weakly chuckled, blood foaming from his mouth.<br/><br/>Fang Zigeng threw the arm he was holding on the ground and then raised his right hand, with a blood-colored flame igniting in his palm, blooming like a lotus flower.<br/><br/>“As once a mentor and protégé, if you have any last words, say them now. Soon, I will repay a hundredfold the torture you’ve inflicted on me, and by then, you won’t be in the mood to speak any last words.”<br/><br/>Fang Zigeng said coldly, the killing intent and hatred in his tone could hardly be contained.<br/><br/>The Extremely Evil Old Immortal’s mouth curled into a cruel smile as he laughed loudly in fits and starts, “Whelp… do you wish to make me regret? Do you know how your wife begged for mercy in agony within the cauldron? You certainly do not wish to know… so ugly… so lowly…”<br/><br/>Upon hearing this, Fang Zigeng’s pupils abruptly contracted, and with a loud boom, a sea of blood-red fire rose from the ground, even threatening to engulf the mountains in all directions.<br/><br/>…<br/><br/>As Fang Wang closed his eyes and focused solely on cultivation, time flew by swiftly.<br/><br/>In the blink of an eye.<br/><br/>Six years had passed, and on this day, Fang Wang finally reached his breakthrough.<br/><br/>A powerful pressure enveloped the world, causing ripples to spread across the surface of the lake, growing more and more violent until even the surrounding mountains trembled.<br/><br/>Xiao Zi rushed over from afar, its dragon claws still clutching a large fish, which thrashed violently but was unable to escape its grasp.<br/><br/>Nature’s Spiritual Energy surged crazily into Fang Wang’s body, and his cultivation level began to rise incessantly.<br/><br/>His eyes remained closed, as he thought about his Divine Skills.<br/><br/>After the great battle six years ago and six years of contemplation, he had finally made his decision.<br/><br/>Now, his heart was filled with numerous voices, all his own, each with different emotions, as if they represented different Divine Skills.<br/><br/>“Your Divine Skill must be overbearing!”<br/><br/>“Your Divine Skill must be able to exterminate evil!”<br/><br/>“Your Divine Skill must suppress all things!”<br/><br/>“Your Divine Skill must sweep through countless enemies!”<br/><br/>“The Celestial Qiankun is entirely in your hands!”<br/><br/>“The myriad laws of the universe can all be disintegrated by your fingers!”<br/><br/>More and more voices rose in Fang Wang’s heart, becoming increasingly urgent and loud.<br/><br/>Fang Wang didn’t find it noisy; his body shimmered with silver light, the radiance of the Immeasurable Pure Bone.<br/><br/>Xiao Zi felt an unbearable oppressive force and couldn’t help but retreat, the large fish in its claws disintegrating into ash.<br/><br/>Sunset followed by moonrise, day and night succeeded each other.<br/><br/>Day after day passed.<br/><br/>After seven whole days, Fang Wang’s aura finally erupted!<br/><br/>He had broken through!<br/><br/>The Divine Passage Realm!<br/><br/>At the same time.<br/><br/>Thousands of miles away, in a dense forest, a figure emerged from the trees and approached the edge of a cliff.<br/><br/>It was a man dressed in animal skin, with filthy, disheveled hair, a burly figure like a fierce beast, his eyes fixated on the horizon where the clouds churned, as if a storm was about to arrive.<br/><br/>With a plop!<br/><br/>He suddenly knelt on the cliffside, repeatedly kowtowing, muttering something under his breath.<br/><br/>Elsewhere.<br/><br/>Fang Wang, seated cross-legged above the surface of the lake, slowly raised his right hand palm-up until it was level with his eyes.<br/><br/>From beginning to end, he didn’t open his eyes.<br/><br/>He seemed to sense something, shifted his right hand to the side slightly, then made a fist, as if grasping something in the void of the distant sky.<br/><br/>In an instant, in the direction of his right hand, mountains crumbled, the earth cracked open, the sea of clouds in the sky completely dissipated, and half of the world seemed to shatter in a moment.<br/><br/>The scene froze, and the shattered half of the world paused for a second, the next second, everything turned to nothingness, darkness swept in like a primordial beast devouring everything, and the entire world dimmed.\t\t\t\t\t\t</div>", "images": {}, "success": true}