{"id": 354, "url": "https://www.novelhall.com/i-became-an-immortal-on-mortal-realm-32879/14896932.html", "title": "Chapter 344 - Chapter 344: Chapter 341: Emperor Versus God", "volume": 4, "volume_title": "Volume 4", "body": "<h1>Chapter 344 - Chapter 344: Chapter 341: Emperor Versus God</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 344: Chapter 341: Emperor versus God<br/><br/>Fang Wang carried the bisected body of the Daoist in search of immortals in both hands, while the Heavenly Palace Halberd floated behind him, wrapped in silver light.<br/><br/>Xiao Zi, who was attached to the Heavenly Palace Halberd, was equally stunned.<br/><br/>“You…”<br/><br/>The Daoist’s voice rang out, filled with incredulity.<br/><br/>When flesh grew back on Fang Wang’s face and eyelids covered his eyeballs, at that moment, he was closing his eyes as the armor of the Tianling Body swiftly covered his exterior.<br/><br/>Facing the Daoist’s exclamation, he remained indifferent, his hands channeling the power of the Mie Jue Divine Tome, turning the two halves of the Daoist’s body into ash and smoke.<br/><br/>This scene deeply shocked all the onlookers.<br/><br/>Undying and indestructible!<br/><br/>Unrivaled under the heavens!<br/><br/>These were the feelings of everyone.<br/><br/>The Daoist in search of immortals was not weak; on the contrary, he was incredibly powerful, yet he still perished at the hands of Fang Wang.<br/><br/>Although Fang Wang’s body had been incinerated, considering his self-healing abilities, everyone felt there was a huge gap between the Daoist and Fang Wang.<br/><br/>This was definitely not a fluke victory, but complete domination!<br/><br/>Once Fang Wang set his mind to kill, the aloof Daoist was directly torn apart by hand!<br/><br/>Even with the legacy of a Great Saint or an Immortal Divine, the Daoist was no match for Fang Wang and met such a miserable end, greatly elevating Fang Wang’s image in their hearts.<br/><br/>As the breath of the Daoist vanished, Fang Wang opened his eyes, and at this moment, all living beings in the Mortal Realm watching the illusion of the battle felt as if they were being watched by Fang Wang’s gaze.<br/><br/>It was an absolutely indifferent look!<br/><br/>At the same time, the visions in the Firmament began to disappear everywhere.<br/><br/>Once the Firmament illusion vanished, scores of Saint Clans and Imperial Clans issued orders to retreat.<br/><br/>Within the Boundless Land.<br/><br/>Fang Wang hovered in the darkness, sensing that the strange, extraordinary aura was fading away.<br/><br/>Only when the aura had completely disappeared did Fang Wang finally exit the Heart of the Heavenly Dao state.<br/><br/>“The Immeasurable Pure Bone is indeed stronger than the Heavenly Gang Supreme Yang Tyrant Body…”<br/><br/>Fang Wang’s eyes flickered, and a bold notion suddenly crossed his mind.<br/><br/>Even without a physical body, his dao bones still existed and could even protect his soul.<br/><br/>If he were to execute the Nine Extremes Blood Sacrifice Technique and preserve his soul within his dao bones, could it be feasible?<br/><br/>After performing the Nine Extremes Blood Sacrifice Technique, the body’s karmic ties and fate would dissipate, making it very difficult to regenerate flesh unless he found a cultivation item and performed the Nine Lives Nirvana Sword Technique to rebuild his body.<br/><br/>If a living being has no physical body, they either reincarnate or become a ghost, and it is difficult to transcend.<br/><br/>Fang Wang had never been a ghost before and was unsure what that state would feel like.<br/><br/>Xiao Zi flew out from within the Heavenly Palace Halberd, coiling next to Fang Wang, it asked, “Young master, how shall we return now?”<br/><br/>The place gave it an incredibly eerie feeling, making it want to flee quickly.<br/><br/>“No rush, there is one more opponent yet to arrive,” Fang Wang said calmly, his gaze sweeping the surroundings.<br/><br/>He wasn’t seeking out the enemy, but observing the Boundless Land.<br/><br/>Intuition told him that this place was no longer within the Mortal Realm he belonged to.<br/><br/>He and the Daoist had teleported countless miles yet saw no boundaries, indicating how vast this realm was.<br/><br/>“One more opponent?” Xiao Zi was astonished.<br/><br/>Boom!<br/><br/>A pillar of light with a terrifying aura pierced through the Sea of Thunderclouds, descending upon the land less than ten miles from them.<br/><br/>The ground erupted, dust billowing, and Xiao Zi fixed its gaze upon the fearsome column of light where a divine figure with majestic presence descended from the sky.<br/><br/>Fang Wang then sensed an unfathomable presence, far surpassing the Seeker of Immortals from before.<br/><br/>Moreover, there was a hint of this figure’s aura on the body of the Seeker of Immortals.<br/><br/>Could it be… the Doom God?<br/><br/>Fang Wang immediately had Xiao Zi burrow into the Heavenly Palace Halberd, and he too gazed at the mysterious figure within the beam of light.<br/><br/>“Mortal, your talent has surprised me. I am a True God of the Immortal Court, with the divine name Doom. All beings refer to me as the Doom God,” the figure spoke, his voice carrying an indescribable oppressiveness as if he was articulating cosmic laws, with each word embodying the principles of heaven and earth.<br/><br/>“May I ask, Doom God, are you descending to the Mortal Realm to avenge your followers?” Fang Wang asked unabashedly, the sense of oppression from the Doom God extremely strong, reminding him of his earlier encounter with the Ghost Emperor.<br/><br/>“Mortal, would you pledge yourself to me? When the opportunity for your ascension arises, I will guide you in your ascension. Once in The Upper Realm, I will give you special attention, ensuring that your starting point after ascension surpasses that of other Ascenders. In the future, you might even be ranked among the immortals, enjoying eternal life, overseeing the Mortal Realm,” the voice of the Doom God rose again, his tone imbued with an indescribable arrogance, the pride of an Immortal Divine, convincing and compelling belief instinctively.<br/><br/>Fang Wang then asked, “Are you the true self? What place is this?”<br/><br/>Immortal Divines should not be able to descend into the Mortal Realm at this time. The fact that the other party appeared indicated that this place was not the Mortal Realm.<br/><br/>The Doom God remained within the beam of light, not stepping out, and chuckled lightly, “Not the true self. This is not the Mortal Realm either. Do you think you stand a chance because I am not the true self?”<br/><br/>Fang Wang calmly said, “I indeed am very curious to know how strong a real Immortal Divine is.”<br/><br/>Upon hearing this, the Doom God burst into loud laughter, as if he had heard the funniest joke in heaven and on earth.<br/><br/>He suddenly stopped laughing, and a terrifyingly unparalleled aura enveloped all creation, the ground endlessly shattering, clouds of dust rising.<br/><br/>In the sky, bizarre bolts of lightning appeared as if even space itself was about to fracture.<br/><br/>Fang Wang narrowed his eyes, ready to perform the Jiu You Freedom Technique at any moment.<br/><br/>The enemy before him was completely different from any he had faced before, and he could not let his physical body endure it by force!<br/><br/>“For a True God of the Immortal Court to bully a mere mortal who is only a little over three hundred years old, seems somewhat beneath the status of a divine, doesn’t it?” a cold voice rang out, causing Fang Wang to raise his eyebrows.<br/><br/>The Ghost Emperor’s voice!<br/><br/>Fang Wang looked intently, and at the edge of the horizon behind him, a towering figure appeared.<br/><br/>It was indeed the Ghost Emperor!<br/><br/>The Ghost Emperor stood tall, concealing his true form in the darkness. Even by just revealing his figure, he was formidable to behold.<br/><br/>His presence was even stronger than that of the Doom God!<br/><br/>“Ghost Emperor of the Underworld, why have you come here? Could there be a connection between you two?” The voice of the Doom God rang out, with a note of displeasure in his tone.<br/><br/>The Ghost Emperor stayed in the distance, responding, “After all, before my death, I too hailed from the same Mortal Realm as he does. Leave now. With me here, this avatar of yours won’t be able to harm him.”<br/><br/>Dominance!<br/><br/>He was completely disregarding the Doom God!<br/><br/>Fang Wang hadn’t expected the Ghost Emperor to come to his aid, which made him all the more curious about what place this was.<br/><br/>As the Ghost Emperor’s words fell, the world fell into silence.<br/><br/>The Doom God within the beam of light seemed to be weighing something, not answering immediately.<br/><br/>After a long time,<br/><br/>The terrifying aura of the Doom God dissipated, and his voice followed,<br/><br/>“Since that’s the case, I will give the Ghost Emperor face. When the period of ascension comes to the Mortal Realm, my true self shall personally descend. I hope that at that time, I can still see the Ghost Emperor make an appearance. I am very much looking forward to a confrontation with you!”<br/><br/>As the words of the Doom God fell, the light pillar connecting heaven and earth shrank upwards and disappeared into the clouds.<br/><br/>Fang Wang turned around, looked towards the Ghost Emperor, and said, “Thank you for your assistance, senior.”<br/><br/>The Ghost Emperor calmly said, “When the true self of the Doom God descends, at that time, I will not assist you.”<br/><br/>“Moreover, it won’t be easy for you to return to the Mortal Realm from here.”\t\t\t\t\t\t</div>", "images": {}, "success": true}