{"id": 351, "url": "https://www.novelhall.com/i-became-an-immortal-on-mortal-realm-32879/14896412.html", "title": "Chapter 341 - Chapter 341: Chapter 338: The Endless Land, The Final Battle With Doom", "volume": 4, "volume_title": "Volume 4", "body": "<h1>Chapter 341 - Chapter 341: Chapter 338: The Endless Land, The Final Battle With Doom</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 341: Chapter 338: The Endless Land, the Final Battle with Doom<br/><br/>Facing the sudden opening of the vertical eye of the seeker of the Path of Immortality, Fang Wang was caught off guard and struck by the beam of light that shot out from it.<br/><br/>Boom—<br/><br/>Fang Wang was sent flying, the tremendous force ravaging the armor on his Tianling Body, making him frown.<br/><br/>Beyond the destructive power, the beam also contained a strong sealing force; just one hit and most of his Spiritual Power was sealed, making it extremely stiff to mobilize.<br/><br/>The seeker swung his horsetail whisk at Fang Wang again, gathering thunderous power like a heavenly net sweeping across, while his left hand began to form mystical gestures.<br/><br/>The ground shattered, and black mist rose, as if to engulf all things between heaven and earth.<br/><br/>Facing the oncoming net of thunder, Fang Wang leaped high with ease, dodging it, and with the momentum, he thrust the Heavenly Palace Halberd forward, releasing his right hand.<br/><br/>The Heavenly Palace Halberd surged forward with terrifying speed, piercing through the clouds along its path, unstoppable.<br/><br/>This was Fang Wang’s favorite tactic, which was based on the principle of the Great Perfection’s Sword Control Technique!<br/><br/>As the Heavenly Palace Halberd cut through the sky, the seeker raised his left hand to defend against the attack, but was still forced back by the impact, prompting him to frown.<br/><br/>And this scene, witnessed by all beings on the Human Emperor Continent, was incredibly uplifting.<br/><br/>They did not recognize the seeker but the sense of oppression he had shown earlier was so intense that they could not help but worry for Fang Wang.<br/><br/>Now, seeing Fang Wang repel the seeker with a halberd strike, they realized that this was the same talent that Emperor Donggong had spared no effort to protect at all costs!<br/><br/>No, he was no longer just a genius, but a top-tier fighter in the Mortal Realm!<br/><br/>Just as Fang Wang was preparing to attack again, the seeker raised his palm towards the Firmament.<br/><br/>The Sea of Thunderclouds exploded suddenly, with rays like sunlight striking down in countless numbers, overwhelming with the aura of world condemnation.<br/><br/>Boom! Boom! Boom…<br/><br/>The ground was relentlessly bombarded, and Fang Wang had to keep moving due to the majority of his Spiritual Power being sealed, which made it difficult for him to use the techniques of the Lingxiao Divine Sect, so he had to rely on his physical reflexes to dodge.<br/><br/>He moved swiftly, closing the distance with the seeker, and threw a punch, unleashing Extinction Divine Force, causing the space in front of the seeker to shatter.<br/><br/>The seeker’s pupils suddenly contracted as he produced a shadow, which he retreated to. Just as Fang Wang’s punch was about to strike him, his actual body and shadow instantaneously switched places.<br/><br/>Fang Wang dispersed the seeker’s shadow with one punch, his eyebrows involuntarily knitting together.<br/><br/>What kind of movement technique was this?<br/><br/>He looked closely only to see the seeker had already shifted thousands of miles away.<br/><br/>The beams of light continued to fall from the sky, and while dodging them, Fang Wang contemplated his next move.<br/><br/>He raised his hand to reclaim the Heavenly Palace Halberd, and once again clenched his left fist, this time, harnessing Dao Power.<br/><br/>With one punch, heaven and earth shattered!<br/><br/>The Celestial Qiankun Totem of the seeker was smashed by his fist!<br/><br/>The black mist spreading over the ground rose like blazing flames.<br/><br/>Cold winds attacked from all directions, and with a glance, Fang Wang’s brows grew tighter.<br/><br/>After the Spiritual Elephant shattered, he had not returned to reality.<br/><br/>He was still in a gloomy dark world, permeated by a strange poison that was invisible and odorless; any cultivator below the Mahayana Realm who fell into this realm would be corroded by the poison in a very short time, dying a terrible death.<br/><br/>“To ensure you can fight at ease, this seat has indeed gone to great lengths, selecting a suitable place just for you,” said the seeker’s voice, hovering at the edge of the sky, surrounded by darkness, with his white hair wildly fluttering, reminiscent of a demon’s whiskers, horrifying and terrible.<br/><br/>The Human Emperor Continent.<br/><br/>Under the dim Firmament, countless cultivators were engaged in fierce battles and magical duels.<br/><br/>The Hongxuan Emperor narrowed his eyes, his brows furrowing as he muttered to himself, “The Land of No End… It truly is that guy’s handiwork…”<br/><br/>Many of the beings engaged in battle would glance up from time to time, for they all knew that the key to this calamity lay in the battle between Fang Wang and the Immortal Seeking Scholar.<br/><br/>Fang Wang didn’t care where he was at the moment; all he wanted was to kill the Immortal Seeking Scholar!<br/><br/>Fang Wang spun the Heavenly Palace Halberd in one hand, his gaze fixed on the Immortal Seeking Scholar as he pondered how to slay him.<br/><br/>The Immortal Seeking Scholar was starkly different from the four Celestial Qiankun beings Fang Wang had encountered before, not only stronger in cultivation but also with more unpredictable Divine Skills.<br/><br/>“Ah, once I break through to the Divine Passage Realm, I need to figure out how to integrate my Divine Skills. I’m lacking a finishing move,” Fang Wang lamented to himself.<br/><br/>Xiao Zi couldn’t help but exclaim, “My lord, you don’t even consider how many realms higher your opponent is, and you’re thinking of a finishing move?”<br/><br/>The Immortal Seeking Scholar, who was far away, also heard Fang Wang’s words. He snorted coldly, did not shout back, did not make a move, but instead began casting a spell on the spot.<br/><br/>“The Heavenly Laws vast and mighty, spirits of the earth grievous and determined, doom as fated, with extreme and contrary mysteries, evil as evil, mystery as mystery, may heaven have mercy, may the gods bestow grace…”<br/><br/>The Immortal Seeking Scholar quickly chanted incantations with his hands weaving spells, and within an instant, Fang Wang felt an overwhelming pressure descend upon him.<br/><br/>Fang Wang instantly thought of the Doom God that Hong Chen had mentioned.<br/><br/>Fang Wang immediately summoned his Heavenly Emperor Avatar, a thousand-feet-tall image appeared, followed by one Lifespirit Treasure after another.<br/><br/>The Rainbow Sword, Qiankun Fan, Reincarnation Bell, The Six Harmonies and Eight Desolations Seal, Heaven Bound Golden Silk, Town World Bead!<br/><br/>Seeing Fang Wang summon so many Lifespirit Treasures, the Immortal Seeking Scholar frowned. His eyes were extraordinary, and he could tell at a glance that these treasures were no common artifacts.<br/><br/>“A talent with nine lives… vast and surging fortune…”<br/><br/>For the first time, a hint of envy flashed in the Immortal Seeking Scholar’s eyes.<br/><br/>Why had the heavens given birth to such a favored child of the skies?<br/><br/>And why should he be destroyed?<br/><br/>Could it be that he was too brilliantly crafted, upsetting the balance of the universe, and thus he must be eliminated?<br/><br/>If that were the case, then may heaven grant me even greater power!<br/><br/>The Immortal Seeking Scholar’s eyes hardened, his aura surged, and the Power of Doom transformed into a dragon-like black mist that swirled around him.<br/><br/>At that moment, Fang Wang launched his attack.<br/><br/>The domineering Heavenly Emperor Avatar wielded the Heaven Bound Golden Silk. The ribbon instantly extended hundreds of miles, sweeping across the dark skies, striking the Immortal Seeking Scholar.<br/><br/>An invisible force repelled the Heaven Bound Golden Silk, and the Immortal Seeking Scholar followed up with an attack on Fang Wang.<br/><br/>Boom!<br/><br/>The two collided, employing their Divine Skills and constantly clashing. Their figures were projected across the sky above the Human Emperor Continent, rendering countless beings unable to catch sight of them. All that could be seen were bursts of spiritual power exploding in the darkness, displaying a multitude of colors.<br/><br/>As Fang Wang and the Immortal Seeking Scholar began their decisive battle, the morale of the combatants on the side of the Human Emperor Continent soared. Blood pumped fervently through their veins as they fought with all their might.<br/><br/>Throughout the world, the sounds of fierce fighting, rallying cries, and thunderous roars reverberated, as if the end of days had arrived!<br/><br/>Within the Land of No End.<br/><br/>Fang Wang swiftly wielded the Heavenly Palace Halberd with great force and intensity. Yang energy blazed like flames around him, and the Heavenly Emperor Avatar behind him continuously activated his other Lifespirit Treasures.<br/><br/>The Qiankun Fan unleashed a vast expanse of flames that swept across the firmament. After being singed by it, the Immortal Seeking Scholar dared not face it head-on again.<br/><br/>The Immortal Seeking Scholar leaped into the air, delivering a palm strike that transformed into a giant black hand crashing down, only to be blocked by the Reincarnation Bell that appeared out of nowhere above Fang Wang, shielding him from the blow.<br/><br/>A huge palm imprint formed on the surface of the Reincarnation Bell, and wisps of smoke began to rise from it.\t\t\t\t\t\t</div>", "images": {}, "success": true}