{"id": 358, "url": "https://www.novelhall.com/i-became-an-immortal-on-mortal-realm-32879/14900861.html", "title": "Chapter 348 - Chapter 348: Chapter 345: The Legend Of The Ascension Stairway", "volume": 4, "volume_title": "Volume 4", "body": "<h1>Chapter 348 - Chapter 348: Chapter 345: The Legend Of The Ascension Stairway</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 348: Chapter 345: The Legend of the Ascension Stairway<br/><br/>“`<br/><br/>The fourth layer of the Divine Passage Realm was far from enough for Fang Wang, who planned to continue his training. However, before that, he took a break to rest for a while and used his divine sense to capture traces of Xiao Zi.<br/><br/>At this moment, Xiao Zi was hundreds of miles away, coiled above a lake, where more than ten people knelt by the shore, each with a look of piety and fervor on their faces, both men and women.<br/><br/>These scenes made Fang Wang both laugh and cry.<br/><br/>The level of cultivation development in the Mortal Realm was low, and to mortals, Xiao Zi truly appeared like an Immortal Divine descended to earth. A simple display of a spell could elicit continuous exclamations from the mortals.<br/><br/>Watching Xiao Zi showing off before the mortals, Fang Wang suddenly felt that the present moment was rather enjoyable.<br/><br/>Secluded in the deep mountains for cultivation, watching leisurely pastimes with amusement—this was more comfortable than vying for supremacy.<br/><br/>Of course, perhaps because he had fought too much, once he had cultivated arduously for a long time, he might fancy going out for a walk again.<br/><br/>Fang Wang closed his eyes and continued cultivating.<br/><br/>Thus, in a rush, ten years passed by.<br/><br/>Fang Wang’s cultivation level had reached the fifth layer of the Divine Passage Realm, and he continued to strive for the sixth layer.<br/><br/>One day.<br/><br/>His jade bracelet transmitted waves of divine sense; it was Zhou Xue contacting him. He immediately extended his divine sense into it.<br/><br/>After the two met in the Illusionary Realm, the first thing Zhou Xue said made Fang Wang feel a deep sense of sentiment.<br/><br/>“The Ascension Stairway has begun, and I have also participated,” Zhou Xue said with a chuckle, her gaze teasing, curious to see Fang Wang’s reaction.<br/><br/>Fang Wang raised his eyebrows and replied, “Is the Ascension Stairway interesting without me? Tell me about it.”<br/><br/>Zhou Xue began to introduce the situation of the Ascension Stairway, where this time, not only the heroes and powerful beings from the Eastern Mortal Realm participated but also cultivators from the Western Mortal Realm, making it the most spectacular Ascension Stairway in thousands of years.<br/><br/>Zhou Xue brought many cultivators from the Jin Xiao Sect to participate, people inside Wangdao also joined, the Red Dust Gang from Wangdao secured many participation spots, and individuals from the Grand Yu Divine Dynasty were involved as well.<br/><br/>The three powers helped each other in the Ascension Stairway due to their previous joint battles, forming a force that made all the cultivators and demons in the Ascension Stairway wary.<br/><br/>“Did that Nine Lives Precious Spirit participate?” Fang Wang asked.<br/><br/>Zhou Xue’s eyes were filled with profound meaning as she replied, “He did, and he’s quite renowned. Moreover, he’s here for you.”<br/><br/>“Oh? Has my reputation spread to the Western Mortal Realm?”<br/><br/>“Naturally, you are no longer the number one talent under heaven but a first-rate power of the Mortal Realm. As your battle achievements spread, all the powers in this world have come to fear you, yet those self-proclaimed geniuses all want to challenge you.”<br/><br/>As Zhou Xue spoke, she paused, sizing up Fang Wang before continuing, “Now, there is a rumor circulating in the Mortal Realm that only those with the fate of a Great Saint or a Great Emperor can defeat you. Just the intelligence gathered by my Jin Xiao Sect indicates countless top talents from various seas and continents are targeting you. When you return, you’ll be facing endless troubles.”<br/><br/>Fang Wang shrugged and said, “When I return, they will be facing a different me.”<br/><br/>After hearing about the situation of the Ascension Stairway from Zhou Xue, Fang Wang also felt some anticipation.<br/><br/>According to Zhou Xue, the development in the Mortal Realm had changed, with the current Ascension Stairway surpassing that of the past life. Those beings who should have reached the pinnacle had started to emerge, and even geniuses and Great Cultivators that had not appeared in the past life were now present. This suggested that the competition in this life would be more intense.<br/><br/>Fang Wang was not afraid of competition; in fact, he looked forward to even stronger opponents.<br/><br/>“By the way, you should remind Wangdao of these matters,” Fang Wang said, his tone turning serious.<br/><br/>Zhou Xue laughed, “Rest assured, the intelligence network laid out by Red Dust is in no way inferior to ours, and besides, Wangdao has its share of talents with the fate of a Great Saint or the potential of a Great Emperor. They need pressure to truly take that step.”<br/><br/>After hearing this, Fang Wang felt it made sense, and the two went on to discuss the recent situation of the Grand Yu Divine Dynasty.<br/><br/>Following its trials and tribulations, the Grand Yu Divine Dynasty had embraced a flourishing opportunity for development. A vast amount of cultivation resources had been amassed within the dynasty, and with the Divine Dynasty’s fate on the rise, cultivators found it easier to train. Talents sprouted like bamboo after a spring rain, with the fate of the Grand Yu Divine Dynasty improving day by day.<br/><br/>Hong Xian’er achieved exceptional results in the Ascension Stairway, earning the title of the number one female talent under heaven and even considered to have the chance of becoming a Great Emperor.<br/><br/>“`<br/><br/>Throughout history, there have been empresses, though they are rare. Today, many Cultivators claim to be prodigies destined for imperial greatness, but among female Cultivators, only Hong Xian’er inspires universal conviction. Even many women of the Fang Family admire her.<br/><br/>As Zhou Xue put it, the Descending Dragon Continent has thoroughly connected with the Mortal Realm. Everything that happens in the world can be spread into the Descending Dragon Continent. The rumors about Hong Xian’er and Fang Wang make the Fang Family Disciples feel closer to her.<br/><br/>When Fang Wang heard this, he didn’t know whether to laugh or cry — this woman was clearly jabbing at him!<br/><br/>The two of them chatted for several hours. By the time Fang Wang retracted his divine consciousness, it was already dark.<br/><br/>He sat cross-legged on the roof of the pavilion, looking up to see the night sky. The moon was bright and stars were sparse. The sky of this part of the Mortal Realm was a deeper blue, mysterious and exquisitely beautiful.<br/><br/>Fang Wang began to enjoy the moonlight. Despite having been here for many years, he had never truly appreciated the scenery.<br/><br/>If he left, coming back would be difficult.<br/><br/>He sat down again just before dawn, preparing to continue his Cultivation.<br/><br/>Suddenly.<br/><br/>He saw a shooting star fall and fly towards the horizon, quickly vanishing from sight.<br/><br/>Fang Wang only glanced at it and, realizing that it posed no threat to him, continued his Cultivation.<br/><br/>He was merely a passerby in this Mortal Realm — there was no need for him to get too involved.<br/><br/>…<br/><br/>Under the blue sky, the ocean was boundless, and its beauty was like a magnificent painting.<br/><br/>On a flat boat, a man in a straw raincoat was rowing. At the stern lay a Taoist, legs crossed at the ankles, a blade of grass in his mouth, humming an unknown tune.<br/><br/>This Taoist was none other than Jiang Shenming, the reincarnation of the Great Emperor.<br/><br/>“Immortal Master, where are we going?” asked the man in the straw raincoat, turning to look back.<br/><br/>Jiang Shenming, with his eyes closed, hummed in response, “To greet the Dao Master of my Wangdao.”<br/><br/>“Dao Master? Tiandao Fangwang?”<br/><br/>Upon hearing this, the man in the straw raincoat became visibly excited, his face flushing with curiosity as he asked, “Where has the Dao Master been since the world-shaking battle decades ago? Why don’t we just fly there directly?”<br/><br/>“He went to another Mortal Realm. When the time is right, he will return. Going too early is of no use, so we row slowly and meanwhile admire the scenery along the way, reflecting on the Dao,” Jiang Shenming answered leisurely, his Taoist garb making him appear unfathomable.<br/><br/>With a puzzled look, the man in the straw raincoat asked, “Can observing the scenery also lead to comprehending the Dao?”<br/><br/>“Certainly. Once you’ve grasped it, I will accept you into the Wangdao Divine Sect,” Jiang Shenming assured him.<br/><br/>“Really?”<br/><br/>“The Divine Sect does not speak idly,” Jiang Shenming affirmed.<br/><br/>The man in the straw raincoat turned his head, looking forward with eyes filled with aspiration.<br/><br/>Just then.<br/><br/>The sea ahead began to rise, tilting their wooden boat.<br/><br/>Jiang Shenming opened his eyes to see, his brows furrowing in response.<br/><br/>With an earth-shattering roar, a dragon head as vast as mountains emerged, splashing water in all directions. The man in the straw raincoat felt as if a deluge of rain was pouring down on them.\t\t\t\t\t\t</div>", "images": {}, "success": true}