{"id": 364, "url": "https://www.novelhall.com/i-became-an-immortal-on-mortal-realm-32879/14910412.html", "title": "Chapter 354 - Chapter 354: Chapter 351: Desolate Mortal Realm, Cosmic Opportunity", "volume": 4, "volume_title": "Volume 4", "body": "<h1>Chapter 354 - Chapter 354: Chapter 351: Desolate Mortal Realm, Cosmic Opportunity</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 354: Chapter 351: Desolate Mortal Realm, Cosmic Opportunity<br/><br/>Yang Lin’er approached, staring at Fang Wang. She was also quite surprised; she had not expected to run into Fang Wang here.<br/><br/>Fang Wang smiled and said, “I really like this outfit, so naturally, I kept it.”<br/><br/>He looked towards Yang Lin’er and asked with a smile, “Care to join me for a meal?”<br/><br/>Yang Lin’er snapped back to reality, quickly nodding. She pushed Yang Jun inside, then sat down opposite Fang Wang, her eyes shining as she looked at him.<br/><br/>Yang Jun excitedly asked, “Fang Wang, what a coincidence! I didn’t expect to run into you here. Do you remember? We’ve eaten here before.”<br/><br/>“Of course I remember. It was you guys who treated me to a meal here before, and I thought the food was good, so I come often,” Fang Wang replied with a smile. He then asked the waiter for a menu.<br/><br/>The restaurant wasn’t large, with only two waiters, but it had many loyal customers and could be considered thriving.<br/><br/>Yang Jun, still chatty, curiously asked, “You come here often? Do you live nearby?”<br/><br/>“Yes, I have been living around here since four years ago,” Fang Wang affirmed.<br/><br/>“Eh? Why didn’t you contact us? Didn’t I give you my number?”<br/><br/>“You guys were in college; I didn’t want to disturb you. How’s college life?”<br/><br/>“Disturb us? College is fine, just that. A buddy of mine just broke up a few days ago…”<br/><br/>After directing the conversation back to Yang Jun, Yang Jun started to talk incessantly. After Yang Lin’er ordered the dishes, she would occasionally poke fun at him, making the atmosphere quite lively.<br/><br/>Just like four years ago, this brother and sister duo was still lively and loved to banter. Fang Wang could tell their relationship was genuinely close.<br/><br/>Once all the dishes were served, Yang Lin’er couldn’t resist asking Fang Wang to judge, “This guy wants to be a war correspondent, giving up his major, and he’s planning to go abroad alone, travel for two years, and check out the foreign environment. Do you think he’s crazy?”<br/><br/>Fang Wang picked up his chopsticks and began eating. Faced with Yang Lin’er’s question, he just smiled and nodded, offering no comment.<br/><br/>Yang Jun, feeling annoyed, said, “All you know is to lecture me. What about you? The school offered you a chance to study abroad, and you actually refused. If you really listen to our parents so much, why don’t you go back and help them? Why stay alone in East Sea City? Could it be you’re planning to struggle for ten years to prove to mom and dad you can surpass them on your own?”<br/><br/>Listening to their conversation, it seemed that the siblings came from a well-off family. That made sense; after all, four years ago, they were very sentimental towards Fang Wang when they first met, which was not typical for freshmen.<br/><br/>Fang Wang found their bickering not dull but rather amusing.<br/><br/>In the four years since he arrived in this Mortal Realm, he had made some friends, but none were very close. Not everyone was as outgoing as Yang Jun, and Fang Wang also had a good impression of them.<br/><br/>Yang Lin’er glared at Yang Jun, then turned to Fang Wang with curiosity, “Fang Wang, what are you up to now? Are you planning on settling in East Sea City?”<br/><br/>It seemed Yang Jun realized something; his right hand pointed at Yang Lin’er, his expression one of sudden understanding, “So that’s it. You want to stay in East Sea City. Could it be because you want to find Fang Wang?”<br/><br/>At that, Yang Lin’er’s face turned bright red instantly. She glared at Yang Jun with wide eyes and scolded, “Don’t talk nonsense! I just have my own plans!”<br/><br/>Fang Wang smiled and said, “Yes, I’ll be staying in East Sea from now on.”<br/><br/>He planned to complete the integration of his secret technique here, a process that might take decades. For mortals, decades is almost a lifetime, so he was willing to engage with the siblings.<br/><br/>Learning that Fang Wang planned to stay in East Sea City, Yang Lin’er visibly perked up. The conversation shifted away from them and towards Fang Wang, who began to spin tales, even creating a fake college backstory for himself.<br/><br/>“University romances indeed rarely last till the end. Don’t be sad, Fang Wang. How about my sister? She hasn’t even had a boyfriend in college,” Yang Jun said, snickering, which resulted in Yang Lin’er twisting his arm, making him inhale sharply from the pain.<br/><br/>They all enjoyed the dinner, at least as far as Fang Wang was concerned.<br/><br/>Mortal life, though simple, had its own splendor.<br/><br/>After dinner, the three of them exchanged phone numbers. Yang Jun invited Fang Wang to hang out, and Fang Wang didn’t refuse. Later on, Yang Jun and Yang Lin’er realized that Fang Wang was very familiar with the area; even singing at a karaoke bar would elicit calls from the front desk addressing him as “President Fang.”<br/><br/>The trio played until two in the morning when Fang Wang invited them to stay overnight at his place, and Yang Jun immediately agreed.<br/><br/>Then, Yang Jun and Yang Lin’er were astonished. In a place like East Sea City, where every inch of land was worth its weight in gold, the young Fang Wang actually lived in a large flat, which further piqued their curiosity about his family background.<br/><br/>Deep into the night.<br/><br/>Fang Wang sat in meditation in front of the floor-to-ceiling window, the skyline outside still twinkling with neon lights, as if it were a city that never slept.<br/><br/>His Primordial Spirit leaped out of his flesh and went directly into the cosmos.<br/><br/>He had previously observed that Earth was not the entire Mortal Realm but simply a part of it, and this universe was the true Mortal Realm. It was just that the earth had been shattered into countless pieces.<br/><br/>Though Earth had some beings with power greater than mortals, none could surpass the Profound Heart Realm, so he wanted to see if there were other powerful creatures in the cosmos.<br/><br/>His Primordial Spirit began to traverse the universe at an extremely fast speed.<br/><br/>The night passed swiftly.<br/><br/>The sunlight of the next day streamed through the floor-to-ceiling window onto Fang Wang, and he slowly opened his eyes, a hint of confusion flashing through them.<br/><br/>There were no other creatures in the cosmos, and those planets had no intelligent entities.<br/><br/>This part of the Mortal Realm seemed to have been forgotten by the Immortal Divine, desolate and vast.<br/><br/>Fang Wang decided to explore the cosmos more whenever he had some spare time. Since it was a part of the Mortal Realm, it must be hiding chances of fortuity. Any part of the Mortal Realm that came into being would nurture great beings. This part of the Mortal Realm seemed like it had gone through a great war, with heavens and earth shattered and desolation prevailing. Perhaps in a corner of the universe, there existed ancient inheritances.<br/><br/>Yang Jun and Yang Lin’er slept until eleven before they got up one after another.<br/><br/>The first to leave the bedroom was Yang Lin’er, who was very nervous and shy when alone with Fang Wang.<br/><br/>Fang Wang could easily see through her thoughts, so he teased, “Why do you seem shyer than last night? You couldn’t have really fallen for me like your brother said, could you? Don’t be like that, I already have women, and not just one.”<br/><br/>Upon hearing this, Yang Lin’er glared at him and huffed, “How could I? You’re so full of yourself!”<br/><br/>Despite her words, disappointment flashed in her eyes.<br/><br/>Afterward, Fang Wang started chatting with her about the latest news, asking her opinion on the mysterious creatures of the Pacific Ocean and whether dragons truly existed in the world.<br/><br/>Yang Lin’er also found these topics fascinating, and the two of them quickly engaged in conversation.<br/><br/>Come noon, Fang Wang took the two downstairs for lunch before they parted ways.<br/><br/>In the days that followed, Fang Wang spent his days researching integration and his nights exploring the universe, while Yang Jun and Yang Lin’er busied themselves with their affairs, staying in touch over the phone.<br/><br/>In the blink of an eye.<br/><br/>Half a year had passed.<br/><br/>Finally, Fang Wang’s Primordial Spirit made a discovery in the vast cosmos.\t\t\t\t\t\t</div>", "images": {}, "success": true}