{"id": 363, "url": "https://www.novelhall.com/i-became-an-immortal-on-mortal-realm-32879/14910411.html", "title": "Chapter 353 - Chapter 353: Chapter 350: Insight Into The Mortal Realm, Integrating Secret Techniques", "volume": 4, "volume_title": "Volume 4", "body": "<h1>Chapter 353 - Chapter 353: Chapter 350: Insight Into The Mortal Realm, Integrating Secret Techniques</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 353: Chapter 350: Insight into the Mortal Realm, Integrating Secret Techniques<br/><br/>Fang Wang strolled with Yang Jun and Yang Lin’er until evening, eventually finding an opportunity to bid farewell.<br/><br/>Before parting, Yang Jun and Yang Lin’er took a photo with Fang Wang. They had brought a camera themselves; this was the second photo, the first being one with Fang Wang in white. In both photos, the siblings stood on either side of him.<br/><br/>Standing by the traffic light, Fang Wang was dressed in a loose white T-shirt and brown shorts, his long hair tied back with a rubber band that belonged to Yang Lin’er.<br/><br/>Xiao Zi still lay motionless on his shoulder.<br/><br/>Fang Wang waved to Yang Jun and Yang Lin’er across the street, and the siblings turned and walked away.<br/><br/>Glancing back, Yang Lin’er felt a strong sense of loneliness emanating from Fang Wang amidst the bustling night street, as if he could be overwhelmed by the crowd at any moment.<br/><br/>“Do you think he’ll be okay alone? He’s not going to jump off a building again, is he?” Yang Lin’er asked with concern.<br/><br/>Even though she’d only met Fang Wang that afternoon, she’d taken a liking to him. She thought he was a peer by age, yet he possessed a maturity and eloquence that exceeded his years, which could easily endear him to any young girl.<br/><br/>Yang Jun waved his hand, “He probably didn’t really want to jump. Throughout the afternoon, he seemed to be in good spirits, even optimistic. Maybe we misunderstood him. Besides, he’s mentioned splitting up several times; it wouldn’t be right to insist on staying together. And we don’t really have that much money to keep helping him.”<br/><br/>“Hehe, believe it or not, he’s going to be a big star. With his looks, those talent scouts walking on the street would definitely notice him. By then, the two photos we have will be worth a lot.”<br/><br/>Upon hearing this, Yang Lin’er felt it made sense, and the siblings began discussing what kind of superstar Fang Wang would become.<br/><br/>After watching them leave, Fang Wang turned and walked along the side of the road.<br/><br/>“Master, what is ‘playing a role’?” Xiao Zi curiously asked using the Sound Transmission Technique.<br/><br/>“It means to pretend to be a character from a story.”<br/><br/>“Oh oh, that’s what Gu Tianxiong likes, doesn’t he? He enjoys having courtesans dress up as princesses, holy maidens of the church, nuns…”<br/><br/>“Talk less with him; be careful not to pick up bad habits.”<br/><br/>The master and servant chatted using the Sound Transmission Technique, their figures gradually disappearing into the crowds beneath the neon lights.<br/><br/>The next morning, Fang Wang traveled a thousand kilometers to his homeland from a previous life.<br/><br/>He saw his parents but did not come across his younger self.<br/><br/>To be precise, on this Earth, his parents had another child, not him.<br/><br/>At that moment, Fang Wang realized the Earth of his past life was not the same as this one, and somehow, he felt a sense of relief wash over him.<br/><br/>Afterward, Fang Wang went to get various documents sorted out. Using some illusions, the process went smoothly and efficiently without any hindrance.<br/><br/>He now had a formal identity on this Earth and could start experiencing mundane life for himself.<br/><br/>Later, he took a Jade Pendant out of the Dragon Jade Ring and sold it at a local jade shop, and after several days, he had a large sum of money.<br/><br/>One evening, Fang Wang brushed past his father. Seizing the moment, he cast an illusion, taking his father to the bank and transferring a sum of money to him, making his father believe he had won the lottery. His father was reluctant to tell his mother, holding back for a few days until the money was securely in the account before he dared to share the news.<br/><br/>To avoid any mishaps, Fang Wang also cast an illusion on his mother, allowing her to accept this memory.<br/><br/>In this era, the monitoring of financial transactions was not as strict. Should anything arise later on, Fang Wang was prepared to intervene again.<br/><br/>After completing all this, Fang Wang quietly left and returned to the city where he had first arrived in this world.<br/><br/>East Sea City.<br/><br/>Over the next year, he began to enjoy the life of a modern person, turning to sell gold and jade wares whenever he was short on money. The Dragon Jade Ring contained countless such items.<br/><br/>After a year, Fang Wang had fully integrated himself into modern life. Unable to bear the loneliness, Xiao Zi wanted to go out and play. After Fang Wang set some ground rules, he let it go.<br/><br/>Anyway, no one could harm Xiao Zi here; even the strongest weapon on Earth would be useless, let alone with him still around.<br/><br/>One evening, Fang Wang went to the restaurant where he often ate, the place where Yang Jun and Yang Lin’er had once treated him to a meal. He thought it was pretty good, so he rented a room nearby.<br/><br/>He could sense the presence of Yang Jun and Yang Lin’er, but he didn’t actively seek them out. He believed in letting things take their natural course.<br/><br/>Fang Wang sat at his table, watching the news on the restaurant TV, and began to think about his future cultivation.<br/><br/>He decided to stay here for decades, taking the opportunity to merge his various Divine Skills and spells.<br/><br/>The first thing he wanted to merge were the Lingxiao Divine Sect and the Jiu You Freedom Technique!<br/><br/>“On March 21, a mysterious giant marine animal was discovered in the southern region of the Pacific Ocean. According to eyewitnesses, it was a creature larger than a blue whale, suspected to be the dragon from Xia Country’s ancient myths. However, the footage captured by the eyewitnesses is very blurry and cannot be verified. This event has caused a stir worldwide, drawing people from various countries to pursue it…”<br/><br/>Fang Wang’s lips curled into a smile, knowing without a guess that it was Xiao Zi.<br/><br/>The fellow really couldn’t sit still, always causing trouble despite numerous warnings.<br/><br/>While waiting for his food, Fang Wang turned his gaze to the street outside the window, where people came and went. The inhabitants of the city seemed different yet identical at the same time.<br/><br/>Such is the nature of the multitude of beings in different realms; most mortals lead similar lives, all struggling for survival.<br/><br/>If Fang Wang were to achieve immortality in the Mortal Realm in the future, what could he do for the Mortal Realm?<br/><br/>Fang Wang’s thoughts scattered.<br/><br/>In the following days, Fang Wang spent his daylight hours studying the integration of his arts, and at night he would come down to this restaurant, pondering his Path of Immortality while watching the busy modern people.<br/><br/>In the blink of an eye, another three years had passed.<br/><br/>Fang Wang’s cultivation level had continued to grow, albeit slowly, due to the weak Spiritual Energy on Earth.<br/><br/>The integration of the Lingxiao Divine Sect and the Jiu You Freedom Technique, however, had seen no progress.<br/><br/>These two secret techniques were not like cultivation techniques, which could be pieced together and integrated like the mental methods of the Heavenly Palace. He needed to find the common ground between them.<br/><br/>That evening, Fang Wang had come to the restaurant for dinner again. The owner greeted him and didn’t hand him a menu, instead instructing the chef to serve the dishes directly.<br/><br/>Four years had made Fang Wang and the restaurant owner friends.<br/><br/>Fang Wang poured himself a glass of water and began to watch the TV news while waiting for his meal.<br/><br/>A few minutes later, the dishes were all served, and he had just taken the first bite when he suddenly looked up to see two figures pushing the door and walking into the hall of the restaurant.<br/><br/>“No way, I’m not going to cover for you with Mom and Dad, and I don’t agree to it either!”<br/><br/>The speaker was a short-haired girl, with jet-black and radiant hair, and a tall and graceful figure.<br/><br/>It was Yang Lin’er.<br/><br/>Along with Yang Lin’er was Yang Jun. Four years had changed their appearances; Yang Jun had also changed to a buzz cut, looking more mature.<br/><br/>At that moment, Yang Jun looked agitated. He didn’t want to continue the conversation with Yang Lin’er, and his gaze unintentionally swept across the hall. Very quickly, his eyes fell on a table in the corner.<br/><br/>“Fang Wang!”<br/><br/>Yang Jun called out excitedly and quickly made his way to Fang Wang’s table.<br/><br/>With a chuckle, Fang Wang asked, “You still recognize me, huh?”<br/><br/>Yang Jun sat down across from Fang Wang, sizing him up in surprise, “You haven’t changed at all in four years, and you’re still wearing the clothes I gave you. I recognized you at a glance!”\t\t\t\t\t\t</div>", "images": {}, "success": true}