{"id": 365, "url": "https://www.novelhall.com/i-became-an-immortal-on-mortal-realm-32879/14911653.html", "title": "Chapter 355 - Chapter 355: Chapter 352: South Heavenly Gate, Xuandu The Book Of Changes Great Perfection", "volume": 4, "volume_title": "Volume 4", "body": "<h1>Chapter 355 - Chapter 355: Chapter 352: South Heavenly Gate, Xuandu The Book Of Changes Great Perfection</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 355: Chapter 352: South Heavenly Gate, Xuandu The Book of Changes Great Perfection<br/><br/>In the depths of the cosmos, amidst floating, spectacular nebulae, the largest of them resembled an outstretched arm, palm facing upward, the surrounding stars minuscule like dust in front of it.<br/><br/>Fang Wang’s Primordial Spirit arrived below the nebula at a piece of broken land, this land drifting through cosmic space without its own direction, like a fallen leaf.<br/><br/>Atop the broken land was a mountain, barren and desolate without plants or water.<br/><br/>An ancient stela stood midway up the mountain, Fang Wang’s Primordial Spirit descended and saw three red characters carved upon it.<br/><br/>South Heavenly Gate!<br/><br/>Could this be the South Heavenly Gate from Huaxia mythology?<br/><br/>Curiosity filled Fang Wang’s heart, and his Primordial Spirit sent out its divine consciousness, seeking to uncover if there were mysteries hidden within the stela.<br/><br/>Boom!<br/><br/>Fang Wang suddenly felt the obstruction of a seal, which exhilarated him, and he immediately forcefully attempted a breakthrough.<br/><br/>The restriction within the South Heavenly Gate stela was strong, only breakable by those who had reached the Celestial Qiankun Realm. Although Fang Wang was only in the Sky-Stepping Realm, his divine consciousness had already surpassed that of an ordinary Celestial Qiankun Great Cultivator, so he broke through with ease.<br/><br/>Immediately afterward, an enormous flood of memories surged into Fang Wang’s mind.<br/><br/>After a long while.<br/><br/>Fang Wang’s Primordial Spirit opened its eyes, eyes that were filled with surprise and joy.<br/><br/>It was actually a cultivation technique!<br/><br/>From the information he received, this technique was extremely profound. However, the information was overly complex and lacked a stable sequence, meaning Fang Wang had to sort it out just as he had done with his practice of the Heavenly Gang Saint Body Technique.<br/><br/>He immediately began to act.<br/><br/>The integration of the Lingxiao Divine Sect and the Jiu You Freedom Technique had been at a standstill; he could now start with the new technique, at least to make some progress.<br/><br/>Thus, Fang Wang’s Primordial Spirit hovered motionless in front of the stela.<br/><br/>Day after day.<br/><br/>A full month later.<br/><br/>Fang Wang finally found the familiar sensation; his consciousness had entered the Heavenly Palace.<br/><br/>This was also the first time he had entered the Heavenly Palace in the state of a Primordial Spirit!<br/><br/>Fang Wang began to cultivate this technique, named Xuandu The Book of Changes, not just a simple cultivation method but also an entire set of spells, involving mysticism, divination, fate, and magic; he was prepared for a long period of secluded cultivation.<br/><br/>By the time he cultivated the Xuandu The Book of Changes to a minor degree of proficiency, five hundred years had passed.<br/><br/>Not bad!<br/><br/>Fang Wang continued to maintain interest in the Xuandu The Book of Changes and continued to cultivate.<br/><br/>He discovered that each time he practiced the Xuandu The Book of Changes, the technique would generate more fortuitous transformations, a technique that was changing.<br/><br/>From minor completion to great completion, it was like changing to an entirely new technique; Fang Wang spent a whole twelve thousand years!<br/><br/>His scalp began to tingle, and it was getting tough to endure.<br/><br/>After reaching great completion, the Xuandu The Book of Changes erupted with even more magical arts; just the variety of minor spells exceeded a thousand, and its inner strength manifested a special characteristic.<br/><br/>The Xuandu The Book of Changes could absorb others’ strength, transforming it into one’s own power!<br/><br/>The most challenging time had come, which was to cultivate from the realm of great completion to the realm of Great Perfection!<br/><br/>What followed were long, tedious years of agonizing perseverance, and Fang Wang could only grit his teeth and endure.<br/><br/>By the time he completely cultivated the Xuandu The Book of Changes to the Great Perfection Realm, he looked back and realized that it had taken a total of eighteen thousand years; he was even too lazy to count the minor details.<br/><br/>Fang Wang followed the dizzying sensation and his consciousness returned to reality.<br/><br/>He was still floating in front of the stone tablet at the Southern Heavenly Gate, maintaining his Primordial Spirit state.<br/><br/>Fang Wang immediately retracted his Primordial Spirit. After a secluded meditation of eighteen thousand years, he had to indulge himself!<br/><br/>The process of retracting his Primordial Spirit was extremely fast, just as he returned to his body, it was nearly noon—twelve o’clock. He immediately got up from in front of the floor-to-ceiling window and then left his home.<br/><br/>It was the same restaurant he frequented, where the owner asked why he hadn’t come in for a while. Fang Wang made up an excuse on the fly.<br/><br/>He walked to his usual corner table, took out his phone, and waited for his meal to arrive.<br/><br/>In the span of a month, he had missed many calls, most of which were advertisements. His social media apps were flooded with messages.<br/><br/>Fang Wang saw that the most messages were from Yang Lin’er, who initially greeted him casually. Later, her messages were full of anxiety and, eventually, worry that something had happened to him, which made him both laugh and cry.<br/><br/>Fang Wang intended to reply, but suddenly felt something and put his phone aside.<br/><br/>He began to enjoy the view out the window, which faced the street—his favorite spot.<br/><br/>Before long, Yang Lin’er walked by outside. As she glanced into the restaurant and caught sight of Fang Wang, her face lit up with surprise. Then, she glared at him, a huffy expression on her face, which, Fang Wang had to admit, was rather cute.<br/><br/>Fang Wang waved and greeted Yang Lin’er with a smile. This enraged her even more, and she briskly walked into the restaurant, coming straight to Fang Wang. With her hands on her hips, she glared at him and asked, “Why didn’t you reply to my messages? I thought you…”<br/><br/>Fang Wang cocked his head, looking at her, and asked with a smile, “What? You thought I was dead?”<br/><br/>Seeing his smiling face, Yang Lin’er didn’t know why she felt that he deserved a beating, but her anger dissipated by half.<br/><br/>She immediately sat across from Fang Wang, tossed her bag aside, and looked at him intently, asking, “Do you really dislike me that much?”<br/><br/>Fang Wang just finished his meditation of eighteen thousand years and was feeling stifled. He was just about to look for someone to talk to. In a serious tone, he said, “I don’t dislike you. I ran into some trouble. You might not believe it, but I was trapped somewhere for a whole eighteen thousand years!”<br/><br/>Yang Lin’er was taken aback upon hearing this.<br/><br/>“Eighteen thousand years! Do you know what I went through?” Fang Wang sighed, his face showing a look of despair.<br/><br/>Unable to help herself, Yang Lin’er rolled her eyes and said in annoyance, “You can live eighteen thousand years? Why don’t you say you’re an immortal? Have you been reading web novels lately? Cut down on them; they’re addictive. A lot of people at our company are hooked, they don’t even have the energy to work anymore.”<br/><br/>It was now 2016, and the development of online entertainment was booming.<br/><br/>Fang Wang shrugged and said, “To tell you the truth, I’m a Cultivator. I can live forever. If you like me, I can’t accompany you till old age.”<br/><br/>Yang Lin’er snorted. “Then let me be honest with you too. I am the reincarnated Nine Heavens Mysterious Lady. Scared now?”<br/><br/>Fang Wang couldn’t help laughing and asked, “May I inquire where my fellow Daoist cultivates?”<br/><br/>“That I cannot tell you.”<br/><br/>As the two of them chatted, they couldn’t help but exchange smiles.<br/><br/>Yang Lin’er thought Fang Wang was weird and nonsensical, but she was inexplicably fascinated by the energy he exuded.<br/><br/>Fang Wang, on the other hand, mused that no one believed the truth these days.<br/><br/>He was also pondering something else, whether he should engage in a romance to relax.<br/><br/>A relationship of four or five years, then a breakup. Maybe then he would become a thing of the past in Yang Lin’er’s heart.<br/><br/>Fang Wang practiced the Formless Zhou Tian Technique, leaving no karmic traces, so he wasn’t worried about bringing misfortune to Yang Lin’er. Moreover, this Mortal Realm had become desolate with no powerful beings around. It was possible that the Celestial Court of the Upper Realm had forgotten about its existence.<br/><br/>That day, Fang Wang spent the rest of the day out with Yang Lin’er until nine in the evening, when he took her to the subway station.<br/><br/>The subway had arrived and was slowing down. Just before parting, Yang Lin’er stood in front of Fang Wang and humphed, “The Nine Heavens Mysterious Lady has work tomorrow. I’m still in a probationary period and can’t slack off. You better not forget to reply to my messages again.”<br/><br/>Fang Wang shook his head and said, “I can’t promise that. But don’t worry. If I don’t reply to you, it doesn’t mean I’m dead at home, it means I’m in the midst of meditative seclusion.”<br/><br/>Yang Lin’er gave him a glance and stepped into the subway car.\t\t\t\t\t\t</div>", "images": {}, "success": true}