{"id": 367, "url": "https://www.novelhall.com/i-became-an-immortal-on-mortal-realm-32879/14912910.html", "title": "Chapter 357 - Chapter 357: Chapter 354: Integration Into The Mortal Realm, Xuandu Great Saint", "volume": 4, "volume_title": "Volume 4", "body": "<h1>Chapter 357 - Chapter 357: Chapter 354: Integration Into The Mortal Realm, Xuandu Great Saint</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 357: Chapter 354: Integration into the Mortal Realm, Xuandu Great Saint<br/><br/>Inside the Fang Residence’s Illusionary Realm.<br/><br/>Zhou Xue approached Fang Wang, and her first sentence made him unable to cope, “What’s the matter? Changed your taste? Starting to fancy mortal girls?”<br/><br/>Fang Wang feigned surprise and asked, “What do you mean? What are you talking about!”<br/><br/>Zhou Xue stared straight at him and said, “Your Qi Gathering speed has been very slow in recent years, you probably haven’t cultivated much. Other than women, I can’t think of another reason.”<br/><br/>Fang Wang coughed artificially and said, “I have been contemplating integrating Cultivation Techniques, and the Spiritual Energy in the Mortal Realm I am in is sparse.”<br/><br/>“Is that so?”<br/><br/>“Alright, there is indeed such a woman, but I haven’t accepted.”<br/><br/>“Oh? Just like with Gu Li and Hong Xian’er, not rejecting, not taking the initiative, not accepting?”<br/><br/>“I have rejected! I have rejected them all, at most you can say I am too gentle, I can’t be harsh with my words,” Fang Wang said seriously.<br/><br/>Zhou Xue looked deeply at him and teased, “Actually, you don’t need to reject. If they are all sincere, then you should accept them. Sometimes feelings can be the strongest connections, though, of course, they can also lead you into an abyss.”<br/><br/>“You don’t have to wait for me like this, my cultivation won’t let me obsess over romantic feelings, at least for now we can’t be like other cultivating couples,” Zhou Xue said gravely.<br/><br/>Fang Wang touched his nose and cursed inwardly, making it seem like he was in a rush.<br/><br/>Well, actually, he was a bit anxious.<br/><br/>Zhou Xue said meaningfully, “If you can leave descendants in different Mortal Realms, it will be greatly beneficial to you in the future.”<br/><br/>Fang Wang changed the subject, “I know my own limits. Let’s talk about the current situation in the world, shall we?”<br/><br/>It must be said that the thought processes of women in the world of cultivation are indeed different.<br/><br/>Perhaps, in Zhou Xue’s eyes, she cares more about Fang Wang the person than Fang Wang the man.<br/><br/>Zhou Xue began to introduce the current state of the world; after the end of the Ascension Stairway, the barriers between the Western and Eastern Mortal Realms began to dissipate, and more and more cultivators and demons from the Western Mortal Realm broke into the Eastern Mortal Realm, making the entire Mortal Realm buzz with excitement and a surge of emerging figures.<br/><br/>The Western Mortal Realm was full of geniuses, and their cultivators at the same level were stronger than those from the Eastern Mortal Realm, which led to their unbridled arrogance. Although Fang Wang had disappeared for decades, he had become a pillar of the Eastern Mortal Realm. The number of people and demons touting his legend increased, causing him to be continually deified.<br/><br/>“The Mortal Realm where we were born is at the top tier of countless realms. Do not stay in other realms too long and become complacent. You should have begun to feel this by now,” Zhou Xue reminded him.<br/><br/>Fang Wang nodded involuntarily; having traveled through so many Mortal Realms, where most were weak, it gave him the illusion that he was an Immortal Divine descending to Earth.<br/><br/>“Don’t worry, I won’t become complacent. Moreover, I’ve discovered that other realms might seem desolate, but they also contain opportunities,” Fang Wang replied and then brought up the Xuandu The Book of Changes.<br/><br/>Zhou Xue’s expression changed when she heard this name.<br/><br/>Fang Wang raised an eyebrow and asked, “You know of this legendary technique?”<br/><br/>Zhou Xue’s eyes flickered subtly as she said, “Of course I know. This Cultivation Technique has a legendary reputation in The Upper Realm. Its creator, the Xuandu Great Saint, is still alive and has established his own path in The Upper Realm, not subjected to the coercion of major powers, making him one of the few Great Saints to have a good ending.”<br/><br/>Thinking about the desolation of that realm, Fang Wang speculated and laughed, “Interested in learning it? I could teach you.”<br/><br/>“No need to trouble yourself, I’ve learned it before, just not proficient in it,” Zhou Xue shook her head and replied.<br/><br/>“This technique is indeed powerful. In The Upper Realm, anyone who can practice it to Great Completion can dominate a territory,” she said.<br/><br/>Hearing this, Fang Wang really wanted to ask if practicing it to Great Perfection would be considered an extraordinary level.<br/><br/>But after some thought, he decided against it; there might not even be a definition for Great Perfection.<br/><br/>And keeping a few tricks up one’s sleeve is a good thing.<br/><br/>Zhou Xue was very interested in the Mortal Realm where the Xuandu Great Saint came from and began to inquire about the specific situation of this Mortal Realm.<br/><br/>Fang Wang started to introduce Earth, and Zhou Xue listened with great interest.<br/><br/>Learning that Earth did not have methods of Cultivation, yet mortals could fly and burrow into the ground, even transmit messages over thousands of miles—all these things piqued Zhou Xue’s curiosity.<br/><br/>After talking for a long time, right before parting, Zhou Xue asked Fang Wang to bring her some technological products before he left, to which Fang Wang readily agreed.<br/><br/>When he retrieved his divine consciousness, it was already five in the afternoon.<br/><br/>He walked out of the bedroom and into the living room, where he saw Yang Lin’er asleep on the couch, curled up like a little cat.<br/><br/>Fang Wang stood behind the couch, looking down at her, just quietly watching, without bending over to stroke her.<br/><br/>It wasn’t until dusk fell and the afterglow shone through the windows that Yang Lin’er’s eyelashes began to tremble, and she sleepily opened her eyes to meet Fang Wang’s gaze.<br/><br/>“What time is it?”<br/><br/>Yang Lin’er quickly got up, rubbed her eyes, and asked.<br/><br/>Fang Wang replied, “It’s almost seven, are you hungry?”<br/><br/>Yang Lin’er nodded, straightened her clothes, and told Fang Wang she was going to the restroom.<br/><br/>By eight in the evening, they had already arrived at the dining room, still sitting by the window, enjoying the night view of East Sea City.<br/><br/>Yang Lin’er brought up Yang Jun, who had gone abroad. Although she was criticizing him, her words were full of worry.<br/><br/>Fang Wang asked with a smile, “He’s pursuing his dream, what about you? What is your dream, what do you want to do?”<br/><br/>For most mortals, dreams are unattainable and dissipate with settling down into family life.<br/><br/>Yang Lin’er propped her chin with one hand and stirred the straw in front of her with the other, pondering, “Actually, I don’t have big dreams, so I don’t understand my brother. If I really have to say, my dream would be to stand out, to establish my own career without relying on my parents, but on my own hands.”<br/><br/>She began to share her inner thoughts, and Fang Wang listened attentively to her life experiences. Although he didn’t understand her profession, he could at least tell that even without dreams, she was very serious about learning and working.<br/><br/>Through her words, Fang Wang also reflected on his own pursuits.<br/><br/>Cultivation seeks eternal life, which is overly vague. What specific path to take and how to achieve immortality are more crucial.<br/><br/>Zhou Xue had said in the afternoon that if he could leave offspring in every Mortal Realm, it would be helpful to him later on, which made him think of the various bloodline techniques.<br/><br/>Perhaps Zhou Xue meant that if he died, he could be resurrected through his bloodline.<br/><br/>That was not the destiny Fang Wang wanted. As for prospering through offspring to repay oneself, that he valued even less.<br/><br/>He didn’t even want to have children. Having children meant having attachments, and he didn’t want any attachments for the time being.<br/><br/>However, this conversation served as a reminder to him.<br/><br/>Fang Wang thought of his Heavenly Dao Immensity Scripture; he enjoyed spreading his Cultivation Technique, so why not put more effort into the scripture itself?<br/><br/>Soon, the meal arrived, and Fang Wang and Yang Lin’er continued to chat. The atmosphere was very pleasant, at least Yang Lin’er thought so, feeling she had grown closer to Fang Wang.<br/><br/>That night, Yang Lin’er stayed at Fang Wang’s house. With plenty of rooms in his house, it was easy to accommodate her.<br/><br/>That night, Yang Lin’er tossed and turned, unable to sleep.<br/><br/>Fang Wang, on the other hand, delved into pondering the Dao.<br/><br/>Sometimes, observing the lives and thoughts of mortals could also inspire a Cultivator’s practice, which was another reason he enjoyed talking with Yang Lin’er.\t\t\t\t\t\t</div>", "images": {}, "success": true}