{"id": 369, "url": "https://www.novelhall.com/i-became-an-immortal-on-mortal-realm-32879/14913876.html", "title": "Chapter 359 - Chapter 359: Chapter 356: Heavenly Dao Infinite Book Of Changes Great Perfection", "volume": 4, "volume_title": "Volume 4", "body": "<h1>Chapter 359 - Chapter 359: Chapter 356: Heavenly Dao Infinite Book Of Changes Great Perfection</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 359: Chapter 356: Heavenly Dao Infinite Book of Changes Great Perfection<br/><br/>Xiao Zi wanted to say more, but Fang Wang sensed something and waved his hand, “They’re coming, you should find a room to hide in.”<br/><br/>Upon hearing this, Xiao Zi slipped away immediately.<br/><br/>Ten minutes later, the door opened, and Yang Lin’er and Yang Jun walked in.<br/><br/>It had been a week since Yang Jun was rescued by Xiao Zi. He had been scared out of his wits, fleeing back to his home country overnight, resting for three days before he dared to venture outside again.<br/><br/>“Brother Wang.”<br/><br/>Yang Jun raised his hand and greeted Fang Wang with a forced smile.<br/><br/>Fang Wang stood up to welcome them and casually took the takeout from Yang Lin’er’s hands.<br/><br/>“What’s wrong? You don’t look so good,” Fang Wang asked with feigned concern. At the moment, Yang Jun’s face was deathly pale as if he had been through a serious illness.<br/><br/>Yang Lin’er complained, “Don’t even mention it, this guy came back and wouldn’t say anything, nor would he go home. This afternoon he called and insisted on coming to see you.”<br/><br/>Yang Jun looked at Fang Wang, struggling to speak.<br/><br/>Fang Wang placed the bag on the dining table, then led them to sit down on the living room sofa.<br/><br/>No sooner had they sat down than Yang Jun couldn’t help but ask, “Brother Wang, the doll you had with you when we first met, do you still have it?”<br/><br/>These past few days, the image of Xiao Zi had been replaying in his mind, and the more he thought about it, the more familiar it seemed until he suddenly thought of Fang Wang.<br/><br/>The doll on Fang Wang’s shoulder back then also seemed to be a purple dragon, which he remembered as being so lifelike that it made a strong impression on him.<br/><br/>Fang Wang replied, “I lost it a long time ago, why do you ask?”<br/><br/>Yang Lin’er added a sentence, “Indeed, I haven’t seen that doll in these past years.”<br/><br/>Yang Jun stared intently at Fang Wang, demanding to know, “Where exactly did this doll come from? Where did you throw it?”<br/><br/>Faking deep thought, Fang Wang said, “Actually, I bought it at a roadside stall, and later I found a note inside, which had ‘Dragon God Sect’ written on it, along with a phrase, ‘Believe in the merciful and boundlessly compassionate Great Dragon God to attain immortality.’ As soon as I saw it, I thought there was something wrong with the ideology, so I tossed it. Where it is now, I have no idea.”<br/><br/>Dragon God Sect!<br/><br/>The merciful and boundlessly compassionate Great Dragon God?<br/><br/>Yang Jun suddenly became excited. He believed that the purple creature was indeed a dragon, and now it seemed that the Dragon God truly existed and already had a group of followers.<br/><br/>He felt as though he had stepped into another world and thought that this was the first time he truly understood this world.<br/><br/>He had always thought, how could there not be supernatural beings in reality?<br/><br/>Seeing Yang Jun’s excitement turn his face red and his body tremble, Yang Lin’er couldn’t help but frown.<br/><br/>One Fang Wang was already a headache for her, and now her brother was also going astray?<br/><br/>Just as Yang Lin’er was about to lecture him, she heard Yang Jun say excitedly, “Brother Wang! No, brother-in-law! Do you believe in the existence of dragons?”<br/><br/>He began to recount his experience from a week ago. Yang Lin’er initially didn’t believe him, but as he spoke so earnestly, she couldn’t help but hesitate.<br/><br/>To prove his point, Yang Jun rolled up his sleeves to reveal multiple wounds, which pained Yang Lin’er to see.<br/><br/>Could dragons really exist in the world?<br/><br/>Yang Lin’er fell into confusion, involuntarily looking toward Fang Wang, who must have been thrilled, she thought.<br/><br/>To her surprise, she found Fang Wang still very calm.<br/><br/>“I think you need some time to cool off, then talk with your companions from that time. That’s the only way to be sure, isn’t it?” Fang Wang said, staring at Yang Jun. For some reason, Yang Jun’s restless heart calmed down instantly.<br/><br/>Yes.<br/><br/>Why hadn’t he talked with the others who were there at the time?<br/><br/>Fang Wang then changed the subject, inquiring about Yang Jun’s next steps. Yang Lin’er wanted to send him back to his hometown and forbid him from going abroad again. This time, Yang Jun didn’t refute immediately because he indeed was afraid.<br/><br/>Facing that ferocious python was far more terrifying than any battlefield he had ever been on.<br/><br/>That night, Yang Jun stayed at Fang Wang’s place. Early the next morning, he left on his own.<br/><br/>Yang Lin’er accompanied Fang Wang.<br/><br/>The two sat on the sofa, watching the news on TV. Yang Lin’er had not slept well last night, her thoughts drifting between her colleague Chen Glasses’s theories of the apocalypse and the ordeal of Yang Jun.<br/><br/>“Do you really believe there’s such a thing as the end of the world? If it’s true, does everything I’m pursuing now become meaningless?” Yang Lin’er asked, hugging Fang Wang’s arm and resting her head on his shoulder.<br/><br/>Fang Wang replied, “Living in itself doesn’t need to chase after meaning, after all, we are all walking towards death. Even if there really is the end of the world, it’s not something you’ll be facing alone, so what’s there to fear?”<br/><br/>Upon hearing this, Yang Lin’er felt sweet inside; it was rare to hear Fang Wang express himself like this.<br/><br/>Little did she know, Fang Wang was just responding offhand, as his mind was on the issue of integrating cultivation techniques.<br/><br/>It wasn’t until the afternoon that Yang Lin’er left, as she had to work the next day.<br/><br/>The matter regarding Yang Jun was just an interlude for Fang Wang, who resumed his study of cultivation techniques.<br/><br/>…<br/><br/>Four years later, the calendar turned to 2022.<br/><br/>That day, the city was enveloped in a gloomy drizzle.<br/><br/>Fang Wang, meditating in front of the floor-to-ceiling window, suddenly opened his eyes, then closed them again.<br/><br/>His consciousness entered the Heavenly Palace, observing the environment within. In that moment, his heart was very calm.<br/><br/>He had finally succeeded!<br/><br/>Both the Heavenly Dao Immensity Scripture and Xuandu The Book of Changes were exceedingly complex cultivation techniques, especially Xuandu The Book of Changes, which included many methods. Merging them was no simple feat.<br/><br/>Fang Wang felt that his own perception had drastically improved compared to before. What had once seemed complex was now simple in his eyes.<br/><br/>Perhaps it was the accumulation of many Great Perfection techniques that a person’s perception inevitably advanced with their grasp of knowledge.<br/><br/>Fang Wang did not dwell on it further, and began to cultivate the new technique.<br/><br/>With his mastery of the two great techniques, cultivating the new one was not difficult for him.<br/><br/>The initial practice was not hard, but Great Completion was the real challenge!<br/><br/>This new technique surpassed many methods of the Great Saints and Great Emperors, as its foundation was the technique of the Emperor Saint himself.<br/><br/>Years flew by rapidly.<br/><br/>In the blink of an eye, thousands of years had passed!<br/><br/>Fang Wang had practiced to the point of Great Completion, and even he himself marveled at his creation; this technique was simply incredible!<br/><br/>It would allow other cultivators, dedicating their entire lives to practicing just this technique, to sweep across the Mortal Realm!<br/><br/>However, even for the creator, perfecting this technique to the utmost level of the Great Perfection Realm would take a long stretch of time.<br/><br/>From Great Completion to Great Perfection was a process of creation and extrapolation, perfecting the technique to its limit.<br/><br/>Fang Wang became engrossed, his thoughts unable to break free.<br/><br/>When he had cultivated the new technique to Great Perfection, he looked back only to realize that 12,000 years had passed!<br/><br/>“It shall be called the Heavenly Dao Infinite Book of Changes,” he murmured to himself, deciding on the name for this technique. The Heavenly Palace then shattered, and his consciousness returned to reality.<br/><br/>He opened his eyes, and the rainy cityscape was what met his gaze.<br/><br/>It was as if the city were weeping.<br/><br/>The weather had been increasingly strange over the past two years, and this Earth’s development was becoming more and more different from the Earth of Fang Wang’s previous life.<br/><br/>Apart from Xiao Zi, there was a group of people on this Earth striving to change the world.<br/><br/>Fang Wang stood up, he leapt off of Earth and ventured beyond the solar system. He began to stimulate the Heavenly Dao Infinite Book of Changes, allowing his body to adapt to the brand-new technique.<br/><br/>But as soon as he started the exercises, he suddenly felt something and peered out, only to see a figure made of light standing in the depths of the universe, humanoid in shape but with an indistinct face.<br/><br/>“Cultivator from another Mortal Realm, what are you seeking?” A vast and indistinct voice came from the direction of the figure, its true appearance indiscernible.\t\t\t\t\t\t</div>", "images": {}, "success": true}