{"id": 366, "url": "https://www.novelhall.com/i-became-an-immortal-on-mortal-realm-32879/14911656.html", "title": "Chapter 356 - Chapter 356: Chapter 353 Pondering Destiny, Changing Life", "volume": 4, "volume_title": "Volume 4", "body": "<h1>Chapter 356 - Chapter 356: Chapter 353 Pondering Destiny, Changing Life</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 356: Chapter 353 Pondering Destiny, Changing Life<br/><br/>After seeing Yang Lin’er off, Fang Wang turned around and boarded a train carriage going in the opposite direction. He was ready to wander around and clear his mind.<br/><br/>Once he had relaxed, he planned to merge the Heavenly Dao Immensity Scripture with the Xuandu The Book of Changes to reach a new height in his Inner Strength.<br/><br/>In the blink of an eye, more than half a month had passed and the Lunar New Year arrived, leaving East Sea City considerably quieter.<br/><br/>That night, Fang Wang lay on his sofa at home, watching TV.<br/><br/>He realized that after spending a lot of time in modern society, one doesn’t need much time to unwind because there are too many entertainment options here. Just half a month had made him feel almost fully vented.<br/><br/>Hum—<br/><br/>Fang Wang’s phone vibrated once. He picked it up and, without needing to guess, knew it was a message from Yang Lin’er about how she was spending the festival at home.<br/><br/>Fang Wang could no longer remember how he used to celebrate the Lunar New Year. He vaguely remembered celebrating a similar festival at the Fang Residence, where the whole place would be adorned with lights and bustling with excitement.<br/><br/>He didn’t know whether his parents had already been reincarnated.<br/><br/>As he pondered, Fang Wang’s thoughts drifted. He thought about the cycle of reincarnation. The Xuandu The Book of Changes contained teachings on yin and yang, the soul, and reincarnation, which had given him a new understanding of the cycle.<br/><br/>He didn’t know how much time had passed when his phone rang again. He picked it up to see that it was a call from Yang Lin’er.<br/><br/>After answering, he brought the phone to his ear and said with a smile, “What’s up?”<br/><br/>“Fang Wang, happy new year! You haven’t talked about how your family celebrates the festival. Are you all by yourself in East Sea City?”<br/><br/>“Happy new year. What’s wrong with being alone? You can’t understand how awesome it is to be on your own,” Fang Wang replied, unable to resist bickering with Yang Lin’er.<br/><br/>With his current level of cultivation and status, there were many people who treated him with reverence and flattery. He liked it when people were genuine with him, of course, as long as it wasn’t negative.<br/><br/>Sure enough, Yang Lin’er wasn’t pleased when she heard him showing off, and the two began to banter. They talked for a full hour until Yang Lin’er’s mother urged her, and she reluctantly hung up the call.<br/><br/>Fang Wang put down his phone and continued watching TV.<br/><br/>A night passed.<br/><br/>The next morning at nine o’clock, while Fang Wang was still contemplating the Dao of reincarnation, the doorbell rang. He looked up, his expression changing.<br/><br/>He stood up and walked to the door, opening it to see Yang Lin’er standing there, looking quite adorable in front of the security door.<br/><br/>“Is it a surprise or a shock?”<br/><br/>Yang Lin’er said with a triumphant smile, her gaze inadvertently sweeping behind Fang Wang, as if she wanted to see if there was anyone else inside his home.<br/><br/>As Fang Wang opened the door, he asked, “You came over on the first day of the new year. Your family didn’t object?”<br/><br/>To be honest, such a scenario was not enough to move Fang Wang; he found it more amusing.<br/><br/>Yang Lin’er, carrying a variety of bags, stepped forward, and Fang Wang took them from her, inviting her inside.<br/><br/>“Yes, they thought I had a boyfriend. My dad called me several times last night. I drove overnight, traveling eight hundred kilometers to see you,” Yang Lin’er answered, her gaze traveling around the interior of the house.<br/><br/>Fang Wang followed behind her, observing her. It being winter, she was dressed in a white down jacket, wrapped in a scarf, wearing a woolen hat, and her ears were red from the cold.<br/><br/>He silently released a trace of Yang Energy, raising the temperature inside the room.<br/><br/>“Your place is quite warm, even though the air conditioning isn’t on,” Yang Lin’er remarked as she entered the living room, still searching for something with her eyes.<br/><br/>Fang Wang couldn’t help but laugh and said, “Go on and look around; all the rooms are open to you.”<br/><br/>Upon hearing this, Yang Lin’er immediately quickened her pace to explore.<br/><br/>Fang Wang, meanwhile, stayed where he was, calculating Yang Lin’er’s fate.<br/><br/>With his mastery of the Xuandu The Book of Changes, he was now capable of predicting a person’s destiny. As he made his calculations, he frowned slightly.<br/><br/>Five years later, Yang Lin’er’s father faced bankruptcy, plummeting the family into debt. Unable to endure the pressure, he eventually chose to leap from a building, leaving his wife to fall ill in bed. In order to take care of her mother, Yang Lin’er resigned from her job and returned to her hometown, where she worked to pay off the debts and cared for her mother. That same year, her younger brother Yang Jun also perished in Africa.<br/><br/>Ten years after that, Yang Lin’er was diagnosed with late-stage cancer. Following her mother’s death, she decided to take an overdose of sleeping pills to end her life.<br/><br/>She had never married, passing away at the age of thirty-three.<br/><br/>How tragic is that!<br/><br/>Fang Wang made the decision to change her life.<br/><br/>He had no principle of respecting others’ fate, nor did he entertain the notion that he shouldn’t intervene in this world. He did whatever he wanted to do.<br/><br/>Before long, Yang Lin’er returned, humming, “Not a single sign of a woman, didn’t you bring anyone home?”<br/><br/>Fang Wang shrugged, “Busy with training, no time to fool around with women.”<br/><br/>“Pah, what a storymaker.”<br/><br/>“How about training with me then?”<br/><br/>“Training?”<br/><br/>Yang Lin’er, seeing the smile on Fang Wang’s face, felt a jolt in her heart. Her face flushed red as her heart fluttered like a startled deer. Struggling to maintain her composure, she said, “Let’s do it!”<br/><br/>Half an hour later.<br/><br/>Yang Lin’er, seated on the sofa, turned her head to look at Fang Wang standing in front of the floor-to-ceiling window, and asked, “Does this breathing method really work? I can’t feel the ‘qi’ you talked about at all.”<br/><br/>What a dog of a man!<br/><br/>He actually got me to sit and cultivate!<br/><br/>Yang Lin’er was both angry and annoyed, regretting her nervousness.<br/><br/>Without turning, Fang Wang said, “The spiritual energy in this realm is weak, especially in the city. However, with the cultivation technique I taught you, if you practice diligently, you’ll succeed eventually.”<br/><br/>He was watching Xiao Zi.<br/><br/>At the moment, Xiao Zi was on the other side of Earth, enlightening demons and teaching some jungle animals the Qi Gathering technique.<br/><br/>What is this guy trying to do?<br/><br/>As Xiao Zi’s actions commenced, Fang Wang saw the destinies of billions of people on Earth start to change before his eyes, forming a complex web of countless fate lines, immersing him in the contemplation of life’s destinies.<br/><br/>After sitting for another half hour, Yang Lin’er couldn’t hold back anymore. She stood up and began to stretch her limbs.<br/><br/>She turned to look at Fang Wang by the window. His back was to her, hands naturally hanging by his sides, the sunlight streaming in from outside enveloping him; she couldn’t shake the feeling that Fang Wang might take off into the sky at any moment.<br/><br/>She couldn’t help but call out, “Fang Wang.”<br/><br/>“What is it?” Fang Wang turned and asked, his gaze meeting hers, jolting her back to reality.<br/><br/>She hurriedly found a topic to discuss, asking, “Where did you get this cultivation technique? Is it real or fake?”<br/><br/>Fang Wang asked with a smile, “If it’s fake, would you think I’m a madman?”<br/><br/>Yang Lin’er replied, “Of course, I don’t think you’re mad, but I’ve realized that I hardly know anything about you.”<br/><br/>Looking at her, Fang Wang said, “You should practice more when you have time. Actually, I lied to you; this technique only strengthens vitality, improves spirit and essence, and will help you work better. It’s best to practice for a while after work every day, make it a habit.”<br/><br/>The Heavenly Dao Immensity Scripture, despite the worst of environments, even without achieving full mastery, could enhance one’s body and potentially grant a long life of a hundred years through its Qi Gathering technique alone.<br/><br/>Upon hearing this, Yang Lin’er breathed a sigh of relief; this explanation she could believe.<br/><br/>At that moment, Fang Wang suddenly felt a wave of spiritual consciousness from the Jade Bracelet in his right hand; it was Zhou Xue’s. Thus, he dropped a message and headed toward his own bedroom, “I have something to do, need to make a call. You stay here for a while, make yourself at home.”<br/><br/>Before Yang Lin’er could respond, he quickly entered his bedroom, locked the door behind him, and then projected his spiritual consciousness into the Jade Bracelet.\t\t\t\t\t\t</div>", "images": {}, "success": true}