{"id": 368, "url": "https://www.novelhall.com/i-became-an-immortal-on-mortal-realm-32879/14912911.html", "title": "Chapter 358 - Chapter 358: Chapter 355: The Mysterious Organization, Strange Phenomena Of Heaven And Earth [Third Release, Request For Monthly Pass]", "volume": 4, "volume_title": "Volume 4", "body": "<h1>Chapter 358 - Chapter 358: Chapter 355: The Mysterious Organization, Strange Phenomena Of Heaven And Earth [Third Release, Request For Monthly Pass]</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 358: Chapter 355: The Mysterious Organization, Strange Phenomena of Heaven and Earth [Third Release, Request for Monthly Pass]<br/><br/>Time flies like an arrow.<br/><br/>In the blink of an eye, two years had passed, and it was now 2018.<br/><br/>During these two years, Fang Wang began to live a more reclusive life, only occasionally going out with Yang Lin’er; he mostly remained at home, merging the Heavenly Dao Immensity Scripture with Xuandu The Book of Changes.<br/><br/>Both Cultivation Techniques were so vast that even by piecing them together, a great deal of time was needed. Fang Wang, now far different from his former self and not just blindly piecing together, was also looking for patterns.<br/><br/>It was noon that day.<br/><br/>Sitting at her desk in a commercial building, Yang Lin’er gazed out of the window at the river, lost in thought.<br/><br/>At that moment, a woman dressed in office attire approached her with a folder in arms, nudged her shoulder with her elbow, and asked with a smile, “What are you thinking about? You’ve been distracted all day, is it because of your mysterious boyfriend again?”<br/><br/>Yang Lin’er snapped back to reality and sighed, “Yeah, that’s right. He stays cooped up at home all day; I can only manage to get him out once a month. He really doesn’t leave the house.”<br/><br/>The office-clad woman curiously inquired, “Doesn’t he have a job? Is he a rich second generation?”<br/><br/>“Not sure, though his house is big, it’s rented, and he never mentioned his parents,” replied Yang Lin’er helplessly.<br/><br/>She always felt that Fang Wang’s reclusiveness had something to do with the Cultivation Technique he practiced.<br/><br/>This guy couldn’t possibly have gone mad and really thinks he is a Cultivator, could he?<br/><br/>Scratching her chin, the woman in business attire began to speculate as well.<br/><br/>Just then, a voice came from Yang Lin’er’s desk:<br/><br/>“Recently, unusually large wild animals have been frequently appearing in South America. These animals keep breaking the size records of their species. Experts believe this may be connected to the ecological changes on Earth. Global warming is causing varied climates, along with industrialization…”<br/><br/>Unable to help herself, the office-clad woman gaped and exclaimed, “Chen Glasses, can’t you watch the news with headphones on?”<br/><br/>Sitting opposite her was an overweight young man, his suit stretched taut. He was currently hunched over, watching news on his phone propped up in a stand.<br/><br/>Chen Glasses pushed up his glasses and said with a serious face, “I seriously suspect that the end of the world is coming. I’ve been following this kind of news for two years now. It’s not just South America; there are reports of mutant animals in Africa, Australia, and all the major oceans. I advise you all to watch the news more often, keep a survival kit ready at home, and spend your salaries as they come, don’t save up!”<br/><br/>The woman in business attire snorted, “Then you might as well quit your job and get lost. Don’t even think about taking your bonus for this quarter; it’s all just worldly possessions anyway!”<br/><br/>Chen Glasses muttered something, but the office-clad woman didn’t catch it and asked him to repeat. The two began to argue.<br/><br/>Yang Lin’er, however, furrowed her brow. Her concerns now were not for Fang Wang but for her brother, Yang Jun.<br/><br/>Last month, Yang Jun had called her, saying he was working in South America, she didn’t know if it was related to these strange animals.<br/><br/>Meanwhile, on the other side of Earth.<br/><br/>In the damp jungle, an expedition team was running wildly. They were carrying packs and hauling cameras; all seven of them looked ragged, including Yang Jun.<br/><br/>Yang Jun’s hair was wet, whether from river water or sweat it was hard to say, as his entire face was drenched. He was full of terror as he ran, unable to resist looking back every now and then.<br/><br/>Behind them, the trees shook violently as if a colossal creature was charging through.<br/><br/>Yang Jun felt his heart in his throat and turned back to focus on escaping.<br/><br/>Suddenly, a man behind him fell to the ground, followed by a scream. When Yang Jun looked back again, the man had already disappeared from sight.<br/><br/>Nearly scared to death, his mind went blank, and he stumbled forward.<br/><br/>Running who knows how long, Yang Jun suddenly burst out of the woods onto a vast blue ocean sprawled before him, the beach shimmering with silver light. Ahead of him were five people, all running towards the shore, gesturing anxiously for him to hurry.<br/><br/>Yang Jun felt his lungs might burst. Lifting his leaden legs, he continued to run forward.<br/><br/>With a boom!<br/><br/>The sea behind his companions exploded. Yang Jun froze, his eyes widening at the unforgettable sight before him.<br/><br/>A Purple Dragon soared up from the depths of the sea, circling back and forth across the sky.<br/><br/>Dragon…<br/><br/>It was a real dragon!<br/><br/>With antlers like a deer, a camel-like head, rabbit-like eyes, a neck like a snake, a mirage-like belly, fish-like scales, eagle-like claws, tiger-like paws, and cow-like ears!<br/><br/>Just like the dragons described in the myths!<br/><br/>Under the sunlight, the dragon scales on the Purple Dragon refracted an unusual radiance, and the sight of the dragon suspended in the azure firmament deeply shook him.<br/><br/>It wasn’t just him, the other five adventurers were equally dumbstruck.<br/><br/>This Purple Dragon was indeed Xiao Zi!<br/><br/>Xiao Zi looked down at Yang Jun and thought to herself, “It’s indeed this kid. You’re lucky; had it not been for the young master taking a liking to you, this princess wouldn’t bother with you today!”<br/><br/>Before Yang Jun could think further, he suddenly heard a commotion behind him. Instinctively turning his head to look, he slumped onto the sandy ground.<br/><br/>He saw a massive reticulated python squeezing out from the forest, thicker than the surrounding trees, with its body raised over three meters high, flicking its tongue, with blood and flesh still clinging to the edges of its mouth.<br/><br/>The reticulated python, gazing up at the high and mighty Xiao Zi, had a cold gleam in its eyes, blinking ominously.<br/><br/>Suddenly, Xiao Zi opened her mouth and spewed out sword Qi, instantly engulfing the reticulated python.<br/><br/>As flesh was flung about and sand and stones were cast into the air, Yang Jun was splattered with blood.<br/><br/>Before he could react, his camera suddenly burst with sparks, became hot and started to smoke, and not just his, but the cameras of his companions as well.<br/><br/>They were all ruined!<br/><br/>Yang Jun used his arms to shield his face, and when the disturbance from the sword Qi ceased, he lowered his arms, and cautiously looked forward, to see a pit before him, scattered with flesh, a ghastly sight.<br/><br/>He instinctively looked back but could no longer see Xiao Zi’s figure.<br/><br/>“This…”<br/><br/>Yang Jun had lost the ability to put his feelings into words; all of this made him feel as if he were in the midst of a dream.<br/><br/>…<br/><br/>Evening.<br/><br/>Fang Wang lay on the couch watching TV, with Xiao Zi lying on his lap, chattering to him.<br/><br/>“Someone is trying to create monsters?” Fang Wang asked.<br/><br/>Xiao Zi nodded and said, “The monsters I’ve nurtured are all well-behaved and never cause trouble, but I encountered a group of irrational beasts. Their spiritual intelligence seems undeveloped, yet they’re extremely bloodthirsty, and their numbers are increasing. If this continues, they might bring disaster to the Mortal Realm. Young master, should I intervene?”<br/><br/>Fang Wang calculated with his fingers and discovered that what Xiao Zi was saying was true. Moreover, these monsters were backed by a massive organization spanning the entire globe, established since World War I.<br/><br/>The strongest individual he had felt before was from this organization, comparable in strength to someone of the Profound Heart Realm.<br/><br/>Their power was unique; they were not cultivators, but merely had special physiques.<br/><br/>Fang Wang pondered and said, “It’s not good to act directly; after all, we’ll eventually leave. Act covertly.”<br/><br/>He was busy merging cultivation techniques and had no inclination to save the world. Moreover, he deduced that many countries were linked with that organization, which means it’s not necessarily an evil organization – at least on the international stage, it could be controlled.<br/><br/>Now, he was only looking forward to the results of merging the Heavenly Dao Immensity Scripture with the Xuandu The Book of Changes.<br/><br/>Success was not far away!<br/><br/>He wondered if this would cause any celestial phenomena in this Mortal Realm.\t\t\t\t\t\t</div>", "images": {}, "success": true}