{"id": 362, "url": "https://www.novelhall.com/i-became-an-immortal-on-mortal-realm-32879/14907970.html", "title": "Chapter 352 - Chapter 352: Chapter 349 Earth, 2011", "volume": 4, "volume_title": "Volume 4", "body": "<h1>Chapter 352 - Chapter 352: Chapter 349 Earth, 2011</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 352: Chapter 349 Earth, 2011<br/><br/>Gazing down at the bustling scene below, Fang Wang fell into a reverie, as ancient memories, buried for 110,000 years, emerged from the depths of his mind.<br/><br/>From the moment he began his cultivation in this life, Fang Wang had fantasized about returning to Earth, to his hometown from a previous life, after all, immortals can do anything.<br/><br/>Now that he had truly returned, Fang Wang could hardly believe it; he tried to remain calm as he dispersed his divine consciousness.<br/><br/>Quickly, his divine consciousness covered the entire world.<br/><br/>This world was very small and spherical in shape, with ocean water occupying the vast majority of it, everything indicating that he had indeed returned to Earth.<br/><br/>Xiao Zi had been talking for a while when it suddenly noticed that something was off with Fang Wang and couldn’t help but ask, “Young Master, what’s wrong?”<br/><br/>They had already traversed many Mortal Realms and seen all kinds of strange sceneries – it wasn’t shocked by the modern city, but instead thought the mortals of this realm were pitifully weak.<br/><br/>Fang Wang took a deep breath and said, “Xiao Zi, shrink down, and without my order, don’t move an inch.”<br/><br/>“Ah?”<br/><br/>Xiao Zi was confused, not understanding why Fang Wang would make such arrangements.<br/><br/>Fang Wang glanced at it, and it immediately shrank to thirty to forty centimeters long, lying on Fang Wang’s shoulder, still as stone.<br/><br/>In that moment, Xiao Zi suddenly thought of Gu Tianxiong.<br/><br/>Ptui!<br/><br/>The young master has been led astray!<br/><br/>How annoying!<br/><br/>Fang Wang’s divine consciousness then extended beyond Earth, and he saw the starry universe; beyond Earth, the universe was dark, with the existence of the sun so captivating.<br/><br/>He was certain this was no Illusionary Realm but a tangible reality.<br/><br/>Yet, some of the voices he heard made his expression a bit odd.<br/><br/>Clang!<br/><br/>Behind him came the sound of an iron gate being violently pushed open, followed by a voice saying, “Bro, don’t be foolish!”<br/><br/>It was the voice of a male, who looked about seventeen or eighteen years old, handsome, wearing a white short-sleeved shirt and black jeans, with a travel backpack on his back.<br/><br/>Following him, a young woman ran out from behind the iron gate; she bent over, hands on her knees, gasping for air, wearing a blue T-shirt and dark purple jean shorts, her golden hair tied back, bangs damp with sweat.<br/><br/>“Goodness… talk him out of it… don’t… scare him… into falling off…”<br/><br/>The young woman said between gasps, her gaze fixed on Fang Wang, who stood at the edge of the rooftop.<br/><br/>The white-robed Fang Wang stood with the wind at his back, he slightly turned his head, glancing at the two people, his eyes calm.<br/><br/>The young man raised his hands, tensely saying, “Bro, don’t get excited, whatever it is, let’s go down and talk, huh?”<br/><br/>Fang Wang couldn’t help but smile, these two thought he was about to jump off the building?<br/><br/>He then turned around, jumped down from the concrete railing, and landed on the rooftop, a move that eased the tension of the two who had rushed over.<br/><br/>Walking straight toward them, the young man took a deep breath, eyeing Fang Wang with curiosity and asked, “Bro, are you cosplaying? Who are you cosplaying as? Which character from a period drama series?”<br/><br/>The woman behind him stood up, hands on her hips, wiping sweat as she curiously examined Fang Wang.<br/><br/>So handsome…<br/><br/>She thought to herself, not just her, but the young man who came with her was also inwardly amazed.<br/><br/>“Damn, this guy is a bit too handsome, his aura is like that of a real ancient person…” The young man felt Fang Wang was much more handsome than the male stars in TV dramas.<br/><br/>This handsome, and he wanted to be “foolish”?<br/><br/>Fang Wang approached them and said, “My name is Fang Wang. I’m traveling in this city, and my wallet and backpack have been stolen. Could you introduce me to this city?”<br/><br/>With the secluded cultivation time at the Heavenly Palace, Fang Wang had lived for 110,000 years this life, and his memories of his previous life had already become vague. He could only recall the rough outline of Earth’s modern cities, which was why he wanted to find someone to chat with.<br/><br/>He wasn’t sure about the relationship between this Earth and the one from his past life. According to the divine consciousness he had just probed with, there seemed to be a discrepancy in time.<br/><br/>The man turned around and exchanged a glance with the woman. After a moment of hesitation, she nodded slightly at him.<br/><br/>Then, the man began to introduce himself. His name was Yang Jun, and the woman behind him was his older sister, Yang Lin’er. They had come to this city to attend college and had arrived early to take the opportunity to travel before the start of the semester.<br/><br/>“Bro, let’s go. We’ll treat you to a meal, and we can talk while eating. Later, we’ll take you to the police station. Maybe you can find your wallet and phone, or, we can help you contact your family,” Yang Jun said warmly, in a familiar manner.<br/><br/>Fang Wang smiled and nodded, following the two down the staircase.<br/><br/>Yang Lin’er asked with curiosity, “Where did you buy the doll on your shoulder? It looks really nice.”<br/><br/>She thought Xiao Zi was some kind of a plush toy.<br/><br/>As soon as she finished speaking, she shivered, feeling a sudden chill, which was odd enough to make her shiver despite it being midsummer.<br/><br/>Fang Wang patted the Dragon Head of Xiao Zi, calming its annoyed emotions, and chuckled, “This isn’t something you can buy.”<br/><br/>“Could it be a prize from a cosplay contest?” Yang Jun speculated.<br/><br/>Fang Wang went with the flow and nodded.<br/><br/>And so, the three of them chatted as they descended the stairs.<br/><br/>Yang Jun was very talkative. He found Fang Wang very interesting, while Yang Lin’er occasionally glanced his way and spoke from time to time.<br/><br/>The trio reached the main street, where quite a crowd had gathered, pointing at Fang Wang. It was clear that the people who thought Fang Wang was going to jump off the building were not just Yang Jun and Yang Lin’er.<br/><br/>Yang Jun quickly pulled Fang Wang away, and they walked along the edge of the road. Fang Wang, gazing at the modern shopping district around him, felt somewhat dazed.<br/><br/>“The Floating Pagoda has broken a few floors, who’s soul has it cut…”<br/><br/>Music from a nearby shopping mall brought Fang Wang’s thoughts gradually back to reality.<br/><br/>Through his conversation with Yang Jun, he was sure he had returned to Earth.<br/><br/>But the time was wrong…<br/><br/>It was the year 2011!<br/><br/>In his past life, he had suddenly died in the year 2029.<br/><br/>Afterward, Yang Jun and Yang Lin’er took Fang Wang to a Sichuan restaurant to eat. Fang Wang’s appearance attracted a lot of attention, with some people even taking out their phones to take pictures.<br/><br/>Once they were seated, Yang Jun started talking about his university. He and his sister had been in the same class since childhood, and now, at their parents’ insistence, they had been admitted to the same college. They were quite looking forward to their upcoming college life.<br/><br/>At the same time, they also expressed their interest in cosplay.<br/><br/>Fang Wang looked at Yang Jun’s hairstyle and thought of a term that had been popular in his previous life, non-mainstream.<br/><br/>Well, it wasn’t too alternative, just the hairstyle was a bit high.<br/><br/>Yang Lin’er was the same. She had gotten her hair permed as soon as her college entrance exams were over. She said she liked anime, but unfortunately, Fang Wang had forgotten what anime he had watched in his previous life and couldn’t keep up with her conversation.<br/><br/>Dragon Ball, Naruto, Reborn, he had an impression of them, but he couldn’t recall the storylines.<br/><br/>After more than an hour.<br/><br/>Fang Wang prepared to take his leave, but Yang Jun was very enthusiastic and insisted on buying him a set of clothes.<br/><br/>Fang Wang thought about it and decided not to refuse anymore.<br/><br/>After experiencing the fights and decades of arduous cultivation in the Cultivation world, he suddenly wanted to be an ordinary person and relax.<br/><br/>For some reason, being here, Fang Wang felt an odd sensation in his heart, as if his enlightenment had caught onto something.\t\t\t\t\t\t</div>", "images": {}, "success": true}