{"id": 361, "url": "https://www.novelhall.com/i-became-an-immortal-on-mortal-realm-32879/14907968.html", "title": "Chapter 351 - Chapter 351: Chapter 348: Breaking Through To The Sky-Stepping Realm, Fang Wang’S Excitement", "volume": 4, "volume_title": "Volume 4", "body": "<h1>Chapter 351 - Chapter 351: Chapter 348: Breaking Through To The Sky-Stepping Realm, Fang Wang’S Excitement</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 351: Chapter 348: Breaking Through to the Sky-Stepping Realm, Fang Wang’s Excitement<br/><br/>Looking at the seven Longevity God Ages in the sky, Xiao Zi’s eyes were filled with irritation, feeling as if it had been played with.<br/><br/>It was clear the Longevity God Ages it had killed wasn’t its true form no wonder it kept laughing crazily while being killed.<br/><br/>The seven Longevity God Ages lined up side by side, standing shoulder to shoulder and looking down at Fang Wang and Xiao Zi.<br/><br/>The Longevity God Ages in the center raised his right arm, pointing his index finger towards the sky, and a surge of energy erupted, shooting up towards the heavens.<br/><br/>In a flash, the thunder clouds in the sky started changing colors, lightning flickering, followed by the apparition of all seven Longevity God Ages’ shadows.<br/><br/>The entire Mortal Realm, all living beings raised their heads to see this scene, and everyone was scared, as the seven shadows were simply too vast, occupying the whole sky, reminiscent of seven giant alien demons looking down on the Mortal Realm from above, filled with a sense of oppression.<br/><br/>“Ants of the Mortal Realm, I am back.”<br/><br/>“Thanks to Tiandao Fang Wang and the so-called compassionate and limitless Descending Dragon God of Salvation, you would have lived for several more decades, but now, the end of your lives shall come to a halt today.”<br/><br/>“Self-proclaimed Dragon God? Ridiculous, I am the true Immortal Divine!”<br/><br/>“Hahaha, is this Tiandao Fang Wang? He seems unimpressive.”<br/><br/>“Just wait and you’ll see Tiandao Fang Wang kneeling before me, begging pathetically.”<br/><br/>The seven Longevity God Ages spoke one after another, taunting all living beings, taunting Fang Wang, taunting Xiao Zi.<br/><br/>This almost made Xiao Zi explode with rage, and it almost charged forward, but was stopped by a hand raised by Fang Wang.<br/><br/>Fang Wang looked on with interest at the Longevity God Ages.<br/><br/>This method was quite similar to the one used by the Pursuer of The Path of Immortality.<br/><br/>They also self-proclaimed themselves Immortal Divine, could they be related to the Immortal Court?<br/><br/>At the same time, the entire Mortal Realm plunged into a state of panic. Over the past years, the horror of the Longevity God Ages had enveloped the Mortal Realm, so how could they not fear seeing seven Longevity God Ages now?<br/><br/>At that moment, the gaze of the seven Longevity God Ages dropped down, locking on to the same direction.<br/><br/>Fang Wang, sitting in front of the pavilion, reached out with his right hand towards them.<br/><br/>It was such a gentle grasp, with not the slightest bit of disturbance.<br/><br/>In an instant, the world went silent, and the seven shadows in the sky vanished into thin air.<br/><br/>Gone were not just the enormous shadows in the thunderclouds, but also the seven Longevity God Ages’ physical bodies!<br/><br/>With them went their souls, disappearing altogether!<br/><br/>Xiao Zi watched dumbfounded, unable to believe its own eyes.<br/><br/>Again, such a grasp!<br/><br/>Although it wasn’t as grandiose as the last time, the silence this time shocked it even more.<br/><br/>“Young Master… this Divine Skill…” Xiao Zi turned its head to look at Fang Wang with fiery eyes.<br/><br/>The sky did not turn dark, it was only that the seven Longevity God Ages had been erased, silently.<br/><br/>As his realm improved, Fang Wang’s mastery over the Great Returning Void Palm became increasingly exquisite.<br/><br/>“I’ll teach you later.”<br/><br/>Having said this, Fang Wang closed his eyes to cultivate, paying no further attention to Xiao Zi.<br/><br/>Xiao Zi was extremely excited and left the forest once more.<br/><br/>The reason Fang Wang did not use the Ghostly Divine Sword Qi to absorb the souls of the Longevity God Ages was partly to test his control and partly to avoid the karmic consequences associated with Immortal Divine.<br/><br/>The Immortal Divine were certainly not just stronger in Spiritual Power compared to the Mortal Realm cultivators, their Divine Skills must be beyond imagination, and being cautious was always good.<br/><br/>Elsewhere, creatures from various places in the Mortal Realm were holding their breath in anticipation, waiting for the Longevity God Ages to display their power.<br/><br/>Although they didn’t understand why the apparitions in the sky had disappeared, the Longevity God Ages would surely take revenge on the Mortal Realm.<br/><br/>…<br/><br/>Another twenty-five years passed, and Fang Wang finally reached the Ninth Level of the Divine Passage Realm.<br/><br/>Xiao Zi had also returned ten years ago, and had begun to focus on cultivation, indifferent to worldly affairs.<br/><br/>Fang Wang noticed that more and more beings were approaching his place of cultivation, but they dared not set foot within a thousand miles of where he sat at the center. His Qi Gathering was too forceful and oppressive; even when he restrained himself, it was more than mere spirits could bear.<br/><br/>Yet there were always some cultivators bold and reckless enough to try.<br/><br/>It happened one day at noon.<br/><br/>Sitting cross-legged on the roof, Fang Wang spoke, “Send them away.”<br/><br/>At his words, Xiao Zi opened its eyes, ready to act.<br/><br/>“Wait, take these things over to them. Choose some you deem worthy and impart each to them one by one.”<br/><br/>Fang Wang waved his hand, and one by one, secret manuals flew out from the Dragon Jade Ring.<br/><br/>A Storage Jade Bracelet hung from Xiao Zi’s right forepaw. It promptly gathered the manuals into the bracelet, then leapt into the woods.<br/><br/>These manuals were all methods from the Heavenly Dao Immensity Scripture, which he had written in his spare time.<br/><br/>He was not the slightest bit worried about his Cultivation Techniques being divulged. In fact, he was happy to disseminate them. However, mastering them would be no easy feat.<br/><br/>When he returned to the Mortal Realm in which he belonged, he would begin to integrate new Cultivation Techniques.<br/><br/>As for whether Xiao Zi would mistakenly impart them to the wicked—that was beyond Fang Wang’s control. He did not belong to this Mortal Realm, and he had neither the time nor the patience to seek out suitable inheritors. As long as he left his legacy in this world, he believed that someday, someone would bring the Heavenly Dao Immensity Scripture to great prominence and terrify the world.<br/><br/>“The Sky-Stepping Realm, here I come.”<br/><br/>Fang Wang murmured to himself and then closed his eyes.<br/><br/>With the experience of cultivating in the Heavenly Palace, these years of arduous cultivation were nothing special to him.<br/><br/>And so, years passed by.<br/><br/>Eleven years later, Fang Wang began his breakthrough.<br/><br/>The Sky-Stepping Realm, compared to the Divine Passage Realm, required no creation, only all-around enhancement of cultivation, physical body, and soul.<br/><br/>The Sky-Stepping Realm, as its name suggested, meant one could step into the sky without the aid of Spiritual Power!<br/><br/>Fang Wang, who could even slay the Celestial Qiankun, naturally found it not difficult to break through the Sky-Stepping Realm.<br/><br/>After seven days and nights, Fang Wang’s breakthrough succeeded.<br/><br/>He still had not experienced the tribulation, which showcased the power of the Heavenly Dao Immensity Scripture.<br/><br/>Fang Wang spent another two years consolidating his cultivation. At this moment, he was a completely different person from when he had battled the Immortal Divine Seeker.<br/><br/>He now had the confidence to sweep through the Celestial Qiankun!<br/><br/>Without any exaggeration, were he to return to his own Mortal Realm, unless gods descended or Great Saints and Great Emperors revived, he would be the foremost under heaven!<br/><br/>Fang Wang stood up, and with an effortless gesture, he drew Xiao Zi into his arms. He hoisted Xiao Zi onto his shoulder with his right hand and, using the Lingxiao Divine Sect technique, vanished from the spot.<br/><br/>The road home was arduous. Arriving in another Mortal Realm, still no one recognized the name of the Descending Dragon Great Saint.<br/><br/>Fang Wang once tried diving into the Underworld to find his way, but less than half an hour in, he felt an extremely terrifying intention to kill locking onto him, frightening him to immediately escape back to the Mortal Realm using the Jiu You Freedom Technique.<br/><br/>Afterward, Fang Wang began to use the Lingxiao Divine Sect technique frantically.<br/><br/>Xiao Zi, sensing his mood, started to recount his teachings over the years.<br/><br/>It had thoroughly spread his name; the Heavenly Dao Immensity Scripture had become the supreme secret art of that Mortal Realm.<br/><br/>After shuttling back and forth numerous times, Fang Wang suddenly stopped.<br/><br/>“Young master, that Qi Xian is the one I believe holds most promise to inherit your…” Xiao Zi lay on Fang Wang’s shoulder, prattling incessantly, not noticing Fang Wang’s unusual demeanor.<br/><br/>At that moment, Fang Wang stood at the edge of a concrete terrace, his gaze overlooking below, his eyes unusually brimming with excitement.<br/><br/>High-rises made of steel and glass, straight roads filled with the bustle of cars, and video advertisements playing on the facades of shopping malls.<br/><br/>This place is …\t\t\t\t\t\t</div>", "images": {}, "success": true}