{"id": 360, "url": "https://www.novelhall.com/i-became-an-immortal-on-mortal-realm-32879/14902259.html", "title": "Chapter 350 - Chapter 350: Chapter 347: Saving From Suffering And Difficulty, Boundless Compassion", "volume": 4, "volume_title": "Volume 4", "body": "<h1>Chapter 350 - Chapter 350: Chapter 347: Saving From Suffering And Difficulty, Boundless Compassion</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 350: Chapter 347: Saving from Suffering and Difficulty, Boundless Compassion<br/><br/>“`<br/><br/>The Purple Dragon that flew in from the horizon was none other than Xiao Zi, its body a thousand zhang long, wrapped in clouds and mist, the majestic aura of a True Dragon on full display.<br/><br/>Sitting atop the bone mountain, the Longevity God Ages lifted his head, his eyes opening along with it, a pair of hollow crimson pupils gazing towards the horizon, as the multitude of tiny eyes on his forehead followed suit, rotating in sync.<br/><br/>He revealed a greedy smile, licked his lips, and muttered to himself, “The breath of a True Dragon… must be delicious…”<br/><br/>A hundred li away, a group of Cultivators hiding behind the mountain of flesh all looked up at the approaching Xiao Zi, their eyes wide with astonishment.<br/><br/>A legendary True Dragon?<br/><br/>They were considered first-class Cultivators in the Mortal Realm, with extensive experience, but despite having traveled all over the world, they had never seen a True Dragon.<br/><br/>“Could it be the Dragon God from the Forest of Immortal Traces?” a female Cultivator excitedly speculated.<br/><br/>No one responded, the others were all staring blankly at the thousand-zhang-long Purple Dragon, as if they were watching a mountain range traverse the sky, the visual impact beyond description.<br/><br/>“I am the grand Dragon God under Tiandao Fangwang, a savior of suffering and a being of boundless compassion. Wretched beast, you have slaughtered the innocent and acted recklessly. If the heavens will not take you, then I shall!”<br/><br/>The voice of Xiao Zi rang out, a solemn and melodious female voice that conjured up the image of a holy and beautiful female Immortal in the minds of the listeners.<br/><br/>Hearing this, the Longevity God Ages laughed, his smile ferocious and chilling.<br/><br/>He stood up, his tall and slender figure standing against the wind, his tattered robes fluttering, and atop his head seemed to burn an eerie white flame. He stood like an evil spirit in the dark world, gazing at the light.<br/><br/>“Tiandao Fangwang? Since when does the Heavenly Dao have a name? Such arrogance!”<br/><br/>“A savior of suffering? Boundless compassion? Then let me see just how powerful this Dragon God is.”<br/><br/>The voice of the Longevity God Ages was cold and sly, filled with mocking deceit. As his voice fell, the whole world plunged into bone-chilling cold, and the Cultivators felt a wintry wind that seemed to pierce their very souls, making them shiver.<br/><br/>Xiao Zi sped up, swiftly flying over the heads of the Cultivators, the strong winds it generated causing the mountain of flesh to shake, as if it might collapse at any moment.<br/><br/>The Longevity God Ages twisted his neck, his face filled with excited anticipation as he readied himself for the great battle.<br/><br/>Xiao Zi suddenly opened its dragon mouth wide, and from it spewed forth a torrent of Sword Qi, ravaging the Firmament and overwhelming the Longevity God Ages with an unstoppable domineering force.<br/><br/>On the other side of the world, in the forest, Fang Wang was closely following the battle.<br/><br/>The extraterrestrial demon was no match for Xiao Zi, who had mastered numerous Spells and Divine Skills. When the demon manipulated the sea of bones in battle, Xiao Zi deployed the Nine Heavens Azure Thunder Sword Formation, dominating the enemy with the formation’s overwhelming might.<br/><br/>In Fang Wang’s eyes, its combat was merely passable, but to the Cultivators near the battlefield, it was the performance of a divine True Dragon.<br/><br/>Too strong, beyond comparison with those in the Mahayana Realm!<br/><br/>Fang Wang’s gaze turned towards the heavens.<br/><br/>He could sense several powerful presences roaming beyond the sky, very much like the extraterrestrial demon Xiao Zi was fighting against, probably from the same clan.<br/><br/>In terms of power, they were nearly reaching the Half-step Celestial Qiankun Realm.<br/><br/>Fang Wang was curious about their origins, and why they were able to traverse between worlds.<br/><br/>If he didn’t utilize the Lingxiao Divine Sect, it would be difficult for Fang Wang to breach the barriers of the world. There seemed to be powerful forces of rule separating each part of the Mortal Realm, preventing direct ascension to the outer realms and exploring the vast and limitless universe.<br/><br/>Fang Wang contemplated silently as time swiftly passed.<br/><br/>The battle between Xiao Zi and the Longevity God Ages lasted for an hour, and in the end, the Longevity God Ages was reduced to ashes. Xiao Zi’s dragon roar shook the Mortal Realm, and it did not immediately return, but rather roamed the skies of the Mortal Realm, letting all living beings witness its grace. At the same time, it spread the names of Tiandao Fangwang and the grand Dragon God, savior of suffering and embodiment of boundless compassion.<br/><br/>Fang Wang shook his head and smiled wryly, then began cultivating.<br/><br/>Half a year later, Xiao Zi finally returned.<br/><br/>It came before Fang Wang, laughing proudly, “Young Master, I didn’t embarrass you, did I?”<br/><br/>It believed that with Fang Wang’s cultivation, he would have sensed its great battle earlier.<br/><br/>Initially facing the Longevity God Ages, it almost got hurt, but fortunately, after adjusting its mindset, it managed to slaughter him successfully.<br/><br/>“`<br/><br/>After this battle, it felt changed, stronger than before!<br/><br/>It was now terrifyingly powerful; it truly was the compassionate and boundless Great Dragon God who rescued the suffering and the distressed!<br/><br/>Fang Wang closed his eyes and said, “That guy’s backup will soon arrive; are you ready to face them?”<br/><br/>Backup?<br/><br/>Xiao Zi was stunned.<br/><br/>“After the minor ones come, the major ones naturally follow,” Fang Wang said teasingly.<br/><br/>Upon hearing this, Xiao Zi confidently said, “Then we’ll see if the major ones are strong enough!”<br/><br/>As soon as the words fell, its tone shifted and said, “Master, you are my support; it’s only right for one support to fight another. The world also wants to know how powerful Tiandao Fang Wang is.”<br/><br/>Over the past six months, it had communicated with many major powers of the Mortal Realm, all willing to erect monuments for Tiandao Fang Wang and worship them with incense offerings, yet the people of the Mortal Realm were eager to witness the splendor of Tiandao Fang Wang.<br/><br/>Fang Wang opened his eyes and looked up at the firmament.<br/><br/>Xiao Zi followed his gaze.<br/><br/>Boom—<br/><br/>Thunderclaps suddenly erupted, and overhead, dense thunderclouds had gathered without notice, oppressive and terrifying, as if the sky might collapse at any moment.<br/><br/>Xiao Zi seemed to sense something, its dragon body trembled, and it couldn’t help but ask, “Master, have they arrived so soon?”<br/><br/>“They’ve been eying you for a while; they just couldn’t detect my presence. So they are pursuing you, hoping to extinguish the existence behind you as well,” Fang Wang replied, his tone indifferent.<br/><br/>He had already felt the murderous intent from beyond the heavens.<br/><br/>There were seven of them, looking very much like the Longevity God Ages, hovering outside the firmament, in the darkness, as if there was an invisible barrier ahead of them that they were struggling to break through.<br/><br/>Suddenly.<br/><br/>One of the outer demons staggered forward, flying several lengths ahead and then burst out laughing.<br/><br/>Fang Wang didn’t feel the space in the heaven burst open, indicating the other party evidently used some escape skill to leap in.<br/><br/>After the first one made it through, the remaining six quickly followed.<br/><br/>A series of sharp, strange laughter echoed throughout the Mortal Realm, followed by other laughter with varied emotions, but cultivators and demons in the Mortal Realm who heard these laughs were all creeped out.<br/><br/>This was particularly true for those who had faced Longevity God Ages before; they descended into despair.<br/><br/>“How is that possible? Is he still alive?”<br/><br/>Xiao Zi exclaimed in astonishment, unable to believe its ears.<br/><br/>Fang Wang’s eyebrows lifted; so these seven outer demons were actually one being.<br/><br/>Before, separated by the rules of heaven and earth, Fang Wang could only sense their presence without seeing their souls. Now he saw them.<br/><br/>The seven outer demons shared one soul!<br/><br/>A method of dividing one’s soul?<br/><br/>Fang Wang found it interesting. He didn’t rise to his feet but simply watched the firmament with a smile.<br/><br/>The seven Longevity God Ages descended rapidly, landing tens of thousands of zhang above the mountains, their dive stirring up such tremendous pressure that the mist in the Forest of Immortal Traces where Fang Wang was, instantly dispersed, and the world seemed to become very clear all at once.<br/><br/>Mountains cracked, fissures spread across their surfaces, ready to collapse at any moment.<br/><br/>The gazes of the seven Longevity God Ages fell upon Xiao Zi and then shifted to Fang Wang.<br/><br/>The woods where Fang Wang and Xiao Zi were located shook violently, and through the gaps in the leaves, Fang Wang’s eyes met those of the Longevity God Ages.\t\t\t\t\t\t</div>", "images": {}, "success": true}