{"id": 374, "url": "https://www.novelhall.com/i-became-an-immortal-on-mortal-realm-32879/14916496.html", "title": "Chapter 364 - Chapter 364: Chapter 361: An Unbeaten Confidence, The Greatest Genius Of All Time", "volume": 4, "volume_title": "Volume 4", "body": "<h1>Chapter 364 - Chapter 364: Chapter 361: An Unbeaten Confidence, The Greatest Genius Of All Time</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 364: Chapter 361: An Unbeaten Confidence, The Greatest Genius of All Time<br/><br/>“`<br/><br/>Above the vast ocean, with gusts of sea breeze, translucent fish flew through the air, their bodies clear and sparkling, while Fang Wang stood in the sky.<br/><br/>The spiritual energy of this world was far more abundant than on Earth, and its creatures were equally magical, all formed of condensed spiritual energy, from the smallest fry with its own thoughts.<br/><br/>Fang Wang did not linger but took a third step forward.<br/><br/>The world changed abruptly once more!<br/><br/>The ocean vanished, and in an instant, Fang Wang and Xiao Zi found themselves in a bustling ancient city, where the streets teemed with people and both sides were lined with shouting vendors.<br/><br/>As Fang Wang’s feet touched the ground, Xiao Zi too felt the reality of this world.<br/><br/>“Sugar-coated hawthorns for sale! Sugar-coated hawthorns for sale!”<br/><br/>“My lord, please come inside, today’s top card is Yi Xiang!”<br/><br/>“Get out of the way! Don’t block the road!”<br/><br/>“Did you hear? Last night, the newly crowned top scholar got caught at the Apricot Flower Building, accused of abandoning his wife and child.”<br/><br/>The sounds from all directions brought a sense of reality to Xiao Zi.<br/><br/>On the roadside, a young girl holding a pancake stared at Fang Wang and Xiao Zi, her eyes widened, and her small mouth gaped open, as if she had seen a ghost.<br/><br/>Then, Fang Wang took another step, and as he lifted his foot, he and Xiao Zi vanished into thin air.<br/><br/>The next second, they arrived in another part of the Mortal Realm.<br/><br/>In this manner, Fang Wang traversed from one Mortal Realm to another, moving so swiftly that Xiao Zi was left dazzled, its dragon mouth agape in stunned silence.<br/><br/>Xiao Zi considered itself to be worldly, but it had never seen such a technique.<br/><br/>In its heart, Fang Wang’s image grew even more lofty; it had originally thought that Fang Wang spent decades on Earth for the sake of indulgence, but it turned out that he had comprehended such divine skills.<br/><br/>It was simply beyond belief!<br/><br/>Xiao Zi could not comprehend how Fang Wang accomplished this, and its heart was filled with boundless admiration.<br/><br/>“Master, are you invincible now?” Xiao Zi asked excitedly, struggling to contain its excitement.<br/><br/>Fang Wang continued forward, gazing straight ahead, and said calmly, “How can one be invincible? It’s just that, below Immortal Divine beings, there’s the confidence of being unbeaten.”<br/><br/>His confidence in his heart far exceeded his modest words!<br/><br/>Xiao Zi, hearing his words, naturally only half-believed them.<br/><br/>Based on the master’s character, being unbeatable in the Mortal Realm meant to sweep all before him!<br/><br/>Wasn’t that equivalent to the legendary Descending Dragon Great Saint?<br/><br/>As a princess of the True Dragon Clan from ten thousand years ago, Xiao Zi’s memories of the Descending Dragon Great Saint had grown vague, but it clearly understood that, despite his tragic fate, he was the strongest in the Mortal Realm.<br/><br/>If Fang Wang could achieve so much before the age of five hundred, how high would he stand in the future?<br/><br/>Just thinking about it thrilled Xiao Zi.<br/><br/>As Fang Wang continued to step forward, even though he did not deliberately linger, the differing sceneries of the Mortal Realms fascinated Xiao Zi.<br/><br/>After a hundred steps, Fang Wang had left the Mortal Realm where Earth resided far behind. He stopped walking, looked back, and found the aura of Earth so distant, almost unreachable, and the presence of Yang Lin’er even more undetectable.<br/><br/>At that moment, he stood on a cliff, and the cool mountain breeze blew past, fluttering his white clothes.<br/><br/>His black hair began to grow long, reaching his waist before ceasing to grow. He suddenly reverted from a modern figure to the appearance of the Wangdao Master, with Immortal Aura and Daoist Bones, shedding any trace of mundane dust from his body.<br/><br/>This was the real him!<br/><br/>“The spiritual energy here is good. Let’s cultivate here for now,” Fang Wang said, feeling the spiritual energy of heaven and earth.<br/><br/>The prowess of the Sky-Stepping Realm was not enough for him. Having left that part of the Mortal Realm for so many years, with many powerful figures emerging in the world, he no longer wanted to fight across realms, but rather to experience the sensation of crushing all opposition at a high level.<br/><br/>“`<br/><br/>Xiao Zi naturally had no objections, and the duo — one human, one dragon — followed the mountain path downward.<br/><br/>“Young Master, do you think this world could possibly be our Mortal Realm?” Xiao Zi asked curiously. The Spiritual Energy of this world was so abundant, and there weren’t as many bizarre and peculiar sights, which gave her the feeling of returning to a familiar place.<br/><br/>Fang Wang was also using his divine sense to investigate. He responded, “I’m not sure, but our Mortal Realm is not the strongest one.”<br/><br/>He intentionally slowed his pace, wanting to feel the essence of this piece of heaven and earth.<br/><br/>So the pair continued their casual conversation as they descended the mountain.<br/><br/>Half an hour later, Fang Wang began to fly, heading in the direction where Human Cultivators were gathered. It was easy to tell, given that not everyone practices the art of concealing their aura as he does.<br/><br/>Soon, he arrived in front of a massive city. The city was rich in cultivation atmosphere, and although it did not compare to the Imperial City of the Grand Yu Divine Dynasty, it was not like any other city on the Descending Dragon Continent. He sensed several auras from those in the Sky-Stepping Realm within the city.<br/><br/>Fang Wang didn’t sneak in secretly; instead, he paid the Spirit Stones necessary for entrance and entered the city in an orderly fashion.<br/><br/>For him, considering the time spent in the Heavenly Palace, it had been too long since he last visited a city bustling with Cultivators, which he found nostalgic. As such, he wanted to cultivate in this city and incidentally gather some information.<br/><br/>This cultivation city was bustling with activity, skyscrapers rose everywhere, and treasures, spirit beasts, and Demon Pets could be found all around. Xiao Zi lay on Fang Wang’s shoulder, drawing the attention of many. However, Fang Wang also spotted the figure of a young dragon, which, although not as striking as Xiao Zi, was indeed eye-catching.<br/><br/>After wandering for two hours, Fang Wang finally found an inn. He ordered food and drinks, and just as the waiter was about to leave, Fang Wang stopped him.<br/><br/>“Young waiter, have you ever heard of the legend of the Descending Dragon Great Saint?” Fang Wang inquired.<br/><br/>The waiter turned his head, “The Descending Dragon Great Saint? I haven’t heard of it. Hasn’t there been only one Great Saint since ancient times? That’s the Qi Yun Great Saint, a creator god who forged heaven and earth.”<br/><br/>He looked at Fang Wang skeptically, while Xiao Zi had hidden in Fang Wang’s embrace and did not show her face.<br/><br/>Fang Wang smiled and nodded, then waved his hand to indicate that the waiter could leave.<br/><br/>The waiter immediately nodded and bowed, then turned and departed.<br/><br/>Fang Wang reflected inwardly, just how many Mortal Realms are there?<br/><br/>He had traversed so many worlds and still could not find the Mortal Realm from which he came.<br/><br/>In light of this, the Doom God and the seeker of The Path of Immortality were indeed extraordinary for having pulled him to such a distant and boundless place.<br/><br/>Of course, it’s also possible that the Mortal Realms do not exist within the same dimension, but are distributed in a far more complex relationship.<br/><br/>The waiter first brought over a pot of wine, which was fragrant with Spiritual Energy.<br/><br/>Fang Wang began pouring himself a drink. There were many Cultivators inside the inn; at every table, people were talking.<br/><br/>Suddenly, Fang Wang’s attention was drawn by a conversation at a nearby table.<br/><br/>“It’s uncertain if Ji Rutian will dare to accept the challenge. The Demon Venerable Cang, using the lives of an entire generation as leverage, forces Ji Rutian to face him in battle, with only five years left.”<br/><br/>“Fortunately, we’re within the Mortal Realm Saint Dynasty, so Demon Venerable Cang wouldn’t dare to come here.”<br/><br/>“That’s not certain. Demon Venerable Cang is ambitious. Once he kills Ji Rutian, the next target will be the Saint Dynasty.”<br/><br/>“Ji Rutian will surely accept the challenge. He is the unparalleled genius of all ages, having already proven himself. Even with Demon Venerable Cang’s six thousand years of cultivation, he’s no match for him!”<br/><br/>“It’s just unfortunate that this battle is too far removed from us; we are unable to go and support Ji Rutian.”<br/><br/>Ji Rutian?<br/><br/>Fang Wang raised his eyebrows, feeling that this name sounded somewhat familiar, as if he had heard it somewhere before.<br/><br/>After carefully recalling, he suddenly realized.<br/><br/>Wasn’t this the genius who was born on the exact same day as him?<br/><br/>If not for his own astonishing emergence, Ji Rutian’s path would have been similar to Fang Wang’s, a peerless genius dominating the ages.<br/><br/>Why is he here?<br/><br/>Was it a coincidence of names, or was it actually him?\t\t\t\t\t\t</div>", "images": {}, "success": true}