{"id": 372, "url": "https://www.novelhall.com/i-became-an-immortal-on-mortal-realm-32879/14915168.html", "title": "Chapter 362 - Chapter 362: Chapter 359: The Law Of Rebirth", "volume": 4, "volume_title": "Volume 4", "body": "<h1>Chapter 362 - Chapter 362: Chapter 359: The Law Of Rebirth</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 362: Chapter 359: The Law of Rebirth<br/><br/>The blood-red eyes within the black vortex subtly shifted, surveying for a long time before vanishing. Then, a figure stepped out from within the black vortex.<br/><br/>In comparison to the previously seen blood-red eyes, this figure seemed minuscule, as if the eyes were as vast as planets.<br/><br/>This was a man clad in heavy black armor, spiked all over, with a helmet concealing a weathered face adorned with a beard and deep-set eyes that bore blood-colored pupils.<br/><br/>He suddenly sensed something and turned his gaze in a certain direction, only to see a person standing at the end of the starry sky, none other than Fang Wang.<br/><br/>The two were a great distance apart, staring at each other from afar.<br/><br/>Fang Wang observed him, curious inwardly.<br/><br/>Sky-Stepping Realm cultivation!<br/><br/>What could be the purpose of such a being crossing into this realm?<br/><br/>The man in black armor also sized up Fang Wang, but to no avail; he couldn’t see through him.<br/><br/>“Are you a cultivator of this world, or do you come from another mortal realm?” the man in black armor was the first to break the silence. He didn’t open his mouth, but his voice reached Fang Wang’s ears clearly.<br/><br/>Fang Wang responded, “Not of this world, but I bear the responsibility to protect it.”<br/><br/>His tone was not overly forceful, but his words caused the man in black armor to frown.<br/><br/>The man in black armor was silent for a moment, then said, “If you intend to stop me, be careful you don’t end up dead and your path utterly destroyed.”<br/><br/>Though he couldn’t penetrate Fang Wang’s mysteries, Fang Wang didn’t seem to pose an insurmountable challenge to him.<br/><br/>Fang Wang stared at him and said, “I advise you not to strike.”<br/><br/>Despite being unaware of the stranger’s origins, if he dared to make a move, Fang Wang would not hold back.<br/><br/>Upon hearing this, the man in black armor couldn’t help but show a smile, one that was scornful and cruel. He raised his right hand, and from behind him within the black vortex, a black cudgel wrapped in embers and glowing spots like magma, as if freshly extracted from a furnace, flew out.<br/><br/>The fabric of space in this starry sky began to quiver, and even Fang Wang, with his Heavenly Gang Supreme Yang Tyrant Body, felt a twinge of heat.<br/><br/>Interesting!<br/><br/>The man in black armor grasped the black cudgel and kept his gaze fixated on Fang Wang. A terrible murderous intent exploded, creating a shockwave visible to the naked eye that swept in all directions.<br/><br/>Fang Wang’s white clothes flustered in the tumult; he promptly raised his hand and reached into the void.<br/><br/>Great Returning Void Palm!<br/><br/>The man in black armor still wore his ferocious smile, but suddenly, his blood-colored eyes flashed with a cold glint, and then, he disappeared into thin air.<br/><br/>The black vortex behind him expanded violently, turning into a vast black region, as if the universe had been pierced with a massive hole, eerily terrifying.<br/><br/>Fang Wang withdrew his hand and let out a slight sigh, then vanished from the spot.<br/><br/>…<br/><br/>Evening descended.<br/><br/>Fang Wang walked back to his own detached villa, holding a plastic bag containing sugar-glazed chestnuts he had bought.<br/><br/>Back at home, Yang Lin’er was cooking. Fang Wang disliked being disturbed, so they had not employed a housekeeper.<br/><br/>Fang Wang sat on the sofa, turned on the TV to watch the news, and took out his mobile phone.<br/><br/>He noticed he had missed more than a dozen calls from Yang Jun.<br/><br/>He immediately called back, and Yang Jun answered quickly.<br/><br/>Yang Jun was very excited, it was another matter about the dragon.<br/><br/>After being saved by Xiao Zi that year, he dared not go abroad again, even changing careers, but he always cared about supernatural creatures. Thus, he always followed such news in his daily life.<br/><br/>Fang Wang could only deal with it.<br/><br/>Half an hour later, when Yang Lin’er had prepared the meal, he finally found an opportunity to end the call.<br/><br/>Fang Wang sat down at the dining table, and Yang Lin’er served him the food, then she served herself.<br/><br/>Having taken off her apron, Yang Lin’er said helplessly, “Why bother with him? He’s become obsessed with dragons, always thinking about world changes, the revival of Spiritual Energy, and end-of-the-world type online novels. He’s been reading them for ten years and still isn’t bored.”<br/><br/>Fang Wang smiled; before Xuandu Great Saint’s appearance, Earth could indeed have experienced a revival of Spiritual Energy, but since he promised the Xuandu Great Saint, the Earth would naturally not see any supernatural powers.<br/><br/>“How about you, do you believe? Or rather, do you long for it?” asked Fang Wang with a smile, while picking food for Yang Lin’er.<br/><br/>In all the years they’d been together, it was mostly Yang Lin’er taking care of him. He clearly had money, yet Yang Lin’er never asked him for any, and the family business she had now was earned through her own efforts.<br/><br/>As a middle-aged man, successful in his career, Yang Lin’er would come home to cook and do laundry for him. How could Fang Wang’s heart not be touched?<br/><br/>Putting himself in her place, Fang Wang didn’t think he was a qualified partner; most of his time was spent in spiritual reflection.<br/><br/>Now that the Cultivation of Lingxiao Divine Sect and Jiu You Freedom Technique were about to merge, Fang Wang’s views were starting to change.<br/><br/>“If you believe, I will too, and as for longing, of course I do. If we could be together lifetime after lifetime, how wonderful that would be. Over the years, I’ve spent most of my time working. I’m almost forty, and although others say I’ve taken good care of myself and still look like a young girl, I know my youth is no longer. Sigh, perhaps I shouldn’t have worked so hard and should have spent more time creating beautiful memories with you,” said Yang Lin’er as she poked at her rice with her chopsticks, her eyes drifting to the window, her tone filled with emotion.<br/><br/>Fang Wang said with a smile, “Then in our next life, we’ll meet in the world of Cultivation. Didn’t you used to love watching period dramas? It’s not that I, as the strongest Demon Lord in the Three Realms, will spoil you.”<br/><br/>Yang Lin’er glanced at him, but the corners of her mouth that rose betrayed the excitement within her.<br/><br/>Perhaps because they never had children, she remained like a girl in front of Fang Wang.<br/><br/>“Didn’t you once mock me, saying how could there be a supreme being in the Cultivation world who would give up thousands of years of Cultivation for love?” Yang Lin’er teased.<br/><br/>Fang Wang laughed, “Spoiling you doesn’t mean I have to give up my cultivation.”<br/><br/>“Humph, why should you be the strongest Demon Lord in the Three Realms in our next life, while I can only be an ordinary female Cultivator? I disagree, I want to turn it around, let me spoil you.”<br/><br/>The two began to bicker, and although there were only two people at home, it wasn’t the least bit lonely.<br/><br/>The lights inside the villa were so warm, just like in most households in the Mortal Realm.<br/><br/>The night fell.<br/><br/>After Yang Lin’er fell asleep, Fang Wang quietly got up and sat cross-legged in the living room. He sent his consciousness into the Jade Bracelet, and soon felt Zhou Xue’s consciousness.<br/><br/>His consciousness arrived in the Illusionary Realm and saw Zhou Xue.<br/><br/>“I’ve recently learned another Divine Skill from Xuandu Great Saint. Listen, see if you’re interested,” Fang Wang started, then he began to introduce the Xuan Yuan Divine Transformation.<br/><br/>Zhou Xue listened intently. Once Fang Wang finished, she nodded lightly and said, “A decent method of creating avatars. Even though it can’t make one’s strength leap forward, it can play a critical role in many situations.”<br/><br/>Fang Wang showed a smile and was about to speak when Zhou Xue’s tone shifted and she asked, “Is that so? What exactly is it that you’re here for? Such a Divine Skill isn’t something you’d come to me for. I’ve never seen you so coy. Could it be because of that woman in the downtrodden Mortal Realm?”<br/><br/>Fang Wang almost couldn’t hold back; women were truly too sensitive in these matters, weren’t they?<br/><br/>“Ahem, actually, I wanted to ask if there’s a special method of reincarnation that allows one to be reborn into a good life and retain one’s memories,” Fang Wang asked, feigning calm.<br/><br/>Even though he was powerful, he still couldn’t reverse life and death. If he directly brought Yang Lin’er into the world of Cultivation, with her aptitude, how many hundred years could she live?<br/><br/>“A method of reincarnation? There are indeed such methods, but I have another way that could allow her to be reborn without reincarnating and gain extraordinary aptitude. It all depends on whether you’ll let me assist her,” Zhou Xue asked with a mix of smiles and seriousness, her gaze making Fang Wang’s heart prickle with unease.\t\t\t\t\t\t</div>", "images": {}, "success": true}