{"id": 373, "url": "https://www.novelhall.com/i-became-an-immortal-on-mortal-realm-32879/14916491.html", "title": "Chapter 363 - Chapter 363: Chapter 360: Great Perfection Of The Heaven Of Carefree Freedom, One Step One Mortal Realm", "volume": 4, "volume_title": "Volume 4", "body": "<h1>Chapter 363 - Chapter 363: Chapter 360: Great Perfection Of The Heaven Of Carefree Freedom, One Step One Mortal Realm</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 363: Chapter 360: Great Perfection of The Heaven of Carefree Freedom, One Step One Mortal Realm<br/><br/>Facing Zhou Xue’s eerie smile, Fang Wang felt pressure.<br/><br/>Hadn’t they agreed not to care?<br/><br/>Fang Wang said solemnly, “In this world, I trust you the most. Other women, including Fang Hanyu, don’t compare to you in my heart. Whatever you say to do, I will do, of course, if you’re not happy, we can drop this matter.”<br/><br/>“Really, I admit I might struggle with loneliness, but you are the one I care about the most. If it weren’t for your advice before, I would never have accepted her.”<br/><br/>Fang Wang felt ashamed of his own words.<br/><br/>Zhou Xue couldn’t help but cover her mouth and laugh; she stared at Fang Wang with eyes that held an indescribable mix of affection and reproach.<br/><br/>“No wonder so many women, even if they can’t have you, are willing to remain pure for you, hoping you’ll change your mind. With your talent coupled with that silver tongue, you truly are the bane of female cultivators across all the heavens and worlds.”<br/><br/>Fang Wang could clearly sense that Zhou Xue wasn’t angry, so he asked, “What’s the method you’re talking about?”<br/><br/>Instead of answering, Zhou Xue asked back, “You wish for her to have better qualifications, but do you hope she is a vase under your protection forever, or someone who can stand on her own and even help you when it matters?”<br/><br/>Fang Wang fell into thought.<br/><br/>Even though he spoke of spoiling Yang Lin’er, he was well aware of her strong nature.<br/><br/>He had long ago expressed willingness to support Yang Lin’er for her entire life because, in his eyes, her life was very short, but Yang Lin’er never agreed and still strove to build her own career, now achieving great success.<br/><br/>“It seems you have already made your decision. I will come to find you. You mustn’t tell her about this thing, and it’s best not to tell her you can practice cultivation,” Zhou Xue spoke seriously.<br/><br/>Fang Wang asked in surprise, “How will you find me?”<br/><br/>“I haven’t been idle these years; just continue with your planned cultivation,” Zhou Xue said spiritedly.<br/><br/>Seeing her smile, it seemed her progress over the years had been considerable.<br/><br/>Fang Wang felt pleased to see her happy, and his own mood brightened.<br/><br/>The two discussed other matters, talking for several hours as they always did.<br/><br/>Following that night, Fang Wang began to study the fusion technique wholeheartedly without revealing anything about his cultivation to Yang Lin’er.<br/><br/>Life on Earth was calm as still water, and time passed quickly.<br/><br/>…<br/><br/>Seven years later, the year 2039 arrived.<br/><br/>On this clear morning, Fang Wang finally achieved enlightenment.<br/><br/>Merging Lingxiao Divine Sect practices with the Jiu You Freedom Technique was the most energy-consuming task he had undertaken, but fortunately, he succeeded.<br/><br/>Accompanied by a dizzying familiar feeling, his consciousness arrived within the Heavenly Palace.<br/><br/>Fang Wang immediately began cultivating the new secret technique, full of anticipation for it, so he was not afraid of spending long years on it.<br/><br/>He was prepared to enter seclusion for tens of thousands of years!<br/><br/>Time within the Heavenly Palace flew by rapidly, with one year passing like a day. Fang Wang moved continuously, his figure flickering, and occasionally caused the environment of the Heavenly Palace to shift, truly as if he were traversing through different worlds.<br/><br/>This was the strength of the Heavenly Palace, giving Fang Wang the sense of truly crossing through worlds. It was not merely environmental changes; it also encompassed the shifts in the laws of heaven and earth. Moreover, each new world brought him a different sensation, and he even felt what it was like to face the barriers of The Upper Realm.<br/><br/>Even with the mastery of Great Perfection in Lingxiao Divine Sect and Jiu You Freedom Technique, cultivating this technique remained difficult.<br/><br/>To reach minor completion, it took him two thousand years.<br/><br/>To reach Great Completion, eight thousand years passed!<br/><br/>From Great Completion to Great Perfection, Fang Wang felt as if there was no end in sight.<br/><br/>He repeatedly envisioned various situations where he might face dire predicaments, and at those times, this technique would be his strongest trump card. With this belief, he persevered, cultivating earnestly.<br/><br/>At last.<br/><br/>The Great Perfection Realm, he finally reached it!<br/><br/>In the moment he attained Great Perfection, Fang Wang was flooded with limitless enlightenment.<br/><br/>“`<br/><br/>After a long time,<br/><br/>he slowly opened his eyes, still inside the Heavenly Palace. He turned his head and saw, this cultivation session had taken a total of twenty-eight thousand seven hundred years!<br/><br/>Unconsciously, Fang Wang had become too lazy to count the years in tens.<br/><br/>On the foundation of the Great Perfection Lingxiao Divine Sect and the Jiu You Freedom Technique, it still took so many years, which showed the power of this technique.<br/><br/>The new technique not only retained the advantages of the Lingxiao Divine Sect and Jiu You Freedom Technique, but it also derived more abilities.<br/><br/>He felt that with this technique, he could stand invincible!<br/><br/>“Let’s call it The Heaven of Carefree Freedom,”<br/><br/>Fang Wang murmured to himself. As his words fell, the Heavenly Palace crumbled, and he opened his eyes, returning to reality.<br/><br/>At this moment, the entire world looked different in his eyes.<br/><br/>He saw many bizarre and mysterious lines that constructed this world, which must be the force of rules.<br/><br/>Not just the world, even people were made up of various different lines, with even finer dots of light. From the vast universe to a single mortal, everything seemed so complex.<br/><br/>Fang Wang lightly stamped his right foot, using the special power of The Heaven of Carefree Freedom to brand the rules of this Mortal Realm, a mark only perceivable by those who wielded The Heaven of Carefree Freedom.<br/><br/>From then on, no matter where he went, he would be able to sense the direction of this realm.<br/><br/>Not only that, Fang Wang could even feel that many gazes were spying on this realm.<br/><br/>The Heaven of Carefree Freedom had enhanced his perceptive abilities, a truly wonderful creation.<br/><br/>Fang Wang stepped towards the door, while simultaneously sending a message to Xiao Zi, who was far away in Europe.<br/><br/>Upon reaching the courtyard and feeling the baptism of sunlight, he couldn’t help but raise his arms, enjoying the sunlight of this realm.<br/><br/>In reality, it was just a moment, but in fact, he had been locked away for over twenty-eight thousand years. Only he understood the feeling of it being like a lifetime ago.<br/><br/>“It’s time to leave,”<br/><br/>Fang Wang murmured to himself. He had been on Earth for so many years. Though he created two entirely new secret techniques, his cultivation had grown very slowly, still not reaching the second layer of the Sky-Stepping Realm.<br/><br/>He was almost five hundred years old; he could not afford further delays.<br/><br/>He had thought about spending a lifetime with Yang Lin’er, but now there was no need.<br/><br/>For he had already sensed Zhou Xue’s aura.<br/><br/>Zhou Xue had really come!<br/><br/>And she had been here for more than a day; she arrived half a year ago, but most of the time, her aura was hidden, only detectable by Fang Wang when she was close to Yang Lin’er.<br/><br/>Although unclear about what Zhou Xue was up to, he trusted that she wouldn’t act recklessly.<br/><br/>Before long, Xiao Zi descended from the sky, landing on Fang Wang’s shoulder, curiously asking, “Are you really prepared to leave?”<br/><br/>“Haven’t you had enough fun?” Fang Wang retorted.<br/><br/>Xiao Zi cleared her throat and said, “I’ve had my fill, indeed it’s time to leave. Here, my cultivation grows too slowly.”<br/><br/>Fang Wang didn’t continue the conversation, instead, he took a white garment out of the Dragon Jade Ring, swapped clothes in the blink of an eye, and stored his modern attire in the Dragon Jade Ring, which also contained many technological products.<br/><br/>“Hold tight,” Fang Wang said softly.<br/><br/>Xiao Zi’s dragon claws instinctively tightened around Fang Wang’s shoulder as he lifted his right foot and took a step forward.<br/><br/>In an instant, the world dramatically changed. Xiao Zi, startled, widened her dragon eyes only to find they were in the midst of forests and mountains, with a crimson Firmament overhead dotted with many floating islands.<br/><br/>Fang Wang’s right foot then fell.<br/><br/>Xiao Zi only felt an overwhelming surge of Spiritual Energy coming from all directions.<br/><br/>This place was definitely not Earth!<br/><br/>Fang Wang next lifted his left foot and stepped forward. The world transformed once again, the red Firmament vanished, replaced by a blue sky. Sea breezes now faced them, fluttering Fang Wang’s white garment.\t\t\t\t\t\t</div>", "images": {}, "success": true}