{"id": 378, "url": "https://www.novelhall.com/i-became-an-immortal-on-mortal-realm-32879/14918629.html", "title": "Chapter 368 - Chapter 368: Chapter 365: Immortal’S Composure, Killed With A Single Punch", "volume": 4, "volume_title": "Volume 4", "body": "<h1>Chapter 368 - Chapter 368: Chapter 365: Immortal’S Composure, Killed With A Single Punch</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 368: Chapter 365: Immortal’s Composure, Killed with a Single Punch<br/><br/>Facing Fang Wang’s palm, Ji Rutian once again felt the suffocating feeling he had long missed. He had never been timid, no matter how strong the enemy, but only in the face of Fang Wang did he find it truly difficult to muster his courage.<br/><br/>Ji Rutian gritted his teeth, and suddenly, with a hysterical roar, he shouted, “Fang Wang! Why won’t you let me go? From Xuanzu’s World to this Qi Yun’s World, why are you everywhere?”<br/><br/>“You steal my fate, snatch my life, now only I remain of the Ji Family, and still, you refuse to let me go. If that’s the case, then kill if you must, why demean me!”<br/><br/>At this moment, Ji Rutian resembled a lion at the end of its road, angry and in despair, causing Duan Tian to zone out.<br/><br/>He had never seen Ji Rutian so desperate.<br/><br/>Was there really no chance for survival?<br/><br/>That was what Duan Tian thought to himself, and he couldn’t help but look at Fang Wang, whose profile was so cold, his white robe fluttering, revealing an immortal’s grace.<br/><br/>If there really were immortals in the world, they must look like this, right?<br/><br/>Duan Tian couldn’t understand why such an idea suddenly popped into his mind; even he found it absurd.<br/><br/>Intuition told him there might be a chance for life.<br/><br/>He didn’t have such deep hatred for Fang Wang as Ji Rutian did, so he could stay calm to analyze. If Fang Wang had intended to kill them, why would he have saved them?<br/><br/>Fang Wang stared at Ji Rutian and calmly said, “Aren’t you mistaken? It’s not that I’m holding a grudge against you; it’s you who crossed me first. You aided demons to ravage other Mortal Realms, slaughtering the innocents, and now you come to this realm posing as a savior. Do you think you can atone for your sins? Can you really live with yourself?”<br/><br/>“Me, holding a grudge against you? Heh, at first, I just sent people to recruit you. It was those fools who were arrogant, looking down upon you. Not only did they disparage you, but when things went south, they blamed me, although they were the ones who asked me to approach you. What about Heaven’s Larceny Saint Sect? Back then, how many people had no choice but to join Heaven’s Larceny Saint Sect? Did you wipe them all out?”<br/><br/>“Are you sure that after I joined Heaven’s Larceny Saint Sect, I really did go on to slaughter the innocents?”<br/><br/>Ji Rutian shouted angrily, venting the frustration he had long repressed.<br/><br/>He said through gritted teeth, “I admit, I Ji Rutian am not a good person; I will do whatever it takes for my own goals, but I have never bullied the weak. I joined Heaven’s Larceny Saint Sect simply to gain the power of the Saint Spirit. Fang Wang, I had indeed felt your presence near the Great Saint’s Grotto-Heaven, and at that time, I could have crushed you, but I didn’t. Only after you got stronger did I start to scheme against you.”<br/><br/>“I don’t regret the things I’ve done; I just couldn’t predict how fast you would grow!”<br/><br/>As he spoke, he also realized something.<br/><br/>This didn’t seem like the Fang Wang he knew.<br/><br/>In his memory, Fang Wang was decisively lethal. If he intended to kill someone, he never bothered with right or wrong.<br/><br/>This was also why he feared Fang Wang: the man was too ruthless when delivering the killing blow, never hesitating.<br/><br/>Just as a glimmer of hope began to surface in Ji Rutian’s heart, Fang Wang’s right arm suddenly shifted to the side.<br/><br/>With a boom!<br/><br/>A golden light attacked from the far reaches of the earth, raising dust wherever it passed. In the blink of an eye, it reached Fang Wang, who erupted with overwhelming Yang Energy, surging skyward. The flames of Yang Energy formed a massive barrier, shielding Ji Rutian and Duan Tian, and blocked the golden light that resembled a mighty river.<br/><br/>Fang Wang’s hair fluttered as he looked to the side without changing expression and said, “Ji Rutian, you’ve been driven to such an extremity by such people; do you still think you can compete with me for the Heavenly Dao?”<br/><br/>Ji Rutian stopped trembling, took a deep breath, and tried to calm himself.<br/><br/>Duan Tian quickly said, “Senior, the Saint Dynasty controls the Mortal Realm; the Demon Venerable who previously slaughtered the innocents was the demon pet of the former emperor of the Saint Dynasty. The Saint Dynasty let the Demon Venerable massacre the other dynasties and then acted to suppress it, thereby gaining the hearts of the people. We never anticipated that my master would act and kill the Demon Venerable, enraging the emperor, who in shame, hurled accusations at us and pursued us relentlessly!”<br/><br/>Fang Wang clenched his right hand, and the golden light in front of him instantly dissipated.<br/><br/>Following Fang Wang’s gaze, a man in golden attire was stepping forward through the wilderness a hundred miles away.<br/><br/>True Soul Realm cultivation!<br/><br/>Moreover, he wasn’t an ordinary practitioner of the True Soul Realm, but likely had reached beyond the seventh level!<br/><br/>His body was filled with sin and Karmic Force!<br/><br/>If this person was indeed the Saint Emperor of the Saint Dynasty, then what Duan Tian said was true.<br/><br/>Karmic Force cannot deceive people!<br/><br/>With every step the man in golden clothing took, a Golden Dragon True Soul coalesced behind him. After nine steps, nine dragons writhed impressively, their aura unmatched.<br/><br/>Figures descended from the sky, hovering behind the man in golden clothing. Among these people, there were both men and women, all wearing purple robes embroidered with different beasts. There were twelve in total, each wielding their unique Lifespirit Treasures, and they began to cast spells, continuously imprinting palm seals into the back of the man in golden clothing.<br/><br/>“You have yet to declare your name, yet you wish to rescue someone from my hands. Aren’t you a bit too confident?”<br/><br/>The man in golden clothing spoke, his voice indifferent yet filled with authority.<br/><br/>Fang Wang gazed at the man in golden clothing and calmly asked, “Are you the Saint Emperor?”<br/><br/>“Indeed, I am!”<br/><br/>“Then there’s no mistake.”<br/><br/>Fang Wang glanced at Ji Rutian and asked, “You want me to help you against him? Shouldn’t you show some sincerity first?”<br/><br/>Upon hearing this, Ji Rutian’s face fluctuated between shades of clouds and sunshine.<br/><br/>At that moment, the Saint Emperor made his move again. He raised his palm and swept it toward Fang Wang. With this gesture, a vast expanse of Spiritual Power burst forth from the earth like a golden ocean, its momentum magnificent. From this golden ocean, numerous Golden Dragons surged out. From a high vantage point, the land was instantly painted with gold.<br/><br/>Boom, boom, boom—<br/><br/>Fang Wang’s Yang Energy resisted the golden onslaught. The giant dragons, as large as mountain ridges, couldn’t break through the Yang Energy, and they furiously gnawed instead.<br/><br/>Fang Wang glanced at Ji Rutian, seemingly not taking the Saint Emperor seriously at all.<br/><br/>Ji Rutian’s face fluctuated, as he understood the intent behind Fang Wang’s gaze.<br/><br/>The Saint Emperor in the distance changed expression slightly. He leapt up, leading the twelve Purple-Robed Cultivators to attack Fang Wang together.<br/><br/>Their speed was astonishing. Their Qi ignited into flames, resembling a meteorite falling from beyond the heavens, attacking with a tyrannical force. Outside the coverage of the Yang Energy, the earth shattered, rocks flew, and dust waves reached hundreds of feet high. The impact swept across all directions visibly, blanketing the entire continent.<br/><br/>Duan Tian opened his mouth in disbelief.<br/><br/>He could feel the Saint Emperor’s momentum, incredibly strong, yet such a powerful being couldn’t prevail over the mysterious man before him?<br/><br/>He suddenly understood why his master feared this person so much.<br/><br/>Truly unfathomable!<br/><br/>The Saint Emperor frowned and began casting spells rapidly. Divine Skills rained down ceaselessly, constantly altering the landscape of the earth. Even the surrounding space was rapidly transforming.<br/><br/>Ji Rutian’s face shifted between clouds and sunshine, as he clenched his hands inside his sleeves.<br/><br/>He took a deep breath and with a thud, he knelt down on one knee.<br/><br/>He lowered his proud head and said solemnly, “Please, Heavenly Dao, save us, master and disciple! We are willing to join Wangdao, and follow the Dao Master as our leader!”<br/><br/>The corner of Fang Wang’s mouth lifted slightly, and he then glanced at Duan Tian, saying, “Junior, do you wish for me to kill them with a single punch?”<br/><br/>Upon hearing this, Duan Tian subconsciously answered, “Of course…”\t\t\t\t\t\t</div>", "images": {}, "success": true}