{"id": 377, "url": "https://www.novelhall.com/i-became-an-immortal-on-mortal-realm-32879/14918628.html", "title": "Chapter 367 - Chapter 367: Chapter 364: Duan Tian’S Panic", "volume": 4, "volume_title": "Volume 4", "body": "<h1>Chapter 367 - Chapter 367: Chapter 364: Duan Tian’S Panic</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 367: Chapter 364: Duan Tian’s Panic<br/><br/>Years went by.<br/><br/>Nine years had passed since he helped Yang Lin’er with her Spiritual Refinement. Fang Wang had finally reached the third layer of the Sky-Stepping Realm.<br/><br/>His age had also crossed the threshold of five hundred.<br/><br/>One day, Fang Wang opened his eyes, stood up, and woke Xiao Zi, who was not far away.<br/><br/>Xiao Zi opened her eyes and flew to Fang Wang’s side, asking, “Master, are you ready to leave?”<br/><br/>“Before we leave, there is a place we should go to, perhaps an opportunity awaits,” Fang Wang said.<br/><br/>As he cultivated within the city, more and more Great Cultivators were attracted to the place. Having just made a breakthrough, he thought it was best to change locations.<br/><br/>He had calculated that Ji Rutian would encounter a great opportunity, so he decided to check it out first.<br/><br/>Meeting an acquaintance from another world, especially an old enemy from the past, how could he not be concerned?<br/><br/>Upon hearing this, Xiao Zi immediately climbed onto Fang Wang’s shoulder, and together, the man and dragon disappeared from the spot.<br/><br/>The Heaven of Carefree Freedom was not only a method to traverse space but also a type of Divine Skills for teleportation. With it, Fang Wang could teleport long distances as long as he locked onto the target direction.<br/><br/>Meanwhile, on the other side of the world.<br/><br/>An endless wasteland was bombed into ruins, dust filling the sky. Thunderclouds loomed above, and countless Flying Swords glowing with intense light hung upside down, forming a massive circular Sword Array with a diameter exceeding a hundred miles. The number of Flying Swords was no less than a million.<br/><br/>Above the wasteland.<br/><br/>Ji Rutian held a long sword, standing proud and upright, his white robes splattered with blood swaying in the wind.<br/><br/>Behind him stood a young man, the once plain-clothed youngster. He now wore a tight, black outfit and held a Broad Sword in one hand. His angular face was filled with determination, showing no fear of the daunting Sword Array above.<br/><br/>Following their gaze, large numbers of Cultivators could be seen on the horizon in every direction.<br/><br/>“Ji Rutian, I am mindful of your exceptional talent and your past deeds of saving lives. If you would bow your head, there might still be hope for you to live after atoning for your crimes!” a commanding voice thundered through heaven and earth, laden with an oppressive tone.<br/><br/>Ji Rutian smiled, tilting his head to look at his disciple behind him, he asked, “My disciple, are you afraid of death?”<br/><br/>“Afraid of death? If I were, I wouldn’t be Duan Tian!” the young man in black said gravely, his eyes filled with murderous intent.<br/><br/>Ji Rutian’s left hand rested behind his waist, gathering Spiritual Power into a mysterious seal in the palm of his hand.<br/><br/>Duan Tian asked, “Master, before I die, I still want to ask you one question. Why did you name me Duan Tian? Your name is Rutian, and mine is Duan Tian; it’s quite unsuitable, isn’t it?”<br/><br/>He turned his head to look at Ji Rutian, grinning playfully, no longer exuding the fierce aura from before.<br/><br/>Ji Rutian replied, “In my family, only one person from each generation can live, so I named you Duan Tian, hoping you could surpass me or perhaps die at my hand.”<br/><br/>Duan Tian was taken aback for a moment, then couldn’t help but chuckle, “Master, you really don’t lie, nor are you afraid to chill your disciple’s heart.”<br/><br/>“You had already guessed it, hadn’t you?”<br/><br/>“But Master, although I am not afraid to die, I still do not wish to die. Let’s fight with all we have. There’s no good ending for being a prisoner. If we’re lucky, we might just be possessed, and if we’re unlucky, it’s worse than death,” Duan Tian stated, licking the blood from the corner of his mouth.<br/><br/>With his left hand raised slightly and pressing gently towards the ground, the desolate land instantly cracked open with complex fissures revealing lava, as if the ground could split open at any moment.<br/><br/>Duan Tian raised the Broad Sword in his hand, placing it before his eyes, as the Sword Blade emitted strands of Sword Qi.<br/><br/>When both men stimulated their Spiritual Power, the Sword Array in the sky began to quiver. Each Flying Sword trembled violently as the vast Sword Qi covered the Sea of Thunderclouds. The immense Sword Intent shrouded the whole world, changing the color of the sky at the horizon as if auroras were descending from the heavens, connecting sky and earth.<br/><br/>“It seems you’ve run into quite the trouble.”<br/><br/>A voice suddenly reached Ji Rutian’s ears, startling him into a subconscious glance. Immediately after, his pupils shrank rapidly as he leapt aside, creating a distance of thirty feet.<br/><br/>Duan Tian was scared by his master’s action, and couldn’t help but turn his head to look, only to see a man in white standing behind them, an exceedingly handsome man with a Purple Dragon perched on his shoulder, tilting its head to look at him.<br/><br/>Duan Tian raised his sword, wary of Fang Wang, while also turning his gaze to his own master. He noticed his master seemed like a completely different person.<br/><br/>For the first time, he saw panic on his master’s face.<br/><br/>Confronting the Demon Venerable Cang, his master had never frowned, and facing the current dead-end situation, his master showed no fear. So why was he so afraid of this man?<br/><br/>“You… how can this be…”<br/><br/>Ji Rutian asked with a trembling voice, his eyes wide open, and even his forehead opened a vertical eye, all three filled with bloodshot, while large beads of cold sweat overflowed from his face, dripping like rain.<br/><br/>Fang Wang watched him with a smile, both dressed in white, yet the aura they presented was entirely different.<br/><br/>For the first time, Duan Tian felt his master was so vulnerable, which made him even more wary of Fang Wang.<br/><br/>“Who are you?”<br/><br/>Duan Tian asked with a deep voice. Could this man be the Emperor of the Saint Dynasty?<br/><br/>No, that couldn’t be right. His master had never feared the Emperor, even scorned him, as evidenced by the voice that had previously urged surrender—belonging to the Emperor!<br/><br/>Is there truly a presence in this world more frightening than the Emperor of the Saint Dynasty?<br/><br/>At that moment, the Sword Array in the sky erupted, a tremendous Sword Qi plunging down as if the sky were collapsing. Before the Sword Qi had even struck, a terrifying Sword Intent capable of suppressing everything arrived, instantly forcing Duan Tian to his knees, his knees bursting with blood.<br/><br/>Ji Rutian channeled his energy to resist, allowing him to remain steady. He ignored the Sword Array above and kept his gaze fixed on Fang Wang.<br/><br/>Fang Wang raised his right hand and reached towards the sky.<br/><br/>The booming heavens instantly calmed down, the Sword Array overhead simply vanished, and even the Sea of Thunderclouds was wiped away, followed by sunlight spilling down upon Duan Tian.<br/><br/>Duan Tian looked up, his entire being falling into a daze.<br/><br/>Ji Rutian was the same, his body beginning to tremble.<br/><br/>“Gentlemen, do me a favor and disperse, or you will die,” Fang Wang’s voice followed, his tone casual. There was clearly no killing intent, yet as he wiped away the Sword Array, countless Cultivators in the distance were terrified, all of them stunned as if turned into wooden chickens, unable to believe their own eyes.<br/><br/>Fang Wang ignored the gaze of the Saint Dynasty Cultivators, looking towards Duan Tian, he asked, “In your eyes, what kind of person is your master?”<br/><br/>Hearing this, Duan Tian snapped back to reality, subconsciously replying, “My master is the most powerful… my master is a great benevolent person, who has saved countless lives several times, he is a good man!”<br/><br/>Confronting the mysterious and fearsome Fang Wang, he could not apply the words “the most powerful” to Ji Rutian.<br/><br/>“Then do you know what your master is pursuing?” Fang Wang continued.<br/><br/>Duan Tian hesitated, longing to say his master was committed to saving the people of the world, but facing Fang Wang’s gaze, he found himself unable to lie.<br/><br/>An unprecedented panic enveloped his heart.<br/><br/>“Fang Wang, if you want to kill someone, kill me, but spare my disciple!” Ji Rutian said gravely.<br/><br/>He thrust his sword into the ground, adopting the posture of surrender.<br/><br/>Fang Wang lifted his right hand, facing Ji Rutian across the distance, and said softly, “Ji Rutian, who do you think is stronger, you or the Sword Array just now?”\t\t\t\t\t\t</div>", "images": {}, "success": true}