{"id": 370, "url": "https://www.novelhall.com/i-became-an-immortal-on-mortal-realm-32879/14913877.html", "title": "Chapter 360 - Chapter 360: Chapter 357: Xuan Yuan Divine Transformation Great Perfection!", "volume": 4, "volume_title": "Volume 4", "body": "<h1>Chapter 360 - Chapter 360: Chapter 357: Xuan Yuan Divine Transformation Great Perfection!</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 360: Chapter 357: Xuan Yuan Divine Transformation Great Perfection!<br/><br/>Fang Wang gazed at the distant light and shadow, wondering about the identity of the other party, and responded, “My pursuit? It is to seek the lost arts of all realms and follow the elusive Path of Immortality.”<br/><br/>“Elusive?” the light and shadow asked.<br/><br/>Fang Wang replied, “How so? Is not the Immortal Divine even more elusive?”<br/><br/>The light and shadow chuckled lightly and then said, “You have already obtained one of my ultimate arts. What do you think of it?”<br/><br/>Xuandu Great Saint!<br/><br/>Fang Wang, narrowing his eyes, asked, “Is the Xuandu The Book of Changes your ultimate art?”<br/><br/>“Correct.”<br/><br/>Upon hearing this, Fang Wang’s thoughts stirred. The other party saw him as a junior from the Mortal Realm and, in their eyes, he was unaware of where the Immortal Divine resided, nor did he know their true identity.<br/><br/>Fang Wang hastily bowed in respect and said, “This junior has rashly cultivated your ultimate art and hopes you will not take offense.”<br/><br/>The Xuandu Great Saint chuckled heartily, “No worries, junior. Would you like to cultivate other ultimate arts? If you promise me one thing, I will impart them to you.”<br/><br/>“May I ask what it is?”<br/><br/>“To stop the cultivation trend from emerging on Earth, to keep them on the path of technological advancement,” Xuandu Great Saint answered.<br/><br/>Fang Wang frowned upon hearing this.<br/><br/>He had considered many possibilities but never expected that Xuandu Great Saint did not want Earth to pursue cultivation.<br/><br/>He had thought that those who strove to create demon beasts were orchestrated by Xuandu Great Saint.<br/><br/>Fang Wang asked, “Why?”<br/><br/>Xuandu Great Saint let out a melancholy sigh, “You should sense the desolation of this mortal realm. Rarely does a mortal realm fall into such a state, and in fact, this is already a better case, for many other realms no longer exist. Cultivation only brings disaster; it is a matter of personal fate and should not be imposed upon the entire Mortal Realm. Doing so violates the Heavenly Dao and incurs heavenly punishment.”<br/><br/>“I traded my existence for a chance of life for the Mortal Realm, yet the will of the people prevails. There are always those who wish to revive the way of cultivation. I cannot directly interfere, as I cannot come to this realm, so I can only entrust the task to you.”<br/><br/>Fang Wang remained silent.<br/><br/>The Xuandu Great Saint continued, “Since you triggered my prohibition, I have been paying attention to Earth. I cannot capture your essence, but the actions of your Demon Pet reflect your attitude. Also, with your strength upon arriving on Earth, you could do as you please, yet Earth has not drastically changed, so you are restrained and not a great evil person. That’s why I revealed myself.”<br/><br/>“It must be said, junior, that your fortune is strong. If you had not exercised your power and leaked your essence, I would have been unable to find you.”<br/><br/>Hearing this, Fang Wang nodded in agreement and said, “Very well, I will restrain the development of cultivation in this realm before I leave.”<br/><br/>As for the desires of mortals, he could not concern himself with so much; one must take a stand.<br/><br/>The Xuandu Great Saint raised his right hand and pointed across the void. A beam of light streaked across the cosmic starry sky and rapidly approached Fang Wang.<br/><br/>Fang Wang reached out and grabbed, seizing a ball of light. Looking up, he saw that Xuandu Great Saint had already vanished.<br/><br/>Gently dispersing the ball of light, myriad sparks enshrouded him. He remained vigilant in his heart as he accepted these sparks.<br/><br/>They contained instructions for the cultivation of a Divine Skill!<br/><br/>When Fang Wang had sorted it out, he instantly entered the Heavenly Palace.<br/><br/>Gazing upon the majestic halls within the Heavenly Palace, Fang Wang was silent for a long time.<br/><br/>Cultivate!<br/><br/>Without another word, Fang Wang began to practice this Divine Skill.<br/><br/>This Divine Skill was called Xuan Yuan Divine Transformation, able to create indistinguishable clones that also possessed a certain combat power of the original. The number of clones increased with the cultivator’s mastery of Xuan Yuan Divine Transformation.<br/><br/>The skill was not overly complicated.<br/><br/>It took Fang Wang just thirty years to learn it, but to reach Great Perfection took considerable effort.<br/><br/>With the Xuan Yuan Divine Transformation at the Great Perfection Realm, one could create limitless clones, even allowing clones to act in one’s stead, as long as his Spiritual Power was ample, and the opponent would struggle to distinguish between the clones and the original.<br/><br/>The avatar lacked independent thought, creating an avatar was equivalent to gaining additional eyes and senses.<br/><br/>After a total of two thousand five hundred years!<br/><br/>In these two thousand five hundred years, Fang Wang had also enhanced his consciousness and Primordial Spirit, as controlling many avatars depended on the power of the soul.<br/><br/>Fang Wang opened his eyes, hesitated for a moment, and started to meditate and cultivate.<br/><br/>First, cultivate the Heavenly Dao Infinite Book of Changes!<br/><br/>The Heavenly Dao Infinite Book of Changes still allowed Fang Wang’s body to cultivate autonomously, gathering Qi at a speed far surpassing the past. Not only that, but should any Spiritual Power approach him, it would automatically be absorbed unless he intentionally stopped the Heavenly Dao Infinite Book of Changes.<br/><br/>As he began to practice, the entire universe was drawn into an immense display of Heavenly Might.<br/><br/>This Heavenly Might also affected Earth.<br/><br/>Boom!<br/><br/>In East Sea City, a bolt of thunder struck, followed immediately by a downpour, plunging the entire city into a state of oppression.<br/><br/>Yang Lin’er turned her head to look out the window, which was instantly blurred by the heavy rain.<br/><br/>The thunder was so sudden that it startled her, but fortunately, she was alone in the office.<br/><br/>She thought for a moment, took out her cell phone to call Fang Wang, but the display showed that he was out of the service area, which puzzled her greatly.<br/><br/>For some reason, she felt an inexplicable panic, always sensing that Fang Wang was about to leave her.<br/><br/>The two had been in love for so many years, yet she always felt a sense of unease because she couldn’t see through Fang Wang, didn’t even understand him.<br/><br/>After thinking it over, she immediately got up to pack her things, intending to go find Fang Wang.<br/><br/>The sudden downpour made the city seem somewhat chaotic, causing traffic jams on the roads and hastening the pace of the citizens. Some peoples’ umbrellas were even blown away.<br/><br/>Yang Lin’er drove out of the underground parking lot, but after just a few hundred meters, she was stuck in traffic, waiting anxiously.<br/><br/>The heavy rain lasted for two full hours, and Yang Lin’er was stuck for two hours.<br/><br/>When she finally got out of the car, the rain had started to ease.<br/><br/>She hurried upstairs and took the elevator to Fang Wang’s house.<br/><br/>After entering the electronic code, she walked into the living room and saw a familiar figure, which made her sigh with relief.<br/><br/>At that moment, Fang Wang stood in front of the floor-to-ceiling window, hands in his pockets, lost in thought.<br/><br/>“The rain’s really heavy; I’ve been in East Sea City for so many years and this is the first time I’ve encountered this…” Yang Lin’er said while patting the water stains off her body and approaching Fang Wang.<br/><br/>Fang Wang turned around and said with a smile, “Yes, it’s pretty heavy. But it’s okay, it’s going to stop soon. We won’t have rain this heavy again.”<br/><br/>Yang Lin’er came to his side and remarked, “These years, there’s been more and more talk of doomsday. Yang Jun always sends me strategies for survival in the apocalypse. Seeing the rain like this today, I was really worried that the apocalypse might suddenly arrive.”<br/><br/>Fang Wang raised his hand, wrapped it around her shoulder, and said with a smile, “Don’t worry, there won’t be an apocalypse.”<br/><br/>“Really?”<br/><br/>The rain outside the window was lessening, but the sound of the rain was still loud.<br/><br/>At this moment, Fang Wang was not an avatar, but his true self. He had quickly cycled the Heavenly Dao Infinite Book of Changes once and then returned, using his Spiritual Power to protect Earth, or else it might have been crushed by the Heavenly Might.<br/><br/>At the same time, various countries’ astronomical, meteorological, and geographical societies detected various emergencies, causing international unrest to start brewing.<br/><br/>Even when the torrential rain had completely stopped, those strange occurrences had not ceased.<br/><br/>Only the next morning did Fang Wang withdraw his Spiritual Power and cease to protect Earth, and everything returned to normal.<br/><br/>He turned his head to look at Yang Lin’er, who was hugging him, and his face broke into a smile.<br/><br/>After accompanying you through this lifetime, I will then leave.\t\t\t\t\t\t</div>", "images": {}, "success": true}