{"id": 371, "url": "https://www.novelhall.com/i-became-an-immortal-on-mortal-realm-32879/14915163.html", "title": "Chapter 361 - Chapter 361: Chapter 358: Fang Hanyu’S Pressure, Mortal Realm Myth", "volume": 4, "volume_title": "Volume 4", "body": "<h1>Chapter 361 - Chapter 361: Chapter 358: Fang Hanyu’S Pressure, Mortal Realm Myth</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 361: Chapter 358: Fang Hanyu’s Pressure, Mortal Realm Myth<br/><br/>Azurite seas and blue skies—rows of white cranes swept across the sky, while various Magic Artifacts and flying mounts populated the heavens, and even the sea was dotted with the forms of countless ships.<br/><br/>Clad in flowing blue robes, Fang Hanyu stood on the deck. The ship he was on soared high above, stretching a hundred zhang in length, carrying a multitude of Cultivators and Demons, abuzz with noise.<br/><br/>“Truly spectacular. How many in the Eastern Mortal Realm can host a thousand-year birthday that draws such a crowd?”<br/><br/>“It’s said that King Yu Guang of the Yu Clan is the most talented individual in their history, having broken through to the True Soul Realm a few years ago—reaching the True Soul Realm at a thousand years old truly signifies peerless talent.”<br/><br/>“As of late, there are ever more prodigies rising, with the Saint Clans and Imperial Clans beginning to send their young into the world—I wonder whether they seek fame, or have other schemes in mind.”<br/><br/>“Naturally, they’re vying for Fate. The stronger the opponents you defeat, the louder your renown, the greater your Fate, which is crucial to becoming a Saintly Emperor Certification!”<br/><br/>“Strong as King Yu Guang may be, what is he compared to Tiandao Fangwang?”<br/><br/>Fang Hanyu listened to the murmurs behind him, his gaze unchanged, as if he didn’t know Fang Wang well.<br/><br/>Gazing out with his Absolute Heart Evil Eye, he saw a massive floating city on the horizon, with many floating islands circling it, guests streaming in from all directions.<br/><br/>“Kid, the Yu Clan is not simple—their foundation is immensely strong, tracing back to the era of the Hongxuan Emperor. Surely your master isn’t leading you into harm?”<br/><br/>The voice of the Ten Thousand Year Sword Spirit echoed in Fang Hanyu’s mind.<br/><br/>Hearing this, Fang Hanyu mentally replied, “If my master wanted to harm me, there would be no need for subterfuge. Moreover, my Absolute Heart Evil Eye senses a peculiar power that can enhance my blood eyes.”<br/><br/>Fang Wang had already become a half-legend in the Mortal Realm. Zhou Xue had even succeeded to the position of the Demon Monarch, becoming the Leader of the Jin Xiao Sect. Being one of the trio from the Fang Family, he felt an urgency inside—he didn’t want to be left further behind by Fang Wang and the other.<br/><br/>Moreover, Zhou Xue mentioned that the long-absent Fang Zigeng had also undergone a great change and even had the potential to vie with the world’s heroes for grand Fate, which was an additional stimulus for him.<br/><br/>It wasn’t just these peers that pressured him—the Fang Family was bursting with talent. Not to mention Fang Bai and Fang Jing, it was said that another unparalleled genius born with a Lifespirit Treasure had emerged in the last fifty years.<br/><br/>Reflecting on this, Fang Hanyu felt no jealousy, but his competitive spirit spurred him to strive.<br/><br/>Since ancient times, those who have left a mark on eternity, who among them has not faced immense hardships and dangers?<br/><br/>Even someone as strong as Fang Wang had fought his way to renown!<br/><br/>If he feared danger, then his achievements would likely be limited!<br/><br/>Boom—<br/><br/>A tremendous roar sounded from behind Fang Hanyu. He turned his head to look and saw a rolling sea of flames sweeping over from the edge of the sky. Within that inferno soared a colossal phoenix, atop whose head stood two figures.<br/><br/>“Hong Xian’er of the Grand Yu Divine Dynasty and Tai Xi Fairy of the Suzhen Palace—they’ve actually come too!”<br/><br/>Someone exclaimed, leading to further discussion.<br/><br/>Speaking of these two proud daughters of heaven, it was inevitable to mention Fang Wang. It was rumored the reason why Fang Wang staunchly defended the Grand Yu Divine Dynasty was because of Hong Xian’er.<br/><br/>As for Tai Xi Fairy, she had contributed significantly to Fang Wang’s Dao field, Kunlun, naturally inviting criticism.<br/><br/>Fang Hanyu sensed Hong Xian’er’s aura and secretly marveled.<br/><br/>An insurmountable foe! Hong Xian’er gave him a feeling of invincibility—how much stronger must Fang Wang, who protected her, be?<br/><br/>At the thought of Fang Wang, Fang Hanyu took a deep breath.<br/><br/>It had been over a hundred years since he last saw Fang Wang. His intuition told him that Fang Wang’s progress must be astonishing, perhaps reaching an invincible state in the Mortal Realm.<br/><br/>No, this won’t do!<br/><br/>This opportunity, he must obtain!<br/><br/>Fang Hanyu’s gaze became resolute.<br/><br/>…<br/><br/>Time flies, and ten years have passed.<br/><br/>The year 2032 has arrived.<br/><br/>Under the sunlight, in a standalone villa, Fang Wang was sitting cross-legged in the courtyard, eyes closed, motionless.<br/><br/>At this moment, the courtyard gate opened, and Yang Lin’er, dressed in a black suit, walked in. Wearing a white shirt inside, high heels, and carrying a small bag, she exuded the mature charm of a successful woman. The once greenish tinge had faded, making her appear around thirty, more womanly than ten years before.<br/><br/>She was nearly forty years old.<br/><br/>Seeing Fang Wang in meditation, Yang Lin’er did not greet him but quietly walked into the house.<br/><br/>Although the two had not married, they were effectively husband and wife. Yang Lin’er was not disappointed by Fang Wang’s desire not to have children; she was actually pleased, as she didn’t want children either.<br/><br/>Initially, she was anxious and worried that Fang Wang might leave her one day. However, since Fang Wang accompanied her when she left East Sea City seven years ago to settle in her hometown, she had been completely at ease and believed that this man would stay with her for life.<br/><br/>Her parents had met Fang Wang and had a good impression of him. As for the matter of not having children, her parents didn’t have much of an opinion, because Yang Jun had already had three children, so even when Yang Lin’er grew old, she would have the younger generation to take care of her.<br/><br/>Fang Wang slowly opened his eyes, a strange light flashing within.<br/><br/>Over these ten years, he had been studying the integration of the Jiu You Freedom Technique and the Lingxiao Divine Sect, and now, he felt that he was close to success.<br/><br/>It had to be said that the Xuandu The Book of Changes greatly helped him, deepening his understanding of the universal rules, and giving him a deeper insight into navigating and transporting during his enlightenment.<br/><br/>According to his current plan, as long as the integration was successful, his speed of traversing the heavens and the earth would become faster and faster, and he could also leave marks that would allow him to return to any realm he had visited at any time.<br/><br/>The more Fang Wang thought about it, the more he looked forward to it.<br/><br/>Life on Earth was peaceful and happy, yet Fang Wang inherently loved battle and still yearned to fight the proud children of various realms.<br/><br/>He stood up, preparing to go back inside to find Yang Lin’er.<br/><br/>Nowadays, Yang Lin’er had her own company and was one of the top entrepreneurs in the city, with a family fortune of over ten billion. Their life was very stable, with no current worries.<br/><br/>Just as Fang Wang reached the doorway, he suddenly felt something and turned his head to look up at the sky.<br/><br/>Yang Lin’er came down the stairs to the corridor. While tying her hair with a rubber band, she looked towards Fang Wang outside the door and asked, “Why don’t you come in?”<br/><br/>Fang Wang turned and smiled, “I want to go out to buy some things; I’ll be back soon.”<br/><br/>Without waiting for Yang Lin’er to ask further, he turned and left.<br/><br/>Yang Lin’er wasn’t puzzled and walked into the living room. At that moment, her phone in her trouser pocket rang, and she immediately took it out to answer:<br/><br/>“Sis, I really found a dragon this time. Let your husband answer. I’ve been calling his cell phone all afternoon, and he hasn’t answered…”<br/><br/>Yang Lin’er hung up directly, not bothering with Yang Jun.<br/><br/>Elsewhere.<br/><br/>Fang Wang walked to a road with no surveillance cameras, vanished into thin air, and teleported to the Solar System, then with a flash, moved closer to the center of the Milky Way.<br/><br/>In the central region of the Milky Way, a black vortex hung in the starry sky, expanding continuously. A pair of blood-red eyes emerged within it, spying on this universe.\t\t\t\t\t\t</div>", "images": {}, "success": true}