{"id": 379, "url": "https://www.novelhall.com/i-became-an-immortal-on-mortal-realm-32879/14919876.html", "title": "Chapter 369 - Chapter 369: Chapter 366: The Method Of Becoming An Immortal In The Mortal Realm", "volume": 4, "volume_title": "Volume 4", "body": "<h1>Chapter 369 - Chapter 369: Chapter 366: The Method Of Becoming An Immortal In The Mortal Realm</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 369: Chapter 366: The Method of Becoming an Immortal in the Mortal Realm<br/><br/>As soon as Duan Tian’s voice fell, Fang Wang’s lips curved upward. He drew back his right arm and then threw an uppercut with his right fist.<br/><br/>With that punch, the heavens and earth changed color!<br/><br/>Duan Tian’s eyes widened. Within his pupils, countless black dragons rose, as if flames of black earth had broken through the ground, ready to pierce the firmament.<br/><br/>Everything happened too quickly!<br/><br/>So quickly that the Saint Emperor above and the twelve Purple-Robed Cultivators couldn’t react in time.<br/><br/>Their vast Spiritual Power was torn asunder by the nine ferocious black dragons. In an instant, their figures were swept past by the dragons and ceased to exist.<br/><br/>The Nine Dragons Tyrant Fist stirred a world-shocking whirlwind from the ground, scattering the clouds in the sky until it disappeared above the firmament.<br/><br/>Fang Wang didn’t look up. He withdrew his fist and turned to look at Ji Rutian, saying, “Joining Wangdao isn’t so simple. Do you have any attachment to this mortal realm?”<br/><br/>Ji Rutian knew Fang Wang was strong, but the Nine Dragons Tyrant Fist still frightened him.<br/><br/>His robes billowed violently, and his long hair fluttered, unable to settle for a short while. He lowered his head to meet Fang Wang’s gaze and said, “I am not of this place to begin with, so naturally, I hold no attachment.”<br/><br/>He seemed to remember something and then added, “There is a divine skill in this realm. I have heard the soul of a Great Saint mention that this divine skill belonged to Qi Yun Great Saint, a peerless divine skill with the power to penetrate heaven and earth!”<br/><br/>“Where is it?”<br/><br/>“In the west, the West is where this mortal realm’s strongest sects reside, and their Sect Hierarch is no less powerful than the Saint Emperor.”<br/><br/>“Lead the way.”<br/><br/>“Very well.”<br/><br/>Ji Rutian gave a look to Duan Tian and then raised his hand to summon a pagoda. The pagoda swiftly enlarged, and master and disciple flew into it, with Fang Wang following suit.<br/><br/>The pagoda soared into the sky. Fang Wang stood at the edge of the terrace, feeling the breeze on his face. The commotion from the Nine Dragons Tyrant Fist had not completely subsided, and the Saint Dynasty Cultivators in the distance saw the pagoda flying towards them, hastily dodging and fleeing in panic, not daring to block its path.<br/><br/>Although Ji Rutian and Duan Tian stood on the same level as Fang Wang, they kept a distance of ten steps between them.<br/><br/>Xiao Zi lay on Fang Wang’s shoulder, curiously observing Ji Rutian and Duan Tian.<br/><br/>Seeing Fang Wang silent, Ji Rutian couldn’t help but ask, “How did you come to this realm?”<br/><br/>Fang Wang looked ahead and replied, “To seek out unparalleled secret techniques. What about you?”<br/><br/>Unparalleled secret techniques?<br/><br/>Ji Rutian thought the reason sounded absurd, yet it could be true. Before he had left, Fang Wang had already possessed an invincible edge, and Ji Rutian couldn’t think of anyone who could suppress Fang Wang’s rise.<br/><br/>He hesitated for a moment and said, “Naturally, to avoid you. If I stayed in the same mortal realm with you, I was destined not to seize the greatest fate. My family’s ancestor used a secret technique to bring me to this realm.”<br/><br/>Duan Tian was hearing for the first time that Ji Rutian did not belong to this mortal realm; no wonder so many people were astonished by his master’s sudden emergence.<br/><br/>“Then have you mastered the method to traverse between mortal realms?” Fang Wang smoothly inquired.<br/><br/>Ji Rutian shook his head, saying, “My ancestor is only a remnant soul now. After using the secret technique, he fell into a deep slumber, unless he awakens.”<br/><br/>His eyes shifted, suddenly curious whether Fang Wang possessed such a secret technique.<br/><br/>He thought back to the moment when Fang Wang had suddenly appeared beside him, and even now, the thought made his skin crawl; he hadn’t sensed Fang Wang’s approach at all.<br/><br/>“Striving for the most fate is for the sake of ascension, but why must one ascend? Your ancestor should be a Great Saint and should know that ascension is not so glorious,” Fang Wang said with a serious tone.<br/><br/>Ji Rutian gave a bitter smile and said, “It’s indeed not that glorious, but what should we cultivators do when we reach the pinnacle in the mortal realm? If we don’t ascend, how can we become immortal? If we don’t become immortal, how can we achieve eternal life? Even Great Saints and Great Emperors can’t live forever.”<br/><br/>Fang Wang asked, “If there is a method to become immortal in the mortal realm, would you still ascend?”<br/><br/>Upon hearing this, Ji Rutian immediately replied, “Of course not, but…”<br/><br/>Fang Wang chuckled lightly and said, “I have traveled through countless worlds for this very goal, and I have merged the Cultivation Techniques of several Great Saints, including the Three Great True Cultivations you desire to learn. What do you think, do you want to learn them?”<br/><br/>Ji Rutian was stunned, asking cautiously, “Really?”<br/><br/>Fang Wang arched an eyebrow at Duan Tian and said, “Both of you, master and disciple, accept this together. If interested, you can practice them in the future.”<br/><br/>Having said that, he lifted his right hand, with two fingers probing forward.<br/><br/>His fingers were as fast as lightning, so fast that Ji Rutian couldn’t react in time.<br/><br/>The moment Fang Wang’s power entered Ji Rutian’s body, Ji Rutian thought to himself, “Damn, I’ve been careless!”<br/><br/>Both mentor and disciple shuddered, and their eyes then became vacant.<br/><br/>Xiao Zi couldn’t help but ask, “Young Master, are you really going to teach them? Isn’t this Ji Rutian your enemy?”<br/><br/>Fang Wang replied, “Is there no one among the ranks of Wangdao who was once my opponent? Besides, Ji Rutian has indeed turned to the good.”<br/><br/>In his previous life, Ji Rutian was among the Ascenders, and after ascending, he was able to thrive, even earning the admiration of the Zhou Xue of the former life. It would be a pity to kill such a talent.<br/><br/>Of course, if Ji Rutian had continued to oppose him, he would not have shown mercy. He was giving this guy a chance now only because of Ji Rutian’s role as a savior.<br/><br/>Xiao Zi looked at Fang Wang’s profile and was filled with emotion.<br/><br/>There was actually someone as perfect as the Young Master in the world.<br/><br/>In anyone else’s hands, such talent as the Young Master’s might have been a disaster for the Mortal Realm.<br/><br/>The pagoda continued to move forward, with Fang Wang controlling it for Ji Rutian at a not-too-fast speed.<br/><br/>While flying, Fang Wang was making calculations about the West.<br/><br/>The Xuandu Book of Changes was the Great Saint’s secret technique, and Fang Wang had practiced it to the point of Great Perfection, even advancing it to create the stronger Heavenly Dao Infinite Book of Changes. Even if there were Cultivators in the West with deductive abilities, they couldn’t compare to him.<br/><br/>He had a vague sense that there was indeed a powerful secret technique hidden in the West, but he couldn’t pinpoint exactly where.<br/><br/>After a while.<br/><br/>Ji Rutian was the first to come to his senses. He blinked, his eyes becoming clear, and his complexion changed. He looked at Fang Wang and asked, “Are you really willing to teach me such a profound Cultivation Technique?”<br/><br/>Fang Wang did not look at him directly and casually answered, “You should understand Wangdao and have investigated my actions. This isn’t the first time I’ve imparted a supreme cultivation technique. You can rest assured that I won’t scheme against you in this regard. I even welcome you to challenge me in the future.”<br/><br/>Ji Rutian was shocked by his magnanimity.<br/><br/>Even the usually proud Ji Rutian felt a sense of inferiority at that moment, not in terms of strength, but in terms of courage and vision.<br/><br/>“What is the name of this technique?”<br/><br/>“Heavenly Dao Immensity Scripture.”<br/><br/>Fang Wang did keep something back, but he was not narrow-minded. Even just the Heavenly Dao Immensity Scripture would be enough for Ji Rutian to cultivate for many years.<br/><br/>Repeating the name to himself and recalling the intricacies of the technique, Ji Rutian’s eyes became fervent.<br/><br/>This technique was even stronger than his Zhou Tian Daoist Skill!<br/><br/>Duan Tian also woke up and was even more excited than Ji Rutian.<br/><br/>If he could master the various methods of this technique, he would have the capital to look down upon the world!<br/><br/>He lifted his eyes to Fang Wang, his gaze burning with enthusiasm.<br/><br/>Seeing the look in his disciple’s eyes, Ji Rutian couldn’t help but smile wryly, then followed up with a question, “There will inevitably be conflicts when we go to the West in search of Divine Skills. How should we act?”<br/><br/>Fang Wang, looking ahead, replied calmly, “What conflicts? Just walk right in.”<br/><br/>“How would they hand over the Great Saint Legacy? Even if you offer this technique in exchange, they might not agree without understanding it.”<br/><br/>“No worries, I just need to clench my fist, and they will smile and present the Divine Skills.”<br/><br/>Ji Rutian paused, taken aback.<br/><br/>Damn!<br/><br/>Is this guy for real?<br/><br/>But… following someone like him, why does it feel so exhilarating?\t\t\t\t\t\t</div>", "images": {}, "success": true}