{"id": 376, "url": "https://www.novelhall.com/i-became-an-immortal-on-mortal-realm-32879/14917436.html", "title": "Chapter 366 - Chapter 366: Chapter 363: Merits, Fang Wang’S Contingency Plan", "volume": 4, "volume_title": "Volume 4", "body": "<h1>Chapter 366 - Chapter 366: Chapter 363: Merits, Fang Wang’S Contingency Plan</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 366: Chapter 363: Merits, Fang Wang’s Contingency Plan<br/><br/>Fang Wang was quite curious about Ji Rutian’s appearance in this realm, so he began to deduce Ji Rutian’s fate.<br/><br/>The Xuandu The Book of Changes endowed Fang Wang with an extraordinary ability to divine the future, which became even stronger after the creation of the Heavenly Dao Infinite Book of Changes.<br/><br/>He made a calculation with his fingers, and his expression turned odd.<br/><br/>Such tremendous merit!<br/><br/>Every heaven and earth has its own rules, and all fate and karmic forces come together as the Heavenly Dao. Taking lives leads to the victims’ resentment and karmic entanglement, generating Karmic Force, whereas saving beings earns their gratitude and merit. Thus, to those skilled in the art of prediction, one’s goodness or wickedness can be judged through their merit and Karmic Force.<br/><br/>Merit and Karmic Force counteract each other. If a person has only Karmic Force, it means they’re burdened with deep sins. If one possesses only merit, it might not mean they never do evil, but to this world, they are a great benefactor.<br/><br/>Fang Wang then calculated that Ji Rutian would soon face a life and death tribulation.<br/><br/>Not this battle, but the death tribulation that will come after the execution of Demon Venerable Cang.<br/><br/>He stopped pondering and continued his cultivation.<br/><br/>In a corner of the grand hall, Xiao Zi seemed to sense something, lifting her dragon head to gaze into the distance, lost in thought.<br/><br/>And so, another year passed.<br/><br/>One afternoon, Fang Wang opened his eyes, revealing a peculiar light.<br/><br/>He divined once more, a smile appearing on his face as he murmured to himself, “Unexpectedly, after my successful cultivation, you’re the first to undergo Spiritual Refinement. Since that’s the case, I shall lend you a helping hand.”<br/><br/>He immediately began to initiate the Heavenly Dao Infinite Book of Changes.<br/><br/>The Heavenly Dao Infinite Book of Changes contained not only the characteristics of the Heavenly Dao Immensity Scripture and Xuandu The Book of Changes, but it also developed other effects. From then on, any being that cultivated a part of the mental methods from the scripture would be able to connect with him.<br/><br/>Prior techniques like Heavenly Dao True Skill and Heavenly Dao Xuan Gong were not enough; at the very least, one must cultivate the Heavenly Dao Immensity Scripture to resonate with him.<br/><br/>This resonance allowed Fang Wang to transfer a portion of his strength to the cultivators.<br/><br/>He created this feature to aid his inheritors, as well as to leave a lifeline for himself.<br/><br/>He did not want to rely on bloodlines to secure a way out and instead set his sights on cultivation techniques.<br/><br/>Of course, he had no intention of seizing another’s body, and his thoughts were more focused on achieving this through the continuous integration of cultivation techniques.<br/><br/>Meanwhile, in another world.<br/><br/>Within a monastery.<br/><br/>Clad in purple robes, Yang Lin’er was sitting cross-legged in the center of the courtyard, surrounded by dozens of people—the same passengers from before. They had all become younger, including Yang Lin’er and Yang Jun, who now looked merely seventeen or eighteen years old.<br/><br/>At that moment, Yang Lin’er was undergoing Spiritual Refinement. The surging Spiritual Energy poured into her, eliciting exclamations of amazement from the onlookers.<br/><br/>Yang Jun clenched his fists, his gaze towards Yang Lin’er filled with fervor.<br/><br/>The Spiritual Energy gathered above Yang Lin’er’s head, and a phantom figure was taking shape, becoming clearer and clearer. If Xiao Zi were here, she would certainly recognize that this phantom was the figure of Fang Wang.<br/><br/>Sitting atop the eaves, a woman in black, sat in meditation, quietly watching the scene unfold before her. Underneath the White Bone Mask, her eyes sparkled with a strange light.<br/><br/>“Is this a Lifespirit Treasure?”<br/><br/>“Didn’t the Venerable say that a Lifespirit Treasure is equivalent to a Magical Artifact? How did she manage to shape a person out of it?”<br/><br/>“I’m not sure, but I can feel that this figure contains a powerful strength.”<br/><br/>“I wonder when we will be able to undergo Spiritual Refinement.”<br/><br/>“I didn’t expect her to be the first one to succeed in Spiritual Refinement; she truly brings honor to us women!”<br/><br/>The people around were buzzing with discussion, all envious of Yang Lin’er, but there was no mockery. Everyone harbored beautiful dreams.<br/><br/>Yang Lin’er looked up and saw Fang Wang’s figure. She was not surprised, because the Spiritual Refinement was based on her thoughts, and she wanted to shape a Fang Wang to soothe her longing and even prevent herself from forgetting him.<br/><br/>The path of Cultivation was immensely long. After six years of practice, she had just succeeded in Spiritual Refinement. To become an Immortal, one would have to think in terms of thousands of years, and by the time she returned, Fang Wang would have long turned to white bones. However, she did not despair.<br/><br/>If she truly became an Immortal, even if she had to search through thousands of reincarnations and worlds, she was determined to find Fang Wang.<br/><br/>She thought of the dinner they had together, where she talked with Fang Wang about cultivating in their next lives. She had said that she would become strong and then dote on Fang Wang. Now the opportunity had come, and she was full of fighting spirit.<br/><br/>“She has succeeded in Spiritual Refinement, and the rest of you are still not cultivating. If anyone fails to achieve Spiritual Refinement within ten years, don’t blame me for being unkind.”<br/><br/>The voice of the woman in black startled everyone, prompting them to immediately disperse and return to their rooms to cultivate.<br/><br/>Yang Lin’er followed suit, closing her eyes to continue her Spiritual Refinement.<br/><br/>“The technique you are cultivating isn’t mine,” said the woman in black, sending a chill up Yang Lin’er’s spine as she opened her eyes in alarm.<br/><br/>When she first started cultivating, she had instinctively practiced the Qi Gathering method from the Heavenly Dao Immensity Scripture and succeeded, so she continued with it.<br/><br/>She was always wary of the woman in black, feeling that she had ill-intentions.<br/><br/>“It’s alright, just continue practicing like this,” said the woman in black in her next sentence, making Yang Lin’er breathe a sigh of relief.<br/><br/>However, this event made Yang Lin’er even more wary of the woman in black.<br/><br/>…<br/><br/>The setting sun hung over the mountains. On a cliff, two figures sat by a fire, one of whom was Ji Rutian.<br/><br/>Dressed in white robes, Ji Rutian looked the same as before—handsome and young—but with a few more strands of white hair on his head, giving him an air of gravity.<br/><br/>Sitting opposite him was a young man in plain clothes, with a Broad Sword half a zhang tall next to him, its hilt adorned with a piece of Green Jade.<br/><br/>“Master, where are we going?” asked the young man in plain clothes, his brows furrowed with worry.<br/><br/>Without opening his eyes, Ji Rutian said, “To the West, in search of the strongest Divine Skills in the world.”<br/><br/>“Why is the Saint Dynasty pursuing you, even though you slew the Demon Venerable Cang?”<br/><br/>“Perhaps the Demon Venerable Cang was raised by the Saint Dynasty itself.”<br/><br/>“Damn it, Master. We must inform all the common people of this truth. The emperor is heartless—we have to expose their vile deeds.”<br/><br/>“There’s no need. Your master is not yet a match for the emperor, and revealing the truth would be in vain. Even if everyone believed us, what could they do to the emperor? Why plunge the whole world into turmoil and unease?”<br/><br/>“But Master is clearly a hero of the human race, and to end up in such a situation—I can’t accept this. What is wrong with this world?”<br/><br/>“In this life, a person must constantly face hardships. The stronger one is, the more trials they will encounter. Your master once met someone who, no matter how strong the enemies, how numerous they were, or how little the world thought of him, he always managed to break through adversity with his own strength.”<br/><br/>As Ji Rutian spoke, he opened his eyes and gazed towards the horizon, his eyes tinged with a trace of melancholy.<br/><br/>“Master, who is this person you speak of? You are recognized as the greatest talent of ancient and modern times, and this is the first time I’ve heard you speak so highly of someone,” the young man in plain clothes asked curiously.<br/><br/>Ji Rutian didn’t answer, continuing to gaze into the distance, lost in thought.<br/><br/>Seeing that his master did not wish to speak, the youth did not press further.<br/><br/>He reflexively touched the Broad Sword beside him, his eyes filled with determination. He, too, wanted to become the man his master spoke of, to sweep away all with his own strength!\t\t\t\t\t\t</div>", "images": {}, "success": true}