{"id": 375, "url": "https://www.novelhall.com/i-became-an-immortal-on-mortal-realm-32879/14917435.html", "title": "Chapter 365 - Chapter 365: Chapter 362: The Path To Becoming An Immortal, It Really Is Him", "volume": 4, "volume_title": "Volume 4", "body": "<h1>Chapter 365 - Chapter 365: Chapter 362: The Path To Becoming An Immortal, It Really Is Him</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 365: Chapter 362: The Path to Becoming an Immortal, It Really Is Him<br/><br/>Yang Lin’er felt as if she had just woken from a sleep, uncertain of how long she had slept for. Even before opening her eyes, she felt a splitting headache.<br/><br/>Struggling, she opened her eyes and was greeted by the chaotic cabin. Oxygen masks dangled from every seat, and sparks of electricity sporadically burst from the overhead panels.<br/><br/>Yang Lin’er turned her head and saw Yang Jun slumped in his seat, his forehead bleeding, which prompted her to hurriedly check on his condition.<br/><br/>Fortunately, Yang Jun was still breathing and had not died. She gently tapped on his shoulder, trying to wake him up.<br/><br/>Soon, Yang Jun finally regained consciousness. He too had a splitting headache but was luckily able to communicate.<br/><br/>The other passengers in the cabin gradually woke up. After confirming that Yang Jun was alright, the siblings unbuckled their seat belts and followed the other passengers towards the exit of the plane.<br/><br/>“Why is there no signal…”<br/><br/>A girl with disheveled hair cried out while holding her phone, her voice choked with emotion. No one answered her, as the others were equally confused, a sense of unease spreading among them.<br/><br/>The plane had crashed, yet they were still alive?<br/><br/>Why were there no rescue teams?<br/><br/>Why was it so quiet outside the cabin?<br/><br/>As Yang Lin’er and Yang Jun stepped out of the cabin, they, like everyone else, were stunned. They found themselves halfway up a mountain, with the plane having skidded to a halt on its slope, and several hundred-meter-long scars on the terrain were a startling sight.<br/><br/>Looking around, formidable mountains and lush forests provided a beautiful landscape, but this scene made all the passengers feel an unreal sensation.<br/><br/>Where was this place?<br/><br/>Just like the others, Yang Lin’er took out her phone. She wanted to call Fang Wang’s number, but the call wouldn’t go through; there was absolutely no signal.<br/><br/>Yang Jun was equally anxious, even forgetting his own injuries.<br/><br/>Before long, the atmosphere on the hillside grew even more anxious.<br/><br/>Thud—<br/><br/>A bell tolling in the distance caught everyone’s attention, making them turn to look. On the opposite hillside, they saw a monastery with wisps of cooking smoke arising.<br/><br/>“Did anyone see that monastery just now?” asked someone cautiously.<br/><br/>Once this was asked, no one dared to claim they had seen it.<br/><br/>“Let’s go take a look, maybe we’ve landed deep in the mountains,” suggested a man in a suit, pushing up his glasses.<br/><br/>This suggestion was met with unanimous agreement, and they began to descend the mountain, heading towards the monastery across from them.<br/><br/>As Yang Jun walked, he looked around excitedly.<br/><br/>“We’ve traveled through time! It must be time travel! There’s no place like this on Earth, and the air here is too unbelievable. I’ve never breathed such fresh air in Africa, America, Europe, or Australia—it’s amazing!”<br/><br/>Yang Jun trembled with excitement as if having an episode.<br/><br/>Upon hearing this, Yang Lin’er’s brows furrowed, and fear was evident in her eyes.<br/><br/>Her intuition told her that what Yang Jun said might be true. After all, having started her own business for so many years and traveled abroad on business trips, she found the air here oddly peculiar. Just taking one breath made her feel rejuvenated.<br/><br/>Her fear did not stem from facing an unknown world after potentially traveling through time; her fear was not being able to see Fang Wang again.<br/><br/>She hadn’t expected that her only intention of finding the sickly Yang Jun, who insisted on seeking dragons, would result in a plane crash on their return trip. The more she thought about it, the more frightened she became.<br/><br/>She paid no attention to Yang Jun and continued to dial Fang Wang’s number, over and over again.<br/><br/>Half an hour later.<br/><br/>Yang Lin’er followed Yang Jun, stepping into the monastery.<br/><br/>The inside of the monastery was full of dead leaves, as if it had not been cleaned for many years. Spider webs hung in every corner of the walls, making everything seem utterly desolate.<br/><br/>As the last passenger entered the monastery, with a loud bang, the doors of the monastery closed by themselves, shocking everyone into turning their heads to look.<br/><br/>Before they could react, the trees outside the monastery shook violently, as if a storm had suddenly struck. A howling wind rose, sounding like the wailing of ghosts and the howling of wolves. Soon after, a woman screamed as a vast swath of black fog rose up, enveloping the entire monastery.<br/><br/>“`<br/><br/>“What is that?”<br/><br/>“Are there ghosts?”<br/><br/>“How could that be… Everyone be careful!”<br/><br/>“Oh my God… What should we do? What should we do?”<br/><br/>“This temple is haunted!”<br/><br/>All the passengers were in a panic, even the excited Yang Jun was frightened, and the temple quickly fell into darkness, as if suddenly transitioning from day to night.<br/><br/>Thud!<br/><br/>Another bell tolled, startling everyone to look back, only to see a dark figure appear on the eaves of the temple at some point, shaped like a woman, wearing the White Bone Mask, and under the rolling black mist, appeared like a fierce ghost, causing everyone to step back.<br/><br/>“Quiet down, or I will make you disappear,”<br/><br/>the voice of the woman in black rose, her tone indifferent, filled with a sense of oppression.<br/><br/>Everyone felt a suffocating pressure in their chests, extremely uncomfortable, and were all forced to kneel on the ground, including Yang Lin’er and Yang Jun, completely unable to resist.<br/><br/>Facing such oppression, no one naively thought they were being played with, but believed that they had encountered ghosts or had gone through a time warp.<br/><br/>“You are unfortunate, yet also fortunate; unfortunate because you have been chosen by me, destined to say goodbye to the dull life of a mortal, but fortunate because being chosen by me, you have the chance to pursue immortality, to become an Immortal,”<br/><br/>the voice of the woman in black rose again, her words filled with profound meaning, causing everyone’s hearts to feel like they were being thrown into tumultuous waves.<br/><br/>Yang Jun and some of the younger passengers revealed looks of surprise and delight.<br/><br/>“This is no longer the Earth you know. The chance of you returning is basically impossible, unless you can become Immortals,” the woman in black said solemnly, and at the same time, the pressure she radiated lessened.<br/><br/>Yang Lin’er quickly asked, “Why us?”<br/><br/>Her question voiced what most of the people wanted to ask.<br/><br/>“So, it is your luck, which can also be called destiny. Anyway, I have chosen you,” the woman in black answered, leaving Yang Lin’er feeling extremely frustrated.<br/><br/>An old man wearing a floral shirt asked cautiously, “How can we become Immortals, and how long will it take to achieve it?”<br/><br/>The woman in black calmly answered, “I will teach you the methods of Cultivation. If you want to become Immortals, you will have to strive for it for the entirety of your life; even if you have outstanding talent, it is impossible to become an Immortal without a thousand years.”<br/><br/>A thousand years!<br/><br/>Yang Lin’er felt as if struck by lightning, and she was not the only one; many were terrified, and some even broke down on the spot, weeping bitterly.<br/><br/>“I do not pity you; not all of you will survive. Either you will become ghost slaves crafted by others, or you will step on others to continually advance. Mortals, whether you come to thank or hate me, you have already lost the right to the cycle of reincarnation and rebirth!”<br/><br/>The words of the woman in black became chilling and terrifying, making everyone feel a cold shiver up their spine.<br/><br/>Yang Lin’er clenched her cellphone in her hand, took a deep breath, and tried to calm her emotions.<br/><br/>…<br/><br/>Inside a great hall, Fang Wang was sitting in meditation within a pool, having already reached the second level of the Sky-Stepping Realm, and he was continuing his attempt to break through to the third level.<br/><br/>Five years had passed since he arrived in this world.<br/><br/>During that time, he had contacted Zhou Xue, who told him that she had made arrangements, but she couldn’t share the details with him just yet, fearing they could distract him from his Cultivation.<br/><br/>Fang Wang trusted Zhou Xue, so he didn’t press further.<br/><br/>On this day.<br/><br/>Fang Wang suddenly opened his eyes as he sensed two powerful auras of battle coming from a distance.<br/><br/>One of the auras felt familiar to him, like one he had faced before.<br/><br/>So it really was him!<br/><br/>Ever since Fang Wang had heard of Ji Rutian, he had been trying to recall his memory, and he could determine that one of the distant fighters was indeed the Ji Rutian he knew.\t\t\t\t\t\t</div>", "images": {}, "success": true}