{"id": 385, "url": "https://www.novelhall.com/i-became-an-immortal-on-mortal-realm-32879/14926073.html", "title": "Chapter 375 - Chapter 375: Chapter 372: The Myth Of Fang Wang And The Origin Of Duan Tian", "volume": 4, "volume_title": "Volume 4", "body": "<h1>Chapter 375 - Chapter 375: Chapter 372: The Myth Of Fang Wang And The Origin Of Duan Tian</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 375: Chapter 372: The Myth of Fang Wang and the Origin of Duan Tian<br/><br/>Fang Zigeng stepped into the Fang Residence, and as he looked around, those blurred memories began to grow clear.<br/><br/>The several Fang Family Disciples who had blocked his way earlier followed behind him, evidently on guard.<br/><br/>Fang Zigeng pointed to a large tree not far off and chuckled, “Back then, Fang Wang loved to take us up that tree. Even though he was younger, we always listened to him because he could climb faster than any of us. From an early age, he was the king of the kids. Perhaps it was then that he started his martial training.”<br/><br/>Fang Wang?<br/><br/>This name made the girl and the other Fang Family Disciples pause in shock.<br/><br/>The girl asked cautiously, “Are you speaking of the Heavenly Dao Ancestor Fang?”<br/><br/>The others became tense as well. The name Fang Wang was the greatest pride of the Fang Family and held the highest status in the family’s genealogy. In the Fang Family, there were even divine statues of him, and every year, the Fang Family Disciples would burn incense and pray that Ancestor Fang would bless their new year.<br/><br/>Fang Zigeng didn’t answer and continued to walk on.<br/><br/>Soon, the current head of the Fang Residence, Fang Mo, came surrounded by a crowd. Wearing a gray robe with a jade crown on his head, his bearing was scholarly, and every gesture emitted the authority of a superior.<br/><br/>When Fang Mo caught sight of Fang Zigeng, his eyes lit up and he immediately stepped forward to greet him.<br/><br/>“Zi Geng, you’re actually still alive. After so many years, I thought…” Fang Mo, holding Fang Zigeng’s hand, was visibly excited.<br/><br/>With a smile on his face, Fang Zigeng said, “I simply survived a great disaster. Let’s go somewhere else to talk, it’s somewhat inconvenient here.”<br/><br/>Fang Mo nodded hastily and, still talking, pulled him away.<br/><br/>“Back in the day, all nine of us from the Fang Family became disciples under the Great Abyss Gate. Now Fang Wang has become a legend, Zhou Xue has succeeded as the Sect Hierarch of the Jin Xiao Sect, and even Fang Hanyu has made a name for himself with his formidable swordsmanship. My talent was modest, and I could only stay with the Fang Family, unable to gain fame and glory with the rest of you in the world. Today, you must share with me your experiences over these years. I feel you must be very strong now, and indeed, among our group, your determination has always been the strongest, even admired by Fang Wang and Zhou Xue.”<br/><br/>Fang Mo didn’t lower his voice, causing quite a stir among the Fang Family Disciples present.<br/><br/>This mysterious white-haired man was actually one of the ancestors who embarked on the path of cultivation with Ancestor Fang?<br/><br/>Everything about Fang Wang had been mythologized, and the status of those related to him within the Fang Family was naturally eminent.<br/><br/>In no time, the name of Fang Zigeng spread rapidly throughout the Fang Residence, and his deeds were unearthed; his great determination inspired the younger generations of the Fang Family.<br/><br/>Even with mediocre talent, as long as one has a resolute heart dedicated to the Dao, it is possible to become a Great Cultivator!<br/><br/>…<br/><br/>As spring left and autumn arrived, another eleven years passed.<br/><br/>Fang Wang’s cultivation reached the Sixth Level of the Sky-Stepping Realm. After his breakthrough, he left the pavilion and walked towards the river.<br/><br/>Xiao Zi and Ji Rutian’s auras were not present, but Fang Wang wasn’t worried about them. This Mortal Realm wasn’t as powerful as Qi Yun’s World; it was enough for them to shake everything up.<br/><br/>At the moment, Duan Tian was practicing with his broad sword by the riverside, his eyes closed in deep contemplation.<br/><br/>When Fang Wang approached him, Duan Tian still didn’t notice.<br/><br/>“Do you enjoy practicing with the sword?” Fang Wang suddenly spoke, startling Duan Tian so much that he trembled and hastily turned to salute Fang Wang.<br/><br/>As he was about to kneel, Fang Wang lifted his hand to support him and smiled, “No need for such courtesy, nor for nervousness. Talk to me about your Dao; don’t miss out on this opportunity.”<br/><br/>Hearing this, Duan Tian became excited and began to explain his own Sword Dao.<br/><br/>As a child, Ji Rutian allowed him to choose a magical artifact, and his eyes were immediately drawn to a broad sword. He originally thought he liked the Sword Dao, but later he realized his aptitude for swordsmanship was mediocre. He just liked the dominance of the broad sword, so he switched to practicing sword techniques, and to his surprise, he progressed rapidly.<br/><br/>After listening, Fang Wang pondered and said, “Think carefully, is it the sword that you like, or the domineering sense of splitting everything with a single slash?”<br/><br/>Without hesitation, Duan Tian replied, “Of course, it’s the unstoppable domineering force. To be honest, I am very interested in the fist techniques of my elder…”<br/><br/>After saying this, he was quite apprehensive, fearing that Fang Wang would take offense.<br/><br/>Fang Wang lifted his right hand, activated the Extinction Divine Force, and a fierce surge of energy burst forth, blowing Duan Tian’s hair and causing his face to sting so much that he couldn’t help but take a step back.<br/><br/>“How does that feel?”<br/><br/>Fang Wang said with a light chuckle, his black hair fluttering, and even Duan Tian, a man himself, found Fang Wang’s beauty to be almost perfect.<br/><br/>Duan Tian took a deep breath and carefully observed the energy in Fang Wang’s palm.<br/><br/>Meanwhile, Fang Wang turned his head towards the horizon, sensing the aura of battle from Ji Rutian. With his left hand behind his waist, he quietly began to deduce Ji Rutian’s actions.<br/><br/>It turned out Ji Rutian was currently forcing his way into a sect, and this was already the fifth sect he had challenged. His way of doing things was similar to Fang Wang’s, unrestrained and unbridled, but without slaughter. He was searching for the strongest ultimate techniques in this realm.<br/><br/>However, he didn’t possess Fang Wang’s strength. Fang Wang had already predicted that many powerful beings were scheming against Ji Rutian, preparing to eliminate him together.<br/><br/>But Fang Wang wasn’t in a hurry. A genius like Ji Rutian needed a desperate situation; only in such circumstances could he awaken even stronger aptitude.<br/><br/>Compared to Ji Rutian, Fang Wang was more concerned about Xiao Zi.<br/><br/>Xiao Zi was in the ocean, enlightening sea demons, and had even established the Dragon Palace.<br/><br/>It was the same back on Earth; Xiao Zi had been cultivating its own demon race forces. At first, Fang Wang thought it was a fleeting whim, but then, in the Mortal Realm, it continued the same behavior, not worried in the slightest that its efforts would go to waste once it left the Mortal Realm.<br/><br/>There was a secret!<br/><br/>Fang Wang could force Xiao Zi to reveal the reason, but he didn’t want to do that. He also wanted to see what Xiao Zi could achieve.<br/><br/>After a long while,<br/><br/>Duan Tian, with a look of difficulty on his face, said, “Senior, I can’t see through anything.”<br/><br/>He felt both embarrassed and hopeless, thinking he was going to miss the opportunity.<br/><br/>Fang Wang didn’t answer him. He lifted his right hand and pressed it directly against Duan Tian’s forehead. Duan Tian’s eyes widened, and before he could react, he closed his eyes.<br/><br/>Extinction Divine Force!<br/><br/>Fang Wang transferred the power of the Extinction Divine Force and the method of cultivation to Duan Tian, allowing Duan Tian to bypass hundreds of years of detours.<br/><br/>“Eh?”<br/><br/>Fang Wang suddenly let out a sound of surprise and turned his head to look at Duan Tian, his eyes revealing a hint of astonishment.<br/><br/>With his eyes closed, Duan Tian’s neck began to show strange blood patterns, and his aura was transforming.<br/><br/>This guy’s bloodline is not simple!<br/><br/>Fang Wang raised an eyebrow, thinking to himself, “No wonder Ji Rutian brought him along; turns out this kid has quite the background.”<br/><br/>As the Extinction Divine Force entered Duan Tian’s body, Fang Wang felt a tremendous surge of fate.<br/><br/>Neither holy nor sovereign—a bit of substance!<br/><br/>Fang Wang’s gaze sharpened as he began to peer into the Underworld.<br/><br/>The scenery of heaven and earth instantly darkened, the rivers remained unchanged, but Fang Wang’s vision had moved to the Underworld.<br/><br/>At this moment, a figure stood behind Duan Tian.<br/><br/>This was a man clad in Silver Armor, whose face bore an uncanny resemblance to Duan Tian, as if they were twins. He stood with scaled boots, a red silk sash with gold threads around his waist, a dragon crown on his head, and his eyes were staring intently at Fang Wang.<br/><br/>Even Fang Wang, as he was now, felt pressure under that gaze.\t\t\t\t\t\t</div>", "images": {}, "success": true}