{"id": 389, "url": "https://www.novelhall.com/i-became-an-immortal-on-mortal-realm-32879/14931310.html", "title": "Chapter 379 - Chapter 379: Chapter 376: The Other Shore Of The Immortal Path", "volume": 4, "volume_title": "Volume 4", "body": "<h1>Chapter 379 - Chapter 379: Chapter 376: The Other Shore Of The Immortal Path</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 379: Chapter 376: The Other Shore of the Immortal Path<br/><br/>“Let’s see, this isn’t something we can choose, the Seventy-Two Immortal Caves are not places one can simply enter at will.”<br/><br/>Yang Lin’er replied, not agreeing to Yang Jun’s suggestion because she knew this youngster too well.<br/><br/>He was simply impulsive, fancying Sword Cultivation today, perhaps Body Cultivation tomorrow.<br/><br/>The others also started to fantasize about their future Cultivation, while Yang Lin’er gazed towards the horizon, a trace of melancholy in her eyes.<br/><br/>This Cultivation world was so formidable; if Fang Wang, who was obsessed with Cultivation, could come here, he would surely be delighted.<br/><br/>Afterward, Yang Lin’er left with her companions, embarking on the quest for the Seventy-Two Immortal Caves.<br/><br/>Above, white birds flew freely, while the mortal realm moved like waves, one after another, seemingly endless.<br/><br/>…<br/><br/>Time flew in the blink of an eye.<br/><br/>Thirty fleeting years passed by.<br/><br/>Fang Wang had successfully reached the Ninth Level of the Sky-Stepping Realm and was preparing to breakthrough to the True Soul Realm in one go, but Xiao Zi’s return interrupted his seclusion.<br/><br/>“Young Master, something terrible has happened!”<br/><br/>Xiao Zi burst into the loft, panic-stricken, and Fang Wang, without opening his eyes, asked, “What happened?”<br/><br/>“Ji Rutian is dead!”<br/><br/>Xiao Zi spoke urgently, and at this, Fang Wang opened his eyes.<br/><br/>Fang Wang did not press for details but started to calculate with his fingers.<br/><br/>Huh?<br/><br/>He really couldn’t foresee the Karmic ties and Fate.<br/><br/>Fang Wang couldn’t help but ask, “Explain in detail.”<br/><br/>Xiao Zi floated in front of Fang Wang and began to recount Ji Rutian’s encounter.<br/><br/>Three years ago, Ji Rutian helped Xiao Zi subdue a Demon King. In a bid for survival, the Demon King revealed the strongest secret technique in this part of the Mortal Realm, hidden in a forbidden area at the edge of the Mortal Realm. It was said that a Great Saint once perished there, his grievance filled the sky, and any living being that entered never returned.<br/><br/>Ji Rutian, not believing in curses, took the Demon King with him.<br/><br/>The Demon King waited outside the forbidden area for three years until a few months ago when Ji Rutian’s head was thrown out from the forbidden area, rolling all the way to the feet of the Demon King, frightening him terribly.<br/><br/>Hearing this, Fang Wang stood up and said, “It’s just a head, how can one confirm life and death, let’s go and see, and call for Duan Tian.”<br/><br/>Xiao Zi nodded and then turned to fly towards the door. Fang Wang followed closely behind.<br/><br/>There was a Demon waiting in front of the loft, a cow Demon, dressed in dark blue heavy armor with fur clasped on the shoulder guard extending to the cape. Its face had transformed into a human’s, but two huge bull horns remained. It stood in front of the loft, not much shorter than the loft itself.<br/><br/>The cow Demon was staring at Duan Tian, who gave it a very eerie feeling. Despite Duan Tian’s low cultivation, this piqued its interest.<br/><br/>“Ready to go, you fool!”<br/><br/>Xiao Zi flew over its head, moving close to Duan Tian, waking him up.<br/><br/>The cow Demon instinctively looked back and saw Fang Wang in black robes walking out of the house, feeling surprised as it couldn’t sense Fang Wang’s presence at all.<br/><br/>It quickly bowed to Fang Wang, saying, “This humble one is named Niu Hai, greeting the senior.”<br/><br/>Fang Wang nodded slightly, not saying much.<br/><br/>Before long, Fang Wang, riding on Xiao Zi, soared away. Niu Hai led the way, standing on a giant iron hoop, with Duan Tian also on it.<br/><br/>“Young Master, this Demon used to be a farmer’s cow. Later on, when the farmer encountered a chance to become an Immortal, it also began Cultivating and became his Demon Pet. However, during one trial, his master died, but through misfortune, he gained a blessing, consuming a ten-thousand-year-old miraculous fruit, which remade his bones and muscles, shooting him up to the heavens. The iron hoop he’s standing on was forged by his master back in the day. This fellow is quite loyal,” Xiao Zi said, introducing Niu Hai to Fang Wang, with a tone full of admiration.<br/><br/>Niu Hai’s cultivation had reached the Divine Passage Realm, and for an ordinary cow to cultivate to such an extent was truly remarkable.<br/><br/>Niu Hai, in this Mortal Realm, counted as a Great Demon King who shook the heavens and the earth. With countless Demon Soldiers under his command, Xiao Zi had gone to great lengths to subdue him.<br/><br/>Fang Wang nodded slightly and said, “He really isn’t bad. After Ji Rutian’s incident, he still obeys your orders.”<br/><br/>Xiao Zi was stunned for a moment, feeling that Fang Wang’s words carried deeper meaning.<br/><br/>Niu Hai, up ahead, also heard this sentence. His demon body became rigid, but he did not turn around.<br/><br/>On the following journey, Fang Wang sat cross-legged on Xiao Zi’s head, continuing his cultivation.<br/><br/>Duan Tian occasionally asked Niu Hai about the situation back then, as he could not believe that Ji Rutian was dead.<br/><br/>Before meeting Fang Wang, Duan Tian felt that Ji Rutian was the strongest; if the sky were falling, Ji Rutian could still hold it up.<br/><br/>Half a month later.<br/><br/>They crossed most of the Mortal Realm and arrived at the entrance of a forbidden zone.<br/><br/>This forbidden zone, in this Mortal Realm, had another name, the Other Shore of the Immortal Path.<br/><br/>Since ancient times, the Great Saint was the pinnacle in mythology, and the place where a Great Saint fell naturally acquired additional significance from all living beings.<br/><br/>Fang Wang opened his eyes and looked ahead. At the end of the vast sea, dense fog covered the sky, with a huge island looming within it. More precisely, it was like a continent where mountains stood like ancient demons, exuding a mysterious and oppressive aura.<br/><br/>“Ahead is the forbidden zone, known by the various dynasties of the human race as the Other Shore of the Immortal Path.”<br/><br/>Niu Hai pointed ahead and spoke, his face filled with fear as if one more glance at the forbidden zone would taint him with ominous misfortune.<br/><br/>Fang Wang stood up, his black robe fluttering in the wind. He took out the Fox Mask from the Dragon Jade Ring and put it on his face.<br/><br/>“Let’s go straight in.”<br/><br/>Fang Wang spoke up, and Xiao Zi immediately sped up.<br/><br/>Niu Hai turned his head to look at Fang Wang, hesitating, and asked, “Senior… I’ve never been inside before, can I really help by going in…?”<br/><br/>“Either die or go in together.”<br/><br/>Fang Wang’s cold voice interrupted Niu Hai, sending a chilling shiver through him that made him quickly turn back and continue leading the way.<br/><br/>“What realm is he really in?”<br/><br/>Niu Hai thought with trepidation. He had heard Xiao Zi boast about Fang Wang’s existence. Although wary, it was only when he actually faced Fang Wang that he felt true fear.<br/><br/>At that moment, he felt that if he uttered a single word of refusal, he would be obliterated.<br/><br/>Now, he could only press on into the forbidden zone.<br/><br/>Soon, they flew into the majestic fog. As soon as they entered a hundred paces, their field of vision began to rapidly shrink, and their spiritual senses were met with a backlash upon contact with the mist.<br/><br/>Xiao Zi was jolted by such a backlash, trembling in dragon form.<br/><br/>“Young Master, are we really going in?” Xiao Zi asked anxiously.<br/><br/>Fang Wang, wearing the Fox Mask, replied, “Let’s go in, Ji Rutian is still alive.”<br/><br/>After entering the forbidden zone, he was able to calculate the karmic ties of Ji Rutian, and he had also deduced other existences, which made him even more curious about the Other Shore of the Immortal Path.<br/><br/>“Still alive?” Xiao Zi was stunned, thinking Fang Wang was after some supreme teachings.<br/><br/>Upon hearing this, Duan Tian immediately breathed a sigh of relief.<br/><br/>Niu Hai, standing in front of Duan Tian, did not turn back, focusing straight ahead.<br/><br/>After traveling for about ten miles, Fang Wang distinctly felt a powerful and bizarre prohibitive force, something even he could not comprehend.<br/><br/>Passing through this restriction gave Fang Wang the sensation of traveling through heaven and earth with the Heaven of Carefree Freedom.<br/><br/>Just as Fang Wang was reflecting inwardly, a dignified voice came:<br/><br/>“You have finally arrived. This time, are you prepared, True God of the Heavenly Palace?”\t\t\t\t\t\t</div>", "images": {}, "success": true}