{"id": 381, "url": "https://www.novelhall.com/i-became-an-immortal-on-mortal-realm-32879/14924904.html", "title": "Chapter 371 - Chapter 371: Chapter 368: One Man Dominates A Sect, First Buddha", "volume": 4, "volume_title": "Volume 4", "body": "<h1>Chapter 371 - Chapter 371: Chapter 368: One Man Dominates A Sect, First Buddha</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 371: Chapter 368: One Man Dominates a Sect, First Buddha<br/><br/>“`<br/><br/>Fang Wang was unaware of Ji Rutian’s shock. After extinguishing the Great Earth Arhat Formation, Xiao Zi excitedly rushed forward, her dragon’s roar resonating through heaven and earth, just like Fang Wang’s imposing manner, shaking the firmament!<br/><br/>Ji Rutian covered Duan Tian with his Spiritual Power, accelerating to catch up with Xiao Zi.<br/><br/>Fang Wang’s white clothes billowed violently, and he fixed his gaze ahead.<br/><br/>At the world’s end, he saw a towering mountain, no less than ten thousand feet high, with a magnificent palace perched on its summit, radiating boundless Buddha light, shining like the sun over this land, illuminating all things in heaven and earth.<br/><br/>At this moment, innumerable figures flew out from the palace like a swarm of bees, all stopping in the air in front of the mountain, ready for battle.<br/><br/>Upon closer examination, they were all Buddha Cultivators, men and women, and even some demonic beings. All the Buddha Cultivators looked in Fang Wang’s direction, their faces filled with shock and fear.<br/><br/>“Who is that person?”<br/><br/>“How is it possible… that he broke the Great Earth Arhat Formation so easily.”<br/><br/>“The person behind him seems to be Ji Rutian, the so-called peerless genius of ancient and modern times, Ji Rutian!”<br/><br/>“What should we do, the Great Earth Arhat Formation was broken before it could be properly formed, with our strength, I’m afraid we can’t stop him.”<br/><br/>“What is there to fear, with the Sect Hierarch here, we’re not afraid even if the sky falls!”<br/><br/>The Buddha Cultivators of the Pursuing Heaven Sect discussed, each condensing their Lifespirit Treasure or taking out their Magical Artifact.<br/><br/>Meanwhile, inside the Pursuing Heaven Palace.<br/><br/>The place was brightly lit, with faint wisps of white mist on the ground, like Immortal energy, hundreds of Buddha Cultivators floating in mid-air, each seated on a lotus pedestal of different colors. In front of the grand hall, a hundred-feet-tall White Jade Buddha sat in meditation, with a lotus pedestal beneath him. The blood surging within the white jade made him seem a touch demonic.<br/><br/>He was indeed the Sect Hierarch of the Pursuing Heaven Sect, the First Buddha!<br/><br/>The First Buddha slowly opened his eyes; although his body was like white jade, his eyes were human.<br/><br/>As he opened his eyes, the Buddhas in the hall followed suit, turning their heads in unison to look.<br/><br/>Boom! Suddenly, the doors shattered, a dragon’s roar exploded, and a Purple Dragon barged in, unstoppable, then shrank in size.<br/><br/>It was Xiao Zi!<br/><br/>Fang Wang stood on Dragon Head, his expression impassive as he looked at the formidable figures of the Pursuing Heaven Sect before him.<br/><br/>Both Ji Rutian and Duan Tian followed closely behind, their faces full of incredulity. Duan Tian even could not help but look back.<br/><br/>They saw the sky outside the hall filled with Fang Wang’s clones. Those clones stopped before the disciples of the Pursuing Heaven Sect, pointing their right index fingers at each disciple’s forehead, rendering them unable to move.<br/><br/>Fang Wang had mastered such a profound Divine Skill of cloning!<br/><br/>With the emergence of this Divine Skill, tens of thousands of followers of the Pursuing Heaven Sect were immobilized, daring not to resist.<br/><br/>Even for Ji Rutian, it was also the first time he had seen such a Divine Skill. Before coming here, he had imagined many scenarios, but he had not thought Fang Wang could suppress the Pursuing Heaven Sect so easily.<br/><br/>“I am Fang Wang. I’ve heard that the Pursuing Heaven Sect possesses the Great Saint Divine Passage, and I have come to learn. If this Divine Passage is genuine, I am willing to offer my ultimate art in exchange,” Fang Wang said, his voice not very loud, but clear enough for everyone to hear.<br/><br/>The First Buddha fixed his gaze on Fang Wang, his expression calm, and asked, “Does the ultimate art in the benefactor’s hands compare to the Great Saint Legacy?”<br/><br/>Fang Wang countered, “Have you heard of the Descending Dragon Great Saint?”<br/><br/>The grand hall became silent.<br/><br/>Seconds later, a burly Buddha Cultivator bellowed angrily, “What Descending Dragon Great Saint? There is only the Qi Yun Great Saint in this world. You think you can easily take our Pursuing Heaven Sect’s ultimate art? It won’t be that simple!”<br/><br/>Boom! He burst forth with his aura, and other Buddha Cultivators did the same, using their force to press down, but Fang Wang’s expression remained unchanged.<br/><br/>Ji Rutian immediately mustered his energy to protect his disciple, his eyes locked on the First Buddha.<br/><br/>His instincts told him that the First Buddha was extremely dangerous!<br/><br/>“`<br/><br/>He was more dangerous than any opponent he had encountered before!<br/><br/>As for Fang Wang, the sense of horror that Fang Wang brought to him was a manifestation of the gap in strength and his own imagination, not something his senses brought to him.<br/><br/>Seeing that the First Buddha remained silent, Fang Wang lifted his right hand and slowly clenched his fist.<br/><br/>Nine Dragons Tyrant Fist!<br/><br/>The terrifying aura caused the entire Pursuing Heaven Palace to shake violently, not just the palace, but even the high mountain, and even the firmament of the Western Heaven began to change color.<br/><br/>All the Buddha Cultivators in the hall changed their expressions drastically, even the First Buddha’s pupils contracted and his brows furrowed, staring fixedly at Fang Wang.<br/><br/>“What? Not enough?”<br/><br/>Fang Wang’s voice followed, booming as the Yang Energy inside him erupted, greatly enhancing the power of the Nine Dragons Tyrant Fist.<br/><br/>At this point, the Buddha Cultivators of the Pursuing Heaven Sect couldn’t withstand it anymore.<br/><br/>Ji Rutian also couldn’t help but widen his eyes, shocked by Fang Wang once again.<br/><br/>The First Buddha’s body ignited with white flames, he was exerting his power to resist, the brunt of Fang Wang’s aura was aimed at him, and he could feel that if Fang Wang were to punch at him, he might not be able to withstand it.<br/><br/>Fang Wang’s gaze turned cold, activating Extinction Divine Force, channeling it into his right fist.<br/><br/>In an instant, the entire Pursuing Heaven Palace crumbled, not just the palace, but even the mountain itself was obliterated.<br/><br/>The hundreds of thousands of Buddha Cultivators floating in the air all widened their eyes, dumbstruck as they looked towards Fang Wang.<br/><br/>What had happened?<br/><br/>No one dared to speak, because Fang Wang’s avatar was still pointing at their foreheads, they could only turn their gazes to the First Buddha, who was their hope.<br/><br/>The First Buddha, still covered in white flames, remained silent, and everyone could see that something was off about his state, because the white flames on his body had stilled.<br/><br/>Upon closer inspection, the First Buddha’s complexion looked very unsightly.<br/><br/>Fang Wang stood on Xiao Zi’s head, slowly lifting his right fist, preparing to swing it at the First Buddha.<br/><br/>“Wait!”<br/><br/>The First Buddha spoke up hastily, as if it took all his strength to utter these two words, and as soon as he spoke, his White Jade Buddha Body began to tremble.<br/><br/>Fang Wang immediately lowered his right fist, and the oppressive aura enveloping the entire world dissipated.<br/><br/>At this moment, everyone, including Ji Rutian and Duan Tian, felt as if a tremendous weight had been lifted.<br/><br/>Only Xiao Zi, under Fang Wang’s feet, did not feel his oppressive aura, and it watched the First Buddha’s pathetic state with interest.<br/><br/>Fang Wang spoke up, “I know my actions are somewhat impolite, but you will not lose your legacy, and you will gain a stronger one; afterwards, you will be grateful to me.”<br/><br/>His words made the faces of the Pursuing Heaven Sect’s adherents unsightly, but no one dared to reproach him.<br/><br/>The First Buddha took a deep breath and said, “I can narrate it to you, how about that?”<br/><br/>“Of course, you can, but don’t deceive me, I can distinguish the true from false, and if I deem it to be fake, I won’t be so cordial.”<br/><br/>“Let’s change the location, then.”<br/><br/>“No need, just say it here, it’s a good opportunity for your followers to also hear about the strongest Divine Skills of the Pursuing Heaven Sect.”<br/><br/>Fang Wang refused, and his words also caused a look of excitement to appear in the eyes of many Cultivators from the Pursuing Heaven Sect.<br/><br/>The high-ranking members of the Pursuing Heaven Sect surrounding the First Buddha’s face changed dramatically.<br/><br/>In the Pursuing Heaven Sect, such legacies were not taught casually, even to their own disciples, who had to make great contributions to deserve them.<br/><br/>The First Buddha’s brows were tightly furrowed, filled with hesitation.<br/><br/>Fang Wang continued, “Don’t worry, how could such Divine Skills allow someone to learn them easily? If someone can directly comprehend them, isn’t that a blessing for your Pursuing Heaven Sect? To uncover a talent that comes once in an epoch.”\t\t\t\t\t\t</div>", "images": {}, "success": true}