{"id": 383, "url": "https://www.novelhall.com/i-became-an-immortal-on-mortal-realm-32879/14924906.html", "title": "Chapter 373 - Chapter 373: Chapter 370: The Western Heaven Meritorious Divine Might Combat Buddha", "volume": 4, "volume_title": "Volume 4", "body": "<h1>Chapter 373 - Chapter 373: Chapter 370: The Western Heaven Meritorious Divine Might Combat Buddha</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 373: Chapter 370: The Western Heaven Meritorious Divine Might Combat Buddha<br/><br/>Fang Wang’s first step had already shocked Ji Rutian and his disciple. Before they could open their mouths, Fang Wang took a second step, and once again the world transformed.<br/><br/>They arrived beneath a vast night sky, a massive lake stretching below them with a diameter of over a hundred miles; around the lake stood a series of connected mountains, which, under the cover of night, looked like towering demons, eerily horrifying.<br/><br/>Just arriving in this mortal realm, Ji Rutian and Duan Tian felt an indescribable chill.<br/><br/>Their instincts told them that this realm was extremely dangerous, and if they stayed here, they were likely to face endless crises.<br/><br/>Fortunately, Fang Wang kept moving, and the mortal realm changed once again.<br/><br/>This time, Ji Rutian was completely certain that Fang Wang possessed the ability to travel through realms, but this was too unbelievable. He thought back to the secret technique used by his ancestor, which required great effort to traverse the mortal realms. How could it be that with Fang Wang, a single step could cross over an entire realm?<br/><br/>Could it be that Fang Wang had already surpassed the ancestor of the Ji Family?<br/><br/>The thought frightened Ji Rutian. He also remembered when he mentioned the ancestor of the Ji Family to Fang Wang, Fang Wang showed no surprise; could it really be as he had guessed?<br/><br/>Unable to help himself, Ji Rutian turned to look at Fang Wang. While the realms kept changing, Fang Wang maintained his pace, his expression unchanged, crossing one mortal realm with each step.<br/><br/>After dozens of steps, Fang Wang stopped. He brought Ji Rutian and the other person to the side of a river, stretched lazily, and said with a smile, “The spiritual energy in this realm is not bad, let’s cultivate for a while before looking for the opportunities this realm holds.”<br/><br/>Ji Rutian couldn’t help asking, “Are you planning to keep searching for the legacies in various mortal realms? You’re not in a hurry to return to Xuanzu’s World?”<br/><br/>“What’s the rush? In that realm, it’s unlikely that any major power would dare to provoke the Wangdao and the Fang Family,” Fang Wang said softly, smiling.<br/><br/>The confidence in his words left Ji Rutian silent.<br/><br/>Fang Wang, not caring for his thoughts, walked along the riverbank and ordered, “Xiao Zi, help me build a loft.”<br/><br/>Upon hearing this, Xiao Zi turned and said, “Hey kid, go build a tower over there.”<br/><br/>Duan Tian was startled for a moment but quickly complied.<br/><br/>“How can you bother someone else like that?” Fang Wang said with dissatisfaction.<br/><br/>Xiao Zi chuckled, “How is it a bother? Having him do a bit more will close the distance between him and the young master, and in the future, the young master might even give him guidance.”<br/><br/>Hearing this, Duan Tian added, “Elder, it’s no problem, it’s a simple task, leave it to me.”<br/><br/>Ji Rutian did not make a sound. He didn’t feel humiliated; after all, he had already decided to follow Fang Wang.<br/><br/>Fang Wang rubbed the Dragon Head, threw it aside, and then turned to say to Ji Rutian, “Wangdao has Twelve Dao Sects. Cultivate well, and I will support you in becoming a Dao Sect in the future. At that time, only I can command you, which won’t disgrace your talent. Also, don’t give up the heart to compete with me just because you think the gap between us is too large. I welcome your challenges anytime; fighting and testing each other is how we can progress together.”<br/><br/>Ji Rutian couldn’t help asking, “Do you think I still have a chance to catch up with you?”<br/><br/>Fang Wang stopped in his tracks and looked at him in astonishment, saying, “Please, wake up. Catch up with me? How could that be possible?”<br/><br/>Ji Rutian was silent.<br/><br/>“However, you’re just not as good as me, that’s all. There is still hope for you to be second in the world. You are the most talented person I’ve seen. With your natural talent, plus the chance to fight and test with me, who is an unprecedented first in the world, aren’t you exceptionally lucky? After all, if you fight other geniuses, it would likely be a life-and-death situation,” Fang Wang said softly, with a smile.<br/><br/>Ji Rutian’s unease was instantly ignited; his eyes shone as he asked, “Am I really the most talented person you’ve seen?”<br/><br/>Xiao Zi, who was not far off, turned her head away, pretending not to hear.<br/><br/>Fang Wang seriously said, “Not everyone can escape from my hands. Ji Rutian, why have you suddenly lost your confidence? Where did the old you, who was so arrogantly confident and believed in destiny, go? I don’t want to see you like this; be confident, no, be arrogant. You’re only not as good as me, but superior to all other beings in the myriad worlds!”<br/><br/>Ji Rutian took a deep breath, and his eyes became sharp.<br/><br/>With a smile, Fang Wang continued on his way.<br/><br/>Ji Rutian didn’t follow him immediately; instead, he began to look back on his past to regain his confidence.<br/><br/>…<br/><br/>Seasons changed, and in the blink of an eye, twenty years hurriedly passed.<br/><br/>In Qi Yun’s Mortal Realm, in the Western Skies, at the Pursuing Heaven Sect.<br/><br/>Inside the great hall.<br/><br/>The First Buddha opened his eyes, filled with a complex mix of emotions.<br/><br/>Over twenty Buddha Cultivators were practicing their cultivation techniques in the hall; sensing something, they all opened their eyes and looked towards the First Buddha.<br/><br/>Taking a deep breath, the First Buddha said, “This cultivation technique is profound and unfathomable. I believe… its value is greater than the Seven Rotations Buddha Body. Fang Wang did not deceive us; he truly wished to exchange his supreme secrets sincerely.”<br/><br/>Upon hearing these words, an uproar ensued amongst the Buddha Cultivators in the hall.<br/><br/>“Is it really that impressive?”<br/><br/>“I’ve also practiced for twenty years; it’s indeed not simple. Although I haven’t mastered it, I can feel the transformative power of this technique.”<br/><br/>“Heavenly Dao Immensity Scripture, to be named after the Heavenly Dao, is truly no trivial matter. How terrifying must Fang Wang’s strength be? Could he be a Great Saint?”<br/><br/>“Don’t even mention it. Such a being has never been born in this world, and we can’t even calculate his fate or karmic ties.”<br/><br/>“Could he be from The Upper Realm? Legend has it that the Qi Yun Great Saint once ascended and became an Immortal.”<br/><br/>The Buddha Cultivators discussed fervently; their impression of Fang Wang shifted dramatically, their tones now filled with reverence.<br/><br/>The First Buddha remarked reflectively, “This is not a calamity for the Pursuing Heaven Sect, but rather a tremendous opportunity. The Pursuing Heaven Sect owes Fang Wang a debt of gratitude. Let us erect a statue in his honor, designate him as the Western Skies Meritorious Divine Warrior Buddha, and let future disciples remember the kindness he showed to the Pursuing Heaven Sect. We could even embellish this story into legend.”<br/><br/>“In the future, should the Pursuing Heaven Sect face adversity, perhaps today’s actions could bring us a glimmer of hope.”<br/><br/>Some Buddha Cultivators wanted to object, but when they thought of Fang Wang activating his Dao Origin Body, they all stayed silent.<br/><br/>Such an entity might indeed be either a Saint or an Immortal. Having practiced cultivation for so many years, they naturally acknowledged the existence of fate and karmic ties. The First Buddha intended to have the Pursuing Heaven Sect benefit from Fang Wang’s fate.<br/><br/>At the same time.<br/><br/>In another Mortal Realm.<br/><br/>Twenty years had passed, and Fang Wang’s cultivation had progressed from the third to the fifth level of the Sky-Stepping Realm.<br/><br/>After practicing the Seven Rotations Buddha Body, his speed of cultivation increased, sparking a bold idea in him.<br/><br/>That was to fuse the Seven Rotations Buddha Body with the Immeasurable Pure Bone Technique. His Dao Origin Body could perceive the rules of heaven and earth, a concept similar to the Immeasurable Pure Bone Technique, giving him at least a bit of insight.<br/><br/>As for the Heavenly Gang Supreme Yang Tyrant Body, he had yet to figure out how to fuse it with the Immeasurable Pure Bone Technique.<br/><br/>After consolidating his cultivation, Fang Wang opened his eyes and sent his divine consciousness into the Dragon Jade Ring to contact Zhou Xue.<br/><br/>He could have asked Zhou Xue how to return to Xuanzu’s World, but he did not do so. He had tasted the sweet fruit of his endeavors.<br/><br/>The Mortal Realms he now explored were weaker than Xuanzu’s World, but they concealed no small amount of opportunities. He could unabashedly claim inheritances, and with no calamities plaguing his pursuit of Wangdao, why should he return?<br/><br/>Soon, Zhou Xue’s divine consciousness resonated from within the Dragon Jade Ring.<br/><br/>Fang Wang’s divine consciousness followed hers into the Illusionary Realm.<br/><br/>Zhou Xue approached him and asked, “What’s the matter? Worried that your little woman will die at my hands?”<br/><br/>Fang Wang glared at her, responding annoyedly, “How could that be possible? I’ve obtained the Great Saint Divine Passage and wish to impart it to you. This Divine Passage is far from ordinary.”<br/><br/>Zhou Xue might not care for other Divine Skills, but the Seven Rotations Buddha Body would surely interest her!\t\t\t\t\t\t</div>", "images": {}, "success": true}