{"id": 384, "url": "https://www.novelhall.com/i-became-an-immortal-on-mortal-realm-32879/14924907.html", "title": "Chapter 374 - Chapter 374: Chapter 371: Beyond Redemption, The Return Of An Old Friend", "volume": 4, "volume_title": "Volume 4", "body": "<h1>Chapter 374 - Chapter 374: Chapter 371: Beyond Redemption, The Return Of An Old Friend</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 374: Chapter 371: Beyond Redemption, The Return of an Old Friend<br/><br/>“Oh? Which Great Saint’s divine skill?”<br/><br/>Zhou Xue asked with interest, watching Fang Wang looking eager to show off, she couldn’t help but laugh.<br/><br/>Fang Wang answered, “Qi Yun Great Saint, do you know of him?”<br/><br/>Upon hearing this, Zhou Xue’s smile disappeared, she narrowed her eyes and asked, “Could you be talking about the Seven Rotations Buddha Body?”<br/><br/>Fang Wang raised an eyebrow, surprised he asked, “You know about this too?”<br/><br/>Is the Upper Realm that small?<br/><br/>“Of course I know, Qi Yun Great Saint holds a high position in the Immortal Court, which is why Qi Yun’s World has been able to exist for so long. Moreover, he specifically set karmic conditions in Qi Yun’s World that prevent later generations from achieving Saintly Emperor Certification,” Zhou Xue nodded and explained.<br/><br/>Fang Wang, curious, asked, “If his status is so high, why doesn’t he favor Qi Yun’s World? Could it be that he fears Qi Yun’s World would betray him?”<br/><br/>Zhou Xue shook her head and said, “This is a celestial rule of the Immortal Court, or perhaps the entire Upper Realm: the Mortal Realm is not allowed to have power that disturbs the Upper Realm to prevent chaos. Any force that threatens the Upper Realm, especially those who do not ascend, will be extinguished. Generally, except when the chance for ascension comes, no being that surpasses the Celestial Qiankun exists in the various worlds. If there are any, it surely indicates that great powers are scheming in the shadows.”<br/><br/>Fang Wang suddenly understood; indeed, that was the case.<br/><br/>It was like this with Xuanzu’s World, too many Great Saints and Great Emperors plotting.<br/><br/>It’s a damn lair of Emperor Saints, kill one and still, their residual souls linger, making them impossible to extinguish.<br/><br/>Frankly speaking, from the perspective of the Upper Realm, Xuanzu’s World is indeed a headache, no wonder they regularly send Immortal Divines to clean it up.<br/><br/>Fang Wang sighed and said, “Are you going to do it too?”<br/><br/>Zhou Xue, with a gleaming gaze, stared at Fang Wang and smiled, “I really can’t do it, but I’ve always wanted to learn. Are you truly willing to pass it on to me? The Seven Rotations Buddha Body is not just a simple divine skill, it also allows one to comprehend the rules of heaven and earth, or even the Supreme Great Dao. Although the Seven Rotations Buddha Body is not as good as Dao bone, it’s still a divine skill that the powers of the Upper Realm pursue. On the path of cultivation, spiritual energy will eventually become ineffective for us, and when that time comes, to improve one’s cultivation, one must comprehend the rules and the Great Dao.”<br/><br/>“I didn’t expect the Qi Yun Great Saint to leave such a divine skill in the Mortal Realm. This guy has big ambitions; he probably harbors thoughts of rebellion.”<br/><br/>As she said this, Zhou Xue’s tone became playful, her eyes twinkling as if she was plotting something.<br/><br/>Fang Wang did not disturb her.<br/><br/>After a while, Zhou Xue spoke, “You should teach me first. Although I don’t have time to cultivate now, I’ll need to cultivate eventually, and I truly can’t refuse this divine skill.”<br/><br/>Fang Wang didn’t waste words and started to transmit the Seven Rotations Buddha Body immediately.<br/><br/>After passing on the divine skill, they didn’t just disperse, instead, they each talked about their experiences over the years.<br/><br/>Zhou Xue had not personally overseen people like Yang Lin’er; she had already returned to Xuanzu’s World, but she had arranged for a female saint to guide Yang Lin’er and the others, which made Fang Wang quite emotional.<br/><br/>Another Great Saint has emerged!<br/><br/>In the future, will Great Saints and Great Emperors be everywhere?<br/><br/>Fang Wang had a premonition that one day, the Great Saints and Great Emperors from the ancient times of Xuanzu’s World might revive one after another, either ushering in an unprecedented golden age or joining forces to oppose the Upper Realm.<br/><br/>No matter which it was, Fang Wang felt an urgent need to become stronger.<br/><br/>He was confident he could sweep through the Celestial Qiankun Realm, but he was unclear about how big a gap there was between him and the true Great Saints and Great Emperors.<br/><br/>He had not yet had the opportunity to spar with a true Great Saint or Great Emperor.<br/><br/>Fang Wang also did not conceal his own experiences. When he heard that Fang Wang had taken Ji Rutian into his Wangdao, Zhou Xue was surprised, but she did not advise against it.<br/><br/>“It seems that the Twelve Dao Sects of Wangdao are not simple. Yang Du, Xu Qiuming, Jiang Shenming, Zhu Rulai, Red Dust Celestial Emperor, Ji Rutian – these people, with your help, will surely surpass their previous achievements in their future, and their potential is in no way inferior to the Great Saints and Great Emperors of the Jin Xiao Sect who have been revived,” Zhou Xue praised.<br/><br/>Fang Wang joked, “If the Jin Xiao Sect encounters trouble after ascending, I will lead the Wangdao and ascend to the Nine Heavens to assist you.”<br/><br/>Zhou Xue laughed, curving the corner of her mouth and said with a smile, “The Upper Realm is not as simple as you think, and moreover, the cost of helping me would be eternal damnation.”<br/><br/>“For me, watching you suffer is an endless catastrophe.”<br/><br/>Fang Wang spoke without hesitation, which made Zhou Xue roll her eyes, but her smile never faded.<br/><br/>After the two left the Illusionary Realm, Fang Wang opened his eyes, stood up, walked out of the room, and stood on the terrace overlooking the river.<br/><br/>He saw Ji Rutian sitting cross-legged in midair above the river, engaging in Qi Gathering to practice his skills.<br/><br/>Fang Wang noticed that Ji Rutian’s method of cultivating bore some resemblance to his own Formless Zhou Tian Technique. Could it be the Zhou Tian Daoist Skill Zhou Xue had spoken of?<br/><br/>He did not interfere; the Heavenly Dao Immensity Scripture was too profound for Ji Rutian to master in a short time. It was normal for him to spend most of his time enhancing his cultivation level.<br/><br/>Fang Wang then looked over at Duan Tian, Ji Rutian’s extraordinarily talented disciple, who was practicing a certain saber technique.<br/><br/>Fang Wang did not disturb Duan Tian; he just watched.<br/><br/>Watching them cultivate on their own held a kind of charm.<br/><br/>It wasn’t until the sun set behind the mountains that Fang Wang finally returned to his room to continue his cultivation.<br/><br/>He was determined to reach the True Soul Realm in this world!<br/><br/>Only after reaching the True Soul Realm would come the Celestial Qiankun Realm.<br/><br/>He had set his goal: he would not return to Xuanzu’s World until he reached the Celestial Qiankun Realm, unless Wangdao or the Fang Family encountered trouble.<br/><br/>…<br/><br/>Descending Dragon Continent, Grand Qi.<br/><br/>Luo State, Yang Hu County, Southern Hills City.<br/><br/>A white-haired Fang Zigeng stood in front of the Fang Residence’s main gate, raising his head to look at the signboard, a trace of nostalgia in his cold eyes.<br/><br/>Dressed in black with a small cauldron hanging from his waist, his white hair in stark contrast to the black clothes drew the attention of the passersby and Cultivators on the street who frequently looked his way.<br/><br/>At that moment, several Fang Family Disciples approached. They felt Fang Zigeng didn’t look like a good person, so they stood in front of him.<br/><br/>“Who are you, and why are you blocking the entrance to the Fang Residence?” A young girl with her hands on her hips demanded loudly, attracting many Cultivators to gather around.<br/><br/>Due to its esteemed status, the Cultivators of Southern Hills City had more or less benefited from the Fang Family; they naturally wanted to help if the Fang Family was in trouble.<br/><br/>Fang Zigeng snapped out of his reverie, revealing a smile and saying, “Can’t I stand in front of my own house?”<br/><br/>His smile was off-putting, more of a sneer than genuine, sending chills down one’s spine.<br/><br/>“Your own house? You also carry the Fang surname? How come I’ve never seen you before?” The girl asked in surprise, and the other Fang Family Disciples looked at one another in confusion.<br/><br/>Fang Zigeng asked, “Who is the head of the Fang Family now? What’s their name?”<br/><br/>Convinced by his tone, the crowd believed him, and the girl hurriedly answered, “It’s Great Grandfather Fang Mo.”<br/><br/>“Fang Mo? I didn’t expect he was still alive.”<br/><br/>Fang Zigeng’s mouth curved slightly, and a look of nostalgia appeared in his eyes.<br/><br/>With that, he stepped toward the Fang Residence’s main gate.<br/><br/>The girl quickly said to the people beside her, “Go inform the family head quickly, tell him an old friend has returned!”<br/><br/>She was not sure, but felt that notifying the family head couldn’t be a bad thing.\t\t\t\t\t\t</div>", "images": {}, "success": true}