{"id": 388, "url": "https://www.novelhall.com/i-became-an-immortal-on-mortal-realm-32879/14929576.html", "title": "Chapter 378 - Chapter 378: Chapter 375: The Seventy-Two Immortal Caves, The Name Of The Sword Sect", "volume": 4, "volume_title": "Volume 4", "body": "<h1>Chapter 378 - Chapter 378: Chapter 375: The Seventy-Two Immortal Caves, The Name Of The Sword Sect</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 378: Chapter 375: The Seventy-Two Immortal Caves, The Name of the Sword Sect<br/><br/>After meeting with Qi Yun Great Saint, another twelve years had gone by, and Fang Wang had successfully reached the Seventh Level of the Sky-Stepping Realm.<br/><br/>He was eager to continue cultivating until reaching the Ninth Level of the Sky-Stepping Realm.<br/><br/>Once he had stabilized his cultivation level, Fang Wang opened his eyes and began to calculate about Xiao Zi and Ji Rutian.<br/><br/>Xiao Zi’s Dragon Palace was becoming increasingly powerful, showing signs of unifying the four seas. Its identity as a True Dragon made it easy to subdue members of the Demon Race. Whenever it encountered a being it could not defeat, it would seek Ji Rutian’s help, fortunately, Ji Rutian was strong enough.<br/><br/>By now, Ji Rutian could contend with those in the Sky-Stepping Realm. Although the Sky-Stepping Realm was not the pinnacle of this world, there weren’t many who were stronger than Ji Rutian, and most of those who were stronger preferred to remain hidden.<br/><br/>Besides helping Xiao Zi, Ji Rutian also made enemies everywhere, often getting gravely injured. Yet, he stubbornly never sought Fang Wang’s help, and surviving from the brink of death several times had greatly advanced his strength.<br/><br/>The more Fang Wang calculated, the more interesting he found it.<br/><br/>This truly was the protagonist of fate, not needing to rely on him.<br/><br/>While Xiao Zi and Ji Rutian did not return, Duan Tian was practising outside every day, never stepping into the pavilions; even when there were violent storms, he could meditate by the river, calm and composed.<br/><br/>Fang Wang looked at Duan Tian and discovered a trace of Extinction Divine Force within him, as well as the aura of Qi Yun Great Saint.<br/><br/>Qi Yun Great Saint had made his move.<br/><br/>This was good; Duan Tian’s rapid growth was also beneficial to Fang Wang.<br/><br/>Fang Wang continued his Qi Gathering cultivation while keeping an eye on Duan Tian.<br/><br/>Duan Tian’s relationship with Qi Yun Great Saint was complex, like that of an avatar, yet Duan Tian possessed independent thought. Fang Wang had considered a blood relation, but he felt strongly that Duan Tian was Qi Yun Great Saint himself.<br/><br/>Ji Rutian also had a Great Saint behind him, and Fang Wang wondered if Ji Rutian’s choice of Duan Tian was part of the calculations between Great Saints.<br/><br/>After watching for a while, Fang Wang continued his cultivation.<br/><br/>Next, he wanted to break through to the Ninth Level of the Sky-Stepping Realm in one go!<br/><br/>From the Seventh to the Ninth Level of the Sky-Stepping Realm might seem like just one small realm apart, but for the vast majority of cultivators in the Sky-Stepping Realm, this was an insurmountable moat.<br/><br/>…<br/><br/>Under the blue sky, the sea was boundless.<br/><br/>On a huge island, countless cultivators and demons gathered in the city, moving in and out. The scene was bustling and splendid.<br/><br/>Yang Lin’er, Yang Jun, and several Earth cultivators were walking on the streets, all stunned by the sights of the city.<br/><br/>A man in green clothes sighed, “This is the real Cultivation World. Look, here we have Treasure Pavilion, Technique Pavilion, Divine Arms Pavilion; it’s just a pity that we don’t have many Spirit Stones.”<br/><br/>Yang Jun took up the conversation, “Our top priority is to find a sect to join. That’s how we’ll earn Spirit Stones.”<br/><br/>The others nodded, full of longing for the future.<br/><br/>“Why don’t we find an inn to stay in? We can also get some information from the innkeeper,” suggested a woman in yellow clothes with an oval face.<br/><br/>Yang Jun laughed, “That’s a great idea. We might as well try the delicacies and wines of the Cultivation World.”<br/><br/>The group agreed and began to look for an inn in the city.<br/><br/>After the time it takes an incense stick to burn, they found an inn and gathered around a large table.<br/><br/>After ordering dishes, Yang Jun asked the waiter about nearby sects that were recruiting disciples, and the waiter enthusiastically began to introduce them.<br/><br/>“Although this sea area is not one of the great seas of the Western Mortal Realm, it has countless sects. The most famous are the Seventy-Two Immortal Caves, with each one forming its own sect. Inside the Seventy-Two Paths of Immortality, there are cultivators from the Mahayana Realm sitting in authority…”<br/><br/>The wait staff prattled on incessantly, and the audience listened intently.<br/><br/>The Mahayana Realm sounded very impressive.<br/><br/>After the server had finished introducing and retreated, the group began to discuss which Immortal Cave to join. Some proposed splitting up so that they could exchange information later, but this suggestion was vetoed by others. More people felt it was best for them to stick together for a greater chance of survival.<br/><br/>Yang Lin’er also chose to stick with the group, mainly because she was worried about Yang Jun.<br/><br/>After the decision was made, everyone fell into silence.<br/><br/>At this moment, laughter came from the other diners nearby, who were discussing the current influential affairs of the world.<br/><br/>“Who exactly is Xu Qiuming? It is said that he comes from the Eastern Mortal Realm to challenge the Sword Cultivators of the Western Mortal Realm, undefeated in a hundred battles.”<br/><br/>“I actually know about him. Xu Qiuming is from one of the Twelve Dao Sects of the Wangdao in the Eastern Mortal Realm, the Sword Sect, and he is a top prodigy there.”<br/><br/>“Wangdao? You mean the Wangdao of the Heavenly Dao?”<br/><br/>“Of course, these years, as the Eastern Mortal Realm and the Western Mortal Realm have integrated, it is mostly the Cultivators of the Western Mortal Realm who have gone to the Eastern Mortal Realm. Few Cultivators from the East have come over and made a name for themselves. It is said that three months ago, when Xu Qiuming passed through this place, all the masters of the Seventy-Two Immortal Caves came to greet him, yet Xu Qiuming didn’t even spare them a glance.”<br/><br/>“Tsk, I would really like to witness the grace of the Sword Sect.”<br/><br/>Hearing their conversation, Yang Jun and the others also became interested.<br/><br/>Yang Jun turned his head and asked with a smile, “Fellow Daoist, what realm is Xu Qiuming in? Has he reached the Nirvana Realm?”<br/><br/>Upon hearing this, the Cultivators who were discussing turned to look at them, followed by a burst of hearty laughter.<br/><br/>Not just these few Cultivators; all the diners in the inn began to laugh as well.<br/><br/>Yang Jun raised an eyebrow. He could feel the ridicule from the people around him, but he wasn’t angry. Instead, he became even more curious about Xu Qiuming and persistently asked, “Everyone, we are new to this place and do not understand matters of the world. May I ask why you laugh?”<br/><br/>One of the Cultivators shook his head with an amused smile and said, “The Nirvana Realm? Even if it were a whole major realm higher than the Nirvana Realm, they wouldn’t be a match for a single sword strike from Xu Qiuming.”<br/><br/>His words were affirmed by the other Cultivators, and they began to recount Xu Qiuming’s victories.<br/><br/>Yang Jun and the others listened with surprise upon surprise, not expecting that the Nirvana Realm was not the apex in the Mortal Realm. They all felt as if they were once again sitting in the observatory looking up at the sky.<br/><br/>Although Yang Lin’er did not speak, she too was shocked.<br/><br/>It seemed that with their current Cultivation levels, surviving in this Mortal Realm was no different from being a regular Mortal.<br/><br/>Yang Jun was very interested in the Wangdao behind Xu Qiuming and inquired further, “Is Xu Qiuming the strongest person of Wangdao?”<br/><br/>“The strongest? Among the twelve Dao Sects, he’s considered the weakest. It’s just that he’s not old enough. Give him another five hundred years, and he will undoubtedly be an invincible force to be reckoned with across the land,” replied someone with a chuckle and a shake of the head.<br/><br/>The others joined in the conversation.<br/><br/>“Speaking of which, the Heavenly Dao is even more incredible. It’s rumored that Heavenly Dao is even younger than Xu Qiuming.”<br/><br/>“How is that possible, do you believe that? Even if you practiced Cultivation from the womb and were a reincarnation of a Great Saint, it couldn’t be that outrageous. It’s just that the Eastern Mortal Realm is too weak and has overly mythologized its figures.”<br/><br/>“That makes sense. After all, we haven’t had any encounters with the Heavenly Dao. Let’s talk about Xu Qiuming instead. I heard Xu Qiuming is gearing up to challenge the strongest prodigy of the Sword Clan under a thousand years old; I wonder whether that’s true or not.”<br/><br/>“It is true, but the Sword Clan is too far from the sea region where we live. In our lifetime, we won’t be able to witness such a glorious event.”<br/><br/>Afterward, Yang Jun did not speak again. He listened intently, and even as the food and drinks were served, he remained engrossed in the conversation.<br/><br/>Half an hour later.<br/><br/>As the group exited the inn, Yang Jun looked at Yang Lin’er with excitement and said, “Sis, let’s go find the Immortal Cave among the Seventy-Two with the most distinguished Sword Dao. Xu Qiuming will be my goal in the future. I too want to be as full of spirit and famous across the world as he is.”\t\t\t\t\t\t</div>", "images": {}, "success": true}