{"id": 386, "url": "https://www.novelhall.com/i-became-an-immortal-on-mortal-realm-32879/14926077.html", "title": "Chapter 376 - Chapter 376: Chapter 373: Qi Yun’S Strategy, Facing The Power Of The Great Saint", "volume": 4, "volume_title": "Volume 4", "body": "<h1>Chapter 376 - Chapter 376: Chapter 373: Qi Yun’S Strategy, Facing The Power Of The Great Saint</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 376: Chapter 373: Qi Yun’s Strategy, Facing the Power of the Great Saint<br/><br/>When Fang Wang’s gaze fell upon the man in silver armor, there was a change in the man’s eyes, as if he were surprised.<br/><br/>“Can you see me?”<br/><br/>The man in silver armor asked, his tone indifferent.<br/><br/>Fang Wang replied, “May I ask the senior’s name, and what is your relationship with this young man?”<br/><br/>The man in silver armor narrowed his eyes and said, “You should have already discerned my relationship with him. As for my name, if you were to know it, you would be burdened with great karmic consequences. Are you sure you want to ask?”<br/><br/>Fang Wang smiled and said, “Since this young man has entered my Wangdao, he is one of our own. Naturally, I have to ask.”<br/><br/>As a joke, the Formless Zhou Tian Technique of Great Perfection was no mere decoration!<br/><br/>Great karmic consequences?<br/><br/>He wouldn’t be entangled!<br/><br/>“As you guessed, I am Qi Yun Great Saint. You have received my inheritance and have also mastered Emperor Extinction’s Extinction Divine Power. Your fortune is not small. Do you intend to walk the path of defying the heavens?” the man in silver armor continued to inquire.<br/><br/>Fang Wang was not shocked; he was merely curious about the strength of Qi Yun Great Saint.<br/><br/>Zhou Xue said that Qi Yun Great Saint held a high position in the Immortal Court, which meant that Qi Yun Great Saint was far stronger than ordinary great saints and emperors.<br/><br/>Fang Wang replied, “I don’t wish to defy the heavens or anyone else. However, if someone tries to force my head down, I can only resist, even against the heavens.”<br/><br/>Understanding the relationship between Qi Yun Great Saint and Duan Tian, Fang Wang knew Zhou Xue’s speculation was not wrong.<br/><br/>Qi Yun Great Saint harbored rebellious intent against the Immortal Court!<br/><br/>Qi Yun Great Saint not only left his legacy in the Mortal Realm but also created his own avatar, all done secretly, clearly afraid of the Immortal Court finding out. Most likely, he was seeking to break free from the Immortal Court.<br/><br/>“Even against the heavens?”<br/><br/>Qi Yun Great Saint laughed, but his smile seemed mocking in Fang Wang’s eyes.<br/><br/>Fang Wang made no defense. Throughout history, many great saints and emperors had failed, and before their failure, they were just as confident and spirited as Fang Wang.<br/><br/>“Junior, you are also a bearer of my legacy. Why not make a deal?” Qi Yun Great Saint gazed at Fang Wang, speaking calmly.<br/><br/>“What kind of deal?”<br/><br/>“You cultivate this young man for me, and in the future, when you or your people ascend, I will take care of you all in The Upper Realm.”<br/><br/>Fang Wang didn’t immediately agree but asked, “May I ask the senior, will Duan Tian ascend afterward?”<br/><br/>Qi Yun Great Saint narrowed his eyes and said, “Like you, he will not ascend. But he has my support. For you, however, choosing not to ascend will not be so easy, especially for a talent such as yourself.”<br/><br/>Clearly, Qi Yun Great Saint could overhear Fang Wang and Ji Rutian’s conversation through Duan Tian.<br/><br/>This made Fang Wang even more certain of his goal.<br/><br/>Besides, the Doom God would surely have informed the Immortal Court of Fang Wang’s existence. He was now a thorn in the Immortal Court’s side, leaving him even less reason to be wary.<br/><br/>Fang Wang spoke up, “I can agree, but I would like to inquire about one person with the senior.”<br/><br/>“Who?”<br/><br/>“The Doom God.”<br/><br/>Qi Yun Great Saint’s expression changed, and a fierce aura erupted. Thankfully, separated by the Underworld and Mortal Realm, it couldn’t affect Fang Wang.<br/><br/>He stared intently at Fang Wang and asked in a deep voice, “Boy, who stands behind you? How do you know of my relationship with the Immortal Court?”<br/><br/>Fang Wang calmly replied, “My confidence isn’t solely in my talent.”<br/><br/>Qi Yun Great Saint fell silent.<br/><br/>After a long while,<br/><br/>Qi Yun Great Saint laughed, instantly easing the tense atmosphere. No longer were swords drawn and bows bent. He softly chuckled, “Interesting, indeed, you have offended the Doom God. Your name has spread throughout the Immortal Court, and the Doom God is preparing to descend. When that time comes, all beings karmically linked to you will suffer divine wrath.”<br/><br/>Fang Wang retorted, “If that’s the case, why didn’t you stop Duan Tian from forming a bond with me?”<br/><br/>“There’s no need to probe any further. I, too, don’t see eye to eye with the Doom God. After he descends, I will ensure that he stumbles greatly. However, I will not help you kill the Doom God, and keep in mind that the Doom God is not descending alone. You’re facing a situation even worse than confronting the Descending Dragon Great Saint. That’s all I will say; to speak further would violate prohibitions.”<br/><br/>With that, Qi Yun Great Saint turned and left.<br/><br/>Fang Wang watched his retreating figure, choosing not to speak further.<br/><br/>He employed The Heaven of Carefree Freedom and directly descended into the Underworld.<br/><br/>Qi Yun Great Saint paused mid-step, glancing at Fang Wang out of the corner of his eye with a piercing gaze.<br/><br/>Fang Wang spoke up, “Senior, may I make a presumptuous request? Could you allow me to experience the power of a Great Saint? Of course, not face the full might of a senior, but rather the power typical of an ordinary Great Saint.”<br/><br/>Qi Yun Great Saint humphed, “Junior, you seem reckless, but since your Extinction Divine Force is still within Duan Tian’s body, you’re not afraid of me killing you.”<br/><br/>Fang Wang replied, “I ask for your forgiveness, Senior. Only by understanding the gap between myself and a Great Saint can I strive harder. This is also beneficial for Duan Tian, as well as advantageous to the grand scheme of the Senior.”<br/><br/>Qi Yun Great Saint turned around and looked at Fang Wang, saying, “I am not my true self here; an Immortal Divine body cannot descend into the Underworld. However, this incarnation of mine indeed possesses the power of a newly minted Great Saint. Since that’s the case, then confront me with your Seven Rotations Buddha Body, which I know you have already mastered.”<br/><br/>Without any politeness, Fang Wang activated the seventh rotation of the Dao Origin Body of the Seven Rotations Buddha Body!<br/><br/>Boom!<br/><br/>Silver energy burst forth, with stars and the moon rising, revolving around Fang Wang.<br/><br/>The expression in Qi Yun Great Saint’s eyes shifted slightly, as his right hand, resting behind his waist, involuntarily clenched into a fist.<br/><br/>Fang Wang silently drew upon the Dao Power of his bones, filling his body.<br/><br/>Immeasurable Pure Bone, Heavenly Gang Supreme Yang Tyrant Body, Dao Origin Body—these three mighty forces combined to confront the power of the Great Saint!<br/><br/>Simultaneously, he focused his mind, ready to employ The Heaven of Carefree Freedom at any moment to become ethereal.<br/><br/>Qi Yun Great Saint didn’t speak. His eyes suddenly widened, and two terrifying beams of light burst forth, almost instantly focusing on Fang Wang.<br/><br/>Rumble—<br/><br/>The Underworld’s terrain shattered, and the gusts created by the two beams ravaged tens of thousands of miles, shaking the very heaven and earth of the Underworld.<br/><br/>Fang Wang’s Yang Energy barrier was directly dispersed, followed by the rupture of the Dao Origin Body, and then the Dao Power of his bones began to resist.<br/><br/>So powerful!<br/><br/>Fang Wang felt the self-healing capacity of the Heavenly Gang Supreme Yang Tyrant Body struggling to keep up, but fortunately, he was still able to hold on.<br/><br/>He dared to jump into Qi Yun Great Saint’s assault because he sensed that this Qi Yun Great Saint wasn’t the authentic one, as this Great Saint didn’t bear the Immortal Divine aura of beings like the Doom God or the seekers of The Path of Immortality.<br/><br/>Fang Wang was forced backwards, blood spurting from his chest.<br/><br/>After retreating a hundred miles, he steadied his footing. The wounds on his chest rapidly healed, and his Yang Energy began to suppress the two beams, pushing them outwards.<br/><br/>Qi Yun Great Saint abruptly closed his eyes, and the two beams disappeared with them. Once he reopened his eyes and looked at Fang Wang, surprise flickered within.<br/><br/>“Your Seven Rotations Buddha Body has caught up with me—no, it has even surpassed me. Your physique is also extraordinary, stronger than the Vajra Invincible Saint Body, and your tendons and bones…”<br/><br/>Qi Yun Great Saint spoke, growing more and more excited as he spoke, looking at Fang Wang as if beholding a rare treasure.<br/><br/>Fang Wang’s upper garment was already torn, and after his chest healed, the blood scabs began to fall off. His skin appeared like white jade. Straightening his torso, he then flew towards Qi Yun Great Saint.<br/><br/>As he neared Qi Yun Great Saint, he leapt back to the Mortal Realm, arriving in front of Duan Tian, and through the barrier between yin and yang, he locked gazes with Qi Yun Great Saint.\t\t\t\t\t\t</div>", "images": {}, "success": true}