{"id": 382, "url": "https://www.novelhall.com/i-became-an-immortal-on-mortal-realm-32879/14924905.html", "title": "Chapter 372 - Chapter 372: Chapter 369: Seven Rotations Buddha Body Great Perfection, Great Saint Reincarnation", "volume": 4, "volume_title": "Volume 4", "body": "<h1>Chapter 372 - Chapter 372: Chapter 369: Seven Rotations Buddha Body Great Perfection, Great Saint Reincarnation</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 372: Chapter 369: Seven Rotations Buddha Body Great Perfection, Great Saint Reincarnation<br/><br/>Fang Wang’s words landed heavily, stirring excitement among many Buddha Cultivators of the Pursuing Heaven Sect.<br/><br/>What if I am that once-in-an-eternity genius?<br/><br/>What if I am fated with the Great Saint Divine Passage?<br/><br/>The higher-ups of the Pursuing Heaven Sect, seeing the change in their Disciples’ expressions, all felt a sense of foreboding while simultaneously harboring deep resentment towards Fang Wang, thinking him exceedingly malicious.<br/><br/>Ji Rutian also thought Fang Wang was waging psychological warfare, reasoning that if the First Buddha taught a false Divine Skill, it would harm not only Fang Wang but also the followers of the Pursuing Heaven Sect.<br/><br/>The First Buddha fell silent for a while, eventually sighing and saying, “Since that’s the case, then as you wish.”<br/><br/>With that, he began to recite the mental method mnemonic of the Great Saint Divine Passage.<br/><br/>Fang Wang stood atop Xiao Zi’s head, listening attentively. Xiao Zi, Ji Rutian, Duan Tian, and all the followers of the Pursuing Heaven Sect started to listen earnestly to the teaching.<br/><br/>The Great Saint Divine Passage, who wouldn’t want to learn it?<br/><br/>The First Buddha kept his gaze fixed on Fang Wang, not intentionally speaking quickly, with each word he uttered very clear.<br/><br/>The sound of his teaching resonated between heaven and earth, and gradually, more and more Pursuing Heaven Sect Disciples showed troubled expressions.<br/><br/>Such a complicated mental method!<br/><br/>Fang Wang did not overthink it; what he needed to do was remember every word spoken by the First Buddha.<br/><br/>A full half hour passed.<br/><br/>Finally, the First Buddha finished speaking, and as his voice faded, Fang Wang closed his eyes.<br/><br/>The world fell into silence.<br/><br/>Ji Rutian furrowed his brow, unable to determine the truth of this Divine Skill. He was about to warn Fang Wang, but then he saw Fang Wang opening his eyes.<br/><br/>No one noticed the change in Fang Wang’s eyes, while the First Buddha simply watched him calmly, waiting for Fang Wang’s judgment.<br/><br/>Fang Wang slowly began to speak, “Seven Rotations Buddha Body, an impressive Divine Skill. You have already reached the fifth rotation, the White Jade Buddha Body, haven’t you? Even if the soul is extinguished, the physical body can re-grow a new soul, right?”<br/><br/>As soon as these words were spoken, the face of the First Buddha changed dramatically.<br/><br/>The Seven Rotations Buddha Body, from the first to the seventh rotation, consist of the Copper Skin Body, Vajra Body, Green Jade Body, Purple Muscle Body, White Jade Buddha Body, Black Origin Body, and Dao Origin Body!<br/><br/>The Dao Origin Body allows the transformation into the power of rules, immune to the impact of Spiritual Power and soul thoughts, and the strength of the physical body can scatter dao and annihilate souls!<br/><br/>Fang Wang spent a full fifteen thousand years cultivating this Divine Skill!<br/><br/>His eyes sharpening, his aura suddenly changed, and silver light burst forth from his pupils, while his body surface ignited with white flames. Within these flames, specks of silver light appeared, like stars scattered throughout, and his black hair turned silver-white, fluttering in the wind.<br/><br/>A bright moon emerged behind Fang Wang’s head, making him appear like an Immortal Divine on earth, the light from the moon making the surrounding stars even brighter.<br/><br/>This scene left Ji Rutian, Duan Tian, and the entire Pursuing Heaven Sect gaping, stirring up an incredible commotion.<br/><br/>“You… It’s not possible…”<br/><br/>The First Buddha stood up suddenly, exclaiming in disbelief.<br/><br/>Looking at Fang Wang, now in the Dao Origin Body state, he couldn’t maintain his composure.<br/><br/>The Seventh Rotation!<br/><br/>The Dao Origin Body!<br/><br/>The First Buddha had only seen the Qi Yun Great Saint perform the Dao Origin Body in his dreams, and Qi Yun Great Saint’s Dao Origin Body only had the aspect of stars, with no moon behind.<br/><br/>“Who exactly are you?”<br/><br/>The First Buddha stared intently at Fang Wang, asking in a deep voice.<br/><br/>Everyone looking at Fang Wang’s Dao Origin Body felt an indescribable presence, a subconsciously arising reverence, and an urge to genuflect in worship.<br/><br/>Fang Wang, sensing his own Great Perfection Dao Origin Body, replied, “My name is Fang Wang, haven’t I said that before?”<br/><br/>The followers of the Pursuing Heaven Sect were on edge seeing the First Buddha lose his composure, completely unclear about what was happening.<br/><br/>Could it be that Fang Wang has already mastered the Great Saint Divine Passage?<br/><br/>So quickly?<br/><br/>Ji Rutian was also shocked, suddenly realizing why he was not as adept as Fang Wang.<br/><br/>He was talented and insightful, but compared to Fang Wang…<br/><br/>To learn the Great Saint Divine Passage after hearing it just once?<br/><br/>He had never heard of such a feat.<br/><br/>“`<br/><br/>Could it be that Fang Wang had already mastered it before?<br/><br/>It wasn’t just Ji Rutian who thought so, the First Buddha also entertained the same thought, unable to believe that someone could grasp the Great Saint Divine Passage after hearing it only once.<br/><br/>Fang Wang couldn’t be bothered to explain and said, “Alright, it’s my turn to impart the secret techniques to you all, everyone listen carefully.”<br/><br/>“Forget it, this method will only be explained once, and you surely won’t remember it.”<br/><br/>Fang Wang took out book after book of secret texts from within the Dragon Jade Ring, all of which were the Heavenly Dao Immensity Scriptures he had written while on Earth. With a wave of his hand, he sent the secret texts flying towards the First Buddha.<br/><br/>The First Buddha reached out with his Spiritual Power to steady the secret texts, his gaze still fixed on Fang Wang.<br/><br/>Fang Wang said, “Alright, we’ll meet again if fate allows.”<br/><br/>Xiao Zi immediately turned her head, Ji Rutian and Duan Tian hurriedly followed suit.<br/><br/>The higher-ups of the Pursuing Heaven Sect became anxious, yet dared not forcefully stop them.<br/><br/>Looking at Fang Wang who is the embodiment of the Dao Origin Body, they truly could not muster even the slightest will to fight and could only watch as Fang Wang departed.<br/><br/>Only after Fang Wang and his companions had disappeared into the horizon did they finally turn their attention to the First Buddha.<br/><br/>The hundreds of thousands of avatars in the sky dissipated as well, allowing the followers of the Pursuing Heaven Sect to breathe a sigh of relief.<br/><br/>“Sect Hierarch, are we just letting them go like this?”<br/><br/>“If this gets out, where will the honor of the Pursuing Heaven Sect be?”<br/><br/>“Sect Hierarch, could it be that he has really cultivated the Great Saint Divine Passage?”<br/><br/>“His demeanor just now was really…”<br/><br/>“Sect Hierarch, you should check these secret texts first, they are probably meant to deceive us.”<br/><br/>The First Buddha ignored the words of his fellow sect members, staring blankly in the direction where Fang Wang had left, his eyes full of complex emotions.<br/><br/>A bold idea formed in his mind.<br/><br/>Could it be that Fang Wang is the reincarnation of the Qi Yun Great Saint?<br/><br/>…<br/><br/>“You couldn’t possibly be the reincarnation of the Qi Yun Great Saint, could you?”<br/><br/>Ji Rutian flew beside Xiao Zi and, looking at Fang Wang, asked.<br/><br/>Fang Wang had already reverted from his Dao Origin Body state. He gave Ji Rutian a glance and laughed, “Why don’t you guess that I am the reincarnation of the Descending Dragon Great Saint, of the Hongxuan Emperor, of the Grand An Divine Emperor, of the Executioner Immortal Great Saint, of the Lingxiao Great Saint?”<br/><br/>This list of names made Ji Rutian’s eyelids twitch uncontrollably.<br/><br/>So many?<br/><br/>How could Fang Wang, who inherited so many Emperor Saint legacies, possibly be the reincarnation of some Great Saint?<br/><br/>Wait a moment, if he could indeed learn everything after hearing it once, that would explain how he could master so many secret techniques.<br/><br/>Ji Rutian’s eyes changed as he looked at Fang Wang, filled with dread.<br/><br/>No wonder Emperor Sea’s top talent, having been defeated by Fang Wang, now serves him with unwavering loyalty.<br/><br/>Ji Rutian suddenly felt that his past self was ridiculous for trying to compete with Fang Wang.<br/><br/>In the eyes of Fang Wang, he was probably nothing but a joke.<br/><br/>With this thought, Ji Rutian’s heart sank into a state of dejection.<br/><br/>“Do you have any attachments left to this world?” Fang Wang’s voice came through.<br/><br/>Ji Rutian shook his head, his thoughts in turmoil.<br/><br/>Duan Tian respectfully replied, “Predecessor, I have no attachments.”<br/><br/>Fang Wang’s lips curved upwards, his Spiritual Power enveloping Ji Rutian and Duan Tian, and in that moment, the two of them truly felt the vastness of his Spiritual Power.<br/><br/>The same thought emerged in the minds of master and disciple.<br/><br/>What kind of cultivation would one need to go through to reach such a state?<br/><br/>Xiao Zi shrank in size and landed on Fang Wang’s shoulder.<br/><br/>With one step forward from Fang Wang, the heavens and earth shifted instantly.<br/><br/>One step, a whole new world!<br/><br/>Ji Rutian’s eyes widened, and Duan Tian was similarly astounded, even blinking repeatedly, afraid he had seen incorrectly.\t\t\t\t\t\t</div>", "images": {}, "success": true}