{"id": 387, "url": "https://www.novelhall.com/i-became-an-immortal-on-mortal-realm-32879/14929575.html", "title": "Chapter 377 - Chapter 377: Chapter 374: The Catastrophe Of The Heavens, To The Mortal Realm", "volume": 4, "volume_title": "Volume 4", "body": "<h1>Chapter 377 - Chapter 377: Chapter 374: The Catastrophe Of The Heavens, To The Mortal Realm</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 377: Chapter 374: The Catastrophe of the Heavens, To the Mortal Realm<br/><br/>“Thank you, senior, for showing mercy.”<br/><br/>Fang Wang clasped his hands in a salute, feeling that the Divine Skill Qi Yun Great Saint had just displayed was not incredibly exquisite, although it was much more powerful than the Celestial Qiankun. Had he faced a Great Saint, the Divine Skill used against him would have certainly been stronger.<br/><br/>However, through the exchange just now, he had gained a rough understanding of the Great Saint’s strength.<br/><br/>He purposefully did not fight back in order to experience the Great Saint’s power.<br/><br/>The power of the Great Saint was indeed very strong, vastly superior to the Spiritual Power of Celestial Qiankun, but it did not make him feel defeated.<br/><br/>Qi Yun Great Saint looked deeply at Fang Wang, then turned his head back and continued forward.<br/><br/>“Junior, you have surprised me; now let me see if you can truly defy the heavens,” the Great Saint said, his voice echoing through the Underworld as he walked six steps and then vanished without a trace.<br/><br/>Fang Wang took a set of black clothes out of the Dragon Jade Ring and put them on while Duan Tian was still immersed in the inheritance of the Extinction Divine Force.<br/><br/>Fang Wang looked toward the horizon for a while before turning and leaving, ready to continue his cultivation.<br/><br/>After sparring with Qi Yun Great Saint, his desire to become stronger intensified.<br/><br/>Currently, he felt unstable when facing a Great Saint and still risked defeat; he must reach the True Soul Realm as soon as possible, then break through to the Celestial Qiankun Realm!<br/><br/>Half an hour later.<br/><br/>Duan Tian finally came to his senses. He looked around and could no longer see Fang Wang’s figure. Recalling the memories that had flooded his mind, he felt a surge of emotion.<br/><br/>“Such an overbearing ultimate technique…”<br/><br/>Duan Tian clenched his fists, feeling as though his entire being had been ignited.<br/><br/>Never had a Cultivation Technique or Divine Skill excited him so much; he felt that as long as he mastered the Extinction Divine Force, he would be qualified to dominate the world.<br/><br/>He immediately sat down with his legs crossed and began practicing the Qi Gathering method of the Extinction Divine Force.<br/><br/>…<br/><br/>Boom rumble—<br/><br/>Dark clouds rolled, with thunder and lightning occasionally intermingling. Mountains undulated below, and the vast forestry shook violently amidst the wild winds sweeping across the land.<br/><br/>Yang Lin’er, dressed in purple robes, stood in front of a temple, gazing at the distant mountaintops. The wind whipped her clothes, and she had now completely shed the aura of a modern person, appearing wholly as a Cultivator.<br/><br/>At this moment, Yang Jun joined her side. His demeanor had changed as well; both of them looked to be in their early twenties, in the prime of their lives.<br/><br/>“That guy is really impressive, almost catching up to you. Should you consider him?” Yang Jun said with a wry smile and a suggestive waggle of his eyebrows.<br/><br/>Upon hearing this, Yang Lin’er’s expression instantly turned cold. She furrowed her brows and shot him a glare, rebuking, “Don’t talk nonsense. My heart belongs to only your brother-in-law.”<br/><br/>“Of course, I know. But it’s been so many years since the traverse, and quite a few who came with us have died of old age. Moreover, we don’t know when we can return, and becoming an Immortal seems indefinitely far off,” Yang Jun sighed. Every time he thought of Earth, he felt very sad. Compared to Yang Lin’er, he not only had a partner but also children. How could he not worry?<br/><br/>He just usually pretended not to care.<br/><br/>“Regardless, don’t persuade me ever again. I only want to cultivate now. I won’t be moved by other men. Even if your brother-in-law is dead, once I become an Immortal, I’ll still seek him through reincarnation,” Yang Lin’er huffed.<br/><br/>There was one thing she did not say.<br/><br/>It was the power of the Heavenly Dao Immensity Scripture that made her feel Fang Wang might not be an ordinary person.<br/><br/>Upon reflection, after knowing Fang Wang for so many years, she had never seen any of his relatives, and even before she stepped into the path of cultivation, Fang Wang had already begun his practice. Perhaps Fang Wang was inherently a Cultivator.<br/><br/>With that thought, Yang Lin’er’s heart filled with fighting spirit.<br/><br/>The siblings stood in front of the monastery’s main gate, beginning to reminisce about the past.<br/><br/>Several hours later, as night fell, about dozens of Cultivators gathered inside the monastery. They sat in meditation side by side, all of them looking towards the woman in black clothes sitting opposite the fire.<br/><br/>The woman in black clothes still wore the White Bone Mask, looking so mysterious. The firelight shone upon the White Bone Mask, as if there were a clump of blue fierce flames burning within it.<br/><br/>“After so many years of cultivation, it’s time for you to officially enter the Cultivation World for trials,” said the woman in black clothes slowly, as everyone looked at her with reverence.<br/><br/>Although she had initially scared them, giving the impression that their ensuing days would be brutal, the reality was not so, and the woman in black clothes had set rules to let everyone practice with peace of mind. Even those without the aptitude for cultivation could live out their years in peace.<br/><br/>Even though they were unclear about the woman in black clothes’ purpose of teaching them cultivation, they were still thankful to her.<br/><br/>Who would choose to be a Mortal when they could practice cultivation?<br/><br/>Yang Jun asked curiously, “Senior, where shall we go for our trials?”<br/><br/>The woman in black replied calmly, “Go to a Mortal Realm for cultivation. There, the masses practice cultivation, and there exist beings who rival the Immortal Divine ruling over all. There, you will seek your own fortunes. I will not accompany you. When we shall meet again depends on your capabilities. To see me again, you must at least reach the Nirvana Realm.”<br/><br/>Nirvana Realm?<br/><br/>Everyone was stirred by this, for they had never heard of such a realm before.<br/><br/>Anxious, someone asked, “Senior, how far is the Profound Heart Realm from the Nirvana Realm?”<br/><br/>Upon mentioning the Profound Heart Realm, many eyes turned their attention to Yang Lin’er.<br/><br/>“The answer is for you to seek out on your own,” responded the woman in black clothes.<br/><br/>A female Cultivator raised her hand and asked, “Senior, why can’t you just send us directly back to Earth?”<br/><br/>This question brought all eyes to the woman in black clothes.<br/><br/>She answered calmly, “It’s time to reveal a bit of fate. In the future, a calamity that will sweep across all the heavens and myriad realms will descend. At that time, the weak Mortal Realm will perish. The Mortal Realm where Earth resides has almost no cultivation strength and simply cannot withstand such a catastrophe. Even if you returned, you would be awaiting death. If you cultivate well, perhaps one day, you may save your homeland.”<br/><br/>“Behind me is a powerful sect, and you all are merely pawns that the sect is using to withstand the catastrophe of the myriad realms. Many others, just like you, are diligently cultivating to protect their homelands. Even if you do not wish to protect your homelands, I will not send you back. If you want to return, then cultivate diligently.”<br/><br/>Her words made everyone’s expression change drastically.<br/><br/>A catastrophe among the heavens?<br/><br/>The woman in black clothes ignored the reactions and continued, “The Mortal Realm you will go to next is incredibly vast, on the verge of a golden age where many races will rise and the proud sons of heaven will vie for supremacy. Upon arrival, it’s best if you join a sect. As for how to choose, whether to act alone or together, I will not interfere.”<br/><br/>“Before departure, I will impart to you one more spell, so everyone listen carefully,” she announced.<br/><br/>At these words, everyone sat up straight and attentive, aware of the pressure they faced.<br/><br/>What exactly is this unknown Mortal Realm like?<br/><br/>This was the question that Yang Lin’er also pondered, while at the same time, she felt a sigh in her heart.<br/><br/>She felt herself drifting farther and farther from Fang Wang.<br/><br/>However, she was not discouraged. On the contrary, this only filled her with more fighting spirit; the more difficult the journey, the sweeter the reunion would be!<br/><br/>Unnoticed by all, at that moment in the night sky, the dark clouds parted to reveal the bright moon, within which a silhouette was suspended. As the sea of clouds surged by, the figure disappeared from view.\t\t\t\t\t\t</div>", "images": {}, "success": true}