{"id": 380, "url": "https://www.novelhall.com/i-became-an-immortal-on-mortal-realm-32879/14919877.html", "title": "Chapter 370 - Chapter 370: Chapter 367: Legend Of Xuanzu, Forcing Through The Western Heaven", "volume": 4, "volume_title": "Volume 4", "body": "<h1>Chapter 370 - Chapter 370: Chapter 367: Legend Of Xuanzu, Forcing Through The Western Heaven</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 370: Chapter 367: Legend of Xuanzu, Forcing Through the Western Heaven<br/><br/>Qi Yun’s World is vast, but not as vast as Xuanzu’s World. From Ji Rutian’s mouth, Fang Wang learnt the name of the Mortal Realm where the Descending Dragon Continent resided.<br/><br/>Xuanzu — This was the first time Fang Wang had heard this name.<br/><br/>He asked Ji Rutian about the legends of Xuanzu. Ji Rutian knew little, having heard only a legend or two.<br/><br/>“Xuanzu is an ancient being that forged the Mortal Realm, more ancient than Supreme Saints. Back then, there were no humans, so it is difficult to understand his specific deeds. It was only later that humans unearthed relics left by other races, where Xuanzu’s presence was depicted. Legend has it that before the birth of heaven and earth, everything was in chaos. Xuanzu came from the depths of darkness, created the Mortal Realm, and then departed,” Ji Rutian said as he maneuvered the treasure tower.<br/><br/>Fang Wang received little information and had to give up. He then started to inquire about the West Heaven in this realm.<br/><br/>The treasure tower flew at high speed. According to Ji Rutian, it would take half a day to reach West Heaven.<br/><br/>The sect of West Heaven is called the Pursuing Heaven Sect, a Buddhist Sect which piqued Fang Wang’s interest even more.<br/><br/>No wonder it’s called West Heaven.<br/><br/>Could it be related to the Buddhist realms of West Heaven from Huaxia’s mythology?<br/><br/>Duan Tian listened to his master and Fang Wang talk, feeling as restless as a cat scratching at his heart. He was very curious about Fang Wang’s background, but couldn’t directly ask, so he looked for the opportunity to speak with his master in private.<br/><br/>He never imagined that his master would submit to someone, and he could see that his master’s mood was improving, seemingly beginning to enjoy serving this person?<br/><br/>…<br/><br/>Under the twilight, peaks rose from the loess ground, with scarce flowers and grass, displaying a desolate scene.<br/><br/>A treasure tower approached from the horizon, the same one belonging to Ji Rutian, with Fang Wang and the others still standing on the terrace, looking into the distance.<br/><br/>Upon arriving on this continent, Fang Wang felt an overwhelming Spiritual Energy, mixed with a special power he couldn’t identify, but one that could influence the minds of living beings. Fortunately, with his profound cultivation and having practiced the Heavenly Dao Infinite Book of Changes, he was not affected.<br/><br/>Xiao Zi also noticed this and couldn’t help saying, “Master, this place is eerie. I feel an inexplicable sense of guilt.”<br/><br/>Duan Tian nodded in agreement.<br/><br/>Ji Rutian explained, “This is the Buddha energy of the Pursuing Heaven Sect. Legend has it that a long time ago, a Saint Buddha descended to this place, and upon passing, left his teachings. Later, people came here, received his inheritance, and founded the Pursuing Heaven Sect.”<br/><br/>Saint Buddha?<br/><br/>A great power from The Upper Realm?<br/><br/>Fang Wang’s interest in the Pursuing Heaven Sect grew. To tell the truth, he didn’t know much about the Immortal Divine beings of The Upper Realm. Although he had obtained the Misfortune Divine Power from the Doom God, he was not a true Immortal Divine.<br/><br/>The treasure tower continued forward.<br/><br/>“Halt! This is the territory of the Pursuing Heaven Sect, you cannot trespass!”<br/><br/>A thunderous voice echoed, like a muffled thunder, reverberating through the heavens.<br/><br/>Fang Wang said softly, “Just keep moving forward.”<br/><br/>Hearing this, Ji Rutian’s lips curved upwards, instantly accelerating. As the speed of the treasure tower increased, Duan Tian, with his lower cultivation base, had to grab the railing to avoid falling off.<br/><br/>“How audacious!”<br/><br/>The thunderous voice rang out again, this time filled with rage.<br/><br/>As the voice faded, at the edge of the world, beyond the range of peaks, a majestic Golden Buddha rose. The Golden Buddha, only revealing its upper body, seemed as if it could pierce the sky with its back.<br/><br/>The Golden Buddha was bare-chested, its muscles like entwined tree roots, shoulders and armpits wrapped with a Golden Silk Ribbon, eyes glowering, head adorned with a Buddha crown, exuding an unrivaled majestic aura.<br/><br/>Before him, all other beings seemed trivial.<br/><br/>He appeared as though he did not belong to the Mortal Realm but came from the Firmament!<br/><br/>This was the first time Duan Tian had seen such a Buddha manifest, and he involuntarily clenched the railing tighter.<br/><br/>Fang Wang raised his hand, conjuring the Qiankun Fan, and swung it forward. With that swing, a terrifying maelstrom burst forth, directly sweeping the huge Golden Buddha from the horizon, and even the mountains along the way were consecutively shattered into dust.<br/><br/>Domineering!<br/><br/>Within Duan Tian’s vision, Fang Wang swung once, shattering half of the heavens and earth, deeply stirring him with such a visual shock.<br/><br/>Ji Rutian glanced at the Qiankun Fan in Fang Wang’s hand and, with his keen eyesight and knowledge, recognized at a glance that the fan was Fang Wang’s Lifespirit Treasure.<br/><br/>He remembered that Fang Wang’s Lifespirit Treasure was a halberd and a light sword.<br/><br/>Suddenly, a certain rumor came to mind, and his expression turned strange.<br/><br/>As Fang Wang waved his fan, the Pursuing Heaven Sect was completely alerted. Powerful auras burst forth from the horizon, shaking heaven and earth, to the point where even Ji Rutian couldn’t help but be moved.<br/><br/>He had always known the Pursuing Heaven Sect was strong, but he hadn’t realized it was this strong.<br/><br/>If it weren’t for Fang Wang, he and Duan Tian would have likely faced a setback!<br/><br/>Fang Wang laughed and said, “The Pursuing Heaven Sect is indeed extraordinary, to think they possess a being at the half-step Celestial Qiankun Realm, stronger than even a Saint Emperor.”<br/><br/>Half-step Celestial Qiankun Realm!<br/><br/>Ji Rutian was moved, while Duan Tian’s face revealed a look of confusion.<br/><br/>What is Celestial Qiankun?<br/><br/>Previously, he thought the True Soul Realm was the pinnacle, a realm even his master was still pursuing.<br/><br/>Xiao Zi was not the least bit anxious; instead, she teased with a playful laugh, “Master, in what manner do you think they will beg for mercy?”<br/><br/>She knew that Fang Wang would not slaughter the Pursuing Heaven Sect, but once Fang Wang made his move, its people would definitely beg for mercy.<br/><br/>Her words made Duan Tian involuntarily look towards Fang Wang, only to see Fang Wang retracting the Qiankun Fan, leaping up, and walking on air.<br/><br/>Not using his Lifespirit Treasure?<br/><br/>Ji Rutian followed by storing his pagoda into his hand, while Duan Tian quickly caught up, his face showing excitement.<br/><br/>He was already looking forward to the adventure that was about to ensue.<br/><br/>Fang Wang flew ahead, Xiao Zi enlarged in size, circled in the air once, then landed beneath Fang Wang’s feet, carrying him forward on their flight.<br/><br/>Boom! Boom! Boom…<br/><br/>A series of deafening sounds spread from ahead. The yellow ground continuously cracked open, countless rocks rose into the air, and converged into numerous arhats. Instead of immediately rushing towards Fang Wang and the others, they spread out to start arranging a formation.<br/><br/>Tens of thousands of stone arhats stood in positions that resembled some profound formation. They raised their palms in unison, directing them at Fang Wang. Their combined momentum gathered together, causing the color of the heaven and earth to change.<br/><br/>The broken yellow earth kept sprouting golden lotuses, with illusions emerging one after another, dazzling the onlooker.<br/><br/>“Amitabha, since you all insist on forcing your way through, then witness the might of our sect’s Great Earth Arhat Formation!”<br/><br/>An old and solemn voice sounded, echoing through the heaven and earth.<br/><br/>Fang Wang paid it no attention; he raised his right hand and made a grabbing motion in the air.<br/><br/>Great Returning Void Palm!<br/><br/>While Ji Rutian and Duan Tian were still marveling at the imposing manner of the Great Earth Arhat Formation, following Fang Wang’s grab, tens of thousands of stone arhats turned instantly to ash, then dispersed like smoke.<br/><br/>There was no ear-splitting noise, no spectacular change of scene; the Great Earth Arhat Formation vanished without a sound or trace.<br/><br/>This kind of shock instead jolted Ji Rutian and his disciple.<br/><br/>“What Divine Skill is this? Could it be Emperor Donggong’s Mie Jue Divine Tome?”<br/><br/>Ji Rutian was silently shocked, at the same time astonished by Fang Wang’s profound cultivation.<br/><br/>He even suspected that Fang Wang might have reached the Celestial Qiankun Realm.<br/><br/>Impossible…<br/><br/>He shared the same year, month, and day of birth with Fang Wang; he felt that his own cultivation speed was already shaking the ancient and dazzling the present, but compared to Fang Wang…\t\t\t\t\t\t</div>", "images": {}, "success": true}