{"id": 397, "url": "https://www.novelhall.com/i-became-an-immortal-on-mortal-realm-32879/14961706.html", "title": "Chapter 387 - Chapter 387: Chapter 384: A Change Of Heaven In The Mortal Realm, Heavenly Dao Myth", "volume": 4, "volume_title": "Volume 4", "body": "<h1>Chapter 387 - Chapter 387: Chapter 384: A Change Of Heaven In The Mortal Realm, Heavenly Dao Myth</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 387: Chapter 384: A Change of Heaven in the Mortal Realm, Heavenly Dao Myth<br/><br/>“I need to discuss this matter with the emperor; I cannot decide on my own,” Hong Xian’er looked at the words on the ground and replied.<br/><br/>Tai You seemed afraid she would overthink, so the watery characters on the ground changed again:<br/><br/>“Xuan You Great Teaching will not plot against the Grand Yu Divine Dynasty, we merely wish to see the Dao heritage reborn in the Mortal Realm, and furthermore, once the time of ascension comes and Immortal Divines descend, it’s quite likely that the Grand Yu Divine Dynasty will be trampled by Immortal Divines. We can still offer our aid to the Grand Yu Divine Dynasty.”<br/><br/>“The reason why Xuan You Great Teaching has chosen the Grand Yu Divine Dynasty is, firstly, because of the Grand Yu Divine Dynasty’s peculiar Fate, and secondly, because of your connection with the Heavenly Dao, especially the Heavenly Dao. We believe that in the million years of the Xuan You Great Teaching’s existence, this presents the best opportunity, one that we do not wish to miss.”<br/><br/>Upon hearing Tai You mention Fang Wang, Hong Xian’er’s brows furrowed involuntarily.<br/><br/>She sighed softly.<br/><br/>Wangdao had claimed that the Heavenly Dao was in seclusion, but she was aware that within Wangdao, no one knew where Fang Wang had gone.<br/><br/>Although Hong Xian’er believed that Fang Wang could take care of himself, she couldn’t help but worry after so many years without seeing him.<br/><br/>She looked up towards the palace gates, which burst open, with golden lotuses still raining down from the sky, and a vigorous burst of Spiritual Energy poured in from outside.<br/><br/>Hong Xian’er felt the changes in the Mortal Realm, and for the first time, she truly understood that what her father had once described as a golden age was no exaggeration.<br/><br/>“Fang Wang, the Mortal Realm is about to change, when will you reappear in the Mortal Realm?”<br/><br/>Hong Xian’er thought to herself, her eyes brimming with anticipation.<br/><br/>She was not only longing to see Fang Wang again but also looking forward to crossing swords with him.<br/><br/>…<br/><br/>Fang Wang had spent nine years to break through to the True Soul Realm!<br/><br/>The True Soul Realm, where one sculpts the true soul, at this level, the soul can be shaped into an independent existence. When the soul leaves the body, it can still battle, and the true soul can even unleash power beyond that of the physical body.<br/><br/>Reaching this level, Fang Wang’s perception of Yin and Yang deepened, and he could even feel the other laws of nature more clearly.<br/><br/>These rules of nature were even more mysterious than nature’s Spiritual Energy, eluding capture.<br/><br/>This made Fang Wang realize that Spiritual Power had its limits, and certainly, the power of Immortal Divines must be greater than that of Spiritual Power.<br/><br/>As he cultivated, Fang Wang pondered the essence of Spiritual Power.<br/><br/>With the existence of Dao Power, Extinction Divine Force, and Yang Energy, he felt he could research a unique power, one that surpassed Spiritual Power and could contend with the power of Immortal Divines.<br/><br/>Since he was to integrate the myriad Daoist techniques of the Mortal Realm, why not pioneer a completely new path of cultivation?<br/><br/>Fang Wang’s thoughts drifted as the vast Spiritual Energy of the ocean surged toward the island where he resided.<br/><br/>Duan Tian, who was cultivating on the beach, opened his eyes. In his view, a pale blue gleam rose from the sea surface, streaming towards the forest behind him.<br/><br/>A look of yearning appeared on his face, and he thought to himself, “The cultivation activities of my senior are becoming grander; when will I be able to cause such a celestial phenomenon?”<br/><br/>He stopped his thoughts and focused on cultivating.<br/><br/>Soon, he discovered that the rich Spiritual Energy attracted by his senior’s cultivation was actually assisting him, not only in the speed of Qi Gathering but also gave him deeper insights into the Extinction Divine Force. This excited him, and he felt even more grateful to Fang Wang, thinking all this was intentional on Fang Wang’s part.<br/><br/>While the others went out on their adventures, only he stayed with his senior. Indeed, his efforts had not escaped his senior’s notice.<br/><br/>Meanwhile.<br/><br/>On a distant continent, thunder roared incessantly, countless Cultivators gathered on the mountain peaks, various Lifespirit Treasures and Magical Artifacts surrounding them. Looking around, the number of Cultivators was beyond count, and their momentum was formidable.<br/><br/>All the Cultivators faced one direction, toward a man dressed in a black robe embroidered with dragons and phoenixes, fluttering in the wind, as if alive.<br/><br/>Wei Buyu!<br/><br/>Wei Buyu is now a far cry from the disheveled figure he was at the other shore of the Immortal Path, emanating the aura of the mightiest, as if the pride between his brows could scatter the thunderclouds in the sky.<br/><br/>Tilting his neck with a sneer, Wei Buyu said, “I don’t even need to summon my Lifespirit Treasure to suppress you all. Have you not seen the situation clearly? Hand over your ultimate teachings. I am not taking them by force, I will exchange mine for yours. Have you not thought about it? All of you together are no match for a single palm strike from me, do your ultimate teachings compare to mine?”<br/><br/>At that, he let out a cold snort, full of contempt.<br/><br/>Despite his respectful demeanor towards Fang Wang, he was, after all, a figure in control of a third of the Celestial Qiankun in Great Han Mortal Realm, just one step away from ascending to become an Immortal. How could his temperament be so meek!<br/><br/>An elderly woman standing atop a white eagle shouted angrily, “If our ultimate teachings do not compare to yours, why did you seek us out to take them forcefully?”<br/><br/>Lifting his chin and looking down upon them, Wei Buyu said, “That is simply because I need many ultimate teachings to pay respects to the ‘Heaven’ above my head.”<br/><br/>The ‘Heaven’ above his head?<br/><br/>All Cultivators were shocked, such a powerful Great Cultivator was just a subordinate to some other being?<br/><br/>It was not only Wei Buyu. At this moment, Ji Rutian, Long Changsheng, and the Sea Lord were also taking ultimate teachings by force in other continents.<br/><br/>In the beginning, those who had their ultimate teachings taken by force, the sects, families, and sacred lands, all hated them fiercely. However, once they earnestly examined the Heavenly Dao Immensity Scripture offered in exchange, they realized that instead of suffering tremendous losses, they actually received a blessing in disguise!<br/><br/>A great opportunity!<br/><br/>An enormous heavenly opportunity!<br/><br/>The name of the Heavenly Dao began to spread. Nobody knew the origin or the real name of the Heavenly Dao, but everyone recognized its strength, especially those Cultivators who started to study the Heavenly Dao Immensity Scripture, who revered it as a divine being.<br/><br/>They couldn’t imagine what kind of being could have created the Heavenly Dao Immensity Scripture and was willing to share it.<br/><br/>If there truly were gods and Immortals in this world, perhaps the Heavenly Dao was one of them.<br/><br/>Gradually, myths about the Heavenly Dao began to appear in this Mortal Realm, and even temples dedicated to worshiping effigies of the Heavenly Dao were built.<br/><br/>About another ten years passed, and the ethos of this world began to change.<br/><br/>More and more sects began to look forward to Ji Rutian and others approaching them to bestow upon them the Heavenly Dao Immensity Scripture, which, on the contrary, made Ji Rutian and the others feel troubled.<br/><br/>Now they found it difficult to discern which powers possessed profound ultimate teachings. In the past, they could judge based on the level of resistance, but now, every force in the world was eagerly offering theirs up, and all were touting their own ultimate teachings.<br/><br/>Everywhere they looked, each claimed to be the best in the world, the best of all time!<br/><br/>Unaware of all these happenings, Fang Wang was engrossed in his cultivation.<br/><br/>The density of the Spiritual Energy in this Mortal Realm far exceeded that of Great Han Mortal Realm. He was preparing to make a breakthrough to the Celestial Qiankun Realm in one fell swoop before starting to seriously search for the way back to Xuanzu’s World.<br/><br/>Fang Wang, lost in time, achieved consecutive breakthroughs in his cultivation realm.<br/><br/>True Soul Realm second layer!<br/><br/>True Soul Realm third layer!<br/><br/>True Soul Realm fourth layer!<br/><br/>One day, Xiao Zi, Ji Rutian, Wei Buyu, Long Changsheng, and the Sea Lord returned, gathering on the beach with their collected ultimate teachings piled up like a small mountain.<br/><br/>Duan Tian, full of curiosity, couldn’t help but ask, “How many forces did you rob?”<br/><br/>Long Changsheng gave him a disdainful glance and said impatiently, “What are you saying, junior? What robbery? This is spreading opportunities. They were all eager to exchange with us.”<br/><br/>The Sea Lord turned to Wei Buyu and asked, “The battle aura from earlier was caused by you, wasn’t it? How strong are those in the Celestial Qiankun Realm in this world?”<br/><br/>Wei Buyu said with disdain, “Having just proven themselves in the Celestial Qiankun, they think they are invincible. I taught him a lesson. Had it not been for the face of the Dao Master, I would’ve made heaven and earth weep for the falling of a Celestial Qiankun.”\t\t\t\t\t\t</div>", "images": {}, "success": true}