{"id": 394, "url": "https://www.novelhall.com/i-became-an-immortal-on-mortal-realm-32879/14956374.html", "title": "Chapter 384 - Chapter 384: Chapter 381: Degenerate Heaven’S Unlimited Great Method, Cangsheng Social Governance Map", "volume": 4, "volume_title": "Volume 4", "body": "<h1>Chapter 384 - Chapter 384: Chapter 381: Degenerate Heaven’S Unlimited Great Method, Cangsheng Social Governance Map</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 384: Chapter 381: Degenerate Heaven’s Unlimited Great Method, Cangsheng Social Governance Map<br/><br/>“`<br/><br/>Hearing Fang Wang’s question, Sin Saint fell silent, and Fang Wang waited patiently.<br/><br/>After a good while.<br/><br/>Sin Saint spoke in a ghostly tone, “I can’t see it. In fact, before you arrived, this Saint had never seen this version of you. I previously thought that becoming a True God of the Heavenly Palace was your endpoint, so I was very happy to see you.”<br/><br/>“So it is… Even this Saint cannot see certain destinies within this chaotic and endless forbidden area.”<br/><br/>The corners of Fang Wang’s mouth under his mask lifted, but he did not let his guard down.<br/><br/>He must not be careless; he still needed to maintain this fearless and steadfast attitude.<br/><br/>Sin Saint seemed to enter a state of madness, beginning to talk to himself in a language Fang Wang couldn’t understand. Fang Wang also couldn’t discern his emotions. A bizarre power emanated from his body, blocking Fang Wang’s probes.<br/><br/>Fang Wang was also considering the words of Sin Saint and the Hongxuan Emperor. He was very resistant to the existence of past lives, feeling a sense of fate.<br/><br/>He only believed in his current feelings.<br/><br/>Heaven and earth fell into silence, the land of the forbidden area began to recover, and it seemed a power was maintaining this realm from the depths of the unknown.<br/><br/>For a long time.<br/><br/>Sin Saint looked up, his eyes becoming empty, no longer filled with the previous madness. He calmly said, “Tiandao Fang Wang, this Saint will remember your name. Although this Saint can’t use many Divine Skills, you were easily able to break through my Spiritual Elephant and even suppress the power of the Sin Resentment Stele; you are indeed strong, this Saint is not your match.”<br/><br/>“You now have two choices, one is to receive my inheritance, and the other is to receive this Sin Resentment Stele.”<br/><br/>Fang Wang asked, “What use is the Sin Resentment Stele?”<br/><br/>“As long as you write their name on the stele, that person will die, but you will also bear a layer of sin resentment. This so-called sin resentment is an existence more terrifying than Karmic Force and Karmic consequence. Once it becomes too heavy, you’ll be backfired upon and end up with the same fate as this Saint.”<br/><br/>Just write a name and they will die?<br/><br/>Isn’t that exaggerated?<br/><br/>Fang Wang became more curious about the Sin Resentment Stele.<br/><br/>“And the inheritance? Can it really make one immortal?”<br/><br/>“Isn’t that what this Saint is?”<br/><br/>“Is Senior joking?”<br/><br/>Fang Wang’s tone cooled down; after fighting for so long, he then gets a secret technique that harms the Hongxuan Emperor?<br/><br/>Isn’t this forcing him to choose the Sin Resentment Stele?<br/><br/>Fang Wang was always wary of powerful magical artifacts; he always felt that using others’ artifacts too much made it easy to be calculated against. After all, the most terrifying thing in the path of cultivation was Karmic consequence.<br/><br/>Silent and invisible, intangible.<br/><br/>“At a critical moment, this technique might save your life. Even if you fall into this boundless curse, at least you still exist, right?” Sin Saint said with a seductive tone.<br/><br/>Fang Wang thought that made sense because he still mastered the Nine Extremes Blood Sacrifice Technique and the Nine Lives Nirvana Sword Technique. He didn’t plan to use these secret techniques, but having an additional method was always good, better safe than sorry.<br/><br/>Seeing Fang Wang silent, Sin Saint continued, “In addition to this technique, this Saint can also teach you the method of creating true Spiritual Elephants. You should be able to feel that my Spiritual Elephant can create a real heaven and earth. The beings you saw before belong to an ancient race with powerful strength. This Saint sealed them within my Spiritual Elephant, and only when the Spiritual Elephant is born can they live and fight for this Saint, which is their only meaning of existence now.”<br/><br/>Fang Wang was moved and said, “Alright, impart them to me.”<br/><br/>Immediately, Sin Saint raised his hand, and the Sin Resentment Stele, planted in the earth, burst forth with an invisible force, whipping up wild winds that ravaged in all directions, causing Ji Rutian and the others to raise their arms in defense.<br/><br/>Afterward, Ji Rutian and the others could no longer hear or detect the conversation between the two men.<br/><br/>An old man couldn’t help but look at Ji Rutian and his apprentice, asking, “What is the origin of this Tiandao Fang Wang? Why have we not heard of him?”<br/><br/>Ji Rutian, who was meditating and cultivating, with his eyes closed, answered, “He is not from this Mortal Realm, and we will soon leave.”<br/><br/>The three souls looked at each other, then began to communicate through voice transmission.<br/><br/>“`<br/><br/>Niu Hai came up behind Duan Tian and, seeing that Ji Rutian was still alive, he clearly breathed a sigh of relief.<br/><br/>One hour later.<br/><br/>Fang Wang and Sin Saint descended from the sky, landing in front of Ji Rutian and the others.<br/><br/>Xiao Zi popped out from within the Heavenly Palace Halberd and quickly settled on Fang Wang’s shoulder.<br/><br/>Sin Saint looked at Ji Rutian and the other three, saying, “Out of respect for the Heavenly Dao, this saint shall assist in your resurrection.”<br/><br/>He swung his right arm and the spiritual energy of heaven and earth rapidly surged toward the four of them, while Duan Tian quickly stepped aside.<br/><br/>Xiao Zi cocked its head, looking at Fang Wang with a gaze full of curiosity.<br/><br/>It was very curious about how the young master would perform after having learned the two peerless teachings.<br/><br/>Ji Rutian and the other three were enveloped by spiritual energy, quickly forming into four giant cocoons, their surfaces shimmering with various-colored ghostly lights.<br/><br/>Sin Saint spoke with a profound tone, “These four are no simple characters; all have the fate of an Emperor Saint behind them, especially the one you wish to save. The Great Saint behind him that peeks into the mysteries of heaven is unfathomable.”<br/><br/>Fang Wang remained silent.<br/><br/>Sin Saint glanced at Fang Wang and said, “Lad, are you really not interested in the Sin Resentment Stele? Although overuse of this treasure will lead to irredeemable doom, if used only a few times, it shouldn’t have much effect. There are always some enemies you can’t find, but with it, you could easily exterminate them.”<br/><br/>Fang Wang retorted, “If used a few times, can one truly suppress one’s greed?”<br/><br/>“If you don’t use it and someone else gets it, you’ll regret it,” Sin Saint said teasingly.<br/><br/>That made sense.<br/><br/>Fang Wang felt somewhat tempted.<br/><br/>Xiao Zi, covetously watching, couldn’t help but say, “Master, give it to me please, I definitely won’t use it rashly!”<br/><br/>Fang Wang thought for a moment, then nodded slightly.<br/><br/>Sin Saint laughed. He raised his hand, and the vast and towering Sin Resentment Stele in the distance rapidly shrank, causing the ground to tremble as it soared into his hand.<br/><br/>The Sin Resentment Stele, larger than a mountain, had actually become smaller than the palm of a hand.<br/><br/>Sin Saint tossed it to Xiao Zi, who caught it with its dragon claw.<br/><br/>“This saint will now teach you the method to control it. This treasure cannot be bound to a master, but inscribing upon it requires a special method,” Sin Saint continued.<br/><br/>He began teaching directly, unconcerned about the presence of Duan Tian and Niu Hai.<br/><br/>Fang Wang hesitated for a moment but still listened.<br/><br/>Because of Sin Saint’s teachings, he already had spent thirty-two thousand years in the Heavenly Palace.<br/><br/>The Fall to the Abyss of No Limits, sacrificing the physical body and soul for immortality, he had cultivated for nineteen thousand years!<br/><br/>The Mortal Realm Mandala, entrapping all of heaven and earth’s beings within it, henceforth losing one’s consciousness and freedom, governed by the master of the Mandala, sharing life and death with the Celestial Phenomenon, he had cultivated for thirteen thousand years!<br/><br/>The Fall to the Abyss of No Limits at the stage of Great Perfection showed Fang Wang many possibilities, including a method of liberation, though it was incredibly difficult; he hadn’t yet revealed his thoughts to Sin Saint because the Sin Saint who had already lost his freedom couldn’t use this method, which had to be prepared in advance before its application.<br/><br/>The Mortal Realm Mandala was entirely created for the Celestial Phenomenon; everything captured by it could be imprinted into the Celestial Phenomenon, meaning the more powerful the force captured, the stronger the Celestial Phenomenon.<br/><br/>Fang Wang was very satisfied with both of these peerless teachings and felt the trip was worth it.<br/><br/>As for the method to control the Sin Resentment Stele, he treated it as something to learn about; it probably wouldn’t be enough to get him into the Heavenly Palace.<br/><br/>However, just as Sin Saint was about to finish speaking, Fang Wang suddenly sensed something was wrong.<br/><br/>This wasn’t a method at all; this was a damn secret technique!\t\t\t\t\t\t</div>", "images": {}, "success": true}