{"id": 390, "url": "https://www.novelhall.com/i-became-an-immortal-on-mortal-realm-32879/14931311.html", "title": "Chapter 380 - Chapter 380: Chapter 377: Sin Resentment Stele, Reincarnation Rebirth", "volume": 4, "volume_title": "Volume 4", "body": "<h1>Chapter 380 - Chapter 380: Chapter 377: Sin Resentment Stele, Reincarnation Rebirth</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 380: Chapter 377: Sin Resentment Stele, Reincarnation Rebirth<br/><br/>“`<br/><br/>True God of the Heavenly Palace?<br/><br/>Fang Wang’s brows furrowed involuntarily under the fox mask upon hearing the mysterious voice.<br/><br/>Xiao Zi, Niu Hai, and Duan Tian hadn’t heard the voice just now and remained vigilant, watching ahead.<br/><br/>Fang Wang remained silent, calmly waiting.<br/><br/>As they flew deeper, the fog ahead gradually thinned and the mountains began to take shape.<br/><br/>Duan Tian, standing behind Niu Hai, looked intently ahead, his eyelids twitching violently.<br/><br/>They weren’t mountains at all, but rather gargantuan skeletons of white bones.<br/><br/>These skeletons resembled human bones but were much larger, with most standing over a thousand zhang tall, and all were kneeling on the ground; it was difficult to estimate their height if they stood up.<br/><br/>The atmosphere grew tense, and even Xiao Zi dared not be careless, its dragon eyes constantly sweeping in every direction.<br/><br/>It was as if they had entered a new world; mountains connected, spreading throughout the land, with towering skeletons nestled among them. Occasionally, they could see the remains of the Demon Race and ordinary humans, but most of the bones were incredibly huge, making them feel as though they had shrunk in size.<br/><br/>The scene before him drew Fang Wang as well. He secretly wondered if these were giants?<br/><br/>Since he had entered, the mysterious voice had ceased, and he no longer felt spied upon.<br/><br/>This realm was filled with a strange and chaotic aura, different from Spiritual Energy. Fang Wang could only describe it as the remnant energies left after a great battle, seemingly residues of Divine Skills and Cultivation Techniques, but these energies were too abundant, filling the entire realm.<br/><br/>Fang Wang’s consciousness also couldn’t probe too far, but he was already able to capture Ji Rutian’s whereabouts through deduction.<br/><br/>It had to be said that the deduction techniques of Xuandu The Book of Changes were indeed powerful. The first method Fang Wang utilized was its deduction technique, with senses taking a subordinate role.<br/><br/>“Let’s head over there,”<br/><br/>Fang Wang raised his hand, pointing in one direction, and Xiao Zi immediately veered off.<br/><br/>Niu Hai turned his head to look at Fang Wang, and although surprised, he still followed obediently.<br/><br/>Duan Tian couldn’t help but ask, “Senior, how is my master’s condition?”<br/><br/>Fang Wang replied, “Not good, but he won’t die. The other party has intentionally set a trap, waiting for us to come.”<br/><br/>A trap?<br/><br/>Duan Tian’s expression changed, and his brows furrowed tightly.<br/><br/>Xiao Zi turned its head to look at Niu Hai, who hurriedly waved his hands and said, “Great King, I truly have never been here before…”<br/><br/>“Is that so?”<br/><br/>“If I lie, may I never break through again in my life!”<br/><br/>Seeing Niu Hai swear such an oath, Xiao Zi had to let it go. It didn’t trust Niu Hai, only Fang Wang. Since Fang Wang was silent, it naturally could not judge.<br/><br/>After traveling another hundred li, they began to see ruins and giant skeletons shattered on the ground, with the occasional massive pitfall.<br/><br/>Through deduction, Fang Wang understood that these were the places where Ji Rutian had fought before.<br/><br/>Duan Tian suddenly shivered, and not just him; even Niu Hai began to tremble uncontrollably, scanning their surroundings with nervous eyes, fearing that some evil spirit might suddenly appear.<br/><br/>Time continued to pass.<br/><br/>Half an hour later, Xiao Zi and Niu Hai started to slow down, and following their gaze, Fang Wang saw a giant stele standing at the edge of the world, taller than all the mountains and giant skeletons.<br/><br/>Fang Wang looked intently, and saw blood-written characters of various sizes and styles on the giant stele, striking to the eye.<br/><br/>In front of the giant stele stood two colossal white bones side by side above the ground, a hundred zhang apart, connected by a golden spiderweb with figures dangling from it, including Ji Rutian.<br/><br/>Aside from Ji Rutian, there were three other individuals.<br/><br/>“Master!”<br/><br/>“`<br/><br/>Duan Tian saw Ji Rutian’s figure and exclaimed in surprise, his voice ringing through the heavens.<br/><br/>Dark clouds roiled in this area, and behind that huge stele, it seemed as if the sun was present, its light illuminating the sky and involuntarily drawing people’s gaze.<br/><br/>Upon hearing Duan Tian’s voice, Ji Rutian struggled to lift his head. He forced a smile and muttered, “As expected… you still came…”<br/><br/>Fang Wang could tell at a glance that Ji Rutian was left with only his soul, which was extremely weak and might dissipate at any moment.<br/><br/>Boom—<br/><br/>Thunder rumbled from the clouds above, oppressive and terrifying.<br/><br/>“You who have crossed seas and realms to come here, is it the Dao that you seek, or is it everlasting life?”<br/><br/>An imposing voice spoke up; it was the same mysterious voice that had previously communicated with Fang Wang.<br/><br/>Upon hearing this, Xiao Zi immediately asked loudly, “What’s the difference between the two?”<br/><br/>“To seek the Dao, inscribe your name on the Sin Resentment Stele. If you have the fate, you will naturally receive the Dao Techniques. To seek everlasting life, you must challenge this saint. If you win, you will have eternal life!”<br/><br/>This saint!<br/><br/>This appellation caused Xiao Zi, Niu Hai, and Duan Tian to be moved.<br/><br/>Legends of Great Saints falling exist in the distant journey of the Immortals, and this made them think of a possibility – could it be that the Great Saint did not fall, but was instead hiding in this realm?<br/><br/>Xiao Zi did not dare to speak, waiting for Fang Wang to express his stance.<br/><br/>Winds brushed against Fang Wang’s black clothes, making him seem like a dark flame burning in the air. He slowly spoke, “In that case, Great Saint, show yourself.”<br/><br/>No sooner had his voice fallen than the dark thunderclouds above the Sin Resentment Stele suddenly parted, and a figure descended from the heavens, landing on top of the stele.<br/><br/>It was actually a skeleton draped in a Dao Robe, its right hand holding a sword, and its left clutching a horsetail whisk, as long as a spear.<br/><br/>Upon seeing him, Xiao Zi, Duan Tian, and Niu Hai inexplicably felt a sense of dread. Merely a glance, and they instinctively averted their eyes.<br/><br/>“The opportunity of the Great Saint is not so easily obtained!”<br/><br/>The Dao Robe-clad skeleton sneered, then with a stomp, the Sin Resentment Stele burst forth with dazzling blood lights that shone on all things between heaven and earth.<br/><br/>Xiao Zi, Duan Tian, and Niu Hai were swept by the blood light, and their eyes became dull in an instant.<br/><br/>Fang Wang was also swept by the blood light, but the eyes beneath the Fox Mask showed no change.<br/><br/>All was silent; even the sound of the wind had disappeared.<br/><br/>Fang Wang raised his right hand, summoning the Heavenly Palace Halberd.<br/><br/>The Dao Robe-clad skeleton looked toward Fang Wang from afar and praised, “You have broken free from this saint’s illusion even quicker than before. It seems in this life, you are stronger.”<br/><br/>Fang Wang had not entered the Illusionary Realm at all, the Formless Zhou Tian Technique of the Great Perfection was still in effect.<br/><br/>He asked, “This life? Have you seen my other lives? Is it a life from the past or the same destiny repeated all over again?”<br/><br/>The Hongxuan Emperor too had once said something similar, claiming he had been here eight times before, which had always been a puzzle in his mind.<br/><br/>After obtaining the Nine Lives Nirvana Sword Technique, he suspected that he might have been reborn using this sword technique. But according to the Hongxuan Emperor, Zhou Xue had been reborn dozens of times, which didn’t make sense.<br/><br/>Some had even been here a hundred thousand times.<br/><br/>“That’s right, destiny has taken another round, this forbidden area exists outside of all the heavens, unaffected by any rules. This saint can peer into the most profound mysteries of time and space, and this is your ninth time here,” answered the Dao Robe-clad skeleton.<br/><br/>Fang Wang countered, “If you can see the outcomes of different fates at the same time, how can you be sure that this is my ninth time here? Why couldn’t it be my second, or even my first?”<br/><br/>“All things have their Karmic cause and effect, with cause comes consequence. Even though reincarnation brings repeated experiences of the same years, there is a causal relationship. The causes of the previous eight times together have brought about your current existence, which is the effect.”<br/><br/>“You call me the True God of the Heavenly Palace. May I ask, was I a True God of the Heavenly Palace before reincarnating, or did I only become the True God of the Heavenly Palace after the eighth time?”<br/><br/>The Dao Robe-clad skeleton fell silent for a moment, then laughed, “You have grown wiser than before. Indeed, True God of the Heavenly Palace is the title from your previous visit. Each time you come, your title is different. True God of the Heavenly Palace is the reputation you forged in the Upper Realm.”\t\t\t\t\t\t</div>", "images": {}, "success": true}