{"id": 391, "url": "https://www.novelhall.com/i-became-an-immortal-on-mortal-realm-32879/14946668.html", "title": "Chapter 381 - Chapter 381: Chapter 378: Boundless Curse, Sin Saint", "volume": 4, "volume_title": "Volume 4", "body": "<h1>Chapter 381 - Chapter 381: Chapter 378: Boundless Curse, Sin Saint</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 381: Chapter 378: Boundless Curse, Sin Saint<br/><br/>Fang Wang realized it upon hearing the words of the Dao Robe clad skeleton.<br/><br/>So, the True God of the Heavenly Palace he encountered in the Heavenly Palace was actually himself?<br/><br/>Fang Wang was filled with even more doubts and followed up with a question, “Senior, being able to transcend the cycles of reincarnation and space-time, aren’t you already above the Celestial Court of the Upper Realm?”<br/><br/>“Heh heh, I’m not seeing through these because I am powerful. Like the Hongxuan Emperor, I too have abandoned my own self, falling into an endless curse. It seems eternal, but in reality, I am only clinging on to life. To the Upper Realm, we will never transcend, and we no longer pose any threat. Of course, they can’t find us. Even if an Immortal Divine descends to the mortal world, when they cross the rules of this forbidden region, they will only head to other places and never arrive here,” the Dao Robe clad skeleton replied in an indifferent tone that sent a shiver down the spine.<br/><br/>Fang Wang asked, “Senior, do you know the Hongxuan Emperor?”<br/><br/>“Heh heh, it was I who taught him the Secret Technique, which gave him the courage to be reckless,” the Dao Robe clad skeleton laughed coldly, a hint of malice in his voice that Fang Wang detected.<br/><br/>Fang Wang, puzzled, asked, “How did the Hongxuan Emperor come to this realm?”<br/><br/>“This realm stands apart from the Three Realms. Any creature from the Mortal Realm can arrive here. When the Hongxuan Emperor came, he had just achieved the status of a Great Emperor…”<br/><br/>Speaking of the past events, the Dao Robe clad skeleton seemed somewhat wistful.<br/><br/>In his tale, the Hongxuan Emperor was bold and unrivaled, feeling that everything under the heavens and earth was within his grasp.<br/><br/>“I deceived him, telling him that the method was a sacrifice of lifespan for power beyond limits. He believed it, and thus, he ended up with the same fate as I did. Haha, who knows if he hates me for it,” the skeleton chuckled.<br/><br/>Hearing this, Fang Wang was speechless. So the Hongxuan Emperor had been duped.<br/><br/>Fang Wang then inquired, “How did Senior obtain this method?”<br/><br/>The laughter of the Dao Robe clad skeleton stopped abruptly.<br/><br/>There was silence in heaven and earth.<br/><br/>At this moment, the silence spoke louder than words.<br/><br/>Fang Wang let out a pretend cough and changed the subject, asking, “May I ask Senior, besides me, how many others have been reborn? Is the number large?”<br/><br/>“Many, innumerable. Sometimes even I struggle to distinguish the real from the false. It’s as though it’s an endless dream, and perhaps all of you are illusions, with only my will sinking continuously,” the Dao Robe clad skeleton replied, his tone tinged with loneliness.<br/><br/>Fang Wang empathized from his perspective; it indeed felt despairing.<br/><br/>To not be able to die, but also not truly live, only being able to watch life as a passerby.<br/><br/>“Alright, it’s time for you to face my trial. In your past life, you arrived here with the cultivation of a half-step Great Saint. What level of cultivation do you possess in this life? Can you become a Saint and be certified as an Emperor?” the Dao Robe clad skeleton’s tone shifted, his laughter carrying a mix of madness and excitement.<br/><br/>“In this timeless, chaotic world, there are few people I look forward to, and you are one of them. With every return, you grow stronger, especially the last time. Even without becoming a Saintly Emperor, you were stronger than the Hongxuan Emperor when he faced me, making me remember your name, claiming you wouldn’t come again.”<br/><br/>“Hahaha, and yet, here you are again, forgetting the title of your True God of the Heavenly Palace!”<br/><br/>“This is the only thing that doesn’t tire me, watching those full of confidence proclaim their vows before me, only for me to see them return in a new form to meet me!” the Dao Robe clad skeleton laughed arrogantly, and evilly.<br/><br/>Thunder followed, echoing between heaven and earth. The ground trembled as skeletons shook violently.<br/><br/>Yang Energy ignited around Fang Wang, forming a massive shield that protected Xiao Zi, Niu Hai, and Duan Tian.<br/><br/>So strong!<br/><br/>This aura was no less than the strength shown by Qi Yun Great Saint when he made a move against Fang Wang before.<br/><br/>Fang Wang’s eyes narrowed, and with a slight stomp of his foot, in an instant, Xiao Zi and Duan Tian woke with a start, while Niu Hai fell, disappearing into the rolling dust.<br/><br/>“Find an opportunity to rescue your master.”<br/><br/>Fang Wang’s voice reached Duan Tian’s ears, and Xiao Zi followed, burrowing into the Heavenly Palace Halberd.<br/><br/>Before Duan Tian could come back to his senses, Fang Wang soared into the sky, his robust Yang Energy stirring up boundless dust waves as if to disperse the clouds above.<br/><br/>Fang Wang stopped at an altitude of ten thousand zhang, looking down at the Dao Robe-clad skeleton on the Sin Resentment Stele, his voice following with a question, “May I ask for the senior’s name?”<br/><br/>“Heh heh, remember, I am known as the Sin Saint! Now you tell me, what name do you bear this time?”<br/><br/>“Tiandao Fangwang, senior, I apologize for the offense!”<br/><br/>“Heavenly Dao? Hahaha, you are truly more audacious each time!”<br/><br/>The self-proclaimed Sin Saint in the Dao Robe skeleton laughed heartily. Subsequently, black qi materialized out of nowhere in the air, rushing into his bones and quickly engulfing his figure.<br/><br/>Snap!<br/><br/>A demonic hand with bulging veins and pitch-black emerged from the black qi, clutching the top of the Sin Resentment Stele as if a demon were attempting to climb out of a well.<br/><br/>Ji Rutian, swaying in the wind while hung on a golden net, struggled to raise his head and look. The world seemed darkened, and Fang Wang’s brilliant Yang Energy made him appear like the sun descending to the mortal plane, so dazzling to behold.<br/><br/>In this moment, Ji Rutian truly felt the mediocrity of his being, and he finally came to understand that he would never surpass Fang Wang.<br/><br/>This sensation was exceedingly intense, deeply imprinting itself in his heart.<br/><br/>Especially recalling Fang Wang’s recent exchange with the Sin Saint, it seemed utterly inconceivable.<br/><br/>When he had met the Sin Saint, he hadn’t heard the Sin Saint mention that he had been there many times. From this, it was clear that his own fate couldn’t compare to Fang Wang’s, much less to Fang Wang’s legendary status.<br/><br/>Boom!<br/><br/>A loud noise came from above Ji Rutian’s head, and immediately after, he saw a black figure charging towards Fang Wang.<br/><br/>Clang—<br/><br/>The Heavenly Palace Halberd collided with a black iron rod, the released force sweeping across the eight directions of the world.<br/><br/>Fang Wang, wearing a Fox Mask, did not reveal any expression, but his eyes became incredibly sharp.<br/><br/>In his pupils was reflected the image of the Sin Saint, who was still dressed in the Dao Robe, beneath which was a robust body; his arms were black as the hands of a demon, with black lines crawling over his face. His eyes wide open, his face bore a ferocious and proud smile.<br/><br/>Fang Wang’s right arm shook, forcefully repelling the Sin Saint.<br/><br/>The Sin Saint tumbled back onto the Sin Resentment Stele, standing on its surface, with the black rod also against the stele—he looked surprised, having not expected Fang Wang’s strength to be so formidable.<br/><br/>At that moment, Fang Wang’s aura surged, his body surrounded by silver energy. Stars and the bright moon emerged, and his black hair turned silver; the silvery energy merged with the searing Yang Energy. At this moment, he was even more dazzling than the bright day.<br/><br/>“Seven Rotations Buddha Body, Vajra Invincible Saint Body, truly good fortune!”<br/><br/>The cold laughter of the Sin Saint sounded as he suddenly pushed off with both legs, charging towards the Firmament. His left hand then performed a grabbing motion from back to front, and the massive Sin Resentment Stele rose from the ground, whipping up dust waves that swallowed the sky and earth.<br/><br/>He broke through the clouds, with the Sin Resentment Stele closely following behind.<br/><br/>Fang Wang looked down to see massive skeletons on the ground rising to their feet and charging towards him in unison.<br/><br/>The world was shrouded in darkness as if mired in chaos, Fang Wang surrounded by endless skeletons, seeming as if he was in Purgatory.<br/><br/>Fang Wang raised his left hand and pressed it downwards!<br/><br/>Great Returning Void Palm!<br/><br/>With one palm strike, countless white bones below turned to powder instantaneously, and the dust waves covering the entire ground disappeared with them.<br/><br/>Duan Tian had just flown in front of Ji Rutian when he subconsciously looked back, his mouth gaping open in shock.\t\t\t\t\t\t</div>", "images": {}, "success": true}