{"id": 395, "url": "https://www.novelhall.com/i-became-an-immortal-on-mortal-realm-32879/14959290.html", "title": "Chapter 385 - Chapter 385: Chapter 382: The Curse Of Sin And Resentment Technique Achieves Great Perfection!", "volume": 4, "volume_title": "Volume 4", "body": "<h1>Chapter 385 - Chapter 385: Chapter 382: The Curse Of Sin And Resentment Technique Achieves Great Perfection!</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 385: Chapter 382: The Curse of Sin and Resentment Technique Achieves Great Perfection!<br/><br/>Though Fang Wang sensed something was amiss, he persisted in listening until his consciousness entered the Heavenly Palace.<br/><br/>The technique was known as the Curse of Sin and Resentment Technique!<br/><br/>This technique, through a simple method, could be easily mastered by carving words with one’s own blood on the Sin Resentment Stele.<br/><br/>If one mastered this technique, they could manipulate the size of the Sin Resentment Stele at will.<br/><br/>Once mastered to Great Completion, there would be no need to carve the words; a thought would suffice to make bloody inscriptions appear on the stele. This method would still contaminate one with sin and resentment, but the process would be much easier.<br/><br/>To reach minor mastery, Fang Wang took only eighty years, which wasn’t long.<br/><br/>To reach Great Completion, it took only two hundred years.<br/><br/>Fang Wang breathed a sigh of relief and continued to practice. However, the more he practiced, the more he felt something was off.<br/><br/>From Great Completion to Great Perfection, the technique underwent a fundamental change.<br/><br/>To reach Great Perfection, Fang Wang actually spent two thousand years!<br/><br/>By the time Fang Wang had accomplished it, he began to feel bewildered.<br/><br/>Adding on the previous two secret arts, he had effectively been in seclusion for thirty-four thousand years!<br/><br/>Who could withstand that?<br/><br/>Nevertheless, the results were gratifying!<br/><br/>The Great Perfection level of the Curse of Sin and Resentment Technique allowed one to completely control the Sin Resentment Stele, turning it into one’s own possession. The stele even contained a hidden purgatory, and he could even summon all the fiends within purgatory for battle!<br/><br/>Fang Wang’s consciousness returned to reality, his facial expressions masked by the cover of his mask, so no one could perceive the changes in him.<br/><br/>With the Formless Zhou Tian Technique in place, no existence could probe him with divine consciousness; they could only observe him with their eyes.<br/><br/>The Sin Saint asked with a smile, “How is it, descendant of the Dragon Race? Have you remembered it?”<br/><br/>Xiao Zi’s realm was not low, so remembering was not difficult, but in order to master this method, more practice was needed. Xiao Zi immediately replied, “Thank you for your guidance, Senior.”<br/><br/>“Hundreds of years ago, the Dragon Race was the most superior among all races. It’s a pity that they fell during the great catastrophe in the Upper Realm and since then, their fate has been in decline. Who knows if we will ever see the Dragon Race return to its peak.”<br/><br/>The Sin Saint lamented, then turned his gaze towards Fang Wang.<br/><br/>“I truly look forward to your future performance. It’s unfortunate that my vision is limited to this chaotic world; I won’t be able to see your future achievements.”<br/><br/>Hearing these words, Fang Wang raised his hand and gave a salute to the Sin Saint, saying, “Senior, I will not forget the kindness you have shown me. If I gain the power to help you in the future, I will surely give it my all.”<br/><br/>“Help me?”<br/><br/>The Sin Saint burst into laughter, as if he’d heard a huge joke.<br/><br/>He waved his hand and said, “Thanks for your good intentions, but this is my fate, beyond redemption. Don’t feel burdened. Helping you become stronger is also to disgust the Celestial Court of the Upper Realm. You will eventually oppose them; the stronger you are, the more they suffer, and the happier I will be!”<br/><br/>Fang Wang did not reveal the solution, after all, he only had a method, which he couldn’t yet achieve. Speaking of it prematurely would give false hope to the Sin Saint, only increasing his agony.<br/><br/>Xiao Zi, perched on Fang Wang’s shoulder, couldn’t help but ask, “Do you have any regrets? If you had just been patient back then, perhaps you wouldn’t have ended up in such a state.”<br/><br/>The Descending Dragon Great Saint back in the day defied the Immortal Divine and met an end where both body and Dao perished, even dragging down half of the Mortal Realm with him.<br/><br/>“Regrets? How could that be! The only thing I regret is that I was too merciful back then. Before dying, I should have killed more Immortal Soldiers,” cursed the Sin Saint, getting very upset at the mention of the Immortal Divine.<br/><br/>“Wow, Senior, you’re so powerful? Not even the Immortal Divine could stop your killing spree?”<br/><br/>Xiao Zi continued to press with questions, now beginning to lace her words with flattery. Although the Sin Saint kept cursing, he seemed to quite enjoy it.<br/><br/>Fang Wang looked toward Ji Rutian and the other three, who were wrapped in the mysterious Spiritual Silk Cocoon, completely obscuring their forms, yet Fang Wang could feel their blood and energy growing stronger.<br/><br/>“How much longer for them?” Fang Wang asked.<br/><br/>Sin Saint answered, “About three months.”<br/><br/>“Alright then, I’ll go out for a while. Once they’re ready, elder, please send them out.”<br/><br/>Fang Wang left these words behind and turned to leave, leaving Duan Tian and Niu Hai behind.<br/><br/>Sin Saint watched his retreating figure, lost in thought.<br/><br/>Niu Hai wanted to follow, but Fang Wang had disappeared too quickly, vanishing before his words had even finished.<br/><br/>…<br/><br/>In the Descending Dragon Continent, Grand Qi, Sword Heaven Marsh.<br/><br/>Fang Hanyu and Fang Zigeng stood side by side. They were at the edge of a lake, gazing at the towering Kunlun in the distance, their faces filled with emotion.<br/><br/>“Such magnificent mountains are rare to see, and they were even man-made. The Tiangong Sect is really something,” Fang Zigeng remarked with awe.<br/><br/>Fang Hanyu nodded, “Ever since Fang Wang swept through the armies of a hundred races, the Tiangong Sect mobilized all its resources to create Kunlun. You might not believe it, but most of the expenses were covered by the sect itself.”<br/><br/>“Now, Kunlun’s name has spread far and wide, becoming the most renowned cultivation site in the Eastern Mortal Realm, thanks largely to the Tiangong Sect’s propaganda.”<br/><br/>He then patted Fang Zigeng on the shoulder, smiling, “Fang Wang once said that Kunlun would leave a Daoist site for us. What do you say, shall we join Wangdao together?”<br/><br/>At this, a smile appeared on Fang Zigeng’s pale face, and he shook his head slightly, “I better not. I have my own path to follow, and my approach doesn’t align with Wangdao’s. Joining them would only bring trouble their way.”<br/><br/>Fang Hanyu looked at Fang Zigeng, his sword-like eyebrows furrowed. The moment he saw Fang Zigeng, he had felt a cold and deadly aura. He wanted to ask what Fang Zigeng had been through over the years, but since Fang Zigeng hadn’t volunteered any information, he felt it wasn’t appropriate to inquire.<br/><br/>He suddenly missed Fang Wang—if he were here, that guy would certainly have no qualms about asking directly.<br/><br/>Fang Wang was not just stronger than him, but also had thicker skin.<br/><br/>“I, the Sect Hierarch of the Primordial Unity Sect in the Western Mortal Realm, today declare my ascension to Great Saint. Should I attain sainthood, I wish to use my Daoist cultivation to bestow great fortune upon the entire Mortal Realm. The heavens can witness this, and all living beings can look forward to it!”<br/><br/>A deep, ancient voice echoed between heaven and earth, not deafening, but every listener could not help but feel a powerful sense of righteousness reverberating throughout the world.<br/><br/>Fang Hanyu and Fang Zigeng were stunned, not just them, but all the cultivators within Sword Heaven Marsh stopped what they were doing.<br/><br/>At this moment, in the far-off Western Mortal Realm.<br/><br/>On a floating island, Yang Lin’er walked out of her cave dwelling. She went to the edge of a cliff, below was an endless blue sea, and cultivators from other floating islands also came out of their cave dwellings.<br/><br/>Yang Jun flew over on his sword, landing next to Yang Lin’er, excitedly asking, “Sister, did you hear it? The Hierarch of the Primordial Unity Sect is going to become a Great Saint! And he’s going to bestow great fortune on the entire Mortal Realm!”<br/><br/>Yang Lin’er gave him a sidelong glance and asked, “Do you even know what it means to become a Great Saint? Or what this great fortune is?”<br/><br/>“I don’t, but it must be awesome. Maybe we can even get a piece of it. He’s addressing the entire Mortal Realm; our Western Mortal Realm is truly impressive. I heard that the Eastern Mortal Realm has not yet produced a Great Saint,” Yang Jun said non-stop, excitedly, feeling a sense of vicarious honor.<br/><br/>Yang Lin’er shook her head, amused. She was about to say something when she suddenly looked upward.<br/><br/>Yang Jun seemed to sense something and looked up as well, his eyes widening in surprise.<br/><br/>They saw that the Firmament was showering down golden rain, which transformed into golden lotuses as it fell, becoming more and more numerous until they covered the entire Firmament.\t\t\t\t\t\t</div>", "images": {}, "success": true}