{"id": 398, "url": "https://www.novelhall.com/i-became-an-immortal-on-mortal-realm-32879/14961707.html", "title": "Chapter 388 - Chapter 388: Chapter 385: Eighth Level Of The True Soul Realm, Unparalleled Through The Ages", "volume": 4, "volume_title": "Volume 4", "body": "<h1>Chapter 388 - Chapter 388: Chapter 385: Eighth Level Of The True Soul Realm, Unparalleled Through The Ages</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 388: Chapter 385: Eighth Level of the True Soul Realm, Unparalleled Through the Ages<br/><br/>Wei Buyu’s words were extremely arrogant, yet no one refuted them, because he indeed possessed that strength.<br/><br/>Ji Rutian looked at these three Celestial Qiankun figures, his heart filled with a sense of urgency.<br/><br/>Although Fang Wang claimed his talent was second only in the world, with these three pressing down, he feared Fang Wang would increasingly look down on him, after all, the strength of Wei Buyu and his companions was extremely formidable, and their gains were far beyond his comparison.<br/><br/>Xiao Zi spoke up, “With so many, how can the young master read them all? You’d better choose the strongest ultimate techniques.”<br/><br/>As soon as these words came out, everyone felt it made sense, and thus they began to browse.<br/><br/>It wasn’t until a year later that Xiao Zi came to Fang Wang and reported the matter to him.<br/><br/>Fang Wang’s thoughts awakened from his cultivation state, he opened his eyes, and first calculated with his fingers, discovering that he had spent thirty-eight years cultivating from the first level of the True Soul Realm to now.<br/><br/>Quite fast!<br/><br/>Fang Wang looked towards Xiao Zi and said, “You all have been considerate, just remember not to hurt anyone.”<br/><br/>Xiao Zi smiled proudly, “Don’t worry, young master, we are all very measured. Young master, now all the common people in the world revere you as a god. We don’t even need to make a move, and people will bring the ultimate techniques to us. Moreover, the Heavenly Dao Immensity Scripture has also become the foremost scripture of ancient and modern times.”<br/><br/>Fang Wang had already felt that a kind of special power, similar to karmic force, was gathering around him. This power made him feel comfortable, could help him cultivate, and even enhance his understanding.<br/><br/>After deducing, he discovered that the source of this power was incredibly widespread, scattered throughout the entire Mortal Realm, and not just this realm.<br/><br/>Perhaps this was the power of faith and wishes.<br/><br/>Fang Wang could feel the different Mortal Realms through this power of faith and wishes, among which the largest Mortal Realm had not been marked by The Heaven of Carefree Freedom, leading him to a bold guess in his mind.<br/><br/>Suddenly, Fang Wang had a new idea.<br/><br/>“Is there anything else you need to do in this realm?” Fang Wang asked.<br/><br/>Xiao Zi shook her head, “What else is there to do? We are waiting for you. We can’t wait to go to the next Mortal Realm to seek ultimate techniques for you.”<br/><br/>Fang Wang’s mouth curved into a slight smile, and he immediately stood up. Seeing this, Xiao Zi became excited at once.<br/><br/>A man and a dragon stepped out of the woods and came to the beach. Ji Rutian and the others saw Fang Wang and bowed to pay their respects.<br/><br/>Fang Wang raised his hand and collected all the secret manuals on the beach into the Dragon Jade Ring, then covered everyone with Spiritual Power, and with one step, stepped out of this Mortal Realm.<br/><br/>This time, he landed with just one step.<br/><br/>Wei Buyu and his companions laughed excitedly and quickly dispersed.<br/><br/>Ji Rutian was about to act, but Fang Wang stopped him.<br/><br/>“Their cultivation has reached its limit, so naturally, they can spend time seeking ultimate techniques. You are different; you should focus on improving your cultivation,” Fang Wang said.<br/><br/>Upon hearing this, Ji Rutian hesitated somewhat.<br/><br/>Fang Wang laughed and said, “Don’t overthink it. You are still my chosen candidate for the Dao Sect. As for those three, how could they compare to your position in my heart?”<br/><br/>He certainly did not want Ji Rutian to waste his talent.<br/><br/>Upon hearing this, Ji Rutian felt a great relief. He took a deep breath and said with all seriousness, “Rest assured, I will not disappoint you.”<br/><br/>Fang Wang smiled and then walked towards a nearby cliff, where he intended to face the great rivers and mountains to cultivate.<br/><br/>This Mortal Realm was far less vast than the previous one, and it took Wei Buyu and his companions less than ten years to gather the strong ultimate techniques from all over the world.<br/><br/>Afterward, Fang Wang continued to lead them across the Mortal Realms.<br/><br/>Thus, the name of the Heavenly Dao spread across various Mortal Realms, and through the power of their fervent prayers, Fang Wang could feel Wei Buyu and the other two’s dedication and hard work.<br/><br/>Not only was Fang Wang’s cultivation rapidly improving, but he was also envisioning a unique path of solitary cultivation for himself.<br/><br/>…<br/><br/>Whoosh——<br/><br/>Waves crashed against the cliffs, and the rocks were sprayed with surges of foam; a precipice stood on the edge of the ocean, and on the other end was a vast continent, with majestic mountains separating the sea like a natural moat.<br/><br/>Atop the cliff stood a man in purple robes with his left hand resting behind his waist. The sea breeze tousled his black hair; his handsome face and a pair of golden eyes looked off into the distance, glinting with a mysterious light.<br/><br/>Behind him, wisps of black mist appeared out of thin air, swirling rapidly and forming a dense fog filled with eyes of varying sizes, eerie and terrifying.<br/><br/>“Ji Yutian, are you ready?” an ice-cold voice emanated from within the mist.<br/><br/>The man in purple, without turning his head, responded, “I have been ready for some time now, but you should ask yourself when I can take action against Wangdao. I am quite covetous of Kunlun, very much so.”<br/><br/>“This saint has delivered a piece of Dao Source Spirit Jade to the Tiangong Sect. When the time comes, all eyes will be on Kunlun, and your opportunity will arrive,” said the voice from within the mist, slowly.<br/><br/>The one known as Ji Yutian turned, his eyes full of surprise as he looked towards the mist and asked, “Dao Source Spirit Jade? Such an ancient and precious treasure, where did you find it? And you’re willing to give it to the Tiangong Sect?”<br/><br/>“I have used many methods. Now, Kunlun presents the greatest opportunity for the Tiangong Sect, which is sure to offer the Dao Source Spirit Jade to Kunlun. You’d best not stick your neck out. Just follow the plan to avoid any complications.”<br/><br/>“What complications? Do you mean the Heavenly Dao? It seems you are petrified by him. He only defeated an incarnation of yours, perhaps you’re taking him too seriously. He might be undefeated in the Eastern Mortal Realm, but can the East compare with the West?” snorted Ji Yutian disdainfully. “Thousand Eyes Great Saint, do not lose the spirit of a Great Saint!”<br/><br/>Hearing this, the Thousand Eyes Great Saint in the mist was not angered but calmly said, “If you are stronger than Tiandao Fang Wang, any method would see you emerge victorious. But if you are not, my strategy will at least save your life.”<br/><br/>Upon hearing this, Ji Yutian fell silent and then turned away with a flick of his sleeve.<br/><br/>“The Primordial Sect Master sacrificed himself to open an era of great fortune for the Mortal Realm. The people of the realm are all proud and complacent. If the calamity of Kunlun arises without Fang Wang’s presence, do not miss this tremendous opportunity of fate,” continued the Thousand Eyes Great Saint.<br/><br/>As his words ended, the mist condensed and then vanished into the air.<br/><br/>Ji Yutian looked towards the horizon and muttered to himself, “Primordial Sect Master… Heavenly Dao… don’t disappoint me… especially you, Heavenly Dao!”<br/><br/>…<br/><br/>Time flew like an arrow, and decades passed by.<br/><br/>Fang Wang had advanced from the fourth level of the True Soul Realm to the eighth level. In this time, they had traversed seven Mortal Realms and collected countless supreme teachings. Fang Wang hadn’t begun practicing them immediately; right now, he only wanted to improve his cultivation.<br/><br/>Unknowingly, Fang Wang had reached the age of six hundred and seventy-seven. A True Soul Realm practitioner of the eighth level at such an age, if word of it spread in Xuanzu’s world, would surely astonish everyone.<br/><br/>One day, Fang Wang once again led his followers across the Mortal Realms.<br/><br/>The moment their step fell, an overwhelming Spiritual Energy rushed towards them, startling everyone.<br/><br/>“This Spiritual Energy…” Wei Buyu exclaimed in shock.<br/><br/>Long Changsheng furrowed his brows and said, “This realm is no ordinary place.”<br/><br/>He performed a hand seal and wiped his forehead, and a vertical eye apparition appeared on it, peering into the distance.<br/><br/>Fang Wang also sensed the extraordinary nature of this Mortal Realm; never before had he encountered a realm with such abundant Spiritual Energy, not even the Grand Yu Divine Dynasty of Xuanzu’s World could compare.\t\t\t\t\t\t</div>", "images": {}, "success": true}