{"id": 399, "url": "https://www.novelhall.com/i-became-an-immortal-on-mortal-realm-32879/14975821.html", "title": "Chapter 389 - Chapter 389: Chapter 386: The Lower Realm Becomes The Upper Realm, The Source Spirit Jade", "volume": 4, "volume_title": "Volume 4", "body": "<h1>Chapter 389 - Chapter 389: Chapter 386: The Lower Realm Becomes The Upper Realm, The Source Spirit Jade</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 389: Chapter 386: The Lower Realm Becomes The Upper Realm, The Source Spirit Jade<br/><br/>“With such Spiritual Energy, the Spirit Energy of this realm must indeed be extraordinary. Are you all scared?” Xiao Zi lay on Fang Wang’s shoulder and asked with a smile.<br/><br/>Wei Buyu, Long Changsheng, and Hai Zun upon hearing this, naturally refused to accept such a statement.<br/><br/>“Dao Master, just you wait!”<br/><br/>Wei Buyu said as he waved his sleeve and led Long Changsheng and Hai Zun to fly towards the horizon.<br/><br/>Fang Wang, on the other hand, descended, below him were dense forests. Streams crisscrossed through the woods, and Spiritual Energy formed mists that enshrouded most of the forest’s appearance.<br/><br/>Ji Rutian and Duan Tian followed him into the forest. Before Fang Wang could speak, Duan Tian was the first to say, “I’ll go build a pavilion!”<br/><br/>The corners of Fang Wang’s mouth curved up in a smile, “Little Ji, your disciple isn’t bad; I like him.”<br/><br/>Little… Ji?<br/><br/>When Ji Rutian heard this address, his face immediately stiffened, but such an address indicated that the relationship between the two had grown closer.<br/><br/>“Indeed, he’s not bad, and with a Great Saint as his support, his future achievements are immeasurable,” Ji Rutian replied.<br/><br/>Xiao Zi laughed and said, “Then you’d better not be surpassed by your disciple. The backgrounds of those Dao Sects of Wangdao can’t be considered lesser than your Ji Family descendants.”<br/><br/>Ji Rutian said calmly, “The Ji Family has become the past.”<br/><br/>Fang Wang patted his shoulder, smiling, “If you become a saint and spread your leaves, couldn’t you continue the Ji Family’s lineage? If you recreate the Ji Family, perhaps you could even surpass the old ancestors of the Ji Family.”<br/><br/>Upon hearing these words, Ji Rutian’s eyes shone brightly.<br/><br/>“Could someone like me… really become a saint?” Ji Rutian couldn’t help but ask.<br/><br/>He had been defeated by Fang Wang and had also lost to Fang Zigeng. Now in Fang Wang’s presence, he felt even more acutely his own mediocrity, leading him to doubt whether he could truly become a saint.<br/><br/>In his view, an era should only give birth to one Great Saint.<br/><br/>“Why couldn’t you? If not before, maybe you can in the future. I aim not to be a Great Saint, nor a Great Emperor; I want to tread a path that has never before been walked. When that time comes, among the Twelve Dao Sects, everyone will be either saints or emperors, and your achievements will not merely be measured by that of a Great Saint!” Fang Wang said earnestly.<br/><br/>Such grand words were spoken, yet Ji Rutian found no reason to doubt them.<br/><br/>It was his words…<br/><br/>Perhaps they truly could…<br/><br/>No!<br/><br/>They most certainly could!<br/><br/>Ji Rutian’s heart was ignited once again. Without waiting for him to speak, Fang Wang began chatting with him about Kunlun.<br/><br/>In the trying years of cultivation, there always needs to be time set aside for relaxation. Fang Wang had always been mindful of his own Kunlun, and once Kunlun was completely established, he intended to create the foremost Daoist training ground of the ancient and modern worlds. At that time, he planned to teach and guide all the living beings of the world.<br/><br/>What those mighty beings did not dare to do, or were unwilling to do, he wanted to do!<br/><br/>Even if it might cultivate enemies, he didn’t care because he believed he could always walk at the pinnacle of the Mortal Realm. And enhancing the strength of the Mortal Realm was one of his plans to confront The Upper Realm.<br/><br/>Why should The Upper Realm always be above? Why couldn’t Xuanzu’s World become The Upper Realm?<br/><br/>Even if it couldn’t, he wanted the world he lived in to become a place free from the threats of other worlds!<br/><br/>He did not wish for universal peace, only to forge a path in the Mortal Realm where the pursuit of The Path of Immortality could be limitless!<br/><br/>Ji Rutian listened intently. The more he listened, the more reverence he held for Fang Wang.<br/><br/>In the past, he had thought himself an enemy of such a person—not only was it an overestimation of his own abilities, but it was also against the Heavenly Dao.<br/><br/>He even suspected that Fang Wang’s self-proclamation as the Heavenly Dao wasn’t to manifest as a saint, but perhaps Fang Wang himself was the embodiment of the Heavenly Dao’s will, coming to save the myriad beings of the Mortal Realm. His love was not solely for Xuanzu’s World, but for all worlds under the heavens!<br/><br/>…<br/><br/>In the Descending Dragon Continent, within Grand Qi, Sword Heaven Marsh.<br/><br/>Inside a multi-storied pavilion, Hong Chen, Dugu Wenhun, Song Jinyuan, Zhu Rulai, Jiang Shenming, Yang Du, and a group of Great Cultivators from Wangdao gathered here.<br/><br/>Hong Chen and Dugu Wenhun stood on either side of a treasured seat. They were not seated, leaving one spot vacant expressly for Fang Wang, as if the Dao Master were present.<br/><br/>At this moment, in the center of the grand hall stood a two-zhang-tall piece of blue jade, crystal clear and seemingly encapsulating countless stars within—staggeringly beautiful.<br/><br/>“Is that really the legendary Dao-origin Spirit Jade?”<br/><br/>“Legend has it, this jade naturally forms from the essence of heaven and earth, a confluence of their quintessence. It takes a million years to form just one piece. It was the foundation stone of a great and ancient teaching’s sect during ancient times.”<br/><br/>“That’s right. It’s said that once a Dao Sect binds with the Dao-origin Spirit Jade, cultivating within the sect will greatly enhance one’s comprehension.”<br/><br/>“To offer such a treasure to us, Tiangong Sect has truly given us a great auspicious fate. If the Dao Master knew, he would certainly be delighted.”<br/><br/>“Hahaha, establishing Kunlun is precisely the duty of our Tiangong Sect. If such can assist Wangdao in becoming the premier Dao throughout history, our generation will die with no regrets.”<br/><br/>Not only were there Wangdao Cultivators in the grand hall, but also two cultivators from Tiangong Sect: Tian Cheng, the Sect Hierarch’s deputy, and Qiao Chengzhi, the current head of the Qiao Family.<br/><br/>Tian Cheng appeared elderly, leaning on a wooden staff, one hand twisting his pale beard, his face beaming with a smile.<br/><br/>Qiao Chengzhi was equally pleased; with the appearance of the Dao-origin Spirit Jade, Wangdao could be considered thoroughly linked with Tiangong Sect. And as the pivot between the two, the Qiao Family naturally stood to gain the most.<br/><br/>“May I inquire where this jade came from?”<br/><br/>Hong Chen suddenly spoke, breaking the hubbub in the hall.<br/><br/>All eyes turned to him. Tian Cheng, facing this Wangdao Xuan Zong, dared not disrespect, so he replied, “One of our disciples passed by a mountain village, and while helping cure a plague there, the village chief, in gratitude, guided him to a cave. That cave held enchantments that mortals could not bypass, protected generation after generation by that village. They had long wished to leave, so they took this opportunity to give it to our disciple.”<br/><br/>At these words, the Wangdao Cultivators couldn’t help but praise the Tiangong Sect disciple’s good deed.<br/><br/>Tian Cheng’s smile returned to his face.<br/><br/>Hong Chen walked to the front of the Dao-origin Spirit Jade; he raised his right hand, crushed the fingertip, and wrote three strange blood characters on it.<br/><br/>All eyes fixed on him, Tian Cheng frowned, his gaze flashing with displeasure.<br/><br/>Hong Chen, ignoring everyone’s stares, began to chant and calculate with both hands, his pupils continually reflecting fleeting shadows, their transformations unpredictable and flashing with enchanting colors.<br/><br/>After a while.<br/><br/>Hong Chen stopped and said, “There’s no problem, I was overly concerned.”<br/><br/>At this, Tian Cheng chuckled, saying nothing further, while Qiao Chengzhi released a sigh of relief.<br/><br/>The reputation of the Wangdao Xuan Zong was well known; it was said he could calculate fate, possessing divine skills mysterious to both gods and spirits.<br/><br/>“Take our two Dao friends to rest. I need to discuss with the Dao Sects how best to secure this treasure. Such a prize will surely attract much ambition, and we must deal with it cautiously.”<br/><br/>Hong Chen instructed, and the cultivators immediately complied. Tian Cheng and Qiao Chengzhi nodded in acknowledgment and departed with the others.<br/><br/>When only Dugu Wenhun and the Dao Sects remained in the grand hall, Hong Chen asked, “What do you all know about Ji Yutian and the Thousand Eyes Great Saint?”<br/><br/>Zhu Rulai asked with surprise, “Why mention these two? I’ve heard of the Thousand Eyes Great Saint—he used to be the enemy of the Dao Master. He wished to revive himself but was exterminated by the Dao Master. Could it be that he is veering for a comeback?”<br/><br/>Hong Chen looked at the Dao-origin Spirit Jade and smiled, “If they wish to use this jade to scheme against Wangdao, then we’ll just reverse their ruse. Gentlemen, you’ll soon be unable to remain idle.”\t\t\t\t\t\t</div>", "images": {}, "success": true}