{"id": 393, "url": "https://www.novelhall.com/i-became-an-immortal-on-mortal-realm-32879/14956373.html", "title": "Chapter 383 - Chapter 383: Chapter 380: The Sacred Heart Is Broken, Unprecedented", "volume": 4, "volume_title": "Volume 4", "body": "<h1>Chapter 383 - Chapter 383: Chapter 380: The Sacred Heart Is Broken, Unprecedented</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 383: Chapter 380: The Sacred Heart is Broken, Unprecedented<br/><br/>Facing Fang Wang’s arrogance, Sin Saint’s face, filled with black lines, became twisted, his eyes ablaze with towering rage.<br/><br/>As a Great Saint, to be so disrespected!<br/><br/>“How dare you!”<br/><br/>Sin Saint bellowed angrily, his flesh exploding suddenly into a terrifying blood storm that enveloped Fang Wang, the storm teeming with countless black runes.<br/><br/>Fang Wang felt the threat and, not overestimating himself, he fiercely planted the Heavenly Palace Halberd on the Sin Resentment Stele. Accompanying an earth-shattering boom, the blood storm around him was swept away.<br/><br/>Once again a skeleton, Sin Saint stepped forward and struck at Fang Wang with his right palm, shattering the space around them. In an instant, they were both plunged into a chaotic temporal space, surrounded by spinning, twisting voids mixed with currents and blasts of different colors.<br/><br/>Fang Wang struck out with his left palm and then clenched his fist.<br/><br/>Great Returning Void Palm!<br/><br/>Caught off guard, Sin Saint tried to counter with his sacred power, but he could only withstand for a moment before disintegrating into ashes.<br/><br/>Afterward, Fang Wang returned to reality, still atop the Sin Resentment Stele.<br/><br/>He turned and swung his halberd, just as the newly-resurrected Sin Saint wielded a stele akin to a ruler, aiming it at Fang Wang.<br/><br/>Boom!<br/><br/>Two domineering forces dispersed the winds above, leaving two extremely long trails in the firmament, a magnificent sight to behold.<br/><br/>Ji Rutian, Duan Tian, and others below couldn’t discern the details of Fang Wang and Sin Saint’s battle, but they could clearly sense that Fang Wang had the upper hand; his movements were slower, while Sin Saint kept vanishing and reforming his physical body, his aura growing more tumultuous.<br/><br/>“So strong…”<br/><br/>Duan Tian muttered while watching the fierce battle above.<br/><br/>The other three, who were hanging in the golden net, were dumbstruck.<br/><br/>Below, among the ruins of the land, Niu Hai pushed aside the rocks on top of him and shakily stood up.<br/><br/>Fang Wang’s earlier Great Returning Void Palm hadn’t destroyed the land but had only wiped out the bones between heaven and earth, so Niu Hai wasn’t affected.<br/><br/>Confusion filled Niu Hai’s eyes as his gaze involuntarily shifted skyward.<br/><br/>He caught sight of Sin Saint growing tens of thousands of feet tall, like a deity carving out the heavens and the earth. Sin Saint lifted the Sin Resentment Stele with both hands and, with a swing, struck at Fang Wang.<br/><br/>As it swept through, the bloody words on the surface of the stele erupted with vast waves of blood energy, enveloping it completely. From a distance, it seemed like a bloody claw was smashing towards Fang Wang, unstoppable.<br/><br/>Fang Wang didn’t dodge, instead twisting at the waist and stabbing out with his halberd. The Mie Jue Divine Tome swept past his body, fiercely colliding with the Sin Resentment Stele and scattering its blood energy.<br/><br/>Both were shocked.<br/><br/>“Damn it…” Sin Saint gnashed his teeth, feeling utterly helpless against Fang Wang.<br/><br/>Fang Wang, meanwhile, was startled by the stele’s hardness; even the force of the Mie Jue Divine Tome could not shake it.<br/><br/>What was the origin of this stele?<br/><br/>In that moment, Fang Wang executed The Heaven of Carefree Freedom, stepping into the Underworld in one stride and moving forward before leaping out of the Mortal Realm. He appeared beside Sin Saint as if teleporting.<br/><br/>He swept the Heavenly Palace Halberd horizontally, cutting Sin Saint in half at the waist.<br/><br/>Bones shattered and then turned into ash.<br/><br/>Sin Saint was once again annihilated by Fang Wang.<br/><br/>Again and again, Fang Wang was determined to make good on his previous words; he intended to kill to the end.<br/><br/>Immortal and indestructible? So what!<br/><br/>It was a matter of who would yield first!<br/><br/>As the battle in the sky repeated incessantly, Duan Tian began to rescue Ji Rutian, but his Spiritual Power was repelled as soon as it touched the golden net, leaving him extremely anxious.<br/><br/>“Young man, see those two skeletons beside you? Erase the runes on them, and we can get free,” an elder said, hanging his head. He struggled to look up at the firmament, his eyes filled with excitement.<br/><br/>“`<br/><br/>Upon hearing the words, Duan Tian immediately did as instructed.<br/><br/>While battling Sin Saint, Fang Wang began to use various other Spells and Divine Skills he had mastered, even switching his Lifespirit Treasure, and the fully-focused him was always able to strongly exterminate Sin Saint within a few breaths.<br/><br/>The rate at which Sin Saint reconstituted his fleshly body began to slow.<br/><br/>He was increasingly astonished in his heart.<br/><br/>He could not understand how Fang Wang had mastered so many powerful secret techniques and cultivated them to such a profound level.<br/><br/>Half an hour later.<br/><br/>Sin Saint was horrified to discover that Fang Wang’s onslaught had not weakened, his Spiritual Power seemed inexhaustible.<br/><br/>Ji Rutian had already been rescued by Duan Tian, and at this moment, they were all watching this battle from the ground.<br/><br/>After being exterminated once again, Sin Saint couldn’t help but shout, “Stop!”<br/><br/>Fang Wang’s Rainbow Sword stopped in front of Sin Saint, whose bones were still in the process of coalescing, with only the head formed.<br/><br/>Underneath the Fox Mask, Fang Wang’s eyes were so cold and severe, leaving Sin Saint dazed.<br/><br/>Those eyes, just like a True God of the Heavenly Palace, only the sense of oppression they gave was entirely different; this time’s Fang Wang was stronger than the True God of the Heavenly Palace!<br/><br/>“Although Senior is immortal and indestructible, regenerating a fleshly body must also consume some kind of power, right?”<br/><br/>Fang Wang said, his tone indifferent.<br/><br/>Sin Saint’s bones began to grow flesh, and a look of resignation appeared on his face as he said, “If I could regenerate my fleshly body at will, what kind of curse would that be? Every time I rebuild my body of flesh, I use the bodies of those beings who died in the forbidden zone. Once they are exhausted, I will be left with only my will.”<br/><br/>Fang Wang fell silent; he began to feel a bit of sympathy for Sin Saint.<br/><br/>“There are too many secret techniques in your possession, and more is not necessarily better.” Sin Saint’s tone shifted, offering a reminder.<br/><br/>After calming down, he was no longer angry, looking at Fang Wang with eyes filled with anticipation and admiration.<br/><br/>Fang Wang replied, “This is the path I have chosen, and I will integrate them all to create my own Dao.”<br/><br/>“This will delay your cultivation,” Sin Saint said, shaking his head.<br/><br/>Fang Wang retorted, “Does Senior know how old I am this year, and what realm I am in?”<br/><br/>Sin Saint pondered, “Last time you came, you were eight hundred years old, in the Celestial Qiankun Realm. This time, you are either younger or your cultivation is higher.”<br/><br/>Fang Wang answered, “I have not yet reached six hundred years old, Ninth Level of the Sky-Stepping Realm.”<br/><br/>He suddenly realized, the True God of the Heavenly Palace might also have a Heavenly Palace, but did not rely too much on it, hence his swift increase in cultivation, but his strength during the same period was not as great as Fang Wang’s.<br/><br/>Sitting in seclusion within the Heavenly Palace was tormenting, in a certain sense similar to Sin Saint’s current situation.<br/><br/>Often, Fang Wang felt like giving up, but when he thought of Zhou Xue’s resurrection, he didn’t want to be left behind by Zhou Xue, nor did he want to die at some point in the future and regret not having worked harder now.<br/><br/>Sin Saint was stunned, mumbling to himself, “Ninth Level of the Sky-Stepping Realm…”<br/><br/>He found it absurd, unable to accept it.<br/><br/>“To be defeated by one in the Sky-Stepping Realm… to be defeated by the Sky-Stepping Realm…”<br/><br/>Sin Saint began to laugh, a laugh that was frantic, bitter.<br/><br/>His saintly heart was breaking.<br/><br/>On the ground, Ji Rutian and the others were also shocked.<br/><br/>Ji Rutian had always been unclear about the extent of Fang Wang’s realm, only now learning that Fang Wang was still in the Sky-Stepping Realm, and he didn’t feel relieved, but even more astonished.<br/><br/>A Sky-Stepping Realm exterminating a Great Saint?<br/><br/>Such a tale had never been heard in all of history!<br/><br/>The other three souls were even beginning to doubt they had heard correctly.<br/><br/>Fang Wang spoke, “Senior, can you see the next time you see me?”\t\t\t\t\t\t</div>", "images": {}, "success": true}