{"id": 392, "url": "https://www.novelhall.com/i-became-an-immortal-on-mortal-realm-32879/14946669.html", "title": "Chapter 382 - Chapter 382: Chapter 379: Battle Sin Saint, Kill You Countless Times", "volume": 4, "volume_title": "Volume 4", "body": "<h1>Chapter 382 - Chapter 382: Chapter 379: Battle Sin Saint, Kill You Countless Times</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 382: Chapter 379: Battle Sin Saint, Kill You Countless Times<br/><br/>Duan Tian looked at everything before him, feeling a great shock both visually and spiritually.<br/><br/>Wherever he looked, there was nothingness, a vast vacuum area had appeared in the originally chaotic and noisy world.<br/><br/>Duan Tian had seen such Divine Skills from Tiandao Fangwang before, but they had never been as shocking as they were today.<br/><br/>When the innumerable giant skeletons rose into the air, he felt as if the world was about to be shattered, but then Fang Wang simply pressed down with one hand and all was silent again.<br/><br/>Ji Rutian was equally dumbfounded, and the other three soul bodies beside him gradually woke up, all of them male souls.<br/><br/>“What’s going on?”<br/><br/>“What is that?”<br/><br/>“It feels so bad… Who am I…”<br/><br/>Ji Rutian and Duan Tian did not pay attention to the three soul bodies beside them, they looked involuntarily towards Fang Wang.<br/><br/>After obliterating all the white bones below with a palm, Fang Wang abruptly looked up, lifted the Heavenly Palace Halberd, and slashed towards the sky.<br/><br/>With one swing of the halberd, the thunderclouds above were instantly split, and sunlight poured down through the gaps in the clouds, like an extremely long streak of Sword Qi with ends unreachable.<br/><br/>The sky seemed to be cleaved in half!<br/><br/>The Sin Saint was seen hovering in the sky, his right hand gripping a black staff, and his left hand raised high, holding the Sin Resentment Stele, which was larger than a mountain.<br/><br/>The blood characters on the surface of the Sin Resentment Stele began to move, threads of blood qi seeped out, rapidly expanding, and in less than two breaths, a huge bloody face appeared above the stele, looking down upon all the beings on earth.<br/><br/>This was an extremely ferocious face, indistinguishable as male or female, without pupils, with red eyes and a face covered in raised blood vessels.<br/><br/>“Tiandao Fangwang, in your last life, you were defeated by this very move. Feel the fear deep within your heart!”<br/><br/>The Sin Saint laughed wildly, and before his words had died away, the mysterious bloody face in the sky suddenly burst open its eyes, and in that instant, the entire world twisted as if the surface of a lake had been stirred.<br/><br/>Thump! Thump! Thump…<br/><br/>Fang Wang heard the echoing of heavy heartbeats between heaven and earth, feeling a force far surpassing the Celestial Qiankun rushing at him from all directions, trying to invade his flesh.<br/><br/>With a boom!<br/><br/>Fang Wang’s momentum exploded completely, the silver energy around his body and the dazzling Yang Energy were mixed with strands of grey energy.<br/><br/>Immeasurable Pure Bone!<br/><br/>Dao Power!<br/><br/>Fang Wang raised the Heavenly Palace Halberd high, infusing the overbearing Dao Power within his body into the halberd, and stimulated the supremely powerful force contained within the halberd.<br/><br/>This Lifespirit Treasure had always been his most powerful Magical Artifact, inherently containing an extremely mysterious power!<br/><br/>The stronger the force Fang Wang infused, the stronger the force the Heavenly Palace Halberd could mobilize, and the combination of the two could destroy the heavens and the earth.<br/><br/>At this moment, a faint shadow emerged within the energy around Fang Wang’s body, wearing golden armor. It was the shadow of the Tianling Body!<br/><br/>“True God of the Heavenly Palace… you actually…”<br/><br/>The Sin Saint, high above, was moved, as if he had seen something unbelievable.<br/><br/>Suddenly, Fang Wang hurled the Heavenly Palace Halberd.<br/><br/>The Great Perfection’s Sword Control Technique!<br/><br/>The simpler it was, the more it could unleash extreme power!<br/><br/>With a single throw of the halberd, the twisted world instantly shattered, the firmament was dispersed by the Heavenly Palace Halberd, the terrifying bloody face was pierced through by the halberd in one fell swoop, and then it disintegrated.<br/><br/>Everything in the world returned to normal.<br/><br/>Fang Wang leaped up and in one step reached the Sin Saint’s side.<br/><br/>He raised his right hand high, and the Heavenly Palace Halberd, falling faster, landed in his hand. He swung it in a circle, smashing the blade of the halberd towards the Sin Saint.<br/><br/>The Sin Saint raised his hand to strike Fang Wang, and in an instant, a deafening bell rang out, and the Heavenly Palace Halberd was forcibly blocked by an invisible force.<br/><br/>A giant shadow of a bell suddenly appeared, occupying the entire world before disappearing the next second, making those like Duan Tian and Ji Rutian below feel as if they were seeing an illusion.<br/><br/>Fang Wang’s right arm suddenly exerted force, causing the Sin Saint’s complexion to drastically change. Before he could dodge, the Heavenly Palace Halberd pressed down, forcing the Sin Resentment Stele to begin falling.<br/><br/>Boom boom boom—<br/><br/>The Sin Resentment Stele hit the ground, raising a thousand zhang of dust and burying the figures of Fang Wang and the Sin Saint.<br/><br/>“There’s actually someone who can contend with a Great Saint… Could he also be a Great Saint?” muttered a man to Ji Rutian’s left, looking like a young monk, his physique thin and frail.<br/><br/>Ji Rutian took a deep breath, and upon hearing that the enemy was a true Great Saint, he was not at all surprised.<br/><br/>To him, Great Saints could not compare to Fang Wang!<br/><br/>Chant—<br/><br/>The sound of dragons chanting exploded, and everyone looked up to see nine Black Dragons bursting out of the rolling dust clouds, unstoppable, tearing through the Firmament with their immense power!<br/><br/>A bright light burst forth from above the nine dragons, causing the world to lose its color.<br/><br/>In the darkness, Fang Wang sheathed his halberd. The bright light shone upon his Fox Mask, and then suddenly the surrounding darkness transformed into a strange new world.<br/><br/>A Blood Moon hung high in the sky, the earth undulated with mountains, and skeletons strewn all over.<br/><br/>In the distance, stalwart figures were standing up one after another. Fang Wang’s gaze swept over them, and he found that these figures were not the same giant skeletons as before, but rather a group of armored giants, each emitting a vast, savage aura.<br/><br/>These giants, armed with weapons and both male and female, seemed to sense something and all turned their heads to look at Fang Wang.<br/><br/>Fang Wang sensed that they were not illusions, their vital blood extremely burning hot, like so many furnaces.<br/><br/>Even more authentic than the Spiritual Elephant of the Celestial Qiankun!<br/><br/>It was as if in an instant, a real world had been created.<br/><br/>If that were the case…<br/><br/>The eyes beneath Fang Wang’s mask flashed with a cold light, and in an instant, his aura turned black, his body exuding an endless murderous energy.<br/><br/>…<br/><br/>On the other side of the Immortal Road, within a forbidden area.<br/><br/>Sin Saint stood atop the Sin Resentment Stele, a self-satisfied smile on his face.<br/><br/>Beneath the Sin Resentment Stele was a domain of absolute darkness, and the end of the Stele plunged into the darkness, its depth unreachable.<br/><br/>Ji Rutian, Duan Tian, and the others looked up at the Firmament, positioned under the darkness.<br/><br/>The darkness above pressed down on them, and an inexplicable fear filled their hearts.<br/><br/>Even the three people beside Ji Rutian quieted down, staring blankly at the Firmament as if waiting for their fate to descend.<br/><br/>Aboved the darkness, the Sin Saint stretched, muttering to himself, “Compared to before, you have indeed become a lot stronger, but unfortunately, you are still so careless. Although you’re stronger, the battle ended even…”<br/><br/>Boom!<br/><br/>The darkness below suddenly exploded, a strong wind capable of swallowing the world surged upward, aggressively billowing the Sin Saint’s Dao Robe, threatening to tear it apart.<br/><br/>Just as the Sin Saint was about to raise his hand, a puncture sound rang out— the halberd’s blade pierced through his chest, startling him to look over reflexively.<br/><br/>His eyes widened in shock, as if he had seen something unbelievable, he cried out, “Mie Jue Divine Tome! How do you have the inheritance of the Absolute Emperor?”<br/><br/>At that moment, Fang Wang stood behind him, holding the Heavenly Palace Halberd in one hand, with a black tome floating behind him, mysterious and eerie.<br/><br/>Fang Wang twisted his hand holding the Heavenly Palace Halberd, and the power of the Mie Jue Divine Tome erupted, flooding into the Sin Saint’s body.<br/><br/>The Sin Saint was annihilated on the spot, turning into ash!<br/><br/>Fang Wang sheathed his halberd and turned around, saying, “Senior, I can kill you countless times more, until you are satisfied.”<br/><br/>As soon as his words fell, a white skeleton condensed out of thin air a few zhang away. Then, black qi surged, and the Sin Saint emerged from it, his face extremely ugly.\t\t\t\t\t\t</div>", "images": {}, "success": true}