{"id": 396, "url": "https://www.novelhall.com/i-became-an-immortal-on-mortal-realm-32879/14959291.html", "title": "Chapter 386 - Chapter 386: Chapter 383: The Goal Of The Great Saint, The Contest Of Fate", "volume": 4, "volume_title": "Volume 4", "body": "<h1>Chapter 386 - Chapter 386: Chapter 383: The Goal Of The Great Saint, The Contest Of Fate</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 386: Chapter 383: The Goal of the Great Saint, The Contest of Fate<br/><br/>The golden lotuses floated in the sky, their descent slowing down, and as their number increased, the boundless blue sea below began to shimmer with a golden luster.<br/><br/>All the cultivators on the floating islands watched with surprise as the seas swelled with waves, and innumerable fish leapt out, making the entire surface seem chaotic.<br/><br/>Great Saint!<br/><br/>These two words deeply impressed themselves upon Yang Lin’er’s heart; she was filled with curiosity.<br/><br/>Could a Great Saint possibly be compared to an Immortal Divine?<br/><br/>Having been in the Mortal Realm for many years, Yang Lin’er’s mindset began to change. She kept Fang Wang in her heart, and now cultivation had become her own favorite pursuit and goal to strive for.<br/><br/>Back on Earth, her dreams were quite superficial, centered on making money to prove herself, as she thought that money was the most important thing in the world. However, once she truly possessed wealth, before she had the chance to spend more time with Fang Wang, she arrived in the cultivation world where her beliefs were greatly shaken.<br/><br/>She could feel the nature’s spiritual energy becoming richer as the sky rained down golden lotuses.<br/><br/>At that moment, she had an epiphany.<br/><br/>She wanted to become a saint!<br/><br/>Not for others, but for herself!<br/><br/>…<br/><br/>Across the path of immortality, figures flew out from the vast fog, including Ji Rutian, Duan Tian, Niu Hai, and three other cultivators.<br/><br/>The sunlight poured down, and Ji Rutian couldn’t help but spread his arms wide as the feeling of being reborn was extraordinarily delightful.<br/><br/>“Master, why do I feel like you’ve turned a misfortune into a blessing?” Duan Tian asked curiously.<br/><br/>Ji Rutian’s mouth turned up into a smile as he said, “Indeed, that Great Saint has given me a stronger physical body.”<br/><br/>“It seems that he is a good person.”<br/><br/>“Wrong, he did it out of respect for the Dao Master.”<br/><br/>“Hmm? That seems reasonable, the Dao Master has already re-cultivated nine times, and was once a True God of the Heavenly Palace, just the title sounds incredible.”<br/><br/>Duan Tian’s face showed fervent admiration; now, in his heart, Fang Wang was the strongest person and the existence he most wanted to chase after.<br/><br/>Just then, a dragon’s roar exploded through the air.<br/><br/>A thousand-foot long Xiao Zi burst from the ocean depths, rapidly flying towards them, with a figure in black standing on its Dragon Head—it was Fang Wang.<br/><br/>Upon seeing Fang Wang, even the three cultivators of unknown origins became tense.<br/><br/>Fang Wang was, after all, a terrifying being who had forced the Sin Saint to lower his head!<br/><br/>Once Xiao Zi approached them, they all bent down and saluted with their fists.<br/><br/>Fang Wang spoke, “The four of you can leave now.”<br/><br/>Upon hearing this, the three cultivators quickly spoke up.<br/><br/>“Senior, why don’t you take us with you?”<br/><br/>“Yes, senior, our cultivation is not weak; we’re all at the level of Celestial Qiankun.”<br/><br/>“That’s right, senior, give us a chance!”<br/><br/>Fang Wang had already discerned their cultivation levels and responded, “I will be leaving this Mortal Realm, are you really willing to follow?”<br/><br/>The three nodded in unison, looking eagerly at Fang Wang.<br/><br/>For them, wealth and power were no longer important. Staying in this Mortal Realm would indeed allow them to enjoy the treatment of the mightiest, but only by following Fang Wang would they have the opportunity to witness the chance to become saints and immortals.<br/><br/>Fang Wang asked them to introduce themselves, and the three immediately did so without any reservations.<br/><br/>They introduced themselves as Wei Buyu, Long Changsheng, and Hai Zun, existing Celestial Qiankun beings of that Mortal Realm, who, a thousand years prior, ventured into the other shore of the immortal path and were trapped for a millennium.<br/><br/>This Mortal Realm was known as the Great Cold Mortal Realm. Every ten thousand years, an opportunity for ascension would come. The three were once enemies, creating a tripartite division of power in this realm. With the opportunity for ascension approaching, only one individual could ascend every ten thousand years. Therefore, they set their sights on the other shore of the immortal path, hoping to strengthen themselves before the chance of ascension arrived.<br/><br/>“Who would have thought that the three of them would stumble at the threshold of the Immortal Path, tortured by the Sin Saint for a thousand years.”<br/><br/>“Now, they no longer yearned for the chance to ascend, for in Fang Wang they saw a greater hope.”<br/><br/>“After hearing this, Fang Wang agreed to take them along.”<br/><br/>“Xiao Zi turned to Niu Hai and huffed, ‘I’m entrusting you with the care of my Dragon Palace. I will return, and if I find that you’ve mistreated the Dragon Palace, watch out, I…’”<br/><br/>It didn’t finish its sentence, but the threat was clear.<br/><br/>“Niu Hai hurriedly nodded, promising not to cause any trouble.”<br/><br/>“Fang Wang didn’t say more. With Spiritual Power covering Xiao Zi, Ji Rutian, Duan Tian, Wei Buyu, Long Changsheng, and Lord of the Sea, he stepped out and they vanished into thin air.”<br/><br/>“Niu Hai breathed a sigh of relief, and a smile spread across his face.”<br/><br/>“‘Finally, they are gone. Now, the world will belong to this prince!’”<br/><br/>“Thinking excitedly, Niu Hai failed to notice the strange black patterns emerging between his brows.”<br/><br/>“On the other side, Fang Wang employed the Heaven of Carefree Freedom, covering distances in a single step, leaving Wei Buyu and the others dumbfounded.”<br/><br/>“‘We are truly traversing the Mortal Realm!’”<br/><br/>“‘What Divine Skill is this?’”<br/><br/>“‘Impressive indeed, no wonder the Sin Saint stood no chance against him.’”<br/><br/>“The three of them made a racket, hardly resembling accomplished cultivators, but their words secretly pleased Fang Wang.”<br/><br/>“Xiao Zi lay on Fang Wang’s shoulder and asked, ‘Young Master, did you previously warn me about something being wrong with Niu Hai?’”<br/><br/>“Looking ahead, Fang Wang replied calmly, ‘Indeed, he has not entered the forbidden zone, but he has been tainted by the Sin Saint’s aura, likely having to do with Ji Rutian’s severed head.’”<br/><br/>“The Sin Saint appeared to have given up, but in reality, he was still hiding schemes.”<br/><br/>“That was to be expected, as the Hongxuan Emperor, who suffered the same fate, was also striving to escape his destiny.”<br/><br/>“‘Tsk tsk.’ Xiao Zi made a strange noise and then asked no more.”<br/><br/>“After dozens of steps, Fang Wang descended.”<br/><br/>“He landed on an island, with the others following closely.”<br/><br/>“‘For now, let’s cultivate in this realm,’ Fang Wang instructed. After that, he walked towards the woods.”<br/><br/>“Wei Buyu and the other two immediately gathered around Xiao Zi, inquiring about Fang Wang’s identity. Wanting to understand how powerful Wangdao was, they eagerly listened as Xiao Zi began to boast extravagantly, leaving the three yearning for Xuanzu’s World.”<br/><br/>…<br/><br/>On the Human Emperor Continent, in the Grand Yu Divine Dynasty.<br/><br/>“Within a palace, Hong Xian’er sat in meditation on a jade bed, her gaze fixed on the water characters on the ground:<br/><br/>“‘The Primordial Sect Master has attained sainthood and will bring unprecedented Spiritual Energy to the Mortal Realm. Treasures buried deep in the earth and in minor realms will surface one after another. From now on, Fate will manifest itself. Once the gates to immortality open, only the nine with the strongest Fate will be able to ascend and become Immortals.’<br/><br/>“This was the message from Tai You of the Xuan You Great Teaching to Hong Xian’er.”<br/><br/>“Hong Xian’er frowned, ‘I have no desire to ascend to immortality.’<br/><br/>“The water characters began to change:<br/><br/>“‘Even if you do not seek immortality, to achieve Saintly Emperor Certification, you must pursue opportunities. Both saints and emperors must be known to all under the sky; this is the fundamental meaning behind the Primordial Sect Master’s message to all beings.’<br/><br/>“Renowned throughout the world!”<br/><br/>“Hong Xian’er raised her eyebrows, her eyes sparkling with excitement.”<br/><br/>“Her name was already well known, revered by both the Saint Clans and Imperial Clans for her talent. However, she was well aware that her fame had not yet reached a point where every being was aware of her, and it was still far off.”<br/><br/>“Her gaze fell back to the ground as Tai You’s message changed again: ‘I can teach you how to seize Fate to quickly strengthen yourself. I only ask for one thing in return. That is, I wish to arrange for several individuals to be reincarnated in the Grand Yu Divine Dynasty. This will require the Emperor’s consent, as he can sense the changes in the Fate of the entire Grand Yu Divine Dynasty.’\t\t\t\t\t\t</div>", "images": {}, "success": true}