{"id": 407, "url": "https://www.novelhall.com/i-became-an-immortal-on-mortal-realm-32879/14999318.html", "title": "Chapter 397 - Chapter 397: Chapter 394: The Powerful Thirty-Six Tian Gang Dao Venerates", "volume": 5, "volume_title": "Volume 5", "body": "<h1>Chapter 397 - Chapter 397: Chapter 394: The Powerful Thirty-Six Tian Gang Dao Venerates</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 397: Chapter 394: The Powerful Thirty-Six Tian Gang Dao Venerates<br/><br/>“`<br/><br/>Between the mountains, Xu Qiuming, with a straw hat on his head and clad in purple, walked along the mountain path. His head was slightly bowed, a blade of grass in his mouth, with two treasured swords hanging at his waist and a gourd on the other side, looking very much like a wandering swordsman.<br/><br/>Behind him, followed another person.<br/><br/>It was none other than Yang Jun.<br/><br/>Yang Jun, now looking to be in his early forties, followed behind Xu Qiuming, maintaining a distance of seven steps. Yang Jun appeared very nervous, as if he was afraid of losing sight of him.<br/><br/>“Your talent in the Sword Dao is mediocre, even if I teach you swordsmanship, it would be a waste of time,”<br/><br/>Xu Qiuming, walking ahead, said nonchalantly.<br/><br/>Yang Jun hastily replied, “I’m not afraid of wasting time. If I cannot attain the Dao, what’s the point of cultivating for a long time? I implore you, senior, to give me a chance; I am willing to work like an ox and horse for you!”<br/><br/>Xu Qiuming did not respond and continued to stroll forward.<br/><br/>A breeze swept through the mountains, as if carrying the songs of mountain maidens, fluttering the robes of Xu Qiuming and Yang Jun. Each harboring his own thoughts, they ceased to converse.<br/><br/>After a while,<br/><br/>Xu Qiuming suddenly halted, lifting his gaze to see figures appearing on the slope ahead. His eyes involuntarily settled on the figure in the center dressed in black.<br/><br/>The black-clothed person wore a fox mask, the silhouette causing him a moment of daze.<br/><br/>He inexplicably thought of Fang Wang. Fang Wang also had such a mask, though with a different color.<br/><br/>Fang Wang could not remember whether Xu Qiuming had seen his mask, but to be safe, he had altered this mask; from a white fox to a black one, with a cunning appearance that sent chills down one’s spine.<br/><br/>Wei Buyu, Han Yu, Ye Xunhuan, and the others were all eyeing Xu Qiuming with amusement. Their gazes made Xu Qiuming quite uncomfortable.<br/><br/>Instinct told Xu Qiuming that these people were very strong, and he was no match for them.<br/><br/>He had only felt this kind of sensation when facing the Celestial Qiankun of the Western Mortal Realm.<br/><br/>Could it be that all these people were Celestial Qiankun?<br/><br/>What power could possibly have so many Celestial Qiankun?<br/><br/>Xu Qiuming’s brows furrowed, and he unconsciously gripped the hilt of one of the swords at his waist.<br/><br/>Yang Jun, observing Fang Wang and the others, became nervous. It was evident that this group was not to be trifiled with, each emanating an overwhelming presence.<br/><br/>He couldn’t help but think of the sight when the Masters of the Seventy-Two Immortal Caves gathered together, and upon comparison, even all the Masters combined could not match the aura of these individuals.<br/><br/>Especially the one wearing the fox mask, who was clearly the leader—he was the only one wearing a mask.<br/><br/>Yang Jun looked towards Fang Wang. Fang Wang did not emit a single trace of energy, but among a group of individuals with terrifying presence, he appeared all the more unfathomable.<br/><br/>“Boy, keep staring, and I’ll gouge out your eyes.”<br/><br/>Chang Sikong’s gaze locked onto Yang Jun, his voice filled with bone-chilling intent to kill.<br/><br/>Among the crowd, his strength was not outstanding, but facing a cultivator like Yang Jun, his gaze made Yang Jun’s heart quake with fear, and he hastily bowed his head.<br/><br/>“Do you all have some matter?” Xu Qiuming asked neither submissively nor arrogantly. He protected Yang Jun with his own Spiritual Power, easing Yang Jun’s burden.<br/><br/>Ye Xunhuan stepped forward, raised his chin and looked down on Xu Qiuming, saying, “So, you are Xu Qiuming of the Wangdao Sword Sect? You’ve been challenging notable figures of the Sword Dao all over the Western Mortal Realm; indeed, you seem formidable. But does Wangdao seriously think it can sweep through the Western Mortal Realm with just you? Isn’t that a bit naive?”<br/><br/>“Or is it that Wangdao looks down upon the Western Mortal Realm?”<br/><br/>The others also revealed an unfriendly demeanor, and Ji Rutian, observing the situation, showed a mocking smile.<br/><br/>Xu Qiuming had met Ji Rutian before, and they had briefly crossed swords. He knew that Ji Rutian held a grudge against Fang Wang, and the Jin Xiao Sect was also investigating his whereabouts.<br/><br/>It was precisely because of this that he felt the mysterious person wearing the fox mask was not Fang Wang.<br/><br/>“Wangdao certainly does not look down upon the Western Mortal Realm. Wangdao would not look down upon any sect or any living being. I am not competing for the sake of competition; I only wish to exchange knowledge of the Sword Dao. May I ask for your origins?” Xu Qiuming replied, his tone indifferent.<br/><br/>“`<br/><br/>“`<br/><br/>Even though reason told him he had no chance of victory, he was unwilling to lose his pride.<br/><br/>Ye Xunhuan sneered, “Have you ever heard of the Thirty-Six Tian Gang Dao Venerate?”<br/><br/>Dao Venerate?<br/><br/>Xu Qiuming frowned even tighter, and Yang Jun’s heart was in his throat.<br/><br/>That title sounded terrifying!<br/><br/>The most critical thing was that the senior he admired dared not make a move.<br/><br/>This was unlike Xu Qiuming!<br/><br/>Yang Jun had been following Xu Qiuming for some time, and Xu Qiuming was not a man who wasted words; had it been someone else, Xu Qiuming’s sword would have already been at the other person’s throat.<br/><br/>Suddenly!<br/><br/>Ye Xunhuan’s gaze sharpened, and the firmament behind him turned a dark red as if a crimson tide quickly covered the entire sky, the ground cracked open, and tombstones rose, while the mountains far and wide also split, revealing towering stone statues of demons.<br/><br/>Celestial Phenomenon!<br/><br/>Yang Jun looked up, dumbstruck, unable to believe his eyes.<br/><br/>This was his first encounter with a Celestial Phenomenon, everything before him was shaking his perception and making him uneasy.<br/><br/>Ye Xunhuan looked down at Xu Qiuming, saying, “Draw your sword, let me feel the might of the Wangdao Sword Sect.”<br/><br/>He had just been miserably defeated in front of Fang Wang and now wanted desperately to retrieve his dignity, and Xu Qiuming was the perfect stepping stone.<br/><br/>He wanted to show Fang Wang his strength; he had even failed to use his Spiritual Elephant before, which was extremely humiliating.<br/><br/>As his words fell, the tombstones in the wilderness trembled violently, and an invisible pressure enveloped Xu Qiuming and Yang Jun, making them feel as though they were bound by chains, extremely uncomfortable.<br/><br/>Xu Qiuming tried to draw his sword but found that he could not lift his right hand, and the Treasured Sword at his waist also became unusually heavy.<br/><br/>“How could this be…”<br/><br/>Xu Qiuming’s pupils shook with shock; he too was encountering a Celestial Qiankun Phenomenon for the first time, and so he was very frightened.<br/><br/>Fang Wang looked on calmly, curious as to how Xu Qiuming would perform against Ye Xunhuan.<br/><br/>Wei Buyu frowned, silently transmitting a message to Ye Xunhuan, “After all, he’s from one of the Twelve Dao Sects; give the Dao Master some face, don’t make it too ugly.”<br/><br/>Upon hearing this, the terrifying pressure in the heavens and earth instantly lessened.<br/><br/>Almost in an instant, Xu Qiuming suddenly drew his sword.<br/><br/>Sword light flashed through the heavens and earth, cutting open all the tombstones and mountains within a hundred miles radius. In one leap, he reached Ye Xunhuan, his sword blade slashing across with unbelievable speed.<br/><br/>Boom—<br/><br/>Ye Xunhuan’s Spiritual Power exploded, shattering the ground and sending dust flying, with visible bursts of energy blocking Xu Qiuming’s sword strike.<br/><br/>Now, Ye Xunhuan’s complexion turned extremely unpleasant.<br/><br/>He had just now been unable to react; he couldn’t dodge in time, and the only reason he managed to burst forth with Spiritual Power was that his Magical Artifact robe automatically unleashed an energy shield when faced with impact.<br/><br/>Even though Xu Qiuming’s sword could not have killed him, the speed of Xu Qiuming’s draw was incredibly unbelievable.<br/><br/>Had this youngster reached the Sky-Stepping Realm already?<br/><br/>Xu Qiuming’s right arm trembled as he struggled to slice through the opponent’s shield, and this sent his heart plummeting.<br/><br/>His eyes grew resolute. Even if it meant death, he could not lose the pride of the Sword Sect!\t\t\t\t\t\t</div>", "images": {}, "success": true}