{"id": 403, "url": "https://www.novelhall.com/i-became-an-immortal-on-mortal-realm-32879/14993368.html", "title": "Chapter 393 - Chapter 393: Chapter 390: Breaking Through The Celestial Qiankun! A New Path Of Cultivation!", "volume": 5, "volume_title": "Volume 5", "body": "<h1>Chapter 393 - Chapter 393: Chapter 390: Breaking Through The Celestial Qiankun! A New Path Of Cultivation!</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 393: Chapter 390: Breaking through the Celestial Qiankun! A New Path of Cultivation!<br/><br/>Ever since Fang Wang began his closed-door cultivation to break through to the Celestial Qiankun Realm, the spiritual energy in this area became increasingly dense, which Han Yu and the other three also realized upon their arrival.<br/><br/>While cultivating, they found their understanding of the heavenly laws deepening, fueling their yearning and reverence for the mysterious and unknown Dao Master.<br/><br/>After Wei Buyu brought Han Yu and his companions here, he only stayed a few days before hastily departing again.<br/><br/>Until one day.<br/><br/>An unimaginable pressure erupted from the loft, startling everyone outside to open their eyes wide with faces full of fear.<br/><br/>Even the strongest among them, Han Yu, was frightened.<br/><br/>Having understood the Heavenly Dao Immensity Scripture, he knew that Fang Wang’s cultivation was exceedingly profound, but only upon truly sensing Fang Wang’s aura did he realize how insignificant he was.<br/><br/>The difference between an Immortal and a mortal!<br/><br/>Fang Wang’s pressure continued for a full seven days, after which it disappeared into thin air.<br/><br/>A year passed after that before Fang Wang finally emerged from the loft.<br/><br/>As the door opened, Fang Wang stood in the sunlight, and he couldn’t help stretching languidly.<br/><br/>After slaying Great Saint Shifa, he returned and underwent closed-door cultivation for eleven years, successfully breaking through to the Celestial Qiankun Realm!<br/><br/>Unlike previous realms, the Celestial Qiankun Realm didn’t divide into nine minor realms but only had four stages: early, middle, late, and Great Perfection.<br/><br/>For Fang Wang, these four stages were not important because he was set to embark on a completely new path.<br/><br/>And the Celestial Qiankun was the starting point of this path!<br/><br/>Ji Rutian, Duan Tian, and the four others quickly rose to their feet and gave Fang Wang a respectful bow.<br/><br/>“No need for formalities, get ready, it’s time to leave the Mortal Realm,” Fang Wang said with a smile, appearing approachable, which helped ease the nervousness of Han Yu and the others.<br/><br/>Ji Rutian immediately began to introduce the origins of Han Yu and his companions to Fang Wang, who listened while feeling the changes in his own cultivation.<br/><br/>It was undeniable that after stepping into the Celestial Qiankun Realm, everything had changed.<br/><br/>Fang Wang not only felt an unprecedented strength, but he also sensed a distinctive connection with all living things.<br/><br/>Once Ji Rutian finished speaking, Fang Wang turned to Han Yu and his companions with a smile, “Now that we’re all part of the Celestial Qiankun, why not feel my Spiritual Elephant?”<br/><br/>At these words, Han Yu and the others were taken aback. Just as they were about to speak, Fang Wang’s gaze intensified, and in an instant, the whole world experienced a slight tremor.<br/><br/>Just a slight one!<br/><br/>It was fleeting and even Duan Tian failed to notice it.<br/><br/>Ji Rutian seemed to sense something, his eyebrows knitted tightly, while Han Yu and the others were already utterly shocked.<br/><br/>“How is it possible… This Celestial Phenomenon was conjured so quickly, and it feels indistinguishable from reality…” Su Er, the only female Cultivator in the group, couldn’t help exclaiming, her voice filled with disbelief.<br/><br/>They believed that what Fang Wang had shown them was not an illusion, and this was precisely why they found it so unbelievable.<br/><br/>Han Yu frowned, fixing his gaze on Fang Wang.<br/><br/>The other two cultivators in the Celestial Qiankun Realm, Qing Daoren and Chang Sikong, equally struggled to remain composed.<br/><br/>Standing in front of the loft, Fang Wang raised his arms, laughing, “So? What do you think of my Celestial Qiankun Totem?”<br/><br/>Qing Daoren furrowed his brows, asking cautiously, “Is it so real it’s impossible to guard against?”<br/><br/>“No, a Spiritual Elephant can’t be without any offensive effects, we must have just not noticed yet…” Han Yu interjected, flying high, emerging from the forest, and glancing around; very soon, his expression drastically changed.<br/><br/>Su Er, Qing Daoren, and Chang Sikong had the same reaction, whereas Ji Rutian and Duan Tian seemed composed, no matter how incredible Fang Wang’s feats were, they would no longer be surprised.<br/><br/>Well, at least that is what they told themselves.<br/><br/>“So many presences of living beings… how is that possible…” Han Yu muttered to himself, his body trembling.<br/><br/>Fang Wang’s mouth curved into a smile, and the entire world once again fluctuated slightly, pulling back the thoughts of Han Yu and his three companions.<br/><br/>“Let’s go, it’s time to find them.”<br/><br/>Fang Wang spoke, and Ji Rutian and Duan Tian immediately walked up to him, with Duan Tian turning around to signal Han Yu and his group.<br/><br/>Han Yu and his companions were still in shock, but upon seeing Duan Tian’s gesture, they instinctively flew towards Fang Wang. Before they even touched the ground, Fang Wang suddenly lifted his right foot and stepped into the air in front of the stairs. In an instant, Han Yu and the others felt the world change around them.<br/><br/>When they focused their gaze, they saw two people sitting on a cliff below, one of them being Wei Buyu.<br/><br/>Their eyes widened, and their hearts were engulfed with towering waves of shock.<br/><br/>What kind of Divine Skills were these?<br/><br/>How could they possibly have arrived in front of Wei Buyu in one single step?<br/><br/>The reason Fang Wang could do this was because he had previously imprinted the mark of The Heaven of Carefree Freedom on Wei Buyu, locking onto his location and crossing the world in one step to arrive before Wei Buyu.<br/><br/>In a certain sense, Fang Wang was equivalent to teleporting!<br/><br/>Wei Buyu, sensing something, turned his head and upon seeing Fang Wang, he quickly stood up and bowed.<br/><br/>“Greetings, Dao Master!”<br/><br/>The words of Wei Buyu made the old man beside him look up. Fang Wang, in his white clothes, appeared like an Immortal, and those in front of him were each imposing in their own right.<br/><br/>Fang Wang said, “Prepare to leave, if there’s anything else, resolve it quickly.”<br/><br/>Upon hearing this, Wei Buyu immediately grabbed the collar of the old man beside him, scolding, “You old fool, hurry up and hand over that supreme teaching! Do you think I’m taking advantage of you? If you miss this opportunity, you will certainly regret it!”<br/><br/>With Fang Wang present, he dared not force the issue.<br/><br/>Actually, every one of these people was hardly an innocent do-gooder. In their search for supreme teachings, they had not taken lives, but their methods were not at all gentle.<br/><br/>“If he’s unwilling, then let’s go,” Fang Wang once again spoke.<br/><br/>Wei Buyu could only release his grip reluctantly.<br/><br/>The old man suddenly looked at Fang Wang and said, “Wait!”<br/><br/>He opened his mouth, which abnormally enlarged, and then spat out a scroll covered in saliva, a sight that made Su Er frown.<br/><br/>Fang Wang waved his hand, throwing a secret manual to the old man, then he said, “Wei Buyu, take his scroll.”<br/><br/>Wei Buyu quickly reached out to catch the scroll, then flew towards Fang Wang.<br/><br/>He had not yet reached Fang Wang when Fang Wang stepped out. Before his foot landed, they disappeared into thin air.<br/><br/>The old man stood up, patted his wrinkled clothes, and murmured, “I never imagined that someone like this could emerge from the Mortal Realm of the many heavens. It’s my ill-fated good fortune to encounter such a person.”<br/><br/>Elsewhere, Fang Wang successively found Long Changsheng and the Sea Sovereign. Both were cultivating without any urgent matters, so they followed Fang Wang and the others and left.<br/><br/>Lastly, Fang Wang found Xiao Zi.<br/><br/>Xiao Zi was cultivating within her own Demon Race Kingdom. The land was covered with continuous mountains, and as far as the eye could see, there were figures of various demons, even behemoths larger than mountains, with the overwhelming majority lying down sleeping.<br/><br/>Fang Wang raised his hand and grabbed Xiao Zi from across the space, collecting her directly into his palm.<br/><br/>The thousand zhang long Xiao Zi became the size of an eel.<br/><br/>The Sky Capturing Palm at Great Perfection!<br/><br/>After reaching the Celestial Qiankun Realm, Fang Wang’s Spiritual Power transformed. All of the Divine Skills he commanded took a qualitative leap.<br/><br/>Xiao Zi woke with a start, looking at Fang Wang with a dazed expression.<br/><br/>Some Great Demons awoke, and when they saw their king captured in someone’s palm, their eyes widened, unable to believe what they were seeing.\t\t\t\t\t\t</div>", "images": {}, "success": true}