{"id": 402, "url": "https://www.novelhall.com/i-became-an-immortal-on-mortal-realm-32879/14984537.html", "title": "Chapter 392 - Chapter 392: Chapter 389: The Gap Is Too Large, The Chosen Ones Attain The Dao", "volume": 5, "volume_title": "Volume 5", "body": "<h1>Chapter 392 - Chapter 392: Chapter 389: The Gap Is Too Large, The Chosen Ones Attain The Dao</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 392: Chapter 389: The Gap is Too Large, The Chosen Ones Attain the Dao<br/><br/>Fang Wang’s voice echoed between heaven and earth, lingering for a long time.<br/><br/>The face of Great Saint Shifa turned extremely ugly, as he felt humiliated and couldn’t accept that he had been suppressed by Fang Wang alone.<br/><br/>“Outsider, you have successfully angered me!”<br/><br/>As the voice of Great Saint Shifa rose, with a loud bang, his physical body turned into a mist of blood, and the black and white energies around him were scattered by the invisible force of the Great Returning Void Palm.<br/><br/>Boom boom boom—<br/><br/>The colors of the sky and earth changed, and the sound of thunder erupted suddenly, as rolling dark clouds gathered from all directions, like terrifying waves, advancing rapidly.<br/><br/>The ground beneath Fang Wang shattered, and fire from the earth surged up, drying up the rivers within a few breaths.<br/><br/>Fang Wang raised his palm again, reaching towards the sky.<br/><br/>Sky Capturing Palm!<br/><br/>This was a minor Divine Skill that Zhou Xue had taught Fang Wang, and with his current level of cultivation, he could truly capture the sky.<br/><br/>The thunderclouds in the sky were dragged down, looking like an enormous cone hanging in the firmament. With his right hand, Fang Wang grasped, seizing Great Saint Shifa’s neck.<br/><br/>Great Saint Shifa’s eyes widened, showing an expression of disbelief; now, he truly panicked.<br/><br/>“Who… who exactly are you?”<br/><br/>Great Saint Shifa asked with a trembling voice. His soul, having merged with the firmament through divine skills, was directly captured by the opponent. The process was not only fast but also left him completely powerless to resist.<br/><br/>The gap was just too large!<br/><br/>Fang Wang’s eyes beneath the mask stared intently at Great Saint Shifa and said, “Your body carries the scent of Immortal Divine beings, your Saint Dao seems not to have been achieved by your own efforts but by grovelling to Immortal Divines.”<br/><br/>Great Saint Shifa clenched his teeth and asked, “Do you despise Immortal Divines?”<br/><br/>He was even more astonished in his heart. He had initially thought that Fang Wang came from the Upper Realm, but now it seemed that wasn’t the case.<br/><br/>“So, is it the intention of the Immortal Divines that ordinary spirits are not allowed to cultivate, and you are just carrying it out?” Fang Wang asked.<br/><br/>Great Saint Shifa remained silent.<br/><br/>The dark clouds in the sky began to disperse, but the shattered earth continued to collapse. The fires from the earth turned into surging lava, sweeping through the mountains and rivers. Everywhere it passed, there was smog and retreat of living creatures, resembling an apocalyptic scene.<br/><br/>Seeing Great Saint Shifa’s silence, Fang Wang suddenly lost interest.<br/><br/>Living like a puppet on a string did not befit a saint, and this made him even more dismissive of the Great Saints.<br/><br/>Fang Wang spoke up, “Hand over your most powerful secret techniques, and I might spare your life. Otherwise, your True Soul will certainly be annihilated. You might have other methods of resurrection hidden away, but once you fall by my hand, it will inevitably cause your cultivation to regress. You must have felt the changing tides of the myriad worlds approaching.”<br/><br/>Great Saint Shifa took a deep breath and sighed, “I am inferior in skill and accept defeat. Since that’s the case, I will impart my cultivation technique to you, which I created when I became a saint.”<br/><br/>“Speak.”<br/><br/>Fang Wang nodded, showing no intention of loosening his grip.<br/><br/>The world was enveloped in smog, and Fang Wang stood upon the ruins, with the sunlight piercing through the True Soul of Great Saint Shifa. His soul appeared both solid and illusory, as if it could disperse at any moment.<br/><br/>Great Saint Shifa began to recite his cultivation technique, and Fang Wang listened carefully.<br/><br/>After a short half-hour, Great Saint Shifa stopped and said, “I have finished. This technique is profound and it would take a thousand years to master it.”<br/><br/>Fang Wang’s eyes, visible beneath the fox mask, turned exceedingly cold.<br/><br/>Boom!<br/><br/>Fang Wang instantly crushed the True Soul of Great Saint Shifa and disappeared from the spot.<br/><br/>The next second, he returned to the forest where Ji Rutian and Duan Tian were waiting, and he walked towards the loft.<br/><br/>Ji Rutian couldn’t help but ask, “Was that terrifying aura just now from a Great Saint of this Mortal Realm?”<br/><br/>Duan Tian also looked expectantly towards Fang Wang.<br/><br/>The aura of the Great Saint Shifa was so immense that it enveloped the entire Mortal Realm, causing both Ji Rutian and Duan Tian to fear.<br/><br/>“Yes, he took a hand at me, and I dealt with him,” Fang Wang casually replied.<br/><br/>Upon hearing this, Duan Tian immediately became exhilarated and curiously asked, “Senior, did you defeat him, or did you kill him?”<br/><br/>Ji Rutian couldn’t help but give his disciple a glance, as if to say, “You think it’s that easy to kill a Great Saint?”<br/><br/>“I destroyed his physical body and scattered his True Soul. Even if he can be revived, it will likely take him hundreds of years to recover his vigor.”<br/><br/>As Fang Wang spoke, he pushed the door open and entered, while his words stunned Ji Rutian and his disciple.<br/><br/>From the outbreak of the Great Saint’s aura to its abrupt cessation, how much time had passed?<br/><br/>After closing the door, Fang Wang sat in meditation in the hall, still feeling rather annoyed at having been deceived by the fake cultivation technique given by the Great Saint Shifa.<br/><br/>With the Celestial Court of the Upper Realm behind the Great Saint Shifa, Fang Wang could no longer act rashly; he must first reach the Celestial Qiankun Realm to strengthen himself.<br/><br/>After this battle, Fang Wang had new ideas about his Spiritual Elephant, growing increasingly excited as he began to implement them.<br/><br/>The battle between Fang Wang and the Great Saint Shifa provoked discussions everywhere, but no one knew what exactly had happened. Not to mention Fang Wang, even the existence of the Great Saint Shifa in this Mortal Realm was a mystery to most.<br/><br/>The battle came swiftly and departed just as fast. For the current tides of the Mortal Realm, it was insignificant and was soon forgotten.<br/><br/>After Fang Wang entered seclusion, time began to fly by swiftly.<br/><br/>Eight years later.<br/><br/>Wei Buyu returned, bringing with him four cultivators, three men and one woman, each with a lofty bearing.<br/><br/>“Is the Dao Master still in seclusion?” Wei Buyu asked as he approached Ji Rutian.<br/><br/>Ji Rutian opened his eyes and replied, “Yes, he’s making a breakthrough.”<br/><br/>His gaze inevitably fell upon the four people behind Wei Buyu, his eyes filled with curiosity.<br/><br/>“All four of them are at the Celestial Qiankun Realm, with remarkable fate, and are top-talented individuals of this world. Their ancestors included Great Saints and Great Emperors who were suppressed by the Immortal Divine, leading to the decline of their families. Therefore, they hold a deep grudge against the Immortal Divine. Hearing that the Dao Master has no wish to ascend but wants to establish a method of becoming an Immortal in the Mortal Realm, they were eager to join Wangdao,” Wei Buyu explained.<br/><br/>The four individuals introduced themselves one by one. Their tones were not arrogant, but compared to Ji Rutian, they were more curious about the Dao Master, Fang Wang.<br/><br/>Ji Rutian asked, “Are any of these four stronger than you?”<br/><br/>Wei Buyu laughed and said, “Indeed, there is one. Allow me to introduce you to this man, Han Yu. Not yet a thousand years old, he’s already at the Celestial Qiankun Realm. His Divine Skills are particularly impressive, and he once escaped unscathed in the face of a Great Cultivator of the Celestial Qiankun Realm while still in the True Soul Realm.”<br/><br/>Han Yu, dressed in blue robes and holding a folding fan, appeared refined, his skin like white jade and his face handsome. The spirited air in his brows was impossible to hide.<br/><br/>He said with a smile, “Brother Wei, don’t tease me. Compared to the Dao Master, who could defeat a Great Saint even while in the True Soul Realm, my experiences are rather shabby.”<br/><br/>Wei Buyu laughed heartily, chatting merrily about their experiences over the years.<br/><br/>Ji Rutian listened, feeling a sense of urgency in his heart.<br/><br/>This is bad!<br/><br/>This old dog is starting to poach the premier talents of this Mortal Realm. Isn’t he just squeezing out my space in Fang Wang’s heart?<br/><br/>At this moment, Ji Rutian felt anxious. Even with Fang Wang’s assurances, as more and more prodigies not inferior to him joined, could he truly become one of the Twelve Dao Sects?<br/><br/>While Ji Rutian was secretly anxious, Han Yu and the other three were also quietly observing him.<br/><br/>Hadn’t Wei Buyu said that the Dao Master valued this man highly, even calling his talent second only to his own?<br/><br/>No matter how they looked at it, they felt Ji Rutian was just ordinary!\t\t\t\t\t\t</div>", "images": {}, "success": true}