{"id": 405, "url": "https://www.novelhall.com/i-became-an-immortal-on-mortal-realm-32879/14997668.html", "title": "Chapter 395 - Chapter 395: Chapter 392: A Genius That Shines Through The Ages", "volume": 5, "volume_title": "Volume 5", "body": "<h1>Chapter 395 - Chapter 395: Chapter 392: A Genius That Shines Through The Ages</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 395: Chapter 392: A Genius that Shines Through the Ages<br/><br/>“Can you return on your own? Could it be that your Lingxiao Divine Sect and Jiu You Freedom Technique have made another breakthrough?” Zhou Xue asked in surprise.<br/><br/>Fang Wang smiled and said, “Yes, now I want to return and can do so freely, truly achieving the ‘freely’ in the name.”<br/><br/>Zhou Xue always felt that Fang Wang had changed significantly, not just breaking through to the Celestial Qiankun Realm, but she couldn’t pinpoint exactly what was different.<br/><br/>Afterward, Fang Wang also inquired about the affairs of the Fang Family. Although Zhou Xue hadn’t stayed in the Descending Dragon Continent, she had always kept control of the situation with the Fang Family.<br/><br/>After chatting for an hour, Fang Wang prepared to take his leave.<br/><br/>“Yang Lin’er is in the Western Mortal Realm; the cultivation technique you taught her allowed her to continuously outpace her peers, and she’s also making smooth progress on the path of cultivation,” Zhou Xue said, looking at Fang Wang with an amused expression.<br/><br/>From the beginning to the end, Fang Wang had not taken the initiative to mention Yang Lin’er, but Zhou Xue knew he certainly couldn’t let go.<br/><br/>Fang Wang smiled and said, “What’s my cultivation technique compared to your care? It’s thanks to that which allowed her to reach this day.”<br/><br/>Zhou Xue smiled and did not say more. She turned around and left, and the Illusionary Realm dissolved with her departure.<br/><br/>Fang Wang opened his eyes, the corners of his mouth curving upwards.<br/><br/>“Primordial Great Saint, how interesting.”<br/><br/>He was very much looking forward to the Kunlun summit in ten years.<br/><br/>After being away for so many years, it was time to show his divine skills.<br/><br/>Fang Wang no longer dwelled on these thoughts and continued writing the Heavenly Dao Immensity Scripture.<br/><br/>All this was his gift of opportunity to the thousands in the Mortal Realm.<br/><br/>Three years passed by quickly.<br/><br/>Wei Buyu and the others returned one after another. This time, Wei Buyu did not bring back a Great Cultivator of the Celestial Qiankun Realm. His vision was extremely high; not just anyone with the realm of Celestial Qiankun could catch his eye.<br/><br/>Fang Wang led them out of this Mortal Realm and into a new one.<br/><br/>Still a period of three years.<br/><br/>Three years later, Wei Buyu brought back a person named True Man Kongdu, also of the Celestial Qiankun Realm. He was filled with hatred for the Immortal Divines of the Upper Realm and admired Fang Wang’s philosophy of not ascending, thus he wanted to join Fang Wang and leave this Mortal Realm.<br/><br/>Fang Wang agreed and left together with True Man Kongdu.<br/><br/>The next Mortal Realm was still in a state of chaos, and the heavens and earth seemed to have been created not long ago, not yet producing intelligent and wise species. Hence, Fang Wang continued to traverse across realms.<br/><br/>The subsequent Mortal Realm was not too bad, hardly inferior to that of Xuanzu’s World, and they stayed there for another three years.<br/><br/>After another three years, Wei Buyu brought back another individual named Ye Xunhuan, a peerless genius in this realm, recognized as possessing the potential of a Great Saint. In his cultivation journey, he too came into contact with many souls of Great Saints, which filled him with hostility towards the Upper Realm, and Fang Wang’s creation of the Heavenly Dao Immensity Scripture left him in awe.<br/><br/>Later, he learned about the philosophy of Wangdao and Fang Wang’s deeds from Wei Buyu, which he greatly admired, and so he chose to join.<br/><br/>Of course, what moved him the most was the legend of Fang Wang defeating a Great Saint with his Sky-Stepping Realm’s cultivation!<br/><br/>Ye Xunhuan was dressed in a tight-fitting green garment, his long hair tied behind his head with a red cord, and two strands of black hair hung down his handsome face. His entire being radiated an unbearable arrogance that made Ji Rutian, Han Yu, and others unable to help but look at him.<br/><br/>Fang Wang was also taking Ye Xunhuan’s measure.<br/><br/>His aura was no less formidable than Han Yu’s, even stronger than Wei Buyu’s!<br/><br/>Moreover, Fang Wang could sense that there was also a strong force inside Ye Xunhuan that was not Spiritual Power—this was not simple.<br/><br/>“Dao Master, my name is Ye Xunhuan. I’ve heard that you once defeated a Great Saint, I wonder if you could grant me the honor of experiencing your might?” said Ye Xunhuan with a cheerful smile, a statement causing the atmosphere around Fang Wang to turn unpleasant.<br/><br/>Han Yu narrowed his eyes and said, “Since you hold yourself higher than the heavens, then you must first get past me.”<br/><br/>He was, in his own right, a prodigy from a Mortal Realm, and he held his own pride. However, after witnessing Fang Wang’s Celestial Phenomenon, he had been completely persuaded and would not allow anyone to challenge the one he believed to be the strongest.<br/><br/>Ye Xunhuan eyed Han Yu, their gazes clashed, and their momentum exploded, causing the very heavens and earth to change color.<br/><br/>Xiao Zi and Duan Tian’s faces turned pale with shock, and both scurried to hide behind Fang Wang.<br/><br/>Apart from Ji Rutian, the rest were all in the Celestial Qiankun Realm. Even though they were not on the level of those two, they were undaunted by their momentum.<br/><br/>Fang Wang put down the paper and brush in his hand, stood up, and smiled, “Han Yu, step back. He specifically named me to challenge; I can’t let you take my place. Besides, the fact that he has traveled great distances shows his sincerity, and it’s about time he learns what Heavenly Dao truly means.”<br/><br/>As these words were uttered, Ye Xunhuan couldn’t help but look towards Fang Wang, thinking to himself, “How arrogant!”<br/><br/>Fang Wang, standing before a pile of secret manuals, asked with a smile, “Are you ready?”<br/><br/>Ye Xunhuan, surprised, asked, “Right here?”<br/><br/>They stood beside a creek between two mountains, on narrow terrain unsuitable for a battle requiring wide swings and big moves.<br/><br/>“Yes, it has come.”<br/><br/>Fang Wang said softly with a smile, and as his words fell, Ye Xunhuan immediately braced himself for battle.<br/><br/>He conjured his Lifespirit Treasure, which was a White Jade Ruler emanating a faint glow.<br/><br/>Others began to step back, but after just two steps, they saw Ye Xunhuan trembling all over.<br/><br/>Sweat poured down Ye Xunhuan’s forehead like rain, not only his body shaking, but also his eyes losing their luster, as if he was enduring tremendous pain.<br/><br/>“What’s happening?” The Sea Supreme turned to Wei Buyu, hoping for an answer.<br/><br/>Wei Buyu was also puzzled, muttering, “I haven’t heard of him having any hidden illness.”<br/><br/>“No, it’s not a problem with his body, but that he’s been hit by some Divine Skill!” Han Yu suddenly spoke up, his tone grave.<br/><br/>At these words, everyone turned to look at Fang Wang.<br/><br/>Fang Wang remained calm and collected, but the slight upward curve of his mouth gave away the answer to everyone.<br/><br/>It was indeed the work of the Dao Master!<br/><br/>Wait a minute!<br/><br/>Ye Xunhuan’s aura was not weak; aside from Han Yu, no one felt confident they could handle him, yet facing the Dao Master, he lost consciousness in an instant?<br/><br/>Without the power to fight back?<br/><br/>Xiao Zi couldn’t help but ask, “Young Master, what did you do to him?”<br/><br/>“The Eighteen Layers of Abi Hell, a kind of illusionary Divine Skill, it’s the ultimate technique that the old cultivator coughed up under Wei Buyu’s threat.” Fang Wang answered with a smile.<br/><br/>Upon hearing this, Wei Buyu was stunned.<br/><br/>How long had it been?<br/><br/>Was that Divine Skill so easy to learn?<br/><br/>Fang Wang turned his head to look at the crowd and asked with a smile, “Do you all want to learn it?”<br/><br/>Upon hearing this, the crowd immediately became excited—such a powerful Divine Skill, they naturally wanted to learn!<br/><br/>Fang Wang said with a smile, “I’ll teach you when there’s time.”<br/><br/>Han Yu took a deep breath and looked at Fang Wang with even more admiration. To casually impart such a supremely powerful Cultivation Technique like the Heavenly Dao Immensity Scripture was one thing, but to also teach a Divine Skill that could kill an enemy in the blink of an eye?<br/><br/>This was not only an unimaginably broad-minded gesture but also absolute confidence!<br/><br/>The Dao Master was convinced that even if he imparted all his ultimate techniques, no one could surpass him!<br/><br/>Thump!<br/><br/>Ye Xunhuan suddenly knelt on the ground, spitting out a mouthful of fresh blood.<br/><br/>The onlookers were shocked to their core.<br/><br/>Su Er couldn’t help but ask, “Wasn’t it an illusionary Divine Skill?”<br/><br/>Fang Wang answered, “Though it is an illusion, the damage inflicted is real; he is being tortured in hell right now.”<br/><br/>As his words ended, Ye Xunhuan’s gaze suddenly cleared.<br/><br/>Subconsciously lifting his head to look at Fang Wang, his eyes were filled with fear, and he said with a trembling voice, “Thank you, Dao Master, for showing mercy…”<br/><br/>In his life, he had lived for a thousand years, unmatched and victorious, once even killing enemies across two major realms, and his name thundered across the world, full of vigor and spirit.<br/><br/>Never had he been so utterly defeated!\t\t\t\t\t\t</div>", "images": {}, "success": true}