{"id": 409, "url": "https://www.novelhall.com/i-became-an-immortal-on-mortal-realm-32879/15002070.html", "title": "Chapter 399 - Chapter 399: Chapter 396 Ascension Formation, The Arrival Of The Daoist Lord", "volume": 5, "volume_title": "Volume 5", "body": "<h1>Chapter 399 - Chapter 399: Chapter 396 Ascension Formation, The Arrival Of The Daoist Lord</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 399: Chapter 396 Ascension Formation, The Arrival of the Daoist Lord<br/><br/>“I’m just here to watch the excitement, whatever dao source spirit jade you want to compete for, go ahead, it has nothing to do with me.”<br/><br/>Ji Yutian calmly replied, his voice echoing between the heavens and the seas, causing the loud laughter from the black roc he rode upon to follow suit.<br/><br/>A gust of wind suddenly arose, and the black roc flapped its wings, quickly disappearing into the horizon.<br/><br/>Ji Yutian did not urge his mount to speed up, still looking indifferently into the distance.<br/><br/>The firmament behind him began to change color as thunderclouds gathered and surged forward, laden with immense Heavenly Might, as if a storm was approaching.<br/><br/>…<br/><br/>Time kept passing, and the Kunlun event was drawing ever nearer. More and more creatures surrounded Kunlun, and various powers stationed themselves in different areas. Their cultivation there also boosted the fate of the Human Emperor Continent.<br/><br/>The spiritual energy of the Human Emperor Continent was insufficient for their cultivation, causing the spiritual energy from the surrounding seas to start converging there.<br/><br/>By the day of the Kunlun grand event, the entire Grand Qi was bursting at the seams with people!<br/><br/>Countless law ships, pavilions, enormous mounts, and various types of gigantic magical artifacts were moored on the surface of the sea to the south, stretching as far as the eye could see. Even more cultivators flew out from within, heading towards Kunlun.<br/><br/>Even from the sea, one could spot the majestic figure of Kunlun, which had now become the tallest mountain in Grand Qi.<br/><br/>A figure on a sword flew past swiftly, and it was none other than Xu Qiuming.<br/><br/>Yang Jun stood beside Xu Qiuming, his expression extremely ugly, his throat still visibly throbbing.<br/><br/>“Senior… How much longer? I can hardly bear it any more…”<br/><br/>Yang Jun said with a pale face. The continuous ultra-long-distance transmission was nearly too much even for someone of his Profound Heart Realm cultivation, as turmoil raged within him.<br/><br/>Xu Qiuming replied helplessly, “We’re already here. I told you earlier not to come, but you wouldn’t listen.”<br/><br/>He originally did not want to bring Yang Jun, but a year ago, when Fang Wang left, he sent a voice transmission to Xu Qiuming, asking him to bring along Yang Jun and not reveal that it was Fang Wang’s request.<br/><br/>Fang Wang’s entrustment made Xu Qiuming view Yang Jun in a new light, observing him all year long.<br/><br/>It must be said, this fellow’s cultivation aptitude was truly mediocre.<br/><br/>The more he felt this way, the more Xu Qiuming believed that Yang Jun hid a great secret, as Fang Wang would not be so favorable towards a stranger.<br/><br/>Recalling his early days in Grand Qi, Xu Qiuming’s talents were not considered strong either; perhaps his own cultivation was not adequate to see through Yang Jun.<br/><br/>Upon hearing this, Yang Jun looked up, his face showing a look of joyful surprise. He leaned forward and saw that dark clouds were gathering in the sky, and the sea of clouds stretched like long dragons towards the formidable mountain range at the edge of the continent.<br/><br/>Even the experienced Yang Jun was shocked at the sight of Kunlun. An ancient and overwhelming spiritual energy rushed towards him, and he even faintly heard someone preaching. The voice was sometimes distant, sometimes near, elusive in its origin.<br/><br/>From afar, the Kunlun mountain range resembled an ancient dragon lying upon the land, emitting an aura of ancient history and vast antiquity, awakening an irrepressible sense of reverence in Yang Jun.<br/><br/>Wangdao, Kunlun!<br/><br/>Meanwhile.<br/><br/>At the summit of Kunlun, prominent figures of Wangdao, such as Dugu Wenhun, Hong Chen, Zhu Rulai, Jiang Shenming, Yang Du, Chu Yin, and The Three Immortals of the Emperor Sea, were all gathered together.<br/><br/>Before them stood a massive object, veiled by red silk, and a large number of Wangdao disciples sat meditating around it, forming a formation. Looking across the mountainside, there were so many Disciples of the Way of Hope sitting in meditation that their numbers were beyond counting.<br/><br/>The Wangdao disciples wore uniform white dao robes, each embellished with the character “Wang” on their backs. The breeze between heaven and earth stirred their robes, making them billow as if white waves were surging.<br/><br/>Dugu Wenhun looked towards Jiang Shenming and Yang Du, and said, “Divine Sect, Body Sect is responsible for guarding the edge of Kunlun Mountain, no one who is not of our path may forcefully intrude.”<br/><br/>Both immediately accepted the order and then vanished from the spot.<br/><br/>Dugu Wenhun then turned to Hong Chen, and asked, “Xuan Zong, how long until the auspicious time?”<br/><br/>Kunlun Mountain was tremendously vast, and from the peak, one could not even see the foot of the mountain. Although they couldn’t see the cultivators from other sects, dynasties, or noble families, there were continuous powerful awareness scans coming from all directions, making all these high-ranking members of the Way of Hope somewhat nervous.<br/><br/>There were simply too many cultivators who had come to watch, to the point that even Jiang Shenming hardly smiled today.<br/><br/>Hong Chen looked up at the sky, and said, “Soon.”<br/><br/>Sword Immortal Xu Yan and Emperor Sea’s number one talent, Lü Xianming, stood behind, their gazes stretching into the distance, sensing the tense atmosphere.<br/><br/>“If there is an attack during the raising ceremony, what will we do?” Qian Xian, one of The Three Immortals of the Emperor Sea, asked.<br/><br/>Hong Chen replied expressionlessly, “Today is not really a grand ceremony, but a kill calamity. We ascend through killing, perfectly demonstrating to the world just how powerful the Way of Hope is. No matter their background, or how high their cultivation, anyone who dares to intrude on Kunlun Mountain will face death without discussion.”<br/><br/>He lifted his right hand, holding a green bean in his palm, and scattered it on the ground. The green beans quickly sunk into the soil and then the earth loosened, sprouting greens that grew rapidly and robustly, soon shaping into human forms to become tree people, with branches and leaves growing at their joints.<br/><br/>This scene astonished the onlookers, but they were no longer strangers to Hong Chen’s methods. Xuan Zong swiftly took command of the Way of Hope not only due to his strategy but also his own myriad strange spells, and all cultivators of the Way of Hope had cultivated the Dao methods of Hong Chen.<br/><br/>Boom—<br/><br/>A thunderous roar came from the distance, followed by a voice filled with dominance:<br/><br/>“Unexpectedly, within the Way of Hope lies a master proficient in the ancient Ascension Formation from eons past. May I ask which master it is?”<br/><br/>This voice was full of oppressiveness, audible throughout the entire Descending Dragon Continent.<br/><br/>Hong Chen sighed and said, “As expected, there really is someone who can see through my formation.”<br/><br/>Dugu Wenhun frowned and asked, “Could there be any changes?”<br/><br/>“There will not be,” replied Hong Chen, his expression returning to calm.<br/><br/>No sooner had he spoken than a tyrannical aura burst forth from the east—it was the aura of Jiang Shenming from the Divine Sect.<br/><br/>“The Divine Sect of the Way of Hope is here, do not seek a path to your death!”<br/><br/>Jiang Shenming’s tone was even more domineering than that of the mysterious cultivator, exuding a disdain that looked down upon the world, an arrogance of unrivaled pride.<br/><br/>“I would like to put to the test this sharp edge of the Way of Hope!”<br/><br/>The mysterious voice sounded once more, and then from the east, a terrifying tempest swept through, engulfing the Kunlun Mountain Range and causing many disciples of the Way of Hope to tremble.<br/><br/>They turned their heads to look just in time to see two figures shooting up into the sky, as the thunderclouds above stirred violently, occasionally unleashing terrifying spells and divine skills that forced the great cultivators of the Way of Hope to cast their own spells to fend off the attacks from above.<br/><br/>The battle was on the verge of breaking out!<br/><br/>With someone taking the lead, the leaders of various powers surrounding Kunlun Mountain began to stand up, causing their followers, cultivators, and demons alike, to do the same. A magnificent surge rose between the heavens and earth, shaking the mountains and rivers.<br/><br/>All of the Wangdao Cultivators on Kunlun Mountain felt an indescribable pressure coming from all directions, causing them to feel suffocated. It was the combined aura of countless cultivators and demons converging together, making the land of the Descending Dragon Continent tremble.<br/><br/>Hong Chen immediately raised his hand, ready to cast a spell, when another voice followed:<br/><br/>“Thirty-Six Tian Gang Dao Venerate of the Way of Hope, Ye Xunhuan, is here. Those who dare to intrude upon Kunlun Mountain without permission, shall be eradicated in body and spirit!”\t\t\t\t\t\t</div>", "images": {}, "success": true}