{"id": 406, "url": "https://www.novelhall.com/i-became-an-immortal-on-mortal-realm-32879/14997669.html", "title": "Chapter 396 - Chapter 396: Chapter 393: Return To The Western Mortal Realm!", "volume": 5, "volume_title": "Volume 5", "body": "<h1>Chapter 396 - Chapter 396: Chapter 393: Return To The Western Mortal Realm!</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 396: Chapter 393: Return to the Western Mortal Realm!<br/><br/>“You’re quite good, more durable than a Great Saint.”<br/><br/>Fang Wang said with a chuckle. He wasn’t speaking idly; even before he had broken through to the Celestial Qiankun Realm, he could effortlessly vanquish an ordinary Great Saint. Although he hadn’t used his full strength, the fact that Ye Xunhuan had persisted for a dozen breaths’ time in the Eighteen Layers of Abi Hell was proof enough of his own abilities.<br/><br/>Upon hearing this, Ye Xunhuan revealed a smile uglier than crying.<br/><br/>The others looked at Fang Wang with curiosity, filled with interest for his illusionary Divine Skills.<br/><br/>Wei Buyu swallowed hard, looking at Ye Xunhuan, who was kneeling on the ground; it was hard for him to reconcile this image with the Ye Xunhuan he remembered, as he couldn’t even imagine what a ragged Ye Xunhuan would look like.<br/><br/>The most critical point was that Fang Wang had not even made a move; Wei Buyu couldn’t see clearly at all how Fang Wang had applied his illusionary Divine Skills.<br/><br/>Just how powerful would Fang Wang be if he truly became a Great Saint?<br/><br/>Fang Wang said, “Tidy up, and prepare to leave. It’s time to take you back to my Mortal Realm.”<br/><br/>As soon as these words were spoken, everyone became energized.<br/><br/>Filled with curiosity about Xuanzu’s World, they wondered what kind of Mortal Realm could give birth to such a person.<br/><br/>A stick of incense later, Fang Wang’s Spiritual Power covered everyone. He took a step forward, his thoughts locking onto the Mortal Realm with the greatest reserve of willingness.<br/><br/>As his right foot was suspended in the air, the world began to change.<br/><br/>It was the first time Ye Xunhuan felt the wonder of The Heaven of Carefree Freedom, and he couldn’t help but be moved.<br/><br/>They appeared above a sea of clouds; below them was an endless ocean, and in the distance, there were floating islands suspended in the sky.<br/><br/>Rich Spiritual Energy rushed towards them.<br/><br/>Fang Wang sensed the Spiritual Energy of this realm and couldn’t be certain, as it far exceeded that of the Eastern Mortal Realm.<br/><br/>“Let’s go, take a look around,” Fang Wang said, and without any objections, the group followed him, flying toward a massive floating island in the distance.<br/><br/>Xiao Zi, perched on Fang Wang’s shoulder, asked with a smile, “Master, can these many Celestial Qiankuns fill up the Twelve Dao Sects?”<br/><br/>At her words, everyone tensed up.<br/><br/>They had already learned about the power structure of Wangdao and were naturally interested in the Twelve Dao Sects.<br/><br/>Wei Buyu, Long Changsheng, Hai Zun, Han Yu, Su Er, Qing Daoren, Chang Sikong, and Ye Xunhuan were all at the Celestial Qiankun Realm, and moreover, they were the top powerhouses in their respective Mortal Realms. They naturally did not wish to be second to anyone.<br/><br/>Ji Rutian was the most nervous, for what use was his exceptional talent if his cultivation did not measure up?<br/><br/>Fang Wang looked ahead and said, “They won’t make the Twelve Dao Sects.”<br/><br/>Upon hearing this, Wei Buyu, Han Yu, and the others felt a wave of disappointment.<br/><br/>Ji Rutian secretly breathed a sigh of relief.<br/><br/>“However, I plan to establish the Thirty-Six Tian Gang Dao Venerate. The Heavenly Stem Venerate will be independent of the Twelve Dao Sects and will only follow my commands,” Fang Wang continued.<br/><br/>Thirty-Six Tian Gang Dao Venerate?<br/><br/>Their eyes lit up at the title—it had a nice ring to it.<br/><br/>Fang Wang turned his head slightly, looking at Wei Buyu with a smile, “Wei Buyu, you will temporarily lead the Thirty-Six Tian Gang Dao Venerate. It’s your task to form it, but whether those you choose can become Heavenly Stem Venerates will still need my approval.”<br/><br/>Wei Buyu was immediately thrilled, feeling a rush of excitement shoot up to his crown.<br/><br/>Head of the Thirty-Six Tian Gang Dao Venerate!<br/><br/>No one else had any objections, as most of them had been introduced by Wei Buyu, and they recognized his capability.<br/><br/>“`<br/><br/>“Dao Master, rest assured, I will devote myself wholeheartedly in the future, and the people I recruit will only become stronger and stronger!” Wei Buyu immediately promised.<br/><br/>Fang Wang smiled and said nothing more.<br/><br/>Soon, they flew onto an island, where there was a bustling city, countless cultivators and demons, and a ceaseless flow of people coming and going.<br/><br/>Xiao Zi’s appearance attracted quite a few glances, but seeing the extraordinary momentum of Fang Wang and his companions, no one dared to disturb them.<br/><br/>With a year left until the Kunlun grand event, Fang Wang was in no hurry, so he took everyone to an inn, where they occupied two tables.<br/><br/>“Waiter, have you heard of the Descending Dragon Great Saint?” Duan Tian asked while the waiter was pouring tea.<br/><br/>Upon hearing this, the waiter raised an eyebrow and said, “Of course I’ve heard. The legend of the Descending Dragon Great Saint battling Immortal Divine is passed down from generation to generation!”<br/><br/>Duan Tian followed up with, “Is this the Eastern Mortal Realm or the Western Mortal Realm?”<br/><br/>“Naturally, it’s the Western Mortal Realm, dear guests. Why do you ask?” The waiter looked puzzled and curious about the origins of Fang Wang and the others.<br/><br/>Wei Buyu took over the conversation, “We’ve been in secluded cultivation in a secret realm for hundreds of years, just emerged, and can’t distinguish the direction. That’s why we’re asking. Waiter, could you tell us about the current major events in the world?”<br/><br/>“Sure thing, would you like to order some dishes first? After I get it set up, you can eat while listening. The world is quite lively these days!” the waiter chuckled.<br/><br/>Wei Buyu shook his head with a chuckle, then casually ordered some food and drinks.<br/><br/>Before long, the waiter came with two jars of wine, and as he poured drinks for Fang Wang and the others, he said, “These days, the Western Mortal Realm and the Eastern Mortal Realm are merging, causing great changes in the world. In the west lies the Primordial Unity Sect, whose Primordial Great Saint sacrificed himself for the people, meriting boundless virtue. Thus, Primordial Unity Sect is known as the number one sect under the heavens. Recently, the sect is recruiting disciples; if you are interested, you might want to give it a try.”<br/><br/>“However, despite the lofty reputation of Primordial Unity Sect, the most attention-grabbing entity in the Eastern Mortal Realm is Wangdao. Wangdao is no ordinary place; it was created by the Heavenly Dao, who is said to be the world’s premier genius. With his own power, he suppressed hundreds of Saint Clans and Imperial Clans in the Eastern Mortal Realm, truly unmatched in both ancient and modern times. Tiangong Sect offered a Dao Source Spiritual Jade to Wangdao for this reason, and Wangdao’s Xuan Sect is inviting sects from all over to their gathering to witness the grand event of the Dao Source Spiritual Jade descending onto Kunlun…”<br/><br/>As the waiter went on and on, everyone listened attentively.<br/><br/>Wei Buyu and the others were curious about Xuanzu’s World, but when they heard that there had been no Great Saint since the Primordial Great Saint fell, they all breathed a sigh of relief.<br/><br/>Is that all?<br/><br/>They were still invincible then!<br/><br/>As Fang Wang was listening, he also expanded his divine sense to feel the aura of the Western Mortal Realm.<br/><br/>The Western Mortal Realm really was stronger than the Eastern Mortal Realm. As he scanned across, he found more than ten cultivators in the Celestial Qiankun Realm, and he had only investigated the tip of the iceberg in the Western Mortal Realm.<br/><br/>Before he left, the Celestial Qiankun cultivators in the Eastern Mortal Realm could be counted on one hand.<br/><br/>Suddenly.<br/><br/>Fang Wang seemed to sense something and the corners of his mouth curved upwards.<br/><br/>He had found an acquaintance.<br/><br/>Xu Qiuming!<br/><br/>This young man had indeed come to make his way in the Western Mortal Realm, his cultivation nearing the Sky-Stepping Realm, and his Sword Intent far exceeding his own realm.<br/><br/>Now we’re talking!<br/><br/>Honestly, Xu Qiuming had truly been a genius previously, but compared to ‘the strongest in the Mortal Realm,’ as Zhou Xue had said, he was still far off. It seemed this young man had been waiting for a grand era to arrive.<br/><br/>Like this, an hour later.<br/><br/>Fang Wang and the others left the floating island. He took a piece of black clothing from the Dragon Jade Ring and put it on, then wore the Fox Mask.<br/><br/>“Let’s go, follow me to meet someone. He is a Sword Sect member of Wangdao,” Fang Wang spoke, then he made Xiao Zi become smaller and tucked her into his embrace.<br/><br/>Seeing him act so mysteriously, the others roughly guessed his intentions.<br/><br/>Han Yu, Ye Xunhuan, and the others wore teasing smiles. They wanted to see for themselves what sort of talent the Twelve Dao Sects possessed!\t\t\t\t\t\t</div>", "images": {}, "success": true}