{"id": 408, "url": "https://www.novelhall.com/i-became-an-immortal-on-mortal-realm-32879/14999322.html", "title": "Chapter 398 - Chapter 398: Chapter 395: The Grand Assembly Of Kunlun, The Mortal Realm Has Changed", "volume": 5, "volume_title": "Volume 5", "body": "<h1>Chapter 398 - Chapter 398: Chapter 395: The Grand Assembly Of Kunlun, The Mortal Realm Has Changed</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 398: Chapter 395: The Grand Assembly of Kunlun, The Mortal Realm Has Changed<br/><br/>Ye Xunhuan met Xu Qiuming’s gaze, and he was not intimidated, feeling only annoyance in his heart.<br/><br/>Especially in front of the other Heavenly Stem Venerates, he felt as if he had completely lost face.<br/><br/>Just as he was about to make a move, Fang Wang’s voice floated over, “Let’s stop here, Xu Qiuming. You should thank him for showing mercy and giving you a chance.”<br/><br/>Hearing this, Ye Xunhuan could only suppress his anger.<br/><br/>Upon hearing that, Xu Qiuming’s expression changed drastically, a look of surprise flashed across his face, followed by a resigned smile.<br/><br/>Yang Jun, hearing Fang Wang’s voice, felt a hint of familiarity, but he didn’t think much of it, because it had been many years since he had seen Fang Wang, and he had already forgotten what his brother-in-law looked like. Besides, Fang Wang had never used such an authoritative tone back on Earth.<br/><br/>Immediately, Ye Xunhuan dispelled his Celestial Phenomenon, and the world instantly returned to its original state, with the beautiful mountainous scenery unfolding before Yang Jun’s eyes, astonishing him.<br/><br/>What kind of Divine Skills were these?<br/><br/>“Have you finally shown yourself because of the matter with Kunlun?” Xu Qiuming asked.<br/><br/>With his mask on, Fang Wang’s expression was inscrutable as he replied, “Yes, just got back. I felt your presence, so I came to take a look. Your progress is decent, not disappointing.”<br/><br/>Having said this, he soared into the air, followed closely by the others.<br/><br/>Xu Qiuming hurriedly looked up and asked, “Where are you going?”<br/><br/>“To test the sharpness of the Western Mortal Realm.”<br/><br/>Fang Wang had no intention of bringing Xu Qiuming along, as he exercised The Heaven of Carefree Freedom, leading everyone to disappear into the horizon in one step.<br/><br/>Xu Qiuming’s spiritual sense couldn’t keep up, which made him internally marvel at Fang Wang’s strength.<br/><br/>After so many years, he had indeed become more unfathomable, and had gathered so many powerful beings under his command. Tsk tsk, the Mortal Realm was about to undergo a transformation.<br/><br/>“Thirty-Six Heavenly Stem Venerates…”<br/><br/>Xu Qiuming muttered to himself, feeling a sense of urgency for the Twelve Dao Sects.<br/><br/>Indeed, Fang Wang was not going to let the Twelve Dao Sects live in comfort. Once he arrived at Kunlun with the Thirty-Six Heavenly Stem Venerates, even the internal dynamics of the Wangdao Sect would likely see great upheaval.<br/><br/>Yang Jun hurriedly walked over to Xu Qiuming and asked cautiously, “Senior, do you know that person wearing the mask?”<br/><br/>How did the fight end so abruptly?<br/><br/>“He is our Wangdao Master, Heavenly Dao,” Xu Qiuming calmly answered.<br/><br/>This was Hong Chen’s suggestion, to have the Disciples of the Way of Hope respectfully address Fang Wang as Heavenly Dao, concealing his real name. First, it created distance, establishing greater authority; second, it allowed the name Heavenly Dao to gradually become a name recognized by heaven and earth as synonymous with fate.<br/><br/>Nowadays, very few people mention the name Fang Wang, but when they hear Heavenly Dao, they think of the Wangdao Sect Leader.<br/><br/>Heavenly Dao!<br/><br/>Yang Jun’s eyes widened, and he suddenly began to breathe rapidly.<br/><br/>My God!<br/><br/>He had just encountered the legendary supreme power!<br/><br/>He couldn’t help but ask, “Who is stronger, the Heavenly Stem Venerate we just saw or the Wangdao Sect Leader?”<br/><br/>Xu Qiuming didn’t answer but simply stared silently in the direction where Fang Wang and the others had gone.<br/><br/>…<br/><br/>Descending Dragon Continent, Sword Heaven Marsh. As the date of the grand assembly in Kunlun drew closer, Sword Heaven Marsh was crowded with people. The sky was filled with all sorts of mounts and flying Magical Artifacts, a sight truly magnificent to behold.<br/><br/>A large number of Disciples of the Way of Hope patrolled Kunlun, with Spiritual Power converging to form multicolored Giant Dragons—this had become a signature sight in Kunlun.<br/><br/>By the lakeside of Sword Heaven Marsh, in front of a pavilion, four women were enjoying wine while admiring Kunlun’s magnificent view.<br/><br/>They were Hong Xian’er, the Tai Xi Fairy from Suzhen Palace, Gu Li, and Fang Ling, Fang Wang’s sister. The four had an ethereal quality about them, with charming faces so beautiful they seemed otherworldly, like four Immortals beyond the grasp of ordinary mortals.<br/><br/>Propping her chin with one hand, Fang Ling laughed and said, “What do you think, will my brother come back? What kind of realm is he in now?”<br/><br/>The thoughts of the other three women were pulled back to the present.<br/><br/>Hong Xian’er mused, “With his talent, he should at least be in the True Soul Realm by now, not far from Celestial Qiankun. Whether he’ll come back, though, is another question.”<br/><br/>“Your sister-in-law doesn’t know his whereabouts?”<br/><br/>When Hong Xian’er mentioned Zhou Xue, her tone carried a hint of jealousy.<br/><br/>Initially, when Fang Wang mentioned his betrothal, she didn’t take it seriously, convinced that no woman could surpass her in this world.<br/><br/>However, upon meeting Zhou Xue, she was astounded to find that Zhou Xue gave her the same sense of unfathomable depth as Fang Wang did. Their brief encounter in combat had been quick and to the point. Although Hong Xian’er wasn’t injured, her instincts told her that she was no match for Zhou Xue.<br/><br/>And to think, Zhou Xue was the same age as Fang Wang!<br/><br/>The Tai Xi Fairy said with a smile, “He should come back. Such a grand occasion is known to all under the heavens. If he knows about it, he definitely won’t be able to rest easy.”<br/><br/>She didn’t have romantic feelings for Fang Wang, but she had invested a lot in Kunlun and naturally hoped to see it flourish.<br/><br/>Kunlun now towered over three thousand zhang high and was still under construction. Even in Suzhen Palace, situated far in other seas, there were discussions about when Kunlun would be completed.<br/><br/>Fang Ling laughed heartily, “Haha, I feel even if my brother doesn’t come back, it’s fine. After all, Xuan Zong is there, and the other Dao Sects can hold their own. Divine Sect has become one of the top forces in the Eastern Mortal Realm. He is someone who can contend with Celestial Qiankun!”<br/><br/>When she was born, Fang Wang had already become famous far and wide. She had been pampered from childhood and, unlike her second brother Fang Xun, who loved to take risks, she had never faced hardships in life, which made her cheerful and carefree.<br/><br/>Hong Xian’er praised, “Xuan Zong’s management of the Wangdao has indeed achieved remarkable progress. And the Divine Sect is a force unmatched in this world. Jiang Shenming has grown so fast that I suspect he might be the reincarnation of a Great Emperor, it’s completely unreasonable.”<br/><br/>The Tai Xi Fairy shook her head and laughed softly, “Look who’s talking, you’re also beyond reason. The title of the world’s number one female Cultivator is about to fall on your head.”<br/><br/>At these words, Hong Xian’er wasn’t pleased. She thought of Zhou Xue.<br/><br/>Her cultivation goal had changed; it was no longer to surpass Fang Wang, but to be stronger than Zhou Xue!<br/><br/>Not just them, but all over Sword Heaven Marsh and across Descending Dragon Continent, there were discussions about the current strength of Wangdao. Besides the established Dao Sects, there were many Cultivators under them who had gained fame across the land.<br/><br/>The current Wangdao was rich with strong Cultivators, and geniuses were as common as fish crossing the river.<br/><br/>In the western regions of Descending Dragon Continent, above the vast ocean, a Black Dragon flew through the clouds with a man in purple standing on its Dragon Head.<br/><br/>It was Ji Yutian from Extremely Greedy Heaven, who had joined hands with the Thousand Eyes Great Saint to scheme against Wangdao!<br/><br/>Ji Rutian stood with his hands clasped behind him, facing the wind, his hair fluttering, his gaze deep, lost in thought.<br/><br/>A piercing cry sounded, and the sky suddenly darkened as an enormous black Peng, large enough to obscure the sun and spread its wings for hundreds of miles, appeared. In its presence, the Black Dragon beneath Extremely Greedy Heaven seemed as insignificant as a loach.<br/><br/>“I didn’t expect that Extremely Greedy Heaven, who has dominated the Western Mortal Realm for two thousand years, would actually leave his seclusion. The face of Wangdao must be really big!”<br/><br/>A mocking laugh emanated from above the black Peng.<br/><br/>Extremely Greedy Heaven did not respond but continued to gaze ahead.<br/><br/>“Extremely Greedy Heaven, if you’ve set your sights on the Dao Source Spirit Jade, I advise you to give up. There are too many forces eyeing it, including the Yu Clan and the Primordial Unity Sect. The era has changed; it’s no longer the time when you could do as you pleased. In the years of your absence, too many formidable figures have emerged.”<br/><br/>The mysterious voice from above the black Peng carried a tone of sighing, lamenting the changes over time.\t\t\t\t\t\t</div>", "images": {}, "success": true}