{"id": 401, "url": "https://www.novelhall.com/i-became-an-immortal-on-mortal-realm-32879/14984536.html", "title": "Chapter 391 - Chapter 391: Chapter 388: Fang Wang’S Spiritual Elephant, Great Saint Shifa", "volume": 5, "volume_title": "Volume 5", "body": "<h1>Chapter 391 - Chapter 391: Chapter 388: Fang Wang’S Spiritual Elephant, Great Saint Shifa</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 391: Chapter 388: Fang Wang’s Spiritual Elephant, Great Saint Shifa<br/><br/>“`<br/><br/>Fang Wang passed through one village after another, each time stopping to preach the “Heavenly Dao Immensity Scripture” for a day, a reduction of two days compared to his first sermon. He didn’t care how much the mortals would remember, he would leave his name and depart.<br/><br/>And just like that, two years swiftly passed.<br/><br/>With the help of the “Heavenly Dao Infinite Book of Changes,” Fang Wang was constantly absorbing nature’s spiritual energy, but he discovered that the process of preaching could enhance his own comprehension of the Taoist laws.<br/><br/>Moreover, his sensitivity to the power of faith was deepening.<br/><br/>When he preached, those mortals would develop faith in him. This sentiment would transform into a tangible force that converged upon him—this was the power of faith. However, the amount of faith generated by one person was so minuscule, it was almost negligible.<br/><br/>In just a short span of two years, the name Tiandao Fangwang began to spread among the mortals, and Wei Buyu with his three companions, along with Xiao Zi, were also promoting his renown. In this mortal realm, he had already acquired immense fame.<br/><br/>On this day.<br/><br/>Fang Wang walked beside a river where the waves slapped against the shore, splashing water everywhere. He didn’t avoid the spray. Instead, when the river water came close to touching him, it evaporated instantly, forming wisps of mist that encircled him, imbued with an air of immortality.<br/><br/>He was still wearing the Fox Mask, his gaze drifting over the fish that occasionally leapt from the river’s surface while his thoughts scattered.<br/><br/>He was contemplating about the Celestial Qiankun!<br/><br/>The Celestial Qiankun was not something one could break through just by achieving a certain level of cultivation. To reach this realm, one had to forge their own Celestial Phenomenon.<br/><br/>The “Heavenly Dao Infinite Book of Changes” possessed boundless transformative powers, uniquely profound, and had already evolved a method to create the Spiritual Elephant. Combined with the Cang Life and National Destiny Chart, Fang Wang was already capable of creating the Celestial Qiankun Totem, but he hesitated over what kind of totem to create.<br/><br/>The totems of different Celestial Qiankun Great Cultivators varied not just in appearance but also contained diverse powers—some emphasizing seals, others focusing on suppression—their totems reflected the heart of their creators.<br/><br/>Fang Wang placed great importance on the totem. He had a premonition that higher realms would grant true form to the Celestial Phenomenon.<br/><br/>Perhaps this was the first step in opening the heavens and splitting the earth.<br/><br/>Suddenly.<br/><br/>Fang Wang stopped his stride, turning to look towards the river where, a hundred yards away, floated a black-robed elder.<br/><br/>The elder, clothed in white beneath his black robe, holding a horsetail whisk, had the youthful face of a crane-haired elder. His feet were merely a yard above the water surface, and he gazed steadily at Fang Wang, expressionless.<br/><br/>Fang Wang, too, remained silent, locking eyes with him.<br/><br/>The sound of the wind between heaven and earth ceased, and even the flowing river seemed to come to a halt.<br/><br/>“Could you be Tiandao Fangwang?” the black-robed elder asked indifferently.<br/><br/>Fang Wang replied, “Yes, may I ask for the Great Saint’s name?”<br/><br/>At a glance, he recognized that the black-robed elder far surpassed the Celestial Qiankun Realm, bearing a unique aura exclusive to a Great Saint, an aura related to Fate, which he had felt on the Sin Saint.<br/><br/>“I am Shifa, a humble Taoist. You come from another mortal realm, spreading the doctrines of cultivation here, what is your intention?”<br/><br/>Great Saint Shifa!<br/><br/>The moment the words “what is your intention” were uttered, Fang Wang felt an overwhelming Heavenly Might. The forces of the rules within heaven and earth surged violently.<br/><br/>Under the Fox Mask, Fang Wang’s eyebrows lifted slightly. Was this a real Great Saint?<br/><br/>Whether it was the Hongxuan Emperor or the Sin Saint, they possessed the power of a Great Saint but could not utilize the true Divine Skills of a Great Saint. Fang Wang was facing a living Great Saint for the first time, and the pressure he exerted was powerful, even stronger than that of the deceased Sin Saint.<br/><br/>Borrowing influence!<br/><br/>The aura emanating from Great Saint Shifa was not only cultivated from his own achievements; it also commanded the power of heaven and earth. Such an aura could instinctively invoke fear in all beings beneath the Great Saint, rendering them unable to resist.<br/><br/>But Fang Wang was special; he no longer feared the imposing presence of a Great Saint. In fact, he was nurturing his own imposing presence.<br/><br/>“`<br/><br/>“To open the minds of humanity, to seek a path of survival for heaven and earth, I desire nothing and ask nothing, do you not allow all beings under the heavens to cultivate?” Fang Wang asked.<br/><br/>Great Saint Shifa said calmly, “If everyone became immortals, living forever without death, then one day there will be so many immortals that heaven and earth cannot sustain them. Your actions may seem kind, but in reality, they go against the heavenly order.”<br/><br/>Fang Wang retorted, “If heaven and earth are limited, why not let the immortals raise the limit? And aren’t the immortals capable of creating their own heavens and earth?”<br/><br/>They’re all nonsense!<br/><br/>Not to mention that it is impossible for everyone to become an immortal, even if it truly were possible, why couldn’t heaven and earth sustain them?<br/><br/>Fang Wang could not understand, nor did he agree.<br/><br/>“Because I have achieved the Great Saint level, I can see through heaven’s fate. Your actions bring danger to this mortal realm, and not just this realm.”<br/><br/>Great Saint Shifa said eerily as he suddenly waved his horsetail whisk, and in an instant, the entire world changed colors.<br/><br/>Fang Wang seemed to arrive beneath the night sky in an instant, where countless stars converged like a vast ocean. He stood atop scorched earth, the rivers before him vanished, and the air was filled with scorching heat.<br/><br/>Just like the Sin Saint’s Celestial Phenomenon, Great Saint Shifa’s was also like the true heaven and earth, incomparable to the Celestial Qiankun Totem.<br/><br/>Great Saint Shifa soared into the sky, ascended into the night sky, with his back to the bright moon. Suddenly, the moon swelled enormously, dominating the night sky, and he appeared as small as dust before it.<br/><br/>Fang Wang twisted his neck; it had been a long time since he had fought, and he really was itching for a fight.<br/><br/>He was looking forward to a battle with a true Great Saint.<br/><br/>Compared to when he battled the Sin Saint, his strength had changed dramatically.<br/><br/>He looked at his right hand, hesitating over which method to use to deal with his opponent.<br/><br/>“Though I cannot see through your cultivation level, you probably have not become a saint. To have a body that eludes the eye of a Great Saint, I reckon it’s not made of ordinary flesh and bones.”<br/><br/>Great Saint Shifa looked down from above at Fang Wang and said, his words ending just as the ground split apart and flames from deep underground surged towards the sky, unstoppable.<br/><br/>Fang Wang was engulfed in roiling flames, and the reflected image of his figure appeared in Great Saint Shifa’s eyes.<br/><br/>He saw Fang Wang raise his hand towards him.<br/><br/>Great Saint Shifa lifted the horsetail whisk in his hand and waved it out front. A stream of white and a stream of black qi emerged, encircling his body and turning the moon behind him into two colors, black and white.<br/><br/>Within the raging sea of fire, Fang Wang’s body was enveloped in silver energy. He raised his right hand, reaching for the moon above.<br/><br/>His right hand slowly clenched into a fist.<br/><br/>With that squeeze, the night sky shattered instantly, the whole world turned to ash, including the fires that surrounded them.<br/><br/>Almost in an instant, Fang Wang was standing next to the river, maintaining his raised fist posture.<br/><br/>He slowly lifted his eyes, a pair of sharp eyes visible beneath the fox mask.<br/><br/>Following his gaze, Great Saint Shifa was frozen in the sky, black and white qi swirling tightly around him, forming a shield-like layer, pressed upon by an invisible force that kept shrinking it.<br/><br/>The expression on Great Saint Shifa’s face turned gloomy, a far cry from his previous indifference.<br/><br/>“You… what Divine Skill is this?”<br/><br/>Great Saint Shifa asked in a heavy voice, having never encountered such a Divine Skill before.<br/><br/>Without answering, Fang Wang asked instead, “Great Saint, tell me again, why can’t mortals have the hope of cultivating?”\t\t\t\t\t\t</div>", "images": {}, "success": true}