{"id": 400, "url": "https://www.novelhall.com/i-became-an-immortal-on-mortal-realm-32879/14975822.html", "title": "Chapter 390 - Chapter 390: Chapter 387 The Mortal Realm’S Great Saint, The So-Called Mortal", "volume": 4, "volume_title": "Volume 4", "body": "<h1>Chapter 390 - Chapter 390: Chapter 387 The Mortal Realm’S Great Saint, The So-Called Mortal</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 390: Chapter 387 The Mortal Realm’s Great Saint, The So-Called Mortal<br/><br/>Twelve years had passed, and Fang Wang had smoothly reached the Ninth Level of the True Soul Realm.<br/><br/>He was only one realm away from the Celestial Qiankun Realm, which left him in high spirits. Therefore, he stepped out of the loft, ready to enjoy the scenery for a few days.<br/><br/>The loft was situated amidst a forest. Ji Rutian and Duan Tian were practicing below different large trees in distinct directions. Their cultivation had increased rapidly, thanks to the dense spiritual energy of this world and Fang Wang’s influence.<br/><br/>For some reason, they found that following Fang Wang in cultivation improved their comprehension, making their practice twice as effective with half the effort.<br/><br/>Fang Wang too was aware of this, but he did not point it out.<br/><br/>Usually, aside from Qi Gathering to increase his cultivation level, Fang Wang would also ponder the laws of heaven and earth. This caused the spiritual energy in the area to be infused with the laws of heaven and earth, which guided Ji Rutian and the other to understand their cultivation techniques.<br/><br/>Hearing the sound of footsteps, Ji Rutian and Duan Tian opened their eyes and stood up, following their master.<br/><br/>“Continue your cultivation. I’m just coming out to take in the view, preparing for the breakthrough to the Celestial Qiankun Realm,” Fang Wang said, stretching lazily.<br/><br/>Celestial Qiankun!<br/><br/>Ji Rutian’s eyelids twitched. What kind of formidable strength would Fang Wang possess once he reached the Celestial Qiankun Realm?<br/><br/>Duan Tian didn’t think so much; he simply looked up to Fang Wang with admiration.<br/><br/>“Wei Buyu and the others are making quite a commotion,”<br/><br/>Ji Rutian started a conversation. It was rare for Fang Wang to come out, and he felt it was impolite to keep cultivating with his eyes closed.<br/><br/>Fang Wang laughed, “I’ve felt it. This Mortal Realm is not simple; it feels stronger than the one we were in before. I can even sense the presence of a Great Saint.”<br/><br/>Ji Rutian was moved and asked in astonishment, “There is a Great Saint in this Mortal Realm?”<br/><br/>He originally thought this realm just had more people at the level of Celestial Qiankun compared to Xuanzu’s World, but he hadn’t expected there to be a living Great Saint here!<br/><br/>“Yes, and this Mortal Realm is quite chaotic, a bit like…” Fang Wang nodded, leaving his sentence unfinished.<br/><br/>Ji Rutian guessed, “Like Xuanzu’s World in the future?”<br/><br/>“That’s right, fighting is everywhere, and there’s a special power existing in the world, which should be the condensation of fate,” Fang Wang said, feeling the breath of the world, and spoke nonchalantly.<br/><br/>It turned out that a golden age wasn’t just a description; the world really did change!<br/><br/>With the spiritual energy so dense, fate so vast, and countless opportunities emerging from the earth, cultivating in such an era naturally led to rapid growth.<br/><br/>He wondered when Xuanzu’s World would start entering such a stage?<br/><br/>Fang Wang didn’t fear his opponents getting stronger; he actually hoped they would become even stronger.<br/><br/>The stronger the opponent, the more exhilarating it felt to defeat them!<br/><br/>Ji Rutian began to talk about an old predecessor of the Ji Family who had calculated the fortunes, saying that Xuanzu’s World would welcome an unprecedented golden age. There would not only be nine individuals with ascending destinies but also the birth of Great Saints and Great Emperors.<br/><br/>Fang Wang listened attentively. He had long been curious about the existence from the Ji Family who had known the heavenly secrets, but unfortunately, he had no chance to meet them. The Ji Family had perished, leaving only Ji Rutian.<br/><br/>Fang Wang was very curious about how the Ji Family had met its end, but since Ji Rutian was reluctant to bring it up, Fang Wang didn’t press further.<br/><br/>Even if the Ji Family were still around, Fang Wang wouldn’t fear their conspiracies against him. Moreover, after his calculations, he confirmed that the Ji Family truly no longer existed.<br/><br/>Unless those who calculated such things were more skilled than he was.<br/><br/>After chatting for an hour, Fang Wang waved his hand and said, “Continue your cultivation. I’ll take a walk and will be back in a few days.”<br/><br/>Ji Rutian and Duan Tian weren’t worried— even a Great Saint would be no match for Fang Wang.<br/><br/>They now needed to seize every day to cultivate and keep Fang Wang’s patience from wearing thin.<br/><br/>Fang Wang walked slowly, as if strolling leisurely in a courtyard, yet each step could span a thousand miles.<br/><br/>After dozens of steps, he arrived at a field in between. The landscape here was open, and the mountains in the distance were not high. Walking on the rural road, he could see quite a few farmers and water buffalo plowing the fields on both sides.<br/><br/>Even though the Mortal Realm had entered an era of prosperous cultivation, there still existed ordinary mortals.<br/><br/>Fang Wang noticed a phenomenon: no matter where, there were classes, and these classes were not naturally formed but artificially suppressed.<br/><br/>Even in the omnipotent world of cultivation, there needed to be countless ordinary spirits to highlight the extraordinariness of cultivators.<br/><br/>Suddenly, Fang Wang had an idea.<br/><br/>He walked all the way to a stone bridge, where he sat down on the stone pier, put on the fox mask, and opened his mouth to say, “I am a person of cultivation. Today, I will teach the methods of cultivation to all who are interested in the way of cultivation. There is no need to pay with money or oneself.”<br/><br/>His voice echoed for a hundred miles around, and the nearby farmers all looked up in the direction of Fang Wang.<br/><br/>Fang Wang waited patiently, not in a hurry, to see if these mortals could seize the opportunity.<br/><br/>Before long, several children ran over, among them was one leading a small yellow ox, stumbling behind, giving the impression of someone who might fall at any moment.<br/><br/>Fang Wang couldn’t help but smile, not expecting the children to believe him first.<br/><br/>A young boy with only a tuft of hair on his head asked, “Are you a person of cultivation? Was it you who spoke just now?”<br/><br/>The boy was dressed in tattered clothes, his face covered in dirt, yet his eyes were clear and lively, curiously staring at Fang Wang.<br/><br/>Fang Wang didn’t explain. He raised his right hand and waved towards the sky. Suddenly, rolling thunderclouds gathered, and the sound of thunder resounded above the fields, leaving the children speechless with amazement, while the distant farmers thought a storm was coming and cursed the strange weather.<br/><br/>Once again, Fang Wang waved his hand, and the clouds in the sky dispersed instantly, as if it had gone from evening to high noon in a moment. The whole world brightened.<br/><br/>“Wow! He really is a person of cultivation!”<br/><br/>“An Immortal!”<br/><br/>“Immortal Grandpa, teach us!”<br/><br/>“Good heavens, I’m not seeing things, am I?”<br/><br/>The children were extremely excited; the youngest, only five or six years old, stood with his mouth wide open, staring blankly, drool dripping without his knowledge.<br/><br/>Fang Wang began to preach, teaching the basic Qi Gathering Method from the Heavenly Dao Immensity Scripture.<br/><br/>The children all sat down and listened attentively to his preaching.<br/><br/>Gradually, farmers and women started to come over. Fang Wang, in his unblemished white clothes and fox mask, truly attracted attention.<br/><br/>Only when they came close did they realize this person was the same one who had previously spoken of imparting cultivation methods. They were not hearing hallucinations.<br/><br/>Thus, more and more people gathered on both sides of the stone bridge to listen.<br/><br/>As the sun set and the moon rose, the morning sunlight swept over the mountain tops and onto the bridge, where more than five hundred people were listening intently to the preaching, with more villagers continuously arriving from different directions.<br/><br/>Fang Wang repeatedly explained the basic mental method, occasionally clarifying details, as most of these mortals had never been schooled. They didn’t understand acupoints, and some words were beyond their vocabulary.<br/><br/>After preaching for three days and three nights, Fang Wang finally stood up.<br/><br/>“Immortal Master, are you leaving?” an old man hastily asked, his frame skinny as kindling, his skin wax-yellow, with hardly a few teeth left in his mouth. But there was a spirited vigor about him, sparked by the teachings of cultivation.<br/><br/>Fang Wang nodded slightly.<br/><br/>“May I ask the Immortal Master’s name? We will erect a statue for you and burn incense in your honor!”<br/><br/>“Tiandao Fangwang.”<br/><br/>After dropping these four words, Fang Wang disappeared from the stone pier, leaving the villagers astounded and even more excited by this sudden vanishing act.\t\t\t\t\t\t</div>", "images": {}, "success": true}