{"id": 404, "url": "https://www.novelhall.com/i-became-an-immortal-on-mortal-realm-32879/14993369.html", "title": "Chapter 394 - Chapter 394: Chapter 391: The Great Perfection Of The Eighteen Layers Of Abi Hell!", "volume": 5, "volume_title": "Volume 5", "body": "<h1>Chapter 394 - Chapter 394: Chapter 391: The Great Perfection Of The Eighteen Layers Of Abi Hell!</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 394: Chapter 391: The Great Perfection of the Eighteen Layers of Abi Hell!<br/><br/>“`<br/><br/>“Great King!”<br/><br/>There were demons that cried out in alarm, their tones filled with panic. This exclamation of “Great King” awakened more and more demons.<br/><br/>“Master!”<br/><br/>Xiao Zi exclaimed in delight. It had been dreaming of pampering Fang Wang when it was suddenly roused. It was about to flare up in anger, but upon seeing Fang Wang’s handsome face, its anger dissipated instantly, replaced by joy.<br/><br/>Fang Wang let go, releasing it, and asked, “Do you have any other matters to attend to? If not, then it’s time for us to leave.”<br/><br/>Upon hearing this, Xiao Zi immediately turned its head and shouted towards the boundless sea of demons below: “My children, this king is leaving. From now on, you will have to fend for yourselves. I will not appoint a new king; let the strongest among you take the title. I hope that one day we can meet again at the summit of the Immortal Path.”<br/><br/>Ji Rutian, Duan Tian, and others watched as the demons gathered by Xiao Zi, all clicking their tongues in amazement.<br/><br/>Xiao Zi’s words echoed between heaven and earth, prompting countless demons to cry out in unison.<br/><br/>Without another word, Fang Wang took another step, traversing the Mortal Realm in a single stride to arrive in a new expanse of the Mortal Realm.<br/><br/>This part of the Mortal Realm was far inferior to the previous one, but it was still vast with a rich breath of life.<br/><br/>Fang Wang led everyone down to the seaside below and spoke, “Take out the secret arts you’ve collected. I shall begin my study now. You have three years. After that time, we must leave.”<br/><br/>At his words, everyone took out their respective secret arts.<br/><br/>Wei Buyu immediately left with the six Great Cultivators of the Celestial Qiankun Realm, while Xiao Zi, Ji Rutian, and Duan Tian stayed by Fang Wang’s side.<br/><br/>Xiao Zi asked curiously, “Master, have you reached the Celestial Qiankun Realm?”<br/><br/>Fang Wang sat down and, while picking up a scroll, responded, “Mhm.”<br/><br/>He had originally planned to return once he attained the Celestial Qiankun Realm, but ever since he felt the power of faith and prayer, he had changed his mind.<br/><br/>Why not spread secret arts in the Mortal Realm? In doing so, he could gain both fate and the power of faith and prayer.<br/><br/>The scroll in his hand was the very one the elder had entrusted to Wei Buyu. At that time, Fang Wang had seen that the elder was no ordinary man. He just couldn’t be bothered to dig deeper.<br/><br/>Not everything and everyone needs to be understood in full.<br/><br/>Ji Rutian and Duan Tian went to a distant place, distancing themselves and each began meditating.<br/><br/>Xiao Zi dove into the sea and began to frolic.<br/><br/>Fang Wang didn’t read for long before a look of curiosity crossed his face.<br/><br/>This secret art was no simple matter!<br/><br/>A full tea time passed before Fang Wang closed his eyes.<br/><br/>His consciousness arrived within the Heavenly Palace.<br/><br/>He sat down on the spot and began to practice this secret art.<br/><br/>This secret art was named the Eighteen Layers of Abi Hell, a type of illusionary Divine Skill. Each layer of hell inflicted suffering differently upon its victims, and although it was an illusion, the damage it caused could become real.<br/><br/>Used in conjunction with the Spiritual Elephant, this Divine Skill could be infinitely wondrous.<br/><br/>Fang Wang rarely practiced such Divine Skills, so he took great interest in practicing it, prepared for a lengthy period of seclusion.<br/><br/>Mastering it might not be difficult, but to reach Great Perfection, that would be tough.<br/><br/>Years passed rapidly.<br/><br/>In reality, it was but an instant.<br/><br/>Fang Wang closed his eyes, and upon opening them again, his will had traversed nine thousand years.<br/><br/>“`<br/><br/>The Eighteen Layers of Abi Hell have reached Great Perfection!<br/><br/>A smile appeared on Fang Wang’s face. He quite liked this Divine Skill!<br/><br/>The Great Perfection of the Eighteen Layers of Abi Hell required only a thought to be cast on an enemy. Unless the enemy’s soul was far stronger than his, they were certain to be ensnared.<br/><br/>The Lesser Completion of the Eighteen Layers of Abi Hell required eye contact or physical touch with the opponent, while the Great Completion required locking onto the opponent with one’s spiritual consciousness.<br/><br/>The Great Perfection of the Eighteen Layers of Abi Hell eliminated all these steps, becoming invincible.<br/><br/>Having just finished a nine-thousand-year seclusion, Fang Wang had lost interest in the mountains of secret scriptures before him.<br/><br/>He took out sheets of white paper from within the Dragon Jade Ring and began to write.<br/><br/>Before long, he quickly finished writing a copy of the Heavenly Dao Immensity Scripture and then interwove them together to form a real secret scripture.<br/><br/>As he continued to write, he was also reviewing the creation of the Heavenly Dao Infinite Book of Changes and sensing the rules of the world around him.<br/><br/>This Mortal Realm might not be powerful, but the rules of heaven and earth were no different, worthy of his continued enlightenment.<br/><br/>Sunsets and moonrises, though the coastal tides at the continent’s edge ebbed and flowed, there was a sense of timeless solitude.<br/><br/>One month later.<br/><br/>Fang Wang had written thousands of copies of the Heavenly Dao Immensity Scripture. That afternoon, as he continued to write, a fluctuation of spiritual consciousness came from the Jade Bracelet on his wrist.<br/><br/>He immediately stopped and probed the Jade Bracelet with his spiritual consciousness.<br/><br/>Arriving in the Illusionary Realm of the Fang Residence, Fang Wang saw Zhou Xue. Many years had not seen her, Zhou Xue’s attire was even more lavish than before, with a red dress embroidered with two golden phoenixes, lifelike in their display. Her long hair was piled up beneath a crown of purple jade and silver beads, with a halo floating behind her head, surrounded by dark red beads, exuding a suppressive aura.<br/><br/>Zhou Xue was also appraising Fang Wang. He looked the same as he had years before, but she knew how he had changed.<br/><br/>Every time Fang Wang made a breakthrough, the change in his aura was conveyed to her through the Jade Bracelet.<br/><br/>Zhou Xue was the first to speak, “Have you reached the Celestial Qiankun Realm?”<br/><br/>Fang Wang nodded with a smile.<br/><br/>“Tsk tsk, a seven-hundred-year-old Celestial Qiankun, truly unparalleled through the ages. And it’s not just your cultivation progress that is swift, your insights into your own sacred arts are incomparable to others,” Zhou Xue remarked with emotion.<br/><br/>Fang Wang asked with a smile, “And you?”<br/><br/>Zhou Xue replied, “It’s alright, barely keeping up with your pace. The changes in our Mortal Realm are tremendous now. With a Great Cultivator having become a saint and sacrificing for the lives of others, his saintly aura and Tao have brought an unprecedented era of prosperity. Now the spiritual energy of heaven and earth is abundant, far surpassing the past. The efficiency of cultivation has greatly increased, and furthermore, many ancient heavenly treasures have emerged from the ground. You should be careful, though—a seven-hundred-year-old Celestial Qiankun might not remain stable, and in the future, there will certainly be those who can cultivate faster than you.”<br/><br/>Fang Wang asked curiously, “Who has become a saint?”<br/><br/>“The Primordial Sect Master, now known as the Primordial Great Saint. He has perished, but because of his merits, his Primordial Unity Sect is praised by all beings as the number one holy sect in the Mortal Realm. Its fate is also the first in the world; those who join the sect to cultivate can gain great fortune. In just a few decades, the overall strength of the Primordial Unity Sect has become the foremost in the Western Mortal Realm.”<br/><br/>“In his past life, did he become a saint?”<br/><br/>“No, the Primordial Sect Master of the past life, though also top-tiered, never became a saint. The destiny of heaven and earth has changed, and we can’t measure it by the past life anymore,” Zhou Xue said with a complex tone in her voice.<br/><br/>Hearing this, Fang Wang grew even more interested in Xuanzu’s World.<br/><br/>The stronger Xuanzu’s World was, the more excited he felt.<br/><br/>If he didn’t get a good chance to display the sacred arts he had cultivated, wouldn’t it all be in vain?<br/><br/>Zhou Xue then said, “The Tiangong Sect has gifted a Dao Origin Spirit Jade to Wangdao, and the news has spread across the world. Hong Chen knew this would bring great trouble and thus took the opportunity to invite cultivators from all over to come and worship the divine traces of Kunlun in ten years. Now the Descending Dragon Continent is becoming lively. Hong Chen is full of confidence, but I think it’s best to have backup plans, so I’ve specifically come to inform you. If you wish to return, I have a way to bring you back directly.”<br/><br/>Fang Wang raised an eyebrow and said, “In ten years? Then I am curious to see if anyone dares to stand before me today. You don’t need to help me; I already know how to return.”\t\t\t\t\t\t</div>", "images": {}, "success": true}