{"id": 419, "url": "https://www.novelhall.com/i-became-an-immortal-on-mortal-realm-32879/15021287.html", "title": "Chapter 409 - Chapter 409: Chapter 406: Ancient Demons, Immortal Court Cultivation Technique!", "volume": 5, "volume_title": "Volume 5", "body": "<h1>Chapter 409 - Chapter 409: Chapter 406: Ancient Demons, Immortal Court Cultivation Technique!</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 409: Chapter 406: Ancient Demons, Immortal Court Cultivation Technique!<br/><br/>After mastering the Absolute Darkness Divine Skill, Fang Wang rested for half a year, and then continued to peruse the secret texts.<br/><br/>There were still more than three hundred years until the opportunity for ascension, a period neither short nor long. He must possess the power to contend with the Heavenly Gods before their descent.<br/><br/>Not just contend!<br/><br/>Fang Wang’s ambition was great.<br/><br/>As the number of Disciples of Wangdao increased, the construction speed of Kunlun became faster. Not only did the mountain grow taller, but the Tiangong Sect also began to deploy marvels below the middle of the mountain.<br/><br/>As the future number one Daoist site under heaven, Kunlun must be not only grand in height but also equipped with many prohibitions, gathering energy, Illusionary Realms, cultivation, and so forth, everything that was needed.<br/><br/>After Fang Wang’s return, more and more forces willing to sponsor Wangdao emerged, and today’s Wangdao was too powerful. Those supporting forces no longer dared to request an audience with Fang Wang, so his usual cultivation was not disturbed.<br/><br/>Spring came and went, and the woods around Kunlun grew even more lush, which also affected the Sword Heaven Marsh. The forest across from Fang Wang continued to rise majestically, beautiful as a painting.<br/><br/>Years passed.<br/><br/>Another twenty years went by.<br/><br/>In these years, Fang Wang did only one thing, and that was integrating the Heavenly Dao Myriad Classic of Laws with the Absolute Darkness Divine Skill.<br/><br/>Yet, even with the Heavenly Palace, this task was difficult.<br/><br/>Twenty years passed, and Fang Wang still had not succeeded. These two Cultivation Techniques were vast and profound, not something that could be simply cobbled together.<br/><br/>At noon.<br/><br/>Dugu Wenhun came to find Fang Wang with a grave expression. “Dao Master, Yang Du and Zhu Yan killed the chief disciple of the Taiqing Xuanjiao while competing for fate, and now the Taiqing Xuanjiao is slandering them everywhere,” he said.<br/><br/>Fang Wang asked, “Does this matter have a big impact?”<br/><br/>“Not for the time being, the Taiqing Xuanjiao cannot compare with us. But since they have profound roots and extensive connections, I am afraid they might use this incident to start plotting against Wangdao. Moreover, Yang Du and Zhu Yan really did go too far, their actions are becoming increasingly reckless,” Dugu Wenhun said, frowning.<br/><br/>Before joining Wangdao, Yang Du was already a man of unscrupulous means, relying on his immortality to act recklessly. Zhu Yan, the son of the Demon King, was equally arrogant and domineering. The two of them together were truly a match made in heaven.<br/><br/>Fang Wang asked, “Have they been killing innocents indiscriminately?”<br/><br/>“No, their dispute with the Taiqing Xuanjiao was over an opportunity,” Dugu Wenhun replied.<br/><br/>“Then let them be. Although Wangdao upholds the great justice of world peace, we cannot bind the survival of our disciples because of it,” Fang Wang said.<br/><br/>The competition for ascension was imminent. It was not only about the chance for ascension but also about the great fate. To become a Saintly Emperor, one could not succeed just by secluded cultivation.<br/><br/>As long as the disciples of Wangdao did not commit wanton evil acts or fight amongst themselves, Fang Wang was reluctant to interfere too much.<br/><br/>Everyone has their own destiny. If he, as a hands-off manager, were to interfere too broadly, it would be unduly harsh.<br/><br/>Upon hearing this, Dugu Wenhun looked as though he wanted to say more but, after thinking it over carefully, he nodded in agreement.<br/><br/>Fang Wang asked, “What has Ji Rutian been up to recently?”<br/><br/>Compared to Yang Du and Zhu Yan, Ji Rutian was more likely to cause trouble. Ji Rutian might seem respectful in front of Fang Wang, but after the Ascension Formation ended, the guy disappeared.<br/><br/>According to Zhou Xue’s previous life description, Ji Rutian was one who would truly stop at nothing and had even backstabbed Yang Du.<br/><br/>“I heard he went to the Western Mortal Realm. Although Xuan Zong is intensifying its deployment in the Western Mortal Realm, it has not yet spread throughout, so for now, we do not know what he is doing,” Dugu Wenhun answered. He didn’t have much regard for Ji Rutian.<br/><br/>A genius of the Saint Clans?<br/><br/>Wangdao had no shortage of them.<br/><br/>Fang Wang nodded, then let Dugu Wenhun leave.<br/><br/>For some reason, Fang Wang always felt that something big was about to happen in the Mortal Realm.<br/><br/>This feeling stemmed from his perception of the laws of the universe, and he could sense that these laws were changing, bringing with them unfortunate calamities.<br/><br/>After pondering for a moment, Fang Wang couldn’t help but reach out with his divine sense into the Jade Bracelet he held, trying to contact Zhou Xue.<br/><br/>However, this time, he was not successful.<br/><br/>In the past, whenever he contacted Zhou Xue, she would pull him into the Illusionary Realm without delay.<br/><br/>Could it be that she had encountered some sort of trouble?<br/><br/>Fang Wang decided not to disturb her further, reasoning that someone with Zhou Xue’s cultivation level would certainly be aware of his attempt; she must be preoccupied with important matters and unable to attend to him.<br/><br/>It wasn’t until nightfall.<br/><br/>Finally, Fang Wang’s Jade Bracelet conveyed the fluctuation of Zhou Xue’s divine sense. He opened his eyes, extended his divine sense into the bracelet, and followed it into the Fang Residence’s Illusionary Realm.<br/><br/>Zhou Xue appeared before him, and he couldn’t help but scrutinize her, though her state wasn’t apparent within the Illusionary Realm.<br/><br/>“I’ve run into a bit of trouble,” Zhou Xue stated straightforwardly.<br/><br/>“What trouble?”<br/><br/>“At the junction of the Eastern Mortal Realm and Western Mortal Realm, a large number of ancient Demons, predating the era of Xuanzu’s World and older than that, have emerged. These Demons have been a scourge even in The Upper Realm, impossible to eradicate in their entirety. Currently, I am staying within a Great Saint’s sanctuary, and the Demons are surfacing from here,” Zhou Xue briefly explained.<br/><br/>Fang Wang asked, “Do you need my help?”<br/><br/>Zhou Xue shook her head slightly and said, “No need. Aren’t you busy creating the way for mortals to become Immortals? You don’t need to come here. The primordial Demons will inevitably become a calamity that can’t be prevented in advance. The reason I’m here is to hunt them down and refine a Demon Weapon.”<br/><br/>She paused for a moment before continuing, “You should be able to sense the unusual atmosphere between heaven and earth. The Mortal Realm will soon fall into turmoil, which will continue even after the arrival and ascension of the Immortal Divine beings. I estimate that many Great Saints and Great Emperors will reappear in the Mortal Realm. Wangdao has already become one of the foremost powers in the Mortal Realm and will inevitably be drawn into the chaos sooner or later. There isn’t much time left for you.”<br/><br/>Fang Wang fixed his gaze on her and asked, “If I were to slay the Doom God, would it affect your ascension?”<br/><br/>Zhou Xue laughed, “How could it affect me? If you can slay the Doom God, the Immortal Court might even recruit you, unless you continuously refuse. But no matter what, I have ways to ensure that the Immortal Court cannot reject me.”<br/><br/>On hearing this, Fang Wang immediately felt relieved.<br/><br/>“I’ve just received the inheritance of the Absolute Emperor and can create new powers based on the laws of the universe. Do you want to learn it?” Fang Wang asked with a smile.<br/><br/>Zhou Xue gave him a strange look and said, “You are not only talented, but your fate is also outrageously strong. What you’re talking about must be the Absolute Darkness Divine Skill. This skill is also famous in The Upper Realm, it seems the Absolute Emperor set up quite an elaborate scheme in the Mortal Realm.”<br/><br/>“Just tell me, do you want to learn it or not?”<br/><br/>“If I were to cultivate it, it would certainly waste my time, but understanding it a bit wouldn’t hurt.”<br/><br/>“Don’t you have any Immortal Law to pass on to me? I just want the cultivation techniques of the Immortal Divine.”<br/><br/>“Alright, now that you’re qualified to encounter it, you can withstand the backlash of the Immortal Law.”<br/><br/>After a moment’s contemplation, Zhou Xue agreed.<br/><br/>Fang Wang began by imparting the Absolute Darkness Divine Skill, and afterward, Zhou Xue transmitted a technique to him.<br/><br/>Purple Qi Immortal Technique!<br/><br/>This technique is a supreme cultivation method within the Immortal Court, and as Zhou Xue put it, it was the most powerful technique she had access to in her former life in the Immortal Court.<br/><br/>Upon hearing her words, Fang Wang wanted to ask her not to continue, but he held back.<br/><br/>He couldn’t afford to lose face in front of Zhou Xue!<br/><br/>He had to be either completely mad or thoroughly imposing!\t\t\t\t\t\t</div>", "images": {}, "success": true}