{"id": 416, "url": "https://www.novelhall.com/i-became-an-immortal-on-mortal-realm-32879/15017434.html", "title": "Chapter 406 - Chapter 406: Chapter 403: Establishing A Method For Mortals To Attain Immortality", "volume": 5, "volume_title": "Volume 5", "body": "<h1>Chapter 406 - Chapter 406: Chapter 403: Establishing A Method For Mortals To Attain Immortality</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 406: Chapter 403: Establishing a Method for Mortals to Attain Immortality<br/><br/>“`<br/><br/>The Ascension Formation concluded after half a day, but the Kunlun gathering was still ongoing. Despite the presence of numerous forces with ulterior motives, many more were there to establish connections with Wangdao. Dugu Wenhun and Hong Chen began entertaining representatives from various forces, while Fang Wang disappeared and didn’t show up again.<br/><br/>As the grand event continued, various pieces of news began to sweep across the world!<br/><br/>Heavenly Stem Venerate!<br/><br/>Heavenly Dao has appeared!<br/><br/>With the power of one, suppressed all the heroes of the world!<br/><br/>No one has seen the true face of Heavenly Dao!<br/><br/>Etcetera. Messages like these, akin to hurricanes, were about to trigger a seismic shock in the Mortal Realm, the likes of which had not been encountered in a millennium.<br/><br/>The protagonist of this world-shaking news, Fang Wang, then returned to his hometown, in Grand Qi Yanghu County, Southern Hills City.<br/><br/>Only a handful of people within Fang Residence knew of Fang Wang’s return and deliberately sealed the news. Nevertheless, with the spreading news of Heavenly Dao reappearing in the Mortal Realm, Southern Hills City still attracted countless visitors.<br/><br/>Descending Dragon Continent, southern sea area.<br/><br/>Yang Jun followed Xu Qiuming, flying on his sword. He opened his mouth to ask, “Senior, are we just leaving like this? Wangdao seems very busy, and as a member of Dao Sect, can you really just leave directly?”<br/><br/>Heavenly Dao appeared, and Xu Qiuming left that very day.<br/><br/>Yang Jun thought Xu Qiuming had issues with his emotional intelligence.<br/><br/>“It’s fine. Sword Sect doesn’t have many disciples, and my strength isn’t enough to expand Sword Sect. You’ve seen the strength of the Heavenly Stem Venerate. If I don’t hurry to enhance my power, the position of Dao Sect might not be secure,” said Xu Qiuming without turning his head, his tone steady.<br/><br/>Yang Jun got excited and said, “The Thirty-Six Heavenly Stem Venerates are so strong, and only eight have appeared so far. Senior, do you think those Heavenly Stem Venerates who haven’t appeared yet might be even stronger?”<br/><br/>Xu Qiuming fell silent; he was curious about this question too.<br/><br/>It’s not the Heavenly Stem Venerate in the Celestial Qiankun Realm that are the most terrifying, but the fact that eight of the Thirty-Six Heavenly Stem Venerates have already appeared!<br/><br/>Although Yang Jun did not venture into Kunlun, the scene at the time still made his blood boil to this day.<br/><br/>He made up his mind to join Wangdao!<br/><br/>He planned to take the opportunity to pull in his sister and join Wangdao together.<br/><br/>The Seventy-Two Fairy Caves are nothing compared to Wangdao!<br/><br/>In the days that followed, the name of the Thirty-Six Heavenly Stem Venerates spread across the Seven Seas and Fifteen Continents and towards the Western Mortal Realm.<br/><br/>A year later.<br/><br/>The craze of the world had not yet subsided, and the creatures around Kunlun only increased rather than decreased, keeping Grand Qi in a state of prosperity.<br/><br/>That day.<br/><br/>In Sword Heaven Marsh, within the Wangdao Attic.<br/><br/>Fang Wang sat in the chief seat, with Dugu Wenhun, Hong Chen, Song Jinyuan, Yang Du, Zhu Rulai, Jiang Shenming, Chu Yin, Zhu Yan, Wei Buyu, and others gathered around. Just the senior members present exceeded a hundred people.<br/><br/>Aside from Sword Sect, the established Dao Sects had set up Dao Xiang and Seekers of Dao. Dao Xiangs assist in managing the disciples of Dao Sect and may participate in high-level meetings, while Seekers of Dao are responsible for preaching. Below them were ordinary disciples.<br/><br/>Dugu Wenhun was reporting on the situation of Wangdao.<br/><br/>Currently, the number of disciples in Wangdao exceeded two million, and this was still under the conditions of restrictive thresholds set by Hong Chen. There were numerous disciples in each realm, and the number of True Soul Realm disciples had already surpassed ten, which was a testament to Wangdao’s appeal.<br/><br/>Dugu Wenhun reported for a long time, his face brimming with smiles, and said, “Now that the Dao Origin Spirit Jade has been established, the cultivation of all disciples of the Dao will be greatly improved, which is beneficial for our later struggle for the world’s great fate.”<br/><br/>Fang Wang spoke up, “Fate is secondary. Warn the disciples not to act recklessly in the pursuit of fate. Those who wish to ascend may leave Wangdao; otherwise, after ascending, the karmic consequences of Wangdao will only harm them.”<br/><br/>“`<br/><br/>As the Primordial Great Saint passed away and the spiritual energy in the mortal realm soared, the struggle for fate had already begun. Fang Wang did not conceal the contradiction between himself and the Immortal Divine; instead, he let Hong Chen and others spread the word. He must make it clear to the Disciples of the Way of Hope which path he was treading.<br/><br/>A year after the news had spread, not many disciples left the path, and the number of those who joined had actually increased.<br/><br/>The Heavenly Dao intended to create an unprecedented Immortal Law in the mortal realm, allowing mortals to become immortals without ascending, and this matter was fermenting.<br/><br/>There were limited places for ascension, but if the Heavenly Dao succeeded, then everyone in the mortal realm could become immortal!<br/><br/>Regardless of whether it was an overstatement or not, the concept proposed by the Heavenly Dao was enough to command respect from all living beings under the sky.<br/><br/>The Heavenly Dao did not cultivate for the sake of becoming powerful but had grand ambitions and responsibilities that most cultivators lacked.<br/><br/>The Great Saints and Great Emperors of ancient times were such figures; however, it was unclear from when the Great Saints and Great Emperors no longer embodied the benefactors of the human world but represented the pinnacle of power in the mortal realm.<br/><br/>Fang Wang’s words made the hundreds of people in the hall nod in agreement. Someone laughed and said, “I guess no one would want to leave. Xuan Zong has said that once you leave the path, you will not be accepted back. The deterrent power of this rule is not small.”<br/><br/>The others joined in the conversation, all chatting and laughing, creating a jovial atmosphere.<br/><br/>With the return of the Dao Master, the atmosphere in Wangdao had greatly changed, and all disciples were filled with hope for the future.<br/><br/>Song Jinyuan laughed and said, “Dao Master, why not select some from the Heavenly Stem Venerate to be Dao Sects?”<br/><br/>There were only five Dao Sects now: Xuan Zong, Buddhist Sect, Sword Sect, Divine Sect, and Body Sect—far from the count of twelve.<br/><br/>“There is no need to forcibly complete the Twelve Dao Sects. The Thirty-Six Heavenly Stem Venerates have not been filled either. The time is not right,” Fang Wang shook his head and said.<br/><br/>The Heavenly Stem Venerates, on the other hand, showed a hint of arrogance. Originally, they felt some regret about not becoming Dao Sects, but after the great battle a year earlier, the reputation of the Heavenly Stem Venerates, both within Wangdao and in the hearts of the people of the world, was not inferior to that of the Dao Sects—perhaps even higher.<br/><br/>They began to take pride in being Heavenly Stem Venerates.<br/><br/>“Fellow disciples, from now on, I will stay in Wangdao and concentrate on comprehending the Dao. As always, act as if I am not here, and do not disturb me unless there is something particularly important.”<br/><br/>Fang Wang said with a smile, his cultivation level was only in the early stage of the Celestial Qiankun Realm, but going forward, he did not plan to focus solely on cultivation. He intended to create another path.<br/><br/>This path required him to integrate various Cultivation Techniques. After all, his Heavenly Dao Infinite Book of Changes had the ability to autonomously absorb nature’s spiritual energy, so his cultivation level would continue to rise.<br/><br/>“Dao Master, rest assured and focus on your cultivation; we will definitely not disturb you.”<br/><br/>“Who in the world would dare to covet Wangdao now?”<br/><br/>“All we need to do now is wait for the success of Kunlun’s construction.”<br/><br/>“I have already instructed my disciples to assist the Tiangong Sect, which will surely shorten the construction period.”<br/><br/>“Exactly, we will also strictly oversee the disciples to ensure that nothing goes awry.”<br/><br/>Looking at these people, Fang Wang also revealed a smile of satisfaction on his face. There were many whom he was seeing for the first time, but he could feel their trust and expectation for Wangdao.<br/><br/>It felt good.<br/><br/>After the time it took for an incense stick to burn, everyone gradually left.<br/><br/>Fang Wang then walked to the bridgehead where he used to cultivate. He sat down, and with a wave of his right hand, a heap of secret manuals appeared beside him.<br/><br/>Wei Buyu came up behind him and said, “Dao Master, we wish to continue seeking ultimate techniques for you.”<br/><br/>“Go ahead, but remember not to take lives unless it’s absolutely necessary,” Fang Wang replied. He picked up a Cultivation Technique manual and started to flip through it.<br/><br/>Wei Buyu chuckled and then vanished behind him.\t\t\t\t\t\t</div>", "images": {}, "success": true}