{"id": 410, "url": "https://www.novelhall.com/i-became-an-immortal-on-mortal-realm-32879/15002071.html", "title": "Chapter 400 - Chapter 400: Chapter 397: Suppressing The Celestial Qiankun Single-Handedly", "volume": 5, "volume_title": "Volume 5", "body": "<h1>Chapter 400 - Chapter 400: Chapter 397: Suppressing The Celestial Qiankun Single-Handedly</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 400: Chapter 397: Suppressing the Celestial Qiankun Single-Handedly<br/><br/>“`<br/><br/>Accompanied by Ye Xunhuan’s voice that shook the heavens and earth, streaks of sunlight pierced through the thunderclouds, scattering across the ridges of Kunlun in all directions.<br/><br/>Inside Sword Heaven Marsh, Hong Xian’er, who was preparing to head to Kunlun, stopped. She furrowed her beautiful brows and looked up into the sky.<br/><br/>She felt an exceedingly powerful presence, one that wasn’t comparable to Jiang Shenming and his opponent. At that moment, she inexplicably thought of her father.<br/><br/>In her life, she had only ever felt such an overwhelming presence on Emperor Donggong, giving one a sense of an indomitable, crushing force.<br/><br/>It wasn’t just her; the powers gathered around Kunlun from all directions were also startled.<br/><br/>To the south of Kunlun, a ghostly mist rose from the wilderness like a tornado, revealing an old woman as thin as firewood, holding a staff with a skull perched on top. With furrowed white brows, she stared intently at the heavens.<br/><br/>To the north of Kunlun, a golden stairway swept across the mountains, with a group of Golden-robed Cultivators walking on it, each looking as majestic and elegant as Heavenly Monarchs descending to the mortal realm.<br/><br/>The man leading the front was tall, with broad shoulders and a waspish waist, his belt tied with long ribbons. Behind him floated more than a dozen Long Sabers arrayed in a fan shape. Despite his full head of white hair, his face was remarkably young and handsome. He raised his eyes to the rays of sunlight above Kunlun, his gaze gleaming sharply.<br/><br/>Simultaneously, to the west of Kunlun.<br/><br/>Scores of sects took to the sky, with over a million Cultivators and Demons pulling out their respective Magical Artifacts, creating gusts of yao winds and rising bursts of murderous aura.<br/><br/>“Celestial Qiankun…”<br/><br/>A black-clad man standing on a gourd looked up at the Firmament, murmuring to himself while his right hand rested on the hilt of his sword, gripping it tightly.<br/><br/>It wasn’t just him; other Great Cultivators were also on high alert. Faced with Ye Xunhuan’s domineering declaration of war, no one dared to respond.<br/><br/>They began to communicate, asking about the name of Ye Xunhuan.<br/><br/>“Heavenly Stem Venerate? What is that? Does Wangdao harbor such powerful figures?”<br/><br/>“This presence is definitely the legendary Celestial Qiankun.”<br/><br/>“No wonder Wangdao possess Dao Origin Spirit Jade and dares to announce it to the world, it turns out they’ve been hiding Celestial Qiankun.”<br/><br/>“It’s actually not Heavenly Dao, has the Heavenly Dao truly disappeared?”<br/><br/>“Ye Xunhuan, how comes I’ve never heard this name before?”<br/><br/>The discussions on the western side of Kunlun seemed as if they were about to overturn the Firmament, while on the eastern side, Demonic Qi swirled tumultuously as Demonic Cultivators clad in black robes seemed to step out from hell itself, all their gazes fixed on the Firmament.<br/><br/>The battle between Jiang Shenming and the mysterious Great Cultivator was overshadowed, with Ye Xunhuan not yet appearing in person, but the domineering presence belonging to Celestial Qiankun was reverberating through heaven and earth.<br/><br/>Yang Jun stood behind Xu Qiuming, excitedly saying, “Heavenly Stem Venerate, it’s the voice of that senior from a year ago!”<br/><br/>Xu Qiuming had a complex expression on his face. He had faced Ye Xunhuan before and knew firsthand how terrifying Ye Xunhuan could be.<br/><br/>With such a powerful figure taking action, who could threaten Wangdao?<br/><br/>What’s more, Fang Wang was even stronger!<br/><br/>But why hasn’t Fang Wang made an appearance?<br/><br/>At the same time.<br/><br/>On a mountain path, there was an inn, where Fang Wang and others were seated at a table, drinking and watching the distant battle.<br/><br/>“Three Celestial Qiankun have come, but they’re still not enough for us to fight,” said Han Yu with a chuckle.<br/><br/>Ji Rutian glanced at him; that sure sounded easy.<br/><br/>Three Celestial Qiankun, such power would have been unbearable for any party in the past.<br/><br/>Compared to Wangdao’s current situation, Ji Rutian became even more aware of how powerful Fang Wang now was.<br/><br/>He couldn’t think of anyone who could pose a threat to Fang Wang, unless a Great Saint were to resurrect.<br/><br/>And yet, there had already been a Great Saint defeated by Fang Wang’s hand.<br/><br/>Boom—<br/><br/>“`<br/><br/>The thunderclouds in the sky suddenly dispersed, and the fierce winds howled for a million miles, whipping up billows of dust.<br/><br/>Ye Xunhuan descended from the heavens; the White Jade Ruler in his hand was emitting a glow even more dazzling than the sunlight. His robe violently fluttered about, and the light around his body coalesced into an imposing phantom figure, like a War God from the sky, clad in armor and wielding a Long Saber, peerlessly overbearing.<br/><br/>Red Dust, Dugu Wenhun, Xu Yan, and others looked up at him, all showing surprise, wondering when this Heavenly Stem Venerate had popped up.<br/><br/>Red Dust calculated with his fingers and his expression turned subtle.<br/><br/>Dugu Wenhun asked, “Dare I ask, friend, who has been appointed as the Heavenly Stem Venerate?”<br/><br/>The Thirty-Six Heavenly Stem Venerates?<br/><br/>That’s more than the number of the Twelve Dao Sects, and the key point is that this person is stronger than all the Dao Sects combined!<br/><br/>If there were thirty-five more like him…<br/><br/>Ye Xunhuan looked down at them with a lifted corner of his mouth, smiling, “Naturally, it is determined by the Dao Master. Who else has the authority to do so? Do you dare?”<br/><br/>His gaze swept over Red Dust, Dugu Wenhun, and the others with unabashed aggressiveness.<br/><br/>The crowd felt displeased under his gaze, but due to his overwhelming strength, they didn’t dare to rebuke him.<br/><br/>From behind, Lü Xianming couldn’t help asking, “Where is the Dao Master? Where is he now?”<br/><br/>Upon hearing this, everyone turned their expectant gazes to Ye Xunhuan.<br/><br/>“The Dao Master will appear when the time comes. Right now, the predicament of the Wangdao only requires my intervention; just three at the Celestial Qiankun Realm, I can suppress them single-handedly!”<br/><br/>Ye Xunhuan said boastfully, his laughter echoing between heaven and earth.<br/><br/>Everyone could sense his pride; his loud voice was not for the enemy to hear, but for Fang Wang.<br/><br/>He had lost face twice before Fang Wang and he had to reclaim his honor.<br/><br/>The leader of the Thirty-Six Heavenly Stem Venerates: that was what he aspired to be!<br/><br/>Although it was Wei Buyu who had brought him to Fang Wang, he was not willing to submit to Wei Buyu!<br/><br/>The world fell silent, and the converging momentum from all directions suddenly weakened. Even the Great Cultivator fighting with Jiang Shenming began to retreat, moving away from Kunlun.<br/><br/>Red Dust looked deeply at Ye Xunhuan and said, “Prepare to form the array!”<br/><br/>His voice reached the ears of a million Wangdao Cultivators on Mount Kunlun and in an instant, all Wangdao Cultivators raised their hands, beginning to cast spells. Their gestures were synchronized, creating a spectacle from high above.<br/><br/>Ye Xunhuan glanced at Red Dust, secretly astonished, having never seen so many Cultivators line up so neatly before. How high was the execution power required for this?<br/><br/>This person’s prestige must be extremely high; could it be that he was the Xuan Zong of the Wangdao?<br/><br/>The Spiritual Energy of all of Kunlun began to surge, the ground seeming to emanate winds, causing the robes of all on the mountain to billow upward.<br/><br/>“Single-handedly suppress three at the Celestial Qiankun Realm? My friend, you do indeed boast mightily!”<br/><br/>A cold snort sounded, and a golden staircase stretched out from the north. Leading the way was a man in golden robes, every movement exuding the majesty of an emperor.<br/><br/>As he moved forward, dragon-shaped golden Qi emerged from his body, and the sounds of dragon roars followed.<br/><br/>Ye Xunhuan glanced over, frowning.<br/><br/>“You must not fight on Kunlun; it would affect my formation and impact the grand Fate of the Wangdao,” Red Dust’s voice rang out as he calmly watched the golden-robed man in the distance.<br/><br/>After hearing this, Ye Xunhuan immediately flew towards the golden-robed man.<br/><br/>“Golden Light Dragon Venerable, from youth he tempered his body with dragon’s blood, rendering his flesh as precious as a treasure, unbreakable. His weakness lies in his fragile spirit and his aversion to cold. Once the dragon blood inside him is frozen, his strength will drastically decline,” Red Dust continued. Upon hearing this, Ye Xunhuan couldn’t help but glance back at him. The Golden Light Dragon Venerable frowned in the distance, bearing a look of murderous intent towards Red Dust.\t\t\t\t\t\t</div>", "images": {}, "success": true}