{"id": 415, "url": "https://www.novelhall.com/i-became-an-immortal-on-mortal-realm-32879/15017433.html", "title": "Chapter 405 - Chapter 405: Chapter 402 Opening A Brand New Path", "volume": 5, "volume_title": "Volume 5", "body": "<h1>Chapter 405 - Chapter 405: Chapter 402 Opening A Brand New Path</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 405: Chapter 402 Opening a Brand New Path<br/><br/>Within the Eighteen Layers of Abi Hell, as Fang Wang’s voice faded, all that remained was the panting of Ji Yutian.<br/><br/>Struggling to lift his head, Ji Yutian’s eyes, full of bloodshot, conveyed terror.<br/><br/>“What’s the matter, Thousand Eyes Great Saint, have you lost even the courage to face me?”<br/><br/>Fang Wang’s voice rose again, indifferent in tone, exuding a strong sense of oppression.<br/><br/>After several breaths, wisps of white steam emerged from Ji Yutian’s body, condensing into eyes all around him, all gazing up at Fang Wang.<br/><br/>“I didn’t expect that in just a few years, you have grown to such an extent. Could it be that you have already achieved Saintly Emperor Certification?”<br/><br/>The voice of the Thousand Eyes Great Saint sounded.<br/><br/>Fang Wang responded, “No, and I do not wish to follow the path of the Great Saint or the Great Emperor.”<br/><br/>The Thousand Eyes Great Saint asked in surprise, “You want to forge a completely new path?”<br/><br/>“Why not, were there always Great Saints in heaven and earth? Were there always Great Emperors?”<br/><br/>The Thousand Eyes Great Saint fell into silence.<br/><br/>Fang Wang asked, “Thousand Eyes Great Saint, your current plight is clearly at odds with the Immortal Divine, yet you collude with the pawns of the Immortal Divine. What exactly are you scheming?”<br/><br/>If the Thousand Eyes Great Saint had sided with the Immortal Divine, how could he have ended up with his life and Dao destroyed?<br/><br/>Look at the Xuandu Great Saint, he can still hold an office in the Immortal Court!<br/><br/>The voice of the Thousand Eyes Great Saint rose, mournful in tone, “Naturally, I harbor resentment against the Immortal Divine, but I also bear a grudge against you. You interfered with my resurrection. If I can eliminate you with the help of the Immortal Divine, it would do me no harm. As for my feud with the Immortal Divine, that can be settled later.”<br/><br/>“And do you feel that continuing to be my enemy now benefits you?” Fang Wang’s voice betrayed no emotion.<br/><br/>The Thousand Eyes Great Saint mocked, “What? You want to persuade me to bow my head? I can wait for your death before I plan my resurrection. Throughout history, there have been many prodigies like you. Either they bow to the Immortal Divine and ascend, or they perish along with their Dao. Today, although I have failed, I can wait.”<br/><br/>Fang Wang said indifferently, “What if I go to the Underworld to look for you next? You don’t think I’m incapable of that, do you?”<br/><br/>The Thousand Eyes Great Saint was silent once more.<br/><br/>“Ah—”<br/><br/>All of a sudden, Ji Yutian screamed in agony, as steaming hot soup began to merge into his flesh, scorching his soul, causing pain so intense it brought him to the brink of collapse.<br/><br/>“What exactly do you want?” the Thousand Eyes Great Saint could not help but ask, his voice showing evident recoil.<br/><br/>“Within fifty years, come see me in Kunlun with your sincerity. If you can move me, the grievances of you and me will be water under the bridge, and we may yet join forces against a common foe.”<br/><br/>As his voice ceased, the eyes surrounding Ji Yutian all dissipated, leaving only Ji Yutian’s screams within the Eighteen Layers of Abi Hell.<br/><br/>In the extreme torment, Ji Yutian repented his sins; thus Fang Wang knew he did not come for the Dao Source Spirit Jade, but to obliterate the Wangdao to gain the greatest fame in the world and seize immense Fate.<br/><br/>For such a person, Fang Wang naturally wouldn’t show mercy.<br/><br/>Kunlun fell into silence, with only the whistling wind, which made Kunlun even more oppressive.<br/><br/>The cultivators and demons around Kunlun could only exclaim in awe.<br/><br/>As time passed, a spectacular crowd formed on the edge of Kunlun in the sky, and painters began to capture this moment. They all understood that today’s events would mark the turning point for Wangdao’s complete ascension in the Mortal Realm.<br/><br/>With the Eight Great Celestial Qiankun and the Heavenly Dao that suppresses all heroes, not even the Primordial Unity Sect has shown such depth, at least not openly.<br/><br/>The Ascension Formation continued to operate, allowing all cultivators of Wangdao to feel their own transformation, which made them even more focused.<br/><br/>The thunderclouds in the sky gradually dispersed, giving way to sunlight.<br/><br/>Time passed without measure.<br/><br/>The cultivators and demons suspended in the air one by one woke up, gasping heavily, their faces reflecting fear and despair.<br/><br/>Even though Fang Wang held back, the Eighteen Layers of Abi Hell still caused them indelible psychological trauma.<br/><br/>For those with malicious intent, Fang Wang was not merciful to the point of being completely free of suspicion.<br/><br/>“I am alright?”<br/><br/>“Have you also experienced hell?”<br/><br/>“That’s right, the power of the Heavenly Dao is almost too inconceivable. Could it be that it has already achieved sainthood?”<br/><br/>“Phew, the Heavenly Dao did not go back on its word. I feel that if it wanted to kill us, it would be effortless…”<br/><br/>“Wangdao should be the first under the heavens!”<br/><br/>After experiencing the horror of the Eighteen Layers of Abi Hell, those cultivators and demons didn’t hold a grudge against Fang Wang, but rather came to respect him.<br/><br/>They now treasured the state of being alive and untormented incredibly!<br/><br/>Meanwhile.<br/><br/>Fang Wang’s figure was no longer visible on the Dao Origin Spirit Jade.<br/><br/>He had returned to Sword Heaven Marsh, standing at the head of the bridge, with Fang Zigeng and Fang Hanyu standing on either side of him, the three brothers side by side, as the lake breeze blew, fluttering their garments.<br/><br/>Fang Wang gazed at the lake and asked, “Zi Geng, is there anyone you wish to kill?”<br/><br/>Seeing the change in Fang Zigeng’s demeanor, Fang Wang knew his experiences over the years had not been easy, so he did not inquire into Fang Zigeng’s pain.<br/><br/>Fang Wang possessed great kindness in saving the people of Cang, but he also had the selfishness of protecting his own. He was not an Immortal, he was not a Divine Being, he was merely human.<br/><br/>Fang Zigeng glanced at Fang Wang and shook his head with a wry smile, “Don’t worry, those I wanted to kill are already dead. Although I am far from your equal, the me of today fears no one.”<br/><br/>Fang Wang felt strong self-confidence emanating from him.<br/><br/>No wonder this lad dared to be the first to venture into Kunlun.<br/><br/>Fang Wang turned to Fang Hanyu and said with a smile, “It seems like the Fang Family trio might need to become a quartet.”<br/><br/>Fang Hanyu responded helplessly, “I can’t compare to you two. My opportunities have been large enough, but the gap with you is still widening.”<br/><br/>“Can’t compare to me, isn’t that normal? Have you forgotten? As children, in what things could you best me?” Fang Wang said with a triumphant tone, to which Fang Zigeng and Fang Hanyu responded with a smile instead.<br/><br/>They were not fools and understood Fang Wang deliberately said this to loosen them up a bit.<br/><br/>They admitted that they couldn’t face Fang Wang with the same attitude as before because he was simply too strong.<br/><br/>Even Fang Zigeng, who had defeated Ji Rutian, after experiencing the Eighteen Layers of Abi Hell, couldn’t help but feel awe towards Fang Wang.<br/><br/>“Pssh, just wait, I will catch up to you with the Sword Dao. When the time comes, I’ll challenge you, let the descendants of the Fang Family see who is the strongest,” Fang Hanyu said, rolling his eyes in exasperation.<br/><br/>Fang Wang followed up with a taunt, and the two began to bicker, just like they did when they were little.<br/><br/>Fang Zigeng stood aside, quietly watching them, his face shining with a more brilliant smile than usual, looking like a completely different person.<br/><br/>After chatting for a while.<br/><br/>Fang Hanyu asked curiously, “What are your plans for the future? You’re not going to disappear again, are you?”<br/><br/>Although he didn’t ask why Fang Wang had disappeared, he knew it had something to do with Fang Wang’s cultivation.<br/><br/>“I won’t disappear for the next few hundred years. I will be here in Kunlun, welcoming an unprecedentedly prosperous era,” Fang Wang said, looking towards the distant Kunlun.<br/><br/>He had collected enough supreme teachings and could spend some time delving into them, after all, no matter how many supreme teachings one gathers, one needs time to let them settle.\t\t\t\t\t\t</div>", "images": {}, "success": true}