{"id": 413, "url": "https://www.novelhall.com/i-became-an-immortal-on-mortal-realm-32879/15011327.html", "title": "Chapter 403 - Chapter 403: Chapter 400: Challenging The Heavenly Dao!", "volume": 5, "volume_title": "Volume 5", "body": "<h1>Chapter 403 - Chapter 403: Chapter 400: Challenging The Heavenly Dao!</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 403: Chapter 400: Challenging the Heavenly Dao!<br/><br/>Fang Wang’s domineering shout brought silence to the surroundings of Kunlun, while across the entire Descending Dragon Continent, skies echoed with thunderous cheers. To the people of Descending Dragon Continent, Fang Wang was not just a legend, but also their pride.<br/><br/>Ever since Fang Wang emerged and became renowned throughout the world, the status of Descending Dragon Continent in the Mortal Realm had risen, attracting more and more Cultivation Sects and bringing with it an overwhelming Fate.<br/><br/>In the years of Fang Wang’s absence, although Descending Dragon Continent had not encountered any calamity, there were always rumors circulating that Heavenly Dao might have perished somewhere, otherwise it would have shown itself after so many years.<br/><br/>All beings of Descending Dragon Continent hoped that Heavenly Dao was still alive, leading them to the pinnacle of the Mortal Realm. Now, hearing of the return of Heavenly Dao, how could they not be exhilarated?<br/><br/>Dozens of dynasties, thousands of Cultivation Sects, and vast numbers of families like grains of sand in the sea all erupted into earth-shattering cheers, and some even wept with joy.<br/><br/>Cultivators who had survived the calamity of Heaven’s Larceny Saint Sect were grateful to Heavenly Dao.<br/><br/>Fang Wang stood atop the Dao Origin Spiritual Jade, facing the wind, quietly waiting.<br/><br/>However, no one dared to set foot into Kunlun.<br/><br/>The main reason was the Heavenly Stem Venerates as a reference. To subdue eight Celestial Qiankuns, how terrifying must Heavenly Dao’s strength be?<br/><br/>All the factions fell into silence, not daring to make rash moves.<br/><br/>Even though they couldn’t feel Fang Wang’s aura, it actually increased the pressure on them.<br/><br/>At that moment.<br/><br/>Fang Wang’s gaze turned in a certain direction. He saw Fang Zigeng approaching swiftly, followed closely by Fang Hanyu.<br/><br/>There were many Great Cultivators around Kunlun. No matter how vast Kunlun was, it couldn’t escape the sensory range of their divine consciousness. When someone took the lead, and not just one person, the other Great Cultivators could no longer restrain themselves and flew towards the interior of Kunlun.<br/><br/>But as soon as they flew into Kunlun, they instantly froze in the air, each with a vacant expression in their eyes.<br/><br/>The Heavenly Stem Venerates guarding various directions of Kunlun witnessed this scene and seemed to think of something. A look of amusement appeared on their faces.<br/><br/>The Eighteen Layers of Abi Hell!<br/><br/>Every Cultivator who dared to rush into Kunlun was fixed in the air, looking as if their souls had been stolen, their eyes dull and their bodies trembling uncontrollably.<br/><br/>Five!<br/><br/>Ten!<br/><br/>Twenty!<br/><br/>The number kept increasing, all frozen at the edge of Kunlun’s territory in the high skies, while the Wangdao Cultivators on Kunlun Mountain looked up in surprise, not understanding what had happened.<br/><br/>Fang Zigeng and Fang Hanyu felt the numerous presences suddenly stop behind them. Instinctively, they turned their heads to look and saw a figure with a potent aura suspended above the clouds.<br/><br/>The two furrowed their brows. They could feel that the person’s cultivation was far stronger than their own. Why would such a powerful Cultivator stop?<br/><br/>They sensed it was not just one person who had stopped; this indicated that it wasn’t due to fear, but rather some Mysterious Power was suppressing those people.<br/><br/>“Would you like to experience it too?”<br/><br/>Fang Wang’s voice suddenly drifted over, drawing Fang Zigeng and Fang Hanyu to turn their heads to look.<br/><br/>From afar, they saw Fang Wang standing on the Dao Origin Spiritual Jade, appearing as if he stood at the pinnacle of the Mortal Realm. His smile seemed supremely contemptuous.<br/><br/>Fang Zigeng immediately took a step forward to show his determination.<br/><br/>As he took the step, his eyes suddenly widened. His view of the world changed drastically, and he found himself in a dimly lit hell, his body bound by chains imbued with Mysterious Power, rendering him immobile.<br/><br/>Instinctively, he looked up to see a terrifying demon god hovering over his head, crouching in the air, leaning forward to look down at him with a face covered in blood, revealing chilling white bones and eyes filled with blood vessels.<br/><br/>Fang Zigeng couldn’t help but be moved, and fear uncontrollably began to bloom in his heart.<br/><br/>It wasn’t just him; Fang Hanyu felt the same way, both of them pulled into the Eighteen Layers of Abi Hell without any defense.<br/><br/>Fang Wang watched as the two men fell into the trap, the corners of his mouth lifting. He had intentionally baited his two clan brothers to set the pace. Now that others were hooked, he couldn’t go easy on them.<br/><br/>At least for today, no one would reach him!<br/><br/>“Are they the only ones with the courage? You dare to vie for the Spiritual Power Jade, yet you don’t dare to face the Heavenly Dao?”<br/><br/>Fang Wang’s voice rang out once more, echoing between heaven and earth.<br/><br/>As soon as these words were uttered, dozens of True Soul Realm cultivators charged over. In the past, the True Soul Realm was legendary in the Eastern Mortal Realm, yet now so many appeared all at once, showing the great changes in the Mortal Realm.<br/><br/>These True Soul Realm cultivators, too, were fixed in the air as soon as they approached Kunlun.<br/><br/>This spectacle spurred various forces into action, and more and more cultivators began to rush towards Kunlun, some for relatives and close friends, others because they sensed no murderous intent from the Heavenly Dao and wanted to test what secrets Kunlun really held.<br/><br/>“Regardless of realm, anyone who wants to try, come on. This time, I won’t unleash a killing calamity, but from tomorrow on, whoever dares to force their way into Kunlun shall die!”<br/><br/>Fang Wang’s voice utterly ignited the fighting spirit of the cultivators from all sides. Countless cultivators and demons soared into the air, charging towards Kunlun like a rain of arrows, grand and spectacular.<br/><br/>Hong Xian’er also took interest, rushing towards Kunlun.<br/><br/>The moment she moved, tens of thousands from within Sword Heaven Marsh burst forth, all eager to test the Heavenly Dao’s Divine Skills.<br/><br/>Since the Heavenly Dao said he wouldn’t kill them, they had to attempt it once. It would be a topic of conversation in the future — they had tested the Heavenly Dao’s Divine Skills.<br/><br/>The smiles on the faces of the Heavenly Stem Venerates gradually solidified. As more and more cultivators and demons were fixed in the air, they grew fearful of Fang Wang’s Mysterious Power.<br/><br/>Launching illusions and Divine Skills against a single individual was powerful, but at least there was a way to break them.<br/><br/>But as these many cultivators and demons fell victim, they couldn’t fathom how Fang Wang achieved it.<br/><br/>Among them were even several Celestial Qiankun!<br/><br/>These Celestial Qiankun were no weaker than they were, previously unnoticed existences. Their sudden emergence shocked them, but in the next second, like everyone else, these Celestial Qiankun were fixed in the air, unable to move forward.<br/><br/>Did that mean Fang Wang could suppress them, the Heavenly Stem Venerates, directly with the Eighteen Layers of Abi Hell?<br/><br/>Fang Wang stood atop the Spiritual Power Jade, deploying the Eighteen Layers of Abi Hell in such a manner that not only drained his Spiritual Power but also tested his soul strength.<br/><br/>But when the number of those ensnared surpassed a hundred thousand, he began to feel the strain, as he had to individualize his focus on each victim to prevent accidentally killing them.<br/><br/>Suddenly.<br/><br/>Fang Wang seemed to feel something and looked down.<br/><br/>Within the Spiritual Power Jade, a mysterious figure appeared, reaching out to grab Fang Wang.<br/><br/>Hong Chen, Dugu Wenhun, Zhu Rulai, and others immediately focused on the Spiritual Power Jade. Hong Chen narrowed his eyes, seemingly discerning something.<br/><br/>However, just as the mysterious figure took flight, his palm less than half a meter away from Fang Wang’s feet, he was fixed in place, as if encased in ice for ten thousand years, his posture enough to chill one’s heart.<br/><br/>Fang Wang’s mouth curled upward again, and he lifted his eyes to look into the distance.<br/><br/>He sensed a familiar aura.<br/><br/>An old adversary!<br/><br/>Truth be told, Fang Wang had almost forgotten this person’s existence, but now that he thought about it, if the other could resurrect once, he could do it a second time.\t\t\t\t\t\t</div>", "images": {}, "success": true}