{"id": 411, "url": "https://www.novelhall.com/i-became-an-immortal-on-mortal-realm-32879/15008023.html", "title": "Chapter 401 - Chapter 401: Chapter 398 Declaration Of War Against The World", "volume": 5, "volume_title": "Volume 5", "body": "<h1>Chapter 401 - Chapter 401: Chapter 398 Declaration Of War Against The World</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 401: Chapter 398 Declaration of War Against the World<br/><br/>Within the mountain wilderness inn.<br/><br/>Gusts of strong wind blew intermittently, but the inn was protected by an invisible force, squeezing the windstorm away as it reached the hillside, preventing it from affecting the inn.<br/><br/>The innkeeper, the waiter, and the chefs all stood at the windowsill, staring dumbfounded into the distance. They dared to open an inn in the wilderness because they had confidence, and with their vision, they could see that the cultivators outside were no ordinary individuals. This made them curious about the battle in Kunlun, yet wary of Fang Wang and others causing trouble.<br/><br/>“Ye Xunhuan has met his match again,” Qing Daoren said with a chuckling smile. “Could it be that he’ll take a tumble this time?”<br/><br/>The other Heavenly Stem Venerates also laughed; they all understood Ye Xunhuan’s intentions, always eager to prove himself to Fang Wang. For the past year in the Western Mortal Realm, it had been mainly Ye Xunhuan taking the initiative, forcing various sects to exchange their secret techniques, and he had never met an adversary.<br/><br/>Ye Xunhuan always felt it was lackluster because the opponents were too weak. He needed a true powerhouse to prove himself, or a situation like Wangdao’s current predicament, where he wanted to suppress everything with his own strength and establish tremendous achievements.<br/><br/>“Not necessarily, that person is not his match,” Han Yu spoke up.<br/><br/>Among the Heavenly Stem Venerates, he and Ye Xunhuan were the strongest. But as to who was stronger, that had yet to be determined. Han Yu was more reserved and not as boisterous as Ye Xunhuan.<br/><br/>Fang Wang swirled his wine glass without speaking. Xiao Zi lay on his shoulder, imagining the scenario of Ye Xunhuan’s defeat. The others couldn’t help but chuckle, finding the thought of Ye Xunhuan losing more amusing than him winning.<br/><br/>They enjoyed watching Ye Xunhuan being humbled.<br/><br/>“There are quite a few masters around.”<br/><br/>Fang Wang thought to himself that aside from the three visible Celestial Qiankun, there were several even more formidable Celestial Qiankun lying in wait in the shadows. Moreover, a power far exceeding the Celestial Qiankun was rapidly approaching this realm.<br/><br/>Indeed, from beyond Xuanzu’s World!<br/><br/>As Wangdao faced tribulations, a force significantly stronger than Celestial Qiankun was quickly nearing, and Fang Wang did not believe it was a coincidence.<br/><br/>Quite interesting.<br/><br/>Fang Wang was not afraid; Immortals Divine could not descend to the mortal plane at the moment, so that force might be a Great Saint from another Mortal Realm.<br/><br/>He now had no fear of the Great Saints.<br/><br/>After the great battle between Ye Xunhuan and Golden Light Dragon Venerable erupted, the Ascension Formation of Kunlun activated. Not only the Ascension Formation, but countless Wangdao Cultivators also took positions in formation around Kunlun to prevent the battle from affecting Kunlun’s Ascension Formation.<br/><br/>Jiang Shenming and his opponent had already fought to the edge of the continent, and although only Ye Xunhuan and Golden Light Dragon Venerable were fighting near Kunlun, the momentum was even more formidable than that of thousands of troops.<br/><br/>The Golden Light Dragon Venerable shone with golden light enveloping his body, with vitality swirling within and golden draconic auras circling around him.<br/><br/>He moved incredibly fast, like thunder, constantly attacking Ye Xunhuan. Whenever Ye Xunhuan repelled him, he would immediately pounce back, making it impossible to guard against. The sky burst forth with intense light continually, as if the firmament was exploding in succession, creating windstorms that caused the southern seas to surge with terrifying waves.<br/><br/>More and more sects began to stir, and Ye Xunhuan’s momentum indeed intimidated them, but seeing Ye Xunhuan constrained gave them hope.<br/><br/>If they could seize the Dao Origin Jade amidst the chaos, their doctrines and families could turn the tables!<br/><br/>Boom, boom, boom—<br/><br/>Thunder roared, and lightning intertwined above Kunlun Mountain, as if a tempest was arriving.<br/><br/>Hong Chen’s Dao Robe rustled in the wind as he tilted his head upward, his expression calm.<br/><br/>The incessant flashes of lightning in the sky were getting closer to the silk ribbon above the Dao Origin Jade and could strike it at any moment.<br/><br/>“Unveil the stele!”<br/><br/>Hong Chen shouted loudly, and as his voice fell, Dugu Wenhun immediately ripped off the silk, revealing the Spiritual Artifact. Under the dim firmament, it burst into dazzling brilliance, turning day into night.<br/><br/>In an instant, all the Wangdao Cultivators felt a certain connection to Kunlun. Pale white light emerged on their bodies, within which myriad tiny specks of light floated, soaring towards the peak of Kunlun Mountain. Soon, the whole of Kunlun seemed to be covered by a starry sea, stunning even the creatures at the base of the mountain.<br/><br/>“What is that?”<br/><br/>“Such immense fate, there is a great one from Wangdao gathering fate.”<br/><br/>“What exactly is fate?”<br/><br/>“Legend has it that the Xuan Zong of Wangdao is the reincarnation of a Great Saint? It is said he possesses endless legacies of the Dao.”<br/><br/>“With such substantial fate… if one could join the sect, cultivation would surely be twice as effective with half the effort.”<br/><br/>No one knew how many cultivators were astonished by the fate of Wangdao. Fate is mysterious, and in the face of such majestic fate, everyone felt an enigmatic urge to join the Dao, as if merging with it would turn them into immortals.<br/><br/>With a bang!<br/><br/>The vast starry sea dispersed, and a figure forcefully charged to the peak, rushing towards the Spiritual Artifact, before the Wangdao Cultivators could even react.<br/><br/>Several tree beings beside Hong Chen immediately went on the offensive, but the newcomer brandished his sword and annihilated them. He stepped before the Spiritual Artifact, reaching out with his left hand to touch it.<br/><br/>Almost instantly, a figure appeared out of thin air in front of him, kicking him hundreds of miles away, tearing apart the sea of clouds in the sky.<br/><br/>He stabilized his position on the horizon and looked intently to see another figure appear before the Spiritual Artifact.<br/><br/>It was Han Yu!<br/><br/>Han Yu rolled up his sleeve with his right hand and stood sideways, his indifferent gaze facing the mysterious cultivator in the distance.<br/><br/>“Here stands Han Yu, one of the Thirty-Six Tian Gang Dao Venerate of Wangdao, under the mighty Celestial Qiankun, if anyone dares to act recklessly, I shall ensure that their entire lineage is eradicated. If the Celestial Qiankun emboldens you to strike, I will ensure your path leads to naught!”<br/><br/>Han Yu’s voice echoed between heaven and earth, a powerful aura no less significant than Ye Xunhuan’s enveloping the Descending Dragon Continent, causing the complexions of countless cultivators to drastically change.<br/><br/>The Wangdao side was ecstatic, especially Sword Heaven Marsh, who erupted into an uproar, exclaiming that Wangdao was unparalleled.<br/><br/>Before the cultivators with malicious intent had time to react, another wave of formidable auras descended:<br/><br/>“Here is Wei Buyu of the Thirty-Six Tian Gang Dao Venerate of Wangdao! Those without the Qiankun cultivation, do not come seeking death!”<br/><br/>“Here is Long Changsheng of the Thirty-Six Tian Gang Dao Venerate of Wangdao! Hahaha, a fellow of the Celestial Qiankun!”<br/><br/>“Here is the Sea Venerable of the Thirty-Six Tian Gang Dao Venerate of Wangdao! Intruders shall perish!”<br/><br/>“Here is Chang Sikong of the Thirty-Six Tian Gang Dao Venerate of Wangdao! Unless you are a Great Saint, it would be best to keep quiet!”<br/><br/>The voices resonated one after another, extremely domineering. It wasn’t just the Descending Dragon Continent; surrounding seas could hear their deafening shouts, as if declaring war on the entire world.<br/><br/>Hong Xian’er stood by the lakeside, her face revealing shock.<br/><br/>“Heavenly Stem Venerate? Where did they come from? Did my brother find them?” Fang Ling called out excitedly; no one could answer her. The emergence of the Thirty-Six Tian Gang Dao Venerate not only deterred other factions but also shocked all of Wangdao.<br/><br/>In the distance, Gu Tianxiong laughed excitedly, “Hahaha, I knew my brother Fang Wang would come! Damn, he’s strong, with so many Celestial Qiankun! But, what exactly is Celestial Qiankun?”<br/><br/>The people around were equally stunned; they could see the specific situation atop Kunlun Mountain, but they could see the clouds in the sky there pierced through, columns of light cascading down as if celestial immortals were descending, majestically picturesque.\t\t\t\t\t\t</div>", "images": {}, "success": true}