{"id": 417, "url": "https://www.novelhall.com/i-became-an-immortal-on-mortal-realm-32879/15019318.html", "title": "Chapter 407 - Chapter 407: Chapter 404: Heavenly Dao Myriad Classic Of Laws, What The Thousand Eyes Great Saint Desires", "volume": 5, "volume_title": "Volume 5", "body": "<h1>Chapter 407 - Chapter 407: Chapter 404: Heavenly Dao Myriad Classic Of Laws, What The Thousand Eyes Great Saint Desires</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 407: Chapter 404: Heavenly Dao Myriad Classic of Laws, What the Thousand Eyes Great Saint Desires<br/><br/>Worldly affairs are like the tides of the Canghai, rising and ebbing. The grand meeting at Kunlun caused the name of Wangdao to resound throughout the world, with the Heavenly Stem Venerate making the realm of the Celestial Qiankun known to the Mortal Realm, becoming the goal that beings in the Eastern Mortal Realm and Western Mortal Realm pursued in their cultivation.<br/><br/>Even the most resplendent of reputations will be replaced by new things, it’s only a matter of time.<br/><br/>Thirty years later, the matter of the grand meeting at Kunlun had already passed in the Descending Dragon Continent. Every few years, peerless geniuses would emerge, causing an uproar in the Cultivation World and drawing the attention of the people from all over the world.<br/><br/>Fang Wang devoted himself to the creation of new cultivation methods. In the thirty years, he had integrated five Cultivation Techniques into the Heavenly Dao Infinite Book of Changes, and as a result, he had remained in the Heavenly Palace for forty thousand years.<br/><br/>He bestowed upon the new Cultivation Technique the name, Heavenly Dao Myriad Classic of Laws. From now on, no matter how many Cultivation Techniques he absorbed, they would all be named the Heavenly Dao Myriad Classic of Laws.<br/><br/>This day, at noon, Fang Wang set aside the secret tome in his hand. He stretched lazily and let out a breath.<br/><br/>To be honest, integrating Cultivation Techniques is much more difficult than cultivating to increase one’s Spiritual Power, and also more tedious.<br/><br/>“I cannot blindly integrate them, I still need to find the very best Cultivation Techniques.”<br/><br/>Fang Wang thought to himself. Many Cultivation Techniques have similarities, even overlapping aspects, so there truly is no need to integrate every single one of them, for some it’s enough to understand the general idea.<br/><br/>As he pondered, he gazed out over the surface of the lake.<br/><br/>Not much later,<br/><br/>Song Jinyuan came over and said, “Someone claims to have been entrusted by the Thousand Eyes Great Saint to visit you, shall I let him in?”<br/><br/>“Let him come,”<br/><br/>said Fang Wang. He had stopped what he was doing because he was waiting for the Thousand Eyes Great Saint.<br/><br/>Upon hearing this, Song Jinyuan vanished on the spot.<br/><br/>Soon, Song Jinyuan returned with a man dressed in blue. He took his leave, not wanting to disturb their conversation.<br/><br/>The man in blue looked ordinary, no different from any common cultivator. He took a deep breath as he looked at Fang Wang’s back and said, “I’ve heard that you’re collecting the ultimate arts of the world to create the method of becoming an immortal. I know the whereabouts of the Taixuan Shenxiao Scripture.”<br/><br/>The Taixuan Shenxiao Scripture?<br/><br/>Fang Wang felt like he had heard of this Cultivation Technique somewhere before.<br/><br/>“The Taixuan Shenxiao Scripture was created by a disciple of the Supreme Saint, who almost surpassed the Supreme Saint himself. Unfortunately, he ultimately died within his destined calamity. However, his Taixuan Shenxiao Scripture shaped dozens of Great Saints in the following years, hence it has been acclaimed as the number one Cultivation Technique from ancient times to the present,”<br/><br/>the man in blue explained in an even tone.<br/><br/>Fang Wang stood up, turned around to face him, and asked, “You only know its whereabouts?”<br/><br/>He remembered, the Descending Dragon Great Saint had once mentioned that the number one divine skill of all time was the Taixuan Shenxiao Scripture.<br/><br/>Should he integrate the Taixuan Shenxiao Scripture, it would surely surpass a thousand, even ten thousand ordinary Cultivation Techniques.<br/><br/>The man in blue fell silent for a moment and then said, “I need time, fifty years won’t be enough. That Cultivation Technique is hidden in a forbidden place, guarded by an undying creature.”<br/><br/>“You have one hundred years. If you do bring back the real scripture, I will share with you the Cultivation Technique I create in the future. From then on, we will be allies, united against the Immortal Divine,”<br/><br/>Fang Wang spoke softly. He had to give the Thousand Eyes Great Saint a deadline, or else this deal would equate to letting him off the hook.<br/><br/>The man in blue frowned and fell silent.<br/><br/>Fang Wang was in no rush, turning sideways to continue looking at the lake.<br/><br/>After struggling for a handful of breaths, the man in blue clenched his teeth and said, “Alright, I have another request. If I bring back the Taixuan Shenxiao Scripture, I want to join Wangdao and become part of the Dao Sect!”<br/><br/>Fang Wang did not respond.<br/><br/>The man in blue continued, “I possess the eyes of thousands of Great Saints and Great Emperors and command many unique skills, which can help Wangdao reach even greater heights. If I join the Dao Sect, I will impart my methods to the other members, just like Xuan Zong in the Hong Chen.”<br/><br/>Clearly, he had done his research on Wangdao; this was not a spur-of-the-moment decision.<br/><br/>“Good!”<br/><br/>Fang Wang agreed, and the man in blue immediately showed a smile, then cupped his fists in farewell.<br/><br/>The Thousand Eyes Great Saint as the Dao Sect’s choice?<br/><br/>Interesting!<br/><br/>The Dao Sect must possess the qualifications of a Great Saint or a Great Emperor, and as a true Great Saint, the Thousand Eyes Great Saint indeed qualifies.<br/><br/>However, the prerequisite is still that he brings the Taixuan Shenxiao Scripture.<br/><br/>Across from Sword Heaven Marsh, the Kunlun mountains soared into the clouds. The mountain breeze blew, stirring Fang Wang’s temples, as he quietly pondered his Heavenly Dao Myriad Classic of Laws.<br/><br/>Several hours later, Fang Wang suddenly stepped forward, then disappeared on the wooden bridge.<br/><br/>The next second, he arrived in another Mortal Realm, at a dilapidated temple.<br/><br/>He stood before a bronze Buddha, his gaze fixing on a meditating figure beside it.<br/><br/>Kongdu the True Immortal!<br/><br/>This was one of the Celestial Qiankun that Wei Buyu had introduced to Fang Wang during his travels in the Mortal Realms. He harbored a deep hatred for the Immortal Divine, hoping for the same ideals that Fang Wang had of not ascending.<br/><br/>Later, Fang Wang did not take him back to Xuanzu’s World, but left him in a Mortal Realm, which was Kongdu’s own suggestion. He wanted to help Fang Wang collect more peerless techniques and, by the way, subdue the Celestial Qiankun.<br/><br/>Even for Celestial Qiankun, it is difficult to acquire top-notch peerless techniques in just three years, which is why Kongdu chose to stay behind alone.<br/><br/>The realm that Kongdu stayed in was that of Ye Xunhuan’s, a realm not weaker than Xuanzu’s World. Decades had passed without sight, and Kongdu was healing his injuries.<br/><br/>He had been injured for some time, and if it weren’t for Fang Wang’s sudden divination, sensing his injury, he would have had to rely on himself to endure.<br/><br/>“Who injured you?”<br/><br/>Fang Wang asked, and upon hearing this, Kongdu opened his eyes in shock. When he saw Fang Wang, he immediately relaxed.<br/><br/>Kongdu said helplessly, “I was cursed by a Great Saint. Fortunately, he has fallen, and his strength is greatly reduced. It’s nothing to worry about. A few more decades of recuperation, and I should fully recover.”<br/><br/>He raised his hand and took out a stone tablet from his sleeve, saying, “This is the inheritance of a Great Emperor named the Absolute Emperor. Although I have never heard of his legend, the spirit of that Great Saint held him in great esteem, placing his inheritance in the deepest part of the dojo. It took me more than ten years to obtain it.”<br/><br/>He spoke lightly, but Fang Wang could sense his suffering was not merely from a curse.<br/><br/>The inheritance of the Absolute Emperor?<br/><br/>Fang Wang raised an eyebrow and gestured with his hand, drawing the stone tablet into his grasp.<br/><br/>“Come with me,” Fang Wang said.<br/><br/>Kongdu quickly spoke up, “Dao Master, I’m not in a hurry. I’ve discovered that this Mortal Realm hides a great secret of the Immortal Divine. I still want to continue the investigation, to collect peerless techniques for you. Don’t worry, I won’t die.”<br/><br/>Kongdu was born in one of the Saint Clans. His father ascended to become an Immortal, but somehow offended the Immortal Divine, leading to the clan being cursed by the Immortal Divine with unending calamities, leaving only him alive. Therefore, he bore intense hatred toward the Immortal Divine.<br/><br/>He was keen to investigate anything related to the Immortal Divine.<br/><br/>Hearing this, Fang Wang said no more, placed the stone tablet inside the Dragon Jade Ring, and began to help Kongdu heal his injuries.<br/><br/>His Heavenly Spirit Power was incredibly strong, and when combined with various cultivation techniques, it had a potent healing effect, enabling Kongdu’s wounds to recover rapidly.<br/><br/>A few days later, Fang Wang left, and Kongdu needed a few more years to recuperate. The curse would have to be lifted by himself, but by then he had already regained eighty percent of his strength.<br/><br/>Fang Wang returned to the wooden bridge at Sword Heaven Marsh and sat down. He then took out the stone tablet from the Dragon Jade Ring.<br/><br/>What kind of peerless technique is the inheritance of the Absolute Emperor?\t\t\t\t\t\t</div>", "images": {}, "success": true}