{"id": 414, "url": "https://www.novelhall.com/i-became-an-immortal-on-mortal-realm-32879/15011328.html", "title": "Chapter 404 - Chapter 404: Chapter 401: The Extinction Of The Great Saint!", "volume": 5, "volume_title": "Volume 5", "body": "<h1>Chapter 404 - Chapter 404: Chapter 401: The Extinction Of The Great Saint!</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 404: Chapter 401: The Extinction of the Great Saint!<br/><br/>Following Fang Wang’s gaze, Ji Yutian soared towards Kunlun, following the surge of Cultivators.<br/><br/>Hearing that Fang Wang was not embarking on a killing spree, and that he even had so many Cultivators and Demons accompanying him, the still-hopeful Ji Yutian decided to follow and test Fang Wang’s strength.<br/><br/>At the very least, he wanted to know the gap between himself and Fang Wang!<br/><br/>However, as soon as he set foot within the bounds of the Kunlun region, the world before his eyes suddenly changed.<br/><br/>He was horrified to find himself bound to a stake, wrapped in chains that were exceedingly strong, as an awful heat rose from below, making him instinctively look down.<br/><br/>Below was a gigantic cauldron, over a hundred zhang in diameter, filled with boiling red-hot oil, from which heads kept bobbing up and down.<br/><br/>“Celestial Phenomenon? No…”<br/><br/>Ji Yutian’s expression turned ugly as he struggled forcefully, but he could not break free, nor could he use the power of the Celestial Phenomenon to resist.<br/><br/>He had never felt as powerless as he did now, like an ant trying to shake a tree.<br/><br/>No wonder all those Cultivators and Demons had all stopped; they had all fallen into such a desperate situation.<br/><br/>He looked up and around, but couldn’t see any other creatures, indicating that he was not in the same place as the others.<br/><br/>He could not understand how Fang Wang managed to suppress so many Cultivators at the same time.<br/><br/>Meanwhile.<br/><br/>Reality.<br/><br/>Fang Wang looked at Ji Yutian from afar, a smile curving the corners of his mouth. He did not immediately move against Ji Yutian but looked down at the Dao Source Jade beneath his feet.<br/><br/>The mysterious figure within the Dao Source Jade was that Great Saint who had come from beyond the heavens!<br/><br/>Fang Wang had been curious about how the other traversed the Mortal Realm and had not expected it to be through the Dao Source Jade.<br/><br/>The Dao Source Jade contained mysterious restrictions, and it was these very restrictions that guided the Great Saint into this slice of the Mortal Realm.<br/><br/>Under Fang Wang’s strong suppressive force, the Great Saint was unable to move, completely unable to emerge from the Dao Source Jade.<br/><br/>“Who exactly are you…”<br/><br/>The Great Saint asked Fang Wang through the Sound Transmission Technique, his voice trembling, unable to hide his fear.<br/><br/>His hair disheveled, his face eagle-like, he was not a human Great Saint, but one from the Demon Race, his dual wings making his black cloak bulge as if about to burst. His eagle eyes were fixed on Fang Wang, the fear in his eyes growing more intense.<br/><br/>Fang Wang looked down at him and said softly, “I am the Heavenly Dao of the Mortal Realm, which Immortal Divine sent you here? Doom God?”<br/><br/>He did not use the Sound Transmission Technique for these words, allowing the surrounding Wangdao Cultivators to hear them.<br/><br/>Upon hearing the words “Immortal Divine”, everyone but Hong Chen was visibly moved.<br/><br/>“Do you truly intend to contend with the Immortal Divine? There is more than one Immortal Divine displeased with you. There are also numerous Mortal Realm Great Saints and Great Emperors. The path you walk will make you an enemy in all Three Realms, and they are the inexorable enemies of the Dao!”<br/><br/>The Falcon Demon Great Saint stared at Fang Wang and spoke gravely. This time, he did not use the Sound Transmission Technique.<br/><br/>Fang Wang’s smile grew as he looked down at him and said, “What, even a saint has fears? Are you truly a Great Saint?”<br/><br/>Faced with Fang Wang’s provocation, the Falcon Demon Great Saint fell silent once again.<br/><br/>Suddenly!<br/><br/>Fang Wang reached down with his right hand, forcefully extracted the Falcon Demon Great Saint from the Dao Source Jade, and grabbed his neck in one smooth motion.<br/><br/>Strands of eerie black qi seeped out from his palm. The Falcon Demon Great Saint was bound by an unimaginable force and could not break free. He cried out in terror, “What do you want to do?”<br/><br/>Fang Wang laughed, “I want to see if my Divine Skills can annihilate a Great Saint. It used to be impossible, but perhaps now it’s feasible.”<br/><br/>The Falcon Demon Great Saint’s pupils suddenly contracted, but before he could speak again, black light burst from Fang Wang’s right hand, instantly turning him to ash.<br/><br/>Above Fang Wang’s head appeared the afterimage of the Mie Jue Divine Tome’s scroll, covering most of the firmament with its oppressive and terrifying presence.<br/><br/>Hong Xian’er, who was flying from afar, just happened to see the Divine Record of Annihilation pulled into the Eighteen Layers of Avici Hell.<br/><br/>Looking at the ashes of the Falcon Demon Great Saint, Hong Chen’s face was solemn as he uttered four words, “Divine Record of Annihilation…”<br/><br/>A figure emerged before his eyes, a figure he would never forget for the rest of his life.<br/><br/>Fang Wang had actually cultivated that person’s legacy to such a realm…<br/><br/>A smile then appeared on Hong Chen’s face, his eyes filled with anticipation.<br/><br/>He immediately spoke, “Fate gathers, forging the Heavenly Dao, today’s achievement, the Heavenly Dao rises above the Path of Immortality!”<br/><br/>His voice spread throughout Kunlun, leaving the powers that were still watching in awe.<br/><br/>“My goodness, why have they stopped?”<br/><br/>“With the power of one person, suppressing the Great Cultivators of all sects, truly worthy of the Heavenly Dao.”<br/><br/>“Could there be a realm above the Celestial Qiankun?”<br/><br/>“You should say, could it be that the Heavenly Dao has become a Saint?”<br/><br/>“Very likely, but why is there no disturbance when he becomes a Saint? It’s not like the Primordial Great Saint.”<br/><br/>The forces not from the Descending Dragon Continent were in awe, while those from the Descending Dragon Continent were excited, some even shouting, loudly proclaiming the two words Heavenly Dao.<br/><br/>Fang Wang quietly sensed the fate and karmic ties of the Falcon Demon Great Saint.<br/><br/>He had not only annihilated the demon’s physical body and soul but also all its karma and fate.<br/><br/>This was the first time he had used the Divine Record of Annihilation in such a manner, unsure if he could completely eradicate the Great Saint.<br/><br/>According to his understanding of the Great Perfection, as long as one’s cultivation was sufficient, the Divine Record of Annihilation could indeed annihilate a Great Saint, and one might even say that the tome was born to eradicate Emperor Saints. It’s just that the Falcon Demon Great Saint was not a saint of this world, so he couldn’t completely succeed in his deduction.<br/><br/>Fang Wang pulled his thoughts back, then turned to look in Hong Xian’er’s direction.<br/><br/>Within the Eighteen Layers of Avici Hell, Hong Xian’er was also tied up, unable to move, but she wasn’t subjected to the torments of hell.<br/><br/>Fang Wang appeared before her, pulling back her wandering gaze.<br/><br/>“Is this the Celestial Phenomenon of the Qiankun? Have you reached the Celestial Qiankun Realm?” Hong Xian’er asked, feigning composure, but her tightly clenched hands betrayed her emotions.<br/><br/>Fang Wang laughed and said, “This is just a type of illusionary divine skill, do you want to learn it? I’ll teach you later.”<br/><br/>Seeing his attitude as usual, as if the two had not been apart for years, she snorted, “So it’s not the Celestial Phenomenon, I really thought you advanced so quickly. It’s just like you, always able to fight across realms.”<br/><br/>To Hong Xian’er, Fang Wang, who was in the True Soul Realm, suppressing the Celestial Qiankun seemed normal.<br/><br/>This was the Fang Wang she knew.<br/><br/>“Then you guessed wrong, I indeed have reached the Celestial Qiankun Realm.”<br/><br/>Fang Wang said with a raised eyebrow and a proud smile, causing Hong Xian’er’s smile to freeze.<br/><br/>Meanwhile,<br/><br/>Ji Yutian was suffering through the torture of the Eighteen Layers of Avici Hell, facing the most brutal version. Not long after entering, he was almost unable to endure.<br/><br/>His physical body was torn apart, his head suffering from the pouring of scorching soup; this pain affected not just his body but also tormented his soul.<br/><br/>“Hold on, don’t give up, he’s already got his eyes on you!”<br/><br/>The voice of the Thousand Eyes Great Saint urgently echoed in Ji Yutian’s heart.<br/><br/>“Thousand Eyes Great Saint, long time no see, why not show yourself? After all, you’re just a wisp of soul thought, I can’t kill you.”<br/><br/>Fang Wang’s voice suddenly resounded through the Eighteen Layers of Avici Hell, carrying a hint of Heavenly Might, causing the scorching flames of hell to violently disperse.\t\t\t\t\t\t</div>", "images": {}, "success": true}