{"id": 412, "url": "https://www.novelhall.com/i-became-an-immortal-on-mortal-realm-32879/15008034.html", "title": "Chapter 402 - Chapter 402: Chapter 399: Who Can Come Before Me", "volume": 5, "volume_title": "Volume 5", "body": "<h1>Chapter 402 - Chapter 402: Chapter 399: Who Can Come Before Me</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 402: Chapter 399: Who Can Come Before Me<br/><br/>“`<br/><br/>Red Dust, Dugu Wenhun, Xu Yan, Zhu Rulai, Lü Xianming, The Three Immortals of the Emperor Sea, and many other Wangdao Cultivators looked up to see Wei Buyu and others descending from the sky.<br/><br/>Including Ye Xunhuan who had appeared earlier, there were a total of eight Heavenly Stem Venerates, all with the cultivation of the Celestial Qiankun Realm!<br/><br/>Even Red Dust, who was once the Heaven Emperor of the Immortal Court, felt a shock to the heart. Where on earth did Fang Wang find so many powerhouses?<br/><br/>With Red Dust’s vision, he could tell at a glance that these Heavenly Stem Venerates were not ordinary cultivators of the Celestial Qiankun Realm; they all possessed great Fate.<br/><br/>Wei Buyu looked down at Red Dust and the others, and said with a smile, “Go ahead and arrange your formation. We have been ordered by the Dao Master to protect the Dao. No one will be able to affect you from now on.”<br/><br/>Without needing his word, the other Heavenly Stem Venerates dispersed, flying to the edges of Kunlun in different directions, each guarding it.<br/><br/>The noise filled the heavens and earth, all forces marveling at the profound foundation of Wangdao, especially those millennium teachings, Saint Clans, and Imperial Clans. Standing on high, they were keenly aware of the terror of the Celestial Qiankun, one force possessing eight Celestial Qiankun cultivators—what did that mean?<br/><br/>It meant they were the number one under heaven!<br/><br/>They dared to come because Wangdao, on the surface, only had Fang Wang as a cultivator of the Celestial Qiankun Realm, and moreover, Fang Wang was very young.<br/><br/>Who would have thought that Wangdao would suddenly reveal eight Celestial Qiankun cultivators!<br/><br/>Standing upon a sea of clouds, Ji Yutian frowned deeply, equally frightened by the strength of Wangdao. Those eight Celestial Qiankun Realm cultivators were by no means empty talk; they were all truly of that realm.<br/><br/>He muttered to himself, “This does not bode well, the backup you left me is useless.”<br/><br/>Even as audacious as he was, he dared not face eight Celestial Qiankun Realm cultivators alone!<br/><br/>The most crucial thing was that Dao Master Fang Wang had yet to appear!<br/><br/>If he could subdue eight Celestial Qiankun, how strong must Fang Wang be?<br/><br/>Apart from wariness, Ji Yutian’s heart harbored confusion—most of the great Celestial Qiankun cultivators under heaven, he could name, but he had never heard of these eight.<br/><br/>Elsewhere.<br/><br/>In front of a roadside inn.<br/><br/>Fang Wang stood up, stretching his body.<br/><br/>Ji Rutian couldn’t help asking, “Are you also going to make a move? It feels like they are enough.”<br/><br/>Duan Tian, however, looked expectantly at Fang Wang, eager to see him in action more than the Heavenly Stem Venerates.<br/><br/>The scene of him waving his hand and annihilating everything still burned in his mind, indelible.<br/><br/>“In an occasion like this, how can I not show up?” Fang Wang said cheerfully.<br/><br/>As his words fell, he vanished into thin air, leaving Xiao Zi, Ji Rutian, and Duan Tian still sitting at the table.<br/><br/>“Let’s go, if we’re late, we’ll miss the fun,” Xiao Zi said excitedly. Then it leapt up, transforming into a hundred-meter-long dragon body and soared away.<br/><br/>Everyone inside the inn was stunned, one of them said with a trembling voice, “A dragon… a True Dragon…”<br/><br/>Ji Rutian stood up, placed a bottle of Spirit Pills on the table, and then hurried with Duan Tian towards Kunlun.<br/><br/>At that moment.<br/><br/>The Ascension Formation had already been activated. The vast Fate of the Wangdao Cultivators surged towards the Dao Source Spirit Jade, not just Fate, but also the Earth Spirit Qi of Kunlun, gathering around the Dao Source Spirit Jade and forming a strong whirlwind.<br/><br/>Han Yu stood before the Dao Source Spirit Jade, turning his head to look, frowning slightly at the sight.<br/><br/>He could feel an extremely vast power contained within the Dao Source Spirit Jade, a power he had never seen before.<br/><br/>Suddenly!<br/><br/>A sound of steps came from above, startling Han Yu into looking up, and then, he exhaled a sigh of relief.<br/><br/>“`<br/><br/>“`<br/><br/>Fang Wang, clad in black, stood at the peak of the Dao origin spirit jade, the vast spiritual energy tugging his robes upwards, the bright light shining on his face, making him look like a deity descending to the mortal world.<br/><br/>“Dao Master!”<br/><br/>Dugu Wenhun called out in surprise and joy, others quickly turned their heads to look, and even those Wangdao Cultivators who were forming arrays turned their heads to look in the direction of the Dao origin spirit jade.<br/><br/>The vast majority of the Wangdao Cultivators had never seen the Dao Master with their own eyes, but they had joined Wangdao mostly because of Fang Wang, so they had always been looking forward to witnessing his elegance.<br/><br/>Fang Wang, standing atop the Dao origin spirit jade, had an ethereal presence that didn’t make one feel oppressed, but anyone who saw him amidst the fierce winds couldn’t shift their gaze away.<br/><br/>A mysterious aura that was indescribable and elusive emanated from within him.<br/><br/>This feeling was not like facing a cultivator, but rather facing an unprecedented treasure!<br/><br/>Fang Wang’s lips curled into a smile, showing it to his Dao Sect followers, and he then spoke, “I am the Wangdao Master, and you may all refer to me as Heavenly Dao. The Dao origin spirit jade is indeed a treasure of the mortal realm. Today, whoever desires this opportunity may come face me within the formation. Whoever reaches me, I will bestow upon them the Dao origin spirit jade, and Wangdao will not pursue the matter further!”<br/><br/>His voice echoed between heaven and earth, reverberating over the skies of the Descending Dragon Continent.<br/><br/>At the same time, Fang Wang sent a telepathic message to the Heavenly Stem Venerate, instructing them to let people in, but it was not necessary for outsiders to harm Kunlun.<br/><br/>Whoosh—<br/><br/>Heavenly Dao!<br/><br/>Beings from all directions of Kunlun changed their expressions drastically, and some even exclaimed in shock.<br/><br/>They had long speculated that Heavenly Dao might appear, but there was also a rumor among mortals that Heavenly Dao was trapped somewhere and could not return to Wangdao, so some people came with a glimmer of hope.<br/><br/>Ji Yutian stood above the sea of clouds, his gaze as piercing as torches, looking towards the peak of Kunlun Mountain. Upon hearing Fang Wang’s words, the hand behind his back involuntarily clenched into a fist.<br/><br/>Ye Xunhuan, in the midst of a fierce battle with the Golden Light Dragon Venerable, upon hearing this, a chilling intent burst forth from his eyes, and he said coldly, “Your time to die has come!”<br/><br/>Boom!<br/><br/>His momentum surged violently, swinging the White Jade Ruler in his hand, casting out myriad light and shadow, all in his own image, like a torrent, unstoppable. In the blink of an eye, they engulfed the Golden Light Dragon Venerable, and without using any spells or divine skills, they all moved in close to the Golden Light Dragon Venerable, striking him with the ruler.<br/><br/>The Golden Light Dragon Venerable’s complexion changed dramatically, because each strike from the light and shadow made his blood run a degree colder, his dragon blood temperature was dropping sharply.<br/><br/>He roared and punched out, the golden flame blood-qi condensed into a dragon head larger than a mountain, shooting towards Ye Xunhuan. Almost instantly, he invoked his own Celestial Phenomenon, forcibly dragging Ye Xunhuan into it.<br/><br/>However, in the next second, he felt a domineering force shatter his phenomenon, and immediately after, he was pulled into another phenomenon.<br/><br/>Beside Sword Heaven Marsh.<br/><br/>Fang Ling said excitedly, “My brother’s back!”<br/><br/>Tai Xi Fairy, Gu Li, and Hong Xian’er all showed expressions of pleasant surprise.<br/><br/>Gu Li stared dreamily towards Kunlun, and for some reason, she suddenly remembered her first encounter with Fang Wang. At that time, she could never have imagined that Fang Wang would rise to such heights.<br/><br/>Fang Hanyu and Fang Zigeng stood above a forest, their expressions grave.<br/><br/>Fang Hanyu sighed and said, “Now we’re completely unable to catch up with him.”<br/><br/>Fang Zigeng’s gaze reached out towards Kunlun and spoke softly, “Catching up with him is naturally impossible, but don’t you want to know how far he is from us?”<br/><br/>He soared into the air, flying towards Kunlun.<br/><br/>Fang Hanyu hurriedly followed, asking, “What are you trying to do?”<br/><br/>Fang Zigeng was not a Wangdao Cultivator, so he should not trespass in Kunlun.<br/><br/>“To try and see if I can reach his presence,” said Fang Zigeng without looking back.<br/><br/>“`\t\t\t\t\t\t</div>", "images": {}, "success": true}