{"id": 418, "url": "https://www.novelhall.com/i-became-an-immortal-on-mortal-realm-32879/15019319.html", "title": "Chapter 408 - Chapter 408: Chapter 405: Absolute Darkness Divine Skill Great Perfection, New Power", "volume": 5, "volume_title": "Volume 5", "body": "<h1>Chapter 408 - Chapter 408: Chapter 405: Absolute Darkness Divine Skill Great Perfection, New Power</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 408: Chapter 405: Absolute Darkness Divine Skill Great Perfection, New Power<br/><br/>Fang Wang extended his divine consciousness into the stone tablet, and immediately, he felt a mass of information flood into him.<br/><br/>A cultivation technique!<br/><br/>It was not a Divine Skill!<br/><br/>Fang Wang was pleasantly surprised in his heart, for what he now desired most was a cultivation technique. He wanted to create an entirely new system of cultivation, which required delving into the essence of Spiritual Power and crafting powers that had never before been seen.<br/><br/>Next would be to see whether this cultivation technique was authentic or not.<br/><br/>Fang Wang concentrated on comprehending it.<br/><br/>An hour later, his consciousness arrived within the Heavenly Palace.<br/><br/>This inheritance was genuine, and it did not set up as many obstacles as the Descending Dragon Great Saint had. It could be obtained quite easily.<br/><br/>Of course, receiving it was one thing; whether one could practice it successfully was another matter altogether.<br/><br/>This cultivation technique was called the Absolute Darkness Divine Skill, which took him roughly five hundred years to master.<br/><br/>After mastering it, he always felt that something was amiss.<br/><br/>That was why the journey from the minor achievement to Great Achievement Realm had taken him five thousand years.<br/><br/>Time had stretched out by tenfold!<br/><br/>Upon reaching the Great Achievement Realm, Fang Wang despaired to discover that he could not cultivate any further.<br/><br/>The technique seemed to have no Great Perfection, or perhaps, he had already reached his limit.<br/><br/>Fang Wang had a sudden inspiration and thought of the heavenly and earthly rules he had comprehended. With a thought, various heavenly and earthly rules began to emerge within the Heavenly Palace for him to cultivate.<br/><br/>In the past, he could also wish for heavenly and earthly rules, but with his low realm of cultivation, even if there were heavenly and earthly rules in the Heavenly Palace, he could not sense them.<br/><br/>Surprisingly, the Absolute Darkness Divine Skill cultivated a power not unlike Dao Power, instead of Spiritual Power, a completely new kind of force.<br/><br/>Both the Extinction Divine Force and the Mie Jue Divine Tome produced special powers, yet their essence was still a transformation from Spiritual Power.<br/><br/>Perhaps the Absolute Emperor had already walked further than he had?<br/><br/>This suspicion arose in Fang Wang’s mind, but he didn’t dwell on it, as pondering this was meaningless.<br/><br/>He began to cultivate the Absolute Darkness Divine Skill with the heavenly and earthly rules!<br/><br/>He couldn’t distinguish which specific rules of heaven and earth were in play, but as he used the Absolute Darkness Divine Skill to absorb the power of these rules, the Divine Skill automatically filtered out a type of rule.<br/><br/>Fang Wang quickly became completely immersed in it.<br/><br/>It was not just cultivation but also comprehension and evolution. As he truly grasped the essence of the Absolute Darkness Divine Skill, he gained more inspiration and insight about it.<br/><br/>When Fang Wang had cultivated the Absolute Darkness Divine Skill to Great Perfection, looking back, he realized that since entering the Heavenly Palace, he had already spent twenty-six thousand four hundred years!<br/><br/>Even with his current achievements in cultivation, it took him over twenty-six thousand years to practice this technique, which showed the profoundness of the Absolute Darkness Divine Skill.<br/><br/>Other Great Saints might spend their entire lives and still not be able to practice this technique to Great Completion.<br/><br/>The illusion of the Heavenly Palace shattered, and Fang Wang’s consciousness returned to reality. He opened his eyes and felt the breeze brushing against his face.<br/><br/>A smile then appeared on his face.<br/><br/>The Absolute Darkness Divine Skill was potent and it could help him envision more about his own path.<br/><br/>However…<br/><br/>After this seclusion, he felt some resistance to merging techniques.<br/><br/>Even with the Heavenly Palace, the more than twenty-six thousand years had passed for him in reality.<br/><br/>Fang Wang sighed, and while he reassured himself that he could endure it, since ancient times, how many had truly chosen to bear the tedium of such long years?<br/><br/>“`<br/><br/>Most people do not choose their path, they are pushed along by the passage of time.<br/><br/>Fang Wang stood up, beginning to stretch his body.<br/><br/>With a thought, it didn’t take long before a figure flew over the lake surface, it was Zhao Zhen.<br/><br/>Although the former Emperor of Grand Qi was still a soul body, he already held a high status within Sword Heaven Marsh, because everyone knew of his relationship with Fang Wang.<br/><br/>Zhao Zhen was very nervous upon seeing Fang Wang, for it was the first time Fang Wang had summoned him alone since his return.<br/><br/>“How is it going, merging with the Shariputra?” Fang Wang asked while twisting his waist.<br/><br/>Zhao Zhen respectfully replied, “With the help of Xuan Zong and the Sword Immortal, I have established a connection with the Shariputra, but to fully merge and be reborn, I still need more time.”<br/><br/>Fang Wang smiled and said, “Don’t be nervous, has anything significant happened in the world lately?”<br/><br/>Zhao Zhen, who roamed around Sword Heaven Marsh daily and enjoyed learning about worldly affairs, was summoned by Fang Wang for exactly this reason.<br/><br/>Hearing this, Zhao Zhen thought carefully. Being clever, he didn’t immediately reveal everything he knew. He had to consider which matters were worthy of Fang Wang’s attention.<br/><br/>“Recently, at the intersection between the Eastern and Western Mortal Realms, a demon was born, said to be related to the ancient Demon Race. It can also turn living beings into demons. I feel this could trigger a calamity,” Zhao Zhen said with an air of anticipation.<br/><br/>He was no saint, and rather than dreading the catastrophe, he looked forward to the opportunities it might bring.<br/><br/>Fang Wang asked, “Has any power attempted to exterminate it?”<br/><br/>Zhao Zhen nodded, “Yes, the Taiqing Xuanjiao attempted to eradicate the demon, but less than ten years later, a new demon emerged. Xuan Zong said this is a fated calamity that is destined to happen, and no one can change it prematurely. Interfering too soon will only draw in more karmic ties.”<br/><br/>Fang Wang also did not intend to help the people of the world by eliminating all threats. That he had bestowed upon them his teachings was already an immense kindness.<br/><br/>Afterward, Zhao Zhen mentioned some details, which Fang Wang listened to attentively.<br/><br/>…<br/><br/>In the Western Mortal Realm, the Seventy-Two Immortal Caves.<br/><br/>Inside one of the cave dwellings.<br/><br/>Yang Jun sat opposite Yang Lin’er, excitedly talking about the grand event at Kunlun. Although it had been decades since the event, it was still widely discussed in the Western Mortal Realm, and he, having just returned, couldn’t wait to share his experiences with Yang Lin’er.<br/><br/>Yang Lin’er listened, her expression inevitably revealing surprise.<br/><br/>She had naturally heard about the Wangdao, but those were just legends, far too distant from her.<br/><br/>Listening to stories of the Wangdao Sect Leader, the Heavenly Stem Venerate, and the Dao Master displaying their Divine Skills, Yang Lin’er felt as if she was listening to a thrilling novel.<br/><br/>By the end, Yang Jun said excitedly, “Sister, join Wangdao with me. I now have Wangdao Sword Sect as my mentor, and I can get you into Wangdao!”<br/><br/>Yang Lin’er was somewhat tempted but then shook her head and refused after pondering for a moment.<br/><br/>“My current cultivation progress is quite good, and my understanding of the cultivation technique is deepening. It’s not appropriate for me to go to the Eastern Mortal Realm. Besides, I plan to go out for trial practice soon,” Yang Lin’er said softly.<br/><br/>Yang Jun said helplessly, “What’s so good about that broken cultivation technique anyway? It’s not a matchless Divine Skill. Within Wangdao, it’s easy to obtain superior cultivation techniques.”<br/><br/>Yang Lin’er replied calmly, “You don’t understand.”<br/><br/>She had been practicing the Heavenly Dao Immensity Scripture imparted by Fang Wang. She had once taught it to Yang Jun, but he couldn’t learn it and instead turned to other techniques that were easier to master.<br/><br/>For ten years, she practiced the Heavenly Dao Immensity Scripture daily, gaining deeper insights, and lately, she even derived spells from it, realizing the Heavenly Dao Immensity Scripture was far from simple.<br/><br/>The Heavenly Dao Immensity Scripture had become the foundation of her standing in the Cultivation World, and she even believed she might become a renowned Great Cultivator shaking the world in the future!<br/><br/>“Sister, you don’t understand how powerful Wangdao is. If you had been there, you would definitely feel the same as I do—sooner or later, the Mortal Realm will be under Wangdao’s control, and the Dao Master will eventually rise above the Immortal Divine!” Yang Jun said fervently.<br/><br/>Yang Lin’er asked, “Have you seen the Dao Master?”<br/><br/>“No.”<br/><br/>“…”\t\t\t\t\t\t</div>", "images": {}, "success": true}