{"id": 429, "url": "https://www.novelhall.com/i-became-an-immortal-on-mortal-realm-32879/15032549.html", "title": "Chapter 419 - Chapter 419: Chapter 416: The Name Of Slaying The Immortal", "volume": 5, "volume_title": "Volume 5", "body": "<h1>Chapter 419 - Chapter 419: Chapter 416: The Name Of Slaying The Immortal</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 419: Chapter 416: The Name of Slaying the Immortal<br/><br/>The Grand An Resentment Temple was engulfed in silence, so oppressive that it made the Grand An Qi Yuan tense.<br/><br/>After a long while.<br/><br/>The Great Dark Demon Saint spoke up, asking, “Your Majesty, the Heavenly Dao mentioned that it could provide me with a place to go, do you think I should inquire about it?”<br/><br/>The Ghost Emperor replied, “If it truly said that, you may proceed. After all, there is no enmity between you two at present, and the Heavenly Dao is not a cruel being.”<br/><br/>“Alright!”<br/><br/>The Great Dark Demon Saint responded, seeming to have made a great resolution. He turned around, his back slightly bending.<br/><br/>He walked three steps forward and then disappeared from the hall.<br/><br/>Standing up, the Ghost Emperor left a message as his body turned into Ghost Qi and dissipated:<br/><br/>“I will be away for a while. Secure the temple well. Should anyone step foot into the temple, regardless of their origin or on what pretext, inform me immediately!”<br/><br/>The Grand An Qi Yuan looked at each other, then stepped out from behind the pillars and bowed towards the Ghost Emperor’s stone chair.<br/><br/>…<br/><br/>Above the Firmament, Fang Wang rode Xiao Zi through the heavens.<br/><br/>Five years had passed since he inherited the fate of Grand An, during which he had mentored many children in the rural villages.<br/><br/>Once his mood lifted, he found Xiao Zi, leading them both in search of the Executor Immortal Great Saint’s legacy.<br/><br/>At the moment, Fang Wang held a piece of Purple Jade Stone in his hand. By delving his divine consciousness into it, he could receive soul guidance from the Executor Immortal Great Saint, which would lead him to the Great Saint’s mausoleum.<br/><br/>The remnant soul of the Executor Immortal Great Saint had told Fang Wang that one must reach the Celestial Qiankun Realm to breach his tomb. Now, Fang Wang could squash the Celestial Qiankun with a flick of his hand.<br/><br/>There was a time when the Executioner Immortal Ghost God Sword was Fang Wang’s most trusted combat method, a sword that could grow endlessly stronger by absorbing souls.<br/><br/>Nowadays, Fang Wang rarely summoned the Immortal Divine because he didn’t need to.<br/><br/>“Young Master, why don’t you let me tame that turtle on your shoulder?” Xiao Zi spoke up with a slightly sullen tone.<br/><br/>The moment it saw Fang Wang, its attention was drawn to the Grand An Profound Turtle on his shoulder.<br/><br/>Hearing Xiao Zi’s words, the Grand An Profound Turtle immediately retorted discontentedly, “Though I am a servant of His Majesty, I am not something a mixed-breed dragon like you can command! In the past, even the True Dragons of purest lineage had to pay respects to me, what do you count for?”<br/><br/>Proud words drove Xiao Zi to the edge of madness, but instead of lashing out angrily, it whined petulantly, “Young Master! Look at it!”<br/><br/>With a helpless smile, Fang Wang said, “Xiao Zi is not just my steed. Show some respect from now on, or else…”<br/><br/>He didn’t finish his sentence, yet the Grand An Profound Turtle already felt a terrifying power surging within its body.<br/><br/>It quickly complied, “As you command, Your Majesty!”<br/><br/>Xiao Zi’s dragon eyes instantly curled into two crescent moons, a mischievous and comical sight.<br/><br/>Fang Wang looked ahead, the Executor Immortal Great Saint’s mausoleum was drawing near.<br/><br/>It was a huge island resembling a colossal beast squatting on the sea, the trees on the island deep in color. Despite the clear Celestial Qiankun, the island seemed to be shrouded in night.<br/><br/>Soon, they flew into the island, Xiao Zi shrinking as it settled on Fang Wang’s left shoulder, its dragon eyes glaring at the Grand An Profound Turtle.<br/><br/>The Grand An Profound Turtle paid no attention to it, but raised its head to sniff the air.<br/><br/>“This aura, it must be the Executor Immortal Great Saint,” the Grand An Profound Turtle said.<br/><br/>As they moved forward, Fang Wang asked, “Do you know the Executor Immortal Great Saint?”<br/><br/>All along the way, he had not mentioned the name of the Executor Immortal Great Saint, only suggesting the search for an opportunity.<br/><br/>“I have lived for hundreds of thousands of years, and in order to keep my memories, I liked to meet the strongest beings of the age. The Ghostly Divine Sword of the Executor Immortal Great Saint left a deep impression on me,” reminisced the Grand An Profound Turtle.<br/><br/>It began to recount the rise of the Executor Immortal Great Saint.<br/><br/>From humble beginnings, once one stepped into the path of cultivation, their talent awakened and became unstoppable.<br/><br/>On his path to growth, Fang Wang had defeated countless proud children of heaven and had even slain Immortals that had fallen to the Mortal Realm, thus earning him the title of Executioner Immortal.<br/><br/>Fang Wang had not expected that the Executioner Immortal Great Saint had also executed Immortals.<br/><br/>“Of course, his rise and fall both revolved around executing Immortals. The Immortal he killed had a significant background, which brought about his downfall,” Grand An Profound Turtle sighed.<br/><br/>“I still fondly remember the Immortal wine he once invited me to drink, such a pity.”<br/><br/>While it was still reminiscing, Fang Wang had already arrived at a stone gate, beyond which there was nothing—it was an isolated stone gate, its surface covered with spiderweb-like cracks.<br/><br/>Fang Wang released the Jian Shi from his hand, and it immediately floated forward, landing in the center of the stone gate followed by its shattering into pieces. Then, a burst of intense light erupted, filling the entire stone gate.<br/><br/>Fang Wang was about to step forward when he suddenly sensed something.<br/><br/>He narrowed his eyes and saw a rolling Demonic Qi emerging within the woods, and a figure began to condense from within it.<br/><br/>It was the Great Dark Demon Saint!<br/><br/>Facing Fang Wang’s gaze, the Great Dark Demon Saint spoke., “I apologize, Heavenly Dao, I did not mean to follow you with ill intent, but without certainty, I dare not rashly step into the Descending Dragon Continent. It is a cursed land, at least for me.”<br/><br/>Fang Wang calmly asked, “If that is the case, why did you have the Demon Race migrate towards the Descending Dragon Continent?”<br/><br/>Such a powerful creature could only be the Great Dark Demon Saint from the Underworld!<br/><br/>He was strong, even stronger than the Great Saints Fang Wang had faced before.<br/><br/>“The curse of the Immortal Divine poses no threat to the Demon Race, and as a Great Saint, if I were to step in, I would inevitably leave karmic ties,” the Great Dark Demon Saint explained.<br/><br/>Fang Wang stepped into the blinding light of the stone gate, leaving behind a message., “If that’s the case, then come with me.”<br/><br/>Watching Fang Wang disappear into the stone gate, the Great Dark Demon Saint hesitated for a moment before deciding to follow.<br/><br/>He transformed into a black wind and swept into the stone gate, vanishing from sight.<br/><br/>Meanwhile.<br/><br/>Xiao Zi opened its eyes to a dazzling starry sky, resplendent and magnificent.<br/><br/>Fang Wang stood on the desolate land, with the stone gate behind him, and ahead of him, the terrain was scattered with tombstones of various sizes, densely packed and innumerable.<br/><br/>His gaze was drawn to a distant mountain where an ominous figure stood atop it.<br/><br/>Fang Wang recognized at a glance that it was the Ghostly Divine summoned by the Executioner Immortal Ghost God Sword, bearing a resemblance to the summoner.<br/><br/>That was the silhouette of the Executioner Immortal Great Saint!<br/><br/>At that moment, the Great Dark Demon Saint appeared behind Fang Wang, his gaze also captivated by the scene ahead.<br/><br/>“The aura of a Great Saint…”<br/><br/>The Great Dark Demon Saint murmured to himself, his tone one of surprise and uncertainty, curious as to whose ancestral relics these were.<br/><br/>He had not dared to follow too closely earlier, so he had not heard Grand An Profound Turtle’s words.<br/><br/>Fang Wang spoke., “I have arranged a place for the Demon Race, and you will see it soon. Of course, I will not insist; if you are willing, so much the better, we will advance and retreat together. If you are not, then take the Demon Race elsewhere. The world is vast, and I, Wangdao, cannot yet dictate to the entire world.”<br/><br/>Hearing this, the Great Dark Demon Saint was about to speak when suddenly, the ground shook violently, and the tombstones began to tremble fiercely.<br/><br/>A terrifying pressure enveloped this small Celestial Qiankun!<br/><br/>“It is you, I did not expect you to arrive so quickly!”<br/><br/>The voice of the Executioner Immortal Great Saint echoed, tinged with astonishment.<br/><br/>Fang Wang spoke., “Predecessor, I have come to inherit your Sword Qi and Sword Intent. I wonder if you are still willing to impart them?”\t\t\t\t\t\t</div>", "images": {}, "success": true}