{"id": 423, "url": "https://www.novelhall.com/i-became-an-immortal-on-mortal-realm-32879/15025755.html", "title": "Chapter 413 - Chapter 413: Chapter 410: Heavenly Dao Primary Origin Realm, Heavenly Dao Force!", "volume": 5, "volume_title": "Volume 5", "body": "<h1>Chapter 413 - Chapter 413: Chapter 410: Heavenly Dao Primary Origin Realm, Heavenly Dao Force!</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 413: Chapter 410: Heavenly Dao Primary Origin Realm, Heavenly Dao Force!<br/><br/>Xu Qiuming and Yang Jun, flying through the sky above the Reincarnation Sea, looked up. They saw turbulent thunderclouds churning the skies, with faint thunder rumbling, and an indescribable pressure enveloping all things under heaven.<br/><br/>Yang Jun swallowed and said, “Why does it feel stronger than the Heavenly Might that Xu Chonggua, the predecessor, invoked?”<br/><br/>Xu Qiuming’s eyes were complex as he replied, “Indeed, it is stronger.”<br/><br/>The hand resting on the hilt of his sword couldn’t help but tighten. There were just too many geniuses in the Mortal Realm, with peerless powerhouses emerging one after another. Even he felt the pressure.<br/><br/>He thought his cultivation pace was fast enough, yet he still couldn’t keep up with the changes of the times.<br/><br/>He heard of more and more realms that he never even knew existed, and not to mention the outside world, he found it somewhat strenuous even to catch up with the first-rate levels within Wangdao.<br/><br/>Xu Qiuming took a deep breath, his gaze turning resolute.<br/><br/>This trip to the Void Palace, he was determined to gain something!<br/><br/>This sudden Heavenly Might was not only enveloping the Reincarnation Sea but whether it was the Western Mortal Realm or the Eastern Mortal Realm, everywhere felt its presence.<br/><br/>Countless powers were astonished. Xu Chonggua had just made a grand vow to the creatures of heaven and earth to strive for the Great Saint Dao, and not much time had passed when an even stronger Heavenly Might descended. Who could it be this time?<br/><br/>Elsewhere.<br/><br/>In the Eastern Mortal Realm, on the Descending Dragon Continent, Sword Heaven Marsh.<br/><br/>Countless cultivators and demons looked in the same direction, which was a corner of Sword Heaven Marsh, enveloped by majestic Ling Wu. Those who had been to Sword Heaven Marsh knew that place was a land for heavenly enlightenment.<br/><br/>The Spiritual Energy of the world was rushing crazily into that area of Ling Wu, making all beings in Sword Heaven Marsh realize that the Heavenly Might pervading the world was triggered by the Heavenly Dao.<br/><br/>Hong Chen, Nianxin Daoren, and Dugu Wenhun stood by the lake looking in that direction.<br/><br/>Dugu Wenhun had a smile on his face and said, “This is our Dao Master. How could he be weaker than others? That Xu Chonggua is imitating us, establishing Xu Dao, and even aspires to become a saint. He really doesn’t take Wangdao into his eyes.”<br/><br/>When Xu Dao emerged, he was indeed worried, but fortunately, Fang Wang was strong enough. Even though others were striving for the Great Saint Dao, in the hearts of the Disciples of the Way of Hope, the Dao Master was still the strongest, so Wangdao wasn’t much affected.<br/><br/>Hong Chen stroked his beard and said, “I’m curious what he is doing. He doesn’t seem to be gathering Fate, but rather creating some kind of Cultivation Technique that astonishes heaven and earth, making even ghosts and gods weep.”<br/><br/>Nianxin Daoren tried to predict Fang Wang’s actions, but alas, he couldn’t calculate it.<br/><br/>Within the Ling Wu.<br/><br/>Fang Wang sat cross-legged at the head of a bridge, cultivating the newly developed Heavenly Dao Myriad Classic of Laws.<br/><br/>Ever since the world’s Fate had changed, it had become difficult to cause any disturbances in heaven and earth. Both the Primordial Sect Master and Xu Chonggua had used their saintly breakthroughs to shake the world.<br/><br/>When Fang Wang developed the Heavenly Dao Myriad Classic of Laws, it did not cause any celestial phenomena, but this time, even the world that had undergone transformation feared his Cultivation Technique.<br/><br/>The Heavenly Dao Myriad Classic of Laws, after blending with the Absolute Darkness Divine Skill, had created a completely new power.<br/><br/>For this reason, Fang Wang had spent twenty thousand years within the Heavenly Palace, and on top of the Great Perfection of the Heavenly Dao Myriad Classic of Laws and Great Perfection of the Absolute Darkness Divine Skill, he still needed twenty thousand years to perfect this new Cultivation Technique, demonstrating just how extraordinary this new technique was.<br/><br/>Fang Wang’s robe billowed continuously, and his palms constantly shifted through hand gestures. His aura became increasingly powerful, and his skin’s surface glowed with a faint luster.<br/><br/>Golden auras burst forth from his body, circling around him.<br/><br/>This was his newfound power.<br/><br/>Inside his body, Spiritual Power was rapidly transforming into a new force, and he had already named this power.<br/><br/>Heavenly Dao Force!<br/><br/>As the Heavenly Dao Myriad Classic of Laws was activated, it changed not only the Spiritual Power but also Fang Wang’s physical body, and the Heavenly Gang Supreme Yang Tyrant Body was also transforming.<br/><br/>Immeasurable Pure Bone hidden within his body was working in conjunction with the Heavenly Dao Myriad Classic of Laws, making the transformation of his body extremely rapid.<br/><br/>The Heavenly Might shrouded heaven and earth for a full seven days.<br/><br/>“`<br/><br/>The celestial spectacle of Xu Chonggua lasted only three days and three nights, which couldn’t compare to Fang Wang.<br/><br/>All the people under the heavens were waiting for the one who caused this Heaven and Earth phenomenon to speak out, yet they waited in vain.<br/><br/>As the Heavenly Might began to fade away, Fang Wang’s transformation also started to slow, his Spiritual Power had completely transformed into Heavenly Dao Force, leaving only his flesh, internal organs, and six bowels not yet fully transformed.<br/><br/>About three more days passed.<br/><br/>Fang Wang suddenly looked up, and on his forehead, a golden vertical eye emerged, shooting out a beam of golden light that pierced the sky. Its momentum was great, shaking the heavens and earth.<br/><br/>In Sword Heaven Marsh, Kunlun, and the entire Descending Dragon Continent, countless beings were attracted by this golden light.<br/><br/>Not just the Descending Dragon Continent, but also creatures in both the Eastern Mortal Realm and Western Mortal Realm were drawn to the golden column of light at the edge of the sky. The pillar connected heaven and earth, seeming to split the Firmament asunder, and cleaved the Mortal Realm in two, an extremely magnificent sight.<br/><br/>On a floating island.<br/><br/>Yang Lin’er walked out of her cave dwelling, her face showing surprise as she gazed at the golden column of light at the edge of the sea.<br/><br/>For some reason, as she watched the golden light, she involuntarily circulated the Heavenly Dao Immensity Scripture, and she even felt her Spiritual Power begin to change.<br/><br/>“What’s going on…”<br/><br/>Yang Lin’er’s heart trembled, her eyes complex as she looked toward the horizon.<br/><br/>It wasn’t just her, all beings who cultivated the Heavenly Dao Immensity Scripture shared the same sensation.<br/><br/>In other Mortal Realms, cultivators who couldn’t see the golden light also involuntarily circulated their Cultivation Techniques.<br/><br/>At that moment, they felt as if the Heavenly Dao Immensity Scripture had come to life, and along with it, their cultivation levels began to grow rapidly.<br/><br/>This sensation left them both excited and slightly anxious.<br/><br/>Fang Wang, oblivious to the world outside, concentrated on consolidating his cultivation.<br/><br/>The golden light persisted for an hour before it dissipated as if it had never existed.<br/><br/>He slowly opened his eyes, feeling the surging Heavenly Dao Force within his body, a numb smile spread across his handsome face.<br/><br/>For him, these twenty thousand years of seclusion seemed to merge with his previous seclusion during the cultivation of the Purple Qi Immortal Technique.<br/><br/>Having secluded himself for more than one hundred and ten thousand years was excruciating.<br/><br/>Fortunately, Heaven rewards the diligent, and his gains were immense.<br/><br/>The same strand of Heavenly Dao Force was dozens of times more potent than a strand of his previous Spiritual Power. This was a change in strength, and moreover, Fang Wang’s Heavenly Dao Force was now more vast than his previous Spiritual Power.<br/><br/>It is no exaggeration to say that just by mastering Heavenly Dao Force, his strength underwent a complete and utter transformation.<br/><br/>“Let’s call it the Heavenly Dao Primary Origin Realm.”<br/><br/>Fang Wang murmured to himself. He was no longer at the Celestial Qiankun level, but had entered a different realm, which he called the Heavenly Dao Primary Origin Realm.<br/><br/>To reach the Heavenly Dao Primary Origin Realm, one must first reach the Celestial Qiankun level and then cultivate the Heavenly Dao.<br/><br/>Previously, Celestial Qiankun was the pinnacle for mortals and the starting point for Immortals, where reaching Celestial Qiankun level meant one could choose different paths.<br/><br/>There used to be only becoming a Great Saint, Emperor, or Immortal, but now there was one more path—chasing after the Heavenly Dao!<br/><br/>As Fang Wang’s words faded, a thunderous boom resounded throughout the Mortal Realm! Immediately afterward, a downpour began, astonishingly, a rain of gold, covering every part of the sky across the Mortal Realm with or without seas of clouds.<br/><br/>All beings bathed in the golden rain saw their cultivation levels increase, and in their minds, some understandings arose involuntarily.<br/><br/>Heavenly Dao!<br/><br/>“`\t\t\t\t\t\t</div>", "images": {}, "success": true}