{"id": 420, "url": "https://www.novelhall.com/i-became-an-immortal-on-mortal-realm-32879/15021288.html", "title": "Chapter 410 - Chapter 410: Chapter 407: The Great Perfection Of The Purple Qi Immortal Technique, Ascend To The Heavens!", "volume": 5, "volume_title": "Volume 5", "body": "<h1>Chapter 410 - Chapter 410: Chapter 407: The Great Perfection Of The Purple Qi Immortal Technique, Ascend To The Heavens!</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 410: Chapter 407: The Great Perfection of the Purple Qi Immortal Technique, Ascend to the Heavens!<br/><br/>“`<br/><br/>After Zhou Xue had completely explained the Purple Qi Immortal Technique, without any surprise, Fang Wang’s consciousness entered the Heavenly Palace immediately.<br/><br/>Zhou Xue indeed did not deceive him.<br/><br/>Then the question arose.<br/><br/>How long would he be in closed-door cultivation this time?<br/><br/>Fang Wang took a deep breath and began to practice the Purple Qi Immortal Technique.<br/><br/>The Purple Qi Immortal Technique, unlike the Absolute Darkness Divine Skill, did not require the absorption of the forces of the world’s rules; it too relied on Spiritual Energy for cultivation. However, this Technique was extremely mystical and the cultivation method complex, making it quite strenuous to practice.<br/><br/>Despite its difficulty, at least the direction was clear!<br/><br/>Fang Wang focused on his cultivation, not concerning himself with time.<br/><br/>As the years swiftly passed, the only thing that changed within the Heavenly Palace was the ancient clock.<br/><br/>The time Fang Wang took to master the Purple Qi Immortal Technique far exceeded his expectations; by the time he mastered it, he had spent two thousand years.<br/><br/>Next, he would strive for Great Completion!<br/><br/>Fang Wang’s Spiritual Power had transformed into another kind of power.<br/><br/>Mana!<br/><br/>This was the power of the Immortal Divine!<br/><br/>From minor achievement to Great Completion, Fang Wang cultivated for a full twenty thousand years. His entire being’s Spiritual Power transformed into Mana, and his muscles and bones also converted into the body of an Immortal.<br/><br/>With this Cultivation Technique, Fang Wang could transform from a Mortal into an Immortal!<br/><br/>He was just uncertain about what distinguished an Immortal from the Immortals of the Immortal Court.<br/><br/>Zhou Xue had once mentioned that there were many great powers in The Upper Realm, and the Immortal Court was not the strongest. If so, the so-called Immortal Divine might signify a level of Fate.<br/><br/>As Fang Wang practiced, he speculated.<br/><br/>Having reached this point in his cultivation, Fang Wang’s heart began to tremble.<br/><br/>Up next was the most difficult phase, Great Perfection!<br/><br/>His intuition told him that this closed-door cultivation would set a new record for the longest single duration.<br/><br/>Sigh.<br/><br/>He was already here!<br/><br/>He could only clench his teeth and persevere!<br/><br/>Even with Fang Wang’s profound understanding, practicing the Purple Qi Immortal Technique was exceedingly difficult. By the time he reached the state of Great Completion, he felt this Technique was already perfect. How could it be further transformed?<br/><br/>He pondered quietly, and just like that, nearly ten thousand years passed.<br/><br/>The Heavenly Palace seemed to have lost its function, and Fang Wang was almost at the point of collapse, until one day, he completely forgot the Purple Qi Immortal Technique, and his entire being entered a bizarre state of chaos.<br/><br/>Suddenly, his body began to absorb the nature’s spiritual energy instinctively.<br/><br/>A plethora of Cultivation Techniques burst forth in his empty mind, as he recalled the Purple Qi Immortal Technique afresh.<br/><br/>Unprecedented ideas continuously emerged in his mind, enveloping him in an aura of Purple Qi.<br/><br/>Purple Qi Immortal, what is immortality? A cycle of endless life, independent of external things, the self can generate Purple Qi, which then incites the nature’s spiritual energy, transforming it into more Purple Qi.<br/><br/>And what was the essence of Purple Qi?<br/><br/>Fang Wang fell into a new state of enlightenment, and the ancient clock within the Heavenly Palace began to swing rapidly.<br/><br/>…<br/><br/>Inside the Fang Residence’s Illusionary Realm.<br/><br/>Zhou Xue had just finished explaining the Purple Qi Immortal Technique. As she saw Fang Wang close his eyes, she was about to speak when Fang Wang opened his eyes.<br/><br/>In an instant, she saw a flash of purple light in Fang Wang’s eyes.<br/><br/>That was…<br/><br/>Zhou Xue’s pupils dilated suddenly, as if realizing something, a look of shock appeared in her eyes.<br/><br/>At this moment, Fang Wang’s complexion was somewhat numb, and there was an indescribable air of duskiness about him, a stark contrast to his previous spirited appearance. This change occurred in the blink of an eye, delivering a great shock to Zhou Xue.<br/><br/>“`<br/><br/>In the past, Zhou Xue had also noticed that Fang Wang would undergo some changes after learning a secret technique, and this time it was particularly intense.<br/><br/>She even suspected that Fang Wang had suddenly been possessed!<br/><br/>“Have you mastered it?” Zhou Xue couldn’t help but ask.<br/><br/>Fang Wang saw her and his eyes regained a bit of vitality. He subconsciously wanted to raise his hands, but he held back, forcing a smile and said, “Some insights.”<br/><br/>More than just mastering it!<br/><br/>Damn it, I’ve already cultivated it to Great Perfection. In the Immortal Court, there probably aren’t many Immortal Divine beings who can compare with my achievements in the Purple Qi Immortal Technique.<br/><br/>This time, he had stayed in the Heavenly Palace for a full ninety-seven thousand years!<br/><br/>That’s equivalent to a hundred thousand years!<br/><br/>How many mortals in the Mortal Realm live to be a hundred thousand years old?<br/><br/>The moment he left the Heavenly Palace, Fang Wang felt a strong impulse to vent, but as soon as he saw Zhou Xue, he immediately held back.<br/><br/>Zhou Xue noticed that something was off with him and couldn’t help but raise her hand to touch his face.<br/><br/>As soon as her fingertips touched Fang Wang’s skin, he shuddered all over.<br/><br/>“Don’t be too anxious, be careful not to fall into cultivation deviation. The more profound the cultivation technique, the easier it is to breed Heart Demons,” Zhou Xue said softly.<br/><br/>It was the first time Fang Wang had seen her so gentle, her eyes seemingly filled with emotion.<br/><br/>He was about to speak when Zhou Xue withdrew her hand, gave him a look, and said, “Even if the Immortal Divine beings descend to the mortal world when you have yet to become holy or imperial, you don’t have to worry, you don’t need to shoulder it alone. After all, I have been reborn once. In this life, I have always been plotting. With me here, nobody can kill you.”<br/><br/>Her tone carried pride, which made Fang Wang smile.<br/><br/>“Rather than being protected by you, I prefer to protect you,” Fang Wang said with raised eyebrows.<br/><br/>Zhou Xue smiled, began to step back, and after five steps, she vanished within the Illusionary Realm.<br/><br/>Fang Wang’s consciousness returned to reality, and he stood at the head of the bridge, looking up at the night sky.<br/><br/>Suddenly, he was struck by a bold idea!<br/><br/>He wanted to ascend to the heavens!<br/><br/>Without another word, he stepped forward and leaped towards the heaven, stepping out of Xuanzu’s World in a single bound.<br/><br/>The Lingxiao Divine Sect could indeed ascend to the skies, but previously Fang Wang’s cultivation was too low to break through the barrier between the Upper Realm and the Mortal Realm. Now his cultivation was powerful, and the Lingxiao Divine Sect had evolved into the even stronger Heaven of Carefree Freedom. He wanted to give it a try!<br/><br/>Cultivating the Purple Qi Immortal Technique allowed him to feel the essence of an Immortal, to understand what mana was.<br/><br/>Surrounding Xuanzu’s World was a layer of powerful mana. Fang Wang couldn’t imagine how strong the owner of this mana was, but with his current Heaven of Carefree Freedom, he might be able to break through.<br/><br/>Fang Wang’s right foot was suspended in darkness, unable to find a place to land, but he gritted his teeth and persisted.<br/><br/>About three breaths later, he staggered forward and a bright light burst from the depths of the darkness ahead, enveloping him in an instant.<br/><br/>He abruptly opened his eyes and stepped onto a cliffside, took two more steps forward before steadying himself.<br/><br/>Vast amounts of nature’s spiritual energy surged towards him!<br/><br/>This spiritual energy was richer than any he had encountered in the Mortal Realm, and it was of a higher quality. Just by inhaling once, he felt his cultivation increase slightly.<br/><br/>Could this be…<br/><br/>The Upper Realm?<br/><br/>Fang Wang leaped up, using the Heaven of Carefree Freedom to keep himself in an ethereal state, and began to fly in one direction.<br/><br/>Along the way, he made no attempt to conceal his formidable aura.<br/><br/>The forests on the mountains shook violently as he passed, as if a fierce wind was howling through.<br/><br/>The land stretched on endlessly, and the forests were like vast oceans. Just as Fang Wang progressed, a majestic White Ape suddenly leaped out in front of him, pouncing towards Fang Wang with bared teeth and claws.<br/><br/>So fast!<br/><br/>Fang Wang frowned slightly as the White Ape passed right through his body, leaving the creature stunned. Turning to look at Fang Wang, its eyes were filled with disbelief.<br/><br/>Fang Wang turned around, reached out to grab, and before the White Ape could react, it was instantly reduced to ash.<br/><br/>Because he was feeling rather irritable, he hadn’t held back, resulting in the space around the White Ape imploding into nothingness, creating a dark area that looked like a small tear in the Firmament.\t\t\t\t\t\t</div>", "images": {}, "success": true}