{"id": 421, "url": "https://www.novelhall.com/i-became-an-immortal-on-mortal-realm-32879/15023383.html", "title": "Chapter 411 - Chapter 411: Chapter 408: The Empty Path, The Holy Visage", "volume": 5, "volume_title": "Volume 5", "body": "<h1>Chapter 411 - Chapter 411: Chapter 408: The Empty Path, The Holy Visage</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 411: Chapter 408: The Empty Path, The Holy Visage<br/><br/>After slaying the Mysterious White Ape, Fang Wang continued to move forward.<br/><br/>Although that White Ape didn’t exhibit strong Divine Skills, its speed and momentum were definitely not inferior to the Celestial Qiankun of the Mortal Realm.<br/><br/>Just arrived and already encountered such a powerful creature…<br/><br/>Fang Wang grew even more curious about this realm.<br/><br/>As he proceeded, his unrestrained aura attracted numerous powerful creatures along the way; the majority were frightened into hiding, but there were also quite a few that dared to attack him, no less formidable than the White Ape.<br/><br/>About an hour later.<br/><br/>Fang Wang’s pupils suddenly constricted as a spear tip emerged from his chest. Following closely, a figure clad in Silver Armor passed through his body, the helmet revealing a stern and majestic face.<br/><br/>The Silver Armor man lunged with his spear, swift and fierce, but unfortunately, it had no effect on Fang Wang, who was in an ethereal state.<br/><br/>Immediately turning around, the Silver Armor man furrowed his brows and looked at Fang Wang.<br/><br/>Fang Wang appraised him in return.<br/><br/>The aura of an Immortal Divine!<br/><br/>This man, unlike the previous creatures, possessed a true Immortal Body, and also had a special kind of Fate. This made Fang Wang even more certain that being an Immortal Divine was not about realm, but a position of Fate.<br/><br/>“Defying the superior, not adhering to the laws of heaven, Mortal, from whence do you hail?” the Silver Armor man asked in a deep voice.<br/><br/>To him, Fang Wang’s aura did not seem strong, but he was unable to harm Fang Wang.<br/><br/>Fang Wang questioned in return, “And whence do you hail, Sir?”<br/><br/>“Immortal Court, Celestial General of Mountains and Rivers!” the Silver Armor man replied, raising his right hand. In an instant, the world changed, the ground below disappeared, and he suddenly found himself in the dark universe, with stars twinkling in the distance.<br/><br/>Celestial Phenomenon!<br/><br/>Yet stronger than the Celestial Phenomenon of the Mortal Realm, it felt like a real world, with extremely majestic celestial rules that far surpassed any ordinary world.<br/><br/>Fang Wang asked, “Who is stronger between you and the Doom God?”<br/><br/>“Doom God? Could it be that you are Fang Wang from Xuanzu’s World, one who claims to be of the Heavenly Dao?” the Celestial General of Mountains and Rivers said in a grave voice.<br/><br/>Fang Wang calmly inquired, “And who is Fang Wang?”<br/><br/>The Celestial General of Mountains and Rivers stared intently at Fang Wang. Suddenly, he thrust his spear forward. The spear, like a dragon, unleashed a vast Mana in the form of a silver dragon, overwhelming Fang Wang with an invincible and domineering force.<br/><br/>The next second, the Celestial General of Mountains and Rivers’s face changed, and he immediately retracted his spear. The silver dragon exploded, turning into wisps of silver luminescence and quickly vanishing.<br/><br/>He looked intently but could no longer see Fang Wang’s figure.<br/><br/>He cast his gaze around but could not locate Fang Wang’s aura at all.<br/><br/>“What Divine Skill is this…” the Celestial General of Mountains and Rivers murmured to himself with furrowed brows. He stayed put for a while before retracting this piece of the world.<br/><br/>…<br/><br/>Sword Heaven Marsh.<br/><br/>With a thud,<br/><br/>Fang Wang’s feet landed on the wooden bridge, causing a slight tremor. Transitioning between the Mortal Realm and The Upper Realm was a bit strenuous for him, which is why he didn’t control his force as delicately when he landed.<br/><br/>Back in Xuanzu’s World, Fang Wang finally felt at ease.<br/><br/>He hadn’t expected to attract an Immortal Divine to act against him within an hour of entering The Upper Realm.<br/><br/>The agility of the Celestial General of Mountains and Rivers was indeed fast. Even with his current level of cultivation, he was too late to react. Fortunately, he had been maintaining the state of The Heaven of Carefree Freedom, otherwise, he might have been instantly killed by the Celestial General of Mountains and Rivers.<br/><br/>This also made Fang Wang realize the gap between ordinary Great Saints and Immortal Divines.<br/><br/>It was not just a gap in cultivation but a gap in all aspects.<br/><br/>Fang Wang began to hesitate.<br/><br/>“`<br/><br/>Should I cultivate the Purple Qi Immortal Technique?<br/><br/>By simply running the Qi Gathering Method of the Purple Qi Immortal Technique in reality for one full cycle, he can transform into an Immortal Body. However, having reached the Great Perfection Realm, he found that although this technique was powerful, it had its drawbacks. That is, once mastered, the fate associated with the technique would be linked to a certain kind of fate. He was not clear what that fate was, but even at Great Perfection, the Purple Qi Immortal Technique could not break free from this connection.<br/><br/>Forget it, I won’t practice it!<br/><br/>Although the Purple Qi Immortal Technique would have brought him rapid and significant improvement in strength, he preferred to tread his own path.<br/><br/>While the Immortal Divine beings of the Immortal Court are strong, in Fang Wang’s view, they are not the carefree and unrestrained True Immortals, but rather, powerful puppets constrained by bonds.<br/><br/>What if he integrated the Absolute Darkness Divine Skill and Purple Qi Immortal Technique into the Heavenly Dao Myriad Classic of Laws?<br/><br/>Fang Wang suddenly had an idea, and he immediately sat down cross-legged to begin pondering the fusion of the cultivation techniques.<br/><br/>Before embarking on the cultivation of the Purple Qi Immortal Technique, he had already put in twenty years. After practicing the Great Perfection of Purple Qi Immortal Technique, he finally came to a realization.<br/><br/>He was going to succeed!<br/><br/>And so, time continued to fly by.<br/><br/>On a certain day, eight years later, thunderclouds suddenly swirled in the sky, quickly gathering together.<br/><br/>A tremendous Heavenly Might enveloped the firmament, forcing Fang Wang to open his eyes and look up.<br/><br/>The rumbling thunderclouds were churning more and more violently, without lightning weaving through them, creating an oppressive atmosphere in heaven and earth.<br/><br/>Fang Wang just took one look and then continued his contemplation.<br/><br/>The integration of the Heavenly Dao Myriad Classic of Laws with the Absolute Darkness Divine Skill had reached a critical juncture; he couldn’t wait to succeed in merging them.<br/><br/>The Absolute Darkness Divine Skill would be a key step in creating his new system because it had already generated a new power. As long as he could understand this method, he would be able to create another completely novel force.<br/><br/>The Heavenly Might lasted for three days and three nights until the morning sunlight broke over the peak of Kunlun Mountain, and a sonorous voice resounded throughout the Mortal Realm.<br/><br/>“I am Xu Chonggua. Today, I establish the Dao of the Void. All under heaven may come to the Reincarnation Sea Void Palace to hear the Dao. I am willing to pass on the knowledge I have learned to those who seek the Dao, in order to give back to the world and vie for the Great Saint Dao!”<br/><br/>Fang Wang opened his eyes, surprise apparent in his gaze.<br/><br/>Xu Chonggua!<br/><br/>He seemed to have heard this name before. After calculating, it turns out that hundreds of years ago, this man had already spread the laws of cultivation to all living beings.<br/><br/>Now, he was even emulating Fang Wang by creating a new Dao, and Fang Wang felt that he might indeed be someone with a great righteousness concerning the welfare of all beings.<br/><br/>Xu Chonggua aimed for the Great Saint Dao, and he did not hide it, which was very straightforward.<br/><br/>Fang Wang pondered when he himself would also call out to the entire Mortal Realm.<br/><br/>Meanwhile.<br/><br/>A few miles away.<br/><br/>Hong Chen stood on the pavilion, looking up at the firmament. Behind him stood a young Daoist, his disciple named Nianxin, whom the Wangdao Cultivators liked to call Daoist Nianxin.<br/><br/>“Master, does Xu Chonggua have the potential to become a Great Saint?” Daoist Nianxin asked.<br/><br/>Three days ago, he arrived here with Hong Chen to observe the celestial phenomenon. During this period, Hong Chen also taught him some methods of deduction, which benefited him immensely.<br/><br/>Hong Chen answered, “His Saintly Visage is already formed; it cannot be stopped. It won’t be long now before he becomes a Saint. However…”<br/><br/>“However, what?” Daoist Nianxin asked curiously.<br/><br/>Hong Chen’s eyes were filled with complexity as he said, “The karmic ties and changes in the Mortal Realm happen too quickly; every ten years there is a great shift. Today he may have the visage of a Saint, but tomorrow it may not be so. Of course, his Saintly Visage could also become even more majestic, surpassing all previous Great Saints.”<br/><br/>Daoist Nianxin fell silent. He then asked, “And what about the Dao Master?”<br/><br/>“Your teacher cannot see through the Dao Master. If I could, would I be in his service? What your teacher seeks are the unpredictable changes.” Hong Chen stroked his beard and laughed. Whenever Fang Wang was mentioned, his face involuntarily brightened with a smile.<br/><br/>His confidence in Fang Wang was growing stronger and stronger!<br/><br/>“`\t\t\t\t\t\t</div>", "images": {}, "success": true}