{"id": 426, "url": "https://www.novelhall.com/i-became-an-immortal-on-mortal-realm-32879/15028233.html", "title": "Chapter 416 - Chapter 416: Chapter 413: Have The Great Dark Demon Saint Come To See Me", "volume": 5, "volume_title": "Volume 5", "body": "<h1>Chapter 416 - Chapter 416: Chapter 413: Have The Great Dark Demon Saint Come To See Me</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 416: Chapter 413: Have the Great Dark Demon Saint Come to See Me<br/><br/>Grand Wei, Zhui Tian Secret Realm.<br/><br/>By a lakeside, Descending Dragon Great Saint was seated in meditation. Looking around, souls were seen practicing in all directions, their numbers obscured and vast.<br/><br/>Suddenly.<br/><br/>Descending Dragon Great Saint heard a noise nearby. He glanced over subconsciously, and then his eyes widened in shock.<br/><br/>He saw Fang Wang appear beside him, staring at the lake and smiling, “Master, with such a setup, what exactly are you planning behind my back?”<br/><br/>The expression in Descending Dragon Great Saint’s eyes calmed down as he replied with emotion, “I hadn’t expected you to become so strong that I failed to notice your arrival.”<br/><br/>Fang Wang then sat down and said, “I apologize for interrupting, Master. I hope you won’t blame me.”<br/><br/>“Of course, I won’t blame you. In fact, I also wanted to see you,” Descending Dragon Great Saint said, looking intently at Fang Wang.<br/><br/>Fang Wang didn’t respond but instead asked, “Master, have you felt it? There’s a very strong presence fighting, and that aura seems to be demonic, much more sinister than that of the Demonic Cultivators from the Cultivation World.”<br/><br/>Descending Dragon Great Saint answered, “Hmm, it is indeed Demonic Qi. In my lifetime, I have never encountered such strong Demonic Qi before. Something this unusual occurring right before the ascension encounter is no small matter.”<br/><br/>“Master, would you like to hear my understanding of the Heavenly Dao?”<br/><br/>“Is that possible?”<br/><br/>“Of course, it is.”<br/><br/>Upon finishing his laugh, Fang Wang began to recount the Heavenly Dao Myriad Classic of Laws.<br/><br/>Descending Dragon Great Saint was indeed very interested in the Heavenly Dao Myriad Classic of Laws, so he listened very carefully.<br/><br/>Fang Wang deliberately spoke in a loud voice so that his words echoed throughout the Zhui Tian Secret Realm, allowing all the souls to hear it.<br/><br/>Shortly after, nearly all the souls began to listen intently. Fang Wang’s voice carried an irresistibly attractive quality, and as they heeded his words, a look of excitement gradually appeared on their faces.<br/><br/>A full two hours passed.<br/><br/>Fang Wang stopped speaking and looked at Descending Dragon Great Saint beside him, asking, “Master, what do you think of my understanding of the Heavenly Dao?”<br/><br/>Descending Dragon Great Saint opened his eyes and spoke in a complex tone, “It’s incredible. I am not your equal. Compared with your Heavenly Dao, my Three Great True Cultivations are nothing special.”<br/><br/>Fang Wang smiled and said, “The foundation of Heavenly Dao is your Three Great True Cultivations, Master. Without them, there would be no Heavenly Dao.”<br/><br/>These flattering words were naturally meant to save Descending Dragon Great Saint’s face. The Three Great True Cultivations were just the first Cultivation Techniques that Fang Wang had fused; without them, he could have merged other techniques.<br/><br/>But factually speaking, the Three Great True Cultivations were indeed what Fang Wang had first used, which made it easier for Descending Dragon Great Saint to practice the Heavenly Dao Myriad Classic of Laws compared to others.<br/><br/>Descending Dragon Great Saint took a deep breath, looking at Fang Wang, his mind surging with emotions.<br/><br/>Just then.<br/><br/>Waves arose on the surface of the lake, and a dense fog surged, covering the water’s surface.<br/><br/>Descending Dragon Great Saint looked over, his gaze returning to calm.<br/><br/>Out of the black fog slowly rose a figure, the very same mysterious woman who had faced the Xu Chonggua before.<br/><br/>“I am one of the four generals under the command of the Great Dark Demon Saint, known as Ye Su. I pay my respects to Descending Dragon Great Saint!”<br/><br/>General Ye Su!<br/><br/>Descending Dragon Great Saint spoke impassively, “Great Dark Demon Saint seeks to meddle in the Mortal Realm. Why bother finding me? I am no longer an obstacle for you.”<br/><br/>General Ye Su replied, “Great Saint, the Demon Race has no choice but to come to the Mortal Realm—we need a land to survive. Otherwise, the arrival of the Demon Race in the Mortal Realm will inevitably lead to slaughter, something even the Great Dark Demon Saint cannot suppress.”<br/><br/>Descending Dragon Great Saint scorned, “What? Does the Demon Race intend to survive in this desolate practice ground of mine?”<br/><br/>“No, we wish to survive in the Descending Dragon Continent and hope you can help us persuade the Heavenly Dao, as this continent honors the Heavenly Dao above all.”<br/><br/>General Ye Su answered, his voice carrying a hint of respect.<br/><br/>The Descending Dragon Great Saint let out a cold laugh and said, “If the Heavenly Dao does not permit, does the Demon Race intend to force its way in?”<br/><br/>General Ye Su helplessly said, “Our clan truly has no other choice. In the Underworld, a forbidden existence is about to emerge. When that happens, the entire Underworld will face a catastrophe, and we can only return to the Mortal Realm.”<br/><br/>“A forbidden existence? Is there something that even the Great Dark Demon Saint fears?” the Descending Dragon Great Saint asked with surprise.<br/><br/>Fang Wang also became interested.<br/><br/>He had known before that the invasion of the Demon Race might trigger a catastrophe, but he hadn’t expected there to be an even more terrifying existence behind it.<br/><br/>Were the Demon Race being driven to the Mortal Realm?<br/><br/>General Ye Su answered, “I do not know its name, only that the Great Dark Demon Saint is full of dread for it, an existence whose name must not be uttered in the Underworld.”<br/><br/>Her gaze involuntarily turned towards Fang Wang.<br/><br/>Here, besides Fang Wang, all the other presences were soul bodies, making Fang Wang particularly conspicuous.<br/><br/>General Ye Su had wanted to inquire before but, unable to see through Fang Wang’s cultivation level, she did not dare to offend him.<br/><br/>“May I ask the name of this senior?” General Ye Su’s posture was very low, entirely different from her attitude when she faced Xu Chonggua.<br/><br/>Being able to sit with the Great Saint, this person’s background must certainly be significant.<br/><br/>She even had a bold guess in her heart.<br/><br/>Who on the Descending Dragon Continent could sit with the Great Saint?<br/><br/>“If the Demon Race comes to the Descending Dragon Continent, can you truly ensure a peaceful coexistence with the beings of the land?” Fang Wang asked.<br/><br/>Although the Descending Dragon Great Saint was his master, he had a duty to protect the myriad beings of the Descending Dragon Continent.<br/><br/>Now, the place where his power from worshippers’ incense was most concentrated was the Descending Dragon Continent.<br/><br/>The myriad beings worshipped him, believed in him, and the combined power of their wishes made his cultivation easier, lessening the chances of encountering a Heart Demon and increasing the likelihood of acquiring greater fortune and blessing.<br/><br/>Upon hearing this, General Ye Su became even more certain of her guess, and she hurriedly said, “We will do our utmost to restrain the Demon Race.”<br/><br/>Fang Wang then asked, “Your existence in the Underworld indicates that you are souls. To enter the Mortal Realm, do you need to seize bodies?”<br/><br/>At this, General Ye Su fell silent.<br/><br/>She hesitated for a moment, then said, “What would you ask of us, we will try our best to satisfy.”<br/><br/>A smile appeared on the corner of Fang Wang’s mouth as he said, “Let the Great Dark Demon Saint come to meet me. I can offer you a sanctuary, keeping you away from that mysterious forbidden existence.”<br/><br/>“What sanctuary?” General Ye Su quickly asked.<br/><br/>“Hmm?”<br/><br/>Fang Wang’s eyes turned cold, and a terrifying aura enveloped General Ye Su, causing the surrounding Demonic Qi to halt and even the surface of the lake to fall still.<br/><br/>The Descending Dragon Great Saint looked at Fang Wang in amazement, his eyes filled with disbelief.<br/><br/>He knew Fang Wang was strong, but he never imagined him to be this powerful.<br/><br/>“This is the Heavenly Dao… though not yet a saint, he is stronger than one…” the Descending Dragon Great Saint inwardly marveled.<br/><br/>He calculated the time; there were still over three hundred years until the Immortal ascension opportunity opened up, and Fang Wang still had time to grow.<br/><br/>Could Fang Wang, not yet a thousand years old by then, stand against the formidable enemies that he himself had failed to defeat in his time?<br/><br/>Facing Fang Wang’s aura, General Ye Su felt as if her soul body would scatter; she couldn’t even speak.<br/><br/>“I do not wish to repeat myself.”<br/><br/>Fang Wang said indifferently, then withdrew his aura.<br/><br/>General Ye Su felt as if a heavy burden had been lifted and quickly bowed to Fang Wang, then disappeared into the black fog, vanishing along with the fog as if she had never been to the Zhui Tian Secret Realm.\t\t\t\t\t\t</div>", "images": {}, "success": true}