{"id": 428, "url": "https://www.novelhall.com/i-became-an-immortal-on-mortal-realm-32879/15031287.html", "title": "Chapter 418 - Chapter 418: Chapter 415 An Tian Emperor", "volume": 5, "volume_title": "Volume 5", "body": "<h1>Chapter 418 - Chapter 418: Chapter 415 An Tian Emperor</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 418: Chapter 415 An Tian Emperor<br/><br/>Endless stars spread across the firmament, as if this place was the end of the Mortal Realm, the location closest to heavens.<br/><br/>Above the great earth stood a stone platform, surrounded by hundreds of sitting cultivators, among whom were the Hongxuan Emperor and Shenxin, the reincarnated Buddha’s child from The Upper Realm.<br/><br/>And there was also a figure sitting on the stone platform, strikingly it was Zhou Xue.<br/><br/>She wore a loose red robe and a crown with golden feathers, enchanting and majestic. Her hands kept casting spells, and around her swirled countless demon souls, forming a magnificent black tornado.<br/><br/>Suddenly.<br/><br/>The Hongxuan Emperor seemed to sense something, abruptly lifted his head, and looked toward the edge of the world, his eyes revealing an incredulous expression.<br/><br/>More and more Great Cultivators from the Jin Xiao Sect opened their eyes, all looking in the direction that the Hongxuan Emperor was gazing.<br/><br/>“What boundless fate! How can such immense fate exist in the Mortal Realm?”<br/><br/>“Even when Emperor Donggong was alive, the Grand Yu Divine Dynasty didn’t have such immense fate, right?”<br/><br/>“Could it be a powerful dynasty from the Western Mortal Realm?”<br/><br/>“Not sure, this fate feels very ancient to me.”<br/><br/>“The changes in the Mortal Realm are becoming more and more unpredictable. First, there was someone who created a path to sanctity, then another who pioneered a new route of cultivation, and now, such imposing fate emerges. Is this the era of great contention?”<br/><br/>The Great Cultivators from the Jin Xiao Sect were abuzz with discussion, mostly expressing their astonishment.<br/><br/>The Hongxuan Emperor frowned deeply, pondering something.<br/><br/>Zhou Xue on the stone platform did not open her eyes throughout, seemingly unaffected by the astonishing fate in the distance and oblivious to the exclamations of her subordinates.<br/><br/>…<br/><br/>Celestial clouds and sea formed a vortex in the sky, like black dragons coiling, majestic yet oppressive.<br/><br/>Shrouded in the fate of Grand An, Fang Wang radiated light, exuding a domineering aura that made the ground beneath him tremble slightly and the rivers churn.<br/><br/>Boom—<br/><br/>Thunder roared, echoing through the heavens.<br/><br/>As if condemning the arrival of the Grand An fate.<br/><br/>The Grand An Profound Turtle was staring intently at Fang Wang, its face exhibiting human-like excitement, its small eyes brimming with fervor.<br/><br/>In the distance, figures appeared one after another, including Hong Chen, Dugu Wenhun, Jiang Shenming, the Sword Immortal Xu Yan, and other cultivators from various sects of the Descending Dragon Continent. All of them watched Fang Wang from afar, not daring to approach rashly.<br/><br/>“It seems to be the Dao Master!”<br/><br/>“Indeed, it’s the Dao Master, no wonder he can gather such immense fate.”<br/><br/>“What’s the origin of the fate that Dao Master is absorbing? It’s terrifying!”<br/><br/>“Could it be the effect of cultivating the Heavenly Dao?”<br/><br/>“What’s the origin of that turtle?”<br/><br/>The cultivators from all sides discussed, with varied tones, some marveling, some yearning.<br/><br/>Hong Chen cast a deep glance at Fang Wang, then immediately ordered people to disperse the onlookers to avoid disturbing him.<br/><br/>The transmission of fate continued.<br/><br/>Three hours later, nightfall came.<br/><br/>The fate emanating from the mouth of the Grand An Profound Turtle began to weaken, indicating that the transmission of Grand An fate was nearing its end.<br/><br/>Fang Wang kept his eyes closed, silently sensing.<br/><br/>Another hour passed, and tranquility was restored to the world.<br/><br/>The Grand An Profound Turtle closed its mouth, eagerly anticipating Fang Wang’s reaction.<br/><br/>The rivers returned to their normal state, their waves continuously crashing, the thunderclouds in the sky dispersed, and moonlight poured down, making the river surface glitter with ripples.<br/><br/>Fang Wang stood by the riverbank, his body shining with light, like a deity.<br/><br/>He opened his eyes and felt that the world was completely renewed.<br/><br/>Wrapped in the threads of fate, his perception of the laws of the world became clearer, and he felt as though heaven and earth were in his hands, that all things would comply with him—this feeling was truly wonderful.<br/><br/>It made him think of a saying, “When the time is right, heaven and earth lend their strength.”<br/><br/>“The Grand An Profound Turtle pays its respects to Your Majesty!”<br/><br/>The Grand An Profound Turtle suddenly cried out loudly, and its head then pressed against the muddy sand.<br/><br/>Fang Wang looked down at it and said, “What do you mean?”<br/><br/>“You are the last emperor of the Grand An Divine Dynasty, the An Tian Emperor, and also the father of the Ghost Emperor!”<br/><br/>The Grand An Profound Turtle said respectfully, its tone unable to hide its excitement.<br/><br/>Fang Wang remembered that the Ghost Emperor had mentioned this too, but he had no recollection of being the An Tian Emperor.<br/><br/>The True God of the Heavenly Palace at least came with remnants from being reborn, marking his future fate, but the An Tian Emperor was an ancient existence.<br/><br/>As for his past life, Fang Wang only had memories of Earth.<br/><br/>On Earth, he was quite ordinary and couldn’t compare to the illustrious An Tian Emperor.<br/><br/>“Could it be that only the An Tian Emperor can inherit the fate of Grand An?” Fang Wang asked, furrowing his brow.<br/><br/>The Grand An Profound Turtle raised its head and said, “This old servant isn’t sure, but the Ghost Emperor once said, if you can catch the fate of Grand An, then you are the An Tian Emperor.”<br/><br/>What does that mean?<br/><br/>The Ghost Emperor wants me to be his father?<br/><br/>Fang Wang thought about mocking in his mind, but he held back.<br/><br/>“Indeed, there’s such a saying.”<br/><br/>Hong Chen’s voice drifted over, and seeing him fly in front of Fang Wang, he said, “The royal family of the Grand An Divine Dynasty possessed a unique method of harnessing fate. Perhaps you truly are the reincarnation of the An Tian Emperor, you just don’t have the memories. That being said, the fall of the An Tian Emperor was mysterious in itself. Although he was defeated, he could have escaped. Instead, he chose to end himself, and the fate of the Grand An Divine Dynasty disappeared overnight.”<br/><br/>This explanation made Fang Wang’s frown deepen even more.<br/><br/>Hong Chen showed a smile and said, “Dao Master, you really shouldn’t overthink it. You are you, no matter who you were in a past life. Isn’t this life what’s most important?”<br/><br/>Fang Wang felt that made sense. After all, he now knew that he might have been reborn in the cultivation world eight times already. Perhaps during one of those transmigrations, he became the An Tian Emperor—who can really be sure?<br/><br/>His connection with the Grand An Divine Dynasty was mainly due to seizing the opportunity from Jiu You True Person. Perhaps whoever the fate of Grand An falls upon will become the An Tian Emperor.<br/><br/>“Your Majesty, please take this old servant with you from now on. With the fate of Grand An returning to you, troubles will undoubtedly keep arising, and this old servant might be of some use,” the Grand An Profound Turtle said with a pitiful tone.<br/><br/>Fang Wang nodded slightly, and the Grand An Profound Turtle immediately leapt up and landed on his shoulder.<br/><br/>Hong Chen followed suit, paying his respects to Fang Wang before taking his leave.<br/><br/>Fang Wang did not return to Wangdao. He planned to continue traveling the Mortal Realm, to relax his mind.<br/><br/>Now, it wasn’t just about relaxation, but also about studying the fate of Grand An.<br/><br/>…<br/><br/>Underworld, Grand An Resentment Temple.<br/><br/>Within the great hall, the Grand An Qi Yuan hid behind pillars, their gazes fixed on the dais where a towering figure draped in a black robe stood before the Ghost Emperor.<br/><br/>The towering figure was nearly two zhang tall, with dark brown hair like a majestic lion, and two horns that curved upward. His dignified face exuded an intense aura of oppression, and beneath the robe was thick armor. Wrapped around his waist was a living python.<br/><br/>The Great Dark Demon Saint!<br/><br/>The Ghost Emperor sat on a stone chair, his body pitch-black and wreathed in ghostly qi, obscuring his true appearance, but the figure he revealed was enough to instill fear in those who looked upon him.<br/><br/>In front of the Ghost Emperor, the Great Dark Demon Saint appeared somewhat submissive.<br/><br/>The Ghost Emperor slowly spoke, “If you seek the protection of the Heavenly Dao, you may listen to it. But if you are using it as a pretext and harboring malicious intentions, your journey is doomed to end in disaster. Let me make it clear to you now, the stance of the Heavenly Dao is my stance.”<br/><br/>Upon hearing this, the Great Dark Demon Saint furrowed his brow, not expecting the Ghost Emperor to be so direct.\t\t\t\t\t\t</div>", "images": {}, "success": true}