{"id": 427, "url": "https://www.novelhall.com/i-became-an-immortal-on-mortal-realm-32879/15031286.html", "title": "Chapter 417 - Chapter 417: Chapter 414: Grand An Profound Turtle, Fortunes Descend", "volume": 5, "volume_title": "Volume 5", "body": "<h1>Chapter 417 - Chapter 417: Chapter 414: Grand An Profound Turtle, Fortunes Descend</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 417: Chapter 414: Grand An Profound Turtle, Fortunes Descend<br/><br/>After General Ye Su’s departure, Fang Wang stood up, looked towards the Descending Dragon Great Saint, and smiled, “Master, it’s time for me to go. If there’s ever a need, send word to Kunlun at any time.”<br/><br/>The Descending Dragon Great Saint looked at Fang Wang and said, “You are indeed very strong now, no weaker than me at my peak, but compared to the Immortal Divine, you must not be careless.”<br/><br/>Fang Wang nodded and said, “Don’t worry, Master. Until I’m powerful enough to disregard all Immortal Divine, I will devote myself to diligent cultivation and not waste a moment.”<br/><br/>The Descending Dragon Great Saint smiled, then waved his hand, signaling Fang Wang could leave.<br/><br/>Fang Wang turned to look at the wandering souls in the distance, where he saw his former opponents in the Zhui Tian Secret Realm. At the moment, they were still absorbed in the profound doctrines of the Heavenly Dao Myriad Classic of Laws, oblivious to his gaze.<br/><br/>Fang Wang smiled, took a step forward, and then vanished on the spot.<br/><br/>The Descending Dragon Great Saint turned his gaze back to the lake and said leisurely, “Fate does not rest with me, nor with the saints, nor with the emperors.”<br/><br/>He seemed to think of something, a smile appearing on his face.<br/><br/>Elsewhere, Fang Wang stepped out of the Zhui Tian Secret Realm.<br/><br/>He roamed through the countryside, starting to enjoy the scenery along the way, relaxing his mind.<br/><br/>The Descending Dragon Continent of today had changed, with more and more high-level cultivators emerging. Realms that were unheard of in the seven dynasties’ lands were now commonplace everywhere.<br/><br/>Due to the stir caused by the previous Kunlun assembly, Celestial Qiankun had become the goal sought after by countless cultivators on the Descending Dragon Continent.<br/><br/>In a sense, the level of cultivation in the Descending Dragon Continent had become top-notch among the Mortal Realm, and even in the Western Mortal Realm, many beings had never heard of the Celestial Qiankun.<br/><br/>Fang Wang planned to wander for two years, firstly to relax his Dao heart, and secondly because he felt that good fortune was approaching.<br/><br/>This feeling was strange and strong.<br/><br/>Fang Wang was sure it was not an illusion. Having reached the Heavenly Dao Primary Origin Realm, he could sense the profound Fate, Karmic, and fortunes.<br/><br/>Day turned to night, and days passed.<br/><br/>News that Wangdao Master was about to disseminate the ways of Heavenly Dao cultivation spread quickly, shaking the Descending Dragon Continent.<br/><br/>It also confirmed to countless beings that the mysterious powerful entity causing the celestial phenomenon was indeed the Wangdao Master!<br/><br/>In the blink of an eye.<br/><br/>A year had gone by.<br/><br/>One day, in front of an old, dilapidated temple in the woods, Fang Wang, wearing a Fox Mask, sat on a stone lion.<br/><br/>Three young boys sat in front of him, dressed plainly, with traces of soil on them, looking confused, the youngest even sporting snot bubbles.<br/><br/>“Alright, that’s enough cultivation lessons for today,” Fang Wang said, stretching lazily and speaking in a languid tone.<br/><br/>The eldest boy asked, “But I still don’t understand.”<br/><br/>The other two nodded their heads, chattering incessantly, making the broken temple lively with noise.<br/><br/>Fang Wang said irritably, “If you don’t go back now, your parents will make you kneel and recite with bamboo sticks.”<br/><br/>Upon hearing this, the expressions of the three boys changed dramatically; they quickly scrambled to their feet, each grabbing their own bamboo baskets and running out of the woods.<br/><br/>Fang Wang watched them go with amusement.<br/><br/>He had been to many places, more than a million li from Grand Qi, and situations like the current spread of teachings had happened more than a dozen times.<br/><br/>He disseminated his knowledge as fate allowed without leaving his real name.<br/><br/>After he imparted his teaching, he could see the destinies of those fated people change dramatically, some even becoming renowned in the world.<br/><br/>This feeling of seeing into others’ futures was strange and delightful; no wonder so many powerful beings liked to make predictions and act mysteriously.<br/><br/>However, fate could be changed as well, which made Fang Wang less apprehensive about destiny.<br/><br/>Fang Wang stood up and disappeared into the woods with a single step.<br/><br/>The three boys could not understand the Heavenly Dao Myriad Classic of Laws now, but Fang Wang had used a method that would make them remember it for a lifetime.<br/><br/>Their destinies had also changed. One of them would one day challenge his disciple, Chu Yin, who by then would be the Dao Sect Master.<br/><br/>Upon witnessing such fate, Fang Wang was not disturbed but instead found it amusing.<br/><br/>He arrived at a riverbank, where the mountains on either side rose straight and majestic, the river breeze fluttering his white robe.<br/><br/>Waves constantly swept up onto the riverbank, churning up white foam.<br/><br/>Suddenly, a turtle the size of a palm was washed ashore.<br/><br/>It lay upside down, its four limbs frantically flailing, struggling to turn over, which seemed a monumental task.<br/><br/>Fang Wang walked over and used the tip of his boot to flip it upright.<br/><br/>The turtle extended its neck, seemingly relieved, looked up at Fang Wang and emitted an ancient human voice, “Hey, are you Tiandao Fang Wang?”<br/><br/>Fang Wang looked down at it, silent.<br/><br/>For some reason, the old turtle felt a chill in its heart under his gaze and hurriedly said, “I am the Grand An Profound Turtle, sent by the Ghost Emperor to deliver fate.”<br/><br/>The Grand An Profound Turtle?<br/><br/>Fang Wang sized it up; its cultivation level wasn’t high, nearly insensible to the fluctuations of Spiritual Power if one didn’t pay close attention.<br/><br/>“What if I said I wasn’t?” Fang Wang asked teasingly.<br/><br/>The Grand An Profound Turtle coughed artificially and said, “Alright, I shouldn’t have asked. I do indeed have a way to find you. I did not expect this day to come so soon; I thought you would still need to wait a thousand years before you were qualified to receive the fate of Grand An.”<br/><br/>It looked up at Fang Wang in wonder.<br/><br/>Fang Wang asked, “How many years have you lived?”<br/><br/>“Me? I don’t even remember anymore. When I was born, the Grand An Divine Dynasty was already nearing its downfall. I don’t know how many tens of thousands of years have passed since then. I’ve experienced the mortal world, and many things have been forgotten,” replied the Grand An Profound Turtle, its tone laden with emotion.<br/><br/>Fang Wang could feel a slight connection between the turtle’s fate and his own, perhaps the work of the Ghost Emperor, which allowed the Grand An Profound Turtle to find him.<br/><br/>“Then come on,” Fang Wang said without further ado.<br/><br/>Upon hearing this, the Grand An Profound Turtle opened its mouth wide. With a boom, a torrent of violent waves burst forth, instantly submerging Fang Wang and even dispersing the clouds in the sky.<br/><br/>The forested mountains on both sides of the river swayed in the wind, and the river waves became tumultuous.<br/><br/>Amidst the intense light and wind, Fang Wang’s complexion shifted slightly.<br/><br/>This was the first time he truly felt the substance of fate.<br/><br/>Massive!<br/><br/>Vast!<br/><br/>Immovable!<br/><br/>During the process of receiving the fate of the Grand An Divine Dynasty, he also saw many images.<br/><br/>These were images of the Grand An Divine Dynasty, of the beings who established and changed the destiny of the dynasty, their figures like those in an epic, and even Fang Wang was astounded by them.<br/><br/>The Grand An Profound Turtle, mouth agape, was taken aback as it watched Fang Wang remain steadfast.<br/><br/>“Could it be that what the Ghost Emperor said is true? Is he really a reincarnation of our emperor?”<br/><br/>Thinking this, the Grand An Profound Turtle’s tiny eyes flashed with a sharp light.<br/><br/>As Fang Wang accepted the fate of Grand An, he instinctively circulated the Heavenly Dao Myriad Classic of Laws and began to absorb the power of the celestial rules, causing his Heavenly Dao Force to surge violently.<br/><br/>Rumbling—<br/><br/>The firmament quickly darkened as rolling thunderclouds roared in, the sound of thunder as if ghosts were wailing.<br/><br/>In the distance, at Sword Heaven Marsh, Hong Chen abruptly opened his eyes, his pupils contracting suddenly, murmuring to himself, “It’s him…”<br/><br/>He vanished on the spot.<br/><br/>Even the Descending Dragon Great Saint, who was in the Zhui Tian Secret Realm, opened his eyes in astonishment.\t\t\t\t\t\t</div>", "images": {}, "success": true}