{"id": 422, "url": "https://www.novelhall.com/i-became-an-immortal-on-mortal-realm-32879/15023384.html", "title": "Chapter 412 - Chapter 412: Chapter 409: Great Dark Demon Saint, The Path To The Strongest", "volume": 5, "volume_title": "Volume 5", "body": "<h1>Chapter 412 - Chapter 412: Chapter 409: Great Dark Demon Saint, The Path To The Strongest</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 412: Chapter 409: Great Dark Demon Saint, The Path to the Strongest<br/><br/>As Xu Chonggua’s voice faded, Heavenly Might gradually dissipated, and the name of the Void Dao spread instantly throughout the world, attracting attention from all quarters.<br/><br/>The four words, “Great Saint Dao,” also drew the attention of every corner of the world to the Great Saint.<br/><br/>What defines a golden age? Naturally, it is the coming of a Great Saint!<br/><br/>The Primordial Sect Master, who had become a saint before, had already perished. Could Xu Chonggua become the next Great Saint?<br/><br/>Fang Wang was unaware of the thoughts of the people in the world; he was engrossed in his own cultivation.<br/><br/>Another two years passed by.<br/><br/>One evening, Fang Wang opened his eyes, and his brows were tightly furrowed.<br/><br/>“Should I be stricter with myself?”<br/><br/>Fang Wang murmured to himself, his tone full of conflicted feelings.<br/><br/>After so many years of meditative cultivation, he had finally merged the two Cultivation Techniques. Now, only the final step remained—to clarify the sequence of cultivation.<br/><br/>Once successful, he would re-enter the Heavenly Palace.<br/><br/>For him, who had just finished a retreat of 97,000 years, he had barely caught a breath. The thought of entering into another prolonged retreat made his scalp tingle.<br/><br/>He thought of the elusive Celestial General, and of Xu Chonggua, who was about to become a saint.<br/><br/>Damn it!<br/><br/>I’ll compete with them!<br/><br/>Fang Wang felt he couldn’t slack off. Leaving aside the Upper Realm, even in Xuanzu’s World alone, who knew how many Great Saints or Great Emperors might emerge in the future.<br/><br/>Fang Wang immediately closed his eyes, ready to enter the Heavenly Palace.<br/><br/>…<br/><br/>In the dimly-lit tunnel, Ji Rutian and Yang Du walked one after the other. They were not wearing the Wangdao’s white robes but were dressed in tight-fitting black clothes. The one in front, Ji Rutian, carried an oil lamp, casting the shadows of both men upon the cave walls, trembling incessantly.<br/><br/>Yang Du broke the silence, asking, “Is a Great Saint’s legacy really hidden here?”<br/><br/>Ji Rutian kept his eyes forward and said, “Hmm, my ancestor directed me here. Before he achieved sainthood, he once ventured into this place and nearly perished. Afterwards, he became a saint and ascended, but even until he passed away, he had no chance to return here.”<br/><br/>Mentioning this past event, Ji Rutian’s tone carried a hint of nostalgia.<br/><br/>Yang Du laughed and asked, “What’s with that tone? Don’t tell me your ancestor has possessed you?”<br/><br/>Ji Rutian didn’t respond, and Yang Du’s smile gradually stiffened.<br/><br/>“Hey, don’t scare me!” Yang Du quickly said, visibly annoyed.<br/><br/>“We’re almost there, get ready to fight,” Ji Rutian said without turning back.<br/><br/>Upon hearing this, Yang Du couldn’t help but look ahead as force began to seep from the surface of his body.<br/><br/>A faint glow emerged from within the darkness, accompanied by the sound of water.<br/><br/>The two ceased their conversation and moved ahead. Soon, they exited the tunnel, and a blue light shone upon their faces.<br/><br/>Yang Du’s pupils shifted slightly, following his gaze, they found themselves in an expansive underground space. The ceiling was hundreds of feet from the ground below, and a wide underground river fell along the cave wall, blocking their path ahead.<br/><br/>Across the river stood two hundred-foot-tall stone statues. Their bodies were humanoid, but their heads were like those of demons—one had a dragon head, the other an elephant head, both fierce and commanding as if they were staring down Ji Rutian and Yang Du.<br/><br/>“Demons?” Yang Du frowned and said.<br/><br/>Ji Rutian spoke up, “Don’t underestimate demons. Before humanity’s rise, the Demon Race was the supreme ruler of the Mortal Realm. Even during the eras of some human Great Saints, the Demon Race still produced beings who could reach the heavens and penetrate the earth. According to my ancestor, there was once a Demon Saint who caused such a commotion in the Upper Realm that it nearly toppled the rule of the Immortal Divine.”<br/><br/>“That powerful?”<br/><br/>“Of course, many of the Body Cultivation Techniques of humanity originated from the Demon Race.”<br/><br/>Ji Rutian spoke as he walked to the riverbank. He crouched down and reached into the water with his hand.<br/><br/>Yang Du followed behind him, his gaze fixed on the elephant demon stone statue.<br/><br/>The stone statue of the elephant demon stood tall and open-armed, its head bowed low as if it were looking in Yang Du’s direction, its two tusks like ridges, and its trunk reaching towards the sky, seemingly ready to unravel the firmament itself.<br/><br/>Splash!<br/><br/>Yang Du’s train of thought was interrupted. He instinctively turned towards Ji Rutian, then his eyes widened in disbelief.<br/><br/>Ji Rutian had vanished without a trace, as if he had fallen into the river. Yang Du hurriedly leaned over to look, but the murky water revealed nothing of Ji Rutian’s whereabouts.<br/><br/>Yang Du’s brow furrowed. As he looked around in every direction, for some reason, he suddenly felt dizzy, as if the entire underground space was shaking.<br/><br/>…<br/><br/>Overcast clouds filled the firmament, and the black water churned ceaselessly beneath, oppressive to the extreme.<br/><br/>Xu Qiuming and Yang Jun were sword flying, looking towards the distance. They could see other cultivators and demons, all flying in the same direction.<br/><br/>“Master, is this the Reincarnation Sea? It’s said that the Reincarnation Sea is the entrance to the Jiu You Yellow Springs—is that true?” Yang Jun asked curiously.<br/><br/>Xu Qiuming gazed forward and replied calmly, “Whether it’s the entrance to the Jiu You Yellow Springs, I’m not sure, but if you fall down there, I fear you’ll become a soul lost in the sea.”<br/><br/>At these words, Yang Jun looked down and noticed faint lights within the black water. His gaze sharpened as he looked more closely and was shocked to discover that those lights were all souls.<br/><br/>Countless, beyond measure!<br/><br/>The Reincarnation Sea suddenly seemed even more terrifying to him.<br/><br/>Meanwhile.<br/><br/>Miles away, a grand palace floated above a vast island, emitting a bright glow—a deep and mysterious blue light.<br/><br/>Within the palace, Xu Chonggua, the founder of the Void Dao, was meditating on a bed-like platform of red jade.<br/><br/>He wore a deep blue Dao robe, his hair long and scattered, even longer than his robe. His complexion was pale, devoid of any color, and there was a black line on his forehead resembling a vertical eye that appeared as though it might open at any moment.<br/><br/>Xu Chonggua slowly opened his eyes, which were pitch-black and devoid of pupils.<br/><br/>“What brings you here again?”<br/><br/>He spoke with an indifferent tone.<br/><br/>As his words fell, streams of black qi appeared in the bright hall, spreading rapidly and forming a black fog. Within the fog, a mysterious figure emerged, indistinguishable as man or woman, their true face hidden.<br/><br/>“This time, I come bearing sincerity. The Great Dark Demon Saint wishes to bestow upon you a Sacred Weapon, one that has absorbed a million years of spiritual energy and carries divine might, capable of helping you sweep through an era,” the mysterious figure within the black fog spoke, a woman’s voice carrying a bone-chilling coldness.<br/><br/>Xu Chonggua lifted his chin, looking down at the shadowy figure, “Is there really anyone in this world who can stop me?”<br/><br/>“I know of one who could—you must have heard of Heavenly Dao. He possesses the power to slay saints,” she replied with a complex tone in her voice.<br/><br/>Slayer of Saints!<br/><br/>Xu Chonggua narrowed his eyes, “Really?”<br/><br/>“Indeed, and it’s not just him. That woman by his side named Zhou Xue is not simple either. She has the ability to devour the fate of our Demon Race. Those two will surely become obstacles in your path, especially since you aim to traverse the strongest path in the Mortal Realm,” the mysterious figure claimed.<br/><br/>Her words caused Xu Chonggua’s brows to tighten. He was about to speak when suddenly—<br/><br/>A tremendous Heavenly Might descended, causing a change in Xu Chonggua’s expression. He instinctively looked outside the palace.<br/><br/>The mysterious figure in the black fog also turned to look, murmuring to herself, “How is this possible… such Heavenly Might…”\t\t\t\t\t\t</div>", "images": {}, "success": true}