{"id": 425, "url": "https://www.novelhall.com/i-became-an-immortal-on-mortal-realm-32879/15028232.html", "title": "Chapter 415 - Chapter 415: Chapter 412: The Forefather Of A Generation", "volume": 5, "volume_title": "Volume 5", "body": "<h1>Chapter 415 - Chapter 415: Chapter 412: The Forefather Of A Generation</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 415: Chapter 412: The Forefather of a Generation<br/><br/>“Could you foresee that he would reach the heights he has achieved today?”<br/><br/>The majestic voice asked in return, rendering the Daoist Master of Spring and Autumn silent.<br/><br/>Indeed, had he ever imagined that the Heavenly Dao would reach such heights today?<br/><br/>The endless ocean at the edge of heaven and earth surged relentlessly, where the waterfall seemed like the voice of the cosmos, loud and eternal.<br/><br/>After a long while.<br/><br/>The Daoist Master of Spring and Autumn bowed respectfully and then turned to leave.<br/><br/>“This treasure is now yours, how you use it is no longer my concern,” the majestic voice spoke again, its tone indifferent.<br/><br/>As the voice faded, the sea surface in front of the Daoist Master of Spring and Autumn collapsed, forming a giant vortex over a hundred miles in diameter. A bright light rose from within the vortex, shining on the face of the Daoist Master of Spring and Autumn.<br/><br/>…<br/><br/>In Descending Dragon Continent, within Sword Heaven Marsh.<br/><br/>In the attic, Fang Wang was expounding on the Heavenly Dao to the senior members of Wangdao. He deconstructed the Heavenly Dao Myriad Classic of Laws and orally transmitted the fundamental techniques of cultivation.<br/><br/>The Heavenly Dao Myriad Classic of Laws was not as simple as the Qi Gathering Technique alone; it involved the rules of the universe and contained its own set of Dao methods.<br/><br/>The audience was mesmerized, even Hong Chen listened intently to the teachings.<br/><br/>Sword Immortal Xu Yan, Lü Xianming – once known as the foremost genius of Emperor Sea – and Duan Tian all wore expressions of fervent yearning.<br/><br/>Heavenly Dao seemed even more domineering than the Saint Dao and the Imperial Dao!<br/><br/>Great Saints and Great Emperors will eventually meet their demise; although they are the strongest in the Mortal Realm, they are far inferior to becoming an Immortal. It is just that mortal beings cannot become Immortals before ascension, hence the Path of Immortality does not exist in the Mortal Realm.<br/><br/>The Heavenly Dao is different, pursuing eternal life, seeking to escape fate and karmic retribution, pursuing the freedom of a True Immortal!<br/><br/>Fang Wang added the word “true” before “immortal,” making True Immortals seem specifically opposed to the Immortal Divine. Yet, having understood the Heavenly Dao, everyone felt that the Heavenly Dao True Immortals were the genuine Immortal Divines.<br/><br/>Unfettered and uninfluenced by any existence, this is what it means to be an Immortal!<br/><br/>After a long while.<br/><br/>When Fang Wang finished speaking, everyone remained immersed in the Heavenly Dao Myriad Classic of Laws.<br/><br/>In Fang Wang’s vision, the Heavenly Dao Myriad Classic of Laws was a complete system of cultivation, so he would continue to refine the scripture over time.<br/><br/>The Heavenly Dao Myriad Classic of Laws provided a foundational framework for cultivation, allowing other practitioners of the Heavenly Dao to innovate upon this base, much like watering a sapling to help it grow into a grand celestial tree, branching out far and wide.<br/><br/>Hong Chen opened his eyes, breaking the silence, and exclaimed with emotion, “What a profound Heavenly Dao. Dao Master, even if you were in The Upper Realm, you could be revered as a great patriarch. The establishment of the Heavenly Dao could certainly shake the Great Saints and Great Emperors.”<br/><br/>When he had previously sensed the extraordinary celestial phenomena induced by Fang Wang, he had realized Fang Wang’s fate was not simple. But after truly contemplating the Heavenly Dao, he understood its profoundness.<br/><br/>The others gradually came to their senses, their experiences deeper than Hong Chen’s, for they were encountering such profound Dao for the first time.<br/><br/>“Let’s issue a command to all Disciples of the Way of Hope. I am preparing to lecture on the Dao at Kunlun to Wangdao disciples, and this will be the first time addressing all disciples of Wangdao,” Fang Wang said. After so many years secluded in the Heavenly Palace, it was indeed time for a rest.<br/><br/>Hearing this, no one objected; on the contrary, they were delighted.<br/><br/>Wangdao had been established for some time, but there had never been a gathering of all members, so they were all looking forward to it.<br/><br/>“Regarding the Heavenly Dao, should we also impart it to other beings who are not Disciples of Wangdao?” Zhu Rulai asked.<br/><br/>Fang Wang smiled and replied, “Any being, as long as they do not have an infamous reputation and wish to learn, you may impart to them. As a newly established system of cultivation, the Heavenly Dao needs many beings to join. Do not fear others practicing the Heavenly Dao. The stronger it becomes, the more we all benefit. Moreover, with me here, I will continually create stronger Heavenly Dao techniques for you all to practice.”<br/><br/>His words were acknowledged by everyone, who all looked at him with admiration.<br/><br/>Then, Fang Wang instructed them to go down and make arrangements. After the crowd disbanded, he walked out of the loft and towards the lakeside of Sword Heaven Marsh.<br/><br/>The creatures gathered around Sword Heaven Marsh were still numerous. The lake’s surface was filled with figures comprehending swordsmanship, encompassing both humans and demons. The number of lofts by the lake far surpassed that of the past, with towns being constructed in every direction even ten miles away.<br/><br/>Clad in white, Fang Wang made his way, his true identity visible, yet hardly anyone recognized him.<br/><br/>He came to stand beside Gu Tianxiong.<br/><br/>Gu Tianxiong was sitting cross-legged, fishing on a big rock. Hundreds of years had passed, but he looked the same as when Fang Wang had first met him, unchanged in appearance or stature. However, Fang Wang could see that Gu Tianxiong’s lifespan was not much longer.<br/><br/>In the past, every time Fang Wang saw him, he was very talkative. This time, he was silently fishing alone, devoid of companions, exuding a sense of loneliness.<br/><br/>Fang Wang approached him and asked, “The fish in this lake are becoming more and more intelligent, and now there are even fish demons. It must be hard for you to catch any.”<br/><br/>Gu Tianxiong glanced at him and chuckled, “It’s all for fun. Even if I do catch one, I will let it go.”<br/><br/>“In a while, I will give a dao lecture, and you should come and listen,” Fang Wang said softly, looking at the lake.<br/><br/>“Forget it, I have accepted my fate, why waste time?” Gu Tianxiong said, shaking his head.<br/><br/>Fang Wang did not persuade him further.<br/><br/>Even though he founded the Heavenly Dao, he could not change a person’s innate talent.<br/><br/>Gu Tianxiong’s cultivation had stopped at the Condensation Spirit Realm, which undoubtedly was a peak cultivation level in the former Grand Qi Cultivation Realm, but in this era, the Condensation Spirit Realm was no different from commoners.<br/><br/>Gu Tianxiong turned his head toward Fang Wang with expectancy and said, “Tell me about where you disappeared to all these years. Was it any good?”<br/><br/>Fang Wang smiled and then began to recount his experiences on Earth.<br/><br/>Gu Tianxiong, hearing about another mortal realm where people could reach the heavens and enter the earth without cultivation, immediately became very interested.<br/><br/>On the other hand, the Dao Sects were using Wangdao Commands to inform all disciples that the Dao Master would give a lecture in twenty years, and disciples across the land were invigorated.<br/><br/>It wasn’t until dusk that Fang Wang finished speaking, and Gu Tianxiong was still left wanting more.<br/><br/>“Earth sounds quite nice. Actually, living a short yet fulfilling life without pursuing cultivation isn’t so bad either,” Gu Tianxiong remarked with appreciation.<br/><br/>Fang Wang chuckled and said, “Every mortal realm has its own pressures that people spend their whole lives chasing.”<br/><br/>Suddenly, Fang Wang seemed to sense something and his gaze shifted towards the horizon.<br/><br/>A world-shaking war had erupted on the other side of the mortal realm. Several Celestial Qiankun beings were fighting in chaos, and among them was Heavenly Stem Venerate Ye Xunhuan.<br/><br/>Ye Xunhuan was not the strongest among those few, as he was following other Celestial Qiankun beings and attacking a very strong presence.<br/><br/>Gu Tianxiong nodded and then asked, “Haven’t you been cultivating recently?”<br/><br/>“I’m planning to go out for a while to gather all the inheritances I should claim. How about it, do you want to join me for a trip?” Fang Wang said with a smile.<br/><br/>Gu Tianxiong shook his head, “I don’t have the energy to accompany you. Rather than pursuing fortunes, I’d prefer to spend a few nights at the Apricot Flower Building in the city.”<br/><br/>“By the way, don’t forget about my daughter Gu Li. She hasn’t found a dao companion because she probably has you in her heart,” he added.<br/><br/>Fang Wang said, “Of course, I won’t forget her. There’s a place for her in my inner palace.”<br/><br/>Gu Tianxiong’s eyes widened as he scolded, “Can’t you speak more delicately? I am her father!”<br/><br/>“Then you could also advise her to stay away from me.”<br/><br/>“Never mind, it’s better for her to stay with you. Perhaps she might even share your fortune and ascend to immortality.”\t\t\t\t\t\t</div>", "images": {}, "success": true}