{"id": 424, "url": "https://www.novelhall.com/i-became-an-immortal-on-mortal-realm-32879/15025756.html", "title": "Chapter 414 - Chapter 414: Chapter 411: Mortal Merit, Heaven And Earth Fortune", "volume": 5, "volume_title": "Volume 5", "body": "<h1>Chapter 414 - Chapter 414: Chapter 411: Mortal Merit, Heaven And Earth Fortune</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 414: Chapter 411: Mortal Merit, Heaven and Earth Fortune<br/><br/>The golden rain that enveloped the Mortal Realm poured for a full seven days and nights, just like the Heavenly Might stirred when Fang Wang created the Heavenly Dao Immensity Scripture.<br/><br/>After seven days, the Fate of various places in the Mortal Realm ascended, and the Spiritual Energy increased.<br/><br/>Fang Wang stood at the head of the bridge, bathing in the golden rain, and through this event, he gained many insights.<br/><br/>It turned out that Heaven and Earth, like sentient beings, also continuously grew stronger. The stronger the creatures became, the stronger Heaven and Earth would become. Of course, this was true only for the beings tied to the Fate of this realm. If beings from other realms crossed over, the stronger they were, the more harm they would cause to this realm.<br/><br/>Whether it was creating a Cultivation Technique or founding a Fate, anything that could strengthen the beings of Heaven and Earth was felt by Heaven and Earth. As it grew stronger, it would also reward the creator, enhancing their Fate and increasing their good fortune.<br/><br/>With Fang Wang establishing the Heavenly Dao, his contribution was immense for Heaven and Earth, far surpassing that of the Primordial Sect Master and the Xu Chonggua. As the golden rain began to weaken, he distinctly felt his own Fate rapidly ascending. Moreover, he acquired something invisible and intangible that enveloped him, pleasing his mood and giving him a premonition that something good was about to happen.<br/><br/>Fang Wang spread his arms wide, feeling the connection with Heaven and Earth.<br/><br/>In this moment, he truly felt a sense of belonging to Xuanzu’s World.<br/><br/>All this time, he had considered himself an Earthling, and there was an indescribable barrier in his heart towards this realm.<br/><br/>Feeling the goodwill of Heaven and Earth, Fang Wang suddenly realized that becoming an Immortal in this world was not only for himself but also carried a responsibility towards Heaven and Earth.<br/><br/>Once the golden rain completely disappeared, Heaven and Earth returned to normal, but Sword Heaven Marsh was abuzz with earth-shaking noise.<br/><br/>“Is all this grace from the Heavens because of the Dao Master?”<br/><br/>“Nonsense, who else but the Dao Master could create the Heavenly Dao?”<br/><br/>“The way of the Heavenly Dao feels different from the Saintly Path and the Emperor Path.”<br/><br/>“Indeed, from the comprehension of Heaven and Earth, pursuing the Heavenly Dao can also lead to eternal life.”<br/><br/>“Xu Chonggua just founded the Path of Nothingness, while our Dao Master directly created the Heavenly Dao. This Heavenly Dao is recognized by Heaven and Earth, whereas the Path of Nothingness is just an empty proclamation.”<br/><br/>It wasn’t just Sword Heaven Marsh— the whole world was discussing the Heavenly Dao.<br/><br/>Within the golden rain hid the enlightenment of Heaven and Earth. Any creature touched by the golden rain received the teachings of Heaven and Earth. Inexplicably, they became aware of the existence of the Heavenly Dao and sensed its importance to this realm.<br/><br/>When mentioning the Heavenly Dao, they naturally thought of the Master of Wangdao!<br/><br/>Far away on the other side of the Mortal Realm, in the Reincarnation Sea, inside the Void Palace, Xu Chonggua stared outside, his eyebrows furrowed.<br/><br/>There was still a patch of black fog on the throne, and from within it, the mysterious figure lamented, “What a Heavenly Dao, different from your Path of Nothingness. Your path is merely a vow you made to Heaven and Earth, while his Heavenly Dao represents an entirely new way of cultivation. It’s hard to imagine that this person could forge a path rivaling that of the Emperor Saints before even achieving Saintly Emperor Certification.”<br/><br/>Xu Chonggua remained silent.<br/><br/>The mysterious figure turned around, looked at Xu Chonggua, and said somberly, “Perhaps your deal with the Great Dark Demon Saint has to be canceled.”<br/><br/>At these words, a cold glint flickered in Xu Chonggua’s eyes.<br/><br/>The black fog churned, and the mysterious figure gradually vanished, but her voice lingered, “The more chaotic the era, the sooner a person of destiny appears. Now that the destiny has been revealed, perhaps your concerns were valid.”<br/><br/>As her voice faded, the black fog completely dissipated, leaving only Xu Chonggua in the hall.<br/><br/>Xu Chonggua raised his hand and began to tally and calculate.<br/><br/>However, he couldn’t deduce anything.<br/><br/>…<br/><br/>At the end of heaven and earth, a vast expanse of water cascaded down, forming a spectacular and unparalleled waterfall. The ends of the waterfall were very distant from each other, and looking down, one could see a vast mist with a starry sky below, where stars were scattered, dazzlingly bright.<br/><br/>It was as though this place was the Edge of the Sky, the very ends of the sea. Looking in the direction from which the sea flowed, one could see mountains rising and falling at the end of the horizon, above a sea of clouds.<br/><br/>A figure stood on the sea surface, with waves splashing behind him. He was less than seven steps away from the cliff.<br/><br/>This was a Taoist, none other than the Spring Autumn Taoist from Emperor Sea, who once sought to aid the Saint Clans in scheming against Fang Wang, only to suffer the curse of Hong Chen and disappear for hundreds of years.<br/><br/>The Spring Autumn Taoist looked the same as he had hundreds of years before, standing against the wind with a bearing that showed the demeanor of one highly attained in the Dao.<br/><br/>“Great Saint summoned me here, why have you not shown yourself?”<br/><br/>The Spring Autumn Taoist spoke aloud, his voice booming, covering the roar of the waves.<br/><br/>He faced the starry sky, his gaze calm. No matter how strong the wind and waves, his figure never wavered, only his robe flapped intensely.<br/><br/>“Did you feel the Heavenly Dao earlier?”<br/><br/>An authoritative voice emerged, ancient and eminent, as if it was an old deity standing at the end of the ages.<br/><br/>The eyes of the Spring Autumn Taoist changed, and he replied, “I felt it, a Dao that is unlike that of the Great Saints or Great Emperors, and even more favored by heaven and earth than the Imperial Dao of fate created by Hongxuan Emperor in the past. The merit golden rain covering the Mortal Realm is enough to make the people grateful to the Heavenly Dao.”<br/><br/>“Who is the cultivator that established this Heavenly Dao?”<br/><br/>The authoritative voice sounded once more, tone tinged with a hint of curiosity.<br/><br/>The Spring Autumn Taoist hesitated for a moment then said, “It should be the Wangdao Master who inherited the legacy of the Descending Dragon Great Saint, named Fang Wang. He is already one of the strongest in the Mortal Realm, with many underlings who wield the power of Celestial Qiankun at his command.”<br/><br/>“The Descending Dragon Great Saint?” The authoritative voice seemed surprised.<br/><br/>“To be precise, he has also inherited the legacy of many Great Saints. The Descending Dragon Great Saint is just the first one he inherited, and also the master he acknowledged personally…” The Spring Autumn Taoist began to recount the growth experiences of Fang Wang.<br/><br/>The surrounding waves calmed, as if even Canghai itself was earnestly listening to the legendary deeds of Fang Wang.<br/><br/>After a long time.<br/><br/>Once the Spring Autumn Taoist finished speaking, the authoritative voice said with emotion, “Remarkable, this young man is definitely the most talented since the Grand An Divine Dynasty. I had originally wanted you to investigate a matter of karmic consequence, but it seems unnecessary now.”<br/><br/>Upon hearing this, the Spring Autumn Taoist hurriedly asked, “May I ask the Great Saint, what is this karmic consequence?”<br/><br/>“I have been sealed here for three hundred thousand years. Though I have lost my freedom, I could still see the changes in the world. A catastrophe from the Underworld is imminent. The catastrophe drives out demonic essences, forcing the demons to leave their land and come to the Mortal Realm. Before the catastrophe arrives, there will surely be a slaughter between the demons and the people of the Mortal Realm. What follows will be the true terror. I was hoping you would mediate in this matter. But now that a Heavenly Dao has been born in the Mortal Realm, there is no need for your intervention. Perhaps, this catastrophe is meant for him.”<br/><br/>Upon hearing these words, the Spring Autumn Taoist immediately placed his hands together and started to divine the fortunes of the calamity.<br/><br/>The more he calculated, the deeper his frown became.<br/><br/>Suddenly.<br/><br/>His complexion drastically changed, and he couldn’t help but spit out a mouthful of blood in reverse. His eyes wide with shock, he said in a trembling voice, “How is it possible… how could it be him… he couldn’t still be alive…”<br/><br/>The authoritative voice said profoundly, “You indeed retained some of my memories. Since you remember him, you should know the kind of catastrophe he will bring upon the Mortal Realm.”<br/><br/>The Spring Autumn Taoist looked up, gritting his teeth, “Though the Heavenly Dao is strong, after all, it’s been less than a thousand years, can he really stand against that forbidden existence?”\t\t\t\t\t\t</div>", "images": {}, "success": true}