{"id": 430, "url": "https://www.novelhall.com/i-became-an-immortal-on-mortal-realm-32879/15032550.html", "title": "Chapter 420 - Chapter 420: Chapter 417: Is It A Saint, An Emperor, Or An Immortal?", "volume": 5, "volume_title": "Volume 5", "body": "<h1>Chapter 420 - Chapter 420: Chapter 417: Is It A Saint, An Emperor, Or An Immortal?</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 420: Chapter 417: Is it a Saint, an Emperor, or an Immortal?<br/><br/>“Of course you can, but you should remember what this Great Saint said before: you need to be at the Celestial Qiankun Realm to come and take it, you must pass my test and prove yourself worthy of the inheritance!”<br/><br/>The voice of the Executioner Immortal Great Saint resonated, and Fang Wang couldn’t help but compare—this Executioner Immortal Great Saint seemed even more overbearing than the residual souls within Jian Shi.<br/><br/>Perhaps he was the main soul of the Executioner Immortal Great Saint!<br/><br/>Fang Wang spoke, “Then please, senior, commence with the test.”<br/><br/>Truth be told, he had lost interest in the inheritance of the Executioner Immortal Great Saint; he only thought about getting a bit stronger if he could.<br/><br/>His self-created Great Returning Void Palm had already surpassed the Executioner Immortal Ghost God Sword!<br/><br/>Moreover, he had evolved the Executioner Immortal Ghost God Sword to the even more powerful Heavenly Earth Slaying Immortals Sword!<br/><br/>On a distant mountain, the undead warrior stood up, raising its right arm, and as the trembling earth suddenly cracked open, tombstones fell into the abyss. An overwhelming Ghost Qi rose from it and formed a black giant sword a thousand feet in length.<br/><br/>The Grand An Profound Turtle exclaimed in shock, “His momentum is unusual; this is definitely not something the Celestial Qiankun can withstand!”<br/><br/>Fang Wang remained unmoved, and behind him, the Great Dark Demon Saint also secretly felt a shock, curious about the origins of this soul of the Great Saint.<br/><br/>Xiao Zi then cursed, “It seems this fellow is up to no good.”<br/><br/>“It doesn’t matter.”<br/><br/>Fang Wang smiled indifferently, regardless of whatever tricks the Executioner Immortal Great Saint played, he didn’t take them to heart.<br/><br/>Now in the Heavenly Dao Primary Origin Realm, he was already the equivalent of the Saint Realm, and he was someone who could fight across different realms. The Executioner Immortal Great Saint was dead and could not exert his full strength.<br/><br/>The aura the Executioner Immortal Great Saint was currently showing was still not enough to threaten Fang Wang.<br/><br/>Upon hearing the words “It doesn’t matter,” the Great Dark Demon Saint turned his gaze towards Fang Wang.<br/><br/>He was very curious about how strongly Fang Wang would perform.<br/><br/>Even observing Fang Wang up close, he couldn’t sense Fang Wang’s presence; previously, he was only able to follow because of Xiao Zi.<br/><br/>The Great Dark Demon Saint had never doubted Fang Wang’s strength, but how strong Fang Wang actually was, he couldn’t be sure.<br/><br/>The heavens and earth rumbled—the tombstones were pushed aside, and corpses crawled out from the soil, standing on the mountain peak. The Executioner Immortal Ghostly Divine Sword wielder raised his hand to grasp the giant Ghost Qi sword that was a thousand feet long.<br/><br/>The Executioner Immortal Ghostly Divine pointed the sword from afar towards Fang Wang and said, “The test is to defeat the remnants of this Great Saint in this Purgatory!”<br/><br/>Fang Wang’s mouth curled up, and then he took one seemingly normal step forward, without any commotion.<br/><br/>The Great Dark Demon Saint’s pupils suddenly shrank, and it wasn’t just him; even the Grand An Profound Turtle widened its turtle eyes.<br/><br/>Both the demon and the monster turned their heads in unison, as if something terrifying had emerged between heaven and earth.<br/><br/>Fang Wang spoke, “Demon Saint, since the Demon Race comes from the Underworld, it implies that you are all undead to begin with. Instead of reviving to live in fear, why not join my Celestial Phenomenon? If I do not die, the Phenomenon will not perish, and you can enjoy eternity here, even establishing your own world.”<br/><br/>Upon hearing this, the Great Dark Demon Saint was about to speak when he suddenly felt something and his face dramatically changed.<br/><br/>The sword-raising Executioner Immortal Ghostly Divine also turned towards the distance, only to see countless figures flying from all directions like a rain of arrows, some even emanating a momentum that shook the heavens and the earth.<br/><br/>“Living beings… how is that possible…”<br/><br/>The Great Dark Demon Saint muttered to himself, unable to believe his own senses.<br/><br/>He was sure he had entered Fang Wang’s Celestial Phenomenon, but a Celestial Phenomenon was merely a kind of domain used for battle, where only power and seals existed. Even a Great Saint couldn’t have living beings within their own Celestial Phenomenon, at least he could not.<br/><br/>The Grand An Profound Turtle was equally shocked and couldn’t help but ask, “Your Majesty, how did you do it?”<br/><br/>Fang Wang lifted his chin, smiling proudly, but he didn’t answer.<br/><br/>These so-called living beings were all entities who practiced the Heavenly Dao. Fang Wang created them using Fate and the Heavenly Dao Myriad Classic of Laws. They seemed to be living beings, but in reality, they had no consciousness of their own and were merely battle puppets.<br/><br/>Fang Wang didn’t reveal this fact. Just the semblance of life was enough to astonish onlookers.<br/><br/>Moreover, his Celestial Phenomenon hadn’t reached its limit yet; in the future, he would continue to strengthen it.<br/><br/>Without needing verbal commands from Fang Wang, those Heavenly Dao Cultivators all charged toward the Executioner Immortal Ghost God, even conjuring their own Lifespirit Treasures, as if they were real cultivators.<br/><br/>The moment the Executioner Immortal Ghost God brandished his sword, black Sword Qi swept across heaven and earth, streaking through hundreds of miles of the firmament and annihilating numerous Heavenly Dao cultivators. However, some of the more powerful cultivators used their Spiritual Power to block the Ghostly Divine Sword Qi.<br/><br/>All of these were part of the Celestial Qiankun, among them were people like Wei Buyu.<br/><br/>The Heavenly Stem Venerates were also practicing the Heavenly Dao Immensity Scripture, having reached the Celestial Qiankun Realm. Unless they ascended, it would be difficult for their cultivation to grow any further, giving them ample time to delve into the Heavenly Dao Immensity Scripture.<br/><br/>The Heavenly Stem Venerates swiftly killed their way to the Executioner Immortal Ghost God, each displaying Divine Skills, shaking the heavens and the earth.<br/><br/>The corpses that crawled out of the soil all raised their hands, and souls emerged from their skeletons, all flying toward the Executioner Immortal Ghost God. The battle did not affect them; they seemed like ethereal beings, passing through unhindered and quickly entering the body of the Executioner Immortal Ghost God.<br/><br/>“Break!”<br/><br/>The voice of the Executioner Immortal Great Saint suddenly rang out, dominating and oppressive.<br/><br/>Ripples spread through space, but quickly settled back into calmness.<br/><br/>Fang Wang turned back to look at the Great Dark Demon Saint and asked, “How about it, have you considered it? I can integrate the Demon Race into the Celestial Phenomenon and preserve your consciousness.”<br/><br/>The Great Dark Demon Saint fell silent.<br/><br/>With an air of annoyance, the Grand An Profound Turtle said, “Demon Saint, I feel like I’ve seen you before. You were once the strongest of your time. Do you know who you are facing? It’s the Grand An Divine Emperor, the last emperor of the Grand An Divine Dynasty, bearing the imperial title ‘An Tian.’ When His Majesty was at his most powerful, even the celestial immortals had to bow and show courtesy. Now that His Majesty has begun cultivating again in this life, he has the potential to surpass his previous one. This is the greatest opportunity for you. If you miss it, you will continue to sink into oblivion!”<br/><br/>The expression of the Great Dark Demon Saint alternated between shades of light and dark.<br/><br/>Fang Wang raised his right hand and reached out across the space toward the increasingly formidable Executioner Immortal Ghost God.<br/><br/>His action drew the attention of the Great Dark Demon Saint.<br/><br/>With a casual clench of his right hand, Fang Wang caused all the souls and skeletons in front of him to disintegrate into ash as did the Executioner Immortal Ghost God, who rapidly dissipated.<br/><br/>All at once, silence fell upon the world, and the Heavenly Stem Venerates who were besieging the Executioner Immortal Ghost God vanished, too. The previously clamorous and crowded space now bore a vast vacuum.<br/><br/>The Great Dark Demon Saint couldn’t help but stare with wide eyes, and even the Grand An Profound Turtle had his mouth agape, while only Xiao Zi showed an expression of nonchalance.<br/><br/>“Young Master, if you annihilate them like that, how will you pass on the Sword Qi?” Xiao Zi asked, perplexed.<br/><br/>Fang Wang replied, “We might as well forget this Sword Qi.”<br/><br/>He then stepped forward and the faraway Heavenly Dao cultivators vanished abruptly, leaving the Celestial Phenomenon apparently unchanged, yet they had indeed left the Celestial Phenomenon.<br/><br/>“May I ask, fellow Daoist, what you go by—a Saint, an Emperor, or an Immortal?”<br/><br/>The voice of Fang Wang echoed throughout the heavens, resounding endlessly.\t\t\t\t\t\t</div>", "images": {}, "success": true}