{"id": 434, "url": "https://www.novelhall.com/i-became-an-immortal-on-mortal-realm-32879/15039343.html", "title": "Chapter 424 - Chapter 424: Chapter 421: Taixuan Shenxiao Scripture Great Perfection!", "volume": 5, "volume_title": "Volume 5", "body": "<h1>Chapter 424 - Chapter 424: Chapter 421: Taixuan Shenxiao Scripture Great Perfection!</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 424: Chapter 421: Taixuan Shenxiao Scripture Great Perfection!<br/><br/>When Fang Wang’s divine sense probed into the red jade, he felt a powerful prohibition he had never encountered before. This prohibition was not to prevent him from obtaining the Taixuan Shenxiao Scripture, but to pull him into a certain Illusionary Realm, intending to show him some visions.<br/><br/>In a trance, he saw beings who practiced the Taixuan Shenxiao Scripture, including humans and demons, some born into families with deep heritage, others from humble beginnings.<br/><br/>Practicing the Taixuan Shenxiao Scripture required enduring hardship through the long years, and once mastered, one would be invincible!<br/><br/>Watching those originally weak figures who eventually swept across the world, Fang Wang was also moved.<br/><br/>He did not know how much time had passed when he suddenly awoke.<br/><br/>He looked down at the red jade in his hand again, his eyes complex.<br/><br/>“So this is the test?”<br/><br/>Fang Wang muttered to himself, feeling the prohibition over and over, being brainwashed by the visions telling him how powerful the Taixuan Shenxiao Scripture was, that once perfected, he could do as he pleased, invincible in the world.<br/><br/>Indeed, do as one pleases!<br/><br/>Fang Wang saw the practitioners enjoying themselves unrestrained after becoming invincible, scenes with a powerful impact, likely to stir the emotions of most who saw them.<br/><br/>Fang Wang was human, and his thoughts stirred when he saw them.<br/><br/>But the overpowering nature of those scenes made him more cautious.<br/><br/>Excessive indulgence and arrogance would only lead to irreversible disaster.<br/><br/>Fang Wang was already strong, he could enjoy himself, but he did not need to indulge recklessly, bullying all living beings for pleasure.<br/><br/>Fang Wang’s gaze grew determined, and he probed into the red jade with his divine sense once again.<br/><br/>This time, he activated the Heart of the Heavenly Dao, casting aside his distracting thoughts.<br/><br/>It had to be said, the Descending Dragon Great Saint had his merits, as his True Combat Technique greatly influenced Fang Wang. This technique that maintained a singular emotion served purposes far beyond just combat.<br/><br/>Boom——<br/><br/>Thunderclouds began to gather in the sky, as though heralding an impending storm.<br/><br/>Fang Wang did not open his eyes. Noises rose from all over Sword Heaven Marsh, all curious about what was happening.<br/><br/>This time it had nothing to do with Fang Wang. There were no fluctuations of Spiritual Energy in Fang Wang’s area, and his aura did not leak out.<br/><br/>Fang Wang was immersed in the comprehension of the red jade.<br/><br/>About an hour later, Fang Wang finally touched upon the cultivation technique of the Taixuan Shenxiao Scripture.<br/><br/>Half an hour after that, he memorized the cultivation method of the Taixuan Shenxiao Scripture and his consciousness stepped into the Heavenly Palace.<br/><br/>Fang Wang opened his eyes, looking at the Heavenly Palace, he couldn’t help but take a deep breath.<br/><br/>Imprisonment was about to begin again!<br/><br/>With a thought, the scenery inside the Heavenly Palace changed abruptly, and he arrived above Kunlun.<br/><br/>Kunlun stretched endlessly, its mountain range majestic. Standing atop the summit, Fang Wang could look down upon everything in the Mortal Realm, a pride of surveying all mountains filled his chest.<br/><br/>Indeed, the environment can determine one’s mood for cultivation.<br/><br/>His Kunlun was created for his betterment in practice, and he suddenly was not daunted by the length of time needed to practice the Taixuan Shenxiao Scripture.<br/><br/>He sat down on the spot and practiced against the wind.<br/><br/>The sun and the moon rotated, nature’s spiritual energy circling around him.<br/><br/>He discovered that the Taixuan Shenxiao Scripture could absorb not only nature’s spiritual energy but also the laws of the world, very comprehensive, no wonder it could be the number one Divine Skill of all time.<br/><br/>Fang Wang’s comprehension was already high, practicing the Taixuan Shenxiao Scripture was not difficult, but the scripture was too complex, the practice process was long.<br/><br/>By the time he had mastered it, a thousand years had passed.<br/><br/>Not bad!<br/><br/>It was within Fang Wang’s range of acceptance.<br/><br/>After mastering the Taixuan Shenxiao Scripture, deep within Fang Wang’s soul, he nurtured a Shenxiao Sun, which was the fruit of the Taixuan Shenxiao Scripture. When summoned, the Shenxiao Sun could create a world akin to a Celestial Phenomenon, but with even greater oppressive force.<br/><br/>Minor completion was not enough; he had to continue to strive for Great Completion!<br/><br/>Intuition told Fang Wang that to progress from Great Completion to the realm of Great Perfection would require many more times the effort.<br/><br/>Sitting in meditation on the mountain peak, Fang Wang summoned the Shenxiao Sun, a crimson sun proudly standing atop Kunlun Mountain, dominating the entire firmament, twisting the sky, and scorching the heavens and earth.<br/><br/>Fang Wang focused on his cultivation, with the Shenxiao Sun above him in the sky, eliminating the distinction between day and night.<br/><br/>Years quickly passed by.<br/><br/>When Fang Wang cultivated the Taixuan Shenxiao Scripture to Great Completion, he looked back and saw that nearly thirty thousand years had gone by.<br/><br/>This time, Fang Wang didn’t feel numb, but instead was filled with fighting spirit.<br/><br/>How powerful the Taixuan Shenxiao Scripture is!<br/><br/>After achieving Great Completion, Fang Wang felt a sense of invincibility under the heavens, believing that even when faced with the mighty Immortal Court War God, he would have no fear.<br/><br/>This confidence came from within, not from comparison, but from sheer strength!<br/><br/>Anyone possessing such profound cultivation would develop an indomitable mindset!<br/><br/>Fang Wang couldn’t help thinking, what kind of exalted figure could have created such a divine skill?<br/><br/>Comparing just the Taixuan Shenxiao Scripture with the Heavenly Dao Myriad Classic of Laws, Fang Wang felt there was little difference, in terms of destructive power, the Taixuan Shenxiao Scripture was even stronger.<br/><br/>He was already looking forward to merging the Taixuan Shenxiao Scripture with the Heavenly Dao Myriad Classic of Laws!<br/><br/>If he were to master it, could he become an Immortal on the spot in the Mortal Realm?<br/><br/>After another two or three hundred years, when the opportunity to ascend arrives and the Immortal Divine descends, Fang Wang must be prepared to face the strongest of the Immortal Divine, or even the entire Immortal Court!<br/><br/>Putting himself in their shoes, Fang Wang believed that the commotion he had caused was significant, and if he were the Heaven Emperor, there’s no way he would let him continue growing unchecked.<br/><br/>After mentally preparing himself, Fang Wang continued to invest in the long and monotonous cultivation.<br/><br/>As time passed, the Kunlun produced by the Heavenly Palace remained unaffected by the sun and moon.<br/><br/>Eventually, Fang Wang’s heart couldn’t resist the passage of time and began to grow restless, his interest in the Taixuan Shenxiao Scripture steadily waning.<br/><br/>Finally.<br/><br/>He cultivated the Taixuan Shenxiao Scripture to Great Perfection!<br/><br/>From Great Completion to Great Perfection, it took just over a hundred and fifty thousand years, and this period of cultivation alone totaled one hundred and eighty-one thousand years!<br/><br/>It was another record for the longest time in seclusion!<br/><br/>At this moment, the Shenxiao Sun above the peak of Kunlun Mountain was much larger than Kunlun itself, as if the firmament could no longer hold it.<br/><br/>Beneath the Shenxiao Sun, Fang Wang’s white clothing fluttered due to the high temperature.<br/><br/>Fang Wang’s expression was indifferent, and he showed no excitement for having reached Great Perfection.<br/><br/>The Heavenly Palace illusion shattered, and Fang Wang’s consciousness returned to reality.<br/><br/>Upon opening his eyes, he saw that the sky above was covered with roiling thunderclouds, a tremendous Heavenly Might enveloping heaven and earth.<br/><br/>Fang Wang could sense a very strong presence growing far away, becoming stronger and stronger, already surpassing the ordinary Great Saint in power.<br/><br/>In response, Fang Wang’s expression remained unchanged, even after hearing the discussions within Sword Heaven Marsh, he was indifferent.<br/><br/>His gaze fell upon the black stone slab in front of him.<br/><br/>He lifted his right hand, picked up the black stone slab, his expression unaltered.<br/><br/>As his divine consciousness probed into the black stone slab, everything around him was instantly disregarded.<br/><br/>The restrictions within the black stone slab posed no obstacle for Fang Wang whatsoever.<br/><br/>In less than the time it took an incense stick to burn, Fang Wang’s consciousness had entered the Heavenly Palace.<br/><br/>The next second, he opened his eyes, filled with a murderous intent.<br/><br/>The Executioner Immortal Zi Xia Sword!<br/><br/>In the past, murderous intent was used to temper his cultivation, and at its peak, it could execute Immortals!<br/><br/>Fang Wang had already cultivated the Executioner Immortal Zi Xia Sword to Great Perfection!\t\t\t\t\t\t</div>", "images": {}, "success": true}