{"id": 437, "url": "https://www.novelhall.com/i-became-an-immortal-on-mortal-realm-32879/15044664.html", "title": "Chapter 427 - Chapter 427: Chapter 424: The Arrival Of Great Fate, Lord Of The Golden Command", "volume": 5, "volume_title": "Volume 5", "body": "<h1>Chapter 427 - Chapter 427: Chapter 424: The Arrival Of Great Fate, Lord Of The Golden Command</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 427: Chapter 424: The Arrival of Great Fate, Lord of the Golden Command<br/><br/>Hearing Dugu Wenhun’s words, Fang Wang remained silent, and with his back to Dugu Wenhun, his expression was hidden from view. For a moment, Dugu Wenhun also began to grow anxious.<br/><br/>After quite a while,<br/><br/>Fang Wang finally opened his mouth and said, “I understand, is there anything else?”<br/><br/>Dugu Wenhun immediately continued his report, speaking about the Heavenly Stem Venerate. The Heavenly Stem Venerate roamed the world, forcefully taking Cultivation Techniques. Although the fame of the Heavenly Dao had spread, and many major powers were willing to trade with the Heavenly Dao Immensity Scripture, there remained some rigid beings. This led to numerous conflicts.<br/><br/>Fang Wang listened patiently.<br/><br/>When Dugu Wenhun finished speaking, Fang Wang asked, “Do you need me to do anything?”<br/><br/>Dugu Wenhun shook his head and said, “I just wanted to report to you. If there are any dissatisfactions, we can intervene.”<br/><br/>“No need, let it be. This world is already in great chaos; being rigid isn’t necessarily good. We can’t let Wangdao become a shackle for my disciples in their struggle for Fate,” Fang Wang replied casually.<br/><br/>When he opened his eyes again, he distinctly felt the changes in the rules of nature—agitation, unrest, chaos, and more. Within nature’s Spiritual Energy, different strands of Fate intertwined, fiercely contending.<br/><br/>The more it was like this, the less Fang Wang wanted to interfere.<br/><br/>It was perfect for sifting through the disciples during the world’s great chaos.<br/><br/>Upon hearing this, Dugu Wenhun immediately let out a sigh of relief; Fang Wang had no objections, meaning his current actions were correct.<br/><br/>He didn’t linger and quickly took his leave.<br/><br/>Fang Wang didn’t immediately gain enlightenment, and instead, his gaze became distant.<br/><br/>“Big brother Gu, why didn’t you say goodbye before you left?” Fang Wang muttered to himself.<br/><br/>The death of Gu Tianxiong had deeply affected Fang Wang.<br/><br/>Despite being the master of over two million disciples and countless powers and Cultivators eager to be on good terms with him, there were not many people in his life who could truly be called friends, and Gu Tianxiong was one of them.<br/><br/>Most of his friends evolved from adversaries, or because of his powerful strength. Gu Tianxiong was different; when they met, he was not strong, and Gu Tianxiong did not know his identity.<br/><br/>No matter how strong Fang Wang was, every time he met Gu Tianxiong, Gu Tianxiong could speak improper words to him, and while improper, these words made Fang Wang feel a closeness.<br/><br/>Isn’t that what a true friend should be like?<br/><br/>With the departure of Gu Tianxiong, he felt that he would struggle to find such a friend again in the future. Even if he hid his strength and entered the world to make friends, his original intent would be different, at least he couldn’t deceive himself.<br/><br/>Fang Wang began to look back at his life.<br/><br/>He discovered that the memories of the first half of his life had already become blurry; after all, his actual age had surpassed six hundred and ten thousand years.<br/><br/>His thoughts drifted as he sat motionless at the edge of the bridge.<br/><br/>Sunsets and moonrises.<br/><br/>Months passed in the blink of an eye.<br/><br/>On this night, a meteor streaked across the night sky above Kunlun, drawing Fang Wang’s gaze.<br/><br/>He saw a mighty streak of Fate.<br/><br/>It was the first time he had seen such a colossal amount of Fate on a being.<br/><br/>He tried to calculate, but no matter what, he could not fathom it.<br/><br/>He did not have the thought of preventing it, as the more variables there were in the Mortal Realm, the more interesting it became.<br/><br/>For him, rather than suppressing potential threats, it was better to strive in cultivation and become stronger himself.<br/><br/>He had the confidence to maintain the fastest speed of growing stronger!<br/><br/>As he watched the mysterious meteor disappear, his melancholy dispersed.<br/><br/>Looking back over the past months was not in vain; Fang Wang had gained some insight.<br/><br/>He understood Fate and Karmic causality.<br/><br/>Fang Wang followed by closing his eyes.<br/><br/>He had set a goal for himself, to merge the Heavenly Dao Myriad Classic of Laws with the Taixuan Shenxiao Scripture in the next fifty years.<br/><br/>He sought to become an Immortal right here on earth!<br/><br/>He wanted all the people to know, even without ascending, one could still achieve Immortality!<br/><br/>By then, the allure of the Immortal Divine to the Cultivators of the world would be greatly diminished, which would be to his advantage.<br/><br/>The fifty years of enlightenment which he had just completed, had given Fang Wang a direction, which is why he dared to set a goal of fifty years.<br/><br/>Fifty years would bring about great changes to the Mortal Realm as it stood today.<br/><br/>Not to mention each year, nearly every day saw geniuses awaken and great beings comprehend the Dao.<br/><br/>Phenomena between heaven and earth that were rare occurrences once in a hundred years, now happened several times each year, which also resulted in the strengthening of the world’s laws.<br/><br/>…<br/><br/>Above the layers of cloud and sea, bathed in radiant dawn light, stood an old man with white hair and a White Robe in front of a massive Golden Stele, his gaze intently fixed on it.<br/><br/>This Golden Stele was at least a hundred zhang high, its surface engraved with dense, profound characters; following the gaze of the White Robe elder, one could see characters squirming within a particular area of the stele, a truly magical sight.<br/><br/>“How strange, how strange… why are all the karmic threads of the heavens converging towards one place in the Mortal Realm… Xuanzu’s World… Could it be that another Supreme Saint is being born?”<br/><br/>The White Robe elder twirled his long beard, mumbling to himself.<br/><br/>He was not the slightest bit flustered, an interested expression on his face.<br/><br/>At that moment, a rainbow light descended from the sky, landing behind him.<br/><br/>This was a towering figure radiating intense light, whose mere shape exuded an overwhelming sense of pressure.<br/><br/>“Lord of the Golden Command, have you deciphered the changes in Xuanzu’s World?”<br/><br/>The figure amidst the strong light spoke. If Fang Wang had been there, he would have recognized the voice as that of the Doom God!<br/><br/>Previously, the Doom God had sent servants in the Mortal Realm to assassinate Fang Wang, but unfortunately, they failed. When he successfully lured Fang Wang to the Endless Abyss, the Ghost Emperor intervened.<br/><br/>During this time, the Doom God had been keeping tabs on Fang Wang’s situation through his pawns in the Mortal Realm. Fang Wang’s rapid growth greatly unsettled the Heavenly God.<br/><br/>Too fast!<br/><br/>It was simply inconceivable!<br/><br/>The pace at which Fang Wang was getting stronger was rare even in The Upper Realm, and unprecedented in the Mortal Realm.<br/><br/>The White Robe elder known as the Lord of the Golden Command pointed with his hand, chuckling, “Look, with such significant changes, how could one fully understand them?”<br/><br/>The Doom God turned to look at the Golden Stele. The bright light concealed his features, making it impossible to discern the changes in his expression, but his sudden silence indicated his heart was not as calm as it appeared.<br/><br/>“I’ve heard you have enemies in Xuanzu’s World, and now the Fate of that world is rising faster than ever before. Once the Heavenly Gate opens, you should be careful when you descend. Throughout history, many Immortal Divine have perished in the Mortal Realm. Not long ago, Cang He Immortal Monarch, who had just revived his celestial life, fell completely. He died in Xuanzu’s World.”<br/><br/>The Lord of the Golden Command said leisurely, his tone tinged with a hint of jest.<br/><br/>Hearing this, the Doom God snorted, “I will not die in the Mortal Realm. I am well-prepared. This time, the celestial hosts will also take action. His Majesty has already agreed. With the increasing uncertainties in Xuanzu’s World, it is best to purge it.”<br/><br/>“Oh? Another purge? That’s a grave sin. The Immortal Court will suffer again. But since even His Majesty has agreed, Xuanzu’s World must indeed not be underestimated,” said the Lord of the Golden Command, while the Doom God fell silent again, his eyes fixed on the Golden Stele as if he could see the Mortal Realm through it.<br/><br/>After a while,<br/><br/>The Lord of the Golden Command spoke up, “By the way, could I trouble you to do me a favor? Bring someone up from the lower realm when you descend.”<br/><br/>The Doom God couldn’t help but ask, “Who?”<br/><br/>“When the time comes, I will tell you. For now, I have only deduced that his surname is Fang,” replied the Lord of the Golden Command.\t\t\t\t\t\t</div>", "images": {}, "success": true}