{"id": 432, "url": "https://www.novelhall.com/i-became-an-immortal-on-mortal-realm-32879/15034605.html", "title": "Chapter 422 - Chapter 422: Chapter 419: The Heavenly Dao Preaches, Irreversible By Any Cataclysm", "volume": 5, "volume_title": "Volume 5", "body": "<h1>Chapter 422 - Chapter 422: Chapter 419: The Heavenly Dao Preaches, Irreversible By Any Cataclysm</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 422: Chapter 419: The Heavenly Dao Preaches, Irreversible by Any Cataclysm<br/><br/>After annihilating Cang He Immortal Monarch, Fang Wang once again condensed the Town World Bead to devour this heaven and earth.<br/><br/>He turned his head, glancing at the Great Dark Demon Saint with the corner of his eye, and said, “In the future, you will be glad for the decision you are making now. After this matter is concluded, I will accompany you to the entrance that leads the Demon Race to the Mortal Realm.”<br/><br/>“Good.”<br/><br/>The Great Dark Demon Saint hurriedly responded, his face displaying an excited smile.<br/><br/>The Grand An Profound Turtle couldn’t help but express admiration, “What a domineering Divine Skill. Your Majesty, may I ask what this Divine Skill is called?”<br/><br/>“The Great Returning Void Palm, this was created by our young master when he broke through to the Divine Passage Realm,” Xiao Zi said with a proud smile, as if the Great Returning Void Palm was created by it.<br/><br/>The Grand An Profound Turtle was even more astonished upon hearing this.<br/><br/>Created during the Divine Passage Realm?<br/><br/>In its view, such a Divine Skill was already something ordinary Great Saints could hardly reach, and Fang Wang was capable of creating such Divine Skills during the Divine Passage Realm, a level of comprehension that even in the era of the Grand An Divine Dynasty it had not heard of.<br/><br/>At this moment, Fang Wang raised his hand, and the broken earth began to tremble.<br/><br/>Black qi shot up from beneath the ground, madly surging toward the Town World Bead. This was not Ghost Qi, but rather the Sword Qi left by the Executioner Immortal Great Saint.<br/><br/>The Great Dark Demon Saint took a deep breath, no longer disturbing Fang Wang.<br/><br/>Xiao Zi and the Grand An Profound Turtle excitedly began to discuss, mainly about Fang Wang’s strength.<br/><br/>According to the Grand An Profound Turtle, the Cang He Immortal Monarch who was being prepared for resurrection had already surpassed the state it had when facing the Executioner Immortal Great Saint in the past, yet even so, it was still no match for a single palm from Fang Wang.<br/><br/>Xiao Zi was very excited and began to boast about Fang Wang’s life achievements on a grand scale.<br/><br/>The Great Dark Demon Saint was also listening intently, curious about Fang Wang’s experiences.<br/><br/>Half an hour later.<br/><br/>The entire miniature heaven and earth was devoured by the Town World Bead, and the Sword Qi and Sword Intent hidden under the ground were also absorbed by Fang Wang.<br/><br/>Perhaps due to the presence of the Cang He Immortal Monarch, the Sword Qi and Sword Intent left by the Executioner Immortal Great Saint did not satisfy Fang Wang.<br/><br/>However, Fang Wang had other gains.<br/><br/>Above the firmament, Fang Wang stood on Xiao Zi’s head, toying with a black stone tablet in his hand that contained the Executioner Immortal Great Saint’s Cultivation Technique, which was what he currently needed the most.<br/><br/>He didn’t want Cultivation Techniques or secret techniques; he only wanted to collect them.<br/><br/>Cultivation was the foundation for Cultivators!<br/><br/>…<br/><br/>Time flies, fifteen years later.<br/><br/>From various directions in Kunlun, Cultivators were flying towards the mountaintop because Kunlun had not yet been fully constructed, thus, disciples were not allowed to climb but could only fly to the top.<br/><br/>How numerous are the Disciples of the Way of Hope now, and with this being the Dao Master’s first time lecturing to the entire sect, ninety percent of the disciples had returned, and those who hadn’t were almost all entangled in urgent matters.<br/><br/>On their way flying to the mountaintop, many Wangdao Cultivators were astonished by the grandeur of Kunlun.<br/><br/>“Who would have thought that we, the Wangdao Cultivators, would have such a vast number, and I simply can’t see through the auras of so many people.”<br/><br/>“It is said that the number of Wangdao Cultivators registered has already exceeded two million four hundred thousand, and that’s with thresholds put in place.”<br/><br/>“Kunlun really is becoming grander and more impressive, I’m truly looking forward to the days of Cultivation here in the future.”<br/><br/>“Look quick, isn’t that Aurora Ancestor Master Tang Hai? He’s actually joined Wangdao. It’s said that he has already achieved the True Soul Realm and might step into the Celestial Qiankun at any moment.”<br/><br/>“Currently, the positions for the Twelve Dao Sects of Wangdao are not yet full. Do you think this lecture might reveal other Dao Sects?”<br/><br/>The Wangdao Cultivators discussed excitedly as they flew towards the summit of Kunlun Mountain.<br/><br/>From high above, the Kunlun Mountains were now a sight of unparalleled majesty, with mountain ranges sprawled across the earth like the spine of an ancient dragon, stretching on endlessly, fully exhibiting the grandeur of the world’s foremost Daoist sect.<br/><br/>Atop the mountain peak, the Red Dust Sect had temporarily constructed a vast square that occupied a space ten miles in radius. Seen from afar, it resembled a colossal white jade disc, into which throngs of cultivators poured incessantly like a swarm of bees.<br/><br/>The Kunlun Lecture Hall!<br/><br/>Dugu Wenhun and the Red Dust Sect were leading disciples in maintaining order, while other Great Cultivators gathered in small groups, chatting idly among themselves.<br/><br/>Zhu Yan opened with a question, “Why isn’t Yang Du here?”<br/><br/>Fang Wang’s disciple Chu Yin answered, “He’s gone out to train with Ji Rutian and hasn’t returned yet.”<br/><br/>Thanks to his profound understanding of cultivation techniques, Chu Yin benefited the most after the establishment of the Heavenly Dao. Since practicing the Heavenly Dao Immensity Scripture, his cultivation speed had been unrivaled, making clear to all within Wangdao why he could become a Dao Master’s disciple.<br/><br/>Chu Yin was acutely aware of his own talent. On normal days, he scarcely practiced spells or divine skills, focusing solely on cultivation techniques. His Spiritual Power was already a thousand times that of others at the same level, an extraordinary exaggeration.<br/><br/>“Ji Rutian?” Zhu Yan raised an eyebrow, his gaze involuntarily shifting towards the distance.<br/><br/>Duan Tian was engaged in friendly conversation with a fellow sect member, his face beaming with joy. He too was demonstrating his innate abilities, recently making significant strides within Wangdao.<br/><br/>Aside from cultivating, Dugu Wenhun enjoyed concocting spectacles; creating titles such as the Ten Heroes of Wangdao, the Nine Hidden Dragons of Wangdao, the Holy Stars of Wangdao, and so on, which stimulated the disciples to healthy competition, the younger ones especially concerned with these reputations.<br/><br/>The Sword Immortal Xu Yan and Fang Bai, who inherited Fang Wang’s Sword Dao, stood together, discussing the Sword Dao while naturally exuding Sword Intent.<br/><br/>At that moment, Fang Wang’s nephew, Fang Jing, descended from the sky, landing beside them.<br/><br/>“Long time no see.”<br/><br/>Fang Jing grinned, his likeness to Fang Wang evident, yet his demeanor was more nonchalant, the very image of a carefree swordsman.<br/><br/>Upon seeing him, Fang Bai couldn’t help smiling, but sarcastically remarked, “Well, if it isn’t our Sword Hero Fang Jing. Where have you been playing the knight-errant lately?”<br/><br/>Fang Jing nodded to Xu Yan, then laughed and said to Fang Bai, “I’ve been to the edge of the Eastern Mortal Realm, and let me tell you, great changes are coming to the world soon.”<br/><br/>Fang Bai replied unenthusiastically, “The world has already changed greatly.”<br/><br/>“No, no, no. The changes will continue, because a Great Emperor is about to be reborn. And it’s not just the Great Emperor; his entire Divine Dynasty will be revived!” Fang Jing shook his head, speaking with an air of mystery.<br/><br/>This piece of news piqued the interest of both Fang Bai and Xu Yan.<br/><br/>Just as Fang Bai was about to ask further, a voice echoed throughout Kunlun:<br/><br/>“Everyone, please sit down. We will begin the lecture after the time it takes to burn one stick of incense.”<br/><br/>This was Fang Wang’s voice, commanding and authoritative. The new disciples hearing his voice for the first time were also struck with awe and quickly found places to sit down.<br/><br/>For a moment, the Kunlun Lecture Hall fell into a hush.<br/><br/>Xiao Zi, Zhao Zhen, and the Grand An Profound Turtle were in one corner. The Grand An Profound Turtle looked around and clicked his tongue in wonder, “Wangdao is no small feat. To gather such a formidable force in times like these is remarkable.”<br/><br/>Xiao Zi glanced at it and inquired, “In your view, how many disciples have the potential to become Great Saints or Great Emperors?”<br/><br/>The Grand An Profound Turtle shook its head, saying, “That’s a tough call.”<br/><br/>Meanwhile, far away.<br/><br/>The Reincarnation Sea, the Void Palace.<br/><br/>Xu Chonggua stood on the eaves of the Void Palace, gazing up at the sky filled with thunder and lightning.<br/><br/>At the other end of the eaves stood an old man, none other than the Solitary Life Elder who had once calculated the imperial fate for Hong Xian’er.<br/><br/>Hundreds of years earlier, Solitary Life Elder had candidly told Hong Xian’er that Fang Wang would become the future number one in the world.<br/><br/>“Are you prepared? If you fail, there will be no redemption,” the Solitary Life Elder spoke, his tone calm.\t\t\t\t\t\t</div>", "images": {}, "success": true}