{"id": 436, "url": "https://www.novelhall.com/i-became-an-immortal-on-mortal-realm-32879/15041932.html", "title": "Chapter 426 - Chapter 426: Chapter 423: Mysterious Absolute Emperor, Changes In The Mortal Realm", "volume": 5, "volume_title": "Volume 5", "body": "<h1>Chapter 426 - Chapter 426: Chapter 423: Mysterious Absolute Emperor, Changes In The Mortal Realm</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 426: Chapter 423: Mysterious Absolute Emperor, Changes in the Mortal Realm<br/><br/>“A person of heavenly destiny?” the Hongxuan Emperor asked in surprise.<br/><br/>He seemed to remember something, his face changing dramatically as he raised his hand to cast a spell and divine.<br/><br/>Zhou Xue did not speak again, her gaze turning towards the distance, the complex look in her eyes gradually turning into a singular shade of anticipation.<br/><br/>At that moment, fierce winds attacked from the end of the ocean ahead, forcing the Jin Xiao Sect Cultivators around the pavilion to raise their hands and channel their powers to resist.<br/><br/>Sudden celestial phenomena across the world startled everyone, and all the major powers started sending people to gather intelligence.<br/><br/>Elsewhere,<br/><br/>Fang Wang, accompanied by Xiao Zi and the Grand An Profound Turtle, arrived on Earth. After greeting Fang Wang, Xiao Zi quickly scampered away.<br/><br/>Fang Wang took the Grand An Profound Turtle into the bustling city. The skyscrapers of Earth’s cities had grown taller and more technologically advanced, with not only cars moving on the roads but also flying vehicles shuttling through the sky, a dazzling sight to behold.<br/><br/>The Grand An Profound Turtle was seeing such a Mortal Realm for the first time and its turtle eyes were filled with curiosity.<br/><br/>Fang Wang found he was most relaxed on Earth, and even the contemplation of merging with the Dao became smoother.<br/><br/>Perhaps, deep down, he longed to return to Earth, even if this Earth was not the one he came from.<br/><br/>Half a year later, Fang Wang only returned to Xuanzu’s World with the Grand An Profound Turtle and Xiao Zi.<br/><br/>Xiao Zi was reluctant to leave and pestered Fang Wang for a while, only agreeing to return to Earth in a hundred years and leaving contentedly with that promise.<br/><br/>Fang Wang meditated at the head of the bridge, the Grand An Profound Turtle crawled up beside him and said, “Your Majesty, the Xuandu Realm appears to be drained of Spiritual Energy, but its fate is steadily rising. It seems as if someone is scheming something.”<br/><br/>“It doesn’t matter, it’s one of our own,” Fang Wang said offhandedly.<br/><br/>He had also felt the changes on Earth and had deduced that it was Zhou Xue’s doing.<br/><br/>The Xuandu Great Saint forbade Earth’s Cultivation, and Fang Wang had agreed, but now that Zhou Xue was the one acting, he could not intervene.<br/><br/>Actually, he did not agree with Xuandu Great Saint’s concept either. Compromising all the time was like handing one’s fate to others. If one day the Immortal Court decided to destroy the Xuandu Realm, what should the Xuandu Great Saint do then?<br/><br/>“Originally, I thought it was only our world that was about to experience great turmoil, but now it seems that perhaps all the myriad worlds will do so. Your Majesty, is your traversal divine skill inherited from the Lingxiao Great Saint of the Lingxiao Divine Sect?” the Grand An Profound Turtle remarked with emotion.<br/><br/>“Have you seen the Lingxiao Divine Sect?”<br/><br/>“I have seen it once. He came traversing between realms, fought against the strongest person of that time, and ultimately prevailed, leaving behind his legacy before disappearing without a trace. In my view, the Lingxiao Great Saint is among the top one or two Great Saints I have seen, and perhaps only the Absolute Emperor could compare,”<br/><br/>When the Grand An Profound Turtle mentioned the Absolute Emperor, a hint of fear actually appeared in its eyes.<br/><br/>Fang Wang was interested and asked it to recount the deeds of the Absolute Emperor.<br/><br/>The Grand An Profound Turtle did not hold back. In the thirty to forty thousand years following the fall of the Hongxuan Emperor, the world faced a great upheaval seen once in a hundred thousand years, with Immortal Divines left in the Mortal Realm causing rampant chaos. This was also why the Descending Dragon Great Saint later rebelled against the Immortal Divines—in that era, Immortal Divines were the most malevolent presence in the Mortal Realm.<br/><br/>In times of despair, the Absolute Emperor emerged. No one knew his origin, no one knew his true identity. He only appeared for a few hundred years, eradicated the Immortal Divines, and effortlessly defeated all the strongest beings in the Mortal Realm, bringing peace to the chaos.<br/><br/>“At that time, I happened to see him, and wanted to have a chat with him. But when I appeared before him, I couldn’t utter a single word. His presence was too overwhelming, not even your former self, Your Majesty, could match him,” said the Grand An Profound Turtle, not taking Fang Wang’s feelings into account, as it was still immersed in the memory of the Absolute Emperor’s power.<br/><br/>Fang Wang was not offended; he never really considered himself to be the An Tian Emperor. He inquired, “What did the Absolute Emperor look like?”<br/><br/>The Grand An Profound Turtle pondered carefully and muttered, “Strange, I can’t seem to remember.”<br/><br/>Fang Wang was not disappointed; on the contrary, he was filled with fighting spirit.<br/><br/>“If the Absolute Emperor can traverse the world at will, he must not be dead yet. If I encounter him in the future and can exchange a few moves, that would be wonderful,” he mused.<br/><br/>However, he felt that to defeat the Absolute Emperor, he would first have to reach the level of the Heavenly Dao True Immortal that he had envisioned.<br/><br/>With the Heavenly Dao just established and currently only encompassing the Heavenly Dao Primary Origin Realm, he had to continuously perfect the Heavenly Dao and create higher realms. Only in this way could the Heavenly Dao truly transcend the Saint Dao and the Imperial Dao.<br/><br/>He was determined to make the Heavenly Dao stronger than the Saint Dao and Imperial Dao!<br/><br/>Half an hour later, the Grand An Profound Turtle burrowed into the waters of the lake, while Fang Wang continued on his path of integrating with the Dao.<br/><br/>Merging the Heavenly Dao Myriad Classic of Laws with the Taixuan Shenxiao Scripture was a difficult task, and Fang Wang had to devote himself completely.<br/><br/>As he closed his eyes, the sun and moon took their turns, the seasons changed, and the mountains and rivers also underwent subtle changes. Sword Heaven Marsh was bustling with activity each day, while the Kunlun opposite it grew taller and taller.<br/><br/>Occasionally, thunderclouds surged across the firmament, lasting from half a day to three days, signaling celestial phenomena that heralded the emergence of beings with great fortune.<br/><br/>Dugu Wenhun and Song Jinyuan would occasionally walk behind Fang Wang and seeing him so focused, they did not disturb him.<br/><br/>In the blink of an eye.<br/><br/>Fifty years in the mortal realm passed in an instant.<br/><br/>Fang Wang opened his eyes. Fifty years had gone by. Even though he had not been cultivating, the Heavenly Dao Myriad Classic of Laws could cultivate autonomously, and his Heavenly Dao Force had doubled. He temporarily did not want to divide the realm into minor stages, because as the creator, he was unclear about when he’d break through to a major realm.<br/><br/>“Just a little bit more, where am I lacking?” Fang Wang frowned, lost in thought.<br/><br/>He had wanted to continue his contemplation, but he feared missing something important, so he had already sent a message to Dugu Wenhun.<br/><br/>Soon, Dugu Wenhun arrived behind him and bowed in greeting.<br/><br/>“How goes Wangdao recently, and what of the state of the world?” Fang Wang asked.<br/><br/>Dugu Wenhun replied, “Wangdao is progressing smoothly. Xuan Zong, Buddhist Sect, Sword Sect, Divine Sect, Body Sect, Destiny Sect, and Saint Sect have all established complete orders and can stand on their own…”<br/><br/>The Destiny Sect was founded by Ji Rutian, while the Saint Sect was established by the Thousand Eyes Great Saint. Both sects were decreed by Fang Wang himself, although he had not shown himself when the sects were founded.<br/><br/>There are still five sects out of Twelve Dao Sects to go!<br/><br/>“Recently, the Body Sect has been making a lot of noise. The Primordial Unity Sect and the Taiqing Xuanjiao are all after him, but since he indeed committed an unjust act, claiming to take responsibility for his own actions, it is not good for us to intervene…” Dugu Wenhun said with a look of concern on his face discussing this matter.<br/><br/>The Body Sect was Yang Du, who possessed the Heavenly Body; he had always been a key focus of Fang Wang’s cultivation efforts.<br/><br/>Zhou Xue had said that in a previous life, Yang Du had reached the pinnacle of the mortal realm, and his ascension was achieved by stepping over him.<br/><br/>Fang Wang always remembered Yang Du’s destiny, so he was not surprised to hear of Yang Du’s actions.<br/><br/>Dugu Wenhun described Yang Du’s situation in detail. His strength had improved by leaps and bounds, his personality had changed drastically, and it had been a long time since he returned to Wangdao.<br/><br/>After discussing Yang Du, Dugu Wenhun then reported, “There is another matter. Gu Tianxiong passed away in peace thirty-four years ago. I wanted to inform you, but his daughter, Miss Gu Li, said there was no need to disturb you, and I saw that you were indeed busy with cultivation, so I didn’t mention it…”\t\t\t\t\t\t</div>", "images": {}, "success": true}