{"id": 433, "url": "https://www.novelhall.com/i-became-an-immortal-on-mortal-realm-32879/15039342.html", "title": "Chapter 423 - Chapter 423: Chapter 420: The 800-Year-Old Fang Wang!", "volume": 5, "volume_title": "Volume 5", "body": "<h1>Chapter 423 - Chapter 423: Chapter 420: The 800-Year-Old Fang Wang!</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 423: Chapter 420: The 800-Year-Old Fang Wang!<br/><br/>Hearing the question from Solitary Life Elder, Xu Chonggua did not lower his head but continued gazing at the firmament.<br/><br/>“I have done my utmost for this mortal realm; now, it’s time to pursue what I truly desire, even if it leads to an irreversible calamity, I must try,” Xu Chonggua said calmly.<br/><br/>Solitary Life Elder asked, “Even if it means ruin and disgrace?”<br/><br/>“I have a clear conscience.”<br/><br/>That was how Xu Chonggua replied, as if affirming a resolution to himself, his gaze turning resolute.<br/><br/>Solitary Life Elder revealed a smile, raised his hand in salute, and said with a laugh, “Then, I wish my fellow Daoist success in your heart’s desires and a smooth ascension to sainthood!”<br/><br/>Xu Chonggua’s lips curved upward, and he then leapt into the tumultuous thunderclouds above.<br/><br/>Boom—<br/><br/>The deafening sound of thunder reverberated over the Reincarnation Sea, stirring up massive waves.<br/><br/>Solitary Life Elder looked up and murmured, “The Emperor Saint resurrected, Immortal Divine descended, an unprecedented catastrophe looms—who is the cause of calamity, who is the savior.”<br/><br/>Having said this, he turned around, took a step, and disappeared into the sound of the wind.<br/><br/>…<br/><br/>The lecture at Kunlun lasted seven days and nights, during which all Wangdao Cultivators fasted, neither eating nor drinking.<br/><br/>Fang Wang did not just recount orally but also harnessed nature’s spiritual energy to help every Wangdao Cultivator catch the essence of cultivating the Heavenly Dao Immensity Scripture.<br/><br/>The lecture might have been seven days, but it surpassed the benefit of a hundred years of solitary study by the Wangdao Cultivators.<br/><br/>It was indeed as astonishing as that. Fang Wang not only mastered the Great Perfection of the Heavenly Dao Myriad Classic of Laws, but he was also the founder of the Heavenly Dao. His lecture was a grand opportunity for all beings.<br/><br/>After manipulating nature’s spiritual energy for seven whole days and precisely attending to more than two million Wangdao Cultivators, even Fang Wang, with his current level of cultivation, felt a hint of fatigue.<br/><br/>Thus, after concluding the lecture, Fang Wang left alone.<br/><br/>He returned to the wooden bridge where he usually stayed, to rest.<br/><br/>However, finding meditative sitting mundane, he took a step forth and, using The Heaven of Carefree Freedom, arrived on Earth.<br/><br/>The Earth had started exploring the stars by now, and even the Moon had established residential areas.<br/><br/>Fang Wang weaved through the bustling techno-cities, savoring the spiritual entertainment of modern society.<br/><br/>It was not until several years later that he returned to Xuanzu’s World.<br/><br/>He landed on the wooden bridge, crossed his legs, and sat down. Instead of immediately focusing on the cultivation techniques, he gazed at the lake, enjoying the scenery.<br/><br/>It wasn’t long before Song Jinyuan, leading another, approached him.<br/><br/>It was the Thousand Eyes Great Saint.<br/><br/>The flesh body of Thousand Eyes Great Saint appeared much older than decades before. He approached Fang Wang, took a deep breath, and said, “Dao Master, I have obtained the Taixuan Shenxiao Scripture.”<br/><br/>He had been in Sword Heaven Marsh for more than half a year, waiting because of Fang Wang’s absence.<br/><br/>Fang Wang raised his right hand, still with his back to Thousand Eyes Great Saint.<br/><br/>Thousand Eyes Great Saint waved his sleeve, and a long piece of red jade flew out, falling into Fang Wang’s hand.<br/><br/>“You seem to be in poor condition,” Fang Wang inquired.<br/><br/>He placed the red jade before him and then took out a black stone tablet that recorded the Executioner Immortal Great Saint Technique, also placing it in front of him. Under the sunshine, both treasures shimmered with differing lights.<br/><br/>Thousand Eyes Great Saint responded, “I encountered a powerful being in a desperate place, which drained some of my soul force, but that’s the lesser issue. The main problem is that my enemies took advantage of the situation to besiege me, resulting in the loss of more than two hundred of the Emperor Saint’s eyes. It seems some force is uniting those Great Saints and Great Emperors who have not completely perished. You’d better be careful.”<br/><br/>United?<br/><br/>Fang Wang couldn’t help but think of the Xuan You Great Teaching. Tai You from the Xuan You Great Teaching had once schemed against Hong Xian’er, and there was a mysterious being named Sword You who transmitted the Nine Lives Nirvana Sword Technique to Xu Yan. Both were Great Saints.<br/><br/>Could it be that a mysterious power was indeed uniting those unreconciled souls of Great Saints and Great Emperors?<br/><br/>It appeared the experiences he and Zhou Xue had in their previous lives were going to be entirely different.<br/><br/>Fang Wang spoke, “For now, you may reside here. I will arrange your position within Dao Sect later.”<br/><br/>Upon hearing this, Thousand Eyes Great Saint immediately relaxed, a smile appearing on his face. He raised his hand to pay his respects to Fang Wang and then said, “Among those enemies of mine, the leader is Reincarnation Great Saint.”<br/><br/>“Hmm, I’ll remember that, you can go find Xuan Zong and tell him everything you’ve encountered, his Divine Skills are no less formidable than a Great Saint’s,” Fang Wang replied.<br/><br/>Upon hearing this, Thousand Eyes Great Saint raised an eyebrow, then turned and left.<br/><br/>Fang Wang, however, turned his attention to the two peerless techniques in front of him.<br/><br/>Which one should I practice first?<br/><br/>Is it the Taixuan Shenxiao Scripture, the number one Divine Skill of all times, or the Executioner Immortal Great Saint Technique?<br/><br/>He would inevitably learn both techniques; it was merely a matter of which to start with.<br/><br/>Without a doubt, the Taixuan Shenxiao Scripture would take the longest time, and Fang Wang couldn’t even be sure how long it would need.<br/><br/>He didn’t start right away, instead he looked towards Kunlun.<br/><br/>Although he hadn’t built Kunlun himself, it was definitely his pride; the actions of Tiangong Sect also pleased him greatly, as this was indeed the Kunlun he had envisioned.<br/><br/>He began to fantasize about standing on the top of Kunlun Mountain one day, looking down upon the Mortal Realm.<br/><br/>Once he sat down, several days passed by.<br/><br/>Suddenly, Xiao Zi burst out from the mist of Spiritual Energy, flying all the way to Fang Wang, interrupting his thoughts.<br/><br/>“Master, you’ve finally returned, almost missing it!” exclaimed Xiao Zi excitedly.<br/><br/>Fang Wang touched its Dragon Head and asked, “Missing what?”<br/><br/>“This year you turn eight hundred years old!” Xiao Zi said with a laugh.<br/><br/>“Eight hundred years…”<br/><br/>Fang Wang felt a little dazed.<br/><br/>Xiao Zi proudly smiled and said, “Master, have you been cultivating for so long that you forgot this fact? Unknowingly, you’re already eight hundred years old; you can no longer be considered a prodigy, you are now a renowned figure of the Heavenly Dao.”<br/><br/>It secretly thought to itself, The master must be moved that I remembered his birthday!<br/><br/>Little did it know, what Fang Wang was reflecting on wasn’t the fact that he was eight hundred years old.<br/><br/>He didn’t even feel old; on the contrary, he felt very young.<br/><br/>Every time he secluded himself for cultivation in the Heavenly Palace, he would keep track of the time on paper, just numbers. He had accumulated over four hundred and ten thousand years inside the Heavenly Palace!<br/><br/>In today’s myriad worlds of the Mortal Realm, is there any creature that has lived for four hundred and ten thousand years?<br/><br/>Even the Grand An Profound Turtle might not have lived this long, because it wasn’t sure how long it had been alive, nor how much time had passed since the Grand An Divine Dynasty.<br/><br/>Time tends to blur many things.<br/><br/>Fang Wang, whose real age exceeded four hundred and ten thousand, had every right to look down upon all Great Saints and Great Emperors.<br/><br/>Even if Great Saints conspired against him in secret, he didn’t fear them.<br/><br/>Fang Wang’s heart gradually became enlightened, as if he found a kind of conviction.<br/><br/>“Master, shall we return to Earth to celebrate a bit?” Xiao Zi asked expectantly.<br/><br/>Fang Wang smiled, “So that’s why you were waiting here for me.”<br/><br/>Xiao Zi began to act coquettishly.<br/><br/>“Let’s do it in a few days,” Fang Wang contemplated.<br/><br/>Upon hearing this, Xiao Zi instantly rejoiced, promptly thanking Fang Wang, as if it were its own birthday.<br/><br/>Fang Wang had been on Earth in the previous years. Although Xiao Zi had been absent for a long time, the Dragon God Sect still held significant influence. Xiao Zi likely wanted to return not only for itself but also because it missed its demon followers.<br/><br/>A stick of incense later, Xiao Zi finally left, exhilarated.<br/><br/>Fang Wang wiped the water droplets off his face, then picked up the red jade, ready to start cultivating the Taixuan Shenxiao Scripture!<br/><br/>Who knows what might happen tomorrow? He must seize the time to become stronger; otherwise, he wouldn’t live up to his four hundred and ten thousand years of age!\t\t\t\t\t\t</div>", "images": {}, "success": true}