{"id": 439, "url": "https://www.novelhall.com/i-became-an-immortal-on-mortal-realm-32879/15047977.html", "title": "Chapter 429 - Chapter 429: Chapter 426: The Nine Heavens Great Saint, The Method To Become An Immortal!", "volume": 5, "volume_title": "Volume 5", "body": "<h1>Chapter 429 - Chapter 429: Chapter 426: The Nine Heavens Great Saint, The Method To Become An Immortal!</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 429: Chapter 426: The Nine Heavens Great Saint, The Method to Become an Immortal!<br/><br/>When the world shook, Fang Wang concentrated on his cultivation.<br/><br/>With the mastery of Great Perfection, it didn’t take long to practice the Taixuan Shenxiao Scripture for one Heavenly Cycle.<br/><br/>The giant hand hovering in front of Fang Wang trembled slightly. The waves into which the arm had plunged were also surging, and the mysterious being hidden inside seemed to be enduring unimaginable pain.<br/><br/>After a while, the giant hand dissolved into seawater and fell into the ocean.<br/><br/>The rising waves that followed crashed down, leaving behind only the raging spiritual energy storm continuing its havoc.<br/><br/>Half an hour later, Fang Wang completed one Heavenly Cycle of the Taixuan Shenxiao Scripture. The Shenxiao Sun descended upon the earth, raising a tremendous hot mist over the sea.<br/><br/>He opened his eyes, and the Shenxiao Sun in the sky suddenly disappeared.<br/><br/>He then spoke, “Your Excellency has been observing for quite some time. It is time to appear, may I inquire your name?”<br/><br/>As his voice faded, the space between the heaven and sea fell into silence.<br/><br/>In front of Fang Wang, a figure started to take form within the hot mist. He did not step out from within it; he stayed at a distance, watching Fang Wang from afar.<br/><br/>“Taixuan Shenxiao Scripture, a rarity to witness in ten thousand years, not to mention cultivated to such an extent, is absolutely unprecedented.”<br/><br/>A mysterious voice emerged, filled with amazement.<br/><br/>Fang Wang was not surprised that the other could recognize his cultivation technique since it was clear the other was no less than a Great Saint or an Emperor.<br/><br/>“This Great Saint here is the Nine Heavens Great Saint, who has also practiced the Taixuan Shenxiao Scripture, only I have not been able to delve into its profound mysteries. I did not expect that I would be able to witness the Great Completion of the Taixuan Shenxiao Scripture.”<br/><br/>Nine Heavens Great Saint!<br/><br/>Fang Wang had never heard the name, but given the title of Great Saint, he was certainly no ordinary being.<br/><br/>“May I ask why the Great Saint continually bestows power upon the Mortal Realm without showing himself?” Fang Wang questioned the Nine Heavens Great Saint.<br/><br/>The Nine Heavens Great Saint answered, “Naturally, it is to assist with the elevation of this world’s fate. Once the timing is ripe, this Saint will resurrect and descend upon the mortals.”<br/><br/>“You must be the Wangdao Master who founded the Heavenly Dao. This Saint cannot fathom your aura, unable to calculate your karmic consequences, but the strength of your fate is absolutely the first in this era.”<br/><br/>“Even if the person destined for this era successfully claims the great fate, I fear they would not match up to you.”<br/><br/>“This Saint surmises that you have inherited the grand fate of the Grand An Divine Dynasty.”<br/><br/>“With the fate of the Grand An Divine Dynasty, coupled with the Taixuan Shenxiao Scripture, Wangdao Master, you are the variable in this myriad of worlds.”<br/><br/>Listening to the Nine Heavens Great Saint, Fang Wang remained unmoved. He chose this place for cultivation firstly to stay away from Descending Dragon Continent and secondly to confirm the identity of the powerful being here.<br/><br/>Before he achieved Heavenly Dao True Immortal, he would not allow Immortal Divines to descend prematurely.<br/><br/>Fang Wang asked, “I dare to ask if the Great Saint stands on the side of the Mortal Realm or if he believes in the Immortal Divine?”<br/><br/>The Nine Heavens Great Saint responded, “If this Saint believed in the Immortal Divine, how would I have fallen to such a state?”<br/><br/>Fang Wang found it reasonable. He then stood up, prepared to leave.<br/><br/>The Nine Heavens Great Saint spoke again, “Wangdao Master, whence comes the Divine Skill you used on this Saint previously?”<br/><br/>Fang Wang answered, “The Eighteen Layers of Abi Hell, have you ever heard of it?”<br/><br/>The Nine Heavens Great Saint was stunned.<br/><br/>Fang Wang turned around, lifting his right foot.<br/><br/>The Nine Heavens Great Saint hurriedly said, “The surge in the Mortal Realm’s fate is beyond belief. When the Heavenly Gate opens, it will not be just one Immortal Divine that arrives. This Saint suspects that a host from the Upper Realm will descend, and they might even initiate a great purge upon the Mortal Realm, just as they once did with the remnants of the Grand An Divine Dynasty.”<br/><br/>“It’s been heard that you wish to create a method for ascension to immortality in the Mortal Realm. To the Upper Realm, this is a great provocation, and you will face the wrath of the Immortal Divine.”<br/><br/>With his back turned to the Nine Heavens Great Saint, Fang Wang waved his hand, leaving behind two words before disappearing into the air:<br/><br/>“It’s alright.”<br/><br/>Hidden within the hot mist, the Nine Heavens Great Saint lapsed into silence. After a long time, he laughed softly and then disappeared as well.<br/><br/>Splash——<br/><br/>The waves crashed down, causing the ocean to ripple in layers upon layers, ultimately flowing toward the cliff known as The Edge of the Sky.<br/><br/>…<br/><br/>Fang Wang returned to the wooden bridge. The Taixuan Shenxiao Scripture had always belonged to this Mortal Realm, so it was not a creation. However, the Great Perfection version of the Taixuan Shenxiao Scripture was too powerful, and the commotion it caused had not yet dissipated.<br/><br/>Looking up at the sky, he saw the clouds torn into strips by the wind, resembling dragons, all headed in the same direction—spectacular to the extreme.<br/><br/>“Great Saints, Great Emperors, Immortal Divines…”<br/><br/>Fang Wang had already felt how chaotic the future would be, yet his heart was filled with fighting spirit.<br/><br/>The more numerous and powerful the enemies, the more they would prove the value of a Heavenly Dao True Immortal!<br/><br/>Fang Wang suppressed his excited emotions and began to close his eyes.<br/><br/>The integration of the Heavenly Dao Myriad Classic of Laws with the Taixuan Shenxiao Scripture was at its final step, and he was eager to achieve the status of Heavenly Dao True Immortal!<br/><br/>By then, he would freely display his strength, and he wanted to make the name of Heavenly Dao True Immortal renowned throughout all the worlds!<br/><br/>Meanwhile.<br/><br/>On a pavilion several miles away, Hong Chen stood at the edge, calculating with his fingers, his face full of complex expressions.<br/><br/>“Taixuan Shenxiao Scripture…”<br/><br/>The Thousand Eyes Great Saint had not revealed the existence of the Taixuan Shenxiao Scripture to a second person; Hong Chen also did not know that the Taixuan Shenxiao Scripture had already fallen into Fang Wang’s hands.<br/><br/>The karmic repercussions of the Taixuan Shenxiao Scripture were beyond even Hong Chen’s ability to calculate.<br/><br/>He was no longer the almighty Red Dust Celestial Emperor of the past.<br/><br/>Hong Chen began to change his hand seals, using both hands to calculate, this time focusing on the Immortal Divines of The Upper Realm.<br/><br/>Illusory lights burst forth between his palms, mysterious and divine, when suddenly, his expression changed, revealing a look of hatred in his eyes.<br/><br/>“Nine-Faced Divine Net…”<br/><br/>Hong Chen ground his teeth as he spat out the four words.<br/><br/>Boom!<br/><br/>A thunderbolt struck down, flashing through heaven and earth, as if warning him not to utter that name.<br/><br/>Hong Chen was but a microcosm of the world below; from the Great Saints and Great Emperors lurking in the shadows to the ordinary Cultivators, all were concerned about the calamities of the future on this day.<br/><br/>Fang Wang would not concern himself with these things, especially after he began to focus solely on his path of enlightenment.<br/><br/>Days passed swiftly.<br/><br/>In the blink of an eye.<br/><br/>Another five years had gone by!<br/><br/>That day, under Fang Wang’s legs, golden light erupted, one ring after another, like golden lotuses blossoming.<br/><br/>His consciousness suddenly plunged into the Heavenly Palace.<br/><br/>He opened his eyes to look at the Heavenly Palace and did not begin to cultivate immediately. Under his gaze, figures began to take shape.<br/><br/>There were a total of eight, including the True God of the Heavenly Palace!<br/><br/>The other seven looked exactly like Fang Wang, differing only in their garments and makeup.<br/><br/>They looked at Fang Wang, all showing expressions of satisfaction and anticipation.<br/><br/>The True God of the Heavenly Palace was the first to speak, “You’ve finally reached this step, one that we could not attain.”<br/><br/>The other Fang Wangs spoke up in turn, each with a different tone:<br/><br/>“Hahaha, I didn’t expect the path I initially envisioned could actually succeed.”<br/><br/>“Heh, if I hadn’t passed on my will to you, how could this day have come?”<br/><br/>“In my view, our contributions aren’t significant. It’s mainly because the path he walks is different from ours. The Heavenly Dao is just our ideal. How to realize it is what’s most important.”<br/><br/>“Can a second path to becoming an Immortal truly be taken?”<br/><br/>“The Immortal Divines we’ve seen are nothing more than puppets under certain rules. The carefree Immortal Divines are a pleasant fantasy. But now, he might be able to achieve it.”<br/><br/>Watching the eight versions of himself excitedly discussing, Fang Wang felt a strange sensation stirring inside him, one he couldn’t quite articulate.\t\t\t\t\t\t</div>", "images": {}, "success": true}