{"id": 431, "url": "https://www.novelhall.com/i-became-an-immortal-on-mortal-realm-32879/15034604.html", "title": "Chapter 421 - Chapter 421: Chapter 418: Cang He Immortal Monarch, Confronting The Immortal Divine", "volume": 5, "volume_title": "Volume 5", "body": "<h1>Chapter 421 - Chapter 421: Chapter 418: Cang He Immortal Monarch, Confronting The Immortal Divine</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 421: Chapter 418: Cang He Immortal Monarch, Confronting the Immortal Divine<br/><br/>The Great Dark Demon Saint had been immersed in the power of the Great Returning Void Palm, but when he heard Fang Wang’s words, he snapped to his senses, immediately scanning his surroundings with vigilance.<br/><br/>He was very sensitive to the word “Immortal.”<br/><br/>Ahead, there were no longer any corpses or souls to be seen, and the area had fallen into a deep silence.<br/><br/>Fang Wang raised his right hand, condensing his Lifespirit Treasure.<br/><br/>Town World Bead!<br/><br/>The bead formed in the palm of his hand and swiftly rose, then exploded with terrifying devouring power, causing wild winds to sweep through the heavens and earth, the ground to shatter, and rocks and dust to rise and spiral towards the Town World Bead.<br/><br/>“That is…”<br/><br/>The Great Dark Demon Saint’s gaze fell on the Town World Bead, eyes filled with terror.<br/><br/>He could feel that not only the visible objects were being devoured by the Town World Bead, but even the Spiritual Energy and the even more elusive powers of the heavenly and earthly rules were being consumed.<br/><br/>As Fang Wang achieved the Heavenly Dao Primary Origin Realm, his Lifespirit Treasure also grew stronger with his breakthrough, now even capable of devouring the rules that constituted the small celestial world.<br/><br/>“Junior, without having entered the Saint Realm, how can you devour the rules of heaven and earth?” a mysterious voice asked.<br/><br/>It was not the voice of the Executioner Immortal Great Saint, but another voice.<br/><br/>A voice completely unfamiliar to Fang Wang.<br/><br/>The Grand An Profound Turtle cried out in shock, “It’s you, Cang He Immortal Monarch!”<br/><br/>Immortal Monarch?<br/><br/>Both the Great Dark Demon Saint and Xiao Zi were startled.<br/><br/>Xiao Zi hurriedly looked at the Grand An Profound Turtle and asked, “Who is Cang He Immortal Monarch?”<br/><br/>The Grand An Profound Turtle, with a trembling voice, said, “He is the Immortal Divine that the Executioner Immortal Great Saint slew, his father descended to the Mortal Realm to kill the Executioner Immortal Great Saint and even resurrected him, I thought he had been taken back to The Upper Realm by his father, but he was actually hiding in the Mortal Realm.”<br/><br/>As its words fell, the earth shook again, and the already broken surface split further, a vast Ghost Qi rising up and rapidly condensing into a tall figure in the air, becoming more solid by the moment.<br/><br/>Fang Wang did not attempt to stop it, but calmly watched him.<br/><br/>Cang He Immortal Monarch’s figure was a hundred zhang tall, gradually forming the shape of armor on his body as if a War God was being resurrected.<br/><br/>“Your Majesty, quickly kill him, his momentum is increasing at an alarming rate, we can’t let him continue to grow stronger!” the Grand An Profound Turtle urgently advised.<br/><br/>Fang Wang calmly replied, “It’s fine.”<br/><br/>He did not regard Cang He Immortal Monarch as a threat at all.<br/><br/>If Cang He Immortal Monarch truly could be invincible in the Mortal Realm, why wouldn’t the Immortal Court let him come to eliminate Fang Wang?<br/><br/>Either Cang He Immortal Monarch’s strength wasn’t enough, or he had already lost contact with the Immortal Court.<br/><br/>Even if it was the latter, Fang Wang was unafraid.<br/><br/>No matter who your father is, if you provoke me, killing you is the same!<br/><br/>Fang Wang was even more curious as to whether the ancestral tomb of the Executioner Immortal Great Saint was a trap set by Cang He Immortal Monarch, or if the Executioner Immortal Great Saint and Cang He Immortal Monarch had long been in cahoots.<br/><br/>Even if the Immortal Divine resurrected Cang He Immortal Monarch, why choose the Executioner Immortal Great Saint’s tomb?<br/><br/>Seeing Fang Wang so confident, Xiao Zi breathed a sigh of relief, the Grand An Profound Turtle struggled with his words, but ultimately held back.<br/><br/>The Great Dark Demon Saint stood behind, looking up nervously at Cang He Immortal Monarch.<br/><br/>He, too, was a Great Saint; every Great Saint had faced Immortal Divines, and he was certain that this Cang He Immortal Monarch was a true Immortal Divine, not just someone who had acquired the power of an Immortal Divine.<br/><br/>This Immortal Divine was stronger than the ones he had faced before!<br/><br/>His gaze involuntarily shifted to Fang Wang, wondering what gave Fang Wang the confidence to face an Immortal Divine.<br/><br/>He thought back to the dominating power of the Great Returning Void Palm, his eyes revealing a look of expectation.<br/><br/>This moment, he made up his mind.<br/><br/>As long as Fang Wang could defeat the Immortal Divine, he would lead the Demon Race into Fang Wang’s Celestial Phenomenon!<br/><br/>Soon, Cang He Immortal Monarch revealed his true form, clad in Dark Golden Chainmail, draped in a white cloak, his waist wrapped with a flowing cloud red sash, feet donned in Qilin boots—his whole being exuded an unrivaled imposing aura. A bright halo gradually emitted from behind his head, resembling a golden circle, casting a brilliant sunshine beam as if it was the sun itself, enlightening the land.<br/><br/>The visage of Cang He Immortal Monarch was handsome, his brows marked with two fine lines from perpetual frowning, only adding to his dignified appearance.<br/><br/>He lifted his chin, looked down on Fang Wang, and said, “Mortal, do you think you can stand against this monarch without concern?”<br/><br/>Fang Wang countered, “Is this opportunity the scheme of Executioner Immortal Great Saint, or yours?”<br/><br/>“The opportunity you face is indeed his original intention, but the divided soul has long been separated from the main soul. Here, this monarch is the ruler, and he, for a glimmer of life, willingly offered the main soul to this monarch in exchange for the Immortal Court’s absolution of past faults. After all, not every Great Saint can survive long, and there are plenty whose bodies die and their paths vanish.”<br/><br/>The tone of Cang He Immortal Monarch was indifferent, as if speaking of something that didn’t concern him.<br/><br/>Fang Wang nodded, “Understood.”<br/><br/>Cang He Immortal Monarch raised his right hand, condensing a sword—it was the Ghost Qi Sword. He pointed it from afar at Fang Wang, his gaze fixated on the Town World Bead, and whispered, “Such a powerful Lifespirit Treasure, even if placed in The Upper Realm, is extremely rare. Mortal, your physical body is claimed by this monarch, and this monarch will treat your companions well, in return for your exceptional talent.”<br/><br/>As soon as these words fell, he swung his sword fiercely.<br/><br/>The sword light flashed!<br/><br/>The Town World Bead suspended in the firmament was annihilated in an instant, and a tyrannical storm wreaked havoc in all directions. The Grand An Profound Turtle and Xiao Zi held tightly onto Fang Wang’s shoulders, while the robes of Fang Wang and the Great Dark Demon Saint billowed wildly.<br/><br/>Seeing Cang He Immortal Monarch destroy the Town World Bead with a single strike, Grand An Profound Turtle and Xiao Zi were nearly scared to death.<br/><br/>The Great Dark Demon Saint immediately drew out his own Magical Artifact—it was a purple umbrella wrapped in Demonic Qi, with a little demon perched menacingly at the top.<br/><br/>After annihilating the Town World Bead, Cang He Immortal Monarch looked down at Fang Wang. He didn’t waste any more words and lifted the ghostly great sword in his hand, swinging it towards Fang Wang.<br/><br/>Suddenly, his movement came to a halt.<br/><br/>Fang Wang followed by raising his hand, grabbing at the air.<br/><br/>Great Returning Void Palm!<br/><br/>This time, after Cang He Immortal Monarch turned to ash, the entire firmament plunged into darkness in an instant!<br/><br/>With this palm, Fang Wang didn’t hold back, hence he didn’t deliberately spare the small celestial phenomenon.<br/><br/>The world suddenly became quiet!<br/><br/>One could hear a pin drop!<br/><br/>The Great Dark Demon Saint still maintained a combat-ready stance, while the hearts of Grand An Profound Turtle and Xiao Zi leaped to their throats.<br/><br/>“This…”<br/><br/>Even Grand An Profound Turtle, who had pegged Fang Wang as An Tian Emperor, was shocked, unable to express his feelings at that moment.<br/><br/>Xiao Zi was also stunned. Seeing the Town World Bead destroyed, it panicked. It hadn’t expected that Fang Wang could obliterate Cang He Immortal Monarch with a single palm.<br/><br/>It couldn’t help but complain coquettishly, “Young master, you are so bad, messing with our mentality!”<br/><br/>Fang Wang’s mouth curled in a smirk. It wasn’t that he intended to appear weak; Cang He Immortal Monarch did indeed destroy his Town World Bead, but it didn’t mean he could defeat him.<br/><br/>That instant before, Fang Wang had first cast Eighteen Layers of Abi Hell, casting Cang He Immortal Monarch into an Illusionary Realm in a blink, then he fully unleashed the Great Returning Void Palm.<br/><br/>It might have looked like an instant kill, but he had used his full strength!<br/><br/>Of course, he wouldn’t disclose this.<br/><br/>Thump!<br/><br/>The Great Dark Demon Saint suddenly knelt down, saying in a deep voice, “The Demon Race is willing to enter the Heavenly Dao Spiritual Image!”<br/><br/>As he spoke these words, his voice trembled. He wasn’t afraid, on the contrary, his face was filled with excitement and surprise.\t\t\t\t\t\t</div>", "images": {}, "success": true}