{"id": 435, "url": "https://www.novelhall.com/i-became-an-immortal-on-mortal-realm-32879/15041931.html", "title": "Chapter 425 - Chapter 425: Chapter 422: The Chosen One", "volume": 5, "volume_title": "Volume 5", "body": "<h1>Chapter 425 - Chapter 425: Chapter 422: The Chosen One</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 425: Chapter 422: The Chosen One<br/><br/>“`<br/><br/>Hu hu——<br/><br/>The wind over the lake brushed against Fang Wang’s face, causing a slight change in his numb yet piercing gaze.<br/><br/>The thunderclouds in the sky were still surging, and the mysterious pressure that enveloped the Mortal Realm continued. It was unknown which esteemed figure was facing a great transformation, but as they were still in their striving, Fang Wang had spent another eighteen thousand years within the Heavenly Palace.<br/><br/>It took eighteen thousand years to finally reach Great Perfection with the Executioner Immortal Zi Xia Sword!<br/><br/>This was enough to show the power of the Executioner Immortal Zi Xia Sword!<br/><br/>The Heavenly Dao Myriad Classic of Laws had already allowed Fang Wang to create a completely new path of cultivation, and he believed that if he could also integrate the Taixuan Shenxiao Scripture, then rivaling the Immortal Divine would not be difficult.<br/><br/>And the power of the Executioner Immortal Zi Xia Sword made his Heavenly Dao even more capable of devastating attack.<br/><br/>“Heavenly Dao True Immortal…”<br/><br/>Fang Wang murmured to himself. He did not immediately activate the Taixuan Shenxiao Scripture or the Executioner Immortal Zi Xia Sword.<br/><br/>This time, he planned to hide his powers, since the chance for ascension was not far off.<br/><br/>He closed his eyes and began to think about how to integrate the Taixuan Shenxiao Scripture with the Heavenly Dao Myriad Classic of Laws.<br/><br/>Meanwhile, the entire world was discussing the sudden and mysterious phenomena of heaven and earth. Such events were becoming increasingly frequent, so much so that even mortals could feel the urgency of the great trend of the world.<br/><br/>All the people in the world were curious about what powerful being would emerge, unaware that Fang Wang had already practiced the most formidable Divine Skill from ancient times to the present. He even began to advance towards the Immortal Law he desired.<br/><br/>…<br/><br/>In the dark world, Ji Rutian hovered above the ruins, his gaze towards the mountaintop where a figure was suspended in the air, surrounded by strange black qi. Thousands of lightning bolts were entwining around the figure, causing it to emit pitiful roars.<br/><br/>Ji Rutian furrowed his brows, his eyes full of concern.<br/><br/>The figure tormented by the lightning bolts was Yang Du. His flesh was continually dissolving and regenerating, barely enduring because of his Heavenly Body.<br/><br/>The black qi circulating around him kept seeping into his body, and instead of dispersing with his dissolving flesh, it seemed to be merging into his bones.<br/><br/>“Ah——”<br/><br/>A cry of agony filled Yang Du’s voice.<br/><br/>Upon hearing this, Ji Rutian immediately leaped forward, wishing to help Yang Du.<br/><br/>Yang Du raised his hand to stop him, even as his right hand was dripping with blood, revealing grisly white bones, and his voice followed, “Don’t come over! I can still handle it!”<br/><br/>Ji Rutian said in a deep voice, “Without this chance, we can still find another way!”<br/><br/>Yang Du, his face covered in blood, laughed tragically. He spoke coldly, “How long have we been trapped here… You know very well… We simply cannot escape… Only by mastering this power… can we break free… It’s not that I care about honor; it’s that you simply cannot withstand this power… Only I have hope. What I want is not for you to escape, but for myself to fight!”<br/><br/>Ji Rutian fell silent, his hands clenched tightly within his sleeves.<br/><br/>Truth be told, he hadn’t originally cared about Yang Du’s life or death, but seeing Yang Du in such a tragic state, he couldn’t help but feel anxious. He felt that his frustration stemmed more from his unwillingness to be weak, to be a burden at such a crucial moment.<br/><br/>Meanwhile, Yang Du, enduring the pain, also cursed inwardly.<br/><br/>Along the way, he had entertained many dark thoughts and had even wanted Ji Rutian to endure this power. Yet, the moment he saw Ji Rutian injured, he immediately intervened, taking his place.<br/><br/>He thought he was foolish.<br/><br/>Even if Ji Rutian failed, so what? He could use his death to gauge the strength of this mysterious power.<br/><br/>Forget it!<br/><br/>Here goes everything!<br/><br/>“`<br/><br/>Yang Du no longer dwelled on his thoughts and focused on enduring this force. He began to operate his cultivation technique, harnessing spiritual power to aid his bones in merging with the mysterious black mist.<br/><br/>He was the Heavenly Body after all!<br/><br/>He didn’t notice that behind him a clump of black mist was gathering.<br/><br/>Some time passed.<br/><br/>Ji Rutian, who had been attentively watching Yang Du, sensed something was amiss. His pupils suddenly dilated and he hastily shouted, “Watch out behind you!”<br/><br/>Upon hearing this, Yang Du instinctively turned his head and saw a face emerging from the black mist behind him, startlingly resembling the countenance of Xu Chonggua.<br/><br/>Instinctively trying to dodge, Yang Du was horrified to find that the black mist had entwined around him like chains, rendering him immobile.<br/><br/>The head of Xu Chonggua violently plunged into Yang Du’s chest, merging into his flesh and blood.<br/><br/>Thump, thump!<br/><br/>In an instant, a series of intense heartbeats reverberated through the entire dim world.<br/><br/>Ji Rutian’s complexion changed drastically, he involuntarily stepped back. A strange vertical eye emerged on his forehead, shooting out a beam of strong light that scattered the black chains which appeared out of nowhere, advancing directly towards Yang Du, only to be blocked by the eerie black mist.<br/><br/>“What’s happening?”<br/><br/>A voice erupted near Ji Rutian’s ear, brimming with surprise and anger.<br/><br/>Ji Rutian hurriedly explained in his mind, narrating their current plight.<br/><br/>The vertical eye on his forehead locked onto Yang Du, its pupil quivering incessantly, as if it saw something unimaginable.<br/><br/>“Run! Run quickly!”<br/><br/>Hearing the voice of the elder, Ji Rutian turned pale with shock, and then he found himself uncontrollably falling backward, tumbling into a black spatial rift.<br/><br/>In a daze, Ji Rutian caught a glimpse of Yang Du’s body beginning to swell, deformed and uncanny.<br/><br/>…<br/><br/>Above the azure ocean, a crimson pavilion flew swiftly with a group of cultivators following, each emanating an extraordinary aura.<br/><br/>On the second-floor balcony of the pavilion, Zhou Xue stood shoulder to shoulder with the Hongxuan Emperor, gazing into the distance.<br/><br/>The Hongxuan Emperor was calculating with his fingers and marveled, “Another Great Emperor’s fate is stirring. This time, it’s different from your previous dozens of incarnations, even more perilous. Competing for the ascent quota will be even harder, and the Immortal Court’s wariness of Xuanzu’s World will only deepen. They might not bestow ascent quotas to the Mortal Realm.”<br/><br/>Zhou Xue’s gaze remained calm as she said, “No, the more chaotic Xuanzu’s World is, the more quotas the Immortal Court will provide. They cannot eradicate Xuanzu’s World, so they will keep on co-opting the leaders of Mortal Realm’s great powers and emperors.”<br/><br/>“To manipulate the Mortal Realm?” asked the Hongxuan Emperor, raising an eyebrow.<br/><br/>Zhou Xue did not respond, but her meaning was clear.<br/><br/>The Hongxuan Emperor looked at her thoughtfully and remarked, “You won’t join the Immortal Court, will you? I can only see the place where I reside and cannot pry into the Mortal Realm. I am unaware of what you have all been through.”<br/><br/>Zhou Xue gave him a glance and stated, “The less you know, the better it is for you.”<br/><br/>The Hongxuan Emperor chuckled and then changed the subject, asking, “What do you think of the Heavenly Dao that youngster established? It must have alarmed the Immortal Court. When the Heavenly Gate opens, it won’t be just one Immortal Divine that descends, and it might even disturb those terrifying beings in the Immortal Court.”<br/><br/>“The Heavenly Dao is unfathomably profound, indeed a great fortune. I cannot see through it, and now I can’t determine his future. However, I believe in him. He has never let me down; on the contrary, no matter how highly I regard him, he always surprises me with his strength,” Zhou Xue responded, prompting the Hongxuan Emperor to nod in agreement.<br/><br/>Just then, thunderclouds began to swirl in the sky again, with an aggressive momentum.<br/><br/>The Hongxuan Emperor couldn’t help but curse, “Who is it this time? Great Emperors, Great Saints, can’t they stay settled without popping out of their coffins like jack-in-the-boxes?”<br/><br/>Zhou Xue seemed to sense something, her eyes narrowing as she murmured to herself, “He has awakened, the man of destiny.”\t\t\t\t\t\t</div>", "images": {}, "success": true}