{"id": 438, "url": "https://www.novelhall.com/i-became-an-immortal-on-mortal-realm-32879/15044665.html", "title": "Chapter 428 - Chapter 428: Chapter 425: The Dao Master’S Opponent", "volume": 5, "volume_title": "Volume 5", "body": "<h1>Chapter 428 - Chapter 428: Chapter 425: The Dao Master’S Opponent</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 428: Chapter 425: The Dao Master’s Opponent<br/><br/>“Surname Fang?”<br/><br/>Hearing Lord of the Golden Command’s words, the Doom God’s tone turned sinister, and he followed up, “The mortal who offended this god also carries the surname Fang. Could it be the same person? Lord, this child has already been deemed a calamity to the Mortal Realm by His Majesty, you should not forcefully protect him.”<br/><br/>After listening, Lord of the Golden Command shook his head with a wry smile, “Not at all, not at all. This Fang’s Fate is not prominent, how could he possibly be your enemy? Your enemy has already become renowned throughout the world, naturally having the most prominent Fate among mortals.”<br/><br/>Upon hearing this, the Doom God’s overbearing aura suddenly retracted quite a bit, and he responded before disappearing on the spot:<br/><br/>“If that’s the case, then this god will turn a blind eye, sparing that mortal with the surname Fang’s life.”<br/><br/>Lord of the Golden Command turned back to the Golden Stele in front of him, beginning to mutter something under his breath.<br/><br/>The mysterious characters on the Golden Stele were still squirming, all drilling towards one area, a rather magnificent sight.<br/><br/>…<br/><br/>Snow and ice blanketed the sky, mountains stood like forests, and atop one snow peak, dark energy churned, unable to be obscured even by the wind and snow.<br/><br/>Within the dark energy, a figure was meditating, and upon closer inspection, it was Yang Du.<br/><br/>Yang Du, with his black and red long hair, looked like a demon incarnate, radiating a terrifying aura of malevolence.<br/><br/>All of the sudden, the wind and snow in front of Yang Du parted, revealing a figure stepping out.<br/><br/>Ji Rutian!<br/><br/>Ji Rutian stood in the air, looking at Yang Du with complex eyes.<br/><br/>“You’re not here to persuade me again, are you? I don’t have that much patience.”<br/><br/>Yang Du’s voice rang out, indifferent in tone—it was not his own, but that of Xu Chonggua.<br/><br/>Ji Rutian spoke up, “If you continue down this path, you’re destined to make enemies everywhere. Eventually, you’ll depart from the ideals of Wangdao, and the Dao Master will be displeased.”<br/><br/>Upon hearing this.<br/><br/>Yang Du opened his eyes, staring at Ji Rutian with an indifferent gaze, he said, “In an era of great contention, if the Dao Master had truly been dissatisfied, he would have intervened long ago. Besides, I am not acting in the name of Wangdao. What I do is my own will; I haven’t even brought along my disciples from the Body Sect.”<br/><br/>Ji Rutian kept his gaze fixed on him, “The so-called era of great contention isn’t about heroes battling for dominance, but where the Fate of the world will converge upon a single person. You’re trying to be that person. If your actions become too malicious, Wangdao will be forced by the world’s movements to oppose you. Do you think you can stand against Wangdao?”<br/><br/>“Not to mention the Dao Master, but could you withstand the combined strength of the Twelve Dao Sects and the Thirty-Six Heavenly Stem Venerates?”<br/><br/>As he spoke these words, there was a sense of heartache and urgency in his voice.<br/><br/>Yang Du tilted his neck, and immediately after, a head emerged from his neck, revealing itself to be Xu Chonggua’s head.<br/><br/>One body with two heads, both sets of eyes staring intently at Ji Rutian, they said in unison, “So what? The Twelve Dao Sects and the Thirty-Six Heavenly Stem Venerates have never been of any concern to me; my only opponent has always been one—the Dao Master!”<br/><br/>“Even if it leads to my doom, I still aspire to climb to the peak and battle the Dao Master. Ji Rutian, how can you be sure the Dao Master doesn’t anticipate me or you? Indeed, he harbors the world in his heart, but he also longs for an adversary.”<br/><br/>Yang Du and Xu Chonggua’s overlapping voices created a most eerie sensation.<br/><br/>Their words made Ji Rutian frown.<br/><br/>Ji Rutian’s heart was massively shaken, and he suddenly felt a sense of inferiority.<br/><br/>Indeed.<br/><br/>How could he know Fang Wang didn’t desire an opponent?<br/><br/>Over the years, Yang Du had acted recklessly, yet no orders had come from Fang Wang, didn’t that mean Fang Wang was also waiting for Yang Du to grow stronger?<br/><br/>The two heads on Yang Du’s body then merged back into one, returning to his own appearance. He slowly closed his eyes, continuing his cultivation.<br/><br/>Ji Rutian took a deep breath and said, “Emperor Cangtian of the Western Mortal Realm has set his sights on you. Born with the Nine Lives Precious Spirit, he is hailed as having the fate of a Great Saint and the potential of a Great Emperor. This man is not easy to deal with; he has recently defeated an entity from the Celestial Qiankun Realm. Many regard him as the Heavenly Dao of the Western Mortal Realm; take care not to underestimate him.”<br/><br/>“Nine Lives Precious Spirit? That’s something I look forward to then,” Yang Du casually responded.<br/><br/>After hesitating for a moment, Ji Rutian asked, “Who are you now? Yang Du or Xu of the Xu Dao?”<br/><br/>“Yang Du is me, and Xu Chonggua is also me; I possess both the cultivation and fate of Xu Chonggua, and the Heavenly Body of Yang Du. You may still call me Yang Du in the future,”<br/><br/>Upon hearing this, Ji Rutian’s eyes became even more complex.<br/><br/>He pressed further, “What exactly have you been through?”<br/><br/>This time, Yang Du chose not to answer.<br/><br/>Ji Rutian wanted to say more but stopped himself, and with a sigh, he turned to leave, vanishing into the midst of the snowstorm.<br/><br/>…<br/><br/>Years passed.<br/><br/>Fang Wang, staying in Sword Heaven Marsh, could felt a strong aura of battle each year from all directions, including some from the Celestial Qiankun Realm.<br/><br/>There were numerous battles in the Descending Dragon Continent as well, but they were almost all below the Sky-Stepping Realm. The awe of the Heavenly Dao was indeed the foremost in the Eastern Mortal Realm, with no Great Cultivators daring to cause trouble on Wangdao’s territory.<br/><br/>On this day.<br/><br/>Fang Wang opened his eyes and calculated that he had been in seclusion for thirty-seven years.<br/><br/>He was close to completing the integration of the Heavenly Dao Myriad Classic of Laws and the Taixuan Shenxiao Scripture.<br/><br/>Now prepared to practice the Taixuan Shenxiao Scripture once, he intended to let his physical body master this scripture.<br/><br/>Anticipating that the Taixuan Shenxiao Scripture would cause a huge commotion and could even bring disaster to the Descending Dragon Continent, he stood up, took out the Fox Mask and put it on his face, then stepped out in one stride.<br/><br/>The next second, he arrived at the edge of the Mortal Realm.<br/><br/>A boundless ocean flowed towards the stars, finally plummeting down the cliff at The Edge of the Sky.<br/><br/>Fang Wang materialized above the ocean, sitting down cross-legged in mid-air.<br/><br/>He closed his eyes, the corners of his mouth lifting beneath the mask. Choosing this location was not a random decision; during his enlightenment, the fate of this place had risen incredibly fast, occasionally emitting powerful auras.<br/><br/>Fang Wang commenced his cultivation of the Taixuan Shenxiao Scripture directly.<br/><br/>He only needed to complete one cycle for his body to master the Great Perfection of the Taixuan Shenxiao Scripture.<br/><br/>Boom!<br/><br/>Nature’s spiritual energy instantly turned ferocious, surging madly towards Fang Wang, and even the rushing ocean below began to collapse, forming a massive whirlpool.<br/><br/>“Eh?”<br/><br/>A voice of surprise echoed, but Fang Wang seemed not to hear it, focusing on his practice.<br/><br/>Nature’s spiritual energy entered his body, and the Heavenly Dao Force that formed emerged from the top of his head, condensing into the Shenxiao Sun.<br/><br/>The Shenxiao Sun grew larger, and with it, the temperature between heaven and sea began to climb rapidly.<br/><br/>“Taixuan Shenxiao Scripture! Who in the world are you?”<br/><br/>The voice of surprise echoed once more, this time filled with gravity.<br/><br/>Unfortunately, Fang Wang still paid it no attention.<br/><br/>In the distance, the sea whipped up terrifying waves, and within those waves emerged a colossal figure, a giant hand reaching out to grab Fang Wang.<br/><br/>In an instant, Fang Wang’s eyes beneath the mask snapped open, and the giant hand froze just above the sea surface, unable to move.<br/><br/>Then, Fang Wang closed his eyes again and continued his practice.<br/><br/>The influence of the Taixuan Shenxiao Scripture was immense, and the spiritual energy from this sea area alone could not satisfy it. It began to absorb more nature’s spiritual energy, causing the entire Mortal Realm to undergo tumultuous changes.<br/><br/>Cultivators from across all seas and lands opened their eyes, all looking in the same direction, all showing expressions of surprise and doubt.\t\t\t\t\t\t</div>", "images": {}, "success": true}