{"id": 447, "url": "https://www.novelhall.com/i-became-an-immortal-on-mortal-realm-32879/15059342.html", "title": "Chapter 437 - Chapter 437: Chapter 434: Miracle, Karmic Technique", "volume": 5, "volume_title": "Volume 5", "body": "<h1>Chapter 437 - Chapter 437: Chapter 434: Miracle, Karmic Technique</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 437: Chapter 434: Miracle, Karmic Technique<br/><br/>Above Kunlun, Fang Wang stood in the high sky, his right hand raised before him, his gaze so indifferent that even as the heavens trembled and the earth shook, he remained unmoved.<br/><br/>All kinds of rocks prepared by the Tiangong Sect uncontrollably soared towards the peak of Kunlun Mountain, the mountain body continually rising. The countless rocks flew towards the sky in a spectacle that was truly magnificent.<br/><br/>The rumbling noise—<br/><br/>An ear-deafening roar of the ground<br/><br/>Hong Chen was one of the few who still remained calm and composed because he was certain that Fang Wang had become an Immortal. Immortal Divine beings possessing such Divine Skills were within reason, and now he was curious about what differences there were between a Heavenly Dao True Immortal and the Immortals he knew of?<br/><br/>“It’s a miracle!”<br/><br/>In the low sky before the foot of Kunlun Mountain, an old Cultivator from the Tiangong Sect shouted excitedly, even his eyes shimmering with tears.<br/><br/>It was not just him— the great plan of Kunlun had been ongoing for hundreds of years, and they did not know how much longer they would be busy. Now that they saw the Heavenly Dao manifesting Divine Skills, aiding them to accelerate the completion of the great plan of Kunlun, how could they not be thrilled?<br/><br/>For a moment, cheers and shouts of joy rose from all directions of Kunlun, countless beings bowing in worship.<br/><br/>For ten thousand years, the living beings of the Mortal Realm had only heard legends of Immortal Divine beings, and today, they finally witnessed the form of an Immortal Divine being.<br/><br/>Approximately after half an incense stick of time had passed, Kunlun rose by several hundred feet, and amidst billowing dust, Fang Wang’s figure disappeared.<br/><br/>This month-long phenomenon of heaven and earth came to a complete end.<br/><br/>Fang Wang flew into Sword Heaven Marsh and, under the watchful eyes of countless Disciples of the Way of Hope, he returned to the wooden bridge where he usually practiced his cultivation.<br/><br/>Dugu Wenhun, Hong Chen, Zhu Rulai, and others appeared before him, looking at him nervously and expectantly.<br/><br/>The Solitary Life Elder was the first to ask, “Dao Master, have you truly become an Immortal? What is a Heavenly Dao True Immortal?”<br/><br/>The others were also curious about what a Heavenly Dao True Immortal was.<br/><br/>Fang Wang replied, “All laws understood, roaming the myriad realms freely, such is a Heavenly Dao True Immortal.”<br/><br/>Those simple eight words immersed everyone in endless reverie.<br/><br/>“The Mortal Realm’s capacity to bear is limited, is there a limit to the number of Heavenly Dao True Immortals?” Hong Chen asked.<br/><br/>Fang Wang looked at him and said, “Heavenly Dao True Immortals cultivate using the power of heaven and earth. The more Heavenly Dao True Immortals there are, the stronger heaven and earth become.”<br/><br/>Upon hearing this, Hong Chen fell into deep thought.<br/><br/>The others followed with further questions, and Fang Wang, despite having achieved the status of a Heavenly Dao True Immortal, did not become arrogant and patiently answered each one, causing everyone to look forward even more to the Heavenly Dao True Immortals.<br/><br/>After some time,<br/><br/>Fang Wang walked towards his own loft, a building that was guarded even when he was not usually there.<br/><br/>He entered the loft, created an avatar to meditate on the bed, and then he himself employed The Heaven of Carefree Freedom to traverse boundaries.<br/><br/>With one step, he arrived at the Endless Realm.<br/><br/>This was the realm of Ye Xunhuan, where the True Venerable had stayed for many years. Fang Wang came to check on his progress.<br/><br/>The True Venerable bore the mark of The Heaven of Carefree Freedom, allowing Fang Wang to appear by his side with just one step.<br/><br/>The lake wind roared towards them, the True Venerable sitting in meditation by the lakeside, with a forest behind him swaying in the wind. He was practicing some kind of extraordinary Cultivation Technique, surrounded by faint blue runes that were dense and mysterious.<br/><br/>The True Venerable did not sense Fang Wang’s presence, continuing to face the great lake as he cultivated.<br/><br/>In front of them, Tai Lake appeared boundless, like an ocean, with a thin mist hovering over its surface, occasionally revealing giant fish leaping out of the water.<br/><br/>Fang Wang watched the True Venerable closely, sensing that the Cultivation Technique he was practicing was no simple matter. The power of the Celestial Qiankun’s rules was drawing near him, transforming his Karmic ties and fate, although his Spiritual Power did not show much increase.<br/><br/>After watching for a while, Fang Wang then stepped forward, brushing past the True Venerable.<br/><br/>The True Venerable suddenly opened his eyes and upon seeing Fang Wang, he quickly rose to his knees to bow his respects.<br/><br/>“Greetings, Dao Master!”<br/><br/>Although it was not the first time, Fang Wang’s sudden appearance by his side always gave him a start.<br/><br/>It seemed no matter how much his cultivation improved or how extraordinary the techniques he practiced, he remained as insignificant as an ant in the presence of Fang Wang.<br/><br/>Real Master Kongdu hurriedly said, “Congratulations, Dao Master, for achieving the status of Heavenly Dao True Immortal!”<br/><br/>Due to his efforts, the Heavenly Dao Immensity Scripture had already spread throughout this Mortal Realm, hence previously there had also been celestial phenomena, and countless living beings had seen Fang Wang’s Immortal figure, including him.<br/><br/>He hadn’t expected Fang Wang to seek him out right after his breakthrough.<br/><br/>Fang Wang asked, “What Cultivation Technique are you practicing?”<br/><br/>Real Master Kongdu replied, “I acquired it in a forbidden place, it is called the Karmic Technique. Once mastered, it can hide karmic ties and even calculate the karmic destinies of others.”<br/><br/>“Pass it to me,” Fang Wang said directly.<br/><br/>Real Master Kongdu didn’t hesitate and immediately began to convey the method of cultivation.<br/><br/>This technique was extremely profound, and he lectured for a full hour before he finished entirely.<br/><br/>Fang Wang closed his eyes, then opened them.<br/><br/>Real Master Kongdu waited for him to speak, thinking to himself, “I wonder if this technique will be of any help to the Dao Master. It’s so exquisite that if he takes a liking to it, given the Dao Master’s abilities, he could probably master it completely within a hundred years…”<br/><br/>Fang Wang lifted his right hand, an action that captured Real Master Kongdu’s attention.<br/><br/>Real Master Kongdu was puzzled about what Fang Wang was going to do.<br/><br/>Fang Wang’s right hand clenched as if grabbing something from the air, the space in front started to twist, like a vortex, and strands of strange grey qi surged out from within.<br/><br/>Real Master Kongdu’s eyes widened as he felt a powerful karmic force.<br/><br/>Fang Wang pulled his right hand back, and copious amounts of grey qi were drawn out from the spatial vortex, coalescing into a contorted, massive face.<br/><br/>The gargantuan face quickly regained its features; it belonged to a withered old man with greying hair and a complexion marred by grey spots, his eye sockets deep and his gaze cold. At this moment, his eyes showed an expression of disbelief.<br/><br/>“You… how is this possible…”<br/><br/>The massive face spoke with a trembling voice, unable to hide the color of terror.<br/><br/>Fang Wang calmly asked, “Are you a Saint, or an Emperor?”<br/><br/>The massive face seemed to sense something and exclaimed in disbelief, “You have mastered the Karmic Technique? How could you do it so quickly?”<br/><br/>It was clear that he had been keeping an eye on Real Master Kongdu.<br/><br/>Upon hearing this, Real Master Kongdu was equally stirred, astounded inside.<br/><br/>The Dao Master had already mastered the Karmic Technique?<br/><br/>If so, why had he asked for it to be transmitted again?<br/><br/>“Impossible… If you had practiced it, I would have certainly known long ago. You must have just learned it; your comprehension…” The words from the massive face made Real Master Kongdu’s face show a shocked expression.<br/><br/>To learn just by listening once?<br/><br/>And his proficiency was clearly far beyond Real Master Kongdu’s!<br/><br/>All of a sudden.<br/><br/>The massive face’s eyes became focused, and the entire face suddenly exploded, turning into billowing grey fog that instantly engulfed both Fang Wang and Real Master Kongdu.<br/><br/>Caught in the midst of the grey fog, Real Master Kongdu felt an irresistible suppressive force that even made his Spiritual Power solidify.<br/><br/>He was Celestial Qiankun, after all!<br/><br/>Real Master Kongdu instinctively looked towards Fang Wang, only to see him with a slightly upturned corner of his mouth, revealing a thought-provoking smile.<br/><br/>About five breaths’ time later, the surrounding grey fog suddenly dispersed.<br/><br/>Fang Wang and Real Master Kongdu landed, and upon looking up, they saw the Firmament darkened, displaying nine blood-red moons, and the earth was silent and desolate, like the wilderness in the night with no visible end.<br/><br/>“True Venerable, I have brought the Heavenly Dao!”<br/><br/>The voice of the previous massive face rang out again, echoing throughout the entire world, lingering for a long time.\t\t\t\t\t\t</div>", "images": {}, "success": true}