{"id": 441, "url": "https://www.novelhall.com/i-became-an-immortal-on-mortal-realm-32879/15050508.html", "title": "Chapter 431 - Chapter 431: Chapter 428: 780,000 Years!", "volume": 5, "volume_title": "Volume 5", "body": "<h1>Chapter 431 - Chapter 431: Chapter 428: 780,000 Years!</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 431: Chapter 428: 780,000 Years!<br/><br/>“`<br/><br/>“I’ll bet another two hundred thousand years.” Fang Wang from the seventh life spoke, his tone laced with jest.<br/><br/>The other past lives all chimed in with their bets, the least amount being a hundred thousand years.<br/><br/>A smile appeared on Fang Wang’s face, but it was a bitter and helpless smile.<br/><br/>The True God of the Heavenly Palace said beamingly, “Bet on what?”<br/><br/>All the seven past incarnations looked at Fang Wang, who pondered before saying, “Let’s bet on our unfulfilled wishes then. Whoever guesses correctly, I’ll help them fulfill one wish.”<br/><br/>Upon hearing this, everyone from the past lives thought it was a good idea and thus gladly accepted.<br/><br/>Fang Wang no longer played around with them and started to concentrate on comprehending the cultivation technique.<br/><br/>The Great Completion version of the Heavenly Dao Myriad Classic of Laws was already enough for him to become an immortal, but what kind of fortune would Great Perfection bring?<br/><br/>Fang Wang wanted to ascertain the result first and then construct the process, for that would give him direction.<br/><br/>No sooner had he thought this than tens of thousands of years had hurried by.<br/><br/>He never felt time pass so swiftly, yet even as time flew, he still couldn’t see the day his cultivation would be accomplished.<br/><br/>As millennia followed millennia, Fang Wang sat meditating, comprehending the Dao.<br/><br/>Once he found the direction, he did not look at the time but continued to cultivate, determined to reach Great Perfection in one go!<br/><br/>…<br/><br/>At Sword Heaven Marsh, on a wooden bridge, Fang Wang opened his eyes.<br/><br/>At that moment, beneath his legs, golden light continued to spread, resembling a blossoming golden lotus, and this lotus kept growing larger.<br/><br/>The heavens and earth seemed to sense the birth of a brand new Heavenly Dao Myriad Classic of Laws, and the rules of the universe around Sword Heaven Marsh were leaping and boiling. The influence was spreading far and wide.<br/><br/>Fang Wang’s gaze was so vast, with an air of terrifying stillness.<br/><br/>“Seven hundred and eighty thousand years…” Fang Wang murmured to himself.<br/><br/>It took him two hundred and thirty thousand years to reach Great Completion from the beginning of his practice, and another five hundred and fifty thousand years from Great Completion to Great Perfection!<br/><br/>Seven hundred and eighty thousand years—it felt as though he had lived from the very founding of the Grand An Divine Dynasty to the present day, or even longer. Throughout the entire process, he had been sitting in meditation, comprehending the Dao.<br/><br/>No one could understand his feelings.<br/><br/>The ordeal of seven hundred and eighty thousand years had erased his desires, hatred, animosity, and so on; he even felt that nothing in this world could stir his emotions anymore.<br/><br/>In such a long span of years, life had become dispensable, everything had lost its meaning.<br/><br/>Looking back at the mortal realm, whether it was toward the Immortal Divine or the struggles of the era, Fang Wang had lost all expectation.<br/><br/>He even lost interest in becoming an immortal. At that moment, he seemed to have lost his purpose, his fighting spirit.<br/><br/>He just sat dumbly on the wooden bridge, gazing at the surface of the lake until the golden light beneath him faded away. He still did not move, not even blinking once.<br/><br/>Day gave way to night.<br/><br/>Days passed by.<br/><br/>The Ling Wu fog covering the wooden bridge gradually dispersed, and when the fog had lifted, Fang Wang’s figure was nowhere to be seen.<br/><br/>At this moment, Fang Wang was walking on a mountain path in Kunlun.<br/><br/>The trail was narrow, allowing only one person to pass. The stone steps were steep, the mountain wall sheer. As he walked along the path, a single misstep could send him plunging into a bottomless abyss.<br/><br/>Surrounding him were towering peaks, all part of the Kunlun mountain range, and mist surged between the mountains, the condensation of Spiritual Energy.<br/><br/>Fang Wang gazed at Kunlun, his eyes indifferent, his mind free of distractions, wandering aimlessly.<br/><br/>From dawn to dusk, the mountain roads of Kunlun seemed endless.<br/><br/>Fang Wang came upon a cliff where, under the shade of a tree, someone was lying there, holding a fruit in his hand, chewing it, and muttering something to himself.<br/><br/>It was none other than the Solitary Life Elder.<br/><br/>“`<br/><br/>Fang Wang quietly observed the Solitary Life Elder, and the usually placid depths of his eyes finally revealed a flicker of doubt.<br/><br/>He was curious about who this person could be, who had managed to infiltrate Kunlun unnoticed by all.<br/><br/>After watching for a while, Fang Wang intentionally took a step forward.<br/><br/>Crack!<br/><br/>His right foot crunched onto the dried leaves, producing a crisp sound.<br/><br/>The Solitary Life Elder abruptly awoke, opened his eyes, and looked at Fang Wang with vigilance as he asked in a deep voice, “Who are you?”<br/><br/>“It should be I who asks you, who are you?” Fang Wang replied, his voice hoarse as if he hadn’t spoken in many years.<br/><br/>The Solitary Life Elder sized him up and said, “You may address me as the Solitary Life Elder. Are you the Wangdao Master?”<br/><br/>“What makes you say that?”<br/><br/>“In the entire Wangdao, only the Wangdao Master is beyond my insight, unreadable to me, and whose presence is undetectable.”<br/><br/>“Then, do you recognize Xuan Zong?”<br/><br/>“I am aware of him but do not know him personally; he is the former Heaven Emperor of the Celestial Court of the Upper Realm.”<br/><br/>Hearing the Solitary Life Elder’s response, Fang Wang became even more curious about him.<br/><br/>In his past life, Fang Wang had also encountered the Solitary Life Elder, and knowing that he possessed the Nine Lives Nirvana Sword Technique, it was clear that this man’s identity was anything but simple – he might even be more mysterious than the Immortal Divines of the Upper Realm.<br/><br/>Fang Wang suddenly appeared in front of the Solitary Life Elder, startling him enough to instinctively step back.<br/><br/>He reached out to grab the Solitary Life Elder’s wrist and held onto it.<br/><br/>The Solitary Life Elder was terrified and hastily cried out, “I harbor no malicious intent! Don’t kill me! Let’s talk this over peacefully!”<br/><br/>Staring at him, Fang Wang asked, “You shouldn’t be this weak, should you?”<br/><br/>“It’s not that I am weak, but rather that you are too strong. Even the Celestial Qiankun in your presence is nothing more than something you could suppress with a flip of your hand. How can I possibly be your match?” the Solitary Life Elder said with a woeful expression.<br/><br/>“Then tell me your origin, why are you hiding in Kunlun?”<br/><br/>“With the world in chaos, I deemed Kunlun to be the safest place, as after all, no one would dare to provoke you. As for my origins, I won’t lie to you, I’ve actually forgotten them. I’ve studied the path of karmic destiny for many years and have suffered backlash; I don’t remember where I came from or how long I’ve lived. I’ve been wandering cluelessly in the Mortal Realm. The only joy for me is to reveal people’s fates, even if it means suffering from backlash; that kind of pain allows me to realize what it feels to be alive,” the Solitary Life Elder said with a sigh.<br/><br/>By the look in his eyes, he didn’t seem to be faking it.<br/><br/>Fang Wang let go, and the Solitary Life Elder quickly backed away.<br/><br/>It was then that the Solitary Life Elder began to seriously scrutinize Fang Wang, growing more astonished the more he looked.<br/><br/>Fang Wang gave him an indescribable feeling; clearly present before his eyes, without a hint of aura leakage, yet he felt an inexplicable urge to bow down in reverence.<br/><br/>So strange!<br/><br/>Seeing that Fang Wang remained silent, the Solitary Life Elder spoke up, “Master, is Wangdao in need of more people? How about letting me join? As long as Kunlun can offer me a sanctuary, I will be content.”<br/><br/>“What can you do for Wangdao?”<br/><br/>“Naturally, divination and fortunetelling. In this regard, if I claim to be second best in the world, there would be no one who could claim to be the first!”<br/><br/>“Not even the Red Dust Celestial Emperor?”<br/><br/>“He is merely a reincarnated being. If he were still that Heaven Emperor, naturally, I could not hold a candle to him. But now, heh…”<br/><br/>Witnessing the Solitary Life Elder’s arrogant and smug expression, Fang Wang still showed no hint of emotion.<br/><br/>If this were over five hundred thousand years ago, he might have been quite interested in the Solitary Life Elder.<br/><br/>But now, he really couldn’t muster any interest.<br/><br/>After just a brief chat, he felt like leaving.<br/><br/>Fang Wang glanced at the Solitary Life Elder and continued up the mountain.<br/><br/>Seeing Fang Wang about to leave, the Solitary Life Elder became anxious and quickly said, “In a hundred years, the person of destiny will surpass the Celestial Qiankun and sweep across the Mortal Realm; in two hundred years, the Heavenly Gate will open wide, and Immortal Divines will descend en masse, purging the Mortal Realm with blood!”\t\t\t\t\t\t</div>", "images": {}, "success": true}