{"id": 444, "url": "https://www.novelhall.com/i-became-an-immortal-on-mortal-realm-32879/15052518.html", "title": "Chapter 434 - Chapter 434: Chapter 431: The Supreme Saint Appears! Great Creation Of Heaven And Earth!", "volume": 5, "volume_title": "Volume 5", "body": "<h1>Chapter 434 - Chapter 434: Chapter 431: The Supreme Saint Appears! Great Creation Of Heaven And Earth!</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 434: Chapter 431: The Supreme Saint Appears! Great Creation of Heaven and Earth!<br/><br/>Gazing at the white-robed man lost in thought, Fang Wang spoke up, “May I know your name, senior?”<br/><br/>Being able to conceal oneself within the rules of nature, this person before him was definitely very powerful.<br/><br/>The first names that came to Fang Wang’s mind were Xuanzu and Supreme Saint.<br/><br/>Xuanzu was the one who opened the Mortal Realm; Supreme Saint was the strongest being ever known in this realm. Apart from them, Fang Wang couldn’t think of a third possibility.<br/><br/>The white-robed man smiled and said, “My name has long been forgotten, but it seems that beings like to call me Supreme Saint.”<br/><br/>As expected!<br/><br/>Supreme Saint!<br/><br/>Fang Wang immediately raised his hand in salute, as a sign of respect to his senior.<br/><br/>The Supreme Saint looked at Fang Wang, his eyes becoming fervent as he asked, “Could you tell me about your Heavenly Dao?”<br/><br/>Fang Wang naturally wouldn’t hide anything; he immediately began to recount the Heavenly Dao Myriad Classic of Laws.<br/><br/>The Supreme Saint listened intently, in this mysterious world where it seemed time didn’t exist, the ocean was still, not a breeze stirred, and Fang Wang’s voice echoed on the island.<br/><br/>After a long while.<br/><br/>After Fang Wang had finished speaking, he waited for the Supreme Saint’s evaluation.<br/><br/>The Supreme Saint furrowed his brows, caught in a deep contemplation.<br/><br/>He looked up at Fang Wang, his face shadowed under the tree canopy, and asked curiously, “Have you cultivated the Taixuan Shenxiao Scripture? The Yang of the Heavenly Dao and the Shenxiao Sun bear a striking resemblance.”<br/><br/>Fang Wang responded, “Correct, junior has cultivated the Taixuan Shenxiao Scripture. It played a significant role in establishing the Heavenly Dao.”<br/><br/>The Supreme Saint couldn’t help but sigh deeply, saying softly, “The Taixuan Shenxiao Scripture is indeed a remarkable creation. Although it doesn’t step outside the realm of Saint Dao or Imperial Dao, it can cultivate the power of the rules of nature. Whether one follows the Saint Dao or the Imperial Dao, one can be stronger than others of the same realm. My disciple created it, aiming to replace the sun, to become the Shenxiao Sun, and live as long as the heavens and the earth.”<br/><br/>Fang Wang raised his eyebrows, sensing the feasibility in this plan.<br/><br/>“At that time, I believed that beings should not live as long as nature itself. Doing so could possibly become a disaster for all beings in later generations, even a great calamity in the Mortal Realm. I stopped him, even going so far as to cut down his cultivation,” the Supreme Saint said with an eerie tone that left one unable to discern his emotions.<br/><br/>Fang Wang stared intently at the Supreme Saint without uttering a word.<br/><br/>With a self-mocking laugh, the Supreme Saint continued, “Not only that, but I also perished by my own hand, allowing my power to protect the Mortal Realm but without leaving my will behind. I originally thought that this way, I could bring everlasting peace to the realm, but later on, the trials that befell the Mortal Realm only grew more frequent.”<br/><br/>Fang Wang asked, “Senior, do you believe that you have brought disaster to the Mortal Realm?”<br/><br/>The Supreme Saint replied, “Yes, the human heart is, after all, prone to change. I had absolute power at my command, and I could inadvertently bring catastrophe to the Mortal Realm, much like how Heavenly Might affects mortals.”<br/><br/>“So what is your attitude now, senior?”<br/><br/>In response to Fang Wang’s inquiry, the Supreme Saint didn’t say anything but continued to stare into his eyes.<br/><br/>Eye to eye.<br/><br/>The entire mysterious world began to warp.<br/><br/>Surprised, the Supreme Saint asked, “You can already sense all the rules of nature?”<br/><br/>Fang Wang calmly said, “Senior, you wouldn’t think that what I aim to achieve is the Immortality as you understand it, would you?”<br/><br/>The Supreme Saint, moved, said, “Truly, the younger generation is to be feared. How old are you? You have surpassed my hundred thousand years of cultivation in my lifetime.”<br/><br/>A hundred thousand years?<br/><br/>Sorry, but in this life, I have actually cultivated for over a million three hundred thousand years!<br/><br/>Fang Wang spoke up, “Indeed, every choice comes with its pros and cons. You were afraid that you might change and bring disaster to the world, which resulted in the Upper Realm oppressing the Mortal Realm for a long time. I will indeed become an Immortal in the Mortal Realm, but my choice is different from yours. I want the Mortal Realm to be filled with Immortals, where all beings have the potential to become Immortal. Even if there will be endless strife, at least the people will have hope, and that is always a good thing.”<br/><br/>The Supreme Saint fell silent, his eyes flashing with an unusual light.<br/><br/>Fang Wang stared fearlessly at the Supreme Saint, having come this far, there was no chance he would give up.<br/><br/>Nor could the Supreme Saint stop him even if he wished to! This mysterious world, he could leap out of it when he pleased, now he was merely intrigued by the Supreme Saint and wanted to chat a bit more.<br/><br/>The Supreme Saint said, “Perhaps you’re right, then I won’t stand in your way. However, I still have some concerns about the Mortal Realm. I will personally witness the era you create. If you bring disaster to the people, I will put an end to it all by my own hands.”<br/><br/>Hm?<br/><br/>The Supreme Saint can revive?<br/><br/>Fang Wang silently cursed in his heart, if you can revive, then what was the point of your death?<br/><br/>Deceiving yourself?<br/><br/>“Go, go become an Immortal, change this Mortal Realm, confront those high above Immortal Divines, and prove that the Immortal you create is the True Immortal,” the Supreme Saint suddenly laughed, with great mirth, devoid of any prior threatening demeanor.<br/><br/>As his words fell, the mysterious world instantly shattered.<br/><br/>Fang Wang opened his eyes, still meditating at the summit of Kunlun Mountain, surrounded by vast golden light.<br/><br/>His physical body was transforming, and even his soul was undergoing a delightful change. He could feel a great amount of breaths rushing from all directions of heaven and earth, all eager to witness his ascension to Immortality.<br/><br/>He didn’t hide his aura, shining like a bright moon in the night, allowing all Cultivators to clearly sense his presence.<br/><br/>Boom!<br/><br/>A vast force erupted from within Fang Wang, sweeping across heaven and earth. In an instant, centered around him, Kunlun burst into golden lotuses sprawling across the hills and valleys. Sword Heaven Marsh, too, began to sprout golden lotuses, even upon the surface of the lake.<br/><br/>The growth and spread of the golden lotuses were exceedingly fast. In less than twenty breaths’ time, the entire Descending Dragon Continent was covered with golden lotuses, forming a sea of gold. These lotuses began to produce a special type of Spiritual Energy.<br/><br/>They absorbed nature’s Spiritual Energy from beneath the earth and then used the laws of heaven and earth to cultivate a brand new Spiritual Energy.<br/><br/>Fang Wang called it Heavenly Dao Spiritual Qi!<br/><br/>If he wanted his own Heavenly Dao to truly take root, he needed the Mortal Realm to have the soil for achieving Heavenly Dao True Immortals.<br/><br/>The common people couldn’t live over one million and thirty thousand years to become Immortals through the natural laws, so Fang Wang created Heavenly Dao Spiritual Qi, making it easier for them to become Heavenly Dao True Immortals. Yet, there was one thing, their Fate would be tied to Fang Wang.<br/><br/>The more Heavenly Dao True Immortals there were, the stronger Fang Wang became!<br/><br/>If Fang Wang were to fall, all those practicing the Heavenly Dao would suffer backlash!<br/><br/>Fang Wang was not a supremely benevolent sage; he had his own selfish desires. If he could strengthen himself while helping the masses, why not do it?<br/><br/>He didn’t want to end up like the Supreme Saint.<br/><br/>The Heavenly Dao Spiritual Qi spewed out from the golden lotuses, filling the entire heaven and earth.<br/><br/>Those Cultivators practicing the Heavenly Dao Immensity Scripture faintly heard Fang Wang preaching, a blessing given to the Heavenly Dao Cultivators by Fang Wang himself, allowing them to experience the laws of heaven and earth ahead of time.<br/><br/>Fang Wang’s merit and fortune in the Mortal Realm lasted a long time. After a day and a night, the whole world was covered with golden lotuses, and all creatures could feel the opportunity he had granted them.<br/><br/>Wangdao Master!<br/><br/>Heavenly Dao True Immortal!<br/><br/>These two titles were deeply imprinted in the hearts of all beings.<br/><br/>Those Cultivators in pursuit of the Saint Dao, the Imperial Dao, and those wanting to ascend to the Upper Realm were shaken. They could feel the strength of the Heavenly Dao and the incredible nature’s Spiritual Energy.<br/><br/>It was simply difficult for them to make up their minds to start their practice anew.<br/><br/>It was the lower realm creatures who joined the Heavenly Dao without hesitation.\t\t\t\t\t\t</div>", "images": {}, "success": true}