{"id": 445, "url": "https://www.novelhall.com/i-became-an-immortal-on-mortal-realm-32879/15055467.html", "title": "Chapter 435 - Chapter 435: Chapter 432: An Ominous Fate, Intolerable By Heaven And Earth!", "volume": 5, "volume_title": "Volume 5", "body": "<h1>Chapter 435 - Chapter 435: Chapter 432: An Ominous Fate, Intolerable By Heaven And Earth!</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 435: Chapter 432: An Ominous Fate, Intolerable by Heaven and Earth!<br/><br/>“`<br/><br/>Days passed, and even after seven days, the celestial phenomenon had not dissipated, signaling to all beings under the heavens a transformation by the Heavenly Dao that was unprecedented in ancient times.<br/><br/>As the seven days came to a close, the golden lotus on top of Kunlun Mountain remained, now so immense it covered the entirety of the Descending Dragon Continent, bathing the entire land in golden light.<br/><br/>Around Kunlun, countless Cultivators gazed at the enormous Golden Lotus caused by Fang Wang, as if beholding the flower of the world, with Disciples of the Way of Hope and Tiangong Sect disciples worshiping even more devoutly, their expressions filled with piety.<br/><br/>Hong Chen and the Solitary Life Elder sat shoulder to shoulder in meditation, both looking towards the summit of Kunlun Mountain.<br/><br/>Suddenly.<br/><br/>Hong Chen seemed to divine something, his expression turning grave.<br/><br/>The Solitary Life Elder also engaged in divination, his face growing increasingly troubled.<br/><br/>Hong Chen took a deep breath, lowered his right hand, and asked, “What have you divined?”<br/><br/>“I have divined a counterattack by the Imperial Dao,” the Solitary Life Elder answered, his tone serious.<br/><br/>Hong Chen continued, “What I have divined is the Saint Dao; they are drawing near.”<br/><br/>The two exchanged glances, then shifted their gaze simultaneously, their hands moving quickly to cast spells for further divination.<br/><br/>At that moment, Sword Heaven Marsh was populated but silent. Everyone was treasuring this fortuitous event. As they absorbed the Heavenly Dao Spiritual Qi, they pondered over the confusions they encountered in their normal cultivation, clearly feeling the help this transformation provided.<br/><br/>Atop Kunlun Mountain, ensconced in golden light, Fang Wang still had his eyes closed. His form looked unchanged, but by now he had transformed into a Heavenly Dao True Immortal.<br/><br/>He not only reveled in the mysteries of a Heavenly Dao True Immortal but also allowed his fate to extend over other Mortal Realms.<br/><br/>These Mortal Realms, all bound by the fate and karmic forces of the Heavenly Dao Myriad Classic of Laws, witnessed the Heavenly Dao Golden Lotus blooming within them, an event far beyond what the people could imagine.<br/><br/>Fang Wang slowly opened his eyes, his gaze turning towards the horizon.<br/><br/>“Daring to claim the title of Heavenly Dao and establishing a method for Mortals to become Immortals? Wangdao Master, this Emperor is eager to see if you truly are an Immortal!”<br/><br/>A majestic voice like a muffled thunder resonated through heaven and earth, startling countless beings in the midst of enlightenment.<br/><br/>In the northern sky above Kunlun, the Firmament was aflame with red clouds, as if a sea of fire was sweeping in. Even the sea of clouds above the mountain was dyed red, and the enormous Heavenly Dao Golden Lotus was rapidly encircled by the crimson clouds, looking as though it was about to be consumed by flames.<br/><br/>All beings under the heavens felt an oppressively domineering pressure descending. Below the Sky-Stepping Realm, all were paralyzed with Spiritual Power halted and breaths quickening, and even the higher realms felt their hearts palpitate.<br/><br/>Golden Lotus flowers scattered across the mountains trembled, as if a breeze had passed, stirring waves in the sea of Golden Lotuses, bringing relief to all the beings of the Descending Dragon Continent.<br/><br/>From afar, Fang Wang gazed towards the horizon without saying a word, his eyes reflecting indifference.<br/><br/>The fiery clouds at the edge of the sky began to toss and turn violently. Suddenly, the sea of clouds parted forcefully, and a blood-red sword thousands of feet long charged towards Kunlun, the fierce winds it raised causing mountains to tremble and rivers to surge, countless beings knocked to the ground as dust rose from the vast earth.<br/><br/>With a boom!<br/><br/>There was a loud noise from the Firmament, and the sky full of fire clouds churned madly, making the flames on the earth flicker incessantly, turning the world into what seemed like Purgatory.<br/><br/>Countless Cultivators’ eyes were locked on Kunlun, only to see the blood-red giant sword hanging in front of Kunlun Mountain, unable to strike the mountain. The terrifying aura that seemed capable of destroying everything vanished.<br/><br/>By a lakeside, the Solitary Life Elder calculated with his fingers and uttered three words: “Canglan Emperor!”<br/><br/>Hong Chen followed up with a sentence: “A Great Emperor from twenty thousand years ago, a sovereign of the Mortal Realm.”<br/><br/>As his words fell.<br/><br/>A grand figure began to materialize at the tip of the blood-light giant sword, towering a hundred feet tall, clad in a Golden Dragon red robe, crowned with a golden diadem, and two trails of blood-red flames burning along the dragon horns, stirring up scorching whirlwinds with each movement.<br/><br/>The Canglan Emperor!<br/><br/>“`<br/><br/>This Great Emperor bore a majestic visage, his pupils also blood-red, exuding an indifference that seemed to disregard the common folk.<br/><br/>The Canglan Emperor slowly raised his right hand, but just as it lifted, not even reaching the height of his chest, his whole body stiffened, as if subject to a paralyzing spell, unmoving.<br/><br/>“Obscured creatures lurking in the shadows, whether saints or emperors, if you do not permit the birth of a Heavenly Dao True Immortal, you may come out and test the sharpness of my edge,”<br/><br/>Fang Wang’s voice resounded, indifferent yet clear, allowing all beings to hear his words without feeling oppressed.<br/><br/>In this regard, he won over the hearts of the vast majority of beings compared to the Canglan Emperor.<br/><br/>Saints?<br/><br/>Emperors?<br/><br/>The beings were shocked, were there hidden Great Saints and Great Emperors in this world?<br/><br/>Why would Great Saints and Great Emperors obstruct the ascension to the Heavenly Dao?<br/><br/>For a time, numerous thoughts emerged in the minds of all beings.<br/><br/>Another even more formidable presence descended, the red sea of clouds in the sky parted, white pillars of light descended from the heavens, shining around Kunlun Mountain, as if a Formation was encircling the vast Kunlun.<br/><br/>A domineering figure descended from the sky, radiating intense light like a fallen sun, piercing through the illusory Heavenly Dao Golden Lotus, aiming straight for Fang Wang.<br/><br/>However, just as he appeared, in less than half a breath’s time, he abruptly stopped above Fang Wang’s head, no more than two hundred zhang away.<br/><br/>This was a burly man clad in Silver Armor, his face covered in a beard, his tiger-like eyes wide open, with his right fist lowered and sharp and deadly energy swirling around it.<br/><br/>Hong Chen and the Solitary Life Elder locked their gaze on the Silver Armor man, and not just them—Dugu Wenhun, Song Jinyuan, Chu Yin, and all the Great Cultivators within Sword Heaven Marsh were drawn to him.<br/><br/>“The Bully Saint, since ancient times, has brought the art of the punch to the peak, his physique is also considered top-tier among the Great Saints,” a voice came from beside, prompting Hong Chen and the Solitary Life Elder to glance over.<br/><br/>The speaker was none other than the Thousand Eyes Great Saint.<br/><br/>Thousand Eyes Great Saint, looking up, eyed the Bully Saint with a gaze full of complexity.<br/><br/>The Solitary Life Elder raised his eyebrows, calculating the origin of Thousand Eyes Great Saint, not thinking much of it until the revelation startled him.<br/><br/>“Why do you carry so many karmic ties with Great Saints and Great Emperors?” the Solitary Life Elder asked nervously.<br/><br/>Thousand Eyes Great Saint did not answer, continuing to watch the Firmament.<br/><br/>Boom! Boom! Boom…<br/><br/>From all directions, a terrifying might erupted, causing the sea at the edge of the Descending Dragon Continent to rise in monstrous waves, like a towering blue wall emerging, isolating the Descending Dragon Continent from the world.<br/><br/>“By altering nature’s spiritual energy, are you becoming an Immortal or are you holding the mortal realm hostage?”<br/><br/>“Ill-fortuned fate, the world will not tolerate!”<br/><br/>“Arrogant, how dare you attempt to shake the ordained positions of Great Saints and Emperors?”<br/><br/>“Inciting the hearts of the masses, truly a wolfish ambition, could it be you are the catastrophe sent by the Upper Realm?”<br/><br/>“The flow of fate in the Mortal Realm should belong to all beings, if everyone cultivates your Saint Dao, won’t you aim to become the ruler of all under heaven”<br/><br/>The booming voices echoed through the heavens and earth, deafening, causing the beings of the Descending Dragon Continent to tremble in spirit, inexplicably feeling the urge to kneel and confess their desires towards the Heavenly Dao.<br/><br/>Fang Wang sat amidst the golden light, his expression remaining composed. He softly said, “If the Saint Dao and Imperial Dao cannot withstand the Heavenly Dao, then what purpose do they serve? Distinguished guests, if you do not cherish the grace of revival, then prepare to vanish completely.”\t\t\t\t\t\t</div>", "images": {}, "success": true}