{"id": 446, "url": "https://www.novelhall.com/i-became-an-immortal-on-mortal-realm-32879/15055468.html", "title": "Chapter 436 - Chapter 436: Chapter 433: Fang Wang Ascends To Heaven, Heaven And Earth Tremble!", "volume": 5, "volume_title": "Volume 5", "body": "<h1>Chapter 436 - Chapter 436: Chapter 433: Fang Wang Ascends To Heaven, Heaven And Earth Tremble!</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 436: Chapter 433: Fang Wang Ascends to Heaven, Heaven and Earth Tremble!<br/><br/>Fang Wang’s voice echoed through the Mortal Realm, even louder than those of Great Saints and Great Emperors. His tone was light, as if he was whispering in the ears of all beings, yet the assertiveness in his words was enough to make any creature revere him.<br/><br/>As his voice faded, the heavens and earth fell into a momentary silence, the roaring voices all disappeared, with only the white pillars of light encircling Kunlun yet to dissipate.<br/><br/>The Canglan Emperor still stood atop the tip of the red giant sword, motionless, his gaze unfocused.<br/><br/>The Overbearing Saint hung upside down above Fang Wang, still in a fist-clenching pose, exuding a domineering aura, his eyes filled with intimidation.<br/><br/>Eighteen Layers of Abi Hell!<br/><br/>Fang Wang felt although they were strong, they had not surpassed the level of Cang He Immortal Monarch.<br/><br/>Now that he was far superior to his former self, facing Cang He Immortal Monarch again would mean pressing him to death with a single finger.<br/><br/>Fang Wang could sense that from all around, nine Great Saints and Great Emperors were watching him with covetous eyes, and at the edge of the heavens and earth, other formidable beings were awakening.<br/><br/>Heavenly Dao Spiritual Qi spread throughout the Mortal Realm; countless beings began practicing the Heavenly Dao, which naturally affected the fate of the Saint Dao and Imperial Dao. The souls of those Emperor Saints hidden in the shadows, whether directed by others or unable to restrain themselves, were coming forth.<br/><br/>Fang Wang couldn’t be bothered to investigate their reasons; he wanted to see just how many would come to block his path!<br/><br/>The more who came, the more he would extinguish!<br/><br/>To establish a new dao, he had to display his might to all beings!<br/><br/>The world sank into silence for nearly ten breaths, and at the same time, towering figures appeared out of nowhere from all directions of Kunlun. They stood like giants, with Kunlun appearing as a mere mound in front of them.<br/><br/>There were a total of nine, all Great Saints or Great Emperors!<br/><br/>Throughout the Descending Dragon Continent, every being could see their formidable figures, and everyone who witnessed them was wide-eyed, as if beholding a divine spectacle.<br/><br/>“Hmph!”<br/><br/>With a cold snort, Fang Wang raised his right hand and reached toward the sky.<br/><br/>One Great Saint, who was about to speak and shimmering with purple light, suddenly vanished. It wasn’t just him; the other Emperor Saints did the same.<br/><br/>As Fang Wang raised his hand, the nine towering Emperor Saints disappeared into thin air, and even the Canglan Emperor and Overbearing Saint turned into ash, gone in an instant.<br/><br/>The red light of the giant sword that spanned the firmament turned into a wave, decorating the sky, destined to fade with the wind.<br/><br/>The Emperor Saints’ imposing arrival shook the heavens and the earth, but their departure was swift, so quick that the onlooking beings didn’t have time to react.<br/><br/>All beings held their breath and concentrated, not daring to be careless, thinking that a battle beyond imagination would follow.<br/><br/>However, as time passed, nothing happened.<br/><br/>More and more beings began to awaken, discussing with each other, their spirits lifted to extremes.<br/><br/>“Were those who appeared Great Saints, Great Emperors?”<br/><br/>“Why were there so many?”<br/><br/>“Didn’t you hear what Heavenly Dao said? The grace of resurrection indicates that these powers had just been revived.”<br/><br/>“Great Saints, Great Emperors could revive; so why didn’t they appear earlier?”<br/><br/>“It turns out the fear of Immortal Divines by Great Saints and Great Emperors is real. They didn’t dare revive before, and now they are afraid others might become immortal.”<br/><br/>“But I feel Heavenly Dao can truly lead me to become an Immortal. Did you feel it? Cultivating beside these Golden Lotuses feels completely different from regular cultivation.”<br/><br/>The words of the Emperor Saints didn’t lead the beings’ beliefs astray, for they truly felt the fortune they received. Even those with mediocre talents could clearly sense the presence of nature’s spiritual energy, which made them extremely excited.<br/><br/>Fang Wang remained seated in meditation. Eradicating eleven Emperor Saints had not drained much of his Heavenly Dao Force, and his mastery over the Great Returning Void Palm had reached the stage of divine perfection.<br/><br/>He could feel the formidable auras from all directions stirring restlessly, retreating; the vision of Emperor Saints was incomparably beyond the reach of mortals. Witnessing him annihilate eleven Emperor Saints, the hidden Emperor Saints knew he was unstoppable.<br/><br/>Annihilating eleven Emperor Saints did not cause even a ripple in Fang Wang’s state of mind.<br/><br/>Although he had already become a Heavenly Dao True Immortal, the Heavenly Phenomenon stirred up by the Heavenly Dao Myriad Classic of Laws still continued. According to his estimation, it would last a month, which would be a great fortune that the Mortal Realm would rarely encounter in a million years.<br/><br/>The closer to Kunlun one was, the greater the fortune received.<br/><br/>Fang Wang closed his eyes once again, waiting patiently.<br/><br/>Hong Chen sighed, “It’s done.”<br/><br/>The Solitary Life Elder nodded furiously, his face full of an excited smile.<br/><br/>Not far away, the Thousand Eyes Great Saint also revealed a smile, as if he too had breathed a sigh of relief.<br/><br/>The white pillars of light that surrounded Kunlun began to dissipate, peace was restored to the world, and the common people continued to comprehend the Dao.<br/><br/>In the days that followed, no Emperor Saint dared to intrude again.<br/><br/>A month passed in the blink of an eye.<br/><br/>As the Heavenly Dao Golden Lotus enveloping the Descending Dragon Continent began to dissipate, transforming into specks of gold that drifted in the sky.<br/><br/>Fang Wang opened his eyes; he stepped towards the heavens, and in an instant, the Firmament reflected the illusion of his ascent. As the Heavenly Dao Golden Lotus on the ground disappeared one by one, more and more beings awoke—whether cultivators or demons, they all instinctively looked up at the Firmament. When they saw the illusion of Fang Wang ascending, they couldn’t help but widen their eyes.<br/><br/>Not just in the Descending Dragon Continent, but every being in the Eastern Mortal Realm and Western Mortal Realm, upon looking up could see the heavenly phenomenon. Fang Wang, clad in white, was walking into the heavens, his white garment fluttering, like an Immortal Monarch, his face blurred, but this very fact made him seem even more mysterious and majestic.<br/><br/>Somehow, upon seeing the illusion, they inexplicably guessed the identity of the other party.<br/><br/>Wangdao Master, Mortal Realm’s Heavenly Dao!<br/><br/>“That is…”<br/><br/>Yang Lin’er, who was flying with her sword, looked up towards the Firmament, her heartbeat quickening with eyes full of surprise.<br/><br/>It was Fang Wang!<br/><br/>Although she could not clearly remember Fang Wang’s figure, the moment she saw it, she recognized him instantly.<br/><br/>During this month, she, too, was comprehending the Dao; unexpectedly, just as she began to fly, she saw the person she most wanted to meet.<br/><br/>In the process of comprehension, she found her Cultivation Technique extraordinarily aligned with the Heavenly Dao Spiritual Qi; the so-called Heavenly Dao seemed tailor-made for her, which led her to connect Fang Wang with the Wangdao Master, yet she didn’t dare to confirm that the Wangdao Master was Fang Wang.<br/><br/>At that moment, numerous speculations flooded Yang Lin’er’s mind.<br/><br/>She even felt that her transmigration was a conspiracy targeting Fang Wang.<br/><br/>Why would Fang Wang, so powerful, choose to live in seclusion on Earth?<br/><br/>She thought back to the first time she saw Fang Wang, when he was dressed in ancient attire—could it be that he had accidentally transgressed through time then?<br/><br/>As Yang Lin’er was wildly conjecturing, her gaze shifted subtly. Following it, the ascending Fang Wang stopped. Raising his right hand, the illusion in the Firmament zoomed in and out; Fang Wang appeared tiny, while the majestic Kunlun emerged clearly, presenting a top-down view.<br/><br/>Fang Wang, who towered above Kunlun, seemed like an Immortal Divine in control of the Mortal Realm.<br/><br/>Immediately after, Yang Lin’er saw a sight she would never forget for the rest of her life.<br/><br/>The same was true for all beings below, each of them staring agape.<br/><br/>As Fang Wang raised his hand, huge boulders from all around Kunlun rose swiftly, flying towards Kunlun’s peak, and the entire Kunlun began to tremble violently.<br/><br/>With just a gesture, heaven and earth quaked!\t\t\t\t\t\t</div>", "images": {}, "success": true}