{"id": 448, "url": "https://www.novelhall.com/i-became-an-immortal-on-mortal-realm-32879/15059343.html", "title": "Chapter 438 - Chapter 438: Chapter 435: The Heaven And Earth Of Emperor Saint", "volume": 5, "volume_title": "Volume 5", "body": "<h1>Chapter 438 - Chapter 438: Chapter 435: The Heaven And Earth Of Emperor Saint</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 438: Chapter 435: The Heaven and Earth of Emperor Saint<br/><br/>I’ve brought the Heavenly Dao here!<br/><br/>This statement echoed incessantly in the dim world, causing True Venerable Kongdu to become extremely tense. He dispersed his divine consciousness, only to discover that this world seemed like another Mortal Realm, vast and boundless, permeated with a breath that chilled him to the bone.<br/><br/>True Venerable Kongdu couldn’t help but ask in a low voice, “Dao Master, what should we do?”<br/><br/>Considering the words of the mysterious giant face, that True Venerable must be very strong!<br/><br/>Fang Wang responded, “This is the lair of Great Saints and Great Emperors; there are so many Emperor Saint auras. It should be neither the Mortal Realm nor the Underworld.”<br/><br/>The world of Emperor Saints?<br/><br/>True Venerable Kongdu’s face paled with shock, and he grew even more anxious.<br/><br/>Residing in the Endless Realm, he had not witnessed the scene of Fang Wang becoming an Immortal and annihilating eleven Emperor Saints when he ascended. While he knew Fang Wang was stronger than an ordinary Great Saint, the enemies were numerous Emperor Saints. Could the Dao Master withstand them?<br/><br/>If he could, why would he have been pulled into this realm?<br/><br/>Fang Wang raised his right hand and condensed the Heavenly Palace Halberd.<br/><br/>Hum——<br/><br/>The blade of the halberd vibrated, and a rainbow light soared along the blade into the sky. A domineering and unparalleled aura burst forth, ravaging the entire world, with the roar of the True God of the Heavenly Palace echoing faintly.<br/><br/>The strength of a Lifespirit Treasure is related to its owner’s cultivation. After achieving the status of Heavenly Dao True Immortal, Fang Wang truly activated the power of the Heavenly Palace Halberd.<br/><br/>True Venerable Kongdu turned his head and looked on with a face filled with fear.<br/><br/>It was his first time feeling such a powerful aura, and it was emanating from a Lifespirit Treasure no less.<br/><br/>Fang Wang, sensing the vast power contained within the Heavenly Palace Halberd, reflected inwardly with a sigh.<br/><br/>Following me has truly wronged you!<br/><br/>The Heavenly Palace Halberd was a Lifespirit Treasure created by the Heavenly Palace itself. As for the origins of the Heavenly Palace Halberd, Fang Wang had always been curious. Even after communicating with his former eight incarnations, he still was unclear about its origins.<br/><br/>Every previous incarnation had mastered the Heavenly Palace Halberd, and the True God of the Heavenly Palace in particular had brought it to its limits, focusing his entire life’s cultivation on the halberd.<br/><br/>Fang Wang was different; he was more invested in the seclusion within the Heavenly Palace, leading to his mastery of many Secret Techniques. The Heavenly Palace Halberd was just one of many tools for him.<br/><br/>As the Heavenly Palace Halberd suddenly appeared in this world, its domineering aura alarmed the hidden Emperor Saints of this world. One by one, powerful divine consciousnesses locked onto them, causing True Venerable Kongdu to shiver, and he instinctively moved closer to Fang Wang, devoid of any Celestial Qiankun grandeur.<br/><br/>“Today, let me experience the power of the Great Saints and Great Emperors!”<br/><br/>Fang Wang’s voice rang out. He had deliberately allowed the giant face to pull him into this realm. He had spent four thousand years in the Heavenly Palace, practicing the Karmic Technique to Great Perfection. Through the Great Perfection of the Karmic Technique, he deduced that True Venerable Kongdu had become entangled with many Great Saints and Great Emperors. This led him to think of the mysterious being uniting Great Saints and Great Emperors, so he pretended to be careless, giving the giant face an opportunity.<br/><br/>As his words ended, golden armor began to surface on Fang Wang, followed by him taking out the Fox Mask from the Dragon Jade Ring and putting it on.<br/><br/>His ninth Lifespirit Treasure, the Tianling Body!<br/><br/>True Venerable Kongdu was seeing such an image of Fang Wang for the first time. In his mind, Fang Wang had always been the image of a noble sage with Immortal Aura and Daoist Bones. He had not expected to see this side of him, resembling a War God.<br/><br/>From Fang Wang at this moment, he felt an aura of unmatched invincibility and irreplaceability.<br/><br/>Fang Wang, carrying the Heavenly Palace Halberd, stepped forward, and True Venerable Kongdu hurriedly followed.<br/><br/>Suddenly, a white light appeared at the end of the earth, turning night into day. An incredibly huge figure rose to its feet, its posture like that of an ancient demon god awakening from a deep slumber.<br/><br/>“Hmph, arrogant. Do you truly believe you can scorn the path of Emperor Saints?”<br/><br/>An authoritative and booming voice sounded, making the ground tremble.<br/><br/>…<br/><br/>Time flies, and it has been thirty years since the Heavenly Dao led to becoming an Immortal.<br/><br/>In these thirty years, the spread of the Heavenly Dao was astoundingly fast, and across the Mortal Realm, the foundations of the practice in the Heavenly Dao Immensity Scripture could be found. If other paths were impassable, all living beings would attempt to cultivate through the Heavenly Dao.<br/><br/>With such great merit, all beings were grateful to the Wangdao Master and acknowledged the existence of the Heavenly Dao True Immortal in their hearts.<br/><br/>Against such a backdrop, the world’s strife intensified further, and the cultivation methods of the Heavenly Dao enabled many ambitious individuals to become stronger. Some even created new Divine Skills and Secret Techniques on top of the Heavenly Dao’s cultivation framework.<br/><br/>On the wooden bridge where Fang Wang was cultivating in Sword Heaven Marsh, Yang Lin’er was meditating; the spiritual energy here was incredibly abundant. Coupled with Fang Wang’s constant cultivation on these grounds, the dense celestial rules greatly accelerated her cultivation progress.<br/><br/>A breaking sound from the sky caught Yang Lin’er’s attention, and she looked up, her beautiful eyes flashing with confusion.<br/><br/>Lately, disciples from Wangdao Xuan Zong frequently hurried back, as though there was some important intelligence.<br/><br/>Traveling from the Western Mortal Realm to the Descending Dragon Continent, she witnessed too much conflict. The Descending Dragon Continent was the only sanctuary left, and even the surrounding Southern Celestial Sea was engulfed in the chaos of troubled times.<br/><br/>She was somewhat concerned that the Descending Dragon Continent would also be drawn into the conflicts, especially since Fang Wang’s true self seemed absent.<br/><br/>Arriving at Sword Heaven Marsh, she was brought here by Dugu Wenhun to cultivate. She also learned whose cultivating ground this was, undoubtedly confirming Fang Wang as the Wangdao Master.<br/><br/>But Fang Wang had not met with her, which she believed was not out of unwillingness, but because he was absent.<br/><br/>With a splash!<br/><br/>A purple figure leaped out from the lake; it was unmistakably Xiao Zi. Xiao Zi hovered in front of Yang Lin’er, scrutinizing her.<br/><br/>Yang Lin’er looked at Xiao Zi and felt a sense of familiarity.<br/><br/>Suddenly, she remembered the first time she saw Fang Wang; he had such a doll with him. She realized it was not a doll, but a real dragon.<br/><br/>Yang Jun hadn’t gone mad; his rescue was orchestrated by Fang Wang.<br/><br/>With that thought, a warmth surged through Yang Lin’er’s heart.<br/><br/>Xiao Zi spoke up, “I’ve discovered an opportunity. Are you interested in joining me?”<br/><br/>Yang Lin’er inquired, “Why seek me out?”<br/><br/>“With you, it’s more assured. Although your cultivation is mediocre, should danger arise, the young master will surely appear. Don’t worry, I will also invite other Wangdao powerhouses to join us,” Xiao Zi huffed, seemingly reluctant.<br/><br/>Her words made Yang Lin’er smile. After thinking it over, she agreed.<br/><br/>On her way here, she had already heard that the Wangdao Master kept a dragon, his most favored mount. Surely, Xiao Zi would not harm her.<br/><br/>“What opportunity is this?” Yang Lin’er asked curiously.<br/><br/>With a secretive air, Xiao Zi said, “An opportunity from The Upper Realm. There are many remnants left by Immortal Divines in this Mortal Realm. It is said that the Heavenly Gate will soon open, and the scramble for fate among the people is to vie for the chance to ascend. Why bother ascending if we can obtain the Immortal Divine’s inheritance in advance?”<br/><br/>“Why don’t you cultivate the Heavenly Dao?” Yang Lin’er asked.<br/><br/>“Naturally, I cultivate the Heavenly Dao. But we must also vie for the treasures of the Immortal Divines. So, tell me, will you go or not?”<br/><br/>“Then let’s go,” she said.<br/><br/>Yang Lin’er stood up and followed Xiao Zi away.<br/><br/>Meanwhile.<br/><br/>Within a grand hall, Divine Sects were holding a conference.<br/><br/>The Thousand Eyes Great Saint spoke, “To my knowledge, Emperor Shi Yu, who allied with Yang Du, is not a revival of an ancient Great Emperor. He must have recently become an Emperor or hail from another world. Their mass capture of powerful Cultivators and Demons suggests they have a grand conspiracy.”\t\t\t\t\t\t</div>", "images": {}, "success": true}