{"id": 443, "url": "https://www.novelhall.com/i-became-an-immortal-on-mortal-realm-32879/15052517.html", "title": "Chapter 433 - Chapter 433: Chapter 430: The Heaven Emperor’S Astonishment, Immortal Divine Tremor", "volume": 5, "volume_title": "Volume 5", "body": "<h1>Chapter 433 - Chapter 433: Chapter 430: The Heaven Emperor’S Astonishment, Immortal Divine Tremor</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 433: Chapter 430: The Heaven Emperor’s Astonishment, Immortal Divine Tremor<br/><br/>While various parties in the Mortal Realm were shocked by Fang Wang’s declaration, Fang Wang himself had already been immersed in his cultivation practice.<br/><br/>The new Heavenly Dao Myriad Classic of Laws only required one circulation to enable him to achieve the rank of Heavenly Dao True Immortal!<br/><br/>Throughout the process of cultivation, scenes from his past life experiences flashed before his eyes.<br/><br/>There were memories of an ordinary life on Earth, carefree childhood days in the Fang Residence of Southern Hills City, the night he drew his sword to save his kinsmen, and the scene of him taking the Great Abyss Gate assessment.<br/><br/>Memories passed swiftly, and after Fang Wang watched his entire life unfold, his numb heart gradually stirred with emotion.<br/><br/>He suddenly realized that he might not be the same person as those so-called previous eight lives, for he had always regarded himself as an Earthling, while those past lives never mentioned Earth.<br/><br/>Finally, he felt a spark of fighting spirit.<br/><br/>Becoming an invincible Immortal had already lost its allure to him, but after achieving immortality, he could pursue the way back home.<br/><br/>Earth in the Xuandu Realm was not the Earth he belonged to, but where exactly was his Earth?<br/><br/>Boom!<br/><br/>Fang Wang’s aura surged once again, and the golden light spread from beneath him, forming a majestic golden lotus. In no more than a few breaths, it expanded over a thousand zhang in diameter, and all the beings at the foot of Kunlun’s surrounding mountains could see it. In their eyes, it was as if a golden lotus had bloomed suddenly amid the clouds in the sky, an awe-inspiring sight.<br/><br/>The laws of heaven and earth trembled, causing auroras of various colors to appear in the Firmament. The entire Mortal Realm fell into a fantastical atmosphere within an extremely short time.<br/><br/>The cultivators of the Tiangong Sect who were building on Kunlun Mountain quickly retreated, fearing they might be affected by Fang Wang.<br/><br/>The common folk across the Descending Dragon Continent could feel Fang Wang’s vast presence.<br/><br/>No matter their level of cultivation, all beings had an impulsive desire to prostrate in worship, including Hong Chen and Solitary Life Elder.<br/><br/>“Are you sure immortality can’t be achieved in the Mortal Realm?”<br/><br/>Unable to contain himself, Solitary Life Elder turned to Hong Chen and asked with an excited tone.<br/><br/>He had bet correctly!<br/><br/>And he had sneaked into Kunlun just before Fang Wang’s imminent ascension to immortality!<br/><br/>If he had come just a few decades later, would an Immortal like Fang Wang have even noticed him?<br/><br/>Hong Chen’s eyes, filled with complexity, gazed upon the summit of Kunlun Mountain. He could feel that Fang Wang’s presence was no less than that of Immortal Divines from The Upper Realm, not in terms of strength or weakness, but in the essence of life itself.<br/><br/>Moreover, the Spiritual Energy around Kunlun was also changing. A kind of Spiritual Energy he had never experienced was erupting from Kunlun like a torrent, sweeping across all directions of heaven and earth.<br/><br/>A grand opportunity!<br/><br/>Even though Hong Chen had once been a Heaven Emperor, he had never witnessed such fortune in The Upper Realm.<br/><br/>He suddenly harbored a speculation so outrageous that even he found it preposterous.<br/><br/>Could Fang Wang be ascending to an existence higher than the Immortal Divines?<br/><br/>“Could it be that the Immortals of the Mortal Realm are superior to those of The Upper Realm?” Hong Chen murmured to himself, the more he thought about it, the more likely it seemed.<br/><br/>If not, why has The Upper Realm been unable to eradicate Xuanzu’s World?<br/><br/>Why does Xuanzu’s World always give birth to beings that cause headaches for The Upper Realm, and even have the power to overturn it?<br/><br/>Perhaps the Immortals from the Mortal Realm have always been the true Immortals, but at some point, the Mortal Realm fell into decline, and a group of beings created a higher plane of existence, establishing themselves as Immortal Divines and oppressing the multitude of sentient beings?<br/><br/>Hong Chen’s heart grew increasingly fervent, and his gaze shifted to the Firmament, talking to himself, “You must have felt it by now, right? Powerless through the force of the Supreme Saint, are you now in a panic, or are you filled with rage?”<br/><br/>Solitary Life Elder, hearing his words, asked curiously, “Are you referring to the Immortal Divines?”<br/><br/>Hong Chen glanced at him and said, “You haven’t really forgotten your origins, have you?”<br/><br/>Upon hearing this, Solitary Life Elder hurriedly asked, “Do you know my origin?”<br/><br/>In front of Hong Chen, he no longer referred to himself with humility, as he knew that any pretense of mystery was useless before Hong Chen.<br/><br/>“Hehe,” Hong Chen chuckled coldly but did not reply.<br/><br/>The Solitary Life Elder immediately became anxious and began to press for answers, but Hong Chen simply refused to respond.<br/><br/>…<br/><br/>Above the Cloud Sea, Lord of the Golden Command, who sat in meditation in front of the Golden Stele, suddenly opened his eyes and looked up at the stele.<br/><br/>He saw that the surface of the Golden Stele burst forth with colorful beams of light, all converging on one area and blending into a colorful orb of light.<br/><br/>“This is… how is this possible!”<br/><br/>Lord of the Golden Command narrowed his eyes, and within just a couple of breaths, his face underwent a drastic change.<br/><br/>“Heaven’s secrets are in chaos, the Great Dao reappears! Moreover, it’s within the Mortal Realm; this signifies a great upheaval!”<br/><br/>Lord of the Golden Command trembled all over, crying out in a voice that could not maintain its usual composure.<br/><br/>Boom—<br/><br/>A loud, resonant bell sound rang out, continuous and unending, as if thousands of divine beings were roaring in unison.<br/><br/>Lord of the Golden Command took a deep breath, then turned into a streak of golden light, soaring swiftly upward and vanishing from sight.<br/><br/>…<br/><br/>For Fang Wang, cycling through the Heavenly Dao Myriad Classic of Laws in a full rotation was not difficult; he only used the time it takes an incense stick to burn. At the moment of completion, the rules of heaven and earth surged violently into his body.<br/><br/>His body emitted a radiance of seven-colored light.<br/><br/>Fang Wang suddenly felt the Immeasurable Pure Bone within him become scorching hot; this heat did not cause him any discomfort but instead felt rather pleasant.<br/><br/>This was the process of transformation into a Heavenly Dao True Immortal. Up until now, the Immeasurable Pure Bone and the Heavenly Gang Supreme Yang Tyrant Body had been incompatible, these two powers could only coexist, not merge.<br/><br/>Now, his flesh and bones were undergoing a miraculous fusion.<br/><br/>Not only that, Fang Wang could perceive the world around him even without opening his eyes—this was his Heart’s Eye.<br/><br/>Within the vision of the Heart’s Eye, the rules of heaven and earth came alive; as if they also possessed life, expressing their emotions to him.<br/><br/>Different heaven and earth rules exuded different emotions, some angry, some gentle, some bone-chillingly cold, some hot as blazing flames.<br/><br/>Fang Wang began to comprehend the rules of heaven and earth, understanding the makeup of the Mortal Realm.<br/><br/>He felt as if he had arrived in an entirely new world, a world he had never seen before, bizarre and beautiful, yet filled with an endless sense of mystery.<br/><br/>Suddenly.<br/><br/>Fang Wang felt his body stagger, and he instinctively opened his eyes, only to find himself on an isolated island.<br/><br/>The Firmament was cloudless; the ocean surrounding the solitary island was deathly still, without a ripple on the water’s surface. At a glance, no other creatures could be seen, nor could a second island be discerned.<br/><br/>His gaze fell on the dense forest on the island; the spaces between the trees were very dark, as if they were portals to Jiu You.<br/><br/>A series of faint footsteps came from the forest, and soon a figure reached the edge of the woodland, pausing in the shadow of the trees.<br/><br/>He was a man as handsome as an Immortal Monarch painted in pictures, clad in a white robe embroidered with golden clouds and seas and fiery red suns, while the hem depicted an undulating mountain range with a row of white cranes flying at his waist.<br/><br/>His shoulder-length hair was casually draped over, with a silver crown atop his head, looking like an immortal divine figure misplaced in the Mortal Realm, emanating an immortal aura that was above all creatures.<br/><br/>Fang Wang had never seen this man before.<br/><br/>The man in the white robe revealed a smile, his voice filled with sentiment, “It has finally appeared; the Path of Immortality in the Mortal Realm is beginning to awaken. Junior, which path do you tread? The Saint Dao or the Imperial Dao?”<br/><br/>Fang Wang replied calmly, “I tread my own path, the Heavenly Dao.”<br/><br/>“The Heavenly Dao?”<br/><br/>The white-robed man seemed to recall something, his face showing nostalgia, “Heavenly Dao, such an ancient name.”\t\t\t\t\t\t</div>", "images": {}, "success": true}