{"id": 440, "url": "https://www.novelhall.com/i-became-an-immortal-on-mortal-realm-32879/15047978.html", "title": "Chapter 430 - Chapter 430: Chapter 427: Mysterious Lonely Fate, Nine Lifetimes Of Cultivation", "volume": 5, "volume_title": "Volume 5", "body": "<h1>Chapter 430 - Chapter 430: Chapter 427: Mysterious Lonely Fate, Nine Lifetimes Of Cultivation</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 430: Chapter 427: Mysterious Lonely Fate, Nine Lifetimes of Cultivation<br/><br/>“`<br/><br/>Looking at the eight figures ahead, Fang Wang asked, “Who is the An Tian Emperor?”<br/><br/>As soon as these words were spoken, the True God of the Heavenly Palace and the seven Fang Wangs all fell silent, looking at each other with no one replying.<br/><br/>The True God of the Heavenly Palace said with emotion, “It seems we are not that last Grand An Divine Emperor, I too thought that I was the reincarnation of the An Tian Emperor.”<br/><br/>His words drew everyone’s attention, and Fang Wang also looked at him.<br/><br/>The True God of the Heavenly Palace said earnestly, “You don’t need to concern yourself with those matters. Just remember, your past life only includes us.”<br/><br/>The original Fang Wang followed with a laugh, “Thanks to my Nine Lives Nirvana Sword Technique, otherwise there wouldn’t be any of you.”<br/><br/>Fang Wang couldn’t help but look at this version of himself and asked curiously, “Did you create the Nine Lives Nirvana Sword Technique?”<br/><br/>The original Fang Wang shook his head and said, “Of course not. It is just the most powerful technique I acquired in this life, taught to me by a senior known as the Solitary Life Elder.”<br/><br/>Solitary Life Elder?<br/><br/>Fang Wang felt like he had heard the name somewhere before, and soon he remembered.<br/><br/>Hong Xian’er had mentioned that she had encountered a mysterious master who claimed that Fang Wang could become the greatest in the world.<br/><br/>Fang Wang couldn’t help but reflect inwardly that there truly were countless hidden masters in this world, living among the common folk, not seeking fame, and perhaps living more freely than Great Saints and Great Emperors.<br/><br/>“What is the origin of this Solitary Life Elder? I’ve met him as well. My Nine Lives Nirvana Sword Technique was also passed down to me by him,” another Fang Wang asked.<br/><br/>They corresponded to the parallel time spaces of Fang Wang; they weren’t born earlier than Fang Wang, and the Solitary Life Elders they encountered could very well be the Solitary Life Elder from Fang Wang’s current timeline.<br/><br/>The Nine Lives Nirvana Sword Technique allowed one to be reborn and return to a certain point in the past but not exceed a past without oneself.<br/><br/>When Xu Yan first passed on the Nine Lives Nirvana Sword Technique to him, Fang Wang felt it was related to his eight previous lives.<br/><br/>Indeed, it was so!<br/><br/>If he relied on the Nine Lives Nirvana Sword Technique, then what did Zhou Xue rely on?<br/><br/>And the mysterious individual who had been reborn longer than Zhou Xue, what did they rely on for their rebirth?<br/><br/>The past selves of Fang Wang began to share their understanding of the Solitary Life Elder and found that all of them knew very little about him. Their interactions were brief, and after passing on the Nine Lives Nirvana Sword Technique, the Solitary Life Elder disappeared from their lives.<br/><br/>Among the first eight lives, only the True God of the Heavenly Palace ascended; the previous seven all died in battles, some at the hands of other geniuses, some at the hands of Immortal Divine beings.<br/><br/>Ji Rutian and Yang Du were once the enemies in two of his past lives.<br/><br/>There was also a being called Emperor Cangtian who possessed the Nine Lives Precious Spirit, and Fang Wang died at his hand in two of his lives.<br/><br/>Fang Wang silently noted the name, intending to settle things with him later.<br/><br/>Emperor Cangtian was probably the Nine Lives Precious Spirit genius whose real name Zhou Xue was reluctant to reveal.<br/><br/>Fang Wang was not in a hurry to cultivate because he knew this period of seclusion would certainly be long. It was better to thoroughly understand the experiences of his past lives.<br/><br/>From his first life, he possessed the Heavenly Palace, but because he spent too much time within it, he dared not use it lightly. Even in death, he only used the Heavenly Palace a few times.<br/><br/>The subsequent lives were similar. The True God of the Heavenly Palace speculated that the reason they did not retain memories of their rebirths was related to the Heavenly Palace. It could be the palace’s self-protection mechanism. Even if memories were sealed, the influence on their characters across lives was retained, which ultimately shaped the Fang Wang of today.<br/><br/>When Fang Wang cultivated in the Heavenly Palace, whenever he was on the verge of not holding on, he would wonder if facing an unbeatable enemy, would he regret his past. Each time, this would trigger intense feelings of dread within him, which were not imaginary but born out of real experiences.<br/><br/>After several days of talking, Fang Wang finally closed his eyes to practice his cultivation.<br/><br/>His eight past selves sat around him in meditation, facing him, and closed their eyes along with him.<br/><br/>The new practice of the Heavenly Dao Myriad Classic of Laws began!<br/><br/>This sitting would be for the passage of many years!<br/><br/>Who knows how much time had passed.<br/><br/>Suddenly one day, Fang Wang abruptly opened his eyes, and the eight past selves did the same.<br/><br/>“`<br/><br/>In an instant, the grand hall of the Heavenly Palace transformed dramatically, and they found themselves atop Kunlun Mountain. Nature’s spiritual energy surged wildly, sweeping up all the clouds and forests in its path, raising green waves as flocks of birds flew past in formation.<br/><br/>Achievement unlocked!<br/><br/>With a boom!<br/><br/>A golden light descended from the sky, enveloping Fang Wang and his eight past selves.<br/><br/>Fang Wang wore a calm expression, while his eight past selves showed excitement. Even the True God of the Heavenly Palace could hardly conceal his exhilaration.<br/><br/>The Heavenly Dao Myriad Classic of Laws reached minor completion!<br/><br/>Directly transformed into an Immortal!<br/><br/>This was the Immortal of the Heavenly Dao, referred to by Fang Wang as the Heavenly Dao True Immortal!<br/><br/>Simply reaching minor completion of the new Heavenly Dao Myriad Classic of Laws was enough to achieve Immortality!<br/><br/>In the unseen, Fang Wang felt not just the vast Spiritual Energy but also the various heavenly and earthly laws between heaven and earth.<br/><br/>Only by standing above these heavenly and earthly laws could one truly roam free, unhindered by the Three Realms!<br/><br/>This was heaven and earth congratulating Fang Wang, a baptism of his life essence transformation.<br/><br/>This baptism lasted a full month!<br/><br/>After one month, the golden pillar of light dissipated, revealing Fang Wang’s figure. He looked unchanged, save for a faint glow emanating from his body—the divine light of a Heavenly Dao True Immortal!<br/><br/>Fang Wang immediately closed his eyes, continuing to break through towards Great Completion.<br/><br/>Intuition told him he had spent a long time, but this time, he felt time passed swiftly and did not cause him any discomfort.<br/><br/>Years went by, one after another, in quick succession.<br/><br/>Gradually, Fang Wang also felt the monotony.<br/><br/>However, every time he opened his eyes, he could see his eight past selves—they were all silently accompanying him.<br/><br/>Fang Wang’s heart inexplicably felt much lighter.<br/><br/>The True God of the Heavenly Palace spoke, “You’re close to success. Once you achieve the Heavenly Dao True Immortal that you aspire to, you will be entitled to eternal life and immortality!”<br/><br/>Fang Wang took a deep breath and continued his cultivation.<br/><br/>In the years that followed, his past selves continuously encouraged him, making him grit his teeth and persevere.<br/><br/>Finally.<br/><br/>He advanced the new Heavenly Dao Myriad Classic of Laws to Great Completion!<br/><br/>His Heavenly Dao Force surged, and his physical body mysteriously fused with the Immeasurable Pure Bone. His Dao Power and the Heavenly Dao Force could also be combined for use, increasing their strength.<br/><br/>Looking back, he had been in the Heavenly Palace for 230,000 years!<br/><br/>He had shattered all previous records for the longest time spent in seclusion in the Heavenly Palace!<br/><br/>The most crucial part was that he still couldn’t leave the Heavenly Palace because he had to cultivate the new Heavenly Dao Myriad Classic of Laws to Great Perfection!<br/><br/>Based on past experience, the time it takes to progress from Great Completion to Great Perfection is longer than the time from beginning practice to Great Completion.<br/><br/>230,000 years of accumulation made Fang Wang’s heart towards becoming an Immortal grow calm and untroubled.<br/><br/>In a certain sense, his Dao heart had also become a Heavenly Dao True Immortal; he had accepted his own strength and was accustomed to it.<br/><br/>Fang Wang spoke, “Let’s make a bet. How many years do you think I’ll need to reach Great Perfection?”<br/><br/>Seeing Fang Wang still interested in making a bet, his eight past selves all breathed a sigh of relief. They projected themselves onto Fang Wang and couldn’t imagine the torment of secluding himself in the Heavenly Palace for 230,000 years. They were not spirits now but just lingering wills. When Fang Wang’s attention was not on them, they ceased thinking, so they couldn’t sense the passage of time here.\t\t\t\t\t\t</div>", "images": {}, "success": true}