{"id": 449, "url": "https://www.novelhall.com/i-became-an-immortal-on-mortal-realm-32879/15083987.html", "title": "Chapter 439 - Chapter 439: Chapter 436: Both A Saint And An Emperor", "volume": 5, "volume_title": "Volume 5", "body": "<h1>Chapter 439 - Chapter 439: Chapter 436: Both A Saint And An Emperor</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 439: Chapter 436: Both a Saint and an Emperor<br/><br/>The words of Thousand Eyes Great Saint made everyone in the hall frown. An emperor from another land?<br/><br/>This was not a good omen!<br/><br/>Dugu Wenhun couldn’t help but look at Red Dust. Although he didn’t know the true identity of the Red Dust Celestial Emperor, after spending so much time together, he had developed a dependence on Red Dust, especially for intelligence.<br/><br/>Red Dust’s expression was calm, showing no hint of his inner thoughts.<br/><br/>“Emperor Shi Yu indeed comes from another Mortal Realm. He just went through a worldly conflict, gathering the fate of that realm. He was supposed to ascend, yet he didn’t. Instead, he chose to come to our realm, and what’s more, after the Dao Master became an Immortal. It’s difficult not to link him to Immortal Divine schemes,” Solitary Life Elder remarked casually, stroking his beard with an air of world-weariness that seemed to see through everything.<br/><br/>Everyone frowned.<br/><br/>Even before Fang Wang became an Immortal, they knew that Immortals and Gods did not tolerate Great Saints or Great Emperors. Since ancient times, every Great Saint or Great Emperor’s story ended with a struggle against the Immortals and Gods; they either bowed to the Immortals and Gods and ascended to immortality, or fought against them, leading to their death and the dissipation of their Dao.<br/><br/>In the face of such mythological backgrounds, all beings would regard the Immortal Divine as superior to Emperor Saints, which was also one of the important reasons Cultivators pursued ascension.<br/><br/>About two hundred years ago, the news that the Heavenly Dao had offended the Immortals and Gods spread throughout the Mortal Realm.<br/><br/>Jiang Shenming snorted, “Who is this Emperor Shi Yu? Never heard of him. If he is truly a great emperor, then I should like to meet him. As it happens, my insights are not bad lately. I will go find Yang Du and take the opportunity to deal with Emperor Shi Yu!”<br/><br/>With his words, the hall immediately became lively as people began to speak up.<br/><br/>Jiang Shenming had already proven his strength, and some even claimed that in terms of power, he was the first in the Dao Sect, second only to the Dao Master.<br/><br/>In particular, over the last few decades, Jiang Shenming’s aura had been growing stronger day by day, and even Heavenly Stem Venerate had said his strength was unfathomable.<br/><br/>Dugu Wenhun admonished, “Be gentle with Yang Du. After all, he hasn’t betrayed Wangdao or spouted heretical talk; it’s just that he acts too autonomously and needs to be disciplined.”<br/><br/>Jiang Shenming nodded. He was well acquainted with Yang Du, having sparred with him before; of course, Yang Du had never won. Beating Yang Du was like an adult hitting a child, a carefree and playful ease for him.<br/><br/>“Gentlemen, with the Dao Master achieving the rank of Heavenly Dao True Immortal, his might has shaken the entire world. Wangdao will enjoy more than a hundred years of peace. However, those with great fate will sooner or later fix their eyes on Wangdao. Troubles are unavoidable, especially in at most two hundred years; the Heavenly Gate will open, the Immortals and Gods will descend to the mortal plane. By then, Wangdao will not be able to avoid conflict, and everyone must prepare for the tribulation,” Red Dust said, capturing everyone’s attention.<br/><br/>Through years of dedication, although Red Dust was Xuan Zong, he held more prestige in the hearts of Wangdao Cultivators than even Vice Dao Master Dugu Wenhun.<br/><br/>With a tone as calm as it was cold, Red Dust stated, “This tribulation is destined to see sacrifices, but if we cross it, then even the chickens and dogs will ascend to heaven!”<br/><br/>Everyone’s eyes blazed with determination as they nodded solemnly.<br/><br/>…<br/><br/>Beneath a gloomy firmament, where nine blood moons hung high, two figures traversed the vast land—Fang Wang and Empty Degree True Person.<br/><br/>Empty Degree True Person, looking at Fang Wang carrying the Heavenly Palace Halberd, had eyes filled with admiration.<br/><br/>On the Heavenly Palace Halberd hung a corpse, dripping golden blood onto the ground. The blood burned a hole in the soil and a gorgeous golden flower sprouted there. Looking towards Empty Degree True Person’s rear, a trail of golden flowers had bloomed.<br/><br/>This was the corpse of a Great Saint!<br/><br/>Remembering that recent battle made Empty Degree True Person’s blood boil—the Great Saint, who had boasted of being undefeated for fifty thousand years, couldn’t withstand a single strike from Fang Wang.<br/><br/>That strike made Empty Degree True Person feel as if heaven and earth were about to shatter.<br/><br/>He asked cautiously, “Dao Master, why keep his corpse bleeding?”<br/><br/>In his view, Fang Wang had the power to obliterate the holy body into dust and smoke.<br/><br/>“If heaven and earth exist, then they do so under their own set of rules. A complete set of celestial rules is what generates nature’s spiritual energy and creates living beings. This realm has grown too desolate, and I wish for its revival,” Fang Wang answered calmly, his gaze fixed ahead.<br/><br/>Along the way, he had slain more than a hundred Emperor Saints, yet this region of heaven and earth seemed endless, with no horizon in sight.<br/><br/>His divine consciousness had probed this realm, and it was definitely larger than Xuanzu’s World; at least he had not yet seen the boundaries of this realm.<br/><br/>“Revive this world?”<br/><br/>Empty Degree, the true man, fell silent; he suddenly felt he didn’t understand Fang Wang and at the same time he experienced a kind of shock.<br/><br/>Could the world itself be treated as a living being?<br/><br/>Having reached the Celestial Qiankun Realm, he could sense the existence of the world’s rules, but he had been unable to thoroughly comprehend them; he always felt something was missing, and at this moment, it was as if he had grasped something.<br/><br/>“Amitabha! Benefactor, if you proceed further, that will truly be the point of no return. You have slain too many Emperor Saints, and karmic entanglements cling to you. Should you fail, the vast karmic consequences will backlash against the Heavenly Dao you have established; that’s also why they don’t besiege you.”<br/><br/>A voice, both loud and compassionate, sounded; Fang Wang did not stop moving as the holy body on the Heavenly Palace Halberd continued to bleed.<br/><br/>Empty Degree, the true man, was not anxious; he had come to believe that Fang Wang was invincible.<br/><br/>Coming to this world was not Fang Wang’s tribulation; it was the tribulation of this realm!<br/><br/>He was now curious about one thing: how many Great Saints and Great Emperors Fang Wang could slay.<br/><br/>To kill a path through ancient and modern Emperor Saints?<br/><br/>Thinking this, Empty Degree, the true man’s heart ignited with fervor.<br/><br/>He was witnessing the birth of a true myth!<br/><br/>They continued forward.<br/><br/>After a long time,<br/><br/>a figure appeared in front of them, a monk seated in meditation in front of a rock, hunchbacked and aged, his kasaya weathered and tattered as if through countless hardships.<br/><br/>As Fang Wang and his companion approached, the monk did not raise his head.<br/><br/>Fang Wang walked past him without pausing.<br/><br/>Empty Degree, the true man, glanced at him and felt a shiver of awe; the monk seemed devoid of life, akin to the holy bodies hanging upon the Heavenly Palace Halberd.<br/><br/>“The True Venerable leads thousands of Great Saints and Great Emperors. He is one of the oldest Great Saints of Xuanzu’s World and is also a founder of Great Emperors. He is both Saint and Emperor. He created this world beyond the Three Realms, not bound by yin and yang, an undying existence. He is now letting the karmic consequences of the Great Saints and Great Emperors gather upon you, and you are walking towards hell.”<br/><br/>The monk’s voice rose again, seemingly with a sigh.<br/><br/>Fang Wang did not look back.<br/><br/>Unable to help himself, Empty Degree, the true man asked, “May I inquire about the senior’s name?”<br/><br/>“Qi Yun.”<br/><br/>Empty Degree, the true man’s eyebrows lifted as he felt the name seemed familiar, but he had no time to ponder as he hastened to keep up with Fang Wang’s steps.<br/><br/>The monk lifted his eyes to Fang Wang, a murky glint of hope shining in them.<br/><br/>And so,<br/><br/>years passed by.<br/><br/>The holy body’s golden blood ran dry; Fang Wang casually flung it aside, and the body fell to the ground, instantly turning to ash.<br/><br/>Fang Wang then asked, “Have you realized it?”<br/><br/>Empty Degree, the true man frowned and replied, “I have realized just a little, shamefully.”<br/><br/>Fang Wang shifted the Heavenly Palace Halberd to his other shoulder and spoke leisurely, “The Heavenly Dao is the way of heaven and earth, to embrace heaven and earth is to enter the Dao. Next, I will show you the power of the Heavenly Dao, and a worthy opponent has just arrived.”\t\t\t\t\t\t</div>", "images": {}, "success": true}