{"id": 442, "url": "https://www.novelhall.com/i-became-an-immortal-on-mortal-realm-32879/15050509.html", "title": "Chapter 432 - Chapter 432: Chapter 429: Desiring To Become An Immortal In The Mortal Realm", "volume": 5, "volume_title": "Volume 5", "body": "<h1>Chapter 432 - Chapter 432: Chapter 429: Desiring To Become An Immortal In The Mortal Realm</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 432: Chapter 429: Desiring to Become an Immortal in the Mortal Realm<br/><br/>“`<br/><br/>The Solitary Life Elder revealed the secrets of heaven, but it did not make Fang Wang stop his steps, which made the Solitary Life Elder even more anxious.<br/><br/>“Dao Master, whatever you want to know, just ask me, I will certainly answer!”<br/><br/>The Solitary Life Elder caught up with Fang Wang’s pace, and said urgently, even with a pleading tone in his voice.<br/><br/>Fang Wang ignored him, strolling up the mountain path, but the Solitary Life Elder refused to give up, following close behind and incessantly speaking of the future trends of the world.<br/><br/>“As the Demon Race comes to the Mortal Realm, the Mortal Realm will face an unprecedented catastrophe, and a certain forbidden existence is searching for a vessel among mortals.”<br/><br/>“After the Heavenly Gate opens, yin and yang will be thrown into chaos, and the beings from the Nether Jiu You will also descend upon the Mortal Realm.”<br/><br/>“At that time, the battles among men, demons, monsters, gods, and immortals will never cease. The ancient Saint Emperor will resurrect from the deeps of the yellow earth and the sea, and the Master of Immortals Divines above the Three Realms will also incarnate, marking the greatest tribulation in history, and the scale of the catastrophe is constantly changing, surely orchestrated by an unfathomable existence behind the scenes.”<br/><br/>The more the Solitary Life Elder spoke, the paler his face became, as if he had frightened himself.<br/><br/>In fact, that was exactly the case, for the words he was now saying were just derived by him on the spot.<br/><br/>For some reason, when near Fang Wang, he could deduce even more variables, but he could never calculate Fang Wang’s fate.<br/><br/>A chilling guess began to take shape in his heart.<br/><br/>His voice grew weaker and weaker, and the distance from Fang Wang’s strides became increasingly vast.<br/><br/>Half an hour later.<br/><br/>Fang Wang stopped at the edge of a cliff, next to which stood a huge rock, statue-like. He turned his head and glanced at the Solitary Life Elder out of the corner of his eye.<br/><br/>The two were about a dozen steps apart. The Solitary Life Elder was right at the turn of the mountain path. Feeling Fang Wang’s gaze, he tightened inside.<br/><br/>“Do you still wish to join the Way of Hope now?”<br/><br/>Fang Wang’s voice floated into the ears of the Solitary Life Elder.<br/><br/>The Solitary Life Elder was silent, and then he bit his teeth and said, “I am willing!”<br/><br/>Even though Fang Wang was the greatest variable, he felt that the hope was even greater.<br/><br/>The reason he had hidden in Kunlun was that he realized that he would have difficulty protecting himself in the coming tribulations. Now, although terrified by the mysteries of Fang Wang, when he calmed down, greater expectations ignited in his heart.<br/><br/>No wonder even the Red Dust Celestial Emperor was willing to serve the Wangdao Master.<br/><br/>The more the Solitary Life Elder thought, the hotter his heart grew, as Fang Wang’s question meant there was already an intention to accept him.<br/><br/>Fang Wang spoke, “Go find Xuan Zong, and tell him I consent to you joining the Way. Until Kunlun is built, you may not set foot here again.”<br/><br/>Upon hearing this, the Solitary Life Elder hurriedly expressed his gratitude, then leaped up, flying towards Sword Heaven Marsh.<br/><br/>Fang Wang turned back and continued up the mountain.<br/><br/>Thereafter, Fang Wang encountered no others, for around Kunlun Mountain, the Disciples of the Way of Hope stood guard, making it not so easy to infiltrate.<br/><br/>Until the next morning, Fang Wang finally reached the summit of the mountain.<br/><br/>Kunlun was still rising ever higher. Standing at the edge of the cliff, Fang Wang could see Tiangong Sect cultivators tirelessly transporting boulders, placing them atop the Kunlun Mountain range, then using spells to fuse the rocks into one.<br/><br/>Apart from merging the mountain body, there were also people planting flora, setting up arrays to gather Spiritual Energy. Looking around, there were at least several hundred thousand cultivators busily at work.<br/><br/>Standing on the summit, Fang Wang looked down upon the Mortal Realm, from where Sword Heaven Marsh seemed a mere speck, like a small sword embedded in the earth.<br/><br/>Fang Wang gathered up the hem of his robe and sat down on the spot.<br/><br/>It was time to become an immortal.<br/><br/>“`<br/><br/>“`<br/><br/>His gaze sharpened, and he immediately began to channel his energy.<br/><br/>In an instant, a tremendous momentum burst forth from within him, shooting into the sky, scattering the clouds above, and causing the spiritual energy of the entire Kunlun to falter.<br/><br/>All living beings on the Descending Dragon Continent felt an extraordinary and domineering presence envelop them, an awe-inspiring force that directed countless creatures to look in the same direction.<br/><br/>The Taixuan Shenxiao Scripture, merged with the Heavenly Dao Myriad Classic of Laws, prompted the rules of heaven and earth in a very short time.<br/><br/>“I, the Heavenly Dao, desire to ascend to immortality in the Mortal Realm, to establish a Daoist temple in Kunlun, and to open a path to immortality for the Mortal Realm. The immortals of the Heavenly Dao shall be known as True Immortals, and all beings may cultivate!”<br/><br/>The voice of Fang Wang followed, loud and majestic, not only heard by every living being on the Descending Dragon Continent but throughout the Mortal Realm, all the while feeling his unreachable aura.<br/><br/>Sword Heaven Marsh.<br/><br/>Hong Chen and the Solitary Life Elder appeared by the lake at the same time, both visibly moved, looking towards Kunlun in disbelief.<br/><br/>“Can one also become immortal in the Mortal Realm?” The Solitary Life Elder couldn’t help but ask. He had just been discussing with Hong Chen about joining the Way of Hope, and was engrossed in their conversation when suddenly Fang Wang announced his intention to become an immortal!<br/><br/>Hong Chen, once the Heaven Emperor of the Immortal Court, also wore a look of incredulity, mumbling to himself, “How can one become immortal in the Mortal Realm? Could it be reaching a realm comparable to that of the Immortal Divines?”<br/><br/>In his eyes, Fang Wang had never been to The Upper Realm, nor had he ever clashed with true Immortal Divines; he didn’t understand the essence of Immortal Divines, so he thought a certain realm was the state of immortality.<br/><br/>The Solitary Life Elder looked towards Hong Chen and asked, “Are you sure you understand his realm?”<br/><br/>Hong Chen remained silent.<br/><br/>Meanwhile.<br/><br/>Far in the Western Mortal Realm, on an island, Yang Lin’er in white stood on the beach, looking towards the horizon, her eyebrows tightly knitted.<br/><br/>She also heard Fang Wang’s voice, and for some reason, she felt that the voice of the Heavenly Dao sounded somewhat similar to her husband, Fang Wang, but she dared not confirm it because Fang Wang had never spoken with such a commanding tone, and it had been many years since she left Fang Wang, her memory of his voice almost fading.<br/><br/>“The Heavenly Dao…”<br/><br/>Yang Lin’er murmured, suddenly feeling a strong urge to visit Kunlun in the Eastern Mortal Realm.<br/><br/>And it wasn’t just her; who knows how many cultivators and demons were shocked by the words of the Heavenly Dao, uncontrollably longing to journey to Kunlun in pursuit of the Immortal Law.<br/><br/>Across a boundless volcanic region, with magma covering the ground and mountains, and scorching fumes shrouding the world, it resembled the land of Purgatory.<br/><br/>Zhou Xue in a red robe turned around, her cape fluttering with the noise of the wind, her black hair whipped by the wild breezes, her gaze towards the horizon filled with amazement.<br/><br/>The Hongxuan Emperor materialized beside her, asking, “Fang Wang, that lad, is becoming an immortal. Did the person behind you provide him with the Immortal Law? But that shouldn’t be possible either, how can immortality be achieved in the Mortal Realm? Only The Upper Realm possesses the suitable Immortal Spiritual Qi!”<br/><br/>His face was animated, with emotions indistinguishable between excitement and apprehension.<br/><br/>Zhou Xue did not answer, simply continuing to gaze calmly towards the horizon.<br/><br/>With a booming sound!<br/><br/>Behind her, a volcano hundreds of miles away suddenly erupted, with billowing black gas following the exploding magma into the sky, coalescing into a monster’s soul resembling a dragon and a jiaolong, circling beneath the thunderclouds, letting out earth-shattering roars.<br/><br/>Zhou Xue withdrew her gaze, turned away, and said, “It’s time to deal with this abomination.”<br/><br/>The Hongxuan Emperor followed her turn, clicking his tongue in wonder, “A celestial soul is hidden in the Mortal Realm. Just who is the one behind you in the Immortal Court, to let you have such information?”<br/><br/>Zhou Xue vanished into thin air without a response.<br/><br/>The Hongxuan Emperor did not take action, his gaze involuntarily turning back.<br/><br/>More than Zhou Xue’s plan, he was curious whether Fang Wang could truly become an immortal.<br/><br/>At this moment, he thought of Fang Wang’s previous eight lives; in each life, Fang Wang stood before him, full of vigor. But this life was different – this Fang Wang had an air of someone who lorded over everything, and he was very curious why this life’s Fang Wang had undergone such a drastic change.<br/><br/>“`\t\t\t\t\t\t</div>", "images": {}, "success": true}