{"id": 454, "url": "https://www.novelhall.com/i-became-an-immortal-on-mortal-realm-32879/15141229.html", "title": "Chapter 444 - Chapter 444: Chapter 441: Feeling Heavenly Might", "volume": 5, "volume_title": "Volume 5", "body": "<h1>Chapter 444 - Chapter 444: Chapter 441: Feeling Heavenly Might</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 444: Chapter 441: Feeling Heavenly Might<br/><br/>“`<br/><br/>Facing the onslaught of spear shadows from all directions, Fang Wang did not use the Heaven of Carefree Freedom to turn ethereal, but instead unleashed the Dao Power of the Immeasurable Pure Bone, forcefully suppressing each and every spear shadow.<br/><br/>With a thrust of his halberd, the world suddenly shattered, bringing forth a world ablaze like a fiery furnace. As the Heavenly Palace Halberd continued to thrust forward, this furnace world shattered once more, replaced by a world filled with gigantic golden bamboos. Every leaf of the golden bamboo bore a small world, and countless trembling leaves were about to strike at Fang Wang, but that world also broke apart instantly.<br/><br/>With every thrust, worlds ceaselessly crumbled!<br/><br/>What Fang Wang was destroying were not actual worlds, but the Celestial Phenomenon of Emperor Saints.<br/><br/>In the course of the battle, he also felt the unique power of Great Saints and Great Emperors.<br/><br/>Beyond powers similar to the rules of heaven and earth, Great Saints follow the path of Celestial Phenomenon, their representations closely mirroring reality. The powerful among them could even condense the force of the world’s rules within their Celestial Phenomenon.<br/><br/>Great Emperors were different, placing more emphasis on the physical body and Spiritual Power, capable of forcibly breaking through the laws of the world with their cultivation.<br/><br/>But whether Great Saints or Great Emperors, they all relied on their own Lifespirit Treasure, rather than Magical Artifacts forged later on.<br/><br/>The True Venerable also charged at Fang Wang with his spear; the Golden Dragon Longspear clashed with the Heavenly Palace Halberd. Although there was a huge disparity in size between them, the Heavenly Dao Strong Light from the Heavenly Palace Halberd was immensely vast, bridging the gap a thousandfold.<br/><br/>Boom!<br/><br/>The clash of two supreme forces annihilated layers of Celestial Phenomena, flinging the attacking Great Emperors away.<br/><br/>Fang Wang and the True Venerable both landed, returning to the original Mysterious World.<br/><br/>The True Venerable’s stature shrunk, becoming as tall as Fang Wang. His black armor seemed to symbolize darkness, while Fang Wang’s Tianling Body radiated endless golden light.<br/><br/>The two stood tens of thousands of miles apart, exchanging a glance across the divide before instantly colliding, shattering the very ground beneath them.<br/><br/>A ferocious close-quarters battle erupted, with the True Venerable’s attacks being sharp and frenzied, while Fang Wang appeared more composed.<br/><br/>In terms of raw strength, the True Venerable was actually overpowering Fang Wang.<br/><br/>However, Fang Wang’s Heart of the Heavenly Dao had long reached a profound state, focusing his whole being into the fight, lending each move a touch of Divine Skills’ subtlety.<br/><br/>Cling—<br/><br/>The Heavenly Palace Halberd and the Golden Dragon Longspear clashed once again, sending shockwaves sweeping across the heavens and earth.<br/><br/>Qi Yun Great Saint used his Spiritual Power to resist, but he was still forced backward, and Kongdu the Immortal hastily applied his laws to assist him, yet he was of no help.<br/><br/>The two managed to hold out for only a few moments before being swept away by the gale that arose from the rules of the world, not just them but the majority of the Emperor Saints; only a few dozen Emperor Saints could still go to support the True Venerable.<br/><br/>Before long, Fang Wang found himself surrounded. The True Venerable led the attack, while other Emperor Saints used their Divine Skills to constrain him.<br/><br/>Fang Wang suddenly hurled the Heavenly Palace Halberd, striking the True Venerable head-on and forcing him to stagger, almost at the same moment, Fang Wang’s right hand formed the Qiankun Fan, sweeping it forth, a fierce blaze rose like a heavenly river from the ground, engulfing a dozen Emperor Saints and even tearing through the Firmament.<br/><br/>With a squeeze of his right hand, the Qiankun Fan dispersed, and the Heaven Bound Golden Silk appeared, wrapping around his waist, the other end transforming into a whip that spanned thousands of miles, sweeping across and shattering the wind waves en route, striking an Emperor Saint, breaking his Golden Body, blood spraying the Firmament.<br/><br/>Fang Wang stepped forward, gripping the Heavenly Palace Halberd in his right hand and leaping up, bringing it down with a furious smash.<br/><br/>Clang!<br/><br/>The True Venerable raised his spear to block, and the ruins below were catapulted upwards, bringing with them a fearsome blaze.<br/><br/>The more Fang Wang fought, the smoother he got, even starting to bridge the gap in strength with the True Venerable.<br/><br/>The True Venerable’s eyes burst with cold light, that amid the battle seemed like two silver streaks rapidly moving and elongating.<br/><br/>All of a sudden, the True Venerable smashed the Golden Dragon Longspear to the ground, a ring of black qi burst forth under his feet, swiftly sweeping past the ground beneath Fang Wang. In an instant, an unimaginable pulling force grabbed Fang Wang, dragging him into its midst.<br/><br/>As Fang Wang fell into the darkness, the True Venerable was about to act when suddenly, he paused, the cold light vanishing from his eyes.<br/><br/>“`<br/><br/>Boom!<br/><br/>A deep bell sound emerged from the darkness of the earth, throwing the souls of many Emperor Saints into disarray.<br/><br/>Fang Wang, standing on the Reincarnation Bell, leapt from the dark, and in this moment, the semblance of the sun and the moon rose behind his head, adorned with thousands of stars beneath them. His Tianling Body’s golden armor surged with silver radiant flames, and his black hair fluttered, shimmering with divine light.<br/><br/>His momentum began to surge wildly!<br/><br/>Even as he battled with the True Venerable, he never ceased to circulate the newly acquired Heavenly Dao Myriad Classic of Laws.<br/><br/>Once he practiced the Heavenly Dao Myriad Classic of Laws for an entire cycle, he would truly step into the realm of Heavenly Dao Mysterious Immortal!<br/><br/>Out of nowhere, the previously motionless True Venerable suddenly emerged before Fang Wang and struck out with a palm. In an instant, Fang Wang saw thousands of Emperor Saints, as if the entire rules of the world, simultaneously attacking him.<br/><br/>With a roar!<br/><br/>Fang Wang was knocked back tens of millions of miles, ripping the cloud sea of the gloomy firmament in two, as if the night sky had been cleaved in half.<br/><br/>Fang Wang steadied himself, forcefully suppressing the turbulent qi and blood within his body.<br/><br/>“Eighteen Layers of Abi Hell, what is your relation to Wuming Old Man?” asked the True Venerable.<br/><br/>He actually managed to forcibly break through the Eighteen Layers of Abi Hell in a single breath’s time.<br/><br/>Fang Wang shook his hands and replied, “Who is Wuming Old Man?”<br/><br/>With a single step forward, the True Venerable stirred up a terrible cyclone; tens of thousands of the world’s rules flooded into his body, causing his momentum to skyrocket.<br/><br/>“Wuming Old Man, just a wandering soul in the Mortal Realm, reluctant to pass on,” the True Venerable seemed reluctant to elaborate further.<br/><br/>At that moment, a black sun condensed behind him.<br/><br/>Fang Wang couldn’t help but ask, “Do you know the Taixuan Shenxiao Scripture?”<br/><br/>“A Cultivation Technique created by myself, what do you think?” the True Venerable said coldly, as the Shenxiao Sun behind his head suddenly soared into the sky, powerfully scattering the Town World Bead above.<br/><br/>The whole world suddenly felt heavier.<br/><br/>Fang Wang’s robes billowed, as the raging wind howled toward him, unable to shake his stance.<br/><br/>“You must have also cultivated my Taixuan Shenxiao Scripture, it’s time to use your full strength,” the True Venerable’s voice echoed across half the world.<br/><br/>Fang Wang retorted, “How do you know my strongest card is the Taixuan Shenxiao Scripture?”<br/><br/>As his voice fell, the gloomy world suddenly brightened, and Fang Wang’s flesh burst forth with a strong light that was even more dazzling than the bright sun, illuminating the land.<br/><br/>Heavenly Dao Myriad Classic of Laws circulated for a complete cycle!<br/><br/>Heavenly Dao Mysterious Immortal achieved!<br/><br/>In the midst of the extreme bright light, Fang Wang ascended, and no one could see his true face, only his silhouette.<br/><br/>Behind him, streaks of golden light appeared, resembling some kind of pattern, growing more and more numerous, gradually painting into a boundlessly magnificent golden scroll.<br/><br/>“True Venerable, you will be the first to face a Heavenly Dao Mysterious Immortal and feel the Heavenly Might,” said Fang Wang, his voice brimming with an oppressive sense that made all the Emperor Saints feel an indescribable pressure, as if their blood and Spiritual Power had solidified within them.<br/><br/>The True Venerable’s eyes widened, the Heavenly Dao Strong Light bleaching the color from his armor. In his pupils, only the image of Fang Wang and the golden scroll behind him remained.<br/><br/>“Heavenly Dao Mysterious Immortal… why…”\t\t\t\t\t\t</div>", "images": {}, "success": true}