{"id": 457, "url": "https://www.novelhall.com/i-became-an-immortal-on-mortal-realm-32879/15167910.html", "title": "Chapter 447 - Chapter 447: Chapter 444: The Eighteen Divine Pillars Gather", "volume": 5, "volume_title": "Volume 5", "body": "<h1>Chapter 447 - Chapter 447: Chapter 444: The Eighteen Divine Pillars Gather</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 447: Chapter 444: The Eighteen Divine Pillars Gather<br/><br/>“`<br/><br/>Above the Canghai Sea, rolling demon clouds surged from the horizon, casting countless demons within its midst. Some had taken human form, while others retained their original monstrous shapes, resembling a vast army of demon gods from Jiu You, grand and unstoppable.<br/><br/>Leading them was a Sheep-Headed Demon King a hundred zhang tall, with snow-white fur, dressed in black armor, wielding an exaggeratedly large saber in his hand. He squinted towards the front, his gaze so sharp and cold that it sent shivers down the spine.<br/><br/>Behind him was a Giant Dragon, massive as a mountain range, continuously roaring towards the front, spewing gusts of wind from its mouth that created visible windstorms on the horizon.<br/><br/>The sea below was stirred up into tumultuous waves, as if a storm was imminent, and an oppressive atmosphere descended between the sky and the sea.<br/><br/>The Sheep-Headed Demon King suddenly furrowed his brow, following his gaze to a figure in white standing at the edge of the sky.<br/><br/>It was none other than Sword Immortal Xu Yan!<br/><br/>Xu Yan stood with his sword drawn, emanating a presence capable of resisting a thousand troops. Facing the wavering demon army in the distance, his expression was as indifferent as ever.<br/><br/>He raised the sword in his hand and drew his finger along the blade, causing it to glimmer with a cold light.<br/><br/>He appeared calm, but his heart was filled with excitement.<br/><br/>The Dao Master had returned to Sword Heaven Marsh, and he would surely pay attention to this battle!<br/><br/>Xu Yan had long possessed the cultivation of the Celestial Qiankun Realm. He was confident he could sweep aside all beings below the status of Emperor Saint. He even felt he could arm-wrestle with an Emperor Saint!<br/><br/>If the Dao Master could slay enemies beyond his realm, so could he!<br/><br/>He knew the gap between himself and Fang Wang. He did not dare to entertain the thought of slaying an Emperor Saint, but he believed that a draw was not impossible.<br/><br/>A slight smile formed on Xu Yan’s lips, and he suddenly stepped forward to advance.<br/><br/>Thus, a great battle erupted!<br/><br/>By the lakeside of Sword Heaven Marsh, Fang Wang continued to impart teachings to Yang Lin’er. As for the battle Xu Yan was engaged in, Fang Wang did not pay it any mind.<br/><br/>With Qi Yun Great Saint still around, a single Great Saint was enough to sweep through all mighty foes in the Mortal Realm.<br/><br/>Since Fang Wang had become a Heavenly Dao True Immortal, those resurrected Great Saints and Great Emperors had withdrawn once more. Now, the struggle in the Mortal Realm was still dominated by those within the Celestial Qiankun.<br/><br/>Soon, Kunlun activated its Mountain Protection Array, a sight both magnificent and captivating, drawing Yang Lin’er’s attention to it.<br/><br/>This was Yang Lin’er’s first time witnessing Kunlun’s Formation. She had been curious if Kunlun was just a grand construction, but now it seemed truly worthy of the reputation of the world’s foremost Daoist site.<br/><br/>She could feel the distant battle, which weighed heavily upon her.<br/><br/>She suddenly recalled Fang Wang’s previous words and could not help asking, “Do we really have to contend with the Immortal Divine?”<br/><br/>Fang Wang glanced at her and asked, “Why do you ask this?”<br/><br/>“There are so many strong beings in the Mortal Realm, so how powerful must the Immortal Divine who can suppress the Mortal Realm be? On my way here, I heard that this time the Heavenly Gates have opened wide, and the number of Immortal Divine descending is far greater than any other era. I worry about you… Is there no place where the Immortal Divine cannot find you?” Yang Lin’er said with concern.<br/><br/>The mere battle on the other side of Kunlun was unsettling to her, and that was just a corner of the Mortal Realm. How strong must the Immortal Divine be?<br/><br/>Fang Wang responded with a smile, “There isn’t. If there were, why would there be so many Great Saints and Great Emperors who have died in battle through the ages? Besides, even if I were to bow to them now, it’s too late. This path is one of victors and losers, and I’m not afraid. In fact, I’m looking forward to battling them.”<br/><br/>“Looking forward?”<br/><br/>It was as if Yang Lin’er was meeting Fang Wang for the first time, and she watched him in stunned silence.<br/><br/>Fang Wang gazed into the distance and said, “Yes, looking forward. In truth, I also have a place I wish to seek.”<br/><br/>Yang Lin’er fell silent, hesitating for a moment before she clenched her teeth and said, “No matter what, I will be by your side. If you battle, I will follow you, through thick and thin. This time, don’t even think about deceiving me or sending me away again.”<br/><br/>“`<br/><br/>Fang Wang raised his hand and gently rubbed her head, smiling, “Don’t worry, when have you ever seen me defeated?”<br/><br/>Seeing Fang Wang so self-assured, Yang Lin’er’s mood improved.<br/><br/>“Could you tell me your story? I want to hear it from you,” Yang Lin’er said softly, her mind drifting to what the people said about Fang Wang.<br/><br/>Thinking this way, she felt as if she were in a dream.<br/><br/>Even after having been together for several days, it still seemed so unreal.<br/><br/>“Of course, the story begins when I was a child,” Fang Wang said with a smile, his thoughts plunging into reminiscence.<br/><br/>Yang Lin’er listened intently, and gradually, she no longer felt oppressed and even forgot about the distant great battle.<br/><br/>After the battle raged for half an hour, Qi Yun Great Saint made a move. A colossal hand, spanning over a thousand miles in diameter, fell from the sky, as if it were the embodiment of heavenly punishment!<br/><br/>…<br/><br/>In the dark void, a huge golden archway stood above a sea of clouds, with innumerable figures of Immortal Divine beings standing beneath it.<br/><br/>Leading them was a man clad in golden armor, hands behind his back, exuding a martial dominance and his eyes sparkling with a fierce cold light.<br/><br/>One of the Eighteen Divine Pillars of the Immortal Court, the Heavenly Pillar!<br/><br/>Behind him stood a figure radiating golden light, the very Doom God. At this moment, the Doom God showed his true form, bursting with a similar imposing aura, yet the black patterns on his forehead appeared ominous and terrifying.<br/><br/>The Heavenly Pillar suddenly narrowed his eyes; he seemed to have seen something.<br/><br/>From the darkness ahead, a streak of light flew towards them and in the blink of an eye arrived above the sea of clouds. When the light dissipated, an old Immortal with white hair and a youthful face appeared.<br/><br/>“Heavenly Pillar, there’s been a change. The Dark World where the True Venerable resided has been attacked by Tiandao Fangwang and has fallen completely. The Heaven Emperor has decreed that other Divine Pillars will be dispatched to Xuanzu’s World. Moreover, His Majesty has gone to summon the War God,” the old Immortal reported respectfully with a bowed salute.<br/><br/>His words made the Heavenly Pillar taken aback, and the Doom God’s face turned ashen.<br/><br/>The Immortal Divine beings standing behind them were all shaken.<br/><br/>“The True Venerable has been annihilated?”<br/><br/>“Is Tiandao Fangwang really that powerful? No, the Dark World was home to tens of thousands of Emperor Saints. Could it be that Wangdao has grown to such an extent?”<br/><br/>“It’s possible, don’t forget, that person is also now in Wangdao.”<br/><br/>“No wonder so much fate is converging towards Xuanzu’s World.”<br/><br/>“Wait, could this Tiandao be the reincarnation of that individual?”<br/><br/>While the Immortal Divine beings were discussing, the Heavenly Pillar also voiced his doubts, staring at the old Immortal, he asked, “Could it be that Tiandao is the Supreme Saint reincarnated?”<br/><br/>The old Immortal shook his head, “The Heaven Emperor visited the Supreme Saint a hundred years ago. The Supreme Saint has not been revived, and he stated that he has nothing to do with Tiandao and will not interfere. His bottom line is that not a single half of all beings in Xuanzu’s World must die, and the world must not be destroyed.”<br/><br/>The Heavenly Pillar snorted, “The same demands as always, he truly considers the Mortal Realm.”<br/><br/>The Doom God couldn’t help but ask, “So the being who annihilated the Dark World was only Tiandao? There were no other powerful entities involved?”<br/><br/>The old Immortal shook his head, “No, accompanying him were only Qi Yun Great Saint and one Celestial Qiankun Realm mortal spirit. You should all be aware of Qi Yun Great Saint’s capabilities.”<br/><br/>The Heavenly Pillar furrowed his brows deeply.<br/><br/>The old Immortal continued, “Once the Eighteen Divine Pillars gather, we can forcefully open the Heavenly Gate. My fellows, this situation is extraordinary; it might be a tribulation for the Immortal Court.”\t\t\t\t\t\t</div>", "images": {}, "success": true}