{"id": 459, "url": "https://www.novelhall.com/i-became-an-immortal-on-mortal-realm-32879/15172593.html", "title": "Chapter 449 - Chapter 449: Chapter 446: Immortal Divine Descends, Battle The Heavenly Dao", "volume": 5, "volume_title": "Volume 5", "body": "<h1>Chapter 449 - Chapter 449: Chapter 446: Immortal Divine Descends, Battle The Heavenly Dao</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 449: Chapter 446: Immortal Divine Descends, Battle The Heavenly Dao<br/><br/>“This aura is no joke…”<br/><br/>the Hongxuan Emperor murmured to himself, his face beading with large droplets of cold sweat.<br/><br/>His true self had once adventured in The Upper Realm and had a rough understanding of the Immortal Court. The aura of the Heavenly Gate was far stronger than what he had experienced when the Immortal Court came after him years ago.<br/><br/>Not just him, everyone from the Jin Xiao Sect was moved, and a few people quickly regained their composure, their eyes revealing a bone-chilling intent to kill.<br/><br/>A woman dressed in black approached Zhou Xue and asked, “Sect Hierarch, with the Immortal Divine descending, how shall we proceed? Should we assist Wangdao?”<br/><br/>The entire world already knew that the descent of the Immortal Divine would be aimed at the Heavenly Dao, a trial faced by each of the mightiest beings throughout history. The Heavenly Dao was acknowledged as the strongest being in the world at present, and had even carved a fourth path of cultivation, different from the Saint Dao, Imperial Dao, and the Path of Immortality. Everyone was awaiting to see if Heavenly Dao could overcome this disaster.<br/><br/>If he could, the Mortal Realm would henceforth tread a new path!<br/><br/>If he couldn’t, the way of the Heavenly Dao would cease to exist!<br/><br/>All the Jin Xiao Sect Cultivators were aware of their Sect Hierarch’s relationship with Heavenly Dao. The Jin Xiao Sect and Wangdao had been assisting each other for some time; the Jin Xiao Sect helped spread Wangdao’s fame, while Wangdao supported the Jin Xiao Sect in expanding their domain from time to time. Their relationship was very close, so everyone in the Jin Xiao Sect was prepared to contend with the existence of the Immortal Divine.<br/><br/>The Jin Xiao Sect did not recruit disciples indiscriminately; almost all who joined were of a rebellious nature, having experienced life and death. They were all looking forward to battling against the Immortal Divine, even if it meant their bones shattered and their bodies turned to dust, to be remembered for all eternity.<br/><br/>Zhou Xue gazed at the Firmament, the hot wind blowing through her hair, and she replied, “Assist, but in a different way.”<br/><br/>The woman in black was puzzled, not understanding her meaning.<br/><br/>“Divine Heart.”<br/><br/>Upon hearing Zhou Xue’s summons, Divine Heart immediately appeared beside her.<br/><br/>Centuries had passed, and Divine Heart was no longer the naive young monk of the past. His entire being exuded a calm demeanor, especially in his black kasaya, which added a sense of oppression.<br/><br/>Divine Heart asked, “Sect Hierarch, what are your orders?”<br/><br/>Zhou Xue, expressionless, asked, “Pinpoint the location of the Buddhist court in The Upper Realm.”<br/><br/>Hearing this, Divine Heart’s face broke into a smile and he nodded in response.<br/><br/>Meanwhile, the second sun in the sky grew larger and larger; beside it, the sun of the Mortal Realm seemed so minuscule.<br/><br/>Formations rose from different places on the earth, even from within the seas, as countless ordinary spirits used their power to resist the Heavenly Might.<br/><br/>The high temperatures between heaven and earth had twisted the fabric of space.<br/><br/>The Mountain Protection Array of Kunlun had also been activated. Along with Sword Heaven Marsh, they offered protection while countless demons flew towards Kunlun. Disciples from all directions of Kunlun were allowing these demons inside.<br/><br/>Fang Wang stood on the wooden bridge, beginning to limber up.<br/><br/>The Grand An Profound Turtle swallowed nervously, its turtle eyes filled with wariness.<br/><br/>Xiao Zi leapt out from the lake and approached Fang Wang, saying, “Young Master, will you take me with you for this battle?”<br/><br/>By now, Xiao Zi possessed cultivation almost at the level of the Divine Passage Realm, having awakened the bloodline of the True Dragon Clan. It had not lacked opportunities over the years, which is why its cultivation had advanced so rapidly.<br/><br/>Of course, compared to the top breakthrough speeds in the Mortal Realm, it was still a bit slower. For instance, Xu Qiuming had already reached the Celestial Qiankun Realm, a fact that had caused quite a stir within Wangdao.<br/><br/>Xu Qiuming, formerly the weakest of the Dao Sect, had now caught up, and it was said that he had a pending battle with Jiang Shenming.<br/><br/>Fang Wang smiled and nodded. Then, the Heavenly Palace Halberd materialized beside him, its blade catching the sunlight, reflecting divine light and chill.<br/><br/>Xiao Zi immediately merged with the staff of the Heavenly Palace Halberd, a purple dragon pattern coiling around it.<br/><br/>One figure after another appeared behind Fang Wang, including Hong Chen, Solitary Life Elder, Qi Yun Great Saint, the true man of Emptiness, Zhu Rulai, Song Jinyuan, and many more, with the number quickly surpassing one hundred.<br/><br/>They looked toward the huge sun in the sky, the sun that signified the Heavenly Gate was distorting; at its center, a black dot appeared, rapidly expanding into what seemed like a nascent black hole.<br/><br/>As the black hole nearly reached half the size of the massive sun, darkness descended upon the earth and sky, and then, a towering golden figure appeared within the black hole.<br/><br/>All living beings beneath the heavens could look up and see this golden figure, and every creature that laid eyes on it widened their own, hearts beating faster.<br/><br/>A pressure unfelt by all beings enveloped the mortal realm, so intense that even those in the Celestial Qiankun Realm felt a chill throughout their bodies.<br/><br/>“Immortal…”<br/><br/>Fang Wang stood atop a lake, gazing upwards at the firmament, his brows tightly furrowed, incredulity shining in his eyes.<br/><br/>The golden figure within the massive sun was of an indescribable size, making Fang Wang, who gazed upon it, seem insignificant in comparison.<br/><br/>Yang Jun stood at the edge of the lake, equally dumbfounded. He had heard that Immortal Divines would descend to earth and had imagined countless scenes of their arrival, but none as staggering as this.<br/><br/>How could such an existence be defeated?<br/><br/>Yang Jun thought of the signs and wonders that accompanied the achievement of True Immortality by the Heavenly Dao; while the Heavenly Dao of that time indeed seemed like a True Immortal, it did not possess the terrifying presence of the Immortal Divine above.<br/><br/>Supreme over all, overlooking all creatures!<br/><br/>Having cultivated for hundreds of years, Yang Jun felt an urge to kneel before the vision of the Immortal Divine in the sky at this moment.<br/><br/>Not just them, but all cultivators and demons in the mortal realm, no matter how powerful, were now experiencing an immense visual shock.<br/><br/>Boom!<br/><br/>An earth-shattering roar erupted as a red-purple rainbow appeared on the western horizon, shooting towards the golden figure within the sun like a meteor with tremendous speed.<br/><br/>The golden figure suddenly raised its hand and pinched apart the approaching rainbow from afar.<br/><br/>The sky was filled with red and purple starlight, like a spectacular shower.<br/><br/>The golden figure turned its head, as if searching for something.<br/><br/>“Heavenly Dao of the mortal realm, why not show yourself?”<br/><br/>A voice as commanding as thunder shook the entire mortal realm, deafening all living beings.<br/><br/>Fang Wang stood on a wooden bridge, gripping the Heavenly Palace Halberd. He turned his head to see that cultivators of Wangdao were looking towards him, and both Yang Lin’er and Hong Xian’er had arrived as well.<br/><br/>“Hey, you better not lose!” Hong Xian’er was the first to break the silence, shouting out.<br/><br/>Yang Lin’er looked at the woman as beautiful as a heavenly fairy, remaining silent.<br/><br/>She already knew Hong Xian’er’s identity, and the first time she saw Hong Xian’er, she was astounded. How could there be such a beautiful woman in the world?<br/><br/>She was aware of Hong Xian’er’s feelings for Fang Wang and that the two had known each other and shared hardships for longer than she and Fang Wang, so she did not dare to object.<br/><br/>Looking at Hong Xian’er gesturing a punch towards him, Fang Wang smiled. He then turned his gaze to Hong Chen.<br/><br/>Hong Chen stepped forward and said, “Dao Master, you go and fight. Today, Wangdao has the ability to protect itself.”<br/><br/>Fang Wang’s lips curled up, and he transformed into a beam of light that soared into the sky, quickly disappearing into the horizon.<br/><br/>He continued to ascend, drawing closer to the golden figure within the sun.<br/><br/>“Master, can you handle just one Immortal Divine?” Xiao Zi excitedly asked.<br/><br/>The stronger the golden figure was, the more Xiao Zi looked forward to Fang Wang’s victory, already imagining the scene of the opponent exclaiming ‘impossible.’<br/><br/>Fang Wang’s gaze was sharp, and he spoke softly, “Not just one, he’s just the vanguard, testing my capabilities.”\t\t\t\t\t\t</div>", "images": {}, "success": true}