{"id": 450, "url": "https://www.novelhall.com/i-became-an-immortal-on-mortal-realm-32879/15083997.html", "title": "Chapter 440 - Chapter 440: Chapter 437 Tai Cang Order", "volume": 5, "volume_title": "Volume 5", "body": "<h1>Chapter 440 - Chapter 440: Chapter 437 Tai Cang Order</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 440: Chapter 437 Tai Cang Order<br/><br/>Communing with heaven and earth!<br/><br/>Kongdu Zhenren fell into contemplation, his steps not hesitating as he continued to follow Fang Wang.<br/><br/>Fang Wang waved the Heavenly Palace Halberd with one hand. Even though the halberd was twice as long as his entire body, it seemed so light and nimble in his hands.<br/><br/>These years, he had been moving slowly to grasp the rules of heaven and earth in this realm.<br/><br/>He discovered that the rules of heaven and earth here were very special, different from the Mortal Realm, encompassing many varied kinds, almost as if artificially constructed. He suspected they were the power of Great Saints and Great Emperors.<br/><br/>Even though he had already achieved the status of a Heavenly Dao True Immortal, for him cultivation had just begun. He would not give up any chance to become stronger.<br/><br/>At the end of the earth, a dark figure appeared, the space around it distorting, making him look even more blurred. He was clad in ferocious black armor, his visage masked by a helmet, beneath which a pair of crimson eyes could be seen. His right hand dragged a long bone saber, which scored the hard ground.<br/><br/>Kongdu Zhenren looked towards the dark figure, feeling a bone-chilling murderous intent surpassing that of any Emperor Saint they had encountered before, no wonder the Dao Master had said to take this seriously.<br/><br/>It was just unclear how much of a challenge this mysterious entity could pose to the Dao Master.<br/><br/>Fang Wang’s right foot landed once more, as light as before. But in an instant, Kongdu Zhenren’s complexion drastically changed.<br/><br/>Kongdu Zhenren could clearly feel the changes between heaven and earth.<br/><br/>It felt as though he had stepped into the midst of a Celestial Phenomenon.<br/><br/>Before he could comprehend, he felt the vast spiritual energy converging from the eight directions of heaven and earth, as if he had suddenly returned to the Mortal Realm.<br/><br/>He turned around to look, seeing the ends of the earth in all directions shrouded in rolling demonic mist, making the already dim world even more terrifying and dreadful.<br/><br/>“Hahaha, Dao Master, who would have thought that our Demon Race’s first battle would be against a demon. What is the title of this great demon saint?”<br/><br/>The voice of the Great Dark Demon Saint echoed through heaven and earth, accompanied by his dominating aura, enveloping the whole world.<br/><br/>The dark figure dragging the giant bone saber stopped, the crimson eyes flickering with a cold light, evidently also surprised by Fang Wang’s Celestial Phenomenon.<br/><br/>Fang Wang raised the Heavenly Palace Halberd, his right hand loosening.<br/><br/>With a boom!<br/><br/>The Heavenly Palace Halberd burst forth with a terrifying momentum, soaring across the sky, almost instantly closing in on the dark figure.<br/><br/>The dark figure reacted incredibly fast, violently sidestepping, his left hand following to grab the pole of the Heavenly Palace Halberd, his powerful strength pulling him back as he skidded, the ground shattering and stones flying.<br/><br/>Countless beings of the Demon Race swooped in, one after another attacking the dark figure without any regard for their lives.<br/><br/>…<br/><br/>Underworld.<br/><br/>The Ghost Emperor stood on the shore, still enveloped in Ghost Qi, only his silhouette visible, shrouded in mystery.<br/><br/>In front of him lay a silent expanse of the sea, with a heavy fog drifting above the surface. Vague figures of wronged spirits churned, those who fell into the waters never resurfaced, disappearing without a trace.<br/><br/>“You asked to see me, and here I am. Why don’t you show yourself?”<br/><br/>The Ghost Emperor spoke indifferently.<br/><br/>No sooner had he finished speaking than the silent sea began to boil, bubbles of different sizes surfacing continuously, followed by numerous wronged spirits, they reached up, as though trying to escape the sea of misery, but could not break free, only letting out painful cries.<br/><br/>The Ghost Emperor waited, unmoved, for the being beneath the sea to reveal itself.<br/><br/>The fog above the sea surface began to churn and gradually condensed into a colossal half-body, larger than mountains and exuding an oppressive presence.<br/><br/>“Ghost Emperor, as the crown prince of the An Tian Emperor, for hundreds of thousands of years, you have wandered the lands in search of your father’s soul. Now, having transferred the fate of the Grand An Divine Dynasty to a person in the Mortal Realm, it must be that you have recognized that person as the reincarnation of the An Tian Emperor. Why not let him join hands with me, and when the Heavenly Gate opens, we ascend together to the Nine Heavens and lay waste to the Immortal Court!”<br/><br/>A voice resonating with the weariness of the ages rose, as if traversing the river of time, ancient and enduring.<br/><br/>The Ghost Emperor calmly asked, “Lay waste to the Immortal Court? Let alone whether you can achieve that, after you devoured the people under the Grand An Divine Dynasty, do you think I can trust you? My visit is not only to find out your intentions but also to offer you a warning.”<br/><br/>“Hahaha, what, does the Ghost Emperor also want to protect the Mortal Realm? Don’t forget, a hundred thousand years ago when the Heavenly Gate swung wide open and yin and yang were in chaos, you too took advantage to enter the world, slaughtering the great fate bearers of that era, even exterminating the living beings of numerous continents to enhance your Jiu You Evil Art. Drop the pretense of benevolence, just tell me, what do you need!”<br/><br/>The aged voice sounded again, leaving the Ghost Emperor in silence.<br/><br/>The sea gradually returned to calm, no longer boiling.<br/><br/>After a long while.<br/><br/>The Ghost Emperor exhaled three words: “Tai Cang Order.”<br/><br/>“How so? The Ghost Emperor is interested in the elusive Tai Cang Immortal Mansion?” The voice expressed surprise.<br/><br/>“I too wish to know, what makes the immortals connected with Tai Cang different from those I have encountered. It won’t be long before the Tai Cang Immortal Mansion reappears in the Mortal Realm. I wish to see for myself. I am aware that you have three Tai Cang Orders.”<br/><br/>“You give me one, and I will not hinder your return to the Mortal Realm, as for whether you cooperate with the Heavenly Dao, it depends on your ability; I have no way to intervene.”<br/><br/>The Ghost Emperor answered calmly, and now it was the turn of the aged voice to fall silent.<br/><br/>After several breaths, the aged voice responded: “Fine!”<br/><br/>With a bang!<br/><br/>The sea surface ruptured and the waves rolled to either side, rising tens of thousands of feet high. A streak of cold light sped across, and with a snap, it landed in the hands of the Ghost Emperor.<br/><br/>…<br/><br/>“The teeming masses are but dust in the wind, and a human life is merely a hundred years.”<br/><br/>Atop a cliff stood a white-haired old man with bare feet, holding a wooden staff in one hand and reaching towards the firmament with the other, he spoke solemnly.<br/><br/>Behind him stood a person, none other than Fang Zigeng.<br/><br/>Fang Zigeng looked up to see meteors streaking across the sky, wrapped in blazing flames like a meteor shower, except the ash and smoke diffused in the air, rendering the dusk even more hazy.<br/><br/>The white-haired elder turned to Fang Zigeng with a mysterious look and said, “Your destiny is descending upon you.”<br/><br/>Fang Zigeng’s white hair fluttered in the wind, his eyes deep and profound, he calmly asked, “Exactly where?”<br/><br/>“Heavenly secrets cannot…” the white-haired elder instinctively began to demur, but Fang Zigeng suddenly appeared in front of him, his right index finger suspended in front of the elder’s eyes, cutting short his words.<br/><br/>Fang Zigeng’s expression was icy cold, the murderous intent almost solidifying.<br/><br/>The white-haired elder hastily corrected himself, “In the Canghai Destiny Continent, there is a reincarnated immortal born with heterochromia, that’s all I can deduce.”<br/><br/>Upon hearing this, Fang Zigeng narrowed his eyes.<br/><br/>The white-haired elder paused for a moment, then said, “This immortal is no ordinary being; his fate is far more formidable than the immortal who vanquished the Descending Dragon Great Saint. I urge you…”<br/><br/>Schlick—<br/><br/>Fang Zigeng’s right hand formed a blade, beheading the elder in a single stroke, blood spurting forth like a fountain.<br/><br/>The blood of the white-haired elder splashed on Fang Zigeng’s face, but he, in turn, revealed a smile. He whispered softly, “You advise me to be cautious? There’s no need for your goading; I intend to go regardless. Tell your master, no matter his origins, if he wishes to scheme against me, then let him come.”<br/><br/>The body of the white-haired elder collapsed, his head rolling on the cliff edge, and his body turning to ash and dispersing in the wind.\t\t\t\t\t\t</div>", "images": {}, "success": true}