{"id": 455, "url": "https://www.novelhall.com/i-became-an-immortal-on-mortal-realm-32879/15163610.html", "title": "Chapter 445 - Chapter 445: Chapter 442: The Four Great War Gods, The Power Of The Immortal Court", "volume": 5, "volume_title": "Volume 5", "body": "<h1>Chapter 445 - Chapter 445: Chapter 442: The Four Great War Gods, The Power Of The Immortal Court</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 445: Chapter 442: The Four Great War Gods, the Power of the Immortal Court<br/><br/>Achieving the status of a Heavenly Dao Mysterious Immortal brought about enormous changes for Fang Wang; during the process of cultivating his technique, he had already absorbed each type of Celestial Phenomenon’s power present within this world. Of course, he had only absorbed a part and had not shaken the entire structure of the universe.<br/><br/>Once he fully became a Heavenly Dao Mysterious Immortal, he was able to directly control all the universal laws of this world, thereby controlling the entire world itself.<br/><br/>This feeling was incomparably mysterious!<br/><br/>The path of the Heavenly Dao was that of the world itself, unrelated to fate or karmic causes, a pure control over the universe.<br/><br/>This was the level he could achieve for the moment, but Fang Wang’s goal in the future was to control the Great Dao.<br/><br/>What is the Great Dao?<br/><br/>Fang Wang felt that there existed a mysterious power above the universal laws in the darkness, a power that constituted the space-time outside of the universe.<br/><br/>Fang Wang collected his thoughts, eyes under the Fox Mask gazing into the distance at the True Venerable, as the Golden Scroll behind him continued to expand.<br/><br/>The Map of Lives and Lands!<br/><br/>It was with this Divine Skill that Fang Wang had cast the Demon Race into his own Celestial Phenomenon, binding their existences together for life and death.<br/><br/>Now, he intended to use the Map of Lives and Lands to swallow this Emperor Saint World into his Celestial Phenomenon!<br/><br/>If it had been the him of before, even if the Emperor Saints surrendered without a fight, he wouldn’t have been capable of doing this; after all, the Celestial Phenomenon had a limited capacity and couldn’t swallow indefinitely.<br/><br/>Things were different now, though. Fang Wang, having achieved the status of a Heavenly Dao Mysterious Immortal, had vastly surpassed his previous self. The strongest cultivation technique of the Mortal Realm and the top-tier technique of the Immortal Court had merged together, and he had even trained them to Great Perfection, achieving effects that neither ordinary mortals nor common Immortal Divines could imagine.<br/><br/>Fang Wang felt an omnipotent sensation.<br/><br/>He could manipulate the universal laws at will, a feeling that was truly wonderful.<br/><br/>In one hand, he held the Heavenly Palace Halberd, and with the other raised, he pressed his palm towards the True Venerable and those Emperor Saints.<br/><br/>The boundless pressure of a Heavenly Dao Mysterious Immortal enveloped the whole world. Even the True Venerable felt oppressed, and most crucially discovered that he could no longer execute his Divine Skills, as if he had suddenly fallen into a trap with no escape.<br/><br/>The True Venerable took a deep breath, raising his Golden Dragon Longspear, from which strands of black aura seeped out, condensing behind him into various Emperor Saints.<br/><br/>All the living Emperor Saints gathered behind the True Venerable, their faces gloomy, realizing the trouble they were in. Some Emperor Saints proficient in teleportation Divine Skills were even unable to leave this realm.<br/><br/>The True Venerable began to chant mysterious mantras, and the other Emperor Saints did the same.<br/><br/>While Fang Wang basked in the marvelous power of being a Heavenly Dao Mysterious Immortal, he pressed his palm downward.<br/><br/>The Map of Lives and Lands behind him suddenly disappeared, but the world became even brighter as a result.<br/><br/>The True Venerable and Emperor Saints looked up, only to see that the Firmament had been replaced by the Map of Lives and Lands.<br/><br/>In the vastness of the Heavenly Dao Strong Light, all beings were immobilized, and the voices of the True Venerable and Emperor Saints’ mantras began to weaken.<br/><br/>Soon, the whole world lost its color!<br/><br/>…<br/><br/>In the Endless Realm, Fang Wang, accompanied by the Master of Emptiness and Qi Yun Great Saint, descended to the ground.<br/><br/>Master of Emptiness and Qi Yun Great Saint were still in a daze, while Fang Wang landed on a mountainside, turning his head to gaze at the sea of clouds on the horizon. He removed the Fox Mask, his expression serene.<br/><br/>A gentle breeze passed through, stirring his hair. He looked no different from a mortal, his presence not strong.<br/><br/>“Dao Master, have they all perished?” Master of Emptiness asked cautiously.<br/><br/>The moment when the Map of Lives and Lands descended, they were blinded. By the time they regained their senses, they had already arrived in the Endless Realm.<br/><br/>Fang Wang replied, “Not exactly perished, but you could say they met an end that was as good as any.”<br/><br/>Suddenly, Master of Emptiness and Qi Yun Great Saint thought of the Demon Race within Fang Wang’s Celestial Phenomenon, and wondered if…<br/><br/>Both of their pupils shrank. If that was really the case, wouldn’t Fang Wang’s strength have greatly increased?<br/><br/>With the power of a True Venerable and so many Emperor Saints, plus the boundless Divine Skills that Fang Wang possessed, who could be his opponent?<br/><br/>Even an Immortal Divine from The Upper Realm would find it very difficult to contend with him.<br/><br/>Unless the Immortal Court made a concerted effort to surround and suppress him.<br/><br/>Qi Yun Great Saint, who was staying in the Emperor Saint World, knew that not all the Emperor Saints there were banished by the Immortal Court; some could contact The Upper Realm, and he had long since heard about some moves of the Celestial Court of the Upper Realm.<br/><br/>He hesitated for a moment and said, “Dao Master, once the Heavenly Gate opens, you will be the first target of the Immortal Court. Would you like me to tell you about the strength of the Immortal Court?”<br/><br/>Fang Wang stretched his arms wide, yawned lazily, and while feeling the nature of heaven and earth, he replied, “Go ahead and speak.”<br/><br/>“Then I will tell you about the power of the Immortal Court that will come to the Mortal Realm. The Celestial Court has Four Great War Gods, Eighteen Divine Pillars, Thirty-Six Celestial Mansions, and Seventy-Two Gods Generals. Beneath them, there are tens of thousands of True Gods, each capable of easily defeating ordinary Great Saints and Great Emperors with boundless mana…”<br/><br/>“The strongest is undoubtedly the Nine-Faced Divine Net, who even has power comparable to the Heaven Emperor; under normal circumstances, he would not make a move.”<br/><br/>“Next are the other three of the Four Great War Gods, the Wrathful God Luo, Mysterious Divine Lord, and Lingxiao Saint Emperor…”<br/><br/>Qi Yun Great Saint began to speak about the Immortal Court, and Empty Transcendence listened intently.<br/><br/>Fang Wang was also listening. Although he was full of confidence now, he was willing to learn about the enemy in advance.<br/><br/>From Qi Yun Great Saint’s words, it was clear that the Immortal Court did possess the power to sweep through countless realms of the Mortal World.<br/><br/>Tens of thousands of beings at the level of Emperor Saints, and some even far surpassing Emperor Saints—it was an incredibly formidable force.<br/><br/>Fang Wang couldn’t help being curious about how strong the Supreme Saint was. To what extent was his strength that the Immortal Court always failed to break through Xuanzu’s World, and could only descend to the Mortal Realm temporarily through the Heavenly Gate.<br/><br/>Moreover, the frightening thing was that the Supreme Saint could revive at any time.<br/><br/>Perhaps each time the Heavenly Gate opened, the Immortal Divines did not dare to annihilate Xuanzu’s World because they knew the Supreme Saint could revive, so they did not dare to act recklessly.<br/><br/>After a long time.<br/><br/>Qi Yun Great Saint had finished sharing all the intelligence he knew, and when he looked at Fang Wang, he found that Fang Wang’s expression had not changed.<br/><br/>“Do you know of the Supreme Saint?” Fang Wang asked.<br/><br/>Qi Yun Great Saint was taken aback, then answered, “Is it the Supreme Saint of Xuanzu’s World?”<br/><br/>“Yes.”<br/><br/>“I have heard a little; he is the first being in the Mortal Realm to have caused a great commotion in the Immortal Court and left unscathed, and moreover, the True Venerable dreads him and prohibits others from mentioning him,” Qi Yun Great Saint pondered.<br/><br/>Indeed, there was a dread. If the True Venerable claimed to be the creator of the Taixuan Shenxiao Scripture, it meant he was the Supreme Saint’s disciple.<br/><br/>The True Venerable had been suppressed by the Supreme Saint…<br/><br/>Fang Wang was marveling at this internally, curious about how much disparity there was between the suppressed True Venerable and his current state.<br/><br/>He decided to find an opportunity to ask.<br/><br/>Thinking this, Fang Wang then said, “I am preparing to go back. How about you all?”<br/><br/>Qi Yun Great Saint quickly said, “If Dao Master would not discard me, I wish to follow.”<br/><br/>Empty Transcendence replied, “I no longer have a reason to stay in this realm. It’s time to prepare for your battle with the Immortal Divines.”<br/><br/>The opening of the Heavenly Gate was not far off, and the Emperor Saints could feel the approach of the Heavenly Gate’s power.<br/><br/>Fang Wang could feel it as well. There was a sense of Mysterious Power approaching the Mortal Realm, a power even he could not calculate.<br/><br/>“If that’s the case, let’s return to Xuanzu’s World together,” Fang Wang said, and then taking a step, he used The Heaven of Carefree Freedom, and the three of them vanished into thin air.\t\t\t\t\t\t</div>", "images": {}, "success": true}