{"id": 453, "url": "https://www.novelhall.com/i-became-an-immortal-on-mortal-realm-32879/15141228.html", "title": "Chapter 443 - Chapter 443: Chapter 440: Battle With True Venerable, Emperor Saint Together Emerges", "volume": 5, "volume_title": "Volume 5", "body": "<h1>Chapter 443 - Chapter 443: Chapter 440: Battle With True Venerable, Emperor Saint Together Emerges</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 443: Chapter 440: Battle with True Venerable, Emperor Saint Together Emerges<br/><br/>Fang Wang’s voice, like the force of Heavenly Might, echoed endlessly in this mysterious realm, drowning out all other noises.<br/><br/>The rules of heaven and earth were still in turmoil, and the myriad colors of lightning that wreathed his body continued to grow stronger, the scene terrifying to behold.<br/><br/>“Of course, other than death, there is another path for you, and that is to come out and submit to me,”<br/><br/>Fang Wang’s voice rose again, causing Qi Yun Great Saint’s eyelids to twitch wildly at these words.<br/><br/>It was too arrogant!<br/><br/>He now realized that Fang Wang’s nature was so domineering.<br/><br/>So, it wasn’t the True Venerable waiting for the Heavenly Dao, instead, it was the Heavenly Dao waiting for the True Venerable?<br/><br/>With the Heavenly Palace Halberd in hand, Fang Wang leaped into the air, with the thousands of heavenly and earthly rules turned into lightning chasing after him, casting a net that darkened the sky and lit up the entire Firmament as it rose.<br/><br/>The Town World Bead flew out above his head, and when he came to a stop, the Town World Bead continued to ascend tens of thousands of feet before suddenly growing enormous and exploding with a terrifying devouring force.<br/><br/>At the same time, a devastating storm earlier launched toward Fang Wang approached, raising rocks off the ground and whipping dust into the air, unstoppable in its approach.<br/><br/>Amid the whirling sand and wind, a figure, tens of thousands of feet tall and clad in heavy armor with four arms, could be faintly seen. The cloak trailing behind him fluttered like a canopy in the sky.<br/><br/>Figure after figure flew from behind this colossal being and swiftly settled around him, their numbers growing rapidly, exceeding a thousand in the blink of an eye.<br/><br/>“True Venerable…”<br/><br/>Qi Yun Great Saint’s expression turned serious as he spoke solemnly, no longer daring to advance.<br/><br/>Following suit, the Cultivator of the Celestial Qiankun Realm stopped, conjuring his Lifespirit Treasure, ready for battle.<br/><br/>A radiant light surged from behind the distant True Venerable, swiftly sweeping across the earth and sky, instantly altering the entire world, bringing biting cold winds and snow, and brightening the darkened heavens and earth.<br/><br/>Whoosh—<br/><br/>The blizzard erupted suddenly, forcing Qi Yun Great Saint and the Cultivator of the Celestial Qiankun Realm to resist with their Spiritual Power.<br/><br/>Fang Wang, amidst the blending rules of heaven and earth, burst forth with the tyrannical yang energy of the Heavenly Gang Supreme Yang Tyrant Body, making him appear like a vast sun.<br/><br/>The Town World Bead trembled violently, madly absorbing the snow and ice, as the whole world seemed to shake, at risk of shattering at any moment.<br/><br/>“Heavenly Dao, you are very arrogant, but throughout history, there have been many who stood arrogantly before me. They either bowed their heads in submission and enjoyed my protection, or perished and became my Divine Weapon. Now, I offer you a choice— which will you choose?”<br/><br/>The voice of the True Venerable came, cold to the extreme, colder even than the raging snowstorm of the world.<br/><br/>The number of Emperor Saints around him had grown to over ten thousand.<br/><br/>A single Great Saint or Great Emperor could dominate an era. The terror of their combined might was unimaginable; if this hadn’t been a Celestial Phenomenon, any other place in the Mortal Realm simply couldn’t withstand such force.<br/><br/>The Cultivator of the Celestial Qiankun Realm felt as if his very flesh might be crushed, but fortunately, Qi Yun Great Saint stepped in front of him, using the Spiritual Power of a Great Saint to protect him.<br/><br/>The Cultivator of the Celestial Qiankun Realm breathed a sigh of relief.<br/><br/>In that moment, he truly felt the gap between himself and the Great Saints and Great Emperors. Before, with Fang Wang intervening, he didn’t feel much pressure.<br/><br/>Fang Wang, suspended in the sky, raised the Heavenly Palace Halberd, pointing it at the distant True Venerable, and spoke, “In that case, let’s fight!”<br/><br/>He twisted his right wrist, and the blade of the halberd followed suit, a tyrannical force exploding along the blade, sweeping across the Firmament, and in the blink of an eye reaching the True Venerable. Over ten thousand Great Saints and Great Emperors simultaneously raised their hands to cast spells, their vast Spiritual Power converging to counter Fang Wang’s force.<br/><br/>In an instant, nearly all Emperor Saints were moved.<br/><br/>“How is this possible!”<br/><br/>“His strength… how can it be so formidable…”<br/><br/>“Is this Divine Skills?”<br/><br/>“No wonder he’s so full of himself; he indeed has the arrogance of a genius…”<br/><br/>“The Heavenly Dao from Xuanzu’s World… How is it that this world always gives birth to such powerful prodigies? How old is he, exactly?”<br/><br/>Great Saints and Great Emperors alike gasped in astonishment; some Emperor Saints had been paying attention to Fang Wang even before he entered this world. They were acutely aware of Fang Wang’s growth trajectory, and it was precisely because of this that they found it so incredible.<br/><br/>The True Venerable lifted his right hand and pushed forward, forcefully dispersing the terrifying force of the Heavenly Palace Halberd.<br/><br/>In his right hand, he then condensed a long spear, its head as large as a mountain, shaped like a Golden Dragon, baring its teeth and claws, with bizarre runes appearing on its shaft, even emitting a dark grey glow.<br/><br/>Once this spear appeared, the snowfall in the sky stilled.<br/><br/>Fang Wang, without saying a second word, confronted the True Venerable head-on, as tens of thousands of Emperor Saints concurrently summoned their Lifespirit Treasures.<br/><br/>…<br/><br/>Xuanzu’s World, Descending Dragon Continent, Sword Heaven Marsh.<br/><br/>Hong Xian’er landed by the lakeside; she turned her head toward the Firmament, her stunning countenance revealing a hint of confusion.<br/><br/>It wasn’t just her—every Cultivator within Sword Heaven Marsh found themselves subconsciously looking up at the sky. Although there were no visible changes, they all felt an indescribable sensation that was intensifying.<br/><br/>Hong Chen and Solitary Life Elder also arrived at the lake’s edge, both beginning to project their thoughts.<br/><br/>After a few moments, Solitary Life Elder expressed with admiration, “Incredible. How many years have passed? He has once again advanced the Heavenly Dao to a whole new stage.”<br/><br/>Hong Chen’s perception was even deeper because he compared the Heavenly Dao with the Immortal Court.<br/><br/>Although he had perished hundreds of thousands of years ago, it’s improbable that the Immortal Court could have made a significant leap forward, judging by its control over the Mortal Realm.<br/><br/>“Dao Master, just who are you…” Hong Chen looked up at the Firmament and murmured to himself.<br/><br/>He now believed that Fang Wang was certainly not just a once-in-an-eternity genius from the Mortal Realm; it was highly likely that he hailed from The Upper Realm.<br/><br/>Hong Chen began to speculate about which major power in The Upper Realm Fang Wang might come from.<br/><br/>At this moment, all beings cultivating the Heavenly Dao across the world resonated with it, a resonance that even affected the Heavenly Daos of other worlds.<br/><br/>As time passed, all beings of the Heavenly Dao gained enlightenment, realizing that the True Immortal who created the Heavenly Dao was striking toward a higher realm.<br/><br/>Realizing this, Heavenly Dao Cultivators in various worlds were exhilarated.<br/><br/>How much time has passed?<br/><br/>Yet, the Heavenly Dao has been elevated once again!<br/><br/>Taking a deep breath, Hong Xian’er walked along the lakeshore. She initially wanted to find Fang Wang to share her gains over the years, but now she suddenly felt they weren’t worth mentioning.<br/><br/>…<br/><br/>Boom!<br/><br/>A thousand-foot-tall Great Emperor plummeted from the sky, crashing through the earth’s surface and into layers of rock, spewing Emperor Blood from his mouth, igniting a vast sea of fire in the depths below.<br/><br/>Struggling to open his eyes, he could see an earth-shattering battle through the cracks in the rocks.<br/><br/>Fang Wang was locked in fierce combat with the True Venerable. Without manifesting a thousand-foot-tall Dharma body, he radiated light even brighter than the towering True Venerable, illuminating the bottom of the Town World Bead clearly.<br/><br/>The True Venerable, with one hand, held the Golden Dragon Longspear high and thrust it toward the Firmament, causing the Town World Bead to tremble violently, as if on the verge of shattering.<br/><br/>Fang Wang, raising his palm, executed the Great Returning Void Palm on the True Venerable, who in return lifted an arm to block, his arm bursting with a golden compass that displayed swirling patterns on its surface.<br/><br/>Immediately after, the space behind the True Venerable turned into nothingness, plunging into absolute darkness.<br/><br/>All around Fang Wang, spear shadows suddenly appeared from thin air, each exuding different rule auras, all targeting Fang Wang, their divine light not even masked by the glow of the Heavenly Dao.\t\t\t\t\t\t</div>", "images": {}, "success": true}