{"id": 452, "url": "https://www.novelhall.com/i-became-an-immortal-on-mortal-realm-32879/15097752.html", "title": "Chapter 442 - Chapter 442: Chapter 439: 450,000 Years", "volume": 5, "volume_title": "Volume 5", "body": "<h1>Chapter 442 - Chapter 442: Chapter 439: 450,000 Years</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 442: Chapter 439: 450,000 Years<br/><br/>Looking at Qi Yun Great Saint speaking in such a terrifying manner, even the real person Kongdu couldn’t help frowning, but Fang Wang remained calm and collected.<br/><br/>Fang Wang’s confidence stemmed from the fact that he was still getting stronger. After reaching the Heavenly Dao True Immortal, his cultivation did not stagnate. The Heavenly Dao Myriad Classic of Laws autonomously operated in his cultivation, and over the years, he had been progressing while pondering the integration of cultivation techniques.<br/><br/>Like now, he had already fused the Heavenly Dao Myriad Classic of Laws with the Purple Qi Immortal Technique; all it took was a thought, and he would enter the Heavenly Palace.<br/><br/>The Purple Qi Immortal Technique took him ninety-seven thousand years, and the new Heavenly Dao Myriad Classic of Laws even more—seven hundred and eighty thousand years—which made him hesitate.<br/><br/>Now, upon hearing of the existence of the Ji Ji Extreme Resentment, although Fang Wang appeared indifferent on the surface, leisurely as the breeze and the clouds, there was still a sense of urgency in his heart.<br/><br/>Even though he was strong now and had the confidence to deal with any formidable enemy, what he sought had never been merely to save his own life; he also needed to protect those around him. Now, he had an additional goal—to preserve the Dao.<br/><br/>Fang Wang looked ahead and said, “It doesn’t matter. If I can defeat the True Venerable, then I can destroy the Ji Ji Extreme Resentment. If I cannot, there is no need for me to stay here now.”<br/><br/>Qi Yun Great Saint opened his mouth as if to say something but then stopped himself.<br/><br/>He thought about all the powerful opponents Fang Wang had defeated along the way.<br/><br/>Fang Wang had been in this realm for over a hundred years. He had slain more than three hundred Emperor Saints. His fate as an Emperor Saint was overwhelming, an aura that even the Formless Zhou Tian Technique couldn’t hide.<br/><br/>Carrying the Heavenly Palace Halberd, Fang Wang continued to advance, taking a deep breath beneath his mask, his eyes fierce.<br/><br/>The path of cultivation, he had not yet reached the end, he couldn’t relax!<br/><br/>He immediately fused the Heavenly Dao Myriad Classic of Laws with the Purple Qi Immortal Technique, going over the mental method of the two combined techniques in his mind anew.<br/><br/>With just seven steps, his eyes closed involuntarily, and his footsteps moved forward subconsciously.<br/><br/>The eighth step!<br/><br/>As his left foot landed, Fang Wang reopened his eyes, and a transcendent aura burst forth, startling Qi Yun Great Saint and real person Kongdu into staring at him in amazement.<br/><br/>A hint of confusion flashed in Fang Wang’s eyes; his step faltered slightly but then he continued onward.<br/><br/>With just one step, he had already overcome the vicissitudes of life.<br/><br/>The integration of the Purple Qi Immortal Technique with the Heavenly Dao Myriad Classic of Laws had caused him to stay in the Heavenly Palace for a full four hundred and fifty thousand years!<br/><br/>The Purple Qi Immortal Technique could cultivate an immortal’s body. After merging with the Heavenly Dao Myriad Classic of Laws, Fang Wang had thus created the True Immortal Saint Body belonging to the Heavenly Dao.<br/><br/>And the flaws of the Purple Qi Immortal Technique had been changed by him. Cultivating the new Heavenly Dao Myriad Classic of Laws would not connect with the karmic ties of the Immortal Court. He could even create Heavenly Dao karmic ties within the Heavenly Dao, establishing connections with all Heavenly Dao cultivators.<br/><br/>Of course, Fang Wang did not want to use Heavenly Dao karmic ties to coerce followers. What he thought of were the benefits; because through Heavenly Dao karmic ties, coupled with casting The Heaven of Carefree Freedom, he could go to the side of any Heavenly Dao cultivator, which would make it convenient for him to do many things.<br/><br/>Qi Yun Great Saint and real person Kongdu were shocked; they could clearly feel Fang Wang’s aura rapidly increasing.<br/><br/>This had surpassed the state he was in during the previous great battle!<br/><br/>What was most eerie was…<br/><br/>Qi Yun Great Saint’s eyes widened, his heart stirring with shock and awe.<br/><br/>He could feel the heavenly and earthly rules converging towards Fang Wang, directly entering into his body.<br/><br/>Was the Heavenly Dao swallowing the heavenly and earthly rules?<br/><br/>As a Great Saint, Qi Yun Great Saint could grasp the heavenly and earthly rules and cultivate his own power of rules, but this was the first time he had seen someone directly devouring the heavenly and earthly rules for their own use.<br/><br/>Just hearing that the Ji Ji Extreme Resentment was invincible was making the Heavenly Dao grow stronger?<br/><br/>This was absurd!<br/><br/>Qi Yun Great Saint could not understand.<br/><br/>Real person Kongdu, on the other hand, took this as a matter of course. The stronger Fang Wang became, the more at ease he felt. He even began to believe that Fang Wang was invincible.<br/><br/>Fang Wang advanced while cultivating the newly acquired Heavenly Dao Myriad Classic of Laws.<br/><br/>The Heavenly Dao Force within him began to surge violently, its very essence enhancing, growing stronger.<br/><br/>In the depths of his being, Fang Wang felt he could create a higher realm.<br/><br/>“Heavenly Dao Primary Origin is the realm of the Heavenly Dao True Immortal, and above the Heavenly Dao True Immortal is… the Heavenly Dao Mysterious Immortal!”<br/><br/>Fang Wang muttered to himself, settling on the name for this new realm.<br/><br/>The Heavenly Dao Primary Origin was comparable to the realms of the Great Saint and Great Emperor, while the Heavenly Dao True Immortal was on par with actual Immortal Divines, yet transcended them, unrestrained by rules.<br/><br/>The Heavenly Dao Mysterious Immortal was capable of devouring the laws of heaven and earth, creating one’s own Karmic ties. These Karmic ties could allow other beings to inherit them, helping them grow ever stronger.<br/><br/>Going further, Fang Wang was preparing to evolve Karmic into Dao.<br/><br/>What is Dao? Dao is a sort of undying, indestructible power, akin to the laws of heaven and earth, but surpassing them.<br/><br/>The Heavenly Dao is a system of Cultivation path, whereas Dao is his own unique power, not shared with anyone else.<br/><br/>While cultivating, Fang Wang pondered his future path.<br/><br/>It must be said, the Purple Qi Immortal Technique was very powerful, its strength lying in the vast profundity that helped Fang Wang explore more possibilities.<br/><br/>As the laws of heaven and earth began to convulse wildly, the ground shuddered violently, the Firmament changed colors, and the nine blood moons hanging high in the sky started to warp.<br/><br/>“Hm?”<br/><br/>A voice filled with surprise came forth; as soon as it sounded, the raging laws of heaven and earth abruptly halted, and even the laws that were rushing towards Fang Wang began to slow down.<br/><br/>Fang Wang’s gaze sharpened, as the laws of heaven and earth around him, like untamed wild horses, crazily burrowed into his body.<br/><br/>Boom!<br/><br/>A sound of breaking the air came, followed by an unimaginable oppressive force descending upon him.<br/><br/>A silhouette fell from the sky, but almost instantly, Fang Wang burst into a dazzling light, generating an aura that blocked the other party.<br/><br/>This was a mysterious powerful being with the upper body of a dragon and the lower body of a human, clad in black dragon scales, exuding endless murderous intent, his cold red eyes fixated on Fang Wang.<br/><br/>Suddenly, a look of fear spread across his eyes as if sensing some unbelievable power.<br/><br/>Fang Wang’s right hand, holding the Heavenly Palace Halberd, twisted, unleashing powerful force. Waves of white aura shot up to the sky, engulfing the mysterious dragon figure, his flesh turned to ash, leaving only bone, but even the bones couldn’t last a single breath’s time before they too rapidly disintegrated.<br/><br/>After slaying a Great Saint in mere seconds, Fang Wang continued to stride forward.<br/><br/>With each step, the ground caved in, stones burst into the air, and those formless laws of heaven and earth began to manifest, appearing like differently colored lightning weaving around him.<br/><br/>Qi Yun Great Saint was moved, murmuring to himself, “Grand Zhou Dragon Saint…”<br/><br/>He had seen the Great Saint from before, an existence he previously had to look up to.<br/><br/>It was Qi Yun Great Saint who the True Venerable had dispatched the Grand Zhou Dragon Saint to subdue!<br/><br/>Such a mighty being, easily annihilated!<br/><br/>“True Venerable, we have been delayed for so long, it’s time for a fight. I have new opponents to face, and I don’t want to drag this out with you anymore. Come forth, lead all your Great Saints and Great Emperors to their doom!”<br/><br/>Fang Wang’s voice echoed; at this moment, his tone became unprecedentedly authoritative, as if he was the true Heavenly Dao, and his fury was the Heavenly Might!<br/><br/>Powerhouses like Qi Yun Great Saint and the Venerable Emptiness could not help but feel a desire to prostrate in reverence.<br/><br/>They looked towards Fang Wang, surrounded by a white aura, his white garments billowing intensely, radiating an invincible aura of supreme arrogance and mastery over all!\t\t\t\t\t\t</div>", "images": {}, "success": true}