{"id": 458, "url": "https://www.novelhall.com/i-became-an-immortal-on-mortal-realm-32879/15167911.html", "title": "Chapter 448 - Chapter 448: Chapter 445: The Second Sun!", "volume": 5, "volume_title": "Volume 5", "body": "<h1>Chapter 448 - Chapter 448: Chapter 445: The Second Sun!</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 448: Chapter 445: The Second Sun!<br/><br/>A tribulation!<br/><br/>The words of the old Immortal Divine caused all the Heavenly Gods to fall silent, and the expression of the Heavenly Pillar in charge also turned grave.<br/><br/>“Your Majesty, which War God have you invited? Can the Nine-Faced Divine Net make a move? After all, his master is currently plotting against us in the mortal realm,” the Celestial Pillar in charge asked the old Immortal Divine seriously.<br/><br/>The old Immortal Divine shook his head slightly and said, “The Four Great War Gods each command one direction. It’s not for you and I to predict which one His Majesty might have invited. Just wait, there will surely be a War God descending. You eighteen Divine Pillars should go down first. Since ancient times, apart from the Supreme Saint, there hasn’t been anyone in Xuanzu’s World capable of contending against you all on their own. Even if Fang Wang is the second Supreme Saint, how old is he? If you can’t defeat him, you can retreat.”<br/><br/>“Remember, you must work together and must not let your guard down. Take turns facing him.”<br/><br/>The Celestial Pillar in charge nodded slightly, but the Doom God behind him looked extremely troubled.<br/><br/>Filled with hindsight dread, the Doom God recalled his first encounter with Fang Wang. Although he had been startled by Fang Wang’s methods at the time, he never imagined Fang Wang could grow so rapidly.<br/><br/>It was simply inconceivable!<br/><br/>Even in The Upper Realm, there were few who could grow at such a speed, and it could even be said to be impossible.<br/><br/>“Alright, I must go now. I wish you all smooth sailing as you go down to the Mortal Realm, and a triumphant return,” said the old Immortal Divine as he bowed with his hands clasped and then strode away.<br/><br/>The Celestial Pillar in charge watched as he disappeared into the depths of the void. He turned his head to look at the Doom God and said, “Tell me everything you know about Tiandao Fang Wang, and don’t you dare hide anything!”<br/><br/>His tone was very unfriendly. He had come here at the behest of the Doom God, and if the old Immortal Divine hadn’t arrived in time, he might have had to descend to the Mortal Realm alone to execute Tiandao.<br/><br/>He did not possess the strength to sweep through the Dark World.<br/><br/>The Doom God took a deep breath, adjusted his emotions, and then recounted all of his karmic ties with Fang Wang.<br/><br/>…<br/><br/>Ever since Wangdao was attacked by the Demon Race, the situation in the world had grown even more severe. The Descending Dragon Continent had also fallen into turmoil; the rallying cries of various dynasties were for the struggle for Fate, and even old grievances were dredged up. With Wangdao not intervening, the wars erupted swiftly.<br/><br/>The bright Firmament became increasingly murky with the alternation of day and night, and the whole world plunged into chaotic warfare.<br/><br/>Fang Wang sat cross-legged on a wooden bridge, occasionally sensing powerful auras of battle. The Celestial Qiankun was becoming more and more intense; he even felt the presence of beings from other worlds.<br/><br/>He remained unmoved, focused on his own path of enlightenment.<br/><br/>Around him were piled volumes of unparalleled techniques. Even though he had reached the level of Heavenly Dao Mysterious Immortal, he was still keen on growing stronger.<br/><br/>Yang Lin’er had already gone to a secluded place to cultivate on her own, not disturbing him. Thirty years had passed since they had separated.<br/><br/>Fang Wang was now one thousand and eighty years old!<br/><br/>He felt that the opening of the Heavenly Gate was not far away!<br/><br/>Before the descent of the Immortal Divine, it would be difficult for him to reach a higher realm, but he was confident to face everything. And the descent of the Immortal Divine wouldn’t necessarily lead to an immediate final battle.<br/><br/>The Immortal Court ruled over the Mortal Realm, and in The Upper Realm, they had their own domains and rivals; it was impossible for them to focus all their efforts on a total annihilation of him.<br/><br/>Fang Wang opened his eyes and looked up at the Firmament.<br/><br/>In the sky, two suns had emerged. This was seen by the people as an ominous sign, but only he and the Great Saints knew that the second sun was the Heavenly Gate.<br/><br/>Fang Wang could feel that the rules of the Mortal Realm were being shaken; the Immortal Divine would soon descend.<br/><br/>At that moment, a turtle crawled by his side; it was the Grand An Profound Turtle.<br/><br/>“Your Majesty, the Imperial City of the Grand An Divine Dynasty is about to emerge from the earth. You should take a look. It would be best to take control of the Imperial City. The Grand An Imperial City is the most powerful Magical Artifact you had cultivated in your previous life, capable of contending with the Immortal Treasures in the heavens. Your Majesty once held the Grand An Imperial City in hand, suppressing a thousand True Gods with unmatched divine power,” it said.<br/><br/>The Grand An Profound Turtle spoke, its tone filled with anticipation.<br/><br/>Fang Wang asked, “Where will it be?”<br/><br/>The fate of the world was rising too swiftly; great fortunes were everywhere, and almost every day a timeless Daoist sanctuary would emerge from the earth, beckoning all beings to contend for it.<br/><br/>The Grand An Profound Turtle answered, “When it surfaces, it will connect with your fate. You should go and claim it. Many powerful beings will be eyeing this treasure, so it’s best you retrieve it as soon as possible.”<br/><br/>Fang Wang nodded slightly, agreeing to the matter.<br/><br/>The Grand An Profound Turtle followed his gaze toward the firmament and lamented, “The Heavenly Gate is already so close, I’m afraid it’ll descend upon the Mortal Realm in about ten years. That’s a hundred years earlier than calculated. It seems the Immortals are in a hurry.”<br/><br/>Fang Wang did not respond; he was fixated on the terrifying Immortal Divines. Those Immortal Divines emitted an aura far surpassing that of an Emperor Saint, even slightly stronger than that of a True Venerable.<br/><br/>Exactly eighteen…<br/><br/>Could they be the Eighteen Divine Pillars?<br/><br/>Fang Wang remembered the intelligence reported by Qi Yun Great Saint very clearly. Though he was confident, he had not reached the point of underestimating everyone.<br/><br/>“Who was the leading Immortal Divine that took action against the Grand An Divine Dynasty back then?” Fang Wang asked.<br/><br/>The Grand An Profound Turtle thought for a moment, then said, “It was some Divine Pillar. I’ve forgotten the specific title.”<br/><br/>Fang Wang’s mouth curved up; it appeared that the Immortal Court’s wariness of him was no less than their past wariness of the Grand An Divine Dynasty.<br/><br/>The Grand An Profound Turtle then said, “I recall that when the Immortal Divine descended back then, there were godly beams. This divine light could wither all things. The majority of the Grand An Divine Dynasty’s territory was annihilated by this light, significantly weakening the dynasty’s fate. Luckily, our emperor was strong enough.”<br/><br/>“But no matter how strong His Majesty was, he was only one person. He could maintain his undefeated status but was also restrained, forced to watch his citizens die one by one, unable to bear it. In the end, he chose self-destruction, using his cultivation to bless his citizens’ reincarnations, saving them from annihilation.”<br/><br/>At this point, the Grand An Profound Turtle sighed, its tone full of sorrow.<br/><br/>“This time, I am not alone,” Fang Wang said calmly.<br/><br/>The Grand An Profound Turtle glanced at Fang Wang, wanting but hesitating to speak.<br/><br/>It wanted to say that the current Wangdao was far inferior to the Grand An Divine Dynasty of yesteryear, which had Great Saints and Great Emperors within it. Yet, they were powerless against the Immortal Divines.<br/><br/>But it dared not discourage Fang Wang because the Immortal Divines were about to arrive, and this calamity could no longer be avoided.<br/><br/>“Your Majesty, about the Imperial City…” The Grand An Profound Turtle began to tell Fang Wang how to take control of the Grand An Imperial City and the capabilities it possessed.<br/><br/>Fang Wang listened attentively.<br/><br/>Four years later.<br/><br/>The world fell into a strange atmosphere. There were no more battles of Celestial Qiankun; it seemed as if the great Cultivators of the Mortal Realm were all waiting for something.<br/><br/>About five more years passed.<br/><br/>One morning, the temperature between heaven and earth rose sharply, making the climate in the Mortal Realm as hot as midday; the temperature kept climbing. The ground cracked before one’s eyes, and plants withered away.<br/><br/>Fang Wang slowly opened his eyes. Beside him, the Grand An Profound Turtle, lying on its back, shook its head and turned over, looking up at the firmament in shock.<br/><br/>“They’ve come.”<br/><br/>…<br/><br/>Atop a cliff, Zhou Xue stood with her red dress billowing in the wind. She looked up at the firmament, a complex expression on her coldly beautiful face as she whispered to herself, “They’ve come.”<br/><br/>The Hongxuan Emperor, Divine Heart, and a group of great Cultivators from the Jin Xiao Sect stood behind her, all gazing upward at the firmament. The second sun was now more dazzling than the sun of the Mortal Realm.\t\t\t\t\t\t</div>", "images": {}, "success": true}