{"id": 456, "url": "https://www.novelhall.com/i-became-an-immortal-on-mortal-realm-32879/15163611.html", "title": "Chapter 446 - Chapter 446: Chapter 443: One Thousand And Fifty Years Old!", "volume": 5, "volume_title": "Volume 5", "body": "<h1>Chapter 446 - Chapter 446: Chapter 443: One Thousand And Fifty Years Old!</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 446: Chapter 443: One Thousand and Fifty Years Old!<br/><br/>Descending Dragon Continent, Sword Heaven Marsh.<br/><br/>Fang Wang arrived with Kuangdu Zhenren and Qi Yun Great Saint, settling on the wooden bridge. He immediately transmitted a message to Dugu Wenhun.<br/><br/>Kuangdu Zhenren and Qi Yun Great Saint had just arrived and were already amazed by the rules of heaven and earth here.<br/><br/>So rich!<br/><br/>And there was an indescribable Dao intent present, mysteriously compelling them to cultivate here.<br/><br/>Soon, Dugu Wenhun appeared by Fang Wang’s side. After a brief introduction, Fang Wang asked Dugu Wenhun to take the two down.<br/><br/>Fang Wang conferred the titles of Heavenly Stem Venerate upon Qi Yun Great Saint and Kuangdu Zhenren. From then on, a Great Saint level existence appeared among the Heavenly Stem Venerates.<br/><br/>Qi Yun Great Saint was no ordinary Great Saint, he was a Great Saint who had forged a world.<br/><br/>After the three of them left, Fang Wang stood by the bridge, his gaze fixed on Kunlun, deep in thought.<br/><br/>After a long while,<br/><br/>he lifted his gaze upward, only to see a new glimmer of light beside the bright sun in the firmament. It was so tiny that it was hard to see unless one looked carefully.<br/><br/>That must be the Heavenly Gate!<br/><br/>The Heavenly Gate was not among the starry space outside of the firmament but in a place even more remote.<br/><br/>As a Heavenly Dao Mysterious Immortal, Fang Wang could barely make out the Heavenly Gate. Below it stood countless Immortal Divines so still that they seemed like statues, and the gathered radiance was not obscured by the divine light of the Heavenly Gate.<br/><br/>In the time to follow, Fang Wang planned to continue his contemplation, ceaselessly perfecting the Heavenly Dao Myriad Classic of Laws.<br/><br/>As for his cultivation level, the Heavenly Dao Myriad Classic of Laws would cultivate on its own, so even without sitting down to meditate quietly, his cultivation level continued to rise.<br/><br/>He had assumed that all four of the Immortal Court War Gods would descend to the mortal realm, and he even felt that he might have to face the entire Immortal Court.<br/><br/>He slowly withdrew his gaze and began to meditate. As he settled into meditation, Ling Wu rose from the surface of the lake, enveloping him.<br/><br/>When Ling Wu ascended in this area, those Cultivators left in Sword Heaven Marsh knew that Wangdao Master had returned, causing quite a stir throughout the area.<br/><br/>Inside a grand hall,<br/><br/>Hong Chen met with Qi Yun Great Saint alone.<br/><br/>Qi Yun Great Saint was shocked to see Hong Chen, hesitating and struggling to speak.<br/><br/>Hong Chen sat there, holding a cup of hot tea, and said with a gentle smile, “You’re not mistaken, I am indeed the person you remember.”<br/><br/>Qi Yun Great Saint took a deep breath and bowed to Hong Chen.<br/><br/>“It was you who gave me the opportunity. After you left, the Immortal Court grew even more tyrannical. No other Great Saint could retreat in full like I did,” Qi Yun Great Saint spoke earnestly.<br/><br/>Hong Chen smiled and said, “Tell me about the current state of the Immortal Court, you should be privy to the situation in The Upper Realm.”<br/><br/>Qi Yun Great Saint nodded and started to recount the situation of the Immortal Court.<br/><br/>Hong Chen’s smile gradually faded away, and his expression darkened with undisguised killing intent in his eyes upon hearing the name of the Nine-Faced Divine Net.<br/><br/>…<br/><br/>As spring came and autumn went, years passed by.<br/><br/>Kunlun grew ever taller, with the sea of clouds only reaching the mountainside. Nowadays, Kunlun had become renowned as the first mountain in the world, and as Fang Wang achieved immortality through the Heavenly Dao, more and more beings recognized Kunlun as the foremost Daoist site in the world.<br/><br/>On this day,<br/><br/>Xiao Zi leaped out from the lake and approached Fang Wang, while Yang Lin’er emerged from the nearby Ling Wu.<br/><br/>Yang Lin’er, seeing the silhouette of Fang Wang, couldn’t help but tremble.<br/><br/>“Master, today should be your one thousand and fifty-year-old birthday, do you remember?” Xia Zi cheerily said.<br/><br/>Fang Wang opened his eyes and said with a light smile, “You don’t even remember your own birthday, yet you always remember mine.”<br/><br/>He had long forgotten his own birthday, as he had spent so many years in the Heavenly Palace, and, with the death of his parents in this life, he felt his birthday was no longer significant.<br/><br/>Xiao Zi laughed and said, “Of course, I should remember. Young Master, won’t you turn around to see who has come?”<br/><br/>Fang Wang raised his hand and rubbed its Dragon Head, saying, “Then you should leave now, and come back after I’ve met with her.”<br/><br/>Upon hearing that, Xiao Zi’s dragon eyes widened, filled with a look of deep resentment.<br/><br/>“Hmm?”<br/><br/>“Alright!”<br/><br/>Feeling Fang Wang’s gaze, Xiao Zi quickly dived into the lake and disappeared from sight.<br/><br/>Fang Wang turned around, and smiling at the stunned Yang Lin’er, he asked, “What? Don’t you recognize me anymore?”<br/><br/>Yang Lin’er bit her lip lightly, not stepping forward but instead asked, “Why?”<br/><br/>“Which ‘why’ are you asking about?” Fang Wang maintained his smile.<br/><br/>Yang Lin’er’s heart was overflowing with countless emotions, and she had many questions she wanted to ask, but when the words reached her lips, she didn’t know how to phrase them.<br/><br/>“Do you wish to live an ordinary life for the rest of your days, or chase after the Path of Immortality like today?” Fang Wang inquired.<br/><br/>Yang Lin’er remained silent.<br/><br/>She was very clear about what was in her heart; she didn’t regret any of it and was even grateful for everything she had experienced along the way. Her only regret was thinking of her parents, but since Yang Jun’s children were still on Earth, they would surely keep her parents company.<br/><br/>Having not seen each other for hundreds of years, Yang Lin’er was no longer the Earth woman she used to be. Having experienced battles and listened to Great Cultivators preach, she was a true Cultivator.<br/><br/>Yang Lin’er took a deep breath and asked, “Why didn’t you tell me all of this directly?”<br/><br/>Fang Wang dared not say that it was Zhou Xue’s intention to temper her this way, so he countered, “If you had known about my identity in advance, do you think you would have achieved more?”<br/><br/>Yang Lin’er smiled and said, “Indeed, if I had known all along, I wouldn’t have been so determined, and sitting still all day to cultivate is not something an ordinary person can endure.”<br/><br/>Fang Wang raised his hand and drew her across the space to his front.<br/><br/>Yang Lin’er’s black hair fluttered, her face showing a change as she was taken by surprise.<br/><br/>She thought she was no longer at the bottom of the Cultivation World, but in front of Fang Wang, she had no power to resist and couldn’t even react in time.<br/><br/>“Is this the power of a Heavenly Dao True Immortal?” she couldn’t help but ask.<br/><br/>Fang Wang, with a smile, asked, “Shall I test your understanding of the Dao?”<br/><br/>Yang Lin’er’s pretty face blushed faintly; she nodded slightly, and the Ling Wu around her began to surge, becoming denser and denser.<br/><br/>Afterward, Fang Wang sat down with her in meditation, asking her about her understanding of the Heavenly Dao Myriad Classic of Laws.<br/><br/>The slightly nervous Yang Lin’er quickly calmed down, and whenever she asked a question, Fang Wang effortlessly provided an answer that enlightened her.<br/><br/>As the sun set and the moon rose, Yang Lin’er gradually lost track of time.<br/><br/>Six days later.<br/><br/>A violent wind blew from the direction of Kunlun, dispersing the Ling Wu in front of Fang Wang and Yang Lin’er and causing her long hair to become disheveled.<br/><br/>Yang Lin’er frowned; she sensed an extremely terrifying presence approaching from afar.<br/><br/>Fang Wang was indifferent, continuing to explain the Heavenly Dao Myriad Classic of Laws.<br/><br/>During the lecture, he also contemplated the fusion of peerless techniques.<br/><br/>Yang Lin’er couldn’t help but ask, “Don’t you have to deal with it?”<br/><br/>The wild wind that was ravaging heaven and earth continued, and the oppressive force made her instinctively uneasy.<br/><br/>“Why should I bother? Not everyone can compel me to take action,” Fang Wang said with a light chuckle.<br/><br/>Upon hearing this, Yang Lin’er felt it made sense. She recalled following Xiao Zi in search of opportunities and hearing about the Dao Sect of Wangdao, the Heavenly Stem Venerate, each a first-rate power of this world.<br/><br/>“The great calamity has truly begun, and I estimate that after a hundred years, even those high and mighty Immortal Divines will fall,” Fang Wang, gazing toward the Firmament, murmured to himself.\t\t\t\t\t\t</div>", "images": {}, "success": true}