{"id": 451, "url": "https://www.novelhall.com/i-became-an-immortal-on-mortal-realm-32879/15097751.html", "title": "Chapter 441 - Chapter 441: Chapter 438: Jiu You Reappears, The Nine Extremes Of Resentment", "volume": 5, "volume_title": "Volume 5", "body": "<h1>Chapter 441 - Chapter 441: Chapter 438: Jiu You Reappears, The Nine Extremes Of Resentment</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 441: Chapter 438: Jiu You Reappears, The Nine Extremes of Resentment<br/><br/>The rising sun shone brilliantly, and the spiritual energy of Sword Heaven Marsh surged upwards, as if a sea of Qi was elevating, magnificently picturesque.<br/><br/>Standing by the lake, the Sword Immortal Xu Yan was comprehending swordsmanship. Having reshaped his Sword Spirit Physique, he could master any sword technique after just one glance, but the Sword Intent without techniques required him to spend time to comprehend, such as the Celestial Sword Intent of Sword Heaven Marsh.<br/><br/>Ever since Fang Wang achieved the status of Heavenly Dao True Immortal, his Celestial Sword Intent underwent a transformation. It had now reached the realm of Immortals, and after a hundred years of Xu Yan’s contemplation here, his Sword Intent had greatly increased, making him reluctant to leave.<br/><br/>Xu Yan opened his eyes and looked towards Kunlun.<br/><br/>“A hundred years have passed, and I wonder how strong you’ve become now…” Xu Yan murmured to himself, his eyes brimming with anticipation.<br/><br/>A person appeared beside him, it was Fang Bai.<br/><br/>Fang Bai was now the strongest Sword Cultivator in the Fang Family, of course, this did not include Fang Wang.<br/><br/>Within the Wangdao Sword Sect, Fang Bai’s momentum was also growing stronger and stronger.<br/><br/>“How about it, when will you come out of seclusion? To re-establish the name of the Sword Immortal,” Fang Bai asked with a teasing tone.<br/><br/>Xu Yan replied, “Before the descent of Immortal Divines, the struggle for Fate will not cease and will even continue for a long time after their descent.”<br/><br/>Fang Bai said meaningfully, “It’s said that the enhancement of Fate allows one’s cultivation to grow rapidly. In recent years, the number of Celestial Qiankuns has exploded. The Southern Celestial Sea to the south has already given birth to Celestial Qiankuns, and there was even a great battle of Celestial Qiankuns two years ago.”<br/><br/>Three hundred years ago, the Southern Celestial Sea was considered a backward region in their eyes, but now it has emerged with Celestial Qiankuns, which greatly impacted the Descending Dragon Continent.<br/><br/>Because of the existence of the Heavenly Dao, the Descending Dragon Continent has been in a state of peace, which, on the contrary, caused the cultivation speed of other non-Wangdao Cultivators to fall behind.<br/><br/>More and more Cultivators from the Descending Dragon Continent began to venture out, ready to fight for Fate.<br/><br/>There are many ways to fight for Fate, and the simplest is to kill the opposition!<br/><br/>“More and more disciples of the Wangdao are entering the world. Since the great battle between the Divine Sect and the Body Sect, many people want to follow the way of the Body Sect,” said Fang Bai with emotion.<br/><br/>Xu Yan’s gaze remained calm and he was unmoved, saying, “If it weren’t for the fellowship between the same sect, the Divine Sect would have surely been able to kill the Body Sect.”<br/><br/>Fang Bai did not argue, he laughed and said, “Indeed, but no matter what, he and Emperor Shi Yu are still alive, now dominating a region, with Karmic Force as vast as the sky. It’s said their Fate already occupies one-tenth of the Mortal Realm, that’s very frightening.”<br/><br/>Xu Yan snorted, “The Fate of a single Dao Master can rival the entire world.”<br/><br/>“Haha, you’re stating the obvious. Who would dare to trouble Ancestor Fang? He’s not even included. Only when Immortal Divines descend will he find an opponent,” Fang Bai said with a shake of his head and a chuckle, their topic sidetracked as they began to talk about those renowned individuals.<br/><br/>They spoke of Emperor Cangtian of Nine Lives Precious Spirit, mentioned Zhou Xue, the Sect Hierarch of the Jin Xiao Sect, and the peerless prodigies of the Eternal Saint Clan. As Xu Yan spoke, his eyes began to blaze with fervor.<br/><br/>In such an age of great contention, he too wanted to carve out a renowned name for himself.<br/><br/>The title of Sword Immortal was too insignificant previously, even now, if he claimed to be a Sword Immortal, some would still not take him seriously. He lacked achievements that would resound throughout the world.<br/><br/>The name of the Heavenly Dao is forged through battles that shake the ancient and the modern!<br/><br/>As the two were chatting, disciples of the Wangdao flew across the sky, and other disciples departed as well.<br/><br/>With the drastic changes in the world, Xuan Zong’s intelligence network was fully activated, and Hong Chen took no rest for even a moment, seeking to control the changes in every corner of the Mortal Realm.<br/><br/>Inside the pavilion’s great hall.<br/><br/>Hong Chen stood before a massive sand table, where globes of light hovered above, showing miniatures of continents and oceans upon closer examination.<br/><br/>A disciple of the Xuan Sect hurried to Hong Chen, knelt down, and said solemnly, “Reporting to Xuan Zong, the Jiu You Spring Eye has reappeared in the Mortal Realm, a large number of vengeful spirits from the Underworld are emerging from the Emperor Sea, and the Pan of Myriad Nets you gave us has been continuously in fluctuation, unable to stabilize.”<br/><br/>Upon hearing this, Hong Chen immediately cast a spell, pushing his palms towards the sand table. The sand grains on the table swiftly rose into the air, converging together and gradually forming a terrifying figure with three heads and six arms, indistinguishable as either human or demon.<br/><br/>Hong Chen’s complexion changed instantly.<br/><br/>Pu——<br/><br/>A mouthful of blood sprayed from his mouth and splashed onto the sandy golem, which immediately crumbled and fell onto the sand tray.<br/><br/>“Xuan Zong!”<br/><br/>The disciples of Xuan Zong rushed over and supported Hong Chen.<br/><br/>Hong Chen quickly circulated his energy, his face turned pale as death, devoid of any color, and he murmured to himself, “Nine Extremes… Supreme Resentment…”<br/><br/>The Xuan Zong disciples quickly asked, “Xuan Zong, are you alright? Do you need me to find the vice leader?”<br/><br/>“There’s no need…”<br/><br/>Hong Chen took a deep breath and said in a deep voice.<br/><br/>He gently pushed away the disciple and walked toward the outside of the hall, leaving behind only one sentence: “You continue to watch over the Jiu You Spring Eye.”<br/><br/>The Xuan Zong disciples looked at his retreating figure, holding back their words.<br/><br/>…<br/><br/>Hong Chen arrived in front of a pavilion and spoke, “Dao Master, I need to see you.”<br/><br/>“Speak directly, this place is under my prohibition, no one can overhear.”<br/><br/>Fang Wang’s voice came from inside the pavilion.<br/><br/>Following that, Hong Chen said, “The Jiu You Spring Eye has reappeared in the Mortal Realm, and the Nine Extremes Supreme Resentment that was suppressed in the Underworld has revived. The Nine Extremes Supreme Resentment is the Heart Demon of a certain Immortal Divine in the Immortal Court. Since its birth, it has brought trouble to the Immortal Court. Even I, who was the Heaven Emperor at the time, could not eradicate it completely. Thus, I suppressed it in the Underworld, intending to erode it with the power of reincarnation. I didn’t expect it to escape.”<br/><br/>“Is that forbidden existence from earlier him?”<br/><br/>“It is not. Even I cannot calculate that forbidden existence. The Underworld has been in existence for too long, and even Immortal Divines can’t fully uncover its secrets.”<br/><br/>“How strong is the Nine Extremes Supreme Resentment?”<br/><br/>“Very strong. The Immortal Court couldn’t exterminate him. In no more than fifty years, he will descend upon the Mortal Realm. His power has already appeared above the Jiu You Spring Eye; it cannot be stopped.”<br/><br/>Hong Chen’s face darkened.<br/><br/>The fact that he, a former Heaven Emperor, felt such unease was enough to demonstrate the strength of the Nine Extremes Supreme Resentment.<br/><br/>“I understand,” responded Fang Wang as his voice floated out. Hong Chen, after hearing this, said no more, bowed respectfully, and turned to leave.<br/><br/>Meanwhile.<br/><br/>Within another mysterious realm.<br/><br/>Fang Wang’s true self received the message. He turned his head to Qi Yun Great Saint by his side and asked, “Nine Extremes Supreme Resentment, have you heard of it?”<br/><br/>Qi Yun Great Saint was the monk he had met decades ago, who now has chosen to follow him.<br/><br/>Having ascended once before, Qi Yun Great Saint had an unpleasant time in the Immortal Court before abandoning it and hiding in this realm.<br/><br/>Upon hearing Fang Wang’s inquiry, Qi Yun Great Saint’s face turned pale as he tremulously said, “Dao Master, why are you suddenly inquiring about him?”<br/><br/>“He is about to appear in my Mortal Realm,” answered Fang Wang truthfully.<br/><br/>Upon hearing this, Qi Yun Great Saint quickly said, “Dao Master, you mustn’t go back! The Nine Extremes Supreme Resentment is even more dreadful than the True Venerables. A long time ago, a True Venerable wanted to harness the power of the Nine Extremes Supreme Resentment but was backfired upon and nearly perished!”\t\t\t\t\t\t</div>", "images": {}, "success": true}