{"id": 461, "url": "https://www.novelhall.com/i-became-an-immortal-on-mortal-realm-32879/15172596.html", "title": "Chapter 451 - Chapter 451: Chapter 448: Unparalleled! War God Pillar!", "volume": 5, "volume_title": "Volume 5", "body": "<h1>Chapter 451 - Chapter 451: Chapter 448: Unparalleled! War God Pillar!</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 451: Chapter 448: Unparalleled! War God Pillar!<br/><br/>The appearance of the Eighteen Divine Pillars sent shockwaves through the common folk below. Through celestial projections across the sky, they could clearly see the true forms of the Eighteen Divine Pillars. Was this what Immortal Divine beings looked like?<br/><br/>Without giving the masses time to ponder, Fang Wang planted the Heavenly Palace Halberd into the ground, shaking the sea of clouds.<br/><br/>“Tiandao Fangwang, it’s not too late to turn back now,” the great pillar said emotionlessly, his voice louder than that of the Golden-armored Deity, carrying a sense of indescribable oppression, filled with the mysteries of Divine Skills.<br/><br/>Fang Wang asked, “How should I turn back?”<br/><br/>“Surrender yourself, come back with us to the Immortal Court to face punishment, endure the retribution of the celestial laws, and you may have a chance to join the ranks of the immortals,” the great pillar stated, his expression as calm as still water, making it impossible to gauge his inner thoughts.<br/><br/>The other Divine Pillars remained silent, but each had already condensed their Lifespirit Treasures.<br/><br/>Their Lifespirit Treasures were far superior to ordinary spirits, all exuding tremendous power, at the very least Dao Origin Spirit Treasures.<br/><br/>Fang Wang responded, “If that’s the case, then let’s battle. I too wish to test the mettle of the Immortal Court’s Eighteen Divine Pillars.”<br/><br/>In an instant, the Eighteen Divine Pillars were visibly moved.<br/><br/>The celestial projections witnessed by the peoples of the Mortal Realm vanished abruptly, catching everyone off guard.<br/><br/>“Such fast Celestial Phenomenon, and moreover, your Celestial Phenomenon already possesses the mysteries of the cosmos. In a sense, your Celestial Phenomenon surpasses even the real heavens and earth in its excellence,” the great pillar praised, as if they were not enemies but philosophical companions discussing the Dao.<br/><br/>Behind Fang Wang, a succession of powerful presences closed in, headed by none other than the True Venerable.<br/><br/>Fang Wang had incorporated the entire Dark World into his Celestial Phenomenon, including tens of thousands of Emperor Saints. This was one of the sources of his confidence.<br/><br/>He planned to block the Heavenly Gate!<br/><br/>He believed the Immortal Court was not just targeting him, and he was self-aware enough to know he hadn’t yet reached the level where he could easily obliterate the Immortal Court.<br/><br/>“Great pillar, thirty thousand years have passed since we last crossed swords, and now we can do so once again!” the voice of the True Venerable rang out, laden with murderous intent.<br/><br/>The Eighteen Divine Pillars, looking at the True Venerable, all had grave expressions on their faces.<br/><br/>They couldn’t venture into the Dark World, but the True Venerable would occasionally go to the Upper Realm to trouble them. They were old adversaries, well aware of each other’s strength.<br/><br/>They had never imagined that the True Venerable wasn’t fallen but rather had been kept alive within Fang Wang’s Celestial Phenomenon, in a manner they could never have foreseen.<br/><br/>Now, Fang Wang’s perceived threat level in their hearts had skyrocketed.<br/><br/>“Thirty thousand years unseen, indeed I didn’t expect to clash again in such a manner. True Venerable, you must be aware that nobody can withstand the united force of the Eighteen Divine Pillars,” the great pillar said indifferently.<br/><br/>Before the True Venerable could respond, Fang Wang’s right hand suddenly let go.<br/><br/>Boom!<br/><br/>The Heavenly Palace Halberd flew at incredible speed towards the great pillar. A terrifying aura burst forth from within the great pillar, forcibly stopping the Heavenly Palace Halberd.<br/><br/>Around the great pillar, an aura flared like blazing flames, stirring the entire void.<br/><br/>His eyes turned fierce in an instant, and just as he was about to speak, the Heavenly Palace Halberd erupted with even greater force, pressing him backwards.<br/><br/>Almost simultaneously, the other seventeen Divine Pillars launched towards Fang Wang.<br/><br/>Quick!<br/><br/>In the blink of an eye, Fang Wang unleashed a palm strike, the Great Returning Void Palm!<br/><br/>However, the seventeen Divine Pillars reacted incredibly fast, each dodging in different ways. When the Great Returning Void Palm struck the Heavenly Gate, Fang Wang felt an unimaginable Fate.<br/><br/>The Great Returning Void Palm might dissolve this Fate, but alas, it was so vast that it forcibly drained all the Heavenly Dao Force from his palm.<br/><br/>Fang Wang shifted to the side, avoiding an attack from behind. A longsword engulfed in black flames swept past him.<br/><br/>He then stepped forward, appearing in front of the great pillar, and gripped the Heavenly Palace Halberd, thrusting it forward.<br/><br/>The great Divine Pillar retreated to the front of the Heavenly Gate, his right palm blocking in front of his chest, the palm facing the licked clean blade of the halberd, his powerful mana blocking the Heavenly Palace Halberd.<br/><br/>Under the mask, Fang Wang’s eyes became cold and harsh, as he was now left with only the will to fight.<br/><br/>Two strands of Sword Qi shot out from his eyes, quickly merging into one, striking at the great Divine Pillar like lightning. The Divine Pillar’s pupils suddenly dilated as he instinctively turned his head, but his cheek was still slashed by the Divine Nurturing Sword Qi, blood flying freely.<br/><br/>The great Divine Pillar’s gaze turned colder in an instant as he stepped towards Fang Wang, his formidable aura causing the clouds below to dissipate directly.<br/><br/>However, his aura did not shake Fang Wang. Instead, Fang Wang thrust the halberd to attack.<br/><br/>The reaction speeds of both were far beyond any others, all of this happening in the blink of an eye. At first glance, the two seemed to be entangled in close combat, each employing their Divine Skills, fighting fiercely and shaking the Heavenly Gate itself.<br/><br/>The other Divine Pillars were engaged by the True Venerables and Emperor Saints; except for the one facing a True Venerable, the others seemed to have plenty of leeways.<br/><br/>The ruling Divine Pillar fought while casting glances at Fang Wang, shock evident on his face.<br/><br/>He knew Fang Wang was strong, but he didn’t expect Fang Wang to be overwhelming the great Divine Pillar!<br/><br/>Indeed!<br/><br/>He was dominating the great Divine Pillar with absolute might!<br/><br/>Boom! Boom! Boom…<br/><br/>The deafening roaring continued incessantly as the figures of Fang Wang and the great Divine Pillar moved rapidly, with the Divine Pillar grasping a large umbrella to fend off Fang Wang’s offensive, sparks of rainbow light bursting from the umbrella from time to time, to no avail against Fang Wang.<br/><br/>The great Divine Pillar’s expression grew exceptionally grim as he felt a power from Fang Wang that dumbfounded him.<br/><br/>“Dao Power! Immeasurable Pure Bone!”<br/><br/>The thought of the departed Heaven Emperor swept through the great Divine Pillar’s mind like a tempest.<br/><br/>Could it be that the Red Dust Celestial Emperor chose Fang Wang because he was born with the Dao Bone?<br/><br/>If that were the case…<br/><br/>The great Divine Pillar’s face contorted into a fearsome grimace as he thought of a certain legend.<br/><br/>Bang!<br/><br/>Fang Wang swung the Heavenly Palace Halberd in a wide arc, striking the Divine Pillar’s breastplate and sending him flying into the light screen of the Heavenly Gate.<br/><br/>The great Divine Pillar’s breastplate shattered in an instant, confirming his suspicion that it was the power of the Dao Bone.<br/><br/>The Divine Armor they wore was not ordinary armor, but rather high-tier Immortal Treasure from the Immortal Court, ordinary forces simply incapable of penetrating their Divine Armor.<br/><br/>The great Divine Pillar lifted his gaze to see Fang Wang being entangled by six Divine Pillars, but if he couldn’t best Fang Wang, how could the others?<br/><br/>Fang Wang punched out, creating nine dragons each thousands of miles long that swept the six Divine Pillars away.<br/><br/>In that moment, Fang Wang’s figure overlapped with that of another powerful entity in the eyes of the great Divine Pillar.<br/><br/>The great Divine Pillar twisted his neck, slapping his left palm against the Heavenly Gate. His body surged towards Fang Wang, the large umbrella in his hand opening and spinning rapidly, countless Evil Spirits flying out, transforming into a black surge that engulfed Fang Wang.<br/><br/>No sooner had Fang Wang shaken off an entanglement from a Divine Pillar did he turn around to be overwhelmed by endless Evil Spirits.<br/><br/>However, in less than half a breath’s time, towering Heavenly Dao Flames burst forth, scattering the endless Evil Spirits, revealing a massive sun emerging behind Fang Wang’s head.<br/><br/>The Shenxiao Sun!<br/><br/>More precisely, the Heavenly Dao Sun!<br/><br/>Before the Heavenly Dao Sun, Fang Wang’s aura was like that of the highest deity, so supremely arrogant.<br/><br/>He looked down at the great Divine Pillar below, lifting the Heavenly Palace Halberd high with one hand, the great Divine Pillar’s pupils contracted tightly, instinctively sensing a strong unease.\t\t\t\t\t\t</div>", "images": {}, "success": true}