{"id": 463, "url": "https://www.novelhall.com/i-became-an-immortal-on-mortal-realm-32879/15174382.html", "title": "Chapter 453 - Chapter 453: Chapter 450: The Calamity Of The Three Realms!", "volume": 5, "volume_title": "Volume 5", "body": "<h1>Chapter 453 - Chapter 453: Chapter 450: The Calamity Of The Three Realms!</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 453: Chapter 450: The Calamity of the Three Realms!<br/><br/>“You…”<br/><br/>The Doom God’s voice trembled, but before he could finish speaking, Fang Wang’s left fist, wrapped in black flames, instantly engulfed his physical body. In less than a moment, he turned to ash!<br/><br/>The power of the Mie Jue Divine Tome!<br/><br/>Once, the Doom God had brought immense pressure to Fang Wang, even considering him as his greatest enemy.<br/><br/>Now, the Doom God was nothing but an ant in his presence!<br/><br/>The power of the Doom God surpassed most Emperor Saints; even Fang Wang in the Heavenly Dao Primary Origin Realm might not have been able to slay him. However, Fang Wang had now transcended both the Heavenly Dao Primary Origin and the Heavenly Dao True Immortal, reaching the realm of a Heavenly Dao Mysterious Immortal.<br/><br/>With the power of a Heavenly Dao Mysterious Immortal, even if the Eighteen Divine Pillars joined forces, they could not stop his edge!<br/><br/>Fang Wang didn’t regard the Doom God as worthy of his attention, so he couldn’t be bothered to waste words with him. Such ants were to be crushed underfoot!<br/><br/>Turning around, Fang Wang swung his left hand as if to shake off blood, though there was none on it, but he also wanted to shake off the bad luck.<br/><br/>As soon as he turned, Fang Wang’s gaze was drawn to the Heavenly Gate, where he saw a massive scroll flying out, depicting a true likeness of the heavens and the earth, with white cranes flying in unison, mountains and rivers surging, a dragon rising from the forests and fields, tigers roaring through the woods, and a majestic surge of immortal aura that made bright stars appear in the cosmic void.<br/><br/>Fang Wang felt an overwhelmingly powerful aura spill out from the scroll, and as it emerged, his Celestial Phenomenon began to fade, with True Venerables, Great Dark Demon Saints, and one Emperor Saint after another vanishing in succession.<br/><br/>Clutching the Heavenly Palace Halberd, Fang Wang’s white robe under his golden armor fluttered intensely as countless Immortal Divines turned in unison to face him.<br/><br/>The True God of the Heavenly Palace and the seven reincarnations from past lives reappeared beside Fang Wang, the vision of the Firmament from all the realms once again manifested, still fixated on Fang Wang. Heaven and earth acknowledged Fang Wang, affirming that he was the one safeguarding the destiny of the Mortal Realm.<br/><br/>Fang Wang and his past-life incarnations stood with their backs to the multitude, while the masses could see the army of Immortal Divines, scattered across the star-filled sky in front of him, deeply shocking everyone present.<br/><br/>Even those forces seeking to overthrow the Wangdao and those beings with grievances against it, regardless of who they were, were all subdued by the heroism displayed by Fang Wang.<br/><br/>Standing alone against the heavens’ Immortal Divines, such spirit was comparable to the Great Saints and Great Emperors of ages past!<br/><br/>At Sword Heaven Marsh, on a wooden bridge.<br/><br/>The Grand An Profound Turtle looked up at Fang Wang’s silhouette, feeling somewhat dazed.<br/><br/>“Your Majesty…”<br/><br/>Hong Xian’er, Yang Lin’er, Dugu Wenhun, Hong Chen, Chu Yin, Qi Yun Great Saint, Zhu Rulai, and others, all watched Fang Wang’s silhouette tensely, praying for him.<br/><br/>Far away in another part of the Mortal Realm, Zhou Xue withdrew her gaze. She turned and looked towards the Divine Heart, which was fronted by a gigantic column of light swirling with multicolored lightning, dazzling and mysterious.<br/><br/>“Everyone, after I lead people away, your task will be to fight side by side with Wangdao,” Zhou Xue said calmly.<br/><br/>As her voice fell, numerous Great Cultivators from the Jin Xiao Sect stepped forward, their eyes filled with anticipation as they looked toward the column of light.<br/><br/>The Divine Heart’s forehead was covered in cold sweat as he chuckled with difficulty, “We need to act quickly, I can hardly hold on.”<br/><br/>“Eh? Is there actually someone who can connect to The Upper Realm?”<br/><br/>A voice of surprise echoed through the heavens and earth, startling all the Jin Xiao Sect Cultivators into turning their heads. When they saw a crack appear in the sky and a golden-armored Deity step out, they were all terrified and quickly summoned their Lifespirit Treasures, ready for battle.<br/><br/>As Zhou Xue recognized the newcomer’s face, a bone-chilling murderous intent exploded in her eyes.<br/><br/>It was not just here—more and more Immortal Divines began descending to the Mortal Realm. Even the most ordinary Immortal Soldier radiated an aura that was not comparable to the Celestial Qiankun.<br/><br/>Beneath the rolling thunderclouds, a sea of blood covered a vast expanse of land, and a figure with white hair walked out from the sea of blood. He was dressed in loose, white clothes and walked barefoot. His gaze was fixed on the visions within the thunderclouds, his eyes revealing a longing.<br/><br/>“Dao Master, I will certainly not disappoint you…”<br/><br/>It was Yang Du!<br/><br/>Yang Du had undergone a complete transformation compared to before. His body had become more robust, but he had lost his wild nature, now exuding an even more sinister air. His skin was so pale it seemed devoid of any blood, and his chest was covered with dense, squirming blood marks.<br/><br/>Suddenly!<br/><br/>Yang Du’s gaze shifted toward another direction of the sky, where amidst the flashing lightning, a crack tore open, followed by the emergence of a giant hand, larger than the mountains beside the sea of blood, spectacular to behold.<br/><br/>Far from feeling tense at the sight, Yang Du licked his dry, cracked lips, revealing a cruel smile.<br/><br/>Across several vast oceans, on a continent, Ji Rutian stood on the peak of a mountain gazing at the scene of Fang Wang battling a group of Immortals, his expression calm. Only his tightly clenched fists within his sleeves betrayed his agitation.<br/><br/>“He is not the chosen one of the Mortal Realm; he is the calamity of the Three Realms of Immortals, humans, and ghosts.”<br/><br/>A voice emanated from within Ji Rutian, its tone distant and somber, followed by a vertical eye emerging from his forehead.<br/><br/>Ji Rutian asked softly, “Ancestor, can he win?”<br/><br/>“With the Eighteen Divine Pillars arisen, this battle will surely alarm the War Gods of the Immortal Court. If he can defeat the War God, he can win, and the Immortal Court will inevitably retreat. The Immortal Court cannot stake everything to purge the Mortal Realm, for they have other enemies lying in wait. But if he loses, his fate will be more tragic than any Emperor Saint in history.”<br/><br/>“His flesh, his soul, his Divine Skills, even his Lifespirit Treasure, all will be devoured by the Immortal Divine, condemning him to an eternity with no chance of transcending. Even death eludes him.”<br/><br/>The voice of the Ji Family ancestor echoed again, this time with an undertone of hatred.<br/><br/>Ji Rutian frowned. He stared intently at the Firmament, where Fang Wang’s figure was no longer visible within the vision, as countless Immortal Divines fearlessly charged forward, disregarding life and death in their advance.<br/><br/>…<br/><br/>In the void beyond the heavens, Fang Wang summoned all his Lifespirit Treasures, and his Heaven Bound Golden Silk swept across a million miles. Wherever it passed, no Immortal Divine could withstand it.<br/><br/>The Eighteen Divine Pillars and several Star Constellations entangled Fang Wang, bearing the brunt of the battle, but they couldn’t control him.<br/><br/>“Master, why are there so many Immortal Gods?”<br/><br/>Xiao Zi’s voice came from inside the Heavenly Palace Halberd, filled with alarm.<br/><br/>To her, the number of Immortal Gods Fang Wang had killed had reached a dreadful count, yet there were still more continuously pouring out from the Heavenly Gate.<br/><br/>As he fought, Fang Wang replied, “Actually, it’s not that there are many of them, they just keep being revived.”<br/><br/>After fighting so long, he had seen through their secret.<br/><br/>The Immortal Gods could revive because of the Immortal Court’s Destiny, the foundation of the Heavenly Gate!<br/><br/>In his hand was a Divine Skill capable of obliterating fate, yet using this skill required sustaining it with Heavenly Dao Force, and his Heavenly Dao Force couldn’t compare to the Immortal Court’s Destiny. The Divine Pillars would not allow him to freely cast spells on the Heavenly Gate.<br/><br/>“Doesn’t that mean they can never be fully eradicated?” Xiao Zi exclaimed in shock.<br/><br/>Fang Wang threw the Heavenly Palace Halberd, which pierced through the divine bodies of several Immortal Gods and smashed in front of the Heavenly Gate. He then appeared in a flash in front of the Heavenly Palace Halberd, a display of the sublime mystery of The Heaven of Carefree Freedom!<br/><br/>Grasping the halberd, he looked towards the Heavenly Gate and said softly, “That’s not necessarily the case.”\t\t\t\t\t\t</div>", "images": {}, "success": true}