{"id": 468, "url": "https://www.novelhall.com/i-became-an-immortal-on-mortal-realm-32879/15185399.html", "title": "Chapter 458 - Chapter 458: Chapter 455 Dragon Soul True God Technique Great Perfection", "volume": 5, "volume_title": "Volume 5", "body": "<h1>Chapter 458 - Chapter 458: Chapter 455 Dragon Soul True God Technique Great Perfection</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 458: Chapter 455 Dragon Soul True God Technique Great Perfection<br/><br/>Within the World of Fate, two figures were constantly shifting and colliding, filling the entire world with their afterimages as if both sides possessed millions of clones.<br/><br/>Their combat pressure was simply too intense, causing the Heavenly Gate to tremble incessantly. Upon closer inspection, one could see a nearly imperceptible crack forming on one of the gate’s pillars.<br/><br/>The Lingxiao Saint Emperor held the Dragon Sky Azure Cloud Sword in his hands, which was wrapped around a fearsome Azure Dragon Soul, a hundred times larger than his entire figure.<br/><br/>Fang Wang was the same, with his Heavenly Palace Halberd enveloped by a Purple Dragon Soul, which was the form of Xiao Zi. The techniques of the two were nearly identical, as if they were battling their own shadows.<br/><br/>“To have mastered my Dragon Soul True God Technique in just ten years, and to have achieved a level of mastery that is no less than mine…”<br/><br/>The Lingxiao Saint Emperor secretly felt a shock in his heart, and his gaze towards Fang Wang had completely changed.<br/><br/>They had been fighting for ten years, and starting from last year, Fang Wang suddenly displayed the Dragon Soul True God Technique, taking him by surprise. Now, relying on the Dragon Soul True God Technique, Fang Wang was actually engaging him head-on.<br/><br/>During the previous nine years, he was mostly suppressing Fang Wang. If it weren’t for Fang Wang’s mastery of certain extraordinary techniques that made his flesh and soul intangible, he would have slain Fang Wang long ago.<br/><br/>Ten years had passed, Fang Wang had fully comprehended his Divine Skill, yet he hadn’t learned anything from Fang Wang.<br/><br/>The Lingxiao Saint Emperor could no longer maintain his composure, a voice within him telling him that if this persisted, he might be defeated.<br/><br/>Fang Wang still had his eyes closed, and the more he did so, the greater the pressure he brought to the Lingxiao Saint Emperor.<br/><br/>Indeed, at first, the Lingxiao Saint Emperor wanted to test the aptitude of this junior, and if it was not bad, he would capture him and find a way to secure a path of survival for him in the future.<br/><br/>The Lingxiao Divine Sect of the Lingxiao Saint Emperor was scattered in the Mortal Realm, with countless beings having practiced it, but only Fang Wang satisfied him to the degree he wanted.<br/><br/>But now…<br/><br/>The Lingxiao Saint Emperor’s eyes burst with a chilling intent to kill, causing the entire World of Fate to solidify.<br/><br/>His murderous intent even dragged Fang Wang out of the Heavenly Dao State, and Fang Wang’s gaze was desolate.<br/><br/>The Dragon Soul True God Technique had allowed him to stay in the Heavenly Palace for eighty thousand years, causing his fear of the tribulations of the Immortal Divine to completely dissipate, and his heart was utterly calm.<br/><br/>Boom!<br/><br/>The Heavenly Palace Halberd clashed with the Dragon Sky Azure Cloud Sword, the collision of the two powerful dragon souls distorting the whole World of Fate.<br/><br/>The Dragon Soul True God Technique allows one to condense a dragon soul based on their own Lifespirit Treasure. This dragon soul is the concentration of one’s path and can contain the rules they have mastered—once deployed, their power surges immensely!<br/><br/>When Fang Wang first faced the Dragon Soul True God Technique, he was nearly killed instantly. Fortunately, he activated the intangibility of the Jiu You Freedom Technique in time. Even so, for the time that followed, he spent most of it evading until he saw through the Dragon Soul True God Technique completely.<br/><br/>He suddenly found that his comprehension had greatly increased, and the feelings he had in the Heavenly Palace were present in the Heavenly Dao State as well.<br/><br/>An unending stream of thoughts and ceaseless inspiration made Fang Wang feel mystical.<br/><br/>Fang Wang had been ready to execute the Nine Lives Nirvana Sword Technique at any moment for revival, but now, he felt that the time had not yet come.<br/><br/>The speed of the Lingxiao Saint Emperor suddenly increased, forcing Fang Wang to once again deploy The Heaven of Carefree Freedom, ignoring his attack.<br/><br/>The great battle continued!<br/><br/>Time in this World of Fate lost its meaning, and in their eyes, there was only the fight.<br/><br/>Soon, when Fang Wang adapted to the speed of the Lingxiao Saint Emperor and began to close his eyes, he once again entered the Heavenly Dao State.<br/><br/>He was not just fighting on instinct. If one looked closely, they would discover that swirling around the blade of the Heavenly Palace Halberd was the Mie Jue Divine Tome, and each of his attacks was quelling the Immortal Court’s Destiny.<br/><br/>The Lingxiao Saint Emperor saw this too, but he had no solution. He could only fight with all his might, believing that Fang Wang’s mana was far inferior to his, such secret techniques could not possibly be maintained forever.<br/><br/>As time passed, the cracks on the Heavenly Gate grew wider and more numerous.<br/><br/>In the real world, more and more Immortal Divines were summoned back, gathering in front of the Heavenly Gate, contributing their fate to the gate, yet they couldn’t stop the cracks in the Heavenly Gate from multiplying.<br/><br/>Years passed by.<br/><br/>True Gods were all summoned to the front of the Heavenly Gate, while those roaming the Mortal Realm were Immortal Soldiers, giving the entire Xuanzu’s World a brief respite.<br/><br/>But new troubles arose; other powerful beings from various realms crossed over, vying for the great fate, and some directly pledged allegiance to the Immortal Soldiers in hopes of being taken up to ascend.<br/><br/>In just a few decades, the Firmament of Xuanzu’s World became gloomy, malevolent aura pervaded everywhere, even around Kunlun.<br/><br/>On this day.<br/><br/>“I am Emperor Cangtian. Today I have become a sage, and wish to forge a path of the Great Dao for the Mortal Realm!”<br/><br/>A voice echoed throughout the Mortal Realm, stirring up a huge commotion. Discussions about Emperor Cangtian started everywhere.<br/><br/>Over the years, Emperor Cangtian’s fame had spread far and wide, becoming a peerless prodigy of an era. His becoming a sage surprised many yet seemed only natural to others.<br/><br/>No sooner had the proclamation of sagehood settled than a golden rain started to fall from the sky, cleansing the malevolent aura between heaven and earth, and benefiting all beings that bathed in it.<br/><br/>The Mortal Realm seemed rejuvenated as a result.<br/><br/>The Immortal Divines in the distant heavens also heard Emperor Cangtian’s words. The vast majority sneered, but a few frowned upon hearing them.<br/><br/>The Grand Divine Pillar, expressionless, spoke, “Beidou Star Lord, go and recruit this Great Saint.”<br/><br/>Upon hearing this, an Immortal Divine immediately stood up, saluted him, and then turned to fly towards the Mortal Realm.<br/><br/>The Immortal Divines began to discuss Emperor Cangtian, deducing his fate as substantial, rarely seen in the Mortal Realm. They bet among themselves whether Emperor Cangtian would bow his head or not.<br/><br/>The Grand Divine Pillar ignored these discussions, his gaze fixed firmly on the Heavenly Gate.<br/><br/>Following his gaze, the cracks in the Heavenly Gate were multiplying, already too numerous to ignore.<br/><br/>Suddenly.<br/><br/>An Immortal Divine flew out from inside the Heavenly Gate. It was a red-armored man who appeared to be a transformation of some avian demon. He quickly approached the Grand Divine Pillar and knelt before him, saying gravely, “My lord, His Highness has issued a decree stating that two War Gods have been asked to take action, and the second Heavenly Gate will be opened!”<br/><br/>A second Heavenly Gate!<br/><br/>All the Immortal Divines breathed a sigh of relief.<br/><br/>The Heavenly Gate could only come from The Upper Realm, and if it were destroyed, they would have no way to return. Their greatest fear was precisely this.<br/><br/>Staying in the Mortal Realm was no blessing for the Immortal Divines, for though powerful, they could be eroded by the fate of heaven and earth. Once the ascension period ended and the Immortal Court’s Destiny receded, they would have great difficulty surviving in the Mortal Realm.<br/><br/>In the Immortal Court, being banished to the mortal plane was one of the most cruel punishments.<br/><br/>“Lingxiao Saint Emperor, even you have trouble dealing with him?”<br/><br/>Gazing at the Heavenly Gate, the Grand Divine Pillar thought silently. A vision of Lingxiao Saint Emperor’s silhouette appeared in his mind, his eyes reflecting a hint of admiration.<br/><br/>“Ah—”<br/><br/>An agonized scream suddenly came from within the Heavenly Gate, startling all the Immortal Divines to their feet.<br/><br/>The Supreme Divine Pillar frowned and said, “It’s His Highness’s voice! He cannot die here!”<br/><br/>Not just him, the other Immortal Divines panicked as well. The ‘His Highness’ they spoke of was the son of the Heaven Emperor, and if he were to perish, their destiny would be entwined with his fate.\t\t\t\t\t\t</div>", "images": {}, "success": true}