{"id": 467, "url": "https://www.novelhall.com/i-became-an-immortal-on-mortal-realm-32879/15185398.html", "title": "Chapter 457 - Chapter 457: Chapter 454 The Fate Of The Heavenly Dao", "volume": 5, "volume_title": "Volume 5", "body": "<h1>Chapter 457 - Chapter 457: Chapter 454 The Fate Of The Heavenly Dao</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 457: Chapter 454 The Fate of the Heavenly Dao<br/><br/>“No more talk, devour his fate quickly.”<br/><br/>The voice of Xu Chonggua emanated from within Yang Du’s body, urgent and filled with an excitement that couldn’t be suppressed.<br/><br/>Instantly, Yang Du opened his mouth, and as he did, the Immortal Soldier whose neck was being clenched shivered all over, and his fate transformed into wisps of white vapor that drilled into Yang Du’s mouth.<br/><br/>In less than the span of ten breaths, the Immortal Soldier who had been drained of his fate disintegrated into ash and smoke.<br/><br/>Yang Du’s face showed a look of satisfaction.<br/><br/>“With my cultivation, coupled with your physique, we could barely match an ordinary Immortal Soldier. But you must not be careless; avoid the True Gods of the Immortal Court as much as possible. A true Immortal Divine is definitely not someone you can contend with.”<br/><br/>The voice of Xu Chonggua sounded again, as if Yang Du was speaking in another voice.<br/><br/>Yang Du looked up at the firmament, the illusion of the firmament still ongoing, displaying the majestic presence of the Heavenly Gate with numerous Immortal Divines gathered in front of it. Occasionally some Immortal Divines would fly downward while others soared up, merging into the group of Immortal Divines before the Heavenly Gate.<br/><br/>Yang Du’s gaze was fickle, lost in thought.<br/><br/>Boom!<br/><br/>Suddenly, an explosion erupted at the edge of the sky, a blinding flash of light engulfing everything, making the world lose its color.<br/><br/>The wind howled, and Yang Du’s white hair fluttered wildly, but his expression remained unchanged, as though he had grown accustomed to such sudden events.<br/><br/>“It’s been ten years, Dao Master. Are you still fighting…?”<br/><br/>Yang Du muttered to himself in a deep tone.<br/><br/>It had been a decade since the Heavenly Gate was opened and Fang Wang plunged into it, never to be seen again. Countless Immortal Soldiers descended to the mortal realm to purge those heavy with karmic force, making these ten years unquestionably the darkest millennium had seen, with countless beings dying every day.<br/><br/>Xu Chonggua fell silent, curious about Fang Wang’s fate as well.<br/><br/>Or rather, the entire Mortal Realm was looking forward to the Heavenly Dao.<br/><br/>Even those powers that had once harbored hostility toward the Immortal Divines felt the same, for only when truly facing the Immortal Divines did they realize how dreadful they were. Even the weakest Immortal Soldier could not be matched by the celestial Qiankun.<br/><br/>Elsewhere, on the Descending Dragon Continent.<br/><br/>Bloody red seawater crashed against the shore, washing up skeletons onto the beach, and at the edge of the forest, Disciples of the Way of Hope were meditating in a sitting posture, facing the ocean, always keeping watch over the sea surface to avoid unexpected incidents.<br/><br/>Behind the forest, Kunlun Mountain stood majestic, displaying its vast and boundless presence.<br/><br/>At the peak of Kunlun Mountain, there was a grand golden pillar of light that even the sea of clouds could not obscure. The golden pillar occasionally burst into brilliance, sweeping across the heavens and earth and invigorating the spirits of the Disciples of the Way of Hope posted in all directions.<br/><br/>Behind Kunlun, inside Sword Heaven Marsh, there were still many cultivators, but compared to ten years ago, it was less lively and prosperous, instead filled with desolation and solitude.<br/><br/>In a grand hall, Hong Chen stood in front of a sand table with furrowed brows. Following his gaze, the sand table displayed thousands of converging beams of light, ever-changing, mysterious and profound, seeming to symbolize the vicissitudes of destiny.<br/><br/>Solitary Life Elder stood by his side, lamenting, “The variables of the Mortal Realm are changing every day, an unprecedented situation, and the Immortal Divines are biding their time, unsure if to guard against the Dao Master or if the Heaven Emperor has other plans.”<br/><br/>Hong Chen replied, “The Eighteen Divine Pillars, the Star Constellations, and the True Gods are reluctant to descend because they must guard the Heavenly Gate. If the Heavenly Gate is breached by the Dao Master, they won’t be able to leave the Mortal Realm. Moreover, faced with the ever-emerging beings with great fate in the Mortal Realm, they too are tempted. They have their own troubles in The Upper Realm and need to continually expand their ranks of Immortal Divines with beings from the Mortal Realm. For them, Xuanzu’s World is an excellent opportunity right now.”<br/><br/>“That Heaven Emperor is probably in a dilemma; after all, it’s difficult to have the best of both worlds.”<br/><br/>Solitary Life Elder then asked, “With the significantly waned fate of Jin Xiao Sect, the Sect Hierarch and protectors have disappeared. Do you think the rebels could be them?”<br/><br/>“Perhaps. But more than them, I’m more concerned about the Mortal Realm’s fate,” said Hong Chen nonchalantly, apparently uninterested in Jin Xiao Sect.<br/><br/>Solitary Life Elder couldn’t help but look towards the sand table, where he saw the myriad beams of light gradually coalesce into ten spheres of light, one significantly larger than the rest, with the remaining ones orbiting it like stars around the sun.<br/><br/>Apart from these ten spheres of light, there were countless little points of light scattered in all directions, some of them suddenly vanishing, with new lights spontaneously emerging.<br/><br/>“Tsk tsk, who knows who is so unlucky. Being the strongest being of the Mortal Realm’s fate at the onset of calamity,” Solitary Life Elder said with wonder.<br/><br/>Hong Chen fixed his gaze on the brightest orb, saying, “Something’s not right, his fate is growing too fast. This rate of growth…it seems familiar somehow.”<br/><br/>The Solitary Life Elder did not think too much about it, expressing his thoughts, “If only I could calculate the Dao Master’s fate, wouldn’t that be wonderful? I truly want to know how the Dao Master’s fate compares to others, to see how big the difference is.”<br/><br/>No sooner had his words fallen than a domineering and peerless pressure descended, enveloping the entire Descending Dragon Continent.<br/><br/>“Heaven Emperor, long time no see. Why not come out and battle me!”<br/><br/>A thunderous roar echoed throughout heaven and earth, leaving those with a lower cultivation base utterly shaken to their souls.<br/><br/>Hong Chen and the Solitary Life Elder were not surprised, as this was not the first time such an event had occurred.<br/><br/>Qi Yun Great Saint and Jiang Shenming had plenty of old rivals!<br/><br/>…<br/><br/>In the outer space beyond the sky, in front of the Heavenly Gate, the Eighteen Divine Pillars and hundreds of Immortal Divine beings were gathered. They stood in tight formation, daring not to be careless, their gazes fixed on the Heavenly Gate.<br/><br/>The Imperial Divine Pillar couldn’t help but turn to the Great Divine Pillar and ask, “Is His Highness alone sufficient?”<br/><br/>The Great Divine Pillar’s expression was calm as he responded, “His Highness alone is certainly not enough, but the fact that we have been able to hold on this long indicates that there are others within the Heavenly Gate. It is likely the Saint Emperor. Among the Four Great War Gods, he has the deepest understanding of the Dao of Fate, which is why he has managed to keep us completely unaware.”<br/><br/>Saint Emperor?<br/><br/>Upon hearing this, a look of joy spread across the faces of all the Immortal Divine beings.<br/><br/>“If it is indeed the Saint Emperor, then the Heavenly Dao is surely doomed.”<br/><br/>“Yes, the Saint Emperor’s battle with the Divine Platform Saintly Venerate twenty thousand years ago is still a celebrated tale to this day.”<br/><br/>“I didn’t expect the Saint Emperor to take action. He seldom heeds the call. It seems the Heavenly Dao is truly extraordinary.”<br/><br/>“Does this mean we can descend to the Mortal Realm? Recently, many Great Saints and Great Emperors have emerged in Xuanzu’s World, which must be dealt with.”<br/><br/>“Exactly, if we continue like this, the dignity of the Immortal Divine will be lost!”<br/><br/>The Immortal Divine beings chattered amongst themselves. They felt only fear when speaking of the Heavenly Dao. However, when the discussion shifted to the Mortal Realm’s Great Saints and Great Emperors, their words were filled with contempt.<br/><br/>Just then.<br/><br/>Crack!<br/><br/>All the Immortal Divine beings were startled and looked up in unison, only to see a tiny crack appearing on the wooden pillar to the left of the Heavenly Gate. Although it was small, this anomaly caused the faces of all Immortal Divine beings to shift with shock.<br/><br/>“Protect the formation!”<br/><br/>The Great Divine Pillar, equally alarmed, immediately commanded in a deep voice. He was the first to raise his palm and channel his mana into the Heavenly Gate, with the other Immortal Divine beings quickly following suit.<br/><br/>All the Immortal Divine beings were panicked, not one daring to speak.<br/><br/>A similar speculation crossed all their minds.<br/><br/>Could it be that even the Lingxiao Saint Emperor cannot hold back the Heavenly Dao?<br/><br/>How is that possible…<br/><br/>The Four Great War Gods were already the pinnacle of the Immortal Court’s martial might. If even the Lingxiao Saint Emperor could not defeat the Heavenly Dao…<br/><br/>The Immortal Divine beings felt it was preposterous, yet fear spread uncontrollably within their hearts. They all had battled with the Heavenly Dao, and none of them would dare say for certain that the Heavenly Dao couldn’t best the War Gods.<br/><br/>In battle with them, the Heavenly Dao was like slicing through melons and vegetables; they had only been able to struggle on relying on the Immortal Court’s Destiny…\t\t\t\t\t\t</div>", "images": {}, "success": true}