{"id": 464, "url": "https://www.novelhall.com/i-became-an-immortal-on-mortal-realm-32879/15174383.html", "title": "Chapter 454 - Chapter 454: Chapter 451: Time Stops, Fortune And Prosperity Immortal Monarch", "volume": 5, "volume_title": "Volume 5", "body": "<h1>Chapter 454 - Chapter 454: Chapter 451: Time Stops, Fortune And Prosperity Immortal Monarch</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 454: Chapter 451: Time Stops, Fortune and Prosperity Immortal Monarch<br/><br/>The major divine pillar and the others swiftly turned around after seeing Fang Wang disappear, feeling extremely frustrated. They were unable to lock onto Fang Wang’s aura and had to rely on their eyesight alone, which was uncomfortable for them, since they were accustomed to sensing auras.<br/><br/>Locking on the enemy with the naked eye ultimately requires reaction time, and even the slightest gap could become a cause of irrevocable defeat.<br/><br/>Instead of progressing further, the divine pillars stood at a distance, watching Fang Wang.<br/><br/>That mysterious scroll had not yet fully emerged from the Heavenly Gate, but the portion that did extend over ten thousand miles, seemingly endless. Fang Wang was quietly observing the scroll above him.<br/><br/>The divine pillars stopped, but other immortal divines were still trying to kill Fang Wang. Without the divine pillars’ aid, these immortal divines couldn’t surpass Fang Wang’s past incarnation.<br/><br/>This past incarnation was not connected to Fang Wang’s former life’s strength, but to his current life’s power, all possessing strength near that of a Heavenly Dao Mysterious Immortal. As long as Fang Wang’s Heavenly Dao mana wasn’t exhausted, they could continue to exist.<br/><br/>Fang Wang’s gaze was drawn to a figure on the scroll, a figure standing atop a mountain peak clad in silver armor with a phoenix-winged purple crown on his head. The figure in the painting slowly lifted his head, revealing a handsome but stern face. His eyes, filled with a chilling intent, seemed to reach out from the painting itself.<br/><br/>The purple-crowned man looked up at Fang Wang, and Fang Wang likewise looked up at him. Their eyes met, and the entire cosmic void came to a standstill—every immortal divine working in battle was frozen in time, including the divine pillars.<br/><br/>Time and space were stopped!<br/><br/>The purple-crowned man leaped up, astonishingly jumping out of the scroll and lunging towards Fang Wang. His right hand was outstretched like a claw, aiming to capture Fang Wang.<br/><br/>Just as he was about to grasp Fang Wang, Fang Wang’s hand shot up like lightning, grabbing the man’s wrist.<br/><br/>The purple-crowned man’s expression instantly became astonished, as if he couldn’t believe his own eyes.<br/><br/>Taking advantage of the situation, Fang Wang yanked him downward, then lifted his knee and drove it into the man’s chest. This move made the purple-crowned man’s face contort instantly, feeling as though his soul was almost knocked out of his body.<br/><br/>Everything in the cosmic void returned to normal, and the great battle continued!<br/><br/>The purple-crowned man suddenly shrank back, relocating above the scroll, maintaining a distance from Fang Wang. He stared at Fang Wang in shock and gritted his teeth, “Can you see through my divine skills?”<br/><br/>Fang Wang’s eyes remained calm as he replied, “It’s nothing more than leveraging the forces of the rules of this mortal realm.”<br/><br/>Reaching the Celestial Qiankun Realm enables one to perceive the rules of the cosmos, and an Emperor Saint Immortal may control a type of rule force. Fang Wang was different; as a Heavenly Dao Mysterious Immortal, he had perceived all the forces of the rules that make up the world, and he could manipulate them, hence seeing through the purple-crowned man’s divine skill in a single glance.<br/><br/>If the skill had indeed been a divine skill performed with his own mana, Fang Wang might not have been able to see through it.<br/><br/>The way of the Heavenly Dao is also the way of the world, and in borrowing the power of the cosmos, Fang Wang stands at an immense height, looking down on all living beings.<br/><br/>Before the purple-crowned man could further ponder, Fang Wang raised his halberd and attacked. When Fang Wang appeared in front of him, the Mie Jue Divine Tome condensed behind him.<br/><br/>The vast dark aura of the Mie Jue Divine Tome penetrated into the Heavenly Palace Halberd, rendering it ominously ominous-looking.<br/><br/>The purple-crowned man immediately swung his palm, and the surrounding space distorted as if the universe were collapsing, concentrating into his palm before bursting forth. Fang Wang seemed to be struck frontally by a force of the cosmos itself, his vision whirling.<br/><br/>Cold light flickered in Fang Wang’s eyes, and with a twist of his right hand, the Heavenly Palace Halberd erupted with terrifying qi energy, shredding through the layers of cosmic rule forces before him and swiftly advancing towards the purple-crowned man.<br/><br/>The purple-crowned man was horrified and pushed out his palms, trying to defend with his mighty mana.<br/><br/>Boom!<br/><br/>His purple crown was blown off, crashing into the Heavenly Gate. With disheveled hair, he desperately resisted, but the annihilative force within the Heavenly Palace Halberd was too terrifying, causing his palms to start splitting open and blood to ooze continuously.<br/><br/>Fang Wang’s Heavenly Dao mana exploded, and the Heavenly Palace Halberd emitted a violent black qi, instantly engulfing the purple-crowned man.<br/><br/>“How dare you!”<br/><br/>A thunderous voice came through, and as soon as the first word was uttered, the speaker swung his sword to strike, but was blocked by a shield formed from the Heavenly Dao Myriad Classic of Laws.<br/><br/>Fang Wang glanced over, the newcomer was not a divine pillar; with a single glance, he plunged the opponent into the Eighteen Layers of Abi Hell.<br/><br/>Immediately following, Fang Wang plunged into the Heavenly Gate.<br/><br/>The Eighteen Divine Pillars swiftly flew to the front of the Heavenly Gate, casting spells toward it one after another.<br/><br/>“How did he get in? He doesn’t have the Immortal Court’s Destiny,” one of them said.<br/><br/>“Could it be that he has practiced the Immortal Court’s Cultivation Technique?” another speculated.<br/><br/>“It’s possible, after all, that existence is serving under him,” a third chimed in.<br/><br/>“This guy is truly terrifying; to master so many Cultivation Techniques at just a thousand years old. Even if it’s a great being reincarnated, their physical body should still require a cultivation process,” remarked another with awe.<br/><br/>The Divine Pillars discussed among themselves, shaking with true fear as the battle had been raging for some time. They knew they were no match for Fang Wang without the blessing of the Immortal Court’s Destiny.<br/><br/>The great Divine Pillar seemed to sense something, his complexion drastically changed as he cried out, “This is bad! He’s trying to sever our destiny!”<br/><br/>Upon hearing this, the other Divine Pillars also changed their expressions and hurriedly followed into the Heavenly Gate.<br/><br/>…<br/><br/>Descending Dragon Continent, Sword Heaven Marsh.<br/><br/>Hong Xian’er, Dugu Wenhun, Hong Chen, and others looked up at the phantom in the firmament. They were sweating bullets for Fang Wang as he entered the Heavenly Gate. The phantom above no longer tracked Fang Wang’s movements but locked onto the Heavenly Gate.<br/><br/>All beings saw the Immortal Divines starting to turn around, flying toward the Mortal Realm.<br/><br/>The catastrophe of the Mortal Realm had just begun!<br/><br/>Boom—<br/><br/>An earth-shattering thunderclap erupted, echoing through the mountains to the north of Kunlun.<br/><br/>All the Cultivators of Wangdao looked up to see a crack appearing high in the sky, and a figure slowly stepped out from it. This was a Dao Robe-dressed elder with an Immortal Aura and Daoist Bones, surrounded by golden long swords floating in a fan shape behind him, emitting waves of light, causing the surrounding space to appear to pulse.<br/><br/>“Your Majesty, it’s been a long time,” the Dao Robe elder spoke slowly, his tone indifferent.<br/><br/>Looking up at him, Hong Chen said, “I didn’t expect the first one to come looking for me to be you, junior brother. How has it been serving under him? I heard you were conferred the title of Star Lord, the Fortune and Prosperity Immortal. The name sounds quite nice; I wonder what your status is.”<br/><br/>Junior brother?<br/><br/>Dugu Wenhun, Hong Xian’er, and others looked at Hong Chen in astonishment. They had not known his true identity before.<br/><br/>Hong Chen had an indelible contribution to the establishment and growth of Wangdao; he mastered countless Dao laws, which made many curious about his real identity.<br/><br/>They never expected Hong Chen to be called “Your Majesty” by an Immortal Divine!<br/><br/>With a stroking of his beard and a smile, the Fortune and Prosperity Immortal replied, “It is indeed but a nominal title, lacking real power. I do miss the days when my senior brother was the Heaven Emperor. However, if you had continued as the Heaven Emperor, the Immortal Court might not exist anymore. After all, due to your negligence, the Divine Platform rose and even surpassed the Immortal Court.”<br/><br/>“Your Majesty, after experiencing countless lifetimes of reincarnation, has anyone from the Divine Platform remembered your kindness and come to save you?” he asked.<br/><br/>Upon hearing this, Hong Chen maintained his composure and calmly replied, “Man will triumph over Heaven. The rise of the Divine Platform is due to their own efforts. Even if I had suppressed them early on, it would not have held them back.”<br/><br/>The Fortune and Prosperity Immortal said leisurely, “The Divine Platform’s rise to power during the disaster of the Grand An Divine Dynasty is not to be underestimated. Your Majesty, you know in your heart that it’s the benefits of that supreme treasure that suppressed your wariness of the Divine Platform.”\t\t\t\t\t\t</div>", "images": {}, "success": true}