{"id": 465, "url": "https://www.novelhall.com/i-became-an-immortal-on-mortal-realm-32879/15177814.html", "title": "Chapter 455 - Chapter 455: Chapter 452: Mortal Realm'S Variables, Lingxiao Saint Emperor", "volume": 5, "volume_title": "Volume 5", "body": "<h1>Chapter 455 - Chapter 455: Chapter 452: Mortal Realm'S Variables, Lingxiao Saint Emperor</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 455: Chapter 452: Mortal Realm’s Variables, Lingxiao Saint Emperor<br/><br/>Hearing Fortune and Prosperity Immortal mention the supreme treasure, Hong Chen’s expression remained calm, while the others were still in shock.<br/><br/>The Heaven Emperor?<br/><br/>Xuan Zong was once the Heaven Emperor of The Upper Realm, the lord of all immortals?<br/><br/>After a brief shock, everyone was elated, thinking that with the previous Heaven Emperor, there was no need to fear the current Immortal Court!<br/><br/>Hong Chen said, “Junior Brother, should still state your purpose, with your abilities trying to take down Wangdao, I’m afraid it’s not enough.”<br/><br/>Fortune and Prosperity Immortal chuckled, “Getting my hands dirty by fighting is not suitable for me, Senior Brother, I’m here to assist you, but you have to tell me the location of that treasure.”<br/><br/>Hong Chen narrowed his eyes but didn’t immediately respond.<br/><br/>“You must have had enough of this endless cycle of reincarnation, I can help you shed your mortal body and reconstruct the body of a Heaven Emperor,” the smile on Fortune and Prosperity Immortal’s face never faded, appearing amiable and friendly.<br/><br/>Hong Chen countered, “What can you do for Wangdao?”<br/><br/>Fortune and Prosperity Immortal said, “The Eighteen Divine Pillars might not be a match for the Heavenly Dao, but the Heaven Emperor has already requested a War God to act; the Heavenly Dao that can’t subdue the Eighteen Divine Pillars will not be able to defeat the War God, he is surely doomed. What I can do is to help you survive and help His Majesty return to The Upper Realm.”<br/><br/>Boom——<br/><br/>His words had just finished when the heavens and earth trembled, startling him as well, and he turned his head in astonishment to look.<br/><br/>Hong Chen also looked towards the horizon, his expression turning peculiar.<br/><br/>“How could someone dare to insubordinate and open a gateway between the two realms?” Fortune and Prosperity Immortal frowned deeply and muttered to himself. He tried to calculate with his fingers but couldn’t deduce anything.<br/><br/>Hong Chen was also calculating, but he couldn’t see through it either.<br/><br/>Solitary Life Elder clicked his tongue in wonder, “This Mortal Realm really is full of variables, not just us Dao Masters.”<br/><br/>On the wooden bridge, the Grand An Profound Turtle was glaring at Fortune and Prosperity Immortal, its mung bean-sized eyes filled with hatred and rage.<br/><br/>“If that is all, then you cannot sway me, go back, back to the Immortal Court and wait for the Heavenly Dao to step into Xianxiao Palace!”<br/><br/>Hong Chen turned his gaze back to Fortune and Prosperity Immortal and said so.<br/><br/>Fortune and Prosperity Immortal turned his head too, furrowed his brows, struggling for a moment, and then clenched his teeth, “What do you want?”<br/><br/>Hong Chen asked with a smile that was not quite a smile, “Anything is possible?”<br/><br/>The two of them chatted audaciously, completely disregarding the presence of others around them; every cultivator and demon in Sword Heaven Marsh could hear their conversation clearly.<br/><br/>Fortune and Prosperity Immortal seemed to think of something, his complexion turning ugly, caught in an internal struggle.<br/><br/>…<br/><br/>Boom! Boom! Boom…<br/><br/>Within the dazzling starry sky, Fang Wang moved forward while wielding the Heavenly Palace Halberd, countless Immortal Deities attacked from all directions, but he easily annihilated them with his halberd. However, the number of Immortal Deities was overwhelming, no matter where he flew, they kept coming in an endless stream.<br/><br/>The Mie Jue Divine Tome hovered behind Fang Wang, and between them was the Heavenly Dao Sun, at this moment, there were three Heavenly Dao Suns behind his head, each larger than his head, the surface roiling with Heavenly Dao Qi Flame, which was silver in color.<br/><br/>This was the world within the Heavenly Gate, a Mysterious World constructed from Fate, the variety of rules here was not as many as in the Mortal Realm, but the strength of each rule was incomparably greater than that of the Mortal Realm.<br/><br/>Fang Wang swung his halberd once more, exploding a Star Constellation Deity’s immortal body with one strike, following which, golden chains appeared out of thin air around him, binding him.<br/><br/>Looking around, in each of the eight directions, there was an Immortal Deity with a golden body of ten thousand feet tall pulling at the chains, roaring furiously and pulling with all their might, as if attempting to tear Fang Wang apart, but with a twist of his waist, he broke the chains right away.<br/><br/>Fang Wang punched out, the Nine Dragons Tyrant Fist howling through the starry sky, spanning tens of millions of miles, annihilating countless Immortal Soldiers, moving in wide, open swings, displaying a domineering posture.<br/><br/>High above in the starry sky, beyond the nebula, a white-haired illustrious Immortal Divine drew his bow and loosed arrows, astonishingly firing millions of phoenixes. With a wingspan of hundreds of miles, these phoenixes gathered in an awe-inspiring formation.<br/><br/>Fang Wang turned to face them, the glow of fire reflecting off his body, casting inverse reflections in his cold, piercing eyes.<br/><br/>At that moment, behind Fang Wang rose the Heaven Bound Golden Silk. The Golden Silk Ribbon became unprecedentedly massive and lashed out, exterminating the fire phoenixes one after another, causing the entire starry sky to start exploding in a spectacular and unparalleled display.<br/><br/>Fang Wang charged into the sea of flames, his eyes moving swiftly as he sought out the<br/><br/>restrictions of fate within the Heavenly Gate.<br/><br/>Every treasure must have its most crucial restriction, the source of all its might. The Heavenly Gate was a treasure of fate, and there had to be a restriction connecting it with the fate of the Immortal Court and even the restrictions of the Immortal Divine beings.<br/><br/>Fang Wang quickly fought his way out of the sea of fire, and as soon as he emerged, he was met with the Eighteen Divine Pillars charging at him head-on, and not only the Divine Pillars, but the man with the purple crown from before had also arrived.<br/><br/>“Your Highness, leave him to us!” bellowed the leading Divine Pillar. Regardless of victory or defeat in this battle, the Eighteen Divine Pillars were certain to become a laughingstock, so his anger was particularly intense.<br/><br/>The man with the purple crown used both of his palms to wield various Divine Skills with ease, but unfortunately, they seemed to barely tickle Fang Wang, his mana barely causing the latter any harm.<br/><br/>Suddenly sensing something, Fang Wang’s figure abruptly disappeared, causing the leading Divine Pillar’s Divine Skill to miss entirely.<br/><br/>The Eighteen Divine Pillars quickly turned around but could no longer find Fang Wang.<br/><br/>“What happened? Where did he go?”<br/><br/>“In this World of Fate, there’s no way he could hide!”<br/><br/>“Don’t be careless, it could be some sort of Divine Skill of his, meant to numb our senses!”<br/><br/>“This guy is too hard to kill, why does his Cultivation Technique seem to contain the essence of Purple Qi Immortal Technique?”<br/><br/>The Eighteen Divine Pillars discussed amongst themselves, while the man with the purple crown seemed to realize something and vanished as well.<br/><br/>Meanwhile.<br/><br/>Fang Wang arrived in a vast white Mysterious World, and following his gaze, there stood the Heavenly Gate in the distance.<br/><br/>In this extensive white Mysterious World, the towering Heavenly Gate appeared so small.<br/><br/>Fang Wang didn’t move forward hastily, for he saw a figure standing in front of the Heavenly Gate.<br/><br/>The person stood in front of the gate, back facing Fang Wang, dressed in a wide azure Dao Robe which fluttered without a belt to constrain it, suggesting unstoppable movement. Despite the robe’s size, it could not conceal his powerful physique.<br/><br/>“You have finally arrived.”<br/><br/>The voice of the man in the Dao Robe echoed, ethereal, making it hard to pinpoint the source.<br/><br/>Fang Wang asked, “May I ask for your esteemed name.”<br/><br/>The Dao Robe man slowly turned around, his black hair fluttering. His face was handsome yet weathered with age, and though not as lavishly dressed as the Pillars, he exuded an aura that made Fang Wang extremely uneasy.<br/><br/>He slightly raised his chin, looking down at Fang Wang, and said, “I am known as Lingxiao. You may call me Lingxiao Saint Emperor, or Lingxiao Great Saint.”<br/><br/>Lingxiao Great Saint!<br/><br/>Fang Wang was inwardly shocked. The Lingxiao Divine Sect had greatly aided him, and later on, it even merged to form The Heaven of Carefree Freedom, a Divine Skill of boundless mystery, which made him very curious about the strength of its creator.<br/><br/>Wait a moment!<br/><br/>Suddenly, Fang Wang thought of something, and his eyes revealed a subtle change.<br/><br/>“That’s right, the Lingxiao Divine Sect was deliberately placed before that girl by myself. Knowing her feelings for you, she would naturally impart it to you. Your mastery of it has proven my speculation.” Lingxiao Saint Emperor’s gaze was indifferent, his stature seemingly insignificant yet emanating a presence far surpassing that of the Heavenly Gate.\t\t\t\t\t\t</div>", "images": {}, "success": true}