{"id": 462, "url": "https://www.novelhall.com/i-became-an-immortal-on-mortal-realm-32879/15172600.html", "title": "Chapter 452 - Chapter 452: Chapter 449: The Unstoppable Heavenly Dao, Open The Heavenly Gate!", "volume": 5, "volume_title": "Volume 5", "body": "<h1>Chapter 452 - Chapter 452: Chapter 449: The Unstoppable Heavenly Dao, Open The Heavenly Gate!</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 452: Chapter 449: The Unstoppable Heavenly Dao, Open the Heavenly Gate!<br/><br/>“Form the array! Quick!”<br/><br/>The Great Pillar bellowed as he, along with the other Emperor Saints engaged in fierce battle, shimmered with intense radiance. That was the light of Divine Armors—they activated the prohibitions of their armors and teleported instantly behind the Great Pillar.<br/><br/>After the assembly of the eighteen Divine Pillars, they each raised their hands to cast spells. Their mana swiftly merged together, coalescing into a huge golden phantom image.<br/><br/>It was the exaggerated figure of a War God, wielding a giant axe that could match his stature. Like a slumbering lion raising its head, his presence emitted an immense oppressive force, solidifying the cosmic void.<br/><br/>Underneath his Fox Mask, Fang Wang’s eyes did not change. His right arm tremored, and the grand Heavenly Dao Sun burst forth countless pillars of fire, engulfing the Heavenly Gate with a domineering and unparalleled vigor.<br/><br/>“Die—”<br/><br/>The mysterious War God phantom roared, a shout so fierce that not even Fang Wang’s Celestial Phenomenon could block it. The hearts of all living beings in the Mortal Realm jumped at the sound.<br/><br/>The War God phantom swung his axe with fury, emitting a brilliant golden light as if to cleave the entire universe in two.<br/><br/>The collision of two such formidable powers sent shockwaves rushing out, forcing other Emperor Saints to retreat; even True Venerables had to muster their energy to resist.<br/><br/>“The Eighteen Divine Execution Pillars Array…”<br/><br/>The True Venerable’s face turned pale as he spat out those words, fully aware of the horrifying nature of the formation. What really surprised him was that Fang Wang actually had the strength to withstand it.<br/><br/>Underneath the War God phantom, the eighteen Divine Pillars exerted their full strength to maintain the array, pouring their vast mana into the War God’s phantom, causing it to roar continuously.<br/><br/>With a bang!<br/><br/>Fang Wang’s Celestial Phenomenon shattered, and immediately after, the Firmament of Xuanzu’s World and countless worlds revealed illusions again. The grand spectacle of Fang Wang battling the Eighteen Divine Execution Pillars Array was visible to all creatures.<br/><br/>Before the Heavenly Dao Sun, Fang Wang appeared so majestic and awe-inspiring, his demeanor not at all inferior to the War God’s figure.<br/><br/>The Firmament of Xuanzu’s World was also fluctuating, as if strong winds swept across the lake surface, and waves of heat rained down from the sky, sweeping across the Mortal Realm.<br/><br/>Mountains shattered to pieces, flowers and trees burned to ash!<br/><br/>Streams and rivers dried up at a speed visible to the naked eye!<br/><br/>At that moment, all living beings felt the mighty power of Fang Wang and the eighteen Divine Pillars. In front of such power, cultivators, regardless of their level, felt their own insignificance.<br/><br/>Fang Wang, gripping the Heavenly Palace Halberd, pressed forward. The Heavenly Dao Sun erupted with even more violent flames—those he called the Heavenly Dao True Fire, capable of incinerating everything!<br/><br/>In an instant, the faces of the eighteen Divine Pillars all changed drastically.<br/><br/>It was only after joining hands against Fang Wang they realized how terrifying he was, utterly unfathomable. They had exerted their full strength but were still unable to gauge the depths of Fang Wang.<br/><br/>Stars throughout the universe shattered one after another, turning into dust.<br/><br/>The continent where Xuanzu’s World resided glowed, protecting Xuanzu’s World from most of the pressure.<br/><br/>Fang Wang began to step forward. With each step, the Heavenly Dao Sun suddenly grew larger, simultaneously pushing the eighteen Divine Pillars back, their arms all bending from the pressure.<br/><br/>The Great Pillar clenched his teeth and bellowed, “Open the Heavenly Gate!”<br/><br/>Upon hearing this, the Doom God Pillar instantly turned sideways, raised his palm, and struck towards the Heavenly Gate, his mana turning into a golden rainbow that hit the light curtain of the gate, causing ripples to spread.<br/><br/>An overwhelming aura surged forth, and with a roar, countless Immortal Divines flowed out endlessly. Dense beyond measure, at the same time, the Heavenly Gate trembled violently, its light growing even more dazzling.<br/><br/>Crevices appeared everywhere in the Firmament of Xuanzu’s World, and ranks of Immortal Soldiers emerged from within, looking down upon the Mortal Realm.<br/><br/>The Immortal Divines descended!<br/><br/>Fang Wang’s gaze sharpened, his figure suddenly vanished, and the area where the eighteen Divine Pillars stood exploded. Fang Wang, unstoppable in his momentum, crashed into the formation. The Heavenly Palace Halberd pierced through the chest of a Divine Pillar, golden blood splattering, and his right foot was on another Divine Pillar, whose Divine Armor was shattered by his tyrannical force.<br/><br/>The menacing figure of the War God vanished in an instant.<br/><br/>“How dare you!”<br/><br/>The Great Divine Pillar swung his umbrella to strike, its tassels swaying, and a long sword formed of countless evil spirits swept across, each one baring its fangs and claws, terrifyingly fierce.<br/><br/>Fang Wang materialized the Reincarnation Bell at his side, and with a clang, the myriad evil spirits shattered upon striking the bell and dissipated.<br/><br/>The next second, the world shifted abruptly, transporting Fang Wang to the depths of the sea.<br/><br/>All around the deep sea were various resentful spirits, which, upon catching sight of him, turned around and relentlessly charged towards him.<br/><br/>Fang Wang clenched his fist, the domineering pressure from Nine Dragons Tyrant Fist directly dispersing the Celestial Phenomenon, twisting at the waist, his left fist followed through with a strike.<br/><br/>The roaring of dragons exploded!<br/><br/>Nine Black Dragons burst forth as if breaking free from a cage, frenzied and tyrannical, piercing through the physical body of a Divine Pillar one after another.<br/><br/>“Pff—”<br/><br/>The Divine Pillar spat out golden blood, his face filled with terror.<br/><br/>He felt his Immortal bones shattering, along with an unknown domineering force coursing through his body, wreaking havoc on his viscera, meridians, and bones.<br/><br/>A Divine Goddess Pillar pinched a spell with her right hand, and with her left, she cast magic, sending out rings of light that spread across the stars. Then, massive stars burst forth from within, encircling him with scorching waves of heat as they rushed towards Fang Wang. Their speed was exceptionally fast, and they also contained a strong oppressive force that caused Fang Wang, encircled by them, to stumble.<br/><br/>In Fang Wang’s left hand, the Rainbow Sword materialized, the Light Sword waving to explode thousands of Sword Qi like a storm, crushing the stars from all directions.<br/><br/>The True God of the Heavenly Palace suddenly appeared behind the Divine Goddess Pillar, thrusting the Heavenly Palace Halberd in his hand through her chest and lifting her high.<br/><br/>At the same time, the seven other past-life avatars attacked from different directions, followed closely by the True Venerable and other Emperor Saints.<br/><br/>Fang Wang’s Celestial Phenomenon unfolded once again!<br/><br/>A chaotic battle erupted!<br/><br/>From within the Heavenly Gate, Immortal Divines surged out, and the scope of the battlefield expanded rapidly!<br/><br/>Fang Wang faced off against the Great Divine Pillar once more, wielding his halberd wildly and forcing the latter to retreat, leaving him no chance to employ his Divine Skills.<br/><br/>The Great Divine Pillar’s blood churned violently within him, feeling that if the fight continued, his physical body would inevitably burst.<br/><br/>Suddenly, Fang Wang’s figure flickered, creating thousands upon thousands of clones, which went off to slay the other Immortal Divines. Seeing this sight, the Great Divine Pillar and the other Divine Pillars also exhibited their cloning Divine Skills. Their number of clones was no less than Fang Wang’s, and for a time, every one of Fang Wang’s clones was caught in an outnumbered battle, but even so, Fang Wang remained powerful.<br/><br/>Fang Wang, engaged in combat, suddenly glanced through the distance. His gaze traveled millions of miles, locking onto an Immortal Divine battling with a Great Saint.<br/><br/>Doom God!<br/><br/>The Doom God was enveloped in an aura of misfortune, overwhelming his opponent without giving them any chance to fight back.<br/><br/>He seemed to sense something and instinctively turned his head to look.<br/><br/>Just as he turned, the face of a Fox Mask suddenly appeared before him, causing his eyes to widen in shock as he reflexively attempted to block.<br/><br/>Bang!<br/><br/>Fang Wang punched through the chest of the Doom God, blood flying along his fist, mixed with shattered bones.<br/><br/>The aura of misfortune that shrouded the Doom God was shattered by the blow, his eyes bulging as he spewed inverse blood while bright blood splattered towards Fang Wang’s Fox Mask—evaporating before it could make contact.\t\t\t\t\t\t</div>", "images": {}, "success": true}