{"id": 469, "url": "https://www.novelhall.com/i-became-an-immortal-on-mortal-realm-32879/15187390.html", "title": "Chapter 459 - Chapter 459: Chapter 456: The Legend Of The Celestial Court, The Ambition Of The Saint Emperor", "volume": 5, "volume_title": "Volume 5", "body": "<h1>Chapter 459 - Chapter 459: Chapter 456: The Legend Of The Celestial Court, The Ambition Of The Saint Emperor</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 459: Chapter 456: The Legend of the Celestial Court, The Ambition of the Saint Emperor<br/><br/>In the World of Fate.<br/><br/>Fang Wang held the Heavenly Palace Halberd in his right hand, his body entwined with the Heaven Bound Golden Silk, the other end of which was tied to a disheveled man—it was the purple-crowned man who had previously emerged from the giant scroll.<br/><br/>At this moment, the purple-crowned man was in a wretched state, facing Fang Wang, with his chest pierced by the Dragon Sky Azure Cloud Sword, his physical body on the verge of splitting in two.<br/><br/>The countenance of the Lingxiao Saint Emperor was icy, showing no concern for the purple-crowned man’s plight.<br/><br/>“Saint Emperor! What are you doing! Do you wish to kill me?”<br/><br/>The purple-crowned man roared in pain, his voice also laced with anger.<br/><br/>The Lingxiao Saint Emperor said coldly, “Your Highness, why do you interfere? Could His Majesty believe that with your strength, you too can covet his Heavenly Dao spirit?”<br/><br/>The purple-crowned man was none other than the son of the Heaven Emperor; his name was Zi Weitian.<br/><br/>Zi Weitian gritted his teeth and said, “You already possess the Heavenly Dao spirit, why do you stop me?”<br/><br/>He struggled desperately, unable to free himself from the double bind of the Dragon Sky Azure Cloud Sword and the Heaven Bound Golden Silk, suffering immensely.<br/><br/>“Because you are unworthy.”<br/><br/>The Lingxiao Saint Emperor spoke with contempt. With a twist of his hand, the Dragon Sky Azure Cloud Sword annihilated Zi Weitian in an instant.<br/><br/>Fang Wang watched the scene calmly and only after he felt the life force of Zi Weitian completely dissipate did he finally ask, “You addressed him as Your Highness?”<br/><br/>The Lingxiao Saint Emperor sheathed his sword and said, “His name is Zi Weitian, the seventh son of the Heaven Emperor. His talent is not bad, and he is somewhat my disciple. He has always admired the Heavenly Dao spirit; that’s why he lay dormant before, wanting to seize your body.”<br/><br/>“But how did he know you were the Heavenly Dao spirit?”<br/><br/>The Lingxiao Saint Emperor was somewhat puzzled, and his killing intent quickly receded.<br/><br/>Fang Wang then reigned in his aura and asked, “Aren’t you afraid of the Heaven Emperor’s blame for killing the son of the Heaven Emperor?”<br/><br/>The Lingxiao Saint Emperor replied with disdain, “He is already too busy to care for himself, how could he spare time for his son? Besides, even if he knew, he would not dare to remove my immortal status. The Celestial Court needs War Gods, more and not fewer.”<br/><br/>So it seemed, the situation in The Upper Realm was indeed dire.<br/><br/>No wonder Zhou Xue was always so confident, no matter how big the mess he made.<br/><br/>According to the fate of the past life, the Immortal Court should be able to survive, but now that the Immortal Court had one more enemy like Fang Wang, it was no longer certain.<br/><br/>Fang Wang fell into contemplation. He was not in a hurry to leave because he could sense the presence of Wangdao through the Heavenly Dao. Although Wangdao had suffered casualties, its fate continued to grow, indicating that the situation was still positive.<br/><br/>The Lingxiao Saint Emperor looked toward Fang Wang again and said with a piercing gaze, “Let us join forces. I will be the Heaven Emperor and crown you the second emperor of the Immortal Court, together we shall rule over the Immortal Divine.”<br/><br/>Hearing his invitation, Fang Wang was not surprised.<br/><br/>If Lingxiao Saint Emperor really came under the orders of the Heaven Emperor, why would he need to beat around the bush? He could have simply followed the Eighteen Divine Pillars and attacked him directly.<br/><br/>If Lingxiao Saint Emperor was genuinely sincere, to tell the truth, that indeed was a path. After all, contending against the entire Immortal Court single-handedly, he could only ensure his own safety.<br/><br/>The path of the immortal Fang Wang cultivated was not devoid of sentiment; he not only wanted to protect himself but also those around him.<br/><br/>“Are you confident you can overthrow the current Heaven Emperor?” Fang Wang asked.<br/><br/>The Lingxiao Saint Emperor spoke leisurely, “Before the Immortal Court, there was the Celestial Court, which was the ruling power of the immortals in The Upper Realm. The first Heaven Emperor of the Immortal Court once served as an immortal of the Celestial Court. Later, when the Celestial Court faced calamity and fragmented, the first Heaven Emperor took the opportunity to establish the Immortal Court. Unfortunately, the Immortal Court couldn’t match the pinnacle of the Celestial Court, and has never been able to unify The Upper Realm.”<br/><br/>“`<br/><br/>“Since ancient times, the Immortal Court has been fraught with internal strife. In the hearts of Immortal Divine beings, the Heaven Emperor is not the greatest. As long as someone can defeat the Heaven Emperor, the Immortal Divine beings would naturally abandon their allegiance upon hearing the news.”<br/><br/>Fang Wang’s gaze was calm as he asked, “Can you defeat the Heaven Emperor? He still has three War Gods under his command.”<br/><br/>According to what he knew, the strongest War God was not the Lingxiao Saint Emperor. The Nine-Faced Divine Net was the first War God, and also the Heaven Emperor’s most loyal follower.<br/><br/>When the Immortal Court’s Heaven Emperor overthrew the position of the Red Dust Celestial Emperor, the Nine-Faced Divine Net played a huge role.<br/><br/>The Qi Yun Great Saint once said that as long as the Nine-Faced Divine Net was around, the throne of the Heaven Emperor would not be shaken, nor would the foundation of the Immortal Court be destabilized.<br/><br/>The Qi Yun Great Saint feared the Nine-Faced Divine Net far more than the Heaven Emperor, even thinking it impossible for the Nine-Faced Divine Net to be defeated.<br/><br/>The Lingxiao Saint Emperor said with a smile, “There’s unpredictability in the Mortal Realm just as there is in The Upper Realm. You should have noticed the increasing number of Emperor Saints in the Mortal Realm. In fact, they have all sensed the crisis of the Immortal Court. In The Upper Realm, the Immortal Court has a nemesis by the name of Divine Platform, whose strength is even greater than that of the Immortal Court. By the way, it wasn’t just the Immortal Court that destroyed the Grand An Divine Dynasty; the Divine Platform also exerted a lot of effort, and after that battle, they left many of their pawns in the Mortal Realm.”<br/><br/>“During the reign of the Red Dust Celestial Emperor, the relationship between the Immortal Court and the Divine Platform was tight, until the Immortal Court realized that the Divine Platform intended to seize the rule over the Mortal Realm, which led to their fallout. This is also one of the reasons why the Immortal Court does not tolerate the Emperor Saints from the Mortal Realm, because many of the Emperor Saints rose to power through the inheritance from the Divine Platform.”<br/><br/>The inheritance from the Divine Platform?<br/><br/>This was the first time Fang Wang had heard such insider information.<br/><br/>“Of course, the Immortal Court in itself does not permit the Mortal Realm to slip out of control. It’s just because of the Divine Platform’s interference that the Immortal Court has become even more domineering, preferring to err on the side of killing rather than to let anyone off,” The Lingxiao Saint Emperor said casually when speaking of the Divine Platform.”<br/><br/>Fang Wang seemed to understand and asked, “Are you with the Divine Platform?”<br/><br/>The Lingxiao Saint Emperor shook his head and said, “No, but the Divine Platform also needs to overthrow the Immortal Court. I can collaborate with them, and after we annihilate the Immortal Court together, we can divide the Mortal Realm in half.”<br/><br/>“Do you think the Divine Platform is trustworthy?”<br/><br/>“Whether it’s trustworthy is not important; what matters is to first overthrow the Immortal Court, isn’t it?” the Lingxiao Saint Emperor said with a smile that was not quite a smile.<br/><br/>Fang Wang was silent and did not make an immediate decision.<br/><br/>The Dragon Sky Azure Cloud Sword in the Lingxiao Saint Emperor’s hand dissipated like smoke, and he spread his hands and said, “To show my sincerity, I’m willing to let you destroy the Heavenly Gate.”<br/><br/>Upon hearing this, Fang Wang immediately concentrated into a Town World Bead. The Town World Bead rose from behind his head, rapidly grew in size, and when it stopped, it erupted with tremendous suction force, devouring the Immortal Court’s Destiny here.<br/><br/>The Lingxiao Saint Emperor looked up and admired, “A fine treasure spirit, though not a Heavenly Fate treasure spirit, it is enough to assist one in soaring and pursuing the Great Dao.”<br/><br/>Fang Wang did not let his guard down, vigilant against the Lingxiao Saint Emperor, wary of the possibility of a sudden attack.<br/><br/>The Lingxiao Saint Emperor stood in place, watching Fang Wang with a smile, occasionally expressing his admiration.<br/><br/>As the Town World Bead unleashed a powerful devouring force, the entire World of Fate twisted continuously, producing various auroras, while cracks kept appearing in the distant Heavenly Gate.<br/><br/>Outside in the realm of men and gods, the Immortal Divine beings grew increasingly panicked. They poured their fate into it with all their might, yet they could not prevent the Heavenly Gate from shattering.<br/><br/>At this moment, even the Eighteen Divine Pillars were in a state of panic.<br/><br/>“No, if this continues, the Heavenly Gate will surely be destroyed, and we won’t be able to return!” a Star Constellation stated urgently.<br/><br/>As soon as he spoke, the other Immortal Divine beings started talking, most suggesting retreat.<br/><br/>If the mission failed, they would at most face punishment and could make a comeback thousands of years later, but if they stayed, it would mean the end of their immortal lives and the dissipation of their destinies.<br/><br/>“`\t\t\t\t\t\t</div>", "images": {}, "success": true}