{"id": 460, "url": "https://www.novelhall.com/i-became-an-immortal-on-mortal-realm-32879/15172594.html", "title": "Chapter 450 - Chapter 450: Chapter 447 Heavenly Dao Treads On Heavenly Gate", "volume": 5, "volume_title": "Volume 5", "body": "<h1>Chapter 450 - Chapter 450: Chapter 447 Heavenly Dao Treads On Heavenly Gate</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 450: Chapter 447 Heavenly Dao Treads on Heavenly Gate<br/><br/>“More than one?”<br/><br/>Xiao Zi’s tone was somewhat astonished, and before it could continue to ask, Fang Wang suddenly accelerated, leaving the ground far behind and arriving beneath the dark starry sky.<br/><br/>In the darkness, there was a huge golden gate emanating endless golden light, even more dazzling than the sun behind it, and within the golden gate stood a towering figure.<br/><br/>It was a deity in golden armor, his armor exuding a domineering and martial aura, with a giant halo floating behind his helmet, around which three golden dragons were coiled – a spectacular sight.<br/><br/>Because he stood with his back to the golden gate, his face was shrouded in darkness, but when Fang Wang arrived, his eyes suddenly opened, bursting with brilliant light.<br/><br/>Fang Wang stood, holding the Heavenly Palace Halberd, a distance of ten thousand li away from him.<br/><br/>From the Mortal Realm, one could not see Fang Wang at all, only the imposing figure of the golden-armored deity.<br/><br/>“Are you the one called Tiandao Fang Wang?” the golden-armored deity asked, his voice deep and muffled, like thunder exploding.<br/><br/>Fang Wang’s face remained calm as he said, “If you seek me out, why not announce your name?”<br/><br/>“Hmph, what use is it for a dead man to remember his enemy’s name?”<br/><br/>The golden-armored deity raised his right hand, and mighty mana surged from his palm, condensing into a divine weapon that resembled both a knife and a spear, with a blade like claws, and a hilt covered in golden scales, radiating searing heat.<br/><br/>Fang Wang said no more and flew towards the golden-armored deity.<br/><br/>Soon, he arrived above the sea of clouds where the golden-armored deity was located. From afar, the sea of clouds seemed minuscule, but as he approached, he realized the vastness of the sea of clouds, upon which lay a transparent path that extended into the golden gate, where the golden-armored deity stood.<br/><br/>The universe was dim, with only a few stars shining in the depths; the golden-armored deity and the golden gate behind him were the brightest existences, as if they were the center of the universe.<br/><br/>When Fang Wang landed on the path, the golden-armored deity held his divine weapon aloft, his gaze icy cold.<br/><br/>His eyes focused intently, and he suddenly swung his divine weapon at Fang Wang.<br/><br/>However, as soon as he moved, he was frozen in place.<br/><br/>All over the Mortal Realm, countless beings were looking up at the golden-armored deity, all witnessing him holding his divine weapon aloft, like a supreme deity ready to punish the Mortal Realm, his actions chilling to all, causing unease and anxiety.<br/><br/>Fang Wang, holding the Heavenly Palace Halberd, stepped forward, while the golden-armored deity remained unmoving.<br/><br/>“Young Master, has he also been dragged into the Eighteen Layers of Abi Hell by you?”<br/><br/>Xiao Zi’s voice came from inside the Heavenly Palace Halberd, filled with surprise and delight.<br/><br/>It hadn’t expected that Fang Wang could handle a true deity with such ease.<br/><br/>“Hmm.”<br/><br/>Fang Wang responded casually and continued to advance, utterly dismissive of the golden-armored deity.<br/><br/>This creature was not even as strong as a True Venerable, yet he dared to challenge him!<br/><br/>Nevertheless, Fang Wang could sense that the creature’s karmic ties were incomplete, possibly not even the original being.<br/><br/>He took a step and then flashed forward; after seven steps, he stood before the golden-armored deity and then let go of the Heavenly Palace Halberd with his right hand, which suddenly shot forth.<br/><br/>With a boom!<br/><br/>The golden-armored deity was instantly shattered by the overpowering force of the Heavenly Palace Halberd, and in the eyes of the Mortal Realm’s beings, the towering figure abruptly disappeared, causing even more unrest, as they thought an Immortal Divine had descended.<br/><br/>Fang Wang walked amidst the golden rain, his white clothes fluttering; from the Dragon Jade Ring in his left hand, he retrieved the Fox Mask and put it on.<br/><br/>He didn’t wear the mask to hide his face; it was simply his preference, signifying when he was about to unleash a massacre.<br/><br/>In front of him, the golden gate still stood tall, its height immeasurable, dwarfing even Kunlun in its presence. Within the golden gate, eighteen shadows stood shoulder to shoulder, barely visible.<br/><br/>This was the Heavenly Gate, and those eighteen shadows were likely the Eighteen Divine Pillars!<br/><br/>Xiao Zi couldn’t help but feel nervous upon seeing the Eighteen Divine Pillars; though they lacked the visual impact of the earlier Golden-armored Deity, the sense of oppression they brought to people was incomparable.<br/><br/>Hoo-hoo—<br/><br/>Fang Wang rotated the Heavenly Palace Halberd with one hand, and as he did, a golden chain mail appeared on his body, with the Tianling Body surfacing on his skin, while strands of golden dragon aura coiled around him.<br/><br/>As he advanced, a figure emerged from his body and moved to the side—it was astonishingly the True God of the Heavenly Palace!<br/><br/>It wasn’t just the True God of the Heavenly Palace. Right after, a second and a third figure separated from Fang Wang’s body, one by one—all of them his past lives.<br/><br/>This was a Divine Skill that Fang Wang had created on his own during his years of comprehension!<br/><br/>Eight different versions of Fang Wang appeared, all radiating silver light, their true faces unclear. They all exuded the aura of a Heavenly Dao Mysterious Immortal, enveloping the entire Mortal Realm!<br/><br/>At this moment, not only was Xuanzu’s World affected, but other realms were also feeling his aura.<br/><br/>It seemed as if the heavens and earth resonated with each other; the firmament of all the realms displayed illusions, with sentient beings looking up to see Fang Wang’s figure walking towards the Heavenly Gate no matter which direction they looked from.<br/><br/>Nine Heavenly Daos, each holding a halberd, projected an invincible aura from their silhouettes.<br/><br/>Ahead of the Heavenly Dao, within the massive and sublime Heavenly Gate, the eighteen towering figures were equally magnificent.<br/><br/>“Eighteen Divine Pillars… how could this be…”<br/><br/>Hongxuan Emperor’s eyes widened in disbelief; he never expected that the Immortal Court would fear Fang Wang so much as to dispatch all eighteen at once.<br/><br/>Zhou Xue stared at the illusion in the firmament, lost in thought.<br/><br/>Beside her, Condensation, who was casting a spell, also had his gaze drawn to the spectacle in the sky.<br/><br/>Descending Dragon Continent, Zhui Tian Secret Realm.<br/><br/>The Descending Dragon Great Saint sat by the lake, he and the surrounding lost spirits all looking towards the firmament, seeing Fang Wang’s progression towards the Heavenly Gate.<br/><br/>“Have you already reached this step…”<br/><br/>The Descending Dragon Great Saint murmured to himself, his words filled with gratification and envy.<br/><br/>He knew that Fang Wang had far surpassed his own past.<br/><br/>At that moment, cries of astonishment rose from all over the world. The sight of the Heavenly Dao approaching the Heavenly Gate shocked countless beings, especially the cultivators who aspired to strength, whose blood now boiled with fervor.<br/><br/>Throughout history, those who dared to challenge the Immortal Divine became legendary, mythological figures etched in the annals of history!<br/><br/>They were witnessing the birth of mythological legends!<br/><br/>Fang Wang made his way to the front of the Heavenly Gate, where he was less than a hundred paces from the Eighteen Divine Pillars.<br/><br/>The Eighteen Divine Pillars towered a hundred paces tall. In comparison, Fang Wang and his incarnations seemed small, yet their aura was not the slightest bit weaker.<br/><br/>All beings held their breath in anticipation, waiting for the battle that was about to unfold.<br/><br/>Inside the Heavenly Gate, the light screen pulsed, bursting forth with waves of golden light sweeping across the cosmos.<br/><br/>The Eighteen Divine Pillars made no sound; they moved in unison, stepping out of the light screen and then slowly emerging from the Heavenly Gate.<br/><br/>Among them was the Imperial Heavenly Pillar, his gaze towards Fang Wang filled with complexity, while the other pillars looked at Fang Wang with different expressions.<br/><br/>Leading them was an elder with white hair, his stature broad-shouldered, with golden dragons on either side of his helmet forming two horn-like spikes pointing to the sky. His breastplate was engraved with an indifferent face, gender ambiguous, chilling to behold.<br/><br/>The Great Pillar!<br/><br/>He was the foremost among the Eighteen Divine Pillars, exuding an aura starkly different from the others. With his appearance, it was as if he became the universe’s most dazzling existence. Even Fang Wang couldn’t help but gaze at him.\t\t\t\t\t\t</div>", "images": {}, "success": true}