{"id": 466, "url": "https://www.novelhall.com/i-became-an-immortal-on-mortal-realm-32879/15177815.html", "title": "Chapter 456 - Chapter 456: Chapter 453: Destiny Dao Spirit, Heavenly Dao State", "volume": 5, "volume_title": "Volume 5", "body": "<h1>Chapter 456 - Chapter 456: Chapter 453: Destiny Dao Spirit, Heavenly Dao State</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 456: Chapter 453: Destiny Dao Spirit, Heavenly Dao State<br/><br/>The voice of the Lingxiao Saint Emperor echoed in the World of Fate, lingering for a long time, and Fang Wang’s expression was concealed by the Fox Mask. In the face of the Lingxiao Saint Emperor’s gaze, he seemed not too surprised.<br/><br/>Fang Wang spoke, asking, “Do you have an incarnation in the Mortal Realm, or just a chess piece?”<br/><br/>“Hmph, this seat does not need such flawed methods. To bring ultimate techniques to the mortals, one only needs to manipulate fate,” the Lingxiao Saint Emperor replied indifferently, then he raised his right hand and waved it gently.<br/><br/>In an instant, Fang Wang felt the addition of a mysterious suppressive force to the World of Fate, a force related to the methods of the Lingxiao Divine Sect.<br/><br/>“From now on, you will not be able to use the Lingxiao Divine Sect to leave this world. You may try,” said the Lingxiao Saint Emperor in a tone that never varied from beginning to end.<br/><br/>Fang Wang believed what the Lingxiao Saint Emperor had said, that indeed he couldn’t escape using the Lingxiao Divine Sect, but he could with the Heaven of Carefree Freedom.<br/><br/>He could sense those worlds marked by the Heaven of Carefree Freedom, and his mind could traverse to them in a thought.<br/><br/>However, he wasn’t in a hurry to leave; he wanted to see what the Lingxiao Saint Emperor intended.<br/><br/>If the Lingxiao Saint Emperor wanted to kill him, he would have acted directly. Why say so much?<br/><br/>Fang Wang openly asked, “If that’s the case, should the senior not state his purpose clearly?”<br/><br/>He had learned from the Lingxiao Divine Sect, relying on it to travel through the various mortal realms. He would recognize this grace.<br/><br/>Of course, if the Lingxiao Saint Emperor insisted on killing him, he would not sit still and wait for death.<br/><br/>“Why do you resist the Immortal Divines?” asked the Lingxiao Saint Emperor.<br/><br/>Fang Wang answered, “It’s not me resisting, but rather that they won’t allow me; they want to control everything.”<br/><br/>The Lingxiao Saint Emperor revealed a smile, albeit a strange one, as he pressed on, “If you could overthrow the Immortal Court, what would you do?”<br/><br/>“Why overthrow? I merely need to make them bow their heads. Without the Immortal Court, there will be a Divine Court. What I want to do is survive and continue researching my own path,” Fang Wang answered.<br/><br/>He was speaking his truth; he had never entertained thoughts of power. The reason for establishing Wangdao was only because people close to him highly recommended it. Even after founding Wangdao, Wangdao differed from sects; there weren’t as many rigid rules, and there was no hierarchy and enslavement.<br/><br/>After surviving this calamity, Fang Wang wanted to continue studying the Heavenly Dao and expand his understanding of the Dao.<br/><br/>Eternal life was his pursuit, not dominion over everything.<br/><br/>Upon hearing this, the Lingxiao Saint Emperor’s smile grew wider as he said with a laugh, “To be truly unbound is a path far more difficult than that of rule.”<br/><br/>“First overcome this seat. If you cannot defeat this seat, you have no right to challenge the Heavenly Might.”<br/><br/>His words had barely faded when a terrifying dominance burst forth, plunging the bright World of Fate instantly into darkness. Above, thunderclouds rolled in, with blood-red lightning interweaving, plunging the world into extreme oppression.<br/><br/>The right hand of the Lingxiao Saint Emperor was raised flat, and from the palm of his hand surged green mana, condensing into a halberd with a long handle and three sharp edges, its body black, the tail end burning with green flames like a dragon’s tail swaying.<br/><br/>“This is my Dragon Sky Azure Cloud Sword, just like the halberd in your hands, both are Destiny Dao Spirit. This is our destined fate; even if we die and pass through reincarnation, the Destiny Dao Spirit will still be born, and we can always rise again. Only when facing another being with a Destiny Dao Spirit, will we be utterly extinguished,” said the Lingxiao Saint Emperor.<br/><br/>“We are the favored children of the Great Dao. If we must die, let us die at each other’s hands!” The Lingxiao Saint Emperor grew more and more excited as he spoke, losing his prior composure for a fanatical obsession.<br/><br/>Destiny Dao Spirit?<br/><br/>This was the first time Fang Wang had heard the name of a higher-order spirit treasure. He wasn’t surprised though, as he had already guessed that the Heavenly Palace Halberd was above Dao Origin Spirit Treasures.<br/><br/>“Destiny Dao Spirits, huh? The name sounds good. Are the other three War Gods the same?” Fang Wang asked as he ignited his Heavenly Palace Halberd in hand, ready for battle.<br/><br/>The Lingxiao Saint Emperor said with scorn, “Of course not! In the Immortal Court, other than myself, there was only the Heaven Emperor, but there was another whose Lifespirit Treasure was of mediocre rank, yet possessed the power to turn Qiankun upside down. Unfortunately, you won’t have the chance to meet him.”<br/><br/>Boom!<br/><br/>Lingxiao Saint Emperor took a step and appeared directly in front of Fang Wang.<br/><br/>Lingxiao Divine Sect!<br/><br/>His speed was just too fast. Fang Wang barely managed to raise his halberd in defense, when he felt an unstoppable force strike him, sending him flying backwards.<br/><br/>Before Fang Wang could steady himself, he felt his right leg grabbed; it was Lingxiao Saint Emperor.<br/><br/>Grasping Fang Wang’s leg, a defiant smile appeared on Lingxiao Saint Emperor’s face. With a fierce tug and a swing of his Dragon Sky Azure Cloud Sword, the cold blade, wrapped in chilling green flames, sliced through the air.<br/><br/>Whoosh—<br/><br/>The Dragon Sky Azure Cloud Sword passed directly through Fang Wang’s flesh, and Lingxiao Saint Emperor’s smile instantly froze.<br/><br/>Fang Wang then shifted backwards to create distance, looking towards the astonished Lingxiao Saint Emperor. He twisted his neck and said, “Senior, I’ve returned the favor for those two moves from Lingxiao Divine Sect. From now on, it’s all about true skill to see who the deer falls to!”<br/><br/>Lingxiao Saint Emperor couldn’t help but frown, still puzzled about how Fang Wang had dodged the attack.<br/><br/>The techniques of his Lingxiao Divine Sect did not include such a mystical movement skill!<br/><br/>Fang Wang paid no attention to Lingxiao Saint Emperor’s thoughts. He seldom used the dematerialization technique from the Jiu You Freedom Technique, saving it for situations like this, when facing an enemy who was difficult to defeat. It would be the key to his victory.<br/><br/>One after another, Heavenly Dao Suns condensed behind Fang Wang, followed by the Mie Jue Divine Tome.<br/><br/>The eyes beneath Fang Wang’s mask actually lit up—this was the state he had comprehended over the years of enlightenment combined with the True Combat Technique effect of the Heart of the Heavenly Dao, which he called the Heavenly Dao State.<br/><br/>In the Heavenly Dao state, he could separate instinctive physical movements from the spiritual thoughts of the soul, allowing for instinctive combat while the soul contemplated enlightenment—fighting and enlightening simultaneously.<br/><br/>This was an ultimate state!<br/><br/>Lingxiao Saint Emperor appeared out of nowhere behind Fang Wang, who instinctively dematerialized to avoid his attack and simultaneously appeared behind him, launching a palm strike.<br/><br/>Great Returning Void Palm!<br/><br/>Boom!<br/><br/>Lingxiao Saint Emperor was forced back, and the space between him and Fang Wang turned into nothingness.<br/><br/>Fang Wang was not surprised by Lingxiao Saint Emperor’s techniques; he had fully entered the Heavenly Dao State, free from any distractions.<br/><br/>The real battle was only just beginning!<br/><br/>Lingxiao Saint Emperor rapidly retreated, his Dao Robe billowing. He grinned, showing an excited smile.<br/><br/>“Interesting, you indeed haven’t disappointed me!”<br/><br/>Lingxiao Saint Emperor immediately swung the Dragon Sky Azure Cloud Sword, slashing out one stroke after another. Mysterious runes appeared all around him, which then contracted into his body, covering him in a brilliant light.<br/><br/>…<br/><br/>Above the desolate land, the surface was riddled with holes and cracks, resembling the ruins of a great battle.<br/><br/>Standing barefoot on a piece of broken stone, Yang Du held his right arm high,\t\t\t\t\t\t</div>", "images": {}, "success": true}