{"id": 475, "url": "https://www.novelhall.com/i-became-an-immortal-on-mortal-realm-32879/15193884.html", "title": "Chapter 465 - Chapter 465: Chapter 462: The Fear Of The Hongxuan Emperor", "volume": 5, "volume_title": "Volume 5", "body": "<h1>Chapter 465 - Chapter 465: Chapter 462: The Fear Of The Hongxuan Emperor</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 465: Chapter 462: The Fear of the Hongxuan Emperor<br/><br/>The Heavenly Dao descended upon the mortal realm, spreading golden lotuses far and wide. The entire Mortal Realm basked in burgeoning vitality. This grand cosmic boon lasted a full month and awakened the spiritual intelligence of countless beings, led to breakthroughs for innumerable cultivators, and bestowed enlightenment of the Heavenly Dao on countless mortals, setting them on the path of cultivation.<br/><br/>The disciples of the Fang Residence similarly cherished this opportunity. After Fang Wang descended, the entire Fang Residence quickly sank into silence, soon followed by Southern Hills City, and then Grand Qi. The lands of the Mortal Realm fell quiet in succession.<br/><br/>As the golden lotuses faded, the whole of Xuanzu’s World dimmed when viewed against the cosmic starry sky, no longer bathed in the previous resplendent golden glow.<br/><br/>Zhou Xue slowly opened her eyes, filled with amazement.<br/><br/>“Heavenly Dao, truly remarkable,” she said in a low murmur, excitement tinged in her tone.<br/><br/>After a month of cultivation, she was certain that she was not in an Illusionary Realm; she had indeed been reborn.<br/><br/>But she dared not be certain whether she had returned to the past. With her experience, she was aware of the existence of parallel worlds. Any realm with sentient beings could give rise to parallel worlds with different fates, due to the emergence of forces that could intervene in the past and future.<br/><br/>She was very curious about the origins of this clansman named Fang Wang.<br/><br/>“How about it, what do you think of the Heavenly Dao I’ve created?” Fang Wang’s voice came from behind Zhou Xue, startling her into quickly getting to her feet.<br/><br/>She turned around to face Fang Wang, her expression wary. She subconsciously wanted to speak and ask questions, but Fang Wang instantly appeared before her, a finger hovering in front of her eyes.<br/><br/>Zhou Xue became immobile, her gaze losing its luster.<br/><br/>They stood face to face like that.<br/><br/>Fang Wang stared at Zhou Xue, realizing that he hadn’t looked at her this closely in a long time, or perhaps, he never had.<br/><br/>In Fang Wang’s life, Zhou Xue hadn’t accompanied him for long, but unbeknownst to him, Zhou Xue had become the most important person to him.<br/><br/>This feeling was subtle; calling it love didn’t seem quite right, yet he felt it resembled a rivalry. He simply did not want to be weaker than Zhou Xue.<br/><br/>Fang Wang didn’t dwell on his emotions for long. Soon, he began examining Zhou Xue’s karmic ties.<br/><br/>He believed that karmic ties were the aspect of the Great Dao with the greatest impact on beings.<br/><br/>Zhou Xue’s karmic ties were exceedingly complex, multifaceted, with a certain karmic force so deeply hidden it transcended the Mortal Realm and space and time.<br/><br/>Fang Wang wanted to track this kind of karmic force but found it extremely difficult. Once it reached a certain height, an invisible force would block him.<br/><br/>He suspected that height was The Upper Realm.<br/><br/>Time swiftly passed by.<br/><br/>As dusk approached, the vitality returned to Zhou Xue’s eyes. She no longer appeared lost as before, but rather profound.<br/><br/>Gradually, Fang Wang’s figure was reflected in her pupils.<br/><br/>Their eyes met, a complex expression on Zhou Xue’s face, while Fang Wang showed a smile.<br/><br/>“Do you understand now?” Fang Wang whispered, having just passed on all of his and Zhou Xue’s memories to her, allowing her to understand the relationship they had shared in her previous life.<br/><br/>Since their past interactions were not many, the memories weren’t too vast. In less than three hours, Zhou Xue fully assimilated them, as if she had lived them once again.<br/><br/>Zhou Xue drew a deep breath and said, “If this isn’t an illusion you’ve conjured, then indeed, we share a profound connection.”<br/><br/>Fang Wang laughed, “I would need to understand a lot more to create such memories. Do you think the you in those memories is very different from yourself?”<br/><br/>Zhou Xue couldn’t help but ask, “In that case, how did you reverse time and space?”<br/><br/>“Have you ever heard of the Nine Lives Nirvana Sword Technique?” Fang Wang inquired.<br/><br/>Zhou Xue frowned, deep in thought; after a while, she finally shook her head.<br/><br/>Fang Wang chuckled, “Alright then, go ahead and enjoy the rebirth that’s yours.”<br/><br/>Having said that, he turned and left, vanishing in a single step into the courtyard.<br/><br/>Zhou Xue stood still, her furrowed brows unable to relax as she needed to sort out many things.<br/><br/>Especially her plan for revenge.<br/><br/>“What exactly are you trying to tell me…” Zhou Xue mumbled to herself before suddenly stopping.<br/><br/>Now, she wasn’t as powerful as she was in her past life and couldn’t afford to overlook the weakness of her senses and talk to herself aloud.<br/><br/>…<br/><br/>In the Emperor Sea, vast mist swirled around Emperor’s Tomb Island, which resembled a giant hand with its palm facing upward.<br/><br/>Within the valleys of the island, The Three Immortals of the Emperor Sea sat cross-legged on three massive rocks, with a dilapidated formation platform between them.<br/><br/>At this moment, The Three Immortals of the Emperor Sea appeared to be dozing, each with their heads lowered.<br/><br/>Suddenly, a gust of wind blew, startling all three to look up simultaneously, but they saw nothing.<br/><br/>“What happened? Did I sleep through it?”<br/><br/>“Perhaps, there’s nothing there. Let’s continue sleeping. Who knows, we might see that Heavenly Dao Immortal in our dreams.”<br/><br/>“Dreams that span thousands of autumns, dream on, for who knows when we will no longer be able to dream.”<br/><br/>Muttering to themselves, The Three Immortals of the Emperor Sea once again hung their heads.<br/><br/>At the same time, within an illusionary realm, the scene within the valley of Emperor’s Tomb Island remained, only now there was no mist and the light was bright.<br/><br/>A golden-haired monkey clung to the cliffside, its eyes wide as it stared at a figure on the ground and then rubbed its eyes with another paw as if it couldn’t believe what it was seeing.<br/><br/>That figure was none other than Fang Wang.<br/><br/>“Why is it you? How did you get here? Why did I not notice at all?” the golden-haired monkey asked with a voice as aged as time, the voice of the Hongxuan Emperor.<br/><br/>Fang Wang asked in return, “Tell me, how many times have I been here?”<br/><br/>The golden-haired monkey replied instinctively, “The ninth time… Wait! How do you know it’s not your first time here?”<br/><br/>It looked utterly bewildered before leaping down from the cliff.<br/><br/>It approached Fang Wang, circling him intently as if trying to see right through him.<br/><br/>Fang Wang’s face revealed a smile, but it was one tinged with indifference, sending a chill down the golden-haired monkey’s spine.<br/><br/>“What can you, who drifts through time and space beyond the cycle of reincarnation, see in me?” Fang Wang asked again.<br/><br/>Upon hearing this, the golden-haired monkey’s eyes widened, and it quickly hopped away, putting some distance between them.<br/><br/>“What’s going on? Why can’t I see through you at all? Who exactly are you?” the golden-haired monkey asked in terror, its fur standing on end.<br/><br/>In response to that, Fang Wang countered with a question of his own, “Hongxuan Emperor, have you ever caused an uproar in The Upper Realm or fought with the Nine-Faced Divine Net and the Wrathful God Luo?”<br/><br/>Hearing this, the golden-haired monkey’s expression darkened instantly, and a horrifying and dreadful aura began to emanate from its entire being, its eyes alight with danger.<br/><br/>It stared intently at Fang Wang as the entire valley began to tremble.<br/><br/>With an expressionless face, Fang Wang said, “I am their enemy as well, but if you intend to act rashly, I won’t be so accommodating.”<br/><br/>As the sound of his voice faded, the illusionary realm suddenly shifted, transforming into a gloomy environment where flickering fires and thunderous roars interspersed in the distance.<br/><br/>Fang Wang and the golden-haired monkey appeared above a sea of clouds, with an expanse of palatial cloud-sea palaces burning fiercely behind the monkey, stretching as far as the eye could see.<br/><br/>“Is this what you fear the most?” Fang Wang asked, surveying his surroundings.<br/><br/>The golden-haired monkey did not turn back. It kept its gaze fixed on Fang Wang and said slowly, “The Nine Lives Nirvana Sword Technique!”\t\t\t\t\t\t</div>", "images": {}, "success": true}