{"id": 478, "url": "https://www.novelhall.com/i-became-an-immortal-on-mortal-realm-32879/15195910.html", "title": "Chapter 468 - Chapter 468: Chapter 465: A Higher Realm", "volume": 5, "volume_title": "Volume 5", "body": "<h1>Chapter 468 - Chapter 468: Chapter 465: A Higher Realm</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 468: Chapter 465: A Higher Realm<br/><br/>“`<br/><br/>Watching the leaves fall to the ground, Fang Wang’s Dao heart also stirred, and a sharp light flickered in his eyes.<br/><br/>He finally had a rough idea of the realm of the Heavenly Dao Mysterious Immortal!<br/><br/>Before his rebirth, he had not expected this progress to be so swift—he discussed the Dao with the Sword Saint, an experience comparable to the enlightenment he gained from the four major rules when he crossed time and space in his rebirth.<br/><br/>This feeling was truly wonderful, and it made him look forward to the Sword Saint’s future even more.<br/><br/>In this life, with the help of the Heavenly Dao, the Sword Saint was destined to go further.<br/><br/>Fang Wang had already passed on the Heavenly Dao Myriad Classic of Laws to the Sword Saint, the rest was up to the Sword Saint’s own efforts.<br/><br/>Living again, Fang Wang had no patience to walk his previous life’s path—he wanted to directly comprehend the Dao, quickly become stronger, and possess the power to disregard the Immortal Court before the Heavenly Gate opened.<br/><br/>Fang Wang began to cultivate, envisioning a higher realm while sensing the higher-level rules of the world.<br/><br/>The power of the Great Dao!<br/><br/>…<br/><br/>Above the beautiful sea of clouds stood a huge Golden Stele, with an elderly white-haired Immortal in front of it, his eyebrows tightly knit as he continuously calculated.<br/><br/>Following his gaze, one could see dense symbols on the Golden Stele moving rapidly, making the entire stele seem as if it were twisting, dazzling onlookers.<br/><br/>“What is happening… How can the heavenly secrets be so chaotically disturbed?”<br/><br/>The white-haired old Immortal muttered to himself, his tone full of unease—it was his first encounter with such a situation.<br/><br/>At that moment, a figure appeared behind him, none other than Fortune and Prosperity Immortal, who had previously wanted to collaborate with Hong Chen.<br/><br/>Fortune and Prosperity Immortal stood behind the white-haired Immortal, his gaze also on the Golden Stele, his brows just as tightly furrowed and his eyes filled with disbelief.<br/><br/>The white-haired Immortal turned to look, saw Fortune and Prosperity Immortal, and immediately raised his hand in salute, asking, “Dare I ask Immortal Monarch, can you discern these changes?”<br/><br/>Fortune and Prosperity Immortal took a deep breath and said, “The Nine Lives Nirvana Sword Technique has finally been practiced to Great Completion by someone, and they have even reached the extreme of the ninth reincarnation.”<br/><br/>“Nine Lives Nirvana Sword Technique? Isn’t that His Majesty’s Divine Skill? Could it be that His Majesty has been reborn?” the white-haired Immortal asked in surprise.<br/><br/>Fortune and Prosperity Immortal shook his head and said, “No, His Majesty also received the Nine Lives Nirvana Sword Technique from someone else. Throughout the Three Realms, there has always been a mysterious existence spreading the Nine Lives Nirvana Sword Technique, causing constant rebirths and making the lifespans of Mortal Realm increasingly complex, even leading to many powerful beings from the Immortal Realm descending to experience rebirth. However, the rebirth of the Nine Lives Nirvana Sword Technique is traceable—once reborn, one’s cultivation will reset, which is a risky choice for cultivators of high realms.”<br/><br/>“But this person is different, his rebirth is not predictable, untraceable. I fear even His Majesty has not reached such a level, and since His Majesty has only been reborn five times and has reached the pinnacle, he would not be reborn again. The drawbacks of rebirth are too many; it’s only suitable for situations where catastrophe is inescapable.”<br/><br/>The white-haired Immortal fell silent.<br/><br/>Fortune and Prosperity Immortal sighed, “This person may be able to affect the elusive Great Dao. His rebirth must be for an unavoidable reason, most likely vengeance. Now, the Immortal Realm’s calamity is coming. I just hope that this enmity does not arise from the Immortal Court.”<br/><br/>The white-haired Immortal immediately saluted, “I must go to see His Majesty!”<br/><br/>With that, he disappeared into thin air.<br/><br/>Fortune and Prosperity Immortal took five steps forward, continuing to stare at the Golden Stele and murmured to himself: “Absolute Emperor, what exactly are you planning?”<br/><br/>…<br/><br/>Spring passed and autumn came, another twenty years went by.<br/><br/>On this day, Gu Tianxiong arrived at Sword Heaven Marsh, standing by the lake, looking toward the majestic mountains to the south, his face filled with astonishment.<br/><br/>Inside Sword Heaven Marsh, many Cultivators had already stopped to stay, and like him, many were looking at the distant mountain range.<br/><br/>“`<br/><br/>“Brother, is this your first time coming to Sword Heaven Marsh?” a voice came from beside, interrupting Gu Tianxiong’s thoughts.<br/><br/>Gu Tianxiong turned his head and saw a male cultivator with an extraordinarily handsome face that even a well-traveled man like him found stunning in both appearance and aura.<br/><br/>Such a man existed in the world.<br/><br/>It was indeed Fang Wang.<br/><br/>Gu Tianxiong replied with a smile, “That’s right, I have admired the Sword Saint for many years and wanted to see this place, and now that Sword Saint and Immortal Fang Wang are creating the Wangdao together and planning to construct Kunlun here at Sword Heaven Marsh, I naturally had to come and take a look.”<br/><br/>Fang Wang also had a smile on his face as he began to chat casually with Gu Tianxiong.<br/><br/>Not only had Gu Tianxiong come out of admiration, but other cultivators as well, compared to his previous life, the Sword Heaven Marsh in this era had become even more bustling, and the spiritual energy in this area was extremely abundant, already the best within Grand Qi Cultivation Realm.<br/><br/>In just twenty years, Kunlun had reached the heights that had taken two hundred years to build in his former life, not only because of the efforts of the Tiangong Sect but also because Fang Wang used his clone to help with the construction of Kunlun.<br/><br/>Fang Wang’s goal was to complete the Kunlun he envisioned within three hundred years.<br/><br/>With his identity as a Heavenly Dao Immortal, many things didn’t require much talking; just like when he sought out the Tiangong Sect, they agreed outright. In his former life, only the Qiao Clan was willing to pay the price, but this time, the entire Tiangong Sect was willing to lend their full support.<br/><br/>Fang Wang had also found Hong Chen and Dugu Wenhun. Although Wangdao had yet to recruit widely, the foundational framework had already been established.<br/><br/>As for Zhou Xue, she still founded the Jin Xiao Sect, but unlike her previous life, the Jin Xiao Sect was very low-key. It seemed Zhou Xue had a new plan, but Fang Wang didn’t inquire further.<br/><br/>It only took a few words for Fang Wang to become more acquainted with Gu Tianxiong. Just like in his previous life, Gu Tianxiong started bragging more and more impressively and even talked about various romantic affairs.<br/><br/>When a Green Snake appeared behind Fang Wang, he mentioned how a dear friend of his was adept at handling snakes, annoying Xiao Zi to the point of wanting to kill him.<br/><br/>Half an hour later.<br/><br/>Fang Wang stood on a section of the mountains in Kunlun, at the edge of a cliff. He manifested the Heavenly Palace Halberd, and then the purple dragon patterns on the Heavenly Palace Halberd emerged, forming into the figure of Xiao Zi.<br/><br/>Xiao Zi couldn’t help but complain, “That guy is still so frivolous. Young Master, must you really involve him?”<br/><br/>The Green Snake on Fang Wang’s shoulder nodded in agreement.<br/><br/>Now there were two Xiao Zis.<br/><br/>The Xiao Zi from his former life, by virtue of residing in the Heavenly Palace Halberd, had managed to be reborn alongside Fang Wang, while the Green Snake was brought back by Fang Wang from the Great Saint’s Grotto-Heaven.<br/><br/>The two Xiao Zis had even squabbled for a while, but in the end, Xiao Zi, with her True Dragon physique, subdued the Green Snake Xiao Zi.<br/><br/>“Then why must I find you?” Fang Wang retorted, leaving Xiao Zi at a loss for words.<br/><br/>Finding this life’s Xiao Zi in the Great Saint’s Grotto-Heaven was at the True Dragon Xiao Zi’s request.<br/><br/>Fang Wang paid no more attention to them, facing the vast ocean in the distance, he began to meditate, ready to reach even higher realms.<br/><br/>Xiao Zi then turned to the Green Snake and said, “You’ll be called Zi Ling from now on.”<br/><br/>The Green Snake tilted its head and asked, “Why?”<br/><br/>“No reason, but if you don’t take this name, you’ll lose the chance of becoming a dragon ever again.”<br/><br/>“No, then I’ll be called Zi Ling!”<br/><br/>The dragon and the snake chatted behind Fang Wang. While Fang Wang cultivated, Xiao Zi began to teach Zi Ling how to cultivate as well.<br/><br/>The sun set in the west, and the sunlight stretched their shadows long.\t\t\t\t\t\t</div>", "images": {}, "success": true}