{"id": 479, "url": "https://www.novelhall.com/i-became-an-immortal-on-mortal-realm-32879/15199398.html", "title": "Chapter 469 - Chapter 469: Chapter 466: Making Heaven And Earth Quiet", "volume": 5, "volume_title": "Volume 5", "body": "<h1>Chapter 469 - Chapter 469: Chapter 466: Making Heaven And Earth Quiet</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 469: Chapter 466: Making Heaven and Earth Quiet<br/><br/>In the mysterious and gloomy great hall, the Sect Master of Heaven’s Larceny Saint Sect, Wen Li, sat on the throne with a sullen expression, his eyes full of rage.<br/><br/>Before him, a mass of black qi surged, within which an eye emerged.<br/><br/>“Why? Weren’t you supposed to be resurrected? Why did you suddenly stop me?” Wen Li asked in a heavy voice.<br/><br/>From within the black qi, a voice replied, “The situation has changed. The Descending Dragon Continent is not suitable for our actions. The being who established the Heavenly Dao is no ordinary entity; his Heavenly Dao is on par with the Saint Dao, the Imperial Dao, and it’s impossible to gauge the extent of his cultivation.”<br/><br/>It was none other than the Thousand Eyes Great Saint!<br/><br/>Wen Li’s face fluctuated between light and shadow, his hands tightly gripping the armrests.<br/><br/>The Thousand Eyes Great Saint spoke faintly, “I suggest you go to Kunlun in person to understand the situation, what kind of Dao the Heavenly Dao truly is, and what kind of person he is.”<br/><br/>Wen Li strove to calm his emotions. Despite his reluctance, he truly didn’t dare to act rashly.<br/><br/>“Tiandao Fangwang…”<br/><br/>Wen Li muttered to himself, seemingly seeking to etch this name into the depths of his own heart.<br/><br/>…<br/><br/>Kunlun grew taller with each passing day, getting help from the entire Tiangong Sect, as well as assistance from the Grand Yu Divine Dynasty and the clones of Fang Wang, which made its construction far faster than in his previous life.<br/><br/>Emperor Donggong was still in his prime and could live for several hundred more years. If he didn’t help Fang Wang exterminate the Saint Clans, it was even possible that he could live until the Heavenly Gate opened wide.<br/><br/>The situation in this life was completely different from the last one.<br/><br/>Using the Xuan Yuan Divine Transformation, Fang Wang created dozens of clones to make contact with the people from his past life. He didn’t explain that he had been reborn. Guiding his old friends in cultivation as an immortal of the Heavenly Dao, he easily forged good relations.<br/><br/>Meanwhile, his true self did not retread the path of his previous life but stayed in Kunlun to comprehend the Dao.<br/><br/>As the seasons passed, in the blink of an eye, Fang Wang had surpassed the age of seventy.<br/><br/>The Way of Hope officially began recruiting disciples, causing Sword Heaven Marsh to be teeming with people, and the entire Descending Dragon Continent became bustling. More and more cultivators and sects flooded into the Descending Dragon Continent, squeezing the living space of the native sects. Some seized the chance to cause chaos and were exterminated by the Disciples of the Way of Hope, while other sects acted recklessly and were suppressed by the Divine Sect of the Way of Hope.<br/><br/>From then on, peace reigned over the Descending Dragon Continent.<br/><br/>Sword Heaven Marsh, by the lake.<br/><br/>A man in black walked to the lakeside, looking at the sword cultivators standing on the lake, with a complex expression on his face.<br/><br/>He was in fact the Sect Master of Heaven’s Larceny Saint Sect, Wen Li.<br/><br/>“Kunlun…”<br/><br/>Wen Li muttered to himself, his tone carrying an indistinct and unclear meaning.<br/><br/>“Fellow Daoist, would you like to join the Way of Hope?” A voice came from beside him, and a man dressed in luxurious yellow robes strolled over.<br/><br/>It was Lu Yuanjun, the foremost genius from the Great Abyss Gate.<br/><br/>Wen Li glanced at Lu Yuanjun but ignored him, not caring about someone who hadn’t even reached the Condensation Spirit Realm.<br/><br/>Lu Yuanjun, on the other hand, didn’t mind his coldness at all and approached warmly, saying, “Now that the Way of Hope has just been established, there are only the Xuan Zong, Divine Sect, Buddhist Sect, and Sword Sect. I perceive that fellow Daoist has an extraordinary temperament; why not join our Xuan Zong? Xuan Zong, Dao Sect are under the Red Dust Celestial Emperor; do you know of the Heaven Emperor? He is the Master of Immortals Divines in The Upper Realm and is now cultivating in the Mortal Realm…”<br/><br/>He spoke incessantly with excessive enthusiasm, but somehow, Wen Li found it hard to feel annoyed looking at his smiling face.<br/><br/>Heaven Emperor?<br/><br/>Wen Li became interested in the Xuan Zong and thus continued to listen, occasionally asking questions. Lu Yuanjun was genial, and his manner of speaking gave off a refreshing feeling like a breath of spring air.<br/><br/>Not just them, cultivators from all directions came, and regardless of who they were or how high their cultivation was, newcomers received a warm welcome from the disciples of the Way of Hope.<br/><br/>However, entering the Way of Hope is not so simple. Even with a recommendation from a disciple of the Way of Hope, one must still undergo an investigation by the Xuan Zong.<br/><br/>As Wen Li grew increasingly interested in the Way of Hope, Fang Wang and the Sword Saint were discussing the Dao atop Kunlun.<br/><br/>The master and disciple sat under an old tree halfway up the mountain, playing chess and discussing the Dao, speaking of the ways of heaven and earth, and debating the past and future.<br/><br/>Around Fang Wang emanated a faint silver glow, while the Sword Saint was surrounded by Sword Intent, resembling a swarm of tiny sword shadows spiraling around him, which at first glance, appeared like tornados swirling around his body.<br/><br/>“The sword is heaven, the sword is earth, the sword is all things. The sword resides in the past, the sword exists in the present, the sword will be in the future. Where the heart lies, there the sword exists.”<br/><br/>“The way of the Heavenly Dao is the way of heaven and earth. Heaven and earth represent all things, and all things represent everything. Gathering the past, present, and future, stepping outside the bounds of heaven and earth to establish the true Heavenly Dao, that can be considered the Great Dao.”<br/><br/>The Sword Saint and Fang Wang exchanged words, one after another, as if they were in a question-and-answer session, yet it also sounded like they were each speaking to themselves.<br/><br/>Suddenly.<br/><br/>The two of them stopped, Fang Wang closed his eyes, and in an instant, the silver light around his body surged. Countless tiny stars adorned it, and a figure flew out from within, rapidly increasing in size and landing behind Fang Wang.<br/><br/>The Sword Saint looked at this scene with a smile. He seemed not at all surprised.<br/><br/>Then, a second and third figure flew out from the silver light surrounding Fang Wang, all standing behind him, identical in form to him.<br/><br/>Zi Ling in the tree saw this and was so shocked that it opened its snake mouth wide.<br/><br/>Rumble—<br/><br/>A thunderous sound suddenly filled the firmament, as thunderclouds surged from all directions, oppressively dense, startling countless creatures to look up.<br/><br/>“Be quiet.”<br/><br/>Fang Wang suddenly said. As his voice fell, the clouds in the sky swiftly dispersed. They arrived quickly and departed even faster, brightening the once dim heaven and earth again. Zi Ling was utterly dumbfounded by this spectacle.<br/><br/>The Sword Saint’s smile froze, but only for a few breaths. He remarked in admiration, “Already surpassing Heavenly Might, remarkable.”<br/><br/>Fang Wang did not open his eyes, continuing to comprehend the Dao as more figures emerged from the silver light and took their places around him.<br/><br/>After the time it takes to burn a stick of incense.<br/><br/>The mountainside was filled with figures of Fang Wang, these silver figures enigmatic, their true appearances unfathomable. Some cultivators from the Tiangong Sect and Wangdao Cultivators in the distance were also startled, but none dared to come closer, fearing they would disturb the cultivation of the Heavenly Dao.<br/><br/>Just then!<br/><br/>No sooner had the thunderclouds dispersed than a domineering, unparalleled pressure blanketed the Mortal Realm.<br/><br/>“Hmph! Who dares to violate the heaven and earth of the Mortal Realm!”<br/><br/>All beings who heard this voice were greatly shaken, quailing with fear.<br/><br/>The Sword Saint also frowned, for this was the first time he felt such a terrifying pressure, and moreover, the source had already locked onto Kunlun.<br/><br/>Fang Wang slowly raised his right hand, extending his index finger toward a certain direction. One of the figures behind him leapt up and flew in that direction, disappearing into the far end of the firmament in the blink of an eye.<br/><br/>“What realm is that person in?” the Sword Saint could not help but ask, his understanding of the ways of heaven and earth profound, but he was, after all, just a minor cultivator of the Mortal Realm, unaware of all its realms.<br/><br/>Fang Wang, eyes still closed, answered, “The realm of a Great Saint, coming to take my Fate in hopes to reconsolidate his true body.”<br/><br/>Great Saint!<br/><br/>The Sword Saint frowned and asked, “Descending Dragon Great Saint?”<br/><br/>“Not so, from ancient times to the present, there have been many Great Saints and Great Emperors; who it is no longer matters.” Fang Wang answered indifferently, showing no concern for the Great Saint.\t\t\t\t\t\t</div>", "images": {}, "success": true}