{"id": 472, "url": "https://www.novelhall.com/i-became-an-immortal-on-mortal-realm-32879/15189713.html", "title": "Chapter 462 - Chapter 462: Chapter 459: The Fourth True Power, Twisting Time And Space", "volume": 5, "volume_title": "Volume 5", "body": "<h1>Chapter 462 - Chapter 462: Chapter 459: The Fourth True Power, Twisting Time And Space</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 462: Chapter 459: The Fourth True Power, Twisting Time and Space<br/><br/>Facing the reminder of the Lingxiao Saint Emperor, Fang Wang acted as if he hadn’t heard, his gaze calmly fixed on the figures of the Nine-Faced Divine Net and the Wrathful God Luo.<br/><br/>Separated by the Heavenly Gate’s light screen, Fang Wang and the two War Gods seemed worlds apart.<br/><br/>The Town World Bead hovered behind Fang Wang, trembling violently, as if it might go out of control at any moment.<br/><br/>The Nine-Faced Divine Net and the Wrathful God Luo discussed the Jiu You Freedom Technique among themselves, utterly unconcerned with the possibility of Fang Wang escaping.<br/><br/>Seeing that Fang Wang stood in place, showing no intent to flee, the Lingxiao Saint Emperor became incredibly anxious.<br/><br/>“Alright, time to get down to business,”<br/><br/>The voice of the Nine-Faced Divine Net sounded, and as his words fell, he stepped toward the light screen of the Heavenly Gate, his figure growing larger.<br/><br/>When his right foot stepped out of the light screen, it was as if invisible ripples spread across the surface of a quiet lake.<br/><br/>With that single step, the entire cosmic starry sky froze momentarily, then plunged into a brightness as sudden as daylight.<br/><br/>Fang Wang was engulfed in the intense light, his figure not shifting an inch, while the Lingxiao Saint Emperor gritted his teeth and then disappeared into the starry sky.<br/><br/>“How long can you last relying solely on the Jiu You Freedom Technique? Why not try to escape this realm?”<br/><br/>The voice of the Nine-Faced Divine Net passed through the Heavenly Gate, indifferent in tone.<br/><br/>He stepped out of the Heavenly Gate, but the entire starry sky was immersed in the strong light, so even as he emerged, his figure remained unseen.<br/><br/>Fang Wang was already in an ethereal state, but he found that his Heavenly Dao Force was depleting rapidly, much faster than when he had used the Jiu You Freedom Technique to dodge attacks before.<br/><br/>Fang Wang did not immediately leap out of this realm; instead, he walked step by step forward.<br/><br/>In the midst of the intense light, his figure became blurred.<br/><br/>He walked toward the Nine-Faced Divine Net, who, in turn, stopped in his tracks.<br/><br/>Behind him, the Wrathful God Luo stepped forward, standing shoulder to shoulder with the Nine-Faced Divine Net. The oppressive and unmatched aura of the two Divine Nets bore down on everything, turning all within the starry sky to nothingness, leaving only the distant Xuanzu’s World unaffected, with all other celestial bodies vanishing from the universe.<br/><br/>Fang Wang, relying on the ethereal state granted by the Jiu You Freedom Technique, evaded the domineering suppression of the two gods’ auras.<br/><br/>He walked all the way to the front of the two Divine Nets, yet his steps did not halt.<br/><br/>As Fang Wang passed between the two Divine Nets, they both raised their hands, aiming at his shoulders.<br/><br/>The hands of the Nine-Faced Divine Net and the Wrathful God Luo swept past Fang Wang’s shoulders, grasping at empty air, and suddenly, the Wrathful God Luo turned around, launching a palm strike.<br/><br/>Fang Wang seemed to sense it and vanished into thin air, causing the Wrathful God Luo’s right palm to swipe at nothing once more.<br/><br/>The Wrathful God Luo was not enraged; instead, he marveled, “What incredible speed; his Jiu You Freedom Technique has reached a transformative level. We have never encountered such mastery of the Jiu You Freedom Technique.”<br/><br/>The Nine-Faced Divine Net then turned to the side, his tone indifferent, “He’s in another Mortal Realm. You go and capture him. I shall wait here.”<br/><br/>The Wrathful God Luo did not refuse, diving into the Heavenly Gate and vanishing from sight.<br/><br/>The Nine-Faced Divine Net turned his head, looking far off towards Xuanzu’s World, and began walking toward it.<br/><br/>“Supreme Saint, it is time for you to come out and fight. You are the reason for my arrival,”<br/><br/>The voice of the Nine-Faced Divine Net resonated throughout the entire universe, with an authoritative tone that brooked no doubt.<br/><br/>…<br/><br/>The Descending Dragon Continent, Zhui Tian Secret Realm.<br/><br/>The Descending Dragon Great Saint stood by the lake, looking up at the Firmament with a grave expression. Behind him, the specters were all terrified as they looked up at the Firmament, which reflected the terrifying figure of the Nine-Faced Divine Net.<br/><br/>“Still failed, huh…”<br/><br/>Descending Dragon Great Saint murmured to himself, his face filled with regret.<br/><br/>He felt sorry for Fang Wang. Fang Wang’s strength had already surpassed his past self, but Fang Wang’s opponents were also far beyond his own.<br/><br/>It was as if failure was the fate of the Mortal Realm, and despair was the ultimate color of mortal life.<br/><br/>Just then, a figure suddenly appeared beside the Descending Dragon Great Saint.<br/><br/>It was Fang Wang.<br/><br/>Descending Dragon Great Saint instinctively glanced at Fang Wang, his pupils dilating involuntarily as he asked, “How did you…”<br/><br/>Fang Wang removed the Fox Mask and said, “I went to another Mortal Realm and have come back.”<br/><br/>His expression was as calm as still water, showing no joy or sorrow.<br/><br/>For ordinary people, this catastrophe had only lasted for decades, but Fang Wang had lived through eight hundred and eighty thousand years. Eight hundred and eighty thousand years were enough to grind away all emotions.<br/><br/>Now, looking at the plight of Xuanzu’s World, Fang Wang’s heart did not feel the slightest ripple.<br/><br/>Even when facing the Nine-Faced Divine Net and the Wrathful God Luo, which he temporarily couldn’t overcome, he harbored no fear or hatred, but instead fell into an unprecedented state of calm.<br/><br/>He had made up his mind.<br/><br/>Descending Dragon Great Saint looked at Fang Wang and sighed, “You did your best. Since you possess an ability that even Immortal Divine cannot track, why bother staying? The Upper Realm is vast; there must be a place for you.”<br/><br/>Fang Wang looked toward the lake surface and asked, “Master, why did you want to create the Three Great True Cultivations back then?”<br/><br/>Descending Dragon Great Saint paused, puzzled, but still answered, “I just wanted to walk a path unlike any before. Actually, I had the idea for a fourth True Cultivation Technique, but unfortunately, I didn’t get a chance to create it before I met my demise.”<br/><br/>“Oh? What kind of Cultivation Technique is the fourth one?”<br/><br/>“The Heavenly Gang Saint Body Technique granted me the strongest physique, True Combat Technique granted me the strongest heart for battle, and Yin Yang Xuan Ming Zhen Gong allowed me to see through life and death. After mastering the Three Great True Cultivations, I felt invincible—until later, when I faced the death of someone I cared about and was powerless to help. I suddenly realized that, strong as my power was, it could only protect my present self. I had no control over fate.”<br/><br/>A look of reflection appeared on the Descending Dragon Great Saint’s face, his eyes filled with sadness and a wist of melancholy.<br/><br/>Fang Wang listened quietly, appearing to think of something, a flicker of movement in his eyes.<br/><br/>Descending Dragon Great Saint continued, “Legend has it that beyond the Three Realms lies an exile zone, where creatures that sink into it lose the meaning of being alive. They can see the past and the future but cannot participate in the past, the present, or the future. Only endless desolation awaits them. If I were to create the fourth True Cultivation, it would surely revolve around reversing time, even controlling time.”<br/><br/>He looked again at Fang Wang and said, “The fourth True Cultivation is too complex. I couldn’t achieve it, but you can.”<br/><br/>Fang Wang smiled and said, “Reversing time, huh? I actually have such a technique.”<br/><br/>Upon hearing this, Descending Dragon Great Saint was taken aback.<br/><br/>Just as he was about to inquire further, Fang Wang’s body suddenly burst forth with a dazzling silver light, within which tiny stars soared into the sky, and his entire being emitted a mysterious and inexplicable aura.<br/><br/>All the ghosts behind him widened their eyes in disbelief, staring at Fang Wang.<br/><br/>Descending Dragon Great Saint was even more astonished, hardly trusting his own eyes, and he exclaimed, “Have you already succeeded in creating it?”<br/><br/>“Not exactly. I just happened to master the Secret Technique here. Master, the next time we meet, we may no longer be master and disciple, but I will repay your guidance,” Fang Wang said, his voice carrying an indescribable mirth.<br/><br/>As his words fell, he erupted into a bright radiance that swept through the Zhui Tian Secret Realm, through the entirety of Xuanzu’s World, across the whole universe, and even skimmed past the Nine-Faced Divine Net.<br/><br/>The Nine-Faced Divine Net instinctively raised an arm to defend, but the brilliant silver light still passed through its body.\t\t\t\t\t\t</div>", "images": {}, "success": true}