{"id": 470, "url": "https://www.novelhall.com/i-became-an-immortal-on-mortal-realm-32879/15187391.html", "title": "Chapter 460 - Chapter 460: Chapter 457: The World-Shaking Divine Pillar, Catastrophe Of The Mortal Realm", "volume": 5, "volume_title": "Volume 5", "body": "<h1>Chapter 460 - Chapter 460: Chapter 457: The World-Shaking Divine Pillar, Catastrophe Of The Mortal Realm</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 460: Chapter 457: The World-Shaking Divine Pillar, Catastrophe of the Mortal Realm<br/><br/>Listening to the Immortal Divines around him, the face of the Great Divine Pillar turned exceedingly grim. Before descending to the Mortal Realm, he had not anticipated the situation would escalate to such an extent.<br/><br/>“Has the Lingxiao Saint Emperor failed?”<br/><br/>How is that possible!<br/><br/>He is the War God, never defeated!<br/><br/>The Great Divine Pillar’s mind was in complete disarray. He felt an overwhelming fear towards Fang Wang and even his divine body began to tremble.<br/><br/>Watching the cracks on the Heavenly Gate multiply, his heart also began to shatter.<br/><br/>Seeing the cracks widen at an increasingly rapid pace, the Great Divine Pillar couldn’t bear it and, gritting his teeth, said, “Purge World Divine Pillar, descend immediately, complete the task of cleansing the Mortal Realm, and summon back all the Immortal Divines!”<br/><br/>As soon as he spoke, the formidable figure of the Purge World Divine Pillar vanished on the spot. Another Immortal Divine took out a Jade Slip, slid his finger across it, and issued orders to all Immortal Divines.<br/><br/>Immortal Divines scattered across various locations in the Mortal Realm heard the Celestial Officer’s command in an instant, rising into the sky, shooting towards the heavens. Seen from the earth, rainbows ascended to the Firmament from every direction—a sight of breathtaking magnificence.<br/><br/>Scenes of Immortal Divines gathering and heading towards the Heavenly Gate also emerged within the Firmament’s illusion, drawing the attention of more and more beings.<br/><br/>“What’s going on? Are the Immortal Divines retreating?”<br/><br/>“Is that for real?”<br/><br/>“Damn it, I haven’t even taken my revenge yet; I can’t accept this…”<br/><br/>“Revenge? You could cultivate for ten thousand more years and still wouldn’t be qualified to seek revenge. Be glad you managed to survive.”<br/><br/>“It’s finally over… How many beings have died in this Mortal Realm…”<br/><br/>Some people knelt and cried loudly, others were ecstatic, and some were filled with extreme fury. As the Immortal Divines ascended, the sky of the Mortal Realm brightened too, influenced by the light of the Immortal Divines, as if the dawn was arriving.<br/><br/>However, the beings did not know that the true catastrophe was only just beginning.<br/><br/>Descending Dragon Continent, Sword Heaven Marsh.<br/><br/>Standing by the lake, Hong Chen and Solitary Life Elder calculated something simultaneously, their faces turning pale.<br/><br/>“Set up the formation! Activate the highest level of the protective Wangdao Grand Formation!”<br/><br/>Hong Chen shouted loudly, his voice echoing throughout nature. All the Wangdao Cultivators, though shocked, complied immediately.<br/><br/>Dugu Wenhun then appeared behind Hong Chen, anxiously asking, “What’s happened? Could it be that more Immortal Divines are attacking?”<br/><br/>Hong Chen’s face was grim, and he said through clenched teeth, “They are going to cleanse the Mortal Realm, at least half of the beings here will perish!”<br/><br/>Although many beings had died over the years, the Mortal Realm was vast, and new life was born every day.<br/><br/>The demise of half the beings at once was a disaster beyond the comprehension of ordinary spirits!<br/><br/>Upon hearing this, Dugu Wenhun’s face also turned pale.<br/><br/>Then, a figure leaped into the sky from Sword Heaven Marsh—it was none other than Qi Yun Great Saint. He raised his arms, covering the whole of Kunlun with his holy power, aiding the Wangdao Cultivators in rapidly setting up the formation.<br/><br/>Following him, more than a dozen figures flew to his side, all casting spells together—each one a Great Saint or Great Emperor.<br/><br/>After the Heavenly Dao showed the power to contend against the Immortal Divines, various Great Saints and Great Emperors chose to join Wangdao, with Hong Chen, Solitary Life Elder, and Qi Yun Great Saint acting as persuaders. This was one of the reasons why Wangdao had remained stable up to now.<br/><br/>Even when a True God attacked, they managed to repel him.<br/><br/>The Emperor Saints gathered in the high sky, staring at the Firmament, their faces extremely somber.<br/><br/>“They’ve truly gone mad. It’s only been fifty thousand years since the last cleansing of the Mortal Realm; why another one now?”<br/><br/>“It seems the pressure from the Heavenly Dao is too great on them.”<br/><br/>“It looks like the Immortal Divines are retreating. If we can survive this trial, we will have made it through.”<br/><br/>“But this is not going to be easy to endure.”<br/><br/>“If it comes to it, we die, it’s not as if we haven’t died before!”<br/><br/>“`<br/><br/>The Emperor Saints conversed with each other, some cursing bitterly, some with a mocking face, and others feeling helpless, preparing to face annihilation.<br/><br/>Atop a high mountain far in the Western Mortal Realm, a man dressed in golden robes stood on the edge of a cliff, his Fate blazing around him, shooting up to the sky, and he was none other than Emperor Cangtian.<br/><br/>Emperor Cangtian had a calm expression on his face as he murmured, “Am I still one step too late…”<br/><br/>He was attempting to reach the Great Saint realm, as nature’s spiritual energy gathered from all directions, but he already sensed the coming calamity.<br/><br/>It was not just him; Xu Qiuming, who was meditating on swordsmanship, raised his head; Yang Du, marching through mountains of corpses and seas of blood, raised his head; Fang Zigeng, standing in front of a stele, raised his head.<br/><br/>All the wielders of great Fate in the Mortal Realm could feel the unrest in heaven and earth, the approach of calamity.<br/><br/>…<br/><br/>In the outer space of the universe, the Crushing World Divine Pillar came to a halt, his face reflecting light, his pupils mirroring the landscape of Xuanzu’s World.<br/><br/>Xuanzu’s World was a continent that radiated light, its Fate apparent, with dragon-shaped flows of Spiritual Energy encircling the land, which added to its divine aura.<br/><br/>The Crushing World Divine Pillar’s face was icy cold, his eyes under the helmet indifferent to the multitude of creatures.<br/><br/>He raised his right hand, palm facing towards Xuanzu’s World.<br/><br/>“Xuanzu, are you aware that the world you created has now become a pawn in the hands of the Supreme Saint, picked up and set down at will?”<br/><br/>The Crushing World Divine Pillar muttered to himself, his tone devoid of any emotional fluctuation.<br/><br/>Boom!<br/><br/>His Mana exploded, gathering in his palm to form a tremendous golden bow, with the bow’s body resembling intertwined dragons and phoenixes and the bowstring made of twisted strands of energy flames.<br/><br/>He held the bow in one hand and drew the bowstring with the other, pulling it taut into a full circle.<br/><br/>An illusion of Xuanzu’s World suddenly locked onto the Crushing World Divine Pillar, allowing all beings in the world to see, causing an uproar in the human realm.<br/><br/>The Immortal Divine who had returned from the Mortal Realm at the sight of the Crushing World Divine Pillar drawing his bow, were all terrified, accelerating their ascent into the sky to avoid being affected.<br/><br/>In front of the Heavenly Gate, the Great Divine Pillar stood, he turned to look towards Xuanzu’s World, his eyes as cold and indifferent as those of the Crushing World Divine Pillar’s.<br/><br/>He looked deeply once, then turned back, his focus falling once again on the Heavenly Gate.<br/><br/>The Heavenly Gate was already covered in cracks, and the light curtain inside was gradually dimming, as if signifying destruction.<br/><br/>Fortune and Prosperity Immortal stood among the Immortals, frowning deeply, wanting to say something but ultimately holding back.<br/><br/>For a long while.<br/><br/>An intense light burst from deep within the stars, illuminating the backs of all the Immortals, but none of them turned back, their eyes fixed on the Heavenly Gate covered in cracks.<br/><br/>The light from behind cast their expressions in a gloomy light.<br/><br/>Suddenly, the entire universe trembled, and a deafening roar came from Xuanzu’s World.<br/><br/>The spiritual energy of heaven and earth within the universe surged tumultuously, forming a strong wind, howling towards them.<br/><br/>The Heavenly Gate abruptly stopped creating cracks, and the Immortals, noticing this, showed smiles on their somber faces.<br/><br/>Could it be…<br/><br/>The Great Divine Pillar also secretly let out a sigh of relief, indeed, the War God is the War God, he cannot possibly be defeated by mere spirits!<br/><br/>Just then, a silhouette emerged from within the light curtain of the Heavenly Gate, becoming increasingly larger, clearly walking towards them.<br/><br/>Upon noticing the Lifespirit Treasure in the newcomer’s hand, entwined with the form of a Purple Dragon Soul, the Great Divine Pillar immediately smiled and raised his hand to speak, “Saint…”<br/><br/>He had just uttered a word when his expression drastically changed.<br/><br/>All of the Immortal Divine retreated in unison, scattering like a tidal wave, and they promptly summoned their own Lifespirit Treasures.<br/><br/>Fang Wang emerged from the light curtain in a white robe, wearing a Fox Mask on his face, his gaze icy cold; the Heavenly Palace Halberd in his right hand was adorned with a Purple Dragon Soul, radiating intense, fiery energy.\t\t\t\t\t\t</div>", "images": {}, "success": true}