{"id": 474, "url": "https://www.novelhall.com/i-became-an-immortal-on-mortal-realm-32879/15192280.html", "title": "Chapter 464 - Chapter 464: Chapter 461 Heavenly Dao Appears, Kunlun Seeks The Dao", "volume": 5, "volume_title": "Volume 5", "body": "<h1>Chapter 464 - Chapter 464: Chapter 461 Heavenly Dao Appears, Kunlun Seeks The Dao</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 464: Chapter 461 Heavenly Dao Appears, Kunlun Seeks the Dao<br/><br/>Zhou Xue couldn’t answer because she was also uncertain whether there truly was a method in this world that could instantly transform someone into an immortal.<br/><br/>She stood there in a daze, her mind in turmoil. She struggled to maintain her composure, pondering on how she should proceed next.<br/><br/>Previously, after accepting her rebirth, her intention was to help the Fang Residence overcome the crisis that would obliterate their clan, but now it seemed unnecessary.<br/><br/>The celestial phenomenon caused by Fang Wang had continued for a while, and his identity had already spread throughout the Fang Residence. Zhou Xue had also overheard the house servants discussing that the person in the sky was the thirteenth son of the Fang Residence, Fang Wang.<br/><br/>Zhou Xue was now unsure whether Fang Wang was part of an illusionary realm or the incarnation of that mysterious ancestor. All she could do was wait quietly, waiting for the other party’s momentum to stop increasing.<br/><br/>Meanwhile, more and more cultivators arrived, all of them scattered outside Southern Hills City, afraid to enter the city lightly. Even from a distance, they were shocked by Fang Wang’s figure and aura.<br/><br/>The Great Abyss Gate had also arrived.<br/><br/>Sect Leader Guang Qiuxian arrived with several elders and a multitude of disciples, among them the number one genius of the Great Abyss Gate, Lu Yuanjun, who carried a mid-grade Earth Origin Spirit Treasure, and whose talent was unparalleled in his era.<br/><br/>They looked at Fang Wang, who was shining with silver light, and no one dared to move forward.<br/><br/>Lu Yuanjun’s gaze towards Fang Wang was also filled with feverish excitement. Could this person be an immortal hidden in the mortal realm?<br/><br/>Not only the Great Abyss Gate came, but other factions from the Grand Qi Cultivation Realm also arrived.<br/><br/>And so, days and nights passed, one day after another.<br/><br/>After a full seven days, Fang Wang’s breath became peaceful. His aura was vast and boundless, but not the oppressive kind. It brought a sense of peace and grandeur that made all beings feel respect and even reverence from the bottom of their hearts.<br/><br/>Fang Wang stood in the sky, the silver light on his body had disappeared, but behind him formed three Heavenly Dao Suns, radiating bright light, driving away the darkness. The thunderclouds in the sky slowly dispersed, followed by the real sunlight shining down.<br/><br/>Fang Wang opened his eyes, like a supreme immortal divine being awakening.<br/><br/>He raised his hands, a smile appearing on his face.<br/><br/>He had completely achieved the status of a Heavenly Dao Mysterious Immortal, and his cultivation was even higher than in his previous life, thanks to the four types of rule powers he had understood during the process of rebirth.<br/><br/>From Fang Wang’s perspective, Southern Hills City was packed, with countless citizens kneeling and praying, while outside the city, the figures of cultivators could be seen, some also kneeling in sincere worship.<br/><br/>No one questioned him, believing him to be a True Immortal of the mortal realm, because the celestial phenomenon of these seven days was indeed real.<br/><br/>The earth began to sprout golden lotuses everywhere, even in the corners of the city walls and on the streets, and all creatures close to the golden lotuses felt guided by the Dao.<br/><br/>“I, Fang Wang, hereby establish the Heavenly Dao today and become an immortal on the spot in the mortal realm. In the future, upon the establishment of Kunlun on the Descending Dragon Continent, all seekers of the Dao, as long as their Dao heart is sincere and irrespective of their roots or race, are welcome to seek the Dao,” announced Fang Wang.<br/><br/>Fang Wang’s voice echoed throughout the Mortal Realm, including the Western Mortal Realm, sending shockwaves instantaneously across the world.<br/><br/>The Heavenly Dao!<br/><br/>Instantaneous immortalization!<br/><br/>Seeking the Dao at Kunlun!<br/><br/>The sheer amount of information contained in this brief speech excited all the people in the world. The cultivators near Southern Hills City were even more thrilled, feeling that their proximity gave them an advantage.<br/><br/>Boom——<br/><br/>A sound like a great bell came from the edge of the sky, as a golden path extended forth, drawing countless cultivators and commoners to turn their heads to look.<br/><br/>Upon that golden path, a figure was seen stepping forward. It seemed to be strolling leisurely, yet each step covered an immense distance.<br/><br/>After about a dozen steps, he arrived in front of Fang Wang, with less than a hundred zhang separating them, a very close distance for the likes of them.<br/><br/>It was indeed the ruler of the Eastern Mortal Realm, Emperor Donggong, the father of Hong Xian’er.<br/><br/>Fang Wang looked at Emperor Donggong in his prime, and even his usually tranquil heart stirred with ripples.<br/><br/>In his previous life, Emperor Donggong had been very kind to him. Although there was an element of investment, the support was real, and Fang Wang did not let him down, protecting the Grand Yu Divine Dynasty after his death.<br/><br/>Emperor Donggong, feeling the boundless and vast Heavenly Dao aura from Fang Wang, was inwardly shocked, especially seeing the three Heavenly Dao Suns behind Fang Wang made him feel like his own cultivation was incomparable.<br/><br/>No wonder the Descending Dragon Great Saint could not rival the Immortal Divine. If all Immortal Divines were this powerful, the Mortal Realm indeed had no chance of overturning their rule.<br/><br/>Taking a deep breath, Emperor Donggong raised his hand in salute and said, “I, the Emperor of the Grand Yu Divine Dynasty, Emperor Donggong, pay my respects to the senior, and thank you for opening a new path for the beings of the Mortal Realm.”<br/><br/>Fang Wang did not refuse, as the matter of his rebirth was too absurd and complicated to explain. Moreover, Cultivators themselves ranked seniority by cultivation level, and indeed he now had the qualifications to be Emperor Donggong’s senior.<br/><br/>“The Grand Yu Divine Dynasty has merits in maintaining the order of the Mortal Realm. Once Kunlun is completed, I will bestow upon the Grand Yu Divine Dynasty a divine opportunity,” Fang Wang replied.<br/><br/>With these words, Emperor Donggong was overjoyed, bowing and thanking Fang Wang repeatedly.<br/><br/>Fang Wang waved his hand and then flew into Southern Hills City.<br/><br/>Emperor Donggong watched as Fang Wang descended into a residence, thinking to himself, “Fang Residence, Fang Wang…”<br/><br/>Afterward, he turned and left, disappearing into the horizon along the golden path.<br/><br/>Elsewhere.<br/><br/>After Fang Wang descended into the Fang Residence, he was surrounded by the Fang Family Members.<br/><br/>In the crowd, Fang Wang saw his parents, Fang Yin and Lady Jiang, and he couldn’t help thinking of the regret in his past life when he missed his chance to bid them farewell. This life offered an opportunity to make up for it, and even create other possibilities.<br/><br/>Fang Wang didn’t rush to kneel before his parents in excitement. Now he was a Great Cultivator who had endured more than two million years of cultivation, with a firm Dao heart.<br/><br/>Facing the barrage of questions from his relatives, Fang Wang remained very calm, and it was this calmness that saved him many troubles.<br/><br/>“Enough of this nonsense! All of you, back off, and do not probe into the secrets of Heaven. You only need to know that Wang’er has become an Immortal,” a domineering voice called out, belonging to Fang Wang’s grandfather, Fang Meng.<br/><br/>With Fang Meng still in charge of the Fang Residence, his words prompted the family members to disperse immediately.<br/><br/>Fang Meng approached Fang Wang, his expression equally excited, but he did not say much. He only spoke one sentence, “Wang’er, you’ve worked hard. Go rest for now. In a few days, we will have a chat, grandfather and grandson.”<br/><br/>Fang Wang smiled and nodded, then disappeared on the spot.<br/><br/>Seeing Fang Wang vanish into thin air, the family members all cried out in amazement, finding it inconceivable.<br/><br/>In the eyes of the Fang Family Members, there were no Cultivators in the world; they only knew of martial arts, with training enabling them to fight hundreds by oneself. Before Fang Wang ascended to the heavens, they believed that Immortal Divines were nothing more than fabricated legends.<br/><br/>Fang Wang arrived at Zhou Xue’s courtyard with a single step.<br/><br/>At this moment, Zhou Xue was meditating among the golden lotuses, cultivating a technique.<br/><br/>Fang Wang could tell at a glance that what she was practicing was not the Purple Qi Immortal Technique, but another one altogether, even more powerful.<br/><br/>Zhou Xue did not feel his presence and continued to immerse herself in cultivation and enlightenment.<br/><br/>With a wave of Fang Wang’s right hand towards the ground, more golden lotuses appeared within the courtyard. He infused his Daoist intent into the lotuses, helping Zhou Xue better comprehend the Dao.\t\t\t\t\t\t</div>", "images": {}, "success": true}