{"id": 477, "url": "https://www.novelhall.com/i-became-an-immortal-on-mortal-realm-32879/15195909.html", "title": "Chapter 467 - Chapter 467: Chapter 464 The Legend Of The Immortal Of Fang Residence", "volume": 5, "volume_title": "Volume 5", "body": "<h1>Chapter 467 - Chapter 467: Chapter 464 The Legend Of The Immortal Of Fang Residence</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 467: Chapter 464 The Legend of the Immortal of Fang Residence<br/><br/>“Embrace all under heaven, and transform them into one’s own Dao…”<br/><br/>Fang Wang murmured to himself, repeating the words of the Sword Saint, as if enlightenment dawned upon him.<br/><br/>The Sword Saint spoke no further, gazing at the lake’s surface, he said, “Heaven is Dao, Earth is Dao, all things can also become Dao. Do you know what my next idea for the Celestial Sword Intent is?”<br/><br/>Fang Wang lifted his eyes and asked, “Please enlighten me, master.”<br/><br/>Although the disparity in strength between the two had shifted dramatically after rebirth, with Fang Wang able to erase the Sword Saint with a mere thought, he still held great respect for the Sword Saint.<br/><br/>“All things under heaven can transform into my Sword Intent. I am pondering how to attain even more; in my inability to become an Immortal, everything I see should be within my control, like this lake. When I cannot leave, to desire it to become more only means to gain its past and to gain its future.”<br/><br/>The Sword Saint said earnestly, contemplating his own Sword Dao.<br/><br/>As Heavenly Dao was born and earth brought forth golden lotuses, bestowing good fortune to all beings, he too had reaped great benefits. His once lifeless heart of seeking the Dao flared with passion once more.<br/><br/>His words made Fang Wang’s eyes shine.<br/><br/>To gain the past, the future!<br/><br/>Fang Wang suddenly felt that his rebirth should hold a greater significance than merely growing stronger for revenge.<br/><br/>If he could be reborn, naturally there must be others who also had. Although their rebirths were not like his, and they were in his sight, could he guarantee there were no rebirth methods surpassing the Nine Lives Nirvana Sword Technique?<br/><br/>He could not.<br/><br/>If he could be reborn, his earlier enemies seeking revenge, would future ones not do the same to him?<br/><br/>He needed to step beyond the past, present, and future. Only then would he be truly unfettered.<br/><br/>Fang Wang spoke up, asking, “How can one seek the past, the future?”<br/><br/>The Sword Saint shook his head and said, “I do not know, but I feel you should. You have already set foot on this path.”<br/><br/>Upon hearing these words, Fang Wang couldn’t help but close his eyes.<br/><br/>At that moment, someone approached from behind. It was none other than the Sword Saint’s current sole disciple, Song Jinyuan, also one of the closest people to Fang Wang. In his previous life, he had dedicated his lifetime to Fang Wang.<br/><br/>Seeing Fang Wang, Song Jinyuan immediately froze. He couldn’t help asking, “Master, who is he?”<br/><br/>He knew the Sword Saint had returned to find a successor, which was always a sore point for him. His insufficient talent, which prevented him from fully inheriting his master’s legacy, made him feel ashamed, and while ashamed he was also worried, fearful of being replaced.<br/><br/>The Sword Saint answered, “An old acquaintance. During this time, do not disturb us.”<br/><br/>On hearing this, Song Jinyuan’s face immediately soured.<br/><br/>He could tell Fang Wang was very young, even younger than himself.<br/><br/>In the past life, Song Jinyuan, after being defeated by Fang Wang, fell into a depression, doubting his existence. It wasn’t until the Sword Saint’s death that he set aside his distractions to wholeheartedly assist Fang Wang.<br/><br/>Fang Wang felt Song Jinyuan’s life was more about living for the Sword Saint; he protected not Fang Wang, but Fang Wang who would become the second Sword Saint.<br/><br/>“No matter, let him stay. I see his talents are extraordinary, and he will undoubtedly achieve remarkable success in the Sword Dao,” Fang Wang’s voice followed.<br/><br/>Song Jinyuan’s expression instantly recovered upon hearing this, and he even smiled excitedly.<br/><br/>The Sword Saint glanced at Fang Wang and revealed a gratified smile before saying, “In that case, sit behind us and listen attentively to the Dao.”<br/><br/>“Thank you, Master, thank you, senior!”<br/><br/>Song Jinyuan promptly bowed in thanks. He could no longer care that Fang Wang was much younger, or that he could sit on par with his master and even influence the master’s decisions—Fang Wang must possess a high level of cultivation, far beyond his own.<br/><br/>After Song Jinyuan sat down, Fang Wang and the Sword Saint continued their discourse on the Dao, with the Sword Saint also closing his eyes in contemplation.<br/><br/>Sunset gave way to moonrise.<br/><br/>Day by day passed, and Fang Wang immersed himself with the Sword Saint in endless discussions of the Dao, both day and night, from which Song Jinyuan found himself unable to extricate.<br/><br/>More than half a month flashed by in the blink of an eye.<br/><br/>One day, the Sword Saint opened his eyes and instinctively looked beside him, to find that Fang Wang had already stood up, gazing at the lake surface, lost in thought.<br/><br/>Song Jinyuan sat with closed eyes, his brow furrowed as if he had encountered a bottleneck.<br/><br/>“Since you’ve come from the future, there must be trouble, right?” the Sword Saint asked.<br/><br/>Fang Wang responded, “I came originally for revenge, but now there might be a greater meaning.”<br/><br/>The Sword Saint then turned his gaze to the lake and said, “Indeed, life shouldn’t be dominated by hatred, and cultivation is no different. Dedicate your heart to the Dao, and all difficulties shall unravel.”<br/><br/>He stood up, waving his right hand over the surface of the lake, and in an instant, shadows of swords congealed upon it; they all looked identical, translucent in color.<br/><br/>With Fang Wang’s understanding of the Dao, he could discern the subtle differences in these sword shadows; some imbued with different karmic traces seemed to originate from both the past and the future.<br/><br/>This scene took Fang Wang by surprise; he knew the Sword Saint had an extremely high level of enlightenment, but had not expected it to such an extent.<br/><br/>If the Sword Saint of his previous life had received guidance from a wise man, perhaps he would not have met his end.<br/><br/>The Southern Celestial Sea was still too limited after all.<br/><br/>Fang Wang began to anticipate what the Sword Saint of this life could accomplish.<br/><br/>Since he was reborn, he did not want to go through the motions. Apart from becoming stronger himself, he also wanted to improve the lives of those around him, and those who believed in him.<br/><br/>“I plan to establish a spiritual sect. When the time comes, Master, please join it…” Fang Wang spoke, then he shared his vision and expectations for the Wangdao.<br/><br/>The Sword Saint listened intently, a smile gradually appearing on his face, nodding in agreement from time to time.<br/><br/>After an unknown period, Song Jinyuan finally awoke, and all he saw was the Sword Saint’s back. Looking around, he could no longer see Fang Wang’s figure.<br/><br/>“Master, that senior who was here before…” Song Jinyuan asked cautiously.<br/><br/>He held Fang Wang in high esteem, experiencing for the first time such a wonderful state of enlightenment. In his heart, Fang Wang was surely a transcendent being even surpassing the Sword Saint.<br/><br/>The Sword Saint replied, “He is Tiandao Fang Wang who founded the Heavenly Dao.”<br/><br/>Tiandao Fang Wang!<br/><br/>Song Jinyuan was shocked, his mouth hanging open unconsciously. He remembered the Sword Saint had once said that the Heavenly Dao was likely no less than the Great Saint Dao of myths.<br/><br/>Tiandao Fang Wang who founded the Heavenly Dao was definitely an Immortal of the Mortal Realm!<br/><br/>He could hardly believe he had been guided by such a great being and felt he was living in a dream.<br/><br/>Meanwhile, Fang Wang had returned to the Fang Residence to concentrate on understanding the Dao.<br/><br/>In the days that followed, Zhou Xue began leading the young disciples of the Fang Family on a quest for immortals and studying the Dao, just as in the past life.<br/><br/>Fang Wang went undisturbed since, in everyone’s hearts, he had become an Immortal, distinct from mere mortals.<br/><br/>Fang Wang meditated under the old tree in the courtyard, looking up at its branches, as still as a statue.<br/><br/>Days and nights changed, years passed by.<br/><br/>From time to time, house servants would pass by the courtyard, and the rumor of Fang Wang meditating under the tree spread quickly. Eventually, Fang Meng could not resist coming to watch, and after a while, he ordered the house servants to guard the yard, forbidding anyone from disturbing Fang Wang.<br/><br/>Ten years went by in the blink of an eye.<br/><br/>The tale of the Fang Residence’s Immortal observing leaves under a tree became known throughout the world, becoming a legend among men.<br/><br/>Until one day, a withered yellow leaf drifted down, sweeping past Fang Wang, causing a change in his gaze.\t\t\t\t\t\t</div>", "images": {}, "success": true}