{"id": 471, "url": "https://www.novelhall.com/i-became-an-immortal-on-mortal-realm-32879/15189712.html", "title": "Chapter 461 - Chapter 461: Chapter 458: Great Annihilation Technique Great Perfection! Eight Hundred Thousand Years!", "volume": 5, "volume_title": "Volume 5", "body": "<h1>Chapter 461 - Chapter 461: Chapter 458: Great Annihilation Technique Great Perfection! Eight Hundred Thousand Years!</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 461: Chapter 458: Great Annihilation Technique Great Perfection! Eight Hundred Thousand Years!<br/><br/>“How is it you… Impossible…”<br/><br/>The Great Divine Pillar couldn’t believe his own eyes, he asked tremblingly, “How could you possibly master the Dragon Soul True God Technique, what is your relationship with the Lingxiao Saint Emperor?”<br/><br/>Fang Wang stepped out from the Heavenly Gate, his eyes beneath the mask were so indifferent, void of any emotional fluctuations.<br/><br/>He slowly raised the Heavenly Palace Halberd, which was entwined with the Purple Dragon Soul, the tip pointed upwards, held high above his head, his movement frightening all the Immortal Divines into readiness, extremely tense.<br/><br/>Their gazes towards Fang Wang were filled with fear, they couldn’t comprehend how such a terrifying being could exist in the Mortal Realm, one that couldn’t be killed no matter how they fought.<br/><br/>Fang Wang didn’t speak, he simply lifted his head slightly, his eyes looking down on all the Immortal Divines.<br/><br/>The Fortune and Prosperity Immortal seemed to sense something and his face drastically changed, he instinctively retreated.<br/><br/>Suddenly, Fang Wang swung the halberd down!<br/><br/>There was no sound, just a swift chop downward, and with that chop, the entire cosmic starry sky seemed to be a mirror with countless fractures crisscrossing. Those Immortal Divines caught within were also entangled by the spatial fissures, and all their voices stopped abruptly.<br/><br/>Everything fell into silence!<br/><br/>In the distance, Xuanzu’s World was ascending with firelights of various sizes, with waves of flames rising from the ground. At this moment, those waves of fire also came to a halt.<br/><br/>“Break.”<br/><br/>The voice of Fang Wang resounded, cold to the extreme.<br/><br/>With the word ‘break,’ the entire cosmic starry sky shattered, the crisp sound of the breaking mirror echoing as the cosmic space seemed to collapse. Those Immortal Divines turned into fragments as well, quickly vanishing, replaced by a new cosmic starry sky which seemed identical to the previous one but no longer harbored the figures of Immortal Divines or tens of thousands of Immortal Soldiers.<br/><br/>Not a single Immortal Divine was resurrected!<br/><br/>The starry sky returned to calm, only the distant Xuanzu’s World was still surging with waves of fire, symbolizing the calamity still in progress.<br/><br/>Again, a figure came out from the Heavenly Gate, it was the Lingxiao Saint Emperor.<br/><br/>The Lingxiao Saint Emperor’s Dao Robe fluttered without wind, he remarked with emotion, “Such incredible comprehension, even as a destined spirit of the Heavenly Dao, I am inferior to you.”<br/><br/>“The Great Annihilation Technique is the most profound Divine Skill I’ve mastered, having cultivated it for hundreds of thousands of years, and yet I have only barely grasped it, not having attained its essence.”<br/><br/>The Great Annihilation Technique was precisely the Divine Skill that Fang Wang had just used. During the process of the Town World Bead swallowing fate, the Lingxiao Saint Emperor, in order to win over Fang Wang, had specially imparted this secret technique as an olive branch.<br/><br/>But he never expected Fang Wang to actually master the Great Annihilation Technique directly, it was truly inconceivable.<br/><br/>Now, his desire to recruit Fang Wang had reached its peak, such a talent must be utilized by him.<br/><br/>As for being enemies, he simply couldn’t kill Fang Wang; he had already dispelled that notion.<br/><br/>Fang Wang, with his back to the Lingxiao Saint Emperor, slowly began to speak, “The Great Annihilation Technique, indeed remarkable, I wonder who created it.”<br/><br/>The Great Annihilation Technique had kept him in the Heavenly Palace for a full eight hundred thousand years!<br/><br/>This was even twenty thousand years more than when he merged the Taixuan Shenxiao Scripture with the Heavenly Dao Myriad Classic of Laws!<br/><br/>Added to the previous Dragon Soul True God Technique, this battle with the Immortal Divines had seen Fang Wang passing eight hundred and eighty-eight thousand years!<br/><br/>Eight hundred and eighty-eight thousand years, enough time for everything to change!<br/><br/>The Lingxiao Saint Emperor, gazing towards the distant Xuanzu’s World, said with emotion, “In the end, they still managed to clear out half of the Mortal Realm.”<br/><br/>Fang Wang asked in a soft voice, “Why do you think, even though the Immortals cannot suppress me any longer, they still want to purge half of the Mortal Realm before they leave? Shouldn’t their target be the Emperor Saints?”<br/><br/>The Lingxiao Saint Emperor snorted, “That’s a question for the Supreme Saint. It was his requirement. He allowed the Immortal Court to recruit Emperor Saints from Xuanzu’s World, granted them the power to suppress the Mortal Realm, but at certain stages, he required the Immortal Court to cleanse the Mortal Realm for him. The reputation of the Immortals is getting worse, making him appear greater by contrast.”<br/><br/>“Think about it, the Supreme Saint once made the Immortal Court bow down and the Immortals couldn’t do anything to him. How could such a powerful being not protect Xuanzu’s World? The reason is simple—he wants Xuanzu’s World to exist but not to become too strong because he fears the resurrection of Xuanzu.”<br/><br/>Hearing his words, Fang Wang fell silent.<br/><br/>His gaze wandered far off, witnessing scenes of despair in Xuanzu’s World, even Wangdao suffered heavy losses, but none of these caused any change in his expression.<br/><br/>The Heavenly Gate behind him continued to crumble, its light curtain growing dimmer.<br/><br/>The Lingxiao Saint Emperor pressed on, “Well? Will you join me in taking revenge on the Immortal Court? Once we establish the new Heavenly Palace, you can rule Xuanzu’s World! With your talents and my support, we might even defeat the Supreme Saint!”<br/><br/>He showed an excited expression, as if he had already seen himself fighting side by side with Fang Wang, the mere thought exhilarating him.<br/><br/>Fang Wang turned around, looked at the Lingxiao Saint Emperor, and said calmly, “Let’s talk about it next time. Someone’s coming.”<br/><br/>Someone’s coming?<br/><br/>The Lingxiao Saint Emperor’s face changed dramatically, and he turned to look at once, only to see two figures standing within the Heavenly Gate’s light curtain, exuding an immensely foreboding presence just from their stances.<br/><br/>The Lingxiao Saint Emperor’s face darkened as he said each word deliberately, “Nine-Faced Divine Net… Wrathful God Luo…”<br/><br/>The two Divine Nets of the Immortal Court, also two of the Four Great War Gods!<br/><br/>The Nine-Faced Divine Net, in particular, is known as the strongest in the Immortal Court!<br/><br/>Fang Wang calmly looked into the light curtain of the Heavenly Gate, his eyes showing no fear.<br/><br/>“Lingxiao Saint Emperor, you have ultimately betrayed the Immortal Court, just like how you betrayed your junior sister all those years ago,” a voice cold and desolate rang out.<br/><br/>The Lingxiao Saint Emperor sneered, “Nine-Faced Divine Net, you dare to speak to me of betrayal? When it comes to this matter, who is more adept than you?”<br/><br/>Fang Wang could tell he was very nervous, the presence of the Lingxiao Divine Sect essence seeping out. Fang Wang, who had mastered Great Perfection of the Lingxiao Divine Sect, could see it clearly.<br/><br/>It seemed that although the Four Great War Gods appeared to be of equal rank, there were indeed differences in strength.<br/><br/>The figure of the Nine-Faced Divine Net looked as if it were clad in heavy Divine Armor, with broad shoulders shaped like dragon or qilin heads, giving the impression of three heads at first glance.<br/><br/>The Nine-Faced Divine Net slowly raised its right hand, and following that, the Town World Bead fiercely crashed out from the Heavenly Gate, startling the Lingxiao Saint Emperor into dodging immediately.<br/><br/>However, Fang Wang stayed in place, allowing the Town World Bead to pass through his body.<br/><br/>He found he was unable to reclaim the Town World Bead; a powerful force had taken control of it.<br/><br/>“Jiu You Freedom Technique, no wonder you dare to act so recklessly. Your treasure is imbued with the Fate of the An Tian Emperor. But you are not the An Tian Emperor. It seems the An Tian Emperor has indeed perished, choosing to support the younger generation,” said the Nine-Faced Divine Net’s voice, as if in self-questioning.<br/><br/>The accompanying Wrathful God Luo then spoke, “Jiu You Freedom Technique? That is even better for preserving one’s life than the Lingxiao Divine Sect.”<br/><br/>The two Divine Nets talked as if Fang Wang was not present, showing no panic even after recognizing the Jiu You Freedom Technique.<br/><br/>The voice of the Lingxiao Saint Emperor came from the side, “Fang Wang, hurry and leave. Do not be careless. These two Divine Nets possess Divine Skills that even I dread. Do not be complacent because of your secret technique.”<br/><br/>He used the Sound Transmission Technique, his tone grave.\t\t\t\t\t\t</div>", "images": {}, "success": true}