{"id": 476, "url": "https://www.novelhall.com/i-became-an-immortal-on-mortal-realm-32879/15193885.html", "title": "Chapter 466 - Chapter 466: Chapter 463: The Way Of The Sword Saint, There Is Always Someone Better", "volume": 5, "volume_title": "Volume 5", "body": "<h1>Chapter 466 - Chapter 466: Chapter 463: The Way Of The Sword Saint, There Is Always Someone Better</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 466: Chapter 463: The Way of the Sword Saint, There is Always Someone Better<br/><br/>When the golden-furred monkey spat out the words ‘Nine Lives Nirvana Sword Technique’, Fang Wang did not show any surprise, but watched it calmly.<br/><br/>The golden-furred monkey then said, “No, the Nine Lives Nirvana Sword Technique isn’t this frightening. I am completely unaware of any karmic connection with you. Could it be a past great law of the Divine Platform?”<br/><br/>Fang Wang asked, “From whom have you witnessed the Nine Lives Nirvana Sword Technique?”<br/><br/>The vast glow of fire behind the monkey made its expression look even more sinister, and a hint of hatred flashed in its eyes as it said through gritted teeth, “Of course I have seen it; the current Heaven Emperor has mastered it. His Nine Lives Nirvana Sword Technique has even evolved into Divine Skills.”<br/><br/>The Heaven Emperor too?<br/><br/>This was indeed beyond Fang Wang’s expectations. The Nine Lives Nirvana Sword Technique was bestowed upon him by Xu Yan, who later figured out that Xu Yan had acquired it from the Solitary Life Elder. Not only Xu Yan, but his past life had also received the Nine Lives Nirvana Sword Technique from the Solitary Life Elder.<br/><br/>Fang Wang had also taken the opportunity to inquire with the Solitary Life Elder, but the elder had lost many memories, saying that this was the price for overstepping karmic bounds and destiny.<br/><br/>Now it seemed the Nine Lives Nirvana Sword Technique had even greater karmic implications.<br/><br/>Upon hearing that the Heaven Emperor also possessed the Nine Lives Nirvana Sword Technique, a myriad of possibilities and even conspiracy theories flashed through Fang Wang’s mind in an instant.<br/><br/>Upon reflection, he did not believe the Heaven Emperor was scheming anything. Being in possession of the Great Perfection’s Nine Lives Nirvana Sword Technique, he could see other similar transmigration karmas. In other words, if others used the Nine Lives Nirvana Sword Technique to transverse, he would be able to see the karmic residues left in the Mortal Realm. Such was the accomplishment of Great Perfection, and this karmic residue could not be erased.<br/><br/>“Aside from the Heaven Emperor, does anyone else know the Nine Lives Nirvana Sword Technique?” Fang Wang pressed on.<br/><br/>The golden-furred monkey shook its head, “I do not know that.”<br/><br/>It widened its eyes and said through clenched teeth, “What, exactly, are you trying to do?”<br/><br/>A glint of cold light flashed across Fang Wang’s eyes, and the world around them suddenly changed, returning to the previous scene of the valley.<br/><br/>The golden-furred monkey let out a sigh of relief and couldn’t help asking, “What was the origin of that Divine Skill just now? Why could it face the fear in my heart?”<br/><br/>Fang Wang did not conceal the truth, revealing the name of the Divine Skill, “Eighteen Layers of Abi Hell.”<br/><br/>Speaking of which, the origins of the Eighteen Layers of Abi Hell were also quite mysterious. It was given to him by a mysterious elder in the Mortal Realm. This Divine Skill had endless wondrous uses and had become one of his regular combat strategies. Even if the opponent could crack it, he could still create opportunities with this Divine Skill.<br/><br/>The golden-furred monkey thought hard but couldn’t make sense of it.<br/><br/>“Do you seek revenge on the Immortal Court?” Fang Wang looked at the golden-furred monkey and posed the question.<br/><br/>The golden-furred monkey stayed silent.<br/><br/>Fang Wang was not in a hurry, patiently waiting for its decision.<br/><br/>In his past life, even though the Hongxuan Emperor had been reborn through possession, he could not exert the strength of a Great Emperor, which perhaps was related to the exiled state of his true self. He could only find a puppet and was unable to walk the Mortal Realm personally, meaning he could not seek revenge himself.<br/><br/>The valley was shrouded in silence, and even in the Illusionary Realm, a gentle breeze stirred the flowers and grass, as if it were the real world.<br/><br/>After a long while.<br/><br/>The golden-furred monkey uttered one word, “Yes!”<br/><br/>A smile appeared on Fang Wang’s face once again.<br/><br/>…<br/><br/>The sky was clear, and cranes flew together as there lay a great lake amidst the vast land and mountains, which from above looked like a Treasured Sword embedded between the hills.<br/><br/>This place was Sword Heaven Marsh.<br/><br/>A thin mist hovered over the lake’s surface, and on a wooden bridge by the lake stood an old man with white hair, looking so ethereal, like an Immortal from the Mortal Realm.<br/><br/>He held his hands behind his back, gazing ahead. Upon closer inspection, one could see two sword shadows lingering in his pupils.<br/><br/>“Heavenly Dao… What is the Dao of Heaven?”<br/><br/>The Sword Saint mused to himself. Since his return to Grand Qi, his birthplace, from the southern seas, he had been the strongest Cultivator in all of Grand Qi. However, the emergence of Tiandao Fangwang had shaken the world and shattered his understanding.<br/><br/>So there truly are Immortals in the mortal realm!<br/><br/>The birth of the Heavenly Dao had enlightened him profoundly. His Sword Dao, which had already reached a bottleneck, had once again seen hope, and this excited him greatly.<br/><br/>He didn’t care about strength or weakness, only about the essence of Sword Dao itself. When he could no longer make progress in Sword Dao, he returned to his homeland, prepared to find the right legacy, and then to follow his destiny.<br/><br/>“Heavenly Dao is the Dao of Heaven and Earth,”<br/><br/>A voice came from behind the Sword Saint, startling him into turning around. He saw Fang Wang standing on a wooden bridge, seven steps away from him.<br/><br/>Their gazes collided, and the Sword Saint’s expression swiftly shifted from astonishment to composure.<br/><br/>The Sword Saint slowly uttered four words, “Celestial Sword Intent.”<br/><br/>Fang Wang smiled and said, “Actually, my Tiandao originates from your Celestial Sword Intent, which is itself the way of Heaven and Earth.”<br/><br/>He deliberately released a strand of Celestial Sword Intent for the Sword Saint to feel.<br/><br/>The Sword Saint wasn’t shocked but asked in a strange tone, “Do you come from the future?”<br/><br/>“Why would you say that?”<br/><br/>“Not only have you mastered my Celestial Sword Intent, within your Celestial Sword Intent there is also a hint of my own Sword Intent. Moreover, I have traveled extensively and have never heard of your name, nor have I witnessed any celestial phenomena caused by you. Even when recalling those legends, there has never been such phenomena since ancient times.”<br/><br/>As he spoke, the Sword Saint’s tone became more certain.<br/><br/>A content smile appeared on his face as he said, “It seems my return this time has been successful. I will meet my destiny without any regrets.”<br/><br/>Looking at the Sword Saint, who had followed the principle of not taking lives throughout his life, Fang Wang couldn’t help but feel a rare surge of emotion.<br/><br/>Fang Wang had several masters: Yang Yuanzi of Great Abyss Gate pampered his disciples, Sword Saint taught him Sword Dao, and Descending Dragon Great Saint imparted true skills to him. But it was the Sword Saint he admired the most.<br/><br/>Some people might not have high cultivation levels or world-renowned fame, yet have a will stronger than even an Emperor Saint’s.<br/><br/>Fang Wang believed the Sword Saint was such a person.<br/><br/>That the Sword Saint could rapidly deduce that he came from the future only increased Fang Wang’s respect for him.<br/><br/>“Master, may we discuss Dao here?” Fang Wang smiled, his calling him Master confirming the Sword Saint’s speculation.<br/><br/>Upon hearing this, the Sword Saint also smiled, gestured with his hand to the side, and Fang Wang followed him, the master and disciple settling down side by side to sit cross-legged.<br/><br/>Fang Wang began speaking of his own Celestial Sword Intent first. Even though he hadn’t focused solely on Sword Dao for the over two million seven hundred thousand years of his cultivation, his Sword Dao was far beyond what the Sword Saint, with only a few hundred years of cultivation, could compare to.<br/><br/>The Sword Saint soon became engrossed.<br/><br/>During the discourse, Fang Wang also felt the Sword Intent of the Sword Saint.<br/><br/>The Sword Saint’s Sword Intent was beyond his realm, and Fang Wang quickly understood why the Sword Saint could sweep through those of the same realm.<br/><br/>The Sword Saint’s Sword Intent was a creation from sensing the rules of Heaven and Earth!<br/><br/>That was terrifying!<br/><br/>Only when one reaches the realm of Celestial Qiankun can one sense the rules of Heaven and Earth, yet the Sword Saint was several major realms below that.<br/><br/>In a certain sense, the Sword Saint’s comprehension was the strongest Fang Wang had ever seen.<br/><br/>Two hours later, after Fang Wang had finished talking, the Sword Saint took a deep breath and said, “Impressive Celestial Sword Intent. You have completely surpassed me. Your Celestial Sword Intent should encompass even more.”<br/><br/>“Encompass even more?”<br/><br/>“There are heavens beyond heaven. As long as there are heavens, Celestial Sword Intent can be infinitely elevated and created. To be precise, it’s Heavenly Dao. You are no longer limited to Sword Dao alone. You must encompass all the heavens, transforming them into your own path.”\t\t\t\t\t\t</div>", "images": {}, "success": true}