{"id": 473, "url": "https://www.novelhall.com/i-became-an-immortal-on-mortal-realm-32879/15192279.html", "title": "Chapter 463 - Chapter 463: Chapter 460: Sixteen Years Old, Heavenly Dao Mysterious Immortal", "volume": 5, "volume_title": "Volume 5", "body": "<h1>Chapter 463 - Chapter 463: Chapter 460: Sixteen Years Old, Heavenly Dao Mysterious Immortal</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 463: Chapter 460: Sixteen Years Old, Heavenly Dao Mysterious Immortal<br/><br/>The setting sun dipped below the horizon, and Southern Hills City bustled in the twilight, with ribbons of cooking smoke curling upwards.<br/><br/>“The thirteenth young master has returned.”<br/><br/>“Young master, why are you standing here and not going in?”<br/><br/>“Young master, where did you go to play today?”<br/><br/>“Make way, make way!”<br/><br/>Increasingly noisy voices reached Fang Wang’s ears as he slowly opened his eyes, greeted by the plaque above the mansion’s main gate.<br/><br/>Fang State Duke’s Mansion!<br/><br/>A gentle breeze passed by, causing Fang Wang’s white robes to flutter.<br/><br/>Once all his senses returned, a smile appeared on his face.<br/><br/>He had returned. This year, he was sixteen, back to the day Zhou Xue was reborn.<br/><br/>He looked up and saw a strand of red qi lingering above the Fang Residence, wriggling like a snake and stretching all the way into a certain courtyard within.<br/><br/>Only he could see this strand of red qi, and he could even discern that it was a temporal karmic thread.<br/><br/>After employing the Great Perfection Nine Lives Nirvana Sword Technique, Fang Wang had plunged into a time vortex. The rebirth process wasn’t brief; it was as though he had undergone a longevity of cultivation in the Heavenly Palace. Along the way, he had felt the power of four rules.<br/><br/>Time, space, destiny, karmic!<br/><br/>These four rules were interwoven and complex, forming a sophisticated system of rules.<br/><br/>Mastering the Nine Lives Nirvana Sword Technique allowed one to return to a certain point in their own life, up to nine times, and each return could be accompanied by forgotten memories. But the Great Perfection of the Nine Lives Nirvana Sword Technique was different; it enabled true rebirth, reconstructing the temporal order under a fragment of the Great Dao, hidden from others.<br/><br/>After a true rebirth, Fang Wang’s understanding of the four rules reached new heights.<br/><br/>He even felt the presence of the Great Dao!<br/><br/>What is the Great Dao?<br/><br/>Fang Wang’s understanding was that it was a force above the rules of heaven and earth.<br/><br/>Three thousand rules of heaven and earth could compose a realm, while the Great Dao could forge the chaos that contained these three thousand worlds.<br/><br/>Fang Wang stood in front of the Fang Residence’s main gate, quietly sensing, oblivious to the questions from the house servants.<br/><br/>In front of the Duke’s Mansion gate, clad in a white robe that hugged his figure, he had a striking appearance, his youthful vigor laced with a maturity beyond his years, attracting the gaze of all passersby.<br/><br/>Unaffected by others, Fang Wang quietly watched the red qi above the Fang Residence, wanting to see through the force that allowed Zhou Xue to be reborn.<br/><br/>For a long time.<br/><br/>“Wang’er, what are you daydreaming about while standing here?”<br/><br/>A voice came from the side, accompanied by a hand patting Fang Wang’s shoulder.<br/><br/>Glancing to the side, Fang Wang realized it was his second uncle Fang Zhe, who was also Fang Hanyu’s father.<br/><br/>Before his rebirth, Fang Zhe had passed away hundreds of years ago, and Fang Wang had almost forgotten him, but the sight of his face brought everything rushing back.<br/><br/>From childhood to adulthood, Fang Wang was much beloved by his uncles, partly because his father was the youngest son and partly because of his own precocious intelligence, which made him stand out too much compared to other children.<br/><br/>Fang Wang revealed a smile and said, “Second uncle, long time no see.”<br/><br/>Fang Zhe tousled his hair, a touch annoyed as he said, “What do you mean long time no see? You just took my bow this morning, where is my bow?”<br/><br/>Fang Wang pointed upwards to the firmament, and Fang Zhe instinctively looked up, seeing nothing. He couldn’t help but look back down at Fang Wang.<br/><br/>Just as he was looking at Fang Wang, Fang Wang began to move forward.<br/><br/>Suddenly, Fang Wang’s head was higher than Fang Zhe’s, leaving Fang Zhe astounded.<br/><br/>It wasn’t just Fang Zhe; all the Fang Family house servants guarding the main gate, as well as the passing commoners and merchants, widened their eyes in shock, displaying an expression as if they had seen a ghost.<br/><br/>Fang Wang’s feet seemed to step on invisible stairs as he ascended into the firmament one step at a time. In seven steps, he had risen above the eaves of Fang Residence, and after fifteen steps, he had reached a height of a hundred yards above the ground.<br/><br/>More and more people in Southern Hills City caught sight of Fang Wang’s figure, and exclamations rang out from every corner of the city. The Fang Family members and house servants within the Fang Residence also took notice of this scene.<br/><br/>Fang Zhe was completely dumbfounded, trembling all over.<br/><br/>He suspected he was dreaming.<br/><br/>In a courtyard of Fang Residence, a window suddenly pushed open, and an upper body of a young girl appeared—it was the youthful Zhou Xue.<br/><br/>The sixteen-year-old Zhou Xue possessed a similar aged aura to Fang Wang, which was very inconsistent with her youthful visage.<br/><br/>As she saw Fang Wang’s figure, her delicate eyebrows knitted together.<br/><br/>“Suspending mid-air… is he a cultivator?”<br/><br/>Zhou Xue was puzzled; she had just accepted the fact of her rebirth and was planning how to save Fang Residence. She hadn’t expected a cultivator to appear in Southern Hills City.<br/><br/>According to her memories, the cultivator who would destroy Fang Residence couldn’t fly directly and would not come until seven days later.<br/><br/>As Zhou Xue kept her gaze fixed on Fang Wang, thunderclouds suddenly converged above, plunging the already dusky Southern Hills City into deep night. The occasional flashes of heavenly lightning illuminated the entire world as if a natural disaster was approaching, and Fang Wang’s figure began to emit a silver light.<br/><br/>An immense and righteous pressure descended from the heavens, enveloping the entire city, the whole Descending Dragon Continent, and even the entire Mortal Realm!<br/><br/>Zhou Xue’s complexion changed drastically, and a storm of shock surged through her heart.<br/><br/>How could this be!<br/><br/>How could there be immortals in the Mortal Realm?<br/><br/>She was certain that this person was not a mortal realm cultivator but an Immortal from The Upper Realm, and his cultivation was not low; she had never felt such an aura before.<br/><br/>At this moment, Fang Wang stood proudly in the firmament, looking down upon the teeming masses of life, quietly invoking the mental method of the Heavenly Dao Myriad Classic of Laws.<br/><br/>He intended to achieve the status of Heavenly Dao Mysterious Immortal directly!<br/><br/>Now sixteen, in a thousand and one hundred years when the Heavenly Gate opened, he was certain he could transcend the Heavenly Dao Mysterious Immortal and forge a higher realm. Then, it would not be an Immortal Divine descending to the Mortal Realm, but the Heavenly Dao itself coming to the Immortal Court!<br/><br/>As the mental method was invoked, the law of the cosmos and Spiritual Energy surged towards him. His cultivation soared wildly, and his consciousness and senses were rapidly enhanced.<br/><br/>The range of his vision expanded greatly.<br/><br/>He saw Zhou Xue, beheld the Descending Dragon Great Saint, the Emperor Donggong, Yang Du, Dugu Wenhun, and even glimpsed Hong Chen.<br/><br/>In less than the time it takes for an incense stick to burn, the entire Mortal Realm came into his view.<br/><br/>An hour later.<br/><br/>He had cultivated the Heavenly Dao Myriad Classic of Laws through a complete cycle, transforming his flesh and spirit, and directly became a Heavenly Dao Mysterious Immortal.<br/><br/>In this life, at the age of sixteen, Fang Wang cultivated for the first time and became an immortal on the spot, achieving the status of Heavenly Dao Mysterious Immortal!<br/><br/>Once he stepped into the realm of the Heavenly Dao Mysterious Immortal, his aura became incredibly vast, instantly turning the sky of the entire Mortal Realm golden. The radiant golden light illuminated the earth, dispelling the darkness.<br/><br/>Zhou Xue had already reached the courtyard. The golden light sprinkled down on her, standing still in a daze, as if her soul had wandered off.<br/><br/>“Ancestral sages… How could such a being exist in the Mortal Realm…”<br/><br/>Zhou Xue began to question her life, suspecting that she had not been reborn at all, but had been pulled into an Illusionary Realm.<br/><br/>Clearly, the master of this Illusionary Realm was the mysterious ancestor in the sky right now!<br/><br/>Zhou Xue thought hard; she had never met any ancestral sages or powerful beings in her life. Who would have saved her just as she was about to perish, and why pull her into her childhood memories?<br/><br/>“Zhou Xue, do you say there’s a way in the Mortal Realm to become an immortal instantly?”<br/><br/>Fang Wang’s voice drifted into Zhou Xue’s ears, audible only to her.<br/><br/>Zhou Xue thought the powerful being had pulled her into the Illusionary Realm to test her, so she hesitated and answered, “There are naturally methods to become an immortal, but a method that allows one to become an immortal instantly…”\t\t\t\t\t\t</div>", "images": {}, "success": true}