{"id": 484, "url": "https://www.novelhall.com/i-became-an-immortal-on-mortal-realm-32879/15211282.html", "title": "Chapter 474 - Chapter 474: Chapter 471 Great Withering Heavenly Divine Art", "volume": 5, "volume_title": "Volume 5", "body": "<h1>Chapter 474 - Chapter 474: Chapter 471 Great Withering Heavenly Divine Art</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 474: Chapter 471 Great Withering Heavenly Divine Art<br/><br/>The trembling of the Golden Stele filled the Immortals and Gods with even greater unease, they even felt the mighty auras of Fang Wang and the Supreme Saint.<br/><br/>The battle between the two strongest fighters in the Mortal Realm actually reached the Immortal Court!<br/><br/>Merely sensing the auras of Fang Wang and the Supreme Saint made them shiver without being cold, unable to imagine what a terrifying scene it would be to truly face those two.<br/><br/>Some of the highly advanced Immortals and Gods even noticed that the auras of Fang Wang and the Supreme Saint were continuously rising.<br/><br/>Fang Wang was consolidating his Transcendental Realm of the Heavenly Dao in battle, while the Supreme Saint, having only been resurrected for a short time, was unable to unleash his full strength.<br/><br/>The mere augmentation of the two strongest fighters’ auras was enough to shake the myriad realms of heaven and earth.<br/><br/>The great god columns suddenly felt something and violently turned their heads, not just them, the other god columns did the same, and then their expressions drastically changed, they hastily knelt on one knee to pay homage.<br/><br/>“We greet your majesty!”<br/><br/>The god columns said in unison, startling the other Immortals and Gods into turning around.<br/><br/>A semi-transparent colossal face appeared in the firmament, its true features indistinct, but just the contours of its face were filled with an oppressing force, inspiring awe at a mere glance.<br/><br/>All the Immortals and Gods knelt down, worshipping this colossal face.<br/><br/>He was none other than the master of the Immortal Court, the Heaven Emperor!<br/><br/>The worship of the Immortals and Gods didn’t capture the attention of the Heaven Emperor, his gaze was still tightly fixed on the Golden Stele, lost in thought.<br/><br/>After a long time.<br/><br/>The gigantic face of the Heaven Emperor disappeared from the firmament, and the Immortals and Gods let out a breath of relief, standing up one after another.<br/><br/>“Who would have thought that even the Heaven Emperor would be alarmed.”<br/><br/>“After all, one of them is the Supreme Saint of the Mortal Realm, an existence our Immortal Court is helpless against.”<br/><br/>“That was the past Heaven Emperor who could not deal with him, the present Majesty might not necessarily be unable to.”<br/><br/>“Compared to the Supreme Saint, I am more worried about the Heavenly Dao, just who is this sacred being?”<br/><br/>The Immortals and Gods discussed among themselves, the shadow from the Mortal Realm looming over them once again.<br/><br/>…<br/><br/>After Fang Wang and the Supreme Saint commenced their battle, the fate of Xuanzu’s World enveloped the entire heaven and earth, preventing all beings from being affected by the battle beyond the sky, though the mountains and seas of the land were greatly impacted, with natural disasters continuing without end, and the vast Spiritual Energy from beneath the earth surged forth, bringing opportunities from different eras to the surface of the land.<br/><br/>The great era of strife in the Mortal Realm arrived prematurely!<br/><br/>As the years passed, continuously Cultivators soared skyward, heading toward the apex of the heavens to observe the great battle beyond the skies, and likewise, continuously Cultivators fell down, seeking support in the Mortal Realm.<br/><br/>Construction at Kunlun continued, although Fang Wang was fighting beyond the skies, the avatar he left behind continuously helped with the construction of Kunlun, none of the avatars dissipated due to the exhaustion of Heavenly Dao Force.<br/><br/>The influence and foundation of the Wangdao grew rapidly, already becoming the number one Dao Sect on the Descending Dragon Continent, even renowned throughout the world.<br/><br/>Xuan Zong, Sword Sect, Divine Sect, and Buddhist Sect dominated the world, which led to ever-increasing prestige for the Wangdao.<br/><br/>In the blink of an eye.<br/><br/>A hundred years passed by in a flash.<br/><br/>After a century, the barriers between the Eastern Mortal Realm and the Western Mortal Realm started to dissipate, with passage opening between the two Realms, influential figures emerged, sweeping through the other half of the Mortal Realm to become the target heroes of their age.<br/><br/>As for Tiandao Fangwang, he became a myth, the goal that countless Cultivators aspired to reach.<br/><br/>The top powers of the major sects in the Mortal Realm all greatly admired Fang Wang, instilling his might deep into the hearts of the younger generation of geniuses.<br/><br/>On this day, at Sword Heaven Marsh.<br/><br/>Gu Tianxiong stood by the lakeside, fishing. Several cultivators had stopped by his side, chatting and laughing with ease—a scene Gu Tianxiong particularly enjoyed, with a smile brimming on his face.<br/><br/>Suddenly, Gu Tianxiong caught sight of a man in purple robes standing not too far away. That man was incredibly handsome, resembling an immortal from a painting and so striking that onlookers couldn’t help but be amazed.<br/><br/>Of all the people Gu Tianxiong had encountered in his life, only the Wangdao Master possessed such an aura.<br/><br/>This was certainly no ordinary mortal!<br/><br/>Gu Tianxiong handed his fishing rod to someone beside him and lifted his feet to approach the man in purple robes.<br/><br/>“Fellow Daoist, you seem unfamiliar; is this your first visit here?” asked Gu Tianxiong with a smile. Now a disciple of the Wangdao Sword Sect, he had the privilege to recommend others—a means of building connections—and he would not miss the opportunity if he encountered someone with impressive cultivation skills.<br/><br/>The man in purple robes nodded and said with a gentle laugh, “Indeed, I came here inspired by its reputation. Are you a disciple of Wangdao?”<br/><br/>“Of course. If you’re interested in Wangdao, I can introduce you. Which aspect would you like to know more about?” Gu Tianxiong said enthusiastically. Seeing the friendly attitude of the man, he couldn’t help but take a liking to him.<br/><br/>“Let’s start with learning about the Dao Master; after all, the leader of a sect represents the whole institution’s ethos, and his thoughts influence the followers,” the man in purple robes pondered aloud.<br/><br/>Gu Tianxiong seriously spoke, “Wangdao isn’t merely a sect but a Dao. In Wangdao, there is no distinction of rank or status. Even someone from the Dao Sect cannot belittle a disciple. We are peers, Daoists. This is the rule set forth by our Dao Master…”<br/><br/>He began to speak at length about the principles laid down by Fang Wang, and the man in purple robes grew increasingly interested.<br/><br/>Gu Tianxiong spoke with passion, gradually attracting other cultivators who had come from afar and were similarly interested in Wangdao.<br/><br/>Meanwhile, elsewhere.<br/><br/>In the heavens.<br/><br/>The once dim cosmic void had transformed into a vast, chaotic universe, displaying multicolored fragments as if torn asunder, with explosions occurring deep within, their silent impacts cascading in waves and sweeping across the cosmos.<br/><br/>Fang Wang and the Supreme Saint were still locked in battle, a conflict that had lasted for a hundred years.<br/><br/>But their true selves had ceased action, with only their divine skills clashing invisibly.<br/><br/>The two stood a hundred miles apart, the space around them continuously fracturing and reforming, occasionally flashing with spectacular remnants as if thousands of avatars were engaged in swift combat.<br/><br/>Fang Wang closed his eyes, the white clothes beneath his Tianling Body gently fluttered, the Heavenly Palace Halberd standing by his side, with Purple Dragon Soul entwining around him.<br/><br/>The Supreme Saint stared at Fang Wang, his expression grave.<br/><br/>If one looked closely, they could see the Supreme Saint’s right foot trembling minutely. He wanted to lift it, but no matter how he tried, he just couldn’t.<br/><br/>“Merely a hundred years, and to have grown so strong. Just what kind of transcendence does the Heavenly Dao have?” the Supreme Saint thought to himself as he looked at Fang Wang, bewildered.<br/><br/>Over the years, his power had recovered to almost its full strength, but no matter how much he recovered, he couldn’t catch up to the pace of Fang Wang’s improvement.<br/><br/>For the first time, the Supreme Saint felt a sense of trepidation, and it was towards a junior.<br/><br/>It was clear that Fang Wang surpassing him was a foregone conclusion!<br/><br/>The Supreme Saint slowly raised his right hand, trembling as he pointed it towards Fang Wang, saying, “The next palm will determine the outcome between you and me. I must use eighty percent of my cultivation to execute it. If you can withstand it, I will no longer stand in your path and may even impart to you divine skills to assist you.”<br/><br/>Fang Wang’s eyes remained closed, unmoved, as if he hadn’t heard a word.<br/><br/>“This technique is called the Great Withering Heavenly Divine Art!”<br/><br/>As the Supreme Saint’s voice trailed off, the entire void dimmed. The Three Thousand Rules of Power started to condense. The vast spiritual energy dissipated like smoke, and the cosmic void began to turn grey, as if rolling mists were engulfing Fang Wang, threatening to drown him.<br/><br/>In an instant, Fang Wang’s black hair turned white, his skin aged visibly to the naked eye, and at that moment, he opened his eyes.<br/><br/>They were silver, as if containing a dazzling universe within.\t\t\t\t\t\t</div>", "images": {}, "success": true}