{"id": 487, "url": "https://www.novelhall.com/i-became-an-immortal-on-mortal-realm-32879/15220605.html", "title": "Chapter 477 - Chapter 477: Chapter 474: The Meaning Of Fang Wang'S Existence", "volume": 5, "volume_title": "Volume 5", "body": "<h1>Chapter 477 - Chapter 477: Chapter 474: The Meaning Of Fang Wang'S Existence</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 477: Chapter 474: The Meaning of Fang Wang’s Existence<br/><br/>Above the sea of clouds, a long stairway led to a massive circular platform, with a setting sun at its back. The sunlight bathed the entire firmament, causing rays of light thousands of feet long to radiate from the back of the platform, a spectacle of breathtaking beauty.<br/><br/>Atop the platform, Zhou Xue, Fang Hanyu, Fang Zigeng, and a dozen Jin Xiao Sect Cultivators stood, their gazes fixed ahead on a hundred-foot-tall figure seated in lotus position atop a floating seat. The lotus seat was a vibrant green, its petals tinged with ghostly images, a vision of exquisite beauty.<br/><br/>This was a man clad in a blue robe with the shadow of feathers, with a tall and sturdy frame and a kind face that radiated not the slightest trace of oppression. Instead, his aura was one of benevolence and sanctity.<br/><br/>He was the Divine Platform’s Saint Lord, Saint Lord Hunyuan!<br/><br/>“The Immortal Court is unjust and indeed deserves punishment, but even the full might of the Divine Platform might not suffice to discipline them,” Saint Lord Hunyuan said, his face showing a look of sorrow as he sighed.<br/><br/>Zhou Xue spoke calmly, “The Divine Platform is not the only force to act; the Immortal Court has its own troubles to contend with. Haven’t you been waiting for this opportunity? Moreover, the Heaven Emperor is about to ‘attain the Dao’.”<br/><br/>Attain the Dao!<br/><br/>At those words, Saint Lord Hunyuan’s expression changed instantly; he leaned forward, looking down at Zhou Xue and the others, and asked, “Is it true? How do you know this?”<br/><br/>Zhou Xue replied, “I have my ways of finding out. Besides, Saint Lord, consider this. Hasn’t it been many years since anyone has seen the Heaven Emperor? Even if what I say is false, it makes no difference to you, but if it’s true, you can’t afford to bet against it!”<br/><br/>The face of Saint Lord Hunyuan fluctuated between shades of cloud and sunshine.<br/><br/>Fang Hanyu’s curiosity swelled. He exchanged a glance with Fang Zigeng, and the brothers communicated through their eyes, wondering how Zhou Xue was privy to so much about the affairs of the Immortal Realm.<br/><br/>Following Zhou Xue to the Upper Realm, they had spent years turning peril into safety and reaping vast opportunities, their cultivation levels continually rising. Now, looking back on those years, they found it all to be unimaginable.<br/><br/>Now, Zhou Xue was leading them to meet with the Divine Platform’s Saint Lord, and they couldn’t help but be astonished.<br/><br/>How did she do it?<br/><br/>The world fell into silence, but Zhou Xue was in no hurry, waiting for Saint Lord Hunyuan to make his choice.<br/><br/>After a long time.<br/><br/>Saint Lord Hunyuan spoke, “Very well, the Divine Platform will launch an attack against the Immortal Court. Act as the opportunity arises!”<br/><br/>His tone had suddenly changed, no longer the affable demeanor of before.<br/><br/>Upon hearing this, Zhou Xue’s face broke into a smile. She saluted Saint Lord Hunyuan with a wave of her hand before turning to leave, with the others following closely behind her.<br/><br/>Saint Lord Hunyuan watched their departing figures, his gaze gradually cooling, his thoughts inscrutable.<br/><br/>…<br/><br/>Time in the Mortal Realm passed quickly, especially for a Cultivator of Kunlun.<br/><br/>On a mountain path, a young man in a loose-fitting Dao Robe was making his way. He appeared to be just over twenty, with an unkempt presence.<br/><br/>It was Fang Jing, all grown up.<br/><br/>On the mountain trail, he had been walking for ten full years. The higher he climbed, the more barriers he encountered, and at one spot, he remained stuck for two years, his resolve cast adrift in an Illusionary Realm, searching in vain for a way out.<br/><br/>“Grandfather, hurry up,” Fang Jing called out robustly as he strode forward, his voice echoing loud and clear.<br/><br/>Supreme Saint followed behind at a leisurely pace, his amiable smile watching the figure of Fang Jing.<br/><br/>At this moment, Supreme Saint had taken the form of an elderly man, frail and decrepit, showing none of the grandeur of a Great Saint.<br/><br/>“To have grasped the essence of my Dao in just ten years, is it his extraordinary talent, or does Kunlun hide mysteries that even I cannot see?” Supreme Saint wondered curiously.<br/><br/>During his years in Kunlun, his aversion to Fang Wang had completely dissipated, replaced by a fascination with the new Dao.<br/><br/>Despite having reached the pinnacle of the Saint Dao, the concepts of the Heavenly Dao still excited him.<br/><br/>He felt he could finally advance rather than stagnantly observe the Mortal Realm.<br/><br/>With their own thoughts, the two climbed onward, nearing the mountain’s summit, where they could see the semblance of the starry sky.<br/><br/>Fang Jing suddenly saw a person standing at the edge of the cliff, maintaining a fist-swinging pose, with the gentle breeze moving his robe and outlining the contours of his muscles, exuding a sense of strength.<br/><br/>It was none other than Yang Du!<br/><br/>Yang Du’s gaze flickered toward Fang Jing and the Supreme Saint, who were climbing the mountain, surprise evident in his eyes.<br/><br/>“How has this youth with such low cultivation come to this place?” Yang Du pondered in confusion; yet, seeing that the other’s features bore some resemblance to that Being, he seemed to recall something.<br/><br/>When Fang Jing passed by Yang Du, he still politely performed a salute.<br/><br/>After taking six steps, Fang Jing heard Yang Du’s voice from behind, “The Dao Master is generally not in the palace; you can look for him in the forest outside.”<br/><br/>At these words, Fang Jing couldn’t contain his excitement and turned to thank Yang Du again.<br/><br/>The Supreme Saint followed closely behind, directly ignoring Yang Du.<br/><br/>Thinking him to be Fang Jing’s servant, Yang Du paid him no further attention.<br/><br/>About half a day passed.<br/><br/>Fang Jing finally arrived at the top of Kunlun Mountain. Looking out, it seemed he was gazing upon a plain, with a gigantic palace in the distance and a forest beside it; the stars appeared just overhead, seemingly within reach.<br/><br/>“Is it there…”<br/><br/>Fang Jing looked toward the distant forest, barely containing his excitement at the thought.<br/><br/>He ignored the Supreme Saint behind him and stepped toward the forest.<br/><br/>However, after only a few steps, he felt an indescribable sensation as numerous, both alien and familiar images flashed before his eyes—all regarding himself.<br/><br/>It was as if forgotten memories were beginning to resurface.<br/><br/>This peculiar feeling immersed Fang Jing, driving him to see more.<br/><br/>He then saw a dream from his childhood, one that left a profound impression and remained unforgettable; the dream was now becoming clearer.<br/><br/>When he saw Fang Wang holding him in his arms, battling against the cultivators of the Emperor Sea Mysterious Dynasty, Fang Jing’s eyes widened, a certain light flickering within.<br/><br/>Unconsciously, he walked into the forest, drawing ever closer to Fang Wang.<br/><br/>Fang Wang sat in front of a stone table, head tilted back, gazing at the Firmament, lost in thought.<br/><br/>The Supreme Saint, having arrived before Fang Jing, spoke up, “Will this young man really be alright, despite being affected by the karmic ties of time and space?”<br/><br/>Fang Wang didn’t lower his gaze from the Firmament, responding, “Do you think now is the best moment?”<br/><br/>The Supreme Saint was taken aback, asking in confusion, “What moment?”<br/><br/>Fang Wang gave no reply.<br/><br/>At that moment, Fang Jing came to Fang Wang’s side and with a thud, knelt on one knee before him, his eyes turning red.<br/><br/>Clenching his teeth, he said, “Uncle, your son is naturally negligent and careless in his cultivation; I’ve let you down. If only I had diligently practiced, you wouldn’t have to face the Immortal Divines alone.”<br/><br/>He had already recalled his past life, those memories washing over him like heatwaves, stirring his emotions.<br/><br/>Fang Wang’s mouth curved into a smile as he said, “If I needed your help, then my existence would be meaningless.”<br/><br/>Fang Jing couldn’t help but look up in amazement at Fang Wang.<br/><br/>He saw Fang Wang raise a hand and wave it toward the starry sky.<br/><br/>With this wave, a vast gap appeared in the upper reaches of the starry sky. Immediately after, specks of silver light emerged from Kunlun, rapidly converging and connecting with the gap in the sky, solidifying into a long stairway that stretched all the way to the peak of Kunlun Mountain.<br/><br/>“Jing’er, do you dare to join me in causing an uproar in the Immortal Court?”\t\t\t\t\t\t</div>", "images": {}, "success": true}