{"id": 482, "url": "https://www.novelhall.com/i-became-an-immortal-on-mortal-realm-32879/15211280.html", "title": "Chapter 472 - Chapter 472: Chapter 469: The Mortal Realm'S Fate Clock", "volume": 5, "volume_title": "Volume 5", "body": "<h1>Chapter 472 - Chapter 472: Chapter 469: The Mortal Realm'S Fate Clock</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 472: Chapter 469: The Mortal Realm’s Fate Clock<br/><br/>Fang Wang made his way to the Mortal Realm beyond the heavens, where the void was dim, illuminated only by a handful of stars amidst the darkness.<br/><br/>He saw from afar the silhouette of the Supreme Saint, suspended in the darkness, draped in a white feathered robe that fluttered as his black hair danced in the wind, his entire being exuding an ethereal and mystical aura.<br/><br/>The Supreme Saint looked towards Fang Wang and asked with a smile, “Not yet a hundred years old and you have transcended; it seems you do not come from the present.”<br/><br/>Fang Wang flew up to face him, the two standing less than a hundred yards apart amidst the darkness.<br/><br/>“You do know that waiting for me to break through will leave you with regret,” said Fang Wang.<br/><br/>Before his Cultivation had stabilized, he had sensed the Supreme Saint’s presence, but the latter had not come to disturb him, opting instead to fly beyond the heavens, which Fang Wang found unexpected.<br/><br/>His experiences from his past life made him realize that the Supreme Saint was not so great, and could even be described as selfish. The Supreme Saint seemed to protect Xuanzu’s World, yet played with the lives of its beings as if they were mere amusements in his hands.<br/><br/>The Supreme Saint replied calmly with a smile, “If I were to be defeated, I could then let go of this obsession, and you could represent mortals in ascending to the heavens, creating the Heavenly Dao you desire.”<br/><br/>Upon hearing this, Fang Wang asked curiously, “Obsession? The Immortal Court cannot do anything to you, so what obsession could you have?”<br/><br/>“My obsession is that even though I am invincible, I cannot advance any further. I can feel that there exists higher realms and higher heavens in the great beyond, but I have never been able to touch them. I have remained in Xuanzu’s World, absorbing the continuous fate of the realm, yet I have made no progress,” said the Supreme Saint, his face showing a tinge of regret.<br/><br/>Fang Wang pressed on, “Why Xuanzu’s World?”<br/><br/>The Supreme Saint answered, “Naturally because Xuanzu is the strongest. After opening up the Mortal Realm, Xuanzu ascended to the Immortal Realm, where he became unrivaled, and in less than a million years, he stepped out of the Immortal Realm, venturing to places unknown to Cultivators.”<br/><br/>Is there another world beyond the Immortal Realm?<br/><br/>Fang Wang thought about the worlds he had sensed during his own breakthrough, where behind those Great Daos, there seemed to indeed be unknown and mysterious realms.<br/><br/>“All right, are you ready to battle me?” The words of the Supreme Saint brought Fang Wang’s thoughts back to reality.<br/><br/>The Supreme Saint raised his hand and a vast surge of Spiritual Power erupted from within him, condensing behind him into a colossal golden bell as large as a primordial mountain of creation. The bell was intricately etched with various heavens and earths, detailed enough to discern the figures of living beings moving about.<br/><br/>Fang Wang could sense the force of many rules from this giant golden bell; it could even be said that all the rules that constituted the world were present on the bell.<br/><br/>He also felt a force far deeper than the power of any worldly rules.<br/><br/>The power of the Great Dao!<br/><br/>Fang Wang was not afraid but rather filled with anticipation. He raised the Heavenly Palace Halberd in his hand, behind him appeared eighteen Heavenly Dao Suns, forming a spectacular ring, and amidst this ring unwound a black tome, the Mie Jue Divine Tome.<br/><br/>Seeing the Mie Jue Divine Tome, the Supreme Saint couldn’t help but remark, “The legacy of the Absolute Emperor is truly remarkable, it’s just a pity that I never had the chance to battle him. His comings and goings were enigmatic, impossible to track.”<br/><br/>Fang Wang laughed, “The Absolute Emperor was indeed formidable, but senior, you are not facing the Great Emperor, you are facing me, the Heavenly Dao.”<br/><br/>As his words fell, his aura surged, his body radiating dazzling heavenly silver light. The eighteen Heavenly Dao Suns trembled violently, releasing streams of Heavenly Dao True Fire like a host of dragons sweeping towards the Supreme Saint.<br/><br/>The Supreme Saint’s lips curled into a smile as the golden bell behind him resonated.<br/><br/>The sound of the bell echoed through every corner of the Mortal Realm, even startling the Celestial Court of the Upper Realm.<br/><br/>“Heavenly Dao, this is the Mortal Fate Bell condensed from a million years of my Dao cultivation. If you can defeat it, then you are worthy to challenge the Immortal Court, to turn the Upper Realm upside down!”<br/><br/>The Supreme Saint’s voice echoed throughout Xuanzu’s World, causing countless beings to be astonished.<br/><br/>Then, a phantom appeared in the Firmament, reflecting the figures of Fang Wang and the Supreme Saint. This scene shocked numerous beings, with countless creatures looking up in awe.<br/><br/>The Mortal Realm Fate Bell, representing the strongest force of the Saint Dao, clashed with Fang Wang’s Heavenly Dao True Fire. The two terrifying forces shook the void, causing the Three Thousand Rules of Power to distort.<br/><br/>Even in the void, areas started to break apart, with the energy of Jiu You surging from the depths of these broken regions. The Ghost Emperor appeared, peering into the darkness at the grand battle between Fang Wang and the Supreme Saint.<br/><br/>Boom! Boom! Boom…<br/><br/>Divine Skills bombarded one after the other, with the figures of Fang Wang and the Supreme Saint vanishing into the chaotic and fantastical spectacle of the rules.<br/><br/>Fang Wang swung his Heavenly Palace Halberd in a sweeping motion, but the Supreme Saint easily dodged it and stepped onto the blade of the halberd. Fang Wang felt an unprecedented weight pressing down on him, sending him plummeting down into the River of Time.<br/><br/>This was a pale space where a silently spiraling river stood, its ends invisible. As Fang Wang fell, myriad scenes of the Mortal Realm surrounded him.<br/><br/>Although he had reached the Transcendental Realm of the Heavenly Dao, he was barely over eighty years old in this life, and the accumulation of his own Heavenly Dao Force was still insufficient.<br/><br/>Though it was insufficient, it did not affect him much!<br/><br/>Fang Wang abruptly stopped, his body trembled, forcibly shattering this bewildering space and scattering the River of Time.<br/><br/>He looked up, and the Supreme Saint above him was suddenly pulled into the Eighteen Layers of Abi Hell, his eyes becoming dull and lifeless.<br/><br/>Fang Wang’s left hand reached up, unleashing the Great Returning Void Palm to directly crush the space where the Supreme Saint was, wiping him out both in body and spirit!<br/><br/>As that space turned into nothing, the universe seemed to have a gap in it. The Spiritual Energy that permeated the void crazily surged over, forming terrifying and spectacular torrents, raging to the extreme.<br/><br/>Fang Wang leaped up, and behind him, eighteen Heavenly Dao Suns appeared, gathering around him. The Mie Jue Divine Tome also orbited his body. He closed his eyes, and his entire being emitted a mysterious and vast aura.<br/><br/>In an instant, numerous bright stars appeared around him, densely packed and rapidly multiplying.<br/><br/>The Mortal Realm Fate Bell suddenly pressed down, and the Supreme Saint appeared unharmed on top of the bell.<br/><br/>Boom——<br/><br/>The Mortal Realm Fate Bell was resisted by the Heavenly Dao’s momentum, and the surrounding cosmic space collapsed visibly fast, affecting the entire universe. The Fate of the world in Xuanzu’s World began to surge, protecting heaven and earth.<br/><br/>As more and more cosmic space collapsed, more and more figures from the Underworld appeared, spreading in every direction of the universe. They all peered into the Mortal Realm from the darkness, and some even knelt down, paying tribute to the Supreme Saint.<br/><br/>Looking down at Fang Wang below, the Supreme Saint suddenly stomped his foot. Fang Wang instantly aged, his white hair wildly fluttering, and his skin covered in wrinkles. But in the next second, Fang Wang quickly recovered, returning to his previous youthfulness, full of vitality.<br/><br/>Fang Wang raised the Heavenly Palace Halberd in his hand, and suddenly a dark area appeared in the void behind the Supreme Saint. A massive coffin appeared, like the gaping maw of an ancient beast, aggressively swallowing the Supreme Saint.<br/><br/>Heavenly Emperor Imperial Mirror, Sixth Layer, Heavenly Emperor Coffin!<br/><br/>This coffin, exuding endless vastness and a breath of death, appeared and occupied most of the Firmament’s phantom, astounding all living beings.<br/><br/>Inside Emperor’s Tomb Island, a golden-haired monkey lying on the cliff widened its eyes with a look of utter disbelief. It muttered to itself, “How can he… and also…”<br/><br/>It felt that Fang Wang’s Heavenly Emperor Imperial Mirror was stronger than its own!\t\t\t\t\t\t</div>", "images": {}, "success": true}