{"id": 485, "url": "https://www.novelhall.com/i-became-an-immortal-on-mortal-realm-32879/15212436.html", "title": "Chapter 475 - Chapter 475: Chapter 472 Heavenly Dao Returning Void!", "volume": 5, "volume_title": "Volume 5", "body": "<h1>Chapter 475 - Chapter 475: Chapter 472 Heavenly Dao Returning Void!</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 475: Chapter 472 Heavenly Dao Returning Void!<br/><br/>Fang Wang’s eyes burst forth with brilliant silver light, turning the originally desolate and dim cosmic space into a daylit one, and even the Supreme Saint lost his color amidst the silver radiance.<br/><br/>The pupils of the Supreme Saint dilated, filled with disbelief.<br/><br/>“What is this… Divine Skill…”<br/><br/>The silver light completely engulfed the Supreme Saint and devoured the entire universe, consuming everything.<br/><br/>Far away in the Immortal Court, the Immortal Divine were also disturbed, and the enormous Golden Stele even began to crack, shaking more and more violently until it seemed about to burst.<br/><br/>This terrified the Immortal Divine, who each cast spells, using their own Mana to reinforce the enormous Golden Stele.<br/><br/>The Eighteen Divine Pillars were also casting spells with grim expressions, even facing the aftermath of Fang Wang’s Divine Skills was immensely challenging for them.<br/><br/>“Not good! We can’t hold it back!”<br/><br/>“What’s happening, are they trying to invade the Immortal Court?”<br/><br/>“We must protect the Stele, or the consequences will be endless!”<br/><br/>“Damn it, what kind of realm is this, how can it be so powerful…”<br/><br/>The Immortal Divine cursed repeatedly, their words laden with panic.<br/><br/>With a boom!<br/><br/>The enormous Golden Stele suddenly exploded, the terrifying shockwave flinging all the Immortal Divine away, sweeping across the Sea of Clouds, and rolling towards the horizons in every direction.<br/><br/>Even the mighty Immortal Divine were like ants in the face of this force, utterly powerless!<br/><br/>…<br/><br/>Within the pale space, fragments of space of different colors floated about, twinkling like stars in various directions.<br/><br/>The Supreme Saint stood suspended, his body trembling nonstop, covered in cracks like a statue about to split open, not bleeding, but with wisps of eerie gray gas seeping from the cracks on his surface.<br/><br/>Following his gaze, Fang Wang stood in the distance, not too far from him.<br/><br/>Fang Wang was examining his own right hand, the Heavenly Palace Halberd stood beside him, the Purple Dragon Soul flaring like flame behind him, with eighteen Heavenly Dao Suns floating magnificently.<br/><br/>In the palm of Fang Wang was a silver orb floating, its surface entwined with strands of gray gas, very similar to the gray gas emanating from the Supreme Saint.<br/><br/>“This is… which Divine Skill…” the Supreme Saint asked with difficulty.<br/><br/>Fang Wang lifted his eyes, his gaze so indifferent, and he said softly, “Let’s call it Heavenly Dao Returning Void.”<br/><br/>To render all to nothingness!<br/><br/>What Fang Wang was holding in his hand now was everything the Supreme Saint had wrought.<br/><br/>His life, his karmic ties, his soul, his Divine Skills and spells, and so forth, everything about him was in Fang Wang’s hands, and with just a squeeze, Fang Wang could make the Supreme Saint vanish completely.<br/><br/>This was the Divine Skill that Fang Wang had created for the Transcendental Realm of the Heavenly Dao!<br/><br/>Heavenly Dao Returning Void, making the transcended fall into something the holder could manipulate at will, with life and death no longer in one’s own control!<br/><br/>At this moment, the Supreme Saint felt fear, realizing that he might truly fall, never to rise again.<br/><br/>He gritted his teeth, and said in a trembling voice, “I’ve been defeated…”<br/><br/>Fang Wang looked at the Supreme Saint and said, “Your Divine Skills are not enough.”<br/><br/>He tossed the silver orb behind him, and immediately after, the orb fell into one of the Heavenly Dao Suns and disappeared without a trace.<br/><br/>The Supreme Saint gave a bitter smile and said, “What do you want me to do…”<br/><br/>“First, impart the Great Withering Heavenly Divine Art to me, and from then on, propagate the teachings in Wangdao and gradually redeem your sins,” Fang Wang said calmly.<br/><br/>All of the Supreme Saint existed within Fang Wang’s Heavenly Dao Sun, and with just a thought, the Supreme Saint would be annihilated, never to exist again.<br/><br/>The gray aura leaking out from the Supreme Saint began to stagnate, then retract into his body, gradually restoring his surface. This gray aura was his cultivation. As the cultivation returned to his body, his injuries would heal.<br/><br/>The Supreme Saint took a deep breath and began to elucidate the true meaning of the Great Withering Heavenly Divine Art.<br/><br/>The cosmic void had not yet recovered, and Fang Wang was in no hurry to return, listening intently to the Supreme Saint’s narration.<br/><br/>…<br/><br/>Time flew like a shuttle, the sea turned into mulberry fields, the heavens and the earth kept changing, only the mortal world continued as ever.<br/><br/>Descending Dragon Continent, Kunlun.<br/><br/>Kunlun soared into the clouds, its summit unseen, surrounded at mid-mountain by a sea of clouds. This foremost mountain occupied nearly ten thousand miles of land, stretching south to Canghai and north to the ice fields.<br/><br/>At the foot of Kunlun Mountain, Sword Heaven Marsh appeared so tiny, bordered by lakeside pavilions, where numerous cultivators practiced their cultivation.<br/><br/>Looking along Sword Heaven Marsh, at the base of Kunlun Mountain, three figures stood before a long staircase—a couple and a young boy.<br/><br/>The woman was beautiful and dignified, radiating a noble aura, as if an immortal had descended to earth. The man standing on the other side of the boy was handsome and appeared unruffled by the wind, in a white garment, bearing some resemblance to Fang Wang.<br/><br/>“Father, does this whole mountain belong to Uncle?” the boy asked, appearing to be only eleven or twelve years old, his eyes bright and lively.<br/><br/>Fang Xun rubbed the boy Fang Jing’s head and smiled, “Yes, your uncle is up on the mountain. When we get up there, don’t forget the proper etiquette when you meet him.”<br/><br/>Fang Jing nodded obediently, his eyes full of anticipation.<br/><br/>The family of three began to ascend the steps, making their way upward.<br/><br/>The mountain path was rugged, and the stairs not too wide, just barely wide enough to accommodate the three of them walking side by side. Before long, Fang Jing had fallen behind.<br/><br/>The rocks were like statues, sharp and towering, and the path was wrapped in mist, making the stairs above seem endless, as if one could never reach the end.<br/><br/>Fang Xun’s wife, Yi Xiuyang, looked back with a tender expression, spoke softly, “Husband, he’s still so young, do we really need to make him climb the mountain step by step?”<br/><br/>“This is the rule of Kunlun. Those who seek the Dao must climb step by step. The opportunity of the Dao lies wherever you reach. Even with my and elder brother’s connections, there is no exception,” Fang Xun replied, shaking his head with a tone full of emotion.<br/><br/>Speaking of his elder brother, his own feelings surged. He had not seen Fang Wang since he was born. If it wasn’t for the family members saying Fang Wang was his elder brother, he might not even believe it.<br/><br/>Fang Wang was now the most revered existence in the Fang Family; there was even a divine image of him at home.<br/><br/>Since embarking on the path of cultivation, Fang Xun had been living under a great spotlight. Wherever he went, people were willing to help him. He did not get lost in it, however, but became even more cautious, afraid of tarnishing his elder brother’s reputation.<br/><br/>After hearing this, Yi Xiuyang could only nod.<br/><br/>They continued climbing the mountain.<br/><br/>Half an hour later, Fang Jing’s steps began to tremble.<br/><br/>It wasn’t that his physique was weak, but the mountain held restrictions. At this moment, he felt as though he was carrying a heavy burden, utterly exhausted, each step seemed like his limit.<br/><br/>He struggled to lift his head and saw his parents a dozen steps ahead waiting for him. The mist on the mountain road could engulf them at any moment.<br/><br/>“Damn it…”<br/><br/>Fang Jing clenched his teeth, braced his hands on his knees, and continued forward.<br/><br/>Since his childhood, he had been a prodigy. His talent for cultivation was revealed at the age of six. Coming to Kunlun this time to seek the Dao, the entire Fang Family had placed great expectations on him, hoping he would receive his uncle’s true inheritance.<br/><br/>Suddenly.<br/><br/>He heard footsteps behind him. Before he could turn around, a figure flashed by him, striding forward with great steps. In a blur, he saw a woman, like an immortal, her white dress carrying a fragrance as she swept by.<br/><br/>Fang Xun and Yi Xiuyang were also startled. They watched the back of the white-clothed woman, thinking to themselves how swift she was.\t\t\t\t\t\t</div>", "images": {}, "success": true}