{"id": 486, "url": "https://www.novelhall.com/i-became-an-immortal-on-mortal-realm-32879/15212437.html", "title": "Chapter 476 - Chapter 476: Chapter 473: The Source Of Everything", "volume": 5, "volume_title": "Volume 5", "body": "<h1>Chapter 476 - Chapter 476: Chapter 473: The Source Of Everything</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 476: Chapter 473: The Source of Everything<br/><br/>Fang Xun and Yi Xiuyang felt an even greater pressure than Fang Jing; they too could quicken their pace, but they could not stride as nimbly as the woman in white from before. After all, they were still at the foot of the mountain, and who knows how far away the midway up the mountainside might be.<br/><br/>“Rumor has it that a cultivator from the Taiqing Xuanjiao took a year to reach Yuqing Pass by foot, and to this day, no one has truly witnessed the Heavenly Dao. The woman earlier ran so fast, she probably had her own objectives.”<br/><br/>Yi Xiuyang sighed, having long heard of Kunlun’s difficulty, yet only upon truly setting foot on Kunlun Mountain did she understand the arduousness of the path to seeking the Dao.<br/><br/>She felt that relying solely on their efforts, it would be impossible to reach the summit, but she was not discouraged, after all, Fang Xun was the biological brother of the Heavenly Dao, the Heavenly Dao wouldn’t have them walk their whole lives, right?<br/><br/>Fang Xun looked back and smiled, “Jing’er, aren’t you coming quicker? If you fall behind, we won’t wait for you.”<br/><br/>Fang Jing thought his father was joking and didn’t respond. In truth, he was also too out of breath to speak.<br/><br/>He continued his laborious ascent; gradually, his focus could only remain on the steps beneath his feet, lacking the energy to look up.<br/><br/>As dusk fell, the moonlight spread over the stone steps of the Kunlun Mountain path. Fang Jing was truly exhausted and began to lie down, taking deep breaths.<br/><br/>“Dad… Mom… I…”<br/><br/>Fang Jing said weakly, but he received no response.<br/><br/>At first, he didn’t realize anything was amiss and only after a long while did he sense something was wrong. He struggled to lift his head and saw that his parents were no longer in sight further up the steps. Panic immediately struck him, and he began to call out for his parents, but no matter how loudly he called, there was no sign of them.<br/><br/>A torrent of aggrieved emotions swelled up in Fang Jing’s heart.<br/><br/>It didn’t take long before he couldn’t bear it any longer and began to sob uncontrollably, yet regardless of his crying, Fang Xun and the other remained absent.<br/><br/>Half an hour later, Fang Jing’s emotions returned to calm.<br/><br/>He looked up once more, and suddenly he felt that even without his parents, the quiet stone steps didn’t seem so frightening anymore.<br/><br/>This was his great-uncle’s mountain; there certainly would be no danger.<br/><br/>For some reason, Fang Jing had always had immense trust in his great-uncle since childhood. Whenever he thought of his great-uncle, his spirits would lift.<br/><br/>This feeling was very peculiar; although he had never met his great-uncle, he had dreamt of him.<br/><br/>In his dream, both his parents had passed away, and he lived a life reliant on others. His great-uncle came to his rescue, and together they fought enemies in a fraught and perilous journey…<br/><br/>This dream had occurred just a month before, and he hadn’t told his parents, after all, the dream wasn’t very polite concerning his parents.<br/><br/>Fang Jing got up once again and continued his climb.<br/><br/>He couldn’t let his great-uncle down!<br/><br/>With such a tenacious resolve, Fang Jing climbed faster and faster, his posture becoming more erect. Unbeknownst to him, nature’s spiritual energy was gathering around him.<br/><br/>Meanwhile.<br/><br/>At the summit of Kunlun Mountain, where one could look up to see the dazzling Milky Way, was the highest point in the Mortal Realm. There was a huge Dao Palace with a forest in front of it, and a small pavilion within the woods; Fang Wang and the Supreme Saint were inside the pavilion, drinking tea.<br/><br/>“It’s been three hundred years since our battle concluded, and your Dao cultivation is now even more unfathomable to me; you seem to be comprehending the rules of time and space, already affecting the myriad of living beings,” remarked the Supreme Saint with a sense of wonder.<br/><br/>Since Fang Wang defeated the Supreme Saint, three hundred years had passed. During this time, Fang Wang devoted himself to building Kunlun, which has now been established.<br/><br/>The highest peak of Kunlun soars ninety thousand feet high, with its prohibitions numbering over ten thousand, impossible to quantify. The spiritual energy of the Mortal Realm was converging towards Kunlun, which had been open for nearly a hundred years. Every day, living beings attempted to ascend the mountain, yet so far, no one could reach the summit on foot.<br/><br/>Wangdao Cultivators had already settled in Kunlun, from half way up the mountain, figures of Disciples of the Way of Hope pondering the Dao could be seen everywhere.<br/><br/>Fang Wang asked, “In your eyes, is this kind of intervention selfish?”<br/><br/>The Supreme Saint pondered and said, “It’s hard to say. It seems you only intervene with those who have a karmic connection to you, but even so, it still affects all beings. As your influence spreads, the mortal realm’s fate is rising ever faster. When the Heavenly Gate fully opens, the mortal realm should be better equipped to deal with it.”<br/><br/>Fang Wang revealed a smile. He looked up at the starry sky, muttering to himself, “This time, I don’t want to wait for them to come down. I’m going to seek them out myself.”<br/><br/>The Supreme Saint was not surprised but instead expressed his emotions, “With your strength, it wouldn’t be difficult to suppress the Immortal Court now. Looking across the Immortal Realm, there are hardly any who could be your match.”<br/><br/>The Supreme Saint had truly felt the overwhelming power of the detached Heavenly Dao; all that he was still lay within the Heavenly Dao Returning Void.<br/><br/>Divine Skills that even detached Immortal Monarchs could not withstand, he couldn’t think of anyone who could handle them.<br/><br/>What was most crucial was that since the battle between the two of them ended, over these three hundred years, the Supreme Saint had clearly sensed that Fang Wang’s cultivation was still rapidly increasing.<br/><br/>It was too terrifying!<br/><br/>The Supreme Saint had also tried to understand the Heavenly Dao over the years. The more he understood, the more he felt that the Heavenly Dao was the true Dao. The so-called Saint Dao, Imperial Dao, and the Path of Immortality that the Immortal Court practiced might be wrong, deviating from the Dao of nature itself and possibly being the wrong path.<br/><br/>Fang Wang followed up by saying, “If ten thousand time-spaces were to merge, then the hatred faced by the Immortal Divine would also be immeasurable. With so many different timelines of time-space, the Immortal Court has an inescapable responsibility.”<br/><br/>The Supreme Saint did not contest but chuckled, “Toying with time-space is to toy with karmic causality. Too many powers in the Immortal Realm perished in this calamity. It seems as though some force is balancing everything, preventing time-space from expanding indefinitely.”<br/><br/>Fang Wang had also noticed that force, but even with his detached Heavenly Dao cultivation, he could not completely see through it.<br/><br/>He was now contemplating the rules of time-space while merging his past time-space experiences with the present. This was a Great Dao Power, above the three thousand rules, and even the Immortal Divine would struggle to detect it.<br/><br/>“You should go down for a visit,” Fang Wang spoke.<br/><br/>Upon hearing this, the Supreme Saint, driven by curiosity, asked, “To do what?”<br/><br/>“Walk down the mountain path, and someone will ask you to stop. When you see him, whatever you feel like doing, do that.”<br/><br/>Hearing Fang Wang’s intentionally cryptic statement, the Supreme Saint became interested, immediately rose, and walked towards the forest edge.<br/><br/>Once the Supreme Saint had left, Fang Wang’s right hand swept over the stone table. Subsequently, the stone table’s surface began to twinkle with specks of silver light, those lights converging into a silhouette, its true appearance indiscernible.<br/><br/>This figure knelt, hands covering its head, as if screaming loudly, sometimes bowing down as though pleading.<br/><br/>Looking at this figure, the expression in Fang Wang’s eyes gradually changed.<br/><br/>“So it’s you…”<br/><br/>Fang Wang muttered to himself, his tone carrying a hint of emotion.<br/><br/>He was deducing karmic causes, tracing back to the origins of everything.<br/><br/>Before this reincarnation, he had eight other reincarnations, but these were not the origin of his reincarnation journey. Earlier in the past, someone was desperately reincarnating, employing a different method, wishing to help Fang Wang survive in the cycle of reincarnation.<br/><br/>Fang Wang didn’t understand why he was doing this. Watching him plead, Fang Wang was filled with confusion.<br/><br/>As he watched, Fang Wang suddenly realized he was not begging.<br/><br/>He was afraid!\t\t\t\t\t\t</div>", "images": {}, "success": true}