{"id": 481, "url": "https://www.novelhall.com/i-became-an-immortal-on-mortal-realm-32879/15211279.html", "title": "Chapter 471 - Chapter 471: Chapter 468 Heavenly Dao Transcends!", "volume": 5, "volume_title": "Volume 5", "body": "<h1>Chapter 471 - Chapter 471: Chapter 468 Heavenly Dao Transcends!</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 471: Chapter 468 Heavenly Dao Transcends!<br/><br/>Descending Dragon Continent, Sword Heaven Marsh.<br/><br/>Countless cultivators and demons looked up in awe at the distant and imposing Kunlun, where halfway up Kunlun Mountain, a huge silver light shone, illuminating the entire continent.<br/><br/>The silver light continued to expand, connecting heaven and earth as if a gigantic silver sun hung on the mountainside of Kunlun, threatening to overshadow Kunlun itself.<br/><br/>More and more cultivators began to kneel in worship, and demons began to prostrate themselves, as if praying to a True Immortal of the Mortal Realm.<br/><br/>On the mountainside, the Sword Saint sat still, facing Fang Wang and looking at him with a glint of silver light shimmering all over his body, his eyes filled with a touch of emotion.<br/><br/>The grand silver light rose and converged above Fang Wang’s head into a silver sun, the Heavenly Dao Sun, with countless tiny stars ascending and merging into the silver Heavenly Dao Sun. On each star stood a silhouette of Fang Wang’s future selves, representing every single second of the future.<br/><br/>Bathing in the silver light, Fang Wang’s features were obscured, and his aura climbed higher and higher, as the laws of heaven and earth, the Spiritual Energy, began to stir violently.<br/><br/>At this moment, Fang Wang had entered a mysterious state.<br/><br/>His consciousness found itself in a dim expanse of void, and looking downward, he saw myriad Mortal Realms not situated on the same plane, but existing in an indescribable manner, each disconnected from the others.<br/><br/>More than a thousand Mortal Realms, and if one looked through the law of space and time, each Mortal Realm had countless branches, complex and vast to the extreme. Even at his current level, he would find it overwhelming and headache-inducing, as too many rules would assault his soul, giving him a sense of disorientation.<br/><br/>But he was not fearful, rather more exhilarated.<br/><br/>This was the feeling of a breakthrough!<br/><br/>Fang Wang suddenly looked up, peering above. He saw a world that was far more vast than the Mortal Realm, where all the laws were incredible, and a force stronger than the laws of heaven and earth enveloped the entire world.<br/><br/>The Great Dao!<br/><br/>“To leap beyond the past, present, and future, transcending the three thousand laws, not bound by karma and reincarnation, is to be in the Transcendental Realm of the Heavenly Dao!”<br/><br/>Fang Wang murmured to himself. As the words “Transcendental Realm of the Heavenly Dao” were spoken, his conscious avatar burst forth with a ring of brilliant silver light, sweeping across the void, reaching all Mortal Realms, brushing past the mysterious great world above, and extending onward to the point where Fang Wang even sensed worlds unseen brushed by his light of the Heavenly Dao.<br/><br/>His entire being began to undergo a metamorphosis, as the Great Dao Power, more hidden than the laws of heaven and earth, surged into his body, aiding his transformation.<br/><br/>His Heavenly Dao Force was transforming, his body was transforming, his soul was transforming, even his divine consciousness was undergoing transformation.<br/><br/>Such change was truly wonderful!<br/><br/>Time swiftly passed by.<br/><br/>In the real world, days and nights cycled. Even in the darkness, Kunlun remained bathed in daylight. All beings touched by the light of the Heavenly Dao felt no discomfort; on the contrary, they entered a state of enlightenment, achieving progress together.<br/><br/>The entire Descending Dragon Continent fell into silence, a peace that was tranquil rather than oppressive.<br/><br/>Spiritual Energy coursed between heaven and earth like an immortal mist sweeping across the mountains and earth, possessing the tremendous momentum to devour heaven and earth.<br/><br/>Fang Wang’s breakthrough took a full month!<br/><br/>After one month, the Heavenly Dao Sun atop Kunlun Mountain suddenly vanished, and the continent dimmed instantly, welcoming the night.<br/><br/>The Sword Saint opened his eyes, looking at Fang Wang sitting opposite the chessboard. There didn’t seem to be much change in him, but the Sword Saint could keenly sense his transformation.<br/><br/>He was certain that Fang Wang’s breakthrough was a success.<br/><br/>“I’m truly fortunate in my three lives…”<br/><br/>At that moment, the Sword Saint felt pride for Fang Wang, believing that it was not he who had chosen Fang Wang, but Fang Wang who had chosen him.<br/><br/>Meanwhile.<br/><br/>In the Western Mortal Realm, amid vast seas, violent waves churned. At the horizon of the sea level, a black column of gas rose from the seafloor, striking the firmament and causing the rolling thunderclouds to ripple outwards and lightning to weave through them.<br/><br/>A colossal ship remained stationary amidst the turbulent waves, enveloped by mysterious formations that kept it steadfast in the midst of the fearsome swells.<br/><br/>Dozens of cultivators stood on the ship, all looking towards the enigmatic black column of gas.<br/><br/>“What in the world is that? A demon born?”<br/><br/>“No, this oppressive feeling doesn’t seem like Demonic Qi.”<br/><br/>“Such a vast aura, could it be that a treasure has been born?”<br/><br/>“Are we really not leaving?”<br/><br/>“Wait a little longer, if there’s real danger, it’s not too late to flee.”<br/><br/>The cultivators on the ship were all talking at once, some excited and anticipatory, others tense and uneasy.<br/><br/>Suddenly.<br/><br/>The black column of air exploded, terrifying waves swept across all directions, the formation protecting the ship shattered instantly, and all the cultivators on board were thrown into disarray, with some even falling into the raging waters.<br/><br/>The thunderclouds in the sky dispersed, and sunlight spilled down.<br/><br/>A drenched male cultivator looked up, his eyes widening and his mouth opening unconsciously, as the silhouette of a figure reflected in his eyes.<br/><br/>A man with his upper body bare floated in the air, enveloped in scorching white vapor, his wet black hair quickly dried and floated in the air.<br/><br/>His face was stern, with mysterious golden wheels spinning in his pupils.<br/><br/>If Fang Wang were here, he would have recognized his identity immediately.<br/><br/>Supreme Saint!<br/><br/>The Supreme Saint glanced at the cultivators on the ship below, then looked at his own hands and murmured to himself, “This body is not bad.”<br/><br/>He then lifted his gaze and looked toward the horizon, feeling an incomparably immense aura.<br/><br/>The Heavenly Dao was breaking through!<br/><br/>Interest flickered in his eyes as he continued to talk to himself, “Transcendence, eh… truly formidable achievements. If that’s the case, then I shall wait for your breakthrough.”<br/><br/>He leaped up and disappeared into the Firmament above.<br/><br/>…<br/><br/>Kunlun.<br/><br/>It had been ten years since the Heavenly Dao Sun disappeared, and Fang Wang had remained seated in meditation, not once opening his eyes.<br/><br/>Sword Saint had also made a breakthrough in these years, cultivating by Fang Wang’s side, which greatly enriched his understanding. His cultivation progressed daily, and this wonderful feeling was too good to give up and leave.<br/><br/>Suddenly.<br/><br/>Sword Saint seemed to sense something, his eyes snapping open. He felt a slight change in the entire world, but he couldn’t pin down exactly what it was.<br/><br/>Fang Wang, who was sitting opposite him, slowly stood up, and only when he was fully upright did he open his eyes.<br/><br/>Fang Wang raised his right hand and condensed the Heavenly Palace Halberd.<br/><br/>With the appearance of the Heavenly Palace Halberd, a tremendous momentum surged towards Sword Saint.<br/><br/>Sword Saint had long known that Fang Wang’s greatest strength was not the Sword Dao, but even so, he was astonished when he saw the Heavenly Palace Halberd.<br/><br/>This Divine Weapon is extraordinary!<br/><br/>Fang Wang’s mouth curved into a smile as he said, “Thank you, Master, for your companionship over these years. I have now created the Transcendental Realm of the Heavenly Dao, and there happens to be an opponent waiting for me.”<br/><br/>Transcendental Realm of the Heavenly Dao?<br/><br/>Before Sword Saint could ask, Fang Wang turned into a streak of silver light and shot into the sky, dazzlingly bright, and at that moment, beings all over the Mortal Realm could see a silver light rising at the edge of the sky, like a meteor ascending.<br/><br/>“Transcendence…”<br/><br/>Sword Saint’s eyes twinkled. His gaze moved to the chessboard, and in an instant, every chess piece conjured the shadow of a sword.\t\t\t\t\t\t</div>", "images": {}, "success": true}