{"id": 480, "url": "https://www.novelhall.com/i-became-an-immortal-on-mortal-realm-32879/15199399.html", "title": "Chapter 470 - Chapter 470: Chapter 467: Wrapping Everything Up, Transcendence!", "volume": 5, "volume_title": "Volume 5", "body": "<h1>Chapter 470 - Chapter 470: Chapter 467: Wrapping Everything Up, Transcendence!</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 470: Chapter 467: Wrapping Everything Up, Transcendence!<br/><br/>The Great Saint’s words echoed throughout the Mortal Realm, the overbearing divine might making countless Cultivators feel uneasy and causing those who had lived for over a thousand years to harbour a sense of fear.<br/><br/>However, the Mysterious Great Saint uttered only a single sentence, and its pressure quickly dissipated, after which his voice was no longer heard, it was as if what had been heard before was an illusion.<br/><br/>Atop Kunlun Mountain.<br/><br/>The Sword Saint had waited for a long time but still hadn’t seen the Great Saint appear, which made him even more curious about Fang Wang’s strength.<br/><br/>In his understanding, a Great Saint and an Immortal Divine were equals in strength, and the Descending Dragon Great Saint, though dead, had died amidst an onslaught from a multitude of Immortal Divines.<br/><br/>Little did he know that the legends he was familiar with were deliberately beautified by the Dragon Mountain.<br/><br/>Fang Wang was in a critical phase of his enlightenment; from high above, the number of silver lights on Kunlun Mountain increased, showing a trend reminiscent of a spark setting a prairie ablaze.<br/><br/>All those silver lights were avatars of Fang Wang!<br/><br/>This sight was also witnessed by the Wangdao and Tiangong Sect Cultivators, all of whom were slack-jawed in astonishment, not understanding what technique Fang Wang was practicing, but the sight of his figure covering the mountains and plains was truly spectacular.<br/><br/>“Are all those figures the Dao Master’s?”<br/><br/>“Look over there, there are even more appearing.”<br/><br/>“Is this the method of an Immortal? To have so many avatars.”<br/><br/>“So it’s all true, I had heard before that the Wangdao Master used avatars to help our Tiangong Sect Cultivators move mountains and shift structures.”<br/><br/>While those Cultivators were still discussing this, Fang Wang’s thoughts plunged deeper into the realm of rules.<br/><br/>Over the years, he had perceived time and space, catching glimpses of the time-space rules hidden deeper within the cosmos, and contemplated their subtleties.<br/><br/>These avatars all originated from different times, they were the forms of Fang Wang at various moments in his past cultivation journey, refined down to every single second of his past.<br/><br/>Gradually, Fang Wang began to extend his thoughts toward the future.<br/><br/>From the time rules extending into the future, since the future was yet unborn, this involved karmic rules; everything in the world evolves according to karma, the thoughts and instincts of all beings converge into karmic threads, weaving a complex web of destiny, with any single choice possibly birthing different futures, hence the future is more complex than the past.<br/><br/>Unknowingly, Fang Wang began to deduce the future.<br/><br/>He saw countless possibilities for himself, he looked a thousand years ahead, but when it came to the Immortal Divines of the Upper Realm, the visions of the future would break off.<br/><br/>Fang Wang was somewhat discontented, could he still not comprehend the Upper Realm’s karmic rules?<br/><br/>After all, he had been to the Upper Realm.<br/><br/>With that thought, he created an avatar, this avatar was manifested through the Xuan Yuan Divine Transformation and looked exactly like him, even the aura was identical.<br/><br/>The avatar immediately applied The Heaven of Carefree Freedom and headed for the Upper Realm.<br/><br/>Before long, as Fang Wang deduced the future, he finally managed to envision the figure of an Immortal Divine.<br/><br/>Indeed, allowing the avatar to hide in the Upper Realm and perceive the Upper Realm’s cosmic rules made it possible for the original self to deduce the Upper Realm’s karmic causes.<br/><br/>Gradually, the past avatars that covered the mountains all walked into Fang Wang’s body, whereas the future avatars did not emerge from the silver light; instead, they appeared atop those tiny stars, as if birthed by the stars themselves.<br/><br/>The Sword Saint stared intently at Fang Wang, witnessing the silver stars around him, he, too, gained some insights.<br/><br/>In his pupils began to reflect the scenes of the future, he even saw his own transcendence.<br/><br/>…<br/><br/>Beneath the starry sky, a vast nebula resembled an upturned palm, within which lay numerous universes; in one such universe was a palace surrounded by countless floating meteorites, forming a magnificent belt.<br/><br/>Inside the palace, the floor was like ice crystals, emitting a chill. Enigmatic quadruped beasts coiled around each stone pillar, their specific species indistinct.<br/><br/>A man was seated in the primary position in the main hall, dressed in loose black garments that revealed strong, muscular pectorals brimming with a sense of power, his black hair casually splayed out in a wild manner.<br/><br/>He was the Wrathful God Luo, one of the Four Great War Gods of the Immortal Court!<br/><br/>The eyes of Wrathful God Luo slowly opened, resembling two Purgatories burning with the fires of sin within them.<br/><br/>“Come in,”<br/><br/>said Wrathful God Luo as he spoke. The moment his words fell, a spatial rift formed above the grand hall, and the Fortune and Prosperity Immortal stepped out from it.<br/><br/>With a beaming smile, Fortune and Prosperity Immortal said, “Wrathful God Luo, you’ve been in seclusion for forty thousand years. Are you still troubled by that battle?”<br/><br/>Wrathful God Luo’s face remained expressionless as he asked, “Did the Immortal come here just to mock me?”<br/><br/>Fortune and Prosperity Immortal shook his head and replied, “Of course not. It’s because I’ve divined that the Immortal Court is facing imminent peril. Aside from the ever-watchful Divine Platform, an even greater doom is approaching.”<br/><br/>Upon hearing this, Wrathful God Luo couldn’t help but frown.<br/><br/>He too had been restless recently, unable to enter deep meditation. Having never felt this way before, his rising anger dissipated at the words of Fortune and Prosperity Immortal.<br/><br/>“May I ask what the Immortal has divined and where the danger lies?” Wrathful God Luo inquired.<br/><br/>“I can’t ascertain it, but it likely originates from the Mortal Realm. The karmic ties of the Supreme Saint have reappeared; he is preparing to resurrect. However, the peril should not be with him, as he has a good relationship with the Immortal Court. He too might have sensed the crisis,” answered Fortune and Prosperity Immortal.<br/><br/>“The Supreme Saint is resurrecting? Can such a demon exist in the Mortal Realm?” asked Wrathful God Luo, piqued with interest.<br/><br/>“Heh, don’t forget, someone has also suffered in the Mortal Realm. As long as he remains, any number of situations could emerge,” Fortune and Prosperity Immortal replied with a chuckle.<br/><br/>Feeling that made sense, Wrathful God Luo nodded in agreement.<br/><br/>Fortune and Prosperity Immortal continued, “The movements of Lingxiao Saint Emperor have become increasingly significant. He’s inching closer to betraying the Immortal Court. Should one of the Four Great War Gods fall, the Immortal Court might face collapse. We must prepare in advance. When I mentioned the Absolute Emperor earlier, it wasn’t to mock you, Luo, but because the Absolute Emperor has appeared.”<br/><br/>“The Absolute Emperor has appeared?”<br/><br/>Wrathful God Luo abruptly stood up, his eyes wide open, his chest heaving violently, his entire being exuding an extremely dangerous aura.<br/><br/>The great hall trembled, and the Dao Robe of Fortune and Prosperity Immortal billowed violently.<br/><br/>Facing the enraged Wrathful God Luo, Fortune and Prosperity Immortal remained calm and said, “The appearance of the Absolute Emperor may be related to the peril. He once went to the Mortal Realm for unknown purposes. His emergence this time may enable us to discover something.”<br/><br/>A ferocious smile appeared on Wrathful God Luo’s face as he said, “Very well, very well, this is excellent! I will find him. Over the years, I’ve been cultivating my Divine Skills. I will certainly be able to withstand his Mie Jue Divine Tome!”<br/><br/>Just then, a piece of purple jade barrier beside them suddenly shattered, startling both Wrathful God Luo and Fortune and Prosperity Immortal, who turned to look.<br/><br/>Fortune and Prosperity Immortal immediately began to calculate with his fingers. After a moment, his expression drastically changed.<br/><br/>“How is this possible! Someone has transcended!”<br/><br/>Fortune and Prosperity Immortal exclaimed incredulously. Wrathful God Luo’s eyes instantly reddened as he followed the calculation, but he could not discern anything.<br/><br/>Wrathful God Luo asked gravely, “Who is it? Is it the Nine-Faced Divine Net or someone from the Divine Platform?”<br/><br/>Looking utterly disconcerted, Fortune and Prosperity Immortal said, “I can’t calculate it; he is currently retracting all his karmic ties. This process is affecting the Great Dao. There hasn’t been such a being born for a million years…”\t\t\t\t\t\t</div>", "images": {}, "success": true}