{"id": 489, "url": "https://www.novelhall.com/i-became-an-immortal-on-mortal-realm-32879/15220614.html", "title": "Chapter 479 - Chapter 479: Chapter 476: Hurry And Ask His Majesty To Come Out Of Seclusion!", "volume": 5, "volume_title": "Volume 5", "body": "<h1>Chapter 479 - Chapter 479: Chapter 476: Hurry And Ask His Majesty To Come Out Of Seclusion!</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 479: Chapter 476: Hurry and ask His Majesty to come out of seclusion!<br/><br/>The boundless Immortal Court’s splendid halls all turned to flying ash, leaving only the Heavenly Dao long staircase and the sun hanging on the horizon.<br/><br/>Desolate, silent.<br/><br/>Fang Wang strolled up the Heavenly Dao staircase, with the Supreme Saint and Fang Jing closely following behind, the trio seemed to have come from another world. The Purple Dragon Soul on the Heavenly Palace Halberd twisted its dragon body at will, displaying its formidable stature.<br/><br/>Fang Jing felt the majestic spiritual energy of this realm and ran his cultivation technique for Qi Gathering, confirming that he was not in an Illusionary Realm.<br/><br/>This made him even more astonished.<br/><br/>“Is the Immortal Court gone just like that?” Fang Jing couldn’t help but ask.<br/><br/>The Supreme Saint shook his head, “It’s not that easy. The Immortal Court still has its own inner realms, and the Heaven Emperor and the Four Great War Gods have yet to make a move. However, the move that the Dao Master made just now has indeed caused heavy losses to the Immortal Court. Even if those Immortal Divines can resurrect through fate, it will be difficult to recover their original strength in a short period of time.”<br/><br/>Fang Wang, walking ahead, said indifferently, “They can’t resurrect.”<br/><br/>Upon hearing this, the Supreme Saint frowned, a look of fear flashing in his eyes.<br/><br/>Just then, a vast expanse of purple Qi suddenly surged out of nowhere on the horizon in front of them, followed by the coalescing into a giant face—it was unmistakably the Lingxiao Saint Emperor.<br/><br/>The Lingxiao Saint Emperor looked at Fang Wang from afar, his brow deeply furrowed.<br/><br/>Just as he was about to speak, his gaze suddenly became vacant.<br/><br/>Fang Jing was frightened by the face of the Lingxiao Saint Emperor, but with Fang Wang there, he didn’t panic.<br/><br/>The Supreme Saint noticed something, his expression turning strange.<br/><br/>A few breaths later, the Lingxiao Saint Emperor’s gaze returned to normal, and his colossal face dissipated along with the swirling purple Qi, revealing his true form within it.<br/><br/>Seeing this, Fang Jing grew tense. The Lingxiao Saint Emperor looked formidable—what kind of grand battle was about to ensue?<br/><br/>As he was thinking this, the Lingxiao Saint Emperor suddenly made a move that stunned him, turning to the side and raising his hand to point in a direction.<br/><br/>The Lingxiao Saint Emperor was actually giving Fang Wang directions!<br/><br/>The Heavenly Dao staircase adjusted its direction accordingly, extending in the direction pointed out by the Lingxiao Saint Emperor.<br/><br/>The Heavenly Dao staircase extended rapidly, and Fang Wang and his companions didn’t stop, continuing forward. Soon, they passed right by the Lingxiao Saint Emperor.<br/><br/>The Lingxiao Saint Emperor’s gaze landed on the Supreme Saint, his eyes filled with complexity.<br/><br/>The Supreme Saint, however, ignored his look.<br/><br/>A dozen breaths later, Fang Wang suddenly raised his hand, and the Heavenly Palace Halberd floating beside him surged forward.<br/><br/>Boom!<br/><br/>The Heavenly Palace Halberd flew tens of miles out and stopped mid-air as if invisible barriers were impeding it, with space around its blade fracturing like a mirror.<br/><br/>Accompanied by a clear shattering sound, space broke apart, revealing a dazzling world to Fang Wang and his companions, with magnificent immortal Qi pouring forth from it.<br/><br/>Through the rift in space, they seemed to be gazing at a world from another dimension, with even more majestic Immortal Palaces within it. Dragons and phoenixes frolicked in the clouds and mist, while an unceasing stream of Immortal Divines emerged from the sea of clouds, quickly assembling in front of the spatial portal, ready for battle.<br/><br/>A profound Heavenly Might descended from above, making Fang Jing and Zi Ling’s breathing quicken.<br/><br/>Bilowing flames, like a column of energy, descended, blocking the path between the Heavenly Dao staircase and the spatial portal.<br/><br/>A dominating figure gradually took shape within the flames.<br/><br/>Fang Wang remembered his aura.<br/><br/>Wrathful God Luo!<br/><br/>With his appearance, the Nine-Faced Divine Net was surely not far off.<br/><br/>Sure enough!<br/><br/>Within the inner realm of the Immortal Court, thousands of lightning bolts appeared out of thin air, intertwining to form the figure of the Nine-Faced Divine Net.<br/><br/>Seeing the Nine-Faced Divine Net emerge, the Immortal Divines each reverently paid their respects.<br/><br/>The Nine-Faced Divine Net stepped out from among the heavenly lightning, clad in heavy, martial Silver Armor with shoulder guards resembling Dragon Heads, fearsome and awe-inspiring, the dragon eyes lifelike.<br/><br/>His black hair floated freely, and the eyes beneath his cold brows emitted an ultimate intent to kill, crossing the space, and solidifying into substance upon Fang Wang’s body.<br/><br/>“Slaughtering Immortal Divine, you are offending Heaven!”<br/><br/>The voice of the Nine-Faced Divine Net rose, its tone ice-cold.<br/><br/>Fang Wang then spoke, “Compared to last time, you lack composure; you’re panicking.”<br/><br/>Upon hearing this, the Nine-Faced Divine Net’s brows furrowed.<br/><br/>Rumble Rumble—<br/><br/>Rolling thunderclouds surged forth, and even before they could blot out the sky, the firmament had already turned crimson red. Countless meteors struck from beyond the heavens, carrying billowing smoke, resembling scenes of Armageddon.<br/><br/>Fang Wang distinctly felt the force of the rules of this world start to recede.<br/><br/>It all originated from the Wrathful God Luo!<br/><br/>This was a method similar to the Celestial Phenomenon, but stronger than the Celestial Phenomenon.<br/><br/>The Wrathful God Luo raised his right hand, consolidating a pagoda, whose small windows swung open, and from which streams of scorching flame burst forth, quickly transforming into a sea of fire, encircling the entire world.<br/><br/>The long hair of the Wrathful God Luo danced wildly, his face hideous and terrifying; his eyes full of cruelty as he looked at Fang Wang.<br/><br/>“Let me see what the Heavenly Dao is!”<br/><br/>The cold voice of the Wrathful God Luo resonated as he lifted the pagoda in his hand. The entire world trembled violently, and everything before the eyes of the three, including Fang Wang, began to distort. Flames appeared out of nowhere on their bodies, flames that not only burned their flesh but also scorched their souls.<br/><br/>Fang Jing had just felt his soul suffer a piercing pain when a golden lotus suddenly blossomed beneath his feet, dispelling the agony from his body. Even though there were still flames on him, he felt no pain.<br/><br/>He then saw Fang Wang raise his hand.<br/><br/>The Supreme Saint’s expression brightened.<br/><br/>It was coming!<br/><br/>Having experienced the terror of the Heavenly Dao Returning Void, the Supreme Saint, seeing others in misfortune, felt an inexplicable anticipation.<br/><br/>“Seal!”<br/><br/>The Wrathful God Luo bellowed, and the pagoda in his hand burst forth with radiant light. The three thousand rules that had faded from the world appeared out of nowhere, coalescing into differently-colored True Dragons that approached Fang Wang and the other two from various directions. Waves that contained the terrifying might of dragons surged forth, intending to drown the three of them.<br/><br/>Fang Wang’s right hand clenched gently, and the whole world came to a standstill.<br/><br/>Immediately after, the entire world began to collapse towards his palm, countless silvery lights blooming as if to pull at everything between heaven and earth.<br/><br/>The Wrathful God Luo also lost color, his eyes widening in horror as he discovered that he simply could not escape.<br/><br/>Not only that, but his mana, vitality, karmic ties, and fate were all being stripped away!<br/><br/>How is this possible!<br/><br/>What Divine Skills is this?<br/><br/>The Wrathful God Luo couldn’t even speak, his vision had become blurry, and he could no longer see Fang Wang’s true form.<br/><br/>…<br/><br/>The Nine-Faced Divine Net flew out from within the Immortal Court, followed by a procession of imposing Immortal Divines, their expressions solemn.<br/><br/>Following their gaze, ahead floated an immense fireball with a diameter surpassing a thousand zhang, its violent trembling and oozing brilliant silvery light indicating it could explode at any moment.<br/><br/>An immense pressure enveloped all the Immortal Divines, a pressure they had felt before; when Fang Wang battled the Supreme Saint, such a pressure had once shattered their Heavenly Stele, a memory they could not forget to this day.<br/><br/>The Divine Skills of the Wrathful God Luo simply could not suppress the pressure of Tiandao Fangwang, but what did that indicate?<br/><br/>All the Immortal Divines came upon an ominous guess, which at the same time, they found absurd.<br/><br/>The battle had just begun, and the Wrathful God Luo was already struggling?<br/><br/>This was the War God of the Immortal Court!<br/><br/>From within the Immortal Court, the trembling voice of an old Immortal resounded: “Quickly, go invite His Majesty out of seclusion!”\t\t\t\t\t\t</div>", "images": {}, "success": true}