{"id": 483, "url": "https://www.novelhall.com/i-became-an-immortal-on-mortal-realm-32879/15211281.html", "title": "Chapter 473 - Chapter 473: Chapter 470: The Fear Of The Immortal Divine", "volume": 5, "volume_title": "Volume 5", "body": "<h1>Chapter 473 - Chapter 473: Chapter 470: The Fear Of The Immortal Divine</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 473: Chapter 470: The Fear of the Immortal Divine<br/><br/>“`<br/><br/>When the Heavenly Emperor Coffin devoured the Supreme Saint, Fang Wang’s right hand released the Heavenly Palace Halberd, and with a space between them, he grabbed the Mortal Realm Fate Bell into his palm.<br/><br/>Sky Capturing Palm!<br/><br/>Even though it was a minor Divine Skill, in Fang Wang’s hand, its might had already surpassed that of a top-tier Divine Skill!<br/><br/>The Heavenly Emperor Coffin above violently trembled, as if some terrifying thing were about to burst forth. The Heavenly Emperor Coffin was enormous, stretching for ten thousand miles, shaking the rules of the void itself.<br/><br/>Fang Wang opened his eyes and admired the Mortal Realm Fate Bell in his hand.<br/><br/>“Transcendence should not merely be about transcending fate, to transcend the Heavenly Dao one must also possess a power of one’s own.”<br/><br/>Fang Wang murmured to himself, conversing with himself.<br/><br/>Just like when he created the Great Returning Void Palm, he decided to create a new Divine Skill, one that could represent the power of transcendence of the Heavenly Dao.<br/><br/>To represent the power of transcendence, it would have to make the enemy unable to transcend!<br/><br/>Fang Wang suddenly felt that the Mie Jue Divine Tome could symbolize such power.<br/><br/>He also thought of the exiled state of the Hongxuan Emperor. Could the being that exiled the Hongxuan Emperor also be of the Transcendental Realm?<br/><br/>All paths of cultivation bear similarities, representing different stages; the conventional Path of Immortality surely has existences comparable to the transcendence of the Heavenly Dao. Fang Wang had not yet become so arrogant as to believe he was invincible.<br/><br/>If he could extinguish the Mortal Realm Fate Bell in his hand, then he would have completely accomplished the creation of the Transcendental Realm of the Heavenly Dao.<br/><br/>Boom!<br/><br/>The Heavenly Emperor Coffin suddenly shattered, and a mass of blood rained down, generating scorching flames upon contact with the light of the Heavenly Dao before plummeting toward Fang Wang.<br/><br/>Fang Wang’s figure flickered, easily dodging it.<br/><br/>This mass of blood hovered in the air, level with Fang Wang, and quickly condensed into the form of the Supreme Saint.<br/><br/>The Supreme Saint raised his hand, looking at his blood-drenched right hand, he sighed, “What a domineering Divine Skill. Such a powerful karmic curse is very rare, it must be that Hongxuan Emperor’s Divine Skill.”<br/><br/>Fang Wang was not surprised; the Supreme Saint, peering into everything in the Mortal Realm through the Fate Bell, would naturally know of the Hongxuan Emperor.<br/><br/>“However, if it’s only to this extent, it’s not enough to defeat me!”<br/><br/>The Supreme Saint laughed heartily and then stepped forward. With each step he took, Fang Wang felt a terrifying force of karma descend upon him, disintegrating his Heavenly Dao Force and flesh, with even his soul suffering damage.<br/><br/>The Heavenly Dao Myriad Classic of Laws was activated, and the Heavenly Dao Force within Fang Wang’s body whirled madly, with the Immeasurable Pure Bone also drawing forth power to resist the Supreme Saint’s onslaught.<br/><br/>At that moment, the Supreme Saint took a second step, and with it, all of Fang Wang’s Lifespirit Treasures were dislodged from his body, scattering around him.<br/><br/>Fang Wang couldn’t help but raise an eyebrow, feeling a mysterious and powerful suction force tugging at his Lifespirit Treasures; this was the first time he had encountered such a thing.<br/><br/>The Supreme Saint’s steps gradually disintegrated his offensive methods, invisible and intangible, utterly insidious.<br/><br/>Fang Wang snorted coldly; his Treasures abruptly reintegrated into his body, while the Heavenly Palace Halberd beside him burst forth with terrifying speed, suddenly striking at the Supreme Saint.<br/><br/>Thump—<br/><br/>The Mortal Realm Fate Bell blocked the Heavenly Palace Halberd, preventing it from advancing.<br/><br/>The Mortal Realm Fate Bell in Fang Wang’s palm then dissipated.<br/><br/>He twisted his neck, took a step forward, and gripped the Heavenly Palace Halberd, executing The Heaven of Carefree Freedom, stepping through the Mortal Realm Fate Bell and arriving right before the Supreme Saint in one move.<br/><br/>The two once again clashed fiercely; the Supreme Saint’s Divine Skills were endless and mostly invisible to the naked eye. Even though the Supreme Saint’s Divine Skills were secretive and reached the Transcendental Realm, Fang Wang, who had achieved transcendence of the Heavenly Dao, could easily counter them, even deliberately experiencing the Supreme Saint’s Divine Skills.<br/><br/>“`<br/><br/>At the same time, the Fate of Xuanzu’s World completely enveloped the whole world, and the illusions in the Firmament vanished along with it.<br/><br/>Peace returned to heaven and earth, but it only lasted for a few breaths; soon, all across the Mortal Realm, there was an uproar.<br/><br/>Countless living beings were curious about the identities of the two who had just battled.<br/><br/>Those who recognized Fang Wang’s form were curious about who his opponent was.<br/><br/>Cultivators of the Mortal Realm, beings of the True Soul Realm, flew out towards the heavens, observing Fang Wang’s grand battle with the Supreme Saint through the Fate of the Mortal Realm, all of them staring agape and holding their breath in concentration.<br/><br/>They could not capture the silhouettes of Fang Wang and the Supreme Saint, but the sight of the cosmos collapsing ceaselessly, that terrifying destructive power, was enough to chill their courage.<br/><br/>The cosmic space that Fang Wang and the Supreme Saint casually shattered was much larger than the entirety of Xuanzu’s World; faced with such power, even the Celestial Qiankun would feel diminutive.<br/><br/>Besides that, the shadowy figures of Jiu You standing in the darkness also sent shivers down the spines of the Mortal Realm’s cultivators, who feared an invasion of demons from beyond the heavens.<br/><br/>By a vast expanse of sea in the Mortal Realm, Zhou Xue, Fang Zigeng, and Fang Hanyu stood at the seashore. Fang Zigeng and Fang Hanyu were still discussing the grand battle between Fang Wang and the Supreme Saint. Although the illusion in the Firmament had been brief, they recognized it instantly.<br/><br/>Zhou Xue withdrew her gaze, looked toward the vast sea ahead, and said, “Alright, get ready. What comes next isn’t going to be pleasant.”<br/><br/>Fang Hanyu hurriedly asked, “Zhou Xue, where exactly are we going?”<br/><br/>Zhou Xue stepped forward, moving towards the Canghai, and without turning her head back, she left behind a sentence, “To unravel the riddles of our past and present lives, to discover what kind of power guides our cycle of reincarnation through the workings of fate.”<br/><br/>Hearing this, Fang Hanyu and Fang Zigeng exchanged glances and saw the astonishment in each other’s eyes.<br/><br/>Although confused, they chose to believe Zhou Xue, after all, Fang Wang had told them to listen to her.<br/><br/>They hurried to keep pace with Zhou Xue, stepping into the sea.<br/><br/>…<br/><br/>Above layers of cloud seas, a gigantic Golden Stele stood tall, with figures of Immortal Divine beings in front of it, including the Eighteen Divine Pillars, the Doom God, and the Fortune and Prosperity Immortal, all of them with grave expressions.<br/><br/>The Golden Stele reflected the scene of the grand battle between Fang Wang and the Supreme Saint. Fang Wang’s power was so overwhelming it left them struggling to catch their breath, pondering how they should face Fang Wang.<br/><br/>“He is becoming ever more effortless; he is growing rapidly through the battle.”<br/><br/>“Could it be that the Supreme Saint is holding back, offering him guidance in cultivation?”<br/><br/>“It shouldn’t be, the Fate clock of the Supreme Saint’s Mortal Realm has been shattered several times; he truly can’t deal with that person.”<br/><br/>“Is he really from the Mortal Realm? How could the Mortal Realm produce such a formidable being? Even the Supreme Saint once cultivated in the Immortal Realm, didn’t he?”<br/><br/>The Immortal Divine beings murmured amongst themselves; they could no longer keep up with the battle speed of Fang Wang and the Supreme Saint. But witnessing the intricacies and destructive might of their Divine Skills, they felt they were in the thick of it, terrifying beyond description and irresistible.<br/><br/>The Great Divine Pillar stared intently at the Golden Stele, and he said, “This person has reached the transcendent state spoken of in the legends!”<br/><br/>Ever since Fang Wang became immortal in the Mortal Realm, all Immortal Divine beings of the Immortal Court sensed a hostility, a hostility from Fang Wang towards the Immortal Court, conveyed through the Fate of the Mortal Realm.<br/><br/>The Immortal Divine beings could all feel the impending calamity from the Mortal Realm, which now materialized before their eyes.<br/><br/>Transcendence!<br/><br/>When all Immortal Divine beings heard these two words, their faces paled.<br/><br/>The Fortune and Prosperity Immortal stared intently at Fang Wang’s figure, lost in thought.<br/><br/>At that moment, the gigantic Golden Stele began to tremble, causing the cloud sea to churn violently as well.\t\t\t\t\t\t</div>", "images": {}, "success": true}