{"id": 488, "url": "https://www.novelhall.com/i-became-an-immortal-on-mortal-realm-32879/15220606.html", "title": "Chapter 478 - Chapter 478: Chapter 475: Havoc In The Immortal Court", "volume": 5, "volume_title": "Volume 5", "body": "<h1>Chapter 478 - Chapter 478: Chapter 475: Havoc In The Immortal Court</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 478: Chapter 475: Havoc in the Immortal Court<br/><br/>“`<br/><br/>Great Disturbance at the Immortal Court!<br/><br/>Upon hearing this sentence, Fang Jing’s blood instantly boiled, and his breathing became rapid.<br/><br/>The Supreme Saint stroked his beard with a smile, and while Fang Jing wasn’t paying attention to him, he reverted to his true form, no longer appearing old.<br/><br/>As Fang Wang broke through the mortal realm’s space, condensing the long stairs of the Heavenly Dao and causing the mortal realm’s fate to surge, three thousand rules flowed towards the breach in the starry sky, causing all sorts of celestial phenomena and leaving all beings uneasy.<br/><br/>Fang Wang took one step to the base of the Heavenly Dao’s long stairs and began to ascend towards heaven.<br/><br/>Fang Jing snapped back to his senses, hastily leaped up, and landed behind Fang Wang. He looked back to see the Supreme Saint flying towards him and landing behind him.<br/><br/>“You are…” Fang Jing asked cautiously.<br/><br/>The Supreme Saint chuckled and responded, “You have been calling me ‘Grandpa’ for ten years. How is it? Do you not recognize me?”<br/><br/>Fang Jing’s eyes widened in astonishment.<br/><br/>Just as he was about to say more, a streak of blue light swept in and landed on Fang Wang’s shoulder; it was Zi Ling.<br/><br/>“Master, take me with you!” Zi Ling said excitedly. It often heard Xiao Zi talk about its experiences accompanying Fang Wang in battle, and it longed for it immensely.<br/><br/>At that moment, wisps of purple aura emerged from Fang Wang’s right shoulder, condensing into the Purple Dragon Soul. It was Xiao Zi.<br/><br/>“Is it finally time for revenge, Master? I’ve been impatient for a long time!” Xiao Zi said excitedly.<br/><br/>Fang Wang didn’t answer. He just continued stepping upward, his white robes fluttering in the wind.<br/><br/>Hong Chen, Dugu Wenhun, and the upper echelons of Wangdao quickly flew over, each clutching a Wangdao Command Token, avoiding the restrictions along the way.<br/><br/>“Dao Master, where are you going?” Dugu Wenhun asked loudly.<br/><br/>During this time, just like Fang Jing, they always dreamt about their past lives until today when they finally merged completely. Because of this, they were nervous.<br/><br/>In their previous life, Fang Wang was unable to stop the entire Immortal Court, and half the beings in Xuanzu’s World were annihilated. Faced with such a powerful Immortal Court, was he going to confront it alone again?<br/><br/>Fang Wang did not turn his head; his words descended lightly:<br/><br/>“Wait in the mortal realm; I will exchange a piece of heaven for you.”<br/><br/>Hearing his words, the Wangdao Cultivators quieted down, their eyes filled with anticipation as they looked towards Fang Wang.<br/><br/>The Dao Master of this life really does seem stronger than in the previous life!<br/><br/>At least in the previous life, Kunlun had still not been completed even after the Heavenly Gate was opened, and just the creation of Kunlun was enough to plunge them into wild fantasies.<br/><br/>Beings in various places of the mortal realm saw a giant black hole appear in the firmament, with the sea of clouds transforming into dragons, twisting and heading out, a scene as magnificent as a painting.<br/><br/>This spectacle made all beings anxious. Some mentioned the great battle between the Heavenly Dao and foreign demons from hundreds of years ago, and others thought it was a disaster descending from heaven, with various speculations abounding.<br/><br/>Fang Xun and Yi Xiuyang stood on a cliff, looking towards the Heavenly Dao’s long stairs that even the clouds and mist couldn’t obscure.<br/><br/>They did not understand what had happened, but they felt an inexplicable panic.<br/><br/>“Husband, there won’t be anything wrong with Jing’er, right?” Yi Xiuyang asked.<br/><br/>Fang Xun took a deep breath and said, “My elder brother is willing to mentor him; how could anything happen to him?”<br/><br/>Despite his words, he still felt somewhat worried.<br/><br/>Could something truly have gone wrong?<br/><br/>…<br/><br/>Immortal Realm, Immortal Court.<br/><br/>Above the sea of clouds, palaces and pavilions stood tall, each one radiating thousands of feet of brilliant light, ethereal and beautiful.<br/><br/>“`<br/><br/>Suddenly, a black hole appeared in the firmament above the Immortal Court, which rapidly expanded. A silver staircase emerged from it and extended toward the depths of the Immortal Court.<br/><br/>A deity clad in Silver Armor appeared out of thin air, lifting his long spear in hand, attempting to fend it off with his mana.<br/><br/>With a booming sound!<br/><br/>The silver staircase directly struck the Silver-Armored deity, shattering his armor into pieces, dispersing his mana into a mist, as he crashed through a tower and plummeted into the clouds.<br/><br/>“How dare you!”<br/><br/>A thunderous shout resounded as numerous deities descended from various directions, each enveloped in their own fate, with an imposing presence. They each summoned their Lifespirit Treasures and exercised their Divine Skills, striving to destroy the staircase of the Heavenly Dao.<br/><br/>However, despite their furious attacks, the Heavenly Dao staircase remained unaffected, dispelling the deities’ mana upon contact, causing it to spread out into a vast fog, while the staircase itself continued its unstoppable course, shattering the majestic mountains-like Heavenly Gates in its path.<br/><br/>More and more deities appeared, but none could halt the advance of the Heavenly Dao staircase. Some even landed upon it and attempted to suppress it with their own strength.<br/><br/>The Divine Pillars also made their successive appearances, but still, they could not stand in its way.<br/><br/>“How could this be…”<br/><br/>The Supreme Divine Pillar’s eyes widened in shock as he felt the impact of the Heavenly Dao staircase. His liver and gallbladder felt split, and the umbrella in his hands trembled violently, on the verge of coming apart.<br/><br/>A deity wielding a halberd landed on the Heavenly Dao staircase and charged toward the black hole. Each step he took was heavy, filling the heavens and earth with a thunderous rumble.<br/><br/>Quickly, he reached the brink of the black hole and was about to dive into the darkness, but suddenly, a foot emerged from within the black hole, stepping on his chest and forcefully kicking him away.<br/><br/>In almost an instant, the deity lost consciousness, his halberd slipped from his grasp, and his body tumbled along the Heavenly Dao staircase, eventually crashing through the eaves of a palace.<br/><br/>From within the black hole, Fang Wang emerged from the darkness, the Heavenly Palace Halberd floating beside him, followed by the Purple Dragon Soul entwined around it, exuding an imposing aura.<br/><br/>The Supreme Saint followed close behind, causing the faces of many deities to drastically change as he stepped out of the darkness.<br/><br/>Fang Jing also stepped out. He lacked the aura of Fang Wang and the Supreme Saint, feeling more nervous and excited instead. When he saw the magnificent sight of the Immortal Court, his eyes widened in awe.<br/><br/>Looking down upon these mighty deities, he felt an indescribable thrill in his heart.<br/><br/>“Supreme Saint! So it was you!”<br/><br/>The Supreme Divine Pillar ground his teeth as he looked toward the Supreme Saint and spoke with a chill in his voice.<br/><br/>It was no wonder that the Supreme Saint and Fang Wang had fought for so long. It turned out the Supreme Saint was the backer of the Heavenly Dao.<br/><br/>The Supreme Saint didn’t respond, instead looking at Fang Wang with interest.<br/><br/>Fang Wang raised his right hand, with his palm facing the boundless Immortal Palace and Pavilions below, his expression cold and indifferent.<br/><br/>Seeing Fang Wang raise his hand, the expressions of the many deities changed dramatically.<br/><br/>“Form up!”<br/><br/>The Supreme Divine Pillar shouted loudly. The Eighteen Divine Pillars quickly assembled into a formation, their speed of formation almost instant. In a flash, they formed a formation, summoning a terrifying figure wielding an axe.<br/><br/>Fang Wang’s right hand suddenly twisted, palm facing up, and he grasped it in a smooth motion.<br/><br/>With that grasp, the heavens and earth fell instantly silent!<br/><br/>The Immortal Palace and Pavilions below turned into ash. Deities were crushed into dust and scattered with the wind. The axe-wielding figure summoned by the Eighteen Divine Pillars had just raised its axe when it too dispersed into the breeze. The Eighteen Divine Pillars widened their eyes in disbelief. They could not even begin to speak before they, along with the surrounding Immortal Palaces, vanished into nothingness.<br/><br/>Above the Sea of Clouds, everything ceased to exist except for the still ascending, ever-extending staircase of the Heavenly Dao.<br/><br/>Fang Jing’s eyes widened in disbelief at what he saw and heard.<br/><br/>He even doubted if he had been ensnared by an illusion, wondering if everything he had seen before was false.<br/><br/>The smile on the Supreme Saint’s face also froze; he too had not expected Fang Wang to be so powerful.<br/><br/>“Heavenly Dao Returning Void? No, this is a Divine Skill he used before, but how many years have passed for such a drastic change to occur…” the Supreme Saint inwardly felt shocked.\t\t\t\t\t\t</div>", "images": {}, "success": true}