{"id": 492, "url": "https://www.novelhall.com/i-became-an-immortal-on-mortal-realm-32879/15223403.html", "title": "Chapter 482 - Chapter 482: Chapter 479: Heaven Emperor! Karmic Demon Lord!", "volume": 5, "volume_title": "Volume 5", "body": "<h1>Chapter 482 - Chapter 482: Chapter 479: Heaven Emperor! Karmic Demon Lord!</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 482: Chapter 479: Heaven Emperor! Karmic Demon Lord!<br/><br/>“`<br/><br/>The Heaven Emperor, dressed in a white robe with faint golden dragon shadows gliding upon it, had half of his body covered by malevolent souls, giving him an aura that seemed to blend divinity and demonry.<br/><br/>His black hair was coiled beneath his imperial crown, his countenance majestic and handsome, with a pride in his brows that seemed to look down upon all living beings.<br/><br/>Ruler of the Immortal Court, the leader of all Immortals!<br/><br/>The Heaven Emperor!<br/><br/>Fang Wang looked at the Heaven Emperor with some surprise. He had heard that the Nine-Faced Divine Net possessed strength not inferior to the Heaven Emperor’s, and he had wondered why it didn’t revolt. Now, it was clear that the Nine-Faced Divine Net’s power still fell short of the Heaven Emperor’s.<br/><br/>Not just the Heaven Emperor, but also the souls upon him were extraordinary.<br/><br/>They were filled with the aura of Jiu You from the Underworld!<br/><br/>The Supreme Saint furrowed his brows; he too noticed something amiss with the Heaven Emperor.<br/><br/>“After so many rebirths, you have finally succeeded,” the Heaven Emperor began, his words profoundly affecting both the Supreme Saint and Fang Jing.<br/><br/>The Supreme Saint was advanced in his Dao; he had deduced that Fang Wang bore traces of rebirth, yet he couldn’t comprehend how Fang Wang had achieved such a feat, one that even he couldn’t detect.<br/><br/>Fang Wang remained expressionless, seemingly unsurprised. He asked, “Is all of this because of you?”<br/><br/>The corner of the Heaven Emperor’s mouth curled into a smile as he said, “When I was cultivating and encountered a bottleneck, I couldn’t break through the limit no matter what. Until one day, someone approached me, inquiring if there was a way to reverse time. His life’s greatest regret was that his kin died early; even having become an Immortal, he could not find the karmic threads of his kin’s reincarnation, for he became an Immortal too late.”<br/><br/>“I thought highly of his contributions and aided him in rebirth. But he became so obsessed with it that he formed a cycle of reincarnation, leading to more and more sub-worlds appearing in Xuanzu’s World. Even the Supreme Saint by your side was alerted. In the end, he made quite the commotion in the Immortal Court. Like now, the Four Great War Gods had fallen, and the Immortal Court was powerless against his edge.”<br/><br/>At this point, he displayed a self-mocking smile.<br/><br/>The Supreme Saint felt no triumph, instead he said, “But I don’t remember anything, which means I didn’t succeed. On the contrary, the one who laughs last is you.”<br/><br/>The Heaven Emperor lifted his right hand, clenching his palm, and smiled, “Back then, I crushed you to death just like this. Even though I killed you, the cycle of rebirth was in chaos, causing the entire Immortal Realm to reject me. I had no choice but to employ my divine skills to help that man be reborn again. However, I couldn’t return to the very beginning, only to the moment before you, the Supreme Saint, made your move. This time, he finally succeeded.”<br/><br/>With that, he turned his gaze toward Fang Wang, his eyes blazing as if beholding a rare treasure.<br/><br/>“He wanted to save you, but fate seemed fearful of your birth. With a hundred thousand rebirths, only a few revived you, and you were prone to an early death as you grew. Until last time, when you became a True God of the Heavenly Palace and stood before me. You and that man thanked me in my presence.”<br/><br/>“When I truly had my hand around your neck, watching you struggle, the look of fear, the despair on his face, eventually led me to absorb all your cultivation in front of him.”<br/><br/>“I had originally thought that your continuous cycle of rebirth would grant me the karmic power of space and time, aiding me in surmounting the final barrier. Unfortunately, it still ended in failure.”<br/><br/>At this, the Heaven Emperor shook his head and sighed, his face filled with regret.<br/><br/>The Supreme Saint couldn’t help but ask, “If what you say is true, and you are so powerful that you can manipulate time and space, there’s no one in the Immortal Realm who is your match, why hasn’t the Immortal Court unified the entire Immortal Realm?”<br/><br/>The Heaven Emperor spoke somberly, “Because in the process of comprehending the Dao, I felt that the Immortal Realm is very small. My strength, outside of the Three Realms, is really nothing, which is why I’ve been lying low.”<br/><br/>The self-proclaimed invincible Supreme Saint was shocked. Could it be that he was only seeing a small piece of the sky from the bottom of a well?<br/><br/>Fang Wang inquired, “Having absorbed my cultivation, why am I still here? Could it be that I wasn’t enough for you?”<br/><br/>The Heaven Emperor revealed a smile and said, “Indeed, my cultivation greatly increased, but it’s far from enough. That’s why I let you live again. But during the process, an unexpected change occurred, which was Zhou Xue’s rebirth. Zhou Xue is an Immortal Venerable stationed in the Starry Sea of the Immortal Court. She became an Immortal Venerable, and I must say, I considered your relationship. Apart from you, she’s the only one who could become an Immortal in the cycle of rebirth and reach me. But when I let you be reborn, she too was reborn. I can’t comprehend how she managed to do that, as I couldn’t detect any changes in Mortal Realm before her rebirth.”<br/><br/>“`<br/><br/>“Until today, you have approached me in a completely new form, and your strength proves that my conjecture was right. You, who control time and space, will surely let me also master the Great Dao of time and space, thus achieving a breakthrough to a realm never reached in the Three Realms,” the Heaven Emperor said.<br/><br/>The Supreme Saint said mockingly, “What? Do you, without control over time and space, think you can defeat him, who does?”<br/><br/>The Heaven Emperor raised his right arm, and his soul moved toward the right side, condensing into a figure identical to him, except it was pitch black and emanated a dark red aura.<br/><br/>The Supreme Saint narrowed his eyes and said, “Karmic Demon Venerate.”<br/><br/>Fang Wang looked at the shadow and felt as if he had experienced it somewhere before.<br/><br/>It must have been in his past life in the Mortal Realm.<br/><br/>This shadow must have come from the Underworld, for the aura of the Underworld was incredibly strong.<br/><br/>“My confidence stems from him,” the Heaven Emperor said with a cold laugh that was eerie.<br/><br/>The Karmic Demon Venerate also revealed a sinister smile and, with a voice very similar to the Heaven Emperor, said, “I remember now, before the reset of order, someone had requested me to deal with this youngster.”<br/><br/>The Heaven Emperor snorted, “Then why didn’t you do it at that time?”<br/><br/>“Seems like I ran into someone, and I forgot.”<br/><br/>As the two stood side by side talking to themselves, the Karmic Demon Venerate seemed to be recalling something.<br/><br/>The Supreme Saint spoke solemnly, “There’s something off about them; let’s deal with them as quickly as possible.”<br/><br/>Fang Wang raised his right hand, reaching out through the air towards the Heaven Emperor and the Karmic Demon Venerate.<br/><br/>At that moment, the Karmic Demon Venerate suddenly widened his eyes, and the law of chaos in the entire void froze, even the fate of the Immortal Realm in the distance stopped flowing.<br/><br/>Both the Supreme Saint and Fang Jing were hit by the force of causality, their eyes becoming dull.<br/><br/>The Supreme Saint recovered first, then placed his hand on Fang Jing’s shoulder, protecting him with his sacred power.<br/><br/>Fang Wang was also hit by the force of causality, and countless illusions appeared before his eyes, with all the beings that had intersected with him, including those closest to him, rushing at him in hatred.<br/><br/>Having comprehended the power of causality at his rebirth, Fang Wang cleared all the illusions in front of his eyes in an instant.<br/><br/>Once again, the Eye of the Heavenly Dao formed on his forehead, ready to eliminate both the Karmic Demon Venerate and the Heaven Emperor in one stroke.<br/><br/>However, he suddenly realized that the entire void had been isolated by a mysterious causal force. It seemed no different from before, but they had been sealed in a separate space.<br/><br/>Boom!<br/><br/>The celestial light burst forth, directly eliminating the Heaven Emperor and the Karmic Demon Venerate, but in the next second, both reappeared in a different direction, still wearing their sinister smiles.<br/><br/>Fang Wang unleashed the celestial light again, similarly eliminating the two, but the Heaven Emperor and his counterpart resurrected once more, getting closer to him each time.<br/><br/>“Something’s not right; their true bodies must be hidden somewhere!” The voice of the Supreme Saint came from behind, his tone grave.\t\t\t\t\t\t</div>", "images": {}, "success": true}