{"id": 491, "url": "https://www.novelhall.com/i-became-an-immortal-on-mortal-realm-32879/15223402.html", "title": "Chapter 481 - Chapter 481: Chapter 478: Great Freedom Great Law", "volume": 5, "volume_title": "Volume 5", "body": "<h1>Chapter 481 - Chapter 481: Chapter 478: Great Freedom Great Law</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 481: Chapter 478: Great Freedom Great Law<br/><br/>Fang Jing looked up, his spine tingling as he observed the eyes belonging to the Nine-Faced Divine Net.<br/><br/>The Supreme Saint looked on and exclaimed, “To think that the Immortal Court would birth such a genius, extraordinary indeed.”<br/><br/>When he had swept across The Upper Realm, the Nine-Faced Divine Net did not yet exist.<br/><br/>Before his resurrection, he had heard of the reputation of the Nine-Faced Divine Net, but he had not taken it seriously.<br/><br/>Throughout the long years, he had seen his fair share of geniuses.<br/><br/>Eyes after eyes locked onto Fang Wang, densely packed and innumerable, horrifying and terrible under the blood-colored firmament.<br/><br/>Out of those eyes, figures gradually emerged, and upon closer inspection, it was indeed the Nine-Faced Divine Net!<br/><br/>Nine-Faced Divine Nets with different attire, different temperaments!<br/><br/>Standing beside the original Nine-Faced Divine Net, the Mysterious Divine Lord was also taken aback and couldn’t help asking, “Has your Great Freedom Dao Law already reached Great Completion?”<br/><br/>The Nine-Faced Divine Net, expressionless, said, “Even if it has reached Great Completion, I may not win, he has comprehended the Great Dao, prepare yourself for death and Dao vanishing.”<br/><br/>Upon hearing this, the Mysterious Divine Lord’s complexion turned ashen.<br/><br/>Standing on the same Heavenly Dao steps as them, Fang Wang raised his right hand, and reached out into the air towards them, palm facing downward.<br/><br/>Fang Wang’s face was so indifferent, as if he was completely unbothered by the Nine-Faced Divine Net’s Great Freedom Dao Law.<br/><br/>Suddenly, the Nine-Faced Divine Net raised his halberd and let out a furious roar. In an instant, countless giant eyes of the firmament burst open, bringing together Nine-Faced Divine Nets from different times and spaces. Their vast mana converged, tearing apart everything in the vision of Fang Wang and the others.<br/><br/>In the blink of an eye, Fang Wang clasped his right hand.<br/><br/>A terrifying, unprecedented aura suddenly erupted.<br/><br/>It was not the Heavenly Dao Returning Void, nor the Great Returning Void Palm, but the aura of the Nine Dragons Tyrant Fist!<br/><br/>With one clenched fist, all things were subdued!<br/><br/>The intense light shone on the face of the Nine-Faced Divine Net, whose eyes widened in disbelief.<br/><br/>As the dazzling light flashed, all factions in the Immortal Realm that were engaged in battle were interrupted and turned their heads in unison. They couldn’t see the figures of Fang Wang and the others, but the terrifying pressure of the Nine Dragons Tyrant Fist made them shiver with fear.<br/><br/>“What realm is this?”<br/><br/>“Sss—My mana feels like it’s about to dissipate…”<br/><br/>“Heavenly Dao? Does he truly come from the Mortal Realm?”<br/><br/>“Damn it, who exactly is he?”<br/><br/>Beings of the Immortal Realm were abuzz with fright and panic, and even the creatures of the Divine Platform who came to support Fang Wang were scared. With such immense pressure, did they really need to help him?<br/><br/>The intense light suddenly vanished, and Fang Wang and the others reappeared on the Heavenly Dao steps.<br/><br/>The Mysterious Divine Lord slammed a palm onto the steps, and a burst of illusory runes rapidly spread, covering a thousand miles.<br/><br/>The next second, Fang Wang and the other two appeared out of nowhere in the dim void, along with the Heavenly Dao steps beneath their feet that had been moved with them.<br/><br/>Fang Jing looked down, the Immortal Realm unfolded before his eyes, composed of continents brought together, even interconnected by rivers, with majestic Immortal Qi and the light of the Great Dao rising continuously, spectacular and beautiful.<br/><br/>Such a vast world!<br/><br/>Fang Jing could feel the immense distance between himself and the Immortal Realm, for the stars seemed like mere sand grains in front of the Immortal Realm.<br/><br/>At last, Fang Wang spoke, “Your Divine Skills are quite exquisite; you have just touched upon the pathway of spatial Great Dao.”<br/><br/>The complexion of the Mysterious Divine Lord was somewhat unpleasant. Though he seemed successful, moving Fang Wang had consumed more than half of his mana, and although his mana could be continuously regenerated, this shift almost made his physical body fall apart.<br/><br/>The Nine-Faced Divine Net leaped into the air, manifesting a colossal dharma body, his halberd also growing massive. He loosened his grip on the halberd shaft, with the tip pointing at Fang Wang from afar. He struck the halberd with both palms, and a force stronger than the laws of heaven and earth concentrated on his halberd.<br/><br/>Fang Wang raised an eyebrow.<br/><br/>The Nine-Faced Divine Net had also mastered the power of the Great Dao and was even stronger than the Mysterious Divine Lord.<br/><br/>However, he mainly borrowed the Great Dao’s power and had not yet cultivated his own power of the Great Dao.<br/><br/>The Supreme Saint saw through this as well and praised, “Only half a step away from transcendence!”<br/><br/>Behind the Nine-Faced Divine Net, numerous phantoms appeared, all of them his own image, countless as if they were an army, occupying half of the chaotic void. These phantoms simultaneously raised their arms, gathering the Great Dao’s power on the black halberd.<br/><br/>At that moment, the aura of the Nine-Faced Divine Net skyrocketed wildly!<br/><br/>Fang Wang clearly felt that many powerful divine senses swept through this void, some even had auras not weaker than the Nine-Faced Divine Net’s.<br/><br/>The Immortal Realm was not just about the Immortal Court and the lords of the Divine Platform!<br/><br/>But those powerful forces, the ancient powerhouses, did not take action, spectating the great battle between Fang Wang and the Nine-Faced Divine Net.<br/><br/>The Nine-Faced Divine Net twisted his body, his right arm leading, pushed forward, and the black halberd suddenly contracted the Great Dao power, exploding with a speed that transcended time and space, and thrust the halberd at Fang Wang.<br/><br/>Fang Wang clearly felt that this thrust was distorting time and space, attempting to directly kill back to the moment they had just been teleported to the void.<br/><br/>Fang Jing’s actions and expressions began to run in reverse, while the Supreme Saint beside him remained still, with a mocking smile on his face, his body surrounded by lightning that symbolized the power of time and space.<br/><br/>Suddenly!<br/><br/>Everything halted!<br/><br/>The black halberd, carrying the force of the Great Dao, hovered above Fang Wang’s head, the two being less than thirty feet apart, which was negligible compared to the halberd’s huge size.<br/><br/>A silver light condensed in front of Fang Wang’s forehead, quickly forming an eye.<br/><br/>This was what he called the Eye of the Heavenly Dao!<br/><br/>The Eye of the Heavenly Dao contained all the power he had mastered, converging together without any special effects, but with one point, ultimate destruction!<br/><br/>As the Eye of the Heavenly Dao condensed in the stillness of time, the Nine-Faced Divine Net’s understanding of the time Great Dao was far inferior to Fang Wang’s, and so he was frozen in place, his facial expression still vicious.<br/><br/>After the Eye of the Heavenly Dao finished condensing, it burst a dazzling silver light, fiercely shattering the black halberd and engulfing the Nine-Faced Divine Net.<br/><br/>Time returned to normal!<br/><br/>The Mysterious Divine Lord’s eyes couldn’t keep up with Fang Wang’s counterattack speed. Before he could react, the power of the Eye of the Heavenly Dao had crushed everything and engulfed the Nine-Faced Divine Net.<br/><br/>The Nine-Faced Divine Net, along with the countless phantoms behind him, perished together, and the boundless chaotic void seemed to be pierced through with a massive hole.<br/><br/>The Mysterious Divine Lord vanished in place and, in the next second, he unexpectedly appeared in Fang Wang’s hands.<br/><br/>“Where do you think you’re going?”<br/><br/>Fang Wang said expressionlessly, his tone indifferent.<br/><br/>Sky Capturing Palm!<br/><br/>The Mysterious Divine Lord went pale with shock, just about to speak, when his physical body suddenly exploded into particles, not leaving flesh and blood flying about, and rapidly condensed into a silver bead.<br/><br/>The Supreme Saint laughed, “With a flip of your hand, you’ve wiped out the two strongest war gods of the Immortal Court today. Even if the Heaven Emperor were to transcend, he would no doubt be no match for you.”<br/><br/>Seeing the plight of the Nine-Faced Divine Net and the Mysterious Divine Lord, he was quite pleased.<br/><br/>It was not that he wasn’t strong; it was that Fang Wang was too strong.<br/><br/>Whoever Fang Wang fought, it would be easier than fighting him!<br/><br/>Fang Wang lifted his gaze and said, “The Heaven Emperor has already arrived.”<br/><br/>The Supreme Saint and Fang Jing followed his gaze, and in the darkness, a figure approached, his body entwined with a sinister and eerie soul, indistinct as to what its true form was.\t\t\t\t\t\t</div>", "images": {}, "success": true}