{"id": 494, "url": "https://www.novelhall.com/i-became-an-immortal-on-mortal-realm-32879/15225995.html", "title": "Chapter 484 - Chapter 484: Chapter 480: Great Dao Heavenly Punishment, A Higher World_2", "volume": 5, "volume_title": "Volume 5", "body": "<h1>Chapter 484 - Chapter 484: Chapter 480: Great Dao Heavenly Punishment, A Higher World_2</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 484: Chapter 480: Great Dao Heavenly Punishment, A Higher World_2<br/><br/>“`<br/><br/>“How does it compare to the Mie Jue Divine Tome?”<br/><br/>“`<br/><br/>“`<br/><br/>“It’s only stronger, never weaker, because the senior who transmitted this Divine Skill is the Absolute Emperor!”<br/><br/>“`<br/><br/>“`<br/><br/>Zhou Xue spoke solemnly, immediately raising her hand, extending two fingers of her right hand toward Fang Wang’s temple, and transmitted the inherited memories into Fang Wang’s mind.<br/><br/>“`<br/><br/>“`<br/><br/>Now, Fang Wang was capable of multitasking to prevent any accidents, he activated the Xuan Yuan Divine Transformation, creating an avatar to help maintain the shield.<br/><br/>“`<br/><br/>“`<br/><br/>Vast memories flooded into his mind, and given Fang Wang’s current level of cultivation, the speed at which he assimilated them was extraordinary.<br/><br/>“`<br/><br/>“`<br/><br/>The Heaven Emperor sensed something was wrong and increased the ferocity of his attacks.<br/><br/>“`<br/><br/>“`<br/><br/>A few breaths later.<br/><br/>“`<br/><br/>“`<br/><br/>Fang Wang’s consciousness had already arrived inside the Heavenly Palace.<br/><br/>“`<br/><br/>“`<br/><br/>He opened his eyes, looked at the familiar Heavenly Palace, and expressed a sense of helplessness, murmuring, “Even today, I still cannot control you, can I?”<br/><br/>“`<br/><br/>“`<br/><br/>“Why should you try to control it? It’s your natural talent. People have their limits. Who can completely control their aptitude and push it beyond what it is capable of doing?”<br/><br/>“`<br/><br/>“`<br/><br/>A light chuckle came from nearby, startling Fang Wang into turning his head to look, only to see a purple-robed man standing beside him, smiling at him.<br/><br/>“`<br/><br/>“`<br/><br/>Frowning, Fang Wang asked, “Who are you?”<br/><br/>“`<br/><br/>“`<br/><br/>The man had an extremely handsome face and emitted not the slightest hint of danger. Fang Wang had never seen him before.<br/><br/>“`<br/><br/>“`<br/><br/>The purple-robed man laughed, “You are cultivating my Divine Skill, yet you ask who I am. I personally must transmit this skill to you.”<br/><br/>“`<br/><br/>“`<br/><br/>Fang Wang’s pupils dilated as he asked, “Are you the Absolute Emperor?”<br/><br/>“`<br/><br/>“`<br/><br/>“Absolute Emperor? Haha, I only left behind the word ‘Absolute.’ I never imagined someone would bestow me with the title of emperor,” said the purple-robed man, shaking his head with a wry chuckle, seemingly helpless.<br/><br/>“`<br/><br/>“`<br/><br/>The Absolute Emperor is not a Great Emperor?<br/><br/>“`<br/><br/>“`<br/><br/>Suddenly, Fang Wang understood why the Hongxuan Emperor denied the existence of the Absolute Emperor. As Great Emperors belong to the Imperial Dao, if the Absolute Emperor were a Great Emperor, then the Hongxuan Emperor should be able to sense his existence, just as he could sense other Heavenly Dao Cultivators.<br/><br/>“`<br/><br/>“`<br/><br/>“Come, it’s time to cultivate,” the purple-robed man beckoned.<br/><br/>“`<br/><br/>“`<br/><br/>Without dwelling on the doubts in his mind, Fang Wang immediately walked over, sat down face-to-face with the purple-robed man, and listened to his teachings.<br/><br/>“`<br/><br/>“`<br/><br/>As soon as the purple-robed man spoke, Fang Wang entered a state of enlightenment.<br/><br/>“`<br/><br/>“`<br/><br/>His voice contained unimaginable mysteries of the Great Dao, plunging Fang Wang directly into a state of explosive thought and enlightenment.<br/><br/>“`<br/><br/>“`<br/><br/>Thus, Fang Wang lost track of time.<br/><br/>“`<br/><br/>“`<br/><br/>Years passed by.<br/><br/>“`<br/><br/>“`<br/><br/>Gradually, Fang Wang came to understand the strength of this Divine Skill.<br/><br/>“`<br/><br/>“`<br/><br/>This Divine Skill was called the Great Dao Heavenly Punishment, capable of suppressing all Great Dao Power, even defining the Great Dao!<br/><br/>“`<br/><br/>“`<br/><br/>Fang Wang had never encountered such a complex Divine Skill before; merely hearing about its power excited him.<br/><br/>“`<br/><br/>“`<br/><br/>Upon mastering Great Dao Heavenly Punishment, he looked up and discovered that two hundred thousand years had passed!<br/><br/>“`<br/><br/>“`<br/><br/>This would once again break the record for his longest meditation in the Heavenly Palace!<br/><br/>“`<br/><br/>“`<br/><br/>The key point was that these two hundred thousand years were not spent in boredom.<br/><br/>“`<br/><br/>“`<br/><br/>He opened his eyes and saw that the purple-robed man was no longer there.<br/><br/>“`<br/><br/>“`<br/><br/>He was secretly alarmed. What kind of existence was the Absolute Emperor, to be able to manifest directly within his Heavenly Palace?<br/><br/>“`<br/><br/>“`<br/><br/>Could the Absolute Emperor be the force beyond the Three Realms that the Heaven Emperor spoke of?<br/><br/>“`<br/><br/>“`<br/><br/>Zhou Xue’s rebirth was due to him; Emperor Donggong’s dominion over the Mortal Realm was also due to his Divine Skills. According to the Heaven Emperor, the Absolute Emperor had also caused him great trouble before.<br/><br/>“`<br/><br/>“`<br/><br/>Where did he come from, and what was his purpose?<br/><br/>“`<br/><br/>“`<br/><br/>Fang Wang couldn’t figure it out, but the pressing matter was to first eliminate the Heaven Emperor, Karmic Dao Venerate!<br/><br/>“`<br/><br/>“`<br/><br/>He continued to cultivate the Great Dao Heavenly Punishment.<br/><br/>“`<br/><br/>“`<br/><br/>From Great Completion to Great Perfection, he leaped across a million years!<br/><br/>“`<br/><br/>“`<br/><br/>From Great Perfection, it took him another one million five hundred thousand years!<br/><br/>“`<br/><br/>“`<br/><br/>Throughout this process, Fang Wang’s understanding of the Great Dao deepened; he was not just comprehending the Three Thousand Rules of Power, but the very essence of the Great Dao’s existence.<br/><br/>“`<br/><br/>“`<br/><br/>The Great Dao is the foundation of everything!<br/><br/>“`<br/><br/>“`<br/><br/>The Great Dao is indestructible, but it can change!<br/><br/>“`<br/><br/>“`<br/><br/>Great Dao Heavenly Punishment does not destroy the Great Dao; it alters the Great Dao, causing the manifestations of its power to cease existing, while the Great Dao itself is reborn in another form.<br/><br/>“`<br/><br/>“`<br/><br/>Two million seven hundred thousand years of meditation brought Fang Wang’s cultivation to its zenith.<br/><br/>“`<br/><br/>“`<br/><br/>The environment of the Heavenly Palace shattered, and he opened his eyes to find that only a moment had passed in reality.<br/><br/>“`<br/><br/>“`<br/><br/>Zhou Xue asked anxiously, “How is it going, how long do you need?”<br/><br/>“`<br/><br/>“`<br/><br/>Supreme Saint, Fang Jing also turned to look at Fang Wang, wondering how could any Divine Skill be cultivated so quickly given the short time.<br/><br/>“`<br/><br/>“`<br/><br/>Fang Wang looked up and said softly, “How long? I’m sorry, but I have already mastered it.”<br/><br/>“`<br/><br/>“`<br/><br/>Mastered it?<br/><br/>“`<br/><br/>“`<br/><br/>Zhou Xue was stunned, and the Supreme Saint was equally shocked.<br/><br/>“`<br/><br/>“`<br/><br/>Fang Jing looked confused, having not heard Zhou Xue transmit anything.<br/><br/>“`<br/><br/>“`<br/><br/>Fang Wang’s gaze sharpened as the Eye of the Heavenly Dao once again formed on his forehead, emitting a terrifying silver light that shattered the shield and dispersed the darkness.<br/><br/>“`<br/><br/>“`<br/><br/>The surrounding darkness broke apart, revealing a pale expanse of space where countless clouds of qi flowed like long dragons of different colors.<br/><br/>“`<br/><br/>“`<br/><br/>The Heaven Emperor and Karmic Dao Venerate appeared, and their expressions changed drastically.<br/><br/>“`<br/><br/>“`<br/><br/>Even though they had been revived once more, they could distinctly feel that the Great Dao Power they wielded had been weakened.<br/><br/>“`<br/><br/>“`<br/><br/>What’s going on?<br/><br/>“`<br/><br/>“`<br/><br/>What just happened?<br/><br/>“`<br/><br/>“`<br/><br/>Fang Wang’s Eye of the Heavenly Dao concentrated silver light again, but this time, unlike the previous light of the Heavenly Dao, a gate of light materialized in front of him. Atop the light gate was carved the figure of the Absolute Emperor, with his hand pointing to the sky, and on both sides of the gate were densely packed runes of various sizes. If you looked closely, they resembled powerful figures.<br/><br/>“`<br/><br/>“`<br/><br/>Great Dao Heavenly Punishment!<br/><br/>“`<br/><br/>“`<br/><br/>The Heaven Emperor roared angrily as he and the Karmic Dao Venerate’s bodies merged, forming a terrifying figure shrouded in black qi. With a raise of his hand, he conjured a black sword, and slashed it down.<br/><br/>“`<br/><br/>“`<br/><br/>As the sword descended, the chaos of the void transformed instantly, transporting them to the space beyond the Immortal Realm.<br/><br/>“`<br/><br/>“`<br/><br/>With the Sword Qi falling, the Three Thousand Rules of Power in the void condensed as if they were three thousand bolts of thunder intertwined with the Sword Qi, inflicting boundless immortal might as they slashed down.<br/><br/>“`\t\t\t\t\t\t</div>", "images": {}, "success": true}