{"id": 493, "url": "https://www.novelhall.com/i-became-an-immortal-on-mortal-realm-32879/15225994.html", "title": "Chapter 483 - Chapter 483: Chapter 480: Great Dao Heavenly Punishment, A Higher Heaven And Earth", "volume": 5, "volume_title": "Volume 5", "body": "<h1>Chapter 483 - Chapter 483: Chapter 480: Great Dao Heavenly Punishment, A Higher Heaven And Earth</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 483: Chapter 480: Great Dao Heavenly Punishment, A Higher Heaven and Earth<br/><br/>“`<br/><br/>“Ah, their true selves are hidden within the Great Dao.”<br/><br/>Hearing the words of the Supreme Saint, Fang Wang picked up the conversation. His Eye of the Heavenly Dao continued to attack, ceaselessly wiping out the Heaven Emperor and the Karmic Demon Venerate.<br/><br/>The distance between the two sides kept closing, filling Fang Jing with dread.<br/><br/>An enemy they couldn’t kill was still drawing nearer; the visual impact and psychological pressure were unimaginable to ordinary people.<br/><br/>The Supreme Saint also made his move, trying to eliminate the Karmic Demon Venerate alone in order to separate the two, but it was to no avail. Each time they resurrected, they stood shoulder to shoulder again.<br/><br/>Just then,<br/><br/>Fang Wang suddenly noticed something, his gaze shifting to his right wrist. There was nothing on the wrist, but in his past life, it was adorned with a Jade Bracelet given to him by Zhou Xue.<br/><br/>He could feel Zhou Xue’s Spiritual Power attaching to his wrist out of nowhere, growing stronger rapidly.<br/><br/>He did not resist, allowing Zhou Xue’s Spiritual Power to be transmitted over.<br/><br/>About ten breaths passed, and the Heaven Emperor and the Karmic Demon Venerate were less than thirty feet from Fang Wang when suddenly, Zhou Xue’s Spiritual Power surged around Fang Wang’s right wrist, quickly condensing into her figure.<br/><br/>Zhou Xue was dressed in red, wearing a Phoenix Crown, with faint silhouettes of blood phoenixes spiraling within the crown’s hairpins.<br/><br/>Fang Wang glanced at her, a rare smile appearing on his face, and asked, “Have you also recovered the memories of your past life?”<br/><br/>He used the Great Dao of space-time to restore the memories of everyone around him, primarily for the sake of Zhou Xue.<br/><br/>In his view, a person without memories formed from their experiences was no longer the same person.<br/><br/>Staring at the Heaven Emperor, Zhou Xue said, “In fact, I had already recovered them when you told me, thanks to a treasured artifact left by that senior; it was also the reason for my reincarnation.”<br/><br/>“Which senior?” Fang Wang asked curiously.<br/><br/>Zhou Xue spoke softly, “Let’s finish them off first. My cultivation is not enough to contend with them, but I know the Karmic Demon Venerate’s weakness. In my previous life, the Jiu You Eye was wide open, causing chaos between yin and yang. I specifically investigated him; he is known as a forbidden existence, one whose name must not be mentioned, for he controls the rules of karma, or rather his Karmic power is stronger than the rules.”<br/><br/>“After investigating, I found out that he was suppressed because of the Red Dust Celestial Emperor, a remnant karmic monstrosity of the Immortal Court’s Destiny. The Immortal Court capriciously changed space-time, toyed with the Great Dao, and from the resulting karmic shadows, the Karmic Demon Venerate was born, becoming the calamity of the Immortal Court.”<br/><br/>“Extinguishing the Karmic Demon Venerate is simple; that is to erase all derived space-times, something even the Heaven Emperor cannot do, but you may be able to, given that your mastery of space-time already surpasses everyone in the Three Realms.”<br/><br/>As she spoke, she looked at Fang Wang, admiration showing in her eyes for the first time.<br/><br/>She had never crossed hands with Fang Wang from the beginning, but she knew that since her rebirth in the previous life, she could never catch up to him—any advantage seemed trivial in front of Fang Wang’s natural talents.<br/><br/>Finally, she understood something—their rebirths were to seek that supreme talent, to bring a new Path of Immortality to the Three Realms!<br/><br/>Hearing Zhou Xue’s words, the Karmic Demon Venerate’s eyes grew even colder.<br/><br/>Looking down at Zhou Xue, the Heaven Emperor said, “Even if you understand, what difference does it make? If he really could command the Great Dao of space-time, no matter how much I struggle, it would be in vain. Why would he wait until now?”<br/><br/>The Heaven Emperor raised his arms, and in an instant, countless eyes appeared out of thin air in the void chaos, with a Heaven Emperor stepping out through each eye.<br/><br/>The Great Freedom Dao Law of the Nine-Faced Divine Net!<br/><br/>Fang Wang could feel that the Heaven Emperor’s Great Freedom Dao Law was stronger, each avatar in time possessing power not inferior to the main body.<br/><br/>“Let’s see the limits of your Heavenly Dao, Fang Wang,” the Heaven Emperor said to him, his voice echoing. “If you defeat me, the Immortal Court will follow your lead, but don’t destroy this order directly. If I devour you, I will also treat your Heavenly Dao well, for it has given me hope to glimpse even higher powers!”<br/><br/>Billions of Heaven Emperors spoke in unison, their voices resonating to the nine heavens.<br/><br/>Fang Wang took a step forward, Heavenly Dao Suns emerged behind him, and in between them and him unfurled a black scroll.<br/><br/>“Mie Jue Divine Tome, truly an inextinguishable presence; even without the Absolute Emperor, it can still trouble me,” the Heaven Emperor said coldly, his words filled with anger when mentioning the Absolute Emperor.<br/><br/>The Karmic Demon Venerate’s momentum surged, his Karmic force sealing Fang Wang and his companions, countless illusions infiltrating their vision, all depicting their fears and loathsome things.<br/><br/>Fang Wang raised his hand to grasp the Heavenly Palace Halberd, his gaze becoming intense.<br/><br/>His will was focused inside the Treasured Spirit Space; he was mobilizing the power of the Heavenly Palace.<br/><br/>Boom! Boom! Boom…<br/><br/>Billions of Heaven Emperors unleashed their Divine Skills, their Mana bombarding Fang Wang and company. Fang Wang used his own Heavenly Dao Force to form a protective shield, blocking all attacks.<br/><br/>The stairs of the Heavenly Dao shattered, and they plummeted downward, the surrounding space breaking apart, as if they were falling into reincarnation.<br/><br/>The Supreme Saint raised his hand, aiding Fang Wang in resisting the attacks from the Heaven Emperor and the Karmic Demon Venerate, feeling deeply moved.<br/><br/>“So powerful… This Heaven Emperor is so strong…” he thought to himself, knowing well that he was no match for the Heaven Emperor’s Mana.<br/><br/>He couldn’t help but look towards Fang Wang.<br/><br/>Fang Jing and Zhou Xue also looked at Fang Wang; their cultivation was so weak that without Fang Wang’s protection, the Heaven Emperor’s might could easily crush them.<br/><br/>Zhou Xue seemed to think of something and asked, “Fang Wang, can you really master any ultimate skill in a short time?”<br/><br/>Unable to mobilize the power of the Heavenly Palace, Fang Wang responded to Zhou Xue without hesitation, “Yes, that’s right.”<br/><br/>Zhou Xue’s eyes flickered as she said, “I have a Divine Skill here. The senior who passed it on to me said that if I could perfect it, I would become unparalleled, effortlessly reversing karmic fates.”\t\t\t\t\t\t</div>", "images": {}, "success": true}