{"id": 495, "url": "https://www.novelhall.com/i-became-an-immortal-on-mortal-realm-32879/15225996.html", "title": "Chapter 485 (End) - Chapter 485: Chapter 480: Great Dao Heavenly Punishment, A Higher Heaven And Earth_3", "volume": 5, "volume_title": "Volume 5", "body": "<h1>Chapter 485 (End) - Chapter 485: Chapter 480: Great Dao Heavenly Punishment, A Higher Heaven And Earth_3</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 485: Chapter 480: Great Dao Heavenly Punishment, A Higher Heaven and Earth_3<br/><br/>“`<br/><br/>Time paused again!<br/><br/>From the gateway created by the Heavenly Dao’s punishment, a raging golden light and fierce flame burst forth, magnificent and vast, instantly engulfing the figure of the Heaven Emperor.<br/><br/>Within the blinding light, the Heaven Emperor lost his color, and to his despair, found himself unable to be revived. An unimaginable force was destroying everything he had, including his memories!<br/><br/>Zhou Xue turned her head to look at Fang Wang, who was looking up, with the gateway of the Heavenly Dao’s punishment above him and the Mie Jue Divine Tome and the Heavenly Dao Sun behind him. In this moment, Fang Wang’s aura peaked.<br/><br/>Even Zhou Xue could not help but feel a sense of admiration at that moment.<br/><br/>No, it was a feeling of infatuation!<br/><br/>Zhou Xue had always denied her feelings for Fang Wang, even advising him to accept other women, because she did not want to be bound by emotions.<br/><br/>But now, she did not want to lie to herself anymore.<br/><br/>Fang Wang suddenly took her hand, glanced at her and with a smile on his face, said, “You said that destroying all the parallel universes created by the Immortal Divine would annihilate the Karmic Dao Venerate, but have you ever considered that our Mortal Realm also arose because of the Immortal Divine.”<br/><br/>Zhou Xue naturally understood this, but she felt neither loss nor fear, instead she asked with a smile, “So what would you like to do?”<br/><br/>She felt that the current Fang Wang was omnipotent.<br/><br/>The corners of Fang Wang’s mouth lifted as he said, “To erase the karmic ties between the Immortal Divine and all the universes, allowing those universes to exist thoroughly, after all, I can’t bear to lose you, nor all the people I care about.”<br/><br/>The light from the Heavenly Dao’s punishment grew even more intense, engulfing the figures of Fang Wang, Zhou Xue, Supreme Saint, and Fang Jing.<br/><br/>The powerful figures from various factions in the great battle in the Immortal Court were also engulfed by the bright light.<br/><br/>Fang Hanyu and Fang Zigeng turned around subconsciously.<br/><br/>Fang Zigeng seemed to have seen something, a relieved smile appearing on his face as he murmured, “As I thought, you’d never let me down, just like when we were kids.”<br/><br/>As Fang Hanyu fought alongside him, he couldn’t help but ask, “You’re talking about…”<br/><br/>Before he could finish speaking, both lost consciousness.<br/><br/>…<br/><br/>The clouds dissipated, and sunlight streamed down, shining onto Kunlun. Those climbers seeking the Dao couldn’t help but look up, and the Wangdao Cultivators meditating and seeking enlightenment in various places also opened their eyes, looking towards the Firmament.<br/><br/>At the mountain summit.<br/><br/>Hong Xian’er and Gu Li arrived at the Dao Palace entrance, but no matter how Hong Xian’er called out, the doors of the Dao Palace wouldn’t open.<br/><br/>“Stop shouting, they are not in this Mortal Realm,”<br/><br/>a voice came from the side, and turning their heads, the two women were surprised to find an elder standing in front of a stele in the woods.<br/><br/>Supreme Saint!<br/><br/>After exchanging glances, Hong Xian’er and Gu Li walked over to the Supreme Saint, and looking at the stele, they saw it was inscribed with the figure of Fang Wang, above whose head a mysterious gateway was suspended.<br/><br/>“Which Mortal Realm have they gone to?” Hong Xian’er asked discontentedly, as Fang Wang had disappeared without saying goodbye again.<br/><br/>The Supreme Saint laughed and said, “How would I know? He said he was going to look for his hometown.”<br/><br/>Hometown?<br/><br/>Hong Xian’er frowned.<br/><br/>Gu Li, on the other hand, seemed to recall something, her thoughts drifting into reminiscence.<br/><br/>Meanwhile.<br/><br/>In the distant Xuandu Realm.<br/><br/>Earth, Huaxia.<br/><br/>Within the bustling city, where throngs of people came and went.<br/><br/>“`<br/><br/>“Sister, slow down, when an Immortal preaches, the whole world can hear; there’s no need to get so close to her,” Yang Jun said helplessly.<br/><br/>The one walking in front of him was indeed his sister, Yang Lin’er.<br/><br/>Yang Lin’er replied, “Stop talking nonsense and hurry up.”<br/><br/>Her eyes were fixed on what lay ahead, where behind a series of skyscrapers stood a golden tower with a Purple Dragon coiling around its summit. For some reason, whenever she looked at the Purple Dragon, it felt strangely familiar to her. An inexplicable excitement surged within her, making her want to approach the Purple Dragon.<br/><br/>She didn’t notice that, at the edge of the street some ten meters away inside a coffee shop, two people were watching them.<br/><br/>Zhou Xue, dressed in a black dress, held a coffee cup and asked teasingly, “You came here specifically to preach for her, yet you talk about searching for your homeland. You really say one thing and mean another.”<br/><br/>Fang Wang, dressed in casual clothes resembling an eighteen or nineteen-year-old, watched Yang Lin’er pressing through the crowd and smiled, “I truly am searching for my homeland; it’s just that I haven’t found it.”<br/><br/>Zhou Xue was about to ask more when suddenly, someone sat down beside Fang Wang. The newcomer laughed and said, “That means you should climb higher. As long as you stand high enough, you will eventually see the places you can’t presently see.”<br/><br/>Fang Wang turned his head and was shocked to see that the person was the Absolute Emperor.<br/><br/>The Absolute Emperor had taken off his purple robe and donned a plain Dao Robe. With his youthful appearance, he didn’t seem out of place even in the modern city.<br/><br/>“Senior…” When Zhou Xue saw the Absolute Emperor, she was about to stand up, but he raised his hand to stop her.<br/><br/>The Absolute Emperor laughed and said, “Don’t blame me for not revealing my real identity when we first met. After all, you’ve also concealed your identity from that girl outside.”<br/><br/>Zhou Xue frowned and asked, “Have you been paying attention to us all along?”<br/><br/>“Not really, it’s just that whoever my eyes sweep over, their entire life appears before me. That is the power once sought by the previous Heaven Emperor,” the Absolute Emperor laughed and explained.<br/><br/>Then, looking at Fang Wang, he continued, “Your talent should not come to a halt here. Chase after greater power. There are more opponents waiting for you up there.”<br/><br/>He stood up, patted Fang Wang on the shoulder, and then turned to leave.<br/><br/>Fang Wang couldn’t help but look at him and asked, “Senior, who are you really? Why do you care so much for us?”<br/><br/>“My surname is Han. As for why I care, it’s because I have my own selfish reasons, but I also admire you. You didn’t erase the Immortal Court, nor the already born timelines, which pleases me greatly. You are worthy of being the Heaven Emperor,” the Absolute Emperor said, waving his hand and walking out of the coffee shop without looking back.<br/><br/>The moment he left, Fang Wang could no longer sense his presence.<br/><br/>Fang Wang and Zhou Xue exchanged glances, both their eyes filled with confusion.<br/><br/>Fang Wang smiled and said, “Let’s not think about it too much. Let’s follow his advice, seek higher realms, and follow in his footsteps. You and I have not yet competed to see who is stronger. For now, I won’t take advantage of you. I’ll give you another million years to grow stronger. We’ll decide who is superior in the higher realms.”<br/><br/>Upon hearing this, the corners of Zhou Xue’s mouth curled up as she said, “Even though you’re stronger than me now, I won’t admit defeat in a new world. Don’t get complacent.”<br/><br/>“That’s impossible, I will always be above you.”<br/><br/>“Hmph, quite the big talker.”<br/><br/>“By the way, the Tai Cang Immortal Mansion is about to open. Shall we go together?”<br/><br/>“Fine. In my past life, I wanted to go but somehow missed the chance. Let’s see what kind of celestial fate the Tai Cang Immortal Mansion really hides.”<br/><br/>Elsewhere.<br/><br/>Atop the huge golden tower, Zi Ling coiled in the sky, looking down at a purple-robed woman meditating on the mountain’s peak.<br/><br/>This purple-robed woman was extremely beautiful and dignified, radiating an aura of sanctity that demanded respect.<br/><br/>Zi Ling spoke, “Xiao Zi, I haven’t seen the young master and the others. Are they really coming?”<br/><br/>The woman in purple was indeed Xiao Zi. With her eyes closed, she hummed, “It’s my first time preaching, and given the young master’s affection for me, he is sure to come.”<br/><br/>…<br/><br/>The end of the book.\t\t\t\t\t\t</div>", "images": {}, "success": true}