{"id": 490, "url": "https://www.novelhall.com/i-became-an-immortal-on-mortal-realm-32879/15220620.html", "title": "Chapter 480 - Chapter 480: Chapter 477: The Calamity Finally Arrives", "volume": 5, "volume_title": "Volume 5", "body": "<h1>Chapter 480 - Chapter 480: Chapter 477: The Calamity Finally Arrives</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 480: Chapter 477: The Calamity Finally Arrives<br/><br/>Under the watchful eyes of the Nine-Faced Divine Net and an assembly of Immortal Divine beings, the massive fireball created by the Wrathful God Luo’s mana suddenly contracted and disappeared as if into thin air.<br/><br/>Immediately after, they saw the figures of Fang Wang, Supreme Saint, and Fang Jing. Meanwhile, Wrathful God Luo landed on the steps of the Heavenly Dao.<br/><br/>The aura of Wrathful God Luo had completely dissipated, his physical body covered with stone-like cracks, with wisps of grey vapor seeping out of the crevices. He shook all over, unable to believe as he looked at Fang Wang, words failing to escape his lips.<br/><br/>Fang Wang maintained the gesture of his raised hand, a silver light orb floating above his palm, strands of grey vapor entering it, forming a vortex around the orb.<br/><br/>The Nine-Faced Divine Net appeared out of nowhere next to Wrathful God Luo, placing a hand on his back. He tried to use his own mana to aid Wrathful God Luo, but Wrathful God Luo’s cultivation, fate, and karmic ties were dissipating in an inconceivable manner. He had never encountered such a situation before.<br/><br/>“What’s happening…”<br/><br/>The Nine-Faced Divine Net was shocked. He turned his head towards Fang Wang, his gaze locking onto the silver orb in Fang Wang’s hand.<br/><br/>Fang Wang’s expression was unreadable as his right hand suddenly clenched, the silver orb shattered, vanished like smoke and clouds. Almost instantaneously, Wrathful God Luo turned to ash along with it, his presence vanished completely.<br/><br/>This scene deeply shocked the distant Immortal Divine beings—it was Wrathful God Luo, one of the Four Great War Gods of the Immortal Court!<br/><br/>To be vanquished by the flick of a wrist!<br/><br/>Impossible!<br/><br/>The Immortal Divine beings trembled, with many already contemplating retreat.<br/><br/>Fang Wang was without a doubt the most terrifying enemy the Immortal Court had ever faced!<br/><br/>The Nine-Faced Divine Net’s complexion turned extremely grim, feeling the pressure as Fang Wang approached him.<br/><br/>Mainly because he couldn’t penetrate the Divine Skills of Fang Wang, unable to understand how Fang Wang’s Divine Skills were deployed.<br/><br/>At that moment, circles of light began to appear one after another in the Firmament in all directions, rapidly expanding, with ranks of Immortal Divine beings, Buddhas, and mythical creatures flying out from them in a grand and dense swarm, including the Dragon Race and Phoenix Clan, arriving in an unceasing flow, compressing the space of the Firmament.<br/><br/>“Who is this demon who dares to disturb the order of the Three Realms!”<br/><br/>“Amitabha, the Immortal Divine are in trouble, the Immortal Realm ought to provide support.”<br/><br/>“The Dragon King of the Northern Sea brings the Dragon Race to aid!”<br/><br/>“The Zen Sect has arrived to protect the order of the Immortal Divine!”<br/><br/>Leaders of various forces shouted in succession, their voices shaking the heavens, greatly boosting the morale of the Immortal Divine beings.<br/><br/>Looking around, the Firmament seemed almost covered by these forces from the Immortal Realm, with countless powerful beings in sight.<br/><br/>There were even shouts directed at the Supreme Saint, threatening him not to act recklessly.<br/><br/>“Supreme Saint?”<br/><br/>Fang Jing couldn’t help but look at the Supreme Saint beside him, his expression one of surprise.<br/><br/>The voice of Xiao Zi came from within the Heavenly Palace Halberd, “Old man, did you ever encounter such a situation when you caused havoc in the Immortal Court back in the day?”<br/><br/>The Supreme Saint chuckled, “Of course, all these are forces that depend on the Immortal Court. They need the Immortal Divine to exist in order to seek fame and fortune for their own sects and races.”<br/><br/>“They have come even quicker than before; it seems that the current Heaven Emperor is no fool. He had already calculated this calamity and prepared in advance.”<br/><br/>Boom!<br/><br/>Another overwhelmingly powerful aura descended:<br/><br/>“The Immortal Court is in peril, and as a War God, how could this lord not come?”<br/><br/>One of the Four Great War Gods, Mysterious Divine Lord!<br/><br/>“`<br/><br/>A streak of aurora descended from the sky and landed next to the Nine-Faced Divine Net, facing Fang Wang together with him.<br/><br/>The Mysterious Divine Lord wore golden armor and was draped in a large cloak. The armor emitted golden illusions, dazzling and sacred, and his expression was so stern, with eyes of silver-blue.<br/><br/>The Nine-Faced Divine Net stared intently at Fang Wang and said, “His Divine Skills are not simple, be sure to be careful.”<br/><br/>The Mysterious Divine Lord quipped, “It’s been many years since we’ve fought side by side, it’s just a pity that the Lingxiao Saint Emperor betrayed us.”<br/><br/>The Nine-Faced Divine Net did not respond, both War Gods simultaneously summoned their Lifespirit Treasures. The Nine-Faced Divine Net’s treasure was a Single-Bladed Halberd, dark as night, swirling with blood-red energy, while the Mysterious Divine Lord conjured a longsword that glowed with blue light, with the phantom of a bluebird circling the hilt.<br/><br/>As the two great treasures appeared, a heavenly momentum erupted, making the Heavenly Dao’s long staircase tremble.<br/><br/>Seeing this scene, the Immortal Divines were even more excited.<br/><br/>Boom——<br/><br/>A deafening bell tolled, causing the souls of many creatures to be overturned.<br/><br/>Fang Jing instinctively looked back and saw a terrifying black crack appear on the horizon behind him, as if a fearsome entity beyond the heavens swung a sword that cut through the Firmament.<br/><br/>From within the black crack flew out huge circular platforms, each emanating with light and surrounded by runes forged by the power of laws, with numerous creatures standing atop them, and towering figures holding treasures stood like ancient demons.<br/><br/>“Fang Wang, we have arrived!”<br/><br/>The voice of Fang Hanyu came through, filled with excitement.<br/><br/>On his circular platform were also the figures of Zhou Xue and Fang Zigeng. At this moment, Fang Zigeng seemed to have returned to a previous life, his hair all white, exuding an evil and deadly aura.<br/><br/>The Mixed Origin Saint Lord was one of those towering figures. He spoke, “The Immortal Court is unkind, playing with the lives of commoners. It should no longer control the order of the Three Realms. Today, the Divine Platform will come to redefine the order for the Three Realms!”<br/><br/>As the voice fell, two forces from within the Divine Platform’s ranks exploded with momentum that did not fall short of the Nine-Faced Divine Net and the Mysterious Divine Lord.<br/><br/>The Mysterious Divine Lord narrowed his eyes and said, “Those two guys have also come, it seems this was part of their plan.”<br/><br/>The Nine-Faced Divine Net snorted coldly and suddenly charged towards Fang Wang.<br/><br/>He crossed hundreds of steps in a single stride, swirling his black halberd to rip through space. The Heavenly Palace Halberd smashed down towards him with force.<br/><br/>Clang!<br/><br/>The two halberds clashed, unleashing a terrifying shockwave and igniting the full-scale war.<br/><br/>“Kill——”<br/><br/>A Great Cultivator of the Divine Platform unsheathed his sword and roared in anger. Before his words had faded, his Sword Blade burst with a myriad of purple lights, turning into an overwhelming purple heavenly fire that swept towards all the forces supporting the Immortal Court.<br/><br/>The Supreme Saint hesitated whether to take action but then heard Fang Wang’s voice, “You protect him, and I will resolve my karmic debt.”<br/><br/>Fang Wang stepped down, and the Heavenly Palace Halberd released an even stronger momentum, knocking the black halberd away and forcing the Nine-Faced Divine Net to retreat downwards.<br/><br/>The Mysterious Divine Lord rushed over, bracing the shoulders of the Nine-Faced Divine Net, and together they were pushed back five steps.<br/><br/>He looked at Fang Wang, who was taking step by step down the stairs, with wary eyes and gritted his teeth, “This fellow’s momentum has already surpassed the Supreme Saint!”<br/><br/>The Nine-Faced Divine Net raised his hand and remotely called back the black halberd. He took a step forward, casting spells with his left hand, as various treasures coalesced before him—a bow, sword, knife, tower, umbrella, disc, stick, scissors. Along with the black halberd in his hand, there were a total of nine Lifespirit Treasures.<br/><br/>He mumbled something under his breath. Eight Lifespirit Treasures quickly merged into the black halberd, and the blood-red energy on his body surged.<br/><br/>He stomped forward with his right foot, the heavens and earth changed color, and suddenly Fang Wang and his companions found themselves in a blood-red world, with eyes opening all around them, each belonging to the Nine-Faced Divine Net.<br/><br/>Fang Wang sensed a mass of energies attacking him, identical to that of the Nine-Faced Divine Net, and even coming from within the rules of time.<br/><br/>The Nine-Faced Divine Net was summoning versions of himself from different periods!<br/><br/>“`\t\t\t\t\t\t</div>", "images": {}, "success": true}