{"id": 7, "url": "https://www.novelhall.com/my-brothers-the-protagonist-good-thing-i-awakened-my-system-33973/14946551.html", "title": "Chapter 7: My Younger Brother Is A Protagonist!", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 7: My Younger Brother Is A Protagonist!</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 7: My Younger Brother Is A Protagonist!(Damn! That's a protagonist line!)<br/><br/>Feng Chen thought to himself. He thought, perhaps but now he was almost sure that his younger brother had a template of a main character.<br/><br/>Which webnovel readers don't know about this bloody plot of a fiancee withdrawing from marriage when the main character was at his lowest, only for that main character to defeat his fiancee in the future.<br/><br/>And Feng Yun just delivered some badass line which was totally something that those main characters use.<br/><br/>(Looks like the change that I sensed in Feng Yun was not just a mere illusion that I felt but it might be that he already got his golden finger!)<br/><br/>Feng Chen concluded.<br/><br/>Feng Chen then proceeded to guess just what kind of golden finger his younger brother might have gotten.<br/><br/>It shouldn't be a System! That will collide with my own golden finger!<br/><br/>Then could it be an old man residing in a ring? Or maybe he remembers his previous life? Or traveling back in time?<br/><br/>Or some supreme treasure that could make him stronger?<br/><br/>Whatever the case might be, it should be good for Feng Yun!<br/><br/>Outside Feng Chen's thoughts, the bloody plot was still happening.<br/><br/>\"Y-You... You dare divorce me?\"<br/><br/>Looking at the bloody contract on the table, Ling Meiyu's eyes opened wide in disbelief.<br/><br/>How can she, who is the princess of the Ling Family and Mystic Flame Sect little sect leader, be humiliated like this?<br/><br/>Even in her wildest thoughts, she never expected something like this to happen.<br/><br/>*CLAP! *CLAP!<br/><br/>\"Good! Worthy of being a member of my Feng!\"<br/><br/>Feng Chen exclaimed while applauding.<br/><br/>Unlike what others would do, Feng Chen didn't get angry at Feng Yun, instead was very happy.<br/><br/>This confused many of the guests. They thought that these two brothers were hell-bent on offending the Mystic Flame Sect.<br/><br/>One was insulting the little sect leader of Mystic Flame Sect and another was praising him instead of reprimanding him.<br/><br/>Truly, brothers from the same mother-impossible to predict!<br/><br/>Feng Yun was also a little surprised by his brother's behavior but was happy that his brother supported him.<br/><br/>(Not bad, not bad at all! It seems the Feng Clan still has a trump card up its sleeve!)<br/><br/>A voice said to Feng Yun.<br/><br/>(Senior Minghao, what do you mean?)<br/><br/>Feng Yun asked confusedly.<br/><br/>(Hehe... That brother of yours is hiding himself quite well. Pity that he had met me!)<br/><br/>Senior Minghao said as he looked at Feng Chen curiously.<br/><br/>(Feng Yun, you don't need to worry about anything. It seems like everything is under your brother's control!)<br/><br/>Senior Minghao said as his voice disappeared.<br/><br/>Feng Yun was still confused by what Senior Minghao said.<br/><br/>But he understood that the situation was not very dangerous and that his brother had some countermeasures against the Mystic Flame Sect.<br/><br/>Thinking about that, he felt relieved!<br/><br/>He then turned his attention back to completing the task he had come here for.<br/><br/>\"And the Feng Clan does not accept the Mystic Flame Sect's so-called 'reparation gift.' Such a low-quality pill is an insult to my clan and to myself.\"<br/><br/>The crowd murmured in astonishment.<br/><br/>The three major families-Zhao, Liu, and Yan-watched with interest, their earlier glee replaced by surprise and curiosity.<br/><br/>They truly didn't expect Feng Yun to be so bold as to divorce Ling Meiyu. With this, not only is their relationship with the Ling Family and Mystic Flame Sect broken but it has turned sour.<br/><br/>It is still unknown whether the Feng Clan will see tomorrow's sun after offending the Mystic Flame Sect.<br/><br/>Elder Zhou's face darkened with irritation.<br/><br/>\"Boy, you should take what is given. Don't refuse a toast only to drink a forfeit!\"<br/><br/>(How could the pills be returned? If they are, I won't be able to claim the genuine pill.)<br/><br/>Elder Zhou thought, frustrated that his plan was being thwarted. He didn't care much about the divorce itself; his concern was securing the pill.<br/><br/>\"Humph! Such a low-quality pill could damage the meridians of my brother and might even cripple my brother's cultivation. You can take this pill yourself!\"<br/><br/>Feng Yun retorted.<br/><br/>Senior Minghao had already assessed the pill in Elder Zhou's hand as a failed product.<br/><br/>It wouldn't help anyone advance from the Grand Qi Condensation Realm to the Three<br/><br/>Elements Divine Realm; it could even cause serious injury.<br/><br/>This is one of the reasons why Feng Yun was so angry.<br/><br/>(Not only do they want to humiliate me and my clan, but they also plan to harm my brother. Such vicious people! I will never forgive them!)<br/><br/>Feng Yun vowed.<br/><br/>\"You have quite the nerve. Did you say that the pill refined by Pill King is of low quality?\"<br/><br/>Elder Zhou's anger flared. He was baffled by how Feng Yun could discern the pill's poor quality but was determined to prevent others from discovering it.<br/><br/>(I must deliver this pill to them, no matter what!)<br/><br/>\"Pill King? Did he refine that pill?\"<br/><br/>\"Damn! Wish it was me who received that pill. Feng Chen is too lucky!\"<br/><br/>\"How dare a junior slander someone like Pill King? This Feng Yun truly doesn't understand<br/><br/>his place.\"<br/><br/>The guests once again became excited when they heard the name Pill King.<br/><br/>Who was Pill King? It was the greatest Alchemist of the Azure Sky Empire who is the one and<br/><br/>only 6th-ranked Alchemist.<br/><br/>Even the strongest cultivator and sect has to show respect to this individual.<br/><br/>\"Do you think you can slander the Mystic Flame Sect and come out unscathed?\"<br/><br/>Elder Zhou growled as he lunged towards Feng Yun.<br/><br/>\"Bold!\"<br/><br/>Feng Chen said as he noticed what Elder Zhou was trying to do.<br/><br/>SWISH!<br/><br/>With a swift motion, Feng Chen stepped in front of Feng Yun.<br/><br/>\"Humph! Do you think that you can stop me just because we are in the same realm? Today, I am going to show you what it means to offend Mystic Flame Sect.\"<br/><br/>Elder Zhou said as he showed no sign of stopping. Despite being in the same realm, he<br/><br/>believed that he was stronger as he had learned many strong techniques from the Mystic<br/><br/>Flame Sect.<br/><br/>Zhao, Liu, and Yan's family couldn't be happier seeing Elder Zhou take action. They believed that after today, Feng Chen would be crippled, leaving the Feng Clan helpless.<br/><br/>Elder Xian also didn't stop Elder Zhou. He just thought that he would help if Elder Zhou went overboard to save face.<br/><br/>As for Ling Meiyu, she was panicking a bit. She just wanted to withdraw from her engagement and never wanted to harm the Feng Clan. Alas, everything was too late for her to stop!<br/><br/>(Truly a villain who overestimates himself!)<br/><br/>Listening to Elder Zhou's words, Feng Chen couldn't help but smirk.<br/><br/>(Just because a tiger is sleeping doesn't mean it's a kitten.)<br/><br/>\"Brother!\"<br/><br/>Feng Yun called out, his voice full of worries.<br/><br/>\"Yun, don't move!\"<br/><br/>Feng Yun nodded his head. He was concerned about his brother, but looking at the confidence<br/><br/>his brother exuded, he knew that his brother could handle it. S~eaʀᴄh the nôvel_Fire.ηet website on Google to access chapters of novels early and in the highest quality.<br/><br/>As Elder Zhou's attack came crashing toward him, it was met head-on by Feng Chen's energy.<br/><br/>The two forces collided in a dazzling display of light and power, but Feng Chen's wave<br/><br/>absorbed Elder Zhou's strike with effortless ease.<br/><br/>The spectators gasped, their earlier glee replaced by disbelief. They had underestimated Feng<br/><br/>Chen's strength.<br/><br/>The three major families exchanged worried glances, realizing that the Feng Clan was far<br/><br/>from being a pushover.<br/><br/>Feng Chen's gaze remained fixed on Elder Zhou, a smirk playing at the corners of his lips.<br/><br/>\"You see, Elder Zhou, I already said that this is Feng's territory and one must watch their<br/><br/>behavior. Perhaps I was not very clear earlier.\"<br/><br/>Elder Zhou's eyes widened in shock and anger. He had expected an easy victory, but Feng Chen effortlessly dissipated his attack.<br/><br/>\"You... you're stronger than I anticipated!\"<br/><br/>\"Indeed,\" Feng Chen said, stepping forward. \"And it is not wise to provoke someone stronger<br/><br/>than you!\"<br/><br/>Feng Chen's aura flared, a powerful energy that seemed to radiate an air of invincibility.<br/><br/>He had held back until now, but it was clear that he had to show some of his power to let others know that Feng Clan is not something that anyone can offend.<br/><br/>With a decisive step forward, Feng Chen channeled a tremendous wave of energy, his aura<br/><br/>flaring intensely.<br/><br/>Elder Zhou, his instincts screaming of impending peril, threw up a desperate defense to intercept the attack. However, the effort proved futile.<br/><br/>Feng Chen's strike carried a force far beyond Elder Zhou's expectations, slicing through his<br/><br/>defenses like they were mere paper.<br/><br/>\"NOOOO!\"<br/><br/>Elder Zhou screamed in horror.<br/><br/>*BANG!<br/><br/>The impact was cataclysmic, hurling Elder Zhou backward with such force that he slammed<br/><br/>into the ground with a resounding thud, his body skidding several feet before coming to a<br/><br/>halt.<br/><br/>On the other hand, Feng Chen stood unwavering, his gaze cold and resolute-today's battle was only the beginning.\t\t\t\t\t\t</div>", "images": {}, "success": true}