{"id": 8, "url": "https://www.novelhall.com/my-brothers-the-protagonist-good-thing-i-awakened-my-system-33973/14946552.html", "title": "Chapter 8: A Display Of Power!", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 8: A Display Of Power!</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 8: A Display Of Power!The crowd fell silent, stunned by the sheer display of power from Feng Chen.<br/><br/>They looked at Elder Zhou who was lying on the ground and then to Feng Chen who stood nonchalantly.<br/><br/>They still couldn't believe their eyes.<br/><br/>One move!<br/><br/>It only took one move from Feng Chen to knock out one of the elders from the Mystic Flame Sect.<br/><br/>Where was the arrogance now? Where were the dire consequences of offending the Mystic Flame Sect? Was this it?<br/><br/>Elder Zhou lay sprawled on the ground, his once proud and imposing figure reduced to a pitiful sight.<br/><br/>His robes, now disheveled and stained with dirt, clung to his form in a way that highlighted his defeat.<br/><br/>Who knew that there was such a vast difference in their power? Though they expected it to be the other way around.<br/><br/>Zhao, Liu, and Yan's families were even more terrified. They were only wary of the Ling Family who might help the Feng Clan.<br/><br/>Even if Feng Chen was at the peak of Grand Qi Condensation, they thought that he alone couldn't stop the forces of three major families combined.<br/><br/>But Feng Chen proved them wrong with one move.<br/><br/>Their earlier mockery was instantly turned into dread. Feng Chen was someone that they should never mess with.<br/><br/>\"Too powerful! No wonder he was called 'Invincible below Grand Qi Condensation' ten years ago!\"<br/><br/>\"Feng Head is hiding too deep. With such power, who dares go against the Feng Clan in the future?\"<br/><br/>Because Feng Chen had been keeping a low profile these days, they forgot how powerful he<br/><br/>was.<br/><br/>Although Feng Chen never considered himself a genius, he was undoubtedly the most talented person born in Misty Vale City in a thousand years.<br/><br/>\"Are you alright?\"<br/><br/>Feng Chen asked Feng Yun.<br/><br/>Feng Yun nodded, his respect for his elder brother growing even more. Feng Yun thought that everything was really under his brother's control just like Senior Minghao said.<br/><br/>\"I'm fine, thanks to you!\"<br/><br/>Feng Chen smiled, then turned to look at the Mystic Flame Sect members, his expression turning grim.<br/><br/>The people of the Mystic Flame Sect looked anything but good. Some were confused by what had happened, others visibly shaken by the overwhelming power they had just witnessed.<br/><br/>They had come to intimidate the Feng Clan, but now they were the ones feeling the weight of fear and uncertainty.<br/><br/>Elder Xian, in particular, looked gloomy. He had never expected Zhou to lose to Feng Chen, at least not in such a manner.<br/><br/>If this matter reached the ears of the upper echelons of the Mystic Flame Sect, he would be severely punished for not managing the situation well.<br/><br/>(Damn it!)<br/><br/>Elder Xian stepped forward, his face showing a mix of frustration and a desire to maintain dignity.<br/><br/>\"Feng Clan leader, there was no need to be so heavy-handed!\"<br/><br/>Feng Chen's gaze was unwavering as he responded, \"I warned you before that this is Feng Territory. This is not a Mystic Flame Sect playground, where you can act as you please and expect no consequences.\"<br/><br/>Feng Chen didn't see any need to hold back his words since his and the Mystic Flame Sect's relationship was already ruined.<br/><br/>\"And I have already given your Mystic Flame Sect enough face. Otherwise, your Elder Zhou would be dead!\"<br/><br/>Feng Chen's tone was cold and threatening, a clear warning to Mystic Flame Sect and other hostile guests present there.<br/><br/>Elder Xian's eyes narrowed, clearly taken aback by Feng Chen's directness. It seemed they had to suffer some loss today.<br/><br/>\"If you have nothing more to say then you can leave!\"<br/><br/>Feng Chen said in a commanding tone.<br/><br/>Who would have expected a family head of such a small clan to take on such an attitude against the Mystic Flame Sect's elders?<br/><br/>Elder Xian stared at Feng Chen for a while but was helpless to do anything.<br/><br/>\"Humph! We will take our leave for now. But remember, the Mystic Flame Sect will not forget this easily.\"<br/><br/>Elder Xian said as he angrily stormed off. Ling Meiyu on the other hand was eerily quiet as she followed behind.<br/><br/>The other disciples soon followed with some carrying the unconscious Elder Zhou.<br/><br/>The atmosphere at Feng Mansion was silent after people from the Mystic Flame Sect left.<br/><br/>\"Haha! Sorry everyone that you had to see something like this.\"<br/><br/>Feng Chen said in an apologetic tone.<br/><br/>\"No need to worry, Patriarch Feng,\" one of the guests quickly replied, stepping forward with a deep bow.<br/><br/>\"It was our honor to join you on your 30th birthday. What an impressive display of strength!\" Another guest, eager to show their support, added, \"Indeed! Patriarch Feng's prowess is truly remarkable. Worthy of being the strongest person in Misty Vale City!\"<br/><br/>\"I agree,\" said a third guest, their tone filled with admiration. \"The way you handled the situation was nothing short of exceptional. The Patriarch Feng's reputation is deserved.\"<br/><br/>The guests quickly came to flatter Feng Chen. With the power he displayed, many first- and second-rated clans wanted to leave a good impression on him.<br/><br/>While some were unsure whether to befriend the Feng Clan or not, true that Feng Chen might be the strongest person in Misty Vale City, but he had offended the number one sect of Azure<br/><br/>Sky Empire.<br/><br/>Befriending the Feng Clan could lead to being implicated by the Mystic Flame Sect.<br/><br/>So while some were gambling on the Feng Clan, others chose to play it safe by not getting<br/><br/>involved.<br/><br/>In any case, everyone present didn't want to be enemies with the Feng Clan. Even if they couldn't be friends, they definitely couldn't afford to be their enemies.<br/><br/>The Zhao, Liu, and Yan families' moods turned sour as they saw that the Feng Clan's reputation had not been ruined by the marriage withdrawal but had risen due to Feng Chen's<br/><br/>display of power.<br/><br/>\"Humph! Feng Chen, don't be so happy! Only time will tell whether you have made a good<br/><br/>decision or not.\"<br/><br/>\"Offending Elder Zhou, they can only end up dead. Elder Zhou is particularly known for his<br/><br/>petty heart. He will definitely not spare the Feng Clan.\"<br/><br/>\"Till then, the Feng Clan can enjoy as much as they want!\"<br/><br/>The three families left the Feng Mansion. They needed to change their initial plan and prepare<br/><br/>a new one.<br/><br/>They thought they could take down the Feng Clan easily without the Ling Family's support,<br/><br/>but Feng Chen proved them wrong.<br/><br/>It was best for them to wait until they were sure they could take care of Feng Chen.<br/><br/>\"Impressive as always, Patriarch Feng. I look forward to our next encounter.\" \"Patriarch Feng, it has been an honor to witness your strength today. I shall take my leave too.\"<br/><br/>Feng Chen nodded in acknowledgment, accepting their praises with a calm demeanor. \"Thank you for your kind words. I hope you all enjoyed the banquet.\"<br/><br/>As the guests continued to offer their compliments and gradually took their leave, Feng Chen's attention turned to his system, already wanting to check the System store. However, he still has to wait a bit.<br/><br/>He turned to Feng Yun, who stood by his side, still visibly impressed by his elder brother's<br/><br/>power.<br/><br/>\"Feng Yun, make sure our guests are seen off properly,\" Feng Chen instructed.<br/><br/>Feng Yun nodded. \"Of course, Elder Brother.\"<br/><br/>Once the guests had left, Feng Chen turned and gestured to one of the clan's attendants.<br/><br/>\"Summon all the elders and geniuses of the clan to the main hall!\"<br/><br/>\"Understood, Family head!\" S~eaʀᴄh the nôvel_Fire.ηet website on Google to access chapters of novels early and in the highest quality.<br/><br/>The attendant bowed and quickly hurried off to carry out the order.<br/><br/>(Now shall I check what's in the System store!)\t\t\t\t\t\t</div>", "images": {}, "success": true}