{"id": 4, "url": "https://www.novelhall.com/my-brothers-the-protagonist-good-thing-i-awakened-my-system-33973/14946548.html", "title": "Chapter 4: Ling Meiyu", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 4: Ling Meiyu</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 4: Ling MeiyuThe Feng Clan's grand hall was soon abuzz with activity, the atmosphere charged with anticipation.<br/><br/>In the midst of the crowd's eager anticipation, a banner bearing the words \"Mystic Flame\" came into view.<br/><br/>They were an imposing group: their leader, a figure exuding authority, was accompanied by a group of elite cultivators. The air seemed to crackle with their presence.<br/><br/>\"What a grand display! The Mystic Flame Sect has arrived with a dozen people, and the weakest among them is at the Core Formation Stage!\"<br/><br/>The guests couldn't believe their eyes. If someone so young could reach the Core Formation Stage in the Misty Vale City then he/she would already be considered the number 1 genius.<br/><br/>However, the Mystic Flame Sect can easily bring out tens or hundreds of those people and they weren't considered anything in the Mystic Flame Sect.<br/><br/>\"Look at those three leading the group,\" the Liu Family Elder said solemnly. \"I can't see through their cultivation. They must be at the Peak Core Formation Stage or even higher!\"<br/><br/>\"That girl in the lead, she's stunning!\" someone in the crowd whispered, unable to hide their admiration.<br/><br/>The rest of the people listened to these words and began murmuring among themselves, the buzz of excitement and curiosity growing louder.<br/><br/>It was worthy of being a giant of the Azure Sky Empire, known far and wide for its power and prestige.<br/><br/>Feng Chen also secretly observed the visitors.<br/><br/>Among them was a young and beautiful woman, who looked to be only sixteen or seventeen years old, yet her aura suggested she had already entered the Qi Grand Condensation Realm.<br/><br/>Feng Chen was shocked. Entering the Qi Grand Condensation Realm before sixteen was the mark of a true genius!<br/><br/>Those are the people who can reach Nascent Soul Realm or even higher.<br/><br/>He couldn't help but marvel at the young woman's talent.<br/><br/>In the entire Azure Sky Empire, such geniuses were exceedingly rare and highly sought after.<br/><br/>Feng Chen took a step forward, bowing respectfully.<br/><br/>\"Welcome, esteemed guests from the Mystic Flame Sect. We are honored by your presence.\"<br/><br/>Feng Chen stepped forward to greet them, his demeanor respectful and composed.<br/><br/>\"I am Feng Chen, the head of the Feng Clan. It is an honor to receive you. Please, make yourselves comfortable!\"<br/><br/>The leader of the delegation, a stern and commanding man with a powerful aura, nodded slightly.<br/><br/>\"I am Elder Xian of the Mystic Flame Sect. We appreciate your warm welcome, Feng Head.\" (Peak of Grand Qi Condensation Realm! Indeed an Elder from Mystic Flame Sect.)<br/><br/>The group of people from Mystic Flame Sect then proceeded to sit on the chair which had been hastily prepared.<br/><br/>\"Ahem!\"<br/><br/>Elder Xian cleared his throat and stood up. Putting his hands together, he smiled and said,<br/><br/>\"Clan leader Feng Chen. The reason we came here today is because we would like your help with something.\"<br/><br/>\"Of course, Elder Xian, if you have any problems, just let me know. If I can help you solve it, then I definitely wouldn't dare say no.\"<br/><br/>Feng Chen replied, maintaining his respectful demeanor. He didn't outright promise nor reject since he didn't know what their intention was.<br/><br/>\"Leader Feng, do you know her?\"<br/><br/>Elder Xian smiled lightly and pointed to the girl next to him.<br/><br/>\"Umm... I'm sorry, this girl is...\"<br/><br/>Feng Chen looked over at the girl and awkwardly shook his head. After becoming Clan leader,<br/><br/>he barely had any spare time to worry about other things.<br/><br/>So, even if she were some famous genius that everyone might recognize, Feng Chen had no clue about her.<br/><br/>The girl, who had remained silent until now, stepped forward and bowed.<br/><br/>\"I am Ling Meiyu. Brother Feng, I haven't come to pay my respects in a long time. It's my fault that you don't recognize me.\"<br/><br/>The crowd was astonished. The super genius from Mystic Flame Sect actually addressed Feng Head as a brother.<br/><br/>The three Major Families' expressions became even worse.<br/><br/>They knew that Feng Clan had some kind of connection with the Ling Family but didn't know<br/><br/>it was to the point that even their own genius addressed Feng Chen as a brother.<br/><br/>Feng Chen was first stunned when he heard the name Ling Meiyu and then he came to a realization.<br/><br/>She is the daughter of Ling Jian of the Ling Family. The Ling family is one of the most powerful families and is said to be just below the imperial family.<br/><br/>Feng Clan shared a good relationship with the Ling family when his parents were still here. Sёarᴄh the novёlF~ire.net website on Google to access chapters of novels early and in the highest quality.<br/><br/>His father and Ling Meiyu's father were sworn brothers who would occasionally hang out with each other.<br/><br/>(Although I don't have many memories about Ling Jian. I do remember my father and him going to drink together when he came to visit us.)<br/><br/>Although he was unsure as to how they became friends, he was sure that they were very close.<br/><br/>It was to the point they had decided to wed their future children with each other, thus becoming real families.<br/><br/>Meaning, Ling Meiyu was engaged to Feng Yun.<br/><br/>As for why Feng Yun was engaged instead of Feng Chen, it was because of her age. Feng Yun<br/><br/>was born a year later than Ling Meiyu.<br/><br/>That was when the two families decided to officially engage Ling Meiyu and Feng Yun.<br/><br/>But with the disappearance of his parents, it had become a distant memory.<br/><br/>The Ling family also didn't mention the engagement during this period which prompted Feng Chen to forget about that.<br/><br/>Feng Chen had memories of carrying Ling Meiyu when she was just an infant but it was years ago. No wonder he couldn't remember her until she mentioned her name.<br/><br/>\"So it's Sister Ling Meiyu! Forgive me for my poor memories, I almost couldn't recognize<br/><br/>you.\"<br/><br/>Feng Chen said smilingly.<br/><br/>\"It's been many years, and I haven't visited Uncle Ling Jian for a long time, and I don't know how your father is doing. I hope your father doesn't blame me.\"<br/><br/>Feng Chen said. He remembers going to Ling's mansion a couple of times when he was a child but that was all before his parents disappeared.<br/><br/>Ling Meiyu's cheek flushed red and she seemed to be embarrassed and confused about<br/><br/>something.<br/><br/>She stiffly replied, \"My father met a powerful person and was injured. Since then, he has been<br/><br/>recovering at home.\"<br/><br/>\"Uncle Jian is injured?\"<br/><br/>Feng Chen was shocked by the news.<br/><br/>(Can anyone even injure Ling Jian in this Azure Sky Empire?)<br/><br/>Ling Jian was in the Nascent Soul Realm which is considered strongest in Azure Sky Empire. Therefore, it was hard to believe that Ling Jian was injured.<br/><br/>Ling Meiyu looked at Feng Chen being so concerned about her father, and looked even more embarrassed. She could only quietly reach out and pull the sleeve of Elder Xian next to her.<br/><br/>\"Ahem! Feng Head, getting back to the topic.\"<br/><br/>Elder Xian interrupted.<br/><br/>\"Ling Meiyu is not only the genius personally recruited by Mystic Flame Sect but also the<br/><br/>personal disciple of Sect Leader Xiao Ning!\"<br/><br/>With Elder Xian's words, there was another buzz of discussion among the guests.<br/><br/>The younger generation of Feng Clan were all looking at Ling Meiyu with envy and<br/><br/>admiration.<br/><br/>On the other hand, there were people from Zhao, Liu, and Yan who wore even uglier<br/><br/>expressions on their faces.<br/><br/>With Feng Clan's future daughter-in-law being so talented as to become Mystic Flame Sect's personal disciple, how could they continue going against Feng Clan?<br/><br/>\"Hehe, I heard previously that the Mystic Flame Sect leader personally went to recruit a peerless genius. At the time, I didn't know it was Sister Ling Meiyuu. What incredible talent<br/><br/>you must have...\"<br/><br/>Feng Chen complimented, though a bad feeling gnawed at his heart.<br/><br/>The flow of conversation felt eerily similar to the many novels he had read in his previous life.<br/><br/>\"It was just good luck...\" Smiling lightly, Ling Meiyu began to feel even more uncomfortable.<br/><br/>\"Hehe, Leader Feng, the request that I have made relates to Meiyu. In addition, this was assigned by our sect leader...\"<br/><br/>Elder Xian kept his smile but when he mentioned the sect leader, he subconsciously lessened his smile and his face grew serious.<br/><br/>With the power behind his back, Elder Xian didn't think that there was any need to continue<br/><br/>being polite with a small family like Feng.<br/><br/>Like Elder Xian, Feng Chen stopped smiling. He had the feeling that he knew what they were<br/><br/>going to say next.<br/><br/>\"Elder Xian, please tell me what the sect's request is?\"\t\t\t\t\t\t</div>", "images": {}, "success": true}