{"id": 5, "url": "https://www.novelhall.com/my-brothers-the-protagonist-good-thing-i-awakened-my-system-33973/14946549.html", "title": "Chapter 5: Breaking Off The Engagement!", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 5: Breaking Off The Engagement!</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 5: Breaking Off The Engagement!\"That is, Feng Clan Head, our Mystic Flame Sect's upper echelons have received word that the engagement of Miss Ling Meiyu, with your Clan, is still in place. We wish to address this matter.\"<br/><br/>The room erupted in a frenzy.<br/><br/>The crowd, especially members of the three major families-Zhao, Liu, and Yan-stared in shock.<br/><br/>Could it be that the Feng Clan had already hugged the thigh of Mystic Flame Sect?<br/><br/>However, several sharp-eyed observers noticed that the Mystic Flame Sect's arrival was not as celebratory as initially assumed.<br/><br/>Even if there was an engagement between Feng Yun and Ling Meiyu, it didn't make sense for elders from the Mystic Flame Sect to come.<br/><br/>However, they didn't need to guess as Elder Xian gave the answer right away.<br/><br/>\"I hope the Feng family can break off their marriage contract with Ling Meiyu!\"<br/><br/>Elder Xian said solemnly.<br/><br/>Feng Chen's expression darkened. Although he had anticipated this, Feng Chen was still annoyed and angry.<br/><br/>Previously, he had read about such scenarios in novels without much thought about what the protagonist and the one who cared about him must be going through.<br/><br/>But now, facing the same situation himself, he was very angry. He knows how much of Feng Clan's reputation would be lost if he accepted their demands just like that.<br/><br/>More than that was the reputation of his younger brother. It was already bad within and outside of the Feng Clan because of his low talent.<br/><br/>And with his engagement withdrawal, it will only continue to get worse!<br/><br/>His emotions surged as he considered the implications for his clan and his younger brother, Feng Yun.<br/><br/>The atmosphere has changed, and Feng Chen could sense the judgment in the eyes of the onlookers.<br/><br/>They seemed to be laughing and ridiculing the Feng Clan at the moment.<br/><br/>The once Feng clan members who were happy and had joyous faces instantly turned dark.<br/><br/>Even those members who didn't get along with Feng Yun were angry at the fact that he was being humiliated like this.<br/><br/>Although some Feng members might look down on Feng Yun due to his low talent, but as his kin, how could they tolerate others humiliating him like this?<br/><br/>It was only because they were afraid of implicating their families that they controlled themselves.<br/><br/>The three major families looked at Feng Chen with mockery. They wanted to laugh in his face but controlled themselves and wanted to see how Feng Chen would handle this matter.<br/><br/>Whether Feng Chen accepts or rejects the Mystic Flame Sect's request, both were good for them.<br/><br/>(After today, Misty Vale City will only have Four Major Families!)<br/><br/>Zhao, Liu, and Yan people thought to themselves. With the relationship between Feng and Ling severed, they didn't think Feng would be able to defend against the three of their families.<br/><br/>And if Feng Chen offended the Mystic Flame Elders then they thought that they wouldn't even need to do anything and Feng Clan would disappear overnight.<br/><br/>\"Good! Very Good!\"<br/><br/>Feng Chen said loudly, a bit of anger mixed in his words.<br/><br/>The Elders of Feng Clan sensing that Feng Chen was getting angry, immediately went to calm him down.<br/><br/>\"Nephew! Please control yourself. They are from Mystic Flame Sect!\"<br/><br/>One of the Elders, who is his uncle, whispered to Feng Chen. Although he was also angry, he knew that going against the Mystic Flame Sect would only lead to Feng Clan's destruction.<br/><br/>It was the number one sect with many people in the Grand Qi Condensation Realm and even the Three Elements Divine Realm.<br/><br/>They could wipe out the Feng Clan in seconds if they wanted to.<br/><br/>Ling Meiyu was feeling quite guilty for breaking off the engagement but even so, she was determined to break off her engagement.<br/><br/>(Nobody can decide who I marry. I will decide my own fate!)<br/><br/>Ling Meiyu thought to herself.<br/><br/>\"Nice! Very Nice! Ling Jian has raised a good daughter. I am really envious of him.\"<br/><br/>Feng Chen said in a sarcastic voice while staring at Ling Meiyu with blank eyes void of any emotion. It was totally different from before.<br/><br/>\"Brother Feng...<br/><br/>11<br/><br/>\"No! Call me Feng Head or Clan Leader. I don't deserve to be called brother by Miss Ling. You are the Ling Family's young lady who is also Mystic Flame's little sect leader. My younger brother indeed doesn't deserve a phoenix like you!\"<br/><br/>Feng Chen didn't care about how close their father was. With Ling Meiyu humiliating his clan and brother, it was already his biggest concession that he didn't slap Ling Meiyu's face right<br/><br/>now.<br/><br/>\"Humph! Feng Head is still sensible despite being so weak!\"<br/><br/>The other elder of Mystic Flame Sect said disdainfully. He felt that there was no point in talking and going through all this for such a small clan.<br/><br/>They can just command Feng Clan to do what they want and Feng Clan would do it obediently.<br/><br/>\"Zhou Lei! Don't be rude!\"<br/><br/>Elder Xian said but it was just for appearance. He didn't think any differently than what Elder Zhou was thinking.<br/><br/>Hearing Zhou Lei's comment, Feng's family's people couldn't help but become very angry.<br/><br/>When have they reached a stage where they have to hear other people insulting their family head and they can't even retaliate?<br/><br/>Feng Chen was beloved among both younger and older generations of Feng Clan. He didn't just become Family head at a young age because of his strength or because he was the son of the previous family head.<br/><br/>It was because he had earned acknowledgment from every member of the Feng Clan.<br/><br/>He took up the mantle when the Feng Clan was at its lowest, surrounded by all kinds of<br/><br/>danger.<br/><br/>With the former patriarch and his wife's disappearance, Feng Clan no longer had anyone who was in the Grand Qi Condensation Realm and would have eventually become a second-rated clan if not for Feng Chen.<br/><br/>He not only prevented the Feng Clan from being devoured by other families but also made it<br/><br/>thrive.<br/><br/>Only the Feng elders knew how much Feng Chen had changed since he became Clan Leader. Once a carefree youth who loved to flirt and play pranks, Feng Chen transformed into a pillar of strength and wisdom.<br/><br/>His once playful demeanor gave way to a solemn determination as he took on the immense responsibilities of leadership.<br/><br/>Gone were the days of frivolity; in their place stood a man who spent sleepless nights strategizing for the clan's future and personally overseeing the training of the younger<br/><br/>generation.<br/><br/>The younger generation also liked Feng Chen very much.<br/><br/>Feng Chen wasn't domineering even as Family head and would treat everyone equally. He was the type of leader who would sacrifice everything for the betterment of his clan.<br/><br/>Feng Chen would often forgo personal cultivation to train the younger generation, ensuring that the clan's future was bright.<br/><br/>He was the first to respond to any crisis and was even ready to risk his life for the clan. His dedication to the clan was unwavering, and his actions spoke louder than any words could.<br/><br/>He never asked for anything in return, believing that his duty as Family Head was to serve, not<br/><br/>to be served.<br/><br/>When the Feng Clan faced economic hardships, he was the first to offer up his own resources, even selling off his prized possessions to ensure the clan's survival.<br/><br/>Under his leadership, the clan thrived not because of fear or intimidation but because of<br/><br/>mutual respect and love.<br/><br/>Yet now, to think that someone would dare insult the head of the Feng Clan, the very man who had given his all to protect and uplift them, was an affront to everything they stood for. The thought of not being able to retaliate against such slander filled them with a deep sense<br/><br/>of shame and helplessness.<br/><br/>Even the two Clan Elders who stopped Feng Chen from getting angry earlier were on the verge<br/><br/>of slapping Elder Zhou.<br/><br/>On the other hand, the three major families were full of joy. With this incident, Feng Chen has completely lost his face.<br/><br/>\"Thank you, Feng Head, for your understanding!\"<br/><br/>Elder Xian said happily. Although he could see anger among the Feng Clan, it didn't matter to<br/><br/>him as long as his mission was completed.<br/><br/>\"We understand that today's request is quite disrespectful. Therefore, we brought you something as a reparation gift. Please accept it as an apology from our side.\"<br/><br/>Elder Xian said as he signaled Elder Zhou to take out the gift.<br/><br/>Elder Zhou touched a ring on his hand and suddenly a jade box appeared in his hand.<br/><br/>Carefully opening the box, a fragrance swept through the entire main hall. Anyone who<br/><br/>smelled it knew that the contents of the box were high-rank pills.<br/><br/>\"This is ... Three Elements Essence Pill!\"<br/><br/>Yan Jianhong, who had seen the same pill at the capital, shouted.<br/><br/>The crowd all exclaimed.<br/><br/>The people from the other clans including the major families looked at Feng Chen with<br/><br/>jealousy.<br/><br/>The Three Elements Essence Pill was extremely precious and rare. It was the 5th rank pill that<br/><br/>can propel cultivators from the Grand Qi Condensation Realm to the Three Elements Divine<br/><br/>Realm.<br/><br/>In the Misty Vale City, even 3rd rank pills were extremely rare and precious, not to mention 5th-rank pills. Many people have not even heard of such pills.<br/><br/>With this pill, it was almost guaranteed that Feng Chen, who is thought to be at the peak of the Grand Qi Condensation Realm, would advance to the Three Elements Divine Realm. The Zhao, Lui, and Yan family members once again had a change of mood. Their joy was short-lived as they thought about Feng Chen advancing to the Three Element Divine Realm.<br/><br/>So, even if the Feng Clan has no support from the Ling Family, Feng Chen alone could defend<br/><br/>against them.<br/><br/>Feng Chen coldly looked at the Three Elements Essence Pill in the box and smiled<br/><br/>disdainfully.<br/><br/>It might have been considered precious previously by Feng Chen but with the System, he has<br/><br/>already gotten so many pills including 5th-rank pills.<br/><br/>Moreover, he can clearly see that the pills that they brought out were of low quality. There<br/><br/>might even be side effects if one were to consume such low-quality pills.<br/><br/>\"Feng Head, how is it?\"<br/><br/>Elder Zhou asked disdainfully, confidently thinking that he already knew the answer.<br/><br/>(Humph! These people from remote areas wouldn't know the difference between high-<br/><br/>quality and low-quality pills of such ranks.)<br/><br/>Elder Zhou thought happily. He had swapped the pill earlier, convinced that Feng Chen<br/><br/>wouldn't notice.<br/><br/>He planned to return to the Sect and use this pill to ascend to the Three Element Divine Realm.<br/><br/>Just thinking about reaching the Three Element Divine Realm made Elder Zhou smile.<br/><br/>\"Hmph! These things, Your Excellency had better take them back!\"<br/><br/>Feng Chen flung his sleeve robe and was about to send off his guests when a clear and<br/><br/>incomparable voice suddenly came out. S~eaʀᴄh the novёlF~ire.net website on Google to access chapters of novels early and in the highest quality.<br/><br/>\"My brother is right, these things, you'd better take them back!\"\t\t\t\t\t\t</div>", "images": {}, "success": true}