{"id": 2, "url": "https://www.novelhall.com/my-brothers-the-protagonist-good-thing-i-awakened-my-system-33973/14946546.html", "title": "Chapter 2: The System Was Really Late", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 2: The System Was Really Late</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 2: The System Was Really LateHe glanced around the grand hall, filled with celebrants oblivious to the monumental shift occurring within him.<br/><br/>The system's arrival was a game-changer, and Feng Chen couldn't wait to check what System could do.<br/><br/>\"System,\" he muttered, trying to gather his thoughts and focus on the voice in his mind. \"What exactly can you do?\"<br/><br/>[Welcome, Host. The Martial Arts System is designed to assist you in achieving unparalleled greatness in the Heavenly Domain. You will receive guidance, cultivation resources, and various other aids tailored to your needs. Your path to becoming a true genius starts now.]<br/><br/>Genius my A**! He is already past the age of being a genius and is on his way to becoming an old man.<br/><br/>However, although he is past that age, maybe the system could help the younger generation turn from chicken to phoenix.<br/><br/>\"What should I do first?\"<br/><br/>Feng Chen asked the system in his mind.<br/><br/>[ Host, the system will provide you with a Beginner's Package containing basic cultivation resources and a detailed guide on how to enhance your abilities. Additionally, you will receive missions and quests with suitable rewards. ]<br/><br/>Feng Chen's eyes sparkled with enthusiasm. Although he has yet to see what System could truly do, reading any System novel will let you know that System is a cheat to become the strongest.<br/><br/>\"Proceed with the Beginner's Package,\" Feng Chen commanded.<br/><br/>[ Congratulations! Host has received: 10 Core Condensation Pill, 10 Marrow Cleansing Pill, a High-Level Heaven Grade Sword Technique: Heavenly Emperor's Sword, and 1 vial of Pure Essence Fluid. Please access your Storage to claim your rewards. ]<br/><br/>\"This is incredible,\" Feng Chen muttered, a smile playing on his lips.<br/><br/>(Pity that it is a Core Condensation Pill which isn't much use to me. However, it will be useful to the Clan's elder.)<br/><br/>Feng Chen thought.<br/><br/>Core Condensation Pills are much more effective to those in the Core Formation Stage. For those cultivators, above the Core Formation Stage, it wasn't as useful.<br/><br/>However, rather than that, the 10-Marrow Cleansing Pill was what caught his eye the most.<br/><br/>These rare pills purify and strengthen the marrow, enhancing the body's capacity for cultivation.<br/><br/>They cleanse impurities from the body, improving overall health and the ability to absorb spiritual energy.<br/><br/>They were literally the pill for changing one's talent. Although just these pills weren't enough to become those heavenly pride with extraordinary physique and luck, it was something that his Feng Clan needed right now.<br/><br/>Next was the Heaven Grade Sword Technique which is not very useful for the clan but was very helpful to himself.<br/><br/>In the realm of cultivation, martial techniques were categorized into five grades: Mortal, Earth, Heaven, Saint, and Divine.<br/><br/>The vast majority of cultivators had access only to the Mortal Grade technique, and even obtaining an Earth Grade manual was a feat few could achieve.<br/><br/>Heaven Grade Cultivation Manual is something that only the first-rated sect of Empire of the Azure Sky might have. Other than that only the royal family might have one or two Heaven- grade techniques.<br/><br/>Now he was also one of those people who possessed a Heaven Grade technique. With the Heaven Grade technique, it wouldn't be difficult to even defeat people who are three or four minor steps higher than himself.<br/><br/>[ Host, do you wish to learn Heavenly Emperor's Sword?]<br/><br/>System asked.<br/><br/>\"Can I learn it directly like this?\"<br/><br/>Feng Chen asked, surprised by what the System said.<br/><br/>Normally one would take days and even months to comprehend Martial Arts. Not to mention the time it takes to master those Martial Arts.<br/><br/>But it seems like he didn't need to spend that time to learn this Heaven Grade Martial Art with System's help.<br/><br/>\"Learn!\" he commanded with eager anticipation.<br/><br/>Instantly, a torrent of knowledge surged into Feng Chen's mind, granting him a complete understanding of the Heavenly Emperor's Sword. He could hardly contain his exhilaration.<br/><br/>\"Hahaha!\" he laughed triumphantly, his joy unrestrained.<br/><br/>\"Brother, you seem... very happy today,\" Feng Mei noted with a puzzled expression.<br/><br/>Feng Mei has rarely seen her elder brother laugh and today, she has seen him laugh more than two times.<br/><br/>\"Haha, it's just the joy of celebrating with all of you,\" Feng Chen responded, patting her head affectionately. Searᴄh the nôvelFire.net website on Google to access chapters of novels early and in the highest quality.<br/><br/>(Who wouldn't be happy to master a Heaven Grade Martial Art in seconds?)<br/><br/>Even getting one would make someone insane, not to mention being able to master it in a matter of seconds.<br/><br/>It was already thanks to his incredible self-control that he had not started dancing, otherwise, he would have been jumping around like a monkey.<br/><br/>Feng Chen managed to compose himself and continued to look into the System's other features.<br/><br/>\"System, let me check my Status\", Feng Chen commanded through his thoughts.<br/><br/>[Host Info]<br/><br/>Host: Feng Chen<br/><br/>Age: 30<br/><br/>Cultivation: Three Elements Divine Realm (Peak)<br/><br/>Martial Arts: Heavenly Emperor's Sword (High-Level Heaven Grade), Iron Fist Technique (Mid-Level Mortal Grade), Light Sword Technique (High-Level Mortal Grade), Earth<br/><br/>Shattering Palm (Mid-Level Earth Grade)<br/><br/>[System Inventory]<br/><br/>10 Core Condensation Pills, 10 Marrow Cleansing Pills, 1 vial of Pure Essence Fluid<br/><br/>[System Quests]<br/><br/>1. Reaching Qi Gathering Stage - Completed<br/><br/>2. Reaching Foundation Establishment Stage - Completed<br/><br/>3. Reaching Core Condensation Stage - Completed<br/><br/>4. Reaching Grand Qi Enhancement Realm - Completed<br/><br/>5. Reaching Three Elements Divine Realm - Completed<br/><br/>DING!!!<br/><br/>[Congratulations, Host, for reaching the Qi Gathering Stage! ]<br/><br/>[ Rewards: 10 Qi Gathering Pills, 10 Ethereal Spirit Pills, and 2,000 system points. ]<br/><br/>[Congratulations, Host, for reaching the Foundation Establishment Stage! ]<br/><br/>[Rewards: 10 Foundation Establishment Pills, 10 Mystic Insight Manuals, and 5,000 system<br/><br/>points. ]<br/><br/>[Congratulations, Host, for reaching the Core Condensation Stage!]<br/><br/>[Rewards: 10 Core Condensation Pills, 10 Core Refinement Elixirs, and 10,000 system points. ]<br/><br/>[Congratulations, Host, for reaching the Grand Qi Enhancement Stage!]<br/><br/>[ Rewards: 10 Grand Qi Enhancement Pills, 10 Heavenly Insight Manuals, and 20,000 system<br/><br/>points. ]<br/><br/>[Congratulations, Host, for reaching the Three Elemental Divine Stage! ]<br/><br/>[Rewards: 10 Elemental Infusion Pills, 10 Elemental Harmony Crystals, and 30,000 system<br/><br/>points. ]<br/><br/>\"\"<br/><br/>\"System, you were really late!\"<br/><br/>Feng Chen couldn't help but feel a bit sad. From the list of his completed quests, he could see<br/><br/>that the System could have easily provided him with the necessary resources to cultivate the<br/><br/>next Realm.<br/><br/>At the moment, most of those rewards were useless to him. Nonetheless, it could help the<br/><br/>other clan members which wasn't a bad deal.<br/><br/>DING!!!<br/><br/>[Congratulations, Host, for completing a secret mission: Become a Clan Leader!]<br/><br/>Feng Chen blinked in surprise at the unexpected notification.<br/><br/>[Rewards: 100,000 system points, the Eyes of Insight, and a Core Formation Protection<br/><br/>Array.]<br/><br/>His heart raced as he processed the rewards. The Core Formation Protection Array would offer<br/><br/>a robust defense against powerful adversaries, ensuring the clan's safety.<br/><br/>It could completely ignore attacks from the Core Formation Stage and could also withstand<br/><br/>some attacks from the early Grand Qi Condensation Realm.<br/><br/>As for the Eyes of Insight, he had never heard of anything like it.<br/><br/>\"System, what is this Eyes of Insight?\" he asked, curiosity piqued.<br/><br/>[As a clan leader, how could one grow without being able to see one's talent? The Eyes of Insight allows you to see through others' strengths, talent, and physique, providing you with crucial information to guide and nurture your clan members effectively. ]<br/><br/>Feng Chen's eyes widened in amazement. This ability would be a game-changer for him as a<br/><br/>leader.<br/><br/>Being able to assess the potential of his clan members accurately would enable him to make informed decisions about their training and development.<br/><br/>\"Activate the Eyes of Insight,\" he commanded.<br/><br/>Immediately, his vision shifted. The room around him seemed to shimmer slightly as a new layer of information appeared before his eyes. He turned to look at Feng Mei, focusing his<br/><br/>vision to assess her potential.<br/><br/>Name: Feng Mei<br/><br/>Cultivation Level: Initial Foundation Establishment<br/><br/>Talent: Exceptional<br/><br/>Physique: Jade Phoenix (Unawakened)<br/><br/>Feng Chen's gaze softened with pride. Feng Mei's cultivation level and potential were<br/><br/>impressive. Even he didn't know that Mei'er had already broken through the Formation Establishment Stage.<br/><br/>(This silly girl must be hiding her cultivation!)<br/><br/>Feng Chen thought.<br/><br/>Feng Mei cultivation is thought to be at the peak of the Qi Gathering Stage which is already<br/><br/>considered to be good considering that the highest cultivation of Feng clan members below age 20 is also at the Early Foundation Establishment Stage.<br/><br/>\"Even I was fooled by this little girl. If I didn't have Eyes of Insight, I might still have believed<br/><br/>that Mei'er was still stuck in Qi Gathering Stage\"<br/><br/>Feng Clan Members would usually immediately inform about their breakthrough to the Clan. It was not mandatory but they would receive pills and other benefits.<br/><br/>So, most of the time, they would immediately announce their breakthrough. Because of that,<br/><br/>if one didn't disclose about their breakthrough, there was no way to know unless they were<br/><br/>showing their powers.<br/><br/>And the reason why she didn't disclose her real cultivation despite the benefit must be<br/><br/>because of Feng Yun.<br/><br/>\"This brother of mine is really making others worry about him. Although I was helpless previously, now, with the help of the System, I believe that I could change his fate.\"\t\t\t\t\t\t</div>", "images": {}, "success": true}