{"id": 3, "url": "https://www.novelhall.com/my-brothers-the-protagonist-good-thing-i-awakened-my-system-33973/14946547.html", "title": "Chapter 3: Mystic Flame Sect!", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 3: Mystic Flame Sect!</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 3: Mystic Flame Sect!\"Feng Mei's talent is exceptional. I don't know how good that is.\"<br/><br/>[ Host, talent is divided into five parts: Ordinary Talent, Above Average Talent, Exceptional Talent, Genius Talent, and Heavenly Talent. Most people are only Ordinary Talent while only one in 10,000 have Above Average Talent. While those with Exceptional talent are one in a million. ]<br/><br/>\"WOW! So Mei'er is a genius!\" Feng Chen exclaimed, elated.<br/><br/>He didn't expect that the girl his uncle had picked up would be so talented.<br/><br/>\"Then what about her physique? It has the name Phoenix, so it should be very strong, right?\"<br/><br/>Feng Chen asked excitedly. With exceptional talent and a strong physique, Feng Mei might be someone who could even lead the Feng Clan in the future.<br/><br/>[ Indeed, Host. The Jade Phoenix Physique is extremely rare and powerful. It is only found in one in ten million people. Once her physique is awakened, she will be a thousand times stronger than she is now!]<br/><br/>\"With such a talent and physique, Mei'er's future is truly bright.\" Feng Chen thought.<br/><br/>\"System, do you know how to awaken Mei'er's physique?\"<br/><br/>[ Host, the information required to awaken the Jade Phoenix Physique is currently beyond your privileges. As you grow stronger and complete more quests, additional privileges and information will be unlocked.]<br/><br/>\"Hmph...\"<br/><br/>It seems that he couldn't access everything from the System.<br/><br/>Nevertheless, Feng Chen wasn't in a hurry to awaken Feng Mei's physique. Even without her Jade Phoenix Physique, she could stand at the top with her talent alone.<br/><br/>Feng Chen believes that it will not be long before he can awaken her physique.<br/><br/>Anyway, his current concern was about his Clan.<br/><br/>\"System,\" Feng Chen continued, \"Is there any quest that will help elevate my clan's status and strength?\"<br/><br/>[ Host, there are two suitable missions related to your clan. ]<br/><br/>[Mission 1: Cultivate the younger generation of the Feng Clan to reach the Core Formation Stage.]<br/><br/>[Rewards: 1 Heaven Grade Movement Technique, 50 Core Condensation Pills, and 1 Heaven Grade Defense Technique.]<br/><br/>[Mission 2: Make Feng Clan the strongest in Misty Vale City by having at least 5 Grand Qi Condensation Realm and 30 Core Formation Stage in Feng Clan. ]<br/><br/>[Rewards: 100,000 System Points and ???]<br/><br/>Feng Chen's eyes lit up.<br/><br/>\"Nice!\"<br/><br/>This quest was exactly what he needed to uplift his clan's potential. If the younger generation could reach the Core Formation Stage, he would receive enough resources to increase the clan's overall power significantly.<br/><br/>DING!!!<br/><br/>Before Feng Chen could come out of his happiness, there was another sound from the System.<br/><br/>[Congratulations, Host, for completing another secret mission: Strongest in the Misty Vale City! ]<br/><br/>[Rewards: 100,000 system points and Mid-Level Saint Grade Body Refinement Technique: Saintly Thunder Body]<br/><br/>\"...\"<br/><br/>Feng Chen stood still while staring at the rewards.<br/><br/>\"S-Saint Grade?\"<br/><br/>Feng Chen was already becoming insane at the thought of having Heaven Grade Technique and the System had to mock his narrow perspective by rewarding him with a Saint Grade Technique.<br/><br/>Saint Grade! And it was a Mid-Level Saint Grade! Searᴄh the novёlF~ire.net website on Google to access chapters of novels early and in the highest quality.<br/><br/>\"This is...\"<br/><br/>(Wouldn't I already conquer the world with these resources?)<br/><br/>Feng Chen wondered dumbfoundedly. Although it was not true, he didn't believe that it was an exaggeration either.<br/><br/>In the whole Empire, there wasn't any Saint Grade Technique or at least he didn't hear about any entities possessing Saint Grade Technique.<br/><br/>Now that he was in possession of it, wouldn't that make him the strongest?<br/><br/>Although Technique alone wouldn't define a person's strength, it does play a big role. Especially when the grade of Technique is something like Mid-Level Saint grade.<br/><br/>\"I don't know how many people would come to Feng Clan if they knew that I have a Mid-level Saint Grade Technique.\"<br/><br/>Feng said.<br/><br/>It wouldn't be weird if even other strong men from different countries came to invade the Empire of the Azure Sky just to get this technique.<br/><br/>Even those super strong sects with Saint Grade Technique might appear to steal this<br/><br/>technique from me.<br/><br/>Good thing is, it is very hard to know what grade of technique one is without having seen it before. And it is especially true with the body refinement technique.<br/><br/>\"System,\" Feng Chen said with an impatient look, \"I want to learn the Saintly Thunder Body Technique right now.\"<br/><br/>SWISH!<br/><br/>The details of the Saintly Thunder Body Technique began to flood his consciousness, overwhelming him with a cascade of knowledge and power.<br/><br/>The moment he mentally grasped the technique, he felt a surge of energy like never before. His body tingled with a potent, electrifying force, and he could almost see crackling bolts of lightning coursing through his veins.<br/><br/>The Saintly Thunder Body Technique was not just a refinement method; it was an unparalleled force of nature.<br/><br/>This... This is incredible! The Saintly Thunder Body Technique is far beyond anything I<br/><br/>imagined.<br/><br/>The technique focused on channeling and refining the body's internal energy with the power<br/><br/>of thunder.<br/><br/>It is not only immense physical enhancement but also increased resilience and explosive<br/><br/>strength.<br/><br/>\"With this, I can be both the strongest spear and toughest shield.\"<br/><br/>Unlike anything I had encountered, this method integrated the power of thunder into my very essence, granting me a nearly indomitable physique.<br/><br/>I marveled at the technique's description. It was said to augment my physical capabilities to a degree where I could withstand the impact of powerful attacks and retaliate with devastating<br/><br/>force.<br/><br/>The technique allowed its practitioner to harness and control lightning, making their strikes not only physically overwhelming but also imbued with elemental power.<br/><br/>(With this technique, maybe even those in Early Nascent Soul Realm wouldn't be able to harm<br/><br/>me.)<br/><br/>Fortunately, Feng Chen managed to keep all that energy inside his body without spilling<br/><br/>anything out.<br/><br/>Otherwise, he would have attracted the attention of others who could sense that powerful<br/><br/>energy.<br/><br/>\"Indeed, having a Golden Finger is different. I have already become ten or twenty times stronger just by accepting some rewards from the System.\"<br/><br/>Feng Chen said with both sadness and satisfaction. Sadness because he felt like his years of hard work was just waste compared to what System had given him.<br/><br/>Satisfaction because of how powerful his System is.<br/><br/>Anyway, Feng Chen decided to enjoy his birthday celebration and check out the System store<br/><br/>and other functionalities later.<br/><br/>He didn't know whether he could control himself if there was a Divine Grade Technique or<br/><br/>anything similar in the System store.<br/><br/>As celebration continued, suddenly, a guard burst in, breathless and wide-eyed.<br/><br/>\"Family Head!\" the guard exclaimed. \"I have urgent news!\"<br/><br/>Feng Chen's attention snapped to the guard. \"What is it?\"<br/><br/>\"The people from Mystic Flame Sect have arrived!\" the guard reported, his voice trembling<br/><br/>with urgency.<br/><br/>\"And it appears that an Elder from their sect is leading the group!\"<br/><br/>The room fell silent, the weight of the news sinking in.<br/><br/>The Mystic Flame Sect was known for its immense power and influence, and it is hailed as the<br/><br/>number one sect in the whole Azure Sky Empire.<br/><br/>If they claimed to be number 2 then no one would dare to claim to be number 1. In the entire Azure Sky Empire, only the royal family might have the power to contend with the Mystic<br/><br/>Flame Sect.<br/><br/>To be a disciple of the Mystic Flame Sect, one would need to be Core Formation Stage before the age of 20 and all the elders were above the Early Stage of Grand Qi Condensation Realm.<br/><br/>The crowd immediately went from sudden silence to uproar.<br/><br/>\"Mystic Flame Sect? To a remote place like ours?\"<br/><br/>\"And it is also an Elder. Do you know what Cultivation is needed to be an elder of Mystic<br/><br/>Flame Sect? At least the peak of the Grand Qi Condensation Realm!\" \"P-Peak of Grand Qi Condensation Realm? In the entire Misty Vale City, there is only one<br/><br/>person who has reached that stage.\"<br/><br/>As the conversation continued, the guest started to look at Feng Chen with reverence. They thought that the Mystic Flame Sect had come because of Feng Chen.<br/><br/>\"Quickly, invite them!\" Feng Chen instructed.<br/><br/>Feng Chen didn't dally around either and quickly instructed the guard to invite the guest from<br/><br/>Mystic Flame Sect.<br/><br/>(Why are they here?)<br/><br/>Even Feng Chen was puzzled by the arrival of the Mystic Flame Sect's people. He didn't know<br/><br/>anyone from the Mystic Flame Sect, so he knew that they weren't here because of his birthday.<br/><br/>The other four Major Clans were also standing on the side, very curious as to what the mystic Flame Sect was doing here in the Feng Clan.<br/><br/>Could it be that Feng Chen had hitched a ride with the Mystic Flame Sect?<br/><br/>Thinking about this idea, the people from Zhao, Liu, and Yan besides the Wang family were<br/><br/>all a little unsteady.<br/><br/>If that was really the case, they were afraid that the Feng Clan would be able to dominate Misty Vale City in the future!\t\t\t\t\t\t</div>", "images": {}, "success": true}