{"id": 9, "url": "https://www.novelhall.com/my-brothers-the-protagonist-good-thing-i-awakened-my-system-33973/14946553.html", "title": "Chapter 9: System Store!", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 9: System Store!</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 9: System Store!Feng Chen walked towards the main hall, his mind occupied with the System store! \"System, open the System store!\"<br/><br/>Feng Chen said excitedly.<br/><br/>Instantly, a translucent interface materialized before him.<br/><br/>\"Hmmm...\"<br/><br/>There were two sections under the System store.<br/><br/>One was called the Main Store and another was called the Time-Limited Store.<br/><br/>Feng Chen tapped on the Main Store first. The interface revealed an extensive collection of items, ranging from rare cultivation techniques and powerful artifacts to a variety of elixirs and treasures.<br/><br/>Each item was priced in System Points, with costs varying based on their rarity and usefulness.<br/><br/>Feng Chen began scrolling down the techniques which, by the way, started with Earth Grade Techniques.<br/><br/>Looks like the System has a high standard and doesn't even consider Mortal Grade as a Technique worth keeping.<br/><br/>\"WOW! So many Earth Grade Techniques and most of them just cost 10,000 System Points?\" Feng Chen was surprised by how cheap it was. Currently, he has 267,000 System points which means that he is able to at least buy 20 Earth Grade Technique.<br/><br/>In his 30 years, he was only able to obtain 1 Earth Grade Technique and now he can buy 20.<br/><br/>(Just what was I doing previously?)<br/><br/>Feng Chen pondered.<br/><br/>Not able to contain himself, he quickly scolded to check whether there were Saint Grade Techniques or not.<br/><br/>Unable to contain his excitement, he quickly scrolled through the System store to see if there were Saint Grade Techniques available.<br/><br/>\"S-Saint Grade Techniques? Just 200,000 System Points?\" Feng Chen was floored.<br/><br/>He was already sky-high because he had gotten a Saint-Grade Technique and System had to make him realize once again how limited his perspective is.<br/><br/>\"Then what about Divine Grade Techniques?\"<br/><br/>Feng Chen quickly scrolled to check whether there were Divine Grade Techniques in the System.<br/><br/>Divine Grade!<br/><br/>It was something that he didn't even dare to dream about. But now with the arrival of System, there was a chance that he could also obtain it.<br/><br/>Soon, he came across the Divine Grade Techniques. As he found the list of Divine Grade Techniques, his eyes widened in awe.<br/><br/>He expected but still seeing the list of Divine Grade Techniques, Feng Chen can't help but be excited.<br/><br/>\"5 Million System Points! Indeed, even with a System, getting Divine Grade Technique isn't easy!\"<br/><br/>Though he couldn't afford any Divine Grade Techniques yet, he was thrilled by the prospect of obtaining one in the future.<br/><br/>Feng Chen continued to browse, eyes widening at the range of items available. There were pills of every rank, from the 1st rank to the 10th rank.<br/><br/>It was truly an eye-opening moment for Feng Chen.<br/><br/>Although he couldn't afford pills of the 7th rank and above, he could still buy 6th rank pills for 100,000 System Points.<br/><br/>Not only that, there were many other things beyond Feng Chen's imagination like fruits capable of fundamentally transforming a person's physique, treasures that could help with getting sword insight, and many more.<br/><br/>(There should be something that can also awaken Feng Mei's physique here right?)<br/><br/>Feng Chen mused. Although he didn't search for it extensively due to time constraints and budget, the thought lingered in his mind.<br/><br/>Next, he checked the artifacts, which were categorized similarly to the techniques: Mortal Grade, Earth Grade, Heaven Grade, Saint Grade, and Divine Grade.<br/><br/>The System had everything except Mortal Grade.<br/><br/>\"Looks like I need to manage my System Points wisely!\"<br/><br/>Previously, Feng Chen didn't know what System Points could do. That's why, he wasn't excited when getting System Points as compared to pills and technique.<br/><br/>But now he knows its worth and he knows that he has to spend it wisely. In times of crisis, having enough System Points might even save his life.<br/><br/>\"Looks like I need to work harder and make the Feng Clan stronger as fast as possible!\"<br/><br/>He recalled the quest offering 100,000 System Points for elevating the Feng Clan to the strongest in Misty Vale City. Sёarch* The novёlF~ire.net website on Google to access chapters of novels early and in the highest quality.<br/><br/>Leaving the Main Store behind, Feng Chen moved to the Time-Limited Store.<br/><br/>In this section, there were only ten items, each with a countdown timer.<br/><br/>\"System, what is this?\"<br/><br/>Feng Chen asked, puzzled.<br/><br/>[Host, the Time-Limited section offers exclusive items that are available for a short duration. Once the timer runs out, these items will be replaced with new ones. It's an opportunity to obtain rare treasures that might not be even available in the main store, many of which are also discounted! Make sure you don't miss out on a great deal! ]<br/><br/>Excitement surged through Feng Chen. With System Points being so precious, securing items at discounted rates would be incredibly beneficial.<br/><br/>Feng Chen browsed through the Time-Limited section excitedly, but a few minutes later, disappointment set in.<br/><br/>Although there were many precious treasures with discounted prices, they were still beyond what he could afford. And the items within his budget weren't what he needed at the moment.<br/><br/>\"At least I got something for a good price.\"<br/><br/>Feng Chen muttered, looking at the item he had purchased from the Time-Limited Store.<br/><br/>It was a \"Sword Insight Elixir,\" a rare concoction that promised to enhance his understanding<br/><br/>and mastery of sword techniques.<br/><br/>\"I'll use it later! I still have a meeting with the Clan Elders!\"<br/><br/>Meanwhile, the atmosphere in the Feng Mansion was filled with joy and excitement. The younger members were still buzzing about the moment Feng Chen had knocked out Elder<br/><br/>Zhou.<br/><br/>\"Did you see our Patriarch's power? Even the people from the Mystic Flame Sect were terrified after witnessing his power.\"<br/><br/>\"Haha, those arrogant fools finally learned their lesson! They'll think twice before messing with our Feng Clan again. I even wanted to throw some punches at those rude jerks myself.\"<br/><br/>The younger members of the Feng Clan gathered, their spirits high and excitement evident in<br/><br/>their chatter.<br/><br/>\"Did you see how they looked when Patriarch Feng knocked out Elder Zhou with one move?<br/><br/>Priceless!\"<br/><br/>\"Yeah, it was like watching a hero from the legends. Our Feng Clan is unstoppable!\"<br/><br/>\"I've never been prouder to be part of the Feng Clan. We should celebrate our victory!\" The group of young clan members laughed and exchanged enthusiastic comments, their admiration for Feng Chen and their newfound sense of security and pride.<br/><br/>Today was an emotional rollercoaster. One moment, they were happily celebrating Feng Chen's birthday, and the next, the Mystic Flame Sect arrived to annul the marriage.<br/><br/>Anger surged at the Mystic Flame Sect's behavior and the insults they hurled at Feng Chen, but their spirits soared once more after Feng Chen defeated Elder Zhou.<br/><br/>Soon, an attendant approached the group of young Feng members.<br/><br/>\"Feng Xiaoyu, Feng Jianhong, and Feng Liang, please proceed to the main hall. The Patriarch<br/><br/>has summoned all of you.\"<br/><br/>\"Understood!\"<br/><br/>The three of them replied as they hurried to the main hall.<br/><br/>The other young generation watched as the three strides towards the main hall with envy.<br/><br/>They knew why only the three of them were called.<br/><br/>They were the strongest members of the younger generation and they got the privilege of attending important meetings despite being young.<br/><br/>After all, when they have grown, they will be the ones managing Feng Clan!\t\t\t\t\t\t</div>", "images": {}, "success": true}