{"id": 6, "url": "https://www.novelhall.com/my-brothers-the-protagonist-good-thing-i-awakened-my-system-33973/14946550.html", "title": "Chapter 6: Divorce!", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 6: Divorce!</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 6: Divorce!The voice was calm yet filled with authority, drawing every eye in the room.<br/><br/>The source of the voice was a young man who strode into the hall with an imposing presence.<br/><br/>Despite being young, he carried himself with an air of self-assuredness that commanded respect.<br/><br/>The young man was none other than Feng Yun himself.<br/><br/>He stood tall, his demeanor confident and his eyes sharp. You wouldn't believe that he is the trash of Feng Clan with the way he carries himself.<br/><br/>\"Yun!\"<br/><br/>Feng Chen called out. Feng Chen thought that he would resolve this problem without involving his brother but it seems like fate.<br/><br/>Moreover, he found his little brother's behavior to be weird. At other times, no matter what is said to him, he would keep quiet and just endure.<br/><br/>There was also a hint of him being cowards although Feng Chen knew that wasn't truly the<br/><br/>case.<br/><br/>However, right now, Feng Yun was boldly retaliating against the Mystic Flame Elder which is unlike his previous self.<br/><br/>\"Brother Yun!\"<br/><br/>Feng Mei immediately rushed towards Yun. It seemed like she didn't care who was watching or what was happening as she happily ran towards Yun.<br/><br/>\"Second young master!\"<br/><br/>The other Feng Member respectfully bowed when Feng Yun came and addressed him as the Second young master.<br/><br/>\"You are Feng Yun?\"<br/><br/>Ling Meiyu asked in a disdainful manner. Although engaged, it was the first time that she had seen this fiance of hers.<br/><br/>Although Feng Yun was quite handsome and quite eye-catching to Ling Meiyu. However, to Ling Meiyu, looks were secondary.<br/><br/>Only by having sufficient talent and strength, could anyone capture her heart.<br/><br/>\"Feng Family's Feng Yun, meet Miss Ling Meiyu.\"<br/><br/>Feng Yun spoke indifferently.<br/><br/>Although Ling Meiyu stood before him, who is considered one of the most attractive girls in the entire Azure Sky Empire, Feng Yun just gave a formal greeting and looked indifferent.<br/><br/>This was the first for Ling Meiyu who is used to men fawning over her. Even other peerless geniuses of the first-rate sect undoubtedly give a second glance to her.<br/><br/>But Feng Yun just greeted her and immediately turned to Feng Chen. He wasn't even interested in being greeted back.<br/><br/>\"Brother, this engagement, I don't want it!\"<br/><br/>A single sentence stunned everyone present.<br/><br/>Many people including the Elders from Mystic Flame Sect couldn't see through Feng Yun. They are unable to discern whether Feng Yun's words are true or if it is just said to reap more benefit from them.<br/><br/>Though on the other hand, many people felt that Feng Yun was acting tough and trying to save face.<br/><br/>\"Humph! This Feng Yun is a bit smart. He knows that his engagement will definitely be broken. So, he is trying to be arrogant and save face.\"<br/><br/>\"What smart? It is a dumb decision. Whether it will earn them some face or not known, but what is known is that it will definitely antagonize Mystic Flame Sect.\"<br/><br/>\"Better for us! This Feng Yun doesn't really know his place.\"<br/><br/>\"No matter what, the news of the Feng Family being withdrawn from the marriage will spread throughout Misty Vale City.\"<br/><br/>Zhao, Liu, and Yan discussed and they didn't mince their words to show mockery to the Feng Clan.<br/><br/>Feng Chen also just listened to Feng Yun. He didn't expect Feng Yun to make such a big statement.<br/><br/>(It seems like this kid has undergone some changes~!\"<br/><br/>Feng Chen thought happily.<br/><br/>Then he looked at the people from Mystic Flame Sect who seemed to be equally surprised by Feng Yun.<br/><br/>On the other hand, Ling Meiyu looked absolutely furious. With her beauty, talent, and background, which men wouldn't want to marry her?<br/><br/>Now, some trash for a small clan dare to say that he doesn't want an engagement with her? This sudden turn of events made her think that she was in a dream or something!<br/><br/>\"Miss Ling, I can understand if you come to withdraw from the marriage. After all, I am a known trash who couldn't even reach the mid-stage of the Qi Gathering Realm. I don't really deserve you!\"<br/><br/>Feng Yun continued, \"But you shouldn't have done this in public. I don't really care about being embarrassed, but my brother! He's the clan leader, if we accept your request today then how do you expect him to rule over the Feng Clan? How will Feng Clan keep a foothold in Misty Vale City?\"<br/><br/>Feng Yun said as he stared at Ling Meiyu with hatred. Feng Yun was very angry, not because he was being publicly humiliated but because of the insult that his brother had to endure because of this.<br/><br/>Looking at the furious young man, Ling Meiyu's brows furrowed. She peeked at Feng Chen at the end of the hall.<br/><br/>From previous conversations and her father's attitude, she knows that Feng's family and her father were very close.<br/><br/>Feng Chen also showed great concern about her father when she mentioned his condition.<br/><br/>Seeing that, she felt slightly sorry for her actions and bit her lips.<br/><br/>\"Don't you know that today is my brother's 30th birthday? Your father and my father are sworn brothers. Is this how you show respect your own father, Ling Jian, by treating his sworn brother's family with such disregard?\"<br/><br/>Feng Yun continued.<br/><br/>\"Kid, you seek death!\"<br/><br/>One of the Mystic Flame Sect who was in Peak Core Formation Stage shouted as he lunged forward to attack Feng Yun.<br/><br/>\"Unbridled!\"<br/><br/>With a powerful sweep of his hand, a surge of energy erupted from Feng Chen, striking the Mystic Flame Sect member.<br/><br/>The force of the impact sent the man flying across the room, crashing into the wall with a Sёarch* The NôvelFire.nёt website on Google to access chapters of novels early and in the highest quality.<br/><br/>resounding thud.<br/><br/>Feng Chen's eyes blazed with authority as he turned to face the remaining members of the<br/><br/>Mystic Flame Sect.<br/><br/>\"This is Feng's territory! Watch your behavior!\"<br/><br/>Feng Chen said arrogantly, seemingly giving no face to even the number one sect of Azure Sky<br/><br/>Empire.<br/><br/>The other disciple of the Mystic Flame Sect was clearly provoked by Feng Chen's actions and<br/><br/>arrogance.<br/><br/>They were ready to go and fight with Feng Chen, however, they were all stopped by Elder Xian. After all, there were eyes all around and it was their disciple who attacked first.<br/><br/>Ling Meiyu also didn't seem to think much about Feng Chen slapping that disciple. More importantly, she was thinking about what Feng Yun said to her.<br/><br/>Indeed, she was disrespecting Feng Chen by withdrawing from the marriage on his birthday.<br/><br/>\"Today's request, it's a little reckless on my part. So, today, I will temporarily take back my request to release my marriage. But, you must promise me something!\"<br/><br/>\"What promise?\"<br/><br/>\"I can delay today's request for three years. Three years from now is when the Azure Sky's<br/><br/>Dragon and Phoenix Rankings are set, I'll be waiting for you. If you can beat this young lady, this young lady will serve you as a slave and a servant girl, but if you lose, you'll proceed to this young lady's withdrawal!\"<br/><br/>Ling Meiyu said. It was the biggest concession that she could make. She had already made up her mind to break off her engagement. It was only because of her father's relationship that she was ready to delay this.<br/><br/>The guest's interest perked up again at the mention of Dragon and Phoenix Ranking. It was a competition to see the greatest genius of the Azure Sky Empire, every three years.<br/><br/>The requirement for entering this competition was to be at least the Core Formation Stage and the age should be below 20 years.<br/><br/>In the recent Dragon and Phoenix Ranking, the top ten were all in the Three Element Divine Realm. That means that those geniuses were already stronger than the strongest person in<br/><br/>Misty Vale City or so many thought.<br/><br/>\"Good! I promise!\" Feng Yun didn't hesitate and directly accepted her challenge.<br/><br/>\"It's good that you have accepted. Just a quick reminder that if you don't reach the Core Formation Stage in three years then you don't even qualify to participate. By then, I hope that<br/><br/>you prepare the contract to release our marriage.\" Looking at the arrogant face of Ling Meiyu, Feng Yun smiled disdainfully.<br/><br/>\"Humph! It won't take three years. Even if you were begging me to take you as my wife, I<br/><br/>wouldn't agree.<br/><br/>After saying that, Feng Yun ignored the stunned face of Ling Meiyu and turned around.<br/><br/>Quickly walking forward to a table, he took out a paper and started to write! Suddenly, Feng Yun's hand reached for a sword and pointed the sharp blade at his left hand.<br/><br/>As soon as readied the sword, he firmly drew blood from his left hand. His bloodied hand pressed down on the white paper, leaving a glaring red mark.<br/><br/>Lightly picked up the contract, and then he smashed the contract on the table in front of Ling<br/><br/>Meiyu.<br/><br/>\"Don't you dare think that I, Feng Yun, am interested in someone like you? Today, it's not you, Ling Meiyu, withdrawing from the engagement. It's me, Feng Yun, repudiating you! I am divorcing you today!\"\t\t\t\t\t\t</div>", "images": {}, "success": true}