{"id": 14, "url": "https://www.novelhall.com/my-brothers-the-protagonist-good-thing-i-awakened-my-system-33973/14946558.html", "title": "Chapter 14: Humilation Of Yan Family", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 14: Humilation Of Yan Family</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 14: Humilation Of Yan FamilyThe festive atmosphere in Misty Vale City only grew more intense as the sun climbed higher in the sky.<br/><br/>The competition grounds, located in a vast open field on the outskirts of the city, were already packed with spectators.<br/><br/>Rows of elevated seating surrounded the circular arena, which was large enough to accommodate even the most intense battles.<br/><br/>At the center of the arena, a grand stage made of reinforced stone was set up, ready to host the fierce duels that would soon take place.<br/><br/>The audience was a diverse mix of cultivators, common folk, and dignitaries from neighboring cities.<br/><br/>The air buzzed with excitement as people discussed the potential outcomes of the competition, while vendors moved through the crowd, selling refreshments and souvenirs.<br/><br/>The five major families-Wang, Zhao, Liu, Feng and Yan-each had their own designated areas, where their members sat in dignified silence, watching over the proceedings with keen interest. Sёarᴄh the Novelƒire(.)ne*t website on Google to access chapters of novels early and in the highest quality.<br/><br/>Among the crowd, whispers and rumors spread like wildfire. Speculation about which family's young talent would rise to the occasion dominated the conversation, with names like Zhao Tianming, Liu Zhenhai, Yan Zhihao, and Wang Rouxue being mentioned repeatedly.<br/><br/>But there was also a curious anticipation surrounding the Feng Clan, which had remained unusually quiet in the lead-up to the event.<br/><br/>\"Have you heard? They say the Feng Clan has been training in secret, preparing something special for this year's competition,\" a young man whispered to his companion, his eyes wide with excitement.<br/><br/>\"Could it be that they finally have someone who can stand up to the other clans?\" his friend replied skeptically. \"They've always been the weakest of the five. I'll believe it when I see it.\" He didn't think that Feng Clan would win because of the past result.<br/><br/>As the anticipation for the Annual Genius Competition reached its peak, the grand announcements of the arriving families reverberated across the competition grounds.<br/><br/>The sound of trumpets and drums heralded the arrival of each major family, creating a sense of grandeur and importance.<br/><br/>\"The Wang Family has arrived!\"<br/><br/>The crowd turned to see a procession of elegantly dressed individuals, led by Wang Yifan, the head of the Wang Family.<br/><br/>His presence was commanding, and his aura exuded power and authority. Behind him marched the younger generation of the Wang Family, each one a promising talent in their own right.<br/><br/>Amidst them was Wang Rouxue, the young lady of the Wang family, whose beauty blossomed like a delicate flower in the heart of spring.<br/><br/>The spectators murmured in admiration as the Wang Family took their seats in the VIP section.<br/><br/>\"Zhao Clan has arrived!\"<br/><br/>Zhao Chenxi, the head of Zhao Clan, made a striking entrance.<br/><br/>Following him was Zhao Tianming, the prodigy of the clan, who led the younger generation with a confident stride. His sharp eyes and the faint glow of his aura marked him as a force to be reckoned with.<br/><br/>The Zhao Clan settled into their designated area with the pride of a family that had long dominated the competition.<br/><br/>\"Liu Clan has arrived!\"<br/><br/>Liu Yingjie led the Liu clan with a calm demeanor alongside the elders.<br/><br/>The younger generation of the Liu Clan was led by the formidable Liu Zhenhai. His presence was like that of a silent storm, calm yet powerful.<br/><br/>Finally, all eyes turned toward the entrance as the Yan Clan arrived.<br/><br/>Yan Zhan, the head of the Yan Clan, walked with a cunning smile. His every step was<br/><br/>deliberate, his gaze focused.<br/><br/>The younger generation of the Yan Clan followed closely, led by Yan Zhihao, who seemed a bit odd.<br/><br/>\"Haha... Yan Zhan, you finally came! I was tired of waiting.\"<br/><br/>Zhao Chenxi said, his smile wide. Today, Zhao Chenxi was in a very good mood.<br/><br/>He believed that his son, Zhao Tianming would win the Annual genius Competition which<br/><br/>would bring prestige and showcase their strength to the whole Misty Vale City.<br/><br/>\"Sorry, sorry! I had something to prepare which is why I was late.\"<br/><br/>Yan Zhan said with a mischievous smile. He knew that Zhao Chenxi was acting all excited only because his son's strength was the strongest competitor.<br/><br/>(Today, I will show you all what my Yan family has!)<br/><br/>However, Yan Zhan was fully prepared and was excited to show Zhao and other families his Yan family's strength.<br/><br/>Zhao Chenxi didn't know why Yan Zhan was excited despite being the weakest competitor next to the Feng Clan. Anyway, he didn't dwell on that and was eagerly waiting for the competition to start.<br/><br/>\"Why is the Feng Clan still not here?\"<br/><br/>Lui Yinjie said disdainfully.<br/><br/>\"Hmmm... Could it be that they already gave up? haha...\"<br/><br/>Zhao Chenxi mocked.<br/><br/>\"That would be a wise decision. Apart from Feng Chen, there isn't anyone from Feng Clan worthy enough to compete with us!\"<br/><br/>Yan said angrily.<br/><br/>The one who hates the Feng Clan the most should be the Yan family. The Yan Clan used to be the strongest clan from Misty Vale City and it all came down because of Feng Chen.<br/><br/>In their weakest moment, when the Feng Clan had lost their patriarch and his wife, Yan family were the first one to make a move on Feng Clan.<br/><br/>If they could shallow Feng Clan, then their strength would have grown even stronger and would have become invincible in Misty Vale City.<br/><br/>One of the Grand Elder and another Elder quickly made a move to make the Feng Clan submit and that's when everything went downhill for the Yan Clan.<br/><br/>Feng Chen surprised everyone with his Mid-Level Grand Qi Condensation Realm and he took the life of Yan Clan's Grand Elder and Elder who were in Mid-Level Grand Qi Condensation Realm and Early-Level Grand Qi Condensation Realm respectively.<br/><br/>Feng Chen, who was in his 20th, not only reached the Grand Qi Condensation Realm but was strong enough to take down two Grand Qi Condensation Realms at the same time.<br/><br/>That is how Feng Chen saved Feng Clan from their most desperate time and claimed his status<br/><br/>as their leader.<br/><br/>With Feng Chen at its helm, Feng Clan didn't lose their position and other major families were also wary of Feng Chen and didn't reckless attack Feng Clan.<br/><br/>They learned from the Yan Clan's mistake of underestimating Feng Clan and having two of their strongest members dead.<br/><br/>In that moment, the Yan Clan who was the strongest fell to being one of the weakest. They, who originally had five Grand Qi Condensation Realms and considered to be the strongest in the Misty Vale City, were pushed to being the weakest, next to the Feng Clan.<br/><br/>Yan Yingjie clenched his fist, vowing in his heart to take revenge on Feng Chen. Although he wasn't stupid to fight with Feng Chen who defeated Elder Zhou, he was willing to bet on Yan younger generation to cripple Feng Clan's younger generation.<br/><br/>\"The Feng Clan arrived!\"<br/><br/>Just when the Yan, Zhao and Lui family were making fun of the Feng Clan, they arrived.<br/><br/>Feng Chen stood at the front with elders beside him.<br/><br/>Following them were the younger generation which was surprisingly led by Feng Yun.<br/><br/>No one expected Feng Yun to make an appearance after the humiliation of his broken<br/><br/>engagement.<br/><br/>Moreover, how could someone as weak as Feng Yun be qualified to participate in a competition of geniuses, let alone lead one of the five major families of Misty Vale City?\t\t\t\t\t\t</div>", "images": {}, "success": true}