{"id": 18, "url": "https://www.novelhall.com/my-brothers-the-protagonist-good-thing-i-awakened-my-system-33973/14946562.html", "title": "Chapter 18: Feng Mei Vs Wang Rouxue!", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 18: Feng Mei Vs Wang Rouxue!</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 18: Feng Mei Vs Wang Rouxue!The second round went as expected. Most of the winners were from the Five Major Five Families, and most fights ended pretty quickly.<br/><br/>The only fight that was expected to be any good was Feng Yun Vs Feng Liang. However, Feng Liang had given up and chose not to fight.<br/><br/>As Feng Liang had already lost to Feng Yun previously, he surrendered to avoid revealing Feng Yun's power while also conserving Feng Yun's stamina.<br/><br/>Feng Liang wasn't very weak and had a cultivation of Late-Level Foundation Establishment Stage but while comparing their understanding of the Martial Arts Technique, he wasn't at Feng Yun's level which prompted him to be defeated.<br/><br/>Since they were of the same clan, it only made sense for the weaker one to give up. Although that was the reason behind this decision, it didn't go well with others.<br/><br/>\"Feng Liang is surrendering?\"<br/><br/>\"How can he just give up? With his Late-Level Foundation Establishment Stage, he could have won the match!\"<br/><br/>\"Feng Yun is strong but his cultivation is low compared to others. Even if Feng Yun's status is higher than Feng Liang's, Feng Yun should have been the one to surrender.\"<br/><br/>\"Alas, the Feng Clan is too narrow-minded and is letting Feng Yun pass just because he is Feng Chen's brother. Tsk! Tsk!\"<br/><br/>The crowd was disappointed and some were complaining, not knowing the truth. Feng Liang and Feng Yun also didn't bother to explain as they will know the truth soon.<br/><br/>In any case, the result was already set in stone and Feng Yun was going to the next round without having to fight.<br/><br/>Other competitors were happy to know that Feng Liang, who had Late-Level Foundation Establishment Stage, had surrendered and instead, it was Feng Yun who advanced to the next<br/><br/>round.<br/><br/>This included the head of the Major Families who thought that it was a stupid move to let Feng Yun advance instead of Feng Liang who they assumed was Feng Clan's strongest participant.<br/><br/>\"Let the third round begin!\"<br/><br/>The referee soon announced the start of the third round, and the atmosphere in the arena shifted once more.<br/><br/>The disappointment from the previous round was still palpable, but now, the crowd's focus was on the next round. Even if Feng Yun advances, so what? He would still lose!<br/><br/>Although he was a genius for reaching the Mid-level Foundation Establishment Stage at the age of 16, it was still not enough to win the Annual Genius Competition which had Late-Level Foundation Establishment Stage.<br/><br/>They thought that Feng Chen and Feng Clan would soon get the result of their foolishness. The third round was where the stakes were high with many of them having similar strength. Many were anticipating this round to be much more exciting than the previous one.<br/><br/>And the round lived up to their expectation. The matches were satisfying with most fighters struggling and having to fight with their full strength.<br/><br/>Unlike the previous rounds, the participants were finally bringing trump cards with many showcasing strength above their level.<br/><br/>\"Next match would be between Feng Mei and Wang Rouxue!\"<br/><br/>The referee announced the match-up which instantly made the crowd perk up.<br/><br/>\"WOOO! Finally! I wondered who is stronger between these two beauties!\"<br/><br/>\"Both are in Late-Level Foundation Establishment Stage but Wang Rouxue has Wang Family's Earth-Grade Technique and Artifact. I guess she will win!\"<br/><br/>\"You can't say that. Feng Mei has yet to show her strength. Maybe she has a trump card.\" The crowd buzzed with excitement as Feng Mei and Wang Rouxue stepped into the arena. Both were known for their exceptional beauty and although Wang Rouxue was older than Feng Mei, both were in the Late-Level Foundation Establishment Stage.<br/><br/>\"Feng Mei,\" Wang Rouxue began with a smile, her voice calm but brimming with enthusiasm.<br/><br/>\"I am looking forward to this match. It's not often that I get to face someone as talented as you.\"<br/><br/>Feng Mei returned the smile.<br/><br/>\"The feeling is mutual, Wang Rouxue. I've heard so much about you. It's an honor to face you.\"<br/><br/>Wang Rouxue nodded appreciatively.<br/><br/>\"Since that is the case, I hope you give your all!\"<br/><br/>Wang Rouxue, with her elegant composure, drew her sword, a shimmering artifact that radiated power.<br/><br/>The sword was a symbol of the Wang Family's prestige, a rare Earth-Grade Artifact that had been passed down through generations. Along with her Earth-Grade Technique, the \"Frozen Lotus Sword Art,\" she was a formidable opponent.<br/><br/>Feng Mei also didn't hide her strength as she took out her sword from a storage ring. This was also an Earth-grade artifact given by Feng Chen.<br/><br/>For the first time since the start of the competition, there was a sight between two Late-Level Foundation Establishment Stages.<br/><br/>Wang Yifan looked at his granddaughter with pride and confidence. Although her opponent was of the same realm as her, Wang Yifan believed that with her granddaughter's skill, she<br/><br/>would come on top.<br/><br/>Feng Chen was the same. Although both were of the same cultivation level, he was fully confident in Feng Mei who had Exceptional Talent and learned Heaven Grade technique. As they took their positions, the crowd fell silent, sensing the gravity of the moment. Two exceptional talents, each capable of winning this competition, were going to battle it out.<br/><br/>Wang Rouxue's sword glinted under the arena's lights as she launched her initial attack, her movements fluid and precise.<br/><br/>The sharp edge her de seemed to r as she executed a seri of rapid strikes, each aimed at testing Feng Mei's defenses.<br/><br/>The crowd watched in awe as Wang Rouxue's elegance combined with her lethal skill, made it clear why she was regarded as one of the strongest in the competition.<br/><br/>Feng Mei, however, remained calm and composed. With each swing of Wang Rouxue's sword, Feng Mei's own blade met it with a soft clang, deflecting the attacks with minimal<br/><br/>movement.<br/><br/>For several minutes, the two fought with no clear-cut winner. It seems like both of them were of similar strength.<br/><br/>That's what made Feng Mei even more incredible. Her talent was regarded by others as being the highest, surpassing even Feng Yun.<br/><br/>Although Feng Mei was a bit older than Feng Yun, still her cultivation was higher and they believed that she was stronger than Feng Yun.<br/><br/>\"This Feng Clan! How did their younger generation grow in such a short amount of time?\"<br/><br/>\"I thought their younger generation was weak but except Feng Yun, Each one of them had a Late-Level Foundation Establishment Stage.\"<br/><br/>\"How do you expect other clans to compete when they have four Late-Level Foundation Establishment Stages? This is just unfair!\"<br/><br/>Looking at the Feng Clan who is taking out one genius after another, the older generation couldn't help but get jealous of the Feng Clan.<br/><br/>If they had such brilliant descendants, they wouldn't be worried about their clan's future.<br/><br/>No matter whether Feng Mei wins this match or not, she will already be known as the greatest genius in Misty Vale City.<br/><br/>After several exchanges, Wang Rouxue's smile grew wider, her excitement evident.<br/><br/>\"You're even better than I imagined, Feng Mei. But let's see how you handle this!\"<br/><br/>With a swift motion, Wang Rouxue's sword flickered, and the air around her seemed to chill.<br/><br/>She began to weave her Earth-Grade technique.<br/><br/>\"Frozen Lotus Sword Art!\"<br/><br/>The temperature dropped as ice-blue lotuses formed in the air around her, each petal sharp as<br/><br/>a blade and imbued with a deadly cold.<br/><br/>But Feng Mei didn't flinch. Instead, she raised her sword and began gathering qi. S~eaʀᴄh the NovelFire.net* website on Google to access chapters of novels early and in the highest quality.<br/><br/>\"Heavenly Emperor's Sword!\"<br/><br/>As the frozen lotuses closed in, Feng Mei spun gracefully, her sword cutting through the air<br/><br/>like a streak of lightning.<br/><br/>The force of her strikes shattered the frozen lotuses before they could reach her, the shards of ice sparkling like diamonds as they scattered across the arena floor.<br/><br/>Wang Rouxue's eyes widened in shock. To date, there was no one among her peers who could<br/><br/>take this technique head-on.<br/><br/>\"Impressive, but this is just the beginning!\"<br/><br/>She pressed forward, unleashing more of her Frozen Lotus Sword Art, her attacks growing<br/><br/>more fierce and complex.<br/><br/>Feng Mei was able to comprehend only the first level of Heavenly Emperor's Sword which allowed her sword an extraordinary sharpness, capable of cutting through almost anything, including techniques and defensive artifacts.<br/><br/>If she were to comprehend more, she would have been able to unleash waves of slashes which could have ended the match right there and then.<br/><br/>However, Feng Mei didn't just comprehend the Heavenly Emperor's Sword but also another<br/><br/>Heaven Grade Technique.<br/><br/>Wang Rouxue continued attacking, trying to corner and exhaust Feng Mei.<br/><br/>\"Ghostly Shadow Mirage!\"<br/><br/>Just then, Feng Mei used the Heaven Grade Technique Ghostly Shadow Mirage to instantly<br/><br/>disappear from her initial position.<br/><br/>\"What!\"<br/><br/>Wang Rouxue blurted out as she couldn't see Feng Mei's movement at all. She quickly looked<br/><br/>left and right, trying to find Feng Mei.<br/><br/>-SHING!<br/><br/>However, it was already too late. The next moment, a sword appeared from behind, its blade<br/><br/>shimmering dangerously close to Wang Rouxue's neck.<br/><br/>\"I concede!\"<br/><br/>Wang Rouxue declared, her voice steady despite her defeat. Despite her defeat, it didn't<br/><br/>dishearten Wang Rouxue who had given her all.<br/><br/>Feng Mei, with a graceful motion, sheathed her sword and stepped backward.<br/><br/>\"Thanks for letting me win!\"\t\t\t\t\t\t</div>", "images": {}, "success": true}