{"id": 19, "url": "https://www.novelhall.com/my-brothers-the-protagonist-good-thing-i-awakened-my-system-33973/14946563.html", "title": "Chapter 19: Feng Yun'S Luck?", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 19: Feng Yun'S Luck?</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 19: Feng Yun's Luck?The crowd erupted into a mix of cheers and gasps as Feng Mei emerged victorious. The atmosphere in the arena shifted from disbelief to admiration.<br/><br/>\"You fought well, Feng Mei. I look forward to seeing you advance further in the competition.\"<br/><br/>Wang Rouxue said as she left the arena.<br/><br/>As Wang Rouxue gracefully exited the arena, she was met with respectful nods and murmurs of appreciation from the spectators.<br/><br/>Despite her loss, she had proven herself to be an exceptional fighter, and her defeat at the hands of Feng Mei only solidified the latter's reputation as one of the brightest talents in Misty Vale City.<br/><br/>Feng Chen watched from the sidelines, a faint smile playing on his lips.<br/><br/>He knew that her victory would send ripples through the competition, making the other families even more wary of the Feng Clan.<br/><br/>\"Let the next match begin!\" the referee announced, bringing the crowd's attention back to the arena.<br/><br/>The next few matches were intense, with participants showcasing their unique skills and techniques.<br/><br/>The arena buzzed with excitement as each fight brought something new to the table.<br/><br/>The battles were fierce, and the crowd was treated to a spectacle of martial prowess that they would remember for years to come.<br/><br/>However, none of the matches were as fierce and exciting as the one shown by Feng Mei and Wang Rouxue.<br/><br/>the round progressed, Feng Yun's turn soon came. seaʀᴄh thё NovelFire.net* website on Google to access chapters of novels early and in the highest quality.<br/><br/>\"The next match will be Feng Yun Vs Feng Xiaoyu!\"<br/><br/>The match participants were announced when the crowd became extremely displeased and angry.<br/><br/>\"F**K! This Feng Chen is too lucky!\"<br/><br/>\"Another genius of the Feng Clan is going to surrender. Tsk! Tsk!\"<br/><br/>\"This Feng Yun is advancing without a fight. How is this fair?\"<br/><br/>Because of Feng Liang's surrender, many people weren't happy with Feng Yun and hoped that he would be eliminated in this round.<br/><br/>However, as luck would have it, Feng Yun's opponent was once again another member of Feng Clan.<br/><br/>Looking at the last round, they knew that this time also, Feng Xiaoyu would surrender.<br/><br/>Feng Xiaoyu had similar strength to Feng Liang, so it didn't make sense for her to not surrender when Feng Liang already did.<br/><br/>\"I surrender!\"<br/><br/>And just like they thought, Feng Xiayu immediately surrendered, not even bothering to show up in the arena.<br/><br/>\"I can't believe that Feng Yun has entered the Top 6 by just having fought one match.\" \"Humph! Zhao Tianming or Yan Zhihao will surely teach this guy a good lesson.\"<br/><br/>With such dissatisfaction, the final match of the third round had finished.<br/><br/>The crowd didn't forget about Feng Yun when the first match of the fourth round was announced.<br/><br/>The referee seemed hesitant to speak before he did.<br/><br/>\"The next match will be Feng Yun Vs Feng Mei!\"<br/><br/>!!!<br/><br/>\"Whaat!\"<br/><br/>\"How can Feng Yun be so lucky?\"<br/><br/>\"Is the Referee colluding with the Feng Clan?\"<br/><br/>\"Sh*t! I wanted to watch more of Feng Mei's fights. Please, don't tell me that she is also going to surrender.\"<br/><br/>\"This Feng Yun is going to drag the Feng Clan down!\"<br/><br/>Feng Yun, who had been sitting the whole time, was surprised. He didn't think that he would advance to Top-3 without having to fight.<br/><br/>(Could this be considered lucky or unlucky? o<br/><br/>Feng Yun thought as he felt helpless. He wants to show that he is capable of advancing to the next round but as luck would have it, he didn't need to fight again.<br/><br/>In any case, Feng Yun didn't ponder over this for long as he believed that he would soon get the chance to prove himself.<br/><br/>\"Referee, I would like to surrender!\"<br/><br/>Feng Mei said.<br/><br/>\"O-Oh... Okay!\"<br/><br/>\"With Feng Mei giving up, Feng Yun will advance to the next round!\"<br/><br/>The referee announced to the still dissatisfied audience. They wanted to complain but what can they do?<br/><br/>The competition was hosted by the Wang Family, and the person benefiting was from the Feng Family. Both of them were someone that they couldn't afford to offend.<br/><br/>\"Humph! Feng Head, it looks like your Feng Yun has good luck.\"<br/><br/>Yan Zhan said disdainfully. He was hoping for Feng Yun to be eliminated but he kept on advancing, relying on his luck.<br/><br/>Feng Chen smirked, his eyes gleaming with amusement as he replied to Yan Zhan.<br/><br/>\"Indeed, Yun's luck is extraordinary. After all, it takes a stroke of fortune to have so many talented participants in one family.\"<br/><br/>\"Alas, not every clan is blessed with such luck, is it Patriarch Yan? If only the Yan Family had the same 'luck,' they wouldn't need to rely on just one or two outstanding individuals. But then again, perhaps Yan had been pretty unlucky, having two elders get killed by me!\"<br/><br/>Feng Chen's words hung in the air, dripping with sarcasm and totally disregarding Yan Family's face.<br/><br/>Feng Chen's killing of the Yan family's two elders is a sore spot for them, so much so that even the other Major Families dare not mention it.<br/><br/>Those who dared to spread that had met their end at the Yan Family's hands.<br/><br/>However, Feng Chen dares to casually mention it. It was the same as slapping Yan Zhan in his face in public.<br/><br/>Yan Zhan's face darkened, his lips pressing into a thin line as he struggled to maintain his composure in front of the others.<br/><br/>\"Feng Chen! Don't think just because you are powerful, you can say whatever you want. We have not yet pursued you for killing our elders, and you dare mention it.\"<br/><br/>Yan Zhan said furiously.<br/><br/>\"Haha... Whether I dare or not, you know me well enough. And what can you even do to me?<br/><br/>Fight me? Are you even capable?\"<br/><br/>Feng Chen said.<br/><br/>It was impossible for them to do anything to him previously with his Peak Three Elements Divine Realm and it was more true after he advanced to Nascent Soul Realm.<br/><br/>If he wants to he can easily kill all of them with one move but he refrained from that. Alas, having his previous life memory, he knows that he couldn't just show off his power. Moreover, that was something a villain would do. He wouldn't want to become a villain as<br/><br/>they are just someone who ends up dead anyway.<br/><br/>Hearing Feng Chen's domineering words, Zhao, Yan, Liu, and Wang Head, their elders, and the younger generation who heard him were all stunned.<br/><br/>The audacity of Feng Chen's remarks and the sheer confidence in his demeanor were<br/><br/>unprecedented, even for someone of his stature.<br/><br/>Yan Zhan's face flushed with anger, his eyes narrowing as he fought to contain his rage. It was<br/><br/>the same for Yan Family's elders and younger generation.<br/><br/>How can they show their face if they didn't do something after being insulted like this?<br/><br/>-BANG!<br/><br/>Yan Zhan slammed his hand on the table in anger.<br/><br/>\"Feng Chen, your arrogance is beyond belief. Do you truly think you are the strongest?\"<br/><br/>Feng Chen's smirk widened.<br/><br/>\"Arrogance? No. It's simply the truth. If you want to prove that I am lying, you are welcome to<br/><br/>try!\"<br/><br/>Feng Chen continued, \"And I do believe I am strongest among all of you!\"<br/><br/>\"Such arrogance!\" one of the Zhao elders muttered, shaking his head.<br/><br/>\"Bold words!\" another elder remarked.<br/><br/>But no one dared to speak out loud as they were afraid of Feng Chen. And although his word<br/><br/>was indeed arrogant, it wasn't false either.<br/><br/>While Feng Chen and Yan Zhan were talking to each other, the referee announced the second<br/><br/>match which was between Yan Zhihao and Liu Jia.<br/><br/>Yan Zhan immediately calmed down and then stared at Feng Chen.<br/><br/>\"Hmph! Feng Chen, how about a bet?\"<br/><br/>Yan Zhan said.<br/><br/>\"A bet?\"<br/><br/>Feng Chen could see what Yan Zhan was trying to do.<br/><br/>(He must have wanted to make me angry and suggest a bet all along.)<br/><br/>Feng Chen was sure of that. Although his plan backfired and it became Yan Zhan who was<br/><br/>angered, it seems like he still plans on proceeding with his little trick.<br/><br/>\"Feng Chen, how about we bet on who would be the winner of the competition?\"<br/><br/>Yan Zhan said with a cunning smile.<br/><br/>Feng Chen raised an eyebrow, his expression a mixture of curiosity and amusement. He could<br/><br/>see what Yan Zhan was planning.<br/><br/>Still, Feng Chen was intrigued by the idea of a bet, especially since he already knew what the<br/><br/>outcome of this competition would be.<br/><br/>\"A bet, you say? And what shall we bet?\" Feng Chen asked, leaning in slightly as if genuinely<br/><br/>interested.<br/><br/>Yan Zhan's smile widened as if thinking that his plan was working.<br/><br/>\"Let's each make a bet of thirty thousand gold coins!\"<br/><br/>Feng Chen considered the offer for a moment. Thirty thousand gold coins was a considerable<br/><br/>sum, which was almost the annual profit of the Feng Clan.<br/><br/>(Since you want to give me money, I shall gladly accept it!)<br/><br/>\"Very well,\" Feng Chen said with a smirk.<br/><br/>\"I accept your bet.\"\t\t\t\t\t\t</div>", "images": {}, "success": true}