{"id": 13, "url": "https://www.novelhall.com/my-brothers-the-protagonist-good-thing-i-awakened-my-system-33973/14946557.html", "title": "Chapter 13: Annual Genius Competition!", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 13: Annual Genius Competition!</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 13: Annual Genius Competition!Days turned into weeks as the feat of Feng Chen spread further and further throughout the Azure Sky Empire.<br/><br/>But what confused the people of Misty Vale City was that instead of showing off, most Feng Clan members, including the younger generations, were cooped up in their territory.<br/><br/>Rumors and speculations ran rampant throughout Misty Vale City. People wondered what could possibly keep the Feng Clan members from flexing their strength.<br/><br/>Many guessed that it might be due to their fear of retaliation from Mystic Flame Sect while others thought it might be because they were training for the Misty Vale City's annual genius competition.<br/><br/>Unbeknownst to the gossiping crowds, Feng Clan members were in no mood to play around with all the resources given by Feng Chen.<br/><br/>They were all busy cultivating and trying their best to become stronger.<br/><br/>The Feng Clan had just completed an internal competition for members below the ages of 20 and 15.<br/><br/>The winners were rewarded with Marrow Cleansing Pills, Earth-grade artifacts, and cultivation pills, just as Feng Chen had promised.<br/><br/>Seeing such generous rewards, many of the Feng Clan members looked enviously at the six winners, especially those who had come close but ultimately lost.<br/><br/>Sensing the disheartened looks of many clan members who missed out, Feng Chen addressed the clan.<br/><br/>\"Do not be discouraged,\" he said with a reassuring smile.<br/><br/>\"There will be many such opportunities in the future with similar or better prizes. So, I hope you all continue to strive to be stronger!\"<br/><br/>His words were met with a wave of renewed determination. The younger members, especially, were invigorated by the promise of future rewards.<br/><br/>Feng Chen also added another 100 cultivation pills for Feng Clan which greatly motivated Feng Clan's younger generation.<br/><br/>The atmosphere within the clan shifted from one of quiet cultivation to a fervent drive for improvement.<br/><br/>The Feng Clan members returned to their rigorous training schedules with even greater zeal after the competition.<br/><br/>Feng Chen also provided guidance, ensuring that everyone was making the most of the resources and knowledge available.<br/><br/>Moreover, he also taught the Mid-level Heaven Grade Defense Technique: Mysterious Heaven Iron Wall, and Mid-level Heaven Grade Movement Technique: Ghostly Shadow Mirage which Feng Chen brought from the System Store along with the High-Level Heaven Grade Sword Technique: Heavenly Emperor's Sword.<br/><br/>Of course, Feng Chen refrained from going overboard and teaching them Saint Grade Body refinement Techniques as that would bring disaster to themselves and the Feng Clan if discovered by others.<br/><br/>Moreover, they were too weak to grasp the technique's essence, making it a waste of time for them to try to master a Saint Grade Technique at their level.<br/><br/>It would be best to teach Saint-Grade Technique only after they had reached the Three Elements Divine Realm or if they had exceptional comprehending power.<br/><br/>Learning the three Heaven Grade techniques was already a daunting task for most of them. Most members had chosen to focus on one technique and set aside the others for the future.<br/><br/>After all, it was much better to master one technique than to just vaguely know three. Quantity didn't mean much if there was no quality.<br/><br/>However, there are always exceptions. Feng Yun, who was previously among the lowest in cultivation, was able to grasp the essence of all three techniques.<br/><br/>Feng Yun had always possessed a brilliant mind, and despite his low cultivation level, he managed to master nearly all the techniques he was taught.<br/><br/>Many of the Feng Clan Elders viewed this as a missed opportunity. Feng Yun had inherited Feng Chen's exceptional comprehension ability, but his innate cultivation talent was less than 10% of his brother's.<br/><br/>However, with the aid of the Marrow Cleansing Pill, it seemed that Feng Yun's cultivation talent had been finally awakened.<br/><br/>He had been stuck at the Mid-level Qi Gathering Stage for years, but within a few days, he had reached the peak of this stage. His progress was even more astonishing than Feng Chen's.<br/><br/>If this continues, he was very well on the path of surpassing the cultivation speed of Feng Chen at that age.<br/><br/>The nine clan members who received the marrow cleansing pill were also showing good progress as they were already on the verge of breaking through only days after taking the pills.<br/><br/>With such remarkable developments, the Feng Clan members-particularly the younger generation—were feeling a surge of competitive spirit.<br/><br/>*****<br/><br/>A month passed by in a blink of an eye!<br/><br/>The Misty Vale City was in a festive mood since today was the day of the Annual Genius Competition.<br/><br/>This is the event that has been hosted by the Wang Family ever since its establishment.<br/><br/>It was not because the Wang family was the strongest but because of their connection with the Imperial Family.<br/><br/>The Wang family never participated in the power struggle in Misty Vale City and was kept by the Imperial Family to keep an eye on Misty Vale City.<br/><br/>They were like police assigned by the Royal family just in case something happened to Misty Vale City. That's why there was no opposition from others and also less chance of corruption.<br/><br/>The atmosphere in Misty Vale City was electric as the day of the Annual Genius Competition finally arrived.<br/><br/>The city, usually bustling with daily activities, was now thrumming with anticipation.<br/><br/>Colorful banners and flags adorned the streets, and the sound of excited chatter filled the air as people from all corners of the region gathered to witness the event.<br/><br/>Tea houses and restaurants were packed to the brim with patrons eagerly discussing the upcoming competition.<br/><br/>In the largest tea house near the city square, a group of cultivators sat around a low table, sipping fragrant tea as they speculated on the potential winners.<br/><br/>The clinking of teacups and the murmur of conversation created a lively ambiance, while the staff busily moved about, ensuring everyone was well-served.<br/><br/>\"The Feng Clan has been rather quiet lately,\" one elderly man mused, stroking his long, white<br/><br/>beard.<br/><br/>\"However, that is expected as their younger generation is lackluster compared to Feng Chen. They should be trying their best to get stronger to avoid getting humiliated.\"<br/><br/>\"Indeed,\" another patron chimed in. \"Feng Clan had always been the last out of the other<br/><br/>major families.\"<br/><br/>\"I think it will be Zhao Tianming. He was already at the Foundation Establishment since he was 15. I think that he must have reached late or reached the peak of the Foundation Establishment stage.\"<br/><br/>\"Hmm! But I think it will be Lui Zhenhai. Although his cultivation is a bit lower than Zhao Tianming, his grasp of the spear technique of the Lui Family surpasses that of Zhao Sёarᴄh the Nôvelƒire.net website on Google to access chapters of novels early and in the highest quality.<br/><br/>Tianming.\"<br/><br/>\"Yan Zhihao and Wang Rouxue aren't bad either!\"<br/><br/>Meanwhile, a few tables over, a group of merchants were engrossed in a different kind of<br/><br/>discussion-betting.<br/><br/>One of the merchants, a stout man with a gleaming bald head, was laying out a makeshift betting board on the table, with names of prominent clans and their representatives written<br/><br/>in neat rows.<br/><br/>\"Place your bets!\" he called out to the crowd.<br/><br/>\"Who do you think will emerge as the champion this year? The Wang Clan, the Zhao Clan, or perhaps a dark horse from the smaller families? All odds are fair!\"<br/><br/>Coins and spirit stones were exchanged as bets were placed, the excitement in the room<br/><br/>palpable.<br/><br/>The betting board quickly filled up with wagers, and the stout merchant grinned as the pile of<br/><br/>-coins grew.<br/><br/>Outside, stalls selling everything from artifacts to rare herbs had sprung up along the main roads leading to the competition grounds.<br/><br/>The scent of roasting meat and sweet pastries wafted through the air, drawing crowds of spectators who had traveled from afar to attend the event.<br/><br/>Children ran through the streets, waving small flags and cheering for their favorite clans,<br/><br/>while cultivators of various levels and backgrounds mingled, exchanging news and gossip.<br/><br/>The atmosphere was one of celebration and fierce anticipation, as everyone awaited the start of the competition that would determine the brightest talents in Misty Vale City.\t\t\t\t\t\t</div>", "images": {}, "success": true}