{"id": 11, "url": "https://www.novelhall.com/my-brothers-the-protagonist-good-thing-i-awakened-my-system-33973/14946555.html", "title": "Chapter 11: Marrow Cleansing Pills", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 11: Marrow Cleansing Pills</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 11: Marrow Cleansing Pills\"There are exactly 100 Qi Gathering Pills, 100 Ethereal Spirit Pills, 100 Foundation Establishment Pills, and 100 Mystic Insight Manuals.\"<br/><br/>Feng said. He had exchanged 90 of each pill earlier from the System stores. Those pills were at most 2nd rank and were pretty cheap in the System store.<br/><br/>1st Rank pills cost an average of only 10 System Points while 2nd rank pills were priced at around 100.<br/><br/>So even if he had brought all those pills, it only cost around 20,000 System, which was quite cheap considering the value it brought.<br/><br/>With these resources, the strength of the Feng Clan would be brought to the next level. \"...\"<br/><br/>The hall fell into a stunned silence as Feng Chen's words sunk in.<br/><br/>The elders, who had been through countless battles and seen the rise and fall of the Feng Clan, could hardly believe their ears.<br/><br/>\"... Nephew, a-are you sure about this?\"<br/><br/>Elder Wei asked, his voice trembling slightly.<br/><br/>Although Elder Wei didn't know how Feng Chen got all these resources, he knew that it would have cost a lot of money. And he knew that it wasn't from Clan's budget either as they don't<br/><br/>have that kind of money.<br/><br/>\"Yes, Elder Wei!\"<br/><br/>Feng Chen replied calmly.<br/><br/>\"With these resources, our younger generation will have the foundation they need to grow stronger. We are no longer in a position where everything is dependent on me. I need other Feng Clan members to also be stronger.\"<br/><br/>The elders exchanged glances, their expressions a mix of sadness and excitement. They know how much sacrifices Feng Chen made and is willing to make.<br/><br/>Even now, those pills might be ineffective to Feng Chen but he could sell them for a hefty price or exchange for higher-ranked pills.<br/><br/>They knew that if it weren't for the Feng Clan holding him back, Feng Chen would have become even stronger. Alas, they weren't capable of nurturing such genius and burdened him with Clan's problem.<br/><br/>\"Elder Wei,\" Feng Chen continued, \"There's no need to hold back the pills. Distribute them today, and if anyone makes a breakthrough, let them know I will reward them generously.\"<br/><br/>Feng Chen said. This was so that it could motivate the younger generation of Feng Clan to work harder.<br/><br/>\"Understood, Nephew!\"<br/><br/>Elder Wei said excitedly, nodding firmly.<br/><br/>Feng Chen then turned his attention to the three geniuses.<br/><br/>\"Feng Xiaoyu, Feng Jianhong, and Feng Liang! You three have shown great potential.\"<br/><br/>He reached into his spatial ring and retrieved a small, ornate box. Opening it, he revealed three shimmering pills, each exuding a faint, otherworldly glow.<br/><br/>\"These are Marrow Cleansing Pills. They will purify your bones and enhance your cultivation potential. Use them wisely.\"<br/><br/>The hall fell into a stunned silence. The elders, who had seen countless treasures and resources in their time, were taken aback by the sight of the Marrow Cleansing Pills.<br/><br/>Such rare and valuable items were almost unheard of in the Feng Clan, and the fact that Feng Chen was giving them to the younger generation left them speechless.<br/><br/>\"M-Marrow Cleansing Pills?!\" Elder Wei gasped, his eyes wide with disbelief.<br/><br/>Although Marrow Cleansing Pills were 4th rank pills, it was so rare and hard to create that most people wouldn't even exchange them for 5th-ranked pills.<br/><br/>These three pills could be considered at least 10 times more valuable than all the pills in Elder Wei's hands.<br/><br/>(Where did Nephew get all these treasures? Could it be that he stole the Imperial Family's treasure?)<br/><br/>Elders thought to themselves.<br/><br/>Feng Xiaoyu, Feng Jianhong, and Feng Liang stepped forward, their eyes wide with awe and gratitude. They each accepted a pill with both hands, bowing deeply to Feng Chen.<br/><br/>\"Thank you, Clan Leader! We will not disappoint you!\" Feng Xiaoyu said, her voice filled with determination.<br/><br/>\"Yes, Clan Leader,\" Feng Jianhong added. \"We will strive to become the pillars of the Feng Clan.\"<br/><br/>Feng Liang, the youngest of the three, nodded fervently. \"We will do our best!\"<br/><br/>Feng Chen smiled warmly. \"I have no doubt that you will succeed. With these pills and the resources we have, your cultivation will advance swiftly. Dedicate yourself to your training and strive for the highest realms.\"<br/><br/>He also reminded them, \"Don't forget that there's a competition for the younger generation in Misty Vale City. Make sure you're prepared to showcase your newfound strength.\" Misty Vale City has an annual event where people below 20 years old compete with each other.<br/><br/>This was not only the opportunity to win an attractive prize but also to increase the fame of oneself and their family.<br/><br/>However, most of the time, it was just an event where the Three Major Families flexed their strength. The only time when the three major families lost was when Feng Chen competed.<br/><br/>It was also when he got the title of \"Invincible Under Grand Qi Condensation Realm\". He then turned his attention to one of the elders.<br/><br/>\"Elder Jinhai, please announce that there will be a clan competition for those under the age of 15 and another for those under 20. The prizes will include Marrow Cleansing Pills and other<br/><br/>resources.\"<br/><br/>Elder Jinhai's eyes widened in surprise, but he quickly regained his composure and nodded.<br/><br/>\"Yes, Nephew. I will make the announcement immediately.\"<br/><br/>The hall buzzed with excitement. The prospect of a competition, especially with such valuable prizes, was sure to ignite the competitive spirit within the younger generation.<br/><br/>Whoever won would see their strength increase several times over with the Marrow Cleansing<br/><br/>Pills, greatly benefiting the Feng Clan.<br/><br/>\"Alright, everyone, you may go and cultivate. Feng Yun, stay behind!\"<br/><br/>Everyone left the main hall in excitement, their spirits high and their minds focused on<br/><br/>becoming stronger.<br/><br/>\"Brother, why did you ask me to stay?\"<br/><br/>Feng Yun asked, his voice respectful yet curious.<br/><br/>Feng Chen motioned for him to sit and then spoke<br/><br/>\"Feng Yun, I need you to understand the weight of our situation. The Mystic Flame Sect will<br/><br/>not take Elder Zhou's defeat lightly. They will retaliate, and they will come for us.\"<br/><br/>Feng Yun nodded, his expression serious.<br/><br/>\"I understand, Brother. What do you need me to do?\"<br/><br/>\"Feng Yun, how confident are you in winning against Ling Meiyu in three years?\"<br/><br/>Feng Yun's expression turned solemn as he looked at his elder brother. Although he was much more confident since he now knew why he was cultivating slowly before and had the help of Senior Minghao, Ling Meiyu was a peerless genius who was already in the Grand Qi Condensation Realm.<br/><br/>It would be very difficult to reach Grand Qi Condensation Realm in three years and who knows what Realm Ling Meiyu would be in another three years. She may very well reach the Three Elements Divine Realm.<br/><br/>\"Brother, I know my current abilities are lacking, but I won't let you down. I'll train harder, do whatever it takes to improve and in three years, I will surpass Ling Meiyu!\" Searᴄh the Nôvel(F)ire.ηet website on Google to access chapters of novels early and in the highest quality.<br/><br/>Feng Yun said with determination.<br/><br/>Feng Chen nodded.<br/><br/>\"I believe in you, Feng Yun.\"<br/><br/>Unlike before, Feng Chen could sense Feng Yun's confidence. It seems like he has indeed<br/><br/>changed.<br/><br/>Before, Feng Chen knew that Feng Yun was a very determined person, however, reality knocked him down many times and he couldn't cultivate properly.<br/><br/>Even Feng Chen didn't know what the problem was and thought that it had something to do<br/><br/>with the Feng Yun constitution.<br/><br/>After failing again and again, even Feng Yun would lose his confidence but now, it seems like<br/><br/>he had regained his confidence.<br/><br/>Feng Chen reached into his spatial ring and took out a box.<br/><br/>\"Take this! It has a marrow cleansing pill along with other cultivation resources.\"<br/><br/>\"You don't need to feel disappointed that you didn't get a Marrow Cleansing Pill earlier. As<br/><br/>your elder brother, how could I possibly forget about you?\"<br/><br/>Feng Yun accepted the bottle with both hands, his eyes wide with gratitude. \"Thank you, Brother. I will not disappoint you.\"<br/><br/>Feng Chen placed a reassuring hand on his brother's shoulder. \"I know you won't. Now, go back and take it immediately and begin your training. Time is of the essence.\"<br/><br/>\"And as for retaliation from Mystic Flame Sect and others, you don't need to worry about that. This brother of yours can handle them!\"<br/><br/>Feng Chen said, so as to not make Feng Yun feel guilty about him divorcing Ling Meiyu.<br/><br/>\"I understand, brother!\"<br/><br/>Feng Yun replied. Like Feng Chen noticed Feng Yun's change, Feng Yun also noticed Feng<br/><br/>Chen's change.<br/><br/>As Feng Yun left the hall to begin his practice, Feng Chen turned his thoughts back to the<br/><br/>Mystic Flame Sect.<br/><br/>The defeat of Elder Zhou had undoubtedly stirred the hornet's nest, and retaliation was inevitable. He needed to be ready for any eventuality, ensuring the clan's safety and future.<br/><br/>As for the Ling Family, Feng Chen didn't think that they would do anything before the three-<br/><br/>year promise was completed.<br/><br/>In any case, Feng Chen knew that the solution to all problems was getting stronger.<br/><br/>As long as he was strong enough, he wouldn't need to worry about these things.<br/><br/>\"Now then, shall I also cultivate!\"\t\t\t\t\t\t</div>", "images": {}, "success": true}