{"id": 16, "url": "https://www.novelhall.com/my-brothers-the-protagonist-good-thing-i-awakened-my-system-33973/14946560.html", "title": "Chapter 16: Feng Yun'S Power Revealed", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 16: Feng Yun'S Power Revealed</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 16: Feng Yun's Power RevealedAs the preliminary rounds wrapped up, the arena's energy shifted to a new level of anticipation.<br/><br/>With the top twenty participants chosen, the focus now turned to the main event.<br/><br/>The atmosphere crackled with excitement as the spotlight moved to the participants from the Major Families.<br/><br/>One by one, the representatives from the Five Major Families made their way toward the stage, their presence commanding immediate respect and attention.<br/><br/>Their arrival was marked by a blend of awe and speculation from the crowd.<br/><br/>The Five Major families each sent five of their young geniuses. Hailing from the Feng Clan were Feng Yun, Feng Xiaoyu, Feng Jianhong, and Feng Liang and the last participant was Feng Mei.<br/><br/>Feng Mei had the highest talent in Feng Clan and although she wasn't blood-related, Feng Chen couldn't neglect such talent because of that.<br/><br/>He also gave her a Marrow Cleansing Pill and some cultivation resources. As a result, she went directly from the Initial Foundation Establishment Stage to the Late Foundation<br/><br/>Establishment Stage in one month.<br/><br/>That also meant that she was now one of the strongest people in Feng Clan's younger generation surpassing even Feng Liang who was formerly the strongest person in the younger generation.<br/><br/>(As expected of exceptional talent!)<br/><br/>Feng Chen was quite happy with her progress.<br/><br/>\"Feng Yun, Feng Xiaoyu, Feng Jianhong, Feng Liang, and Feng Mei, give it your all out there. Winning isn't everything, but if you do come out on top, this leader has a special reward waiting for you.\"<br/><br/>Feng Chen said. If they won, he would earn System Points and as they were the ones who did all the work, Feng Chen was willing to reward them with something good from the System Store.<br/><br/>\"We will not let you down, Clan Leader!\"<br/><br/>Feng Xiaoyu, Feng Jianhong, Feng Liang, and Feng Mei replied while being excited by what they might get.<br/><br/>Feng Yun just nodded at his brother without much change in his expression but he was also determined.<br/><br/>Today was the day that he was going to remove his title as \"Trash\".<br/><br/>Feng Yun, now among these esteemed competitors, stood with the Feng Clan.<br/><br/>His position at the forefront of the younger generation drew considerable attention, particularly given the skepticism surrounding his abilities.<br/><br/>Yet, as he walked toward the stage with a calm, resolute demeanor, he seemed to embody a quiet strength that belied the doubts of others.<br/><br/>The crowd buzzed with whispers and speculation as the Major Family participants took their places.<br/><br/>With the Major Families participants now fully present, the stage was set for an electrifying series of battles.<br/><br/>\"The stage is set, and the competitors are ready,\" the announcer declared. \"Now, let's draw lots to determine the matchups for the first round.\"<br/><br/>As the participants drew their lots, the crowd's anticipation grew.<br/><br/>Once the pairings were finalized, the announcer continued, \"The first match-up is between Feng Yun and Huang Yu!\"<br/><br/>The crowd erupted into a mixture of gasps and excited murmurs as the matchup was announced.<br/><br/>Feng Yun versus Huang Yu-two names that carried significant weight in the competition. Huang Yu, representing the Huang family, was considered one of the strongest, and Feng Yun, on the other hand, had the label of being trash.<br/><br/>Many thought that this was going to be a one-sided match.<br/><br/>\"Sigh! Looks like Feng Yun is going to be eliminated in the first match!\"<br/><br/>\"Humph! That's what happens when you abuse your power. Feng Yun being Feng Chen's brother must have seized the spot even if he was weak. Now he will get his karma!\"<br/><br/>\"In any case, it will be the first in the history for a Major Family's participants to be eliminated by other clans in the first match. Feng Clan is going to be humiliated!\" ....<br/><br/>No one thought that Feng Yun would win. Even the Major Family was gloating over Feng Clan's bad luck.<br/><br/>Even their descendants would have struggled against Huang Yu. So it was a good thing that it was Feng Clan's participants who met him in the first match.<br/><br/>However, unlike them, the Feng Clan was calm including the juniors which surprised many people.<br/><br/>\"Humph! This Feng Clan has really good actors. I want to see how calm they are when their second young master gets eliminated in his first match.\"<br/><br/>Yan Zhan said disdainfully.<br/><br/>As Feng Yun made his way to the stage, he met Huang Yu's gaze. Huang Yu's expression was full of confidence, a hint of a smirk playing at his lips.<br/><br/>It seems like he thinks he got lucky with this match-up!<br/><br/>Feng Yun, undeterred, returned the look with a steady and unyielding stare.<br/><br/>The stage was set, with both competitors now standing in their respective corners.<br/><br/>The referee raised his hand, signaling for the competitors to prepare.<br/><br/>\"The first match of the main event is about to start. Contestants, take your positions!\"<br/><br/>Huang Yu and Feng Yun took their stances, each preparing for the battle ahead.<br/><br/>Huang Yu's movements were precise and calculated, while Feng Yun's didn't seem much<br/><br/>interested in the fight.<br/><br/>Huang Yu perceived that Feng Yun was giving up and was even more arrogant.<br/><br/>The referee's voice cut through the tension. \"Begin!\"<br/><br/>Instead of launching into combat, Huang Yu smirked and spoke up.<br/><br/>\"Feng Yun, I know who you are. Given that you're younger and weaker than me, it wouldn't be too humiliating if you just surrendered now.\"<br/><br/>Huang Yu's tone was laced with sarcasm.<br/><br/>Though there was no direct feud between the Huang and Feng Clans, the Huang Clan was well aware of their rivals.<br/><br/>As the second-strongest clan among the Five Major Families, the Huang Clan had their eyes<br/><br/>on the Feng Clan's position.<br/><br/>Despite the Feng Clan being the weakest of the Five Major Families, taking them down could pave the way for the Huang Clan's rise.<br/><br/>However, they knew that challenging the Feng Clan's leader, Feng Chen, was beyond their reach until their own leader broke through to the Grand Qi Condensation Realm.<br/><br/>In terms of the younger generation, however, Huang Clan members were generally superior to those of the Feng Clan.<br/><br/>That's why Huang Yu taunted Feng Yun-if Feng Yun surrendered, his reputation as \"trash\" and \"coward\" would be cemented, while Huang Yu would be seen as merciful.<br/><br/>\"Hahaha...\"<br/><br/>Feng Yun, who had remained silent up to this point, suddenly burst into laughter as if he had<br/><br/>heard the funniest joke.<br/><br/>\"Huang Yu, save the pretense. If you want me to surrender, you'll have to make me with your<br/><br/>sword,\" Feng Yun said with a grin.<br/><br/>\"Humph! Remember what you said. I gave you a chance, but you chose not to take it.\"<br/><br/>Huang Yu wasted no time. He launched into a series of swift, aggressive attacks, his movements a blur of speed and power.<br/><br/>Feng Yun, however, dodged every single strike of Huang Yu with ease.<br/><br/>CLANG! CLANG!<br/><br/>Huang Yu's attacks were relentless, but Feng Yun's defenses held firm.<br/><br/>Huang Yu widened his eyes in surprise as he seemed to realize the truth.<br/><br/>\"Y-You... You are also in the Mid-Level Foundation Establishment Stage!\"<br/><br/>Huang Yu said with horror.<br/><br/>Being able to take on his attack head-on, Huang Yu realized that Feng Yun was also in the Mid-Level Foundation Establishment Stage.<br/><br/>As Huang Yu's realization echoed through the arena, the crowd's murmurs swelled into a crescendo of shock and disbelief.<br/><br/>\"Wait, did he just say Feng Yun is at the Mid-Level Foundation Establishment Stage?\"<br/><br/>\"Impossible! I thought he was just at the Mid-Level Qi Gathering Stage. How can he have<br/><br/>advanced so quickly?\"<br/><br/>\"No wonder he's handling Huang Yu's attacks so easily. This changes everything!\"<br/><br/>\"Did Feng Yun really improve that much? This is unbelievable!\"<br/><br/>The spectators exchanged astonished glances, their previous doubts about Feng Yun's abilities rapidly evaporating.<br/><br/>The buzz of conversation grew louder, a mix of disbelief and excitement spreading through<br/><br/>the audience.<br/><br/>On the opposite side of the arena, members of the Five Major Families were equally shocked<br/><br/>by the discovery.<br/><br/>With their keen sense, how would they not know the level of strength that Feng Yun was using<br/><br/>to defend against Huang Yu's attack?<br/><br/>\"Damn it! How can Feng Yun have such strength?\" Yan Zhan gritted his teeth, frustration<br/><br/>evident in his voice.<br/><br/>It was not only because previously Feng Yun was a well-known trash but also because of his<br/><br/>age.<br/><br/>Feng Yun, at the age of 16 is at the Mid-level Foundation Stage, wasn't that comparable to some of the geniuses in the First-rated Sect?<br/><br/>Zhao and Liu Family Heads also didn't have good expressions on their faces. They knew what kind of monster Feng Yun would turn out if he were to grow. Feng Chen was a good example.<br/><br/>(We can't afford to have another Feng Chen in Feng Clan!)<br/><br/>Both their heads seemed to have the same thought.<br/><br/>Feng Chen's face remained calm, but a satisfied glint shone in his eyes. seaʀᴄh thё NôvelFire.nёt website on Google to access chapters of novels early and in the highest quality.<br/><br/>(From today, no one will look down on you!)<br/><br/>Feng Chen thought. It was one thing off his chest. He always felt guilty of not being able to<br/><br/>help his brother but now there was no need to worry about that.<br/><br/>His brother was the protagonist!\t\t\t\t\t\t</div>", "images": {}, "success": true}