{"id": 10, "url": "https://www.novelhall.com/my-brothers-the-protagonist-good-thing-i-awakened-my-system-33973/14946554.html", "title": "Chapter 10: Revealing His Realm!", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 10: Revealing His Realm!</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 10: Revealing His Realm!Within a short time, the main hall was filled with the key figures of the Feng Clan. The elders took their seats, their faces reflecting a mixture of concern and anticipation.<br/><br/>They weren't like those younger generations who only bask in momentary victory.<br/><br/>Although they were happy about Feng Chen knocking out Elder Zhou, they also knew the trouble that it would bring.<br/><br/>The three geniuses and Feng Yun were also present in the main hall. Feng Yun as the second young master indeed had the privilege of being there.<br/><br/>The only people missing were Grand Elder who would mostly spend most of their time cultivating.<br/><br/>Unless any major problem were to arise, they wouldn't come out of their ancestral ground and spend most of their time cultivating.<br/><br/>It wasn't because they were interested in Feng Clan affairs but because they knew about the Feng Clan's situation that they were trying their best to break through and provide more help to the Feng Clan.<br/><br/>Feng Chen sat in the main seat of the hall, his expression void of worries, even a little excited. He began to speak, his voice steady and authoritative.<br/><br/>\"What do you think about today's event?\"<br/><br/>He asked, his gaze sweeping across the gathered individuals.<br/><br/>The room fell silent, each elder and clan member contemplating their response.<br/><br/>\"Nephew, your actions today have undoubtedly sent a powerful message to the Mystic Flame Sect and other clans of Misty Vale City. However, we must prepare for their retaliation. Elder Zhou's defeat will not go unanswered.\"<br/><br/>Elder Feng Wei, the most senior of the elders present, said. His voice, though aged, carried a weight of authority and wisdom.<br/><br/>Unlike other families, here, most elders prefer calling Feng Chen a Nephew.<br/><br/>It wasn't due to lack of respect or anything like this but because Feng Chen felt weird being called Clan Leader or Family Head by the Elders who used to call him Nephew.<br/><br/>Therefore, he insisted on being called Nephew by his elders and this also showcased the strong relationship between Feng Chen and his elders.<br/><br/>And by Elder Wei's answer, one could guess that the Elders weren't planning to blame Feng Chen for what he did.<br/><br/>They understood Feng Chen's actions and also believed that Feng Chen wasn't a rash person who would do something like that without a plan.<br/><br/>\"Moreover, our relationship with the Ling Family has been severed. So, I guess that Other major families might be thinking about attacking our clan.\"<br/><br/>Elder Wei added, his face full of worries.<br/><br/>Others also nodded to Elder Wei's answer. It was precise to the point without any blame or other nonsense things.<br/><br/>\"Then how do you think we should handle this situation?\"<br/><br/>Feng Chen asked.<br/><br/>\"Nephew, with your power, we might be able to defend ourselves against the other major families. However, it's a different story if we are talking about Elder Zhou and Mystic Flame Sect. The Ling Family might also get involved!\"<br/><br/>Elder Wei answered again.<br/><br/>\"So, I suggest evacuating our younger generation. Even if we were to die fighting, at least our little ones would be safe!\"<br/><br/>Elder Wei said decisively. Elder Wei and others had gone through so many life-and-death situations with Feng Clan that they no longer feared death.<br/><br/>What they cared about was their next generation who might be killed before they experienced life.<br/><br/>The Feng Clan's younger generation present there including Feng Yun was surprised and uncomfortable with Elder Wei's suggestion.<br/><br/>Although they understood that Elder Wei's suggestion was meant to save them from their impending enemy, they had no intention of fleeing with their tail tucked in between their legs.<br/><br/>Feng Chen nodded his head, acknowledging what Elder Wei said. If he didn't have a System, this might have been the most appropriate action.<br/><br/>Though he was already Peak of Three Elements Divine Realm, it was still unknown what Mystic Flame Sect might do to avenge their dignity.<br/><br/>The moment Feng Chen showed his power, it is most likely that the Mystic Flame Sect will also send the Elder of Three Elements Divine Realm.<br/><br/>Even if Feng Chen could beat them once, it wouldn't mean that he could survive against Mystic Flame Sect's second or third wave.<br/><br/>With only Feng Chen being powerful, it would have been unlikely that he could have protected the Feng Clan. But, it was a different story now!<br/><br/>\"Elder Wei's suggestion is wise. However, we don't need to take that course of action. I don't even consider Elder Zhou a threat, and the Mystic Flame Sect is unlikely to make a move anytime soon.\"<br/><br/>Elder Wei and other participating members were surprised by Feng Chen's words and also his confident demeanor.<br/><br/>Who in the Azure Sky Empire would be calm after offending Mystic Flame Sect and Elder Zhou?<br/><br/>*DANG!<br/><br/>Feng Chen didn't let them guess why he was so confident and directly released his powers in<br/><br/>the Three Elements Divine Realm.<br/><br/>\"T-This This power is...\"<br/><br/>\"Nephew, you broke through?\"<br/><br/>The hall buzzed with astonishment as Feng Chen's aura permeated the room.<br/><br/>Elders and the three geniuses alike felt the overwhelming pressure, their faces reflecting a mixture of disbelief and awe.<br/><br/>Feng Yun was also a bit surprised though he seemed to have already guessed that his brother was in the Three Elements Divine Realm.<br/><br/>\"You could say that!\"<br/><br/>Feng Chen answered vaguely, avoiding a direct lie. In truth, he had broken through years ago and felt guilty about hiding it from the Elders.<br/><br/>But with his Earth's knowledge, how could he be arrogant and show off his Three Elements Divine Realm?<br/><br/>He feared the plot of MC attracting stronger villains each time he defeated the weaker villain.<br/><br/>Therefore, he had decided to conceal his true cultivation from everyone and only show it if the<br/><br/>Feng Clan were to be destroyed.<br/><br/>\"Nephew, this is incredible news!\"<br/><br/>\"Three Elements Divine Realm! Our Feng Clan finally has someone in the Three Elements<br/><br/>Divine Realm.\"<br/><br/>\"Three Elements Divine Realm at age 30, even the geniuses of Mystic Flame Sect might not be<br/><br/>able to do that!\"<br/><br/>\"Your parents would be so proud!\"<br/><br/>\"Clan leader is invincible!\"<br/><br/>They were overjoyed by the news.<br/><br/>\"Indeed! With Nephew's strength, there is no need to worry about the other major families.\"<br/><br/>Elder Wei said, realizing Feng Chen's earlier confidence.<br/><br/>\"Anyways, this is not why I called you all here! I never cared about the other major families<br/><br/>anyways.\"<br/><br/>Feng Chen said. He wasn't afraid of other major families previously and it was more true with<br/><br/>the System.<br/><br/>\"Elder Wei, there are some pills in this spatial ring. Please distribute among yourself!\"<br/><br/>Feng Chen said as he threw the Spatial Ring to Elder Wei. It contained all the pills except for<br/><br/>those that could be used by Core Formation Stage and above.<br/><br/>\"Sure, Nephew!\"<br/><br/>Elder Wei said, without much change in his expression.<br/><br/>However, when he checked the contents of the pills, his eyes widened in surprise.<br/><br/>\"N-Nephew, this...\" Searᴄh the novel(F~)ire.net website on Google to access chapters of novels early and in the highest quality.\t\t\t\t\t\t</div>", "images": {}, "success": true}