{"id": 15, "url": "https://www.novelhall.com/my-brothers-the-protagonist-good-thing-i-awakened-my-system-33973/14946559.html", "title": "Chapter 15: The Start Of Annual Geniis Competition!", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 15: The Start Of Annual Geniis Competition!</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 15: The Start Of Annual Geniis Competition!As the Feng Clan made their entrance, the entire competition grounds fell silent, eyes locked onto the unexpected sight of Feng Yun leading the younger generation of Feng Clan.<br/><br/>Feng Chen's presence alone commanded respect, his aura serene yet undeniably powerful. After the incident on his birthday, people's respect for him grew even more.<br/><br/>The elders flanking him now wore expressions of unwavering confidence, their gazes unyielding—a stark contrast to the uncertainty they had shown in previous years.<br/><br/>But it was Feng Yun, standing at the forefront of the younger generation, that drew the most attention.<br/><br/>\"Is that really Feng Yun? The one who couldn't even protect his engagement?\"<br/><br/>A voice in the crowd whispered, disbelief coloring his tone.<br/><br/>\"Why would the Feng Clan allow him to lead? Has the Feng Clan truly fallen so far that a trash is allowed to lead their younger generation?\"<br/><br/>Another spectator murmured, his brow furrowed in confusion.<br/><br/>However, those who watched closely noticed something different about Feng Yun. Gone was the look of defeat that had once plagued him. In its place was a calm determination, a confident presence just like Feng Chen.<br/><br/>Those who had seen Feng Chen participate in the Annual Genius Competition would know the similarity.<br/><br/>An unparalleled confidence that he would win!<br/><br/>And it wasn't just unfound confidence as Feng Chen dominated the competition for three years until he turned 21.<br/><br/>Feng Chen's dominance is well-known among his peers and there was no one among his peers who dared to challenge Feng Chen to date.<br/><br/>Yan Zhan's cunning smile faltered for a moment as he narrowed his eyes, trying to gauge the situation.<br/><br/>(Has Feng Clan truly given up or is there some trick involved?)<br/><br/>Yan Zhan thought and then glanced at Zhao Chenxi, who seemed equally puzzled.<br/><br/>After all, no matter what, they couldn't forget the look of Feng Yun who resembled Feng Chen of that year.<br/><br/>The younger generation might not know but how could those who suffered humiliation for three years under Feng Chen not know?<br/><br/>That smile has somewhat become a trauma for the Zhao, Lui, and Yan family's older generation.<br/><br/>Zhao Tianming, who had been standing with a smug expression, scoffed at the sight of Feng Yun.<br/><br/>\"So the Feng Clan is betting on a loser? This will be easier than I thought!\"<br/><br/>His arrogance was on full display. He didn't believe anyone of his generation was his match, much less a trash like Feng Yun.<br/><br/>\"I didn't think a day would come when I had to compete with the well-known trash!\"<br/><br/>Liu Yingjie said disdainfully. He thought that it was disgraceful for him to be in the same competition as Feng Yun, a trash.<br/><br/>Wang Yifan, observing from the Wang Clan's area, remained silent. His sharp eyes, however, were fixed on Feng Yun.<br/><br/>There was something different, something he couldn't quite place, but he knew better than to underestimate the Feng Clan, especially with Feng Chen at its helm.<br/><br/>(Could it be that the Feng Clan would show something unexpected like that year?)<br/><br/>Wang Yifan thought. He was always regretful that Feng Yun had refused to join the Imperial Family.<br/><br/>Although Wang Yifan understood Feng Chen's decision and his loyalty to Feng Clan, he always thought it was a big loss for Feng Chen and the Imperial Family.<br/><br/>With the Imperial Family's resources, he thought that Feng Chen would have soared higher than he is now.<br/><br/>Wang Rouxue also observed the famous trash whose name has been spreading since his divorce from Ling Meiyu, Feng Yun.<br/><br/>(Unlike rumor, Feng Yun doesn't seem to be cowardly or weak. Could it be that he was hiding his strength?)<br/><br/>Wang Rouxue thought to herself. She wasn't under any pressure to win as their clan didn't need to do that.<br/><br/>However, she was indeed curious about Feng Yun, the alleged ex-fiancee of one of the biggest stars of Azure Sky Empire, Ling Meiyu.<br/><br/>As the Feng Clan took their seats, the atmosphere in the arena grew tense.<br/><br/>It was clear that no one had anticipated this turn of events, and the speculation among the crowd only intensified.<br/><br/>Feng Chen, standing tall and unyielding, looked across the arena at the other families. His gaze was calm, almost indifferent, but there was a subtle excitement in his eyes.<br/><br/>[ Quest: Lead the Feng Clan to Victory in the Annual Genius Competition of Misty Vale City! Rewards: 30,000 System Points. ]<br/><br/>Feng Chen was very excited as his System Points were running out faster than he anticipated while having not many ways to earn it.<br/><br/>Fortunately, he triggered a quest that gave 30,000 System Points if Feng Clan could achieve victory in this competition. That's why he was in a very good mood.<br/><br/>As the sun reached its zenith, casting a golden light over the arena, the competition<br/><br/>announcer stepped forward to begin the proceedings.<br/><br/>\"Welcome, one and all, to the Annual Genius Competition of Misty Vale City!\"<br/><br/>The announcer's voice boomed across the field, filled with energy and excitement.<br/><br/>\"Today, we will witness the might of our city's greatest young talents!\"<br/><br/>The crowd erupted into cheers, their anticipation reaching a fever pitch.<br/><br/>The announcer continued, \"First, we shall select twenty participants from clans other than the Five Major Families.\"<br/><br/>As usual, the initial rounds featured competitors from other clans and families, who would compete to select twenty participants.<br/><br/>Afterward, the participants from major families would join the competition along with these<br/><br/>twenty.<br/><br/>Though it might seem advantageous for the five major families, the format actually benefits the other clans by giving them a chance to showcase their talents.<br/><br/>Typically, participants from the major families are much stronger than those from other clans. If the major families competed from the start, it would limit the opportunities for other clans and independent cultivators to show off.<br/><br/>This format was agreed upon by everyone and isn't subject to change unless a collective<br/><br/>decision is made.<br/><br/>The atmosphere buzzed with excitement as the first round was set to begin!<br/><br/>As the first match was announced, the crowd erupted in whispers and murmurs as young geniuses stepped onto the stage.<br/><br/>\"That's Yu of the Huang family, the son of the Huang family head. At the age of twenty, he's already at the Mid-Level of Foundation Establishment Stage! He could very well turn into Grand Qi Condensation in the future!\"<br/><br/>\"No wonder he has such an aura! So he's the son of the Huang Family Lord!\"<br/><br/>The crowd discussed as the participants got down to the stage with Huang Yu catching the<br/><br/>most eyes.<br/><br/>Huang Family was the first-rated Clan just below the Five Major Clan. Their family lord was at the peak of the Core Formation Stage, just on the verge of breaking through Grand Qi<br/><br/>Condensation.<br/><br/>If he did, the Huang Family might very well be able to compete with Five Major Families in<br/><br/>the future.<br/><br/>In any case, his son caught the eyes of many people since reaching the Mid-Level Foundation Establishment Stage is something that only the Five Major Family's descendants were able to<br/><br/>reach.<br/><br/>The crowd's excitement grew as they observed Huang Yu, his presence commanding attention S~eaʀᴄh the NôvelFire.nёt website on Google to access chapters of novels early and in the highest quality.<br/><br/>on the stage.<br/><br/>Along with him were other promising youth who earned quite a bit of fame with their feat,<br/><br/>though none of them compared to Huang Yu.<br/><br/>The preliminary stage consisted of 20 rounds, with winners advancing to the main event. With nearly 100 participants this year, each round featured 5 competitors.<br/><br/>After a lengthy process, the preliminary rounds concluded, and 20 participants were chosen.<br/><br/>The strongest of them was Huang Yu with his Mid-Level Foundation Establishment Stage while the weakest was at the peak of Qi Gathering Stage.<br/><br/>As the last of the preliminary matches concluded, the anticipation in the arena reached its<br/><br/>peak.<br/><br/>The announcer's voice rang out once more, energizing the crowd. \"The preliminary rounds have showcased the remarkable talents of our city's finest. Now, prepare yourselves for the main event of the Annual Genius Competition!\"<br/><br/>Excitement rippled through the audience as they eagerly awaited the clash of the most<br/><br/>powerful young cultivators.<br/><br/>The stage was set for the real competition to start, and the arena buzzed with excitement, marking the beginning of the clash between the top geniuses!\t\t\t\t\t\t</div>", "images": {}, "success": true}