{"id": 17, "url": "https://www.novelhall.com/my-brothers-the-protagonist-good-thing-i-awakened-my-system-33973/14946561.html", "title": "Chapter 17: Feng Clan'S Power", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 17: Feng Clan'S Power</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 17: Feng Clan's PowerHuang Yu's confidence wavered. He gritted his teeth, unwilling to back down.<br/><br/>\"Even if you've hidden your strength, so what? It won't change the outcome. I'll still defeat you!\"<br/><br/>He surged forward with determination, his sword slashing through the air with incredible speed and precision.<br/><br/>But this time, Feng Yun didn't just dodge-he countered.<br/><br/>CLANG!<br/><br/>The sound of their swords clashing rang out across the arena.<br/><br/>In that clash, Huang Yu was pushed back more than 5 meters while Feng Yun stood in his initial position.<br/><br/>Seeing this, the crowd was shocked!<br/><br/>Not only did he reach the Mid-Level Foundation Establishment Stage, but he also had greater strength than Huang Yu.<br/><br/>Who could have thought that the 'Trash' of Feng Clan would be hiding such strength?<br/><br/>Huang Yu gritted his teeth and once again started to attack Feng Yu with all his might. He even used his most powerful technique, however, he was unable to make Feng Yu move from his initial position.<br/><br/>\"How is this possible?\"<br/><br/>Huang Yu muttered under his breath, sweat beading on his forehead.<br/><br/>\"I'm one of the strongest of the younger generation... I can't lose here!\"<br/><br/>But the truth was undeniable. Feng Yun's strength was overwhelming, and it was clear to everyone watching that the tides had turned. The so-called \"trash\" was anything but.<br/><br/>Huang Yu was getting weaker and weaker while Feng Yun had yet to do any attack. It was obvious that Huang Yu would be exhausted before Feng Yun if he continued like this.<br/><br/>\"I think this is enough! Earth Shattering Palm!\"<br/><br/>Feng Yun's strike came like a flash of lightning, leaving Huang Yu unable to react, Feng Yun had struck his abdomen.<br/><br/>Huang Yu's sword flew from his hand, clattering to the ground several feet away while he, himself collapsed on the ground.<br/><br/>The referee, who had been watching the battle with wide eyes, quickly stepped forward.<br/><br/>\"The winner of the first match... Feng Yun of the Feng Clan!\"<br/><br/>The arena erupted into cheers and applause, the crowd's earlier skepticism now replaced with admiration and respect.<br/><br/>\"Feng Yun! Feng Yun!\"<br/><br/>\"What did I say, Feng Chen's brother couldn't be trash!\"<br/><br/>\"Liar! When did you say that?\"<br/><br/>\"Feng Yun! Feng Yun!\"<br/><br/>The chant grew louder and louder as more spectators joined in, their voices blending into a single, unified roar of support.<br/><br/>The Feng Clan's members, who had remained composed and confident throughout the battle, now allowed themselves to smile and cheer for their clan member's victory.<br/><br/>Unlike others, they already knew Feng Yun's strength. They were also shocked when they first witnessed Feng Yun's power.<br/><br/>He was growing unbelievably after the annulment of his engagement. Everybody believed that Feng Yun had awakened his latent talent but still didn't think much of it.<br/><br/>However, it was when the selection of Feng Clan's participants came. Feng Yun shocked everybody, not only with his Early-Level Foundation Establishment Stage but also defeating their strongest person, Feng Liang.<br/><br/>As the cheers continued to echo through the arena, Feng Yun stood at the center of it all, calm and composed.<br/><br/>(16 years! It has been 16 years!)<br/><br/>Feng Yun was mocked for 16 years because of low cultivation speed. It also allowed the other clans to humiliate Feng Clan including his own fiancee coming to break off the marriage at his brother's birthday.<br/><br/>But now, it is going to be a different story!<br/><br/>Feng Yun looked up toward the stands, where his brother Feng Chen stood, watching him with a mixture of pride and emotion.<br/><br/>The two brothers locked eyes, and for a moment, the noise of the crowd seemed to fade away, leaving only the bond between them.<br/><br/>Feng Yun clenched his fist, his heart swelling with determination.<br/><br/>He had waited for this moment, endured years of ridicule, and now, he was finally proving himself-not just to the world, but to the brother who had always believed in him.<br/><br/>Feng Yun was always encouraged by Feng Chen and his words. Feng Chen would also say something like he has a main character template or something which Feng Yun considered it as some nonsense that his brother always spouts.<br/><br/>In any case, Feng Yun has never stopped practicing even with the ridicule of many, not because he wants to prove them wrong but to prove his brother right.<br/><br/>\"Brother, this is only the beginning. I will win every battle that comes my way. The Feng Clan will rise again, and I'll make sure of it!\"<br/><br/>Feng Chen's gaze softened, a proud smile tugging at the corners of his lips.<br/><br/>(This brat, doing something like a Main Character!)<br/><br/>Feng Chen thought.<br/><br/>Feng Chen graze then turned serious as he looked at the Other Major Families stand. After this match, it was guaranteed that they would be wary of Feng Yun.<br/><br/>It is okay if they were only wary but Feng Chen feared that they might take some drastic action against his brother.<br/><br/>Huang Family who had previously been full of confidence, was shattered by Feng Yun's overwhelming strength.<br/><br/>The once-smug expressions on the faces of Huang Yu's supporters had turned to looks of<br/><br/>disbelief.<br/><br/>The Huang Family thought that even though winning the competition might not be easy, getting to the Top-5 was no problem for younger master Huang Yu. But he was eliminated in the first match of the main event.<br/><br/>Other Huang participants weren't very strong and they were extremely weak to even get into<br/><br/>the Top 16.<br/><br/>Huang Clan's plan to earn prestige in the Annual Genius Competition has been destroyed by<br/><br/>Feng Yun.<br/><br/>The competition continued after that big upset.<br/><br/>Competitors fought and most of the Major Families participants won including the Feng Clan.<br/><br/>Feng Clan members won with an overwhelming difference, especially Feng Mei. Although her opponent was in the Early-Level Foundation Establishment Stage, she casually defeated her in one move.<br/><br/>\"T-This... Feng Clan is so strong!\" Searᴄh the Nôvel(F)ire.ηet website on Google to access chapters of novels early and in the highest quality.<br/><br/>\"I can't believe this! The weakest of the Five Major Families has so many strong juniors!\"<br/><br/>\"What weakest? I believe they are the strongest! Feng Clan might win this year's<br/><br/>competition.\"<br/><br/>\"Humph! They are strong alright. However, younger master Zhao Tianming is invincible!\"<br/><br/>The participants from the Feng Clan were indeed overwhelmingly powerful. Although none of their opponents were at Huang Yu's level, they still won their matches almost immediately. However, it was also the same for the aces of other Major Families. Zhao Tianming and Yan Zhihao had also won their match in a single move.<br/><br/>As the competition narrowed to the strongest contenders, the tension in the arena grew palpable, and a single question hung in the air: Who would emerge as the true champion of the Annual Genius Competition?\t\t\t\t\t\t</div>", "images": {}, "success": true}