{"id": 25, "url": "https://www.novelhall.com/my-brothers-the-protagonist-good-thing-i-awakened-my-system-33973/14946569.html", "title": "Chapter 25: Preparing For The Storm!", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 25: Preparing For The Storm!</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 25: Preparing For The Storm!Back at the Feng Residence, the atmosphere was electric with celebration. The grand hall, adorned with ornate decorations and bathed in warm light, was filled with the sound of laughter, clinking glasses, and joyous chatter.<br/><br/>The servants bustled around, ensuring that everyone had enough food and drink, while the elders of the Feng Clan sat at the head table, their expressions a mix of pride and relief.<br/><br/>Feng Yun, who had won the Annual Genius Competition, was at the center of it all.<br/><br/>\"Second Young Master, you've brought honor to our family!\"<br/><br/>\"We knew you had it in you, Young Master Feng Yun!\"<br/><br/>\"With you and Family Head leading us, the Feng Clan is destined for greatness!\"<br/><br/>Feng Yun accepted their praise with humility.<br/><br/>\"Yun'er, you've made us all proud today.\"<br/><br/>Feng Chen said, his voice filled with genuine warmth.<br/><br/>\"You've shown everyone what it means to be a true member of the Feng Clan.\"<br/><br/>Feng Yun looked up at his brother, his eyes filled with respect and gratitude.<br/><br/>\"I wouldn't have been able to do it without your support, brother. Without you, we wouldn't be where we are!\"<br/><br/>Feng Yun said as others nodded their heads. Although Feng Yun and others were the ones who brought glory to their clan, they knew that it was all thanks to Feng Chen.<br/><br/>Feng Chen chuckled and ruffled Feng Yun's hair, a rare act of brotherly teasing that caused Feng Yun to smile more openly than he had all day. seaʀᴄh thё Novёlƒire.n(e)t website on Google to access chapters of novels early and in the highest quality.<br/><br/>\"And I always will, Yun!\"<br/><br/>Feng Chen said as he went to other participants to compliment them. They also did exceptionally well and gained a lot of fame for their family.<br/><br/>Feng Mei, Feng Liang, Feng Jianhong, and Feng Xiaoyu were all very happy to be praised by Feng Chen.<br/><br/>In the Feng Clan, Feng Chen was more than a leader-he was an idol, admired and respected by all. For younger members like Feng Mei, Feng Liang, Feng Jianhong, and Feng Xiaoyu, being praised by him was a rare honor, even more valuable than winning the Annual Genius Competition.<br/><br/>To them, his recognition was a greater prize than any trophy, marking them as worthy in the eyes of someone they revered above all others.<br/><br/>\"Haha! Yun'er, you've made us proud. You have surpassed my expectations!\"<br/><br/>\"I've always known that my Yun'er was a dragon among dragons!\"<br/><br/>Suddenly a group of elders entered the banquet. They were all smiling happily as they praised Feng Yun.<br/><br/>\"Granduncle! Grandaunties! You've come out of seclusion?\"<br/><br/>Feng Yun called out in surprise and joy as he rushed toward the group of elders who had just entered the banquet.<br/><br/>The ones who came were the granduncle and grand aunties of Feng Chen and Feng Yun. Their actual grandparents had died before they were born but they had never felt their absences as other grand uncles and aunties showered them with affection.<br/><br/>Usually, they were in seclusion most of the time, trying to break through and that's why Feng Yun was surprised that they had shown up at this banquet.<br/><br/>\"Haha! Naturally, we had to come and celebrate such a joyous occasion.\"<br/><br/>Feng Zhenshan said with a warm smile. He reached into his robe and pulled out a collection of spirit fruit candies, handing them to Feng Yun.<br/><br/>\"Chen'er has also called us here to discuss some important matters regarding the clan's future.\"<br/><br/>Feng Zhenshan added.<br/><br/>Feng Chen, stepping forward with a smile, added, \"Yes, I did call them here to discuss something important. But before we dive into that, let's fully enjoy the celebration!\"<br/><br/>The hall erupted into a chorus of cheers and applause as the elders joined the festivities. The atmosphere was filled with an infectious sense of joy and camaraderie.<br/><br/>In one corner of the grand hall, a group of musicians played lively tunes on traditional instruments, their melodies adding to the festive ambiance.<br/><br/>The rhythmic beat of drums and the sweet strains of flutes intermingled with the sounds of laughter and conversation.<br/><br/>During the celebration, the atmosphere was filled with lively conversations about the Annual Genius Competition.<br/><br/>\"Did you see their faces?\" Feng Jianhong chuckled as he remembered the faces of those younger generations of the other major families who most looked down on them previously.<br/><br/>\"I almost felt sorry for them.\"<br/><br/>The crowd burst into hearty laughter, their previous concerns and frustrations melting away in the warmth of the festive atmosphere.<br/><br/>Usually, the atmosphere of the Feng Clan after the Annual Genius Competition would be gloomy as they always come last compared to other Major Families. However, it was the other way around this year.<br/><br/>The victory had turned the tables, and it was now they who were the ones celebrating, while the others were left to reflect on their defeat.<br/><br/>\"Absolutely!\" another person chimed in. \"For once, we didn't have to return home feeling defeated. This time, it's them who have to deal with the embarrassment.\"<br/><br/>The laughter and cheer grew louder as they reveled in their triumph.<br/><br/>The mood was buoyant and filled with a sense of vindication, a stark contrast to the gloom they had often felt after previous defeats.<br/><br/>As the night wore on, Feng Chen raised his cup, signaling for silence. The room quieted down as all eyes turned toward him.<br/><br/>\"Today, we celebrate not just Feng Yun's victory, but the strength and unity of our clan,\" Feng Chen began, his voice carrying the weight of his authority.<br/><br/>\"We have faced many challenges, but we have always emerged stronger. Let today be a reminder that no matter how hard others try to bring us down will rise above. To the Feng Clan!\"<br/><br/>\"To the Feng Clan!\"<br/><br/>Everyone echoed, raising their cups in unison.<br/><br/>The celebration continued with laughter and music, but as the festivities carried on, Feng Chen and the Grand Elders stepped aside for a more serious discussion.<br/><br/>\"So, Chen'er, what was the reason for calling us here?\"<br/><br/>Feng Zhilan, Feng Chen's grandaunt asked.<br/><br/>\"Today, we have shown the potential that our Feng Clan possesses. The Major Family would definitely not like this and must be scheming something against us.\"<br/><br/>Feng Chen answered.<br/><br/>\"Hmph! Those bastards are always against our Feng Clan.\"<br/><br/>Feng Liwei, one of the granduncles of Feng Chen said angrily.<br/><br/>\"Let them scheme all they want. Whatever they plan, they won't be able to shake the Feng<br/><br/>Clan.\"<br/><br/>Feng Zhenshan nodded, her expression calm.<br/><br/>\"Indeed, they underestimate us, as they always have. But our powers are far beyond what they<br/><br/>used to be.\"<br/><br/>Feng Liwei smirked, folding his arms.<br/><br/>\"Grand Qi Condensation Realm! They won't know what hit them if they dare to provoke us.\"<br/><br/>Feng Liwei and others were confident their Clan could withstand any attack from the other Major Clan because they had recently broken through to the Grand Qi Condensation Realm. Feng Chen didn't spare any effort and had made everyone of Feng Clan become stronger especially his Grandaunts and Granduncles who were the closest to achieving the Grand Qi Condensation Realm.<br/><br/>He wanted to complete his mission which was to make Feng Clan, the strongest in Misty Vale City by having at least 5 Grand Qi Condensation Realm and 30 Core Formation Stage in Feng<br/><br/>Clan as quickly as possible.<br/><br/>He has already completed the first part which was to get at least 5 Grand Qi Condensation Realms. All his six Grandaunt and Granduncles have broken through, leading to the Feng Clan having 6 Grand Qi Condensation Realm.<br/><br/>The second part was also on the verge of completion and Feng Chen knew that he would be able to reap his investment in a few days.<br/><br/>This is one of the reasons why the Grand Elders have unwavering confidence that they can defend the Feng Clan against any external threat.<br/><br/>Another reason is that Feng Chen has shown his Three Elements Divine Realm Cultivation which is the highest in Misty Vale City.<br/><br/>This meant that no matter what the other Major Family tried to do, Feng Clan was invincible<br/><br/>in Misty Vale City.<br/><br/>\"It's almost laughable. They believe they can defeat us, unaware of how much we've grown<br/><br/>and evolved in these past weeks.\"<br/><br/>Feng Liancheng added with a chuckle.<br/><br/>Feng Chen's smile faded slightly as he continued, his tone becoming more serious.<br/><br/>\"Although I'm not worried about an open confrontation, I suspect the other Major Families might resort to underhanded tactics before any direct conflict.\"<br/><br/>Feng Zhilan's eyes narrowed. \"You think they'll try something in the shadows?<br/><br/>Assassinations, sabotage, perhaps?\"<br/><br/>\"Precisely,\" Feng Chen replied.<br/><br/>\"They're likely to target our resources, our younger generation, or even try to turn other<br/><br/>families against us. I've called you all here because I need your help in defending against such<br/><br/>tactics.\"<br/><br/>Feng Liancheng nodded, his expression serious now.<br/><br/>Feng Liwei leaned forward, his eyes gleaming with determination.<br/><br/>\"We should tighten security around our territory and keep a close eye on the movements of<br/><br/>the other clans. If they make even the slightest wrong move, we'll be ready.\"<br/><br/>Feng Chen nodded approvingly.<br/><br/>\"I'm counting on all of you to help safeguard the Feng Clan's territory. If they try to scheme against our family, that will be enough reason for us to crush them.\"<br/><br/>Feng Chen smiled again, this time with a bit of killing intent. While he hoped his enemies<br/><br/>would control themselves to avoid such measures, he was prepared to show no mercy if they<br/><br/>dared to provoke him.<br/><br/>The elders nodded in agreement. They knew that with Feng Chen leading the Feng Clan, it wouldn't be long before the clan rose to even greater heights.\t\t\t\t\t\t</div>", "images": {}, "success": true}