{"id": 29, "url": "https://www.novelhall.com/my-brothers-the-protagonist-good-thing-i-awakened-my-system-33973/14946573.html", "title": "Chapter 29: Ethereal Frost Flame", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 29: Ethereal Frost Flame</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 29: Ethereal Frost FlameAfter a while, Feng Chen requested everyone to leave as he had something to talk to Feng Yun.<br/><br/>As it was Feng Chen who asked, there was no questioning and they, including the alchemist, all left the Alchemy room as quickly as they could.<br/><br/>\"Brother, do you need me to do something?\"<br/><br/>Feng Yun asked confusedly.<br/><br/>Feng Chen's eyes held a mysterious glint as he spoke.<br/><br/>\"Yun'er, I have something I want to give you.\"<br/><br/>???<br/><br/>Feng Yun blinked in surprise. He didn't know what his brother wanted to give him to ask others to leave.<br/><br/>\"I didn't give you anything for winning the Annual Genius Competition and since you are an alchemist, this gift might just be perfect.\"<br/><br/>With those words, Feng Chen reached into his Storage Ring. As he did, a subtle shift in the atmosphere occurred.<br/><br/>The temperature in the room seemed to drop slightly, and a faint pressure began to build in the air, causing Feng Yun to instinctively tense.<br/><br/>Slowly, Feng Chen withdrew his hand, revealing a small, ornate box. The box itself was unassuming, but as it opened, the temperature plummeted further.<br/><br/>Inside the box was a small, flickering light, almost like a delicate flame, but there was something different about it-something dangerous and powerful.<br/><br/>Feng Yun's eyes widened as the flickering light seemed to pulse with life.<br/><br/>His breath hitched, and before he could say anything, a voice echoed within his mind, which sounded shocked.<br/><br/>(T-This... Do you realize what your brother is holding?) S~eaʀᴄh the NôᴠeFire.ηet website on Google to access chapters of novels early and in the highest quality.<br/><br/>Master Minghao asked in a surprised tone.<br/><br/>Feng Yun was surprised to see Master Minghao react like this.<br/><br/>Previously, no matter what kind of treasure including the Heaven Grade Technique was shown, Master Minghao would stay uninterested.<br/><br/>Now seeing him react like this, Feng Yun knew that his brother had shown something extraordinary.<br/><br/>Feng Yun thought for a bit before answering, \"Could it be Spirit Flame? The one you want me to obtain?\"<br/><br/>Master Minghao had previously said that to advance his alchemy, he would need a flame, preferably a Spirit Flame.<br/><br/>Thinking about it, Feng Yun couldn't help but become excited and happy about this gift.<br/><br/>Master Minghao shook his head as he answered.<br/><br/>(That's no Spirit Flame. That's the Ethereal Frost Flame-one of the Mystical Flames!)<br/><br/>Master Minghao said as he regained his composure.<br/><br/>He looked at Feng Chen who was calm as he held Ethereal Frost Flame.<br/><br/>Master Minghao couldn't comprehend how some boy from such a remote area was able to acquire such a rare and precious treasure.<br/><br/>In this world, there were countless types of flames, each with its own unique properties and uses, but only a select few were considered truly extraordinary.<br/><br/>These flames were categorized into ranks based on their power, rarity, and the benefits they could provide to an alchemist.<br/><br/>The higher the rank, the more difficult it was to find, control, and master these flames, but the rewards were immense.<br/><br/>Starting with the lowest was Mortal Flames and these flames, and almost every alchemist has them.<br/><br/>As long as you were an Alchemist, you could easily afford to buy such flames.<br/><br/>Next on the ranks are the Spirit Flames which can be considered a treasure comparable to Top Heavenly treasures. Those who possess them could be counted on one hand in the whole Azure Sky Empire.<br/><br/>The next one on the ranking was Mythical Flames, the one in front of them. These flames are what every high-ranking alchemist including Seventh and Eighth Grade Alchemist would try to get their hands on.<br/><br/>And finally, the most precious of all-the Heavenly Flames. It is said that only twelve exist in the entire world, each being extremely powerful. These flames are so rare and powerful that only the most exceptional alchemists can ever hope to acquire one and control it. Throughout history, those who have possessed a Heavenly Flame have left their mark on the world, becoming legendary figures in the annals of time.<br/><br/>Only those who wield a Heavenly Flame can truly reach the pinnacle of alchemy and be recognized as the greatest of all.<br/><br/>(How could it be possible for Feng Chen to have this? Even I struggled to get a Mythical Flame, not to mention a boy in Nascent Soul Realm?)<br/><br/>Master Minghao thought to himself. It isn't every day that he gets surprised since he has seen almost everything that this world has to offer.<br/><br/>However, Feng Chen was able to surprise him, which was extremely rare.<br/><br/>(Firstly, those pills and now this Mythical Flame, could Feng Chen have obtained some inheritance from a Grade Eighth Alchemist? But I have not heard of any Eighth or Seventh Alchemist being perished in the Azure Sky Empire.)<br/><br/>Master Minghao tried to find out how Feng Chen might have gotten these treasures and the most plausible answer was that Feng Chen discovered a tomb of a Seventh or Eighth Grade<br/><br/>Alchemist.<br/><br/>Feng Yun stared at the flickering light within the ornate box, his heart pounding with a mix of awe and disbelief.<br/><br/>The Ethereal Frost Flame, one of the rare Mystical Flames, was now in his presence- something he never imagined he would encounter so soon in his life.<br/><br/>Feng Chen closed the box carefully, containing the chilling aura that had spread throughout<br/><br/>the room.<br/><br/>He looked at Feng Yun with a teasing expression, as he said.<br/><br/>\"Yun'er, do you know what this is?\"<br/><br/>\"This... Is it really the Ethereal Frost Flame?\"<br/><br/>Feng Yun asked.<br/><br/>Feng Chen chuckled softly, nodding.<br/><br/>\"That's right!\"<br/><br/>Feng Yun's eyes widened further.<br/><br/>\"But, brother... How did you come to possess such a thing?\"<br/><br/>\"You can say that this brother of yours spent quite a bit of resources to get this!\"<br/><br/>Feng Chen answered which was vague but at the same time, true.<br/><br/>He spent 50,000 System Points on this Mythical Flame. He even searched for a greater ranked Flame which was Heavenly Flame, however, even the cheapest one cost millions which<br/><br/>prompted him to give up.<br/><br/>And this Mythical Flame was also only purchased by Feng Chen because it was 50% off at the discounted store. Otherwise, he wouldn't have dare wasted so much System Point. \"Anyways, what matters now is that you have the chance to harness this flame. With it, you can achieve great things as an alchemist!\"<br/><br/>Feng Yun stared at the box, his thoughts racing. The Ethereal Frost Flame, a treasure of unimaginable value, was now being offered to him by his brother.<br/><br/>\"Brother,\" Feng Yun began hesitantly, \"this flame... It's incredibly valuable. It could benefit you more than me. You're stronger-maybe you should keep it.\"<br/><br/>Feng Chen smiled warmly, shaking his head.<br/><br/>\"Yun'er, you're the one with the talent for alchemy. This flame will serve you far better than it<br/><br/>would me.\"<br/><br/>Before Feng Yun could voice any further protest, Master Minghao's voice echoed in his mind, this time with a tone of urgency.<br/><br/>(Feng Yun, you must accept this gift. Your brother is right; this flame will benefit you more<br/><br/>than him, and with it, your alchemy could become a cornerstone of your clan's strength. By using this flame, you'll not only elevate yourself but also bring immense benefits to your<br/><br/>entire clan.)<br/><br/>Master Minghao's words were firm, leaving no room for doubt.<br/><br/>Feng Yun's hesitation melted away as he realized the truth in Master Minghao's advice.<br/><br/>His brother had gone to great lengths to obtain this flame, and refusing it would be an insult<br/><br/>to his brother's intentions.<br/><br/>What he could do is to repay this favor in the future!<br/><br/>Taking a deep breath, Feng Yun nodded.<br/><br/>\"Thank you, brother. I will not disappoint you!\"<br/><br/>Feng Chen's smile widened.<br/><br/>\"That's what I like to hear, Yun'er. With this flame, I'm sure you'll surpass even the greatest<br/><br/>alchemists in the future!\"\t\t\t\t\t\t</div>", "images": {}, "success": true}