{"id": 28, "url": "https://www.novelhall.com/my-brothers-the-protagonist-good-thing-i-awakened-my-system-33973/14946572.html", "title": "Chapter 28: Feng Yun'S Alchemy Skill", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 28: Feng Yun'S Alchemy Skill</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 28: Feng Yun's Alchemy SkillAs they entered the Alchemist Room, the familiar scent of herbs and various medicinal ingredients filled the air.<br/><br/>The room was bustling with activity as a few alchemists worked diligently at their stations, their concentration evident in their focused expressions.<br/><br/>Upon seeing the arrival of the clan elders and Feng Chen, one of the senior alchemists, Elder Ping, quickly approached them.<br/><br/>His face was marked by a look of nervousness, and he bowed deeply as he greeted them. \"E-Elders, Family Head Feng Chen,\" Elder Ping said, his voice trembling slightly.<br/><br/>\"I-I apologize for the inconvenience. We've been aware of the current crisis and have been working tirelessly to address the situation. However, our current capabilities are limited. I sincerely regret that we haven't been able to contribute more effectively.\"<br/><br/>Feng Chen nodded, his expression calm but resolute.<br/><br/>\"No need to apologize, Elder Ping. We're here to see if our younger brother, Feng Yun, can indeed help us turn this situation around. Please, make way.\"<br/><br/>Elder Ping stepped aside with a respectful nod, and Feng Yun, accompanied by the clan elders, moved to the central area of the room.<br/><br/>The other alchemists glanced up from their work, curiosity, and apprehension evident in their eyes as they wanted to know why they had come.<br/><br/>The elders took their places, watching intently as Feng Yun prepared himself to refine a pill.<br/><br/>Feng Yun approached the alchemy furnace, his movements steady and confident. He began by laying out the ingredients, each one carefully selected for the Rank-1 pill he intended to refine.<br/><br/>At the moment, there wasn't a stock of Rank-2 pill's ingredient in Feng Clan but it wasn't necessary for him to refine the Rank-2 pill.<br/><br/>It was enough for Feng Yun to show that he was indeed an alchemist to gain their trust. As for the pill that Feng Yun was going to refine, it was the highest quality of the Rank-1 pill which is the most difficult and precious recipe of the Feng Clan, Energy Infusion Pill.<br/><br/>This pill could instantly restore almost 20 percent of Qi which is a great pill to have especially for long extended fights. It was almost always sold out because of how great the effect was.<br/><br/>However, because there were only two alchemists in the entire Feng Clan who could refine this pill, there was a limited supply.<br/><br/>The elders watched in silence, their eyes never leaving Feng Yun's hands.<br/><br/>With a deep breath, Feng Yun started the process. He activated the furnace, controlling the heat with practiced precision.<br/><br/>\"Second young master is refining a pill?\"<br/><br/>\"Seems like it!\"<br/><br/>\"When did he learn? Or is he just trying his luck?\"<br/><br/>\"Maybe? But I can see that the Second Young Master has pretty good control over the fire. Damn! He is even better than me.\"<br/><br/>Other Alchemists have also stopped working and joined the Elders to watch Feng Yun refine a pill.<br/><br/>Minutes passed, feeling like hours as the tension in the room mounted. Finally, after what felt like an eternity, Feng Yun completed the final step.<br/><br/>~HISS!<br/><br/>The furnace hissed as he extinguished the flames, and a faint glow emanated from within. Feng Yun carefully opened the furnace, revealing a batch of perfectly formed Energy Infusion Pills.<br/><br/>\"Here are the Energy Infusion Pills I have refined. Please feel free to examine their quality.\"<br/><br/>Feng Yun said as he handed the pill to Elder Wei.<br/><br/>The elders leaned in, their eyes wide with astonishment.<br/><br/>Elder Wei checked the pills for a while and was surprised to see that their quality seemed to surpass even those pills made by Elder Ping.<br/><br/>He wasn't certain whether it really was, so he handed the pills to Elder Ping.<br/><br/>\"Elder Ping, what do you think about the pills Yun'er refined?\"<br/><br/>Elder Wei asked. As the head of Feng Clan Alchemy, Elder Ping was more qualified to be a judge than Elder Wei.<br/><br/>Elder Ping checked for a second before he was stunned.<br/><br/>\"Incredible... Second Young Master, you really did it. These are genuine Energy Infusion Pills and their quality is even higher than mine!\"<br/><br/>Elder Ping said, which sent a shockwave to the other Alchemist and Elders.<br/><br/>Elder Ping has the most skill in alchemy in the Feng Clan, so if he said that Feng Yun pills were better than his, then it was probably true.<br/><br/>\"It seems like we underestimated Yun'er! Not only is he a genius at cultivation but he is also one in alchemy.\"<br/><br/>Elder Jinhai said excitedly. A 16-year-old who is not only strong enough to defeat the Core Formation Stage but also an alchemist?<br/><br/>In the entire Azure Sky Empire, he didn't think there was another one apart from Feng Yun.<br/><br/>The elders, now fully convinced, began discussing strategies to utilize Feng Yun's newfound abilities to regain their position in the market.<br/><br/>\"Hehe! I can't wait to see those Yan Clan's faces when they realize that we also have Second Grade Alchemists!\"<br/><br/>\"They would probably be envious when they found out that Yun'er who defeated their genius is also a genius Alchemist.\"<br/><br/>The mood in the room had shifted dramatically-from one of despair to one of excitement.<br/><br/>\"Ahem! Elders, I know you all are excited about Yun's abilities. However, before we start discussing our counterattack, we need to discuss how to gather the ingredients needed to refine Rank-2 pills.\"<br/><br/>Feng Chen interrupted the Elders who were happily discussing how to take revenge on the Yan Sёarch* The nôᴠel Fire.nёt website on Google to access chapters of novels early and in the highest quality.<br/><br/>Clan.<br/><br/>\"Haha! Sorry! Sorry! I was just excited about Yun'er's extraordinary abilities. That's all!\"<br/><br/>\"Me too! How can we forget that we have yet to collect the Rank-2 pill's ingredients?\" Elders said embarrassingly. They were so happy and excited that they forgot to maintain their demeanor.<br/><br/>\"I checked the market yesterday and most of the Rank-2 pill's ingredients were out of stock. Now, I know the reason why. Yan Clan should have purchased almost all of the ingredients for<br/><br/>the Rank-2 pill in Misty Vale City.\"<br/><br/>Feng Yun said in frustration.<br/><br/>Hearing this news, the mood of the elders has also gone down. It seems like their dream of counterattacking needs to be kept on hold for a few more days.<br/><br/>\"Oh! It looks like the Yan Family had already made their moves before we realized it. Nonetheless, we don't need to worry too much about it. At most, it could only delay our<br/><br/>plans.\"<br/><br/>Feng Chen said nonchalantly.<br/><br/>It didn't matter to him that the Yan Family could take advantage of the current market situation for a few more days because after that would be the start of their despair.<br/><br/>\"Elder Ping, Send out people to purchase all the ingredients that Yun'er needs. You can use all<br/><br/>of the money in this storage ring.\"<br/><br/>Feng Chen said as he handed over the money that Yan Zhan had given him. With that much money, it should be enough to buy hundreds or thousands worth of Rank-2 pill ingredients.<br/><br/>\"Understood, Family head! I'll see to it that everything is arranged promptly.\"<br/><br/>Elder Ping replied excitedly. If one were to ask who was the most excited about Feng Yun<br/><br/>being a genius Alchemist, then the answer would be Elder Feng Ping.<br/><br/>With a Second Grade Alchemist in the clan, he as an Alchemist would also be able to go further<br/><br/>in alchemy with the guidance of a better alchemist.<br/><br/>Even without guidance, just by watching an alchemist refining higher rank pills, he could get<br/><br/>some understanding which could increase his alchemy skill.<br/><br/>He couldn't wait for Feng Yun to start refining Rank-2 pills!\t\t\t\t\t\t</div>", "images": {}, "success": true}