{"id": 24, "url": "https://www.novelhall.com/my-brothers-the-protagonist-good-thing-i-awakened-my-system-33973/14946568.html", "title": "Chapter 24: A Plan Unfolds", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 24: A Plan Unfolds</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 24: A Plan UnfoldsLater that night at the Yan Family's residence.<br/><br/>Being the former strongest Clan of Misty Vale City, Yan Residence was the biggest and most luxurious in the whole of Misty Vale City.<br/><br/>Inside their mansion were Zhao Chenxi and Yan Yinjie along with their strongest elders. They had come to discuss how to take care of the Feng Clan before they got too strong.<br/><br/>\"Zhao Chenxi! Liu Yinjie! You have come!\"<br/><br/>Yan Zhan said with a smile as he entered the hall where the Zhao and Liu Families were kept.<br/><br/>\"Yan Zhan, this is an emergency. We need to take care of the Feng Clan sooner or else they would become too strong.\"<br/><br/>Zhao Chenxi said anxiously. Unlike Yan Zhan, he doesn't know how to take care of the Feng Clan who has Feng Chen at its helm.<br/><br/>Even if he gathered their strongest elders, he couldn't guarantee that he could take on Feng Chen who could defeat Elder Zhou in one move.<br/><br/>Liu Yinjie was the same.<br/><br/>\"Yes, Yan Head, we couldn't let the Feng Clan behave arrogantly.\"<br/><br/>\"We need to teach them a good lesson!\"<br/><br/>\"Many clans are trying to ally themselves with the Feng Clan after Feng Yun won the Annual Genius Competition.\"<br/><br/>\"We must do something before they get too strong!\"<br/><br/>The Elders of the two families joined as they tried to show off their determination to fight the Feng Clan.<br/><br/>However in reality, if they ever come to face Feng Chen, all their determination would get thrown out of the window.<br/><br/>\"Rest assured, everyone, the Feng Clan's downfall is certain!\"<br/><br/>Yan Zhan said confidently.<br/><br/>\"Allow me to introduce our esteemed backer, someone you all undoubtedly know-Elder Zhou!\"<br/><br/>Elder Zhou, who had been seated quietly in the shadows, now stepped forward, his presence commanding the attention of everyone in the room.<br/><br/>This sudden appearance shocked many of them as they began to bow and respectfully greeted Elder Zhou.<br/><br/>Although Elder Zhou was no longer that invincible person in their heart after getting smacked by Feng Chen, he was still the elder of the number one Sect of Azure Sky Empire and also someone in the peak Grand Qi Condensation Realm.<br/><br/>\"As Yan Head has assured, the Feng Clan will not be a threat for much longer.\"<br/><br/>Elder Zhou's voice was calm but carried an undercurrent of menace.<br/><br/>\"But Elder Zhou,\" Zhao Chenxi ventured cautiously, \"Feng Chen... he is not to be underestimated. Even you...\"<br/><br/>Elder Zhou's eyes narrowed slightly, a flicker of irritation passing across his face before he regained his composure.<br/><br/>\"Hmph! I admit that Feng Chen caught me off guard previously. However, that was a mere lapse, one that will not happen again.\"<br/><br/>\"Moreover, I have contacted my good brother to come help me this time.\"<br/><br/>Zhao Chenxi and Liu Yinjie, though still anxious, found some reassurance in Elder Zhou's words.<br/><br/>After all, if it was a brother of Elder Zhou then he must be in the Peak Grand Qi Condensation Realm.<br/><br/>Although not 100% sure that they could take on Feng Chen, it was certainly better to have such a powerful helper to deal with Feng Chen than to have none.<br/><br/>Liu Yinjie, trying to mask his lingering unease, stepped forward and asked cautiously.<br/><br/>\"Elder Zhou, if I may ask, where is this esteemed brother of yours? His presence would indeed bolster our confidence.\"<br/><br/>-BANG!<br/><br/>As if on cue, the heavy doors of the hall creaked open, and a wave of oppressive energy filled the room.<br/><br/>Everyone turned to see a tall figure, draped in a dark robe, stepping into the light. His aura was unmistakably powerful, far beyond the realm of Grand Qi Condensation Realm. \"Hehe! Allow me to introduce my elder brother,\" Elder Zhou said with a faint smile.<br/><br/>\"Zhou Tianhua, a cultivator in the Three Elements Divine Realm.\"<br/><br/>Gasps of surprise echoed through the hall as Zhou Tianhua's eyes swept over the gathered elders.<br/><br/>His mere presence was enough to command respect and instill fear. Even Zhao Chenxi and Liu Yinjie, who had been on edge, now felt a glimmer of hope.<br/><br/>\"With him by our side, what is Feng Chen? He will be dead before he can make a move!\"<br/><br/>Elder Zhou said disdainfully. He still remembers the humiliation of getting knocked out by Feng Chen just like yesterday.<br/><br/>He was humiliated and even more embarrassed when he was back to the Mystic Flame Sect. Everyone has already heard about the incident and how miserably he lost to Feng Chen.<br/><br/>The Grand Elders also heavily punished him by deducting his annual salary and having him reflect on his actions.<br/><br/>Moreover, the other Elders mocked him and made sure that he never forgot the humiliation that he received from Feng Chen.<br/><br/>Since that day, the only thing that was on his mind was to take revenge against Feng Chen.<br/><br/>Even if he had to give all his treasure, he was willing to do that just to get revenge against<br/><br/>Feng Chen.<br/><br/>With all the treasure given to Zhou Tianhua, he finally agreed to help his younger brother who wanted to eradicate the Feng Clan.<br/><br/>\"Rest assured,\" Zhou Tianhua spoke in a deep, resonant voice.<br/><br/>\"The Feng Clan will not survive for too long.\"<br/><br/>Yan Zhan's eyes gleamed with satisfaction as Elder Zhou revealed this additional support. Even he wasn't informed that Zhou Tianhua was in the Three Elements Divine Realm.<br/><br/>The elders from the Yan, Zhao, and Liu families exchanged relieved glances. The weight of their earlier anxiety seemed to lift, replaced by renewed confidence.<br/><br/>Feng Chen's power had shaken them, but now, with a Three Divine Elements Realm cultivator on their side, their fear had vanished.<br/><br/>So what if you are invincible in the Grand Qi Condensation Realm? We have the Three Elements Divine Realm on our side!<br/><br/>Moreover, there were still more than 10 people in the Grand Qi Condensation Realm with<br/><br/>many in the Core Formation Stage.<br/><br/>With smug expressions, they started to discuss their next moves, no longer worried about the<br/><br/>consequences. S~eaʀᴄh the Nôvelƒire.net website on Google to access chapters of novels early and in the highest quality.<br/><br/>In their minds, the presence of such a powerful ally meant that the Feng Clan's defeat was not just likely, but inevitable.<br/><br/>\"With Elder Zhou Tianhua on our side, the Feng Clan won't stand a chance,\" one of the Zhao elders said confidently, a smirk forming on his lips.<br/><br/>\"Indeed,\" Liu Yinjie added with a dismissive wave of his hand. \"Why should we worry about a mere Feng Clan when we have the backing of someone in the Three Divine Elements Realm?\"<br/><br/>The room filled with arrogant laughter as they reveled in the thought of their impending victory, completely certain that with such a powerful figure on their side, the Feng Clan's days were numbered.\t\t\t\t\t\t</div>", "images": {}, "success": true}