{"id": 20, "url": "https://www.novelhall.com/my-brothers-the-protagonist-good-thing-i-awakened-my-system-33973/14946564.html", "title": "Chapter 20: Zhao Tianming Vs Feng Jianhong!", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 20: Zhao Tianming Vs Feng Jianhong!</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 20: Zhao Tianming Vs Feng Jianhong!Yan Zhan's grin broadened.<br/><br/>\"Good, good! I will be betting on Yan Zhihao! And I assume that you will bet on Feng Yun?\"<br/><br/>Yan Zhan said.<br/><br/>\"Of course!\"<br/><br/>Feng Chen replied. He couldn't wait for Yan Zhan's smile to turn into a frown.<br/><br/>On the stage, Yan Zhihao and Liu Jia fought but the match wasn't very satisfactory.<br/><br/>With Liu Jia's Mid-Level Foundation Establishment Stage, he wasn't able to do much to Yan Zhihao who had cultivated of Late-Level Foundation Establishment Stage.<br/><br/>\"I-I Surrender!\"<br/><br/>Eventually, Liu Jia was unable to take Yan Zhihao's attack and surrendered.<br/><br/>\"The final match of the fourth round will be Zhao Tianming Vs Feng Jianhong!\"<br/><br/>As soon as the referee announced the final match, the crowd erupted into an excited frenzy. \"Zhao Tianming versus Feng Jianhong? This is going to be a clash of titans!\"<br/><br/>\"I've heard that Zhao Tianming has been training in seclusion for months. They say he's mastered a new Earth-Grade technique!\"<br/><br/>\"With Zhao Tianming's Peak-Level Foundation Establishment Stage, he should be able to easily win!\"<br/><br/>\"Feng Jianhong isn't an easy opponent either. He was able to easily win in his previous matches. I would like to see what he is hiding.\"<br/><br/>The crowd discussed excitedly. Many of them believed that Zhao Tianming would win, nonetheless, they knew Feng Jianhong wasn't an easy opponent.<br/><br/>Zhao Tianming stepped into the arena, his presence commanding immediate attention. His eyes were cold and focused, his posture exuding an air of supreme confidence.<br/><br/>On the opposite side, Feng Jianhong entered the arena with a calm yet powerful aura.<br/><br/>Zhao Tianming's gaze locked onto Feng Jianhong as they stood across from each other in the<br/><br/>arena.<br/><br/>The atmosphere was thick with anticipation, and the crowd buzzed with excitement, eager to witness the clash between these two formidable opponents.<br/><br/>Zhao Tianming smirked, his eyes narrowing as he sized up Feng Jianhong.<br/><br/>\"Feng Jianhong,\" he began, his voice carrying a tone of condescension, \"I'll give you one chance to back down. We both know how this is going to end.\"<br/><br/>\"Although I don't know how you manage to advance quickly to the Late-Level Foundation Establishment Stage, you are still not my match. Surrender now, and save yourself the humiliation!\"<br/><br/>Zhao Tianming and Feng Jianhong knew each other since both of them were the geniuses of their respective clan. However, compared to Zhao Tianming, Feng Jiabhong's strength was nothing previously.<br/><br/>But now, after taking the Marrow Cleansing Pill and having learned a Heaven Grade Technique, everything was about to change.<br/><br/>Feng Jianhong remained unfazed, his expression calm as he met Zhao Tianming's gaze.<br/><br/>\"I appreciate the concern, Zhao Tianming, but surrendering has never been in my nature. If you think you can intimidate me with words, you're mistaken.\"<br/><br/>Feng Jianhong replied with determination.<br/><br/>Zhao Tianming chuckled a hint of mockery in his tone.<br/><br/>\"So be it,\" he said.<br/><br/>\"Since that's the case, don't blame me for not holding back!\"<br/><br/>With a sudden burst of energy, Zhao Tianming's aura flared, his power surging as he lunged forward.<br/><br/>The air crackled with energy as he unleashed a powerful punch, his fist glowing with a golden light.<br/><br/>The speed and ferocity of his attack were overwhelming, and the crowd gasped as they saw Zhao Tianming's fist hurtling toward Feng Jianhong at incredible speed.<br/><br/>But Feng Jianhong didn't panic. With a calm and fluid motion, he sidestepped Zhao Tianming's attack, the fist barely brushing past him.<br/><br/>\"Hmph! Looks like you can dodge my attack.\"<br/><br/>Zhao Tianming sneered, not shaken by the fact that Feng Jianhong avoided his blow.<br/><br/>\"But let's see how long you can keep this up.\"<br/><br/>Without missing a beat, Zhao Tianming pressed forward, launching a series of rapid strikes, each one more powerful than the last.<br/><br/>His fists moved like a blur, and the ground beneath him trembled with each step he took.<br/><br/>Feng Jianhong remained calm, his movements precise and smooth as he dodged Zhao Tianming's relentless assault.<br/><br/>With every attack, Feng Jianhong seemed to move just in time, his body weaving through Zhao Tianming's strikes with an almost effortless grace.<br/><br/>Zhao Tianming's frustration began to show as his attacks failed to land.<br/><br/>\"You think you can just keep dodging forever?\"<br/><br/>Zhao Tianming growled, his aura flaring even more intensely.<br/><br/>\"Let's see how you handle this!\"<br/><br/>\"Thunderclap Fist!\"<br/><br/>He roared, his voice echoing through the arena as his fists crackled with electrical energy. The air around him buzzed with power as he launched himself toward Feng Jianhong with<br/><br/>blinding speed.<br/><br/>Feng Jianhong's eyes sharpened as he sensed the danger of the incoming attack.<br/><br/>But instead of retreating, he stood his ground, his aura flaring to life as he prepared to take the attack head-on.<br/><br/>He knew that Zhao Tianming's speed was something that he couldn't compete with and instead opted for defense which he was confident in.<br/><br/>\"Mysterious Heaven Iron Wall!\"<br/><br/>Heaven Grade Defense Technique that Feng Chen taught. Out of the three techniques Feng Chen had taught, Feng Jianhong chose to focus on this defense technique.<br/><br/>A shimmering, translucent barrier formed around Feng Jianhong, the energy swirling and condensing into an impenetrable wall.<br/><br/>The wall gleamed like iron under the sunlight, exuding a sense of unyielding strength.<br/><br/>-BOOM!<br/><br/>Zhao Tianming's Thunderclap Fist collided with the Mysterious Heaven Iron Wall, and the arena erupted with a deafening boom.<br/><br/>Sparks flew, and a shockwave rippled outward, causing the crowd to shield their eyes from the<br/><br/>blinding light.<br/><br/>But as the dust settled, it became clear that the Mysterious Heaven Iron Wall had held firm.<br/><br/>\"Look!\"<br/><br/>\"Feng Jianhong! Feng Jianhong is still standing.\"<br/><br/>\"WOW! Feng Jianhong is able to take on Zhao Tianming Thunderclap Fist.\"<br/><br/>\"Looks like Feng Jianhong cannot be underestimated.\"<br/><br/>The powerful attack had been absorbed and dissipated, leaving Feng Jianhong untouched<br/><br/>within his protective barrier.<br/><br/>Zhao Tianming's eyes narrowed in frustration.<br/><br/>\"Hmph! So you can block my attack.\"<br/><br/>Zhao Tianming said, his voice tinged with agitation but trying to hide it.<br/><br/>Feng Jianhong lowered the barrier, his calm demeanor unchanged.<br/><br/>\"You'll find that I'm not as easily defeated as you might have before.\"<br/><br/>Feng Jianhong replied, his tone steady without any hint of being provoked by Zhao Tianming.<br/><br/>The crowd buzzed with excitement, marveling at the unexpected turn of events.<br/><br/>The battle was far from over, and there was excitement about what would happen next.<br/><br/>Zhao Tianming refused to back down. His pride demanded absolute victory, and he wasn't<br/><br/>about to let Feng Jianhong destroy that.<br/><br/>Zhao Tianming's aura shone brightly, and the air around him shone with power.<br/><br/>\"You may have blocked my Thunderclap Fist, but I've got plenty where that came from.\"<br/><br/>Zhao Tianming announced as his voice echoed through the arena.<br/><br/>\"Let's see how long you can last!\"<br/><br/>Zhao Tianming roared ahead, his fist numb as he swept away the blow. Each punch was infused with Peak Foundation Establishment Stage's power, delivering<br/><br/>enough force to split steel and send a devastating wave to the ground.<br/><br/>However, Feng Jianhong met Zhao Tianming's attack head-on. He took the attack while also<br/><br/>counterattacking.<br/><br/>-BANG! BANG! BANG!<br/><br/>Zhao Tianming's fist slammed Feng Jianhong defensively, each impact shaking the ground<br/><br/>beneath them.<br/><br/>However, despite the overwhelming power behind the attack, Feng Jianhong remained<br/><br/>steadfast, not willing to back down.<br/><br/>The crowd watched in shock as Feng Jianhong took each blow, his body seemingly<br/><br/>indestructible.<br/><br/>His aura was like an unbreakable shield, absorbing the energy of Zhao Tianming's attacks.<br/><br/>\"How... how is he still standing?\"<br/><br/>Someone in the crowd murmured in disbelief.<br/><br/>\"Feng Jianhong seems like a mountain, unwilling to move even against such force! Nothing Zhao Tianming does seems to faze him.\"<br/><br/>When every attempt to breach Feng Jianhong's defenses failed, Zhao Tianming's frustration<br/><br/>grew.<br/><br/>His punches got more erratic, more desperate, as he poured everything he had into the attack. \"Why... don't... you... fall!\"<br/><br/>Zhao Tianming growled through gritted teeth, anger in his voice.<br/><br/>He took a hit for every 10 or so attacks he did to Feng Jianhong. However, looking at the state<br/><br/>of the two, one might think that Zhao Tianming is the one who took all those attacks. Zhao Tianming, once confident and composed, now appeared battered and worn. His clothes were torn, his face smeared with dirt and sweat, and his breathing had become ragged. In contrast, Feng Jianhong stood tall, his expression calm and unyielding. Though he had absorbed some of Zhao Tianming's attacks, his body bore far fewer marks of the fight. On the Zhao Family side, Zhao Chenxi was sweating profusely. His son, the pride of his life, Zhao Tianming was struggling against someone of Feng Clan who had lower cultivation. \"Tianming, you can do it. Just knock that guy out!\"<br/><br/>Zhen Chenxi muttered to himself, and for the first time, he prayed for his son's victory.<br/><br/>On the other hand, Feng Chen smiled as he watched the fight.<br/><br/>He could see Feng Jianhong's determination to never give up. Despite looking fine, Feng Chen knew that Feng Jianhong had sustained quite a bit of damage. Sёarᴄh the Novёlƒire.n(e)t website on Google to access chapters of novels early and in the highest quality.<br/><br/>However, Feng Jianhong refused to back down and continued to endure since he knew that<br/><br/>this was the only way for him to win.<br/><br/>(Anyway, looks like Jianhong is going to end the battle!)<br/><br/>On the stage, Feng Jianhong took advantage of Zhao Tianming being exhausted to launch an<br/><br/>attack.<br/><br/>\"Earth Shattering Palm!\"<br/><br/>Feng Jianhong used his technique, his fist slamming into Zhao Tianming's chest with the<br/><br/>force of a battering ram.<br/><br/>-BURST!<br/><br/>Zhao Tianming stepped back, the unexpected counter knocking his breath out of him.<br/><br/>*НАН! НАН!<br/><br/>He gasped for air, his eyes widening in shock as he realized how powerful Feng Jianhong had<br/><br/>become.<br/><br/>\"I told you Zhao Tianming. I'm not the same as before.\"<br/><br/>Feng Jianhong spoke with satisfaction. Feng Jianhong had never thought that this day would<br/><br/>come when he would overpower Zhao Tianming, the most powerful person in his generation.<br/><br/>Zhao Tianming's face twisted in a mix of anger and fear.<br/><br/>\"I can't... I'm not losing! I'm not losing!\"<br/><br/>His voice trembled with desperation as he struggled to stay upright.<br/><br/>But his strength was waning. The relentless battle had taken its toll, and despite his fierce<br/><br/>determination, Zhao Tianming could no longer maintain his footing.<br/><br/>-BANG!<br/><br/>With a final, pained gasp, he collapsed to the ground, his body going limp as unconsciousness<br/><br/>claimed<br/><br/>him.<br/><br/>The arena fell silent, the crowd stunned by the turn of events.<br/><br/>\"Winner! Feng Jianhong of the Feng Clan!\"\t\t\t\t\t\t</div>", "images": {}, "success": true}