{"id": 26, "url": "https://www.novelhall.com/my-brothers-the-protagonist-good-thing-i-awakened-my-system-33973/14946570.html", "title": "Chapter 26: Brewing Storm!", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 26: Brewing Storm!</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 26: Brewing Storm!Time was flowing like water and a few days had already passed by after the Annual Genius Competition.<br/><br/>During this period, Misty Vale City was peaceful and the only difference was that the fame of Feng Clan has increased several times with many telling the story about Feng Clan geniuses. \"Again!\"<br/><br/>Feng Yun said as he along with Feng Mei came out of their fifth Medicine Store.<br/><br/>\"This is the fifth shop that doesn't have Blazing Starflower. How is this possible?\" S~eaʀᴄh the ηovelFire.ηet website on Google to access chapters of novels early and in the highest quality.<br/><br/>Feng Yun said in a bit of frustration. Blazing Starflower was the ingredient required to make the Golden Vein Pill which is a Rank-2 pill.<br/><br/>It wasn't a rare ingredient and the Medicine Shop would always have some stock of it. But today, when he went out with Feng Mei to get some, he couldn't get one.<br/><br/>\"Not only that, many other ingredients for Rank-2 pills are also missing.\"<br/><br/>Feng Yun said in disappointment.<br/><br/>For the past few days, he has been training under his master, Minghao. He realized that not only was the old man powerful but also a very high-ranking alchemist.<br/><br/>So how could he miss such a big chance and plead with Senior Minghao to teach him? Senior Minghao agreed if Feng Yun took him as his master which he quickly did.<br/><br/>After that along with cultivation, his master also taught alchemy to Feng Yun.<br/><br/>To Minghao's surprise, Feng Yun has shown an amazing aptitude for alchemy and has already become first-grade alchemy. Not only that, Feng Yun was also ready to try his luck at advancing to the Second Grade.<br/><br/>However, when he went out to get the ingredients to refine Rank-2 pills, he was met with disappointment. Most of the ingredients that he needed were out of stock.<br/><br/>\"Brother Yun, could it be that there is some problem with the supply? Maybe some monsters have attacked the convoy, and the medicines never made it to Misty Vale City?\"<br/><br/>Feng Mei said. It wasn't rare for the delivery of items imported from other cities to be late due to monster attacks.<br/><br/>\"I hope that's the reason!\"<br/><br/>Feng Yun replied that he had some bad feelings about this abnormal situation.<br/><br/>Realizing he wouldn't be able to obtain the ingredients, Feng Yun decided to take a leisurely stroll with Feng Mei before heading back to his training.<br/><br/>*****<br/><br/>Soon, in the blink of an eye, another day passed by.<br/><br/>In the morning, inside a workshop controlled by the Feng Family, the market was bustling with activity. The air was filled with the sounds of haggling and lively chatter.<br/><br/>The voices belonged to stall owners and customers who had rented spaces from the Feng Family to sell their goods.<br/><br/>Not far from the roadside stalls, a towering store stood above the rest, offering a variety of goods.<br/><br/>There were sellers of pills, weapons, clothing, and even restaurants and eateries lining the street. Among these, the pill stores were the most popular.<br/><br/>Due to the rarity of alchemists, all the stores selling pills in this marketplace were under the direct control of the Feng Family.<br/><br/>The most commonly sold items were first-grade pills, such as Strength Enhancing Pills, Bone Fortification Pills, and Vitality Replenishing Pills. These pills were all crafted by alchemists of the Feng Family.<br/><br/>As for second-grade pills, they were mostly acquired by the Feng Family from other cities and resold in their shop.<br/><br/>\"Bring me a bottle of the Bone Fortification Pill.\"<br/><br/>\"I'll take one of the Strength Enhancing Pills, please!\"<br/><br/>\"I want 5 Vitality Replenishing Pills!\"<br/><br/>The shopkeepers quickly responded to the customers' requests, moving with practiced efficiency.<br/><br/>The shelves were lined with carefully labeled bottles, each containing a different pill that catered to the needs of different cultivators.<br/><br/>The Feng Family's control over the pill market was evident in the orderly way the business was conducted, with customers trusting the quality of the products.<br/><br/>As the bustling activity in the Feng Family's pill shop continued, the door creaked open, and a man dressed in fine robes entered with a smug expression on his face.<br/><br/>He carried himself with an air of arrogance, making it clear that he wasn't just an ordinary customer. His presence immediately drew the attention of those nearby.<br/><br/>The man casually strolled up to other people, glancing around at the various customers with a knowing smirk.<br/><br/>He leaned in slightly and spoke in a loud, clear voice, making sure everyone in the shop could hear him.<br/><br/>\"Have you all heard the news?\" he began, his tone dripping with condescension.<br/><br/>\"The Yan Family is offering Rank-2 pills and the finest Rank-1 pills at prices you won't believe. They're just down the road. If you want to save your gold coin and get the best<br/><br/>quality, you'd better hurry before they sell out.\"<br/><br/>The room fell silent as the customers absorbed the man's words.<br/><br/>A murmur began to ripple through the crowd.<br/><br/>\"Rank-2 pills? Those are precious and rare!\"<br/><br/>\"Cheaper Rank-1 pill? Has the Yan Family gone crazy? They always keep saying that their pills<br/><br/>are high-quality and wouldn't lower the price.\"<br/><br/>\"But if it is real then we must hurry. Getting a Rank-2 pill isn't easy for those of us without any connection.\"<br/><br/>The allure of high-quality pills at lower prices was too tempting to resist, and within moments, the shop was buzzing with the sound of shuffling feet and hushed conversations.<br/><br/>Not a moment later, there was a person who had just entered the shop with an excited face and<br/><br/>shouted.<br/><br/>\"It's true, it's true, there are really a lot of pills for sale over at the Yan Family at cheap prices. Everyone rush, if you're slow, there might not be any pills for you!\"<br/><br/>These words shocked every customer in the shop. Getting Rank-2 wasn't easy and to top it all Rank-2 pills which are rare in Misty Vale City are being sold.<br/><br/>One by one, customers began to head for the door, their minds made up. They left behind half-finished transactions and unpurchased pills as they hurried to see for themselves what the Yan Family had to offer.<br/><br/>Within minutes, the once-crowded Feng Family shop had emptied out, leaving only the shopkeeper and a few loyal patrons behind.<br/><br/>The two men who had delivered the message simply smiled, his job complete, and exited the shop with a satisfied expression.<br/><br/>As the shop quickly emptied, Feng Bao, the shopkeeper, turned to the few loyal customers who had chosen to stay.<br/><br/>With a warm smile, he addressed them, \"Thank you for your continued trust in the Feng Family. As a token of our appreciation, I'm offering you a special discount on any purchase today. Please, take your time and let me know if you need anything.\"<br/><br/>The loyal customers nodded in appreciation, feeling reassured that they had made the right decision to stay.<br/><br/>Once Feng Bao finished assisting the customers, his expression turned serious. He quickly moved to the back of the shop, where one of his trusted assistants was organizing inventory.<br/><br/>\"Feng Han,\" Feng Bao said in a low, urgent voice.<br/><br/>\"I need you to get this message to the Clan Leader immediately. The Yan Family is making a<br/><br/>move, and we need to respond swiftly. Go quickly!\"<br/><br/>\"Don't worry Uncle. I will get it done immediately.\"<br/><br/>Feng Han said and rushed out of the shop.<br/><br/>Feng Bao looked at Han disappearing as the worries on his face worsened.\t\t\t\t\t\t</div>", "images": {}, "success": true}