{"id": 22, "url": "https://www.novelhall.com/my-brothers-the-protagonist-good-thing-i-awakened-my-system-33973/14946566.html", "title": "Chapter 22: Feng Yun Vs Yan Zhihao!", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 22: Feng Yun Vs Yan Zhihao!</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 22: Feng Yun VS Yan Zhihao!However, just as the attack was about to connect, Feng Yun's figure blurred, and he dodged to the side with a speed that caught everyone off guard.<br/><br/>\"Ghostly Shadow Mirage!\"<br/><br/>Feng Yun has used this Heaven Grade Movement Technique to dodge Yan Zhihao's attack.<br/><br/>\"What?!\"<br/><br/>Yan Zhihao exclaimed in shock as his fist struck nothing but air. He couldn't believe that Feng Yun, who was in the Mid-Level Foundation Establishment Stage, was faster than he was.<br/><br/>\"You're too slow!\"<br/><br/>Feng Yun's calm voice came from behind Yan Zhihao, causing the latter to be shocked and angry.<br/><br/>How could he, a Core Formation Stage be slower than the Mid-Level Foundation Establishment Stage?<br/><br/>\"Impossible! How did you- \"<br/><br/>Before Yan Zhihao could finish his sentence, Feng Yun was already ready to attack, his sword filled with powerful Qi.<br/><br/>\"Heavenly Emperor's Sword!\"<br/><br/>Yan Zhihao's eyes widened in alarm as he felt the overwhelming pressure emanating from the sword.<br/><br/>It was as if the very air around him had turned solid, pressing down on him with an intensity that made it hard to breathe. He instinctively raised his arms to defend, but he knew it was too late.<br/><br/>-BANG!<br/><br/>The moment Feng Yun's sword descended, it was as if the entire arena was engulfed in a blinding flash of light.<br/><br/>The power of Feng Yun's attack sliced through the air, creating a powerful shockwave that reverberated throughout the arena.<br/><br/>The ground beneath Yan Zhihao cracked and shattered under the sheer force of the attack, sending debris flying in all directions.<br/><br/>For a brief moment, there was nothing but silence. The entire arena seemed to hold its breath as the dust and debris settled, revealing the outcome of the clash.<br/><br/>Yan Zhihao stood frozen in place, his eyes wide with shock and pain. A thin line of blood appeared on his chest, where Feng Yun's sword had struck with such precision that it had barely grazed the surface yet cut deep into his core.<br/><br/>The immense Qi from the attack had infiltrated his body, disrupting his own Qi.<br/><br/>With a groan, Yan Zhihao staggered backward, his legs giving way as he collapsed to the ground.<br/><br/>His once invincible aura was now shattered, and the confidence that had fueled his arrogance had vanished.<br/><br/>\"Wh... What was that?<br/><br/>\"SH*T! Oh sh*t! Do you see what I am seeing?\"<br/><br/>\"Oh My God! Yan Zhihao has been severely injured! He has been injured by Feng Yun.\"<br/><br/>\"Feng Yun is so powerful? Looks like we all underestimated Feng Yun.\"<br/><br/>The crowd buzzed with excitement and admiration for Feng Yun.<br/><br/>Feng Yun, who had been dismissed as being lucky, was actually so powerful. On the other hand, the one thought to be invincible was lying on the ground.<br/><br/>\"FENG YUN! I WILL KILL YOU!\"<br/><br/>Yan Zhihao roared angrily as he stood up. This was the first time that he had been humiliated like this.<br/><br/>\"Hmph! You can try if you are capable.\"<br/><br/>Feng Yun replied calmly. He knew that the angrier Yan Zhihao got, the more mistakes he would make which is better for him.<br/><br/>Yan Zhihao's face contorted with rage as his eyes burned with murderous intent.<br/><br/>He clenched his fists, gathering his Qi as his aura flared dangerously. The ground beneath him trembled as his power surged.<br/><br/>Feng Yun remained calm as he observed Yan Zhihao's outburst. His grip on the hilt of his sword tightened, ready to respond to Yan Zhihao's attack.<br/><br/>Yan Zhihao's anger boiled over. With a furious roar, he charged at Feng Yun, his fist crackling with energy as he unleashed a powerful strike.<br/><br/>\"DIE FOR ME!\"<br/><br/>\"Mountain Cracking Fist!\"<br/><br/>The ground split open beneath Yan Zhihao's attack, the force of his fist creating shockwaves that radiated outward.<br/><br/>It was a technique that had felled many opponents in the past, one that no Foundation Establishment cultivator could withstand.<br/><br/>Moreover, with its wide-area effect, it was impossible for anyone to dodge this move.<br/><br/>Yan Zhihao specifically used this move so that Feng Yun couldn't dodge his attack like earlier despite the huge Qi that was needed to execute this move.<br/><br/>-BOOM!<br/><br/>The ground shook as Yan Zhihao's Mountain Cracking Fist collided with the arena, creating a deafening explosion.<br/><br/>Dust and debris filled the air, obscuring everything from view.<br/><br/>The spectators held their breath, convinced that no one could survive such a devastating<br/><br/>attack.<br/><br/>Many of them believed that Feng Yun would have been severely injured and unable to continue the fight.<br/><br/>But as the dust began to settle, a faint silhouette emerged from within the cloud of debris.<br/><br/>Feng Yun stood tall, his stance firm, and his aura unwavering. The Qi surrounding him shimmered like an impenetrable barrier.<br/><br/>Feng Yun has used the Mysterious Heaven Iron Wall to defend against Yan Zhihao's Mountain<br/><br/>Cracking Fist.<br/><br/>A collective gasp rippled through the crowd.<br/><br/>Yan Zhihao's eyes widened in disbelief. His attack, which should have obliterated any Foundation Establishment cultivator, had been completely nullified.<br/><br/>\"How...how is this possible?\"<br/><br/>Yan Zhihao stammered, his voice trembling with a mix of fear and frustration.<br/><br/>\"Is that all you've got?\"<br/><br/>Feng Yun's voice was calm, almost taunting.<br/><br/>The crowd erupted into murmurs, their shock evident.<br/><br/>Feng Yun, who they had underestimated, had not only survived but had effortlessly defended<br/><br/>against Yan Zhihao's most powerful attack.<br/><br/>Yan Zhihao's face twisted in fury as he struggled to comprehend what had just happened.<br/><br/>His most powerful attack, one that had decimated countless opponents, had been rendered useless against Feng Yun. The disbelief in his eyes quickly turned to a blazing anger.<br/><br/>\"Damn you, Feng Yun!\"<br/><br/>Yan Zhihao spat, his voice shaking with rage.<br/><br/>\"I'll make you pay for this humiliation!\"<br/><br/>But as Yan Zhihao attempted to muster more power, his body betrayed him. The Qi he tried to<br/><br/>gather faltered, and the trembling of his hands revealed his exhaustion.<br/><br/>The Mountain Cracking Fist had drained him of his energy, leaving him vulnerable.<br/><br/>Seeing the exhaustion and desperation in Yan Zhihao's eyes, Feng Yun knew this was his moment to press the advantage.<br/><br/>Without hesitation, he lunged forward, his sword gleaming with a sharp, dangerous light.<br/><br/>Yan Zhihao, drained and struggling to keep his Qi steady, could barely lift his arms to defend.<br/><br/>His movements were sluggish, his reactions slow-everything about him screamed<br/><br/>vulnerability.<br/><br/>\"Feng Yun! Don't you dare!\"<br/><br/>Yan Zhihao snarled, trying to gather what little energy he had left to form a defense. But it<br/><br/>was too late.<br/><br/>The sword's edge cut through Yan Zhihao's feeble defenses, leaving a deep, burning gash across Yan Zhihao's side.<br/><br/>Yan Zhihao gasped in pain, his body reeling from the sudden injury. He stumbled backward, his breath rugged and uneven.<br/><br/>The wound on his side bled freely, and the Qi within him wavered, struggling to stabilize.<br/><br/>Desperation flickered in Yan Zhihao's eyes as he tried to muster what little strength he had<br/><br/>left.<br/><br/>Despite the pain, he roared with defiance and raised his trembling fist, attempting a<br/><br/>counterattack.<br/><br/>\"Get back!\"<br/><br/>Yan Zhihao shouted, his voice hoarse.<br/><br/>\"I'm not finished yet!\" Sёarch* The Novёlƒire.n(e)t website on Google to access chapters of novels early and in the highest quality.<br/><br/>With a strained effort, he gathered his remaining Qi and unleashed a chaotic wave of punches<br/><br/>toward Feng Yun. The attack was wild and uncontrolled, a last-ditch effort to turn the tide of<br/><br/>the battle.<br/><br/>Feng Yun barely flinched as the wave of attacks approached. He deftly sidestepped the erratic blast, using his Ghostly Shadow Mirage technique to avoid the attacks.<br/><br/>Yan Zhihao's counter was sloppy, driven more by desperation than precision, and it missed its<br/><br/>mark entirely.<br/><br/>Within the audience section of the Five Major Family, every head was surprised by what they<br/><br/>were seeing except Feng Chen.<br/><br/>Firstly, Yan Zhihao surprised everyone with his Core Formation Stage cultivation and then the latter shocked them even more by easily handling Yan Zhihao.<br/><br/>Yan Zhan clenched his palms, having the feeling that things were out of control.<br/><br/>Originally, he thought that this waste of the Feng family was just lucky, but it turned out that<br/><br/>he had been hiding his power.<br/><br/>\"Haha... Yan Zhan, you can prepare to cough up Thirty Thousand Gold Coins!\"<br/><br/>Feng Chen said. He wasn't going to waste this opportunity to mock Yan Zhan and the Yan<br/><br/>Family.<br/><br/>\"Feng Chen, don't be hasty. The match is still not over!\"<br/><br/>Yan Zhan said in anger while gritting his teeth.<br/><br/>\"Hehe... I hope that you pay me today. Otherwise, you wouldn't be able to bear my interest.<br/><br/>Haha...\"<br/><br/>While Feng Chen said that, the fight on the stage was already coming to an end.<br/><br/>Seeing the exhaustion in Yan Zhihao, Feng Yun knew this was his moment to press the<br/><br/>advantage. Without hesitation, he lunged forward, his sword gleaming with a sharp,<br/><br/>dangerous light.<br/><br/>Yan Zhihao, drained and struggling to keep his Qi steady, could barely lift his arms to defend.<br/><br/>\"Feng Yun! Don't you dare!\"<br/><br/>Yan Zhihao snarled, trying to gather what little energy he had left to form a defense.<br/><br/>\"Heavenly Emperor's Sword!\"<br/><br/>Feng Yun's voice rang out clear and cold as his sword slashed through the air with terrifying<br/><br/>precision.<br/><br/>Yan Zhihao's eyes widened in terror. He crossed his arms in a desperate attempt to block the<br/><br/>attack, but the force behind Feng Yun's strike was far beyond what he could handle in his<br/><br/>weakened state.<br/><br/>-BANG!<br/><br/>The clash of energies sent shockwaves rippling through the arena. Yan Zhihao's attempt to block the attack crumbled under the overwhelming power of the Heavenly Emperor's Sword. The impact sent him skidding backward, his feet digging deep trenches into the arena floor as<br/><br/>he fought to stay upright.<br/><br/>\"Ugh!\"<br/><br/>Yan Zhihao coughed up blood, his body trembling from the sheer force of the blow. He tried his best but was unable to resist any longer as he fell down, losing consciousness.\t\t\t\t\t\t</div>", "images": {}, "success": true}