{"id": 21, "url": "https://www.novelhall.com/my-brothers-the-protagonist-good-thing-i-awakened-my-system-33973/14946565.html", "title": "Chapter 21: The Final Of Annual Genius Competition!", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 21: The Final Of Annual Genius Competition!</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 21: The Final Of Annual Genius Competition!Nobody expected this result and everyone was stunned. Zhao Tianming, the favorite to win the competition, has just been eliminated.<br/><br/>\"Feng Jianhong did it! He really defeated Zhao Tianming!\"<br/><br/>\"Unbelievable! Who would have thought that Feng Jianhong could take down someone of Zhao Tianming's caliber?\"<br/><br/>\"Looks like the Feng Clan has a rising star!\"<br/><br/>The silence in the arena was quickly shattered by an explosion of cheers and applause.<br/><br/>The spectators, who had been so sure of Zhao Tianming's victory, were now in awe of Feng Jianhong's unexpected triumph.<br/><br/>The atmosphere was electric, with excitement and disbelief rippling through the crowd. \"How could Zhao Tianming lose? It doesn't make sense!\"<br/><br/>\"This has to be some kind of trick! Zhao Tianming was supposed to win!\"<br/><br/>\"All my money... gone because of this nobody from the Feng Clan!\"<br/><br/>\"Zhao Tianming! You weakling! I lost all my savings because of you.\"<br/><br/>Among the crowd, murmurs of dissatisfaction grew louder as many of them had previously betted on Zhao Tianming to win the competition.<br/><br/>Now all of their money has gone down the drain and they can't help but complain.<br/><br/>No matter what, Feng Jianhong won and they had no chance of getting their money back.<br/><br/>Feng Jianhong breathed heavily as he was both exhausted and excited. He never thought that he could win but in the end, his endurance has paid off.<br/><br/>Feng Jianhong was on the verge of collapse, because of the attacks he took on. Clearly, Feng Jianhong didn't have an easy time achieving this victory.<br/><br/>However, it was already good that Feng Jianhong was able to defeat an opponent whose cultivation level was higher.<br/><br/>Fortunately, before Feng Jianhong fell down, the Feng Clans' younger generation came in time to support him.<br/><br/>\"Feng Jianhong, take this pill and recover your energy!\"<br/><br/>Feng Liang said as he gave one of his healing pills.<br/><br/>Although the pill wouldn't fully restore Feng Jianhong's lost Qi and health, it could at least recover some, preventing him from becoming completely exhausted.<br/><br/>\"Haha! You did it Jianhong! You did it!\"<br/><br/>\"You really won against Zhao Tianming!\"<br/><br/>The other younger generation of Feng Clan was elated as they kept praising Jianhong for his feat.<br/><br/>One month ago, they were still the weakest younger generation among the Five Major Families but now, none can deny that they were the strongest.<br/><br/>\"Haha! It is all thanks to the patriarch's help.\" Sёarᴄh the novёlF~ire.net website on Google to access chapters of novels early and in the highest quality.<br/><br/>Feng Jianhong replied.<br/><br/>All the changes that happened within him were because of Feng Chen and he was thankful for that.<br/><br/>Without the Marrow Cleansing pill and other cultivation resources given by Feng Chen, he knew that it would have taken months or even years to reach the Mid-Level Foundation Establishment Stage.<br/><br/>Moreover, he wouldn't have been able to defend against Zhao Tianming's powerful attacks if not for the Mysterious Heaven Iron Wall which Feng Chen taught.<br/><br/>(I have to become even stronger in order to repay the Patriarch's kindness!)<br/><br/>Feng Jianhong silently vowed.<br/><br/>On the other side of the arena, Zhao Chenxi's face had drained of color. His son's defeat was a heavy blow, not just to Zhao Tianming, but to the entire Zhao Clan's reputation.<br/><br/>The consequences of this loss would be far-reaching, and the other clans would not soon forget it.<br/><br/>\"Damn it!\"<br/><br/>Zhao Chenxi cursed.<br/><br/>In the arena, the referee was going to announce the draw of the lottery when Feng Jianhong interrupted.<br/><br/>\"Referee, I will resign! You can proceed with the final.\"<br/><br/>Feng Jianhong said.<br/><br/>Usually, a lottery would have been done to select one who would directly go to the final and the other two would fight to advance.<br/><br/>However, Feng Jianhong didn't think that was necessary.<br/><br/>With his current state, it was difficult for him to win. Moreover, Feng Yun was still there whom he believed would be able to win the competition.<br/><br/>\"Ahem! Okay then, we will proceed to the final. Feng Yun! Yan Zhihao, please make your way towards the stage!\"<br/><br/>The referee said.<br/><br/>\"This Feng Yun really reached the final with his luck!\"<br/><br/>\"Damn it! How does Feng Yun deserve to be in the final? It should have been Feng Jianhong.\"<br/><br/>\"Yan Zhiaho, teach this loser a lesson. I can't stand Feng Yun being the finalist without going through all the fights like others.\"<br/><br/>The crowd began to yell as many of them hoped that Yan Zhihao could beat the hell out of Feng Yun.<br/><br/>*SIGH!<br/><br/>\"What did I do to get all this hate?\"<br/><br/>Feng Yun muttered as he felt helpless against the crowd's anger. He felt it was unfair that the crowd was cursing him even though he didn't do anything wrong.<br/><br/>\"Anyway, let's focus on the match. I have a feeling that this Yan Zhihao has been hiding<br/><br/>something.\"<br/><br/>Feng Yun said as he stared at Yan Zhihao who was also staring at Feng Yun.<br/><br/>\"Hmph! Feng Yun, you trash, I didn't think you would reach the final with your luck.\"<br/><br/>Yan Zhihao said. As a member of the Yan Clan, how could he have good feelings towards someone of the Feng Clan?<br/><br/>He has already received orders from the patriarch to cripple Feng Clan members if he meets them in the competition.<br/><br/>And Yan Zhihao was happy that his opponent happened to be Feng Yun, who is the brother of the devil Feng Chen.<br/><br/>He couldn't be happier that he could avenge his elders who died at the hands of Feng Chen. \"Yan Zhihao, enough talking. You can see for yourself whether it was luck or not.\"<br/><br/>Feng Yun replied.<br/><br/>Feng Yun didn't also have good feelings towards the Yan Family who tried to attack Feng Clan when his parents were missing.<br/><br/>If not for his brother, their clan would have become their slaves or worse end up dead. In any case, the Zhao, Lui, and Yan Families had always been their enemies, especially the Yan Clan.<br/><br/>So, there was no need to pretend to be friendly especially when Yan Zhihao himself was acting<br/><br/>provocatively.<br/><br/>\"Hehehe... Haha... Feng Yun, you overestimate yourself. No one is my opponent here,<br/><br/>including Zhao Tianming and Feng Jianhong.\"<br/><br/>Yan Zhihao declared arrogantly as his aura flared up.<br/><br/>\"This... This is the aura of the Peak-Level Foundation Establishment Stage. No! It is even greater. Initial-Level of Core Formation Stage!\"<br/><br/>\"Oh My God! Yan Zhihao has already advanced to the Core Formation Stage.\"<br/><br/>\"No wonder the Yan Clan looked confident. Yan Zhihao has already reached the Core<br/><br/>Formation Stage. Even Feng Chen wasn't that strong when he was at Yan Zhihao's age.\"<br/><br/>The crowd went into an uproar as they quickly realized that Yan Zhihao had entered the Core Formation Stage.<br/><br/>\"Feng Yun is done for! There's no way he can win against someone who's already in the Core Formation Stage!\"<br/><br/>\"Yan Zhihao was hiding his true strength all this time. This match is going to be over before it<br/><br/>even starts!\"<br/><br/>\"Even I am starting to feel sorry for Feng Yun. With his Mid-Level Foundation Establishment Cultivation, he wouldn't stand a chance.\"<br/><br/>As the crowd's voices grew louder, Feng Yun remained calm, his expression unchanging.<br/><br/>Despite the fact that Yan Zhihao was in the Core Formation Stage, he didn't seem fazed.<br/><br/>\"You must be scared stiff, Feng Yun. Don't worry, I'll make sure you get a front-row seat to<br/><br/>hell.\"<br/><br/>Yan Zhihao said as he took Feng Yun's calmness for fear.<br/><br/>Feng Yun's gaze sharpened as he replied.<br/><br/>\"You talk too much, Yan Zhihao. Why don't you show me what you got instead of running<br/><br/>your little mouth?\"<br/><br/>\"Huh?\"<br/><br/>Yan Zhihao was surprised by Feng Yun's words. He thought that Feng Yun would be too scared<br/><br/>to even fight and surrender immediately.<br/><br/>\"Haha... Feng Yun! I've got to give it to you. You've got some nerve talking like that in front of me.\"<br/><br/>He sneered, his eyes gleaming with contempt.<br/><br/>\"But don't worry, I'll make sure to crush that arrogance of yours. After all, you'll make a fine example of what happens to those who dare to challenge the Yan Clan.\"<br/><br/>Yan Zhihao's aura intensified, the pressure from his Core Formation Stage cultivation<br/><br/>spreading across the arena like a suffocating blanket.<br/><br/>The crowd could feel the immense power radiating from him.<br/><br/>Yan Zhihao launched himself towards Feng Yun, moving with incredible speed. The ground<br/><br/>beneath him cracked as he propelled himself forward, his fist glowing with a powerful Qi.<br/><br/>Yan Zhihao roared as his fist closed in on Feng Yun.<br/><br/>\"This is the end, Feng Yun!\"\t\t\t\t\t\t</div>", "images": {}, "success": true}