{"id": 30, "url": "https://www.novelhall.com/my-brothers-the-protagonist-good-thing-i-awakened-my-system-33973/14946574.html", "title": "Chapter 30: The Price Of Healing", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 30: The Price Of Healing</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 30: The Price Of HealingThe news of the Yan Clan's new pill shop, backed by the renowned Second Grade Alchemist Zhou Tianhua, had spread like wildfire throughout the city.<br/><br/>By dawn, a long line had already formed outside the Yan Clan's pill shop, eager customers jostling for positions to secure their share of the newly produced pills.<br/><br/>\"Brother Lin, you're here too! I didn't think you'd be interested in buying pills this early.\"<br/><br/>\"How could I miss this? With a second-grade alchemist crafting these pills, their potency is unmatched. I'd be a fool not to stock up while I can.\"<br/><br/>\"But have you noticed? The prices have gone up since yesterday. A bit steep, don't you think?\"<br/><br/>\"True, but these pills are made by a second-grade alchemist. They're worth every gold. And honestly, it's better to buy now before the prices climb any higher.\"<br/><br/>Since the demand was so high, Yan Clan also decided to raise the price of the pills, especially Rank-2 pills since only their Yan Pill Shop sells them.<br/><br/>No matter the price, the customer was not going to back down and miss the chance to obtain Rank-2 pills.<br/><br/>It has already been three days since the Yan Pill Shop started selling Rank-2 pills and the profit made was already comparable to their monthly income.<br/><br/>Yan Zhan couldn't help but burst out laughing.<br/><br/>Who could have expected that the elder brother of Elder Zhou was not only in Three Elements Divine Realm but also Second Grade Alchemist?<br/><br/>\"Haha, Elder Zhou Tianhua, this time, it is all thanks to you that our Yan Clan is dominating the marketplace.\"<br/><br/>Yan Zhan said excitedly, his eyes gleaming with ambition.<br/><br/>Zhou Tianhua waved his hand dismissively, but there was a proud smirk on his face.<br/><br/>\"It's only natural, Yan Head. With my pills in your market, the other clans don't stand a chance. The Feng Clan's influence will dwindle sooner or later.\"<br/><br/>Yan Zhan chuckled, clearly pleased with the progress.<br/><br/>\"Indeed, their customers are flocking to us. Feng Clan won't hold out much longer. They might not even hold up for a month if this continues!\"<br/><br/>\"Hmph! If not for the Royal Family, I would have gone and decimated the Feng Clan in one night. Alas, I need to take the long way!\"<br/><br/>Zhou Tianhua said in an irritated voice.<br/><br/>If he was allowed to, he would have rather approached the use of violence over using the market to corner the Feng Clan.<br/><br/>However, he couldn't do that, after all, no matter how strong he might be considered in Misty Vale City, he was a weakling compared to the Royal Family.<br/><br/>With the Wang Family being stationed here, the Royal Family would know that he had attacked the Feng Clan without any reason and this might cause him to get in some deep trouble.<br/><br/>Therefore, he was trying to make the Feng Clan desperate and by any chance, if they were the ones to attack the Yan Clan, then he could retaliate and call it self-defense.<br/><br/>If not, then Feng Clan could only get destroyed as their market ceased to exist. However, that was not the only reason why he was helping Yan Clan with his alchemy.<br/><br/>\"Yan Head, don't forget our agreement. After we take care of Feng Clan and other Major Families, you will give me 50% of the profit.\"<br/><br/>Zhou Tianhua said, reminding Yan Zhan of their prior agreement.<br/><br/>\"Haha! Of course, Of Course! Elder Zhou Tianhua is doing me such a favor. I would, of course, return it!\"<br/><br/>Yan Zhan replied without any hesitation.<br/><br/>Yan Zhan didn't think there was any disadvantage in this deal since he would become the dominant one in Misty Vale City.<br/><br/>Anyways, due to the help of Zhou Tianhua's pill, the Yan marketplace was flourishing while the other clan territory was obviously declining.<br/><br/>He already saw a 300% increase in the number of customers in his marketplace. He thought it was only a matter of time before the Yan Clan dominated the whole of Misty Vale City.<br/><br/>*********<br/><br/>In the morning, the Yan Clan pill shop was crowded with people as they all rushed to buy the pills before they got sold out.<br/><br/>However, the mood of the customer seemed a bit different from what it was previously.<br/><br/>A crowd of frustrated customers clamored at the counter, their voices rising in discontent.<br/><br/>\"Why have the prices gone up so much?\" one customer demanded.<br/><br/>\"This is outrageous! Three days ago, these Rank-1 pills only cost 100 gold coins and today, it is 300. And Rank-2 pills cost 2000 gold coins?\"<br/><br/>\"The price hike is too steep! Don't you have any conscience?\"<br/><br/>The shopkeeper, a burly man with a disdainful expression, glanced at the crowd with a mixture of annoyance and condescension.<br/><br/>He adjusted his embroidered robe and cleared his throat before responding.<br/><br/>\"Listen up!\" he said, his tone brusque.<br/><br/>\"These pills are produced by a second-grade alchemist. The quality and efficacy are guaranteed to be far superior. The previous price was just an Opening discount!\"<br/><br/>He looked over the crowd with a dismissive wave of his hand.<br/><br/>\"If you can't afford the new prices, then perhaps these pills aren't for you. Our goods are for those who understand their worth.\"<br/><br/>A customer, clearly agitated, spoke up.<br/><br/>\"But the price increase is more than tripled! How can you justify that?\"<br/><br/>The shopkeeper's expression hardened.<br/><br/>\"A Second Grade Alchemist's work is worth every coin. This is Misty Vale City's only shop that sells Second Grade Alchemist products, and if you want quality, you'll have to pay for it.\" The crowd murmured in disapproval, but many found themselves reluctantly agreeing.<br/><br/>The reputation of the pills, now associated with a prestigious Second Grade Alchemist, held a strong allure.<br/><br/>Despite their irritation, the customers knew that there weren't any other shops in Misty Vale City where you could get Rank-2 pills.<br/><br/>As the shopkeeper continued to handle transactions with a smirk, the line of customers seemed to accept the new reality, though their grumbling continued in hushed tones.<br/><br/>As the bustling crowd filled the Yan Clan's pill shop, two cultivators quickly approached the<br/><br/>shop.<br/><br/>One of them was severely injured as he was being carried by his friend. His face was pale, and the blood-soaked bandages around his chest were a grim reminder of the fierce battle they<br/><br/>had barely survived.<br/><br/>\"Shopkeeper, we need a Second Grade Healing Pill, immediately!\"<br/><br/>One of the cultivators pleaded, his voice tense with urgency.<br/><br/>The Yan Clan's shopkeeper glanced over, his expression indifferent.<br/><br/>\"Second Grade Healing Pill? That'll be 3000 Gold coins.\"<br/><br/>\"3000 Gold Coins?\"<br/><br/>The cultivator was shocked.<br/><br/>The price was far beyond what they had anticipated. He stepped forward, desperation in his<br/><br/>eyes.<br/><br/>\"Is there no way to lower the price? Our captain is in critical condition...\"<br/><br/>The shopkeeper's lips curled into a dismissive smirk.<br/><br/>\"If you can't afford it, then perhaps you should look elsewhere. This is the Yan Clan's shop,<br/><br/>not a charity. Quality comes at a cost.\"<br/><br/>Disheartened, the two began to discuss their options, but it was clear they had little choice.<br/><br/>\"Renshu, Don't waste your money on me. With the injury that I have received, in the entire Misty Vale City, no pill could cure me. It's better to save money!\"<br/><br/>The Captain said, as he already accepted his fate.<br/><br/>\"No, Captain! You are injured because you were protecting us. I am not willing to give up just<br/><br/>yet!\"<br/><br/>Just as he said that a man burst through the door, panting heavily. He was one of their comrades, his clothes disheveled and his expression wild with excitement.<br/><br/>\"I got a Rank-2 pill!!\"<br/><br/>He shouted, holding up a small, shimmering pill.<br/><br/>The injured captain looked up weakly at his comrade, disbelief in his eyes.<br/><br/>\"A Rank-2 pill? How...?\"<br/><br/>Renshu quickly took the pill from the man's hand, his eyes wide with hope.<br/><br/>\"Captain, take this! Maybe it can help you.\"<br/><br/>The captain hesitated for a moment, his face a mix of doubt and resignation.<br/><br/>\"But...how could you afford it? And where did you even find a Rank-2 pill?\"<br/><br/>\"Never mind that, Captain. Just take it. We don't have time to waste!\"<br/><br/>With trembling hands, the captain took the pill and swallowed it. Almost immediately, a warm surge of energy spread throughout his body, knitting together torn muscles and mending shattered bones.<br/><br/>The pale hue of his skin began to fade, replaced by a healthier, more vibrant glow.<br/><br/>The crowd around them watched in stunned silence as the captain's breathing steadied, his<br/><br/>strength visibly returning.<br/><br/>Within moments, he stood up himself, the bloodstains on his bandages the only remaining Searᴄh the NôᴠelFirё.net website on Google to access chapters of novels early and in the highest quality.<br/><br/>evidence of his previous condition.<br/><br/>\"Incredible!\"<br/><br/>One of the onlookers exclaimed, stepping closer to the captain to examine him.<br/><br/>\"I've never seen a pill work so fast. Where did you get that?\"<br/><br/>Renshu, still in shock from the rapid recovery of his captain, turned to the man who had<br/><br/>brought the pill.<br/><br/>\"Yes, tell us! Where did you find such a powerful pill, and how much did it cost?\"<br/><br/>The man, catching his breath, grinned widely.<br/><br/>\"You won't believe it, but I got it from the Feng Clan's shop. And guess what? It only cost 800<br/><br/>gold coins!\"<br/><br/>\"800 gold coins?!\"<br/><br/>The crowd gasped in unison. Such a powerful pill that could save a dying man for just 800 gold<br/><br/>coins?<br/><br/>The captain, now fully recovered, looked at his comrade in surprise.<br/><br/>\"Are you saying this pill, which just saved my life, came from the Feng Clan? And it was only<br/><br/>800 gold coins?\"<br/><br/>The man nodded enthusiastically.<br/><br/>\"Yes! I was skeptical at first, but they guaranteed it. So I had no choice but to trust the Feng Clan. I just didn't expect the pill to be so effective!\"<br/><br/>The murmurs of disbelief and curiosity spread like wildfire through the crowd.<br/><br/>Many of them began to reconsider their options, especially given the exorbitant prices at the<br/><br/>Yan Clan's shop.<br/><br/>The Yan Clan's shopkeeper, who had been watching the entire scene unfold with increasing displeasure, could no longer remain silent.<br/><br/>\"Hmph! Don't be fooled by cheap imitations. The Yan Clan's pills are crafted by a second-<br/><br/>grade alchemist, and guaranteed to be of the highest quality. You get what you pay for!\"<br/><br/>No matter what others say, they all have seen the effect of the pill first-hand, so how could they not believe it?<br/><br/>One of the customers, a middle-aged woman, crossed her arms and looked at the shopkeeper<br/><br/>defiantly.<br/><br/>\"If the Feng Clan's pills can heal a man that quickly, why should we pay three times as much<br/><br/>for your pills?\"<br/><br/>Others began to voice their agreement, and soon, several customers who had been waiting in line decided to leave, heading toward the Feng Clan's shop instead.<br/><br/>The shopkeeper's face twisted with anger, but there was little he could do as more and more<br/><br/>people decided to take their business elsewhere.<br/><br/>The captain, now standing on his own two feet, turned to his comrades with a grateful smile.<br/><br/>\"Thank you! And to think, the Feng Clan's pills were what saved me. We should head over there and stock up while we still can.\"<br/><br/>The group nodded in agreement, and as they exited the Yan Clan's shop, the once-crowded<br/><br/>store began to empty, with the Feng Clan's name spreading rapidly among the customers. The Yan Clan's shopkeeper could only watch in frustration as his customers left, the dominance of the Yan Clan's marketplace slowly but surely slipping away.\t\t\t\t\t\t</div>", "images": {}, "success": true}