{"id": 37, "url": "https://www.novelhall.com/my-brothers-the-protagonist-good-thing-i-awakened-my-system-33973/14946581.html", "title": "Chapter 37: Pill Of Ascension!", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 37: Pill Of Ascension!</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 37: Pill Of Ascension!\"No, this is impossible! How could the Feng Clan have so many Grand Qi Condensation Realm Cultivators?\"<br/><br/>\"These guys must have taken some forbidden pills to increase their realm. Otherwise, it wouldn't be possible for them to step into the Grand Qi Condensation Realm.\"<br/><br/>The Elders from Yan, Zhao, and Liu couldn't believe their eyes.<br/><br/>Yan Zhan's face paled, thinking of the horror it might have been if he hadn't prepared well.<br/><br/>(Good thing I have support from Elder Zhou Lei and Elder Zhou Tianhua! So what if you have more Grand Qi Condensation powerhouse than me? You all are going to die anyway!)<br/><br/>Yan Zhan thought while also feeling relieved.<br/><br/>If it had been any other time, he wouldn't have hesitated to run away after knowing that the Feng Clan had seven Grand Qi Condensation Realm experts.<br/><br/>After all, the Yan Clan didn't even have half as many cultivators in the Grand Qi Condensation Realm as the Feng Clan.<br/><br/>However, today, because he had the help of the Three Elements Divine Realm, he was still confident in destroying the Feng Clan and refused to back down.<br/><br/>\"Surrender! Even if we have an equal number of Grand Qi Condensation Realms, our cultivation is higher than yours.<br/><br/>Yan Zhan said. Feng Clan's Grand Elders were mostly in the Early and Mid-Level Grand Qi Condensation Realm.<br/><br/>On the other hand, Yan, Zhao, and Liu head were all in the Top-Level Grand Qi Condensation Realm.<br/><br/>\"Enough of the talk!\"<br/><br/>Feng Zhenshan said coldly.<br/><br/>\"You all dared attack our Feng Clan and expect us to surrender. Yan Zhan, Oh Yan Zhan, you underestimate us too much!\"<br/><br/>With a wave of his hand, Feng Zhenshan launched himself forward, his movements swift as lightning.<br/><br/>\"Earth Shattering Palm!\"<br/><br/>The ground beneath him cracked under the force of his leap, and he aimed a powerful punch at Yan Zhan, who was quick to retaliate.<br/><br/>\"Blazing Sky Strike!\"<br/><br/>Yan Zhan shouted, his fist enveloped in a roaring flame as he met Feng Zhenshan's attack head-on.<br/><br/>The collision of their strikes sent shockwaves rippling through the air, pushing back the surrounding elders from both sides.<br/><br/>The alley erupted into chaos as both sides sprang into action. The Feng Clan's elders charged into the fray with battle cries, their Qi flaring brightly.<br/><br/>\"Heavenly Emperor's Sword!\"<br/><br/>\"Earth Shattering Palm!\"<br/><br/>\"Ghostly Shadow Mirage!\"...<br/><br/>In response, the Yan, Zhao, and Lui elders unleashed their own powerful techniques, creating a tempest of elemental attacks that illuminated the alley in flashes of fire, ice, and lightning.<br/><br/>The battle was fierce and unrelenting, the ground beneath their feet quaking with every clash. The deafening roar was resounded in Misty Vale City.<br/><br/>The air was thick with the sounds of metal clashing, Qi explosions, and the occasional shout of pain as both sides exchanged heavy blows.<br/><br/>Despite having lower cultivation than their enemies, the Feng Clan elders who had learned the Heaven Grade Technique were not only able to fight as equals but also gain the upper hand in the battle.<br/><br/>The strongest person present in the battle was Yan Zhan but that same Yan Zhan was facing a problem against Feng Zhenshan.<br/><br/>Although Yan Zhan was able to defend against Feng Zhenshan's attack, he was unable to deal much damage to Zhenshan because of his Heaven Grade Defense Technique, Mysterious Heaven Iron Wall.<br/><br/>Despite the initial confidence of the Yan, Zhao, and Lui clans, it quickly became apparent that the Feng Clan was no ordinary opponent.<br/><br/>The elders of the Feng Clan, with their mastery of Heaven Grade Techniques began to slowly turn the tide of battle.<br/><br/>(I can't believe we're losing to them! If this continues, we'll be wiped out!)<br/><br/>Seeing his side losing ground, Yan Zhan knew he had to change tactics. He couldn't let this battle slip away; the reputation and future of the Yan Clan depended on it.<br/><br/>\"Damn it!\"<br/><br/>Yan Zhan spat, his eyes narrowing in determination.<br/><br/>With a swift motion, Yan Zhan reached into his storage ring and pulled out a small jade vial, his expression resolute.<br/><br/>\"Enough playing around! Everyone, take the pills!\"<br/><br/>Yan Zhan commanded, his voice echoing through the alley.<br/><br/>He initially wanted to save this pill for when Feng Chen showed up and had hoped that he could take care of him without getting Elder Zhou Tianhua involved.<br/><br/>However, looking at the situation, it seems like they can't handle Feng Clan's Grand Elder without using the Pill of Ascension.<br/><br/>The elders of the Yan, Zhao, and Lui Clans quickly followed suit, retrieving similar vials and swallowing the pills inside without hesitation.<br/><br/>Immediately, a surge of powerful Qi erupted from their bodies, their auras intensifying dramatically.<br/><br/>Yan Zhan's eyes burned with a fierce glow as the pill's effects took hold. His cultivation base surged, breaking through its previous limits and advancing by one minor realm.<br/><br/>Now, he was in the Peak Grand Qi Condensation Realm!<br/><br/>With their enhanced power, the Yan, Zhao, and Lui elders launched a renewed assault on the<br/><br/>Feng Clan.<br/><br/>BANG! BANG!<br/><br/>Yan Zhan's speed and strength had almost doubled, his fiery strikes now leaving deep scorch marks in the stone ground as he charged at Feng Zhenshan.<br/><br/>Others had also started to aggressively attack the Feng Clan's Grand Elders and the battlefield had changed once more.<br/><br/>\"Damn! What kind of pill was that? Every one of them had advanced by one minor Realm!\"<br/><br/>\"Looks like the Feng Clan will be destroyed. I thought that they had a chance but the other Major Families were also hiding their trump cards.\"<br/><br/>The onlookers commented. This battle has been beyond their imagination. Firstly, they thought Feng Clan would lose but then they dominated with their powerful martial art. Just when they thought Feng Clan would win, their opponent took out some pills which immediately raised their cultivation.<br/><br/>In any case, they knew that the Major Family wasn't someone that they could challenge.<br/><br/>CLANG! CLANG!<br/><br/>The Feng Clan Grand Elders, caught off guard by the sudden surge in power from their opponents, found themselves momentarily on the back foot.<br/><br/>Feng Zhenshan was pushed back by Yan Zhan's relentless onslaught, the powerful strikes<br/><br/>hammering at his defenses.<br/><br/>\"Haha! With the effects of these pills, you Feng Clan dogs are no match for us!\"<br/><br/>Yan Zhan laughed maniacally, his confidence restored as he pressed the attack.<br/><br/>But Feng Zhenshan merely smirked, his eyes glinting with a knowing light.<br/><br/>\"Did you really think only you have an Alchemist? Everyone, take the pill as well!\" seaʀᴄh thё Novёlƒire.n(e)t website on Google to access chapters of novels early and in the highest quality.<br/><br/>In his words, the other Feng Clan Grand Elders also retrieved pills from their storage ring. This was the same Pill Of Ascension that Yan Zhan and others took.<br/><br/>However, any skilled alchemist would notice the difference in the quality between the two<br/><br/>pills.<br/><br/>With the Ethereal Frost Flame, the potency of the Pill of Ascension used by Feng Clan's Grand Elder has been significantly enhanced.<br/><br/>Without hesitation, they swallowed the pills, and immediately, their auras flared up, their strength and Qi increasing significantly.<br/><br/>However, instead of a single minor realm, the Feng Grand Elders experienced an increase of<br/><br/>two minor realms.<br/><br/>Yan Zhan's expression shifted from triumph to shock as he watched the Feng Clan elders' power surge to surpass theirs.<br/><br/>\"Impossible! You had pills too? Moreover, you advance by two minor realms!\"<br/><br/>Feng Zhenshan's smirk widened.<br/><br/>\"Did you really think you were the only ones with access to such things? The Feng Clan is not<br/><br/>so easily outdone!\"<br/><br/>With their newfound strength, the Feng Clan Grand Elders launched their counterattack.<br/><br/>Feng Zhenshan, now radiating an intense golden light, met Yan Zhan's fiery blows with even<br/><br/>greater force, his Earth Shattering Palm smashing through Yan Zhan's defenses and sending him reeling back once more.<br/><br/>The clash of enhanced powers from both sides created a spectacle that left the onlookers in<br/><br/>awe and fear.<br/><br/>However, it quickly became apparent that the Feng Clan Grand Elders were dominating the battle even more than before.<br/><br/>Previously, Feng Clan Grand Elders were already somewhat stronger than their opponent but now that they have taken more superior quality pills, the gap widened even more.<br/><br/>Yan Zhan, now on the back foot, found himself unable to keep up with Feng Zhenshan's relentless assault.<br/><br/>Every strike he threw was met with a more powerful counter, and every defense he put up was<br/><br/>shattered by the Grand Elder's might.<br/><br/>The elders of the Zhao and Lui Clans fared no better, their combined efforts failing to break<br/><br/>through the coordinated attacks of the Feng Clan.<br/><br/>\"T-This can't be!\"<br/><br/>\"How can the Feng Clan be so much stronger!\"<br/><br/>Liu and Zhao Clan complained while also regretting their action. They had no more trump<br/><br/>cards, and if nothing changed, they were bound to be dead.<br/><br/>-BOOM!<br/><br/>A powerful shockwave erupted from the clash of enhanced powers, causing the ground to<br/><br/>tremble and the air to vibrate.<br/><br/>Amidst the chaos, a new figure suddenly appeared on the scene, his aura radiating an overwhelming force that immediately pressurized even Yan Zhan and Feng Zhenshan. It was Elder Zhou Tianhua, stepping into the battle. \"Tsk! I didn't think that you all would require my help this quickly!\"\t\t\t\t\t\t</div>", "images": {}, "success": true}