{"id": 36, "url": "https://www.novelhall.com/my-brothers-the-protagonist-good-thing-i-awakened-my-system-33973/14946580.html", "title": "Chapter 36: Unveiling The Hidden Strength!", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 36: Unveiling The Hidden Strength!</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 36: Unveiling The Hidden Strength!In the alley, Elder Luo readied himself to attack again.<br/><br/>Although Grand Elder Zhenshan was in the same realm as him, he thought that since he had been in that realm for longer, he should be stronger.<br/><br/>\"Take this! Scarlet Inferno Palm!\"<br/><br/>With a thunderous roar, Elder Luo thrust his hand forward, releasing a blazing wave of fiery energy.<br/><br/>The crimson flames erupted from his palm, expanding outward like a massive, searing tsunami, aimed directly at Feng Zhenshan.<br/><br/>The inferno roared through the alley, its heat scorching the stone walls and setting anything combustible aflame.<br/><br/>The destructive force of the Scarlet Inferno Palm surged toward Feng Zhenshan with the intent to incinerate everything in its path, leaving nothing but ashes behind.<br/><br/>Elder Luo's eyes gleamed with a deadly resolve, confident that this attack would overpower the Grand Elder of the Feng Clan.<br/><br/>\"Hmph! Do you think you can take me on with such a pathetic attack?\"<br/><br/>\"Earth Shattering Palm!\"<br/><br/>A deep rumble emanated from beneath Feng Zhenshan's feet as the ground around him began to quake.<br/><br/>In an instant, a colossal, earthen palm formed in front of him, forged from the surrounding stones and soil.<br/><br/>The massive palm, glowing with an intense brownish-gold hue, thrust forward with unstoppable force, meeting the oncoming blaze head-on.<br/><br/>-BOOM!<br/><br/>The collision of the Earth-Shattering Palm and the Scarlet Inferno Palm resulted in a massive explosion.<br/><br/>It was certain that their confrontation must have been sensed by almost all the powerhouses of Misty Vale City.<br/><br/>As the dust settled, Feng Zhenshan's Earth Shattering Palm emerged victorious, having absorbed the brunt of the Scarlet Inferno Palm and dispersed its flames.<br/><br/>However, the aftermath of the clash wasn't without consequences.<br/><br/>Elder Luo, who had been confident in his attack, was forced to shield himself from the shockwave.<br/><br/>The remnants of the Earth Shattering Palm continued to push forward, slamming into Elder Luo and sending him stumbling back several steps.<br/><br/>He gritted his teeth, feeling the sting of minor cuts and burns on his arms and face, but managed to steady himself.<br/><br/>Feng Zhenshan, too, was not entirely unscathed. The intense heat and force of the Scarlet Inferno Palm had left scorch marks on his robes and a few minor burns on his hands.<br/><br/>Despite the injuries, he stood tall, his eyes still fierce and unwavering.<br/><br/>Elder Luo wiped the blood from the corner of his mouth, his expression darkening with frustration.<br/><br/>\"You... How could you have such strength?!\"<br/><br/>He spat, realizing that he had underestimated his opponent.<br/><br/>Feng Zhenshan's gaze was cold and unyielding.<br/><br/>\"There are many things that you don't know. You all have truly underestimated the Feng Clan and that will be the reason for your downfall.\"<br/><br/>He said calmly, his voice carrying a hint of disdain.<br/><br/>(If Chen'er decides to take action, you all will not even be standing here!)<br/><br/>Zhenshan thought to himself.<br/><br/>He knew that Feng Chen was a person of morals who wouldn't start murdering others just because he was stronger.<br/><br/>However, that didn't mean he was weak-hearted. As long as enough reason was given, he didn't hesitate.<br/><br/>The two dead elders of the Yan Clan were one of the prime examples.<br/><br/>Now that the Yan Clan dared to assassinate Feng Yun and Feng Mei, he knew that the Yan Clan's days were numbered.<br/><br/>Elder Luo's mind raced, calculating his next move. The battle had just begun, but already he could feel the tides turning against him.<br/><br/>\"I didn't expect that the Feng Clan was hiding someone like you!\"<br/><br/>Just then, Yan Zhan entered the alley. With him were all the elders from the Yan Clan as well Zhao and Lui Families.<br/><br/>It seemed like they were no longer able to just observe as the odds were stacked against them. They knew from that confrontation that Elder Luo wouldn't be able to succeed and decided to join the battle.<br/><br/>Now that it had come to this stage, they decided to go all out and eradicate the Feng Clan directly, starting with Feng Zhenshan, Feng Yun, and Feng Mei.<br/><br/>At that moment, many of the other powerhouses had also sensed the confrontation between Feng Zhenshan and Elder Luo and were watching them from a safe distance.<br/><br/>\"Yan, Zhao, and Lui Clan's powerhouse are all gathered.\"<br/><br/>\"It seems like they want to take care of the Feng Clan!\"<br/><br/>\"Feng Clan influence has been increasing with their juniors winning the Annual Genius Competition and having Second Grade Alchemist. It seems like other Major Families couldn't stand it any longer.\"<br/><br/>\"Sigh! I was able to make a huge profit thanks to Feng Clan's Rank-2 Pills. I hope that they can survive this disaster.\"<br/><br/>Those powerhouses just stood watching, feeling pity for the Feng Clan especially those who benefited from them.<br/><br/>However, looking at the lineup from Feng Clan's enemy side, they knew that the chances of Feng Clan survival was very low.<br/><br/>\"Yan Clan as well as people from Zhao and Lui Clan? Hehe... Looks like there will be only two Major families after this!\"<br/><br/>Feng Zhenshan said.<br/><br/>Instead of being afraid of the people who arrived, Feng Zhenshan instead was more excited which confused both Yan Zhan and those who were just observing.<br/><br/>Many of them thought that Feng Clan's Grand Elder might have become crazy due to fear.<br/><br/>After all, in front of the combined strength of the Yan, Zhao, and Lui families, anyone from Misty Vale City would be scared to death.<br/><br/>\"Hmph! Looks like you can't see the reality in front of you. You as well as the rest of the Feng<br/><br/>Clan will be killed today!\"<br/><br/>Yan Zhan said arrogantly.<br/><br/>\"Hehe! Destroy the Feng Clan? With what? Your measly cultivation?\"<br/><br/>Feng Zhenshan mocked.<br/><br/>Yan Zhan's face twisted with anger at Feng Zhenshan's audacious mockery. Sёarᴄh the nôᴠel Fire.nёt website on Google to access chapters of novels early and in the highest quality.<br/><br/>He took a step forward, his aura flaring up with menacing intent, ready to unleash his power.<br/><br/>The tension in the alley grew even thicker, and the onlookers from Misty Vale City watched in stunned silence, waiting for the inevitable clash.<br/><br/>\"Your arrogance will be the end of you. Do you really think you can stand against the combined might of three Major Clans? Today, the Feng Clan will be erased from history!\"<br/><br/>Yan Zhan declared loudly.<br/><br/>Feng Zhenshan chuckled softly, the sound unnervingly calm amidst the rising tension.<br/><br/>His eyes glinted with a dangerous light as he gazed at Yan Zhan and the gathered elders of the<br/><br/>Yan, Zhao, and Lui Clans.<br/><br/>\"Yan Zhan, you think bringing a few people will intimidate the Feng Clan?\"<br/><br/>Feng Zhenshan's voice was steady, his confidence unwavering.<br/><br/>\"You are gravely mistaken if you believe that the Feng Clan has shown all its cards. If you<br/><br/>think you can eradicate us so easily, you're about to witness a truth that will shatter your<br/><br/>arrogance!\"<br/><br/>As he finished speaking, Feng Zhenshan lifted his hand and snapped his fingers, a sharp sound<br/><br/>echoing through the alley.<br/><br/>Suddenly, the ground began to tremble, and the air vibrated with a surge of powerful Qi.<br/><br/>From the shadows of the alley, five figures emerged, each one exuding an imposing aura that matched, if not surpassed, that of the Yan, Zhao, and Lui Clan elders.<br/><br/>The onlookers gasped in astonishment as they sensed the aura of the newcomers- Grand Qi<br/><br/>Condensation Realm.<br/><br/>\"Apologies for the delay, Zhenshan.\"<br/><br/>Feng Zhilan said with a faint smile, her voice as calm as a breeze.<br/><br/>\"We waited for these bastards to show up first!\"<br/><br/>Feng Liwei crossed his arms over his chest, his expression filled with rage as he surveyed the<br/><br/>enemies.<br/><br/>He and the others were already there when Elder Luo had already made a move. The only<br/><br/>reason why they didn't show up was because they wanted the enemies to reveal themselves<br/><br/>first.<br/><br/>\"So, the three Major Families have finally made their move. We had to wait quite a long time<br/><br/>for this!\"<br/><br/>Feng Liancheng said thinking that they could finally take care of these hateful beings.<br/><br/>The presence of the Feng Clan's Grand Elders shifted the atmosphere entirely. What was once a confrontation that seemed heavily weighted against the Feng Clan now appeared far more balanced.<br/><br/>The gathered onlookers whispered among themselves, stunned by the sudden turn of events. \"Who would have thought the Feng Clan had this much strength hidden away?\" \"Damn! Five more Grand Qi Condensation Realm Elders from Feng Clan? And here I thought<br/><br/>that the Feng Clan only had Feng Chen.\"<br/><br/>\"It seems like it would be very difficult for Yan, Zhao, and Lui Clan to deal with the Feng Clan. And if Feng Chen joins the battle, they might even be destroyed instead.\"<br/><br/>Many of the onlookers were shocked to see the power of Feng Clan's Grand Elder. They now realized just how much they had been underestimating the Feng Clan.<br/><br/>They thought Feng Clan was the weakest of the Five Major Families, instead they turned out to be the strongest!\t\t\t\t\t\t</div>", "images": {}, "success": true}