{"id": 35, "url": "https://www.novelhall.com/my-brothers-the-protagonist-good-thing-i-awakened-my-system-33973/14946579.html", "title": "Chapter 35: Grand Qi Condensation Realm Cultivators Enters!", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 35: Grand Qi Condensation Realm Cultivators Enters!</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 35: Grand Qi Condensation Realm Cultivators Enters!Hearing the decisive command from Yan Zhan, Elder Luo did not hesitate for a moment.<br/><br/>A ruthless gleam flickered in his eyes as he tapped into his full strength, releasing an overwhelming aura that made the very ground tremble.<br/><br/>The oppressive energy surged outward, creating a gust of wind that swept through the alley, causing debris to fly.<br/><br/>-BOOM!<br/><br/>Without a moment's delay, Elder Luo leaped into the center of the battlefield, landing with a resounding crash that sent shockwaves rippling through the ground.<br/><br/>The sheer force of his arrival caused cracks to appear through the stone beneath his feet.<br/><br/>His presence was like a dark storm descending upon the area, suffocating everything within a hundred-meter radius with his terrifying pressure.<br/><br/>This immediately stopped the two groups from fighting.<br/><br/>\"E-Elder!\"<br/><br/>The assassins called out in fear. If the Elder was getting involved, that means that they had failed with their task.<br/><br/>\"Trash, can't even complete such an easy task!\"<br/><br/>Elder Luo said in anger. Now that he has gotten himself involved, Yan Clan's involvement in this assassination couldn't be covered.<br/><br/>The assassins lowered their heads, unable to retort. True, they should consider themselves trash since they couldn't even kill two young people who have lower cultivation and less number than them.<br/><br/>Elder Luo didn't want to waste his time on that group of weaklings and immediately turned his attention towards his prey.<br/><br/>\"Impressive, truly impressive!\"<br/><br/>Elder Luo sneered, his eyes narrowing as he looked at Feng Yun and Feng Mei with a mix of envy and disdain.<br/><br/>\"For mere juniors of the Feng Clan, you've shown remarkable prowess. Not only have you reached such a high level in your cultivation, but your combat skills are quite formidable.\" He raised a hand, his fingers crackling with a vibrant energy that seemed to pulse with life. \"But, you see, being born into the Feng Clan has sealed your fate. And it's time for that fate to be fulfilled. Prepare to die for this Elder!\"<br/><br/>With a fierce roar, Elder Luo thrust his palm forward. His Qi and blood surged together, forming a blazing crimson light that shot out like a beam of molten lava.<br/><br/>The energy transformed into a massive palm, dozens of feet wide, that seemed to blot out the sky as it descended upon Feng Yun and Feng Mei.<br/><br/>The palm radiated intense heat, its surface glowing like the sun, and it moved with the force of a mountain falling from the heavens.<br/><br/>Feng Yun's eyes widened as he saw the enormous palm hurtling towards them. The sheer size and power of the attack were unlike anything he had faced before.<br/><br/>The pressure was suffocating, making it difficult to breathe, and the heat was so intense that the very air seemed to sizzle.<br/><br/>\"Feng Mei, watch out!\"<br/><br/>Feng Yun shouted, his voice barely audible over the roaring energy of the incoming attack. He knew that they couldn't withstand such a powerful blow directly.<br/><br/>They had to evade it, or they would be crushed.<br/><br/>However, under the enormous pressure of the attack, Feng Yun and Feng Mei were unable to move, much less dodge the attack.<br/><br/>(Master Minghao, help me, or else this disciple of yours will die!)<br/><br/>Feng Yun said to Master Minghao, in the hope that he might be able to save them. However, there was no response from his master which made Feng Yun lose his only hope.<br/><br/>(Could it be that I am going to die today? No, I still have many things that I need to do. I can't die yet!)<br/><br/>Feng Yun struggled to his feet, his eyes blazing with determination. Despite the pain and exhaustion, he refused to back down.<br/><br/>He knew they were in a desperate situation, but he wasn't about to give up. Not when Feng Mei's life was also in danger.<br/><br/>-BOOM!<br/><br/>Before he could think of a plan, another attack suddenly appeared, dissipating Elder Luo's strike.<br/><br/>\"Hmph! Do you think that our Feng Clan is dead? How dare you attack Yun'er and Mei'er!\" From the shadows of the alley, a figure stepped forward, his aura powerful and full of anger. \"Who dares to interfere?\"<br/><br/>Elder Luo barked, his gaze snapping towards the newcomer. He knew from the fact that he helped Feng Yun and Feng Mei, that it was his enemy.<br/><br/>He was also a bit nervous and scared thinking that Feng Chen might have appeared.<br/><br/>The man didn't respond immediately. He simply raised a hand, and with a simple gesture, the<br/><br/>dust and debris swirling around the battlefield settled, revealing his face.<br/><br/>It was a face that Feng Yun recognized instantly.<br/><br/>\"Granduncle Zhenshan!\"<br/><br/>Feng Yun exclaimed, his eyes widening in shock and relief.<br/><br/>(Master Minghao should have already sensed Granduncle Zhenshan's presence. Hah, he should have at least told me. Scared me to death!)<br/><br/>Feng Yun thought as he felt relieved.<br/><br/>\"Yun'er! Mei'er! Are you alright?\"<br/><br/>Feng Zhenshan asked worriedly.<br/><br/>Feng Yun and Feng Mei both nodded and indeed there was no fatal injury on their bodies. Feng Zhenshan's eyes narrowed, his gaze shifting to Elder Luo, who stood with a surprised expression on his face.<br/><br/>However, at that moment, Elder Luo stood still and was deeply thinking.<br/><br/>(Feng Zhenshan? The Grand Elder of Feng Clan? But, wasn't he just in the Core Formation Stage? Has he finally broken through?)<br/><br/>Being in the Major Family, Elder Luo obviously heard about Feng Zhenshan, but he had just never expected him to advance to the Grand Qi Condensation Realm.<br/><br/>\"How dare the Yan Clan stoop to such cowardly tactics?\"<br/><br/>Feng Zhenshan's voice was cold, laced with contempt.<br/><br/>\"Not only attacking our juniors in an ambush but also getting Grand Qi Condensation Realm Elder involved. Is this how the mighty Yan Clan fights now?\"<br/><br/>Hearing those words, Elder Luo snapped out of his initial surprise and quickly regained his<br/><br/>composure.<br/><br/>\"Spare me the righteous indignation. Today, no matter who appears, nobody can save them!\" Sёarᴄh the ηovёlFire .net website on Google to access chapters of novels early and in the highest quality.<br/><br/>Elder Luo said with a sneer.<br/><br/>On the Yan Zhan side, the revelation of Feng Zhenshan's Cultivation Realm shocked many of<br/><br/>them.<br/><br/>\"There is another one beside Feng Chen in the Feng Clan who is in the Grand Qi Condensation<br/><br/>Realm?\"<br/><br/>\"Feng Clan is hiding too deeply. If not for this assassination, we might have never known that the Feng Clan has another Grand Qi Condensation Realm.\"<br/><br/>\"It seems like we need to be cautious when dealing with the Feng Clan.\"<br/><br/>The Elders from Yan, Zhao, and Lui Families discussed.<br/><br/>It was not only the fact that the Feng Clan had another Grand Qi Condensation Realm but also the fact that the Feng Clan had hidden this information from the world that surprised them.<br/><br/>One should know that in Misty Vale City, the Grand Qi Condensation Realm is the highest and therefore if one clan has someone who advances to that Realm, they would announce it to the City and invite other clans in celebration.<br/><br/>This was typically done to show off their power and increase their influence in the city. So they were surprised that the Feng Clan was hiding such a powerhouse.<br/><br/>If the Feng Clan could conceal a Grand Qi Condensation Realm expert like Feng Zhenshan, who<br/><br/>knows what other secrets they might still be hiding?<br/><br/>A bigger surprise might yet be in store.\t\t\t\t\t\t</div>", "images": {}, "success": true}