{"id": 33, "url": "https://www.novelhall.com/my-brothers-the-protagonist-good-thing-i-awakened-my-system-33973/14946577.html", "title": "Chapter 33: On A Date!", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 33: On A Date!</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 33: On A Date!\"This brother of mine finally grew some conscience!\"<br/><br/>Feng Yun said.<br/><br/>For the past few days, he had been driven hard and had to work tirelessly to produce Rank-2 Pills.<br/><br/>Though he voiced his complaints, they were only surface-level; in his heart, he was genuinely happy to be helping his brother, who had always worked hard to help the clan.<br/><br/>Nonetheless, he was really excited today as he was finally rich and had a day off to spend his money.<br/><br/>He has earned quite a lot of money from the profit made by the pills. 50% of the profit made from his pills was given to him.<br/><br/>Although he declined at first because he felt it was his responsibility as a Feng Clan member, elders insisted that it was what he deserved.<br/><br/>He also said that Clan's profit from other sectors has also increased due to his pills, so he shouldn't hesitate to accept this money.<br/><br/>In total, he already has more than 50,000 Gold Coins in his storage ring.<br/><br/>This was more than what a second-rated clan would earn in a year, showing just how profitable it was to be an Alchemist though it was equally difficult to be one.<br/><br/>\"Hehe! Brother Yun, you've worked hard!\"<br/><br/>Feng Mei said, holding onto Feng Yun's arm.<br/><br/>Today, Feng Mei was especially cheerful. For days, she had controlled herself, not wanting to disturb Feng Yun while he was working so diligently.<br/><br/>She knew how important his role was to the clan's recent success and didn't want to be a distraction, despite missing him dearly.<br/><br/>\"Finally, I have you all to myself,\" Feng Mei said with a playful smile, her eyes sparkling with happiness as she clung to Feng Yun's arm.<br/><br/>Feng Yun chuckled softly, a warm smile spreading across his face.<br/><br/>As they strolled through the bustling streets of Misty Vale City, Feng Yun and Feng Mei enjoyed the lively atmosphere around them.<br/><br/>The market was filled with colorful stalls selling everything from exotic spices to fine silks, and the air was rich with the scents of freshly cooked street food.<br/><br/>Feng Mei was delighted to explore the various stalls, her eyes sparkling with curiosity.<br/><br/>Feng Yun, seeing her excitement, couldn't help but smile. He felt a sense of contentment just being by her side.<br/><br/>As they passed by a jeweler's stall, Feng Yun noticed a beautiful necklace displayed prominently at the front.<br/><br/>It was a delicate piece with a small, intricately carved jade pendant that seemed to glow in the sunlight. The craftsmanship was exquisite, and it immediately caught his eye.<br/><br/>Feng Yun gently pulled Feng Mei towards the stall. \"Wait here for a moment,\" he said with a grin, stepping up to the jeweler.<br/><br/>\"Good day, sir! That necklace there, how much for it?\"<br/><br/>Feng Yun asked, pointing to the jade pendant.<br/><br/>The jeweler, an elderly man with a keen eye for business, smiled warmly.<br/><br/>\"Ah, you have good taste, young master. This is a special piece, made from the finest jade. For you, I'll offer a fair price.\"<br/><br/>After a bit of haggling, Feng Yun finally purchased the necklace and returned to Feng Mei with a twinkle in his eye.<br/><br/>\"Here, Mei'er, I got something for you.\"<br/><br/>Feng Mei looked at him, surprised.<br/><br/>\"What? For me?\"<br/><br/>Feng Yun nodded, holding out the necklace.<br/><br/>\"I thought it would look beautiful on you.\"<br/><br/>Feng Mei blushed, touched by the gesture.<br/><br/>\"It's beautiful, Brother Yun. Thank you!\"<br/><br/>She took the necklace and, with a shy smile, asked, \"Can you help me put it on?\"<br/><br/>Feng Yun nodded, gently taking the necklace and placing it around her neck.<br/><br/>As he fastened the clasp, his fingers lightly brushed against her skin, causing Feng Mei to shiver slightly.<br/><br/>Once the necklace was in place, she turned to face him, her face glowing with happiness.<br/><br/>\"How does it look?\" she asked, her voice soft.<br/><br/>Feng Yun gazed at her, captivated.<br/><br/>\"Beautiful!\"<br/><br/>Feng Mei blushed, lowering her eyes shyly as a beautiful smile spread across her face. They continued their leisurely stroll through the market, with Feng Mei occasionally touching the necklace, a constant reminder of Feng Yun's thoughtful gift.<br/><br/>As the sun began to set, casting a warm golden hue over the city, Feng Yun suggested they start heading back to the Feng Clan estate.<br/><br/>Feng Mei agreed, and they made their way down a quieter street, away from the bustling main market.<br/><br/>But as they turned a corner, Feng Yun's instincts suddenly flared. He stopped in his tracks, pulling Feng Mei behind him protectively.<br/><br/>His eyes scanned the surroundings, noting the unnatural silence and the slight rustling of<br/><br/>leaves above.<br/><br/>\"Brother Yun, what's wrong?\"<br/><br/>Feng Mei whispered, sensing his tension.<br/><br/>Before Feng Yun could answer, several figures emerged from the shadows, surrounding<br/><br/>them.<br/><br/>Each one was clad in dark robes, their faces hidden beneath hoods. The air around them crackled with menacing energy, and Feng Yun immediately recognized the hostile intent in<br/><br/>their eyes.<br/><br/>\"An ambush!\"<br/><br/>Feng Yun muttered under his breath, his expression hardening.<br/><br/>(It looks like they are all in the Core Formation Stage!)<br/><br/>Feng Yun knew from the strength of these men that it wasn't some simple robbery and that<br/><br/>they had planned this.<br/><br/>The leader of the ambushers stepped forward, a sneer visible under his hood.<br/><br/>\"If you don't want to die painfully, I suggest you don't struggle!\"<br/><br/>Feng Yun knew instantly that these men had to be from the Yan Clan. No other group in Great<br/><br/>Yan City would dare to ambush members of the Feng Clan in broad daylight.<br/><br/>Feng Yun's eyes narrowed, his expression becoming icy as he stared down the hooded figures.<br/><br/>\"I should have expected this from the Yan Clan.\" Searᴄh the Nôvelƒire.net website on Google to access chapters of novels early and in the highest quality.<br/><br/>Feng Yun said, his voice dripping with disdain.<br/><br/>\"Only they would be so desperate to try something like this.\"<br/><br/>The leader of the ambushers smirked at Feng Yun's words but didn't deny it.<br/><br/>\"It doesn't matter who we are,\" the leader said with a menacing tone.<br/><br/>\"All that matters is that you're going to die today!\"<br/><br/>Feng Yun's grip on Feng Mei tightened as he positioned her protectively behind him. He knew<br/><br/>they were outnumbered and that their attackers were strong.<br/><br/>(It looks like Yan Clan has already found out that I am a second-grade alchemist. If so, their<br/><br/>target should be me!)<br/><br/>\"Mei, if you get the chance, run immediately towards the Clan.\" Feng Yun instructed, his<br/><br/>voice calm but firm.<br/><br/>\"I'll stall them!\"\t\t\t\t\t\t</div>", "images": {}, "success": true}