{"id": 32, "url": "https://www.novelhall.com/my-brothers-the-protagonist-good-thing-i-awakened-my-system-33973/14946576.html", "title": "Chapter 32: Feng Clan'S Secret Out!", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 32: Feng Clan'S Secret Out!</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 32: Feng Clan's Secret Out!In the Yan Clan's meeting hall, the atmosphere was heavy with tension and frustration, clearly visible on every face.<br/><br/>Yan Zhan sat at the head of a large, dark wooden table, his expression dark and gloomy.<br/><br/>Around him, the elders of the clan were gathered, each looking equally grim.<br/><br/>The sound of the heavy rain outside seemed to echo the turmoil within the room.<br/><br/>-BANG!<br/><br/>Yan Zhan slammed his fist onto the table, causing the sturdy wood to crack under the force.<br/><br/>\"How could this happen?\"<br/><br/>He roared, his eyes blazing with fury.<br/><br/>\"How is Feng Clan still affording to keep the prices of Rank-2 pills at such a low price?\"<br/><br/>The elders exchanged worried glances, each feeling the weight of Yan Zhan's anger. Sёarch* The NovelFire.net* website on Google to access chapters of novels early and in the highest quality.<br/><br/>They had been confident in their superiority over the Feng Clan, but the recent turn of events had left them scrambling for solutions.<br/><br/>\"Patriarch, it is indeed puzzling. How can the Feng Clan sustain this strategy? It has already been one week and yet they still show no signs of raising their prices. If we continue like this, our clan will soon go into debt.\"<br/><br/>They had anticipated that the Feng Clan would falter quickly, unable to sustain the competitive prices without suffering significant losses.<br/><br/>But to their dismay, the opposite had happened.<br/><br/>The Feng Clan continued to sell their pills at prices even lower than theirs, seemingly unaffected by the financial strain. And on the other hand, their Yan Clan was running at a loss.<br/><br/>\"Our calculations show that at these prices, we are running at a loss. We are able to keep these prices only because of our reserves. But the Feng Clan, how could they keep up with our resources? How is this possible?\"<br/><br/>Yan Zhan's face darkened further as he absorbed the elders' words.<br/><br/>They were running on loss day by day and the only thing that they could hope for was that the Feng Clan would give in and raise the prices of their pills.<br/><br/>However, after so many days, Feng Clan showed no sign of changing the price. Yan Zhan assumed that Feng Clan wasn't running on a loss like them.<br/><br/>\"Could it be that the Feng Clan has found a way to produce these pills at a lower cost than we can?\"<br/><br/>\"Perhaps they've discovered a cheaper source of ingredients or developed a method to refine the pills more efficiently.\"<br/><br/>The Elders discussed the possibility.<br/><br/>They knew that, if they both were running on the same loss, with Feng Clan's financial situation, they would have already gone bankrupt.<br/><br/>\"That can't be possible!\"<br/><br/>Elder Zhou Tianhua intervened angrily, his pride obviously hurt.<br/><br/>He couldn't accept that a small clan like Feng would have an Alchemist whose skill was greater than his.<br/><br/>\"Elder Zhou Tianhua is right! The Alchemist isn't better than Elder Zhou Tianhua, otherwise, they would have started selling Rank-3 pills.\"<br/><br/>Yan Zhan spoke quickly, casting a pointed glance at the elders.<br/><br/>He understood their immense pride as alchemists and knew they would never admit to being inferior to other alchemists even if that was the truth.<br/><br/>Moreover, as he said, there shouldn't be much difference in the efficiency of the alchemist unless the Feng Clan brought out a third-grade alchemist.<br/><br/>And he already has the information on who that Alchemist could be though he didn't want to believe it.<br/><br/>\"Ahem! Everyone, after spending a lot of resources, I finally got the identity of the Second Grade Alchemist of the Feng Clan.\"<br/><br/>Yan Zhan said.<br/><br/>\"What?\"<br/><br/>\"Really?\"<br/><br/>\"Who is it?\"<br/><br/>The elders immediately perked up at the mention of this information, fully aware of the importance of knowing their opponents.<br/><br/>Yan Zhan paused for a bit before speaking. Even now, he couldn't believe the information that he got.<br/><br/>\"Feng Yun!\"<br/><br/>A shocked silence fell over the Yan Clan's meeting hall. The elders exchanged bewildered glances, struggling to comprehend what they had just heard.<br/><br/>\"Huh?\"<br/><br/>\"This...\"<br/><br/>They were speechless as to how that was possible. Even in their wildest dream, they wouldn't have considered Feng Yun to be the Second Grade Alchemist.<br/><br/>\"Feng Yun? The younger brother of Feng Chen and the one who previously had an engagement with Miss Ling Meiyu?\"<br/><br/>Elder Zhou Tianhua asked.<br/><br/>Although he didn't care about the Feng Clan, Feng Yun was someone who he knew.<br/><br/>After all, his brother was from the Mystic Flame Sect and the reason he got humiliated was because Miss Ling Meiyu wanted to go to Feng Clan to annul the engagement with Feng Yun.<br/><br/>\"Indeed, he is!\"<br/><br/>Elder Zhou answered while gritting his teeth.<br/><br/>(How could that Trash be a Second Grade Alchemist? This can't be true!)<br/><br/>\"Yan Head, are you absolutely sure that Feng Yun is the second-grade alchemist for the Feng Clan?\"<br/><br/>Elder Zhou asked, still unwilling to accept that the so-called trash who had been divorced was actually a genius capable of defeating a Core Formation expert and becoming a Second Grade<br/><br/>Alchemist.<br/><br/>Yan Zhan nodded grimly, his jaw set in a hard line.<br/><br/>\"Yes, Elder Zhou! I also found it hard to believe myself, but all the information we've<br/><br/>gathered points to him.\"<br/><br/>\"How can that be possible? He's just 16 years old! H-How could he have reached the level of a Second Grade Alchemist? That doesn't make any sense!\"<br/><br/>Elder Zhou continued, \"Even my sect would go to great lengths to recruit such genius. This<br/><br/>is...\"<br/><br/>Elder Zhou couldn't comprehend just how much of a monster he would be, given enough<br/><br/>time.<br/><br/>With such talent, it was even possible to dethrone the current Pill King of Azure Sky Empire who is Sixth Grade Alchemist.<br/><br/>Sixth Grade Alchemist! Such existence would warrant the respect of even the Mystic Flame Sect Leader and the Royal Family.<br/><br/>\"However, the bigger problem is that Feng Yun might have a high-grade alchemist as a master. If such an individual is on the Feng Clan side, it could prove to be a bigger problem\"<br/><br/>Elder Luo said worriedly.<br/><br/>If Feng Yun had a master who was Rank-4 or Rank-3 Alchemist then they couldn't bear to withstand the consequence of offending such a person.<br/><br/>\"Our intelligence suggests no sign of the Feng Clan getting help from outside. If Feng Yun does have a master, they are not currently here. It is also possible that Feng Yun is self-<br/><br/>taught.\"<br/><br/>Yan Zhan said.<br/><br/>At the mention of this, the elders were a bit relaxed.<br/><br/>\"In any case, we must act quickly. We cannot allow the Feng Clan to gain any more ground. We<br/><br/>need to eliminate Feng Yun before he poses a greater threat.\"<br/><br/>Elder Zhou's words were firm and unwavering.<br/><br/>(It's better to uproot the problem now rather than face a much larger issue later.)<br/><br/>It was clear that confronting the Feng Clan was becoming inevitable.<br/><br/>Even if it meant risking punishment by the Royal Family, he was prepared to endure the consequences if it meant he could get his revenge.<br/><br/>Moreover, Feng Yun's potential has scared him. If such a person was allowed to grow, he<br/><br/>couldn't fathom just how much of a trouble it would bring.<br/><br/>\"Has Elder Zhou thought of a plan?\"<br/><br/>Yan Zhan asked, noting the shift in Elder Zhou's demeanor.<br/><br/>\"Yes, I do! Elder Brother, please show them.\"<br/><br/>Elder Zhou said.<br/><br/>With a solemn nod, Elder Zhou Tianhua rose from his seat and retrieved a small, intricately<br/><br/>carved wooden box from his storage ring.<br/><br/>As he opened it, a faint, golden glow emanated from within, drawing the eyes of everyone in<br/><br/>the room.<br/><br/>\"This,\" Elder Zhou Tianhua said, lifting a single, ornate vial from the box.<br/><br/>\"is the Pill of Ascension. It is a Top-level Rank-2 pill that can temporarily enhance a person's realm by one level. Though it is only for those below Three Elements Divine Realm.\"<br/><br/>Yan Zhan's eyes gleamed with hope.<br/><br/>\"If we utilize this Pill of Ascension strategically, we can enhance our Grand Qi Condensation<br/><br/>Realm experts to the next level. With Elder Zhou Tianhua's Three Divine Element Realm cultivation and the boosted strength of our forces, the Feng Clan won't stand a chance.\"<br/><br/>Elder Zhou Tianhua nodded, his gaze steady.<br/><br/>\"Indeed. The pill's effects are potent, but they come with a heavy price. The user will experience significant strain and a temporary drop in their cultivation after the enhancement wears off. However, in a critical battle, this temporary boost could be the difference between<br/><br/>victory and defeat.\"<br/><br/>Although the side effect was there, as long as they could take out Feng Clan, they knew that<br/><br/>the side effect was nothing to be afraid of.<br/><br/>\"And also called Zhao and Liu Clan as well. We don't want to fail because of underestimating<br/><br/>our enemy.\"<br/><br/>Elder Zhou said.<br/><br/>Yan Zhan's lips curled into a scheming smile as he replied, \"Yes, of course!\"\t\t\t\t\t\t</div>", "images": {}, "success": true}