{"id": 42, "url": "https://www.novelhall.com/my-brothers-the-protagonist-good-thing-i-awakened-my-system-33973/14946586.html", "title": "Chapter 42: The Spoils Of Victory", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 42: The Spoils Of Victory</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 42: The Spoils Of VictoryEarly in the morning of the next day, Misty Vale City awoke to an atmosphere of tension and anticipation.<br/><br/>The events of the previous day had spread like wildfire throughout the city, and now, as dawn broke, the citizens were eager to learn more about the unfolding power dynamics.<br/><br/>The Yan, Zhao, and Liu Marketplace which was usually buzzing with people was almost empty due to the marketplace being closed down.<br/><br/>The rest of the Yan, Zhao, and Liu Families didn't resist after knowing that their Grand Qi Condensation Experts had died and that Feng Chen had reached the Three Elements Divine Realm.<br/><br/>They all agreed to hand over all their assets to Feng Clan and leave Misty Vale City.<br/><br/>Without hesitation, they complied, promptly transferring their holdings and fleeing the city. It was already a blessing for them that they could survive, so before Feng Clan changed their mind, they completed evacuating overnight.<br/><br/>The Feng Clan was quickly occupied with taking over the newly acquired businesses, shutting them down temporarily while they worked to sort out the details.<br/><br/>On the other hand, patrons flocked to the tea houses and restaurants, where news and gossip were typically exchanged.<br/><br/>The venues quickly filled with people eager to discuss and learn more about the recent events. \"Extra! Extra! The Yan, Zhao, and Liu families have been vanquished by the Feng Clan in a decisive battle! Their mansions are empty, and their wealth has been seized by the Feng Clan!\"<br/><br/>\"The Feng Clan now stands as the most powerful family in Misty Vale City!\" seaʀᴄh thё NôvelFire.nёt website on Google to access chapters of novels early and in the highest quality.<br/><br/>\"New alliances are forming, and the balance of power is shifting!\"<br/><br/>\"Rumors of powerful cultivators arriving in the city continue to spread! Who are they, and what do they want?\"<br/><br/>\"Elder Zhou Lei and Elder Zhou Tianhua both dead? Is Mystic Flame Sect and Spirit Wind Palace going to take revenge?\"<br/><br/>In the teahouses and restaurants, conversations were animated, with patrons debating the implications of the Feng Clan's dominance.<br/><br/>Some expressed concern about the potential for further conflicts, while others saw it as an opportunity to realign themselves with the new power structure.<br/><br/>As the city's chatter grew louder, the various factions and families began to assess their positions in the newly reconfigured landscape.<br/><br/>The rapid rise of the Feng Clan left many wondering about the future, with speculation rife about the potential responses from other powerful sects and families.<br/><br/>Meanwhile, at the Feng Clan's estate, Feng Chen stood before a group of elders and key family members in the main hall, his expression calm.<br/><br/>Unlike others, Feng Chen didn't think that taking care of Yan, Zhao, and Liu's family was difficult, as he was already capable of doing so before he even got the system.<br/><br/>Although this achievement was nothing for Feng Chen, it wasn't the same for others who felt oppressed by the other three major families.<br/><br/>The room was filled with great emotion and excitement. Feng Clan who was thought to be the weakest among the Five Major Families, had triumphed and had emerged as the strongest.<br/><br/>\"Nephew, the inventory of the Yan, Zhao, and Liu families' properties and resources is nearly complete.\"<br/><br/>Elder Wei reported excitedly, holding a thick ledger.<br/><br/>\"It's a monumental task, given the scale of their holdings and the damage to some of their records.\"<br/><br/>Feng Chen nodded.<br/><br/>\"Very well. Let us hear the details of what we have acquired.\"<br/><br/>Elder Wei cleared his throat and began to list off the assets.<br/><br/>\"From the Yan Family, we've seized approximately Twenty thousand Gold Coins, 16 weapons of Mortal-Grade, 3 Earth-Grade artifacts, and several pills. Their properties include 1 Alchemist Room, 2 mines, 3 taverns, 3 teahouses, and a variety of smaller enterprises.\"<br/><br/>Feng Chen listened attentively, nodding occasionally.<br/><br/>The number of Gold Coins was a bit lower, likely because they had used most of their money to compete with pill pricing<br/><br/>Overall, it wasn't too good nor too bad considering they were once the most powerful clan of Misty Vale City.<br/><br/>\"And the Zhao and Liu families?\"<br/><br/>Elder Wei continued, \"The Zhao Family and Liu Family together have yielded about two hundred thousand Gold Coins, 20 Mortal-Grade artifacts, and 5 Earth-Grade Artifacts. Their holdings include 1 iron mine, 2 medicinal herb fields, and several commercial establishments.\"<br/><br/>Feng Chen's eyes gleamed with satisfaction.<br/><br/>\"It seems we've acquired quite a substantial fortune and valuable assets.\"<br/><br/>Feng Chen smiled, clearly pleased. With so many resources, even compared to other Clans who have Three Elements Divine Realm Powerhouse, Feng Clan wouldn't fall behind.<br/><br/>\"This wealth will significantly enhance our Clan's resources and influence. Ensure that all items are properly cataloged and that the properties are secured.\"<br/><br/>Elder Wei bowed respectfully.<br/><br/>\"Yes, Nephew. We will proceed with the utmost diligence.\"<br/><br/>Feng Chen spent the early morning discussing various strategies with the Elders on how to efficiently manage the newly acquired resources and integrate them into the Feng Clan's<br/><br/>holdings.<br/><br/>They meticulously planned the distribution of assets, the reorganization of businesses, and the strengthening of their newly acquired position.<br/><br/>Once the discussions concluded, Feng Chen gathered all of the Feng Clan Members for a<br/><br/>briefing.<br/><br/>\"The Yan, Zhao, and Liu families have been neutralized, their assets now under our control. However, we cannot afford to be complacent. We must solidify our position and prepare for<br/><br/>any further challenges.\"<br/><br/>Although it was true that they had destroyed the enemy within Misty Vale City, they had also acquired new ones that were much more powerful than them.<br/><br/>Mystic Flame Sect which was already their enemy and the enmity grew further since Feng Chen killed one of their elders. This was also true for Spirit Wind Palace.<br/><br/>There was also the Zhou Family. Two of their members had been killed by him, so he didn't think that they could let Feng Clan go after this.<br/><br/>(In any case, they were the ones who came seeking trouble with me. If their clan has issues with how I dealt with their allies, they should be prepared to face the same consequences as<br/><br/>the Yan, Zhao, and Liu Clans.)<br/><br/>The Zhou Clan was certainly stronger but with his Nascent Soul Realm cultivation, he didn't think that they could do anything to the Feng Clan.<br/><br/>Though Spirit Wind Palace and Mystic Flame Sect were different stories.<br/><br/>They also have Nascent Soul Realm powerhouses, and given their long history, it's not<br/><br/>surprising if they possess some hidden trump card as well.<br/><br/>Although his previous enemies were defeated, the process has only brought more powerful<br/><br/>enemies into the fray.<br/><br/>(That's why I don't like to eliminate weaker enemies!)<br/><br/>Feng Chen thought. He knew that killing weaker enemies would only end up attracting even<br/><br/>bigger enemies.<br/><br/>(One goes, thousands come!)<br/><br/>Though, whatever the case might be, as long as he and the clan grew stronger those enemies would also only serve as their stepping stones.<br/><br/>\"We will allocate additional resources, and I trust that each of you will continue to cultivate diligently and grow even stronger.\"\t\t\t\t\t\t</div>", "images": {}, "success": true}