{"id": 46, "url": "https://www.novelhall.com/my-brothers-the-protagonist-good-thing-i-awakened-my-system-33973/14946590.html", "title": "Chapter 46: Wang Yifan Appears", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 46: Wang Yifan Appears</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 46: Wang Yifan AppearsThe Feng Clan, having seized the assets of the other three major families, saw their wealth increase dramatically.<br/><br/>They were already wealthy from the success of Feng Yun's pills, but their riches grew even more after they gained control over nearly all the markets of Misty Vale City.<br/><br/>Feng Chen didn't hold back and distributed the resources that he acquired to make the Feng Clan even stronger.<br/><br/>Most of the time, many of the Feng Clan Members were cooped up in their private chamber cultivating.<br/><br/>Only those responsible for managing the businesses or attending to the clan's affairs were not in seclusion.<br/><br/>A few elders were also always present to accompany Feng Chen to meet with leaders of other clans who came to congratulate the Feng Clan on their rise to power.<br/><br/>It was not just clans from Misty Vale City, but also those from other cities sought to form alliances with the Feng Clan.<br/><br/>With news of Feng Chen reaching the Three Elements Divine Realm spreading, he had become someone everyone wanted to befriend.<br/><br/>After all, cultivators in the Three Elements Divine Realm are rare and highly respected in the Azure Sky Empire.<br/><br/>Additionally, it is widely known that the Feng Clan has a Second-Grade Alchemist and seven Grand Elders at the Grand Qi Condensation Realm, making the prospect of befriending them even more appealing.<br/><br/>In any case, the neighboring cities' powerhouses were either weaker than Feng Clan or about equal.<br/><br/>Therefore, it was also in their interest to befriend Feng Clan and avoid making enemies with them.<br/><br/>\"Please everyone, wait in line!\"<br/><br/>Outside the grand gates of the Feng Clan's manor, a crowd had begun to gather. Servants were working hard to keep the guest in lines as they entered the hall to meet with Feng Chen.<br/><br/>Representatives from various smaller families, merchants, and even a few independent cultivators arrived, each carrying gifts to congratulate the Feng Clan on their newfound dominance.<br/><br/>Some came with ornate boxes filled with spirit herbs or rare minerals, hoping to curry favor with the Feng Clan.<br/><br/>Others brought unique treasures or finely crafted weapons, all eager to show their support and possibly secure a future alliance.<br/><br/>A distinguished elder from a lesser-known merchant family, the Huang family, approached Feng Chen with a deep bow, presenting a jade box that shimmered with a faint light.<br/><br/>\"Feng Clan Leader\" the elder began respectfully.<br/><br/>\"Please accept this humble gift as a token of our family's admiration for your clan's strength and wisdom. May the Feng Clan continue to thrive and flourish.\"<br/><br/>Feng Chen received the box with a polite nod.<br/><br/>\"Thank you, Elder Huang. The Feng Clan values your support and friendship. We shall remember your gesture.\"<br/><br/>As more people stepped forward, the scene became lively, filled with voices congratulating the Feng Clan and expressing hopes for a prosperous future under their leadership.<br/><br/>The atmosphere was one of celebration and anticipation, the crowd eager to align themselves with the city's new ruling family.<br/><br/>Feng Chen maintained a courteous demeanor as he interacted with each guest, expressing gratitude for their gifts and well wishes.<br/><br/>Though he was friendly and approachable, he was careful not to make any promises or formal commitments regarding alliances.<br/><br/>Amidst the crowd, a servant hurried towards Feng Chen, weaving through the throng of people.<br/><br/>\"Clan Leader,\" the servant announced, his voice low and respectful.<br/><br/>\"The leader of the Wang Clan has arrived and requests an audience with you.\"<br/><br/>Feng Chen raised an eyebrow, intrigued by the news.<br/><br/>The Wang Clan was the only other major family left in Misty Vale City.<br/><br/>Since they are appointed by the Royal Family, they neither interfere with Misty Vale City's power struggle nor dare to offend them.<br/><br/>Of course, the incident of Three Major Families getting destroyed would warrant the attention of the Wang Clan.<br/><br/>However, the Feng Clan already had enough reason to do so.<br/><br/>Moreover, the Three Major Families had also been involved with outsiders which only further justified Feng Clan's actions.<br/><br/>Therefore, Feng Chen wasn't worried that the Wang Clan or the Royal Family would blame them.<br/><br/>\"Escort him to the main hall,\" Feng Chen instructed calmly.<br/><br/>\"I will meet him there shortly.\"<br/><br/>The servant nodded and quickly retreated to carry out his orders. Feng Chen turned to the elders who had been assisting him throughout the day.<br/><br/>\"Elders, please continue to greet our guests and ensure that they are well attended to,\" Feng Chen said.<br/><br/>\"I will handle the matter with the Wang Clan personally.\"<br/><br/>The elders nodded in agreement, understanding the importance of Wang Clan's arrival.<br/><br/>Although by strength, the Feng Clan far surpasses the Wang Clan. However, Wang Clan is supported by the Imperial Family and not someone that they can offend.<br/><br/>Arriving at the main hall, Feng Chen took a moment to think of a reason as to why Wang Clan Leader would come to meet him.<br/><br/>(It can't be that they are here to implicate me because of what I have done to the other Three Major Families?)<br/><br/>Feng Chen thought as there were many witnesses who saw Elder Zhou Lei and Elder Zhou Tianhua attacking their clan members first.<br/><br/>Anyways, he didn't need to ponder for much as Wang Clan made his appearance.<br/><br/>The Wang Clan leader, a dignified figure dressed in ornate robes, entered with a measured<br/><br/>stride.<br/><br/>Accompanying him was a tall, imposing figure whose aura surpassed even Wang Yifan.<br/><br/>(Peak of Grand Qi Condensation Realm. Does Wang Yifan want to meet with me because of him?)<br/><br/>Feng Chen thought. Seeing the mysterious guest, Feng Chen thought that maybe Wang Yifan was there because of that person.<br/><br/>\"Clan Leader Wang,\" Feng Chen greeted with a slight bow, his tone respectful yet measured. \"It is an honor to welcome you to the Feng Clan's manor. Please, have a seat.\"<br/><br/>Wang Jian returned the bow, his face breaking into a small, polite smile.<br/><br/>\"Thank you, Young Master Feng Chen. I appreciate your hospitality, especially during such a busy time for your clan.\"<br/><br/>Wang Yifan first gestured for the man accompanying him to take a seat before settling down himself. This act clearly indicated that the man's status was superior to his own.<br/><br/>\"So, Wang Head, what brings you here?\"<br/><br/>Feng Chen asked.<br/><br/>\"It is not I who wishes to speak with you,\" Wang Yifan said, glancing at the tall figure beside<br/><br/>him.\"<br/><br/>\"He is?\"<br/><br/>Feng Chen asked. Searᴄh the NôvelFire.nёt website on Google to access chapters of novels early and in the highest quality.<br/><br/>Wang Yifan gestured toward the imposing figure beside him.<br/><br/>\"Allow me to introduce Steward Li of the Third Prince's entourage. He is the one who wishes<br/><br/>to speak with you.\"<br/><br/>\"Oh! A distinguished guest from the Imperial Family. What is it that you wish to discuss with<br/><br/>me?\"<br/><br/>Feng Chen asked. Although he said that, he had a feeling that it wasn't going to be any good.\t\t\t\t\t\t</div>", "images": {}, "success": true}