{"id": 41, "url": "https://www.novelhall.com/my-brothers-the-protagonist-good-thing-i-awakened-my-system-33973/14946585.html", "title": "Chapter 41: The Three Major Clans Destroyed", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 41: The Three Major Clans Destroyed</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 41: The Three Major Clans DestroyedAs Feng Chen's words echoed through the marketplace, the onlookers, who had been paralyzed with fear, finally regained some semblance of composure.<br/><br/>\"Damn! The Feng Clan leader really did it. He has killed almost all the Grand Qi Condensation Realm experts of Misty Vale City!\"<br/><br/>\"Now, no one could stop the Feng Clan from stopping even the Wang Clan.\"<br/><br/>\"It is as Feng Chen says, the Other Three Major Families would probably be destroyed after this.\"<br/><br/>\"Who told them to look for trouble with someone as powerful as Feng Chen? They should have known their place.\"<br/><br/>Whispers of disbelief and awe spread among the crowd as they tried to process the massacre they had just witnessed.<br/><br/>The sheer might of Feng Chen was undeniable, and his decisive actions shattered the balance of power in Misty Vale City in mere moments.<br/><br/>With all the Grand Qi Condensation Realm Cultivators of the other Three Major Families, they were as good as destroyed.<br/><br/>\"Brother, you are just too powerful!\"<br/><br/>Feng Yun said as he happily approached Feng Chen. He didn't know that the power difference between his brother and Elder Zhou Tianhua would be so vast.<br/><br/>One move and the opponent is dead!<br/><br/>Although he didn't know and concluded that his brother was too strong, his master explained that the attack contained sword intent which increased the damage of sword attacks. seaʀᴄh thё NovelFire.net* website on Google to access chapters of novels early and in the highest quality.<br/><br/>Sword Intent!<br/><br/>That was something that every sword cultivator dreams of achieving including himself. However, he knows that there is still a long way before he can even get a glimpse of that.<br/><br/>(Brother is becoming stronger and stronger. I can't afford to lag behind.)<br/><br/>Feng Yun thought. Although he was getting stronger and faster at a very rapid pace, he still didn't think that he was catching up to his brother.<br/><br/>Rather he felt that the distance between the two was just increasing.<br/><br/>In any case, he was extremely happy that the enemies were dead and his brother had become stronger.<br/><br/>\"Chen'er always manages to surprise me!\"<br/><br/>\"Despite having higher cultivation, Elder Zhou Tianhua couldn't even withstand Chen'er's one move. Truly disappointing as Three Elements Divine Realm Expert.\"<br/><br/>\"Haha! It is not that he was weak but that Chen'er is too powerful.\"<br/><br/>The Grand Elders of the Feng Clan, who had watched the battle from a distance, now approached Feng Chen with wide smiles and approving nods.<br/><br/>Their pride in Feng Chen was evident, and their previous concerns about the confrontation had all but vanished.<br/><br/>Although they knew that Feng Chen was also in the Three Elements Divine Realm, Elder Zhou Tianhua had reached Mid-Level which was two minor realms above Feng Chen.<br/><br/>So they thought that perhaps Feng Chen might struggle a bit since his opponent had higher cultivation.<br/><br/>But that one move showed them why Feng Chen was their Feng Clan's genius which only appears in a thousand years.<br/><br/>From a young age, Feng Chen has shown extraordinary talent and was the pride of the Feng Clan.<br/><br/>And they were once again reminded of why he is considered a genius!<br/><br/>Killing Three Elements Divine Realm is extremely hard for even those in the same realm, much less with one move.<br/><br/>Feng Chen gently patted his younger brother's shoulder, carefully checking him for any injuries. Apart from a few minor scrapes, Feng Yun was unharmed.<br/><br/>He then turned to Feng Mei, giving her a quick examination as well. Like Feng Yun, she only had a few superficial wounds.<br/><br/>Fortunately, those minor injuries would heal quickly since they had already taken healing pills.<br/><br/>\"Grand Elders, how are your condition?\"<br/><br/>Feng Chen then turned his attention to the Grand Elders.<br/><br/>\"Haha, Chen'er dealt with the enemy so swiftly that, aside from some Qi loss from an earlier battle, we're in good shape.\"<br/><br/>Feng Zhenshan replied with a chuckle.<br/><br/>Unlike Elder Zhou Tianhua's Pill of Ascension, Feng Yun's pill had no side effects, thanks in part to the refining power of the Ethereal Frost Flame.<br/><br/>\"Good. Issue the order to the remaining members of the Yan, Zhao, and Liu Families: hand over all their assets to the Feng Clan and leave Misty Vale City. If they refuse, they will face the<br/><br/>consequences!\"<br/><br/>Feng Chen commanded.<br/><br/>He wasn't a ruthless killer, but he wasn't so merciful as to let them go unpunished either. By offering this choice, he gave them a way to save themselves while also avoiding unnecessary<br/><br/>bloodshed.<br/><br/>\"Chen'er, wouldn't it be better if we just destroy them completely?\"<br/><br/>Feng Zhenshan suggested, concerned that sparing them might leave the door open for future retaliation.<br/><br/>Feng Chen's eyes narrowed slightly as he considered the question. Though his expression remained calm, there was a steely determination in his gaze.<br/><br/>\"Grand Elder Zhenshan,\" he began, his tone firm and authoritative, \"the Yan, Zhao, and Liu Families have lost their most powerful cultivators and their resources. They are no longer a threat. Wiping them out would only lead to needless violence and disorder in Misty Vale City.\" Feng Chen understood that the remaining members of the Yan, Zhao, and Liu Families might seek revenge in the future.<br/><br/>However, he had confidence in the Feng Clan's ability to grow stronger, especially with the aid of the System.<br/><br/>To surpass the Feng Clan's strength, they would need at least genius-level talent and an extraordinary physique, which was beyond the capabilities of these three clans.<br/><br/>Thus, Feng Chen was not overly concerned about potential future retaliation.<br/><br/>In essence, he did not see any value in annihilating them entirely when their ability to challenge the Feng Clan was fundamentally limited.<br/><br/>Feng Zhenshan nodded, understanding the reasoning behind Feng Chen's decision.<br/><br/>\"As you say, Chen'er. We will issue the order and ensure it is carried out swiftly.\" Turning to the other Grand Elders, Feng Chen continued, \"This is a chance for them to start anew elsewhere. However, if any of them dares to resist, Grand Elder can take care of them!\" The Grand Elders nodded in agreement and immediately set out to do what they were commanded to.\t\t\t\t\t\t</div>", "images": {}, "success": true}