{"id": 44, "url": "https://www.novelhall.com/my-brothers-the-protagonist-good-thing-i-awakened-my-system-33973/14946588.html", "title": "Chapter 44: The Wrath Of Mystic Flame", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 44: The Wrath Of Mystic Flame</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 44: The Wrath Of Mystic FlameThe discussion continued in the Flame Hall, the weight of the situation pressing heavily upon the gathered elders.<br/><br/>Another elder spoke up, his eyes burning with intensity.<br/><br/>\"We can't let this incident go unpunished. The Feng Clan is clearly against us, having dared to kill one of our elders. They need to be eliminated, or others will start thinking they can challenge us without consequences as well.\" S~eaʀᴄh the NôvelFire.nёt website on Google to access chapters of novels early and in the highest quality.<br/><br/>Several heads around the room nodded in agreement.<br/><br/>The belief was strong that Feng Chen's brazen act of killing their elders had not only tarnished their sect's reputation but had also threatened their authority.<br/><br/>The only way to undo the loss of reputation and criticism was to destroy the Feng Clan. There was no other option like apologizing to Feng Clan for their elder's actions.<br/><br/>Rather they believed that it was Feng Clan's fault!<br/><br/>The Mystic Flame Sect is already used to its power and dominance; and has never bowed their head even if it were their mistake.<br/><br/>In the first place, even if one of their Elders massacred a clan, they wouldn't face much opposition. This is only happening now because Elder Zhou Lei lost and the enemy survived. \"Of course, the Feng Clan will pay for their actions. However, the Feng Clan is currently attracting a lot of attention. The entire Azure Sky Empire is watching them closely. If we act rashly now, it will only draw more scrutiny to our sect.\"<br/><br/>Grand Elder Xuan Yun continued.<br/><br/>\"It's best not to provoke them for the time being. We must wait until the situation calms down, then we can deal with that minor clan as we see fit.\"<br/><br/>Grand Elder Xuan Yun then turned to Elder Xian.<br/><br/>Elder Xian was the one who led the Mystic Flame Sect disciple and Ling Meiyu to the Feng Clan to break off Ling Meiyu's engagement.<br/><br/>\"Elder Xian, how powerful do you think Feng Chen is?\"<br/><br/>Grand Elder Xuan Yun asked.<br/><br/>Elder Xian had witnessed Feng Chen personally, and he wanted to know whether Feng Chen had the talent to become an obstacle for their sect.<br/><br/>\"Hmmm...\"<br/><br/>Elder Xian pondered for a moment.<br/><br/>He had seen Feng Chen defeat Elder Zhou Lei in one move and knew just how powerful he<br/><br/>was.<br/><br/>Elder Zhou Lei wasn't some no-name cultivator and could even take on two average Peak Grand Qi Condensation Realm cultivators in a fight.<br/><br/>Moreover, the Qi that he felt from Feng Chen when at the Feng Clan estate was so great that he struggled to stand.<br/><br/>Now that he has reached to the next realm, Elder Xian couldn't fathom just how strong Feng Chen really is.<br/><br/>Elder Xian took a deep breath, his expression serious as he weighed his words.<br/><br/>\"Feng Chen's strength is formidable. Killing Elder Zhou Tianhua with ease demonstrates not only his cultivation but also his skill. Elder Zhou Tianhua was no ordinary cultivator; he was a force to be reckoned with even among those in the Three Elements Divine Realm. For Feng Chen to kill him suggests that his own cultivation is at an exceptionally high level.\"<br/><br/>He paused, gathering his thoughts.<br/><br/>\"Moreover, Feng Chen is still relatively young, only about 30 years old. This means he has considerable room for growth and improvement.\"<br/><br/>Grand Elder Xuan Yun leaned forward, his eyes narrowing.<br/><br/>\"Are you suggesting that Feng Chen poses a significant threat to our sect?\"<br/><br/>Elder Xian nodded.<br/><br/>\"Yes. Based on my assessment, Feng Chen's current strength should be invincible under Nascent Soul Realm.\"<br/><br/>Elder Xian's conclusion stemmed from the fact that while defeating a Three Elements Divine Realm cultivator is one thing, killing them is another matter entirely.<br/><br/>Defeating an opponent might be achievable, but stopping them from escaping-if they have the means to requires a level of dominance that only someone vastly stronger could ensure.<br/><br/>Since Feng Chen had not only defeated but also killed Elder Zhou Lei and Elder Zhou Tianhua, his power was clearly overwhelming.<br/><br/>One of the Grand Elders, his voice tinged with disbelief and a hint of indignation, interjected. \"Ha! Invincible under Nascent Soul Realm? Are you suggesting that he is more powerful than me?\"<br/><br/>His frustration was palpable.<br/><br/>As a Grand Elder at the peak of the Three Elements Divine Realm, he found it hard to accept that a cultivator from a lesser-known region might surpass him in strength.<br/><br/>Elder Xian's face flushed as he hastened to clarify.<br/><br/>\"T-that is not what I meant! I only intended to convey that Feng Chen is talented and should not be underestimated. His ability to kill two formidable elders like Zhou Lei and Zhou Tianhua indicates that he is a powerful and skilled opponent.\"<br/><br/>\"Hmph! I have fought and defeated numerous opponents in my time. If this Feng Chen were truly as strong as you claim, he should have already made a name for himself in the Azure Sky<br/><br/>Empire.\"<br/><br/>If there was a genius like Feng Chen, the grand elder believed that he would have already heard their names by now.<br/><br/>\"B-But he managed to kill Elder Zhou Tianhua who is in Mid-Level Three Elements Divine Realm.\"<br/><br/>Elder Xian said, not wanting the Grand Elder to underestimate Feng Chen.<br/><br/>\"That Feng Chen must have used some tricks or maybe used a sneak attack to kill Elder Zhou Tianhua. In any case, I can easily deal with someone like him.\"<br/><br/>The Grand Elder replied with a note of skepticism, convinced that in a direct confrontation, Feng Chen alone would not have been able to kill Elder Zhou Tianhua.<br/><br/>\"In any case, we have a powerhouse in the Nascent Soul Realm. Even if Feng Chen is as formidable as Elder Xian suggests, it won't be a problem for our sect.\"<br/><br/>Grand Elder Xuan Yan then interjected, his expression serious. Although he thought that Feng Chen was rather talented, just like the other Grand Elder, he believed that Feng Chen is<br/><br/>someone they can remove whenever they want.<br/><br/>\"The bigger issue is Feng Yun, his younger brother.\"<br/><br/>Grand Elder Xuan Yan continued.<br/><br/>\"Ling Meiyu has promised to fight with Feng Yun after three years. This fight would not only<br/><br/>affect her but Mystic Flame Sect's reputation as well.\"<br/><br/>He continued, his tone reflecting concern.<br/><br/>\"Initially, I ignored this because Feng Yun was someone who couldn't even cultivate<br/><br/>properly. However, recent reports indicate that he has reached the Peak Foundation Establishment Stage. If his growth continues at this pace, I fear that in three years he might<br/><br/>surpass Ling Meiyu.\"<br/><br/>Other elders nodded thoughtfully. One cannot underestimate a young man who could go from Early Qi Gathering to Peak Foundation Establishment Stage in just one month.<br/><br/>\"Indeed, Feng Yun's rapid progress could make him a formidable opponent. Although Feng Yun is not her opponent at the moment, who knows what will happen in three years. We must ensure that Ling Meiyu is adequately prepared and that our sect remains unaffected by any<br/><br/>potential fallout.\"<br/><br/>Elder Xian suggested.<br/><br/>\"Hmph! If Feng Yun proves to be a problem, we will deal with him decisively. And if necessary, we will ensure that he is not alive to take the challenge!\"<br/><br/>Grand Elder said coldly as he continued.<br/><br/>\"Our enemies will learn that defying the Mystic Flame Sect comes at a terrible price. The Feng<br/><br/>Clan, and anyone else who dares to stand in our way, will face consequences they can't even<br/><br/>imagine.\"<br/><br/>No matter what, Mystic Flame Sect was prepared to make sure that Ling Meiyu wins the promised battle.\t\t\t\t\t\t</div>", "images": {}, "success": true}