{"id": 40, "url": "https://www.novelhall.com/my-brothers-the-protagonist-good-thing-i-awakened-my-system-33973/14946584.html", "title": "Chapter 40: The Fall Of The Major Families", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 40: The Fall Of The Major Families</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 40: The Fall Of The Major FamiliesFeng Chen was truly surprised by how fragile the Three Elements Divine Realm was.<br/><br/>(Or is it that I am too strong despite holding back?)<br/><br/>He used a Heavenly Grade Technique using sword intent that also with Heaven Grade weapon. But still, he didn't expect that Elder Zhou Tianhua would be obliterated so easily.<br/><br/>(Maybe I overestimate Elder Zhou Tianhua?)<br/><br/>After all, he was an alchemist who focused more on refining pills than fighting techniques. However, he wasn't certain since Elder Zhou Tianhua was dead before he could gauge his power.<br/><br/>\"Now, this is anticlimactic!\"<br/><br/>Feng Chen said, not knowing what to say.<br/><br/>After all, he expected to beat Elder Zhou Tianhua a bit more and let the enemy know what it means to mess with his family.<br/><br/>Though Feng Chen killing Elder Tianhua in one move was more effective to instill fear than what he had planned.<br/><br/>The once-confident faces of the Yan, Zhao, and Liu family members now showed sheer terror as they realized the magnitude of what had just occurred.<br/><br/>The Yan Family Patriarch, Yan Zhan, stood frozen, his face ashen. His legs wobbled uncontrollably, and sweat poured down his brow.<br/><br/>He couldn't believe his eyes-Elder Zhou Tianhua, a formidable Three Elements Divine Realm expert, had been annihilated in a single strike.<br/><br/>\"This... This can't be happening!\"<br/><br/>He muttered, his voice shaking with disbelief.<br/><br/>Zhao Chenxi, who had been a staunch supporter of challenging the Feng Clan, now looked as if he were on the verge of collapse.<br/><br/>His face was drained of color, his eyes wide with horror.<br/><br/>\"We have to get out of here! There's no way we can fight against someone like that!\"<br/><br/>The onlooker also began to murmur among themselves, their voices filled with awe and fear.<br/><br/>\"Did you see that? Feng Chen destroyed Elder Zhou Tianhua with just one move! The power of the Feng Clan is terrifying!\"<br/><br/>\"There's no way anyone can stand against them now. The Feng Clan is truly unbeatable!\"<br/><br/>\"Good thing that we didn't ally with the Major Families, otherwise we would have met the same fate.\"<br/><br/>As the panic spread, Feng Chen's gaze remained calm and composed. His eyes were fixed on the trembling figures before him.<br/><br/>\"Feng Chen, how dare you kill my brother? Don't you fear the Spirit Wind Palace? They will not let you go for killing my brother!\"<br/><br/>Elder Zhou Lei said angrily.<br/><br/>\"Haha! So what? I even offended the number one sect, what's one more?\"<br/><br/>Feng Chen replied. He didn't know that Elder Zhou Tianhua belonged to the Top-3 Sect of Azure Sky Empire.<br/><br/>Though as he said, it didn't matter what sect Elder Zhou Tianhua was in as he already bared his fang at his family, so he must also bear the consequences.<br/><br/>\"Now it's your turn!\"<br/><br/>Feng Chen leveled his sword at them, sending a clear message of threat that visibly unsettled the enemy.<br/><br/>\"F-Feng Chen, Mystic Flame Sect will not let you go if you kill me!\"<br/><br/>Elder Zhou said. Although his life was being threatened, he still had his pride and refused to beg for mercy.<br/><br/>Quite the opposite, he reminded Feng Chen of his position as elder of Mystic Flame Sect in hope of scaring Feng Chen.<br/><br/>\"Even if they do let me go, I will not let them go for what they have done!\"<br/><br/>Feng Chen coldly replied.<br/><br/>With what they had already done, plus the relationship between their little sect leader and his brother, it would be difficult to have a good relationship with the Mystic Flame Sect.<br/><br/>Moreover, Elder Zhou Lei had instigated this conflict, and if the Mystic Flame Sect chose to stand against him rather than admit their elders' mistakes, Feng Chen had no qualms about destroying the Mystic Flame Sect as well.<br/><br/>\"Feng Chen, don't think you are invincible just because you reached the Three Elements Divine Realm. There is always a mountain beyond a mountain! You are nothing in front of our Nascent Soul Realm Expert\"<br/><br/>Elder Zhou Lei said, trying to frighten Feng Chen.<br/><br/>Feng Chen smirked at Elder Zhou Lei's words, his eyes narrowing with disdain.<br/><br/>\"A Nascent Soul Realm expert, you say?\"<br/><br/>His voice was calm, yet the sheer confidence in his tone sent shivers down the spines of those around him.<br/><br/>\"Do you think I would be afraid of a Nascent Soul Realm cultivator? If your so-called experts dare to show up, I'll deal with them just like I dealt with your brother.\"<br/><br/>Elder Zhou Lei's face contorted with rage.<br/><br/>\"Arrogant brat! Do you think you can defy the heavens just because you've had a small breakthrough? Our Mystic Flame Sect has existed for thousands of years. Your power is inconsequential compared to ours!\"<br/><br/>But Feng Chen's expression remained indifferent.<br/><br/>\"Hmph, is that supposed to scare me? No matter how powerful the force backing you is, no one can save you today. Anyone who dares to threaten my family will meet the same fate.\"<br/><br/>Suddenly, Feng Chen's aura flared, and a gust of wind swept through the marketplace. The power radiating from him was intense, suffocating even the strongest of cultivators present.<br/><br/>\"You can't kill me!\"<br/><br/>Elder Zhou Lei screamed, panic creeping into his voice as he staggered back, his bravado crumbling under the weight of Feng Chen's overpowering aura.<br/><br/>\"YOU DARE NOT! The Mystic Flame Sect will not spare you or your family! They will hunt you<br/><br/>down and-\"<br/><br/>\"Noisy!\"<br/><br/>Feng Chen cut him off, his tone sharp and dismissive. He flicked his wrist, and his Heaven- grade sword shimmered with deadly intent, moving with blinding speed.<br/><br/>The blade, guided by Feng Chen's precise control, shot through the air like a comet, leaving a trail of light in its wake.<br/><br/>Before Elder Zhou Lei could even react, the sword had already reached him, slicing through his body with ease.<br/><br/>There was a moment of stunned silence as the elder's eyes widened in shock, his mouth opening in a final, silent scream.<br/><br/>Then, in an instant, Elder Zhou Lei was split in half, his two halves collapsing to the ground<br/><br/>with a sickening thud.<br/><br/>Blood pooled around his lifeless body, soaking into the dirt and sending a fresh wave of<br/><br/>horror rippling through the onlookers.<br/><br/>Feng Chen didn't spare the fallen elder a second glance.<br/><br/>He simply lowered his arm, his sword returning to his hand, its blade as pristine as if it had<br/><br/>never tasted blood.<br/><br/>The crowd remained frozen, too stunned to move or speak.<br/><br/>Now, Feng Chen turned his attention to the remaining members of the major families.<br/><br/>His gaze swept over the assembled figures of the Yan, Zhao, and Liu families, who had stood alongside Elder Zhou Tianhua with such confidence only moments before.<br/><br/>But that confidence had evaporated, replaced by sheer terror as they realized the perilous situation they were in.<br/><br/>\"F-Feng Chen! We didn't know you had reached the Three Elements Divine Realm. Please,<br/><br/>spare us! We were only following Elder Zhou's orders!\"<br/><br/>Feng Chen's eyes narrowed. \"Following orders? Is that the excuse you use to justify your actions?\"<br/><br/>His voice grew colder, each word like a dagger piercing through the hearts of those who stood<br/><br/>before him.<br/><br/>\"You came to my clan, thinking you could destroy my family, but now that your helpers are dead, you beg for mercy?\"<br/><br/>The other members of the Yan, Zhao, and Liu families began to back away slowly, their fear evident in their eyes.<br/><br/>They had come here, confident in their alliance and their plan, but now they realized they were severely outmatched.<br/><br/>Liu's head fell to his knees, his hands trembling as he clasped them together in a pleading Searᴄh the novёlF~ire.net website on Google to access chapters of novels early and in the highest quality.<br/><br/>gesture.<br/><br/>\"Feng Chen, please! We admit our mistakes! We were foolish to follow Elder Zhou. We will leave Misty Vale City immediately and never return!\"<br/><br/>Feng Chen's gaze was icy as he looked down at Liu Head.<br/><br/>\"Too late,\" he said flatly.<br/><br/>\"You made your choice when you decided to come against my family. Now, you'll face the<br/><br/>consequences.\"<br/><br/>SLASH!<br/><br/>Before anyone could react, Feng Chen's sword flashed again, slicing through the air with a<br/><br/>•<br/><br/>deadly hiss.<br/><br/>The blade struck true, and Liu's head was separated from his body in an instant. His lifeless<br/><br/>corpse toppled forward, blood pooling around it<br/><br/>The crowd gasped in unison, a collective shudder running through them as they realized the<br/><br/>extent of Feng Chen's ruthlessness.<br/><br/>\"This is a nightmare!\" Zhao Chenxi said, his face pale as he staggered back, his eyes wide with terror.<br/><br/>\"Nightmare or not, it's reality!\"<br/><br/>Feng Chen said coldly.<br/><br/>\"And you brought this upon yourselves.\"<br/><br/>The remaining members of the major families tried to flee, their fear overriding any sense of<br/><br/>pride or duty.<br/><br/>But Feng Chen was merciless.<br/><br/>With a burst of speed, he moved like a shadow, his sword slicing through the air with lethal<br/><br/>precision.<br/><br/>One by one, the heads of the fleeing cultivators fell, their bodies collapsing to the ground like lifeless dolls until none of the enemy survived.<br/><br/>\"From now on,\" Feng Chen proclaimed, his voice echoing through the silent marketplace. \"Misty Vale City will no longer have five major families!\"\t\t\t\t\t\t</div>", "images": {}, "success": true}