{"id": 47, "url": "https://www.novelhall.com/my-brothers-the-protagonist-good-thing-i-awakened-my-system-33973/14946591.html", "title": "Chapter 47: Steward Li'S Offer", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 47: Steward Li'S Offer</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 47: Steward Li's OfferSteward Li's smile held an air of condescension as he observed Feng Chen.<br/><br/>Although Steward Li was weaker than Feng Chen, since he was associated with a prince, he naturally felt superior.<br/><br/>\"Feng Clan Leader, I suppose your recent accomplishments are... noteworthy, to some extent. News of your ascension to the Three Elements Divine Realm and the incident with Elder Zhou Tianhua has, predictably, made the rounds.\"<br/><br/>Steward Li said. Although he was somewhat telling about Feng Chen's achievements, it seemed like he wasn't very impressed or believed them to be true. Nonetheless, he continued.<br/><br/>\"And your swift rise to power in Misty Vale City has caught the attention of many, including my prince.\"<br/><br/>Feng Chen remained calm, his expression neutral.<br/><br/>\"Elder Zhou Tianhua might have been weak but he was still a member of the Zhou Clan. While you might be powerful enough to take down Zhou Tianhua, can you truly stand against the entire Zhou Clan, which boasts numerous cultivators at the Three Elements Divine Realm?\" \"And? Steward Li wouldn't have just come to Feng Clan to warn us, right?\"<br/><br/>The steward's smile widened slightly, acknowledging Feng Chen's perceptiveness.<br/><br/>\"Haha... Indeed! My prince, the Third Prince of the Azure Sky Empire, has taken an interest in your clan's potential. He has promised to protect your clan!\"<br/><br/>Steward Li said as if his prince was doing Feng Clan a big favor.<br/><br/>Feng Chen's eyes narrowed. He knew well that nothing in this world came without a price, and every favor has its own demerit.<br/><br/>\"And what does the Third Prince ask in return for this protection?\"<br/><br/>Feng Chen asked.<br/><br/>\"All he asks is that the Feng Clan acknowledges his authority and pledges its loyalty to him. In doing so, you would secure the backing of the Imperial Family and avoid the potential pitfalls that come with your newfound power. The Zhou Clan, and any others who may harbor ill intentions, would be dealt with swiftly, ensuring your continued dominance in Misty Vale City.\"<br/><br/>Steward Li said confidently.<br/><br/>Many clans aspire to align themselves with the Third Prince, given his authority and the protection and connections he can offer.<br/><br/>Therefore, he didn't think that the Feng Clan, which is a small clan in the remote area of the empire, would be able to refuse such an opportunity.<br/><br/>However, Steward Li made one miscalculation.<br/><br/>\"I refuse!\"<br/><br/>Feng Chen flat-out refused Steward Li's proposal.<br/><br/>\"Of course, you would accep- What?\"<br/><br/>Steward Li was stunned and for a moment, he thought he heard wrongly.<br/><br/>Wang Yifan was the same and thought that perhaps Feng Chen misspoke.<br/><br/>If the Feng Clan had the support of the Third Prince, he thought that not only in Misty Vale City but they could fearlessly expand their power in other cities as well.<br/><br/>Not only the Zhou Clan but even the Sects like Spirit Wind Palace would think twice before they tried to lay hands on Third Prince forces.<br/><br/>So, he couldn't understand why Feng Chen would refuse such a proposal.<br/><br/>Steward Li calmed himself down and observed Feng Chen. He has the same thought as Wang Yifan and thought that perhaps Feng Chen misspoke.<br/><br/>But looking at Feng Chen's expression, he could tell that he didn't misspeak and that he had refused his proposal.<br/><br/>\"Do you know what you are saying? You are rejecting the opportunity given by the Third Prince!\"<br/><br/>Steward Li said angrily. He thought that Feng Chen would happily jump at his offer and never considered the possibility of rejection.<br/><br/>No matter what Feng Chen has done and how much powerful his clan was considered in the Misty Vale City, it was compareless to the Imperial Family power.<br/><br/>\"I'm sorry! My Clan is relatively small and couldn't be much help to the prince. It is better for our clan to develop in Misty Vale City. I don't think our clan could handle being the Third Prince's subordinate!\"<br/><br/>Feng Chen explained.<br/><br/>Of course, those explanations were all bullshit in order to make it seem like he and his clan was incapable of serving the Third Prince rather than it being outright rejection.<br/><br/>In reality, Feng Chen never thought of the Zhou Clan as a threat. What could Clan with only Three Elements Divine Realm even do to him?<br/><br/>With his Nascent Soul Realm cultivation, wiping them out was nothing difficult. Although the Feng Clan resided in a relatively remote area, Feng Chen had always kept a close eye on events that might impact his family-especially those involving the Royal Family.<br/><br/>He understood exactly why the Third Prince had sent his steward to recruit the Feng Clan. The Emperor's health was rapidly declining, and it was only a matter of time before his death would trigger a power struggle.<br/><br/>The capital was already in chaos, with factions forming around various princes and princesses, each preparing to stake their claim to the throne.<br/><br/>Among these contenders, the Third Prince was notably weaker, lacking the internal power to compete with his more influential siblings.<br/><br/>Thus, he was forced to seek alliances outside the capital, hoping to bolster his standing by pulling in support from more distant clans.<br/><br/>Feng Chen knew this well. The offer of 'protection' from the Third Prince was nothing more than a calculated attempt to extend his influence into this corner of the empire.<br/><br/>Rather than safeguarding the Feng Clan, it was clear to Feng Chen that they were simply another pawn in the prince's desperate bid for power.<br/><br/>Aligning with the Third Prince would only drag the Feng Clan into a political struggle they had no desire to be part of Searᴄh the nôᴠel Fire.nёt website on Google to access chapters of novels early and in the highest quality.<br/><br/>Steward Li's face twisted with growing frustration as his offer was rejected yet again.<br/><br/>How could he remain calm after being turned down twice by the leader of a clan he considered<br/><br/>insignificant?<br/><br/>As the steward of the Third Prince, he was accustomed to receiving respect, even from powerful clans boasting multiple Three Elements Divine Realm cultivators.<br/><br/>To have someone like Feng Chen-a leader of a smaller, remote clan-refuse an offer from the Third Prince was not only shocking but, in his eyes, deeply insulting.<br/><br/>Although Feng Chen appeared to give measured reasoning for his refusal, Steward Li saw it as nothing more than a collection of excuses.<br/><br/>In his mind, if Feng Chen truly respected the Third Prince, he would have immediately agreed without hesitation.\t\t\t\t\t\t</div>", "images": {}, "success": true}