{"id": 56, "url": "https://www.novelhall.com/my-brothers-the-protagonist-good-thing-i-awakened-my-system-33973/14946600.html", "title": "Chapter 56: Collecting Resources", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 56: Collecting Resources</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 56: Collecting ResourcesFeng Chen carefully stored the Grade-5 Formation book in his storage ring, his mind racing with the potential this discovery held.<br/><br/>This single book could shift the balance of power in the Azure Sky Empire, a fact that wasn't lost on him.<br/><br/>For now, it was better to keep its existence a secret-he would reveal it when the time was right.<br/><br/>\"With this, the Feng Clan's future is even more secure!\"<br/><br/>He thought, his lips curling into a satisfied smile.<br/><br/>He got more than what he expected and was in a very good mood. If his every trip was as fruitful as this one, he reckoned that he would soon become the richest person in the Azure Sky Empire.<br/><br/>Although he knew that it was impossible as his previous travel was never as rewarding as this<br/><br/>one.<br/><br/>Most treasure maps that he got were either a fraud or his treasure had already been taken by some lucky guy.<br/><br/>Even if there was a treasure, it was never as valuable as this one.<br/><br/>Feng Chen stood in the now-empty chamber, the once congested chamber was emptied by Feng Chen in minutes.<br/><br/>His gaze lingered on the empty space as he was in deep thought.<br/><br/>A rare moment of reflection washed over him. The owner, a formidable Grade-4 Formation Master, had no doubt invested their entire life in accumulating such wealth and knowledge.<br/><br/>In a way, Feng Chen had inherited not only the treasures but also the legacy of a master who had guarded these secrets.<br/><br/>He bowed slightly toward the chamber's entrance, a sign of respect.<br/><br/>\"To the one who left this behind, I thank you. Your knowledge will be put to good use. Your legacy will not fade into obscurity.\"<br/><br/>He didn't know whether the owner was alive or dead but judging by the fact that the place was untouched for thousands of years, he concluded that the owner was most likely dead.<br/><br/>And the place that he robb... Ahem! The place that he inherited was most likely a Grade-4 Formation Master's place where he stored all his knowledge.<br/><br/>In a way, those who will inherit all this treasure could also be called his successor.<br/><br/>Feng Chen mused that if any member of his clan became a Formation Master, he would bring them to this place to pay respects to the one whose knowledge helped them achieve it.<br/><br/>Although he didn't know about the grudge, Feng Chen was a person who never forgot a person who did him a favor, whether dead or alive.<br/><br/>As he rose, Feng Chen's eyes caught sight of something engraved on the wall near the<br/><br/>entrance.<br/><br/>It was a name-faint but legible, etched into the stone. He squinted, reading it aloud.<br/><br/>\"Hmm... Tian Rong?\"<br/><br/>Feng Chen assumed that this was the name of the owner and tried to remember anyone with this name.<br/><br/>\"Never heard of him.\"<br/><br/>Feng Chen thought for a moment but couldn't remember anyone with this name. If the Grade-4 Formation Master was still alive, this name would have rang a bell but there was<br/><br/>none.<br/><br/>Feng Chen then confirmed that the owner was indeed dead and might have been active thousands of years ago.<br/><br/>Otherwise, with how powerful and rare the Grade-4 Formation Master was, Feng Chen would have known about Tian Rong.<br/><br/>Moreover, there was no Tian Family, at least not any powerful family who claimed to have Grade-4 Formation Master Ancestors.<br/><br/>Which concludes that Tian Rong didn't have a family or his family might have been dead as well.<br/><br/>If he did, those treasures wouldn't be hidden in such a place and would have definitely been with his family.<br/><br/>A fleeting smile touched his lips as he reflected on the significance of that.<br/><br/>\"Even someone as powerful as a Grade-4 Formation Master, in the end, ends up forgotten if they have no one to carry their name forward.\"<br/><br/>The thought deepened his sense of purpose.<br/><br/>Feng Chen knew that no matter how much power or knowledge one amassed, it all meant<br/><br/>little if there was no family, no legacy to remember you.<br/><br/>The treasures left behind here had once been the pride of a master, yet without successors or family, they had faded into obscurity.<br/><br/>\"Rest well,\" Feng Chen murmured.<br/><br/>\"Your treasures will not fall into unworthy hands.\"<br/><br/>With that, Feng Chen turned to leave the chamber, a subtle sense of closure settling within<br/><br/>him.<br/><br/>His own path was clear.<br/><br/>His pursuit of power was not for himself alone but for his family and the Feng Clan, to ensure that their name would never fade into the forgotten annals of history.<br/><br/>\"Just being powerful alone is not enough!\"<br/><br/>Feng Chen murmured as he exited the hidden vault.<br/><br/>\"I will not walk the lonely path. The Feng Clan will endure, and our legacy will live on through generations.\"<br/><br/>Unlike Tian Rong, Feng Chen vowed that his legacy would continue through his clan's future generations.<br/><br/>After leaving the chamber, Feng Chen didn't plan to return to the clan.<br/><br/>Just because he had completed his primary objective didn't mean that he wanted to return<br/><br/>immediately.<br/><br/>Since this was a rare chance, Feng Chen decided to explore more. Moreover, there were a lot of valuable resources to be obtained in this place including Monster cores and rare herbs. seaʀᴄh thё ηovёlFire .net website on Google to access chapters of novels early and in the highest quality.<br/><br/>In fact, Feng Chen has already gotten a lot of herbs ranging from Grade 1 to Grade 4.<br/><br/>Because this part of the place was deemed too dangerous by Mercenary, hardly any people<br/><br/>came there.<br/><br/>As a result, many valuable herbs in this place remained untouched.<br/><br/>(This could be a good present for Feng Yun!)<br/><br/>Feng Chen thought. Grade-3 and Grade-4 herbs were valuable and Feng Clan hardly had enough for Feng Yun to practice.<br/><br/>This was not just about how expensive these herbs were but also about how rare they were. Even if one had money, it was difficult to obtain it, especially in large numbers.<br/><br/>So, Feng Chen thought about collecting more herbs and also getting more monster cores which will help Feng Clan's finances.<br/><br/>Although the Feng Clan was already rich, the Feng Clan didn't think that was enough as they were the family of the protagonist.<br/><br/>In every story, the clan of the protagonist always faces many problems and powerful<br/><br/>enemies.<br/><br/>So, if he wanted to keep his family safe, Feng Chen didn't have any other option than to make<br/><br/>them grow stronger.<br/><br/>For that, he needed a lot of resources.<br/><br/>Feng Chen remained for a few more days, gathering numerous herbs and monster cores from<br/><br/>the surrounding area.<br/><br/>Although he met Rank-5 monsters, he has still yet to meet with Rank-6 monsters.<br/><br/>\"Tsk! I expected to encounter at least one Rank-6 monster by now, but it seems luck isn't on<br/><br/>my side!\"<br/><br/>Feng Chen said as he felt unlucky.<br/><br/>If someone knew what Feng Chen was thinking, then they might think that he had gone crazy.<br/><br/>One would call Feng Chen super lucky for not encountering any Rank-6 monster but here he<br/><br/>was cursing and blaming his luck for not meeting one.<br/><br/>\"Let's hope that other areas of Stormhowl won't disappoint me!\"<br/><br/>Feng Chen said as he began to move towards the west. This is the next area besides the one<br/><br/>Feng Chen already was that was deemed dangerous.<br/><br/>Feng Chen knew that the area labeled as dangerous had fewer mercenaries exploring the<br/><br/>palace which translated to more treasure.<br/><br/>As for the danger, Feng Chen was cursing his luck for not encountering any Rank-6 monsters.<br/><br/>The danger that everyone is afraid of is the one he is actively seeking.<br/><br/>So why would he avoid it?\t\t\t\t\t\t</div>", "images": {}, "success": true}