{"id": 59, "url": "https://www.novelhall.com/my-brothers-the-protagonist-good-thing-i-awakened-my-system-33973/14946603.html", "title": "Chapter 59: Back To Misty Vale City", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 59: Back To Misty Vale City</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 59: Back To Misty Vale CityFeng Chen wiped his blade clean with a casual flick, his expression calmed as if the battle had never occurred.<br/><br/>For current Feng Chen, Rank 4 monsters and below weren't any different from ants that he could kill at his will.<br/><br/>Kong Wei and his group stood frozen in shock, their exhaustion momentarily forgotten as they stared at Feng Chen in awe.<br/><br/>(Good thing I was previously polite with the senior, otherwise...)<br/><br/>Kong Wei secretly praises his past self for not acting arrogantly in front of Feng Chen and for helping him out.<br/><br/>Indeed, being humble can save you from death.<br/><br/>Otherwise, he couldn't imagine his fate had he antagonized Feng Chen at the tavern.<br/><br/>\"Many thanks for saving my life, senior!\"<br/><br/>Kong Wei said, clasping his hands in respect.<br/><br/>Although Feng Chen looked younger than himself, Kong Wei assumed that Feng Chen had used certain techniques to maintain his youthful appearance.<br/><br/>Otherwise, there was simply no other way to explain the immense power wielded by someone so young.<br/><br/>\"Kong Wei, you should have been more careful. How can you get yourself in such danger?\"<br/><br/>Feng Chen remarked his tone was light but carried a hint of reprimand.<br/><br/>Feng Chen didn't know how someone as experienced as Kong Wei would find himself in such danger.<br/><br/>Kong Wei gave a sheepish nod, wiping the sweat from his brow.<br/><br/>\"You're right, senior. We were ambushed... I didn't expect a Rank 4 monster to appear so suddenly.\"<br/><br/>Kong Wei replied with a hint of embarrassment, knowing that Feng Chen's words were true. Normally, he wouldn't find himself in such a dangerous situation. S~eaʀᴄh the Nôvel(F)ire.ηet website on Google to access chapters of novels early and in the highest quality.<br/><br/>Today was different, however. The ambush by a Rank-4 monster was unusual enough, but what made it worse was the fact that the monsters in Stormhowl Valley seemed unnaturally agitated.<br/><br/>Under normal circumstances, with his experience, Kong Wei would have known when to retreat before his team became exhausted.<br/><br/>However, due to the unusually high number of monsters they encountered, he and his team were unfortunately exhausted fighting with them.<br/><br/>Furthermore, even though he retreated because of the changed situation, he was unfortunate enough to be ambushed by a group of monsters led by a Rank-4 beast.<br/><br/>What Kong Wei didn't know was that the root cause of this was Feng Chen himself.<br/><br/>Feng Chen had been terrifying the powerful monsters, driving them out of their usual territories and unintentionally disrupting the balance of Stormhowl Valley.<br/><br/>Had Feng Chen not been scaring off those beasts, Kong Wei and his team likely wouldn't have faced such peril.<br/><br/>Bao Mei and Xuan Chen approached, their faces pale but grateful.<br/><br/>\"Thank you for saving us,\"<br/><br/>Bao Mei said, her voice shaky.<br/><br/>\"We wouldn't have made it without you.\"<br/><br/>Feng Chen waved off her thanks.<br/><br/>\"It's safe from here. I will be going then!\"<br/><br/>Feng Chen said as he disappeared.<br/><br/>He had checked the surrounding area for any hiding monsters but found none.<br/><br/>So, he knew that Kong Wei and his team wouldn't get themselves killed.<br/><br/>With that, he quickly left and soon enough reached the Thundercrest Outpost.<br/><br/>He looked at the Stormhowl Valley for the last time before heading towards Misty Vale City.<br/><br/>********<br/><br/>Back at the Feng Clan, Elder Wei breathed a sigh of relief upon seeing Feng Chen return unharmed.<br/><br/>Elder Wei had been anxiously awaiting his return, knowing the risks involved in Feng Chen's expedition into Stormhowl Valley.<br/><br/>He then proceeded to update Feng Chen on the developments that had occurred in the Feng Clan during his absence.<br/><br/>With their current reputation, Feng Clan business has been flourishing, and can safely say that they were on the verge of becoming a first-class clan in Azure Sky Empire.<br/><br/>The Feng Clan also now boasts two alchemists who have advanced to Second Grade, further strengthening their dominance in the pill market.<br/><br/>Under Feng Yun's guidance and with his new recipes, the clan's alchemists have found renewed hope and potential.<br/><br/>The enhanced skills and innovative formulas have led to a surge in the quality and variety of their pills, setting them apart from their competitors.<br/><br/>This significant improvement not only boosts their standing in the market but also fortifies their position as the leading alchemical force in the region.<br/><br/>With these advancements, the Feng Clan is poised to further solidify its influence and expand its reach, both locally in Misty Vale City as well as in the Eastern Region.<br/><br/>The Cultivation of Feng Clan was also progressing well with many clan members having broken through including Feng Yun and others.<br/><br/>Elder Wei's eyes shone with pride as he detailed the Feng Clan's recent successes to Feng Chen. The clan's progress had been nothing short of remarkable.<br/><br/>\"The Feng Clan is thriving, Chen'er,\" Elder Wei said, his tone a mix of relief and enthusiasm.<br/><br/>\"With Feng Yun breaking through to the Core Formation Stage, I am sure that our ranking in Eastern Gathering will be very high!\"<br/><br/>Feng Chen listened intently, nodding in approval.<br/><br/>\"Thank you for your hard work!\"<br/><br/>Elder Wei shook his head modestly.<br/><br/>\"No, no. It's all thanks to you, Nephew. Your leadership and support have made all this<br/><br/>possible.\"<br/><br/>\"Haha! I just did what I could!\"<br/><br/>Feng Chen replied with a modest smile.<br/><br/>\"Elder Wei, I'll need you to look after the clan affair for a while longer. I'm on the verge of a breakthrough and will need to go into seclusion.\"<br/><br/>\"Break though?\"<br/><br/>\"Good! Nephew, you can leave these things to me and focus on your breakthrough.\"<br/><br/>Elder Wei was elated by the news and thought that Feng Chen would try to advance to the<br/><br/>Early Stage of the Three Elements Divine Realm.<br/><br/>In reality, Feng Chen was going to attempt to break through to the Early Stage of the Nascent<br/><br/>Soul Realm.<br/><br/>The higher one's cultivation, the longer it typically takes to break through to the next realm.<br/><br/>Yet, looking at Feng Chen, no one would have guessed that he was about to advance to the Early Stage of Nascent Soul Realm in less than a year.<br/><br/>That would be considered quick even for those in the Grand Qi Condensation Realm.<br/><br/>In any case, Elder Wei was pleased with the news and didn't mind taking on the extra<br/><br/>responsibility for Feng Chen and Feng Clan's sake.<br/><br/>He hoped that Feng Chen could achieve his breakthrough before the Eastern Gathering, as it would significantly boost their clan's ranking.\t\t\t\t\t\t</div>", "images": {}, "success": true}