{"id": 54, "url": "https://www.novelhall.com/my-brothers-the-protagonist-good-thing-i-awakened-my-system-33973/14946598.html", "title": "Chapter 54: Navigating Stormhowl Valley", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 54: Navigating Stormhowl Valley</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 54: Navigating Stormhowl ValleyHe pressed deeper into Stormhowl Valley, guided by the map in his hand.<br/><br/>The environment shifted dramatically as he ventured further. The skies were perpetually darkened by lightning and thunder, casting an eerie glow over the rugged terrain.<br/><br/>Feng Chen was also hit by the lightning several times but there were no injuries. Instead it seemed to have refined his body further.<br/><br/>\"As expected of Mid-Level Saint Grade Body Refinement Technique!\"<br/><br/>Until now, Feng Chen hadn't taken a single serious hit.<br/><br/>But the ease with which he absorbed the lightning strike, and the subsequent strengthening<br/><br/>of his body, made him fully grasp the true power of his Mid-Level Saint Grade Body Refinement Technique.<br/><br/>Its effectiveness was far beyond what he had anticipated.<br/><br/>As he advanced, the monsters he encountered grew more formidable, with Rank-3 beasts becoming the norm.<br/><br/>Of course, even the Rank-3 Monsters ran away from him when they felt his presence. However, that was different for Rank-4 monsters. It looks like despite knowing that Feng Chen was in Three Elements Divine Realm, they think they could take him on.<br/><br/>Several Rank-4 Beasts have attacked Feng Chen, though it didn't take even a minute to take care of them despite their large numbers.<br/><br/>After the battle, Feng Chen began gathering the dead bodies of those beasts.<br/><br/>The bodies of these Rank-4 monsters were valuable, their materials and core highly sought after.<br/><br/>Core of these monsters could easily be sold for thousands of Gold Coins. This is one of the reasons why Mercenary continues to risk their life in Stormhowl Valley.<br/><br/>\"Looks like there are indeed Rank-5 and even Rank-6 Monsters in the area of the treasure.\" Feng Chen muttered.<br/><br/>Feng Chen didn't think much about Rank-5 Monsters as with his Nascent Soul Realm Cultivation, he didn't think that they would be much of a problem for him.<br/><br/>But Rank-6 Monsters were a different story. He had never fought with Rank-6 and didn't know just how strong they were in comparison to him.<br/><br/>Although there was danger of encountering a Rank-6 Monster, Feng Chen didn't think about retreating at all.<br/><br/>Even if he can't kill Rank-6 Monster, escaping wasn't going to be a problem for him.<br/><br/>Moreover, he has Mid-Level Saint Grade Body Refinement Technique: Saintly Thunder Body which would make killing him very difficult for the monsters.<br/><br/>After storing the valuable cores and materials from the Rank-4 beasts in his spatial ring, he glanced at the map once more.<br/><br/>\"I should be close!\"<br/><br/>Feng muttered, and suddenly a huge creature jumped out from the side of a cliff. Though Feng Chen, who had sensed it coming, dodged it easily.<br/><br/>It was a Thunderclaw Lynx, its body crackling with electric energy, its eyes glowing with predatory intent.<br/><br/>The lynx was a Rank-5 beast, and the stormy environment of the valley only made it stronger. \"Not bad,\" Feng Chen muttered, unsheathing his sword with a swift motion.<br/><br/>\"Now that I think about it, this is the first time I am fighting with Thunderclaw Lynx. Let's see what you've got!\"<br/><br/>ROAR!<br/><br/>The Thunderclaw Lynx wasted no time, charging toward him with blinding speed, its claws crackling with lightning.<br/><br/>WHOOSH!<br/><br/>Feng Chen dodged effortlessly, his movements fluid as he parried the beast's attacks.<br/><br/>Each strike from the lynx sent sparks flying, but Feng Chen remained calm, observing the monster carefully.<br/><br/>Although he had heard that Thunderclaw Lynx was very fast with powerful attacks, Feng Chen didn't find that to be true.<br/><br/>Even if he was holding back, he didn't think that Thunderclaw Lynx could ever land a hit on him.<br/><br/>\"Shall I test how powerful the Thunderclaw Lynx attack is?\"<br/><br/>Feng Chen said as he stopped dodging Thunderclaw Lynx.<br/><br/>Feng Chen stopped in his tracks, a calm expression on his face as he allowed the Thunderclaw Lynx to come closer.<br/><br/>The beast, seeing an opportunity, roared and lunged forward, its claws crackling with lightning as they sliced through the air, aimed directly at Feng Chen's chest.<br/><br/>CRACK!<br/><br/>The strike landed, and though Feng Chen felt a slight sting, it was nothing serious.<br/><br/>His skin had barely been grazed, and the energy from the attack dissipated quickly, leaving only a faint mark.<br/><br/>Blood trickled from a small cut, but it was far from life-threatening.<br/><br/>\"Even when I deliberately allowed a Rank-5 beast to land a hit, the damage barely counts as injury.\"<br/><br/>Feng Chen muttered, glancing at the shallow injury.<br/><br/>The Thunderclaw Lynx recoiled, stunned that its strongest attack barely caused harm.<br/><br/>Meanwhile, Feng Chen marveled at the sheer defensive power of his Mid-Level Saint Grade Body Refinement Technique.<br/><br/>\"The Saint-Grade Technique truly lives up to its reputation. Taking a direct hit from a Rank-5 monster and sustaining only minor injuries? Impressive!\"<br/><br/>The lynx growled, more cautious now, circling him with its body low to the ground. Its eyes glowed with a mixture of confusion and frustration as it sized up its opponent.<br/><br/>It seemed to think about fleeing, seeing that the prey was not as weak as he thought.<br/><br/>\"Alright,\" Feng Chen said, cracking his knuckles.<br/><br/>\"You've had your chance. My turn now!\"<br/><br/>With a single burst of energy, Feng Chen countered. His sword flashed through the air, and in<br/><br/>an instant, he severed the lynx's lightning-charged claws.<br/><br/>ROAR!<br/><br/>The beast howled in pain, staggering back before Feng Chen finished it off with a decisive<br/><br/>strike.<br/><br/>\"Not bad for a Rank-5 beast, but not enough,\" he said, extracting the core and valuable materials from the monster.<br/><br/>As he stored them in his spatial ring, his thoughts drifted to the possibility of encountering Rank-6 beasts ahead.<br/><br/>\"If this is how easily I can handle a Rank-5, then I might not be as concerned about what's<br/><br/>coming next.\"<br/><br/>Feng Chen wasn't very concerned about encountering Rank-6 monsters after he took care of Rank-5 monsters so easily.<br/><br/>Instead there was anticipation and excitement. Feng Chen knew that he had to fight with<br/><br/>stronger enemies in the future, so fighting with Rank-6 monsters might serve as a practice for<br/><br/>his future fights.<br/><br/>Feng Chen continued forward, his steps light as he navigated through the increasingly jagged<br/><br/>terrain of Stormhowl Valley.<br/><br/>He came across a few more Rank-5 monsters, but Feng Chen easily defeated them and collected the valuable materials from their bodies.<br/><br/>He also experimented with quite a few of them and found that they were too weak to serve as<br/><br/>his practice.<br/><br/>\"I wish I could meet Rank-6 Monsters!\"<br/><br/>Feng Chen said as he was disappointed by the Rank-5 Monsters.<br/><br/>But sadly for him, he didn't encounter any Rank-6 monsters and he has reached the place<br/><br/>marked in the treasure map.<br/><br/>\"So, this is the place?\"<br/><br/>Feng Chen muttered as he checked the surroundings. He looked around for a few more times<br/><br/>but saw nothing extraordinary.<br/><br/>Feng Chen scanned his surroundings, frowning slightly as nothing immediately stood out.<br/><br/>The place marked on the treasure map looked ordinary-a barren patch of rocky terrain, with no sign of any hidden treasures.<br/><br/>He walked forward, his eyes narrowing as he activated his spiritual sense, searching for any<br/><br/>clues.<br/><br/>Just as he was about to conclude that perhaps the map was fake, a faint glimmer caught his<br/><br/>attention from a nearby boulder.<br/><br/>\"There's something here!\"<br/><br/>Feng Chen said excitedly.<br/><br/>Feng Chen quickly approached the area, extending his hand toward the faint shimmer.<br/><br/>As his palm drew near, a ripple spread through the air, revealing the presence of a hidden<br/><br/>formation.<br/><br/>\"Hmm, a Grade-4 Formation!\"<br/><br/>The formation created a protective barrier that seemed to block any living being, whether human or monster, from entering the area.<br/><br/>\"So this is what's keeping everything out.\"<br/><br/>Feng Chen mused, inspecting the formation more closely. The lines of the barrier were intricately woven, pulsing with a steady flow of energy.<br/><br/>He tapped the barrier lightly, feeling its resistance. It was strong, but not beyond his<br/><br/>capabilities to break.<br/><br/>There were two ways to break a formation.<br/><br/>The first was to understand it better than the person who created it and slowly dismantle it. The second way was brute force-just hit it hard enough, and it would break. This formation was powerful, a Grade-4 one, and could likely withstand attacks from someone in the Three Elements Divine Realm. But luckily, Feng Chen was in the Nascent Soul<br/><br/>Realm.<br/><br/>He was confident that even if he were still in the Three Elements Divine Realm, he could have destroyed it though there was no way to prove it.<br/><br/>\"Let's see if the System Store has any Formation Master Skills!\"<br/><br/>Feng Chen muttered as he quickly checked.<br/><br/>\"Ugh! 70,000 System Points for a Grade-3 Formation Master skill? Why not just rob me<br/><br/>outright?\"<br/><br/>Frustrated, he stopped browsing the store. If a Grade-3 skill cost that much, he was sure a<br/><br/>Grade-4 Formation Master skill would be way out of his reach, especially with his current low<br/><br/>budget.<br/><br/>\"Forget it. I'll just blast my way through!\"<br/><br/>He channeled his energy into his palm as he prepared to dismantle the formation.<br/><br/>BANG!<br/><br/>The impact struck the barrier but barely left a mark. \"Hmph, not even a dent,\" Feng Chen muttered, frowning slightly.<br/><br/>Next, he tried using his Earth Shattering Palm, channeling more power into the attack.<br/><br/>BANG!<br/><br/>The force hit the barrier with a mighty crash, but it still stood firm, only showing minor<br/><br/>ripples. Searᴄh the ηovelFire.ηet website on Google to access chapters of novels early and in the highest quality.<br/><br/>\"This Grade-4 Formation is tougher than I thought.\"<br/><br/>Feng Chen said, slightly frustrated.<br/><br/>\"I underestimated it. With my Three Elements Divine Realm Cultivation, it might have been<br/><br/>impossible to break the formation unless I brought that Grade-4 Formation Master skill.\"<br/><br/>Determined, Feng Chen summoned his sword. He took a deep breath and unleashed a powerful strike.<br/><br/>\"Heavenly Emperor's Sword!\"<br/><br/>The sword slashed through the air, its blade glowing with intense energy.<br/><br/>CRACK!<br/><br/>With a resounding crack, the barrier shattered, revealing the hidden treasure area beyond.<br/><br/>\"Now that's more like it!\"\t\t\t\t\t\t</div>", "images": {}, "success": true}