{"id": 57, "url": "https://www.novelhall.com/my-brothers-the-protagonist-good-thing-i-awakened-my-system-33973/14946601.html", "title": "Chapter 57: Skyshatter Tiger", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 57: Skyshatter Tiger</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 57: Skyshatter TigerFeng Chen headed west at a relaxed pace.<br/><br/>He wasn't in a hurry and took time to enjoy the view, easily defeating any monsters that tried to attack him along the way.<br/><br/>The place was different from the treasure area as he could occasionally see some mercenaries here and there.<br/><br/>Most of them were in the Grand Qi Condensation Realm and some were in the Core Formation Stage. They seemed to have strength similar to Kong Wei's team.<br/><br/>Even though the area was dangerous, the chances of running into a Rank-5 monster were very low.<br/><br/>On the other hand, there were a lot of precious herbs that could be found in such an area compared to others where there are many competitors.<br/><br/>Because of this, people with higher cultivation levels often chose to explore this area.<br/><br/>Of course, there was also no Rank-6 Monster in that part of the area. Otherwise, those mercenaries would never in a million years dare to come to this part of the area.<br/><br/>You could escape from a Rank-5 Monster if you had enough skill. But facing a Rank-6 Monster was certain death unless you were in the Nascent Soul Realm.<br/><br/>That's why there was no mercenary willing to go near the treasure area whereas the west of Stormhowl Valley was indeed dangerous but there was no Rank-6 Beast.<br/><br/>In any case, Feng Chen wasn't very interested in exploring the area which was already explored by other mercenaries.<br/><br/>He decided to venture deeper.<br/><br/>Naturally, those areas were the unexplored parts of Stormhowl, which was considered far too dangerous for mercenaries. No one had ever dared venture further than this.<br/><br/>Those areas were known as forbidden zones since it was extremely dangerous and was home to many Rank-6 Beasts.<br/><br/>Since the mercenaries' cultivation was only up to the Grand Qi Condensation Realm, there was no way for them to explore the deeper part of Stormhowl Valley.<br/><br/>And of course, for Feng Chen, those were rather sweet conditions for him to explore rather than retreat.<br/><br/>As Feng Chen ventured further into the unexplored region, he found no signs of human presence or any indication that anyone had been there before.<br/><br/>It was indeed a place that no mercenaries dared to go in. However, after another hour of walking, Feng Chen felt something was weird.<br/><br/>\"Hmm... Strange! There is no beast.\"<br/><br/>Feng Chen muttered.<br/><br/>He could understand if he hadn't encountered any humans as this was a forbidden area but couldn't understand why he hadn't encountered monsters either.<br/><br/>However, this just made things interesting for Feng Chen and he decided to venture further into the area.<br/><br/>It didn't take long for him to find the answer.<br/><br/>His eyes narrowed as he approached a secluded valley. There, nestled among jagged rocks and trees, a faint glow caught his attention.<br/><br/>Feng Chen's lips curled into a smirk, his heartbeat quickening as he caught sight of spiritual herbs. He recognized it instantly.<br/><br/>\"The Jade Seraphim Root...\"<br/><br/>He whispered under his breath, barely able to contain his excitement.<br/><br/>A rare herb of Grade 6 is said to strengthen one's physique to a level comparable to those born with extraordinary physiques.<br/><br/>It could turn a mediocre cultivator into a genius overnight.<br/><br/>But his gaze shifted from the glowing root to the darker presence looming nearby.<br/><br/>His eyes gleamed with an almost predatory hunger as he spotted the monster guarding the herb.<br/><br/>The ground trembled slightly, and in the dim light, a massive form emerged.<br/><br/>A Rank-6 Skyshatter Tiger, its fur crackling with bolts of lightning, prowled protectively near the herb. Its piercing yellow eyes locked onto Feng Chen.<br/><br/>It seems like the Skyshatter Tiger has already sensed Feng Chen's presence since it entered its territory.<br/><br/>A broad grin spread across Feng Chen's face.<br/><br/>\"Finally!\"<br/><br/>He said, almost laughing.<br/><br/>\"I searched for quite a long time for you!\"<br/><br/>While most would have been intimidated by the sheer presence of the Rank-6 beast, Feng Chen's blood surged with excitement.<br/><br/>The herb was valuable, no doubt, but the real treasure was standing right before him-a Rank-6 monster.<br/><br/>Feng Chen then understood why he didn't encounter any monsters. It was because they were aware that this was Skyshatter Tiger's territory.<br/><br/>Feng Chen cracked his knuckles, feeling the surge of his own qi as he stepped forward.<br/><br/>\"You and I,\" he murmured to the beast, \"are going to have some fun.\"<br/><br/>ROAR!<br/><br/>Skyshatter Tiger roared angrily at Feng Chen.<br/><br/>It might have been that it was offended by Feng Chen who entered its territory and was fearlessly heading towards him which might have been taken as an act of provocation.<br/><br/>The Skyshatter Tiger's growl shook the valley, its muscles tensing as sparks of electricity danced along its body.<br/><br/>Without hesitation, it lunged at Feng Chen with blinding speed, claws tearing through the air.<br/><br/>\"Ghostly Shadow Mirage\"<br/><br/>Feng Chen easily sidestepped the Skyshatter Tiger's strike, his figure blurring as the beast's claws tore through the illusion he left behind.<br/><br/>His \"Ghostly Shadow Mirage\" technique allowed him to move like a phantom, leaving afterimages in his wake.<br/><br/>The Skyshatter Tiger landed where Feng Chen had just been, snarling as it realized it had<br/><br/>struck only air.<br/><br/>Electricity sparked along its fur, the air around it crackling with energy. Its sharp eyes locked onto Feng Chen once more, fury was evident in its gaze.<br/><br/>Feng Chen stood a few feet away, his expression calm and composed. He raised his hand, gesturing for the Skyshatter Tiger to come at him again.<br/><br/>\"Is that all you've got?\"<br/><br/>He taunted, his voice light, almost playful.<br/><br/>ROAR!!!<br/><br/>The Skyshatter Tiger roared again, this time with even more rage.<br/><br/>It launched itself toward Feng Chen with even greater speed, bolts of lightning shooting from<br/><br/>its body and searing the ground in its wake.<br/><br/>Feng Chen's body flickered once more as he narrowly dodged the attack, the Skyshatter<br/><br/>Tiger's claws slicing through another afterimage.<br/><br/>His movements were fluid, each step calculated and precise.<br/><br/>The Storm Howl Tiger growled in frustration, shaking off the dust as it glared at Feng Chen.<br/><br/>Its yellow eyes flickered with lightning, showing its determination to continue the fight. It wasn't going to let its territory or the Jade Seraphim Root go without a serious battle.<br/><br/>Of course, he wouldn't know that Feng Chen was more interested in fighting him than those<br/><br/>things.<br/><br/>Feng Chen, still calm, could sense the beast's power growing with each second. He knew that killing Rank-6 monsters wouldn't be as easy as Rank-5.<br/><br/>Although Feng Chen was provoking the Skyshatter Tiger, he was barely keeping up with its<br/><br/>speed.<br/><br/>The only reason why Feng Chen was able to dodge the Skyshatter Tiger's attack was because Feng Chen could anticipate his attack.<br/><br/>Otherwise, if they were to compare their speed, Skyshatter Tiger was definitely faster than<br/><br/>Feng Chen.<br/><br/>The Skyshatter Tiger circled him, its muscles coiling as it prepared another attack. Then, with<br/><br/>a blinding flash, it shot forward again, faster and more unpredictable than before. Feng Chen barely had time to react as the Skyshatter Tiger's claws slashed across his chest,<br/><br/>drawing blood.<br/><br/>\"Not bad,\" Feng Chen muttered, wiping away the blood from the shallow wound.<br/><br/>This was the first time he had been injured unintentionally since he entered Stormhowl<br/><br/>Valley.<br/><br/>Of course, because of the Mid-Level Saint Grade Body Refinement Technique: Saintly Thunder Body, his body was tougher and what could have been a fatal attack was just a<br/><br/>shallow attack on Feng Chen.<br/><br/>Nonetheless, he was able to verify that Rank-6 Monsters was indeed much stronger than Rank-5 and had the potential to even kill him.<br/><br/>However, instead of cowering in fear, Feng Chen's eyes lit up with excitement.<br/><br/>\"You've got some fight in you.\"<br/><br/>The tiger didn't wait for his response, lunging again with its fangs bared, electricity arcing<br/><br/>through the air.<br/><br/>Feng Chen dodged to the side, but this time the beast was ready, twisting its body mid-air and striking Feng Chen with a powerful tail swipe.<br/><br/>The impact sent Feng Chen skidding across the ground, his feet digging into the earth to slow<br/><br/>himself.<br/><br/>He chuckled, more amused than hurt. The tiger wasn't just powerful; it was clever too. This fight was turning out to be much more fun than he expected.<br/><br/>\"You're stronger than I thought,\" Feng Chen said, his qi surging as he steadied himself.<br/><br/>Until now, Feng Chen had been on the defensive because he wasn't sure of the Skyshatter Tiger's full capabilities.<br/><br/>But after fighting it for a while, he now felt confident that he could defeat the beast.<br/><br/>ROAR!!!<br/><br/>The Skyshatter Tiger roared again, charging at him, bolts of lightning dancing across its fur as<br/><br/>it unleashed its full power.<br/><br/>CRACK! CRACK!<br/><br/>The ground trembled with each step as the air crackled with lightning. Feng Chen knew this<br/><br/>attack would be devastating if it connected.<br/><br/>Feng Chen's qi flared, and in a flash, he gathered his strength, unleashing a powerful palm<br/><br/>strike.<br/><br/>\"Earth Shattering Palm!\" Sёarᴄh the Nôvel(F)ire.ηet website on Google to access chapters of novels early and in the highest quality.<br/><br/>The air rippled as the two forces collided-Feng Chen's strike against the Skyshatter Tiger's<br/><br/>lightning-charged claws.<br/><br/>The explosion of power sent shockwaves through the valley, tearing up the earth beneath<br/><br/>them. Dust and debris filled the air, obscuring the view for a moment.<br/><br/>Feng Chen stood firm, his feet planted as the force of his attack clashed against the beast. For<br/><br/>a second, it seemed like he had overpowered the Skyshatter Tiger.<br/><br/>But then, through the clearing dust, Feng Chen realized something was off. He didn't feel the<br/><br/>resistance he expected from the Skyshatter Tiger.<br/><br/>As the air cleared, Feng Chen's eyes widened.<br/><br/>The Skyshatter Tiger had vanished.<br/><br/>\"Huh?\"<br/><br/>Feng Chen was surprised at the disappearance of the Skyshatter Tiger. He had never thought<br/><br/>that the SkyshatterTiger would run away like this.<br/><br/>With its speed, it was indeed impossible for Feng Chen to catch up to Skyshatter Tiger.<br/><br/>Moreover, Feng Chen has no idea where it has run off to.<br/><br/>It seemed that Feng Chen wasn't the only one assessing his opponent during this battle.<br/><br/>Skyshatter Tiger must have also been assessing Feng Chen's strength and concluded that he couldn't beat him and decided to escape which was indeed a smart move. Feng Chen couldn't help but respect the Skyshatter Tiger's decision.<br/><br/>It was no coward-it simply recognized his enemy and chose the best option. Feng Chen<br/><br/>might also have done the same thing.<br/><br/>Compared to one's life, what was a herb worth?<br/><br/>Of course, Skyshatter Tiger's escape was also due to Feng Chen's negligence. He never considered the monster to flee and also used such powerful attacks as a distraction.<br/><br/>In any case, this was the first time Feng Chen fought a Rank-6 monster and he was able to get<br/><br/>a lot of experience out of it.<br/><br/>So, even though the Skyshatter Tiger escaped, Feng Chen didn't suffer much loss. He would be<br/><br/>much more prepared the next time he fights another Rank-6 Monster.<br/><br/>He glanced back at the Jade Seraphim Root, still glowing softly amidst the rocks. Carefully, he<br/><br/>retrieved it and stored it away.<br/><br/>While it was a shame he couldn't get a Rank-6 monster body, at least he had the Jade<br/><br/>Seraphim Root.\t\t\t\t\t\t</div>", "images": {}, "success": true}