{"id": 58, "url": "https://www.novelhall.com/my-brothers-the-protagonist-good-thing-i-awakened-my-system-33973/14946602.html", "title": "Chapter 58: Leaving Stormhowl Valley", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 58: Leaving Stormhowl Valley</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 58: Leaving Stormhowl ValleyFor the next few days, Feng Chen continued to venture deeper into the unexplored parts of Stormhowl Valley.<br/><br/>Each day, he encountered various Rank-5 monsters, but none were able to pose much of a challenge.<br/><br/>There were also Rank-6 monsters that occasionally fell to Feng Chen's attacks, though some managed to evade his grasp.<br/><br/>It didn't take long for the news to spread among the beasts about the human who was going on a killing spree in their territory.<br/><br/>A Rank-6 Bloodfang Wolf sprinted through the valley, its breath labored as it dashed past a group of stunned Wind Eagles.<br/><br/>\"Run! It's not safe anymore!\"<br/><br/>The wolf howled.<br/><br/>A nearby Rank-6 Stoneback Bear, confused, raised its head.<br/><br/>\"What? What happened?\"<br/><br/>\"A Demon! A Demon has entered the valley! He's been slaying anything that crosses his path!\"<br/><br/>The wolf shouted without stopping.<br/><br/>Although he was a proud Rank-6 monster who ruled over his territory, there was no trace of that dignity at this moment.<br/><br/>\"Surely it can't be that bad...\"<br/><br/>The bear grumbled, turning its attention back to a nearby bush. A moment later, a sharp crack resounded through the air, followed by an ear-splitting roar.<br/><br/>\"Hahaha...\"<br/><br/>Feng Chen's laughter echoed from a distance, accompanied by the sound of yet another beast falling in battle.<br/><br/>The bear froze. Its eyes widened as it muttered, \"Oh no... the demon is here too.\"<br/><br/>The Rank-6 Monsters of Stormhowl Valley, usually proud and fierce, began fleeing their homes one by one, as Feng Chen fearlessly fought and took their resources.<br/><br/>If there were a court in Stormhowl Valley, those monsters would have surely gone to file a lawsuit against Feng Chen for unnecessary violence and destruction of property.<br/><br/>Alas, there was no real justice in this world and those monsters could only complain in their heart as they watched Feng Chen destroy their home.<br/><br/>Days passed, and Feng Chen remained oblivious to the chaos he had caused among the monsters.<br/><br/>For him, it was just routine training and fun, but for the creatures of Stormhowl, it was like a nightmare they couldn't escape.<br/><br/>Finally, after several days, Feng Chen decided to return home, feeling satisfied with his progress.<br/><br/>He also collected a lot of valuable material from monsters and collected precious herbs.<br/><br/>As he left, a Rank-6 Shadow Panther cautiously emerged from the shadows, watching him disappear over the horizon.<br/><br/>The Panther sighed in relief. \"He's... gone?\"<br/><br/>One by one, the monsters crawled out of their hiding places, their faces a mixture of relief and exhaustion.<br/><br/>\"Finally! We can live in peace again,\" the Bloodfang Wolf muttered, collapsing to the ground. \"I've never been so scared in my life,\" said the Stoneback Bear, slumping against a tree.<br/><br/>As the beasts slowly reclaimed their territory, one of the Wind Eagles hovered above, scanning the area before shouting down.<br/><br/>\"It's all clear! The Demon has left!\"<br/><br/>A collective cheer of relief swept through the monsters. For them, it was as if a great calamity had passed.<br/><br/>The usually arrogant and fearless Rank-6 monsters had been hiding and relentlessly chased by Feng Chen day and night.<br/><br/>Only now, with his departure, could they finally relax and reclaim their pride as Rank-6 monsters.<br/><br/>The valley was theirs once more-at least until Feng Chen decided to return.<br/><br/>\"I made a lot of profit coming to Stormhowl Valley.\"<br/><br/>On the other hand, Feng Chen without any guilt was excited thinking about the resources he got from Stormhowl Valley.<br/><br/>Not to mention the treasures from Grade-4 Formation Master, the amount of precious herbs The collected would already make this trip a very profitable one.<br/><br/>He was also able to fully use his Nascent Soul Realm power freely and gauge his own power.<br/><br/>He could safely say that he has become 10 times stronger since before he got the system.<br/><br/>With the advancement to Nascent Soul Realm and having learned Mid-Level Saint Grade Body Refinement Technique: Saintly Thunder Body, he felt that unless his opponent is Spirit Severing Stage, he couldn't be killed.<br/><br/>Of course, that is on the basis that his opponent isn't someone like a heavenly son or daughter with mastery of Saint Grade Technique.<br/><br/>In any case, these few days were enough for him to know about his own strength, and he was confident about how much power to use when dealing with his opponent.<br/><br/>However, there was some regret in his eyes because, for the last few days, he barely<br/><br/>encountered any Rank-6 monsters.<br/><br/>However, he couldn't stay for much longer as he didn't feel safe leaving his clan unattended<br/><br/>for very long.<br/><br/>Who knows what kind of trouble his clan might be in since his younger brother has a<br/><br/>protagonist template?<br/><br/>The good thing was that the token he gave to Elder Wie hadn't been broken, which shows that there wasn't any trouble at the moment.<br/><br/>And there was also an Eastern Gathering which was happening soon. For that, he needed to prepare a lot of things, and his presence was required in the clan.<br/><br/>After several hours of running, Feng Chen was already on the verge of reaching the<br/><br/>Thundercrest outpost.<br/><br/>\"AH! Help!\"<br/><br/>\"Somebody help us!\"<br/><br/>As Feng Chen neared the Thundercrest outpost, the distant cries for help snapped him out of<br/><br/>his thoughts.<br/><br/>\"This again?\"<br/><br/>Feng Chen frowned thinking it might be the same trap as before but then detected many<br/><br/>people getting attacked.<br/><br/>Unlike the previous trap where the woman was the only one getting attacked and begging for help, this one seemed genuine.<br/><br/>In any case, Feng Chen was going there to know whether the scream for help was genuine or a<br/><br/>trap.<br/><br/>Even if it was a trap, hardly anyone could kill him. So, there was not much he needed to think about when taking care of such a problem.<br/><br/>In a matter of seconds, Feng Chen reached before the people screaming for help and was surprised to find that they were someone that he knew.<br/><br/>\"Kong Wei?\"<br/><br/>Kong Wei and his group were the ones who were in trouble and the cause of their situation<br/><br/>was the group of monsters led by a Rank-4 monster.<br/><br/>\"F**K\"<br/><br/>Kong Wei cursed. He and his group were just returning from a successful hunt when they were ambushed by a group of monsters.<br/><br/>Under normal circumstances, they could have handled such a group, but they were currently exhausted from their previous battle and were in no condition to resist a group of monsters<br/><br/>led by a Rank-4 monster.<br/><br/>\"Captain, you should run!\"<br/><br/>One of the mercenaries said. Among them, Captain Kong Wei was the strongest and knew that<br/><br/>he could escape successfully.<br/><br/>\"Idiot! I am not going to abandon my companion. Moreover, it is not known whether we<br/><br/>would lose or not!\"<br/><br/>Kong Wei replied. Running away alone and leaving his companion behind was one thing that<br/><br/>he would never do.<br/><br/>At the moment, they are safe because he has been fighting with the Rank-4 monster. If he<br/><br/>runs away, then it is just a matter of seconds before his companions are killed by the<br/><br/>monsters.<br/><br/>He gritted his teeth and continued to fight, hoping that somebody would come to rescue<br/><br/>them.<br/><br/>The chaotic scene unfolded with increasing tension.<br/><br/>The young man and the wiry woman, both clearly out of their depth, were on the verge of<br/><br/>being overwhelmed.<br/><br/>The young man, barely out of his teens, struggled against a pair of Rank-3 Thornback Spiders.<br/><br/>His sword slashed wildly, but his movements were sluggish from exhaustion and fear.<br/><br/>Beside him, the wiry woman swung a spear in a desperate attempt to ward off the attackers, but the spiders' relentless assault was pushing her back.<br/><br/>Their plight became even more critical as the Nightcrawler Serpent, sleek and venomous, closed in on them with predatory grace.<br/><br/>The serpent's forked tongue flicked out, sensing the imminent taste of victory.<br/><br/>The woman's spear was nearly shattered from a particularly vicious bite of a spider, and the<br/><br/>young man's sword was growing heavier in his hands.<br/><br/>Amidst the growing desperation, Kong Wei engaged in his own battle with the Rank-4 Rockscale Baozard, was barely able to turn his head towards the plight of the young man and woman. His voice rang out with urgency and frustration,<br/><br/>\"Bao Mei! Xuan Chen! Hold on! I'm coming!\"<br/><br/>Kong Wei's shouts were barely audible over the roar of the lizard and the clash of weapons.<br/><br/>He was locked in a fierce struggle, unable to break away to aid the duo who were now clearly<br/><br/>in their final moments of struggle.<br/><br/>The Rank-3 monsters closed in, their fangs and claws poised to deliver the final blows.<br/><br/>Bao Mei's spear snapped as she took a vicious bite from a spider, and Xuan Chen's sword fell from his hand, his strength finally giving out as the serpent prepared to strike.<br/><br/>Just as the situation seemed hopeless, a slash appeared out of nowhere taking both the lives<br/><br/>of Rank-3 monsters.<br/><br/>Kong Wei's eyes widened with a mix of hope and relief at the sudden appearance of the helper.<br/><br/>\"You are...\"<br/><br/>Kong Wei seemed to have noticed Feng Chen and felt that he had seen him somewhere. S~eaʀᴄh the NôᴠelFirё.net website on Google to access chapters of novels early and in the highest quality.<br/><br/>\"You are that nobleman!\"<br/><br/>Bao Mei interrupted with a surprise on her face.<br/><br/>\"Why are you still here?\"<br/><br/>Bao Mei asked confusedly. It had been many days since their initial encounter and by now, she<br/><br/>has assumed that Feng Chen must have returned to his home.<br/><br/>Who would have thought that Feng Chen was staying at Rank-6 Monster territory alone for so<br/><br/>many days?<br/><br/>\"Let's talk later!\"<br/><br/>Feng Chen said as he focused on the monsters who were still alive.<br/><br/>Of course, at his current strength, those monsters were not able to resist at all, and under 3<br/><br/>moves, all the monsters in the vicinity had been killed by him.<br/><br/>As expected of the person called 'Demon' by Rank-6 monsters.<br/><br/>Kong Wei and others just watched the scene with their jaw hanging on their face. The monster<br/><br/>that they could barely resist was wiped out in a few seconds.<br/><br/>This display of power was enough for them to guess that Feng Chen was in the Three<br/><br/>Elements Divine Realm or higher. \"Indeed, a powerful nobleman!\"\t\t\t\t\t\t</div>", "images": {}, "success": true}