{"id": 55, "url": "https://www.novelhall.com/my-brothers-the-protagonist-good-thing-i-awakened-my-system-33973/14946599.html", "title": "Chapter 55: Grade-5 Formation", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 55: Grade-5 Formation</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 55: Grade-5 FormationAs the barrier shattered, a wave of energy rippled through the air, and Feng Chen stepped forward into the hidden area.<br/><br/>The surroundings shifted almost instantly. The rocky terrain gave way to an ancient, mysterious chamber hidden deep within the valley.<br/><br/>Previously, he didn't have much expectation from the treasure map seeing that it was obtained from the Zhao Family treasurer.<br/><br/>But it was a different story now!<br/><br/>After all, a powerhouse capable of becoming a Grade-4 Formation Master or hiring a Grade-4 Formation Master wouldn't be lacking in wealth and must have gathered countless treasures throughout his lifetime.<br/><br/>Feng Chen anticipated that the treasure contained within might be something that could even move the Top Sect and Clan of Azure Sky Empire.<br/><br/>Feng Chen's eyes brightened as he took in the scene.<br/><br/>\"Such a big chamber!\"<br/><br/>What he initially thought was a small space revealed itself to be vast, filled with countless items once he stepped inside.<br/><br/>His heart raced as he realized that the treasure wasn't just one thing-there were multiple items waiting for him.<br/><br/>He approached cautiously, making sure there weren't any hidden traps. His spiritual sense swept over the room, confirming that there were no dangers.<br/><br/>Satisfied, he reached out and picked up the scroll first.<br/><br/>\"Hm, it looks like a Martial Art Technique,\" he murmured, unrolling it to examine the contents.<br/><br/>The script was old and faded.<br/><br/>\"A High-Level Earth Grade Technique? Not bad but it is practically useless for me.\"<br/><br/>Feng Chen muttered. It could have been a huge deal for Feng Chen if he had gotten this before The got the System.<br/><br/>But now that he has Heaven-Grade Techniques, Earth-Grade technique was practically useless to learn.<br/><br/>Moreover, he would need to spend a lot of time mastering the technique whereas the techniques from the System could automatically be mastered in seconds.<br/><br/>Nonetheless, it was quite valuable and could be sold for a very high price in an auction.<br/><br/>\"Misty Vale City doesn't have the capacity to buy such high-grade techniques. Good thing that Eastern Gathering is happening!\"<br/><br/>Feng Chen exclaimed happily.<br/><br/>In Misty Vale City, only the Major Family would have the capacity to buy Earth-Grade Technique, and that also only has something low grade.<br/><br/>With him eliminating three of the Five Major Clans, there was only the Wang Clan who might be able to afford it, also on the assumption that Wang Yifan is willing to take out all his clan's savings.<br/><br/>If he tried to sell this technique in Misty Vale City, he was afraid that it would take years before he could find a buyer who could afford it.<br/><br/>However, to his fortune, the Eastern Gathering was about to be held. Eastern Gathering not only has the most powerful clan from each city but they are also the wealthiest.<br/><br/>Where else would be more fitting to sell this than at the Eastern Gathering?<br/><br/>(Those Clan Leaders would definitely fight hard to obtain this Martial Art.)<br/><br/>Feng Chen thought.<br/><br/>Although to him and his clan who have Heaven-Grade Techniques, this might be subpar Martial Art Technique but to others, this could be their life-changing technique which could advance their clan's strength.<br/><br/>For that, they would not be stingy and do everything in their power to obtain it.<br/><br/>With so many powerful clans coming, he was sure that this Technique could be sold for a very hefty price.<br/><br/>\"Hehe! There are two more scrolls!\"<br/><br/>Feng Chen grinned happily as he looked through them. They were also Earth-Grade Techniques, just in that they were mid-level.<br/><br/>\"Nice!\"<br/><br/>Feng Chen believed that just those three techniques alone would bring him great wealth, making this journey worthwhile.<br/><br/>He expected nothing from the treasure map but ended up with a big surprise.<br/><br/>However, this was only the beginning-there were still many more treasures within this place.<br/><br/>Next were the shelves lined the walls, filled with books of various sizes, all meticulously organized.<br/><br/>He ran his hand over one of the books, unfurling it carefully.<br/><br/>\"Grade-1 Formation Principles.\"<br/><br/>He read aloud, his eyes scanning the detailed drawings and explanations.<br/><br/>Each line was precise, and every word was carefully chosen to impart the complexity of formations to its reader.<br/><br/>Feng Chen's excitement grew as he moved through the chamber, finding books on formations from Grade 1 all the way to Grade 4.<br/><br/>Some books were old and worn, their paper yellowed with age, while others seemed newer, as if recently copied from older texts.<br/><br/>\"Looks like this Chamber indeed belonged to a Grade-4 Formation Master!\"<br/><br/>Feng Chen murmured.<br/><br/>Feng Chen immediately stored those books inside his storage ring. He thought that these books might help the juniors in his clan to become Formation Masters.<br/><br/>(Formation Masters keep their knowledge highly secretive, making it very difficult to obtain<br/><br/>their knowledge.)<br/><br/>Hence, one of the reasons why Feng Clan didn't have even one Formation Master.<br/><br/>Of course, even with knowledge, it is said to be extremely hard to become one.<br/><br/>However, without any information, it would be impossible to trend on the path of becoming<br/><br/>one.<br/><br/>Thankfully, Feng Chen had finally obtained the knowledge of the Grade-4 Formation Master. \"This could help those Clan members who might want to be Formation Master.\"<br/><br/>Feng Chen continued.<br/><br/>\"Previously, I thought about using the System Store but it looks like there is no need.\"<br/><br/>The system has almost everything but that is also why Feng Chen was getting poorer and<br/><br/>poorer.<br/><br/>Thankfully, he could save those System Points.<br/><br/>\"In any case, it looks like I have almost emptied the chamber. All that is left is that box!\"<br/><br/>Feng Chen also had the highest expectation of the box as it was the only object that was particularly stored well. From just this alone, he could tell that it would be extremely<br/><br/>valuable.<br/><br/>CLANK!<br/><br/>With steady hands, Feng Chen opened the box, revealing a single book bound in deep blue<br/><br/>leather. seaʀᴄh thё Nôvel(F)ire.nёt website on Google to access chapters of novels early and in the highest quality.<br/><br/>\"Grade-5 Formation: The Heavenly Shield Array,\" Feng Chen whispered, his voice filled with<br/><br/>awe.<br/><br/>This was an incredibly rare find-books on Grade-5 formations were nearly impossible to come by, at least in Azure Sky Empire.<br/><br/>He has heard about Grade-4 Formation Master but there was no news about any Grade-5 Formation Master in Azure Sky Empire.<br/><br/>It could be that there is none or that the Grade-5 Formation Master is not showing himself. Though Feng Chen was more certain about the former than the latter.<br/><br/>Why would someone so powerful choose to hide instead of basking in fame and wealth?<br/><br/>There weren't any Grade-5 Formations in the Azure Sky Empire, let alone a Grade-5<br/><br/>Formation Master, at least to Feng Chen's knowledge.<br/><br/>\"This is priceless!\"<br/><br/>Feng Chen muttered excitedly.<br/><br/>Unlike the previous techniques, this thing could attract the attention of every powerhouse of<br/><br/>the Azure Sky Empire.<br/><br/>Even those clans and sects without a Formation Master would be greedy to buy this thing.<br/><br/>Why, One might ask?<br/><br/>Why would someone who isn't even a Formation Master want a book about Formation?<br/><br/>Because something so coveted by a Grade-4 Formation Master could easily be used as a bribe<br/><br/>to gain their allegiance.<br/><br/>Grade-4 Formation Masters have everything they could want and are said to be beyond the need to pledge allegiance to any particular sect or clan.<br/><br/>However, that could change if one were to offer information about Grade-5 Formation.<br/><br/>Who would want to miss the chance to become Azure Sky Empire's first Grade-5 Formation<br/><br/>Master?<br/><br/>Feng Chen didn't know what to do with this for now. However, he knew that this would come in handy in the future.\t\t\t\t\t\t</div>", "images": {}, "success": true}