{"id": 68, "url": "https://www.novelhall.com/my-brothers-the-protagonist-good-thing-i-awakened-my-system-33973/14946614.html", "title": "Chapter 69: Grand Elder Of Spirit Wind Palace", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 69: Grand Elder Of Spirit Wind Palace</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 69: Grand Elder Of Spirit Wind PalaceEveryone already knew about this as this is what has been happening for decades. Just that there would be differences in what those competitions would be.<br/><br/>Apart from that, most of the time, Eastern Gathering competitions consist of such parts.<br/><br/>\"Now, before we get on with the first round, let's welcome the honored guest who has come to witness this wonderful competition.\"<br/><br/>The crowd stirred in anticipation as Tianlong Zhen announced the arrival of the honored guest.<br/><br/>Whispers filled the air, speculation running wild about who this esteemed figure could be.<br/><br/>For Tianlong Zhen to show such respect, they knew that the person would be someone with a higher standing than the Tianlong Clan.<br/><br/>As if on cue, the doors to the pavilion swung open, and an elderly figure stepped forward.<br/><br/>His silver beard flowed down his chest, and his posture, though aged, exuded an aura of immense power.<br/><br/>The old man wore simple robes of white and blue, yet the energy surrounding him was unmistakable-the aura of someone who was very powerful.<br/><br/>\"Behold, the esteemed guest of this year's Eastern Gathering, Grand Elder Ren Daoyu from Spirit Wind Palace!\"<br/><br/>Tianlong Zhen announced with great reverence.<br/><br/>A hushed awe fell over the crowd. Ren Daoyu's name was known throughout the empire.<br/><br/>As a grand elder of Spirit Wind Palace, one of the most prestigious sects in the Azure Sky Empire, his presence alone was a symbol of immense authority and influence.<br/><br/>Even the strongest clans would bow in respect to a figure of his stature.<br/><br/>This is also the reason why the people who saw Grand Elder Ren Daoyu became excited. \"Grand Elder from Spirit Wind Palace has come to Eastern Gathering? Is it the first time?\"<br/><br/>\"Yeah, normally they would never bother with these events themselves. At most, they would send their elders, but Grand Elder? Never!\"<br/><br/>\"Haha... My son has a chance to get into Spirit Wind Palace. The Grand Elder will definitely recruit my son after seeing his talent. He might even become his personal disciple!\"<br/><br/>\"Yeah, Yeah! Dream on. Is your son's talent worth becoming a personal disciple of the Grand Elder of Spirit Wind Palace? Even those geniuses in the capital struggle to become one.\" \"But why is he here now?\"<br/><br/>To that question, many of them looked at the Feng Clan with pity, while others, like the Bai Clan, wore expressions of smug satisfaction.<br/><br/>Feng Chen also looked up to see this Grand Elder from Spirit Wind Palace with curiosity.<br/><br/>The rest of the Feng Clan was nervous. With Feng Chen having killed Elder Zhou Tianhua, one didn't need to know why one of the Grand Elders of Spirit Wind Palace was there.<br/><br/>They were sure that this Grand Elder must be there to trouble the Feng Clan.<br/><br/>Feng Chen, on the other hand, was relatively relaxed with even some signs of amusement. (Grand Elder? Just at the Top of Three Elements Divine Realm!)<br/><br/>Feng Chen thought. He would have been troubled if Spirit Wind Palace sent one of their Nascent Soul Realm but Three Elements Divine Realm was no longer an opponent for him. The murmurs of the crowd quieted as Tianlong Zhen stepped forward once more.<br/><br/>\"Grand Elder Ren Daoyu has graced us with his presence to witness the talents of the Eastern Region's finest. We are honored by his presence and hope that the performances today will be worthy of his esteemed attention.\"<br/><br/>Ren Daoyu nodded ever so slightly, his eyes still scanning the crowd. \"I look forward to seeing the younger generation prove their worth.\"<br/><br/>He said, his voice low but resonating with authority. \"This time not only did I come here to witness the competition but also to select three disciples for our Spirit Wind Palace!\"<br/><br/>The moment Ren Daoyu's words echoed through the pavilion, a ripple of excitement surged through the crowd.<br/><br/>Selecting disciples for the prestigious Spirit Wind Palace was a rare and coveted opportunity, one that could change the fate of any clan or individual.<br/><br/>The murmurs grew louder, filled with both awe and ambition.<br/><br/>\"Three disciples?\" someone whispered in disbelief.<br/><br/>\"That's unheard of!\"<br/><br/>\"It's the chance of a lifetime,\" another said, eyes glinting with hope.<br/><br/>Among the clans, the tension heightened.<br/><br/>A spot in Spirit Wind Palace would bring unimaginable honor and power, not just to the individual, but to their entire clan.<br/><br/>\"Hmph!\" Sёarᴄh the NôvelFire(.)net website on Google to access chapters of novels early and in the highest quality.<br/><br/>Feng Yun, who heard this, snorted. He, like many, knew that the Grand Elder was there to deal with their Feng Clan despite the claim that he was there to select disciples.<br/><br/>Does a Grand Elder really need to come to recruit mere disciples?<br/><br/>After that, Grand Elder Ren slowly walked towards the seat near Tianlong Qi which was prepared beforehand.<br/><br/>\"The Xue Clan of Frostwind Valley greets Grand Elder Ren Daoyu, wishing you an endless legacy of greatness!\"<br/><br/>\"The Xun Clan from Silver Peak pays its respects to Grand Elder Ren, may your influence shine like the sun across the land!\"<br/><br/>\"The Wu Clan of Thunder Gorge salutes Grand Elder Ren, may your path be as smooth as the flowing rivers of time!\"<br/><br/>...<br/><br/>Many clans presented their compliments with eagerness, hoping their words would catch the Grand Elder's favor, knowing that his acknowledgment could change their futures.<br/><br/>Ren Daoyu nodded slightly, a small smile playing on his lips. He was truly pleased to have people compliment him.<br/><br/>\"This is our Wu Clan's greatest genius, Wu Shi. He is already in the Core Formation Stage and destined to become one of the strongest.\"<br/><br/>\"Our Xun genius is also in the Core Formation Stage and his age is only 19 years old.\"<br/><br/>...<br/><br/>Of course, they also started introducing their geniuses in the hope of catching Grand Elder Ren's eyes and having him select their geniuses as his disciple.<br/><br/>Ren Daoyu's expression remained calm as the various clans eagerly introduced their so-called geniuses, each trying to outshine the other in the hopes of catching his favor.<br/><br/>The Grand Elder listened to their claims, the smile on his face faint but polite, as though he'd heard this all before. After all, for someone of his status, these talents were mere sparks in a<br/><br/>sea of flames.<br/><br/>The pavilion quieted again as Ren Daoyu raised a hand. His voice, though gentle, cut through the air with authority.<br/><br/>\"Talented young warriors are the lifeblood of a strong sect,\" he said.<br/><br/>\"If your performances today are exceptional, your talent will not go unnoticed. As I said, I came here to select at least three disciples, but if you can perform well, I don't mind increasing the quota.\"<br/><br/>The hopeful expressions of the clan leaders faltered slightly, but they quickly regained their<br/><br/>composure.<br/><br/>They knew that to gain the approval of the Grand Elder, words and claims alone would never<br/><br/>be enough.<br/><br/>They need to show him that their genius was worthy of being a disciple of Spirit Wind Palace!\t\t\t\t\t\t</div>", "images": {}, "success": true}