{"id": 69, "url": "https://www.novelhall.com/my-brothers-the-protagonist-good-thing-i-awakened-my-system-33973/14946615.html", "title": "Chapter 70: Pillar Of Aptitude", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 70: Pillar Of Aptitude</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 70: Pillar Of AptitudeOnce the clans had finished greeting Ren Daoyu and the atmosphere settled down, Tianlong Zhen stepped forward once again.<br/><br/>His voice, sharp and clear, rang through the pavilion.<br/><br/>\"Now, the Grand Competition will begin! Those under 20 will go through the Pillar of Aptitude!\"<br/><br/>As he spoke, the crowd watched intently, their curiosity piqued as they saw an enormous stone staircase materialize in the center of the competition ground.<br/><br/>\"Before you is the Pillar Of Aptitude,\" Tianlong Zhen announced, gesturing toward the towering staircase.<br/><br/>\"Twenty steps, each one steeper and heavier than the last. The higher you climb, the more your body will be weighed down by a powerful pressure that tests not only your physical endurance but also your mental fortitude.\"<br/><br/>His words sent ripples of excitement through the younger participants, though there were some who visibly trembled at the challenge ahead.<br/><br/>This was commonly chosen as the first test in every part of Azure Sky Empire.<br/><br/>Because this challenge clearly shows the talent and perseverance one has which is very important for cultivators.<br/><br/>Another reason why this was selected was because this challenge mostly takes one hour to complete, so it is just enough for starting a competition.<br/><br/>Feng Yun, standing alongside the other Feng Clan members, gazed at the stone staircase with a hint of excitement in his eyes.<br/><br/>This was the first time that they had seen something like this. In their Clan or Misty Vale City, the only way for one to find talent would be through fights.<br/><br/>They didn't know just how they would fare against others and were excited to find out.<br/><br/>\"Ah, It's this again!\"<br/><br/>One of the older Bai Clan members muttered under his breath with a hint of disappointment.<br/><br/>Although his cultivation and strength were better than most, he always ended up losing to those weaker people.<br/><br/>He was stronger than them, so he didn't understand why he could only climb to the 5th step while they could go to the 6th and 7th steps in the Pillar Of Aptitude.<br/><br/>\"Last time, the highest anyone reached was the eleventh step.\"<br/><br/>He said with envy. That person, although didn't win the second and third rounds, ended up getting recruited by Spirit Wind Palace due to having climbed the eleventh step.<br/><br/>Pillar Of Aptitude is vastly used throughout the Azure Sky Empire including those sects to gauge the talent of the people.<br/><br/>And for those who reached the 10th step, the sect is willing to recruit them. Some even directly make them core disciples because those who climbed to the tenth step are considered to have the potential to at least reach the Grand Qi Condensation Realm.<br/><br/>Feng Chen also looked at the Pillar Of Aptitude with a smile.<br/><br/>He remembered having climbed this Pillar Of Aptitude in the capital when he and his family visited Ling Jian in the capital.<br/><br/>(Was I 10 at the time?)<br/><br/>Feng Chen remembered that there was a fancy Pillar in the middle of Capital City where people were climbing the stairs.<br/><br/>Later on, he learned that it was a way for one to know the talent of a person and just how far they will go in their cultivation journey.<br/><br/>Feng Chen naturally became curious and sneakily climbed the stairs when no one was around. And the result? seaʀᴄh thё Nôvelƒire.net website on Google to access chapters of novels early and in the highest quality.<br/><br/>He had climbed to the highest stair.<br/><br/>Now, he thinks about it, Feng Chen thought that it was because he has a memory of his previous life and naturally has more perseverance than his peers.<br/><br/>At that age and cultivation, the pressure he felt wasn't much, and only after the 15th stage did The struggle a bit.<br/><br/>Feng Chen concluded that his success was more a result of his perseverance and mature mindset rather than sheer talent. If he were to assess his talent objectively, he believed he would only manage to reach the 15th step at most.<br/><br/>However, due to his perseverance which was unnatural for a 10-year-old, he was able to make it to the top.<br/><br/>If he did now, Feng Chen thought that it might be different. He might not be able to climb as far high as he did when he was little.<br/><br/>However, he will never know because this Pillar Of Aptitude is only for those under the Three Elements Divine Realm.<br/><br/>\"Eleventh Steps? Damn! The most I could climb previously was only the 6th steps. Looks like I can't win this.\"<br/><br/>\"This is my first time but I don't think climbing these steps would be hard!\"<br/><br/>\"Hmph! What do you know? This step is harder to climb than it looks. Don't think cultivation is of any use here. The higher the cultivation, the more pressure you will feel.\"<br/><br/>One of them explained with disdain. He was also thinking the same when it was their first time, thinking that they could easily climb to the tenth step and be recruited in some sect. However, reality was often disappointing and they tried their best only to be around 6th steps. Then only did they understand just how hard it was to climb to the tenth step.<br/><br/>Tianlong Zhen raised a hand, silencing the murmurs of the crowd.<br/><br/>\"The rules are simple. The one who climbs the highest will get 50 points and the second one will get 45 points followed by 40 points for third position and so on and so forth. But remember, each step is a test of your will and perseverance. Do not think this is a mere show<br/><br/>of strength.\"<br/><br/>Tianlong Zhen continued.<br/><br/>\"Now, then every participant below 20 years of age should come here and get ready. We will end the test in one hour and the points for each clan will be calculated according to each<br/><br/>member.\"<br/><br/>Tianlong Zhen's voice faded as the young geniuses from each clan began stepping forward<br/><br/>toward the Pillar of Aptitude.<br/><br/>Among the Feng Clan, five figures stood out, each with a determined expression.<br/><br/>\"Brother, I will go first then.\"<br/><br/>\"Brother Chen, I will not disappoint you.\"<br/><br/>\"Family head, we promise you to get the Top position for our clan.\"<br/><br/>\"Family head, I will definitely climb above the 10th steps.\"<br/><br/>\"Family master, I make sure that I don't get left behind!\"<br/><br/>Feng Chen, standing at the front, was happy to see their determination. He could already see<br/><br/>from his Eyes of Insight that they would do great and wasn't very worried.<br/><br/>Though he was a bit worried for Feng Jianhong, who although has good talent wasn't very talented compared to Feng Xiaoyu or Feng Liang much less Feng Mei or Feng Yun.<br/><br/>He would definitely feel down if he was left out by other Feng members even if he could climb<br/><br/>higher than others.<br/><br/>But this Pillar Of Aptitude wasn't just about talent but also about perseverance.<br/><br/>Although his talents weren't comparable to those of other Feng Clan participants, Feng Chen believed that his perseverance would surely help him climb higher.<br/><br/>Feng Jianhong has always been less talented than them but so what? Didn't he reach the Core Formation Stage just as well?<br/><br/>He was even faster than Feng Liang who was more talented and was also a bit older. Despite<br/><br/>the odds, Feng Jianhong surpassed him.<br/><br/>How?<br/><br/>Feng Chen knew the answer.<br/><br/>Although Feng Jianhong liked to mess around, he was well aware of his inferior talent<br/><br/>compared to Feng Liang or Feng Mei.<br/><br/>Therefore, the only thing he could do was put more effort into cultivation so as to not lag<br/><br/>behind.<br/><br/>Feng Jianhong thought that if his rival were twice as talented as him then he could only work twice as hard in order to not get left behind.<br/><br/>Feng Chen had seen Feng Jianhong training multiple times late at night even when no one was<br/><br/>around.<br/><br/>This is one of the reasons why Feng Chen believes that Feng Jianhong has one of the best<br/><br/>perseverance.<br/><br/>The only exception was Feng Yun, whose unwavering willpower stemmed from the time he<br/><br/>was labeled as \"Trash\".<br/><br/>During that period, he worked tirelessly despite his cultivation showing no signs of improvement, demonstrating remarkable perseverance.<br/><br/>Feng Chen's lips curled into a subtle smile as he addressed his clan's younger generation.<br/><br/>\"I have faith in each of you. Now go and show everyone the strength of the Feng Clan.\"\t\t\t\t\t\t</div>", "images": {}, "success": true}