{"id": 64, "url": "https://www.novelhall.com/my-brothers-the-protagonist-good-thing-i-awakened-my-system-33973/14946608.html", "title": "Chapter 64: Breaking Bai Zhang", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 64: Breaking Bai Zhang</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 64: Breaking Bai ZhangBai Zhang's sneer faltered for a moment as he met Feng Chen's eyes.<br/><br/>For a moment, he felt like a rabbit looking at a tiger.<br/><br/>But how could Bai Zhang back down so easily?<br/><br/>Especially since all the other clans are paying attention to them at the moment.<br/><br/>He felt a surge of anger when he thought about being scared of Feng Chen for a second and angrily yelled.<br/><br/>\"You talk big for a dead guy!\"<br/><br/>Without waiting for another word, he lunged at Feng Chen, ready to punch Feng Chen with his full strength.<br/><br/>His speed was impressive-too fast for those in the Core Formation Stage and below.<br/><br/>Many in the crowd gasped, expecting Feng Chen to be struck down instantly.<br/><br/>But Feng Chen didn't move. His eyes remained calm, his body still.<br/><br/>And just when Bai Zhang's attack was inches from landing, Feng Chen's hand shot out, faster than a lightning strike, grabbing Bai Zhang's wrist in midair.<br/><br/>The air seemed to freeze.<br/><br/>Bai Zhang's momentum came to a screeching halt, his body lurching forward as he tried to force his strength down on Feng Chen.<br/><br/>But it was no use.<br/><br/>Bai Zhang's eyes widened in shock as he felt his power being effortlessly neutralized.<br/><br/>He tried to pull away, but Feng Chen's grip was like iron, unmoving and unyielding.<br/><br/>The crowd fell silent, many unable to believe what they were seeing.<br/><br/>They didn't think that Feng Chen would be able to stop Bai Zhang's punch.<br/><br/>One should know that the Three Elements Divine Realm punch was nothing to scoff at and could even break steel.<br/><br/>However, Feng Chen just caught his punch like an adult handling a child's attack.<br/><br/>Moreover, Feng Chen's expression never wavered, always calm and composed even when Bai Zhang attacked.<br/><br/>\"You're weaker than I thought.\"<br/><br/>Feng Chen said as if disappointed.<br/><br/>Of course, compared to those attacks from Rank-5 and Rank-6 monsters in the Stormhowl Valley, Bai Zhang's punch was like paper without any weight.<br/><br/>Even if he didn't catch his punch, Bai Zhang could hardly even dent his skin.<br/><br/>Bai Zhang gritted his teeth and tried to push more power into his attack, his other hand surging forward in a desperate attempt to land a blow.<br/><br/>But Feng Chen was faster-his other hand shot up and caught Bai Zhang's second wrist with ease, twisting it painfully behind his back.<br/><br/>\"ARGH!\"<br/><br/>Bai Zhang let out a startled yelp, his arrogance vanishing in an instant.<br/><br/>\"W-what are you-\"<br/><br/>His voice cracked as Feng Chen applied more pressure, bending his arm at an unnatural angle.<br/><br/>Pain shot through Bai Zhang's body, and the proud leader of the Bai Clan began to struggle like a trapped animal.<br/><br/>\"AHHH! Let go! You-!\"<br/><br/>CRACK!<br/><br/>He shouted, but his words quickly turned into a scream of agony as Feng Chen twisted his arm further, forcing him down onto one knee.<br/><br/>\"Family Head!\"<br/><br/>\"Clan Leader!\"<br/><br/>The two elders accompanying Bai Zhang cried out in alarm.<br/><br/>They never thought that Bai Zhang, the strongest person in their clan who is renowned for his physical strength, would find himself overpowered like this by Feng Chen.<br/><br/>\"Let him go! You have no idea what you're doing! This is the Eastern Gathering, and you can't act so recklessly!\"<br/><br/>The Bai clan's elders said without thinking that they were the first ones who had forgotten that this was the Eastern Gathering and had attacked first.<br/><br/>The other elder, equally alarmed, chimed in.<br/><br/>\"You think you can humiliate Bai Zhang without consequences? The Bai Clan is loyal to the Third Prince! You will pay dearly for this!\"<br/><br/>Knowing that they, who are just in the Grand Qi Condensation Realm, are no match for Feng Chen.<br/><br/>Instead, they sought to threaten Feng Chen with their word.<br/><br/>Feng Chen, however, remained unfazed, his grip tightening slightly on Bai Zhang's arm as he leaned in closer, his voice low and steady.<br/><br/>\"Is that so? What will the Third Prince do? Send flowers to Bai Zhang's funeral?\"<br/><br/>Feng Chen replied, without any fear of the Third Prince. Compared to the Mystic Flame Sect or Spirit Wind Palace, the Third Prince could only be said to be a child.<br/><br/>Since he had already made an enemy out of the two sects, the Third Prince wasn't going to scare him.<br/><br/>Even if he offends the Third Prince, so what?<br/><br/>Moreover, if he let Bai Zhang go because of their words, other clans would think that their Feng Clan is easy to provoke.<br/><br/>CRACK!<br/><br/>Bai Zhang winced at the increased pressure, struggling against Feng Chen's grip, but the more The fought, the tighter it became.<br/><br/>Panic set in as he felt the strength draining from his limbs, and the realization that he was outmatched crashed down on him.<br/><br/>\"Stop! You're making a mistake!\"<br/><br/>The elder implored, taking a step closer, his tone shifting from worry to a hint of desperation.<br/><br/>\"If you harm him, the Bai Clan will not take this lightly.\"<br/><br/>Feng Chen decided to ignore the two elders and keep his eyes on Bai Zhang.<br/><br/>Desperation etched into their faces, the two elders exchanged worried glances.<br/><br/>They could see their clan leader faltering under the immense pressure of Feng Chen's grip.<br/><br/>Bai Zhang's struggles grew weaker, and the realization that their clan was facing humiliation sent a wave of urgency through them.<br/><br/>\"Enough of this!\"<br/><br/>The first elder shouted, his voice rising above the murmurs of the crowd.<br/><br/>\"We can't let our family head be humiliated like this!\"<br/><br/>Without waiting for a response, he rushed forward, his aura flaring as he summoned his power, ready to strike Feng Chen in a last-ditch effort to save their leader.<br/><br/>The second elder followed suit, their collective determination igniting the air around them.<br/><br/>\"You think you can disrespect the Bai Clan without consequences?\" Sёarᴄh the nôvelFire.net website on Google to access chapters of novels early and in the highest quality.<br/><br/>He yelled, channeling his energy into a powerful attack aimed at Feng Chen's back. They thought that even if they were no match for Feng Chen's power, he would at least need to free his hands to deal with them.<br/><br/>However, just as they surged forward, two figures from the Feng Clan stepped into their path.<br/><br/>Grand Elder Feng Zhenshan and Feng Zhilan immediately took action when they saw the two elders from the Bai Clan attack Feng Chen.<br/><br/>The two elders from the Bai Clan were undeterred by the new arrivals.<br/><br/>Driven by arrogance, they pressed forward, convinced that they could easily defeat the one<br/><br/>who dared to stand against them.<br/><br/>They launched a flurry of attacks, their energies crackling with intent, eager to demonstrate<br/><br/>their might.<br/><br/>-CLANK!<br/><br/>The sound of metal striking metal echoed through the air as Feng Zhenshan and Feng Zhilan effortlessly blocked their strikes.<br/><br/>The sheer force of their defensive maneuvers sent shockwaves through the Bai elders, forcing them to step back in disbelief.<br/><br/>The realization struck them hard: the power they had wielded moments ago was nothing<br/><br/>compared to the power of the Feng Grand Elders.<br/><br/>\"YOU-\"<br/><br/>One of the elders stammered, the words caught in his throat as the gravity of the situation<br/><br/>sank in.<br/><br/>They were left speechless, their arrogance dissipating in an instant as they faced the reality of<br/><br/>their powerlessness.<br/><br/>The two elders exchanged alarmed glances, their confidence crumbling as they realized that<br/><br/>they couldn't even hope to defeat the elders from the Feng Clan, much less their leader, Feng<br/><br/>Chen.<br/><br/>From this small exchange, they were already aware that their strength was much worse than<br/><br/>the Grand Elders of the Feng Clan.<br/><br/>\"You thought you could humiliate us? With only this strength?\"<br/><br/>Feng Chen said, loud enough to be heard by everyone in the Tianlong Mansion.<br/><br/>It was a warning for both the Bai Clan and others who were thinking of going against the Feng<br/><br/>Clan.<br/><br/>He knew that many clans at this gathering would set their sights on the Feng Clan.<br/><br/>But unlike in the past, Feng Chen had no intention of enduring their provocations without any<br/><br/>action.<br/><br/>This time, he would send a clear message-through strength, not patience that the Feng Clan was not to be trifled with.<br/><br/>If they still want to go against them, then they would end up like Bai Zhang.<br/><br/>Bai Zhang's face contorted in pain, beads of sweat dripping down his forehead as he gritted<br/><br/>his teeth, trying and failing to hide his agony.<br/><br/>\"I'll... I'll kill you for this!\"<br/><br/>He spat, though the fear in his voice betrayed him. Even his last hope, his elders were stopped<br/><br/>by the Feng Clan. \"You're not in any position to be making threats, Bai Zhang.\"<br/><br/>The crowd was utterly silent now, watching as the once-proud Bai Zhang was brought to his<br/><br/>knees in front of everyone.<br/><br/>The whispers of disdain and mockery directed at the Feng Clan were now gone, replaced by<br/><br/>shock and disbelief.<br/><br/>Although they knew that Feng Chen was powerful enough to kill the Three Elements Divine Realm, they didn't know that he was this powerful.<br/><br/>To be able to render Bai Zhang powerless with physical strength alone showed just how<br/><br/>strong Feng Chen's body was.<br/><br/>\"ААНННН!\"<br/><br/>As Bai Zhang's screams echoed in the air, Feng Chen applied a little more pressure to his arm,<br/><br/>bending it to the point where it seemed like it would snap.<br/><br/>\"You want to keep pushing, or are you ready to beg for mercy?\"<br/><br/>Feng Chen asked, his tone cold.<br/><br/>\"Y-you bastard! You'll-ahhhh!\"<br/><br/>Bai Zhang's defiance crumbled as the pain became unbearable. His cries for help grew louder,<br/><br/>desperate now, as his pride shattered in front of the gathered crowd.<br/><br/>Just as Feng Chen was about to apply the final twist, a deep, commanding voice boomed<br/><br/>through the mansion.<br/><br/>\"Enough!\"\t\t\t\t\t\t</div>", "images": {}, "success": true}