{"id": 65, "url": "https://www.novelhall.com/my-brothers-the-protagonist-good-thing-i-awakened-my-system-33973/14946611.html", "title": "Chapter 65: Tianlong Qi'S Intervention", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 65: Tianlong Qi'S Intervention</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 65: Tianlong Qi's InterventionThe sound reverberated through the air like a thunderclap, and the attention of the crowd instantly shifted towards the voice.<br/><br/>An imposing figure stepped forward from the mansion's grand archway. Dressed in regal robes of deep jade, his presence alone commanded respect.<br/><br/>His eyes, sharp and discerning, swept over the scene as he strode toward Feng Chen and Bai Zhang.<br/><br/>\"Master Tianlong!\"<br/><br/>The crowd murmured in awe, stepping back to make way for him.<br/><br/>Even if the clans participating in the Eastern Gathering were all Top in their own cities, compared to the Tianlong Clan, they weren't considered powerful.<br/><br/>Tianlong Head was at the Peak of the Three Elements Divine realm, just one step away from the Nascent Soul Realm.<br/><br/>That made him not only one of the strongest in the Eastern Region but also in the entire Azure Sky Empire. Sёarch* The Nôvel(F)ire.ηet website on Google to access chapters of novels early and in the highest quality.<br/><br/>If one day, he successfully breakthroughs then he might as well become one of the Top Powerful in the Azure Sky Empire.<br/><br/>Additionally, his Tianlong Clan boosted having other two members of the Three Elements Divine Realm, solidifying Tianlong's position as one of the top three strongest clans in the Eastern Region.<br/><br/>Master Tianlong's commanding voice echoed through the grand hall, but Feng Chen didn't release his grip on Bai Zhang.<br/><br/>Instead of releasing, Feng Chen did the opposite and further tightened his grip on Bai Zhang's wrist.<br/><br/>-CRACK!<br/><br/>\"АНННН!\"<br/><br/>Bai Zhang had thought rescue was at hand when Tianlong's master came, but instead of relief, the pain only intensified.<br/><br/>Feng Chen remained still, his grip on Bai Zhang unwavering. His cold gaze met Master Tianlong, calm but resolute.<br/><br/>He had no intention of backing down, even before the leader of the Tianlong Clan.<br/><br/>(Hmph! When Bai Zhang came to trouble us, you just stood watching. Now that I am teaching him a lesson, you dare intervene?)<br/><br/>Feng Chen has already sensed his presence but until now, he chose to ignore this matter.<br/><br/>But when Bai Zhang was on the receiving end, he quickly came to help him. For this act alone, Feng Chen could guess his intentions clearly.<br/><br/>He was either an ally of Bai Zhang or someone who was against him and he was more inclined to believe that he was latter than former.<br/><br/>In any case, Feng Chen wasn't going to let Bai Zhang off just because Tianlong Master said so. \"Damn! Feng Chen's actually defying the Tianlong Master!\"<br/><br/>\"Hmph! What an arrogant fool! He's already provoked the Mystic Flame Sect, Spirit Wind Palace, and the Third Prince, and now he's going to make an enemy of the Tianlong Clan too?\"<br/><br/>\"Fame must have gotten to his head. Does he think Tianlong Master is as easy as Zhou Tianhua? Zhou Tianhua's main profession was Alchemy, unlike the Tianlong Master who excelled in fighting.\"<br/><br/>\"We can just think of this as a rotten egg being eliminated.\"<br/><br/>The crowd, largely unsympathetic toward the Feng Clan, sneered and mocked them, relishing the chance to insult Feng Chen for refusing to heed Master Tianlong's command.<br/><br/>However, there were other clans who neither supported nor were against the Feng Clan. One of them was the Yuan Clan. Comparable in strength to the Tianlong Clan, the Yuan Clan was regarded as one of the top three most powerful clans in the Eastern Region.<br/><br/>Yuan Hao, the head of the Yuan clan, watched the conflict between Feng Chen and Tianlong Master with interest.<br/><br/>Although his daughter, Yuan Ziyan was one of the disciples of Mystic Flame Sect, he wasn't necessarily against the Feng Clan.<br/><br/>So what if his daughter sect has a problem with the Feng Clan? He didn't care and wasn't interested in flattering the Mystic Flame Sect by going against Feng Clan.<br/><br/>\"This Feng Chen is interesting!\"<br/><br/>Yuan Hao muttered to himself. From Feng Chen's defiance against Tianlong Qi, Yuan speculated that Feng Chen must possess significant strength that wasn't less than Tianlong<br/><br/>Qi.<br/><br/>Moreover, he was impressed by Feng Chen's boldness in standing up to Tianlong Qi. Not everyone has the guts to go against the Tianlong Clan.<br/><br/>Though he thought it was expected of Feng Chen who dared to kill the Mystic Flame Sect elder and Spirit Wind Palace elder.<br/><br/>Master Tianlong's sharp gaze swept over Feng Chen as the tension between the two leaders became palpable.<br/><br/>The air seemed to crackle with the unspoken conflict, and the crowd held their breath, waiting to see what would happen next.<br/><br/>Feng Chen's grip on Bai Zhang remained firm, even tightening further, causing another sickening *CRACK* to echo through the hall.<br/><br/>\"АНННН!\"<br/><br/>Bai Zhang screamed once more, his body writhing in agony. Desperate for salvation, he turned his pleading eyes toward Tianlong Qi, silently begging for help.<br/><br/>Master Tianlong's eyes flickered with a mix of irritation and anger at Bai Zhang.<br/><br/>(Idiot!)<br/><br/>Tianlong Qi thought angrily.<br/><br/>He thought that Bai Zhang would be able to take care of the Feng Clan but it turned out to be<br/><br/>the opposite.<br/><br/>As Feng Chen thought, Tianlong was targeting Feng Clan and the reason was because they have a close relationship with Spirit Wind Palace.<br/><br/>However, as the event's host, he couldn't openly target the Feng Clan. Thus, when the Bai Clan sought to cause trouble, he happily refrained from intervening.<br/><br/>The outcome, however, was the Bai Clan being crushed by Feng Chen. If this continues, not only will Feng Clan gain more prestige, but his Tianlong Mansion will face disgrace for failing to maintain order.<br/><br/>So, Tianlong Qi had no choice but to step forward and intervene.<br/><br/>He initially believed that Feng Chen would back down once he made his presence known, but<br/><br/>to his surprise, Feng Chen only tightened his grip, showing no intention of yielding.<br/><br/>\"Feng Chen,\" Master Tianlong began, his voice carrying the weight of authority.<br/><br/>\"This is not the time nor the place for such actions. The Bai Clan may have provoked you, but I am the host of this event and I will not have you disrupt the event.\"<br/><br/>Feng Chen met his gaze, his expression fearless.<br/><br/>\"Hehe... Then where were you when Bai Zhang sought to trouble us? I didn't see you when Bai<br/><br/>Zhang or his elders attacked me.\"<br/><br/>Feng Chen said, his cold eyes locked with Master Tianlong.<br/><br/>The crowd stirred at Feng Chen's bold words, and they could see that Feng Chen really had no intention of listening to Tianlong Master.<br/><br/>Master Tianlong's expression darkened, but he kept his composure.<br/><br/>\"I understand your grievances, Feng Chen.\"<br/><br/>He said, keeping his cool. He knew that he couldn't get angry at Feng Chen's words otherwise<br/><br/>The would lose his prestige.<br/><br/>\"But this is the Eastern Gathering. If we allow personal conflicts to spill into this event, it will<br/><br/>descend into chaos.\"<br/><br/>Feng Chen snorted, not letting go of Bai Zhang.<br/><br/>\"Chaos?\"<br/><br/>He asked mockingly.<br/><br/>\"It seems only now that you care about order. But when the Bai Clan's arrogance threatened<br/><br/>us, you were content to watch.\"<br/><br/>Another *CRACK* echoed as Feng Chen twisted Bai Zhang's wrist further, drawing another agonized scream from him. The sound sent a chill through the crowd.<br/><br/>\"АНННН!\"<br/><br/>Bai Zhang's voice was hoarse from pain, his face pale. His body trembled, utterly powerless in<br/><br/>Feng Chen's grasp.<br/><br/>Master Tianlong's gaze hardened.<br/><br/>\"Feng Chen, release him.\"<br/><br/>The words were spoken quietly, but the authority behind them was undeniable. Yet, Feng<br/><br/>Chen remained unmoved, his grip steady.<br/><br/>\"And if I refuse?\"<br/><br/>Feng Chen's cold gaze bore into Tianlong Qi, his lips curling into a defiant smirk as he stared<br/><br/>the man down, daring him to make a move.\t\t\t\t\t\t</div>", "images": {}, "success": true}