{"id": 60, "url": "https://www.novelhall.com/my-brothers-the-protagonist-good-thing-i-awakened-my-system-33973/14946604.html", "title": "Chapter 60: The Eastern Gathering Beckons", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 60: The Eastern Gathering Beckons</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 60: The Eastern Gathering BeckonsSeveral days have passed since Feng Chen returned to the Feng Clan. Sёarᴄh the Nôvel(F)ire.nёt website on Google to access chapters of novels early and in the highest quality.<br/><br/>There weren't many changes and the Feng Clan was still thriving with their influence increasing.<br/><br/>On a side note, Feng Chen had instructed Elder Wei to build a place to train the Formation Master and give all the Grade 1 Formation Book to Elder Wei.<br/><br/>After that, Feng Chen secluded himself in his room for several weeks without stepping outside.<br/><br/>During this time, he focused on consolidating his cultivation in preparation for a breakthrough.<br/><br/>Unlike the advancement of the major realm, the advancement of the minor realm wasn't particularly difficult.<br/><br/>Moreover, he also has the help of Heavenly Veil Formation which increased his cultivation speed by at least 50 %.<br/><br/>Therefore, the probability of failure was very low and Feng Chen was certain about his breakthrough.<br/><br/>As the days passed, he immersed himself deeper into his meditative state, feeling the flow of Qi around him.<br/><br/>He could sense the energy building within, swirling in harmony with the Heavenly Veil Formation's influence. Each cycle of breath drew him closer to the threshold he sought to<br/><br/>cross.<br/><br/>\"It's time!\"<br/><br/>Feng Chen said, sensing that his cultivation was finally on the verge of breaking through.<br/><br/>A powerful vortex of Qi swirled around him, drawn from the air and his surroundings, flooding his meridians and expanding his dantian.<br/><br/>His breathing grew slow and deep as he cycled the energy, bringing it to the peak. Then, with a final controlled breath, he pushed.<br/><br/>Boom!<br/><br/>A muffled explosion echoed within his body as his Qi surged, breaking past the barrier that had restrained him for weeks.<br/><br/>The entire room trembled as his aura burst out, filling the air with overwhelming power. It radiated with strength, his presence now commanding and profound.<br/><br/>Good thing that there was Heavenly Veil Formation which concealed all the Qi inside, otherwise, this breakthrough would have alerted many powerful people.<br/><br/>Although he has eliminated all the enemies inside Misty Vale City, he has also made new<br/><br/>ones.<br/><br/>Who knows whether they are secretly spying on him or not? If Mystic Flame Sect, Spirit Wind Palace, or the Third Prince knew about his real Realm, then it would bring a lot of headaches. Although he wasn't sure what the Third Prince would do, Spirit Wind Palace and Mystic Flame Sect were sure to send their powerful man to eliminate him considering that he could be a threat to their Sect.<br/><br/>At the moment, they considered him as a weakling that they could eliminate whenever they wanted. Which is one of the reasons why they hadn't attacked him even after he had killed their elders.<br/><br/>Of course, another reason was that his action was justified and if those two sects retaliated then their reputation would likely be tarnished and they might also find themselves in trouble with the Imperial Family.<br/><br/>However, they would surely be prepared to face those repercussions if they judged Feng Chen to be too dangerous to be left alive.<br/><br/>In any case, Feng Chen couldn't afford to reveal his real strength unless his Clan grew stronger.<br/><br/>And thanks to Heavenly Veil Formation, he could avoid them temporarily.<br/><br/>Feng Chen opened his eyes slowly, the glint of newfound power in them unmistakable. His breakthrough was complete.<br/><br/>The differences weren't as big as when he broke through from the Three Elements Divine Realm to the Nascent Soul Realm.<br/><br/>But still, it was an increase in his strength!<br/><br/>\"System, display my status!\"<br/><br/>********************<br/><br/>[Host Info]<br/><br/>Host: Feng Chen<br/><br/>Age: 30<br/><br/>Cultivation: Nascent Soul Realm (Early)<br/><br/>Martial Arts: Heavenly Emperor's Sword (High-Level Heaven Grade), Mid-level Heaven Grade Defense Technique: Mysterious Heaven Iron Wall, and Mid-level Heaven Grade Movement Technique: Ghostly Shadow Mirage, Earth Shattering Palm (Mid-Level Earth Grade), Mid-Level Saint Grade Body Refinement Technique: Saintly Thunder Body, Iron Fist Technique (Mid-Level Mortal Grade), Light Sword Technique (High-Level Mortal Grade)<br/><br/>System Points: 50,000<br/><br/>*********<br/><br/>Feng Chen looked at his information with information, although the System Points made his heart bleed.<br/><br/>\"Eastern Gathering? Shouldn't be a problem!\"<br/><br/>Feng Chen said confidently. Indeed, with his cultivation and his arsenal of Heaven Grade Techniques, a small event such as Eastern Gathering wasn't much of a problem.<br/><br/>He was confident that he could single-handedly take care of all the patriarchs that were coming to the Eastern gathering using just his 50% or less power.<br/><br/>Moreover...<br/><br/>\"Activate Eyes of Insight!\"<br/><br/>Feng Chen activated his Eyes of Insight to look at the people who were chosen for the Eastern<br/><br/>Gathering.<br/><br/>***<br/><br/>************<br/><br/>Name: Feng Xiaoyu<br/><br/>Cultivation Level: Initial Core Formation Stage<br/><br/>Talent: Above Average Talent<br/><br/>Physique: None<br/><br/>****************<br/><br/>****************<br/><br/>Name: Feng Liang<br/><br/>Cultivation Level: Initial Core Formation Stage<br/><br/>Talent: Above Average Talent<br/><br/>Physique: None<br/><br/>****************<br/><br/>****************<br/><br/>Name: Feng Jianhong<br/><br/>Cultivation Level: Initial Core Formation Stage<br/><br/>Talent: Ordinary Talent<br/><br/>Physique: None<br/><br/>**********<br/><br/>****************<br/><br/>Name: Feng Mei<br/><br/>Cultivation Level: Early Core Formation Stage<br/><br/>Talent: Exceptional<br/><br/>Physique: Jade Phoenix (Unawakened)<br/><br/>‹**************<br/><br/>The Clan Members who would be participating in the upcoming Eastern Gathering were the<br/><br/>same as the ones who participated in the Annual Genius Competition.<br/><br/>Although other clan members were also putting in effort to be selected, four of them were working significantly harder making it hard for others to catch up to them.<br/><br/>They had also managed to break through to the Core Formation Stage which gave them the edge against others who had yet to do so.<br/><br/>Reaching the Core Formation Stage before turning 20 would definitely be hailed as a genius even by those First-rated Sect.<br/><br/>Of course, they couldn't be compared to Ling Meiyu who is already in Grand Qi Condensation<br/><br/>Realm at age 17.<br/><br/>But compared to other geniuses of the Top Sect, they could also be considered exceptional. Moreover, they've only had access to abundant resources in recent months.<br/><br/>If they had been given the same resources from childhood, they might have also reached the Grand Qi Condensation Realm.<br/><br/>Of course, it would have been difficult to reach the Grand Qi Condensation realm at age 17 like Ling Meiyu but definitely before age 20.<br/><br/>Moreover, with the Astral Training Pavillion, their combat power was definitely higher than<br/><br/>their peers.<br/><br/>(And lastly...)<br/><br/>****************<br/><br/>Name: Feng Yun<br/><br/>Cultivation Level: Early Core Formation Stage<br/><br/>Talent: Heavenly Pride<br/><br/>Physique: True Dragon Body (unawakened)<br/><br/>****************<br/><br/>One could say that Feng Yun was truly the protagonist of this world.<br/><br/>His physique, equal to or perhaps even surpassing that of the Jade Phoenix, though unawakened, combined with his unparalleled cultivation talent, set him apart from all others.<br/><br/>As for why his cultivation was the same as Feng Mei's despite having greater Cultivation talent, Feng Chen guessed that it might have to do with the soul in his ring. Perhaps the soul was still absorbing Feng Yun's Qi in order to sustain its life which is why Feng Yun's cultivation speed wasn't very different compared to Feng Mei.<br/><br/>Of course, this was all just Feng Chen's assumption, though he believed his guess to be quite<br/><br/>accurate.<br/><br/>However, Feng Chen didn't believe Feng Yun was losing out as he could get the support of<br/><br/>that powerful soul.<br/><br/>For one, without that soul, Feng Chen didn't think that Feng Yun would be able to become a second-grade alchemist in a few months.<br/><br/>Even if one was talented, without the guidance of a High-Grade Alchemist, one would<br/><br/>struggle to advance in the field of alchemist.<br/><br/>Secondly, without Second-Grade Alchemist Recipe, it would be impossible for one to create<br/><br/>Rank 2 Pills.<br/><br/>Apart from them, Feng Chen has seen Feng Yun practice Techniques that aren't from the Feng Clan which are most likely been taught by that soul.<br/><br/>Moreover, in critical situations, that soul could save Feng Yun's life. So, overall, trading for<br/><br/>those things for his cultivation speed wasn't a bad trade-off. With Feng Yun's talent and deep understanding of Martial Techniques, Feng Chen knew that even if Feng Yun was at the same stage as others, he would still be far more powerful than<br/><br/>them.<br/><br/>In any case, the Eastern Gathering was simply an opportunity for them to show off their clan's<br/><br/>strength.\t\t\t\t\t\t</div>", "images": {}, "success": true}