{"id": 66, "url": "https://www.novelhall.com/my-brothers-the-protagonist-good-thing-i-awakened-my-system-33973/14946612.html", "title": "Chapter 66: A Costly Compensation", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 66: A Costly Compensation</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 66: A Costly CompensationThe crowd sucked in a mouthful of cool air, this move by Feng Chen was considered a blatant provocation for Tianlong Qi!<br/><br/>Tianlong Qi's face instantly darkened by three degrees as he listened to the fearless words of Feng Chen.<br/><br/>\"Has Feng Chen truly lost his mind?\"<br/><br/>\"He's truly challenging the Tianlong Master outright. This isn't a battle he can win.\"<br/><br/>\"Does he think that Tianlong Qi is someone he can compete with? He just keeps searching for his death.\"<br/><br/>The other clan was surprised that Feng Chen was repeatedly going against Tianlong Master showing that he was really not afraid of the Tianlong Clan.<br/><br/>Yuan Hao, leader of the Yuan Clan, also watched intently from the sidelines. His expression was inscrutable, but there was a glint of amusement in his eyes.<br/><br/>The conflict unfolding before him seemed to entertain rather than concern him. He leaned slightly toward one of his elders.<br/><br/>\"Feng Chen's boldness is commendable. Not many would dare stand against the Tianlong Clan.\"<br/><br/>The elder nodded quickly.<br/><br/>\"Yes, Master. But do you think this will escalate?\"<br/><br/>Yuan Hao's lips curled into a faint smile.<br/><br/>\"It already has.\"<br/><br/>Yuan Hao said as he continued watching the conflict.<br/><br/>\"Good Feng Clan! Good Feng Chen, I didn't expect you to really have some balls!\"<br/><br/>Tianlong Qi's tone was chillingly cold.<br/><br/>Feng Chen smiled blandly, completely ignoring Tianlong Qi's words.<br/><br/>Master Tianlong's face was stone, but his aura began to swell, a subtle warning to everyone present.<br/><br/>\"This is not a negotiation, Feng Chen. I said you release him, and for your own good, you should do what I say!\"<br/><br/>Tianlong Qi said, which was followed by releasing his powerful Qi in the hope that it could pressurize Feng Chen.<br/><br/>His powerful Qi was felt by the other people nearby who were shocked by how powerful and oppressive Tianlong Qi's aura was.<br/><br/>Even those who were in the top stage of the Three Elements Divine Realm were intimidated by Tianlong.<br/><br/>\"Tianlong Master is truly one of the strongest in the Eastern region. Just his Qi alone is enough to make me kneel.\"<br/><br/>\"Looks like his strength has increased again. It wouldn't be long before he breakthroughs to Nascent Soul Realm.\"<br/><br/>\"This Feng Chen should be regretting, now that Tianlong Master has decided to take action.\"<br/><br/>However, how can Feng Chen who is in Nascent Soul Realm be affected by Three Elements Divine Realm Qi?<br/><br/>He just sneered at Tianlong who seemed to think that he could intimidate him with his Qi. \"Haha... Do you think you can scare me with your little strength?\"<br/><br/>Feng Chen mocked. He didn't want to show off his power but it seemed that for this group of idiots to learn their place, he needed to do so.<br/><br/>For a second, Tianlong Qi was surprised by how unaffected Feng Chen was by his aura, but then he got even angrier at Feng Chen's words.<br/><br/>Never before had he been humiliated like this. Even the most powerful sects in the empire showed him some respect-so how could a mere clan from the Eastern Region, barely worth mentioning, disrespect him so openly?<br/><br/>(Just how could Feng Chen be nonchalantly before my Qi? Was the information about Feng Chen that I got wrong?)<br/><br/>Tianlong Qi thought for a second. With his Peak Three Element Divine Realm aura, he was certain that Feng Chen would be scared enough to let Bai Zhang go.<br/><br/>But it seems like nothing was going as planned today. And he began to doubt the authenticity of the information that Spirit Wind Palace had given to him about the Feng Clan.<br/><br/>He slowly calmed down and retracted his qi. He concluded that he couldn't threaten Feng<br/><br/>Chen and that doing more than this would only harm his image.<br/><br/>\"Feng Chen, this is the Eastern Gathering, and we can't allow you to treat Bai Zhang like this. How about we have the Bai Clan compensate you for their actions?\"<br/><br/>Tianlong Qi continued.<br/><br/>\"How about they give you 100,000 Gold Coins and you forget about this incident?\"<br/><br/>Tianlong Qi said.<br/><br/>\"Tianlong Master, you can't- Ahhh!\"<br/><br/>Bai Zhang didn't want to accept that.<br/><br/>Today, not only did he get humiliated and tortured like this? But he still needs to compensate<br/><br/>the one who tortured him like this?<br/><br/>Moreover, a Hundred Thousands Gold Coins was a hefty sum even for the Bai Clan.<br/><br/>\"AHHH-Okay, Okay! I agree! I agree!\"<br/><br/>However, when the pain in his wrist increased, he couldn't help but agree.<br/><br/>Even Tianlong Master couldn't make Feng Chen yield, so he doesn't have any other choice other than to accept Tianlong Master's offer.<br/><br/>-CRACK!<br/><br/>But Feng Chen just increased his strength and Bai Zhang suffered even more torture.<br/><br/>\"Feng Chen, I said that I agree. Let me go- AHHH!\"<br/><br/>\"You agreed but did I?\"<br/><br/>Feng Chen simply replied with those words.<br/><br/>Tianlong Master's face darkened again. This was the biggest concession that he was going to make.<br/><br/>Not only did he ignore Feng Chen's earlier defiance but also gave him good compensation. Even after all this, Feng Chen was refusing his goodwill. Tianlong Qi couldn't help but get angrier.<br/><br/>\"Feng Chen, what more do you want? Do you think that you can continue wasting everyone's<br/><br/>time here?\"<br/><br/>Master Tianlong thought to himself. The only way he could deal with Feng Chen now was by turning the other clans against him.<br/><br/>\"Hmph! Do you think I wanted any of this?\"<br/><br/>Feng Chen scoffed.<br/><br/>\"If not for Bai Zhang, I wouldn't have bothered. Do you really think I'm so bored as to torture<br/><br/>him like this?\"<br/><br/>Feng Chen continued.<br/><br/>\"Alright then, since I also don't want to waste my time with him, I'll agree with the<br/><br/>compensation-but the price needs to be increased. 200,000 gold coins, no less!\"<br/><br/>Feng Chen finished saying those words when Bai Zhang who was almost kneeling in front of<br/><br/>Feng Chen was about to cry.<br/><br/>200,000? Are you kidding me?<br/><br/>He thought that 100,000 Gold Coins was already an extortion but he had no choice but to<br/><br/>agree.<br/><br/>But this 200,000 gold coins would be equivalent to emptying his treasurer and bankrupting<br/><br/>Bai Clan.<br/><br/>\"Feng Chen, you are simply robbing me -AHHHH!\"<br/><br/>Bai Zhang said before wailing in pain.<br/><br/>\"Who told you to start making trouble with me if you can't afford it?\"<br/><br/>Feng Chen replied coldly.<br/><br/>Bai Zhang felt like crying when he heard Feng Chen's words. If he could go back in time then<br/><br/>even if he had 10 lives, he wouldn't have offended Feng Chen. Sёarᴄh the novel(F~)ire.net website on Google to access chapters of novels early and in the highest quality.<br/><br/>Who told him to follow the Third Prince's instruction? Who told him that Feng Chen was some coward who used tricks to deal with Zhou Tianhua?<br/><br/>(Damn! I can only hope the Third Prince compensates me for all this trouble!)<br/><br/>Bai Zhang thought to himself. With no choice but to comply with Feng Chen's demands, his<br/><br/>only comfort was that his backer, the Third Prince would help him after this.<br/><br/>\"Okay, Okay! I promise to give you 200,000 Gold Coins. Please, release me!\" Bai Zhang pleaded, his voice trembling as he felt the pressure on his wrist intensify.<br/><br/>With a wave of his hand, Feng Chen loosened his grip. Bai Zhang stumbled back, gasping for<br/><br/>breath, his face pale from the lingering pain.<br/><br/>\"You're free to go, but remember this, Bai Zhang,\" Feng Chen warned.<br/><br/>\"If you ever think about making trouble for me again, I won't be so generous next time.\"<br/><br/>Bai Zhang nodded vigorously, thinking that even if God commanded him, he wouldn't do so.<br/><br/>\"I-I understand! I won't bother you again!\"<br/><br/>He stammered, his mind racing with thoughts of escape.<br/><br/>As Bai Zhang made his way back through the crowd, the eyes of the onlookers followed him, filled with a mix of disdain and pity.<br/><br/>Who would have thought that the mighty Bai Clan would suffer such humiliation? They have totally lost their face and their reputation would only get worse after this event.<br/><br/>But who could they blame? They could only blame themselves for making such a decision.<br/><br/>Play stupid games, win stupid prizes!\t\t\t\t\t\t</div>", "images": {}, "success": true}