{"id": 62, "url": "https://www.novelhall.com/my-brothers-the-protagonist-good-thing-i-awakened-my-system-33973/14946606.html", "title": "Chapter 62: Arrival At Tianlong Mansion!", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 62: Arrival At Tianlong Mansion!</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 62: Arrival At Tianlong Mansion!\"That's Xu Family of Baihua City!\"<br/><br/>\"Guo Family of Wuyun City has also arrived!\"<br/><br/>-<br/><br/>People outside the Tianlong Mansion exclaimed as they excitedly watched the Strongest Clan from each city of the Eastern Region arrive.<br/><br/>People discussed among themselves about the arriving families, mentioning descendants who were chosen to join prestigious clans or how their elders and clan leaders had recently broken through and risen to power in their respective cities.<br/><br/>In any case, those families attending the Eastern Gathering were all very famous with many of their achievements being known to the general public.<br/><br/>\"Look!\"<br/><br/>Suddenly one of the people pointed his finger at the upcoming clan.<br/><br/>\"It's the Feng Clan!\"<br/><br/>He exclaimed excitedly.<br/><br/>Although he didn't know any Feng Clan Members, their banner above indicates that they are the Feng Clan who has been making waves in not only the Eastern Region but also the Azure Sky Empire.<br/><br/>Moreover, there is only one family with the name 'Feng' in the entire Azure Sky Family.<br/><br/>Feng Chen and others arrived in Qingyun City and were making their way towards Tianlong Mansion on their horses.<br/><br/>\"So, they are the ones who killed two elders from the Zhou Family!!\"<br/><br/>One of them, equally excited, spoke up, eager to catch a glimpse of Feng Chen, who had been causing such a stir.<br/><br/>This feat was widely known, as it had been years since anyone like Feng Chen dared to kill elders from the Mystic Flame Sect or Spirit Wind Palace.<br/><br/>For many, Mystic Flame Sect is the strongest sect in Azure Sky Empire that none dare to offend and not even the first-rated Clan in the Capital.<br/><br/>Now, there was a clan leader from a small city who killed one elder from Spirit Wind Palace and another from Mystic Flame Sect. Of course, the news will be spread far and wide.<br/><br/>Others also looked at the direction in which the man pointed and noticed a small group of people.<br/><br/>\"What?\"<br/><br/>\"So, they are ones. Tsk Tsk! Even if I had the strength, I wouldn't have the guts to kill those two elders.\"<br/><br/>\"That's why you aren't famous as the Feng Clan Leader. Only someone with courage could achieve something like that.\"<br/><br/>\"Heh. What courage? It's just stupidity. Their clan would sooner or later disappear from the face of this Earth.\"<br/><br/>Some felt admiration for what Feng Chen did while others were laughing at his stupid decision to kill the two Elder Zhou.<br/><br/>Even if one were to defeat them, they would politely apologize so as to not antagonize the power behind the two.<br/><br/>However, Feng Chen not only displayed the power to defeat the two of them but also the courage to kill them.<br/><br/>\"Hehe... I am afraid that the Feng Clan wouldn't survive in this Eastern Gathering. There should be many families aiming to avenge the two elders in this event and curry favor with the Mystic Flame Sect.\" Sёarᴄh the Novelƒire(.)ne*t website on Google to access chapters of novels early and in the highest quality.<br/><br/>\"You're right! Feng Clan will definitely suffer in this event. Who gave them the guts to offend two Top Sect of Azure Sky Empire?\"<br/><br/>\"Ohhh, looks like this time Eastern Gathering will be interesting.\"<br/><br/>\"I bet that Feng Clan wouldn't survive even one month after this event.\"<br/><br/>\"Brother, your hope is too high. I bet 100 Gold Coins that they can't survive even half a month.\"<br/><br/>\"I bet that they can't survive one week!\"<br/><br/>The crowd murmured, no one was optimistic about the Feng Clan situation.<br/><br/>After all, the Mystic Flame Sect is the supreme power in Azure Sky Empire and no one who offended them ended well.<br/><br/>Listening to the mockery and gloating of the people around them, all the people of the Feng Family were furious, especially the young ones.<br/><br/>\"This is too much. They were the ones who targeted our family first and were killed by the family head. Why does everyone except us forgive them? Freeing tigers just to have them bite us back?\"<br/><br/>Feng Jianhong's face darkened with a deep frown as he spoke angrily.<br/><br/>Feng Xiaoyu'er, nodded in agreement, her eyes narrowing as she caught the cruel smiles of some onlookers.<br/><br/>\"If it weren't for the head's decisive actions, we would've been the ones suffering under the Zhou Elders. These people are blind to the truth.\"<br/><br/>\"Xiaoyu'er, that's where you're mistaken. It's not about whether what we did was right or wrong-it's about who we did it to. Since Elder Zhou was from the Mystic Flame Sect, no matter what Chen'er did, we would have been criticized either way.\"<br/><br/>Grand Elder Zhenshan said. What Zhenshan said was the truth. If Elder Zhou or Zhou Tianhua belonged to a small clan without a sect, no one would have questioned Feng Chen's decision to kill them.<br/><br/>It is only because they belonged to the Zhou Clan as well as the Top Sect that people are criticizing Feng Chen's decision.<br/><br/>\"Anyway, perform well at this Eastern Gathering and those voices will naturally disappear.\"<br/><br/>Grand Elder Zhilan said. This time Grand Elder Zhenshan and Grand Elder Zhilan were accompanying Feng Chen.<br/><br/>While their participation in the Eastern Gathering wasn't mandatory, their presence was essential to demonstrate the strength of the Feng Clan.<br/><br/>Additionally, they were there to protect Feng Yun and other young talents, including Feng<br/><br/>Chen, in case any issues arose.<br/><br/>Despite Feng Chen's superior strength, they knew that if faced with foes far beyond his capabilities, they were ready to sacrifice themselves to ensure his safe retreat.<br/><br/>\"Hmph! We will shut them up for good in this event.\"<br/><br/>Feng Liang declared with confidence.<br/><br/>While their participation in the Eastern Gathering wasn't mandatory, their presence was essential to demonstrate the strength of the Feng Clan. Additionally, they were there to protect Feng Yun and other young talents, including Feng Chen, in case any issues arose. Despite Feng Chen's superior strength, they knew that if faced with foes far beyond his capabilities, they were ready to sacrifice themselves to ensure his safe retreat.<br/><br/>As the Feng Clan approached, the crowd began to discern the figures more clearly. Leading them was none other than Feng Chen, exuding an aura of confidence that drew everyone's<br/><br/>attention.<br/><br/>\"So, that's Feng Chen?\" one onlooker murmured, eyes widening. \"He looks... remarkably young and handsome.\"<br/><br/>\"Indeed! He's very handsome. How could someone like him be so powerful?\" another woman<br/><br/>responded.<br/><br/>Feng Chen was indeed very handsome and he only became more handsome as his cultivation<br/><br/>rose to the Nascent Soul Realm.<br/><br/>\"Feng Head, look at me. I can give birth to 10 more of you.\"<br/><br/>\"I am willing to risk my life to be together with you. Please look at me!\"<br/><br/>Even the women who had been mocking and expressing disdain earlier were now shouting their admiration, captivated by Feng Chen's striking appearance.<br/><br/>However, among the crowd, several men exchanged glances filled with disdain and jealousy. \"Look at them fawning over him! Pathetic,\" one scoffed, crossing his arms.<br/><br/>\"Just because he's handsome doesn't mean he's formidable. I'd like to see him survive this<br/><br/>gathering.\"<br/><br/>\"Right? He may have killed a couple of elders, but that was pure luck! He's nothing in front of Tianlong Leader.,\" another chimed in, sneering.<br/><br/>\"Bah! Just a pretty boy playing at being a leader. Let's see if he can charm his way out of trouble,\" a third man jeered, shaking his head in contempt.<br/><br/>\"Yeah, they'll all be in for a rude awakening soon enough. Just wait until the Mystic Flame<br/><br/>Sect sends someone after him.\"<br/><br/>They insulted and mocked more seeing the women fawn over Feng Chen.<br/><br/>Soon, Feng Chen along with other Feng Clan members reached those crowds but ignored them and went straight into Tianlong Mansion.<br/><br/>Feng Jianlong and others stared at them disdainfully but didn't do anything. If they gave in to anger and started fighting with them, they knew that their clan prestige would be damaged. They believed that they would soon know that their clan was not as simple and weak as they<br/><br/>thought.\t\t\t\t\t\t</div>", "images": {}, "success": true}