{"id": 67, "url": "https://www.novelhall.com/my-brothers-the-protagonist-good-thing-i-awakened-my-system-33973/14946613.html", "title": "Chapter 68: Eastern Gathering!", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 68: Eastern Gathering!</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 68: Eastern Gathering!Before long, other clans started to arrive at Tianlong Mansion.<br/><br/>Just like Yuan Ziyan, many people who arrived after the incident between Bai Zhang and Feng Chen were confused about the atmosphere of the place and asked their friends about it.<br/><br/>The people who knew about the incident slowly explained and some even warned them to stay away from Feng Clan.<br/><br/>They were shocked to learn what happened and the eyes at which they looked at Feng Clan had also changed.<br/><br/>Many of the people subconsciously looked down on the Feng Clan due to them offending the Mystic Flame Sect.<br/><br/>But only now do they know that Feng Clan wasn't someone that they could mess with.<br/><br/>In addition, many people were in awe when they saw Feng Chen who was very young. A young man who has broken through the Three Elements Divine Realm and killed Elder Zhou Tianhua.<br/><br/>His potential was immense.<br/><br/>Of course, no matter what, they still refrained from talking to them but at the same time, didn't think about creating problems with them as well.<br/><br/>As night finally descended, the gates to the pavilion were opened wide, inviting all the clan leaders and their representatives to take their places.<br/><br/>The flickering light of lanterns illuminated the grand structure of Tianlong Mansion, casting long shadows over the vast courtyard.<br/><br/>The pavilion, at the heart of the estate, stood as a symbol of the Tianlong Clan's power and wealth.<br/><br/>Indeed, Tianlong Mansion was far larger and more extravagant than Feng Mansion.<br/><br/>Its towering walls and intricately designed roofs stretched high into the night sky, draped with banners of gold and crimson that fluttered in the cool evening breeze.<br/><br/>Where Feng Mansion was modest yet refined, Tianlong Mansion was an extravagant display of luxury.<br/><br/>Precious jade tiles adorned the floors, and rare, ancient artifacts were displayed in every<br/><br/>room.<br/><br/>The pavilion itself, a multi-tiered structure with carved dragon columns and polished jade staircases, was vast enough to accommodate hundreds of people without feeling cramped.<br/><br/>First-timers were shocked by the wealth of the Tianlong Clan including those from the Feng<br/><br/>Clan.<br/><br/>\"WOW!\"<br/><br/>Feng Mei muttered as she looked around in awe. This was the first time she had seen such an extravagant mansion.<br/><br/>Others were also the same including Feng Zhenshan and Feng Zhilan. Despite being over 70 years old, they had spent most of their lives in Misty Vale City.<br/><br/>\"Indeed, this is the Tianlong Clan. The wealth possessed by them is unimaginable!\"<br/><br/>Feng Zhenshan said. Despite becoming the richest in Misty Vale City, such extravagance was beyond his imagination.<br/><br/>He hoped that his Feng Clan would continue growing and one day reach such a stage.<br/><br/>Feng Clan juniors were the same, determined to make the Feng Clan grow and become like the Tianlong Clan.<br/><br/>As for Feng Chen, there wasn't much surprise on his face.<br/><br/>(Compared to those Mansion in the Capital, this is nothing.)<br/><br/>Feng Chen thought.<br/><br/>Because of his parents, he has gone to the Capital where they visit the Ling estate which has an even bigger and marvelous mansion than this.<br/><br/>There were also many mansions comparable to Tianlong Mansion in the capital, so he wasn't surprised to see such a mansion.<br/><br/>Thinking about the Ling Clan, Feng Chen sighed.<br/><br/>Ling Jian has treated Feng Chen with the love and care of a real uncle.<br/><br/>He doesn't know what he or his parents would think if they knew about the divorce between Ling Meiyu and Feng Yun.<br/><br/>He thought that if his parents were around, they would surely be saddened by that.<br/><br/>(I don't know what Ling Jian thinks though!)<br/><br/>Feng Chen knew that the Ling family had agreed to Ling Meiyu's coming to break off the engagement but was not sure about Ling Jian, himself.<br/><br/>Feng Chen only knows that Ling Jian is injured as Ling Meiyu said or it could also be a lie said to avoid saying the real reason.<br/><br/>Maybe he supported or even if he didn't, he might not have stopped Ling Meiyu. There were also chances that he didn't even know about it.<br/><br/>In any case, Feng Chen thought that he would get those answers soon when he went to the Capital for two years.<br/><br/>The central space was arranged in tiers, with the most prominent clans seated closer to the dais, where the Eastern Gathering's host would soon stand to announce the rules and objectives of this year's event.<br/><br/>As each clan took their seats, whispers rippled through the crowd.<br/><br/>They were mostly discussing the clan that is most likely to be crowned the champion of this event.<br/><br/>There were three names that were mostly brought up the Tianlong Clan, the Yuan Clan, and the Yunhai Clan.<br/><br/>Tianlong Clan was on the Top of the list because they not only had Tianlong Qi who is Peak of Three Elements Divine Realm but also Tianlong Yu, who is an inner disciple of Spirit Wind<br/><br/>Palace.<br/><br/>The Yuan Clan was the same and although Yuan Hao was considered to be weaker than Tianlong Qi, his daughter Yuan Ziyan was much stronger than Tianlong Yu.<br/><br/>There was also Yuan Ling participating who is said to be comparable to Tianlong Yu.<br/><br/>So, although the Tianlong Clan might have an advantage when the leader of each clan participates when it comes to the competition between the juniors, Yuan Clan has the<br/><br/>advantage.<br/><br/>Lastly, the Yunhia Clan can be said to be the family of Alchemist. They were also a part of the Alchemist Alliance of Azure Sky Empire.<br/><br/>There was no shortage of Second Grade Alchemists in their Clan and they were also the richest clan in the Eastern Region due to that. Searᴄh the NôᴠeFire.ηet website on Google to access chapters of novels early and in the highest quality.<br/><br/>Not only do they have resources that can be used to easily raise the cultivation but their soul power is very high due to which they excel in mind techniques.<br/><br/>People with low soul power even if they have higher cultivation could only fall before Yunhia Clans technique.<br/><br/>Finally, as the last of the clans got seated, the host of the Eastern Gathering, an elder from the Tianlong Clan, stepped onto the dais.<br/><br/>His white robes flowed elegantly, and his presence commanded immediate attention. The crowd fell silent.<br/><br/>The elder was none other than Tianlong Zhen, an Early Stage Three Elements Divine Realm.<br/><br/>Tianlong Zhen stood tall on the dais, his piercing gaze sweeping across the gathered clans. His white robes shimmered in the lantern light, and an air of authority surrounded him as he raised a hand for silence.<br/><br/>The murmurs in the grand pavilion quickly died down, and all eyes turned toward him.<br/><br/>\"Esteemed leaders, and young talents of the Eastern Region,\" Tianlong Zhen's voice was steady and commanding, resonating through the open courtyard.<br/><br/>\"We welcome you to this year's Eastern Gathering. It is a time for the finest of our younger generation to prove their mettle and bring glory to their clans.\"<br/><br/>\"The rules of the competition remain the same,\" Tianlong Zhen continued.<br/><br/>\"First there would be three rounds between geniuses of each clan and depending on their position, each clan would earn points. Then there will be a competition between the clan leaders which will also give points to the clan depending on their position.\"<br/><br/>\"The overall ranking of the clans will be based on those points.\"\t\t\t\t\t\t</div>", "images": {}, "success": true}