{"id": 63, "url": "https://www.novelhall.com/my-brothers-the-protagonist-good-thing-i-awakened-my-system-33973/14946607.html", "title": "Chapter 63: Confrontation At The Tianlong Mansion", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 63: Confrontation At The Tianlong Mansion</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 63: Confrontation At The Tianlong MansionBefore making their way through the grand entrance of Tianlong Mansion, the Feng Clan members dismounted from their horses.<br/><br/>A group of stable attendants hurried over, bowing respectfully as they took the reins. The sound of hooves faded into the background as the horses were led away toward the stables.<br/><br/>With their steeds gone, the Feng Clan adjusted their robes and composed themselves, ready to face the gathering.<br/><br/>Then, as the Feng Clan began their approach to the mansion's entrance, the noises from inside grew louder, a chaotic blend of laughter, animated conversations, and the occasional burst of argument.<br/><br/>The grand courtyard beyond the gate was filled with the hum of various influential clans already present, their voices bouncing off the marble pillars of Tianlong Mansion.<br/><br/>It was clear that the Eastern Gathering was well underway, with powerful figures exchanging pleasantries or plotting behind guarded smiles.<br/><br/>But the moment the Feng Clan drew closer, a ripple passed through the crowd like a gust of wind disturbing still waters.<br/><br/>Conversations hushed momentarily as eyes turned toward them, assessing the newcomers with a blend of curiosity and contempt.<br/><br/>\"Who are they?\"<br/><br/>\"It's the first time I have seen them.\"<br/><br/>\"Must be a new clan who is participating for the first time.\"<br/><br/>--<br/><br/>It was the first time that Feng Clan was attending the Eastern Gathering and there weren't many people who recognized them at first glance.<br/><br/>However, the moment they spotted the Feng Clan's banner, recognition flickered across their faces, quickly followed by expressions of disdain.<br/><br/>\"It's the Feng Clan!\"<br/><br/>\"The one who killed... \"<br/><br/>\"They have the courage to attend after what they did!\"<br/><br/>\"Alas, they messed with the wrong people!\"<br/><br/>...<br/><br/>Those people in the crowd were not the only ones who were thinking that the Feng Clan was doomed but also the members of the powerful clan thought the same.<br/><br/>The moment that they realize it is the clan that offended Mystic Flame Sect and Spirit Wind Palace, they show their disdain and start to trash talk about them.<br/><br/>Even those who were weaker than the Feng Clan didn't bother to hide their disdain because they believed that the Feng Clan would be destroyed.<br/><br/>Moreover, if they were to have a good relationship with Feng Clan, they believe that they wouldn't look good in front of Mystic Flame Sect and Spirit Wind Palace.<br/><br/>There was also a chance that they would be dealt with if they tried to get along with the Feng Clan.<br/><br/>So, whether it was because of their own agenda or due to the fear of the Mystic Flame Sect, they were ready to ignore or even mock the Feng Clan.<br/><br/>Feng Chen walked at the front, his confidence radiating like an invisible shield. He moved with calm indifference, completely unfazed by the stares or disdain directed his way.<br/><br/>Behind him, Feng Yun, Feng Jianhong, and other clan members followed, their expressions a blend of determination and simmering frustration at the whispers and glares aimed their way.<br/><br/>Just as Feng Chen and the rest of the Feng Clan pass through the grand archway of Tianlong Mansion, a group of men clad in silver robes stepped forward, blocking their path.<br/><br/>The leading figure, a man with sharp eyes and a sneer on his face, chuckled loudly. His voice was dripping with mockery as he spoke.<br/><br/>\"Well, well, look who decided to crawl out of their cave and join the Eastern Gathering. The Feng Clan, huh?\"<br/><br/>He said, folding his arms as if to examine them like an amusement.<br/><br/>Feng Chen looked up at the man with confusion. He didn't know who or what the guy wanted from him.<br/><br/>\"Hey, look, it's Bai Head, Bai Zhang.\"<br/><br/>\"Bai Zhang is said to have broken through the Mid-Stage Three Elements Divine Realm.\"<br/><br/>\"Tsk Tsk! Looks like Feng Clan is in trouble.\"<br/><br/>\"What trouble? Feng Clan Leader is said to have killed Elder Zhou Tianhua. Bai Zhang is not much different compared to him.\" Searᴄh the novёlF~ire.net website on Google to access chapters of novels early and in the highest quality.<br/><br/>\"Hmph! You know nothing. Bai Clan has sworn their allegiance to the Third Prince. They must have gotten something out of that deal. Bai Zhang must have a trump card up his sleeve to handle the Feng Clan; otherwise, he wouldn't dare provoke them like this.\"<br/><br/>\"Oh! But then why is the Bai Clan antagonizing the Feng Clan? I don't think there is any conflict between the two?\"<br/><br/>\"That... I don't know! Maybe there is some past between the two that we don't know about.\"<br/><br/>...<br/><br/>Feng Chen heard the discussion among the crowd and finally realized why the Bai Clan had shown themselves to trouble him.<br/><br/>Others might not know it but how could he not know after knowing that Bai Clan has sworn allegiance with the Third Prince?<br/><br/>Since he had refused the Third Prince's offer, it was certain that he had antagonized the Third<br/><br/>Prince.<br/><br/>And it seems like the Bai Clan was instructed by the Third Prince to take care of him.<br/><br/>Otherwise, there was no other reason for the Bai Clan to show aggression towards the Feng<br/><br/>Clan.<br/><br/>Though Feng Chen wondered who gave them the guts.<br/><br/>(You, Bai Zhang aren't much stronger than Zhou Tianhua. Plus, your Bai Clan Elders aren't much stronger than my Elders. What gives you the courage?)<br/><br/>Feng Chen wondered.<br/><br/>\"Step aside!\"<br/><br/>Feng Chen said. Feng Chen wasn't interested in whatever Bai Zhang or Bai Clan wanted to do.<br/><br/>And it didn't matter to him whether the Bai Clan was associated with the Third Prince or not. He would like to avoid getting into conflict and start bloodshed the moment he entered the Tianlong Mansion.<br/><br/>||||<br/><br/>...<br/><br/>Bai Zhang stared in surprise at Feng Chen's demeanor, which revealed neither anger nor fear. He was also surprised by the fact that Feng Chen wasn't doing anything even when directly<br/><br/>provoked.<br/><br/>However, this only served to bolster Bai Zhang's confidence instead of making him reconsider<br/><br/>or retreat.<br/><br/>He interpreted the restraint shown by Feng Chen as hesitation or perhaps even weakness.<br/><br/>In Bai Zhang's mind, the lack of immediate aggression was a sign that the Feng Clan had no real strength to back up their words.<br/><br/>He even started to believe the rumor that said that the only reason Feng Chen was able to kill Elder Zhou Tianhua was because of some cheap tricks.<br/><br/>His chest puffed out slightly, arrogance swelling within him as he took a step forward.<br/><br/>He sneered, believing that Feng Chen's composed demeanor was merely a facade, a desperate attempt to save face in front of the other clan.<br/><br/>With the Third Prince backing him, and knowing that many of the other influential clans were watching, Bai Zhang saw this as his opportunity to humiliate the Feng Clan publicly, thereby earning favor with the prince and solidifying his own clan's rising status.<br/><br/>\"Step aside? Who do you think you are to order me around? Just a weak clan with a foolish leader! If you know what's good for you, I suggest you apologize to the Third Prince and have<br/><br/>your clan pledge allegiance to him!\"<br/><br/>Bai Zhang ordered arrogantly.<br/><br/>The crowd stirred at his words, some people laughing quietly while others shook their heads<br/><br/>at what they perceived as Feng Clan's fate.<br/><br/>They finally knew that the Feng Clan not only had antagonized the two sects but also the<br/><br/>Third Prince.<br/><br/>It seems like Feng Clan's fate is sealed in this Eastern Gathering.<br/><br/>Even if it wasn't Bai Zhang, they thought that there would be another clan associated with Mystic Flame Sect or Spirit Wind Palace who would have made trouble for them.<br/><br/>It just happens that it was Bai Zhang who went first.<br/><br/>Feng Jianlong's fists clenched at his sides, his eyes burning with anger. Other members of<br/><br/>Feng Clan including Feng Yun were equally angry at Bai Zhang for insulting their clan leader.<br/><br/>If not for Feng Chen signaling them to calm down, they might have jumped and attacked Bai<br/><br/>Zhang.<br/><br/>No matter whether you are Bai Clan Leader or Mystic Flame Sect Leader, Feng Clan Members couldn't tolerate their family head being insulted.<br/><br/>Feng Chen looked at Bai Zhang, his expression still relaxed. He shook his head knowing that this idiot would never listen to him unless he taught him a good lesson.<br/><br/>\"And here I thought the Eastern Gathering was meant for clans with strength, not clowns<br/><br/>looking for a stage.\"<br/><br/>Feng Chen responded as he took a step closer, meeting Bai Zhang's gaze.<br/><br/>\"But if you insist on performing, make it quick. We have more important matters to attend<br/><br/>to.\"\t\t\t\t\t\t</div>", "images": {}, "success": true}