{"id": 71, "url": "https://www.novelhall.com/my-brothers-the-protagonist-good-thing-i-awakened-my-system-33973/14946617.html", "title": "Chapter 72: Climbing The Pillar Of Aptitude!", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 72: Climbing The Pillar Of Aptitude!</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 72: Climbing The Pillar Of Aptitude!\"Okay, then you can start climbing the Pillar Of Aptitude!\"<br/><br/>As soon as Tianlong Zhen's announcement echoed through the arena, the participants frantically surged toward the Pillar of Aptitude.<br/><br/>Eager to prove themselves, many began the climb almost recklessly, their excitement overwhelming any strategy they might have had.<br/><br/>As they entered the Pillar of Aptitude, some participants stumbled and fell, weighed down by the intense pressure, while others moved effortlessly, feeling no strain at all.<br/><br/>The atmosphere buzzed with energy as the spectator cheered on the bold, watching intently as the participants made their way up.<br/><br/>The Feng Clan, however, did not rush.<br/><br/>Feng Yun, standing at the front of his group, observed the chaos with a calm, calculating gaze. He turned to his fellow clan members, silently signaling for patience.<br/><br/>Each of them-Feng Xiaoyu, Feng Mei, Feng Liang, and Feng Jianhong-nodded in understanding, knowing that rushing things will not always yield good results.<br/><br/>They were not the only ones.<br/><br/>Yuan Ziyan along with Yuan Ling and Hu Lian waited for others to go first as well.<br/><br/>There were also some other geniuses like Yunhai Mei with her clan members who also sought to wait for a bit.<br/><br/>This alone revealed the distinction between the anxious and the composed.<br/><br/>After some time, Yunhia and her clan members also began to make their move. seaʀᴄh thё nôᴠel Fire.nёt website on Google to access chapters of novels early and in the highest quality.<br/><br/>Of course, they swiftly overtake many of them in an instant.<br/><br/>\"What?\"<br/><br/>\"How can they climb so effortlessly? I am struggling to even crawl in the 3rd step!\"<br/><br/>\"Sigh! This is the difference between those with great talent and us!\"<br/><br/>The ones who were untalented and struggled even in the 3rd step lamented about the unfair world.<br/><br/>\"Shall we?\"<br/><br/>Feng Jianhong asked.<br/><br/>\"Let's go!\"<br/><br/>Feng Yun said as he also entered the Pillar Of Aptitude.<br/><br/>Yuan Ziyan also followed.<br/><br/>Unlike others, she wasn't waiting because she wanted to avoid the crowd, instead, she wanted to follow the Feng Clan's participants and see who Feng Yun was and how he would perform.<br/><br/>******<br/><br/>In the spectator stands the clan leaders and elders watched with keen interest, discussing the participants among themselves.<br/><br/>The Tianlong Clan has used the Heavenly Projection Crystal to enhance the experience of the event.<br/><br/>This remarkable artifact which is Earth-Grade hovered above the arena, glowing with a soft, azure light that drew the eyes of all present.<br/><br/>As the participants began their ascent, the Heavenly Projection Crystal activated, projecting a stunning holographic image of inside the Pillar of Aptitude.<br/><br/>It displayed not only the climbers themselves but also their current progress and energy fluctuations.<br/><br/>Spectators could see every movement, every struggle, and the determination etched on the climbers' faces.<br/><br/>\"Look, Our Li Bo is second! Haha...\"<br/><br/>The Li Clan leader laughed with pride. Although it was just the start, their clan's participant was second which was a proud moment for him.<br/><br/>\"Haha... Truly a dragon among men!\"<br/><br/>\"With him, our clan will surely prosper!\"<br/><br/>\"Hehe... Looks like our Li Bo will become a disciple of Spirit Wind Palace.\"<br/><br/>The elders besides the clan leader also started to boost their egos and were filled with pride and hope.<br/><br/>(Idiots!)<br/><br/>Many people looked at Li Clan with disdain.<br/><br/>They felt that the Li Clan Leader was an idiot for being happy about Li Bo being second because most of the geniuses from the powerful clan had not even started to climb.<br/><br/>Once they did, it is unknown whether he could even be in the Top 10.<br/><br/>Of course, that didn't mean that there weren't people who weren't jealous.<br/><br/>Even if the geniuses from the Yuan Clan and other powerful clans do overtake him, it doesn't mean that he wasn't talented.<br/><br/>Compared to those hundreds of participants who struggled on the 5th step, Li Bo was indeed one of the most talented who had already reached the 7th step.<br/><br/>Of course, going further seems to be very difficult for him.<br/><br/>Though soon enough, the ranking changed drastically when Yuan Ziyan and others joined the fray.<br/><br/>\"Look, Yunhai Mei from Yunhia Clan has bypassed Li Bo and is ranked second.\"<br/><br/>\"Others have also started to overtake Li Bo!\"<br/><br/>The spectators gasped as the rankings on the Heavenly Projection Crystal updated in real-<br/><br/>time.<br/><br/>The buzz of excitement intensified, with whispers and shouts echoing throughout the arena. \"Yunhai Mei is climbing like a whirlwind! Look at that speed!\"<br/><br/>One elder exclaimed, leaning forward in his seat, his eyes glued to the crystal.<br/><br/>Indeed, Yunhai Mei moved with remarkable agility as if there was no pressure at all even at<br/><br/>the 7th step.<br/><br/>On the way, she met many who struggled even to crawl but she casually walked like taking a stroll through a park.<br/><br/>This highlighted the distinction between the talented and the untalented.<br/><br/>Those with exceptional abilities tended to feel less pressure while ascending the Pillar of Aptitude, while others experienced the weight of a massive boulder resting heavily on their<br/><br/>shoulders.<br/><br/>This was the same as in cultivation. For those talented cultivators, breaking through was a breeze while for others it was tantamount to going against heaven.<br/><br/>\"Li Bo has fallen to fourth place!\"<br/><br/>Someone cried out, pointing at the display.<br/><br/>-<br/><br/>\"Tsk! Tsk! Now, he is no longer in the Top 10!\"<br/><br/>Li Bo was quickly pushed back in ranking by the geniuses who joined.<br/><br/>Of course, while Li Bo lost his second place, the first place remained the same.<br/><br/>Why?<br/><br/>Because it was held by Tianlong Yu, the genius of the Tianlong Clan.<br/><br/>Unlike others like Yuan Ziyan or Yunhai Mei, he didn't wait. He didn't want anyone to have<br/><br/>first place apart from him.<br/><br/>He was already on the 9th step and was on his way to the 10th step.<br/><br/>\"Indeed, the 10th step is different from others!\"<br/><br/>Tianlong Yu said arrogantly as he stepped on the 10th stair.<br/><br/>For him, going from 1st step to 5th was nothing more than walking.<br/><br/>After that, he felt a bit of pressure but when he entered the 10th step, it was as if the difficulty<br/><br/>had increased 10x and he struggled to even move his fingers.<br/><br/>\"Ah, Tianlong Yu has already reached the 10th step.\"<br/><br/>Someone gasped in astonishment. In just over five minutes, Tianlong Yu had already reached the 10th step-a feat that would undoubtedly grant him entry into any sect of his choosing.<br/><br/>Of course, he was already a disciple of the Spirit Wind Palace.<br/><br/>\"Haha... Good! Good! As expected from the inner disciple of our sect.\"<br/><br/>Grand Elder Ren Daoyu said with pride.<br/><br/>\"This is all because of the love and care of Spirit Wind Palace!\"<br/><br/>Tianlong Qi said with humility. How could he miss the chance to flatter the Grand Elder of<br/><br/>Spirit Wind Palace?<br/><br/>Grand Elder simply nodded happily.<br/><br/>On the other hand, Yuan Hao frowned.<br/><br/>\"What is Ziyan doing?\"<br/><br/>He muttered. She had already started climbing but she was still in the 6th step and she didn't<br/><br/>seem to be in a hurry.<br/><br/>Of course, he knew her daughter's talent better than anyone. To her, climbing to the 10th step<br/><br/>is no different than walking.<br/><br/>So, he was surprised that she was still stuck on the 6th step.<br/><br/>\"I don't know what she is thinking.\"<br/><br/>Yuan Hao shook his head not knowing what to do with Yuan Ziyan. Since childhood, she has<br/><br/>been willful and did what she wanted.<br/><br/>Instead of focusing on her, he instead looked at Yuan Ling who had already reached the 9th<br/><br/>step, just below Tianlong Yu.<br/><br/>In the Pillar of Aptitude, Feng Yun along with others climbed the stairs. Of course, for them, climbing to the 6th step was nothing more than taking a walk.<br/><br/>But then Feng Yun seemed to have slowed down and he fell behind Feng Mei and others.<br/><br/>\"Brother, are you struggling?\"<br/><br/>Feng Mei asked in worries. Feng Yun didn't reply and just pointed at Yuan Ziyan who was behind them.<br/><br/>Feng Mei instantly understood. This Yuan Ziyan has been following them since the start and<br/><br/>she seems determined to stay behind them.<br/><br/>Since that was the case, Feng Yun decided to just keep playing with her and see for how long<br/><br/>she would stay with him.<br/><br/>Feng Mei nodded and climbed faster. Feng Liang and others also followed suit. They knew that Feng Yun wouldn't take a long time to catch up even if he stayed there.<br/><br/>When Feng Mei and others increased their pace, Yuan Ziyan was surprised. She thought that<br/><br/>they were already struggling and climbing at their fastest. Who knew that they could increase their pace when they were at 6th step?<br/><br/>What puzzled her even more was that Feng Yun, whose name she didn't yet know, remained at<br/><br/>the 6th step.<br/><br/>She looked at Feng Mei and her group and then Feng Yun and decided to stick with him until<br/><br/>she knew who was who.<br/><br/>Moreover, she believed that Feng Yun who is rumored to be 'Trash' would undoubtedly be the<br/><br/>most untalented amongst the Feng participants.<br/><br/>(Let's see how long you could stay here!)<br/><br/>Feng Yun thought with a hint of amusement. If one looks closer, one will see that he has the<br/><br/>same expression as Feng Chen when they toy with their prey.<br/><br/>Indeed, brothers of the same blood!\t\t\t\t\t\t</div>", "images": {}, "success": true}