{"id": 74, "url": "https://www.novelhall.com/my-brothers-the-protagonist-good-thing-i-awakened-my-system-33973/14946620.html", "title": "Chapter 75: The Pressure Of Aspiration", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 75: The Pressure Of Aspiration</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 75: The Pressure Of Aspiration\"No, No, This can't be happening!\"<br/><br/>Tianlong Yu complained in his heart when he saw Yuan Ziyan catching up to him.<br/><br/>He thought he was the best seeing that no one was catching up to him but in a matter of minutes, Yuan Ziyan had also entered the 12th step.<br/><br/>Moreover, Yuan Ziyan wasn't struggling as much as he did and was even advancing further.<br/><br/>Previously, he tried his best to go another step but couldn't. So, he was just holding on, hoping that nobody would make it to this step.<br/><br/>But Yuan Ziyan came and now it looks like she will surpass him.<br/><br/>Yuan Ziyan didn't even spare a glance at Tianlong Yu and soon enough overtook him.<br/><br/>(Dammit! I refuse to believe this!)<br/><br/>Tianlong Yu cursed in his heart, frustration mounting as he gathered every ounce of strength he had left to move one more step.<br/><br/>The 12th step loomed ahead of him, taunting him with its seemingly impossible distance. He had been so confident-certain that no one could catch up to him, let alone surpass him. But now, with Yuan Ziyan effortlessly climbing ahead, his pride was crumbling.<br/><br/>His muscles trembled under the immense pressure of the Pillar's suppression, each breath he took becoming more labored and painful.<br/><br/>He gritted his teeth, forcing his body to comply, but it was no use. His legs felt like they were made of lead, the weight of the spiritual energy pressing down on him like a mountain.<br/><br/>(Dammit! No! I refuse to give up!)<br/><br/>He screamed inwardly, his frustration burning like fire in his chest. With a guttural grunt, he tried once again to lift his foot, but the weight was unbearable.<br/><br/>His body wouldn't respond no matter how much he pushed. Sweat poured down his face, his vision blurring from the strain.<br/><br/>The effort to take just one more step was overwhelming, and the more he struggled, the clearer it became that he had reached his limit.<br/><br/>The reality of it was devastating-no matter how much he wished otherwise, he couldn't<br/><br/>move.<br/><br/>(No, this can't be happening!)<br/><br/>Tianlong Yu's breath caught in his throat as he pushed himself harder, refusing to accept defeat.<br/><br/>He clenched his fists so tightly that his nails dug into his palms, his body trembling under the weight.<br/><br/>But then, suddenly, the pressure became too much. His inner energy, already strained to the breaking point, rebelled violently.<br/><br/>With a choking sound, he felt a surge of blood rises in his throat.<br/><br/>He stumbled, his body convulsing from the overexertion, and before he could stop it, he spat out a mouthful of blood.<br/><br/>The metallic taste filled his mouth, a bitter reminder of his failure.<br/><br/>(Damn it! I've overdone it...)<br/><br/>He wiped his mouth, but the damage was done. His face paled, and he could feel his strength draining rapidly.<br/><br/>His vision dimmed, and his legs wobbled beneath him. No matter how much he wanted to continue, his body had reached its absolute limit.<br/><br/>He could just watch as Yuan Ziyan stepped on the 13th stair.<br/><br/>***<br/><br/>On the spectator side, Tianlong Qi's expression immediately changed. He was also thinking that his clan would get the first position in this round.<br/><br/>However, Yuan Ziyan proved him wrong.<br/><br/>Judging by Tianlong Yu's expression, he could already tell that the 12th step was his limit. That means that his clan has no chance of grabbing the first position.<br/><br/>Grand Elder Ren Daoyu was equally disappointed and there was even a hint of anger.<br/><br/>On the other side, both the Feng Clan and Yuan Clan's elders were filled with pride as they watched their participants excel.<br/><br/>A sense of satisfaction radiated from their faces, their eyes gleaming with pride as their clan members continued to advance.<br/><br/>It is almost confirmed that these two clans would be in the Top-3 of overall ranking of the first round. No other clan has two or more participants above the 10th step.<br/><br/>\"Hehe... Clan Leader Yuan Hao, your daughter is hiding quite deep!\"<br/><br/>Feng Chen said.<br/><br/>Yuan Hao smiled modestly and replied, \"She's certainly talented, but she still has a long way to go.\"<br/><br/>He then thought of someone and continued.<br/><br/>\"And compared to real genius, she is nothing!\"<br/><br/>Yuan Hao was hinting that compared to Ling Meiyu, his daughter's talent wasn't anything to write home about.<br/><br/>Of course, he knows the relationship between Feng Clan and Ling Meiyu, so he didn't say her<br/><br/>name.<br/><br/>Feng Chen clearly understood his implication and was well aware of it.<br/><br/>After all, when compared to Ling Meiyu, who achieved Grand Qi Condensation at 17, Yuan Ziyan's Peak Core Formation Stage at 19 paled in comparison.<br/><br/>(Eyes Of Insight!)<br/><br/>****************<br/><br/>Name: Yuan Ziyan<br/><br/>Cultivation Level: Peak Core Formation Stage<br/><br/>Talent: Exceptional Talent<br/><br/>Physique: None seaʀᴄh thё novel(F~)ire.net website on Google to access chapters of novels early and in the highest quality.<br/><br/>****************<br/><br/>(Indeed, very talented!)<br/><br/>It was the second time that he had seen anyone with Exceptional Talent, other than Feng Mei.<br/><br/>Of course, because Feng Mei also has a physique of Phoenix, her future would be greater than<br/><br/>Yuan Ziyan.<br/><br/>Still, her level of talent is one in a million.<br/><br/>***<br/><br/>In the Pillar Of Aptitude, Feng Yun advanced further amidst the shock of other participants and was on the 10th step where Feng Jianhong, Feng Liang and Feng Xiaoyu were.<br/><br/>\"How are you all doing?\"<br/><br/>Feng Yun asked them.<br/><br/>\"It's okay! But advancing further would need some more energy.\"<br/><br/>Feng Liang replied. Although they were on the 10th step of the Pillar Of Aptitude, they still<br/><br/>had the power to go further.<br/><br/>Feng Yun nodded. He knew that with their talent, the 10th step wasn't their limit.<br/><br/>However, from the corner of his eyes, he could see that Feng Jianhong was struggling a bit.<br/><br/>However, he didn't comment on it.<br/><br/>Even if he told him to give up, he wouldn't listen to him and it wasn't his place to tell him that<br/><br/>either.<br/><br/>That's how he was in the past as well.<br/><br/>Many people have also told him in the past to stop cultivating as it was useless, some who<br/><br/>genuinely wished for his well-being and others in a mocking manner.<br/><br/>Nonetheless, he did what he wanted and had proved them wrong.<br/><br/>So, he didn't say anything to Feng Jianhong either.<br/><br/>\"Okay, do your best!\"\t\t\t\t\t\t</div>", "images": {}, "success": true}