{"id": 73, "url": "https://www.novelhall.com/my-brothers-the-protagonist-good-thing-i-awakened-my-system-33973/14946619.html", "title": "Chapter 74: Real Competition Starts Now!", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 74: Real Competition Starts Now!</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 74: Real Competition Starts Now!Yuan Ziyan flushed slightly, realizing that her little act had been seen through so easily.<br/><br/>She narrowed her eyes at Feng Yun, a mix of embarrassment and frustration flickering across her face.<br/><br/>\"Hpmh! So what If you found out?\"<br/><br/>Yuan Ziyan said, attempting to mask her embarrassment. She couldn't believe she had let herself feel vulnerable in front of her enemy.<br/><br/>\"Feng Yun, let me say this straight. You don't deserve to be the husband of my junior sister and your three-year challenge is nothing more than a joke.\"<br/><br/>Yuan Ziyan spoke, her thoughts firmly fixed on the notion that Feng Yun had issued a three- year challenge merely to win Ling Meiyu back.<br/><br/>And as Ling Meiyu's senior sister, she thought it was her responsibility to block any obstacle (Feng Yun) from hindering her cultivation.<br/><br/>Feng Yun's relaxed expression faltered slightly when he heard Yuan Ziyan's words, but only for a fleeting moment.<br/><br/>His calm demeanor returned, though his eyes darkened as if a storm was brewing beneath the surface.<br/><br/>He was usually calm, unshaken by anything, but the mere mention of Ling Meiyu always stirred something within him-especially when others claimed he wasn't worthy of her. \"You really think I don't deserve her?\"<br/><br/>Feng Yun asked, his voice low and measured, but there was an unmistakable edge to it now.<br/><br/>He turned his head slightly, his gaze locking onto Yuan Ziyan with an intensity that made her pause.<br/><br/>Yuan Ziyan, seeing the cold look on Feng Yun's face for the first time, felt a sudden shiver run through her as if a trace of fear had crept in.<br/><br/>Almost immediately, she felt ashamed.<br/><br/>(How could I be scared of him? Hmph!)<br/><br/>\"I know you don't. Meiyu has moved on, and so should you. This challenge you issued... it's nothing but a distraction for her, a foolish attempt to cling to the past.\"<br/><br/>Feng Yun's jaw tightened as his thoughts raced. He assumed that Yuan Ziyan's hostility came not just from his past engagement with Ling Meiyu, but also from the lingering conflict between their sects.<br/><br/>She was the disciple of Mystic Flame Sect and it was normal for her to hate him because his brother beat up Elder Zhou at the first encounter and killed him on their second.<br/><br/>But that wasn't why she was hostile to him but because she believed he was challenging Ling Meiyu out of lingering feelings for her.<br/><br/>That thought alone made him want to throw up.<br/><br/>(Who in their right mind would be interested in that woman?)<br/><br/>He thought, almost wanting to laugh at the absurdity of it.<br/><br/>Feng Yun's lips twitched, almost in disbelief, as he shook his head slightly, more to himself than to Yuan Ziyan.<br/><br/>His eyes, however, remained fixed on her, his gaze as cold as ever.<br/><br/>\"You really don't get it, do you?\"<br/><br/>He said, his tone laced with a mix of annoyance and anger.<br/><br/>\"Do you honestly think I'm doing all of this for Ling Meiyu? That I care about winning her back?\"<br/><br/>Yuan Ziyan crossed her arms defiantly, confident as ever that this was the case.<br/><br/>\"Isn't that what all of this is about? You couldn't handle being cast aside, so now you're trying to prove something with this ridiculous challenge.\"<br/><br/>Feng Yun's expression hardened.<br/><br/>\"Let me make one thing clear,\" he said, his voice steady but firm.<br/><br/>\"I don't care about Ling Meiyu and wouldn't want her even if she begs me.\"<br/><br/>Yuan Ziyan narrowed her eyes, angered by his words.<br/><br/>How could she handle her junior sister being insulted like this?<br/><br/>\"Begs you? Feng Yun, stop dreaming. That wouldn't happen in a million years!\"<br/><br/>Yuan Ziyan said angrily.<br/><br/>Hearing this, Feng Yun was dumbfounded once again.<br/><br/>He was just making an analogy that what she was thinking was wrong and he wasn't interested in Ling Meiyu at all.<br/><br/>He hadn't expected her to take his words so literally, and for a moment, he was caught between amusement and frustration.<br/><br/>\"You completely missed my point,\" Feng Yun muttered under his breath, shaking his head slightly.<br/><br/>\"Anyway, no matter what you say, this is the agreement between me and Ling Meiyu. You don't need to stick your nose into something that doesn't concern you!\"<br/><br/>Feng Yun warned. He felt that no matter what he said, Yuan Ziyan wouldn't understand or trust his words.<br/><br/>Then it was better for him to just make her stop meddling in his business.<br/><br/>\"Hmph! So what if I am meddling? As the senior sister of Ling Meiyu, it is my responsibility to keep pests like you away from her.\"<br/><br/>She continued, \"Junior sister is the peerless genius of our sect who will one day become the Sect Leader.\"<br/><br/>She continued, her voice rising with determination.<br/><br/>\"And as for your ridiculous challenge, I'm challenging you. If you cannot even defeat me, then you have no right to compete with my junior sister. Hmph!\"<br/><br/>After saying that Yuan Ziyan stopped pretending to struggle and started climbing the Pillar Of Aptitude seriously.<br/><br/>Feng Yun watched Yuan Ziyan's back as she dismissed him, issuing a one-sided challenge he hadn't even agreed to. Shaking his head, he concluded it was for the best that she was leaving. 7th step, 8th step and 9th step! Yuan Ziyan was just behind Feng Jianhong and others.<br/><br/>This astonished many people who were already exhausted and thought that the competition was already over.<br/><br/>***<br/><br/>In the spectator area, Yuan Ziyan looked at the Heavenly Projection Crystal and saw his daughter having a conversation with Feng Yun.<br/><br/>(What is she doing?)<br/><br/>Yuan Hao thought. He quietly observes her while also looking at the people at the top.<br/><br/>Tianlong Yu was still at the top, in the 12th step. While Feng Mei, Yuan Ling, and Hu Lian were<br/><br/>at the 11th step.<br/><br/>Then Yuan Ziyan began to ascend the stairs, surprising many onlookers. She quickly entered the Top 10 ranking and quickly surpassed the 10th and 9th place.<br/><br/>\"Someone is climbing the stairs very quickly!\"<br/><br/>\"Oh, she is Yuan Ziyan. She has reached the 9th step.\"<br/><br/>\"Yuan Ziyan? What was she doing in the back?\"<br/><br/>At first, the crowd was astonished that someone could climb so quickly at this stage.<br/><br/>However, once they learned who the climber was, their surprise faded.<br/><br/>\"Oh no, someone else is also climbing the stairs quickly.\"<br/><br/>\"Who?\"<br/><br/>\"It's Feng Yun of Feng Clan!\"<br/><br/>\"Feng Yun as in the ex-fiancee of Miss Ling?\"<br/><br/>\"It should be! Look, he already reached the 9th step as well!\"<br/><br/>...<br/><br/>Feng Yun also climbed the Pillar Of Aptitude after Yuan Ziyan and soon reached the 9th step.<br/><br/>As for the challenge from Yuan Ziyan, he didn't take it seriously. But of course, he was<br/><br/>determined to reach at least the 17th step.<br/><br/>Seeing Feng Yun catching up to her, Yuan Ziyan snorted and increased her pace.<br/><br/>Despite the pressure being very high, it didn't stop Yuan Ziyan and soon enough, she caught<br/><br/>up to Feng Mei and others who were still in the 11th step.<br/><br/>\"Sister!\"<br/><br/>\"Ziyan'er!\"<br/><br/>Hu Lian and Yuan Ling called out. For a minute, they thought that she had encountered a<br/><br/>problem and was stuck below.<br/><br/>But they were relieved when she saw her.<br/><br/>Indeed, how could she, who was more talented than them, be below them?<br/><br/>They wanted to ask why she was staying behind but she didn't stop and still continued to<br/><br/>climb further.<br/><br/>\"I will be leaving! You two continued on at your own pace!\"<br/><br/>Yuan Ziyan said and swiftly departed, leaving both Hu Lian and Yuan Ling dumbfounded.<br/><br/>She was determined to show Feng Yun that he was no opponent of her, much less her junior<br/><br/>sister.<br/><br/>\"Hmph! Let's see whether you can reach here.\"<br/><br/>Yuan Ziyan muttered as she climbed to the 12th step.<br/><br/>Sёarᴄh the Nôvel(F)ire.nёt website on Google to access chapters of novels early and in the highest quality.\t\t\t\t\t\t</div>", "images": {}, "success": true}