{"id": 72, "url": "https://www.novelhall.com/my-brothers-the-protagonist-good-thing-i-awakened-my-system-33973/14946618.html", "title": "Chapter 73: Confrontation With Yuan Ziyan!", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 73: Confrontation With Yuan Ziyan!</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 73: Confrontation With Yuan Ziyan!The top was still Tianlong Yu who was still on the 10th step but he was struggling to go on the 11th step.<br/><br/>On the 9th step were Hu Lian, Yunhia Mei, and Yuan Ling.<br/><br/>It was as expected since they were already the disciple of the Top Sect and also considered Top Talents in the Eastern Region.<br/><br/>But what many didn't expect was the participants from Feng Clan who were right behind them.<br/><br/>Feng Mei was on the 8th step followed by Feng Liang, Feng Xiaoyu, and Feng Jianhong who were on the 7th step.<br/><br/>\"This Feng Mei is actually just behind Yuan Ling. She must be quite talented.\"<br/><br/>\"Not only her, but other participants from Feng Clan aren't bad either. Three of them are already on the 7th step.\"<br/><br/>\"This Feng Clan is hiding too deep. Even their youth has such incredible talent. No wonder they are so arrogant!\"<br/><br/>...<br/><br/>Since the names of the participants are listed on the ranking, they naturally knew their names. The crowd was astonished by the talent shown by them.<br/><br/>Some just watched with hatred, like the Bai Clan, and cursed inwards.<br/><br/>\"This Feng Clan has some talent.\"<br/><br/>Grand Elder Ren Daoyu spoke with a faint trace of killing intent in his voice. His presence at the competition wasn't just to spectate-it was to evaluate the Feng Clan.<br/><br/>If the opportunity arose, he would not hesitate to eliminate them.<br/><br/>For now, however, he chose to remain patient, observing the rest of the competition carefully before deciding whether to act.<br/><br/>The more talent the Feng Clan displayed, the stronger Ren Daoyu's killing intent grew.<br/><br/>Tianlong Qi also watched with a frown as he was clearly unhappy that Feng Clan's participants were catching up to Tianlong Qi.<br/><br/>Moreover, his other Tianlong Clan participants were already left behind by four Feng Members.<br/><br/>(TRASH!)<br/><br/>Tianlong Qi thought angrily. He thought that with Ren Daoyu's presence, he might be able to enroll other geniuses from his clan into Spirit Wind Palace.<br/><br/>But they only disappointed him with their pathetic performance.<br/><br/>With none of his clan geniuses on Top-10 ranking, he was certain that they would not be admitted to Spirit Wind Palace.<br/><br/>Moreover, he was also concerned about Tianlong Yu who was stuck in the 10th step while others were catching up.<br/><br/>On the other hand, Yuan Hao seemed very carefree. He didn't seem to think much even when his daughter was stuck in the 6th step or the others who were still on the 5th step.<br/><br/>Rather than that, he was deeply interested in Feng Clan members who all showed phenomenal performance.<br/><br/>If nothing goes wrong then with four of their members in the Top 10, the Feng Clan would surely be ranked number one in the first round.<br/><br/>Yuan Hao had been quietly observing the Feng Clan for a while, his thoughts lingering on how they had managed to nurture such talented individuals.<br/><br/>The more he watched, the more curious he became.<br/><br/>(How did the Feng Clan produce so many geniuses?)<br/><br/>He wondered, his interest growing with each passing moment.<br/><br/>Unable to hold back any longer, Yuan Hao finally decided to approach. With a polite smile, he made his way toward Feng Chen, the leader of the Feng Clan.<br/><br/>\"Haha... Clan Leader Feng Chen,\" Yuan Hao greeted warmly. \"I didn't expect your clan to have so many talented people.\"<br/><br/>He was the first among the leaders at the Eastern Gathering to approach the Feng Clan.<br/><br/>Well, that was excluding Bai Zhang but obviously, that was different from this.<br/><br/>Feng Zhenshan and Feng Zhilan were well aware of Yuan Hao's strength and the powerful background he came from.<br/><br/>Without hesitation, they bowed respectfully before him and offered him a seat next to Feng Chen.<br/><br/>They were thinking that if they could become friends with the Yuan Clan then they would greatly benefit from this gathering.<br/><br/>With so many enemies that they made, having allies was a must.<br/><br/>Though Feng Chen obviously didn't share the same sentiment.<br/><br/>\"Thanks for the compliment. Your clan's geniuses aren't bad either!\"<br/><br/>Feng Chen responded calmly, sensing no ill intentions from Yuan Hao and thus replying with courtesy.<br/><br/>He wasn't concerned, knowing that no one would dare make a move with so many eyes watching, even if they had ill intentions.<br/><br/>Besides, with his cultivation at the Three Elements Divine Realm, Feng Chen was confident that Yuan Hao posed no real threat to him.<br/><br/>Yuan Hao settled into the seat offered by the Grand Elder and continued his conversation with<br/><br/>Feng Chen.<br/><br/>He had approached both talk and observe Feng Chen.<br/><br/>He was already interested in Feng Chen before the competition.<br/><br/>After all, in the Azure Sky Empire, there is no one who dares defy the Mystic Flame Sect, at least not an alive one.<br/><br/>Now that Feng Clan's geniuses were showing such spectacular performances, he couldn't wait to get to know Feng Chen.<br/><br/>Whether his daughter objected or not was of no concern to him. How could he, as her father, be hindered by his own child?<br/><br/>If she was willful then he was even more stubborn.<br/><br/>Yuan Hao was a bit surprised by how nonchalant Feng Chen was in his presence, although he had anticipated this demeanor based on Feng Chen's interactions with Tianlong Qi.<br/><br/>\"Haha... They are alright!\"<br/><br/>Yuan Hao said as he continued to watch the Heavenly Projection Crystal.<br/><br/>In the Pillar Of Aptitude, Yuan Ziyan kept a close watch on Feng Yun as they ascended the<br/><br/>Pillar of Aptitude together.<br/><br/>The longer Feng Yun stayed on the 6th step, the more suspicious Yuan Hao got.<br/><br/>From the way he moved, there was no sign of struggle, but neither did he exert the same impressive speed as his clan members.<br/><br/>She thought that he was intentionally holding back, and that intrigued her.<br/><br/>Above them, Feng Mei was steadily ascending, surpassing the 8th step and nearing the 9th. The rest of the Feng Clan members had also reached the 8th step.<br/><br/>Their movements remained fluid, and they showed no sign of slowing down.<br/><br/>Their names were already shown on the ranking which Yuan Ziyan also saw.<br/><br/>From this, she was finally able to confirm that the man before her was indeed Feng Yun, the<br/><br/>former fiancee of Ling Meiyu.<br/><br/>\"Why aren't you advancing faster?\"<br/><br/>She asked, her tone laced with curiosity.<br/><br/>\"You're holding back, aren't you?\"<br/><br/>Feng Yun glanced sideways at her, his smile widening just a fraction.<br/><br/>\"What makes you think that?\"<br/><br/>Yuan Ziyan gestured toward a man who was nearly kneeling.<br/><br/>\"Look at him,\" she remarked.<br/><br/>\"Those who are truly struggling are like him, barely able to lift their heads.\"<br/><br/>In contrast, Feng Yun leaned back, his head tilted comfortably as if he were enjoying a<br/><br/>leisurely day rather than facing a challenge.<br/><br/>Feng Yun chuckled softly, his expression still unreadable.<br/><br/>\"Of course, to know just how long you are willing to stay behind me?\" Sёarch* The nôvel_Fire.ηet website on Google to access chapters of novels early and in the highest quality.<br/><br/>Feng Yun answered honestly.<br/><br/>\"What? You knew that I was intentionally staying behind you?\"<br/><br/>Yuan Ziyan said with a surprised expression. Unlike Feng Yun, she thought that she was acting<br/><br/>quite well.<br/><br/>(Look at my posture! Look at my sweat! It is the same as those who are struggling!)<br/><br/>She thought to herself, believing that no one would know that she was deliberately staying<br/><br/>behind like Feng Yun.<br/><br/>\"You were trying to hide that?\"<br/><br/>Feng Yun said with a weird expression.<br/><br/>Judging by her expression, Feng Yun was certain that she thought that she was acting quite<br/><br/>well.<br/><br/>But she forgot that she was Yuan Ziyan, a disciple of Mystic Flame Sect.<br/><br/>How could it be possible for her to struggle at the 6th step?<br/><br/>Furthermore, how could he be unaware that she was targeting him when she had been staring<br/><br/>at him the entire time?<br/><br/>He would have to be blind not to notice.\t\t\t\t\t\t</div>", "images": {}, "success": true}