{"id": 75, "url": "https://www.novelhall.com/my-brothers-the-protagonist-good-thing-i-awakened-my-system-33973/14946621.html", "title": "Chapter 76: Love Rival?", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 76: Love Rival?</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 76: Love Rival?As Feng Yun made his way up the Pillar Of Aptitude, soon reaching where Feng Mei stood, Hu Lian and Yuan Ling couldn't help but observe him with newfound interest.<br/><br/>The Feng Clan had surprised them with its abundance of talent, and both Feng Yun and Feng Mei stood out among the rest, demonstrating strength that put them on par with the best of the competition, at least for now.<br/><br/>This was not their arrogance but a fact.<br/><br/>They were rare geniuses who are valued even by the Top Sect, so one could understand just how talented they were.<br/><br/>But Yuan Ling's attention was concentrated more elsewhere.<br/><br/>Hu Lian was focused on analyzing Feng Yun who is the ex-fiancee of Ling Meiyu, who is also her junior sister.<br/><br/>However, she wasn't very close to Ling Meiyu and didn't bother about her affairs as well.<br/><br/>But she was indeed curious about the man who dared to divorce her.<br/><br/>After all, Ling Meiyu was the daughter of Ling Clan, Top 3 Clan in the capital with Nascent Soul Realm expert.<br/><br/>Moreover, she was also Mystic Flame Sect's little sect leader who would one day become the leader of number one sect of Azure Sky Empire.<br/><br/>So, even if she were to break off her engagement, the other party should have yielded and agreed without resisting.<br/><br/>But Feng Yun, not only dared to divorce her instead but also issued a three-year challenge which has been the talk of town for months in Mystic Flame Sect.<br/><br/>On the other hand, Yuan Ling's attention was elsewhere, which was Feng Mei.<br/><br/>From the moment he saw her, something stirred within him-a quiet fascination that quickly turned into admiration.<br/><br/>In his eyes, Feng Mei stood apart from everyone else, her form radiant under the shifting light of the Pillar.<br/><br/>Her expression was calm and collected, her every movement filled with grace and purpose.<br/><br/>She seemed unaffected by the surrounding pressure, her poise unbroken, making her presence almost ethereal.<br/><br/>Her long, raven-black hair cascaded down her back, the loose strands swaying gently in the breeze.<br/><br/>Her eyes, sharp and unwavering, held a depth that drew him in, as if they could see through everything. S~eaʀᴄh the NôᴠelFirё.net website on Google to access chapters of novels early and in the highest quality.<br/><br/>Her quiet confidence captivated him. Unlike others, who struggled and fought against the weight of the Pillar's steps, Feng Mei stood still, like a goddess unbothered by the mortal trials around her.<br/><br/>Her skin, smooth and fair, seemed to glow under the light, and her lips were set in a soft line, neither smiling nor frowning, as if nothing could faze her.<br/><br/>Yuan Ling's admiration deepened the more he watched her. He could feel his heart pull toward her, a feeling that was both exhilarating and terrifying.<br/><br/>(She's like no one I've ever met. How could anyone compare?)<br/><br/>He didn't even realize he was staring until Hu Lian nudged him.<br/><br/>Yuan Ling snapped out of his daze but couldn't help sneaking another glance at her.<br/><br/>He felt an inexplicable need to talk to her, to somehow catch her attention, but he hesitated, unsure if he could ever approach someone like her.<br/><br/>However, before he could even muster the courage, Feng Yun was already by her side.<br/><br/>\"Did you wait for too long?\"<br/><br/>Feng Yun asked Feng Mei, his voice warm and easy.<br/><br/>Feng Mei shook her head lightly, a small smile gracing her lips as she replied, \"Not at all!\"<br/><br/>They exchanged warm smiles, their eyes locking in a moment of quiet understanding, feeling a connection that needed no words.<br/><br/>It was just the two of them at that moment, sharing an unspoken understanding.<br/><br/>As they stood together, Yuan Ling felt a pang of envy.<br/><br/>He saw how easily Feng Yun and Feng Mei got along, their connection clear. It made him feel even more distant from her.<br/><br/>Moreover, Feng Mei no longer exuded that Ice Princess image; instead, she radiated a warm, sunny demeanor.<br/><br/>This crushed any form of hope that he had in pursuing her.<br/><br/>\"Let's climb together!\"<br/><br/>Feng Yun suggested, extending his hand toward her with a confident grin.<br/><br/>Feng Mei accepted his hand, and the moment their fingers touched, a rush of warmth coursed through Yuan Ling.<br/><br/>Yuan Ling felt a mix of frustration and longing as he watched their hands join, wishing he could have even a little of that connection with her.<br/><br/>Alas, what was not his will never be his!<br/><br/>\"Yuan Ling, you okay?\"<br/><br/>Hu Lian nudged him again, snapping him back to reality.<br/><br/>\"Yeah, just... thinking,\" he mumbled, his eyes drifting back to Feng Mei and Feng Yun, who were now scaling the 12th step with ease.<br/><br/>\"Don't let them distract you. Focus on your own climb.\"<br/><br/>Hu Lian advised because she thought that Yuan Ling was in shock that Feng Yun and Feng Mei surpassed him.<br/><br/>After all, she was quite surprised that Feng Mei was able to climb up so easily. She had assumed that Feng Mei was like her, who struggled to make progress.<br/><br/>Yuan Ling nodded, forcing himself to shift his gaze back to the Pillar of Aptitude.<br/><br/>On the 12th step, Tianlong Yu, who had been feeling down after Yuan Ziyan passed him, had just regained his composure and was comforting himself with the thought that at least he was in second place when Feng Yun and Feng Mei joined him on the same step.<br/><br/>\"WHAT?\"<br/><br/>He exclaimed, his heart sinking at the sight of the two of them.<br/><br/>Just when he recovered from the shock given by Yuan Ziyan, he got another shock.<br/><br/>Feng Yun, with his easy smile and relaxed demeanor, seemed unfazed by the pressure, while Feng Mei stood beside him, radiating a calm confidence that made Tianlong Yu's frustration<br/><br/>boil over.<br/><br/>\"Who the hell are you?\"<br/><br/>Tianlong Yu gritted his teeth, glaring at Feng Yun.<br/><br/>Feng Yun merely glanced at him before looking away, while Feng Mei showed no interest in<br/><br/>his outburst either.<br/><br/>They were already aware that the Tianlong Clan was hostile towards their clan, making them natural enemies.<br/><br/>Even if that weren't the case, the way Tianlong Yu had posed his question left little desire for<br/><br/>a response.<br/><br/>He spoke to them as if they were his subordinates, and who with any self-respect would listen<br/><br/>to that?<br/><br/>Certainly not Feng Yun and Feng Mei.<br/><br/>\"HEY!\"<br/><br/>Tianlong Yu shouted, frustration boiling over. If he couldn't move, he would have moved over<br/><br/>there and gave them a good beating.<br/><br/>Alas, he already overexerted earlier and no longer to even lift his finger to point at them.<br/><br/>\"Can't you hear me? I'm talking to you two!\"<br/><br/>His voice was sharp, cutting through the air as he tried to assert his presence.<br/><br/>Feng Yun and Feng Mei exchanged a glance, unfazed by his outburst.<br/><br/>Feng Yun leaned slightly closer to Feng Mei, a teasing smile on his face.<br/><br/>\"Looks like someone is unaware that we are intentionally ignoring him.\"<br/><br/>He murmured, just loud enough for Tianlong Yu to hear.<br/><br/>Feng Mei giggled, aware that Yun was saying this to make fun of Tianlong Yu.<br/><br/>This only fueled Tianlong Yu's anger further.<br/><br/>\"You think I am a joke? Do you even know who I am?\"<br/><br/>He snapped, his face reddening.<br/><br/>Feng Yun raised an eyebrow, unfazed by Tianlong Yu's outburst.<br/><br/>\"Honestly, does it matter?\"<br/><br/>Feng Yun honestly has enough people using their background to scare others. Moreover, he<br/><br/>didn't even do anything and couldn't understand just why Tianlong Yu was being angry at<br/><br/>them.<br/><br/>Tianlong Yu's fists clenched at his sides, and he could feel his anger boiling over.<br/><br/>\"I'm from the Tianlong Clan!\"<br/><br/>\"So?\" Feng Yun asked, his tone calm and steady. He already knew that and moreover even if that wasn't the case, he wouldn't be scared of him because of his clan.<br/><br/>Tianlong Yu was once again surprised by how nonchalant Feng Yun was even after hearing his<br/><br/>clan's name.<br/><br/>But even so, he threatened again. How could he let this humiliation slide?<br/><br/>\"It means I won't let you both get away with treating me like this! You're not special just<br/><br/>because you made it to the 12th step!\"<br/><br/>He spat, frustration evident in every word.<br/><br/>Feng Yun shrugged, still maintaining that casual smile.<br/><br/>\"Haha! I never claimed to be special for reaching the 12th step. Honestly, I'd be embarrassed<br/><br/>if this was all I could manage.\"<br/><br/>This made Tianlong Yu even angrier. Although he was the first one to say that, in reality he<br/><br/>was indeed thinking he was special for reaching the 12th step.<br/><br/>But now Feng Yun said that it was embarrassing to be on the 12th step which was his limit and<br/><br/>made him angrier.\t\t\t\t\t\t</div>", "images": {}, "success": true}