{"id": 76, "url": "https://www.novelhall.com/my-brothers-the-protagonist-good-thing-i-awakened-my-system-33973/14946622.html", "title": "Chapter 77: Battle For The Top Position", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 77: Battle For The Top Position</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 77: Battle For The Top Position•<br/><br/>\"You...!\"<br/><br/>Tianlong Yu sputtered, his fists trembling as he tried to find the right words.<br/><br/>He was a genius of the Tianlong Clan and a disciple of Spirit Wind Palace, and he had never experienced such humiliation in his entire life.<br/><br/>Even those older and stronger than him treated him with great respect.<br/><br/>After all, who would want to provoke a junior who was destined to surpass them one day?<br/><br/>Even with the Tianlong Clan as his only backing, who on earth would dare to disrespect him? Now that someone was doing it, he didn't even know what to say.<br/><br/>All he could think was threatening them with his background and that's it. This works most of the time but now, his words were taken for granted.<br/><br/>\"Hah! Do you seriously think that you can climb up to the 13th step?\"<br/><br/>Tianlong Yu said after calming down for a bit.<br/><br/>No matter what Feng Yun said, he didn't believe that they would be able to surpass him. Sёarᴄh the novel(F~)ire.net website on Google to access chapters of novels early and in the highest quality.<br/><br/>Although he wasn't very happy that two of them were equal to him.<br/><br/>Feng Yun chuckled softly, shaking his head at Tianlong Yu's desperate attempts to maintain some semblance of superiority.<br/><br/>\"If that's what you need to tell yourself to feel better, then by all means, hold onto that thought.\"<br/><br/>Feng Yun's words were calm, but they cut deep, a casual dismissal that only stoked Tianlong Yu's rage.<br/><br/>Before Tianlong Yu could retort, Feng Mei calmly interjected, her voice as cool as a mountain breeze.<br/><br/>\"Feng Yun, there's no need to waste time here.\"<br/><br/>She continued.<br/><br/>\"We have farther to go.\"<br/><br/>Feng Mei's goal here was to at least reach the 17th step in order to show everyone that Ling Meiyu isn't someone special.<br/><br/>Tianlong Yu clenched his fists even tighter, his knuckles white.<br/><br/>The simplicity of her words hit Tianlong Yu harder than any insult could.<br/><br/>There was no mockery in her tone, no malice-just a calm dismissal that made him feel insignificant as if he were not worth her time or energy.<br/><br/>\"Don't act so high and mighty!\"<br/><br/>Tianlong Yu growled, his voice rising. He couldn't think that some no-name was thinking that they could reach the 13th step when he couldn't even after giving his best.<br/><br/>Moreover, he couldn't hold the fact that he was getting ignored like a nobody. When has he ever experienced such a thing?<br/><br/>\"You think you'll get any higher? The 12th step is already near the peak for most of us. You're not going any further!\"<br/><br/>Tianlong Yu spat, his voice tinged with anger and frustration.<br/><br/>More than that, it was the refusal to believe that they were better than him.<br/><br/>Feng Mei barely glanced his way, her expression unbothered.<br/><br/>\"If that's what you believe.\"<br/><br/>She replied coolly.<br/><br/>Feng Yun chuckled beside her, turning to face Tianlong Yu.<br/><br/>\"We'll see about that. Bye!\"<br/><br/>Without waiting for a response, they continued their ascent, leaving him behind, fuming in silence.<br/><br/>Even so, he didn't think that they would succeed.<br/><br/>\"Hmph! You'll regret this!\"<br/><br/>Tianlong Yu spat with hatred, glaring at them, hoping to see them fail.<br/><br/>With that, Feng Yun and Feng Mei began to ascend the steps once more, their movements graceful and unhurried.<br/><br/>To everyone's surprise, they took a step that seemed effortless, as if the pressure that weighed so heavily on the others didn't even exist for them.<br/><br/>Tianlong Yu watched them in disbelief, his anger now mixed with frustration and helplessness.<br/><br/>(STOP! STOP THIS!)<br/><br/>Tianlong Yu wailed in his heart wishing that two of them would somehow fall down and then descend back to the 12th step.<br/><br/>But no matter how much he wished for it, it never happened.<br/><br/>His body felt heavy, drained of energy, and all he could do was watch as the two figures grew smaller, moving further and further beyond his reach.<br/><br/>His pride as a member of the Tianlong Clan and as a disciple of Spirit Wind Palace was crumbling in front of these two who treated him like air.<br/><br/>He clenched his fists tightly, but no matter how much anger he summoned, he couldn't move an inch further up the pillar.<br/><br/>\"Dammit! Dammit!\"<br/><br/>*****<br/><br/>On the spectator side, people of various clans were surprised when Feng Mei and Feng Yun reached the 12th step.<br/><br/>Previously, they thought that they had underestimated Feng Clan but it turns out they hadn't underestimated Feng Clan but severely underestimated them.<br/><br/>All of their participants were still progressing further in the Pillar Of Aptitude with the worst being in the 10th step.<br/><br/>That was better than most clans whose best wasn't even at the 9th step much less the 10th<br/><br/>step.<br/><br/>And what shook them the most was when Feng Mei and Feng Yun overtook Tianlong Yu and got second and third positions.<br/><br/>They were all jealous of the Feng Clan, wishing they had descendants like them.<br/><br/>With the talent the Feng Clan's participants had shown, those participants could easily join the Top Sect and have a bright future ahead of them.<br/><br/>On the other hand, Grand Elder Ren Daoyu watched Feng Clan's performance with a frown on<br/><br/>his face.<br/><br/>His eyes gleamed with a cold light as he watched them, the killing intent in his heart growing more palpable with each step they took.<br/><br/>\"They're too dangerous!\"<br/><br/>Ren Daoyu muttered under his breath, his fingers tightening into fists.<br/><br/>\"If they're allowed to grow, the Feng Clan will become very powerful.\"<br/><br/>Judging by the Aptitude of them, it was easy to draw that conclusion.<br/><br/>Those who reached the 10th step were destined to achieve at least the Grand Qi Condensation Realm, while those on the 12th step were expected to advance to the Three Element Divine<br/><br/>Realm within their lifetime.<br/><br/>So how could Grand Elder Ren Daoyu expect to let them off without doing anything?<br/><br/>He was already calculating his next move.<br/><br/>He was self-aware that eliminating Feng Chen was beyond his abilities but that wasn't the<br/><br/>case for the younger generation of Feng Clan who were still weak.<br/><br/>As long as he gets an opportunity to be alone with any of the Feng participants, he vows to kill<br/><br/>them without mercy.<br/><br/>Feng Chen glanced at Ren Daoyu and knew about him, glaring at him occasionally. He was also well aware of the crooked idea that was brewing in his head.<br/><br/>The Feng Clan's participants especially Feng Mei and Feng Yun had shown off too much and it was sure that the enemies would definitely think of eliminating them before they grew up.<br/><br/>Feng Chen was certain about it because he could sense killing intent from Ren Daoyu, although he expertly hid them before anyone else could sense it.<br/><br/>(This old man who lived more than he should must be cooking something evil.)<br/><br/>Feng Chen wasn't too concerned; his senses were far sharper than theirs, and he would definitely be alerted if anyone made a move against his clan.<br/><br/>He would definitely know the moment someone makes a move on Feng Clan. So, he wasn't<br/><br/>scared of people attacking them.<br/><br/>Even if a bunch of Three Elements Divine Realm experts attacked them simultaneously, he was confident in defeating them with much effort.<br/><br/>Rather than dwelling on that, Feng Chen focused on watching the competition.<br/><br/>His brother was no longer hiding his strength and was doing his protagonist's show-off<br/><br/>moment.<br/><br/>So, how could he as his brother miss it?<br/><br/>He definitely has to watch it!<br/><br/>Right now, it was sure that Feng Yun was competing with Yuan Ziyan. Although he didn't<br/><br/>know the actual conversation between the two, one could easily guess that.<br/><br/>Yuan Ziyan was a disciple from the Mystic Flame Sect and judging by her attitude, Feng Chen was sure that his brother and Yuan Ziyan might be competing.<br/><br/>Even if that wasn't the case, right now, Feng Yun and Feng Mei were the only ones who could<br/><br/>compete with Yuan Ziyan who was at the Top.<br/><br/>Feng Chen wasn't very worried about his brother.<br/><br/>With his talent, he was sure that getting to the 17th step wouldn't be a problem though he<br/><br/>didn't know whether he could reach the Top like him.<br/><br/>But with his talent which is of greatest rank, he thought that he should be able to. Otherwise, his heavenly pride talent wouldn't be worthy of being the highest-ranked talent. Therefore, he wasn't very worried about Feng Yun or Feng Mei's performance. However, there was one person that he was worried about and that was Feng Jianhong.<br/><br/>Feng Jianhong was still at the 10th step while Feng Xiaoyu and Feng Liang had already<br/><br/>climbed to the 11th step.<br/><br/>He knew that with his talent, reaching the 10th step was already his limit. People with the same talent as him were stuck at the 6th and 7th steps while those who had<br/><br/>special physiques were able to get to the 8th step.<br/><br/>So, for Feng Jinahong, who has the same talent as them but without a special physique, to get<br/><br/>to the 10th step was already impressive.<br/><br/>However, Feng Chen believed in Feng Jianhong and hoped that he would persist and try<br/><br/>climbing further.\t\t\t\t\t\t</div>", "images": {}, "success": true}