{"id": 77, "url": "https://www.novelhall.com/my-brothers-the-protagonist-good-thing-i-awakened-my-system-33973/14946623.html", "title": "Chapter 78: Misunderstanding Again?", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 78: Misunderstanding Again?</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 78: Misunderstanding Again?Half an hour has already passed since the start of the challenge and many have already given up on climbing further.<br/><br/>Some were happy and satisfied with their position while some were not so much.<br/><br/>Yuan Ling and Hu Lian also gave up after they had reached the 12th step.<br/><br/>Tianlong Yu's expression became darker and gloomy when two additional people reached the same step as him.<br/><br/>Now he was barely in the Top 6, not even the Top 3.<br/><br/>\"Hah... Hah...\"<br/><br/>Feng Jianhong gasped for breath under the immense pressure, struggling just to keep his head up.<br/><br/>His body was on the verge of giving up, yet his will remain unshaken, driving him to push forward and keep climbing.<br/><br/>Each moment felt like a battle against his own body.<br/><br/>(He's reached his limit...)<br/><br/>Feng Chen's heart sank slightly, but he forced himself to remain calm.<br/><br/>\"Come on, Jianhong,\" he muttered under his breath.<br/><br/>\"Just one more push!\"<br/><br/>As if hearing his thoughts, Feng Jianhong gritted his teeth and forced himself to his feet.<br/><br/>His legs shook, but there was a fire of determination in his eyes.<br/><br/>Slowly, he took another step forward, his body protesting with every movement.<br/><br/>Feng Chen's lips curved into a small smile. It wasn't about how far he could go-it was about the will to keep pushing forward.<br/><br/>And in that moment, Feng Jianhong's perseverance shone through.<br/><br/>(Jianhong, this brat did this!)<br/><br/>Feng Chen wasn't the only one who was impressed by Feng Jianhong's feat.<br/><br/>\"Impressive child! I wonder how Clan Leader Feng Chen trained him?\"<br/><br/>Yuan Hao remarked, clearly impressed by the perseverance Feng Jianhong had displayed.<br/><br/>Not only he, but others who watched Feng Jianhong wanted to know as well.<br/><br/>Through the Heavenly Projection Crystal, everyone could see that Feng Jianhong was struggling on the 10th step.<br/><br/>Despite that, he still attempted to climb further and even managed to do so. Searᴄh the novel(F~)ire.net website on Google to access chapters of novels early and in the highest quality.<br/><br/>This earned recognition from many of them.<br/><br/>What neither the crowd nor Feng Chen expected was that, despite showing clear signs of exhaustion, Feng Jianhong still had the courage to challenge the 12th step.<br/><br/>Feng Liang and Feng Xiaoyu who were also challenging the 12th step didn't say anything to that.<br/><br/>Even if they felt and saw Feng Jianhong was at his limit, it would be disrespectful for them to tell Feng Jianhong to give up.<br/><br/>Cultivation in itself was going against heaven, so how could they tell Feng Jianhong to give up when the person himself didn't?<br/><br/>As Feng Jianhong struggled to ascend, his body trembled with the weight of the Pillar of Aptitude's crushing pressure.<br/><br/>Every step felt like his last, but his determination was unyielding. The sweat dripped down his brow, his breath ragged, yet the fire in his eyes never wavered.<br/><br/>Yuan Hao's admiration grew as he watched Feng Jianhong, the young cultivator pushing himself against the odds.<br/><br/>He couldn't help but nod approvingly.<br/><br/>This is what a man should be like! He thought.<br/><br/>Even Grand Elder Ren Daoyu, with his scheming thoughts toward the Feng Clan, could not help but acknowledge the boy's fierce will, though it did nothing to ease the killing intent brewing in his heart.<br/><br/>In the Pillar Of Aptitude, the top was still Yuan Ziyan who has reached an astonishing 15th step.<br/><br/>\"Hah... Hah...\"<br/><br/>Even for Yuan Ziyan, the 15th step seemed to be her limit. She was breathing heavily and sweating profusely.<br/><br/>Previously, when she joined the Mystic Flame Sect, she was still at the 15th step, and even after her cultivation had increased several times, the results were the same.<br/><br/>Just goes to show how cultivation was irrelevant in Pillar Of Aptitude.<br/><br/>She then cast her eye below where she could see Feng Yun.<br/><br/>She was surprised as she had never expected that Feng Yun would be able to climb this many steps.<br/><br/>The challenge she issued was also because of this as she believed that Feng Yun would never be able to take her on, much less Ling Meiyu.<br/><br/>But as he climbed higher and higher, her expression began to change.<br/><br/>\"14th step and he is still climbing!\"<br/><br/>He was only one step behind her.<br/><br/>The Spectator also watched the whole thing in disbelief. It was one thing to surpass Tianlong Yu and another to reach the 15th step.<br/><br/>Why?<br/><br/>Because reaching the 12th guarantees that a person will advance to the Three Elements Divine Realm then the 15th step guarantees one to be able to reach the Nascent Soul Realm.<br/><br/>Nascent Soul Realm!<br/><br/>That was the highest cultivation anyone has on Azure Sky Empire.<br/><br/>Many current Nascent Soul Realm cultivators were those who were able to reach the 15th step in the Pillar Of Aptitude.<br/><br/>This is the reason why Yuan ZIyan was treated so well by the Mystic Flame Sect and Yuan Hao. Yuan Ziyan has the potential to become Nascent Soul Realm. This could change the power structure of any sect or clan.<br/><br/>If Yuan ZIyan managed to become Nascent Soul Realm then Mystic Flame Sect would truly become the dominant force without any equal.<br/><br/>Moreover, they also have Ling Meiyu who is more talented than Yuan Ziyan, and it seems only time before they totally dominate the Azure Sky Empire.<br/><br/>Of course, the status of the Yuan Clan would also increase and become on par with the Top<br/><br/>Clan of Capital.<br/><br/>So, one could see that reaching the 15th step was considered totally different from the 10th or<br/><br/>12th step.<br/><br/>\"What? How is he able to climb so high? Wasn't he called 'Trash'?\"<br/><br/>\"What 'Trash'? He should be a peerless genius who might even climb up to the 15th step. Ah, I<br/><br/>am so jealous of the Feng Clan right now!\"<br/><br/>\"Looks like the competition will be between the three of them.\"<br/><br/>\"They are making our geniuses look bad!\"<br/><br/>...<br/><br/>And finally, Feng Yun stood before Yuan Ziyan!<br/><br/>\"Oh! We meet again!\"<br/><br/>Feng Yun casually said with a grin.<br/><br/>He thought about Yuan Ziyan's earlier words and couldn't help but tease.<br/><br/>That's why one should be careful about what they say.<br/><br/>Don't just assume and jump to conclusions or else you might regret it.<br/><br/>Yuan Ziyan had a dumbfounded expression when Feng Yun reached the 15th step.<br/><br/>And then she heard his words and she could tell that he was making fun of her.<br/><br/>After all, she was the one who had spoken those words and challenged him, believing that<br/><br/>Feng Yun wouldn't be able to reach the 15th step.<br/><br/>\"Hmph! Feng Yun, don't be so happy!\"<br/><br/>Yuan Ziyan remarked, trying to hide her embarrassment.<br/><br/>\"Although, I admit that you are better than I thought and better than me you will never be as<br/><br/>good as Ling Meiyu.\"<br/><br/>Yuan Ziyan has no problem admitting that she was wrong or that someone was better than her even if that person was to be her enemy.<br/><br/>She was struggling under the pressure of the 15th step while she could see that Feng Yun<br/><br/>wasn't.<br/><br/>This showed Yuan Ziyan that she wasn't as good as Feng Yun.<br/><br/>However, even if that was the case, she adamantly believed that Feng Yun wasn't Ling<br/><br/>Meiyu's match.<br/><br/>From the audience, gasps of amazement rippled through the various clans.<br/><br/>Many couldn't believe their eyes as Feng Yun and Feng Mei ascended beyond what most<br/><br/>participants could even dream of.<br/><br/>Many of them would already consider having a genius who could reach the 10th step a<br/><br/>blessing much less the 15th step.<br/><br/>Now, Feng Clan has two people who have entered the 15th step.<br/><br/>They couldn't help but curse heaven for unfairness.<br/><br/>\"Does Miss Yuan think that Brother Feng Yun would stay at the 15th step only?\"<br/><br/>Feng Mei said after hearing Yuan Zliyan's words.<br/><br/>She didn't know what really transpired between Feng Yun and her but judging her words, she<br/><br/>knew that she was looking down on Feng Yun.<br/><br/>Yuan Ziyan was surprised when she heard those words.<br/><br/>Not because of the content but because she had only noticed that there was someone other<br/><br/>than Feng Yun who had reached the 15th step.<br/><br/>Moreover, they were holding each other's hands!<br/><br/>Yuan Ziyan's eyes widened in disbelief as she took in the sight before her.<br/><br/>\"You...!\"<br/><br/>Yuan Ziyan sputtered, pointing an accusatory finger at Feng Yun.<br/><br/>\"What do you think you're doing? Cheating on Ling Meiyu with this girl!\"<br/><br/>Feng Yun's brow furrowed in confusion, and he was dumbfounded.<br/><br/>\"What are you talking about? I've already divorced Ling Meiyu. She was the one who broke off<br/><br/>our engagement first!\"<br/><br/>Feng Yun continued. \"Miss Yuan, I suggest you be mindful of your words. They could tarnish my reputation.\"<br/><br/>Feng Yun didn't know just what was going on in Yuan Ziyan's mind. First saying that he was<br/><br/>trying to win Ling Meiyu back and now this.<br/><br/>\"Your reputation, my A**! How dare you think about winning Ling Meiyu back but going after flirting with another woman.\"<br/><br/>Yuan Ziyan said, not listening to Feng Yun's words at all.<br/><br/>She was convinced that Feng Yun had feelings for Ling Meiyu, and to her, his actions were<br/><br/>nothing short of betrayal. It was like professing love while indulging in affairs with others. If this wasn't cheating then what was?\t\t\t\t\t\t</div>", "images": {}, "success": true}