{"id": 70, "url": "https://www.novelhall.com/my-brothers-the-protagonist-good-thing-i-awakened-my-system-33973/14946616.html", "title": "Chapter 71: Ling Meiyu'S Talent!", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 71: Ling Meiyu'S Talent!</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 71: Ling Meiyu's Talent!Feng Yun stood at the front of the Feng Clan's younger generation, his eyes fixed on the towering Pillar of Aptitude.<br/><br/>His heartbeat quickened with excitement, but his expression remained calm and focused.<br/><br/>Beside him, Feng Xiaoyu, Feng Mei, Feng Liang, and Feng Jianhong each bore expressions of determination.<br/><br/>Feng Yun glanced at his fellow clan members and smirked slightly, feeling the energy and anticipation in the air.<br/><br/>\"This is going to be interesting!\"<br/><br/>Feng Yun said with a quiet chuckle.<br/><br/>\"Haha... Indeed! This will be a good chance to show those clans what we can do!\"<br/><br/>Feng Liang said. He was more eager than anyone else to prove himself since he came to this Tianlong Mansion.<br/><br/>From being mocked and looked down by crowds outside to the clans inside. He has been powerless most of the time.<br/><br/>But now, it was time for him to do something and make them regret mocking their Feng Clan. Feng Jianhong, standing next to him, nodded.<br/><br/>As the group continued to converse, the other participants around them also murmured in excitement.<br/><br/>However, Unbeknownst to Feng Yun and others, Yuan Ziyan was secretly watching them since they had come to Pillar Of Aptitude.<br/><br/>From their conversation, she still couldn't figure out who the ex-fiancee of Ling Meiyu was.<br/><br/>She thought that she might be able to identify him or that someone would call him but neither happened.<br/><br/>\"Hmph!\"<br/><br/>In any case, she was determined more than ever to let him know his place and make him realize the vast gap between him and her junior sister.<br/><br/>\"Did you hear?\"<br/><br/>Yuan Ziyan intentionally raised her voice loud enough for Feng Yun to hear her.<br/><br/>Of course, she pretended to be talking with Hu Lian and Yuan Ling.<br/><br/>\"My junior sister, Ling Meiyu, reached the seventeenth step of the Pillar of Aptitude during her selection as a disciple of the Mystic Flame Sect. No one in our sect's history has ever climbed higher.\"<br/><br/>Her words sent ripples of shock through the crowd.<br/><br/>\"Seventeen steps?\"<br/><br/>Someone exclaimed, shocked by the feat. He was someone who had climbed the Pillar Of Aptitude before and knew just how hard it was.<br/><br/>So, it came as a big surprise to know that someone could climb to the 17th step.<br/><br/>\"That's... incredible.\"<br/><br/>\"Awesome! Worthy to be known as the No. 1 genius of Azure Sky Empire. Her future<br/><br/>achievement would certainly be more extraordinary.\"<br/><br/>\"Tsk! Tsk! We are called geniuses by our clans but compared to Peerless genius like Miss Ling, we are nothing.\"<br/><br/>The crowd began to discuss this matter and this included Feng Yun and the others.<br/><br/>(Ling Meiyu!)<br/><br/>Feng Yun's eyes narrowed slightly and turned towards Yuan Ziyan.<br/><br/>Of course, as the one who will be challenging Ling Meiyu in three years, he was naturally interested in Yuan Ziyan's words as soon as he heard the name Ling Meiyu.<br/><br/>\"Hmph! So what? Does she think that only Ling Meiyu could climb to the 17th step?\"<br/><br/>Feng Mei's expression darkened upon hearing Yuan Ziyan's words, her voice laced with anger. It was rare for her to lose her composure, but the name Ling Meiyu was enough to ignite her fury.<br/><br/>Whenever she heard the name Ling Meiyu, it always reminded her of Feng Yun's humiliation at the hands of that woman. Her disdain became unmistakable, surfacing clearly for all to see. She also became more determined to climb the Pillar of Aptitude and reach even 17 steps and show everyone that Ling Meiyu is no one special.<br/><br/>\"Naturally! We cannot lose to that 'b*tch'!\"<br/><br/>Feng Jianhong added with a curse. He could also not help but curse when he saw people complimenting Ling Meiyu.<br/><br/>Being peerless is okay but how could she be so arrogant as to disrespect elders? He could never forgive her for what she did on Feng Chen's birthday.<br/><br/>A day of celebration turned into mockery due to her.<br/><br/>\"However, remember to always keep your head cool. Climbing Pillar Of Aptitude isn't something easy and keep in mind that our performance will affect the ranking of our clan.\"<br/><br/>Feng Liang warned. Although determined, one also needed to keep a cool head in order to avoid making mistakes.<br/><br/>Others also nodded to Liang's words. After all, it was true that their state of mind was affected after hearing Ling Meiyu's name.<br/><br/>Feng Yun then glared at Yuan Ziyan with disdain. From the way she addressed Ling Meiyu, anyone could tell that Yuan Ziyan was a disciple of the Mystic Flame Sect.<br/><br/>Moreover, from the relationship between the two, Feng Yun could easily guess that Yuan Ziyan must be very close to Ling Meiyu.<br/><br/>And that she intentionally talked about it so that he could hear it.<br/><br/>(Hmph! Do you think Ling Meiyu is such a peerless genius that I don't deserve her?)<br/><br/>\"I wonder if anyone here can match that,\"<br/><br/>One of the participants mused.<br/><br/>\"It's no small feat to go beyond ten steps, let alone seventeen.\"<br/><br/>\"I guess that it should be the highest in the entire Azure Sky Empire as well!\"<br/><br/>As the topic of Ling Meiyu having climbed 17th step began discussing, people also wondered whether she was the one with the highest stair climbed on Pillar Of Aptitude.<br/><br/>Of course, they didn't have any idea and soon turned to Yuan Ziyan for an answer. Since she<br/><br/>was a disciple of Mystic Flame Sect, they knew that she knew more than them.<br/><br/>\"Miss Yuan, is there anyone who has climbed higher than 17 steps on the Pillar Of Aptitude?\"<br/><br/>One of them asked.<br/><br/>\"Yes, there is one indeed!\"<br/><br/>Yuan Ziyan replied.<br/><br/>\"Who?\"<br/><br/>The participants asked simultaneously. They thought that Miss Ling was already an unreachable existence but is there someone who even surpassed her?<br/><br/>They couldn't believe it!<br/><br/>\"That I don't know!\" Yuan Ziyan answered, which confused many of them.<br/><br/>How can one know whether one has climbed higher or not but doesn't know who it was?<br/><br/>Seeing the confusion, Yuan Ziyan quickly explained.<br/><br/>\"As you know each participant who will be climbing will have their names written and shown on that board. That board will keep a record of the people according to the ranking\"<br/><br/>Yuan Ziyan continued.<br/><br/>\"In the capital, someone has climbed to the 20th step but didn't leave any name. So, in the capitals Pillar of Aptitude, there is a blank in the top name but the number of steps recorded<br/><br/>was 20.\"<br/><br/>Yuan Ziyan also thought about it. She also couldn't believe that when she heard that the<br/><br/>highest that someone has climbed was 20th step and that no one knows who he/she is.<br/><br/>However, it was undeniable that someone has indeed climbed the 20th step as there is a record left in the place. seaʀᴄh thё nôvelFire.net website on Google to access chapters of novels early and in the highest quality.<br/><br/>\"Many believe this might be some kind of mistake while others say that it isn't. However, no one has seen the person who climbed to the 20th step. So, most people in the capital just<br/><br/>ignore the Top ranking.\"<br/><br/>\"But as far as those who are known for their achievements,\" she continued, her voice carrying<br/><br/>an air of certainty.<br/><br/>\"The only one who has ever truly proven her talent and climbed as high as the 17th step is, without a doubt, my junior sister, Ling Meiyu.\"\t\t\t\t\t\t</div>", "images": {}, "success": true}