{"id": 79, "url": "https://www.novelhall.com/my-brothers-the-protagonist-good-thing-i-awakened-my-system-33973/14946625.html", "title": "Chapter 80: Feng Mei'S Path To The 17Th Step", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 80: Feng Mei'S Path To The 17Th Step</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 80: Feng Mei's Path To The 17th StepDespite Feng Mei's words, Feng Yun couldn't shake his worry.<br/><br/>He could clearly see her struggling, pushing herself to the very edge of her endurance.<br/><br/>If she kept going, there was no telling what might happen.<br/><br/>Still, he couldn't tell her to give up, just as he hadn't with Feng Jianhong. It wasn't his place to interfere unless her life was truly at risk.<br/><br/>Feng Mei struggled as she stood on the 16th step, feeling immense pressure weighing down on her.<br/><br/>Feng Mei was fully aware of her limits, but giving up wasn't an option.<br/><br/>Gritting her teeth, she locked her gaze on the 17th step- the very step that Yun's ex-fiancée had once reached.<br/><br/>Today, she was determined to make it there, too!<br/><br/>She still remembered it as if it were yesterday-when Ling Meiyu stormed into the Feng Estate to break off her engagement with Brother Yun.<br/><br/>At the time, anger surged through her, but it wasn't her place to interfere.<br/><br/>She had been just a weak Foundation Establishment cultivator, powerless to do anything even if she had wanted to.<br/><br/>Now, with a chance to knock Ling Meiyu off her high horse, she couldn't help but feel determined to take it.<br/><br/>Even if it was just vanity, even if it was for her own satisfaction, she felt that she needed to do this.<br/><br/>\"You don't have to push it, Mei'er.\"<br/><br/>Feng Yun said gently.<br/><br/>Although he didn't want to interfere, it was clear that Feng Mei was pushing herself to go further.<br/><br/>Even remaining on the 16th step was a challenge for Feng Mei, and Feng Yun wished for her to reconsider her attempt to reach the 17th step. Sёarch* The ηovelFire.ηet website on Google to access chapters of novels early and in the highest quality.<br/><br/>Feng Mei shook her head.<br/><br/>\"I want to try. I know it's hard, but I can do it.\"<br/><br/>Her voice was strained, but her eyes were firm with resolve.<br/><br/>Feng Yun sighed, but he couldn't deny her spirit.<br/><br/>\"Alright,\" he said with a soft smile.<br/><br/>\"But if it's too much, don't hesitate to stop.\"<br/><br/>Feng Mei nodded.<br/><br/>The crowd's murmurs intensified, filled with anticipation and disbelief. No one had expected the Feng Clan participants to reach such heights.<br/><br/>And they found that two of them were not stopping there either.<br/><br/>The onlookers were on the edge of their seats, eyes glued to the pair.<br/><br/>\"They're doing it... they're actually going for the 17th step!\"<br/><br/>\"Are they really going for the 17th step?\"<br/><br/>\"Oh My God! I can't believe it!\"<br/><br/>...<br/><br/>Tianlong Yu's humiliation deepened as the crowd shifted their focus away from him.<br/><br/>He had once been the center of attention, hailed as one of the strongest.<br/><br/>But now, he was being overshadowed by the very people he had mocked.<br/><br/>(And why are people still coming?)<br/><br/>Tianlong Yu complained in his heart when Feng Xiaoyu, Feng Liang, and finally Feng Jianhong arrived at the 12th step.<br/><br/>He had once believed he was the most talented among them, yet now he found himself on the same step as five others, while three of them clearly outshone him.<br/><br/>On the other hand, Yuan Ling and Hu Lian weren't interested in being jealous of others reaching the same step as them.<br/><br/>Instead, they looked up to where Feng Mei and Feng Yun were and were curious to see whether they would make it to the 17th step.<br/><br/>Yuan Ziyan was the same, and looked at the two who seemed to be on the verge of reaching the place that she thought was only possible for Ling Meiyu.<br/><br/>She thought that 16th step was their limit but it didn't seem that way especially for Feng Yun who seemed to not struggle at all.<br/><br/>Seeing him like this, Yuan Ziyan felt that he would be able to reach the 17th step.<br/><br/>\"If he can reach it, then I wouldn't hesitate to say a few good words to the junior sister!\"<br/><br/>Yuan Ziyan muttered still with her own misunderstandings.<br/><br/>On the 16th step, Feng Mei took a deep breath, steeling herself as she prepared to ascend to the 17th step.<br/><br/>Feng Mei's legs trembled as she tried to move closer to the 17th step.<br/><br/>The weight of the pressure was crushing, and the energy in the air was suffocating, but her resolve remained unshaken.<br/><br/>Each movement of her body felt like an eternity, and the pain coursing through her body intensified with every second.<br/><br/>Yet, her eyes stayed locked on the 17th step, a destination that she must reach.<br/><br/>The pressure intensified, enveloping her like a vice, squeezing the air from her lungs.<br/><br/>As she inched closer to the 17th step, a wave of force slammed into her.<br/><br/>It was as if an invisible giant had pressed down on her shoulders, threatening to crush her<br/><br/>under its weight.<br/><br/>She staggered slightly, and the ground beneath her felt unsteady.<br/><br/>Every muscle in her body screamed in protest, and beads of sweat formed on her brow.<br/><br/>She felt as though she was being tested beyond her limits, and for a moment, doubt crept into<br/><br/>her mind.<br/><br/>(Is it really impossible?)<br/><br/>Feng Mei sensed that, despite the 17th step being so tantalizingly close, reaching it felt far<br/><br/>beyond her capabilities.<br/><br/>Doubts crept into her mind as her body neared its breaking point.<br/><br/>Feng Mei gritted her teeth, fighting against the overwhelming pressure that threatened to<br/><br/>drive her to her knees.<br/><br/>\"I must do it!\"<br/><br/>It wasn't a matter of whether she could or not, but that she had to.<br/><br/>She refused to allow her mind to succumb before her body did.<br/><br/>She continued persisting although she didn't even make 1 millimeter close to the 17th step.<br/><br/>Just as she steadied herself, she felt her knees buckle under the immense pressure,<br/><br/>threatening to flatten her.<br/><br/>It seemed as though her body had truly given up and could no longer muster the strength to<br/><br/>even stand.<br/><br/>Panic flared within her, but she couldn't let it win.<br/><br/>With a fierce cry, she straightened, forcing her body to stand tall.<br/><br/>\"Hah... Hah...\"<br/><br/>She gasped for breath, as she mustered every strength just to avoid collapsing.<br/><br/>Feng Mei's entire body felt as though it was being crushed by an immense force as she stood<br/><br/>still.<br/><br/>Every muscle screamed in protest, and her bones felt as if they would shatter any moment under the overwhelming pressure.<br/><br/>Sweat poured down her face, mingling with the blood trickling from her nose and lips.<br/><br/>\"I won't stop... I can do it!\"<br/><br/>Feng Mei muttered, her breath coming in ragged gasps.<br/><br/>Her legs trembled violently, her knees nearly buckling as she struggled to take another step.<br/><br/>Blood splattered onto the pristine stone beneath her, but she barely noticed. All that mattered was reaching the 17th step.<br/><br/>It felt as though the heavens themselves were crashing down on her. Her vision blurred, and for a terrifying moment, she thought her legs would give out entirely.<br/><br/>Feng Yun watched in horror as Feng Mei fought against the crushing pressure of the 16th step.<br/><br/>Her determination was palpable, but so was the strain on her body. Each ragged breath she took echoed in his mind, amplifying his concern.<br/><br/>After seeing the blood, he could no longer stay silent. Even if it disheartened her, he knew he<br/><br/>had to intervene and stop her.<br/><br/>\"No, Mei'er!\"<br/><br/>He called out, his voice laced with urgency.<br/><br/>\"You need to stop!\"<br/><br/>But she didn't stop.<br/><br/>At that moment, it felt as though she could neither hear nor see anything except for the steps<br/><br/>ahead of her.<br/><br/>Feng Yun's words fell on deaf ears as she focused all her energy on reaching the 17th step.<br/><br/>Feng Mei's breathing grew shallower, her chest heaving as blood seeped from her mouth,<br/><br/>staining her clothes.<br/><br/>She could feel her body breaking down under the immense strain, her strength fading with<br/><br/>every second.<br/><br/>The pressure on the 17th step was far beyond anything she had experienced.<br/><br/>The crowd, who had been buzzing with anticipation, suddenly gasped in horror.<br/><br/>\"I guess this is impossible after all!\"<br/><br/>\"What did I tell you? Other than Miss Ling Meiyu, I don't believe anyone could reach the 17th<br/><br/>step.\"<br/><br/>\"At least, she tried!\"<br/><br/>...<br/><br/>Some of them gloated about her failure and others felt disappointed. Looking at the state<br/><br/>Feng Mei was in, nobody believed that she could advance any further.<br/><br/>\"She's bleeding!\"<br/><br/>\"She's pushing herself too far!\"<br/><br/>Feng Zhenshan and Feng Zhilan said with worry.<br/><br/>Although they were proud that their Feng Clan youth had such great resilience, seeing Feng<br/><br/>Mei's blood, they couldn't help but feel that she was overdoing it.<br/><br/>Feng Chen was also worried.<br/><br/>Although he was certain that even if she went through much worse, he could still save her<br/><br/>with a pill but it didn't mean that he didn't get worried when she got injured.<br/><br/>Even if they are worried, what could they do?<br/><br/>They just hoped that she would be fine and that she could quickly successfully finish the<br/><br/>ascend.<br/><br/>Even if she didn't make it to the 17th step, they believed that reaching the 16th step was already a remarkable achievement.\t\t\t\t\t\t</div>", "images": {}, "success": true}