{"id": 78, "url": "https://www.novelhall.com/my-brothers-the-protagonist-good-thing-i-awakened-my-system-33973/14946624.html", "title": "Chapter 79: 16Th Step!", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 79: 16Th Step!</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 79: 16th Step!Yuan Ziyan was still being a dululu!<br/><br/>Based on her own assumption and misunderstanding, she made another misunderstanding that Feng Yun was not a very loyal person.<br/><br/>Because if she wasn't a delusional person then after seeing Feng Yun and Feng Mei holding hands together, she would have thought that her previous assumption must be a misunderstanding.<br/><br/>But no!<br/><br/>She never thought that her previous assumptions were wrong and continued to have other assumptions.<br/><br/>Feng Yun stared at Yuan Ziyan, thoroughly bewildered by her accusations.<br/><br/>He realized that no matter what he said, Yuan Ziyan was interpreting things through her own lens.<br/><br/>\"Miss Yuan, please, don't project your misunderstanding onto others!\"<br/><br/>Feng Yun said.<br/><br/>But Yuan Ziyan obviously didn't believe that she was misunderstanding things.<br/><br/>Yuan Ziyan's eyes narrowed, her frustration bubbling over. \"Misunderstanding?\"<br/><br/>She repeated, her voice incredulous.<br/><br/>\"Don't patronize me, Feng Yun! I know what I see. You're just trying to weasel your way out of this!\"<br/><br/>Seeing Yuan Ziyan like this, Feng Yun didn't want to bother with her anymore.<br/><br/>Talking to Yuan Ziyan was like pouring water onto a stone-no matter how much he tried to explain, nothing would sink in.<br/><br/>\"I won't waste my time on you!\"<br/><br/>Feng Yun said after realizing that he would only be painted black by Yuan Ziyan no matter what he said.<br/><br/>\"Wait!\"<br/><br/>Yuan Ziyan called out again before Feng Yun could leave.<br/><br/>\"Feng Yun,\" she began, her voice calmer now.<br/><br/>\"I can see that you're more talented than I originally thought. I'll admit, I misjudged you. But listen, I could put in a few good words to junior sister Meiyu on your behalf. She respects my opinion. But you must stop acting like this-seeing other women so openly. Don't you know that doing this won't make Ling Meiyu jealous? It'll only make her despise you more.\"<br/><br/>Yuan Ziyan has certainly improved her impression of Feng Yun and also thought that he might make a good match for Ling Meiyu.<br/><br/>This was not based on the thinking that he was able to climb to the 15th step which is also one of the reasons.<br/><br/>But another was that, unlike other men, she found that Feng Yun was surprisingly mature and calm.<br/><br/>She was a bit self-aware about her character which more than one occurrence has made many yell at her.<br/><br/>So, for Feng Yun to still be this calm and try to explain to her, she knew that his personality was better than described by many disciples who went with Ling Meiyu to break off her engagement.<br/><br/>Although Yuan Ziyan was telling him that she would help him, this was nothing more than a nuisance.<br/><br/>Obviously, if her misunderstanding were to be true and she said those words, he might have been touched.<br/><br/>But not in this situation!<br/><br/>Feng Yun stared at her for a long moment, his expression unreadable.<br/><br/>He understood now-Yuan Ziyan had been driven by her assumptions about him, yes, but it was also her loyalty to Ling Meiyu that shaped her actions.<br/><br/>She wasn't just meddling for the sake of it; she believed she was protecting her junior sister, even if it was misguided.<br/><br/>(She is a good girl! Just an idiot!)<br/><br/>Feng Yun thought to himself. Despite Yuan Ziyan being the senior sister of Ling Meiyu, whom<br/><br/>he despised, he couldn't deny that she was a good person, albeit somewhat delusional.<br/><br/>Feng Yun sighed softly.<br/><br/>\"Yuan Ziyan,\" he said, his voice steady.<br/><br/>\"I don't need you to speak on my behalf to Ling Meiyu. I'm not trying to win her back, and I'm certainly not interested in playing games to make her jealous.\"<br/><br/>Yuan Ziyan blinked, clearly taken aback by his response.<br/><br/>\"You... don't want her back? Are you serious?\"<br/><br/>Yuan Ziyan still didn't believe that to be the case but still asked. After all, he has been denying this the whole time.<br/><br/>For the first time since the conversation began, Feng Yun felt like his words were getting through.<br/><br/>\"For the millionth time, yes I am not trying to get Ling Meiyu or anything.\"<br/><br/>\"...\"<br/><br/>Feng Yun saw that Yan Ziyan hadn't replied and was deeply thinking.<br/><br/>He didn't know what she was thinking but hoped that she understood the truth now.<br/><br/>\"Mei'er, sorry to keep you waiting!\"<br/><br/>Feng Yun apologized as he readied himself to climb to the 16th step.<br/><br/>Feng Mei shook her head, not minding Feng Yun making her wait.<br/><br/>Feng Yun just smiled and then proceeded to climb to the 16th step albeit a bit slowly.<br/><br/>Compared to other steps, he has taken quite a lot of time to climb to the 16th step. However, it was not because he was struggling under the pressure but due to Feng Mei. Although he wasn't struggling, this was not the same for Feng Mei who was soaked in her sweat and breathing heavily.<br/><br/>For Feng Mei, climbing the 16th step wasn't as easy as the other steps.<br/><br/>It took a lot of effort from her to finally be able to climb the 16th step. And standing on it felt like she was already at her limit.<br/><br/>However, she didn't want to stay in the 16th step and was determined to reach the 17th step.<br/><br/>The next one was the 17th step which was the highest and also the step that Ling Meiyu<br/><br/>climbed to.<br/><br/>But the onlookers were already going crazy since they had climbed to the 16th step.<br/><br/>\"No way! How is this possible?\"<br/><br/>\"Tell me that I am dreaming. How could they reach the 16th step? Are they cheating?\"<br/><br/>\"Dammit! Our clan's greatest genius was only able to climb to the 8th step and they are<br/><br/>literally double that.\"<br/><br/>\"They have reached the 16th step taking the first position.\"<br/><br/>It was an incredible achievement to take the first position but more than that reaching the 16th step was what took the limelight.<br/><br/>After all, every three years there are winners but rarely anyone gets higher than the 15th step much less the 16th step.<br/><br/>And in the history of the Azure Sky Empire, those who reached the 16th step could be counted<br/><br/>on one hand.<br/><br/>If not for Ling Meiyu, the 16th step might have been the highest that anyone was able to climb<br/><br/>to.<br/><br/>Many were shocked beyond their mind.<br/><br/>Even Grand Elder Ren Daoyu couldn't help but widen his eyes in surprise.<br/><br/>He couldn't believe that a clan like Feng Clan would be able to produce a descendant who<br/><br/>could climb to the 16th step.<br/><br/>Moreover, it was two, not one!<br/><br/>And his killing intent just increased. No matter what, he has decided that Feng Mei and Feng<br/><br/>Yun couldn't live.<br/><br/>Tianlong Qi beside him also didn't have a good expression almost like he has eaten sh*t.<br/><br/>Yuan Hao also couldn't believe his eyes.<br/><br/>Although he didn't like to praise his daughter because of her personality, he knew that she was one of the most talented people in the country.<br/><br/>Even the Mystic Flame Sect treated her like a precious gem. Had it not been for Ling Meiyu, she would have been destined to become the next sect leader.<br/><br/>However, Yuan Hao believed that if she took on that role, she would ultimately bring ruin to<br/><br/>the Mystic Flame Sect.<br/><br/>Now, two people have simultaneously surpassed her in terms of Aptitude.<br/><br/>Yuan Hao also felt sorry for the Mystic Flame Sect.<br/><br/>If not for their sour relationship, it was certain that they would have sent Grand Elders and<br/><br/>offered a lot of benefits to have them join.<br/><br/>With them and Ling Meiyu, it would have been certain that the Mystic Flame Sect could have dominated the Azure Sky Empire for hundreds of years.<br/><br/>Alas, with their relationship, it would already be great if Feng Clan and Mystic Flame Sect<br/><br/>didn't go on a full-scale war.<br/><br/>\"Do you think they will reach the 17th step?\"<br/><br/>\"Impossible! That is the record that is held by the number one genius. How could it be that<br/><br/>easy to reach?\"<br/><br/>\"What is impossible? Feng Yun and Feng Mei have already reached the 16th step. There is already a possibility that they might be able to reach the 17th step.\"<br/><br/>\"Could I be lucky to witness such a legendary moment?\"<br/><br/>-<br/><br/>Amidst all the chatter, Feng Chen watched Feng Yun and Feng Mei without much emotion.<br/><br/>He didn't have a flux of emotion because the result was as he expected. Sёarᴄh the NôᴠeFire.ηet website on Google to access chapters of novels early and in the highest quality.<br/><br/>He knew that with their talent, reaching that stage wasn't a fantasy, especially for his brother.<br/><br/>Although he wasn't sure about Feng Mei, with her talent, the 15th step might have been the limit just like Yuan Ziyan.<br/><br/>But she also has a special physique, although it is unawakened. But he also felt that reaching<br/><br/>the 17th step might be a little difficult for Feng Mei especially considering that cultivation has<br/><br/>never been her interest.<br/><br/>On the 16th step, Feng Mei felt like a giant pressing on her. She could tell that the pressure<br/><br/>here was at least 15 times greater than the 15th step.<br/><br/>\"Mei'er, are you okay?\"<br/><br/>Feng Yun asked worriedly.<br/><br/>Although he felt a bit of pressure, it still wasn't enough for him to even slow him down.<br/><br/>If not for Feng Mei, he might have already reached the 17th step.<br/><br/>\"I am okay, brother Yun! Let's continue!\"\t\t\t\t\t\t</div>", "images": {}, "success": true}