{"id": 87, "url": "https://www.novelhall.com/my-brothers-the-protagonist-good-thing-i-awakened-my-system-33973/14964174.html", "title": "Chapter 88 Auction Begins", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 88 Auction Begins</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 88  Auction Begins The Azure Sky Chamber of Commerce was an enormous, majestic building that dominated the skyline of Qingyun City. As the Feng Clan approached, they could see crowds of people gathered outside, all eager to get in. The entrance was guarded by rows of elite guards, and only those with invitations or sufficient wealth were allowed to enter. <br/><br/>Now, Feng Clan is much different than it was yesterday. <br/><br/>Many of the residents have already heard about the feats of Feng Mei and Feng Yun. <br/><br/>Previously, many people dared to criticize the Feng Clan, but today it is completely different. S~eaʀᴄh the Nôvel(F)ire.nёt website on Google to access chapters of novels early and in the highest quality.<br/><br/>\"Is that Feng Yun? WOW! So handsome! I must become his wife.\" <br/><br/>\"Dream on! Do you think that anyone who could climb to the 18th step of the Pillar Of Aptitude would look at you?\" <br/><br/>\"Hmph! At least better than you. Even if I couldn't become Feng Yun's wife, there are still Feng Jianhong and Feng Liang.\" <br/><br/>… <br/><br/>Although Feng Jianhong and others accomplished were dwarfed by Feng Mei and Feng Yun's brilliance, it didn't go unnoticed. <br/><br/>Climbing to the 10th step was already impressive, let alone reaching the 12th or 13th steps, which could earn you an invitation from even the top sects. <br/><br/>When the crowd saw the Feng Clan, they couldn't help but feel awe. <br/><br/>Today, the Feng Clan is known as the clan of geniuses and this attracts many, especially those who want to marry one of the geniuses. <br/><br/>Feng Yun and Feng Mei had many but Feng Xiaoyu, Feng Liang, and Feng Jianhong didn't have any less either. <br/><br/>They were all the Top geniuses of the Eastern Region and had the potential to reach the Three Elements Divine Realm. <br/><br/>\"Look, that's actually the people from the Cloudbreaker Sect!!!\" <br/><br/>Hearing the shocked outcry from the passersby, Feng Chen, who was originally about to enter the Azure Sky Chamber of Commerce, looked towards the incoming sect. The Cloudbreaker Sect was one of the Top 10 Sects of the Azure Sky Empire. <br/><br/>Although their power was insignificant in front of Mystic Flame Sect or Spirit Wind Palace, they were seen as powerful by many people. The status of Cloudbreaker Sect was equivalent to that of the Tianlong Clan in the Eastern Region, if not more esteemed. <br/><br/>The Cloudbreaker Sect was also a very prestigious sect in the entire Azure Sky Empire, attracting countless ambitious individuals. The excitement among the crowd for the Cloudbreaker Sect faded as they noticed another sect had also arrived. <br/><br/>\"Look, it's people from Icy Veil Sect!\" <br/><br/>Soon after the Coudbreaker Sect, people from the Icy Veil Sect also came. <br/><br/>The reaction from the crowd was much more intense and louder than when Cloudbreaker Sect was mentioned. <br/><br/>This is because the Icy Veil Sect was considered a Top 3 Sect alongside Mystic Flame Sect and Spirit Wind Palace. <br/><br/>Moreover, the Cloudbreaker Sect was situated in the Eastern Regions, and was more common to see them, especially in events like the Eastern Region. <br/><br/>Whereas, the Icy Veil Sect rarely comes to the Eastern Region and more importantly, the sect was entirely made up of women which garnered much attention from men. <br/><br/>Most importantly, the current leader of the Icy Veil Sect, the Ice Fairy, was ranked 5 in the Top Beautiful Women of Azure Sky Empire. Not only was she a super beauty ranked 5th, but she was also an immensely powerful cultivator with unfathomable strength. The Icy Veil Sect's convoy was quite large, and the one pulling it was an actual fourth Grade Monster! It was a Monster equivalent to the Grand Qi Condensation Realm, and its presence was indeed impressive. Seeing this, Feng Chen pondered whether he should also acquire a formidable monster, both for protection and as a mount. He recalled the powerful creatures residing in Stormhowl Valley. If he could successfully tame them, it would significantly ease his concerns about his clan's safety. With two or three sixth-grade monsters guarding his clan, who would dare to attack? Certainly, no one within the Azure Sky Empire would possess the capability to do so. <br/><br/>Anyway, he didn't think that the Eastern Region auction would be able to attract even the people from the Icy Veil Sect. <br/><br/>However, as he considered the increased competition, a wider smile spread across his face. More attendees, particularly those with greater wealth, signaled that the items he auctioned would command even higher prices. While others worried about not being able to purchase what they desired, Feng Chen felt a surge of happiness at the influx of such affluent individuals. Indeed, a difference between a buyer and a seller. <br/><br/>Feng Chen smiled and withdrew his gaze. \"Let's go. It's time to head in.\" <br/><br/>Feng Chen was recognized instantly by the guards and they immediately stepped aside, allowing them through with respectful bows. Feng Clan as one of the participants of the Eastern Gathering didn't need any invitation card and could enter without it. <br/><br/>Inside, the auction hall was a dazzling display of luxury. Golden chandeliers hung from the ceiling, and the walls were adorned with intricate carvings and precious gems. \"Is this the Azure Sky Chamber Of Commerce? It is bigger than Tianlong Mansion!\" <br/><br/>Feng Jianhong exclaimed in surprise. He had always considered Tianlong Mansion to be luxurious and spacious, but this building was on a whole new level of grandeur. <br/><br/>Everyone who was visiting for the first time was equally awestruck by the magnificent surroundings. It was evident that this was the foremost business entity in the Azure Sky Empire; the very atmosphere radiated the immense wealth they possessed. <br/><br/>The atmosphere was charged with anticipation, as some of the wealthiest and most powerful figures in the Eastern Region were present. <br/><br/>As they took their seats in one of the private viewing booths, Feng Mei couldn't help but marvel at the grandeur. \"This place is incredible! It's like a palace!\" <br/><br/>Feng Yun leaned back in his chair, his eyes scanning the crowd below. \"There are a lot of important people here. It seems the competition for the treasures will be fierce.\" <br/><br/>There was a treasure that he had his eyes on but with such competition, he didn't think that he could win. <br/><br/>After all, not only were there Top Clans like Tianlong and Yuan Clan but also Sects like Cloudbreaker Sect and Icy Veil Sect. <br/><br/>He has a lot of money that he made with the pills but that might be insufficient to compete with the Top Clan which has many Second and Third Grade Alchemists. <br/><br/>As for competing with the sect, if there was something they desired, individuals like him could never even begin to imagine competing with them.\t\t\t\t\t\t</div>", "images": {}, "success": true}