{"id": 83, "url": "https://www.novelhall.com/my-brothers-the-protagonist-good-thing-i-awakened-my-system-33973/14955461.html", "title": "Chapter 84 The 18Th Step", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 84 The 18Th Step</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 84  The 18th Step On the 17th step, Feng Yun stood before Feng Mei. <br/><br/>\"I have made it!\" <br/><br/>Feng Mei grinned. \"You always make it look so easy!\" She muttered, a small smirk tugging at her lips. <br/><br/>Although happy that Feng Yun could climb to 17th without much trouble, at the same time she was frustrated as Feng Yun made it look so easy while she fought tooth and nail to reach this point. <br/><br/>\"No, No, I also had a hard time reaching here!\" <br/><br/>Feng Yun quickly denied it. Sёarᴄh the nôvelFire.net website on Google to access chapters of novels early and in the highest quality.<br/><br/>\"But it looks like you barely broke a sweat.\" <br/><br/>Feng Mei knew that he just said to make her not feel bad. So, she quickly pointed towards his face which was starkly different from hers. <br/><br/>She had been drenched in sweat and blood, while there wasn't a single drop of sweat on Feng Yun's face. <br/><br/>Feng Yun scratched his head, a sheepish smile tugging at his lips. \"Ha… Ha… \" <br/><br/>Feng Yun could only awkwardly laugh. He thought that he should have at least tried to look like he was struggling. <br/><br/>\"You are going to climb further right?\" <br/><br/>Feng Mei asked. Feng Mei knew that Feng Yun's limit wasn't the 17th step. Judging by his state, the 18th step might also not be a challenge for him. <br/><br/>Feng Yun nodded his head. \"I'll give it a try,\" he replied. <br/><br/>The crowd, which had just settled from the excitement, grew tense again. <br/><br/>\"Wait... is he going to try for the 18th step?\" <br/><br/>\"No one has ever reached the 18th step!\" <br/><br/>\"Is he going to break Miss Ling's record?\" <br/><br/>\"Oh My God! He might become the first in history to climb to the 18th step of the Pillar Of Aptitude!\" <br/><br/>\"Dammit! Can he really achieve this?\" <br/><br/>… <br/><br/>Everyone thought that like Feng Mei, Feng Yun would also stop at the 17th step. But to everyone's surprise, Feng Yun began to head towards the 18th step. <br/><br/>Feng Yun didn't think that climbing to the 18th step would be a challenge for him but he still didn't underestimate it. <br/><br/>After all, it was a place that no one had ever reached. He took a deep breath, feeling the profound energy coursing through him, and then lifted his foot, stepping onto the path that led beyond the limit everyone had thought unreachable. <br/><br/>The crowd held their breath. <br/><br/>Every single person watched as Feng Yun's foot hovered above the edge of the 18th step. The air grew thick with tension, the silence heavy as though the world itself was waiting to see what would happen next. <br/><br/>And then... <br/><br/>His foot came down slowly onto the 18th step. <br/><br/>The pressure struck him instantly, a force unlike anything that had come before. It bore down on him with a crushing weight that sought to tear him apart, testing not just his body but his will. <br/><br/>The crowd gasped in unison as they saw Feng Yun falter for the first time. His body trembled, muscles strained, and sweat began to bead on his forehead. <br/><br/>( Indeed! The 18th step is different from others. ) <br/><br/>Feng Yun thought to himself. He thought that he had been prepared but still, the sudden increase in the pressure caught him unexpectedly. <br/><br/>But even as the immense force tried to crush him, Feng Yun's eyes sharpened. Despite the pressure being much higher than previous steps, it wasn't still enough for him to stop him. <br/><br/>Even if it was the 18th step, the pressure was still much less than what Feng Mei had faced in the 17th step. <br/><br/>This was the difference between those with Exceptional Talent and those who were Heavenly Pride. <br/><br/>For exceptional talents like Feng Mei, climbing to the 17th step is a grueling, life-or-death struggle. But for a Heavenly Pride genius like Feng Yun, even reaching the 18th step is something he can handle with relative ease as if it were merely an obstacle to brush aside. <br/><br/>After just some time, Feng Yun planted his foot firmly on the 18th step, and with a deep, resolute breath, he stood tall. <br/><br/>The crowd erupted in sheer disbelief. <br/><br/>\"He... he's standing on the 18th step!\" <br/><br/>\"No way!\" <br/><br/>\"Is this real?!\" <br/><br/>\"Madness! Today is the biggest day of my life. One surprise after another. I just witnessed the birth of a peerless genius!\" <br/><br/>… <br/><br/>The crowd's voices were filled with awe, disbelief, and a hint of reverence. <br/><br/>This included Elder Ren Daoyu, whose desire to secure Feng Yun had multiplied several times over. A genius who had surpassed the Mystic Flame Sect's most exceptional talent had emerged, and Daoyu could barely contain his excitement. He was eager to report this unprecedented discovery to the upper echelons of the Spirit Wind Palace. <br/><br/>On the other hand, Tianlong Qi and Bai Zhang's faces had turned pale. They had already made enemies of the Feng Clan, but with Feng Yun's newly revealed talent, many Sect would want him. Once he joined a sect, they knew they would be powerless to act against him or the Feng Clan. <br/><br/>The thought of Feng Yun rising to power and seeking revenge for their actions filled them with dread, knowing they wouldn't be able to stop him. <br/><br/>But what's done is done. Now, their only hope was that the Mystic Flame Sect or another enemy of the Feng Clan would eliminate Feng Yun before he grew too powerful. <br/><br/>Grand Elder Feng Zhenshan's eyes gleamed with pride. The future of the Feng Clan had never looked brighter. Beside him, Feng Zhilan's shock quickly turned to exhilaration. Their clan has achieved something monumental. <br/><br/>Feng Yun who was despised as 'Trash' and even had his engagement broken off due to his lack of cultivation talent has broken all records and was the first one to reach the 18th step on Pillar Of Aptitude. <br/><br/>How could she not be excited? <br/><br/>Feng Yun, breathing heavily but steadily, looked down at the stunned crowd below. He didn't move any further. He could have challenged the 19th step but thought that this was enough. <br/><br/>This was enough to prove that he, Feng Yun, was no longer trash. <br/><br/>And that it was not he who didn't deserve Feng Mei but she who didn't deserve him. <br/><br/>Of course, there was still a Three-year bet that he had to fulfill but this could serve as a soft blow to Ling Meiyu's pride. <br/><br/>First this, and then the final blow would be delivered in the Three-Year Challenge!\t\t\t\t\t\t</div>", "images": {}, "success": true}