{"id": 84, "url": "https://www.novelhall.com/my-brothers-the-protagonist-good-thing-i-awakened-my-system-33973/14961907.html", "title": "Chapter 85 End Of Round One!", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 85 End Of Round One!</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 85  End Of Round One! Feng Yun turned around, his foot firmly planted on the 18th step as he began his descent back to the 17th. As he stepped onto the 17th, Feng Mei immediately approached him, her eyes filled with a mix of confusion and curiosity. <br/><br/>\"Brother Yun,\" she called out, her voice tinged with surprise. \"Why didn't you try going for the 19th step?\" <br/><br/>There was a genuine puzzlement in her tone. She had watched him conquer the 18th step with relative ease, something that she couldn't have done even with her earlier power boost. In her mind, there was no doubt that he could reach even higher. With how effortlessly he had handled the pressure of the 18th step, Feng Mei couldn't fathom why he would stop there. Feng Yun paused for a moment, gazing at the 19th step above them. The path was clear, and the challenge was certainly tempting. But he simply smiled, the look in his eyes both calm and thoughtful. <br/><br/>\"I think that's enough for today!\" He said, his tone casual but firm. <br/><br/>Feng Mei's lips curled into a soft chuckle. \"Show-off!\" She muttered playfully, though her words carried no malice. She couldn't help but pout a little, her frustration melting away into affection. It was just like Feng Yun to stop when things got interesting. \"Whether it's the 18th or 19th step,\" Feng Yun continued, as if sensing her unspoken thoughts. <br/><br/>\"There isn't much difference at this point.\" <br/><br/>His voice was calm, but there was an undeniable certainty in his words. For Feng Yun, climbing to the 19th step would have been nothing more than a symbolic victory. The 18th step was already more than enough to show the world that he was no longer the boy they once dismissed as 'trash.' He had made his mark. Any further would be unnecessary—at least for today. <br/><br/>They stood there for a while, Feng Mei and Feng Yun, exchanging quiet words as the other participants continued their struggles on the Pillar of Aptitude. From the lowest steps to the highest, each competitor pushed their limits, some faltering and others triumphing, all while casting wary glances at the top where Feng Yun had just descended. <br/><br/>They could only sigh as they looked up at the two standing on the 17th step, a height they couldn't even imagine reaching, not even in their wildest dreams. <br/><br/>Suddenly, the sound of a powerful voice echoed across the arena, cutting through the murmurs of the crowd. <br/><br/>\"The first round has come to an end!\" The announcer's voice boomed, carrying over the sea of people. His tone was firm but energized, the excitement of the day's events still palpable in the air. \"Participants, you are now required to descend and exit the Pillar of Aptitude!\" <br/><br/>A collective sigh of relief swept through the remaining competitors, many of whom were disappointed at their aptitude. But this was how things were, and they couldn't change it. All they could do was lament the difference in talent between themselves and those who had managed to rise above the 10th step. <br/><br/>One by one, they began their descent, their faces a mixture of exhaustion and quiet dissatisfaction. <br/><br/>The crowd watched as the participants carefully made their way down the Pillar Of Aptitude. A few stumbled, their legs shaky from the strain, while others descended with a quiet dignity, their gazes flickering between the steps they had conquered and the figures above them. <br/><br/>And, of course, there were also people like Tianlong Yu who required medical attention. Having pushed their bodies beyond their limits, they needed treatment before their injuries worsened. <br/><br/>Feng Mei and Feng Yun were the final participants to emerge from the Pillar of Aptitude. <br/><br/>As soon as they stepped out, they were engulfed by the crowd. <br/><br/>After many minutes of anticipation, the audience erupted into a frenzy—cheers rang out, gasps of astonishment filled the air, and some people rushed forward in a wave of excitement. <br/><br/>Feng Yun and Feng Mei found themselves at the center of attention, surrounded by eager onlookers wanting to congratulate, ask questions, or simply catch a glimpse of the remarkable duo who had dominated the first round. <br/><br/>\"Feng Yun! That was incredible! How did you manage to reach the 18th step?\" \"Feng Mei, you were amazing too! I didn't think that anyone is the Eastern Region would have someone as talented as you!\" \"Feng Yun! Feng Mei! We believe in you!\" <br/><br/>\"Congratulations! You two are the best!\" <br/><br/>\"Can't wait to see what you do next!\" <br/><br/>… <br/><br/>Feng Mei felt similarly taken aback by the sudden shift in how people approached her. Not long ago, they had been treated with disdain, as if they were some contagious disease, but now the crowd couldn't help but draw closer, eager for her attention. <br/><br/>Indeed, in the world of cultivation, strength reigns supreme. <br/><br/>\"Ahem! Everyone, please quiet down! Participants, return to your designated areas!\" The announcer's voice rang out, working to restore order in the bustling crowd. <br/><br/>He thought that if he kept the situation as it was then it might become morning before he could announce the result. <br/><br/>\"Yun'er, you were incredible!\" <br/><br/>\"Mei'er, I knew you had it in you! You both made the clan proud! Of course, Liang, Xiaoyu and Jianhog also did fantastic work. Congratulation everyon!\" Feng Zhenshan and Feng Zhilan couldn't stop prasing them. <br/><br/>Feng Mei and others smiled, feeling a warmth spread in their words. It felt good to be recognized especially by the ones whom you respect. As the crowd around them began to settle, the announcer's voice rose once more to capture everyone's attention. <br/><br/>\"Now, let's move on to the individual rankings,\" he called out, ensuring his voice carried over the chatter. \"In first place, we have Feng Yun, who has climbed to the 18th step and earned 100 points for the Feng Clan! In second place, we have Feng Mei, who also reached the 17th step and will contribute an additional 95 points! And in third place, we have Yuan Ziyan…\" <br/><br/>The announcement was met with a mixture of cheers and gasps, the excitement palpable in the air. \"In fourth place, we have Feng Jianhong who has climbed to the 13th step. And the Feng Clan will get another 85 points.\" Searᴄh the NôvelFire(.)net website on Google to access chapters of novels early and in the highest quality.<br/><br/>Yes, Feng Jianhong who lagged behind Feng Xiaoyu and Feng Liang had overtaken them and stood at 13th step and came in fourth place. <br/><br/>While many people were fixated on Feng Mei and Feng Yun, Feng Jianhong was still struggling to make his way up to the 13th step. <br/><br/>Even if he were at the same step as Feng Liang and Feng Xiaoyu, he still wasn't satisfied and continued to struggle until he had reached the 13th step. <br/><br/>He did attempt to try and go all the way to the 14th step but even with his unwavering determination, he still couldn't make it past the 13th step and he had to settle for it. <br/><br/>This obviously caught many people off guard who still thought that the Fourth place would be held by multiple people. <br/><br/>As it turns out, Feng Jianhong has climbed the 13th step unknownst to many people. <br/><br/>As for the fifth place, it was held by 5 people which were Feng Xiaoyu, Feng Lian, Hu Lian, Yuan Ling and Tianlong Yu. <br/><br/>Then going downwards there were only 4 more people who had managed to climb above the 10 steps. As for the others, they were all below 10th step. <br/><br/>This just goes to show the remarkable talent that Feng Mei and Feng Yun have compared to them. <br/><br/>\"Now, let's talk about the Clan Ranking.\" <br/><br/>Then the announcer moved to the ranking of the clan but everyone knew who the first place belongs to. <br/><br/>\"The first place is held by Feng Clan with an overwhelming score of 440 points! The second is awarded to the Yuan Clan with an impressive score of 340 points!\" <br/><br/>The first place was undoubtedly gotten by Feng Clan whose members were all above the 10th step. Moreover, First and Second Place were both from the Feng Clan as well. <br/><br/>And to make matters worse, Feng Clan has already made a huge difference of 100 points with the second place at the start of the competition. <br/><br/>Obviously the overall third place was held by Tianlong Clan with 290 points. Although very good when compared to other clans, it was very low compared to the Yuan Clan and moreso when compared to the Feng Clan. <br/><br/>Good thing was that the clan's overall ranking was based on the points and points were based on the position and not on the steps climbed. <br/><br/>Otherwise the disparity between the first place and the second would have been even more large. <br/><br/>The atmosphere buzzed with excitement as the crowd processed the results. The cheers for the Feng Clan echoed through the arena, filling the air with pride and elation. Feng Clan's geniuses basked in the attention, their accomplishments shining brightly against the backdrop of their clan's achievements. <br/><br/>Today was the day that Feng Clan made their mark in the Eastern Region!\t\t\t\t\t\t</div>", "images": {}, "success": true}