{"id": 86, "url": "https://www.novelhall.com/my-brothers-the-protagonist-good-thing-i-awakened-my-system-33973/14961909.html", "title": "Chapter 87 Preparation For Auction!", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 87 Preparation For Auction!</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 87  Preparation For Auction! The following day, as the sun began to rise over Qingyun City, the streets were already bustling with excitement. This was the long-anticipated auction hosted by the Azure Sky Chamber Of Commerce. <br/><br/>The auction at the Azure Sky Chamber of Commerce had drawn countless people from far and wide, and everyone was eager to get their hands on rare treasures or to simply witness the spectacle of wealth and power that such auctions inevitably became. <br/><br/>Of course, not everyone could gain entry. Those who could either belonged to highly influential and powerful clans or had purchased tickets—which came at a steep price. <br/><br/>The clans participating in the Eastern Gathering were naturally given seats. After all, only the top clans from their respective cities had the privilege of competing in the Eastern Gathering. <br/><br/>At the Crimson Blossom Inn, the members of the Feng Clan were preparing for the big event. However, the leader himself was absent. Feng Chen mentioned that he had somewhere to go and had disappeared without further explanation. <br/><br/>The Grand Elders didn't even have a chance to ask where he was headed. Though he didn't specify his destination, they weren't very worried about his safety. Qingyun City was a relatively safe place, and given Feng Chen's strength, they saw no reason to worry about potential threats or assassination attempts. <br/><br/>WHOOSH! <br/><br/>\"I am back!\" <br/><br/>Just as they were debating whether to wait for Feng Chen at the inn or head to the Azure Sky Chamber of Commerce, Feng Chen suddenly returned. <br/><br/>\"Chen'er, where did you go?\" <br/><br/>Grand Elder Zhenshan asked. <br/><br/>\"Hehe… You will know later!\" <br/><br/>Feng Chen replied with a mischievous grin. <br/><br/>Feng Zhenshan couldn't help but shake his head looking at the antics of Feng Chen which was the same as when he was small. <br/><br/>Back then, Feng Chen would pull off unexpected stunts, never revealing his plans until they were over. His habit of keeping everyone in suspense hadn't changed, and he'd been scolded more than once by his mother for this very behavior. <br/><br/>The antics he pulled over though were nothing to scoff at and would cause sensation all over the Feng Clan. <br/><br/>For one, he had left to go somewhere and returned as a Core Formation Realm cultivator, bringing back an Earth Grade Technique with him. <br/><br/>This caused quite a stir within the Feng Clan, leading his mother to repeatedly demand to know where he had obtained the technique. Such treasures were often found in perilous locations, so she suspected that Feng Chen had ventured into a dangerous place to acquire them. Despite the value of what he had brought back and his well-being, she felt compelled to punish him. <br/><br/>Additionally, his refusal to reveal where he had been only reinforced her belief that he had indeed gone somewhere risky. <br/><br/>Feng Zhilan, standing beside Feng Zhenshan, shook her head in helplessness. With his mother absent, there was no one to reprimand Feng Chen. <br/><br/>On the other hand, Feng Chen couldn't help but smile as he thought about all the money he could earn. <br/><br/>He has gone to Azure Sky Chamber Of Commerce earlier to sell all the stuff he got from Stormhowl Valley. <br/><br/>As he took out his items from the storage ring to the clerk, her eyes widened in disbelief. There were more than 5 Monster Core of Sixth Grade. Nascent Soul Realm Cultivators were less than 10 in the entire Azure Sky Empire. <br/><br/>And to kill a Sixth Grade Monster, it needs at least one Nascent Soul Realm Cultivator with many Three Elements Divine Realm cultivators and a lot of preparation. <br/><br/>Moreover, not many Nascent Soul Realm cultivators are willing to risk their lives to kill Sixth Grade Monsters. They could easily sustain themselves by hunting Fifth Grade monsters, enjoying all the status and fame that came with it. There was little reason for them to take the risks associated with hunting Sixth Grade monsters, which were generally stronger than Nascent Soul Realm cultivators. <br/><br/>So, the monster core of Sixth Grade was extremely rare in the Azure Sky Empire. <br/><br/>\"W-Wait a moment! I'll need to call the manager!\" She stammered, rushing off before Feng Chen could respond. <br/><br/>A few moments later, the manager arrived, his brow furrowed as he examined the goods laid out before him. \"This... Sir, where did you get all of this?\" He asked incredulity etched across his face. <br/><br/>\"I stumbled upon them on my journey!\" <br/><br/>The manager shook his head in disbelief, unable to fathom Feng Chen's words. He found it hard to believe that obtaining those monster cores was as simple as Feng Chen claimed. If what he said was true, it would require an extraordinary stroke of luck. <br/><br/>Feng Chen shrugged nonchalantly. \"Well, I had a bit of luck on my side.\" <br/><br/>The manager quickly regained his composure, his professional demeanor returning. \"I'll need to assess their quality. But I must say, this is an incredible find. You could very well have the most valuable collection we've seen in years.\" <br/><br/>Along with the cores, Feng Chen also retrieved a High-Level Earth Grade Technique and two Mid-Level Earth Grade Techniques. The manager examined these items as well, his astonishment growing. \"This is extraordinary! And you're offering these for sale?\" He asked, his voice filled with excitement. <br/><br/>\"Yes, I believe they could fetch a good price!\" Feng Chen replied. <br/><br/>He decided to withhold the Formation Books, as he deemed them unnecessary for sale. After all, if he presented Grade-5 or even Grade-4 Formation Books, the people gathered there wouldn't have the means to purchase them. Selling the other items would be more than sufficient. <br/><br/>Feng Chen was about to leave after handing over his stuff and going back to the Inn when the manager stopped him. <br/><br/>\"Good Sir, Please wait for a moment\" The manager reached into his pocket and produced a silver card, handing it to Feng Chen with a flourish. <br/><br/>\"This is a Silver Card of the Azure Sky Chamber of Commerce.\" The manager explained. \"With this card, you'll receive a 20% discount on any purchases made in our stores. It's a privilege reserved for our most valued clients.\" <br/><br/>Feng Chen's eyes widened in surprise. \"This is quite generous! Thank you!\" <br/><br/>\"Furthermore, Azure Sky Chamber Of Commerce will also take the lowest commission for the thing you want to sell.\" The manager continued, \"We would only like you that whenever you have items to sell in the future, you prioritize selling to us. I can guarantee that you will receive the best prices for any goods you bring to the Azure Sky Chamber of Commerce.\" Sёarch* The Nôvelƒire.net website on Google to access chapters of novels early and in the highest quality.<br/><br/>Feng Chen nodded and left the store with satisfaction. <br/><br/>All that was left to do now was wait for the auction to begin and count his money.\t\t\t\t\t\t</div>", "images": {}, "success": true}