{"id": 82, "url": "https://www.novelhall.com/my-brothers-the-protagonist-good-thing-i-awakened-my-system-33973/14955460.html", "title": "Chapter 83 Feng Yun'S Ascend", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 83 Feng Yun'S Ascend</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 83  Feng Yun's Ascend Feng Yun cracked his knuckles and stepped forward, his gaze locking onto the 17th step. The crowd, still buzzing with excitement over Feng Mei's achievement, failed to notice Feng Yun who had already started to climb towards the 17th step. His eyes held no urgency or sense of competition—just a quiet confidence that came from having already gauged the pillar's limits. He knew exactly what to expect and was certain he wouldn't falter before reaching the 17th step. <br/><br/>The pressure increased slightly as he moved higher, but for Feng Yun, it was hardly an obstacle. The force that had almost crushed Feng Mei doesn't seem to exist for Feng Yun, offering only a slight resistance that he easily brushed aside. The pressure intensified much higher than the 16th step and his muscles tensed slightly, but he pushed forward without hesitation. As he was inches away from reaching the 17th step, the pressure increased more, creating a palpable weight on his body, but it still wasn't enough to slow his pace. <br/><br/>\"Look! Feng Yun is also climbing to the 17th step!\" One person in the crowd gasped in disbelief, drawing the attention of others. <br/><br/>Suddenly, all eyes shifted to Feng Yun, who had quietly attempted to reach the 17th step without fanfare. The excitement that had filled the air just moments ago for Feng Mei's triumph reignited, this time for Feng Yun. <br/><br/>The crowd, barely having digested Feng Mei's unbelievable feat, was now thrown into another wave of shock as Feng Yun climbed steadily, drawing nearer to the 17th step. Gasps rippled through the onlookers like a stone breaking the surface of still water. <br/><br/>\"Is Feng Yun aiming for the 17th step as well?\" <br/><br/>\"Don't say the obvious! He is only inches away from the 17th step!\" <br/><br/>\"No way! It is already unbelievable that someone reached the 17th step and you want to say that there could be another one?\" <br/><br/>\"He's not even breaking a sweat!\" Someone in the crowd murmured, who noticed the difference between Feng Yun and Feng Mei climbing. <br/><br/>Feng Mei had struggled intensely to reach the 17th step, each centimeter a grueling battle that left her severely injured and on the verge of collapsing. In contrast, Feng Yun, though he took his time, showed no signs of strain. His ascent was steady and controlled, not a drop of sweat on his brow, and he remained completely unscathed by the pressure that had nearly broken Feng Mei. <br/><br/>\"He's... he's going to do it too!\" Yuan Ziyan whispered from the 15th step, unable to tear her eyes away from Feng Yun's steady progress. She had been so certain of Ling Meiyu's unmatched brilliance, yet two from the Feng Clan had shattered that belief. <br/><br/>The other turned out to be the one she had previously underestimated and even held in disdain, believing that Feng Yun, as the ex-fiancé of Ling Meiyu, had tarnished her reputation. <br/><br/>Now, that ex-fiancé had proven to be just as exceptional as Ling Meiyu! Sёarch* The novёlF~ire.net website on Google to access chapters of novels early and in the highest quality.<br/><br/>In front of everyone, Feng Yun ascended to the 17th level, causing the crowd to erupt in cheers once more. <br/><br/>\"He did it! He actually did it!\" <br/><br/>\"Another peerless genius from the Feng Clan!\" <br/><br/>\"Unbelievable… Two people reached the 17th step in a single day. What is happening in this Eastern Gathering?\" <br/><br/>\"And those two are from the same clan. God is so unfair!\" <br/><br/>… <br/><br/>The crowd erupted in cheers, their astonishment at Feng Yun's effortless climb mingling with the praise they had just given Feng Mei. Many couldn't believe what they were seeing. To have one person reach the 17th step was rare enough, but two from the same clan in such a short time? Grand Elder Ren Daoyu thought. It was beyond anyone's expectations. <br/><br/>Elder Ren Daoyu, still processing Feng Mei's potential, now found his mind whirling with plans regarding Feng Yun. \"Two Nascent Soul prospects from the same clan… if we can bring them both into Spirit Wind Palace, our dominance over the Mystic Flame Sect will be sealed.\" <br/><br/>Grand Elder Ren Daoyu thought. He even thought that if they could join the Spirit Wind Palace then he must request the sect to protect Feng Clan. <br/><br/>After all, while protecting them might risk provoking the Mystic Flame Sect, earning their trust would bring far greater benefits than straining relations with the Mystic Flame Sect. <br/><br/>Gaining two future Nascent Soul Realm cultivators would be the equivalent of tripling their sect's overall strength. <br/><br/>\"Yun'er has also reached the 17th step!\" <br/><br/>\"Looks like we don't need to worry about our clan's future at all!\" <br/><br/>Grand Elder Feng Zhilan and Feng Zhenshan were over the moon when Feng Yun also reached the 17th step. <br/><br/>On the other hand, Feng Chen just stood smiling. \"Feng Clan Leader, congratulations! To raise two such prodigies—your clan is truly blessed!\" <br/><br/>\"One could already thank heaven for having one genius reach the 17th step, let alone two! The Feng Clan's future is shining brighter than ever.\" <br/><br/>\"With Feng Yun and Feng Mei, your clan's strength will soar. We can only imagine the heights they will reach!\" <br/><br/>\"I must say, Clan Leader Feng, many would envy the position you're in. Such talent—no doubt the Feng Clan will soon stand at the pinnacle.\" <br/><br/>… <br/><br/>By now, many clans have already come to congratulate him. With the potential that Feng Yun and Feng Mei had shown, even those who feared the Mystic Flame Sect retaliation started to come and congratulate Feng Chen. <br/><br/>After all, many had already done it and they thought that they would only offend the Feng Clan if they didn't. <br/><br/>They didn't think that the Mystic Flame Sect would dare to punish so many clans just for befriending the Feng Clan. Even if they weren't strong enough to resist whatever Mystic Flame Sect did to them for their fame and righteous image, they can't punish so many clans at once. <br/><br/>Moreover, with Feng Clan having two such geniuses, it is only a matter of time when they can also become core disciples of Top Sect. <br/><br/>By then, their influences might be greater than the Mystic Flame Sect. Furthermore, while the Feng Clan may have eliminated one of the elders from the Mystic Flame Sect, could his value possibly compare to that of Feng Mei and Feng Yun? <br/><br/>They even felt that perhaps the Mystic Flame Sect would not only forget that but also benefit the Feng Clan if they decided to have them join their sect. <br/><br/>If that happened then Feng Clan influence would only increase, and by that making an enemy out of them would only land them in trouble. <br/><br/>\"Feng Clan Leader, I have a son who is not only a great talent for cultivation but also a scholar. I think that he must be a perfect match for Feng Mei!\" <br/><br/>\"My daughter's beauty has been praised by many. Your brother and my daughter also have similar temperaments; they would make a wonderful pair!\" <br/><br/>… <br/><br/>Naturally, many began to discuss the possibility of arranging marriages between their descendants with either Feng Mei or Feng Yun. <br/><br/>However, Feng Chen politely declined such proposals. He could clearly see the love between Feng Yun and Feng Mei, and there was no way he would allow another clan to claim such a brilliant talent. <br/><br/>Moreover, Feng Yun had already endured the pain of having his marriage arranged by his parents. So, how could he make him go through that again?\t\t\t\t\t\t</div>", "images": {}, "success": true}