{"id": 85, "url": "https://www.novelhall.com/my-brothers-the-protagonist-good-thing-i-awakened-my-system-33973/14961908.html", "title": "Chapter 86 Azure Sky Chamber Of Commerce!", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 86 Azure Sky Chamber Of Commerce!</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 86  Azure Sky Chamber Of Commerce! As the announcer concluded the rankings, the crowd erupted with a mix of excitement and disappointment. While many cheered in celebration, others couldn't hide their frustration—especially those from the Bai Clan, who had finished in almost the very last place. <br/><br/>Not only had the Feng Clan, whom they once looked down upon, claimed first place, but they now found themselves sitting at the very bottom of the rankings. <br/><br/>The Tianlong Clan was the same. They had been confident that first place was theirs, especially with Tianlong Yu competing. Even if the top spot wasn't guaranteed, they were certain they would at least secure second place. <br/><br/>But now, they found themselves in third place, with a staggering gap in points separating them from the first-place Feng Clan. <br/><br/>Of course, they won't be so down if it were any other clan who took the first place but it has to be the Feng Clan whom they had already offended. <br/><br/>On the other hand, Feng Chen had a completely different expression on his face compared to them. <br/><br/>[Sub-Mission 1 Complete: Secure the top position in the first round of the Eastern Gathering Competition.] <br/><br/>[Rewards: 30,000 System Points] <br/><br/>[Main Mission Progress: 1/4 Tasks Completed] <br/><br/>Feng Chen smiled at the System notification. <br/><br/>He has received a mission that was to get first place in this competition and it was divided into equal numbers of rounds which is 4. <br/><br/>Feng Chen was very happy to receive the mission as he had previously used almost all of his System Points. <br/><br/>Moreover, he could get a large amount of System Points as long as his clan took first place in each round. <br/><br/>With Feng Yun, he wasn't very worried about the first three rounds. Though he couldn't guarantee that he could get first place every time as what the competition will be about is unknown to him. <br/><br/>But as long as it concerns talent or fighting prowess, he wasn't too worried about his clan not getting the first place. <br/><br/>As for the fourth round, it wasn't any challenge for him at all. <br/><br/>No matter what he will be competing in, he is certain that no one can take the first place from him. <br/><br/>\"Well done, all of you!\" Feng Chen said. His voice was full of satisfaction. Everyone thought that Feng Chen was very happy about his clan geniuses, especially Feng Yun and Feng Mei's performance. <br/><br/>Of course, he was very happy which was partly because of their good performance but more so because of the notification he received from the System. <br/><br/>He already knew about their talent, so it wasn't much of a surprise to him. However, there was one who gave him a little surprise. <br/><br/>\"Especially you, Feng Jianhong! I thought that your limit was the 11th step but you have exceeded my expectation and reached the 13th step.\" <br/><br/>Feng Chen said. <br/><br/>Feng Chen's compliment took many by surprise. <br/><br/>For one, his words suggested that he had expected Feng Mei and Feng Yun's remarkable results. On the other hand, it revealed that Feng Chen was more impressed by Feng Jianhong's performance, even though Feng Yun had reached the 18th step and claimed the highest position on the Pillar of Aptitude in the history of Azure Sky Empire. This unexpected praise for Jianhong left many puzzled. <br/><br/>Feng Jianhong was the same and he was elated by the praise of Feng Chen. <br/><br/>\"Thank you, Patriarch, for your praise!\" <br/><br/>Feng Jianhong's face lit up with a mixture of surprise and pride as he bowed slightly in gratitude. The acknowledgement from Feng Chen meant more to him than he could express. <br/><br/>At that moment, Feng Jianhong felt like all his efforts had been worth it. Feng Chen rarely gave individual praise, as evidenced by the fact that even Feng Mei and Feng Yun, who had astonished everyone with their performances, hadn't received direct compliments from him. This made Feng Chen's recognition of his achievement all the more meaningful for the Feng Clan. <br/><br/>As Feng Jianhong basked in the glow of his newfound recognition, Feng Mei leaned closer to Feng Yun, a teasing smile on her lips. \"Looks like someone is stealing the spotlight!\" She whispered, her eyes sparkling with mischief. She was obviously teasing Feng Yun and also hinting at the fact that Feng Yun wasn't trying his best earlier. <br/><br/>Otherwise, Feng Yun might have been the one to receive Feng Chen's praise. But in truth, even if Feng Yun had reached the 20th step, it wouldn't have surprised Feng Chen in the slightest. <br/><br/>Feng Yun chuckled softly, shaking his head. He knew his brother well and didn't think that he would have even if he had reached the 19th step. He had a feeling that everything that was happening was within his brother's expectation except maybe the achievement of Feng Jianhong which is why he was complimented. <br/><br/>\"He deserves it. Jianhong worked hard for that step.\" <br/><br/>Before Feng Mei could respond, the announcer's voice cut through the murmurs of the crowd once more. <br/><br/>\"And that concludes the first round of the Eastern Gathering Competition! Participants, you have all displayed remarkable talent and tenacity.\" Tianlong Zhen continued. <br/><br/>\"However, it's time to prepare for the next stage of the competition. The second round will take place the day after tomorrow, so use this time wisely to recover and strategize!\" <br/><br/>\"And Azure Sky Chamber Of Commerce will also be holding an auction tomorrow at their place. Everyone here is invited to come!\" <br/><br/>Tianlong Zhen also didn't forget to mention this. This is the biggest auction that happens in the Eastern Region which is also held by the Azure Sky Chamber Of Commerce. <br/><br/>Azure Sky Chamber Of Commerce is the biggest business association in Azure Sky Empire. <br/><br/>They had branches all over the empire including the Qingyun City. Sadly, there wasn't one in Misty Vale City as the place was deemed too remote with not much spending power. <br/><br/>Regardless, Feng Chen was already buzzing with excitement. He had many items he wanted to sell, and the upcoming auction at the Azure Sky Chamber of Commerce was the perfect opportunity to sell the treasures he had acquired from Stormhowl Valley. <br/><br/>One by one, the Clans left the Tianlong Mansion and Feng Clan was the same. The atmosphere with the Feng Clan was very different from when they entered to the one when they exited. Sёarᴄh the NôᴠelFirё.net website on Google to access chapters of novels early and in the highest quality.<br/><br/>When they entered, they had been scrutinized and cursed with all of them keeping a distance from them. <br/><br/>However, when they were leaving, many of them were talking to them and extending their good will almost like what happened when they entered were just a lie. <br/><br/>Feng Chen struggled to shake off the persistent crowd before finally making his way toward the inn that he had booked for their stay in Qingyun City. <br/><br/>As they approached their designated inn, the Crimson Blossom Inn, its charming facade stood out among the other buildings, adorned with intricate carvings of flowers and vibrant red banners fluttering in the breeze. The warm glow of lanterns illuminated the entrance, welcoming guests with an inviting ambiance. <br/><br/>Pushing open the ornate wooden doors, they were greeted by the sweet scent of blooming cherry blossoms mixed with the aroma of delicious food wafting from the kitchen. The inn was bustling with patrons, some seated at tables while others conversed animatedly near the bar. <br/><br/>Feng Chen approached the front desk, where a young woman with a bright smile stood ready to assist them. \"Welcome to the Crimson Blossom Inn! Do you have a reservation?\" <br/><br/>\"Yes, we booked a room under the name Feng!\" \"Ah, yes! The Feng Clan! Your rooms are ready. I'll escort you to your suite.\" The woman gestured for them to follow, leading them up a flight of wooden stairs adorned with decorative lanterns. <br/><br/>As they reached their suite, Feng Chen couldn't help but admire the room's elegance. The space was adorned with rich tapestries and comfortable furnishings, creating a cozy yet luxurious atmosphere. A large window offered a stunning view of the bustling streets below, the sun setting in a cascade of orange and pink hues. <br/><br/>\"This is amazing!\" Feng Mei exclaimed, stepping inside and twirling in delight. Feng Jianhong, who had followed closely behind, nodded in agreement. \"It's a far cry from our usual accommodations in Misty Vale City.\" <br/><br/>After a moment of admiring the room, Feng Chen suggested, \"Why don't we rest for a bit before dinner?\" <br/><br/>\"Good idea!\" Feng Yun said, dropping onto one of the plush sofas. \"I could use a breather after that intense round.\" <br/><br/>Feng Chen rolled his eyes knowing that the one who had the least struggle was none other than Feng Yun. With how easy it was for him, it could hardly even be considered a warm-up for him. <br/><br/>\"Let's not forget the auction at the Azure Sky Chamber of Commerce tomorrow. So rest up early and get ready to attend the auction. We can also look at the treasures that we could buy.\" <br/><br/>Feng Chen continued. <br/><br/>\"As a reward for today's performance, if there is any treasure that you like then I will try my best to get it for you!\" <br/><br/>As Feng Chen mentioned the reward, the atmosphere in the room shifted with an infectious excitement. The prospect of receiving treasures from the auction lit up the faces of everyone present. After all, Azure Sky Chamber Of Commerce is the biggest merchant association and the stuff they sell is incredibly precious and expensive. <br/><br/>So, how can they not feel excited when Feng Chen has promised to buy one of the treasures for them. <br/><br/>\"Thank you, Patriarch!\" <br/><br/>\"Thank you, brother!\" <br/><br/>Feng Chen couldn't help but grin at their enthusiasm. \"You all earned it through your hard work and dedication. I just hope that you all continue with the same spirit and bring glory to our clan.\" <br/><br/>( And also System Points to myself! ) <br/><br/>Feng Chen thought to himself.\t\t\t\t\t\t</div>", "images": {}, "success": true}