{"id": 88, "url": "https://www.novelhall.com/my-brothers-the-protagonist-good-thing-i-awakened-my-system-33973/14964175.html", "title": "Chapter 89 The Bidding Game", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 89 The Bidding Game</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 89  The Bidding Game Feng Chen noticed the look of uncertainty on Feng Yun's face and chuckled softly. \"Yun'er, don't worry. If there's something you want, I'll make sure it becomes yours.\" Feng Chen said, his voice carrying a calm confidence. His gaze swept over the auction hall, his expression serene despite the presence of so many formidable figures. While they were undeniably more powerful and wealthier than the Feng Clan, he doubted they had brought as much money as he had. After all, with the items he had up for auction, he didn't believe any of the other items would fetch a higher price than the one he was offering. <br/><br/>\"I didn't bring the Feng Clan here just to watch. If something catches our eye, it will belong to us.\" <br/><br/>Feng Yun raised an eyebrow, glancing at his brother with a mixture of curiosity and confusion. Although their clan was no longer poor and could even be considered the richest in the Misty Vale City, it still wasn't anything in front of these powerful clans and Sects. <br/><br/>\"Brother, I know we've become more powerful recently, but with so many prestigious clans and sects here… can we really compete with them in terms of wealth?\" <br/><br/>Feng Chen smiled knowingly, leaning forward in his seat. \"That… you don't need to worry about it. Just tell me about the things you want, and I will buy it for you!\" <br/><br/>Feng Yun looked at his brother, still unsure. Feng Chen's confidence was unwavering, and that in itself was puzzling. They were no longer the struggling clan they once were, but to openly challenge the wealth of sects like Cloudbreaker or the Icy Veil seemed bold—even for his brother. <br/><br/>But at the same time, he knew that his brother was hiding deeper than he could see. <br/><br/>Just as he had previously revealed pills and artifacts when the clan was in dire need, Feng Yun wondered if his brother had another hidden trove of treasures he had yet to unveil. <br/><br/>In any case, it didn't feel right to question his brother's ability, and just nodded silently. Anyway, even if he couldn't get what he wanted, he didn't think that it was going to be a big deal. <br/><br/>***** <br/><br/>\"Is that Feng Mei mentioned in the report?\" <br/><br/>On the Icy Veil Sect side, the one leading the group asked. \"Yes, Sect Leader!\" <br/><br/>They answered in unison. <br/><br/>\"Hmm… \" <br/><br/>It was the Ice Fairy, the sect leader of the Icy Veil Sect who is also One of the Nascent Soul Realm Cultivators that had come to the auction. <br/><br/>However, because her face was covered in a veil, no one could recognize her. <br/><br/>Moreover, few people had ever seen her face, so even without a veil, it would still be difficult for most to recognize her, even if they saw her up close. <br/><br/>Anyway, she glanced at Feng Clan's private rooms, especially at Feng Mei. <br/><br/>There was only one reason why they had come here to Qingyun City overnight and that was to recruit Feng Mei. <br/><br/>One of their disciples who was competing reported that a girl who hadn't joined any sect was able to reach the same height as the Ling Meiyu. <br/><br/>So, they had to make a move first before any other sect. They had already lost Ling Meiyu to the Mystic Flame Sect and couldn't lose another. <br/><br/>As for Feng Yun who is said to have climbed higher, they could only lament that he wasn't a girl and not qualified to join their sect. <br/><br/>Otherwise, castrate him? <br/><br/>Well, that was an option if Feng Yun himself wanted to. <br/><br/>Anyway, their purpose was to scout Feng Mei, and with Azure Sky Chamber Of Commerce hosting an auction, it was the right time to observe Feng Mei before extending their invitation. <br/><br/>Ice Fairy's gaze was on Feng Mei when suddenly she found Feng Chen looking at her for a moment. <br/><br/>Although it was only momentarily, she knew that he was looking at her. <br/><br/>\"Who?\" <br/><br/>Ice Fairy asked. <br/><br/>??? <br/><br/>However, this confused the Icy Veil Sect elders who didn't know whom the sect leader was talking about. <br/><br/>\"Who is that man?\" <br/><br/>She then proceeded to point her finger at Feng Chen and asked. <br/><br/>\"Him? According to the information that I have collected, he should be the clan leader of Feng Clan, Feng Chen. He is 30 years old and has advanced to Three Elements Divine Realm. He is also the one who killed the elder of Mystic Flame Sect and Spirit Wind Palace.\" <br/><br/>One of them quickly answered. With Feng Chen being related to Feng Mei, they obviously didn't slack off in collecting his information. <br/><br/>\"...\" <br/><br/>Ice Fairy was quiet for a second and didn't say anything further. <br/><br/>( Was that my imagination? ) <br/><br/>She thought. <br/><br/>As Nascent Soul Realm, she was quite adequate at hiding her Qi and presence. Even if she stood beside others, unless she herself made her known, they would not sense her. <br/><br/>Much less when she is so far away. She didn't think that anyone would notice her. <br/><br/>Moreover, for a split second that her gazes met his, she shuddered in fear almost like she was encountering something dangerous. <br/><br/>Obviously, this was for a split second which made her doubt whether it was just her imagination running wild or something that actually happened. <br/><br/>Before she could dwell further, the loud clang of a gavel echoed through the grand hall, signaling the start of the auction. Her attention, like everyone else's, was drawn to the stage as the first item was revealed. <br/><br/>The auctioneer, an elderly man with a sharp gaze and a commanding presence, took the stage and began addressing the audience. \"Esteemed guests, we welcome you to the Azure Sky Chamber of Commerce's grand auction! Tonight, we have a selection of rare treasures and artifacts that are sure to capture your interest. Let us begin.\" <br/><br/>Unlike other auctions, the host of this event wasn't a beautiful woman but an elderly man. This was because the items sold by the Azure Sky Chamber of Commerce were of the highest quality, requiring no gimmicks like a charming host to attract buyers. <br/><br/>The crowd murmured in anticipation as the first item was bought out: a shimmering crystal that pulsed with a faint blue light. <br/><br/>\"Essence Purifying Stone!\" The auctioneer announced. This stirred up quite a commotion, catching many by surprise. <br/><br/>The Essence Purifying Stone, also known as a talent-enhancing treasure, was highly coveted by powerful clans seeking to improve the potential of their heirs and descendants. Upon use, it clears the body's meridians, enhancing the ability to absorb Qi significantly. Naturally, such treasures were extremely rare and precious, making them highly sought after by anyone aiming to elevate their cultivation talent. <br/><br/>\"WOW! Azure Sky Chamber Of Commerce is bringing out the big gun from the start!\" <br/><br/>\"If this is just the starting item, I wonder what kind of wondrous item that will be auctioned later.\" <br/><br/>\"Damn! I don't know whether I should bid for this or wait for Artifact that I wanted for so long.\" <br/><br/>… <br/><br/>The Elderly host was satisfied by the reaction of the crowd and proceeded with the auction. <br/><br/>\"A rare treasure that can enhance one's cultivation talent and unlock hidden potential. The starting bid is 20,000 gold! The bid shouldn't be less than 1000 Gold Coins.\" <br/><br/>The bidding began, with several powerful sects and clans vying for the crystal. The price quickly escalated and stopped at a whopping 43,000 gold coins. <br/><br/>And it was won by Tianlong Yu. He seemed quite happy to have won the Essence Purifying Stone. <br/><br/>Feng Chen didn't participate in the bid as the Soul Crystal was similar to the Marrow Cleansing Pill. The Essence Purifying Stone is valued less than the Marrow Cleansing Pill and the only reason why the Essence Purifying Stone is so valued is because of the rarity of the Marrow Cleansing Pill. <br/><br/>With Feng Chen having access to Marrow Cleansing Pill, he didn't think that he needed to waste his money on an inferior product. <br/><br/>However, this did make him wonder just how much one Marrow Cleansing Pill would go for if even an Essence Purifying Stone could get such a high price. <br/><br/>( Maybe I should have given Marrow Cleansing Pill? ) Sёarᴄh the Novelƒire(.)ne*t website on Google to access chapters of novels early and in the highest quality.<br/><br/>Feng Chen thought for a moment before shaking off his thoughts. <br/><br/>Money could be earned but the System Points couldn't. He could easily make more money by selling Sixth Grade Monster Cores while getting System Points was much harder making it a much more valuable resource. <br/><br/>He wouldn't just trade those System Points for Gold Coins. <br/><br/>Even if he had Marrow Cleansing Pills, it was better for him to use it on his clan than to sell them on the market. <br/><br/>Soon, the next item was brought on the stage. <br/><br/>\"This is a high-level Mortal Grade sword, crafted from a Third Grade Monster Core and obsidian. It is considered the most powerful weapon below the Earth Grade. The starting price is 5,000 gold coins, with each subsequent bid requiring an increase of no less than 100 gold coins.\" <br/><br/>The bid began to rise but it was mostly from those individuals who brought the ticket and came in unlike Feng Clan and others. <br/><br/>Powerful clans like Tianlong and Yuan didn't seem very interested in it. The Feng Clan was even less interested since many of them already had Earth-grade weapons. <br/><br/>This item was bought out for those individuals without background to bid and enjoy. <br/><br/>This is how auctions are usually conducted. You wouldn't just bring out items that can only be brought by wealthy people. <br/><br/>You should include some items that may not appeal to the upper echelons but would definitely attract the interest of those with less financial means. <br/><br/>High-level Mortal Grade Wweapon might not be a catch for these powerful clans or sects' eyes, but it was almost impossible for those without background to obtain them. <br/><br/>While a high-level Mortal Grade weapon might not attract the attention of the more influential clans and sects, it was almost impossible for those without connection to get them unless auctioned. So, given the chance of obtaining one, they would do everything that they could to get it. After all, one's weapon could perhaps decide life and death and the easiest way to get stronger was to get a powerful weapon.\t\t\t\t\t\t</div>", "images": {}, "success": true}