{"id": 81, "url": "https://www.novelhall.com/my-brothers-the-protagonist-good-thing-i-awakened-my-system-33973/14946628.html", "title": "Chapter 82: The 17Th Step!", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 82: The 17Th Step!</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 82: The 17th Step!The crowd, who had been holding their breath, gasped in disbelief as Feng Mei, on the verge of collapsing, suddenly stood up.<br/><br/>They had seen her collapse moments before and had watched as she seemed to break under the pressure.<br/><br/>But now, suddenly, instead of collapsing, she stood up and was also jumping around.<br/><br/>\"She's standing... again?\"<br/><br/>\"How... how is that possible?\"<br/><br/>\"Did she just stop bleeding? Is it my eyes or did her injuries really disappear?\"<br/><br/>...<br/><br/>The crowd was surprised by how Feng Mei, who should have collapsed, suddenly stood up and was filled with energy.<br/><br/>\"What happened?\"<br/><br/>\"Does Mei'er some trump card?\"<br/><br/>Grand Elder Feng Zhenshan and Feng Zhilan were also confused by the sudden change in Feng Mei.<br/><br/>Though relieved that she was fine, they were still trying to understand how Feng Mei had recovered so suddenly.<br/><br/>No matter how hard they tried, they couldn't think of any technique within the Feng Clan that could not only heal but also fill someone with strength.<br/><br/>Only one person was not confused by this: Feng Chen, who was aware of Feng Mei's physique.<br/><br/>Obviously, he was also shocked when Feng Mei suddenly recovered from all her injuries but unlike others, he immediately knew why.<br/><br/>He had read a book about phoenixes that stated a single drop of phoenix blood was enough to heal any living being, as long as they were not dead.<br/><br/>So, he could understand that Feng Mei's recovery must have something to do with Feng Mei's Phoenix Physique.<br/><br/>And it wasn't any phoenix either, it was Jade Phoenix which should stand at the top of phoenix lineage.<br/><br/>\"Eyes of Insight!\"<br/><br/>**************** Sёarᴄh the NôᴠeFire.ηet website on Google to access chapters of novels early and in the highest quality.<br/><br/>Name: Feng Mei<br/><br/>Cultivation Level: Mid Core Formation Stage<br/><br/>Talent: Exceptional<br/><br/>Physique: Jade Phoenix (Unawakened)<br/><br/>**************<br/><br/>Sigh!<br/><br/>Feng Chen had hoped that perhaps she might have awakened her physique.<br/><br/>However, it seems like she didn't.<br/><br/>Although she didn't awaken her physique, it did help heal her injuries which were already beyond what most physiques could do.<br/><br/>And she has also broken through to the Mid-level Core Formation Stage which can be counted as a bonus.<br/><br/>With such a display of power, he could only imagine just how powerful Feng Mei would be after she had awakened her Jade Phoenix physique.<br/><br/>(Perhaps she might even be immune to death!)<br/><br/>After all, phoenixes are creatures who are said to defy death and can live indefinitely through rebirth.<br/><br/>If Feng Mei could show such recovery in her unawakened state, he felt that when she awakened her physique, even killing her wouldn't be enough to truly end her.<br/><br/>In any case, after recovering, everyone could see that she was once again set out to ascend the Pillar Of Aptitude.<br/><br/>Many thought that Feng Mei's misery would only repeat and she would undoubtedly fall again.<br/><br/>However, within no time, she proved them wrong.<br/><br/>She quickly went from the 16th step to the 17th step as if the previous struggle was just a lie.<br/><br/>She was finally on the 17th step!<br/><br/>11<br/><br/>The crowd, silent at first, erupted in disbelief.<br/><br/>\"... She actually did it!\"<br/><br/>\"Unbelievable!\"<br/><br/>\"This doesn't even make sense!\"<br/><br/>\"Feng Mei! Hmph! I will remember your name.\"<br/><br/>\"Damn right! But will she remember yours? Her name will go down in the history of Azure Sky<br/><br/>Empire.\"<br/><br/>\"Another person has climbed to the 17th step!\"<br/><br/>\"Peerless genius! Peerless genius has emerged in the Eastern Gathering!\"<br/><br/>...<br/><br/>The crowd erupted with excitement, unable to contain their enthusiasm.<br/><br/>\"This...\"<br/><br/>Grand Elder Ren Daoyu was also stunned when he saw Feng Mei climb to the 17th step. The same as Ling Meiyu, the peerless genius of Mystic Flame Sect.<br/><br/>\"I must get her!\"<br/><br/>He muttered under his breath.<br/><br/>Compared to the death of a measly elder, he thought that getting Feng Mei to join their sect<br/><br/>was of much greater importance.<br/><br/>Elder Zhou Tianhua was just an elder in Three Elements Divine Realm, which although previous to the sect isn't much compared to prospects like Feng Mei.<br/><br/>After all, those who could reach the 17th step in the Pillar Of Aptitude are guaranteed to reach<br/><br/>the Nascent Soul Realm and might even go further.<br/><br/>If they manage to do that, then their sect will take over Mystic Flame Sect and become the greatest sect of Azure Sky Empire.<br/><br/>Even if she doesn't go beyond Nascent Soul Realm, having Nascent Soul Realm itself will<br/><br/>double Spirit Wind Palace's strength.<br/><br/>He knew that he had to change his plan!<br/><br/>On the other hand, Tianlong Qi was regretting his previous actions immensely.<br/><br/>With Feng Mei as their talent, he was sure that many sects would offer her to become a core<br/><br/>disciple or maybe even the future sect leader like Ling Meiyu.<br/><br/>If he had treated them better then he would have had the chance for one of his descendants to<br/><br/>woo Feng Mei.<br/><br/>\"No! I can still do it!\"<br/><br/>He believed that if he changed his ways and began treating them better, he would still have a<br/><br/>chance.<br/><br/>His descendants were also not bad and are one of the Top in the Eastern Gathering. He was sure that one of the male descendants would be able to capture her heart.<br/><br/>As for offending the Spirit Wind Palace and Mystic Flame Sect, once she became his clan's daughter-in-law and took the name Tianlong, her allegiance would shift to the Tianlong<br/><br/>Clan.<br/><br/>They were not the only ones who were thinking about it. Most of the clan were now thinking about telling their descendant to hook up with Feng Mei.<br/><br/>If they did, it was almost as if they had gotten a future Nascent Soul Realm.<br/><br/>\"WOW! Sister Mei did it!\"<br/><br/>Feng Xiaoyu said excitedly.<br/><br/>\"I knew she could do it. And I believe Brother Yun will also be able to do that. That Ling Meiyu<br/><br/>will surely regret after knowing about brother Yun's talent.\"<br/><br/>Feng Liang added.<br/><br/>\"... She really did it.\"<br/><br/>Hu Lian couldn't believe her eyes. She also thought that only junior sister Ling Meiyu would<br/><br/>be capable of reaching the 17th step. Now, there was another one.<br/><br/>Yuan Ling, on the other hand, felt a bit ashamed. He previously thought that she was a good<br/><br/>match for him.<br/><br/>But never did he think that he and she were never on the same level and he didn't deserve her<br/><br/>at all.<br/><br/>Tianlong Yu, on the other hand, had become completely silent with no trace of arrogance.<br/><br/>Yuan Ziyan, on the 15th step, widened her eyes in surprise. Like Hu Lian, she thought that there would never be another person like Ling Meiyu.<br/><br/>But now, she was slapped across her face with the fact that another such person had risen up.<br/><br/>Feng Mei stood tall, having reached the 17th step-the same as Ling Meiyu-but chose not to<br/><br/>go up further.<br/><br/>At the moment, it seems like her renewed strength has left her body and she struggled a bit to<br/><br/>stand still.<br/><br/>Previously, she thought that perhaps reaching the 18th step might also be possible with her<br/><br/>current strength.<br/><br/>But she soon realized that her new profound strength was temporary, and if she tried to go<br/><br/>any further, this time for sure, she would be crushed by the pressure.<br/><br/>However, she didn't plan on doing that either.<br/><br/>She was happy to even get to the 17th step.<br/><br/>Then she looked below where Feng Yun waved at her happily.<br/><br/>\"Looks like I worried for nothing!\"<br/><br/>Feng Yun muttered. He stayed vigilant just in case Feng Mei fell down but there was no need<br/><br/>for his help.<br/><br/>She has successfully ascended to the 17th step.<br/><br/>\"Now then, I should get going as well!\"\t\t\t\t\t\t</div>", "images": {}, "success": true}