{"id": 90, "url": "https://www.novelhall.com/my-brothers-the-protagonist-good-thing-i-awakened-my-system-33973/14993710.html", "title": "Chapter 91 Appeal Of Sixth-Grade Monster Core!", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 91 Appeal Of Sixth-Grade Monster Core!</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 91  Appeal Of Sixth-Grade Monster Core! Feng Chen noticed the lingering concern on Feng Mei's face and leaned in closer, his expression softening. <br/><br/>\"Don't worry about the price,\" he said firmly, his tone reassuring. \"This is what I promised, and whatever I bought is yours. No need to think about it.\" <br/><br/>Feng Mei nodded slightly, though her worries hadn't completely vanished. The staggering amount of 200,000 gold coins still echoed in her mind. <br/><br/>The auction resumed, and soon the auctioneer's voice rang out again, louder and more excited than before. <br/><br/>\"Next up, a prized treasure from the Eastern Continent's famed artisans—a single-edged Low-level Earth Grade Sword, known as 'Ironheart.' Forged from rare ore and imbued with the essence of earth, it provides its wielder with unmatched defensive capabilities while delivering devastating strikes. A true weapon for a powerful warrior!\" <br/><br/>The auctioneer gestured toward the attendant, who carefully unveiled the sword. Its blade gleamed, and a faint hum of energy could be felt radiating from it. <br/><br/>\"The bidding for Ironheart will start at 30,000 gold coins!\" <br/><br/>Immediately, a flurry of hands shot up. <br/><br/>\"40,000!\" Shouted a representative from the Cloudbreaker Sect. They had missed the Skyfire Feather but they want to restore their image by winning this next one. <br/><br/>Moreover, Earth Grade Weapons were rare and precious even for a sect like them. \"45,000!\" Countered someone from the Icy Veil Sect. <br/><br/>The price climbed steadily, with many powerful sects vying for the prized sword. Yet, the Feng Clan remained silent, not participating in the bidding at all. As for the reason, they already possess High-level Earth Grade Weapons, so there was no need to bid for a low-level one. <br/><br/>As the price reached 60,000 gold coins, the Cloudbreaker Sect's elders finally won the bid with a final call of \"70,000 gold coins!\" <br/><br/>\"Sold!\" The auctioneer exclaimed. The crowd erupted in applause as the sword was carried off to its new owner. <br/><br/>Without missing a beat, the auctioneer introduced the next item. \"Esteemed guests, the next item is no less impressive. A pair of Mid-level Earth Grade gauntlets known as the 'Stonefist Gauntlets.' Forged for close combat experts, these gauntlets enhance the strength and durability of the user's arms, turning them into living weapons!\" <br/><br/>The bidding started again at 50,000 gold coins. <br/><br/>\"55,000!\" The Icy Veil Sect bid immediately. <br/><br/>\"60,000!\" Followed the Yuan Clan. <br/><br/>\"65,000!\" The Cloudbreaker Sect once again raised the stakes. <br/><br/>The auction continued, with fierce competition between the major sects. After several rounds, the Cloudbreaker Sect won the gauntlets for 85,000 gold coins. <br/><br/>As the gauntlets were carried off, the auctioneer moved on. \"Next, esteemed guests, we present a truly rare and valuable item—Ice Silk Protective Wear! This mid-level Earth-grade armor is woven from the finest Ice Silk threads, renowned for their ability to block extreme temperatures and enhance the wearer's defense against physical and elemental attacks. Lightweight yet impenetrable, this protective garment can turn the tide in even the deadliest of battles!\" <br/><br/>Another bidding war erupted between the Icy Veil Sect and the Yunhai Clan, quickly driving the price up to 80,000 gold coins. <br/><br/>The fierce competition was understandable—protective artifacts were far rarer than weapons, and this particular piece was designed specifically for women, making it an even more coveted treasure among sects and clans that sought to equip their female disciples with the finest gear. <br/><br/>The crowd was excited by these powerful people competing with each other though there was one thing that many had noticed. <br/><br/>\"I thought the Feng Clan was so wealthy after that Skyfire Feather purchase.\" <br/><br/>\"They haven't bid on any of the weapons so far.\" \"Maybe they spent everything on that one item. Or it could be that they don't need these weapons?\" <br/><br/>\"Idiot! What kind of clan or sect doesn't lack Earth-Grade Weapon? This Feng Clan must have exhausted all their wealth on that one item. Truly an idiotic decision!\" <br/><br/>\"That Skyfire Feather might be valuable but it wouldn't be as valuable as getting two Earth-Grade Weapons!\" <br/><br/>… <br/><br/>Many have already thought that the Feng Clan has exhausted all their wealth and therefore is not participating in the bid. <br/><br/>Even the Cloudbreaker Sect elder, who had won two Earth-Grade weapons, glanced toward the Feng Clan's booth with a smug grin. <br/><br/>\"Looks like they've run out of funds.\" The Elder who bid against Feng Chen muttered under his breath. <br/><br/>He thought that it wasn't humiliating to lose a bid against a clan that was crazily spending all its funds on one item. <br/><br/>After all, no matter how wealthy they were, they shouldn't unnecessarily spend money. Getting Two Earth-Grade Weapons was better than obtaining one Skyfire Feather at a cost of 200,000 gold coins. <br/><br/>The murmurs grew louder, and soon it was clear that many in the audience believed the Feng Clan had exhausted their resources after that one extravagant purchase. <br/><br/>Feng Chen, on the other hand, paid no attention to their whispers or judgments. Anyway, he didn't mind even if they thought that their clan was poor. <br/><br/>( Is this it? ) <br/><br/>He found himself growing bored with the auction, as each new item revealed was yet another Earth-Grade artifact—none of which piqued his interest in the slightest. <br/><br/>As the auction for the Ice Silk Protective Wear concluded, the excitement in the hall was palpable. With the Yunhai Clan securing the item for 110,000 gold coins, the crowd buzzed with energy, waiting to see what would come next. <br/><br/>The auctioneer paused for a moment, his gaze sweeping across the eager audience, before continuing with a new level of enthusiasm. <br/><br/>\"Esteemed guests, we now have something truly extraordinary to present—a Sixth-Grade Monster Core!\" <br/><br/>Gasps echoed through the hall as the attendants rolled out an intricately designed chest, its surface shimmering with faint spiritual energy. After all, Sixth Grade Monster Cores are never auctioned and Nascent Soul realm Cultivator only hunts Sixth Grade Monsters because they have the use for themselves. <br/><br/>If they just want money then they would safely hunt Fifth Grade Monsters. Which is one of the reasons why Sixth Grade Monster Core are almost never sold. <br/><br/>And this caused the crowd to be wild with excitement including the Cloudbreaker Sect's elders and even the Icy Veil Sect's elders who rarely show emotion. <br/><br/>When the chest was carefully opened, a powerful wave of raw energy surged forth, immediately capturing the attention of every cultivator in the room. <br/><br/>Feng Chen looked at the item that he had auctioned. Compared to when he brought in the item which is just covered in some clothes, the auctioneer indeed knew how to make the item look more appealing. <br/><br/>\"This is really a Sixth Grade Monster core. I can't believe that I am so lucky!\" <br/><br/>An elder from the Cloudbreaker sect said. <br/><br/>Although Cloudbreaker Sect was powerful, they didn't have any Nascent Soul Realm experts and lacked the capability to get Sixth Grade Monster Core. <br/><br/>So, this was the first time they saw it and knew that they had to get it at all cost. <br/><br/>\"This monster core comes from the Thunderfang Beast! Renowned for their incredible strength and agility, these formidable creatures produce cores that are rich in spiritual energy. This core is ideal for refining high-level pills or crafting high-level artifacts. Additionally, for cultivators specializing in lightning attributes, it can provide significant assistance in their journey.\" <br/><br/>The intensity in the auction hall shifted dramatically as the value of these cores dawned on the attendees. The auctioneer let the moment linger, giving everyone time to absorb the weight of the next bidding war to come. \"The bidding for this remarkable set of cores will start at 50,000 gold coins!\" Searᴄh the NôᴠeFire.ηet website on Google to access chapters of novels early and in the highest quality.<br/><br/>Immediately, hands shot up, and the room erupted in a frenzy of bids. The price soared as the most powerful sects and clans vied for the precious cores. The starting price doubled within seconds, with bids quickly reaching 100,000 gold coins. <br/><br/>\"120,000!\" Came a shout from the Yunhai Clan's representative. <br/><br/>\"130,000!\" Echoed from the Cloudbreaker Sect, who refused to back down. <br/><br/>The tension in the room thickened, and eyes darted toward the Feng Clan's booth, wondering if they would finally step in to participate. But once again, the Feng Clan remained quiet, observing the bidding war from a distance. <br/><br/>\"150,000!\" <br/><br/>\"160,000!\" <br/><br/>\"170,000!\" <br/><br/>… <br/><br/>The price just kept on increasing. After all, the chance of obtaining Sixth Grade Monster Core was very rare and if they could convert that into Heaven Grade Artifact, the investment could be like 100 times more. <br/><br/>Heaven Grade Artifacts were highly coveted treasures, often out of reach for most. Typically, they were held by cultivators of the Nascent Soul Realm or by sects and clans that had previously possessed such powerful practitioners. <br/><br/>Soon the item's bid was settled at 250,000 gold coins which was given by the Cloudbreaker sect. <br/><br/>As the excitement from the bidding settled, the auctioneer regained the audience's attention, preparing to showcase the next item. <br/><br/>\"Now, esteemed guests, we move on to the next remarkable offering: another Sixth-Grade Monster Core!\" The attendants wheeled out another intricately designed chest, its surface glowing faintly with spiritual energy. As they opened it, a strong surge of power emanated from within, drawing in the eager gaze of every cultivator in the room. <br/><br/>\"This core comes from the fearsome Thunder Wyvern… \" <br/><br/>The auction continued with the Auctioneer auctioning all Feng Chen's Sixth Grade Monster Cores with the average price being 200,000 gold coins. <br/><br/>Feng Chen couldn't help but grin as he watched the clans and sects fiercely competing for his item. <br/><br/>( I got almost a million gold coins just from monster cores. I wonder what those Earth-Grade techniques will fetch me! )\t\t\t\t\t\t</div>", "images": {}, "success": true}