{"id": 94, "url": "https://www.novelhall.com/my-brothers-the-protagonist-good-thing-i-awakened-my-system-33973/15000463.html", "title": "Chapter 95 Third Time Losing", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 95 Third Time Losing</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\t Chapter 95  Third Time Losing Yuan Hao could hardly believe his ears. \"One million?\" He echoed in disbelief, his mind racing. Was one million enough? That was more than enough for him to compete and win the technique. He had at most thought that perhaps Feng Chen would be willing to lend him maybe 500,000 if he really trusted him and had much money. <br/><br/>But one million? <br/><br/>Moreover, the auction was far from over and he himself might need the money to compete for other treasures. <br/><br/>\"Maybe that is not enough? Take 1.5 Million for certainty!\" <br/><br/>Feng Chen considered the strength of the Tianlong Clan and quickly realized that one million might not be enough to compete with them. <br/><br/>He was, of course, prepared to offer 1.5 million, and if Tianlong Yu pushed the bid beyond that, he would have no complaints. <br/><br/>After all, all this money would eventually end up in his pocket anyway. <br/><br/>\"1.5 Million!\" <br/><br/>Once again Yuan Hao was in disbelief. <br/><br/>( Just how much money does Feng Clan Leader have? ) <br/><br/>Yuan Hao thought to himself. Even in his own city, he could barely scrape such an amount in a short time, not to mention carrying it around like Feng Chen. <br/><br/>He even thought Feng Chen might be joking with him until Feng Chen handed him a storage ring containing the money. <br/><br/>Yuan Hao scanned the storage ring and found 1.5 Million just as Feng Chen said. <br/><br/>His heart swelled with excitement, but he quickly composed himself, bowing deeply to Feng Chen. <br/><br/>\"Feng Clan Leader, this is more than generous. I will make sure to honor my word and repay you in full.\" <br/><br/>He never expected that Feng Chen whom he had known for less than a day would be willing to trust him and even lend him such a huge amount. <br/><br/>Feng Chen waved his hand nonchalantly, a faint smile playing on his lips. \"No need for such formality. Just remember our agreement.\" <br/><br/>Yuan Hao nodded and quickly went back to his booth. The auction was moving swiftly after Tianlong Yu immediately raised the bid to one million gold coins, leaving no time for small talk. <br/><br/>Of course, Yuan Hao would remember this favor and make sure to thank Feng Chen once the auction concluded. <br/><br/>But for now, he wanted to quickly win the Mid-Level Earth Grade Technique before anything else. <br/><br/>By the time he returned to the private booth, the auctioneer was already counting down the final moments of the bid, his voice echoing through the hall. <br/><br/>\"1 million and 100,000!\" He immediately bid. <br/><br/>Not only was Tianlong Yu shocked but even his own elders and his children were surprised by the bid. <br/><br/>\"Dad, where did you get the money?\" <br/><br/>Yuan Ziyan asked confusedly. <br/><br/>She had already thought that her dad had already given much of their money to Yunhai Clan. <br/><br/>( Where did Dad find the money to compete with the Tianlong Clan? ) <br/><br/>\"Hehe… I will tell you later! For now, I want to focus on the auction.\" <br/><br/>Yuan Hao replied. <br/><br/>Yuan Ziyan and others didn't want to disturb Yuan Hao and kept their doubts in their heart. <br/><br/>They also knew what this technique meant for the clan and no matter how Yuan Hao did it, they were happy that they got the chance to obtain this Mid-Level Earth Grade Technique. <br/><br/>The auctioneer's voice echoed through the hall once more. <br/><br/>\"1 million and 200,000!\"  Searᴄh the novel(F~)ire.net website on Google to access chapters of novels early and in the highest quality.<br/><br/>\"1 million and 300,000!\" <br/><br/>As soon as Tianlong Yu bid, Yuan Hao also did the same and directly increased the bid by 100,000 gold coins. <br/><br/>Tianlong Yu's eyes twitched, his smug expression faltering as Yuan Hao continued to raise the bid effortlessly. The room was buzzing, and even those who weren't actively participating in the bidding were intrigued by the sudden turn of events. <br/><br/>\"1 million and 400,000!\" Tianlong Yu gritted his teeth and raised his bid once again, his frustration evident. He couldn't afford to lose face a third time. Even if he didn't want to pay for the technique itself, he had to pay for his face. <br/><br/>After all, losing once was acceptable, losing twice could be understandable with Icy Veil Sect, but losing for a third time? <br/><br/>Wouldn't he be mocked? He might become known as the one who always fought for second place. <br/><br/>So, even if he was going over the budget, this time, he refused to back down. <br/><br/>\"1 million and 500,000!\" <br/><br/>Yuan Hao's voice was firm and resolute, his bidding relentless. The crowd watched in anticipation, their eyes darting between the two men locked in a fierce battle for the Mid-Level Earth Grade Technique. Murmurs rippled through the hall, and many wondered just how rich Yuan Clan was. <br/><br/>Tianlong Yu clenched his fists. He didn't really want to lose for the third time but the price was too high. \"Clan Master, please stop!\" \"We can't afford to offer such a high price.\" \"It looks like Yuan Hao is determined to win this. Maybe we should just give up.\" \"Who knows? There might even be another Earth Grade Technique up for auction tonight!\" <br/><br/>... <br/><br/>The Tianlong Clan's elders immediately began dissuading Tianlong Yu seeing that he was refusing to give up. <br/><br/>Tianlong Yu who didn't want to give up had to. After all, even if he was the clan leader, he wasn't someone who could take out such a huge amount without the consent of the clan's elders. <br/><br/>A bitter taste filled his mouth as the auctioneer began the countdown. <br/><br/>\"1 million and 500,000 going once… going twice…\" <br/><br/>\"Sold! Congratulations to Tianlong Clan for winning the Shadowed Blades Technique for 1.5 Million Gold Coins!\" <br/><br/>The auctioneer's gavel struck, finalizing the sale. Yuan Hao felt a wave of relief and joy wash over him as he secured the win. <br/><br/>Shadowed Blades was his, and with it, the Yuan Clan had secured a powerful martial art technique that could potentially elevate them to new heights. <br/><br/>As Yuan Hao collected his prize, he couldn't help but glance toward Feng Chen, who gave a slight nod of acknowledgment. There was no doubt that without Feng Chen's help, this victory would have been impossible. <br/><br/>Tianlong Yu stood still, his heart filled with anger and frustration. <br/><br/>He who should have been the dominant force in the Qingyun City was time and again humiliated by others. <br/><br/>And once more, he couldn't even curse at the Yuan Clan because they were equally as powerful as them. <br/><br/>Additionally, Yuan Ziyan is one of the core disciples of the Mystic Flame Sect, and their relationship with the Mystic Flame Sect is greater than his relationship with Spirit Wind Palace. <br/><br/>For the third time, he was forced to smile and congratulate the opponent who had beaten him yet again.\t\t\t\t\t\t</div>", "images": {}, "success": true}