{"id": 97, "url": "https://www.novelhall.com/my-brothers-the-protagonist-good-thing-i-awakened-my-system-33973/15023594.html", "title": "Chapter 98 Central Domain", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 98 Central Domain</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\t Chapter 98  Central Domain After the auction concluded, Feng Chen made his way to the auctioneer to collect the remaining funds owed to him. <br/><br/>Once again, he simply mentioned he had something to take care of and left, once again leaving Feng Yun and the others in a state of confusion. <br/><br/>\"Where is he going now?\" Feng Yun muttered to himself. He exchanged glances with the others, who seemed equally confused. Earlier that morning, he had mentioned having something to take care of and disappeared without explanation, and now he was doing the same thing again. <br/><br/>Only Feng Zhenshan has an idea. After all, he has already seen the ridiculous amount of money that was given to him by the workers previously. <br/><br/>With his intelligence, it isn't hard to know just how Feng Chen might have gotten that money.  Searᴄh the NovelFire.net* website on Google to access chapters of novels early and in the highest quality.<br/><br/>Although it did make him wonder, just where Feng Chen got those items that he sold. <br/><br/>*** <br/><br/>Feng Chen soon arrived at the auction office where he sold his items. He caught sight of the auctioneer and approached him. <br/><br/>The auctioneer, still dressed impeccably in his formal robes, greeted Feng Chen with a respectful bow. <br/><br/>\"Clan Leader Feng, congratulations on securing such fine items today. How may I assist you further?\" The auctioneer asked with a smile, though his eyes couldn't hide a hint of admiration for Feng Chen's spending power. <br/><br/>Feng Chen didn't waste time with pleasantries. \"I've come to settle the accounts and retrieve the remaining funds!\" The auctioneer nodded quickly. \"Of course, of course. The sum you are owed is ready for collection.\" He gestured toward a set of storage rings laid out on a velvet tray. \"I've had our staff prepare the remaining 1.5 million gold coins as instructed. Since this is your first time at our auction, we decided to take no commission and those storage rings could be considered a gesture of goodwill from us.\" <br/><br/>Feng Chen nodded slightly, appreciating the gesture. \"If so, then thank you. I will remember your generosity.\" <br/><br/>The auctioneer bowed once more. \"It's a pleasure doing business with the Feng Clan. Should you need anything else, do not hesitate to reach out to us.\" <br/><br/>\"Sure!\" <br/><br/>Feng Chen turned and left the room, his footsteps echoing down the hall. Feng Chen had just left when the manager rushed into the office moments later. <br/><br/>\"Is the Feng Clan Leader gone?\" <br/><br/>The manager asked hastily. <br/><br/>\"Yes!\" <br/><br/>The auctioneer remarked, taken aback by the manager, who appeared to have rushed in. <br/><br/>Although just the manager of Qingyun City's Azure Sky Chamber Of Commerce branch, he still held quite a bit of status and could be comparable to that of elders from Sect. <br/><br/>Furthermore, he was in the Grand Qi Condensation Realm, making him quite powerful, so it was surprising to see him in such a state. <br/><br/>\"Looks like I was a few seconds late.\" The manager was visibly regretful. <br/><br/>The auctioneer, noticing the manager's distress, furrowed his brow and inquired. \"Why the rush? Is there something important regarding the Feng Clan?\" <br/><br/>The manager straightened up, his expression shifting from regret to seriousness. \"You could say that. The Feng Clan's recent activities have been the topic of discussion among the more influential factions in the capital. They're gaining a reputation that we need to pay attention to.\" <br/><br/>\"Even the head office said to me to pay attention to them during the Eastern Gathering.\" <br/><br/>\"So, it wasn't just because of the Feng Clan selling those items?\" The auctioneer echoed, intrigued. \"Of course, that is also one of the factors. Although the Feng Clan Leader didn't tell me the real reason, it is for sure that they must have hunted those monsters.\" <br/><br/>\"But… those are Sixth Grade Monsters! Do they even have the capability?\" <br/><br/>The auctioneer asked in surprise. After all, Nascent Soul Realm cultivators are required for that and he didn't think that the Feng Clan would have one. <br/><br/>\"Maybe! Though I am more inclined to think that they have the help from outsiders.\" <br/><br/>The manager replied. He also didn't think that the Feng Clan had Nascent Soul Realm Cultivators. <br/><br/>With a clan having only one Three Elements Divine Cultivator, how could he expect them to have a Nascent Soul realm Cultivator? <br/><br/>\"Outsider?\" <br/><br/>\"Yes. Feng Kai's wife has an unknown background and it is said that she is from the Central Domain. If the information that I got is true then her clan might be helping the Feng Clan.\" <br/><br/>\"Central Domain… \" <br/><br/>Azure Sky Empire was situated in the Eastern Domain which is relatively weaker as compared to Central Domain. <br/><br/>The central domain was filled with powerful talents and cultivators, unimaginable to those living in the Eastern Domain. While Nascent Soul realm cultivators were the peak of the strength in Azure Sky Empire, it was overflowing in the Central Domain with some talent even reaching that realm before the age of 30. <br/><br/>If the Feng Clan had ties with a powerful family from the central domain, it would indeed have been easy to have those Sixth Grade Monster Cores. And that would also explain why they were fearless when offending the Mystic Flame Sect and Spirit Wind Palace. <br/><br/>After all, while they might be dominant in the Azure Sky Empire, in front of the forces from the Central Domain, they are nothing more than babies. <br/><br/>\"But that's just speculation! We still need to investigate more to find out. And also, this is a secret, so don't spread it.\" <br/><br/>The auctioneer nodded while still thinking about the manager's implication. <br/><br/>***** <br/><br/>Feng Chen emerged from the auction hall, a rare smile tugging at his lips. He looked for Feng Yun and others and soon found them along with the Yuan Clan. <br/><br/>??? <br/><br/>Feng Chen didn't know why they were together but he knew it was not because Yuan Hao wanted to repay his debt. <br/><br/>After all, even for the Yuan Clan, getting all that money in a single day would be impossible. They would need to travel to their own city and then bring the money back to Qingyun City. This would take quite a bit of time. <br/><br/>Yuan Hao, after seeing Feng Chen, immediately walked towards him. Followed by others who were a tad bit later than Yuan Hao. <br/><br/>\"Haha… Feng Clan leader, thanks to you, I managed to get this Earth-Grade Technique. I am truly thankful to you.\" <br/><br/>Yuan Hao said. Thinking about Feng Chen's generosity, he couldn't help but be thankful. <br/><br/>Others listened to their conversation in shock. After all, not everyone knew the transaction between Feng Chen and Yuan Hao. Yuan Ziyan finally realized just how her father got the money to compete with the Tianlong Clan. <br/><br/>She never expected that the Feng Clan which she subconsciously looked down upon would be so wealthy. <br/><br/>Lending millions of gold coins isn't something that even her clan could do. Feng Yun was also surprised at just how his brother had gotten so rich. <br/><br/>A few months back, they were so poor and had to fight with Yan Family for dominance in the pill market of Misty Vale City. <br/><br/>This market at most might be worth hundreds of thousands of gold coins. And for that, they fought hard and the Yan Clan even called upon Zhou elders for help. <br/><br/>And now, here they were, lending money to one of the strongest clans in the Eastern Region. <br/><br/>( Just how much is my brother hiding? ) <br/><br/>Feng Yun thought. <br/><br/>Even his master said to not worry about any danger that his clan might face as his brother seemed capable enough to handle them. <br/><br/>He asked whether it included the Mystic Flame Sect and his master said yes. <br/><br/>He asked how he knew but he refused to elaborate and just told him to focus on getting stronger. <br/><br/>As for the dangers their clan might face, as long as his brother was around, he didn't need to worry. <br/><br/>That made him wonder just what his master knew and just how powerful his brother was. <br/><br/>Powerful enough that even the Mystic Flame Sect couldn't threaten the Feng Clan? <br/><br/>It is true that he has never seen his brother struggle or utilize his full power since he was little. And that also included when he was fighting with Zhou Tianhua. <br/><br/>With the money that his brother has spent, this also shows that he was wealthy enough to be considered one of the richest in the Eastern Region. <br/><br/>\"Looks like I don't need to worry about leaving the clan!\" <br/><br/>Feng Yun muttered to himself. <br/><br/>While people were surprised and shocked by what Yuan Hao said, Feng Chen simply ignored their reaction. <br/><br/>\"No need to thank me.\" <br/><br/>Feng Chen said. <br/><br/>Indeed, he didn't think that he would need his thanks. For one, Yuan Hao will give him 10 % more which is equivalent to 150,000 gold coins for simply lending the money. <br/><br/>Secondly, if not for him, the price of the Earth Technique might have been settled for 1 million gold coins. <br/><br/>In total, Yuan Hao has made over 650,000 gold coins in total. So, there was no need for thanks. <br/><br/>Rather he might need to thank him!\t\t\t\t\t\t</div>", "images": {}, "success": true}