{"id": 93, "url": "https://www.novelhall.com/my-brothers-the-protagonist-good-thing-i-awakened-my-system-33973/15000462.html", "title": "Chapter 94 Is One Million Enough?", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 94 Is One Million Enough?</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\t Chapter 94  Is One Million Enough? The Icy Veil Sect similarly received congratulations from others just like the Yunhai Clan. <br/><br/>Tianlong Yu did the same and congratulated them. Today, he felt like nothing was going his way and he even had to congratulate his opponent after losing. <br/><br/>\"Ladies and gentlemen! I hope you are all ready for the next item.\" He announced a glint of excitement in his eyes. He already knew just how much of a shock they would be in for when they knew what the next item was. <br/><br/>\"For our next item, we present yet another Mid-Level Earth-Grade Martial Art Technique!\" <br/><br/>The audience buzzed with disbelief once again. After the bidding frenzy for Frostbound Shadows, many believed the auction was done with high-value items just to be proved wrong once again. \"This technique is known as Shadowed Blades, a unique martial art that melds stealth and precision, allowing its user to move unseen and strike with lethal accuracy.\" <br/><br/>The auctioneer gestured dramatically as a beautiful scroll, embellished with swirling shadows and glistening edges, was unveiled to the crowd. Its aura seemed to pulse with an enticing, dark energy, drawing the eyes of all who beheld it. <br/><br/>Gasps and murmurs cascaded through the hall, echoing off the walls like ripples on water. <br/><br/>\"Another one?\" \"Are we really witnessing yet another Mid-Level Earth-Grade Technique? What's happening here?\" <br/><br/>\"How is it possible?\" \"No auction has ever had this many Earth Grade Martial Arts in one night!\" <br/><br/>… <br/><br/>Expressions of disbelief painted the faces of everyone in the room. They had truly witnessed the extraordinary might of the Azure Sky Chamber of Commerce, which had managed to auction not just one, but three Earth-Grade Martial Art Techniques in a single event. <br/><br/>It was a rare occurrence to even see one Earth-Grade Technique sold in an entire year, let alone three at once during one auction. <br/><br/>Of course, Clans and Sects were once again determined to win the Technique. It was especially true for Tianlong Yu who has consecutively lost 2 times. <br/><br/>He believed that this time, he would definitely win as both Icy Veil Sect and Yunhai Clan were out of the competition. <br/><br/>\"Ladies and gentlemen! The starting bid for Shadowed Blades will begin at 200,000 gold coins. Bids can be raised in increments of no less than 5,000 gold coins!\" <br/><br/>\"1,000,000!\" Tianlong Yu didn't wait for anyone to bid and directly raised the bid to 1 million. At this moment, he was determined to win and regain his face. It was a significant sum, but he believed it was worth every coin for the chance to secure the Mid-Level Earth Grade Technique. <br/><br/>Seeing no response, Tianlong Yu seized the moment, looking around at the various clans with an arrogant smug. <br/><br/>\"Is there anyone who would like to raise the bid?\" <br/><br/>The auctioneer waited for a minute to see whether others would be interested in competing but saw no one. <br/><br/>\"1 million gold coins going once... going twice...\" <br/><br/>Just as he prepared to call it sold, a voice broke through the murmurs. \"1 million and 100,000!\" \"WHAT?\" <br/><br/>Tianlong Yu exclaimed, a mix of surprise and frustration evident in his voice. <br/><br/>( Who dared to bid against me? ) <br/><br/>He thought as he looked in the direction where the voice came. <br/><br/>\"Yuan Hao?\" <br/><br/>He said in surprise. <br/><br/>Earlier, he was sure that the Yuan Clan had no more funds. He already noticed that they were one of the clans who lent the money to the Yunhai Clan. <br/><br/>\"How is this possible? Did Yuan Hao bring everything from his clan's treasury?\"  Searᴄh the nôvelFire.net website on Google to access chapters of novels early and in the highest quality.<br/><br/>He muttered but knew that it was impossible. <br/><br/>He would have done this if he knew that this kind of treasure would appear in the auction but there was little to no chance when Yuan Hao didn't know that. <br/><br/>Although his expression wasn't looking good, he didn't want to lose again and directly raise the price again. <br/><br/>\"1 million and 200,000!\" <br/><br/>\"1 million and 300,000!\" <br/><br/>Yuan Hao immediately raised the bid again. It was as if he had no problem with money at all. <br/><br/>This left Tianlong Yu both shocked and bewildered. <br/><br/>\"Hehe… I will surely get this technique no matter the price!\" <br/><br/>Yuan Hao muttered confidently, completely dismissing any trace of his earlier regret about lacking funds. <br/><br/>As for how he got the money, well he also borrowed it. <br/><br/>When he was regretting not getting the Mid-Level Earth Grade Technique due to his poor decision, the auctioneer announced another Mid-Level Earth Grade Technique. <br/><br/>Moreover, this technique was very compatible with his clan which mainly uses blades as their main weapon. <br/><br/>He knew that he had to get this technique no matter what. <br/><br/>But how? <br/><br/>Of course, he thought of borrowing money like the Yunhai Clan did. <br/><br/>But he knew that such a huge sum of money wouldn't be gotten from any clan. <br/><br/>Furthermore, even if those clans had the money, they wouldn't spend it, as they still needed it to bid on treasures for themselves. <br/><br/>He almost lost hope when he saw Feng Chen nonchalantly watching the auction. <br/><br/>Yuan Hao thought of the moment when Feng Chen bid for Skyfire Feather. Although he didn't know why, he felt like the Feng Clan was rich; he didn't seem to care about the money he spent when he brought that Skyfire Feather. <br/><br/>Moreover, Feng Chen also didn't seem interested in buying the Mid-level Earth Grade Martial Art Technique. <br/><br/>With nothing to lose, Yuan Hao made up his mind to ask Feng Chen whether he could lend him some money for the time being. <br/><br/>\"You need to borrow money. Why?\" <br/><br/>Feng Chen asked confusedly. He was surprised by Yuan Hao's request but didn't immediately deny it. <br/><br/>Yuan Hao proceeded to explain about his clan and how the technique was compatible with his clan. <br/><br/>\"Feng Clan Leader, I promised you that I will pay you back. And I am willing to pay 10 % more for the amount you have given me.\" <br/><br/>Yuan Hao said. <br/><br/>\"Hmmm… \" <br/><br/>Feng Chen thought for a moment and made his decision. <br/><br/>\"Alright! <br/><br/>Anyway, with Yuan Hao competing for his item, it will only drive up the price of the item and the money he gets. <br/><br/>Moreover, getting 10 % more money could be considered as icing on the top. <br/><br/>And he didn't need to worry about Yuan Hao paying back. Because if he did, he didn't mind wiping out the Yuan Clan. <br/><br/>Yuan Hao was elated when he heard Feng Chen agree. \"Wait for a bit!\" <br/><br/>Feng Chen said and then instructed Feng Zhenshan to go to the auctioneer and ask for the money that he got. <br/><br/>Of course, this confused the Grand Elder Zhenshan but he didn't think much and did what Feng Chen asked for. <br/><br/>In a matter of seconds, Grand Elder Feng Zhenshan returned with a dumbfounded expression. <br/><br/>He handed over the storage ring to Feng Chen while having a blank expression. <br/><br/>Feng Chen smiled when he got the storage ring filled with the money that he made from selling his items. <br/><br/>As for Feng Zhenshan's expression, Feng Chen knew that he must have been shocked by the money. <br/><br/>There were approximately 4.5 million Gold Coins. He then turned around and asked. <br/><br/>\"Is One Million Enough?\"\t\t\t\t\t\t</div>", "images": {}, "success": true}