{"id": 98, "url": "https://www.novelhall.com/my-brothers-the-protagonist-good-thing-i-awakened-my-system-33973/15023595.html", "title": "Chapter 99 Making Feng Clan The Strongest", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 99 Making Feng Clan The Strongest</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\t Chapter 99  Making Feng Clan The Strongest Yuan Hao smiled, seemingly unaware of Feng Chen's indifferent thoughts, and clasped his hands again in thanks. \"Still, I owe you a debt of gratitude. If there's ever anything the Yuan Clan can do to return the favor, don't hesitate to ask.\" <br/><br/>Feng Chen merely nodded. He didn't think much about it. <br/><br/>On the other hand, Grand Elder Feng Zhenshan and Feng Zhilan couldn't be happier when Yuan Hao said those words. <br/><br/>To them, it felt as if they had forged a valuable connection with one of the strongest clans in the Eastern Region, a potential ally for the Feng Clan, especially with the many enemies they had made. <br/><br/>They even speculated that Feng Chen had orchestrated everything, fully aware that it would lead to this outcome. <br/><br/>In reality, however, Feng Chen's decision was simply driven by the desire to make more money. <br/><br/>As a Nascent Soul Realm cultivator, it made little difference to him whether he allied with the Yuan Clan or not. After all, if there was something beyond his ability to handle, it was unlikely the Yuan Clan could manage it either. That said, he would naturally prefer making friends over enemies. <br/><br/>Yuan Ziyan, still processing the new information she had learned about the Feng Clan, remained silent. Her sharp gaze stayed fixed on Feng Chen as if trying to reconcile the details from her sect with what she was witnessing firsthand. <br/><br/>Previously, she has said many negative things to Feng Yun which she thought must have been known by Feng Chen. <br/><br/>Now that her father was receiving help from their clan, she couldn't help but feel a deep sense of embarrassment, as if she had thrown stones at a house only to find herself seeking shelter beneath its roof. <br/><br/>\"Feng Clan Leader, I won't disturb you further. We'll meet again tomorrow.\" <br/><br/>Yuan Hao said. <br/><br/>Feng Chen nodded. <br/><br/>\"Feng Yun, don't think I approve of you yet!\" <br/><br/>Yuan Ziyan called out as she hurried to follow her father. She wanted to say more but held back, feeling too embarrassed after receiving help from the Feng Clan. <br/><br/>\"TSK!\" <br/><br/>Feng Yun just shrugged off her words. He wasn't seeking her approval, nor did he need it. <br/><br/>And no matter how much she denies it, she just refuses to believe it. <br/><br/>\"Today, you all can explore Qingyun City.\" He said, pulling out a pouch heavy with gold. \"Take this.\"  Sёarᴄh the NôᴠeFire.ηet website on Google to access chapters of novels early and in the highest quality.<br/><br/>He handed each of them 10,000 gold coins, the weight of the sum resting in their palms with a satisfying clink. It was more than enough for them to buy almost anything they desired, short of something extraordinary like an artifact. Feng Chen knew it would give them a sense of freedom and a chance to enjoy the bustling city without restraint. <br/><br/>In any case, this was their first visit to Qingyun City, or to any city of this size. He wanted to give them the opportunity to explore and enjoy the experience. <br/><br/>Qingyun City was also fairly safe and moreover, they also had the token with his soul fragment. So, as long as they crush it, he would immediately know that they were in danger. <br/><br/>The younger clan members exchanged glances, excitement flickering in their eyes. <br/><br/>\"And Xiaoyu'er, Jianhong'er, Liang'er—remember, my promise still stands. Anything you want, I'll buy it for you.\" He added. The three of them hadn't found anything they desired at the auction, so this was a welcome offer. <br/><br/>\"Thank you, Family Head!\" They responded in unison, their voices bright with enthusiasm. Their joy was infectious, but there was also an undercurrent of humility in the way they held themselves. They were grateful, but they knew that 10,000 gold coins were already more than sufficient for most things they might desire. After all, they were already equipped with Earth Grade Artifacts, something most cultivators could only dream of. Artifacts were the last thing on their minds. <br/><br/>Feng Chen nodded to them and, without another word, disappeared into the crowd, leaving his clan members to enjoy their newfound freedom. <br/><br/>As he walked through the familiar streets of Qingyun City, a wave of nostalgia washed over him. The vibrant energy of the city stirred memories long buried. It was not his first time visiting Qingyun City and he had once visited with his parents. <br/><br/>His footsteps slowed as he let his mind drift back to a time when he was just a boy, following his father through these very streets. He remembered the way Feng Kai's confident stride filled him with a sense of safety, how small he felt beside his father, and the laughter they shared over meals. <br/><br/>His father had taken him to one of the stands to eat dumplings. <br/><br/>\"Father,\" young Feng Chen had said, his eyes wide with excitement as the waiter brought out a steaming basket, \"Are these really the best dumplings in Qingyun City?\" <br/><br/>His father had been raving about a stand known for having some of the best dumplings, insisting that Feng Chen had to try them. <br/><br/>However, Feng Chen couldn't help but feel skeptical, especially after seeing the state of the place. It was merely a stand, and his doubts only grew as he took in the surroundings. <br/><br/>Feng Kai chuckled, ruffling his son's hair, seemingly knowing what he was thinking. \"Don't just judge a book by its cover! Taste it and I am sure that you will like it!\" <br/><br/>With that, they each took a dumpling, the delicate skin giving way to a burst of savory filling. <br/><br/>Feng Chen's skepticism melted away with the first bite. The flavor was an explosion of spices and juices, perfectly balanced, with the meat tender and flavorful. <br/><br/>\"Wow, this is amazing!\" He exclaimed, his eyes lighting up as he devoured the dumpling. <br/><br/>His father smiled, satisfaction gleaming in his eyes and even looked proud as if he was the one who made it. <br/><br/>\"See? I told you!\" <br/><br/>Feng Kai said. <br/><br/>Feng Chen nodded, savoring another dumpling. <br/><br/>\"Remember, Chen'er!\" His father suddenly said as they ate. \"The world outside our clan is vast and often unforgiving. With your talent, you will eventually become the clan leader of the Feng Clan. You must learn to look after not just yourself but also those around you. It might be hard but you must do it\" <br/><br/>Feng Chen casually nodded without thinking much about it. After all, cultivators live for a very long time compared to Earth and he thought it would be ages before he could become the clan leader. <br/><br/>But… <br/><br/>Sigh! <br/><br/>( Perhaps Father has already anticipated that such days would come. ) <br/><br/>Feng Chen thought as he looked at himself who had to become the clan leader at the age of 20. <br/><br/>Looking back, Feng Chen couldn't help but feel that his father's words were unusually serious and also out of place. But now, since all of this had happened, he couldn't help but feel like his father might have foreseen such a situation. However, at that time, even if he was a reincarnated person, he couldn't really understand those words. <br/><br/>Perhaps he was still naive and thought that everything would be fine as it were. <br/><br/>In a moment of youthful bravado, he had even boasted, \"Don't worry, Dad! I will lead the Feng Clan to become the strongest in the Azure Sky Empire!\" <br/><br/>Feng Kai's laughter echoed in his mind, full of warmth and encouragement. \"That's the spirit, Chen'er! But remember, you don't need to shoulder everything by yourself. Trust your friends, trust your family, and trust your clan. They will surely help you in time of need!\" <br/><br/>Though those words were nothing more than just some boastful words. <br/><br/>As he took the mantle of clan leader, he was barely able to even make Feng Clan the strongest in the Misty Vale City. <br/><br/>If not for the System, perhaps he might not have been able to even protect his clan. <br/><br/>But things were different now with the System and his increased strength. The Feng Clan has gone through dramatic changes and it is on the path to becoming stronger just as he had once boasted. <br/><br/>By then, maybe he could also leave the Feng Clan and go find his parents. <br/><br/>But he quickly shook his head. For now, it was important to focus on the present and make the Feng Clan strong, stronger than the Mystic Flame Sect.<br/><br/>\"I think it was somewhere around here…\" He searched for the restaurant, recalling the rich scent of dumplings filling the air. <br/><br/>And then he spotted it. \"Fu Dumpling Shop!\" He whispered, the name stirring something warm inside him. <br/><br/>The restaurant had changed. It wasn't the small, humble stand he remembered. Now, it stood proudly with a polished exterior, its success evident in the stream of customers lining up outside. <br/><br/>Feng Chen chuckled softly. Of course, with dumplings that delicious, it wasn't surprising the shop had thrived. <br/><br/>As he stepped inside, the fragrant aroma of fresh dumplings hit him, just as it had all those years ago, enveloping him in a wave of comforting memories. He smiled, thinking of his father's words. \"Don't worry Father, I will definitely keep my word!\t\t\t\t\t\t</div>", "images": {}, "success": true}