{"id": 91, "url": "https://www.novelhall.com/my-brothers-the-protagonist-good-thing-i-awakened-my-system-33973/14993712.html", "title": "Chapter 92 High-Level Earth Grade Technique!", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 92 High-Level Earth Grade Technique!</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 92  High-Level Earth Grade Technique! Feng Chen remained composed, though an air of quiet satisfaction lingered around him as he observed the frantic bidding for the monster cores he had placed in the auction. The sixth-grade monster cores were treasures in their own right, but what excited him even more was the anticipation of what was to come. <br/><br/>After all, among all the items he had auctioned, Monster Cores were the least valuable. <br/><br/>As the bidding for the final monster core concluded, the auctioneer took a moment to gather himself before stepping back to center stage, his voice rising with renewed vigor. <br/><br/>\"Esteemed guests, we've had the honor of presenting some truly remarkable items thus far, but now we bring to you something that transcends ordinary treasure—a High-Level Earth-Grade Martial Art Technique!\" <br/><br/>A hush fell over the crowd as the auctioneer gestured toward a beautifully crafted box, which was carried forward by two attendants. The box itself appeared ancient, adorned with intricate patterns and inscriptions, radiating a faint but potent aura of spiritual energy. <br/><br/>\"This is a High-Level Earth-Grade Martial Art Technique known as 'Tempest's Wrath,'. It is said to harness the power of wind and storm, allowing its wielder to control the very elements themselves.\" <br/><br/>Gasps rippled through the crowd. High-Level Earth-Grade Martial Art Techniques were far rarer than weapons of the same grade, often passed down within clans and sects for generations. Even the Icy Veil Sect possessed only one or two, while the Cloudbreaker Sect's highest martial art was merely a Mid-Level Earth-Grade Technique. <br/><br/>But even that made the Cloudbreaker Sect one of the strongest Sects in the Eastern Region. <br/><br/>To see a High-Level Earth Grade Technique being auctioned was practically unheard of, and the excitement in the room was palpable. <br/><br/>\"I can't believe this!\" <br/><br/>\"Who in their right mind would sell a High-Level Earth-Grade Technique? Don't they realize that martial techniques like these can shape the very strength of a clan or sect?\" \"With a technique like that, they could easily establish a sect that could rise to become one of the most powerful.\" <br/><br/>\"Even if I go bankrupt, I must get this technique!\" <br/><br/>… <br/><br/>The crowd's eyes burned with desire, and each person prepared to sacrifice everything they had to claim this treasure. Among them were the Icy Veil Sect and Cloudbreaker Sect, fiercely ready to compete alongside the Yuan, Tianlong, and Yunhai Clans. <br/><br/>\"Grand Elder Xun Haiyang, we must get this!\" <br/><br/>One of the elders of Cloudbreaker Sect said to their group leader. <br/><br/>\"Hmmm!\" <br/><br/>Grand Elder Xun also nodded. He knew the significance of getting such high-level martial arts. With this, their whole sect would become stronger. They might also become one of the Top 5 strongest Sect in Azure Sky Empire with such powerful Martial Art. <br/><br/>No matter the price, he knew that he had to obtain this. <br/><br/>\"Don't worry, elders! Today, even if I must empty my personal pocket, I will make sure to get this Martial Arts.\" <br/><br/>Grand Elder Xun Haiyang said, showing his determination to contribute to the sect without thinking about his personal loss. <br/><br/>\"Grand Elder. Don't worry, We will also contribute our own money as well! We will definitely win this!\" <br/><br/>Others were also equally willing to give their all. <br/><br/>\"Haha… I never expected Azure Sky Chamber Of Commerce to sell such High-Level Martial Arts in our Qingyun City.\" <br/><br/>Tianlong Yu said happily. <br/><br/>This was his home ground and he had access to all his clan's wealth. Today, even if he were to mortgage everything he owned, he was determined to get this technique. <br/><br/>Given the surprising nature of the item, he was confident that even the wealthiest Yunhai Clan wouldn't have enough funds to compete with him. <br/><br/>Other elders from the Tianlong Clan were also smiling and laughing as if they had already won. <br/><br/>On the other hand, there wasn't much excitement on the Feng Clan's side. <br/><br/>With them having access to many Heavenly Grade Techniques, there was no appeal to Earth Grade Techinque at all. <br/><br/>They don't even have enough time to learn all the Heavenly Grade Techniques that they have. What would they do with the Earth Grade Technique? Waste their time? <br/><br/>Feng Chen leaned back slightly, his lips curling into a small smile. He knew that this would be the centerpiece of the auction, the item that would draw in the most intense competition. <br/><br/>\"The starting bid for this Martial Art Technique scroll will begin at 300,000 gold coins! Bids can be raised in increments of no less than 10,000 gold coins.\" <br/><br/>The auctioneer declared an astonishing amount as the starting bid. However, the true value of this technique was in the millions of gold coins, making even the starting bid of 300,000 gold coins quite low. <br/><br/>For a moment, there was silence as the attendees processed the weight of the offering. Many had already given up after hearing the starting price. After all, even for the top ten powerful clans in the Eastern Region, this was an astronomically large sum. <br/><br/>So clans like Bai Clan had already given up and just watched the bid in envy. <br/><br/>\"500,000!\" Yuan Hao shouted. <br/><br/>\"600,000!\" No sooner did Yuan Hao bid when Icy Veil Sect increased the bid. <br/><br/>\"700,000!\" The Yunhai Clan also entered the fray. <br/><br/>\"Hehe… You think you all can get High-Level Earth Grade Technique for such a low price? 1,500,000!\" Grand Elder Xun raised the bid more than double, his eyes gleaming with determination. <br/><br/>While one might expect to be stunned if someone suddenly doubled the bid, that was not the case here. <br/><br/>\"2,000,000!\" <br/><br/>After the 1,500,000 bid was called out by the Cloudbreaker Sect, Tianlong Yu immediately increased the bid to 2 million. <br/><br/>Even that wasn't for too long. <br/><br/>\"2,100,000!\" <br/><br/>Yunhai Clan increased the price yet again. <br/><br/>\"2,200,00!\" <br/><br/>Tianlong Yu also didn't back down. <br/><br/>Feng Chen watched the unfolding scene with growing amusement. The more they fought over the technique, the higher the price climbed. <br/><br/>Even he was taken aback when the price soared to 2 million gold coins. It became clear he had significantly underestimated the value of a High-Level Earth-Grade technique. <br/><br/>\"2,300,000!\" The Yunhai Clan refused to back down, clearly determined to claim this technique for themselves. <br/><br/>\"2,500,000!\" The Cloudbreaker Sect countered almost immediately, their elder's voice steady, but his eyes betraying the high stakes. <br/><br/>This was the maximum he could bid within his budget. Having pooled together all of his and the elders' resources, this was the amount they had managed to gather. <br/><br/>\"2,600,000!\" <br/><br/>Tianlong Yu immediately called out. <br/><br/>Grand Elder Xun's expression darkened as the bid surpassed what they could afford. They no longer had any way to compete for the High-Level Earth-Grade technique. <br/><br/>They could only silently lament that the Azure Sky Chamber of Commerce hadn't mentioned the availability of such a high-level technique prior. Otherwise, with their sect's treasury, there was no way they would have missed the opportunity to secure this technique. <br/><br/>\"2,700,000!\" <br/><br/>\"2,800,000!\" <br/><br/>… <br/><br/>Even after reaching such a staggering amount, the bidding remained intense; however, gradually, most clans began to withdraw. <br/><br/>The last two clans to bid against one another were the Yunhai Clan and the Tianlong Clan. <br/><br/>Finally, after several rounds of intense bidding, the technique was won by the Yunhai Clan for a staggering 3,500,000 gold coins. <br/><br/>It seems like Tianlong Yu has greatly underestimated the Yunhai Clan who made fortunes and connections with their alchemy. <br/><br/>For them, money was insignificant compared to the chance to grow stronger and they were really ready to do anything to get this Martial Art. <br/><br/>Even if they lacked funds, they could easily secure loans from other clans due to their high credibility. In exchange for lending the money, they also promised to refine high-ranking pills for free, a tempting offer few could refuse. <br/><br/>It's important to understand that the cost of refining a pill often reaches hundreds of thousands of gold coins. Moreover, for Rank-4 and higher-level pills, money alone isn't enough—securing a Fourth Grade Alchemist's services requires much more than just wealth. <br/><br/>Yuan Hao also ended up loaning 500,000 Gold Coins to the Yunhai Clan. The promise to refine a 4th ranked pill for free was a huge win for him. <br/><br/>And he wasn't able to compete with them anyway, so why not? <br/><br/>Moreover, with Yunhai Clan's wealth, he didn't need to worry about them not having enough money to pay him back. Thus, he had no hesitation in lending them his money. The same was true for other clans, who also willingly extended loans to the Yunhai Clan. <br/><br/>\"Sold!\" The auctioneer announced, his voice cutting through the tension as the crowd erupted into applause. The Yunhai Clan representatives wore expressions of both triumph and relief. <br/><br/>On the other hand, Tianlong Yu has an expression of having eaten shit. <br/><br/>He, who thought that the Yunhai Clan or other clans wouldn't have enough money to compete with him, never thought that the Yunhai Clan would borrow money from others. Sёarch* The Novёlƒire.n(e)t website on Google to access chapters of novels early and in the highest quality.<br/><br/>Moreover, those clans were also willing to lend such a huge amount to the Yunhai Clan though he did not understand the benefit of it. <br/><br/>He would have also lent the money if Yunhai promised to refine the 4th-ranked pill for free. <br/><br/>However, since he was competing against the Yunhai Clan and ultimately lost to them because of this, he couldn't help but grumble about why anyone would lend such a large sum to the Yunhai Clan. <br/><br/>\"Dammit!\" <br/><br/>Tianlong Yu gritted his teeth in frustration. If it had been any other clan, he would have undoubtedly threatened them and demanded they surrender such a valuable technique. However, this was the Yunhai Clan, whose power was on par with the Tianlong Clan and whose connections were even more extensive. Moreover, they also relied on the Yunhai Clan for pills, leaving him unable to voice his dissatisfaction.\t\t\t\t\t\t</div>", "images": {}, "success": true}