{"id": 95, "url": "https://www.novelhall.com/my-brothers-the-protagonist-good-thing-i-awakened-my-system-33973/15012436.html", "title": "Chapter 96 Feng Chen'S Shopping Spree!", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 96 Feng Chen'S Shopping Spree!</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\t Chapter 96  Feng Chen's Shopping Spree! Feng Chen watched as his last of his items was auctioned at the price of 1.5 Million Gold Coins. <br/><br/>In total, he would have made around 6 Million Gold Coins from this auction alone. <br/><br/>( Looks like I don't need to worry about money for quite a while! ) <br/><br/>Feng Chen thought. <br/><br/>With this much money, he could definitely bring about a drastic change to the Feng Clan economy. <br/><br/>He was already contemplating renovations for the Feng estate while also considering investments in profitable industries.  seaʀᴄh thё Nôvel(F)ire.nёt website on Google to access chapters of novels early and in the highest quality.<br/><br/>As the auction continued, the atmosphere crackled with excitement. Many even thought that perhaps the next item might also be another Earth Grade Technique. The auctioneer stepped forward with a flourish, holding a small, intricately carved box that shimmered with an ethereal light. \"Next up is the Soul Nourishing Elixir! This precious concoction is said to enhance spiritual energy, heal the mind, and nourish the soul. Bidding starts at 100,000 gold coins!\" <br/><br/>Many were disappointed that the item was not another Earth Grade Technique though it was understandable. <br/><br/>They had already sold three Earth Grade techniques and it would definitely be too much to sell another one. <br/><br/>This caused many to lose interest, especially Tianlong Yu who had hoped that the next item to be Earth Grade Technique. <br/><br/>On the other hand, Feng Yun's eyes widened with desire when the item was announced. He had heard that this item might get auctioned and wanted it. As for why, it was for his master Minghao. <br/><br/>If not for the Sixth Grade Monster Core or the Earth Grade Technique, this item might have been one of the highlights of the auction. <br/><br/>However, due to Earth-grade techniques being auctioned off at astronomical amounts before this, this item didn't seem to interest many. <br/><br/>Previously, he thought that perhaps he might not get this item because of all those powerful sects and clans but they seemed to have almost no interest in it. <br/><br/>\"Brother, I need that elixir!\" Feng Yun said, urgency lacing his voice as he leaned toward his brother. Feng Chen looked at Feng Yun and knew why he wanted the elixir. <br/><br/>It was clear that the elixir was meant for the soul contained within the ring. Even if Feng Chen hadn't been aware of the soul, it would have been evident that Feng Yun's urgency stemmed from something far more personal. <br/><br/>Feng Yun rarely lost his composure or displayed urgency when it came to his own desires. But when it involved someone he deeply cared for, it was an entirely different matter. <br/><br/>In those situations, he couldn't remain calm; his sense of urgency would surface, just as it was now. <br/><br/>\"Haha… Sure! This item is already yours!\" <br/><br/>Feng Chen replied confidently. With his 4.5 Million Gold Coins, who dares to compete with him? <br/><br/>Even if he were to suffer some losses, he was ready to get this item for his brother. <br/><br/>As the bidding began, Feng Chen raised his hand confidently. \"200,000!\" <br/><br/>A murmur rippled through the crowd. <br/><br/>\"What?\" <br/><br/>\"I thought that Feng Clan was broke after bidding for Skyfire Feather.\" <br/><br/>\"So, they had money? Why didn't they bid on other items?\" <br/><br/>… <br/><br/>Previously, many of them thought that the Feng Clan had already spent everything to get the Skyfire Feather. <br/><br/>This idea was further reinforced by the fact that Feng Clan was especially quiet and didn't bid for any other item. <br/><br/>Only to be proven wrong by Feng Chen. <br/><br/>On the other hand, Yuan Hao remained calm about Feng Chen's wealth, knowing that he had already lent him a substantial amount. <br/><br/>However, he was still surprised that the Feng Clan still had much more money at hand after giving 1.5 Million Gold Coins. <br/><br/>\"Just how much money does he have?\" <br/><br/>Yuan Hao muttered as he wondered just how the Feng Clan got so much money. <br/><br/>He didn't think that he had underestimated Feng Clan and even held them in high regard. But still found that he still underestimated them. <br/><br/>They were even more powerful and mysterious than what he thought could be. <br/><br/>\"No wonder they are not afraid of Mystic Flame Sect or Spirit Wind Palace!\" <br/><br/>Yuan Hao thought. <br/><br/>Then he turned to look at his daughter. Well, he was indeed thinking about marrying this daughter of his to the Feng Clan, specifically Feng Yun. <br/><br/>But then shook his head. <br/><br/>Even he knew that it would be impossible. <br/><br/>Not only because of the problem between Mystic Flame Sect and Feng Clan but because Feng Yun's ex-fiancee was Yuan Ziyan's junior sister whom she seemed to respect. <br/><br/>She would definitely reject the idea on the spot. And more importantly, he can't even force her. <br/><br/>Sigh! <br/><br/>The Ling Clan had overlooked a significant opportunity, and he found himself unable to capitalize on their mistake which made his mood turn a bit sour. <br/><br/>Alas, he didn't have an obedient daughter. <br/><br/>\"200,000 going once… going twice… \" <br/><br/>Looks like there was no one wanting to compete. <br/><br/>For one, many who would have competed with Feng Chen have already exhausted their wealth on earlier items. <br/><br/>Another reason was that Spending more than 200,000 gold coins on Soul Nourishing Exilir would be a stupid decision. <br/><br/>This thing was treated the same as the Skyfire Feather. Although valuable, it wasn't very helpful like the Sixth Grade Monster Core or the Earth Grade Technique. <br/><br/>200,000 gold coins were the maximum that anyone would be even willing to. <br/><br/>\"Sold! Congratulations to the Feng Clan for winning another treasure.\" <br/><br/>The auctioneer said. <br/><br/>When the next item was revealed—a beautiful, intricately designed vial known as the Aquatic Chalice, said to produce an endless supply of pure, life-giving water—Feng Chen raised his hand immediately. <br/><br/>\"100,000 gold coins!\" He declared, his voice booming through the hall. Gasps echoed from the crowd. The item wasn't very good in their opinion and the starting price was just 10,000 gold coins. The sudden high bid left many stunned. \"Is the Feng Clan really prepared to spend that much?\" <br/><br/>\"They must have an abundance of wealth!\" <br/><br/>\"But why are they always buying items that not many people want?\" <br/><br/>… <br/><br/>\"100,000 going once… going twice…\" The auctioneer paused, his gavel raised. \"Sold! To the Feng Clan for 100,000 gold coins!\" Next up was a rare fire spirit stone known for enhancing the fire attribute of cultivators. Feng Chen didn't hesitate. \"50,000!\" \"50,000 going once… going twice…\" \"Sold! Another win for the Feng Clan!\" … <br/><br/>The auction continued and it was mostly a one-man show with Feng Chen almost always winning the bid. <br/><br/>The only things that he didn't bid for were Weapons, no matter the grade. <br/><br/>Other than that, he has almost swept the second half of the auction, making many dumbfounded by their display of wealth. <br/><br/>This also included Feng Zhilan and the geniuses of Feng Clan. They never thought that their clan was so rich. <br/><br/>In the corner of the auction hall, Yuan Hao watched in disbelief. The more Feng Chen bid, the more it reinforced his perception of the Feng Clan as a mysterious and formidable entity. \"Just how much do they have?\" Yuan Hao muttered to himself. Adding all the money Feng Chen gave him and spent on auction, it would easily go over 2 million gold coins. He wasn't the only one but even the Icy Veil Sect and Yunhai Clan were shocked by the display of wealth by the Feng Clan. <br/><br/>They had indeed underestimated the Feng Clan's wealth!\t\t\t\t\t\t</div>", "images": {}, "success": true}