{"id": 92, "url": "https://www.novelhall.com/my-brothers-the-protagonist-good-thing-i-awakened-my-system-33973/15000461.html", "title": "Chapter 93 Another Earth Grade Technique?", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 93 Another Earth Grade Technique?</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\t Chapter 93  Another Earth Grade Technique? \"Congratulations, Yunhai Clan! Securing such a precious technique is a remarkable feat.\" <br/><br/>\"Indeed! With this, the Yunhai Clan would become even more powerful.\" … <br/><br/>Various clans began approaching the Yunhai Clan with congratulations, particularly those who had lent them their money. Strengthening their ties now seemed like the obvious choice, especially since they hadn't stood a chance of competing themselves. <br/><br/>By assisting the Yunhai Clan in securing the technique, they had not only ensured their involvement in its success but also deepened their relationship—a move none of them regretted. <br/><br/>Tianlong Yu, still seething from the loss, forced a smile as he also congratulated the Yunhai Clan Leader. \"Congratulations, Yunhai Lianying!\" The words felt bitter on his tongue, but he understood the necessity of maintaining appearances. <br/><br/>After all, despite wanting to curse, he has to rely on the Yunhai Clan. What is done is done. Now, he must focus on the future. <br/><br/>\"Thank you, Tianlong Clan Master!\" Replied Yunhai Liangying with a calm voice. <br/><br/>She didn't seem to think much about Tianlong competing with her. For such a powerful technique, it would be weird if others didn't compete. <br/><br/>And she didn't also think about how much she had spent to get the technique. After all, money was not a problem for her. Just when they thought that the highlight of the auction was already done, the auctioneer brought out another item, his expression carrying a fresh wave of excitement. <br/><br/>\"Ladies and gentlemen!\" The auctioneer began, his voice cutting through the murmurs of congratulations. \"Though we have already witnessed an extraordinary item, the auction is far from over.\" <br/><br/>Still because of the excitement caused by High-Level Earth Grade Technique, not many paid attention to him. <br/><br/>Many thought it was just the auctioneer saying things to hype the auction and that the next item would be lackluster. After all, in all the auctions, there would be one item that will attract everybody's attention followed by some sub-par item. <br/><br/>There was no way an auction would be filled with items that could stun everyone every time. <br/><br/>\"We now present to you another remarkable treasure—a Mid-Level Earth-Grade Martial Art Technique. This technique is known as 'Frostbound Shadows,' a powerful method that combines ice techniques with stealth, allowing the user to strike like the cold wind, unseen and deadly.\" <br/><br/>As the auctioneer unveiled the next item, murmurs of surprise rippled through the crowd. What many had initially dismissed as a lesser offering turned out to be a Mid-Level Earth-Grade Martial Art Technique. Though not as precious and rare as the High-Level Earth-Grade technique, the Mid-Level Earth-Grade Technique was still a rare and coveted treasure. <br/><br/>What many had initially dismissed as a lesser offering turned out to be a Mid-Level Earth-Grade Martial Art Technique. Though not as precious and rare as the High-Level Earth-Grade technique, the Mid-Level Earth-Grade Technique was still a rare and coveted treasure. <br/><br/>For a moment, there was stunned silence, followed by a shift in the atmosphere. \"WHAT? Did I hear this right?\"  Searᴄh the Novelƒire(.)ne*t website on Google to access chapters of novels early and in the highest quality.<br/><br/>\"Another Earth Grade technique? And this is a Mid-Level Earth Grade Technique!\" <br/><br/>\"Damn! Just how many treasures does this auction have? Even the Capital auction doesn't auction such precious treasure.\" <br/><br/>… <br/><br/>Clans that had already assumed the auction's most valuable items were over suddenly realized this was still a rare opportunity. After all, Mid-Level Earth-Grade techniques were scarce, and even prominent clans like the Tianlong and Yuan Clans possessed only one or two such techniques in their entire arsenal. <br/><br/>The room, which had been quiet moments before, now buzzed with excitement once more. Although this technique wasn't as game-changing as the High-Level one, for many clans, it was still a chance to significantly enhance their power. <br/><br/>Tianlong Yu, who had just been nursing his frustration from losing to the Yunhai Clan, suddenly felt the embers of competition rekindle. He glanced at his elders, all of them now nodding in understanding. This was still a treasure worth fighting for. <br/><br/>Yuan Hao of the Yuan Clan also seemed taken aback. He had assumed the best was already behind them, but now, a fresh opportunity had presented itself. This was no simple technique—it was still a valuable martial art that could bolster his clan's strength for generations. <br/><br/>Then he suddenly realized that he had already lent 500,000 Gold Coins to the Yunhai Clan. <br/><br/>\"Damn!\" <br/><br/>Yuan Hao cursed. If he knew that another Earth Grade Technique was going to be auctioned, he would have never lent his money. <br/><br/>Now, he didn't have enough funds to compete with other clans. This was the same for many other clans who were happy to lend their money to the Yunhai Clan earlier. <br/><br/>Earlier, they felt that they had made a great deal by making Yunhai Clan owe to them. But now, they realized that they had wasted their opportunity to get a Mid-Level Earth Grade Martial Art Technique. <br/><br/>The Icy Veil Sect, whose focus aligned perfectly with the ice-based technique, showed renewed interest. For them, it was a natural fit. <br/><br/>\"Sect leader, we had lost the High-Level Earth Grade Martial Art technique but we must secure this.\" <br/><br/>\"Yes, sect leader! This technique is tailor-made for our sect and we are in need of Movement Technique.\" <br/><br/>The Ice Fairy naturally understood the importance of this technique and nodded to them. <br/><br/>Although the High-Level Earth Grade Technique was something that they wanted, it wasn't really compatible with their other techniques. <br/><br/>However, Frostbound Shadows seemed perfectly tailored to their sect, as if it had been created specifically for them. <br/><br/>Yunhai Lianying was surprised and shook her head. She had already done everything to get the High-Level Earth Grade including borrowing money. <br/><br/>Now, she has no money left to compete with other clans. <br/><br/>Although she was happy that at least she got the High-Level Earth Grade Technique, there was still a hint of regret visible. <br/><br/>And so, what began as a low hum of interest suddenly escalated into yet another fierce competition. Though the stakes weren't as high as before, the prestige of securing a Mid-Level Earth-Grade technique was still enough to ignite a new round of fervent bidding. <br/><br/>\"Starting bid at 200,000 gold coins! Minimum increments of 5,000 gold coins!\" The auctioneer called out, and bidding began almost immediately. <br/><br/>\"270,000!\" <br/><br/>\"280,000!\" <br/><br/>… <br/><br/>The Cloudbreaker Sect, still stinging from their earlier loss, joined the fray. Icy Veil Sect wasn't far behind either. This was the technique that they needed and they seem to be even more determined than when they bid for High-Level Earth Grade Technique. <br/><br/>\"350,000!\" \"400,000!\" … <br/><br/>Tianlong Yu, still trying to hide his frustration from the earlier bidding, was determined to win something tonight. He raised his hand calmly. <br/><br/>\"1,000,000!\" <br/><br/>That bid silenced the hall for a moment. A Mid-level Earth-Grade Technique was worth a lot, but not everyone would be willing to spend such a large amount. <br/><br/>They were surprised by the Tianlong Clan and many thought that they truly deserved to be the Top 3 strongest clan in the Eastern Region. The Icy Veil Sect was not so easily intimidated. <br/><br/>\"1,200,000!\" <br/><br/>Tianlong Yu's brow furrowed. He wanted to win, but this technique wasn't a High-Level Earth Grade one. Although it was still a valuable Mid-Level Earth Grade Technique, it wasn't as life-changing as the High-Level one. He wasn't willing to spend more than necessary for it. Tianlong Yu considered for a moment but didn't raise their bid. They had to save their funds for future opportunities. <br/><br/>Moreover, the icy Veil Sect wasn't like the Yunhai Clan and he couldn't afford to offend them at all. Icy Veil Sect was already ready to pay such a high price, if he dared to raise it further, he thought that he would look bad in front of Icy Veil Sect. <br/><br/>\"Sold for 1,200,000 gold coins to the Icy Veil Sect!\"\t\t\t\t\t\t</div>", "images": {}, "success": true}