{"id": 96, "url": "https://www.novelhall.com/my-brothers-the-protagonist-good-thing-i-awakened-my-system-33973/15017705.html", "title": "Chapter 97 Elemental Ascension Pill", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 97 Elemental Ascension Pill</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\t Chapter 97  Elemental Ascension Pill \"Sigh! It is so lonely to be invincible.\" <br/><br/>Feng Chen wanted to say those words but didn't. <br/><br/>In any case, he had gotten quite a bit of treasure though nothing quite life-changing like Skyfire Feather. <br/><br/>It was mostly stuff that could increase the power of an individual by one or two levels. <br/><br/>As the auction reached its final stages, the atmosphere in the hall calmed down. After those Earth Grade techniques, none of the items could get as much excitement as them. <br/><br/>The auctioneer stepped forward once more, holding a small, ornate jade box with intricate runes etched on its surface. He opened it slowly, revealing a radiant pill that shimmered with a soft, golden glow. The moment the box was opened, a faint, powerful medicinal fragrance filled the room, causing several high-ranking experts to sit up in their seats. <br/><br/>\"For our final item today, we present the Elemental Ascension Pill! A rare 5th Rank Pill, capable of enhancing the breakthrough success rate for Peak Grand Qi Condensation Realm experts, giving them a 50% chance of advancing to the Three Elements Divine Realm! The starting bid is 300,000 gold coins!\" <br/><br/>Gasps rippled through the crowd, especially for the clans with Peak Grand Qi Condensation Realm experts. It wasn't as shocking for the powerful clan and sect who already have Three Elements Divine Realm Experts. <br/><br/>Nonetheless, it was an item with immeasurable value and something that they would want. The Three Elements Divine Realm was a significant leap in cultivation, and any expert stuck at the bottleneck of the Grand Qi Condensation Realm would kill for a chance like this. <br/><br/>Feng Chen leaned back in his chair, crossing his arms as he looked at the pill. <br/><br/>This time, even he was impressed by the auction's final offering. <br/><br/>It could be useful for his clan as they have many Grand Qi Condensation Realm experts especially Feng Zhenshan who is on the verge of reaching the Peak stage of Grand Qi Condensation Realm. <br/><br/>\"350,000!\" The first bid came from none other than the Icy Veil Sect. <br/><br/>Tianlong Yu followed immediately. \"400,000!\"  Searᴄh the ηovelFire.ηet website on Google to access chapters of novels early and in the highest quality.<br/><br/>The room fell silent for a moment. Even for the Elemental Ascension Pill, 400,000 gold coins were too much for it. <br/><br/>After all, unlike other treasures, pills were one-time use and could only benefit one person. Moreover, it only increased the chances of breakthroughs to 50 % and not 100 %. <br/><br/>Tianlong Yu was happy to bid such an amount for this pill because his son had recently entered the Peak of Grand Qi Condensation Realm. <br/><br/>It would be a matter of time before he would need this. ( What a timely arrival! ) <br/><br/>Tianlong Yu thought to himself. <br/><br/>Even his previous losses were almost forgotten by him. Moreover, he didn't think any clan would be able to compete with him now. <br/><br/>In the Feng Clan's private booth, Feng Zhenshan looked at the pill with intense desire. With his cultivation reaching the Peak stage, it would be almost guaranteed for him to step into the next realm if he had Elemental Ascension Pill. <br/><br/>However, upon seeing the price, he realized that he wouldn't be able to afford it. <br/><br/>Asking Feng Chen for help crossed his mind, but he felt it would be selfish to request the pill, even knowing how rich Feng Chen was. <br/><br/>If he did, the other elders might view it as unfair, especially since they too were Grand Elders and on the path to reaching the Peak Stage. <br/><br/>Should Feng Chen choose to give him the pill while denying the others, it could raise questions about his fairness. <br/><br/>Though Feng Zhenshan believed that no one would actually voice such a question against Feng Chen. <br/><br/>\"450,000!\" <br/><br/>While Feng Zhenshan was thinking about that, Feng Chen joined the bid. <br/><br/>\"FENG CHEN!\" <br/><br/>Tianlong Yu couldn't help but yell. <br/><br/>Not only because Feng Chen bid against him but because he felt very angry after his three consecutive losses. <br/><br/>Of course, another thing was because it was Feng Chen and he didn't need to mind his language like he did when the Icy Veil Sect, Yuan Clan, and Yunhai Clan were bidding against him. <br/><br/>He felt that even a person like this from a weak clan dared to go against him. <br/><br/>The price was steep for an Elemental Ascension Pill and even Tianlong Clan had to think twice before he could increase the bid. <br/><br/>However, with the state Tianlong Yu was in, he wasn't going to give in. <br/><br/>He directly increased the bid without thinking twice. <br/><br/>\"470,000!\" <br/><br/>And of course, Feng Chen who had a lot of money in his hand didn't mind spending extra gold coins for something that would benefit his clan. <br/><br/>\"480,000!\" <br/><br/>Feng Chen called out, his tone unwavering and confident. He thought that if their clan could obtain a Three Elements Divine Realm, it would be much safer and there wouldn't be many who could harm them. <br/><br/>Although he might get this pill from another auction for as low as 350,000 gold coins, it isn't known when the next Elemental Ascension Pill will be auctioned. <br/><br/>Moreover, there are seven elders who might need this and he would need to get as many as he could with money. <br/><br/>If such a pill appeared in another auction, he didn't mind spending as much for it as well. <br/><br/>And if there is a need for more then perhaps he might need to use the System Store. <br/><br/>However, he would prefer to use gold coins instead of System Points. \"What do you think you're doing bidding against me? Do you think you could compete with me?\" <br/><br/>Tianlong Yu yelled in frustration. He was thinking that Feng Chen was really going against him intentionally. <br/><br/>On the other hand, Feng Chen didn't even realize it was Tianlong Yu who was bidding against him until he started to yell at him. <br/><br/>Feng Chen raised an eyebrow, a slight smirk tugging at the corners of his mouth. He didn't forget yesterday's incident where Tianlong Yu helped the Bai Clan. Since they were already at odds with each other, he didn't mind being rude. <br/><br/>\"If you want it so badly, then bid for it. Don't waste your breath barking at me, you poor man.\" His words dripped with sarcasm, causing a few bystanders to stifle their laughter. <br/><br/>\"Haha! Nicely said. Bid for it if you can afford it.\" <br/><br/>\"Why is the Tianlong Clan Leader yelling at others for not being able to afford it? Tsk! Tsk!\" <br/><br/>\"Haha… Must be frustrated for losing so many times.\" <br/><br/>… <br/><br/>Many criticized Tianlong Yu's behavior, as they, like Feng Chen, were commoners who had also been looked down upon by those with powerful backing. <br/><br/>There were also those who didn't like the Tianlong Clan and had a bad relationship with them. <br/><br/>On the other hand, some felt that Feng Chen was overstepping his bounds. After all, the Tianlong Clan was not just any clan; they were one of the strongest clans in the Eastern Region. <br/><br/>However, at the same time, many who knew about Feng Clan thought that Feng Chen's response was as expected. <br/><br/>If he wasn't scared of Mystic Flame Sect or Spirit Wind Palace, then why would he be scared of the Tianlong Clan? <br/><br/>Tianlong Yu's face turned crimson with anger. He clenched his fists, glaring at Feng Chen with all the ferocity of a cornered beast. <br/><br/>\"Damn!\" <br/><br/>If he said anything more, he would only come across as someone bullying others because he couldn't afford to compete. <br/><br/>\"490,00!\" <br/><br/>\"500,000!\" <br/><br/>Feng Chen didn't give Tianlong Yu a moment to catch his breath; as soon as the bid was announced, he instantly raised it without hesitation. <br/><br/>Tianlong Yu glared at Feng Chen while gritting his teeth. <br/><br/>He was eager to raise the bid again. If he didn't, he would face humiliation once more, and this time it would be particularly severe since it was the Feng Clan and not just any powerful clan or sect. <br/><br/>\"Clan Leader, you can't!\" <br/><br/>\"Absolutely! How can an Elemental Ascension Pill cost half a million gold coins?\" <br/><br/>\"We must think about the clan.\" <br/><br/>But how could Tianlong Elders just watch Tianlong Yu raise the bid to an unreasonable amount? <br/><br/>They understood that Tianlong Yu was bidding for his son, and while they had no objections to that, they couldn't remain silent as he exceeded reasonable limits. This was the clan's money, and they couldn't just sit by and watch him squander such a substantial amount. Furthermore, since the pill would benefit Tianlong Yu's son more than anyone else, several elders disapproved of his extravagant spending from the start. <br/><br/>\"500,000 going once… going twice…\" \"Sold! To the Feng Clan for 500,000 gold coins! Congratulations to the Feng Clan for getting yet another treasure.\" <br/><br/>Meanwhile, Tianlong Yu stood frozen in place, his expression a mix of disbelief and anger. The realization that he had been outbid by a so-called weaker clan stung. His elders were shifting uncomfortably, their disapproval evident in their glances. <br/><br/>\"Clan Leader, you went too far!\" One elder spoke up, his voice low but firm. \"This isn't just about your son. You're jeopardizing our clan's finances.\" <br/><br/>Tianlong Yu's jaw clenched. \"Hmph!\" <br/><br/>Tianlong Yu said nothing as he stormed out of the auction. He couldn't stand to stay in that place for another moment, thinking about the humiliation he had to endure. <br/><br/>\"Ladies and gentlemen, we have reached the end of today's auction. I want to extend my deepest gratitude to all of you for your participation and enthusiasm throughout this event. <br/><br/>Your spirited bidding has made this auction a great success! We appreciate your support and look forward to welcoming you back for future auctions. Safe travels home, and may your paths be filled with fortune and prosperity! <br/><br/>Thank you once again, and have a wonderful day!\" <br/><br/>With that speech from the auctioneer, the auction of Azure Sky Chamber Of Commerce came to an end!\t\t\t\t\t\t</div>", "images": {}, "success": true}