{"id": 100, "url": "https://www.novelhall.com/my-brothers-the-protagonist-good-thing-i-awakened-my-system-33973/15026414.html", "title": "Chapter 101 The Hooligans Return", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 101 The Hooligans Return</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 101  The Hooligans Return Feng Chen was surprised when he saw that the girl who was supposedly sitting there disappeared right after the commotion. <br/><br/>But what was more surprising was that he didn't even notice that she was gone until he looked at her table. <br/><br/>You know that with his senses, even the Three Elements Divine Realm cultivator would have a hard time escaping from him without his notice. <br/><br/>Even if he didn't pay any attention, he would undoubtedly know whether someone would leave the place—especially with her standing so close. <br/><br/>( Could she be in the Nascent Soul Realm? Or perhaps… even beyond that? ) <br/><br/>Feng Chen wasn't sure, as he'd never encountered another Nascent Soul Realm cultivator before and couldn't confirm if they could disappear without him sensing it. <br/><br/>However, he doubted that even cultivators at that level could slip away without him noticing. <br/><br/>Still, it was even less likely that she was above the Nascent Soul Realm, especially since there was no one above the Nascent Soul Realm in Azure Sky Empire. <br/><br/>Moreover, she didn't appear to be more than 20 years old. But, of course, unlike on Earth, it was incredibly difficult to estimate someone's age in this world. <br/><br/>His best guess was that she possessed some technique that allowed her to vanish so discreetly. <br/><br/>This intrigued him further, as he had no idea how powerful a technique would need to be for someone to slip away so discreetly from his senses. <br/><br/>Feng Chen's heart raced. Who was she? And why had she left so abruptly? A sense of loss mingled with curiosity as he glanced at the table where she had been. <br/><br/>All she'd left behind were a few copper coins, likely payment for the dumplings she had ordered. <br/><br/>Sigh! <br/><br/>He didn't believe in anything like love at first sight nor did he think that he fell in love with that girl. His actions weren't meant to catch her attention or win her over; he'd stepped in purely for his own reasons. <br/><br/>She didn't appear troubled at all, and the fact that she could slip away unnoticed suggested she didn't need his help with those hooligans. Still, he found himself intrigued by her and hoped to learn more about her. <br/><br/>\"Just my bad luck!\" <br/><br/>He muttered to himself, feeling a hint of regret for spending his time teaching those hooligans a lesson. <br/><br/>The patrons of the restaurant also realized the girl was missing after the initial shock of seeing the Tianlong Clan members being beaten had settled. <br/><br/>\"Wasn't the girl sitting there? Where did she go?\" <br/><br/>\"Huh? Is she gone? When did that happen?\" <br/><br/>\"Perhaps she took the opportunity to escape while this gentleman was taking care of those guys from the Tianlong Clan.\" <br/><br/>\"Tsk! Tsk! What an ungrateful girl. This gentleman risked his life to help her and she just abandoned him without even a thanks.\" <br/><br/>… <br/><br/>Of course, those who didn't know the actual story began insulting the girl, thinking that she ran away like a coward when Feng Chen was helping her. <br/><br/>Thanks to Feng Chen's impressive display and the lesson he taught the hooligans, the patrons began to refer to him as \"gentleman\" with newfound respect. <br/><br/>For an average person, a Core Formation Stage cultivator was considered very powerful and set apart from ordinary folks. Even though Feng Chen viewed them as people with mediocre talent to others they were very powerful. When he casually defeated all of them in seconds, it became clear to the patrons that he was an exceptionally strong cultivator. Given his fearless stance against those hooligans who are from the Tianlong Clan, they speculated that he must also have a powerful background. As a result, their perception of him shifted, and they decided to address him with respect. Also, he didn't want to end up like those hooligans if they angered him. <br/><br/>Meanwhile, Feng Chen couldn't shake off thoughts of the girl who had vanished, but he decided not to linger on it and returned to his seat. <br/><br/>Feng Chen reminded himself that he was here for dumplings, not to cause trouble or chase after a girl. Just as he settled into his thoughts, a waiter approached his table, her expression serious. <br/><br/>\"Sir, I think you should leave!\" She warned, glancing nervously around the room. \"Those hooligans might come back with their friends, looking for revenge.\" <br/><br/>Feng Chen nodded, acknowledging her concern. \"I appreciate your concern, but I can handle myself. There's no need to worry.\" <br/><br/>The waiter frowned, still uneasy. \"You don't understand how dangerous the Tianlong Clan can be. They have a lot of influence in Qingyun City. It might be better for you to leave the city altogether while you can.\" <br/><br/>Feng Chen offered her a reassuring smile. \"I'm not going anywhere. I'm just here for the dumplings. Besides, I don't mind even if Tianlong Qi comes. Maybe I should teach him how to control his clan!\" <br/><br/>The waiter was surprised when Feng Chen said those arrogant words. <br/><br/>Previously, she thought that Feng Chen was an outsider who didn't know how powerful the Tianlong Clan was and therefore acted that way.  Sёarᴄh the nôvelFire.net website on Google to access chapters of novels early and in the highest quality.<br/><br/>But judging from his words, not only did he know but he also seemed to personally know the leader of Tianlong Clan. <br/><br/>And despite that, he could utter those words which stunned the waiter. This also made her believe in Feng Chen somewhat and know that he wasn't acting impulsively. She thought that perhaps his background was also powerful like the Tianlong Clan. <br/><br/>\"Well, if you're sure… What would you like to order, sir?\" <br/><br/>\"Give me your best dumpling!\" He replied. <br/><br/>\"Alright sir, I'll get that for you.\" She took his order, but before she left, her eyes softened. \"And thank you for what you did for that girl. I'm sorry I couldn't help. It's just… I'm scared of those men. They're not someone you want to mess with.\" <br/><br/>Feng Chen nodded, understanding her fear. After all, being a native of Qingyun City, if she offended someone from the Tianlong Clan, she would be tormented for her life. <br/><br/>Moreover, even if she tried, she didn't possess any strength to help either. \"Thank you!\" She said quietly, her gratitude evident. <br/><br/>After a short wait, the waiter returned with a steaming plate of dumplings. The warm aroma filled the air, and he could hardly contain his excitement. \"Here you go, sir!\" She said, placing the basket of dumplings in front of him. \"I hope you enjoy them!\" <br/><br/>Feng Chen's mouth watered at the sight of the steaming plate of dumplings. Each one was perfectly golden-brown, glistening with a hint of oil. <br/><br/>\"They look incredible!\" He exclaimed, a smile spreading across his face. He picked up one of the dumplings and took a bite. The filling was juicy and flavorful, bursting with a savory blend of spices that made his taste buds dance. <br/><br/>\"I'm glad you like them!\" The waiter said, her eyes sparkling with satisfaction. \"Our chef puts a lot of love into every batch. And as a token of gratitude for what you did today, he wanted you to have some Mooncakes as well.\" <br/><br/>He looked at the small dish next to the dumplings. The Mooncakes were beautifully crafted, each one decorated with intricate designs on the surface. As he took a closer look, he could see the rich fillings peeking through the thin pastry shell—some filled with sweet lotus seed paste, others with red bean or mixed nuts. <br/><br/>\"They look amazing!\" <br/><br/>The waiter nodded, her expression filled with gratitude. \"Enjoy your meal, sir!\" She said with a respectful nod. \"And if you need anything else, just call for me.\" <br/><br/>As she walked away, Feng Chen couldn't help but admire the way she carried herself despite her obvious fear of the Tianlong Clan. <br/><br/>He turned his attention back to the dumplings, savoring each bite. They were just as delicious as he remembered, and the Mooncakes were the perfect sweet finish to his meal. He picked one up, taking a delicate bite. The rich, sweet lotus seed paste melted in his mouth, leaving a delightful aftertaste. <br/><br/>In no time, the dumplings disappeared before his eyes. <br/><br/>BANG! He was just about to call the waiter to settle his bill when the door to the shop was forcefully flung open with a loud bang. <br/><br/>The sudden noise made everyone turn their heads, and a tense silence fell over the restaurant once again. It was the same group of hooligans, but now there was an unfamiliar face among them. It seemed they had brought in one of their reinforcements. <br/><br/>The reinforcement was an old man, an elder of the Tianlong Clan, and many patrons in the restaurant recognized him immediately. \"Oh no! It's Tianlong Junhao!\" <br/><br/>\"Damn! They brought out an elder in the Grand Qi Condensation Realm.\" <br/><br/>\"What's he doing here? This doesn't look good for that young man.\" <br/><br/>\"Isn't he the one who always supports the clan's more ruthless methods? That poor guy is going to suffer!\" <br/><br/>… <br/><br/>Tianlong Junhao strode in arrogantly, his presence commanding attention as he surveyed the room. <br/><br/>The hooligan who had been leading the group stepped forward, a smirk plastered across his face as he noticed Feng Chen. \"Dad, it was him! He's the one who humiliated us!\" He pointed a finger at Feng Chen, his voice dripping with disdain. <br/><br/>Then he arrogantly said to Feng Chen as he approached him. <br/><br/>\"Thought you could just waltz in here and embarrass the Tianlong Clan without consequences?\" <br/><br/>He felt a surge of confidence with his father present, thinking this was his chance for revenge. At the same time, he thought of Feng Chen as a foolish person who didn't escape after what he did to them. <br/><br/>On the other hand, as Tianlong Junhao's gaze fell on Feng Chen, the arrogance in his demeanor evaporated, replaced by an expression of fear. \"Feng Clan Leader!\" He exclaimed, his voice trembling slightly as he quickly lowered his head in respect. The atmosphere in the restaurant shifted, the patrons watching in stunned silence as the old man's arrogance crumbled before Feng Chen.\t\t\t\t\t\t</div>", "images": {}, "success": true}