{"id": 104, "url": "https://www.novelhall.com/my-brothers-the-protagonist-good-thing-i-awakened-my-system-33973/15034568.html", "title": "Chapter 105 The Arrival Of The Icy Veil Sect", "volume": 2, "volume_title": "Volume 2", "body": "<h1>Chapter 105 The Arrival Of The Icy Veil Sect</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 105  The Arrival Of The Icy Veil Sect Grand Elder Ren Daoyu and Tianlong Qi, each having their own thoughts, were disturbed when the door to the mansion was opened. <br/><br/>Every clan that was participating had already come and those who were not invited were blocked by their guard. <br/><br/>The people who were allowed were those who were powerful enough to ignore the Tianlong Clan's power. <br/><br/>All eyes turned to them, and the uninvited guests were familiar to all. It was the Icy Veil Sect, but this time they weren't wearing their customary veils from the day before. Many were drawn to them, particularly the Ice Fairy leading the group. <br/><br/>\"By the heavens, her beauty feels almost unreal. Like frost brought to life.\" <br/><br/>\"Those eyes… so clear and cold, they pierce right through you.\" <br/><br/>\"I never thought the Ice Fairy herself would be here.\" <br/><br/>\"Did you see her yesterday? I didn't realize she was with the Icy Veil Sect at the auction.\" <br/><br/>\"No one did. With the veil, who could tell? But now, it's obvious.\" <br/><br/>\"She's not just beautiful. There's an untouchable aura around her as if she's made of pure ice.\" <br/><br/>\"She really lives up to her name. The Ice Fairy… both fearsome and enchanting.\" <br/><br/>\"Yes, truly… like a living legend.\" <br/><br/>… <br/><br/>The men couldn't control their emotions and started to praise her and even those with wives couldn't help but admire the Ice Fairy. <br/><br/>Tianlong Qi was taken aback by the unannounced arrival of the Icy Veil Sect but quickly stood up to greet them. <br/><br/>Icy Veil Sect was someone who was even stronger than Spirit Wind Palace and was even led by their sect leader, so how could he not go and greet them? <br/><br/>He needed to ensure he showed them the utmost respect and also uncover the reason for their visit.  seaʀᴄh thё NôᴠeFire.ηet website on Google to access chapters of novels early and in the highest quality.<br/><br/>If they had come solely to visit their clan, it would be an incredible honor for them. But if they had another purpose, the clan would need to either stay out of their way—or perhaps even offer their assistance. <br/><br/>Tianlong Qi approached the Ice Fairy and her entourage with a respectful bow, his tone courteous but inquisitive. <br/><br/>Tianlong Qi began, choosing his words carefully, \"Honored members of the Icy Veil Sect, welcome. It's a privilege to have you here.\" <br/><br/>\"To what do we owe the pleasure of your visit?\" <br/><br/>The Ice Fairy met his gaze with an icy calm, her expression unreadable. Beside her, a senior member of the sect stepped forward and replied, \"We heard that the Eastern Gathering was taking place. Since we were already here in Qingyun City, we decided to come and watch.\" <br/><br/>Tianlong knew they had their own reasons for coming, but he wouldn't dare to ask further. <br/><br/>Whatever their intentions, they could act as they pleased—he certainly didn't have the power to stop them, especially with a Nascent Soul cultivator among them. <br/><br/>\"Of course,\" Tianlong Qi said with a respectful nod. \"The Tianlong Clan is honored to have you here as our guests. We'll prepare seats for you so you can observe comfortably.\" <br/><br/>The Ice Fairy nodded slightly, her cool demeanor unwavering. \"We appreciate the courtesy, Tianlong Qi.\" <br/><br/>\"But there's no need to go to any trouble on our account. There are plenty of seats available that we can make use of.\" <br/><br/>Tianlong Qi nodded, maintaining his polite demeanor. \"As you wish. Please, make yourselves comfortable!\" <br/><br/>The Ice Fairy and her entourage moved gracefully to the seats, their presence alone drawing the attention of everyone in the hall. Of course, Feng Chen was also looking at them. <br/><br/>Ice Fairy was the first and only person he knew who was in the Nascent Soul Realm. <br/><br/>He didn't know just how powerful Nascent Soul Realm cultivators were as he never fought one. <br/><br/>But he did fight with Sixth Grade Monsters and also killed a couple of them. <br/><br/>Since human cultivators were generally weaker than the monsters, he knew that he was stronger than the Nascent Soul Cultivator. <br/><br/>However, Ice Fairy wasn't your average cultivator and is one of the youngest cultivators to break through to Nascent Soul Realm. <br/><br/>Moreover, **************** <br/><br/>Name: Bing Xue <br/><br/>Cultivation Level: Top Nascent Soul Realm <br/><br/>Talent: Exceptional Talent <br/><br/>Physique: Yin **************** <br/><br/>Just looking at her information, Feng Chen said that Bing Xue could be considered one of the strongest in the Azure Sky Empire and undoubtedly stronger than the Sixth Grade Monsters that he faced. <br/><br/>Although he hadn't seen another Nascent Soul Realm Cultivator, just looking at the exceptional talent and yin Physique, he knew that Ice Fairy was someone who had the potential to go beyond the Nascent Soul Realm. <br/><br/>Even having one could make her incredibly strong but to have both? No wonder she was the sect leader of the Icy Veil Sect at such a young age. <br/><br/>Feng Chen couldn't help but admire Bing Xue's appearance as well. Without even seeing her face, one could tell that she was extremely beautiful. <br/><br/>It was often said that those with a Yin Physique possessed exceptional looks, and she was no exception. However, when he compared her to the girl he had seen yesterday, the difference felt like night and day. While his preference might have influenced his thoughts, he couldn't shake the feeling that in comparison to the girl from the day before, the Ice Fairy seemed to lack in every aspect. <br/><br/>Grand Elder Ren Daoyu became even gloomier when he saw the Icy Veil Sect. He knew that they must be there to recruit the Feng Clan's geniuses. The only comfort he had was that it was the Icy Veil Sect and not the Mystic Flame Sect. <br/><br/>Even if they succeed, they would only take females like Feng Mei and FengXiaoyu and he would still have the chance to get Feng Yun who has the most talent. <br/><br/>( if only the sect approved to recruit them. Just what is wrong with them. I need to speak with the other Grand Elder when I get back. ) <br/><br/>Grand Elder Ren Doayu thought. <br/><br/>Even though the Sect Leader had expressed a different opinion, he believed that if he could persuade his peers, they could reach a decision without needing the Sect Leader's approval. Convinced that his actions were in the best interest of the sect, he felt confident he could make it happen. After all, unlike the Mystic Flame Sect and the Icy Veil Sect, their Sect Leader was also in the Three Elements Divine Realm, just like him, which meant his authority wasn't as imposing as that of those in the Nascent Soul Realm. <br/><br/>Their Sect Leader still needed to think about their opinion and wasn't the sole authority of the sect. <br/><br/>Meanwhile, Ice Fairy scanned the area, seemingly looking for someone. Her gaze quickly landed on Feng Chen, and with her elders, she made her way toward him. <br/><br/>Yuan Hao who was seated beside Feng Chen was astonished when Ice Fairy made her way towards them. <br/><br/>Though obviously, he knew what their purpose was. He had previously had the honor of the Icy Veil Sect visiting their clan to recruit his daughter, but she had already joined the Mystic Flame Sect, and it was impossible to change her mind. <br/><br/>Now, a girl had emerged who surpassed his daughter's talent and was comparable to Ling Meiyu. It was no surprise that the Icy Veil Sect had come to recruit her, especially since they were led by their sect leader, which highlighted just how much importance they placed on Feng Mei. <br/><br/>Unlike the first round, there was also someone other than Yuan Hao next to Feng Chen. <br/><br/>He was obviously someone who wanted to make friends with the Feng Clan. <br/><br/>When he saw the Icy Veil Sect, he instinctively understood the situation. He stood up and bowed respectfully to Feng Chen. \"It was an honor to speak with you, Feng Clan Leader. I will take my leave now,\" he said warmly. <br/><br/>With that, he moved to another seat, fully aware of the significance of the moment. <br/><br/>He knew that they were coming to talk with Feng Chen, so it was either Yuan Clan or his clan who would need to leave. <br/><br/>With his clan's status being lower than Yuan Clan, he knew that he had to leave and at the same time, he could also make a good impression on the Yuan Clan, Feng Clan, and Icy Veil Sect at the same time. <br/><br/>Icy Veil Sect saw that but wasn't too surprised. This happens most of the time and was considered another way of showing respect to their sect. <br/><br/>However they were also thankful because that way they could talk with the Feng Clan directly. <br/><br/>Ice Fairy approached the seat that the other clan left and was surprised when they saw Feng Mei with the Feng Clan. <br/><br/>Feng Mei was undoubtedly one the strongest members of the Feng Clan because of her monstrous talent. So, they were surprised to find that she was not participating in the event. <br/><br/>But they felt this was also good. <br/><br/>Now they could talk directly with her and ask her to join their sect.\t\t\t\t\t\t</div>", "images": {}, "success": true}