{"id": 101, "url": "https://www.novelhall.com/my-brothers-the-protagonist-good-thing-i-awakened-my-system-33973/15027893.html", "title": "Chapter 102 The Humbling Of Tianlong Junhao", "volume": 2, "volume_title": "Volume 2", "body": "<h1>Chapter 102 The Humbling Of Tianlong Junhao</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 102  The Humbling Of Tianlong Junhao \"Wha… What? Did Tianlong Junhao change his sex? When did he become so timid?\" <br/><br/>\"What the hell? Why is Elder Tianlong Junhao so respectful to those gentlemen?\" <br/><br/>\"Is his background more powerful than the Tianlong Clan? No wonder, he didn't give any face to the Tianlong Clan.\" <br/><br/>… <br/><br/>The patrons of the restaurant whispered to each other in disbelief. They have never seen any Tianlong Elder be so scared of someone. <br/><br/>On the other hand, Tianlong Junhao couldn't help but want to beat up his son and his friends. <br/><br/>Tianlong Junhao came with his son to put an insolent troublemaker in his place, while also hoping to vent some of his frustration after his clan's failure to acquire the Earth Grade Techniques. <br/><br/>However, he never expected that the man his son and his friends had been beaten by was none other than Feng Chen. <br/><br/>His face paled as he recalled who Feng Chen was—a cultivator in the Three Elements Divine Realm. If the two of them fought, he knew that even with his superior (Which he thinks) Martial Arts, he would be defeated in under a minute. <br/><br/>Moreover, he also knew that Feng Chen was someone who dared to even kill elders from the Mystic Flame Sect and Spirit Wind Palace. <br/><br/>Tianlong Junhao's palms began to sweat as he realized the delicate situation he was in. One wrong move, one misspoken word, and his life might be forfeit. If Feng Chen had disposed of the Mystic Flame Sect and Spirit Wind Palace's elders without hesitation, there was no reason to believe he wouldn't do the same to him, who is only an elder of the Tianlong Clan. <br/><br/>After all, compared to the two sects, their clan wasn't worth mentioning at all.  Sёarᴄh the Nôvelƒire.net website on Google to access chapters of novels early and in the highest quality.<br/><br/>With a strained smile, he managed to stammer. <br/><br/>\"C-Clan Leader Feng, I… I didn't realize it was you. My sincerest apologies!\" His gaze dropped, trying to appear as humble as possible. <br/><br/>The patrons watched the exchange, stunned at the sight of the once-intimidating elder groveling. \"Feng Clan Leader, What brings you here?\" <br/><br/>Tianlong Junhao asked awkwardly with a smile. <br/><br/>Feng Chen cast a brief glance at Tianlong Junhao, causing him to tense up immediately. <br/><br/>Tianlong Junhao asked awkwardly with a smile. <br/><br/>Feng Chen cast a brief glance at Tianlong Junhao, causing him to tense up immediately. <br/><br/>\"Just enjoying some dumplings.\" Feng Chen replied casually. <br/><br/>The elder's gaze darted nervously between his son and Feng Chen, he knew that his son had messed with the wrong person and that he needed to clean up his mess. \"I… I see. Dumplings. Yes, quite a delightful choice.\" Tianlong Junhao's son, still reeling from his father's demeanor, tried to regain his composure. \"But Dad, he—\" <br/><br/>\"Silence!\" Tianlong Junhao snapped, his voice low but laced with authority. Tianlong Junhao's son clenched his fists, frustration boiling beneath the surface, but he fell silent. Moreover, seeing how his father was reacting, he knew that the person in front of him wasn't someone he could mess with. <br/><br/>Still, he couldn't simply let it slide; otherwise, he'd have taken a beating for nothing. <br/><br/>Feng Chen observed the two of them—one foolish, the other even more so. Just by looking at Tianlong Junhao, he could see why the son had turned out to be a hooligan; it was clearly due to a father who shielded him at every turn. If it had been anyone else in this situation, Tianlong Junhao would likely have beaten them to the point of paralysis, or worse, killed them outright. It was only because Feng Chen was stronger that he was showing this deference now. <br/><br/>\"Why are you here, Elder Tianlong?\" Feng Chen inquired, though he obviously knew why he came here. \"Umm… I-I…\" Tianlong Junhao stammered, struggling to find the right words. \"Are you here to take revenge for your son?\" <br/><br/>Feng Chen said, gesturing toward his son and his friends. <br/><br/>Tianlong Junhao stiffened slightly but quickly denied it. \"No, no! Not at all, Clan Leader Feng. You've misunderstood me. I only came with my son to apologize to you!\" <br/><br/>He shot a warning glance at his son and his friend, his eyes clearly signaling them to apologize immediately. <br/><br/>\"Uh, Clan Leader Feng,\" Tianlong Junhao's son began, his voice shaky. Clearly, he wasn't eager to apologize to someone who had just beaten him up, but he knew he couldn't defy his father's wishes. If he didn't listen, he'd only end up facing even more punishment. Given the choice between further beatings and a simple apology, he opted for the latter. <br/><br/>\"Yeah, it is as my father said. I came here to apologize to you. I… I'm sorry for my actions earlier. I let my temper get the best of me. It was disrespectful, and I shouldn't have acted that way.\" <br/><br/>\"Yes, Feng Clan leader, We are sorry!\" <br/><br/>Followed by him were the other Tianlong Hooligans. They knew better than to not listen to What Elder Tianlong Junhao asked for. <br/><br/>Tianlong Junhao cleared his throat, his gaze stern as he addressed the group. \"Hmph! You all think you can strut around like you own the place just because we're backing you up. But don't forget, you can't act without consequences in Qingyun City. When we return to the clan, I will make sure you face the punishment you deserve.\" <br/><br/>Turning to Feng Chen again, Tianlong Junhao forced a smile, though it barely masked the fear in his eyes. \"We wouldn't want to disturb you any further, Clan Leader Feng. My son and his friends have learned a valuable lesson today. I sincerely apologize for their behavior.\" <br/><br/>Feng Chen raised an eyebrow but didn't respond, letting the silence stretch uncomfortably. <br/><br/>Realizing the unresponsiveness of Feng Chen, Tianlong Junhao quickly added. <br/><br/>\"We'll leave you to enjoy your meal. Come, boys!\" <br/><br/>He waved his hand dismissively, herding the group of hooligans toward the exit as quickly as possible. Under the stunned expression of everyone present in the restaurant, they shuffled out of the restaurant, heads down, their usual arrogance nowhere to be seen. <br/><br/>As the group hurried away, Feng Chen watched them leave without much emotion. He didn't really care about their apology nor did he want to waste his time arguing with those idiots. As Tianlong Junhao and his group hurried out, the atmosphere in the restaurant remained thick with disbelief. The attention now turned to Feng Chen, leaving everyone bewildered about who he was to command such authority, forcing the Tianlong Elder to apologize even after beating up his son. <br/><br/>Although a few individuals began to piece together the connection upon hearing the Feng Clan Leader's name, they were still left in shock by the events that had just unfolded. <br/><br/>Feng Chen signaled for the waiter, who had been standing frozen in shock, mouth agape. The waiter blinked, trying to shake off the astonishment, and approached cautiously. \"Um, can I help you, sir?\" She stammered. <br/><br/>\"Settle my bill.\" Feng Chen replied. <br/><br/>\"Of course! Right away!\" The waiter quickly jotted down the order, her hands trembling. After a brief moment, she returned with the total and managed to say, \"Thank you for your patronage,\" in an automatic response, still dazed by the earlier confrontation. <br/><br/>She was deeply concerned for Feng Chen, fearing that the Tianlong group he had confronted would return to cause trouble. After some time, they did come back and she wasn't sure how she could help him. However, her worries proved unnecessary when the Tianlong Elder left after apologizing to him, the very person she had been so anxious about. <br/><br/>Feng Chen handed over the money without a word, dismissing the waiter with a nod. He stepped out of the Fu Dumpling Shop, and prepared to head back to the inn. Tomorrow marked the start of the next round of the Eastern Gathering!\t\t\t\t\t\t</div>", "images": {}, "success": true}