{"id": 107, "url": "https://www.novelhall.com/my-brothers-the-protagonist-good-thing-i-awakened-my-system-33973/15041746.html", "title": "Chapter 108 Tianlong Qi'S Gamble", "volume": 2, "volume_title": "Volume 2", "body": "<h1>Chapter 108 Tianlong Qi'S Gamble</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 108  Tianlong Qi's Gamble Tianlong Qi, who had been silently observing the exchanges, couldn't suppress the fury boiling inside him. His eyes darkened with resentment, and his hands curled into fists. Just when he thought that getting revenge on the Feng Clan would be easy since he has the help of Spirit Wind Palace, Icy Veil Sect shows up. <br/><br/>However, thinking about the plan that he had already set up, his mood became better and suddenly he had an idea. <br/><br/>Perhaps this was a chance for him! <br/><br/>Rising from his seat, he moved deliberately toward Feng Chen, stopping just before him. People already knew about their confrontation before the Eastern Gathering began and then there was also the clash between the two at the auction yesterday. <br/><br/>Seeing Tianlong Qi going towards Feng Chen, they knew that something exciting was going to happen again. <br/><br/>Clearing his throat, Tianlong Qi spoke loud enough for the crowd to hear, lacing his words with barely concealed disdain. <br/><br/>\"Patriarch Feng!\" He began, his voice smooth but enough to catch the attention of everyone present in the mansion. <br/><br/>\"With such esteemed company, things are getting a bit dull without any thrill,\" Tianlong Qi drawled, his voice laced with a hint of provocation. \"Why don't we make things more exciting?\" <br/><br/>The room fell silent, eyes darting between Feng Chen and Tianlong Qi as a hush of anticipation filled the air. Feng Chen's gaze flicked toward Tianlong Qi, dismissive and unbothered. He held no regard for Tianlong Qi, nor did he see him as any real threat. <br/><br/>\"What is it you're implying, Tianlong Clan Leader?\" Feng Chen asked. \"How about a little wager? What do you think, Feng Clan Leader?\" <br/><br/>Tianlong Qi asked.  Searᴄh the NôᴠelFirё.net website on Google to access chapters of novels early and in the highest quality.<br/><br/>\"Wager?\" <br/><br/>Feng Chen now was certain that Feng Yun and Feng Liang getting powerful Rank-2 Formation wasn't a coincidence and that Tianlong Qi was behind it. <br/><br/>It seemed the Tianlong Clan was indeed targeting him. Whether it was the previous incident or this one, it was enough for Feng Chen to consider the Tianlong Clan his enemy. <br/><br/>( I was planning to ignore you, but it seems you won't understand who you're dealing with unless you learn a lesson. ) <br/><br/>Feng Chen didn't really care about Tianlong Qi's little provocation because there are always people who think they are powerful and can bully at will. <br/><br/>However, it is different when his bottom line is touched. If one dares to mess with his clan then he will undoubtedly take revenge. Since Tianlong Qi dared to mess with the competition and target his clan participant, he was going to make Tianlong bleed. <br/><br/>Tianlong Qi's lips twisted into a challenging smile. \"I'm merely saying that true leaders trust in the strength and potential of their family. They wouldn't hesitate to put their gold where their mouth is.\" \"Why don't we bet on our geniuses to see who will come on the top in this round?\" <br/><br/>\"And what exactly do you propose as the terms of this wager?\" Feng Chen asked. <br/><br/>Tianlong Qi straightened, relishing the moment. \"Let's put a sum on the line—how about three hundred thousand gold coins? The winner takes it all. If your clan participants outperform mine, the gold is yours. If not, then the sum comes to me. Simple enough, wouldn't you agree?\" <br/><br/>Several onlookers gasped, their murmurs building into a chorus of surprise and intrigue. \"Tianlong Clan Leader is playing big!\" <br/><br/>\"Sheesh! 300,000 Gold Coins? This has been the income of our clan for decades.\" <br/><br/>\"Looks like Tianlong Clan Leader truly believes in his clan participants. Despite knowing the talent of Feng Yun, he dares to bet such an amount.\" <br/><br/>\"Talent is talent. Strength is different. Feng Yun might be more talented but currently Tianlong Yu should be strongest based on his cultivation.\" <br/><br/>… <br/><br/>A wager of this magnitude was no light matter and caused a big sensation among the crowd. Feng Chen's expression remained impassive, his gaze fixed on Tianlong Qi. Finally, Feng Chen chuckled, his eyes flashing with a subtle hint of derision. <br/><br/>\"Three hundred thousand? That's all you can come up with?\" Feng Chen shook his head, disappointment lacing his tone. \"I expected more from you, Tianlong Clan Leader. I had assumed that a man of your standing would wager something substantial, yet here you are, tossing out pocket change.\" <br/><br/>A murmur rippled through the crowd. Feng Chen's dismissal of Tianlong Qi's initial wager had ignited their interest even further. <br/><br/>Moreover, Feng Chen blatantly insulted Tianlong Qi as if he were a poor person even though 300,000 Gold Coins was a huge sum. <br/><br/>Indeed, a person who wouldn't even accept the offer from Ice Fairy. <br/><br/>Tianlong Qi's face flushed, his smirk faltering for just a moment. <br/><br/>He had expected Feng Chen to be intimidated by the amount he proposed for the bet, but instead, he was insulted as if he were a beggar. The memory of yesterday's auction, where he had lost to Feng Chen, resurfaced in his mind, and he realized that the taunts were surely a result of that defeat. He gritted his teeth in anger but managed to hold it in. <br/><br/>( Calm down. Let him be arrogant for a while. ) <br/><br/>\"So what are you saying, Feng Chen? Are you suggesting that we increase the amount?\" <br/><br/>\"Yes!\" Feng Chen replied. <br/><br/>Tianlong Qi sneered at Feng Chen who was still looking composed. He thought Feng Chen was only acting arrogant because he didn't know what was about to hit him. <br/><br/>He felt a surge of joy at the thought that Feng Chen was willing to raise the stakes of their bet, convinced that the arrogance would soon turn into regret. <br/><br/>( Hmph! Let's see just how long you maintain that smile! ) <br/><br/>\"Then how much do you say we bet?\" Tianlong Qi asked. \"One million gold coins. Take it or leave it!\" <br/><br/>A stunned silence gripped the hall. Even Tianlong Qi struggled to mask his surprise, his confidence momentarily shaken. The stakes were astronomical—enough to empty their clan's treasury. Previously, the Tianlong Clan was willing to take out such an amount only because they wanted to buy Earth-Grade Technique but to think such an amount would be now proposed as bet by Feng Chen. <br/><br/>\"You… Are you serious?\" Tianlong Qi stammered. At first, he was stunned by the amount suggested by Feng Chen, but then he became excited. <br/><br/>After all, that money would soon be his. The higher the bet, the more he would gain—at least that's what he believed. <br/><br/>Although he had no idea how such a small clan could afford such a hefty sum, he didn't care about that at all. All that occupied his thoughts was what he would do with that money. He steadied himself, a sinister grin creeping across his face as he struggled to maintain his composure. <br/><br/>\"Fine, one million gold coins it is. I'll accept!\" <br/><br/>Tianlong Qi's grin widened, his gaze sweeping across the room as he straightened, raising his voice so that everyone could hear. <br/><br/>\"Everyone here will be a witness!\" He announced, his tone triumphant. Tianlong Qi announced this to ensure they served as his witnesses, preventing Feng Chen from going back on his word. It would also guarantee that his clan remained in the spotlight when he claimed victory. <br/><br/>\"One million gold coins will be wagered between me and the Feng Clan Leader, with the winner determined by which clan's participant breaks the formation first.\" <br/><br/>The onlookers exchanged glances, whispers of astonishment rippling through the hall. Many couldn't fathom the sheer audacity of the bet, and even more, were marveling at Feng Chen's calm in the face of such stakes. <br/><br/>Feng Chen's expression, however, remained steady, unperturbed by Tianlong Qi's theatrics. ( Laugh while you can! ) <br/><br/>Feng Chen mused to himself, fully aware of Tianlong Qi's thoughts and the confidence radiating from him. However, he believed that soon enough, Tianlong Qi would receive a harsh reality check. <br/><br/>\"I stand by my wager!\" Feng Chen said. Tianlong Qi smirked, his eyes flashing with smug confidence. \"Haha… Feng Clan Leader. I hope that you don't regre—\" <br/><br/>Just as Tianlong Qi was about to gloat, a sudden shout interrupted him. \"Look! Someone's already broken through the Rank-2 Formation!\" <br/><br/>A collective gasp filled the room as everyone's attention snapped to the Heavenly Projection Crystal suspended above them. ( What? Did Tianlong Yu or Tianlong Ping do it? ) <br/><br/>Tianlong Qi thought excitedly. <br/><br/>He was more inclined to believe that it was Tianlong Ping because she was a Rank-1 Formation Master that he had specially selected for this round. <br/><br/>Moreover, she was already familiar with the formation that she was going to get plus the Rank-2 Formation she got was one of the weakest. <br/><br/>Previously, he believed that she might take around one hour to break through that formation but she did in under 20 minutes which surprised him a lot. <br/><br/>( As expected of my genius! ) <br/><br/>He thought. With this, he was sure that the one million gold coin was his and that the Icy Veil Sect would definitely be interested in taking her as their disciple. <br/><br/>This is also one of the reasons why he felt this was an opportunity and wanted to bet with Feng Chen. <br/><br/>( Looks like I am going to be rich! )\t\t\t\t\t\t</div>", "images": {}, "success": true}