{"id": 109, "url": "https://www.novelhall.com/my-brothers-the-protagonist-good-thing-i-awakened-my-system-33973/15047763.html", "title": "Chapter 110 Rank 2 Formation Master!", "volume": 2, "volume_title": "Volume 2", "body": "<h1>Chapter 110 Rank 2 Formation Master!</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\t Chapter 110  Rank 2 Formation Master! Tianlong Qi still could not accept reality and felt like he was dreaming. Otherwise, he believes that his well-thought-out plan wouldn't fail and that he wouldn't have lost One Million Gold Coins just like that. <br/><br/>Feng Chen, observing Tianlong Qi's distress, allowed a subtle smile to grace his lips. He knew full well that Feng Yun's power wasn't something that could be easily matched by common sense. <br/><br/>After all, he was the protagonist! <br/><br/>( Do you think my brother is called the protagonist for no reason? Losing simply isn't part of his vocabulary. ) <br/><br/>Moreover, he knew that with Ethereal Frost Flame, the formation stood no chance. He was impressed that Feng Yun was able to control Ethereal Frost Flame despite using much of its power. <br/><br/>If he could fully control the Ethereal Frost Flame, its power would be far greater, potent enough to potentially break even a Rank-4 Formation. <br/><br/>But it wasn't an easy feat. <br/><br/>In any case, he couldn't pass up the chance to mock Tianlong Qi, who had been brimming with confidence and arrogance just moments before. <br/><br/>\"Well, it appears the thrill you were looking for has arrived, Tianlong Clan Leader.\" Feng Chen said. <br/><br/>What could be more devastating than beginning to gloat, only to realize you've lost before you could even finish boasting? <br/><br/>Tianlong Qi, his composure slipping, forced himself to scowl, turning to Feng Chen with a sharp, defensive glare. <br/><br/>With each passing second, Tianlong Qi's earlier excitement began to sour. The realization that his well-laid plans were unraveling before his eyes gnawed at him. He had been so focused on the possibility of victory that he hadn't considered the consequences of his failure. As he watched the projection, he couldn't deny the truth; Feng Yun had broken through the Formation. Tianlong Qi clenched his fists tighter, the sharp pain in his palms a welcome distraction from the turmoil inside. \"This isn't over!\" He vowed silently. He needed to regain control of the situation and salvage his dignity before it slipped away even further. <br/><br/>\"Hehe… Tianlong Clan Leader, don't forget about our bet, and remember to give me my One Million Gold Coins, otherwise, for each hour you delay, there is a 10% interest!\" <br/><br/>Feng Chen spoke loudly enough for everyone to hear. Now that Tianlong Qi had lost, he wasn't about to let him off easily and began demanding the money almost immediately. <br/><br/>As for whether he could manage to gather such an amount in little time, it wasn't any of his concern. <br/><br/>Tianlong Qi's face contorted with barely contained fury at Feng Chen's mocking words. The crowd's excitement didn't help either; they watched intently, sensing that the tension between the two Clan Leaders was far from over. <br/><br/>Some members of the audience snickered, amused by the predicament Tianlong Qi found himself in, while others couldn't help but marvel at Feng Chen's blatant disrespect of the Tianlong Clan. <br/><br/>\"Ten percent interest?\" <br/><br/>\"The Feng Clan Leader isn't just strong—he's ruthless with his terms too.\" <br/><br/>\"Haha… since he dares to bet, he should be able to take the loss.\" <br/><br/>… <br/><br/>For the audience, they were just an outsider who was just having fun on behalf of someone else's misery. And Tianlong Qi dug his own hole, so there wasn't anyone who felt bad about it either. <br/><br/>\"Hah… Hah… \" <br/><br/>Tianlong Qi drew a deep, shaky breath, trying to mask his inner turmoil. Losing one million gold coins was a devastating blow, but the humiliation in front of all these sects and clans was even more infuriating. Every plan he had meticulously crafted seemed to crumble before him. <br/><br/>\"I'll pay,\" Tianlong Qi snapped, his voice cracking just slightly. There was nothing he could do at the moment. With so many clans witnessing the event and the Icy Veil Sect present, there was no way he could backtrack on his promise. <br/><br/>His Elders looked at him coldly as if they had made some decision. <br/><br/>Tianlong Qi gritted his teeth. <br/><br/>With such a huge amount of money being withdrawn from the clan, he knew that there was little to no chance that he could still be the Clan Leader of Tianlong Clan. <br/><br/>He was angry because they also supported what he did earlier and didn't stop him when he made a bet with Feng Chen. Because they had also been involved in the manipulation of the second round to ensure their victory. They also believed their Tianlong Clan participants would surely come in first.  Searᴄh the nôᴠel Fire.nёt website on Google to access chapters of novels early and in the highest quality.<br/><br/>But now that it has failed, the responsibility would solely fall on him. However, he couldn't just give in. He still has a last plan with which it was not only possible to retain his position but even strengthen it further. <br/><br/>( Haha… Don't blame me for being ruthless Feng Chen! ) <br/><br/>On the other hand, the Icy Veil Sect also watched the Heavenly Projection Crystal with some regret on their face. <br/><br/>If Feng Yun was a girl then they would have done everything they could to recruit such a person. <br/><br/>Alas, they could only lament the fact that Feng Yun was a male. <br/><br/>Just as the crowd calmed down, another loud exclamation rang out. <br/><br/>\"Look! Another breakthrough!\" <br/><br/>The Heavenly Projection Crystal shifted once more, showing another participant who had broken through their formation. This time, it was Feng Liang, who had broken through and was on his way towards the Tianlong Mansion. <br/><br/>Feng Yun remained in place, seemingly waiting. Perhaps he had anticipated Feng Liang's arrival and chose to stay there for this moment. <br/><br/>Or maybe Feng Yun just stayed there to regain his energy. <br/><br/>In any case, Feng Liang quickly caught up to Feng Chen and made his way over to him. <br/><br/>\"I knew it!\" <br/><br/>Feng Liang exclaimed and seemed to be a little disappointed. He thought that perhaps he could at least win against Feng Yun in this round but found that he still lost. <br/><br/>Of course, he didn't lose his determination even after this. \"Haha… Brother Liang, it is only because of luck that I was a bit faster than you. Otherwise, you would have won this round by a landslide.\" <br/><br/>Feng Yun spoke with sincerity, his words not merely meant to comfort Feng Liang but reflecting a belief he truly held. <br/><br/>If not for the Ethereal Frost Flame that his brother Feng Chen had given him, he knew that it would have taken much longer for him to break that Rank-2 Formation. <br/><br/>And even with Ethereal Frost Flame, he was only faster by a minute or two which just showed how terrifying Feng Liang's talent with the formation was. <br/><br/>Feng Liang's spirit was lifted after hearing Feng Yun's words. What's done is done and anyway, he has given his best and this was his best and has no regret. <br/><br/>Even if he lost, he lost after doing everything he could.\t\t\t\t\t\t</div>", "images": {}, "success": true}