{"id": 102, "url": "https://www.novelhall.com/my-brothers-the-protagonist-good-thing-i-awakened-my-system-33973/15034566.html", "title": "Chapter 103 Second Round Of The Eastern Gathering", "volume": 2, "volume_title": "Volume 2", "body": "<h1>Chapter 103 Second Round Of The Eastern Gathering</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 103  Second Round Of The Eastern Gathering The next day, once again all the clan gathered at the Tianlong Clan's Mansion. <br/><br/>Unlike the last time the Feng Clan entered, they were now greeted with admiration and respect. <br/><br/>Of course, this is all because of Feng Mai and Feng Yun's performance at the Pillar Of Aptitude. <br/><br/>With their presence, other clans recognized that the Feng Clan was destined to rise further. They were eager to avoid leaving a bad impression on the Feng Clan if they hadn't already. <br/><br/>Some clans, like the Yuan Clan and Yunhai Clan, seemed especially pleased. They appeared to be more than satisfied with the technique they had acquired at yesterday's auction. <br/><br/>This only made Yuan Hao feel more grateful to Feng Chen. If not for him, he knew that he would have lost this technique to the Tianlong Clan. <br/><br/>Meanwhile, Tianlong Clan members, especially Tianlong Qi, didn't seem to be in a very good mood. <br/><br/>Things had not been looking good for their clan. <br/><br/>For one, he thought that his clan would get first place but ended up in third place. <br/><br/>And at the auction, he was thoroughly humiliated by others and couldn't buy any Earth Grade Technique. <br/><br/>Additionally, he also lost the Elemental Ascension Pill to Feng Chen in a most humiliating way. <br/><br/>Regardless, their clan was responsible for hosting the Eastern Gathering. <br/><br/>Tianlong Zhen took the stage again to explain the details of the second round of the competition. <br/><br/>\"Today's challenge,\" he began. \"will test the participant's ability to break through a Rank-2 formation. This formation was set up by skilled formation masters invited by our clan.\" <br/><br/>He paused, letting the weight of his words settle over the crowd. \"Rank-2 formation?\" <br/><br/>\"Can our geniuses even be capable of breaking through? Rank-2 formations are able to withstand most attacks from those in the Core Formation Stage.\" <br/><br/>\"Participants are mostly in the Foundation Building Stage and Core Formation Stage. How could they break Rank-2 Formation?\" <br/><br/>\"Tianlong Clan is indeed impressive. To be able to set up over a hundred of rank-2 formations. They must have paid a high price.\" <br/><br/>\"Indeed, a challenge worthy of Eastern Gathering. This should show who among them is the strongest.\" <br/><br/>… <br/><br/>Whispers spread through the crowd as many began considering their strategies for the challenge, particularly the geniuses who would be participating. <br/><br/>\"The rules are simple,\" Tianlong Zhen continued. \"Each clan will send two contestants and they will be timed, and the one who breaks through the formation in the shortest amount of time will earn the highest rank in this round. You may use any method at your disposal, whether it be brute force to smash through or skillful unraveling to dismantle the formation.\" <br/><br/>A murmur of excitement rippled through the crowd as the competitors considered their options. Some could already envision themselves overpowering the formation with raw strength, while others saw an opportunity to showcase their mastery of formation techniques. <br/><br/>Naturally, those studying formations or who were already Rank-1 formation masters were thrilled. For them, this challenge would be significantly easier than others. While breaking the Rank-2 formation would still be difficult for anyone below the second-grade Formation Master level, they believed they could manage it with enough time. They had a much better chance than others who might struggle to make any progress, even with a whole day to try. <br/><br/>\"Remember,\" Tianlong Zhen added with a slight smile. \"The Rank-2 formation will not be easily broken. It has been designed to test not only the participant's power but also their patience and insight. Choose your approach wisely.\" <br/><br/>Tianlong Zhen continued. <br/><br/>\"Now then, Clan leaders, you have 10 minutes to send in your participants.\" <br/><br/>As Tianlong Zhen's words echoed across the arena, the clan leaders gathered in hushed conferences with their geniuses contemplating on who to choose. With ten minutes ticking down, each clan strategized, carefully weighing which pair would best navigate the challenging Rank-2 formation. For many, it was an easy choice to send in their strongest genius while for others, those with knowledge of formation were the priority. <br/><br/>Feng Chen was the same. \"Feng Liang and Feng Yun will participate. Is there any objection?\" <br/><br/>Feng Chen had already thought of who to send when he heard that there would be two participants from each clan. <br/><br/>Choosing Feng Yun was a no-brainer. With his strength, Feng Chen didn't think that the Rank-2 formation could withstand his power. <br/><br/>On the other hand, he chose Feng Liang because he was already a Rank-1 Formation. <br/><br/>Yes, the Feng Clan had already produced a formation master, and Feng Liang was one of them. <br/><br/>Feng Liang was already familiar with formations even before Feng Chen brought those books on formation techniques from Stormhowl valley. <br/><br/>After establishing the house with those formation books, his progress accelerated remarkably. <br/><br/>Feng Liang's natural talent for formation was evident—despite their diligent study, even Feng Mai and Feng Yun hadn't quite been able to keep up with him. <br/><br/>This made it easy for Feng Chen to choose those two for the competition. Of course, he also sought the opinions of others and wanted to give an opportunity to anyone interested in participating. <br/><br/>\"No objection!\" <br/><br/>But there was none because everybody knew that this was the best option. <br/><br/>Feng Liang felt a mix of nerves and excitement at the chance to showcase his talent. <br/><br/>Despite not showing, Feng Liang was feeling a bit down after the first round. <br/><br/>He was once the Feng Clan's top genius. Although he remained humble, he couldn't deny feeling proud to hold the title of number one genius of Feng Clan. <br/><br/>Then Feng Mai and Feng Yun surpassed him, and the Pillar of Aptitude revealed that he was also outclassed by Feng Jianhong. Naturally, as the former top genius, he felt a bit down. <br/><br/>But when it came to formations, he was still the best in the Feng Clan. In the past few weeks, his skills had advanced even further, though this had slightly slowed his cultivation. Had he focused only on cultivation, his level might have been even higher. <br/><br/>Yet he had no regrets; now, it seemed that choice would pay off.  Sёarᴄh the NovelFire.net* website on Google to access chapters of novels early and in the highest quality.<br/><br/>\"This is the time to show my talent!\"\t\t\t\t\t\t</div>", "images": {}, "success": true}