{"id": 108, "url": "https://www.novelhall.com/my-brothers-the-protagonist-good-thing-i-awakened-my-system-33973/15041748.html", "title": "Chapter 109 First Place Of Second Round Of Eastern Gathering", "volume": 2, "volume_title": "Volume 2", "body": "<h1>Chapter 109 First Place Of Second Round Of Eastern Gathering</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 109  First Place Of Second Round Of Eastern Gathering Just as Tianlong Qi was savoring the moment, letting his thoughts drift to the rewards he was sure awaited him, a murmur began to ripple through the crowd. Eyes darted to the Heavenly Projection Crystal as the image shifted, refocusing on the face of the contestant who had broken through the formation. <br/><br/>A moment of stunned silence fell over the hall. <br/><br/>It wasn't Tianlong Ping or Tianlong Yu. <br/><br/>It was Feng Yun. <br/><br/>Eyes widened in shock as the image on the Heavenly Projection Crystal focused clearly, revealing Feng Yun standing triumphantly amidst the broken remnants of the Rank-2 Formation. <br/><br/>What caught everyone's attention even more was the roaring inferno that surrounded him, flames so intense that they painted the air with waves of heat. <br/><br/>The flames danced wildly, casting brilliant shades of crimson and gold, yet Feng Yun's expression was one of utter calm. He stood calm, his figure encased in a torrent of blazing energy, trying to control the flames. His clothes, though whipped around by the fierce heat, remained unburned, almost like the fire that was engulfing him wasn't a real fire. <br/><br/>\"What… What kind of flame is that?\" Someone in the crowd whispered, astonishment clear in their voice. <br/><br/>\"It looks… It looks almost like it has a life of its own!\" another murmured. <br/><br/>\"Could it be… Spirit Flame?\" <br/><br/>The crowd was sure that the Flame surrounding Feng Yun was an extraordinary flame and many thought that it might be Spirit Flames. No one thought it was Mystical Flame because having Spirit Flame itself was very rare, especially for Core Formation Stage cultivators. <br/><br/>And who would even think that someone like Feng Yun would possess Mythical Flame which even Nascent Soul Realm Cultivators are said to have problems controlling? <br/><br/>At least, not them! <br/><br/>The flames pulsed once as if trying to break free of Feng Yun's control, but he merely narrowed his eyes, exerting his will over the fire. The inferno obeyed, quieting its tumultuous nature. <br/><br/>PHEW! <br/><br/>Feng Yun let out a breath of relief, the flames simmering down around him and he could control the Ethereal Frost Flame again. <br/><br/>\"Ethereal Frost Flame,\" He muttered to himself, his voice carrying a mix of awe and exhaustion. \"It's really difficult to control.\" <br/><br/>He could control it well enough for pill refinement, but when it came to using it more intensely or tapping into its full power, he still struggled. <br/><br/>The reason why Feng Yun was able to quickly break through the Rank-2 Formation was because of the Ethereal Frost Flame. <br/><br/>He at first tried using different techniques but none worked. All of his attacks were absorbed by the formation and hit back. <br/><br/>He was almost seriously injured when he used the Heavenly Grade Technique and it was only thanks to his quick reaction that he barely dodged it. <br/><br/>Even though he managed to put a crack in the formation, it quickly repaired itself. He estimated that it would take around ten similar attacks to completely break through it using that method, which would obviously consume a lot of time. <br/><br/>Then he had an idea: he could try using flames to break through the formation. However, ordinary flames proved useless, as they were simply absorbed by the formation's protective barrier. <br/><br/>So, he proceeded to use Ethereal Frost Flame which was working, but it still wasn't powerful enough to completely shatter the Rank-2 Formation. <br/><br/>With no choice, he has to increase the intensity of the flame but that also means that he will need more control over the flame. <br/><br/>At this stage, he didn't yet have full control over the Ethereal Frost Flame at the intensity required to break the formation. <br/><br/>Still, he believed that unless he tried, he wouldn't know whether he could really do it or not.  Sёarch* The Nôvel(F)ire.ηet website on Google to access chapters of novels early and in the highest quality.<br/><br/>Gathering his resolve, he intensified the Ethereal Frost Flame, and the moment he did, the formation shattered instantly under the heat's relentless force. Yet, his lack of complete mastery over the Ethereal Frost flame caused it to surge and engulf him in a fiery vortex. <br/><br/>But it caused no harm and he brought the flame in control in no time though it did take some effort. Fortunately, his clothes were powerful fire-resistant artifacts; otherwise, he might have ended up standing nearly naked in front of everyone, which would have been extremely embarrassing. <br/><br/>Back to the Tianlong Mansion, the murmur grew into a wave of astonished whispers, as gasps and exclamations spread among the onlookers. <br/><br/>\"Is that… Feng Yun?\" <br/><br/>\"It can't be… He broke through that fast?\" <br/><br/>\"That is indeed Spirit Flame. Mortal Flames wouldn't be that powerful.\" <br/><br/>… <br/><br/>Many couldn't believe their eyes. Although they admit that Feng Yun has the greatest talent, that didn't mean he was strong, it just meant he had the highest potential. <br/><br/>However, he still could defeat those older and higher cultivation than him and became the first in the second round as well. <br/><br/>Tianlong Qi's smug expression froze, his face turning pale as his mind struggled to process the image before him. The scene replayed in his head, each second of triumph now laced with an unexpected dread. <br/><br/>\"Impossible…\" Tianlong Qi whispered to himself, his previous smugness completely erased. \"Clan Leader! It's Feng Yun!\" Someone from his clan notified Tianlong Qi with a face as if he had seen a ghost. With the bet already in place, he knew just what was waiting for his clan. <br/><br/>If possible, he would like to go back in time and slap his Clan Leader. Now, their clan has to pay Feng Clan a whopping One Million Gold Coins. That was the saving of many generations of their clan and it was all squandered by their clan leader on a bet. <br/><br/>Tianlong Qi felt a knot tightening in his stomach as he tried to process what was happening. <br/><br/>He was sure that neither Feng Yun nor Feng Liang possessed the strength required to break through the Formation that was assigned to them. <br/><br/>It was a formation that even Grand Qi Condensation Realm Cultivator would struggle to break. <br/><br/>\"No, it can't be!\" Tianlong Qi thought, a bitter taste filling his mouth. \t\t\t\t\t\t</div>", "images": {}, "success": true}