{"id": 103, "url": "https://www.novelhall.com/my-brothers-the-protagonist-good-thing-i-awakened-my-system-33973/15034567.html", "title": "Chapter 104 Tianlong Clan'S Scheme!", "volume": 2, "volume_title": "Volume 2", "body": "<h1>Chapter 104 Tianlong Clan'S Scheme!</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 104  Tianlong Clan's Scheme! As the last few seconds counted down, Tianlong Zhen announced. \"Time's up! All the participants, please step forward.\" <br/><br/>Feng Yun and Feng Liang made their way to the center, standing shoulder to shoulder as other competitors filed into the arena. From the Yuan Clan side, obviously, it was Yuan Ziyan and Yuan Ling. On the Tianlong Clan side was obviously Tianlong Yu. Looking at the chosen participants, most of them seem to be because of their strength. <br/><br/>Indeed, without prior knowledge, most of the geniuses that the clan has brought were mostly based on fighting strength and hence only a very small amount of geniuses were those with knowledge of formation. <br/><br/>As the selected participants gathered in front of Tianlong Zhen, he gestured to an attendant, who called upon the other Tianlong Clan Member. Tianlong Zhen looked over the gathered participants, a glint of authority in his gaze as he raised his hand, silencing the murmurs in the crowd. <br/><br/>\"Participants,\" he announced, his voice ringing clear through the arena, \"you will now follow the attendant before you. They will lead you to your designated formations.\" <br/><br/>At his signal, an attendant stepped forward, motioning for the competitors to fall into line. The participants exchanged glances before following, each one mentally preparing themselves for the formidable challenge ahead. <br/><br/>Many have already lost hope, especially those in the Foundation Building Stage. After all, based on their strength alone, it is almost impossible to break through a Rank-2 Formation, no matter what kind of formation. <br/><br/>\"Remember,\" Tianlong Zhen added, \"you have a time limit of six hours. If any of you fail to break through within that time, you will be eliminated and receive zero points for this round.\" <br/><br/>Feng Yun and Feng Liang glanced at one another as they proceeded with the others. <br/><br/>\"Good luck!\" <br/><br/>They said to each other before departing to their respective formation led by the attendant. <br/><br/>Feng Yun's quiet confidence was evident, while Feng Liang, though nervous, couldn't help but feel a surge of determination. This challenge was his domain, his opportunity to showcase his skill. <br/><br/>The attendant led the participants through a series of corridors and across the grounds, each clan's designated area becoming visible with rows of intricate symbols, glowing faintly with restrained energy. Rank-2 formations stretched as far as the eye could see, each one unique yet equally intimidating. <br/><br/>It seemed that even among the Rank-2 formations, each one was unique. Some were akin to lower-grade formations, easily breakable by mid-level Core Formation Stage cultivators with sufficient strength, while others could withstand assaults even from peak-level Core Formation Stage cultivators. Some formations induced hallucinations, while others simply kept cultivators locked inside. <br/><br/>Looks like the challenge was not fair and those lucky enough were able to get Lower grade Rank-2 Formation while those unlucky got powerful Rank-2 Formation. <br/><br/>Feng Yun and Feng Liang appeared to be among the unlucky ones, as they were assigned a top-tier Rank-2 formation that could prove challenging for even a Grand Qi Condensation Realm cultivator to break through. <br/><br/>\"Am I unlucky or was this some kind of scheme?\" <br/><br/>Feng Yun muttered to himself. While it could be a coincidence that he was assigned a formation just below Rank-3, he was more inclined to think it was part of someone's scheme. <br/><br/>Regardless of which, he was resolute in his determination to break through and do so faster than anyone else. As the saying goes, before absolute strength, no scheme can stand. In the face of overwhelming power, clever plans and intricate strategies often crumble. <br/><br/>Once they reached their respective formations, the attendant stepped aside. \"Your challenge begins now!\" Tianlong Zhen channeled his Qi, sending the signal to every participant to commence the challenge. <br/><br/>As Feng Yun and Feng Liang took their positions, Feng Yun clenched his fists, preparing to rely on his raw power, while Feng Liang's gaze sharpened, eyes scanning the pattern of symbols and lines that composed the formation. <br/><br/>Like Feng Yun, it appeared that he had been assigned a very powerful Rank-2 formation, just slightly weaker than a Rank-3 formation. However, unlike Feng Yun, he didn't think about it much. Instead, he studied the formation with unwavering determination. After a brief analysis, he quickly identified its type: a defensive barrier formation designed to repel intruders and absorb attacks. This particular Rank-2 formation was known for its resilience, with intricate energy patterns that shimmered in the air, indicating its ability to redirect force back at anyone who attempted to break through. <br/><br/>Recognizing its properties, he realized that brute strength alone wouldn't suffice. If attacked, the formation would retaliate with an even more powerful force, striking back at the assailant. <br/><br/>It took just one move for Feng Liang to be rendered powerless, making brute force an unviable option for breaking through. Even at the Grand Qi Condensation Realm, attempting to break through with raw power would have been difficult, let alone at the Core Formation Stage. <br/><br/>He would need to find the formation's weak points, subtle openings in its defense that could be exploited. As he focused, he noted the pulsating rhythms of the energy flow and began to formulate a plan, envisioning how he could manipulate the formation's energy to create an opening for his escape. With each passing moment, his confidence grew—he was ready to confront the challenge head-on. <br/><br/>Inhaling deeply, Feng Liang closed his eyes before opening it again and getting started on breaking the formation. <br/><br/>Meanwhile, in the Tianlong Mansion, the atmosphere was lively and mostly relaxed, with little tension in the air. <br/><br/>After all, the ones doing the work were out in the field, while the onlookers merely observed through the Heavily Projected Crystal, feeling like outsiders watching them break the Rank-2 formation. <br/><br/>Feng Mai and Feng Xiaoyu stood among the crowd, their excitement palpable. \"You got this, Brother Yun! Break through!\" Feng Mai shouted, her eyes wide with anticipation. <br/><br/>\"Don't back down, Liang! We believe in you!\" Feng Xiaoyu added. <br/><br/>Even though their voices couldn't reach the participants, the energy of their encouragement filled the room. Feng Chen was also watching the two though with a slightly different thinking. <br/><br/>He could see that the formation that the two of them got was the same where the force that you attack with on the formation is repelled back to the attacker. <br/><br/>He recognized the power of such Rank-2 formations. Like Feng Yun, he sensed that someone had intentionally set this up, and he didn't need to ponder for long about who was behind it. <br/><br/>( Was it because of Tianlong Junhao or because I took the Elemental Ascension Pill? ) <br/><br/>Feng Chen considered the motives behind the Tianlong Clan's actions. In addition to the possibility of targeting him and Feng Yun, he suspected this could be part of a larger scheme, similar to how they had assisted the Bai Clan. Even before he had crossed them, they were already working against him, so he believed it was a plan they had devised long ago. <br/><br/>Still, Feng Chen wasn't concerned; after all, he knew that Feng Yun was more than capable of breaking through any Rank-2 formation. <br/><br/>As for Feng Liang, it was only a matter of time before he broke through the Rank-2 formation, especially since he was already a Rank-1 formation master himself. <br/><br/>Moreover, even if they didn't secure the top position, there was no cause for concern. Given their performance in the first round, maintaining first place wouldn't be difficult for his clan. <br/><br/>The only real issue would be missing out on the reward from the System if they failed to achieve first place in this round. <br/><br/>Tianlong Qi, on the other hand, grinned sinisterly as he glanced at Feng Chen. One look at him made it clear that he was plotting something nefarious. Naturally, few dared to confront him about it. <br/><br/>Grand Elder Ren Doayu sighed and then asked. <br/><br/>\"Did you do what I asked?\" <br/><br/>\"Of course! There will be no problem. My clan will obviously come first and as for the Feng Clan, hehe… it would be their fortune if they don't get eliminated.\" <br/><br/>Tianlong Qi replied. <br/><br/>He felt a surge of happiness, as he not only had the opportunity to seek his revenge but also no longer feared that the Spirit Wind Palace might attempt to recruit the geniuses of the Feng Clan. <br/><br/>With the backing of the Spirit Wind Palace, he was confident that he could make the Feng Clan regret their actions and ensure they understood their place.  Sёarch* The novёlF~ire.net website on Google to access chapters of novels early and in the highest quality.<br/><br/>Sigh! <br/><br/>Once again sighing, Grand Elder Ren Daoyu has a gloomy expression. <br/><br/>( Why is my sect urging us to go against the Feng Clan? I already informed them that our geniuses could compete with Ling Meiyu, and we would thrive even more. ) <br/><br/>Alas, his request was rejected, and was even asked to make sure that Feng Clan lost the competition in the Eastern Gathering. After that, it seemed they were planning to send someone to handle the situation. Ren Doayu attempted to intervene, but it seemed his sect had already made up its mind. All he could do now was wait until he returned to the sect, where he hoped to explain and persuade them otherwise.\t\t\t\t\t\t</div>", "images": {}, "success": true}