{"id": 116, "url": "https://www.novelhall.com/my-brothers-the-protagonist-good-thing-i-awakened-my-system-33973/15054280.html", "title": "Chapter 117: Feng Chen'S Turn!", "volume": 2, "volume_title": "Volume 2", "body": "<h1>Chapter 117: Feng Chen'S Turn!</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\t Chapter 117: Feng Chen's Turn![Sub-Mission 3 Complete: Secure the top position in the third round of the Eastern Gathering Competition.]<br/><br/>[Rewards: 70,000 System Points]<br/><br/>[Main Mission Progress: 3/4 Tasks Completed]<br/><br/>\"Nice!\"<br/><br/>Feng Chen muttered to himself. He has already gotten more than 150,000 System Points by just sitting around.<br/><br/>Now, all he had to do was get first place in the last round and then the Main Mission would be completed.<br/><br/>(I don't know what the final prize would be!)<br/><br/>Feng Chen smiled while thinking about the reward. He didn't think it would be another System Point though he wouldn't complain even if it were one.<br/><br/>In the arena, Tianlong Zhen gritted his teeth, his frustration barely concealed as he stepped forward to address the crowd.<br/><br/>\"The result of this round is clear,\" he declared, forcing a strained smile.<br/><br/>\"The Feng Clan has earned 300 points, further cementing their lead in the competition with a total of 1,120 points. In second place is the Yuan Clan with 860 points, and the Tianlong Clan... with 800 points.\"<br/><br/>Tianlong Zhen continued announcing the rankings of all the clans, revealing that the Bai Clan had fallen to near the bottom.<br/><br/>The last round really messed up their points and they further went down the ranking.<br/><br/>It was even lower than the ranking that the Yan Clan of the Misty Vale City got in the previous Eastern Gathering.<br/><br/>If nothing changes in the last round, they would end up in this place which would be too humiliating.<br/><br/>Moreover, it would also look bad on the Third Prince which they have sworn allegiance to. The Third Prince might even break up their relationship which the Bai Clan cannot afford.<br/><br/>\"Damn it! I need to do something.\"<br/><br/>Bai Zhang cursed as he thought of a way to get out of this mess. He failed to mess up the Feng Clan and moreover, his clan performed poorly in the competition.<br/><br/>He really needs to find a way for him to get out of this mess.<br/><br/>\"The final round of the Eastern Gathering Competition will be held tomorrow at 9 o'clock. Prepare yourselves, as this will determine the ultimate victor of our prestigious event.\"<br/><br/>With that, the formalities concluded, and the crowd began to disperse.<br/><br/>People from the various clans made their way out of the arena, some with heavy hearts, others with eager anticipation for the final showdown.<br/><br/>Amid the departing, many of them took this opportunity to bid farewell to Feng Chen as well as Ice Fairy.<br/><br/>Pleasantries and hopeful words flowed easily, each clan striving to solidify relationships or curry favor, knowing full well how important these connections could be.<br/><br/>Feng Chen responded politely to everyone, but to those suggesting alliances or partnerships, he offered only vague and noncommittal replies.<br/><br/>After all, as a Clan Leader, one should make promises easily as one might get taken advantage of.<br/><br/>At the moment, none of the other clans had offered anything compelling enough for him to consider forming an alliance.<br/><br/>An alliance should be mutually beneficial, after all.<br/><br/>How could he agree to one if there was nothing for him to gain?<br/><br/>\"Haha... It seems our clan just couldn't keep up with yours.\"<br/><br/>Yuan Hao remarked, showing no sign of disappointment despite his clan being overshadowed by the Feng Clan.<br/><br/>Much less depressed, he seemed to be happy.<br/><br/>Compared to the Mid-Level Earth Grade Technique that he got, the ranking of Eastern Gathering wasn't much help to his clan which already has a lot of fame.<br/><br/>It is only good for a clan like the Feng Clan who is still considered weak and has little to no influence in the Azure Sky Empire.<br/><br/>If the Feng Clan got first place, not only would there be a reward for the first place but also gain a lot of fame and influence.<br/><br/>Their reputation in the Eastern Region would increase and there would be a lot of opportunity for them to work with other clans.<br/><br/>Moreover, Sects might try to reach out to them and even offer to take their clan genius as a disciple.<br/><br/>Even if one didn't qualify, they would be willing to let them in to maintain a good relationship with the Feng Clan.<br/><br/>So, there was a lot to earn from getting first place for the Feng Clan but not as much for the Yuan Clan except for the prizes.<br/><br/>Though Feng Chen's main motivation for getting first place stems from the System reward rather than those things.<br/><br/>Anyway, Yuan Hao didn't feel anything about the Feng Clan being the first place and their being the second.<br/><br/>Rather through this competition, he wanted to further strengthen their relationship with the Feng Clan.<br/><br/>He already has a good relationship with Feng Chen and Feng Chen had also lent him 1.5 Million Gold Coins making him indebted to Feng Chen.<br/><br/>While Yuan Hao was talking with Feng Chen, Icy Veil Sect's Elder and Ice Fairy were talking with Feng Mei and Feng Xiaoyu, probably asking them to think about their offer and trying to<br/><br/>persuade them.<br/><br/>\"Then, Feng Clan Leader, we shall meet again tomorrow!\"<br/><br/>Ice Fairy remarked.<br/><br/>It was clear they had no plans of leaving just yet; instead, they appeared intent on observing<br/><br/>the Feng Clan further.<br/><br/>Perhaps they also hoped to persuade Feng Mei and Feng Xiaoyu on the final day before<br/><br/>returning to Misty Vale City.<br/><br/>Just from this alone, one could see just how much they value Feng Mei and Feng Xiaoyu's<br/><br/>talent.<br/><br/>\"Feng Clan Leader, I will also see you tomorrow. Hope you go easy on me!\"<br/><br/>Yuan Hao said. Tomorrow, he as the Yuan Clan Leader would be competing with Feng Chen. Despite being one of the strongest Clan Leaders in the Eastern Region, he still says those<br/><br/>words.<br/><br/>It was not just out of politeness but because Yuan Hao acknowledged Feng Chen's strength.<br/><br/>Although Yuan Hao hadn't personally witnessed Feng Chen's strength or knew his full capabilities, the fact that he had killed Elder Zhou Tianhua, along with the impressive abilities of the Feng Clan's geniuses, led him to believe that Feng Chen was undoubtedly formidable-strong enough that Yuan Hao would not dare to underestimate him.<br/><br/>Of course, those who heard him say would only think that Yuan Hao was being polite to Feng<br/><br/>Chen.<br/><br/>\"That's what I should be saying.\" Searᴄh the nôvel_Fire.ηet website on Google to access chapters of novels early and in the highest quality.<br/><br/>Feng Chen replied politely.<br/><br/>Though considering their difference in strength, he would obviously need to go easy on<br/><br/>others, otherwise they will end up dead.<br/><br/>After that, Feng Chen along with his clan members left for their Inn.<br/><br/>Tomorrow was the last round and the one which would decide the champion of the Eastern<br/><br/>Gathering.<br/><br/>Feng Chen wasn't particularly concerned and even felt that it was already a done deal.<br/><br/>On the other hand, Feng Yun and other clan members were worried about tomorrow's round.<br/><br/>Although they believed in Feng Chen, they also knew that his opponent wasn't just someone. Tianlong Qi and Yuan Hao were both in Peak Three Elements Divine Realm and considered very powerful.<br/><br/>Meanwhile, they thought that their Clan Leader was somewhat in the Mid-Level Three Elements Divine Realm.<br/><br/>If one looked at the realm, one could see that others clearly have big advantages. Moreover, they had no idea what tomorrow's round would entail, as it would largely be determined by the Tianlong Clan, who is hosting this year's Eastern Gathering. \"However, we have such a huge point difference. Wouldn't we win nonetheless?\" Feng Jianghong asked. After all, there was a difference of 260 points between them and the Yuan Clan and more than 300 points between them and the Tianlong Clan.<br/><br/>Even if they were to lose the last round, Feng Jianhong didn't think that it would impact the<br/><br/>overall score.<br/><br/>\"Hard to say!\"<br/><br/>Feng Yun continued.<br/><br/>\"The last round of Eastern Gathering always carries a huge point, almost equivalent to the<br/><br/>last two rounds combined.\"<br/><br/>Feng Yun answered. Just because Clan Leaders compete in only one round doesn't make that round irrelevant but rather very relevant.<br/><br/>Because of their strength, Clan Leaders only compete in one round but because Clan Leader strength is directly proportional to the strength of the clan, the score it carries was also huge.<br/><br/>\"Where did you hear that?\"<br/><br/>Feng Xiaoyu asked, curious.<br/><br/>Feng Yun had always been a bit of a know-it-all, and even though this was their first time<br/><br/>participating in the event, he spoke about it as if he already knew everything about it.<br/><br/>\"Yesterday, me and Mei'er went around the shops and learned about it from the locals. If what they say is correct then for tomorrow's round, the first place would get 500 points.\"<br/><br/>Feng Yun said.<br/><br/>\"500 points?\"<br/><br/>Feng Liang and others repeated in shock. That means that there was still a chance that they could lose despite coming first for 3 consecutive times.<br/><br/>\"Moreover, the Tianlong Clan is plotting against our clan.\"<br/><br/>\"If the damn Tianlong Clan dares to interfere with the competition again, our Clan Leader<br/><br/>might be in serious trouble!\"<br/><br/>\"Hehe... What are you all worried about? Do you think that my brother will lose?\"<br/><br/>Feng Yun asked with a grin.<br/><br/>Everyone shook their heads and responded, \"No way!\"\t\t\t\t\t\t</div>", "images": {}, "success": true}