{"id": 118, "url": "https://www.novelhall.com/my-brothers-the-protagonist-good-thing-i-awakened-my-system-33973/15055435.html", "title": "Chapter 119 Stalling The Inevitable", "volume": 2, "volume_title": "Volume 2", "body": "<h1>Chapter 119 Stalling The Inevitable</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\t Chapter 119  Stalling The Inevitable While those clan members whose leaders were ganging against Feng Chen were embarrassed, those other clans who were at odds with Feng Clan gloated at Feng Chen's misfortune. <br/><br/>So what if others were ganking up against him? <br/><br/>Who told him to offend people that he cannot afford to offend? <br/><br/>They already thought that Feng Clan would be at the bottom in this round, making them unable to keep their first rank. <br/><br/>Back on the battlefield, Bai Zhang sneered at Feng Chen, taking a few steps forward as the other clan leaders closed in around them. He raised his voice, taunting. <br/><br/>\"Feng Chen, stop trying to act brave.\" Bai Zhang said mockingly. \"You're outnumbered, and you'd be wise to give up before things get... ugly!\" <br/><br/>Feng Chen merely gave him an uninterested look, unmoved by the threat. His stance was firm, showing not a hint of worry, which only seemed to irritate Bai Zhang further. <br/><br/>Even if Feng Chen was putting on a front, Bai Zhang was irritated; he wanted to see Feng Chen trembling with fear or, at the very least, showing some worry about losing. <br/><br/>However, there he was, still with that nonchalant look that seemed to look down on this world. <br/><br/>( I will definitely wipe that smug look off his face! ) <br/><br/>Bai Zhang thought, clenching his fists as frustration surged through him. <br/><br/>Just then, a voice cut through the tense air. <br/><br/>\"That's enough!\" Yuan Hao said, stepping in between Feng Chen and the approaching clan leaders. \"What's the point of ganging up on someone here? How about you add me to the Feng Clan Leader's side as well\" <br/><br/>Yuan Hao intervened. Since he owes Feng Chen a favor, he couldn't turn a blind eye to what was happening to him. <br/><br/>He thought that Feng Chen was in trouble as well because fighting with such a group would be difficult even for him who is in the Peak-Level Three Elements Divine Realm. <br/><br/>As soon as Yuan Hao said those words, the other clan leaders hesitated, glancing at each other. Confronting Feng Chen alone was already something they were reluctant to do, but with Yuan Hao now involved, their hesitation deepened even further. <br/><br/>Although they wanted to curry favor with the Tianlong Clan and Spirit Wind Palace, it wasn't a good deal if they had to offend the Yuan Clan as well. <br/><br/>Bai Zhang, however, scoffed, clearly not pleased with the interruption. \"Clan Leader Yuan, this doesn't concern you. Even if you help the Feng Clan Leader, you won't be able to make a difference. I advise you to go your own way!\" <br/><br/>With the backing of a powerful person, he wasn't afraid even if the said person was the clan leader of the Yuan Clan. <br/><br/>Moreover, with a 10 vs 2 situation, why would he be afraid? <br/><br/>Adding one or two people wouldn't make a difference for their team of ten people. <br/><br/>The only problem with Yuan Hao was his background but thinking about Grand Elder Ren and Tianlong Qi, Bai Zhang felt that he had no need to worry. <br/><br/>\"Then how about you add me as well?\" <br/><br/>Yunhai Lianying interrupted. \"This… \" <br/><br/>Now, the situation has turned even more bizarre and many weren't too keen on stalling Feng Chen anymore. <br/><br/>There was already Yuan Hao and now even the Yunhai Clan Leader was joining in helping Feng Chen. <br/><br/>The Yuan Clan might not be able to do much for their clan as they aren't really reliant on them but the Yunhai Clan was different. <br/><br/>They were the clan that supplied most of the High-Ranking Pills throughout the Eastern Region. <br/><br/>If you offend them, then you can say goodbye to the High-Ranking Pills unless you go to the Capital and ask the Alchemist Association themselves. <br/><br/>Yunhai Lianying sided with Feng Chen partly due to Yuan Hao's involvement and her distaste for seeing so many people ganging up on one person. However, her main reason was that she couldn't allow Tianlong Qi to act recklessly, disregarding all rules. <br/><br/>She already felt the Tianlong Clan was unfair yesterday, and it was even more today. So, she didn't want Tianlong Qi to succeed with her scheme. <br/><br/>With Yunhai Lianying involved, even Bai Zhang kept his mouth shut. <br/><br/>( Dammit! Dammit! Why is he so lucky? Why can he get the favor of so many powerful people? ) <br/><br/>Bai Zhang cursed inwardly. He was arrogant previously because he had the Third Prince's support but seeing Feng Chen backed by not only the Yuan and Yunhai Clans but also the Icy Veil Sect made him angry with frustration. <br/><br/>With Yunhai Lianying now involved, even he hesitated to continue, fully aware of the Yunhai Clan's influence—recently demonstrated at the Azure Sky Chamber of Commerce auction. <br/><br/>Bai Zhang's frustration boiled over, but before he could voice another insult, Feng Chen spoke up. <br/><br/>\"I appreciate your concern, but I don't need your help.\" Feng Chen said, his eyes briefly glancing at Yuan Hao and Yunhai Lianying before returning his gaze to Bai Zhang. \"Just a bunch of trash. Yuan Clan Leader and Yunhai Clan Leader shouldn't worry too much about me.\" <br/><br/>Feng Chen's casual dismissal of his opponents as \"trash\" was a bold declaration, and it fueled anger in the hearts of those clan leaders. <br/><br/>After all, all of them were the strongest in their city and had pride. So, they were not going to take it lightly when others called them trash. <br/><br/>Bai Zhang's face twisted with anger. \"Watch your mouth, Feng Chen! You're alone… standing against clans stronger than you—have you lost your mind?\" <br/><br/>Feng Chen's unflinching gaze met Bai Zhang's, his expression unfazed. \"Oh, I didn't realize that trash bundling together could still feel hurt by words. My apologies,\" he chuckled. \"I just assumed you'd tossed aside your pride the moment you decided to gang up on me.\"  Searᴄh the ηovelFire.ηet website on Google to access chapters of novels early and in the highest quality.<br/><br/>Feng Chen smirked, his tone dripping with sarcasm. Yuan Hao sighed but gave Feng Chen a small nod of understanding. \"I see. Very well, I'll respect your choice. But remember, Feng Clan Leader, the Yuan Clan doesn't forget its friends.\" <br/><br/>Yunhai Lianying, too, withdrew slightly, a faint smirk playing on her lips as she surveyed the clan leaders who were still sizing up Feng Chen. She was a bit angry because she was willing to help Feng Chen, but she was turned down. <br/><br/>Anyway, if Feng Chen doesn't want her help then there is no reason to get herself involved. <br/><br/>She didn't particularly care whether Feng Chen would make it through this unscathed. <br/><br/>With that, both Yuan Hao and Yunhai Lianying stepped back, giving Feng Chen the space he'd demanded. Their actions effectively put the other clan leaders on alert; despite Feng Chen's words, everyone was watching closely to see what the Yuan Clan Leader and Yunhai Clan Leader would do next. <br/><br/>Although they seemed to agree with what Feng Chen had said, they wouldn't act completely on it. <br/><br/>WHOOSH! <br/><br/>Then Yuan Hao and Yunhai Lianying both took off and left the place without saying anything more. <br/><br/>Only when Yuan Hao and Yunhai Lianying were out of sight, did the clan leaders surrounding Feng Chen let out a collective sigh of relief. Now, they could follow through with Tianlong Qi's instructions without risking offense to the Yuan or Yunhai Clans. <br/><br/>\"Your bravery is commendable, but arrogance can only carry you so far, Feng Chen.\" <br/><br/>Bai Zhang said. With Yuan Hao and Yunhai Lianying gone, his bravery returned and he couldn't wait to humiliate Feng Chen. <br/><br/>Bai Zhang's smirk widened as he glanced at the other clan leaders, confidence brimming in his eyes. <br/><br/>\"Since we're all in agreement that Feng Chen needs to be dealt with,\" Bai Zhang said, his words deliberate, \"then let's take him out of the picture—permanently. Break his limbs. Make it so he can't walk, and he'll be nothing more than a helpless piece on the board. We can finish him off before anyone else gets involved.\" <br/><br/>The other clan leaders hesitated, exchanging uneasy glances. They had agreed to stall Feng Chen, but the idea of physically crippling him was a different matter entirely. If they went through with this, they would create an unbreakable enmity with the Feng Clan—something they clearly wanted to avoid. The Feng Clan was home to many talented geniuses, any one of whom could seek revenge on them in the future. <br/><br/>One of the leaders stepped back, unease written on his face. \"Are you sure that's the best course of action? We only need to stall him—going that far might cause more trouble than it's worth.\" <br/><br/>Bai Zhang's eyes narrowed. He could sense the reluctance in the air, but he also knew the price of hesitation. He stepped forward, his tone growing colder and more insistent. <br/><br/>\"If we don't act now if we wait any longer, we might be interrupted again—just like before,\" Bai Zhang said, his voice rising slightly with urgency. \"And do you really think Tianlong Qi will let us off the hook if we fail him? If we don't do this now, we'll lose our chance to follow through with what we promised him. Do you want to risk that?\" <br/><br/>His words struck a nerve. The clan leaders, now realizing that their hesitation might cause them to miss their opportunity, looked at each other with renewed determination. \"We can't afford to waste this moment,\" one of the leaders finally said, nodding toward Bai Zhang. \"Let's do it.\" <br/><br/>With their resolve solidified, the clan leaders moved to encircle Feng Chen, their intentions now clear. \"Did you finish preparing? Then let's start!\" \t\t\t\t\t\t</div>", "images": {}, "success": true}