{"id": 117, "url": "https://www.novelhall.com/my-brothers-the-protagonist-good-thing-i-awakened-my-system-33973/15055432.html", "title": "Chapter 118 Last Round Of The Eastern Gathering!", "volume": 2, "volume_title": "Volume 2", "body": "<h1>Chapter 118 Last Round Of The Eastern Gathering!</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\t Chapter 118  Last Round Of The Eastern Gathering! The next day arrived swiftly, bringing with it a buzz of anticipation throughout Qingyun City. This was the final day of the Eastern Gathering, and by the end of it, everyone would know the standings of each clan. <br/><br/>The entire Eastern Gathering had been building up to this final showdown between the Clan Leaders, each one a seasoned powerhouse capable of extraordinary feats. Feng Chen walked calmly alongside his clan members, heading toward the Tianlong Mansion. His clan members walked with him, their expressions resolute, understanding just how much this final victory could mean for the Feng Clan. Grand Elder Feng Zhenshen and Zhilan wanted to say something to Feng Chen but didn't as they thought that it might just add pressure onto Feng Chen. <br/><br/>Anyway, win or lose, their clan's standing was already pretty high in this Eastern Gathering and it wasn't necessary to win the last round. <br/><br/>As Feng Chen reached the designated spot, seemingly the last to arrive, he was met by a team of guards who then escorted him and the other Clan Leaders to the location of the final round. This was no ordinary stage—they would be competing far from Qingyun City. The immense power wielded by individuals like Feng Chen, Yuan Hao, and Tianlong Qi was too dangerous to be unleashed near Qingyun City especially since there was no way for the Tianlong Clan to contain their power. Previously, no matter how powerful the geniuses of various clans were, their power could be easily contained by Tianlong Zhen who is a Three Elements Divine Realm cultivator. <br/><br/>However, this was no longer the case; if Clan Leaders at the Grand Qi Condensation Realm or Three Elements Divine Realm clashed, he would have almost no power to contain them. <br/><br/>Of course, if someone like Ice Fairy who is in Nascent Soul Realm looked after the competition, it would be a different story but who can ask Ice Fairy to do such a mundane thing? <br/><br/>Instead, a secluded, barren field miles outside the city walls had been designated for the competition. The location chosen for the final round was a vast, desolate plain surrounded by rugged hills and sparse vegetation—a stark, quiet landscape. This place was like Stormhowl Valley which is a place full of monsters and because of that there was no human settlement. <br/><br/>Of course, the place wasn't as dangerous nor was it endless like Stormhowl Valley. The strongest monster a person could encounter was Rank-5 and that was also very rare. <br/><br/>Qingyun City occasionally holds Hunting Competitions in this area, so the monster population is regularly controlled, unlike in Stormhowl Valley. <br/><br/>The field stretched far enough that even cultivators at the Grand Qi Condensation Realm, moving at their top speed, would need nearly a day to traverse its entirety from one end to the other. Anyway, even if Powerhouse in Grand Qi Condensation and Three Elements Divine Realm fought here, there was nothing to worry there. <br/><br/>Yuan Hao greeted Feng Chen with a nod, his usual carefree expression on his face. \"It looks like today's the big day,\" he said, continuing the conversation as they walked side by side. \"I must admit, I'm looking forward to seeing how this all plays out.\" <br/><br/>Beside them, Tianlong Qi walked with a slight smirk, exuding an air of quiet confidence. Obviously, he already know what the competition was about and he had already made preparation necessary to ensure his victory. <br/><br/>As they reached the competition grounds, Tianlong Zhen stepped forward to address them. \"Welcome, Clan Leaders!\", he began. \"Today is the final round of the Eastern Gathering—the last chance for each clan to alter their standing in the competition.\" <br/><br/>Tianlong Zhen continued. <br/><br/>\"The rules are simple: the first to reach the summit claims victory.\" <br/><br/>Tianlong Zhen announced, gesturing toward a towering peak in the distance, the finish line for the ultimate round. \"This is a race across treacherous terrain, where dangers abound. Along your path, you'll encounter fierce beasts and perilous obstacles meant to challenge even the most powerful cultivators. You are permitted to use any techniques or artifacts at your disposal. Whatever you use, the one to reach the Top first would be declared the winner!\" <br/><br/>The marked summit loomed far in the distance, easily visible yet imposing, its height a daunting reminder of the difficult journey that lay ahead.  Sёarᴄh the Nôvelƒire.net website on Google to access chapters of novels early and in the highest quality.<br/><br/>At first, it looks like it would be advantageous to those with superior speed and stamina but it was far from that. <br/><br/>Since this place was filled with monsters, it is for sure that one would encounter them frequently which will obviously slow one down. <br/><br/>So, this all factors in just how strong and how quickly one could take care of the monster and not just speed. <br/><br/>With a raised hand, Tianlong Zhen signaled the start of the round. <br/><br/>\"Then begin!\" <br/><br/>It wasn't the messy running as soon as the signal began. After all, this wasn't a typical race and running one second late wasn't going to affect them. <br/><br/>Moreover, there seemed to be mutual understanding between various clans as they made their way towards Feng Chen. <br/><br/>Feng Chen didn't need to think twice before knowing what they were planning and on whose order they were doing this. <br/><br/>In the distance, Tianlong Qi had a smirk on his face as he disappeared into the rugged terrain, leaving the others behind. Meanwhile, Feng Chen was surrounded by several other Clan Leaders who blocked his path, their intentions were very clear. <br/><br/>There was no rule stating that they couldn't fight each other and Feng Chen already anticipated something like this when he heard the rules. <br/><br/>And looking at the various clan leaders blocking his way, Feng Chen knew that they had already planned this out. <br/><br/>\"Sorry, Feng Clan Leader\" said Bai Zhang of the Bai Clan, stepping in with a mocking grin. \"We can't let you go so easily!\" <br/><br/>Among other clan leaders, only Bai Zhang was happy to stop Feng Chen. After all, Feng Chen was still an enemy in his eyes and was happy to see him suffer. <br/><br/>Moreover, he finally found a way to get out of the mess that he was in. <br/><br/>And that was to receive help from the Tianlong Clan. Coincidentally, he was approached by the Tianlong Clan yesterday, and he agreed to help them on the condition that after the Eastern Gathering, they help him as well which they agreed. <br/><br/>It was a god send opportunity! <br/><br/>As long as he could help Tianlong Qi to get the first position in this round, he would receive Tianlong Clan's help. Indeed, even if his corporation with the Third Prince and other clans ends, so what? He will have the support from Top 3 strongest clans of the Eastern Region. <br/><br/>( I am so blessed! ) <br/><br/>Bai Zhang's thoughts were a complete 180 degrees from what they had been the day before. <br/><br/>This seemed to be the same for other clan leaders as well. But unlike Bai Zhang, they didn't have enmity with Feng Chen and seemed a bit hesitant especially considering that Feng Clan is favored by Icy Veil Sect. <br/><br/>However, getting a favor from the Tianlong Clan is a great opportunity that they couldn't reject. <br/><br/>\"Sorry, Feng Clan Leader but you will need to stay with us until this round ends!\" <br/><br/>One of the clan leaders said respectfully. Unlike Bai Zhang, he still hope that he doesn't antagonize Feng Chen and was still respectful. <br/><br/>Feng Chen remained calm, his eyes assessing each of them with a calm gaze. <br/><br/>Even when surrounded by more than ten opponents ranging from the Mid-Level Grand Qi Condensation Realm to the Mid-Level Three Elements Divine Realm, he wasn't the least bit worried. <br/><br/>\"So, you all think a little alliance will stop me?\" He said, his voice steady, even slightly amused. <br/><br/>They knew Feng Chen was formidable as he killed Elder Zhou, but they believed sheer numbers would wear him down. Moreover, there were 4 Three Elements Divine Realm in their alliance and even Peak-Level Three Elements Divine Realm cultivators would have a hard time against them. <br/><br/>Moreover, they were going to stall Feng Chen and not really kill him. So, they believe that their success was guaranteed. <br/><br/>All the while, Tianlong Qi, with his head start, was speeding across the rough landscape, skillfully avoiding the monstrous creatures lurking in the shadows. <br/><br/>In the Tianlong Mansion, seeing the others crowding Feng Chen, Grand Elder Feng Zhenshen clenched his fists. \"Those cowards...they planned this!\" <br/><br/>Feng Yun, standing beside him, gritted his teeth. \"They fear our clan victory so much they'd rather gang up on my brother? Aren't they afraid to lose face?\" <br/><br/>Feng Yun said in a loud voice intentionally to embarrass the clan whose leader is ganging up on his brother. <br/><br/>Indeed, this made those clan members a bit embarrassed. <br/><br/>After all, they were also the top clan in their city and had their pride. But now, their clan leader was teaming up with others to bully a single person, which seriously damaged their reputation.\t\t\t\t\t\t</div>", "images": {}, "success": true}