{"id": 113, "url": "https://www.novelhall.com/my-brothers-the-protagonist-good-thing-i-awakened-my-system-33973/15052464.html", "title": "Chapter 114 Bai Clan'S Embarrassment", "volume": 2, "volume_title": "Volume 2", "body": "<h1>Chapter 114 Bai Clan'S Embarrassment</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\t Chapter 114  Bai Clan's Embarrassment Despite his initial fear, Bai Xun managed to gather his courage and looked directly into Nightshade Basilisk to show that he wasn't afraid. <br/><br/>\"Hmph! You don't scare me!\" <br/><br/>Bai Xun exclaimed. <br/><br/>The Nightshade Basilisk's crimson eyes gleamed ominously as it focused on Bai Xun. <br/><br/>\"Stupid!\" <br/><br/>Many commented when they saw what Bai Xun was doing, especially those who had fought with Nightshade Basilisk. <br/><br/>Unbeknownst to Bai Xun, the creature's gaze harbored a sinister power—a paralyzing effect that worked insidiously on those who dared to meet its eyes. <br/><br/>That's why those who fight with the Nightshade Basilisk would usually look at its shadow or the feet. <br/><br/>Of course, there were some who possessed the strength to resist the paralyzing effect, but Bai Xun was not among them. <br/><br/>However, it couldn't be entirely blamed on Bai Xun, as he had never fought or learned about the unique characteristics of a Nightshade Basilisk. <br/><br/>Bai Xun felt the air grow thick around him, and his limbs began to feel strangely heavy. The arrogance that had once filled his heart wavered as his body started to betray him. His confident stance faltered, and a sense of dread coiled in his gut. <br/><br/>\"What... what is this?\" Bai Xun's voice wavered, tinged with panic as he tried to move. But his muscles refused to respond. His legs were rooted to the ground, his arms stiff and immobile. It was as if invisible chains had wrapped around his entire body, rendering him defenseless. <br/><br/>Gasps rippled through the audience as they realized what was happening, especially those who didn't know anything about Nightshade Basilisk. \"Is that... paralysis?\" \"Bai Xun is completely frozen! Doesn't that mean he is in danger?\" <br/><br/>\"Sigh! Rank 3 monster isn't something an Early Core Formation Stage could fight.\"  seaʀᴄh thё NôvelFire.nёt website on Google to access chapters of novels early and in the highest quality.<br/><br/>… <br/><br/>Bai Lin and Bai Fan, who had been watching from the sidelines, exchanged worried glances. \"Bai Xun! Break free!\" Bai Lin shouted, his voice echoing through the arena. But his call did nothing to shake his companion from the monster's grip. <br/><br/>\"Brother Xun, you can do it!\" <br/><br/>Bai Fan encouraged but looking at the unresponsiveness of Bai Xun, they had a bad premonition. <br/><br/>The Nightshade Basilisk slithered closer, its gaze never wavering. It seemed to savor Bai Xun's vulnerability, its forked tongue flicking out as it tasted the fear in the air. With each passing second, the paralyzing effect only grew stronger, tightening its hold on Bai Xun's body. <br/><br/>Bai Xun's mind raced. He had always thought of himself as the Bai Clan's strongest genius, yet here he was, completely helpless. His breath came in shallow gasps, panic tightening around his chest. Gone were his arrogant thoughts; now, his only focus was on how to escape and avoid death. <br/><br/>Time seemed to slow as the creature closed in, and the entire crowd held their breath, waiting to see if Bai Xun would be able to break free from the monster's spell. <br/><br/>The Nightshade Basilisk slithered closer, its scales glinting ominously in the light as it prepared to strike. Bai Xun's heart pounded in his chest, his fear intensifying as the creature's fangs glistened with venom. His earlier arrogance had completely dissolved, leaving only sheer terror. \"Wait! Stop! Help me! I surrender!\" Bai Xun's voice cracked as he screamed, his desperation echoing through the arena. He had never imagined himself reduced to such a pitiful state in front of so many people. Surrendering to a monster was considered a disgrace because, in a real encounter in the wild, such a reaction would mean certain death. <br/><br/>Even if one couldn't fight, one shouldn't easily surrender. <br/><br/>The spectators exchanged looks of scorn. <br/><br/>Tianlong Zhen, who had been watching carefully, sprang into action to ensure Bai Xun's safety. With a swift movement of his hand, he unleashed a wave of energy that slammed into the Nightshade Basilisk, forcing it back and breaking its hold over Bai Xun. The beast hissed in displeasure but retreated, its eyes still glowing with a dangerous light. <br/><br/>Bai Xun collapsed to his knees, his body trembling uncontrollably. He gasped for air, feeling the weight of his humiliation pressing down on him. The audience, far from being sympathetic, erupted into murmurs of criticism. <br/><br/>\"How pathetic! The so-called genius of the Bai Clan, reduced to begging for mercy?\" \"Is this the strength of the Bai Clan's pride? How embarrassing!\" \"Surrendering in front of a monster… It's a disgrace!\" <br/><br/>,,, <br/><br/>Bai Lin and Bai Fan, who had been watching anxiously, felt a flush of embarrassment rise to their faces. The Bai Clan's reputation, which they had hoped to elevate, was now the subject of ridicule and derision. <br/><br/>Bai Zhang couldn't wait to strangle Bai Xun to death. Who told him to choose Rank 3 Monster? Who told him to surrender so easily? Now, he couldn't even lift his head in front of the other clans. His only hope is that Bai Lin and Bai Fan could somehow save their reputation. <br/><br/>Tianlong Zhen's voice rang out, steady and composed, as he addressed the crowd. \"Bai Xun has forfeited. The Bai Clan earns no points for this attempt.\" His words only served to deepen the blow to the Bai Clan's honor. <br/><br/>Bai Xun, still shaking, could barely lift his head. The weight of failure and shame crushed his spirit, and the Bai Clan, once full of hope, now found itself struggling to hide its disgrace under the judgmental eyes of the audience. <br/><br/>Moreover, he could see Bai Zhang, his clan leader, glaring at him with bloodlust. <br/><br/>( I'm dead! ) <br/><br/>\"Then who will be the second one to go?\" <br/><br/>Tianlong Zhen asked. <br/><br/>\"M-Me!\" <br/><br/>Bai Lin raised his hand as he came forward. With what happened to Bai Xun, there was only a little confidence in his heart. <br/><br/>\"I choose a Rank 2 monster!\" He announced. With his Peak Foundation Establishment Stage, there was no way that he couldn't fight with a Rank 3 monster especially when Bai Xun, who is in the Core Formation Stage lost without a chance. <br/><br/>The arena gates opened, releasing a Thunderclaw Panther, its sleek, lightning-infused form prowling toward him. <br/><br/>Summoning his spiritual energy, Bai Lin engaged the beast with swift, determined strikes. Unlike Bai Xun, he managed to fight back, landing a few blows, but the Thunderclaw Panther's speed and electric attacks quickly wore him down. It evaded most of his strikes and retaliated with lightning-enhanced claws, paralyzing him with each hit. <br/><br/>Despite his effort, Bai Lin was eventually overwhelmed, collapsing onto the arena floor, defenseless. Tianlong Zhen intervened, subduing the beast to prevent further harm. Though he had lasted longer than Bai Xun, Bai Lin's defeat brought further disgrace to the Bai Clan. The crowd murmured in disappointment, and Bai Zhang's face darkened with rage. Of course, it wasn't much with what Bai Xun did. It is only because the Bai Clan suffered failure after another that embarrassed the Bai Clan. <br/><br/>Otherwise, Bai Lin fought a good battle and couldn't be considered a disgrace. However, he nonetheless added yet another defeat to the clan's tarnished reputation. <br/><br/>\"Last participant from Bai Clan, please step forward!\" <br/><br/>Tianlong Zhen said. <br/><br/>Bai Fan stepped forward, his face pale with tension as he stood before the scrutinizing gaze of spectators. Seeing both Bai Xun and Bai Lin humiliated and defeated had shattered whatever confidence he had left. \"I choose a Rank 1 monster!\" Bai Fan declared. His words triggered a wave of disbelief and mockery among the spectators. \"A Peak Foundation Establishment cultivator choosing a Rank 1 beast? How pathetic!\" <br/><br/>\"Even if he wins, the points will be worthless!\" <br/><br/>\"Haha… Well, can't blame him. His clan would get zero points if he also fails.\" <br/><br/>… <br/><br/>Bai Zhang's face darkened. He could see other people looking at him like a pathetic person. <br/><br/>He, who once thought that his clan would only rise after serving the Third Prince is mocked and scrutinized. <br/><br/>And his own geniuses were further tarnishing that image. If the Third Prince heard of this incident, he wouldn't know whether they could still maintain their relationship, especially after failing to deal with the Feng Clan. <br/><br/>\"Damn it! Damn it!\" <br/><br/>The arena gates opened to release a Swiftstrike Boar, a relatively small but quick monster. There was not much reaction from the audience. It was a common monster that was commonly used by the children to practice against many clans. <br/><br/>It is also used to kill for its meat, making it no different from livestock. <br/><br/>Bai Fan, on the other hand, was elated when the monster turned out to be a Swiftstrike Boar and unleashed a flurry of precise attacks. People just found Bai Fan's actions more pathetic. A Peak Foundation Establishment seemed tense when fighting with a Rank 1 monster and was happy when it was Swiftstrike Boar. <br/><br/>Moreover, to deal with such a monster, Bai Fan unleashes so many unnecessary powerful attacks. He easily overpowered the creature, defeating it in mere moments. <br/><br/>However, the victory brought no pride. The judges awarded the Bai Clan a meager 10 points for Bai Fan's effort, making their total score from the third round embarrassingly 10 points. Whispers of mockery rippled through the crowd, and the Bai Clan's reputation plummeted even further. <br/><br/>Bai Zhang's face turned red with barely contained fury, his gaze fixed on the ground, and he was unable to meet the judgmental eyes of other clan leaders. The once-proud Bai Clan had been reduced to a subject of ridicule, and it would take nothing short of a miracle to redeem their honor. <br/><br/>His only hope was that he could salvage whatever reputation he has in the last round where he would be participating.\t\t\t\t\t\t</div>", "images": {}, "success": true}