{"id": 119, "url": "https://www.novelhall.com/my-brothers-the-protagonist-good-thing-i-awakened-my-system-33973/15098210.html", "title": "Chapter 120 Feng Chen Runs Away", "volume": 2, "volume_title": "Volume 2", "body": "<h1>Chapter 120 Feng Chen Runs Away</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\t Chapter 120  Feng Chen Runs Away \"Yuan Hao, do you believe that the Feng Clan Leader can handle so many people?\" <br/><br/>Yunhai Lianying asked. <br/><br/>She had no personal connection with Feng Chen, so she wasn't particularly concerned. However, seeing that Yuan Hao, who she believed had a good relationship with Feng Chen, was also leaving him, she became curious. <br/><br/>Was it the confidence in Feng Chen or did Yuan Hao not care about Feng Chen as she thought? <br/><br/>\"Who knows? But since he seemed confident, I can only believe in him.\" <br/><br/>Yuan Hao replied. <br/><br/>Yuan Hao wasn't sure, as Feng Chen was a mysterious figure to him—someone capable of casually giving away 1.5 million Gold Coins without a second thought. <br/><br/>He couldn't see through this clan leader of a small clan but knew that he was but an easy target. <br/><br/>Although he wasn't certain, he felt that Feng Chen wouldn't have any problem coming out of those people alive. <br/><br/>Anyway, if he had a problem dealing with them, then he didn't think that he would have refused the help from them. <br/><br/>\"Anyway, let's focus on competition. That bastard Tianlong Qi has already gone so far away!\" <br/><br/>Yuan Hao cursed as he increased his speed. <br/><br/>**** <br/><br/>\"Frost Strike Palm!\" <br/><br/>\"Thunderbolt Claw!\" <br/><br/>\"Wind Slash!\" <br/><br/>… <br/><br/>The clan leaders who surrounded Feng Chen all attacked together, not giving any chance for Feng Chen to escape. <br/><br/>BANG! BANG! BOOM! <br/><br/>The attacks collided with the ground, creating shockwaves that reverberated through the air. Dust and debris were sent flying in every direction, the impact so intense that it left the surrounding area in a state of chaos. For a brief moment, the battlefield appeared to be a wasteland, the destruction so complete that it looked as though nothing—nothing at all—could have survived such a ruthless barrage. <br/><br/>There was no doubt in their mind that Feng Chen had been killed or at worst been severely injured by these attacks. <br/><br/>As the dust and smoke from the barrage of attacks settled, the air was thick with an eerie silence. The ground where Feng Chen had stood moments ago was scorched, shattered, and marked by traces of ice and lightning—evidence of the overwhelming force used against him. Not a single trace of Feng Chen could be found in the center of the destruction. <br/><br/>Bai Zhang's lips twisted into a triumphant grin as he took in the sight, his laughter echoing in the stunned silence. \"Haha… I told you not to act so arrogant. Now, look at what became of you. Not even a dead body was left!\" He sneered, crossing his arms with a look of smug satisfaction. \"In the end, you were just another overconfident fool.\" <br/><br/>\"Yeah, yeah, you are right. He was an overconfident fool!\" <br/><br/>A voice said, agreeing with Bai Zhang. <br/><br/>Bai Zhang was happy that someone shared the same view as him and turned to that person. He thought that there was finally someone who could understand him. <br/><br/>\"Indeed, your vision is not bad… \" <br/><br/>But as he looked at the speaker, his eyes widened in shock. His voice dropped from a triumphant pitch to a low, almost inaudible tone as he processed the unexpected sight before him. <br/><br/>\"Feng Chen?\" <br/><br/>Bai Zhang exclaimed. <br/><br/>\"How are you still alive?\" <br/><br/>Bai Zhang asked, still not believing what he was seeing. <br/><br/>\"Hehe… Why? Thought I was dead?\" <br/><br/>Feng Chen asked in an amusing way. How could he have died from those attacks? He had dodged them the moment they were about to hit him and swiftly went over to where Bai Zhang and the others were. <br/><br/>The subsequent attacks were utterly useless and a waste of Qi. <br/><br/>All eyes were fixed on Feng Chen, with some showing surprise and others clear relief. Not everyone wanted to kill Feng Chen and just wanted to stall him.  Searᴄh the nôᴠel Fire.nёt website on Google to access chapters of novels early and in the highest quality.<br/><br/>The one who was surprised didn't understand just how Feng Chen survived under the barrage of their attacks. <br/><br/>Even Tianlong Qi and Yuan Hao, both at the peak of the Three Elements Divine Realm, might have struggled against such a fierce onslaught. Yet, not only did Feng Chen survive, but he emerged entirely unscathed, with not even a speck of dust upon him. <br/><br/>Of course, they never saw him move. They didn't realize he had been behind them the whole time and mistakenly believed he was caught in the barrage of their techniques. <br/><br/>\"I thought that I would play with you all but I don't have time for that. Bye!\" <br/><br/>Feng Chen said as he disappeared into the distance. <br/><br/>Feng Chen could take care of all of them but that would mean wasting more time. Since this was a race, there was no need for him to unnecessarily fight with them. Although he could take care of them in seconds, that would also mean showing his real strength which wasn't worth it for those weaklings. <br/><br/>Bai Zhang quickly reacts to Feng Chen's going away. <br/><br/>\"Don't let him get away!\" Bai Zhang shouted, frustration clear in his voice. He leaped forward, using his qi to increase his speed. The other clan leaders also snapped out of their shock, rushing forward as Feng Chen's figure blurred into motion, disappearing into the forest with remarkable speed. They moved swiftly, channeling their qi to heighten their speed, but no matter how they strained to catch up, Feng Chen seemed to keep his distance effortlessly. The gap between them and Feng Chen only widened, each step he took seeming to blur faster than the last as if he was increasing his speed instead of getting tired even after many had hit their top speed. <br/><br/>In the midst of their pursuit, Bai Zhang clenched his jaw, fury brewing within him. His pride had already taken a hit, and now Feng Chen's unbothered retreat only fueled his anger. <br/><br/>He wouldn't have cared if Feng Chen had simply run away, but it was the way Feng Chen had insulted and mocked him, treating him with such disdain, that angered him. If Feng Chen had fled after being battered and beaten, Bai Zhang would have been grinning with satisfaction. <br/><br/>\"He won't get far!\" Bai Zhang growled, attempting to boost the morale of the others, especially those who had even started to give up. \"We still outnumber him. Don't let up!\" <br/><br/>As they pushed forward, the dense forest ahead suddenly erupted with an eerie silence, disturbed only by the faintest whisper of leaves and the sound of their own footsteps. The path before them, however, was empty—Feng Chen was nowhere to be seen. <br/><br/>One of the clan leaders, breathless from the pursuit, paused and scanned the area. \"Where is he? I don't see him anywhere,\" he muttered, doubt creeping into his voice. <br/><br/>He was after all Grand Qi Condensation Realm who if ambushed by Feng Chen wouldn't stand a chance. <br/><br/>Bai Zhang's eyes narrowed, his face flushed with frustration and a hint of worry. He knew that if they lost track of Feng Chen now, any hope of currying favor with Tianlong Qi would slip through their fingers, and the missed opportunity would not easily be forgiven. <br/><br/>Suddenly, a sharp laugh echoed from the shadows ahead. It was Feng Chen's voice, calm and mocking, amplified by the silence of the forest. <br/><br/>\"Is that all you've got?\" Feng Chen's voice taunted. \"I even went a bit slower for the sake of you all!\" <br/><br/>Bai Zhang's fists tightened as he scanned the shadows, attempting to locate the source of the voice. \"Show yourself!\" He shouted, unable to keep the frustration from his tone. <br/><br/>Another chuckle from Feng Chen drifted through the trees, elusive and distant. \"There!\" <br/><br/>Bai Zhang spotted Feng Chen and quickly pointed in his direction. <br/><br/>\"Hurry, follow him, or we'll lose track of him again!\" <br/><br/>Bai Zhang shouted as he quickened his pace, with the others swiftly following behind him. <br/><br/>Although they could see Feng Chen, he was getting further and further away from them. <br/><br/>But then there appeared a hope for them. <br/><br/>\"There is a Rank-5 Monster ahead! Feng Chen will obviously slow down. We need to take this chance to take him down!\" <br/><br/>Bai Zhang commanded. He believed that Feng Chen's luck had finally run out, and sure enough, Feng Chen began to slow down as he closed in on the monster. <br/><br/>\"Haha… Feng Chen, your luck has run out!\" <br/><br/>Bai Zhang exclaimed happily. <br/><br/>As Bai Zhang and the other clan leaders rushed forward, their eyes fixed on Feng Chen's figure, they could feel the excitement of finally closing in on their target. Their speed had increased, and each of them determined to capture Feng Chen. <br/><br/>Feng Chen, however, didn't seem to be worried at all and still continued sprinting forward. <br/><br/>GROWL! <br/><br/>Suddenly, a low growl echoed through the forest, and a powerful, rumbling vibration made the ground tremble beneath their feet. The Rank 5 Monster seemed to have noticed them and was obviously angry that they dared to come into his territory. <br/><br/>\"Perfect!\" Bai Zhang muttered under his breath, a malicious grin creeping onto his face. <br/><br/>Now, Feng Chen either has to fight with the Rank 5 monster or come back where he would need to face them. <br/><br/>Either way, Bai Zhang thought that Feng Chen was finished. <br/><br/>They pushed forward, eager to see Feng Chen trapped by the powerful Rank-5 Monster. But then, as they got closer, a chilling realization hit Bai Zhang. <br/><br/>Something wasn't right. <br/><br/>The Feng Chen they were chasing was suddenly gone. <br/><br/>There was no sign of him. <br/><br/>A faint whisper of wind passed through the trees, and Bai Zhang froze his heart racing. ( Again? ) <br/><br/>The shadow of the monster loomed ahead, but Feng Chen's figure was nowhere to be seen. <br/><br/>\"Where is he?\" \t\t\t\t\t\t</div>", "images": {}, "success": true}