{"id": 110, "url": "https://www.novelhall.com/my-brothers-the-protagonist-good-thing-i-awakened-my-system-33973/15047764.html", "title": "Chapter 111 Tianlong Ping", "volume": 2, "volume_title": "Volume 2", "body": "<h1>Chapter 111 Tianlong Ping</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\t Chapter 111  Tianlong Ping \"Brother Yun, how on earth did you break through so quickly?\" Feng Liang asked, astonishment etched on his face. <br/><br/>He had thought his own method was the best and fastest, but Feng Yun had surpassed him. <br/><br/>Although he didn't underestimate Feng Yun, he didn't believe that Rank-2 Formation could be broken with just their Core Formation Stage strength. <br/><br/>Feng Yun didn't hide anything and told him exactly how he did it. <br/><br/>\"That's why I said that I won just because I was lucky.\" <br/><br/>Feng Yun said after narrating his story. <br/><br/>Feng Liang listened to Feng Yun and also understood the reason. But at the same time, he was also thinking about just how he could prevent people like Feng Yun from breaking his Formation. <br/><br/>He was already thinking about some formation that he could make and have Feng Yun test it out for him. <br/><br/>\"Brother Liang, have you become a Rank-2 Formation Master?\" Feng Yun asked, interrupting Feng Liang's thoughts. <br/><br/>Thinking about the time taken for Feng Liang to solve the Rank-2 Formation, Feng Yun didn't think that a Rank-1 Formation Master could break them so quickly. <br/><br/>\"Yes!\"  seaʀᴄh thё Nôvelƒire.net website on Google to access chapters of novels early and in the highest quality.<br/><br/>Feng Liang didn't hide it and admitted it right away. He hadn't mentioned it earlier because the Eastern Gathering was taking place, and he planned to share the news afterward. <br/><br/>Anyway, he didn't think his achievement in Formation could be of any help in the Eastern Gathering. <br/><br/>But who knew that the second round of the competition would be to break formations? \"Haha... Nice! Brother Liang is indeed a genius of Formation. I couldn't even reach Rank 1 and you already reached Rank 2!\" <br/><br/>Feng Yun complimented. Since he was also studying formations, he recognized just how talented Feng Liang was in that area. <br/><br/>Not to boast, but he was one of the smartest individuals and could easily master martial arts techniques; however, when it came to learning formations, he struggled to excel despite his intelligence. <br/><br/>Learning Formations is much like Alchemy; it requires inherent talent, and Feng Liang's aptitude for formations was truly exceptional. <br/><br/>Even his Master Minghao praised Feng Liang as talented in Formation. Even went as far as saying that his friend would have been eager to have Feng Liang as his disciple if he knew about his talent. <br/><br/>Just looking at how knowledgeable and powerful his master seemed to have been, his friend was someone who couldn't be underestimated. <br/><br/>If fate allowed, maybe in the future, Feng Liang could truly become Master Mingaho's friend's disciple. <br/><br/>Although Feng Yun didn't necessarily want to focus on studying formation, it was good to have certain knowledge. Who knows when that knowledge would be helpful to him in the future? Of course, much of his time went to cultivation and Alchemy. <br/><br/>Talking with each other, Feng Yun and Feng Liang made their way towards the Tianlong Mansion. <br/><br/>After reaching the Tianlong Mansion, they were met with congratulatory remarks from others in the vicinity. <br/><br/>\"Congratulations, Feng Yun! You truly outdid yourself!\" <br/><br/>\"As expected of someone who climbed to the 18th step of the Pillar Of Aptitude.\" \"Feng Liang, congratulations on being second. If you ever visit our cities, remember to tell me; I will make sure that you have the finest accommodations and enjoy the best our clans have to offer.\" <br/><br/>… <br/><br/>Feng Yun and Feng Liang politely nodded their compliment but didn't become arrogant. They have experienced both lows and highs in their life and knew that without power, nobody would care about them. <br/><br/>\"Brother Yun! Brother Liang! You both were amazing!\" <br/><br/>Feng Xiaoyu was praised. <br/><br/>\"Brother Yun, I knew you could do it!\" <br/><br/>Feng Mei also added. <br/><br/>\"Congratulations, to both of you! You made our clan proud!\" <br/><br/>Feng Yun said with a smile. <br/><br/>Not only did he win the bet and acquire One Million Gold Coin, but he has also gotten the System Reward. <br/><br/>[Sub-Mission 2 Complete: Secure the top position in the second round of the Eastern Gathering Competition.] <br/><br/>[Rewards: 50,000 System Points] <br/><br/>[Main Mission Progress: 2/4 Tasks Completed] <br/><br/>This time, earning System Points felt like simply sitting back and letting others do all the work for him. <br/><br/>As they listened to the praise from their clan members, both Feng Liang and Feng Yun felt a swell of pride. While they might take the opinions of outsiders with a grain of salt, they held a different weight coming from those close to them. After all, who wouldn't want to make their loved ones proud and receive their compliments? <br/><br/>They talked with each other and Feng Yun also bragged a bit to Feng Mei about his experience. <br/><br/>But Feng Mei didn't tell Feng Yun about the Ice Veil Sect offer and kept it for later. <br/><br/>However, Feng Yun had already noticed the Ice Veil Sect seated right next to his brother and suspected their intentions. With Feng Mei showcasing her talent, it was clear that the Ice Veil Sect had their sights set on her. Even though he had a good idea of what was going on, he chose not to confront Feng Mei directly. If she didn't want to share her thoughts with him, he didn't want to pry and make her uncomfortable. <br/><br/>After about an hour had passed, the crowd began to engage in their own activities. With the second round already secured by the Feng Clan, watching others break formations had lost its appeal. For one, the competitors merely attacked the formation, and for others, they focused on studying the formation and trying to control it or find an opening. <br/><br/>BANG! <br/><br/>\"Look, finally another participant managed to break the Formation!\" <br/><br/>After a long wait, someone aside from the Feng Clan finally managed to break through the formation. Though the excitement wasn't as high as when Feng Yun succeeded, the crowd still paid attention, eager to discover who it was. <br/><br/>This time, it was Tianlong Ping, one of Tianlong Qi's most promising geniuses. <br/><br/>She appeared to be very happy, believing she was in first place since she had broken through the formation before the two-hour mark. <br/><br/>As someone who studies Formation, she knew that there was no one in the participant who would be capable of breaking the Formation before two hours as she did. <br/><br/>\"First place is mine!\" <br/><br/>She declared!\t\t\t\t\t\t</div>", "images": {}, "success": true}