{"id": 111, "url": "https://www.novelhall.com/my-brothers-the-protagonist-good-thing-i-awakened-my-system-33973/15047765.html", "title": "Chapter 112 I Am Third?", "volume": 2, "volume_title": "Volume 2", "body": "<h1>Chapter 112 I Am Third?</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\t Chapter 112  I Am Third? She quickly made her way toward Tianlong Mansion with an arrogant grin on her face. <br/><br/>However, upon reaching the Tianlong Mansion, she was met not with praise or celebration, but with pitying glances from those around her. <br/><br/>Many had similar thoughts that if not for those monstrous Feng Clan participants, this girl would have gotten the first place. <br/><br/>She didn't know why and turned towards her clan whose mood was even worse. <br/><br/>Tianlong Qi was even glaring at her angrily as if she had done something wrong. <br/><br/>( This shouldn't be right! ) <br/><br/>She thought to herself that she should be praised and rewarded, not met with cold looks as if she were worthless. <br/><br/>Amidst her confusion, she saw Feng Yun. With his handsome appearance, it was easy for her to notice him even among hundreds of people. <br/><br/>\"That means– \" <br/><br/>She finally grasped something and instantly turned her head towards the Heavenly Projection Crystal where the ranking of the round was displayed. <br/><br/>\"Third Place?\" <br/><br/>She muttered in shock as her eyes widened. She wasn't even in second place, let alone the first place. Looking at the ranking, she knew it was another Feng Clan member who had taken second place. <br/><br/>\"How is this possible?\" <br/><br/>She couldn't believe it. With her mastery of formations and advanced practice on the same formation as in the competition, she had been certain she would be the fastest, yet she still failed despite all her efforts. <br/><br/>\"How could they be faster than me?\" <br/><br/>Moreover, even if she was in third place, she was quite fast and even if she failed, how could her clan leader and elders look at her so coldly? <br/><br/>( It is not me but them who are monsters! ) <br/><br/>She could not help but curse in her heart. She didn't know that her loss cost Tianlong Qi 1 million gold coins. <br/><br/>Though if she found out then she would feel more wrong because it wasn't her fault! <br/><br/>Meanwhile, Tianlong Yu was bathed in a cold, icy aura, beads of sweat rolling down his forehead as he launched a final, concentrated attack at his Rank-2 Formation. He practiced the same formation many times and knew that it was on the verge of breaking. <br/><br/>The crystal-blue energy surrounding him surged forward, shattering the formation into glistening shards. <br/><br/>He also seemed happy and excited just like Tianlong Ping and immediately made his way towards the Tianlong Mnasion thinking that he was first. <br/><br/>And of course, he was hit with reality when he saw Tianlong Ping whose mood was down. <br/><br/>He thought that even if he wasn't first, he was second and the only reason is because Tianlong Ping was a Formation Master and believed that only she could have defeated him. <br/><br/>But he was confused as to why she and the other clan members' expressions looked odd. <br/><br/>Shouldn't they be celebrating for getting first place? <br/><br/>He approached Tianlong Ping to ask, \"Why are you so down? Didn't we win?\" <br/><br/>Tianlong Ping only pointed her fingers at the ranking shown on the Heavenly Projection Crystal with her head down. <br/><br/>He was confused by her behavior but did what she asked. His eyes widened as he stared at the ranking. <br/><br/>\"I-I am fourth!\" <br/><br/>He said in shock. Quickly he then found out who was in first and second place. <br/><br/>\"FENG YUN!\" <br/><br/>Tianlong Yu roared angrily as he stared at Feng Yun's name in the first place. He couldn't do anything about his talent, however, he believed that in terms of strength, he was more powerful, and with an already-prepared plan, he would undoubtedly defeat Feng Yun. <br/><br/>Despite that, he found out that he had lost again to the same person. <br/><br/>He just couldn't digest that. <br/><br/>If he could, he would have marched over to the Feng Clan and vented his anger and frustration directly at Feng Yun.  S~eaʀᴄh the ηovelFire.ηet website on Google to access chapters of novels early and in the highest quality.<br/><br/>However, with so many eyes watching, he knew better than to act rashly. The last thing he wanted was to make a fool of himself. <br/><br/>He stood there, feeling angry at Feng Yun and glaring at him with resentment. <br/><br/>After a few more hours, other participants also started to show up. <br/><br/>Yuan Ziyan was the person who showed up after Tianlong Yu, followed by Hu Lian and Yuan Ling. <br/><br/>Yuan Ziyan didn't seem as surprised as one would expect when finding out that Feng Yun, who has lower cultivation than her, was able to surpass her. <br/><br/>After six hours, the second round finally ended but more than half of the participants were still stuck inside the formation. <br/><br/>It seemed that the Rank-2 Formation was too challenging for them, and no matter how much time they had, they wouldn't be able to break free. <br/><br/>\"Thank you, everyone, for your patience,\" Tianlong Zhen's deep voice cut through the murmuring wind, commanding the attention of everyone present. <br/><br/>\"The second round of the Eastern Gathering has officially come to an end. Now, let's review the points earned by each clan.\" <br/><br/>He took a deep breath before continuing, \"In this round, the Feng Clan has earned over 380 points, bringing their total to an impressive 820 points, securing their position as the overall first in this competition.\" <br/><br/>The crowd buzzed with murmurs as Tianlong Zhen continued to announce the point of each clan. <br/><br/>Looking at the overall Clan Rankings, the standings remain the same for the top three: the Yuan Clan holds second place with 610 points, while the Tianlong Clan stands in third place with 600 points. <br/><br/>There was a hint of frustration and helplessness in Tianlong Zhen's voice as he announced the ranking. Their Tianlong Clan, who should have claimed first place, was now trailing in third, despite their manipulation in the second round. <br/><br/>The gap between them and the Feng Clan was enormous, so much so that Tianlong Zhen doubted whether the upcoming rounds could change their fate. The only way to catch up would be for the Feng Clan to place at the bottom ranking in both of the next rounds. <br/><br/>But even then, the Tianlong Clan would need to secure first place in both the third and fourth rounds—a daunting task with little room for error. The odds were stacked against them, and the chance of getting the first position in the Eastern Gathering seemed almost impossible.\t\t\t\t\t\t</div>", "images": {}, "success": true}