{"id": 115, "url": "https://www.novelhall.com/my-brothers-the-protagonist-good-thing-i-awakened-my-system-33973/15052467.html", "title": "Chapter 116 End Of Third Round Of Eastern Gathering", "volume": 2, "volume_title": "Volume 2", "body": "<h1>Chapter 116 End Of Third Round Of Eastern Gathering</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\t Chapter 116  End Of Third Round Of Eastern Gathering Feng Xiaoyu studied the beast with a keen, calculating gaze, recalling the countless hours she had spent in the Astral Training Pavilion. She had faced the same beasts before and had learned their patterns and weaknesses. <br/><br/>She could still remember running away from her after she defeated much of their kin. <br/><br/>Despite its intimidating exterior and formidable defense, the Bloodfang Beast had a vulnerability right at the center of its chest, where its scales were slightly thinner and less densely packed. It was a small, pulsing point where its heart was closer to the surface, a spot that even this mighty monster couldn't fully shield. <br/><br/>Even if a Foundation Establishment Stage cultivator hit that area with their power, they had the chance to defeat this monster.  Sёarᴄh the NôvelFire(.)net website on Google to access chapters of novels early and in the highest quality.<br/><br/>But of course, hitting there isn't as easy as it sounds because Bloodfang Beast would protect that area well. <br/><br/>However, Feng Xiaoyu wasn't worried. She had to take advantage of Bloodfang Weakness previously when she was a Foundation Establishment Stage cultivator but since then she didn't need to. <br/><br/>Even when she engaged in direct combat without specifically targeting the Bloodfang Beast's chest, she had triumphed countless times since reaching the Core Formation Stage. <br/><br/>\"Come on, big guy!\" Feng Xiaoyu said to the Bloodfang Beast, her voice almost teasing. \"Show me what you've got!\" <br/><br/>As if provoked by her words, the monster roared and lunged forward, its massive jaws snapping at her. The ground beneath her feet quaked with each of the creature's powerful strides. Feng Xiaoyu sprang into action, her movements graceful yet swift. She sidestepped the beast's charge, barely avoiding its massive claws, and landed lightly several feet away. <br/><br/>The Bloodfang Beast skidded to a stop and whipped around, anger blazing in its eyes. It charged again, faster and more frenzied this time, but Feng Xiaoyu was ready. She continued to evade its attacks, nimbly dodging each swipe and snapping jaw, all while observing its behavior. \"Stop running and fight him!\" Someone from the crowd jeered, but Feng Xiaoyu paid no mind. She knew the beast's true strength lay in its berserk momentum. If she wanted to strike its weak point, she needed to wait for the right moment—when it was most vulnerable and off-balance. <br/><br/>RAWWWR! <br/><br/>The Bloodfang Beast roared, its rage peaking. This time, it reared up on its hind legs, intending to crush her with its full weight. As it came crashing down, Feng Xiaoyu saw her opening. In that split second when its chest was exposed and its heart pulsed just beneath the surface, she made her move. <br/><br/>Gathering her Qi, Feng Xiaoyu propelled herself forward with astonishing speed, her palm glowing with a concentrated burst of energy. \"Earth Shattering Palm!\" She shouted, driving her glowing palm directly into the Bloodfang Beast's vulnerable chest. Her strike was precise, channeling her energy straight into the monster's heart. The impact reverberated through the arena, and the crowd fell silent. <br/><br/>GRRAAAH! <br/><br/>The Bloodfang Beast let out a deafening, agonized roar as the energy burst through its chest, bypassing its natural defenses. Its eyes widened in shock, and a moment later, the monster collapsed, its heavy body thudding to the ground, motionless. <br/><br/>Gasps of astonishment rippled through the crowd. Even Tianlong Qi's smug smirk faltered as he realized that the monster he had chosen specifically to humiliate the Feng Clan had been defeated with a single, well-executed strike. <br/><br/>He thought that Feng Xiaoyu was running around because she was scared and couldn't fight with Bloodfang Beast. <br/><br/>He even considered making fun of her indirectly in front of Feng Chen, but fortunately, he held back; otherwise, he would have ended up humiliating himself again. <br/><br/>Feng Xiaoyu maintained her composure as she watched the Bloodfang Beast, ensuring it was truly dead. Only after she confirmed its demise did she step away. <br/><br/>The crowd erupted into a mixture of cheers and astonished murmurs. Even some of the harshest critics found themselves impressed by Feng Xiaoyu's execution. <br/><br/>It wasn't that Feng Xiaoyu used any overwhelming power or anything like Yuan Ziyan. However, each step was impeccable and she used the most optimal way to take care of the monster without wasting any Qi. <br/><br/>If one has to say something about her fighting, it would be called PERFECTION! <br/><br/>Ice Fairy and Icy Veil Sect's elders were obviously impressed by Feng Xiaoyu's way of defeating the Bloodfang Beast. <br/><br/>\"Sect Leader, we need to recruit Feng Xiaoyu at any cost!\" <br/><br/>One of the elders said impatiently. Previously, they thought of Feng Xiaoyu as someone who they needed to recruit in order to get Feng Mei. <br/><br/>But now they have changed their mind. Feng Xiaoyu wasn't any short of being a genius herself. <br/><br/>Although her aptitude wasn't as high as Feng Mei's, her efficient fighting style—marked by minimal wasted movement and optimal use of Qi to finish her opponent at the perfect moment—was exceedingly rare. <br/><br/>Ice Fairy nodded her head and also thought the same. <br/><br/>Such fighting style was extremely rare and needed a thorough understanding of the opponent as well as oneself. Even she couldn't say that she could have done the same when she was in the Core Formation Stage. <br/><br/>Defeating Bloodfang Beast would already be enough for them to warrant their interest, not to mention in such a way. <br/><br/>The Icy Veil Sect was naturally pleased to see such potential in someone they had already invited to join and realized they would need to step up their efforts to secure Feng Xiaoyu as well. <br/><br/>\"Good job, Sister Xiaoyu. That was incredible!\" <br/><br/>Feng Mei complimented. <br/><br/>\"Hehe… Thank you. And Sister Mei, good luck!\" <br/><br/>Feng Xiaoyu replied. <br/><br/>Feng Mei nodded and stepped forward, but Tianlong Zhen remained silent, his face still displaying a look of shock. <br/><br/>Tianlong Zhen finally regained his composure and turned his attention to Feng Mei. He hadn't expected the Feng Clan to perform so well, especially not with the Bloodfang Beast, a monster he had deemed nearly unbeatable for their participants. <br/><br/>Moreover, Feng Xiaoyu was someone they had underestimated, and didn't think of her as anyone special. <br/><br/>But they were proven wrong yet again and it turns out that Feng Xiaoyu was another monster from the Feng Clan. <br/><br/>Tianlong Zhen shouted, \"What rank of monster will you challenge?\" <br/><br/>\"Rank 3!\" Feng Mei answered with a calm voice. <br/><br/>Feng Mei faced the Thunderfang Wolf, a creature known for its incredible speed. Its speed is said to match that of Grand Qi Condensation Realm experts and is almost impossible to catch for the Core Formation Stage. <br/><br/>However, Feng Mei moved even faster with Ghostly Shadow Mirage, effortlessly sidestepping its swift strikes. With precise movements, she took the beast down in an instant, showcasing her superior agility and skill. <br/><br/>The Thunderfang Wolf was renowned for its incredible speed; as long as you could land a powerful hit, victory was within reach. While its speed was unmatched, its defense was far inferior to that of the Bloodfang Beast. <br/><br/>The crowd was as stunned as when Feng Xiaoyu was defeated because the Feng Xiaoyu feat was unexpected. <br/><br/>Of course, there were still compliments flying towards the Feng Clan and also saying how powerful the technique Feng Mei used was. <br/><br/>Ice Fairy also thought deeply about the movement technique that Feng Mei used. <br/><br/>( It seems like her technique is even more powerful than mine! ) <br/><br/>Ice Fairy thought. With her Nascent Soul Realm power, it was easy for her to comprehend just how powerful the technique was. <br/><br/>( But how is this possible? My movement technique is a High-Level Earth-Grade Technique, there couldn't be a more powerful movement Technique than this. ) <br/><br/>( Could it be… ) <br/><br/>After thinking for a while, she came to a scary conclusion that she didn't think was real. <br/><br/>\"There is no way!\" <br/><br/>She muttered. She didn't think it could be Heaven Grade Technique which is so precious that sects could go on a war for one. <br/><br/>On the stage, Feng Jianhong stood and he also chose a Rank 3 monster like the other two. <br/><br/>Feng Jianhong confronted the Shadowclaw Tiger, a formidable opponent renowned for its stealth and ferocity. Yet, he swiftly outmaneuvered it, dodging its attacks and landing a decisive blow that left the crowd in awe. As the Shadowclaw Tiger lay defeated at his feet, the crowd erupted into cheers, the atmosphere electric with excitement. <br/><br/>Feng Jianhong stepped back, a proud smile on his face as he turned to acknowledge the roaring applause. The earlier skepticism about the Feng Clan's choices had evaporated, replaced by admiration for their skill and strength. <br/><br/>\"Three out of three!\" \"The Feng Clan participants each have defeated a Rank 3 monster!\" <br/><br/>\"Damn! They got 300 points and once again further widened the gap.\" <br/><br/>\"I thought that they might finally lose their first place. Looks like I was too narrow-minded and first place will belong to the Feng Clan.\" <br/><br/>…. Even the members of the other clans couldn't help but acknowledge the prowess displayed by the Feng participants. They didn't just show that they have high talent but that their strength was also on the next level compared to them. <br/><br/>Tianlong Qi, however, clenched his fists, his face a mask of frustration. The smug confidence he had exuded earlier had vanished, replaced by a sense of dread as he calculated the potential fallout from this round. <br/><br/>With the points from this round, the Feng Clan now had a staggering total of 1,120 points, far ahead of the Yuan Clan's 860 and the Tianlong Clan's 800. The gap was wider than he could have imagined, and it was becoming increasingly evident that the Feng Clan will secure the first place in the Eastern Gathering.\t\t\t\t\t\t</div>", "images": {}, "success": true}