{"id": 123, "url": "https://www.novelhall.com/my-brothers-the-protagonist-good-thing-i-awakened-my-system-33973/15098214.html", "title": "Chapter 124 System Is Being Generous", "volume": 2, "volume_title": "Volume 2", "body": "<h1>Chapter 124 System Is Being Generous</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\t Chapter 124  System Is Being Generous As Feng Chen sat among his clan members, a faint smile touched his lips, though his gaze remained calm and composed. He glanced over the gathering crowd, knowing that the competition had shifted their view of the Feng Clan permanently. The murmurs of respect and awe rippled through the spectators, and those clans whose clan leaders fought with Feng Chen all looked at Feng Clan with envy. <br/><br/>After what their clan leader had done, they knew that there was no chance for them to ally themselves with the Feng Clan. <br/><br/>Although they had hoped to avoid becoming enemies, they knew that if the two clans fought, they stood no chance against the Feng Clan. <br/><br/>After all, ten clan leaders couldn't handle Feng Chen and even Tianlong Qi failed to kill him. <br/><br/>So, how could any one of them expect to survive if they fought with the Feng Clan? <br/><br/>Anyways, while waiting for the round to end, most of the clan took this opportunity to try to please the Feng Clan as much as possible. <br/><br/>On the other hand, Tianlong Qi was nowhere to be seen. It seemed that he had gone somewhere after he had finished the race and wasn't planning to show up. <br/><br/>Well, other Tianlong Clan Members also wanted to leave as they didn't want to see other clans kissing Feng Clan's ass. <br/><br/>However, as the host of the Eastern Gathering, they couldn't do that, especially Tianlong Zhen who still had to announce the result. <br/><br/>Feng Chen listened to all the compliments coming his way, but he didn't take them seriously. <br/><br/>While doing so, from the corner of his eye, he caught a glimpse of the Ice Fairy, Bing Xue. <br/><br/>She has been watching him intently which Feng Chen has already known. <br/><br/>And the way she was looking at him has also changed from before. <br/><br/>Yesterday, she had been polite and respectful, but that was mostly due to Feng Mei. Now, however, it seemed things had changed. <br/><br/>Bing Xue now seemed to regard Feng Chen as someone worthy of respect, independent of his connection to Feng Mei. Even if that link didn't exist, she would still have held him in high regard. <br/><br/>After all, she believed that Feng Chen would soon join her rank with other Nascent Soul Realm cultivators. <br/><br/>Reaching Nascent Soul Realm in the Azure Sky Empire was very rare and anyone who could do that was worthy of respect. <br/><br/>Feng Chen, on the other hand, was vigilant about the Ice Fairy watching him. He knew that if there was someone who could see through his cultivation in this entire Tianlong Mansion then it would be Ice Fairy. <br/><br/>However, he was also confident that she wouldn't know because his disguise was perfect without any flaw. <br/><br/>As long as he doesn't reveal his real cultivation or use Nascent Soul Realm power, even a Nascent Soul Realm cultivator wouldn't know that his cultivation is also in the Nascent Soul Realm. <br/><br/>Of course, there are exceptions and those with special skills, maybe something like his Eyes Of Insight might be able to see through his disguise. <br/><br/>[Sub-Mission 4 Complete: Secure the top position in the fourth round of the Eastern Gathering Competition.] <br/><br/>[Rewards: 100,000 System Points] <br/><br/>[Main Mission Progress: 4/4 Tasks Completed] <br/><br/>Just when he was thinking about Ice Fairy seeing through him, he got a System notification about the mission that he completed. <br/><br/>And the reward for the completion wasn't small either. With this, his total System Points has become 300,000 which was enough to buy three Heaven Grade Techniques. <br/><br/>Feng Chen's lips curved slightly at the words, though his expression remained composed. He was more intrigued by the System's next message, which appeared almost immediately after the first. <br/><br/>[ Congratulations, Host! You have successfully completed all four Sub-Missions for the Eastern Gathering Competition. ] <br/><br/>[ You have unlocked an additional reward.] <br/><br/>( As expected! ) <br/><br/>Feng Chen couldn't help but become excited. He thought that perhaps the System might give him something special for completing all his sub-mission and it turns out that he was right. <br/><br/>[ Additional Reward: High-Level Saint Grade Mind Technique: Soul Severing Slash ] <br/><br/>There was also a small description of the skill below the reward section. <br/><br/>Soul Severing Slash is a rare and forbidden technique that allows the practitioner to sever or damage the soul of their target directly with focused spiritual energy. It is a brutal and devastating mental strike, utilizing the practitioner's soul force to create a spiritual blade capable of cutting through even the most powerful mental and soul defenses. <br/><br/>Feng Chen blinked in surprise, his eyes flicking briefly to his surroundings. This technique which didn't seem like anything at first glance was something that could be considered the kryptonite of Nascent Soul Real cultivator. <br/><br/>One should know that after reaching the Nascent Soul Realm, their body wasn't as important as their soul. Even if one's body were cut into pieces, as long as the soul remained, the person would be able to revive through various means. <br/><br/>It could be done either by taking another's body or using a high-grade puppet artifact. In either case, simply destroying their physical form wouldn't be enough to completely kill a Nascent Soul Realm cultivator. <br/><br/>Of course, the price paid for dying wasn't small and the Nascent Soul Realm cultivator wasn't immortal by any chance.  seaʀᴄh thё ηovelFire.ηet website on Google to access chapters of novels early and in the highest quality.<br/><br/>Even if they revive, their cultivation would be reduced by many times and even their cultivation speed would be cut down. But at least, that is better than dying outright. <br/><br/>So, even for another Nascent Soul Realm Cultivator, it was extremely difficult for one to completely destroy another Nascent Soul Realm cultivator. <br/><br/>But with this technique, there were no second chances for the Nascent Soul Realm as their soul would directly be destroyed. <br/><br/>And looking at the grade of technique, this technique was only effective for Nascent Soul Realm cultivators. <br/><br/>Moreover, there are various monsters who are physically very strong but lack soul power. It could be efficient against such opponents as well. <br/><br/>( Perhaps after learning this technique, no one in the Azure Sky Empire would be my opponent. ) <br/><br/>Feng Chen thought. Of course, he also knew that there could be a lot of hidden powerhouses just like in various novels that he read, and wouldn't dare be arrogant. <br/><br/>But at least, he was confident to fight against the currently known powerhouse of the Azure Sky Empire. <br/><br/>As Feng Chen remained deep in thought, a soft voice interrupted his musings. <br/><br/>\"Feng Clan Leader,\" came a voice from behind him. <br/><br/>He turned to see Bing Xue standing just a few steps away, her gaze no longer distant but rather focused. \"Congratulations on your victory,\" she said, her tone genuine. \"The Feng Clan has certainly made an impression today.\" <br/><br/>Feng Chen offered a polite nod, but his mind was elsewhere. Her acknowledgment, though respectful, felt more like a subtle test. She was sharp, as always, and no doubt trying to assess his true strength. He had to remain vigilant! <br/><br/>\"Thank you, Ice Fairy!\" he replied evenly. Ice Fairy still couldn't get used to Feng Chen's attitude towards her. Other than replying out of politeness towards her, she couldn't sense any other emotion. <br/><br/>This indeed hurt her pride a bit but she quickly recovered from it. But she couldn't do anything about it as this was the first time anyone treated her as such. <br/><br/>As the murmurs of admiration and envy continued to echo through the gathering, the atmosphere shifted in anticipation. The competition had ended, and the remaining participants slowly began to file into the Tianlong Mansion's grand hall. Their faces reflected a mix of awe, disbelief, and, in some cases, barely concealed resentment. Bai Zhang in particular couldn't hide his resentment and all his hatred was targeted towards Feng Chen. <br/><br/>The Tianlong Clan had been the hosts of this Eastern Gathering, but after the results of the competition, it seemed their role had become a background presence to the overwhelming dominance of the Feng Clan. <br/><br/>Tianlong Zhen glanced at the exit of the hall. He knew that, despite his reluctance, he had a responsibility. Meanwhile, at the front of the hall, Tianlong Zhen stood with his hands clasped behind his back, his brow furrowed. The Tianlong Clan had been the hosts of this Eastern Gathering, but after the results of the competition, it seemed their role had become a background presence to the overwhelming dominance of the Feng Clan. <br/><br/>Tianlong Zhen glanced at the exit of the hall. He knew that, despite his reluctance, he had a responsibility. He was the one who had to announce the results, a task that had been meant to bring honor to his clan. But now, with Feng Chen's overwhelming victory, the announcement would likely only serve to further highlight the superiority of the Feng Clan. His fingers twitched in frustration, but he knew better than to let his personal feelings cloud his judgment. <br/><br/>\"Well, it seems I must be the one to make this announcement.\" Tianlong Zhen muttered under his breath, his voice tinged with reluctant resolve. <br/><br/>He took a deep breath and stepped forward, commanding the attention of everyone in the hall. \"Everyone!\" Tianlong Zhen's voice rang out. \"The fourth round of the Eastern Gathering Competition has come to a close. The results are now in.\" <br/><br/>He paused, his eyes briefly flicking toward Feng Chen, who stood with an air of calm composure, as though this was all just another step in his journey. Feng Chen's nonchalant demeanor only added to Tianlong Zhen's irritation. \"The winner of this round,\" Tianlong Zhen continued, forcing a smile, \"and the overall victor of this year's Eastern Gathering is none other than Feng Clan!\" \t\t\t\t\t\t</div>", "images": {}, "success": true}