{"id": 122, "url": "https://www.novelhall.com/my-brothers-the-protagonist-good-thing-i-awakened-my-system-33973/15098213.html", "title": "Chapter 123 Feng Chen Takes The Win!", "volume": 2, "volume_title": "Volume 2", "body": "<h1>Chapter 123 Feng Chen Takes The Win!</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\t Chapter 123  Feng Chen Takes The Win! People in the Tianlong Mansion also watched as Feng Chen reached the finish line with an overwhelming display of speed. Their eyes locked on Feng Chen, who had a calm expression on his face. <br/><br/>His expression remained unchanged, undisturbed by Tianlong Qi's attack, his victory in this round, or even his triumph over the entire competition. <br/><br/>It was like nothing would faze him in this world. <br/><br/>\"Haha… The Family Master did it! We have won!\" <br/><br/>Feng Zhenshan exclaimed excitedly. <br/><br/>He was worried the entire time from when Feng Chen was surrounded by other clan leaders to when Tianlong Qi attacked him. <br/><br/>Even then, he kept a calm expression, refusing to disgrace his clan with an unseemly reaction. But now, his pent-up emotions burst forth, and he couldn't hold back a shout. <br/><br/>As soon as Feng Zhenshan said those words, Tianlong Elder's expression instantly turned gloomy with some even glaring at the Feng Clan Member. <br/><br/>\"Clan Leader has won! We have secured first place.\" <br/><br/>Feng Jianhong also couldn't help but shout out in joy. <br/><br/>Feng Mei, Feng Liang, Feng Xiaoyu, and even Feng Yun joined in the excitement. Their win wasn't a cheap victory as they had taken first place in all the rounds without any exception. <br/><br/>They had clearly dominated the Eastern Gathering and showed everyone just how powerful their Feng Clan was. <br/><br/>The other people also looked at Feng Chen with a surprised look. They finally realized that they had underestimated this young leader of the Feng Clan. <br/><br/>Not only did he calmly deal with Bai Zhang and other clan leaders but he also casually took on an attack from Peak Three Elements Divine Realm cultivator. <br/><br/>Who could have thought that Feng Chen, who is just 30 years old, was hiding so deeply? <br/><br/>They thought it was no wonder that two Zhou Elders had fallen into the hands of Feng Chen. <br/><br/>Ice Fairy also has a look of surprise on her face. She has been observing Feng Chen throughout this round and could say that Feng Chen is a genius. <br/><br/>Even she, a Nascent Soul Realm cultivator couldn't see through him and even struggled to see just how Feng Chen was able to come out unscathed from Tianlong Qi's attack. <br/><br/>Of course, one of the reasons she couldn't tell was because she was watching it in Heavenly Projection Crystal. <br/><br/>Otherwise, if she had been present there, she definitely would have known with her senses. <br/><br/>( His power has exceeded that of the Three Elements Divine Realm. But he didn't seem to have broken through to Nascent Soul Realm. ) <br/><br/>Ice Fairy thought. <br/><br/>Although she didn't think Feng Chen was Nascent Soul Realm, she concluded that he was infinitely close to reaching it. <br/><br/>This realization shocked her even more. 30 year old Nascent Soul Realm cultivator? He might just be the youngest to reach Nascent Soul Realm in the Azure Sky Empire. <br/><br/>She knew that she had to reassess the importance that her sect gave to the Feng Clan. They could turn out to be much more powerful than what they previously thought. <br/><br/>On the battlefield, Feng Chen stood there without doing anything for a few seconds before his eyes flickered over to where Tianlong Qi and Yuan Hao were. <br/><br/>Tianlong Qi and Yuan Hao finally reached the finish line, panting and exhausted. <br/><br/>The second one to reach was Yuan Hao and Tianlong Qi ended up in third place. <br/><br/>The reason for that was because Tianlong Qi wasted his Qi to attack Feng Chen and he was also late to react after Feng Chen had taken the first place. <br/><br/>Yuan Hao took advantage of those things and bagged second place. <br/><br/>Tianlong Qi shot Feng Chen a glare, but Feng Chen simply raised an eyebrow, unbothered. Tianlong Qi's qi crackled in his hands as he stood there, staring at Feng Chen's back, unable to comprehend how he dodged his attack. The Earth Grade Artifact had been his trump card, the one advantage he had hoped would ensure his victory. Yet, in the blink of an eye, it had been rendered meaningless. <br/><br/>Tianlong Qi clenched his fists tightly, the rage bubbling within him. He couldn't accept it! <br/><br/>How could he accept that someone like Feng Chen had defeated him despite all the preparations he made? <br/><br/>\"YOU CHEATED!\" <br/><br/>Tianlong Qi yelled as he quickly approached Feng Chen. <br/><br/>Tianlong Qi's face was fury-filled, and his eyes burned with resentment as he pointed an accusing finger at Feng Chen. <br/><br/>\"You couldn't have won without trickery!\" Tianlong Qi shouted. <br/><br/>\"Admit it! You used some underhanded method!\" <br/><br/>Feng Chen merely sighed and didn't even think about replying to him. You always meet such people who themselves use an underhanded method but when they fail, they start accusing the other party. <br/><br/>Just like a thief accusing others of being a thief. Really Irony! <br/><br/>Feng Chen just started to make his way back to Tianlong Mansion where the result of this round as well as the whole competition will be announced. <br/><br/>\"You!\" <br/><br/>Tianlong Qi's anger flared as he was being ignored by Feng Chen. <br/><br/>However, no matter what he felt, Feng Chen had already left the place without giving him a second thought. <br/><br/>Yuan Hao looked at Tianlong Qi with a hint of pity. But Yuan Hao knew that he deserved it. He quickly chased after Feng Chen. <br/><br/>\"Congratulations, Feng Clan Leader! I didn't think you were hiding so deeply. Your cultivation should be at the Peak of the Three Elements Divine Realm, right?\" <br/><br/>Yuan Hao said. With his speed and how he completely avoided Tianlong Qi's attack, Yuan Hao was almost certain that Feng Chen was at the Peak of Three Elements Divine Realm. <br/><br/>\"Something like that!\" <br/><br/>Feng Chen lied without a blush.  S~eaʀᴄh the Nôvel(F)ire.nёt website on Google to access chapters of novels early and in the highest quality.<br/><br/>After that, the two of them continued to descend the mountain at a leisurely speed. <br/><br/>\"You two have finished the race?\" <br/><br/>On the way, they met Yunhai Lianying who was on her way to the finish line. <br/><br/>Feng Chen and Yuan Hao just nodded their heads. \"Who won?\" <br/><br/>Yunahi Lianying asked curiously. She felt that the answer would be either Tianlong Qi or Yuan Hao, though she didn't rule out the possibility that it might be Feng Chen. <br/><br/>\"Feng Clan Leader has won.\" <br/><br/>Yuan Hao answered. <br/><br/>Yunhai Lianying blinked in surprise. The person that she least expected was the one who won. Her eyes flickered with both admiration and curiosity. <br/><br/>\"Feng Clan Leader won?\" She repeated, her voice a little incredulous. <br/><br/>\"Congratulations, Feng Clan Leader!\" <br/><br/>\"Thanks!\" <br/><br/>After this short conversation, Yunhai Lianying continued her race. Unlike Feng Chen and Yuan Hao, she hasn't completed the run and couldn't afford to delay in case of other people overtaking her. <br/><br/>As for her curiosity about how Feng Chen won, she could ask her clan members. <br/><br/>As Yunhai Lianying sped off toward the finish line, Feng Chen and Yuan Hao continued their descent down the mountain. And of course, they met with others on their way down and that includes Bai Zhang and those clan leaders who fought with Feng Chen. <br/><br/>\"Feng Chen!\" <br/><br/>Bai Zhang called out with anger in his eyes. Feng Chen looked at the group who was battered and some severely injured. It looks like they didn't have an easy time dealing with the Rank 5 Monster. <br/><br/>Bai Zhang wanted to rush forward and attack Feng Chen. He believed that he had suffered at the hands of the Rank 5 Monster because of Feng Chen, which, to some extent, was true. <br/><br/>However, one of the clan leaders held him and shook his head. <br/><br/>Looking at Feng Chen and Yuan Hao, anyone could tell that they had finished their race and were going back unlike them who were stuck at the back. <br/><br/>They had already failed their mission and didn't think it was necessary to offend Feng Chen more. <br/><br/>Bai Zhang gritted his teeth in anger but held back. <br/><br/>Feng Chen, on the other hand, didn't think much of Bai Zhang and continued with his descent, eventually reaching the Tianlong Mansion. <br/><br/>As Feng Chen and Yuan Hao arrived back at Tianlong Mansion, a wave of cheers and congratulations greeted them from all sides. Well, most of them were directed at Feng Chen though. <br/><br/>\"Congratulations Feng Clan Leader on winning!\" <br/><br/>\"Feng Clan Leader has really done a great job dealing with those clan leaders.\" <br/><br/>\"Master Feng is so powerful!\" <br/><br/>\"Not only does the Feng Clan have so many geniuses but even their clan leader is so powerful. I am really jealous of you.\" <br/><br/>… <br/><br/>Feng Chen nodded and slowly reached to their Feng Clan's seat. <br/><br/>\"Clan Leader! You did it!\" Feng Zhenshan shouted, his voice filled with excitement and pride. \"First place in every round! We've truly proven our strength.\" <br/><br/>Feng Mei, Feng Liang, Feng Xiaoyu, and even Feng Yun joined in the celebration, their faces alight with pride. They had all played their part in supporting Feng Chen and the Feng Clan, but it was Feng Chen who had carried them to victory. <br/><br/>\"You were amazing, Clan Leader!\" Feng Xiaoyu exclaimed. \"Not only did you defeat everyone, but you did it with such ease. I never thought you were hiding so much power!\" <br/><br/>Feng Chen just smiled. <br/><br/>As the clan members gathered around him, their admiration and respect for Feng Chen grew even more apparent. They had always known Feng Chen was capable, but today, he had shown just how deep his strength ran. They had no idea that he still hadn't revealed his full strength.\t\t\t\t\t\t</div>", "images": {}, "success": true}