{"id": 121, "url": "https://www.novelhall.com/my-brothers-the-protagonist-good-thing-i-awakened-my-system-33973/15098212.html", "title": "Chapter 122 The Winner Of The Third Round Of Eastern Gathering", "volume": 2, "volume_title": "Volume 2", "body": "<h1>Chapter 122 The Winner Of The Third Round Of Eastern Gathering</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\t Chapter 122  The Winner Of The Third Round Of Eastern Gathering Yunhai Lianying stared in stunned silence as Feng Chen, a mere blur, surged ahead, effortlessly outpacing her. \"He's... Fast! Too Fast!\" <br/><br/>Yunhai Lianying muttered under her breath. \"How can someone be so fast?\" <br/><br/>Tianlong Qi and Yuan Hao were both Peaks of the Three Elements Divine Realm. Their speed could already be considered among the fastest in that cultivation realm but even then compared to Feng Chen, both of them seemed slow.  seaʀᴄh thё NôvelFire(.)net website on Google to access chapters of novels early and in the highest quality.<br/><br/>In no time, Feng Chen had gone so far ahead that it was almost impossible for her to even see him. <br/><br/>Yunhai Lianying couldn't comprehend how fast Feng Chen was despite being in the Three Elements Divine Realm. <br/><br/>She shook her head knowing that she would never be able to know the answer just by guessing. <br/><br/>Though with Feng Chen joining the race, the winner of Eastern Gathering has become even more ambiguous. <br/><br/>Meanwhile, further up the path, Tianlong Qi and Yuan Hao were locked in an intense race. The two were neck-and-neck, their movements fluid and synchronized, both of them pushing their limits with every stride. <br/><br/>\"You're faster than I thought.\" Tianlong Qi muttered, his voice tinged with respect but also with a look of superiority. \"But you won't pass me!\" <br/><br/>Yuan Hao smiled, with a confident grin. \"We'll see about that.\" <br/><br/>\"Blazing Gale Steps!\" <br/><br/>In an instant, the air around him shimmered with heat as his speed increased exponentially. Flames seemed to dance around his feet, leaving streaks of light in his wake as he surged forward, closing the gap between him and Tianlong Qi. <br/><br/>Tianlong Qi narrowed his eyes as he saw Yuan Hao pull ahead. He wasn't about to let his opponent take the lead, especially not when the finish line was in sight. <br/><br/>He had a secret weapon up his sleeve and that was his shoe. <br/><br/>His show was a Low-level Earth Grade Artifact that can increase his speed by 20 % when injected with Qi. <br/><br/>The only downside was that the amount of Qi needed was very high which is why he didn't use it. <br/><br/>Now that they were reaching the finish line, he didn't need to hold back anymore. Tianlong Qi injected his Qi into the artifact and immediately his speed increased. The distance that Yuan Hao managed to create was immediately covered and he even overtook Yuan Hao. <br/><br/>\"Haha… I said, how could you be faster than me? Yuan Hao just gave up!\" <br/><br/>Tianlong Qi mocked as he passed by Yuan Hao. <br/><br/>\"...\" <br/><br/>Yuan Hao didn't say anything. After all, he has given his all and even thought that he would win but who knew that Tianlong Qi was hiding his strength? <br/><br/>This left Yuan Hao confused, as he hadn't anticipated Tianlong Qi being this fast. In their previous encounters, he had fought Tianlong Qi four times, with one win and three draws, so he thought he knew Tianlong Qi's capabilities. <br/><br/>He thought that Tianlong Qi had already used his full speed and didn't think that he could catch up to him. <br/><br/>It didn't take long for Yuan Hao to figure out the reason. <br/><br/>\"Tianlong Qi, I didn't think you were shameless enough to rely on an artifact.\" <br/><br/>Yuan Hao said angrily. <br/><br/>\"Hmph! So what? It isn't against the rule and who told you not to use one?\" <br/><br/>Tianlong Qi replied shamelessly. <br/><br/>Of course, Yuan Hao couldn't use one because he didn't have one. If he did, he wouldn't be here complaining. <br/><br/>As the two continued their heated race toward the finish line, Yuan Hao couldn't help but scowl at Tianlong Qi, who was now pulling ahead with the aid of his artifact. Yet, as the finish line drew closer, the sound of rapidly approaching footsteps caught both of their attention. \"Feng Clan Leader!\" <br/><br/>Yuan Hao called out in surprise. His expression and thought were similar to Yunhai Lianying and couldn't believe that Feng Chen had taken care of those clan leaders. <br/><br/>Moreover, Feng Chen's speed was beyond anything he had anticipated. <br/><br/>Tianlong Qi's eyes widened in disbelief and then gritted his teeth in anger. \"That trash couldn't even take care of a single person!\" <br/><br/>Tianlong Qi couldn't help but curse at those clan leaders that he instructed. He thought that he had made a perfect plan to sabotage Feng Chen and even got this Earth Grade Artifact from Elder Ren. <br/><br/>But those clan leaders failed to stall Feng Chen, much less kill him. <br/><br/>\"How—how is he so fast?!\" <br/><br/>Feng Chen seemed to be even faster than him who is using an Earth Grade Artifact. Tianlong Qi's smirk faded as Feng Chen shot past them, his expression turning into a frown. <br/><br/>There was no more playful taunting in his voice now—only the cold reality that he was no longer in the lead. <br/><br/>Feng Chen didn't even look at him while shooting past him. <br/><br/>\"Wait!\" <br/><br/>Tianlong Qi tried to stretch out his hand in an attempt to stop Feng Chen but failed. <br/><br/>\"I said wait!\" <br/><br/>Tianlong Qi roared, his voice filled with fury. <br/><br/>He clenched his fist, his Qi surging violently within him as he prepared to unleash a devastating strike. <br/><br/>\"You're not getting away so easily!\" But Feng Chen didn't even glance back as he continued his relentless pace. <br/><br/>\"Don't you dare!\" Yuan Hao shouted, his eyes narrowing as he realized what Tianlong Qi was attempting. <br/><br/>\"Hmph! Why won't I dare? It isn't against the rules.\" <br/><br/>Without hesitation, Tianlong Qi gathered all his remaining strength into his palm and sent a violent blast of Qi toward Feng Chen. \"Crimson Sky Burst!\" <br/><br/>The air around his attack crackled with energy, and the ground beneath him trembled under the force of his strike. <br/><br/>Yuan Hao tried to stop Tianlong Qi but it was already too late. <br/><br/>As Tianlong Qi's \"Crimson Sky Burst\" tore through the air, the explosive blast of Qi surged toward Feng Chen, crackling with raw power. For a brief moment, Tianlong Qi believed he had hit his target. The force of the explosion created a cloud of dust and debris, obscuring his vision. He stood there, chest heaving with effort, watching as the dust slowly began to settle, waiting for the sight of Feng Chen crumbling under the weight of his attack. <br/><br/>But as the air cleared, a surge of disbelief swept over him. <br/><br/>Feng Chen was nowhere near where he had been. The figure that had once been in front of him was now farther ahead, having gained more distance as though the blast had done nothing at all. <br/><br/>Tianlong Qi's eyes widened, his mouth falling open in shock. \"Impossible...\" He exclaimed, his voice tight with disbelief. \"I hit him! There's no way he could have survived that!\" <br/><br/>But Feng Chen, unaffected, was already moving forward, his pace steady and unwavering. The blast had done nothing to slow him down. <br/><br/>Tianlong Qi stood frozen in place, his mind struggling to process the reality before him. ( How? How had Feng Chen not only avoided the blast? Just how? ) <br/><br/>His chest tightened with frustration and helplessness as he watched Feng Chen surge past the final stretch toward the top of the race. There was no question now. Feng Chen had already won!\t\t\t\t\t\t</div>", "images": {}, "success": true}