{"id": 124, "url": "https://www.novelhall.com/my-brothers-the-protagonist-good-thing-i-awakened-my-system-33973/15141904.html", "title": "Chapter 125 The Aftermath Of Victory", "volume": 2, "volume_title": "Volume 2", "body": "<h1>Chapter 125 The Aftermath Of Victory</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\t Chapter 125  The Aftermath of Victory There was no surprise at all. <br/><br/>As expected Feng Clan took first place followed by Yuan Clan and then Tianlong Clan. <br/><br/>The ranking announcement continued and many seemed to be happy with their ranks except Bai Zhang and the clan leaders who fought with Feng Chen. <br/><br/>Because they chased after Feng Chen, they wasted precious time and ended up having to fight a Rank 5 monster, which only delayed them further. <br/><br/>In the end, they ended up coming last in the fourth round. Bai Clan who already did worse in the third round and fourth round ended up coming last in the overall ranking. In terms of strength, the Bai Clan would typically rank in the middle. However, due to a series of upsets, they ended up in last place—a source of pure humiliation for them. <br/><br/>As the final rankings were announced, Tianlong Zhen cleared his throat, drawing everyone's attention once more. \"Now that the rankings have been announced,\" Tianlong Zhen began, his gaze sweeping over the assembled clans, \"it is time to discuss the rewards for this year's competition.\" <br/><br/>A murmur of anticipation rippled through the crowd. Though the final rankings had been a blow to some, the Eastern Gathering's prizes were always generous. For the strongest clans, the rewards were not only a mark of prestige but also a significant boost to their future growth and resources. <br/><br/>Tianlong Zhen gestured, and a few attendants stepped forward, holding trays covered in ornate cloth. \"For the champions of this year's Eastern Gathering, the Feng Clan,\" he announced, \"in addition to two hundred gold coins and 5 Third-Grade Body Strengthening Pills, you will be granted exclusive rights to the Spirit Jade Vein situated in the Lingyun City.\" <br/><br/>A ripple of astonished murmurs spread through the hall. The Spirit Jade Vein was a highly valued resource, controlled by the royal family and known for producing Spirit Jade, a rare mineral essential for creating formation, enhancing cultivation, and reinforcing weapons. The Royal Family assigned clans to look after the mine every few years and then profits were split 80 to 20, 80 being the royal family. <br/><br/>Even then the 20 percent share was more than enough to make one earn more than half a million annually. <br/><br/>The Royal Family assigns clans to oversee these mines because they're located far from the capital, making direct management inconvenient. Additionally, powerful monsters often inhabit areas near such mines, requiring strong individuals to guard them. <br/><br/>Since Lingyun City is in the Eastern Region, the clan chosen to manage its Spirit Jade Vein is selected through the Eastern Gathering. <br/><br/>\"This mine will be yours to manage for the next three years.\" Tianlong Zhen continued, his tone carrying a note of reluctance. They lost one million gold coins and the rights to the Spirit Jade Vein, a blow that would undoubtedly drain their treasury for years to come. <br/><br/>Feng Chen inclined his head, accepting the reward with a nod, though a gleam of satisfaction flashed briefly in his eyes. The Spirit Jade Vein was more than a simple reward; it was a strategic asset that could strengthen Feng Clan's foothold in the region and elevate its power for years to come. <br/><br/>Even if he was not present, Feng Chen wouldn't need to worry about their clan's finances for the next three years at least. <br/><br/>As the remaining prizes were distributed to the other clans, the magnitude of the Feng Clan's victory loomed over the gathering. Tianlong Zhen, after having completed his task, immediately left the place along with other clan members. They didn't want to stay there a second longer than necessary. <br/><br/>Feng Chen also didn't linger around and was prepared to leave the Tianlong Mansion. <br/><br/>\"Feng Clan Leader!\" Ice Fairy's melodic voice cut through the murmur of the crowd. She stepped forward from the group of spectators, her presence commanding immediate attention. Feng Chen's eyes flickered toward her, and he gave a respectful nod. \"We've concluded our discussions with Feng Mei and Feng Xiaoyu. Now, we wait for their decision. Feng Mei and Feng Xioayu's talents are undeniable, and if they choose to join us, they will be stronger than ever.\" <br/><br/>She wanted Feng Chen to have a favorable opinion of their sect and to know that they would treat Feng Mei and Feng Xiaoyu as treasures. <br/><br/>Feng Chen's words would carry more weight with Feng Mei and Feng Xiaoyu than anyone else's. <br/><br/>They had already seen how much respect Feng Chen commanded from them and realized that if Feng Chen were to say a few favorable words on their behalf, the chances of Feng Mei and Feng Xiaoyu agreeing would be much higher. <br/><br/>Feng Chen nodded, though he didn't give any promises. <br/><br/>This left the Ice Fairy feeling a little down but she was still satisfied that he hadn't outright rejected them and seemed to have a favorable opinion of them. <br/><br/>They could also rest easy knowing that the Feng Clan had a poor relationship with both the Spirit Wind Palace and the Mystic Flame Sect. <br/><br/>Ice Fairy along with her elders left the Tianlong Mansion after saying everything that needed to be said. <br/><br/>Now, they could only hope that Feng Mei and Feng Xiaoyu could join their sect. <br/><br/>\"Feng Clan Leader, thanks for everything!\" <br/><br/>Yuan Hao said as he handed over a storage ring. He was waiting in line after the Icy Veil Sect to talk with Feng Chen.  seaʀᴄh thё novёlF~ire.net website on Google to access chapters of novels early and in the highest quality.<br/><br/>The storage ring contains 1.5 million gold coins that he borrowed plus the 150,000 gold coins in interest that he promised. <br/><br/>They exchanged a few words about the Eastern Gathering and the future, their conversation light but filled with mutual respect. After a brief pause, Yuan Hao clasped Feng Chen's hand with a warm smile, his gratitude evident. <br/><br/>\"So long, Feng Clan Leader,\" he said sincerely, \"and thank you once more. I hope our paths cross again in the future.\" <br/><br/>Feng Chen nodded. After getting to know Yuan Hao throughout the Eastern Gathering, Feng Chen found that he was a likable person of integrity and honor. He liked Yuan Hao's sincerity and would certainly like to maintain a good relationship with the Yuan Clan moving forward. <br/><br/>Meanwhile, Feng Yun was being confronted by Yuan Ziyan once again. \"Feng Yun, I admit that you have proven yourself to be worthy of our junior sister.\" <br/><br/>\"This again!\" <br/><br/>Feng Yun groaned. He didn't know what to say in order for Yuan Ziyan to believe that he wasn't interested in Ling Meiyu. <br/><br/>\"I'll certainly put in a good word for you. However, don't get complacent—keep training hard. Compared to Junior Sister, you're still too weak. You don't stand a chance against her right now, and in two and a half years, if you don't improve, you'll only end up humiliating yourself.\" <br/><br/>Yuan Ziyan admits that Feng Yun was powerful, maybe more than her. But she knew that compared to Ling Meiyu, who was already in the Peak of Grand Qi Condensation Realm, Feng Yun was nothing. <br/><br/>Feng Yun ignored everything except her last sentence which he knew. <br/><br/>No matter how powerful he was, his target was much more powerful than him. <br/><br/>Against Ling Meiyu, he knew that he wouldn't last a minute. <br/><br/>But there were still two and half years before the three-year promise and he was determined to become powerful. Yuan Ziyan didn't know what Feng Yun was thinking but thought that perhaps she said too much and he was disheartened by it. <br/><br/>\"Don't worry about it too much. With your talent, it is certain that you will grow stronger and perhaps even surpass our junior sister.\" <br/><br/>Yuan Ziyan said in order to cheer up Feng Yun. <br/><br/>\"Haha… \" <br/><br/>Feng Yun laughed when he realized that Yuan Ziyan was encouraging him. Although he didn't need that at all, he was thankful and found that Yuan Ziyan wasn't that bad of a person. <br/><br/>He didn't like all the misunderstanding that she conjured herself but he could see that she was looking out for Ling Meiyu while also him at the same time. <br/><br/>Seeing him laugh, Yuan Ziyan frowned slightly. \"What's so funny?\" She asked her tone a mix of irritation and curiosity. <br/><br/>\"Nothing,\" Feng Yun replied, stifling his laughter, though a grin remained. \"It's just... I didn't expect you to be this considerate.\" <br/><br/>Thinking about something, Feng Yun added. <br/><br/>\"It would have been better if you were my fiancee instead.\" <br/><br/>Feng Yun thought that with how considerate Yuan Ziyan was , at least she wouldn't have broken off their engagement like Ling Meiyu. <br/><br/>She wouldn't have chosen a date like his brother's birthday, with all our enemies watching and made a situation where their clan was humiliated. <br/><br/>But Ling Meiyu didn't have any consideration for their clan and chose the worst date to terminate their engagement. <br/><br/>Yuan Ziyan's cheeks tinged pink, taken aback by his unexpected words. Though she tried to keep her composure, her mind raced with possibilities, misinterpreting his comment as something else. <br/><br/>\"Wh-what are you saying?\" She stammered, her voice a mix of embarrassment and disbelief. <br/><br/>Feng Yun didn't think much about what he said and was just something he thought at that moment, forgetting that the girl in front has a habit of thinking too much. <br/><br/>\"Just giving credit where it's due,\" he replied with a grin, leaving her speechless as he turned to leave, her cheeks still a warm shade of crimson. <br/><br/>\"Then until we meet again, Mrs. Yuan!\"\t\t\t\t\t\t</div>", "images": {}, "success": true}