{"id": 120, "url": "https://www.novelhall.com/my-brothers-the-protagonist-good-thing-i-awakened-my-system-33973/15098211.html", "title": "Chapter 121 The Final Sprint", "volume": 2, "volume_title": "Volume 2", "body": "<h1>Chapter 121 The Final Sprint</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\t Chapter 121  The Final Sprint LEFT! RIGHT! Bai Zhang scanned the area wildly. He had already lost sight of Feng Chen once and didn't want to lose him twice. <br/><br/>But it seemed like he wouldn't have time to worry about Feng Chen. <br/><br/>RAAAWR! <br/><br/>\"Oh no!\" <br/><br/>One of the clan leaders exclaimed in fear. <br/><br/>\"The Rank 5 Monster is heading towards us!\" <br/><br/>Bai Zhang and his group of clan leaders skidded to a halt as they felt a looming presence ahead. The Rank-5 monster stepped into view—a towering, four-legged beast with shimmering obsidian scales and crimson eyes that glared with malice. Its serrated claws dug into the ground, each step sending tremors through the earth as it growled, furious at the intruders who dared to invade its territory. <br/><br/>The beast unleashed a guttural roar that reverberated through the forest, its jaws parting to reveal rows of razor-sharp teeth. Bai Zhang's expression changed greatly. The ally he expected to help stall Feng Chen had turned into an obstacle, and now he was the one being held up by that monster. <br/><br/>Although Rank 5 Monster cultivation was the same as Bai Zhang, there was a big difference in the strength of monsters and humans. <br/><br/>Moreover, he has to chase after Feng Chen and can't be entangled with the monster. Even a delay of just ten seconds could mean losing any chance of catching up to Feng Chen. <br/><br/>However, it looks like he didn't have any choice! <br/><br/>The monster had already set its eyes on them and was charging towards them. <br/><br/>\"Prepare yourselves!\" Bai Zhang commanded, raising his hands and channeling his qi to attack the incoming monster. <br/><br/>The other clan leaders steeled themselves, each of them drawing upon their respective skills. Weapons glinted as blades and claws formed from concentrated qi, crackling with power. \"Crushing Earth Strike!\" <br/><br/>With a fierce roar, Bai Zhang brought his fist down, sending a shockwave of Qi that surged toward the beast, aiming to break its balance. <br/><br/>The attack struck the monster's legs, the ground around it rumbling and cracking under the force. But to Bai Zhang's dismay, the creature barely faltered. It shook off the tremor as if it were nothing more than a breeze. <br/><br/>RAAAAWR! <br/><br/>With a furious roar, the beast lashed out, its massive tail whipping through the air and smashing into the group, the impact so powerful it sent several clan leaders sprawling. <br/><br/>Several of the clan leaders were thrown backward, crashing into trees and rocks. In the distance, Feng Chen watched Bai Zhang and his group struggle with the Rank 5 Monster. Although Rank 5 Monster couldn't kill them, it would definitely delay them. <br/><br/>Everything that happened was Feng Chen's plan. With his superior senses, Feng Chen already knew about the presence of the Rank 5 Monster and deliberately led Bai Zhang and his group to them. <br/><br/>As for how he—or rather, the figure they were chasing—vanished, it was simply his shadow they had been pursuing. <br/><br/>Ghostly Shadow Mirage! <br/><br/>This was what Ghostly Shadow Mirage Technique at its 100 percent mastery could do. It allows you to create clones of yourself to deceive enemies, just as he had done now. <br/><br/>While they were chasing his clone, which had moved toward the Rank 5 Monster, Feng Chen's real body slipped off in the opposite direction. <br/><br/>Actually, Feng Chen didn't really need to take care of Bai Zhang and others explicitly as they could have never caught up to him with their speed. <br/><br/>However, since there was a Rank 5 Monster, Feng Chen took this opportunity to mess with them. <br/><br/>\"Now then, let's speed up!\" <br/><br/>Feng Chen muttered as he increased his speed. WHOOSH! <br/><br/>Feng Chen surged forward at incredible speed, effortlessly dispatching any monster that dared to cross his path. <br/><br/>Most monsters, sensing his overwhelming presence, steered clear, instinctively retreating as he approached. Only the most aggressive or foolish beasts attempted to challenge him—those incapable of gauging the strength of their opponent. For them, however, a single strike from Feng Chen was more than enough to bring them down. <br/><br/>On the front, Yuan Hao almost caught up with Tianlong Qi. <br/><br/>Although Tianlong Qi had a head start, he also needed to take care of all the monsters that appeared in his route. <br/><br/>The monsters might be weak, not even able to take one attack from him but even so it slowed him down. <br/><br/>On the other hand, Yuan Hao had a smooth ride with Tianlong Qi clearing out the monsters. <br/><br/>This resulted in Yuan Hao being just behind Tianlong Qi. <br/><br/>Tianlong Qi, sensing Yuan Hao's approach, glanced over his shoulder with a smirk. \"I didn't expect you to catch up so soon, Yuan Hao.\" Tianlong Qi taunted. Since Yuan Hao was friendly with Feng Chen, Tianlong Qi didn't have any good feelings for him. <br/><br/>Tianlong Qi has already decided to treat everyone who was good to the Feng Clan as enemies. <br/><br/>\"Me too. You are just too slow!\" <br/><br/>Yuan Hao replied provokingly. <br/><br/>He could sense the hostility in Tianlong Qi's words, but he was not someone who would shy away from a challenge. <br/><br/>This is one of the reasons why he never cared about what the Mystic Flame Sect or Spirit Wind Palace would think and still approached Feng Chen with goodwill. <br/><br/>Tianlong Qi's eyes flashed with the challenge as he increased his speed, pushing forward with intensity. Yuan Hao matched his pace, both of them moving so fast that the ground trembled slightly beneath their steps. <br/><br/>Meanwhile, Yunhai Lianying was behind them, and also at a considerable distance. <br/><br/>Her cultivation was lower than Tianlong Qi's and Yuan Hao's, and unlike them, her progress was largely fueled by pills rather than through rigorous training. <br/><br/>\"It looks like the winner will be between the two of them.\" <br/><br/>Yunhai Lianying muttered. With them taking the first position and second position in this round, there was little to no chance for Feng Clan to maintain their first place in the overall ranking. <br/><br/>After all, the points obtained in the last round were significantly higher than the other three rounds. WHOOSH! <br/><br/>Just when she was thinking about that, someone zoomed past her. <br/><br/>\"Who?\" <br/><br/>Yunahi Lianying exclaimed in surprise. Apart from Tianlong Qi and Yuan Hao, she didn't think there was anyone who could match her speed. <br/><br/>She squinted her eyes, trying to make out who it was. <br/><br/>\"Feng Chen!\"  Sёarch* The novёlF~ire.net website on Google to access chapters of novels early and in the highest quality.<br/><br/>The realization struck her with even more surprise. The one who had surpassed her was none other than Feng Chen. <br/><br/>She thought that Feng Chen wouldn't be able to escape from Bai Zhang and other clan leader's hand, but not only did Feng Chen do that but he has also overtaken her. And the speed at which he was going, Yunhai Lianying knew that she couldn't catch up.\t\t\t\t\t\t</div>", "images": {}, "success": true}