{"id": 129, "url": "https://www.novelhall.com/my-brothers-the-protagonist-good-thing-i-awakened-my-system-33973/15174291.html", "title": "Chapter 133 Equality Above All", "volume": 2, "volume_title": "Volume 2", "body": "<h1>Chapter 133 Equality Above All</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\t Chapter 133  Equality Above All The morning sun bathed Misty Vale City in a golden glow, signaling the dawn of a new chapter, especially for the Feng Clan. Upon returning to the Feng Clan estate, Feng Chen wasted no time implementing sweeping changes. With the nearly 8 million gold coins earned during the Eastern Gathering, he increased the allocation of resources for the clan's cultivation and development. Significant investments were made in acquiring rare spirit herbs and hiring skilled alchemists. <br/><br/>To attract the best talent, the Feng Clan offered unparalleled benefits, such as access to high-grade herbs, Alchemy recipes, and lucrative profit-sharing arrangements. High-ranking alchemists were granted additional privileges, including personal residences, dedicated servants, and access to rare ingredients for their research. The Feng Clan's rising fame and such benefits ensured there was no shortage of talented individuals seeking to join them. Of course, it wasn't very easy to get a High Ranking Alchemist even with such lucrative deals and the highest rank alchemist that had joined was Second Grade Alchemist. <br/><br/>However, Feng Chen felt that with time, there would be higher ranking alchemists also willing to join and additionally even without that, there were high chances that current alchemists might rank up with all the resources provided to them. <br/><br/>So, in the long run, letting so many Grade One alchemists join their clan could be beneficial for their clan. <br/><br/>Feng Yun also contributed significantly by providing Rank 3 pill recipes, each extraordinary and highly efficient. These recipes inspired the Feng Clan's alchemists to push their limits, and with no shortage of resources to experiment with, their skills improved rapidly. Even those who had initially joined reluctantly, tempted by the lucrative benefits, soon found themselves delighted with their decision. Not only were their earnings soaring, but the rate at which their alchemical skills advanced was beyond anything they had imagined in their previous endeavors. Adding to their satisfaction was the warm and cooperative environment within the Feng Clan. Feng Clan members were kind, and open-minded, and worked seamlessly with the alchemists, offering them the respect they deserved. In just a few days, newcomers no longer felt like outsiders but rather someone who is a part of the Feng Clan. Feng Chen's non-discriminatory policies further reinforced this sense of belonging. Unlike other clans where hierarchies and favoritism often bred resentment, the Feng Clan treated everyone equally, valuing talent and contribution over status or background. This is one of the reasons why Feng Chen was loved and respected by everyone at Feng Clan. <br/><br/>He didn't care whether they were the direct bloodline of Feng Chen or became a part of Feng Clan through some other ways. <br/><br/>All were given equal opportunity with everything open for everyone to study and learn, not keeping something like High-Ranked Techniques for only their direct descendant. <br/><br/>As long as one was talented and interested in learning something, there weren't many restrictions in the Feng Clan. <br/><br/>Feng Jianhong, Feng Liang, and other members of the Feng Clan never felt any disparity compared to Feng Yun or Feng Chen, as they were granted the same access to resources and opportunities. <br/><br/>Let alone noticing any difference, they never even realized there was unequal treatment between branch clan members and direct descendants. <br/><br/>So, when others offered them the opportunity to join their clan with the promise of being treated the same as direct bloodline descendants, Feng Jianhong and the others couldn't help but ask.\" <br/><br/>\"Is there any difference between being a direct bloodline descendant and a branch member?\" Feng Jianhong asked, tilting his head in confusion. After climbing to the 13th step of the Pillar Of Aptitude, the clan who wanted to recruit Feng Jianhong was numerous, even more than Feng Yun. <br/><br/>They thought that convincing Feng Jianhong would be easier than Feng Yun who is a direct descendant and brother of Feng Chen. <br/><br/>Most of them offered that they would treat Feng Jianhong the same as their direct bloodline with the same resource allocated to him which consued Feng Jianhong. <br/><br/>The clan leader who had made the offer straightened his posture, a proud smile spreading across his face as he began his explanation. \"Of course, there is a significant difference. They receive higher resource allocations, priority access to advanced martial arts techniques, and exclusive opportunities like when having the chance to join Sect.\" \"As an outsider, you would have received far less than what you truly deserve. However,\" the clan leader's tone grew more enticing. \"If you were to join my clan, you would be treated on par with our direct descendants. I can personally guarantee that.\" \"You would gain access to the best cultivation resources, including high-ranking pills, powerful Martial Arts, and Artifact. Our martial arts library would be open to you—every technique, no matter how advanced. You wouldn't be bound by restrictions or quotas.\" The Clan Leader was certain his offer would be irresistible. He had assumed Feng Jianhong, as a branch member of the Feng Clan, was underutilized and underappreciated, making this an ideal opportunity to poach such talent. Feng Jianhong, however, couldn't help but chuckle. His relaxed demeanor caught the clan leader off guard. \"Direct Bloodline? Branch member? I don't know what you are talking about. Anyway, in Feng Clan, there really isn't such a restriction and I have the same resources as everyone else.\" <br/><br/>Feng Jianhong replied. The clan leader's expression faltered. The clan leader's proud demeanor crumbled, replaced by an awkward, forced smile. He had miscalculated terribly, unaware of just how the Feng Clan treats their clan members. <br/><br/>Normally, if the decandent is from a branch family, you would try to restrict them so as not to have them grow stronger than their direct descandent.  Sёarᴄh the nôvelFire.net website on Google to access chapters of novels early and in the highest quality.<br/><br/>\"If a branch member becomes stronger than a direct descendant, there's a possibility they might claim the position of clan leader—a scenario many clan leaders would prefer to avoid.\" <br/><br/>Moreover, resources were limited. When it comes to distributing them, it's only natural to prioritize those closest to you, ensuring they receive the most. <br/><br/>\"Thank you for the offer, but I must decline. No matter what the offer is, I would never betray my clan.\" <br/><br/>Of course, Feng Jianhong refused as he never thought of joining another clan and betraying the Feng Clan even if he were offered many more resources than what he can get from Feng Clan. <br/><br/>Feng Jianhong finally understood that not everyone in one clan is treated equally in other clans, which made him more grateful to Feng Chen. <br/><br/>Regardless, Feng Chen's commitment to fairness and equality was unwavering. This approach made everyone who joined the Feng Clan feel at ease and truly at home. <br/><br/>Feng Chen also established several key partnerships with various merchants to secure a steady supply of herbs for pill production. At the same time, he collaborated with them to distribute and sell the Feng Clan's pills, expanding their influence in the market. <br/><br/>Leveraging the properties seized from the Yan, Liu, and Zhan families, Feng Chen maximized his investments and used the resources to further strengthen the clan's economic position. The Feng Clan's market share in Misty Vale City soared to nearly 70%, with the city's economy increasingly falling under their control, even though Wang Yifan was appointed as City Lord by the Royal Family, Feng Clan's influence far exceeded the Wang Clan. <br/><br/>However, Feng Chen didn't limit his efforts to Misty Vale City alone. He strategically worked with merchants to help the Feng Clan penetrate markets in neighboring cities, ensuring that their influence spread far beyond their home base. This expansion allowed the Feng Clan to increase its presence in the Eastern Region.\t\t\t\t\t\t</div>", "images": {}, "success": true}