{"id": 125, "url": "https://www.novelhall.com/my-brothers-the-protagonist-good-thing-i-awakened-my-system-33973/15168126.html", "title": "Chapter 129 New Enemy?", "volume": 2, "volume_title": "Volume 2", "body": "<h1>Chapter 129 New Enemy?</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\t Chapter 129  New Enemy? Tianlong Qi, trembling and drenched in cold sweat, stared at the bodies of the two Spirit Wind Palace elders. They were supposed to be his ultimate trump cards, yet Feng Chen had eliminated them with terrifying ease. ( Am I dreaming? ) <br/><br/>How could the invincible elders from Spirit Wind Palace be killed so easily? <br/><br/>\"No… No, this isn't happening…\" Tianlong Qi whispered, his voice quivering as he tried to crawl away. Feng Chen turned his gaze to Tianlong Qi, his eyes filled with disdain. \"P-Please, spare me!\" <br/><br/>Tianlong Qi begged with tears in his eyes. Feng Chen approached him slowly, his sword dripping with the blood of his enemies. \"Spare you? After all the trouble you've caused me? Give me one good reason.\" Tianlong Qi frantically searched for words, his mind racing. \"I… I can give you the information! About Spirit Wind Palace! About their plans! I know things you don't!\" Feng Chen paused, tilting his head slightly as if considering the offer. \"Information?\" \"Yes! Yes!\" Tianlong Qi clung to the sliver of hope. \"The Spirit Wind Palace… they've been plotting against you. This wasn't my doing—they've been moving in the shadows, targeting you and your clan!\" Feng Chen's eyes narrowed. \"How convenient for you to share this now. And why should I trust anything you say?\" \"I swear it's the truth!\" Tianlong Qi pleaded, tears streaming down his face. \"They'll stop at nothing to destroy you! They even sent their most elite assassins—those two were just the beginning!\" Tianlong Qi nodded furiously. \"I can tell you everything—\" Before he could finish, Feng Chen's sword flicked downward, slicing through Tianlong Qi's body. \"I have heard enough. I have no need to know about that trash.\" <br/><br/>Feng Chen said, having lost interest in anything Tianlong Qi had to say. <br/><br/>Feng Chen didn't care much about whether what Tianlong Qi said was true or just shifting the blame to others. <br/><br/>Anyway, there was no way that he would spare Tianlong Qi just because of that. As for Spirit Wind Palace, whether it is because of the incident with Elder Zhou Tianhua or other agenda, he was not going to let them off easily. <br/><br/>If they came for him themselves, that would only make his job easier. <br/><br/>Meanwhile, others who were fighting with Feng Chen vigorously were also getting killed one by one. <br/><br/>Their only hope has died and even their leader was killed by Feng Chen. Their power has left their body and they could only get themselves killed by Feng Chen's clone. <br/><br/>Some tried to run away while their friends were busy fighting with Feng Chen's clone but Feng Chen took care of those defectors. With his speed, there was no way those Grand Qi Condensation Realm cultivators could have ever escaped the place. <br/><br/>\"Hehe… Don't think that I will let you off.\" <br/><br/>Feng Chen said, which was directed at Bai Zhang who was quietly preparing to walk away. <br/><br/>Everyone except him was dead! <br/><br/>\"You should've played dead longer.\" Feng Chen said as he slowly approached Bai Zhang. <br/><br/>\"N-No! Please! Spare me!\" Bai Zhang cried, his voice breaking as he groveled before Feng Chen. The once-proud figure was now a pitiful sight, reduced to begging for his life. Bai Zhang stammered, his voice shaking. \"I was forced into this! I'll never go against you again!\" Feng Chen's eyes narrowed, his tone cold and cutting. \"Spare you? You've gone against me again and again. Do you really think I'll forgive you?\" Without waiting for an answer, his sword flashed. -SLASH! Bai Zhang fell, lifeless, as Feng Chen sheathed his sword and turned away. On the other hand, Feng Zhenshan and other Feng Clan members finally had relief after the last enemy had been taken care of. <br/><br/>\"Family Master is so strong!\" <br/><br/>\"Our Clan Leader is the strongest!\" <br/><br/>Feng Jianhong and Feng Liang couldn't help but praise Feng Chen's power. They even began to feel like there was no one who could fight with their clan leader. <br/><br/>After all, even Five Three Elements Divine Cultivators with almost 10 Grand Qi Condensation Realm experts fell before him. <br/><br/>So, there was no doubt in their mind that Feng Chen was the strongest. <br/><br/>Others couldn't agree more. Soon, Feng Chen returned to the carriage. He had spent some time dealing with the attackers' corpses and collecting their storage rings. <br/><br/>\"Is everything okay?\" <br/><br/>Feng Chen asked. <br/><br/>\"There is no problem, Chen'er!\" <br/><br/>Feng Zhenshan replied.  Searᴄh the novёlF~ire.net website on Google to access chapters of novels early and in the highest quality.<br/><br/>!!! <br/><br/>Just when Feng Chen thought that everything was alright, he sensed a powerful presence. So powerful that those two elders from the Spirit Wind Palace can be considered as children in front of him <br/><br/>His gaze snapped toward the human-like figure in the distance. He widened his eyes in surprise. The person seemed to have been there for quite a long time but he couldn't sense his presence at all. <br/><br/>Either he possessed a powerful artifact to conceal his presence, or he was strong enough to mask it even from someone at the Nascent Soul Realm. <br/><br/>In either case, the person didn't seem like an easy opponent. <br/><br/>\"Chen'er, what's wrong?\" Feng Zhenshan asked, noticing the sudden shift in Feng Chen's demeanor. \"Someone's here,\" Feng Chen said curtly, his eyes narrowing. \"Far stronger than those I've just dealt with.\" His words sent a chill through the Feng Clan members. If Feng Chen himself considered this intruder powerful, the situation was dire. Turning to Feng Zhenshan, Feng Chen's tone was firm. \"Protect the carriage and yourselves. Don't leave this area under any circumstances. I'll handle this.\" \"Chen'er, be careful!\" Feng Zhenshan called out, his worry evident, but he knew better than to question Feng Chen's judgment. Without wasting another second, Feng Chen shot toward the figure, his speed leaving a gust of wind in his wake. The figure in the distance, cloaked and obscured, turned its head slightly. Upon realizing that it had been detected, the individual made no attempt to engage and instead bolted, moving with a speed that rivaled Feng Chen's. \"Oh? Running already?\" Feng Chen smirked, his eyes gleaming with battle intent. \"Let's see how far you can go.\" He increased his speed, closing the distance between them with alarming efficiency. The figure glanced back, its movements becoming more frantic as it sensed Feng Chen gaining ground. The chase led them into a dense forest, where the intruder attempted to use the thick foliage and uneven terrain to evade pursuit. However, Feng Chen's spiritual senses remained locked onto the figure, and his movements were unaffected by the obstacles. \"Did you think you could hide from me?\" Feng Chen's voice rang out, sharp and mocking. The figure finally halted in a small clearing, realizing there was no escape. Slowly, they turned to face Feng Chen, their face still obscured by a hood. \"You're faster than I expected.\" The figure said, their voice soothing and almost melodic, like a soft breeze, but there was an underlying tension in her tone. <br/><br/>Feng Chen paused. The voice was calming, almost hypnotic, and carried a sense of tranquility. But Feng Chen was not fooled. This could be an enemy sent to spy on him or his clan. <br/><br/>\"Who are you? And why are you spying on me?\" <br/><br/>Feng Chen asked as he pointed his sword at the figure. <br/><br/>\"Why don't you find out?\"\t\t\t\t\t\t</div>", "images": {}, "success": true}