{"id": 127, "url": "https://www.novelhall.com/my-brothers-the-protagonist-good-thing-i-awakened-my-system-33973/15172894.html", "title": "Chapter 131 Celestial Harmony Necklace", "volume": 2, "volume_title": "Volume 2", "body": "<h1>Chapter 131 Celestial Harmony Necklace</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\t Chapter 131  Celestial Harmony Necklace If not for the necklace in his hand, Feng Chen might have even thought that the girl was a ghost. <br/><br/>Her movement was impossible to track and she disappeared and appeared just like a ghost. <br/><br/>\"What is this necklace?\" Feng Chen muttered to himself, turning it over in his hands. \"I can't see through it at all. It's clearly not ordinary.\" <br/><br/>Perhaps if he had some appraisal skills for the artifact, he might have known what it was. <br/><br/>And going through his memories, there was no artifact that matched its appearance. <br/><br/>There was no way for him to know what this Necklace was unless he got an Artifact appraiser. <br/><br/>\"Wait, the System Store might have something useful.\" <br/><br/>With the System, anything beyond his ability, it could handle. Well, at least, he hoped it could without having to spend much System Points. <br/><br/>He called up the System interface in his mind, a translucent screen appearing before him. <br/><br/>Navigating swiftly, he entered the System Store. <br/><br/>Scanning through the listings, his eyes landed on a peculiar item: <br/><br/>\"Artifact Analyzer – Advanced Grade\" <br/><br/>*** <br/><br/>Artifact Analyzer – Advanced Grade - Description: A special tool that reveals detailed information about artifacts, including their grade and abilities. <br/><br/>- Price: 10,000 System Points. *** <br/><br/>It was exactly what he needed right now. <br/><br/>Feng Chen looked at the price which was neither too expensive nor too cheap for a one time-use item. <br/><br/>He would have hesitated but with all the System Points he has gotten these past days and his curiosity about the artifact, he decided to buy it without a second thought. <br/><br/>His System Points dropped, but a small, sleek device resembling a crystalline orb materialized in his hand. <br/><br/>\"Let's see just what kind of artifact you are.\" Feng Chen murmured, holding the necklace under the orb's light. The Artifact Analyzer activated with a soft hum, and runic symbols began swirling inside the orb. After a moment, text appeared before his eyes. <br/><br/>**** <br/><br/>Celestial Harmony Necklace <br/><br/>- Grade: Top Saint-Grade Artifact. <br/><br/>- Primary Ability: Acts as a key to unlock certain ancient mechanisms or formations. The exact mechanisms remain unidentified. - Secondary Ability: Enhances Qi absorption by 100%, allowing cultivators to draw in and refine Qi from their surroundings with unparalleled efficiency. *** <br/><br/>Feng Chen's breath hitched. \"A Top Saint-Grade artifact… no wonder it feels so extraordinary.\" <br/><br/>For a moment, he couldn't look away, his eyes returning to the grade, which confirmed it was indeed a Top Saint-Grade Artifact. <br/><br/>The secondary ability to increase Qi absorption by 100% alone was something countless cultivators would kill for, let alone the mysterious function as a key. <br/><br/>He couldn't even fathom just what kind of treasure there was for a key to be a Top Saint-Grade Artifact. A Divine Grade Treasure would be the minimum for anything guarded by a Top Saint-Grade Artifact, and it might even be more powerful than that. <br/><br/>\"A treasure like this…\" Feng Chen's eyes narrowed. \"Why would she just give it to me?\" <br/><br/>He glanced around the now-silent forest, half expecting the girl to reappear to tease or take back the artifact. But the surroundings remained quiet, leaving him alone with his thoughts. <br/><br/>His curiosity about the girl had increased drastically by then. For someone to just give out a Saint Grade, not to mention a Top Saint Grade, he knew that the girl's background far surpasses what he previously thought. <br/><br/>Even if the girl was from the central domain, Feng Chen believed that her clan or sect, which she belongs to, should be at the Top. <br/><br/>Otherwise, there was no way that anyone could afford to give up such a precious treasure to some stranger that they had just met. <br/><br/>Although he still has some suspicions about the Artifact that was casually handed to him, it doesn't mean that he is going to throw it away. <br/><br/>Something so precious, even if there were some tricks to it, he would keep it. Just that 100 % Qi absorption was worth it. <br/><br/>He activated his Nascent Soul Realm cultivation, circulating his Qi through the necklace as a test. Instantly, he felt an unprecedented rush of Qi flowing into him from the surroundings. The sheer efficiency startled him, and he had to stop himself from overloading his meridians. <br/><br/>\"This is incredible!\" He muttered. It was akin to the Qi-gathering formation in his room, but far more efficient and portable—a treasure that would remain with him wherever he went. With this artifact, his cultivation efficiency would soar, regardless of his location. <br/><br/>( What would my cultivation speed be if Heavenly Veil Formation coupled with this Celestial Harmony Necklace? 3x? ) <br/><br/>He wondered and couldn't wait to try it out. As for its primary function as a key, he didn't think much about it because he knew he wouldn't know the answer. <br/><br/>Wearing the necklace, he went back to where the carriage was. <br/><br/>\"Brother!\" <br/><br/>Feng Yun called out. <br/><br/>\"Where did you go suddenly? Don't you know how worried we were?\" <br/><br/>Feng Yun said worriedly and with a bit of anger.  Sёarch* The nôvelFire.net website on Google to access chapters of novels early and in the highest quality.<br/><br/>Even if his brother were very strong, he didn't think it was appropriate for his brother to act this way which might endanger his life. <br/><br/>And the reason why he was so worried was because of his master who warned him about the presence of someone who seemed to be more powerful than the Nascent Soul Realm. <br/><br/>The Nascent Soul Realm was something he couldn't even fathom reaching in the near future, let alone anything beyond it—realms that were practically unheard of within the Azure Sky Empire. <br/><br/>Although his brother has taken care of Three Elements Divine Realm cultivators easily, that didn't mean that he would be able to take on Nascent Soul Realm, not to mention above that realm. <br/><br/>Even his master Minghao wasn't sure whether Feng Chen could survive in a fight against the Spirit Severing Realm. <br/><br/>Master Minghao was ready to help Feng Yun and others escape in the possible event that Feng Chen gets killed by the Spirit Severing Realm cultivator. However, after he sensed that Feng Chen was alive and the person whose cultivation Spirit Severing Stage had gone, he assured Feng Yun that everything was alright. <br/><br/>Even then Feng Yun couldn't help but get angry at Feng Chen's reckless behavior. Feng Chen smiled as he approached the carriage, noting the concern etched on Feng Yun's face. <br/><br/>\"Don't worry, I just ran into someone interesting,\" he said nonchalantly, brushing off the encounter. <br/><br/>\"Interesting?\" Feng Yun's brows furrowed. \"Brother, I sensed a terrifying aura earlier. Someone that strong…\" <br/><br/>Feng Yun couldn't fathom how his brother had managed to escape, and even his master could only attribute it to sheer luck, unable to explain how Feng Chen had survived. <br/><br/>He began to wonder whether his brother had a trump card that could even help deal with someone above Nascent Soul Realm or was it really just luck? <br/><br/>\"Yeah, she was a very powerful person but she wasn't hostile. In fact…\" He lifted the Celestial Harmony Necklace hanging from his neck. <br/><br/>\"She gave me this.\" <br/><br/>Feng Yun's eyes widened. Even from a glance, he could sense that the necklace wasn't an ordinary artifact. \"Brother, this... Who was she? And why would she give you something like that?\" <br/><br/>\"That's what I'd like to know too.\" Feng Chen admitted, his tone thoughtful. \"Anyway, I don't think we need to worry about her. Let's just go home!\" <br/><br/>Feng Yun would like to continue questioning his brother, especially about how he escaped. <br/><br/>However, thinking about his own secret, he refrained himself. <br/><br/>There are some things that can't just be shared and better left as secret. <br/><br/>If his brother wants to keep it a secret then he can only respect his decision and hope that someday he will share this secret with him. And even if he knew about it, Feng Yun didn't think that it could be of any help.\t\t\t\t\t\t</div>", "images": {}, "success": true}