{"id": 126, "url": "https://www.novelhall.com/my-brothers-the-protagonist-good-thing-i-awakened-my-system-33973/15172893.html", "title": "Chapter 130 Getting Toyed By A Phantom Girl", "volume": 2, "volume_title": "Volume 2", "body": "<h1>Chapter 130 Getting Toyed By A Phantom Girl</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\t Chapter 130  Getting Toyed By A Phantom Girl The figure provoked Feng Chen but he didn't fall for it. <br/><br/>However, he knew that if he wanted to find out the identity of the person before him, he had to take action. <br/><br/>SWISH! <br/><br/>Using his insane speed, Feng Chen disappeared and reappeared before the figure and tried to take off her mask. <br/><br/>However, his hand was caught by her before he could do so. Feng Chen tried to shake it off but realized that she was much stronger than he anticipated. He increased his strength further but that doesn't seem to make much difference. <br/><br/>One should know that with the Mid-Level Saint Grade Body Refinement Technique: Saintly Thunder Body, his strength was much higher than people at the same level. <br/><br/>Even Nascent Soul Realm cultivators would find it hard to compete with him even with his power restricted. <br/><br/>However, no matter how much strength he used, the person didn't budge at all. <br/><br/>( Looks like I have no choice! ) <br/><br/>Feng Chen immediately unleashed his Nascent Soul Realm cultivation and broke free from her hands. <br/><br/>\"No wonder! I thought how you as Three Elements Divine Realm could easily take care of so many Three Elements Divine Realm cultivators. You are in the Nascent Soul Realm.\" <br/><br/>The girl exclaimed in surprise. <br/><br/>Although she looked surprised, there was no fear in her eyes that her opponent was a Nascent Soul Realm expert. <br/><br/>\"But how did you hide your cultivation before me? It should be impossible.\" <br/><br/>The girl muttered in confusion. She didn't seem to pay much attention to Feng Chen who has shown his Nascent Soul Realm cultivation. <br/><br/>Feng Chen seized the moment when the girl seemed momentarily distracted, propelling himself forward at full speed, closing the distance between them in an instant. <br/><br/>\"Got you!\" <br/><br/>Feng Chen said excitedly. <br/><br/>However, as his hand reached out, it grasped only empty air. When he looked again, the girl had vanished without a trace, as if she had never been there. <br/><br/>\"You should try harder if you want to catch me.\" <br/><br/>A voice came from behind. <br/><br/>( How? ) <br/><br/>Feng Chen couldn't believe his eyes. He has used his full speed at Nascent Soul Realm and it would have been impossible for anyone to escape from him. <br/><br/>However, the girl did. <br/><br/>It seemed like he had severely underestimated the girl before him. <br/><br/>\"Ghostly Shadow Mirage!\" <br/><br/>In an instant, multiple clones of Feng Chen materialized. They spread out, surrounding the girl, cutting off any potential escape routes. The forest lit up with a faint ethereal glow as the clones moved with precision, their presence overwhelming and synchronized. The girl looked around, seemingly impressed. \"Not a bad technique,\" she said with a sly smile. \"But let's see if your clones can keep up.\" One of Feng Chen's clones darted toward her, sword slashing downward, but the girl sidestepped gracefully, her movements fluid and effortless. Before another clone could reach her, she vanished and reappeared a few steps away, her figure almost ghost-like in the misty surroundings. Feng Chen and his clones pressed on, their attacks relentless. Each time, the girl evaded them by a hair's breadth, her movements so unpredictable it was as if she were toying with them. \"Whoa, you almost had me there.\" She teased as one of Feng Chen's clones came within inches of grabbing her. Feng Chen frowned, his frustration mounting. Despite the speed and coordination of his clones, the girl always managed to slip away at the last moment, disappearing and reappearing like a phantom. At one point, one of his clones lunged, certain it had her. Feng Chen smirked, thinking he had finally caught her. But as his hand closed, it passed through thin air, and the girl's laughter echoed in the clearing. \"Close, but not close enough!\" She said, her tone light and playful. Feng Chen gritted his teeth. He activated the full power of his Nascent Soul Realm cultivation, his clones becoming faster and more aggressive. The entire forest shook under the pressure of his aura, trees splintering and leaves scattering in all directions. The girl, however, seemed unfazed. She danced through the chaos, her figure a blur. Feng Chen's clones formed a tight circle around her as they closed in. This time, he was sure there was no way out. \"You've run out of tricks,\" Feng Chen declared excitedly. Feng Chen found himself unexpectedly forced to unleash his full strength and employ every trick at his disposal just to try and catch the girl before him. It had been a long time since he had to exert himself to this extent. <br/><br/>Compared to this, his earlier fight with Tianlong and others couldn't even be counted as a warm-up. <br/><br/>He unknowingly was having fun and was excited to finally catch the girl who was as slippery as an eel. <br/><br/>The girl glanced at the encroaching clones and then at Feng Chen, her lips curling into a small smile. Just as the clones were about to strike, her figure shimmered like a mirage. The next moment, she was gone, leaving behind only a faint trace of her presence. \"Behind you!\" Her voice whispered again, taunting him from the shadows. Feng Chen spun around, but the girl stood at a distance, casually leaning against a tree, as if dealing with Feng Chen was child's play. Feng Chen had no choice but to admit that he was no match against the girl, at least in terms of speed. <br/><br/>He was being toyed around by her. . \"Looks like I have no choice but to admit defeat!\" <br/><br/>Feng Chen muttered, but that didn't mean he gave up on finding out who she was. He only didn't want to play this tag game with her. <br/><br/>\"Eyes Of Insight!\" <br/><br/>( I like to see what secret you are hiding! ) <br/><br/>Feng Chen used his skill. <br/><br/>**************** <br/><br/>Name: ??? <br/><br/>Cultivation Level: ??? <br/><br/>Talent: ??? <br/><br/>Physique: ???  Searᴄh the Novёlƒire.n(e)t website on Google to access chapters of novels early and in the highest quality.<br/><br/>**************** <br/><br/>\"What?\" <br/><br/>This time, Feng Chen couldn't hold back and let out a shout. Even he struggled to remain composed after his Eyes of Insight had failed him. <br/><br/>To this day, his Eyes Of Insight has never failed and even Ice Fairy's information could be seen by this skill. <br/><br/>However, this time, it has failed for the first time ever. <br/><br/>( Why? ) <br/><br/>Feng Chen was baffled, his mind racing to uncover the reason. <br/><br/>After a moment of thought, he narrowed it down to two possible explanations for why his Eyes of Insight had failed. <br/><br/>Either the person before him has higher cultivation than him and Eyes Of Insight doesn't work on the people whose cultivation is higher than his own or she has some artifact that could block this technique. <br/><br/>For the first reason, the person needs to be in the Spirit Severing Stage or higher. Judging by her strength, it didn't seem entirely impossible. <br/><br/>He firmly believed he could handle anyone in the Nascent Soul Realm, and even if faced with powerful geniuses, he was confident they wouldn't be able to toy with him the way this person had. <br/><br/>However, there is no record of the Spirit Severing Stage being in Azure Sky Empire which meant that the person wasn't from the Azure Sky Empire or some unknown powerhouse. <br/><br/>As for having an artifact, Feng Chen believed that the grade of the artifact would at least need to be in Saint Grade if it could block the Eyes Of Insight skill. <br/><br/>This itself shows that the person has a great background incomparable to Spirit Wind Palace. <br/><br/>In any case, he knew that the opponent was anything but an easy one. <br/><br/>His only saving grace was that the person didn't seem too hostile, otherwise, with her strength, Feng Chen believed that he could have been killed multiple times by her. <br/><br/>It looks like he could only give up on finding out the other person's identity. <br/><br/>Seeing that Feng Chen no longer seemed to continue this, the girl became a bit disappointed. <br/><br/>\"Gave up so soon?\" <br/><br/>She asked. teasingly <br/><br/>\"Well, there's no point in trying when I already know it's futile. Besides, you don't seem hostile.\" <br/><br/>Feng Chen replied honestly. <br/><br/>\"... Well, good enough!\" <br/><br/>The girl replied, though disappointed. \"So can you tell me what you want from me?\" <br/><br/>Feng Chen asked. <br/><br/>\"Nothing! Just wanted to test something and you can say that you passed.\" <br/><br/>The girl answered in some vague context. \"Here! To congratulate you on passing the test, you can have this.\" <br/><br/>The girl handed over a necklace. At first glance, one could tell that it wasn't a cheap necklace at all. <br/><br/>It was beautifully crafted, with intricate designs that suggested it was of great value. The moment Feng Chen touched it, he felt a faint pulse of energy emanating from it, something subtle but unmistakable. He was about to ask the girl what it was, what it meant, and why she had given it to him, but before he could open his mouth, he realized something. <br/><br/>She was gone! <br/><br/>His eyes snapped around the clearing, his senses straining to pick up any trace of her presence. There was no movement, no sound, nothing. It was as if she had vanished into thin air. <br/><br/>The sound of the wind rustling through the trees was the only thing that greeted him. The forest was quiet once more. <br/><br/>Feng Chen sighed, running a hand through his hair. He had no answers, only more questions. Whoever this girl was, she had left him with more mystery than he had ever expected. <br/><br/>\"What was that all about?\" \t\t\t\t\t\t</div>", "images": {}, "success": true}