{"id": 136, "url": "https://www.novelhall.com/my-brothers-the-protagonist-good-thing-i-awakened-my-system-33973/15207752.html", "title": "Chapter 142 Bowing To The Inevitable", "volume": 2, "volume_title": "Volume 2", "body": "<h1>Chapter 142 Bowing To The Inevitable</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\t Chapter 142  Bowing To The Inevitable After a long moment, Wu Zhen exhaled deeply, as if dispelling the lingering tension from the room. He adjusted his robe, his expression softening into one of measured calm. <br/><br/>\"I will go greet the Feng Clan now,\" he said, rising to his feet. <br/><br/>The words left his allies stunned. <br/><br/>\"Clan Leader Wu...\" Lin Fu began hesitantly, but the sharp glare Wu Zhen shot his way silenced him immediately. <br/><br/>It seemed like the Zhu Clan had already won before they could do anything, as their leader was already ready to surrender. <br/><br/>Without waiting for a response, Wu Zhen strode out of the secluded corner, his posture upright. <br/><br/>As he approached the section of the courtyard where Feng Chen was seated, his heart pounded in his chest. Every step felt like he was walking toward a mountain of ice, its frigid aura pressing down on him with invisible weight. <br/><br/>Other people noticed Wu Zhen as he made his way toward the Feng Clan. They couldn't help but whisper to each other, wondering what the Wu Clan Leader might do. <br/><br/>\"Clan Leader Feng!\" <br/><br/>Wu Zhen greeted with a slight bow, his voice steady but reverent. <br/><br/>\"It is an honor to have such esteemed guests gracing Xianlong City. Your generosity toward the Zhu Clan tonight is truly awe-inspiring.\" <br/><br/>\"You are…\" <br/><br/>Wu Zhen quickly bowed again, lowering his gaze in deference. <br/><br/>\"I am Wu Zhen, Clan Leader of the Wu Clan of Xianlong City.\" <br/><br/>\"We've actually met before, Clan Leader Feng,\" Wu Zhen said, bowing again to steady himself. \"At the Eastern Gathering.\" <br/><br/>\"I had the privilege of witnessing your unparalleled victories firsthand.\" <br/><br/>Wu Zhen continued. <br/><br/>\"Your triumphs were nothing short of legendary, especially against some of the most renowned figures of the Eastern Region. To see you effortlessly defeat those Three Element Divine Realm experts… It was awe-inspiring, to say the least.\" <br/><br/>\"Ah, indeed! No wonder the Wu Clan Leader looked familiar,\" Feng Chen said. <br/><br/>Wu Zhen's eyes lit up at Feng Chen's acknowledgement. He straightened slightly, his voice carrying a mixture of humility and relief. <br/><br/>\"It is an honor to be remembered by someone as esteemed as you, Clan Leader Feng.\" <br/><br/>Wu Zhen replied, bowing deeply once more. <br/><br/>Others who thought Wu Zhen might create trouble for the Feng Clan were disappointed, but they could understand his actions. After all, there was no comparison between the Wu Clan and the Feng Clan. Offending the Feng Clan could only mean having your clan destroyed. Still, they didn't expect the Wu Clan, the most dominant clan in Xianlong City, to be so subservient to the Feng Clan, especially knowing that he was backed by the Third Prince. He was acting almost like a lackey of Feng Chen. <br/><br/>Feng Chen's gaze lingered on him for a moment, then he asked. <br/><br/>\"What brings you here, Clan Leader Wu? I presume it's not just to reminisce about past events.\" <br/><br/>Wu Zhen hesitated for a moment, his mind swirling. <br/><br/>\"I... I wasn't aware that the Feng Clan knew the Zhu Clan, Clan Leader Feng.\" <br/><br/>Wu Zhen began as he turned to Zhu Shangxian. <br/><br/>\"Zhu Shangxian, I fear I may have unintentionally offended you or wronged you in some way in the past. For that, I am more than willing to offer any compensation and humbly ask for your forgiveness.\" <br/><br/>The courtyard fell into a tense silence as Wu Zhen's words hung in the air. No one expected that Wu Zhen would directly surrender to the Zhu Clan like this. <br/><br/>Zhu Shangxian also blinked in surprise at the sudden change in Wu Zhen. He didn't think that Wu Zhen would immediately give up just because the Feng Clan had arrived. The person who had been so difficult to handle had given up just with Feng Chen's appearance. <br/><br/>\"Umm…\" Zhu Shangxian didn't know how to reply. Even with Feng Clan support, he had never thought of making the Wu Clan surrender. At most, they would recover their lost market and gain a few more. After all, the Wu Clan wasn't an easy opponent with their extensive list of allies. <br/><br/>\"Well, it was just a competition between the clans, and there's no need to dwell on it, Wu Zhen,\" Zhu Shangxian replied. <br/><br/>He didn't think it was appropriate to take advantage of Feng Chen to humiliate Wu Zhen, especially in front of the Feng Clan. After all, Wu Zhen hadn't really done anything out of hand and had competed with them, though they had the unfair advantage of the Third Prince's support. There was no need to make enemies unnecessarily, and with the Feng Clan's business proposal, Zhu Shangxian didn't want obstacles in their work. <br/><br/>Wu Zhen bowed his head once more, relieved that Zhu Shangxian wasn't pressing the matter further. He finally felt relieved that he didn't offend the Feng Clan and could live to see another day. <br/><br/>Wu Zhen straightened up, his mind racing as the heavy silence lingered. His breath steadied, but his thoughts were far from calm. He had managed to defuse the immediate tension, but one thing still weighed on him. After a moment of careful thought, he cleared his throat and turned his gaze toward Feng Chen, his expression suddenly serious. <br/><br/>\"Clan Leader Feng,\" Wu Zhen began, his tone careful yet firm. \"I… I must apologize for the impertinence of my question, Clan Leader Feng, but… Does the Feng Clan have any conflict with the Third Prince?\" <br/><br/>He said it with careful consideration, fully aware that such a query could be seen as bold or even inappropriate, but it was a matter he could not leave unspoken. <br/><br/>After all, he didn't know whether being an ally of the Third Prince could get his neck cut by the Feng Clan. <br/><br/>Although severing ties with the Third Prince might anger the Third Prince, it was better than offending the Feng Clan, Wu Zhen thought. <br/><br/>\"No!\" Feng Chen replied calmly. <br/><br/>He had declined the invitation from the Third Prince, but that didn't mean he had a conflict with him. Although he couldn't say the same about the other party. <br/><br/>Anyway, Feng Chen had never taken the Third Prince seriously and didn't think much about it. <br/><br/>Wu Zhen's heart settled slightly, but the unease didn't entirely vanish. \"I see!\" He said, bowing his head in acknowledgment.  Searᴄh the ηovelFire.ηet website on Google to access chapters of novels early and in the highest quality.<br/><br/>\"But I can assure you, Clan Leader Feng, that should any conflict arise between your clan and the Third Prince in the future, I will sever all ties immediately.\" <br/><br/>His connection with the Third Prince had always been more about benefit than loyalty, and the last thing he wanted was for his dealings with the prince to cause trouble with the Feng Clan. The consequences of such a move were clear in his mind: aligning too closely with the wrong side could result in losing everything. Just like how Bai Zhang had lost his life because he chose the wrong side. <br/><br/>He didn't want that and would do everything in his power to avoid that.\t\t\t\t\t\t</div>", "images": {}, "success": true}