{"id": 135, "url": "https://www.novelhall.com/my-brothers-the-protagonist-good-thing-i-awakened-my-system-33973/15207751.html", "title": "Chapter 141 Surrender Before The Fight", "volume": 2, "volume_title": "Volume 2", "body": "<h1>Chapter 141 Surrender Before The Fight</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\t Chapter 141  Surrender Before The Fight Meanwhile, in a quieter corner of the courtyard, members of the Wu Clan and their allies gathered, their expressions dark. They had come today with the intent of completely crushing the Zhu Clan, but the events were unfolding in the exact opposite direction. An elder from the He Clan slammed his hand on the table, his frustration palpable. \"Are we just going to sit here and let the Zhu Clan rise to prominence under the Feng Clan's wing? Their alliance has been practically solidified after that public show of generosity! If we don't act, the Zhu Clan will completely suppress us in Xianlong City.\" Another ally, a rotund merchant named Lin Fu, nodded in agreement. \"With the Feng Clan openly supporting them, they've essentially claimed dominance over this city. If we don't act now, we'll be driven out!\" \"The Third Prince has long viewed the Feng Clan as a thorn in his ambitions for the Eastern Region. With his support, we can deal with the Zhu Clan even under the Feng Clan's shadow.\" <br/><br/>Lin Fu argued, his voice filled with desperation. Wu Zhen's expression darkened as he spoke through gritted teeth. \"You speak of action against the Feng Clan as if it's that simple. Do you have any idea of the power they hold? Even with the Third Prince's backing, challenging Feng Chen is a fool's errand.\" Lin Fu hesitated, his earlier bravado faltering. Still, the thought of his businesses being overshadowed by the Zhu Clan gnawed at him. He silently resented Wu Zhen's cautious approach, wishing his leader would display more courage—even if it was fake. After all, wasn't it because of Wu Zhen and his newfound backing from the Third Prince that he dared to oppose the Zhu Clan? <br/><br/>Shouldn't Wu Zhen display the same courage and aggressiveness now, just as he had when taking over Xianlong City's market share under the Third Prince's name? <br/><br/>\"But Clan Leader Wu, with the Third Prince's support, surely—\" Wu Zhen slammed his hand on the table. If not for concealing the sound, it must have caught the attention of everyone. \"Enough!\" Wu Zhen barked, his voice low but commanding. \"Don't speak of this anymore. From this moment on, we are to stop competing with the Zhu Clan and even offer our assistance if necessary.\" The sudden shift in strategy stunned the room. \"Clan Leader Wu, what are you saying?\" Lin Fu blurted out. Wu Zhen's gaze turned icy as he recalled a memory that still haunted him—the Eastern Gathering. Being the strongest in Xianlong City, the Wu Clan had been invited to the prestigious Eastern Gathering. Yet, with their strongest cultivator only in the Grand Qi Condensation Realm and their youth's talent middling at best, they were relegated to the lowest ranks from round one. It was there that Wu Zhen had witnessed the sheer might of the Feng Clan. Their genius performance could be said to have overshadowed any other participant including those from the Tianlong, Yuan and Yunhai Clan. <br/><br/>More importantly, Feng Chen's performance at the Eastern Gathering was unforgettable. Feng Chen had toyed with several Three Elemental Divine Realm experts—renowned leaders of powerful Eastern Region clans—and even withstood an attack from Tianlong Qi without so much as flinching. And wasn't Bai Zhang also supported by the Third Prince like him but ended up in a humiliating position? <br/><br/>The events following the gathering were even more chilling. Ba Zhang, Tianlong Qi and some other clan leaders along with some of their elders were reported to be missing after the Eastern Gathering. Wu Zhen didn't need to guess their fate. He had been approached to join the ambush but had declined, citing fabricated orders from the Third Prince. It had been the best decision of his life. Those who dared challenge Feng Chen were now all missing, and Wu Zhen considered them dead. Wu Zhen glared at Lin Fu, thinking, ( I barely escaped death from Feng Chen's hand, and now this idiot wants me to march to the same death. ) <br/><br/>\"Do you think the Third Prince can protect us against Feng Chen? Let me make this clear: even the Third Prince wouldn't dare openly challenge the Feng Clan.\" Otherwise, the Third Prince should already know what happened to Bai Zhang and who was responsible for it. <br/><br/>But it had been months since Ba Zhang was reported missing and he didn't hear anything about the Third Prince doing anything to take revenge against Feng Chen. <br/><br/>That means either the Feng Clan is far beyond what the Third Prince can contend with, or Bai Zhang wasn't important enough for the Third Prince to risk going against the Feng Clan. <br/><br/>In either case, Wu Zhen couldn't see a good ending for his clan if he went against the Feng Clan. <br/><br/>His Clan wasn't as good as the Bai Clan, so if the third Prince didn't care about the Bai Clan, why would he care about his clan going against the Feng Clan? <br/><br/>\"Clan Leader Wu, while I understand your concerns—\" Lin Fu still wanted to persuade Wu Zhen. <br/><br/>\"Understand my A**!\" Wu Zhen interrupted coldly. He knew that other than him, there weren't any who knew the true horror of going against Feng Chen.  S~eaʀᴄh the Nôvel(F)ire.ηet website on Google to access chapters of novels early and in the highest quality.<br/><br/>Even those Top Clan and Sects couldn't do anything against them. What was he? Just a small ant compared to them who died at the hand of Feng Chen. <br/><br/>\"The Third Prince cannot rival the Feng Clan.\" The room fell silent, the weight of Wu Zhen's words sinking in. \"Let me warn you all,\" Wu Zhen continued, his tone laced with finality. \"Do not antagonize the Zhu Clan, and never even think of going against the Feng Clan. If anyone here acts recklessly, don't blame me for severing ties—and siding with the Feng Clan against you.\" His allies exchanged uneasy glances, each one deeply shaken. The message was clear: Wu Zhen feared Feng Chen far more than he valued the Third Prince's support. The room fell into a heavy silence as Wu Zhen's words settled over them like an unshakable shadow. The fear in his voice was unmistakable, and the resolve behind his warning was unyielding. The assembled allies exchanged uneasy glances. None dared speak further, realizing that Wu Zhen would rather lose his hold over Xianlong City's markets than risk even the slightest provocation against the Feng Clan. Lin Fu clenched his fists under the table, but he didn't dare voice his frustrations again. The weight of Wu Zhen's stance was clear: anyone who pushed against his decision would find themselves isolated—or worse, facing Wu Zhen as an enemy. \t\t\t\t\t\t</div>", "images": {}, "success": true}