{"id": 138, "url": "https://www.novelhall.com/my-brothers-the-protagonist-good-thing-i-awakened-my-system-33973/15212366.html", "title": "Chapter 144 The Shadowy Threat", "volume": 2, "volume_title": "Volume 2", "body": "<h1>Chapter 144 The Shadowy Threat</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 144  The Shadowy Threat \"Why have you all not completed what I ordered yet?\" <br/><br/>A powerful voice rang across the hall of Spirit Wind Palace. <br/><br/>Everyone including the sect leader trembled in fear. It is because the person speaking was the ancestor of Spirit Wind Palace whose strength is far higher than Sect Leader. <br/><br/>The hall of the Spirit Wind Palace fell into an oppressive silence, the air heavy with dread. <br/><br/>The ancestor of the Spirit Wind Palace, a figure cloaked in a suffocating aura of authority and power, sat upon a grand seat at the head of the hall. His eyes burned like embers, scrutinizing the trembling figures before him. <br/><br/>\"Sect Leader Qian!\" The ancestor's voice boomed once more, laced with impatience. \"Are my orders too difficult for you to comprehend? Or do you lack the capability to execute them?\" <br/><br/>Sect Leader Qian Zheng fell to his knees, his forehead nearly touching the cold marble floor. Beads of sweat dotted his face despite the chilly air in the hall. <br/><br/>\"Ancestor,\" Qian stammered, his head pressed low to the floor, \"we are doing all we can.\" <br/><br/>\"The Feng Clan… they are not an easy opponent. I sent two of our powerful Grand Elders, accompanied by allied forces from other clans, to confront them. They fought with the Feng Clan directly but… they were killed in the battle.\" <br/><br/>Qian's voice grew even shakier as he continued, his forehead slick with sweat. <br/><br/>\"After your instructions, I dispatched four more Grand Elders as reassurance. They were to reinforce the mission and ensure its success.\" <br/><br/>\"But they had all been killed before they even reached Qingyun City. I suspect that the Feng Clan has someone powerful protecting them.\" The ancestor's eyes narrowed, his fiery gaze igniting with fury. His aura flared, a crushing wave of energy radiating from him that made even the air in the hall feel suffocating. <br/><br/>\"You're telling me,\" the ancestor said in a low, venomous tone, \"that not only did two of our Grand Elders fall to the Feng Clan, but the reinforcements I ordered never even reached their destination?\" <br/><br/>Qian Zheng nodded frantically, his head still lowered. \"Y-Yes, Ancestor!\" <br/><br/>For a long moment, the ancestor said nothing, his silence more terrifying than his earlier wrath. The ancestor's eyes burned with disdain as Sect Leader Qian Zheng prostrated himself, his voice trembling under the oppressive weight of the ancestor's presence. <br/><br/>Qian Zheng flinched but steeled himself, clenching his fists. After a brief silence, he raised his head slightly, his voice gaining an edge of bitterness. <br/><br/>\"Ancestor, if not for… circumstances, I would have gone myself to deal with this matter. But that woman—the Mystic Flame Sect Leader—has been watching me closely. Her eyes are everywhere, and there's no telling what she might do if I were to make a move myself.\" <br/><br/>His tone grew sharper, his frustration palpable. \"That lunatic has been looking for a way to kill me. Who would have thought that wretched girl, the one I nearly killed, would not only survive but ascend to the Nascent Soul Realm in such a short time?\"  Searᴄh the Nôvel(F)ire.ηet website on Google to access chapters of novels early and in the highest quality.<br/><br/>( It is all because of that …. ) <br/><br/>Qian Zheng thought bitterly. It is bad that there was one survivor from the clan that he had destroyed, not to mention that she had become so powerful that her power surpassed him now. <br/><br/>The ancestor leaned back, his fiery eyes narrowed into slits. \"So, this is the work of that whelp? Might be. Or it could be someone else…\" <br/><br/>The ancestor said while seemingly having some idea about who it could be. <br/><br/>Turning his piercing gaze back to Qian, the ancestor's tone became cutting. \"You should consider yourself fortunate, Sect Leader. Had you failed without these excuses, you would not be standing here now.\" <br/><br/>\"Thank you for your mercy, Ancestor!\" Qian said quickly, bowing deeply. <br/><br/>\"Enough groveling. Don't act openly for now and keep watch on Feng Clan and the Mystic Flame Sect.\" <br/><br/>\"I will be in seclusion and try to break through to the Spirit Severing Realm. After this, the Azure Sky Empire will be ours to rule.\" <br/><br/>The ancestor said as he left the place. <br/><br/>As the ancestor's oppressive aura withdrew, the tension in the hall eased slightly. Sect Leader Qian Zheng and the gathered elders exchanged cautious glances, their trembling subsiding into relief. <br/><br/>The ancestor's declaration of entering seclusion brought a spark of hope and excitement to their eyes. If he succeeded in breaking through to the Spirit Severing Realm, the Spirit Wind Palace's dominance over the Azure Sky Empire would be unchallenged. <br/><br/>Qian Zheng straightened himself, his breathing steadying, a faint smirk curling his lips. <br/><br/>( The day will come when that damn Mystic Flame Sect Leader will kneel before me. ) <br/><br/>He thought bitterly <br/><br/>( I will see her arrogant face twisted in despair and strip her of every shred of dignity. She thinks she can stand in my way forever? We'll see who laughs last. Haha… ) <br/><br/>The elders around him whispered among themselves, their excitement bubbling over. <br/><br/>\"With the ancestor's breakthrough, no one in the empire will be able to defy us!\" <br/><br/>\"Even the Mystic Flame Sect would have to bow! And the Feng Clan? They'll be nothing but dust in our wake!\" <br/><br/>Sect Leader Qian raised a hand to silence them, his expression dark but resolute. <br/><br/>\"Enough. Let us not count our victories before they are won. Focus on ensuring the ancestor's seclusion remains undisturbed. We will deal with the Feng Clan and that insufferable woman in due time.\" <br/><br/>The elders nodded, though their anticipation lingered in their eyes as they dispersed to their tasks. <br/><br/>In the ancestor's secluded chamber, the air shimmered with power. The vast room was dimly lit, the glow of spiritual formations etched into the walls casting an eerie light. <br/><br/>The ancestor sat cross-legged on a high dais, his expression calm but his eyes flickering with an ominous gleam as he began to meditate. However, the tranquility was abruptly broken. <br/><br/>From the shadows, a figure emerged, cloaked in darkness. Their presence seemed to distort the space around them, exuding a power that even the ancestors couldn't ignore. <br/><br/>The ancestor opened his eyes, his gaze sharp and alert. \"So, you've come,\" he said, his tone low and guarded. <br/><br/>The shadowy figure's voice was like a whisper carried on the wind, cold and menacing. \"You've made little progress, despite my… generosity. How about the task I had assigned you?\" <br/><br/>The ancestor's eyes narrowed. \"The Feng Clan has proven more resilient than anticipated. But their end is only a matter of time.\" <br/><br/>The figure stepped closer, their form shifting unnaturally as though they were not entirely human. \"Time is not a luxury you have. If the Feng Clan is not eliminated soon, you will suffer the consequences.\" <br/><br/>A flicker of frustration crossed the ancestor's face, but he masked it quickly. \"You underestimate my patience and my plans. I am on the verge of a breakthrough. Once I ascend, not even the heavens will protect them from my wrath.\" <br/><br/>The shadowy figure let out a low, mocking laugh. \"Your ambitions mean nothing if you cannot deliver results.\" <br/><br/>The ancestor's fists clenched, his aura flaring slightly. \"Hmph! What do you know? Someone from the Central Domain has entered the Azure Sky Empire and is assisting the Feng Clan. If not for them, Feng Clan shouldn't have been alive.\" <br/><br/>The shadowy figure tilted its head slightly, a faint ripple passing through its form as if it was pondering the ancestor's words. <br/><br/>\"Someone from the Central Domain?\" The voice was cold, with an edge of disbelief. \"Impossible. No one other than myself should be able to infiltrate the Azure Sky Empire without drawing notice. Unless… \" <br/><br/>The shadowy figure trailed off, its form rippling with unease. \"The Feng Clan's recent rise, their victories against our forces—it's unnatural. If not someone from the Central Domain, then who else could possess such power to protect them from the shadows?\" <br/><br/>The figure paused, its silence heavy with thought. Finally, it spoke, its tone cautious but resolute. <br/><br/>\"While unlikely, the possibility cannot be entirely dismissed. I will have someone investigate this and you should know what will happen if you lie to me!\" <br/><br/>Its voice hardened, laced with finality. \"You have two years to complete the task I have given you. The Feng Clan must be eradicated, with no survivors. Should you fail…\" <br/><br/>The figure's presence grew heavier, like a crushing weight bearing down on the room. The ancestor's jaw clenched, his pride warring with the oppressive power radiating from the figure. \"Hmph! Don't worry. In two years, there would not be a bone left of the Feng Clan.\" <br/><br/>The figure began to fade, its form melting back into the shadows. \"See that it does.\" <br/><br/>As the presence fully vanished, the ancestor's chamber fell into an eerie silence once more. The ancestor's fiery eyes gleamed with cold determination as he clenched his fists. <br/><br/>\"Two years… Very well. Feng Clan, Mystic Flame Sect, all of you will learn the price of defying me. I will not fail.\" <br/><br/>Closing his eyes, he drew in a deep breath, his aura stabilizing as he sank back into meditation. \"Two years and the Azure Sky Empire will finally fall into his hands.\"\t\t\t\t\t\t</div>", "images": {}, "success": true}