{"id": 137, "url": "https://www.novelhall.com/my-brothers-the-protagonist-good-thing-i-awakened-my-system-33973/15211206.html", "title": "Chapter 143 Breaking Through To The Top Nascent Soul", "volume": 2, "volume_title": "Volume 2", "body": "<h1>Chapter 143 Breaking Through To The Top Nascent Soul</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\t Chapter 143  Breaking Through To The Top Nascent Soul The Zhu Shangxian's 70th birthday celebration concluded without much trouble. <br/><br/>All lingering issues of the Zhu Clan seemed to vanish after the Feng Clan's arrival. <br/><br/>This was true influence and power! <br/><br/>One needn't take action—just their presence alone compelled others to submit. <br/><br/>The Feng Clan stayed at the Zhu Mansion for two days before departing. <br/><br/>During this time, Feng Junxia was like a mother, constantly nagging Feng Chen about marriage. <br/><br/>\"Chen'er, you're not getting any younger. You should find someone you like.\" <br/><br/>\"What kind of Clan Leader reaches your age without a descendant? Don't you care about the Feng Clan's future stability?\" <br/><br/>\"If you can't find someone, I can introduce you to a few friends. They're quite lovely, you know!\" <br/><br/>Feng Junxia's persistence was relentless, and her motives extended beyond mere familial concern. <br/><br/>Her intentions weren't solely about Feng Chen's happiness but also about the Feng Clan's stability. <br/><br/>While she trusted the clan's unity, the absence of a clear heir left room for potential strife, especially if Feng Chen were to face misfortune, much like his parents. <br/><br/>Having a child would guarantee a successor and quell any disputes about leadership succession. <br/><br/>Moreover, Feng Junxia believed the Feng Clan needed a lady of the house—a capable woman who could oversee matters and keep Feng Chen grounded. <br/><br/>Of course, Feng Chen brushed off these conversations or found ways to escape them. <br/><br/>It wasn't that he was against marriage; he simply wanted to find someone he genuinely liked, which was easier said than done. <br/><br/>As for Junxia's suggestions? Meeting her friends was out of the question. <br/><br/>( One Junxia is enough. I can't deal with another one! ) <br/><br/>Feng Chen thought to himself. <br/><br/>After two days, it was finally time for Feng Chen to go back. <br/><br/>The farewell was anything but a quiet one. <br/><br/>The Zhu Clan, along with representatives from other Xianlong City clans, came to bid farewell to the Feng Clan. <br/><br/>\"Clan Leader Feng, I cannot thank you enough for attending my humble celebration.\" <br/><br/>Zhu Shangxian said, bowing deeply. <br/><br/>Feng Chen waved dismissively. <br/><br/>\"There's no need for formalities. I also had fun.\" <br/><br/>Feng Junxia, not missing an opportunity, added with a smile, \"Chen'er, you must visit me again soon. And of course, it would be wonderful if you brought a wife along next time.\" <br/><br/>Feng Chen coughed lightly, his composure faltering slightly. <br/><br/>\"I'll… try my best. Farewell!\" <br/><br/>\"Take care of yourself!\" <br/><br/>On the Road... <br/><br/>SIGH! <br/><br/>Feng Chen leaned back with a sigh, rubbing his temples. <br/><br/>\"Since when did Feng Junxia start acting like a mother?\" <br/><br/>He muttered. <br/><br/>Elder Wei, riding beside him, chuckled. <br/><br/>\"She's only worried about you, Nephew. Though… she does have a point.\" <br/><br/>Feng Chen gave him a wary look. \"Elder Wei, don't you start too.\" <br/><br/>Elder Wei grinned knowingly. <br/><br/>\"Actually, Nephew, I've received quite a few marriage proposals for you.\" <br/><br/>Feng Chen blinked. <br/><br/>\"What?\" <br/><br/>Feng Chen didn't know that other clans were sending marriage proposals, as all of this was handled by Elder Wei while Feng Chen was cultivating. <br/><br/>With the Feng Clan's rise and our young geniuses gaining recognition—especially Feng Mei becoming the direct disciple of the Icy Veil Sect Leader—many powerful clans saw a bright future in the Feng Clan. <br/><br/>Their daughters, all reputable and beautiful, were put up for the marriage proposal. <br/><br/>If one were to search for a potential bachelor in the whole Azure Sky Empire, there was no one better than Feng Chen. <br/><br/>Unlike other geniuses who were all about potential, Feng Chen was a genius who was already one of the strongest and the young clan leader of the Feng Clan. <br/><br/>As their carriage moved through the winding mountain roads, Elder Wei smirked and continued. <br/><br/>\"We still have a long journey ahead. Perhaps I should tell you about the top candidates to pass the time. First is…\" <br/><br/>As the carriage moved through the winding mountain roads, Elder Wei began recounting the marriage proposals that had come in for Feng Chen. <br/><br/>He mentioned Lan Qiu of the Lan Clan, a renowned alchemist known for her beauty and grace, and Bi Rou of the Bi Clan, a fierce warrior with a captivating charm. <br/><br/>There were also some from the clans in the capital although not as powerful or prestigious as the Ling Clan. <br/><br/>Though Feng Chen quickly brushed it off, Elder Wei persisted. <br/><br/>\"Nephew, this is important for you to consider. They've taken the initiative to send marriage proposals; the least we can do is show the courtesy of hearing them out.\" <br/><br/>Elder Wei said, continuing to list other names, including their talents and illustrious backgrounds, despite Feng Chen's evident lack of interest. <br/><br/>( Finally, some peace! ) <br/><br/>Feng Chen stood in his chamber, letting out a quiet sigh as he took in the serene ambiance. <br/><br/>Elder Wei really didn't leave out a single lady who had sent a marriage proposal to him and continued to talk about which girl would be most suitable for him. <br/><br/>\"I am still too young to marry!\" <br/><br/>Feng Chen didn't think about prioritizing marriage. After all, his lifespan was quite long, and it wouldn't be surprising if he lived for thousands of years. <br/><br/>So, he didn't think that getting married was important for him, although the elders had different ideas. <br/><br/>\"Let's focus on cultivation and try to break through to the Top Nascent Soul Realm.\" <br/><br/>For now, his priorities lay firmly with cultivation. <br/><br/>Sitting cross-legged on the jade mat in the center of his chamber, Feng Chen entered a meditative state. <br/><br/>Hours turned into days, days into weeks, as Feng Chen's aura gradually intensified. <br/><br/>During that period, Elder Wei looked after the clan affairs, especially the business with the Zhu Clan. <br/><br/>The Zhu Clan worked exceptionally well, and it seemed that Feng Junxia's husband had been appointed as an elder to oversee dealings with the Feng Clan. <br/><br/>Feng Chen continued to cultivate, and finally, after an unknown period of time, he broke through to the Top-Level Nascent Soul Realm. <br/><br/>However, he didn't come out of seclusion and continued to cultivate. <br/><br/>Feng Chen had given strict orders not to disturb him unless something important came up. <br/><br/>So, unless someone came with urgent news, Feng Chen decided to continue cultivating. <br/><br/>It wasn't until another long period had passed that he sensed someone standing outside his door. <br/><br/>( Did something happen? ) <br/><br/>Feng Chen thought as he stopped his cultivation. <br/><br/>He stood up and walked toward the door of his chamber. <br/><br/>\"What is it? Has something happened?\" <br/><br/>The person bowed slightly. However, looking at their expressions, Feng Chen could tell that it wasn't a matter of trouble. <br/><br/>\"Clan Leader, Elder Wei has requested your presence in the hall.\" <br/><br/>\"Umm… Let's go!\" <br/><br/>Feng Chen walked down the corridor, his footsteps steady, but his thoughts lingering on the strange sense of calm that pervaded the clan's estate. <br/><br/>He asked just how long he had been in seclusion, and the servant replied that it had been more than five months. <br/><br/>Along the way, servants and clan members greeted him warmly, exchanging pleasantries as they went about their duties. <br/><br/>Nothing about the atmosphere suggested urgency or danger. <br/><br/>( What could this be about? ) <br/><br/>Feng Chen wondered, still puzzled as to why he had been summoned. <br/><br/>He pushed the questions aside as he arrived at the grand hall. <br/><br/>The massive wooden doors swung open, revealing a room filled with the high-ranking members of the clan. <br/><br/>Feng Zhenshan, the Grand Elder, stood at the center, surrounded by a few other elders and grand elders, all with excited expressions. <br/><br/>( Was everyone called out? ) <br/><br/>Feng Chen thought as he saw everyone, including grand elders who should have been in seclusion. <br/><br/>However, what truly caught Feng Chen's attention was the change in Feng Zhenshan's aura. <br/><br/>Not only did Feng Zhenshan look younger, but his aura was much more powerful than before. <br/><br/>It was the unmistakable energy of someone who had broken through to the Three Elements Divine Realm. <br/><br/>\"You broke through?\" <br/><br/>Feng Chen asked, his voice laced with both surprise and admiration. <br/><br/>Feng Zhenshan turned toward him, a rare smile tugging at his lips. <br/><br/>\"Yes, Chen'er!\" <br/><br/>Feng Zhenshan replied, his voice strong.  Sёarᴄh the ηovёlFire .net website on Google to access chapters of novels early and in the highest quality.<br/><br/>\"No wonder Elder Wei sent someone to call me. Such a happy event, we definitely need to celebrate.\" <br/><br/>Feng Chen said. <br/><br/>\"Haha… That's right. It is time to show that we, the Feng Clan, have another Three Elements Divine Realm cultivator.\" <br/><br/>Grand Aunt Feng Zhilan said excitedly. <br/><br/>With the addition of another Three Elements Divine Realm cultivator, they could truly be considered one of the most powerful clans in the Eastern Region. <br/><br/>There were only two clans that could be said to be on par with them: the Yuan and Yunhai Clans, both of which also had two Three Elements Divine Realm cultivators. <br/><br/>As for the Tianlong Clan, with the death of their two Three Elements Divine Realm cultivators, it could hardly be considered the strongest in Qingyun City, much less the Eastern Region. <br/><br/>It is said that the Tianlong Clan is struggling to maintain their previous power with the loss of their Three Elements Divine Realm cultivators, and other clans are fighting for the shares they once controlled. <br/><br/>In any case, the Tianlong Clan was already done for, and the Feng Clan had replaced them, becoming one of the Top 3 strongest clans in the Eastern Region. \t\t\t\t\t\t</div>", "images": {}, "success": true}