{"id": 131, "url": "https://www.novelhall.com/my-brothers-the-protagonist-good-thing-i-awakened-my-system-33973/15178537.html", "title": "Chapter 137: Feng Chen'S Heroic Past", "volume": 2, "volume_title": "Volume 2", "body": "<h1>Chapter 137: Feng Chen'S Heroic Past</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\t Chapter 137: Feng Chen's Heroic Past\"What did the Clan Leader say?\"<br/><br/>Feng Junxia asked her husband who just returned.<br/><br/>Zhu Yansheng scratched his head in embarrassment and told what the clan leader asked him.<br/><br/>\"Oh! My cousin and father should arrive soon.\"<br/><br/>Feng Junxia answered.<br/><br/>Since they had agreed, she knew that they would come. Feng Chen wasn't the one who broke his promise easily.<br/><br/>Zhu Yansheng, on the other hand, couldn't help but feel a bit ashamed.<br/><br/>How had his clan reached the point where they needed to ask his wife's family for help?<br/><br/>As her husband, he would obviously want to be the one to protect his wife, not the other way around.<br/><br/>Feng Junxia, on the other hand, didn't think much of it. The Zhu Clan's request wasn't a big deal to her anyway.<br/><br/>They just wanted her to invite Feng Chen to attend their clan leader's birthday to leverage the Feng Clan's influence in curbing the Wu Clan's growing power.<br/><br/>She knew the situation of the Zhu Clan and wasn't reluctant to do it.<br/><br/>(But to think Chen'er would become Three Elements Divine Realm Cultivators and win the first place in Eastern Gathering.)<br/><br/>Feng Junxia thought and remembered the day when Feng Chen's parents were still around and Feng Chen was still a brat.<br/><br/>At the time, Feng Chen was an unruly boy who acted unpredictably and did his own things at his own pace.<br/><br/>If he was asked to cultivate, he would be out there wandering in the streets and even disappear from the Clan for a couple of days.<br/><br/>But the Clan never punished him severely no matter what. Not because his father was the clan leader but because he was a genius.<br/><br/>His Cultivation speed was something that was unrivaled and even without much effort, no one in the clan could catch up to his cultivation.<br/><br/>Although he did whatever he felt like, he treated everyone the same and also helped those who were having trouble which earned the respect of many including the elders.<br/><br/>Because of that, most elders couldn't bring themselves to punish him for actions that caused no real harm and would even intervene to shield him from his parents' attempts to impose harsher punishment.<br/><br/>Even her father seemed to love Feng Chen more than her, who was his own daughter.<br/><br/>Feng Chen, whom she had always seen as an arrogant and privileged individual, seemed destined to become the Clan Leader due to his lineage.<br/><br/>She once harbored resentment toward Feng Chen because of it.<br/><br/>She wasn't alone in this sentiment; others from her generation and older also viewed him as a lazy yet fortunate individual who didn't truly deserve the privileges he enjoyed.<br/><br/>However, one incident changed their mind about Feng Chen.<br/><br/>They had gone to take an exam for one of the sects but none had passed and returned with disappointment.<br/><br/>Feng Chen had accompanied them, not to participate-he was still too young for such trials- but simply to explore the area and satisfy his curiosity.<br/><br/>Frustrated by their own failure, they couldn't help but redirect their anger toward Feng Chen, who seemed carefree and cheerful, enjoying the journey while they wallowed in their failure.<br/><br/>Who could have expected that they would be ambushed by a group of ruthless bandits when returning?<br/><br/>The attackers were merciless, targeting not the clan's resources but its clan members. Perhaps they were assassins hired by rival clans; regardless, they were posing as bandits, and their target was clearly the children.<br/><br/>In the chaos, most of the guards were overwhelmed, and panic spread among the younger members of the clan.<br/><br/>Feng Junxia, who was among the group, had been frozen in fear as the bandits closed in on<br/><br/>her.<br/><br/>To everyone's shock, it was Feng Chen, the youngest person present, who stepped forward without hesitation.<br/><br/>He shielded his fellow clan members, drawing his sword and using the clan's Light Sword Technique.<br/><br/>His mastery of the technique was astonishing.<br/><br/>The elegant, radiant sword arcs carved through the bandits with precision, and even when he faced the leader of the bandits-a Core Formation Stage cultivator-Feng Chen didn't falter. The clash was intense, but Feng Chen's sheer will and unexpected display of his Core Formation Stage cultivation turned the tide.<br/><br/>Though heavily injured by the end of the fight, he had ensured the safety of everyone else, driving the bandits away.<br/><br/>From that moment on, her perception of Feng Chen changed from that of an arrogant and blessed genius to that of someone who was willing to sacrifice his life to protect others.<br/><br/>Everyone present during that incident realized, this was Feng Chen, who is destined to be their future Clan Leader.<br/><br/>After that incident, Feng Junxia also started to open up to Feng Chen and began following him around, often having to rein him in when he went out of control.<br/><br/>His performance at the Annual Genius Competition in Misty Vale City also cemented his reputation as the number one genius.<br/><br/>No one from their generation has ever thought of competing with Feng Chen for his position of Clan Leader.<br/><br/>No one could compete with him in fame, talent, or personality, and no one even thought that anyone other than Feng Chen deserved to be the Feng Clan Leader.<br/><br/>But who could have guessed that responsibility would come to Feng Chen faster than they<br/><br/>expected?<br/><br/>His parents disappeared leaving the Feng Clan in the hands of Feng Chen at age 20.<br/><br/>Feng Chen underwent a complete change, embracing his responsibilities and entirely discarding his playful nature.<br/><br/>Feng Junxia was with him during that period and supported him as much as possible before<br/><br/>she got married.<br/><br/>Now, that same Feng Chen has made a name for himself and is considered one of the<br/><br/>strongest cultivators in the Eastern Region.<br/><br/>Also the first-ever Three Elements Divine Realm cultivator of Feng Clan.<br/><br/>She couldn't be happier than when she received that news though she was also worried about Mystic Flame Sect and Spirit Wind Palace, whom Feng Chen had offended.<br/><br/>She was even thinking about returning to the Feng Clan when she heard about the trouble that<br/><br/>they were going through after the Feng Yun engagement was canceled.<br/><br/>But her father has explained to her that there was no need and that they could handle it.<br/><br/>Now, thinking about it, she couldn't help but smile.<br/><br/>Indeed, there was no need for her to worry because Feng Chen was in the Three Elements<br/><br/>Divine Realm.<br/><br/>Just when she was immersed in thinking about the past, one of the servants hurriedly<br/><br/>approached her.<br/><br/>\"Lady Junxia, please come with me,\" the servant urged, breathless.<br/><br/>Feng Junxia looked up, surprised by the urgency in the servant's tone.<br/><br/>\"What's happening?\"<br/><br/>Zhu Yansheng asked, his brow furrowing with concern.<br/><br/>The servant's eyes darted toward him briefly before answering.<br/><br/>\"It seems the Feng Clan has arrived. Clan Leader Feng Chen, along with his entourage, has<br/><br/>entered the estate.\"<br/><br/>(Finally!)<br/><br/>Feng Junxia thought.<br/><br/>\"I'll go with you.\"<br/><br/>She said, her voice calm but her thoughts swirling with anticipation.<br/><br/>She hadn't seen Feng Chen for many years and wanted to see just how much he had changed.<br/><br/>\"Yansheng, come with me.\"<br/><br/>Zhu Yansheng hesitated for a moment before nodding.<br/><br/>\"Alright, let's go!\"<br/><br/>He knew the only reason why the Feng Clan Leader had come was because of his wife and he,<br/><br/>as her husband, couldn't avoid meeting with the esteemed Feng Clan Leader.<br/><br/>But how could he not be nervous?<br/><br/>Feng Clan Leader's reputation was no longer the same as when he married Feng Junxia.<br/><br/>His name is well-known throughout the Azure Sky Empire and someone who dares to openly<br/><br/>go against Mystic Flame Sect and Spirit Wind Palace.<br/><br/>It is even rumored that he turned down an offer to work for the Third Prince, a clear demonstration of his power.<br/><br/>And their recent victory at the Eastern Gathering is enough to show that they were the number<br/><br/>one clan of the Eastern Region that defeated the likes of Tianlong Clan and Yuan Clan.<br/><br/>Sigh! Sёarch* The nôvel_Fire.ηet website on Google to access chapters of novels early and in the highest quality.<br/><br/>\"I hope I don't upset them!\"\t\t\t\t\t\t</div>", "images": {}, "success": true}