{"id": 132, "url": "https://www.novelhall.com/my-brothers-the-protagonist-good-thing-i-awakened-my-system-33973/15185585.html", "title": "Chapter 138 Feng Chen Comes To The Zhu Clan", "volume": 2, "volume_title": "Volume 2", "body": "<h1>Chapter 138 Feng Chen Comes To The Zhu Clan</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\t Chapter 138  Feng Chen Comes To The Zhu Clan Feng Chen along with his group has arrived at Xianlong City. <br/><br/>The Xianlong City could be considered an average-sized city and the Zhu Clan's estate wasn't that big either. <br/><br/>Feng Chen walked calmly toward the Zhu Mansion, followed by four people, one of which was Elder Wei. <br/><br/>Since many were in seclusion or either busy, Feng Chen didn't think it was necessary to bring more people. <br/><br/>In any case, his presence should be more than enough to give face to the Zhu Clan. <br/><br/>\"Clan Leader Feng Chen, the Zhu Clan welcomes you!\" The head guard declared, his voice slightly shaky despite his best efforts. They were already informed of all the important guests, especially the Feng Clan whom they had to show utmost respect to. <br/><br/>However, how could he not be nervous when greeting such a powerful man whose fame has spread throughout the Azure Sky Empire? <br/><br/>If he displeased him, he would vanish without ever knowing how. <br/><br/>Even Mystic Flame Sect or Spirit Wind Palace elders died at his hand, so who was he?  Searᴄh the ηovelFire.ηet website on Google to access chapters of novels early and in the highest quality.<br/><br/>So, he tried his best to not appear disrespectful and greeted Feng Chen. <br/><br/>Feng Chen gave a curt nod, his sharp eyes sweeping over the estate. He couldn't see Feng Jinxiu and guessed that she must be in a different place. <br/><br/>The Zhu Clan courtyard buzzed with activity as the servants rushed to prepare for the Feng Clan's arrival. Whispers spread like wildfire among the servants, and they knew that they had prepared everything well as instructed by their Clan leader. <br/><br/>A loud announcement interrupted the conversations of the gathered guest who still had no idea that Feng Chen had arrived. \"Announcing the arrival of the Feng Clan Leader, Feng Chen, and his esteemed entourage!\" The words carried across the courtyard like a thunderclap. The guests froze, their cups suspended in mid-air, and their whispered conversations abruptly ceased. \"Feng Clan? The Feng Clan Leader himself?\" One guest murmured, disbelief evident in their tone. Feng Clan's fame wasn't the same as before and many clans knew about it, especially those residing in the Eastern Region. <br/><br/>\"Feng Chen is here?\" Another guest whispered, their voice quivering. \"Could it be that the Zhu Clan has found their backer? And it is the Feng Clan?\" <br/><br/>… <br/><br/>All eyes turned toward the main gate, where a group of figures strode into view. Feng Chen walked at the head, his presence commanding yet calm. Behind him followed Elder Wei and three others, their expressions casual and confident. <br/><br/>As the Feng Clan entered the courtyard, gasps echoed among the Zhu Clan's guests. \"That's him? He looks so young!\" \"He's so young... Is he really the most powerful man in the Eastern Region?\" \"I heard he's already in the Peak Three Elements Divine Realm!\" <br/><br/>\"So handsome!\" <br/><br/>… <br/><br/>Guests couldn't help but question whether the man before them was truly the Feng Chen of the rumors. <br/><br/>After all, the rumors depicted Feng Chen as a merciless figure who wouldn't hesitate to punish even the elders of Spirit Wind Palace or Mystic Flame Sect if they dared to offend him. <br/><br/>Yet, looking at the young and handsome man before them, it was hard to reconcile such rumors with his appearance. <br/><br/>Of course, there was the fact that not many of them had ever seen him before and other than rumors, there really wasn't anything that they knew about Feng Clan. <br/><br/>\"Why would someone like him come here?\" Speculation and disbelief churned among the guests. <br/><br/>Meanwhile, at the far end of the courtyard, Wu Zhen's expression darkened. \"The Feng Clan…\" He muttered under his breath, his confident demeanor wavering for the first time that evening. The allies of the Wu Clan exchanged nervous glances, their initial smugness evaporating. They hadn't expected Zhu Shangxian to secure the presence of someone as powerful as Feng Chen. As of now, there is still no confirmation about their relationship, but just the presence of the Feng Clan Leader could spell trouble for them. <br/><br/>Zhu Shangxian, standing near the center of the gathering, couldn't help but smile when Feng Chen arrived. <br/><br/>( Haha... Look! Do you think only you can have a backer? We, the Zhu Clan, have connections with the strongest clan in the Eastern Region! ) <br/><br/>Zhu Shangxian couldn't help but think as his earlier worries all began to disappear. <br/><br/>He straightened his posture and composed himself quickly. He strode forward with measured steps, his heart racing with both excitement and relief. When he reached Feng Chen, he greeted him with a respectful bow. \"Clan Leader Feng, it is an honor to welcome you to our humble estate!\" Zhu Shangxian said, his voice steady but tinged with genuine reverence. Feng Chen inclined his head slightly, his sharp gaze assessing Zhu Shangxian. \"I appreciate the invitation.\" Feng Chen replied calmly. His voice carried an authority that silenced the murmurs around him. Zhu Shangxian's heart swelled with pride as the guests watched in stunned silence. This was the prestige of the Feng Clan! <br/><br/>\"The Zhu Clan is fortunate to host such an esteemed figure.\" He said, his words aimed as much at Feng Chen as at the rest of the audience. Feng Chen's arrival alone had already shifted the power dynamics of the evening. Wu Zhen clenched his fists, his jaw tightening as he watched Zhu Shangxian bask in the newfound prestige brought by Feng Chen's presence. The guests, meanwhile, began to reevaluate their opinions of the Zhu Clan. Many who had previously aligned themselves with the Wu Clan found themselves questioning their loyalties. After all, while the Third Prince's influence was great in the Eastern Region, it wasn't as great as the Feng Clan. <br/><br/>As Zhu Shangxian led Feng Chen toward the main hall, the murmurs among the crowd resumed, but this time they were filled with awe and speculation. Feng Chen's reputation as a peerless genius and his bold defiance of powerful sects like the Mystic Flame Sect and Spirit Wind Palace had made him a figure of both respect and fear. For the Zhu Clan, his presence was nothing short of a miracle, one that might just tip the scales in their favor. <br/><br/>Feng Chen didn't wait any longer and directly asked what he wanted. <br/><br/>\"Zhu Clan Leader, do you know where cousin Junxia is?\" <br/><br/>Feng Chen asked. After all, he had come to the Zhu Clan to see his cousin, and such a request couldn't be considered out of line, especially since he had done the favor of attending the birthday celebration. <br/><br/>\"Of course, Clan Leader Feng, I will inform her of your arrival.\" <br/><br/>Without wasting another moment, he turned to one of the nearby servants who had been standing at attention. <br/><br/>\"Go to the main courtyard and find Lady Junxia. Say that the Feng Clan Leader has arrived and wants to see her.\" <br/><br/>\"Yes, Clan Leader!\" The servant bowed deeply before swiftly leaving to carry out the task. <br/><br/>Zhu Shangxian then proceeded to take Feng Chen and the others to the seats he had specially prepared for them. <br/><br/>He was both surprised and pleased to find that Feng Chen wasn't as overbearing as he had imagined and spoke to him with respect. <br/><br/>His admiration for Feng Chen grew, and he couldn't have been more grateful for the face Feng Chen had given him.\t\t\t\t\t\t</div>", "images": {}, "success": true}