{"id": 130, "url": "https://www.novelhall.com/my-brothers-the-protagonist-good-thing-i-awakened-my-system-33973/15178536.html", "title": "Chapter 136: Zhu Shangxian'S Birthday Party", "volume": 2, "volume_title": "Volume 2", "body": "<h1>Chapter 136: Zhu Shangxian'S Birthday Party</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\t Chapter 136: Zhu Shangxian's Birthday Party\"Zhu Clan...\"<br/><br/>The Zhu Clan is one of the strongest clans in Xianlong City and had strength similar to that of the Feng Clan before their rise.<br/><br/>Their strongest is in the Peak Grand Qi Condensation Realm who is the current clan leader of the Zhu Clan.<br/><br/>Looking at their strength, their invitation would not be worth looking into, especially for the current Feng Clan.<br/><br/>However, it was the connection between Feng Chen and the Zhu Clan that made it important for Elder Wei to inform Feng Chen.<br/><br/>\"I don't know how Sister Jinxiu is doing.\"<br/><br/>Sister Jinxiu is Feng Chen's older cousin who used to be quite close with him but had moved to Zhu Clan after getting married.<br/><br/>Feng Chen didn't have any sister of his own but he never felt there was a need for another since there was Feng Jinxiu.<br/><br/>\"I received a letter last month saying that she is doing well.\"<br/><br/>Elder Wei answered.<br/><br/>Elder Wei is the father of Feng Jinxiu and the in-laws of Zhu Clan.<br/><br/>Though he was Feng Jinxiu's father, his reason for informing Feng Chen was not due to their familial connection.<br/><br/>Even if he was Jinxiu's father, he wouldn't have told Feng Chen even if he had been asked by his daughter if he didn't think it had anything to do with Feng Chen.<br/><br/>It is only because he knows how much Feng Chen values family relationships and is close to his daughter that he brings this up.<br/><br/>Feng Chen nodded.<br/><br/>He investigated the Zhu Clan and knew that they were good people and treated Feng Jinxiu properly.<br/><br/>Otherwise, Feng Chen would have already rooted out the Zhu Clan if it were otherwise.<br/><br/>\"But they didn't invite you previously. Maybe the Zhu Clan is facing some problems or they want to make use of the current Feng Clan reputation.\"<br/><br/>Elder Wei said honestly.<br/><br/>\"Hmmm...<br/><br/>Feng Chen thought for a moment.<br/><br/>Elder Wei was invited to some of the Zhu Clan's events since he was the father of Jinxiu but not him.<br/><br/>Maybe it is indeed because of their rising fame or they need help like Elder Wei said.<br/><br/>In any case, Feng Chen decided to attend.<br/><br/>After all, it had indeed been many years since he last saw Feng Jinxiu, and if the Zhu Clan were in trouble, Jinxiu should also be affected.<br/><br/>If Feng Jinxiu was in trouble, he couldn't turn a blind eye to it.<br/><br/>\"Accept the invitation. Anyway, I don't have anything else to do. When is Zhu Clan Leader's birthday?'<br/><br/>Feng Chen asked.<br/><br/>\"In 10 days from now on!\"<br/><br/>\"Okay then! Prepare a gift for the Zhu Clan.\"<br/><br/>***<br/><br/>The Zhu Clan's birthday celebration was a grand spectacle, befitting one of the most powerful clans in Xianlong City.<br/><br/>Guests arrived in elegant robes, the influential families from across the city, as well as traders, scholars, and dignitaries who had all been invited to witness the event.<br/><br/>The courtyard was filled with intricate decorations-silk banners of gold and red, plush rugs that lined the paths, and tables laden with the finest food and drink.<br/><br/>The birthday celebrant, Zhu Shangxian, stood near the center of the gathering, surrounded by his closest family and friends.<br/><br/>As the patriarch of the Zhu Clan, he was the focal point of the evening, his presence both commanding and regal.<br/><br/>His laughter rang out occasionally, but his eyes held a glint of something more serious, something that only a few of the more observant guests would catch.<br/><br/>They knew that Zhu Clan was in decline and that their competitor had been stealing their business for the past few months, making Zhu Clan's market share lower and lower.<br/><br/>The guests continued to mingle, exchanging pleasantries, but many were aware of the delicate position the Zhu Clan found themselves in.<br/><br/>Despite the lavish decorations and fine food, there was a growing sense that the prosperity of the past was slipping away, and the signs of decline were becoming more evident.<br/><br/>The soft murmur of conversation faltered as the heavy sound of footsteps approached the entrance.<br/><br/>A small delegation entered the courtyard, dressed in robes of dark green and gold. Their presence caused a stir, as the newcomers were from the rival Wu Clan, one of Zhu Clan's competitors in the Xianlong City.<br/><br/>The Wu Clan had been encroaching on Zhu Clan's territory for months now, slowly stealing their market share, and leaving the once mighty Zhu Clan struggling to maintain its<br/><br/>dominance.<br/><br/>The reason why Wu Clan has suddenly gained the upper hand is because of getting support from the Third Prince.<br/><br/>Many who knew the backing of the Wu Clan decided to stop cooperating with the Zhu Clan in<br/><br/>fear of the Third Prince and joined hands with the Wu Clan.<br/><br/>The Zhu Clan couldn't do anything but curse in their hearts.<br/><br/>Who could have expected that Wu Clan would be favored by one of the princes?<br/><br/>Going against the Third Prince is something that they can only dream of and know that they have no chance against the Wu Clan by themselves.<br/><br/>At the front of the group stood Wu Zhen, the ambitious leader of the Wu Clan.<br/><br/>He had a sharp gaze and a smile that could disarm most, though those who knew him could see the hidden malice in his eyes.<br/><br/>As he approached, his voice carried across the courtyard, cutting through the hum of conversation.<br/><br/>\"Ah, Zhu Shangxian! How time flies... another year, another birthday to celebrate.<br/><br/>Congratulations!\"<br/><br/>Wu Zhen's words were smooth, laced with a hint of mockery that only those with a keen ear<br/><br/>could detect.<br/><br/>Zhu Shangxian's smile remained on his face, though the glint of tension in his eyes betrayed<br/><br/>his irritation.<br/><br/>He stepped forward to greet Wu Zhen, his voice steady but cold.<br/><br/>\"Thank you, Wu Zhen. It is always a pleasure to have you at our celebration. Your presence is<br/><br/>greatly appreciated.\"<br/><br/>Zhu Shangxian replied, his words polite.<br/><br/>Wu Zhen's smile widened.<br/><br/>\"Looks like the Zhu Clan is doing well, despite the recent struggles in the market. How about considering a change? Maybe joining my Wu Clan-working under us might keep you from<br/><br/>going bankrupt.\"<br/><br/>Zhu Shangxian's grip on his cup tightened, but his expression remained calm.<br/><br/>\"The market may be tough, Wu Zhen, but the Zhu Clan is still standing strong,\" he replied.<br/><br/>\"We've faced challenges before and come out on top.\"<br/><br/>Wu Zhen chuckled, his voice cold.<br/><br/>\"Of course. I hope that you recover this time as well.\"<br/><br/>With that, Wu Zhen turned away, his words hanging in the air like a challenge.<br/><br/>His delegation followed him, and they made their way to the side of the courtyard, where the<br/><br/>guests from the Wu Clan began to mingle with others.<br/><br/>There were many willing to kiss Wu Clan's A**.<br/><br/>\"Damn this Wu Zhen. How dare he act so presumptuously in our estate!\"<br/><br/>Zhu Jiyang, the son of Zhu Shangxian said angrily.<br/><br/>\"... We couldn't do anything. They have the backing of the Third Prince.\"<br/><br/>Zhu Shangxian replied weakly. Sёarᴄh the NôvelFire.nёt website on Google to access chapters of novels early and in the highest quality.<br/><br/>\"Damn...\"<br/><br/>Zhu Jiyang's voice was full of frustration as he paced in circles. The Zhu Clan's position was precarious, and Wu Zhen's mocking tone was a reminder of how vulnerable they had become. Zhu Shangxian also knew that the atmosphere had shifted and that the birthday party to<br/><br/>increase their influence was having the opposite effect.<br/><br/>Turning to one of the servants nearby, he called out sharply.<br/><br/>\"Go find Zhu Yansheng. Tell him I need to speak with him.\"<br/><br/>The servant bowed and quickly departed, weaving through the crowd.<br/><br/>Moments later, Zhu Yansheng appeared, his presence calm and composed despite the<br/><br/>atmosphere surrounding him.<br/><br/>He approached Zhu Shangxian, bowing slightly in respect.<br/><br/>\"You called for me, Clan Leader?\"<br/><br/>Zhu Yansheng asked.<br/><br/>Zhu Shangxian nodded, his voice steady but low.<br/><br/>\"Yes, I need to know when the Feng Clan Leader will be arriving?\"<br/><br/>Zhu Yansheng paused for a moment, considering the question.<br/><br/>\"I do not have a confirmed time yet, Clan Leader, but they should arrive soon. They did give<br/><br/>their word to Jinxiu that they would attend.\"<br/><br/>\"Good!\"<br/><br/>Zhu Shangxian replied, his gaze sharp.<br/><br/>\"If the esteemed Feng Clan Leader comes, perhaps the fate of our clan will have a chance to<br/><br/>change.\"\t\t\t\t\t\t</div>", "images": {}, "success": true}