{"id": 139, "url": "https://www.novelhall.com/my-brothers-the-protagonist-good-thing-i-awakened-my-system-33973/15221357.html", "title": "Chapter 145 Feng Yun Doing His Protagonist Thing", "volume": 2, "volume_title": "Volume 2", "body": "<h1>Chapter 145 Feng Yun Doing His Protagonist Thing</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\t Chapter 145  Feng Yun Doing His Protagonist Thing The celebration of Feng Zhenshan's breakthrough was nothing short of magnificent. <br/><br/>The Feng Clan spared no expense, and the event easily overshadowed Feng Chen's 30th birthday celebration, which now seemed like a modest gathering in comparison. <br/><br/>It was a clear statement: the Feng Clan was no longer what it used to be. <br/><br/>The grandeur of the celebration also served another purpose—to display the current power and influence of the Feng Clan. <br/><br/>Cultivators of all levels, from various clans and sects, attended the event, their faces filled with admiration, envy, and awe. <br/><br/>This included the Yuan Clan and Yunhai Clan, considered among the top three strongest clans alongside the Feng Clan in the Eastern Region. <br/><br/>Their attendance caused quite a commotion. <br/><br/>Who could have imagined that the leaders of the Yuan and Yunhai Clans would personally attend the celebration of their competitor? <br/><br/>Their behavior during the event led many to speculate about a potential alliance among the three clans. <br/><br/>Adding to these speculations were the lavish gifts they brought, which only reinforced the belief that some deeper connection existed between the clans. <br/><br/>Moreover, two elders were sent by the Icy Veil Sect to attend the celebration. <br/><br/>Although many were disappointed that it was not the famous Ice Beauty, it was an eye-opener indeed. <br/><br/>Who could have thought that an elder from the Icy Veil Sect would attend the Feng Clan's celebration? This clearly shows that they favor the Feng Clan and have a strong relationship. <br/><br/>The Zhu Clan also attended, represented by Zhu Shangxian, who had recently ascended to the Three Elements Divine Realm as well. <br/><br/>Zhu Shangxian's breakthrough took place during Feng Chen's period of seclusion, and Elder Wei deemed it unnecessary to disturb him at the time. Instead, Elder Wei had attended the Zhu Clan's celebration on behalf of the Feng Clan to offer congratulations. <br/><br/>One could gauge the growing influence of the Feng Clan simply by observing the caliber of their guests. <br/><br/>In the past, encountering even one cultivator at the Three Elements Divine Realm in Misty Vale City was a rarity. However, for this celebration, many clans whose leaders had reached this esteemed realm had arrived in droves. <br/><br/>After the festivities, Feng Chen did not return to his cultivation immediately. <br/><br/>Instead, he reviewed the report prepared by Elder Wei and personally spent time mentoring the younger generation of the clan. <br/><br/>He could only say that the increased resources of the Feng Clan was showing its effect and the Clan Members were advancing at a rapid rate, unimaginable one year ago. <br/><br/>Feng Liang and Feng Jianhong were especially growing much more than others with both of them already having reached the Top Core Formation Stage. It seem like they could be qualified to participate in the Phoenix and Dragon Compeition where Ling Meiyu and Feng Yun has pormised to fight. <br/><br/>It was during this period that he received updates on Feng Yun, Feng Mei, and Feng Xiaoyu. <br/><br/>While Feng Mei and Feng Xiaoyu had been quietly cultivating at the Icy Veil Sect, Feng Yun was a different story altogether. <br/><br/>Feng Yun's name was spreading like wildfire across the Azure Sky Empire, and the tales of his exploits seemed to grow more fantastical with every rumor. <br/><br/>One of the most prominent stories revolved around the downfall of the Crimson Fang Bandits, a notorious group of marauders who had terrorized the western regions for years. <br/><br/>Led by a rogue cultivator at the peak of the Core Formation Stage, their infamy stemmed from countless raids, massacres, and merciless atrocities. <br/><br/>Recently, word had spread that the bandits had set their sights on a young cultivator traveling through their territory—none other than Feng Yun. <br/><br/>However, there was no news of Feng Yun being captured, and the bandit group seemed to vanish without a trace. <br/><br/>No sightings or reports of their movements emerged, and it wasn't until an investigation was sent to track down the bandits that their bodies were discovered—charred beyond recognition. <br/><br/>It didn't take long for those familiar with the Crimson Fang Bandits' plans to deduce that the one who eradicated them was the very person they had targeted—Feng Yun. <br/><br/>Additionally, who didn't know that Feng Yun possessed Spirit Flame (a Mythical Flame but believed to be Spirit Flame ) after the Eastern Gathering? <br/><br/>This evidence was enough for people to guess that the one to destroy the Crimson Flame gang was Feng Yun. <br/><br/>Another news that Feng Chen heard involved Feng Yun slaying a Rank 4 monster that had been terrorizing a village near the capital. <br/><br/>The creature, known as the Shadowclaw Ape, was not only immensely powerful but also remarkably intelligent. <br/><br/>Unlike most Rank 4 monsters that relied solely on brute strength, the Shadowclaw Ape had an uncanny sense of danger and strategy. <br/><br/>Whenever a powerful cultivator, especially one in the Grand Qi Condensation Realm or higher, approached, the ape would disappear into the dense forest, blending seamlessly with the shadows. <br/><br/>If a group of hunters or adventurers tried to track it, the creature would wait patiently, only reappearing once its would-be attackers had dispersed. <br/><br/>The ape preyed on weaker travelers and villagers, making it a constant threat to those living near the area. <br/><br/>For months, numerous cultivators and mercenaries attempted to slay the Shadowclaw Ape, but all had failed. <br/><br/>Its cunning and caution proved to be its undoing when it underestimated Feng Yun. <br/><br/>Traveling alone and only at the Core Formation Stage, Feng Yun appeared to the creature as yet another easy target. <br/><br/>Despite villagers warning him not to confront the beast, Feng Yun was confident in his abilities and set out to face it. <br/><br/>To everyone's amazement, Feng Yun returned victorious, carrying the slain ape's body. <br/><br/>His actions brought peace to the villages and earned him the admiration of the villagers, who hailed him as a hero. Word of this feat spread like wildfire across the empire. <br/><br/>Feng Chen couldn't help but smile as he listened to these rumors. <br/><br/>\"It seems Yun'er is indeed like a protagonist,\" he mused. <br/><br/>Feng Chen thought that Feng Yun was indeed a protagonist listening to such rumors. Feng Yun was like a magnet for trouble although Feng Chen wasn't blaming Feng Yun for what had happened. Just that protagonist seemed to be a synonym for a person who always attracts trouble, though in return they do get a lot. On the other hand, Feng Chen thought about his own destruction of the Bandit group in the Stormhowl Valley which has gone unnoticed. Feng Chen didn't really care about the fame but compared how Feng Yun seemed to be in the limelight every time he did something. ( This could be considered a training phase for the protagonist! ) Feng Chen thought after listening to news related to Feng Yun. <br/><br/> Sёarᴄh the novel(F~)ire.net website on Google to access chapters of novels early and in the highest quality. \t\t\t\t\t\t</div>", "images": {}, "success": true}