{"id": 133, "url": "https://www.novelhall.com/my-brothers-the-protagonist-good-thing-i-awakened-my-system-33973/15185586.html", "title": "Chapter 139 Reunion With Feng Junxia", "volume": 2, "volume_title": "Volume 2", "body": "<h1>Chapter 139 Reunion With Feng Junxia</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\t Chapter 139  Reunion With Feng Junxia As Zhu Shangxian guided Feng Chen and his entourage to their seats, the atmosphere in the hall remained tense, charged with a mixture of awe and curiosity. <br/><br/>The guests, still reeling from the unexpected presence of such a powerful figure, couldn't help but steal glances at the Feng Clan Leader. <br/><br/>The seats Zhu Shangxian had prepared were at the central table, elevated slightly above the rest to signify Feng Clan's prestige. <br/><br/>As everyone settled down, Zhu Shangxian instructed the servants to serve the finest tea and delicacies. <br/><br/>Meanwhile, Zhu Yansheng walked with nervousness, while Feng Junxia strode with excitement toward the courtyard. <br/><br/>The moment they arrived at the courtyard, Feng Chen's sharp gaze locked onto them. <br/><br/>\"Junxia!\" Feng Chen called a faint smile tugging at his lips. \"Chen'er!\" She replied, her voice warm despite her surprise. <br/><br/>She looked at Feng Chen, whose appearance was similar to before, perhaps even a bit more handsome than when she left the clan. <br/><br/>However, from how the other guests and even the Zhu Clan members appeared before Feng Chen, she could see that he was no longer the unruly genius of the Feng Clan but someone who was respected throughout the Eastern Region. <br/><br/>Feng Junxia felt a strange mix of pride and awe. <br/><br/>This was the cousin she had once followed around, the same one who had once been reckless and carefree. <br/><br/>Now, he stood as one of the most powerful cultivators in the region, his reputation as a Three Elements Divine Realm cultivator preceding him. <br/><br/>The gathered guests watched in astonishment as Feng Chen, the legendary Clan Leader whose very name inspired awe, addressed someone from the Zhu Clan with familiarity and genuine affection. <br/><br/>Only then did they understand why Feng Chen was there. <br/><br/>\"Damn! Who would have thought the Zhu Clan would have ties to someone from the Feng Clan?\" <br/><br/>\"No wonder the esteemed Feng Leader came in person—it's because one of their members is married into the Zhu Clan.\" <br/><br/>\"Judging by their interaction, it's clear the Feng Clan Leader has a very close relationship with her.\" <br/><br/>\"It seems an alliance between the Feng Clan and the Zhu Clan is only a matter of time.\" <br/><br/>… <br/><br/>\"Junxia, it's been a long time.\" <br/><br/>Feng Chen said, his voice filled with warmth. <br/><br/>Feng Junxia returned his gaze, her heart swelling with the memories of their shared past. <br/><br/>\"Indeed, it's been too long, Chen'er. I'm glad you could make it!\" <br/><br/>She replied, her voice steady despite the surge of emotions within her. <br/><br/>Feng Chen's smile widened slightly as he stepped closer to her. <br/><br/>\"I couldn't refuse my cousin's request after all!\" <br/><br/>His words, simple yet full of meaning, were a reminder to others of his relationship with her. <br/><br/>This phrase could be considered a subtle warning that anyone who dared harm her would have to face his wrath. <br/><br/>Of course, knowing Junxia was Feng Chen's cousin, there would be less than 1 percent of people in the Azure Sky Empire who would dare harm her. <br/><br/>\"I appreciate it.\" <br/><br/>Feng Junxia replied. <br/><br/>Feng Junxia knew what kind of person Feng Chen was, but people changed, and she thought that with his new profound power and fame, he might have also changed. <br/><br/>But upon meeting him again, those doubts instantly disappeared. <br/><br/>Feng Chen was still the same person she knew—caring and steadfast, with an unwavering sense of responsibility toward those he considered family. <br/><br/>Feng Chen's eyes flicked to Zhu Yansheng for a brief moment. <br/><br/>Zhu Yansheng immediately stepped forward, bowing deeply. <br/><br/>\"C-Clan Leader Feng, it is an honor to meet you again.\" <br/><br/>Feng Chen's gaze remained steady, and after a moment, a faint smile curved his lips. <br/><br/>\"You are Junxia's husband. There's no need to be so formal. We're family!\" <br/><br/>Zhu Yansheng straightened, though his posture still held traces of nervousness. <br/><br/>\"Thank you, Clan Leader Feng. I... I'll do my best to take care of Junxia.\" <br/><br/>Feng Chen nodded slightly, his sharp gaze softening just a fraction. <br/><br/>\"I trust you will. She deserves nothing less.\" <br/><br/>After that, they took their seats at the table and continued their conversation. <br/><br/>Feng Junxia gracefully took her place beside Feng Chen at the central table along with her husband. <br/><br/>Elder Wei sat on Feng Chen's other side, his typically stern expression softened by the sight of his daughter and nephew together. <br/><br/>Though their reunion had drawn much attention, the atmosphere gradually eased as the Zhu Clan members busied themselves ensuring the evening proceeded smoothly. <br/><br/>Zhu Shangxian, seated at the head of the table, couldn't help but beam with satisfaction. <br/><br/>The presence of Feng Chen at his birthday celebration could be considered the greatest prestige his clan could have. <br/><br/>The Feng Clan's presence had transformed the atmosphere, drawing numerous clans and merchants eager to discuss cooperative ventures with promising benefits. <br/><br/>Even those who had previously sided with the Wu Clan approached, expressing their desire to mend ties and offering compensation for their past actions. <br/><br/>Zhu Shangxian didn't agree but also didn't decline either. <br/><br/>After all, without them, it would have been impossible for them to stop the Wu Clan from annexing their market shares, and it was unknown whether the Feng Clan would help them or not. <br/><br/>Although not eager to have those traitors back, he needed to consider the pros and cons for his clan. <br/><br/>After a bit, Zhu Shangxian decided to address the guests and officially start the banquet.\" <br/><br/>Rising from his seat, he offered a formal welcome, thanking everyone for attending his celebration.  Sёarch* The nôᴠel Fire.nёt website on Google to access chapters of novels early and in the highest quality.<br/><br/>\"I would like to thank everyone for attending my 70th birthday celebration. I would like to express my heartfelt thanks to all of you for attending, especially to the Feng Clan, whose presence here is a great honor to the Zhu Clan, one I will forever cherish.\" <br/><br/>He declared, his voice ringing with pride and gratitude. <br/><br/>CLAP! CLAP! <br/><br/>The applause that followed was genuine, though some guests clapped with lingering unease, particularly those allied with the Wu Clan. <br/><br/>After that speech, the guests began stepping forward to present their gifts to Zhu Shangxian, one after another. <br/><br/>Knowing Zhu Shangxian's newfound connection to the Feng Clan, many who had initially planned to offer subpar gifts suddenly reconsidered. <br/><br/>They hastily brought out personal treasures or valuable items, eager to impress. <br/><br/>Previously, some had not cared much about not giving face to Zhu Shangxian with mediocre offerings, but the situation had changed dramatically. <br/><br/>The one whom they thought would be destroyed by the Wu Clan had suddenly gained a powerful backer that couldn't be ignored. <br/><br/>A prominent merchant of Xianlong City was the first to step forward, presenting an elegant jade qilin statue. <br/><br/>Its surface glowed faintly with spiritual energy, a clear indication of its origin from Spirit-Jade mines. <br/><br/>Just looking at its sheer size, one could tell that it would cost a lot of money. <br/><br/>\"This jade qilin is said to bring prosperity and protection to its owner. May it bless the Zhu Clan with enduring success.\" <br/><br/>Zhu Shangxian graciously accepted the gift, offering a polite nod of thanks. <br/><br/>Next, the representative from the Shu Clan stepped forward, unveiling a pair of ceremonial swords forged from Black Flame Steel, their blades etched with intricate formations. <br/><br/>\"These swords symbolize strength and protection, qualities we hope will continue to define the Zhu Clan.\" <br/><br/>The gifts that followed were similarly extraordinary, ranging from rare spiritual herbs to powerful artifacts. <br/><br/>Every guest seemed determined to outdo the others, their earlier indifference replaced by a clear effort to curry favor with the Zhu Clan. <br/><br/>Although the Wu Clan wasn't looking to curry favor with the Zhu Clan, they didn't want to offend the Feng Clan and presented a top-notch defensive artifact of High Mortal Grade. <br/><br/>When it was the Feng Clan's turn, the room fell silent, anticipation thick in the air. <br/><br/>Elder Wei rose, his composed yet commanding presence drawing all eyes. <br/><br/>\"For Clan Leader Zhu's 70th birthday,\" Elder Wei began, \"we have prepared a Mid-Level Earth Grade Saber along with a Rank 5 Elemental Ascension Pill. Additionally, we offer several Rank-1 and Rank-2 pills for the Zhu Clan.\"\t\t\t\t\t\t</div>", "images": {}, "success": true}