{"id": 143, "url": "https://www.novelhall.com/my-brothers-the-protagonist-good-thing-i-awakened-my-system-33973/15235327.html", "title": "Chapter 149 Into The Lan Clan", "volume": 2, "volume_title": "Volume 2", "body": "<h1>Chapter 149 Into The Lan Clan</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\t Chapter 149  Into The Lan Clan The capital city stood ahead, its towering walls and grand gates an imposing sight, bustling with activity. <br/><br/>Guards stationed at the main entrance stood at attention, scanning everyone who approached. <br/><br/>Lines of travelers, merchants, and officials stretched along the roads leading into the city, their movements meticulously checked and regulated. <br/><br/>Feng Chen, however, had no intention of going through the gates as he was well aware that with Lan Clan's elders being tied up, he would be asked a lot of questions. <br/><br/>So he decided to sneak into the Capital without going through the gate. And it was night, which was perfect for Feng Chen to go over the wall without being noticed by the guards. <br/><br/>Feng Chen has already scanned the area well, and the strongest was at the Grand Qi Condensation Realm. <br/><br/>They had no chance of sensing his presence as long as he didn't want them to.  Sёarch* The Novёlƒire.n(e)t website on Google to access chapters of novels early and in the highest quality.<br/><br/>His gaze flicked to the towering walls, then to the ropes in his hands, and with a slight smirk, his body flickered like a shadow. <br/><br/>WHOOSH! <br/><br/>In an instant, Feng Chen leaped into the air, his Qi flaring briefly as he soared over the city walls with the Lan Clan elders in tow. <br/><br/>The ropes rattled, and the elders cried out in terror as they were pulled through the air, dangling helplessly like broken kites. <br/><br/>Fortunately, Feng Chen had sealed their mouths with Qi in time; otherwise, their shouting would have caused a ruckus, alerting the guards and exposing his stealth. <br/><br/>Below, the guards at the post felt a sudden rush of wind but saw nothing. <br/><br/>They looked around in confusion but didn't see anything suspicious. <br/><br/>Feng Chen landed gracefully in a secluded alley within the city. <br/><br/>He didn't dally around but directly focused on his goal. <br/><br/>\"Where is the Lan estate?\" <br/><br/>Feng Chen asked. <br/><br/>The only clan location Feng Chen knew of in the capital was the Ling Clan and the Lan Clan was just something that he heard about and had no idea where their estate was located. <br/><br/>Lan Xiang didn't want to answer, but considering his predicament, he had no choice. <br/><br/>Moreover, he also believed that as long as they could get to the Lan Clan's estate, they would be saved and that Feng Chen would die. <br/><br/>Thinking about it again, he thought that the faster Feng Chen reached the Lan Clan, the faster they would be saved from this misery. <br/><br/>\"That way!\" <br/><br/>Lan Xiang showed the direction as Feng Chen followed his direction. <br/><br/>He wasn't afraid of Lan Xiang lying because he was also well aware that Lan Xiang's misery would only deepen if he lied and led him to another place. <br/><br/>He didn't see any reason for Lan Xiang or other elders to lie either except if they enjoyed being tied together. <br/><br/>Soon, Feng Chen reached the area where the Lan Clan's estate could be seen. <br/><br/>Because it was night, there weren't many people on the road, but some did see Feng Chen dragging the Lan Clan elders. <br/><br/>With the Lan Clan being in the vicinity, it wasn't a challenge for them to know those elders of the Lan Clan. <br/><br/>They could only be stunned and double-check whether what they saw was really happening or not. <br/><br/>Feng Chen didn't really care and continued to walk towards the Lan Clan estate. <br/><br/>Feng Chen could see the sprawling estate beyond the high gates, guarded by an armored guard who immediately stiffened at the sight of him. <br/><br/>\"Halt!\" <br/><br/>One of the guards barked, his voice steady but his eyes betraying unease. <br/><br/>\"Who dares approach the Lan Clan in such—\" <br/><br/>His words faltered as he recognized the insignia on the robes of the battered figures Feng Chen dragged behind him. <br/><br/>A chill ran down his spine. <br/><br/>The moment the Lan Clan elders saw the gates of their manor, hope ignited in their despair-filled eyes. <br/><br/>\"Save us! Quickly, inform the Clan Leader!\" <br/><br/>\"We've been ambushed! Feng Chen is a madman! He's dragged us here—he's destroyed our cultivation!\" <br/><br/>\"Kill him! Call everyone and don't let him leave alive!\" <br/><br/>… <br/><br/>The Lan clan elders shouted as if they had finally found their salvation. <br/><br/>The guards were dumbfounded by the elders who were shouting and yelling for help. <br/><br/>\"Y-You… what have you done?\" <br/><br/>The guard nearest to Feng Chen asked. It is one thing to attack Lan Clan's elders and another to tie them up and bring them back to their territory like this. <br/><br/>\"I am Feng Chen, Patriarch of the Feng Clan.\" <br/><br/>Feng Chen said, which immediately alerted the guards. <br/><br/>After all, who doesn't know the conflict between their clan and the Feng Clan? <br/><br/>Additionally, Feng Chen was a powerful Three Elements Divine Realm who was much more powerful than them. <br/><br/>\"I have brought back your elders—it would be better if you led me to where your clan leader is.\" <br/><br/>His gaze sharpened, and his Qi flared slightly, pressing down on the guards and anyone nearby. <br/><br/>The guards exchanged nervous glances, unsure how to proceed. <br/><br/>However, even their esteemed elders were turned into that state, and they were smart enough to know that they couldn't mess with the person before them. <br/><br/>As for saving the elders, even if they were left in such a state, what would happen to them? <br/><br/>\"S-Sure! Please, follow me. We will immediately inform our Clan Leader.\" <br/><br/>The guard said as he led Feng Chen into their estate. <br/><br/>Inside the Lan Clan manor, chaos erupted as the news spread. <br/><br/>It was impossible for news not to spread, given that Feng Chen had openly dragged their powerful elders into the Lan Clan estate without regard for its reputation or authority. <br/><br/>Many disciples and servants were shocked at the sight of their powerful elders, who looked no better than beggars. <br/><br/>One of the guards led Feng Chen to their Main Hall while the other ran off to call their Clan Leader. <br/><br/>\"Is this really the Elders? What happened to them?\" <br/><br/>\"Weren't they chasing after Feng Yun? Did they encounter some powerful monster?\" <br/><br/>\"Why are they tied up? Could someone go and help them?\" <br/><br/>… <br/><br/>Whispers and discussions were being held by Lan descendants and servants as they watched Feng Chen drag their elders. <br/><br/>Some were furious and some wanted to help but they didn't. <br/><br/>After all, they, like the guards, wondered how they could confront someone capable of reducing their elders to such a state.\" <br/><br/>The Lan Elders couldn't help but keep their heads down in embarrassment. <br/><br/>They couldn't afford to be seen in such a state by their juniors, but it was already late and many had already gathered and recognized them. <br/><br/>They also tried to maintain their pride as elders, refraining from further humiliating themselves by shouting for help, as they had done earlier. <br/><br/>Soon, Feng Chen reached their main hall. <br/><br/>\"Please wait inside, Our Clan Leader should be arriving shortly!\" <br/><br/>The guard said as he quickly disappeared. <br/><br/>Feng Chen strode into the main hall of the Lan Clan estate, his expression calm yet brimming with cold authority. <br/><br/>Today, the Lan Clan will face a storm like no other!\t\t\t\t\t\t</div>", "images": {}, "success": true}