{"id": 141, "url": "https://www.novelhall.com/my-brothers-the-protagonist-good-thing-i-awakened-my-system-33973/15223291.html", "title": "Chapter 147 Turning Power To Waste", "volume": 2, "volume_title": "Volume 2", "body": "<h1>Chapter 147 Turning Power To Waste</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 147  Turning Power to Waste In the Feng Clan's main hall, a group of seven cultivators stood, their robes bearing the insignia of the Lan Clan. <br/><br/>Their leader, a middle-aged man with sharp features and an air of superiority, scanned the surroundings with disdain. <br/><br/>\"Hmph! So this is the home of that damn Feng Yun? He must be hiding somewhere here!\" <br/><br/>One of the elders sneered, his tone dripping with contempt. <br/><br/>They chased Feng Yun day and night but without success. Moreover, they lost sight of him recently which made them angrier and that's when they formed two groups, one of which was sent to the Feng Clan in search of Feng Yun. <br/><br/>This made the elders hate the Feng Clan as much as Feng Yun. <br/><br/>Also, as someone who lived in the capital, he looked down on those clans from the Eastern Region, dismissing it as a remote and underdeveloped backwater. <br/><br/>\"Why must we even wait for some clan leader?\" Another elder said irritably. Firstly, they were stopped by some weak guard and now they had to wait? He couldn't be more irritable. <br/><br/>\"We should just raze this place to the ground and be done with it!\" <br/><br/>Just as the words left his mouth, Feng Chen suddenly appeared without a sound, seated atop the patriarch's throne. His cold gaze swept over the group, making them stiff. It was as though they had been caught trespassing by a predator who considered them nothing more than prey. <br/><br/>The leader stepped forward, trying to hide his unease behind a haughty tone. <br/><br/>\"So, you must be Feng Chen, the current Patriarch of the Feng Clan.\" <br/><br/>Feng Chen didn't respond immediately. His icy eyes continued to assess them. <br/><br/>\"And who are you to barge into my home uninvited?\" He finally asked, his voice low and laced with menace. <br/><br/>The leader straightened his back, feigning confidence. <br/><br/>\"I am Lan Xiang, an elder of the Lan Clan. We've come on official business regarding your younger brother, Feng Yun.\" <br/><br/>At the mention of Feng Yun's name, a flicker of murderous intent flashed in Feng Chen's eyes.  seaʀᴄh thё ηovёlFire .net website on Google to access chapters of novels early and in the highest quality.<br/><br/>\"Patriarch Feng,\" Lan Xiang continued, \"your brother insulted the dignity of the Lan Clan by defeating our prodigy, Lan Jinghao using an underhanded method in public. Such an act cannot go unpunished. We suspect that Feng Clan is hiding Feng Yun and order you to hand him over!\" <br/><br/>Lan Xiang didn't really care whether the Feng Clan was hiding Feng Yun and was determined to make them suffer as much as possible. <br/><br/>\"And what if I don't comply?\" Feng Chen asked, his voice calm yet dripping with scorn. <br/><br/>Lan Xiang's expression hardened. <br/><br/>\"We demand that Feng Yun be handed over to the Lan Clan immediately to face justice. If you refuse, it will be considered an act of war against us.\" <br/><br/>The hall fell silent. Elder Wei's face darkened, and the Feng Clan guards tensed, their gazes shifting to Feng Chen, awaiting his response. <br/><br/>Elder Wei couldn't help but disdain such an arrogant act. Even if they were from the Lan Clan, this was their territory, the Feng Clan's territory. <br/><br/>And how could they casually bring up a war between the clan when it was only a fight between two younger generations. <br/><br/>\"Hahaha… \" <br/><br/>Feng Chen chuckled, a low, dangerous sound that sent a shiver through the room. <br/><br/>Lan Clan members were confused by Fen Chen's reaction which was quite different than they imagined. <br/><br/>\"Hand over Feng Yun? You must have lost your mind.\" <br/><br/>Lan Xiang glared at him. \"Do not take this lightly, Patriarch Feng. The Lan Clan will not tolerate—\" <br/><br/>Before he could finish, a blur appeared before him. Feng Chen's movement was so fast that none of the Lan Clan members could react including Lan Xiang who is in Mid Three Elements Divine Realm. <br/><br/>SLAP! <br/><br/>Lan Xiang's head snapped to the side as Feng Chen's palm connected with brutal force, sending the elder sprawling to the floor. Blood trickled from the corner of his mouth as he groaned in pain. <br/><br/>The other elders roared in outrage, launching themselves at Feng Chen. <br/><br/>\"Impudent!\" <br/><br/>\"You dare strike an elder of the Lan Clan?!\" <br/><br/>Their fury was short-lived. Feng Chen moved like a phantom, weaving through them effortlessly. <br/><br/>BANG! BOOM! PLAH! <br/><br/>One by one, the elders were struck down, each blow sending them crashing to the ground. Groans of pain echoed through the hall as their arrogance and composure shattered. <br/><br/>Feng Chen stood tall amidst the fallen cultivators, his gaze colder than ice. <br/><br/>\"I thought the Lan Clan had standards, but it seems you're no better than a pack of rabid dogs,\" he said sharply. <br/><br/>Lan Xiang struggled to rise, his face contorted with humiliation and rage. <br/><br/>\"Y-You dare humiliate the Lan Clan like this! You'll regret—\" <br/><br/>BANG! <br/><br/>Feng Chen's foot came down on Lan Xiang's chest, pinning him to the ground effortlessly. The elder gasped, choking on his words under the weight of Feng Chen's pressure. <br/><br/>\"Regret?\" Feng Chen's voice was low and merciless. \"You come into my home, injure my family, and demand I hand over my brother as if you have the power to dictate terms here? If anyone should regret their actions, it's you!\" <br/><br/>The rest of the Lan Clan group lay sprawled on the floor, trembling in fear. <br/><br/>They had heard rumors about Feng Chen and his strength, however, rumors are always exaggerated and they thought they could take on Feng Clan themselves, much less Feng Chen. <br/><br/>But who could have thought, they are the one having their A** whooped. <br/><br/>\"I haven't even begun discussing what punishment you deserve for daring to harm my brother.\" <br/><br/>Feng Chen continued coldly. \"And you dare come here demanding justice? The Lan Clan is laughably self-righteous.\" <br/><br/>One of the remaining elders tried to muster some bravado. \"Feng Clan leader, we warn you—apologize for what you've done, or else—\" <br/><br/>\"Or else what?\" Feng Chen interrupted, his icy glare freezing the elder in place. \"Still haven't learned your lesson?\" <br/><br/>He moved again, delivering another round of humiliation. The Lan Clan cultivators were left groaning on the floor, their spirits crushed. <br/><br/>Elder Wei, observing the scene, couldn't help but shake his head. He wasn't even surprised by the outcome. After all, Feng Chen had faced stronger groups in the past and crushed them just as effortlessly. <br/><br/>\"These fools didn't stand a chance.\" Elder Wei muttered to himself, noting that only two of the seven were in the Three Elements Divine Realm, while the others were merely in the Grand Qi Condensation Realm. <br/><br/>It was as though they had come to their own execution. <br/><br/>\"Bring in those guards that these fools have injured.\" At his command, Feng Clan guards entered the hall. Though their injuries had not fully healed, the healing pills provided by the clan's alchemist had managed to restore their ability to move. <br/><br/>The guards' eyes burned with satisfaction as they beheld the pitiful state of the Lan Clan elders. These intruders, who had so arrogantly attacked them, now lay sprawled on the floor like broken marionettes. <br/><br/>This is Karma! <br/><br/>\"You dared to harm my clan,\" Feng Chen said, his voice low and menacing, \"and today, you will know the consequence for it.\" <br/><br/>Lan Xiang, still pinned under Feng Chen's foot, glared up at him, spitting blood. <br/><br/>\"You... You can't do this. The Lan Clan will—\" <br/><br/>\"Will what?\" Feng Chen interrupted, his tone icy. \"Send more of your trash here to be humiliated? Don't waste your breath. After dealing with you all, I will go after the Lan Clan myself!\" <br/><br/>Feng Chen lifted his hand, and a powerful wave of spiritual energy erupted from him, swirling through the hall. \"This is your punishment.\" <br/><br/>Feng Chen's palm glowed with a brilliant light, suffused with an oppressive aura that struck fear into their hearts. One by one, he reached out to the fallen elders of Lan Clan. <br/><br/>Crack! <br/><br/>A piercing sound echoed as Feng Chen shattered the dantian of the first elder. <br/><br/>The man screamed in agony, his connection to spiritual energy severed, leaving him a mere mortal. <br/><br/>\"Those who dare harm my clan will be reduced to nothing.\" <br/><br/>The other elders scrambled backward, terror etched into their faces. <br/><br/>\"Please! Patriarch Feng, spare us!\" <br/><br/>\"Mercy! We were only following orders!\" <br/><br/>… <br/><br/>After the first elder had been completely turned into waste, the others realized that Feng Chen didn't care about their clan and wanted to really end them as cultivators. <br/><br/>They immediately threw away their pride and arrogance and began begging. <br/><br/>However, their pleas fell on deaf ears. Feng Chen wasn't going to spare any of them as he quickly destroyed the dantian of elders one by one. <br/><br/>The screams of the Lan Clan cultivators echoed through the hall, but no one dared to intervene. <br/><br/>Lan Xiang was the last. His face was pale, and his arrogance had been completely stripped away. <br/><br/>\"Feng Chen, you'll regret this! The Lan Clan will—\" <br/><br/>CRACK! <br/><br/>Feng Chen shattered Lan Xiang's dantian with a single strike. The elder collapsed, his body trembling as he realized the full weight of his fate. <br/><br/>He went from being a Three Elements Divine Realm to becoming a Waste!\t\t\t\t\t\t</div>", "images": {}, "success": true}