{"id": 140, "url": "https://www.novelhall.com/my-brothers-the-protagonist-good-thing-i-awakened-my-system-33973/15221358.html", "title": "Chapter 146 Feng Yun And The Lan Clan", "volume": 2, "volume_title": "Volume 2", "body": "<h1>Chapter 146 Feng Yun And The Lan Clan</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\t Chapter 146  Feng Yun and The Lan Clan \"Nephew!\" <br/><br/>One day, Elder Wei came rushing into Feng Chen's chambers, his face pale with worry. <br/><br/>Feng Chen looked up, his instincts telling him this had something to do with Feng Yun. <br/><br/>\"There is terrible news about Nephew Yun'er!\" <br/><br/>The content of this news, however, was unlike the last time when Elder Wei had proudly shared updates about Feng Yun. <br/><br/>\"Nephew Yun is in danger!!!\" Elder Wei said worriedly. <br/><br/>\"What happened?\" Feng Chen asked. <br/><br/>\"The Lan Clan of the capital city seems to be pursuing Feng Yun. According to reports, Feng Yun was spotted in the capital where he crossed paths with Lan Jinghao, the prodigy of the Lan Clan who is infamous for harassing young girls.\" <br/><br/>Elder Wei's expression darkened as he mentioned Lan Jinghao. <br/><br/>The prodigy of the Lan Clan was infamous for his depravity, particularly for harassing young women, yet his status and the power of his clan shielded him from any consequences. <br/><br/>\"Lan Jinghao?\" Feng Chen asked sharply. While the name sounded familiar, Feng Chen had never cared for minor villains and didn't know much about him. However, the Lan Clan was a different matter. <br/><br/>Although not as powerful as the Ling Clan, the Lan Clan was still considered strong, often ranked among the top ten clans in the capital. <br/><br/>The \"Top 10\" might not sound extraordinary, but within the capital, which was home to numerous powerful clans, it was no small feat. Each of these clans could dominate any other city if they chose to move. <br/><br/>\"What about it?\" Feng Chen asked. <br/><br/>Although he didn't know Lan Jinghao personally, Elder Wei's description painted a picture of someone whose traits Feng Yun would naturally despise. <br/><br/>\"It seems Lan Jinghao was harassing a young woman in broad daylight. Feng Yun happened to witness the incident and intervened to protect her. Lan Jinghao, being his usual arrogant self, did not take kindly to the interference, and a duel broke out on the spot.\" <br/><br/>Feng Chen listened, and a faint smile tugged at the corner of his lips. He could already guess how the events unfolded. <br/><br/>It was a classic tale of a hero saving a beauty, then putting the villain in his place, earning both admiration and glory. <br/><br/>\"Lan Jinghao, despite his reputation and strength, was utterly defeated. It reportedly took less than twenty moves for Feng Yun to force him to kneel before the gathered crowd. It was a complete humiliation for Lan Jinghao.\" <br/><br/>Feng Chen could already foresee the aftermath. <br/><br/>While defeating Lan Jinghao was an impressive feat, the implications of such an act were not trivial. The Lan Clan, one of the most influential families in the capital, took immense pride in their prodigy. <br/><br/>If they were an honorable clan, they might have accepted the loss with grace. But if not... <br/><br/>\"The Lan Clan did not take the humiliation lightly. They've issued orders to hunt down Feng Yun. While I've heard Nephew Yun'er has escaped for now, who knows how long he can escape from the experts sent by the Lan Clan?\" <br/><br/>Elder Wei observed Feng Chen carefully, knowing how fiercely protective he was of his family, especially when it came to his only younger brother. <br/><br/>Feng Chen's expression darkened, and his aura surged with a chilling intensity. <br/><br/>The air grew heavy, and even Elder Wei, a seasoned elder, felt an involuntary shiver. <br/><br/>\"Hehehe… Lan Clan, is it?\" Feng Chen's voice was as cold as ice. \"It seems the time has come for the Lan Clan to disappear from this world.\" <br/><br/>\"Nephew…\" Elder Wei was stunned by Feng Chen's declaration. <br/><br/>He had come here, unsure of how to handle the Lan Clan's aggression. While sending protectors for Feng Yun was an option, confronting the Lan Clan directly was another matter altogether. Their strength was formidable, arguably stronger than the Feng Clan.  S~eaʀᴄh the nôᴠel Fire.nёt website on Google to access chapters of novels early and in the highest quality.<br/><br/>But here, Feng Chen was talking about erasing the Lan Clan entirely—a notion so extreme that even Elder Wei hadn't imagined Feng Chen would consider such a drastic course of action. <br/><br/>Not to mention, would the Imperial Family even allow such an open confrontation in the capital? <br/><br/>\"Nephew, calm yourself. Our priority should be ensuring Yun'er's safety,\" Elder Wei said, trying to soothe Feng Chen's rising fury. <br/><br/>\"Don't worry, Elder Wei,\" Feng Chen replied, his tone steady yet cold. \"Feng Yun is resourceful. He'll be safe.\" <br/><br/>( With that powerful soul guiding him, escaping and hiding should be easy. ) <br/><br/>Feng Chen had no doubts about Feng Yun's survival. Instead, his focus was now on dealing with the root of the problem. <br/><br/>\"Send Grand Elder Feng Zhenshan and some elders to Feng Yun's last known location. Have them protect him. As for the Lan Clan... I will deal with them myself!\" <br/><br/>BANG! <br/><br/>Before Elder Wei could respond, the doors to Feng Chen's chambers burst open, and a servant hurried in, his face pale with panic. <br/><br/>\"Pardon my intrusion, Patriarch! Elder!\" The servant stammered, bowing deeply. \"But a group claiming to represent the Lan Clan has arrived. They've already injured several guards who tried to stop them and are demanding to see you immediately!\" <br/><br/>Feng Chen's eyes narrowed, and the oppressive aura around him intensified further. \"The Lan Clan, you say?\" Feng Chen's voice was laced with venom. \"How considerate of them to deliver themselves right to my doorstep.\" <br/><br/>Feng Chen said. Not to mention, angry, Feng Chen seemed happy that those Lan Clan's members had come. <br/><br/>He turned sharply to the servant. \"Where are they?\" <br/><br/>\"They're waiting in the main hall, Patriarch,\" the servant replied, his voice quivering. <br/><br/>\"Good!\" \"Let's see what these dogs of the Lan Clan have to say.\" <br/><br/>With those words, Feng Chen vanished from the place, his overwhelming aura still lingering behind him. <br/><br/>Elder Wei followed behind worriedly, though his concern was not for Feng Chen, but for the grim fate that surely awaited the Lan Clan members. <br/><br/>\"Just as our clan is on the rise, trouble starts brewing.\" <br/><br/>Sigh! <br/><br/>Elder Wei didn't know what to say. He could only hope that the Lan Clan members hadn't pushed Feng Chen too far—though he suspected it might already be too late. <br/><br/>He could only try his best to mediate the situation. <br/><br/>But ultimately, the decision rested entirely in Feng Chen's hands.\t\t\t\t\t\t</div>", "images": {}, "success": true}