{"id": 144, "url": "https://www.novelhall.com/my-brothers-the-protagonist-good-thing-i-awakened-my-system-33973/15235328.html", "title": "Chapter 150 Feng Chen Vs The Lan Clan", "volume": 2, "volume_title": "Volume 2", "body": "<h1>Chapter 150 Feng Chen Vs The Lan Clan</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\t Chapter 150  Feng Chen VS The Lan Clan Lan Jing, the current head of the clan, stormed into the main hall, his expression thunderous. <br/><br/>When he entered, his fury turned to shock at the sight of his elders. <br/><br/>Their robes were in tatters, their faces bloodied, and their auras… gone. <br/><br/>He knew that even if the elders concealed their Qi, they wouldn't be able to do so to this extent. <br/><br/>The realization struck him like a thunderbolt—these were no longer cultivators but mere mortals. <br/><br/>\"You dare!\" <br/><br/>Lan Jing roared, his voice trembling with both anger and disbelief. <br/><br/>\"Feng Chen, do you know what you've done?\" <br/><br/>Feng Chen met his gaze unflinchingly. <br/><br/>\"I know exactly what I've done. Do you?\" <br/><br/>The calm, cutting words silenced the onlookers who had followed Lan Jing into the main hall. <br/><br/>Earlier, they hadn't dared to act, but with their clan leader and elders present, the crowd had gained confidence and no longer feared Feng Chen. <br/><br/>Feng Chen continued, his tone unwavering. <br/><br/>\"These elders of yours dared to target my family, even stepping into my territory to do so. This is their punishment—a small price for their action. But I'm not here for them.\" <br/><br/>Lan Jing's fists clenched, his Qi surging in a fury, but he held back. <br/><br/>He didn't know how his elders ended up in such a state, but he knew one thing—no matter the reason, the Lan Clan could not suffer such humiliation. <br/><br/>This was precisely why Feng Yun had been hunted down. To humiliate the Lan Clan, regardless of the reason, was an unforgivable crime. <br/><br/>\"I want to ask you, Lan Clan Leader, who gave you the right to hunt down my brother? If I am not satisfied with your answer, you can consider your clan destroyed.\" <br/><br/>Feng Chen's words were resolute, without a hint of hesitation. <br/><br/>The crowd gasped, the boldness of his statement leaving them stunned. <br/><br/>\"What? The audacity…\" <br/><br/>\"Who does he think he is? Destroy our clan? Haha… It would be a miracle for him to leave alive, and here he talks about destroying us!\" <br/><br/>\"Does he think this is the Eastern Region, where he can boss people around? This is the Lan Clan's territory!\" <br/><br/>… <br/><br/>The onlookers murmured in disbelief, convinced they had heard the biggest joke of the year. <br/><br/>Even Lan Jing seemed momentarily at a loss, his expression darkening as he struggled to find a response. <br/><br/>\"Hahaha… Feng Chen, your arrogance surpasses even your younger brother's. You think you can dictate terms to the Lan Clan?\" <br/><br/>Lan Jing spat venomously. <br/><br/>\"You're overestimating yourself, Feng Chen. This is the Lan Clan, not your backwater Misty Vale City. Surrender yourself and await punishment alongside your brother, whom we will soon capture.\" <br/><br/>Lan Jing's killing intent surged as he spoke. <br/><br/>Lan Jing was one of the strongest below the Nascent Soul Realm, having reached the peak of the Three Elements Divine Realm. <br/><br/>Rumor had it that their ancestor, once a Nascent Soul cultivator, had left behind a secret technique that could temporarily boost a user's power by sacrificing their cultivation permanently. <br/><br/>With this technique, it was said that Lan Clan leaders could contend with Nascent Soul cultivators for a short time, making them a force to be reckoned with. <br/><br/>\"I've said my piece. If you wish to test me further, I'll gladly oblige.\" <br/><br/>Feng Chen's eyes burned with an icy light. <br/><br/>\"Hmph! What are you all waiting for? Surround him and don't let him escape!\" <br/><br/>Lan Jing ordered, and several elders emerged to encircle Feng Chen. <br/><br/>Among them, only one elder was in the Three Elements Divine Realm, while the rest were merely in the Grand Qi Condensation Realm. <br/><br/>Even for a force in the capital, Three Elements Divine Realm cultivators were rare. The Lan Clan's original strength of four such cultivators was already remarkable. <br/><br/>Now, however, only two remained, as Feng Chen had already crippled the other two. <br/><br/>\"Feng Chen! Don't even think about leaving alive today!\" <br/><br/>Lan Jing sneered, confident of his victory. <br/><br/>\"Clan Leader, save us!\" <br/><br/>\"Kill this criminal!\" <br/><br/>… <br/><br/>The crippled elders tied nearby began shouting desperately. <br/><br/>They had tried to mask their pitiful state before their clansmen, but with the battle starting, they had no choice but to beg for help. <br/><br/>They knew that with their crippled cultivation, even a stray force from the clash could kill them. <br/><br/>Lan Jing glanced at the elders in disdain. Without their cultivation, they were useless. He had no intention of saving them and treated them as the waste they had become. <br/><br/>The elders realized this too when Lan Jing ignored their cries. Some continued shouting, but most fell silent, resigned to their fates. <br/><br/>Feng Chen stood in the center of the hall, utterly unfazed by the men surrounding him. <br/><br/>He cared nothing for the crippled elders either. The only reason he had brought them here was to humiliate the Lan Clan, and he had already achieved that. <br/><br/>What happened to them now was no longer his concern. <br/><br/>\"Today, you will learn what happens when you trample on the pride of the Lan Clan!\" <br/><br/>Lan Jing waved his hand, and the cultivators surged forward with their weapons, their Qi flaring. <br/><br/>Feng Chen sighed, almost pitying them. <br/><br/>\"Idiots.\" <br/><br/>With a swift motion, Feng Chen unsheathed his sword, its blade gleaming with lethal intent. <br/><br/>The moment he swung, the air crackled with power. The sheer force of his strike created a visible arc that raced toward Lan Jing and the cultivators. <br/><br/>BOOM! <br/><br/>The sword's devastating energy tore through the hall, blasting back the nearest cultivators, their weapons clattering to the ground. <br/><br/>A suffocating pressure filled the room, forcing many to their knees. <br/><br/>Lan Jing raised his weapon just in time, intercepting the strike. <br/><br/>Sparks flew as the clash resounded, but the force of Feng Chen's attack made him stagger, his foot slipping as his arms trembled under the impact. <br/><br/>It was a simple sword strike, yet infused with Feng Chen's sword intent, it was exponentially stronger than most advanced techniques. <br/><br/>\"What… What kind of monster is this?!\" <br/><br/>A younger cultivator stammered, his face pale as he struggled to breathe. <br/><br/>\"Is this the strength of the Feng Clan Patriarch?\" <br/><br/>The onlookers quickly realized the fight would be anything but quick and scrambled to escape. <br/><br/>Lan Jing's expression darkened as he barked another order. <br/><br/>\"Don't falter! He's only one man! Formation!\" <br/><br/>The remaining cultivators regrouped, forming a battle formation. <br/><br/>Their combined Qi swirled together, creating a barrier of energy to suppress Feng Chen. <br/><br/>This is the first time he will be fighting against a battle formation. A battle formation is a coordinated technique used by multiple cultivators to combine their Qi and abilities into a unified force. By synchronizing their energy and movements, they create a shared barrier or offensive mechanism that amplifies their collective strength far beyond their individual capabilities. Battle formations are particularly effective for clans or sects, as they allow weaker cultivators to challenge stronger opponents by compensating for their lack of individual power with flawless teamwork and synergy. However, their effectiveness heavily depends on the participants' coordination and mastery of the formation. A single disruption can weaken or even collapse the entire structure, making it a double-edged sword in combat. Of course, such formations are very rare and precious, and usually only renowned Sects have them. It was surprising to think a clan like the Lan Clan had one, although it might be thanks to their Nascent Soul Realm ancestor. \"You think this will stop me?\" Feng Chen asked amusingly as he prepared to strike another sword attack. He was curious about whether those groups of Grand Qi Condensation using the battle would be able to take on one of his casual attacks. If it did, he didn't mind taking their Technique and teaching them to his clan. <br/><br/>Feng Chen's sword glimmered coldly as he raised it once more. <br/><br/>\"Try to block this!\" seaʀᴄh thё ηovelFire.ηet website on Google to access chapters of novels early and in the highest quality.\t\t\t\t\t\t</div>", "images": {}, "success": true}