{"id": 148, "url": "https://www.novelhall.com/my-brothers-the-protagonist-good-thing-i-awakened-my-system-33973/15272617.html", "title": "Chapter 154 The Disappearance Of Feng Kai And Feng Yue", "volume": 2, "volume_title": "Volume 2", "body": "<h1>Chapter 154 The Disappearance Of Feng Kai And Feng Yue</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\t154  The Disappearance Of Feng Kai and Feng Yue Years ago, Feng Chen's parents, Feng Kai, and Feng Yue, were two of the most powerful cultivators of the Feng Clan. <br/><br/>Feng Kai was a Top Grand Qi Condensation Realm cultivator, renowned for his decisive nature and overwhelming strength in the Misty Vale City. <br/><br/>Despite having fewer Grand Qi Condensation Realm cultivators than other Major Clans, he alone has managed to maintain Feng Clan's status as one of the Major Clans. <br/><br/>Feng Yue, his wife, was an enigmatic figure. While she was also considered to be in the Grand Qi Condensation Realm, no one truly knew her cultivation level, as she rarely needed to fight. <br/><br/>One fateful day, Feng Yue received a secret message which seemed to be from her family. <br/><br/>Feng Chen didn't know much about his maternal relatives, as his mother had rarely spoken of them. He even thought that perhaps her clan was destroyed or something since he has never seen any relatives from his mother's side. <br/><br/>Only when her mother had mentioned that the letter she received seemed to be from her clan did Feng Chen know that his mother's clan wasn't destroyed or anything. <br/><br/>Seeing how happy and excited his mother was on receiving the letter, he didn't think her clan treated her badly either. <br/><br/>Feng Chen had guessed his mother might not be a native of the Azure Sky Empire, as there was no one who knew her from before her marriage to his father. <br/><br/>After receiving the letter, his mother's expression turned serious and she went to discuss something privately with her father. <br/><br/>When Feng Chen heard about them going somewhere, he eagerly expressed his desire to accompany them. Excited about the chance to meet his maternal family, Feng Yun, his younger brother, mimicked Feng Chen and begged him to go as well. <br/><br/>However, both Feng Kai and Feng Yue refused. <br/><br/>\"This isn't the right time, Chen'er,\" Feng Yue said in a soft but firm tone. \"I promise, when we return, we'll take you to meet them. But for now, focus on your cultivation and look after your brother. Okay?\" <br/><br/>Reluctantly, Feng Chen agreed, trusting their judgment. <br/><br/>Days passed without any word from Feng Kai and Feng Yue. Then came the dreadful news—they had completely disappeared. <br/><br/>Initially, the Feng Clan assumed it was merely a delay. But as weeks passed with no sign of them, the clan grew anxious. Feng Kai and Feng Yue had left without sharing the exact details of their destination, making it nearly impossible to trace their steps. <br/><br/>The Feng Clan sent a group of elders to investigate. They scoured the suspected areas, questioned cultivators, and followed rumors. Yet, no matter how hard they searched, they found no clues. Feng Kai and Feng Yue seemed to have vanished without a trace. <br/><br/>Feng Chen was consumed by worry and guilt. He wanted to leave the clan and search for them himself, but before he could act, disaster struck. <br/><br/>Taking advantage of the turmoil, the Yan Clan launched a surprise attack. Two of their elders led a fierce assault, aiming to eradicate the Feng Clan and seize its resources. <br/><br/>The Feng Clan was left in chaos. It was during this crisis that Feng Chen rose to prominence, personally killing the Yan Clan elders and shocking not only the Feng Clan but the entirety of Misty Vale City. <br/><br/>After the battle, the elders unanimously appointed Feng Chen as the new leader of the Feng Clan. <br/><br/>Despite his new responsibilities, Feng Chen never gave up on finding his parents. Over the years, he pieced together bits of information, but the truth of their disappearance remained elusive. His mother's mysterious background and the message she had received were central to the mystery. <br/><br/>However, Feng Chen knew the exact location of where they were last seen: The Whispering Rift, a natural border separating the Azure Sky Empire from the neighboring Crimson Moon Dominion. <br/><br/>The Crimson Moon Dominion was considered stronger than the Azure Sky Empire, boasting greater resources and more powerful cultivators. <br/><br/>Although there were no confirmed reports of Spirit Severing Realm cultivators in the Crimson Moon Dominion, rumors suggested they had at least 15 Nascent Soul Realm experts. <br/><br/>This superiority often led to border skirmishes, with the Crimson Moon Dominion occasionally invading the Azure Sky Empire. However, these invasions were ultimately unsuccessful, largely due to the Dominion's lack of unity. <br/><br/>If all their Nascent Soul cultivators united and launched a full-scale attack, the Azure Sky Empire would have no chance of survival. However internal conflicts and rivalries within the Dominion had always prevented such cohesion, allowing the Azure Sky Empire to fend off invaders time and again. <br/><br/>Now, Feng Chen stood at the edge of the Whispering Rift. With his speed, it only took a few hours to reach this place from the capital. <br/><br/>This was the last place his parents had been seen. <br/><br/>There were many possibilities for their disappearance. Could they have been kidnapped by someone from the Crimson Moon Dominion? Or was there another, hidden reason? <br/><br/>Though rationally, Feng Chen dismissed the idea that his parents had left willingly. They would never abandon their children or the Feng Clan without saying a word. Such an act was against their very nature. <br/><br/>If they were dead, their bodies would have been found. If it were a monster attack, reports of such an event would have surfaced. <br/><br/>Feng Chen's greatest reassurance lay in one fact: Feng Yun was his brother. <br/><br/>While it wasn't absolute proof, Feng Yun being the protagonist suggested that their parents might be connected to something extraordinary rather than a mundane fate of being killed by some monster. <br/><br/>If they had been killed by a mere monster, it would hardly be fitting for the parents of someone destined for greatness. <br/><br/>Of course, much of this was simply Feng Chen clinging to hope—a deeply personal wish to believe they were still alive and simply disappeared. <br/><br/>\"Could it be my mother's family?\" Feng Chen murmured. \"Were they taken back by force because her family didn't approve of their marriage? Or was it her clan's enemies trying to use them as leverage?\" <br/><br/>The possibilities churned in his mind. <br/><br/>\"Anyway, let's try to find something!\" <br/><br/>Activating his spiritual sense, Feng Chen extended it outward. As a Nascent Soul Realm cultivator, his perception was vast and incredibly detailed. Every blade of grass, every insect, every ripple of wind within a 500-meter radius was laid bare to his awareness. <br/><br/>Yet, no matter how meticulously he scanned, there was nothing unusual. The rocky terrain bore no hidden formations, no signs of battle, and no remnants of lingering spiritual energy. <br/><br/>Well, it had been 10 years since their disappearance, so that was expected. <br/><br/>He pushed his spiritual sense further, stretching its range and fine-tuning its sensitivity. But the more he searched, the more convinced he became that this area held no immediate answers. <br/><br/>Just searching the place seemed to be meaningless. <br/><br/>\"System Store!\" <br/><br/>Hoping for answers, Feng Chen accessed the System Store and searched for artifacts that might reveal the truth. <br/><br/>Artifacts capable of peering into the past or uncovering hidden truths existed but were DAMN expensive, costing millions of System Points. <br/><br/>He browsed for something more affordable but found nothing within his current budget. With a sigh, he gave up, praying that one of these artifacts might appear in his Discount Shop in the future. <br/><br/>\"Looks like I just wasted my time,\" he muttered, frustrated by the lack of progress. <br/><br/>He gave up on searching for now. <br/><br/>Either he needs to get stronger then perhaps he will find something new.  seaʀᴄh thё nôvel_Fire.ηet website on Google to access chapters of novels early and in the highest quality.<br/><br/>Or he would need to get his hands on those expensive artifacts. <br/><br/>Anyway, he believes that the truth will be known. \t\t\t\t\t\t</div>", "images": {}, "success": true}