{"id": 147, "url": "https://www.novelhall.com/my-brothers-the-protagonist-good-thing-i-awakened-my-system-33973/15265898.html", "title": "Chapter 153 Lan Clan Under My Rule", "volume": 2, "volume_title": "Volume 2", "body": "<h1>Chapter 153 Lan Clan Under My Rule</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 153  Lan Clan Under My Rule Feng Chen didn't do much with the Lan Clan. <br/><br/>There were only a few orders that he wanted the Lan Clan to follow. <br/><br/>Of course, not everyone in the Lan Clan knew about what transpired with Feng Chen and kept those things a secret. <br/><br/>Even those who knew that Feng Chen had invaded assumed their Clan Leader had emerged victorious. However, they refrained from bragging or discussing the matter, as Lan Jing had strictly commanded them never to disclose what had happened the previous day, including Feng Chen's visit to their clan. <br/><br/>Of course, the truth was that Lan Jing lost and now he has to do what Feng Chen says or else he will be dead. <br/><br/>The first order was for the Lan Clan to stop hunting down Feng Yun, though Feng Chen believed it might be unnecessary. <br/><br/>With all the Lan Clan members above the Three Elements Divine Realm gathered at the Lan Mansion, the ones chasing Feng Yun were likely Grand Qi Condensation Realm cultivators. Knowing Feng Yun's abilities, Feng Chen didn't think he would be in any real danger. <br/><br/>Additionally, Grand Elder Feng Zhenshan and other elders had already gone to protect Feng Yun. <br/><br/>The second order was absolute obedience. From now on, the Lan Clan had to follow his commands without question. Given the fear he had instilled in Lan Jing and the elders, there was little to no chance of disobedience. If they dared defy him, Feng Chen wouldn't offer another chance—he would destroy them outright. <br/><br/>To Feng Chen, the Lan Clan was nothing more than pigs awaiting slaughter. If he desired, he could wipe them out at any moment. <br/><br/>Their usefulness was the only thing keeping them alive. <br/><br/>The third order was for the Lan Clan to send someone to the Feng Clan once a week with all the intelligence they had gathered. <br/><br/>At the same time, Feng Chen also questioned Lan Jing about whether the Lan Clan was supporting any of the princes in their struggle for the throne. <br/><br/>Lan Jing hesitated at first but knew better than to hide anything. He admitted that the Lan Clan had a secret alliance with the First Prince, whom they believed had the best chance of ascending to the throne.  Sёarch* The nôvelFire.net website on Google to access chapters of novels early and in the highest quality.<br/><br/>The secrecy was due to the Second Prince, whose growing momentum made him a formidable competitor. The First Prince's strategy was to quietly amass power and support, which contrasted with the aggressive tactics of the Second and Third Princes who openly did things. <br/><br/>Feng Chen didn't think much of it. He didn't care who would become the next emperor. He instructed Lan Jing to continue supporting the First Prince as before, keeping the alliance secret. <br/><br/>However, Lan Jing also needs to include the kind of conversation and plan that the First Prince shared with him. <br/><br/>After that, it was time to demand remuneration for the damage caused by the Lan Clan. <br/><br/>Though Lan Jing wanted to argue that it should be the other way around—after all, the battle had nearly destroyed the Lan Mansion, with the top roof completely obliterated—he could only curse Feng Chen's shamelessness in his heart. The repairs would cost tens of thousands of gold coins, but Lan Jing had no choice but to comply. <br/><br/>Nodding reluctantly, he led Feng Chen to the clan's treasury. <br/><br/>Feng Chen wasn't too greedy—or so he thought, though Lan Jing might have other opinions about it. He didn't take everything but walked away with three Earth-Grade artifacts, a hundred thousand gold coins, and the battle formation used by Lan Jing and the elders. <br/><br/>He glanced at their secret technique, Burning Core Ascension, but dismissed it as a flawed self-destructing method. The technique not only reduced one's cultivation but also permanently ruined one's cultivation talent. <br/><br/>\"I might look for something like this in the System Store—without the side effects,\" Feng Chen muttered, returning the technique to the treasury. <br/><br/>Lan Jing felt like crying. Feng Chen had taken their most precious artifacts, their battle formation, and a fortune of a Hundred Thousand gold coins. His only solace was that Feng Chen had spared the secret technique, which he considered the clan's greatest treasure. <br/><br/>\"Oh, by the way,\" Feng Chen added, \"investigate the Ling Clan and find out what happened to their patriarch.\" <br/><br/>Given the Ling Clan's proximity to the capital, the Lan Clan was the ideal choice for this task. <br/><br/>Feng Chen had no intention of interfering in the duel between Ling Meiyu and Feng Yun, but he wanted to know what had happened to Ling Jian and what he might know about his parent's disappearance. Ling Jian was the closest person to his parents, and Feng Chen believed he might hold crucial information about his parent's situation. <br/><br/>Lan Jing's demeanor shifted instantly. <br/><br/>The rivalry between the Lan Clan and the Ling Clan was well-known, and Lan Jing hated the Ling Clan to his core. If not for their ancestor's death, the Lan Clan could have competed equally with the Ling Clan. Instead, the Ling Clan's Nascent Soul Realm cultivator always gave them the upper hand, leaving the Lan Clan at a disadvantage when resources were distributed. <br/><br/>Nothing would please Lan Jing more than seeing the Ling Clan suffer. <br/><br/>If Feng Chen defeated the Ling Clan, Lan Jing would rejoice. If Feng Chen failed and got hurt or even killed, Lan Jing would also celebrate. Watching his enemies fight each other brought him nothing but glee. <br/><br/>\"Of course! I'll uncover everything about the Ling Clan,\" Lan Jing replied confidently. <br/><br/>Feng Chen noticed Lan Jing's enthusiasm but didn't think much of it. His mind was elsewhere. <br/><br/>He contemplated whether to investigate the place where his parents had disappeared. Now that he was a Nascent Soul Realm cultivator and had the System, he felt he might uncover some clues. <br/><br/>The location of his parents' disappearance was near the capital, making the trip convenient as he was already in the capital. <br/><br/>\"Okay, I've decided,\" Feng Chen said. <br/><br/>Even if the investigation yielded no results, it wouldn't hurt to try. Moreover, right now, Feng Clan's problem was solved and there was no need for his presence. <br/><br/>\"Lan Jing, send someone to deliver a letter to the Feng Clan,\" Feng Chen ordered. <br/><br/>Feng Chen then wrote the letter, explaining that he would be away for a few days and that the Lan Clan issue had been resolved. Feng Chen wanted his clan elders to know they didn't need to come to the capital and could rest easy for now.\t\t\t\t\t\t</div>", "images": {}, "success": true}