{"id": 142, "url": "https://www.novelhall.com/my-brothers-the-protagonist-good-thing-i-awakened-my-system-33973/15226611.html", "title": "Chapter 148 A Chain Of Humiliation", "volume": 2, "volume_title": "Volume 2", "body": "<h1>Chapter 148 A Chain Of Humiliation</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 148  A Chain of Humiliation Lan Xiang lay sprawled on the floor, his body trembling, his spirit crushed, and his cultivation destroyed. He coughed up blood, his gaze filled with rage and hatred as he glared at Feng Chen. <br/><br/>\"Y-You'll regret this, Feng Chen!\" Lan Xiang spat, his voice hoarse but laced with venom. \"You think this ends here? The Lan Clan will never let this go! Hahaha… You, your clan, and your entire bloodline will suffer for what you've done! You'll—\" <br/><br/>Lan Xiang's curses continued, his words growing more incoherent as blood dribbled from his lips. <br/><br/>Of course, Feng Chen wasn't interested in listening to some dialogue of a small villain. <br/><br/>Feng Chen turned to Elder Wei. \"Bring me a sturdy rope.\" <br/><br/>Elder Wei nodded and quickly issued the order. Within moments, the servants brought thick ropes to the hall. <br/><br/>\"Bind them!\" Feng Chen commanded coldly, pointing to the defeated Lan Clan cultivators. <br/><br/>The ones to honor and eager to do so were the guards who were previously injured by them. The guards moved swiftly, tying the broken elders together in a single line while also having a grin on their faces. Despite their struggles and curses, the Lan Clan members were too weak to resist. The condition that they were in, even someone from Qi Gathering Stage could casually kill them. <br/><br/>The ropes bit into their skin, and their humiliation deepened with every knot tied. <br/><br/>Lan Xiang, still defiant, hissed through clenched teeth. \"You dare to treat us like this? The Lan Clan—\" <br/><br/>SLAP! <br/><br/>\"Quiet!\" <br/><br/>Feng Chen silenced him with a backhanded slap, the sound echoing through the hall. \"I've grown tired of your empty threats,\" Feng Chen said, his voice icy. \"Since you came here looking for Feng Yun, I'll deliver you back to your clan myself. Dragged through the streets like the dogs you are.\" <br/><br/>Gasps rippled through the Feng Clan hall. Even Elder Wei raised an eyebrow at the audacity of Feng Chen's statement. The Lan Clan was a powerful force in the capital, but Feng Chen seemed utterly unbothered by the potential consequences. <br/><br/>( Dragging them all back to their clan? Wouldn't that mean that Feng Chen was completely disregarding the Lan Clan? I guess that is already late. ) <br/><br/>Elder Wei thought it was already too late for any reconciliation when Feng Chen destroyed Lan's elders' dantian. <br/><br/>Without the two Three Elements Divine Realm cultivators, Elder Wei suspected that Lan Clan might even be placed out of the Top 20 clans in the capital. <br/><br/>The guards finished securing the Lan Clan cultivators, leaving them tied together like a chain of prisoners. \"Take them outside.\" Feng Chen ordered. <br/><br/>The guards dragged the bound elders out of the hall, their bodies scraping against the stone floor. The sight drew the attention of the Feng Clan disciples and servants, who gathered to watch the humiliating procession. <br/><br/>Whispers spread among the crowd.  Searᴄh the NôvelFire(.)net website on Google to access chapters of novels early and in the highest quality.<br/><br/>\"They're from the Lan Clan, right? To think they'd end up like this…\" <br/><br/>\"Serves them right! They dared to harm our people!\" <br/><br/>\"Patriarch Feng is incredible!\" <br/><br/>\"Hmph! This Lan Clan should have known the consequences before trying to harm Brother Yun.\" <br/><br/>… <br/><br/>Lan Clan members were out in the open with many people looking at their humiliating appearance. <br/><br/>After that, Feng Chen stepped forward, grabbed the ropes with one hand, and began dragging the bound cultivators himself. <br/><br/>The group of elders cried out in pain as their bodies were pulled across the uneven ground, but Feng Chen didn't pause. He walked, his expression unreadable as he led the procession through the Feng Clan's courtyard and out into the streets. <br/><br/>Onlookers gawked, their shock turning to awe and amusement as they recognized the insignias on the robes of the battered figures being dragged along. <br/><br/>\"Aren't those people from the Lan Clan? How did they end up like this?\" <br/><br/>\"Rumor has it that they had been pursuing Feng Yun but why are they here and in such a pathetic state?\" <br/><br/>\"Feng Chen really isn't afraid of anyone, is he? Even the clan from capitals are not spared.\" <br/><br/>\"Feng Clan is really the strongest clan of the Eastern Region!\" <br/><br/>… <br/><br/>The people of Misty Vale City saw Feng Chen dragging those Lan Clan's elders and they couldn't help but be shocked by both the power and audacity of Feng Chen. <br/><br/>Of course, nobody dared to say anything to Feng Chen who was doing such a thing. <br/><br/>Feng Chen ignored the murmurs and continued walking, his grip firm on the ropes. Elder Wei followed behind Feng Chen worriedly. He still didn't know whether what Feng Chen said was serious or joking. \"Elder Wei, do what we discuss. As for the Lan Clan, I am going there to talk with them.\" <br/><br/>Feng Chen said and his decision seemed to be final. <br/><br/>Elder Wei also couldn't say anything to dissuade Feng Chen after seeing that he was really serious. As an elder, his responsibilities were to only give advice and suggestions, and the decision lies in Feng Chen's hands. <br/><br/>Moreover, things had already reached such a stage and there was no reversing that. <br/><br/>Confrontation with the Lan Clan seemed to be the only future for the Feng Clan. <br/><br/>\"Don't worry Nephew, we will definitely protect Yun'er. You should also protect yourself well and run away immediately if things get bad. We will come to the Lan Clan after we have secured Feng Yun.\" <br/><br/>Elder Wei said. <br/><br/>\"Sure!\" <br/><br/>Feng Chen has no problem with that, although he didn't think he would take more time than them. <br/><br/>He was thinking about going there and suppressing the Lan Clan and also making them retrieve the order to hunt down Feng Yun. <br/><br/>Of course, if they don't listen to him, they could only blame them for what will happen to them. <br/><br/>WHOOSH! <br/><br/>Feng Chen sprinted with his hand holding the rope, dragging those elders on the rough road. <br/><br/>The Elders who are now mortal were suffering. With obstacles bumping and injuring them time and again. <br/><br/>Of course, they, who didn't have any cultivation would have died, however, Feng Chen used his Qi to protect them enough to not die. <br/><br/>The distance between Misty Vale City and Capital City would normally take 3-4 days, however, with Feng Chen's speed, he could cover it in a few hours. <br/><br/>However he intentionally reduces his speed to make the Lan Clan's elders suffer more. <br/><br/>This was just a small price for hurting his family!\t\t\t\t\t\t</div>", "images": {}, "success": true}