{"id": 145, "url": "https://www.novelhall.com/my-brothers-the-protagonist-good-thing-i-awakened-my-system-33973/15253108.html", "title": "Chapter 151 Lan Clan'S Last Stand", "volume": 2, "volume_title": "Volume 2", "body": "<h1>Chapter 151 Lan Clan'S Last Stand</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\t151  Lan Clan's Last Stand Without hesitation, Feng Chen swung his sword, releasing a devastating arc of Sword slashes that roared toward the Lan Clan's battle formation. <br/><br/>The barrier flared to life, its glowing surface rippling as it absorbed the strike. Sparks flew, and cracks began to appear, but the combined effort of the Lan Clan held firm. Feng Chen's eyes gleamed with a mix of surprise and intrigue. \"Oh? Not bad. It seems this formation has some worth after all.\" <br/><br/>Lan Jing barked orders, his voice strained but triumphant. \"Reinforce the barrier! Show him the strength of the Lan Clan!\" <br/><br/>The elders gritted their teeth, channeling their Qi in unison. The barrier's glow intensified, the cracks mending as their collective energy surged to its peak. <br/><br/>Feng Chen studied the formation, a faint smile tugging at his lips. \"A battle formation like this… If mastered, it could be quite useful. Perhaps I should claim it for the Feng Clan.\" <br/><br/>After all, to be able to stop his strike with a bunch of Grand Qi Condensation Realm cultivators was quite good in his opinion. <br/><br/>\"Haha… Feng Chen, surrender yourself. Your attack is useless against our formation!\" <br/><br/>Lan Jing said with arrogance. He thought that the casual sword slash of Feng Chen was his strongest Technique and was confident that Feng Chen must have exhausted his Qi after those two attacks. <br/><br/>Feng Chen didn't bother arguing with Lan Jing and simply raised his sword again, this time with much more power. A chilling aura enveloped the blade, the temperature in the hall dropping as his intent coalesced into a far more destructive strike. <br/><br/>\"Let's see how long you can last,\" Feng Chen said, his tone filled with amusement. <br/><br/>With a sharp motion, he slashed downward. The sword slash was even stronger than before. <br/><br/>BANG! <br/><br/>The barrier shuddered violently as the attack connected. Lan Jing and the elders poured tremendous Qi to maintain the barrier which was under attack. <br/><br/>\"One more!\" <br/><br/>\"AAAHHHH…. \" <br/><br/>The Lan Clan's elders holding it screamed in unison, blood dripping from their mouths as the strain overwhelmed them. Even Lan Jing's expression changed as he didn't expect Feng Chen could use such a powerful technique continuously. <br/><br/>Cracks reappeared, spreading like lightning across the glowing shield. <br/><br/>\"Hold it!\" Lan Jing yelled, his voice desperate. \"We can't let it break!\" <br/><br/>He didn't think that Feng Chen alone would be able to take on their formation. <br/><br/>( If only those wastes didn't have their cultivation crippled. ) <br/><br/>Lan Jing thought. With him and three more Three Elements Divine Realm, he was confident to withstand attacks from Nascent Soul Realm, not to mention Feng Chen who he thought was in Peak Three Elements Divine Realm. <br/><br/>However, with two of them missing, their battle formation power has been reduced significantly though he initially thought it would still be easily able to overpower someone like Feng Chen. <br/><br/>\"One more!\" <br/><br/>Feng Chen said as he attacked for the fourth time. <br/><br/>CRACK! <br/><br/>With a deafening crack, the barrier shattered into countless fragments, the explosion of energy throwing the cultivators backward. Cries of pain echoed as the weaker among them spat blood, their Qi pathways disrupted by the backlash. <br/><br/>\"N-No… How is this possible? How can a Three Elements Divine Realm cultivator be able to break through our battle formation?\" <br/><br/>Lan Jing said as he stumbled, coughing blood as he struggled to regain his footing. His eyes widened in disbelief as he stared at the man who had just destroyed their strongest defense. <br/><br/>Feng Chen nodded to himself, as though satisfied. \"Impressive. For a moment, I thought your formation might survive another strike. A pity!\" <br/><br/>Lan Jing gritted his teeth, his body trembling with both fury and fear. \"You… You'll pay for this!\" <br/><br/>He doesn't know what is with these people talking about making him pay. <br/><br/>Wasn't it the other way around? He was just making them pay for what they did to his younger brother. <br/><br/>But who was he to argue with a villain? \"Let's just finish this!\" <br/><br/>The remaining elders could only watch in terror as Feng Chen prepared to strike again. The Lan Clan, once proud and unyielding, now stood on the brink of ruin. <br/><br/>Lan Jing roared, summoning his full strength. \"If the formation fails, I'll take you down myself! Don't think you're invincible, Feng Chen!\" <br/><br/>Lan Jing's Qi erupted, forming a glowing sphere around him. The energy flared with a fiery intensity, crackling as it expanded. His aura grew wild and oppressive as he activated the Lan Clan's forbidden technique, \"Burning Core Ascension\". <br/><br/>\"Die!\"  S~eaʀᴄh the NôᴠeFire.ηet website on Google to access chapters of novels early and in the highest quality.<br/><br/>Lan Jing roared, his voice hoarse with fury and desperation. The energy from the Burning Core Ascension surged outward, taking the form of a fiery serpent. The serpent coiled and twisted with feral intent, its blazing heat suffusing the air as it lunged toward Feng Chen. <br/><br/>Feng Chen stood unshaken, his gaze cool and assessing. He watched the oncoming attack, unimpressed by the technique's volatile display. However, Feng Chen could definitely sense that the power of the attack was something that far surpassed that of the Three Elements Divine Realm. ( Mmmm… Indeed! Even the Initial Nascent Soul Realm cultivator might have some trouble facing against the current Lan Jing. ) <br/><br/>Feng Chen thought as he looked at the attack. Lan Jing was 3-4 times more powerful than he was. Worthy of being a Secret technique. <br/><br/>\"Perhaps, I should get a bit serious!\" <br/><br/>Feng Chen said as his grip tightened on his sword. <br/><br/>\"Heavenly Emperor's Sword!\" With a single, fluid motion, he swung his sword upward. A sword slash surged from the blade, colliding with the fiery serpent. CLANK! <br/><br/>The clash of two powerful techniques was both deafening and spectacular. The sight of the two clashes was no less than the fight between two Nascent Soul Realm cultivators. <br/><br/>However, it became apparent the moment the two clashed that Feng Chen's power far surpassed Lan Jing. <br/><br/>Lan Jing was getting pushed further and further back as he tried to break through Feng Chen's attack. <br/><br/>BOOM! <br/><br/>Soon, Feng Chen's attack tore through Lan Jing's technique, obliterating the latter's defenses with overwhelming might. <br/><br/>Feng Chen stood without any joy or sadness like he had just taken care of some ants. <br/><br/>Across from him, Lan Jing knelt on the ground, his body battered and seriously injured. He clutched his chest, his face pale and contorted in pain. His increased power was gone, reduced to nothing more than embers in the air. <br/><br/>Lan Jing gasped for breath, his entire body trembling as he felt the devastating consequences of his technique. His cultivation base was fractured, his dantian teetering on the edge of collapse. He could already sense it—his realm had plummeted, from Peak to the Top and showing signs of decreasing further down. <br/><br/>\"You… You've ruined me…\" Lan Jing yelled, his voice laced with despair. Feng Chen's expression remained indifferent as he sheathed his sword. \"You've ruined yourself.\" <br/><br/>Feng Chen replied coldly. He certainly admits that the Secret technique of the Lan Clan was powerful but the side effect made it undesirable for him. <br/><br/>The remaining Lan Clan elders, frozen in fear, could only watch as their leader crumbled. The oppressive presence they had once relied upon was now reduced to nothing. <br/><br/>It seemed that their Clan was finished. \t\t\t\t\t\t</div>", "images": {}, "success": true}