{"id": 8, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15071917.html", "title": "Chapter 2994 - Chapter 2994: Dragon Palace Vs The Central Race Of The Universe 5", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 2994 - Chapter 2994: Dragon Palace Vs The Central Race Of The Universe 5</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 2994: Dragon Palace vs the central race of the Universe 5<br/><br/>“The first one!”<br/><br/>Wang Xian grabbed the head of the three-eyed race elder. His eyes were cold as he waved his arm and threw the head towards the back.<br/><br/>“Hehe!”<br/><br/>At the back, the Heaven Formation which was set up in the Dragon Cave waved its arm and grabbed the head. It then used the formation to seal the head.<br/><br/>“Let go of me! Let Go of Me Now! Otherwise, our three-eyed race will not let you off easily!”<br/><br/>The eight elders of the three-eyed race shouted in horror.<br/><br/>“Let’s watch all of you from the three-eyed race die!”<br/><br/>The sky array glanced at him and said coldly.<br/><br/>“Kill!”<br/><br/>After Wang Xian grabbed the three-eyed race elder, he immediately attacked the four-armed race elder.<br/><br/>His terrifying speed, powerful defense and attack power made the four-armed race experts horrified.<br/><br/>“Kill this fellow from the Dragon Palace!”<br/><br/>A few level 5 celestial thearch level four-armed race’s experts roared with murderous intent.<br/><br/>“Roar!”<br/><br/>“Roar!”<br/><br/>However, at this moment, a wind god Dragon swayed its huge body and directly attacked the few level 5 celestial thearch level experts who were attacking Wang Xian.<br/><br/>“Pu!”<br/><br/>The moment the Wind God Dragon appeared, Ao Yao also appeared behind a level 5 celestial thearch level expert from the four-armed race. Her sickle-like arm directly pierced towards their heads.<br/><br/>The sudden attack caused the celestial thearch’s body to stiffen.<br/><br/>“You are courting death!”<br/><br/>Wang Xian snorted coldly. He waved his arm and the five elemental grindstone attacked the Celestial Thearch who was assassinated by Ao Yao.<br/><br/>“Bang!”<br/><br/>Ao Yao’s attack and the five elemental grindstone’s attack caused his body to fly backwards.<br/><br/>Wang Xian’s figure moved and continued to attack elder Si from the four-armed race.<br/><br/>“Not good!”<br/><br/>At this moment, elder Yi’s eyes were filled with fear when he saw Wang Xian locking onto him.<br/><br/>“Stop him, stop him!”<br/><br/>He shouted in fear.<br/><br/>However, the strength of the four-armed race was much weaker than the Dragon Palace. How could he resist?<br/><br/>“Peng!”<br/><br/>Wang Xian clawed at him with his dragon claws. Elder Yi, who was severely injured, wanted to escape in fear. The Five Elements Millstone released a binding force and directly entangled him.<br/><br/>“Bang!”<br/><br/>The huge dragon claws grabbed his body directly. Wang Xian flapped his godless holy wings and turned around to leave.<br/><br/>“Oh no, elder Ren has been captured!”<br/><br/>A deacon shouted in horror.<br/><br/>However, at this moment, the rest of the celestial thearchs did not have the time to care about elder Ren. They faced the members of the Dragon Palace in front of them with pale faces.<br/><br/>“Let go of me. Our four-armed race has a level seven celestial thearch. There are even more level six celestial thearchs. If you kill us, it will only bring disaster to Your Dragon Palace!”<br/><br/>Elder Yu struggled free from Wang Xian’s claws and roared with a pale face.<br/><br/>“Noisy!”<br/><br/>Wang Xian landed in front of the Dragon Cave, arm a wave, in front of the condensed sword, directly toward his body to stab.<br/><br/>“Aaaaah!”<br/><br/>The sound of a scream came, making it sound of pain.<br/><br/>“Jie Jie Jie, in order to severely wound you two we have gone to great lengths, even we have suffered a heavy blow, you do not think so easy to die!”<br/><br/>The injured Ba Qi Mo sha and Ba Qi Mo Sha revealed cold expressions. They waved their arms and black liquid landed on their bodies.<br/><br/>“Ah Ah Ah Ah!”<br/><br/>Soon, a mournful voice was heard from elder Yi’s mouth. The three-eyed race’s eight elders saw it and their faces turned extremely pale.<br/><br/>“What do you want to Do? What does your Dragon Palace want to Do? As long as you don’t Kill Us, we will agree to anything!”<br/><br/>The eight elders of the three-eyed race roared in fear.<br/><br/>“Jie Jie Jie, you want our Dragon Palace to kneel and submit? Now, kneel and submit and let us see!”<br/><br/>Mo Sha stared at the two elders of the four-armed race and said in a cold voice.<br/><br/>“AH, even if you kill me, I won’t kneel. Our four-armed race will destroy you. Don’t be arrogant!”<br/><br/>Elder Ren roared with a murderous look on his face.<br/><br/>“Since you are not willing to kneel down, what’s the use of having these legs?”<br/><br/>Ba Qi said coldly. With a wave of his arm, drops of liquid landed on his legs.<br/><br/>The liquid immediately turned into a terrifying insect and nibbled on his legs.<br/><br/>“Ah! Ah! Ah!”<br/><br/>Excruciating screams came from his mouth.<br/><br/>Wang Xian took a glance at the battlefield in front of him.<br/><br/>He didn’t show any signs of being tortured by the eight-limbed demon.<br/><br/>The Dragon Palace and the four-limbed race had no grudges with the three-eyed race. However, they wanted to destroy the Dragon Palace, yet they wanted the Dragon Palace to submit.<br/><br/>They wanted to kneel down and submit?<br/><br/>Since that was the case, they would have to suffer the Dragon Palace’s revenge.<br/><br/>“It’s best that they didn’t tell the race how they entered this place. Otherwise, the eight-limbed demon will torture you for a period of time before killing all of you!”<br/><br/>Wang Xian’s heart was filled with killing intent.<br/><br/>The area in front of them was a complete and overwhelming massacre.<br/><br/>The weakest godly monarch of the Dragon Palace was at level eight while there were nearly 8,000 of them. With such strength, they could completely crush their opponents.<br/><br/>In a short period of time, all the godly monarch-level powerhouses of the two races were killed.<br/><br/>Only 700 to 800 godly monarchs were still resisting with great difficulty.<br/><br/>However, their deaths were still a matter of time.<br/><br/>“Hiss, the forces at the center of the universe, more than 1,000 celestial thearchs, were massacred by the Dragon Palace crazily. They couldn’t resist at all!”<br/><br/>“Look at the strength of the members of the Dragon Palace. The weakest is at the eighth level of the Godly King realm, close to two million. This is too terrifying. With such strength, they can destroy our resplendent starry sky with only 1% of their strength.”<br/><br/>“How terrifying!”<br/><br/>On the nine nihility planet, all the people of the resplendent starry sky looked on in shock.<br/><br/>The domain Lord and the other godly monarchs pursed their lips.<br/><br/>Wasn’t it just as the people around said? There were close to eight thousand godly monarchs in the Dragon Palace. One percent was still seventy to eighty percent, not to mention the other members of the Dragon Palace.<br/><br/>The combined strength of the other forces in the resplendent starry sky was less than one percent of the Dragon Palace.<br/><br/>It was a huge gap!<br/><br/>“Ahhhhh!”<br/><br/>Screams continued to ring out.<br/><br/>The powerful dragon seed of the Dragon Palace swayed in the air and attacked the divine emperors of the two races.<br/><br/>The Divine Emperors fell one after another.<br/><br/>Even the rank five divine emperors were killed under the siege.<br/><br/>The battle in front of them had opened everyone’s eyes.<br/><br/>Close to 10,000 divine emperors were fighting!<br/><br/>More than 1,000 divine emperors had fallen!<br/><br/>At the location of the Dragon Cave, the eight elders of the three-eyed race and elder Ren, who was screaming in pain, had personally witnessed the deaths of their clansmen and experts. Their eyes were filled with despair.<br/><br/>They had originally thought that entering this place would be an opportunity. In their hearts, they had been looking forward to getting an inferior dragon as a mount.<br/><br/>But now…<br/><br/>“Dragon King, the communication stone tablets of the two of them did not transmit the method to enter the resplendent starry sky. I wonder if the others have done so!”<br/><br/>At this moment, heaven array who was fiddling with the two communication stone tablets said.<br/><br/>“HMM, let me check it out!”<br/><br/>As Wang Xian spoke, he waved his arm and grabbed the head of the eight elders of the three-eyed race.<br/><br/>“Soul capture!”<br/><br/>A surge of energy entered his mind and severely injured the weak eight elders of the three-eyed race.\t\t\t\t\t\t</div>", "images": {}, "success": true}