{"id": 9, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15071919.html", "title": "Chapter 2995 - Chapter 2995: ’S Opportunity To Counterattack", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 2995 - Chapter 2995: ’S Opportunity To Counterattack</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 2995: ’s opportunity to counterattack<br/><br/>Buzz! Buzz<br/><br/>In the Dragon Cave, Wang Xian was reading the memories of the eight elders of the three-eyed race. He stood there and slowly absorbed the memories.<br/><br/>“Roar! Roar! Roar!”<br/><br/>In the void in front of them, the members of the Dragon Palace were wreaking havoc. They were surrounding and attacking the divine emperors of the two major races who were dwindling in number.<br/><br/>The situation of this battle had been completely settled.<br/><br/>Not a single one of the two groups of advance troops could escape.<br/><br/>“Die!”<br/><br/>“Roar!”<br/><br/>A few minutes later, on the battlefield, the Wind God, Ao Qitian, ao crab, and the rest were surrounding and attacking the last two celestial thearch level five powerhouses.<br/><br/>Around them, 1.9 million members of the Dragon Palace were surrounding and staring at them coldly.<br/><br/>“No!”<br/><br/>Along with a scream filled with unwillingness, it signaled the end of this battle.<br/><br/>Wang Xian opened his eyes, and his eyes were sparkling.<br/><br/>“Summon Your Void Kingdom!”<br/><br/>Staring at the head in front of him, he ordered in a deep voice.<br/><br/>“Cough, cough!”<br/><br/>The three-eyed race’s eighth elder, who had almost lost his mind, opened his mouth. Five seconds later, a void kingdom appeared in front of the Dragon Cave.<br/><br/>“What did you do to him? What kind of strange witchcraft did you use?”<br/><br/>At the side, the four-armed elder saw the sudden appearance of the void God realm of the three-eyed elder and shouted in horror.<br/><br/>“His vitality is still too strong. Eight-limbed demonic fiend, teach him a lesson!”<br/><br/>Wang Xian looked at elder Ren and instructed the eight-limbed demonic fiend.<br/><br/>“It’s the Dragon King. hehehe, we are good at this!”<br/><br/>The eight-limbed demonic fiend and elder Ren looked at elder Ren coldly.<br/><br/>Very soon, an even more tragic voice was heard.<br/><br/>This time, it was not just a simple torture, but a drain on his vitality.<br/><br/>Wang Xian stood by the side and quietly digested the information he had just received.<br/><br/>It was a piece of good news. The three-eyed race did not inform the race of the entrance to the resplendent starry sky.<br/><br/>This was because in the opinion of the three-eyed race, it would take a month for the true army of the race to arrive. It would not be too late to inform them when the time came.<br/><br/>Furthermore, they would not have thought that they would all die here.<br/><br/>Therefore, it was not very important to inform the race of the way to enter the starry sky.<br/><br/>Other than that, Wang Xian also obtained many useful information from his memories. Many things related to the ruins of the Mohan clan.<br/><br/>“Dragon King! Everything has been settled!”<br/><br/>At this moment, more than a million members of the Dragon Palace flew over. They were filled with a murderous aura as they spoke respectfully to Wang Xian.<br/><br/>“Very good!”<br/><br/>Wang Xian revealed a satisfied expression. “Bring the resources back. Prime Minister Gui, you will arrange for the promotion!”<br/><br/>“It’s the Dragon King!”<br/><br/>Prime Minister Gui nodded immediately.<br/><br/>“It’s Done!”<br/><br/>Wang Xian looked at the four-armed race’s elder Yi who was screaming in pain. His eyes were filled with coldness when he saw how badly he looked.<br/><br/>He waved his arm and grabbed elder Yi’s neck.<br/><br/>“Kill me, kill me. Hahaha, it won’t be long before our four-armed race exterminates everyone in Your Dragon Palace. We will not spare a single one of you. Hahaha, hahaha!”<br/><br/>Elder Hu roared maniacally.<br/><br/>“HMPH!”<br/><br/>Wang Xian snorted coldly, “It’s not certain who will be exterminated!”<br/><br/>As he spoke, he immediately activated soul capture!<br/><br/>In the Battle of soul capture, elder Hu, who was on the verge of death, could not put up any resistance.<br/><br/>Waves of information were transmitted into Wang Xian’s mind, causing him to reveal a smile.<br/><br/>The entrance of the four-armed race did not spread out either.<br/><br/>After asking him to summon his void God realm back, Wang Xian waved his arm and killed the two of them. The two God realms were kept in the Dragon Cave.<br/><br/>“Let’s go back!”<br/><br/>Wang Xian said to an lie.<br/><br/>“It’s the Dragon King!”<br/><br/>An lie nodded. Xiao Lan and the rest also entered the Dragon Cave. In the next moment, the entire Dragon Cave disappeared.<br/><br/>In the sky, there was nothing other than traces of residual power.<br/><br/>“It disappeared?”<br/><br/>Seeing the people of the Dragon Cave and the Dragon Palace disappear in the void, the people on the nine min planet were shocked.<br/><br/>It disappeared directly. This was the power of the Dragon Palace.<br/><br/>“It’s so powerful that even the central force of the universe, the Dragon Palace, could destroy it easily.”<br/><br/>Some people sighed.<br/><br/>The domain Lord and the other godly monarchs were also shocked. They looked at each other and left immediately.<br/><br/>The news of this battle spread across the entire resplendent starry sky very quickly.<br/><br/>The resplendent starry sky would also be shaken by the Dragon Palace very soon.<br/><br/>It was truly a huge earthquake.<br/><br/>“Dragon King, how’s the situation now?”<br/><br/>Upon returning to the Dragon Palace, Prime Minister Gui and the others asked Wang Xian.<br/><br/>“The current situation is pretty good. Neither of the two major tribes have found a way to enter the resplendent starry sky. However, we can’t be careless either. The entrance to our place has already appeared. With the abilities of the powerhouses in the center of the universe, they might be able to enter soon!”<br/><br/>Wang Xian spoke.<br/><br/>“Dragon King, we have obtained two level-six celestial emperor corpses this time. I’ll upgrade first. After I upgrade, we can set up some formations at those entrances.”<br/><br/>“If the two tribes don’t have a level-seven celestial emperor formation master, it might be difficult to break the formations in a short period of time. As long as we have a few years, we might not be afraid of them!”<br/><br/>Sky Array said.<br/><br/>Wang Xian nodded his head.<br/><br/>“Sky Array, you should upgrade first. Also, now that I have a chance for us to fight back, the land of desolation is the base of the Mohan clan. The Mohan clan is a primary race in the universe, and their level is above domain level!”<br/><br/>“A primary race in the universe has the existence of a universe knight. They can already reach the level of a master in the center of the universe. The Mohan clan is a lineage of wizards. Before they were destroyed, they destroyed their own inheritance array and self-destructed to cover their base!”<br/><br/>“They did this to prevent their enemies from getting the inheritance of their own race and some treasures of their own race. Their opponents didn’t get any treasures and weren’t able to enter. Now, the Mohan clan ruins have become a land of treasures. Many races and domain level races are exploring here, trying to get the treasures here!”<br/><br/>“I have obtained some information from the three-eyed race and the four-armed race. I can get an lie to bring us in to explore!”<br/><br/>Wang Xian said with a twinkle in his eyes.<br/><br/>The ruins of the Mohan clan was a treasure ground at the edge of the universe. More than a hundred domain-level experts from the races had been exploring this place all year round.<br/><br/>However, many of the treasures at the core of the place had not been obtained.<br/><br/>The spell formation of the Wizards was not simple. Even paragons would find it difficult to break into it.<br/><br/>Moreover, the Wizards were very strange. If an expert forcefully broke the spell formation, it might cause a chain reaction and cause the entire area to explode.<br/><br/>At that time, all the treasures inside would be destroyed.<br/><br/>However, an lie was different. His teleportation was not restricted by the spell formation. He could teleport there instantly.<br/><br/>If the Dragon Palace could obtain some resources from the Mo Han clan’s racial ruins, the four-armed race and the three-eyed race could be wiped out!<br/><br/>“The Heaven Array can upgrade the level-six divine emperor fighter jet. In addition, one level-six divine emperor corpse and ten level-five divine emperor corpses will allow ao Yaoyao and Ba Qi to upgrade their combat strength to level-six divine emperor first. After the upgrade, we will explore the Mo Han clan’s racial ruins!”<br/><br/>Wang Xian continued to instruct!\t\t\t\t\t\t</div>", "images": {}, "success": true}