{"id": 5, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15067243.html", "title": "Chapter 2991 - Chapter 2991: Dragon Palace Vs Universe Central Race 2", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 2991 - Chapter 2991: Dragon Palace Vs Universe Central Race 2</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 2991: Dragon Palace vs Universe Central Race 2<br/><br/>“Hehe, offend us? You have no right to offend us. Now Give Your Dragon Palace a way out and submit to us!”<br/><br/>Ba Qi stared at Prime Minister Turtle and said arrogantly.<br/><br/>He showed the arrogance of the universe central race without a doubt.<br/><br/>“If we don’t submit to you, do you want to destroy our Dragon Palace?”<br/><br/>Prime Minister Gui stared at Ba Qi and the others and coldly said.<br/><br/>“Submitting to us is your only way out!”<br/><br/>Without waiting for Ba Qi to speak, Elder Gong took a step forward and released a terrifying aura.<br/><br/>A rank 6 void God emperor aura charged forward.<br/><br/>Feeling this aura, all the members of the Dragon Palace revealed solemn expressions.<br/><br/>“I’ll give you ten seconds to consider. If you don’t submit within ten seconds, our four-armed race can only suppress your Dragon Palace!”<br/><br/>Elder Gong judged them with a high and mighty tone.<br/><br/>“The three-eyed race is here!”<br/><br/>At this moment, an intense voice sounded.<br/><br/>His words caused Wang Xian and the rest to heave a sigh of relief.<br/><br/>If they were to attack the four-armed race directly, with the strength of the Dragon Palace, it was sufficient to exterminate them.<br/><br/>However, when they were exterminated, the three-eyed race would also rush over. At that time, the three-eyed race would become vigilant. If that was the case, it would be too difficult for them to kill a rank six void God Emperor.<br/><br/>They had to wait until both races had arrived before they could act.<br/><br/>However, the experts from the four-armed race were too arrogant.<br/><br/>Giving the Dragon Palace 10 seconds to submit?<br/><br/>The eyes of all the members of the Dragon Palace flickered with cold killing intent.<br/><br/>“Elder Yi, the people of the three-eyed race are here!”<br/><br/>The four-armed race was leading the army in the front, but a surprised voice came from the back.<br/><br/>“What?”<br/><br/>Elder Yi’s expression changed slightly, and he immediately looked toward the back.<br/><br/>“They are so fast?”<br/><br/>Ba Qi also said with a solemn expression, and a hint of relief flashed in his eyes.<br/><br/>“Eighth elder, they’re from the four-armed race. They’re actually one step ahead of us. That’s the Dragon Cave of the Dragon Palace!”<br/><br/>Mo Sha and the three-eyed race’s experts, who were residing on the three-eyed race’s Yang Feng, arrived.<br/><br/>When they saw the four-armed race in front of them, they immediately spoke to the elder.<br/><br/>“Oh? The people from the Dragon Palace are actually waiting for us here? What do they want to do? Do they want to submit?”<br/><br/>“The four-armed race is quite fast!”<br/><br/>The eighth elder of the three-eyed race flew forward with a cold look in his eyes.<br/><br/>“Three-eyed race, you can go back now. This void belongs to us!”<br/><br/>The elder of the four-armed race looked back and said with a gloomy face.<br/><br/>“Four-armed race, don’t you think you are worse than a three-year-old child?”<br/><br/>The eight elder of the three-eyed race led his subordinates and flew toward the four-armed race.<br/><br/>He glanced around the dragon palace and sized them up.<br/><br/>“Humph!”<br/><br/>The elder of the four-armed race snorted.<br/><br/>All the people of the four-armed race changed their auras and charged toward the three-eyed race.<br/><br/>“You’re courting death!”<br/><br/>“Boom! Boom! Boom!”<br/><br/>Mo Sha Roared and released his aura. He charged toward them. The other three-eyed race members didn’t show any fear and welcomed him with their auras.<br/><br/>“Rumble!”<br/><br/>A terrifying sound erupted from the void in the middle of them.<br/><br/>“These two races have at least a thousand god emperors and more than a thousand of them!”<br/><br/>“They are too strong. They are simply too strong. Even though the Dragon Palace is also very strong, the gap between them is too big. There are more than a thousand god Emperors!”<br/><br/>“Is this the power at the center of the Universe? They are undefeatable!”<br/><br/>In the void above the nine annihilation planet, the citizens of the resplendent starry sky felt the power in the void, and their faces turned pale.<br/><br/>More than a thousand God emperors!<br/><br/>The former resplendent starry sky god Emperors added up to only a hundred.<br/><br/>The Dragon Palace was very strong now, but could they withstand it?<br/><br/>From their point of view, they could not!<br/><br/>Some people revealed worried expressions.<br/><br/>In the void ahead, both sides were confronting each other.<br/><br/>The four-armed elder and the eight elders of the three-eyed race also looked at each other. Their eyes were filled with coldness.<br/><br/>The atmosphere was heavy.<br/><br/>“Dragon King, they don’t put us in their eyes at all!”<br/><br/>Tian Chen looked at the two big forces in front of them and said indifferently.<br/><br/>“Hehe!”<br/><br/>Wang Xian smiled. He watched quietly and waited for the opportunity.<br/><br/>“Let’s see who’s better when we see the opportunity!”<br/><br/>The tense atmosphere hesitated for a few seconds before a deacon from the three-eyed race spoke to break the deadlock.<br/><br/>The eight elders from the three-eyed race looked at the deacon before looking at the four-armed race.<br/><br/>“I have no objections. After seeing the opportunity, we will decide whether to fight or not!”<br/><br/>The four-armed race elder replied faintly.<br/><br/>After a simple clash of auras, they understood each other’s strength.<br/><br/>If the two sides really fought, there was a high chance that both sides would be injured.<br/><br/>It was obviously not a wise choice to fight without seeing the opportunity.<br/><br/>They quickly came to an agreement and slowly looked at the Dragon Palace.<br/><br/>They locked onto their target this time.<br/><br/>“All the members of Your Dragon Palace come out and kneel in the Void!”<br/><br/>The eighth elder of the three-eyed race ordered.<br/><br/>“You want us to kneel in the Void?”<br/><br/>Wang Xian raised his eyebrows when he heard his words.<br/><br/>“The forces at the center of the universe are too powerful!”<br/><br/>“This… The Dragon Palace is in Big Trouble!”<br/><br/>Everyone on the nine annihilation planet had a drastic change in expression when they heard his words.<br/><br/>Only the domain Lord and the rest were watching quietly. They were a little puzzled. What were the Dragon King and the rest waiting for?<br/><br/>“Not good, eighth elder. Someone from the four-armed race on the right has ambushed us!”<br/><br/>However, at this moment, a sudden exclamation came from the three-eyed race.<br/><br/>A voice that no one had expected rang out.<br/><br/>The voice came from Mo Sha, who was on Yang Feng’s body.<br/><br/>His figure rang out beside the ears of the eight elders of the three-eyed race. The eighth elder was shocked and quickly looked to the right.<br/><br/>At this moment, the dagger in Mo Sha’s hand surged with violent energy as it directly attacked the eighth elder.<br/><br/>“You…”<br/><br/>The eighth elder felt the attack behind him and was greatly shocked.<br/><br/>However, the distance between them was only a few meters. A few meters was a distance of a level five divine emperor attacking a level six divine emperor.<br/><br/>Under the situation where he was caught off guard, he could not react at all.<br/><br/>He could only passively mobilize the energy in his body to protect himself.<br/><br/>“Pu!”<br/><br/>Mo Sha’s full-strength attack landed heavily on the body of the three-eyed race elder.<br/><br/>The powerful force caused him to fly backward. He spat out fresh blood and his entire back was pierced through.<br/><br/>“What!”<br/><br/>Everyone from the three-eyed race was shocked and looked at this scene in disbelief.<br/><br/>Why did deacon Yang Feng suddenly attack the eighth elder?<br/><br/>Even everyone from the four-armed race was slightly shocked.<br/><br/>They looked over.<br/><br/>“PFFT!”<br/><br/>“Boom!”<br/><br/>But just as everyone from the four-armed race was stunned, the eight-armed race also moved.<br/><br/>He stared coldly at elder Ji in front of him.<br/><br/>A black dagger also stabbed towards elder Ji’s head.<br/><br/>At the same time, a millstone flew out from his interspatial ring. It was the five elements millstone.<br/><br/>The Five Elements Millstone, which contained the strongest attack, also struck towards elder Ji.<br/><br/>The sudden change shocked everyone.\t\t\t\t\t\t</div>", "images": {}, "success": true}