{"id": 3, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15067241.html", "title": "Chapter 2989 - Chapter 2989: With The Full Strength Of The Dragon Palace", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 2989 - Chapter 2989: With The Full Strength Of The Dragon Palace</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 2989: With the full strength of the Dragon Palace<br/><br/>“Enter the Dragon Cave, let’s Go!”<br/><br/>A command rang out and all the combat members of the Dragon Palace flew into the Dragon Cave.<br/><br/>Even Xiao Lan and the small house entered the dragon cave directly.<br/><br/>Although Xiao Lan’s small house was huge, it was easy to fit into the Dragon Cave.<br/><br/>“Sky Array, set up the summoning altar at the bhang Liu He!”<br/><br/>Wang Xian ordered the sky array.<br/><br/>“It’s the Dragon King!”<br/><br/>The sky array nodded. Once he entered the Dragon Palace, he was immediately teleported to the Dragon Palace, which was located on a planet of bhang Liu He.<br/><br/>The crescent moon planet was the name of this planet.<br/><br/>The planets of bhang Liu he that established the Dragon Palace were the most prosperous planets here.<br/><br/>The same was true for the crescent moon planet. The entire planet had a population of ten billion. In bhang Liu he, it was considered a planet with a relatively large population.<br/><br/>The sky array flew out from the Ocean Dragon Palace and immediately flew into the void.<br/><br/>He waved his arm and immediately set up an altar to summon demons with his blood.<br/><br/>“Buzz!”<br/><br/>The altar trembled slightly and was completed!<br/><br/>He moved and immediately flew into the distance.<br/><br/>“Boom!”<br/><br/>The next moment, a huge dragon cave appeared in the sky above the crescent moon planet.<br/><br/>The huge dragon cave was even bigger than the crescent moon planet.<br/><br/>“Why is the Sky Dark!”<br/><br/>“Why is there a huge thing suddenly appearing in the sky above us? What is this thing?”<br/><br/>“Hiss, what’s the situation?”<br/><br/>The people on the crescent moon planet suddenly felt that the sky had completely darkened. When they saw the huge dragon cave in the sky, their faces revealed a look of fear.<br/><br/>Boom! Boom! Boom<br/><br/>The Dragon Cave roared and flew toward the depths of the desolate land.<br/><br/>“Hiss, look at the position in front of us. That is the statue of the Divine Dragon. Is this the war machine of the Dragon Palace?”<br/><br/>“What a terrifying power! Such a huge aura! It can crush a planet directly!”<br/><br/>“What are the Dragon Palace doing? This is the first time the dragon palace has displayed such a terrifying war machine!”<br/><br/>All the people on the crescent moon planet watched in shock.<br/><br/>In the next moment, something even more shocking happened. The Dragon Cave disappeared before their eyes at a terrifying speed.<br/><br/>Such a speed was shocking.<br/><br/>The news of the Dragon Palace’s war machine appearing in the eight desolates and six directions spread like wildfire across the bright starry sky.<br/><br/>“Eight-limbed demon fiend, go and gather with the two races. We will start the war in the void in front of the nine obliteration planet!”<br/><br/>Wang Xian stood at the front of the Dragon Cave and instructed the eight-limbed demon fiend.<br/><br/>“It’s the Dragon King!”<br/><br/>The two of them nodded and took out their communication stone plates. They immediately flew towards the two tribes.<br/><br/>The Dragon Cave was shuttling through the eight desolation six directions. Such a huge object was exceptionally eye-catching and shocked countless people.<br/><br/>At the glazed domain, when the governor and the other Celestial Emperors received the news, they immediately rushed towards the eight desolation six directions.<br/><br/>Saint Realm Hong Fengyan also flew towards the eight desolation six directions through the teleportation array.<br/><br/>With the speed of the Dragon Cave, they quickly arrived in front of the nine annihilation planet. The incomparably large dragon cave stopped in the void.<br/><br/>The arrival of the dragon cave caused the citizens of the nine annihilation planet to be filled with shock.<br/><br/>“What’s the situation? are those the war machines of the Dragon Palace? How terrifying!”<br/><br/>“What are the Dragon Palace doing here? Could it be that experts from the center of the universe have arrived?”<br/><br/>Everyone looked on in astonishment.<br/><br/>“With the speed of their advance army, they will take ten hours to reach us.”<br/><br/>An lie went out for a stroll and transmitted the information in real time.<br/><br/>Wang Xian and the rest nodded after hearing that.<br/><br/>The advance army of the three-eyed race and the four-armed race was not the normal army of the two major forces. Instead, it was a mixed force.<br/><br/>If tens of thousands of people flew over, they would need to consider the godly monarch realm experts, so their speed was not very fast.<br/><br/>Now, the Dragon Palace had completely figured out the situation of the enemy.<br/><br/>They were only waiting for their arrival.<br/><br/>“We’re here. Let’s Go!”<br/><br/>Two hours later, in the teleportation array on the nine annihilation planet, glazed domain Lord and the other godly monarchs rushed over through the teleportation array. They raised their heads and looked at the Dragon Cave in the void.<br/><br/>“This seems to be a modification of the Demon Cave!”<br/><br/>“This Dragon Cave is dozens of times bigger than the level three demon cave of the godly monarchs of the Void!”<br/><br/>Upon seeing this dragon cave, they felt a chill in their hearts. They looked at each other and flew up.<br/><br/>“A godly monarch is here!”<br/><br/>The citizens of the nine annihilation planet could feel a solemn atmosphere at this moment.<br/><br/>“Dragon King!”<br/><br/>“Dragon King!”<br/><br/>In front of the Dragon Cave, the governor and the rest flew over. When they saw Wang Xian standing at the entrance, they immediately called out respectfully.<br/><br/>“Huh?”<br/><br/>Wang Xian looked at them and raised his eyebrows slightly.<br/><br/>“Dragon King, we heard that the Dragon Palace is in danger. We are here to provide support!”<br/><br/>The governor bowed and said to Wang Xian.<br/><br/>Now, when they learned that the Dragon King had easily killed an expert from the center of the universe, they became even more respectful.<br/><br/>“Hehe, there’s no need.”<br/><br/>Wang Xian swept his gaze across them and shook his head.<br/><br/>“This… The Dragon Palace has done us a favor. We would like to contribute a little!”<br/><br/>The governor and the rest pursed their lips and spoke after a moment of hesitation.<br/><br/>“We appreciate your kindness. However, with or without your help, there won’t be much of a change.”<br/><br/>Prime Minister Gui said to them.<br/><br/>“What?”<br/><br/>They were slightly surprised by his disdainful words.<br/><br/>“Go back. We don’t need your help!”<br/><br/>Tian Chen also smiled.<br/><br/>“Well…”<br/><br/>The domain Lord and the others didn’t know what to say.<br/><br/>“You can watch from the back. Our Dragon Palace can’t hold them back anymore. It’s useless to have a few more of you!”<br/><br/>Mou Zesen glanced at them.<br/><br/>Around them, the group of experts from the Dragon Palace also revealed a friendly smile as traces of power were emitted.<br/><br/>Hiss..<br/><br/>A sudden trace of power caused their bodies to stiffen. The domain Lord and the rest widened their eyes and looked behind Wang Xian as well as the surroundings.<br/><br/>There were seven to eight thousand members standing at the entrance of the Dragon Cave. When they swept their gaze across, they could sense that none of them were weaker than a first-level divine emperor.<br/><br/>Seven to eight thousand members of the Dragon Palace all had the strength of a divine emperor?<br/><br/>They inhaled a breath of cold air. The shock on their faces could not be any greater!<br/><br/>They were speechless for a moment!<br/><br/>“Then… then we shall wait for the Dragon Palace to defeat the enemy from behind!”<br/><br/>The governor and the rest smiled bitterly.<br/><br/>There were seven to eight thousand divine emperors of the Dragon Palace. It would not affect them at all.<br/><br/>“Okay!”<br/><br/>Wang Xian nodded and waved his arm at the governor.<br/><br/>“All of you can watch from the side. This is a war between the Dragon Palace. If we are defeated, all of you should stay out of it.”<br/><br/>Some of the life force liquid entered the governor’s body directly.<br/><br/>The person who was severely injured by Yao Xie was recovering quickly.<br/><br/>“Thank you, Dragon King!”<br/><br/>The governor’s body trembled and he bowed with excitement.<br/><br/>“Let’s go. We will watch from the back!”<br/><br/>He spoke to the celestial emperors behind him and flew towards the nine annihilation planet.<br/><br/>Wang Xian’s gaze swept past them and continued to look at the void in front of him.<br/><br/>“Dragon King, the eight-limbed demonic fiend has already joined up with the two large tribes!”<br/><br/>At this moment, Prime Minister GUI reported.\t\t\t\t\t\t</div>", "images": {}, "success": true}