{"id": 4, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15067242.html", "title": "Chapter 2990 - Chapter 2990: Dragon Palace Vs Universe Central Race 1", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 2990 - Chapter 2990: Dragon Palace Vs Universe Central Race 1</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 2990: Dragon Palace vs Universe Central Race 1<br/><br/>“Elder Qian, you’re finally here!”<br/><br/>In the desolate space, rocks and decaying ancient buildings floated in the air.<br/><br/>Ba Qi, who was staying on Deacon Qian’s body, looked at the army in front of him. His eyes flashed and he immediately flew over.<br/><br/>“Deacon Qian, you’ve made a great contribution this time. What’s the situation now?”<br/><br/>The four-armed race’s elder Hu and the others smiled when they saw Ba Qi flying over.<br/><br/>“Elder Hu, the situation is not good. When I flew over here, the three-eyed race’s deacon also flew in the other direction. I feel that the three-eyed race’s people should have come in too!”<br/><br/>Ba Qi frowned slightly and said.<br/><br/>“Oh? Are they here too?”<br/><br/>Elder Yi narrowed his eyes and a cold expression appeared in his eyes.<br/><br/>“How is the situation on the other side?”<br/><br/>Elder Yi asked.<br/><br/>“The situation on the other side is not good either. Xiao Heshan and his group of stupid things are now trapped in an arcane realm. We can’t even contact them now!”<br/><br/>“This is the last message he sent!”<br/><br/>As Ba Qi spoke, he took out the communication stone plate and handed it to Elder Gong.<br/><br/>“What happened to the other disciples?”<br/><br/>Elder Gong’s expression changed as he frowned and asked.<br/><br/>“Xiao Heshan and the rest led a group of disciples and people from the three-eyed race to attack the Dragon Palace. I was holding back the deacon from the three-eyed race. Everything was going smoothly. With our strength, we could completely suppress the Dragon Palace.”<br/><br/>“But the information we received was completely wrong. The Dragon Palace has about 100 divine emperors and a huge war machine that can fight against a level-four divine emperor.”<br/><br/>“Although the Dragon Palace is still not a match for Xiao Heshan and the others, they were led into a secret realm by the people of the Dragon Palace. It should be a secret realm built by the Mohan clan. It hasn’t come out yet!”<br/><br/>Ba Qi said to Elder Gong.<br/><br/>“Can they fight against a level four divine emperor? It seems that the dragon palace is not very weak. Can we confirm whether they really have a divine dragon?”<br/><br/>Elder Gong frowned slightly and asked.<br/><br/>“Elder, the Dragon Palace is not very strong. It is only a level four divine emperor. If it was not for the deacon of the three-eyed race, I could have destroyed the Dragon Palace alone.”<br/><br/>Ba Qi said, not caring about the dragon palace at all. He glanced behind him as he spoke.<br/><br/>“Elder, with our strength, we can easily destroy the dragon palace several times!”<br/><br/>“I’m not sure if there’s a pure-blooded divine dragon in the Dragon Palace, but I’m sure that they have a quasi-dragon with the bloodline of the Divine Dragon!”<br/><br/>He added with a smile.<br/><br/>“Even a sub-dragon is a great opportunity for us!”<br/><br/>Hearing his affirmation, elder Gong’s eyes lit up.<br/><br/>“Hahaha, Elder Gong, I’ll get you a sub-dragon Mount!”<br/><br/>Ba Qi said with a laugh.<br/><br/>“Hehe, we still have the three-eyed race as our opponent. We can’t be careless!”<br/><br/>Elder Gong’s face was full of smiles. Although he didn’t respond directly, he patted Ba Qi’s shoulder happily, “You’ve made a great contribution this time. The race won’t forget your contribution.”<br/><br/>“Congratulations to Deacon Qian this time!”<br/><br/>“Deacon Qian’s luck is really good!”<br/><br/>Beside him, a few deacons said enviously.<br/><br/>Ba Qi spoke a few words politely and followed in front of elder Ji to lead the way.<br/><br/>Ba Qi had completely integrated into the four-armed tribe. Elder Ji and the rest didn’t have the slightest doubt.<br/><br/>At the same time, at another location, Mo Sha was standing in front of the three-eyed tribe’s advance troops. He was chatting and laughing with an elder from the three-eyed tribe.<br/><br/>The advance troops from the two major races were flying rapidly in the direction of Wang Xian and the rest.<br/><br/>As there were many celestial king level disciples, their speed was not very fast.<br/><br/>“Dragon King, the four-armed race should be the first to arrive. However, the three-eyed race has also increased their speed under Mo Sha’s guidance. Both parties should arrive at our location within two minutes!”<br/><br/>A few hours later, an lie reported the information one by one non-stop.<br/><br/>“All of them will arrive in half an hour, right?”<br/><br/>Wang Xian narrowed his eyes slightly!<br/><br/>An lie nodded his head.<br/><br/>“Everything has been set up!”<br/><br/>The Heaven Array said from the side.<br/><br/>“Most of the powerhouses of the Dragon Palace are hidden in the depths of the Dragon Cave. Xiao Lan’s little house is also hidden around the Dragon Cave!”<br/><br/>Prime Minister Gui said with a smile.<br/><br/>“Success or failure depends on this one move. Whether we can gain some time for development depends on this battle!”<br/><br/>Wang Xian mumbled as he stared ahead.<br/><br/>Half an hour passed very quickly. Wang Xian stared ahead with a twinkle in his eyes.<br/><br/>Time passed little by little.<br/><br/>At the back of the Dragon Cave, on the nine annihilation planet, many people were looking over curiously.<br/><br/>The domain Lord and the other celestial thearchs were also staring at them closely.<br/><br/>Boom! Boom! Boom<br/><br/>Half an hour later, waves of powerful aura came from the void in front of them. When everyone felt this aura, their expressions changed drastically.<br/><br/>“They’re here!”<br/><br/>Wang Xian stood on the Dragon Cave and stared at the front.<br/><br/>An army of 100,000 people was flying over. Although it looked a little loose, that aura was not to be underestimated.<br/><br/>Especially at the front, the aura of a rank six void God Emperor was not hidden at all.<br/><br/>There were five to six rank five void God emperor experts around him.<br/><br/>“Oh? Interesting, interesting. I didn’t expect the Dragon Palace to be waiting for us here. Hahaha, Elder Gong, perhaps the dragon palace is welcoming us to surrender!”<br/><br/>“Elder, let’s take advantage of the three-eyed race’s absence to settle the Dragon Palace!”<br/><br/>It was the four-armed race. Ba Qi stared ahead and laughed loudly as he spoke to Elder Gong.<br/><br/>Elder Gong’s eyes also revealed a trace of excitement.<br/><br/>His gaze stared at the Dragon Cave ahead as his eyes sparkled.<br/><br/>“Everyone, Show your might!”<br/><br/>Elder Gong ordered in a deep voice.<br/><br/>“Yes!”<br/><br/>All the members of the four-armed race shouted loudly.<br/><br/>“Boom! Boom! Boom!”<br/><br/>In an instant, everyone erupted with an incomparably powerful aura, causing the entire void to change color.<br/><br/>A stifling aura directly charged forward.<br/><br/>“Hiss!”<br/><br/>At this moment, even the people of the distant nine annihilation planet had extremely pale faces, filled with terror.<br/><br/>Some of the god Lord experts flying in the Void had a huge change in expression, and their bodies trembled as they fell down.<br/><br/>“What… What kind of power is this? How can there be such a terrifying aura? Just how many God emperors are able to unleash this?”<br/><br/>“The experts at the center of the universe are the experts at the center of the Universe!”<br/><br/>A horrified voice came from the citizens of some planets. They looked at the void in shock.<br/><br/>“Is that the people from the Dragon Palace up ahead? You have trapped the disciples of our four-armed race at the center of the universe in a secret realm. Do you know your crimes?”<br/><br/>At this moment, Deacon Qian, who was staying with Ba Qi, asked coldly.<br/><br/>“Four-armed race, may I ask why the Dragon Palace has offended you? You want to attack us!”<br/><br/>Prime Minister Gui looked at Ba Qi and started to act.\t\t\t\t\t\t</div>", "images": {}, "success": true}