{"id": 6, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15067244.html", "title": "Chapter 2992 - Chapter 2992: Dragon Palace Vs The Central Race Of The Universe 3", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 2992 - Chapter 2992: Dragon Palace Vs The Central Race Of The Universe 3</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 2992: Dragon Palace vs the central race of the Universe 3<br/><br/>“Bang!”<br/><br/>“Boom!”<br/><br/>A terrifying sound of attack rang out. It was a sudden attack and a sudden boom. The four-armed race’s elder Ren was also sent flying forward.<br/><br/>Compared to the three-eyed race’s eight elder, elder Ren was in a worse state.<br/><br/>This was because the eight-headed race brought along Wang Xian’s five elements millstone.<br/><br/>His full-strength attack and the five elements Millstone’s full-strength attack directly hit elder Ren, who had no time to react.<br/><br/>His head directly exploded.<br/><br/>The Five Elements Millstone’s attack directly hit his body.<br/><br/>The terrifying attack caused elder Yi’s body to directly collapse. He stared at Octaqi with wide eyes, which were full of disbelief.<br/><br/>How could this subordinate of his race, who was trying to please him, suddenly sneak attack him?<br/><br/>He didn’t understand.<br/><br/>The rest of the people couldn’t figure it out either.<br/><br/>“This is our chance!”<br/><br/>The Dragon Palace, which they had never paid attention to, and the Dragon Cave which they had never paid attention to.<br/><br/>At this moment, in the middle of the Dragon Cave, a fiery glow shot out from Wang Xian’s eyes.<br/><br/>This was their chance!<br/><br/>Regardless of whether it was the eight-limbed demon or the demonic fiend, the moment they attacked, the elders of the four-armed race and the three-eyed race were bombarded towards the empty space in the middle.<br/><br/>And the Dragon Cave’s attack was waiting for this moment!<br/><br/>“Attack!”<br/><br/>“Peng, Peng, Peng!”<br/><br/>The sky array by the side let out a low roar as the surroundings exploded.<br/><br/>That was the sound of the array formation covering the aura being destroyed.<br/><br/>“Weng!”<br/><br/>Following that, a wave of energy formed from the mouth of the dragon head in front of the Dragon Cave.<br/><br/>The destructive energy directly blasted towards the heavily injured four-armed race elders and three-eyed race elders.<br/><br/>This was the strongest attack of the Dragon Cave.<br/><br/>It was an attack that could kill a rank six void God Emperor.<br/><br/>This time, even though they were attacking two rank six void God emperor experts, their bodies were heavily injured.<br/><br/>Their current strength was not as strong as one at his peak.<br/><br/>This was especially so for elder Ren. His head had been shot by the eight-headed beast and he had been struck by the Five Elements Millstone. His injuries were very serious.<br/><br/>The current Five Elements Millstone was able to kill a rank five divine emperor by itself after being upgraded.<br/><br/>“Boom!”<br/><br/>Everything happened in an instant. The attack from the dragon head directly attacked elder Ren and the eighth elder.<br/><br/>“What! ?”<br/><br/>They were already injured by their subordinates’sudden attack. Their bodies were still in mid-air.<br/><br/>At this moment, a death threat enveloped their hearts.<br/><br/>The two of them turned their heads and their pupils contracted slightly. Their eyes revealed a look of shock.<br/><br/>“Buzz!”<br/><br/>Feeling this threat, the two of them did not hesitate and immediately wanted to escape.<br/><br/>However, at this moment, streaks of nine-colored light enveloped their bodies, causing their bodies to stiffen slightly.<br/><br/>From the nine-colored light, they could feel a binding force.<br/><br/>Normally, they would have been able to break free.<br/><br/>However, they were injured. Before they could break free, the attack that threatened their lives had already hit them!<br/><br/>“Damn it!”<br/><br/>The two people roared with bloodshot eyes. They didn’t understand why this was happening!<br/><br/>“Elder!”<br/><br/>“Elder!”<br/><br/>At this moment, all the powerful disciples from the three-eyed race and the four-armed race on both sides also reacted. Their faces were filled with fury.<br/><br/>“Damn the Dragon Palace, we’re going to destroy you!”<br/><br/>The Deacons of the two races roared angrily. When they saw the Dragon Palace’s attack, they immediately prepared to block it.<br/><br/>“Hehehe, you’re the ones who deserve to die!”<br/><br/>However, at this moment, the eight-limbed demon and the eight-limbed demon directly attacked them without the slightest scruple.<br/><br/>“You are courting death. You actually betrayed your race!”<br/><br/>When they saw the eight-limbed demonic fiend’s attack, everyone from the two races was burning with anger.<br/><br/>Since their attacks were stopped by the two of them, they could only attack the eight-limbed demonic fiend.<br/><br/>“Boom Boom Boom!”<br/><br/>“Boom Boom Boom!”<br/><br/>“Boom Boom Boom!”<br/><br/>“Ah Ah Ah!”<br/><br/>“F * CK F * CK F * CK F * CK F * CK F * ck!”<br/><br/>Terrifying sounds rang out, mixed with screams of pain.<br/><br/>It came from the center and the eight-limbed demon Fiend who was besieged.<br/><br/>The attack of the Dragon Cave covered elder Ji and the eighth elder, drowning them in an instant.<br/><br/>A scream came from there.<br/><br/>The eight-limbed Demon Fiend and the eighth elder were severely injured by the besieging attack, and they fled in the direction of the Dragon Palace in panic.<br/><br/>“Save the Elder!”<br/><br/>“Save the Elder First!”<br/><br/>Hearing the screams of the elder, the experts of the two big clans shouted in fear.<br/><br/>They hurriedly flew toward the center of the two big clans. When they saw the two figures, their expressions changed drastically.<br/><br/>“Yang Feng and the others must have been controlled. They deliberately set us up!”<br/><br/>Seeing that the elder only had one head left, a deacon shouted with an extremely embarrassed expression.<br/><br/>They flew over and immediately grabbed the eighth elder’s head.<br/><br/>“Cough cough, cough cough!”<br/><br/>The eighth elder of the three-eyed race was on the verge of death at this moment. He coughed and spat out a large amount of blood.<br/><br/>If it wasn’t for his tenacious vitality and the fact that he shared some of the attacks from the side, he would have already died.<br/><br/>But even so, this was the most serious injury he had ever suffered in his life.<br/><br/>He could barely fight anymore!<br/><br/>“Dragon Palace, I want you all to Die!”<br/><br/>At this moment, an angry roar came from the side.<br/><br/>Elder Ji of the four-armed race was floating in the air, his whole body covered in blood.<br/><br/>There was a broken armor in front of him, and his whole body was trembling.<br/><br/>At this moment, he didn’t have the same power as before.<br/><br/>His sinister eyes were filled with hatred as he stared in the direction of the Dragon Palace!<br/><br/>“Kekekekekekekekekekekekekekekekekekekekekekekekekekekekekekekekekekekekekekekekekekekekekekekekekekekekekekekekekekekekekekekekekeke!”<br/><br/>At this moment, the eight-limbed demonic evil that was escaping toward the Dragon Cave tore open its host’s body. Fresh blood flowed from its body as it roared with a sinister face.<br/><br/>“They are indeed being controlled!”<br/><br/>The expressions of everyone from the four-limbed race and the three-eyed race changed when they looked over.<br/><br/>“The aura of life has already decreased. One is not at the second level of the divine emperor realm, and the other is not at the fifth level of the Divine Emperor Realm!”<br/><br/>On the Dragon Cave, Heaven’s formation looked at the detection stone plate with a smile on his face.<br/><br/>“You want us to surrender? You want to destroy us?”<br/><br/>Wang Xian also smiled when he heard Heaven’s formation’s words. He stared at all of them.<br/><br/>“Let’s give it a try then!”<br/><br/>As he spoke, the incipient saint wings appeared behind him and flew forward slowly.<br/><br/>“Roar! Roar! Roar!”<br/><br/>“Roar! Roar! Roar!”<br/><br/>The next moment, the Dragon’s roar came from the Dragon Cave. Nine Wind Divine Dragons swayed their huge bodies and rushed out of the Dragon Cave. They circled around Wang Xian.<br/><br/>“That’s a divine dragon!”<br/><br/>In the void in front of them, everyone from the two tribes was slightly stunned when they saw the appearance of the Wind Divine Dragon. Their eyes revealed an extremely heated expression.<br/><br/>Their faces revealed an excited expression.<br/><br/>“A divine dragon. It is definitely a divine dragon with an extremely pure bloodline!”<br/><br/>At this moment, even the eyes of the severely injured eighth elder and elder Ren were extremely heated.<br/><br/>“Do you think that you can destroy us just by scheming to kill us? Wishful Thinking!”<br/><br/>“If my guess is correct, that attack just now will take a very long time to be unleashed again!”<br/><br/>Elder Gong growled in a low voice with a cold expression.<br/><br/>“Don’t worry, the people from the Dragon Palace haven’t come out yet!”<br/><br/>Upon hearing his words, Wang Xian smiled contemptuously!<br/><br/>He waved his arm!\t\t\t\t\t\t</div>", "images": {}, "success": true}