{"id": 19, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15071939.html", "title": "Chapter 3005 - Chapter 3005: The Level Of The 3005 Treasure Was Divided Into The Acquired Spiritual Treasure", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 3005 - Chapter 3005: The Level Of The 3005 Treasure Was Divided Into The Acquired Spiritual Treasure</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 3005: The level of the 3005 treasure was divided into the acquired spiritual treasure<br/><br/>“Then hurry up and bring us there!”<br/><br/>When Ba Qi heard an Lie’s voice, his eyes were burning as he immediately urged him.<br/><br/>“Buzz!”<br/><br/>An lie glared at Ba Qi. Their bodies moved and they directly appeared in the interior of this blessed land.<br/><br/>At this moment, they were standing in front of a mountain peak. Beside them was a waterfall that fell from the sky.<br/><br/>The sound of the water flow made this place more lively.<br/><br/>If it weren’t for the weeds all around, this place would definitely be a fairyland!<br/><br/>“The array here is still operating, so there isn’t the slightest bit of dust here. Those few flowers on your waterfall!”<br/><br/>At this moment, the sky array suddenly pointed to the center of the waterfall next to it with an excited expression.<br/><br/>On the waterfall that had flowed for billions of years, there were a few flowers.<br/><br/>The colors of the flowers and the water flow were very similar. One would not be able to tell if one did not look carefully.<br/><br/>“Flowers that have been growing on the waterfall for billions of years?”<br/><br/>At the side, the sky array demonic ao crab and the rest looked at the waterfall with burning eyes and exclaimed.<br/><br/>“Let’s Go!”<br/><br/>Wang Xian and the rest moved and immediately flew toward the waterfall.<br/><br/>As they approached the few jade-blue flowers, a majestic life force was emitted. There was also a special energy emitted from these flowers.<br/><br/>“A flower at the peak of the celestial thearch level, the heart of Countercurrent!”<br/><br/>The Heaven Array stared at the four flowers and growled in excitement.<br/><br/>“There are four flowers at the peak of the celestial thearch level. Doesn’t that mean that the Dragon King will be able to achieve another breakthrough after swallowing them?”<br/><br/>Ba Qi and the rest could not help but speak.<br/><br/>“There shouldn’t be too much of a problem!”<br/><br/>Wang Xian nodded. His eyes were filled with excitement as well.<br/><br/>Four divine flowers at the peak of the celestial thearch level. Even if they couldn’t make a breakthrough, they would be on the verge of a breakthrough.<br/><br/>“The heart of countercurrent is extremely useful to wizards and body-tempering cultivators. It can be said to be a rare treasure. The conditions for nurturing such a treasure are very harsh. Furthermore, the nurturing period is very long. It may take hundreds of millions of years before one can obtain the heart of countercurrent at its mature stage. These four flowers have all matured!”<br/><br/>“This must have been planted by the Mohan clan when they were first exterminated. However, this divine flower is useless against us dragon wizards. We have the bloodline of the Divine Dragon.”<br/><br/>The Heaven Array said.<br/><br/>“Put it away first and continue the search!”<br/><br/>Wang Xian was in a good mood after obtaining such a precious divine flower the moment he entered.<br/><br/>With a wave of his arm, the heart of countercurrent entered Wang Xian’s body and landed in the Moon Bay by the ancient pond beside the ancestral tree of the Dragon Palace.<br/><br/>“Let’s continue in!”<br/><br/>Looking at where the treasure-seeking ant was pointing at, Wang Xian’s eyes were filled with anticipation. He immediately flew forward.<br/><br/>The entire grotto-heaven blessed land was not very big. It was only a few hundred kilometers in circumference. There were more than ten towering and huge mountains.<br/><br/>Each of the mountains had been transformed beautifully. One of the huge mountains was even carved into the shape of a human.<br/><br/>Treasures that had been at least at the divine emperor level and above had been found in a few of the peaks. There were even thousands of treasures at the divine king level.<br/><br/>However, these treasures were not of the same level as the four reverse flow heart divine flowers.<br/><br/>In fact, they were far inferior.<br/><br/>“At the very least, this is the residence of a supremacy. Why is it that the only precious treasure is the reverse flow heart? Where are the treasures at the supremacy level?”<br/><br/>After discovering the treasures of the highest divine emperor level, Ba Qi scratched his head and said with some disappointment.<br/><br/>“Let’s continue!”<br/><br/>Wang Xian smiled. Although he was still a little disappointed, he continued to fly towards the next mountain peak.<br/><br/>“Eh? The mountain peak in front is actually covered by a formation!”<br/><br/>When Wang Xian and the rest flew towards the mountain peak in front, they realized that the mountain peak was actually covered by a formation.<br/><br/>The powerful array formation made one’s heart palpitate.<br/><br/>“This is? It’s not just an array formation. There’s a three-layered defensive array formation and a space-locking array formation. This array formation can withstand attacks from those below the level of a universe knight. I don’t know why there’s another space-locking array formation!”<br/><br/>Tian Cheng frowned and said.<br/><br/>“There are treasures inside! And it’s an extremely powerful treasure!”<br/><br/>Upon hearing the words of the heaven formation, Wang Xian looked at the glow on the tentacles of the treasure-seeking ant on his shoulder. His eyes sparkled.<br/><br/>“Leave it to me!”<br/><br/>An Lie’s eyes lit up. His body moved and he teleported forward.<br/><br/>“Dragon King, this is a graveyard!”<br/><br/>A few seconds later, an lie flew out from the graveyard and said to Wang Xian and the rest with a face full of surprise.<br/><br/>“Let’s go in and take a look!”<br/><br/>Wang Xian and the rest were slightly shocked and entered immediately.<br/><br/>“Mo Han Ghost Residence!”<br/><br/>“Mo Han Ghost Tomb!”<br/><br/>After entering the formation, there were two rows of carved words on the entrance of the mountain peak.<br/><br/>The first row of words seemed to be much older than the second row.<br/><br/>“Mo Han Ghost Tomb? The owner of this place is called Mo Han Ghost Tomb?”<br/><br/>Tian Cheng mumbled.<br/><br/>Wang Xian looked ahead. He opened his dragon eyes and walked into the tomb.<br/><br/>“Dragon King, be careful. Usually, the strong ones will leave some restrictions in their own tomb before they die to prevent others from disturbing them. An lie, go and scout the way!”<br/><br/>Tian Cheng reminded him.<br/><br/>“D * mn, Tian Cheng, you are so heartless!”<br/><br/>An Lie’s face turned black when he heard Tian Cheng’s words. However, he still went to Wang Xian immediately.<br/><br/>“Although your strength is weak, with your current reaction speed, you will be able to dodge the attack of the venerable one in an instant if you are prepared!”<br/><br/>Tian Chen smiled.<br/><br/>An lie led the way in front while Wang Xian and the rest followed behind.<br/><br/>After entering the cave entrance of the mountain peak, there was a reception room. There were some things placed inside. Other than some cutlery, there was nothing else.<br/><br/>The items that should have been hanging on the wall had long disappeared.<br/><br/>They sized up the reception room and did not find any treasures.<br/><br/>Behind the reception room, there was a staircase that led up.<br/><br/>Wang Xian and the rest came to the staircase and headed upstairs.<br/><br/>On the second floor, it was the living area. It was a spacious room. It was slightly empty and many items had obviously been moved away.<br/><br/>There was also a staircase in the living area on the second floor that led to the top.<br/><br/>“It should be up there!”<br/><br/>Wang Xian looked at where the treasure-seeking ant was pointing and continued to walk upstairs.<br/><br/>When he entered the second floor, he suddenly felt that it was wider.<br/><br/>There were only three floors in the entire humongous mountain peak. This floor was at least a million meters tall.<br/><br/>It had an area of about ten kilometers.<br/><br/>“Dragon King, look at the center.”<br/><br/>At this moment, Ba Qi’s astonished voice rang out. Wang Xian and the rest looked over. There was a chair placed in the center. There was a figure on the chair.<br/><br/>The figure looked like a set of bones. He was sitting there quietly. There was no longer any sign of life.<br/><br/>“The owner of this place!”<br/><br/>Wang Xian and the rest saw him and flew over immediately.<br/><br/>When they arrived in front of the corpse, they were astonished.<br/><br/>An expert who had been dead for billions of years. Other than the fact that his flesh and blood had disappeared, his bones were still there. He was like an immortal metal with a hint of residual power.<br/><br/>A Universe Knight, an immortal corpse!\t\t\t\t\t\t</div>", "images": {}, "success": true}