{"id": 12, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15071925.html", "title": "Chapter 2998 - Chapter 2998: Reaching The Top Of The Tower Of Babel", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 2998 - Chapter 2998: Reaching The Top Of The Tower Of Babel</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 2998: reaching the top of the Tower of Babel<br/><br/>The Tower of Babel had 99 floors, and one would receive a reward for passing each floor.<br/><br/>As the trial tower for the disciples of the Mohan clan, not just anyone could enter.<br/><br/>Only wizards could enter, or they would be stopped by the formation.<br/><br/>The trial of the Tower of Babel was very simple.<br/><br/>The Mohan clan was a branch of the Wizards, and they were good at the formation of heaven and earth among wizards.<br/><br/>Their disciples and clansmen also focused on cultivating array formations.<br/><br/>Only by breaking the array formation could one obtain the corresponding rewards.<br/><br/>However, there was another requirement to enter the sky tower, and that was that one’s age could not exceed five million years old.<br/><br/>This was a huge threshold.<br/><br/>It was the Magus lineage of array formations, and one had to be younger than five million years old. At the age of five million years old, those whose array formation attainments could reach the first stage of the divine emperor realm were already considered the pampered children of the clan.<br/><br/>This caused the highest level of the Tower of Babel to be broken to the 55th level billions of years ago.<br/><br/>Even so, a large number of wizards entered the Tower of Babel. Even if they were unable to obtain some treasures, they could still try their luck here.<br/><br/>“Dragon King, is this our first target?”<br/><br/>An lie stared at the Tower of Babel in front of him, his eyes gleaming!<br/><br/>“That’s right, this is the place. The entire Tower of Babel is filled with spell formations. All sorts of restrictive spell formations are useless to you. Enter and take away the treasures inside!”<br/><br/>Wang Xian said with a smile.<br/><br/>“No Problem!”<br/><br/>An lie nodded confidently. Their bodies moved and they immediately flew towards the Tower of Babel.<br/><br/>Ten minutes later, they arrived at the bottom of the Tower of Babel.<br/><br/>In front of the huge tower of Babel, they felt extremely small.<br/><br/>“It’s really huge. Is this the power of a universe knight?”<br/><br/>Ba Qi couldn’t help but exclaim.<br/><br/>“A universe knight can’t build such a vast tower of Babel. Such a training ground was built by the entire Mohan clan. The number of paragons participating could be in the hundreds!”<br/><br/>Sky Array raised his head and said.<br/><br/>“The entrance is up ahead. An lie, we’ll wait for You Here!”<br/><br/>Wang Xian looked at an lie and said.<br/><br/>“It’s the Dragon King!”<br/><br/>An lie nodded and flew forward.<br/><br/>“Let’s wait for the good news here!”<br/><br/>Wang Xian smiled and waited quietly at the bottom of the tower.<br/><br/>“This tower of Babel is too difficult. God Emperor Hong Tian has already announced the method to break the array on the first 55 levels. I can only reach the 43rd level. I really don’t know how God Emperor Hong Tian managed to reach the 55th level back then!”<br/><br/>“Can you still compete with God Emperor Hong Tian? God Emperor Hong Tian was a pampered child who shocked the entire region back then. He broke through to the second level of the god Emperor realm at the age of five million. Now, he has already reached the peak of the god Emperor Realm!”<br/><br/>“I also don’t know why the Mo Han clan built such a monstrous supreme tower back then. According to historical records, even the disciples of the Mo Han clan could only reach the 70th floor!”<br/><br/>“Hehe, the Mohan clan is a bunch of lunatics. There are records that say that if the Mohan clan can reach the top of the Tower of Babel, they will become the young clan leader!”<br/><br/>There were quite a number of people around the Tower of Babel. The people who came in and out were all young faces.<br/><br/>Some voices of discussion could be heard.<br/><br/>Wang Xian and the rest were listening quietly at the side.<br/><br/>They had just arrived here and were not very familiar with the nearby factions.<br/><br/>Even if Wang Xian and Ba Qi knew a little, they had obtained some memories from the four-armed race and the three-eyed race.<br/><br/>Boom! Boom! Boom<br/><br/>However, at this moment, a rumbling sound was heard. A wave of energy was emitted from the entire Tower of Babel.<br/><br/>Light was emitted from the position above!<br/><br/>“What! Someone has reached the 56th level of the Tower of Babel!”<br/><br/>“Hiss, the 56th level of the Tower of Babel is lit up. Someone has actually broken the record set by the god Emperor Hong Tian!”<br/><br/>The sudden change caused many people around to raise their heads and look at the sky above the supreme tower in shock.<br/><br/>At the 56th level, a powerful ray of light shot out. This ray of light represented that someone had entered.<br/><br/>Ever since God Emperor Hong Tian had broken through to the 55th level, no one had gone up another level for hundreds of millions of years. However, it had appeared today.<br/><br/>“Boom Boom Boom!”<br/><br/>Just as everyone in the surroundings and the entire continent was shocked, the entire supreme tower trembled once again.<br/><br/>A dazzling light shot out from the position of the 57th level.<br/><br/>“This is impossible!”<br/><br/>When everyone saw the 57th level lighting up, their expressions changed drastically.<br/><br/>“How is this possible? He just broke through to the 56th level, and now the 57th level is lighting up?”<br/><br/>“Is there a problem with the Tower of Babel? To climb up two levels in such a short period of time, this is absolutely impossible!”<br/><br/>The surrounding youths roared in disbelief.<br/><br/>They had entered the Tower of Babel and knew how difficult it was to climb up one level.<br/><br/>Someone had used dozens of years to climb up one level.<br/><br/>Just how strong was he to be able to break through so quickly?<br/><br/>“Boom Boom Boom!”<br/><br/>But just as everyone was still in disbelief, the Tower of Babel shook once again.<br/><br/>The 58th floor lit up!<br/><br/>At this moment, everyone was stunned!<br/><br/>“Boom Boom Boom!”<br/><br/>“Boom Boom Boom!”<br/><br/>Not long after, the 59th floor lit up.<br/><br/>The 60th floor lit up.<br/><br/>…<br/><br/>Everyone in the surrounding area went crazy.<br/><br/>“Is there something wrong with the Tower of Babel?”<br/><br/>“It’s definitely something wrong with the Tower of Babel. Quick, let’s go in and take a look!”<br/><br/>Some of the young men around shouted in shock.<br/><br/>They immediately flew into the Tower of Babel.<br/><br/>“Boom! Boom! Boom!”<br/><br/>At the same time, all the experts within a few hundred light years immediately looked towards the Tower of Babel.<br/><br/>Their eyes were filled with shock.<br/><br/>The experts rushed over one by one, staring at the Tower of Babel in astonishment.<br/><br/>The booming sounds of the Tower of Babel were endless, and the layers of space emitted dazzling light.<br/><br/>Even if they were hundreds of millions of kilometers away, they could still see it clearly.<br/><br/>The experts flew over one by one, staring in front of them in shock.<br/><br/>“It’s the 85th floor. Is there a problem with the Tower of Babel?”<br/><br/>Layer after layer of light shone. No one would believe that someone was breaking the formation inside.<br/><br/>No one could break the formation at such a speed.<br/><br/>“Buzz!”<br/><br/>An old man who was emitting a powerful aura moved and flew towards the entrance of the Supreme Tower.<br/><br/>“It’s God Emperor Hong Tian! God Emperor Hong Tian is here too!”<br/><br/>Some young men looked at that figure with admiration.<br/><br/>God Emperor Hong Tian stared at the entrance of the Tower of Babel. A surge of formation energy appeared in front of him, blocking his path.<br/><br/>“The formation of the Tower of Babel is still operating. What Happened Up There?”<br/><br/>When God Emperor Hong Tian saw that he was blocked by the formation, his expression changed as he stared at the sky.<br/><br/>The layers of the Tower of Babel continued to light up, attracting the attention of countless people.<br/><br/>Wang Xian stood at the bottom of the tower. He scanned his surroundings and revealed a surprised expression.<br/><br/>He didn’t expect such a huge commotion. He also didn’t expect that so many experts would come.\t\t\t\t\t\t</div>", "images": {}, "success": true}