{"id": 14, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15071929.html", "title": "Chapter 3000 - Chapter 3000: 3,000 Had Broken Through To The Divine Emperor Realm!", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 3000 - Chapter 3000: 3,000 Had Broken Through To The Divine Emperor Realm!</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 3000: 3,000 had broken through to the Divine Emperor Realm!<br/><br/>“What is the situation inside the sky connecting tower?”<br/><br/>“Is there any omen of the sky connecting tower changing?”<br/><br/>At the center of the Mo Han clan ruins, around the sky connecting tower, countless experts gathered and sized up the entire sky connecting tower.<br/><br/>Many experts frowned as their expressions changed.<br/><br/>From the outside, they could not see what was happening inside the sky connecting tower!<br/><br/>The Tower of Babel, which was built by the Mohan clan, would collapse if they forced their way in.<br/><br/>No one would do such a thing.<br/><br/>“Dragon King, increase your strength first. We will protect you here!”<br/><br/>On the 99th level of the Tower of Babel, the eight-headed ao demonic ao crab and the others spoke to Wang Xian.<br/><br/>“Alright, I will break through my current Realm First!”<br/><br/>Wang Xian nodded and smiled.<br/><br/>He waved his arm and opened all the jade bottles. The pills inside were poured into his mouth.<br/><br/>A large number of pills were swallowed and quickly converted into Dragon Energy.<br/><br/>Eight rays of light shot out from Wang Xian’s body. The Five Elements Millstone spun on its own and hovered above his head. The yin-yang Dragon Disk was like an ink-and-ink painting as it spun around him.<br/><br/>Waves of majestic dragon might shot out in all directions.<br/><br/>At the side, the eight-headed ao Yao and the rest were quietly guarding by the side.<br/><br/>The heaven array was holding the ancestral portrait and learning the array formation and sorcery inside.<br/><br/>“Ding! Congratulations to host for increasing your level and breaking through to the Celestial Thearch Realm!”<br/><br/>“Ding! Host has broken through to the celestial thearch realm and has comprehended the nomological divine ability, Dragon Eye Lock!”<br/><br/>“Boom!”<br/><br/>The Dragon King stood there with his eyes closed. After swallowing a large number of medicinal pills, the system’s voice sounded beside his ears.<br/><br/>Powerful auras shot out from his body.<br/><br/>“Roar Roar Roar!”<br/><br/>Dragon roars came from his body, and eight rays of light shot out in all directions.<br/><br/>He slowly opened his eyes, and a world of Yin, yang, five elements, and hurricane appeared in his dragon eyes.<br/><br/>It was as if his eyes could seal off the entire world, causing one’s heart to palpitate.<br/><br/>“What a powerful aura!”<br/><br/>“The Dragon King’s improvement this time is huge!”<br/><br/>From the side, the eight-headed ao Yao and the rest immediately looked over. Their faces revealed a look of reverence.<br/><br/>“Hu!”<br/><br/>Wang Xian took a deep breath and began to restrain his aura.<br/><br/>Name: Wang Xian<br/><br/>Race: Yin-yang Five Elements Divine Dragon (man-dragon unity)<br/><br/>Level: void God Emperor Level 1(eighth form of the Divine Dragon Transformation)<br/><br/>Origin: 332123960/5000000000000<br/><br/>Supernatural ability: ruling the water tribe (ruling the water tribe below one’s own level)<br/><br/>Devouring living beings (devouring living beings to extract the origin)<br/><br/>Control of the five elements<br/><br/>Cultivation Method: Divine Dragon Transformation<br/><br/>Supernatural ability: soul-capturing, spirit-attaching<br/><br/>Law supernatural ability: Dragon’s eyes lock on all corners of the world<br/><br/>Aspect: five elements great mill, Dragon Kingdom in the palm, Dragon head under the heavens, Dragon body of ten thousand miles, yin and yang poles, yin and Yang Five Elements Alms Bowl, divine dragon tail swing!<br/><br/>Control Law: metal, wood, water, fire, Earth, light, dark wind<br/><br/>Divine Kingdom: Dragon Palace<br/><br/>Dragon Palace owned: Level 9.<br/><br/>Dragon Palace members: 1032450<br/><br/>Looking at the information in his mind, he revealed a smile.<br/><br/>“I’ve finally broken through to the realm of the Celestial Thearch!”<br/><br/>Wang Xian mumbled as he touched his eyes.<br/><br/>Laws and Abhijna were the strongest offensive means of the celestial thearch.<br/><br/>They could condense the laws into abhijna and possessed unfathomable abilities.<br/><br/>Wang Xian’s breakthrough this time was related to the Abhijna of the dragon’s eyes.<br/><br/>The Dragon’s eyes could lock all corners!<br/><br/>After casting it, eight Divine Dragon Phantoms would fly out from the dragon’s eyes. They were the Yin-yang five elements and the wind divine dragon.<br/><br/>The eight divine dragons sealed a space and could attack.<br/><br/>In this space, the enemy could not escape directly. Without breaking through the space, they could not return to their divine kingdom in an instant.<br/><br/>It was similar to the formation set up by the Heaven Formation, but it was even more terrifying.<br/><br/>“The combat strength of a celestial emperor at the peak of Level Seven!”<br/><br/>Wang Xian’s body trembled slightly as a mighty force spread out in the surroundings.<br/><br/>“Congratulations, Dragon King!”<br/><br/>On the side, the eight-headed ao ao demon crab, an lie, and the others congratulated him.<br/><br/>The Heaven Array also opened its eyes to congratulate him.<br/><br/>“If there’s nothing going on here, let’s go somewhere else!”<br/><br/>Wang Xian said with a smile on his face.<br/><br/>“It’s the Dragon King. Dragon King, Please Wait Here!”<br/><br/>An lie nodded and disappeared instantly.<br/><br/>In less than ten seconds, he returned.<br/><br/>“Dragon King, let’s Go!”<br/><br/>In the next moment, they appeared in the void more than 200 million kilometers away from the supreme tower.<br/><br/>An lie put away the altar in the void and looked in the direction of the Supreme Tower in surprise.<br/><br/>“So many people. It seems that there was quite a commotion just now!”<br/><br/>He said in surprise.<br/><br/>“It’s been a long time since anyone has been able to go to the next level of the Supreme Tower. Naturally, it caused a great stir when you reached the top directly!”<br/><br/>Tian Chen said with a smile.<br/><br/>“TSK TSK TSK!”<br/><br/>An lie looked over there with a smug smile on his face.<br/><br/>“Let’s go. Our next target will be those planets!”<br/><br/>Wang Xian said with a smile on his face.<br/><br/>A special existence like an lie was rarely seen in the entire universe.<br/><br/>“Hehe, Dragon King, watch my performance next!”<br/><br/>“I’ll go and scout the way for you guys first!”<br/><br/>An lie said with great interest. With a move of his body, he disappeared instantly.<br/><br/>Wang Xian and the rest flew toward the ruins.<br/><br/>Looking at the huge stars that were connected together, they were also extremely shocked.<br/><br/>The chaotic energy on these stars was covered.<br/><br/>Some places were safe, while others were extremely dangerous.<br/><br/>Some planets had already found a way to enter, while others were completely sealed off.<br/><br/>And the true core was located in the center of this group of planets. It was an incomparably huge continent, with eighteen continents forming a huge space.<br/><br/>999 stars guarded the center.<br/><br/>However, after billions of years of exploration, there was also a lot of news.<br/><br/>For example, one of the planets was used to grow the divine tree divine grass.<br/><br/>Another planet was used to rear desolate beasts.<br/><br/>Another Planet had a special river that had a special ability.<br/><br/>These three planets were very famous in the Mohan clan ruins, so no one had been able to enter.<br/><br/>Some people said that if they could enter, they would definitely obtain a lot of treasures.<br/><br/>Especially on the planet where the Mohan clan was used to plant the divine tree and grass, there would definitely be a lot of resources.<br/><br/>After exploring the surrounding planets, Wang Xian and the rest were preparing to enter the center.<br/><br/>…<br/><br/>“Three-eyed clan leader!”<br/><br/>“Four-armed clan leader!”<br/><br/>Just as Wang Xian and the rest were exploring the ruins of the Mohan clan, two huge factions met in the void where Wang Xian came out not too long ago.<br/><br/>Each force had about five million people. Some of them were riding on clouds, some were riding on powerful desolate beasts, and some were stepping on divine artifacts.<br/><br/>They were floating in the void and each of them possessed great supernatural powers.<br/><br/>Especially at the front, the three-eyed tribe leader was riding on a one-eyed and one-horned rhinoceros-like desolate beast.<br/><br/>The four-armed tribe leader was sitting cross-legged on a treasure lotus.<br/><br/>The leaders of the two large race factions had officially met.<br/><br/>Their arrival was all for the Resplendent Starry Sky’s Divine Dragon, for that powerful opportunity!\t\t\t\t\t\t</div>", "images": {}, "success": true}