{"id": 10, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15071921.html", "title": "Chapter 2996 - Chapter 2996: ’S Chance To Counterattack", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 2996 - Chapter 2996: ’S Chance To Counterattack</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 2996: ’s chance to counterattack<br/><br/>The Mohan clan was a primary race of the universe.<br/><br/>The center of the universe was huge, its area was billions of times bigger than the starry sky.<br/><br/>Just the ruins of the Mohan clan were hundreds of times bigger than the starry sky.<br/><br/>This was still part of the ruins, one could imagine how big the territory of the Mohan clan was.<br/><br/>Now that billions of years had passed, the Mo Han clan ruins still existed. In the territory around the Mo Han clan ruins, some people said that if any power could enter the Mo Han clan ruins, they could at least reach the level of a domain level race.<br/><br/>If a domain level race could obtain the treasures inside, they might be able to find the opportunity to step into the universe’s primary race.<br/><br/>At the center of the universe, reaching the universe’s primary race was a watershed, because reaching the universe’s primary race meant that a race had the power of inheritance.<br/><br/>This power of inheritance involved bloodline, cultivation, secret techniques!<br/><br/>The reason why the powerful races in the universe could continue to exist was because of the power of bloodline, cultivation, and secret techniques.<br/><br/>Many domain-level races gathered around the Mohan clan in order to take a step closer.<br/><br/>“Clan leader, this is bad. Our Divine Tablet of elder Yi has been broken. The Divine Tablet of Elder Yi’s clansmen has also been broken!”<br/><br/>Just as Wang Xian was sorting out the information about the Mohan clan’s races, in the center of the universe, two hundred thousand light years away from the ruins of the Mohan clan, there was a clan force, the four-armed clan.<br/><br/>The four-armed clan was not very strong in the nearby starry sky. They were at the lowest level in the center of the universe.<br/><br/>In a towering and majestic mountain range of the divine tree, a middle-aged man entered a cultivation room in a panic and reported anxiously.<br/><br/>“Eh? Elder Hu’s divine token broke?”<br/><br/>The eyes of the old man who was sitting cross-legged on the cultivation futon froze. His eyes were cold as he stood up immediately.<br/><br/>“Yes, clan leader. All the clan members who went to the inner space of the Mohan clan’s clan had their divine plates shattered!”<br/><br/>“This… this is very likely the work of the three-eyed clan!”<br/><br/>The middle-aged man bowed and said.<br/><br/>A divine plate represented a person’s life plate. Once the divine plate was shattered, it also meant that the person had already died.<br/><br/>Buzz<br/><br/>The clan leader of the four-armed clan was expressionless. He waved his arm, and a strange black mirror appeared in his hand.<br/><br/>With a wave of his arm, the mirror spun and a scene slowly appeared on it.<br/><br/>In the scene, elder Yi was killed by a youth. There was a group of people around the youth as well as some desolate beast-like creatures.<br/><br/>The four-armed race Patriarch’s eyes flashed with a black light as he stared at the death mirror. Beside him, he saw a head with three eyes on it.<br/><br/>“It wasn’t done by the three-eyed race. They died in that starry sky.”<br/><br/>The scene in the death reflection mirror slowly disappeared as the four-armed race leader said with a twinkle in his eyes.<br/><br/>“What? The people in that starry sky did it? Didn’t the information we received say that the starry sky was very weak? There are less than a hundred divine emperor experts?”<br/><br/>The middle-aged man was slightly shocked.<br/><br/>Although the four-armed race’s vanguard army was not strong, they had elder Yi holding down the fort. Elder Yi was a divine Emperor Tier-6 expert.<br/><br/>To be able to keep a level six divine emperor behind meant that the other party was very likely to have a level seven divine emperor expert.<br/><br/>“Contact the three-eyed race and talk to them about the matter of that starry sky. The three-eyed race has the eye of the undead, so we’ll be able to obtain more information!”<br/><br/>The four-armed race’s patriarch said.<br/><br/>“It’s the Patriarch!”<br/><br/>The middle-aged man immediately replied and left the cultivation room!<br/><br/>“Interesting, he’s growing so fast. The Divine Dragon Inheritance? Or the Mohan clan inheritance?”<br/><br/>The four-armed clan leader’s eyes were shining as he looked at the information beside him.<br/><br/>It was the detailed information of the development of the Dragon Palace.<br/><br/>However, this information didn’t match the strength of the Dragon Palace at all.<br/><br/>However, according to the speed of development in the information, it was possible.<br/><br/>“The eye of the dead spirit reflects the images of the dead creatures. The three-eyed race should be able to get more information.”<br/><br/>“It’s a pity that they were careless and did not have a way to enter the entrance of the starry sky. Otherwise, they could have sent people to investigate in secret.”<br/><br/>He muttered as he waved his four strong arms and fell into deep thought.<br/><br/>As the leader of a race, his courage, temperament, and ability to deal with danger were not something ordinary divine emperors could compare to.<br/><br/>…<br/><br/>“Dragon King, we have completed our upgrade!”<br/><br/>In the Dragon Palace’s Dragon King Hall, Ao Yao, Ao he, and the others flew over with smiles on their faces.<br/><br/>In half a month’s time, they had completed their breakthrough. Ao he had also achieved a breakthrough after devouring two Divine Emperors’level-six divine kingdoms.<br/><br/>Currently, there were four divine emperors’level-six members in the Dragon Palace.<br/><br/>“This is the information that I have compiled over the past half a month. Take a look first. After you are done, we will head to the two exits immediately.”<br/><br/>“An lie, take a look too!”<br/><br/>Wang Xian passed all the information that he had been organizing for the past half a month to them.<br/><br/>“This is the information regarding the Mohan clan’s racial ruins. Our Bright Starry Sky is already at the edge of the ruins. Although we can explore the Mohan clan’s ruins bit by bit, we are not clear about the situation here.”<br/><br/>“So this time, we will enter the Mohan clan’s ruins from the direction of the center of the universe. At the center of the universe, many people have already made a detailed exploration of the Mohan clan. Many of the Mohan clan’s treasure lands have been locked down by them, but no one can enter!”<br/><br/>“We can enter through an lie!”<br/><br/>Wang Xian said to them.<br/><br/>“Don’t worry, Dragon King. As long as I, an lie, am here, any formation will be useless. Hehe!”<br/><br/>An lie said confidently.<br/><br/>Wang Xian smiled and nodded. He watched them quietly as they searched for information.<br/><br/>“Dragon King, we can set off now!”<br/><br/>An hour later, Tian Cheng, the eight-headed ao monster and the rest looked at each other and said.<br/><br/>“Alright, Tian Cheng, pass the prepared array altar to an lie. An lie, bring us there!”<br/><br/>Wang Xian nodded immediately.<br/><br/>“No Problem!”<br/><br/>An lie replied immediately and took over a thousand altars from Tian Cheng.<br/><br/>This kind of altar was a method to summon demons. It was fixed on the array by Tian Cheng.<br/><br/>As long as he was placed in one place, an lie would be able to teleport there instantly.<br/><br/>An lie himself could teleport, but if he wanted to teleport with others, he had to have a summoning altar, and he could only teleport people to the top of the summoning altar.<br/><br/>Although it was inconvenient, this ability was still very abnormal.<br/><br/>Without an Lie’s ability, it would be very difficult for the Dragon Palace to improve quickly.<br/><br/>An lie left. In less than five minutes, he returned to the Dragon King’s palace.<br/><br/>“Dragon King, let’s Go!”<br/><br/>An lie spoke and enveloped Wang Xian and the rest. They disappeared instantly.<br/><br/>The next moment, they appeared at the entrance where the four-armed race had entered.\t\t\t\t\t\t</div>", "images": {}, "success": true}