{"id": 17, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15071935.html", "title": "Chapter 3003 - Chapter 3003: Arrest Warrant", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 3003 - Chapter 3003: Arrest Warrant</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 3003: arrest warrant<br/><br/>“Ka Ka Ka Ka!”<br/><br/>Inside the Divine Garden Star, God Emperor Hong Tian waved his arm, and many disks floated in the void. He stared coldly at the void.<br/><br/>In the next moment, many images appeared in the void, and the images were very blurry.<br/><br/>“Oh? You have some ability!”<br/><br/>God Emperor Hong Tian looked at the extremely blurry images and frowned. His expression was slightly embarrassed.<br/><br/>With a wave of his arm, God stones were injected into the picture. With the injection of energy, the picture gradually became clear.<br/><br/>However, the clarity was very low. It was hard to tell if it was a man or a woman.<br/><br/>“Weng!”<br/><br/>“Acquired spiritual treasure, origin magnetic light ring”<br/><br/>God Emperor Hong Tian took out his most precious treasure with a gloomy face.<br/><br/>Origin magnetic light ring!<br/><br/>Even universe knights might not have such a treasure.<br/><br/>“Zi Zi Zi!”<br/><br/>A mirror-like light ring appeared above his head, and the pattern in front of him gradually became clear.<br/><br/>One figure after another appeared in front of him, causing God Emperor Hong Tian to reveal killing intent in his eyes.<br/><br/>“You dare to kill my disciple, you are unforgivable!”<br/><br/>A terrifying killing intent shot out from his body. He stared at those figures, and with a wave of his arm, the scene was preserved.<br/><br/>“Since this place has already been discovered, then my plans can be brought forward. It’s a pity that there’s still a long way to go before I can make a breakthrough, and I can’t enter the insides of the Mo Han clan.”<br/><br/>“There’s no need to wait. I’ve used a hundred million years to accumulate and develop. Now, I control over a thousand planets belonging to the Mo Han clan. It’s enough!”<br/><br/>God Emperor Hong Tian muttered as his body moved and floated in the center of the planet.<br/><br/>“Gather all the disciples. I have something important to announce!”<br/><br/>A vast voice resounded throughout the entire divine garden planet. Soon, several hundred figures flew over.<br/><br/>“Master!”<br/><br/>The middle-aged elders bowed respectfully.<br/><br/>God Emperor Hong Tian did not speak. He stood there and waited quietly.<br/><br/>“Master!”<br/><br/>“Master!”<br/><br/>More and more middle-aged men flew over. Each of them was exuding a powerful aura.<br/><br/>Soon, more than ten thousand middle-aged men gathered here.<br/><br/>“Master, have you decided?”<br/><br/>Ten minutes later, three old men riding on cranes arrived. They were all white-haired and full of excitement.<br/><br/>“Eldest senior brother, second senior brother, third senior brother!”<br/><br/>Tens of thousands of middle-aged old men immediately called out respectfully to the three of them.<br/><br/>“Decision!”<br/><br/>Supreme god Hong Tian lightly nodded his head.<br/><br/>“Great, Great!”<br/><br/>The three of them revealed extremely excited expressions as they stood at the front.<br/><br/>“I have summoned all of you here to make an announcement. I will establish a race, a domain-level race. All of you will be the first batch of clansmen!”<br/><br/>Celestial Emperor Hong Tian announced indifferently when he saw all of his disciples arrive.<br/><br/>However, when he finished speaking, everyone’s bodies trembled. Their faces revealed an excited and shocked expression.<br/><br/>Their eyes revealed an incomparably hot expression. At the same time, waves of powerful might soared into the sky.<br/><br/>Over ten thousand people. The weakest among them was not lower than a celestial emperor fourth rank. All of them were powerful wizards.<br/><br/>The establishment of a faction and the establishment of a domain-level race. They knew what this meant in the universe!<br/><br/>However, with their master’s strength and their strength, they were able to establish a powerful domain-level race.<br/><br/>“We’ll start preparing for the specific matters in a month’s time. Apart from this, there’s another matter!”<br/><br/>As God Emperor Hong Tian spoke, he waved his arm, and a picture appeared in front of everyone.<br/><br/>“This group of people barged into our place and killed more than ten of your senior and Junior Brothers. They are wanted by the Mo Han clan. The strongest among this group of people has the strength of a seventh level God emperor. Once they encounter them, kill them!”<br/><br/>God Emperor Hong Tian said coldly.<br/><br/>“Yes!”<br/><br/>The group of disciples immediately replied.<br/><br/>“Follow me. There are some places in the Mo Han clan ruins that you haven’t been to before. In the future, this place will be our clan’s foothold!”<br/><br/>God Emperor Hong Tian said to all his disciples. He waved his arm and drew a teleportation formation.<br/><br/>…<br/><br/>Wang Xian and the rest, who were searching for the treasure, did not know that God Emperor Hong Tian had already detected them.<br/><br/>It was their first time entering the center of the universe. They did not know much about the means of the strong.<br/><br/>However, at this moment, Wang Xian received another piece of bad news.<br/><br/>“The planet where the Chinese and Chinese clans keep their desolate beast mounts has also been occupied!”<br/><br/>In the sky above the planet where they keep their desolate beast mounts, Wang Xian stared at the formations below and frowned slightly.<br/><br/>“What’s going on? Didn’t they say that no one has stepped into these planets yet? This damn planet has obviously been occupied by someone, and they even keep so many desolate beasts!”<br/><br/>Ba Qi said with a fragrant breath. His gaze was a little heated as he stared down below.<br/><br/>“Dragon King, why don’t we slaughter some weak desolate beasts? There are over ten thousand celestial thearchs here!”<br/><br/>He continued.<br/><br/>“To be able to occupy this place and raise so many desolate beasts, the forces of so many powerful desolate beasts are not something we can afford to offend!”<br/><br/>“Furthermore, it’s very likely that this place is occupied by celestial thearch Hong Tian!”<br/><br/>Heaven array shook his head.<br/><br/>Wang Xian nodded his head in agreement. It was not an exaggeration to say that the desolate beasts kept on this planet were stronger than the Dragon Palace.<br/><br/>This was because he could sense the aura of a level eight desolate beast of the god Emperor.<br/><br/>“Let’s go. We will leave this place immediately!”<br/><br/>Wang Xian said to an lie with a serious expression.<br/><br/>“Dragon King, shall we continue to explore the planets?”<br/><br/>An lie asked.<br/><br/>“Let’s go directly to the central continent. The core of the Mohan clan ruins is still the 18 continents in the center. Let’s go to one of the continents to take a look!”<br/><br/>The Heaven Array hesitated for a moment before saying.<br/><br/>“Alright!”<br/><br/>An lie nodded. With a move of his body, he disappeared immediately.<br/><br/>Passing through the powerful and messy formations, he continued to explore.<br/><br/>“Dragon King, I’ve found a continent. The distance is a little far. Fortunately, I have the ability to teleport. If I were to fly, I would need at least a year!”<br/><br/>However, an lie only returned after an hour and reported to Wang Xian and the rest.<br/><br/>“Have you found it? Very good!”<br/><br/>Wang Xian revealed an excited expression.<br/><br/>Within the territory of the Mohan clan, it would take a few decades for a divine emperor-level powerhouse to fly from one side to the other.<br/><br/>The universe was so vast that it would take half an hour for an lie to teleport back and forth. One could imagine how far the distance was.<br/><br/>However, the further the distance was, the better it would be for Wang Xian and the rest.<br/><br/>This was because the further the distance was, the fewer people would step into it. They might obtain more treasures.<br/><br/>“Let’s Go!”<br/><br/>Wang Xian said to him immediately.<br/><br/>“It’s the Dragon King!”<br/><br/>An lie nodded his head. The people from the heaven’s formation were also filled with interest.<br/><br/>Buzz<br/><br/>The next moment, their figures disappeared.<br/><br/>A vast continent appeared in their sight.<br/><br/>It was one of the eighteen continents in the center of the Mohan clan!\t\t\t\t\t\t</div>", "images": {}, "success": true}