{"id": 15, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15071931.html", "title": "Chapter 3001 - Chapter 3001: On The Occupied Godly Garden Star", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 3001 - Chapter 3001: On The Occupied Godly Garden Star</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 3001: on the occupied Godly Garden Star<br/><br/>“Four-armed race, don’t you know where the entrance is?”<br/><br/>The leaders of the two major powers of the race at the center of the universe looked at each other from a distance.<br/><br/>The leader of the three-eyed race stared at the leader of the four-armed race with a pitch-black pupil between his eyebrows.<br/><br/>“We were too careless. It seems that you were too careless to join us!”<br/><br/>The four-armed race leader sat cross-legged on the Golden Lotus and said indifferently.<br/><br/>“It’s not just the entrance. I saw that the Dragon Palace has thousands of God emperors. The rest of the members are also top-tier God Kings!”<br/><br/>The three-eyed race leader’s pitch-black eyes blinked and replied.<br/><br/>“Join forces!”<br/><br/>The four-armed race leader said directly.<br/><br/>“Join forces and find the entrance first. The Dragon Palace might not only obtain the inheritance of the divine dragon, but also the inheritance of the Mohan clan!”<br/><br/>The three-eyed clan leader looked at the ruins of the Mohan clan with a profound gaze.<br/><br/>“It’s very possible. Without the array formation of the Mohan clan, our people wouldn’t have been wiped out!”<br/><br/>The four armed race leader nodded.<br/><br/>“Find the entrance, we’ll split all the opportunities equally, do you have any objections?”<br/><br/>The three eyed race leader asked.<br/><br/>“Yes!”<br/><br/>The four armed race leader smiled and nodded.<br/><br/>“Start searching!”<br/><br/>The two race leaders looked at their millions of subordinates behind them and immediately ordered.<br/><br/>“Yes!”<br/><br/>The powerful warriors of the two races replied, quickly starting to search the surroundings.<br/><br/>As two major tribes that had stood firm for more than a billion years, they were able to stand firm in the center of the universe not because they were reckless, but because they were stable.<br/><br/>They were developing steadily. Looking at all the powerful tribes in the universe, they all had an endless history.<br/><br/>…<br/><br/>“Dragon King, we have entered the planet that used to grow the divine tree and divine grass!”<br/><br/>Wang Xian and the rest did not know that the two major tribes were searching for the entrance to the resplendent starry sky.<br/><br/>However, even if they knew, they wouldn’t care.<br/><br/>At this moment, in the ruins of the Mohan Room, an lie came to Wang Xian and the rest and said excitedly.<br/><br/>“Oh? Let’s go, bring us there!”<br/><br/>Wang Xian raised his eyebrows and said immediately with excitement in his eyes.<br/><br/>“It’s the Dragon King!”<br/><br/>An lie nodded and their figures disappeared in the next moment.<br/><br/>“What is this?”<br/><br/>“What a rich life force!”<br/><br/>The scene in front of them changed. When they reappeared, they were on a planet that was filled with green life force.<br/><br/>Wang Xian and the rest took a deep breath. They could feel a wave of life force entering their bodies.<br/><br/>Although it was much weaker than the life force in the Dragon Palace, this level of life force was high enough.<br/><br/>“As expected of a primary race in the universe!”<br/><br/>The Heaven Formation muttered.<br/><br/>“Let’s go and see if there are any resources of the divine tree and divine grass here!”<br/><br/>Wang Xian’s eyes were burning with passion. With a move of his body, he immediately flew up to a height of 10,000 meters.<br/><br/>Buzz<br/><br/>He closed his eyes slightly. With the ability of the ancestral tree, he could sense where the life force was more majestic.<br/><br/>“Follow me!”<br/><br/>Wang Xian brought them and flew in a direction immediately.<br/><br/>This planet was similar to an ordinary planet. With the speed of Wang Xian and the rest, they could circle around it once in two hours.<br/><br/>The entire planet was covered by all kinds of plants and was full of life force.<br/><br/>In here, one could vaguely feel waves of life force being guided into this planet from the void outside.<br/><br/>“The spiritual energy in the bright starry sky is not as strong as the spiritual energy in the center of the universe. It’s because of this formation that the Mohan clan’s formation is really powerful. It has gathered the spiritual energy within at least a few million light years.”<br/><br/>The Heaven Formation sensed the power of the formation in the surroundings and said with some shock in his heart.<br/><br/>“Something’s not right. Logically speaking, if no one has entered this place for a few billion years, the vitality here should be even more majestic. There should be a lot of divine trees and divine herbs in there!”<br/><br/>After flying for a few minutes, Wang Xian had a faint feeling that something was not right.<br/><br/>Sensing that the vitality ahead was more concentrated, he sped up.<br/><br/>“Eh? This Is?”<br/><br/>When Wang Xian and the rest were about to reach that place, his gaze focused slightly.<br/><br/>“Dragon King, there are actually buildings here. There are signs of human activity!”<br/><br/>At the side, Heaven Array’s expression changed as he spoke in a deep voice.<br/><br/>“Someone has entered this planet!”<br/><br/>Wang Xian stopped moving. His eyes sparkled as he swept his gaze downwards.<br/><br/>According to his memory, out of the 9,999 stars in the Mohan clan, more than 8,000 of them had been deciphered and entered the planet.<br/><br/>The planet they were currently on was undeciphered and no one had entered the planet.<br/><br/>Now, tens of millions of people were searching for a way to enter the planet every day.<br/><br/>However, it seemed that someone had already entered the planet.<br/><br/>“Who is it!”<br/><br/>Suddenly, a cold voice was heard.<br/><br/>Following that, the entire space suddenly changed, and ripples appeared in the void.<br/><br/>Below them, more than ten middle-aged elders flew out from a room below.<br/><br/>“Not good, Dragon King. Our space has been sealed. There are seventh-level divine emperor array masters among them!”<br/><br/>The sky array sensed the changes in the surroundings and its expression changed slightly.<br/><br/>He was very familiar with this kind of array formation.<br/><br/>But at this moment, the array formation that covered this space enveloped them all.<br/><br/>“Someone actually entered the Divine Garden Star. Kill them!”<br/><br/>The faces of the more than ten middle-aged elders who flew out darkened when they saw their gazes sweeping across them.<br/><br/>Whoosh! Whoosh! Whoosh<br/><br/>The elder in the middle waved his arm. A resplendent brush appeared in his hand and slashed towards Wang Xian and the rest.<br/><br/>A huge net appeared out of thin air and headed towards Wang Xian and the rest.<br/><br/>“Die!”<br/><br/>The more than ten middle-aged elders around him also waved their arms. With a brush in their hands, metal swords filled with killing intent charged towards them.<br/><br/>They showed no mercy!<br/><br/>“You’re courting death!”<br/><br/>Wang Xian sensed their killing intent and attacks. His expression changed slightly.<br/><br/>Whoosh<br/><br/>The inoriginator holy wings appeared behind him instantly. His speed was pushed to the limit.<br/><br/>Bang<br/><br/>His right arm turned into a dragon claw and tore apart the Lightning Net formed by the formation.<br/><br/>Whoosh<br/><br/>In the next moment, Wang Xian pushed his speed to the limit and appeared in front of the old man in the lead.<br/><br/>“What? What a fast speed!”<br/><br/>The old man’s expression changed drastically. When he saw Wang Xian’s dragon claws attacking him, his heart sank.<br/><br/>Buzz Buzz<br/><br/>An extremely powerful aura burst out from his body and his body began to twist.<br/><br/>In an instant, he appeared behind Wang Xian and completely dodged his attack.<br/><br/>Wang Xian raised his eyebrows slightly and swept his dragon eyes across!<br/><br/>“Dragon Eye Lock!”<br/><br/>His eyes focused and eight rays of light shot out from his pupils. The eight divine dragons flew over.<br/><br/>“Roar! Roar! Roar!”<br/><br/>The Law Divine Dragon, Dragon Eye Lock, was cast.<br/><br/>This was also the first time Wang Xian had cast it.<br/><br/>The appearance of the eight illusory divine dragons caused the entire space to change drastically.<br/><br/>The ripples that covered the entire space began to collapse.<br/><br/>In the space, chains appeared out of thin air around the level seven divine Emperor Magus.<br/><br/>* Hua La La! *<br/><br/>The chains attacked him.<br/><br/>“Not good!”<br/><br/>Seeing this terrifying attack, the old man’s expression changed.\t\t\t\t\t\t</div>", "images": {}, "success": true}