{"id": 16, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15071933.html", "title": "Chapter 3002 - Chapter 3002: Under The 3002 Divine Garden Star That Was Occupied", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 3002 - Chapter 3002: Under The 3002 Divine Garden Star That Was Occupied</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 3002: Under the 3002 Divine Garden Star that was occupied<br/><br/>“You don’t know whether you are dead or Alive!”<br/><br/>The chains covered the entire space. The old man was surrounded by chains that were emitting all kinds of colors as they tried to entangle him.<br/><br/>Wang Xian stared at him. His eyes were filled with killing intent.<br/><br/>He used his killing move without any hesitation and sealed the surrounding space. It was obvious that he wanted to keep them here.<br/><br/>Wang Xian didn’t have to worry about the other party’s identity and background when facing such a person.<br/><br/>“If you dare to kill me, my master will not let you off!”<br/><br/>The chains attacked the old man. The old man waved the brush in his hand and slashed at the chains with his sharp swords.<br/><br/>He could feel Wang Xian’s terrifying speed and roared in fear.<br/><br/>“HMPH!”<br/><br/>Wang Xian snorted coldly and arrived in front of the old man. His arms turned into dragon claws and clawed at the old man.<br/><br/>“No!”<br/><br/>Sensing the threat from Wang Xian, the old man roared in panic.<br/><br/>As a wizard, a level seven divine emperor wizard, he had already sensed it when Wang Xian and the rest arrived.<br/><br/>Furthermore, he could vaguely sense the strength of their group. The young man who attacked him was most likely a level seven divine emperor powerhouse.<br/><br/>However, he was not afraid. With his strength and the witchcraft he had mastered, he could definitely fight against someone of a higher realm.<br/><br/>However, he did not expect his opponent’s speed to be so terrifying. There was also this strange nomological divine ability.<br/><br/>“Peng!”<br/><br/>Before he could react, he sensed a powerful force landing on his body.<br/><br/>“Weng!”<br/><br/>A destructive force entered his body.<br/><br/>Puff<br/><br/>The old man instantly spat out a large amount of blood.<br/><br/>Bang<br/><br/>Wang Xian swung his dragon claw again and landed on the top of the old man’s head. The old man was severely injured instantly.<br/><br/>Wizards who were good at formations were most afraid of an enemy like Wang Xian who had terrifying speed.<br/><br/>Wang Xian’s speed was able to restrain him.<br/><br/>“Stop, let go of our senior brother!”<br/><br/>The expressions of the other ten-odd middle-aged men changed drastically as they roared.<br/><br/>“Bang Bang Bang Bang!”<br/><br/>Wang Xian flapped his divine wings and attacked them instantly.<br/><br/>His dragon claws penetrated all of their bodies.<br/><br/>“Cough Cough Cough!”<br/><br/>The Ten-odd men widened their eyes as if they couldn’t believe what they were seeing. Their vitality quickly disappeared.<br/><br/>“You… you… you actually killed my junior brothers. My master will not let you off. He will not let you off!”<br/><br/>The old man who was caught by Wang Xian narrowed his eyes slightly and roared in horror.<br/><br/>“Soul Catcher!”<br/><br/>Wang Xian’s eyes were cold as he grabbed the old man’s head with his Dragon Claw.<br/><br/>Soul catcher.<br/><br/>“No, no, no!”<br/><br/>The old man widened his eyes in horror. His eyes started to lose focus.<br/><br/>“Dragon King!”<br/><br/>At this moment, Tian Chen and the rest flew over. Their expressions were a little unsightly.<br/><br/>The battle just now only lasted for an instant. From the beginning to the end, it didn’t take more than twenty seconds.<br/><br/>The sudden appearance of more than ten people who attacked them made Tian Chen and the rest look extremely embarrassed.<br/><br/>Fortunately, the Dragon King had already broken through. Otherwise, they could only flee with their tails between their legs.<br/><br/>Wang Xian closed his eyes and absorbed the information in the old man’s mind.<br/><br/>“Celestial Emperor Hong Tian?”<br/><br/>Not long after, he opened his eyes and frowned slightly.<br/><br/>“Dragon King, What’s Wrong?”<br/><br/>When Tian Chen and the rest heard Wang Xian mention this name, they immediately asked.<br/><br/>They had heard this name not long ago.<br/><br/>“100 million years ago, the master of this group of people, who is also an expert called Celestial Emperor Hong Tian, had already entered this place. All the divine herbs and divine trees here were obtained by him. Furthermore, he saw that this place was full of vitality, so he treated this place as his own medicinal garden and cultivated the divine herbs and divine trees!”<br/><br/>“Now, the god Emperor Hong Tian has the strength of a peak God Emperor, a powerful wizard!”<br/><br/>Wang Xian spoke with a slightly solemn tone.<br/><br/>“Someone actually beat us to it!”<br/><br/>Upon hearing Wang Xian’s words, the expressions of Tian Chen and the rest were a little ugly.<br/><br/>“Let’s go. We have to leave this place immediately. The God Emperor Hong Tian should have already sensed that his disciple has died.”<br/><br/>Wang Xian spoke immediately and looked at an lie.<br/><br/>“Dragon King, give me ten seconds!”<br/><br/>An lie nodded and his figure disappeared.<br/><br/>Wang Xian looked around and waved his arm to collect all the corpses.<br/><br/>“There are some good divine trees and divine herbs here. Let’s take them away!”<br/><br/>According to his memory, Wang Xian flew towards the location in front of him.<br/><br/>Tian Cheng and the rest followed him immediately.<br/><br/>“There are some divine herbs and divine trees of level eight or even level nine divine emperors. As expected of the herb garden of a peak divine emperor!”<br/><br/>Wang Xian and the rest came to the herb garden. With a wave of his arm, he kept it into the mother nest.<br/><br/>According to his memory, there were ten herb gardens like this on this planet.<br/><br/>Unfortunately, he did not dare to stay here any longer.<br/><br/>If they encountered a peak divine emperor, they could only flee.<br/><br/>“Dragon King, I will erase the traces of this space!”<br/><br/>As the sky array spoke, waves of energy swept through the surrounding void.<br/><br/>“Dragon King!”<br/><br/>At this moment, an lie returned.<br/><br/>“Wait for the sky array to erase the aura around!”<br/><br/>Wang Xian said to an lie.<br/><br/>A powerful Magus could use the formation to detect the situation here.<br/><br/>An lie nodded and waited by the side.<br/><br/>“Dragon King, it’s Done!”<br/><br/>A minute later, the Heaven Formation spoke.<br/><br/>“Let’s Go!”<br/><br/>Wang Xian spoke and disappeared in an instant.<br/><br/>The scene in front of them changed. They had arrived on another planet.<br/><br/>“It’s not so easy to obtain resources. Let’s go to the planet where the Mohan clan keeps their desolate beast mounts.”<br/><br/>Wang Xian shook his head helplessly and spoke.<br/><br/>However, he was still very satisfied with the rewards from entering the planet earlier.<br/><br/>One level seven celestial thearch wizard’s corpse and more than ten level six celestial thearch wizard’s corpses could increase the strength of the Dragon Palace by quite a lot.<br/><br/>Even those divine trees and divine herbs were not enough to increase Wang Xian’s strength.<br/><br/>“Dragon King, you guys wait here for a while. I’ll go over First!”<br/><br/>An lie looked at the map. His gaze locked onto the planet where the Mohan clan kept their desolate beast mounts. Then, his figure disappeared.<br/><br/>…<br/><br/>“Huh?”<br/><br/>Just as Wang Xian and the rest continued to explore, God Emperor Hong Tian, who was floating in the air around the Tower of Babel, frowned.<br/><br/>There was no one within a radius of more than a thousand kilometers around him. One could imagine his strength and status.<br/><br/>In fact, God Emperor Hong Tian had a very high prestige and status in the entire ruins of the Mohan clan.<br/><br/>The method to break the array formation within the fifty-fifth level of the supreme tower was something God Emperor Hong Tian had selflessly told everyone.<br/><br/>In the Mo Han clan’s ruins, God Emperor Hong Tian had many supporters.<br/><br/>Furthermore, he had recruited many disciples, and many of them had quite a bit of prestige.<br/><br/>Sensing the divine token in his interspatial ring break, his figure slowly disappeared.<br/><br/>In the next moment, in a medicinal garden on the Divine Garden Star, God Emperor Hong Tian appeared.<br/><br/>“Master!”<br/><br/>Around him, more than ten middle-aged elders saw him and immediately bowed respectfully.<br/><br/>“Yes!”<br/><br/>God Emperor Hong Tian nodded and immediately flew towards a certain direction with an expressionless face.<br/><br/>His speed was extremely terrifying, and he soon arrived above a medicinal garden.<br/><br/>Sensing that there wasn’t the slightest bit of life here, he saw that the divine tree divine grass in the medicinal garden had been plucked away, and his eyes revealed a cold expression.<br/><br/>“Someone actually stepped into my territory!”<br/><br/>His gaze was cold, and his slightly turbid eyes scanned his surroundings.<br/><br/>“Petty tricks!”<br/><br/>He spat out a few words coldly.\t\t\t\t\t\t</div>", "images": {}, "success": true}