{"id": 24, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15071949.html", "title": "Chapter 3010 - Chapter 3010: Had Killed Tens Of Millions Of People", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 3010 - Chapter 3010: Had Killed Tens Of Millions Of People</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 3010: had killed tens of millions of people<br/><br/>“Hahaha, it’s been half a year. We’ve finally found the entrance to the starry sky!”<br/><br/>At the edge of the Mohan clan ruins, everyone from the four-armed race and the three-eyed race stared at the place in front of them with excitement.<br/><br/>The two forces had a total of 10 million experts. After searching for more than half a year, they finally found the entrance to the space.<br/><br/>At the very front, the four-armed patriarch and the three-eyed patriarch, who were sitting cross-legged on the Treasure Lotus, had faint smiles on their faces.<br/><br/>They looked at the entrance to the starry sky and exchanged a glance.<br/><br/>“This array can defend against the attacks of a rank six divine emperor. The person who set it up should be a rank six divine Emperor Magus. No Wonder Our Vanguard Army was destroyed!”<br/><br/>The four-armed race leader said indifferently.<br/><br/>“Hehe, no matter how powerful it is, we will make them pay the price of destruction this time!”<br/><br/>“Let’s Go!”<br/><br/>The three-eyed race leader said indifferently. His body moved and the two of them flew towards the entrance.<br/><br/>The two race leaders entered. At the back, the clansmen followed behind with excited expressions.<br/><br/>This time, the two large clans had sent 80% of their forces.<br/><br/>With the two large clans joining forces, it wasn’t an exaggeration to say that this was a powerful force around the Mo Han clan ruins!<br/><br/>“I wonder how many God Dragon bloodlines the Dragon Palace has!”<br/><br/>“As long as there are a few hundred, it’s still a huge amount of resources. You have to know that the god Dragon bloodlines are extremely valuable in the current universe!”<br/><br/>“If there are tens of thousands of them, that would be even more satisfying. We can also become Dragon Knights!”<br/><br/>The two races entered the resplendent starry sky. They were all looking around with great interest and discussing amongst themselves.<br/><br/>In the current universe, even the Asian dragons were worth a lot.<br/><br/>The bloodline of the Dragon God was incomparably noble. As long as one had the bloodline of the Dragon God, with a little nurturing, one could possibly rise to the pinnacle of the Emperor God realm.<br/><br/>If one’s bloodline was pure, one could even reach the level of a universe knight.<br/><br/>What kind of concept was this?<br/><br/>A Universe Knight was a terrifying existence that only the primary races of the universe had.<br/><br/>To be able to have the Dragon God’s mount represented one’s status and status.<br/><br/>Even their clan leader didn’t have the right to use the dragon God as a mount.<br/><br/>When they said that they wanted to become Dragon Knights, it was just for fun!<br/><br/>A group of ten million people, with the weakest being a tier six divine emperor expert, the core strength of the two great clans, and over 20,000 divine emperor level experts, entered the resplendent starry sky in a grandiose manner.<br/><br/>“Oh? What are the people from these two great clans doing? Nearly 80% of their strength is gathered here. Yi, they actually entered the Mo Han Room Ruins.”<br/><br/>Just as everyone from the two large clans entered through the entrance, behind them, more than a dozen figures were hidden in the air, watching them enter with puzzlement.<br/><br/>More than a dozen of them had noticed the situation here two months ago.<br/><br/>The three-eyed clan and the four-armed clan added up to more than ten million people. Although they had done a lot of hiding and had scattered their members, they had still noticed something fishy.<br/><br/>“Let’s go and take a look. The two big races have been searching for so long, there must be a treasure!”<br/><br/>One of them said.<br/><br/>“Let’s Go!”<br/><br/>More than ten people moved and immediately followed behind and entered.<br/><br/>“Three-eyed clan leader, can you find the route?”<br/><br/>At the front of the two big races, ten million people entered.<br/><br/>The four-armed clan leader, who was sitting cross-legged on the lotus, looked around and said to the three-eyed clan leader.<br/><br/>“Let me check it out!”<br/><br/>The three-eyed clan leader nodded, and the pitch-black eyes between his eyebrows looked at the world coldly.<br/><br/>Under his gaze, everything was deathly white.<br/><br/>“I’ve found traces of your four-armed clan. Follow Me!”<br/><br/>The three-eyed clan leader said faintly. The one-eyed rhinoceros immediately galloped forward and flew towards the planet in the eight desolation six directions.<br/><br/>…<br/><br/>“Dragon King! They have already entered the eight desolation six directions and are flying towards our direction. TSK TSK, I have to say that the abilities of this race in the universe are really strong. They actually know our direction!”<br/><br/>At this moment, Wang Xian and the rest were standing on a piece of void meteorite not far away from the two tribes.<br/><br/>An lie teleported over and reported the situation!<br/><br/>Wang Xian narrowed his eyes slightly and revealed an extremely cold expression.<br/><br/>“Heaven Formation, how is the formation set up?”<br/><br/>Wang Xian asked the Heaven Formation at the side.<br/><br/>“Dragon King, we can definitely set up the formation before they arrive. However, the formation that I set up will collapse once it is attacked by two to three level seven celestial thearch powerhouses!”<br/><br/>The Heaven Formation said.<br/><br/>“It’s enough to trap the rest of the members of the two tribes. Those level seven celestial thearch powerhouses don’t have the chance to attack the formation!”<br/><br/>Wang Xian said faintly.<br/><br/>“Hehe, with the strength of a level six celestial thearch, don’t even think about breaking our seal!”<br/><br/>The Heaven Formation smiled and revealed a look of confidence.<br/><br/>“Trap them and leave it to me alone!”<br/><br/>Wang Xian stood there quietly. The Five Elements Millstone turned into a crown and was placed on his head. The Yin-yang dragon coiled around him.<br/><br/>Time passed little by little.<br/><br/>Tian Chen stood behind Wang Xian and waited as well.<br/><br/>Not long after, an army of over ten million people appeared in their sight.<br/><br/>Wang Xian narrowed his eyes slightly and they sparkled.<br/><br/>The black eyes on the forehead of the three-eyed tribe leader were staring ahead. When he saw the two figures standing on the meteorite, his black pupils fluctuated slightly.<br/><br/>“There’s someone ahead!”<br/><br/>The three-eyed clan leader said indifferently.<br/><br/>“Eh?”<br/><br/>The pupils of the four-armed clan leader slightly contracted, and a blurry figure appeared in his line of sight.<br/><br/>“Does he know that we’re Coming?”<br/><br/>The four-armed clan leader raised his eyebrows and said indifferently.<br/><br/>“Be careful!”<br/><br/>The eyes of the three-eyed clan leader flickered.<br/><br/>The leader of the four-armed race nodded and the group continued to fly forward.<br/><br/>The distance between the two sides was getting closer and closer.<br/><br/>“Eh? There are people in front of us?”<br/><br/>“There are indeed two people. What are they doing standing on the meteorite?”<br/><br/>Soon, the experts of the two races at the back also noticed the two figures in front of them. They revealed curious expressions on their faces and whispered to each other.<br/><br/>“Everyone, may I know why you have come to our resplendent starry sky?”<br/><br/>Wang Xian looked at them and asked calmly.<br/><br/>“Who are you? Are you members of the Dragon Palace in the Resplendent Starry Sky?”<br/><br/>When the three-eyed clan leader heard Wang Xian’s words, he waved his hand and everyone immediately stopped.<br/><br/>The four-armed clan leader also ordered everyone to stop and looked at Wang Xian.<br/><br/>“Yes. Are you here to invade our Dragon Palace?”<br/><br/>Wang Xian continued to ask.<br/><br/>“Were the disciples of my four-armed clan killed by Your Dragon Palace?”<br/><br/>The four-armed clan leader slowly stood up from Bao’s face and asked with killing intent.<br/><br/>“It’s your people who are courting death!”<br/><br/>Wang Xian nodded his head and the incipient Saint Wings appeared on his back.\t\t\t\t\t\t</div>", "images": {}, "success": true}