{"id": 22, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15071945.html", "title": "Chapter 3008 - Chapter 3008: , The Trapped Old Man", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 3008 - Chapter 3008: , The Trapped Old Man</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 3008: , the trapped old man<br/><br/>“Anything with a bit of spiritual energy has been absorbed by me. Even my treasures have been destroyed by me to maintain my life force!”<br/><br/>Ming Xuanzhi said bitterly.<br/><br/>For 80 million years, there was no spiritual energy or food here. He could only absorb his treasures as resources to maintain his life force.<br/><br/>After 80 million years, he was still extremely lucky to be able to survive!<br/><br/>“Poor bastard!”<br/><br/>Ba Qi couldn’t help but say to the old man.<br/><br/>“Cough Cough, I, Ming Xuanzhi, will never forget the kindness of my benefactor and all of you. I will definitely repay you in the future!”<br/><br/>“Now, if you want to repay me, I, Old Zhi, can only repay you with my own flesh!”<br/><br/>“Oh, and, I think you are a wizard, brother. I can tell you all the spells I have mastered!”<br/><br/>Ming Xuanzhi said with a smile, the flesh on his face moving.<br/><br/>“Flesh for flesh?”<br/><br/>Ba Qi’s face darkened.<br/><br/>“Oh, this brother is willing to teach me spells?”<br/><br/>Sky Array heard his words and was delighted.<br/><br/>“No problem, no problem. It’s my life-saving grace. Even if I teach my benefactors everything I’ve learned, it doesn’t matter.”<br/><br/>Ming Xuanzhi said with a smile.<br/><br/>“Thank you, thank you!”<br/><br/>Tian Chen immediately cupped his hands.<br/><br/>“Alright, we’re done searching. Let’s leave immediately!”<br/><br/>Wang Xian smiled at the side and said.<br/><br/>“It’s the Dragon King!”<br/><br/>Tian Chen and the rest nodded immediately.<br/><br/>“Aren’t you going to take away the corpse of the black magic?”<br/><br/>At this moment, Ming Xuanzhi saw the corpse placed there and asked.<br/><br/>“This corpse has no energy left. Is it still useful?”<br/><br/>Ba Qi raised his eyebrows and asked.<br/><br/>“If it is soaked in medicinal water and refined, it can be made into a powerful puppet.”<br/><br/>Ming Xuanzhi didn’t hide anything.<br/><br/>“We don’t know how to use it. You can take it yourself!”<br/><br/>Wang Xian said to him.<br/><br/>“Hehe, alright. Thank you, benefactor!”<br/><br/>Ming xuanzhi nodded excitedly.<br/><br/>“Let’s Go!”<br/><br/>Soon, an lie said and led them away.<br/><br/>Ming Xuanzhi looked at an lie in surprise.<br/><br/>“Ming Xuanzhi, are you familiar with this continent?”<br/><br/>Wang Xian asked Ming Xuanzhi after coming out of the formation.<br/><br/>“Benefactor, this continent is called the Wu en continent. I’m not sure about the specific situation. After I entered this continent, I searched for a long time and came here. I didn’t expect that I wouldn’t be able to leave!”<br/><br/>Ming Xuanzhi said.<br/><br/>“Wu-en continent?”<br/><br/>Wang Xian and the rest nodded slightly. “Have you finished searching this continent?”<br/><br/>“No, I’ve searched about half of it.”<br/><br/>Ming Xuanzhi shook his head.<br/><br/>“Have you been to the other 17 continents? Do you know where they are?”<br/><br/>Wang Xian continued to ask him.<br/><br/>“I’ve been to one of the other 17 continents, but it’s basically a ruin. I haven’t been to the other continents!”<br/><br/>Ming Xuanzhi said.<br/><br/>“Tiancheng, you can learn some witchcraft from Ming Xuanzhi here. Let’s explore other places!”<br/><br/>Wang Xian said to Tiancheng.<br/><br/>“It’s the Dragon King!”<br/><br/>Tiancheng nodded.<br/><br/>“Benefactor, leave the teaching of witchcraft to me. I will teach you everything!”<br/><br/>Ming xuanzhi nodded immediately.<br/><br/>Wang Xian and the rest nodded as well. Then, they continued to explore the surroundings.<br/><br/>They did not let Ming Xuanzhi follow them. The main reason was to avoid exposing their abilities.<br/><br/>The Heaven Formation followed Ming Xuanzhi as he cultivated his witchcraft. Wang Xian and the rest continued to explore.<br/><br/>In the next two months, they obtained a lot of treasures. In just two months, they had basically searched the entire continent.<br/><br/>“The harvest is pretty good!”<br/><br/>Wang Xian looked at the harvest over the past few months and smiled.<br/><br/>He had obtained quite a number of divine herbs and divine trees. There were more than a thousand divine emperor-level wizard artifacts.<br/><br/>There were also a few divine emperor-level level seven or eight wizard artifacts.<br/><br/>“Sky Formation, how is it? We are leaving!”<br/><br/>Returning to Sky Formation, Wang Xian asked with a smile.<br/><br/>“Alright, Dragon King. I have memorized some wizard knowledge!”<br/><br/>Sky array nodded, his face full of smiles. It was obvious that he had grasped a lot of things in the past two months.<br/><br/>“Sky Array Brothers’talent is really terrifying. It Won’t be long before they can surpass me!”<br/><br/>Ming Xuanzhi, who was at the side, said with a slight sigh.<br/><br/>When he taught sky array, he was shocked.<br/><br/>Whether it was comprehension or control, he felt extremely shocked.<br/><br/>Even if his knowledge of the Magi was lower than his, he was sure that he would be caught up to in a short period of time.<br/><br/>“Brother Ming Xuanzhi, thank you for your guidance for two months!”<br/><br/>Tian Chen cupped his hands and thanked him.<br/><br/>“This is nothing compared to saving my life!”<br/><br/>Ming xuanzhi shook his head immediately.<br/><br/>“Then let’s part ways here!”<br/><br/>Wang Xian looked at Ming Xuanzhi and said.<br/><br/>“Alright, benefactor, please leave your name. I will visit you in the future to thank you!”<br/><br/>Ming xuanzhi cupped his hands and asked Wang Xian.<br/><br/>“Dragon Palace, Dragon King! There’s no need to repay your kindness. Goodbye!”<br/><br/>Wang Xian cupped his hands and looked at Tian Chen and the rest.<br/><br/>The few of them nodded and immediately flew towards the edge of the continent.<br/><br/>“Dragon King of the Dragon Palace?”<br/><br/>Ming xuanzhi muttered as his figure slowly disappeared.<br/><br/>After coming out of the confining array, he could instantly return to his divine kingdom!<br/><br/>“Dragon King, Ming Xuanzhi’s strength is not weak and his knowledge is profound. He has mastered too many witchcraft. In just two short months, he has already recovered to the eighth rank of the Divine Emperor Realm!”<br/><br/>“At his peak, he should be a wizard at the peak of the Celestial Thearch!”<br/><br/>The few of them flew to the edge and the sky array spoke.<br/><br/>“The starry sky around the ruins of the Mohan clan is considered quite powerful!”<br/><br/>Wang Xian nodded.<br/><br/>There were no other elementary races in the universe around the ruins of the Mohan clan. The peak of the Celestial Thearch was almost invincible in this starry sky.<br/><br/>“An lie, get ready to enter the next continent.”<br/><br/>Wang Xian spoke.<br/><br/>“It’s the Dragon King!”<br/><br/>An lie nodded and disappeared in an instant.<br/><br/>“TSK TSK, after exploring all the continents, our dragon palace should be able to obtain a great harvest!”<br/><br/>Ba Qi said excitedly from the side.<br/><br/>Tian Chen and the rest also nodded. Their eyes were filled with anticipation and excitement.<br/><br/>The 18 continents in the center of the Mohan Chamber ruins were not too far apart. After about 10 minutes, an lie teleported back.<br/><br/>“Dragon King, I have entered the second continent. That continent is a little strange!”<br/><br/>An lie flew over and reported to Wang Xian and the rest.<br/><br/>“Strange? Let’s Go!”<br/><br/>Wang Xian and the rest revealed curious expressions. The scene in front of them changed as a special continent appeared in their line of sight.<br/><br/>This was a nine-colored continent. The radiance of nine attributes covered this continent.<br/><br/>There were no buildings in the entire continent!\t\t\t\t\t\t</div>", "images": {}, "success": true}