{"id": 28, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15071957.html", "title": "Chapter 3014 - Chapter 3014: Was Surrounded By Tigers And Wolves", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 3014 - Chapter 3014: Was Surrounded By Tigers And Wolves</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 3014: was surrounded by tigers and wolves<br/><br/>“We must take revenge. Joining the force created by God Emperor Hong Tian is our worst choice.”<br/><br/>In the base of the three-eyed race, the three-eyed race leader clenched his fists and said with an extremely pale face.<br/><br/>He didn’t want the three-eyed race to be completely destroyed by him.<br/><br/>If they were destroyed, he would be a sinner of the three-eyed race.<br/><br/>“Immediately spread the news of the Dragon Palace and exaggerate it. Tell them that the Dragon Palace has a divine dragon with a very pure bloodline. Tell them that the Dragon Palace has a large number of quasi-dragons!”<br/><br/>The three-eyed race’s patriarch said with a gloomy face.<br/><br/>“I don’t believe that if this news is spread, no forces around the Mo Han clan’s ruins will be tempted. Once they go over to investigate, they will definitely clash with the Dragon Palace!”<br/><br/>“The Dragon Palace has the bloodline of the Divine Dragon. It will definitely become the target of many forces!”<br/><br/>He continued to say with a cold expression.<br/><br/>“It’s the clan leader. Let’s immediately spread this news!”<br/><br/>An expert from the three-eyed race immediately nodded.<br/><br/>“Contact the four-armed race!”<br/><br/>“Also announce that all the clansmen should escape from here!”<br/><br/>The last sentence, the three eyed race leader said weakly.<br/><br/>After saying that, he closed his eyes and leaned on his throne.<br/><br/>“Yes!”<br/><br/>The rest of the Tribesmen had ugly expressions as they lowered their heads and replied.<br/><br/>Very quickly, the matter of the three eyed race disbanding caused all the tribesmen to boil with excitement.<br/><br/>At the same time, on the Universe AI, the three eyed race released all the information about the dragon palace in an exaggerated manner.<br/><br/>The center of the universe was vast, and the information in the universe’s AI was dense and endless every second.<br/><br/>It was impossible for everyone to receive the information from the entire center of the universe.<br/><br/>Most of them were limited to viewing the information in an area.<br/><br/>For example, if they were set to a million light-years, the information they could see would also be released within a million light-years.<br/><br/>Moreover, the universe’s AI had a special feature. The information released by the Strong would be at the front because of their strong spiritual power.<br/><br/>Everyone would be able to see the information released by the strong.<br/><br/>Secondly, there were many powers that would release information using their real names, or they would add the prefix of their own powers.<br/><br/>The strong of these powers were mainly to attract some powerful and outstanding creatures.<br/><br/>In the center of the universe, not every creature had their own race or power. Many creatures were rootless trees in the universe.<br/><br/>There were quite a number of such living beings, and some of them were not weak either.<br/><br/>Many races liked to recruit such people.<br/><br/>The information that the three-eyed race released was completely in the name of the entire three-eyed race.<br/><br/>When this information was released, it instantly attracted the attention of countless people.<br/><br/>Some domain level experts of the races also immediately paid attention to this information.<br/><br/>When they saw the contents, all the powers were slightly shocked.<br/><br/>“Pure-blooded divine dragons, many sub-dragons? Is this true? The three-eyed race will kindly tell everyone this news?”<br/><br/>“Is this three-eyed race up to something?”<br/><br/>All the experts of the powers were filled with shock and suspicion when they saw this piece of information.<br/><br/>A quasi-dragon, a pure-blooded divine dragon, this was a huge treasure. A powerful quasi-dragon could be exchanged for many treasures in the center of the universe.<br/><br/>If it was a pure-blooded one, the powerful races of the universe would be willing to pay a huge price to buy it.<br/><br/>Now that they had kindly announced this information, it was obvious that they were up to something.<br/><br/>However, soon, two more sensational news spread.<br/><br/>The three-eyed race had disbanded!<br/><br/>The four-armed race had disbanded too!<br/><br/>Another piece of news came from the four-armed race. 80% of their experts had been killed by the Dragon Palace.<br/><br/>This was the first time the Dragon Palace had appeared in the eyes of the powers in the center of the universe.<br/><br/>In the next two days, more information about the four-armed race and the three-eyed race appeared.<br/><br/>The powers in the center of the universe also had some understanding of this matter.<br/><br/>The two major races were surprised to discover that there was a starry sky within the ruins of the Mo Han clan.<br/><br/>Within that starry sky, there was an opportunity regarding the divine dragon and a legend regarding the divine dragon.<br/><br/>Regarding this discovery, the two major races thought that they had encountered an opportunity and immediately sent a large number of experts over, but they didn’t expect to encounter a disaster.<br/><br/>“I didn’t expect that there was a void within the Mo Han clan, and that there was even a sub-dragon!”<br/><br/>“If the four-armed three-eyed race’s news is true, then this dragon palace isn’t simple. To become a giant in just a dozen years, this is too exaggerated.”<br/><br/>“The three-eyed race and the four-armed race said that the Dragon Palace obtained the inheritance of the powerful divine dragon and the Mohan clan’s inheritance, is this true?”<br/><br/>“These two races are probably trying to use someone else to kill them, they’re deliberately exaggerating something!”<br/><br/>On the universe’s AI, countless people were discussing.<br/><br/>However, some factions were also restless about the three eyed race’s news.<br/><br/>The Allure of the Asian Dragon and the Divine Dragon was too great for them!<br/><br/>Moreover, they wanted to know if the three eyed race’s news was true. If it was true, then…<br/><br/>Especially for some domain races, they were even more moved by this news.<br/><br/>Some powerful factions quietly sent some people into the resplendent starry sky to investigate the news one by one.<br/><br/>…<br/><br/>“The situation is disadvantageous to our Dragon Palace!”<br/><br/>Prime Minister Gui was the first to learn of the information on the universe’s AI.<br/><br/>Looking at the information one by one, his face revealed a solemn expression.<br/><br/>Currently, the Dragon Palace had a thorough understanding of the factions around the Mo Han clan’s ruins. There were hundreds of clans and more than ten domain races.<br/><br/>The clans were still fine. The strongest one was at the void God Emperor Rank 8.<br/><br/>However, the experts of the domain races had already reached the peak of the god Emperor Realm.<br/><br/>If a powerful domain race were to attack, the Dragon Palace would not be able to defend against it.<br/><br/>Even if the Dragon Palace’s strength had increased greatly.<br/><br/>“All of the thorned dragon races, be prepared. If you encounter any unkind people, assassinate them. If anyone dares to touch our rules in the resplendent starry sky, kill them as well!”<br/><br/>“At this moment, the Dragon Palace must be strong and not show weakness!”<br/><br/>Prime Minister Gui summoned all the leaders of the Dragon Palace and ordered.<br/><br/>“It’s Prime Minister Gui!”<br/><br/>Ao Yao nodded.<br/><br/>“Baqi mosha, take the poisonous horned dragon species and be careful. Parasitize some of the experts who have entered the starry sky and find out their real purpose!”<br/><br/>Prime Minister GUI continued to instruct Baqi and the rest.<br/><br/>“It’s Prime Minister Gui!”<br/><br/>Baqi mosha nodded.<br/><br/>Prime Minister Gui’s face revealed a contemplative look. With a thought, he relayed the situation to the Dragon King.<br/><br/>“HMM?”<br/><br/>At the same time, on a continent located in the ruins of the Mohan clan, Wang Xian frowned slightly when he received the news from Prime Minister Gui.<br/><br/>“Ever since the Dragon Palace entered the center of the universe, the Dragon Palace has been in a passive situation!”<br/><br/>He frowned when he read the news.<br/><br/>There were too many strong people in the center of the universe. The current Dragon Palace was not strong. In addition to the situation of the Divine Dragon bloodline in the universe, the entire dragon palace was surrounded by tigers and wolves.<br/><br/>If one was not careful, they would be doomed!\t\t\t\t\t\t</div>", "images": {}, "success": true}