{"id": 26, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15071953.html", "title": "Chapter 3012 - Chapter 3012: Slashed Thousands Of Times", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 3012 - Chapter 3012: Slashed Thousands Of Times</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 3012: slashed thousands of times<br/><br/>“Boom Boom Boom!”<br/><br/>“Hualala!”<br/><br/>The terrifying attack that blotted out the sky and covered the entire area below. The grayish dragon claws were entangled with chains. The terrifying attack covered the 13 level 7 divine emperor powerhouses.<br/><br/>These powerhouses from the two large tribes were filled with fear and shock when they faced Wang Xian’s attack.<br/><br/>“Defend, Defend!”<br/><br/>They unleashed their trump cards with fear.<br/><br/>The three-eyed tribe leader who was enveloped by the undead.<br/><br/>The four-armed tribe leader who was protected by four huge hands.<br/><br/>The three-eyed tribe leader who was fleeing frantically.<br/><br/>There was also an old man from the four-armed tribe who was enveloped by a golden palm.<br/><br/>“Bang!”<br/><br/>The huge palm landed and a dull force caused the entire Void to explode.<br/><br/>“Ahhhhh!”<br/><br/>Miserable cries sounded out as the bodies of the rank seven God emperor experts began to collapse.<br/><br/>“Oh no, we are not his match at all!”<br/><br/>The three-eyed race elder looked at the tribesmen and the four-armed race experts beside him as their bodies slowly collapsed. Many chains pierced through their bodies, and he revealed a horrified expression.<br/><br/>“Death Spirit Substitute!”<br/><br/>The leader of the three-eyed race shouted with an extremely embarrassed expression.<br/><br/>“Bang!”<br/><br/>In the next moment, the death spirit in front of him entered his body directly. The Eye of the death spirit in his hand entered the center of his brows.<br/><br/>His body trembled slightly.<br/><br/>“Whoosh! Whoosh! Whoosh!”<br/><br/>The chains penetrated his body one by one and rapidly eroded his life force.<br/><br/>However, at this moment, a black glow, which was like a black hole, disappeared instantly.<br/><br/>Wang Xian swept his gaze over there. His eyes were sparkling!<br/><br/>“AH, Buddha’s Golden Palm, receive me into the Buddhist Kingdom!”<br/><br/>At this moment, a violent roar came from below.<br/><br/>Wang Xian swept his gaze over. The four-armed race expert who was protected by the Golden Palm saw the golden palm collapse. A golden swastika flew out from his body. The swastika contained the shadow of a huge hall. His body moved and entered directly.<br/><br/>The three-eyed man and the four-armed man had escaped!<br/><br/>“They are indeed capable!”<br/><br/>Wang Xian swept his gaze over and was not too surprised.<br/><br/>It was normal for such an expert to have some tricks up his sleeves.<br/><br/>“However, all of you shall die!”<br/><br/>Wang Xian’s five elemental dragon claws were covered in chains. He completely crushed the other eleven level seven celestial thearch experts.<br/><br/>“No!”<br/><br/>Screams of agony rang out as the level seven celestial thearch powerhouses lost their vitality completely.<br/><br/>“No, no, no, how could this be? How could this be? !”<br/><br/>“The clan leader, Grand Elder, protector, and the rest are all dead!”<br/><br/>At the back, everyone from the two large tribes saw this scene. Their eyes widened and their faces were filled with astonishment.<br/><br/>Their bodies trembled as they watched this scene.<br/><br/>The two large clans had joined forces and searched for more than half a year before they found the entrance. They had originally thought that they would be able to harvest a large number of inferior dragons.<br/><br/>They had even fantasized about obtaining a huge opportunity.<br/><br/>But in the end, it turned out to be such a situation?<br/><br/>They were basically here to throw their lives away!<br/><br/>“Break the array formation and escape!”<br/><br/>A tier six divine emperor elder shouted sternly.<br/><br/>“Run, run, run!”<br/><br/>“Run!”<br/><br/>A terrified voice rang out. In an instant, tens of millions of people fled frantically in all directions.<br/><br/>“The Dragon Palace has no enmity with you, yet you want to destroy us. You can only blame yourselves!”<br/><br/>Wang Xian looked at the experts from the two large tribes who were in a state of panic. His body trembled slightly.<br/><br/>“Perish in the river of time!”<br/><br/>Wang Xian’s body trembled slightly. He slowly raised his palm and transformed it into a gigantic dragon claw.<br/><br/>With a wave of his arm, a grayish destructive energy engulfed the tens of millions of people who were fleeing in a frenzy.<br/><br/>A long river of annihilation appeared and engulfed all of them.<br/><br/>The Terrifying River of time swept past. At the front of the river, the experts had all perished in the river of time. All their vitality had vanished.<br/><br/>“No!”<br/><br/>Some people were filled with despair when they saw the river of time sweeping towards them. They were resisting with all their might.<br/><br/>However, the gap between them and Wang Xian was too huge!<br/><br/>Now that Wang Xian was able to kill an expert at level eight of the celestial thearch in an instant, what could they do to defend themselves?<br/><br/>The river of time swept past quickly. Tens of millions of people were drowned, leaving behind only corpses.<br/><br/>All the experts of the two large clans were annihilated.<br/><br/>Other than the three-eyed clan leader and one expert from the four-armed clan who escaped, the rest were all left here.<br/><br/>A murderer should have this kind of awareness.<br/><br/>This was a race war, and there was no right or wrong.<br/><br/>“Hiss, so strong. That young man is so strong. He single-handedly wiped out two large clans. This… this…”<br/><br/>At the same time, at the back of the two large tribes, more than a dozen people who had been following them saw this scene. Their faces were filled with shock.<br/><br/>“That expert is a rank eight divine emperor. Furthermore, there’s a rank seven divine Emperor Magus who set up a formation in advance. This three-eyed tribe and four-armed tribe are simply courting death!”<br/><br/>An elder in the middle could not help but roar in a low voice.<br/><br/>“I didn’t expect there to be such a powerful expert hiding here.”<br/><br/>They said in a slightly shaken voice.<br/><br/>“Not good, that expert is looking in our direction. Run!”<br/><br/>Suddenly, they sensed that terrifying gaze looking in their direction, and the dozen or so people were filled with shock.<br/><br/>Although they were all rank 6 and 7 divine emperors, they were still filled with fear when faced with an expert who could wipe out two large races.<br/><br/>The dozen of them did not hesitate and fled back to their divine kingdoms in an instant.<br/><br/>Wang Xian’s gaze swept across the dozen of them. There was no fluctuation in his gaze.<br/><br/>“Dragon King!”<br/><br/>The Heaven Array flew over at this moment. His eyes were filled with excitement.<br/><br/>“Let’s collect these corpses. The harvest is pretty good.”<br/><br/>A faint smile appeared on Wang Xian’s face.<br/><br/>Although the two major clans had invaded the Dragon Palace many times and wanted to destroy it, they had also brought a huge amount of resources to the Dragon Palace.<br/><br/>This time around, there were more than 20,000 celestial emperor corpses. There were more than 10,000,000 celestial king level-six and above.<br/><br/>Such a huge amount of terrifying resources could allow the Dragon Palace’s strength to increase tremendously.<br/><br/>“It’s the Dragon King. After this battle, our Dragon Palace should be able to enter the eyes of some factions in the center of the Universe!”<br/><br/>Sky Array said.<br/><br/>“After absorbing the resources this time, with the strength of our Dragon Palace, we are considered not weak among the forces in the center of the Universe!”<br/><br/>Wang Xian smiled and said.<br/><br/>With such strength, it shouldn’t be too difficult for them to protect themselves.<br/><br/>Those forces that wanted to attack the Dragon Palace also had to consider whether it was worth it.<br/><br/>Moreover, they had yet to finish exploring the ruins of the Mohan clan.<br/><br/>Once they were done, the Dragon Palace should be able to obtain another upgrade.<br/><br/>“Let’s go back!”<br/><br/>Wang Xian was in a great mood and returned to the Dragon Palace immediately.<br/><br/>“Prime Minister Gui, get all the members of the Dragon Palace to prepare to increase their strength!”<br/><br/>Wang Xian instructed immediately after returning to the Dragon Palace.<br/><br/>“Dragon King, did you exterminate two large clans?”<br/><br/>Prime Minister Gui’s eyes were filled with excitement.<br/><br/>Wang Xian nodded his head lightly.<br/><br/>“We need to be prepared to enter the center of the Universe!”\t\t\t\t\t\t</div>", "images": {}, "success": true}