{"id": 29, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15071959.html", "title": "Chapter 3015 - Chapter 3015: The 3015 Intruders Of The Dragon Palace Charged Forward", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 3015 - Chapter 3015: The 3015 Intruders Of The Dragon Palace Charged Forward</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 3015: The 3015 intruders of the Dragon Palace charged forward<br/><br/>“At this moment, the Dragon Palace can’t show weakness. At most, I’ll just kill them and turn the world upside down!”<br/><br/>Wang Xian hovered above a piece of land and looked at the ocean in front of him. His eyes revealed a cold expression.<br/><br/>Ever since the races of the universe discovered the starry sky and the Dragon Palace, they thought that they could easily control them. If they thought so, they would be gravely mistaken!<br/><br/>Although the Dragon Palace was not strong, they could still make them pay a heavy price even if they were facing a domain-level race.<br/><br/>“Dragon King, we have checked. Other than a few hundred desolate beasts below the level five of the celestial thearch, there are no other powerful aquatic creatures!”<br/><br/>At this moment, the Heaven Formation and an lie flew over and reported to Wang Xian.<br/><br/>“Are there any treasures around?”<br/><br/>Wang Xian asked.<br/><br/>“We didn’t find any treasure grounds like the wizard refining continent. Even if there are many treasures, it’s probably limited!”<br/><br/>Tian Chen said.<br/><br/>“Let’s go. We’ll go to the other continents to investigate. After that, we’ll transfer the main Dragon Palace to this place!”<br/><br/>Wang Xian said.<br/><br/>“Transfer the main Dragon Palace to this place?”<br/><br/>Heaven’s formation was stunned for a moment. His thoughts were racing as he asked, “Dragon King, is there a problem with our resplendent starry sky?”<br/><br/>“There isn’t any problem at the moment. However, we have to be prepared. Let’s go and search the other ten or so continents!”<br/><br/>Wang Xian shook his head and said to an lie who was beside him.<br/><br/>“It’s the Dragon King!”<br/><br/>An lie nodded and teleported away immediately. Soon, he returned and brought Wang Xian and the rest to another continent.<br/><br/>In the next ten days, Wang Xian and the rest searched every continent.<br/><br/>However, they did not obtain any powerful treasures on more than ten continents.<br/><br/>“Dragon King, there’s another continent. It’s located at the center and is also the largest continent. This continent is tens of thousands of times larger than our Dragon Island!”<br/><br/>There was only one continent left. An lie reported to Wang Xian.<br/><br/>“The last continent should be the main continent of the Mohan clan. Even if it’s destroyed, they should have some treasures there!”<br/><br/>The Heaven Array was glowing by the side.<br/><br/>“Let’s Go!”<br/><br/>As Wang Xian spoke, they arrived at the main continent of the Mohan clan’s ruins in an instant.<br/><br/>They were floating in the sky. The continent in front of them was much larger than the other 17 continents.<br/><br/>However, what made Wang Xian and the rest frown slightly was that there seemed to be a battle happening on this continent. A large number of places had been destroyed!<br/><br/>“It should be the opponents of the Mo Han clan, the skeleton race, who suddenly came here.”<br/><br/>Wang Xian mumbled, “Let’s go. Let’s do a general survey first!”<br/><br/>“Treasure-seeking ant, only treasures above level seven of the Celestial Thearch!”<br/><br/>He gave an order to the treasure-seeking ant and flew rapidly in the air.<br/><br/>He was very fast. He could only roughly scan the entire continent.<br/><br/>“That’s right!”<br/><br/>After flying for ten minutes, Wang Xian’s pupils contracted slightly. His eyes revealed a look of shock.<br/><br/>“There’s someone down there!”<br/><br/>He quickly said.<br/><br/>“What?”<br/><br/>“Could it be that the main continent of the Mo Han clan has been discovered by someone? That’s impossible. If someone had discovered it, how could there be no traces of humans on the other continent?”<br/><br/>Tian Chen’s expression changed slightly as well.<br/><br/>“Conceal yourself. Don’t be discovered!”<br/><br/>Wang Xian said immediately. His body began to turn illusory as his pair of dragon eyes stared at the area below him.<br/><br/>Below him, more than ten figures were using a formation to spar with each other.<br/><br/>The aura emitted from their bodies was around level five celestial thearch.<br/><br/>More than ten level five Celestial Thearch Magi?<br/><br/>“Dragon King, look at their clothes. They look exactly the same as the clothes on some of the corpses we saw!”<br/><br/>At this moment, Tian Chen, who was at the side, revealed a shocked expression. He couldn’t help but exclaim.<br/><br/>The black and white clothes had the word ‘wizard’written in the middle!<br/><br/>The words ‘Mohan clan’were written on their chests!<br/><br/>“There are still people from the Mohan clan alive?”<br/><br/>Wang Xian narrowed his eyes slightly. He was a little shocked.<br/><br/>The Mohan clan was a primary race in the universe. They had already been destroyed for more than a billion years or more.<br/><br/>There were still people on this continent.<br/><br/>“The possibility is very high. They sealed off the entire race’s land. It’s impossible that they wouldn’t keep some kindling!”<br/><br/>Tian Cheng said in a deep voice.<br/><br/>“Let’s go and check it out!”<br/><br/>As Wang Xian said that, he took a look at his surroundings. The incipient Saint Wings appeared behind him and instantly flew toward the dozen of people below.<br/><br/>“Who is it?”<br/><br/>When Wang Xian flew over, the dozen of people looked over in puzzlement. They didn’t have any excessive reactions.<br/><br/>In their sealed space, there were only their own people.<br/><br/>However, in the next moment, they fainted before they could see who it was.<br/><br/>“Soul Catcher!”<br/><br/>Wang Xian walked to an old man and waved his arm.<br/><br/>Buzz<br/><br/>A stream of information entered Wang Xian’s mind, causing him to frown slightly.<br/><br/>Ten minutes later, he opened his eyes.<br/><br/>“Dragon King, how is it?”<br/><br/>Tian Chen and the rest immediately asked.<br/><br/>“The situation is a little unfavorable. On this continent, the Mohan clan has left behind the tinder. Currently, there are over ten billion of them living on this continent!”<br/><br/>Wang Xian revealed a solemn expression. “Furthermore, according to the memories I obtained, the strongest descendants of the Mohan clan’s Tinder have already reached the peak of celestial thearch, and there are a total of ten of them!”<br/><br/>“What? !”<br/><br/>Tian Chen, an lie, and the rest were astonished.<br/><br/>Ten Magi at the peak of Celestial Thearch was a very powerful force even for a domain-level race.<br/><br/>“This is bad news for us. However, there is good news. The flame seed of the Mohan clan can’t leave this continent for the time being!”<br/><br/>“This continent is covered by a chaotic array formation. Unless the Mohan clan can produce a universe knight, they will be trapped here forever!”<br/><br/>Wang Xian said.<br/><br/>Out of the 18 continents, only the main continent had the Mohan clan’s flame seed. Due to the lack of resources, they had never produced a universe knight.<br/><br/>Without a universe knight, they would be trapped here forever.<br/><br/>“The Mohan clan must have left all their treasures on this continent. What a pity!”<br/><br/>Heaven array shook his head in disappointment.<br/><br/>Even if it was the Mohan clan’s kindling, it was not something they could deal with.<br/><br/>“Let’s go. Before we have the strength of a peak divine emperor, we should not come into contact with the Mohan clan’s kindling for the time being!”<br/><br/>Wang Xian said to an lie.<br/><br/>According to the information they received, the Mohan clan was not a kind-hearted clan.<br/><br/>It was best not to come into contact with them before they had the strength to talk to them as equals.<br/><br/>Wang Xian did not kill the dozen or so people from the Mohan clan. They did not see him and his group and could not leave this continent. There was nothing to worry about.<br/><br/>“It’s the Dragon King!”<br/><br/>An lie nodded.<br/><br/>Since then, the ruins of the Mohan clan’s dragon palace had almost been explored. The results did not satisfy Wang Xian too much.\t\t\t\t\t\t</div>", "images": {}, "success": true}