{"id": 23, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15071947.html", "title": "Chapter 3009 - Chapter 3009: Wizard Refining Continent", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 3009 - Chapter 3009: Wizard Refining Continent</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 3009: wizard refining continent<br/><br/>The nine-colored light enveloped the entire continent.<br/><br/>The energy of the nine attributes was displayed by a special formation.<br/><br/>Located at the bottom, the entire continent looked extremely flat. There were no buildings on it.<br/><br/>There were praying mats for cultivation.<br/><br/>The nine-colored light divided the entire continent into nine sections. They were located at the center. They could see a nine-colored light pillar.<br/><br/>“What is this?”<br/><br/>Wang Xian’s dragon eyes sized up the world. His face was filled with astonishment.<br/><br/>The entire continent was obviously much smaller than the previous one.<br/><br/>However, this continent looked very magical.<br/><br/>“It looks a little like a training hall!”<br/><br/>Tian Chen and the rest frowned slightly and guessed.<br/><br/>A training hall was a training hall owned by a powerful force. It was similar to the dragon field of the Dragon Palace.<br/><br/>“Let’s go to the center!”<br/><br/>Wang Xian said and immediately flew toward the center of the light pillar.<br/><br/>Their speed was very fast. Without searching for treasures, it would only take them a few minutes to reach the center.<br/><br/>“What’s This?”<br/><br/>When Wang Xian and the rest approached the center, the treasure-seeking ant tentacles on their shoulders emitted a dazzling light.<br/><br/>“There are treasures!”<br/><br/>Wang Xian narrowed his eyes slightly and stopped in front of the light pillar.<br/><br/>He looked down and saw nine huge pools.<br/><br/>There were various colored liquids in the pools. This light pillar was emitted from this pool.<br/><br/>“What is this thing? It’s so magical!”<br/><br/>Ba Qi could not help but ask.<br/><br/>“I realized that I can easily sense all kinds of elemental energy here.”<br/><br/>The Heaven Formation stood at the side. With a wave of his arm, a formation was formed.<br/><br/>He waved his arm again and the formation dissipated. The energy merged into the surrounding void.<br/><br/>Wang Xian and the rest looked at the Heaven Formation.<br/><br/>“This should be the training ground of the Mohan clan. If you set up a formation here, the speed will increase tenfold and the consumption will be minimal. If you practice setting up a formation here, you will receive a huge boost!”<br/><br/>Sky Array said to them.<br/><br/>After he finished speaking, he looked at the pools below. In each pool, there were nineteen futons.<br/><br/>Sky Array’s figure moved, landing on the futons and sitting cross-legged there.<br/><br/>“Dragon King, this is the holy land for formation wizards to cultivate. Look at these futons. Every futon is a peak-stage divine emperor treasure!”<br/><br/>Following that, Tian Chen looked at the praying mats under him and exclaimed in shock.<br/><br/>“What? It’s so abnormal?”<br/><br/>Tian Chen and the rest exclaimed and immediately flew down.<br/><br/>Wang Xian also flew down immediately.<br/><br/>“Dragon King, look. They are indeed praying mats at the peak of the celestial thearch level. This is definitely the Holy Land for the Mohan clan to cultivate!”<br/><br/>Tian Chen said affirmatively.<br/><br/>“These praying mats are indeed at the peak celestial emperor-level. There are 19 in one pool and more than 100 in nine pools. It’s really a big deal!”<br/><br/>“This is the foundation of the primary races in the Universe!”<br/><br/>He said with slight shock.<br/><br/>More than 100 peak celestial emperor-level treasures, placed around the Mohan clan ruins, would definitely cause a huge sensation.<br/><br/>“Dragon King, I plan to let the Dragon Wizards come here to cultivate. If they cultivate here, it will greatly increase their combat strength!”<br/><br/>Heaven array immediately said.<br/><br/>“Sure!”<br/><br/>Wang Xian nodded his head.<br/><br/>The Dragon Field of the Dragon Palace did not have any treasures specifically for the cultivation of wizards. The most powerful thing about the dragon field was that it could increase one’s comprehension ability.<br/><br/>It was completely different from this place. This was a treasure ground used to increase the proficiency of the formation.<br/><br/>It just so happened that it complemented the dragon field of the Dragon Palace.<br/><br/>“An lie, go and fetch all the dragon wizards. Ao yaoao crab, Ba Qi, check the surrounding areas and see if there are any treasures. I will increase my strength First!”<br/><br/>Wang Xian instructed them one by one.<br/><br/>“Yes!”<br/><br/>The few of them replied immediately.<br/><br/>Wang Xian gave the treasure-seeking ant to Ba Qi. He walked to the side of the pond and took out pills one by one.<br/><br/>On the previous continent, Wang Xian did not obtain many medicinal pills. On the other hand, there were quite a number of divine herbs and divine trees.<br/><br/>The most precious ones were the four reverse flow hearts.<br/><br/>The reverse flow heart was a divine flower at the peak of the divine emperor level. With the addition of the other medicinal pills, it was sufficient to increase his strength.<br/><br/>“Ding! Congratulations to host for increasing your level and breaking through to the second level of the Void Divine Emperor!”<br/><br/>“Ding, Congratulations to host for comprehending the Laws of the Divine Dragon, five Elemental Dragon Claws!”<br/><br/>Soon, the system’s voice rang out. Waves of extremely powerful aura rushed out from Wang Xian’s body.<br/><br/>At the position of his two palms, five-colored rays of light lingered on his fingers.<br/><br/>The rays of light slowly condensed into a five-colored divine dragon and entered Wang Xian’s palm.<br/><br/>Name: Wang Xian<br/><br/>Race: Yin-yang Five Elements Divine Dragon (man-dragon unity)<br/><br/>Level: void God Emperor Level 2(eighth form of the Divine Dragon Transformation)<br/><br/>Origin: 123960/10000000000000<br/><br/>Divine ability: ruling the water tribe (ruling the water tribe below one’s own level)<br/><br/>Devouring creatures (devouring creatures to extract the origin)<br/><br/>Control of the five elements<br/><br/>Cultivation Method: Divine Dragon Transformation<br/><br/>Divine Ability: soul capture, spirit attachment<br/><br/>Law Divine Ability: Dragon Eye Lock, five Elemental Dragon Claw<br/><br/>Aspect: five elemental great mill, Dragon Country in the palm, Dragon Head under the sky, Dragon Body of ten thousand miles, yin and yang poles, yin and yang five elemental alms bowl, divine dragon tail swing!<br/><br/>Control Law: metal, wood, water, fire, Earth, light, dark wind<br/><br/>Divine Country: Dragon Palace<br/><br/>Dragon Palace: Grade-9.<br/><br/>Dragon Palace members: 1032450<br/><br/>“Hu!”<br/><br/>He opened his eyes and revealed a smile.<br/><br/>“God Emperor Rank 2. My current combat strength can reach the void God Emperor Rank 8!”<br/><br/>He clenched his fist and felt the powerful strength. He was full of smiles.<br/><br/>With his current strength, he could destroy all the members of the three-eyed race and the four-armed race by himself.<br/><br/>He looked to the side where the dragon shaman members were practicing the array formation.<br/><br/>The tens of thousands of dragon wizards in the Dragon Palace were all at level nine of King God realm. They were not strong, but they were not weak either.<br/><br/>The Heaven Formation was also sitting cross-legged and cultivating quietly.<br/><br/>“Huh?”<br/><br/>However, at this moment, the Heaven Formation, which was sitting cross-legged on the praying mat, raised its eyebrows slightly. With a wave of its arm, it took out an item from its interspatial ring.<br/><br/>“Dragon King, there’s a problem at the entrance!”<br/><br/>He moved and flew over immediately when he saw that Wang Xian had made a breakthrough.<br/><br/>“Eh? What happened? has the formation that you set up at the entrance been broken?”<br/><br/>Wang Xian raised his eyebrows and asked him.<br/><br/>The entrance was naturally the two entrances to the starry sky.<br/><br/>“Yes, the formation that I set up at the entrance was broken by force. It should be someone from the two major clans!”<br/><br/>The Heaven’s formation spoke.<br/><br/>“Two major clans!”<br/><br/>Wang Xian’s eyes revealed a sinister look.<br/><br/>“It seems that the two major clans have not given up on our Dragon Palace. Since that’s the case, we will use their corpses as resources for our Dragon Palace to improve!”<br/><br/>He spoke with a murderous aura.<br/><br/>Coincidentally, he had just broken through to the next level of strength when he started to attack the two major clans.<br/><br/>“It’s the Dragon King!”<br/><br/>Tian Chen nodded, his eyes filled with awe.<br/><br/>He was also filled with killing intent towards the three-eyed tribe and the four-armed tribe that had invaded them time and time again.<br/><br/>Let’s end this once and for all!\t\t\t\t\t\t</div>", "images": {}, "success": true}