{"id": 21, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15071943.html", "title": "Chapter 3007 - Chapter 3007: , The Trapped Old Man", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 3007 - Chapter 3007: , The Trapped Old Man</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 3007: , the trapped old man<br/><br/>“Dragon King, this chessboard is a treasure. It contains a powerful force!”<br/><br/>While Wang Xian was reading the book, Tian Chen picked up Tian Yan chessboard and sized it up. His face was filled with astonishment.<br/><br/>On the other hand, Ba Qi and an lie were curiously sizing up the old man who was sitting cross-legged.<br/><br/>They caressed the old man’s body.<br/><br/>“This book is to introduce the treasures of the Universe!”<br/><br/>Wang Xian handed this book to Tian Chen and took the heaven’s manifestation chessboard.<br/><br/>The Heaven’s manifestation chessboard was something that only wizards could use. It was a relatively powerful existence among acquired Numinous Treasures.<br/><br/>Furthermore, according to the records in the book, there was a crucial reason why the heaven’s manifestation chessboard was comparable to acquired Numinous Treasures.<br/><br/>The Heaven’s performance chessboard wasn’t a postnatal supreme treasure that an individual could use. Instead, it required at least nine people!<br/><br/>These nine people each released nine attribute arrays to attack. The nine attributes complemented each other to increase the attack power.<br/><br/>It wasn’t difficult for nine people to stand on the heaven’s performance chessboard and release nine attributes.<br/><br/>However, if it was just nine people, they could only use the heaven’s performance chessboard to increase the attack power by one point. It wasn’t even comparable to a low-grade numinous treasure.<br/><br/>If the number of people doubled, the heaven acting chessboard would increase by 1%<br/><br/>If the number of people increased by ten times, it would be 10% . If it was a hundred times, it would be 100% . If it was a thousand times, it would be the limit. It would increase by 1,000% .<br/><br/>A Thousand Times was also the limit of the entire heaven acting chessboard.<br/><br/>What kind of concept was this? For example, 9,999 void God Emperor rank seven battle-power heaven arrays standing on the heaven acting chessboard could make all of them have an attack power comparable to a rank eight god Emperor!<br/><br/>To directly cross a level, wasn’t it terrifying?<br/><br/>Of course, all the treasures of the Mo Han ghost technique were given to the clansmen and disciples. There was a reason why only this one treasure was left behind.<br/><br/>Firstly, the Magi on the sky chessboard had to have the same strength. Secondly, every attribute of the array had to be identical. Thirdly, the coordination had to be flawless.<br/><br/>Otherwise, even the slightest mistake could cause the power to be greatly reduced.<br/><br/>It was very harsh.<br/><br/>The entire Mohan clan could find 99 people to control the heaven acting chessboard, but 99 people could only increase it by 10% . It was not even comparable to the Wizard artifact in his hand!<br/><br/>“Keke Keke, this old fellow is able to enter here. His strength is extraordinary. He definitely has many treasures in his interspatial ring!”<br/><br/>At this moment, Ba Qi suddenly pulled out an interspatial ring from the old man’s arm and sized it up with shining eyes.<br/><br/>“Sky Formation, come, come, break it!”<br/><br/>Ba Qi shouted at the sky formation.<br/><br/>“Although this old man is close to extinction, he isn’t dead yet. There is his imprint on it. With his strength, I can’t break it unless I kill him completely. This way, the restriction on the interspatial ring will automatically be removed.”<br/><br/>The sky array said to him.<br/><br/>“Oh? Then let’s send him to his death!”<br/><br/>Ba Qi opened his mouth and said, “Dragon King, his strength should be extraordinary. If he is treated as a resource?”<br/><br/>“How much energy do you think his body still has?”<br/><br/>Wang Xian said to Ba Qi speechlessly as he sized up the old man.<br/><br/>Buzz<br/><br/>His dragon eyes flickered with black and white light as the power of the heart of yin and Yang was activated.<br/><br/>The heart of yin and Yang could determine a person’s level of good or bad!<br/><br/>In the universe, there wasn’t a powerhouse who wasn’t stained with blood. However, the heart of yin and Yang could still determine whether a person was good or evil.<br/><br/>If the heart of Yin and Yang was a treasure, then Wang Xian guessed that it was at least at the peak of the innate supreme treasure level.<br/><br/>“A person’s heart isn’t Evil!”<br/><br/>Through his senses, he could sense that there was still positive energy in the old man’s body.<br/><br/>He hesitated for a moment.<br/><br/>With a wave of his arm, a jade bottle of life force fluid appeared in his hand.<br/><br/>“Dragon King, you want to save him?”<br/><br/>Ba Qi asked curiously.<br/><br/>“A righteous person is also a grateful person. To be able to obtain the favor of a powerhouse is also beneficial to us!”<br/><br/>Wang Xian opened his mouth and said. A jade bottle of life force fluid landed directly in the old man’s body.<br/><br/>“That’s true. This old man’s body has no energy left!”<br/><br/>Ba Qi muttered.<br/><br/>The vitality fluid landed on the old man’s head and was absorbed by him rapidly.<br/><br/>His body was like a sponge as he absorbed it crazily.<br/><br/>Wang Xian watched quietly from the side.<br/><br/>The old man was not dead to begin with. Instead, he was starving. As long as he had energy, he could recover quickly.<br/><br/>“Dragon King, this heaven acting chessboard is very useful to US Dragon Wizards!”<br/><br/>Heaven’s formation, who was at the side, said to Wang Xian. After reading the book, his eyes revealed an excited look.<br/><br/>“My over 10,000 underlings of dragon wizards can use this chessboard. They can increase its power to the maximum!”<br/><br/>Heaven’s formation continued.<br/><br/>“Alright!”<br/><br/>Wang Xian nodded. He could tell that this heaven acting chessboard was very suitable for Dragon Wizards.<br/><br/>Dragon Wizards were able to learn all kinds of sorcery and formations in a unified manner. They had almost insane coordination.<br/><br/>The heaven acting chessboard was perfect for them!<br/><br/>“Continue to check the surroundings. There should be many useful books here. Put them away!”<br/><br/>Wang Xian said to the heaven acting chessboard.<br/><br/>“It’s the Dragon King!”<br/><br/>The few of them nodded their heads and immediately flew toward the secret compartments.<br/><br/>“Cough… cough…”<br/><br/>The old man in front of him let out a weak voice.<br/><br/>Wang Xian looked down and saw that his head, which was almost skin and bones, was gradually becoming plump.<br/><br/>Traces of flesh and blood were born, and his face turned round and red.<br/><br/>The Vitality Elixir was a powerful treasure at the level of a venerable. It could heal irreversible injuries.<br/><br/>Even if a bottle of vitality elixir could not completely heal the old man, it could at least restore 1% of his body. It would not be a problem for him to fly normally!<br/><br/>Flesh and blood were born on the old man’s body. Traces of vitality were emitted from his body.<br/><br/>Wang Xian watched quietly.<br/><br/>Ten minutes later, the flesh and blood on the old man’s body had completely recovered. Furthermore, he had turned into a slightly chubby old man.<br/><br/>Judging from his body size, he should weigh at least 300 kilograms according to Earth.<br/><br/>He was very chubby.<br/><br/>“Was it this benefactor who saved my life?”<br/><br/>The old man opened his eyes and stood up slowly. He bowed to Wang Xian.<br/><br/>Wang Xian nodded his head.<br/><br/>“I, Ming Xuanzhi, thank you for saving my life!”<br/><br/>Ming xuanzhi bowed again in gratitude. His fingers moved as he calculated, “This time, it will be more than 80 million years!”<br/><br/>“You’ve been here for more than 80 million years?”<br/><br/>Wang Xian looked at him in astonishment.<br/><br/>“Yes, benefactor. I entered this place more than 80 million years ago. The owner of this place is obviously a sly old man. The moment I picked up the chessboard that day, the formation here was activated and locked me in Here!”<br/><br/>“With my strength, I can’t break the formation at all. Furthermore, after I absorbed the spiritual energy here, I still have no way to break all my treasures. I have no choice but to restrain all my life force and leave everything to Fate!”<br/><br/>“It’s also fortunate that benefactor you came, or else I would really have passed away!”<br/><br/>Ming Xuanzhi said bitterly.<br/><br/>“What? Old Man, you said that all the treasures on you are gone?”<br/><br/>At this time, Ba Qi flew over and stared at him as he asked.\t\t\t\t\t\t</div>", "images": {}, "success": true}