{"id": 27, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15071955.html", "title": "Chapter 3013 - Chapter 3013: Universal Ai", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 3013 - Chapter 3013: Universal Ai</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 3013: universal AI<br/><br/>“Dragon King, the upgrade of all the members of the Dragon Palace has been arranged. This is some news that we have received around the Mohan clan’s racial ruins during this period of time. We have also purchased some universal AI from there!”<br/><br/>In the Dragon King’s Hall, Prime Minister Gui came to report after he had arranged for all the members of the Dragon Palace to enter the Dragon Transformation Pool to cultivate.<br/><br/>When Wang Xian brought the sky array and an lie into the Mohan clan’s racial ruins, Prime Minister Gui had already sent Mo sha and the rest to the surroundings of the Mohan clan’s ruins to get in touch with the center of the universe.<br/><br/>The universe’s artificial intelligence was the communication tool of the center of the universe.<br/><br/>This was also the mainstream communication tool of the center of the universe. It was released by the Universe Artificial Intelligence Group!<br/><br/>The universe artificial intelligence was known as the safest communication tool. It had existed for a long, long time.<br/><br/>It was rumored that it was built with an extremely powerful spiritual treasure that could split the heavens.<br/><br/>It could be said that it was built, but it could also be said that it was the use of the spiritual treasure by the Masters of the universe.<br/><br/>Wang Xian also saw the description of the Cosmic Brain in the Treasure Book of the Mo Han Ghost Technique.<br/><br/>It was written that the core of the cosmic brain was a spiritual treasure that could split the heavens. People’s consciousness could enter it.<br/><br/>The entire treasure contained endless space.<br/><br/>Hence, there were experts who studied this endless space. Following that, communication and communication were slowly researched and brought into a special carrier.<br/><br/>With time, more and more things formed in this endless space, becoming a second universe.<br/><br/>Here, one could truly play, entertain, and even cultivate.<br/><br/>If a person entered the AI, the universe’s AI would be able to sense the strength of a person’s body.<br/><br/>The body within the AI would have the same body strength. As for combat techniques and various laws and abhijnas, they could also be used within the AI.<br/><br/>The AI could even fight, and there were countless experts within.<br/><br/>Once one became famous within the universe’s AI, it was equivalent to becoming famous within the universe.<br/><br/>This was because the universe’s AI world was connected to reality.<br/><br/>The powerful universe’s AI was recorded in that book as the most likely existence of the heaven-splitting treasure.<br/><br/>No one could obtain other people’s information from the universe’s AI, so the entire universe’s AI was very safe.<br/><br/>Wang Xian had some understanding of the universe’s AI from the three-eyed race and the four-armed race’s powerhouses that he had absorbed.<br/><br/>He took the AI from Prime Minister Gui and sized it up.<br/><br/>The AI was about the size of a palm and there were lines on it. With a thought, he sent his consciousness into it.<br/><br/>Buzz<br/><br/>The next moment, Wang Xian sensed that he was floating in the sky above a vast continent. The entire continent was extremely huge.<br/><br/>This continent was built based on the heaven-splitting and prehistoric land in the center of the universe.<br/><br/>On the continent, there were all kinds of buildings and countless living beings.<br/><br/>Wang Xian’s mind stirred. Images appeared in front of his eyes. Like a computer, he could understand any information.<br/><br/>Among them, the most eye-catching part was a ranking of the races in the universe.<br/><br/>When he opened it, he realized that it was only ranked below the middle-level races in the universe. There weren’t even any high-level races in the universe, let alone the dominant races in the universe.<br/><br/>For example, a high-level race in the universe, a dominant race, was no longer something that ordinary people could speculate about.<br/><br/>Every single race like them had experienced a cataclysm, or even several cataclysmic events.<br/><br/>One must know that a cataclysm was more than 30 billion years old.<br/><br/>For the existence of such races, no one knew how deep their trump cards were and how strong they were.<br/><br/>How could they be ranked randomly?<br/><br/>Wang Xian took a casual look and returned to reality.<br/><br/>“The universe’s AI is much stronger than the technological ai!”<br/><br/>Wang Xian sighed slightly.<br/><br/>“Hehe, yes, Dragon King. Recently, Ao Jian has been entering the universe’s AI to Spar with various sword cultivators.”<br/><br/>“Practicing in the universe’s AI is no different from practicing in reality. It can even simulate various terrain and challenge experts from all walks of life in the universe.”<br/><br/>“This is also one of the reasons why the center of the universe is so powerful.”<br/><br/>Prime Minister Gui said with a smile.<br/><br/>Wang Xian nodded his head slightly. The cosmic brain was indeed very useful for actual combat training.<br/><br/>However, in the cosmic brain, if the person he condensed were to be shattered, it would cause some damage to his or her spirit. The damage would not be great, but if he or she could not enter the brain within ten years, it would be best not to be shattered again within a hundred years, otherwise, he wouldn’t be able to condense his body within a thousand years.<br/><br/>“After exterminating the two tribes this time, we should be completely exposed in the resplendent starry sky. Make some preparations to deal with the external forces and alert all the members!”<br/><br/>“Also, tell the wind god Dragon and the rest not to go out for the time being and to cultivate in the Dragon Palace!”<br/><br/>Wang Xian instructed Prime Minister Gui.<br/><br/>“It’s the Dragon King!”<br/><br/>Prime Minister Gui nodded.<br/><br/>“An lie, let’s continue to explore the ruins of the Mohan clan!”<br/><br/>Wang Xian called an lie and continued to explore the various continents of the Mohan clan ruins with the Heaven Array.<br/><br/>…<br/><br/>“It’s over, everything is over!”<br/><br/>At the same time, in the territory of the three-eyed race not far away from the ruins of the Mohan clan, the three-eyed chief was sitting on a divine throne in his divine kingdom. His face was pale as he stood up slowly, he made a difficult decision and flew out.<br/><br/>“What? All the clansmen who went out with you were all killed?”<br/><br/>Soon, in the main hall of the three-eyed race, dozens of elders and deacons who were guarding the race looked at the leader in shock. Their bodies were trembling!<br/><br/>“The other party has an eighth level divine emperor!”<br/><br/>The clan leader of the three-eyed race leaned on his divine throne, his face extremely pale. “Inform the other elite disciples of the three-eyed race to bring all the treasures and resources to meet up. We will hide for the time being!”<br/><br/>“Also, inform all the other clansmen to immediately hide and wait for the reconstruction of our three-eyed race!”<br/><br/>The clan leader of the three-eyed race announced weakly and unwillingly.<br/><br/>He had never expected that this expedition would be an opportunity. He had never expected it to be a disaster.<br/><br/>Eighty percent of the experts in the race had been killed. The three-eyed race was finished!<br/><br/>In order to prevent the Dragon Palace from taking revenge and the other races from knowing about this news, they had to escape in advance.<br/><br/>Otherwise, even if the experts of the Dragon Palace didn’t come, the other races would come and take a bite of their territory and paradise.<br/><br/>“Disband the races!”<br/><br/>The remaining races of the three-eyed race had blood-red eyes and their bodies trembled.<br/><br/>Once disbanded, it would be very difficult to rebuild and restore their glory.<br/><br/>Then, they would become rootless trees and water in the universe.<br/><br/>“The people of the Dragon Palace actually destroyed all of our experts. The Dragon Palace is so cruel!”<br/><br/>“We Want Revenge! Revenge!”<br/><br/>An old man could not help but roar angrily, filled with hatred.<br/><br/>“How do we take revenge?”<br/><br/>An old man beside him held his head in despair.<br/><br/>“Clan leader, we have a chance to take revenge. Not long ago, God Emperor Hong Tian announced the establishment of a domain race and the recruitment of experts. If we…”<br/><br/>At this moment, an old man suddenly raised his head and said through gritted teeth!<br/><br/>Hearing his words, everyone’s hearts trembled slightly.<br/><br/>Even the three-eyed clan leader’s expression kept changing.<br/><br/>Everyone else understood his meaning.<br/><br/>However, joining a force established by an expert meant that they would never have the chance to rise up.<br/><br/>It meant that their three-eyed clan would completely disappear from the universe.\t\t\t\t\t\t</div>", "images": {}, "success": true}