{"id": 25, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15071951.html", "title": "Chapter 3011 - Chapter 3011: Had Single-Handedly Killed Tens Of Thousands Of People", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 3011 - Chapter 3011: Had Single-Handedly Killed Tens Of Thousands Of People</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 3011: had single-handedly killed tens of thousands of people<br/><br/>“Hehehe, you’re saying that our people are courting death. I think your Dragon Palace is courting death as well!”<br/><br/>When the four-armed clan leader heard Wang Xian’s words, a sinister look appeared on his face.<br/><br/>The three-eyed clan leader’s gaze was cold as well. He sized up Wang Xian from head to toe and sensed his strength. He was prepared to make his move.<br/><br/>“Hehe, you will soon know who will die next!”<br/><br/>Wang Xian smiled faintly. Heaven’s formation, who was at the side, took out a wizard artifact that he had obtained from the Mohan tribe. He waved his arm gently.<br/><br/>Buzz! Buzz! Buzz<br/><br/>In the next moment, waves appeared in the void. Unlike the formation, this was the new space-locking formation that Heaven’s formation had mastered. It could seal the entire void.<br/><br/>“Huh?”<br/><br/>Everyone from the four-armed tribe and three-eyed tribe who were suddenly enveloped by the formation was slightly stunned.<br/><br/>“They actually dare to seal us? Are they courting death?”<br/><br/>“This is a space-locking formation, what are these two guys trying to do?”<br/><br/>“Do they think they can fight us with just their strength? They’re simply courting death!”<br/><br/>“Kill them!”<br/><br/>When the four-armed race and the three-eyed race saw the formation enveloping them, some of them revealed furious expressions.<br/><br/>However, there were still many who revealed a hint of wariness on their faces.<br/><br/>Since the other party dared to use a sealing formation to envelop them, it was definitely not just to scare them.<br/><br/>Moreover, some experts could sense that this sealing formation was very strong.<br/><br/>“Break this sealing formation!”<br/><br/>The three-eyed race’s leader’s pupils constricted slightly as he immediately gave the order.<br/><br/>“Do it!”<br/><br/>The four-armed tribe leader also gave the order immediately.<br/><br/>Being enveloped by this sealing formation, they always felt uneasy.<br/><br/>The two tribe leaders gave the order. Behind them, more than a dozen level seven celestial thearch powerhouses immediately took action.<br/><br/>However, at the moment when they took action, Wang Xian also took action.<br/><br/>Whoosh<br/><br/>The uninitiated holy wings were unfurled. His speed had reached an extremely terrifying level.<br/><br/>“Dragon Eyes Lock All Corners!”<br/><br/>A terrifying pressure shot out from Wang Xian’s eyes as he charged straight at them.<br/><br/>In his dragon eyes, the shadows of the nine divine dragons charged out, dragging long chains behind them.<br/><br/>“Crash!”<br/><br/>The speed of the nine shadows of the Divine Dragons was extremely terrifying. In the blink of an eye, they had arrived in front of the group of powerhouses at the forefront of the two large tribes.<br/><br/>“Oh no, what kind of attack is this?”<br/><br/>When Wang Xian attacked with his laws and Abhijna, the expressions of the four-armed tribe leader and the three-eyed tribe leader at the forefront instantly changed drastically.<br/><br/>Their pupils contracted slightly and they were filled with shock.<br/><br/>“Defend, defend against this attack First!”<br/><br/>The black pupil on the forehead of the three-eyed tribe leader revealed a shocked expression. He immediately shouted loudly.<br/><br/>“What’s going on?”<br/><br/>The tens of millions of people from the two large tribes behind heard the astonished voice of the three-eyed tribe leader. Their faces revealed a look of shock.<br/><br/>“Attack!”<br/><br/>The other dozen or so level seven celestial thearch powerhouses also felt the threat of the dragon eyes locking onto the surroundings. Their expressions changed instantly and they immediately went up to meet the attack.<br/><br/>“Roar!”<br/><br/>At this moment, Wang Xian rushed over at a terrifying speed.<br/><br/>His gaze was locked onto the leader of the four-armed race. His eyes were filled with killing intent.<br/><br/>“Damn it, he is a level eight divine emperor!”<br/><br/>When the four-armed race saw Wang Xian’s terrifying speed, a look of horror appeared on their faces as they shouted sternly.<br/><br/>His four arms suddenly lengthened. Long Spears appeared on his palms one by one as he attacked Wang Xian directly.<br/><br/>“Die!”<br/><br/>However, his speed was too slow in Wang Xian’s eyes.<br/><br/>Now that he had the combat strength of a peak level eight celestial thearch, he could instantly kill a level eight celestial thearch powerhouse.<br/><br/>A level seven celestial thearch powerhouse, even if he was the clan leader of a clan, would be useless even if he had many treasures.<br/><br/>“PFFT!”<br/><br/>The clan leader of the four-armed clan wanted to attack Wang Xian.<br/><br/>However, Wang Xian flapped his incipient saint wings and instantly appeared behind him.<br/><br/>“What terrifying speed!”<br/><br/>The pupils of the clan leader of the four-armed clan shrunk and a look of astonishment appeared on his face.<br/><br/>The current Wang Xian’s speed was comparable to a level nine celestial thearch.<br/><br/>The clan leader of the four-armed clan didn’t have the time to react at all.<br/><br/>“PFFT!”<br/><br/>The next moment, Wang Xian’s palm directly entered the body of the clan leader of the four-armed clan. A destructive energy was dissipating his vitality.<br/><br/>The leader of the four-armed race widened his eyes and his body trembled!<br/><br/>“HMPH!”<br/><br/>A Soft Humph was heard by his ear.<br/><br/>“Hualala!”<br/><br/>At this moment, chains were wrapped around the entire space.<br/><br/>With the activation of the primaless saint wings, Wang Xian instantly charged toward the next level seven celestial thearch powerhouse.<br/><br/>“What!”<br/><br/>“This is impossible!”<br/><br/>An extremely shocked voice came from behind. Everyone from the four-armed race was filled with shock when they saw their leader being killed instantly.<br/><br/>Their clan leader was actually killed instantly!<br/><br/>This was their clan leader, a level seven celestial thearch powerhouse.<br/><br/>“That person is a level eight celestial thearch powerhouse!”<br/><br/>At the back, a celestial thearch roared out in fear.<br/><br/>A level eight celestial thearch powerhouse was such an existence that surpassed the two major races.<br/><br/>This was bad!<br/><br/>Just when everyone from the two major races had a bad feeling, Wang Xian’s figure appeared beside a level seven celestial thearch powerhouse from the three-eyed race.<br/><br/>“Die!”<br/><br/>When the three-eyed race powerhouse saw Wang Xian attacking him, his eyes turned blood-red instantly as he roared desperately.<br/><br/>“You’re the one who’s going to die!”<br/><br/>A terrifying attack came at Wang Xian. He did not dodge it at all.<br/><br/>He raised his arm and his dragon claw enlarged. It was the five Elemental Dragon Claw!<br/><br/>The five Elemental Dragon Claw was covered by the five attributes of metal, wood, water, fire, and earth. The light interweaved and formed a grayish energy.<br/><br/>It was an attack that was filled with the power of death that could easily destroy a level seven celestial thearch of the three-eyed race. The Dragon Claw grabbed his body.<br/><br/>As if he had experienced a long river of time, the life force in his body was instantly wiped out.<br/><br/>“Surround and attack him!”<br/><br/>The three-eyed race’s leader and a level seven celestial thearch saw Wang Xian instantly killing the two of them. They shouted in horror.<br/><br/>“Law-based divine ability: eye of Death!”<br/><br/>“Law-based divine ability: four arms reaching the sky!”<br/><br/>A violent roar was heard. The level-seven godly monarchs did not dare to hold back. They immediately cast their law-based divine abilities and attacked Wang Xian.<br/><br/>“You are too slow. If you want to destroy our Dragon Palace, I will make you pay with your lives today!”<br/><br/>When Wang Xian saw their attacks, he revealed a look of disdain.<br/><br/>He moved his body and easily dodged everyone’s attacks. He floated in the void at the side and commanded the judges.<br/><br/>“Dragon Eye Lock, eight desolates, five elemental dragon claws, explode!”<br/><br/>Wang Xian stared at the twelve level seven celestial thearch powerhouses in front of him. The chains around him pierced through them directly.<br/><br/>An incomparably huge dragon claw appeared in the Void. The grayish dragon claw looked ferocious and terrifying.<br/><br/>It contained the power of death.<br/><br/>The chains and Dragon Claws covered them.<br/><br/>“Eye of the Dead Spirit!”<br/><br/>The three-eyed clan leader’s heart trembled when he saw this terrifying attack.<br/><br/>He moved his palm and a strange pupil appeared in his hand.<br/><br/>A dead spirit floated out of the pupil and enveloped him.\t\t\t\t\t\t</div>", "images": {}, "success": true}