{"id": 30, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15071961.html", "title": "Chapter 3016 - Chapter 3016: The 3016 Intruders Of The Dragon Palace Were In The Midst Of Killing", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 3016 - Chapter 3016: The 3016 Intruders Of The Dragon Palace Were In The Midst Of Killing</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 3016: The 3016 intruders of the Dragon Palace were in the midst of killing<br/><br/>Out of the 18 continents, except for the two continents that were investigated in detail, the rest of the continents were all roughly investigated.<br/><br/>The main continent had the kindling of the mo-han clan. The other continents basically didn’t have any valuable treasures.<br/><br/>This completely destroyed Wang Xian’s hopes of achieving a breakthrough.<br/><br/>He had originally planned to use the ruins of the mo-han clan to elevate himself to the peak of the Celestial Emperor Realm. At that time, with his strength, he wouldn’t have to fear any strength in this void space.<br/><br/>Now…<br/><br/>“Prime Minister Gui, get all the members of the Dragon Palace to prepare. We will move the main dragon palace to the mainland within the Mo-han clan’s ruins!”<br/><br/>Wang Xian returned to the Dragon Palace and instructed.<br/><br/>“HMM? Dragon King, what about our side?”<br/><br/>Prime Minister Gui pondered for a moment and asked.<br/><br/>“We will continue to manage the resplendent starry sky. Whoever dares to provoke us now, we will not be afraid even if we retreat to the Mohan clan.”<br/><br/>Wang Xian said.<br/><br/>“Alright. Fighting with these races and races at the center of the Universe will also help the Dragon Palace to improve rapidly. Hehe!”<br/><br/>Prime Minister Gui nodded. His eyes were flickering with a sinister look.<br/><br/>“Dark Intense Heaven Array, go and prepare. Set up a large altar and teleport the Dragon Palace directly.”<br/><br/>Wang Xian immediately ordered the dark intense heaven array.<br/><br/>“It’s the Dragon King!”<br/><br/>The two of them nodded and went to prepare immediately.<br/><br/>Half an hour later, all the members of the Dragon Palace returned to the Dragon Palace.<br/><br/>The main dragon palace had gone through a migration.<br/><br/>The enormous Dragon Palace appeared directly on the Divine Dragon Continent.<br/><br/>The Divine Dragon Continent was what the Dragon Palace called it. Eighty percent of the continent was an ocean, and the vast ocean was the perfect place for the Dragon Palace to live.<br/><br/>“Dragon King, the ocean on this continent is much bigger than our Dragon Island. It’s more comfortable here!”<br/><br/>The leaders of the dragon palace sized up the entire ocean. They were very satisfied with this.<br/><br/>“We retreated here so that we don’t have to worry about anything. The members of the Dragon Palace and the devouring dragon only amount to two million. It’s considered a relatively small number among the masses in the universe.”<br/><br/>“This also makes it easier for us to move without any worries. If anyone dares to attack our Dragon Palace, we will counterattack directly!”<br/><br/>Wang Xian said to the group of members.<br/><br/>“Jie Jie Jie, this is interesting, regardless of what race, as long as we provoke, we will slowly play with them!”<br/><br/>Octaqi smiled eerily, his eyes shining with excitement.<br/><br/>“Well, it’s better that the other races don’t have any ideas about us!”<br/><br/>“Then we can officially enter the center of the universe and seek development!”<br/><br/>Prime Minister Gui said with a smile.<br/><br/>“Alright, let’s familiarize ourselves with this continent first.”<br/><br/>Wang Xian said with a smile. With a move of his body, he brought an lie to more than a dozen other continents to build a dragon palace.<br/><br/>The dragon palaces could be teleported to each other. This way, it would be much more convenient for the members of the Dragon Palace to enter the other continents in the future.<br/><br/>Moreover, he had yet to thoroughly search the other dozen or so continents.<br/><br/>Putting everything aside, he could still find a few thousand divine emperor-level divine artifacts. This was a huge sum of income.<br/><br/>Just as the Dragon Palace was moving and Wang Xian was searching for treasures…<br/><br/>Some people from some factions had already stepped into the resplendent starry sky around the ruins of the Mohan clan in the center of the universe.<br/><br/>Many factions were filled with curiosity regarding the information regarding the three-eyed race and the four-armed race.<br/><br/>Especially those domain-level races. They were quite powerful and were not afraid of the Dragon Palace, so they naturally sent people to investigate.<br/><br/>During the two months, many people had already arrived on the planet in the eight barrens and six directions.<br/><br/>“There are many people from other forces around!”<br/><br/>“If it’s really like what the three-eyed race and the four-armed race said, who wouldn’t want to come and take a bite? There’s a life planet in front of us. Let’s Go!”<br/><br/>In the desolate space, the five elders swept their gaze across the surroundings and landed on the planet in front of them. They said with smiles on their faces.<br/><br/>“Let’s Go!”<br/><br/>The five people moved and immediately flew over.<br/><br/>These five people had two horns on their heads. Their bodies contained a fierce aura and their noses were very big.<br/><br/>They were a domain-level race around the Mo Han clan.<br/><br/>An ordinary domain-level race had a divine emperor level nine expert guarding it. A powerful domain-level race had a peak divine emperor expert guarding it.<br/><br/>The five of them were all sixth-level divine emperor experts. Sending such experts here, one could imagine how much importance they placed on this starry sky.<br/><br/>“Sou!”<br/><br/>The few of them moved very quickly and soon floated above the planet.<br/><br/>“The people on this planet are really weak. Let’s go and find some people to verify the information!”<br/><br/>The five of them moved and instantly landed in a luxurious manor.<br/><br/>“Who?”<br/><br/>When the people in the manor saw the five people who suddenly appeared, their expressions changed slightly.<br/><br/>When they saw their faces, their pupils constricted slightly.<br/><br/>“Buzz!”<br/><br/>An old man in the middle waved his arm, and a stream of energy directly charged toward the godly king expert in the manor.<br/><br/>His face was aghast, his body trembled slightly, and his eyes were dull.<br/><br/>“Tell me everything you know about the Dragon Palace!”<br/><br/>The five stared at him and asked indifferently.<br/><br/>“Ah, who are you people? What do you want?”<br/><br/>At this moment, someone in the manor noticed the situation here and immediately walked over, exclaiming.<br/><br/>“Noisy!”<br/><br/>“Ants!”<br/><br/>The five didn’t even look at him. With a wave of their arms, they directly killed him.<br/><br/>“The Dragon Palace is the ruler of our resplendent starry sky. They…”<br/><br/>The god-king powerhouse with a dull gaze described them one by one.<br/><br/>Hearing his information, the five old men looked at each other, their eyes filled with shock.<br/><br/>They waved their arms and immediately took the AI on their bodies to search for some information about the Dragon Palace.<br/><br/>“These are pictures of the nine divine dragons of the Dragon Palace. They look like… The Legendary Wind Divine Dragons!”<br/><br/>Looking at these pictures, they were slightly shocked.<br/><br/>“The three-eyed race and the four-armed race are not exaggerating at all. They are definitely sub-dragons with strong divine dragon bloodline!”<br/><br/>“And is the development speed of the Dragon Palace really so terrifying? It’s unbelievable!”<br/><br/>“Notify the clan immediately. I think we can send more people over!”<br/><br/>The five people immediately said.<br/><br/>The situation here happened in many places on this planet.<br/><br/>The experts of the domain-level races and clans directly controlled the people on this planet, making them spit out everything they knew.<br/><br/>Ninety-nine percent of the people who were controlled were all killed!<br/><br/>Some of the situation on the nine destruction planet was immediately found out by the experts of the Dragon and Phoenix Divine Dynasty stationed here, and the news was immediately spread out.<br/><br/>At the location of the Dragon Palace, Feng Luan, Guan Shuqing, and the other girls were furious when they heard the news.<br/><br/>Now, the desolate land belonged to the territory of the Dragon and Phoenix Divine Dynasty, and the Dragon and Phoenix Divine Dynasty belonged to the Dragon Palace.<br/><br/>They killed people so brazenly, obviously disregarding the Dragon Palace.<br/><br/>“Little Xian!”<br/><br/>The girls immediately flew toward the Dragon King’s palace.\t\t\t\t\t\t</div>", "images": {}, "success": true}