{"id": 37, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15071975.html", "title": "Chapter 3028 - Chapter 3028: 3027 Clan Establishment Invitation Letter", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 3028 - Chapter 3028: 3027 Clan Establishment Invitation Letter</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 3028: 3027 clan establishment invitation letter<br/><br/>“Everyone from the three-eyed race and four-armed race, we will give you a safe planet. Everyone, follow me!”<br/><br/>“In addition, we will announce and implement the condition we agreed to when we set up the race!”<br/><br/>In the Great Hall, the Hongmen Great Elder said with a smile. He waved his arm and a teleportation array appeared in the middle.<br/><br/>“Oh?”<br/><br/>When the three-eyed race’s four-armed race’s divine emperors saw the teleportation array in the middle, their eyes revealed a look of shock and bewilderment.<br/><br/>“Everyone, follow me. If all of you join our red fog, we will give all of you a safe place to Live!”<br/><br/>As the Hongmen Grand Elder spoke, he directly sat inside the teleportation array.<br/><br/>The three-eyed race’s patriarch and the others hesitated for a moment before following closely behind.<br/><br/>With the Hongmen Elder’s strength, there was no need to lie to them.<br/><br/>Moreover, when the Red Mist race was established, what they needed was a large number of talents and a large amount of resources.<br/><br/>Although the three-eyed race and the four-armed race had already disbanded, there was still a portion of elite disciples and core disciples present.<br/><br/>Mo Han clan’s ruins, one of the 9999 planets.<br/><br/>On an unbroken planet, the Hongmen Elder of the Red Mist race led everyone from the three-eyed race and the four-armed race through the teleportation array with a smile on his face.<br/><br/>“This is?”<br/><br/>The three-eyed race’s four-armed race’s warriors looked at this planet with shock and doubt in their eyes.<br/><br/>“This is one of the 9,999 planets in the Mo Han clan’s ruins, a planet that hasn’t been broken into yet.”<br/><br/>The Hong Men Elder raised his head slightly and said proudly.<br/><br/>Throughout the Mo Han clan’s ruins, countless warriors wanted to break through the arrays and enter, and even universe knights came.<br/><br/>They all had no choice but to return.<br/><br/>However, their teacher had broken through many arrays and obtained several hundred stars.<br/><br/>These stars could only be entered by the Red Mist clan.<br/><br/>“A star that has not been entered, this… could this be a star that Lord Hong Tian God emperor obtained after breaking through the array?”<br/><br/>The Great Beings from the three-eyed race and four-armed race were slightly shocked and asked in shock.<br/><br/>“One of them is that this star can be used to house the members of the three-eyed race in the future. As for the four-armed race, we will also provide you with a Star!”<br/><br/>The Hongmen Elder said with a smile.<br/><br/>“This… Hongmen Elder, Lord God Emperor Hong Tian, how many stars have you deciphered from the Mo Han clan’s ruins?”<br/><br/>The three-eyed race’s clan leader could not help but ask.<br/><br/>“If you are loyal to the Red Fog, you will naturally know very soon.”<br/><br/>“Alright, you can bring your clansmen here. Someone will arrange for you later!”<br/><br/>After saying that, the great elder of Hongmen stepped into the teleportation formation and left.<br/><br/>Seeing him leave, the experts of the three-eyed race and the four-armed race looked at each other.<br/><br/>“Perhaps joining the red mist race now is our best choice!”<br/><br/>An expert of the four-armed race said.<br/><br/>“The Red Mist race has just been established, and God Emperor Hong Tian is so powerful. It is indeed a good choice. If God Emperor Hong Tian is willing to help us deal with the Dragon Palace…”<br/><br/>Everyone spoke slowly, their eyes shining.<br/><br/>“Master, the people from the three-eyed race and the four-armed race have arrived. There shouldn’t be any problems!”<br/><br/>At the same time, the Hongmen Grand Elder who had left did not return to the palace just now. Instead, he came to another planet.<br/><br/>There was an incomparably huge palace on the entire planet. The palace occupied at least one-third of the place.<br/><br/>In the center of the palace, the Hongmen Grand Elder respectfully bowed to the Hong Tian Celestial Emperor.<br/><br/>“Mm, although the strength of the two races is very weak, they still have some foundation. We have absorbed a considerable increase in their strength.”<br/><br/>God Emperor Hong Tian said indifferently.<br/><br/>“Master, now that the Dragon Palace is famous and has strange assassination methods, are we really going to make an enemy of them?”<br/><br/>The Hongmen Elder hesitated for a moment and said.<br/><br/>“That person from the Dragon Palace entered the Divine Garden Star and killed your junior brothers. We should take revenge!”<br/><br/>“Besides, that person from the Dragon Palace has the ability to enter the divine garden star, so they might have entered other planets. Now that the various races are intimidated by the Dragon Palace, the level-nine or even peak-stage god-emperor experts don’t dare to act rashly, but they have been investigating the Dragon Palace’s base!”<br/><br/>“It’s been so long since we’ve found it. The Dragon Palace’s base must be the same as ours, located in the Mo Han clan’s race ruins. They must have also obtained some inheritance from the Mo Han clan’s race.”<br/><br/>“Sooner or later, we’ll still meet the Dragon Palace.”<br/><br/>God Emperor Hong Tian said indifferently.<br/><br/>In the information released by the three-eyed race and the four-armed race, he had already locked onto the expert from the Dragon Palace who killed his disciple.<br/><br/>The hongmen elder nodded slightly.<br/><br/>“Now, the Dragon Palace is able to assassinate a level eight divine emperor expert. The highest level is level nine divine emperor. Although it’s not weak, master, with your skills, you can definitely kill it easily!”<br/><br/>He said respectfully.<br/><br/>“In half a month’s time, we will send an invitation to the Dragon Palace through the Universal Ai. If they come, that would be great!”<br/><br/>God Emperor Hong Tian’s eyes sparkled as he spoke.<br/><br/>“Yes, Master!”<br/><br/>The hongmen elder immediately nodded and retreated.<br/><br/>“Dragon God, the inheritance of the Mohan clan. That Dragon Palace is really lucky. If we can obtain it, it might allow my red mist to step into the level of a primary race in the universe. It might allow me to advance even further!”<br/><br/>God Emperor Hong Tian muttered as he slowly closed his eyes.<br/><br/>…<br/><br/>“Dragon King, the Red Mist race will be established in half a month. Now, they are inviting us to participate in their grand ceremony on the universe’s AI!”<br/><br/>Not long after, Prime Minister Gui walked into the Dragon King’s Hall in the Dragon Palace and reported a piece of news to Wang Xian.<br/><br/>“Red Mist Race? Domain-level race?”<br/><br/>When Wang Xian received the news, he raised his eyebrows slightly.<br/><br/>“Dragon King is a race established by the famous Celestial Emperor Hong Tian in the ruins of the Mohan clan. Celestial Emperor Hong Tian has the strength of a peak celestial emperor and he is also a wizard!”<br/><br/>“Now that he has established a race, he has invited all the races and other domain-level races in the void. I reckon that most of the races will give him face and go there.”<br/><br/>Prime Minister Gui said.<br/><br/>“The ceremony of establishing a race?”<br/><br/>Wang Xian’s eyes revealed a look of contemplation.<br/><br/>“If we go to the Dragon Palace, we might encounter experts from the ancient rare race and the brain spirit race. However, there are some benefits if we go.”<br/><br/>“After our investigation, the forging and pill-making abilities in the center of the universe are not as good as those of the fire hammer race and the Phoenix Dragon Queen. Our Dragon Palace will have to enter the center of the universe to develop. This is an opportunity.”<br/><br/>Prime Minister Gui said.<br/><br/>“Sure. I will personally lead a team over to see the various races and clans!”<br/><br/>Wang Xian nodded and made a decision.<br/><br/>The resources of the Dragon Palace had been used up. It was impossible for them to improve quickly.<br/><br/>They could only use other methods. Pill-making and weapon-making was a way to quickly collect resources.<br/><br/>Since that was the case, they would have to see the powerhouses of the various races and clans.\t\t\t\t\t\t</div>", "images": {}, "success": true}