{"id": 36, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15071973.html", "title": "Chapter 3027 - Chapter 3027: 3026 Red Mist Race", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 3027 - Chapter 3027: 3026 Red Mist Race</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 3027: 3026 red mist race<br/><br/>Name: Wang Xian<br/><br/>Race: Yin-yang Five Elements Divine Dragon (man-dragon unity)<br/><br/>Level: void God Emperor Rank 3(eighth form of Divine Dragon Transformation)<br/><br/>Origin: 223,960/500,000,000,000<br/><br/>Divine ability: ruling the water race (ruling the water race below one’s own level)<br/><br/>Devouring creatures (devouring creatures to extract origin)<br/><br/>Control of the five elements<br/><br/>Cultivation Method: Divine Dragon Transformation<br/><br/>Supernatural ability: soul capture, spirit attachment<br/><br/>Law supernatural ability: Dragon Eye Lock, five elemental dragon claws, Yin-yang realm-breaking<br/><br/>Aspect: five elemental grindstone, Dragon Kingdom in the palm, Dragon head under the heavens, Dragon body of ten thousand miles, Yin-yang polarity, Yin-yang five elemental alms bowl, divine dragon tail swing!<br/><br/>Control Law: metal, wood, water, fire, Earth, light, dark wind<br/><br/>Divine Kingdom: Dragon Palace<br/><br/>Dragon Palace: Level 9.<br/><br/>Members of the Dragon Palace: 1034450<br/><br/>“Phew!”<br/><br/>In the Dragon King’s Hall of the Dragon Palace, Wang Xian took a look at his attributes. In front of him was the five elements millstone and the yin-yang Dragon Plate. He let out a breath.<br/><br/>It had been a month since his last breakthrough. During this one month, the resplendent starry sky had completely settled down.<br/><br/>There were no more incidents of powerhouses wreaking havoc in the resplendent starry sky.<br/><br/>The deterrence of the Dragon Palace had completely played its role.<br/><br/>During this one month, Wang Xian used some treasures to upgrade the level of the five elemental millstone and the yin-yang Dragon Plate.<br/><br/>However, his strength had increased too quickly. The Yin-yang Dragon Plate and the five elemental millstone could not keep up with his speed.<br/><br/>However, after this breakthrough, Wang Xian had obtained a powerful and very practical nomological supernatural power.<br/><br/>Yin-yang realm-breaking.<br/><br/>Yin-yang realm-breaking. The two dragon horns of yin and Yang released a surge of yin-yang energy, disrupting the space.<br/><br/>This yin-yang realm-breaking could break through all illusions.<br/><br/>Illusion-breaking formation, trap-breaking formation, void-breaking confinement.<br/><br/>In other words, the space-locking formation set up by the Heaven Formation was useless against him.<br/><br/>Secondly, there was another very powerful point. The yin-yang realm-breaking could open an independent space around him.<br/><br/>By entering this space, he could avoid some attacks and escape back to his divine kingdom in an instant.<br/><br/>Wang Xian did some calculations and realized that even a wizard at the peak of the divine emperor realm might not be able to trap him.<br/><br/>Of course, if the other party had an acquired spiritual treasure of the confinement type, he could also be trapped.<br/><br/>However, the probability of this happening was very small.<br/><br/>Acquired spiritual treasures might not even be possessed by a universe knight level powerhouse.<br/><br/>While Wang Xian was cultivating to improve himself, the rest of the members of the Dragon Palace were also doing the same.<br/><br/>Digesting the resources they obtained.<br/><br/>The group of over ten thousand members of the Dragon Wizard were all cultivating on the cultivation continent in the Mo Han Room ruins.<br/><br/>They were practicing their attacks on the acquired Spiritual Treasure Heaven’s chessboard.<br/><br/>Now, after wiping out the three-eyed race, the four-armed race, and killing a few thousand celestial thearch powerhouses, the number of celestial thearch powerhouses in the Dragon Palace had reached 50,000.<br/><br/>This number was definitely comparable to an ordinary domain-level race.<br/><br/>Among them, the Dragon Wizard and the poisonous horned dragon had both reached the god Emperor realm, while the thorned dragon had 20,000 god Emperor realm experts.<br/><br/>This was also a consideration for the situation they would have to face in the future.<br/><br/>The poisonous horned dragon and the thorned dragon could play a huge role in the war between races.<br/><br/>As for the advancement of the Dragon Wizards, it was because they had obtained a large number of cultivation books regarding the Mo Han clan’s races. All of them were related to the cultivation techniques of the Wizards.<br/><br/>In addition, with the acquired Numinous Treasure Heaven acting chessboard, more than ten thousand dragon wizards could be placed on the heaven acting chessboard, and their strength could rise another rank.<br/><br/>In other words, if they were ten thousand rank one divine emperors, with the enhancement of the acquired Numinous Treasure, they could reach rank two divine emperors.<br/><br/>It was enough to raise the strength of over 10,000 members of the Dragon Palace by one level.<br/><br/>The entire Dragon Palace was rapidly improving and settling down.<br/><br/>Wang Xian and the rest did not dare to continue to assassinate the experts of other races unscrupulously.<br/><br/>Firstly, they were worried that the other party would take revenge and kill the humans in the starry sky.<br/><br/>Secondly, as long as the other party did not provoke them, the Dragon Palace would not assassinate the other party for no reason.<br/><br/>The Dragon Palace had always had its own principles for the improvement of their strength.<br/><br/>They killed the innocent indiscriminately. Perhaps the dragon palace had been besieged and destroyed at this stage.<br/><br/>While the members of the Dragon Palace were meditating and cultivating, a planet was located in the center of the ruins of the Mohan clan.<br/><br/>This planet was located on the side of the Tower of Babel and was once one of the planets of the Mohan clan.<br/><br/>And now, this planet had become one of the planets of the Red Fog clan.<br/><br/>The Red Fog clan was now a new domain-level race that was relatively popular in the entire universe.<br/><br/>The race’s founder was the famous God Emperor Hong Tian around the ruins of the Mohan clan.<br/><br/>A wizard at the peak of the god Emperor Realm.<br/><br/>A few months ago, God Emperor Hong Tian had already announced the establishment of a domain-level race. At that time, he would invite all the major races over.<br/><br/>Now, they were getting closer and closer to the red fog race’s grand ceremony.<br/><br/>On this planet that belonged to the red fog race, a group of people flew over.<br/><br/>One side had three eyes, while the other side had four arms.<br/><br/>The leader was a rank seven divine emperor expert. There were thousands of people from both sides, all of them at the divine emperor level.<br/><br/>They were the remaining experts from the three-eyed race and the four-armed race.<br/><br/>The two factions looked at each other. There was hatred, unwillingness, and determination on their faces.<br/><br/>“Everyone from the three-eyed race and the four-armed race, please come in. Our eldest senior brother is waiting for you inside!”<br/><br/>An expert from the red fog race flew over. His gaze swept over them and he revealed a smile.<br/><br/>“Thank you!”<br/><br/>The three-eyed race’s leader and the experts from the four-armed race nodded and followed the experts from the red fog race inside.<br/><br/>“Haha, Welcome, everyone. Welcome to join our Red Mist tribe!”<br/><br/>When everyone entered a large hall, an elder came forward and greeted them with a smile on his face.<br/><br/>“Greetings, Hongmen Elder!”<br/><br/>Everyone looked at the elder and immediately greeted him respectfully.<br/><br/>“Everyone, there’s no need to be so polite. From now on, we’ll be a family. Please take a seat!”<br/><br/>The hongmen elder smiled and gestured to them.<br/><br/>“Hongmen Elder, the people of our two great clans are willing to join the Red Mist. We don’t know what the conditions are!”<br/><br/>The three-eyed clan leader said.<br/><br/>After the two great clans were destroyed, they tried every means to seek revenge.<br/><br/>They publicized and exaggerated the information of the Dragon Palace and incited some powerful clans to attack the Dragon Palace.<br/><br/>But a month ago, after the Dragon Palace overpowered all the races, the two races were completely in despair.<br/><br/>What was hopeless was that the Dragon Palace didn’t suffer any retaliation.<br/><br/>What was hopeless was the Dragon Palace’s terrifying strength.<br/><br/>Under such circumstances, they made a decision to join the Red Mist race.<br/><br/>And they made a condition, hoping that the red mist race could help them destroy the Dragon Palace.<br/><br/>In their opinion, it would be very difficult for the red mist race to agree to this request.<br/><br/>They had already thought of other conditions.<br/><br/>But what they didn’t expect was that the red mist race actually agreed.<br/><br/>They agreed to help them take revenge and agreed to deal with the Dragon Palace.<br/><br/>This made them slightly stunned. Without much hesitation, they directly chose to join the Red Mist race.<br/><br/>Firstly, it was for revenge, and secondly, it was for the sake of having a powerful race to rely on.<br/><br/>The strength of God Emperor Hong Tian was definitely considered a peak expert in this region.\t\t\t\t\t\t</div>", "images": {}, "success": true}