{"id": 33, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15071967.html", "title": "Chapter 3019 - Chapter 3019: 3018 Created A Bloody Path To Intimidate The Heroes 2", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 3019 - Chapter 3019: 3018 Created A Bloody Path To Intimidate The Heroes 2</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 3019: 3018 created a bloody path to intimidate the Heroes 2<br/><br/>A level eight celestial thearch was killed. Wang Xian did not need to do anything else.<br/><br/>With Ao Yao and the Rest’s strength, they could assassinate a level seven celestial thearch.<br/><br/>There were many celestial thearchs on this planet of the demonic wind tribe. There were more than a thousand of them. It was the core planet of the demonic wind tribe.<br/><br/>However, more than a thousand celestial thearchs disappeared quickly under the attack of an lie and Ao Yao.<br/><br/>“Dragon King, we’ve taken care of them!”<br/><br/>Twenty minutes later, Ao Yaoyao, an lie, and the rest returned.<br/><br/>“Haha, I’ve assassinated more than 700 of them!”<br/><br/>An lie said excitedly.<br/><br/>“Dragon King, the traces they left behind have been erased by me!”<br/><br/>The Heaven Array flew over and said with a smile.<br/><br/>“An lie, go to the next place!”<br/><br/>Wang Xian narrowed his eyes slightly and continued.<br/><br/>“It’s the Dragon King!”<br/><br/>An lie nodded and disappeared instantly.<br/><br/>Wang Xian and the rest flew to the void and waited for an Lie’s news.<br/><br/>Boom! Boom! Boom<br/><br/>However, in less than ten minutes, waves of surging aura rose from the planet where the demonic wind tribe was located.<br/><br/>Creatures of the demonic wind tribe that were more than ten meters in size and looked like green wind demons flew over through the teleportation formation.<br/><br/>When they arrived at the grotto-heaven blessed land where their vice tribe Leader lived, their faces were filled with embarrassment and fear.<br/><br/>“Tribe leader, the Vice Tribe Leader’s life force disappeared here. The battle was also carried out here. The vice tribe leader should have been killed in one move. Otherwise, he wouldn’t have been killed so silently!”<br/><br/>The demonic wind tribe didn’t belong to humans. They were green in color and their bodies were ten meters long. Their arms were attached to a wing and their heads were slightly visible.<br/><br/>“Kill them!”An expert from the demonic wind clan shouted with a hint of fear in his eyes.<br/><br/>To be able to instantly kill an expert at the rank 8 divine emperor realm meant that the other party could kill them as well.<br/><br/>The rank 8 divine emperor realm was one of the strongest experts in their clan.<br/><br/>At the center, the leader of the Demonic Wind Clan, who was about 11 to 12 meters tall, looked around with fear in his eyes.<br/><br/>When he saw the words on the ground not far away, his pupils slightly shrank.<br/><br/>Boom<br/><br/>He moved and instantly arrived in front of the words.<br/><br/>“Dragon Palace!”<br/><br/>Seeing the two words on the ground, he growled in a low voice.<br/><br/>“Dragon Palace? It’s that Dragon Palace?”<br/><br/>“The Dragon Palace in the starry sky was attacked by them?”<br/><br/>“Damn it! Damn it!”<br/><br/>When the people behind him saw these two words, they instantly thought of the forces that were being paid attention to in this space.<br/><br/>The force in the space inside the ruins of the Mohan clan, the Dragon Palace!<br/><br/>“Why are they attacking us? Don’t tell me they already know that our people have entered their place? Are they taking revenge now?”<br/><br/>“Even if they know, the speed of their revenge is too fast. Our people have just arrived in that space and just sent a message!”<br/><br/>“The Dragon Palace is obviously trying to intimidate us, but their strength is so terrifying. They actually killed so many of our experts in such a short time. Even the vice-leader… such a powerful force, I think it’s best that we don’t provoke them!”<br/><br/>The experts of the Demonic Wind Clan looked very embarrassed, but at the same time, they were also a bit scared.<br/><br/>They were not weaker than them, and they were even stronger than them. It was obviously not a wise choice to provoke such an opponent.<br/><br/>“Inform the elders who went to the starry sky to tell them to come back. We can’t get involved in this mess anymore!”<br/><br/>The clan leader of the Demonic Wind Clan said with an embarrassed look.<br/><br/>The deputy clan leader had been assassinated soundlessly without causing any commotion. One could imagine the strength of the other party.<br/><br/>Furthermore, over 1,000 God emperors on the entire planet had all died. Such a terrifying strength made him shudder.<br/><br/>If they were to really fight, their demonic wind clan might not be a match for them.<br/><br/>“It’s the clan leader!”<br/><br/>The expert from the demonic wind clan nodded solemnly.<br/><br/>…<br/><br/>“Dragon King, the living soul tribe has locked onto us. Let’s go and kill them!”<br/><br/>In the void above, an lie appeared beside Wang Xian and the rest. He opened his mouth and said with a smile.<br/><br/>“Let’s Go!”<br/><br/>Wang Xian nodded his head with a smile. With a move, they disappeared instantly.<br/><br/>The Living Soul Tribe was a tribe of wizards. The strongest person among them had the strength of an eighth level divine emperor.<br/><br/>Moreover, the overall strength of the living soul race was much stronger than that of the demonic wind race.<br/><br/>The combat strength of the wizards was generally stronger than that of other races.<br/><br/>However, other than wizards who focused on cultivating their bodies, the physical bodies of array wizards, curse wizards, and the like were very weak.<br/><br/>Once they were close to them, even if they were one rank lower, they could still kill them.<br/><br/>Take an lie for example. Normally, he could only kill rank four divine emperor experts, but Wizards could kill rank five divine emperor experts.<br/><br/>“Dragon King, Wizards are very vigilant. They will set up a formation where they live. Ao Yao, you must be careful!”<br/><br/>On one of the main planets of the living soul group, the Sky Formation reminded them.<br/><br/>“Don’t worry. We can create an illusion in an instant. As long as we are within a thousand kilometers, we can definitely kill them!”<br/><br/>Ao Yao said confidently.<br/><br/>Surprisingly, with their assassination methods, it was not difficult to assassinate Wizards of the same level.<br/><br/>“Be careful. The other party still has a wizard artifact. I’ll make my move first. If there’s any movement here, it will definitely attract the attention of all the powerhouses on the planet. When the time comes, all of you will wait for an opportunity to assassinate him!”<br/><br/>Wang Xian said to them.<br/><br/>“It’s the Dragon King!”<br/><br/>Ao Yao and the rest nodded.<br/><br/>“Sky Formation, help me lock onto the area where that wizard is!”<br/><br/>“An lie, pinpoint the exact location of that level eight divine Emperor Wizard!”<br/><br/>Wang Xian said to them.<br/><br/>A Divine Emperor Rank-8 Wizard. The other party’s spell formation was stronger than the Heaven Spell Formation. The heaven spell formation could only sense places that posed a threat to him through the spell formation.<br/><br/>That must be the location of the Divine Emperor Rank-8 Wizard.<br/><br/>As for the Heaven Spell Formation, it could quickly lock onto the specific location of that wizard.<br/><br/>It would be safer if the eight-limbed demonic fiend and the poisonous horned dragon species could slowly infiltrate the area.<br/><br/>However, Wang Xian felt that it was unnecessary to deal with these tribes.<br/><br/>He would use his strength to attack!<br/><br/>An lie nodded his head and immediately went to investigate.<br/><br/>The assassination this time was much more troublesome than the previous one.<br/><br/>Half an hour later, an lie and the others located a location.<br/><br/>“Dragon King, there’s a powerful formation in the area ahead. There should be a level eight divine emperor powerhouse inside!”<br/><br/>The sky array said as it looked at an lie.<br/><br/>“I’ll go investigate!”<br/><br/>An lie nodded.<br/><br/>“Hide in the surroundings and be ready to attack at any time!”<br/><br/>Ao Yao ordered his subordinates.<br/><br/>The group of thorned dragon species nodded.<br/><br/>An lie moved and instantly entered the domain. The array formation was useless to him.<br/><br/>“Rumble!”<br/><br/>“Who dares to trespass my holy word domain!”<br/><br/>Soon, the entire domain was covered by lightning in the void in front of him.<br/><br/>A cold roar resounded throughout the entire planet.<br/><br/>An old man holding a lightning rod hovered in the middle of the lightning and scanned his surroundings.<br/><br/>“He’s Out!”<br/><br/>Wang Xian narrowed his eyes slightly and revealed a cold expression.<br/><br/>“Dragon King, be careful. A rank 8 wizard of the divine emperor can fight above his level. Don’t fight for too long in close combat!”<br/><br/>Tian Chen quickly reminded him.\t\t\t\t\t\t</div>", "images": {}, "success": true}