{"id": 34, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15071969.html", "title": "Chapter 3020 - Chapter 3020: 3019 Created A Bloody Path To Intimidate The Heroes 3", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 3020 - Chapter 3020: 3019 Created A Bloody Path To Intimidate The Heroes 3</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 3020: 3019 created a bloody path to intimidate the heroes 3<br/><br/>“Boom! Boom! Boom!”<br/><br/>Wang Xian naturally knew how terrifying a level eight divine emperor Magus was.<br/><br/>Once he couldn’t get close to his body, even if he was very fast, he wouldn’t be able to do anything to the other party.<br/><br/>Once he got close, it would be much easier for Wang Xian to kill the other party!<br/><br/>Wang Xian flapped his incipient saint wings and pushed his speed to the limit.<br/><br/>A pair of dragon horns slowly appeared on his head. He stared at the old man with a violent aura in his eyes.<br/><br/>He flapped his wings and charged forward at a terrifying speed.<br/><br/>His arms turned into dragon claws and charged forward.<br/><br/>“Huh?”<br/><br/>When Wang Xian charged forward, the old man holding the lightning rod immediately noticed him.<br/><br/>The elder’s pupils contracted slightly.<br/><br/>The lightning rod in his hand pointed in his direction.<br/><br/>“Crackle! Crackle!”<br/><br/>In an instant, an extremely terrifying bolt of lightning attacked Wang Xian directly.<br/><br/>“Boom!”<br/><br/>The speed of the Lightning was very fast, causing Wang Xian’s expression to change slightly.<br/><br/>He moved his body and dodged the Lightning attack directly. Then, he charged straight into the dense lightning ahead.<br/><br/>“What a terrifying speed!”<br/><br/>The old man holding the Lightning Rod had a change in expression. He waved his arm and a lightning decree appeared in front of him.<br/><br/>The lightning decree was covered with dense lightning. It quickly condensed into a terrifying lightning beast.<br/><br/>The Lightning Beast dashed forward and attacked Wang Xian directly.<br/><br/>“Who is it? How dare you attack me!”<br/><br/>The old man holding the Lightning Rod roared with a sinister gaze.<br/><br/>“What formidable strength!”<br/><br/>Wang Xian’s expression changed slightly when he saw the old man’s attack. As expected of a level eight divine Emperor Magus.<br/><br/>However, the speed of the Lightning Beast was still slightly slower than him!<br/><br/>He moved his body and avoided the Lightning Beast. He continued to attack the old man.<br/><br/>“Damn it, what terrifying speed!”<br/><br/>The old man with the Lightning Rod was slightly anxious when he saw Wang Xian’s speed. The lightning decree in front of him released dense bolts of lightning that had no blind spots. It went straight for Wang Xian.<br/><br/>“Five Elements Dragon Claw!”<br/><br/>Wang Xian didn’t hesitate at all. He immediately used his supernatural ability and swung his grayish dragon claw at his surroundings.<br/><br/>The bolts of lightning were broken one after another. The distance between him and the Elder was getting closer and closer!<br/><br/>“Thunder!”<br/><br/>The elder who was holding the Lightning Rod had a slight change in expression. His scepter landed on the lightning decree.<br/><br/>Boom<br/><br/>The bolts of lightning were densely covered. A terrifying force of lightning surrounded the elder.<br/><br/>Furthermore, it was spreading in all directions.<br/><br/>“Not good!”<br/><br/>Wang Xian’s expression changed slightly when he saw the old man’s Aoe attack.<br/><br/>The Old Man’s Thunder Beast attack just now could definitely threaten a level nine divine emperor powerhouse. Even if this attack was not as terrifying as the Thunder Beast, it was only slightly weaker.<br/><br/>“Charge! As long as I can withstand it, I will be able to destroy it!”<br/><br/>The Yin-yang dragon coiled around Wang Xian’s body and protected him tightly.<br/><br/>Crack! Crack<br/><br/>However, the yin-yang dragon coiled could not withstand such an attack at all. Cracks began to appear and it slowly collapsed.<br/><br/>Wang Xian’s pupils contracted slightly. The old man’s strength was a little terrifying.<br/><br/>Secondly, the old man had the geographical advantage. Even if he launched a sudden attack and was not far away from him, the array formation that he had set up beforehand could be activated instantly.<br/><br/>Crackle! Crackle<br/><br/>The extremely powerful Thunderbolts bombarded his body.<br/><br/>This caused his expression to change again.<br/><br/>A powerful thunderbolt landed on his body, causing him to freeze.<br/><br/>However, all of a sudden, the left wing of the primaless saint wings behind him trembled slightly. Some of the Thunderbolts landed on it and were slowly absorbed.<br/><br/>The numbness disappeared instantly.<br/><br/>This made Wang Xian delighted!<br/><br/>This was… an opportunity!<br/><br/>“Die!”<br/><br/>A terrifying killing intent burst out from his eyes as he accelerated abruptly.<br/><br/>“What!”<br/><br/>Seeing that the lightning did not affect Wang Xian in the slightest, the heart of the old man from the living soul tribe trembled and his expression changed completely<br/><br/>He retreated backward in fear.<br/><br/>However, how could his speed be compared to Wang Xian’s.<br/><br/>The grayish dragon claw of death grabbed the old man in an instant.<br/><br/>His body lit up with powerful defenses.<br/><br/>“Break for me!”<br/><br/>At such a close distance, Wang Xian’s dragon claw erupted with terrifying physical strength and the power of the five elements.<br/><br/>“Dragon Eye Lock!”<br/><br/>At the same time, chains shot out from his pupils and pierced through the old man.<br/><br/>“Bang, Bang, Bang!”<br/><br/>The defensive wizard tool on his body quickly collapsed.<br/><br/>“Who are you? What enmity do I have with you?”<br/><br/>The old man from the living soul race roared in fear.<br/><br/>“What enmity? I am the Dragon King of the Dragon Palace. What enmity do you have with me? If You Covet Our Dragon Palace, Die!”<br/><br/>The Dragon Eye Lock’s chains wrapped around his body. Wang Xian used his dragon claw and a destructive force rushed into the old man’s body.<br/><br/>“Dragon Palace!”<br/><br/>He opened his eyes wide. As a top-tier powerhouse of the living soul race, he naturally knew about the dragon palace.<br/><br/>He was the one who advocated the action of the living soul race this time.<br/><br/>As a wizard, he was confident that he could take a bite out of the Dragon Palace.<br/><br/>He was even pleasantly surprised when he received the information about the Dragon Palace just now.<br/><br/>However, he didn’t expect the Dragon King of the Dragon Palace to attack him now.<br/><br/>How was this possible with such a fast speed?<br/><br/>Bam<br/><br/>A powerful force landed on his body, causing his life force to disappear.<br/><br/>From the time when Wang Xian attacked to the end, it was only about ten seconds.<br/><br/>“What happened? !”<br/><br/>“Oh no, someone is causing trouble in our living soul tribe!”<br/><br/>“It’s the first Supreme Elder. Quick, quick, let’s Go!”<br/><br/>The battle between Wang Xian and the rest swept across the entire planet.<br/><br/>Everyone on the planet could feel the terrifying power coming from this side. All of them had shocked expressions on their faces.<br/><br/>The expressions of the experts from the vital soul tribe changed slightly. They flew over swiftly.<br/><br/>Everything happened in just a dozen seconds.<br/><br/>“Attack!”<br/><br/>Ao Yao and the rest who had been hiding in the surroundings saw the Wizards from the vital soul tribe flying over one by one. Their eyes were filled with coldness.<br/><br/>“Pu Pu Pu!”<br/><br/>At the next moment, they immediately moved.<br/><br/>“Ah Ah Ah!”<br/><br/>In that instant of attack, the experts of the living soul race who were attacked did not have the time to react. Their bodies were directly penetrated by the sharp claws.<br/><br/>Under such circumstances, in front of the thorned dragon species, they were just magi waiting to be slaughtered.<br/><br/>“Not good, there’s an ambush!”<br/><br/>Terrified voices came from the experts of the living soul race who had rushed over from behind. When they saw seven or eight experts of the race being assassinated, their expressions changed greatly.<br/><br/>“Die, Haha!”<br/><br/>An lie laughed out loud. He locked onto those Magi who were below rank five of the celestial thearch and disappeared in an instant.<br/><br/>“PFFT! PFFT! PFFT!”<br/><br/>In an instant, his dagger slashed across more than 30 heads.<br/><br/>“Kill!”<br/><br/>Wang Xian rushed out. He flapped his incorporeal sacred wings and attacked the few rank seven celestial thearch magi around him at a terrifying speed.<br/><br/>The slaughter began!<br/><br/>“Who is it? How dare he attack our living soul race!”<br/><br/>“Oh no, a powerhouse from our living soul race has been killed!”<br/><br/>“Which race is he from?”<br/><br/>The surrounding citizens of the living soul race looked over in shock.\t\t\t\t\t\t</div>", "images": {}, "success": true}