{"id": 31, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15071963.html", "title": "Chapter 3017 - Chapter 3017: The 3016 Intruders From The Dragon Palace Were Killed", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 3017 - Chapter 3017: The 3016 Intruders From The Dragon Palace Were Killed</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 3017: The 3016 intruders from the Dragon Palace were killed<br/><br/>“I already know some of the situation!”<br/><br/>Wang Xian told Shu Qing, Feng Luan, and the rest when he heard the situation.<br/><br/>Sitting on the Dragon Chair, his eyes revealed a cold expression.<br/><br/>“Xiao Xian, then we…”<br/><br/>Guan Shuqing and the rest frowned and said.<br/><br/>“Let me handle it. Our dazzling starry sky might be in chaos soon. You guys don’t have to care about the dragon and Phoenix dynasty anymore!”<br/><br/>Wang Xian said to the group of girls.<br/><br/>“Alright then!”<br/><br/>Guan Shuqing and the rest nodded their heads sensibly.<br/><br/>The powerful races in the universe were not something the Dragon and Phoenix Divine Empire could handle.<br/><br/>“Tian Cheng, an lie, follow me to investigate. The eight-limbed Demon Fiend, you guys go too. Bring some of your subordinates with you!”<br/><br/>Wang Xian ordered.<br/><br/>“It’s the Dragon King!”<br/><br/>Tian Cheng and the rest nodded with cold eyes.<br/><br/>They moved and immediately arrived in front of the teleportation formation of the Dragon Palace. They arrived directly at Planet Nine Destruction.<br/><br/>The Dragon Palace on Planet Nine Destruction had been destroyed last time. Wang Xian had built another one.<br/><br/>This time, the group of powerhouses from various forces arrived at Planet Nine destruction and did not enter the Dragon Palace.<br/><br/>Through the teleportation, they arrived at the Dragon Palace on Planet Nine Destruction. Wang Xian and the rest concealed themselves and flew towards the direction of the mainland.<br/><br/>Their speed was very fast. When they arrived at the mainland, the Heaven Formation took out a compass.<br/><br/>This magic tool was obtained from the Mo Han clan’s mainland.<br/><br/>It was able to detect if there were any deaths in a particular place.<br/><br/>Looking at the place shown on the map, Wang Xian and the rest immediately flew over.<br/><br/>When they entered a manor, they immediately saw dozens of corpses on the ground.<br/><br/>Upon seeing this scene, Wang Xian and the rest had a cold expression on their faces.<br/><br/>Such wanton killing in the territory of the Dragon Palace showed that they did not put them in their eyes at all!<br/><br/>“Search!”<br/><br/>Wang Xian immediately ordered the heaven formation.<br/><br/>“It’s the Dragon King!”<br/><br/>The Heaven Formation nodded and immediately activated the formation.<br/><br/>Currently, the Heaven Formation had the strength of a level seven celestial thearch. It was comparable to a peak powerhouse of an ordinary race.<br/><br/>Very soon, the scene of more than a dozen corpses being killed appeared on the ground.<br/><br/>“There are two horns on their heads. This should be the ancient rare race, a domain-level race. The strongest person in the race has the strength of a ninth level celestial thearch!”<br/><br/>Wang Xian looked at the scene in front of him with a cold look in his eyes.<br/><br/>“Lock onto them!”<br/><br/>He said immediately.<br/><br/>“Yes!”<br/><br/>The Heaven Formation nodded and immediately began to lock onto them with the formation.<br/><br/>“Found it!”<br/><br/>“It’s still on this planet!”<br/><br/>Soon, the heaven’s formation said coldly.<br/><br/>“Let’s Go!”<br/><br/>Wang Xian and the rest immediately flew over.<br/><br/>In a mansion, five figures were sitting inside. They were resting leisurely and could smell a faint scent of blood in the air.<br/><br/>Clearly, the owner of this place had been killed!<br/><br/>“You’re courting death!”<br/><br/>Just as the five of them were lying there leisurely, a voice sounded beside their ears.<br/><br/>The five of them changed their expressions and fear appeared in their eyes.<br/><br/>“Jie Jie Jie, how dare you cause trouble in Our Dragon Palace’s territory? Go To Hell!”<br/><br/>The eight-headed demon said coldly and the poisonous horned dragons behind him flew towards them.<br/><br/>“How dare you? We’re from the ancient rare race!”<br/><br/>The five of them were horrified and wanted to resist, but at this moment, a terrifying dragon’s might rushed into their minds.<br/><br/>Their bodies stiffened slightly, and the five poisonous horned dragons entered their bodies and took possession of them.<br/><br/>The five of them struggled for a while, and their eyes were wide with shock.<br/><br/>Slowly, the five of them stood up, and a black light flashed in their eyes.<br/><br/>“Dragon King!”<br/><br/>They cupped their hands and shouted respectfully.<br/><br/>“What News did you get?”<br/><br/>Wang Xian asked immediately.<br/><br/>“Dragon King, the five of them have already passed the information of our Dragon Palace over. The Guxi tribe will send a level eight celestial thearch, five level seven celestial thearch, and twenty level six celestial thearch powerhouses over!”<br/><br/>A poisonous horned dragon in the middle said.<br/><br/>“Is that so?”<br/><br/>Wang Xian narrowed his eyes slightly. His eyes were flashing with a cold luster.<br/><br/>“When will they arrive?”<br/><br/>Wang Xian narrowed his eyes slightly and asked.<br/><br/>“They are expected to arrive at our place in ten days!”<br/><br/>The poisonous horned dragon reported.<br/><br/>“Very good. Then we will wait for them for ten days.”<br/><br/>Wang Xian said coldly.<br/><br/>“Let’s go to a place!”<br/><br/>He said to the sky array.<br/><br/>The sky array nodded and continued to search!<br/><br/>“Here!”<br/><br/>Soon, they came to another place, a remote street.<br/><br/>There were no corpses around. They should have been disposed of!<br/><br/>Buzz<br/><br/>The sky array waved its arm and streams of energy enveloped the surroundings.<br/><br/>Soon, an image appeared in front of them. A race with thin limbs and a relatively large head appeared in their line of sight.<br/><br/>“This is a race of brain spirits, a domain-level race. Their strongest person is also at level nine of the Celestial Thearch!”<br/><br/>As Heaven Array spoke, he immediately set up a formation to lock onto it.<br/><br/>“In the void far away, there are only two people!”<br/><br/>Heaven Array said very quickly.<br/><br/>“Let’s Go!”<br/><br/>Wang Xian and the rest moved their bodies and immediately flew towards the sky.<br/><br/>After locking onto a star in the void, Wang Xian’s eyes were shining.<br/><br/>“There are two people inside the meteorite. They have the strength of a celestial emperor at level seven!”<br/><br/>Wang Xian’s dragon eyes penetrated through the meteorite and said.<br/><br/>“Let me intimidate them and parasitize them!”<br/><br/>He immediately said.<br/><br/>“It’s the Dragon King!”<br/><br/>Beside Ba Qi, the two poisonous horned dragons immediately nodded.<br/><br/>The three-eyed race and the four-armed race had a total of 12 celestial emperor level seven powerhouses killed by Wang Xian.<br/><br/>The elevation of these powerhouses this time had all been used on the poisonous horned dragon species and the thorned dragon species.<br/><br/>This was because Prime Minister Gui and the rest knew that these two dragon species were very useful for the following matters.<br/><br/>With the poisonous horned dragon species and the eight-limbed demonic fiend, there were 10 celestial thearch level-seven powerhouses.<br/><br/>There were four thorned dragon species.<br/><br/>“Boom!”<br/><br/>Wang Xian and the rest flew over. Before the other party could react, a strong suppressive force rushed over.<br/><br/>The pupils of the two celestial thearch level-seven powerhouses in the meteorite shrunk as they revealed a look of fear.<br/><br/>“Whoosh! Whoosh!”<br/><br/>Two black shadows rushed straight into the meteorite!<br/><br/>Under Wang Xian’s strong draconic aura, the two celestial thearch level-seven powerhouses of the brain spirit race were unable to resist and were directly parasitized.<br/><br/>Boom<br/><br/>Soon, two figures rushed out.<br/><br/>“Dragon King!”<br/><br/>The two experts of the brain spirit race who were infected greeted Wang Xian respectfully.<br/><br/>“Dragon King, the brain spirit race will send two level-eight divine emperors. As for the rest of the experts, we don’t have any information!”<br/><br/>“It’s estimated that they will arrive in about 13 days!”<br/><br/>They reported immediately.<br/><br/>“Two?”<br/><br/>Wang Xian frowned slightly and nodded his head.<br/><br/>Two level eight celestial thearchs. If one of them was killed by his surprise, the other would be able to kill him very quickly. It wouldn’t be a big problem.<br/><br/>“Continue. I want to see who is the hunter and who is the prey in this upcoming war!”<br/><br/>Wang Xian said to the sky array and the rest. His eyes were filled with violent killing intent.<br/><br/>Those who covet the Dragon Palace, those who violate the Dragon Palace, die!\t\t\t\t\t\t</div>", "images": {}, "success": true}