{"id": 41, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15071983.html", "title": "Chapter 3032 - Chapter 3032: 3031 I, God Emperor Hong Tian, Will Die If I Defy You. 4", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 3032 - Chapter 3032: 3031 I, God Emperor Hong Tian, Will Die If I Defy You. 4</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 3032: 3031 i, God Emperor Hong Tian, will die if I defy you. 4<br/><br/>“Everyone, I have an image here!”<br/><br/>God Emperor Hong Tian saw that everyone’s gazes were stern, and his eyes were shining.<br/><br/>He waved his arm, and an image appeared in front of him.<br/><br/>In the image, there were a few corpses on the ground. The corpses were dressed in clothes similar to the members of the Red Mist tribe, and there were a few figures beside them.<br/><br/>“This is?”<br/><br/>When everyone saw those few figures, they were slightly stunned. Their faces revealed a look of astonishment.<br/><br/>“It’s them. It’s the people from the Dragon Palace!”<br/><br/>“It’s the people from the Dragon Palace!”<br/><br/>“This… this is going to…”<br/><br/>When everyone saw the scene on the screen, their faces revealed a look of astonishment. Some of the experts looked towards Wang Xian and the rest.<br/><br/>“Dragon King, the scene where God Emperor Hong Tian erased me has appeared again!”<br/><br/>When Tian Zhen saw the scene on the screen, his pupils contracted slightly as he said to Wang Xian.<br/><br/>“It’s alright. I’ll know when I know!”<br/><br/>Wang Xian narrowed his eyes slightly as his eyes sparkled.<br/><br/>“It’s that Dragon Palace. I didn’t expect them to kill the disciple of God Emperor Hong Tian!”<br/><br/>“This is going to be interesting!”<br/><br/>When the ancient rare tribe members of the brain spirit race saw this scene, a gloating look flashed across their eyes.<br/><br/>They looked at Wang Xian and the rest without concealing the killing intent in their eyes.<br/><br/>“Everyone from the Dragon Palace, should we give an explanation?”<br/><br/>God Emperor Hong Tian stared at Wang Xian and the rest as he asked expressionlessly.<br/><br/>“It’s simple. We entered the Divine Garden Star and were attacked as soon as we arrived in the sky. We used the space-locking formation to lock onto us!”<br/><br/>“They are courting death. Naturally, we have to kill them. Why? Celestial Emperor Hong Tian, are they from your red fog race?”<br/><br/>Wang Xian asked with a smile even though he knew the answer.<br/><br/>“Hehe, everyone from the Dragon Palace, what do you think?”<br/><br/>Upon hearing Wang Xian’s words, a cold look appeared in Celestial Emperor Hong Tian’s eyes.<br/><br/>“What do we say? Of course, we will kill them!”<br/><br/>Wang Xian said faintly.<br/><br/>“Hahaha, good, good, good. We will kill him if we kill him!”<br/><br/>When God Emperor Hong Tian heard Wang Xian’s words, a violent aura shot out from his body and headed straight for Wang Xian and the rest.<br/><br/>“His strength is only at the ninth level of the celestial thearch, yet he dares to be so arrogant?”<br/><br/>Beside God Emperor Hong Tian, master Dan Lun and the violent mountain giant immediately locked onto Wang Xian and the rest. Their eyes were filled with killing intent.<br/><br/>Wang Xian moved his body and the incipient saint wings appeared on his back. A pair of dragon horns also appeared on his head to block the position of Celestial Emperor Hong Tian.<br/><br/>“Dragon King!”<br/><br/>At this moment, Tian Cheng, who was at the side, said in a low voice. His gaze was fixed on the position under his feet.<br/><br/>Streams of red light appeared below them as if they were trying to seal them.<br/><br/>“Dragon Palace, I will give you two choices. One is to submit to the red fog race. With us as your leader, you can offer up all your inferior dragons!”<br/><br/>“Two is to become enemies with the Red Mist tribe and I will destroy all of you!”<br/><br/>God Emperor Hong Tian stared at Wang Xian and the rest as he spoke in an extremely domineering manner.<br/><br/>“This is going to be interesting!”<br/><br/>The powerhouses of the Heaven Flame tribe revealed a faint smile when they saw the sudden change.<br/><br/>They were already displeased with the Dragon Palace.<br/><br/>The deterrence of the Dragon Palace had indeed intimidated the Heaven Flame tribe.<br/><br/>They were very happy to see this scene.<br/><br/>“The Red Mist clan has just been established, and they have very few disciples. Moreover, they live on sealed planets, so they are not afraid of the Dragon Palace’s assassination!”<br/><br/>“In addition, they are good at array formations, so the Dragon Palace’s assassination might be suicide. Therefore, God Emperor Hong Tian has no scruples at all.”<br/><br/>An expert from the mountain-piercer clan analyzed indifferently and watched with a smile.<br/><br/>The Red Fog clan had such a force right after they were established. If there was a conflict with the Dragon Palace, it would be a good thing for the clan.<br/><br/>It could weaken the power of the Red Fog clan.<br/><br/>“Celestial Emperor Hong Tian, are you so confident that you can destroy us?”<br/><br/>Wang Xian stared at Celestial Emperor Hong Tian and his gaze turned cold.<br/><br/>“It’s still easy for us to leave the few of you who are at least at the ninth level of the Celestial Emperor Realm!”<br/><br/>Celestial Thearch Hong Tian said confidently.<br/><br/>“Looks like our dragon palace has another enemy!”<br/><br/>Wang Xian narrowed his eyes slightly.<br/><br/>“If you defy me, Hong Tian, not only will you die, but Your Dragon Palace will also be destroyed!”<br/><br/>Celestial Thearch Hong Tian stared at Wang Xian and the rest as he said with a twinkle in his eyes.<br/><br/>“As expected of a wizard. He actually has the confidence to destroy the Dragon Palace!”<br/><br/>“A wizard at the level of Celestial Thearch Hong Tian has unimaginable means. Maybe he can find the lair of the Dragon Palace through some means!”<br/><br/>“The strongest person in the Dragon Palace is probably at rank nine celestial emperor. If he is really killed by Celestial Emperor Hong Tian, the Red Mist race will be unstoppable!”<br/><br/>In front of them, the smiles on the faces of the powerhouses of the Sky Flame race and the Hanhai Weng disappeared when they saw the confident celestial emperor Hong Tian.<br/><br/>Wizards were powerful and strange, especially people like Celestial Emperor Hong Tian. Maybe he could use a sorcery to lock onto the lair of the Dragon Palace.<br/><br/>“Hahaha, I’m sorry, I’m sorry, Old Man Hong Tian, I’m Late!”<br/><br/>Suddenly, a hearty laugh was heard.<br/><br/>The sudden sound stunned everyone.<br/><br/>“Boom! Boom! Boom!”<br/><br/>Soon after, an unscrupulous figure flew directly toward them.<br/><br/>God Emperor Hong Tian frowned slightly when he heard the voice and looked forward.<br/><br/>“Humph, Old Man Ming, I didn’t expect you to Still Be Alive!”<br/><br/>He said coldly.<br/><br/>“Old Man Ming?”<br/><br/>“It’s him, the one from the Dark Sky clan. He has been missing for 70 to 80 million years and just returned not long ago!”<br/><br/>“He is the only wizard in our starry sky who can fight against God Emperor Hong Tian. Even God Emperor Hong Tian suffered a loss at his hands!”<br/><br/>“After he returned, the strength of the Nethersky clan has increased tremendously.”<br/><br/>The people from the surrounding races immediately turned around and whispered in astonishment.<br/><br/>The newcomer was also a legendary figure!<br/><br/>“You are not dead yet. How Can I Die?”<br/><br/>As the old man spoke, his gaze swept across the surroundings. “I am not here to congratulate you on establishing your clan.”<br/><br/>As he spoke, he scanned his surroundings.<br/><br/>When he saw Wang Xian and the rest, his eyes lit up.<br/><br/>“Haha, benefactor, I Saw Old Man Hong Tian inviting all of you on the universe’s AI not too long ago. I came here to try my luck. I didn’t expect benefactor to really be here!”<br/><br/>He laughed out loud and immediately flew towards Wang Xian and the rest.<br/><br/>The person who came was Ming Xuanzhi. Wang Xian and the rest had rescued the fat old man who was trapped in the formation on the Wizard Continent.<br/><br/>“Oh?”<br/><br/>Wang Xian and the rest saw Ming Xuanzhi who had suddenly arrived. They raised their eyebrows when they saw him flying over.<br/><br/>It was really a good time!<br/><br/>They narrowed their eyes slightly.<br/><br/>“Keke Keke, Old Man Ming Xuanzhi, you came at the right time. Someone happened to want to destroy us.”<br/><br/>Ba Qi’s eyes lit up when he saw Ming Xuanzhi. He immediately laughed out loud.<br/><br/>“Eh? Someone wants to kill you guys?”<br/><br/>Ming Xuanzhi’s gaze turned slightly cold. When he saw the red glow under Wang Xian and the rest, a murderous aura rushed out from his body.\t\t\t\t\t\t</div>", "images": {}, "success": true}