{"id": 46, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15071993.html", "title": "Chapter 3037 - Chapter 3037: 3036 Was A Lone Wolf", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 3037 - Chapter 3037: 3036 Was A Lone Wolf</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 3037: 3036 was a lone wolf<br/><br/>Dragon Palace, Tianming clan, ancient rare clan, brain spirit clan, Red Mist clan.<br/><br/>One by one, the news spread rapidly on the universe’s artificial intelligence.<br/><br/>“Dragon King, Ming Xuanzhi contacted me through the universe’s artificial intelligence. He wants to invite you to the Tianming clan. He said that his help last time was just a small matter.”<br/><br/>On the fifth day, the sky array came to the Dragon King’s Hall and reported to Wang Xian.<br/><br/>“Oh? Ming Xuanzhi contacted you?”<br/><br/>Wang Xian raised his eyebrows and looked surprised.<br/><br/>“Yes, it was me who sent the statement in the name of the Dragon Palace not long ago. He contacted me through that message, but I haven’t responded yet.”<br/><br/>Tian Chen nodded and said.<br/><br/>“To the Nethersky Clan?”<br/><br/>Wang Xian was deep in thought.<br/><br/>“He wanted to come to our dragon palace to thank us personally, but he didn’t know where we are. In order to avoid suspicion, he invited the Dragon King and the experts of the Dragon Palace over. He said that he could guarantee their safety.”<br/><br/>Tian Chen continued.<br/><br/>“I plan to go out and take a look at the vast and boundless center of the Universe.”<br/><br/>Wang Xian nodded thoughtfully and looked at the sky array.<br/><br/>“Oh? Dragon King, are you planning to go out by yourself?”<br/><br/>The sky array was shocked and asked immediately.<br/><br/>“Yes. I’m very relieved to have you guys here in the Dragon Palace. It doesn’t matter much whether I’m here or not.”<br/><br/>“Besides, if I want to make a breakthrough quickly, I have to go to other places to gain experience, fight, and look for opportunities.”<br/><br/>Wang Xian said.<br/><br/>“Dragon King, are you planning to go somewhere?”<br/><br/>The Heaven Array hesitated for a moment before asking.<br/><br/>“I’m planning to go to the Milky Way to take a look.”<br/><br/>Wang Xian said.<br/><br/>Five days ago, when he was preparing to enter the universe alone, Wang Xian had already made some preparations.<br/><br/>He searched some places on the universe’s AI and finally locked onto the Milky Way, which was not too far away from here.<br/><br/>Of course, this distance was not too far, but it was also an extremely distant place.<br/><br/>If he were to fly there alone, it might take two years.<br/><br/>“Dragon King, if you go out, you must pay attention to your safety.”<br/><br/>Sky Array said.<br/><br/>“Don’t worry.”<br/><br/>Wang Xian smiled faintly and stood up directly. “I’ll pass by the Tianming clan on my way to the Milky Way. Give Me Ming Xuanzhi’s contact information. I’ll tell him about it.”<br/><br/>“Alright.”<br/><br/>The Heaven Array nodded.<br/><br/>Very soon, Wang Xian sent a message to Ming Xuanzhi using his universal AI.<br/><br/>He received a reply very quickly and Wang Xian briefly told him about it.<br/><br/>For the next two days, Wang Xian accompanied a group of girls and gave some instructions to Prime Minister Gui. After that, he ordered an lie to bring him to a planet.<br/><br/>“Hahaha, benefactor, welcome to our Tianming clan.”<br/><br/>A day later, on a planet teleportation formation of the Tianming clan, Ming Xuanzhi saw Wang Xian coming out from the teleportation formation and greeted him with a loud laugh.<br/><br/>“Welcome, Dragon King!”<br/><br/>Beside Ming Xuanzhi, there was an old man who nodded at Wang Xian with a smile.<br/><br/>Wang Xian sensed it and was slightly shocked. The old man was also a powerhouse at the peak of the Divine Emperor Realm.<br/><br/>Furthermore, he was more dignified than Ming Xuanzhi.<br/><br/>However, the two of them looked similar. Wang Xian could vaguely guess the identity of the old man.<br/><br/>“Haha, Thank You, Brother Ming Xuanzhi, for what happened last time. Otherwise, we would be in trouble.”<br/><br/>Wang Xian said politely.<br/><br/>“Hehe, even without me, benefactor, you guys wouldn’t be in any danger. Compared to the kindness of saving your lives, it’s nothing!”<br/><br/>Ming Xuanzhi said with a smile.<br/><br/>“That’s right, Dragon King. Since you saved my father, you are our benefactor. In the future, if the red fog clan dares to attack the Dragon Palace, we will teach them a lesson on behalf of the Dragon Palace.”<br/><br/>The elder beside him said with a smile.<br/><br/>“Haha, there’s no need. We have already agreed that we have repaid all the favors.”<br/><br/>Wang Xian shook his head with a smile.<br/><br/>“Haha, Please Come In, benefactor. Since our Tianming clan is here, I will definitely treat them well!”<br/><br/>Ming Xuanzhi changed the topic and laughed out loud.<br/><br/>“There’s no need to be so polite. I Won’t be staying here for long. I plan to head to the Milky Way to gain some experience.”<br/><br/>Wang Xian said with a smile.<br/><br/>“Head to the Milky Way. It’s quite far and there are many strong people there.”<br/><br/>Ming Xuanzhi said curiously.<br/><br/>“Of course, we’ll go to the powerful starry sky for training.”<br/><br/>Wang Xian said, “I won’t stay here any longer.”<br/><br/>“Dragon King, there’s no rush. Let’s have a meal before we go. Besides, our Tianming clan knows a little about the Milky Way. Father has also been to the Milky Way before.”<br/><br/>The old man at the side said.<br/><br/>“More than that. I’ve been there for five million years.”<br/><br/>Ming Xuanzhi said slowly.<br/><br/>“Oh?”<br/><br/>Wang Xian raised his eyebrows and looked surprised.<br/><br/>“Let’s go, benefactor. Let’s chat while we eat. I, Old Ming, have stayed there for millions of years. Although I haven’t made any achievements, I still have a good understanding of the place.”<br/><br/>Ming Xuanzhi said enthusiastically.<br/><br/>“Alright!”<br/><br/>Wang Xian nodded and did not reject him.<br/><br/>The Milky Way was a small river at the center of the universe.<br/><br/>In fact, the small river at the center of the universe was also incomparably huge.<br/><br/>Its area was at least tens of thousands of times the size of this starry sky.<br/><br/>The entire Milky Way was vast and boundless. There were countless dire beasts living in it.<br/><br/>Similarly, there were many powerful races and forces there.<br/><br/>In the Milky Way, there were more than a dozen primary races in the universe. As for the other levels, there was no need to mention them.<br/><br/>The reason why Wang Xian chose the Milky Way was mainly because the Milky Way belonged to the ocean.<br/><br/>There were two ways for Wang Xian to increase his forces. One was to directly devour aquatic creatures. The other was to devour all sorts of medicinal herbs and resources.<br/><br/>Compared to medicinal herbs and herbs, aquatic creatures were undoubtedly the easiest to find.<br/><br/>The entire Milky Way was filled with aquatic creatures.<br/><br/>Each of the major forces relied on the Milky Way to build their powerful bases.<br/><br/>The Milky Way was rich in resources, and all kinds of aquatic creatures were also extremely powerful. It was said that there were many universe knight-level aquatic creatures.<br/><br/>Even the primary races of the universe did not dare to step into the territory of these existences rashly.<br/><br/>Wang Xian’s goal this time was to reach the level of a universe knight.<br/><br/>“Benefactor, if you are going to the Milky Way, Old Ming has something here that should be useful to you!”<br/><br/>During the meal, Ming Xuanzhi took out an item and handed it to him.<br/><br/>The item was a willow branch that contained surging vitality.<br/><br/>“Eh? This Is?”<br/><br/>Wang Xian looked at the willow branch in astonishment. According to the energy on it, it should be a treasure from a universe knight.<br/><br/>“This is a branch of the venerable willow deity. With this branch, you can join the Willow deity Daoist sect and become a student of the sect.”<br/><br/>Ming Xuanzhi looked at the branch and said with a twinkle in his eyes.<br/><br/>“Willow deity Daoist sect?”<br/><br/>Wang Xian raised his eyebrows.<br/><br/>“That’s right. The Dragon King is preparing to head to the Milky Way. He should have some understanding of the forces there. This is a branch of venerable willow deity that I obtained by chance.”<br/><br/>Ming Xuanzhi said solemnly.<br/><br/>This branch was extremely valuable in the Milky Way.\t\t\t\t\t\t</div>", "images": {}, "success": true}