{"id": 49, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15071999.html", "title": "Chapter 3040 - Chapter 3040: 3039 Sub-Dragons Were In The Vast Milky Way", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 3040 - Chapter 3040: 3039 Sub-Dragons Were In The Vast Milky Way</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 3040: 3039 sub-dragons were in the vast Milky Way<br/><br/>“Benefactor, in the current universe, due to the destruction of the purebred divine dragon bloodline, the sub-dragons are not having an easy time. Many people want to become Dragon Knights, want to have a divine dragon bloodline battle pet.”<br/><br/>“Apart from the nine more powerful dragon God races, the rest of the sub-dragons are being hunted.”<br/><br/>“There aren’t many sub-dragons in the Milky Way. A few years ago, there was a stronger sub-dragon domain-level race called the Fairy Dragon Race. They lived in the Milky Way and had a trace of the Dragon God’s bloodline. There were also a lot of them. At that time, they were hunted down by many powerful races.”<br/><br/>“Later, a powerful Earth God dragon appeared in the Fairy Dragon Race. It was said that the Earth God Dragon was a real god Dragon. He had the power to overturn rivers and seas and helped the fairy dragon race to resist the other races.”<br/><br/>“However, the Earth God Dragon and the Fairy Dragon tribe are still not a match for the other tribes in the Milky Way. We don’t know where they are hiding now.”<br/><br/>Mi Xin Lu introduced the current situation regarding the Asian dragon to Wang Xian.<br/><br/>“Fairy Dragon? Earth God Dragon?”<br/><br/>Wang Xian frowned slightly when he heard her words.<br/><br/>“Do you know the image of the Earth God Dragon?”<br/><br/>Wang Xian asked him.<br/><br/>“I don’t know. But according to the rumors, the appearance of this Earth Dragon God is exactly the same as the legendary Dragon God!”<br/><br/>Mo Xinlu shook his head.<br/><br/>“Exactly the same? Could it be the son of Heaven of the Earth Dragon? Is Lingxiu Here?”<br/><br/>Wang Xian frowned and thought to himself.<br/><br/>Time passed very quickly. Wang Xian’s speed was also very terrifying. Two days later, they arrived at the edge of the Milky Way.<br/><br/>Looking at the incomparably vast world in front of them, his eyes revealed a look of shock.<br/><br/>There was an incomparably vast ocean in front of them.<br/><br/>The void below the ocean was black. That area was known as the inanimate zone. It was rumored that even a universe knight would die instantly upon entering this inanimate zone.<br/><br/>This incomparably vast ocean was the Milky Way.<br/><br/>It was a milky way that was boundless to many people.<br/><br/>There was no record of the length of the Milky Way, and universe knights could only fly from one end to the other after hundreds of years.<br/><br/>As for the size of the Milky Way, it was even more unknown.<br/><br/>There were countless aquatic creatures living in the Milky Way.<br/><br/>There were universe knights hidden there.<br/><br/>“Benefactor, this is the edge of the Milky Way. This area is the territory of the nine swords race. We have to be careful!”<br/><br/>Mi Xin Lu looked ahead and said with a face full of fear.<br/><br/>“Just Call Me Wang Xian. They don’t know what you look like in human form, right?”<br/><br/>Wang Xian nodded and asked her.<br/><br/>“I don’t know.”<br/><br/>Mi Xin Lu shook her head.<br/><br/>“That’s good. Let’s go. We need to use the teleportation formation here to get to the willow deity Daoist sect.”<br/><br/>As Wang Xian spoke, he approached the Milky Way.<br/><br/>On some planets, the continents were connected to the ocean. However, it was completely different here. This was a planet that was close to the ocean.<br/><br/>It was the entire continent that was close to the ocean.<br/><br/>The planets that were inhabited by humans looked extremely tiny in front of the Milky Way.<br/><br/>Wang Xian brought the Mi Xin deer to a planet.<br/><br/>The arrival of Wang Xian and the rest did not attract anyone’s attention. They took the teleportation formation and immediately teleported in the direction of the Willow Deity sect.<br/><br/>The Willow Deity sect was located at the center of one side of the Milky Way. It was located on an island that was more than ten light years deep in the Milky Way.<br/><br/>“There are so many people. It’s so bustling!”<br/><br/>When Wang Xian and the rest were teleported to a spot near the center of the Milky Way, he stood on a continental plate at the side. He looked at the spot on the right with a face full of shock.<br/><br/>There was an endless sea of the Milky Way.<br/><br/>On the surface of the sea, there were many ships.<br/><br/>There were sailboats made of special materials and ships with powerful and high-tech technology.<br/><br/>There were also yachts that looked extremely luxurious.<br/><br/>There were also some strange navigation artifacts.<br/><br/>There were many people around. Looking at the area of hundreds of millions of kilometers, there were at least more than a billion people.<br/><br/>All of them were cultivators from the universe.<br/><br/>Among them, there were quite a number of celestial thearch-level existences. Celestial Kings could be seen everywhere here.<br/><br/>However, Wang Xian also realized that there were not many celestial thearch-level eight or nine in the surroundings.<br/><br/>His strength was considered to be at the top here.<br/><br/>“Let’s go to the willow deity Daoist sect.”<br/><br/>Wang Xian looked at the magnificent sea and was in a great mood. He said to Mi Xinlu.<br/><br/>“Brother Wang, are you going to the Willow deity sect? If you are not a disciple of the willow deity sect, you will not be able to enter.”<br/><br/>Mo Xinlu spoke to him.<br/><br/>“Don’t worry, I will join the Willow Deity sect right away!”<br/><br/>Wang Xian smiled and brought her forward.<br/><br/>When they landed on the surface of the ocean, he felt like a dragon swimming in the ocean.<br/><br/>The seawater pushed his body forward at a terrifying speed.<br/><br/>His terrifying speed attracted the attention of some people around him. Their eyes were filled with respect.<br/><br/>On the Milky Way, there were more than ten primary races in the universe and a few hundred domain-level races.<br/><br/>Wang Xian’s strength could be considered an existence among the domain-level races.<br/><br/>He was also an expert here.<br/><br/>However, with his strength, he was not qualified to be arrogant in the Milky Way.<br/><br/>Stepping on the surface of the water, he quickly surpassed all kinds of ships. Wang Xian was also looking around curiously.<br/><br/>Some ships were not simple either. They could fight against a level five or level six divine emperor powerhouse.<br/><br/>There were also some ships that had a powerful array formation. Once the array formation was activated, the attacks of a level nine or even a peak divine emperor would be able to withstand it.<br/><br/>However, the number of these ships was relatively small.<br/><br/>After flying forward for half an hour, there were still quite a number of ships in the surroundings.<br/><br/>Wang Xian even saw some people fishing in the sea.<br/><br/>This made him extremely curious.<br/><br/>“Brother Wang, anglers are not rare in the Milky Way. On the contrary, there are many anglers. Some of the top experts among the celestial thearchs are fishing. When they are fishing, they can improve their control and not delay their cultivation.”<br/><br/>“In addition, they can also fish up the desolate beasts in the water in the Milky Way. With good bait, they can fish up very powerful desolate beasts in the water. Of course, the prerequisite is that you have the ability to fish them up!”<br/><br/>Mi Xin Lu, who was at the side, saw Wang Xian’s curious look and explained.<br/><br/>“Is that so? Then I have to understand it better.”<br/><br/>Wang Xian raised his eyebrows slightly.<br/><br/>“Yeah, yeah, I’ve heard about it too. However, I did see a video of a universe knight fishing on the universe’s AI.”<br/><br/>Mi Xinlu nodded and said.<br/><br/>“Universe Knight Fishing?”<br/><br/>Wang Xian was even more curious. It seemed that this fishing was completely different from what he had imagined.<br/><br/>“When we reach brother Wang, the willow deity dojo is right in front of us. The Venerable Willow deity is the most respected powerhouse in the Milky Way.”<br/><br/>“Unfortunately, it is extremely difficult to join the Divine Willow Daoist sect. The entire Milky Way is so big, and only ten thousand people have entered.”<br/><br/>Mi Xin Lu pointed ahead, her eyes filled with yearning.<br/><br/>Clearly, she had heard of the great name of the Divine Willow Daoist sect.\t\t\t\t\t\t</div>", "images": {}, "success": true}