{"id": 47, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15071995.html", "title": "Chapter 3038 - Chapter 3038: 3037 Ya Long", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 3038 - Chapter 3038: 3037 Ya Long</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 3038: 3037 ya long<br/><br/>“Father, why did you give such a precious willow deity Venerable’s branch to him? Such a branch can be exchanged for a peak divine emperor rank magic tool in the Milky Way!”<br/><br/>On a planet of the Dark Sky clan, the clan leader of the Dark Sky clan looked at the departing figure and asked his father beside him.<br/><br/>“Firstly, it’s to repay a debt of gratitude. Secondly, it’s to invest. When the Dragon Palace rescued me from that sealed place, I could see that they were extraordinary. If I’m not wrong, the Dragon Palace’s current base is on the continent at the center of the Mo Han Room Ruins.”<br/><br/>“With the speed of development of the Dragon Palace, it’s hard to say.”<br/><br/>Ming Xuanzhi looked at the disappearing figure and shook his head slightly.<br/><br/>“The Red Mist tribe is not weak. The ancient rare tribe and the brain spirit tribe are not weak either. However, with our help, we can help them resist.”<br/><br/>The leader of the Tianming tribe said slowly.<br/><br/>…<br/><br/>“The branch of the venerable willow deity, the willow deity Daoist sect!”<br/><br/>At the same time, in the Void, Wang Xian was flying rapidly. His eyes were sparkling as he looked at the branch in his hand.<br/><br/>In the Milky Way, there were many major races. There were also more than a dozen primary races in the universe.<br/><br/>Other than the various races, there were also some unaffiliated cultivators. Among these unaffiliated cultivators, the most famous one was the venerable willow deity.<br/><br/>The Venerable Willow Deity was not a human, but a big willow tree.<br/><br/>According to the information Wang Xian got from the universe’s AI, the venerable Willow Deity’s true form was a powerhouse that had existed for a long time.<br/><br/>She was originally a willow tree in the Milky Way. After cultivating, she became a universe knight step by step.<br/><br/>Furthermore, her strength was not invincible in the Milky Way. Any elementary races in the universe had to show some respect.<br/><br/>Some people said that she was the creature that had lived the longest in the Milky Way.<br/><br/>Now, she had taken root beside the Milky Way and established a training hall.<br/><br/>Venerable willow deity was highly respected. She did not participate in any disputes and did not engage in any killings.<br/><br/>The training hall that she established did not have any stance.<br/><br/>It did not accept disciples and only taught.<br/><br/>Furthermore, if one wanted to enter the willow deity training hall, not only did one need talent, there was also an important test, temperament.<br/><br/>Those with a bad temperament would not be able to join the willow deity Daoist sect.<br/><br/>The Willow deity Venerable’s branch in Wang Xian’s hand could prevent him from participating in other tests. As long as he took the branch into the Daoist sect and tested his temperament, he would be able to enter the Daoist sect immediately to learn.<br/><br/>In the Daoist sect, there were treasures that the willow deity venerable had once obtained, as well as the divine liquid condensed by the Willow deity Venerable.<br/><br/>To cultivators, this was a huge treasure trove.<br/><br/>Joining the Willow God training hall had two benefits. One was cultivation. Even the grotto-heaven of a primary race of the universe was vastly different from the Willow God training hall.<br/><br/>After all, there were only over 10,000 people in the Willow God training hall. A training hall built by a universe knight, teaching over 10,000 students, one could imagine how great the benefits were for cultivation.<br/><br/>The second benefit was protection. In the Willow deity Daoist sect, no one dared to kill people here.<br/><br/>Even if you killed a big shot in the Milky Way, no one would dare to kill you if you hid in the willow deity Daoist sect.<br/><br/>However, outside the willow deity Daoist sect, life and death were determined by fate and wealth.<br/><br/>Outside the willow deity Daoist sect, the disciples of the two Daoist sects would fight, and venerable willow deity would not care.<br/><br/>Of course, the possibility of this happening was very small. Those who could enter the training ground must have a good temperament.<br/><br/>“This willow deity training ground is a good place.”<br/><br/>Wang Xian recalled the information one by one as his eyes sparkled.<br/><br/>An expert who merely built a training ground and did not seek for anything was very rare.<br/><br/>However, when he thought about how she was a willow tree, it made sense.<br/><br/>Powerful plant-type creatures usually did not have a heavy killing intent.<br/><br/>“I’ll join the Willow deity Daoist sect there.”<br/><br/>With this thought in mind, Wang Xian immediately sped up.<br/><br/>He flashed in the void rapidly and spread the primaless sacred wings. With his speed, it would take him nearly two years.<br/><br/>One had to know that he could fly at full speed with the primaless sacred wings. He was comparable to a peak-stage divine emperor.<br/><br/>One could imagine how far the distance was.<br/><br/>On the other hand, an lie was much faster than him. However, he did not allow an lie to bring him over.<br/><br/>Flying in the universe was also a form of training.<br/><br/>As he flew at full speed, star meteorites flew out from his side one after another.<br/><br/>Some stars had a terrifying gravitational force while some stars had a strong repulsive force.<br/><br/>There were also stars that emitted a terrifying high temperature and extreme cold.<br/><br/>After flying for more than a month, Wang Xian even met some stars that could threaten him.<br/><br/>In the void at the center of the universe, there were all sorts of things.<br/><br/>After flying continuously for three months, he met a terrifying space beast.<br/><br/>A real space beast. With just a glance, that space beast disappeared instantly.<br/><br/>“A space beast at the level of a universe Knight.”<br/><br/>Looking at the disappearing figure, Wang Xian’s pupils contracted slightly. His eyes were filled with fear.<br/><br/>As he continued flying, he encountered many civilized planets in the middle.<br/><br/>“There is a planet teleportation formation in front. It belongs to a domain-level race. It can save more than a year’s flying time!”<br/><br/>After flying for more than ten days, Wang Xian saw some information on the universe’s AI and thought to himself.<br/><br/>Soon, a planet appeared in his sight. He landed on the planet, paid some divine stones, and teleported directly.<br/><br/>After teleporting to a continent, he looked at the distance shown on the universe’s AI and smiled.<br/><br/>He should be able to reach it in two months at most.<br/><br/>With a move, Wang Xian immediately flew into the void.<br/><br/>As time passed, Wang Xian encountered many wonders in the universe.<br/><br/>He had even encountered a few black holes. As for where the other end of the black hole was, Wang Xian did not know. He did not dare to try.<br/><br/>Boom! Boom! Boom<br/><br/>When he had left the Dragon Palace for seven months and was relatively close to the Milky Way, a series of booming sounds suddenly came from the void in front of him.<br/><br/>“Quick, quick, catch her. We can’t let her escape.”<br/><br/>“Hahaha, you’re dreaming if you want to escape!”<br/><br/>Voices came from the front.<br/><br/>Following that, Wang Xian saw a creature that was three meters in size and was as big as a deer. Water flowed around her body and she had the strength of a level six divine emperor.<br/><br/>At this moment, there was a long wound on her abdomen and fresh blood was flowing out continuously.<br/><br/>Her eyes scanned the surroundings in a panic and her face was filled with despair.<br/><br/>There was also a black confinement circle above her head. It was obvious that it had locked onto her.<br/><br/>Behind her, dozens of divine emperor powerhouses were staring at her excitedly.<br/><br/>“Roar!”<br/><br/>A slightly crisp and low groan came out from her mouth.<br/><br/>“This is?”<br/><br/>Wang Xian sensed a familiar aura from this deer-like creature.<br/><br/>It was a familiar aura that came from the bloodline.<br/><br/>“Divine Dragon Bloodline?”<br/><br/>“Ya Long?”<br/><br/>Wang Xian’s eyes sparkled.<br/><br/>“Roar! Roar!”<br/><br/>At this moment, the ya long in front also saw Wang Xian. Her eyes were filled with panic and fea\t\t\t\t\t\t</div>", "images": {}, "success": true}