{"id": 45, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15071991.html", "title": "Chapter 3036 - Chapter 3036: 3035 Was In An Uproar", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 3036 - Chapter 3036: 3035 Was In An Uproar</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 3036: 3035 was in an uproar<br/><br/>“You are courting death! Your Dragon Palace is courting death!”<br/><br/>“Do you really think that our red fog race is afraid of Your Dragon Palace? We will definitely exterminate you!”<br/><br/>An angry voice came out from the mouths of the experts from the red fog race.<br/><br/>They stared at Wang Xian with furious faces and roared ferociously.<br/><br/>Do you really think that the red fog race is afraid of the Dragon Palace?<br/><br/>They had already made preparations since they dared to attack the experts from the Dragon Palace directly today.<br/><br/>With their master’s and clan leader’s strength, as long as they were captured, they could use the array formation to search for the Dragon Palace’s lair and easily destroy it.<br/><br/>Now, they actually dared to assassinate them?<br/><br/>They were courting death!<br/><br/>“Leave him here and seal the space!”<br/><br/>The red fog race’s three rank nine divine emperors’eyes were filled with violent killing intent as they roared ferociously.<br/><br/>“Set up the formation!”<br/><br/>The three of them waved their arms and the formation that sealed off the void was quickly formed.<br/><br/>“Roar Roar Roar! Anyone who offends the red fog race will die!”<br/><br/>The leader of the giant mountain rampaging giant had an incomparably huge body. He waved his arms and charged towards Wang Xian.<br/><br/>“I won’t play with you guys anymore. Ming Xuanzhi, we don’t owe each other anymore. I’ll take my leave first.”<br/><br/>Wang Xian smiled valiantly. His body moved and he was instantly sent flying backwards.<br/><br/>Then, his figure turned illusory and left.<br/><br/>Rumble<br/><br/>At the spot where he had just left, waves of terrifying energy covered him.<br/><br/>“Damn it, his speed is too fast!”<br/><br/>The four level nine celestial thearch powerhouses from the red fog race had gloomy expressions.<br/><br/>None of the four people from the Dragon Palace stayed behind.<br/><br/>“Hahaha, Celestial Thearch Hong Tian, are you still going to fight?”<br/><br/>Ming Xuanzhi laughed out loud when he saw Wang Xian and the rest leaving.<br/><br/>“Ming Xuanzhi, I, Hong Tian, will remember what happened today!”<br/><br/>Celestial Emperor Hong Tian stopped his attack and stared at him with a cold expression.<br/><br/>“So be it. I’m leaving first. I didn’t choose an auspicious day when I set up my clan. This is great. I’ve lost face and lost many disciples!”<br/><br/>Ming Xuanzhi said mockingly. His body moved and he flew out.<br/><br/>God Emperor Hong Tian’s expression changed drastically when he heard Ming Xuanzhi’s words. His gaze swept the surroundings and his expression was pitch black.<br/><br/>“God Emperor Hong Tian, please take care of the situation here first. We Won’t Disturb You Anymore!”<br/><br/>An expert from the mountain-piercing clan cupped his hands and bade farewell.<br/><br/>The Sky Flame clan and the others also cupped their hands and left.<br/><br/>One by one, the races left with a strange expression on their faces.<br/><br/>The Red Mist clan had lost a lot of face today. On the day they established their clan, they wanted to take down the expert from the Dragon Palace, but they failed.<br/><br/>Not only did they not kill the members of the Dragon Palace, but they also killed a large number of their disciples.<br/><br/>Even a level eight divine emperor expert, a level eight divine Emperor War Pet, was killed by the Dragon King of the Dragon Palace.<br/><br/>Tens of thousands of other disciples were killed or injured, which was a heavy loss for the Red Fog clan.<br/><br/>The most important thing was the loss of reputation.<br/><br/>The Red Fog clan had just been established. Because it was not a traditional race, they needed to recruit external disciples.<br/><br/>Now that such a situation had occurred, many unspecialized people who were ready to join had to consider it.<br/><br/>This time, not only did they not establish their prestige, but they also lost face.<br/><br/>“Dragon Palace!”<br/><br/>Seeing the group of people leave, God Emperor Hong Tian’s eyes were filled with a violent killing intent as he roared.<br/><br/>He wanted to make the Dragon Palace pay a heavy price for today’s matter.<br/><br/>“Haha, Awesome! That God Emperor Hong Tian is so arrogant. He even wants to keep us here and destroy us. He’s simply courting death!”<br/><br/>At the same time, in the Dragon Palace’s Dragon King Hall, the eight-limbed demon fiend and the others shouted with excitement.<br/><br/>“This time, it’s all thanks to Ming Xuanzhi’s appearance. If it weren’t for him, we would only be able to escape with our tails between our legs.”<br/><br/>Tian Chen said faintly from the side.<br/><br/>The reason why they were able to destroy so many experts of the red fog race this time was because Ming Xuanzhi was able to resist God Emperor Hong Tian.<br/><br/>If it wasn’t for him, they would have had to expend some effort to escape, let alone kill someone.<br/><br/>“Overall, it’s not good for us this time. Now, we have completely offended the red fog race.”<br/><br/>Wang Xian sat on the dragon throne and said.<br/><br/>“Dragon King, we will fight with them. Anyway, our dragon palace is very safe here. Even if we are discovered, the defensive power of the dragon palace is sufficient to withstand any attack from anyone below the level of a universe Knight.”<br/><br/>“I’ll have my subordinates slowly parasitize the red fog race’s warriors and completely control their actions. When the time comes, I’ll have the Thorned Dragon to assassinate them and play with them.”<br/><br/>“I can guarantee that in 10 to 20 years at most, we’ll be able to exterminate their entire red fog race. If other races dare to provoke us, we can also slowly nibble them away.”<br/><br/>Mo Sha said with a face full of killing intent.<br/><br/>In the current void space, Mo Sha, Ba Qi, and the rest were confident that with the abilities of the poisonous horned dragon species and Ao yaoyao, an lie, and the rest, they would be able to nibble away all the powers in this starry space.<br/><br/>However, this might take a very long time.<br/><br/>Upon hearing their words, Wang Xian’s eyes sparkled.<br/><br/>“Dragon King, if we want to enter the deeper parts of the universe, we really need to establish a good foothold here. It doesn’t matter even if we spend a few dozen to twenty years.”<br/><br/>“Our Dragon Palace has always been improving very quickly. It’s not impossible for us to settle down properly this time. Just like what the demonic eight Qi said, we should accompany all the forces in this starry sky and have a good time.”<br/><br/>Prime Minister Gui stood at the side and said after a moment of silence.<br/><br/>“That’s good too!”<br/><br/>Wang Xian nodded. There was no other way.<br/><br/>The current Dragon Palace didn’t have the ability to fight against the red fog race.<br/><br/>They didn’t have the ability to fight against a powerhouse at the peak of the celestial thearch.<br/><br/>Furthermore, even if he wanted to improve, he would need a large amount of resources. If he wanted to obtain these resources, he would have to kill a domain-level race.<br/><br/>Completely exterminate them.<br/><br/>However, it wasn’t easy to exterminate such a race. It was also easy to incur the wrath of the public.<br/><br/>“Perhaps, I should go out and take a walk. There’s also Lingxiu. I have searched the entire starry sky and the ruins of the Mohan clan, but I still haven’t found her. She should be in the center of the universe.”<br/><br/>“I can leave the matters here in the Dragon Palace to Prime Minister Gui and the Heaven Formation to let the Dragon Palace settle down.”<br/><br/>Wang Xian made a decision in his heart.<br/><br/>In the next two days, the news of what happened on the day the Red Fog clan was established quickly spread throughout the starry sky.<br/><br/>This news shocked everyone.<br/><br/>The strength and foundation the Red Mist clan had displayed was indeed powerful, but the incident with the Dragon Palace had caused them to lose face completely.<br/><br/>They had been ridiculed by many people.<br/><br/>The Dragon Palace had also completely formed a grudge with the Red Mist clan.<br/><br/>“Now, the Dragon Palace has offended many races. The ancient rare race, the brain spirit race, the Red Mist race. Perhaps the Heaven Flame clan isn’t very happy with the Dragon Palace either!”<br/><br/>“The strongest divine emperor of the Dragon Palace is at level nine. If the Dragon Palace’s lair is discovered, they will definitely be destroyed.”<br/><br/>“That’s hard to say. The Dragon Palace owes a favor to the father of the current clan leader of the Dark Sky clan. The Dark Sky clan might stand on the Dragon Palace’s side. Their strength is very strong.”<br/><br/>On the universe’s AI, countless people were discussing.\t\t\t\t\t\t</div>", "images": {}, "success": true}