{"id": 57, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15072015.html", "title": "Chapter 3048 - Chapter 3048: 3047 Shook The Willow Deity Daoist Sect", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 3048 - Chapter 3048: 3047 Shook The Willow Deity Daoist Sect</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 3048: 3047 shook the willow deity Daoist sect<br/><br/>“Brother Wang, these two ships are celestial emperor level six ships. Their value is not low.”<br/><br/>When Mi Xinlu saw Wang Xian killing the ice mountain race, there was not much fluctuation.<br/><br/>This was how the universe worked. They fought each other for resources.<br/><br/>This was the only way to become stronger.<br/><br/>“Okay.”<br/><br/>Wang Xian nodded his head. He moved his body and entered the two ships. He swept his gaze across the ships. Other than some items, there was nothing else.<br/><br/>With a wave of his arm, he kept the two ships and came to the great mill of the five elements.<br/><br/>“Let’s Go!”<br/><br/>Wang Xian said faintly.<br/><br/>“Brother Wang, you killed a disciple of the willow deity Daoist sect. Is It Bad?”<br/><br/>Mi Xinlu asked worriedly.<br/><br/>“The venerable willow deity does not interfere in such matters.”<br/><br/>Wang Xian said nonchalantly. He swept his gaze across the surroundings and continued to fish.<br/><br/>…<br/><br/>“Huff, Huff, Huff!”<br/><br/>“That Wang Xian actually dared to kill us. He actually killed all the members of Our Ice Mountain race. How dare he!”<br/><br/>“Report to our tribe leader. Report to Our Ice Mountain Race.”<br/><br/>At the same time, on a wide branch of the willow deity Daoist sect, two figures appeared with pale faces and cold sweat on their foreheads.<br/><br/>They were still in shock as they roared in a low voice. Their faces were filled with shock and anger.<br/><br/>They had never expected that the newcomer would be so ruthless. He did not give them any face and attacked them directly.<br/><br/>They had never expected that he was so powerful.<br/><br/>“Tell this matter to the clan leader and the rest. I want to announce this matter to the Divine Willow Daoist sect. I want to tell all the senior brothers and disciples to let them know who that Wang Xian is.”<br/><br/>A middle-aged man growled in a low voice with an incomparably cold expression.<br/><br/>He took out the universal AI and told the entire matter to the group of disciples of the Liu God Daoist sect.<br/><br/>“What? The new junior brother Wang Xian killed Bing Ling Hongyu, Bing Ling Shan Chuan, Ao Wu Yun and the rest? Hiss… this…”<br/><br/>“Is this for real? The new disciple killed Bing Ling Hongyu and the rest?”<br/><br/>“That Wang Xian is not at the third level of the Celestial Thearch Realm? Those who are able to join our willow deity Daoist sect have to go through a test of their temperament. Is there a special reason for this?”<br/><br/>“Is the new Wang Xian so powerful? Is He so unscrupulous?”<br/><br/>In the group chat of the disciples of the Willow deity Daoist sect, when everyone saw this news, they were extremely shocked.<br/><br/>How long had this new disciple, Wang Xian, been in the Willow deity Daoist sect?<br/><br/>Now, he actually killed three disciples of the Willow deity Daoist sect?<br/><br/>And that Wang Xian, what was his strength?<br/><br/>He was actually so unbridled.<br/><br/>All the disciples were extremely shocked and bewildered.<br/><br/>In the willow deity Daoist sect, although there were disciples who died occasionally, such an incident where they were directly killed by their fellow disciples had never happened before.<br/><br/>It might have happened, but at the very least, it was not exposed.<br/><br/>Now, a new disciple had just arrived for two months, and he had killed three disciples. This…<br/><br/>The entire Divine Willow Daoist sect was in an uproar.<br/><br/>All the disciples were extremely shocked by Wang Xian’s actions.<br/><br/>They were also slightly apprehensive about Wang Xian.<br/><br/>It was best to have less contact with such people.<br/><br/>“Senior brother, we received news from our race. They want us to know everything about that Wang Xian. We will definitely exterminate him.”<br/><br/>In the Willow deity Daoist sect, two middle-aged men had a ferocious expression when they received the news from their race.<br/><br/>Among their ice mountain domain-level race, only the five of them had entered the willow deity Daoist sect.<br/><br/>For a domain-level faction, having a disciple who could enter the willow deity Daoist sect meant that the race would have a few more experts in the future.<br/><br/>The weakest disciple who walked out from the willow deity Daoist sect had reached the eighth level of the celestial thearch.<br/><br/>It was normal for them to reach the ninth level divine emperor.<br/><br/>The ninth level divine emperor was considered a pillar in their domain-level races.<br/><br/>The death and injury of such disciples was not a small loss to their race.<br/><br/>This made everyone from the ice mountain race extremely furious. They were determined to take revenge.<br/><br/>“I’ll find some friends from the willow deity Daoist sect and have them pay attention to that fellow’s actions. Once they discover it, we’ll report it to the clan.”<br/><br/>A middle-aged man’s eyes were filled with hatred as he growled in a low voice.<br/><br/>The other person nodded his head heavily and clenched his fists.<br/><br/>“Heart Deer, announce on the universe’s AI that the Battle Pets for sale this time will be on the ocean in front of the silver gazing continent.”<br/><br/>On the surface of the Milky Way, Wang Xian fished three more times with his fishing technique.<br/><br/>The three times he fished were not very good. The strongest one was only a level seven celestial thearch aquatic creature.<br/><br/>Wang Junbao looked at the time and prepared to tame all the aquatic creatures.<br/><br/>The ten thousand red-winged fish had not been completely tamed, nor had they been tamed during the three fishing trips.<br/><br/>It would take about half a month to calculate the time needed to tame them.<br/><br/>It just so happened that after he had successfully tamed them this time, he would sell them directly.<br/><br/>Initially, he was still considering whether to sell them to some disciples of the Divine Willow Daoist sect.<br/><br/>However, when he saw the contents of the exchange zone for the disciples of the Willow deity Daoist sect, he dismissed this idea.<br/><br/>Currently, there were quite a number of people criticizing him in the exchange group.<br/><br/>Looking at this information, he smiled and did not take it to heart.<br/><br/>“Alright, Brother Wang. I will go and inform them now. There are quite a number of people paying attention to our battle pets. It will definitely be very popular.”<br/><br/>Mi Xinlu said excitedly.<br/><br/>Wang Xian nodded with a smile. Then, he tamed these dire beasts.<br/><br/>“HMM?”<br/><br/>Time passed day by day. When there were still five days before two months, he suddenly felt the fluctuations in his surroundings.<br/><br/>He looked towards the back where the dragon eyes of the yin-yang and five elements were staring at.<br/><br/>“The Ice Mountain Race’s divine weapon warship? It is much stronger than the two that I obtained. It seems that the Ice Mountain Domain race wants revenge.”<br/><br/>Wang Xian narrowed his eyes slightly. A cold glint flashed in his eyes.<br/><br/>“What’s wrong, brother Wang?”<br/><br/>At the side, Mi Xin Lu looked over curiously. There was a look of surprise in his eyes.<br/><br/>“The members of the Ice Mountain race. They should be here to seek revenge on me. Hehe, let’s go. Let’s hide for a while!”<br/><br/>Wang Xian smiled gently. He had no time to play with them.<br/><br/>He would talk about it after he tamed and sold his desolate beasts.<br/><br/>Moreover, Wang Xian could sense waves of powerful auras from the battleship.<br/><br/>These auras belonged to a level nine divine emperor. There should be four to five of them.<br/><br/>“It was them who wanted to kill us. That’s why we retaliated. HMPH, we will teach them a lesson sooner or later.”<br/><br/>Mo Xinlu snorted unhappily.<br/><br/>“Hehe, that’s right. We will teach them a lesson sooner or later. Moreover, it won’t take long.”<br/><br/>Wang Xian said faintly.<br/><br/>If it wasn’t for the urgent matter of taming the dire beasts, he would have played with these guys today.<br/><br/>As long as there weren’t any powerhouses at the peak of the divine emperor realm, Wang Xian wouldn’t be afraid at all.<br/><br/>“It’s a pity that the sale of all the war pets this time isn’t enough to allow my strength to achieve a breakthrough.”<br/><br/>He mumbled as the five elements millstone flew rapidly in a certain direction.<br/><br/>This time the resources are not enough, a few more times, it should not be a big problem.\t\t\t\t\t\t</div>", "images": {}, "success": true}