{"id": 51, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15072003.html", "title": "Chapter 3042 - Chapter 3042: In The Small Group Of 3041 Willow Deity Daoist Sect", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 3042 - Chapter 3042: In The Small Group Of 3041 Willow Deity Daoist Sect</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 3042: In the small group of 3041 willow deity Daoist sect<br/><br/>“Hello, junior brother Wang Xian.”<br/><br/>“Haha, there’s a newcomer. Junior brother Wang Xian, it’s not the assessment period now. How did you join the Willow deity Daoist sect?”<br/><br/>In the Willow deity Daoist sect, a few middle-aged young men looked at Wang Xian who was in front of them. They walked over with smiles on their faces and greeted him.<br/><br/>Two middle-aged men and three young men.<br/><br/>Wang Xian swept his gaze over and revealed a smile on his face.<br/><br/>“I obtained a willow heart by chance, so I joined the willow deity Daoist sect directly.”<br/><br/>He said politely.<br/><br/>“Willow Heart. I didn’t expect junior brother Wang Xian to have such a fortuitous encounter. May I know which Faction Junior Brother comes from?”<br/><br/>A middle-aged man with long hair and a folding fan walked over and asked with a smile.<br/><br/>“An unspecialized.”<br/><br/>Wang Xian replied with a smile.<br/><br/>“Oh? An unspecialized?”<br/><br/>The few people who surrounded him revealed astonished expressions.<br/><br/>“Junior brother Wang Xian is new here. Today, I will treat you to a meal at Yu Hai Tavern. Let’s celebrate.”<br/><br/>At this moment, an old man flew over and announced loudly with a smile on his face.<br/><br/>“Wow, thank you, Senior Brother Junzi.”<br/><br/>“Haha, it’s My Lucky Day. Thank you, Senior Brother Junzi.”<br/><br/>Around them, the disciples of the Willow deity Daoist sect said happily.<br/><br/>“Eh?”<br/><br/>Wang Junbao looked at the old man. After hesitating for a moment, he cupped his hands and said, “Thank you, senior brother Junzi.”<br/><br/>“You’re welcome, you’re welcome.”<br/><br/>“Junior brother Wang Xian is new here. We came here earlier than you. Naturally, we will treat you well. Junior brother, it is a tradition of our willow deity Daoist sect to carve your name there.”<br/><br/>Senior Brother Junzi pointed at the spot in front of him and said.<br/><br/>Wang Xian looked over. There was a huge wooden plaque in front of him with names inscribed on it.<br/><br/>There were more than 10,000 names on it. Wang Xian waved his arm and left his name on it.<br/><br/>“Welcome to the big family of the Willow Deity sect. Let’s go, Yu Hai Tavern.”<br/><br/>Senior Brother Junzi laughed out loud and waved his hand.<br/><br/>“TSK TSK TSK, let’s Go!”<br/><br/>“Senior brother Junzi is treating. We can have a good meal now.”<br/><br/>There were more than three thousand members of the Willow deity Daoist sect. At least more than a thousand of them followed immediately.<br/><br/>“Junior brother Wang Xian, follow me!”<br/><br/>As senior brother Junzi spoke, he brought Wang Xian and flew towards the outer area.<br/><br/>The willow deity Daoist sect was very small. After flying for a few seconds, they arrived at a slightly prosperous small market. It was a market with an area of a few tens of kilometers.<br/><br/>There were not many people inside. When some people saw them arrive, their faces were filled with respect and envy.<br/><br/>These were some dao children, the people who had followed the disciples of the Divine Willow Daoist sect in.<br/><br/>They lived here and served their followers.<br/><br/>“Boss, I’ve booked the Yu Hai Tavern today to celebrate junior brother’s joining. If there’s anything in Your Tavern, come up.”<br/><br/>The group flew to a luxurious small courtyard. The scenery in the courtyard was very beautiful. There was a small rockery and a small fountain.<br/><br/>“Yes, Sir Gentleman.”<br/><br/>The boss of Yu Hai Tavern immediately said respectfully when he saw them.<br/><br/>“Junior brother Wang Xian, this is the best tavern in our Willow deity Daoist sect. The wine in it is brewed with diluted flowing heart liquid. The food here is all made from water dire beasts of the divine emperor level. It’s definitely comparable to those top-notch hotels in the Milky Way.”<br/><br/>“Only our senior brother Junzi is rich. If it were up to us, it would be good if we could come and eat here once a month.”<br/><br/>“This time, we have benefited from junior brother. hahaha!”<br/><br/>A slightly chubby middle-aged man walked to Wang Xian’s side and said with a smile.<br/><br/>“Oh? is that so? Then I have to thank senior brother Junzi more.”<br/><br/>Wang Xian said with a smile.<br/><br/>“Hehe, our senior Junzi is famous for being a good person in our willow deity Daoist sect.”<br/><br/>The chubby middle-aged man said with a smile and patted his shoulder. “You will know after staying here for a little longer.”<br/><br/>Wang Xian nodded and looked at senior Junzi in front of him.<br/><br/>From his senses, he could sense that he had the strength of a peak divine emperor.<br/><br/>It was the strongest person he had seen in the willow deity Daoist sect.<br/><br/>Once the willow deity Daoist sect broke through to the universe knight level, they would be sent out automatically.<br/><br/>This was one of the rules of the Willow deity Daoist sect.<br/><br/>In addition, if there were disciples of the Willow deity Daoist sect who held important positions in a race, they would also be sent out of the willow deity Daoist sect.<br/><br/>As a neutral sect, the disciples of the Willow deity Daoist sect could come from various races, but they could not hold important positions in their race.<br/><br/>This was the rule of the venerable willow deity.<br/><br/>Wang Xian looked at the surrounding atmosphere and felt very relaxed.<br/><br/>“Come, come, everyone, welcome junior brother Wang Xian to join us.”<br/><br/>The dishes and wine were served quickly. Senior Brother Junzi raised his wine glass and walked to Wang Xian. He said with a loud laugh.<br/><br/>“Alright, Alright. Welcome junior brother Wang Xian to join us. Welcome!”<br/><br/>“Haha, if you have any matters in the Milky Way in the future, you can look for me, Old Tang.”<br/><br/>All the disciples of the Willow deity Daoist sect said enthusiastically.<br/><br/>“Thank you, everyone. I’ll be looking forward to your guidance in the future.”<br/><br/>Wang Xian raised his wine glass with a smile on his face and thanked them.<br/><br/>His gaze swept across everyone. He liked this kind of atmosphere very much.<br/><br/>Ever since he stepped into the universe, there had been battles everywhere. Such a peaceful and harmonious place was rarely seen.<br/><br/>“Sure, sure!”<br/><br/>The group of disciples said with a smile.<br/><br/>“Thank you, senior brother Junzi.”<br/><br/>Wang Xian picked up his wine cup and toasted senior brother Junzi.<br/><br/>“You’re welcome. If you don’t know anything about cultivation in the future, you can look for me. You can also look for other people. The friends here are very warm-hearted.”<br/><br/>Senior Brother Junzi shook his head nonchalantly.<br/><br/>Wang Xian nodded his head and walked over to the table to toast.<br/><br/>He was aware of some etiquette.<br/><br/>Since the other party was so enthusiastic, he couldn’t do any errands.<br/><br/>“Under the investigation of the Realm Detection Stone, he has the realm of a third level divine emperor. Let’s see if we can rope him over to our side.”<br/><br/>“An unspecialized. If we give him sufficient benefits, he shouldn’t reject it. However, I’m afraid that other people from other races would rope him over.”<br/><br/>At a dining table, ten people were sitting there. They glanced at Wang Xian and said.<br/><br/>“Junior brother Wang Xian, come over here.”<br/><br/>At this moment, Wang Xian, who had just finished honoring all the disciples of the Willow deity Daoist sect, saw the chubby middle-aged man who spoke to him earlier greeting him.<br/><br/>“Junior brother Wang Xian, please take a seat. You just came here, and you’re an unspecialized. I reckon that someone will invite you to join some factions later. Make your preparations.”<br/><br/>Wang Xian had just walked over when the plump middle-aged man reminded him directly.<br/><br/>“Oh? Invite me to join some forces?”<br/><br/>Wang Xian revealed a surprised expression.<br/><br/>“Hehe, come on, let’s have a good chat. It’s not as harmonious as you think in the Willow deity Daoist sect. In fact, this place is divided into dozens of small groups. As for me, I’m an unspecialized just like you. That’s why I’m reminding you.”<br/><br/>The slightly chubby middle-aged man said to him and pointed at the rest of the people on the table. “There are also people on this table. The people on the other table are all unspecialized and have not joined any forces.”<br/><br/>When Wang Xian heard his words, he looked pensive.\t\t\t\t\t\t</div>", "images": {}, "success": true}