{"id": 59, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15072019.html", "title": "Chapter 3050 - Chapter 3050: All 3049 Were Sold", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 3050 - Chapter 3050: All 3049 Were Sold</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 3050: All 3049 were sold<br/><br/>“There are three divine emperor level 8 war pets. As expected, there are three of them. Impressive!”<br/><br/>“There should be more than 10,000 divine emperor level war pets here. There are still more than 20 divine emperor level 7 war pets.”<br/><br/>“That war pet was reserved by me. hahaha!”<br/><br/>On the ship, when everyone saw more than 10,000 war pets on the ship, their faces were filled with fervent expressions.<br/><br/>The eyes of the elder from the foggy race and the dwarf elder also flickered.<br/><br/>“This is only a part of it. There are also more than 10,000 red-winged fish war pets. They should have been reserved by this three-foot race expert.”<br/><br/>Wang Xian looked at their shocked expressions and said faintly.<br/><br/>“According to the reservation on the universal AI, everyone prepare the divine stones. If you want to help tame them, let us know in advance.”<br/><br/>At this moment, Mi Xin Lu said to everyone.<br/><br/>“These are the divine stones of the three celestial emperor level eight war pets. Please count them.”<br/><br/>The elder from the foggy race took out an interspatial ring. With a wave of his arm, he floated in front of Wang Xian.<br/><br/>Wang Xian’s dragon eyes flickered as he stared at the large number of divine stones inside. A faint smile appeared on his face.<br/><br/>With a wave of his arm, the three celestial emperor level eight war pets walked over slowly. Their ferocious aura made many people around them look terrified.<br/><br/>“Reveal the lair!”<br/><br/>Wang Xian patted one of the war pets on the head and said.<br/><br/>“Roar!”<br/><br/>The three war pets let out a low roar. The Phantom of a lair appeared behind him. This represented a complete war pet.<br/><br/>“Alright. If your Celestial Palace still has war pets, our misty race will take them all!”<br/><br/>The elder from the Misty Race revealed a satisfied look on his face. His eyes flickered as he said.<br/><br/>“Our three-foot race wants it as well.”<br/><br/>The short elder with a huge hammer in his hand also spoke.<br/><br/>“Everyone, in order to not offend the various races, the war pets of the Immortal Palace will only be sold on the AI in the future. Book it in advance and get it on a first-come, first-served basis.”<br/><br/>“The next time we sell it will be within the next four months.”<br/><br/>Wang Xian said faintly.<br/><br/>“Huh?”<br/><br/>The elder from the mist race and the three-foot race frowned slightly.<br/><br/>“Alright, everyone, bring the divine stones that you have purchased and leave as soon as possible.”<br/><br/>Wang Xian urged.<br/><br/>“This is the one I have reserved.”<br/><br/>“I have reserved the level three divine Emperor War Pet.”<br/><br/>The elders in the middle said immediately.<br/><br/>Soon, more than 20,000 war pets were sold. Some of them did not come and were bought by others.<br/><br/>Most of them didn’t ask Wang Xian to help them tame them.<br/><br/>Since Wang Xian’s taming price was very expensive, it was much cheaper for them to find other beast tamers.<br/><br/>This was also something that Wang Xian was happy to see and did on purpose.<br/><br/>With the time to help them tame them a second time, they would be able to capture quite a number of them in the Milky Way.<br/><br/>“Alright, let’s go.”<br/><br/>After selling all the war pets, Wang Xian smiled at Mi Xin Lu. With a wave of his arm, the ship quickly flew into the ocean.<br/><br/>“This ship looks ordinary, but its speed is not slower than a level nine celestial thearch. There might be something else going on.”<br/><br/>As they watched the Celestial Palace’s war pet ship leave, everyone’s eyes sparkled.<br/><br/>“They sold more than 20,000 celestial thearch level war pets at one go. The strongest one is a level eight celestial thearch. This Celestial Palace’s War Pet is not simple. Moreover, they will sell it again within four months. What faction are they from?”<br/><br/>“Could they be from a large race from another place?”<br/><br/>The elder from the misty race muttered.<br/><br/>“Everyone, don’t be in a hurry to leave.”<br/><br/>At this moment, a voice filled with dignity sounded. An aura enveloped everyone.<br/><br/>“Oh?”<br/><br/>The elder from the misty race frowned slightly. He looked at the elder from the three-foot race.<br/><br/>“The war pets for four months will be divided equally between our two races. How about it?”<br/><br/>The dwarf elder smiled at the elder of the misty race and said.<br/><br/>“Okay!”<br/><br/>The elder of the misty race nodded slightly and glanced at the surrounding people.<br/><br/>“My Lords… What… What do you want to Do?”<br/><br/>The faces of the surrounding people changed drastically when they saw this scene and said with some fear.<br/><br/>“I’m a disciple of the water shadow race.”<br/><br/>A youth hurriedly said.<br/><br/>“Everyone, don’t worry, we won’t kill you. Just come with us, and after four months, we will naturally let you all leave. If you don’t cooperate, then don’t blame us for not being polite.”<br/><br/>The misty race elder said coldly.<br/><br/>The rest of the People’s expressions were extremely ugly. Seeing the two universe elementary level race elders lock onto them, they were also very powerless, and could only cooperate.<br/><br/>“Hehe!”<br/><br/>The two elders of the two races smiled faintly.<br/><br/>The next time the Immortal Palace sold war pets, they were looking for some clansmen to pay attention to them because they were prophets. Basically, all the war pets could be obtained by the two races.<br/><br/>This was the law of the jungle in the universe.<br/><br/>The strong were the king.<br/><br/>Wang Xian didn’t know what was going on here. Even if he knew, he didn’t care.<br/><br/>He could sell whoever he wanted.<br/><br/>“Hehe, brother Wang, we have made a huge profit. I have never seen so many divine stones before.”<br/><br/>Mi Xin Lu passed the interspatial rings with divine stones to Wang Xian with a face full of excitement.<br/><br/>“These divine stones are still a little lacking. They are not enough for me to increase my strength.”<br/><br/>Wang Xian said with a smile.<br/><br/>The resources were still lacking when it came to increasing his level.<br/><br/>“I believe that I will be able to earn more divine stones very soon. Brother Wang, you will be able to increase your strength.”<br/><br/>Mo Xinlu said with a smile.<br/><br/>“By the way, how long will it take for the willow deity sect to recruit disciples?”<br/><br/>Wang Xian looked at her and asked.<br/><br/>“About ten months. What’s the matter, brother Wang?”<br/><br/>Mo Xinlu looked at him curiously.<br/><br/>“When the time comes, let’s see if you can enter the willow deity sect.”<br/><br/>As Wang Xian spoke, he was prepared to bring mi xinlu into the willow deity Daoist sect and become a disciple of the sect.<br/><br/>Apart from that, the three treasures gifted by the venerable willow deity were also worth a lot of money.<br/><br/>Furthermore, with the improvement of MI Xinlu’s bloodline during this period of time, it shouldn’t be too much of a problem for him to enter the willow deity Daoist sect.<br/><br/>“Can I enter?”<br/><br/>Mi Xin Lu asked with a face full of surprise and nervousness.<br/><br/>“Don’t worry. With me around, it shouldn’t be a big problem. Let’s return to the Willow Deity sect first. I need to look up some information.”<br/><br/>As Wang Xian spoke, he steered the ship forward at a rapid speed.<br/><br/>He kept the ship into the mother nest where no one was around and continued to move forward while standing on the five elements grinding mill.<br/><br/>“Wait for me at the periphery.”<br/><br/>Wang Xian said to Mo Xinlu and immediately flew towards the center.<br/><br/>He was going to look for some information about the Milky Way.<br/><br/>“Eh? That newcomer, Wang Xian, is here!”<br/><br/>When Wang Xian arrived at the Willow sect, some people noticed his arrival. They looked over and whispered to him.<br/><br/>Wang Xian didn’t care about the stares of others. He walked towards a bigger wooden house at the side.<br/><br/>That was the library of the Willow deity Daoist sect. There were a lot of information in there.<br/><br/>Many of the information was recorded by the disciples of the Willow deity Daoist sect. There were also some that the venerable willow deity had placed in there.\t\t\t\t\t\t</div>", "images": {}, "success": true}