{"id": 53, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15072007.html", "title": "Chapter 3044 - Chapter 3044: 3043 Fishing Rod", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 3044 - Chapter 3044: 3043 Fishing Rod</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 3044: 3043 fishing rod<br/><br/>The fishing rod was very important to anglers.<br/><br/>The extension of energy, the bearing of energy, all depended on the fishing rod.<br/><br/>First of all, the fishing rod had to be completely refined and refined into a part of one’s body.<br/><br/>Only in this way could it be driven like an arm and transmitted energy to the fishing rod to form a fishing line.<br/><br/>It could be said that the fishing rod was equivalent to the angler’s weapon.<br/><br/>Moreover, the fishing rod needed to be refined and strengthened. A powerful fishing rod had a special effect.<br/><br/>Wang Xian took the willow deity’s branch and used his hand to sense it.<br/><br/>With his current combat strength, he couldn’t destroy this branch at all.<br/><br/>The branch had a very strong energy conductivity. Just as the willow deity said, this branch was very suitable to be used as a fishing rod.<br/><br/>“First, I have to refine it. This will take some time.”<br/><br/>Wang Xian mumbled.<br/><br/>If one wanted to do a good job, one must first sharpen the weapon.<br/><br/>From the information, he knew the importance of a fishing rod.<br/><br/>Wang Xian did not hesitate. He immediately started to refine the rod according to the method of refining the fishing rod.<br/><br/>Time passed day by day. Wang Xian was in seclusion in his room.<br/><br/>The spiritual energy in the room was extremely high. Even for a powerhouse at the peak of the Divine Emperor realm, it was a rare paradise.<br/><br/>The news of Wang Xian hanging a signboard in front of the door had also reached the ears of the other disciples of the Willow deity Daoist sect.<br/><br/>The disciples of the various races did not pay too much attention to it.<br/><br/>On the other hand, the group of unaffiliated disciples revealed a faint smile on their faces.<br/><br/>To them, they had one more friend in the same boat.<br/><br/>“Phew, I finally managed to completely refine it. It took me a full two months.”<br/><br/>Wang Xian muttered to himself as a smile appeared on his face.<br/><br/>He looked at the fishing rod in his hand. With a thought, he could directly lengthen it.<br/><br/>According to his guess, the limit of its length was ten million kilometers.<br/><br/>In addition, he could condense the energy to form a fishing line that could cover an area of one billion kilometers.<br/><br/>This area was extremely terrifying.<br/><br/>“Let’s go take a look in the Milky Way.”<br/><br/>Wang Xian stood up and walked out immediately.<br/><br/>“Junior brother Wang Xian, where are you going?”<br/><br/>As he walked out of the room, Du Dalong happened to come out as well. He asked him.<br/><br/>“I’m going fishing to hunt some dire beasts.”<br/><br/>Wang Xian replied.<br/><br/>“Fishing? It’s safer to fish well.”<br/><br/>Du Dalong said with a smile.<br/><br/>“Where are you going, Senior Brother Dalong?”<br/><br/>Wang Xian smiled and asked.<br/><br/>“I’m going to the nearby planets to buy some resources.”<br/><br/>After exchanging a few pleasantries with Du Dalong, Wang Xian flew directly to the market place of the Willow deity Daoist sect.<br/><br/>Sensing the aura of the Mi Xin Lu, he came to the front of a house.<br/><br/>The house was rather beautiful.<br/><br/>“Mi Xin Lu, let’s go. I’ll bring you out of the Milky Way for a stroll.”<br/><br/>Wang Xian stood at the door and transmitted his voice to her.<br/><br/>“Brother Wang, you’re here!”<br/><br/>When Mi Xin Lu heard Wang Xian’s voice, she flew out with a face full of pleasant surprise.<br/><br/>Ever since Wang Xian saved her life last time and brought her here, she was filled with gratitude.<br/><br/>When she heard that he was bringing her out, she flew out excitedly.<br/><br/>“Let’s Go!”<br/><br/>Wang Xian waved his arm and the five elements Millstone turned into a ten-meter-long millstone. He brought her into the Milky Way.<br/><br/>Soon, they arrived at the surface of the Milky Way. The five elements millstone floated on the surface of the water and flew toward the depths of the Milky Way.<br/><br/>“Brother Wang, where are we going now?”<br/><br/>Mi Xin Lu asked him curiously.<br/><br/>“To go fishing. I might need you to do something later!”<br/><br/>Wang Xian said to her.<br/><br/>“Fishing? Fishing is very interesting!”<br/><br/>Mi Xin Lu said happily.<br/><br/>Standing on the five elements grinding mill, Wang Xian was in a good mood as he was surrounded by a vast ocean.<br/><br/>It had been a long time since he flew in such a vast ocean.<br/><br/>The place where Wang Xian was going to fish was a little far from the willow deity Daoist sect.<br/><br/>As a venerable Daoist Rite Temple, there were no powerful aquatic creatures nearby that dared to approach.<br/><br/>Flying in the Milky Way, he could occasionally see some powerful ships and some powerful underwater artifacts.<br/><br/>He could occasionally see powerful people fishing on the surface of the sea.<br/><br/>Wang Xian kept flying forward.<br/><br/>“Brother Wang, we are already very far in.”<br/><br/>After flying for five hours, Mi Xin Lu looked around and saw that there was no one around. There was an extremely deep ocean below. She was slightly afraid.<br/><br/>Especially when she could sense waves of terrifying auras from time to time.<br/><br/>Some of the auras made her heart palpitate.<br/><br/>“HMM, it’s about time. As expected of the Milky Way. There are so many terrifying aquatic creatures here.”<br/><br/>Wang Xian sighed slightly.<br/><br/>“Water is the source of life. There are usually the most creatures in the ocean.”<br/><br/>The Mi Xin Deer said.<br/><br/>“We will be here. This is our first time fishing. I wonder how many dire beasts we will be able to catch!”<br/><br/>Wang Xian narrowed his eyes slightly. With a wave of his arm, the fishing rod appeared in his hand.<br/><br/>“Next is the bait.”<br/><br/>He mumbled. Fishing required bait. The stronger the bait, the more it would attract the aquatic creatures.<br/><br/>The bait could be the flesh and blood of a powerful dire beast, or it could be a divine herb.<br/><br/>“Dragon Blood should have a strong attraction.”<br/><br/>Wang Xian mumbled. Back in the Abyss, he had used dragon blood to attract the abyssal species.<br/><br/>Dragon blood had a fatal attraction to any dire beast.<br/><br/>With a move of his palm, a large amount of dragon blood flowed out. The dragon blood condensed into the shape of a fish.<br/><br/>“This is?”<br/><br/>At the side, Mi Xin Lu felt the pressure from the dragon blood. Her body trembled slightly.<br/><br/>There was reverence and passion in her eyes.<br/><br/>She swung the fishing rod in her hand and waves of energy condensed into a line. The line coiled around the arowana condensed from Dragon Blood.<br/><br/>Splash<br/><br/>The arowana swayed its body and entered the Milky Way below. It swam towards its surroundings.<br/><br/>Under Wang Xian’s control, the small arowana swam at a very fast speed. Very soon, it had dived to a distance of a few hundred million kilometers under the sea.<br/><br/>Through the arowana below, Wang Xian was able to sense the situation around him.<br/><br/>The aura emitted by the arowana, which was condensed from Dragon Blood, had a fatal attraction to any aquatic creature.<br/><br/>Wang Xian transformed into a stool and sat on it. He closed his eyes and sensed it slightly.<br/><br/>Mi Xin Lu watched curiously from the side.<br/><br/>“It’s Here!”<br/><br/>In less than a minute, Wang Xian sensed that the arowana was being stared at by an aquatic creature.<br/><br/>This aquatic desolate beast was only at level nine of King God realm. When it saw the small fish condensed from Dragon Blood, a greedy look appeared in its eyes. It immediately chased after it.<br/><br/>However, Wang Xian was not interested in such a weak aquatic creature. He made the arowana swim quickly.<br/><br/>“Roar Roar!”<br/><br/>A muffled sound was heard faintly. Wang Xian immediately sensed that a powerful aquatic dire beast was attacking the arowana.<br/><br/>Furthermore, the surrounding atmosphere had changed slightly. Waves of aura were locked onto the arowana.<br/><br/>Wang Xian ignored it and continued to control the arowana to swim within the maximum range that he could control.<br/><br/>He could faintly sense that more and more aquatic dire beasts were locking onto the arowana.<br/><br/>“This method of fishing is even more convenient than entering the sea by myself. Moreover, the danger is extremely low!”<br/><br/>Wang Xian sensed this scene and his eyes revealed a look of excitement.\t\t\t\t\t\t</div>", "images": {}, "success": true}