{"id": 56, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15072013.html", "title": "Chapter 3047 - Chapter 3047: Is Junior Brother 3046 Something That You Can Call Out To?", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 3047 - Chapter 3047: Is Junior Brother 3046 Something That You Can Call Out To?</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 3047: Is junior brother 3046 something that you can call out to?<br/><br/>“Junior brother Wang Xian, we have been following that school of fish for several hours. We were just about to capture it when we bumped into you coincidentally.”<br/><br/>On the two ships, a few middle-aged men looked at Wang Xian and said with smiles.<br/><br/>They exchanged glances as their eyes sparkled.<br/><br/>There were more than 10,000 red winged fish. All of them were at the first level of celestial thearch. If they could capture them, it would be priceless.<br/><br/>In particular, if these 10,000 red winged fish could be tamed, it would be able to build a powerful Milky Way army.<br/><br/>A powerhouse at the first level of celestial thearch was considered a core disciple even if he was from a primary race in the universe.<br/><br/>Moreover, the race behind them had yet to reach the primary race in the universe.<br/><br/>“Oh? In that case, my luck is really good!”<br/><br/>Wang Xian replied with a smile.<br/><br/>His luck was really good?<br/><br/>Upon hearing Wang Xian’s words, the expressions of the people on the two ships changed slightly.<br/><br/>It was obvious that he was lucky to obtain more than 10,000 red-winged fish.<br/><br/>“Junior brother Wang Xian, your words are making me feel a little uncomfortable. We have been chasing after them for a few hours and we are about to catch them. You have picked up a bargain.”<br/><br/>“Junior brother Wang Xian, can you at least give us some soup to drink? Furthermore, you don’t have any influence now. Why Don’t you join Our Ice Mountain Race?”<br/><br/>The middle-aged man who was in the lead on the ship on the right squinted his eyes and said to Wang Xian.<br/><br/>“I’m not interested in joining any races, treasures, and resources. Don’t the Fated Know About It? Maybe I’m fated with these dire beasts!”<br/><br/>Wang Xian heard his words and said faintly.<br/><br/>“Fated? Then you have to have the ability to do so. Hand over all the red winged fish immediately. Otherwise, don’t blame us for being rude!”<br/><br/>“A cultivator who is only at the third level of the celestial thearch level. If it weren’t for the fact that you are our young master’s junior brother, we wouldn’t have wasted so much time talking to you. We will kill you directly and the red winged fish will be ours!”<br/><br/>“Don’t be ungrateful!”<br/><br/>However, just as Wang Xian finished his sentence, a middle-aged man at the back was staring at him with a cold gaze.<br/><br/>As he spoke, a powerful pressure was directed at Wang Xian.<br/><br/>The murderous aura on his body was not concealed at all.<br/><br/>“Hey, Uncle Zhu, he is our junior brother after all. Don’t make such a big fuss.”<br/><br/>After the middle-aged man finished his sentence, the middle-aged men from the willow deity Daoist sect at the side spoke up.<br/><br/>It looked like they were speaking leniently, but it was obvious that one was playing the good cop, while the other was playing the good cop.<br/><br/>It was possible that if Wang Xian was not a disciple of the Divine Willow Daoist sect and they had some misgivings, they would have made their move long ago.<br/><br/>“Young Masters, this is related to the interests of our race. Although he is also a disciple of the Divine Willow Daoist sect, our race must also seize the resources. Please do not interfere in this matter and do not interfere.”<br/><br/>The middle-aged man said faintly as his gaze locked onto Wang Xian.<br/><br/>“That’s right. This is related to the interests of our race. Even if you young masters want to interfere, we will not agree to it.”<br/><br/>The other middle-aged men said as waves of imposing manner surged from their bodies.<br/><br/>“Sigh, junior brother Wang Xian, I advise you to hand over all the red winged fish. Otherwise, even the senior brothers will not be able to do anything.”<br/><br/>The corners of the middle-aged men’s lips curled up slightly. They looked at Wang Xian and said faintly.<br/><br/>“Hehe.”<br/><br/>When Wang Xian saw the way they acted, a mocking look appeared in his eyes.<br/><br/>“Indeed, those who are capable will be able to own the resources and treasures. However, I’m not prepared to hand over these red winged fish.”<br/><br/>He said faintly.<br/><br/>“Junior brother, don’t lose your life just because of some resources.”<br/><br/>Upon hearing Wang Xian’s words, the middle-aged men from the willow deity Daoist sect had a change in expression as they spoke coldly.<br/><br/>The middle-aged men from the ice mountain race also had a change in expression. One of them moved his palm and a confinement ring appeared in his hand.<br/><br/>“Looks like you guys want to kill me? It’s a pity that you guys can’t do it!”<br/><br/>Wang Xian shook his head lightly.<br/><br/>“Junior brother, do you think it’s worth wasting the fallen leaves that you obtained from entering the Willow deity Daoist sect?”<br/><br/>“Junior brother, not only did you waste a treasure, you also wanted to offend us and Our Ice Mountain race. You’d better think it through!”<br/><br/>When the middle-aged men from the Divine Willow Daoist sect saw how tactless he was, their expressions turned cold and they no longer tried to hide it.<br/><br/>“Is junior brother something you can call him?”<br/><br/>Wang Xian narrowed his eyes slightly and stared at them.<br/><br/>“You’re courting death.”<br/><br/>His words caused the expressions of the middle-aged men from the willow deity Daoist sect to change. Killing intent appeared in the eyes of the people from the ice mountain race.<br/><br/>Whoosh<br/><br/>In an instant, the middle-aged man who had been prepared waved his arm and a confinement circle attacked Wang Xian.<br/><br/>“You’re the ones who are courting death.”<br/><br/>Killing intent appeared in Wang Xian’s eyes as well. The uninitiated holy wings appeared behind him instantly.<br/><br/>“Die!”<br/><br/>His body moved and disappeared instantly.<br/><br/>“PFFT! PFFT! PFFT!”<br/><br/>The next moment, on a ship on the left, a group of more than 30 people froze instantly.<br/><br/>Their eyes were wide open and filled with shock and fear.<br/><br/>They were too close to him and could not react in time.<br/><br/>This included the three disciples of the Willow deity Daoist sect on the ship.<br/><br/>“What!”<br/><br/>“Not good!”<br/><br/>“He is not a third level divine emperor. He is very powerful!”<br/><br/>On the ship on the right, when they saw that their clansmen on the ship on the left were instantly killed, they revealed astonished expressions.<br/><br/>Such terrifying speed!<br/><br/>Such powerful strength!<br/><br/>This was not the third level divine emperor they had detected!<br/><br/>“Bing Ling Hong Yu and the others have been killed!”<br/><br/>On the ship on the right, the two disciples of the ice mountain race from the Willow deity Daoist sect revealed a look of astonishment when they saw this scene.<br/><br/>That Wang Xian had actually killed them instantly.<br/><br/>He was actually so unscrupulous.<br/><br/>It was rare for the disciples of the Willow deity Daoist sect to fight directly. However, this new guy was actually so unscrupulous.<br/><br/>“He is attacking us. Run!”<br/><br/>However, at this moment, an expert at level six of the divine emperor realm on the ship on the right let out a furious roar and wanted to escape.<br/><br/>“PFFT!”<br/><br/>However, his speed was too slow. In front of Wang Xian’s speed which was comparable to the peak of the divine emperor realm, they could not even return to their divine kingdoms in an instant.<br/><br/>“PFFT PFFT PFFT PFFT!”<br/><br/>“Boom Boom!”<br/><br/>“Huh?”<br/><br/>However, when he killed the experts of the ice mountain race one by one, his attacks were blocked by a powerful energy when they landed on the two disciples of the Willow deity Daoist sect.<br/><br/>A leaf appeared around them.<br/><br/>In the next moment, their figures disappeared instantly.<br/><br/>The return journey of the fallen leaf.<br/><br/>Every student who entered the willow deity Daoist sect could choose a life-saving treasure.<br/><br/>In front of the three treasures, basically all the disciples had chosen the return journey of the fallen leaf.<br/><br/>To them, this was equivalent to having an extra life.<br/><br/>As long as they were not attacked by a universe knight, they could use the return journey of the fallen leaf to escape.<br/><br/>Naturally, Wang Xian’s attack could not be broken.<br/><br/>“Let’s escape then!”<br/><br/>Wang Xian looked at the two of them who were escaping and did not mind.<br/><br/>Since the other party wanted to kill him, he would definitely not hold back.<br/><br/>Moreover, didn’t he join the willow deity Daoist sect so that he could act recklessly?\t\t\t\t\t\t</div>", "images": {}, "success": true}