{"id": 52, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15072005.html", "title": "Chapter 3043 - Chapter 3043: Under The Small Group Of 3042 Willow Deity Daoist Sect", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 3043 - Chapter 3043: Under The Small Group Of 3042 Willow Deity Daoist Sect</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 3043: Under the small group of 3042 willow deity Daoist sect<br/><br/>Du Dalong was the name of the slightly plump middle-aged man.<br/><br/>He had the strength of a celestial emperor at level seven.<br/><br/>From du Dalong, Wang Xian learned some information about the willow deity Daoist sect.<br/><br/>The willow deity Daoist sect was not as simple as he had imagined.<br/><br/>As the famous grotto-heaven paradise in the Milky Way, the cultivation ground created by the top-notch powerhouse Venerable Willow Deity, all the major races naturally wanted to send their disciples here to cultivate.<br/><br/>In each disciple selection, the largest number of people were disciples from more than a dozen primary races of the universe and disciples from other domain-level races.<br/><br/>On the contrary, the number of unspecialized disciples was relatively small.<br/><br/>In the current Willow deity Daoist sect, of the more than ten thousand disciples, ninety-five percent belonged to the major races.<br/><br/>There were only five to six hundred true unspecialized disciples, and the rest all had their own racial forces.<br/><br/>And with their own racial power, there would be competition and disputes.<br/><br/>Especially for some opposing forces. Naturally, their disciples in the Willow deity Daoist sect were also opposing forces.<br/><br/>Often, disciples of the Willow deity Daoist sect would die.<br/><br/>As for how they died, it was unknown.<br/><br/>Every single itinerant disciple who entered the willow deity Daoist sect would definitely be roped in by these racial powers.<br/><br/>After all, as long as they didn’t die after entering the willow deity Daoist sect, they would be able to become a powerhouse above level eight divine emperor in the future. They might even have the potential to become a universe knight.<br/><br/>Such a cultivator with unlimited potential would naturally be roped in by all parties.<br/><br/>And senior brother Junzi was also an unaffiliated disciple.<br/><br/>“Thank you for informing me, senior brother du Dalong.”<br/><br/>Wang Xian cupped his hands at du Dalong. If it wasn’t for what he said, he wouldn’t have known about the situation.<br/><br/>“Haha, it’s just a small matter. Even if I don’t tell you, you will know in the future. It’s up to you whether you want to join a faction or not. No one will say anything.”<br/><br/>Du Dalong smiled.<br/><br/>Wang Xian nodded his head.<br/><br/>Naturally, he had no interest in joining those factions. He came here to raise his combat strength to the level of a supremacy.<br/><br/>He didn’t care about other things.<br/><br/>After eating for an hour, Wang Xian had some understanding of the willow deity Daoist sect. After finishing his meal, the group flew towards the training hall.<br/><br/>“There are free training rooms here. Junior brother Wang Xian can choose any of them.”<br/><br/>Du dalong pointed at the houses that were surrounded by branches and said.<br/><br/>Wang Xian nodded his head. He found a remote room and walked in immediately.<br/><br/>“Eh?”<br/><br/>After entering the small room, Wang Xian realized that there was another world inside.<br/><br/>There was an underground room underneath the room. The area inside was about 5,000 square meters.<br/><br/>In the middle of the room was a cultivation mat. There was a resting place and a separate study room.<br/><br/>The room was empty and there was nothing inside.<br/><br/>In the future, this would be his cultivation room. Without his consent, no one could enter.<br/><br/>“Is junior brother Wang Xian around? We are here to pay a visit.”<br/><br/>At this moment, a voice came from outside.<br/><br/>“HMM?”<br/><br/>Wang Xian revealed a curious expression and immediately opened the door to take a look.<br/><br/>A woman walked in with a smile on her face.<br/><br/>“Junior brother Wang Xian, I hope I didn’t Disturb You!”<br/><br/>The woman entered with a smile on her face.<br/><br/>“No, May I know who this senior sister is?”<br/><br/>Wang Xian looked at her curiously.<br/><br/>“Junior brother Wang Xian, I’ll be Frank. I represent the Water Shadow Race and wish to invite you to join us.”<br/><br/>The primary race of the universe, the water shadow race.<br/><br/>The woman represented his race and invited Wang Xian to join them. She also promised him a large number of benefits and cultivation resources.<br/><br/>Wang Xian chatted with her for a while before he rejected her and sent her off.<br/><br/>The woman was not angry. She left him her contact information.<br/><br/>Following that, more forces came to invite him but were all rejected by Wang Xian.<br/><br/>After that, he had no choice but to hang a signboard at the entrance. He did not want to join any forces.<br/><br/>After hanging the signboard, he was indeed much more free.<br/><br/>After contacting Mi Xin Lu, she happily told him that she had built a room beside the small market outside. It was very quiet.<br/><br/>Wang Xian smiled and let her cultivate there.<br/><br/>Following that, he immediately took out the universal AI and checked the group chat that he had just joined.<br/><br/>There were quite a lot of information in the chat group for the disciples of the Willow Deity sect. All of them were written by the disciples of the Willow Deity sect.<br/><br/>Speaking of which, although the willow deity sect was divided into many groups with various races backing them, they were all very good-natured since they were able to join in the beginning.<br/><br/>At the very least, there wouldn’t be any people who had ulterior motives.<br/><br/>Inside were the cultivation experiences of the willow deity sect and some information about the Milky Way.<br/><br/>“Found it!”<br/><br/>After checking it, Wang Xian immediately narrowed his eyes and looked at the information on it.<br/><br/>Fishing techniques.<br/><br/>Wang Xian was very interested in fishing in the Milky Way, especially after hearing about it.<br/><br/>Opening the information, Wang Xian immediately started to investigate.<br/><br/>“No wonder there are so many people fishing.”<br/><br/>Looking at the basic information of fishing, Wang Xian mumbled.<br/><br/>The most attractive thing about fishing was that it was safe. The safety was very high.<br/><br/>In the vast Milky Way, there were countless aquatic creatures. There were also many universe knight level aquatic creatures.<br/><br/>Within the Milky Way, it was extremely dangerous.<br/><br/>This was the territory of the aquatic creatures.<br/><br/>If one were to rashly enter and hunt, one might become prey.<br/><br/>In particular, there were some powerful aquatic creatures that could merge with the seawater, and even God emperor great beings couldn’t sense it.<br/><br/>If one was ambushed in an instant, even God emperor level eight or nine could be killed instantly.<br/><br/>There were even universe knight level existences that died within the Milky Way.<br/><br/>One could imagine how dangerous it was inside.<br/><br/>However, fishing was tens of times safer. Fishing was to create a fishing rod that was integrated with one’s body. Using one’s own energy as a line and some treasures as bait, one could fish in the Milky Way.<br/><br/>The fishing area was very wide. Once the aquatic creatures at the bottom of the sea swallowed the bait, they could immediately capture it and fight with it from a distance.<br/><br/>Once the aquatic creatures below were too strong, they would cut off the bait and escape.<br/><br/>There wasn’t much risk. There was a chance to hunt the powerful aquatic creatures. They could also enhance their control of energy and battle experience.<br/><br/>This was the reason why there were so many anglers.<br/><br/>“This fishing is not bad. It’s very useful to me.”<br/><br/>Wang Xian mumbled.<br/><br/>He was currently at the third level of the celestial thearch. When he entered the willow deity Daoist sect, he only revealed the aura of a third level celestial thearch.<br/><br/>With his aura-concealing ability, no matter how powerful the detection divine weapon was, it would not be able to detect it. After all, he was at the third level of the celestial thearch.<br/><br/>As a third level celestial thearch, he could directly control all the aquatic creatures within a 100 million kilometer radius.<br/><br/>This range could be considered very wide. However, Wang Xian’s current attack could cover a radius of one billion kilometers.<br/><br/>Perhaps the speed at which he could personally hunt and kill the aquatic creatures in the Milky Way was not as fast as the speed at which he could fish.<br/><br/>It was still dangerous to enter the Milky Way, but the danger would be very, very low up there.<br/><br/>“I’ll build a fishing rod myself and try it out in the Milky Way. Whether I can increase it quickly will depend on the fishing speed. If it really doesn’t work, I’ll enter the Milky Way to hunt and kill them myself.”<br/><br/>Wang Xian’s eyes flickered as he made up his mind.\t\t\t\t\t\t</div>", "images": {}, "success": true}