{"id": 58, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15072017.html", "title": "Chapter 3049 - Chapter 3049: 3048 Celestial Palace War Pet", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 3049 - Chapter 3049: 3048 Celestial Palace War Pet</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 3049: 3048 Celestial Palace War Pet<br/><br/>“Phew, I’ve finally tamed all of them!”<br/><br/>At a spot on the surface of the Milky Way Sea, Wang Xian was standing on the five elements grinding mill. When he saw that the last desolate beast had been tamed, a smile appeared on his face.<br/><br/>Looking at the time, it was almost time for the scheduled date.<br/><br/>“Xin Lu, how’s the matter with the War Pet?”<br/><br/>Wang Xian asked Mo Xin Lu, who was playing with the universe AI, with a smile.<br/><br/>“Brother Wang, it’s done. As long as we confirm the location, we should be able to sell them all very soon.”<br/><br/>Mo Xinlu looked over and said with a smile.<br/><br/>“Alright, let’s go.”<br/><br/>Wang Xian nodded. With a wave of his arm, two ships of the iceberg race appeared on the surface of the sea. With a wave of his arm, he forcefully transformed the two ships into one and changed the appearance of the ships.<br/><br/>Although he destroyed some of the weapons on the ships, he did not mind.<br/><br/>The two ships that were more than 1,000 meters in size were transformed by him and became more than 10,000 meters in size.<br/><br/>With a wave of his arm, he wrote the words ‘Immortal Palace War Pet’on the side of the ship.<br/><br/>The reason why he did not use the name ‘Dragon Palace War Pet’was mainly due to the current situation of the ya long in the universe.<br/><br/>Buzz<br/><br/>Placing the five elements grinding mill under the ship, the entire ship was moving forward at a terrifying speed.<br/><br/>“Xin Lu, change your appearance a little later.”<br/><br/>Wang Xian looked at Mi Xin Lu and reminded her.<br/><br/>“Alright, Brother Wang. What do you think?”<br/><br/>His figure moved and the antlers appeared above his head. His face had also changed. He was dressed in white with the words “Immortal Palace”written on it.<br/><br/>“Sure!”<br/><br/>Wang Xian smiled and nodded his head.<br/><br/>In the future, he might have to sell a lot of war pets, so he had to create a sense of mystery. This was also to prevent some forces from scheming against him.<br/><br/>If he sold too many war pets in the future and attracted the attention of some primary races in the universe, it would be troublesome.<br/><br/>He had to make preparations in advance.<br/><br/>The ship moved quickly and did not encounter any special situations along the way.<br/><br/>After more than ten hours, they arrived at the Milky Way Sea in front of the Wangyin continent.<br/><br/>The Wangyin continent was the largest continent beside the Milky Way.<br/><br/>The entire continent was comparable to thousands of ordinary stars.<br/><br/>On the Milky Way Sea in front of the Wangyin continent, there were at least hundreds of thousands of ships of all kinds docked.<br/><br/>Some of the ships contained a heart-palpitating aura.<br/><br/>Wang Xian parked the ship on the surface of the sea in front and looked at the Mi Xin Lu.<br/><br/>“I’ll inform the customers.”<br/><br/>The Mi Xin Lu took out the universal AI and immediately sent out messages.<br/><br/>“Brother Wang, we can just wait here.”<br/><br/>She said to Wang Xian.<br/><br/>“Okay!”<br/><br/>Wang Xian nodded and looked forward with his yin-yang and five elements dragon eyes.<br/><br/>Mi Xin Lu came to the deck in front of him and stood there quietly.<br/><br/>Whoosh! Whoosh! Whoosh<br/><br/>Soon, in Wang Xian’s line of sight, figures flew over one by one.<br/><br/>Mi Xin Lu stood on the deck and saw someone flying over. Furthermore, the leader of the group seemed to have extraordinary strength. His eyes were filled with joy.<br/><br/>“This must be Miss Wang from the Celestial Palace’s War Pet!”<br/><br/>One figure after another flew over. When they saw the ship Mi Xin Lu was on, they were slightly surprised and asked.<br/><br/>“That’s right. Everyone, please wait for five minutes. Wait for the others to arrive.”<br/><br/>Mi Xin Lu looked at the time and said faintly.<br/><br/>“Miss Wang, do you really have an eighth level divine emperor battle pet here?”<br/><br/>An old man on the left could not help but ask.<br/><br/>The old man was dressed in black, and his face was a little hazy, making it hard to see him clearly. He was holding a black walking stick in his hand as he asked in a hoarse voice.<br/><br/>“This should be an expert from the misty race, right? Since we announced it on the Universe AI, we naturally aren’t fooling around. We won’t bring trouble on ourselves either. Wait for five minutes, and everyone will naturally see the battle pet.”<br/><br/>Mi Xin Lu replied indifferently.<br/><br/>She had the strength of a level five divine emperor and had been hunted down before. She was not afraid of the experts from the elementary races in the universe.<br/><br/>Moreover, she trusted Wang Xian.<br/><br/>“Oh? Many people are here?”<br/><br/>“Miss Wang, we have reserved your 10,000-ODD red winged fish war pets.”<br/><br/>Soon, more figures flew over.<br/><br/>There were humans, Demon Beasts, and some unique races in the universe.<br/><br/>The person who said that they had reserved the red winged fish war pets was a short elder who was only one meter tall.<br/><br/>The elder was very small, but he was holding a huge hammer that was at least two meters long.<br/><br/>Seeing the elder arrive, many people clearly had a trace of fear.<br/><br/>“There are two experts from the universe’s primary races. The Way This Immortal Palace sells war pets is really strange. They actually posted on the forum. If I didn’t see those pictures and videos, I wouldn’t believe it was true.”<br/><br/>“Indeed, a divine emperor level eight war pet. There aren’t many war pets of this level in the universe’s primary races.”<br/><br/>“The six-handed race does have a few powerful beast taming experts, but the war pets they tamed are rarely sold.”<br/><br/>“I’ve reserved a divine emperor level six war pet. The price is very affordable. Haha, My Luck is pretty good this time.”<br/><br/>More and more people came. They were slightly surprised when they saw that two experts from the universe’s primary races had also come.<br/><br/>They felt a little relieved about this transaction.<br/><br/>After all, it was the first time they had encountered such a precious battle pet being sold in such a casual manner.<br/><br/>“Alright, those who didn’t come will be considered to have given up the right to purchase. Everyone, follow me.”<br/><br/>Five minutes later, Mi Xin Lu said to the customers and led them to the back.<br/><br/>At the back, the ship had been specially modified. At this moment, there were many war pets lying on it.<br/><br/>All of them were celestial emperor level war pets.<br/><br/>Among them, there were three celestial emperor level eight war pets. Wang Xian ordered them to shrink their bodies and stay there obediently.<br/><br/>“Everyone, welcome to the Celestial Palace War Pets. According to the reservation in the universe’s AI, as long as you pay the divine stones, you can take the war pets away.”<br/><br/>“If you need help to tame them and take them away, you need to pay some divine stones. After all, the price of our war pets is lower than the market price.”<br/><br/>At this moment, Wang Xian walked out of the ship. At this moment, his appearance had some changes.<br/><br/>He had a pair of dragon horns on his head, and his palms were covered with dragon scales.<br/><br/>Even his face was covered with scales.<br/><br/>A powerful pressure was concealed within his body and was not released.<br/><br/>However, everyone could feel the power contained within his body.<br/><br/>The main reason why Wang Xian had such an image was to intimidate others.<br/><br/>It was to prevent some unscrupulous people.<br/><br/>Furthermore, the price that Wang Xian had set for his war pet this time was much lower than the market price.<br/><br/>The main reason was to reduce the time needed to help his customers tame their war pets.<br/><br/>There were many Beast Tamers in the center of the universe, especially those from powerful races. They would nurture some powerful beast tamers.<br/><br/>Wang Xian wanted them to look for these beast Tamers to help him tame them.<br/><br/>This would save him a lot of time.<br/><br/>“HMM?”<br/><br/>Everyone looked at Wang Xian who had suddenly appeared and felt a chill in their hearts.<br/><br/>When they saw the group of war pets, their eyes revealed a fiery expression.\t\t\t\t\t\t</div>", "images": {}, "success": true}