{"id": 55, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15072011.html", "title": "Chapter 3046 - Chapter 3046: School Of 3045 Fish", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 3046 - Chapter 3046: School Of 3045 Fish</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 3046: School of 3045 fish<br/><br/>“Continue!”<br/><br/>Wang Xian waved his arm and threw the fishing rod forward. The arowana on it swayed its body and swam towards its surroundings.<br/><br/>Ten days had passed. The desolate beasts in the Milky Way were extremely mobile.<br/><br/>Ten days ago, a radius of one billion kilometers had been fished. However, it had completely recovered now.<br/><br/>The five elements grinding mill had expanded to a radius of one hundred thousand meters. There were tamed war pets lying on top of it.<br/><br/>Wang Xian sat leisurely on a chair. Mi Xin Lu, who was beside him, held the universal AI and looked at Wang Xian from time to time. From time to time, she would look at the surrounding dire beasts. Her eyes were filled with joy.<br/><br/>Below, the arowana was flying rapidly in this area of the sea. The energy it contained attracted the surrounding aquatic creatures.<br/><br/>Very soon, all the aquatic creatures within a radius of one billion kilometers were attracted. They locked onto the arowana and chased after it.<br/><br/>“Eh? The harvest this time is not as good as the last time.”<br/><br/>Wang Xian sensed the desolate beasts below. There were more than two hundred celestial thearchs, more than the last time. However, the highest level this time was level seven celestial thearchs.<br/><br/>However, Wang Xian also knew that although the Milky Way was huge, if level eight and level nine celestial thearchs could be seen everywhere, no one would dare to step into the Milky Way.<br/><br/>Although the place he was at now was relatively deep, in fact, it was still extremely far away from the center of the Milky Way, a few dangerous places in the Milky Way, and the territories of some powerful desolate beast races in the Milky Way.<br/><br/>As for how far it was, he might have to fly for a few years.<br/><br/>The place he was at now belonged to a corner of the Milky Way.<br/><br/>Splash<br/><br/>Wang Xian controlled the arowana to fly upwards. With a move of his arm, chains formed a huge fishing net that covered the sky.<br/><br/>“Again? It’s so fast. Others are only fishing for a single dire beast in the water. Brother Wang, you managed to catch tens of thousands of them in one go.”<br/><br/>When Mi Xin Lu saw this scene, she revealed an excited expression. She looked down excitedly.<br/><br/>In fact, Wang Xian’s fishing was vastly different from the others.<br/><br/>“Boom Boom Boom!”<br/><br/>“Roar Roar Roar!”<br/><br/>The chains covered all the dire beasts at a terrifying speed. The chains contracted.<br/><br/>“Bang, Bang, Bang!”<br/><br/>All the desolate beasts in the water were thrown onto the five elements millstone.<br/><br/>The chains and the five elements millstone were emitting energy, preventing them from escaping back to their nests in an instant.<br/><br/>“Wow, there are so many of them again!”<br/><br/>Mi Xin Lu cheered, “Brother Wang, our capturing speed is too fast!”<br/><br/>“Hehe, it’s not bad!”<br/><br/>Wang Xian smiled and devoured all the beasts below the celestial emperor level. The rest were immediately tamed.<br/><br/>This time, the taming only took seven days. After seven days, Wang Xian continued fishing.<br/><br/>The speed of each fishing was very fast. In less than twenty minutes, he could capture one to two hundred celestial emperor level aquatic desolate beasts.<br/><br/>There were beasts from the first to the eighth level of celestial emperor level.<br/><br/>A month passed very quickly. The number of celestial emperor desolate beasts that Wang Xian caught had reached more than a thousand.<br/><br/>Among them, there were three celestial emperor level eight desolate beasts.<br/><br/>It was not much, but it was definitely not little.<br/><br/>If others were to know about such a harvest, they would definitely be shocked.<br/><br/>Especially since Wang Xian had tamed all these aquatic desolate beasts.<br/><br/>However, selling all these tamed desolate beasts would not be able to increase his strength.<br/><br/>There was even a huge gap between them.<br/><br/>“It’s still a little too little. Furthermore, I haven’t encountered a level nine celestial thearch desolate beast in a month.”<br/><br/>Wang Xian stood on the five elements millstone and said with a slight frown.<br/><br/>Without obtaining a level nine celestial thearch desolate beast, his improvement would be far away.<br/><br/>Only by obtaining a few level nine celestial thearch desolate beasts for sale would he be able to achieve a breakthrough in his strength.<br/><br/>“Let’s go. Let’s go to the right.”<br/><br/>Wang Xian decided to change his position and controlled the five elements millstone to fly to the right.<br/><br/>Mi Xin Lu touched a soft war pet and followed by the side with a smile on her face.<br/><br/>The Five Elements Millstone was traveling at a fast speed. Wang Xian stood in front and looked at the waves in front of him.<br/><br/>“Eh?”<br/><br/>However, after the five elements Millstone flew for an hour, Wang Xian suddenly looked ahead. His eyes were sparkling.<br/><br/>“Ah, brother Wang, look ahead. What is that?”<br/><br/>Beside him, Mi Xin Lu also noticed the commotion ahead. She widened her eyes and revealed a surprised expression.<br/><br/>“Our luck is really good.”<br/><br/>Wang Xian looked ahead and revealed a smile.<br/><br/>On the surface of the sea ahead, a school of fish was rushing towards them.<br/><br/>It was a type of fish-type dire beast with wings and a sharp head.<br/><br/>There were more than ten thousand of these fish-type dire beasts. Most importantly, these fish-type dire beasts were all at the first level of celestial thearch.<br/><br/>More than ten thousand fish at the first level of celestial thearch. This was not a low price.<br/><br/>This was like money flying towards him.<br/><br/>Wang Xian narrowed his eyes slightly.<br/><br/>The school of fish also noticed Wang Xian and the rest in front of them. They moved their bodies and dived into the water below.<br/><br/>Boom<br/><br/>Wang Xian’s aura trembled as a terrifying dragon’s might enveloped them.<br/><br/>This was the absolute rule of the divine dragon and covered the entire group.<br/><br/>Buzz Buzz<br/><br/>All the fish and dire beasts in the entire group of fish trembled and continued to fly towards Wang Xian.<br/><br/>Whoosh! Whoosh! Whoosh<br/><br/>At this moment, at the rear, two ships were flying towards them at a terrifying speed.<br/><br/>There was only the sound of the wind, nothing else.<br/><br/>The two ships weren’t very big, each one was about a kilometer long.<br/><br/>At this moment, on the deck of the ships, there were many middle-aged youths.<br/><br/>“Not good, there’s someone ahead.”<br/><br/>The people on the two ships saw a figure suddenly appear in front of them, and their expressions changed slightly.<br/><br/>They had been following this school of fish for half an hour, and were preparing to capture it.<br/><br/>They didn’t expect that there would be someone in front of them, which caused their expressions to change slightly.<br/><br/>“Oh? Look, the figure on top is using a strange method to capture all of the school of Fish!”<br/><br/>“What ability is that? Charm? Formation? Why didn’t the School of fish escape? Why didn’t they resist at all?”<br/><br/>On the ship, everyone’s expressions changed slightly.<br/><br/>“Let’s go, Let’s Go!”<br/><br/>The few middle-aged men in the lead didn’t hesitate and immediately gave the order.<br/><br/>Whoosh! Whoosh! Whoosh<br/><br/>The two ships suddenly sped up.<br/><br/>“Eh? They’re here? Have they locked onto this school of fish long ago?”<br/><br/>Wang Xian had already noticed the two ships when the five elements were grinding.<br/><br/>When he saw the arrival of the ships, a vigilant look appeared on his face.<br/><br/>Mi Xinlu was also staring at the two ships warily.<br/><br/>“That is?”<br/><br/>However, when the two ships approached, Wang Xian saw a few familiar figures.<br/><br/>“That is? The New One?”<br/><br/>On the two ships, a few middle-aged men recognized Wang Xian when they saw him on the five elements Millstone.<br/><br/>“Junior brother Wang Xian, what a coincidence!”<br/><br/>The ship stopped in front of Wang Xian and the rest.<br/><br/>A middle-aged man on the ship looked at Wang Xian and greeted him.<br/><br/>“Yes, what a coincidence. are all of you here to fish as well?”<br/><br/>Wang Xian looked at them and asked faintly.\t\t\t\t\t\t</div>", "images": {}, "success": true}