{"id": 60, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15072021.html", "title": "Chapter 3051 - Chapter 3051: 3050 Was Unbridled", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 3051 - Chapter 3051: 3050 Was Unbridled</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 3051: 3050 was unbridled<br/><br/>“It’s that Wang Xian!”<br/><br/>When Wang Xian entered the library, there were more than 20 people in the library. When they sensed his arrival, some of them turned their heads and whispered.<br/><br/>Everyone was displeased with the fact that Wang Xian had killed a disciple of the willow deity Daoist sect.<br/><br/>Wang Xian took a glance at the library and ignored them. He looked through the books one by one.<br/><br/>This time, he wanted to find some information about the aquatic creatures in the Milky Way.<br/><br/>It would be best if he could find a place where there were level nine celestial thearch or a large number of level seven or eight celestial thearch aquatic creatures.<br/><br/>Based on his fishing speed in the past two months, it was estimated that he would need five or six times to increase his strength.<br/><br/>Milky Way ice-sealed mountain.<br/><br/>Milky Way Black region.<br/><br/>Isolated Island in the Milky Way Sea.<br/><br/>Milky Way volcano region.<br/><br/>…<br/><br/>The information in the library was very rich. Soon, Wang Xian received information one by one.<br/><br/>There was a lot of information that the universe ai couldn’t get.<br/><br/>The information that could be obtained from the universe AI was the most basic information.<br/><br/>There wasn’t much information like the Milky Way Icebound Mountain on the universe AI.<br/><br/>Here, there was a very detailed introduction about the Milky Way’s icebound mountain, including the dire beasts that lived in it and the strength of the dire beasts.<br/><br/>In the Icebound Mountain, there was a huge race of dire beasts, the icebound bear.<br/><br/>The Icebound Bear’s strength ranged from a level five divine emperor to a peak divine emperor.<br/><br/>And in the Milky Way’s black region, there were also many powerful aquatic dire beasts.<br/><br/>All sorts of detailed descriptions made Wang Xian squint his eyes slightly.<br/><br/>However, after reading a few documents consecutively, he was a little hesitant.<br/><br/>Regardless of whether it was the ice-sealed mountain or the black domain, there were dire beasts at the peak of the Divine Emperor Realm.<br/><br/>The peak of the divine emperor realm could already threaten Wang Xian.<br/><br/>Most importantly, if Wang Xian were to kill a level nine divine emperor dire beast, it might cause a huge commotion.<br/><br/>At that time, there would be danger.<br/><br/>Isolated Island on the sea, volcanic region…<br/><br/>Wang Xian looked at the other two documents and frowned slightly.<br/><br/>“Without the strength of a peak divine emperor, it would be very dangerous to go to these places.”<br/><br/>Wang Xian mumbled.<br/><br/>The stronger the dire beasts in the water, the more territorial they would be. They would gather a group of subordinates.<br/><br/>It was rare for them to act alone.<br/><br/>“It’s a little difficult.”<br/><br/>Wang Xian shook his head.<br/><br/>“Junior brother Wang Xian, can we talk?”<br/><br/>Just as he was going through the information one by one, a voice sounded beside him.<br/><br/>“HMM?”<br/><br/>Wang Xian turned his head and looked to the side.<br/><br/>An old man was standing beside him. He was familiar with the old man. It was senior brother Junzi, who was treating him on his first day here.<br/><br/>“Senior brother Junzi, may I know what’s the matter?”<br/><br/>Wang Xian had a good impression of senior brother Junzi. He smiled and nodded his head.<br/><br/>The two of them walked to a seat at the side and sat down.<br/><br/>“Junior brother Wang Xian must have gone through the trials of the venerable willow deity to be able to enter the willow deity Daoist sect. There’s nothing wrong with his temperament. It’s just that…”<br/><br/>“Among fellow disciples, it’s better for junior brother Wang Xian not to kill each other.”<br/><br/>Senior Brother Junzi said earnestly.<br/><br/>“I know. No one dares to provoke me, and I Won’t lay my hands on others either. This is my principle.”<br/><br/>Wang Xian said with a smile.<br/><br/>“But between fellow disciples, it’s best not to fight over some trivial matters.”<br/><br/>Senior Brother Junzi said with a smile.<br/><br/>“Senior brother Junzi, I don’t agree with this. When others bully me and snatch my things, I naturally have to retaliate. If I can kill them, I’ll kill them.”<br/><br/>“When two races fight and billions of people are involved, are both races bad people? There are no bad people, no right or wrong. A war is a war. Do We have to spare the lives of our opponents?”<br/><br/>Wang Xian said faintly.<br/><br/>“If you have to spare others, spare them.”<br/><br/>Senior Junzi paused and shook his head.<br/><br/>“Senior Junzi is right. If you have to spare others, spare them. If the other party doesn’t have the intention to kill me, I will not kill them all mercilessly.”<br/><br/>Wang Xian nodded his head. “I was able to enter the willow deity Daoist sect and pass the test of venerable willow deity. I can also prove that I didn’t do anything wrong.”<br/><br/>“Senior Junzi, I still have some matters to attend to. If Senior Junzi has anything that you need help with, I will not decline.”<br/><br/>After saying that, he stood up and spoke politely to Senior Junzi. After that, he turned around and left.<br/><br/>Looking at Wang Xian’s figure, senior brother Junzi shook his head. A look of deep thought appeared on his face.<br/><br/>“Senior brother Junzi, what did Wang Xian say?”<br/><br/>Seeing Wang Xian leave, a few middle-aged men walked over from the library and asked curiously.<br/><br/>“This is his way of doing things.”<br/><br/>Senior Brother Junzi shook his head and said with slight disapproval.<br/><br/>“Way of doing things?”<br/><br/>The middle-aged men frowned.<br/><br/>“This senior brother Junzi is a good person. He is a little too good-natured.”<br/><br/>Wang Xian walked out of the library and thought to himself.<br/><br/>However, it would be very comfortable to get along with such a person. There was no need to worry about being schemed against.<br/><br/>This was also the reason why senior brother Junzi had a relatively high prestige in the willow deity Daoist sect.<br/><br/>“Let’s continue fishing.”<br/><br/>Wang Xian did not receive any useful information in the library. He immediately flew out.<br/><br/>He could only continue fishing aimlessly in the Milky Way.<br/><br/>Although the speed of his improvement was much slower, the resources he obtained in a year’s time was enough for him to improve his strength.<br/><br/>“That Wang Xian has left. He brought a woman and flew into the Milky Way.”<br/><br/>“Inform senior brother Bing Ling and Hong Tu immediately.”<br/><br/>Just as Wang Xian was flying into the Milky Way, two young men and a middle-aged man at a spot in the willow deity Daoist sect looked at Wang Xian and sent him a voice transmission in a low voice.<br/><br/>“Should we follow him?”<br/><br/>A young man took out the universal AI and sent the message out.<br/><br/>“This Wang Xian is very strong. We are not his match. If we follow him, we will be discovered by him. It is not worth the risk.”<br/><br/>The middle-aged man in the middle shook his head slightly. He looked at the figure that was leaving quickly and showed some hesitation.<br/><br/>“Let’s go and see which direction he is heading in. We just need to tell senior brother Bingling, Hong Tu, and the rest the direction. When the time comes, the ice mountain race will take action to eliminate this arrogant fellow.”<br/><br/>“HMPH, how can fellow disciples be so cruel? This kind of scourge should be eliminated as soon as possible.”<br/><br/>The three of them spoke with cold faces as they chased after Wang Xian’s figure.<br/><br/>They knew that Wang Xian’s strength was not as simple as they had imagined. Therefore, they did not plan to follow him all the way. It was sufficient as long as they could determine his direction.<br/><br/>The rest would be left to the people of Bing Ling and Hong Tu’s race to handle.<br/><br/>“HMM? where is he? How did he disappear so quickly?”<br/><br/>When the three of them had just flown out of the willow deity Daoist sect, they discovered that the figure in front of them had already disappeared. They frowned slightly.<br/><br/>“This guy’s speed is too fast, right? What exactly is his strength?”<br/><br/>The middle-aged man in the middle said with a frown.<br/><br/>“Guys, are you following me?”<br/><br/>However, at this moment, a voice sounded behind them, causing the three of them to freeze slightly!\t\t\t\t\t\t</div>", "images": {}, "success": true}