{"id": 69, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15072039.html", "title": "Chapter 3060 - Chapter 3060: 3059 Ambushed And Broke Through", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 3060 - Chapter 3060: 3059 Ambushed And Broke Through</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 3060: 3059 ambushed and broke through<br/><br/>“You have the aura of the girl next to him, so you can naturally lock on to her. This is just a small path. She will come to our side in a minute.”<br/><br/>On the Milky Way, the old man who was known as the acting wizard said indifferently, not taking their compliments to heart.<br/><br/>“If we didn’t calculate the acting wizard’s reminder, we wouldn’t have thought that the young man should have an item to shield his aura.”<br/><br/>Master Yu said with a smile.<br/><br/>“It’s all thanks to the acting wizard this time.”<br/><br/>“Let’s make some preparations. This time, we must take his head. If he dares to kill someone from our ice mountain race, we must make him pay with his life.”<br/><br/>The third protector of the greatsword said with a gloomy expression.<br/><br/>“Don’t worry. Even if he’s a peak divine emperor expert, we can still kill him in one strike.”<br/><br/>A few elders beside him replied confidently.<br/><br/>This time, their ice mountain race had dispatched four peak divine emperor experts. In addition, they had also used their clan’s most powerful treasures.<br/><br/>“We still have to be careful. It’s best not to let him have any reaction. That fellow might still have fallen leaves on his way back.”<br/><br/>The third protector of the GREATSWORD reminded.<br/><br/>The others nodded.<br/><br/>“Fallen leaves on their way back? It’s venerable willow deity’s item. Even if I set up a formation, it wouldn’t be able to seal it. Unless I can instantly kill him and prevent him from having any chance to react.”<br/><br/>The psychic raised his eyebrows and said.<br/><br/>The few people from the ice mountain race nodded their heads.<br/><br/>Soon, the few of them hid in the ocean below.<br/><br/>At the front, Wang Xian was in a good mood as he brought along the Mi Xin deer and flew towards the direction of the Willow deity Daoist sect.<br/><br/>His speed was very fast. Although he did not use it to its maximum, it was still comparable to the flying speed of an ordinary expert at the peak of the Divine Emperor Realm.<br/><br/>Buzz<br/><br/>However, when he was speeding on the surface of the sea, he was suddenly in a daze.<br/><br/>Following that, a terrifying sense of danger enveloped his heart.<br/><br/>“Not good, there’s an ambush!”<br/><br/>He was alarmed.<br/><br/>Suddenly, a wave of life force spread from the location of his heart, causing him to instantly become clear-headed.<br/><br/>As he felt the threat of death, cold sweat broke out on his forehead.<br/><br/>A willow leaf appeared in his hand automatically. Wang Xian looked to the side and quickly kept the Mi Xin deer into the mother nest.<br/><br/>Boom! Boom! Boom<br/><br/>The next moment, an extremely terrifying attack landed in front of him. The willow leaf emitted a ray of light that enveloped it.<br/><br/>When the attack landed on the fallen leaves on their way back, Wang Xian actually saw that there were cracks on the fallen leaves on their way back.<br/><br/>However, the fatal attack was blocked. His figure disappeared.<br/><br/>“Damn it, how can his reaction be so fast!”<br/><br/>At the lower position, the four experts of the ice mountain race, the acting wizards, and the rest flew up. When they saw Wang Xian disappearing, their expressions were abnormally ugly.<br/><br/>“I’ve set up a huge array here to shock the mind. Even a powerhouse at the peak of the Celestial Emperor Realm would be in a trance for a moment. I didn’t expect him to be clear-headed in an instant.”<br/><br/>The diviner frowned slightly and said with a surprised expression.<br/><br/>“Did that guy keep the fallen leaf in his hand the entire time? He actually activated it in an instant.”<br/><br/>“He actually failed.”<br/><br/>The four powerhouses at the peak of the Celestial Emperor Realm from the Ice Mountain race looked a little unhappy.<br/><br/>“He should not have any fallen leaves to return to. I think he will be able to kill him the next time.”<br/><br/>The third protector of the giant sword said with a gloomy face.<br/><br/>The fallen leaves had saved that guy’s life twice.<br/><br/>“I’m afraid that he has been hiding in the Divine Willow Daoist sect and won’t come out. This time, he has suffered a loss. He might take revenge on our ice mountain race.”<br/><br/>“If he enters the domain of our ice mountain race again, then…”<br/><br/>The expression of an elite of the ice mountain race changed.<br/><br/>Not only did that guy have a tough life, he also had strange methods. Their people were monitoring the willow deity Daoist sect, but that guy could still leave without anyone knowing.<br/><br/>“Just now, I intercepted his aura. The willow deity Daoist sect can block my heaven acting mirror, but as long as he comes out, I can lock onto him.”<br/><br/>At this moment, the acting wizard at the side said lightly.<br/><br/>“Oh? Acting Wizard, you have a backup plan?”<br/><br/>The four elite warriors of the ice mountain race looked delighted and immediately asked.<br/><br/>“When you said that he had fallen leaves on his way back, I made preparations. Don’t worry, as long as he comes out of the Divine Willow Daoist sect, the heaven acting mirror will be able to lock onto him. Unless, the treasure he used to conceal his aura is much more powerful than my heaven acting mirror.”<br/><br/>“But just now, I didn’t sense such a treasure on him.”<br/><br/>The acting wizard said confidently.<br/><br/>“That would be great. With you around, I don’t believe that kid still has fallen leaves on his way back.”<br/><br/>When the four members of the ice mountain race heard his words, their expressions eased up a little.<br/><br/>Although they had let him escape this time, it had also cost him a fallen leaf on his way back.<br/><br/>They really didn’t believe that the other party still had a fallen leaf on his way back.<br/><br/>As long as he reappeared, it would be the time for him to die.<br/><br/>The eyes of the four of them flashed with a vicious glint.<br/><br/>…<br/><br/>“Damn it, I almost died just now.”<br/><br/>At this moment, Wang Xian’s expression was a little awkward in the Divine Willow Daoist sect.<br/><br/>Just now, he felt that his mind was muddled and accompanied by a fatal attack. With his reaction speed, this was a sure-death situation.<br/><br/>He couldn’t react in time at all.<br/><br/>However, at the location of his heart, the ancestral tree trembled slightly, causing him to regain his consciousness.<br/><br/>Furthermore, the ancestral tree controlled the fallen leaves to fly out of the mother nest and activated it automatically.<br/><br/>If not for the ancestral tree, Wang Xian wouldn’t have survived the terrifying ambush and assassination.<br/><br/>“They must be from the ice mountain race. They are the only enemies I have here. I didn’t expect… I didn’t expect that I would almost fall into their hands.”<br/><br/>Wang Xian mumbled as his eyes revealed a ferocious look.<br/><br/>He was really close this time.<br/><br/>“It’s all thanks to the ancestral tree. It seems that the ancestral tree has gradually gained sentience and is able to protect its master.”<br/><br/>He mumbled as he placed the Mi Xin deer at the periphery and walked into his house.<br/><br/>The Mi Xin deer was curious and wanted to ask something. However, when it saw Wang Xian’s expression, it didn’t ask any further.<br/><br/>“I’ll first increase my strength. After that, I’ll destroy the Ice Mountain Race.”<br/><br/>When he returned to his room, Wang Xian’s eyes sparkled and his heart was filled with killing intent.<br/><br/>The last time he attacked, not only did he not cause his opponent to be afraid, he even made it worse.<br/><br/>At that instant, at least four to five powerhouses at the peak of the Celestial Emperor Realm attacked.<br/><br/>Since that was the case, there could only be one ice mountain race and himself.<br/><br/>Wang Xian narrowed his eyes slightly and took out all the medicinal pills he had bought. He poured them into his mouth one by one.<br/><br/>The medicinal pills turned into dragon qi and were improving rapidly.<br/><br/>“Ding! Congratulations to host for reaching the fourth level of the celestial thearch level!”<br/><br/>“Ding! Congratulations to host for comprehending the laws and Abhijna: eight luminaries dragon scale.”<br/><br/>When 90% of the elixir was consumed, the system’s voice rang out.<br/><br/>Level Up!<br/><br/>Rays of light emitted from his body, and dragon scales appeared on the surface of his skin.<br/><br/>The dragon scales flickered with eight rays of light and looked extremely mystical.<br/><br/>The Phantom of the divine dragon circled around him.<br/><br/>A powerful aura was emitted from his body.<br/><br/>Wang Xian opened his eyes and revealed a smile.<br/><br/>He had finally broken through. He was still one step away from becoming a universe knight.\t\t\t\t\t\t</div>", "images": {}, "success": true}