{"id": 66, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15072033.html", "title": "Chapter 3057 - Chapter 3057: 3056 Who Will Kill Who 3", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 3057 - Chapter 3057: 3056 Who Will Kill Who 3</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 3057: 3056 who will kill who 3<br/><br/>“Rumble!”<br/><br/>Within the ice mountain race, the towering icebergs symbolized the power of the ice mountain race.<br/><br/>However, on this night, a towering iceberg suddenly collapsed.<br/><br/>Everyone on the icebergs suffered a devastating blow.<br/><br/>“What’s going on?”<br/><br/>“Not good, someone attacked the frozen legion.”<br/><br/>“Damn it, someone has attacked us, alert the whole clan!”<br/><br/>In the sky, more than ten top experts of the ice mountain race were flying towards the frozen continent. When they saw the sudden collapse of the icebergs, their expressions changed drastically.<br/><br/>Something had happened to the ice soldiers, and now the icebergs on the Frozen Legion’s side had also collapsed. There was definitely a powerful opponent attacking them.<br/><br/>“Alert the entire clan, alert the entire clan!”<br/><br/>The clan leader of the icebergs roared with a cold expression. His voice spread to more than ten towering icebergs in the surroundings.<br/><br/>“What happened?”<br/><br/>The entire icebergs were in an uproar. Everyone looked around in shock.<br/><br/>“Boom!”<br/><br/>“Clan leader, Protector, our icebergs have been attacked. The attack came from within. A large number of our experts and disciples have been killed.”<br/><br/>At this moment, a few figures flew out from within the collapsed towering ice mountain and roared with an embarrassed expression.<br/><br/>“Damn it!”<br/><br/>When the peak experts of the ice mountain race heard this, they roared with an abnormally embarrassed expression.<br/><br/>The Frozen Legion had many elite disciples and now, a large portion of them had been killed.<br/><br/>“How could they enter the Ice Mountain where our Frozen Legion is located? If they aren’t disciples of our ice mountain race, how could they enter?”<br/><br/>An expert with an extremely ugly expression growled in a low voice.<br/><br/>It was not so easy to break into their nest and their headquarters.<br/><br/>If they forced their way in, even a peak divine emperor expert would not be able to enter.<br/><br/>“How many disciples of the Frozen Legion have died?”<br/><br/>The Ice Mountain Race’s clan leader asked with a face that looked like it was dripping blood.<br/><br/>“Clan leader, at least 200,000 have died. All of them are elites of our Ice Mountain Legion.”<br/><br/>The commanders of the icebergs army said with a gloomy face.<br/><br/>“Investigate, investigate for me. Find out who did it. I want him dead.”<br/><br/>The clan leader of the icebergs race roared furiously with a face full of fury.<br/><br/>A large number of disciples of the icebergs army had been killed. The core experts of the icebergs army had been killed.<br/><br/>The losses of their icebergs race this time were too great.<br/><br/>“Hehe!”<br/><br/>At the same time, in Wang Xian’s room of the willow deity Daoist sect, he had gotten an lie to bring him over after he returned to the Dragon Palace.<br/><br/>This time, his attack was very smooth. More than 10,000 celestial thearch-level powerhouses had died at his hands.<br/><br/>This was especially so for the two celestial thearch-level ninth-level powerhouses and the core secret army of the Ice Mountain race.<br/><br/>Even the ice mountain race could not bear such a loss.<br/><br/>Wang Xian took out the universal AI and opened the group chat of the Willow deity Daoist sect.<br/><br/>Ever since he joined this chat group, he had not spoken in it.<br/><br/>Instead, he heard the few guys from the ice mountain race saying that they wanted to take revenge and wanted him to wait.<br/><br/>“First, I’ll kill tens of thousands of celestial emperors and hundreds of thousands of soldiers from your ice mountain race. If your ice mountain race wants to play, I’ll accompany you.”<br/><br/>Wang Xian directly posted a message. Then, he specially messaged Bing Ling Hong Tu and another person called Yan Long Yan.<br/><br/>They were all disciples of the Ice Mountain race.<br/><br/>“Oh?”<br/><br/>“What’s the situation?”<br/><br/>“Tens of thousands of celestial emperors and hundreds of thousands of soldiers?”<br/><br/>In the group chat of the Willow deity Daoist sect, Wang Xian suddenly sent out this message, causing everyone in the group chat to be slightly shocked.<br/><br/>He specially sent out a message to Bing Ling Hong Tu and the other two. Was this a declaration of war? Or?<br/><br/>And was what Wang Xian said true?<br/><br/>At this moment, Bing Ling Hong Tu and the others who were located in the willow deity Daoist sect were currently conversing with the people in the clan.<br/><br/>Both of their expressions were extremely unsightly.<br/><br/>Because just now, they had received the news that their clan had been attacked. This time, their ice mountain clan had suffered a great loss.<br/><br/>A secret army had been destroyed, and the ice seal army had also suffered a great loss.<br/><br/>“HM?”<br/><br/>At this moment, when they saw the message from the group chat of the Divine Willow Daoist sect, they were slightly stunned and immediately opened it.<br/><br/>When they saw the content, their faces changed and their eyes turned red.<br/><br/>It was him! It was actually him!<br/><br/>“Wang Xian, it’s you. It was you who assassinated the powerhouse of Our Ice Mountain Race? It was you who attacked Our Ice Mountain Race?”<br/><br/>Bing Ling Hong Tu’s expression changed drastically as he asked directly in the exchange group.<br/><br/>What?<br/><br/>The Ice Mountain race had really been attacked by Wang Xian!<br/><br/>Hiss!<br/><br/>At this moment, the other disciples of the Willow deity Daoist sect who were paying attention to the group chat were also shocked when they saw Bing Ling Hong Tu’s question.<br/><br/>Some people immediately searched around and found information about an ice mountain race where a towering mountain peak had collapsed.<br/><br/>This…<br/><br/>That newcomer, that Wang Xian, had actually infiltrated the ice mountain race and even killed so many experts.<br/><br/>One person against a domain-level race?<br/><br/>“This Wang Xian is really crazy. A while ago, Bing Ling Hong Tu and the rest said that their ice mountain race had already sent experts to hunt Wang Xian. In the end, you, Wang Xian, have killed so many experts of the ice mountain race.”<br/><br/>“Moreover, from the looks of it, the ice mountain race has suffered great losses.”<br/><br/>Some of the disciples of the Willow Deity sect muttered.<br/><br/>“An lie, bring me out.”<br/><br/>Wang Xian did not bother with them after sending a message in the willow deity sect’s communication group. He immediately got an lie to bring him out of here.<br/><br/>Soon, he appeared on the surface of a sea in the Milky Way.<br/><br/>“Continue to capture the dire beasts. We can’t let the Ice Mountain tribe delay any longer. If they dare to pursue us, we will make them pay an even greater price.”<br/><br/>Wang Xian mumbled to himself and ordered an lie to return. He stood on the Five Elements Millstone and released the Mi Xin deer from its mother nest. Then, he quickly headed deeper into the forest.<br/><br/>This time, the hunt for the experts from the ice mountain race had increased the resources of the Dragon Palace. It would be able to improve the Dragon Palace by a lot.<br/><br/>It was not a waste of time.<br/><br/>“Brother Wang, are those guys from the ice mountain race chasing us?”<br/><br/>Mi Xin Lu, who was standing on the five elements millstone, looked around and asked him.<br/><br/>“I’m not sure. Let’s ignore them for now. A domain-level race is not a threat.”<br/><br/>Wang Xian smiled and said, “Let’s continue fishing.”<br/><br/>“Okay!”<br/><br/>Mi Xin Lu was relieved after hearing Wang Xian’s words. He sat at the side with a smile.<br/><br/>As the five elements Millstone moved forward, Wang Xian started his fishing as well. He quickly caught the dire beasts one by one.<br/><br/>At the same time, a group of experts from the Ice Mountain clan stood in a large hall. They were looking at a piece of news with gloomy expressions.<br/><br/>“It was actually that fellow from the willow deity Daoist sect. It was actually him.”<br/><br/>“The willow deity Daoist sect has been locked down by us. We didn’t see him coming out from there. What’s going on…”<br/><br/>Two experts growled with gloomy expressions.<br/><br/>Among them, the ice mountain race protector who held a giant sword had a murderous look on his face. “It’s really possible that it was that guy who made the move. That guy has the strength of a ninth level divine emperor, and his speed is comparable to a peak divine emperor. He has the strength to kill a ninth level divine emperor.”<br/><br/>“With the traces of this attack, 90% of it was done by him!”\t\t\t\t\t\t</div>", "images": {}, "success": true}