{"id": 64, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15072029.html", "title": "Chapter 3055 - Chapter 3055: 3054 Who Will Kill Who 1", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 3055 - Chapter 3055: 3054 Who Will Kill Who 1</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 3055: 3054 who will kill who 1<br/><br/>An arrogant and sinister voice rang in Wang Xian’s ears.<br/><br/>Wang Xian looked to the side. The two middle-aged men from the ice mountain race stared at him with cold faces. The killing intent in their eyes was not concealed at all.<br/><br/>Looking at them, Wang Xian narrowed his eyes slightly. He did not pay too much attention to them and walked straight to his house.<br/><br/>“Let’s see where else he can escape to. Haha!”<br/><br/>“There are experts from our ice mountain race outside watching this place. As long as he goes out, we will be able to kill him.”<br/><br/>Bing Ling, Hong Tu, and the rest looked at Wang Xian’s figure with excitement and malevolence in their eyes.<br/><br/>The experts from their race had already made their move. Killing Wang Xian was a piece of cake.<br/><br/>When a powerful race started to move, one would feel how terrifying they were.<br/><br/>“These races can not be underestimated.”<br/><br/>Wang Xian returned to his house and frowned slightly. His eyes were filled with killing intent.<br/><br/>That guy from the iceberg race had attacked him first in order to obtain the batch of red winged fish. He had even released the imprisonment ring. It was obvious that he wanted to kill him.<br/><br/>Faced with such a situation, Wang Xian naturally had to retaliate.<br/><br/>Now that he was locked onto by the ice mountain race, everything that happened next would be extremely troublesome.<br/><br/>It would greatly affect his hunting of dire beasts.<br/><br/>Furthermore, there must be someone monitoring the surroundings of the willow deity Daoist sect. Once he went out, he would definitely be in danger.<br/><br/>“Now, I must first conceal my aura so that the Wizards can not lock onto me. Secondly, I must get out from here.”<br/><br/>Wang Xian mumbled. He took out the universal AI and contacted the Heaven Array to ask about the situation.<br/><br/>“Oh?”<br/><br/>Soon, a message came from the Heaven Array. When he saw the message, he raised his eyebrows slightly.<br/><br/>While he was away, the Dragon Palace had also gathered resources and upgraded the Heaven Array to the ninth level of the divine emperor realm.<br/><br/>Now, he did not have the method to completely seal off the Wizards’Aura and lock onto them.<br/><br/>“Looks like I have to get an lie to make a trip here.”<br/><br/>Wang Xian mumbled to himself. He instructed some things through the universal AI and immediately set up an altar in the middle of his house.<br/><br/>Buzz<br/><br/>Soon, Tian an lie’s figure came out from the altar.<br/><br/>“Dragon King, what is this place?”<br/><br/>An lie looked around curiously and asked.<br/><br/>“It’s a training ground. You must have brought the items from the sky array.”<br/><br/>Wang Xian said.<br/><br/>“Dragon King, these are the items that the sky array asked me to give you.”<br/><br/>An lie immediately took out the flags and placed them on his body to hide his aura.<br/><br/>With the flags, it would be difficult for a rank 9 divine Emperor Magus to lock onto him. Even a peak divine emperor Magus would need to spend a lot of time to lock onto his aura.<br/><br/>“An lie, this is the star map of this starry sky. Go here now and send me here. I’ll send you the information.”<br/><br/>Wang Xian opened the universe AI and marked a location. He then said to an lie.<br/><br/>“It’s the Dragon King. Leave it to me.”<br/><br/>An lie nodded. He opened his universe AI and disappeared instantly.<br/><br/>“Since you want to kill me, don’t blame me.”<br/><br/>Wang Xian’s eyes were flashing with a cold killing intent.<br/><br/>An lie had disappeared. Even a universe knight would find it hard to understand how strange he was.<br/><br/>Time passed by slowly. An hour later, his figure appeared in front of Wang Xian.<br/><br/>“Dragon King, let’s go.”<br/><br/>The Heaven Array signaled. Wang Xian nodded and planted the flag. The next moment, they arrived at an extremely cold location.<br/><br/>At the edge of the Milky Way, at the corner of the Milky Way, there were numerous gigantic icebergs.<br/><br/>There was also an ice-sealed continent.<br/><br/>The continent was suspended above the Milky Way.<br/><br/>The entire continent was silvery-white in color. There were many humans on it.<br/><br/>There were also many humans living on the gigantic icebergs beside the continent.<br/><br/>There were hundreds of icebergs in the surroundings. Each of them was comparable to a gigantic star.<br/><br/>This was the nest of the icebergs.<br/><br/>“Dragon Palace, the place below is the place where you mentioned the icebergs. Do you need my help?”<br/><br/>An lie pointed down and asked Wang Xian.<br/><br/>“There’s no need. You can go back first.”<br/><br/>Wang Xian narrowed his eyes slightly.<br/><br/>“Alright, Dragon King. I’ll go back then. Hehe, during this period of time, I’ve killed many people with the eight-headed ao monster and obtained a lot of resources.”<br/><br/>He smiled as he said that and disappeared.<br/><br/>Wang Xian looked at the frozen continent and the icebergs below. He transformed into his human form and flew over.<br/><br/>Landing on the frozen continent, he scanned his surroundings.<br/><br/>On the frozen continent, all the houses and buildings were made of ice. Some of the ice contained a chill that was obviously not ordinary ice.<br/><br/>Wang Xian’s gaze landed on a slightly luxurious building. He could sense that there was a divine emperor level powerhouse inside.<br/><br/>His figure flashed as he entered the building directly.<br/><br/>Located at the underground level of the building, an old man was sitting inside and looking at the information on the universal AI.<br/><br/>“Soul Catcher!”<br/><br/>The old man did not sense Wang Xian’s arrival at all. Even with his level-three divine emperor strength, he did not notice it.<br/><br/>Buzz<br/><br/>The old man’s eyes were dull as he stared at Wang Xian in a daze.<br/><br/>Waves of information entered Wang Xian’s mind.<br/><br/>“The Frozen Legion? The Ice Soldier Legion?”<br/><br/>Wang Xian received a piece of information from the old man.<br/><br/>The Frozen Legion was one of the powerful legions of the ice mountain race.<br/><br/>In the universe, all the races in the universe had legions of different sizes and secret legions.<br/><br/>The more trump cards a race had, the more hidden things they would have and the safer they would be.<br/><br/>When all the trump cards of a race were exposed, it would be dangerous.<br/><br/>The Icebound Legion was not one of the trump cards of the ice mountain race. It was just an ordinary legion, but the icebound legion was one of the hidden trump cards of the icebound race.<br/><br/>The power hidden in the dark.<br/><br/>The old man was once a member of the Icebound Legion, and his son was a member of the Icebound Legion.<br/><br/>He had a rough idea of the area where the icemen army was located.<br/><br/>“We will take action after we have more information.”<br/><br/>As Wang Xian spoke, he concealed his figure and flew out.<br/><br/>He was not in a hurry. Since he had decided to take action, he would give the other party a hard blow.<br/><br/>In the next few days, Wang Xian had been searching for information in the icebound continent and the surrounding hundreds of icebergs.<br/><br/>Half a month later, his understanding of the icebergs had reached a terrifying level.<br/><br/>He even obtained a list of the members of the Ice Soldier Corps and the location of a large number of experts from the icebergs.<br/><br/>If this information were to be spread out, it would cause the icebergs to be boiling with fear.<br/><br/>“There are only 5,000 members of the Ice Soldier Corps and 10 experts at the ninth level of the celestial thearch. The rest are all at least at the fourth level of the Celestial Thearch.”<br/><br/>“There are also the ice seal army and more than 10,000 celestial thearch powerhouses.”<br/><br/>Wang Xian sat in a restaurant of the ice mountain race as he thought about his next move.<br/><br/>“Tomorrow is the time for action.”<br/><br/>Based on the information he received, a faint smile appeared on his face.<br/><br/>Since the ice mountain race wanted to kill them, he wanted to see who would kill who!<br/><br/>This time, even if they could not be destroyed, they would have to pay a heavy price!\t\t\t\t\t\t</div>", "images": {}, "success": true}