{"id": 68, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15072037.html", "title": "Chapter 3059 - Chapter 3059: 3058 Became Famous", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 3059 - Chapter 3059: 3058 Became Famous</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 3059: 3058 became famous<br/><br/>“Roar! Roar! Roar!”<br/><br/>Wild roars and struggles came from the Milky Way. Wang Xian was standing on a desolate beast, and waves of destructive power landed on its body.<br/><br/>That desolate beast, which was a level nine celestial emperor, was naturally not Wang Xian’s match in a one-on-one situation. A large number of injuries appeared on its body.<br/><br/>However, Wang Xian did not kill it directly. Instead, he wanted to tame it.<br/><br/>He continued to hit it repeatedly. He even used his dragon’s might and soul-absorbing power. It took him more than half an hour to completely suppress it.<br/><br/>“It’s not easy to tame a high-level desolate beast. I’m still too weak.”<br/><br/>Wang Xian looked at the severely injured desolate beast and heaved a sigh of relief.<br/><br/>If he had not used his soul-absorbing power at the end, he might not have been able to tame it.<br/><br/>Usually, if one wanted to tame a level nine godly monarch desolate beast, one would need to have the strength of a peak godly monarch, or even a universe knight.<br/><br/>Buzz<br/><br/>At this moment, a faint dragon aura came from the side.<br/><br/>Wang Xian looked over. Mo Xin Lu, who was sitting cross-legged on the five elements millstone, had turned into her true form. Crystal-like dragon scales grew on her body.<br/><br/>“Brother Wang, I’ve broken through. I’ve broken through to the sixth level of celestial thearch!”<br/><br/>Mi Xin Lu opened her eyes and felt the power coming from her body. Her face was full of joy as she said.<br/><br/>“Okay!”<br/><br/>Wang Xian smiled and nodded. “Get used to it. Inform me later. This time, we will be selling a ninth level celestial thearch war pet.”<br/><br/>“Wow, brother Wang, you’ve captured a ninth level celestial thearch desolate beast? That’s Amazing!”<br/><br/>Mi Xin Lu looked at him with admiration. With a face full of surprise and joy, she transformed into her human form and happily used the universe’s AI to record some videos.<br/><br/>Wang Xian smiled and began to tame this level nine celestial emperor desolate beast.<br/><br/>“Oh? What? This time, there’s a level nine celestial emperor battle pet. Wow, it’s so powerful!”<br/><br/>“A level nine celestial emperor battle pet. My goodness, even the chiefs of the ordinary domain-level races only have this kind of mount.”<br/><br/>“The divine palace’s battle pet is really strong. It Won’t get a peak divine emperor level battle pet in the future, right?”<br/><br/>On the universe’s AI, Mo Xin Lu had created a group. When she posted this news in the group, it instantly attracted the attention of countless people in the group.<br/><br/>All of them looked at the pictures in shock.<br/><br/>“Wow, there will be a sale in an hour. First Come, first served. This definitely belongs to our red fog.”<br/><br/>“Red Mist race, you deliberately imprisoned our disciple to prevent him from leaking this matter. We haven’t settled the score with you yet!”<br/><br/>“This is not the past. The Red Mist race and the three-foot race had sealed off the news a few times, and most of the war pets fell into your hands. Now that the Immortal Palace War Pets have become famous, it is impossible for you to obtain a large number of war pets!”<br/><br/>“The Immortal Palace’s war pets are really powerful. Such a powerful desolate beast, under normal circumstances, even if a universe knight captured it alive, it would still be very difficult to tame it. Does the Immortal Palace’s War Pets have a universe Knight Level Beast Tamer?”<br/><br/>The entire group was in a heated discussion, and the number of people in the group had increased by a terrifying amount to over a hundred million.<br/><br/>In the next few months, the news of the Immortal Palace’s war pets selling a large number of war pets was also known by more and more people.<br/><br/>Every time Mi Xin Lu sold a war pet, he would post a post. The more people who followed the post, the more popular it became. Naturally, more and more people knew about this matter.<br/><br/>Nowadays, the Immortal Palace’s war pets were known by everyone in the Milky Way, but all the major races had already paid attention to it.<br/><br/>After all, god-emperor level war pets were still very popular in the Milky Way.<br/><br/>Not to mention celestial emperor level seven or eight battle pets.<br/><br/>If a celestial emperor level eight powerhouse could have a battle pet of the same level, his combat strength would be doubled.<br/><br/>“Brother Wang Xian, this celestial emperor level nine battle pet has tens of millions of people fighting for it instantly. It’s Too Amazing!”<br/><br/>An hour later, MI Xinlu looked at the data on the backstage and said with a smile.<br/><br/>“There aren’t many forces that can afford to buy a level nine divine Emperor War Pet. They must have sent their own disciples to snatch it.”<br/><br/>Wang Xian said indifferently and slowly tamed it.<br/><br/>The reputation of the divine palace war pet had already spread. With the strength of the various forces in the Milky Way, he could rely on the sale of war pets to raise his strength to the Universe Knight Realm.<br/><br/>As long as he reached the universe knight level, the elevation of the Dragon Palace would be much easier.<br/><br/>Time passed day by day, and the third sale date gradually arrived.<br/><br/>When the Immortal Palace’s war pet ship had yet to approach the silver gazing continent, Wang Xian and the rest saw thousands of people waiting on the surface of the sea.<br/><br/>Among them, there were many level eight and level nine divine emperors, and there were even five or six peak divine emperors.<br/><br/>The people from the various universe primary races stood there, forming an incomparably powerful aura.<br/><br/>In the surrounding areas, some people saw the experts from several races and revealed looks of surprise and curiosity, discussing animatedly.<br/><br/>“They’re here!”<br/><br/>The group of people saw the Immortal Palace’s battleship arrive and revealed smiles on their faces.<br/><br/>“All those who are qualified to purchase, please board the ship. Those who are not qualified, please wait outside!”<br/><br/>Mo Xinlu stood on the deck and spoke to everyone.<br/><br/>“We understand the rules!”<br/><br/>The group of experts nodded and flew towards the Celestial Palace’s War Pet Ship.<br/><br/>Half an hour later, all the war pets were sold. Wang Xian obtained a large number of divine stones once again.<br/><br/>“It’s about time!”<br/><br/>The ship sailed to a place where no one was around. Wang Xian kept it and flew towards the Wangyin continent with Mo Xinlu.<br/><br/>The Wangyin continent was the largest continent in the Milky Way. At the same time, it was also the largest trading market in the Milky Way.<br/><br/>On it, one could buy all kinds of treasures.<br/><br/>In fact, the auction house here had even bid for universe knight-level treasures.<br/><br/>Wang Xian now needed to purchase a large number of divine stones in his hands into pills.<br/><br/>At a few famous pill shops in the Wangyin continent, Wang Xian successfully exchanged all the divine stones into pills.<br/><br/>“It’s enough for me to level up on my own!”<br/><br/>Looking at the elixirs in his interspatial ring, he revealed an extremely excited expression.<br/><br/>After taking all these elixirs, he would have the combat strength of a peak celestial emperor.<br/><br/>Without a universe knight, he would be invincible.<br/><br/>Even if he was a wizard at the peak of Celestial Emperor, Wang Xian would dare to challenge him.<br/><br/>“Let’s go back!”<br/><br/>Wang Xian said to Mi Xinlu and brought him to the willow deity Daoist sect.<br/><br/>He wanted to make a breakthrough in the willow deity Daoist sect.<br/><br/>“I’ve finally found it. Hahaha, it’s all thanks to the acting wizard this time.”<br/><br/>“The ability of the acting wizard has impressed me. This heaven acting mirror is really powerful!”<br/><br/>At this moment, on the Milky Way in front of the Wangyin continent, an old man in a white robe was floating in the air.<br/><br/>He held a mirror in his hand, and two figures appeared in the mirror.<br/><br/>Beside him, master Yu and four experts of the ice mountain race were standing on his left and right.<br/><br/>Looking at the scene in the mirror, his face was filled with excitement and killing intent!\t\t\t\t\t\t</div>", "images": {}, "success": true}