{"id": 62, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15072025.html", "title": "Chapter 3053 - Chapter 3053: 3052, Unbridled 3", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 3053 - Chapter 3053: 3052, Unbridled 3</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 3053: 3052, Unbridled 3<br/><br/>“What? Sanshui Qing and junior brother were killed by that Wang Xian beside the willow deity Daoist sect. Senior Brother Zhuge, this…”<br/><br/>“We also wanted to help junior brother Bingling Hongtu to track down that Wang Xian. We didn’t expect him to be so unbridled. Junior brother, your ice mountain race must avenge your two junior brothers.”<br/><br/>“Senior brother Zhuge, please rest assured. I will immediately report this matter to the clan. Our Ice Mountain race will definitely not let him off.”<br/><br/>After receiving the information, Bingling Hongtu and the rest came to the willow deity Daoist sect. After receiving the information from Zhuge, their expressions were abnormally ugly.<br/><br/>Sanshui Qing had a good relationship with them. Otherwise, they wouldn’t be willing to help report the situation of that Wang Xian.<br/><br/>However, now that he was killed, who would dare to get close to them in the future?<br/><br/>That Wang Xian must be killed.<br/><br/>Waves of killing intent shot out from their bodies. The two of them clenched their fists tightly.<br/><br/>“Let’s go to the race.”<br/><br/>Bing Ling, Hong Tu, and the rest flew towards the ice mountain race with gloomy faces.<br/><br/>…<br/><br/>On the surface of the Milky Way, Wang Xian continued his fishing.<br/><br/>This time, after flying for ten hours, there were no traces of humans in the vast Milky Way.<br/><br/>Wang Xian was very satisfied with the start of the fishing. He immediately caught two level eight celestial emperor level dire beasts.<br/><br/>“Go to the surroundings immediately and hide.”<br/><br/>After placing more than 100 celestial emperor level battle pets into the Milky Way, Wang Xian gave them an order.<br/><br/>“Brother Wang, why did you let them go into the Milky Way?”<br/><br/>At the side, Mi Xin Lu asked curiously.<br/><br/>“Keep an eye on the surroundings. I’ve killed a bunch of disciples of the ice mountain race, especially three disciples of the Willow deity Daoist sect. They will definitely not let this matter rest, Hehe.”<br/><br/>Wang Xian said with a faint smile.<br/><br/>Just now, he had seen Bing Ling Hongtu of the Willow deity Daoist sect shouting in the group. He said that they would have to pay the price for killing the disciples of their ice mountain race.<br/><br/>He had said that he would be exterminated.<br/><br/>When he saw this information, he could guess that the ice mountain race was going to deal with him next.<br/><br/>The Ice Mountain race was a domain-level race, and their strength was not weak among the domain-level races.<br/><br/>From the information available in the universe’s AI, the Ice Mountain Race had seven peak divine emperor experts.<br/><br/>He did not know the exact number.<br/><br/>However, this force far surpassed all the forces around the Mo Han clan’s ruins.<br/><br/>Therefore, Wang Xian had no choice but to be fully prepared.<br/><br/>With their strength, they definitely had a way to find him.<br/><br/>He ordered more than a hundred war pets to act as spies in the surrounding area. Once they found traces of the iceberg race, they would report immediately.<br/><br/>After setting up the alert, Wang Xian continued to fish.<br/><br/>…<br/><br/>“Master Yu, have you locked onto that guy?”<br/><br/>At the same time, at a spot in the Milky Way, six battleships were sailing on the surface of the sea.<br/><br/>Each battleship was about 10,000 meters in size and contained a terrifying force.<br/><br/>In the Milky Way, it didn’t mean that the bigger the battleship, the stronger it would be. However, the battleships that dared to venture deep into the Milky Way definitely possessed a defensive power that was no less than a level eight divine emperor.<br/><br/>On a warship in the middle, an old man holding a huge ice sword looked at the old man beside him and asked in a deep voice.<br/><br/>“The aura that you guys gave me is too little. I can only search for a general direction.”<br/><br/>Master Yu was holding a book. The book was flickering with light, and there were red and black dots on it.<br/><br/>“Go and search this area.”<br/><br/>Master Yu pointed at an area and said.<br/><br/>“OK. After killing that Kid, Our Ice Mountain race will reward master Yu with a lot of money.”<br/><br/>The old man holding the giant ice sword promised.<br/><br/>“OK!”<br/><br/>Master Yu nodded lightly.<br/><br/>“Surround this area. We must kill that Kid.”<br/><br/>The old man holding the giant ice sword waved his arm and an area appeared. It was transmitted to the five battleships in the surrounding area.<br/><br/>“Yes!”<br/><br/>“It’s The Guardian!”<br/><br/>Soon, one voice after another was heard.<br/><br/>“He dared to kill the disciples of our Divine Willow Daoist sect. He is courting death!”<br/><br/>The eyes of the giant sword guardian of the ice mountain race were filled with murderous intent.<br/><br/>The three disciples of the Divine Willow Daoist sect had been killed. It meant that their ice mountain race would lose three powerful warriors.<br/><br/>This was only secondary.<br/><br/>Ten days ago, they had received news from the disciples of the Divine Willow Daoist sect. Two more people who had a good relationship with the disciples of the Divine Willow Daoist sect had been killed because they had helped to track them.<br/><br/>This was also an invisible blow to their ice mountain race.<br/><br/>Their ice mountain race possessed their current strength, and there were quite a number of peak divine emperor powerhouses. Among them, there was a crucial point.<br/><br/>Among the peak combat strength of their race, one-third of them had walked out of the willow deity Daoist sect.<br/><br/>The disciples who entered the willow deity Daoist sect had reached the eighth level divine emperor within the time limit set by venerable willow deity. It was the most garbage.<br/><br/>It was normal for them to reach the ninth level. There were quite a number of them who were at the peak of celestial thearch.<br/><br/>With the death of their disciples and the murder of the people who helped them, who would agree if their disciples wanted to recruit disciples in the Willow deity Daoist sect in the future?<br/><br/>Therefore, they had to kill that Wang Xian to let everyone know that their ice mountain race was not to be trifled with.<br/><br/>Anyone who dared to kill the disciples of their ice mountain race would have to pay with their lives.<br/><br/>They had to re-establish their prestige.<br/><br/>The six battleships were moving rapidly towards the sea area in front of them. They slowly spread out and formed an encirclement.<br/><br/>This was because they did not have any personal belongings of Wang Xian. They could only use the soil that he had stepped on to lock onto it through powerful wizards.<br/><br/>At the moment, they could only lock onto a rough area.<br/><br/>However, this was sufficient for the ice mountain race.<br/><br/>This time, they had deployed a guardian at the peak of the Divine Emperor Realm and 12 elders at the ninth level of the divine emperor realm. They were determined to exterminate him.<br/><br/>“There’s a situation!”<br/><br/>In the boundless Milky Way, he, who was taming the desolate beasts, raised his eyebrows.<br/><br/>A war pet emitted a fluctuation. This was a warning signal.<br/><br/>With a wave of his arm, he kept all the desolate beasts in the mother nest. He narrowed his eyes and scanned his surroundings.<br/><br/>“Brother Wang, What’s Wrong?”<br/><br/>Mi Xinlu stood up immediately and looked at Wang Xian who was on alert.<br/><br/>“There are a few battleships coming over. I’m not sure if they are from the ice mountain race.”<br/><br/>Wang Xian spoke. The five elements millstone sank slowly and dived straight towards the bottom of the sea.<br/><br/>He only stopped when he had dived to a distance of nearly one billion kilometers. He raised his head and looked up with his dragon eyes.<br/><br/>“Master Yu, there is no one on the surface of the sea nearby.”<br/><br/>At this moment, on a battleship in the Milky Way, the huge sword protector of the ice mountain race looked around and frowned slightly.<br/><br/>“Hualala!”<br/><br/>Master Yu’s eyes flickered. Waves of energy were injected into the book in his hand, and the book kept flipping.<br/><br/>“Found him. He is in the Milky Way, about one billion kilometers away from us!”<br/><br/>Not long after, in the eyes of the master burst out a luster, said affirmatively.\t\t\t\t\t\t</div>", "images": {}, "success": true}