{"id": 67, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15072035.html", "title": "Chapter 3058 - Chapter 3058: 3057 Who Will Kill Who 4", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 3058 - Chapter 3058: 3057 Who Will Kill Who 4</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 3058: 3057 who will kill who 4<br/><br/>“Ninth level divine emperor strength, peak divine emperor speed, with the protection of the willow deity Daoist sect.”<br/><br/>When the ice mountain race experts heard the information of the Greatsword Protector, their expressions became somewhat ugly.<br/><br/>Such an enemy was extremely troublesome.<br/><br/>The opponent had the protection of the willow deity Daoist sect, so it was impossible for them to attack the willow deity Daoist sect.<br/><br/>With the combat strength of a ninth level divine emperor and the speed of a peak divine emperor, it meant that if they wanted to kill him, they would need a peak divine emperor powerhouse.<br/><br/>“Last time, third protector, you forced him to use the fallen leaves to return. In other words, if we can lock on to him, there is a high possibility of killing him!”<br/><br/>The Ice Mountain Race’s patriarch sat at the side and asked with a grim expression.<br/><br/>“Yes, but…”. “That guy killed five disciples of the Willow deity Daoist sect. I don’t know if he still has any fallen leaves to return to. Secondly, we have been monitoring the willow deity Daoist sect during this period of time, but we did not discover that he had come out. This time, he was able to assassinate the disciples of Our Ice Warrior Army and sneak into the Ice Mountain of the frozen army. This guy is more difficult to deal with than we had imagined.”<br/><br/>The third protector of the GREATSWORD said with a solemn face.<br/><br/>Hearing his words, the expressions of the others changed.<br/><br/>This was an extremely troublesome fellow. If it was an ordinary rank nine divine emperor expert, their ice mountain race was confident that they could kill him within a few months.<br/><br/>However, this fellow made them feel that it was troublesome and troublesome.<br/><br/>“Kill! We must kill him. Anyone who dares to kill our ice mountain race will have to pay the price.”<br/><br/>A burly old man beside him roared with a face full of rage.<br/><br/>“Kill!”<br/><br/>“If we let a ninth level divine emperor intimidate us, Our Ice Mountain race will no longer be able to survive. Next, the entire race will be on alert.”<br/><br/>The Ice Mountain Race’s patriarch also roared with a face full of awe.<br/><br/>Their ice mountain race had been able to develop to this point and had experienced all sorts of tribulations. How could they be intimidated by a ninth level divine emperor? That was truly laughable.<br/><br/>If someone were to kill them, they would have to kill their way back.<br/><br/>“However, there is a problem now. Master Yu is currently unable to lock onto his position. We don’t know where he is.”<br/><br/>The third protector of the Greatsword tribe said in a deep voice.<br/><br/>“Then let’s find an even stronger sorcery to lock onto his position.”<br/><br/>The leader of the Ice Mountain tribe said in a cold voice.<br/><br/>The rest of the experts nodded their heads heavily.<br/><br/>“Boom! Boom! Boom!”<br/><br/>In the Milky Way, Wang Xian stared at the desolate beasts in the water below. His eyes were filled with excitement.<br/><br/>“The harvest this time is not bad. There are three level eight divine emperors.”<br/><br/>He said with a smile on his face.<br/><br/>“This time, I can sell them at a good price. Now, many people are asking me what kind of battle pets I have.”<br/><br/>Mi Xin Lu said cheerfully from the side.<br/><br/>Wang Xian smiled and nodded. “There are still three months left. I should be able to get a good harvest.”<br/><br/>As he spoke, he immediately began to tame this batch of desolate beasts.<br/><br/>Time passed by little by little. Three months later, the ship of the Celestial Palace’s War Pets arrived at the sea in front of the silver gazing continent once again.<br/><br/>The experts led by the misty race and the three-foot race bought all the war pets.<br/><br/>“Brother Wang, the people who bought the war pets this time are all from the foggy race and the three-foot race. They must have locked up some information about us.”<br/><br/>Mi Xin Lu looked at the people from the two races behind and said to Wang Xian.<br/><br/>“It’s alright. We can sell whoever we want. Besides, they can’t lock us up. Didn’t another beginner-level race appear among the buyers this time? It Won’t be long before our Immortal Palace’s war pets become famous in the Milky Way.”<br/><br/>Wang Xian smiled nonchalantly.<br/><br/>This time, 90% of the buyers were from the misty race and the three-foot race. It was obvious that they had used some tricks.<br/><br/>However, Wang Xian didn’t mind. All he needed to do was to get the divine stone.<br/><br/>“The next sale will be in four months. Who Is This Immortal Palace’s War Pets? How did they manage to get so many war pets?”<br/><br/>“Furthermore, these war pets are clearly creatures from the Milky Way. It’s very likely that they captured and tamed them during this period of time.”<br/><br/>At the back, the experts from the misty race and the three-foot race watched the Immortal Palace’s war pets leave, their eyes flashing with light.<br/><br/>“Very mysterious. They are clearly not a human race. It’s rumored that the top races in the universe can use their bloodlines to quickly tame desolate beasts. Could there be a powerful race’s disciple behind this Immortal Palace’s War Pets?”<br/><br/>A short elder from the three-foot race said indifferently.<br/><br/>“No matter what, it is best that we do not provoke such a mysterious force.”<br/><br/>One of the misty race shook his head. His gaze swept the surroundings and landed on a middle-aged man.<br/><br/>“Looks like the situation here can not be hidden for long.”<br/><br/>He muttered.<br/><br/>“Hide as long as you can!”<br/><br/>The three-foot race expert replied and the group left quickly.<br/><br/>In the universe, time passed by day by day.<br/><br/>“After selling the war pets this time, my strength should be able to increase.”<br/><br/>On the surface of a sea in the Milky Way, Wang Xian looked at the desolate beast that he had just tamed with a smile on his face.<br/><br/>After about a year, he finally gathered the resources to increase his strength.<br/><br/>“By the way, Xin Lu, I remember that the Liu Shen Daoist sect is about to arrive after provoking their disciples, right?”<br/><br/>Wang Xian looked at Mo Xin Lu and asked her.<br/><br/>“Yes, brother Wang. It will take more than a month.”<br/><br/>Mo Xin Lu nodded.<br/><br/>“I will give you some dragon blood. Consume it and absorb it. After refining your own bloodline, you should be able to get a huge upgrade.”<br/><br/>Wang Xian waved his arm and passed some dragon blood that he brought from the dragon transformation pool to the Mi Xin deer.<br/><br/>“After absorbing it, it should be easy for you to pass the venerable Willow Deity’s test.”<br/><br/>He added.<br/><br/>After absorbing a large amount of dragon blood, the divine dragon bloodline in the Mi Xin deer’s body was comparable to that of an ordinary dragon.<br/><br/>With the aptitude of an ordinary dragon and the temperament of the Mi Xin deer, it should not be a problem for him to enter the willow deity Daoist sect.<br/><br/>“Thank you, brother Wang!”<br/><br/>Mi Xin Lu received the dragon blood excitedly. He looked at the dragon blood excitedly and began to absorb it immediately.<br/><br/>“I’ll just fish once more.”<br/><br/>Wang Xian mumbled. The dragon blood condensed into an arowana and the fishing rod was thrown forward.<br/><br/>“Oh?”<br/><br/>“I finally met a level nine celestial thearch level aquatic dire beast. If I had met it earlier, I would have gathered all the resources that I need to upgrade.”<br/><br/>Very soon, under Wang Xian’s senses, a level nine celestial thearch level dire beast appeared in the water and chased after the arowana frantically.<br/><br/>When Wang Xian saw this dire beast, his face was filled with surprise and joy.<br/><br/>This was the first level nine celestial thearch level dire beast that he met when he came to the Milky Way.<br/><br/>He immediately pulled up the fishing rod and controlled the arowana to attract it.<br/><br/>“Whoosh!”<br/><br/>When the level nine divine emperor dire beast was about 100 million kilometers away from him, Wang Xian did not hesitate at all. The incipient Saint Wings appeared behind him and attacked the dire beast in an instant.<br/><br/>“Dragon Eye Lock!”<br/><br/>“Five Elements Dragon Claw!”<br/><br/>In an instant, Wang Xian unleashed all his strength.\t\t\t\t\t\t</div>", "images": {}, "success": true}