{"id": 72, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15072045.html", "title": "Chapter 3063 - Chapter 3063: 3062, Fairy Dragon Clan 1", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 3063 - Chapter 3063: 3062, Fairy Dragon Clan 1</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 3063: 3062, Fairy Dragon Clan 1<br/><br/>“This junior sister seems to have a good relationship with that Wang Xian.”<br/><br/>Bing Linghong tu heard the conversation and looked over. His eyes revealed a cold expression.<br/><br/>“Of course. Brother Wang saved my life not long ago. I know all of you and wanted to snatch the desolate beasts that we obtained. In the end, brother Wang killed me instead.”<br/><br/>Mi Xinlu looked at Bing Linghong Tu and said with a smile.<br/><br/>Bing Linghong Tu and the rest froze when they heard what Mi Xinlu said. Their eyes revealed a sinister look.<br/><br/>“Hehe, Alright, let’s Go!”<br/><br/>Senior Brother Junzi looked at them and said indifferently to help them out.<br/><br/>“HMPH, it won’t be long before that Wang Xian will disappear from this world.”<br/><br/>Bing Ling Hong Tu growled in a low voice with a cold expression.<br/><br/>Mi Xin Lu pouted.<br/><br/>“Hehe, junior sister, come to senior sister. Since you have joined the Willow deity Daoist sect, we are one family.”<br/><br/>A middle-aged woman waved at Mi Xin Lu.<br/><br/>“I’m sorry, senior sister. I’m not joining any faction.”<br/><br/>Mi Xin Lu looked at the middle-aged woman and said straightforwardly.<br/><br/>“Haha, Senior Sister, I’m also an unspecialized. I cultivate with a group of sisters and learn from them.”<br/><br/>The middle-aged woman laughed and explained.<br/><br/>“Alright.”<br/><br/>Mi Xinlu nodded with a smile and said apologetically, “I’m sorry, Senior Sister.”<br/><br/>“It’s alright, it’s alright.”<br/><br/>The middle-aged woman shook her head and said, “In the willow deity Daoist sect, most of the senior brothers and sisters are very nice people.”<br/><br/>“Who is that Wang Xian? What’s the situation?”<br/><br/>At the front, Long Zaitian asked the elder beside him.<br/><br/>“Young master long, he is a new disciple who joined the Divine Willow Daoist sect not long ago. He had a conflict with a few disciples from the ice mountain race. Within a short year, he killed five disciples from the Divine Willow Daoist sect and also killed a large number of strong people from the ice mountain race.”<br/><br/>The old man said in a low voice.<br/><br/>“Oh? What kind of strength does that new disciple have? He killed five disciples of the Divine Willow Daoist sect directly. He is somewhat unscrupulous.”<br/><br/>Long Zaitian asked curiously.<br/><br/>“He seems to be at the ninth level divine emperor. He is very fast.”<br/><br/>The old man replied.<br/><br/>“That Ice Mountain race shouldn’t have been killed by so many people by a ninth level divine emperor, right?”<br/><br/>Long Zaitian asked indifferently.<br/><br/>“The ice mountain race had attacked twice, but he escaped with fallen leaves. I reckon they are about to be killed.”<br/><br/>The old man said with a chuckle.<br/><br/>“A ninth level divine emperor is still so arrogant. Unless he doesn’t leave the willow deity Daoist sect, we can’t protect him.”<br/><br/>Long Zaitian said indifferently.<br/><br/>Everyone came to the Yu Hai Tavern.<br/><br/>In the Willow deity Daoist sect, the disciples of various races were in a group. There were also quite a few people at the loose cultivator’s place.<br/><br/>The males were basically led by the senior brother of a gentleman while the females had a larger group.<br/><br/>There were a group of more than 30 female students. The strongest among them had the strength of a level nine celestial thearch.<br/><br/>When Mi Xin Lu arrived, he was immediately pulled into that small group.<br/><br/>As there were no conflicts of interest and no racial stance, everyone got along well.<br/><br/>Just as Mi Xin Lu joined the willow deity Daoist sect, Wang Xian had already arrived at an iceberg of the iceberg race.<br/><br/>“Dragon King, this is the residence of the grandson of the Ice Mountain Race’s chief. Keke, this grandson is an expert at the ninth level of the celestial thearch. His prestige within the ice mountain race is very high.”<br/><br/>In a luxurious room, two old men stood in front of Wang Xian and spoke with smiles on their faces.<br/><br/>“How much information do you have?”<br/><br/>Wang Xian’s eyes flickered as he asked.<br/><br/>“Dragon King, this ice mountain race has eight experts at the peak of the celestial thearch. There are 30 at the ninth level of the celestial thearch. The race possesses a acquired supreme treasure, the Frost Sword.”<br/><br/>“The Frost Sword is now in the hands of the ice mountain race’s leader.”<br/><br/>An elder of the eight-pointed parasitic race spoke.<br/><br/>“Have you obtained any resources from them? How much more is needed for one of you to achieve a breakthrough?”<br/><br/>Wang Xian asked them.<br/><br/>“Dragon King, there is quite a lot of information. However, I’m afraid there is still a long way to go for one of the eight-pointed parasitic race and me to reach the peak-stage celestial thearch. We will need the corpses of at least seven or eight ninth-stage celestial thearch powerhouses.”<br/><br/>Mo Sha pondered for a moment and said.<br/><br/>“Let’s not take any action for now. If one of you can break through to the peak of the celestial thearch level, it will be much easier for you to parasitize the ice mountain tribe’s tribe leader.”<br/><br/>Wang Xian said.<br/><br/>Mo Sha and Ba Qi nodded in agreement. “We shouldn’t recklessly kill the ice mountain tribe’s celestial thearch level-nine powerhouses. Otherwise, it will arouse suspicion.”<br/><br/>“Leave it to me. Leave the resources for your advancement to me.”<br/><br/>Wang Xian pondered for a moment and said.<br/><br/>Now that his strength had reached the peak of the celestial thearch, he could go to some dangerous places to take a look.<br/><br/>“Alright, Dragon King. We will stay here and watch.”<br/><br/>Ba Qi and Mo Sha nodded their heads.<br/><br/>“Alright!”<br/><br/>Wang Xian nodded his head and looked at an lie.<br/><br/>An lie brought him away immediately.<br/><br/>“Since we are going to destroy the ice mountain race, we must give them a fatal blow and be fully prepared.”<br/><br/>An lie brought Wang Xian to the surface of the Milky Way.<br/><br/>He looked behind him and turned around to fly deeper into the Milky Way.<br/><br/>The dark region of the Milky Way.<br/><br/>The Lone Island in the Milky Way Sea.<br/><br/>The volcanic region of the Milky Way.<br/><br/>…<br/><br/>Various places flashed across his mind. Wang Xian opened the universe’s AI and finally locked onto the volcanic region.<br/><br/>The Milky Way volcano region was a sea of lava.<br/><br/>Below them were numerous gigantic volcanoes.<br/><br/>Volcanoes erupted all year round and the seawater there was red.<br/><br/>There were a large number of aquatic dire beasts living there. Among them, there were many at the peak of the celestial thearch level and there were also many at the ninth level of the celestial thearch level.<br/><br/>Wang Xian was flying at a terrifying speed towards the volcano region.<br/><br/>After more than ten hours, Wang Xian felt a wave of heat coming from the front.<br/><br/>He squinted his eyes slightly. In his line of sight, a fiery red ocean appeared.<br/><br/>The surface of the ocean was rolling. It was completely boiling hot water.<br/><br/>There was also some lava floating on it.<br/><br/>Wang Xian’s figure was changing. A layer of fiery red dragon scales covered his entire body.<br/><br/>He stepped on the surface of the ocean and continued flying forward.<br/><br/>After flying for more than an hour, Wang Xian came to a stop.<br/><br/>The density and strength of the dire beasts here are indeed much higher than other places<br/><br/>Wang Xian sensed waves of aura coming from below and thought to himself.<br/><br/>The fishing rod appeared in his hand. With a wave of his arm, dragon blood condensed into an arowana and flew towards the area below.<br/><br/>After his strength had increased, the coverage area of Wang Xian had also increased by a lot.<br/><br/>He could cover a radius of 1.2 billion kilometers directly.<br/><br/>The arowana entered the volcano region and swam around inside. Soon, it attracted many desolate beasts.<br/><br/>“There are five desolate beasts at the eighth level of celestial thearch. There are indeed many high-level desolate beasts here. It shouldn’t take long for the resources that eight qi and the rest have improved to be completely gathered.”<br/><br/>Wang Xian sensed the desolate beasts below and his eyes revealed a look of joy.<br/><br/>“Dragon Eye Lock on the eight desolates!”<br/><br/>Sensing the rapid gathering of the desolate beasts below, Wang Xian’s body trembled. Terrifying chains attacked the desolate beasts one after another.<br/><br/>“First net!”<br/><br/>There were more than 200 celestial emperor level desolate beasts. Wang Xian revealed a look of satisfaction.\t\t\t\t\t\t</div>", "images": {}, "success": true}