{"id": 76, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15072053.html", "title": "Chapter 3067 - Chapter 3067: 3066 Five Elements Millstone Was Formed", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 3067 - Chapter 3067: 3066 Five Elements Millstone Was Formed</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 3067: 3066 five elements Millstone was formed<br/><br/>“This… This dragon palace is so beautiful. There are all kinds of buildings, and they completely cut off the heat outside.”<br/><br/>“It’s so comfortable. I feel so comfortable inside. These divine dragon statues are so realistic.”<br/><br/>In the Dragon Palace, all the members of the Fairy Dragon Clan entered with joy on their faces.<br/><br/>“There’s a teleportation formation here that can teleport us to the main Dragon Palace. The Dragon Palace over there is one level higher than this place.”<br/><br/>Wang Xian introduced the Fairy Dragon clan with a smile on his face.<br/><br/>“Thank you, Dragon King. We… We can just stay here.”<br/><br/>The eyes of Fairy Lingyuan and the rest sparkled as they sized up their surroundings carefully.<br/><br/>“It’s alright. Let’s go to the main dragon palace and take a look. It’s alright if you want to stay here. If you want to stay in the main Dragon Palace, I’ll bring you there to take a look.”<br/><br/>Wang Xian smiled and shook his head. Then, he brought them into the teleportation formation.<br/><br/>“Wow, is this the main Dragon Palace? What dense spiritual energy!”<br/><br/>The group of Fairy Dragons came to the main dragon palace and cheered again. Their cheers were delightful.<br/><br/>Whoosh! Whoosh! Whoosh<br/><br/>At this moment, figures flew over quickly.<br/><br/>Prime Minister Gui, Heaven Array, AO qitian, Ao Qi, ao shrimp, Ao nv, and so on…<br/><br/>They sensed the Dragon King and Sun Lingxiu’s aura and immediately flew over.<br/><br/>“Greetings, Dragon King, and welcome back, Dragon Queen!”<br/><br/>The leaders of the Dragon Palace immediately said respectfully.<br/><br/>“Lingxiu!”<br/><br/>A group of girls also flew over, their faces full of surprise and joy.<br/><br/>They hugged each other one by one.<br/><br/>Seeing them, Sun Lingxiu smiled and went up to welcome them happily.<br/><br/>“Prime Minister Gui, this is the fairy dragon clan. They will be members of our Dragon Palace in the future. Bring them around!”<br/><br/>Wang Xian looked at them with a smile and said to Prime Minister Gui.<br/><br/>“It’s the Dragon King.”<br/><br/>Prime Minister Gui nodded.<br/><br/>“Prime Minister Gui is in charge of all matters in the Dragon Palace. When I’m not around, some matters have been discussed and decided by Prime Minister Gui and the other civil officials in the Dragon Palace.”<br/><br/>Wang Xian also gave a good introduction to Xianlingyuan and the rest.<br/><br/>Following that, Prime Minister Gui brought them around the Dragon Palace.<br/><br/>Soon, the members of the Fairy Dragon clan cheered one by one.<br/><br/>Dragon Cave, Dragon Field, Dragon King Hall, Dragon transformation pool, sea-pacifying needle…<br/><br/>The buildings made their faces full of shock.<br/><br/>Especially when they realized that any one of the members in the Dragon Palace had a divine dragon bloodline that was much higher than theirs.<br/><br/>They even saw nine wind divine dragons roaming around the Dragon Palace.<br/><br/>Based on their understanding of the Divine Dragon clan, they were truly pure-blooded divine dragons.<br/><br/>When Prime Minister GUI introduced each and every one of the powerful dragon species to them, they were even more shocked.<br/><br/>Especially when they learned that the Dragon Palace had only been established for more than 20 years and already possessed its current strength, they felt shocked and lucky.<br/><br/>The group of girls were reminiscing about the past and Wang Xian did not disturb them.<br/><br/>He came to the Dragon King’s Hall and the Five Elements Millstone was spinning in front of him.<br/><br/>Wang Xian revealed an excited and excited expression on his face.<br/><br/>The Five Elements Millstone was the first divine weapon that he had created. It was also the most convenient weapon that he had been using up till now.<br/><br/>Ever since he integrated his clone into the Five Elements Millstone, the attack power of the Five Elements Millstone had become stronger and more convenient.<br/><br/>However, the five elements millstone had always lacked the earth divine dragon.<br/><br/>Without the Earth Divine Dragon, the five elements could not operate completely. The offensive power of the five elements millstone had been greatly weakened.<br/><br/>Now that the Earth attribute Divine Dragon had returned, the five elements Millstone had finally become complete.<br/><br/>Currently, in the Five Elements Millstone, his five clones, the Earth Attribute Divine Dragon, now had the realm of divine emperor level seven.<br/><br/>The rest of his clones were only at level five of the divine emperor realm.<br/><br/>When the Earth elemental divine dragon was not around, the combined attack power of the five elements millstone was around level eight of the divine emperor realm.<br/><br/>It could not keep up with Wang Xian’s strength at all.<br/><br/>This was mainly because the clones had merged with the Five Elements Millstone. In order for the five elements millstone to be upgraded, it needed to absorb the divine weapons and energy of the five attributes.<br/><br/>Now, with the addition of the Earth Elemental Divine Dragon, the attack power of the five elements millstone had been forcefully upgraded to the peak of the divine emperor realm.<br/><br/>After all, just relying on the Earth Divine Dragon alone could unleash the combat power of the peak of the divine emperor realm.<br/><br/>This was only one of the reasons. The fusion of the Earth Divine Dragon Avatar had completely formed the five elements millstone.<br/><br/>In the future, even if they did not use resources, their speed of training alone would increase by several times.<br/><br/>If the other four divine dragons could also reach the seventh level of the divine emperor realm, then the five elements millstone could single-handedly kill an existence at the second level of the Universe Knight Realm.<br/><br/>After all, the Divine Dragons of the five attributes were fused together.<br/><br/>Back then, when Wang Xian possessed the five attributes, he was able to fight across five levels.<br/><br/>“If I want to raise the other four divine dragons to level seven of celestial thearch, I’ll need to devour a large number of divine weapons. It might take some time!”<br/><br/>Wang Xian muttered.<br/><br/>However, the five elements millstone was already very terrifying now with the addition of the Earth Divine Dragon.<br/><br/>With his current strength and the five elements millstone, he could fight against four to five ordinary peak-stage divine emperor powerhouses alone.<br/><br/>With two peak-stage divine emperor powerhouses in front of him, he could destroy them in a few seconds.<br/><br/>“The five elements millstone is completely formed. I can let the light and Dark Divine Dragon Avatar merge into the yin-yang Dragon Disk.”<br/><br/>Wang Xian pondered for a moment and gave up on this idea.<br/><br/>There were more divine artifacts of the five elements, and there were too few of the light and dark divine artifacts. Once these two clones were merged into the divine artifacts as the artifact spirits, it would be even more difficult to upgrade them.<br/><br/>“Next, I will first destroy the iceberg, then the dragon descendants, the nine-sword race, and the skeleton race!”<br/><br/>Wang Xian’s eyes were filled with killing intent.<br/><br/>Regardless of whether it was for the sake of Lingxiu, the fairy dragon race, or the Asian dragon with the bloodline of the Divine Dragon, he had to destroy them all.<br/><br/>He wanted to destroy three primary races in the universe, announce the rise of the Dragon Palace, and completely establish himself in the universe.<br/><br/>However, it was not so easy to destroy them.<br/><br/>In the next two days, Wang Xian was not in a hurry.<br/><br/>It was better to be apart for a long time than to be newly married!<br/><br/>After being separated from Sun Lingxiu for so long, he naturally had to spend some time with her.<br/><br/>This time, he spent two days and two nights with her.<br/><br/>The Fairy Dragon Clan had been wandering around the dragon palace for the past two days, and their faces were filled with excitement.<br/><br/>“Xianlingyuan, you can choose whether you want to live here or in the Milky Way in the future. There’s something I want to ask you.”<br/><br/>Two days later, Wang Xian called over Xianlingyuan and the rest from the Fairy Dragon Clan.<br/><br/>The Fairy Dragon Clan had three experts at the peak of the Celestial Emperor Realm. Xianlingyuan’s strength was not among them.<br/><br/>The three peak of the Celestial Emperor Realm were the three old women from the Fairy Dragon Clan.<br/><br/>“Dragon King, please tell us. We will definitely tell you everything we know.”<br/><br/>Immortal Lingyuan and the rest immediately said respectfully.<br/><br/>“Are there any universe knight-level desolate beasts in the volcano region? Do you know the lairs of some pinnacle emperor-level desolate beasts there?”<br/><br/>Wang Xian asked.<br/><br/>If immortal Lingyuan and the rest were very familiar with the volcano region, if there were no universe knight-level desolate beasts there, they could completely sweep the volcano region.<br/><br/>“Reporting to Dragon King, there is a universe knight level beast in the volcano region, and we know of a race with a few pinnacle emperor level beasts.”\t\t\t\t\t\t</div>", "images": {}, "success": true}