{"id": 78, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15072057.html", "title": "Chapter 3069 - Chapter 3069: 3068 Hunted Down The Blazing Turtle Winged Beast", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 3069 - Chapter 3069: 3068 Hunted Down The Blazing Turtle Winged Beast</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 3069: 3068 hunted down the blazing turtle winged beast<br/><br/>“Five Elemental Dragon Claws!”<br/><br/>“Five elemental grindstone!”<br/><br/>When Wang Xian’s figure appeared above the blazing turtle winged beast at the peak of the Celestial Emperor Realm, the five elemental dragon claws covered it directly.<br/><br/>At the same time, the five elemental grindstone pressed down directly.<br/><br/>Boom! Boom! Boom<br/><br/>The body of the blazing turtle winged beast at the peak of the Celestial Emperor Realm, which had just flown over, trembled. Streams of fresh blood flowed out from its body.<br/><br/>The terrifying attack was still able to inflict heavy injuries on its turtle shell even when it landed on it.<br/><br/>Wang Xian’s attack ended, causing it to be unable to react in time.<br/><br/>“Dragon Claw, Annihilation!”<br/><br/>“Break for me!”<br/><br/>Wang Xian’s eyes revealed a cold expression as he attacked the turtle shell with his dragon claw with all his might.<br/><br/>The five elements grinding together with the grayish annihilation force charged towards it.<br/><br/>At this moment, Wang Xian was aiming for a one-hit kill.<br/><br/>Faced with three turtle-winged beasts at the peak of the Celestial Emperor Realm, the chances of Wang Xian taming them were very low.<br/><br/>When he tamed them, the other two would either attack him or escape.<br/><br/>Therefore, he had to kill two of them quickly before taming the last one.<br/><br/>Boom<br/><br/>The turtle-winged beast felt the death enveloping it and revealed an extremely shocked and furious expression. Extremely Hot Flames surged out from its body and covered an area of a few hundred million kilometers.<br/><br/>Wang Xian, who was in the sky, was the first to be affected.<br/><br/>Crack! Crack! Crack<br/><br/>The dragon scales on Wang Xian’s body covered him completely. The fiery red dragon scales were also emitting extremely hot flames.<br/><br/>A fire god Dragon was circling around him.<br/><br/>Crack! Crack! Crack<br/><br/>Below, Wang Xian’s dragon claws caused the turtle shell to crack slowly. The destructive power of the five elements grinding surged into its body.<br/><br/>“Woo!”<br/><br/>“Woo Woo!”<br/><br/>At the back, two turtle-blazed winged beasts at the peak of the Celestial Emperor Realm saw their companion being attacked. They let out an angry roar and attacked Wang Xian directly.<br/><br/>At the same time, the surrounding turtle-blazed winged beasts were all boiling up and attacking them.<br/><br/>Furthermore, they could sense that more and more turtle-blazed winged beasts were charging towards them.<br/><br/>“Attack!”<br/><br/>Upon seeing this scene, the three elders of fairy dragon and Xianlingyuan moved their bodies and immediately attacked the two seraphic winged beasts at the peak of the Celestial Emperor realm and the seraphic winged beasts around them.<br/><br/>“Bang!”<br/><br/>At this moment, a loud sound came from Wang Xian’s side.<br/><br/>The five elements grinding mill and dragon claws landed heavily on the seraphic winged beast that was severely injured. The seraphic winged beast that was already severely injured was on the verge of death. Its vitality quickly disappeared.<br/><br/>Buzz<br/><br/>Wang Xian grabbed its corpse and threw it directly into the mother nest. His gaze landed on another seraphic winged turtle at the peak of the Celestial Emperor Realm. He flapped his incipient saint wings and instantly appeared above it.<br/><br/>Roar! Roar<br/><br/>The seraphic winged turtle at the peak of the Celestial Emperor Realm sensed Wang Xian’s arrival. It raised its head and a terrifying pillar of fire attacked him.<br/><br/>Suddenly, seraphic winged turtle beasts that were condensed from flames of about ten meters in size rushed out from its shell.<br/><br/>Boom! Boom! Boom<br/><br/>The countless small turtle blazed wings beasts immediately exploded.<br/><br/>“Huh?”<br/><br/>Wang Xian sensed this terrifying attack and his expression changed slightly. He moved his body and dodged it instantly.<br/><br/>With his speed that was far above that of the same level, the attacks of the dire beasts of the same level could not touch him at all.<br/><br/>“Woo Woo Woo!”<br/><br/>When the turtle blazed wings beast saw that its laws and Abhijna had been dodged, it revealed a furious and fearful expression.<br/><br/>Crash<br/><br/>Wang Xian flapped his divine wings and instantly appeared behind it. With a wave of his arm, a surge of energy was injected into the divine wings.<br/><br/>The five divine dragons on the divine wings raised their heads and roared. Each of their attributes condensed into a divine dragon and attacked the blazing turtle winged beast in front.<br/><br/>The blazing turtle winged beast sensed the threat from behind and immediately turned around. Its body trembled.<br/><br/>The surrounding lava condensed into two lava tornadoes around it and attacked the five divine dragons.<br/><br/>“Hua La!”<br/><br/>The prieless sacred wings flapped and flew behind him in an instant.<br/><br/>The peak-stage divine emperor blazing turtle winged beast, who was dealing with the five elements millstone, instantly felt a sharp pain from its tail.<br/><br/>Following that, a terrifying dragon claw pressed down on its body.<br/><br/>“Wu Wu Wu!”<br/><br/>His mouth let out a hurried and frightened roar.<br/><br/>The five elements grinding mill spun, releasing five divine dragons that coiled around one line, forming a five-colored divine dragon.<br/><br/>The five-colored divine dragon turned slowly into a gray dragon claw, and similarly attacked the blazing turtle winged beast.<br/><br/>“Roar!”<br/><br/>Sensing a threatening attack approaching, it struggled in fear.<br/><br/>“Boom!”<br/><br/>Two Dragon Claws landed on its body, causing it to bleed profusely.<br/><br/>“Woo Woo, Woo Woo!”<br/><br/>On the other side, the last turtle-winged beast at the peak of the Celestial Emperor Realm saw the situation of its companion and its eyes were filled with fear.<br/><br/>In less than a minute, one of its kind was killed while the other was completely subdued.<br/><br/>“Boom Boom Boom!”<br/><br/>With its powerful battle instincts, a powerful fire turtle shell defense slowly rose from its body.<br/><br/>“Attack!”<br/><br/>The three fairy dragon elders were excited when they saw Wang Xian’s terrifying strength. They attacked this turtle blazed winged beast at the peak of the Celestial Emperor realm with all their strength.<br/><br/>Buzz<br/><br/>However, when their attacks landed on the fire turtle shell above, the turtle blazed winged beast below immediately disappeared.<br/><br/>It escaped directly!<br/><br/>“It actually escaped directly!”<br/><br/>The three fairy dragon elders were slightly taken aback as they exclaimed in astonishment.<br/><br/>“Huh?”<br/><br/>Wang Xian was slightly taken aback when he sensed the escape of the third blazing turtle-winged beast at the peak of the Celestial Emperor Realm.<br/><br/>“Woo Woo Woo!”<br/><br/>However, just as one of them escaped, a low roar that was filled with fire could be heard from behind. The Aura that belonged to the peak of the Celestial Emperor Realm could be heard.<br/><br/>Another blazing turtle-winged beast at the peak of the Celestial Emperor realm led thousands of celestial emperor-level subordinates and charged over.<br/><br/>“Another one came after another. Perfect Timing!”<br/><br/>Wang Xian’s eyes revealed a hint of excitement. His Dragon Claw struck the turtle-winged beast beneath him and killed it.<br/><br/>“Subdue this one!”<br/><br/>Seeing the turtle-winged beast rushing over, he went up to it directly.<br/><br/>The turtle-winged beast at the peak of the celestial thearch-level who had just rushed over sensed the situation over here. He was a little confused when he saw the auras of a few of his peers disappear.<br/><br/>“Dragon Eye Lock!”<br/><br/>Wang Xian rushed over directly. In order to prevent it from escaping, he sealed it with his supernatural ability.<br/><br/>“Woo Woo!”<br/><br/>The turtle-winged beast, who was at the peak of the Celestial Emperor Realm, saw the dense chain in front of him. He opened his mouth and shot out fire ropes from his mouth. They collided with the chain.<br/><br/>“Bang, Bang, Bang!”<br/><br/>A violent collision was heard. A cold look appeared in Wang Xian’s eyes.<br/><br/>His body was emitting an eight-colored glow and his dragon scales covered it completely.<br/><br/>Wang Xian opened his dragon claws and clawed at its head.<br/><br/>Boom! Boom<br/><br/>When the turtle-winged beast at the peak of the Celestial Emperor Realm saw Wang Xian who was attacking it, it flapped its four wings gently towards the ground.<br/><br/>Below the ground, columns of fire were charging towards Wang Xian directly.<br/><br/>Crash<br/><br/>At this moment, he sped up abruptly and landed on the seraphic winged beast. A smile appeared on his face.<br/><br/>Boom<br/><br/>The dragon claws landed on the seraphic winged beast with a loud bang.<br/><br/>The seabed within a radius of more than a billion kilometers trembled and lava churned!\t\t\t\t\t\t</div>", "images": {}, "success": true}