{"id": 79, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15072059.html", "title": "Chapter 3070 - Chapter 3070: 3069 Tomb Of An Expert At The Peak Of The Celestial Emperor Realm", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 3070 - Chapter 3070: 3069 Tomb Of An Expert At The Peak Of The Celestial Emperor Realm</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 3070: 3069 tomb of an expert at the peak of the Celestial Emperor Realm<br/><br/>Boom! Boom! Boom<br/><br/>Woo! Woo! Woo<br/><br/>A dull and loud sound rang out in the territory of the blazing turtle winged beast. Wang Xian was standing on the body of a turtle winged beast at the peak of the Celestial Emperor Realm. The chains wrapped around it and terrifying attacks landed on it one after another.<br/><br/>The blazing turtle winged beast let out a continuous wail. The dragon might from Wang Xian’s body was crushing towards it.<br/><br/>In the surroundings, the blazing turtle wings beasts were fleeing frantically. Those who could escape back to the nest in an instant were able to do so.<br/><br/>Fairy Dragon, Elder Xian Lingyuan, and the other three looked at Wang Xian in shock.<br/><br/>Wasn’t his combat strength too terrifying?<br/><br/>He could completely suppress the desolate beasts that were at the peak of the Celestial Emperor Realm. If these desolate beasts were not united, he would not be able to kill them on his own.<br/><br/>“Submit!”<br/><br/>Wang Xian’s dragon claws landed on the blazing turtle winged beast one after another. The severely injured blazing turtle winged beast began to plead.<br/><br/>“Woo Woo!”<br/><br/>As time passed, the blazing turtle winged beast slowly lowered its head and stopped resisting. It expressed its submission.<br/><br/>When Wang Xian saw it submit, a smile appeared on his face.<br/><br/>He had finally tamed it.<br/><br/>He swept his gaze across the surroundings. Other than some corpses, the rest of the blazing turtle winged beasts were already fleeing for their lives.<br/><br/>“I want to tame it first. All of you wait here.”<br/><br/>Wang Xian said to Xian Lingyuan and immediately began to tame the blazing turtle-winged beasts beneath him.<br/><br/>“It’s good to follow a leader. There are many things that we don’t need to worry about, especially following a powerful leader. There’s no need to be afraid and we don’t lack any food.”<br/><br/>Xian Lingyuan looked at Wang Xian who was taming the desolate beast and said to the elders beside her with a smile.<br/><br/>“That’s because we are lucky. If we were to join other races, we would become their mounts.”<br/><br/>An elder said with a smile.<br/><br/>Time passed day by day. It took a lot of time to completely tame a desolate beast at the peak of the Divine Emperor Realm.<br/><br/>It took a total of ten days to completely tame it. Some of the vitality fluid was used to heal its injuries.<br/><br/>“Continue. Let’s take a look around.”<br/><br/>Wang Xian said to the four members of the Fairy Dragon tribe.<br/><br/>“It’s the Dragon King!”<br/><br/>The four of them nodded and immediately followed behind Wang Xian to search the surroundings.<br/><br/>However, things did not go smoothly. Some of the blazing turtle winged beasts immediately fled when they encountered Wang Xian.<br/><br/>This caused them to frown slightly.<br/><br/>“It seems that these blazing turtle winged beasts are already wary of us. Let’s go back!”<br/><br/>After wandering around for a long time, Wang Xian shook his head and gave up.<br/><br/>He was already very satisfied with killing two peak-stage emperor-level blazing turtle winged beasts and taming one of them.<br/><br/>Two blazing turtle winged beasts would allow the eight-limbed demonic fiend and the rest to increase their combat strength to the peak-stage Emperor-level.<br/><br/>By then, it would be much easier to annihilate the ice mountain race.<br/><br/>The peak of the celestial thearch level battle pet could also raise Wang Xian’s level and accumulate a large amount of dragon qi.<br/><br/>According to his estimation, as long as he could tame five or six peak of the celestial thearch level battle pets and sell them, he would be able to raise his strength by another level.<br/><br/>“An lie!”<br/><br/>Upon returning to the Dragon Palace, Wang Xian immediately informed an lie.<br/><br/>An lie received the message and arrived very quickly.<br/><br/>“Dragon King!”<br/><br/>An lie stood respectfully in front.<br/><br/>“Inform the eight-limbed demonic fiend to think of a way to return to the Dragon Palace to raise their strength.”<br/><br/>Wang Xian instructed him.<br/><br/>“It’s the Dragon King!”<br/><br/>An lie nodded.<br/><br/>An hour later, the two of them were brought back by an lie. They returned to the dragon transformation pool to raise their strength.<br/><br/>Following that, Wang Xian tamed some of the untamed desolate beasts in the mother nest.<br/><br/>However, ten days later, Wang Xian suddenly received a message from the Mi Xin deer.<br/><br/>“The tomb of the Gemini Celestial Thearch?”<br/><br/>Wang Xian looked at the message and raised his eyebrows slightly.<br/><br/>In the Willow deity Daoist sect, the venerable willow deity had announced a treasure land to all his disciples. It was also the place where the powerhouses died.<br/><br/>Twin God emperors were the two great beings who had shaken the Milky Way millions of years ago.<br/><br/>Twin God emperors were also known as Blade God Emperor. One of them used a blade while the other used a sword.<br/><br/>Both of them were great beings at the peak of the god Emperor Realm.<br/><br/>At that time, both of them were very famous. They had offended the nine-sword race and were hunted down by the great beings of the nine-sword race.<br/><br/>However, the twin God emperor duo had killed four peak God Emperor Great Beings of the nine-sword race and tens of thousands of other god Emperor Great Beings of the nine-sword race.<br/><br/>In the end, the universe knight powerhouses from the nine-sword race did not manage to kill them.<br/><br/>However, the twin god Emperors disappeared after that.<br/><br/>Looking at this news, it was obvious that they had fallen.<br/><br/>The venerable willow deity must have found out where the two great god-emperors had fallen. Hence, he announced this place in the training hall as a reward for the disciples of the training hall.<br/><br/>This was not the first time such a thing had happened in the willow deity training hall.<br/><br/>However, it was Wang Xian’s first time encountering it.<br/><br/>“The graves of two peak divine emperors. Do you want to go over and take a look?”<br/><br/>“See if there are any treasures?”<br/><br/>Wang Xian mumbled. He opened the universe’s AI and took a look at some information.<br/><br/>In the group chat of the willow deity sect’s disciples, many of them were already prepared to go over and take a look.<br/><br/>“Eh?”<br/><br/>At this moment, he saw the confidence in the group chat and narrowed his eyes slightly.<br/><br/>Some disciples of the Willow God Daoist sect said that the twin God emperors were able to kill the nine-sword race’s God emperors and escape from the Universe Knights because they had acquired Numinous Treasures.<br/><br/>Acquired Numinous Treasures, even the weakest acquired Numinous Treasures had powerful destructive power.<br/><br/>The stronger ice mountain race among the domain-level races only had one acquired Numinous Treasure.<br/><br/>It was possible that the primary races in the universe did not have many acquired Numinous Treasures.<br/><br/>“One of the twin divine emperors has the fire attribute while the other has the water attribute. If their weapons can be absorbed by the five elements grinding mill, they will definitely be able to obtain a terrifying upgrade.”<br/><br/>Wang Xian’s eyes sparkled as he decided to take a look.<br/><br/>He arrived at the Dragon Palace in the volcano region through the teleportation formation and flew rapidly towards the willow deity Daoist sect.<br/><br/>Ba Qi and Mo Sha were about to break through. It would take a few more days for them to take action there.<br/><br/>In these few days, he could go to the location of the Gemini Divine Emperor’s tomb to take a look.<br/><br/>“Senior sister, I called brother Wang over. He said that he will be here soon. At that time, I might not be able to go with you guys.”<br/><br/>At this moment, in the willow deity Daoist sect, a group of more than 30 women gathered together. Mi Xin Lu looked at the message and said apologetically to them.<br/><br/>“Sister Xinlu, do you want to team up with that Wang Xian?”<br/><br/>The few women frowned slightly.<br/><br/>“That Wang Xian is very strong. If he didn’t offend the ice mountain race and the other disciples were unhappy, we could team up with him. What a pity.”<br/><br/>One of the women shook her head.<br/><br/>“It’s too dangerous to be with him. Xinlu, you have to be careful too.”<br/><br/>A lady reminded Mo Xin Lu.<br/><br/>“Don’t worry, Big Brother Wang is very good, you’ll know after spending more time with him.”<br/><br/>Mo Xin Lu shook his head, smiling as he said, looking at the universe ai shaking slightly, “Big Brother Wang has arrived, I’ll go over first.”\t\t\t\t\t\t</div>", "images": {}, "success": true}