{"id": 74, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15072049.html", "title": "Chapter 3065 - Chapter 3065: Meeting At 3064, Fairy Dragon Clan 3", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 3065 - Chapter 3065: Meeting At 3064, Fairy Dragon Clan 3</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 3065: Meeting at 3064, Fairy Dragon Clan 3<br/><br/>“Lead the way!”<br/><br/>Wang Xian stared at the entrance, his eyes gleaming.<br/><br/>The two fairy dragons immediately led the way respectfully and entered.<br/><br/>“Seeded, Xiao Ai, when did you two girls run out? HMM? There’s someone here. Who Are You?”<br/><br/>“Who are you?”<br/><br/>The two fairy dragons had just entered. The two women who were holding folding fans and wearing long swords were slightly stunned when they saw them. They opened their mouths and spoke. However, their expressions changed drastically when they saw Wang Xian behind them.<br/><br/>“Oh no, there’s something wrong with seed and Xiao Ai!”<br/><br/>At this moment, one of the women sensed the faces of the two fairy dragons. Her pupils constricted and a look of astonishment appeared in her eyes as she shouted loudly.<br/><br/>“Shh!”<br/><br/>A hurried voice was emitted from her body and spread throughout the entire area.<br/><br/>Wang Xian stood there without moving. He scanned his surroundings.<br/><br/>In front of him was a huge space surrounded by lava. There were some buildings inside.<br/><br/>Other than the flames, there was nothing else in the entire environment. It was disadvantageous for survival.<br/><br/>The space was not big, and it was about a hundred kilometers in circumference.<br/><br/>When the woman gave an urgent signal, figures rushed out from the buildings in front of them.<br/><br/>Their faces were extremely solemn.<br/><br/>“Roar Roar Roar!”<br/><br/>In the center of the building, a dragon’s roar sounded. An Earth God dragon that was more than 10,000 meters long flew out from a building. On the body of the Earth God Dragon stood two figures.<br/><br/>One was a familiar figure in a white dress, and the other was a woman with a human body and a dragon tail.<br/><br/>They were also staring at the front with an extremely solemn expression.<br/><br/>However, when the lady in the white dress looked at the figure standing at the entrance, her body trembled.<br/><br/>Whoosh! Whoosh! Whoosh<br/><br/>“Who are you?”<br/><br/>“Who are you?”<br/><br/>Thousands of women from the Fairy Dragon Clan flew over quickly. They surrounded Wang Xian and stared at him. Their faces were filled with vigilance and killing intent.<br/><br/>In the Milky Way, humans were their enemies!<br/><br/>Wang Xian ignored them. He stared at the beautiful figure and felt a familiar aura.<br/><br/>“Speak, who are you? What did you do with Xiao Ai’s seed?”<br/><br/>In the middle, an old woman asked Wang Xian with an embarrassed expression.<br/><br/>Her eyes were filled with killing intent.<br/><br/>“Roar!”<br/><br/>At this moment, the Earth God Dragon who flew over suddenly trembled when he felt Wang Xian’s aura. The broken connection seemed to be reconnected.<br/><br/>Wang Xian looked at the Earth Divine Dragon and the beautiful figure. A smile appeared on his face.<br/><br/>He waved his arm and the five elements millstone appeared in his hand. It floated towards the sky.<br/><br/>“Roar! Roar! Roar!”<br/><br/>The roars of dragons could be heard from the five elements millstone. The figures of the four divine dragons of metal, wood, water, and fire appeared on the Five Elements Millstone.<br/><br/>“Roar! Roar!”<br/><br/>Upon hearing the roars of the divine dragons on the Five Elements Millstone, the Earth Divine Dragon in front of him raised his head and flew towards the five elements millstone.<br/><br/>On the body of the Earth Divine Dragon, Sun Lingxiu, who had a shocked expression on her face, flew up.<br/><br/>“Roar!”<br/><br/>At this moment, Wang Xian raised his head and let out a dragon’s roar. He transformed into the body of the Divine Dragon.<br/><br/>The body of the Divine Dragon, which was more than 20,000 meters in size, emitted an eight-colored glow. It was a powerful Dragon’s might and a divine body.<br/><br/>“This… This Is?”<br/><br/>In front of him, all the members of the Fairy Dragon Clan were looking at this scene in shock.<br/><br/>They were looking at the divine dragon that was filled with divine might.<br/><br/>Wang Xian swayed his body and flew towards the beautiful figure above.<br/><br/>“Xiao Xian!”<br/><br/>The beautiful white figure couldn’t help but shout in a low voice with a hint of tears in her eyes.<br/><br/>Wang Xian’s body swayed as his dragon body hovered in the middle. His dragon eyes were staring at her.<br/><br/>“Lingxiu, it’s been more than ten years. It’s been more than ten years. I’ve finally found you.”<br/><br/>The eight-colored figure gradually became illusory. Wang Xian transformed into his human form and stood beside Sun Lingxiu. His face was filled with excitement.<br/><br/>“Xiao Xian!”<br/><br/>Sun Lingxiu pounced over directly. Her face was filled with joy.<br/><br/>Wang Xian hugged her and was extremely excited.<br/><br/>They had finally met after more than ten years.<br/><br/>“What… What’s going on?”<br/><br/>At the position below, Wang Xian withdrew his rule. Xiao Ai, seeded, and the rest who had recovered looked up in a daze. Their faces were filled with shock.<br/><br/>“Is that Miss Sun’s Man?”<br/><br/>When the members of the Fairy Dragon Clan saw this scene, they were also stunned.<br/><br/>They were shocked by the eight-colored divine dragon and the big mill that was suspended in the sky.<br/><br/>On the Big Mill, the Earth Divine Dragon, who had been helping them, was entrenched together with a few other divine dragons. The five elemental powers had completely fused together, and waves of powerful aura came from above.<br/><br/>“Seeded, Little Ai, What’s Going On?”<br/><br/>Seeing the two people hugging each other, the Fairy Dragon Clan looked at seeded Little Ai and Little Ai, who were dumbfounded, and walked over to ask.<br/><br/>“Elder, I… I went out to play with seeded, but I was attracted by a little fish who has the bloodline of a divine dragon. In the end, he… He caught us. Then, we felt that we were controlled by him, so we brought him here.”<br/><br/>Xiao Ai lowered her head and said weakly.<br/><br/>Although they knew that they had done wrong, they didn’t dare to lie in this situation.<br/><br/>Moreover, looking at the situation in front of them, it might not be a bad thing.<br/><br/>“You…”<br/><br/>Several women glared at the two girls and looked at the sky with sparkling eyes.<br/><br/>“Miss Sun said that she came from a divine dragon force. Her husband is the leader of this force. Is it him? What Pure Divine Dragon Bloodline.”<br/><br/>Everyone from the Fairy Dragon Clan looked over in astonishment.<br/><br/>“Alright, stop crying!”<br/><br/>After hugging for five minutes, Wang Xian patted Sun Lingxiu’s shoulder and said softly.<br/><br/>“Yeah, I was just too excited. I knew that one day, you would come and look for me, Xiao Xian.”<br/><br/>Sun Lingxiu nodded and said with red eyes.<br/><br/>“Of course.”<br/><br/>Wang Xian smiled.<br/><br/>Sun Lingxiu wiped her tears and looked at the lady beside her. She smiled and said, “Xiao Xian, let me introduce you. This is the leader of the Fairy Dragon Clan, Xian Lingyuan.”<br/><br/>“Sister Lingyuan, this is Xiao Xian, my husband.”<br/><br/>“Hello, my name is Wang Xian.”Wang Xian looked at the leader of the Fairy Dragon clan and extended his hand. “Thank you for taking care of Lingxiu during this period of time.”<br/><br/>“Hello, Lingxiu is the one who took care of us. Without her, our fairy dragon tribe would have been wiped out!”<br/><br/>Xianlingyuan shook her head. She extended her hand and looked at Wang Xian with a twinkle in her eyes. “Lingxiu, let’s talk inside!”<br/><br/>“Yes, Alright!”<br/><br/>Sun Lingxiu nodded her head with a face full of joy and looked at Wang Xian.<br/><br/>Wang Xian smiled and waved his arm. The five elements Millstone flew towards him.<br/><br/>“Lingxiu, this Earth Divine Dragon…”<br/><br/>Fairy Dragon tribe leader Xian Lingyuan looked at the five elements millstone in astonishment. She opened her mouth as she looked at the figure of the Earth Divine Dragon.<br/><br/>“This Earth Divine Dragon is a special clone of mine.”<br/><br/>Wang Xian said with a smile.<br/><br/>“Special clone?”<br/><br/>Xian Lingyuan was extremely shocked.<br/><br/>She knew that the Earth Divine Dragon was a real divine dragon.<br/><br/>Unexpectedly, it was just a clone of him.\t\t\t\t\t\t</div>", "images": {}, "success": true}