{"id": 77, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15072055.html", "title": "Chapter 3068 - Chapter 3068: 3067 Was Hunting The Blazing Turtle Winged Beast", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 3068 - Chapter 3068: 3067 Was Hunting The Blazing Turtle Winged Beast</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 3068: 3067 was hunting the blazing turtle winged beast<br/><br/>“There’s a universe knight level dire beast in the volcano region?”<br/><br/>Wang Xian frowned slightly when he heard the report from Xian Lingyuan and the rest.<br/><br/>Even if he encountered a universe knight level existence, he had to be careful. If he was attacked first, Wang Xian might even die there.<br/><br/>“Yes, Dragon King. There’s a universe knight level dire beast in the volcano region. However, that dire beast isn’t too brutal. It lives under the largest volcano in the center. If we don’t provoke it, it probably won’t attack us.”<br/><br/>“Moreover, it has been sleeping for hundreds to thousands of years. We have not seen its true body.”<br/><br/>Xian Lingyuan said.<br/><br/>“Is the race of the Pinnacle God Emperor desolate beast that you mentioned far from that Universe Knight Desolate Beast? There are a few pinnacle god Emperor desolate beasts.”<br/><br/>Wang Xian continued to ask Xian Lingyuan and the rest.<br/><br/>“According to the information we have, there are three of them. We are not sure if there are more. They are very far from the universe knight level desolate beast. In fact, no desolate beast dares to approach the center.”<br/><br/>“Some human powerhouses do not dare to approach the center either. They are afraid of offending the desolate beast of the universe knight level.”<br/><br/>Xianlingyuan and the rest said.<br/><br/>“Three of them. We can deal with them.”<br/><br/>Wang Xian’s eyes sparkled. He looked at the three elder fairies and said, “Follow me. We will exterminate the desolate beast race.”<br/><br/>“It’s the Dragon King!”<br/><br/>The three fairy dragon elders nodded their heads.<br/><br/>Now that they had joined the dragon palace, they understood that as long as they had the resources, the members of the Dragon Palace would be able to improve rapidly.<br/><br/>This improvement was extremely heaven-defying to them. It was extremely… Unreasonable.<br/><br/>“Let’s go. Let’s move immediately.”<br/><br/>Wang Xian stood up and said to them.<br/><br/>“Yes!”<br/><br/>Xianlingyuan and the rest nodded and followed behind Wang Xian.<br/><br/>“Dragon King, aren’t we bringing some of our men over?”<br/><br/>When they arrived at the teleportation formation, Xianlingyuan asked Wang Xian in puzzlement.<br/><br/>“There’s no need. The few of us are enough.”<br/><br/>Wang Xian smiled and stepped into the teleportation formation. He went straight to the Dragon Palace in the volcano region.<br/><br/>When he came to the Milky Way, it wasn’t that he didn’t think of building a dragon palace here. However, considering that there were too many powerful aquatic creatures here and he was too weak, he gave up on this idea.<br/><br/>The Dragon Palace in the volcano region was very safe and convenient.<br/><br/>“Dragon King, the blazing turtle winged beasts are very far away from us. We will need to fly for about a day.”<br/><br/>The volcano region was very big. When Wang Xian and the rest flew out of the Dragon Palace, Xian Lingyuan pointed in a direction.<br/><br/>“I’ll lead you guys. You guys point the way.”<br/><br/>Wang Xian said to them. He spread his incipient saint wings and enveloped them.<br/><br/>“This way!”<br/><br/>Xianlingyuan pointed in a direction. Wang Xian moved and flew toward the blazing turtle winged beast at a terrifying speed.<br/><br/>Wang Xian’s combat strength had increased to the peak of the Celestial Emperor Realm, and his speed had also reached a terrifying level.<br/><br/>His speed was comparable to that of an ordinary universe knight.<br/><br/>He moved his body slightly and charged into the crack in the void.<br/><br/>“With your speed, Dragon King, we should be able to reach the territory of the blazing turtle winged beast in more than an hour.”<br/><br/>A Fairy Elder, elder long, said in shock.<br/><br/>Wang Xian revealed a faint smile on his face as he sped up.<br/><br/>When he entered the spatial crack, there was no resistance, flames, or seawater. Everything was pitch-black.<br/><br/>Wang Xian used his dragon eyes to penetrate the space and sense the direction.<br/><br/>An hour later, Wang Xian stopped and returned to the outside of the universe. He scanned his surroundings.<br/><br/>“Dragon King, it should be in that direction. I’ve only been here once.”<br/><br/>A Fairy, elder long, looked to the right and said.<br/><br/>“HMM, with our strength, we don’t have to worry.”<br/><br/>Wang Xian nodded his head and flew straight to the right.<br/><br/>“Woo Woo Woo!”<br/><br/>When he had just flown for a minute, he suddenly felt a sound coming from below. It was accompanied by an attack that was heading towards them.<br/><br/>“Huh?”<br/><br/>Wang Xian was slightly stunned. He looked down and saw a ferocious-looking desolate beast with thick fiery red wings and a turtle shell heading towards them.<br/><br/>“Blazing Turtle Winged Beast!”<br/><br/>Wang Xian waved his arm and the five elements grinding mill was sent downwards.<br/><br/>Boom<br/><br/>The blazing turtle winged beast was suppressed instantly. The five elements energy sealed it tightly.<br/><br/>“It’s a level seven divine emperor blazing turtle-winged beast.”<br/><br/>Beside him, Xian Lingyuan spoke.<br/><br/>“I didn’t expect it to hide so deeply. Even we didn’t sense it.”<br/><br/>Wang Xian said in surprise.<br/><br/>“Dragon King, this is the nest of the blazing turtle-winged beast. They are almost completely integrated with the lava here. It’s very difficult to sense them.”<br/><br/>A Fairy Dragon Elder said in a deep voice, “If the blazing turtle winged beasts at the peak of the Celestial Emperor level were to hide, it would be even harder for us to discover them. This is already the territory of the blazing turtle winged beasts.”<br/><br/>“There’s still some trouble!”<br/><br/>Wang Xian narrowed his eyes slightly. After hesitating for a moment, he waved his arm and a large amount of dragon blood condensed into an arowana.<br/><br/>The arowana swayed its body and swam forward quickly.<br/><br/>“Ninety percent of the creatures are unable to get rid of the temptation of the Divine Dragon’s fresh blood. Since such an arowana has appeared in the bottom of the blazing turtle winged beasts, they won’t be too vigilant.”<br/><br/>An elder of the fairy dragon said with a smile.<br/><br/>Wang Xian nodded his head and controlled the arowana with his mind to swim quickly.<br/><br/>“Woo Woo!”<br/><br/>“Woo Woo!”<br/><br/>Soon, one blazing turtle winged beast after another flew out from the lava below. They stared at the arowana with a burning gaze and chased after it rapidly.<br/><br/>The movements of some blazing turtle winged beasts attracted the attention of the other blazing turtle winged beasts. Soon, within a radius of a billion kilometers, many blazing turtle winged beasts chased after the arowana in a frenzy.<br/><br/>“One of the level nine celestial thearch, and the remaining four hundred blazing turtle winged beasts.”<br/><br/>Wang Xian’s eyes sparkled. With a wave of his arm, the five elements grinding mill attacked the blazing turtle winged beasts one by one.<br/><br/>“Woo Woo Woo!”<br/><br/>“Woo Woo Woo Woo!”<br/><br/>The group of blazing turtle winged beasts were threatened. They raised their heads and let out muffled sounds. The sounds spread to the surroundings.<br/><br/>“Not good, Dragon King. They are calling for help.”<br/><br/>At the side, Fairy Dragon and the other four spoke with vigilance.<br/><br/>“It’s alright. Get ready to make a move!”<br/><br/>Wang Xian squinted his eyes slightly and scanned the surroundings.<br/><br/>He could sense waves of terrifying aura charging towards him.<br/><br/>Three of them had abnormally terrifying auras. They were definitely existences at the peak of the Divine Emperor Realm.<br/><br/>“Woo Woo!”<br/><br/>Very soon, an incomparably huge figure appeared in Wang Xian’s line of sight.<br/><br/>It was at least 10,000 meters in size and had four gigantic wings on both sides.<br/><br/>Its entire body was emitting flames while its turtle shell was emitting a crimson glow.<br/><br/>A scorching aura rushed over.<br/><br/>“I’ll kill one first. You guys stop the other two.”<br/><br/>Wang Xian’s eyes were glowing. With a move of his body, he disappeared instantly.<br/><br/>The next moment, his figure appeared in the sky above the blazing turtle winged beast at the peak of the Celestial Emperor Realm!\t\t\t\t\t\t</div>", "images": {}, "success": true}