{"id": 73, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15072047.html", "title": "Chapter 3064 - Chapter 3064: 3063 Encounter, Fairy Dragon Clan 2", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 3064 - Chapter 3064: 3063 Encounter, Fairy Dragon Clan 2</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 3064: 3063 encounter, Fairy Dragon Clan 2<br/><br/>“Tame!”<br/><br/>More than 200 celestial emperor-level dire beasts were captured in one go, four of which were celestial emperor-level rank-8.<br/><br/>After his strength increased, the dragon aura on Wang Xian’s body became stronger, and his taming speed increased by a lot.<br/><br/>Ten days later, Wang Xian went fishing for the second time.<br/><br/>His luck was not as good as the previous time, but there was still a celestial emperor-level rank-8 dire beast.<br/><br/>This gave Wang Xian a pleasant surprise. At this speed, in less than two months, one of the eight-limbed demonic fiend and the rest would be able to raise their combat strength to the peak of the Divine Emperor Realm.<br/><br/>“If I’m lucky, I can capture a few level nine divine emperor dire beasts. Perhaps, both of them will be able to raise their combat strength to the peak of the Divine Emperor Realm.”<br/><br/>Wang Xian mumbled to himself as he tamed the dire beast he fished for the second time. He waved his fishing rod and the dragonfish formed from Dragon Blood swam rapidly below.<br/><br/>…<br/><br/>“Seed, it’s not good for us to sneak out. If we encounter humans and powerful desolate beasts, we will be in trouble.”<br/><br/>“Xiao Ai, what are you afraid of? I brought Uncle Tu’s dragon scale this time. The pressure on it is enough to stop the desolate beasts at the peak of the Celestial Emperor Realm from attacking us. Furthermore, we are only going to get some food. The Milky Way is so big, how can we meet humans so easily?”<br/><br/>At the same time, at a spot not far from Wang Xian, under the Milky Way, two demon beasts were conversing.<br/><br/>The Demon Beasts looked very strange. They had the upper body of a human, but the lower body was a dragon tail.<br/><br/>Their faces looked very beautiful. Their round eyes were looking at their surroundings. Clearly, they were very excited.<br/><br/>“Alright then. I will suffocate if I stay down there all day. The aura of this volcano region is so uncomfortable.”<br/><br/>A figure on the left also nodded excitedly.<br/><br/>“Quick, quick, let’s go get some fruits to eat. We haven’t eaten delicious food for a long time. It’s all the fault of those hateful humans.”<br/><br/>As the other figure spoke, the two of them quickly swam forward.<br/><br/>“Oh? Seed, look ahead. There are many desolate beasts and two eighth level divine emperors. Why are there so many desolate beasts gathered there?”<br/><br/>At this moment, Xiao Ai on the left sensed the movement ahead. She extended her finger in surprise. Suddenly, her eyes lit up as she shouted, “Look, why is there a blood-red fish over there?”<br/><br/>“Oh? That’s true. That group of desolate beasts are all attracted by this blood-red fish. Let’s go and take a look.”<br/><br/>The seed on the right swayed its dragon tail and immediately went over.<br/><br/>“Be careful, there’s an eighth level divine emperor desolate beast over there!”<br/><br/>“What’s there to be afraid of? We have uncle Tu’s dragon scales. A eighth level divine emperor desolate beast would not dare to attack us.”<br/><br/>As they spoke, they flew forward curiously.<br/><br/>“Can you feel it? Seed, why do I feel an attraction from the bloodline? What is that?”<br/><br/>“It’s the Divine Dragon Bloodline, it’s the Divine Dragon Bloodline. Xiao Ai, that’s a fish with the divine dragon bloodline. Why does that red fish contain such a thick divine dragon bloodline?”<br/><br/>The two of them widened their eyes and looked at each other, their eyes burning with passion.<br/><br/>“This… can this be a bait for fishing? Humans often use some treasures to fish. Is this fish a little strange?”<br/><br/>“The bloodline of the Divine Dragon. Who would be willing to use such a precious treasure as bait? It should be the bloodline of this small fish returning to its ancestor.”<br/><br/>“It’s possible. Let’s catch it. When we go back, we’ll let the clan leader, Uncle Tu, and sister Sun take a look.”<br/><br/>The two of them conversed and quickly chased after the arowana, flying upwards.<br/><br/>“Hualala!”<br/><br/>However, at this moment, chains suddenly extended from above. The speed of the chains was abnormally terrifying. Even a divine emperor level eight desolate beast was instantly bound.<br/><br/>“Not good!”<br/><br/>When seeded and Xiao Ai saw the chains that suddenly appeared, their expressions changed greatly.<br/><br/>It was over!<br/><br/>Looking at the chains that had appeared in an instant, they did not have the ability to resist at all. The terrifying power directly restrained them.<br/><br/>“Use Uncle Tu’s dragon scales to resist. We will immediately escape back to our own divine kingdom.”<br/><br/>Xiao ai shouted with a horrified expression.<br/><br/>“No, this chain has a terrifying power. Uncle Tu’s dragon scales are useless.”<br/><br/>Zi Zi roared in despair.<br/><br/>“Splash!”<br/><br/>The next moment, their bodies were pulled out of the water and mixed with the desolate beasts.<br/><br/>“Bang!”<br/><br/>Their bodies were thrown onto the water. Their faces turned pale as they looked around in panic.<br/><br/>“Huh?”<br/><br/>At this moment, Wang Xian’s gaze swept across the group of desolate beasts that were captured. He was slightly stunned when he saw two creatures that had the upper body of a human.<br/><br/>“Asian Dragons!”<br/><br/>“And those dragon scales.”<br/><br/>Wang Xian narrowed his eyes slightly and sized up the two Asian Dragons.<br/><br/>He waved his arm and the two Asian Dragons flew directly towards him.<br/><br/>“No, don’t Kill Us.”<br/><br/>Xiao Ai and seeded looked at Wang Xian in horror as their bodies trembled.<br/><br/>They realized that they were in danger this time.<br/><br/>Wang Xian looked at them and reached out his hand to grab the dragon scales on their bodies. An extremely familiar feeling was transmitted over.<br/><br/>“This is?”<br/><br/>His eyes sparkled. This familiar feeling was connected to him by blood.<br/><br/>The earthy yellow dragon scales were connected by blood… The Earth God Dragon.<br/><br/>“Where did you get these dragon scales?”<br/><br/>Wang Xian stared at them and asked with some excitement in his eyes.<br/><br/>“Yes… yes…”<br/><br/>“We picked them up. Please let us off.”<br/><br/>Feeling the pressure from Wang Xian, Xiao ai seed’s expression changed drastically. Her eyes turned slightly red as she spoke.<br/><br/>Buzz<br/><br/>Wang Xian’s body trembled as the dragon’s might enveloped them. Both of them were only at the first or second stage of the celestial thearch level. They were instantly subdued.<br/><br/>“Speak!”<br/><br/>Wang Xian stared at them and growled.<br/><br/>“These are uncle Tu’s dragon scales.”<br/><br/>Both of their expressions changed as they replied respectfully.<br/><br/>The ruled water tribe had no way of resisting.<br/><br/>“Who is Uncle Tu?”<br/><br/>Wang Xian immediately asked.<br/><br/>“He is Sister Lingxiu’s mount. He is an Earth God dragon with pure bloodline. He is the benefactor of our fairy dragon tribe.”<br/><br/>Both of them replied respectfully.<br/><br/>“Lingxiu!”<br/><br/>Wang Xian’s body trembled when he heard their words.<br/><br/>“Bring me to your place immediately!”<br/><br/>He said hurriedly.<br/><br/>“Yes!”<br/><br/>They nodded and flew in one direction immediately.<br/><br/>Wang Xian waved his arm and recalled all the dire beasts. Then, he followed closely behind the two fairy dragons.<br/><br/>Under their rule, the two fairy dragons did not resist at all. They brought Wang Xian and flew towards the depths of the volcano region.<br/><br/>After flying for half an hour, they arrived at the location of a volcano crater. The two of them took out a circular plate and placed it beside the volcano crater.<br/><br/>At this crater, another entrance appeared.<br/><br/>The two of them immediately flew in.<br/><br/>Wang Xian followed closely behind with slight excitement and anticipation. His eyes were sparkling.<br/><br/>It had been more than ten years. It had been more than ten years.<br/><br/>Following behind them, they entered the crater and continued flying.<br/><br/>They were surrounded by rolling lava. After flying downwards for more than ten minutes, they entered several secret entrances in the middle.<br/><br/>“King, we’re here. It’s right in front!”<br/><br/>The two fairy dragons said respectfully and pointed to an entrance.\t\t\t\t\t\t</div>", "images": {}, "success": true}