{"id": 86, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15072073.html", "title": "Chapter 3077 - Chapter 3077: 3076 Icebergs Had Been Destroyed, Yet They Still Dared To Act So Arrogantly? 3", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 3077 - Chapter 3077: 3076 Icebergs Had Been Destroyed, Yet They Still Dared To Act So Arrogantly? 3</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 3077: 3076 icebergs had been destroyed, yet they still dared to act so arrogantly? 3<br/><br/>“Roar Roar Roar!”<br/><br/>The roars resounded within the Divine Nation of the Twin Divine Emperors. When the water beasts and fire beasts saw the disciples of the Willow deity Daoist sect retreat, they also stopped their attacks.<br/><br/>They guarded the surroundings of the twin divine emperors’coffins as they stared coldly at everyone.<br/><br/>Once someone entered the area, they would launch a fatal attack.<br/><br/>Mi Xin Lu sensed the undisguised gazes from the surroundings. His eyes flickered and he directly transformed into human form.<br/><br/>“Hu, these water beasts should be the weapons that the twin God emperors used to activate the divine kingdom’s power. The weapons at the postnatal numinous treasure level, under the control of the remnant consciousness of the divine kingdom, can erupt with an extremely terrifying attack.”<br/><br/>Senior Martial Brother Junzi retreated some distance back and escaped the attack range of the water beast leader. He said with a solemn expression.<br/><br/>“Are you all right, Junior Sisters?”<br/><br/>As he spoke, he looked at Mo Xinlu and the others.<br/><br/>“I’m fine. It’s all thanks to junior sister Xinlu’s help.”<br/><br/>That senior sister who had been rescued nodded. She looked at Mo Xinlu with a face full of smiles and was filled with gratitude.<br/><br/>“I truly did not expect that this junior sister has the bloodline of the Divine Dragon. She is a quasi dragon.”<br/><br/>At this moment, Long Zaitian’s eyes flickered as he stared at Mo Xinlu and walked straight towards her.<br/><br/>The other disciples of the Divine Willow Daoist sect looked over and revealed an indescribable expression.<br/><br/>When Mi Xin Lu heard long Zaitian’s voice, she looked towards him. A trace of coldness flashed across her eyes as she directly ignored him.<br/><br/>“Ha Ha, I wonder if junior sister is interested in joining our dragon race. If junior sister joins us, I can guarantee that no one will dare to bully you.”<br/><br/>Long Zaitian saw that she did not pay attention to him, nor did he care. He sized her up with a smile and continued, “Otherwise, with the Divine Dragon Bloodline, junior sister would be coveted by many races.”<br/><br/>His smile carried a hint of warning, causing Mo Xinlu’s expression to change slightly.<br/><br/>“You don’t need to worry about this.”<br/><br/>She said coldly.<br/><br/>“With the protection of our Senior Sisters and senior brothers of the Willow deity Daoist sect, no one dares to Covet Junior Sister Mi Xinlu. Otherwise, she would be our enemy.”<br/><br/>The middle-aged senior sister at the side frowned as she looked at Long Zaitian.<br/><br/>“So what if he moves? That Wang Xian is the enemy of our ice mountain race. Wang Xian’s people are the enemy of our ice mountain race. Young Master Long Zaitian, if you want this Asian Dragon, hand him over to our ice mountain race.”<br/><br/>“It won’t be long before our ice mountain race sends him over to you.”<br/><br/>At this moment, at the back, Bing Ling Hong Tu stared at Mi Xin Lu with a cold expression. He spoke to Long Zaitian and the others in a fawning manner.<br/><br/>Now, all the disciples of the willow deity sect understood long Zaitian’s identity.<br/><br/>Even the peak divine emperor disciples of the dragon-descent race in the willow deity sect were courteous to Long Zaitian. One could imagine his status in the dragon-descent race.<br/><br/>Currently, their ice mountain race was weak in the Divine Willow Daoist sect. If they could curry favor with long Zaitian, it might be a good thing for their ice mountain race.<br/><br/>“You…”<br/><br/>The expression of the middle-aged senior sister next to Mi Xinlu changed. She stared at Bing Ling and Hong Tu with an ice-cold expression.<br/><br/>The few female disciples of the Divine Willow Daoist sect at the side also had displeased expressions on their faces as they stared at the two of them coldly.<br/><br/>“Fellow martial sisters, don’t look at me like that. You should be clear about the hatred between us. This is the grudge between our ice mountain race and them. If anyone tries to stop us, they will become the enemy of Our Ice Mountain Race!”<br/><br/>When Bing Ling Hong Tu saw the group of girls staring at him, he warned them indifferently.<br/><br/>Although there would be quite a number of people standing on the side of the Mi Xin deer, he did not take them to heart at all.<br/><br/>They were just a group of loose sand. They didn’t dare to provoke the ice mountain race.<br/><br/>“Hahaha, the two members of the ice mountain race, if you can talk properly, then talk properly. Threatening is not my style.”<br/><br/>Long Zaitian laughed out loud. He patted Bing Ling and Hong Tu on the side and laughed loudly.<br/><br/>“Yes, yes, but if she doesn’t give young master long Zaitian Face, then we won’t be polite.”<br/><br/>Bing Ling Hongtu’s face showed a fawning expression.<br/><br/>Around them, some people looked at Bing Ling and Hongtu with disdain.<br/><br/>Behind them, a group of disciples from other races looked at them indifferently. Some of them were indifferent, and some of them communicated with each other through voice transmissions.<br/><br/>Many disciples were extremely interested in an inferior dragon.<br/><br/>Dragon Knights were the dreams of many people.<br/><br/>When Mo Xinlu heard their unbridled conversation, an extremely furious expression appeared on her face.<br/><br/>She clenched her fist tightly.<br/><br/>The group of women beside her revealed a sullen expression.<br/><br/>“Alright everyone, we are all disciples of the Willow deity Daoist sect. Let’s settle the matter of the divine kingdom’s spiritual treasure first.”<br/><br/>Senior Brother Junzi opened his mouth and said somewhat helplessly.<br/><br/>“Hehe!”<br/><br/>Just as he finished his sentence, a chuckle was heard. Wang Xian, who had already arrived at the back, walked over slowly.<br/><br/>His gaze swept past Bing Ling, Hong Tu Long, Zai Tian, and the rest. His eyes were filled with awe.<br/><br/>The sudden laughter caused the disciples of the willow deity Daoist sect to look over immediately.<br/><br/>When they saw Wang Xian, some of the disciples raised their eyebrows slightly. They crossed their arms and watched the show from the side.<br/><br/>“Brother Wang!”<br/><br/>When Mi Xinlu saw Wang Xian, he was pleasantly surprised. He immediately ran over.<br/><br/>“This guy…”<br/><br/>Bing Linghong Tu and the rest could feel Wang Xian’s cold expression. Their faces were filled with fear.<br/><br/>They no longer had any fallen leaves on them. If he were to attack them, they would not be able to escape at all.<br/><br/>“Don’t worry.”<br/><br/>Beside Long Zaitian, an old man gently patted Bing Linghong Tu’s shoulder.<br/><br/>“Yes, yes. Thank you, senior brother.”<br/><br/>Seeing the old man’s relieved expression, Bing Linghong Tu and the others revealed smiles on their faces.<br/><br/>In the willow deity Daoist sect, there were not many disciples at the peak of the Divine Emperor Realm. There were only a few of them. and the dragon race had experts at the peak of the divine emperor realm in the Willow deity Daoist sect.<br/><br/>If the dragon race were to stand on their side, they wouldn’t be in any danger.<br/><br/>“I just heard that the ice mountain race wants to deal with you.”<br/><br/>Wang Xian nodded at Mo Xinlu and walked straight towards Bing Linghong Tu and the rest with a faint smile on his face.<br/><br/>“They are not good people.”<br/><br/>Mo Xinlu said softly and followed closely behind him.<br/><br/>Wang Xian walked forward and stopped ten meters away from Bing Linghong Tu and the rest.<br/><br/>“Did you guys say that?”<br/><br/>He raised his head and stared at Bing Linghong Tu and Long Zaitian.<br/><br/>“So what if we said it?”<br/><br/>Bing Linghong Tu’s expression changed as he faced the powerful Wang Xian. Long Zaitian smiled at them.<br/><br/>Bing Linghong tu was a little confident. He gritted his teeth and said coldly.<br/><br/>“Haha, interesting. Your Ice Mountain Race has been exterminated and you still dare to be so arrogant. Who gave you the courage?”<br/><br/>Wang Xian looked at them and asked with a smile.<br/><br/>“Eh? The Ice Mountain race has been exterminated?”<br/><br/>“The ice mountain race has been exterminated? That’s impossible, right?”<br/><br/>“What’s going on? Is this for real?”<br/><br/>The surrounding disciples of the Willow deity Daoist sect were slightly shocked when they heard Wang Xian’s words. Their faces were filled with doubt.\t\t\t\t\t\t</div>", "images": {}, "success": true}