{"id": 82, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15072065.html", "title": "Chapter 3073 - Chapter 3073: 3072 Icebergs 3", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 3073 - Chapter 3073: 3072 Icebergs 3</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 3073: 3072 icebergs 3<br/><br/>“Clan leader, why did you call us here in such a hurry?”<br/><br/>Five days later, in the main hall of the icebergs, five old men walked in.<br/><br/>“It’s a good thing. I’ve invited an old friend of mine to help us kill that fellow. With this friend of mine helping us, we’ll definitely be able to kill him easily!”<br/><br/>Within the main hall, Octaqi saw them walk in and said with a face full of laughter.<br/><br/>“Oh?”<br/><br/>A few protectors and acting wizards raised their brows slightly.<br/><br/>Ever since that guy escaped from the ambush last time, they had yet to lock onto that guy’s figure.<br/><br/>According to the acting wizards’guesses, it was because he was inside the willow deity Daoist sect.<br/><br/>Venerable Willow Deity’s aura concealed his lock on him.<br/><br/>They did not expect the patriarch to actually find an old friend at this time.<br/><br/>They had never heard of this old friend.<br/><br/>“This is?”<br/><br/>However, they soon noticed a figure covered in strange scales on one side.<br/><br/>The figure’s body contained a terrifying aura. It could be seen that he was also a peak divine emperor expert.<br/><br/>However, what surprised them was that there was a war pet behind him.<br/><br/>It was a war pet that was only 10 meters in size. It had a turtle shell and four fleshy wings. It exuded a terrifying aura.<br/><br/>They could recognize this war pet at a glance. It was a turtle-winged beast at the peak of the Celestial Emperor Realm.<br/><br/>To be able to possess a war pet at the peak of the Celestial Emperor realm, this person was definitely not simple.<br/><br/>The few protectors of the ice mountain race were shocked.<br/><br/>“Hello, my friend!”<br/><br/>The few protectors said politely.<br/><br/>“Yes, Hello Everyone!”<br/><br/>The figure covered in dragon scales was naturally Wang Xian.<br/><br/>Now, he had the ability to change his aura. After a few days, they had prepared this plan.<br/><br/>Moreover, the better thing was that it could increase the combat strength of a peak divine emperor, the blazing turtle winged beast.<br/><br/>It was a war pet that Wang Xian had tamed.<br/><br/>“Hahaha, come, come, come, come. You should take a seat as an acting wizard. Let’s discuss the next plan.”<br/><br/>Ba Qi laughed out loud and gestured to them with his hand.<br/><br/>“Alright!”<br/><br/>The acting wizard nodded and sat at the side.<br/><br/>The four protectors also walked to the side.<br/><br/>Wang Xian watched as the acting wizard approached him. He looked at the Ba Qi Fiend and the rest with a smile on his face.<br/><br/>Boom<br/><br/>The next moment, his palm transformed into a dragon claw and attacked the Sorceress.<br/><br/>The terrifying attack and speed instantly entered the Sorceress’body.<br/><br/>There was no room for him to react.<br/><br/>Clang<br/><br/>Puff! Puff<br/><br/>Roar! Roar<br/><br/>At the side, the eight-limbed demonic fiend suddenly attacked. In an instant, the eight-limbed demonic fiend pulled out the frost divine sword in his hand and slashed at one of the protectors beside him.<br/><br/>The sudden attack and the Frost Divine Sword’s terror directly destroyed him!<br/><br/>Mo Sha’s claws similarly broke through the parasitic body and directly pierced through a protector. Black sharp claws drilled out from all parts of that Protector’s body.<br/><br/>The blazing turtle winged beast suddenly charged at an ice mountain race protector. Its savage head directly bit off more than half of its body.<br/><br/>However, the peak-stage divine Emperor Protector’s body seemed to have lost its luster. With a face full of shock, he gave up half of his body and dodged to the back.<br/><br/>In a split second, two peak-stage divine emperor experts were killed in an instant. One peak-stage divine emperor expert was severely injured.<br/><br/>When Wang Xian’s dragon claw pierced through the acting wizard, he frowned slightly.<br/><br/>The Acting Heaven Mirror on the acting wizard’s body collapsed. The Acting Heaven Mirror seemed to have a mysterious energy and blocked one of his fatal attacks.<br/><br/>The magician appeared at the entrance of the main hall. His face was pale and filled with fear.<br/><br/>“Clan leader, what are you doing?”<br/><br/>The only three guardians of the giant sword who was not attacked revealed a shocked expression when they saw this sudden scene.<br/><br/>He roared in disbelief.<br/><br/>“What are you doing? Didn’t you want to kill me?”<br/><br/>At this moment, the dragon scales on Wang Xian’s face disappeared, revealing his original appearance. A cold expression appeared on his face.<br/><br/>His gaze was locked onto the acting wizard and was filled with killing intent. “Today is the day your ice mountain race is exterminated.”<br/><br/>“Keke Keke, you dare to Kill Our Dragon King? All of you will die today!”<br/><br/>The eight-limbed demon and the demonic fiend emerged from the parasitic body. Their eyes were filled with violent killing intent.<br/><br/>They did not hesitate at all. In an instant, they attacked the three guardians of the giant sword and the severely injured guardian.<br/><br/>“How did this happen? When did you kill the clan leader and the rest?”<br/><br/>The three guardians of the giant sword roared in astonishment. They were filled with disbelief.<br/><br/>When they were chasing after that Wang Xian, the other party had actually killed the clan leader and the rest.<br/><br/>He had actually entered the body of the clan leader to ambush them!<br/><br/>All of this made him feel a chill down his spine.<br/><br/>“Stop, what happened between you guys has nothing to do with me!”<br/><br/>Seeing that Wang Xian was attacking him at a terrifying speed, the magician roared in fear.<br/><br/>His speed was too fast!<br/><br/>“You were among the people who ambushed me last time. Let’s see how many times you can dodge my fatal attacks!”<br/><br/>“Dragon Eye Lock!”<br/><br/>Wang Xian roared with a face full of killing intent. Numerous chains covered the entire hall in an instant, enveloping everyone within.<br/><br/>“PFFT!”<br/><br/>The distance was too close, so close that it was only a few hundred meters.<br/><br/>Before he could finish his sentence, Wang Xian’s dragon claws pierced through the body of the magician once again.<br/><br/>“No, no, no!”<br/><br/>As he felt his life force disappearing rapidly, his face was filled with despair and unwillingness.<br/><br/>He had never expected such an outcome.<br/><br/>He had only come to help the ice mountain race deal with a ninth level divine emperor fellow.<br/><br/>What he thought was an extremely easy matter had never thought that it would cost him his life.<br/><br/>“Run, run, run!”<br/><br/>On the other side, the heavily injured protector roared in horror.<br/><br/>“We can’t escape.”<br/><br/>The third Protector’s eyes were blood-red as he felt the chains around him. His face was filled with madness.<br/><br/>“Let’s fight it out with them. Kill, Kill, Kill!”<br/><br/>“Divine kingdom, descend!”<br/><br/>He roared crazily as his body shook, summoning his divine kingdom.<br/><br/>Summoning his divine kingdom also unexpectedly caused him to give up on the idea of returning to his divine kingdom in an instant. He was prepared to fight with his life.<br/><br/>If he could fight his way out, he would have the chance to escape.<br/><br/>If he could not, then he would die completely.<br/><br/>“Boom! Boom! Boom!”<br/><br/>The three guardians of the Greatsword Divine Kingdom descended unbridled, causing the largest ice mountain to roar.<br/><br/>The majestic divine kingdom descended in the sky, shaking the entire ice mountain race.<br/><br/>On the Ice Mountain, all the clansmen saw the sudden appearance of the divine kingdom, and their faces were filled with shock.<br/><br/>“What happened?”<br/><br/>“What’s going on? Why did a divine kingdom suddenly appear?”<br/><br/>The disciples of the ice mountain race shouted in shock.<br/><br/>To have their divine kingdom appear, such a thing had never happened before.<br/><br/>Everyone knew what it meant to have a divine kingdom appear.<br/><br/>“Quick, let’s go and take a look.”<br/><br/>The expressions of the experts of the ice mountain race changed, and they immediately flew over.\t\t\t\t\t\t</div>", "images": {}, "success": true}