{"id": 88, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15072077.html", "title": "Chapter 3079 - Chapter 3079: 3078, Seizing Treasures And Killing People", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 3079 - Chapter 3079: 3078, Seizing Treasures And Killing People</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 3079: 3078, seizing treasures and killing people<br/><br/>“Roar! Roar! Roar!”<br/><br/>When the leaders of the water and fire beasts saw the group of leaders who were attacking them, their faces revealed an extremely violent aura.<br/><br/>Their bodies trembled as terrifying blades and swords rotated around them.<br/><br/>They raised their heads as long blades and swords attacked Wang Xian and the rest directly.<br/><br/>“Pilipala!”<br/><br/>“Roar! Roar! Roar!”<br/><br/>Long youfeng’s body trembled as he waved his arm forward. There was a purple divine weapon on his arm as he charged forward.<br/><br/>A lightning dragon appeared and attacked the Blades and swords in front of him.<br/><br/>At the side, the elder who was holding the strange divine tree, the elder from the skeleton clan who was clad in a black robe, and the senior brother of the gentleman all attacked at the same time.<br/><br/>Streams of terrifying energy collided with the attacks of the leader of the water beasts and fire beasts.<br/><br/>Boom! Boom! Boom<br/><br/>The entire space exploded immediately. The terrifying energy gathered at the center of the space, preventing anyone from advancing.<br/><br/>“Roar! Roar!”<br/><br/>At this moment, two roars were heard. The leader of the water beasts and Fire Beasts, who was originally twenty meters in size, transformed into a thousand meters in size. They brought along the sharp edge of blades and swords as they attacked them directly.<br/><br/>Wang Xian waved his arm and a huge, grayish dragon claw attacked the leader of the fire beasts.<br/><br/>“Roar!”<br/><br/>The fire blades around the fire beast revolved and slashed directly at Wang Xian’s Dragon Claw. The terrifying fire blade radiance caused the Dragon Claw to collapse rapidly.<br/><br/>It leaped and opened its mouth. Flames covered the area in front of it.<br/><br/>Wang Xian sensed the terrifying attack and raised his eyebrows slightly.<br/><br/>He moved and dodged immediately.<br/><br/>On the other hand, senior brother Junzi and the rest also retreated immediately. The attacks of the two leaders of the water beasts and fire beasts were too powerful.<br/><br/>“HMPH, without the control of the Gemini Celestial Thearch, we are only using the remaining power of the divine kingdom. Everyone, don’t hold back anymore!”<br/><br/>The old man in the black robe looked at the water beasts and fire beasts. His eyes scanned the surroundings and revealed a cold expression.<br/><br/>“Bloom!”<br/><br/>The old man holding the strange divine tree raised his head and threw the divine tree in his hand into the air.<br/><br/>Branches appeared out of thin air and attacked the leader of the Fire Beast and fire beast. At the same time, the branches condensed and formed a hole. The hole was connected to the coffin.<br/><br/>“Thunder Beast Roar!”<br/><br/>Long Youfeng saw that someone had used his strength, so he didn’t hide it anymore. He waved his hands and the Thunder Beasts flew out of his arms and attacked the leader of the Water Beast and fire beast.<br/><br/>“Gentleman, unparalleled!”<br/><br/>Senior gentleman shook the longsword in his hand and a longsword appeared under his body. The countless longswords around him condensed into a long dragon and attacked the leader of the Water Beasts and fire beasts as well.<br/><br/>“Skeleton, Eternal!”<br/><br/>The black-robed old man waved his arm and a black skull appeared. blood-red flames bloomed in the position of his pupils.<br/><br/>“Five Elements River!”<br/><br/>Wang Xian followed their attack. With a wave of his arm, a grayish destructive force swept across the area.<br/><br/>In an instant, the terrifying attacks of the five of them covered the leaders of the water beasts and fire beasts.<br/><br/>“Huala, the acquired spiritual treasure is mine!”<br/><br/>At this moment, a pair of flesh wings suddenly appeared on the body of the dragon in the sky. The flesh wings flickered with the power of lightning. At this moment, his speed was abnormally terrifying.<br/><br/>Around him, a lightning symbol was suspended above his head. It looked extremely mystical.<br/><br/>“Eh?”<br/><br/>However, at this moment, a throb came from within Wang Xian’s body. It was an extremely powerful attractive force.<br/><br/>His face immediately looked towards the fleshy wings of dragon in the sky.<br/><br/>“This is?”<br/><br/>His eyes flashed with a fiery glow. This was the aura of the Holy Feather.<br/><br/>The aura of the thunder-attributed holy feather. The dragon in the sky had the thunder-attributed holy feather.<br/><br/>It was a part of the incipient holy wings.<br/><br/>A bright light flashed past. Wang Xian’s eyes sparkled as he looked ahead. The incipient holy wings slowly appeared behind him.<br/><br/>“Roar! Roar! Roar!”<br/><br/>The water and fire beasts met their terrifying attacks. The waves of attacks caused the flames and water currents on their bodies to scatter in all directions.<br/><br/>However, very quickly, the leader of the water beasts and fire beasts slowly turned into a long sword and a long saber.<br/><br/>The long saber and the long sword were filled with killing intent, and they were incomparably resplendent as they directly slashed towards the void.<br/><br/>They didn’t slash towards the group, but instead, they slashed towards the front of the coffin.<br/><br/>A sword scar that looked like a heavenly jellyfish, but only four meters wide, appeared.<br/><br/>“Bang Bang Bang!”<br/><br/>The defensive energy in front of Long Zaitian and his senior brothers clashed with the sword scar.<br/><br/>The defense in front of them quickly crumbled.<br/><br/>“Oh no!”<br/><br/>“What kind of strange attack is This!”<br/><br/>Long Zaitian growled with an extremely ugly expression.<br/><br/>“That’s a supreme sword scar. This acquired Numinous Treasure is called a sword scar.”<br/><br/>At the back, a level nine divine emperor powerhouse from the nine-sword race said with a solemn expression.<br/><br/>“After passing through this defense, we should be able to obtain the acquired Numinous Treasure inside.”<br/><br/>Senior Junzi said with a solemn expression as he watched his sword radiance continuously collapse upon touching the sword and saber scar.<br/><br/>The Water Beast and fire beast underwent a transformation. One sword and one saber slashed out the sword and saber scar, blocking their path.<br/><br/>“This sword and saber scars…”<br/><br/>Just as they stopped, a ray of light flashed across Wang Xian’s eyes.<br/><br/>Buzz<br/><br/>The five elements millstone was floating around him. His body shook and the Yin-yang dragon spun around, covering the five elements millstone.<br/><br/>Whoosh<br/><br/>Flapping his wings, Wang Xian flew toward the sword and saber scars at a terrifying speed.<br/><br/>“Huh?”<br/><br/>Seeing that someone was forcefully breaking through the sword mark, Long youfeng, Long Zaitian, Senior Junzi, and the rest had their eyes focused as they looked over hurriedly.<br/><br/>Crack! Crack! Crack<br/><br/>When Wang Xian rushed over, the yin-yang dragon disc collapsed immediately.<br/><br/>However, the five elements millstone spun and all the energy was converted into the power of the Earth Divine Dragon. The heavy aura of the Earth covered the five elements millstone.<br/><br/>Wang Xian’s palm landed on it.<br/><br/>Eight luminaries dragon scales!<br/><br/>Layers of dragon scales appeared around the five elements millstone. Wang Xian stood on it and continued to attack<br/><br/>“Bang, Bang, Bang!”<br/><br/>The eight luminaries dragon scales started to crumble rapidly. The dragon scales disappeared and the scars from the swords and sabers continued to attack the defense of the Five Elements Millstone.<br/><br/>“Roar!”<br/><br/>A thick and heavy dragon roar was heard from the Five Elements Millstone.<br/><br/>Wang Xian’s eyes were glowing as he flapped his incipient saint wings.<br/><br/>“Crash!”<br/><br/>His figure passed through the sword and saber scars and flew directly towards the sword and saber in front of the coffin.<br/><br/>“Buzz Buzz!”<br/><br/>He came to the front of the sword and Saber. He waved his arm and his palm turned into a dragon claw. He grabbed the sword and saber directly.<br/><br/>“Buzz Buzz Buzz!”<br/><br/>Waves of trembling came over. Wang Xian crossed his arm and waves of dragon shadows coiled around it.<br/><br/>The Dragon Shadows coiled around the sword and saber scars and suppressed them with all their might.<br/><br/>It was a success!<br/><br/>A smile appeared on his face.<br/><br/>“Roar!”<br/><br/>When the sword and saber were kept in his hand, the supreme sword and saber scars disappeared. The transformed sword and Saber of the Water Beast and fire beast leader went straight into Wang Xian’s hand.<br/><br/>“This sword and saber are much stronger than the Frost Divine Sword.”<br/><br/>Wang Xian felt the power coming from the sword and Saber. His heart was burning with passion.<br/><br/>“What!”<br/><br/>“Oh no, he actually managed to obtain the Sword Scar!”<br/><br/>Everything happened in a split second.<br/><br/>At the back, when long you, Long Zaitian, and the rest saw this scene, their expressions changed drastically.\t\t\t\t\t\t</div>", "images": {}, "success": true}