{"id": 83, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15072067.html", "title": "Chapter 3074 - Chapter 3074: 3073 Icebergs 4", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 3074 - Chapter 3074: 3073 Icebergs 4</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 3074: 3073 icebergs 4<br/><br/>“Fight with us. How can your ice mountain race fight with us? Today is the day you will be exterminated!”<br/><br/>In the Central Palace of the largest ice mountain of the ice mountain race, a terrifying energy swept across. Cracks slowly appeared on the entire ice mountain.<br/><br/>Wang Xian stared coldly at the crazy three guardians of the giant sword. His face was filled with a ghastly expression.<br/><br/>After being hunted by the ice mountain race for such a long time, today was the day they had to pay the price.<br/><br/>“Roar! I can’t accept this! I can’t accept this! What faction are you guys from?”<br/><br/>The three guardians of the giant sword roared with a ferocious and despairing look on their faces.<br/><br/>Beside him, the eyes of the guardian whose body was half bitten off by the blazing turtle winged beast flickered. He sized up his surroundings and wanted to flee in fear.<br/><br/>The clan leader and the rest were all killed. Everything was over. What awaited them was the destruction of the ice mountain race.<br/><br/>With the terrifying strength of the other party, if they didn’t escape, they would only die.<br/><br/>He didn’t want to die.<br/><br/>“Go to Hell!”<br/><br/>Wang Xian flapped his uninitiated holy wings and attacked the three protectors with a terrifying speed.<br/><br/>“Keke Keke, don’t even think about escaping.”<br/><br/>The eight-limbed demonic fiend and the rest locked onto the heavily injured guardian of the ice mountain race. Their faces were filled with killing intent.<br/><br/>“Hahaha, if you want to kill me, I will sacrifice a piece of your flesh even if I have to die!”<br/><br/>The eyes of the three guardians of the giant sword revealed their determination to die.<br/><br/>Crack! Crack! Crack<br/><br/>In the sky, the ice mountain began to crumble under the terrifying pressure of his divine kingdom.<br/><br/>“Law Abhijna, Sword Mountain!”<br/><br/>He held the huge sword in his hands tightly and slashed forward.<br/><br/>The terrifying attack did not have any scruples at all. It directly covered a radius of more than a billion kilometers.<br/><br/>“Are you crazy?”<br/><br/>At the side, when the heavily injured protector saw the sword mountain engulfing everyone, including him, his expression changed drastically. He roared in horror.<br/><br/>Unlike the three protectors of the huge sword, he had already lost his fighting spirit.<br/><br/>“Humph!”<br/><br/>Wang Xian saw his attack and the five elements grinding appeared around him. The five elements revolved and condensed into an Earth Dragon.<br/><br/>The earth dragon circled around him and resisted the terrifying attack of the giant sword.<br/><br/>“Bang! Bang! Bang!”<br/><br/>Wang Xian quickly passed through the attack of the Sword Mountain and locked onto the three guardians of the giant sword. His eyes were cold.<br/><br/>“Die! Die! Die!”<br/><br/>“Divine kingdom, frozen sword, Ice Sword World!”<br/><br/>However, when Wang Xian flew over, the three guardians of the giant sword let out an angry roar. In the divine kingdom in the sky, countless ice swords were released and blasted downwards.<br/><br/>“A powerhouse at the peak of the Celestial Emperor realm is risking his life. He is not someone to be trifled with.”<br/><br/>When Wang Xian saw the attacks that covered the entire space, he frowned slightly.<br/><br/>Under such attacks, he couldn’t bring out his speed at all.<br/><br/>However, with the full force of the five elements grinding, the attacks of the three guardians of the giant sword couldn’t hurt him at all.<br/><br/>“Get Closer!”<br/><br/>Wang Xian blocked the attacks of the three guardians of the giant sword and got closer to him bit by bit.<br/><br/>“Die, die, die. If you want to exterminate our ice mountain race, you have to die too!”<br/><br/>The third elder of the giant sword waved his arm. An extremely violent frost power surged up in the divine kingdom above him.<br/><br/>The Frost condensed into an ice sword, and it tilted towards him once more.<br/><br/>Boom! Boom! Boom<br/><br/>The ice mountain below slowly collapsed under his attack.<br/><br/>“This… That’s our three guardians. What Happened?”<br/><br/>“Hiss, what’s going on? What’s going on? Someone wants to destroy Our Ice Mountain Race?”<br/><br/>The disciples of the ice mountain race who had just flown over revealed shocked expressions.<br/><br/>This ice mountain was the core of their ice mountain race. It was also the ice mountain where their tribe leader and the other experts were.<br/><br/>Now, it was actually slowly collapsing.<br/><br/>And their three guardians had actually caused their divine kingdom to descend and attack downwards.<br/><br/>What exactly happened?<br/><br/>“You don’t have the qualifications to do so!”<br/><br/>“A dying struggle!”<br/><br/>Wang Xian relied on the five elements grinding mill to get close to the three guardians of the giant sword. When they were tens of millions of kilometers away from each other, his speed suddenly increased.<br/><br/>Above him, the yin-yang Dragon disk appeared and spun rapidly.<br/><br/>Some of the ice swords landed on it and were immediately deflected by the force.<br/><br/>“Crash!”<br/><br/>Wang Xian quickly flew toward the three guardians of the giant sword. His arms turned into dragon claws and clawed toward him.<br/><br/>“Ice Drill, kill!”<br/><br/>Upon seeing Wang Xian’s attack, the eyes of the three guardians of the giant sword turned blood-red. The giant sword in their hands attacked him directly.<br/><br/>The giant sword spun and formed a terrifying ice drill. Space collapsed instantly, revealing dark spatial cracks.<br/><br/>“Roar Roar Roar!”<br/><br/>At this moment, five divine dragons rose from the five elements millstone beside Wang Xian. They coiled together and interweaved rapidly.<br/><br/>Rising Dragon!<br/><br/>Boom! Boom! Boom<br/><br/>The five elements millstone collided with the ice drill. The ice drill was sent flying backward.<br/><br/>Wang Xian followed closely behind. His dragon claws clawed at the three guardians of the giant sword.<br/><br/>“Die!”<br/><br/>A surge of frost power was injected into the body of the three guardians of the giant sword from the divine kingdom. He clenched his fists and attacked Wang Xian.<br/><br/>Boom<br/><br/>Crack! Crack! Crack<br/><br/>The Dragon Claw and the ice fist collided. The Dragon Claw shimmered with the radiance of the eight elements. The ice fist started to collapse rapidly.<br/><br/>Crash<br/><br/>At this moment, Wang Xian flapped his uninitiated holy wings and drew an arc. He arrived at the three guardians of the giant sword in an instant.<br/><br/>His speed was too fast.<br/><br/>The three guardians of the giant sword looked at Wang Xian who appeared beside them. At this moment, a hint of despair appeared in their eyes.<br/><br/>“No, the ice mountain race will prosper forever. Our Ice Mountain race will not perish!”<br/><br/>He shouted sternly.<br/><br/>“Today will be the end of your ice mountain race!”<br/><br/>Wang Xian’s dragon claws landed directly on his body. A terrifying force and chaotic energy rushed into his body.<br/><br/>“No!”<br/><br/>He shouted with a face full of despair.<br/><br/>“Why do you want to exterminate my ice mountain race? Why?”<br/><br/>At this moment, a voice filled with despair came from below.<br/><br/>Mo Sha grabbed the head of the protector, his ferocious claws drilling into his body.<br/><br/>“Your words are really ridiculous!”<br/><br/>When Mo Sha heard his words, his face was full of mockery.<br/><br/>Why Exterminate Your Ice Mountain Race?<br/><br/>Because you are courting death!<br/><br/>Otherwise, why would I exterminate you!<br/><br/>“Kill! All the experts of the ice mountain race, leave no one alive!”<br/><br/>“PFFT!”<br/><br/>Wang Xian grabbed the dragon claws of the three guardians with his huge sword and clenched them tightly. He then roared in a sinister tone.<br/><br/>“Rumble!”<br/><br/>As soon as he finished his sentence, the ice mountain that was under attack completely collapsed.<br/><br/>The collapse of the Ice Mountain and the fall of the Guardians also represented the annihilation of the entire ice mountain race!<br/><br/>“This… not good, not good, our protectors have been killed!”<br/><br/>“Someone wants to destroy our iceberg race, someone wants to destroy us, our protectors have all died!”<br/><br/>“No, how could this be, run, run, Run Now!”<br/><br/>In the surrounding area, some of the experts of the iceberg race heard the voices coming from the other side and their faces changed drastically. Their eyes were filled with fear and Panic!<br/><br/>Their ice mountain race was actually about to be destroyed!<br/><br/>Their race had collapsed!\t\t\t\t\t\t</div>", "images": {}, "success": true}