{"id": 81, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15072063.html", "title": "Chapter 3072 - Chapter 3072: 3071 Iceberg Extermination 2", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 3072 - Chapter 3072: 3071 Iceberg Extermination 2</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 3072: 3071 iceberg extermination 2<br/><br/>After helping Mi Xin Lu tame her war pet, Wang Xian returned to the Dragon Palace in the volcanic region.<br/><br/>It was not dangerous for Mi Xin Lu to follow the disciples of the Willow deity Daoist sect. Furthermore, she had fallen leaf’s homecoming and a divine emperor level eight war pet. Her strength was not weak in the willow deity Daoist sect.<br/><br/>In the entire willow deity Daoist sect, there were only five experts at the peak of the divine emperor level.<br/><br/>There were only three to four hundred people at the level nine and level eight of the Celestial Emperor.<br/><br/>When they returned to the Dragon Palace in the volcano region, an lie was already waiting there.<br/><br/>“Let’s Go!”<br/><br/>Wang Xian gestured to an lie. The next moment, they appeared in a large hall.<br/><br/>In the large hall, a white-haired old man and a middle-aged man were sitting there.<br/><br/>When they saw Wang Xian, they immediately bowed with a face full of smiles.<br/><br/>“Dragon King!”<br/><br/>“Dragon King!”<br/><br/>The two of them were Ba Qi and Mo Sha.<br/><br/>Ba Qi was currently parasitizing the white-haired old man, who was also the tribe leader of the Ice Mountain tribe. Mo Sha was parasitizing the Ice Mountain Tribe’s elder.<br/><br/>“Keke, Dragon King, look. This is the Ice Mountain Tribe’s acquired spiritual treasure, the Frost Sword!”<br/><br/>Ba Qi immediately took out a sharp sword that was covered in frost and was about two meters long. On the sharp sword, there were patterns of Ice Mountains. It looked exceptionally exquisite and mystical.<br/><br/>Waves of ice-sealing aura circulated on it.<br/><br/>Wang Xian stretched out his hand to receive it. As he felt the power on the frost divine sword, excitement appeared in his eyes.<br/><br/>As expected of a acquired Numinous Treasure.<br/><br/>“How’s the situation now?”<br/><br/>After sizing up the frost divine sword, Wang Xian asked the two of them.<br/><br/>“Dragon King, we have already obtained most of the information about the ice mountain race. There are seven powerhouses at the peak of the Divine Emperor Realm. Among them, four and a peak of the divine emperor realm sorceress are located around the willow deity Daoist sect. They are looking for traces of you, Dragon King.”<br/><br/>“In addition, there are two peak celestial thearch-level powerhouses who are cultivating in seclusion. There is also one who is training in the Milky Way. Now, other than the unknown location of that person who is training, I have a way to call them over.”<br/><br/>Ba Qi said with a smile on his face.<br/><br/>“Oh? Then call them over as soon as possible and destroy them.”<br/><br/>Wang Xian’s eyes flashed with a cold look as he said immediately.<br/><br/>“It’s the Dragon King. I’ve already informed one of them. He should be here within half an hour. In addition, the guardian of the Ice Mountain Race’s life token has been controlled by his subordinates. There won’t be any problems.”<br/><br/>Ba Qi replied.<br/><br/>“Alright.”<br/><br/>Wang Xian smiled and asked, “How are the resources of the Ice Mountain Race?”<br/><br/>“Dragon King, they are very rich in resources. The leader of the Ice Mountain race also has a large number of treasures. TSK TSK, these powers that have been standing for more than a billion years are really deep-rooted!”<br/><br/>“If we kill them, we will be able to gain a huge improvement. Perhaps, Dragon King, you have enough resources to improve.”<br/><br/>Ba Qi said excitedly.<br/><br/>“Good, good!”<br/><br/>Wang Xian’s eyes were burning. If he could improve, he would have the strength of a universe knight.<br/><br/>“Dragon King, you are here. A supreme elder of the ice mountain race has been keeping watch over the ice mountain race.”<br/><br/>More than ten minutes later, Ba Qi spoke to Wang Xian in a low voice.<br/><br/>“Kill him instantly.”<br/><br/>Wang Xian spoke and went to the back of the hall to conceal his figure and aura.<br/><br/>“Xiao Yu, what happened in the race?”<br/><br/>At this moment, an old man covered in ice walked in and spoke to Ba Qi.<br/><br/>“Supreme Elder, Our Ice Mountain race is in trouble.”<br/><br/>Ba Qi was parasitized by the ice mountain race’s patriarch. His face was full of sorrow and his expression was extremely ugly.<br/><br/>“Oh?”<br/><br/>“What trouble?”<br/><br/>The Grand Elder’s brows tightened and he asked in a deep voice.<br/><br/>“Not long ago, a dragon king killed several disciples of our willow deity Daoist sect. He was very powerful. We invited an acting wizard and four protectors to hunt him down. However, we didn’t expect that we would lose contact with him now.”<br/><br/>As Ba Qi spoke, he walked towards him.<br/><br/>“What?”<br/><br/>“Four protectors at the peak of the Divine Emperor Realm lost contact with him? This… they…”<br/><br/>Upon hearing this information, the supreme elder revealed a shocked expression.<br/><br/>“Boom!”<br/><br/>“Buzz!”<br/><br/>However, before he could finish speaking, while his face was filled with shock, Ba Qi suddenly attacked and his palm landed beside the old man.<br/><br/>The demonic fiend tore apart the host’s body and directly drilled into the old man’s body.<br/><br/>“Xiao Yu… you…”<br/><br/>The sudden change made the old man’s expression change drastically. His eyes widened and were filled with shock.<br/><br/>What was going on?<br/><br/>What was going on?<br/><br/>He immediately mobilized the vast power in his body and struggled desperately.<br/><br/>However, the black liquid crazily drilled into his body from his seven orifices.<br/><br/>The old man’s body trembled violently, and soon his body shook, and his pupils turned completely black.<br/><br/>Gradually, the black disappeared and the pupils regained their clarity.<br/><br/>But in the clear and bright, with a trace of cunning.<br/><br/>“Jie Jie Jie, done!”<br/><br/>Mosha excitedly called out, take out the vitality fluid, treatment of the body was injured by octahedron.<br/><br/>Wang Xian walked out from the back with a smile on his face.<br/><br/>In such a situation where he was caught off guard, Wang Xian didn’t even need to make a move.<br/><br/>This was the terrifying aspect of the poisonous horned dragon seed.<br/><br/>“Keke, Dragon King, we don’t even need you to make a move. We can destroy it.”<br/><br/>The two of them said with a smile.<br/><br/>“When will the next one arrive?”<br/><br/>Wang Xian asked with a smile.<br/><br/>“I don’t know exactly when it will arrive today.”<br/><br/>“The most troublesome ones are the few protectors of the ice mountain race. Together with the one who acts as a wizard, they are five powerhouses at the peak of the Divine Emperor Realm. Moreover, I’m afraid it won’t be easy to separate them in a short period of time.”<br/><br/>“Of course, if there are more than ten days or a month of planning, the problem shouldn’t be too big.”<br/><br/>Ba Qi pondered.<br/><br/>“There’s no need. When the time comes, we can totally kill them by force. The three of us can take them by surprise and kill three of them. The other two can be easily dealt with.”<br/><br/>Wang Xian spoke.<br/><br/>“It’s not a big problem. It might take five to six days for the five of them to arrive.”<br/><br/>Ba Qi said.<br/><br/>“Kill them as soon as possible so that we don’t have to delay any longer.”<br/><br/>Wang Xian nodded his head.<br/><br/>All the Divine Emperors had unimaginable means. It would be best if they could destroy them as soon as possible.<br/><br/>Five to six days passed very quickly.<br/><br/>What they did not expect was that while they were searching for Wang Xian, their race had gradually disintegrated.<br/><br/>Two hours later, a supreme elder of the ice mountain race rushed over. He was easily killed by Mo sha and Ba Qi.<br/><br/>At the same time, at the sea area around the willow deity Daoist sect, a few protectors who received Ba Qi’s message frowned slightly and immediately rushed over to the ice mountain race.<br/><br/>Since they were considered to be acting wizards, they could not rush over through the divine kingdom. They could only fly.<br/><br/>It would take five to six days to fly over such a long distance.<br/><br/>While they were hurrying over, Wang Xian and the rest were also waiting quietly.<br/><br/>The Countdown to the end of the iceberg race also began.\t\t\t\t\t\t</div>", "images": {}, "success": true}