{"id": 80, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15072061.html", "title": "Chapter 3071 - Chapter 3071: 3,070 Icebergs 1", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 3071 - Chapter 3071: 3,070 Icebergs 1</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 3071: 3,070 icebergs 1<br/><br/>“Sister Xinlu is a nice person. Her strength is not bad either.”<br/><br/>Looking at the departing figure of Mi Xinlu, a few women said faintly.<br/><br/>“She is not bad. That Wang Xian is also very strong. It’s a pity that he is too unscrupulous in his actions. Oh right, senior sister, how many people from our willow deity Daoist sect will be there this time?”<br/><br/>A woman nodded and asked.<br/><br/>“I’m not sure. There should be at least 6,000 to 7,000 people. After all, they might have acquired acquired spiritual treasures. Since everyone is interested in such treasures, the chances of US obtaining them are not very high. However, as a famous figure in the Milky Way, the Gemini Divine Emperor should have many other treasures as well.”<br/><br/>The group of ladies chatted.<br/><br/>…<br/><br/>“Brother Wang.”<br/><br/>In the willow deity sect, mi xinlu looked at Wang Xian who had just arrived and walked over with a smile.<br/><br/>“HMM, have all the disciples of the Willow deity Daoist sect gone over?”<br/><br/>Wang Xian looked at her and asked directly.<br/><br/>“Someone should have arrived. However, the fallen divine kingdom of the Twin God emperors is located at an isolated island on the sea. There are a large number of desolate beasts there. Furthermore, it is not easy to enter the fallen divine kingdom.”<br/><br/>Mi Xin Lu said.<br/><br/>“Let’s go.”<br/><br/>Wang Xian’s figure moved and brought her out immediately.<br/><br/>Layers of dragon scales covered her body, completely concealing her aura.<br/><br/>At this moment, the ice mountain race’s experts were still locked onto him. At this moment, Wang Xian did not want to engage in a fight with a dying person.<br/><br/>By using his speed to the maximum, it would be difficult for the experts at the peak of the divine emperor realm to discover him.<br/><br/>The isolated island on the sea was relatively far from the willow deity Daoist sect. Even with Wang Xian’s speed, he would need two days to fly.<br/><br/>Two days later, an incomparably huge island was floating above the Milky Way. The island was so huge that one could not see the boundary at a glance.<br/><br/>The surroundings of this island were densely packed with countless birds and beasts.<br/><br/>Every bird and beast had a ferocious aura.<br/><br/>This island was a paradise for dire beasts.<br/><br/>The moment there was any movement, it would attract a large number of dire beasts.<br/><br/>Furthermore, everyone knew that there were universe knight-level dire beasts on this island.<br/><br/>Even the powerhouses from the elementary races in the Milky Way had to be careful when they came here.<br/><br/>“Do you know where it is?”<br/><br/>Wang Xian asked Mo Xinlu.<br/><br/>“I know. A senior sister told us the exact location. It’s over there.”<br/><br/>Mo Xinlu pointed in a direction.<br/><br/>Wang Xian moved and flew over immediately.<br/><br/>From the sky, he could see many huge desolate beasts on the isolated island.<br/><br/>Hunting and killing were ongoing on the isolated island.<br/><br/>“Huh?”<br/><br/>Very soon, at the front, at the edge of the isolated island, there was a very strange building.<br/><br/>Only a corner of the building was exposed, and it was only ten meters in size.<br/><br/>A large number of desolate beasts were gathered around the strange building that was ten meters in size. A gigantic bird at the ninth level of the Celestial Thearch was lying on the ground, staring at the building with a burning gaze.<br/><br/>Wang Xian saw that there were quite a number of humans at the side.<br/><br/>Those should be some disciples of the Willow deity Daoist sect.<br/><br/>At present, other than the disciples of the Willow deity Daoist sect, no one else knew about this place.<br/><br/>Wang Xian hid in the sky and watched with a twinkle in his eyes.<br/><br/>A large portion of the divine kingdom was located in the void crack. It was obvious that the Twin Divine Emperors had set up a restriction before their death.<br/><br/>As their divine kingdom, they were the rulers of the divine kingdom. They were able to set up rules.<br/><br/>Clearly, the two of them knew that he was about to die and had turned the divine kingdom into his own graveyard.<br/><br/>Once he barged in, he might suffer a devastating blow.<br/><br/>“Even an lie would not be able to enter such a divine kingdom.”<br/><br/>Wang Xian thought to himself.<br/><br/>After his strength had reached the peak of the divine emperor realm, he was already able to set the rules in his divine kingdom.<br/><br/>It was just like how an array master could set up a formation to change the world. An expert could easily change the rules of his divine kingdom in his own divine kingdom.<br/><br/>He could set up flames, torrential rain, Thunderbolts, etc. .<br/><br/>If the divine kingdom belonged to a dead zone, an lie would suffer a fatal attack if he entered.<br/><br/>With his strength at the third level of the celestial thearch, he would be destroyed instantly when faced with an attack set up by an expert at the peak of the celestial thearch.<br/><br/>Wang Xian scanned the divine kingdom with his dragon eyes.<br/><br/>He did not appear. Perhaps the moment he appeared, news of him would be transmitted to the ice mountain race.<br/><br/>“Brother Wang, should we wait here or charge through?”<br/><br/>Mi Xinlu’s eyes flickered as he asked.<br/><br/>“I can sense a terrifying energy in this graveyard of the Divine Kingdom.”<br/><br/>Wang Xian said faintly.<br/><br/>Scanning with his dragon eyes, he could vaguely see two incomparably huge divine kingdoms.<br/><br/>One was the fire divine kingdom and the other was the water divine kingdom.<br/><br/>However, there seemed to be a ferocious existence in this place.<br/><br/>“Senior sister said that the venerable willow deity had announced this graveyard of the divine kingdom to all the disciples as a test for all the disciples. The treasures in this place are not that easy to obtain. I’m afraid it’s not that easy to obtain a powerhouse at the peak of the Celestial Thearch.”<br/><br/>Mo Xinlu said.<br/><br/>Wang Xian nodded his head slightly. A contemplative look appeared on his face.<br/><br/>Buzz Buzz<br/><br/>At this moment, the information of the octahedron and demonic fiend was transmitted from the universe’s AI.<br/><br/>The two of them had completed their breakthrough and returned to the Ice Mountain tribe. Just now, they had parasitized the tribe leader of the Ice Mountain tribe to ask him if he wanted to capture the entire ice mountain tribe in one fell swoop.<br/><br/>When Wang Xian heard this information, he narrowed his eyes slightly. A hint of excitement flashed across his eyes.<br/><br/>The eight-headed Hydra and the Demonic Fiend had advanced to the peak of the celestial thearch. One of them had parasitized the grandson of the current tribe leader of the Ice Mountain tribe.<br/><br/>It was not too difficult to kill a peak celestial thearch when they were caught off guard.<br/><br/>After all, who would have thought that their beloved and respected grandson would kill them?<br/><br/>Under such circumstances, they only used a few hours to parasitize the tribe leader of the Ice Mountain tribe.<br/><br/>Furthermore, they even obtained the acquired spiritual treasure, the frost sword.<br/><br/>“Why don’t we destroy the Ice Mountain tribe first before coming here?”<br/><br/>He looked hesitant.<br/><br/>Since the tribe leader of the Ice Mountain tribe was controlled, it would be much easier to get rid of the rest of the peak-stage divine emperor powerhouses of the Ice Mountain tribe.<br/><br/>By eliminating them, he would be able to avoid being attacked by them.<br/><br/>Having made up his mind, Wang Xian looked at Mi Xin Lu who was beside him.<br/><br/>“I have to settle something first. Do you want to wait here or stay in my special space?”<br/><br/>He asked.<br/><br/>“AH? Brother Wang, do you want to settle something? Then… I’ll wait for you here. If there’s any news, I can tell you.”<br/><br/>Mi Xinlu was slightly surprised.<br/><br/>“That’s good too. I’ll give you a war pet to protect yourself.”<br/><br/>Wang Xian nodded. With a wave of his arm, a turtle-winged beast of the eighth level of celestial thearch appeared at the side.<br/><br/>Mi Xinlu’s eyes lit up. Her face was filled with surprise and joy. She shook her head and said, “Brother Wang, this war pet is too strong. I can’t control it.”<br/><br/>“It’s alright. I’ll help you suppress it first. I’ll help you tame it first.”<br/><br/>Wang Xian shook his head.<br/><br/>Mi Xin Lu was also a sub-dragon. Wang Xian would try his best to help her.<br/><br/>Furthermore, Wang Xian was prepared to let her join the Dragon Palace in the future.\t\t\t\t\t\t</div>", "images": {}, "success": true}