{"id": 87, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15072075.html", "title": "Chapter 3078 - Chapter 3078: 3077 Iceberg Had Been Destroyed, Yet They Still Dared To Be So Arrogant? 4", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 3078 - Chapter 3078: 3077 Iceberg Had Been Destroyed, Yet They Still Dared To Be So Arrogant? 4</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 3078: 3077 iceberg had been destroyed, yet they still dared to be so arrogant? 4<br/><br/>“Our iceberg race has been destroyed?”<br/><br/>Bing Ling and the rest were slightly stunned when they heard Wang Xian’s words. Following that, a cold expression appeared on their faces. “Hehe, our iceberg race has been destroyed? You Can’t be saying that you were the one who destroyed it, right?”<br/><br/>“Although our iceberg race is not very strong in the Milky Way, we have been standing for more than a billion years. How can we be destroyed so easily? Wang Xian, even if you are destroyed, our iceberg race will not be destroyed.”<br/><br/>As they spoke, they stared coldly at Wang Xian.<br/><br/>“Is that so?”<br/><br/>Wang Xian smiled gently. “It doesn’t matter if you don’t believe me. Go Down and accompany them.”<br/><br/>As he spoke, his figure appeared in front of them in an instant. His palm was grabbing towards them.<br/><br/>“Young Master Long Zaitian!”<br/><br/>Seeing Wang Xian attacking them, the expressions of Bing Ling, Hong Tu, and the rest changed drastically. They hurriedly shouted.<br/><br/>“Pa!”<br/><br/>“Hehe, they are all disciples of the Willow deity Daoist sect. Furthermore, they are my people. I Don’t care who you are or how arrogant you are. You should keep a low profile in front of us.”<br/><br/>The moment Wang Xian made his move, Long Zaitian’s body shook. Bolts of lightning shot out from his body. The lightning condensed into a palm and grabbed his arm directly.<br/><br/>Long Zaitian looked at Wang Xian and said faintly.<br/><br/>Beside Long Zaitian, long youfeng and the disciples of the dragon race were watching with smiles on their faces.<br/><br/>“Long Zaitian’s bloodline is really terrifying now. He has the strength of a level eight celestial thearch, but he is able to fight against a level nine celestial thearch without being at a disadvantage.”<br/><br/>“His bloodline is indeed strong. I heard that Wang Xian has the strength of a level nine celestial thearch. He is clearly going to be slapped in the face when he fights with long Zaitian and the rest. His strength is enough to bully some domain level disciples.”<br/><br/>Some people whispered when they saw this scene.<br/><br/>“Wang Xian, don’t be arrogant. Also, you, Mi Xin Lu, better join our young master long Zaitian now. Otherwise, you will have to suffer in the future.”<br/><br/>Wang Xian looked at long Zaitian making a move, heard the words of Bing Ling Hong Tu and the rest, and looked at their arrogant appearance. A faint smile appeared on his face.<br/><br/>Buzz<br/><br/>His palm moved slightly and a terrifying destructive force instantly destroyed the lightning palm that was blocking his attack.<br/><br/>Bang Bang<br/><br/>The next moment, the bodies of Bing Linghong Tu and the rest, who were still wearing a faint smile on their faces, exploded.<br/><br/>Fresh blood splattered all over long Zaitian’s body.<br/><br/>The sudden scene stunned everyone. Long Zaitian was also stunned. When he felt the fresh blood splattered on his face, his expression changed slightly.<br/><br/>“Trash!”<br/><br/>Wang Xian spat out two words indifferently. It was unknown whether he was referring to Bing Ling, Hong Tu, and the rest or Long Zaitian.<br/><br/>It was possible that he was referring to both.<br/><br/>At the beginning, he had made his move because he wanted to see the attitude of long Zaitian and the rest.<br/><br/>If they made their move, Wang Xian would play along with them.<br/><br/>“You, are courting death!”<br/><br/>Upon hearing Wang Xian’s two words, long Zaitian’s expression changed instantly. A terrifying killing intent erupted from his body.<br/><br/>Waves of lightning gathered on his body.<br/><br/>“Young Master Long Zaitian.”<br/><br/>At the side, Long Youfeng stretched out his hand and pulled long Zaitian. His eyes revealed a solemn and vigilant expression. He transmitted his voice, “Young Master Long Zaitian, I’m afraid his strength is not weaker than mine.”<br/><br/>“Crackle!”<br/><br/>When he heard long Youfeng’s words, his eyes narrowed slightly. The Lightning on his body emitted an intense sound.<br/><br/>He stared at Wang Xian coldly and revealed a sinister smile. “Interesting, interesting. You are the first person who didn’t give me any face. Today, I’m here for the acquired Numinous Treasure. I can’t play with you.”<br/><br/>“You will soon regret what you did just now because you will have to pay with your life.”<br/><br/>As Long Zaitian spoke, he extended his hand and wiped off the fresh blood on his body, causing it to disappear.<br/><br/>He looked at Wang Xian indifferently as though he was describing a very ordinary matter.<br/><br/>“I am also here for the Numinous Treasure in front.”<br/><br/>Wang Xian had a smile on his face as he looked at long Zaitian calmly.<br/><br/>Crack Crack Crack<br/><br/>When he saw Wang Xian’s nonchalant expression, long Zaitian’s eyes were filled with fury.<br/><br/>“Alright, Alright.”<br/><br/>He said coldly and turned his head to look at the coffin.<br/><br/>“This… that Wang Xian actually killed two more disciples of the Willow deity Daoist sect. A total of seven have been killed by him.”<br/><br/>“He’s too arrogant and unbridled. He doesn’t give any face to the dragon race at all. First, he offended the ice mountain race. Now, he has offended long Zaitian and the rest.”<br/><br/>“But that Wang Xian’s strength is so strong. He doesn’t seem to be at the ninth level of the celestial thearch. It’s possible that he is at the peak of the Celestial Thearch.”<br/><br/>Some people were discussing in a low voice as they looked at Wang Xian from time to time.<br/><br/>Wang Xian’s sudden attack just now had indeed shocked them.<br/><br/>He instantly killed Bing Ling, Hong Tu, and the rest. Blood splattered all over his body.<br/><br/>Some of the experts of the willow deity sect could vaguely sense that Wang Xian’s strength should be at the peak of the celestial thearch.<br/><br/>“Everyone, let’s attack together. Treasures belong to those who are capable!”<br/><br/>Long youfeng’s cold gaze swept across Wang Xian. He looked at the surrounding disciples of the Willow deity Daoist sect and said.<br/><br/>“Alright, those who are capable will belong to those who are capable. It’s all up to their own abilities.”<br/><br/>At the side, an old man holding a strange tree nodded his head faintly.<br/><br/>“I agree. That acquired spiritual treasure belongs to me. Let me put it bluntly. If anyone tries to snatch it from me, Don’t blame me for being impolite.”<br/><br/>On the right, an old man who was clad in a black robe and had a fiery red gaze said faintly.<br/><br/>“We’ll rely on our own strength!”<br/><br/>Long Zaitian smiled coldly.<br/><br/>“Sell them all. If anyone wants to be the last to make a move, don’t blame us for being impolite.”<br/><br/>Long youfeng said coldly as a terrifying aura surged from his body.<br/><br/>“Go back directly and wait for me at the Willow deity Daoist sect.”<br/><br/>Wang Xian said to Mo Xinlu.<br/><br/>“Huh?”<br/><br/>Mo Xinlu looked at Wang Xian in astonishment. Her face was filled with astonishment as she nodded her head slightly.<br/><br/>“Hehe!”<br/><br/>He smiled and didn’t say anything. His gaze swept across the surroundings as the corners of his mouth curled up slightly.<br/><br/>Since he had made such arrangements, he naturally had something big to do.<br/><br/>“Attack!”<br/><br/>An old man shouted lightly and the group of disciples from the Willow deity Daoist sect moved.<br/><br/>Senior Martial Brother Junzi, the old man from the long you peak, and the old man with the strange tree in his hand were the first to fly towards the pipe.<br/><br/>“Roar Roar Roar!”<br/><br/>When the leaders of the water and fire beasts saw them, their eyes revealed a cold expression. They let out a roar and attacked them directly.<br/><br/>“Get lost!”<br/><br/>They shouted loudly. Their eyes were filled with killing intent as they attacked the leaders of the two water beasts and fire beasts.<br/><br/>Boom<br/><br/>Wang Xian’s body shook as he charged forward as well. A terrifying force gathered on his body as he attacked the water beasts and fire beasts.<br/><br/>At the back, Long Zaitian and the rest of the level nine godly monarch experts followed closely behind.<br/><br/>Acquired Lingbao, everyone wants to fight!\t\t\t\t\t\t</div>", "images": {}, "success": true}