{"id": 89, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15072079.html", "title": "Chapter 3080 - Chapter 3080: 3079 In The Process Of Seizing The Treasure And Killing", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 3080 - Chapter 3080: 3079 In The Process Of Seizing The Treasure And Killing</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 3080: 3079 in the process of seizing the treasure and killing<br/><br/>“What! That Sword and Saber acquired the acquired spiritual treasure by that Wang Xian!”<br/><br/>“The spiritual treasure has been obtained by that Wang Xian. Hiss, he is so fast. What a terrifying defense!”<br/><br/>“This…”<br/><br/>At the back, some disciples of the willow deity Daoist sect noticed the situation here. Their expressions changed slightly and revealed a look of shock.<br/><br/>No one had expected that the acquired spiritual treasure would be obtained by Wang Xian.<br/><br/>“He has the strength of a peak divine emperor. There is a high possibility of him obtaining the acquired spiritual treasure.”<br/><br/>There were also some powerful disciples of the willow deity Daoist sect who thought to themselves.<br/><br/>However, some of them were looking ahead with flickering eyes.<br/><br/>If other peak divine emperor powerhouses were to obtain the acquired spiritual treasure, the others might give up.<br/><br/>After all, the few powerhouses at the peak of the celestial thearch level either had a background of a primary race in the universe or had great prestige in the Willow deity Daoist sect.<br/><br/>However, it was hard to say if Wang Xian had obtained the acquired spiritual treasure.<br/><br/>How could the other senior brothers at the peak of the celestial thearch level be satisfied with an arrogant fellow who had no background at all?<br/><br/>“Hand over the scar of the Saber and sword. How can you possess such a treasure?”<br/><br/>Long Zaitian looked at Wang Xian who was holding the saber and sword. His expression was unusually gloomy as he growled in a low voice.<br/><br/>While he was speaking, Long Youfeng moved closer and locked his gaze on Wang Xian.<br/><br/>At the side, the elders from the skeleton clan and the elder holding the divine tree were also staring at him with flickering eyes.<br/><br/>Only senior brother Junzi shook his head and retreated backward. He did not participate in the fight.<br/><br/>“What? Now that I have obtained the Numinous Treasure, you guys still want to snatch it?”<br/><br/>Wang Xian held the scar of the sword in his hand and stared at them indifferently.<br/><br/>“The numinous treasure is known to those who are capable.”<br/><br/>Long youfeng stared at Wang Xian, his eyes gleaming.<br/><br/>Wang Xian narrowed his eyes slightly. With a wave of his arm, he kept the acquired Numinous Treasure.<br/><br/>“Alright, now that I have kept it in the divine kingdom, I’m afraid you guys won’t be able to obtain it even if you want to. Haha!”<br/><br/>He laughed loudly and glanced at long you feng, the skeleton clan elder, and the elder holding the divine tree with a mocking expression.<br/><br/>The elder holding the strange divine tree felt his heart sink. He shook his head and felt slightly unwilling.<br/><br/>He didn’t expect the acquired Numinous Treasure to be suppressed so quickly. Before it was suppressed, the acquired Numinous Treasure couldn’t be taken into his interspatial ring or the divine kingdom, but now…<br/><br/>The acquired Numinous Treasure had already been obtained by someone else and placed in the divine kingdom.<br/><br/>The chances of them snatching it were too low.<br/><br/>Furthermore, he was not in sync with the others and it was impossible for him to force it out.<br/><br/>“Acquired Numinous Treasure, those who are strong will get it. Junior brother Wang Xian, since you are strong, I will not compete with you.”<br/><br/>As he spoke, he retreated.<br/><br/>The skeleton elder also retreated.<br/><br/>Three out of the four peak-stage divine emperor powerhouses had retreated. There was no need for him to make a move anymore.<br/><br/>Long Zaitian’s expression changed when he saw the sword and saber scars being kept and the others retreating one by one.<br/><br/>“HMPH!”<br/><br/>He snorted softly. Anger and helplessness appeared on his face.<br/><br/>Long youfeng also retracted his arm slowly.<br/><br/>“I didn’t expect such a powerful acquired spiritual treasure to be suppressed by that Wang Xian so quickly.”<br/><br/>At the back, everyone was filled with shock when they saw this scene.<br/><br/>No one expected that the biggest winner today would be the arrogant and arrogant Wang Xian.<br/><br/>“I want this divine tree.”<br/><br/>At this moment, the old man with the strange divine tree moved and flew towards the water attribute divine tree beside the coffin.<br/><br/>Since the acquired spiritual treasure had been obtained, they could only take a step back.<br/><br/>Buzz! Buzz<br/><br/>Seeing the old man with the strange divine tree making his move, senior brother Junzi and the old man from the skeleton clan also moved and flew towards the coffin.<br/><br/>“Let’s Go!”<br/><br/>Long youfeng reminded Long Zaitian who was at the side and flew forward quickly.<br/><br/>“I hate people who threaten me the most.”<br/><br/>Senior Brother Junzi, the old man with the divine tree and the old man from the skeleton clan heard a low murmur when they flew over.<br/><br/>The few of them were slightly stunned as they looked at Wang Xian in astonishment.<br/><br/>Crash<br/><br/>Boom<br/><br/>In the next moment, under the circumstances that no one expected and before anyone could react, Wang Xian made his move.<br/><br/>His eyes were filled with a dense killing intent and a terrifying aura. At this moment, he unleashed his strength to the maximum.<br/><br/>“Bang!”<br/><br/>In front of him, before long Zaitian, who was only a few dozen kilometers away, could react, he felt an extremely terrifying force landing on his body.<br/><br/>In an instant, death enveloped him. The terrifying attack force caused his body to explode.<br/><br/>“Eh?”<br/><br/>However, Wang Xian, who was attacking, frowned slightly and stared at the position of his head.<br/><br/>There was a resplendent lightning symbol protecting his head, preventing his head from being crushed under his terrifying attacks.<br/><br/>However, other than his head, the rest of his body was completely destroyed.<br/><br/>At the spot behind him where the wings of lightning were, two resplendent holy feathers of lightning were emitting lightning rays. Under his attacks, there were no traces of them.<br/><br/>When he saw the two holy feathers, he ignored the head that was protected by the lightning symbols. With a wave of his arm, he directly kept the holy feathers into the mother nest.<br/><br/>“What!”<br/><br/>“You’re courting death!”<br/><br/>At the side, Long youfeng heard the terrifying attacks coming from beside him. His heart pounded violently. When he saw the dragon that had been attacked in the sky, he widened his eyes. His face was filled with fury as he shouted sternly.<br/><br/>“Hiss… this…”<br/><br/>Some people in the surroundings sensed the commotion and revealed a shocked expression.<br/><br/>This scene… This scene…<br/><br/>“What I hate the most is threats. A level nine celestial thearch is still trying to threaten me. There’s also your dragon race. How dare you threaten me? Die!”<br/><br/>Wang Xian revealed a cold expression. He flapped his incipient saint wings and arrived in front of long youfeng in an instant.<br/><br/>His palm transformed into a dragon claw. The Five Elements Millstone appeared in the sky and attacked him directly.<br/><br/>“You’re courting death!”<br/><br/>“Such terrifying speed…”<br/><br/>He widened his eyes and revealed a look of astonishment. With his arms in front of him, he hurriedly stretched out his hands to block the attack.<br/><br/>His two arms released a terrifying power of lightning.<br/><br/>Bang! Bang! Bang<br/><br/>The Dragon Claw landed on his arms and Wang Xian clenched it forcefully.<br/><br/>Buzz<br/><br/>Above him, the five elements were grinding against each other. A frost longsword suddenly fell down. The Frost Longsword condensed by the attributes seemed to be able to freeze space as it landed directly on his head.<br/><br/>“Get lost!”<br/><br/>Long Youfeng felt the terrifying attack power. He roared and lightning shot up from his entire body.<br/><br/>Buzz<br/><br/>Wang Xian moved his body and appeared behind him in an instant. The scar of the Saber and sword appeared behind him.<br/><br/>“Let’s see how powerful you guys are!”<br/><br/>He let out a soft shout and swung the sword mark with both of his hands. Then, he slashed at long youfeng.<br/><br/>The terrifying power of the sword and Saber broke through the lightning defense on long Youfeng’s body.\t\t\t\t\t\t</div>", "images": {}, "success": true}