{"id": 84, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15072069.html", "title": "Chapter 3075 - Chapter 3075: 3074 Icebergs Had Been Destroyed, Yet They Still Dared To Act So Arrogantly", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 3075 - Chapter 3075: 3074 Icebergs Had Been Destroyed, Yet They Still Dared To Act So Arrogantly</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 3075: 3074 icebergs had been destroyed, yet they still dared to act so arrogantly<br/><br/>“The icebergs will be destroyed!”<br/><br/>“All of you, die!”<br/><br/>The icebergs collapsed, and the three guardians of the Giant Sword were killed by Wang Xian. At this point, other than a peak-stage celestial thearch powerhouse from the icebergs whose whereabouts were unknown, the rest of the peak-stage celestial thearch powerhouses were all killed.<br/><br/>The eight-limbed demonic fiend and the rest swept their gaze across the surroundings and looked at the other expert disciples from the icebergs. Their eyes revealed a sinister look.<br/><br/>Their bodies moved and attacked at a terrifying speed.<br/><br/>The eight-limbed demon fiend, who was at the peak of the Divine Emperor Realm, was already invincible against the ice mountain race.<br/><br/>In addition, they now had a large amount of information regarding the ice mountain race. Some of the disciples even had their divine kingdoms located.<br/><br/>They quickly swept through the ice mountain race.<br/><br/>“Run, run, run! The other party is a peak divine emperor expert!”<br/><br/>“Quickly run back to your own divine kingdom!”<br/><br/>“Ah! Don’t kill me!”<br/><br/>Soon, the entire ice mountain race was in chaos, especially the disciples and clansmen on the surrounding dozens of icebergs. They looked at the sky with fear on their faces as they frantically fled.<br/><br/>The eight-limbed demon fiend duo locked onto the divine emperor experts and quickly hunted them down.<br/><br/>Those who reacted quickly fled back to their own divine kingdoms, while those who reacted slowly were killed.<br/><br/>As for the ice-mountain race members below the god-emperor level, they did not attack.<br/><br/>The Dragon Palace did not kill innocent people indiscriminately. As long as all the potential threats were eliminated, it was enough.<br/><br/>The others did not pose the slightest threat.<br/><br/>Very soon, the entire ice-mountain race was shaken. Countless citizens watched this scene in panic as the sky suddenly changed.<br/><br/>They watched as their race’s god Emperor experts were hunted down one by one.<br/><br/>There was even a secret land of the ice mountain race where a few armies of the Ice Mountain Race’s divine kingdom were hidden.<br/><br/>When those people fled to the divine kingdom, they were met with the eight-headed army’s attack.<br/><br/>The eight-headed Army locked onto the divine kingdoms of the experts, and the demonic fiend wreaked havoc throughout the entire ice mountain race.<br/><br/>All the treasures and resources were taken away.<br/><br/>All the citizens of the ice mountain race were trembling. They did not dare to breathe under the terrifying might.<br/><br/>At this moment, they still did not know which faction had destroyed their ice mountain race.<br/><br/>They still did not know why the other party had destroyed them.<br/><br/>Wang Xian was floating above an ice mountain. He was staring coldly at this world.<br/><br/>The Ice Mountain was destroyed!<br/><br/>With the resources obtained from the Ice Mountain and a turtle-winged Beast War Pet at the peak of the Celestial Emperor Realm, he should be able to achieve another breakthrough in his strength.<br/><br/>Wang Xian was deep in thought. He moved his body and landed on the iceberg at the side. With a move of his palm, a postnatal numinous treasure level frost divine sword appeared in his hand.<br/><br/>Buzz! Buzz! Buzz<br/><br/>The divine sword struggled continuously in his hand. Water energy circulated on Wang Xian’s arm and a water elemental divine dragon coiled around the frost divine sword.<br/><br/>Whoosh<br/><br/>With a move of his palm, the five elements grinding appeared beside the divine sword. The energy of the five elements wrapped around it, wanting to melt it.<br/><br/>Buzz! Buzz! Buzz<br/><br/>The Frost Divine Sword resisted violently. The Shadows of the Divine Dragons entered the frost divine sword one after another.<br/><br/>Wang Xian sensed quietly. After more than ten minutes, a smile appeared on his face.<br/><br/>“I’ve succeeded. However, it will take some time for the five elements millstone to absorb an acquired spiritual treasure.”<br/><br/>As he mumbled, his eyes sparkled.<br/><br/>After absorbing it, the five elements millstone would be able to improve significantly.<br/><br/>“Buzz Buzz!”<br/><br/>The universe’s artificial intelligence trembled. Wang Xian opened it and took a look. It was a message from Mi Xin Lu.<br/><br/>The two of them had been in contact for the past few days.<br/><br/>Mi Xin Lu reported the situation on the Gemini divine emperor’s side every day.<br/><br/>Two days ago, more than 6,000 disciples of the Willow deity Daoist sect had arrived at the isolated island on the sea. The surrounding desolate beasts had all been cleaned up by the disciples of the Willow deity Daoist sect.<br/><br/>Furthermore, they were preparing to enter the Divine Kingdom of the Twin Divine Emperors.<br/><br/>Now, there was news from Mi Xin Lu that the disciples of the Willow Deity sect were preparing to enter the divine kingdom.<br/><br/>When Wang Xian saw this news, he hesitated for a moment. After informing the eight-limbed demonic fiend, he immediately flew towards the direction of the isolated island in the sea.<br/><br/>It was suspected that there were acquired Numinous Treasures in the Divine Kingdom of the Twin Divine Emperors. Treasures of this level would greatly enhance the five elements millstone.<br/><br/>With the Frost Divine Sword and another acquired Numinous Treasure, the five elements millstone should be able to undergo a huge transformation.<br/><br/>At that time, it would have the destructive power of a universe knight.<br/><br/>Wang Xian unfurled his incipient saint wings and sped away.<br/><br/>The isolated island on the sea was very far away. He teleported continuously midway and took a day to arrive.<br/><br/>Ever since Mi Xin Lu entered the divine empire, she did not send any messages. It was likely that her communication was blocked.<br/><br/>In a day’s time, Wang Xian arrived in front of the isolated island on the sea.<br/><br/>Although it took him two days to travel and many disciples of the Willow deity Daoist sect had already entered for two days, Wang Xian was not worried.<br/><br/>If the tomb of the divine kingdom, which was at the peak of the celestial thearch realm, was so easily cracked, it would be too weak.<br/><br/>When he arrived at the isolated island on the sea, there were nearly a thousand disciples of the willow deity Daoist sect gathered around the entrance of the divine kingdom.<br/><br/>Wang Xian swept his gaze across them and raised his eyebrows slightly.<br/><br/>These 1,000 people were all below the fourth level of the celestial thearch. Clearly, they were afraid that they would be too weak and die inside. Therefore, they stayed outside.<br/><br/>“Who is it?”<br/><br/>Wang Xian landed directly in front of the divine kingdom. When the disciples of the Willow deity Daoist sect saw him, they immediately said vigilantly.<br/><br/>“It’s the new disciple of our willow deity Daoist sect. It’s that Wang Xian.”<br/><br/>Someone recognized Wang Xian and immediately whispered to that disciple.<br/><br/>“Wang Xian!”<br/><br/>Upon hearing this name, that Disciple’s heart trembled slightly.<br/><br/>Among the current disciples, this name could be said to be as well-known as thunder.<br/><br/>He had killed five disciples of the Willow deity Daoist sect in a short period of time. He was extremely unscrupulous.<br/><br/>Now that they saw the real person, they were still somewhat fearful and fearful.<br/><br/>After all, the other party was very strong. It didn’t matter if you were a disciple of the willow deity Daoist sect or not.<br/><br/>Wang Xian’s gaze swept past them and headed straight for the entrance.<br/><br/>“Wang Xian, some of our senior and junior brothers of the Willow deity Daoist sect have dealt with the desolate beasts outside and spent a lot of money to enter the Divine Kingdom. A few senior brothers have already instructed that the latecomers are not allowed to enter.”<br/><br/>When Wang Xian was walking towards the entrance, a young man beside the entrance looked at him and said faintly.<br/><br/>“Oh? Who gave the Order?”<br/><br/>Wang Xian raised his eyebrows and looked at him as he asked faintly.<br/><br/>“It was our senior brother Long You Feng who told our young master long Zaitian.”<br/><br/>The young disciple replied expressionlessly.<br/><br/>“OH.”<br/><br/>Wang Xian replied indifferently and ignored him as he walked straight into the divine kingdom.<br/><br/>The young man’s expression changed slightly when he saw Wang Xian ignoring him.<br/><br/>“Wang Xian, do you not think highly of our senior brother Long Zaitian and the rest?”He stared at Wang Xian with a gloomy expression.<br/><br/>“Say one more word and I’ll let you die here.”<br/><br/>Wang Xian paused and glanced at him indifferently.<br/><br/>The young Disciple’s expression stiffened when he heard his words. A look of fear flashed across his eyes and he looked extremely embarrassed.\t\t\t\t\t\t</div>", "images": {}, "success": true}