{"id": 85, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15072071.html", "title": "Chapter 3076 - Chapter 3076: 3,075 Icebergs Had Been Destroyed, Yet He Still Dared To Be So Arrogant? 2", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 3076 - Chapter 3076: 3,075 Icebergs Had Been Destroyed, Yet He Still Dared To Be So Arrogant? 2</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 3076: 3,075 icebergs had been destroyed, yet he still dared to be so arrogant? 2<br/><br/>“Hiss!”<br/><br/>Around the Gemini Celestial Thearch’s graveyard, the more than 1,000 disciples of the Willow sect could not help but gasp when they heard Wang Xian’s words.<br/><br/>They stared at that figure in shock, filled with fear and shock.<br/><br/>Wang Xian directly entered the Gemini Celestial Thearch’s divine kingdom, ignoring the rest of the people.<br/><br/>“This fellow is simply too arrogant. He doesn’t even put our senior brother and Young Master Long Zaitian in his eyes. Does he really think that he can kill whoever he wants? Who does he think he is?”<br/><br/>Seeing Wang Xian enter the divine kingdom, the young man growled in a low voice with an extremely embarrassed expression.<br/><br/>“He is indeed a little too arrogant. The Ice Mountain race ambushed him twice and seems to have allowed him to escape on his way back as a fallen leaf. However, that is the ice mountain race. If we anger young master long Zaitian and the rest, the dragon race will be able to destroy him at any time.”<br/><br/>A young man walked over and said with a gloomy face.<br/><br/>“Such an arrogant fellow will not live for long. It might not be long before the ice mountain race exterminates them. He is just a grasshopper after autumn. Since he dares to be so arrogant, he must have given up on himself.”<br/><br/>A middle-aged man looked at the disappearing figure at the entrance with a hint of disdain in his eyes.<br/><br/>Some of the disciples of the willow deity Daoist sect nodded slightly.<br/><br/>Although that Wang Xian was not weak, it still depended on who he was competing with. If he really angered some disciples of the elementary races in the universe in the willow deity Daoist sect, he would not even know how he died.<br/><br/>…<br/><br/>Wang Xian did not know about the discussions at the back. If he knew, he might have to take action to kill those few fellows.<br/><br/>When he heard about the dragon race, he was already tempted to kill them.<br/><br/>The dragon race, the nine-sword race, and the skeleton race. These were all races that the Dragon Palace wanted to destroy.<br/><br/>The reason why they did not take action was that the treasures in front were more valuable than their lives.<br/><br/>“Is this the Divine Kingdom of the Twin Divine Emperors?”<br/><br/>Wang Xian entered a divine kingdom and realized that it was filled with seawater. He squinted his eyes and sized up his surroundings.<br/><br/>His body moved and he flew forward quickly.<br/><br/>The position at the entrance had been cleared by the disciples of the Willow deity Daoist sect. Hence, there were no obstructions along the way.<br/><br/>The entire divine kingdom contained a terrifying amount of energy. There were also some fishes that were formed from the condensation of water attribute.<br/><br/>Some of the fishes saw Wang Xian and attacked him directly.<br/><br/>However, the attack power of these fishes were very weak.<br/><br/>Some of the fishes that might be strong had already been eliminated.<br/><br/>“The Gemini Celestial Thearch uses a saber and a sword. The sword is of the water attribute while the saber is of the fire attribute. This should be the divine kingdom of the water celestial thearch.”<br/><br/>Wang Xian mumbled and flew into the depths of the divine kingdom quickly.<br/><br/>Some of the buildings inside were intact. Some places had already been opened. Clearly, someone had entered.<br/><br/>It was unclear how big the Divine Kingdom was. There was a wave of pressure and energy inside, which reduced his speed by more than half.<br/><br/>It was normal to be restricted from entering someone else’s divine kingdom.<br/><br/>There should be some treasures inside the divine kingdom that had already been obtained by the disciples of the Willow deity Daoist sect.<br/><br/>As he continued to fly in, he discovered that the world ahead had changed.<br/><br/>This place was filled with seawater while the world ahead of him was filled with flames.<br/><br/>It was a bright red building with flames burning on the surface of the building. There were sculptures on the building.<br/><br/>It looked extremely sacred.<br/><br/>“The Divine Kingdom of the blade god Emperor should be in front of us. All the treasures in the Divine Kingdom of the water god Emperor have been obtained by the disciples of the Willow deity Daoist sect? Am I too late?”<br/><br/>Wang Xian frowned slightly and flew forward quickly.<br/><br/>After flying for more than ten minutes, there were still no treasures.<br/><br/>“Roar! Roar! Roar!”<br/><br/>“Bang! Bang! Bang!”<br/><br/>“Be careful!”<br/><br/>Not long after, the sound of battle came from ahead.<br/><br/>“Eh?”<br/><br/>Wang Xian was slightly stunned. He looked ahead with his dragon eyes and flew over immediately.<br/><br/>“What is this?”<br/><br/>Soon, the battleground in front of him entered his vision. A group of more than two thousand people were fighting against the water beasts and fire beasts.<br/><br/>Water Beasts and fire beasts were formed from the condensation of energy. Each and every one of them possessed a terrifying offensive power.<br/><br/>At the back of the water beasts and fire beasts were two twenty-meter-sized water beasts and fire beasts.<br/><br/>They didn’t attack, but they scanned their surroundings spiritually. They were filled with killing intent.<br/><br/>The appearance of the water beasts and fire beasts was similar to the unicorn in the universe.<br/><br/>Behind the two water beasts and fire beasts, there were two coffins. In front of the coffins, there was a saber and a sword.<br/><br/>The fiery red saber and the blue longsword were crossed together. They were placed there quietly and captivating.<br/><br/>When Wang Xian saw the saber and sword, his gaze froze.<br/><br/>Other than these two sabers and swords, there were other treasures around them.<br/><br/>Divine pearls that emitted blue and red light.<br/><br/>Divine trees planted around the two coffins.<br/><br/>On the two divine trees, there were blue and red fruits.<br/><br/>Each of these treasures emitted a fatal allure.<br/><br/>More than two thousand disciples of the Willow deity Daoist sect had made their move, and a portion of them stood in the middle and watched with vigilance.<br/><br/>“Senior sister, be careful!”<br/><br/>Suddenly, a few water beasts extended their long claws from one side and attacked a middle-aged woman.<br/><br/>The expressions of the surrounding women changed as they immediately shouted loudly.<br/><br/>“Be careful!”<br/><br/>In the center, Senior Brother Junzi, who had not made his move, saw this scene and his expression changed slightly. A long sword appeared in his hand and he directly attacked those water beasts.<br/><br/>“Roar Roar Roar!”<br/><br/>Suddenly, the moment he attacked, a huge water beast leader in the center let out an angry roar.<br/><br/>Water pillars shot towards senior brother Junzi.<br/><br/>“Condense!”<br/><br/>Senior Brother Junzi saw that the water beast leader suddenly attacked and his expression changed. He could only change his target.<br/><br/>“Be careful of senior sister.”<br/><br/>“Roar!”<br/><br/>At the side of the water beast, Mi Xin Lu saw her senior sister who was in danger and her expression changed drastically. She let out a low roar and her entire person changed.<br/><br/>Transformation!<br/><br/>Her body transformed into the mi dragon deer. Her body emitted a faint dragon might as her pair of dragon horns released a powerful attack.<br/><br/>She leaped forward and directly caught that senior sister before flying backward.<br/><br/>“Blazing turtle winged beast, defend!”<br/><br/>She hurriedly shouted. The eighth level divine emperor blazing turtle winged beast battle pet flew over to defend against the dozens of water beasts.<br/><br/>“Eh?”<br/><br/>In the center, the group of people who hadn’t made a move all this while saw the change in the Mi Xin deer. Their expressions changed slightly, and their eyes shone.<br/><br/>“This is? A quasi-dragon, a person with Divine Dragon Bloodline!”<br/><br/>Dragon Zaitian, who was of the dragon race, looked at the Mi Xin deer. He didn’t hide the fervor in his eyes.<br/><br/>There were also more than a dozen people who were covered in black robes. Their eyes were flashing with red light as they looked at the Mi Xin deer.<br/><br/>“This is?”<br/><br/>A dozen figures holding sharp swords raised their eyebrows when they saw Mo Xinlu’s form.<br/><br/>“Hu!”<br/><br/>“Thank you, junior sister Xinlu. If it weren’t for your help, senior sister would have been in danger.”<br/><br/>The middle-aged woman who had been saved revealed a smile on her face. Then, she looked at Mo Xinlu in surprise.<br/><br/>“Junior Sister Xinlu, return to your original form.”<br/><br/>She immediately said after she had sensed something with her mind.\t\t\t\t\t\t</div>", "images": {}, "success": true}