{"id": 93, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15072087.html", "title": "Chapter 3084 - Chapter 3084: 3083 Mohan Clan Survivors, Universe Knights", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 3084 - Chapter 3084: 3083 Mohan Clan Survivors, Universe Knights</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 3084: 3083 Mohan clan survivors, Universe Knights<br/><br/>“Congratulations Dragon King for breaking through.”<br/><br/>Within the Dragon Palace, everyone felt the pressure and aura coming from the Dragon King Palace, their eyes filled with excitement.<br/><br/>Prime Minister Gui and the leaders flew over and knelt respectfully within the Dragon King Palace, their faces filled with excitement.<br/><br/>The Fairy Dragon Clan’s fairy maiden matriarch and a few elders were filled with excitement.<br/><br/>The Dragon Palace had the combat strength of a universe knight. This meant that the Dragon Clan’s Divine Dragon bloodline was no longer someone that could be bullied!<br/><br/>“Stand Up!”<br/><br/>Wang Xian smiled and transformed into his human form as he sat on the dragon throne. He asked, “How are the few leaders improving?”<br/><br/>“Dragon King, Ao Qitian and the rest are improving. I estimate that they will be able to achieve a breakthrough in ten days.”<br/><br/>Prime Minister GUI reported.<br/><br/>“Alright!”<br/><br/>Wang Xian nodded his head, he instructed, “Get all the disciples to prepare. After they improve, settle all the problems around the ruins of the Mohan Palace. Also, Prime Minister Gui, send someone to the Milky Way to make some preparations for the Dragon Palace to enter.”<br/><br/>“It’s the Dragon King!”<br/><br/>Prime Minister Gui nodded his head.<br/><br/>“You may leave.”<br/><br/>Wang Xian waved his hand and said faintly to them.<br/><br/>The group of leaders of the Dragon Palace left. Wang Xian closed his eyes slightly and felt the increase in his strength.<br/><br/>Then, he stood up and his body shook.<br/><br/>“Roar!”<br/><br/>A low roar came from within his body. The Shadow of a divine dragon appeared around him.<br/><br/>The face of the Divine Dragon’s shadow, which was fused with the overbearing light, looked a little pale.<br/><br/>With a thought, the entire divine dragon phantom could be enlarged immediately.<br/><br/>This was the nomological supernatural power that Wang Xian had comprehended during his breakthrough this time, the Divine Dragon Phantom.<br/><br/>“Not bad. It’s a very powerful attack method.”<br/><br/>He mumbled and moved his palm. Two thunder-attributed holy feathers appeared in his hand.<br/><br/>This was the holy feather that he had obtained from Dragon in the sky. With a slight movement of his palm, waves of Dragon Qi were nurtured.<br/><br/>Whoosh<br/><br/>The incipient holy wings appeared behind him. Two holy feathers landed directly on the incipient holy wings.<br/><br/>Traces of the power of lightning appeared on the Holy Wings.<br/><br/>However, the power of lightning was too weak.<br/><br/>“There are 49 wind-type holy feathers and 49 thunder-type holy feathers. I am still short of 47. If I gather all the Thunder-type holy feathers, will I be able to possess nine attributes?”<br/><br/>Wang Xian mumbled to himself. If he really possessed nine different attributes, what would the changes be?<br/><br/>Would he be able to achieve a qualitative improvement in his strength?<br/><br/>“I wonder how many Thunder-type holy feathers there are among the dragon-type races.”<br/><br/>Wang Xian thought to himself.<br/><br/>When he opened the universal AI and saw the arrest warrant for the dragon-type races, he smiled faintly.<br/><br/>It was possible for the dragon-type races to have existences stronger than him. However, it would not be so easy to kill him.<br/><br/>“If you want to kill me, I want to exterminate your dragon race as well. The three races shall begin with you.”<br/><br/>As he spoke softly, he moved and arrived at the teleportation formation. He was teleported to the Dragon Palace in the volcano region.<br/><br/>Following that, he flew towards the direction of the Willow deity Daoist sect at a terrifying speed.<br/><br/>He was about to start a war with the dragon race. He had to bring the Mi Xin deer into the Dragon Palace to ensure his safety.<br/><br/>Boom! Boom! Boom<br/><br/>When Wang Xian left the Dragon Palace, he was in the ruins of the Mohan clan.<br/><br/>There were 18 continents in the ruins of the Mohan clan. The main continent was located in the center.<br/><br/>Back then, Wang Xian and the rest had explored all the places in the ruins of the Mohan clan. They also discovered a remnant of the Mohan clan’s people on the main continent. It was the tinder.<br/><br/>According to the information that Wang Xian received back then, there were ten powerhouses at the peak of the Celestial Emperor realm among the remnant of the Mohan clan’s people. They were extremely powerful.<br/><br/>It was also because of this that Wang Xian did not explore the main continent of the Mohan clan.<br/><br/>However, Wang Xian and the rest did not take the existence of the remnant of the Mohan clan to heart.<br/><br/>According to his understanding, although there were many remnant of the Mohan clan and they were very powerful, they were trapped in the main continent and could not get out.<br/><br/>Unless a universe Knight was born.<br/><br/>However, on their continent, resources were scarce, and the chances of a universe knight being born were very slim.<br/><br/>Under such a slim chance, the sky above the main continent was changing.<br/><br/>In the revenge city of the Mohan clan, countless Mohan clan survivors were kneeling on the ground, their faces filled with excitement as they stared at the sky with burning eyes.<br/><br/>An old man was floating in the sky above them. He spread out his arms, and his body emitted an extremely terrifying might.<br/><br/>It was as if the entire world had changed color because of him.<br/><br/>Black characters appeared behind him. The characters floated in the air, and they looked extraordinary.<br/><br/>“Hahaha, I’ve broken through. I’ve finally broken through. Our Mohan clan’s race will rise once again. hahaha!”<br/><br/>A maniacal laughter came out of his mouth. Black characters condensed into black skeletons that spun around him.<br/><br/>His body trembled in excitement.<br/><br/>“Congratulations clan leader for breaking through!”<br/><br/>“Congratulations clan leader for breaking through!”<br/><br/>“Rebuild the Mo Han clan, rebuild the power of the Mo Han clan, destroy the enemies, and rekindle the glory of the Mo Han Clan!”<br/><br/>“Rebuild the Mo Han clan, rebuild the power of the Mo Han clan, destroy the enemies, and rekindle the glory of the Mo Han Clan!”<br/><br/>Everyone below knelt on the ground, raised their heads, and roared with crazy faces.<br/><br/>It had been more than a billion years. They carried the bloodline of the Mo Han clan, carried hatred, and endured hardships in this small continent.<br/><br/>Today was the day that the Mo Han clan would rekindle its glory.<br/><br/>“It’s been more than a billion years. It’s been more than a billion years, and our Mo Han clan has returned. Haha!”<br/><br/>The old man in the sky was also shouting excitedly. He raised his head and revealed his blood red eyes.<br/><br/>“Elders, follow us out of this continent and reclaim our territory.”<br/><br/>A few seconds later, he said slowly.<br/><br/>“Yes!”<br/><br/>Below, the nine old men moved and immediately flew towards a mountain peak.<br/><br/>They called that place recovery peak.<br/><br/>The moment one of their clansmen broke through to the universe knight realm, they would be able to open the array and teleport out.<br/><br/>Weng Weng Weng<br/><br/>10 figures arrived at Recovery Peak. The leader of the Mo Han clan’s remnant nation leader looked excitedly at the entrance ahead.<br/><br/>He waved his arm and landed on it.<br/><br/>The deathly silent array slowly emitted light.<br/><br/>Weng<br/><br/>He slowly stepped into the array and his figure disappeared. The other nine figures followed closely behind.<br/><br/>In the next moment, they arrived above the sky tower.<br/><br/>“This is Our Mo Han Clan Ruins?”<br/><br/>The 10 warriors of the Mo Han clan stood on the sky tower and scanned their surroundings, their eyes flashing with excitement.<br/><br/>“Leader, this used to be the territory of our Mo Han clan. Now, some of it has been occupied by others, and some of it is in a chaotic restriction. This restriction is very strong, even a knight might not be able to force his way in.”<br/><br/>An old man looked around and frowned.<br/><br/>“Take back our territory first!”\t\t\t\t\t\t</div>", "images": {}, "success": true}