{"id": 97, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15072095.html", "title": "Chapter 3088 - Chapter 3088: 3087 Had All Submitted. Those Who Did Not Submit Would Die! Down", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 3088 - Chapter 3088: 3087 Had All Submitted. Those Who Did Not Submit Would Die! Down</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 3088: 3087 had all submitted. Those who did not submit would die! down<br/><br/>In a square on the Mohan clan’s domain planet, the atmosphere was extremely silent.<br/><br/>The experts of the various races and races knelt on the ground, not daring to move.<br/><br/>In the seat in front, the chief of the Mohan clan’s remnant people sat there quietly, his eyes slightly closed.<br/><br/>The experts of the various factions did not dare to breathe loudly.<br/><br/>Time passed bit by bit. The chief of the Mohan clan’s remnant people did not speak. The others also dared to speak.<br/><br/>Half an hour… an hour…<br/><br/>An hour and a half later, the four elders of the Mohan clan who had left with God Emperor Hong Tian returned. Their bodies were emitting an extremely dense bloody aura.<br/><br/>“Clan leader, the entire Qianhai clan has been annihilated.”<br/><br/>An elder walked over and said with a smile.<br/><br/>He revealed his teeth and looked extremely sinister.<br/><br/>When the experts from the various races in the surroundings heard this, their bodies trembled violently.<br/><br/>Extermination. This was extermination!<br/><br/>At the side, God Emperor Hong Tian’s expression was also not too good. His face was somewhat pale.<br/><br/>As the clan leader of the red fog race and an expert at the peak of the god Emperor realm, he had lived for close to a hundred million years.<br/><br/>He had seen many exterminations, but this was the first time he had seen such a bloody extermination.<br/><br/>One race exterminating another race, 99% of them would not exterminate the other party’s ordinary citizens.<br/><br/>They would not deliberately kill those weak people.<br/><br/>However, the Mohan clan’s extermination was complete destruction, planet by planet.<br/><br/>Everyone on top was exterminated like ants.<br/><br/>Seeing hundreds of billions of lives being killed with his own eyes, even he was not used to it.<br/><br/>“Very good. If someone wants to die, let them die.”<br/><br/>The clan leader of the Mo Han clan said faintly and slowly stood up. His gaze swept forward, “All of you, Stand Up!”<br/><br/>“Thank you, clan leader of the Mo Han Clan!”<br/><br/>When everyone heard this, they slowly stood up.<br/><br/>“Hong Tian, you said that there is still a faction that has yet to arrive?”<br/><br/>He looked at God Emperor Hong Tian beside him and asked faintly.<br/><br/>“Sir, there is a faction called the Dragon Palace!”<br/><br/>God Emperor Hong Tian’s eyes lit up when he heard the words of the clan leader of the Mohan clan.<br/><br/>“Sir, that Dragon Palace isn’t simple. They have the bloodline of the Divine Dragon, and it’s even suspected that there’s a pure-blooded divine dragon in the Dragon Palace. Many of our factions tried to capture the divine dragon of the Dragon Palace, but they were all blocked by them. Moreover, they have powerful killers.”<br/><br/>“Currently, 90% of the Dragon Palace resides on the continent in your domain, my Lord. Their nest is there, and there is nothing we can do about it.”<br/><br/>God Emperor Hong Tian continued speaking, his eyes flickering.<br/><br/>“Oh? The bloodline of the Divine Dragon? A pure-blooded divine dragon?”<br/><br/>The clan leader of the Mo Han clan slightly narrowed his eyes.<br/><br/>“Yes, my Lord. If we can destroy the Dragon Palace, we will definitely be able to obtain a large amount of resources. If we can capture them and tame them into battle pets, their value will be even higher.”<br/><br/>“In fact, according to our guesses, the Dragon Palace should have obtained the powerful inheritance of the Divine Dragon.”<br/><br/>God Emperor Hong Tian continued to add.<br/><br/>“Is that so?”<br/><br/>The clan leader of the Mohan clan slightly narrowed his eyes and looked at the experts from the other factions.<br/><br/>“Sir, God Emperor Hong Tian’s words are true. That Dragon Palace is indeed strange. They are improving very quickly and it is very likely that there is a true dragon.”<br/><br/>Seeing the gaze of the clan leader of the Mohan clan, the experts of the other races immediately agreed.<br/><br/>Especially the living soul race and the brain spirit race, their eyes were filled with hatred and excitement.<br/><br/>Once the experts of the Mohan clan set their sights on the Dragon Palace, where would the Dragon Palace escape to?<br/><br/>The nest where the Dragon Palace was located was also the Mohan clan’s territory continent.<br/><br/>It could also be said that the dragon palace was in someone else’s home.<br/><br/>Wouldn’t it be very easy for master to kill you.<br/><br/>“Interesting. The bloodline of the Divine Dragon, a sub-dragon, is very valuable. The dragon blood is also very beneficial to cultivation.”<br/><br/>An elder next to the chief of the Mohan clan slightly narrowed his eyes and said excitedly.<br/><br/>“It seems that our luck is very good!”<br/><br/>A few elders next to him said excitedly with shining eyes.<br/><br/>The Divine Dragon Bloodline, the sub-dragon. Even if they were sealed in the continent, they knew the value of it.<br/><br/>Especially when some of their cultivation was related to the blood of the bloodline.<br/><br/>“Interesting, placing the foundation in the territory of our Mo Han clan, Haha!”<br/><br/>The chief of the Mo Han clan laughed loudly, his eyes shone, “It just so happens that our Mo Han Clan has re-entered the stage of the universe and lacks a lot of resources. If the Dragon Palace really has the sub-dragon and the Divine Dragon, it would be a great opportunity for our Mo Han clan.”<br/><br/>“Lord clan leader, now that the Mo Han clan’s domain is getting closer to the interior, the array formation will become more chaotic. I’m afraid it’ll be a little difficult to enter.”<br/><br/>God Emperor Hong Tian reminded them slightly.<br/><br/>“That’s for you. All the planets and continents are our Mo Han clan’s domain. It’s naturally very easy for us to enter.”<br/><br/>“Let’s go. Today, I want to see if that Dragon Palace is as you’ve said.”<br/><br/>The leader of the Mo Han clan smiled and glanced at all of them.<br/><br/>“Yes!”<br/><br/>The warriors nodded and followed.<br/><br/>Weng<br/><br/>The leader of the Mo Han clan moved his hand and 18 balls appeared.<br/><br/>The balls in the center were glowing while the other 17 were extremely dim.<br/><br/>With his knight level strength, he could light up the other 17 balls.<br/><br/>He waved his hand and landed on one of the balls. The ball started to glow.<br/><br/>“Weng Weng!”<br/><br/>A black hole appeared in front of him. He smiled and walked forward.<br/><br/>The elders immediately followed behind.<br/><br/>Hong Tian God Emperor and the rest followed closely behind.<br/><br/>They stepped into the black hole and appeared in the sky above a continent.<br/><br/>The entire continent appeared desolate and dilapidated, without the slightest bit of vitality.<br/><br/>“It’s not here.”<br/><br/>The clan leader of the Mo Han clan spoke indifferently, placing his palm on the second round ball.<br/><br/>The round ball emitted a luster.<br/><br/>At the back, a group of experts from various factions followed quietly.<br/><br/>However, very quickly, they sensed the urgent messages transmitted from the universe’s AI.<br/><br/>They opened it and looked at it. When they saw the contents, their pupils contracted and their eyes were filled with shock.<br/><br/>The information was about the territory level race of the Qian Hai.<br/><br/>It showed that the entire race of the Qian Hai had been wiped out, not even the weak children and women were spared.<br/><br/>More than half of the Qian Hai territory planet had been destroyed.<br/><br/>Bloody and brutal!<br/><br/>They were a bit scared when they saw this information.<br/><br/>It was rare and bloody to see such a true genocide.<br/><br/>“I didn’t expect that their genocide would be so cruel. A powerful territory-level race was wiped out just like that.”<br/><br/>“I’m afraid that the Dragon Palace is doomed. It’s the best situation for the Dragon Palace to become slaves.”<br/><br/>The experts of each race looked at each other in shock.<br/><br/>The Dragon Palace would also be doomed.\t\t\t\t\t\t</div>", "images": {}, "success": true}