{"id": 90, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15072081.html", "title": "Chapter 3081 - Chapter 3081: The 3080 Was Used To Kill", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 3081 - Chapter 3081: The 3080 Was Used To Kill</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 3081: The 3080 was used to kill<br/><br/>Crack! Crack<br/><br/>A crisp sound came from long Youfeng’s body. The scar from the sword swept across his body.<br/><br/>“No!”<br/><br/>Long Youfeng felt his body being cut into two pieces and let out a terrified roar.<br/><br/>“Dragon Race? Die!”<br/><br/>Wang Xian retracted the scar from the sword and grabbed his body with his dragon claws.<br/><br/>The lightning bolts on his body began to disappear rapidly and his life force disappeared rapidly.<br/><br/>Buzz<br/><br/>Wang Xian waved his arm and stored his body into the mother nest.<br/><br/>Long youfeng had joined the willow deity Daoist sect for a long time. There were no fallen leaves on his body, nor were there any strange lightning symbols on long Youfeng’s body.<br/><br/>Hiss<br/><br/>At this moment, when everyone saw that long youfeng was killed by Wang Xian, they were shocked beyond words.<br/><br/>They stared at him in astonishment. Everyone stopped what they were doing.<br/><br/>Long youfeng was dead!<br/><br/>Under the attack of Wang Xian, he didn’t have the slightest ability to resist.<br/><br/>Instant Kill. A complete instant kill.<br/><br/>Such terrifying strength…<br/><br/>“You actually dared to kill people from our dragon race. You actually dared to kill senior brother long youfeng. Wang Xian, you are courting death. You are courting death!”<br/><br/>At the back, an old man widened his eyes in disbelief as he roared in shock and anger.<br/><br/>That Wang Xian actually dared to kill a member of their dragon race.<br/><br/>“Dragon Eye Lock!”<br/><br/>When Wang Xian heard the old man’s words, he looked over and saw chains appearing around them instantly.<br/><br/>The terrifying chains were sealing off an area of space.<br/><br/>“What… What are you doing? What are you doing?”<br/><br/>The old man saw the chains that appeared around him and sensed that the space was sealed off. His eyes were filled with panic and fear as he shouted loudly.<br/><br/>Around him, the nearly ten disciples of the dragon race were shocked as well. They gulped and felt their scalps turn numb.<br/><br/>“What are you doing? Since we have already made our move, we will naturally kill everyone from your dragon race. What do you think?”<br/><br/>Wang Xian looked at the group of people from the Dragon tribe and sneered.<br/><br/>“You… How dare you! How dare you!”<br/><br/>Hearing his words, their bodies trembled.<br/><br/>“Is this Wang Xian trying to make an enemy out of the Dragon Tribe?”<br/><br/>“This is too crazy. Just because of long Zaitian’s threats, that Wang Xian is going to destroy everyone from the Dragon Tribe!”<br/><br/>“We were wrong about that Wang Xian. He is not arrogant. That is his nature!”<br/><br/>“Crazy. When Long Zaitian threatened, he attacked directly. Furthermore, he had such terrifying strength. No wonder he was able to obtain the sword scar acquired Numinous Treasure. Long youfeng, who was at the peak of the Celestial Emperor Realm, was killed instantly!”<br/><br/>“This time, Long Zaitian kicked a hard board. During this period of time, Long Zaitian was very arrogant and arrogant in our willow deity Daoist sect. Now that he has met a ruthless person, do you guys think that Wang Xian really wiped out the Ice Mountain Race?”? “His strength is too strong!”<br/><br/>In the surrounding area, everyone looked at Wang Xian who was floating in the air arrogantly. Their eyes were filled with respect.<br/><br/>Regardless of whether you are a peak divine emperor or a race’s Heaven’s favorite, I will naturally exterminate you if you provoke me.<br/><br/>This made them recall Wang Xian’s words — the ice mountain was exterminated.<br/><br/>Many people did not take his words to heart just now. Now, it seemed that it was very likely to be true.<br/><br/>Around the coffin of the Gemini Divine Emperor, senior brother Junzi, the elder holding the strange divine tree, and the elder from the skeleton race were all looking at that figure with fear.<br/><br/>They knew that they could not withstand such a terrifying attack.<br/><br/>“Wang Xian! Wang Xian! I want you to die! I want you to die! You actually dared to destroy my body! You actually dared to kill people from our dragon race! Just you wait and see. Just you wait and see, you will be hunted down by the Universe Knights of our Dragon Race!”<br/><br/>At this moment, an extremely violent and furious voice came from the side.<br/><br/>Everyone looked over and saw the head of Dragon Zaitian who was protected by the Lightning symbols.<br/><br/>“Shut up!”<br/><br/>When Wang Xian heard his words, he waved his dragon claws.<br/><br/>Boom<br/><br/>A terrifying suction force came from his mouth.<br/><br/>“I, Dragon Zaitian, swear that I will take your head within half a year. I will grind your bones and scatter your ashes.”<br/><br/>Long Zaitian shouted sternly as he felt his head flying over quickly.<br/><br/>The lightning symbol above his head was flashing with a luster. His head slowly disappeared.<br/><br/>“Alright, it’s Your Turn!”<br/><br/>Wang Xian smiled faintly and turned around to look at the rest of the people from the Dragon tribe.<br/><br/>“No, no, don’t Kill Us! Don’t Kill Us!”<br/><br/>“Let us go! Let Us Go!”<br/><br/>Buzz! Buzz<br/><br/>Out of the nine of them, three of them took out the fallen leaves and fled in fear. However, six of them were shouting in despair.<br/><br/>“Ta Ta!”<br/><br/>Wang Xian walked over with a mocking expression and extended his dragon claws.<br/><br/>Crash<br/><br/>Chains bound them and flew towards the dragon claws.<br/><br/>“No, Senior Junzi, save us, save us!”<br/><br/>A disciple called for senior brother Junzi for help.<br/><br/>When senior brother Junzi heard that, the corner of his mouth twitched.<br/><br/>He was a good person, but he was not stupid.<br/><br/>This Wang Xian obviously wanted to kill all of you. Furthermore, he had already formed a deadly enmity with the dragon race. If he were to make a move, wouldn’t it mean that he had to stand on the side of the Dragon Race?<br/><br/>He could cultivate to the peak of the divine emperor realm. How could he not understand this?<br/><br/>Buzz<br/><br/>Wang Xian waved his arm, and a wave of destructive energy covered their bodies. Their vitality quickly disappeared.<br/><br/>After cleaning up the dragon race, he swept his gaze across the surroundings.<br/><br/>Everyone quickly shifted their gazes away, and their eyes flashed with respect.<br/><br/>In their eyes, this Wang Xian was too ruthless.<br/><br/>Wang Xian cupped his hands at them and left.<br/><br/>Everyone heaved a heavy sigh of relief when they saw his back disappearing.<br/><br/>“There are already seventeen disciples of the willow deity Daoist sect who have died at his hands.”<br/><br/>A middle-aged man said leisurely.<br/><br/>Seventeen disciples of the Willow deity Daoist sect had been killed in a short period of time…<br/><br/>And they had died at the hands of the same person and the same disciple of the willow deity Daoist sect. It was too ruthless.<br/><br/>“The scar of the blade and Sword is a kind of acquired spiritual treasure. After the five elements millstone absorbs the Frost Divine Sword and the scar of the blade, it will definitely possess the offensive power of a universe Knight.”<br/><br/>Wang Xian flew towards the exit in a good mood.<br/><br/>After obtaining the scar of Blade and sword, he could basically confirm that the five elements millstone would achieve a substantial breakthrough.<br/><br/>Furthermore, Wang Xian had just learned that as the five elements millstone belonged to the five attributes, when it absorbed the acquired spiritual treasure, it could also absorb the special characteristics of this acquired spiritual treasure.<br/><br/>This absorption could also be considered as the fusion of the five elements millstone and the acquired spiritual treasure. The Spirit within the acquired spiritual treasure became the underling of the Five Divine Dragons within the five elements millstone.<br/><br/>After absorbing the acquired Numinous Treasure, the five elements millstone could release the characteristics and power of the acquired Numinous Treasure.<br/><br/>This was the reason why the Five Elements Millstone released a frost divine sword that could freeze the world.<br/><br/>If the Five Elements Millstone absorbed more acquired Numinous Treasures, or even acquired Supreme Treasures and innate numinous treasures in the future, wouldn’t it be able to release all kinds of terrifying attacks?\t\t\t\t\t\t</div>", "images": {}, "success": true}