{"id": 94, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15072089.html", "title": "Chapter 3085 - Chapter 3085: 3084 Mohan Clan Survivors, Out Of The Universe Knights", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 3085 - Chapter 3085: 3084 Mohan Clan Survivors, Out Of The Universe Knights</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 3085: 3084 Mohan clan survivors, out of the Universe Knights<br/><br/>“The sky tower used to be the tower where the disciples of the Mohan clan practiced arrays. It’s been over a billion years, yet it hasn’t been damaged at all.”<br/><br/>“After all, there were a few powerful ancestors of the Mohan clan back then. Even the great beings of the skeleton clan couldn’t destroy our base.”<br/><br/>“The position on the side should be our Mohan clan’s meritorious planet. I didn’t expect it to be occupied by a bunch of weaklings. HMPH!”<br/><br/>The ten of them stood on the Tower of Babel, sighing with emotion in their hearts.<br/><br/>“Go Down!”<br/><br/>The leader of the Mohan clan’s survivors moved and instantly appeared in the sky above the nearby planet, sizing up the planet below.<br/><br/>The nine elders immediately followed by the side.<br/><br/>“Our Mohan clan has returned. All of you, leave our planet immediately.”<br/><br/>One of the elders looked down, took a deep breath, and said expressionlessly.<br/><br/>His voice spread throughout the entire planet below.<br/><br/>“Oh? What?”<br/><br/>“What’s the situation? The Mohan Clan has returned? Holy shit, what are they doing? The Mohan clan’s race has been extinct for more than a billion years!”<br/><br/>“Are they crazy? Pretending to be from the Mohan Clan?”<br/><br/>The sudden voice caused everyone on the planet below to be stunned.<br/><br/>They raised their heads and looked up.<br/><br/>Some people looked at them as if they were idiots.<br/><br/>The Mohan clan?<br/><br/>Didn’t you see how long the Mohan clan had been exterminated.<br/><br/>“I’ll give you five seconds to leave our territory immediately!”<br/><br/>Some of the voices entered their ears, and their eyes were filled with awe.<br/><br/>The old man narrowed his eyes and continued speaking.<br/><br/>“Who are you people? This is the territory of the Mang race of the Qian Hai. If you dare to spout nonsense here again, be careful of your tongue.”<br/><br/>An old man flew out from the planet below, his gaze cold as he stared at the ten people floating in the air. They didn’t have the slightest aura of experts.<br/><br/>“Hehe, the race of the Qian Sea? interesting. Since you won’t leave, then all of you will die.”<br/><br/>Killing intent appeared in the eyes of the elder of the Mo Han clan. He waved his arm and a black cloth appeared in the void. Under his body, it instantly covered the entire planet below.<br/><br/>The cloth expanded at a terrifying speed. In just a few seconds, it covered the entire planet.<br/><br/>“What is this?”<br/><br/>“Not good, that old man is a terrifying expert!”<br/><br/>On the planet below, everyone’s expressions changed as they shouted in fear.<br/><br/>“No, no, no, don’t, don’t!”<br/><br/>Feeling the black cloth that was filled with death, everyone let out desperate roars.<br/><br/>“Hua La!”<br/><br/>However, the black cloth was like a grim reaper, directly covering the planet. A trace of fresh blood slowly appeared on it.<br/><br/>“TSK tsk, fresh blood. The Black God cloth hasn’t absorbed fresh blood for more than a billion years. These ants who dare to occupy our Mo Han clan’s territory are simply courting death!”<br/><br/>The Mo Han clan’s remnant people elder said in a cold voice.<br/><br/>“Hiss, what!”<br/><br/>“This… they actually wiped out the entire planet.”<br/><br/>“They… What are they doing? Are they the enemies of the vast race of the Qian Hai?”<br/><br/>Some of the experts in the surroundings saw the situation and their expressions changed drastically. Fear appeared in their eyes.<br/><br/>“I’m warning all of you. I am the clan leader of the Mo Han clan. From today onwards, our Mo Han clan will reestablish itself in this universe. Anyone, get out of the territory of our Mo Han clan!”<br/><br/>“Otherwise, die!”<br/><br/>The clan leader of the Mo Han clan scanned the surroundings with his sharp gaze. His cold voice resounded throughout the entire void space.<br/><br/>Even though they were separated by dozens of planets, they could still hear it clearly.<br/><br/>“What… What level is this existence? He can actually transmit his voice so far away?”<br/><br/>When everyone heard this voice, their faces were filled with shock.<br/><br/>On a planet not too far away, a red mist race expert saw the situation on that planet. His pupils constricted slightly. His body, which was filled with shock, moved, and his figure immediately disappeared.<br/><br/>The next moment, he appeared on a planet in the Mohan clan’s ruins.<br/><br/>This planet now belonged to their Red Mist race.<br/><br/>However, the Red Mist race was not having an easy time.<br/><br/>When their Red Mist race was established, they had become a laughing stock.<br/><br/>Now, they had been fighting with the Dragon Palace for more than a year and had always been at a disadvantage. Many red mist race experts had even been assassinated by the Dragon Palace.<br/><br/>They were now forced to hide in the planet and did not dare to come out.<br/><br/>Even so, some experts of the red mist race had mysteriously disappeared.<br/><br/>This caused the red mist race to be in a terrible situation. Their clan leader was often extremely furious.<br/><br/>Now that a terrifying expert had appeared, he had to immediately report the situation to the person who claimed to be from the Mohan clan.<br/><br/>After all, the planet they were on was once the territory of the Mohan clan.<br/><br/>“If you don’t scram immediately, then all of you can stay here forever!”<br/><br/>In the void, the nine elders of the Mo Han clan’s survivors swept their gazes around them. When they saw that some people on the planet were unmoved, their bodies moved and they immediately flew over.<br/><br/>“Weng Weng Weng!”<br/><br/>At the next moment, the entire world underwent a huge change. A disaster had descended for everyone.<br/><br/>“Not good. Their strength is extremely terrifying. Run, run, run!”<br/><br/>“Those nine are all peak divine emperor experts. We are not their match!”<br/><br/>Some experts sensed their strength and immediately fled with terrified expressions.<br/><br/>In an instant, the area within a radius of tens of billions of kilometers became completely chaotic.<br/><br/>“Sou Sou Sou!”<br/><br/>“Whoever dares to kill our people from the vast Qian Sea is courting death!”<br/><br/>Not long after, more than 10,000 people were teleported over from a planet’s teleportation array.<br/><br/>Among them, the elder in the lead emitted a terrifying murderous aura.<br/><br/>Their gazes swept the surroundings, filled with a dense look.<br/><br/>The instant they sensed that all their disciples’life tokens were damaged, there were many elite disciples from the lush forest of the Qian Sea.<br/><br/>An expert at the peak of the divine emperor realm immediately brought his disciples over.<br/><br/>Their bodies were filled with a terrifying killing intent.<br/><br/>“Are you courting death?”<br/><br/>The clan leader of the Mo Han clan looked over from above. His eyes revealed a cold killing intent.<br/><br/>“It’s you who are courting death!”<br/><br/>He said indifferently. His body trembled as pitch-black characters appeared behind him.<br/><br/>The characters condensed into skeletons and attacked the more than 10,000 people of the Qian Hai faction below.<br/><br/>“HM?”<br/><br/>“You killed our disciple?”<br/><br/>The grand elder immediately raised his head and shouted as he felt the ripples on the right.<br/><br/>However, when he saw the terrifying dark skeleton attack and felt the terrifying killing intent, his expression changed.<br/><br/>“Not good, it’s a universe Knight!”<br/><br/>He shouted in fear, wanting to escape immediately.<br/><br/>Roar<br/><br/>Just as his body started to turn illusory and was about to escape, skulls the size of human heads flew out from the mouth of the huge black skeleton.<br/><br/>These skulls opened their mouths and landed on the bodies of the great beings of Qian Hai.<br/><br/>Even the grand elder of Qian Hai didn’t have time to react.<br/><br/>The terrifying skulls started to swallow them bit by bit, fresh blood splattering everywhere.\t\t\t\t\t\t</div>", "images": {}, "success": true}