{"id": 91, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15072083.html", "title": "Chapter 3082 - Chapter 3082: On The Wanted List Of The 3081 Dragon Race", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 3082 - Chapter 3082: On The Wanted List Of The 3081 Dragon Race</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 3082: On the wanted list of the 3081 dragon race<br/><br/>“A group of senior brothers and sisters have been in the Gemini divine kingdom for a long time. I wonder if they have obtained the treasures inside.”<br/><br/>“I heard that there are treasures at the level of acquired spiritual treasures. I wonder who will obtain them.”<br/><br/>“It is possible for senior brother long youfeng to obtain them. After all, in the willow deity Daoist sect, the dragon race is very powerful. In particular, young master long Zaitian is not weak either. He has many treasures.”<br/><br/>“That is hard to say. Our Senior Brother Junzi is also very powerful. That senior brother from the skeleton race is also very mysterious. His strength is unfathomable.”<br/><br/>Outside the Gemini Divine Empire, a group of more than a thousand disciples gathered outside and discussed curiously.<br/><br/>The group of senior brothers and sisters had already been inside for more than a day. They were very curious about the situation inside.<br/><br/>Unfortunately, they were too weak. They could not compete with the group of senior brothers and sisters inside, so they simply did not enter.<br/><br/>“Eh? Someone is coming out!”<br/><br/>At this moment, a middle-aged man looked into the divine nation and said in surprise.<br/><br/>“It seems to be that Wang Xian. Why is he the only one coming out?”<br/><br/>“He must have been chased out by long you feng, Long Zaitian, and the rest. Haha, our Senior Brothers and sisters went through a lot of trouble to chase the surrounding desolate beasts into the divine nation. He just sat back and enjoyed the fruits of the labor. How could it be so simple?”<br/><br/>“It’s really possible. The other senior brothers and sisters didn’t come over. It’s possible that they chased him out. After all, this fellow doesn’t have a good reputation in our willow deity sect.”<br/><br/>Some people looked at that figure and discussed softly.<br/><br/>Wang Xian walked out from the Gemini Divine Kingdom. He heard the discussions outside and revealed a faint smile on his face.<br/><br/>“Everyone, may I ask who are the disciples of the Dragon Race?”<br/><br/>Wang Xian looked around and landed his gaze on a young man.<br/><br/>“HMM?”<br/><br/>The young man was slightly stunned when he heard his sudden question.<br/><br/>“We are from the dragon race. Why?”<br/><br/>At the front, a few middle-aged young men looked at Wang Xian and replied coldly.<br/><br/>One of them was the one who stopped Wang Xian when he entered.<br/><br/>At this moment, the corner of the young man’s mouth curled up slightly as a faint smile appeared on his face.<br/><br/>“Oh, it’s nothing. I’ll send you guys on your way!”<br/><br/>Wang Xian said faintly as he waved his arm.<br/><br/>Boom<br/><br/>A terrifying attack arrived in an instant. The annihilated energy swept across their bodies.<br/><br/>The four of them fell to the ground without any signs of life.<br/><br/>Wang Xian took a glance and flew forward.<br/><br/>“Hiss…”<br/><br/>“What… what… what is that Wang Xian doing? Does he know what he is doing?”<br/><br/>With a casual wave of his hand, he killed the disciples of the dragon race at the Willow deity Daoist sect. This…<br/><br/>Did he know that they were the dragon race?<br/><br/>One of the overlords in the Milky Way.<br/><br/>Was he courting death?<br/><br/>Everyone swallowed their saliva and looked at the corpses in shock.<br/><br/>“Look at the universe’s AI. There’s news that the iceberg race has been exterminated.”<br/><br/>At this moment, another shocked voice sounded.<br/><br/>The iceberg race had been exterminated?<br/><br/>Everyone was slightly stunned when they heard this. Some people took out their AI and immediately searched for information on the iceberg race.<br/><br/>When he saw the news of the ice mountain race being exterminated, his eyes widened.<br/><br/>Who exterminated it?<br/><br/>Was It related to that Wang Xian?<br/><br/>While the disciples of the Willow deity Daoist sect were discussing in astonishment, not long after, disciples of the Willow deity Daoist sect walked out from the Divine Empire of the Gemini Divine Empire.<br/><br/>When everyone learned that Wang Xian had casually killed a few other disciples of the dragon-descent race, they took a deep breath.<br/><br/>This Wang Xian wanted to make an enemy out of the dragon-descendant race.<br/><br/>When the disciples outside found out about the situation inside, they widened their eyes and revealed an astonished expression.<br/><br/>When the disciples inside found out that the iceberg race had been exterminated, they were also extremely shocked.<br/><br/>They were very clear about the strength of the iceberg race. Now, they were actually exterminated.<br/><br/>Was it done by that Wang Xian alone, or did he have his own background?<br/><br/>Exterminating a powerful domain-level race was something that only a primary race in the universe could do.<br/><br/>…<br/><br/>“Clan leader, all of our disciples in the Willow deity Daoist sect were killed, except for Tian and the three disciples who had fallen leaves and returned!”<br/><br/>At the same time, in a huge palace on a huge island at the edge of the Milky Way, an old man reported to a figure with an embarrassed expression.<br/><br/>The figure’s entire body was shrouded in purple mist and he was sitting on a huge beast throne.<br/><br/>In the sky, a head that looked like a dragon’s head was hanging.<br/><br/>On the right side below, there was a young man. The young man was extremely weak and his face was filled with hatred.<br/><br/>“Grandfather, he took my lei yu away and I was almost killed. Grandfather, kill him. You must kill him.”<br/><br/>Long Zaitian stood below and clenched his fists. He gritted his teeth and roared.<br/><br/>This time, not only was his physical body destroyed, but more importantly, two of his Lei Yu were taken away.<br/><br/>To him, this was an extremely precious treasure.<br/><br/>Their entire dragon race didn’t have many Lei Yu.<br/><br/>“I have already sent people to investigate. That Wang Xian is not as simple as he looks. The iceberg race was exterminated. It should be his people who did it.”<br/><br/>A voice came from the illusory figure shrouded in purple clouds on the stage. It was filled with coldness.<br/><br/>“After we have a clear understanding of his confidence, we will exterminate him and those who are related to him.”<br/><br/>After a pause, the illusory figure shrouded in purple clouds continued to speak.<br/><br/>“Yes!”<br/><br/>The elder below nodded and walked out respectfully.<br/><br/>“Recover your strength first. You Don’t have to ask about anything else.”<br/><br/>The figure shrouded in purple mist moved and spoke to Long Zaitian.<br/><br/>“It’s Grandpa!”<br/><br/>Long Zaitian opened his mouth and didn’t ask any more questions. He walked out with a gloomy face.<br/><br/>While the dragon race was searching for information on Wang Xian, Wang Xian was flying rapidly in the Milky Way with a smile on his face.<br/><br/>There were two pieces of good news. The eight-limbed demonic fiend had already collected all the treasures and resources in the Ice Mountain race.<br/><br/>He had also found a buyer for all the war pets in his hands.<br/><br/>With the resources of the entire ice mountain race and the resources that he had sold the blazing turtle winged beast, it was enough to increase his strength.<br/><br/>“After my breakthrough and the corpses of the experts of the ice mountain race, the Dragon Palace will be comparable to an elementary race in the universe. I can send the disciples of the Dragon Palace to the Milky Way to quickly hunt desolate beasts to improve myself.”<br/><br/>Wang Xian muttered to himself. With a wave of his arm, the Immortal Palace’s War Pet ship appeared in front of him.<br/><br/>He landed on it and quickly flew in the direction of the silver continent.<br/><br/>At the same time, the reputation of the Immortal Palace’s War Pet in the area of the universe’s AI, the Milky Way, was completely shaken by the sale of the peak-stage divine Emperor War Pet.<br/><br/>A peak-stage divine emperor war pet, what kind of concept was that?<br/><br/>This was the realm of a peak domain-level race expert.<br/><br/>Now, the Immortal Palace’s war pets were actually selling war pets of such a level. This had never happened in the Milky Way region for tens of millions of years, or even longer.\t\t\t\t\t\t</div>", "images": {}, "success": true}