{"id": 98, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15072097.html", "title": "Chapter 3089 - Chapter 3089: 3088 Took One Hit", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 3089 - Chapter 3089: 3088 Took One Hit</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 3089: 3088 took one hit<br/><br/>“There’s nothing here either. Are you sure that the Dragon Palace is in the continent under our domain?”<br/><br/>The clan leader of the Mohan clan entered the continent through the round balls.<br/><br/>They had explored five or six continents in a row, but they still didn’t find the Dragon Palace.<br/><br/>An elder of the Mohan clan asked with a frown.<br/><br/>“There’s a ninety percent chance that the Dragon Palace placed its nest on the inner continent.”<br/><br/>God Emperor Hong Tian frowned slightly from the side.<br/><br/>“There are still more than a dozen continents. Continue to investigate.”<br/><br/>“You’d better not disappoint me!”<br/><br/>In the center, the chief of the Mohan clan glanced at God Emperor Hong Tian indifferently.<br/><br/>This made God Emperor Hong Tian’s expression change slightly.<br/><br/>After witnessing the brutality of the chief of the Mohan clan, he didn’t know what he would do.<br/><br/>“Lord clan leader, the Dragon Palace’s headquarters are all placed in the ocean. Does the Mohan clan have a continent with a relatively vast ocean?”<br/><br/>At this moment, God Emperor Hong Tian’s heart stirred and he immediately asked.<br/><br/>“Oh?”<br/><br/>The clan leader of the Mohan clan raised his brows slightly. His palm moved the ball in front of him and locked onto one.<br/><br/>“Weng!”<br/><br/>A black hole appeared in front of everyone once again. The clan leader of the Mohan clan stepped into it directly.<br/><br/>The rest of them followed closely behind.<br/><br/>In the next moment, a continent filled with oceans appeared in everyone’s sight.<br/><br/>“Huh?”<br/><br/>Seeing the ocean below, everyone narrowed their eyes slightly.<br/><br/>The chief of the Mohan clan glanced around and flew straight ahead.<br/><br/>“It should be here. The nest of the Dragon Palace should be here.”<br/><br/>“The Dragon Palace has always relied on this safe nest. That’s why they can act so arrogantly. Now, let’s see how they can escape!”<br/><br/>The experts from the living soul race and the brain spirit race scanned their surroundings with burning eyes.<br/><br/>The Dragon Palace had killed a large number of experts from their two races.<br/><br/>They hated the Dragon Palace immensely.<br/><br/>Seeing that the Dragon Palace’s nest was about to be found and that their disaster was about to arrive, everyone’s faces were filled with ferocious excitement.<br/><br/>In front of them, God Emperor Hong Tian was also filled with a cold smile.<br/><br/>This time, the Dragon Palace shall die.<br/><br/>“Buzz!”<br/><br/>In front of them, the chief of the Mo Han clan’s remnant people stopped on the surface of the sea. He looked down with a trace of a smile in his eyes.<br/><br/>With a wave of his arm, the seawater beneath him split apart. The seawater that was tens of thousands of kilometers deep slowly flowed to both sides.<br/><br/>With a wave of his hand, the rivers and seas were overturned.<br/><br/>Behind him, a group of experts from different races flew over. When they looked down, their eyes sparkled.<br/><br/>Many of their forces coveted the Dragon Palace.<br/><br/>The Living Soul clan, for example, was filled with hatred.<br/><br/>Now that the Dragon Palace’s lair had appeared, everyone stared at it closely.<br/><br/>“Splash!”<br/><br/>At the same time, in the Dragon Palace below.<br/><br/>Prime Minister Turtle and the others had already received the news when the surroundings of the Mohan clan ruins underwent a huge change.<br/><br/>The appearance of a universe Knight had killed all the living beings on the planet of the Mohan clan ruins.<br/><br/>This was closely followed by the extermination of the race of gluttony in the Qian Sea.<br/><br/>News after news made Prime Minister Turtle and the others realize the seriousness of the problem.<br/><br/>“They actually came to our Dragon Palace.”<br/><br/>In the Dragon Palace, Wang Xian walked out from the Dragon Gate and looked up.<br/><br/>After receiving the news from Prime Minister Gui, he immediately rushed over from the Milky Way.<br/><br/>Just a moment ago, he was still discussing with Prime Minister Gui about the remnant citizens of the Mohan clan. Now, the remnant citizens of the Mohan clan actually came directly.<br/><br/>Looking at the seawater surging in the surroundings, it was obvious that they had come with ill intentions.<br/><br/>“A universe knight?”<br/><br/>The corner of Wang Xian’s mouth curled up slightly.<br/><br/>“Dragon King, one universe knight and nine peak-stage divine emperor powerhouses.”<br/><br/>“There are also a group of powerhouses from the surrounding forces behind.”<br/><br/>Prime Minister Gui and the leaders of the Dragon Palace followed behind and said.<br/><br/>“TSK TSK tsk, they come with ill intentions!”<br/><br/>The eight-limbed demonic fiend and the rest narrowed their eyes slightly and smiled sinisterly.<br/><br/>Whoosh! Whoosh! Whoosh! Whoosh<br/><br/>At this moment, the chief of the Mohan clan slowly descended from above.<br/><br/>“Dragon Palace, I didn’t expect you guys to hide so well. I really didn’t expect that.”<br/><br/>God Emperor Hong Tian stared below and locked onto Wang Xian and the rest. He couldn’t help but growl in a low voice.<br/><br/>“What is the meaning of all of you coming here in such a grand manner?”<br/><br/>Wang Xian took a glance at God Emperor Hong Tian. His gaze landed on the chief of the Mohan clan and asked faintly.<br/><br/>“Do you know whose territory you are in?”<br/><br/>The Chief of the Mohan clan asked faintly.<br/><br/>“This place used to belong to the Mohan clan in the past.”<br/><br/>Wang Xian looked at him and continued calmly.<br/><br/>“It’s good that you know. Now, your master is back.”<br/><br/>The chief of the Mohan clan seemed to be describing a fact calmly. He was hovering about a thousand meters away from Wang Xian and the rest.<br/><br/>As he spoke, he looked at the Dragon Palace in front of him curiously.<br/><br/>“This is the Dragon Palace? With such power, it looks very similar to the legendary Divine Dragon Palace. It seems like you guys have obtained some of the heritage of the Divine Dragon. I heard that there are divine dragons in your Dragon Palace. Call them over and let me take a look.”<br/><br/>As he sized them up, the chief of the Mohan clan continued to speak.<br/><br/>“Hehe.”<br/><br/>Wang Xian laughed when he heard his words.<br/><br/>“TSK TSK TSK, our master? Giving Us Orders?”<br/><br/>Hearing their words, Ba Qi laughed in amusement. He was full of mockery.<br/><br/>“That guy from the Dragon Palace is courting death!”<br/><br/>“I’m afraid they don’t know who they are talking to. Maybe they don’t know the specific situation in the outside world.”<br/><br/>“They actually dare to speak to the clan leader of the Mohan clan like this, TSK TSK…”<br/><br/>At the back, the experts from the various factions revealed playful smiles when they saw this scene.<br/><br/>“Do you know who you are talking to? You’re courting death.”<br/><br/>Before the clan leader of the Mohan clan could speak, God Emperor Hong Tian looked at Ba Qi with killing intent in his eyes.<br/><br/>He waved his arm and a staff appeared in his hand. A pale white claw instantly grabbed towards Ba Qi.<br/><br/>“Keke, God Emperor Hong Tian, you piece of trash actually became someone else’s dog. Interesting, interesting!”<br/><br/>Ba Qi laughed out loud and his arm turned pitch-black. He then extended his arm and grabbed the pale white claw, destroying it.<br/><br/>“Oh?”<br/><br/>“Peak God Emperor Realm Expert?”<br/><br/>God Emperor Hong Tian sensed Ba Qi’s attack and focused his gaze.<br/><br/>“There are peak-stage divine emperor experts in the Dragon Palace!”<br/><br/>The experts from the other races behind were also slightly surprised. This was the first time the Dragon Palace had displayed peak-stage divine emperor-level combat strength.<br/><br/>“I’ve already given all of you a chance to Live!”<br/><br/>The clan leader of the Mo Han clan looked at them expressionlessly and said faintly.<br/><br/>“A chance to survive? Initially, I wanted to deal with the matter of the Mohan clan ruins after a period of time. Now that I’m here, it’s perfect. It saves me a lot of time.”<br/><br/>When Wang Xian heard the words of the chief of the Mohan clan, he smiled gently and swept his gaze across all of them.<br/><br/>Coincidentally, everyone was here.<br/><br/>He also wanted to test his strength.\t\t\t\t\t\t</div>", "images": {}, "success": true}