{"id": 109, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15072119.html", "title": "Chapter 3100 - Chapter 3100: The Hearts Of The 3,099 People Were Like Snakes Swallowing An Elephant", "volume": 2, "volume_title": "Volume 2", "body": "<h1>Chapter 3100 - Chapter 3100: The Hearts Of The 3,099 People Were Like Snakes Swallowing An Elephant</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 3100: The hearts of the 3,099 people were like snakes swallowing an elephant<br/><br/>“Eh? Junior brother Wang Xian gifted us a battle angel of the same level?”<br/><br/>“This… brother Wang Xian, is this true? Each of us has a battle angel of the same level.”<br/><br/>“Really? Then we are really grateful to brother Wang Xian!”<br/><br/>When the disciples of the Willow deity Daoist sect heard Wang Xian’s words, their eyes lit up with excitement.<br/><br/>Each of them would be given a battle angel of the same level. This was a huge harvest for them.<br/><br/>With their own strength, it would be extremely difficult for them to obtain a battle angel of the same level as them.<br/><br/>After all, only one-tenth of their strength was suppressed here.<br/><br/>Under such circumstances, they would only be able to obtain a few battle angels of a lower level than them.<br/><br/>“Of course!”<br/><br/>Wang Xian replied indifferently.<br/><br/>“Haha, That’s Great!”<br/><br/>“Then we don’t need to do anything. We need to break open a few boxes of battle angels carefully and worry about encountering danger. Big Brother Wang Xian can suppress over a thousand battle angels at one go!”<br/><br/>The disciples of the Willow deity Daoist sect said happily.<br/><br/>Even the way they addressed him had changed!<br/><br/>“Junior brother is really generous. We don’t need junior brother Wang Xian’s help.”<br/><br/>Compared to the excited disciples of the Willow Deity sect, senior brother Lu, senior brother Kong, senior brother Xu, and the rest of them didn’t look too good.<br/><br/>They looked over and said indifferently.<br/><br/>Wang Xian ignored them and continued to suppress the rest of the battle angels.<br/><br/>“Brother Wang Xian, you can do it!”<br/><br/>“Brother Wang Xian, you can do it!”<br/><br/>The disciples of the Willow deity Daoist sect no longer had the need to make a move. They came to the back of Wang Xian and cheered him on.<br/><br/>Now, they suddenly felt that Wang Xian was really a good person.<br/><br/>Although he was unscrupulous, he was the one who provoked Wang Xian first. He did not take the initiative to provoke others.<br/><br/>“What is that divine weapon of brother Wang Xian? Why Is it so powerful? There’s no need for brother Wang Xian to make a move!”<br/><br/>“This is definitely a powerful acquired spiritual treasure.”<br/><br/>“That’s for sure. Junior brother Wang Xian obtained the sword scar of the Gemini Celestial Thearch the last time!”<br/><br/>When the disciples of the Willow deity Daoist sect saw Wang Xian continuing to make a move, they discussed among themselves as they harvested more than a thousand battle angels at once.<br/><br/>“Boom!”<br/><br/>“Not good, it’s a battle angel at the peak of the celestial thearch. There’s also a ninth-level celestial thearch!”<br/><br/>At this moment, a terrifying boom was heard from the side. Following that, senior brother Lu and the two elders at the peak of the celestial thearch were sent flying backward.<br/><br/>Beside them, four to five eighth-level celestial thearch powerhouses and two ninth-level celestial thearch powerhouses were enveloped by the attack. Their faces were filled with shock as they hurriedly dodged to the side.<br/><br/>The 2 Type 9 divine emperor powerhouses reacted relatively quickly, but the Type 8 divine emperor powerhouse was in trouble.<br/><br/>His strength was already suppressed, and he had even suffered the attacks of peak divine emperor powerhouses and Type 9 divine emperor powerhouses. Even if they were not the main targets of the attacks, the terrifying aftershocks still arrived in front of them in an instant.<br/><br/>“Ahhhhh! ! !”<br/><br/>Screams of pain rang out, and the 5 Type 8 divine emperor powerhouses did not even have the strength to resist. They were directly crushed by the terrifying attacks, losing their lives in an instant.<br/><br/>The five corpses flew towards the rear.<br/><br/>Peak divine emperor, rank nine divine emperor battle angels, and more than 20 rank six divine emperor battle angels all attacked them once again.<br/><br/>“Senior Martial Brother Junzi, senior martial brother Xu, Senior Martial Brother Kong, request for reinforcements!”<br/><br/>Senior martial brother Lu and the others were greatly shocked. They immediately cried out for help. Streams of energy shot towards the battle angels.<br/><br/>The Battle Angels’offensive power was not weak among those of the same level. Furthermore, they had rich combat experience. Terrifying light attribute law attacks swept towards them.<br/><br/>“Defend! Defend with all your might! Divine Emperor rank eight disciples, retreat immediately!”<br/><br/>Senior Martial Brother Lu and the others’expressions changed drastically as they shouted loudly.<br/><br/>“Senior martial brother Lu, hold on!”<br/><br/>Senior Martial Brother Junzi’s figure moved and he immediately flew over.<br/><br/>“Hold on for twenty seconds. We have suppressed the battle angel in front of us.”<br/><br/>Senior Brother Kong, senior brother Xu, and the others looked over. Their pupils constricted as they shouted loudly.<br/><br/>“Not good!”<br/><br/>“A battle angel at the peak of the Divine Emperor Realm. In the Mystic Crescent Moon realm, they can fight against ten experts at the peak of the Divine Emperor Realm.”<br/><br/>“This is bad!”<br/><br/>The disciples of the Willow deity Daoist sect immediately looked over and their expressions changed drastically.<br/><br/>“Peng, Peng, Peng!”<br/><br/>That Battle Angel at the peak of the divine realm moved and directly attacked senior martial brother Lu and the others. Its terrifying speed made it impossible for them to dodge.<br/><br/>The three of them had an abnormally awkward expression as they immediately released their nomological divine arts to defend with all their might.<br/><br/>The terrifying battle power rushed towards their surroundings.<br/><br/>Senior Martial Brother Junzi flew over and attacked the battle Angel with numerous sharp swords.<br/><br/>“Holy Sword Hoop!”<br/><br/>The Battle Angel, who was at the peak of the Celestial Emperor Realm, shouted coldly. Numerous light swords surrounded the surroundings and attacked the surroundings indiscriminately.<br/><br/>“Oh no!”<br/><br/>Senior Brother Junzi’s long sword blocked the attacks of the Holy Swords. His face turned slightly pale.<br/><br/>“Junior brother Wang Xian, two seniors!”<br/><br/>Senior Sister Lingxin’s expression changed drastically when she saw this scene. She couldn’t help but shout at Wang Xian.<br/><br/>“Humans are insatiable. With the Battle Angels that they released, they can destroy all of you!”<br/><br/>Wang Xian swept his gaze across and said calmly.<br/><br/>One Battle Angel at the peak of the celestial thearch level, one celestial thearch at level nine, and the remaining eighteen were enough to wipe out all the disciples of the Willow deity Daoist sect.<br/><br/>“Junior brother Wang Xian, request for reinforcements!”<br/><br/>Senior Brother Junzi turned pale and asked Wang Xian for help.<br/><br/>“As I said earlier, I will not take action if anything happens to them. I don’t have the ability to do so. Yet, I broke through the glass boxes of more than 20 battle angels without any scruples. I am simply courting death.”<br/><br/>“Moreover, I am not familiar with them. I can take action and take out half of my gains!”<br/><br/>Wang Xian said.<br/><br/>Asking them to take half of the harvest to help them suppress the Battle Angel who was at the peak of the Celestial Emperor realm was already a huge favor to them.<br/><br/>After all, they would die if he didn’t take action.<br/><br/>“Half of the harvest?”<br/><br/>Senior brother Lu and the rest looked extremely embarrassed when they heard Wang Xian’s words. They couldn’t help but shout, “Junior brother Wang Xian, isn’t half of the harvest too much? !”<br/><br/>“Hehe!”<br/><br/>Wang Xian shifted his gaze when he heard their words. He controlled the five elements millstone to continue suppressing the rest of the battle angels.<br/><br/>“Senior brother Lu!”<br/><br/>Senior Brother Junzi’s expression changed when he saw that Wang Xian was ignoring them. He immediately shouted at senior brother Lu and the rest.<br/><br/>Senior Brother Junzi knew Wang Xian’s character. Even if he said that he would not help them, they would not take action even if they were killed.<br/><br/>Junior brother Wang Xian was a person who was very clear about his grudges!<br/><br/>“Alright, we agree, we agree!”<br/><br/>Senior brother Lu and the two elders from the same race looked at each other. They were filled with unwillingness as they replied loudly.<br/><br/>“Alright!”<br/><br/>Wang Xian nodded his head and suppressed the battle angel in front of him at a moderate speed. With a wave of his arm, the Five Elements Millstone attacked the battle angel at the peak of the Celestial Emperor Realm.<br/><br/>An incomparably resplendent frost divine sword headed straight for the Battle Angel who was at the peak of the Celestial Emperor Realm.\t\t\t\t\t\t</div>", "images": {}, "success": true}