{"id": 102, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15072105.html", "title": "Chapter 3093 - Chapter 3093: 3092 Venerable Wu Shou", "volume": 2, "volume_title": "Volume 2", "body": "<h1>Chapter 3093 - Chapter 3093: 3092 Venerable Wu Shou</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 3093: 3092 venerable Wu Shou<br/><br/>“Huh?”<br/><br/>Wang Xian and the rest were slightly shocked when they saw Wu Shou’s speed had suddenly dropped drastically.<br/><br/>“Dragon King, we seem to have been discovered!”<br/><br/>Tian Cheng frowned slightly and said.<br/><br/>“Do it!”<br/><br/>Wang Xian narrowed his eyes and dashed out directly.<br/><br/>His speed was extremely terrifying, comparable to a level two universe knight.<br/><br/>In an instant, the distance between him and Wu Shou was reduced to a few hundred million kilometers.<br/><br/>Behind him, Tian Cheng and the rest also moved and flew over immediately.<br/><br/>“Woo Woo!”<br/><br/>Wu Shou was not too surprised when he saw Wang Xian and the rest. His eyes were filled with brutality.<br/><br/>“Boom Boom Boom!”<br/><br/>The next moment, all the volcanoes in the surrounding erupted abruptly. Rolling lava rose up and attacked Wang Xian directly.<br/><br/>Wang Xian’s expression changed slightly when he saw the volcanic attack that covered a radius of more than a billion kilometers.<br/><br/>Ao qitian, Ao Jian, and the eight-headed demonic fiend saw this terrifying attack from behind. Their expressions changed drastically and they hurriedly took action to block it.<br/><br/>“Eight-word kill!”<br/><br/>The Heaven Formation Formation was completed and attacked Wu Shou in front of him directly.<br/><br/>Wang Xian waved his arm and the five elements grinding mill appeared in his hand. It formed a line of defense and his speed suddenly increased.<br/><br/>“Woo Woo!”<br/><br/>Sensing Wang Xian’s terrifying speed, Wu Shou’s body crashed heavily into the ground.<br/><br/>“Boom Boom Boom!”<br/><br/>Around it, columns of fire rose up and spread toward Wang Xian.<br/><br/>“Buzz!”<br/><br/>Wang Xian ignored the attack of the columns of fire and charged straight in.<br/><br/>“Five Elements Dragon Claw!”<br/><br/>He made a grab in the air and a grayish five elements dragon claw appeared in front of him. It clawed at Wu Shou.<br/><br/>“Dragon Eye Lock!”<br/><br/>At the same time, the divine dragon chains flashed in his pupils. Chains appeared around Wu Shou in an instant.<br/><br/>An incomparably huge chain emerged from the lava and headed toward Wu Shou.<br/><br/>Clang<br/><br/>The sound of a sharp sword was heard from the five elements grinding. A dazzling frost divine sword slashed toward Wu Shou’s pupils.<br/><br/>“Holy Dragon Shadow!”<br/><br/>“Roar!”<br/><br/>Wang Xian’s body trembled. A vast dragon shadow in his body attacked Wu Shou.<br/><br/>Terrifying attacks descended upon the sky above him in an instant.<br/><br/>“Woo Woo!”<br/><br/>Feeling the threatening attacks, Wu Shou’s eyes revealed a look of fear.<br/><br/>“Bang Bang Bang!”<br/><br/>The surrounding volcanoes suddenly exploded. His body drilled downwards.<br/><br/>“Chain, control!”<br/><br/>Seeing that it wanted to escape, Wang Xian waved his dragon claw and grabbed onto a chain. He then grabbed towards the sky.<br/><br/>“Eight characters, seal!”<br/><br/>At this moment, the Heaven Formation flew over. The characters on the eight characters in front of him formed many seals and headed towards Wu Shou.<br/><br/>“Woo Woo!”<br/><br/>Wu Shou looked at the chains and black seals that were wrapped around his body. His eyes were filled with blood-red fury.<br/><br/>“Roar! Roar!”<br/><br/>He let out a roar and opened his gigantic mouth.<br/><br/>A volcano slowly emerged from his mouth. The volcano was crimson red and contained a terrifying power.<br/><br/>On the volcano, thick liquid seeped out and covered his body.<br/><br/>Crack! Crack! Crack<br/><br/>The chains started to collapse and the black seal was burning.<br/><br/>“There’s no way to escape!”<br/><br/>Wang Xian saw some of the chains crumbling and his eyes turned cold. In the next moment, his figure appeared above Wu Shou’s pupils.<br/><br/>“Slash of the sword!”<br/><br/>“Dragon Claw!”<br/><br/>The five elements grinding mill and Wang Xian unleashed a terrifying attack at the same time. They attacked one of its eyes.<br/><br/>“Bang!”<br/><br/>The terrifying slash of the sword and Dragon Claw caused its thousand-meter-wide eye to explode.<br/><br/>“Awoo! Awoo!”<br/><br/>A miserable scream came from its mouth.<br/><br/>A terrifying white fog was released from its exploded eyes.<br/><br/>The white fog enveloped its body.<br/><br/>“Huh?”<br/><br/>Wang Xian frowned slightly when he saw that the white fog covered his vision.<br/><br/>“Suppress!”<br/><br/>He shouted in a low voice. The five elements grindstone grew bigger and pressed down directly.<br/><br/>Boom<br/><br/>Crack! Crack! Crack<br/><br/>Some cracking sounds were heard and the white fog slowly disappeared.<br/><br/>When Wang Xian saw the situation inside, he frowned.<br/><br/>“Oh no, this guy has escaped!”<br/><br/>At this moment, members of the Dragon Palace flew over from the back. Their expressions were a little unpleasant.<br/><br/>At the moment when the battle broke out, they didn’t join in at all. The attacks from Wu Shou were all aoe attacks, making them tired of resisting.<br/><br/>As soon as he charged out of the defense, Wu Shou had already escaped.<br/><br/>The entire battle lasted for only ten seconds.<br/><br/>Wang Xian looked down and saw pieces of leather-like objects. He frowned.<br/><br/>“It should be a kind of escaping ability similar to a golden cicada escaping from its shell. I didn’t expect Wu Shou to be so difficult to deal with.”<br/><br/>The sky array flew over and his expression was a little ugly.<br/><br/>“Dragon King, the Red Fog clan’s fire fog patriarch is a level two universe knight. He couldn’t even leave Wu Shou behind. This Wu Shou is not as simple as I thought!”<br/><br/>Xian Lingyuan scanned the surroundings and said.<br/><br/>“Those who can cultivate to a universe knight are not simple.”<br/><br/>Wang Xian sighed slightly and shook his head helplessly.<br/><br/>He had initially thought of suppressing this Wu Shou. If he could tame it and sell it, he could increase the number of universe knights in the Dragon Palace by eight or nine.<br/><br/>But now, it seemed to be a little difficult.<br/><br/>“Let’s search around and see if that Wu Shou is nearby. Ao Feng, where did you find this Wu Shou? Bring me there to take a look.”<br/><br/>Wang Xian said to Ao Feng unwillingly.<br/><br/>“It’s the Dragon King!”<br/><br/>Ao feng nodded and flew forward with Wang Xian.<br/><br/>“Let’s go and search in groups of ten. Be careful.”<br/><br/>The Heaven Array said to the rest of the leaders of the Dragon Palace.<br/><br/>“Alright!”<br/><br/>Ao Qitian and the rest nodded their heads.<br/><br/>After that, Wang Xian and the rest searched the place for two days but did not find Wu Shou.<br/><br/>Helpless, they could only return to the volcano region.<br/><br/>“Wu Shou has been severely injured this time. It will be even more difficult to suppress it next time. I’m afraid that it will recuperate in the depths for decades, centuries, or even more.”<br/><br/>Wang Xian sat on the Dragon Chair and shook his head. He looked at the sky array at the side.<br/><br/>“Dragon King, I can’t do it on my side either. I used the formation to search. All I know is that he is among the volcanoes. It seems to have merged with the volcanoes.”<br/><br/>The sky array said.<br/><br/>“The foggy race is also a branch of the Wizards. They haven’t locked onto the Wu leader. It should be difficult for you to lock onto it as well.”<br/><br/>Wang Xian didn’t have much hope for the sky array.<br/><br/>“Next, bring the members of the Dragon Palace to hunt in the Milky Way. Try your best to increase the strength of our disciples.”<br/><br/>He continued to instruct.<br/><br/>“It’s the Dragon King!”<br/><br/>The sky array nodded.<br/><br/>“Dragon King, there are senior brothers and sisters from the Willow deity Daoist sect who are in trouble in a secret realm!”<br/><br/>At this moment, mi xinlu suddenly walked over and said with a slightly anxious expression.<br/><br/>“HMM?”<br/><br/>Wang Xian looked at her and raised his eyebrows.<br/><br/>“Dragon King, look at this.”<br/><br/>She immediately walked over and handed a branch to Wang Xian.\t\t\t\t\t\t</div>", "images": {}, "success": true}