{"id": 101, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15072103.html", "title": "Chapter 3092 - Chapter 3092: The 3091 Venerable Level Was Not The Leader", "volume": 2, "volume_title": "Volume 2", "body": "<h1>Chapter 3092 - Chapter 3092: The 3091 Venerable Level Was Not The Leader</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 3092: The 3091 venerable level was not the leader<br/><br/>“Greetings, Dragon King!”<br/><br/>In the Dragon Palace, Xian Lingyuan and the others came to the Dragon King’s Hall and greeted Wang Xian respectfully.<br/><br/>“Have a seat, Lingyuan. There’s something I want to ask you. Do you know about the venerable level dire beast in the volcano region?”<br/><br/>Wang Xian asked them.<br/><br/>“You’re too polite, Dragon King. We don’t know much about the venerable level dire beast in the volcano region. However, it has lived in the volcano region for hundreds of millions of years.”<br/><br/>“In the Milky Way, people call it a leader-less beast. It is very powerful, especially in the volcano region. It has the home ground advantage. Over 500,000 years ago, two knights of the mist race tried to kill it, but they failed. It is said that the mist race’s Fire Mist Knight didn’t even manage to stop it.”<br/><br/>“Some warriors guessed that it could quickly go anywhere in the volcano region and pass through it easily. The volcano region is its backyard. It might not have the strength of a knight at level 3 or 4, so it would be hard to catch it.”<br/><br/>“Of course, this is just some speculation. Its strength is only at level one of a universe knight.”<br/><br/>Xian Lingyuan said to Wang Xian one by one.<br/><br/>“Do you know where it moves and where it lives?”<br/><br/>Wang Xian nodded slightly and continued to ask.<br/><br/>“We only know a rough location. As we don’t know the exact location, we don’t dare to approach it.”<br/><br/>Xian Lingyuan replied.<br/><br/>“The approximate location is enough.”<br/><br/>Wang Xian nodded and looked at the sky array beside him. “Let’s see if we can capture this desolate beast. If we can, it will give our dragon palace a huge upgrade.”<br/><br/>“It’s the Dragon King. If we work together, even if we aren’t a Level 2 universe knight, the other party will not be able to kill us.”<br/><br/>Tian Chen nodded. His face was filled with confidence.<br/><br/>“Then let’s all go together!”<br/><br/>Wang Xian stood up and said to them.<br/><br/>“It’s the Dragon King!”<br/><br/>Tian Chen and the rest nodded.<br/><br/>Soon, Wang Xian led the heaven’s formation eight-headed Demon AO Qitian and the other 37 peak Celestial Emperor members to the Dragon Palace in the volcano region through the teleportation formation.<br/><br/>“Lead the way!”<br/><br/>Wang Xian said to Xian Lingyuan and the rest.<br/><br/>Xian Lingyuan and the rest nodded and flew in a certain direction.<br/><br/>This time, the Dragon Palace had mobilized all their peak powers. The 37 peak celestial thearch-level members were enough to fight against three universe knight-level 1 powerhouses.<br/><br/>In addition to him and the Heaven Array, it shouldn’t be too much of a problem to suppress a universe knight-level 1 desolate beast.<br/><br/>After flying for two hours, Xianling Yuan and the others stopped and looked around.<br/><br/>Here, at the bottom of the Milky Way, huge flaming mountains were arranged in a mess.<br/><br/>At a glance, they were all flaming mountains, and lava was rising from the mountain pass.<br/><br/>There were many flaming mountains, at least hundreds of thousands of them, and each of them was over 10,000 kilometers in size.<br/><br/>“Dragon King, this is the area where the unleaded beast is active. We don’t know if it’s sleeping or something else.”<br/><br/>Xianlingyuan pointed to the front and said to Wang Xian.<br/><br/>“The top of each volcano is the entrance. According to my investigation, all the volcanoes are connected. They might have been opened up. This volcanic area is where the unleaded beast is active. Dragon King, if we want to capture it, it’s best to enter.”<br/><br/>Tian Chen held a compass in his hand and a black book beside him. There were lines of words on the book.<br/><br/>There was also a mirror-like wizard tool on the side.<br/><br/>The compass was a wizard tool that Tian Chen made himself, and the mirror was also a heaven mirror, which could be considered a wizard tool.<br/><br/>The black book in his hand was a acquired spiritual treasure, the Wizard tool of the Chief of the Mohan clan.<br/><br/>“This area is too big. It will take too much time to search for it.”<br/><br/>Wang Xian shook his head as his eyes sparkled.<br/><br/>“Ao Feng!”<br/><br/>Wang Xian looked at the middle-aged man beside him. The middle-aged man was dressed in green and his body contained the power of the Divine Dragon.<br/><br/>“Dragon King!”<br/><br/>Ao feng cupped his hands.<br/><br/>“Transform into the form of the Divine Wind Dragon and fly above the crater as bait. See if you can attract it over.”<br/><br/>His eyes flickered as he spoke.<br/><br/>The Divine Dragon bloodline had a fatal attraction to any dire beast. A weak divine wind dragonnaturally had a great attraction to dire beasts.<br/><br/>This was a special fishing method.<br/><br/>“It’s the Dragon King.”<br/><br/>Ao feng nodded.<br/><br/>“Bring this with you. Even if you are attacked by Wu Shou suddenly, you will be able to withstand its attack.”<br/><br/>Wang Xian placed the five elements millstone on his body and reminded him.<br/><br/>“Yes!”<br/><br/>Ao feng nodded his head. His body moved and immediately transformed into a huge divine wind dragon.<br/><br/>His swaying body stared at the spot in front of him.<br/><br/>“Keke, Old Feng, you can make some injuries on your body. It’s best if you leave some fresh blood. The heavier the better.”<br/><br/>Mo Sha said with a smile from the side.<br/><br/>Ao Feng glared at him. His body trembled slightly and the dragon scales on his body split open. A large amount of fresh blood flowed out.<br/><br/>“Roar Roar!”<br/><br/>He let out a low roar and immediately flew forward.<br/><br/>“The probability of attracting that desolate beast over has increased by a lot.”<br/><br/>Mo Sha Smiled.<br/><br/>“Get Ready!”<br/><br/>Wang Xian said to them. His gaze was fixed on Ao Feng’s figure.<br/><br/>“Dragon King, should we get closer?”<br/><br/>Mu Zesen frowned slightly when he saw Ao Feng’s figure disappearing from his sight.<br/><br/>“There’s no need. The five elements grinding mill can protect him. If we get too close, it will only alert the Headless Beast.”<br/><br/>“With Ao Feng’s speed, he will be able to escape some distance if he encounters a desolate beast at the level of a universe Knight.”<br/><br/>Wang Xian shook his head.<br/><br/>“Wu Wu Wu!”<br/><br/>Time passed by little by little. After a full hour, a deep roar came from the front.<br/><br/>It was as if an ancient existence had awakened and let out a terrifying roar.<br/><br/>“Boom!”<br/><br/>Following that, Wang Xian and the rest felt a wave of heat coming from the front.<br/><br/>A huge creature that was about 50,000 meters in length was chasing after Ao feng crazily.<br/><br/>From Afar, it looked like a head without a body. Its hideous and terrifying head had a terrifying mouth.<br/><br/>Flames spewed out from its mouth and attacked Ao Feng.<br/><br/>Ao Feng was fleeing frantically. Rays of light emitted from the five elements grinding mill to protect him.<br/><br/>“Get Ready!”<br/><br/>Wang Xian looked at the headless beast in front of him. His eyes were sparkling as he spoke to the Heaven Formation.<br/><br/>“It’s the Dragon King!”<br/><br/>The heaven’s formation nodded. He waved his hand and began to set up the formation.<br/><br/>They were standing under a volcano.<br/><br/>“Roar!”<br/><br/>Ao Feng was running for his life. When he arrived in front of Wang Xian and the rest, he let out a dragon’s roar.<br/><br/>“Woo Woo!”<br/><br/>Behind them, Wu Shou’s huge pupils were staring at them. Suddenly, he seemed to have sensed something and his speed decreased abruptly.<br/><br/>Two huge pupils looked in the direction of Wang Xian and the rest.\t\t\t\t\t\t</div>", "images": {}, "success": true}