{"id": 103, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15072107.html", "title": "Chapter 3094 - Chapter 3094: 3093 Crescent Moon Secret Realm", "volume": 2, "volume_title": "Volume 2", "body": "<h1>Chapter 3094 - Chapter 3094: 3093 Crescent Moon Secret Realm</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 3094: 3093 crescent moon secret realm<br/><br/>It was a wicker. On the wicker was a treasure of the willow deity Daoist rite temple.<br/><br/>Wang Xian knew a little about this kind of wicker. It could carry out some simple messages.<br/><br/>Although this wicker was rather useless in transmitting messages, there was one very important thing about it.<br/><br/>That was, even in a closed domain, messages could be transmitted through this wicker.<br/><br/>Wang Xian did not have such a willow twig. One of the Mi Xin Lu was given to her by a group of senior sisters.<br/><br/>In the Willow deity Daoist sect, the relationship between most of the disciples was still very good.<br/><br/>For example, the relationship between Mi Xin Lu and the group of senior sisters was very good.<br/><br/>There was a distress message on the willow twig. To Wang Xian’s surprise, there was not only one person who was asking for help, but a total of forty to fifty people.<br/><br/>Apart from some messages asking for help, there were also some arguments.<br/><br/>“Dragon King, Senior Sister Lingxin and senior brother Junzi have discovered a secret realm. However, a traitor appeared among them. This traitor informed the disciples of the nine-sword race. The disciples of the nine-sword race informed the experts of their race to come and attack senior brother Junzi and senior sister Lingxin.”<br/><br/>Mi Xinlu said to Wang Xian.<br/><br/>“Senior Brother Junzi?”<br/><br/>Wang Xian raised his eyebrows.<br/><br/>He did not know much about the disciples of the Willow deity Daoist sect. The only one he knew was senior brother Junzi.<br/><br/>He had just entered the willow deity Daoist sect when senior brother Junzi invited him to a banquet.<br/><br/>He had the strength of a peak divine emperor. For him to request for reinforcements, the opponent must be very strong.<br/><br/>Moreover, among the unaffiliated people of the willow deity Daoist sect, the male was led by senior brother Junzi while the female was led by senior sister Lingxin. Their group of disciples numbered in the hundreds and could be considered a considerable force.<br/><br/>The disciples of those races would usually not provoke them.<br/><br/>“Did they encounter an attack from a universe knight?”<br/><br/>Wang Xian asked curiously.<br/><br/>“No, I think they encountered an attack from a peak celestial emperor of the nine-sword race.”<br/><br/>“Dragon King, a senior sister sent me a message. They are actually in the crescent moon Mystic Realm.”<br/><br/>Suddenly, Mi Xin Lu let out a cry of surprise.<br/><br/>“Crescent Moon Mystic Realm?”<br/><br/>Wang Xian’s eyes flickered. “No wonder they are willing to offend senior brother Junzi and the rest to take action.”<br/><br/>Wang Xian had some understanding of the crescent moon mystic realm from the library of the Willow deity Daoist sect.<br/><br/>The crescent moon mystic realm belonged to a very mysterious mystic realm in the Milky Way.<br/><br/>According to the information, the Crescent Moon Mystic Realm was the universe God Country of the Crescent Moon Venerable.<br/><br/>And the name of the crescent moon venerable could be said to be known by everyone in the former Milky Way.<br/><br/>Back then, the Crescent Moon Venerable was known as a crescent moon that hung above the Milky Way and shone on the Milky Way.<br/><br/>There was another meaning behind this sentence. The crescent moon venerable reflected the entire Milky Way and knew all the places and secrets of the Milky Way.<br/><br/>In front of Crescent Moon Venerable, the Milky Way didn’t have any secrets.<br/><br/>Crescent Moon Creek, which had once shocked the world, was famous for selling all kinds of information and materials.<br/><br/>But later, Crescent Moon Venerable was killed for spying on a powerful existence in the outside world.<br/><br/>According to legend, all of his treasures were in his divine kingdom, and one of his acquired spiritual treasures was also in his divine kingdom.<br/><br/>This acquired spiritual treasure was called the crescent moon in the sky.<br/><br/>It was a detection-aided acquired spiritual treasure.<br/><br/>One could naturally imagine the treasures contained in a universe god country at the level of a universe knight.<br/><br/>It was worth it to offend a large number of disciples of the Willow deity Daoist sect.<br/><br/>Especially for the nine-sword race, what could they do if they offended some disciples of the willow deity Daoist sect?<br/><br/>“What’s the situation on their side now?”<br/><br/>Wang Xian squinted his eyes slightly and asked Mo Xinlu.<br/><br/>“A senior brother was killed by an expert of the nine-sword race. Senior Brother Junzi and senior brother Lingxin entered a room and the other party couldn’t enter for the time being. Senior Brother Junzi and the others have the key to Venerable Crescent Moon’s universe God Nation. Now, senior brother Junzi is looking for help.”<br/><br/>“Senior sister asked me to ask Dragon King if you are interested in the treasures in the Crescent Moon Knight’s God Country?”<br/><br/>Mi Xinlu asked Wang Xian.<br/><br/>“A treasure at the level of a universe knight. The nine swords race should send a universe knight over, right?”<br/><br/>Wang Xian raised his eyebrows and asked in puzzlement.<br/><br/>“A universe knight can’t enter. The key to the universe God country is controlled by senior brother Junzi and the rest. Furthermore, they can control the god country.”<br/><br/>“Initially, the disciples of the nine-sword race entered through their method of entry. However, senior brother Junzi and the others have changed their method of entry. Even universe knights can forget about entering.”<br/><br/>Mi Xin Lu communicated with his senior sister through the wicker as she reported to Wang Xian.<br/><br/>“Tell them that we are going over.”<br/><br/>Wang Xian was immediately interested.<br/><br/>Putting everything aside, if senior brother Junzi asked him for help, he would give him face.<br/><br/>With his current strength, it should be a piece of cake.<br/><br/>Secondly, a universe God Country of a universe knight, an expert who once shook the Milky Way, there were definitely many treasures in his mystic realm.<br/><br/>Especially Wang Xian who was very interested in the acquired Numinous Treasure of the crescent moon in the sky.<br/><br/>“It’s the Dragon King. Senior sister said to tell us the coordinates and the method to enter our place immediately.”<br/><br/>Mi Xinlu nodded.<br/><br/>Wang Xian smiled.<br/><br/>Mi Xinlu had a very good relationship with the disciples of the Willow deity Daoist sect. The senior brothers and senior sisters trusted him very much.<br/><br/>If not for the relationship with Mi Xinlu, Wang Xian believed that senior brother Junzi and the rest of the senior brothers and sisters would not have come to him for help.<br/><br/>“Dragon King, senior sister and the rest have already sent the location to me.”<br/><br/>Very soon, the Mi Xin deer spoke to Wang Xian.<br/><br/>“Alright, we will head over immediately.”<br/><br/>Wang Xian nodded. After hesitating for a moment, he contacted Ao Fenghuang and Ao Tu.<br/><br/>“Dragon King!”<br/><br/>Not long after, Ao Fenghuang and Ao tu flew over and greeted him respectfully.<br/><br/>“Follow me to a place. After that, both of you will protect the Mi Xin deer. Also, transform into your battle form.”<br/><br/>Wang Xian instructed them.<br/><br/>“It’s the Dragon King!”<br/><br/>Ao fenghuang and Ao tu nodded. Their bodies moved and immediately transformed.<br/><br/>Ao fenghuang transformed into the battle form of the Heaven Lightning Earth Fire Dragon Phoenix seed.<br/><br/>Dragon head, horse body, Phoenix Wings, thunder tail.<br/><br/>Ao tu transformed into the form of a dragon turtle, emitting a heavy aura.<br/><br/>In the Divine Kingdom where a universe knight existed, not to mention the people from the nine swords race, there might be danger within.<br/><br/>If they were to explore the inside, Wang Xian might not be able to take care of the Mi Xin deer.<br/><br/>There was another point. This time, they were able to enter the Crescent Mystic Realm thanks to the senior brothers and sisters from the Willow deity Daoist sect.<br/><br/>Wang Xian was not a heartless person. At the very least, he had to protect their safety.<br/><br/>Ao fenghuang and Ao tu should be enough.<br/><br/>Especially in terms of defense, those below the level of a universe Knight were almost invincible.<br/><br/>“Let’s Go!”<br/><br/>Wang Xian said.<br/><br/>“Little girl Xin Lu, come up!”<br/><br/>Ao fenghuang flapped her wings slightly and said to Mi Xin Lu.<br/><br/>“Thank you, Uncle Ao Fenghuang.”<br/><br/>Mi Xinlu nodded and sat on him.<br/><br/>Buzz<br/><br/>“Let’s Go!”<br/><br/>Wang Xian waved his arm and the five elements Millstone appeared beneath them. They sped up.\t\t\t\t\t\t</div>", "images": {}, "success": true}