{"id": 107, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15072115.html", "title": "Chapter 3098 - Chapter 3098: Among The 3097 Battle Angels", "volume": 2, "volume_title": "Volume 2", "body": "<h1>Chapter 3098 - Chapter 3098: Among The 3097 Battle Angels</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 3098: Among the 3097 battle angels<br/><br/>“Everyone, be careful. The weaker ones will join forces.”<br/><br/>Senior Martial Brother Junzi reminded once again as his gaze landed on a battle angel.<br/><br/>These battle angels could obtain quite a lot just by suppressing any one of them.<br/><br/>If one could obtain a ninth level divine emperor battle angel, its value would be comparable to two or three peak divine emperor divine artifacts.<br/><br/>Faced with these battle angels, no one was unmoved.<br/><br/>As soon as senior martial brother Junzi finished speaking, he extended his palm and immediately opened the box of a battle Angel.<br/><br/>At the side, senior martial brother Lu, senior martial brother Kong, senior martial brother Xu, and the rest also made their move immediately.<br/><br/>The group of disciples from the Willow deity Daoist sect made their move together.<br/><br/>“Ao Fenghuang, Ao Tu, you don’t have to make your move. Mi Xinlu, you can make your move with those who are close to you.”<br/><br/>Wang Xian transmitted his voice to Ao Fenghuang, Ao Tu, and Mi Xinlu. With a wave of his arm, the Five Elements Millstone appeared in the sky.<br/><br/>The five elements millstone floated in front of a glass box that sealed the battle Angel. It opened it directly.<br/><br/>The moment the box was opened, the Battle Angel opened its eyes abruptly. Its emotionless gaze locked onto Wang Xian who was in front of it.<br/><br/>Its eyes sparkled as if it was scanning something.<br/><br/>The next moment, the wings on its back flapped slightly. It pulled out the Holy Sword of light from its waist and slashed at Wang Xian.<br/><br/>“Level six celestial emperor!”<br/><br/>Sensing the might of this battle angel, Wang Xian thought to himself.<br/><br/>He swept the five elements and took out the core located between his eyebrows.<br/><br/>After the core was taken out, the battle angel immediately stopped its actions.<br/><br/>Wang Xian waved his hand and the core flew into his hand. A stream of information was transmitted into his mind.<br/><br/>“There’s still a big gap between them and the legendary battle angels, especially the core.”<br/><br/>Wang Xian recalled some information about the battle angels.<br/><br/>The Battle Angels created by Venerable Crescent Moon were relatively simple in terms of control. As long as the core of these battle angels was removed and the information inside was modified, they would be able to control them easily.<br/><br/>Of course, these battle angels might be semi-finished products, so it was relatively easy to remove the core.<br/><br/>After changing some of the commands in the core, Wang Xian had a thought. It was very easy to control the battle angels.<br/><br/>“Bang, Bang, Bang!”<br/><br/>At the side, senior brother Junzi and the rest also attacked the battle angels. The Battle Angels that they released were not very strong.<br/><br/>Even if their current strength was limited by 90% , they could still easily suppress them.<br/><br/>After suppressing them, all of them looked at the core with excitement.<br/><br/>Wang Xian retracted his gaze and continued to open the boxes of the battle angels with the Five Elements Millstone. The moment they opened their eyes, they could take away the core.<br/><br/>His actions were very fast. The five elements millstone easily swept across them. In less than 30 seconds, he had collected more than 20 battle angels.<br/><br/>Among them, the strongest one had the strength of an eighth level divine emperor.<br/><br/>The weakest one had the strength of a sixth level divine emperor.<br/><br/>“We’ve suppressed it. Hahaha, a sixth level divine Emperor Battle Angel, TSK TSK!”<br/><br/>“This is too disadvantageous for us. Our combat strength has been suppressed by only one-tenth of the mystic realm, yet these battle angels possess complete combat strength.”<br/><br/>Excited voices came from the side. Five to six disciples of the Willow deity Daoist sect had suppressed one battle angel. Their faces were filled with excitement.<br/><br/>Wang Xian swept his gaze over and smiled faintly. With a wave of his arm, the five elements millstone broke through the chests of more than ten battle angels.<br/><br/>The group of Battle Angels were released. Their eyes were filled with a cold expression.<br/><br/>“Suppress!”<br/><br/>Wang Xian shouted softly. Gray palms extended out from the five elements Millstone and took out the core of more than a dozen battle angels.<br/><br/>“There’s a level nine battle angel of the Celestial Thearch.”<br/><br/>Wang Xian raised his eyebrows as he held the core in his hand. His eyes were filled with joy.<br/><br/>The resources exchanged for a level nine battle angel of the Celestial Thearch was enough to produce a powerhouse at the peak of the celestial thearch level in the Dragon Palace.<br/><br/>“What a fast speed!”<br/><br/>“Hiss, suppressing more than a dozen battle angels at once. This… We can’t compete with them at all!”<br/><br/>“Wang Xian’s strength can instantly kill a powerhouse at the peak of the celestial thearch level. Naturally, he can easily suppress the battle angels. It’s just that we don’t know how strong those battle angels are.”<br/><br/>“The Battle Angels created by Venerable Crescent Moon should be at least at level five or six of the celestial thearch level!”<br/><br/>Some disciples of the Willow deity Daoist sect looked over with envy.<br/><br/>Their voices attracted the attention of senior brother Junzi, senior brother Lu, and the rest.<br/><br/>When he saw Wang Xian breaking more than ten battle angels in one go and suppressing them in one go, his eyes sparkled.<br/><br/>Senior Brother Junzi shook his head and sped up.<br/><br/>“Crash!”<br/><br/>At the side, Wang Xian was still waving the five elements millstone and directly broke the boxes of more than ten battle angels.<br/><br/>He directly caused the five elements millstone to suppress them.<br/><br/>Based on his current speed, suppressing more than ten battle angels would only take about ten seconds.<br/><br/>The speed of breaking through them was twice as fast as before.<br/><br/>In the crescent moon mystical land, Wang Xian realized that the five elements millstone was not suppressed.<br/><br/>In other words, the offensive power of the Five Elements Millstone was stronger than his own.<br/><br/>With a wave of his arm, all the battle angels were stored in the mother nest.<br/><br/>“Continue!”<br/><br/>Wang Xian was very satisfied with such an easy harvest.<br/><br/>He swept his gaze across the surroundings. There were more than 10,000 battle angels on the third level. The people from the nine swords race had obtained 780 of them. Now, they were dealing with the battle angel who was at the peak of the Celestial Emperor Realm.<br/><br/>It was obvious that he was being held back by the Battle Angel who was at the peak of the Celestial Emperor Realm.<br/><br/>“Increase our speed and break through more than a dozen of them!”<br/><br/>At a spot not far away, senior brother Lu’s expression darkened when he saw Wang Xian’s speed. He immediately made a decision.<br/><br/>“Alright!”<br/><br/>The two elders beside senior brother Lu were also experts at the peak of the celestial thearch.<br/><br/>Apart from them, there was also a group of experts at the eighth or ninth level of the celestial thearch. With their strength, they did not need to be too fearful.<br/><br/>Moreover, these battle angels were a considerable resource to them.<br/><br/>The more they obtained, the more benefits they would gain for their race.<br/><br/>If they really encountered a battle angel at the peak of the Celestial Thearch, they would deal with it together.<br/><br/>Since that Wang Xian had no scruples, there was no need for them to have scruples!<br/><br/>“Speed Up!”<br/><br/>Senior Brother Kong and senior brother Xu were in a group. They couldn’t sit still anymore and spoke.<br/><br/>The Battle Angel was a huge resource. At this moment, everyone wanted to obtain more.<br/><br/>When Wang Xian saw how unscrupulous they were, he raised his eyebrows slightly and ignored them.<br/><br/>Buzz<br/><br/>Just as he was suppressing the Battle Angel for the tenth time, Wang Xian sensed a terrifying aura erupting from the body of the Battle Angel.<br/><br/>He narrowed his eyes slightly. In an instant, chains were released from the Five Elements Millstone and directly restrained it.<br/><br/>An earthy yellow palm condensed and took away the Battle Angel’s core.<br/><br/>“A peak-stage emperor-level battle Angel.”<br/><br/>Wang Xian took the core and looked excited.<br/><br/>By selling this peak-stage emperor-level battle angel and adding some resources, the Dragon Palace would be able to add a universe knight.\t\t\t\t\t\t</div>", "images": {}, "success": true}