{"id": 104, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15072109.html", "title": "Chapter 3095 - Chapter 3095: 3094 Reinforcements", "volume": 2, "volume_title": "Volume 2", "body": "<h1>Chapter 3095 - Chapter 3095: 3094 Reinforcements</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 3095: 3094 reinforcements<br/><br/>“Weng!”<br/><br/>In the Milky Way, Wang Xian and the rest were shuttling through the sea.<br/><br/>Mi Xin Lu sat on Ao Fenghuang and pointed at the route.<br/><br/>The Crescent Moon Mystic Realm was the legendary mystic realm in the Milky Way. No one knew the exact location.<br/><br/>There were many experts who investigated the crescent moon mystic realm in the past, but they could not find it.<br/><br/>The Universe God Country of a universe knight had already transcended the ordinary spatial domain.<br/><br/>There was a saying that described a universe god country of the knight level: one sand, one world, one leaf, one heaven.<br/><br/>Within a speck of dust, it might be a universe god country that was comparable to a star.<br/><br/>The Universe God Country of a knight was abnormally secretive. There were two ways to enter, one was to have a way to enter.<br/><br/>The second was because of the death of a knight, the energy within the god country was consumed, and a portion of the god country was revealed.<br/><br/>The crescent moon mystic realm now belonged to the complete divine kingdom. Although the Crescent Moon Venerable had been dead for a long time, the energy in it had yet to be depleted.<br/><br/>If Wang Xian and the rest wanted to enter, they had to master the method of entry.<br/><br/>Bringing them along, Wang Xian could travel at a speed comparable to a level two universe knight.<br/><br/>Even in the vast Milky Way, they only took two days.<br/><br/>“Dragon King, it’s in front of us.”<br/><br/>Mo Xinlu looked at the message sent by the wicker and said to Wang Xian.<br/><br/>Wang Xian nodded and slowed down. He scanned his surroundings.<br/><br/>“Eh? There are people!”<br/><br/>When they flew over, they discovered four to five figures in front of them. They were looking around from the sky.<br/><br/>“Dragon King, they are in the sky. They are around those four or five people. Those people should be the other reinforcements that senior brother Junzi and the rest found.”<br/><br/>Mi Xinlu looked at the sky and said to Wang Xian.<br/><br/>He concealed his aura and moved his body. The four of them flew directly into the sky.<br/><br/>“Eh?”<br/><br/>At this moment, the five people in the sky saw someone flying over. They immediately looked over and whispered to each other.<br/><br/>“We are disciples of the Willow deity Daoist sect. We have received information from Senior Brother Junzi, senior sister Lingxin, and the others that we are here to provide assistance. Who Are You?”<br/><br/>Mo Xinlu swept his gaze over them and took the lead to ask.<br/><br/>“New disciples of the Willow deity Daoist sect, right? We can be considered your senior brothers.”<br/><br/>The old man in the lead sized up Mo Xinlu and the others and said faintly.<br/><br/>“Was it senior brother Junzi who asked you to come and support us?”<br/><br/>Mo Xinlu also looked at them and asked again.<br/><br/>“Hehe!”<br/><br/>The old man in the lead smiled. He moved his arm and took out a willow twig.<br/><br/>Joining the willow deity Daoist sect did not mean that they could stay there forever. Other than advancing to a universe knight, they would be forced to leave the willow deity Daoist sect after reaching the 30 million-year time limit.<br/><br/>These few people were obviously old disciples of the Willow deity Daoist sect.<br/><br/>After confirming their identities, Mi Xin Lu nodded and told Wang Xian the specific location. The four of them flew towards the sky.<br/><br/>The Crescent Moon Mystic Realm was located in the sky above the Milky Way. After flying for tens of millions of kilometers, they stopped.<br/><br/>The five people next to them were sitting at the side, looking at the information on the willow twig in their hands.<br/><br/>They contacted Senior Brother Junzi, senior sister Lingxin, and the others through the wicker to confirm their identities.<br/><br/>“Junior sister Mi Xinlu, the entrance is over here.”<br/><br/>The leading old man pointed to a spot where there was a crescent moon in the sky. He waved his hand, and a crack appeared in the space.<br/><br/>The crack looked ordinary, but the crescent mystic realm was here.<br/><br/>“Bang!”<br/><br/>The old man waved his arm and a powerful force landed at the center of the crack. Ripples appeared there.<br/><br/>There were thousands of ripples. He stretched out his arm and penetrated into one of the ripples.<br/><br/>“Let’s go in.”<br/><br/>As the old man spoke, his figure disappeared.<br/><br/>“Let’s go as well.”<br/><br/>Wang Xian took a few glances and saw them entering the crack. He stretched out his arm and entered the crack.<br/><br/>Mi Xin Lu and the rest followed closely behind.<br/><br/>In a blink of an eye, the space changed.<br/><br/>It was as though they had entered another space.<br/><br/>A crescent moon was located in front of them. The entire crescent moon was extremely huge and was at least tens of millions of kilometers in size.<br/><br/>The huge crescent moon occupied half of this space.<br/><br/>The crescent moon was made of a special material. It was hollow inside and had many entrances.<br/><br/>Wang Xian sensed a strong suppressive force the moment he entered.<br/><br/>“Dragon King, your strength has been suppressed by at least 90% .”<br/><br/>Ao fenghuang sent a voice transmission from the side.<br/><br/>Wang Xian nodded. His strength had also been suppressed by about 90% .<br/><br/>The Crescent Moon Venerable was not at level one or two. His cultivation was very high, so it was normal for him to be suppressed when he entered his divine kingdom.<br/><br/>“Everyone, let’s go and meet up with senior brother Junzi and the rest first. Senior Brother Junzi is currently below the crescent moon.”<br/><br/>The old man who was leading the group said to Wang Xian and the rest.<br/><br/>“Okay!”<br/><br/>Wang Xian nodded his head and the group of people flew straight ahead.<br/><br/>“Senior Brother Kong, senior brother Xu, junior sister Mo Xinlu, Wang Xian.”<br/><br/>When Wang Xian and the rest had just approached, a group of people led by senior brother Junzi and senior sister Lingxin walked out from the side and spoke to them.<br/><br/>It was obvious that they had been waiting for a long time.<br/><br/>Some of the disciples had also changed the way they addressed Wang Xian.<br/><br/>After all, Wang Xian’s strength was displayed here, and he had an unbridled personality. They did not dare to address him casually.<br/><br/>Now that Wang Xian was wanted by the dragon-descendant race, they originally did not want him to come over.<br/><br/>However, there were too many experts from the nine-sword race and they had powerful divine weapons. With the support of others, they were definitely not a match for the experts from the nine-sword race.<br/><br/>They had no choice but to let Mi Xin Lu inform Wang Xian.<br/><br/>After all, everyone had witnessed Wang Xian’s strength. Even if he wasn’t comparable to a universe knight, he was almost invincible among the experts at the peak of the Divine Emperor Realm.<br/><br/>Furthermore, he had obtained the acquired Spiritual Treasure Blade and sword scar. His offensive power should have increased again.<br/><br/>“Junior Brother Junzi, what’s the situation now?”<br/><br/>The old man called Senior Martial Brother Kong walked over and asked immediately when he saw them.<br/><br/>“Because we control a crescent moon key, we can control a part of the mystic realm, but we can only escape the attacks of the ice mountain race’s powerhouses.”<br/><br/>“The Ice Mountain Race’s powerhouses are currently exploring above the crescent moon. We don’t dare to step inside.”<br/><br/>Senior Martial Brother Junzi said with an embarrassed expression.<br/><br/>“We didn’t expect that Jing Yue would secretly inform the disciples of the Ice Mountain race. If it weren’t for him, junior martial brother Miao wouldn’t have died!”<br/><br/>Senior Martial Sister Lingxin said angrily.<br/><br/>“Junior Martial Brother Junzi, junior martial sister lingxin, how many people did you find to support us?”<br/><br/>Senior martial brother Xu asked.<br/><br/>“Now, we can confirm that it’s senior apprentice-brother Kong and senior apprentice-brother Xu. Senior apprentice-brother Lu will be here soon as well. He should be together with the experts in the clan. We can’t be sure how many peak-stage divine emperors there are.”<br/><br/>As senior apprentice-brother Junzi spoke, he looked at Wang Xian and Ao Fenghuang and Ao Tu.\t\t\t\t\t\t</div>", "images": {}, "success": true}