{"id": 108, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15072117.html", "title": "Chapter 3099 - Chapter 3099: Under The 3098 Battle Angel", "volume": 2, "volume_title": "Volume 2", "body": "<h1>Chapter 3099 - Chapter 3099: Under The 3098 Battle Angel</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 3099: Under the 3098 Battle Angel<br/><br/>In just an instant, the surrounding people did not sense that a battle angel at the peak of the Celestial Emperor Realm had fallen into Wang Xian’s hands.<br/><br/>“There shouldn’t be any battle angel at the third level. I can sweep across a large area.”<br/><br/>After Wang Xian suppressed it, he kept it into his interspatial ring and narrowed his eyes slightly.<br/><br/>With the might of the five elements millstone, it would not be a problem for him to instantly suppress seven to eight battle angels at the peak of the Divine Emperor Realm.<br/><br/>There should not be many battle angels at the peak of the third level of the divine emperor realm.<br/><br/>Buzz! Buzz! Buzz<br/><br/>Crack! Crack! Crack<br/><br/>At the thought of this, he looked at the Five Elements Millstone. The five elements millstone changed slowly and enveloped the sky above the thousands of battle angels.<br/><br/>Crisp cracking sounds rang out as the 1,000 boxes cracked open. The battle angels in the boxes slowly opened their icy-cold eyes.<br/><br/>Buzz<br/><br/>A palm emitted from the five elements millstone. It grabbed all the battle angels in its gray palm.<br/><br/>The powerful force confined the battle angels one by one, making them unable to move.<br/><br/>Wang Xian waved his arm again and the core cores of the battle angels flew towards his hand.<br/><br/>“Three ninth-level celestial thearch level battle angels.”<br/><br/>Sensing the information in the cores, he narrowed his eyes slightly and stored the over 1,000 battle angels into the mother nest.<br/><br/>“What?”<br/><br/>At the side, senior brother Lu and the rest were shocked when they saw Wang Xian suppressing over 1,000 battle angels. At the same time, they looked a little embarrassed.<br/><br/>The more Wang Xian obtained, the less they could obtain.<br/><br/>“Hiss, junior brother Wang Xian is so powerful. He managed to suppress more than a thousand of them at once. Among those thousand of them, there is definitely a ninth level divine emperor battle Angel.”<br/><br/>“Junior brother Wang Xian’s strength is too strong!”<br/><br/>Senior Sister Lingxin and the rest looked over. Their eyes were filled with shock.<br/><br/>The rest of the disciples of the Willow deity Daoist sect were also stunned.<br/><br/>“Junior brother Wang Xian is really strong!”<br/><br/>Senior Brother Junzi sighed slightly and continued to suppress the battle angels one by one.<br/><br/>“Should we…”<br/><br/>Senior brother Lu exchanged a glance with the two peak divine emperor powerhouses from the same race. Their eyes were burning as they looked at the battle angels in front of them.<br/><br/>“Speed Up!”<br/><br/>They made up their minds and took out one divine weapon after another. They attacked the Battle Angel Box in front of them directly.<br/><br/>This time, they attacked twenty of them at once.<br/><br/>When they felt the power of twenty battle angels, their eyes revealed an excited look, and they immediately moved to suppress them.<br/><br/>“Let’s continue!”<br/><br/>Seeing that Wang Xian continued to attack, senior sister Lingxin and the rest of the female disciples also shifted their gaze and said.<br/><br/>“Senior sister, should we destroy a few more battle angels?”<br/><br/>A female disciple could not help but ask.<br/><br/>“Sure!”<br/><br/>Senior Sister Lingxin glanced at Wang Xian, senior brother Kong, and the rest. She pondered for a moment and nodded.<br/><br/>“Then let’s take these five!”<br/><br/>The long whip in the hands of a female disciple directly attacked the boxes of the five battle angels.<br/><br/>Crack! Crack! Crack<br/><br/>The boxes were broken and the five battle angels slowly opened their eyes.<br/><br/>Senior Sister Lingxin and the others immediately took out their divine weapons, preparing to launch a joint attack.<br/><br/>“Boom! Boom! Boom!”<br/><br/>The five battle angels opened their eyes, and waves of powerful might radiated from their bodies.<br/><br/>“Oh?”<br/><br/>“This might?”<br/><br/>Suddenly, the few female disciples in front couldn’t help but retreat backward, their faces pale.<br/><br/>Their eyes revealed a look of fear.<br/><br/>Senior Martial Sister Lingxin’s expression also changed drastically as she shouted, “Oh no, there are still two ninth level divine emperor battle angels. Retreat!”<br/><br/>“Senior Martial brothers, request for reinforcements!”<br/><br/>A female disciple’s expression changed drastically as she pleaded for help.<br/><br/>“Wait!”<br/><br/>At the side, senior martial brother Lu, senior martial brother Kong, Senior Martial Brother Junzi, and the others saw the situation and their expressions changed slightly.<br/><br/>However, because they had increased their speed to suppress the battle angels, they were unable to take action for a short period of time.<br/><br/>“Holy Light!”<br/><br/>A voice without the slightest bit of emotion came out from the mouths of the five battle angels.<br/><br/>Especially the two ninth level divine emperor battle angels. When they took action, they instantly enveloped the group of more than ten female students.<br/><br/>The terrifying attack caused senior martial sister Lingxin and the others to turn pale.<br/><br/>“It’s over!”<br/><br/>A few female disciples revealed horrified expressions. Their faces were extremely pale.<br/><br/>The attacks of the two rank nine divine emperor battle angels were something that they could not withstand with their strength.<br/><br/>Among the over a dozen of them, the strongest senior martial sister Lingxin was only at the rank nine divine emperor realm. Moreover, she could only display one-tenth of her strength in the mystic realm.<br/><br/>When Mi Xinlu saw this terrifying attack, her face turned pale as well. She hurriedly looked to the side.<br/><br/>“Boom!”<br/><br/>Before the holy light descended, soil appeared out of thin air beneath the five battle angels. The soil directly covered them, leaving only a small point of their core.<br/><br/>Soon after, an earthy yellow shield appeared in front of the Holy Light and easily blocked it.<br/><br/>“Do what you can.”<br/><br/>The one who attacked was Ao tu. He swept his gaze across the group of girls and said indifferently.<br/><br/>“Thank you, Uncle Ao Tu.”<br/><br/>Mo Xinlu looked over and a smile appeared on his face. He immediately expressed his gratitude.<br/><br/>“Eh?”<br/><br/>Senior Sister Lingxin and the others recovered from their shock and immediately looked over at Ao Tu.<br/><br/>Ao Tu lay there quietly with a battle-like appearance. His body emitted a thick and heavy aura.<br/><br/>Ao Fenghuang, who was at the side, swept his gaze around indifferently.<br/><br/>“Thank you, Senior!”<br/><br/>“Thank you, senior, for saving us!”<br/><br/>Senior Sister Lingxin looked at Ao tu with flickering eyes. She bowed respectfully and thanked him.<br/><br/>The rest of the girls also thanked him immediately.<br/><br/>Ao Tu lay there quietly and did not say a word.<br/><br/>“That demonic beast senior is an existence at the peak of the Celestial Thearch!”<br/><br/>“This… they came with junior sister Mi Xinlu and Wang Xian. They are actually existences at the peak of the Celestial Thearch.”<br/><br/>“That demonic beast senior is at the peak of the celestial thearch. What about the other one?”<br/><br/>Around them, some disciples of the Willow deity Daoist sect looked at Ao tu and the rest with respect in their eyes.<br/><br/>“Thank you, junior brother Wang Xian.”<br/><br/>Senior Brother Junzi looked over and his pupils contracted slightly. He glanced at Ao Tu and AO qitian. He knew that they were brought over by Wang Xian.<br/><br/>Wang Xian did not order him to take action to obtain the Battle Angel. Instead, he was helping them at this critical moment. Clearly, he was protecting them.<br/><br/>This made senior brother Junzi feel touched and thanked him.<br/><br/>“Thank you, junior brother Wang Xian!”<br/><br/>Senior Sister Lingxin and the rest had obviously figured this out as well. They looked at Wang Xian with gratitude.<br/><br/>“Disciples of the Willow deity Daoist sect, please do not take action. After this is over, I will give all of you a battle angel of the same level.”<br/><br/>“Of course, except for senior brother Junzi. In addition, all of you should act according to your abilities. If you are in danger, I will not make a move.”<br/><br/>Wang Xian said with a smile on his face. He took one last glance at senior brother Lu, senior brother Kong, senior brother Xu, and the rest.\t\t\t\t\t\t</div>", "images": {}, "success": true}