{"id": 105, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15072111.html", "title": "Chapter 3096 - Chapter 3096: 3095", "volume": 2, "volume_title": "Volume 2", "body": "<h1>Chapter 3096 - Chapter 3096: 3095</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 3096: 3095<br/><br/>“Junior brother Wang Xian, the Crescent Mystic Realm is the universe God Nation of the Crescent Moon Venerable. There must be many treasures in it. We have the crescent moon key. The only problem now is the nine-sword race.”<br/><br/>“Currently, the nine-sword race should not be able to send out any messages in this mystic realm. The other party killed one of our junior brothers and even wanted to destroy us. We have completely shed all pretense of cordiality. At this moment, we can either retreat and give up the mystic realm, or we can engage in a fight with them. This might provoke the nine-sword race.”<br/><br/>“From now on, junior brother Wang Xian, all of you can conceal your identities. All of us can guarantee that we will not leak anyone’s information.”<br/><br/>Senior Brother Junzi looked at Wang Xian and said.<br/><br/>Among the group of people who requested for reinforcements, he knew that Wang Xian was the strongest.<br/><br/>Whether he could obtain the treasure this time around and defeat the people from the nine-sword race depended on Wang Xian.<br/><br/>Therefore, he had to explain some things to Wang Xian.<br/><br/>“I am clear about this. Senior Brother Junzi has given me a small favor. Don’t worry about the following matters. If we can obtain the treasure this time, we will distribute it according to the situation of our contribution.”<br/><br/>Wang Xian nodded and said with a smile.<br/><br/>“This junior brother Wang Xian, is He…”<br/><br/>At this moment, senior brother Kong and senior brother Xu exchanged glances and looked at a disciple from the willow deity Daoist sect.<br/><br/>That disciple nodded slightly.<br/><br/>Senior Brother Kong and senior brother Xu’s pupils contracted slightly.<br/><br/>They did not pay much attention to the information about the willow deity Daoist sect in the past two years. However, they knew that a ruthless person had appeared in the willow deity Daoist sect.<br/><br/>It was a disciple who had caused the dragon race to issue a wanted notice.<br/><br/>The two people’s expressions changed as they remained silent at the side.<br/><br/>What a joke. The other party had provoked a mortal enemy like the dragon race. If it was not necessary, it was best for them to stay away from him. Otherwise, with the tyranny of the primary race in the universe, so what if they were killed?<br/><br/>Even if they were powerhouses at the peak of the celestial thearch.<br/><br/>“Junior Sister Lingxin, Junior Brother Junzi!”<br/><br/>At this moment, a voice came from behind.<br/><br/>A group of more than a dozen people rushed over.<br/><br/>Wang Xian looked over. There were more than a dozen middle-aged elders. Among them, five were at the eighth level of the celestial thearch, three were at the peak of the celestial thearch, and four were at the ninth level of the celestial thearch.<br/><br/>The strength of this group of people was not weak in the Milky Way.<br/><br/>“Senior brother Lu.”<br/><br/>Senior Sister Lingxin and senior brother Junzi looked over and revealed excited expressions.<br/><br/>They immediately went forward. It could be seen that their relationship with senior brother Lu was closer.<br/><br/>“How’s the situation?”<br/><br/>Senior brother Lu, who was holding a sharp sword in his hand, patted senior brother Junzi’s shoulder and asked with a smile.<br/><br/>“You already know the basic situation, senior brother Lu.”<br/><br/>Senior Sister Lingxin said bitterly.<br/><br/>“Is everyone here now?”<br/><br/>Senior brother Lu swept his gaze across the surroundings and asked.<br/><br/>“Everyone is here. Currently, including senior brother Lu, there are three peak-stage divine emperor experts on your side. We have a total of six.”<br/><br/>Senior Brother Junzi nodded.<br/><br/>“Six? You said that the nine-sword race has seven peak-stage divine emperor experts. Furthermore, they are in possession of powerful divine artifacts. It will be very difficult for us to gain the upper hand.”<br/><br/>“However, with our strength, we can still fight for some treasures.”<br/><br/>Senior brother Lu said in a low voice.<br/><br/>“It’s hard to say who will win. Senior brother Lu, our junior brother Wang Xian is very, very strong.”<br/><br/>At the side, senior sister Lingxin looked at Wang Xian and said with a smile.<br/><br/>“Oh? Junior brother Wang Xian?”<br/><br/>Senior brother Lu revealed a puzzled look.<br/><br/>“The dragon race is now on the wanted list…”<br/><br/>The elders on both sides of senior brother Lu frowned and looked at Wang Xian.<br/><br/>“With our strength, it’s enough. Let’s go and enter directly.”<br/><br/>Wang Xian glanced at them and said faintly.<br/><br/>“With your words, junior brother Wang Xian, we can rest assured!”<br/><br/>Upon hearing Wang Xian’s words, senior brother Junzi revealed a faint smile on his face.<br/><br/>Just like senior brother Kong and senior brother Xu’s reaction, senior brother Lu and the experts from his race remained silent.<br/><br/>“Senior Brother Junzi, lead the way!”<br/><br/>Wang Xian didn’t bother to be polite with the rest of the people and gestured to senior brother Junzi.<br/><br/>“Alright.”<br/><br/>Senior Brother Junzi nodded and immediately followed behind.<br/><br/>Buzz! Buzz<br/><br/>At the side, Senior Brother Kong, senior brother Lu, and the rest moved. Their bodies were enveloped and completely concealed.<br/><br/>They were afraid of the revenge of the nine swords race, so they had made preparations in advance.<br/><br/>The crescent moon was clearly the core of this divine kingdom. They entered through the entrance and saw a sea of water. The sea contained boundless spiritual energy, and it was used to cultivate the divine tree divine grass.<br/><br/>There was no divine tree divine grass on the sea, and no one knew if it had been plucked or something else.<br/><br/>“This is the first level of the crescent moon, and the second level is the cultivation room. There are many divine artifacts on it, and those divine artifacts were all snatched away by the nine-sword race’s experts.”<br/><br/>“As for what treasures are on the third level, we don’t know. Currently, the nine-sword race has entered the third level at least. We have yet to discover if the crescent moon secret realm has a strong defense.”<br/><br/>“According to our guesses, this secret realm might not have any defenses. However, there is one point. Some places might require the crescent moon key to enter.”<br/><br/>Senior gentleman said as he took out a crescent moon-like key. It was flickering with a mysterious luster and resonated with the entire Cosmos God nation.<br/><br/>“Let’s go up.”<br/><br/>Wang Xian nodded his head. He looked towards the entrance of the second level and flew towards it.<br/><br/>Everyone immediately followed behind.<br/><br/>This time, there were more than 70 disciples from the Willow deity Daoist sect. including Wang Xian and the rest, there were a total of more than 90 people.<br/><br/>The location of the second level was similar to a combat arena and a training arena.<br/><br/>As his gaze swept across the area, some of the divine artifacts on the shelves had already disappeared.<br/><br/>The divine artifacts placed by Venerable Crescent Moon were definitely top-notch existences.<br/><br/>“Let’s continue up. Crescent Moon has a total of five levels.”<br/><br/>Senior gentleman frowned as he looked around. He spoke and continued to fly towards the entrance of the third level.<br/><br/>When he arrived at the entrance of the third level, he saw a space filled with the power of light. Vaguely, he could hear the sounds of fighting coming from inside.<br/><br/>“The people from the nine swords race are up there. There are guardians in the Crescent Mystic Realm!”<br/><br/>At the side, senior brother Lu’s gaze focused as he spoke.<br/><br/>Wang Xian scanned his surroundings and narrowed his eyes slightly.<br/><br/>The entire third level looked very strange. There were white transparent glass boxes that were 10 to 20 meters in size. Inside the glass boxes, there were human-shaped things with wings.<br/><br/>They looked like machines, but also some special creatures.<br/><br/>“This is a battle angel. It’s rumored that venerable crescent moon controls some of the abilities of the top race of the universe, the angel race. He can create biological angels through special methods.”<br/><br/>Brother Kong exclaimed from the side.<br/><br/>“Battle Angel?”<br/><br/>When Wang Xian heard his words, he revealed a surprised expression.\t\t\t\t\t\t</div>", "images": {}, "success": true}