{"id": 100, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15072101.html", "title": "Chapter 3091 - Chapter 3091: 3090 Elementary Race Of The Universe: Dragon Palace", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 3091 - Chapter 3091: 3090 Elementary Race Of The Universe: Dragon Palace</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 3091: 3090 elementary race of the Universe: Dragon Palace<br/><br/>“Dragon King, the forces around the ruins of the Mohan clan have been dealt with.”<br/><br/>In the Dragon King’s Palace, Prime Minister Gui reported to Wang Xian after he had dealt with the problems.<br/><br/>“Dragon King, we have gained a lot this time!”<br/><br/>The group of leaders walked in and said excitedly.<br/><br/>“Oh?”<br/><br/>Wang Xian looked at them with a puzzled expression.<br/><br/>“A group of races are afraid that our Dragon Palace will take revenge on them. They took out a large amount of resources, especially the few races that coveted our Dragon Palace’s Divine Dragon. The resources they took out are enough for our Dragon Palace to produce a few peak-stage divine emperor-level members.”<br/><br/>“With all the resources added together, our Dragon Palace should be able to produce 14 to 15 peak-stage divine emperor-level powerhouses. For example, the living soul race’s brain spirit race. In order to save their lives, they are willing to take out all the resources and treasures in the Treasury.”<br/><br/>Prime Minister Gui was also full of smiles as he spoke.<br/><br/>“In that case, with the remnants of the Mo Han clan and the corpses of the Hong Tian Divine Emperor, the Dragon Palace will be able to produce about 25 peak-stage divine emperor powerhouses and a universe knight-level combat strength powerhouse?”<br/><br/>Wang Xian raised his eyebrows and said indifferently.<br/><br/>“Yes, Dragon King. This time, our Dragon Palace will be able to obtain a huge improvement.”<br/><br/>Prime Minister Gui nodded his head heavily and continued, “With such strength, even if our Dragon Palace were to be placed in the Milky Way, we would be considered a strong force.”<br/><br/>“The corpses of the Universe Knights of the Mohan clan will be used to increase the strength of the Heaven Array. After the Heaven Array is upgraded, our Dragon Palace will be placed in the Milky Way. We should be able to rank among the top.”<br/><br/>Wang Xian calculated in his heart.<br/><br/>At present, there were more than 80,000 divine emperor level disciples in the Dragon Palace. Among the elementary races in the universe, there were very few.<br/><br/>It was even less than the number of domain level races. However, there were many peak powerhouses in the Dragon Palace.<br/><br/>Currently, there were 11 peak divine emperor level powerhouses in the Dragon Palace. Adding another 25, it would be 37.<br/><br/>37 peak divine emperor level powerhouses. Among the elementary races in the universe, the number was not much, but it was not little either.<br/><br/>Furthermore, there was still the sky array and himself.<br/><br/>Once the sky array was upgraded, it would be able to contend against three universe knights at level one.<br/><br/>And he had the ability to instantly kill a universe knight at level one.<br/><br/>There were a few weak primary races in the universe in the Milky Way, but they only had one universe knight overseeing them.<br/><br/>“After the matters here are settled, let a large number of our Dragon Palace’s disciples enter the Milky Way. There are countless desolate beasts in the Milky Way. Hunting the desolate beasts in the Milky Way will allow our dragon palace’s strength to increase rapidly.”<br/><br/>Wang Xian continued speaking to Prime Minister Gui and the rest.<br/><br/>“Yes. After the breakthrough of the Heaven Formation, it will be much easier for us to hunt the dire beasts in the water. Our strength will also enter a period of explosive growth.”<br/><br/>Prime Minister Gui nodded his head.<br/><br/>Wang Xian nodded his head. With the resources in the Milky Way, it was sufficient for the members of the Dragon Palace to achieve a huge improvement.<br/><br/>“Heaven Formation, you should go and make the breakthrough first.”<br/><br/>He instructed.<br/><br/>Sky array nodded his head and flew into the dragon transformation pool with excitement.<br/><br/>While the members of the Dragon Palace were upgrading, another sensational event happened in the starry sky around the ruins of the Mohan clan.<br/><br/>Initially, everyone thought that the Mohan clan would regain its glory and establish an immortal race again.<br/><br/>However, they didn’t expect that all ten experts of the Mohan clan were killed in less than a day.<br/><br/>Even that universe knight was killed.<br/><br/>The terrifying power of the Dragon Palace was displayed in front of everyone.<br/><br/>The Warriors of the races didn’t hide anything, and they didn’t dare to hide it on purpose.<br/><br/>What happened in front of the Dragon Palace was also announced.<br/><br/>When everyone heard that the Dragon King of the Dragon Palace killed the universe knight with the remnant bloodline of the Mo Han clan, their faces were filled with shock and disbelief.<br/><br/>Following that, all the races around the ruins of the Mohan clan announced that they would submit to the Dragon Palace and take the Dragon King as their leader.<br/><br/>This news shocked everyone even more.<br/><br/>They knew that the king of this region had been born.<br/><br/>From the time they knew about the Dragon Palace to the time the Dragon Palace dominated, it had only been two to three years.<br/><br/>In two to three years, a huge power was born, and a new primary race of the universe, the Dragon Palace, was born.<br/><br/>The Red Mist race had also completely disappeared.<br/><br/>Time passed day by day, and the various races also respectfully sent resources to the Dragon Palace.<br/><br/>The Heaven Array and the experts of the Dragon Palace were also rapidly improving their strength in the dragon transformation pool.<br/><br/>After settling the matter with the ice mountain race in the Milky Way, Wang Xian finally had some free time.<br/><br/>“I’m about to complete my breakthrough!”<br/><br/>More than ten days later, in the Dragon King’s Hall, Wang Xian was holding the five elements millstone.<br/><br/>On the five elements millstone, there was a saber and a sword. The saber and sword were somewhat illusory and looked a little weak.<br/><br/>Acquired Spiritual Treasure, Saber and sword scar.<br/><br/>The acquired spiritual treasure, Frost Divine Sword, had already been absorbed by the Five Elements Millstone. The absorption of the Saber and sword scar was also at the end.<br/><br/>Once it was absorbed, the five elements millstone would have the destructive power to kill a level one universe knight.<br/><br/>After all, the Five Elements Grinder had absorbed two acquired spirit treasures.<br/><br/>Weng Weng Weng Weng<br/><br/>Not long after, the five elements grinder in his hand trembled, and the illusory blade and sword dissipated, completely merging into it.<br/><br/>In the center of the five elements grinder, the spirits of the Frost God sword and the blade and sword scars flickered.<br/><br/>They moved agilely within the five elements grinder.<br/><br/>The Five Elements Millstone had absorbed two acquired spiritual treasures, and it also controlled the strongest attack of these two acquired spiritual treasures.<br/><br/>“It’s complete!”<br/><br/>With a wave of his hand, Wang Xian could feel the terrifying destructive power contained in the five elements millstone. A smile appeared on his face.<br/><br/>Boom! Boom! Boom<br/><br/>At this moment, a powerful force was transmitted from the location of the dragon transformation pool.<br/><br/>Wang Xian moved his body and immediately appeared in front of the dragon transformation pool.<br/><br/>The Heaven Formation that was emitting nine different types of lights was emitting waves of powerful force.<br/><br/>Even though he had just broken through, the Heaven Formation was still several times more powerful than the clan leader of the Mohan clan.<br/><br/>“Dragon Palace, the upgrade is complete!”<br/><br/>The Heaven Formation cracked a smile and flew to Wang Xian immediately.<br/><br/>“Congratulations to the leader of the Heaven Formation.”<br/><br/>Prime Minister Gui flew over and congratulated him.<br/><br/>“We have almost leveled up. Prime Minister Gui, get the disciples of the Dragon Palace to prepare. We will enter the Milky Way.”<br/><br/>Wang Xian spoke.<br/><br/>“It’s the Dragon King. We have made preparations in advance. We have also investigated the volcanic region of the Milky Way. We can get the disciples of the Dragon Palace to act immediately.”<br/><br/>Prime Minister Gui nodded.<br/><br/>“Call Xianling Yuan and the rest over. I have something to ask them.”<br/><br/>Wang Xian instructed Prime Minister Gui.<br/><br/>“It’s the Dragon King!”<br/><br/>Prime Minister Gui nodded and left immediately.<br/><br/>“Let’s go.”<br/><br/>Wang Xian gestured toward the sky array and walked toward the Dragon King’s palace.<br/><br/>Next, he had to plan the matters in the Milky Way.<br/><br/>The Dragon Palace was currently very strong, but they were not strong enough to wipe out the dragon race, the skeleton race, and the nine-sword race. They were not even a match for them.<br/><br/>If the Dragon Palace wanted to improve quickly, they could only target universe knight level desolate beasts.<br/><br/>Over at the volcano region, there was a universe knight level desolate beast.\t\t\t\t\t\t</div>", "images": {}, "success": true}