{"id": 112, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15072125.html", "title": "Chapter 3103 - Chapter 3103: 3102 Easily Killed Them", "volume": 2, "volume_title": "Volume 2", "body": "<h1>Chapter 3103 - Chapter 3103: 3102 Easily Killed Them</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 3103: 3102 easily killed them<br/><br/>Take or leave!<br/><br/>Senior Martial Brother Lu and the others’expressions changed. Once the powerful warriors of the nine swords race died, the nine swords race would explore all traces to find the opponents who had killed their clansmen.<br/><br/>They could guarantee that the disciples of the Willow deity Daoist sect would not say anything, but what about those powerful wizards?<br/><br/>Eight Peak Divine Emperor powerhouses had been killed. It was possible that the nine swords race would look for venerable level wizards to hunt down and kill their opponents.<br/><br/>The probability of them being discovered was about 30% .<br/><br/>Was this risk worth taking?<br/><br/>“We’re already on the ship. Once the nine-sword race experts are killed, we’ll definitely be suspected. With the universe’s primary level race’s dominance, we won’t be able to explain it clearly. Do It!”<br/><br/>The elder beside senior brother Lu transmitted his voice to them.<br/><br/>Senior brother Lu nodded slightly. The mace in his hand emitted a powerful force.<br/><br/>Senior Martial Brother Kong and senior martial brother Xu looked at each other, their eyes revealing an ice-cold expression.<br/><br/>“Attack!”<br/><br/>“Kill this bunch of reckless things!”<br/><br/>At this moment, the ice-cold voice of the first elder of the nine-sword race sounded from the opposite side. Following that, a sword plate hung in the air, and numerous sharp swords directly attacked them.<br/><br/>“Clang!”<br/><br/>The Battle Angel at the peak of the Celestial Emperor held the Holy Sword and charged towards them directly.<br/><br/>“Leave the Battle Angel to me. I’ll leave the rest to you guys!”<br/><br/>As Wang Xian spoke, he waved his five elements millstone and attacked the battle angel at the peak of the Celestial Emperor.<br/><br/>“Kill!”<br/><br/>Senior Brother Junzi and the rest had murderous intent in their eyes as they charged towards the nine-sword race.<br/><br/>“Kill them and avenge junior martial brother Miao!”<br/><br/>The group of disciples from the Willow deity Daoist sect were also filled with murderous intent.<br/><br/>Originally, they were the first ones to discover this place. A group of unspecialized people who had a relatively good relationship with them had entered this place, but they had been betrayed.<br/><br/>Usually, their group of unspecialized people had a very good relationship. Although it was not to the point of being like brothers, they still had very deep feelings for each other.<br/><br/>Revenge, kill!<br/><br/>So what if they offended a primary race of the universe?<br/><br/>They had the protection of Venerable Willow God.<br/><br/>These people could be said to be extremely talented geniuses in the outside world. The primary race of the universe also had to be wary of them.<br/><br/>“Courting death, don’t leave a single one alive!”<br/><br/>“Control the sword disc and destroy them!”<br/><br/>The eight elders of the nine sword race shouted. Six of them floated around the sword disc and controlled it to unleash terrifying attacks.<br/><br/>Although the sword disc was not a acquired Numinous Treasure, it was definitely a powerful divine weapon.<br/><br/>The most terrifying thing about this divine weapon was that it could be controlled by six elders and could fight against ten opponents of the same level.<br/><br/>Terrifying sword rays covered senior martial brother Junzi and the other six peak divine emperor experts.<br/><br/>The eyes of the nine-sword race’s first elder and second elder were filled with killing intent. They attacked from the left and right.<br/><br/>In an instant, it was as if they were facing twice their opponents.<br/><br/>“Roar! Roar!”<br/><br/>“Roar! Roar!”<br/><br/>Ao Tu, the AO Phoenix, took a glance at Wang Xian and saw that their Dragon King was leisurely controlling the five elements grinding mill to attack the Battle Angel at the peak of the Celestial Emperor Realm. They moved and immediately joined the battle.<br/><br/>Ao Tu let out a low roar and took the lead to receive the attack of the sword disc.<br/><br/>“Bang, Bang, Bang!”<br/><br/>Streaks of terrifying sword rays landed on Ao Tu’s turtle shell. The streaks of attacks were easily blocked.<br/><br/>The crescent mystic realm could suppress the strength of a person, but the strength of the physical body could not be suppressed.<br/><br/>Although ao Tu’s strength was not at the peak, his defense was still extremely terrifying.<br/><br/>“Oh? Among them, there are experts at the peak of the Celestial Emperor Realm. No wonder they are so arrogant and dare to fight against us!”<br/><br/>Seeing Ao tu blocking their sword disc’s attack, the elders of the nine-sword race turned solemn and coldly shouted.<br/><br/>“HMPH, even if there are two peak celestial thearch experts among you, you will die!”<br/><br/>The first elder of the nine-sword race roared with killing intent.<br/><br/>“Hehe, nine-sword race!”<br/><br/>Just as he finished speaking, a mocking voice sounded.<br/><br/>“Oh?”<br/><br/>“What?”<br/><br/>The elders of the nine-sword race looked over and their expressions suddenly changed. They shouted in disbelief.<br/><br/>“What’s going on?”<br/><br/>The disciples of the nine-sword race widened their eyes and immediately looked forward.<br/><br/>“This…”<br/><br/>When they looked at the exit, they opened their mouths slightly.<br/><br/>In front of the entrance, the battle angel that they had spent a lot of effort to suppress was actually completely frozen.<br/><br/>It stood there without moving.<br/><br/>Upon seeing this situation, they felt somewhat incredulous.<br/><br/>What was going on?<br/><br/>They didn’t even sense the situation over there, yet their battle Angel had been suppressed?<br/><br/>“It’s… It’s that Wang Xian. He suppressed the battle Angel in an instant. How could this be? How could he have such strength!”<br/><br/>The body of the disciple of the willow deity Daoist sect named Jing Yue trembled as he roared with an extremely pale face.<br/><br/>“Kill them all!”<br/><br/>Wang Xian waved his arm and the five elements Millstone attacked the sword disc in the sky.<br/><br/>“Bang!”<br/><br/>Before the elders of the nine swords race could react, the sword disc collapsed. The five elements millstone wrapped around the sword disc with a surge of energy.<br/><br/>A terrifying force attacked the elders of the nine swords race below.<br/><br/>“What Divine artifact is this? !”<br/><br/>The nine-sword elders roared in horror.<br/><br/>“Kill them and avenge junior brother Miao!”<br/><br/>Senior Sister Lingxin roared with murderous intent when she saw this scene.<br/><br/>“Kill!”<br/><br/>Senior Brother Junzi focused his gaze and attacked the nine-sword elders.<br/><br/>The pressure of the Five Elements Millstone had already announced the end of this battle.<br/><br/>The strength of all of them could at most be compared to two peak-stage divine emperors in the outside world.<br/><br/>The Five Elements Millstone had the offensive power of a universe knight.<br/><br/>If Wang Xian had not held back intentionally, the five elements millstone would have been able to sweep them away with a single strike.<br/><br/>However, even so, under the cover of the Five Elements Millstone, their breathing became sluggish and they could hardly make a move.<br/><br/>“No, no, no, if you dare to kill us, our nine-sword race will not let you off!”<br/><br/>“Wang Xian,”<br/><br/>The nine-sword race’s great elder roared. His arrogance and confidence were completely different from before.<br/><br/>How did they meet such a monster?<br/><br/>What was the level of that millstone-like treasure?<br/><br/>Was it comparable to a universe knight?<br/><br/>“Peng Peng Peng!”<br/><br/>However, in the next moment, they were met with the fatal attacks of their senior brothers.<br/><br/>The terrifying power landed on their bodies and instantly destroyed their life force.<br/><br/>“Senior Sister Lingxin, don’t kill me, don’t kill me!”<br/><br/>The traitor Jing Yue saw this scene and immediately collapsed on the ground. Seeing senior sister Lingxin attacking him, she howled in despair.<br/><br/>“Go to Hell.”<br/><br/>There was no fluctuation in senior sister Lingxin’s eyes. The sharp sword went straight into his head.<br/><br/>“Huff, Huff, Huff!”<br/><br/>The other disciples of the nine-sword race had bloodshot eyes. They wanted to escape.<br/><br/>Senior brother Lu and the rest activated their palms and killed him quickly.<br/><br/>At this point, less than a minute had passed from the start of the battle to the end. It was less than the time they spent talking.<br/><br/>Wang Xian stood at the back and watched indifferently.\t\t\t\t\t\t</div>", "images": {}, "success": true}