{"id": 110, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15072121.html", "title": "Chapter 3101 - Chapter 3101: The Shock Of The 3100 Disciples Of The Willow Deity Daoist Sect", "volume": 2, "volume_title": "Volume 2", "body": "<h1>Chapter 3101 - Chapter 3101: The Shock Of The 3100 Disciples Of The Willow Deity Daoist Sect</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 3101: The shock of the 3100 disciples of the Willow deity Daoist sect<br/><br/>“Ka Ka Ka!”<br/><br/>The Divine Frost sword that flew out from the five elements grinding mill attacked the battle angel at a terrifying speed.<br/><br/>In an instant, the divine frost sword landed on the chest of the Battle Angel.<br/><br/>The sound of ice covering rang out as the frost on the divine frost sword gradually froze the entire battle angel.<br/><br/>The Battle Angel, who was at the peak of the Celestial Emperor Realm, struggled to break free. However, the power of the ice was too terrifying and directly froze it completely.<br/><br/>An ice sculpture of a battle Angel was formed.<br/><br/>Following that, Thorns flew out from the five elements grinding mill. The thorns covered the rest of the battle angels and entangled them.<br/><br/>The Battle Angel, which was invincible to senior brother Junzi, senior brother Lu, and the rest, was easily dealt with by Wang Xian.<br/><br/>“Hiss… this… this… how could brother Wang Xian’s weapon be so terrifying?”<br/><br/>“How is this possible! The Battle Angel at the peak of the celestial thearch level was instantly frozen. How powerful is that millstone-like divine weapon?”<br/><br/>“This is too terrifying!”<br/><br/>In the surrounding area, the disciples of the Willow deity Daoist sect saw the five elements millstone instantly freezing the battle angel at the peak of the celestial thearch level. Their eyes widened and their faces were filled with shock.<br/><br/>A battle angel at the peak of the Celestial Emperor Realm. Under the situation where their combat strength was suppressed by 90% , it would require at least a dozen experts at the peak of the Celestial Emperor Realm to suppress a battle angel.<br/><br/>However, Wang Xian was able to completely freeze and suppress it with just a divine weapon.<br/><br/>How Strong was Wang Xian?<br/><br/>How terrifying was that divine weapon?<br/><br/>“This attack power…”<br/><br/>Senior brother Lu and the two elders beside him narrowed their eyes slightly. They looked at each other and were filled with shock.<br/><br/>The divine weapon was powerful enough to suppress a battle angel at the peak of the Celestial Emperor Realm.<br/><br/>“The divine weapon is not suppressed here. Even so, the divine weapon in his hand is very terrifying.”<br/><br/>An old man transmitted his voice, his eyes gleaming.<br/><br/>“He once killed a peak divine emperor expert from the dragon race. His strength is definitely at the peak of the Divine Emperor Realm.”<br/><br/>Senior brother Lu was slightly shocked.<br/><br/>No wonder he dared to suppress over 1,000 battle angels in one go.<br/><br/>His gaze swept across the five elements grinding mill. His eyes were filled with fear and fervor.<br/><br/>“Thank you, junior brother Wang Xian, for your help.”<br/><br/>Senior Brother Junzi was extremely shocked when he saw the battle angels being suppressed. Wang Xian’s strength was much stronger than he had imagined.<br/><br/>“Alright.”<br/><br/>Wang Xian waved his arm and grabbed the core of the battle angels at the peak of the Celestial Emperor Realm. Over 20 battle angels were stored in the mother nest.<br/><br/>After he was done, he looked at senior brother Lu and the rest.<br/><br/>“Thank you for your help, junior brother Wang Xian.”<br/><br/>Senior brother Lu and the rest felt Wang Xian’s gaze. They squeezed out a smile and took out one battle angel after another and threw them to him.<br/><br/>“Do what you can.”<br/><br/>Wang Xian reminded them lightly. With a wave of his arm, he kept all the battle angels.<br/><br/>Following that, he continued to suppress the other battle angels.<br/><br/>“Let’s continue!”<br/><br/>Senior brother Lu and the rest saw that Wang Xian was continuing to suppress them. Their expressions changed as they growled in a low voice.<br/><br/>This time, they were much more obedient. They didn’t dare to destroy more than ten to twenty battle angels without restraint.<br/><br/>Each time, they managed to destroy seven to eight battle angels. It was much easier to deal with them.<br/><br/>Senior Brother Kong and senior brother Xu also restrained themselves a lot. The two of them managed to destroy five to six battle angels at once to prevent any accidents from happening.<br/><br/>If there were any accidents, it might not be worth it to ask Wang Xian for help.<br/><br/>Everyone continued to suppress the battle angels one by one.<br/><br/>Wang Xian’s speed was very fast. He could suppress more than a thousand of them at once. Although it would take him a few minutes, his speed was still very terrifying.<br/><br/>There were only more than 10,000 battle angels in the entire hall. In less than 20 minutes, Wang Xian had already harvested more than 5,000 battle angels.<br/><br/>“Suppress!”<br/><br/>At the same time, at the deepest part of the third level, a group of experts from the nine-sword race was surrounding and attacking the battle Angel who was at the peak of the celestial thearch.<br/><br/>They had been fighting it for more than half an hour.<br/><br/>If not for the powerful treasures in their hands, they would have been defeated long ago.<br/><br/>At this moment, above the peak of the Celestial Thearch Battle Angel, a sword was hovering in the air. Divine swords were rotating around the battle angel, and the terrifying sword rays were attacking continuously, this caused the battle Angel’s range of movement to become smaller and smaller.<br/><br/>In the surroundings, the experts of the nine-sword race revealed heated expressions in their eyes.<br/><br/>“Second brother, take out the core.”<br/><br/>The peak of the Celestial Emperor realm expert of the nine-sword race shouted at the elder beside him.<br/><br/>“It’s first elder, hahaha!”<br/><br/>The second elder of the nine-sword race laughed loudly as his figure streaked through the air like a ghost.<br/><br/>In the next moment, he returned to his previous position with a core in his hand. An excited expression appeared on his face.<br/><br/>“Success! Hahaha, I’ve finally suppressed this battle Angel!”<br/><br/>He could not help but growl in a low voice.<br/><br/>“Good, good, good!”<br/><br/>“Take control of it immediately!”<br/><br/>The elders of the nine swords race surrounded him and roared with burning eyes.<br/><br/>As long as they could control this battle angel and control it, it would be easier for them to suppress the other battle angels.<br/><br/>“First Elder, Here!”<br/><br/>The second elder handed the core to the first elder.<br/><br/>After the first elder took it, he immediately sensed the information inside and changed the instructions in the core.<br/><br/>Around them, the experts and disciples of the nine-sword race were waiting excitedly.<br/><br/>“It’s Done!”<br/><br/>“Remove the heaven-seeking sword disc!”<br/><br/>Ten minutes later, the first elder’s eyes flashed with a bright light as he said in a low voice.<br/><br/>The second elder and the others waved their arms, and the sword disc in the sky flew back.<br/><br/>“Come here!”<br/><br/>The first elder stared at the Battle Angel who was at the peak of the divine emperor realm fervently as he ordered.<br/><br/>“Clang!”<br/><br/>The Battle Angel withdrew the Holy Sword and stood respectfully in front of the first elder like a loyal guard.<br/><br/>“Good, good. With this battle Angel, all the treasures in the Crescent Mystic Realm will belong to our nine swords race!”<br/><br/>The first elder clenched his fist and roared.<br/><br/>“Haha, First Elder, our nine swords race has reaped a great harvest this time. Just these battle angels alone can increase our nine swords race’s fighting strength by a lot.”<br/><br/>A few elders beside him opened their mouths and could not help but be excited.<br/><br/>The treasures here really moved their hearts.<br/><br/>“First Elder, those guys at the third level entrance haven’t given up yet. They’re also suppressing the battle angels.”<br/><br/>At this time, a disciple of the nine blade race looked towards the entrance and said.<br/><br/>“HMPH, it’s better if they haven’t given up. I’m just afraid that they’ll tell the information here to the other universe primary races.”<br/><br/>“However, all the treasures in this crescent mystic realm belong to our nine swords race.”<br/><br/>The nine swords race’s first elder looked over, his eyes flashing with a cold luster.<br/><br/>“First Elder, with a peak-stage divine Emperor Battle Angel, we’ll go and destroy them and obtain that crescent moon key. With them holding the crescent moon key, it’s still a hidden danger!”<br/><br/>The few elders pondered for a moment and roared with killing intent.\t\t\t\t\t\t</div>", "images": {}, "success": true}