{"id": 111, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15072123.html", "title": "Chapter 3102 - Chapter 3102: 3101 Easily Killed Them", "volume": 2, "volume_title": "Volume 2", "body": "<h1>Chapter 3102 - Chapter 3102: 3101 Easily Killed Them</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 3102: 3101 easily killed them<br/><br/>“Kill!”<br/><br/>“Kill all of them. After we get the Crescent Moon Key, this crescent moon mystic realm will belong to us!”<br/><br/>The first elder of the nine swords clan swept his gaze across the crowd, his eyes filled with killing intent.<br/><br/>After he finished speaking, he looked towards the exit.<br/><br/>“Get Ready!”<br/><br/>The rest of the elders and disciples smiled malevolently as they looked towards the entrance.<br/><br/>“Don’t let them escape this time.”<br/><br/>The first elder waved his arm as he spoke, he put away the battle angel beside him. “When we go over, I will release the Battle Angel and have him guard the exit of the third floor. As long as we trap them, we will be able to destroy them with our strength.”<br/><br/>“First Elder, as long as we have this battle angel, it will be easy to destroy them.”<br/><br/>The corners of the second elder and the others’mouths curled up slightly, their expressions filled with confidence.<br/><br/>Although the nine sword race didn’t send any universe knights this time, eight members of their elder group did.<br/><br/>Their strength was at the peak of the nine sword race below the knight level.<br/><br/>With the strength of the people from the Willow deity Daoist sect, even if they didn’t have a battle angel, they had the confidence to kill the other party.<br/><br/>Now that the other party had called for help, how many peak divine emperors could there be?<br/><br/>“Let’s go.”<br/><br/>The great elder of the nine-sword race moved and immediately flew towards the exit.<br/><br/>“Oh? They actually suppressed so many battle angels?”<br/><br/>When they flew towards the exit, they immediately saw that a large number of battle angels had disappeared. Their expressions changed slightly and revealed a shocked expression.<br/><br/>Their gazes swept forward and landed on Wang Xian, senior brother Lu, senior brother Kong, senior brother Xu, and the rest. Their eyes sparkled.<br/><br/>“First Elder, they should have seven powerhouses at the peak of the Divine Emperor Realm. However, this bunch of fellows are really courting death. They actually managed to break through the boxes of battle angels in large numbers.”<br/><br/>“TSK tsk, their luck is really good. They didn’t encounter any powerful battle angels.”<br/><br/>Second Elder swept his gaze forward and said in a low voice.<br/><br/>“The people of the nine sword race are here!”<br/><br/>“Be careful!”<br/><br/>At this moment, the disciples of the Willow deity Daoist sect also noticed the arrival of the nine sword race. Their faces revealed an expression of vigilance and anger as they glared at them.<br/><br/>Senior Martial Brother Junzi and the others immediately stopped and stared at them.<br/><br/>Senior martial brother Lu, senior martial brother Kong, and the others’expressions changed slightly as they stared at the group of people in the depths.<br/><br/>“Block the exit!”<br/><br/>At this moment, the head elder of the nine sword race waved his arm and the battle angel at the peak of the divine emperor realm flew rapidly towards the exit of the third level.<br/><br/>He held the Holy Sword in his hand and stood at the exit coldly, waiting for the order.<br/><br/>“That is… the battle angel at the peak of the Divine Emperor Realm!”<br/><br/>“They have suppressed that battle Angel!”<br/><br/>When the disciples of the Willow deity Daoist sect felt the power and speed of that battle angel, their expressions changed slightly.<br/><br/>“What are you guys trying to do?”<br/><br/>Senior Martial Brother Junzi swept a glance at that battle angel and asked the experts of the nine swords race with a cold expression.<br/><br/>“Hahaha, what are you trying to do? Immediately give us the crescent moon key in your hand. I can let you guys live. Otherwise, don’t blame us for being impolite.”<br/><br/>When the great elder of the nine swords race saw the battle Angel blocking the exit, a trace of a smile appeared on his face as he said coldly.<br/><br/>“Could it be that your nine swords race is being polite to us? You killed one of our junior brothers, and now you want to Snatch Our Things?”<br/><br/>Senior Sister Lingxin stared at them with a face full of anger.<br/><br/>“Senior Sister Lingxin, give us the crescent moon key, and our nine swords race will not mistreat you. What’s the point of causing such a Ruckus?”<br/><br/>Behind the nine sword clan, an old man said indifferently.<br/><br/>“It’s you who are shameless. How can you be justified in snatching our things? Jingyue, you are a traitor and a person with evil intentions. In the future, the willow deity Daoist sect will not tolerate people like you.”<br/><br/>Senior Brother Junzi also berated them with a sullen face.<br/><br/>“Shut up. Hand over the crescent moon key immediately and we can give you a chance to live. Otherwise, all of you will die.”<br/><br/>The nine-sword race’s first elder said with murderous intent. An aura charged towards them.<br/><br/>The seven elders around them also emitted a powerful aura. Their faces were filled with fury.<br/><br/>“Looks like if we don’t hand it over, all of you will kill us?”<br/><br/>Senior Brother Junzi held the sharp sword in his hand tightly. His eyes were filled with coldness.<br/><br/>Senior Brother Lu, senior brother Kong, senior brother Xu and the rest came to the side of senior brother Junzi. They glanced at the peak-stage divine Emperor Battle Angel at the exit with fear.<br/><br/>However, they didn’t feel any fear at the moment. After witnessing Wang Xian’s strength, they were certain that the experts of the nine-sword race were no match for them.<br/><br/>“What do you guys think?”<br/><br/>The corners of the mouth of the first elder of the nine-sword race curled up slightly. The few elders at the side dispersed slowly. The killing intent on their bodies was not concealed at all.<br/><br/>“Kill them all. There should be a lot of gains on them.”<br/><br/>Wang Xian walked towards senior brother Junzi and the rest as he spoke.<br/><br/>Kill them?<br/><br/>Upon hearing Wang Xian’s words, senior brother Lu, senior brother Kong, and the rest narrowed their eyes.<br/><br/>“Eh? Kill Us? Hahaha, what arrogance.”<br/><br/>In the front, everyone from the nine-sword race paused slightly when they heard Wang Xian’s words. They looked at him in unison.<br/><br/>“First Elder, he is Wang Xian. He is the one wanted by the dragon-descendant race. He is very strong and very fast. He is able to kill a powerhouse at the peak of the divine emperor realm in an instant.”<br/><br/>A disciple of the nine-sword race at the Willow deity Daoist sect saw Wang Xian and his gaze froze slightly. He immediately said.<br/><br/>“Oh? He is the one wanted by the dragon-descendant race. The iceberg race was also destroyed by him?”<br/><br/>The nine swords race’s first elder raised his eyebrows slightly. He looked at Wang Xian with a serious expression.<br/><br/>“Yes, it’s him. His strength is considered to be at the peak of the Celestial Emperor Realm. We can not underestimate him.”<br/><br/>The disciple nodded.<br/><br/>“So what if he is at the peak of the Celestial Emperor Realm? His strength is suppressed to 90% here. How can he be a match for a battle angel at the peak of the Celestial Emperor Realm?”<br/><br/>“Such an arrogant fellow. How dare he say that he will destroy us? Hehe.”<br/><br/>The second elder and the rest spoke in a sinister tone.<br/><br/>“Don’t waste their time. Let’s do it.”<br/><br/>As the first elder spoke, divine swords circled around them.<br/><br/>Clang! Clang! Clang! Clang<br/><br/>The sound of Sharp Swords being unsheathed rang out. A cold aura filled the entire space.<br/><br/>“Let’s do it. Leave No one alive.”<br/><br/>When Wang Xian saw them making their move, he said to senior brother Junzi and the rest.<br/><br/>“This… They are from the nine-sword race. If they knew that we killed them, wouldn’t they be taken revenge?”<br/><br/>Senior brother Lu and the rest’s expressions changed slightly as they whispered.<br/><br/>“You guys can choose not to participate. However, you guys won’t have a share of the treasures after this.”<br/><br/>Wang Xian said to them.<br/><br/>This caused their expressions to change.<br/><br/>Senior Brother Junzi watched from the side and didn’t speak.<br/><br/>The reason why he and junior sister Lingxin were able to summon so many experts was firstly because they were friends, and secondly, the most important point was the secret realm of the Crescent Moon Venerable.<br/><br/>Otherwise, when they learned that the enemy was a primary race of the universe, they would definitely not dare to come over to help.<br/><br/>The benefits were greater than the consequences, so they could take risks.<br/><br/>However, once they killed the experts of the nine-sword race, they would be their mortal enemies.<br/><br/>If the nine-sword race found out, they would most likely be exterminated.<br/><br/>This was a matter of choice.<br/><br/>It would depend on whether they were willing to take the risk.<br/><br/>As for Wang Xian’s words, no one would think that he was bluffing.<br/><br/>If Wang Xian wanted to kill all the people of the nine-sword race, he would definitely be able to kill them.<br/><br/>Senior brother Jun Zi did not mind becoming enemies with the nine swords race completely because one of his junior brothers had died at their hands.<br/><br/>They also wanted revenge!<br/><br/>Many disciples of the Willow deity Daoist sect had very good temperaments!\t\t\t\t\t\t</div>", "images": {}, "success": true}