{"id": 117, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15072135.html", "title": "Chapter 3108 - Chapter 3108: 3107 In Exchange For The Crescent Moon Key", "volume": 2, "volume_title": "Volume 2", "body": "<h1>Chapter 3108 - Chapter 3108: 3107 In Exchange For The Crescent Moon Key</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 3108: 3107 in exchange for the crescent moon key<br/><br/>“Haha, I’ve obtained a bronze mirror. It has the ability to investigate. Its effect is extremely powerful. It’s a ninth level divine emperor treasure.”<br/><br/>“Hehe, I’ve moved the bed that Venerable Crescent Moon slept on. In the future, if I sleep alone, I might be able to touch venerable crescent moon’s luck.”<br/><br/>“I’ve obtained a pendant that has a protective function.”<br/><br/>On the fifth floor, when the disciples of the Willow deity Daoist sect saw that someone had obtained a medicine bottle, they sped up and searched the surroundings.<br/><br/>Everything that could be taken away was put away.<br/><br/>Soon, the entire fifth floor was empty.<br/><br/>Wang Xian watched from the side with a smile on his face.<br/><br/>“Alright, we have moved all the things. Keep all the gains for yourselves.”<br/><br/>Ten minutes later, senior martial brother Junzi said to the disciples of the Willow deity Daoist sect.<br/><br/>“Alright, Senior Martial Brother Junzi!”<br/><br/>Everyone nodded and slowly gathered over with a trace of a smile on their faces.<br/><br/>However, senior martial brother Lu and the others did not look too good.<br/><br/>The death of a peak divine emperor powerhouse was too painful.<br/><br/>“Let’s prepare to go back. We will celebrate after we leave.”<br/><br/>Senior Brother Junzi swept his gaze across everyone and said.<br/><br/>“Haha, Alright. Let’s have a good celebration after we leave this time.”<br/><br/>The group of Divine Willow Daoist sect disciples laughed out loud.<br/><br/>“I have reaped quite a good harvest this time. It’s all thanks to all of you. Each of you will be given two battle angels of the same level.”<br/><br/>“Of course, senior brother Junzi is still an exception.”<br/><br/>Wang Xian stood at the side and said with a smile. With a wave of his arm, more than 100 battle angels appeared in front of them.<br/><br/>Taking out another 100 or so battle angels for them was not much for Wang Xian.<br/><br/>After all, he had more than 10,000 in his hands.<br/><br/>“Thank you, brother Wang Xian!”<br/><br/>“Thank you, junior brother Wang Xian!”<br/><br/>“That’s great! Haha, brother Wang Xian is so generous!”<br/><br/>The disciples of the Willow deity Daoist sect cheered excitedly.<br/><br/>“Senior Brother Junzi, which disciple obtained the crescent moon key in Your Hand?”<br/><br/>Wang Xian smiled and asked Senior Brother Junzi.<br/><br/>“Brother Wang Xian, I obtained it by accident.”<br/><br/>A lady walked out and said.<br/><br/>“We have obtained the treasures of the Crescent Moon Mystic Realm. However, there are still very valuable items in the crescent moon mystic realm. It’s this mystic realm and the Cosmos God nation. I want to make a deal with you guys.”<br/><br/>Wang Xian looked at the lady and two fruits appeared in his hands.<br/><br/>He waved his arm and landed in front of senior brother Junzi and the female disciple.<br/><br/>The fruits gave off a mysterious luster. Smelling the fragrance of the fruits, they could feel that their minds were much clearer.<br/><br/>“These two fruits at the supremacy level can increase your aptitude. It shouldn’t be a problem for you to break through to the Universe Knight realm in the future.”<br/><br/>As he spoke, he waved his arm and the five elements millstone appeared above them, enveloping the three of them in a separate space.<br/><br/>Two mysterious gray fruits appeared in his hand again.<br/><br/>This fruit was emitting an even more mystical luster.<br/><br/>Senior Brother Junzi and the female disciple looked around in astonishment. The other two fruits landed in Wang Xian’s hand.<br/><br/>“These are fruits above the level of a venerable. After consuming them, they can revive you once. Even if your soul is scattered and your physical body is destroyed, they can still revive you.”<br/><br/>“In addition, I’ll give you some vitality fluid. It can instantly heal your injuries. Even if it’s an irreversible injury, it can be healed.”<br/><br/>As Wang Xian spoke, he placed the items in front of them and asked, “How about exchanging for the key to the Crescent Moon Key? Of course, you can also state your conditions.”<br/><br/>“This… this…”<br/><br/>Senior Junzi and the female disciple were stunned by Wang Xian’s series of items.<br/><br/>It was a supremacy-level fruit that could give them a high chance of breaking through to the supreme-being realm.<br/><br/>It was a fruit that could give them a chance of revival.<br/><br/>Some powerful healing treasures.<br/><br/>If these items were to be casually released, it would cause countless powerhouses to go crazy.<br/><br/>“Brother Wang Xian, of course we have no problem with it. The item that you took out is too precious.”<br/><br/>The female disciple said in a slightly shocked manner. Her body trembled slightly and she couldn’t believe it.<br/><br/>“If you agree, you can consume the fruit and see the effect.”<br/><br/>Wang Xian said with a smile.<br/><br/>“Alright! Thank you, junior brother Wang Xian. I shouldn’t have accepted such a precious treasure.”<br/><br/>Senior Brother Junzi clenched his arms tightly and stared at the fruit in front of him in excitement. He found it hard to control himself.<br/><br/>He placed the fruit into his mouth while trembling. Slowly, his eyes became clearer and clearer.<br/><br/>“I… I feel that my mind has become much clearer. Many of the problems on my face have been solved. I feel that I have touched the path of a venerable!”<br/><br/>After consuming the fruit, he roared with excitement a few minutes later.<br/><br/>“Boom!”<br/><br/>At the side, a powerful aura burst out from the female disciple’s body. She, who was only at level six of the celestial thearch level, had made a breakthrough.<br/><br/>She opened her eyes and felt her own strength. She was filled with shock.<br/><br/>“Consume another fruit!”<br/><br/>Wang Xian was not surprised to see this scene. He continued to say.<br/><br/>The female disciple had already reached the peak of level six of the celestial thearch level. After consuming the ordinary embryo fruit, she comprehended the laws and supernatural powers and made a breakthrough.<br/><br/>Senior Brother Junzi used his trembling hand to consume the soul-returning embryo fruit.<br/><br/>If it really had the effect of reviving the dead, it would be too heaven-defying.<br/><br/>After the two of them consumed it, they closed their eyes and slowly digested the information about the soul-returning embryo fruit.<br/><br/>“Phew!”<br/><br/>“Thank you, junior brother Wang Xian!”<br/><br/>“Thank you, brother Wang Xian!”<br/><br/>After more than ten seconds, the two of them bowed in excitement and gave a big bow.<br/><br/>This treasure was immeasurable to them.<br/><br/>Just the fruit that could allow one to break through to the venerable realm was enough to exchange for this crescent moon key.<br/><br/>“Junior brother Wang Xian, Here!”<br/><br/>Senior Brother Junzi handed the crescent moon key to Wang Xian respectfully.<br/><br/>“Alright, I’ll Take This!”<br/><br/>Wang Xian revealed a smile on his face. He waved his arm and dispelled the encirclement of the great mill of five elements.<br/><br/>“Senior Brother Junzi!”<br/><br/>“Junior Sister Wuhua!”<br/><br/>Outside, a group of disciples of the Willow deity Daoist sect shouted when they saw that they had made another breakthrough.<br/><br/>“Junior Sister Wuhua, you… you actually made a breakthrough!”<br/><br/>“Senior Brother Junzi, your face is glowing red. Could it be that what big brother Wang Xian said is true? Senior Brother Junzi, did you consume that fruit? Do you have the chance to break through to the supremacy realm?”<br/><br/>Very soon, the disciples of the Willow deity Daoist sect noticed the changes in senior brother Junzi and the rest. They asked with burning eyes.<br/><br/>Just now, Wang Xian did not hide the matter of the soul-returning embryo fruit. He only hid the soul-returning embryo fruit.<br/><br/>After all, the soul-returning embryo fruit was too powerful and heaven-defying.<br/><br/>“Hahaha, I have a feeling that within ten thousand years, I will definitely break through to the supreme-being realm!”<br/><br/>The Gentleman Senior Brother saw a group of fellow apprentices staring at him, laughed loudly, and said confidently and happily.\t\t\t\t\t\t</div>", "images": {}, "success": true}