{"id": 116, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15072133.html", "title": "Chapter 3107 - Chapter 3107: Treasure 3106", "volume": 2, "volume_title": "Volume 2", "body": "<h1>Chapter 3107 - Chapter 3107: Treasure 3106</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 3107: Treasure 3106<br/><br/>“Congratulations, junior brother Wang Xian!”<br/><br/>On the fourth level of the meniscus mystical realm, senior sister Lingxin and the rest went over to congratulate Wang Xian when they saw him putting away the meniscus and walking towards the surrounding books.<br/><br/>“I’m lucky. It’s all thanks to you guys this time. I wouldn’t have gained so much without your notice!”<br/><br/>Wang Xian walked to the front of some books and turned to senior sister Lingxin and the rest.<br/><br/>This time, it was indeed all thanks to the disciples of the Willow deity Daoist sect. Without them, he wouldn’t even be able to enter this place, let alone obtain so many rewards.<br/><br/>He was prepared to give them some resources later.<br/><br/>After all, Wang Xian had more than 10,000 battle angels in his hands.<br/><br/>“That’s because brother Wang is strong. If it weren’t for you, we wouldn’t be able to obtain such rewards!”<br/><br/>Some disciples of the Willow deity Daoist sect said with a smile.<br/><br/>Wang Xian smiled and looked at the books in front of him.<br/><br/>Milky Way’s records!<br/><br/>Information on the Milky Way’s skeleton race!<br/><br/>Information on the Milky Way’s turtle blazing winged beast!<br/><br/>…<br/><br/>His gaze swept across the books one by one. On the books, there were records of so-and-so’s records.<br/><br/>When he saw these books, he raised his eyebrows slightly. His eyes were sparkling.<br/><br/>“Junior brother Wang Xian, this is the information that the crescent moon stream had in the past. It contains detailed information on the various races in the Milky Way and the various land of the lost scriptures. The crescent moon stream that Venerable Crescent Moon founded back then was feared by many races and forces.”<br/><br/>Senior Sister Lingxin walked over and scanned the books around her as she spoke with a surprised expression.<br/><br/>These information were exceptionally precious.<br/><br/>Even though it had not been updated for millions of years, the value of this information was still extremely terrifying.<br/><br/>However, to a group of unspecialized people like them, the information was not too important.<br/><br/>“Everyone, don’t touch the information here for the time being. I’m useful. Let’s go to the fifth floor and take a look.”<br/><br/>Wang Xian said to the disciples of the Willow deity Daoist sect and looked at the entrance to the fifth floor.<br/><br/>“Alright, brother Wang!”<br/><br/>“Let’s go, let’s go to the fifth floor and see if there are any treasures. I reckon the fifth floor should be where venerable crescent moon lives!”<br/><br/>The disciples of the Willow deity Daoist sect immediately responded and followed closely behind.<br/><br/>“The fifth floor!”<br/><br/>At the side, senior brother Lu and the rest who were gathered in front of the old man’s corpse heard the conversation and their expressions changed.<br/><br/>“Put the corpse away. Let’s go take a look as well.”<br/><br/>As he spoke, he immediately flew toward the entrance of the fifth level.<br/><br/>Senior brother Jun Zi and the others exchanged glances and followed behind.<br/><br/>This time, senior brother Kong and senior brother Xu’s gains could be said to be pretty good.<br/><br/>Originally, senior brother Lu and the others’gains could be considered pretty good. However, an expert from their clan had recklessly entered the fourth level and died here.<br/><br/>The death of a powerhouse at the peak of the Celestial Emperor had caused them to suffer heavy losses.<br/><br/>This time, their harvest might not even be as great as their losses.<br/><br/>Senior Brother Junzi and the rest moved and immediately followed behind.<br/><br/>The group entered the fifth level and did not encounter any obstruction.<br/><br/>Just as some disciples had guessed, the fifth level was where Venerable Crescent Moon lived.<br/><br/>Wang Xian and the rest entered and scanned their surroundings.<br/><br/>The disciples of the Willow deity Daoist sect were also looking around with heated gazes.<br/><br/>They were in the shape of a crescent moon, so the space around the fifth floor was not very big.<br/><br/>His gaze landed on a training mat in the middle. He narrowed his eyes slightly and waved his arm.<br/><br/>Buzz<br/><br/>Wang Xian’s energy swept across the futon. It immediately emitted a powerful radiance with traces of pressure.<br/><br/>“This is… This is a universe knight level cultivation futon. It’s definitely a treasure!”<br/><br/>A hurried voice came from senior brother Lu and the rest behind him. Their eyes were burning as they stared at the futon. Their bodies were trembling slightly.<br/><br/>However, since Wang Xian had obtained the futon, they didn’t dare to snatch it.<br/><br/>“Let’s go and investigate!”<br/><br/>Senior brother Lu shouted in a low voice. More than ten subordinates behind him moved and immediately flew into the room.<br/><br/>Wang Xian swept his gaze across the room and said to the disciples of the Willow deity Daoist sect beside him, “All of you should go and search as well. Let’s see what treasures there are.”<br/><br/>According to his senses, the most precious thing in the room was the cultivation futon.<br/><br/>However, as a living room of a venerable, any item would be worth a lot of money.<br/><br/>“Thank you, brother Wang Xian. Haha, Brothers, I’ve robbed you. Everything here is a treasure!”<br/><br/>A disciple of the willow deity Daoist sect laughed out loud and immediately flew forward.<br/><br/>“D * mn, senior brother Liu, your speed is too fast. Leave Something for me!”<br/><br/>“Hahaha, I can consider giving you something that I don’t need.”<br/><br/>A group of disciples from the Willow deity Daoist sect rushed over and searched for all sorts of items.<br/><br/>They even kept the chairs and the like.<br/><br/>The chairs were placed outside and were extremely precious.<br/><br/>Senior Brother Junzi and the rest also started to move.<br/><br/>They would be interested in the items that Wang Xian did not care about.<br/><br/>Seeing the disciples of the Willow deity Daoist sect searching for all sorts of treasures, Wang Xian smiled and did not make a move.<br/><br/>The harvest this time was already terrifying enough.<br/><br/>“Next, it would be best if I could get my hands on the entire crescent moon universe God country and let ao crab and the others devour it. At the very least, it would allow him to advance to the level of a level two universe Knight.”<br/><br/>He muttered as he pondered in his heart.<br/><br/>“I found a medicine bottle, I found a medicine bottle!”<br/><br/>At this moment, an excited voice sounded.<br/><br/>“Huh?”<br/><br/>Wang Xian was also surprised.<br/><br/>The medicinal pills in the medicine bottle of venerable crescent moon were definitely valuable.<br/><br/>“Whoosh! Whoosh! Whoosh!”<br/><br/>“Is there really a medicine bottle? Are there medicinal pills in it?”<br/><br/>One by one, figures flew over immediately. Their eyes were filled with fervor.<br/><br/>Wang Xian also walked over and looked over.<br/><br/>“Yes, yes. Senior Brother Junzi, look. There are more than ten pills inside. What a rich aura.”<br/><br/>The middle-aged disciple who received the bottle opened it. His face was flushed as he spoke and handed it to senior brother Junzi.<br/><br/>“Universe Knight level pills should be at the first level of the venerable realm. There are some for cultivation and some for healing injuries.”<br/><br/>Senior Brother Junzi looked over and his eyes were filled with fervor.<br/><br/>These pills were worth a lot of money.<br/><br/>“Universe Knight level pills? This… This is too powerful. However, I’m only at the seventh level of the divine emperor level, so I can’t use them.”<br/><br/>The middle-aged disciple smacked his tongue and said excitedly.<br/><br/>“Senior Junzi, can you use them?”<br/><br/>Wang Xian approached and looked at senior Junzi at the side as he asked.<br/><br/>“I can’t use them. I’m still a distance away from the universe knight level.”<br/><br/>Senior gentleman shook his head. “Junior brother Wang Xian, can you use it?”<br/><br/>“Give it to me. In a while, you can exchange it with me for equivalent treasures, Battle Angel Weapons, and some other treasures that you can use.”<br/><br/>Wang Xian said to the middle-aged disciple.<br/><br/>“Alright, brother Wang Xian!”<br/><br/>The middle-aged disciple nodded his head happily.<br/><br/>He was not worried that Wang Xian would cheat him. In this five-story space, Wang Xian said that he wanted everything, and the others were not qualified to fight with him for it.<br/><br/>It was better to be able to exchange for some treasures. The battle angels could do the same.\t\t\t\t\t\t</div>", "images": {}, "success": true}