{"id": 121, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15072143.html", "title": "Chapter 3112 - Chapter 3112: 3111 Universe Knights", "volume": 2, "volume_title": "Volume 2", "body": "<h1>Chapter 3112 - Chapter 3112: 3111 Universe Knights</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 3112: 3111 universe knights<br/><br/>“Boom!”<br/><br/>Wang Xian waved his dragon claw and it landed on the body of the dragon-faced knight.<br/><br/>With such a terrifying speed, he didn’t even have time to react.<br/><br/>“PFFT!”<br/><br/>The powerful force tore off the entire arm of the dragon-faced knight.<br/><br/>“You’re courting death!”<br/><br/>A sharp pain was felt. The expression of the dragon-faced knight changed drastically and waves of powerful lightning energy surged out from his body.<br/><br/>At the same time, a pair of wings also appeared behind him. It was a pair of wings covered with lightning.<br/><br/>His body moved, and he retreated instantly.<br/><br/>“You still want to kill me with this strength?”<br/><br/>Wang Xian didn’t continue to chase after him. He grabbed an arm with his dragon claw and stared at the venerable dragon-faced man behind him. His eyes were filled with mockery.<br/><br/>“Hiss, this… this… junior brother Wang Xian actually injured a venerable in an instant!”<br/><br/>“Junior brother Wang Xian is definitely not a powerhouse at the peak of the Celestial Emperor Realm. He is also a venerable, and so is he!”<br/><br/>Senior Brother Kong and the rest widened their eyes when they saw this scene. They roared in astonishment.<br/><br/>“What!”<br/><br/>“Brother Wang Xian is also a universe knight?”<br/><br/>“It’s really possible. It’s really possible. You must know that brother Wang Xian can suppress a peak-stage divine Emperor Battle Angel in the Crescent Mystic Realm.”<br/><br/>When the disciples of the Willow deity Daoist sect heard senior brother Jun Zi and the rest’s exclamations, they widened their eyes and roared.<br/><br/>When they saw Wang Xian holding the arm of the dragon-faced venerable in his hand, they were both shocked and excited.<br/><br/>They did not expect that Wang Xian was already a venerable.<br/><br/>In their hearts, Universe Knights were all high and mighty existences. During this period of time, they were actually so close to a venerable and were chatting and laughing like this.<br/><br/>“How is this possible? Isn’t he…”<br/><br/>When senior brother Lu and the rest saw this scene, their expressions changed drastically.<br/><br/>That Wang Xian actually injured the dragon-faced venerable in an instant. This…<br/><br/>“You are also a universe knight. I really didn’t expect this. I really didn’t expect this from our Dragon Race!”<br/><br/>At this moment, the dragon-faced venerable looked extremely embarrassed.<br/><br/>The dragon-faced venerable didn’t expect the other party to have reached such a level.<br/><br/>Looking at his arm that had been grabbed off, he moved his shoulder and a new arm immediately grew out.<br/><br/>“Did you expect that you would die here today?”<br/><br/>Wang Xian showed a look of disdain.<br/><br/>Crash<br/><br/>In the next moment, he disappeared instantly and reappeared in front of the venerable dragon-faced man. His huge dragon claws clawed at him once again.<br/><br/>“What a fast speed!”<br/><br/>When the venerable dragon-faced man saw this terrifying speed, his pupils contracted slightly.<br/><br/>Crack! Crack<br/><br/>The wings on his back emitted a terrifying lightning glow, causing him to dodge Wang Xian’s attack instantly.<br/><br/>“Huh?”<br/><br/>Wang Xian sensed his speed and raised his eyebrows slightly. He looked towards the position of the wings on his back.<br/><br/>From above, he could sense the aura of the six lightning feathers. This caused him to squint his eyes slightly.<br/><br/>“Do you think you are very fast? My speed is not weak either.”<br/><br/>The venerable dragon-faced man, who was at a disadvantage the moment they met, revealed an angry expression. He shouted coldly and waved his arm. A lightning beast bone appeared in his hand.<br/><br/>At the same time, a lightning-covered desolate beast skull appeared in the sky behind the venerable dragon-faced man’s head.<br/><br/>The desolate beast skull looked as though it was alive. Lightning flashed and it even carried a hint of dragon’s might.<br/><br/>“This is? A quasi-dragon skull!”<br/><br/>Wang Xian narrowed his eyes slightly when he saw the skull that carried a hint of dragon’s might.<br/><br/>“Five Elements Dragon Claw!”<br/><br/>He waved his dragon claw and the Dragon Claw that covered a radius of millions of kilometers went straight for him.<br/><br/>“HMPH, even if you are a venerable, I, the venerable dragon-faced man, Will Destroy You Today!”<br/><br/>A fierce look appeared in the eyes of the venerable dragon-faced man. The Lightning Beast Bone in his hand went straight for the Five Elements Dragon Claw.<br/><br/>The lightning condensed into the shape of a terrifying desolate beast and tore at the Dragon Claw.<br/><br/>Hong! Hong! Hong! Hong<br/><br/>A terrifying collision sounded, and the entire space shook, and a large number of cracks appeared.<br/><br/>“Oh no!”<br/><br/>“Not good, we’re too close, and we’ll be affected!”<br/><br/>Below, Senior Junzi and the others saw this scene, and their expressions changed drastically, and they hurriedly shouted.<br/><br/>The entire space was covered by lightning, and this space wasn’t very big.<br/><br/>They had nowhere to hide from the aftershocks of the battle between Universe Knights.<br/><br/>Buzz<br/><br/>Wang Xian also sensed the situation of senior brother Junzi and the rest below. With a wave of his arm, dragon scales emitting eight rays of light flew towards the ground below.<br/><br/>The dragon scales protected the entire ship.<br/><br/>“It seems like it hasn’t been a day or two since you became a universe knight. This time, in order to prevent any accidents, the clan leader asked me to bring something. Initially, I thought I wouldn’t need it at all. Now, it seems like you’re out of luck.”<br/><br/>“Hahaha, I, dragon-faced knight, have never killed a universe knight before. Today, you’re the first!”<br/><br/>Dragon-faced knight looked at his attack and the Dragon Claw that had completely collapsed. His gaze focused, and he roared coldly.<br/><br/>He waved his arm, and as if tearing through space, he directly tore out a creature covered in lightning.<br/><br/>A creature that only had bones, no flesh, and was covered in lightning.<br/><br/>The creature was blood-red in color and contained the might of a dragon.<br/><br/>“Thunder Dragon Bone, kill him!”<br/><br/>The Venerable Dragon Face roared ferociously.<br/><br/>Crack! Crack! Crack<br/><br/>The Thunder Dragon Bone flew out. A pair of thunder-like eyes stared at Wang Xian and let out a bone-colliding roar.<br/><br/>It opened its mouth and bolts of lightning shot toward Wang Xian.<br/><br/>“Thunder Dragon Bone?”<br/><br/>Wang Xian’s eyes narrowed when he saw the Thunder Dragon Bone that had the power of a universe knight.<br/><br/>This Thunder Dragon Bone was obviously made from the dragon bone of a lesser dragon. There was also a large amount of the blood of lesser dragons on the dragon bone.<br/><br/>Its destructive power was far beyond that of an ordinary universe knight!<br/><br/>“It seems that your so-called dragon race is extracting the blood of lesser dragons. The lesser dragon bone is used to enhance themselves and create war objects!”<br/><br/>Killing intent surged in Wang Xian’s heart as he growled in a low voice.<br/><br/>Many members of the fairy dragon race were hunted down by the dragon-descendant race.<br/><br/>The fresh blood on the Thunder Dragon Bones belonged to the fairy dragon race.<br/><br/>As he spoke, his body moved and immediately avoided the attack range of the Thunder Dragon Bones.<br/><br/>“Oh no, that dragon-faced venerable actually summoned a thunder dragon bone that is comparable to a universe knight!”<br/><br/>“Junior brother Wang Xian is in danger. The dragon-faced venerable is a powerhouse that has been famous in our Milky Way for tens of millions of years. It is said that he has already reached the pinnacle of universe Knight Level One. Now that he has a thunder dragon bone that is comparable to a universe knight, junior brother Wang Xian might not be a match for him.”<br/><br/>The expressions of senior brother Junzi and the rest who were below changed drastically when they saw the appearance of the Thunder Dragon Bone.<br/><br/>“What… What should we do… What should we do?”<br/><br/>Some of the female disciples said in panic.<br/><br/>However, a battle between Universe Knights was not something they could interfere with.<br/><br/>They could only watch anxiously from below.<br/><br/>“Good, good, good. Even if that Wang Xian is a universe knight, he should have just broken through. At the beginning, the dragon-faced knight was only injured due to carelessness.”<br/><br/>“Now, the dragon-faced Knight has brought along a thunder dragon bone of the knight level. That Wang Xian is done for. He will definitely die!”<br/><br/>Senior brother Lu and the rest saw this scene and clenched their fists as they roared in their hearts.<br/><br/>He must die! That Wang Xian must die!\t\t\t\t\t\t</div>", "images": {}, "success": true}