{"id": 120, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15072141.html", "title": "Chapter 3111 - Chapter 3111: 3110 Universe Knight Annihilation", "volume": 2, "volume_title": "Volume 2", "body": "<h1>Chapter 3111 - Chapter 3111: 3110 Universe Knight Annihilation</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 3111: 3110 universe Knight Annihilation<br/><br/>Time passed day by day.<br/><br/>The disciples of the willow deity Daoist sect were chatting and joking on the ship.<br/><br/>Wang Xian, who was in the room, was also refining the crescent moon illumination.<br/><br/>On the third day, he smiled as he looked at the acquired Numinous Treasure that had entered his body.<br/><br/>“Success.”<br/><br/>He moved his palm and the crescent moon illumination appeared. He walked out in a good mood.<br/><br/>“Dragon King, do you want to eat something? It’s delicious food cooked by senior sister lingxin.”<br/><br/>When Mi Xinlu saw Wang Xian holding a plate, he immediately walked over and said with a smile.<br/><br/>“Alright!”<br/><br/>Wang Xian nodded and took some with a smile.<br/><br/>“Junior brother Wang Xian, are you going to stay there for a period of time after returning to the Willow deity Daoist sect?”<br/><br/>Senior Sister Lingxin walked over and asked with a smile on her face.<br/><br/>“No, I’ll leave after settling some matters.”<br/><br/>Wang Xian shook his head. His current strength was already at the venerable stage.<br/><br/>Furthermore, the Dragon Palace would be entering the Milky Way soon.<br/><br/>He was heading to the Willow deity Daoist sect this time to meet venerable willow.<br/><br/>Venerable Willow Deity had indirectly helped him out. He was prepared to express his gratitude and leave the willow deity Daoist sect completely.<br/><br/>With his strength and status, he could no longer stay in the willow deity Daoist sect.<br/><br/>Furthermore, there was no need for him to stay in the willow deity Daoist sect anymore.<br/><br/>“Junior brother Wang Xian, you are really a busy person.”<br/><br/>Senior Sister Lingxin said with a smile. Then, she swept her gaze around and shouted softly, “Come, come, come. Senior sister, I personally cooked delicious food. If you want to eat, come here quickly!”<br/><br/>“Alright, senior sister. Haha, Senior Sister’s culinary skills are first-class in the Milky Way!”<br/><br/>“It’s not just first-class in the Milky Way, it’s simply first-class in the Universe!”<br/><br/>Before they arrived, flattering voices were heard.<br/><br/>Soon, forty to fifty young, middle-aged, and even old men walked over with a smile.<br/><br/>Senior Brother Junzi also walked behind them with a smile.<br/><br/>“It’s all on the table. One serving for each of you. Don’t eat too much.”<br/><br/>Senior Sister Lingxin shouted happily when she heard their compliments.<br/><br/>“Good, good!”<br/><br/>The group of disciples of the Willow deity Daoist sect said with a chuckle.<br/><br/>“Buzz!”<br/><br/>“HM?”<br/><br/>At this moment, the surrounding space suddenly underwent a terrifying transformation.<br/><br/>A situation that looked like the end of the world appeared. The space around the ship suddenly darkened.<br/><br/>“Crackle, Crackle!”<br/><br/>Bolts of lightning suddenly appeared out of thin air. The entire space was covered by lightning.<br/><br/>A great terror descended.<br/><br/>“What is this?”<br/><br/>Everyone’s pupils constricted slightly, and a shocked expression appeared on their faces.<br/><br/>Senior Brother Junzi and the others’hearts tightened, and they instantly appeared on the deck of the ship.<br/><br/>This terrifying power made his heart palpitate.<br/><br/>“Hehe, it’s coming!”<br/><br/>At the back, senior brother Lu saw the surrounding space change, and a trace of a smile appeared on his face.<br/><br/>After completing the transaction with the dragon race, they would be able to obtain a lot of resources.<br/><br/>“What’s going on?”<br/><br/>Wang Xian sensed the changes in the surroundings and focused his gaze. His figure appeared in front of the deck.<br/><br/>“Who is that?”<br/><br/>At this moment, the disciples of the Willow deity Daoist sect flew over. When they raised their heads and saw a figure floating in the sky, their faces revealed a shocked expression.<br/><br/>“Crackle crackle!”<br/><br/>At this moment, a bolt of lightning flashed and reflected the face of the figure in the sky.<br/><br/>The entire face had the picture of a divine dragon, and it looked ferocious and terrifying.<br/><br/>A pair of cold eyes stared at the position below, filled with coldness.<br/><br/>“This senior, may I ask what is the matter?”<br/><br/>Senior Junzi, Senior Kong, senior Xu, and the others looked at the figure in the sky, and their expressions changed slightly as they asked with a solemn expression.<br/><br/>“Is that a universe knight?”<br/><br/>“It’s a universe Knight!”<br/><br/>The expressions of all the disciples of the Willow deity Daoist sect changed drastically. Their faces were filled with reverence.<br/><br/>“I am a member of the Dragon Race. Wang Xian of the willow deity Daoist sect, are you going to commit suicide, or am I going to kill you?”<br/><br/>“Crackle crackle!”<br/><br/>As the figure spoke, terrifying Thunderbolts shot out from his body.<br/><br/>The thunderbolts lit up the entire space.<br/><br/>“The venerable dragon-faced dragon of the dragon-descendant race?”<br/><br/>“Not good!”<br/><br/>When the disciples of the Willow deity Daoist sect heard the words of the figure in the sky, their hearts tightened. They immediately looked at Wang Xian.<br/><br/>Everyone knew that the dragon-descendant race wanted Wang Xian.<br/><br/>However, even though he was wanted, it was simply too difficult to capture a powerhouse in the Milky Way.<br/><br/>Now, he actually found this place.<br/><br/>This time, he was in trouble!<br/><br/>Wang Xian stared at the venerable of the Dragon Race in the sky and swept his gaze across this space.<br/><br/>“There’s no need to look. You Won’t be able to escape. Even with venerable willow deity’s fallen leaves, it’s useless.”<br/><br/>The Venerable of the Dragon Race looked at Wang Xian and said coldly.<br/><br/>“I’m a little curious. I can conceal my aura. Even a universe knight-level wizard wouldn’t be able to lock onto me.”<br/><br/>“This space is obviously pre-arranged. How did you know I Was Here?”<br/><br/>Wang Xian looked at the dragon-faced venerable in the sky and asked faintly.<br/><br/>At the same time, he had some doubts in his heart. Did someone inform the dragon-born race or did the dragon-born race really have a very powerful investigative ability.<br/><br/>“Hehe, a dead person doesn’t need to know so much.”<br/><br/>The venerable dragon-faced man said indifferently. He waved his arm and a lightning whip appeared in his hand.<br/><br/>The lightning whip attacked Wang Xian directly.<br/><br/>“Oh no!”<br/><br/>“Junior brother Wang Xian, Dodge!”<br/><br/>Seeing a venerable attacking Wang Xian, the expressions of the disciples of the Willow deity Daoist sect changed drastically.<br/><br/>“This guy is dead for sure. The venerable dragon-faced man attacked personally and even set up an inescapable net around him. He still wants to escape?”<br/><br/>Behind him, senior brother Lu and the rest were looking at him coldly. Their eyes were filled with mockery.<br/><br/>“You Dragons don’t have the ability to kill me!”<br/><br/>Wang Xian looked at the lightning that was attacking him. He narrowed his eyes slightly and his palm turned into a dragon claw. He grabbed at the Lightning whip directly.<br/><br/>Crackle! Crackle<br/><br/>The Lightning Whip was grabbed in his hand and produced a thunderous sound.<br/><br/>“Oh?”<br/><br/>The venerable dragon-faced was slightly stunned when he saw that his attack was blocked.<br/><br/>His casual attack was something that even a peak divine emperor could not block.<br/><br/>“To be able to instantly kill a peak divine emperor expert and wipe out the ice mountain race, it seems that you have some ability. However, you will still die today!”<br/><br/>“Because you have offended our dragon race!”<br/><br/>A serious look appeared in the eyes of the venerable dragon-faced man as he moved his palm slightly.<br/><br/>“Thunderbolt!”<br/><br/>Bolts of lightning followed the lightning whip and charged directly at Wang Xian.<br/><br/>The lightning was like a terrifying desolate beast as it devoured Wang Xian.<br/><br/>“Haha, If You Want Me to die, I want to see who will die today!”<br/><br/>Wang Xian laughed out loud as he flung the lightning whip in his hand.<br/><br/>“Crash!”<br/><br/>The inoriginator holy wings appeared behind him and his figure disappeared instantly.<br/><br/>In the next moment, he appeared at the side of the venerable dragon-masked figure and clawed at him with his dragon claws.<br/><br/>“What!”<br/><br/>“What a fast speed!”<br/><br/>The moment Wang Xian suddenly appeared at his side, the venerable dragon-masked figure felt a jolt in his heart and a hint of shock appeared on his face.\t\t\t\t\t\t</div>", "images": {}, "success": true}