{"id": 125, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15072151.html", "title": "Chapter 3116 - Chapter 3116: 3115 Venerable Willow Deity", "volume": 2, "volume_title": "Volume 2", "body": "<h1>Chapter 3116 - Chapter 3116: 3115 Venerable Willow Deity</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 3116: 3115 venerable willow deity<br/><br/>“No!”<br/><br/>A wave of destructive energy swept across gently, causing senior brother Lu and the rest of his clansmen to cry out in despair.<br/><br/>Wang Xian looked at them expressionlessly. With a wave of his arm, he collected all the corpses.<br/><br/>Upon seeing this scene, all the disciples of the Willow deity Daoist sect were slightly silent. They shook their heads and sighed in their hearts.<br/><br/>“Venerable Dragon King, it’s our fault that such a thing happened.”<br/><br/>Senior Brother Junzi said apologetically to Wang Xian.<br/><br/>“It’s alright. This has nothing to do with you guys. There’s no need to be so restrained.”<br/><br/>Wang Xian shook his head and said with a smile.<br/><br/>When they saw his smile, the disciples of the willow deity sect also heaved a sigh of relief.<br/><br/>“Venerable Dragon King, are you still going to the Willow Deity sect with us?”<br/><br/>Senior Sister Lingxin hesitated for a moment before asking Wang Xian.<br/><br/>“I’m going there to visit Venerable Willow and say goodbye.”<br/><br/>Wang Xian said with a smile.<br/><br/>“Venerable Willow is a very good venerable. She must be very happy to know that you have become a venerable.”<br/><br/>Senior Brother Kong said from the side.<br/><br/>“Yes.”<br/><br/>Wang Xian nodded and looked at the map on the AI. “Let’s speed up and go there.”<br/><br/>As he spoke, he waved his arm and the five elements millstone flew towards the bottom of the ship. He brought the ship and flew towards the willow deity Daoist sect.<br/><br/>They had already traveled for more than half of the journey. In less than two hours, the willow deity Daoist sect appeared before Wang Xian and the rest.<br/><br/>Perhaps it was because Wang Xian had broken through to the venerable willow deity realm, or perhaps it was because Wang Xian had killed a universe knight. The disciples of the Willow deity Daoist sect were obviously in awe of him.<br/><br/>“We’re Here!”<br/><br/>Wang Xian looked at the willow deity Daoist sect in front of him and flew over. “I’ll fly over first.”<br/><br/>Whoosh<br/><br/>He was very fast. He flew directly to the sky above the willow deity Daoist sect and looked down at the entire Daoist sect.<br/><br/>“Disciple Wang Xian is here to pay his respects to venerable willow deity.”<br/><br/>Wang Xian spoke humbly and entered the entire willow deity Daoist sect.<br/><br/>“HMM?”<br/><br/>“Wang Xian!”<br/><br/>“It’s that junior brother Wang Xian? What is he doing?”<br/><br/>There were still a few thousand disciples in the Divine Willow Daoist sect.<br/><br/>When they saw Wang Xian flying directly to the sky to pay respects to venerable willow, their faces were filled with astonishment.<br/><br/>Venerable willow rarely saw his disciples. Many disciples had never seen venerable Willow’s real body.<br/><br/>“Congratulations on advancing to the Venerable Stage!”<br/><br/>Just as everyone in the Divine Willow Daoist rite temple was curious, a voice came from the Divine Willow Daoist rite temple.<br/><br/>Willow branches gathered and Venerable Willow God appeared in the sky. He looked at Wang Xian with a smile on his face.<br/><br/>“What? Wang Xian actually broke through to the venerable stage?”<br/><br/>“Hiss, this… how is this possible? He has only been in our Divine Willow Daoist rite temple for more than a year, and he actually broke through to the venerable stage.”<br/><br/>“Venerable, Wang Xian has actually become a venerable.”<br/><br/>In the Willow deity Daoist sect, all the disciples revealed shocked expressions when they heard venerable Willow’s words.<br/><br/>A venerable was the pursuit of all of them throughout their lives.<br/><br/>“Thank you for your care during this period of time. Please accept this token of appreciation.”<br/><br/>Wang Xian looked at venerable willow who looked like an old woman and revealed a smile on his face. He waved his arm and the ordinary fetus fruit instantly appeared in front of venerable willow.<br/><br/>The ordinary fetus fruit was a treasure at the level of a venerable. It was also of great use to the venerable willow deity.<br/><br/>“Eh?”<br/><br/>The venerable willow deity sensed the energy of the ordinary fetus fruit in front of him. His gaze focused slightly and a hint of surprise flashed across his eyes.<br/><br/>“I’ll take this then.”<br/><br/>“Come to the Divine Willow Daoist sect frequently in the future.”<br/><br/>The venerable willow deity didn’t refuse and said with a smile on his face.<br/><br/>“Alright. I will come back and take a seat when I have settled some matters.”<br/><br/>Wang Xian said with a smile on his face. He cupped his hands and said, “Venerable willow deity, I will take my leave first.”<br/><br/>After he finished speaking, his figure disappeared instantly.<br/><br/>Wang Xian didn’t want to talk much with venerable willow deity. Venerable Willow Deity was also considered neutral in the Milky Way.<br/><br/>Wang Xian was wanted by the dragon-descendant race, so it wasn’t good for her to get too close to him.<br/><br/>“Junzi, come over.”<br/><br/>Venerable willow deity saw Wang Xian leaving and looked at senior brother Junzi and the rest.<br/><br/>“It’s venerable willow deity.”<br/><br/>Senior Brother Junzi and the rest moved and flew over immediately.<br/><br/>Venerable willow deity waved his arm and willow branches appeared below them, bringing them to a spot in the willow deity Daoist sect.<br/><br/>“Each of you will be given a fallen leaf to return to. Cultivate well in the future.”<br/><br/>Venerable willow deity did not say much to them. Instead, he gave them a piece of fallen leaf to return to.<br/><br/>This was a treasure that could save their lives.<br/><br/>“Thank you, Venerable Willow Deity. Thank you very much.”<br/><br/>Senior Brother Junzi and the rest thanked him immediately.<br/><br/>…<br/><br/>“We have gained a lot this time.”<br/><br/>At the same time, in the Dragon Palace in the volcanic region, Wang Xian revealed an excited expression.<br/><br/>He had obtained more than 10,000 battle angels.<br/><br/>Among these 10,000, the weakest one was a level six divine emperor.<br/><br/>The strongest one was a supremacy.<br/><br/>If he were to sell them, the value would be unimaginable.<br/><br/>Other than the priceless battle angels, there were also more than 1,000 divine artifacts.<br/><br/>The lowest level of the divine artifacts was level six divine emperor.<br/><br/>“If all these treasures are sold, the Dragon Palace will receive a huge upgrade.”<br/><br/>Wang Xian mumbled to himself. If he were to use them to upgrade all the members, he would be able to help the million members of the Dragon Palace to step into the divine emperor realm.<br/><br/>“If I were to sell the battle angels, the nine-sword race would probably know that I was the one who destroyed all of them.”<br/><br/>“There’s one more thing. The dragon-descendant race will also target them. If the two races attack at the same time, the current strength of the Dragon Palace will not be able to withstand them.”<br/><br/>Wang Xian muttered to himself as a contemplative look appeared on his face.<br/><br/>“Now, I should think of a way to get rid of these battle angels and exchange some of them for resources. When the time comes, the Dragon Palace will not be afraid even if the nine-sword race of the dragon race joins forces.”<br/><br/>A contemplative look appeared on his face.<br/><br/>Very soon, he came up with a plan.<br/><br/>He would use the Immortal Palace’s war pets.<br/><br/>The Immortal Palace’s war pets were now very famous in the entire Milky Way. Especially after they were sold as war pets at the peak of the divine emperor realm, they were completely awe-inspiring in the Milky Way.<br/><br/>He could spread the name of the Celestial Palace’s War Pets and hold an auction under the name of the Celestial Palace’s war pets.<br/><br/>In that case, the nine-sword race might be wary of the mysterious Celestial Palace’s war pets and would not cause trouble.<br/><br/>After that, as long as he sold all these resources, the strength of the Dragon Palace would increase tremendously.<br/><br/>“But first, I’ll raise the prestige of the Dragon Palace’s war pets by another realm.”<br/><br/>Wang Xian was making a plan in his mind. He asked Heaven’s formation for their location and flew out immediately.<br/><br/>Currently, Heaven’s formation was leading the members of the Dragon Palace to hunt dire beasts in the Milky Way to raise the strength of the Dragon Palace.<br/><br/>“Dragon King!”<br/><br/>Seeing Wang Xian flying over, heaven’s formation and the leaders shouted immediately.<br/><br/>“How is it?”<br/><br/>Wang Xian asked with a smile.<br/><br/>“The harvest is not bad.”<br/><br/>Tian Chen and the rest nodded. “The resources in the Milky Way are too abundant.”<br/><br/>“Tian Chen, follow me. Ao Qitian and the rest will handle this.”<br/><br/>Wang Xian instructed them.\t\t\t\t\t\t</div>", "images": {}, "success": true}