{"id": 124, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15072149.html", "title": "Chapter 3115 - Chapter 3115: 3114 Universe Knight Had Fallen", "volume": 2, "volume_title": "Volume 2", "body": "<h1>Chapter 3115 - Chapter 3115: 3114 Universe Knight Had Fallen</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 3115: 3114 universe Knight had fallen<br/><br/>“How could this be?”<br/><br/>Looking at the completely collapsed thunderclouds and the five elements grinding mill that was attacking him, the dragon-faced knight widened his eyes with a hint of despair on his face.<br/><br/>That Wang Xian’s speed was already very terrifying. Fortunately, he had the thunder wings and the support of the dragon bones on his body, so he could barely react.<br/><br/>With the addition of a battle angel, he could only think of ways to escape.<br/><br/>Now that he had another terrifying treasure, he felt depressed and even despair.<br/><br/>The five elements were sharpened and numerous frost divine swords attacked him.<br/><br/>Looking at this terrifying attack, he quickly gave up on breaking the chains in front of him and retreated backward.<br/><br/>“Peng!”<br/><br/>However, at this moment, Wang Xian’s dragon claws appeared behind him and clawed viciously at the wings on his back.<br/><br/>“No!”<br/><br/>Sensing the terrifying power behind him, his head flew out and he abandoned the pair of thunder wings.<br/><br/>“Peng!”<br/><br/>The wings that he abandoned were crushed by Wang Xian. Six crystal clear thunder-attributed holy feathers appeared in his hand, making him delighted.<br/><br/>“Slash!”<br/><br/>The Battle Angel’s voice rang out and enveloped the venerable dragon-faced.<br/><br/>The venerable dragon-faced saw the continuous attacks and his expression changed slightly. He quickly dodged to the side.<br/><br/>However, he had lost his body. His speed was greatly reduced and he was directly hit by the Sword of light.<br/><br/>He spat out blood and flew backward.<br/><br/>At this moment, he sensed that Wang Xian was moving. He sensed that terrifying treasure was coming towards him.<br/><br/>Despair appeared on his face.<br/><br/>“PFFT!”<br/><br/>One of the dragon claws penetrated his body while the other held his head. Destructive energy was injected into his body.<br/><br/>The venerable dragon-faced man trembled. His eyes were filled with despair.<br/><br/>It’s over!<br/><br/>He had completely fallen here.<br/><br/>He would never have thought that as a hunter, he would be killed instead.<br/><br/>“We… We, the dragon-born race, will not let you off.”<br/><br/>He raised his head and stared at Wang Xian with his eyes filled with hatred as he growled softly.<br/><br/>“Don’t worry. Soon, I will send the entire dragon race to accompany you.”<br/><br/>Wang Xian’s faint voice entered his ears.<br/><br/>“PFFT!”<br/><br/>A terrifying force entered his body. The dragon-faced Knight’s head tilted and he lost his life completely.<br/><br/>“Rumble!”<br/><br/>A thunderous roar sounded out of thin air. It was as though it was announcing the death of a universe knight.<br/><br/>“This dragon-faced knight is a little difficult to deal with. His speed is only slightly slower than mine. He is quite strong.”<br/><br/>Wang Xian looked at the corpse in front of him and muttered.<br/><br/>The venerable who had just broken through from the remnant race of the Mohan clan was instantly killed by him.<br/><br/>However, this dragon-faced venerable had caused him to expend quite a bit of strength.<br/><br/>Gulp<br/><br/>At this moment, all the disciples of the Willow deity Daoist sect below were looking at this scene in astonishment.<br/><br/>A Universe Knight had died!<br/><br/>They had witnessed the death of a universe knight with their own eyes.<br/><br/>This was a universe knight!<br/><br/>“Junior brother Wang Xian is so strong, so strong!”<br/><br/>Senior Sister Lingxin’s body trembled as she cried out involuntarily.<br/><br/>“This… We should call him supremacy Wang.”<br/><br/>Senior Brother Junzi said in a daze.<br/><br/>“We should call him supremacy, a universe Knight!”<br/><br/>Senior Brother Kong and the others nodded in a daze.<br/><br/>At this time, they didn’t dare to call him junior brother anymore!<br/><br/>He was a universe knight who stood high and mighty.<br/><br/>“Hehe, call him Dragon King Knight.”<br/><br/>At the side, Mi Xin Lu smiled and said.<br/><br/>“Dragon King Knight?”<br/><br/>The disciples of the Willow deity Daoist sect muttered.<br/><br/>He had killed the dragon-faced knight and suppressed the Thunder Dragon Bone of the dragon race, which was equivalent to one person suppressing two universe knights.<br/><br/>If news of such a result were to spread, the entire Milky Way would definitely tremble.<br/><br/>“How… How is this possible? How can this be?”<br/><br/>At the back, senior brother Lu and the others trembled and looked at the figure in the sky with fear.<br/><br/>The Knight of the Dragon Race had actually died.<br/><br/>Then…<br/><br/>“Let’s act normally and not be discovered. We must not be discovered.”<br/><br/>Senior brother Lu felt that his mouth was dry and his tongue was parched. He suppressed his terrified expression and transmitted his voice immediately.<br/><br/>Everyone nodded immediately. They naturally understood.<br/><br/>They were the ones who informed the Dragon tribe. If Wang Xian knew about this…<br/><br/>“Congratulations, Venerable Dragon King, for killing a strong enemy!”<br/><br/>At this moment, the disciples of the Willow deity Daoist sect who had regained their senses saw Wang Xian flying towards them. They quickly walked up to him in awe and bowed respectfully.<br/><br/>“Yes!”<br/><br/>Wang Xian swept his gaze across them and observed everyone’s expression. He nodded his head faintly.<br/><br/>“Venerable Dragon King, you…”<br/><br/>Senior Brother Junzi and the rest sensed that something was wrong with Wang Xian’s aura. Their expressions changed as they opened their mouths and asked.<br/><br/>“Someone tipped off the dragon tribe. Otherwise, with our Dragon King’s strength, they wouldn’t have been able to lock onto us. They wouldn’t have waited for an ambush here.”<br/><br/>Ao fenghuang spoke from the side and spoke faintly.<br/><br/>“What?”<br/><br/>When all the disciples of the Willow deity Daoist sect heard ao Fenghuang’s words, their expressions changed slightly.<br/><br/>At the back, senior brother Lu and the rest’s expressions changed drastically. A trace of panic flashed across their eyes.<br/><br/>“Someone must have informed the Dragon tribe. Although I wasn’t injured in this battle and killed the opponent’s venerable, I will not let go of the person who tipped them off.”<br/><br/>Wang Xian nodded his head faintly and swept his gaze across them. “So, let’s investigate.”<br/><br/>“I hate traitors the most. Venerable Dragon King, you should investigate on your own. Once you find out who was the informant, kill him immediately.”<br/><br/>Senior Sister Lingxin revealed an angry expression and said with a face full of killing intent.<br/><br/>“I can basically lock onto who it is.”<br/><br/>Wang Xian nodded his head slightly and waved his arm.<br/><br/>Buzz<br/><br/>A dragon claw flew out and clawed at senior brother Lu.<br/><br/>“Venerable Dragon King, it’s not me, it’s not me.”<br/><br/>Senior brother Lu’s face turned pale when he saw Wang Xian attacking him. He shouted with a face full of despair.<br/><br/>“We will know if it’s you after we investigate. If you are blamed, I will compensate you.”<br/><br/>As Wang Xian spoke, his eyes revealed a soul-stirring luster.<br/><br/>Soul capture.<br/><br/>Senior brother Lu was caught by Wang Xian without any resistance. He stood there in a daze without moving.<br/><br/>Behind him, senior brother Lu and more than ten people from the same race felt their hearts tighten. They looked at each other.<br/><br/>Buzz<br/><br/>The body of the elder at the peak of the celestial emperor trembled slightly. He wanted to escape immediately. However, his eyes widened very quickly. He realized in despair that he could not return to his divine kingdom at all.<br/><br/>“Oh?”<br/><br/>The elder’s actions immediately attracted the attention of senior brother Junzi and the rest. Anger slowly appeared in their eyes.<br/><br/>Senior Brother Kong, senior brother Xu, and the rest recalled what senior brother Lu had told them not long ago. They sighed in their hearts and shook their heads.<br/><br/>Wang Xian looked at the elder who wanted to escape and smiled faintly.<br/><br/>The Dragon Eye Lock had not been withdrawn yet. They could not return to their divine kingdom at all.<br/><br/>From the reactions of senior brother Lu and the rest, Wang Xian could basically confirm it.<br/><br/>After digesting some information in his mind, Wang Xian waved his palm gently.<br/><br/>Boom<br/><br/>A destructive force swept towards them.\t\t\t\t\t\t</div>", "images": {}, "success": true}