{"id": 122, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15072145.html", "title": "Chapter 3113 - Chapter 3113: 3112 Annihilating A Universe Knight", "volume": 2, "volume_title": "Volume 2", "body": "<h1>Chapter 3113 - Chapter 3113: 3112 Annihilating A Universe Knight</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 3113: 3112 annihilating a universe knight<br/><br/>“Hehe, I have to say, Wang Xian, you really surprised me. With the strength of a universe knight, no wonder you dared to kill a disciple of our dragon-descent race.”<br/><br/>“However, if you dare to kill our disciple, we will dare to kill you. Today, we will let you experience the strength and foundation of our dragon-descent race. The Thunder Dragon Bone, the combat strength of a peak level one universe knight, coupled with my original self, is enough to kill you.”<br/><br/>The dragon-faced Knight said coldly. He flapped his wings and attacked Wang Xian from both sides of the Thunder Dragon Bone.<br/><br/>The terrifying power of thunder and lightning filled the entire space.<br/><br/>The pre-arranged space could prevent Wang Xian from escaping. It could also increase the strength of the dragon-faced knight.<br/><br/>The disciples of the Willow deity Daoist sect watched in horror. Some of the female disciples were pale.<br/><br/>Two universe knights at the peak of Level One. Wang Xian…<br/><br/>“Interesting. I didn’t expect the dragon-descendant race to use such power to kill me.”<br/><br/>Wang Xian looked at the Thunder Dragon Bone and the dragon-faced knight with a cold smile on his face.<br/><br/>“I dared to kill the disciples of your dragon-descendant race back then. Now, I dare to kill you too.”<br/><br/>He shouted softly and waved his arm. The five elements grinding mill flew out and attacked the Thunder Dragon Bone.<br/><br/>Weng<br/><br/>Then he waved his arm again, and the Knight Level Battle Angel appeared beside him.<br/><br/>“Kill!”<br/><br/>He roared, and his palm turned into a dragon claw<br/><br/>Hong<br/><br/>The five elements grinding mill spun, and the five godly dragons on it swayed their bodies, and the frost godly swords slashed at the Thunder Dragon Bone.<br/><br/>“Holy Slash!”<br/><br/>The Knight Level Battle Angel raised the Holy Sword in his hand and swung it at the dragon-faced knight.<br/><br/>A dazzling sword of light was swung at him.<br/><br/>“What!”<br/><br/>“What is that thing!”<br/><br/>In an instant, the dragon-faced venerable saw a terrifying numinous treasure completely restraining the Thunder Dragon Bone. A creature that was emitting the power of light at the venerable level was slashing at him. His expression changed drastically.<br/><br/>What is this thing?<br/><br/>Whoosh<br/><br/>Wang Xian’s figure flashed and appeared beside the dragon-faced Venerable in an instant. He clawed at him with his dragon claws.<br/><br/>The expression of the dragon-faced venerable changed drastically. He flapped his wings and dodged the attacks of the battle angels while dodging Wang Xian’s attacks.<br/><br/>However, even though the dragon-faced venerable had six holy feathers of the Lightning attribute on his wings, his speed was still slower than Wang Xian’s.<br/><br/>The Dragon Claws grabbed onto the arm of the dragon-faced venerable once again.<br/><br/>Crack! Crack! Crack<br/><br/>This time, the dragon-faced venerable, who was already prepared, released a terrifying power of lightning from his arm.<br/><br/>The thunder energy exploded, causing only a trace of blood to flow out of his arm.<br/><br/>“You actually have a venerable level weapon too!”<br/><br/>Dodging Wang Xian’s attack, the dragon-faced venerable couldn’t help but Roar.<br/><br/>A venerable level weapon, this was a venerable level weapon.<br/><br/>Their entire dragon race had billions of years of heritage, yet they only had one universe Knight Level Thunder Dragon Bone.<br/><br/>Furthermore, that terrifying treasure was able to withstand the combat strength of a universe knight. Was this an acquired treasure?<br/><br/>How could he have so many treasures? How was this possible? !<br/><br/>“Hiss, that’s a battle angel of the Universe Knight level. It’s a battle Angel of the Universe Knight level. Junior brother Wang Xian actually obtained such a terrifying battle Angel.”<br/><br/>“Oh my goodness. This battle Angel should have been obtained by Big Brother Wang Xian in the fourth level of the meniscus mystical realm. At that time, that terrifying pressure was emitted by this battle Angel.”<br/><br/>“This… It’s also fortunate that big brother Wang Xian is with us this time. Otherwise, once we step into the fourth level, we would definitely be killed by this battle Angel.”<br/><br/>“Look, that’s big brother Wang Xian’s treasure. To be able to fight against that Thunder Dragon Bone alone, it’s simply too powerful. It’s hard to say who will kill who.”<br/><br/>Below, when the disciples of the Willow deity Daoist sect saw this scene, they opened their mouths slightly. Their faces were filled with shock.<br/><br/>Especially that battle Angel at the Universe Knight level.<br/><br/>Obviously, it was obtained from the Crescent Moon Mystic Realm.<br/><br/>Battle Angel, a powerful treasure. In an instant, Wang Xian once again had the upper hand.<br/><br/>“How is this possible?”<br/><br/>Behind him, senior brother Lu and the rest widened their eyes. Their eyes were filled with disbelief.<br/><br/>They were already shocked that Wang Xian was a universe knight. Now, he had displayed so many terrifying treasures.<br/><br/>This…<br/><br/>“Angel Cross!”<br/><br/>The Battle Angel’s cold voice rang out. An angel leaned against the cross and attacked the dragon-faced knight directly.<br/><br/>The battle Angel’s strength was not weaker than a Level 1 universe knight.<br/><br/>Even the dragon-faced knight had to take its terrifying attack seriously.<br/><br/>When he saw the angel cross that was heading towards him, his expression turned extremely ugly.<br/><br/>Once he took action to block it, Wang Xian, who was at the side, would attack at a terrifying speed.<br/><br/>That strange speed caught him off guard.<br/><br/>“Explode, Earth Star Thunderstorm!”<br/><br/>He let out a furious roar with an extremely ugly expression. A large-scale attack was sent towards the Angel Cross.<br/><br/>Terrifying Lightning balls were launched towards the surroundings. Wang Xian was also completely covered.<br/><br/>Rumble<br/><br/>“Eight luminaries Dragon Scale!”<br/><br/>Wang Xian looked at the terrifying lightning storm and his body trembled. His entire body was covered in dragon scales. Eight rays of light were flashing on his body. He flapped his wings and unleashed his speed to the maximum as he attacked the dragon-faced venerable.<br/><br/>At the same time, the Battle Angel also flapped its wings and flew towards the dragon-faced venerable.<br/><br/>“Damn it, I’m no match for them!”<br/><br/>When the dragon-faced venerable saw Wang Xian and the battle Angel charging towards him, his expression darkened. He knew that his attack this time would end in failure.<br/><br/>He looked at the powerful battle angel and the treasure and his expression was extremely ugly.<br/><br/>The Dragon Race had a powerful enemy.<br/><br/>“Scram!”<br/><br/>He waved his arm and a thunder hammer appeared in his hand. With a swing of the Thunder Hammer, the Thunder Hammers formed from lightning struck towards Wang Xian and the Battle Angel.<br/><br/>“Dragon Eye Lock!”<br/><br/>Wang Xian’s pupils emitted a terrifying power. Chains appeared out of thin air in the surrounding void, and the sky was filled with chains that surrounded the venerable dragon-faced man.<br/><br/>The Thunder Hammers formed from the Lightning laws collapsed immediately, and the chains continued to attack.<br/><br/>“Dazzling light!”<br/><br/>The Battle Angel flapped its wings, and beams of light shot toward the dragon-faced venerable.<br/><br/>“Damn it!”<br/><br/>Seeing that his attack was instantly destroyed, the dragon-faced Venerable’s eyes revealed shock and anger, and he hurriedly dodged to the back.<br/><br/>“Thunder Dragon Bone!”<br/><br/>He roared loudly, wanting to retrieve the Thunder Dragon Bone and immediately retreat.<br/><br/>“Slash of Blade!”<br/><br/>“Weng!”<br/><br/>The Lightning Dragon Bone received the order, but all of a sudden, a slash left a mark between the Lightning Dragon Bone and the dragon-faced venerable.<br/><br/>The Lightning Dragon Bone wanted to pass through, but cracks immediately appeared.<br/><br/>“What? What treasure is This!”<br/><br/>The dragon-faced venerable saw that the Lightning Dragon Bone was actually being suppressed, and his face was filled with shock as he roared sternly.<br/><br/>A treasure could actually suppress the Thunder Dragon Bone that they, the dragon-faced man, had spent a huge price to forge!<br/><br/>“Venerable dragon-faced man, don’t even think about escaping today. Chain, bind!”<br/><br/>Wang Xian saw that the venerable dragon-faced man was trying to escape and shouted coldly.<br/><br/>Crash<br/><br/>The chains in the surrounding void were like giant pythons, enveloping the entire space.\t\t\t\t\t\t</div>", "images": {}, "success": true}