{"id": 128, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15072157.html", "title": "Chapter 3119 - Chapter 3119: 3118 Shocked The Milky Way", "volume": 2, "volume_title": "Volume 2", "body": "<h1>Chapter 3119 - Chapter 3119: 3118 Shocked The Milky Way</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 3119: 3118 shocked the Milky Way<br/><br/>Half a month later, a terrifying creature with a majestic aura that was about 300 kilometers in length shuttled through the Milky Way.<br/><br/>A palace was built above this terrifying creature. The palace occupied an area of 100 kilometers in size.<br/><br/>A huge flag was fluttering in the air.<br/><br/>On the flag were the words “Dragon Palace War Pet”.<br/><br/>He shuttled through the Milky Way and looked awe-inspiring from afar.<br/><br/>“The sale of the war pet will proceed quickly. The main thing is the auction in a month’s time.”<br/><br/>At this moment, in the palace above this terrifying creature, Wang Xian spoke to the heaven array with a smile on his face.<br/><br/>It had been half a month since the last time the war pet of the Immortal Palace announced the sale of the war pet.<br/><br/>And today was the day of the sale of the war pet.<br/><br/>In order to enhance the mysterious and powerful aura of the Immortal Palace Battle Pets, Wang Xian and the rest sent Xiao Lan over.<br/><br/>Currently, Xiao Lan had the strength of a peak divine emperor. Her body size had reached a total of 300 kilometers.<br/><br/>She was an absolutely terrifying behemoth.<br/><br/>Xiao Lan was used to replace the ship.<br/><br/>“What is that thing? It’s so terrifying!”<br/><br/>“Hiss, it’s a space behemoth. That’s a space behemoth. What a terrifying aura.”<br/><br/>“Look at the flag above the space beast, that’s the aura of the Immortal Palace Battle Pet. Oh My God, This Immortal Palace battle pet is using the space beast to replace the ship, it’s too strong!”<br/><br/>“Which force do they belong to, it’s too mysterious and terrifying.”<br/><br/>Coming to the edge of the Milky Way, countless people felt a rush of barbaric aura.<br/><br/>When they saw little blue who was half submerged in the water, their faces were filled with shock.<br/><br/>In front of the silver gazing continent, there was a group of people gathered there.<br/><br/>They were clearly floating in space, each representing their own power.<br/><br/>Mist, three feet, nine blades, dragon descendant, Water Shadow, skeleton…<br/><br/>Over a dozen universe level races.<br/><br/>The rest were all domain level races, some weaker domain level races and races simply didn’t have the right to come here.<br/><br/>The group of experts looked at the space beast swimming over with shock in their eyes.<br/><br/>“This divine palace battle pet isn’t simple. It actually has such a terrifying space beast. It’s powerful!”<br/><br/>“I wonder which faction they came from. To be able to sell a peak-stage divine emperor battle pet like this, it’s definitely not an ordinary cosmos primary-level race.”<br/><br/>The Great Beings from the various factions looked ahead with a hint of shock in their eyes.<br/><br/>“Everyone, Welcome to the Immortal Palace Mount.”<br/><br/>The voice of the sky array transmitted into their minds from Little Blue’s body.<br/><br/>The Great Beings from the various factions felt a slight chill in their hearts.<br/><br/>“A universe Knight!”<br/><br/>Just from the voice, they could determine that this was a universe knight.<br/><br/>Especially since the other party didn’t hide his aura.<br/><br/>“Let’s Go!”<br/><br/>The group of warriors looked at each other and immediately flew towards the palace on Xiao Lan’s body.<br/><br/>“There are some pieces of paper in the sky. Take one each. Only those who are qualified can buy the battle pets.”<br/><br/>They had just flown to a square in front of the palace when the sound of the sky array sounded again.<br/><br/>Everyone was slightly stunned and couldn’t help but feel a little stunned.<br/><br/>This method was simply too child’s play.<br/><br/>However, the Immortal Palace Battle Pets had already set the rules, so they didn’t dare to say anything.<br/><br/>Each of them took out a note.<br/><br/>“Buzz!”<br/><br/>At this moment, the sky array walked out. He walked out in an extremely strange appearance.<br/><br/>Two heads and a set of nine-colored clothes draped over his body.<br/><br/>Seeing the appearance of the sky array, the experts from the various factions were slightly shocked.<br/><br/>Two-headed creatures were relatively rare in the universe.<br/><br/>They looked at each other and did not know what race the sky array belonged to.<br/><br/>“I have the qualifications to purchase a peak divine Emperor Battle Pet!”<br/><br/>“I have the qualifications to purchase a divine emperor rank eight battle pet.”<br/><br/>At this moment, excited voices sounded one after another.<br/><br/>“Those who have the qualifications can purchase it directly in a while. The reason why I called all of you here this time is that the selling of battle pets is only secondary. There’s still one more thing I want to announce.”<br/><br/>Tian Chen swept his gaze over the surroundings as he spoke indifferently.<br/><br/>“Oh?”<br/><br/>Upon hearing his words, everyone’s faces revealed a look of shock and bewilderment.<br/><br/>With six peak divine emperors as the attraction, gathering all the powers here just to announce one thing?<br/><br/>And looking at the battle pets of the immortal palace, it was obvious that they did not put the sale of six pinnacle god Emperors in their eyes.<br/><br/>What were they going to do?<br/><br/>The Great Beings of all the powers looked at the sky array in shock, waiting for the next step.<br/><br/>“In two months, our immortal palace battle pets will hold an auction. Currently, we are tentatively putting a universe knight level one battle pet for sale. As for the number of Pinnacle God emperors battle pets, we are tentatively putting it up for sale.”<br/><br/>“Other than that, our immortal palace battle pets will also accept cooperation. If there are any treasures that need to be auctioned, you can contact us.”<br/><br/>“Two months later, our Immortal Palace Battle Pets will hold an auction that will shake the Milky Way.”<br/><br/>Sky Array said calmly.<br/><br/>On the side, everyone was stunned. They opened their mouths slightly.<br/><br/>“A Knight Level Battle Pet?”<br/><br/>A universe beginner race warrior couldn’t help but exclaim, his face filled with shock and shock.<br/><br/>Their Water Mountain universe beginner race only had one knight.<br/><br/>Yet this immortal palace battle pet was selling a knight level battle pet.<br/><br/>This was too crazy!<br/><br/>A knight level existence was the pinnacle existence in the entire Milky Way.<br/><br/>Having a knight-level great being was enough to give birth to a universe primary race.<br/><br/>One could imagine how shocked they were when such an existence was put up for sale.<br/><br/>“This… this…”<br/><br/>Even for a relatively powerful universe primary race like the Misty Dragon race, their faces were still filled with shock.<br/><br/>No matter how strong their race was, the number of universe Knights was still in the single digits.<br/><br/>Even so, it was still the accumulation of billions of years.<br/><br/>However, the Immortal Palace Battle Pet sold the Knight Level Battle Pet directly.<br/><br/>They were so shocked that they couldn’t speak.<br/><br/>“As for the specific treasures to be sold, we will announce it on the Milky Way’s AI. When the time comes, everyone just have to pay attention.”<br/><br/>Tian Chen smiled as he said, his gaze sweeping over the shocked people around him, he was very satisfied.<br/><br/>“Those who have the right to buy, follow me to the back.”<br/><br/>He said and walked straight to the back.<br/><br/>A group of people with the right to buy immediately went over.<br/><br/>“What is the background of this Dragon Palace War pet, even a knight level war pet is sold, such a level war pet, only a knight level 3 existence can tame it, right?”<br/><br/>“Are they from a mid-level race in the universe? They are too strong.”<br/><br/>“Crazy, crazy, a knight level war pet bidding, I wonder how crazy it will be.”<br/><br/>“Not crazy, only a few powers can afford to buy a knight level war pet.”<br/><br/>“That’s hard to say, this is a knight level war pet, some of the weaker low-level races in the universe will probably go all out.”<br/><br/>Looking at the sky array leading the group into the back, the group’s faces were filled with shock as they discussed.<br/><br/>This news was simply too crazy.\t\t\t\t\t\t</div>", "images": {}, "success": true}