{"id": 134, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15072169.html", "title": "Chapter 3125 - Chapter 3125: Under The Huge Harvest Of 3124", "volume": 2, "volume_title": "Volume 2", "body": "<h1>Chapter 3125 - Chapter 3125: Under The Huge Harvest Of 3124</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 3125: Under the huge harvest of 3124<br/><br/>“Dragon King, all the resources of this auction have been taken away by an lie. We will go to other starry skies to exchange them for some medicinal pills and spiritual herbs.”<br/><br/>“Sky Array is also with him. I don’t know how much we have gained so far.”<br/><br/>“But I estimate that our dragon palace will be able to increase the number of universe knights by nearly 40 this time.”<br/><br/>Prime Minister Gui said with a smile.<br/><br/>Wang Xian nodded his head. His eyes sparkled as he asked, “How long has it been since the dark intense sky array left?”<br/><br/>This time, they had obtained a large number of divine stones. These divine stones were too bright and too big. It was almost enough to buy all the elixirs in the Milky Way.<br/><br/>In order to prevent any accidents, Prime Minister Gui ordered an lie and the sky array to head to a more prosperous starry sky and exchange their divine stones for elixirs.<br/><br/>“An lie came back not long ago. Based on the current progress, they should be back soon.”<br/><br/>Prime Minister GUI reported.<br/><br/>Wang Xian nodded.<br/><br/>“Dragon King!”<br/><br/>Coincidentally, Heaven’s formation and an lie arrived at the Dragon King’s Palace with smiles on their faces.<br/><br/>“All of them have been exchanged for resources?”<br/><br/>Wang Xian couldn’t help but stand up and asked them.<br/><br/>“Yes, Dragon King. We have already exchanged for a large amount of resources. Take a look.”<br/><br/>As Heaven’s formation spoke, he waved his arm and the jade bottles floated towards Wang Xian.<br/><br/>“This time, we went to the two nearby starry skies. They are more prosperous than the Milky Way. We exchanged all the divine stones for medicinal pills and spiritual herbs.”<br/><br/>An lie said with a smile from the side.<br/><br/>“Very good.”<br/><br/>Wang Xian nodded his head. His mind scanned the medicinal pills and treasures in the jade screen. His eyes were burning with excitement.<br/><br/>He didn’t know how much dragon Qi these medicinal pills could convert.<br/><br/>It was because these resources were too huge.<br/><br/>Especially the medicinal pills in a jade bottle. There were more than 20 universe knight level medicinal pills.<br/><br/>The Dragon Qi converted from these medicinal pills was even more majestic.<br/><br/>“Looks like I have raised my strength enough this time. After I raise my strength, the remaining resources should be able to allow the Dragon Palace to produce many paragons.”<br/><br/>He muttered as his gaze swept across the surroundings, “I will first absorb all the pills.”<br/><br/>“It’s the Dragon King!”<br/><br/>Prime Minister Gui and the rest nodded and retreated.<br/><br/>“Roar!”<br/><br/>Wang Xian let out a low groan and transformed into the body of a divine dragon. Large amounts of pills entered his stomach and turned into dragon qi.<br/><br/>The Dragon Qi in his body was growing at a terrifying speed.<br/><br/>“Ding, congratulations to host for increasing your level and breaking through to the sixth level of the void God Emperor.”<br/><br/>“Ding, congratulations to host for breaking through to the next level and comprehending the eight heavenly dragon tribes!”<br/><br/>Name: Wang Xian<br/><br/>Race: Yin-yang five Elemental Divine Dragon (man-dragon unity)<br/><br/>Level: void God Emperor Sixth Level (eighth form of the Divine Dragon Transformation)<br/><br/>Origin: 0.1% (99% needed to reach the next breakthrough)<br/><br/>Divine ability: ruling the water race (ruling the water race below one’s own level)<br/><br/>Devouring living beings (devouring living beings to extract origin)<br/><br/>Five elements control<br/><br/>Cultivation Method: Divine Dragon Transformation<br/><br/>Divine ability: soul-capturing, spirit-attaching<br/><br/>Law Divine Ability: Dragon Eye Lock, Five Elements Dragon Claw, Yin-yang realm-breaking, eight luminaries dragon scale, Sacred Dragon Shadow, eight heavenly dragons<br/><br/>Aspect: five elemental great mill, Dragon Kingdom in the palm, Dragon head under the heavens, Dragon body of ten thousand miles, yin-yang Poles, Yin-yang five elemental alms bowl, divine dragon tail swing!<br/><br/>Control Law: metal, wood, water, fire, Earth, light, dark wind<br/><br/>Divine Kingdom: Dragon Palace<br/><br/>Dragon Palace owned: Level 9.<br/><br/>Members of Dragon Palace: 1034450<br/><br/>A few minutes later, the system’s voice sounded. The level had increased. Wang Xian revealed an excited expression.<br/><br/>He didn’t stop. He continued to swallow the pills.<br/><br/>He had only swallowed one-fifth of the pills.<br/><br/>Time passed little by little. The dragon energy in his body was increasing at a crazy rate.<br/><br/>A day later, he opened his eyes and revealed a smile.<br/><br/>He checked his attributes and saw that he had accumulated a huge amount of dragon energy in his body.<br/><br/>However, all the resources added together were not enough to raise Wang Xian by two levels.<br/><br/>“The dragon energy in my body should be able to upgrade about 30 members of the Dragon Palace to the combat strength of a level one universe knight.”<br/><br/>Wang Xian’s eyes sparkled.<br/><br/>The resources he gained this time were too huge.<br/><br/>“Prime Minister Gui, tell all the members of the Dragon Palace to gather in the Dragon Field.”<br/><br/>Wang Xian shouted softly and transmitted his voice to Prime Minister Gui.<br/><br/>“It’s the Dragon King!”<br/><br/>Prime Minister Gui replied immediately and gave his orders.<br/><br/>Wang Xian moved and flew towards the location of the Dragon Field.<br/><br/>“Dragon King!”<br/><br/>Soon, all the members of the Dragon Palace who received the order gathered in front of them.<br/><br/>Over a million members of the Dragon Palace exuded a powerful aura.<br/><br/>“I will release a large amount of dragon energy later. Absorb it.”<br/><br/>“Prime Minister Gui, discuss with the leaders about the distribution of the Dragon Energy.”<br/><br/>Wang Xian glanced at all the members of the Dragon Palace and instructed.<br/><br/>“It’s the Dragon King!”<br/><br/>Prime Minister Gui and the leaders of the Dragon Palace responded immediately.<br/><br/>“Roar!”<br/><br/>Wang Xian raised his head and roared slightly. A large amount of dragon energy rose in the sky above the dragon field.<br/><br/>The majestic dragon energy condensed into the shape of divine dragons.<br/><br/>There were more than 30 divine dragons. After absorbing each ball of dragon energy, the Dragon Palace would be able to give birth to a universe Knight’s combat strength.<br/><br/>“This… hiss…”<br/><br/>The members of the Dragon Palace stared at the majestic dragon energy fervently. Their bodies trembled in excitement.<br/><br/>This was especially so for the fairy dragons who had just entered the Dragon Palace. Looking at the surging dragon energy, their faces were filled with shock.<br/><br/>Prime minister turtle gathered all the leaders and discussed the division of the absorption of the dragon energy.<br/><br/>In the end, the Dragon Palace decided to raise the strength of the sky array to Knight Level 2.<br/><br/>The elevation of the sky array would consume a quarter of the dragon energy.<br/><br/>The rest of the Dragon Palace would add another 20 knights level 1.<br/><br/>Finally, they would raise the other members of the Dragon Palace and increase the number of dragon palace god Emperor level powerhouses.<br/><br/>After a round of division, half an hour later, the members of the Dragon Palace began to absorb the dragon energy to achieve a breakthrough.<br/><br/>Soon, a vast and terrifying aura rose continuously in the dragon field. The members of the Dragon Palace began to devour one by one.<br/><br/>As they absorbed the dragon energy directly, their improvement speed was very fast.<br/><br/>In the next three days, the members of the Dragon Palace achieved a breakthrough one by one.<br/><br/>Wang Xian sat at the front with his godly dragon body, his eyes shining.<br/><br/>This time around, there were more than 500,000 Dragon Palace Godly emperors.<br/><br/>The number of universe knights in the Dragon Palace, including him, Sky Array, AO he, and the others, could reach 26.<br/><br/>After AO he and the others completely devoured the Crescent Moon Knight’s Godly Nation, the Dragon Palace could also increase the combat strength of two universe knights at level two, the devouring dragon.<br/><br/>“Greetings, Dragon King!”<br/><br/>After all the members of the Dragon Palace broke through, they knelt in front with excited faces.<br/><br/>Wang Xian had a dragon body that spanned 10,000 meters while all the members stood respectfully in front.<br/><br/>Sweeping his gaze across the members of the Dragon Palace, he revealed a smile.<br/><br/>“Get up. Next, we will move the main dragon palace to the Milky Way and officially enter the Milky Way.”<br/><br/>His eyes twinkled as he said.\t\t\t\t\t\t</div>", "images": {}, "success": true}