{"id": 135, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15072171.html", "title": "Chapter 3126 - Chapter 3126: 3125 Dragon God Bloodline, Dragon Palace", "volume": 2, "volume_title": "Volume 2", "body": "<h1>Chapter 3126 - Chapter 3126: 3125 Dragon God Bloodline, Dragon Palace</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 3126: 3125 Dragon God bloodline, Dragon Palace<br/><br/>They had officially entered the Milky Way.<br/><br/>The Mohan clan was extremely short of resources for the Dragon Palace.<br/><br/>Only by entering the Milky Way could they develop quickly.<br/><br/>With the current strength of the Dragon Palace, it could establish itself in the Milky Way and even intimidate other forces.<br/><br/>In the Milky Way, there were only a few forces that could contend with the Dragon Palace.<br/><br/>The Dragon Palace was no longer afraid of the dragon race and the nine-sword race, which were the skeleton race.<br/><br/>During this period of time, according to Wang Xian and the others’understanding, according to the records of Crescent Moon Knight, the strongest person in the Milky Way was a level 2 universe knight.<br/><br/>In terms of combat strength, the misty race was stronger because they belonged to the wizard lineage. There were wizards in the Misty Race who could fight against a Level 3 universe knight.<br/><br/>Secondly, the skeleton race was also stronger and more mysterious. According to Crescent Moon Knight’s guess, they might not be weaker than the foggy race.<br/><br/>Next was the three-foot race. Although the three-foot race was very small, their strength was also abnormally terrifying.<br/><br/>However, with the current strength of the Dragon Palace, they were not afraid at all.<br/><br/>Even if it was the foggy race, Wang Xian was not afraid at all.<br/><br/>The dragon race was the lineage of wizards who favored formations. However, Wang Xian was good at speed and was very restrained against such wizards.<br/><br/>In the next few days, Wang Xian and the rest transferred the main Dragon Palace to the volcano region.<br/><br/>“Announce that our Dragon Palace belongs to the Divine Dragon lineage. All the sub-dragon species can enter our dragon palace. Once they enter the Dragon Palace, they will be protected by the Dragon Palace.”<br/><br/>When the Dragon Palace was transferred to the Milky Way, Wang Xian gave the first order.<br/><br/>With the current strength of the Dragon Palace, there was no need to hide anything.<br/><br/>The first thing the Dragon Palace needed to do was to announce that the Dragon Palace belonged to the Divine Dragon lineage.<br/><br/>Recruit all the sub-dragon species.<br/><br/>In the current universe, there were already the Divine Dragon forces of the Divine Dragon lineage. Furthermore, there were eight of them. The weakest force of the divine dragon lineage also possessed the strength of a primary race in the universe.<br/><br/>And they were not weak among the universe’s primary race.<br/><br/>The Dragon Palace naturally belonged to the Dragon God faction, and now it also had the power of the universe’s primary race.<br/><br/>After stepping into the universe’s primary race, it also meant that this race was not so easy to bully.<br/><br/>If the others wanted to subdue the ya long as a mount, they had to consider the consequences.<br/><br/>“It’s the Dragon King!”<br/><br/>Prime Minister Gui and the others nodded.<br/><br/>Now, everyone in the Milky Way had obtained some information about the Dragon Palace.<br/><br/>All the forces in the Dragon Palace knew about the creatures with the bloodline of the Divine Dragon.<br/><br/>Now, the Dragon Palace just admitted it directly.<br/><br/>“The Dragon Palace is the bloodline of the Divine Dragon. Now that it has moved to the Milky Way, anyone with the bloodline of the Divine Dragon can join the Dragon Palace and be protected by the Dragon Palace.”<br/><br/>Soon, the Dragon Palace released a message on the universal AI.<br/><br/>It also revealed the current location of the Dragon Palace.<br/><br/>If Ya Long wanted to join the Dragon Palace, he naturally had to know the location of the Dragon Palace.<br/><br/>When this news was released, it immediately attracted the attention of the entire Milky Way.<br/><br/>Now that the Dragon Palace was famous, it was the focus of attention. Now that the Dragon Palace had released such a message, everyone was full of surprise and shock.<br/><br/>“The Dragon Palace is really from the Dragon God’s bloodline. In the universe now, including the Dragon Palace, there are already nine powers of the Dragon God’s bloodline, right?”<br/><br/>“I wonder how strong the Dragon Palace is, how many universe knights are there.”<br/><br/>“There won’t be any less. After all, they have sold the battle angels of the Universe Knights.”<br/><br/>“According to the information from the Mo Han Room ruins, this Dragon Palace doesn’t look very strong.”<br/><br/>Within the Milky Way, countless people were discussing.<br/><br/>At the same time, within the dragon race, a few elders sat in a large hall, listening to the reports from their subordinates, their eyes filled with coldness.<br/><br/>“I really didn’t expect that the Dragon Palace would dare to announce their location and openly accept the shelter ya long.”<br/><br/>The leader of the Dragon Race said coldly with a thoughtful look on his face.<br/><br/>“That Wang Xian should be able to guess that we know he is a member of the Dragon Palace, but they still announced the location of the Dragon Palace. is that arrogance or confidence?”<br/><br/>“They must have their own trump cards so they dared to announce their location. Otherwise, knowing that they have formed a deadly enmity with us and the nine swords race, they still dared to announce their location. It’s an act of courting death. They should have something to rely on.”<br/><br/>“If the Dragon Palace really belongs to the divine dragon lineage, we have to be careful. After all, they have inherited the bloodline of a race that was once at the peak of the universe.”<br/><br/>The group of venerables from the dragon-descent race chatted and frowned slightly.<br/><br/>That Wang Xian belonged to the Dragon Palace, and now, they didn’t understand the dragon palace at all.<br/><br/>It was irrational to act rashly.<br/><br/>“Inform the nine-sword race to send their venerable one over. We will discuss it properly.”<br/><br/>“Although those with the Divine Dragon bloodline are difficult to deal with, it would be a huge opportunity for us, the dragon-born race, if we can eliminate them.”<br/><br/>The leader of the dragon-born race in the center said faintly. His eyes were sparkling with a fiery glow.<br/><br/>The few people around nodded in agreement.<br/><br/>Their dragon race was not the Divine Dragon race. The reason why they were called the dragon race was because they controlled a special method to extract and integrate the Divine Dragon Bloodline.<br/><br/>It could increase their combat power and bloodline.<br/><br/>…<br/><br/>“The Divine Dragon Race, and there are the Asian Dragons of the Divine Dragon race rising to establish a powerful force? I wonder which is stronger, compared to the divine dragon race on our side.”<br/><br/>On a small flying island in the sky above the Milky Way, a middle-aged man looked at the information on the universe AI and revealed a curious expression.<br/><br/>“HM? is that Dragon Palace really from the divine dragon lineage? How pure is their bloodline?”<br/><br/>At the side, a young man riding on the body of a two-meter-large sub-dragon revealed a curious expression.<br/><br/>“I don’t know the specifics, it just rose, but to be able to sell so many treasures, it shouldn’t be an ordinary low-level race in the universe.”<br/><br/>The middle-aged man shook his head.<br/><br/>“I wonder if the godly dragon bloodline of that expert from the Dragon Palace is as pure as My Sky Halberd Dragon Horse.”<br/><br/>The young man said with a smile.<br/><br/>“Brat Tian, the godly dragon bloodline of your sky halberd dragon horse is very pure. The Sky Halberd Dragon horse is a powerful dragon seed. This is the inferior dragon that the sky dragon race gifted to our ancient painting sect. The bloodline of the Sky Dragon Race is just so-so.”<br/><br/>An old man’s voice came from the side.<br/><br/>“Grandpa Vice Sect Master, why don’t we go to the Dragon Palace and see if they have any treasures that can raise the level of the Heavenly Halberd Dragon Horse.”<br/><br/>The young man looked at Venerable Lou Shan and said with a smile.<br/><br/>“The Heavenly Halberd Dragon horse has the ninth level of the divine emperor realm. It can fight against opponents of a higher realm. It is already very powerful now. If it is raised any further, it will be comparable to a venerable.”<br/><br/>Venerable Lou Shan said with a smile.<br/><br/>“I hope that the Heaven Halberd dragon horse can rise to the venerate realm as soon as possible. It is rumored that the Dragon Palace has a pure divine dragon bloodline. Why don’t we go over and take a look? Who knows, we might gain something?”<br/><br/>The youth said with a face full of anticipation.<br/><br/>“Alright, Alright. We can go over and take a look too.”<br/><br/>After hesitating for a moment, venerable Lou Shan nodded with a smile.\t\t\t\t\t\t</div>", "images": {}, "success": true}