{"id": 138, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15072177.html", "title": "Chapter 3129 - Chapter 3129: 3128 Killed", "volume": 2, "volume_title": "Volume 2", "body": "<h1>Chapter 3129 - Chapter 3129: 3128 Killed</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 3129: 3128 killed<br/><br/>“Our Dragon Palace has made a choice, Jie Jie Jie!”<br/><br/>With sky array as the leader, 20 universe knights stood at the front and stared at Lou Shan Knight and the others calmly.<br/><br/>“HM?”<br/><br/>Lou Shan Knight’s pupils contracted when he saw sky array and the others suddenly appear. He sized them up and his expression changed drastically.<br/><br/>“What do you want to Do? Don’t be ungrateful to the Dragon Palace.”<br/><br/>Beside him, a group of middle-aged elders saw the sudden appearance of the sky array group and revealed furious expressions.<br/><br/>“TSK TSK TSK, didn’t you give us a choice? We chose to be enemies with you? Naturally, we want to kill you.”<br/><br/>Eight points swept over all of them with ridicule.<br/><br/>The Heaven Formation waved its arms and started to set up the formation on its own. Since they were going to make a move, they should leave the other party here completely.<br/><br/>When Venerable Lou Shan heard Ba Qi’s words, his expression changed drastically. He immediately turned his head and stared at Wang Xian. “Do you know what your Dragon Palace is doing?”<br/><br/>Wang Xian looked at him quietly and didn’t say anything.<br/><br/>“Your Dragon Palace is courting death.”<br/><br/>Seeing that Wang Xian remained silent and sensed the formation behind him, he roared and immediately grabbed the people around him and rushed forward.<br/><br/>Boom! Boom! Boom<br/><br/>The moment he rushed out, the group of twenty universe knights from the Dragon Palace started to move. Their mighty power, which belonged to the level of a knight, sealed the surrounding area.<br/><br/>With a wave of the arm of the sky formation, waves of terrifying energy covered him.<br/><br/>“Lou Shan Island!”<br/><br/>Lou Shan Knight Roared, and the island in front of him released a yellow light and flew over.<br/><br/>“Jie Jie Jie, a universe Knight Level 2 Old Thing, how dare you act so arrogantly in our Dragon Palace, how dare you look down on us, I’ll kill you today.”<br/><br/>Mo Sha Roared, and the 10 Great Beings of Dragon Palace looked at Lou Shan Island and flew over.<br/><br/>“Hong Hong Hong!”<br/><br/>The 10 of them worked together, and they were strong enough to fight against a universe Knight Level 2. Terrifying energies shot towards the island.<br/><br/>This was a powerful acquired spirit treasure.<br/><br/>“What! They are all universe knights.”<br/><br/>The middle-aged old man and the young man from the ancient art sect felt the terrifying power, and their faces were filled with fear.<br/><br/>All of them were venerables.<br/><br/>There were more than 20 universe knights in the Dragon Palace. To think that they had such terrifying strength.<br/><br/>Buzz<br/><br/>At this moment, Wang Xian’s figure disappeared instantly.<br/><br/>Since he had made his move, Wang Xian would never allow them to leave.<br/><br/>With the appearance of the primaless sacred wings, he had already obtained eight thunder feathers. Although his speed had only increased by a little, his current speed was comparable to a level 3 supremacy.<br/><br/>“Bang!”<br/><br/>Before venerable Lou Shan could react, he felt a terrifying force landing on his body.<br/><br/>“Not good!”<br/><br/>His expression changed drastically and his eyes were filled with fear.<br/><br/>“PFFT!”<br/><br/>He spat out a large mouthful of blood. His forehead was instantly filled with cold sweat as he started to panic.<br/><br/>“Dragon Eyes Lock All Corners!”<br/><br/>Wang Xian let out a soft cry and sealed the area one by one.<br/><br/>With the attack of the Heaven Formation and Wang Xian’s attack, the two of them had the ability to kill people of the same level. With the two of them working together, they could escape from the hands of a level three knight.<br/><br/>Now that they were working together to deal with a level two universe knight and there were 20 Dragon Palace Knight level members around them, it was simply too simple.<br/><br/>In this situation, he could not react in time to his own attack.<br/><br/>The chains instantly restrained him. Wang Xian held one end of the chains with a cold and mocking look in his eyes.<br/><br/>“Crash!”<br/><br/>The Venerable Lou Shan, who was restrained by the chains, struggled violently. He stared at Wang Xian with his eyes wide open. “Dragon King… We don’t have much hatred. Why did you kill us?”<br/><br/>“We don’t have much hatred. However, don’t be so arrogant when you come to our Dragon Palace. Speak properly and our Dragon Palace will treat you well. You asked us if we wanted to be enemies with you. We chose to be enemies with you. This is what you asked us to choose. Therefore, you have to bear the consequences.”<br/><br/>Wang Xian said faintly and waved his arm. The Heavenly Halberd Dragon horse that was lying on the ground was sent to a side by the chains.<br/><br/>“Thank you, Dragon King! Thank you, Dragon King!”<br/><br/>The Heavenly Halberd Dragon horse immediately knelt down and thanked him.<br/><br/>“We… We can give this heavenly halberd dragon horse to you, Dragon King. After you release us, our ancient art sect will definitely not pursue the matter with Your Dragon Palace.”<br/><br/>Venerable Lou Shan gulped and said with a face full of fear.<br/><br/>“Is it possible? Since we have already made our move, there is no room for negotiation.”<br/><br/>Wang Xian shook his head slowly.<br/><br/>“Hula!”<br/><br/>As soon as he finished his sentence, the chains contracted rapidly.<br/><br/>“Ah!”<br/><br/>A scream came from their mouths.<br/><br/>“No, no, don’t kill me. Do you know who I am? I am the grandson of the ancient art sect’s sect master. Don’t kill me.”<br/><br/>The young man felt the threat of death and shouted in fear.<br/><br/>“Sky Array, keep an eye on them. Don’t let them have any secret treasures that can allow them to escape.”<br/><br/>Wang Xian looked at them coldly and said to the sky array.<br/><br/>“It’s the Dragon King!”<br/><br/>The sky array nodded and set up layers of formations. There was even a curse formation.<br/><br/>“Dragon Palace, if you kill us, our ancient art sect will definitely not let you off. You have to think about it carefully.”<br/><br/>Venerable Lou Shan shouted sternly.<br/><br/>Buzz<br/><br/>Wang Xian waved his arm and a greyish energy covered all of them.<br/><br/>“No, no, no!”<br/><br/>The group of young, middle-aged, and old men let out desperate roars.<br/><br/>They had followed the vice sect master out this time. With a playful attitude, no force in the Milky Way was a match for their ancient art sect, so they had always carried a faint arrogance in their hearts.<br/><br/>However, they had never expected that the Dragon Palace would actually dare to make a move against them and want to exterminate all of them.<br/><br/>They didn’t want to die!<br/><br/>They were the core disciples of the ancient art sect and had a powerful background.<br/><br/>However, their screams came to an abrupt end.<br/><br/>Venerable Lou Shan’s body trembled as he lost his life force.<br/><br/>A level two universe knight had died here due to his arrogance.<br/><br/>Wang Xian swept his gaze across the corpse and passed it to the members of the Dragon Palace. With a wave of his arm, the Five Elements Millstone flew out and headed towards Lou Shan Island to devour it.<br/><br/>He looked to the side. The Heaven Halberd Dragon horse, which was full of respect, laid on the ground and looked at him. When it saw Wang Xian’s gaze, it subconsciously lowered its head.<br/><br/>“Follow me into the Dragon Palace. You will become a disciple of the Dragon Palace in the future.”<br/><br/>Wang Xian said to it.<br/><br/>The reason why Wang Xian made a move to keep venerable Lou Shan and the rest here was largely due to the heaven-halberd dragon horse.<br/><br/>The first time Wang Xian saw him, he thought of a dragon seed.<br/><br/>Halberd Dragon Guard.\t\t\t\t\t\t</div>", "images": {}, "success": true}