{"id": 133, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15072167.html", "title": "Chapter 3124 - Chapter 3124: 3122 Grand Auction 4", "volume": 2, "volume_title": "Volume 2", "body": "<h1>Chapter 3124 - Chapter 3124: 3122 Grand Auction 4</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 3124: 3122 Grand Auction 4<br/><br/>“It seems that all the forces in the Milky Way are here.”<br/><br/>Wang Xian was hiding in Xiao Lan’s stomach. He looked at the sky in front of him and smiled.<br/><br/>From his senses, there were a total of 21 universe knights. Among them, there were at least two level 2 universe knights.<br/><br/>“A primary race in the universe allows 20,000 people to enter the auction house. The rest of them can take their strength or resources. In this auction, the divine stones and treasures can all be traded.”<br/><br/>Xiao Lan slowly stopped in front of the silver gazing continent. The sky array floated above the auction house. His gaze swept across everyone as he spoke indifferently.<br/><br/>At the same time, he waved his arm, and an array rose. This was a simple array formation that could prevent people below divine emperor level six from entering.<br/><br/>If people below divine emperor level six wanted to enter, they needed to take out some treasures and pass the array formation’s inspection before they could enter the auction house.<br/><br/>“Alright, let’s go.”<br/><br/>In the center, a supremacy of the misty race replied indifferently. His body moved and he led a group of disciples into the auction house.<br/><br/>The rest of the universe race supremacies led the way and followed closely behind.<br/><br/>On the Milky Way’s side, among the dozens of universe primary races, the misty race would be ranked second even if they could not be ranked first.<br/><br/>Their strength was publicly acknowledged to be formidable.<br/><br/>The misty race didn’t have any objections, and the other races didn’t have any objections either.<br/><br/>“This auction actually set such a huge restriction. Those below the sixth level of the divine emperor, and those without sufficient resources actually can’t enter.”<br/><br/>“Such an auction, the lowest value is still a sixth level divine emperor artifact. You Don’t have the strength or money, so why should I let you in?”<br/><br/>“This standard is so high!”<br/><br/>When the surrounding people heard the sky array’s words, they discussed animatedly.<br/><br/>Many people revealed disappointed expressions.<br/><br/>With such a high standard, they didn’t even have the qualifications to enter.<br/><br/>However, some experts and wealthy people directly flew inside.<br/><br/>From time to time, the surrounding people would let out a surprised cry. A certain divine emperor entered, and the daughter of a certain powerful divine emperor entered.<br/><br/>And so on and so forth.<br/><br/>The front of the entire silver gazing continent was bustling with activity.<br/><br/>More than ten people from the low-level races of the universe had entered, and hundreds of thousands of wealthy and powerful warriors had also entered through the array formation.<br/><br/>Very quickly, 80% of the seats in the auction venue were filled.<br/><br/>“Hahaha, we’re not late, right?”<br/><br/>Right at this moment, a whistling sound was heard.<br/><br/>“Huh?”<br/><br/>Hearing this sound, the 21 universe knights sitting in the auction house narrowed their eyes and immediately flew toward the sky.<br/><br/>An island a few kilometers in size flew over at a terrifying speed and hovered in the sky.<br/><br/>On the island, more than 20 young, middle-aged, and old men flew down from the island.<br/><br/>The old man in the lead was holding a cattail leaf fan and was dressed rather shabbily.<br/><br/>He looked at little blue, and his eyes were shining.<br/><br/>“TSK, tsk.”<br/><br/>They flew into the auction house.<br/><br/>“It’s Lou Shan Knight.”<br/><br/>“It’s the people from the ancient art school.”<br/><br/>“Why are they here? They are so far away from Milky Way, yet they are here.”<br/><br/>In the auction house, the Universe Knights looked at the old man, and their eyes froze.<br/><br/>Even the level 2 knight from the mist race frowned.<br/><br/>“Who are they?”<br/><br/>“The ancient art school is over 10,000 light years away from our Milky Way. The ancient art school is a school founded by human warriors and is very powerful. Although it is also classified as a low-level race in the universe, they have 30 to 40 universe knights, or even more.”<br/><br/>Some disciples of the races whispered.<br/><br/>“30 to 40, so powerful?”<br/><br/>“The old man in the lead is called Lou Shan Knight, and he should have the power of a Level 2 universe knight. The ancient painting sect is more powerful and has more resources than any other race in the Milky Way. With their arrival, our Milky Way Force has another competitor.”<br/><br/>“I didn’t expect that the auction of the Immortal Palace War Pets would attract such a force.”<br/><br/>“The competition will be even more intense this time.”<br/><br/>Some warriors were talking in low voices.<br/><br/>“There are so many people.”<br/><br/>The 20 over people who flew over scanned the surroundings and calmly looked down.<br/><br/>“Give some space to the warriors of the ancient painting sect.”<br/><br/>The Mist Race Universe Knight Level 2 Fire Mist Knight said indifferently.<br/><br/>Immediately, a group of people from the mist race gave way to a better spot.<br/><br/>“Haha, many thanks to everyone from the mist race.”<br/><br/>Venerable Lou Shan laughed loudly and led a group of disciples to sit down.<br/><br/>Among the twenty over people, a young man rode on a Yalong War pet and looked around curiously.<br/><br/>In the surroundings, a group of experts from the races were also sizing up the group from the ancient painting sect.<br/><br/>In the universe, other than the various races, there were quite a number of such powerful sects.<br/><br/>Under normal circumstances, such sects belonged to humans.<br/><br/>The number of humans in the universe was very high.<br/><br/>“There are actually experts from other forces from other galaxies coming over.”<br/><br/>Wang Xian, who was in Xiao Lan’s body, could see everyone clearly. He could even hear everyone’s whispers.<br/><br/>After all, they were currently in Xiao Lan’s body.<br/><br/>However, the more forces came over, the more advantageous it would be for the auction house this time around.<br/><br/>Looking at the Yalong mount under the young disciple of the ancient painting sect, he slightly narrowed his eyes.<br/><br/>“After this auction, the Dragon Palace is going to carry out some operations.”<br/><br/>He murmured, and a thoughtful look appeared on his face.<br/><br/>“Since everyone has arrived, we won’t delay any longer. The auction will begin immediately.”<br/><br/>Tian Chen’s eyes swept through the surroundings. There were more than 800,000 people in the entire auction house.<br/><br/>Without wasting any time, he waved his arm and displayed all the items.<br/><br/>Over 14,000 battle angels.<br/><br/>Seven Pinnacle God Emperor Battle Pets.<br/><br/>One universe Knight Battle Pet.<br/><br/>Over 1,000 God weapons.<br/><br/>All of them were displayed brightly in the center of the screen.<br/><br/>“Our auction this time is very simple. If you see anything you like, raise the price immediately.”<br/><br/>Tian Chen said indifferently.<br/><br/>He displayed everything in one go, and whoever he saw would be able to raise the price.<br/><br/>Each item was set with the lowest price.<br/><br/>“This auction method?”<br/><br/>Everyone was slightly stunned, and then they narrowed their eyes.<br/><br/>This method allowed everyone to compete at the same time, and it could maximize the benefits.<br/><br/>At this time, no matter which faction you were from, no matter how strong they were, if they didn’t have money, they wouldn’t be able to compete with others.<br/><br/>Everything was transparent, it all depended on whether you had god stones and treasures.<br/><br/>“Interesting, we want this knight level Battle Angel.”<br/><br/>Lou Shan Knight squinted his eyes, waved his arm and pointed ahead, raising the price.<br/><br/>“Then let’s compete.”<br/><br/>Fire Mist Knight said lightly, raising the price immediately.<br/><br/>This time, a group of low level universe races, many of them were targeting the knight level battle Angel.\t\t\t\t\t\t</div>", "images": {}, "success": true}