{"id": 132, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15072165.html", "title": "Chapter 3123 - Chapter 3123: 3,123 Huge Gains", "volume": 2, "volume_title": "Volume 2", "body": "<h1>Chapter 3123 - Chapter 3123: 3,123 Huge Gains</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 3123: 3,123 huge gains<br/><br/>In this auction of the battle pets of the Immortal Palace, all the primary races of the universe were targeting those two.<br/><br/>The Battle Angel of the Knight level, the battle pet of the Knight level.<br/><br/>The Battle Angel could be placed first, and the battle pet could be placed second.<br/><br/>However, there were only two treasures, and no one was willing to give up.<br/><br/>Even the weaker water mountain race, which only had one universe knight.<br/><br/>They were going all out.<br/><br/>Because as long as they got it, it was equivalent to doubling their strength.<br/><br/>How could they not go all out?<br/><br/>They were even willing to take out everything in the treasury.<br/><br/>“Hiss, my good boy, a universe primary race is a universe primary race, how can we go all out against them?”<br/><br/>When the group of over 10 universe primary races started to make their moves, the entire auction house was silent.<br/><br/>No one bid for the other items, everyone looked on.<br/><br/>The price of a Knight Level Battle Angel was already very high, to the point that the domain level races couldn’t bear it.<br/><br/>However, the universe primary races didn’t hesitate at all, throwing all sorts of resources, God stones and treasures at it.<br/><br/>The 10 or so universe primary races only added the battle Angel’s price, that was slowly rising.<br/><br/>After that, they added treasures, pills, and the god country tree.<br/><br/>The auction had already started, but the scene was silent.<br/><br/>The others held their breaths as they watched the fierce battle.<br/><br/>They didn’t dare to disturb and quietly watched.<br/><br/>“Hu!”<br/><br/>After two minutes of competition, a universe knight from one of the universe primary races shook his head. His face was filled with helplessness, and he could only give up.<br/><br/>They turned their attention to the battle pet of the Universe Knight level.<br/><br/>The Battle Pet of the Universe Knight level was not inferior to the battle angel to a certain extent.<br/><br/>However, the Battle Angel was easy to command.<br/><br/>Some universe primary races that couldn’t hold on any longer began to compete for the battle pet of the Knight level.<br/><br/>The price was also rising crazily.<br/><br/>Even the pinnacle god Emperor Great Beings were watching solemnly.<br/><br/>The scene in front of them was too crazy.<br/><br/>This amount of resources was too terrifying.<br/><br/>“This bunch of fellows are really rich.”<br/><br/>Venerable Lou Shan from the ancient painting sect looked at the resources that were increasing crazily and frowned slightly. “Fortunately, they brought more treasures this time.”<br/><br/>He muttered and increased his strength once again.<br/><br/>“It seems that the ancient painting sect is determined to obtain the Battle Angel.”<br/><br/>The foggy race, the Dragon Race, the nine sword race, the skull race, and the other powerful races glanced at the ancient painting sect and fell into deep thought.<br/><br/>“Bring out the bottom line of the race.”<br/><br/>Each race began to put up their own race’s limit price. If it didn’t work, they would fight for the battle pet of the venerable level.<br/><br/>Each of the primary races in the universe raised the price to their own limit and the resources continued to rise.<br/><br/>“Haha, I’m Rich, I’m Rich.”<br/><br/>At the same time, Wang Xian, who was in Xiao Lan’s body, saw this scene. His eyes were filled with excitement.<br/><br/>He didn’t expect that these races would be so crazy.<br/><br/>Initially, he thought that the resources sold by a battle angel at the level of a universe knight could increase the number of level one battle force members of the Dragon Palace by 10.<br/><br/>However, with the current resources, it could increase by at least 12 or 13.<br/><br/>Right now, the main competition was still on the Battle Angel. The resources sold by the battle pet could at least increase the Dragon Palace by 10 Knight Level 1 fighters.<br/><br/>All of them, the resources that this auction would bring to the Dragon Palace was simply unimaginable.<br/><br/>The Dragon Palace would be able to get a huge boost.<br/><br/>“That battle Angel is going to belong to the ancient art sect. Looks like they are determined to get it this time. They are well-prepared.”<br/><br/>Wang Xian looked over and mumbled.<br/><br/>“The Battle Angel has been auctioned off by the ancient art sect.”<br/><br/>At this moment, there was a commotion in the auction.<br/><br/>The Battle Angel’s competition had been decided.<br/><br/>Next, the battle pet of the venerable level.<br/><br/>The competition for the Battle Pet of the venerable realm was still very intense. The ancient art sect did not make a move, instead quietly watching from the side.<br/><br/>Not long after, the venerable realm battle pet was obtained by the dragon-descendant race.<br/><br/>“We can finally intervene.”<br/><br/>Seeing that the two treasures of the venerable realm had been auctioned off, some peak domain-level race god emperors heaved a sigh of relief.<br/><br/>They were able to intervene in the following auctions.<br/><br/>The following auctions were even more intense.<br/><br/>Over 800,000 battle pets and Battle Angels had participated in the auctions at the same time. They had all suffered from the madness of countless people.<br/><br/>Even though there were more battle angels, more than 10,000 of them, there were more than 1,000 of them from the ten or so elementary races in the universe.<br/><br/>This was especially so for those primary races that did not manage to bid for the Battle Angels and battle pets of the venerable level. They could only target those ordinary battle angels.<br/><br/>This made Wang Xian estimate that the resources sold by a peak-stage battle pet and battle angel of the Divine Emperor would be enough for the Dragon Palace to increase the combat strength of a level one universe knight.<br/><br/>A crazy auction lasted for two hours.<br/><br/>After two hours, all the items were sold.<br/><br/>Some were delighted while others were excited.<br/><br/>Following that, after spending some time, Wang Xian changed his form and helped some buyers tame their battle pets.<br/><br/>The entire auction took him more than half a month to complete.<br/><br/>On the day the auction ended, the results of the auction this time caused a stir in the entire Milky Way.<br/><br/>Someone calculated the total value of the items auctioned this time. It was almost comparable to all the assets of a low-level race in the universe.<br/><br/>And it was not a weak low-level race in the universe.<br/><br/>Crazy!<br/><br/>And the biggest beneficiary of this auction was not the Immortal Palace’s War Pet, but the Dragon Palace.<br/><br/>The name of the Dragon Palace attracted countless people’s attention and countless people’s discussions.<br/><br/>Soon, some information about the dragon palace was dug out.<br/><br/>Some people learned that the Dragon Palace came from the ruins of the Mohan Palace.<br/><br/>This news shocked many people.<br/><br/>More and more information about the Dragon Palace was revealed.<br/><br/>For example, the Dragon Palace had a pure divine dragon.<br/><br/>The Dragon Palace had a large number of sub-dragons and so on.<br/><br/>This surprised everyone. When the Dragon Palace’s development speed was dug out, there was another wave of excitement.<br/><br/>Some people guessed that the dragon palace might have obtained some of the inheritance of the Divine Dragon.<br/><br/>All kinds of news were flying around.<br/><br/>When Wang Xian saw all kinds of news about the dragon palace in the Milky Way, he was not too surprised.<br/><br/>It was only a matter of time before the Dragon Palace was exposed to everyone in the Milky Way.<br/><br/>Now, it was just a matter of time.<br/><br/>“After the Dragon Palace digests this batch of resources, we can move the main dragon palace here.”<br/><br/>Wang Xian returned to the Dragon Palace and muttered.<br/><br/>“Prime Minister Gui.”<br/><br/>He shouted softly and called Prime Minister Gui over.<br/><br/>“Dragon King!”<br/><br/>Prime Minister Gui flew over and bowed.<br/><br/>“Report the gains this time.”<br/><br/>He leaned on the dragon chair with a smile.\t\t\t\t\t\t</div>", "images": {}, "success": true}