{"id": 131, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15072163.html", "title": "Chapter 3122 - Chapter 3122: 3121 Grand Auction 3", "volume": 2, "volume_title": "Volume 2", "body": "<h1>Chapter 3122 - Chapter 3122: 3121 Grand Auction 3</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 3122: 3121 Grand Auction 3<br/><br/>It had been a month since the Immortal Palace Battle Pet announced the auction.<br/><br/>In this month, the Immortal Palace battle pet auction was known by everyone in the Milky Way.<br/><br/>All the forces, all the powerhouses, were paying attention to this auction.<br/><br/>In this month, people could clearly feel that some of the universe’s primary races were preparing something.<br/><br/>This time, there were too many treasures. The Knight Level Battle Pets and Battle Angels had a powerful allure for the universe’s primary races.<br/><br/>Being able to buy one was a huge increase in their strength.<br/><br/>The nine blade race and the Dragon Race, the two universe’s primary races, had made contact and joined forces to investigate some things.<br/><br/>The entire Milky Way was in turmoil.<br/><br/>“There’s actually such a grand auction in a small Milky Way?”<br/><br/>At the same time, in the starry sky 10,000 light years away from the Milky Way, many huge buildings were floating in the void.<br/><br/>The entire void was surrounded by immortal energy, and occasionally, cranes flew.<br/><br/>In a palace that was half hidden into the clouds, a group of dozens of middle-aged elders were idling inside, chatting and laughing.<br/><br/>One of the middle-aged men looked at the message sent by a good friend and was shocked.<br/><br/>“What auction?”<br/><br/>“Milky Way’s strength is average, what else is there?”<br/><br/>Beside him, an old man asked with a smile.<br/><br/>“This time, a force called the war pets of the immortal palace is holding an extraordinary auction. It will sell a level 1 battle Angel of a universe Knight, a Level 1 War Pet of a universe knight, and a large number of godly weapons, Hehe.”<br/><br/>The middle-aged man looked at the information and opened his AI to search for it. His face was full of surprise and shock.<br/><br/>Universe knights, such an existence, unless they were from a high-level race or a pinnacle race, they would be the core great beings of any race.<br/><br/>This was even more so for the low-level races in the universe.<br/><br/>There were strong and weak low-level races in the universe. However, even among the stronger low-level races, there were only a few thousand universe knights.<br/><br/>The races they belonged to hadn’t reached such a level yet.<br/><br/>“HM? Auctioning off Battle Pets at the knight level, and that Battle Angel? Is it that powerful?”<br/><br/>The middle-aged man’s words attracted the attention of the surrounding people, and they immediately looked over, their eyes filled with shock.<br/><br/>“Yes, it will be confirmed in a month’s time.”<br/><br/>The middle-aged man nodded.<br/><br/>“Aren’t battle angels the underlings of the Battle Army created by the Peak Race of Angels? Why would they appear in the Milky Way?”<br/><br/>Someone asked curiously.<br/><br/>“Do you know that Crescent Moon Venerable, who was courting death, actually used a type of spiritual treasure to spy on Master Moyang and was directly destroyed by Master Moyang’s father? That Crescent Moon Venerable seemed to have obtained a bit of the skin of the angel race and created some battle angels.”<br/><br/>“Now, a force called Dragon Palace has obtained a treasure of Crescent Moon Knight and is cooperating with the Battle Pet of Immortal Palace to auction it.”<br/><br/>“That battle pet of Immortal Palace is quite mysterious. It can actually subdue a level 1 battle pet of a Universe Knight. Search for it yourself.”<br/><br/>The middle-aged man said as he looked at the universe ai.<br/><br/>The rest of them opened the universe AI.<br/><br/>“This battle Angel is a good thing. As long as we control the core, we can control it. It’s even more convenient than a battle pet. Should we report this to the sect leader?”<br/><br/>“Let’s report it. With our strength, it won’t be difficult to take down that battle angel or even that battle pet of a Level 1 universe Knight.”<br/><br/>Some middle-aged elders were chatting.<br/><br/>Wang Xian, who was far away in the Milky Way, didn’t know that the auction for the Battle Pet of the Immortal Palace had already spread to other galaxies.<br/><br/>As the auction got closer and closer, the Dragon Palace began to make some preparations.<br/><br/>Considering that there were quite a number of universe knight powerhouses present at the auction, Wang Xian pulled ao crab and the others over at the last minute.<br/><br/>During these two months, ao crab and his three subordinates were crazily devouring the universe God Country of Crescent Moon Knight.<br/><br/>Within two months, they had advanced to the level of a level one universe knight.<br/><br/>Four universe knights were at level one. Including the Heaven Array, there were a total of five. This was enough to intimidate them.<br/><br/>Wang Xian was not going to show himself. He was afraid of being discovered, so he decided to hide behind the scenes.<br/><br/>“It’s about time. Let’s go.”<br/><br/>There were still five hours before the auction. Wang Xian looked at Ao Xie and the others in the heaven array and said.<br/><br/>“Alright, Dragon King.”<br/><br/>Tian Cheng and the rest nodded and flew toward Xiao Lan’s body.<br/><br/>Xiao Lan’s body was huge enough that it was not crowded even if tens of millions of people stood on it.<br/><br/>On Xiao Lan’s body, the original building had been transformed into a huge auction house.<br/><br/>The auction house had a million seats and there was an auction stage in the middle.<br/><br/>This time, there were no other people from the Dragon Palace. There were only Wang Xian, Tian Cheng, and Ao crab.<br/><br/>With the appearance of Tian Zhen and the other three, it shouldn’t be too much of a problem.<br/><br/>Xiao Lan quickly headed toward the silver-gazing continent. The flag of the Immortal Palace’s War Pet was fluttering in the sky.<br/><br/>“They’re here, they’re here. The people from the Immortal Palace’s War Pet are here.”<br/><br/>“It’s still that gigantic space beast. It’s still very shocking to see it again.”<br/><br/>“I wonder what faction is behind this Immortal Palace’s War Pet. It’s too powerful and mysterious.”<br/><br/>At this moment, the sea in front of the silver gazing continent was already filled with people.<br/><br/>There had never been so many people on this side of the sea before.<br/><br/>At a glance, there were at least tens of billions of people densely packed.<br/><br/>Among them, at the front, more than ten universe primary races occupied the center. In front of each universe primary race, there were universe knights floating.<br/><br/>Many people were shocked and scared by the majestic aura.<br/><br/>“This is crazy. We haven’t had such a grand event in the Milky Way for hundreds of millions of years.”<br/><br/>“After all, there are knight-level battle pets and knight-level battle angels in this auction.”<br/><br/>“All the universe primary races in the Milky Way are here. About 20 universe knights are here.”<br/><br/>“About the same. I wonder if we domain level races can have some soup.”<br/><br/>At the back, everyone looked at the 10 or so primary races in the center and discussed in low voices.<br/><br/>“They’re here. I can sense the auras of five Universe Knights.”<br/><br/>At this moment, in the center, the Knights of the primary races looked at the enormous space beast in front of them. Their eyes were shining.<br/><br/>They sensed the aura of the space beast ahead, and their eyes focused slightly.<br/><br/>“This Immortal Palace War pet is indeed not simple. An auction sent five elements universe knights. If we include the Knight Level Battle Angel and War Pet, there will be seven of them.”<br/><br/>The Knights of the universe primary races murmured.<br/><br/>Just by looking at a corner, one could see how powerful this Immortal Palace War Pet was.<br/><br/>Everyone held back their other thoughts and watched quietly.\t\t\t\t\t\t</div>", "images": {}, "success": true}