{"id": 147, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15072195.html", "title": "Chapter 3138 - Chapter 3138: The 3137 Dragon Palace Came Here To Exterminate The Entire Clan", "volume": 2, "volume_title": "Volume 2", "body": "<h1>Chapter 3138 - Chapter 3138: The 3137 Dragon Palace Came Here To Exterminate The Entire Clan</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 3138: The 3137 Dragon Palace came here to exterminate the entire clan<br/><br/>“All members of the Dragon Palace who are participating in the battle, Get Ready!”<br/><br/>A month later, an order spread across the entire Dragon Palace. In the Dragon Field of the Dragon Palace, the disciples flew over immediately.<br/><br/>Wang Xian stood quietly in front of the Dragon Field.<br/><br/>The leaders of the Dragon Palace stood at the forefront.<br/><br/>Ao Qitian and Ao Qi, the leaders of the berserk dragon species.<br/><br/>Ao Jian, the leader of the Dragon Guards.<br/><br/>Ao Fenghuang, the leader of the Thunder, fire, and Phoenix species.<br/><br/>Ao Yao, the leader of the prickly dragon species.<br/><br/>Mou Zesen, the leader of the arrow dragon species.<br/><br/>Ao Xingmu, the leader of the Starwood Dragon species.<br/><br/>Ao Tu, the leader of the imperial dragon species.<br/><br/>Ba Qi Mosha, the leader of the poisonous horned dragon species.<br/><br/>Tian Zhen, the leader of the Wizard Dragon species.<br/><br/>The supporting members of the fairy dragon species and the dolphin species.<br/><br/>These were the combat dragon species of the Dragon Palace. The fire hammer species did not participate in this.<br/><br/>A total of 500,000 members of the Dragon Palace flew over quickly.<br/><br/>“Greetings, Dragon King!”<br/><br/>The members of the Dragon Palace came to the dragon field and lined up neatly. They bowed respectfully and loudly.<br/><br/>“All members, get ready for today’s expedition to the Dragon Tribe.”<br/><br/>Wang Xian swept his gaze across the members of the Dragon Palace and shouted in a deep voice.<br/><br/>“Fight!”<br/><br/>The group of Dragon Palace disciples raised their arms and shouted.<br/><br/>“Alright, let’s Go!”<br/><br/>Wang Xian focused his gaze and ordered.<br/><br/>“Woo Woo!”<br/><br/>“Woo Woo!”<br/><br/>A roar came from the side. Xiao Lan, Xiao Zhai, and the rest swayed their huge bodies and let out a low roar.<br/><br/>“Whoosh! Whoosh! Whoosh!”<br/><br/>One by one, the members moved their bodies and flew towards Xiao Lan’s body.<br/><br/>Wang Xian’s body moved and landed on Xiao Lan’s body.<br/><br/>On the other side, ao crab landed on Xiao Lan’s body.<br/><br/>“Let’s Go!”<br/><br/>Wang Xian said indifferently.<br/><br/>“Woo Woo!”<br/><br/>“Woo Woo!”<br/><br/>“FIGHT FIGHT FIGHT!”<br/><br/>Xiao Lan’s small house roared and immediately flew out of the Dragon Palace.<br/><br/>“Dragon descendant, nine swords. Do you really think the Dragon Palace will let this go?”<br/><br/>Wang Xian stared ahead with a cold look in his eyes.<br/><br/>During this one month, the Dragon Palace did not make any statement on the universe AI, nor did they make any movements.<br/><br/>They had been waiting for today.<br/><br/>He had promised the fairy dragon clan that he would annihilate the dragon descendant, nine swords, and the skeleton clan.<br/><br/>Now, he would start from the dragon descendant, nine swords.<br/><br/>Ao he and the rest had completed their upgrade. This time, the Dragon Palace had mobilized all their elite forces.<br/><br/>“We can finally take revenge!”<br/><br/>“The nine-sword race of the dragon race has killed many of our Yalong brothers and sisters. This time, we can finally make them pay the price.”<br/><br/>“Hahaha, the day has finally come. My father was killed by the nine-sword race. I didn’t expect that one day, I would be able to take revenge.”<br/><br/>On Xiao Lan’s body, behind the disciples of the Dragon Palace, there was a group of members of the Dragon Palace.<br/><br/>They were the members who had joined the Dragon Palace this month.<br/><br/>At this moment, they were full of excitement and excitement, and their faces were full of violent killing intent.<br/><br/>In the Milky Way, the sub-dragons who had the bloodline of the Divine Dragon had been living in fear and didn’t dare to reveal their identities.<br/><br/>Many of their elders had been killed by the descendants of the nine-sword dragon.<br/><br/>Looking at the powerful Dragon Palace and their powerful background, they were all excited.<br/><br/>The Fairy Dragons were the same.<br/><br/>Revenge!<br/><br/>They had to pay the price of blood.<br/><br/>Little Blue and little house’s bodies had reached over 600 km, looking like a huge island from afar.<br/><br/>It contained a terrifying aura.<br/><br/>They both had the power of a Level 1 universe knight. Their huge bodies and special talents made their speed extremely terrifying.<br/><br/>Little Blue’s small house appeared above the Milky Way. It opened its mouth and a black hole appeared. They immediately burrowed into it and disappeared.<br/><br/>When they reappeared, they had already traveled a long distance.<br/><br/>This terrifying speed made a Level 1 universe knight far behind.<br/><br/>The nine blade race and the dragon race were very far apart, and the dragon race was located on the right side of the Moon Silver Continent.<br/><br/>Their nest was located within the Void Mountains.<br/><br/>The floating mountains were connected to each other, like a dragon crouching in the Void, hidden within the white clouds.<br/><br/>The entire dragon race’s nest was extremely vast.<br/><br/>This territory had been operated by the entire dragon race for hundreds of millions of years, and within it hid the power of reaching the heavens.<br/><br/>Surrounding this mountain range were planets belonging to the dragon race. They were densely packed in the starry sky. There were many of them.<br/><br/>They were like the stars in the starry sky.<br/><br/>Wang Xian set his first target on the dragon race.<br/><br/>Firstly, the dragon race was stronger. Secondly, the dragon race possessed the Thunder attribute holy feathers.<br/><br/>The last time he killed three venerables of the dragon race, he only obtained six thunder attribute holy feathers from them.<br/><br/>Now, he had a total of 14, but he still needed 35 more to gather them.<br/><br/>He wanted to see if the remaining holy feathers were with the dragon-descendant race.<br/><br/>Xiao Lan and Xiao Zhai shuttled through the sky above the Milky Way.<br/><br/>Their speed was abnormally terrifying. Originally, even a universe knight would need to fly for two days, but they had already arrived at the edge of the Milky Way in about 10 hours.<br/><br/>Stars appeared in the starry sky at the edge of the Milky Way.<br/><br/>Wang Xian narrowed his eyes slightly and looked at the void in front of him.<br/><br/>Buzz<br/><br/>Xiao Lan opened her mouth and a black hole appeared once again.<br/><br/>They entered it one by one.<br/><br/>“What kind of space behemoth is this? Oh My God, it’s so huge!”<br/><br/>“Hiss, black hole. Those two space behemoths broke through a black hole and entered it. What… What kind of supernatural ability is this?”<br/><br/>At this time, when they arrived at the edge of the Milky Way, there were many more people around.<br/><br/>When Little Blue’s small house and the others appeared, everyone who saw them revealed shocked expressions.<br/><br/>That huge body, the power of the wilderness, it made people tremble.<br/><br/>“That huge beast looks like the one from the Immortal Palace’s pet auction, but it looks much bigger.”<br/><br/>Some great beings looked at that familiar figure and guessed doubtfully.<br/><br/>Therefore, very soon, the news of the appearance of the two gigantic space beasts that looked like universe knights in the Milky Way spread rapidly.<br/><br/>“Dragon King, we’re almost there!”<br/><br/>As they continued to travel through the starry sky, they were getting closer and closer to the base camp of the dragon-born race.<br/><br/>Prime Minister Gui looked at the map and said to Wang Xian.<br/><br/>“Enter their base camp directly and destroy the two universe knights of the dragon-born race.”<br/><br/>Wang Xian ordered with a cold look in his eyes.<br/><br/>“Wu Wu Wu!”<br/><br/>Xiao Lan heard Wang Xian’s order and another black hole appeared in front of him.<br/><br/>He went down directly.<br/><br/>“Ka Ka Ka!”<br/><br/>The next moment, they appeared in the sky above a huge mountain range.<br/><br/>However, the moment they appeared, a dark energy emitted a loud sound in the surrounding void space and landed on Xiao Lan’s body.<br/><br/>Xiao Lan’s body trembled slightly and the power of the Law of darkness collapsed immediately.<br/><br/>“Woo Woo Woo!”<br/><br/>He let out an angry roar and a wave of wild power rushed downwards.<br/><br/>The terrifying aura caused the entire space to change.<br/><br/>“Dragon Palace, they are here to exterminate the entire clan!”<br/><br/>Wang Xian stared downwards and said coldly.\t\t\t\t\t\t</div>", "images": {}, "success": true}