{"id": 145, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15072191.html", "title": "Chapter 3136 - Chapter 3136: If You Don’T Seek Death, You Won’T Die?", "volume": 2, "volume_title": "Volume 2", "body": "<h1>Chapter 3136 - Chapter 3136: If You Don’T Seek Death, You Won’T Die?</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 3136: If you don’t seek death, you won’t die?<br/><br/>Just as everyone in the AI was discussing the dragon palace and the disciples of the nine swords race ridiculed the Dragon Palace, they didn’t know what had happened to the nine swords race and the dragon race.<br/><br/>But soon, another piece of information caused the entire Milky Way to boil.<br/><br/>The nine swords race and the dragon race simultaneously released information on the AI. They were going to deeply unite and form an alliance.<br/><br/>When this news came out, not only were the normal citizens shocked, even the other low level races were shocked.<br/><br/>The Dragon Race and the nine swords race were already the top low level races in the Milky Way.<br/><br/>The two of them were working together?<br/><br/>What were they trying to do?<br/><br/>“The Dragon Palace just released a statement telling the nine swords race and the Dragon Race to release the Asian Dragon immediately. Now, the Dragon Race and the nine swords race are working together. Are they working together to destroy the Dragon Palace?”<br/><br/>“It’s really possible. The response of nine swords and the dragon descendant is too fierce, isn’t it?”<br/><br/>“If the dragon descendant and nine swords join forces, how many forces in the Milky Way can withstand it? That Dragon Palace will have to pay the price for their arrogance.”<br/><br/>“It’s possible that the Dragon Palace will be destroyed. They’ve just arrived at the Milky Way and they’re already so arrogant.”<br/><br/>On the AI, countless people were discussing animatedly. Even the other universe elementary race disciples also joined in.<br/><br/>When this news spread out, another piece of news quickly spread out. This also confirmed everyone’s thoughts.<br/><br/>The Dragon Race and the nine sword race were all in a state of war. It was best to be on high alert.<br/><br/>When this news came out, everyone was in an uproar.<br/><br/>“Hahaha, that Dragon Palace must have died. They actually dared to be so arrogant to our dragon race. For hundreds of millions of years, no one has dared to be so arrogant to us.”<br/><br/>“It’s going to be a war, it’s going to be a war. Our nine swords race will unite with the Dragon Race to destroy the Dragon Palace.”<br/><br/>“They dare to be arrogant towards us, this is the end.”<br/><br/>After the disciples of the two races received this news, their first reaction was that their race was going to attack the Dragon Palace.<br/><br/>Therefore, they mocked the universe’s AI.<br/><br/>They mocked the arrogance of the Dragon Palace!<br/><br/>Mocking the Dragon Palace’s overestimation.<br/><br/>When the others saw this news, they were shocked.<br/><br/>“As expected of the Milky Way’s old low level universe race, they’re really strong.”<br/><br/>They muttered.<br/><br/>“Leader, the information on the universe’s AI isn’t right, should we announce, and those sub-dragons, how should we deal with them?”<br/><br/>At the same time, in the land of the nine swords race, some of the experts of the nine swords race saw the information on the AI and felt their hearts tremble.<br/><br/>They weren’t working together to destroy the Dragon Palace!<br/><br/>They had issued the highest alert not to start a war.<br/><br/>But to prevent the Dragon Palace from attacking!<br/><br/>If the Dragon Palace saw the information on the AI, would the Dragon Palace come to kill them?<br/><br/>“The matter of the Yalong?”<br/><br/>The eyes of the Patriarch of the nine swords race flashed, and he clenched his fist slightly. “The hatred has been established, and the Dragon Palace killed three of our supremacies. How can we give them the Yalong?”<br/><br/>The experts of the nine swords race nodded slightly.<br/><br/>The hatred between them and the Dragon Palace had been established.<br/><br/>Not to mention the matter of the crescent moon secret realm, just the three supremacies were killed, and they couldn’t live under the same sky anymore.<br/><br/>“Not good, patriarch, not good. Our Sky Sword Army was destroyed, and the experts of our Shadow Sword Army were also destroyed. At the life tablets, hundreds of thousands of life tablets were destroyed, and all of them were the disciples of each army.”<br/><br/>Suddenly, at this moment, an extremely panicked voice came from outside.<br/><br/>An old man walked in in panic, and shouted with a pale face.<br/><br/>“What?”<br/><br/>The nine-sword race’s clan leader, who was sitting on top of the Great Hall, had a drastic change in expression. He stood up abruptly with blood-red eyes.<br/><br/>“A few of our nine-sword race’s powerful legions have all been annihilated. They were all killed silently.”<br/><br/>“There are hundreds of thousands of disciples’life tablets shattered at the place where our race placed our life tablets. All of them are divine emperor level disciples.”<br/><br/>The old man who came to report said with a panicked expression.<br/><br/>The Sky Sword Legion and the Shadow Sword Legion were the secret legions of the nine-sword race. They were also the strongest legions of the nine-sword race.<br/><br/>Now that they were all annihilated all of a sudden, this was definitely the action of a great being at the universe knight level.<br/><br/>Moreover, with the strength of the two legions, this was definitely not the action of a universe knight.<br/><br/>If the elite legions were destroyed, the losses would be equally terrifying. These disciples were their elites and their core.<br/><br/>They were their main force.<br/><br/>Now that they were destroyed, it was enough to cause the nine-blade race to be severely injured.<br/><br/>“Do you know who did it?”<br/><br/>The nine-blade race leader’s face turned pale as he asked.<br/><br/>“No… no idea. It should be the Dragon Palace. Only they have this power.”<br/><br/>The old man guessed.<br/><br/>Even without the old man’s answer, the clan leader of the nine swords clan also guessed that it was the Dragon Palace who had done it.<br/><br/>It could only be them.<br/><br/>He took a deep breath and closed his eyes slightly.<br/><br/>The positions of the two legions were very secretive. In fact, the venerable one was personally in charge of these two legions.<br/><br/>Only they could mobilize these two legions, and only they knew the specific dangers of these two legions.<br/><br/>It was obvious that the Dragon Palace had obtained some information from Star Sword Knight and the others.<br/><br/>He slowly opened his eyes and took out the universe AI to send a message to the leader of the dragon race.<br/><br/>In the end, he received the same message, and the dragon race was also attacked.<br/><br/>They suffered a terrifying attack, and hundreds of thousands of soldiers from the core army were killed.<br/><br/>When the nine swords race and the dragon race found out that the other party’s core army had been killed, they fell silent.<br/><br/>“Patriarch, the Dragon Palace has made a statement. The Dragon Palace will declare war on the nine-sword race and the dragon-descendant race. They will hunt down the disciples of the two races.”<br/><br/>At this moment, another piece of news came, which made the patriarch of the nine-sword race’s face change dramatically.<br/><br/>“F * ck, the Dragon Palace has declared war on the nine-sword race and the dragon-descendant race. Is it going to fight?”<br/><br/>“666, let’s not talk about anything else. The Dragon Palace is really fierce. The Dragon Race and the nine swords race have just joined forces to destroy them, and they have already declared war.”<br/><br/>“If they don’t seek death, they won’t die? It feels like the Dragon Palace is crazy to seek death!”<br/><br/>At the same time, on the AI, countless people saw another message from the Dragon Palace and became excited.<br/><br/>They started to eat the melons excitedly.<br/><br/>Speaking of which, it had been a long time since the Milky Way was this lively.<br/><br/>Some of the other primary races in the universe were also willing to sit back and watch the battle. At the same time, they could also see the true strength of the Dragon Palace.<br/><br/>After all, if a primary race suddenly appeared in the Milky Way, they would definitely take away some resources.<br/><br/>Now that they were fighting together, it was a good thing for the other primary races in the universe.<br/><br/>“If you don’t seek death, you won’t Die?”<br/><br/>In the Dragon Palace, Wang Xian looked at the information on the AI and the information sent by the Heaven Array. A cold expression appeared on his face.<br/><br/>He wanted to see who was seeking death.<br/><br/>He wanted to see how the two races would react.\t\t\t\t\t\t</div>", "images": {}, "success": true}