{"id": 143, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15072187.html", "title": "Chapter 3134 - Chapter 3134: 3133 Declared War", "volume": 2, "volume_title": "Volume 2", "body": "<h1>Chapter 3134 - Chapter 3134: 3133 Declared War</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 3134: 3133 declared war<br/><br/>“Boom! Boom! Boom!”<br/><br/>The Dragon Palace suppressed him and Wang Xian unleashed his speed to the maximum.<br/><br/>The formation of the Heaven Array landed.<br/><br/>The 20 other members of the Dragon Palace instantly unleashed their most terrifying attacks.<br/><br/>The entire world changed color.<br/><br/>“How can their Dragon Palace have so many terrifying universe knights? How is this possible!”<br/><br/>An unbelievable voice came out from the mouth of Star Sword Knight. Looking at the terrifying attacks, he could not react at all. He could only passively defend.<br/><br/>But defense could defend against a level 2 attack from a universe knight?<br/><br/>Defend against an attack from a Level 1 universe knight that was three times stronger than them?<br/><br/>“PFFT!”<br/><br/>When Wang Xian’s speed was unleashed to the extreme, it was comparable to a level 3 universe Knight’s speed. At such a distance, it was simply not something they could defend against.<br/><br/>Wang Xian appeared behind a universe knight and his dragon claws instantly entered his body.<br/><br/>“Cough, cough, no, no, no! I don’t want to Die!”<br/><br/>He roared in horror.<br/><br/>“What!”<br/><br/>“What a terrifying speed!”<br/><br/>At the side, the other six universe knights widened their eyes in shock.<br/><br/>How were they supposed to defend against such a terrifying speed?<br/><br/>“Peng!”<br/><br/>Wang Xian waved his arm and threw it toward the back.<br/><br/>“Peng!”<br/><br/>Ao qitian waved the ocean-pacifying needle in his hand and suppressed the almost-killed supremacy.<br/><br/>“Boom! Boom! Boom!”<br/><br/>At this moment, the rest of the people from the Dragon Palace had already launched their attacks.<br/><br/>Especially the formation of the Heaven Formation.<br/><br/>Just the strength of the Heaven Formation alone was enough to kill all of them.<br/><br/>The Dragon Palace had used all their strength this time. It was a huge favor to them.<br/><br/>“Defend!”<br/><br/>The remaining five universe knights trembled and tried their best to defend.<br/><br/>Sou Sou Sou<br/><br/>Before the attack arrived, the silhouettes of the Dragon Palace flew towards them.<br/><br/>Peng Peng Peng<br/><br/>In the next moment, they were completely covered by the energy.<br/><br/>Pu Pu Pu<br/><br/>The expressions of the five universe knights changed and they vomited blood.<br/><br/>“Save me, ancestor, save me!”<br/><br/>At this moment, an old man’s terrified and desperate scream came from the side.<br/><br/>“TSK TSK TSK, Old Man, how Dare You Mock Our Dragon Palace. I’ll serve you well from now on.”<br/><br/>Mo Sha’s ghastly voice sounded, and the black liquid on his body bound him.<br/><br/>The Old Man’s face was full of despair, and there was not a trace of blood on his face.<br/><br/>If he was killed directly, then he would die.<br/><br/>However, if he was controlled by that Knight from the Dragon Palace, it would be hard for him to imagine what kind of disaster he would have to face.<br/><br/>What kind of torture he would have to suffer.<br/><br/>The thought of a universe knight torturing himself was terrifying.<br/><br/>“Ah!”<br/><br/>However, at this moment, he heard a scream coming from the side.<br/><br/>He looked over again and saw two strange black and white shadows appearing behind their ancestor. The sharp thorns pierced through their bodies.<br/><br/>He widened his eyes and felt the vast energy around him. He slowly closed his eyes.<br/><br/>He knew that all of them were finished. They were completely finished.<br/><br/>Furthermore, their nine-sword race and dragon-descendant race would be facing an incomparably terrifying enemy in the future.<br/><br/>“Bang, Bang, Bang!”<br/><br/>The five universe knights at the side tried their best to escape. However, faced with the siege of the members of the Dragon Palace, one of the Universe Knights even had a powerful escape secret weapon. He was also defeated by Wang Xian’s law-based Divine Dragon, the Holy Dragon Shadow, it was instantly destroyed.<br/><br/>The Holy Dragon Shadow. A figure instantly appeared around it and trapped it. The Dragon Shadow could even attach itself to the enemy’s body and cause a fatal attack.<br/><br/>Before he could escape from the defensive circle, his body exploded.<br/><br/>Two minutes later, the five universe knights were suppressed and one universe knight was destroyed.<br/><br/>“No, don’t kill us. Don’t Kill Us. Our nine swords race is willing to compensate you. We will give all the inferior dragons to you.”<br/><br/>Seeing that Wang Xian and the rest didn’t kill them, the Star Sword Knight from the nine swords race had a hopeful look on his face. He begged for mercy with a pale face.<br/><br/>“Don’t you think it’s too late?”<br/><br/>Wang Xian glanced at them coldly with a hint of mockery on his face.<br/><br/>“It’s not too late, it’s not too late. We are willing to take out all our treasures. Don’t Kill Us, I beg of you.”<br/><br/>A Universe Knight from the Dragon Race begged for mercy.<br/><br/>“If we knew the power of the Dragon Palace, we wouldn’t dare to provoke you. Let Us Go, let us go.”<br/><br/>A universe knight beside him said loudly.<br/><br/>They were really scared now.<br/><br/>“Nine-sword race, Dragon Race, you’ve killed many disciples of our fairy dragon race. You Didn’t expect this day to come, did you?”<br/><br/>At this moment, Fairy Lingyuan walked over and glared at them with fury.<br/><br/>“Fairy Dragon Race.”<br/><br/>Star Sword Knight and the rest turned pale and stared at Fairy Lingyuan in disbelief.<br/><br/>Buzz<br/><br/>Wang Xian ignored their terrified expressions. He walked over and grabbed the head of a universe knight with his Dragon Claw, performing soul capture.<br/><br/>Buzz<br/><br/>“Summon your universe God country over.”<br/><br/>A voice that sounded like a loud bell rang in his mind. He nodded his head in a daze.<br/><br/>Very soon, a universe god country appeared at the side.<br/><br/>After the universe God country was summoned, Wang Xian absorbed some information and killed it with a slap of his arm.<br/><br/>“What did you do? What did you do to him? !”<br/><br/>At the side, Star Sword Knight and the rest looked at this scene in horror.<br/><br/>Wang Xian did not speak and followed the same pattern.<br/><br/>This made Star Sword Knight and the rest full of despair. Their bodies were trembling non-stop.<br/><br/>Twenty minutes later, five universe god countries were floating around.<br/><br/>Two thunder-attributed, two darkness-attributed and one fire-attributed.<br/><br/>The three-attributed God countries were devoured by the Dragon Palace.<br/><br/>“I have some information here. Ao Yaotian Array, AO qitian, you all go to the nine-sword race’s dragon-descendant race and annihilate their important legions.”<br/><br/>“Prime Minister Gui, release the information on the AI and order the two races to release all the inferior dragons immediately. Otherwise, you will have to bear the consequences.”<br/><br/>Wang Xian instructed the members of the Dragon Palace.<br/><br/>“Yes, Dragon King!”<br/><br/>Prime Minister Gui and the rest nodded. Their eyes gleamed coldly.<br/><br/>“Let’s move out.”<br/><br/>Wang Xian nodded. The members of the Dragon Palace immediately took action.<br/><br/>At this moment, in the Dragon Palace, Jiao Jiao looked at the group of powerhouses from the Dragon Palace who had killed six universe knights. She was extremely shocked.<br/><br/>They were universe knights, the universe knights who were high and mighty.<br/><br/>Now, they were all killed by the powerhouses from the Dragon Palace.<br/><br/>Was this the strength of the Dragon Palace?<br/><br/>Just as Jiao Jiao was in shock, a piece of information on the universe’s AI shook everyone.<br/><br/>The message was a strong statement from Prime Minister Gui:<br/><br/>Warning nine swords race, Dragon Race, you are to release all the sub-dragons you have captured immediately, or you will bear the consequences.<br/><br/>A simple statement, but it made everyone boil.\t\t\t\t\t\t</div>", "images": {}, "success": true}