{"id": 140, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15072181.html", "title": "Chapter 3131 - Chapter 3131: 3130 Was Furious", "volume": 2, "volume_title": "Volume 2", "body": "<h1>Chapter 3131 - Chapter 3131: 3130 Was Furious</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 3131: 3130 was furious<br/><br/>“Brother!”<br/><br/>At the bottom of the Milky Way, a woman with a dragon horn saw that her brother was enveloped by the pressure and had his chance to escape was interrupted. She broke down and shouted loudly.<br/><br/>“TSK TSK TSK, there are two more Asian Dragons.”<br/><br/>At this moment, she saw a figure quickly flying towards them.<br/><br/>Following that, her figure disappeared. When she reappeared, she had already returned to her divine kingdom.<br/><br/>“No, brother, brother!”<br/><br/>Sensing her God country, she hurriedly flew out. Beside her, it was her brother’s God country.<br/><br/>After she entered, she realized that there was no sign of her brother. Her face instantly turned pale.<br/><br/>“No, no, brother!”<br/><br/>She shook her head in despair. Her eyes could not stop flowing. But very quickly, she quickly wiped her tears, took out the universe AI, and crazily sent a message.<br/><br/>“Hahaha, this is already the 40th sub-dragon, it’s worth more than 10,000 years of harvest.”<br/><br/>At the same time, in the vicinity of the Milky Way volcano region, a middle-aged dragon race said with a face full of laughter, his face full of excitement.<br/><br/>Now, in just half a month, their dragon race had captured more than 40 sub-dragons.<br/><br/>In the Milky Way, the dragon race only had a chance to obtain one Asian dragon every few hundred years.<br/><br/>And one Asian dragon was of great use to them.<br/><br/>It could greatly improve their bloodlines. These Asian Dragons’bloodlines could be used to cultivate their core disciples. They might even be able to cultivate a son of heaven who could fight above his level, comparable to a dragon in heaven.<br/><br/>“And this is only the harvest of our dragon race, the nine blade race should have harvested quite a bit too. This time, the Dragon Palace has announced that they are protecting the ya long, and this is really a good thing for us.”<br/><br/>An old man beside him said with a smile.<br/><br/>“After we investigate the background of that Dragon Palace, after we destroy them, we will be able to obtain a large amount of dragon blood, and at that time, we will also have the Dragon Blood of a universe Knight.”<br/><br/>“With that Dragon Blood, our dragon race might be able to greatly improve. If that Dragon Palace has a pure-blooded dragon, our dragon race might be able to improve even further.”<br/><br/>The middle-aged man said with a smile.<br/><br/>“How can there be a pure-blooded dragon? In the entire universe, only the Great Beings of the dragon race who have reached the mid-level of the universe have a pure-blooded dragon. There shouldn’t be any other places.”<br/><br/>“There’s no need to think about pure-blooded dragons.”<br/><br/>The old man shook his head, “Let’s Go!”<br/><br/>“Yes!”<br/><br/>The middle-aged man nodded.<br/><br/>Beside them, the dragon-horned young man who was bound by them widened his eyes, his eyes filled with shock.<br/><br/>The Dragon Race wanted to destroy the Dragon Palace, and from their news, the nine blade race was also involved!<br/><br/>How could this be?<br/><br/>Despair appeared on the young man’s face.<br/><br/>Time passed bit by bit.<br/><br/>In the Dragon Palace, the bloodline of the Sky Halberd Dragon warrior dragon was dug out. With the huge amount of dragon blood, his strength had directly broken through to the combat strength of a level one universe knight.<br/><br/>And the Dragon Palace had an additional peak-level dragon seed.<br/><br/>Following that, ao Yacha and the others from the Dragon Defense Department entered the Dragon Transformation Pool excitedly to improve themselves.<br/><br/>Wang Xian watched from the side with a smile on his face.<br/><br/>The patrol force of the Dragon Palace was indeed the weakness of the Dragon Palace. After ao Yecha and the others evolved into the halberd dragon guards, the Dragon Palace had a huge upgrade.<br/><br/>“Dragon King, something has happened.”<br/><br/>At this moment, Prime Minister Gui walked over quickly with a frown!<br/><br/>“HMM? What Happened?”<br/><br/>Wang Xian frowned slightly when he saw Prime Minister Gui’s expression and asked.<br/><br/>“There’s a sub-dragon species that sent a large number of private messages to our Dragon Palace. There’s also a video on the universe’s AI. It caused quite a stir.”<br/><br/>As Prime Minister Gui spoke, he opened an image on the universe’s AI and presented it to Wang Xian.<br/><br/>A girl with a dragon horn on her head appeared in the image with an anxious and pale face.<br/><br/>“My brother and I wanted to join the Dragon Palace, but we encountered an attack from an expert midway. My Brother is now captured. I’m begging the experts of the Dragon Palace to help me save my brother. I’m begging the experts of the Dragon Palace…”<br/><br/>As the woman in the video spoke, she knelt on the ground with tears streaming down her face.<br/><br/>When Wang Xian saw the video, his face darkened immediately. His eyes were filled with killing intent.<br/><br/>“Dragon King, we can confirm that this woman is from the ya long lineage. She has sent many private messages to the Dragon Palace. She said that she was attacked when she was near the volcano region of the Dragon Palace.”<br/><br/>“It’s obvious that the other party is lying in wait for them there.”<br/><br/>Prime Minister Gui continued to speak to Wang Xian.<br/><br/>“Have you replied to her?”<br/><br/>Wang Xian asked with a sullen face.<br/><br/>“Dragon King, we have contacted that woman and received her reply.”<br/><br/>Prime Minister Gui replied.<br/><br/>“Contact her and ask her to tell us her location.”<br/><br/>Wang Xian narrowed his eyes slightly.<br/><br/>“It’s the Dragon King. I’m going to send someone to pick her up.”<br/><br/>Prime Minister Gui replied and pondered for a moment, he continued, “Dragon King, it has been more than half a month since we recruited the Asian Dragon. The matter of protecting the Asian dragon has been out for more than half a month. Now, not a single person with the Asian Dragon bloodline has come over. Something must have happened.”<br/><br/>“I suspect that someone is using the news of our Dragon Palace recruiting the Asian Dragon to capture the Asian Dragon.”<br/><br/>Wang Xian nodded his head. “After all, our dragon palace has already attained the strength of a primary race in the universe. The ones who dare to go against US should be those few forces.”<br/><br/>As he spoke, he already had a guess in his heart.<br/><br/>Before the Dragon Palace fully displayed its strength, the other primary races in the universe would not offend the Dragon Palace for the sake of some yalong.<br/><br/>If there were elementary races in the universe taking action, there would only be the dragon-descendant race and the nine-sword race.<br/><br/>The two races should have already known that they were from the Dragon Palace.<br/><br/>“Call Tiancheng, Ao Yao, Mou Zesen, and Ao Jian over. This time, I will go over personally.”<br/><br/>Wang Xian’s heart was filled with killing intent as he ordered Prime Minister Gui.<br/><br/>“It’s the Dragon King.”<br/><br/>Prime Minister Gui nodded his head.<br/><br/>Soon, the sky array, Ao Yao and the rest rushed over.<br/><br/>“Let’s go pick up someone and investigate.”<br/><br/>As he spoke, he moved his body and the few of them immediately flew out.<br/><br/>At the same time, the video of the woman caused an increasing sensation in the Milky Way.<br/><br/>“It can’t be? Someone is using the information of the Dragon Palace protecting the Asian dragon to capture the Asian Dragon. It’s obvious that they are going against the Dragon Palace!”<br/><br/>“F * ck, going against the Dragon Palace? The Dragon Palace is a low-level race in the universe. Even though their strength is unknown, they are able to sell so many battle angels. They shouldn’t be weak. Who would dare to be so audacious?”<br/><br/>“Could it be that another universe has touched a race?”<br/><br/>Under the video of the woman, there were all sorts of replies and guesses.<br/><br/>The Dragon Palace said that they wanted to protect the Asian dragons, but someone caught the Asian dragons around the volcanic region. This was a slap in the face to the Dragon Palace.<br/><br/>They were going to become mortal enemies with the Dragon Palace!\t\t\t\t\t\t</div>", "images": {}, "success": true}