{"id": 144, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15072189.html", "title": "Chapter 3135 - Chapter 3135: 3134 Declared War", "volume": 2, "volume_title": "Volume 2", "body": "<h1>Chapter 3135 - Chapter 3135: 3134 Declared War</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 3135: 3134 declared war<br/><br/>“Damn, not only are the nine blade race hunting the Asian Dragon, there are also the Dragon Race?”<br/><br/>“This… is the Dragon Palace so arrogant? They actually let the nine blade race and the dragon race release them immediately? How much confidence does they have?”<br/><br/>“The Dragon Palace is actually so powerful? These are the nine blade race and the dragon race, the two great races!”<br/><br/>On the universe’s AI, when everyone saw the statement made by the Dragon Palace, they were stunned.<br/><br/>The dragon descendant race and the nine sword race, in the Milky Way, were both powerful races with deep foundations. Their strength was abnormally terrifying.<br/><br/>Now, the Dragon Palace actually made such a statement. They didn’t put the two races in their eyes at all and even used an order tone?<br/><br/>Some people were also surprised. Why did the Dragon Race and the nine swords race deliberately go against the Dragon Palace and hunt the Asian Dragon?<br/><br/>Was it because they knew the strength of the Dragon Palace? Did they think the Dragon Palace was easy to bully?<br/><br/>Or was it because of other reasons?<br/><br/>“The small Dragon Palace wants to be arrogant with us, the dragon race. How dare they order US? hahaha!”<br/><br/>“They just came to the Milky Way, and they dare to call us the nine swords race and the Dragon Race? Who gave them the courage?”<br/><br/>“I think that Dragon Palace is courting death. If we join forces with nine swords, we can easily destroy the Dragon Palace.”<br/><br/>Especially the disciples of the Dragon Race and nine swords race.<br/><br/>As the two major races in the Milky Way, their territory was abnormally large, and the number of disciples was terrifying.<br/><br/>When the disciples of the two major races saw the information released by the Dragon Palace, their faces were full of coldness and mockery.<br/><br/>A Dragon Palace had just come to the Milky Way to establish a clan, and they were already warning them with such a tone. It was simply courting death.<br/><br/>The entire Milky Way region’s AI was discussing the Dragon Palace’s statement.<br/><br/>Most people felt that the dragon palace was too arrogant.<br/><br/>With the strength of the nine swords race and the dragon descendant race, how could a dragon palace that had just established itself in the Milky Way be comparable?<br/><br/>However, while everyone was discussing the arrogance of the Dragon Palace in the AI, the nine-blade race and the dragon race were in a complete panic.<br/><br/>At the nine-blade race, the leader of the nine-blade race, another old man, and all the Pinnacle God emperors of the nine-blade race were gathered together.<br/><br/>There was a hint of fear on their faces, and their expressions kept changing.<br/><br/>The nine-blade race had a total of five universe knights, and the leader of the nine-blade race was the most powerful one.<br/><br/>The leader of the nine-blade race wasn’t at level-two Universe Knight. He was now at level-one Universe Knight.<br/><br/>However, he had once obtained a huge opportunity, and a powerful godly sword had entered his body.<br/><br/>Now, he was a godly sword.<br/><br/>This allowed him to unleash the power of a level-two universe knight when he was only at level-one Universe Knight.<br/><br/>Against A Level 2 universe knight, he wasn’t weak at all.<br/><br/>The nine-sword race had five universe knights. However, just now, they received a piece of bad news.<br/><br/>The life tokens belonging to Star Sword Knight and the others had been shattered, including a bunch of Pinnacle God emperors.<br/><br/>The shattering of the life tokens represented complete annihilation.<br/><br/>This caused their faces to be filled with panic and fear.<br/><br/>To be able to directly destroy three universe knights, what kind of power was this?<br/><br/>And Star Sword Knight and the others had fallen in the Milky Way. When they thought of the Dragon Palace’s statement on the Universe AI, the result was self-evident.<br/><br/>It was the Dragon Palace’s doing!<br/><br/>The entire hall was deathly silent, and one could hear a pin drop.<br/><br/>They were all waiting for a piece of news.<br/><br/>“Clan leader, the Dragon Race has also sent news. They… Their Dragon Race’s universe knights have also fallen.”<br/><br/>At this time, an old man beside him looked at the information on the Universe AI, and his pupils contracted slightly. He shouted out involuntarily.<br/><br/>Nine Swords had lost three universe knights. Including the three knights from the dragon race, there were a total of six.<br/><br/>“They’ve all fallen. They don’t even have the chance to escape. There must be a Level 2 universe knight in Dragon Palace, and there might not only be one, or even two. Otherwise, they wouldn’t have all been left there.”<br/><br/>The nine-blade race’s body trembled slightly, and they clenched their fists. “The reason why Dragon Palace dares to be so arrogant in the universe ai is because they have enough power. It’s because they are not afraid of US two races.”<br/><br/>“I didn’t expect it, I really didn’t expect it…”<br/><br/>He muttered softly.<br/><br/>He had never expected dragon palace to be so terrifying. He had never expected that three universe knights would die in the nine-blade race.<br/><br/>They were universe knights. The loss of three universe knights had weakened their powers by 30 percent.<br/><br/>This was a huge loss.<br/><br/>The loss of three universe knights had completely offended a powerful race, the Dragon Palace.<br/><br/>There might be trouble ahead.<br/><br/>“Leader, there’s news from the dragon race. The leader wants to talk to you.”<br/><br/>At this moment, the old man beside him said.<br/><br/>The nine blade race had lost three knights, and the Dragon Race had lost three as well. If they included the one from not long ago, they had lost four knights in a short time.<br/><br/>Although the dragon race was strong, they were not much stronger than the nine blade race!<br/><br/>They could not withstand the loss of four knights.<br/><br/>“OK, I’ll contact them!”<br/><br/>The nine blade race leader took out the universe AI and waved his arm forward.<br/><br/>Weng<br/><br/>Slowly, a black mist appeared in front of them, the nine blade race didn’t stop it.<br/><br/>The black mist condensed into a tall and sturdy old man, the old man held the dragon bone scepter, his expression was majestic.<br/><br/>But his expression was extremely ugly.<br/><br/>“The power of the Dragon Palace has exceeded our expectations.”<br/><br/>The dragon race condensed from the Black Fog said with a gloomy expression.<br/><br/>“This time, we are in big trouble.”<br/><br/>The nine-blade race slowly stood up and sighed.<br/><br/>The dragon race leader condensed from the Black Fog fell silent.<br/><br/>They had never dreamed that six universe knights would actually fall around the Dragon Palace volcano region.<br/><br/>“That Dragon Palace’s power shouldn’t be enough to destroy us. If they really had the power to suppress us, they wouldn’t have warned us on the AI. Instead, they would have attacked us directly.”<br/><br/>A few seconds later, the Dragon Clan leader condensed from the Black Fog said.<br/><br/>“Dragon Clan leader, let’s work together. At this time, we can only work together to deal with that Dragon Palace and even… Take Revenge!”<br/><br/>The clan leader of the nine swords clan stared at him and clenched his fists.<br/><br/>“Okay!”<br/><br/>The clan leader of the Dragon Race agreed without any hesitation.<br/><br/>“Immediately announce on the AI that our nine swords clan will work closely with the dragon race and work together!”<br/><br/>“Inform all the disciples that the nine swords clan is preparing for battle!”<br/><br/>The clan leader of the nine-sword race immediately ordered.<br/><br/>“Yes, clan leader!”<br/><br/>The disciples at the side immediately carried out the order.<br/><br/>“We, the dragon-born race, will issue the same statement. In addition, I suggest that we open up the teleportation array of our two races.”<br/><br/>The clan leader of the dragon-born race said with sparkling eyes.<br/><br/>“Yes!”<br/><br/>The clan leader of the nine-sword race nodded. By opening up the teleportation array, they could quickly support each other.<br/><br/>They were already afraid of the Dragon Palace.\t\t\t\t\t\t</div>", "images": {}, "success": true}