{"id": 148, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15072197.html", "title": "Chapter 3139 - Chapter 3139: 3138 Dragon Palace Came Here To Exterminate The Dragon Race", "volume": 2, "volume_title": "Volume 2", "body": "<h1>Chapter 3139 - Chapter 3139: 3138 Dragon Palace Came Here To Exterminate The Dragon Race</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 3139: 3138 Dragon Palace came here to exterminate the dragon race<br/><br/>“Dragon Palace, come here to exterminate the Dragon Race!”<br/><br/>A cold and dignified voice sounded in the mountain base of the dragon race.<br/><br/>The sudden appearance of the Little Blue House attracted everyone’s attention.<br/><br/>Their appearance immediately alerted the entire dragon race.<br/><br/>“What?”<br/><br/>“The Dragon clan is here to exterminate the entire clan? The Dragon Clan is here to attack us?”<br/><br/>“Look up! are those the two space beasts of the Dragon Clan?”<br/><br/>Below them was the base camp of the Dragon Clan.<br/><br/>When the disciples below saw the space beasts, they were shocked.<br/><br/>“All members of the Dragon Clan, prepare to attack!”<br/><br/>Wang Xian shouted and ordered.<br/><br/>Boom! Boom! Boom<br/><br/>The next moment, the 500,000 members of the Dragon Palace from Xiao Lan’s little house flew down.<br/><br/>They did not hesitate at all. Streams of powerful energy blasted downwards.<br/><br/>Wang Xian waved his arm and the crescent moon rose into the sky. Images appeared in front of him.<br/><br/>Combining with the information he obtained in his mind, his gaze landed on a mountain peak in front of him.<br/><br/>“Seal that place!”<br/><br/>He waved his arm.<br/><br/>“It’s the Dragon King!”<br/><br/>Sky Array, ao crab, and the others did not hesitate at all and immediately attacked that mountain peak.<br/><br/>“Oh no, the Dragon Palace is attacking!”<br/><br/>“Damn it, the dragon palace actually dares to attack our dragon race and even attacked our Dragon Mountain. They really think we are easy to bully.”<br/><br/>A powerful energy descended from the ground toward the mountain. All the disciples of the Dragon Clan turned pale and quickly dodged to the side.<br/><br/>Buzz<br/><br/>At this moment, on the mountain in the middle of the Dragon Mountain, the Patriarch of the Dragon Clan and two old men moved and instantly appeared in a large hall at the top of the mountain.<br/><br/>They stood in the hall and looked around with embarrassed expressions.<br/><br/>“The Dragon Palace is attacking us. They are attacking us!”<br/><br/>The leader of the Dragon Race looked furious. He looked at the Great Beings from the Dragon Palace who were attacking them, and his eyes were cold.<br/><br/>“Activate the Defense Array!”<br/><br/>“Activate Dragon Mountain!”<br/><br/>“We have been standing in the universe for hundreds of millions of years. How can we be so easy to bully?”<br/><br/>“Dragon Palace? Do you really think you can destroy us? Kill, Kill, Kill!”<br/><br/>A Universe Knight of the Dragon Race Stared at the sky and roared furiously.<br/><br/>“Inform the nine-blade race to come over and support us. If we are destroyed, the Dragon Palace will definitely attack the nine-blade race.”<br/><br/>Another universe knight roared with a gloomy face.<br/><br/>They had never thought that the Dragon Palace would attack them.<br/><br/>According to their guess, the Dragon Palace wasn’t strong enough to invade them.<br/><br/>But now, the Army of the Dragon Palace had arrived.<br/><br/>However, the dragon race had been standing for billions of years, and they weren’t weak either.<br/><br/>They weren’t without foundation.<br/><br/>Especially their base camp, which had been built into an iron wall after billions of years of operation.<br/><br/>“Dragon Mountain, move!”<br/><br/>“Go out and fight!”<br/><br/>The leader of the Dragon Race roared coldly.<br/><br/>He moved and instantly appeared outside the palace.<br/><br/>“All Disciples of the dragon race, face the enemy. All experts, organize the battle!”<br/><br/>“Dragon Palace, our Dragon Race has established the universe for so long. How can we be destroyed so easily? Today, we will make you pay the price!”<br/><br/>The leader of the dragon race shouted and stared coldly at the sky array ao crab and the others.<br/><br/>Feeling their power, his pupils shrank.<br/><br/>“Two level two knights?”<br/><br/>He focused his eyes and shouted again, “Dragon Mountain, Rise!”<br/><br/>Rumble<br/><br/>Roar! Roar! Roar<br/><br/>The entire mountain range let out a loud noise.<br/><br/>The incomparably huge mountain range actually slowly rose up, and waves of terrifying power flew out from the mountain range.<br/><br/>In front of them, a mountain peak that looked like a dragon’s head raised its head and stared at the sky array ao crab and the others.<br/><br/>The entire mountain range seemed to have survived.<br/><br/>“Rumble!”<br/><br/>The mountain range that was over 10,000 kilometers in length directly attacked the sky array ao crab.<br/><br/>“Roar! Roar! Roar!”<br/><br/>“Let us pay the price. You Don’t have the right to do so. You dragon-descent race actually dare to chase after our Dragon King and kill the Asian Dragon. Today, we will make you disappear from the universe.”<br/><br/>The sky array looked at the mountain range that was emitting a terrifying power, and a cold expression appeared in his eyes.<br/><br/>He waved his arm, and a vast array formation was formed.<br/><br/>Ao he turned into a devouring dragon and attacked the leader of the Dragon Race.<br/><br/>“HMPH, you want to destroy us? Today, I’ll show you all the power of the Dragon Race!”<br/><br/>The leader of the Dragon Race moved and flew to the head of the mountain range. His eyes were filled with killing intent.<br/><br/>He held the dragon bone scepter and waved it at Ao he. “Two level 2 knights from Your Dragon Palace? You want to destroy us? Dream On!”<br/><br/>Hong<br/><br/>Within the Dragon Bone Scepter, a blood mist condensed into the shape of a godly dragon and attacked ao crab.<br/><br/>“Two?”<br/><br/>“Roar!”<br/><br/>Ao Crab’s eyes revealed a look of mockery. His body shook and roars came from within his body.<br/><br/>Three devouring dragons that were almost the same size as him flew out from his body.<br/><br/>Roar<br/><br/>One of the devouring dragons looked at the godly dragon formed by the blood mist and waved its terrifying claws.<br/><br/>Hong<br/><br/>The blood mist dissipated.<br/><br/>“Puny Ones, kill him!”<br/><br/>Ao Crab Laughed Sinisterly and roared loudly, attacking the leader of the dragon race.<br/><br/>Around him, three devouring dragons stood on both sides, exuding an overwhelming power.<br/><br/>“What? Four universe knights at level two!”<br/><br/>Seeing the swallowing dragons that suddenly flew out of Ao crab’s body, the face of the leader of the dragon race changed drastically.<br/><br/>“No wonder they dared to invade our dragon race. So they have five universe knights at level two.”<br/><br/>He looked very embarrassed. He waved his dragon bone, and the 10,000-mile-long mountain range below him shot out huge mountains and smashed toward them.<br/><br/>“Array formation, cleansing candle!”<br/><br/>At this moment, the Heaven Array Formation was formed behind them. A beam of light that contained the essence of everything swept forward.<br/><br/>The entire void was directly enveloped by a dazzling light.<br/><br/>“Damn it, that fellow is a powerful array formation master!”<br/><br/>His expression changed as the ten thousand li mountain range beneath him formed a defensive wall.<br/><br/>Weng<br/><br/>The light swept past, and the leader’s eyes revealed a trace of fear.<br/><br/>The enemy’s strength was beyond their imagination.<br/><br/>“Black Screen Formation, activate!”<br/><br/>At this time, a cold roar came from the side.<br/><br/>Black fog surged out from the mountains and spread towards the sky.<br/><br/>The black fog condensed into many wyverns that looked like vengeful spirits, and they covered everyone in the Dragon Palace.<br/><br/>The two remaining knights of the dragon race controlled the formation and glanced over at the leader with an awkward expression.\t\t\t\t\t\t</div>", "images": {}, "success": true}