{"id": 157, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15072215.html", "title": "Chapter 3148 - Chapter 3148: At The Hongmen Banquet In 3147", "volume": 2, "volume_title": "Volume 2", "body": "<h1>Chapter 3148 - Chapter 3148: At The Hongmen Banquet In 3147</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 3148: At the Hongmen banquet in 3147<br/><br/>The black robe covered all of his body. When he looked at his face, he couldn’t see any other faces apart from a blood-red or green glowing pupil.<br/><br/>“They are from the skeleton race.”<br/><br/>The surrounding people looked at them and whispered.<br/><br/>Wang Xian looked at the three figures covered in the black robe. His eyes were sparkling.<br/><br/>Among the three races that were about to be annihilated by the Dragon Palace, the dragon-descendant race had already been annihilated, and the nine-sword race had already fled.<br/><br/>Only the skeleton race was left.<br/><br/>The skeleton race was also one of the primary races in the universe that Wang Xian and the rest were the first to understand.<br/><br/>The Mohan clan race had been annihilated by the skeleton race.<br/><br/>Their strength was only inferior to, or even not weaker than, the foggy race.<br/><br/>When Wang Xian looked at them, the three members of the skeleton race also looked at them.<br/><br/>The pupils in the black robe were pulsating with light. There wasn’t a single trace of expression on their faces.<br/><br/>Wang Xian and the members of the skeleton clan sized them up. The other party didn’t say anything, and neither did he.<br/><br/>Everyone came to their respective seats and sat down.<br/><br/>“Dragon King, I can smell the scent of the Asian Dragon bloodline from the three black-robed skeletons.”<br/><br/>At this moment, Lei Ming, who was at the side, transmitted his voice to Wang Xian.<br/><br/>“Okay!”<br/><br/>Wang Xian nodded his head indiscernibly.<br/><br/>The skeleton race had once captured and killed the Asian dragon wantonly.<br/><br/>The surrounding universe knights could sense the subtle atmosphere between the skeleton race and Wang Xian. They were deep in thought.<br/><br/>“We should not go over. It seems that the skeleton race and the Dragon Palace are not on good terms.”<br/><br/>Beside them, the two elders looked at each other and said.<br/><br/>“In our Milky Way, nine swords, the dragon descendants and the skeleton race have openly hunted and killed the inferior dragons. The Dragon Palace Dragon King said when he killed the dragon descendants that those who hunted and killed the inferior dragons were the enemies of the Dragon Palace. Obviously, they have a conflict of interest.”<br/><br/>The two said slowly.<br/><br/>They were both primary races in the Milky Way universe, they knew some things.<br/><br/>The Yalong would naturally be beneficial to them if a few races hunted and killed the Yalong.<br/><br/>Now that the Dragon Palace had made such a statement, there would definitely be conflict.<br/><br/>Even if the conflict didn’t come out in the open, the two sides probably wouldn’t have much communication.<br/><br/>Not only them, many powers were also aware of this.<br/><br/>However, the skeleton clan had a relatively small number of people. Many races had never interacted with them, and some universe knights did not mind.<br/><br/>They continued to chat with Wang Xian, trying to leave a good impression on him.<br/><br/>Wang Xian and a few universe knights were perfunctory.<br/><br/>Not long after, more than a dozen figures flew over.<br/><br/>Everyone immediately looked over.<br/><br/>Two old men dressed in the ancient art sect’s uniform and more than a dozen people from the foggy race flew over.<br/><br/>The old man Wang Xian, who was the leader of the foggy race, had seen him before. He was the Red Fog Venerable.<br/><br/>“Thank you all for giving face to our ancient painting sect and gathering here.”<br/><br/>The two old men from the ancient painting sect cupped their hands and said faintly.<br/><br/>“You are too polite.”<br/><br/>“We will naturally come if the venerable from the Ancient Painting Sect invites us.”<br/><br/>The few venerables immediately replied politely.<br/><br/>The ancient painting sect was very powerful and far surpassed all the factions in the Milky Way.<br/><br/>This was publicly acknowledged.<br/><br/>Faced with the two venerable ones from the ancient painting sect, they were naturally polite.<br/><br/>Wang Xian sat there and watched indifferently without saying a word.<br/><br/>He had always been displeased with the ancient painting sect.<br/><br/>They were invited to the banquet, but the master only came out at the end. This was obvious that he didn’t value them.<br/><br/>“I’ve invited everyone here today for no other reason than to ask if you’ve seen the Vice Sect Master of Our Ancient Art Sect, venerable Lou Shan and the others.”<br/><br/>The two venerables of the ancient art sect swept their gaze across the crowd and said directly.<br/><br/>From the looks of it, they didn’t seem to have any intention of holding a banquet.<br/><br/>“Oh? Venerable Lou Shan?”<br/><br/>Everyone was shocked when they heard their words.<br/><br/>“What happened to Lou Shan Knight?”<br/><br/>A Universe Knight from the three-foot race asked curiously.<br/><br/>Red Mist Knight and the others also looked over in surprise.<br/><br/>Was this why the ancient art school invited all the powers to hold this banquet?<br/><br/>“Our Ancient Art School’s Lou Shan deputy sect leader and the others disappeared in the Milky Way, and there hasn’t been any news so far, so we came to look for them.”<br/><br/>The two shook their heads, “The life tablets are broken, I don’t know if something bad has really happened.”<br/><br/>“What? The life tablets are broken?”<br/><br/>“Lou Shan Knight and the others’life tablets are broken? Or is it in the Milky Way?”<br/><br/>“This…”<br/><br/>Even Red Fog Knight and the others were shocked, looking at the two knights of the ancient art sect in unison.<br/><br/>The life token broke, which meant death.<br/><br/>Even for a universe knight, once the life token broke, it meant that the original body had died.<br/><br/>Lou Shan Knight, the Vice Leader of the ancient art school, a Level 2 universe knight, had died.<br/><br/>And he had died on the Milky Way.<br/><br/>No wonder the ancient art school had invited all their races here.<br/><br/>“It was our last resort to gather all of you here. Please cooperate with us. After this, we will definitely come and apologize.”<br/><br/>An old man from the ancient art sect cupped his hands.<br/><br/>“I am the only venerable of our underwater mountain clan. It is impossible and impossible for me to do such a thing.”<br/><br/>The Patriarch of the Underwater Mountain clan shook his head.<br/><br/>“Venerable Lou Shan has fallen here. It is only right for the ancient art sect to look for information. Our Misty clan will cooperate with you.”<br/><br/>Venerable Red Mist hesitated for a moment and said.<br/><br/>“Thank you!”<br/><br/>An old man from an ancient painting sect responded. He waved his arm, and a drop of blood floated in the center of a white plate.<br/><br/>“This is a drop of venerable Lou Shan’s blood. Put it into a spiritual treasure. If we meet the murderer who killed Venerable Lou Shan, or if their auras are similar, we can use it to find out.”<br/><br/>As the old man spoke, the blood floated in the air above the white plate, and there was no movement at all.<br/><br/>“HMM? Do they suspect that it was done by the Milky Way?”<br/><br/>“Lou Shan the venerable is a level two universe knight. He was able to kill him without letting him escape. There are only three to four forces in the Milky Way that have the ability to do so.”<br/><br/>The group of elders from the elementary races in the universe discussed in a low voice.<br/><br/>“Hehe, we thought it was some kind of banquet. So it turns out that the ancient art sect is investigating us as the murderers.”<br/><br/>Wang Xian looked at the blood on the white disc and said with a hint of mockery.<br/><br/>“Dragon King, right? We had no choice. We have to find the person who killed our venerable Lou Shan. Please forgive us.”<br/><br/>A venerable from the ancient painting sect looked over and said with a twinkle in his eyes.<br/><br/>Wang Xian smiled faintly and didn’t say anything.<br/><br/>The disc rose and flew around.<br/><br/>Everyone looked around but didn’t say anything.<br/><br/>The ancient art sect was very powerful. Although they were a little dissatisfied with this action, they wouldn’t reject it.<br/><br/>The foggy race and the skeleton race didn’t move either. They just watched quietly.\t\t\t\t\t\t</div>", "images": {}, "success": true}