{"id": 150, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15072201.html", "title": "Chapter 3141 - Chapter 3141: 3140 Nine Swords Escaped", "volume": 2, "volume_title": "Volume 2", "body": "<h1>Chapter 3141 - Chapter 3141: 3140 Nine Swords Escaped</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 3141: 3140 nine swords escaped<br/><br/>“The experts of the nine swords race are here!”<br/><br/>“The nine swords race is here to support us. F * ck, kill the intruders of the Dragon Palace.”<br/><br/>“Hahaha, Kill, Kill, Kill!”<br/><br/>When the experts of the dragon race heard the voice of the chief of the nine swords race, they were extremely excited.<br/><br/>Although the Dragon Palace was strong now, it was not strong enough to destroy them easily.<br/><br/>With the support of the nine swords race, they could definitely resist the attack of the Dragon Palace.<br/><br/>“Patriarch of the nine swords race, help me!”<br/><br/>The patriarch of the Dragon tribe heaved a heavy sigh of relief when he heard this voice.<br/><br/>He looked at the experts of the Dragon Palace in front of him with an embarrassed expression. His hair was somewhat white.<br/><br/>A part of the mountain beast under him had already collapsed. If they continued to fight, the entire mountain beast would collapse.<br/><br/>At that time, he would also be surrounded and killed by the Great Beings of Dragon Palace.<br/><br/>“Alright!”<br/><br/>The leader of the nine-blade race replied. His gaze swept over, and his pupils constricted.<br/><br/>“Five universe knights, level two beings.”<br/><br/>His heart sank, and his face was filled with fear. He moved and flew toward the leader of the dragon race.<br/><br/>He was like a sharp sword that cut through the sky, emitting a terrifying and dangerous aura.<br/><br/>“Humph, I didn’t expect that you nine swords would come here. Just in time, I will capture you two races in one go!”<br/><br/>Seeing the nine swords clan leader flying over, a cold expression appeared in the sky array’s eyes.<br/><br/>“Destroy our two races? Dragon Palace, don’t be arrogant.”<br/><br/>The Nine Swords clan leader roared with a gloomy face, and a dazzling divine sword covered in lightning shot out from his body.<br/><br/>“Huala!”<br/><br/>The Divine Sword left a mark and headed straight for the sky array.<br/><br/>The sky array had a serious expression on his face. He waved his hand and the array formations bombarded the sky array one by one.<br/><br/>“Boom!”<br/><br/>A violent collision sound was heard.<br/><br/>“Dragon King!”<br/><br/>On Xiao Lan’s body, prime minister turtle frowned slightly when he saw the experts of the nine swords clan coming.<br/><br/>“Do it!”<br/><br/>Wang Xian narrowed his eyes slightly and locked his gaze on the Universe Knight of the nine swords race.<br/><br/>As soon as he finished speaking, his figure disappeared instantly.<br/><br/>“Wu Wu Wu!”<br/><br/>Xiao Lan and the rest of the small house let out a low groan when they received the order.<br/><br/>A terrifying sound reverberated throughout the entire world.<br/><br/>Their incomparably huge bodies crashed directly towards the mountain peak below.<br/><br/>“Not good, brothers of nine swords, help us block these two terrifying space beasts!”<br/><br/>Below, the elders and protectors of the dragon-born race saw that Little Blue’s small house had started to move. Their expressions changed slightly, and they immediately shouted at all the great beings of the nine swords race.<br/><br/>“You want us to deal with two universe Knight Level Space Beasts?”<br/><br/>The million great beings of the nine swords race looked over, and their expressions changed slightly.<br/><br/>“Attack and stop them.”<br/><br/>However, the Great Beings of the nine-blade race didn’t refuse. They had a universe knight, 30 pinnacle God Emperor Great Beings, and other elite disciples.<br/><br/>They could totally fight against two universe knights.<br/><br/>“Leave this one to me, and the rest to you.”<br/><br/>The Level One universe Knight of the nine-blade race was surrounded by godly swords, and he stared at little blue coldly.<br/><br/>Clang! Clang! Clang! Clang<br/><br/>He waved his arm and countless godly swords appeared in the sky. They covered Xiao Lan and attacked her directly.<br/><br/>Huala<br/><br/>Pu<br/><br/>“It’s not your turn to die yet, and you are here to court death?”<br/><br/>Suddenly, the body of the Level 1 universe knight from the nine swords race stiffened. He widened his eyes and was filled with shock.<br/><br/>Wang Xian’s figure appeared behind him and his dragon claws pierced through his body.<br/><br/>With his current speed, if a universe knight Level 1 was not fully prepared, he would definitely be killed instantly.<br/><br/>“Oh no, master soul sword has been killed.”<br/><br/>“Master Soul Sword!”<br/><br/>Wang Xian suddenly appeared behind a master and instantly killed him.<br/><br/>Not far away, the millions of masters of the nine swords race were slightly shocked. They were shocked when they saw this scene.<br/><br/>“How can this be!”<br/><br/>The nine-blade race had just arrived here and participated in the battle, yet a knight of their nine-blade race was killed in an instant?<br/><br/>This was their nine-blade Knight.<br/><br/>He was one of the only two knights left.<br/><br/>Weng<br/><br/>Seeing Soul Sword Knight’s corpse being put away, the bodies of all the nine-blade race members trembled and were on the verge of collapse.<br/><br/>A knight who had just arrived was instantly killed.<br/><br/>What about them?<br/><br/>At this time, there was a universe knight level 2 being hunting them, what was going on with the Dragon Race?<br/><br/>“Wu Wu Wu!”<br/><br/>At this time, Little Blue and little house suppressed them, that terrifying aura made them all tremble slightly.<br/><br/>“Attack, Attack!”<br/><br/>The faces of the nine blade race members changed drastically, shouting sternly.<br/><br/>Hong! Hong! Hong<br/><br/>In the next moment, terrifying attacks flew towards little blue and little house.<br/><br/>Their bodies gave off a grey energy and shook slightly.<br/><br/>Hong<br/><br/>Before the attacks landed on them, they turned into nothingness.<br/><br/>Little House and Little Blue were the pinnacle void beasts of the universe.<br/><br/>With their current strength, they could kill a Level 1 universe knight in a one-on-one fight.<br/><br/>How could they fight him.<br/><br/>“Not good, dragon-descendant race, come and help us!”<br/><br/>Seeing this, the leader of the sword group shouted in fear.<br/><br/>“Now!”<br/><br/>An elder of the dragon-descendant race who was commanding noticed the situation here and his heart trembled. He had a bad feeling.<br/><br/>However, at this time, they couldn’t help.<br/><br/>“Immediately, my ass. All disciples of the nine-sword race, run!”<br/><br/>The leader of the sword group’s expression changed drastically as he shouted sternly.<br/><br/>Facing a supreme-level space beast, they didn’t have any time to hesitate.<br/><br/>Either they resisted, or everyone would die.<br/><br/>Not to mention, there was an existence beside them that could kill a supreme-being in an instant.<br/><br/>At this moment, he didn’t hesitate at all and directly gave the order to run.<br/><br/>At the same time, he waved his arm and a sword umbrella rose into the air. It enveloped all the disciples of the nine-sword race and created a space for them to avoid being interrupted.<br/><br/>The sword umbrella contained a powerful force. It was obviously a acquired Numinous Treasure.<br/><br/>Buzz! Buzz! Buzz<br/><br/>In the next moment, all the disciples of the nine-sword race escaped.<br/><br/>They escaped!<br/><br/>All of them escaped!<br/><br/>Wang Xian, who was not far away, looked at them with a stunned expression.<br/><br/>“F * ck!”<br/><br/>Some of the powerhouses from the dragon-descendant race swept their gaze across them. Their expressions were also abnormally ugly.<br/><br/>“Damn it, how could this be? There are still level 2 universe knights in the Dragon Palace who have yet to make a move?”<br/><br/>In the middle, the nine-sword clan leader saw the situation and sensed the death of Soul Sword Knight. His eyes instantly turned blood-red as he roared loudly.<br/><br/>“This…”<br/><br/>The leader of the Dragon Tribe looked over and his heart trembled violently.<br/><br/>“Both your tribes must be destroyed!”<br/><br/>Wang Xian looked at the leaders of the two tribes and said coldly.<br/><br/>After he finished speaking, he flew towards them.<br/><br/>“What a fast speed!”<br/><br/>Sensing Wang Xian’s terrifying speed, the leader of the Nine Swords clan clenched his fists tightly. His eyes sparkled.<br/><br/>Buzz<br/><br/>The next moment, his figure started to turn illusory.<br/><br/>The chief of the nine swords clan was about to escape as well.\t\t\t\t\t\t</div>", "images": {}, "success": true}