{"id": 158, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15072217.html", "title": "Chapter 3149 - Chapter 3149: 3148 Hongmen Banquet", "volume": 2, "volume_title": "Volume 2", "body": "<h1>Chapter 3149 - Chapter 3149: 3148 Hongmen Banquet</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 3149: 3148 hongmen banquet<br/><br/>“Buzz!”<br/><br/>The disc flew around everyone, but the drop of blood on it didn’t move at all.<br/><br/>The two venerables of the ancient painting sect frowned slightly.<br/><br/>“Maybe venerable Lou Shan encountered danger when he entered the Milky Way.”<br/><br/>Venerable Lou Shan saw it and said indifferently.<br/><br/>“Maybe.”<br/><br/>The two venerables of the ancient painting sect were also somewhat uncertain.<br/><br/>With the strength of their ancient painting sect, the Milky Way’s forces shouldn’t dare to kill Venerable Lou Shan.<br/><br/>Maybe they really did have an accident.<br/><br/>The two thought in their hearts.<br/><br/>“I’m really sorry, everyone, and thank you for your cooperation.”<br/><br/>The two cupped their hands and waved their arms, and fine food flew to the tables one after another.<br/><br/>“This is some food we brought, we apologize to everyone.”<br/><br/>The two venerables from the ancient art sect said with a smile.<br/><br/>The so-called delicacies were all high-grade spiritual herbs and fruits.<br/><br/>They could indeed be considered treasures if they were placed outside.<br/><br/>The group of universe venerables smiled faintly.<br/><br/>Wang Xian sat at the side and smiled faintly. He picked up a few food casually.<br/><br/>“This must be the Dragon King. I’ve heard a lot about you.”<br/><br/>The two from the ancient art sect didn’t find any problems, and the atmosphere eased up a lot.<br/><br/>Venerable Red Mist looked at Wang Xian and walked over with a smile. He cupped his hands.<br/><br/>“Venerable Red Mist, I’ve heard a lot about you.”<br/><br/>Wang Xian cupped his hands politely at Venerable Red Mist.<br/><br/>The two venerable from the ancient art sect looked at Wang Xian with a hint of curiosity in their eyes.<br/><br/>They were also curious about the force that had just destroyed an elementary race in the universe and scared away an elementary race in the universe.<br/><br/>Especially since it was a force with the bloodline of the Divine Dragon.<br/><br/>However, the two of them did not go forward to chat. The Dragon King was obviously dissatisfied with their actions.<br/><br/>There was no need for them to go over and curry favor with them.<br/><br/>After a brief conversation, the entire banquet ended.<br/><br/>“Goodbye, everyone. Come to the Dragon Palace as a guest when you are free.”<br/><br/>Wang Xian did not stay here for long. Other than getting to know the primary race of the universe, he did not gain anything else.<br/><br/>“Roar!”<br/><br/>At the side, Lei Ming’s body moved and immediately transformed into a ten-meter-long thunder dragon.<br/><br/>The Thunder was restrained and suspended in the air like a holy object.<br/><br/>Wang Xian’s body moved and flew directly to Lei Ming. He cupped his hands at them.<br/><br/>“Huh?”<br/><br/>“This is?”<br/><br/>When the Venerable Red Mist, the skeleton race, and the ancient art sect saw Lei Ming, their pupils contracted slightly and they revealed a shocked expression.<br/><br/>This was especially so for the three figures from the skeleton clan. They stared at Lei Ming’s pupils, which were throbbing non-stop.<br/><br/>Wang Xian swept his gaze across them and smiled. Lei Ming immediately flew towards the Dragon Palace.<br/><br/>“Is this a purebred divine dragon?”<br/><br/>A venerable from the ancient painting sect asked with a twinkle in his eyes.<br/><br/>“It has been rumored that there is a purebred divine dragon in the Dragon Palace. From the looks of it… is that the legendary lightning dragon?”<br/><br/>“It’s exactly the same as the legendary Lightning Dragon.”<br/><br/>Venerable Red Mist and the others whispered in shock.<br/><br/>Just by looking at the appearance of the Lightning Dragon, it was definitely not an ordinary sub-dragon.<br/><br/>“It feels even purer than the bloodline of the Heavenly Dragon Clan.”<br/><br/>A venerable from the ancient painting sect said indifferently.<br/><br/>“Let’s report this matter. Pure-blooded Dragon? It seems that the Dragon Palace has obtained a very powerful inheritance of the Dragon God.”<br/><br/>The two old men from the ancient painting sect said as they took out the universe’s AI and sent a message.<br/><br/>The three old men from the skeleton clan looked at each other from the side. They could see the fervor in each other’s eyes.<br/><br/>“Pure-blooded divine dragon. It’s definitely the legendary pure-blooded divine dragon.”<br/><br/>The voice of a machine came from the middle figure of the skeleton clan.<br/><br/>They had killed many sub-dragons, so they were very clear about the situation of the Divine Dragon’s bloodline.<br/><br/>At the beginning, they had noticed the thunder, but they weren’t sure.<br/><br/>But now, seeing it transform into a thunder dragon, the bloodline power in its body was definitely not an ordinary sub-dragon.<br/><br/>They were 80% sure that it was a purebred divine dragon.<br/><br/>How many more were there in the universe?<br/><br/>“If we baptize them with the pure-blooded dragon God’s bloodline, we…”<br/><br/>The skeleton knight on the right trembled, his eyes burning.<br/><br/>“The Dragon Palace is very powerful, it will be difficult for us to destroy them.”<br/><br/>The figure on the left said.<br/><br/>“If we knew, we would have joined forces with nine swords and the dragon descendants to destroy the Dragon Palace.”<br/><br/>The figure on the right shook his head regretfully.<br/><br/>“We must obtain the pure-blooded dragon God’s bloodline.”<br/><br/>The figure in the middle said firmly.<br/><br/>If they could obtain the pure-blooded dragon God’s bloodline, it would be a terrifying upgrade for them.<br/><br/>They would be able to turn into real dragon God skeletons.<br/><br/>“Contact the Patriarch of the nine swords race, and then contact the bloodthirsty race in the Milky Way.”<br/><br/>The figure in the middle said slowly.<br/><br/>“Bloodthirsty Race?”<br/><br/>The two figures of the skeleton race on the left and right paused slightly, their eyes flashing with a luster.<br/><br/>The bloodthirsty race didn’t originally belong to the Milky Way. Even now, they didn’t have any activities in the Milky Way.<br/><br/>But the skeleton race knew where the bloodthirsty race was.<br/><br/>They were hiding in a corner of the Milky Way.<br/><br/>The blood ruthless race and the ancient painting divine sect belonged to the same starry sky.<br/><br/>The blood ruthless race had once hunted the quasi-dragon crazily, but they met an opponent later.<br/><br/>The Heavenly Dragon Race.<br/><br/>The blood ruthless race was almost exterminated by the Heavenly Dragon Race. Then, they fled to the Milky Way to recuperate.<br/><br/>However, the blood ruthless race’s strength was still not to be underestimated.<br/><br/>The skeleton race, the blood ruthless race, and the nine swords race would definitely be able to destroy the Dragon Palace.<br/><br/>“Let’s go, we’ll discuss the details. With the current power of the Dragon Palace, as long as we can persuade the blood evil race, we can totally destroy them.”<br/><br/>The figure in the middle of the skeleton race said and slowly disappeared.<br/><br/>They were very clear about the power of the Dragon Palace. There were more than 20 universe knights and five or six level 2 knights.<br/><br/>This power was very strong, not much weaker than the skeleton race.<br/><br/>However, they were still confident that they could destroy the Dragon Palace.<br/><br/>…<br/><br/>“Dragon King, I can sense some malicious gazes from the skeleton clan. I can sense that they have the bloodline of the Divine Dragon.”<br/><br/>In the sky above the Milky Way, Lei Ming spoke to Wang Xian.<br/><br/>“I can sense it too. The skeleton clan. HMPH, let’s get ready to destroy them.”<br/><br/>Wang Xian’s eyes flashed with a cold look.<br/><br/>The skeleton race exuded some aura. Wang Xian and the rest could sense it.<br/><br/>It was a body made of Divine Dragon’s blood.<br/><br/>God knows how many Asian Dragons had died at their hands.<br/><br/>With the strength of the skeleton race, the Dragon Palace could completely destroy them.<br/><br/>However, what Wang Xian didn’t know was that when he was about to attack the skeleton race, the skeleton race was also preparing to destroy the Dragon Palace.<br/><br/>The storm rose again.\t\t\t\t\t\t</div>", "images": {}, "success": true}