{"id": 156, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15072213.html", "title": "Chapter 3147 - Chapter 3147: At The Hongmen Banquet", "volume": 2, "volume_title": "Volume 2", "body": "<h1>Chapter 3147 - Chapter 3147: At The Hongmen Banquet</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 3147: At the Hongmen banquet<br/><br/>At that time, due to the arrogance of venerable Lou Shan and the rest and the dragon seed of the Halberd Dragon Guard, Wang Xian and the rest killed him.<br/><br/>The Dragon Palace had already considered the consequences of killing the venerable of the ancient painting sect.<br/><br/>The ancient painting sect was very powerful. There were dozens of universe knights in the sect.<br/><br/>Furthermore, the sect had a level 3 universe knight.<br/><br/>With such power, they were stronger than the current Dragon Palace.<br/><br/>However, the ancient painting sect didn’t know who killed Luo Shan Knight.<br/><br/>But with the death of a powerful deputy sect leader, the ancient painting sect might have powerful treasures that could find some clues.<br/><br/>If they attended this banquet, it might be a banquet.<br/><br/>If they didn’t attend, the ancient painting sect would suspect the Dragon Palace even more.<br/><br/>After all, in the Milky Way, there weren’t many forces that could kill a level two universe knight.<br/><br/>The Dragon Palace had just exterminated the dragon race, so they obviously had the ability.<br/><br/>“How’s the situation on Lei Ming’s side?”<br/><br/>Wang Xian looked at Prime Minister Gui and asked.<br/><br/>“Dragon King, Lei Ming’s ability should be able to reach level three universe knight in the next few days.”<br/><br/>“As for being stronger, our Dragon Palace doesn’t have enough resources.”<br/><br/>Prime Minister Gui said.<br/><br/>“Alright, Lei Ming and I will go to the banquet in ten days.”<br/><br/>Wang Xian said directly.<br/><br/>“It’s the Dragon King!”<br/><br/>Prime Minister Gui nodded his head.<br/><br/>Wang Xian had the eight luminaries dragon scale which could conceal and change his aura. Lei Ming had just joined the Dragon Palace.<br/><br/>Even if they had some treasures, they wouldn’t be able to find out that the human dragon palace had killed him.<br/><br/>Time passed day by day.<br/><br/>The arrival of the two universe knights from the ancient painting sect didn’t attract much attention from the other races.<br/><br/>After the Dragon Palace responded to the goodwill of some forces on the AI, the Milky Way also calmed down.<br/><br/>Rumble<br/><br/>Crackle<br/><br/>Five days later, in the sky above the dragon transformation pool, a lightning dragon swayed its huge body and emitted a terrifying power of lightning punishment.<br/><br/>The Thunder and lightning flashed in the sky above the dragon transformation pool and emitted a tremendous pressure.<br/><br/>Wang Xian’s figure moved and came to the front of the dragon transformation pool. He looked at Lei Ming and smiled.<br/><br/>The Thunder Dragon was a thunder dragon with the combat strength of a level three universe knight.<br/><br/>He was now the strongest combat strength member of the Dragon Palace.<br/><br/>“Greetings, Dragon King!”<br/><br/>Lei Ming flew to the front of Wang Xian and transformed into his human form. He knelt in front of him with a respectful expression and bowed excitedly.<br/><br/>“Get Up!”<br/><br/>“Let Prime Minister GUI show you around the Dragon Palace.”<br/><br/>Wang Xian nodded.<br/><br/>“Hehe, let’s go. You will be a part of the Dragon Palace from now on.”<br/><br/>Prime Minister Gui smiled and showed him around the Dragon Palace.<br/><br/>The addition and improvement of Lei Ming was a significant boost to the strength of the Dragon Palace.<br/><br/>While Lei Ming was improving, the Dragon Palace had also increased the combat strength of ten universe knights at the first level.<br/><br/>The resources of the dragon-descendant race were gradually depleted.<br/><br/>This time, half of the resources of the dragon-descendant race were used on Lei Ming.<br/><br/>Time passed day by day. The Dragon Palace destroyed the dragon-descendant race in a domineering manner. The goodwill of the primary races in the Milky Way also caused the other sub-dragon races in the Milky Way who were watching to rush towards the Dragon Palace.<br/><br/>In just a short span of 10 days, the Dragon Palace had added over 3,000 members.<br/><br/>“Lei Ming, get ready. Follow me out.”<br/><br/>On this day, Wang Xian had finished settling some matters in the Dragon Palace. He looked at the time and called Lei Ming over.<br/><br/>“It’s the Dragon King. I can set off at any time!”<br/><br/>Lei Ming replied respectfully.<br/><br/>“Alright, let’s go.”<br/><br/>Wang Xian nodded and flew out.<br/><br/>“Dragon King, I’ll take you with me.”<br/><br/>Lei Ming’s body moved and transformed into the body of a thunder dragon. He flew to Wang Xian.<br/><br/>Wang Xian smiled and nodded his head.<br/><br/>Lei Ming retracted the Thunder on his body and flew toward the edge of the Milky Way at a terrifying speed.<br/><br/>The Thunder Dragon, which could match the combat strength of a venerable at level three, was much faster than Wang Xian’s speed.<br/><br/>Its body size of over 10,000 meters shuttled through the Milky Way. It contained an incomparably terrifying pressure.<br/><br/>After more than ten hours, they arrived at the edge of the Milky Way.<br/><br/>“The time is just right. Let’s enter the continent ahead.”<br/><br/>Wang Xian looked at the time and pointed at the Wangyin continent ahead.<br/><br/>The Wangyin continent belonged to the foggy race and was also the base camp of the foggy race.<br/><br/>It was the largest continent beside the Milky Way.<br/><br/>This time, the place where the two experts from the ancient art sect held a banquet was within the Wangyin continent.<br/><br/>Lei Ming shrunk his body size to about ten meters. His huge body swayed as he carried Wang Xian and continued to fly forward.<br/><br/>“Eh? What’s that? Is that a divine dragon?”<br/><br/>“It’s exactly the same as the legendary divine dragon. Hiss, there’s someone up there.”<br/><br/>“It should be someone from the Dragon Palace. I heard that a big faction tens of thousands of light years away from us is hosting a banquet for all the major races here.”<br/><br/>When Lei Ming brought Wang Xian into the sky above the Wangyin continent.<br/><br/>When some people saw it, they were astonished and started to discuss.<br/><br/>“Over there. Let’s go over.”<br/><br/>Wang Xian looked at the map and instructed Lei Ming, who was located above a huge lake on the Wangyin continent.<br/><br/>Lei Ming’s gaze swept across the area below. He landed on a spot and flew straight over.<br/><br/>At this moment, beside the lake, it was decorated luxuriously. There were many elders chatting with smiles below.<br/><br/>With a glance, there were more than a dozen universe knights.<br/><br/>“The ancient painting sect is quite famous. Basically, all of them are here.”<br/><br/>Wang Xian looked over.<br/><br/>“Eh?”<br/><br/>“This is?”<br/><br/>When Wang Xian and the rest flew over, everyone below noticed them and looked over with sparkling eyes.<br/><br/>“It’s the people from the Dragon Palace!”<br/><br/>“That should be the Dragon King!”<br/><br/>“Is that a purebred divine dragon? It’s exactly the same as the legendary Divine Dragon.”<br/><br/>They looked over and whispered.<br/><br/>A few elders came over to welcome them.<br/><br/>“This must be the Dragon King, right? Hello!”<br/><br/>A few elders at the level of universe knights came over and greeted them politely.<br/><br/>“Yes, Hello Everyone!”<br/><br/>Wang Xian landed on the ground and replied politely. Lei Ming, who was beside him, transformed into his human form.<br/><br/>“I’ve long heard of your great name, Dragon King. It’s my honor to meet you today.”<br/><br/>The few elders continued to smile as if they were flattering him.<br/><br/>“Are all the races from the Milky Way here this time? It’s a good opportunity to get to know all of you.”<br/><br/>Wang Xian smiled politely.<br/><br/>“Other than the foggy race, the skeleton race, and the two experts from the ancient painting sect, all the other races are here.”<br/><br/>A venerable from the water shadow race replied immediately.<br/><br/>“The people from the ancient painting sect aren’t here yet?”<br/><br/>Wang Xian raised his eyebrows. As the initiator of the banquet, he wasn’t here yet.<br/><br/>Hehe, as expected, he was still very arrogant.<br/><br/>“He should be here soon. Dragon King, come and sit.”<br/><br/>A few venerables invited him enthusiastically.<br/><br/>With the current strength of the Dragon Palace, it could definitely be ranked in the top three in the Milky Way.<br/><br/>Therefore, the venerables were also very enthusiastic and respectful.<br/><br/>“Alright, thank you, everyone.”<br/><br/>Wang Xian nodded and walked inside.<br/><br/>Buzz Buzz Buzz<br/><br/>At this moment, a few figures shrouded in black robes appeared at the side.<br/><br/>Wang Xian narrowed his eyes slightly and looked over immediately.\t\t\t\t\t\t</div>", "images": {}, "success": true}