{"id": 152, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15072205.html", "title": "Chapter 3143 - Chapter 3143: 3142 Was Exterminated. The Milky Way Was In A State Of Shock", "volume": 2, "volume_title": "Volume 2", "body": "<h1>Chapter 3143 - Chapter 3143: 3142 Was Exterminated. The Milky Way Was In A State Of Shock</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 3143: 3142 was exterminated. The Milky Way was in a state of shock<br/><br/>“No!”<br/><br/>The leader of the Dragon Race looked at the mountain beast in front of him as it started to crumble bit by bit. A look of despair appeared on his face.<br/><br/>The mountain beast was the strongest trump card of the dragon race.<br/><br/>The entire mountain beast had experienced countless generations of powerful dragon race experts pouring their blood into it.<br/><br/>It had already been over two billion years since it reached him.<br/><br/>Over two billion years, the mountain beast had become the strongest trump card of the dragon race.<br/><br/>It could completely fight against several level 2 universe knights.<br/><br/>It could even fight against level 3 universe beings.<br/><br/>However, the mountain beast actually slowly crumbled under the attacks of the members of Dragon Palace.<br/><br/>This caused the expression of the dragon race leader to slowly crumble.<br/><br/>The level two universe knights in the Dragon Palace were comparable to level three venerables.<br/><br/>“Dragon King, we don’t have a deep grudge against each other. Why do you want to exterminate our Dragon Race!”<br/><br/>The leader of the Dragon Race roared with a mournful face.<br/><br/>“You don’t have a deep grudge against each other? Sending the dragon-faced knight to ambush and kill me and killing the Asian dragon wantonly. This crime is enough to exterminate your race!”<br/><br/>“In the future, if there are forces that hunt the Asian dragon wantonly, they will be the enemies of our Dragon Palace.”<br/><br/>Wang Xian announced with a cold face.<br/><br/>Countless chains were rising around him. His eyes were filled with killing intent as he stared at the leader of the Dragon Race.<br/><br/>“Kill him!”<br/><br/>Wang Xian let out a low roar and attacked the leader of the dragon race.<br/><br/>Ao he and the devouring dragons swayed their huge and ferocious bodies as they charged forward.<br/><br/>The Heaven Formation set up a formation and began to seal and kill.<br/><br/>“I, Long Yun, am incompetent. I was unable to resist the enemy’s invasion. All My clansmen, flee. Remember, if one day I have enough strength, I must destroy the Dragon Palace.”<br/><br/>The Dragon Clan Leader’s eyes revealed his will to die as he roared with a ferocious expression.<br/><br/>“What?”<br/><br/>“Clan leader!”<br/><br/>“Not good!”<br/><br/>The expressions of all the surrounding dragon clan experts and disciples changed drastically when they heard their clan leader’s words.<br/><br/>Their eyes were filled with despair.<br/><br/>“Run, run, run! Everyone, run now!”<br/><br/>The hearts of the two universe knights of the dragon race trembled violently as they roared.<br/><br/>“Run, run quickly!”<br/><br/>“It’s over, our dragon race is finished!”<br/><br/>The eyes of all the great beings and disciples of the dragon race were blood-red. They lost all their fighting spirit instantly and ran back.<br/><br/>“You want to escape? It’s not that easy. Kill!”<br/><br/>Prime Minister Gui, who was commanding in the sky, had a cold look in his eyes.<br/><br/>He moved his body, and a huge turtle shell directly attacked the disciples of the Dragon Race.<br/><br/>“Kill!”<br/><br/>All the members of the Dragon Palace exploded with terrifying power and chased after them.<br/><br/>They were defeated like a mountain.<br/><br/>When the leader of the Dragon Race announced it, it meant the destruction of the entire dragon race.<br/><br/>“Lock onto the two universe knights. We can’t let them escape.”<br/><br/>The black screen formation gradually collapsed. In an instant, more than a dozen Dragon Palace Knights locked onto the two universe knights and charged over.<br/><br/>“Damn it, run!”<br/><br/>The two universe knights of the dragon race looked shocked and quickly ran away.<br/><br/>Pu<br/><br/>At this time, a black and white shadow suddenly appeared behind a universe knight, and its sharp claws instantly pierced through him.<br/><br/>“I’ll leave the other one to you!”<br/><br/>Ao Yao pierced through the body of a knight and said indifferently.<br/><br/>“Ao Yao, you’re looking down on us!”<br/><br/>Behind them, Mu Zesen and the others’unhappy voices could be heard.<br/><br/>Sou Sou Sou<br/><br/>The Deadly Arrow immediately locked onto another universe knight.<br/><br/>When that universe Knight sensed that his companion had been killed, he had a bad premonition.<br/><br/>He gritted his teeth, not daring to stop for even a moment, and flew forward desperately.<br/><br/>Sou Sou Sou Sou<br/><br/>But at this time, he sensed a great terror attack coming from behind.<br/><br/>He gripped the godly weapon in his hand tightly, and he had no choice but to turn his body to resist.<br/><br/>Hong<br/><br/>The arrow was blocked by his incomparably powerful energy, but around him, a few universe knights from Dragon Palace had already surrounded him.<br/><br/>“It’s over!”<br/><br/>Looking at the group of knights from Dragon Palace, his eyes revealed a deathly look.<br/><br/>“No!”<br/><br/>At this time, a desperate roar came from the side once again.<br/><br/>He looked over and saw their leader being grabbed by the Dragon King’s huge claws.<br/><br/>This made his body tremble. He closed his eyes helplessly and slowly let go of the godly weapon in his hand.<br/><br/>He lost all will to fight and gave up resisting.<br/><br/>Pu<br/><br/>An arrow entered his body and melted it.<br/><br/>“Our leader is dead, and the two knights are dead too!”<br/><br/>“Run, run!”<br/><br/>The death of the clan leader and the last two universe knights.<br/><br/>It caused all the disciples to panic.<br/><br/>They were fleeing even more crazily than before.<br/><br/>Below them, some ordinary disciples who did not participate in the battle were fleeing.<br/><br/>The entire dragon race was in chaos.<br/><br/>The sounds of fleeing, begging, and crying filled the air.<br/><br/>After killing the leader of the Dragon Race, Wang Xian scanned his surroundings indifferently and watched quietly as he floated in the air.<br/><br/>They were slaughtering the Asian dragons wantonly. Did they ever think that such a day would come?<br/><br/>They had brought this upon themselves!<br/><br/>A primary race of the universe was rapidly approaching its demise.<br/><br/>“We’re Here!”<br/><br/>At this moment, at the edge of Dragon Mountain, a three-foot race and two universe knights from the dragon race rushed over to check on the situation.<br/><br/>They were covered in metal armor and looked ahead.<br/><br/>“HM? The Dragon Race has collapsed? They were destroyed so quickly?”<br/><br/>“According to the records of our three-foot race, the Dragon Race has a very powerful guardian item. I didn’t expect it to be destroyed so quickly!”<br/><br/>“This speed is too fast. Look, third brother, there are so many universe knights in Dragon Palace, this…”<br/><br/>The two universe knights from the three-foot race looked over and revealed a shocked expression.<br/><br/>With a glance, there were more than 20 universe knights.<br/><br/>Such a number was simply terrifying.<br/><br/>“No wonder the Dragon Palace was able to exterminate the dragon-descendant race. This strength is definitely one of the best in our Milky Way, and the number of universe knights is the highest.”<br/><br/>One of the supremacies from the three-foot race mumbled.<br/><br/>“Huh?”<br/><br/>At this moment, Wang Xian, who was floating in the middle of the dragon race, sensed that someone was spying on them. He raised his eyebrows slightly and looked over immediately.<br/><br/>“Oh no, we have been discovered. That should be the Dragon King of the Dragon Palace!”<br/><br/>The two supremacies from the three-foot race felt Wang Xian’s gaze and their hearts pounded violently.<br/><br/>“Sir Dragon King, we were just passing by and came here out of curiosity. Please forgive us.”<br/><br/>The two of them looked at each other and immediately bowed to Wang Xian.<br/><br/>Wang Xian retracted his gaze and ignored them. With a wave of his arm, the crescent moon appeared in front of him and he looked at this world quietly.<br/><br/>More and more universe supremacies were rushing over from the surroundings of the dragon race.<br/><br/>When they saw this scene, their faces were filled with shock.\t\t\t\t\t\t</div>", "images": {}, "success": true}