{"id": 151, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15072203.html", "title": "Chapter 3142 - Chapter 3142: 3141 Was Exterminated, And The Milky Way Trembled", "volume": 2, "volume_title": "Volume 2", "body": "<h1>Chapter 3142 - Chapter 3142: 3141 Was Exterminated, And The Milky Way Trembled</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 3142: 3141 was exterminated, and the Milky Way trembled<br/><br/>“Nine swords clan leader!”<br/><br/>The figure of the nine swords clan leader started to turn illusory, and the face of the Dragon tribe leader changed drastically.<br/><br/>However, before he could react, the figure of the nine swords clan leader disappeared.<br/><br/>They escaped. Within a few minutes of the arrival of the nine swords clan, all of them had escaped.<br/><br/>Wang Xian had killed a universe knight of the nine swords clan by force, causing the nine swords clan to be terrified.<br/><br/>Out of the nine-sword race, four universe knights had been killed. Now, only the leader of the nine-sword race was left.<br/><br/>Furthermore, he knew that the strength of the Dragon Palace was more terrifying than they had imagined.<br/><br/>Including Wang Xian, there were a total of six level two universe knights. Six of them, a total of six.<br/><br/>This was not something they could fight against.<br/><br/>Not to mention the number of level one universe knights in the Dragon Palace was terrifying.<br/><br/>They could not fight against such a force.<br/><br/>He also knew the consequences of escaping. However, the nine swords clan leader had already made up his mind. After he returned, he would immediately lead his clansmen to escape and prevent the invasion of the Dragon Palace.<br/><br/>The dragon race was completely finished. Their nine swords clan could leave behind some kindling.<br/><br/>“Damn it!”<br/><br/>Seeing the nine swords clan leader escape, the Dragon clan leader’s heart trembled violently.<br/><br/>He looked at Wang Xian who was charging towards him with a look of fear in his eyes.<br/><br/>He swept his gaze across the surroundings. This time, the Dragon Tribe was doomed.<br/><br/>“Dragon Eyes Lock All Corners!”<br/><br/>Wang Xian’s cold voice rang out as chains began to seal the surroundings.<br/><br/>“Roar! Roar! Roar!”<br/><br/>Ao he and the rest raised their heads and let out furious roars. Four devouring dragons charged towards them.<br/><br/>The sky array was also set up immediately.<br/><br/>Even if the dragon-descendant race and the mountain beast beneath them were extremely powerful, they would still kill them today.<br/><br/>“Wu Wu!”<br/><br/>“Wu Wu!”<br/><br/>The situation around them changed drastically after little blue made his move.<br/><br/>They swayed their huge bodies and began to charge at the black screen array around them.<br/><br/>The entire array collapsed bit by bit.<br/><br/>In an instant, the dragon palace had the upper hand.<br/><br/>At the same time, the news of the Dragon Palace invading the dragon race had spread throughout the Milky Way.<br/><br/>The news came from the nine swords race and the dragon race.<br/><br/>When everyone heard the news, they were shocked.<br/><br/>“Hiss, what’s going on? The war has started? The Dragon Palace is attacking the Dragon Race? This… This is too fierce!”<br/><br/>“Attacking the dragon race directly? How Strong is the Dragon Palace?”<br/><br/>“The two void beasts are carrying the Dragon Palace to the Dragon Race? What’s the relationship between the Dragon Palace and the Immortal Palace’s War Pets?”<br/><br/>“I heard that the nine swords race is supporting the dragon race. What’s the situation now?”<br/><br/>“The dragon race has been standing in the Milky Way for billions of years. How could they be destroyed so easily? Moreover, they have the support of the nine swords race.”<br/><br/>The sudden outbreak of the war on the AI caused everyone to discuss.<br/><br/>Everyone was shocked by the strength and power of the Dragon Palace.<br/><br/>They had declared war a month ago, and now they were going to kill their way over.<br/><br/>How terrifying!<br/><br/>However, just as everyone was discussing, news suddenly came from the nine swords race.<br/><br/>The leader of the nine swords race announced that all the core disciples had returned to the race and were ready to escape to another void.<br/><br/>When everyone in the Milky Way received this news, their faces revealed an extremely shocked expression.<br/><br/>The nine swords race actually fled with their entire race?<br/><br/>What was going on?<br/><br/>“Could it be that the dragon race is going to be exterminated?”<br/><br/>“The nine swords race fled with their entire race, this… This is definitely an existence that can not be resisted. Didn’t they just go to support the Dragon Race? Could it be that the Dragon Palace’s strength is too terrifying? They are not a match for them?”<br/><br/>“That’s definitely the case, otherwise, how could they have left the place where they have been standing for billions of years?”<br/><br/>“What about the Dragon Race? Could it be that the dragon race is going to be destroyed?”<br/><br/>When they received this news, everyone was shocked beyond words.<br/><br/>Especially that group of universe elementary races and other domain level races.<br/><br/>If the Dragon Palace really destroyed the dragon race, that meant that the Dragon Palace’s strength was at the top of the Milky Way.<br/><br/>Such a powerful race, they had to make some preparations.<br/><br/>The universe races hesitated for a moment and immediately sent knight level beings to the dragon race to investigate the situation.<br/><br/>…<br/><br/>“Not good, not good, those two space beasts are too terrifying, there are too many Dragon Palace universe knights, our black screen array is about to completely collapse.”<br/><br/>At this time, in the position of the Dragon Race, two Dragon Race Universe Knights controlled the clan protection formation to attack the 10 or so universe knights of the Dragon Palace.<br/><br/>However at this time, with Little Blue’s small house joining in, the collapse of the black screen formation started to accelerate.<br/><br/>Once the black screen formation completely collapsed, the two of them would face the 10 or so universe knights of the Dragon Palace.<br/><br/>With their strength, they would be easily killed.<br/><br/>“The difference is too big, our dragon race can’t withstand it.”<br/><br/>A Universe Knight said with a pale face, full of cold sweat.<br/><br/>“No, no, no, stop them, stop them!”<br/><br/>At this time, a terrified voice came from the side.<br/><br/>A group of powerful beings of the dragon race used the dragon cannon to bombard the 500,000 members of the Dragon Palace.<br/><br/>However, all of a sudden, strange dark figures appeared around the dragon cannon.<br/><br/>Their strange figures quickly reaped the experts from the dragon-descendant race.<br/><br/>In particular, one of the strange figures at the supremacy level drew a black-and-white line, instantly killing tens of thousands of divine emperor experts.<br/><br/>It was unstoppable.<br/><br/>The Dragon Cannon was under threat. At the front, the powerful members of the Dragon Palace immediately broke through a line of defense of the dragon-descendant race.<br/><br/>With the Mad Dragon race as the leader, they charged into the army of the dragon race.<br/><br/>The head-on collision began.<br/><br/>However, in the front, the Dragon Palace had a knight level existence.<br/><br/>No matter how many dragon race members there were, they weren’t a match for the Knight of the Dragon Palace.<br/><br/>“There are too many universe knights in the Dragon Palace. It’s over, it’s over!”<br/><br/>The two Dragon Race Knights controlling the black screen array felt extremely dark.<br/><br/>They had already used the formation to pin down more than a dozen supremacies, but their defenses were still broken through.<br/><br/>One could imagine how terrifying the Dragon Palace was.<br/><br/>If it wasn’t for their base camp, their dragon race would have long been defeated.<br/><br/>Even so, they were only one step away from defeat.<br/><br/>“What should we do?”<br/><br/>The two looked at each other and immediately looked towards the center.<br/><br/>Rumble<br/><br/>Just as they looked over, there was a rumbling sound.<br/><br/>The huge body of the mountain beast started to crumble rapidly.<br/><br/>The mountain beast that they had used their powerful blood essence to build was finished.<br/><br/>Once the mountain beast crumbled, how could their leader be a match for the six level 2 universe Knights of the Dragon Palace?<br/><br/>“It’s over, our dragon race is completely finished.”\t\t\t\t\t\t</div>", "images": {}, "success": true}