{"id": 166, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15072233.html", "title": "Chapter 3157 - Chapter 3157: 3156 Dragon Skulls, Blood Dragon Vs Thunder Dragon", "volume": 2, "volume_title": "Volume 2", "body": "<h1>Chapter 3157 - Chapter 3157: 3156 Dragon Skulls, Blood Dragon Vs Thunder Dragon</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 3157: 3156 dragon skulls, blood dragon vs Thunder Dragon<br/><br/>“What!”<br/><br/>“Hiss, what’s going on?”<br/><br/>“That Dragon King’s speed is so fast!”<br/><br/>Wang Xian’s attack suddenly pushed his speed to the limit and instantly killed a level 2 universe knight.<br/><br/>This caused all the surrounding knights to show an extremely shocked expression.<br/><br/>The leader of the blood evil race swept his gaze over. The blood on his face was surging and was filled with fury.<br/><br/>His blood-red eyes were filled with traces of killing intent and fear.<br/><br/>“Be careful, that Dragon King’s speed is very fast!”<br/><br/>The leader of the nine swords race looked over and his heart sank. He reminded loudly.<br/><br/>None of them had expected that Wang Xian’s speed would be so terrifying.<br/><br/>They also didn’t expect that a Level 2 universe knight was killed on their side in such a short period of time.<br/><br/>This was a universe knight level 2 being, and they had a universe knight level 2 being on their side, and now he was killed by Dragon Palace Dragon King.<br/><br/>“Hiss, that Dragon Palace Dragon King is so powerful!”<br/><br/>“What terrifying speed.”<br/><br/>“That speed is a great counter to our mist race.”<br/><br/>The Knights of the universe primary races who were watching the battle all looked shocked.<br/><br/>Even Red Mist Knight’s pupils contracted.<br/><br/>They were shocked by Dragon Palace’s speed.<br/><br/>They were shocked. The war had just started and a knight had died, a level 2 knight.<br/><br/>Such a knight was one of the strongest in their race.<br/><br/>“No wonder he could kill Lou Shan and the others. His speed is terrifying.”<br/><br/>The two venerables from the ancient painting sect looked extremely gloomy when they saw this scene.<br/><br/>“Leave the Dragon King to me.”<br/><br/>The leader of the bloodthirsty tribe stared at Wang Xian and roared with a murderous look on his face. With a wave of his arm, the blood sea attacked him.<br/><br/>In the blood sea, claws were clawing at the leader of the bloodthirsty tribe.<br/><br/>“HMPH!”<br/><br/>Wang Xian squinted his eyes and snorted coldly. With a wave of his arm, the five elements grinding mill headed straight for the Sea of blood.<br/><br/>“Roar! Roar! Roar!”<br/><br/>At this moment, another heart-palpitating roar was heard.<br/><br/>“Crack! Crack!”<br/><br/>“Crack! Crack! Ah! Ah! Ah! Ah!”<br/><br/>At the side, a skeleton that was emitting a black glow was facing Lei Ming.<br/><br/>The skeleton race was good at close combat.<br/><br/>However, when he got close to Thunder, Thunder immediately turned into a dragon.<br/><br/>A 100-meter-tall Thunder Dragon appeared in front of the great being of the skeleton race.<br/><br/>Before he could react, thunder shook his body and released a terrifying thunder punishment.<br/><br/>His Dragon Claw grabbed the dark skeleton.<br/><br/>The terrifying thunder instantly entered the skeleton.<br/><br/>The power of a level 3 knight erupted.<br/><br/>Peng<br/><br/>He waved his dragon claw and threw the skeleton’s body in front of the Dragon Palace.<br/><br/>Roar<br/><br/>“With this little power, you dare to Invade Our Dragon Palace? You three races can all stay here today!”<br/><br/>Thunder roared with a face full of rage, and his thunder power was as if it was going to destroy the world.<br/><br/>He didn’t hesitate at all and directly attacked a universe knight in front of him.<br/><br/>“Damn it, that Thunder Dragon is a level three universe Knight!”<br/><br/>“We are not a match for a level three universe knight. Skeleton clan leader, where are your trump cards? Where are your trump cards!”<br/><br/>Suddenly, another level 2 skeleton knight from the skeleton clan was killed by Lei Ming. The nine blade clan leader widened his eyes and roared in shock.<br/><br/>There was actually a level 3 universe knight in Dragon Palace!<br/><br/>Dragon Palace killed another level 2 universe knight.<br/><br/>This…<br/><br/>The nine blade clan had come back this time to destroy Dragon Palace, not to be destroyed.<br/><br/>The surrounding universe knights trembled, their eyes filled with shock.<br/><br/>In such a short period of time, Dragon Palace had already destroyed two universe knights with level 2 combat strength.<br/><br/>More importantly, Dragon Palace had a level 3 universe knight.<br/><br/>“With a Level 3 universe knight holding the fort, it will be very difficult for the three races to destroy Dragon Palace. and looking at the situation, it’s hard to say who will be destroyed.”<br/><br/>Red Mist Knight muttered.<br/><br/>The other knights were filled with respect.<br/><br/>The power of the Dragon Palace was too strong.<br/><br/>“Damn Dragon Palace, you dare to kill a great being of our skeleton race.”<br/><br/>The golden skeleton clan leader saw a great being of his race being killed, and his body emitted rays of golden light.<br/><br/>“Skeleton clan leader, quickly take out all the trump cards of your race. If you are not a match for us, we will escape immediately.”<br/><br/>The Nine-blade clan was filled with fear.<br/><br/>He was also a Level 2 universe knight. If he was unlucky, he might die here.<br/><br/>He didn’t want to die.<br/><br/>“Shut up!”<br/><br/>The golden skeleton clan leader opened his mouth and roared.<br/><br/>“Hahaha, Godly Dragon Bloodline, Pure Thunder Dragon Bloodline. I want your bloodline.”<br/><br/>He roared crazily.<br/><br/>“Lord Dragon Skeleton, destroy them.”<br/><br/>He took out a black token, waved his arm, and the token flew directly into the skeleton island.<br/><br/>“Rumble!”<br/><br/>The token floated in the sky above the skeleton island, and a streak of darkness directly covered the ground below.<br/><br/>“Roar Roar Roar!”<br/><br/>A dragon’s roar came from inside the skeleton island.<br/><br/>Soon after, a gigantic skeleton in the form of a divine dragon flew out from within.<br/><br/>The area where his dragon head was located was made up of many blood-red skulls.<br/><br/>In the middle of the area, there was a 100-meter-large skull.<br/><br/>This skull possessed its own intelligence and was also the controller of the entire body.<br/><br/>“Pure Divine Dragon Bloodline!”<br/><br/>The Dragon Skull, which was about 5,000 meters long, emitted an aura that made everyone tremble. His gaze locked onto the Lightning Dragon as the ghostly flames in his eyes throbbed crazily.<br/><br/>“Is this the trump card of your skeleton clan?”<br/><br/>Wang Xian looked over and his pupils contracted slightly.<br/><br/>The dragon body of the entire dragon skull was completely no different from the divine dragon body.<br/><br/>The only difference was the dragon head. The skeleton clan had obtained the dragon bone of a divine dragon, but lacked the dragon head.<br/><br/>“Boom!”<br/><br/>The dragon skeleton’s body moved, and the law of darkness pervaded the surroundings. It brought with it a terrifying aura as it attacked Lei Ming.<br/><br/>“You think you can defeat me by borrowing the body of our Divine Dragon?”<br/><br/>Lei Ming sensed the aura of the dragon skeleton, and his eyes were filled with a cold expression. His body instantly became 10,000 meters in size, and he charged forward fearlessly.<br/><br/>Ka Ka Ka<br/><br/>“Blood Evil clan, the Pure Godly Dragon bloodline is right in front of you. Do you still have any reservations?”<br/><br/>The golden skeleton clan leader swept his gaze across and roared at the blood evil clan leader beside him.<br/><br/>“Trouble, didn’t your skeleton clan say that there are no level 3 knights in the Dragon Palace?”<br/><br/>The Blood Evil clan leader’s expression changed. He could feel his anger.<br/><br/>He moved his palm and dragon scales appeared in his hand.<br/><br/>“I’ll use the dragon scales of the god Dragon to transform into a blood dragon!”<br/><br/>The blood violence clan leader raised his head and howled, his entire body started to change.<br/><br/>The dragon scales in his hand covered his body.\t\t\t\t\t\t</div>", "images": {}, "success": true}