{"id": 162, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15072225.html", "title": "Chapter 3153 - Chapter 3153: 3,152 Outbreak: Three Clans Vs Dragon Palace 2", "volume": 2, "volume_title": "Volume 2", "body": "<h1>Chapter 3153 - Chapter 3153: 3,152 Outbreak: Three Clans Vs Dragon Palace 2</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 3153: 3,152 outbreak: three clans vs Dragon Palace 2<br/><br/>The Dragon Guard of the Dragon Palace had never participated in the War of the Dragon Palace.<br/><br/>They had always been at the bottom of the Dragon Palace and had never participated in any of the battles of the Dragon Palace.<br/><br/>This time, they had evolved into the halberd dragon guard and the real Dragon Guard. Finally, they could have a big battle.<br/><br/>This was their battle to prove themselves.<br/><br/>This caused all the members of the Dragon Defense Division to be filled with fighting spirit. They couldn’t wait for the war to break out immediately.<br/><br/>Wang Xian’s gaze swept across the members of the Dragon Defense Division who were full of fighting spirit. A smile appeared on his face.<br/><br/>The Imperial Dragon Seed had already formed a battle line at the front.<br/><br/>Ten Thousand Dragon Wizards were currently sitting cross-legged on the heaven display chessboard and setting up formations around them.<br/><br/>Currently, over 10,000 Dragon Wizards had the combat strength of a seventh level divine emperor. They were on the acquired spiritual treasure heaven display chessboard, and could unleash the combat strength of an eighth level divine emperor.<br/><br/>Currently, the Dragon Wizards were the strongest army in the Dragon Palace.<br/><br/>Because of the heaven display chessboard, the strength of all the members of the Dragon Wizard Army was unified.<br/><br/>Even the array formations they controlled were unified.<br/><br/>In order to control the heaven’s manifestation chessboard, a powerful acquired spiritual treasure.<br/><br/>All the arrow dragon species had already found their battle positions and were quietly waiting there.<br/><br/>Beside each arrow dragon species, there were also members of the Fire Hammer clan. They had forged powerful weapons.<br/><br/>The most powerful guarding godly weapons were the dragon cannons.<br/><br/>The dragon cannons they had obtained from the dragon descendants.<br/><br/>The dragon cannons had been modified by the fire hammer clan and were even more powerful.<br/><br/>If 100 dragon cannons were to hit a universe Knight Level 1 warrior, they would be able to kill him.<br/><br/>The Dragon Palace Knight level members flew around and taught the Dragon Palace members.<br/><br/>“I want to see how many universe knights there are in the skeleton clan and the other three races, as well as how many trump cards they have.”<br/><br/>Wang Xian stood in the center and stared ahead.<br/><br/>He waved his arm and the crescent moon hung in the sky. Everything within a radius of tens of billions of kilometers appeared in his line of sight.<br/><br/>The five elements millstone was floating quietly.<br/><br/>The Five Elements Millstone, which had devoured a bunch of acquired spiritual treasures, was now powerful enough to kill a level two universe knight.<br/><br/>Time passed bit by bit, and the skeleton island was getting closer and closer to the Dragon Palace.<br/><br/>On the AI of the Milky Way, everyone saw the Skeleton Island flying towards the Dragon Palace, and they could basically confirm that the skeleton race was going to attack the Dragon Palace.<br/><br/>The powerhouses of the low-level races of the universe also flew towards the Dragon Palace, ready to watch the battle.<br/><br/>The battle between the low-level races of the universe, involving 30 to 40 knights, was absolutely shocking.<br/><br/>“We’re within the range of the Dragon Palace. I can feel an energy covering us.”<br/><br/>More than 20 hours later, the huge Skeleton Island entered the volcano region.<br/><br/>At the center of the island, three figures stood in the center.<br/><br/>They represented nine swords, blood tyrant, and skeleton respectively.<br/><br/>Behind them were the disciples of the three races.<br/><br/>The disciples of the skeleton race were the most numerous.<br/><br/>This time, the skeleton race came out in full force, and even the skeleton island came with them.<br/><br/>Secondly, there were many disciples of the strange blood ruthless race. They were like half of a liquid, condensed into various shapes, and filled with the smell of blood.<br/><br/>All the experts of the nine swords race came this time.<br/><br/>The three big clans had used all their strength.<br/><br/>“The Dragon Palace should have known that we were coming. Hehe, they won’t run away.”<br/><br/>The golden skeleton clan leader said faintly and looked at the blood evil clan. “They don’t know about the existence of the blood evil clan.”<br/><br/>“Hehe, get ready to fight. We will distribute the spoils according to our battle achievements later.”<br/><br/>The clan leader of the bloodthirsty clan said lightly.<br/><br/>“It is rumored that the Dragon Palace doesn’t only have one pure-blooded divine dragon.”<br/><br/>The clan leader of the nine swords clan said. He licked his tongue, his eyes filled with malevolence and excitement.<br/><br/>He was very familiar with the strength they used this time.<br/><br/>He was sure that this terrifying strength could destroy any power in the Milky Way.<br/><br/>Even if the dragon palace was very strong, they would be able to face it with 100% certainty.<br/><br/>Not to mention that the skeleton clan still had a powerful trump card that they had not revealed.<br/><br/>“All members of the skeleton clan, get ready.”<br/><br/>The golden skeleton clan leader shouted in a mechanical voice.<br/><br/>“Ka Ka Ka!”<br/><br/>All the members of the skeleton clan gripped the divine weapons in their hands tightly, their killing intent fierce.<br/><br/>“Rumble!”<br/><br/>At this moment, the entire Skeleton Island also let out a roar. The surrounding Milky Way water instantly evaporated.<br/><br/>Within a radius of several billion kilometers, all the Milky Way water surged towards the surroundings, forming a vacuum.<br/><br/>The Milky Way water surged towards the surroundings until the bottom of the Milky Way was revealed.<br/><br/>Wherever the enormous skeleton island went, the Milky Way water directly surged towards the surroundings.<br/><br/>The area outside caused huge tsunamis and waves.<br/><br/>“It’s Here!”<br/><br/>At the position of the Dragon Palace, sensing the changes ahead, all the members of the Dragon Palace narrowed their eyes slightly.<br/><br/>Wang Xian’s body moved and flew straight to the area ahead, floating in the air.<br/><br/>“Roar!”<br/><br/>“Roar!”<br/><br/>Nine Wind God Dragons flew out from the surroundings, their eyes flashing with a cold expression.<br/><br/>Right now, they had the power of a universe knight at level one.<br/><br/>Lei Ming immediately followed behind.<br/><br/>Guan Shuqing, Feng Luan, and the other girls followed closely, their faces filled with killing intent.<br/><br/>They stared ahead coldly.<br/><br/>Hong Long Long<br/><br/>A loud noise came from the skeleton island, and slowly, it appeared in the sight of the members of the Dragon Palace.<br/><br/>In front of them was the front half of the Skeleton Island which was formed by countless skulls. It was filled with panic and blood.<br/><br/>Above them, the chief of the nine swords race, the chief of the skeleton race, and the chief of the bloodthirsty race were looking at the Dragon Palace from a high vantage point.<br/><br/>“What race are they from?”<br/><br/>Wang Xian looked at the existence that was filled with blood and said coldly.<br/><br/>“I’ve never seen it before.”<br/><br/>Prime Minister Gui and the rest frowned slightly and shook their heads.<br/><br/>“I feel that these guys are similar in size to us. Keke.”<br/><br/>The eight-limbed demonic fiend looked at the leader of the bloodthirsty race with a glint in his eyes.<br/><br/>“Do you want me to hand this race over to you poisonous horned dragons?”<br/><br/>Tian Cheng looked at them and said with a smile.<br/><br/>“We can’t come, we can’t come.”<br/><br/>Ba Qi and the rest shook their heads in surrender.<br/><br/>“We didn’t sense any level 3 universe knight.”<br/><br/>At the side, Lei Ming said to Wang Xian.<br/><br/>“The skeleton island of the skeleton race is here. They definitely have something comparable to a level 3 universe Knight.”<br/><br/>Wang Xian’s dragon eyes flickered as he swept his gaze over. “There are seven Level 2 universe knights and 15 Level 1 universe knights. Be careful.”<br/><br/>“How dare they invade us with such strength?”<br/><br/>When the group of Dragon Palace members heard Wang Xian’s words, their eyes were filled with killing intent.\t\t\t\t\t\t</div>", "images": {}, "success": true}