{"id": 160, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15072221.html", "title": "Chapter 3151 - Chapter 3151: The 3150 War Began", "volume": 2, "volume_title": "Volume 2", "body": "<h1>Chapter 3151 - Chapter 3151: The 3150 War Began</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 3151: The 3150 war began<br/><br/>Three days after the ancient painting sect’s banquet, the Milky Way was bustling with activity due to the return of the nine swords race.<br/><br/>After the two venerables from the ancient painting sect failed to find the murderer, they continued to investigate the Milky Way.<br/><br/>In the Dragon Palace, Ao Yao led a few subordinates into the territory of the skeleton race.<br/><br/>The number of the skeleton race was the smallest among the races in the Milky Way.<br/><br/>In fact, their members were not as many as some domain level disciples.<br/><br/>The skeleton race lived on the skeleton island in the Milky Way, which was a forbidden place for other races.<br/><br/>In the Dragon Palace, all the other members were preparing.<br/><br/>Preparing for the next big battle.<br/><br/>“Let’s go to the Skeleton Island.”<br/><br/>On the fifth day, in front of the Skeleton Island, a group of 30,000 people flew over. The nine swords race looked at the skeleton island in front of them, their eyes shining.<br/><br/>“Welcome, nine-sword race!”<br/><br/>“Welcome, Nine-sword clan leader!”<br/><br/>Just as they approached, a black-robed skeleton supremacy appeared out of thin air, and his emotionless voice was heard.<br/><br/>“Venerable Darkness.”<br/><br/>Nine-sword clan leader cupped his hands toward the skeleton.<br/><br/>“Please!”<br/><br/>Venerable darkness made an inviting gesture, “The other allies have arrived. We are just waiting for you, Nine-sword clan leader.”<br/><br/>“Good, Haha!”<br/><br/>The nine swords clan leader laughed and immediately flew down.<br/><br/>However, when they flew toward the skeleton island, the eyes hidden in the void watched this scene with a surprised look.<br/><br/>“The nine swords clan has come to the skeleton clan, and the skeleton clan seems to have come from another clan.”<br/><br/>The figure looked thoughtful and slowly disappeared.<br/><br/>“Dragon King, there’s news from Ao Yao. There’s been an unexpected discovery.”<br/><br/>“The nine-sword race has entered the skeleton island, and an unknown and powerful race has entered the island.”<br/><br/>Not long after the nine-sword race entered the Skeleton Island, Prime Minister Gui received the news from Ao Yao and the others.<br/><br/>“Oh? The nine-sword race went to the skeleton island? Are there other unknown races?”<br/><br/>Wang Xian raised his eyebrows as his eyes sparkled. “Can you confirm which race it is?”<br/><br/>“Not yet. However, according to Ao Yao’s guess, it shouldn’t be a force from the Milky Way.”<br/><br/>Prime Minister Gui said.<br/><br/>“The nine-sword race has returned and are heading to the Skeleton Island. There is a high chance that they want to deal with us.”<br/><br/>Wang Xian said indifferently. Recalling the fervent eyes of the three paragons of the skeleton race that day, his eyes revealed a cold look.<br/><br/>“There is a high possibility that they are targeting our dragon palace. Furthermore, there is the involvement of that unknown race.”<br/><br/>Prime Minister Gui’s face revealed a hint of solemnity.<br/><br/>“Gather all the members of the Dragon Palace at the level of Paragons.”<br/><br/>Wang Xian said.<br/><br/>“It’s the Dragon King!”<br/><br/>Prime Minister Gui nodded.<br/><br/>Very soon, all the 40 universe knights of the Dragon Palace gathered.<br/><br/>Prime Minister Gui briefly explained everything to them, causing the members of the Dragon Palace to fall into deep thought.<br/><br/>“We haven’t been in the Milky Way for long. Otherwise, with the abilities of our poisonous horned dragon species, if we were given a few years, we would be able to control the information of all the races.”<br/><br/>After more than 10 seconds of silence, Ba Qi said.<br/><br/>“It’s a little too late to say this. The skeleton race’s nine blade race and that unknown race should be targeting us. They must be very confident in their own strength to dare to target us. However, the strength of our Dragon Palace is not something that we can compare to when we invaded the dragon race last time.”<br/><br/>“Lei Ming and 10 universe knights are enough to form a powerful trump card.”<br/><br/>Tian Chen said slowly.<br/><br/>“The three races are planning to target our Dragon Palace. We have to be wary. The skeleton race has a trump card that can unleash the combat strength of a universe knight at level three.”<br/><br/>Wang Xian said faintly. He looked at Tian Chen and smiled. “Since they want to destroy our Dragon Palace, we can wait for them here.”<br/><br/>“I don’t believe they can send out three to four universe knights with level 3 strength.”<br/><br/>As he spoke, his eyes were cold.<br/><br/>“Dragon King, even if there are two universe knights with level 3 strength, I can pin them down.”<br/><br/>Lei Ming said confidently from below.<br/><br/>At his peak, he had the combat strength of a Level 5 universe knight. Even though he had not fully recovered, his combat experience was here.<br/><br/>It was no problem for him to pin down two level 3 knights.<br/><br/>“Dragon King, if we wait here, I’ll set up the formation and make them pay a huge price.”<br/><br/>Sky Array said confidently.<br/><br/>Sky Array’s strength was already able to fight against three beings of the same level. After he set up the formation, this number would at least double.<br/><br/>The most powerful aspect of formation wizards was the defensive battle.<br/><br/>“Alright. The skeleton clan will definitely not be able to predict all the strength of our Dragon Palace. Prepare yourself in the Dragon Palace for the next few days. We will wait for their arrival quietly.”<br/><br/>Wang Xian shouted softly.<br/><br/>“It’s the Dragon King!”<br/><br/>“Anyone who invades our Dragon Palace will have to pay the price.”<br/><br/>“If we don’t destroy them and they dare to attack us, we will wait quietly again to see who will kill who.”<br/><br/>The group of leaders of Dragon Palace said with a grim expression.<br/><br/>Wang Xian squinted his eyes and stretched his body. He was fully prepared.<br/><br/>…<br/><br/>“15 universe knights at level one and seven at level two.”<br/><br/>On the Skeleton Island, the leader of the nine swords clan scanned his surroundings. His eyes were filled with excitement. His gaze landed on the golden figure in the middle of the skeleton clan. “Leader of the skeleton clan, you should still have some powerful trump cards, right?”<br/><br/>“Ka-ka, do you nine swords clan have a good trump card?”<br/><br/>The patriarch of the skeleton clan looked at the Patriarch of nine swords clan and asked with a horrifying laugh.<br/><br/>“We do have a trump card, but we can’t compare with the skeleton clan.”<br/><br/>The Patriarch of nine swords clan said with a smile.<br/><br/>“This is all the trump cards of our bloodthirsty clan. Don’t think that we still have a trump card. I don’t want to fight a battle that we are not confident about.”<br/><br/>The body that seemed to be condensed from blood lay on the chair and said.<br/><br/>“Don’t worry. This time, our skeleton race will mobilize the strength of the entire Skeleton Island.”<br/><br/>“We haven’t used our trump card for more than a billion years. Hehe, we won’t disappoint you.”<br/><br/>The golden skeleton chief said with a smile.<br/><br/>“That’s Good!”<br/><br/>The figure condensed from blood slowly stood up, “When Do We Act?”<br/><br/>“Then let’s do it in a few hours. Ka Ka, I can’t wait for the Divine Dragon’s blood.”<br/><br/>The Golden Light in the Golden Skeleton Patriarch’s eyes jumped, full of excitement.<br/><br/>“The pure-blooded Divine Dragon’s Bloodline!”<br/><br/>The Nine Swords Patriarch also clenched his fists tightly and scanned the surroundings with a smile.<br/><br/>He had heard of the bloodthirsty race. The Dragon’s blood was of great use to them.\t\t\t\t\t\t</div>", "images": {}, "success": true}