{"id": 169, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15072239.html", "title": "Chapter 3160 - Chapter 3160: In The 10 Days Of The 3159 Battle", "volume": 2, "volume_title": "Volume 2", "body": "<h1>Chapter 3160 - Chapter 3160: In The 10 Days Of The 3159 Battle</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 3160: In the 10 days of the 3159 battle<br/><br/>“Whoosh! Whoosh! Whoosh!”<br/><br/>In the sky, the golden skeleton clan leader, the nine sword clan leader, and the powerhouses from the Blood Evil clan all flew back with an extremely embarrassed expression.<br/><br/>They came to the back of the dragon skeleton clan leader and the Blood Evil clan leader and stared coldly at Wang Xian and the rest.<br/><br/>“Didn’t you want to destroy our Dragon Palace? Why are you running away now?”<br/><br/>Wang Xian moved and the Wind God Dragons and universe knights from the Dragon Palace flew behind him. They stared at the experts from the three races with cold expressions. They were filled with mockery.<br/><br/>“Dragon Palace, we will definitely destroy you this time. Do you think you can withstand our attacks?”<br/><br/>The Golden Skeleton Clan leader roared with a ferocious expression.<br/><br/>“We will destroy their Dragon Palace no matter how great the price is.”<br/><br/>The blood ruthless clan turned into a blood dragon and scanned the surroundings with a cold expression. They glanced at all the members of the Dragon Palace and landed on Lei Ming.<br/><br/>“Dragon Blood, Dragon Bone, I want all the lives of Your Dragon Palace.”<br/><br/>The dragon skeleton shook its enormous body and roared.<br/><br/>“Just you!”<br/><br/>Lei Ming’s face was filled with killing intent, and the Thunder on his body made a loud sound.<br/><br/>“Just Us!”<br/><br/>“Kill!”<br/><br/>The Blood Violence Clan leader roared and attacked Lei Ming directly.<br/><br/>The dragon skeleton didn’t hesitate either.<br/><br/>The golden skeleton clan leader and the three level 2 and 14 universe knights attacked from the left and right.<br/><br/>“Kill!”<br/><br/>Wang Xian looked over and revealed a ghastly expression.<br/><br/>“Whoosh! Whoosh! Whoosh!”<br/><br/>At this moment, five level 1 universe knights from the Dragon Palace flew over from the lower positions. There were a total of 35 universe knights.<br/><br/>With Lei Ming as the leader, they headed straight for the three races.<br/><br/>“Sky Formation, Let’s pin down one of them!”<br/><br/>Wang Xian squinted his eyes slightly. He and the Sky Formation, together with the five elements millstone, were enough to pin down the chief of the Bloodlust clan. The remaining members of the Dragon Palace were still much stronger than the three races.<br/><br/>“Alright!”<br/><br/>The Sky Formation nodded. With a wave of his arm, the formations quickly gathered in front of him.<br/><br/>“Transform into a dragon!”<br/><br/>Wang Xian let out a wild roar. His entire body underwent a huge transformation in an instant.<br/><br/>This was the first time he displayed his divine dragon body in front of so many forces.<br/><br/>“Roar! Roar! Roar!”<br/><br/>A dragon roar came out from his mouth. Wang Xian’s body had transformed into about 20,000 meters. The dragon scales on his body shone with a diamond-like luster. All kinds of luster circulated around him, making him look holy and majestic.<br/><br/>There was an additional pair of slightly strange wings on his back. However, one side of the wings was green in color, and the other side seemed to be missing something.<br/><br/>“Roar!”<br/><br/>“Kill!”<br/><br/>Wang Xian let out a furious roar. The five elements millstone floated in the air and attacked the chief of the Bloodlust tribe.<br/><br/>“Eh? What Divine Dragon Is This?”<br/><br/>On the opposite side, the chief of the Bloodlust tribe and the rest were slightly stunned when they saw the sudden change in the Dragon King’s body size. Their eyes were sparkling.<br/><br/>“Kill, Kill, kill! There are at least ten pure-bred divine dragons from the Dragon Palace. Kill them!”<br/><br/>The dragon skeleton glanced over, and the ghost fire in his eyes became even more excited.<br/><br/>“Boom!”<br/><br/>The collision between the two sides began.<br/><br/>A loud sound resounded in the sky above the Milky Way, and the surrounding venerables who were watching the battle looked on in horror.<br/><br/>“This… is too crazy. The venerables of the nine-sword race, the skeleton race, and the bloodthirsty race completely ignored the casualties of their disciples. They must destroy the Dragon Palace!”<br/><br/>“What kind of godly dragon is that Dragon King? His pressure is so strong. Could it be a mutated godly dragon?”<br/><br/>“They are going all out. The three great races are going all out. Are they completely ignoring the disciples below?”<br/><br/>The knights watching the battle looked over and their pupils contracted.<br/><br/>The battle in the sky had reached a climax.<br/><br/>And in the area below, even if the five knights of the Dragon Palace joined the battle above, the Dragon Palace still had the upper hand.<br/><br/>In fact, the Dragon Palace had overwhelming power.<br/><br/>The five universe knights charged at the armies of the three races, along with the million members of Dragon Palace and the million swallowing dragons, it was a one-sided battle.<br/><br/>“Retreat! Retreat!”<br/><br/>“Retreat to the skeleton island and engage in a defensive battle!”<br/><br/>The Great Beings of the skeleton race, the blood-thirsty race, and the nine-blade race ordered loudly.<br/><br/>With their current strength, they were no match for the Dragon Palace.<br/><br/>If the venerable one hadn’t given the order, they would have escaped long ago.<br/><br/>This wasn’t a battle on the same level.<br/><br/>“Kill, leave no one alive!”<br/><br/>The members of the Dragon Palace roared furiously.<br/><br/>The berserk dragon species turned into berserk warriors and slaughtered the enemies.<br/><br/>The arrows of the arrow dragon species could kill a large number of skeletons with each attack.<br/><br/>The five venerables of the Dragon Palace were the imperial dragon species, the berserk dragon species, the thorned dragon species, the poisonous horned dragon species, and the Dragon Guard.<br/><br/>They were good at close combat, and their swords and daggers flashed with light as they slaughtered crazily.<br/><br/>A large number of corpses fell in front of the Dragon Palace and were slowly absorbed by the Dragon Palace.<br/><br/>At this time, in the Dragon Transformation Pool of the Dragon Palace, on the nine dragon pillars, Dragon blood flowed continuously.<br/><br/>After 10 minutes, the three races lost another half of their strength and retreated to the skeleton island.<br/><br/>On the Skeleton Island, the skeleton race set up a powerful defense and barely blocked the attacks of the five universe knights of the Dragon Palace.<br/><br/>However, even so, it only slowed down the speed of being hunted by the Dragon Palace.<br/><br/>This time, it was the Dragon Palace’s turn to attack.<br/><br/>The three races defended.<br/><br/>In the sky, the three races relied on their two level 3 knights to fight against the Dragon Palace.<br/><br/>The battle between 50 to 60 knights made it much harder for the Dragon Palace to kill them.<br/><br/>However, what shocked the leader of the blood evil race was that the Dragon Palace Dragon King and the Dragon Palace Array Master were able to suppress him.<br/><br/>This made him extremely shocked.<br/><br/>“Kill them! I want to see how long they can hold on.”<br/><br/>The clan leader of the Blood Evil clan roared ferociously.<br/><br/>Time passed day by day, and the terrifying explosions continued.<br/><br/>On the third day, the Skeleton Island was conquered by the Dragon Palace, and five venerables of the Dragon Palace rushed in and killed wantonly.<br/><br/>“Clan leader, Save Us, save us!”<br/><br/>“No, no, no, I don’t want to Die!”<br/><br/>After three consecutive days of fighting, the skeleton race, the blood-thirsty race, and the nine-sword race completely collapsed.<br/><br/>After three days of fighting, they were killed bit by bit. They were no match for the Dragon Palace.<br/><br/>Facing the pleas of their disciples for help, the Universe Knights from the three races in the sky didn’t show any reaction.<br/><br/>Even the leader of the nine-sword race was bloodthirsty. Now, as long as they could destroy the Dragon Palace and get the pure-blooded godly dragon bloodline, they could improve greatly.<br/><br/>Compared to improving, they had already given up on other things.<br/><br/>And they also knew that they couldn’t retreat at this time. Only by destroying the Dragon Palace could they make up for all the losses.<br/><br/>And at this moment, the matter of the three races besieging the dragon palace had completely boiled up in the Milky Way.\t\t\t\t\t\t</div>", "images": {}, "success": true}