{"id": 168, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15072237.html", "title": "Chapter 3159 - Chapter 3159: 3158 Battled For 10 Days", "volume": 2, "volume_title": "Volume 2", "body": "<h1>Chapter 3159 - Chapter 3159: 3158 Battled For 10 Days</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 3159: 3158 battled for 10 days<br/><br/>“Die!”<br/><br/>When the furious and murderous voices rang out from the Dragon Palace, the terrifying attacks rushed into the battlefield.<br/><br/>The battlefield in front of the Dragon Palace was only a battle between universe knights and below.<br/><br/>If 10 universe knights suddenly rushed out at this time, wouldn’t they be killed?<br/><br/>This wasn’t a simple death.<br/><br/>“Not good, there are universe knights in Dragon Palace.”<br/><br/>“Hiss, Dodge quickly, there are 10 universe knights hiding in Dragon Palace.”<br/><br/>“Dodge, Dodge quickly!”<br/><br/>When they saw the arrow that looked like a dragon, the leaf that looked like a dragon scale, and the Dragon Sword that looked like a dragon…<br/><br/>All the Great Beings of the three races were shocked.<br/><br/>Even the skeleton members, who were not afraid of death, trembled, and the ghost fire in their eyes flashed with fear.<br/><br/>Boom! Boom! Boom<br/><br/>Streams of energy entered the army of the three clans, and in an instant, countless skeletons lost all their vitality.<br/><br/>More than 30,000 members of the nine-sword clan were killed, and 5,000 to 6,000 of them were killed.<br/><br/>The bloodthirsty clan also suffered heavy losses.<br/><br/>“Kill!”<br/><br/>The other disciples of the Dragon Palace were excited when they saw the knight-level members flying over.<br/><br/>They roared and charged forward.<br/><br/>The 10 universe knights had already torn a hole in the ground.<br/><br/>They could charge forward and kill them.<br/><br/>“Kill!”<br/><br/>“Sou Sou Sou!”<br/><br/>The 10 Universe Knights of the Dragon Palace also let out a cold shout. Arrows shot out, and they all rushed over.<br/><br/>“Not good, Knight, save me!”<br/><br/>“Leader, save me!”<br/><br/>Seeing another 10 universe knights appear in the Dragon Palace, the disciples of the three races were shocked.<br/><br/>The power of the Dragon Palace was not weaker than them. Now that 10 Universe Knights had rushed out, what could they use to fight them?<br/><br/>Just 10 universe knights were enough to kill all of them.<br/><br/>“Damn, why are there so many knights in the Dragon Palace!”<br/><br/>“Not good, there are 10 universe knights in the Dragon Palace, our disciples are no match for the Dragon Palace.”<br/><br/>In the sky, the Universe Knights of the three races felt the situation below and opened their eyes wide, shocked.<br/><br/>Another 10 universe knights.<br/><br/>This was 10 universe knights!<br/><br/>The skeleton race didn’t even have 10 universe knights.<br/><br/>Even the bloodthirsty race only had 14 universe knights.<br/><br/>Now, there were 10 universe knights hidden in Dragon Palace.<br/><br/>How could the disciples of their race defend against this?<br/><br/>And no matter how powerful the skeleton race’s trump cards were, they couldn’t have 10 universe knight-level treasures!<br/><br/>“Damn it!”<br/><br/>At this moment, the golden skeleton clan leader looked down and his face darkened.<br/><br/>However, at this moment, the five elements Millstone was attacking him.<br/><br/>The golden skeleton clan leader’s face changed drastically. The destructive five elements power landed on his body, causing the bones on his arm to slowly crack.<br/><br/>He was a little terrified. He was not the Dragon King’s match.<br/><br/>“As expected of the skeleton clan leader. His defense is really terrifying.”<br/><br/>At this moment, Wang Xian’s continuous attacks landed on the body of the golden skeleton clan leader. The powerful attacks only caused a crack to appear on his skeleton body.<br/><br/>If it were any other Level 2 universe knight, they would have been killed by him long ago.<br/><br/>“Five Elements Millstone!”<br/><br/>“I don’t want to waste your time. Go and kill the others.”<br/><br/>Wang Xian waved his arm. The five elements millstone floated around the golden skeleton clan leader and kept attacking him.<br/><br/>The skeleton clan leader’s attack power was average, but his defense was very strong. Even Wang Xian would find it difficult to kill him in a short period of time.<br/><br/>He might as well let the five elements millstone pin him down.<br/><br/>Whoosh<br/><br/>His speed was extremely terrifying. In the next moment, he appeared behind a Level 2 universe knight who was being suppressed by the Heaven Formation. His dragon claws clawed at his body.<br/><br/>“What!”<br/><br/>The Level 2 universe knight from the skeleton race was already being suppressed by the sky formation. Now that Wang Xian had suddenly appeared, his expression changed drastically.<br/><br/>His body suddenly turned into bones as he fled in all directions.<br/><br/>“If you want to escape, die!”<br/><br/>“Great Heaven Annihilation Formation!”<br/><br/>The Sky Formation seized the opportunity and revealed a cold expression. A formation landed directly on the skeleton.<br/><br/>The terrifying power of destruction caused the law power on its body to collapse rapidly.<br/><br/>“Nine mountain suppression!”<br/><br/>A nine-elemental mountain pressed down on the skeleton’s body.<br/><br/>“Leader, save me.”<br/><br/>The Universe Knight level two great being of the skeleton race’s face changed drastically, and he howled shrilly.<br/><br/>“Get lost!”<br/><br/>The golden skeleton leader looked over and rushed over quickly.<br/><br/>“Roar!”<br/><br/>However, at this moment, the five godly dragons raised their heads and spat out dragon breath.<br/><br/>The five Elemental Dragon Breath made the golden skeleton clan leader’s expression change drastically, and he quickly dodged to the side.<br/><br/>“Ah Ah, clan leader, save me!”<br/><br/>At this moment, another scream came from not far away.<br/><br/>The golden skeleton clan leader looked over and his heart sank.<br/><br/>A Universe Knight Level 1 warrior from the bloody race was surrounded by two wind god dragons from the Dragon Palace. His blood-like body was torn apart and filled with fear.<br/><br/>They had fewer knights than the Dragon Palace to begin with, and many of them were fighting one against two.<br/><br/>Fighting one against two at the same level and against a pure-blooded dragon, that was courting death.<br/><br/>“Lord Dragon Skeleton, clan leader, fight together.”<br/><br/>“Retreat to the side of Lord Dragon skeleton and the others!”<br/><br/>The golden skeleton clan leader saw this scene and immediately ordered.<br/><br/>With their current strength, they were no match for the Dragon Palace. There were too many knights in the Dragon Palace.<br/><br/>Their only reliance was that they had two universe knights with level 3 combat power.<br/><br/>“Retreat, Retreat, Retreat!”<br/><br/>The Universe Knights of the three races looked extremely embarrassed and hurriedly retreated into the sky.<br/><br/>Even though the impact of a universe Knight’s Level 3 combat power was too terrifying, they had no choice but to do so.<br/><br/>They weren’t a match for Dragon Palace alone.<br/><br/>On their side, they had already lost four universe knights, and three of them were Level 2 universe knights.<br/><br/>They weren’t a match for Dragon Palace at all.<br/><br/>“This… Dragon Palace is so powerful!”<br/><br/>“Dragon Palace actually has ten universe knights. That’s a total of 40. This is crazy.”<br/><br/>“The three races are no longer a match for Dragon Palace. Now, it’s up to the dragon skeletons and blood dragons of the three races. It’s hard to say who will win!”<br/><br/>“Although the three races have suffered huge losses, they still have one more person with Pinnacle Combat Power.”<br/><br/>“No matter what, this battle can already be recorded in the history of the Milky Way.”<br/><br/>The universe knights watching the battle were shocked.<br/><br/>In this battle, it could be said that godly kings were cannon fodder, and even godly emperors couldn’t survive.<br/><br/>Even knights were dying one after another.<br/><br/>The outcome was unknown!\t\t\t\t\t\t</div>", "images": {}, "success": true}