{"id": 165, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15072231.html", "title": "Chapter 3156 - Chapter 3156: 3155 Eruption: Three Races Vs Dragon Palace 5", "volume": 2, "volume_title": "Volume 2", "body": "<h1>Chapter 3156 - Chapter 3156: 3155 Eruption: Three Races Vs Dragon Palace 5</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 3156: 3155 eruption: three races vs Dragon Palace 5<br/><br/>“Hehe, let them see the strength of our Dragon Wizards. Let them die!”<br/><br/>Prime Minister Gui gave the order, and over 10,000 dragon wizards floated on the Heaven Chessboard.<br/><br/>Dragon wizards, Peak Dragon species.<br/><br/>Over 10,000 Dragon Wizards from the Dragon Palace could unleash the battle strength of a rank eight divine emperor on the heaven chessboard. Moreover, among the rank eight divine emperors, each of them could fight against three existences of the same level.<br/><br/>This was equivalent to 30,000 emperor God level 8 warriors attacking.<br/><br/>This time, more than 30,000 elites from the nine-blade race had arrived. However, their elites were only at Emperor God level 5 and above.<br/><br/>Compared to the Dragon Wizards, there was a huge difference.<br/><br/>With 10,000 Dragon Wizards attacking together, even a universe Knight Level 1 would have to flee.<br/><br/>An overwhelming array formation attacked the skeleton army in front of them.<br/><br/>The terrifying power of the array formation directly bombarded forward.<br/><br/>“Not good, their attacks are very terrifying.”<br/><br/>All the experts of the nine-sword race and the bloodthirsty race sensed the attack of the skeleton race. Their expressions changed slightly, and they hurriedly dodged to the side.<br/><br/>However, the skeleton army did not Dodge. They stayed close to each other, like sharp siege weapons, and continued to charge forward.<br/><br/>“Boom! Boom! Boom!”<br/><br/>The Dragon Wizards’terrifying array formations landed on the skeleton army. At the front, more than a billion skeletons collapsed instantly, and their bones scattered in all directions.<br/><br/>The ghost fire in their pupils extinguished, and they lost their vitality completely.<br/><br/>In an instant, more than a billion skeletons were killed instantly.<br/><br/>“What!”<br/><br/>“Hiss, the tens of thousands of members of the Dragon Palace are so powerful. The tens of thousands of array formation masters of the Dragon Palace are all at the eighth level of the Divine Emperor Realm.”<br/><br/>“Amazing, I really didn’t expect the dragon palace to have such a terrifying army.”<br/><br/>The universe knights watching from the side revealed shocked expressions when they saw this scene.<br/><br/>Even Red Fog Knight and the others from the misty race narrowed their eyes slightly.<br/><br/>They didn’t even have such a terrifying attack or such a terrifying array formation army.<br/><br/>Sou Sou Sou Sou<br/><br/>The skeleton at the front was killed. At this moment, millions of arrows covered the sky and covered the earth as they shot towards everyone from the three great clans.<br/><br/>The number of arrow dragon species had reached 100,000. There were 100,000 arrow dragon species. Although they were not as powerful as the dragon wizards, their attack power was not weak either.<br/><br/>Among the arrow dragon species, there were more than a dozen peak divine emperor experts.<br/><br/>Each peak divine emperor expert’s attack carried a terrifying power.<br/><br/>The arrow turned into the wind god Dragon and carried a terrifying power.<br/><br/>“Defend, Attack!”<br/><br/>Behind the skeleton race, a peak divine emperor golden skeleton ordered loudly.<br/><br/>“Attack!”<br/><br/>“Attack!”<br/><br/>The experts of the nine-sword race and the blood ruthless race also shouted loudly.<br/><br/>How could the attacks of an army of the Dragon Palace frighten the three races.<br/><br/>At the next moment, all the members of the three races moved.<br/><br/>They waved their weapons and attacked the arrows.<br/><br/>“Boom! Boom! Boom!”<br/><br/>The arrows were destroyed.<br/><br/>“103 peak divine emperor experts.”<br/><br/>Prime Minister Gui stood in the sky and felt the power coming from the front. He squinted his eyes and murmured.<br/><br/>There were more peak divine emperors than the Dragon Palace.<br/><br/>However, the Dragon Palace was not afraid at all.<br/><br/>“Dragon Cannon, Get Ready!”<br/><br/>Prime Minister Gui ordered without changing his expression.<br/><br/>“Boom! Boom! Boom!”<br/><br/>Hundreds of dragon cannons were aimed at all the experts of the three races.<br/><br/>“Attack!”<br/><br/>“Boom! Boom! Boom!”<br/><br/>The dragon cannons roared and terrifying flames condensed into the shape of fire divine dragons. Each fire divine dragon was 100,000 meters in size and charged forward.<br/><br/>Compared to the Dragon Cannon used by the dragon race, its power was even more terrifying.<br/><br/>Back then, when the dragon race used 100 dragon cannons, they could unleash the power to kill a universe Knight Level 1. Now, they could do the same.<br/><br/>“Nine Swords Godly Book! Come out!”<br/><br/>“Skeleton race, take out your weapons.”<br/><br/>An elder of the nine swords race roared. Sensing the terrifying attack of the Dragon Cannon, he waved his arm and a treasure at the level of a acquired spiritual treasure flew into the sky.<br/><br/>The nine swords divine book was divided into nine pictures, and each picture had a sword.<br/><br/>Each sword contained a terrifying might.<br/><br/>“Sou Sou Sou!”<br/><br/>The nine swords flew out and attacked the divine flaming dragon that the Dragon Cannon had shot out.<br/><br/>“Boom Boom Boom!”<br/><br/>The nine divine flaming dragons instantly collapsed.<br/><br/>“Skeleton giant puppet!”<br/><br/>“Skeleton Bird!”<br/><br/>“Skeleton Mountain!”<br/><br/>When the skeleton clan heard the voice of the nine sword clan, the golden skeleton at the peak of the Divine Emperor Realm roared loudly.<br/><br/>“Ka Ka Ka!”<br/><br/>At the front of the skeleton island, the skulls hanging in front of them flew forward. There were at least a few million skulls forming an incomparably huge skeleton.<br/><br/>“Boom!”<br/><br/>In an instant, the pupils of the skull that formed the skeleton giant suddenly released a terrifying ghost flame. A powerful aura swept out in the surroundings.<br/><br/>Ka Ka Ka<br/><br/>The skeleton giant let out a terrifying sound and rushed straight into the battlefield.<br/><br/>Ka Ka Ka<br/><br/>This wasn’t the end. From the skeleton island behind them, bird skulls flew out one after another, and the densely packed bird skulls formed a skeleton bird.<br/><br/>The limbs of the skeletons flew up and gathered into a huge skeleton mountain.<br/><br/>In an instant, three skeletons that were 100,000 meters in size were formed.<br/><br/>Their auras were no weaker than a level 1 knight.<br/><br/>These were the skeletons’trump cards.<br/><br/>“Hehehe, very good, Kill!”<br/><br/>The Warriors of the blood evil race were excited when they saw the skeletons’trump cards.<br/><br/>They charged forward with killing intent.<br/><br/>“Battle pet, no leader, Attack!”<br/><br/>“Thunder Dragon Bone, Attack!”<br/><br/>“Battle Angel, Attack!”<br/><br/>Prime Minister Turtle looked at the three skeleton giants that were comparable to a knight level 1, his expression didn’t change at all, he waved his arm.<br/><br/>The battle Pet Knight Level Turtle Winged Beast had no leader, it was sold to the dragon race and obtained by the Dragon Palace.<br/><br/>The Thunder Dragon Bone was obtained from the dragon-faced knight.<br/><br/>The Battle Angel at the venerable level was obtained by killing the venerable Lou Shan.<br/><br/>The combat strength of the three universe knights was placed into the battlefield by Prime Minister Gui.<br/><br/>“Eh?”<br/><br/>Everyone was slightly shocked when they saw the Dragon Palace revealing its three trump cards to fight against the skeleton race.<br/><br/>“Kill!”<br/><br/>“Clan leader, save me!”<br/><br/>At this moment, Wang Xian locked onto a level 2 universe knight from the bloodthirsty race.<br/><br/>He exerted his speed to the maximum. Before he could react, Wang Xian had already arrived at his side.<br/><br/>The Dragon Claw landed on his body, and a terrifying energy enveloped him.<br/><br/>The five elements millstone floated above his head, and his vitality quickly disappeared.<br/><br/>Wang Xian caught him by surprise and seized the opportunity to kill a Level 2 universe knight instantly.\t\t\t\t\t\t</div>", "images": {}, "success": true}