{"id": 174, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15072249.html", "title": "Chapter 3165 - Chapter 3165: 3164 Was Annihilated", "volume": 2, "volume_title": "Volume 2", "body": "<h1>Chapter 3165 - Chapter 3165: 3164 Was Annihilated</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 3165: 3164 was annihilated<br/><br/>“You want to escape?”<br/><br/>Venerable Willow God’s expression turned cold when she saw the blood violent tribe leader trying to escape.<br/><br/>She could restrain him in a one-on-two situation, so she wasn’t afraid in a one-on-one situation.<br/><br/>Looking at the blood violent tribe leader who wanted to escape, she waved her arm, and countless weeping willows attacked him.<br/><br/>The weeping willows completely enveloped him.<br/><br/>“Damn it, I’m not his match.”<br/><br/>Looking at the weeping willows that enveloped him completely, his expression was abnormally ugly.<br/><br/>He had relied on the dragon scales to increase his strength, and he was close to an ordinary universe knight level 3. However, against a universe Knight Level 3 great being, he was no match at all.<br/><br/>Especially someone like Willow God Knight.<br/><br/>He couldn’t escape the attack by himself.<br/><br/>“I can’t stay here any longer.”<br/><br/>He looked anxious.<br/><br/>“Sou Sou Sou!”<br/><br/>At this moment, the willow branches lashed at him.<br/><br/>His expression changed.<br/><br/>“Peng Peng Peng!”<br/><br/>The willow branches landed on his body, causing his blood to splatter.<br/><br/>Suppression, complete suppression.<br/><br/>“No, no!”<br/><br/>In the huge space of the willow branches, he had no power to resist.<br/><br/>“Roar Roar Roar!”<br/><br/>He raised his head and let out an angry roar. The dragon scales on his body flew out and chopped at the willow branches.<br/><br/>The incomparably sharp dragon scales immediately chopped off the willow branches.<br/><br/>But soon, the chopped willow branches grew back and continued to lash at the blood violent tribe leader.<br/><br/>“Break through!”<br/><br/>He roared and flew over while staring at one spot.<br/><br/>The dragon scales covering his body slowly floated up and slashed at the willow branches.<br/><br/>“Whoosh! Whoosh! Whoosh!”<br/><br/>But this time, when the dragon scales flew out and cut off the willow branches, more willow branches wrapped around the dragon scales and wrapped them up.<br/><br/>After all, the dragon scales were not a part of the blood ruthlessness clan leader’s body. When the dragon scales cut off the willow branches, they were also suppressed by the venerable willow deity.<br/><br/>“Damn it, break, break, Break!”<br/><br/>Seeing the dragon scales on his body being suppressed, blood flowed out of the blood ruthlessness clan leader’s eyes. He did not care about the loss, and a large number of dragon scales slashed toward the willow branches.<br/><br/>The venerable willow deity waved his arm. When the dragon scales cut off the willow branches, the attack power was greatly reduced. The willow trees condensed into a cage and suppressed the dragon scales.<br/><br/>“This won’t do. If this continues, I’ll be finished. I have to escape, I have to!”<br/><br/>The bloodthirsty race sensed the suppression of the dragon scales and the weakening of their own strength. Panic appeared in their eyes.<br/><br/>If this continued, they might completely die here.<br/><br/>“Dragon Scales, Break!”<br/><br/>He gritted his teeth. All the dragon scales on his body slowly floated up from his body and condensed into a terrifying dragon scale storm.<br/><br/>The storm of dragon scales directly attacked the willow branches that were blocking him.<br/><br/>“Sou Sou Sou!”<br/><br/>Wherever the storm of dragon scales passed, all the willow branches were cut off.<br/><br/>Venerable Willow God slightly frowned. He hesitated for a moment and waved his arm.<br/><br/>His palm directly became longer, turning into a huge willow branch.<br/><br/>The huge branch rotated and condensed, like the roots of an old tree.<br/><br/>The willow branch wrapped around all the dragon scales.<br/><br/>“Run!”<br/><br/>The blood ruthless clan leader used the safety space created by the countless dragon scales to tremble and slowly became illusory.<br/><br/>Venerable Willow God looked at the illusory blood ruthless clan leader and didn’t have time to stop him. He shook his head.<br/><br/>“The blood ruthless clan leader escaped, but his dragon scales were suppressed by me.”<br/><br/>After the leader of the bloodthirsty race had escaped, the resistance on the dragon scales had disappeared.<br/><br/>Venerable willow deity waved her arm and grabbed all the dragon scales in her hand.<br/><br/>“Thank you, Venerable Willow Deity.”<br/><br/>Upon hearing her voice, Wang Xian was immediately grateful. He continued, “Since venerable willow deity has already made a move, help us suppress that dragon skeleton again. After this, our Dragon Palace will reward you greatly.”<br/><br/>“Alright!”<br/><br/>Venerable willow deity did not reject him. With a move of his body, he brought a sky full of willow branches behind him and attacked the dragon skeleton directly.<br/><br/>“Oh No.”<br/><br/>“Roar Roar!”<br/><br/>When the dragon skeleton saw venerable willow deity attacking him, his expression changed drastically.<br/><br/>With his strength, he could escape in an instant.<br/><br/>However, all the divine kingdoms of the skeleton race were on the Skeleton Island.<br/><br/>Even if he returned to his own divine kingdom in an instant, he would only return to the skeleton island.<br/><br/>And the Skeleton Island was right next to it. In other words, unless he could break out of it, he would die.<br/><br/>This made the dragon skeleton’s eyes reveal an anxious expression.<br/><br/>Whether it was the Lightning Dragon or the venerable willow deity, he wasn’t a match for them in a one-on-one situation.<br/><br/>Let alone a one-on-two situation.<br/><br/>“Ah! Ah! Ah!”<br/><br/>At this time, the screams of the surrounding people kept ringing out.<br/><br/>The three races, which had a much smaller number of knights than Dragon Palace, were now completely one-sided.<br/><br/>One by one, the universe knights were killed quickly.<br/><br/>“The clan leader has escaped. We are finished.”<br/><br/>A Universe Knight of the brutal blood race saw that his clan leader had escaped. He looked at the four universe knights who were surrounding him and showed a look of despair.<br/><br/>He was going to die.<br/><br/>“Not good, the three races are completely defeated.”<br/><br/>The two universe knights from the ancient art school, who were sealed by the sky array, had a drastic change in expression.<br/><br/>“Go all out and escape.”<br/><br/>They roared and started to break through regardless of the consequences.<br/><br/>They knew that if they did not break through, they would most likely be left here.<br/><br/>“Peng, Peng, Peng!”<br/><br/>“No!”<br/><br/>At this time, loud noises and screams could be heard.<br/><br/>They looked over and their hearts sank.<br/><br/>The golden skeleton clan leader’s body, which had a face full of cracks, had completely collapsed, and his life force was quickly extinguished.<br/><br/>Except for them, all the universe knights at Level 2 were killed.<br/><br/>At this time, they felt that everyone was looking at them.<br/><br/>When they saw the Dragon King of the Dragon Palace and the other four level 2 universe knights locked onto them, their faces were filled with shock.<br/><br/>Cold sweat appeared on their foreheads as fear started to spread.<br/><br/>“Get rid of the two guys from the ancient art sect.”<br/><br/>Wang Xian’s voice rang out. At the same time, it represented a judgment.<br/><br/>This made the two venerables from the ancient art sect turn extremely pale.<br/><br/>“It’s over. The three races are completely finished. The two venerables of the ancient painting sect are also finished.”<br/><br/>“In the end, even though venerable willow deity made a move, the strength of the Dragon Palace is also very terrifying. Forty universe venerables!”<br/><br/>“This battle is simply too terrifying. I reckon that more than twenty universe venerables will perish. The skeleton race will be completely exterminated!”<br/><br/>“It’s about to end, the three clans will be exterminated, this is simply unimaginable.”<br/><br/>When the surrounding spectators saw this scene, their faces were filled with shock.<br/><br/>The battle continued for 10 days, and almost all the elites of the three clans died.<br/><br/>The terrifying strength of the Dragon Palace.<br/><br/>The powerful pure-blooded dragon of the Dragon Palace was completely displayed before all the powers in the Milky Way.<br/><br/>Its terrifying strength made all the forces tremble.\t\t\t\t\t\t</div>", "images": {}, "success": true}