{"id": 176, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15072253.html", "title": "Chapter 3167 - Chapter 3167: 3166 Dragon Palace Level Up", "volume": 2, "volume_title": "Volume 2", "body": "<h1>Chapter 3167 - Chapter 3167: 3166 Dragon Palace Level Up</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 3167: 3166 dragon palace level up<br/><br/>“Invincible Dragon Palace!”<br/><br/>A voice filled with confidence and fighting spirit resounded in the sky above the Milky Way.<br/><br/>When all the spectators heard this voice, they felt some sympathy and shock in their hearts.<br/><br/>Invincible in one battle.<br/><br/>In this battle, the Dragon Palace was one against three, along with the two universe knights from the ancient painting sect, they were all annihilated.<br/><br/>Their powerful strength was shocking.<br/><br/>The roar of the Dragon God was deeply imprinted in their minds.<br/><br/>After today, the Dragon Palace would be an existence that no one dared to provoke in the entire Milky Way.<br/><br/>“Let’s go back!”<br/><br/>The group of Universe Knights didn’t stay here for long, they turned around and left.<br/><br/>Even though the Dragon Palace was powerful now, at the same time, they also had a powerful enemy.<br/><br/>Ancient Painting sect.<br/><br/>The Dragon Palace had killed three universe knights at Level 2 from the ancient painting sect. The two sides had reached a deep hatred.<br/><br/>It was very likely that a war would break out between the two sides.<br/><br/>As for who would win or lose, it was hard to say.<br/><br/>They couldn’t participate in a war of this level.<br/><br/>“Venerable Willow Deity, thank you for your help this time.”<br/><br/>The Wang Immortal in the Dragon Palace thanked Venerable Willow deity again.<br/><br/>“The fruit that the Dragon King gave me last time allowed me to achieve a breakthrough. Now that the Dragon Palace is in trouble, I, the willow deity, will naturally lend a helping hand.”<br/><br/>Venerable willow deity shook his head and said with a smile.<br/><br/>“No matter what, I still have to thank you.”<br/><br/>Wang Xian smiled and continued to thank her. He brought her into the Dragon King Palace.<br/><br/>Buzz<br/><br/>After entering the Dragon King Palace, Wang Xian waved his arm. The soul-returning embryo fruit and a large amount of soul-returning liquid flew into his hand.<br/><br/>“Venerable Willow Deity, this is just a small token of my appreciation.”<br/><br/>As he spoke, he passed the fruit to venerable willow deity.<br/><br/>“Oh?”<br/><br/>At this moment, venerable willow deity did not pay attention to the soul-returning embryo fruit and the life force liquid in Wang Xian’s hand. Her eyes were burning with excitement as she stared at the ancestral tree behind the dragon throne. Her body was trembling slightly.<br/><br/>Wang Xian smiled when he saw this and did not say anything.<br/><br/>“Dragon King, all the Cosmos God kingdoms that the Dragon Palace needs have been gathered.”<br/><br/>At this moment, Prime Minister Gui walked over and reported to Wang Xian.<br/><br/>The Dragon Palace had obtained a few cosmos God kingdoms not long ago. Now, after killing more than 20 universe knights from three races, they had completely gathered nine Cosmos God kingdoms.<br/><br/>The main reason why they were able to gather all of them this time was because of the skeleton race.<br/><br/>As the Skeleton Island sailed over, all the god countries of the skeleton race were located on the Skeleton Island.<br/><br/>And the skeleton race didn’t only have one attribute.<br/><br/>For example, the leader of the skeleton race, the golden skeleton was of the metal attribute.<br/><br/>“Alright, I’ll upgrade it directly.”<br/><br/>Wang Xian squinted his eyes slightly. With a thought, a message appeared in his mind.<br/><br/>“Congratulations host, the Dragon Palace has devoured nine attribute Cosmos God countries and is upgrading.”<br/><br/>“Upgrade!”<br/><br/>He waited quietly.<br/><br/>“Boom!”<br/><br/>“Roar! Roar! Roar!”<br/><br/>The rumbling sound came from within the Dragon Palace. A surge of mighty energy surged out.<br/><br/>The entire Dragon Palace was filled with the roar of a dragon.<br/><br/>The entire Dragon Palace began to undergo an earth-shaking change.<br/><br/>“This is?”<br/><br/>At the side, Venerable Willow God recovered from the shock of the ancestral tree. He looked at Wang Xian in shock.<br/><br/>“The Dragon Palace is undergoing another upgrade.”<br/><br/>Wang Xian reminded her.<br/><br/>Following that, the changes began.<br/><br/>All the buildings began to expand. The area of the Dragon Palace was expanding at a terrifying speed.<br/><br/>The ocean-pacifying divine needles shot straight into the sky. On the Dragon Pillars, the divine dragons seemed to have come to life and were growing rapidly.<br/><br/>Everything was undergoing a huge upgrade.<br/><br/>Venerable Willow God sensed the changes in the dragon palace and revealed a shocked expression.<br/><br/>“Ding, congratulations host, the level of the Dragon Palace has been upgraded to the Houtian Level!”<br/><br/>The system’s voice sounded in Wang Xian’s mind. Upon hearing this voice, his mind moved.<br/><br/>Dragon Palace: Houtian<br/><br/>Dragon Lord: Wang Xian (void God Emperor level six eight-colored divine dragon)<br/><br/>Buildings:<br/><br/>Dragon King Palace: Houtian (increases the cultivation speed and recovery speed of the Dragon King by 3,072 times)<br/><br/>Dragon Transformation Pool: acquired (absorbing dragon blood can give birth to a dragon.)<br/><br/>Dragon Gate: acquired (a fish can only become a dragon after leaping through the Dragon Gate, it is effective against creatures below the level of universe Masters!)<br/><br/>Ocean-pacifying needle: acquired (pillar of the Dragon Palace, set 80 million kilometers of the Dragon Palace calm, increase the combat strength of the members of the Dragon Palace!)<br/><br/>Dragon Cave: acquired (with 100 million dragon caves, the cultivation speed of the creatures in the Dragon Cave will increase by 2,048 times!)<br/><br/>Dragon Field: acquired (practice martial arts in the Dragon Field, increase comprehension by 1,024 times!)<br/><br/>Dragon Array: acquired (Dragon Palace Array: concealment, defense, gathering of spiritual energy, wormhole, detection, Attack!)<br/><br/>Spiritual items:<br/><br/>Ancestral Tree: Heavenly Creation<br/><br/>Attached: Dragon Transformation Pool to nurture dragon species.<br/><br/>Current dragon species: Golden Swordfish, thunder shrimp, demon monkey, Strange Demon, Light Thorn, Hydra, dragon turtle, Yaksha, clam girl, golden lobster, Starwood Dragon species, fire phoenix dragon species…<br/><br/>Special buildings:<br/><br/>Dragon Nest: Devouring Dragon (None)<br/><br/>Devouring Dragon: consumes energy to create its own insect-like species, the mother insect feeds on all kinds of metal materials!<br/><br/>Ancestral Tree: Heavenly Fate<br/><br/>Branches: soul-returning wood branches (ruler-level, with soul-returning embryo fruits, currently able to return to creatures below the ruler-level of the Universe!)<br/><br/>Parasol Wood branches (venerable-level, the wood where the Phoenix resides, the Phoenix Nest, the land of Nirvana!)<br/><br/>Endless Wood branch (knight level, with an endless fruit, currently increasing the speed of fire attribute practitioners by 800% !)<br/><br/>Fuchang tree branch (knight level, with an endless fruit, activating the spiritual intelligence of living beings!)<br/><br/>Nirvana Thunder Tree Branch (Knight level, with an endless fruit, 800% speed of thunder attribute practitioners!)<br/><br/>Fruit: immortal slaying gourd (ruler level, currently able to nurture four elements Knight Level 1 immortal slaying sword!)<br/><br/>Ability: 1. Able to revive all wood elements related to plants, and as the ancestral tree’s energy increases, able to increase the upper level of the branch.<br/><br/>Subsidiary: Ancient Lake Moon Bay (knight level, able to quickly recover from injuries, able to recover irreversible injuries.)<br/><br/>The information about the dragon palace flashed in his mind.<br/><br/>The Dragon Palace had been upgraded from level nine to Houtian level.<br/><br/>This was something that Wang Xian had known for a long time.<br/><br/>Houtian level corresponded to Houtian Numinous Treasure and Houtian Supreme Treasure.<br/><br/>The Houtian level of the Dragon Palace of the Divine Dragon could be considered very strong.<br/><br/>When the Divine Dragon Clan was at its peak, most of the dragon palaces of the Divine Dragon clan were at this level.<br/><br/>As for those above that level, there were less than ten of them.<br/><br/>The Dragon Palace had been upgraded to the Houtian level, and its area had reached a radius of 50 million kilometers.<br/><br/>This area was not big in the universe, but it was not small either.<br/><br/>For the two million members of the Dragon Palace, it was not small.<br/><br/>The upgrade of the Dragon Palace had made the Dragon Palace’s defense reach a terrifying level, and it could withstand all attacks from anyone below the level of a universe dominator.<br/><br/>In this starry sky, it could be said that it was indestructible.<br/><br/>Sensing the surrounding spiritual Qi that had condensed into liquid, he revealed a smile.<br/><br/>“This… this…”<br/><br/>Venerable Willow God sensed the changes in the Dragon Palace. Sensing the strength of the Dragon Palace, a shocked expression appeared on her face.<br/><br/>She could sense that this dragon palace was dozens or hundreds of times stronger than their Cosmos God country.<br/><br/>Could this be the legendary True Dragon Palace?\t\t\t\t\t\t</div>", "images": {}, "success": true}