{"id": 172, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15072245.html", "title": "Chapter 3163 - Chapter 3163: 3162 Willow Deity Venerable Helped", "volume": 2, "volume_title": "Volume 2", "body": "<h1>Chapter 3163 - Chapter 3163: 3162 Willow Deity Venerable Helped</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 3163: 3162 willow deity venerable helped<br/><br/>“Dragon King, let me help you.”<br/><br/>When this voice rang out, when the Blood Dragon was defeated, and when the woman’s figure appeared under the countless willow branches, it instantly caused countless people to be shocked.<br/><br/>“Who is it?”<br/><br/>“Who dares to participate in our war with the Dragon Palace? They’re courting death!”<br/><br/>When the Patriarch of the bloodthirsty race saw that the blood dragon he had condensed was defeated, a ferocious expression appeared on his face. He raised his head and looked over.<br/><br/>“Damn it!”<br/><br/>The leader of the nine-blade race and the leader of the golden skeleton race both looked over immediately.<br/><br/>“What’s going on?”<br/><br/>The two universe knights from the ancient painting sect also looked over with a serious expression.<br/><br/>“What’s That?”<br/><br/>The woman’s attack instantly attracted everyone’s attention.<br/><br/>The surrounding universe knights also looked over, and their eyes were filled with shock.<br/><br/>At this time, who dared to participate in the war between the Five Great Powers?<br/><br/>Wasn’t this courting death?<br/><br/>“It’s the willow deity knight, the willow deity Knight actually helped the Dragon Palace.”<br/><br/>A Universe Knight looked at the Willow branch hanging down from the sky and exclaimed.<br/><br/>The Willow Deity Knight was a famous existence in the entire Milky Way.<br/><br/>According to what they knew, the willow deity Knight should be at the peak level 2 universe Knight Realm.<br/><br/>However, there were also people who guessed that he was a peak level 2 universe knight and could unleash the power of a Level 3 universe knight.<br/><br/>Willow deity Knight was a well-deserved peak level expert in the Milky Way.<br/><br/>Her reputation was higher than the head of the skeleton clan and the head of the Mist clan.<br/><br/>In the Milky Way, the most respected person was willow deity knight.<br/><br/>Because she established the willow deity dojo, because she was the most neutral expert in the Milky Way.<br/><br/>She did not participate in any racial conflicts.<br/><br/>Her powerful strength and neutral stance made all the races in the Milky Way not dare to provoke her.<br/><br/>But no one had expected that in today’s battle, under such circumstances, the venerable willow deity would actually make a move.<br/><br/>And it was to help the Dragon Palace resist the four great races.<br/><br/>This…<br/><br/>No one could understand.<br/><br/>“It’s our venerable willow deity!”<br/><br/>When the disciples of the Willow deity Daoist sect saw venerable willow deity making a move, they were shocked as well.<br/><br/>They were also very surprised. Why did their venerable deity suddenly make a move to help the Dragon Palace.<br/><br/>“Eh?”<br/><br/>Wang Xian looked at the venerable willow deity who suddenly appeared in the sky and revealed a stunned expression.<br/><br/>Compared to the venerable willow deity whom he met last time, he looked much younger.<br/><br/>“Thank you for your help, Venerable Willow God.”<br/><br/>Wang Xian thanked him immediately.<br/><br/>“No need. I will help you fend off the blood dragon and the dragon skeleton.”<br/><br/>The Venerable Willow God shook his head and said faintly.<br/><br/>“Huh?”<br/><br/>Upon hearing her words, Wang Xian was surprised again.<br/><br/>The Venerable Willow God helped the Dragon Palace fend off the dragon skeleton and the blood dragon?<br/><br/>It seemed that he was very confident in his own strength.<br/><br/>“After this battle, our Dragon Palace will definitely repay venerable willow deity.”<br/><br/>Wang Xian said sincerely.<br/><br/>If he could help the dragon palace at this time, the Dragon Palace would definitely repay him tenfold or a hundred times in the future.<br/><br/>“Hehe, there’s no need. Dragon King, you did me a favor last time.”<br/><br/>Venerable willow deity shook her head and waved the willow tree with her arm.<br/><br/>Whoosh! Whoosh! Whoosh<br/><br/>In the next moment, countless willow branches in the sky attacked the dragon skeleton and the leader of the bloody clan.<br/><br/>She wanted to fight two of them alone.<br/><br/>“Venerable Willow Deity, do you know that you are playing with fire? !”<br/><br/>The Golden Skeleton Patriarch looked over and roared with an unsightly expression.<br/><br/>Venerable Willow Deity wanted to help the Dragon Palace.<br/><br/>With Venerable Willow Deity’s terrifying power, it was impossible to destroy the Dragon Palace.<br/><br/>Moreover, looking at venerable willow deity who was confident that he could fight two of them alone, he had a bad premonition.<br/><br/>“You dare to say that you want to take on the two of us by yourself? Kill them!”<br/><br/>The blood on the body of the ruthless blood race turned into a sea of blood as they attacked the willow branches.<br/><br/>“Pa! PA! Pa!”<br/><br/>However, the countless willow branches slashed through the sea of blood and continued to attack the blood dragon.<br/><br/>The other part of the willow branches attacked the dragon skeleton.<br/><br/>“Roar!”<br/><br/>“Die!”<br/><br/>When the dragon skeleton saw the terrifying willow branches, the flames in its pupils kept jumping. A flame of the Law of darkness attacked the willow branches.<br/><br/>“Whoosh! Whoosh! Whoosh!”<br/><br/>However, when the flame of the Law of darkness landed on the willow branches, the willow branches emitted a green glow. It passed through the willow branches and continued to attack the dragon skeleton.<br/><br/>One against two, he was not at a disadvantage at all.<br/><br/>“Kill, kill all of them. Leave No one alive!”<br/><br/>When Wang Xian saw the venerable willow deity taking action, he instantly restrained the dragon skeleton and the Blood Dragon. His eyes were also shining.<br/><br/>He turned his gaze to the side and roared with killing intent.<br/><br/>“Boom! Boom! Boom!”<br/><br/>As soon as he finished his sentence, a Level 1 universe knight from the skeleton race took a look.<br/><br/>Peng<br/><br/>The huge dragon claw scattered the skeleton, and the destroyed energy instantly killed it.<br/><br/>Roar! Roar! Roar<br/><br/>Thunder roared. Without the dragon skeleton and blood dragon to stop him, thunder exploded from his body and instantly appeared behind nine blade leader.<br/><br/>“Damn it!”<br/><br/>“Damn Willow God Knight, do you know what you’re doing?”<br/><br/>The nine swords clan leader’s heart tightened, and a panicked expression appeared on his face as he shouted sternly.<br/><br/>“Die, Thunder Dragon Punishment!”<br/><br/>Thunder’s voice exploded beside his ears, and thunder opened his huge dragon mouth, directly swallowing the nine swords clan leader.<br/><br/>The Thunder in his mouth landed around the nine swords clan leader, making it impossible for him to escape.<br/><br/>“No, no, no, save me!”<br/><br/>Nine Sword clan leader felt the threat of death, and he screamed in panic.<br/><br/>Roar<br/><br/>However, what greeted him was endless thunder and endless darkness.<br/><br/>He was swallowed by the Thunder, and the Thunder struck toward his body.<br/><br/>“What!”<br/><br/>“Clan leader, Clan Leader!”<br/><br/>“No! Clan leader!”<br/><br/>On Skeleton Island, the Great Beings of the nine sword clan heard the screams of their clan leader, and their bodies trembled violently.<br/><br/>They raised their heads and looked up, their faces filled with death.<br/><br/>Right now, their leader was the only universe knight in the entire nine-blade race.<br/><br/>If their leader died now, their entire nine-blade race would be completely finished.<br/><br/>They would be completely annihilated.<br/><br/>A great being named nine-blade race trembled as he stared fixedly at Thunder.<br/><br/>“Roar!”<br/><br/>However, they soon saw Lei Ming open his dragon head and spit out a corpse.<br/><br/>The corpse quickly fell downwards.<br/><br/>The nine swords race’s clan leader had fallen.<br/><br/>“Hiss!”<br/><br/>Seeing the entire situation change in an instant, the surrounding hundreds of thousands of spectators sucked in a breath of cold air.<br/><br/>In an instant, the experts from the ancient painting sect and Venerable Willow God had made their moves.<br/><br/>The fall of the nine sword race’s clan leader.<br/><br/>The attacks from the four great forces had completely eliminated the nine sword race.<br/><br/>The fall of the nine sword race’s clan leader meant that the Milky Way had lost another primary race of the universe.<br/><br/>“Venerable Willow God’s strength is too strong.”<br/><br/>Everyone sighed in their hearts.\t\t\t\t\t\t</div>", "images": {}, "success": true}