{"id": 173, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15072247.html", "title": "Chapter 3164 - Chapter 3164: 3,163 Was Annihilated", "volume": 2, "volume_title": "Volume 2", "body": "<h1>Chapter 3164 - Chapter 3164: 3,163 Was Annihilated</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 3164: 3,163 was annihilated<br/><br/>“The nine-blade race has been completely annihilated.”<br/><br/>“The leader of the nine-blade race has fallen. Nine Blades no longer has a single universe knight, and there are only 7,000 to 8,000 of the 30,000 elite warriors left.”<br/><br/>“Willow God Knight actually managed to pin down two universe knight level 3 warriors, this…”<br/><br/>Everyone watching the battle had shocked expressions as they watched the scene in front of them.<br/><br/>The death of the nine swords clan leader was enough to announce the extermination of the nine swords clan.<br/><br/>The strength of the willow deity had exceeded everyone’s expectations.<br/><br/>They were all looking at the scene in shock.<br/><br/>“Kill!”<br/><br/>After killing a universe knight, Wang Xian was still moving at his maximum speed. His gaze was fixed on a level two universe knight from the bloodthirsty race.<br/><br/>Boom<br/><br/>At the next moment, Wang Xian appeared in front of him. His terrifying dragon claws clawed at him.<br/><br/>“Oh no!”<br/><br/>The Level 2 universe Knight of the bloodthirsty race had a drastic change of expression when he saw this scene. He did not hesitate at all and quickly dodged to the side.<br/><br/>“Can you dodge it?”<br/><br/>A cold voice came from behind. One by one, the arrays bombarded him.<br/><br/>“What!”<br/><br/>“Leader, save me!”<br/><br/>The Universe Knight of the bloody race, a level two great being, narrowed his eyes and hurriedly asked the leader for help.<br/><br/>“Hong! Hong! Hong!”<br/><br/>However, very soon, his voice came to an abrupt halt, and terrifying arrays fell one after another.<br/><br/>“Kill!”<br/><br/>On the side, ao crab and the three universe knight level two underlings were crazily surrounding and attacking the last universe knight level two, which was the golden skeleton leader.<br/><br/>“Willow deity Knight, how dare you join our war? We will definitely kill you in the future.”<br/><br/>The Golden Skeleton Clan Leader saw the four devouring dragons attacking him, and he roared in fear.<br/><br/>The situation was changing rapidly, and he had a bad feeling about it.<br/><br/>“Get lost, Willow Deity Knight, get lost!”<br/><br/>The blood violence clan leader’s expression also changed. His clansmen at the knight level were being killed one by one, and this willow deity knight who suddenly appeared in front of him, the terrifying branches made it impossible for him to break free.<br/><br/>Even if he wanted to help, he couldn’t.<br/><br/>This caused his body to emit a dense blood qi, and his pair of blood red eyes stared fiercely at the willow deity.<br/><br/>However, the willow deity didn’t move at all.<br/><br/>Since she had chosen to act, she knew the consequences of her actions.<br/><br/>The best way was to leave them all here and exterminate them all.<br/><br/>“Scram!”<br/><br/>“Roar Roar Roar!”<br/><br/>The dragon skeleton at the side saw that the golden skeleton patriarch was in danger and let out a furious roar.<br/><br/>The dragon bones in his body began to change, and the dragon bones began to shift, turning his entire body into an incomparably sharp weapon.<br/><br/>His body rolled, and the willow branches were stirred and broken.<br/><br/>“Oh?”<br/><br/>Venerable Willow Deity’s expression changed slightly when she saw this scene.<br/><br/>She waved her arm, and willow leaves flew directly towards his body.<br/><br/>However, the willow leaves landed on the dragon bone, and did not cause much damage.<br/><br/>“Roar Roar Roar!”<br/><br/>“The dragon body that controls our divine dragon, I will destroy you!”<br/><br/>Lei Ming raised his dragon head, and his eyes were also filled with a violent and dense look.<br/><br/>He rushed over and directly attacked the dragon skeleton.<br/><br/>“Roar Roar Roar, I want to Devour Your Bloodline.”<br/><br/>The dragon skeleton coldly roared as he watched the Lightning Dragon attack him.<br/><br/>However, his eyes revealed a trace of solemnity.<br/><br/>After ten days of fighting, they had some understanding of each other’s strength.<br/><br/>The Lightning Dragon was stronger than them.<br/><br/>Now that the other party had added a venerable willow deity, they were no longer a match for the Dragon Palace.<br/><br/>“Roar, Golden Bones!”<br/><br/>He roared and called out to the golden skeleton clan leader.<br/><br/>“Retreat, all members of the skeleton clan, Retreat!”<br/><br/>The golden skeleton clan leader heard the voice of the dragon skeleton and roared indignantly.<br/><br/>“Isn’t it a little too late to retreat?”<br/><br/>Wang Xian’s sinister voice was heard. His body moved and instantly appeared in front of the Golden Skeleton clan leader. His dragon tail swept towards him.<br/><br/>“Not good, clan leader. We are surrounded by an array. We can not escape immediately. We Need clan leader to break the array.”<br/><br/>“Lord Dragon Skeleton, break the array.”<br/><br/>Around them, many universe Knight Level 1 warriors heard the clan leader’s order and wanted to escape back to their God country.<br/><br/>However, they were shocked to find that the array was enveloping them.<br/><br/>With their strength, they couldn’t break the array.<br/><br/>In addition, there were three or four universe knights from Dragon Palace surrounding them, which made their faces full of fear and despair.<br/><br/>Without the protection of their leader and Lord Dragon Skeleton, they were no match for the Great Beings from Dragon Palace.<br/><br/>“Damn it, the skeleton race and the bloody race are going to retreat!”<br/><br/>“It’s all because of that damn Willow God Knight. If she hadn’t suddenly attacked, Dragon Palace wouldn’t have gained the upper hand.”<br/><br/>“Willow God Knight, you’re making an enemy out of our ancient painting sect.”<br/><br/>The two universe knights of the Ancient Painting sect roared with an extremely ugly expression.<br/><br/>“HMPH!”<br/><br/>Willow God Knight heard their words and snorted lightly, ignoring them.<br/><br/>“Let’s go, we’ll go too!”<br/><br/>The left protector of the ancient painting sect said immediately with a gloomy face.<br/><br/>“Go? Do you think it’s so easy to escape after attacking our Dragon Palace?”<br/><br/>The figure of the sky array appeared behind them unknowingly and stared at them coldly.<br/><br/>“Haha, Your Dragon Palace still wants to keep us here?”<br/><br/>The two of them stared at the sky array with gloomy eyes.<br/><br/>“That’s right, we want to keep you here.”<br/><br/>As the sky array spoke coldly, the surrounding formations rose up and covered them directly.<br/><br/>“PFFT!”<br/><br/>“Ahhh!”<br/><br/>At this moment, a scream was heard. Their expressions changed slightly as they looked to the side.<br/><br/>Two universe knights were killed by the powerhouse from the Dragon Palace.<br/><br/>Their expressions froze slightly.<br/><br/>“Bang, Bang, Bang!”<br/><br/>A loud noise was heard. Under the combined attack of Wang Xian, ao crab, and the other three, the golden skeleton patriarch could not retaliate at all.<br/><br/>Terrifying attacks landed on his body one after another, causing cracks to appear on his body rapidly.<br/><br/>His eyes were filled with fear.<br/><br/>“Lord Dragon Skeleton, save me!”<br/><br/>The golden skeleton clan leader cried out for help in despair.<br/><br/>“Today, all of you from the three races will die!”<br/><br/>Wang Xian said coldly.<br/><br/>“Hehehe, kill, I will kill, not a single one will be spared!”<br/><br/>The eight-limbed demon demon duo were like black ghosts as they burrowed into the bodies of the universe knights.<br/><br/>The AO Yao swam in the light and darkness, carrying out terrifying hunting over and over again.<br/><br/>Without the interference of the two universe knights, they quickly harvested the universe knights of the skeleton race and the blood-thirsty race.<br/><br/>“Run!”<br/><br/>The blood-thirsty race felt this scene, and their bodies trembled.<br/><br/>They had lost. They had been completely defeated.<br/><br/>From now on, they would run away as much as they could.<br/><br/>He moved his body, but he didn’t want to fight anymore. He wanted to run back.\t\t\t\t\t\t</div>", "images": {}, "success": true}