{"id": 175, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15072251.html", "title": "Chapter 3166 - Chapter 3166: 3,165 Wins", "volume": 2, "volume_title": "Volume 2", "body": "<h1>Chapter 3166 - Chapter 3166: 3,165 Wins</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 3166: 3,165 wins<br/><br/>“Ah! Ah! Ah! Ah!”<br/><br/>Screams kept coming from the battlefield.<br/><br/>Every scream made the hearts of the spectators tremble.<br/><br/>Even the Universe Knights from the universe primary races pursed their lips.<br/><br/>The screams came from the universe knights.<br/><br/>The Universe Knights of the three races were killed one by one.<br/><br/>The two universe knights of the ancient painting sect were attacked by the Dragon Palace. In less than 10 minutes, their bodies started to collapse.<br/><br/>They started to scream in fear.<br/><br/>However, it was useless. It was just a useless roar.<br/><br/>“The three races are finished. The two universe knights of the ancient painting sect are finished too.”<br/><br/>“I don’t know why Willow Deity Knight helped Dragon Palace so much. With willow deity Knight helping Dragon Palace, even the ancient painting sect can’t do anything to Dragon Palace, right?”<br/><br/>“Are the nine wind and Thunder Dragons from Dragon Palace pure-bred godly dragons? However, I feel that every member of Dragon Palace is very terrifying.”<br/><br/>In the surrounding area, a group of Milky Way great beings looked on in shock.<br/><br/>Basically, more than half of the universe knights from the Milky Way had rushed over.<br/><br/>However, the universe knights who were killed by the Dragon Palace this time made them tremble.<br/><br/>Even the few venerables from the misty race were filled with respect.<br/><br/>The Dragon Palace’s strength was much stronger than their misty race.<br/><br/>With this strength, the ancient art sect should only be so-so.<br/><br/>“Surround and attack that dragon skeleton and destroy it!”<br/><br/>After killing the two great beings from the ancient art sect, Wang Xian immediately ordered.<br/><br/>“It’s the Dragon King!”<br/><br/>“Kill!”<br/><br/>Boom! Boom! Boom<br/><br/>In an instant, the sky array ao crab and nearly 30 other universe knights rushed over and began to surround and attack the dragon skeleton.<br/><br/>The dragon skeleton, which was already suppressed by Venerable Willow God and Lei Ming, had a drastic change in expression when it saw more than 30 universe knights attacking him.<br/><br/>He was filled with panic and fear.<br/><br/>Wang Xian’s gaze swept across the place and landed on the Skeleton Island.<br/><br/>On the skeleton island, the disciples of the skeleton race, the bloodthirsty race, and the nine-sword race had yet to be completely exterminated.<br/><br/>In front of them, a huge earthy yellow coffin was suspended in the air, releasing terrifying attacks.<br/><br/>A coffin was able to withstand the five universe knights.<br/><br/>“This coffin is not simple!”<br/><br/>Wang Xian squinted his eyes and flew to the sky above the coffin. The five elements millstone came to his body and pressed down on the coffin.<br/><br/>Crack! Crack! Crack<br/><br/>The coffin sensed a strong threat. The lid on the coffin opened abruptly and a stream of earthy yellow sand rushed towards the five elements millstone.<br/><br/>“Huh?”<br/><br/>Wang Xian’s eyes narrowed slightly. He waved his dragon claws and the power of the five elements landed on the five elements millstone.<br/><br/>Boom<br/><br/>The five divine dragons on the five elements millstone revolved and the destructive power of the five elements rushed towards the sand stream.<br/><br/>A dull sound rang out. The sand stream was slowly suppressed and fell into the coffin lid.<br/><br/>Boom<br/><br/>Finally, the Five Elements Millstone landed on the top of the coffin and completely suppressed it.<br/><br/>“This coffin is not simple. It should be considered the pinnacle among the acquired Numinous Treasures.”<br/><br/>Wang Xian sensed the power coming from the coffin below and was a little shocked.<br/><br/>A group of godly king level skeletons could actually unleash such a terrifying power when they sacrificed the coffin.<br/><br/>“Heaven Burial!”<br/><br/>Soon, Wang Xian received information about the coffin from the five elements millstone.<br/><br/>“This name is really domineering. I wonder if the great mill of five elements will be able to evolve after devouring it. However, it shouldn’t be a problem.”<br/><br/>Wang Xian scanned his surroundings.<br/><br/>This time, after killing the Universe Knights of the three races, the Dragon Palace was able to obtain more than ten acquired spiritual treasures.<br/><br/>Among them, more than half of the five elements attributes were obtained.<br/><br/>“Kill everyone from the skeleton race, the nine-sword race, and the bloodthirsty race.”<br/><br/>At this moment, Prime Minister Gui’s voice rang out.<br/><br/>The last line of defense was suppressed by Wang Xian. On the Skeleton Island, there were still some disciples from the three races.<br/><br/>As the command rang out, the five universe knights from the Dragon Palace led the charge.<br/><br/>Escape?<br/><br/>There was no way to escape.<br/><br/>“How could this be? We are not reconciled, we are not reconciled!”<br/><br/>“We have already escaped. Why did we come back? Why?”<br/><br/>When the powerful disciples of the nine-sword race saw this scene, their faces were filled with unwillingness and helplessness.<br/><br/>Why was the Dragon Palace so strong?<br/><br/>Why did they still have to come back? If they didn’t come back, they wouldn’t have been annihilated.<br/><br/>It was fate!<br/><br/>It was all because the dragon palace was too strong.<br/><br/>Following that, some of the disciples of the three races didn’t have the ability to resist at all.<br/><br/>They were being hunted down rapidly.<br/><br/>Wang Xian looked at them coldly.<br/><br/>“Roar! Roar! Roar!”<br/><br/>Twenty minutes later, accompanied by a roar filled with unwillingness, an incomparably huge body fell towards the bottom of the Milky Way, announcing the end of this war.<br/><br/>That incomparably huge dragon skeleton was completely annihilated under the siege.<br/><br/>On the skeleton island in front, all the people of the three clans were exterminated.<br/><br/>All the people from the most miserable skeleton race were exterminated.<br/><br/>“Clean up the battlefield and bring the skeleton island to the front of the Dragon Palace.”<br/><br/>Wang Xian looked at the end of the war and smiled.<br/><br/>“It’s the Dragon King!”<br/><br/>Prime Minister Gui replied immediately and the universe knights from the Dragon Palace flew over.<br/><br/>Wang Xian floated in the air and swept his gaze across the people who were watching the battle.<br/><br/>Everyone around felt Wang Xian’s gaze and felt a chill in their hearts.<br/><br/>“Congratulations to the Dragon King for slaying a strong enemy. Congratulations to the Dragon Palace for achieving victory!”<br/><br/>“Congratulations to the Dragon King for slaying a strong enemy. Congratulations to the Dragon Palace for achieving victory!”<br/><br/>The group of supremacies from the foggy race looked at each other and cupped their hands respectfully.<br/><br/>“Congratulations to the Dragon King for slaying a strong enemy. Congratulations to the Dragon Palace for achieving victory!”<br/><br/>The surrounding experts quickly followed and bowed.<br/><br/>The Dragon Palace was fighting three enemies by themselves, and only the blood evil clan leader escaped. With such strength, it could be said that the Dragon Palace could destroy all the powerful races in the Milky Way.<br/><br/>With such terrifying strength, they were invincible in the Milky Way.<br/><br/>Even the misty race had to lower their heads and be respectful.<br/><br/>“In the future, it is forbidden to kill any innocent dragon species in the Milky Way. If you violate this rule, your entire race will be exterminated!”<br/><br/>Wang Xian swept his gaze across them and announced calmly.<br/><br/>“It’s the Dragon King. We will naturally follow the orders of the Dragon Palace.”<br/><br/>As soon as Wang Xian finished his sentence, a universe knight immediately chimed in.<br/><br/>“We will naturally follow the orders of the Dragon Palace!”<br/><br/>Everyone else also responded hurriedly.<br/><br/>“Okay!”<br/><br/>Wang Xian nodded his head faintly. He looked at the venerable willow deity behind him and smiled.<br/><br/>“Thank you for your help this time, venerable willow deity. Please!”<br/><br/>He flew to the front of the venerable willow deity and gestured with his hand.<br/><br/>“Dragon King, you don’t have to be so polite.”<br/><br/>The Venerable Willow deity smiled and followed Wang Xian into the Dragon Palace.<br/><br/>“Clean up the battlefield and return to the Dragon Palace to celebrate!”<br/><br/>Prime Minister Gui’s voice rang out, followed by a loud shout, “Invincible in the Dragon Palace!”<br/><br/>“Invincible in the Dragon Palace!”\t\t\t\t\t\t</div>", "images": {}, "success": true}