{"id": 177, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15072255.html", "title": "Chapter 3168 - Chapter 3168: 3167 Black Spider Lilies And Dragon Bones", "volume": 2, "volume_title": "Volume 2", "body": "<h1>Chapter 3168 - Chapter 3168: 3167 Black Spider Lilies And Dragon Bones</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 3168: 3167 black spider lilies and dragon bones<br/><br/>“Venerable willow deity, I would like to invite you to join the Dragon Palace. I wonder if venerable willow deity…”<br/><br/>The upgrade of the Dragon Palace was completed bit by bit. Wang Xian looked at the astonished venerable willow deity with a smile on his face.<br/><br/>“Join the Dragon Palace!”<br/><br/>Venerable willow deity was slightly shocked as his expression changed.<br/><br/>“Venerable Willow Deity, you should be able to sense the extraordinariness of our Dragon Palace. Our Dragon Palace is the true lineage of the Divine Dragons. We have pure-bred divine dragons and a powerful and heaven-defying wood-attribute supreme treasure.”<br/><br/>“If venerable willow deity were to join the Dragon Palace, he would be able to evolve once again. It shouldn’t be a problem for him to fight above his level.”<br/><br/>Wang Xian smiled at Venerable Willow Deity.<br/><br/>“Then what is the wood-attribute Supreme Treasure Ahead?”<br/><br/>Venerable willow deity pursed his lips and looked at the ancestral tree in front of him.<br/><br/>“A powerful supreme treasure. Forgive me for not being able to tell you.”<br/><br/>Wang Xian shook his head.<br/><br/>“Alright, I’m willing to join the Dragon Palace.”<br/><br/>Venerable Willow God hesitated for a moment before nodding her head.<br/><br/>Now that she had helped the Dragon Palace, many people thought that she was tied to the Dragon Palace.<br/><br/>Furthermore, because of her actions, two venerables from the ancient art sect were killed.<br/><br/>Indirectly, she had formed a grudge with the ancient art sect.<br/><br/>With the strength of the ancient painting sect, she was no match for them.<br/><br/>Joining the Dragon Palace was a better choice.<br/><br/>Of course, the most important thing was that she could sense a fatal temptation from the divine tree behind the dragon throne.<br/><br/>An item that could make her heart tremble was definitely not simple.<br/><br/>“Alright, Venerable Willow Deity, you have joined the Dragon Palace. Let’s go to the dragon transformation pool first.”<br/><br/>As Wang Xian spoke, he brought her into the dragon transformation pool.<br/><br/>When venerable willow deity arrived in front of the dragon transformation pool, she sensed a majestic divine dragon aura.<br/><br/>Her eyes were filled with shock as she sensed the large amount of dragon blood in the dragon transformation pool.<br/><br/>Back then, some powerful factions went on a killing spree for some dragon blood.<br/><br/>Now, the dragon blood in front of her was enough to make everyone go crazy.<br/><br/>However, what she didn’t know was that the dragon blood was all extracted from the corpses of the three races.<br/><br/>Although there were still many corpses that had yet to be digested, there was at least the energy of more than ten universe knights inside.<br/><br/>“Venerable Willow Deity, you just need to complete the transformation. Don’t absorb too much dragon blood for now.”<br/><br/>Wang Xian reminded her.<br/><br/>Venerable Willow Deity was currently at level three of the Universe Knight Realm. She wouldn’t need too much dragon blood to undergo the transformation.<br/><br/>However, if she were to use it to improve herself, the resources she obtained this time wouldn’t be enough.<br/><br/>“Alright!”<br/><br/>Venerable willow deity nodded her head. Suddenly, a thought occurred to her and dragon scales appeared in her palm.<br/><br/>“Dragon King, these are the dragon scales that were plucked from the leader of the bloodthirsty race.”<br/><br/>As she spoke, she passed it to Wang Xian.<br/><br/>Wang Xian was slightly taken aback. Looking at the dragon scale that was obviously from the Green Dragon, he hesitated for a moment.<br/><br/>“Take it first. See if you can use it when you transform later.”<br/><br/>His eyes flickered as he said.<br/><br/>“Alright!”<br/><br/>Venerable Willow God nodded and flew directly into the dragon transformation pool.<br/><br/>In the dragon transformation pool, there were quite a number of members of the Dragon Palace who were in the process of upgrading.<br/><br/>“With the dragon scales, the venerable willow deity should be able to improve a lot.”<br/><br/>“I hope it will bring some surprises.”<br/><br/>Seeing the venerable willow deity enter the dragon transformation pool, he muttered and moved to the Dragon King Palace.<br/><br/>“Dragon King!”<br/><br/>At this time, Prime Minister Gui and the leaders of the Dragon Palace were waiting inside the Dragon King Palace.<br/><br/>In the center of the Dragon King Palace, there were treasures.<br/><br/>Over a dozen acquired spiritual treasures that were emitting powerful energy.<br/><br/>Over a dozen boxes contained large amounts of skulls that contained special energy.<br/><br/>There were also all sorts of other godly weapons.<br/><br/>The most eye-catching one was the skeleton placed in the center, it was the real Dragon God’s skeleton.<br/><br/>To be able to make a skeleton have the combat strength of a universe Knight Level 3, this Dragon God was at least level 8 or 9.<br/><br/>It could even be at the level of a universe Knight Overlord.<br/><br/>From the attributes, it should be an earth-attributed divine dragon.<br/><br/>“What did you get from this battle?”<br/><br/>Wang Xian squinted his eyes slightly. His gaze swept across the treasures in the Dragon King Hall and asked.<br/><br/>“Yes, Dragon King. This is a relatively precious item that we obtained.”<br/><br/>Prime Minister Gui nodded his head.<br/><br/>Wang Xian’s figure moved and flew to the front of the dragon bone. His eyes flickered as he sensed something.<br/><br/>This was the first time he had seen the dragon bone of a purebred divine dragon.<br/><br/>When his palm landed on it, he immediately felt a sense of blood connection.<br/><br/>Ding! “The bone of a purebred divine dragon has been detected. Is it absorbed?”<br/><br/>The system’s voice rang out. Wang Xian narrowed his eyes slightly and revealed a look of surprise and delight.<br/><br/>This gigantic dragon bone should be able to upgrade him.<br/><br/>“Dragon King, other than this dragon bone, we have also found a large number of these skulls on the skeleton island. The energy contained within these skulls is very powerful.”<br/><br/>Prime Minister Gui walked over and handed a skull to him as he spoke in surprise.<br/><br/>“HMM?”<br/><br/>Wang Xian nodded and took it. He felt the energy coming from it and clicked his tongue slightly. “What is this skull used for?”<br/><br/>“They can be used as a powerful divine weapon. They can also be used to condense new skulls.”<br/><br/>Prime Minister Gui opened his mouth and continued, “These skulls can be converted into dragon blood.”<br/><br/>Wang Xian nodded his head and looked to the side.<br/><br/>With a wave of his arm, he kept half of the acquired Numinous Treasures for the five elements grinding to absorb. The remaining acquired Numinous Treasures were left for them to distribute.<br/><br/>“Dragon King, there is another mystical item here. We obtained it from the deepest part of the skeleton clan’s treasury.”<br/><br/>At this moment, Prime Minister Gui opened a box. Inside the box was a black flower.<br/><br/>Buzz! Buzz! Buzz<br/><br/>Buzz! Buzz<br/><br/>All of a sudden, a decadent sound came from within the flower. The sound was filled with all kinds of murmurs, evil, and filth.<br/><br/>This made Wang Xian slightly dazed. His eyes revealed a look of shock.<br/><br/>“What is this thing?”<br/><br/>His pupils constricted slightly as he sized it up carefully. There was a hint of fear in his eyes.<br/><br/>A black flower could actually make him feel evil and depravity.<br/><br/>Black Resurrection Lily: ruler of the universe level (deceased).<br/><br/>At this moment, the voice of the system appeared in his mind. His gaze focused slightly.<br/><br/>“Black Resurrection Lily? I’ve only heard of the radiant resurrection Lily.”<br/><br/>Wang Xian had a puzzled look on his face. There was no information about this black resurrection Lily in the Divine Dragon inheritance.<br/><br/>However, he knew about the radiant resurrection Lily.<br/><br/>He learned about the radiant resurrection Lily from the records of the Crescent Moon Venerable.<br/><br/>According to the records of the Crescent Moon Venerable, the Radiant Resurrection Lily was the ultimate treasure of the angel race.<br/><br/>This kind of true treasure could greatly increase the radiant Angel’s Combat Power.<br/><br/>It could make people listen to holy words and make them submit to it.<br/><br/>“Radiant Resurrection Lily, Black Resurrection Lily. It seems that they are very likely to be treasures of the same level. Even if this radiant resurrection Lily is dead, it can still have such an ability. It’s not simple.”<br/><br/>He muttered and gradually got used to this fallen voice. He picked it up.\t\t\t\t\t\t</div>", "images": {}, "success": true}