{"id": 185, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15072271.html", "title": "Chapter 3176 - Chapter 3176: 3175 Demon God Palace", "volume": 2, "volume_title": "Volume 2", "body": "<h1>Chapter 3176 - Chapter 3176: 3175 Demon God Palace</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 3176: 3175 Demon God Palace<br/><br/>Buzz! Buzz! Buzz<br/><br/>At a corner of the Tianhai Dragon Palace, a terrifying black poisonous fog was spreading forward.<br/><br/>In the surroundings, numerous demon beasts were dodging to the side in fear.<br/><br/>Wang Xian looked at the poisonous fog that was spreading towards him and the escaping female demon beast with a human body and snake tail. He raised his eyebrows slightly.<br/><br/>Seeing this woman reminded him of the powerful existence Nüwa in the legends of Earth.<br/><br/>Of course, there was no Nüwa in the universe, nor was there a saint.<br/><br/>Wang Xian watched as the female snake flew towards him. When he saw the poisonous fog spreading towards him, he waved his arm.<br/><br/>Buzz<br/><br/>Buzz! Buzz! Buzz<br/><br/>In an instant, the poisonous fog dissipated.<br/><br/>“Who is it? Which one of You is courting death? How dare you stop my thousand-tool great demon from moving?”<br/><br/>The octopus-like great demon in front of him had a pair of compound eyes filled with coldness. He stared at Wang Xian with more than ten pairs of eyes.<br/><br/>“Thank you, thank you for saving my life, Senior.”<br/><br/>When the female snake saw Wang Xian cleaning up all the poisonous fog, a look of survival appeared on her face.<br/><br/>She didn’t dare to stay here any longer. Her figure slowly turned illusory and disappeared.<br/><br/>Wang Xian glanced at her and didn’t say anything.<br/><br/>When he saw the female snake escaping back to his divine kingdom, the thousand-tool great demon stared at Wang Xian with a sinister look.<br/><br/>“Kid, State Your Name.”<br/><br/>To be able to eliminate his attack instantly, the other party’s strength was definitely at the level of a supremacy.<br/><br/>The thousand-weapon demon didn’t dare to attack rashly.<br/><br/>“Don’t be too arrogant.”<br/><br/>Wang Xian stared at the thousand-weapon demon and said expressionlessly.<br/><br/>When he came, the thousand-weapon demon was filled with unbridled fear. Earlier on, he had launched an area-of-effect attack.<br/><br/>If Wang Xian wasn’t here, he wouldn’t have bothered with him. However, since he was here, he couldn’t allow this fellow to Prance around in front of him.<br/><br/>“Father, have you captured that female snake?”<br/><br/>“I want her to be my female slave.”<br/><br/>At this moment, a few demonic beasts that were similar to the great demon of the thousand-artifact realm flew over from the back. They scanned their surroundings and spoke<br/><br/>“That thousand-tool great demon is from the Demon God Palace.”<br/><br/>“He is a great demon from the Demon God Palace. The Demon God Palace is very powerful on our side.”<br/><br/>“Who are those two people? Since he dares to make a move, he should be at the level of a supremacy.”<br/><br/>In the surrounding area, some demonic beasts were discussing in a low voice.<br/><br/>“Demon God Palace?”<br/><br/>Wang Xian heard the discussions around him and raised his eyebrows slightly.<br/><br/>He had heard of the Palace of Demon God. It was a very powerful demonic beast faction.<br/><br/>There were nine demonic beast races in the entire Palace of Demon God. Every demonic beast race had great demons.<br/><br/>It could be said that the palace of Demon God was a relatively powerful demonic beast faction in the surrounding starry skies.<br/><br/>Wang Xian looked at the few demonic beasts that were flying over. He narrowed his eyes slightly and didn’t say anything. He flew straight ahead.<br/><br/>Thousand-tool stared at Wang Xian and the willow deity coldly. After hesitating for a moment, he didn’t make a move.<br/><br/>The other party wasn’t weak. If he was alone, he wouldn’t fight with them recklessly.<br/><br/>“Father.”<br/><br/>A few demonic beasts at the side saw their father’s grave expression and called out softly.<br/><br/>“We were disturbed by that fellow. Let’s go.”<br/><br/>Thousand-tool said coldly and flew straight to the side.<br/><br/>Wang Xian continued to circle around the entire skysea Dragon Palace to investigate the situation.<br/><br/>In the following period of time, more and more demon beasts gathered at the skysea Dragon Palace.<br/><br/>The opening date of the skysea Dragon Palace was getting closer and closer.<br/><br/>Wang Xian was at the side of the East Gate of the skysea Dragon Palace, waiting quietly.<br/><br/>According to the information he received, the opening of the skysea Dragon Palace would sometimes open four dragon gates at the same time. Sometimes, only one dragon gate would be opened.<br/><br/>However, he was sure that the east gate would open every time.<br/><br/>A large number of demon beasts had gathered at the east gate.<br/><br/>With a glance, there were more than 100 Demon Beasts at the Universe Knight level. This was a feast for the Demon Beasts.<br/><br/>“Roar! Roar! Roar!”<br/><br/>One day before the Sky Sea Dragon Palace opened, a roar came from behind.<br/><br/>A terrifying pressure came from behind.<br/><br/>The hearts of the Demon Beasts at the east gate trembled, and they immediately looked back.<br/><br/>“It’s the Sky Dragon Clan, the Sky Dragon Clan is here!”<br/><br/>“Hiss, the leader of the Sky Dragon Clan, the Sky Dragon King, should be at the front. Hiss, four venerable level Sky Dragons pulling the dragon chairs, as expected of the Sky Dragon Clan.”<br/><br/>“This is a powerful race of the Divine Dragon Clan in the universe.”<br/><br/>“The Sky Dragon Clan will definitely come every time the Sky Sea Dragon Palace opens. They can easily enter the Dragon Palace because of the Sky Sea Dragon Palace, which is why the Sky Dragon Clan can rise so quickly.”<br/><br/>The surrounding demon beasts looked over, and even some of the big demons were staring at them with sparkling eyes.<br/><br/>The Sky Dragon clan was very powerful, and among the demon beasts, they had great prestige.<br/><br/>After all, the Sky Dragon Clan had several universe knights with level 3 combat strength.<br/><br/>“Roar!”<br/><br/>In front of them, four Sky Dragons pulling the dragon chairs roared. In the middle of the East Gate of the Sky Sea Dragon Palace, all the demon beasts made way.<br/><br/>The Sky Dragon King scanned the surroundings and paused on Wang Xian for a few seconds. His eyes were shining.<br/><br/>He sat on the Dragon Throne and didn’t speak. He looked ahead with a dignified manner and waited quietly.<br/><br/>Some of the demonic beasts around looked over in awe. Their eyes were sparkling.<br/><br/>Boom! Boom! Boom<br/><br/>Not long after, a powerful pressure came from the back once again.<br/><br/>The imposing manner was not concealed at all and once again attracted the attention of all the demonic beasts around.<br/><br/>“It’s the four palace masters of the Demon God Palace!”<br/><br/>The group of demon beasts turned around and said when they saw the tens of thousands of demon beasts flying over.<br/><br/>Another powerful force, the Demon God Palace, rushed over. They took human forms, and the leader had the heads of birds, beasts, lions, tigers, and fish.<br/><br/>Their bodies were filled with a savage aura. They were the four palace masters of the Monster God Palace.<br/><br/>The Monster God Palace had nine clans and nine palaces. This time, the palace masters of the four palaces came.<br/><br/>“This monster God Palace is really strong.”<br/><br/>Wang Xian’s gaze swept across them. He could sense that the palace master of the Monster God Palace who had the heads of birds and beasts had the combat strength of A Level 3 universe knight.<br/><br/>“Sky Dragon King, you’re here early?”<br/><br/>The Palace Master of the Monster God Palace looked at the Sky Dragon King in the middle and said indifferently.<br/><br/>“Your Monster God Palace is really unwilling to give up. You come here every time. So what if you come? You Can’t pass the Dragon Gate.”<br/><br/>The Sky Dragon King looked at the crowd of the monster God Palace and said indifferently.<br/><br/>“Haha, how would we know if we don’t try? Your Sky Dragon Race has entered the Sky Sea Dragon Palace for so many times, but didn’t you obtain the inheritance of the Sky Sea Dragon King? I think you have no hope.”<br/><br/>The bird-beast-headed palace master’s expression changed slightly as he laughed and retorted.<br/><br/>“Shut up!”<br/><br/>When the Sky Dragon King heard his words, he looked over coldly.<br/><br/>“HMPH!”<br/><br/>The bird-beast-headed palace master from the Demon God Palace snorted coldly and didn’t dare to continue provoking them.<br/><br/>From their conversation, one could see the strength of both sides.\t\t\t\t\t\t</div>", "images": {}, "success": true}