{"id": 183, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15072267.html", "title": "Chapter 3174 - Chapter 3174: 3173 Plan Of The Heaven Dragon King", "volume": 2, "volume_title": "Volume 2", "body": "<h1>Chapter 3174 - Chapter 3174: 3173 Plan Of The Heaven Dragon King</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 3174: 3173 Plan of the Heaven Dragon King<br/><br/>The Heaven Sea Dragon King’s Dragon Palace was located on the Longming continent. The entire Longming continent was considered a very large continent in the surrounding starry skies.<br/><br/>Half of the continent was an ocean.<br/><br/>The Ocean was called the Heaven Sea.<br/><br/>The Heaven Sea was very famous in the surrounding starry skies because it was where the true dragons lived.<br/><br/>The Heaven Sea Dragon Palace opened once every ten thousand years. Every time it opened, a large number of demonic beasts gathered, with the aquatic demonic beasts as the main ones.<br/><br/>The Dragon Palace opened more than 10,000 times, and until now, only demon beasts were able to jump through the Dragon Gate.<br/><br/>This also caused the dragon palace to open mainly with demon beasts.<br/><br/>All kinds of great demons gathered here, wanting to enter the Dragon Palace.<br/><br/>And those who could be called great demons were all universe knights.<br/><br/>Everyone who could enter the Dragon Palace could obtain a lot of benefits.<br/><br/>Even the weakest one could transform into a sub-dragon and achieve a breakthrough in strength.<br/><br/>Three days later, Wang Xian read the information regarding the Sky Sea Dragon Palace. His eyes sparkled.<br/><br/>“Dragon King, I think we can go and take a look at the opening of the Sky Sea Dragon Palace this time. The leader of the Sky Dragon Clan was a sub-dragon. After entering, he obtained a huge opportunity and established a powerful force.”<br/><br/>Prime Minister Gui suggested.<br/><br/>“We should go and take a look. However, I’m curious as to why the Sky Sea Dragon Palace has not been inherited for more than a billion years.”<br/><br/>Wang Xian nodded. He was a little puzzled.<br/><br/>The Sky Sea Dragon Palace had been discovered for more than a billion years. According to the records, there were many existences above level five universe knights who came to explore, but they all failed.<br/><br/>This made him feel strange.<br/><br/>Could it be that there were other dragon species in the Dragon Palace?<br/><br/>Or maybe the Master of the Sky Sea Dragon Palace was a very powerful godly dragon when he was alive.<br/><br/>He was so powerful that he was above universe knights and a universe ruler.<br/><br/>But the Dragon Palace of a universe ruler could be so powerful.<br/><br/>If it was really a universe ruler-level dragon palace, there must be powerful treasures inside.<br/><br/>“I’ll bring the Willow deity with me to take a look in a few days. The rest of the members don’t have to go.”<br/><br/>Wang Xian said.<br/><br/>“It’s the Dragon King!”<br/><br/>Prime Minister Gui nodded.<br/><br/>There was no need to bring too many people to the ruins of the Sky Sea Dragon Palace.<br/><br/>He and the willow deity were enough.<br/><br/>The Willow Deity’s strength could be said to be invincible among level four universe knights. With his own strength, he could easily kill a level three universe knight.<br/><br/>In the next few days, the news about the Sky Sea Dragon Palace spread like wildfire in the Milky Way, and countless people were talking about it.<br/><br/>In addition, the Dragon Palace that belonged to the dragon God lineage had just risen, so the people were talking about it even more.<br/><br/>“The Green Province trading company is opening a teleportation array in the Milky Way to the starry sky around the Dragon Cry Continent to trade with each other.”<br/><br/>Right at this moment, a message suddenly spread in the Milky Way.<br/><br/>When the upper echelons of the Milky Way saw this message, they were slightly surprised.<br/><br/>“The Qingzhou Trading Company has actually opened a portal between our side and theirs. What a huge amount of money!”<br/><br/>“To open a portal from such a long distance, it will probably consume a lot of energy, right? I wonder what big business the Qingzhou Trading Company wants to do.”<br/><br/>“Now that the portal is open, it will be much easier for our side to go to their patch of the Galaxy.”<br/><br/>“As expected of the Green Province Trading Company. They are really generous, but the teleportation fee is so expensive!”<br/><br/>The opening of the teleportation array in the green province trading company did not cause much of a stir. However, every powerful race had received this message.<br/><br/>The best thing about the opening of the teleportation array was that it saved time.<br/><br/>If one were to go to the space in the Green Province Trading Company from the Milky Way, even a universe knight at level one would need several months to fly there.<br/><br/>However, it would only take a day to get there if a teleportation formation was opened.<br/><br/>In the past, the Milky Way and Qingzhou Trading Company did not open a teleportation formation there.<br/><br/>The main reason was that the consumption was too great. Even for the primary races in the universe, it was not worth it.<br/><br/>Perhaps only a large trading company like this would open a teleportation formation of this level.<br/><br/>“The Qingzhou Trading Company has opened a teleportation formation. It’s really a good time.”<br/><br/>In the Dragon King’s Hall, Wang Xian was pleasantly surprised when he received the news.<br/><br/>Initially, he planned to fly over in the next two days. Now that he had this teleportation formation, it was much more convenient.<br/><br/>However, Wang Xian did not plan to stay any longer.<br/><br/>In the afternoon, he called the willow deity and the two of them flew towards the teleportation formation of the Qingzhou Trading Company.<br/><br/>“Carry out the teleportation!”<br/><br/>When he arrived before the teleportation array, he immediately took out a large number of divine stones and handed them over.<br/><br/>“Alright.”<br/><br/>The experts of the Qingzhou trading firm nodded and immediately activated the teleportation array.<br/><br/>The teleportation array was located on the Wangyin continent. After entering the teleportation array, their figures flickered, and they only came out after a full ten minutes.<br/><br/>This time, they appeared on top of a meteorite.<br/><br/>As the distance was too far, the Qingzhou Trading Company had to stop by Midway.<br/><br/>While Wang Xian and the rest were teleporting, a message was sent to the ancient art sect.<br/><br/>“Sect master, the Dragon King and venerable willow deity have arrived.”<br/><br/>In a large hall of the ancient art sect, an old man reported to the sect master of the ancient art sect in the middle.<br/><br/>“Are they here?”<br/><br/>The eyes of the sect master of the ancient painting sect flickered, and he immediately sent the information out.<br/><br/>“Sect master, what is the Heavenly Dragon clan doing? They’ve waited for three years to set up a teleportation array. They’ve gone through so much trouble. I don’t understand what they’re trying to do!”<br/><br/>The old man who reported couldn’t help but ask.<br/><br/>“The Heavenly Dragon Clan has gone through so much trouble, so they must be up to something. It might be related to the Sky Sea Dragon Palace. Let’s wait for the information from the Heavenly Dragon Clan for now. The Heavenly Dragon King said that they can act soon.”<br/><br/>The Master of the ancient painting sect shook his head. He had no idea about the Heavenly Dragon Clan’s plan.<br/><br/>“They are here!”<br/><br/>In the Heavenly Dragon Palace, the Heavenly Dragon King received the news from the Master of the ancient painting sect, and his eyes shone with a fiery light.<br/><br/>This was his chance to transform.<br/><br/>“Heavenly Dragon King, are we going to set up an ambush in the Heavenly Sea Dragon Palace this time?”<br/><br/>Heavenly Dragon Duke, who was in the Heavenly Dragon Palace, asked with a twinkle in his eyes.<br/><br/>“No need. I have my own plans. Wait for my message. When I give the order, you and the ancient painting sect can go and destroy the Dragon Palace. Remember, capture all the pure-bred divine dragons in the Dragon Palace alive.”<br/><br/>“Whether you can evolve or not depends on this one time.”<br/><br/>The Heaven Dragon King said to him with a twinkle in his eyes.<br/><br/>“It’s the Heaven Dragon King!”<br/><br/>The Heaven Dragon Duke nodded heavily, his eyes full of expectation and excitement.<br/><br/>They were only inferior dragons. There was still a big gap between them and purebred divine dragons.<br/><br/>If the Heaven Dragon King could succeed, then they could also successfully transform and become true divine dragons.<br/><br/>“Go and prepare!”<br/><br/>As the Heavenly Dragon King spoke, his body moved and he headed straight for the rear.<br/><br/>He carefully opened the mountain peak that had the big forbidden word written on it and entered it.<br/><br/>Half an hour later, his body quickly flew towards the Longming continent.\t\t\t\t\t\t</div>", "images": {}, "success": true}