{"id": 184, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15072269.html", "title": "Chapter 3175 - Chapter 3175: 3174 Heavenly Sea Dragon Palace", "volume": 2, "volume_title": "Volume 2", "body": "<h1>Chapter 3175 - Chapter 3175: 3174 Heavenly Sea Dragon Palace</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 3175: 3174 Heavenly Sea Dragon Palace<br/><br/>“Let’s go to the Longming Continent.”<br/><br/>Wang Xian and the willow deity walked out of the teleporter on a planet.<br/><br/>He looked at the route on the universal AI and spoke immediately.<br/><br/>“Dragon King, there’s still a month before the opening of the Dragon Palace.”<br/><br/>The willow deity spoke.<br/><br/>“Yes, there’s still a month. However, this is our first time here. We need to check out the situation here.”<br/><br/>“Let’s go and see what the Dragon Palace is like!”<br/><br/>Wang Xian said.<br/><br/>Wang Xian was filled with curiosity about a powerful dragon palace.<br/><br/>How was this dragon palace different from the one created by the system?<br/><br/>Did It have the same powerful functions as the system that created the Dragon Palace?<br/><br/>With this thought in mind, they flew quickly toward the Longming continent.<br/><br/>The Longming continent was located in the east of this starry sky.<br/><br/>This wasn’t Wang Xian’s first time in this starry sky, but he didn’t stay here for long.<br/><br/>There were many more powerhouses here than in the Milky Way.<br/><br/>There were even powerful primary races in the universe that could wipe out all the forces in the Milky Way.<br/><br/>After traveling through the starry sky for two hours, a huge continent appeared in his line of sight.<br/><br/>Wang Xian looked over and narrowed his eyes slightly.<br/><br/>This was a continent that was more than ten times bigger than the silver gazing continent.<br/><br/>At this moment, in the surrounding void, one could see many figures flying over.<br/><br/>Some of the figures were incomparably huge bird-type demonic beasts.<br/><br/>Some of them were demonic beasts that were like rhinoceroses that were soaring in the clouds.<br/><br/>There were also demonic beasts that were galloping in the void like cheetahs.<br/><br/>There were all kinds of demonic beasts that were emitting a powerful murderous aura.<br/><br/>There were also demonic beasts that were flying in human form.<br/><br/>One after another, demonic beasts were rushing towards the Longming continent from all directions.<br/><br/>Wang Xian swept his gaze across and discovered that many of the demonic beasts were very strong.<br/><br/>He could vaguely sense the strength of the demonic beasts at the supremacy level.<br/><br/>His gaze landed on the Longming continent in front of him.<br/><br/>The entire continent was verdant and lush. Basically, it was filled with towering trees.<br/><br/>“This Longming continent is not simple.”<br/><br/>The willow deity stared at this continent, her eyes shining.<br/><br/>Wang Xian nodded.<br/><br/>According to the information from the Dragon Palace, there were more than a dozen universe knight level demon beasts in the entire Longming continent.<br/><br/>There were even level 3 universe knight level demon beasts among them.<br/><br/>They lived here and coveted the Sky Sea Dragon Palace in the Sky Sea.<br/><br/>These demon beasts did not form a force together. Basically, they were acting on their own and waiting for opportunities.<br/><br/>“Let’s go. Let’s head straight to the Sky Sea.”<br/><br/>Wang Xian and the rest did not land on the ground. Instead, they continued to fly forward.<br/><br/>Half an hour later, an ocean appeared in their sight.<br/><br/>The Ocean was extremely huge. The water was not very deep. It was only a few tens of thousands of kilometers.<br/><br/>It was much shallower than the Milky Way.<br/><br/>“Let’s Go!”<br/><br/>Wang Xian and the rest moved and entered the ocean directly. They flew toward the center according to the address.<br/><br/>In the ocean, the number of demonic beasts was even more numerous. Their unified goal was to head forward and not interfere with each other.<br/><br/>Boom<br/><br/>At this moment, Wang Xian sensed a terrifying aura coming from the side. A demon beast that was like an octopus was emitting a powerful aura as it charged straight ahead.<br/><br/>The other demon beasts in the surroundings sensed the aura and revealed a respectful expression. They quickly hid to the side.<br/><br/>That was a universe knight-level demon.<br/><br/>“Every time the Sky Sea Dragon Palace opens, many demons from the surrounding starry skies will rush over. It’s said that during the last opening, more than 200 demons came.”<br/><br/>Wang Xian spoke, his eyes shining.<br/><br/>It wasn’t just the demons from this starry skies who would rush over. Other Demons from other starry skies would also rush over.<br/><br/>In this place, it was best to keep a low profile if one didn’t have the strength of a demon.<br/><br/>Even if it was a great demon at the first level of a universe knight, they should not be too arrogant.<br/><br/>That was because there were crouching tigers and hidden dragons here.<br/><br/>Wang Xian and the rest did not keep a high profile. They looked at the great demon flying over and sped up as well.<br/><br/>After flying for another half an hour, they sensed a powerful force coming from the front.<br/><br/>An incomparably huge palace stood in the deepest part of the Sky Sea.<br/><br/>The entire palace was tens of millions of kilometers in size. Apart from containing a terrifying force, the palace looked a little quaint.<br/><br/>It was somewhat sacred.<br/><br/>Wang Xian narrowed his eyes slightly and looked at the Dragon Palace in front of him. There was a familiar feeling coming from his bloodline.<br/><br/>This was the Sky Sea Dragon Palace.<br/><br/>Right now, this Dragon Palace seemed to be in a deep sleep and didn’t seem to be lofty.<br/><br/>Facing them was the West Dragon Gate.<br/><br/>The West Dragon Gate looked similar to the Dragon Gate created by the system.<br/><br/>The entire Dragon Gate contained a mysterious energy.<br/><br/>Around the Dragon Gate, many humans and demonic beasts had already arrived. However, they didn’t dare to rashly barge into the Dragon Gate.<br/><br/>Before the Dragon Palace was opened, any rash action would cost one’s life.<br/><br/>As they approached the Tianhai Dragon Palace, Wang Xian and the willow deity sized it up carefully.<br/><br/>“It’s similar to the Dragon Palace built by the system, but there are some differences.”<br/><br/>Wang Xian sized it up and mumbled. He looked around and said, “Let’s go. Let’s take a look around the Dragon Palace.”<br/><br/>There was a gray energy floating in the sky above the Tianhai Dragon Palace, blocking everyone’s vision.<br/><br/>In the sky, that grey energy was filled with destructive power. No one dared to step into it rashly.<br/><br/>Wang Xian circled around the skysea Dragon Palace. Unfortunately, he could only see the periphery and could not see the specific situation inside.<br/><br/>“Eh?”<br/><br/>At this moment, he saw a demonic beast race in front of him. There were hundreds of them. They had huge wings but their bodies were like pythons. There was a single horn on their head.<br/><br/>From this demon beast race, he could feel a trace of the Divine Dragon Bloodline. It should belong to the Yalong.<br/><br/>However, it was possible that they had other bloodlines.<br/><br/>The leader of the Demon Beasts had the power of a level two universe knight. Some of the surrounding demon beasts didn’t dare to approach them.<br/><br/>“A Yalong with a trace of the Divine Dragon Bloodline. Of course, calling it a yalong might not be right. This is a powerful demon beast race.”<br/><br/>Wang Xian mumbled.<br/><br/>Among the hundreds of demon beasts, there were three other universe knights besides the leader.<br/><br/>“Looks like there are many powerful existences in the Sky Sea Dragon Palace this time.”<br/><br/>He thought to himself as he continued to circle around the Dragon Palace to investigate.<br/><br/>Boom Boom Boom<br/><br/>When he arrived at another location, the sound of battle suddenly came from the front.<br/><br/>He was slightly stunned. He saw a figure rushing towards him. The figure had the body of a human and the tail of a snake. The upper half of the figure was that of a woman while the lower half of the figure was that of a snake.<br/><br/>At this moment, her face was filled with horror as she fled forward.<br/><br/>“Hahaha, little female snake, you still want to escape?”<br/><br/>From the back, a powerful force came charging over.<br/><br/>This force was very familiar to Wang Xian. He looked over and saw a demonic beast that was similar to an octopus chasing after him.<br/><br/>“COO! Coo!”<br/><br/>A special sound came from her body and a poisonous fog enveloped the area ahead.\t\t\t\t\t\t</div>", "images": {}, "success": true}