{"id": 187, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15072275.html", "title": "Chapter 3178 - Chapter 3178: 3177 Dragon Palace Dragon King", "volume": 2, "volume_title": "Volume 2", "body": "<h1>Chapter 3178 - Chapter 3178: 3177 Dragon Palace Dragon King</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 3178: 3177 Dragon Palace Dragon King<br/><br/>“Milky Way Dragon Palace Dragon King? Is that the 10th Godly Dragon Force in the Universe?”<br/><br/>“Milky Way’s Dragon King? I heard that they have pure-blooded godly dragons? The three universe primary races attacked them and were all annihilated. This dragon palace is not simple.”<br/><br/>“Thousand-tool demon is a universe knight Level 1 existence, yet she was killed in an instant. What realm is that woman at?”<br/><br/>“That woman should be Willow God Knight, Milky Way’s Willow God Knight, a universe Knight Level 3 existence. She actually joined the Dragon Palace.”<br/><br/>In front of the Sky Sea Dragon Palace, a group of demon beasts looked at the situation in the center, their faces revealing shock.<br/><br/>Their starry sky was not far from the Milky Way.<br/><br/>Such a big event had happened in the Milky Way, and it was related to the Dragon God lineage. In addition to three years, the forces here had already understood some of it.<br/><br/>Everyone was filled with curiosity towards this newly risen divine dragon lineage.<br/><br/>“He was the one who sought death by attacking us. Since he attacked, we will naturally retaliate. What? Is there anything wrong?”<br/><br/>Wang Xian’s gaze swept across the great demons of the Demon God Palace and said faintly.<br/><br/>The strength of the Willow God was already comparable to a universe knight at level four. He was not afraid at all when facing the great demons of the Demon God Palace.<br/><br/>If the other party dared to attack again, Wang Xian would not mind killing them.<br/><br/>Although it was difficult to kill them all, anyone below Level 1 universe knight would have to die.<br/><br/>“Dragon King, have you heard of the saying that a strong dragon can not suppress a local snake?”<br/><br/>The great demons and the four palace masters of the Demon God Palace changed their expressions slightly when they heard his words. The bird-headed palace master said coldly with a gloomy face.<br/><br/>“Hehe, then you should have heard of it. If a weakling dares to offend an expert, he will usually end up in a miserable state.”<br/><br/>Wang Xian smiled and replied indifferently.<br/><br/>“Let’s Go!”<br/><br/>As soon as he finished his sentence, he gestured to the willow deity and flew directly towards the Dragon Gate. He did not bother with the people from the monster God Palace anymore.<br/><br/>The eyes of the great demons from the monster God Palace flickered. Their eyes were unusually cold.<br/><br/>However, they hesitated for a moment and didn’t make a move.<br/><br/>“Hehe, he’s really powerful!”<br/><br/>In the Tianhai Dragon Palace, the Heaven Dragon King watched this scene quietly. His eyes were sparkling as he said faintly.<br/><br/>“I wonder how long it will take for you to pass through this Dragon Gate.”<br/><br/>He muttered.<br/><br/>However, he soon widened his eyes and was filled with disbelief.<br/><br/>In front of them, Wang Xian and Venerable Willow God walked to the Golden Dragon Gate.<br/><br/>It was as if the Golden Dragon Gate didn’t exist. They walked straight in without any hindrance.<br/><br/>“How… How is this possible? This is definitely their first time in this dragon palace. How could they enter so easily?”<br/><br/>He couldn’t help but growl in a low voice. His expression changed drastically.<br/><br/>There was only one possibility, and that was that the other party was a purebred divine dragon. His bloodline was not weaker than the owner of this Dragon Palace, the Tianhai Dragon King.<br/><br/>However, the Tianhai Dragon King was a purebred divine dragon, a metal-attributed Golden Dragon.<br/><br/>“Good, good, good!”<br/><br/>Very soon, the Tianhai Dragon King clenched his fists tightly. His body moved and he quickly flew towards the depths of the Tianhai Dragon Palace.<br/><br/>Buzz<br/><br/>At this moment, Wang Xian and venerable willow deity entered the Heaven Sea Dragon Palace.<br/><br/>“Oh? The Demon God Palace actually didn’t make a move. Are they afraid of the strength of the Dragon King and the rest?”<br/><br/>“This… this thousand-tool great demon died for nothing. It’s also his bad luck. He attacked the leader of a powerful force and was killed immediately. The Demon God Palace isn’t in the right either.”<br/><br/>“What? Then how did the Dragon King and Venerable Willow Deity enter the Sky Sea Dragon Palace so easily? This is their first time here!”<br/><br/>“This… The Dragon Gate doesn’t seem to be a hindrance to them. How is this possible? It’s rumored that the Dragon Palace possesses the purebred divine dragon bloodline. The Dragon King and Willow Deity definitely possess an extremely powerful bloodline power.”<br/><br/>At this moment, outside the skysea Dragon Palace, all the demonic beasts were shocked when they saw Wang Xian and the rest entering the Dragon Palace so easily.<br/><br/>Was this breaking through the Dragon Gate? They were walking straight in!<br/><br/>“Looks like the Dragon King and the rest are not simple.”<br/><br/>The four palace masters of the Demon God Palace looked at each other. They were glad that they didn’t act rashly just now.<br/><br/>“You have the ability to take revenge.”<br/><br/>Bird-head palace master said in a low voice and continued to rush toward the Dragon Gate.<br/><br/>They would remember this revenge first.<br/><br/>Weng<br/><br/>However, when they arrived in front of the Dragon Gate, they felt a huge resistance.<br/><br/>Even bird-head palace master, who had reached universe knight level three, blushed and showed a difficult expression.<br/><br/>The Dragon Palace wasn’t easy to break through.<br/><br/>“Break through the Dragon Gate!”<br/><br/>“Break through the Dragon Gate!”<br/><br/>At the back, the demon beasts couldn’t take it anymore and rushed straight ahead.<br/><br/>Among the Demon Beasts, a dirty-looking woman with a human body and snake tail flew towards the Dragon Gate.<br/><br/>She swayed her body and came before the Dragon Gate, and was immediately met with some resistance.<br/><br/>However, she swayed her snake tail as she entered the dragon gate bit by bit. This caused the few demonic beasts beside her to widen their eyes. They were filled with envy and shock.<br/><br/>“Is this the Dragon Palace of the Tianhai Dragon King? What dense spiritual energy!”<br/><br/>“It has been silent for so many years. To think that there is still such a surge of spiritual energy?”<br/><br/>At the same time, Wang Xian and the rest who entered the dragon palace sized up the interior of the Tianhai Dragon Palace. Their eyes were filled with astonishment.<br/><br/>As for the matter regarding the Demon God Palace, he did not take it seriously at all.<br/><br/>The weak would provoke the strong, especially if they attacked directly. Usually, they would not have a good ending.<br/><br/>Willow deity was a kind person. However, when she saw the thousand-tool great demon hunting the female snake as a female slave last time, she might be a little angry and directly destroyed it.<br/><br/>After entering the Sky Sea Dragon Palace, Wang Xian sensed that this dragon palace was extraordinary.<br/><br/>The spiritual energy was too abundant. It was only slightly weaker than the current Dragon Palace.<br/><br/>It was definitely a universe god country that was comparable to a level eight or nine universe knight.<br/><br/>It was very strong and didn’t look like a Dragon Palace of a fallen Dragon King.<br/><br/>“Let’s go and take a look at the front.”<br/><br/>The layout of the Sky Sea Dragon Palace at the entrance was similar to that of the Dragon Palace created by the system. Further ahead was the dragon field.<br/><br/>When he arrived at the Dragon Field, he immediately felt that his thoughts were active.<br/><br/>The abilities of this dragon farm were similar to the abilities of the Dragon Farm of the Dragon Palace.<br/><br/>In every corner of the Dragon Farm, there were demonic beasts that had just entered and were cultivating. They were borrowing the power of the Dragon Farm to break through the difficulties of the ten thousand years of cultivation.<br/><br/>However, most of the people who entered continued to fly in, hoping to find more treasures.<br/><br/>Wang Xian swept his gaze across his surroundings and continued to fly forward.<br/><br/>There were two huge pillars in front of him. The Divine Dragon was coiled on the pillars.<br/><br/>The words “Dragon Cave”were carved on the pillars.<br/><br/>“Dragon Cave. This is the same as the Dragon Palace.”<br/><br/>Wang Xian mumbled as he continued to walk in with the willow deity.<br/><br/>After entering, it was similar to the Dragon Cave in the Dragon Palace. There were many dragon caves inside.<br/><br/>There was no energy left in the Dragon Cave. It was possible that some of the treasures inside had already been obtained by others.<br/><br/>Wang Xian observed his surroundings in detail and proceeded forward little by little.<br/><br/>However, what he did not know was that somewhere in the Tianhai Dragon Palace, an illusory figure was observing everything.\t\t\t\t\t\t</div>", "images": {}, "success": true}