{"id": 180, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15072261.html", "title": "Chapter 3171 - Chapter 3171: 3,170 Double Breakthroughs", "volume": 2, "volume_title": "Volume 2", "body": "<h1>Chapter 3171 - Chapter 3171: 3,170 Double Breakthroughs</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 3171: 3,170 double breakthroughs<br/><br/>In the universe, there were 10 divine dragons, including the Dragon Palace.<br/><br/>The relationship between these 10 divine dragons wasn’t very good.<br/><br/>There were even wars that broke out.<br/><br/>All the leaders of the Divine Dragons wanted to become the true dragon’s son of heaven. They all wanted to become the king of the Divine Dragons and lead the Divine Dragon Clan to glory once again.<br/><br/>But who was willing to bow down to them?<br/><br/>Especially those powerful clans of the Divine Dragon Clan who had obtained the opportunity of the Divine Dragon and performed the Atavism. They had cultivated until now and became powerful leaders. They were confident that they could once again lead the Divine Dragon Clan to the peak.<br/><br/>This caused each other to be unconvinced.<br/><br/>And each of them wanted to subdue the other.<br/><br/>A war broke out here.<br/><br/>The strength of the Divine Dragon clan was relatively weak compared to the Divine Dragon Clan. Their Divine Dragon Clan didn’t have a purebred divine dragon.<br/><br/>To a certain extent, they weren’t even comparable to the Dragon Palace.<br/><br/>The ancient painting sect passed the information about the dragon palace to them, maybe they were willing to help.<br/><br/>Not for anything else, but to covet the pure-blooded Dragon Bloodline of the Dragon Palace.<br/><br/>“Let’s go, we’ll make a trip to the Milky Way first to scout out the specific situation. Also, it’s best if we can set up a teleportation array.”<br/><br/>The leader of the ancient art school glanced at the group of universe knights and said.<br/><br/>“It’s the leader!”<br/><br/>The group of ancient art school knights nodded and continued to fly forward.<br/><br/>…<br/><br/>Buzz<br/><br/>While the outside world was buzzing with excitement, Wang Xian, who was in the Dragon Palace, was smiling as he watched the members of the Dragon Palace improve rapidly.<br/><br/>On the sixth day, Wang Xian, who was sitting on the dragon throne, suddenly felt the ancestral tree behind him tremble slightly.<br/><br/>He narrowed his eyes slightly and immediately sensed it.<br/><br/>When he saw the immortal-slaying calabash trembling on the ancestral tree, he was slightly stunned.<br/><br/>He could sense that the immortal-slaying calabash was attracted by a force.<br/><br/>However, as the immortal-slaying calabash belonged to him, it did not fly over.<br/><br/>With a thought, Wang Xian released the immortal-slaying calabash.<br/><br/>Whoosh<br/><br/>The immortal-slaying calabash flew out from the ancestral tree and headed toward the dragon transformation pool.<br/><br/>Wang Xian’s body moved and he immediately arrived in front of the dragon transformation pool.<br/><br/>Located in the dragon transformation pool, a willow tree stood in the middle. The willow tree was about 10,000 meters in size and had countless weeping willows.<br/><br/>At this moment, there were strange leaves on the weeping willows. The leaves were like dragon scales and emitted crisp sounds.<br/><br/>The immortal-slaying calabash flew to the top of the willow tree and slowly merged with the willow tree.<br/><br/>Wang Xian’s eyes flickered as he looked at the venerable willow deity who had undergone a huge change.<br/><br/>The willow leaves that were like dragon scales were the dragon scales that the venerable willow deity had obtained from the leader of the bloodthirsty tribe.<br/><br/>The dragon scales turned into leaves, giving a huge boost to its offensive power.<br/><br/>When the immortal-slaying calabash landed on her body, it also allowed her to control the immortal-slaying calabash.<br/><br/>The immortal-slaying Calabash was a divine weapon at the ruler level. If it was classified by level, it could be classified as an innate true treasure.<br/><br/>It was definitely a terrifying killing weapon.<br/><br/>However, the immortal-slaying calabash had yet to fully mature and had yet to fully recover.<br/><br/>“The venerable willow deity’s realm seems to have dropped. However, the power she contains is even more terrifying. She should be able to reach the combat strength of a level four universe knight, right?”<br/><br/>Wang Xian looked over and couldn’t help but guess.<br/><br/>If the venerable willow deity could possess the level four combat strength of a universe knight, then the improvement of the Dragon Palace this time would be huge.<br/><br/>A level four universe knight was definitely the pinnacle existence among the primary races in the universe.<br/><br/>If the Dragon Palace could have thousands of knights, with a level four universe knight as the guide, the Dragon Palace would be able to enter an intermediate race in the universe.<br/><br/>However, it was not as easy as he imagined to enter an intermediate race in the universe.<br/><br/>Wang Xian pondered in his heart.<br/><br/>In the next few days, he would assist the Great Mill of five elements in devouring all kinds of acquired spiritual treasures.<br/><br/>He was waiting for the members of the Dragon Palace to improve completely.<br/><br/>Time passed day by day.<br/><br/>At this moment, it was located in a starry sky very far away from here.<br/><br/>This was a very magical place.<br/><br/>The Endless Mountain peaks reached into the sky.<br/><br/>And a vast ocean submerged a small part of the mountain peak.<br/><br/>The vast ocean was extremely clear. Looking over, one could see all kinds of aquatic creatures wandering about.<br/><br/>And on the mountain peak, some of the mountain peaks were covered in ice and snow, with beautiful flowers growing on them.<br/><br/>Located in the ocean below, there was also an incomparably huge dragon palace here.<br/><br/>However, this dragon palace was known as the Heavenly Dragon Palace.<br/><br/>The Heavenly Dragon Palace was the palace of the Heavenly Dragon Clan.<br/><br/>The Heavenly Dragon Clan didn’t rise for a long time, only a few hundred million years. However, after a few hundred million years, they had established themselves in this piece of void and reached the peak of existence in this piece of starry sky.<br/><br/>In this place, of the fifty to sixty primary races in the universe, the Heavenly Dragon Clan could be ranked in the top three.<br/><br/>Their powerful strength and terrifying speed of improvement made everyone extremely fearful.<br/><br/>“Pure-blooded Divine Dragon!”<br/><br/>At this moment, in the Dragon King Palace of the Heavenly Dragon Palace, a middle-aged man with sharp horns and a dragon robe sat on the dragon throne. He looked at the information on the universe ai, his eyes shining.<br/><br/>If the members of the Dragon Palace saw the Heavenly Dragon Palace and the Dragon King Palace, they would realize that the layout of this place was exactly the same as the Dragon Palace.<br/><br/>This meant that the Heavenly Dragon clan had obtained the true inheritance of the Divine Dragon.<br/><br/>“Heavenly Dragon King, according to the video and pictures sent by the ancient painting sect, there is a high chance that the Lightning Dragon and the Wind Divine Dragon of the Dragon Palace are pure-blooded divine dragons.”<br/><br/>“And the Dragon King of the Dragon Palace seems to have an extraordinary bloodline as well.”<br/><br/>On the left and right of the Dragon King Palace sat people with sharp horns.<br/><br/>The old man who was the leader on the right said.<br/><br/>“I really didn’t expect that a small divine dragon would have a purebred divine dragon. This is a purebred divine dragon.”<br/><br/>A few middle-aged men who had sharp horns on their heads sighed slightly, and their eyes flashed with a burning look.<br/><br/>“The ancient painting sect’s intention is very clear. They want us to attack and destroy the Dragon Palace together with them.”<br/><br/>An old woman on the left said faintly.<br/><br/>“The purebred divine dragon bloodline is very attractive to us, but at the same time, it also greatly suppresses us. We are no match for them in a battle of the same level.”<br/><br/>The old man on the right added.<br/><br/>“The Sky Sea Dragon Palace is about to open, right?”<br/><br/>The leader of the Sky Dragon King suddenly said.<br/><br/>“There are three years left. In three years, the Sky Sea Dragon Palace will open. This time, many sea monsters and aquatic creatures will come.”<br/><br/>The old woman on the left immediately replied.<br/><br/>“Send this message to the Dragon Palace. Duke of Sky Dragon, mother of Sky Dragon, follow me.”<br/><br/>After saying this, the Sky Dragon King slowly stood up and flew back.<br/><br/>The two old men on the left and right moved and immediately followed behind.<br/><br/>In front of them was a huge mountain. The top half of the mountain was on the sea, and the bottom half was at the bottom of the sea.<br/><br/>On the mountain, there was a big forbidden word.<br/><br/>The Heavenly Dragon Duke and the heavenly dragon mother were slightly shocked when they saw the Heavenly Dragon King bring them here.<br/><br/>“Lord Heavenly Dragon King, you brought us here…”<br/><br/>The two looked forward with a serious expression and asked.<br/><br/>This was the forbidden area of the Heavenly Dragon tribe.<br/><br/>“Purebred bloodline, our entire life’s pursuit. I, the Dragon King, also want to have a purebred bloodline.”<br/><br/>He muttered.<br/><br/>“Heavenly Dragon King, you want to use that heaven-pilfering forbidden item…”<br/><br/>The two of them were shocked.\t\t\t\t\t\t</div>", "images": {}, "success": true}