{"id": 186, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15072273.html", "title": "Chapter 3177 - Chapter 3177: 3,176 Seconds To Kill A Great Demon", "volume": 2, "volume_title": "Volume 2", "body": "<h1>Chapter 3177 - Chapter 3177: 3,176 Seconds To Kill A Great Demon</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 3177: 3,176 seconds to kill a great demon<br/><br/>Powerful forces arrived one after another, and all the demon beasts in the surroundings waited quietly.<br/><br/>A few hours later, tens of millions of demon beasts had gathered at the East Gate of the Sky Sea Dragon Palace. Among them, there were no less than 150 universe knights.<br/><br/>This was not even counting the great demons that were hidden.<br/><br/>“Weng!”<br/><br/>Ten hours later, the dragon palace in front suddenly trembled.<br/><br/>The gray mist above the dragon palace slowly dissipated, and rays of golden light came from the Dragon Palace in front of them.<br/><br/>The Dragon Palace, which looked like a graveyard, seemed to be slowly emitting life.<br/><br/>The golden light slowly spread out in all directions.<br/><br/>It illuminated the surrounding seabed.<br/><br/>“The Tianhai Dragon Palace is about to open.”<br/><br/>“It’s been 10,000 years. I’ve been waiting for 10,000 years. This time, I must pass the Dragon Gate.”<br/><br/>“It seems that only the east gate is open this time.”<br/><br/>“As long as I pass the Dragon Gate, I’ll be able to possess the bloodline of the Divine Dragon and refine it. Then, my strength will increase.”<br/><br/>The demonic beasts in the surrounding area were all extremely excited.<br/><br/>They were all extremely excited and couldn’t wait to rush into the Dragon Palace.<br/><br/>Buzz<br/><br/>The golden light grew brighter and brighter, and the huge Dragon Gate in front of them and the dragon pillars on both sides began to glow.<br/><br/>The light formed the shape of a dragon gate.<br/><br/>It was a golden illusory Dragon Gate with a golden divine dragon coiled on it, giving off an endless majesty.<br/><br/>As long as they could pass through this Dragon Gate, they could enter the Dragon Palace.<br/><br/>The Dragon Gate was formed!<br/><br/>“It’s starting!”<br/><br/>Seeing that the Dragon Gate was completely formed, the surrounding Demonic Beasts became restless.<br/><br/>“Hahaha, the Dragon Gate is open again. I shall enter first.”<br/><br/>When the Heaven Dragon King saw that the Dragon Palace was opened, his body moved and he immediately flew into the Dragon Palace.<br/><br/>As he flew into the Dragon Palace, there were other figures flying in at a rapid speed.<br/><br/>They flew to the front of the Dragon Gate and entered the Dragon Palace without any obstruction.<br/><br/>“Huh?”<br/><br/>Wang Xian looked over and narrowed his eyes slightly.<br/><br/>“Is it because they have broken through the Dragon Gate before that they could enter so easily?”<br/><br/>Wang Xian saw at least a hundred figures entering the Dragon Gate without any hindrance. His eyes sparkled.<br/><br/>“Let’s go, break through the Dragon Gate!”<br/><br/>The great demons of the Demon God Palace let out a low growl and flew directly towards the Dragon Gate.<br/><br/>“Break through the Dragon Gate!”<br/><br/>The rest of the demon beasts let out excited growls and flew straight ahead.<br/><br/>At the same time, in the inner part of the Sky Sea Dragon Palace, when the hundreds of people entered the Dragon Palace, the group of Demon Beasts looked at each other. Without any hesitation, they immediately rushed forward.<br/><br/>The Sky Dragon King turned around quietly.<br/><br/>This time, he was the only one from the Sky Dragon Clan who came in.<br/><br/>He looked at the world outside the Dragon Gate and locked his gaze on Wang Xian’s figure. His eyes were filled with passion.<br/><br/>A black box appeared in his palm. The box was sealed, and it seemed to contain a great terror.<br/><br/>“I have ventured the deepest into the entire Sky Sea Dragon Palace. As long as I lure him over…”<br/><br/>As the Heaven Dragon King spoke, his body trembled and he continued to mutter, “That Dragon King seems to be stronger than a purebred divine dragon.”<br/><br/>As he spoke, he stood there and watched quietly.<br/><br/>When he saw the picture of the Dragon King, he had this intuition.<br/><br/>“Let’s go in!”<br/><br/>Wang Xian looked at the Dragon Gate that was completely opened and spoke to the willow deity beside him.<br/><br/>“It’s the Dragon King!”<br/><br/>The willow deity nodded and immediately followed behind.<br/><br/>In the surroundings, demonic beasts flew towards the Dragon Gate.<br/><br/>Boom! Boom! Boom<br/><br/>In the center, the four Palace Masters of the Demon God Palace emitted a terrifying pressure as they charged towards the Dragon Gate.<br/><br/>Behind them, more than 10,000 disciples of the Demon God Palace followed closely behind.<br/><br/>Sensing their might, the group of demonic beasts frowned slightly.<br/><br/>Even some of the great demons paused for a moment and made way for them.<br/><br/>“Our Demon God Palace will break through the Dragon Gate first. The rest of the demonic beasts will wait.”<br/><br/>The leader of the group, the bird-headed palace master, reprimanded him forcefully.<br/><br/>When Wang Xian heard the voice coming from the center, he raised his eyebrows. He ignored it and flew straight away.<br/><br/>“Eh? It’s that guy.”<br/><br/>“He’s really arrogant. He doesn’t give face to our Demon God Palace?”<br/><br/>Thousand-tool demon followed the four palace masters to the right. When he saw Wang Xian and the rest at the side, he suddenly narrowed his eyes slightly.<br/><br/>“Scram. Didn’t you hear what our palace master said?”<br/><br/>A sinister look flashed across thousand-weapon demon’s eyes. He transformed into an octopus-like demonic beast.<br/><br/>A tentacle attacked Wang Xian directly.<br/><br/>“You’re courting death. Scram!”<br/><br/>Venerable Willow God sensed that thousand-weapon demon dared to attack them. Her eyes revealed a cold look.<br/><br/>She waved her arm and numerous sharp dragon-scale-like willow leaves attacked thousand-weapon demon.<br/><br/>The speed of the dragon-scale-like willow leaves was extremely terrifying. In an instant, they arrived in front of thousand-tool demon.<br/><br/>“What! ?”<br/><br/>“Oh no, palatial lord, save me!”<br/><br/>Thousand-tool Demon’s eyes revealed a look of horror as he cried out for help.<br/><br/>The reason why he dared to attack was because he was relying on palatial lord and Company. He was relying on the great demons of the Fey God Palace to be here.<br/><br/>He wanted to take revenge on that fellow for obstructing him from hunting the female snake.<br/><br/>However, what he did not expect was that the other party did not put the Fey God Palace in his eyes and directly attacked.<br/><br/>What he did not expect was that the other party’s strength was so terrifying.<br/><br/>“Oh?”<br/><br/>In the middle, the four palace masters of the Fey God Palace sensed the situation and their expressions changed.<br/><br/>They waved their arms and attacked the dragon scale willow leaf.<br/><br/>“Pu, Pu, Pu!”<br/><br/>However, the terrifying dragon scale willow leaf instantly penetrated thousand-tool demon’s body and instantly obliterated it.<br/><br/>“You dare to attack our Dragon King? You’re courting death!”<br/><br/>The Willow God looked at thousand-tool demon and said coldly.<br/><br/>“What?”<br/><br/>The sudden battle and the sudden killing of a demon from the demon god Palace caused all the surrounding demon beasts to look over in shock.<br/><br/>Even the eyes of the other great demons were filled with shock.<br/><br/>When the great demons from the palace of demi-gods saw that the thousand-tool great demon was killed in an instant, their pupils contracted slightly. Their eyes were filled with solemnity and killing intent.<br/><br/>They stared at Wang Xian and the willow deity with awe-inspiring eyes.<br/><br/>“They dare to attack our Dragon King? Dragon King? Who are they?”<br/><br/>At this moment, a surprised voice came from behind.<br/><br/>Dragon King?<br/><br/>There were very few people who could be addressed as such.<br/><br/>“Father, Father!”<br/><br/>At this moment, the descendants of thousand-tool great demon cried out in surprise. They immediately flew over.<br/><br/>“Palace master, they killed our father. You must avenge our father!”<br/><br/>The descendants of thousand-tool great demon wailed in fear and anger.<br/><br/>“Dragon King? The Dragon King of the Milky Way’s Dragon Palace?”<br/><br/>The bird-headed palace master of the Demon God Palace stared at Wang Xian.<br/><br/>“Dragon Palace, Dragon King.”<br/><br/>Wang Xian glanced at them and said calmly.<br/><br/>“Dragon King of the Dragon Palace, killing a great demon of our demon god palace at the slightest disagreement, isn’t that too much?”<br/><br/>The bird-headed palace master replied coldly after receiving Wang Xian’s reply.<br/><br/>They had naturally heard of the Dragon King of the Dragon Palace.\t\t\t\t\t\t</div>", "images": {}, "success": true}