{"id": 189, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15072279.html", "title": "Chapter 3180 - Chapter 3180: 3179 Plundered The Bloodline", "volume": 2, "volume_title": "Volume 2", "body": "<h1>Chapter 3180 - Chapter 3180: 3179 Plundered The Bloodline</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 3180: 3179 plundered the bloodline<br/><br/>“More than 100 godly herbs of level 1 and Level 2 universe knights. As expected of a powerful Dragon King’s Dragon Palace.”<br/><br/>Wang Xian looked at the godly herbs in the herb garden and his eyes lit up.<br/><br/>Among these godly herbs, there were dozens of Level 2 universe knights.<br/><br/>These godly herbs could increase the combat strength of five to six level 1 universe knights in the Dragon Palace.<br/><br/>Buzz<br/><br/>Wang Xian waved his arm and immediately put away all the godly herbs.<br/><br/>“Eh? There are godly herbs in the herb garden ahead. Did the Sky Dragon King not enter this herb garden?”<br/><br/>Looking at the spot on the right, he raised his eyebrows and said.<br/><br/>“Let’s go.”<br/><br/>As Wang Xian said that, he immediately walked forward.<br/><br/>Once again, they successfully entered the herb garden. There were still many godly herbs of the level of universe knights in the herb garden.<br/><br/>He waved his arm and kept them all.<br/><br/>“Is that Sky Dragon King at a different location from where we came in?”<br/><br/>Wang Xian had a puzzled look on his face as he scanned his surroundings.<br/><br/>He realized that there were still godly herbs in the herb garden on the left.<br/><br/>He hesitated for a moment before walking over.<br/><br/>“HMM? Is he here? How did he come over from this location?”<br/><br/>At this moment, the Heaven Dragon King who was in the herb garden ahead was slightly stunned when he saw Wang Xian and the rest walking over.<br/><br/>However, following that, his eyes revealed an extremely heated expression.<br/><br/>He laid in the soil and waited quietly.<br/><br/>Buzz<br/><br/>When Wang Xian entered the herb garden, his expression suddenly changed slightly.<br/><br/>He quickly looked to the side.<br/><br/>He realized that the willow spirit had already disappeared from his side.<br/><br/>“What’s going on?”<br/><br/>This caused Wang Xian’s expression to change slightly. A look of fear appeared on his face.<br/><br/>He frowned slightly and raised his head to look at the sky.<br/><br/>There was only one possibility that could separate them in an instant. That was the work of the owner of the Dragon Palace.<br/><br/>This was because this was the dragon palace, which was equivalent to the Divine Kingdom of the Tianhai Dragon King. In this divine kingdom, he could control anything with just a thought.<br/><br/>Wang Xian looked around, his face full of vigilance.<br/><br/>“Is this dragon blood grass?”<br/><br/>Very soon, he noticed the dragon blood grass here, and his eyes were shining.<br/><br/>Dragon blood grass was a level three universe Knight Dragon Blood Grass. It was definitely a treasure.<br/><br/>He looked hesitant. He took out the universe AI and realized that there was no signal on it.<br/><br/>His gaze landed on the dragon blood grass again. With a wave of his arm, the dragon blood grass fell into his hand.<br/><br/>Buzz<br/><br/>At this moment, he felt a black liquid in the Dracaena. This liquid landed on his palm unexpectedly.<br/><br/>A wound immediately appeared on his palm.<br/><br/>A drop of fresh blood was absorbed by the black liquid.<br/><br/>Upon seeing this scene, Wang Xian suddenly had a bad premonition.<br/><br/>“Haha, it’s a success, it’s a success!”<br/><br/>At this moment, the Heaven Dragon King, who was in the soil, saw this scene. His eyes were filled with excitement.<br/><br/>The black liquid on his chest turned into symbols and surged into his body.<br/><br/>The black symbols entered his body and allowed his vitality to recover.<br/><br/>A smile slowly appeared on his face.<br/><br/>At this moment, he took out a round ball. The Divine Dragon was coiled on the ball. This was a dragon bead, a metal-elemental dragon bead.<br/><br/>“Do it!”<br/><br/>He said to the Dragon Pearl.<br/><br/>At the same time, on a planet in the Green region trading company, countless great beings were gathered there.<br/><br/>In the ancient art sect, 50 universe knights were all standing in front of a huge square, and their bodies were giving off an awe-inspiring aura.<br/><br/>Behind the 50 universe knights, there were 5 million disciples from the ancient art sect standing there, giving off an intense battle intent.<br/><br/>On the other side of the ancient painting sect, there were many extremely powerful ya dragons.<br/><br/>Many single-horned heavenly dragons with huge wings were lying on the ground.<br/><br/>The leaders were the Heavenly Dragon Elder and the Heavenly Dragon Mother of the Heavenly Dragon Clan.<br/><br/>Other than them, there were a few ya dragons with auras that were no weaker than theirs that were floating in the air.<br/><br/>Compared to the experts of the ancient painting sect, the aura of the Heavenly Dragon clan was even more terrifying.<br/><br/>There were about 100 universe Knight Level Sky Dragons and Yalong.<br/><br/>The terrifying aura made people tremble.<br/><br/>Other than the 100 universe Knight Level Sky Dragons and Yalong.<br/><br/>The number of normal Yalong reached over 2 million.<br/><br/>They all turned into Yalong’s bodies, the smaller ones were dozens of meters and the larger ones were thousands of meters. A strong murderous aura was released from their bodies.<br/><br/>Other than the Great Beings from the ancient painting sect and the Sky Dragon Clan, there were also five or six universe knights sitting on the circular plate in the center.<br/><br/>The circular plate emitted the power of the array.<br/><br/>They were the venerables from the Green Province Trading Company.<br/><br/>The Great Beings and disciples from the ancient painting sect and the Sky Dragon Clan had been waiting here for a day.<br/><br/>They had been waiting here before the Sky Sea Dragon Palace opened.<br/><br/>For the ancient painting sect, they had been waiting for this day for three years.<br/><br/>They had been waiting for the news of the Heavenly Dragon Clan for three years.<br/><br/>Now, seeing the arrival of the experts of the Heavenly Dragon Clan, their eyes were filled with excitement.<br/><br/>Now, they could only wait for the Order of the Heavenly Dragon King.<br/><br/>As long as the Heavenly Dragon King gave the order, they would immediately go to the Milky Way through the teleportation formation and destroy the Dragon Palace.<br/><br/>Buzz<br/><br/>At the same time, on the opposite side, the Heavenly Dragon Duke held a metal dragon pearl in his hand.<br/><br/>At this moment, the dragon pearl trembled and the Heavenly Dragon King’s order came from inside.<br/><br/>Hearing the Heavenly Dragon King’s order, a light flashed in the Heavenly Dragon Duke’s eyes.<br/><br/>“Let’s Go!”<br/><br/>He raised his head, looked at the ancient painting sect and said.<br/><br/>“Go!”<br/><br/>“Destroy the Dragon Palace and take revenge for the Vice Sect Master!”<br/><br/>The sect master of the Ancient Painting sect roared in a low voice after receiving the response from the Heavenly Dragon Clan.<br/><br/>“Destroy the Dragon Palace and take revenge!”<br/><br/>“Destroy the Dragon Palace and take revenge!”<br/><br/>The disciples and experts of the ancient painting sect immediately stood up and shouted.<br/><br/>“Ancient Painting sect, don’t forget to help us capture the pure-blooded dragon from the Dragon Palace Alive!”<br/><br/>Heavenly Dragon Duke looked at the ancient painting sect’s sect master and said indifferently.<br/><br/>“Don’t worry, the Dragon Palace’s strength is on par with ours. With Your Heavenly Dragon Clan’s strength, we can easily capture the Dragon Palace’s purebred Divine Dragon Alive!”<br/><br/>The ancient painting sect’s sect master said confidently.<br/><br/>“Okay.”<br/><br/>Heavenly Dragon Duke nodded and glanced at all the heavenly dragon clan’s disciples. “Let’s go into the teleportation array.”<br/><br/>“Yes!”<br/><br/>All the disciples of the Heavenly Dragon Clan replied immediately.<br/><br/>“Heavenly Dragon Duke, has our Heavenly Dragon King succeeded?”<br/><br/>The Heavenly Dragon Mother looked at him from the side and asked while suppressing the excitement in her heart.<br/><br/>“It should have succeeded. If the Heavenly Dragon King can succeed, we will have a chance to succeed and have a chance to evolve into a purebred divine dragon.”<br/><br/>The Heavenly Dragon Duke said with a burning look in his eyes.<br/><br/>“Let’s go to the Dragon Palace. We must capture those purebred divine dragons alive.”\t\t\t\t\t\t</div>", "images": {}, "success": true}