{"id": 192, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15072285.html", "title": "Chapter 3183 - Chapter 3183: 3182 Arrived", "volume": 2, "volume_title": "Volume 2", "body": "<h1>Chapter 3183 - Chapter 3183: 3182 Arrived</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 3183: 3182 arrived<br/><br/>“Rumble!”<br/><br/>Tianhai was located at the East Gate of the Tianhai Dragon Palace.<br/><br/>When countless demonic beasts were trying to jump over the Dragon Gate and rush forward, suddenly, a roar came from the Tianhai Dragon Palace.<br/><br/>All the demonic beasts felt the sudden tremble and roar, and their faces were filled with surprise.<br/><br/>“What’s going on?”<br/><br/>The demonic beasts immediately stopped and stared at the Sky Sea Dragon Palace in front of them.<br/><br/>“What’s going on? Why is there such a powerful vibration coming from the Sky Sea Dragon Palace? Did Someone Touch Something?”<br/><br/>The demonic beasts murmured.<br/><br/>“Look, the Dragon Gate of the Sky Sea Dragon Palace is illusory. What’s going on? What’s going on inside?”<br/><br/>“The Dragon Gate is illusory. Could it be? Could it be that everyone can enter?”<br/><br/>At this moment, an exclamation sounded. All the demon beasts looked over, their eyes shining.<br/><br/>The Dragon Gate was illusory. could all the demon beasts enter.<br/><br/>“All disciples of the Demon God Palace, Get Ready.”<br/><br/>The four palace masters of the Demon God Palace looked over, narrowed their eyes, and said coldly.<br/><br/>Hong Long Long<br/><br/>At this time, the trembling of the sky sea dragon palace became stronger and stronger, as if there was a huge earthquake.<br/><br/>All the demon beasts stared at it.<br/><br/>…<br/><br/>Just as the plans of the Sky Sea Dragon King and Sky Dragon King failed, it was located in the Milky Way.<br/><br/>The teleportation formation of the Green Province Trading Company was located on the Misty Race’s Wangyin continent.<br/><br/>As the largest continent in the Milky Way, the center of trade, there were many people.<br/><br/>The entire continent had a population of 100 billion.<br/><br/>The Green region trading company wasn’t very strong, only about 10 universe knights.<br/><br/>In terms of true combat strength, they weren’t even comparable to the mist race.<br/><br/>The main reason they could place the teleportation formation here was because they had paid the mist race a lot of God stones.<br/><br/>In addition to such a powerful teleportation formation on the Moon Silver continent, it was extremely beneficial to the prosperity of the moon silver continent.<br/><br/>The entire teleportation array didn’t cover a very large area, covering a radius of about 100 kilometers.<br/><br/>“Buzz, Buzz, Buzz!”<br/><br/>However, at this moment, the entire teleportation array emitted a trace of light, and soon after, figures appeared in front of the teleportation array.<br/><br/>After they appeared, they immediately flew to the side. Their bodies emitted a strong killing intent and battle intent as they lined up neatly at the side.<br/><br/>In front of the teleportation formation, the person in charge of the Green Province Trading Company’s teleportation formation wasn’t too surprised by this scene. They waited quietly.<br/><br/>Weng Weng Weng<br/><br/>The light from the teleportation formation shone continuously, and more and more people came out.<br/><br/>They wore the ancient art sect’s clothing, and slowly, the number of people reached around five million.<br/><br/>Over five million people floated in the sky above the teleportation formation, and there were 50 universe knights among them.<br/><br/>That terrifying energy rushed out in all directions.<br/><br/>Many great beings immediately noticed the situation here. Their pupils constricted, and their faces were filled with shock.<br/><br/>“What’s going on? are those people from the ancient art sect? Why are there so many of them here in the Milky Way?”<br/><br/>Some of them looked over, and their expressions changed slightly as they asked in shock.<br/><br/>Sou Sou Sou<br/><br/>At this time, two universe knights from the mist race sensed the situation and flew over with a serious expression.<br/><br/>“The ancient art sect has gathered so many people here, what’s the matter?”<br/><br/>A knight from the mist race looked at the Knights from the ancient art sect, his face full of wariness as he cupped his hands and asked.<br/><br/>“Mist race, don’t worry, we’re only here to destroy the Dragon Palace, we didn’t mean to offend you.”<br/><br/>The sect master of the ancient painting sect glanced at them and said indifferently.<br/><br/>“What?”<br/><br/>The two venerables of the Misty clan were slightly shocked when they heard the sect master of the ancient painting sect. They were shocked.<br/><br/>They were here to destroy the Dragon Palace?<br/><br/>Some of the surrounding experts were also shocked when they heard the sect master of the ancient painting sect.<br/><br/>“The ancient painting sect is here to destroy the Dragon Palace. With the strength of the Dragon Palace, they shouldn’t be able to destroy the Dragon Palace, right?”<br/><br/>A god Emperor said, full of doubt.<br/><br/>“Roar! Roar! Roar!”<br/><br/>At this moment, the light of the teleportation array bloomed, and violent roars came from it.<br/><br/>The roars were unbridled and violent.<br/><br/>“This is?”<br/><br/>The expressions of the two universe knights of the mist race changed slightly when they heard the two roars, and they stared at the teleportation array.<br/><br/>They were shocked when they heard the ancient painting sect’s words.<br/><br/>The Mist race wasn’t strong enough to destroy the Dragon Palace.<br/><br/>It seemed that they had other powers.<br/><br/>Hualala<br/><br/>The next moment, they saw huge figures flying out.<br/><br/>They had huge wings, a horn on their head, and they were giving off powerful pressure.<br/><br/>“This is a heavenly dragon!”<br/><br/>When they saw this creature, they were slightly shocked.<br/><br/>Heavenly Dragon, a heavenly dragon of the Heavenly Dragon Race!<br/><br/>“Roar Roar Roar!”<br/><br/>Continuous roars continued to ring out, spreading across a radius of over a billion kilometers.<br/><br/>The situation here attracted more than half of the people on silver gazing continent, and they all looked over curiously.<br/><br/>More and more powerful beings of the Heavenly Dragon clan flew out of the teleportation formation.<br/><br/>When the last hundred or so universe knight-level heavenly dragons came out, their auras raged.<br/><br/>Everyone on the silver gazing continent felt a powerful pressure.<br/><br/>A pressure from the dragon’s pressure.<br/><br/>At this time, even the two universe knights of the mist race couldn’t breathe.<br/><br/>Was… was the entire Sky Dragon race here?<br/><br/>“Hiss?”<br/><br/>Tens of billions of people had gathered in the surrounding area. They floated in the air and looked over in shock.<br/><br/>When they saw the last 100 or so universe knights of the Sky Dragon race, their faces were filled with respect and shock.<br/><br/>“Are the Sky Dragon Race and the ancient art sect here to destroy the Dragon Palace?”<br/><br/>“Is the entire Sky Dragon clan here? All of them are powerful ya long, and there are over a hundred universe knights. There are over a hundred of them!”<br/><br/>“This is too crazy. This should be the ancient painting sect’s revenge. They are taking revenge on the experts that the Dragon Palace killed three years ago. They actually invited the Sky Dragon Clan. The Dragon Palace is finished now!”<br/><br/>“The Dragon King is finished. All the experts of the Sky Dragon Clan are here. The strength of the Sky Dragon clan is extremely terrifying. The strength of just one ancient painting sect is about the same as the Dragon Palace. Now, the Sky Dragon Clan is included!”<br/><br/>Everyone looked at the enormous army of seven to eight million people and felt the suffocating aura. Their faces were filled with shock as they roared in a low voice.<br/><br/>“Let’s Go and destroy the Dragon Palace!”<br/><br/>The Heavenly Dragon Duke swept his gaze around and roared with an icy cold expression.<br/><br/>“Disciples of the ancient painting sect, prepare to take revenge for the Vice Sect Master and the others!”<br/><br/>The sect master of the Ancient Painting sect roared with a dense expression.\t\t\t\t\t\t</div>", "images": {}, "success": true}