{"id": 191, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15072283.html", "title": "Chapter 3182 - Chapter 3182: 3181 Taboo Art Vs Ancestral Tree", "volume": 2, "volume_title": "Volume 2", "body": "<h1>Chapter 3182 - Chapter 3182: 3181 Taboo Art Vs Ancestral Tree</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 3182: 3181 taboo art vs ancestral tree<br/><br/>“What’s going on? What happened? Why did I suddenly come here? I’m using the Taboo Art, My Divine Dragon Bloodline!”<br/><br/>In a medicinal garden of the Sky Sea Dragon Palace, the body of the Sky Dragon King suddenly appeared in another medicinal garden.<br/><br/>He widened his eyes and his expression changed drastically.<br/><br/>What on Earth happened?<br/><br/>His forbidden art had been completed, but why did he suddenly come here?<br/><br/>He looked at the black symbols on his body, and his eyes revealed a look of panic.<br/><br/>The reason why the forbidden art was called a forbidden art was because if something went wrong, he would have to pay with his life.<br/><br/>Now that his forbidden art had been completed, if he couldn’t complete it, he would die.<br/><br/>This made his face full of panic.<br/><br/>How did he suddenly come here?<br/><br/>“There’s only one possibility. I was treated as a chess piece.”<br/><br/>As the leader of a powerful force and the founder of a powerful force, he quickly thought of a situation.<br/><br/>In fact, he had suspected the Dragon Palace before.<br/><br/>However, with the inheritance he had obtained and his knowledge, he wasn’t sure if there was anything strange about the sky-sea Dragon Palace.<br/><br/>He did not understand how powerful the peak race was.<br/><br/>Now that he had been transferred here for no reason, he was certain that there was a controller in the Sky Sea Dragon Palace.<br/><br/>“No, no, I don’t want to die, I don’t want to Die!”<br/><br/>The Sky Dragon King revealed a panicked expression. He moved his body and dashed towards the herb garden behind him.<br/><br/>He wanted to complete the forbidden art.<br/><br/>…<br/><br/>Buzz<br/><br/>At the same time, in the herb garden where Wang Xian was located, the Dragon King of Tianhai was hovering in front of him with a ferocious look on his face.<br/><br/>The black symbols in his body were connected to the black symbols on Wang Xian’s body.<br/><br/>This caused Wang Xian to lose control of his body. He could not control his own body at all.<br/><br/>He could only watch helplessly with an abnormally ugly expression on his face.<br/><br/>Crisis. This was the greatest crisis that Wang Xian had ever encountered.<br/><br/>It also allowed him to witness the powers and peculiarities of some powerful races and powerhouses.<br/><br/>The Heaven Dragon King had planned for three years to lure him here to carry out the heaven-stealing meridian exchange.<br/><br/>On the other hand, the Heaven Sea Dragon King of the Heaven Sea Dragon Palace had spent billions of years using the Heaven Dragon King as a chess piece to wait for the Purebred Divine Dragon bloodline.<br/><br/>With such a scheme, Wang Xian, who was in the midst of it, did not have the slightest sense of alertness.<br/><br/>He could not imagine it at all.<br/><br/>“This forbidden art of the heaven pilfering meridian exchange might cause permanent damage to myself.”<br/><br/>Wang Xian looked at the black symbol with an awkward expression.<br/><br/>He was dead and could be resurrected again. However, this forbidden art could extract his bloodline.<br/><br/>If his bloodline was completely extracted, what would happen?<br/><br/>Would his bloodline be affected after he was resurrected?<br/><br/>“Tianhai Dragon King, you and I are originally from the Divine Dragon Bloodline. Why are you killing each other?”<br/><br/>He stared at Tianhai Dragon King and shouted with a dark face.<br/><br/>“Hahaha, if you give me your body, I can let you go.”<br/><br/>Tianhai Dragon King laughed loudly and began to wave the mysterious black symbol.<br/><br/>The forbidden technique had already been activated, but it could no longer be stopped.<br/><br/>Buzz<br/><br/>In an instant, Wang Xian sensed a terrifying energy coming from the mysterious symbol. He felt his blood and all the essence in his body being rapidly transferred.<br/><br/>His expression changed drastically when he sensed this terrifying energy.<br/><br/>“Hahaha, I, the Tianhai Dragon King, am finally going to see the light of day again. I will roar again!”<br/><br/>The Tianhai Dragon King felt that the forbidden art had been completely activated. He roared in excitement.<br/><br/>Buzz<br/><br/>At this moment, Wang Xian, who was panicking, suddenly felt a slight tremor in the position of his heart.<br/><br/>“This is?”<br/><br/>Wang Xian was slightly stunned. He immediately began to focus. He saw the ancestral tree in his body tremble slightly and emit a fluorescent light.<br/><br/>The fluorescent light enveloped his body, causing his agitated blood and essence to completely stabilize.<br/><br/>“What’s going on?”<br/><br/>At this moment, the Tianhai Dragon King in front of him let out a surprised cry.<br/><br/>He sensed that the energy of the taboo technique had suddenly stopped.<br/><br/>It was his first time using the taboo technique, and he didn’t know why.<br/><br/>At this moment, Wang Xian sensed that the ancestral tree in his body was slowly extending a branch. The branch was twining toward the mysterious symbols in his body.<br/><br/>“Whoosh!”<br/><br/>The branch was twining around the mysterious symbols. The mysterious symbols that were connected together were quickly absorbed by the ancestral tree.<br/><br/>“The power of the ancestral tree!”<br/><br/>When Wang Xian saw this scene, his eyes revealed an extremely excited expression.<br/><br/>In his body, there was the strongest and most powerful ancestral tree in the universe, the Heaven’s origin creation.<br/><br/>The Heaven’s origin creation represented the pinnacle of the universe and represented an invincible existence.<br/><br/>Back then, when the sky array wanted to possess him, it was easily blocked by the ancestral tree.<br/><br/>Now that this forbidden technique wanted to take the essence of his body, the ancestral tree that lived in his body naturally resisted it.<br/><br/>Even if the ancestral tree had not reached its peak, it was still not something that a forbidden technique could resist.<br/><br/>It was possible that an existence at the level of the ancestral tree did not put this forbidden technique in his eyes.<br/><br/>Under his sensing, the branches of the ancestral tree were absorbing the black mysterious symbols rapidly. One by one, the mysterious symbols seemed to be attracted by something as they surged into his body.<br/><br/>“What’s going on?”<br/><br/>At the front, the Tianhai Dragon King suddenly realized that the mysterious symbols on his body were surging into Wang Xian’s body. His eyes widened in disbelief.<br/><br/>“What’s going on?”He roared crazily.<br/><br/>What happened.<br/><br/>A series of black mysterious symbols were being absorbed rapidly. The number of black symbols in his body was decreasing rapidly.<br/><br/>Wang Xian raised his head and looked at the Tianhai Dragon King. A faint smile appeared on his face.<br/><br/>“This forbidden technique of yours is only so-so!”<br/><br/>As he spoke, a sinister look slowly appeared in his eyes.<br/><br/>This time, he almost died here.<br/><br/>“No, no, this is a forbidden technique, but it’s an ancient technique. How could such a situation happen? No, no, no!”<br/><br/>The Tianhai Dragon King’s face fell upon seeing this scene. He roared indignantly.<br/><br/>He had planned for billions of years just for today, but what was happening now?<br/><br/>Was there a problem with the forbidden technique?<br/><br/>Or was it because he was only a dragon soul?<br/><br/>“No!”<br/><br/>He roared in disbelief and watched as the black symbols in his body were all absorbed.<br/><br/>When the black symbols disappeared, he suddenly felt an attractive force. He felt that his dragon soul was about to be absorbed.<br/><br/>This made the Tianhai Dragon King’s expression change drastically.<br/><br/>“I can’t accept this!”<br/><br/>He roared crazily and struggled to break free.<br/><br/>But at this time, he felt that a part of his dragon soul had disappeared.<br/><br/>This made him full of fear.<br/><br/>“No!”<br/><br/>He waved his dragon claw and directly cut his dragon soul into two halves. Half of it stayed here and the other half disappeared.<br/><br/>Rumble<br/><br/>When he lost half of his Dragon Soul, the entire dragon palace trembled violently.\t\t\t\t\t\t</div>", "images": {}, "success": true}