{"id": 196, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15072293.html", "title": "Chapter 3187 - Chapter 3187: Under The Siege Of The Two Forces,", "volume": 2, "volume_title": "Volume 2", "body": "<h1>Chapter 3187 - Chapter 3187: Under The Siege Of The Two Forces,</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 3187: Under the siege of the two forces,<br/><br/>“Let’s go to the Dragon Palace through the teleportation formation.”<br/><br/>Seeing the ancient painting sect and the Heavenly Dragon Clan enter the teleportation formation, several venerables of the foggy race frowned and said.<br/><br/>They moved and immediately flew toward the silver gazing continent.<br/><br/>Three years ago, the Dragon Palace had opened a teleportation formation to the silver gazing continent.<br/><br/>However, that teleportation array was a small one.<br/><br/>Even if the experts of the ancient painting sect and the Heavenly Dragon Clan knew about it, they didn’t dare to use that teleportation array.<br/><br/>They were afraid that the Dragon Palace would wait for them there.<br/><br/>However, they could use the teleportation array to watch.<br/><br/>The venerables of the foggy race quickly flew toward the silver gazing continent. Some other experts also thought of this and immediately flew over.<br/><br/>“Buzz, Buzz, Buzz!”<br/><br/>Soon, the teleportation array in front of the dragon palace lit up.<br/><br/>The figures of the experts from the Milky Way appeared.<br/><br/>However, when they just came out, they felt a terrifying pressure.<br/><br/>This made their faces change drastically.<br/><br/>“Irrelevant people, stay away from here.”<br/><br/>A voice sounded, and the venerables of the foggy race immediately looked to the side.<br/><br/>When they saw the position on the other side, their pupils constricted slightly.<br/><br/>On the side, a dense army of members of the Dragon Palace was already standing there, and they were all staring at the position in front of them with murderous intent.<br/><br/>Obviously, the Dragon Palace had already known that the ancient painting sect and the Heavenly Dragon Clan were coming to invade them.<br/><br/>“Since everyone of the Dragon Palace has already known, we won’t disturb you.”<br/><br/>The venerables of the foggy race cupped their hands and flew to the side.<br/><br/>“Hehe!”<br/><br/>Prime Minister Gui smiled faintly.<br/><br/>Several venerables of the foggy race flew to the side and looked at the surrounding void.<br/><br/>Obviously, the teleportation array of the ancient painting sect and the Heavenly Dragon clan was not set around the Dragon Palace.<br/><br/>This was normal. If it was set around the Dragon Palace, the Dragon Palace would sense it the moment they appeared.<br/><br/>Buzz<br/><br/>More and more people rushed over from the teleportation array and flew toward the Void to the side.<br/><br/>Prime Minister Gui looked at the spectators and narrowed his eyes slightly. He didn’t stop them.<br/><br/>“This time, the Dragon King is not here, and there’s no reply even after sending them a message. This battle might be a tough one for us.”<br/><br/>The sky array looked forward, its eyes shining.<br/><br/>“Keke, I really don’t believe that with our strength, the ancient painting sect and the Sky Dragon Clan can break us?”<br/><br/>Ba Qi shouted coldly, his face full of killing intent.<br/><br/>“According to the information in the universe ai, the ancient painting sect should have three universe knights at level three, and the Sky Dragon Clan should have at least five universe knights at level three.”<br/><br/>Prime Minister Gui looked at the sky array and thunder eight points.<br/><br/>There were three level 3 knights in the sky array and thunder eight points.<br/><br/>Even though the sky array had powerful array power, it was still weaker at its peak.<br/><br/>Not to mention that the two forces might have powerful treasures.<br/><br/>“We don’t want to win this battle, we just need to defend it.”<br/><br/>Prime Minister GUI said, “After the Dragon King and the Willow deity return, we’ll play with them.”<br/><br/>“If they dare to attack our Dragon Palace, we’ll make them pay!”<br/><br/>“Kill!”<br/><br/>The leaders of the Dragon Palace in the surroundings were full of violent killing intent.<br/><br/>“They’re here!”<br/><br/>At this moment, Lei Ming narrowed his eyes and said solemnly.<br/><br/>They didn’t have much confidence in this battle because the Dragon King and the willow deity weren’t here.<br/><br/>“Buzz, Buzz, Buzz!”<br/><br/>Lei Ming and the others only sensed a terrifying power, but the surrounding sky suddenly changed.<br/><br/>A golden light flew over from the sky. The Golden Light had a trace of holiness and was irresistible.<br/><br/>The golden light slowly condensed into the shadows of four Golden Dragons, and the surrounding golden light spread out.<br/><br/>The Golden Dragons covered the entire space of the Dragon Palace with golden light.<br/><br/>The four Golden Dragons were guarding the four sides.<br/><br/>“HMM? Is this a formation?”<br/><br/>Prime Minister Gui narrowed his eyes and raised his eyebrows slightly as he looked at the golden dragons guarding the four sides.<br/><br/>“It’s to seal our formation, but I can break it.”<br/><br/>The sky array glanced at the sealing formation and said faintly with a smile.<br/><br/>“Roar!”<br/><br/>“Roar!”<br/><br/>“Kill! Kill! Kill!”<br/><br/>When the formation suppressed the Dragon Palace, roars and angry roars came from the front.<br/><br/>All the members of the Dragon Palace looked over and narrowed their eyes.<br/><br/>In the center, Heavenly Dragons were swinging their huge bodies and charging toward them with furious faces.<br/><br/>On the right, the powerful disciples of the ancient art sect were standing on various divine weapons or huge war machines.<br/><br/>Among them, the sect leader and an old man were standing on a painting.<br/><br/>This painting was simple and had mountains and rivers on it. It was filled with a mysterious aura.<br/><br/>Behind the ancient painting sect, there was a battleship with a radius of over 10,000 km.<br/><br/>This battleship was covered in lightning. From Afar, it looked like a huge thunder beast.<br/><br/>In the universe, there were still very powerful technological races.<br/><br/>There were even technological battleships and mechs that could kill universe knights at Level 7 or 8.<br/><br/>Their gazes were locked onto the dragon palace, filled with killing intent.<br/><br/>“All members of the Dragon Palace, Get Ready!”<br/><br/>Prime Minister Gui and the others saw the arrival of the two forces, their eyes revealed a cold expression as they shouted.<br/><br/>“Fight!”<br/><br/>“Those who offend the Dragon Palace, even if they are far away, they will be killed!”<br/><br/>The disciples of the Dragon Palace also roared in a berserk manner as waves of might directly charged forward.<br/><br/>“Hahaha, Dragon Palace, today will be the day you die if you dare to kill the experts of our ancient painting sect.”<br/><br/>The sect master of the ancient painting sect stared at the Dragon Palace with a bloodthirsty gaze as he coldly roared.<br/><br/>“Hehe, your small ancient painting sect is nothing in the eyes of our Dragon Palace.”<br/><br/>Prime Minister Gui Glanced at the sect master of the ancient painting sect and said with slight disdain. He looked at the Heavenly Dragon Clan.<br/><br/>“Heavenly Dragon Clan, we are both from the Divine Dragon clan and have no enmity with you. I wonder why you are helping the wicked.”<br/><br/>He asked indifferently.<br/><br/>“Our Heavenly Dragon Clan is not here to destroy you. We can give you a choice to submit to us.”<br/><br/>In front of the Heavenly Dragon Clan, the Heavenly Dragon Duke looked at all the members of the Dragon Palace. His eyes were shining as he said proudly.<br/><br/>The Heavenly Dragon Clan didn’t care about the dragon palace at all.<br/><br/>According to the information they had, the Heavenly Dragon Clan could destroy the small dragon palace.<br/><br/>“Submit to you? Hehe, what if we don’t agree?”<br/><br/>Prime Minister Gui’s eyes flashed with killing intent when he heard his words.<br/><br/>“If you don’t agree, then I can only destroy you. You are seeking your own destruction!”<br/><br/>The Heavenly Dragon said calmly.<br/><br/>It was as if he was making a judgment.\t\t\t\t\t\t</div>", "images": {}, "success": true}