{"id": 198, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15072297.html", "title": "Chapter 3189 - Chapter 3189: 3188 Terrifying Inheritance", "volume": 2, "volume_title": "Volume 2", "body": "<h1>Chapter 3189 - Chapter 3189: 3188 Terrifying Inheritance</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 3189: 3188 terrifying inheritance<br/><br/>Powerful Divine Dragon Inheritance!<br/><br/>When the ancient painting sect and the Heavenly Dragon Clan saw the attack from the Dragon Palace, their expressions changed drastically.<br/><br/>They were shocked and in disbelief.<br/><br/>Everyone knew the Dragon Palace’s strength three years ago.<br/><br/>The battle three years ago was a very dangerous war for the Dragon Palace.<br/><br/>They couldn’t hide their strength during that battle.<br/><br/>However, three years ago, they only had about 40 universe knights. Now, they had more than doubled their strength.<br/><br/>With such a terrifying improvement speed, the godly dragon inheritance that the dragon palace had must be very terrifying.<br/><br/>“Hiss, this… This improvement speed of the Dragon Palace!”<br/><br/>The Knights of the Mist race and the other great beings of the Milky Way were all shocked.<br/><br/>What a terrifying inheritance, to be able to make the Dragon Palace improve so quickly.<br/><br/>“10 pure-blooded divine dragons, such a terrifying speed of improvement, this dragon palace must have obtained the inheritance of a peak divine dragon.”<br/><br/>The leader of the ancient painting sect was also trembling, his eyes wide open.<br/><br/>On the side, the Heavenly Dragon Male Heavenly Dragon mother and the other Level 3 universe knights looked at each other, their eyes filled with passion.<br/><br/>Compared to the pure-blooded dragon God, the terrifying inheritance of the dragon palace was more attractive to them.<br/><br/>How powerful could an inheritance that could raise the level of the Dragon Palace so quickly be?<br/><br/>“Destroy the Dragon Palace, we must destroy them.”<br/><br/>“There are only three level 3 universe knights. With our strength, it’s enough!”<br/><br/>Heavenly Dragon Male roared and looked at the sect leader of the ancient art sect.<br/><br/>“Destroy the dragon palace at all costs!”<br/><br/>The sect master of the ancient painting sect nodded and growled.<br/><br/>The strength of the Dragon Palace shocked them, but what shocked them even more was the speed at which the Dragon Palace was improving.<br/><br/>The Dragon Palace was now stronger than their ancient painting sect. If they were allowed to develop for another 10 or 100 years, their ancient painting sect would definitely be destroyed.<br/><br/>Therefore, they had to destroy the Dragon Palace this time.<br/><br/>At all costs!<br/><br/>“Kill! All disciples, Attack!”<br/><br/>The sect master of the Ancient Painting sect immediately roared and took the lead. He flew forward and attacked again.<br/><br/>“Kill!”<br/><br/>Duke of Heaven Dragon and the others flapped their enormous wings and charged forward.<br/><br/>“Kill, Kill, Kill!”<br/><br/>“Roar, Roar, Roar!”<br/><br/>Behind them, five million disciples of the ancient painting sect and two to three million disciples of the Heavenly Dragon Clan immediately moved and attacked the Dragon Palace.<br/><br/>“Welcome the battle!”<br/><br/>Prime Minister Gui narrowed his eyes and roared with killing intent.<br/><br/>“Roar, Roar, Roar!”<br/><br/>All the disciples of the Dragon Palace went up to welcome him without fear.<br/><br/>The dragon power in their bodies charged forward.<br/><br/>“Roar! Roar!”<br/><br/>When the dragon power of the Dragon Palace swept toward the Sky Dragon Clan, some of the sub-dragons of the Sky Dragon clan trembled and revealed terrified expressions.<br/><br/>“Roar! Roar! Kill them!”<br/><br/>The leading experts of the Sky Dragon Clan felt the suppression of their bloodline and their expressions changed slightly as they roared sternly.<br/><br/>“Roar! Roar! Roar!”<br/><br/>All the disciples of the Sky Dragon Clan revealed a trace of madness as they charged toward the members of the Dragon Palace.<br/><br/>“Kill them!”<br/><br/>Determination shone in the eyes of the Heavenly Dragon Duke and the others as they locked onto the Great Beings of the Dragon Palace.<br/><br/>“Leave the four level-three godly emperor great beings to me.”<br/><br/>Sky Array looked at the enemies with the Combat Power of seven universe knights at level-three and said directly.<br/><br/>He waved his arm, and the array that had been set up in the surroundings was immediately activated and attacked the four level-three universe knights.<br/><br/>“Leave the two to me!”<br/><br/>“Roar!”<br/><br/>Lei Ming growled, his gaze locked onto Heavenly Dragon Duke and Heavenly Dragon mother as he attacked.<br/><br/>“Keke, leave the last one to me!”<br/><br/>Ba Qi laughed coldly and charged forward.<br/><br/>“Dragon Wizards, lock onto the 10 Level 2 universe knights.”<br/><br/>Prime Minister Turtle ordered coldly when he saw the two universe knights attacking.<br/><br/>“Yes!”<br/><br/>10,000 dragon wizards immediately responded. Every 1,000 of them locked onto a level 2 knight and attacked him with an overwhelming array formation.<br/><br/>Since their levels were two levels higher, they could only deal with a level 2 knight at most.<br/><br/>Otherwise, they wouldn’t be able to keep up with his speed.<br/><br/>“The rest of the Dragon Palace Knights, kill them!”<br/><br/>Prime minister turtle glanced at the 150 or so knights of the two forces and roared.<br/><br/>“Kill!”<br/><br/>The Dragon Palace Knights locked onto the enemy and rushed out.<br/><br/>In the ancient painting sect, there were seven universe knights at level 3 and 25 at level 2.<br/><br/>The rest were all at level 1.<br/><br/>The Dragon Palace had 11 universe knights at Level 2.<br/><br/>10,000 dragon wizards were fighting against 10,15 and 10 universe knights from the Dragon Palace.<br/><br/>The other great beings from Dragon Palace were fighting against more than 100 Level 1 universe knights.<br/><br/>“Dragon Cannon, Attack!”<br/><br/>However, Dragon Palace had dragon cannon and all kinds of weapons made by the fire hammer clan, which were enough to deal with a few level 1 universe knights.<br/><br/>In an instant, a big battle broke out.<br/><br/>“Disciples of Dragon Palace, get into formation and Charge!”<br/><br/>Below universe knights, there were one million members of Dragon Palace, one million members of devouring dragon, and those with the weakest level three godly emperor strength immediately formed battle formations and charged forward.<br/><br/>“Roar!”<br/><br/>“Hong! Hong! Hong!”<br/><br/>The terrifying attacks collided, and the entire world seemed to tremble.<br/><br/>“Dragon Palace is very powerful, but it’s still weaker than the two forces.”<br/><br/>“It is still much weaker, both in terms of high-end combat power and the number of universe knights.”<br/><br/>In the surrounding areas, the Milky Way warriors who were watching the battle were shocked and discussing when they saw that the battle had completely erupted.<br/><br/>In a split second, the Dragon Palace side also felt a huge pressure.<br/><br/>Prime minister turtle frowned slightly, and his eyes gleamed.<br/><br/>Weng Weng Weng Weng<br/><br/>At this moment, an evil and depraved voice came from the side.<br/><br/>Prime Minister Turtle was stunned when he heard this voice.<br/><br/>The evil voice spread to the front.<br/><br/>This evil voice made the universe knights from the ancient painting sect and the Heavenly Dragon clan pause and change their expressions.<br/><br/>“Oh no, what is this sound? It actually interferes with the circulation of the energy in my body, and it makes me feel crazy.”<br/><br/>A Universe Knight Level 2 great being from the ancient art school had a huge change in expression, and he shouted in fear.<br/><br/>“What a strange sound, what an evil sound!”<br/><br/>The expressions of all the universe knights level 1 great beings changed even more.<br/><br/>Pu<br/><br/>“Ah!”<br/><br/>Suddenly, a scream sounded.<br/><br/>A Universe Knight from the ancient art school had blood-red eyes under this evil voice. He lost control and started to attack the surroundings.<br/><br/>Ao Yao, who was hiding in the light and darkness, instantly launched an attack and killed him!<br/><br/>“Ah Ah Ah!”<br/><br/>Below, when the evil voice sounded, the eyes of the ancient art school and the Sky Dragon Race’s warriors turned blood-red.<br/><br/>They also began to attack the people around them.<br/><br/>They were instantly bewitched.\t\t\t\t\t\t</div>", "images": {}, "success": true}