{"id": 199, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15072299.html", "title": "Chapter 3190 - Chapter 3190: 3189 Ancient Painting Was In The Sky, And The Sky Dragon Was Roaring", "volume": 2, "volume_title": "Volume 2", "body": "<h1>Chapter 3190 - Chapter 3190: 3189 Ancient Painting Was In The Sky, And The Sky Dragon Was Roaring</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 3190: 3189 ancient painting was in the sky, and the Sky Dragon was roaring<br/><br/>“What!”<br/><br/>“What kind of weird sound is this?”<br/><br/>The fallen evil voice made the universe knights tremble, and those below that level went crazy.<br/><br/>This made the faces of the experts from the ancient painting sect of the Sky Dragon clan change drastically.<br/><br/>The pupils of everyone watching the battle also shrank, and they were filled with shock.<br/><br/>“Damn it, stop this sound!”<br/><br/>When Heavenly Dragon Duke heard this voice, he felt that the energy in his body was strangely obstructed. Sensing the situation around him, he shouted sternly.<br/><br/>“Kill!”<br/><br/>Below, all the disciples of the Dragon Palace seized this tiny opportunity and unleashed all their combat strength.<br/><br/>Countless arrows shot towards the disciples of the two large factions in front of them.<br/><br/>Terrifying Energy poured out.<br/><br/>In an instant, hundreds of thousands of great disciples from the two forces were killed.<br/><br/>This time, the disciples from the ancient painting sect and the Sky Dragon Clan were all elite level beings, all of them were god Emperor level great beings.<br/><br/>“Damn it!”<br/><br/>“Sky Dragon Roar!”<br/><br/>“Sky Dragon Roar, block this strange sound.”<br/><br/>Several universe Knight Level 3 Great Beings from the Sky Dragon Clan roared and raised their heads.<br/><br/>“Roar Roar Roar!”<br/><br/>In the next moment, roars came from their bodies.<br/><br/>The Sky Dragon clan mainly focused on metal and wind attributes.<br/><br/>As the order sounded, all the sky dragon sub-dragons raised their heads at the same time.<br/><br/>The sound of metal clanging and the sound of wind tearing came from their mouths.<br/><br/>Numerous metal law sharp weapons and wind law wind blades flew out from their mouths and whistled towards everyone in the Dragon Palace.<br/><br/>The Roar and the attack drowned out the evil and depraved sound.<br/><br/>Beside Prime Minister Gui, the Dolphin clan leader holding the black resurrection Lily frowned slightly when he saw the millions of heavenly dragons’roars drown out the black resurrection Lily’s depraved sound.<br/><br/>“Defend!”<br/><br/>Prime Minister GUI’s expression changed slightly when he saw the terrifying Heavenly Dragon’s roar. He moved and joined the battle to defend.<br/><br/>“With my current strength, if I use the black spider lilies’evil sound in a small area, the effect will be reduced and it will be counteracted by the Dragon’s Roar.”<br/><br/>The leader of the Dolphin clan frowned and looked at the Battle of the Knights. He used this evil sound to help the powerful warriors of the Dragon Palace.<br/><br/>“Kill, Kill, Kill!”<br/><br/>The powerful disciples of the ancient painting sect were filled with killing intent when they saw that the strange sound was broken.<br/><br/>They attacked the disciples of the Dragon Palace crazily.<br/><br/>“Ancient painting, mountain and river world suppression, get out of my way!”<br/><br/>In the sky, the sky array was fighting against three universe knights of the Ancient Painting sect and a universe Knight of the Sky Dragon Clan, a universe knight with level 3 battle strength.<br/><br/>One against four, he was not at a disadvantage under the powerful array.<br/><br/>At this time, the sect leader of the ancient painting sect moved, and the ancient painting floating under him rose up.<br/><br/>The mountains and rivers above the ancient painting instantly reflected reality.<br/><br/>In an instant, a mountain and river appeared in the starry sky above, smashing towards the formation of the Heaven Array.<br/><br/>“The ancient painting is in the sky, and the mountains and rivers are transforming into stars, suppressing the current age!”<br/><br/>Beside him, the ancient painting beneath the first Supreme Elder of the ancient painting sect also rose into the sky.<br/><br/>The ancient painting beneath him transformed into stars, and a single starry sky seemed to appear, also attacking the formation of the Heaven Array.<br/><br/>“Oh no, this power is so terrifying!”<br/><br/>Sensing the power from the two ancient paintings, Tian Chen’s expression changed slightly.<br/><br/>Although Tian Chen was very powerful, his current realm was only at the peak of the Divine Emperor Realm.<br/><br/>The ancient painting sect was a powerful sect that had stood for billions of years. It had an extremely deep foundation.<br/><br/>This ancient painting was the precious treasure of their ancient painting sect.<br/><br/>Only the sect master and the Grand Supreme Elder could possess it and pass it down from generation to generation.<br/><br/>The power of the ancient painting was abnormally terrifying. Amongst acquired spiritual treasures, it was considered the peak.<br/><br/>Even if this ancient painting prevented them from fighting against opponents of a higher level, it could still allow them to fight against two or three opponents of the same level.<br/><br/>“Peng Peng Peng!”<br/><br/>The first ancient painting’s mountains and rivers flowed down, and the formations in the sky array quickly collapsed.<br/><br/>He waved his hands and the formations blocked them one by one.<br/><br/>“Rumble!”<br/><br/>However, at this time, meteorites fell from the sky and smashed toward his position.<br/><br/>This caused the expression of the sky array to change again.<br/><br/>“I’m in trouble. One person can’t block so many experts.”<br/><br/>The sky array growled in a low voice with an embarrassed expression.<br/><br/>“Kill, Kill, kill! Hahaha, no matter how powerful your Dragon Palace is, I will destroy you today!”<br/><br/>The sect master of the ancient painting sect had a grim expression on his face when he heard his words.<br/><br/>“Roar, Roar, Roar! Even if you are a pure-bred divine dragon, it’s still wishful thinking for you to fight against us!”<br/><br/>On the side, Lei Ming was fighting against the Heavenly Dragon Male and Heavenly Dragon Mother.<br/><br/>They glanced to the side and saw that the sect master of the ancient painting sect and the others had the upper hand. Their eyes shot out a golden light.<br/><br/>“Dragon Pearl!”<br/><br/>They roared in unison and opened their mouths. Two Golden Dragon Pearls flew out from their bodies.<br/><br/>The dragon pearl emitted a terrifying aura and condensed into the shape of a dragon’s head.<br/><br/>This Dragon Pearl was a dragon pearl born from a pure-bred divine dragon.<br/><br/>This was a powerful treasure they had obtained from the Sky Sea Dragon Palace.<br/><br/>It was comparable to a powerful acquired spiritual treasure.<br/><br/>“Eh?”<br/><br/>Lei Ming’s expression changed slightly when he sensed the power contained within the two dragon balls.<br/><br/>The strength of the Sky Dragon King’s Sky Dragon mother was much, much stronger than the dragon skeleton and blood dragon he had fought last time.<br/><br/>“Thunder Roar!”<br/><br/>Lei Ming focused his mind and roared furiously.<br/><br/>“Roar, Roar, Roar, I’ll help you suppress the Thunder Dragon!”<br/><br/>At this moment, the voice of a heavenly dragon came from the side.<br/><br/>Lei Ming looked over and his expression changed slightly.<br/><br/>A heavenly dragon from the Sky Formation flew over.<br/><br/>This caused Lei Ming’s pressure to increase dramatically.<br/><br/>It was already very difficult to fight two people by himself. Now, there was another person of the same level.<br/><br/>He was not a match at all.<br/><br/>“Dragon Pearl, Golden Dragon Kill!”<br/><br/>The Heavenly Dragon Male and Heavenly Dragon mother roared wildly. The Golden Dragon Pearl emitted a dazzling golden light and turned into a dragon claw that attacked Lei Ming directly.<br/><br/>In the sky, the Heavenly Dragon also attacked.<br/><br/>“Thunder Dragon Extermination!”<br/><br/>Lei Ming’s expression changed. He roared and used his strongest law form.<br/><br/>“Peng, Peng, Peng!”<br/><br/>However, the moment he used his law form, two dragon pearls and another level 3 knight attacked.<br/><br/>His law form was instantly destroyed, and the two Golden Dragon Claws attacked Lei Ming.<br/><br/>“Bang, Bang!”<br/><br/>Lei Ming’s expression changed dramatically, and he quickly stretched out his dragon claws to block them.<br/><br/>However, the terrifying attacks from the two dragon balls sent him flying, and he spat out blood.<br/><br/>“Retreat, Retreat!”<br/><br/>“All members of the Dragon Palace, retreat into the Dragon Palace immediately!”<br/><br/>Prime Minister Gui sensed that Lei Ming was injured and that the sky array was being suppressed. His expression changed dramatically, and he immediately gave the order to retreat.<br/><br/>“Retreat!”<br/><br/>When the disciples of the Dragon Palace heard the order, their expressions changed slightly, and they immediately retreated.<br/><br/>The Dragon Palace was no match for the ancient painting sect and the Heavenly Dragon Clan.\t\t\t\t\t\t</div>", "images": {}, "success": true}