{"id": 197, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15072295.html", "title": "Chapter 3188 - Chapter 3188: 3187 Dragon Palace’S Strength", "volume": 2, "volume_title": "Volume 2", "body": "<h1>Chapter 3188 - Chapter 3188: 3187 Dragon Palace’S Strength</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 3188: 3187 Dragon Palace’s strength<br/><br/>“Destroy us! hahaha! Heavenly Dragon Clan, ancient painting sect, do you really think you can destroy our Dragon Palace by joining forces?”<br/><br/>“How arrogant!”<br/><br/>Prime Minister Gui stared at Heavenly Dragon Duke and said coldly.<br/><br/>“Hahaha! Your Dragon King has been killed by our Heavenly Dragon King. Now it’s your turn.”<br/><br/>The Heavenly Dragon King laughed when he heard Prime Minister Gui’s words.<br/><br/>“What? The Heavenly Dragon King killed the Dragon King?”<br/><br/>“Hiss, when… When did this happen? The Heavenly Dragon King actually killed the Dragon King of the Dragon Palace?”<br/><br/>“Really?”<br/><br/>The experts from the Milky Way who had come to watch the battle from the back were shocked when they heard their words.<br/><br/>The Dragon King had been killed?<br/><br/>“You, the Sky Dragon King, want to kill our Dragon King?”<br/><br/>Lei Ming said coldly.<br/><br/>Prime Minister Gui and the others also sneered.<br/><br/>If something happened to the Dragon King, something would happen to the Dragon Palace. Now that the Dragon Palace was safe, nothing would happen to the Dragon King.<br/><br/>Moreover, the willow deity was with the Dragon King this time.<br/><br/>With the Willow Deity’s strength, she could easily kill the Sky Dragon King.<br/><br/>“If Your Dragon King is going to die, all of you are going to die too!”<br/><br/>The sect master of the ancient painting sect said as he gently waved his arm.<br/><br/>“Boom!”<br/><br/>In the next moment, waves of terrifying aura spread out from all the experts of the ancient painting sect.<br/><br/>“Our Heavenly Dragon Clan wants to capture all the pure-blooded divine dragons of the Dragon Palace alive. Hahaha, don’t hurt them.”<br/><br/>The Heavenly Dragon Duke laughed wildly and roared loudly.<br/><br/>“Roar Roar Roar!”<br/><br/>Behind him, all the Sky Dragon Clan members roared in unison.<br/><br/>“You want to capture US alive? Roar Roar Roar!”<br/><br/>The nine wind god Dragons revealed killing intent in their eyes. Their bodies moved and instantly transformed into incomparably huge wind god dragons.<br/><br/>Waves of majestic dragon power rushed forward.<br/><br/>Some Sky Dragon Clan members below the knight level felt this dragon power and their expressions changed drastically, filled with fear.<br/><br/>This was the pressure from their bloodline.<br/><br/>“A bunch of sub-dragons, how dare you provoke us, you’re courting death!”<br/><br/>Lei Ming instantly turned into a huge thunder dragon and roared coldly.<br/><br/>“All the disciples of the Dragon Palace prepare, let the Sky Dragon Clan Trash Know What a True Dragon God is, a true dragon God.”<br/><br/>Prime Minister Gui waved his arm and ordered loudly.<br/><br/>“Kill!”<br/><br/>All the members of the Dragon Palace roared.<br/><br/>“Kill! Kill everyone except the Purebred Dragon God!”<br/><br/>“All the disciples of the Ancient Painting Sect, kill! Avenge the vice sect master and the others!”<br/><br/>The orders of the Heavenly Dragon Duke and the sect master of the ancient painting sect were heard.<br/><br/>“Buzz!”<br/><br/>When the Horn of war sounded, the whole sky seemed to be boiling.<br/><br/>At the center of the ancient painting sect was a battleship that was over 10,000 km long, and at the center was lightning.<br/><br/>A lightning pillar was formed at a terrifying speed.<br/><br/>The energy contained within was enough to destroy a level 2 knight.<br/><br/>This time, the ancient painting sect sent out a powerful trump card.<br/><br/>“Hiss, the war is about to start. The ancient painting sect and the Heavenly Dragon Clan have so many knights, how can the Dragon Palace defend against it!”<br/><br/>“This aura is too terrifying. Let’s continue to retreat!”<br/><br/>When they saw the auras of both sides rise and the venerables from the ancient painting sect and the Sky Dragon Clan fly into the sky one by one, the surrounding Milky Way great beings who were watching the battle were filled with shock.<br/><br/>How could they defend against such a huge disparity in battle strength?<br/><br/>“Kill everyone except the pure-blooded dragon God with one move.”<br/><br/>The Sky Dragon Mother ordered with a face full of confidence.<br/><br/>Hong! Hong! Hong<br/><br/>In the next moment, a terrifying and vast power of the metal law form condensed in front of him.<br/><br/>All the other universe knights of the Heavenly Dragon Clan also started to attack at the same time.<br/><br/>On the side, the 50 universe knights of the ancient painting sect followed closely behind.<br/><br/>Hong! Hong! Hong<br/><br/>When the 150 or so universe knights started to attack at the same time, the space in front of them was instantly torn apart.<br/><br/>A powerful force rushed toward the Dragon Palace, as if it was going to destroy the entire Dragon Palace with one strike.<br/><br/>The battleships of the ancient painting sect and the lightning pillars on them also attacked the Dragon Palace.<br/><br/>The entire scene made people tremble from afar.<br/><br/>“Hehe, you want to destroy the Dragon Palace with one strike?”<br/><br/>“All the disciples of the Dragon Palace, show them the strength of our Dragon Palace.”<br/><br/>When Prime Minister Turtle heard the Mother Dragon’s words, his face revealed a mocking expression.<br/><br/>“Hong Hong Hong!”<br/><br/>In an instant, the leaders of the Dragon Palace and the Great Beings of the knight level gathered terrifying energy in front of them.<br/><br/>The Dragon Palace now had close to 100 universe knights.<br/><br/>But now, besides the Universe Knights, the Dragon Palace also had a big killing weapon.<br/><br/>At the center of the back, more than 10,000 Dragon Wizards stood on the Heaven’s manifestation chessboard, releasing the same array formation.<br/><br/>A level nine godly monarch array formation had reached the peak of the godly monarch realm with the support of the heaven’s manifestation chessboard.<br/><br/>When 10,000 peak godly monarch experts attacked, what kind of concept was that?<br/><br/>The surrounding energy was crazily extracted, and the entire sky suddenly turned dark.<br/><br/>The energy was even more terrifying than the ancient painting sect and the Sky Dragon Clan.<br/><br/>“What!”<br/><br/>When the nearly 100 universe knights of the Dragon Palace unleashed their power, and when the Dragon Wizard released the array formation, the expressions of the Universe Knights of the Sky Dragon Clan and the ancient painting sect on the opposite side changed drastically.<br/><br/>“How can they have so many universe knights?”<br/><br/>Sky Dragon Duke opened his eyes wide and growled.<br/><br/>Hong<br/><br/>At this moment, the power released by both sides clashed.<br/><br/>The attacks released by the Dragon Palace and the others quickly destroyed the attacks of the Great Beings from the ancient painting sect and the Sky Dragon Clan.<br/><br/>Moreover, there was still a terrifying energy that attacked from the two forces.<br/><br/>“What!”<br/><br/>Seeing that their attacks were instantly destroyed, the expressions of the universe knights level 3 Great Beings from the Sky Dragon Clan’s ancient painting sect changed slightly.<br/><br/>Their collision was actually suppressed.<br/><br/>And the number of universe knights on the other side far exceeded their imaginations.<br/><br/>“Heavenly Dragon, Dragon Wings!”<br/><br/>Heavenly Dragon Duke’s expression was gloomy as he flapped his huge dragon wings.<br/><br/>The metal laws condensed into Dragon Wings and met the attack of the Dragon Palace great being.<br/><br/>The other universe Knight Level 3 great beings on the side also attacked.<br/><br/>Hong<br/><br/>With another boom, the attack of Dragon Palace was blocked.<br/><br/>“What’s going on? Why are there so many universe knights in Dragon Palace?”<br/><br/>The leader of the ancient art school saw this scene and his heart sank. He couldn’t help but growl.<br/><br/>Three years ago, Dragon Palace had revealed all its power.<br/><br/>At that time, they only had about 40 universe knights.<br/><br/>However, three years had passed, and their number of knights had doubled.<br/><br/>“Their Dragon Palace must have obtained a powerful godly dragon inheritance.”<br/><br/>At this time, the level 3 universe Knight of the Sky Dragon Race widened his eyes and roared.<br/><br/>The number of pure-bred Godly Dragons had doubled in three years.<br/><br/>There was only one explanation, they had obtained a very powerful godly dragon inheritance.\t\t\t\t\t\t</div>", "images": {}, "success": true}