{"id": 201, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15072303.html", "title": "Chapter 3192 - Chapter 3192: Under The Invincible Defense Of 3191", "volume": 3, "volume_title": "Volume 3", "body": "<h1>Chapter 3192 - Chapter 3192: Under The Invincible Defense Of 3191</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 3192: Under the invincible defense of 3191<br/><br/>“Kill!”<br/><br/>All the disciples of the ancient painting sect were filled with excitement and killing intent when they heard their master’s order.<br/><br/>The Dragon Palace was no match for them.<br/><br/>The disciples of the Dragon Palace escaped to their Dragon Palace.<br/><br/>The victory of this battle belonged to them.<br/><br/>“Break!”<br/><br/>“Falling Stars!”<br/><br/>The Grand Supreme Elder of the ancient painting sect moved and floated in the sky above the Dragon Palace!<br/><br/>He raised both his hands and the ancient painting floated in the sky. Countless stars appeared on it.<br/><br/>The stars in the sky directly smashed toward the Dragon Palace.<br/><br/>“Mountain and river suppression, Break!”<br/><br/>The sect master of the ancient painting sect also had a cold expression on his face. A mountain and river appeared and directly pressed toward the Dragon Palace.<br/><br/>“Break!”<br/><br/>“Break through the Dragon Palace and destroy all of them.”<br/><br/>The other venerables of the ancient painting sect immediately released a terrifying attack.<br/><br/>Vast and mighty energy covered the Dragon Palace.<br/><br/>In the Dragon Palace, Prime Minister Gui and the others looked outside as if it was the end of the world. Their expressions did not change in the slightest.<br/><br/>“Damn it, I’ve really suffered a great loss this time. I’ve lost a lot of energy in my body.”<br/><br/>On the side, Ba Qi looked at his arm that was slowly recovering and growled in a low voice with an extremely embarrassed expression.<br/><br/>“When the Dragon King comes and the willow deity returns, we’ll kill all of them. We won’t let any of them off.”<br/><br/>Prime Minister Gui growled with a sullen face.<br/><br/>“Boom! Boom! Boom!”<br/><br/>As they spoke, the terrifying stars had already landed above the Dragon Palace.<br/><br/>The mountains and rivers that were even larger than the Dragon Palace had also landed.<br/><br/>A huge explosion came from outside. However, when their attack landed above the Dragon Palace, the Dragon Palace did not move at all and was not damaged at all.<br/><br/>“What?”<br/><br/>“What?”<br/><br/>Seeing that their attack didn’t break the Dragon Palace, the Master of the ancient painting sect changed his expression and his smile slowly disappeared.<br/><br/>“The defense of this dragon palace is quite terrifying. Their Dragon Palace must have inherited the powerful divine dragon’s Dragon Palace.”<br/><br/>Heavenly Dragon Duke looked over and said with a frown.<br/><br/>“Powerful? How powerful can it be? I don’t believe that the defense of their dragon palace is comparable to that of the Sky Sea Dragon Palace.”<br/><br/>The leader of the ancient painting sect said with a solemn face.<br/><br/>“Attack together and break this Dragon Palace!”<br/><br/>Sky Dragon Duke’s eyes gleamed and he roared in a low voice.<br/><br/>“Yes!”<br/><br/>The Universe Knights of the Sky Dragon race nodded.<br/><br/>“Roar!”<br/><br/>They roared in unison and flapped their huge wings.<br/><br/>Soon, a huge wind blade formed in the sky.<br/><br/>There were also countless dragon claws made of metal.<br/><br/>“Together!”<br/><br/>The 50 universe knights from the ancient art school shook and started to gather energy.<br/><br/>A vast energy that could easily destroy stars gathered in the sky above Dragon Palace.<br/><br/>“Attack!”<br/><br/>Heavenly Dragon Duke ordered and the 150 universe knights attacked Dragon Palace.<br/><br/>“Hong Hong Hong!”<br/><br/>A terrifying explosion sounded, and countless law energies flew towards the Dragon Palace, as if it was going to destroy the world.<br/><br/>“Peng Peng Peng!”<br/><br/>However, even when this world-destroying energy landed on the Dragon Palace, it still couldn’t leave any traces.<br/><br/>It didn’t move!<br/><br/>“This…”<br/><br/>Seeing that the Dragon Palace wasn’t damaged at all, at this moment, all the Universe Knights revealed embarrassed expressions.<br/><br/>Their combined attack, and it was an all-out attack, actually couldn’t break through the defense of the Dragon Palace.<br/><br/>The entire Dragon Palace didn’t even tremble, this made them feel unbelievable.<br/><br/>“Let’s attack from another place!”<br/><br/>The Knights of the Sky Dragon Clan had a bad feeling.<br/><br/>The Sky Dragon King scanned his surroundings, his body moved and immediately flew towards the back of the Dragon Palace.<br/><br/>“Whoosh! Whoosh! Whoosh!”<br/><br/>All the venerables of the ancient painting sect and the Heavenly Dragon Clan immediately followed behind.<br/><br/>“Boom! Boom! Boom!”<br/><br/>“Boom! Boom! Boom!”<br/><br/>Soon, terrifying attacks fell toward the Dragon Palace. They even unleashed their law forms to bombard it.<br/><br/>The Dragon Palace, which had a circumference of tens of millions of kilometers, attacked from all directions under their attacks.<br/><br/>However, the continuous attacks on the Dragon Palace didn’t have the slightest fluctuation.<br/><br/>Later, the venerables of the two forces condensed their attacks into one point and attacked continuously.<br/><br/>The entire Dragon Palace still didn’t have the slightest trace.<br/><br/>“Damn it, all the disciples of the ancient painting sect of the Heavenly Dragon Clan, release your attacks!”<br/><br/>The Heavenly Dragon Duke roared with an extremely ugly expression.<br/><br/>Soon, all the disciples of the two forces launched their attacks.<br/><br/>They covered the sky and the Earth, truly covering the sky and the earth.<br/><br/>All the lava around the dragon palace disappeared under their attacks.<br/><br/>The landscape of the entire volcano region changed a little.<br/><br/>Everything was swept by this terrifying energy.<br/><br/>Even the entire underground of the Milky Way was pierced through, revealing the terrifying gray energy below.<br/><br/>After several minutes of continuous bombing, the Dragon Palace still didn’t have the slightest change.<br/><br/>“This Dragon Palace… This Dragon Palace’s defense isn’t weaker than the Sky Sea Dragon Palace’s.”<br/><br/>The sect master of the Ancient Painting sect roared in a low voice with an extremely unsightly expression.<br/><br/>They couldn’t break through this Dragon Palace with an invincible defense.<br/><br/>This made them think of the Sky Sea Dragon Palace.<br/><br/>That Invincible Dragon Palace that was also unbreakable.<br/><br/>When the venerables of the Sky Dragon Clan heard this, their expressions kept changing.<br/><br/>They had all entered the Sky Sea Dragon Palace, and the defense inside and outside was very terrifying.<br/><br/>It was completely not something they could destroy.<br/><br/>The Dragon Palace in front of them was no worse than the Sky Sea Dragon Palace.<br/><br/>This made them look very embarrassed.<br/><br/>Once all the members of the Dragon Palace hid in the Dragon Palace, they couldn’t do anything at all.<br/><br/>“Sect master, what… What should we do?”<br/><br/>A venerable of the ancient painting sect looked at the sect master and asked with a changing expression.<br/><br/>The sect master of the ancient painting sect looked at Duke Tian long and the others and frowned.<br/><br/>“The defense of the Dragon Palace is too strong. We have to think of other ways to break it.”<br/><br/>The Heavenly Dragon mother flapped her wings and looked around coldly.<br/><br/>“What can we do?”<br/><br/>An expert of the Heavenly Dragon Clan couldn’t help but ask. His face was full of helplessness.<br/><br/>The defense of the Dragon Palace was simply invincible.<br/><br/>“Our clan leader might have a way.”<br/><br/>A venerable of the Heavenly Dragon Clan hesitated and said.<br/><br/>“I have a way. It might work. We can seal the Dragon Palace with a formation and absorb all the spiritual Qi in the surroundings.”<br/><br/>“No matter how strong the Dragon Palace is, it needs to absorb the energy of the universe. Without the energy, the Dragon Palace’s defense will be weakened. However, it will take a long time.”<br/><br/>The first Supreme Elder of the ancient painting sect said.<br/><br/>“It’s a method. Seal this place first. When our clan leader comes, we will have a way.”<br/><br/>The Heavenly Dragon Duke and the others nodded confidently.<br/><br/>They were very confident in their clan leader.<br/><br/>Moreover, the clan leader should have completed the heaven pilfering bloodline transformation by now.<br/><br/>The clan leader who had a pure-blooded bloodline would definitely receive a huge upgrade.<br/><br/>When the time came, breaking through the Dragon Palace would be an easy task.\t\t\t\t\t\t</div>", "images": {}, "success": true}