{"id": 206, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15072313.html", "title": "Chapter 3197 - Chapter 3197: 3196", "volume": 3, "volume_title": "Volume 3", "body": "<h1>Chapter 3197 - Chapter 3197: 3196</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 3197: 3196<br/><br/>Name: Wang Xian<br/><br/>Race: Yin-yang Five Elements Divine Dragon (man-dragon unity)<br/><br/>Level: void God Emperor Level 8(eighth form of Divine Dragon Transformation)<br/><br/>Origin: 1% (99% needed for the next breakthrough)<br/><br/>Divine ability: ruling the water tribe (ruling the water tribe below one’s level)<br/><br/>Devouring creatures (devouring creatures to extract origin)<br/><br/>Control of the five elements<br/><br/>Cultivation Method: Divine Dragon Transformation<br/><br/>Supernatural Power: soul capture, spirit attachment<br/><br/>Law supernatural power: Dragon Eye Lock, Five Elements Dragon Claw, Yin and yang breaking realm, eight luminaries dragon scale, Sacred Dragon Shadow, eight Heavenly Dragon Tribes, Dragon Tomb, Cloud Dragon Soaring<br/><br/>Aspect: five elements grinding, Dragon Kingdom in the palm, Dragon Head under the sky, Dragon Body of ten thousand miles, yin and yang poles, yin and Yang Five Elements Alms Bowl, divine dragon swinging tail!<br/><br/>Control Law: metal, wood, water, fire, Earth, light, dark wind<br/><br/>Divine Kingdom: Dragon Palace<br/><br/>Dragon Palace: acquired.<br/><br/>Dragon Palace members: 1134450<br/><br/>“Hu!”<br/><br/>In the Dragon King Palace, Wang Xian sensed the power coming from his body. Looking at his attributes, he revealed a smile.<br/><br/>He had broken through.<br/><br/>After breaking through, he had the combat strength of a Level 4 universe knight.<br/><br/>“I have only used up all the divine herbs I obtained. There are still more than 100 Dragon Bones I obtained from the Dragon Tomb.”<br/><br/>Wang Xian looked at the resources in his hands and smiled.<br/><br/>“Congratulations to the Dragon King for his breakthrough!”<br/><br/>Prime Minister Gui and the leaders of the Dragon Palace flew over and congratulated him respectfully.<br/><br/>“Get all the disciples ready.”<br/><br/>Wang Xian glanced at them and ordered while narrowing his eyes slightly.<br/><br/>“It’s the Dragon King!”<br/><br/>Prime Minister Gui and the rest responded immediately with cold murderous intent in their eyes.<br/><br/>They moved and immediately gave the order.<br/><br/>Soon, the members of the Dragon Palace gathered. They came to the front of the four dragon gates with murderous intent on their faces.<br/><br/>Wang Xian came to the East Dragon Gate. His gaze swept across all the experts from the ancient painting sect and the Heavenly Dragon Clan. His eyes were shining.<br/><br/>“Leave the seven level three Universe Knights to me. The rest are yours. Don’t let any of them escape.”<br/><br/>Wang Xian said in a cold tone.<br/><br/>“It’s the Dragon King!”<br/><br/>The rest of the powerhouses in the Dragon Palace nodded their heads heavily.<br/><br/>Outside, the seven to eight million powerhouses from the ancient painting sect of the Heavenly Dragon Clan were sitting above the Dragon Palace.<br/><br/>The universe knights were either floating or sitting cross-legged in the air.<br/><br/>Powerful formations were spread around the Dragon Palace.<br/><br/>As long as the people from the Dragon Palace appeared, they would definitely be dealt a fatal blow.<br/><br/>“Listen to my orders!”<br/><br/>Wang Xian shouted in a low voice. His voice was transmitted to every member of the Dragon Palace.<br/><br/>“Kill!”<br/><br/>“Leave no one alive!”<br/><br/>As he spoke, he flew out of the Dragon Palace instantly. His gaze was locked onto the three level 3 universe knights of the Heavenly Dragon Clan who were floating in front of him.<br/><br/>Three Heavenly Dragons, two wind and one gold. They were floating in the sky with their eyes closed.<br/><br/>“Cloud and mist dragon soaring!”<br/><br/>The moment he rushed out of the Dragon Palace, he immediately used the law technique he had just obtained.<br/><br/>The moment he used it, the surrounding Cloud and mist appeared and enveloped a radius of over a billion kilometers.<br/><br/>The Cloud and mist enveloped the ancient art sect and the Heavenly Dragon Clan.<br/><br/>When the Clouds and mist appeared, the Heavenly Dragon Clan members of the ancient painting sect were slightly shocked.<br/><br/>“Be careful!”<br/><br/>The sect master of the ancient painting sect immediately warned loudly in the sky.<br/><br/>“Bang, Bang, Bang!”<br/><br/>At this moment, a terrifying attack was heard.<br/><br/>“No, no, no!”<br/><br/>“Who is it?”<br/><br/>Suddenly, a shrill scream and a terrified voice sounded, and a vast energy came from above the east gate of the Dragon Palace.<br/><br/>When everyone heard this voice, they looked over with fear on their faces.<br/><br/>Vaguely, they saw an enormous figure of a divine dragon rolling in the clouds.<br/><br/>They saw the three heavenly dragons of the Heavenly Dragon clan falling toward the ground.<br/><br/>“What!”<br/><br/>“How is this possible!”<br/><br/>The experts of the Heavenly Dragon Clan who were closer saw the figure falling toward the ground, and they were shocked.<br/><br/>“Roar!”<br/><br/>“Kill! Leave No one alive!”<br/><br/>At this moment, a furious roar came from below.<br/><br/>“How dare the Dragon Palace resist! Kill!”<br/><br/>“Kill them all! Leave No one alive!”<br/><br/>The appearance of the clouds made the Masters of the ancient painting sect and the others in the sky above the dragon palace not see what was happening at the east gate.<br/><br/>However, the hearts of the Heavenly Dragon Male and Heavenly Dragon Mother jumped when they heard the scream.<br/><br/>This scream was very familiar to them.<br/><br/>“Roar! Roar! Roar!”<br/><br/>“Dragon Eyes Lock All Corners!”<br/><br/>Just as they were about to go over, a cold voice sounded. Soon after, they saw chains attacking them one by one.<br/><br/>They saw an enormous eight-colored divine dragon attacking them.<br/><br/>“This is?”<br/><br/>The Heavenly Dragon Male and Heavenly Dragon Mother, as well as the sect master of the ancient painting sect, looked over. Their pupils constricted slightly.<br/><br/>“It’s that Dragon King, it’s that Dragon King!”<br/><br/>The sect leader of the ancient painting sect shouted sternly.<br/><br/>“Eight Heavenly Dragons!”<br/><br/>At this moment, Wang Xian let out a low growl and eight godly dragon phantoms flew out from his body.<br/><br/>The godly dragons with eight different attributes intertwined together and attacked them directly.<br/><br/>“Oh no!”<br/><br/>“This dragon palace has the strength of a universe knight at level four.”<br/><br/>Feeling the eight godly dragon phantoms charging at them, the leaders of the ancient painting sect roared in shock and anger.<br/><br/>Without any hesitation, they unleashed their strongest attacks.<br/><br/>Two ancient paintings were placed in front of them, and two Golden Dragon Balls attacked the eight Godly Dragon Phantoms.<br/><br/>Peng! Peng! Peng<br/><br/>The powerful ancient paintings and Golden Dragon Balls collided with the eight Godly Dragon Phantoms.<br/><br/>The ancient painting and the Golden Dragon Pearl flew backward.<br/><br/>“Oh no, we are no match for him. Run, run, all disciples, run!”<br/><br/>Seeing his dragon pearl flying backward, the Heavenly Dragon Duke was shocked.<br/><br/>“Didn’t you say that the Dragon King of the Dragon Palace was killed by the Heavenly Dragon King? How could he appear? How could he be so powerful?”<br/><br/>When the sect master of the ancient painting sect saw that their ancient paintings were sent flying in an instant, a look of shock appeared on his face as he roared loudly.<br/><br/>The expressions of the heavenly dragon father and Heavenly Dragon mother changed.<br/><br/>How did they know that the Dragon King was not dead?<br/><br/>What happened to the Heavenly Dragon King?<br/><br/>“How dare you invade our Dragon Palace? Today, I will make sure that your ancient painting sect and the Heavenly Dragon Clan will never be able to return. Everyone will die.”<br/><br/>Wang Xian stared at them coldly and said coldly.<br/><br/>“Sacred Dragon Shadow!”<br/><br/>He growled and a terrifying divine dragon shadow descended from the sky and swooped down.<br/><br/>Their pupils constricted and their expressions were extremely ugly.<br/><br/>“Defend!”<br/><br/>The ancient painting floated in the sky above them and the two golden dragon pearls exploded with a terrifying might.<br/><br/>They were all terrified as they blocked this terrifying attack.<br/><br/>The ancient painting and the Golden Dragon Balls exploded with all their might.<br/><br/>“Boom!”<br/><br/>The Shadow of the Holy Dragon descended, and the ancient painting and the Golden Dragon Balls trembled violently.<br/><br/>The rivers and mountains on the ancient painting began to crumble, and the Golden Dragon Balls completely dimmed.<br/><br/>This caused a hint of despair to appear in their eyes.\t\t\t\t\t\t</div>", "images": {}, "success": true}