{"id": 208, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15072317.html", "title": "Chapter 3199 - Chapter 3199: 3198 Divine Dragon Crossing The River", "volume": 3, "volume_title": "Volume 3", "body": "<h1>Chapter 3199 - Chapter 3199: 3198 Divine Dragon Crossing The River</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 3199: 3198 divine dragon crossing the river<br/><br/>“Let’s Go!”<br/><br/>In the sky above the Dragon Palace, Wang Xian led the 50 or so universe knights of the Dragon Palace into the teleportation formation.<br/><br/>In the next moment, their figures disappeared from the volcanic region.<br/><br/>This time, Wang Xian did not even check the spoils of war.<br/><br/>The ancient art sect and the Heavenly Dragon Clan had mobilized almost all their forces to attack. They wanted to destroy the Dragon Palace. Now that all the elites of the enemy had been wiped out, they wanted to kill their way over as well.<br/><br/>Firstly, they wanted to completely destroy the two major factions. Secondly, they wanted the treasures of the two major factions in the old dynasty.<br/><br/>Therefore, in order to prevent them from reacting in advance, Wang Xian had to kill them immediately.<br/><br/>Buzz! Buzz! Buzz<br/><br/>Wang Xian and the rest appeared in front of the teleportation formation that led the Dragon Palace to the silver gazing continent.<br/><br/>This time, they were accompanied by the Willow God eight-point Heaven Formation. The peak combat strength of the Dragon Palace followed them.<br/><br/>“Let’s go to the teleportation formation of the Qingzhou Trading Company.”<br/><br/>As Wang Xian spoke, he immediately flew toward the teleportation formation that the Qingzhou Trading Company had opened not far away.<br/><br/>“Eh? Are they members of the Dragon Palace?”<br/><br/>When Wang Xian and the rest flew toward the Dragon Palace, they were extremely astonished.<br/><br/>It only took the dragon palace about ten minutes to counterattack and wipe out the ancient art sect and the Heavenly Dragon Clan.<br/><br/>This caused the news from the other side to not spread out at all.<br/><br/>Wang Xian and the rest were very fast. Very soon, they arrived above the teleportation formation set up by the Qingzhou Trading Company.<br/><br/>There were experts from the Qingzhou trading company guarding this place.<br/><br/>Furthermore, as the ancient painting sect and the Heavenly Dragon Clan had already made their move, they had five universe knights here.<br/><br/>Wang Xian’s gaze swept across everyone in the Qingzhou Trading Company. He narrowed his eyes slightly.<br/><br/>Boom<br/><br/>In the next moment, an extremely terrifying aura charged downwards.<br/><br/>The disciples of the Green Province Trading Company, who were below the level of a supremacy, fell to the ground under this terrifying aura. Blood flowed out of their seven orifices and they died.<br/><br/>The Five Universe Knights felt this vast aura and their expressions changed drastically.<br/><br/>“Who is it?”<br/><br/>They flew out and growled in a low voice with extremely gloomy expressions.<br/><br/>However, before they could put up any resistance, a wicker twined around them. In an instant, it completely bound them and pulled them into the sky.<br/><br/>“Hiss, you… you…”<br/><br/>The five universe knights from the Green Province trading company stared at Wang Xian and the rest in horror. Their expressions changed drastically.<br/><br/>“Soul Catcher!”<br/><br/>Wang Xian waved his arm and cast soul catcher.<br/><br/>Wang Xian did not believe that the Qingzhou Trading Company was not involved in their business.<br/><br/>It was impossible for the Qingzhou Trading Company to build such a huge teleportation formation at such a time.<br/><br/>“Cough cough, cough cough!”<br/><br/>The Level 2 universe knight who was soul catcher widened his eyes in shock.<br/><br/>His pupils dilated slowly.<br/><br/>Some information entered Wang Xian’s mind, causing his eyes to turn cold.<br/><br/>Very soon, he received all the information.<br/><br/>The Qingzhou Trading Company was not directly involved in this matter, but they were indirectly involved as well.<br/><br/>They understood everything.<br/><br/>This teleportation formation was built by the ancient painting sect. However, the condition of gifting it to the Qingzhou trading company was that the Qingzhou Trading Company would cover for them.<br/><br/>The Qingzhou Trading Company did not reject the deal and agreed to it gladly.<br/><br/>From their point of view, the ancient painting sect and the Heavenly Dragon Clan would definitely be able to destroy the Dragon Palace if they joined forces.<br/><br/>Therefore, they cooperated with the two big forces.<br/><br/>“HMPH!”<br/><br/>Wang Xian snorted softly. He waved his arm and a wave of energy swept towards them.<br/><br/>“No, no, no!”<br/><br/>The other four universe knights from the Qingzhou trading company shouted in horror.<br/><br/>“Let’s go to the starry sky of the ancient painting sect.”<br/><br/>Wang Xian said faintly.<br/><br/>There weren’t any fixed names in the starry sky of the ancient painting sect.<br/><br/>Some people called it long hai, while others called it Xing Jiang.<br/><br/>Long Hai was because there were divine dragons and Sky Sea Dragon Palaces.<br/><br/>Xing Jiang was because the strongest force there was the Xing Jiang clan.<br/><br/>A primary race in the universe.<br/><br/>The Xing Jiang clan’s primary race in the universe was the strongest in that starry sky.<br/><br/>There was a huge gap between them and the Heavenly Dragon Clan.<br/><br/>According to rumors, the clan leader of the Starriver clan had the combat strength of a level four universe warrior.<br/><br/>As long as the Starriver clan accumulated more than a billion years, they might be able to advance to an intermediate race in the universe.<br/><br/>“Let’s go.”<br/><br/>After killing the venerable of the Qingzhou Trading Company, Wang Xian flew straight into the teleportation formation below.<br/><br/>About an hour later, they arrived at this piece of starry sky through the teleportation formation.<br/><br/>They appeared on a planet of the Qingzhou Trading Company.<br/><br/>This was a very prosperous planet.<br/><br/>“Eight-limbed demonic fiend, bring the poisonous horned dragon seed to understand the Qingzhou trading company. Collect the information and we will destroy them.”<br/><br/>Wang Xian ordered the Willow Deity, eight-limbed demonic fiend and the rest calmly.<br/><br/>Since the Green Province Trading Company was involved in the plan to destroy their Dragon Palace, they would have to bear the revenge of the Dragon Palace.<br/><br/>“It’s the Dragon King. Leave this to me.”<br/><br/>Ba Qi Mo Sha and the other two nodded their heads heavily. They led one of their universe knight level 1 subordinates and flew towards the front.<br/><br/>“Let’s go to the Heaven Dragon Clan First.”<br/><br/>Wang Xian continued.<br/><br/>The Heaven Dragon tribe lived in an extremely huge ocean. Their lair was forbidden for other races to enter.<br/><br/>Therefore, they had to exterminate the Heaven Dragon tribe first so that their news would not be leaked out in advance.<br/><br/>The Heaven Dragon tribe was located very far away from here. However, the teleportation formation in this starry sky was much more developed than the Milky Way.<br/><br/>They entered the teleportation formation and arrived at the planet closest to the Heaven Dragon Tribe’s lair in half an hour.<br/><br/>Whoosh! Whoosh! Whoosh<br/><br/>Wang Xian and the rest moved and flew towards the Heavenly Dragon tribe at a terrifying speed.<br/><br/>An hour later, towering mountains appeared in their line of sight.<br/><br/>Half of the mountains were in the ocean while the other half was surrounded by clouds and mist. It looked unusually majestic and magnificent.<br/><br/>The entire lair of the Heavenly Dragon tribe was extremely huge.<br/><br/>In this starry sky, the strength of the Heavenly Dragon tribe could be ranked in the top three. The paradise where their lair was located was much better than the ordinary forces.<br/><br/>“Let’s Go!”<br/><br/>Wang Xian immediately flew forward. At the same time, the dragon aura on his body enveloped the surroundings.<br/><br/>With his current level eight divine emperor strength, he was able to rule the inferior dragons and aquatic creatures that were lower in level than him.<br/><br/>As he flew over, all the creatures in the ocean below were trembling. They were crouching in the water and waiting for orders.<br/><br/>There were more than 100 million disciples in the Heavenly Dragon tribe.<br/><br/>They were different from the Dragon Palace. They had risen to power for more than a billion years. After so many years, a large number of sub-dragons had multiplied, causing the number of sub-dragons in the Heavenly Dragon tribe to be huge.<br/><br/>However, today was the day that the heavenly dragon tribe would be exterminated.<br/><br/>“Bring me to the center of Your Heavenly Dragon Tribe.”<br/><br/>Wang Xian sensed the thousands of disciples of the Heavenly Dragon Tribe and ordered in a deep voice.<br/><br/>“It’s the Dragon King!”<br/><br/>They replied respectfully and immediately flew forward.<br/><br/>They flew past numerous huge mountains. Along the way, there were also ninth level celestial thearch and peak ya long who flew out to look at the group of intruders.<br/><br/>However, they were easily killed by the members of the Dragon Palace.\t\t\t\t\t\t</div>", "images": {}, "success": true}