{"id": 204, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15072309.html", "title": "Chapter 3195 - Chapter 3195: 3194 Returned", "volume": 3, "volume_title": "Volume 3", "body": "<h1>Chapter 3195 - Chapter 3195: 3194 Returned</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 3195: 3194 returned<br/><br/>“Die!”<br/><br/>A cold voice came out of the willow deity’s mouth.<br/><br/>She looked ahead at the huge leg that was attacking them, and her eyes were filled with killing intent.<br/><br/>Her entire arm immediately turned into a branch, and the densely packed willow leaves on it attacked the single leg.<br/><br/>“Pu Pu Pu!”<br/><br/>Countless willow leaves pierced through the huge single leg and drilled into it.<br/><br/>“Ah!”<br/><br/>The one-legged palace lord sensed the terrifying willow leaves and felt the destructive energy coming from the one-legged leg. His expression changed drastically as he roared in pain.<br/><br/>“What! ?”<br/><br/>“Not good!”<br/><br/>The expressions of the surrounding Fey God palace demons changed drastically when they saw this scene.<br/><br/>The bird vulture palace Lord’s pupils constricted as a look of shock appeared on his face.<br/><br/>“Willow Leaf Blossom, die!”<br/><br/>The Willow God growled, and the dragon-scale-like willow leaves flew out from one-legged palace leader’s huge legs. The willow leaves condensed into a godly dragon and rushed toward one-legged palace leader.<br/><br/>“No, no, no!”<br/><br/>The voice of fear and despair came out of one-legged palace leader’s mouth, and he screamed in fear.<br/><br/>He widened his eyes and stared at the Willow God in disbelief and shock.<br/><br/>The underling of the Dragon King of the Dragon Palace actually had the combat strength of a universe Knight Level 4.<br/><br/>If he had known that the other party had such terrifying strength, he definitely wouldn’t have dared to attack.<br/><br/>At such a close distance, and he was still provoking the attack, there was no way for him to dodge.<br/><br/>Peng<br/><br/>Countless willow leaves swept past his body, and he fell heavily to the side, his life force instantly disappearing.<br/><br/>With Willow God’s current combat strength, she was able to kill a universe Knight Level 4.<br/><br/>A Universe Knight Level 3’s provocation was simply courting death.<br/><br/>“Dragon Leaf Rulin, die!”<br/><br/>Willow God growled, and willow leaves swept out in all directions.<br/><br/>“Run, run, she’s a universe Knight Level 4 great being, run!”<br/><br/>Bird Vulture Palace master, who had just rushed into the air, felt that one-legged palace master’s life force was completely gone, and his face revealed a shocked expression as he roared in fear.<br/><br/>They knew a little about the Dragon Palace. Didn’t they say that the Dragon Palace was only a low-level race?<br/><br/>Wasn’t the strongest one a Level 3 universe knight?<br/><br/>How could it be so terrifying?<br/><br/>A Level 4 universe knight wasn’t something they could fight against.<br/><br/>“Run!”<br/><br/>Without Bird Vulture Palace master saying anything, the other great demons saw that one-legged palace master was instantly killed. Their hearts pounded violently, and they fled in fear.<br/><br/>“PFFT! PFFT! PFFT!”<br/><br/>However, at this moment, there were still five great demons who did not manage to dodge the willow deity’s attack.<br/><br/>The terrifying dragon-scaled willow leaves penetrated their bodies.<br/><br/>“Ah! No, don’t Kill Us!”<br/><br/>The Great Demons who were attacked roared in despair.<br/><br/>“Run, run quickly!”<br/><br/>When the great demons and demonic beasts from the surrounding demon god Palace saw this, they fled in all directions in fear.<br/><br/>“You deserve to die!”<br/><br/>Wang Xian said coldly. With a wave of his arm, he collected all the corpses. His body moved and he continued to fly forward.<br/><br/>He didn’t care about the monster God palace at all. What he was worried about now was the current situation of the Dragon Palace.<br/><br/>He flew straight out while the willow deity followed closely behind.<br/><br/>When the surrounding beasts saw this, they were shocked.<br/><br/>“The strength of the Dragon Palace is so terrifying. That woman was actually able to kill one of the palace masters of the Demon God Palace in an instant.”<br/><br/>“Hiss, she’s too strong. However, did the Heavenly Dragon Clan and the ancient painting sect really attack the Dragon Palace?”<br/><br/>Only when Wang Xian and the rest disappeared did the surrounding demonic beasts recover from their shock.<br/><br/>They wiped off the cold sweat on their foreheads and gulped.<br/><br/>The great demons and demonic beasts of the demon god palace heaved a sigh of relief when they saw the Dragon King and the rest of them leaving.<br/><br/>There was still lingering fear in their hearts.<br/><br/>Who would have thought that the dragon palace would have such a terrifying expert.<br/><br/>“I’ll put you in a space first.”<br/><br/>After flying out of the skysea Dragon Palace, Wang Xian looked at the female snake beside him and said.<br/><br/>“It’s the Dragon King!”<br/><br/>The female snake nodded timidly.<br/><br/>Wang Xian waved his arm and looked at the willow deity. “Return to the Dragon Palace directly.”<br/><br/>“Yes!”<br/><br/>The willow deity nodded and her figure gradually turned illusory.<br/><br/>Wang Xian also moved and returned to the Dragon Palace instantly.<br/><br/>“Hahaha, I’ve finally completed my fusion with the Dragon King. Dragon King of the Dragon Palace, I want you to die!”<br/><br/>Just as Wang Xian and the rest disappeared, a violent roar came from the Sky Sea Dragon Palace.<br/><br/>A terrifying pressure came from inside.<br/><br/>“What’s Going On?”<br/><br/>When all the demonic beasts in the Sky Sea Dragon Palace heard this voice and sensed the terrifying pressure contained in the Sky Sea Dragon Palace, their faces revealed a look of fear.<br/><br/>Even the bird vulture palace master’s pupils constricted slightly as fear appeared in his eyes.<br/><br/>He had just escaped the attack of that terrifying expert from the Dragon Palace. What was going on?<br/><br/>How could they be so unlucky?<br/><br/>“All disciples of the Demon God Palace, get out immediately!”<br/><br/>Palatial Lord Bird Vulture had a bad premonition as he roared sternly and immediately flew towards the exit.<br/><br/>The other great demons and disciples of the Demon God Palace also panicked as they flew out.<br/><br/>However, when they arrived in front of the Dragon Gate, they suddenly discovered a terrifying energy that completely sealed the entire Dragon Gate.<br/><br/>“Damn it, the Dragon King actually left. I’m going to kill them.”<br/><br/>“Since you’ve entered my Dragon Palace, don’t go out and submit to me!”<br/><br/>At this moment, another violent voice resounded throughout the entire Sky Sea Dragon Palace. This caused all the demonic beasts in the Sky Sea Dragon Palace to be filled with shock.<br/><br/>This makes all the demon beasts in the Sky Sea Dragon Palace body a tremble, the facial expression is incomparably embarrassed.<br/><br/>Tianhai Dragon Palace, Tianhai Dragon King is not dead!<br/><br/>…<br/><br/>Buzz<br/><br/>“Prime Minister Oogway, what happened?”<br/><br/>The sudden change in the Tianhai Dragon Palace was not known to Wang Xian.<br/><br/>At this moment he has returned to the Dragon Palace, came to the Dragon King Palace, to the prime minister turtle voice said.<br/><br/>“Dragon King.”<br/><br/>Prime Minister Gui was overjoyed when he heard Wang Xian’s voice transmission. He immediately rushed over to the Dragon King Palace.<br/><br/>“What happened?”<br/><br/>Wang Xian scanned his surroundings. He frowned slightly when he saw the situation outside the Dragon Palace. His eyes were flashing with a cold expression.<br/><br/>“Dragon King, after you and Willow deity left, 50 venerables and 400 to 500 disciples from the ancient art sect, as well as 100 venerables and 2 to 3 million disciples from the Heavenly Dragon Clan, came to attack us yesterday.”<br/><br/>“We went out to meet them, but the results were beyond our expectations. A Universe Knight Level 2 devouring Dragon died, and more than 2,000 imperial dragon species were killed. We had no choice but to retreat and defend the Dragon Palace.”<br/><br/>Prime Minister Gui immediately reported.<br/><br/>“Ancient Painting Sect, Sky Dragon Clan?”<br/><br/>Wang Xian’s killing intent was cold. “How many universe knights level 3 have they got?”<br/><br/>“Dragon King, they have seven universe knights at level 3. Although there are only seven of them, they have powerful acquired spiritual treasures.”<br/><br/>“The two powerful ancient paintings from the ancient painting sect and the Golden Dragon Pearl from the Heavenly Dragon Clan have caused Lei Ming and the rest to suffer greatly!”<br/><br/>“Now that you and Willow deity have returned, we can counterattack.”<br/><br/>Prime Minister GUI reported immediately, his eyes full of killing intent.\t\t\t\t\t\t</div>", "images": {}, "success": true}