{"id": 200, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15072301.html", "title": "Chapter 3191 - Chapter 3191: 3190, Invincible Defense", "volume": 2, "volume_title": "Volume 2", "body": "<h1>Chapter 3191 - Chapter 3191: 3190, Invincible Defense</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 3191: 3190, invincible defense<br/><br/>The ancient painting was in the sky, and the Sky Dragon Roared!<br/><br/>When the ancient painting sect unleashed their full strength, the experts of the Dragon Palace were no match for them.<br/><br/>As a powerful primary race of the universe, they had powerful treasures.<br/><br/>Even the members of the Dragon Palace found it difficult to fight two against one, let alone three against four.<br/><br/>Even the sky array collapsed under the attack of the mountains and rivers reflected on the ancient paintings.<br/><br/>Under the powerful attack of the two Golden Dragon Balls, Lei Ming was immediately injured under the attack of the universe knight level 3 beings of the Heavenly Dragon Clan.<br/><br/>In terms of overall strength, the dragon palace was still much weaker than them.<br/><br/>Retreat!<br/><br/>At this time, they could only retreat. Otherwise, everyone from the Dragon Palace would be killed.<br/><br/>“Hiss, as expected of the ancient painting sect and the Heavenly Dragon Clan. Their strength and heritage are too strong. The Dragon Palace is no match for them.”<br/><br/>“After all, they are two powerful forces with deep heritage. The Dragon Palace will be in trouble.”<br/><br/>All the onlookers were shocked when they saw this scene.<br/><br/>The disciples of the Dragon Palace would probably be slaughtered.<br/><br/>“Retreat, Retreat, retreat into the Dragon Palace.”<br/><br/>The disciples of the Dragon Palace quickly retreated after hearing Prime Minister Gui’s order.<br/><br/>“Kill them! Kill them! Chase after them!”<br/><br/>The sect master of the ancient painting sect glanced down and sneered when he saw the sky array struggling to resist the ancient painting.<br/><br/>“You want to fight three or four of us alone? You’re courting death!”<br/><br/>As he spoke, he waved his arm and the mountains and rivers in the ancient painting appeared once again, smashing towards the sky array.<br/><br/>The sky array had a serious expression on his face as he kept retreating.<br/><br/>“Roar! Roar! Roar!”<br/><br/>“Kill! Kill! Kill!”<br/><br/>On the surrounding battlefield, the experts from the ancient painting sect and the Heavenly Dragon tribe saw that the Dragon Palace wanted to retreat and tried their best to kill it.<br/><br/>The Heavenly Dragon Father and the Heavenly Dragon mother waved their arms, and the two Golden Dragon Balls flew towards Lei Ming again.<br/><br/>Lei Ming felt the terrifying power coming from the Dragon Balls, and his expression was ugly.<br/><br/>“Pi Li Pa La!”<br/><br/>He raised his dragon horn, and lightning condensed on it, and he attacked the Dragon Balls in front of him.<br/><br/>“Hahaha, die!”<br/><br/>The level three Godly Dragon Knight who was attacking Lei Ming suddenly turned around and attacked a level two swallowing Dragon Knight.<br/><br/>The swallowing dragon felt the terrifying attack, and his expression changed.<br/><br/>Hong<br/><br/>He swung his huge tail and swept forward.<br/><br/>“Die!”<br/><br/>This heavenly dragon was of the wind element. Looking at the tail of the swallowing dragon, his two huge wings were like sharp blades, and he slashed forward.<br/><br/>“Ao!”<br/><br/>A miserable cry rang out from the mouth of the devouring dragon, as its tail was chopped off.<br/><br/>“Die!”<br/><br/>The Heavenly Dragon Roared, flapping its huge wings as it clawed towards its body.<br/><br/>“Peng!”<br/><br/>Its incomparably sharp claws pierced through the head of the devouring dragon, as a terrifying hurricane enveloped it.<br/><br/>The life force of the devouring dragon quickly disappeared.<br/><br/>“Retreat, quickly retreat!”<br/><br/>Prime Minister Gui’s anxious roar continued.<br/><br/>“Dragon Cannon, Fire!”<br/><br/>At the back, all the members of the Fire Hammer clan immediately opened the Hundred Gate Dragon Palace with all their strength, covering the retreat of the members of the Dragon Palace.<br/><br/>“Defend, Retreat!”<br/><br/>“Dragon Conquers the world!”<br/><br/>All the dragon-controlling dragons roared and set up terrifying defenses at the front.<br/><br/>A huge earth wall stood in front of them.<br/><br/>All the disciples of the Dragon Palace flew toward the Dragon Palace.<br/><br/>Fortunately, the battlefield was very close to the Dragon Palace.<br/><br/>“Explode!”<br/><br/>Ba Qi’s expression changed when he saw this.<br/><br/>He waved his arm and the limbs on his body flew out. The limbs exploded.<br/><br/>The black corrosive and poisonous liquid attacked the Knights of the Ancient Painting Sect’s Sky Dragon Clan.<br/><br/>“Be careful!”<br/><br/>The Knights of the ancient painting sect and Sky Dragon Clan saw the terrifying black liquid and quickly retreated.<br/><br/>“Retreat!”<br/><br/>The Great Beings of the Dragon Palace seized the opportunity and quickly retreated.<br/><br/>Hong<br/><br/>At this moment, a lightning pillar on the terrifying warship broke through the defense of the Imperial Dragon Seed.<br/><br/>In an instant, more than two thousand imperial dragon seeds were destroyed by the Lightning.<br/><br/>“Ancient Painting sect, Heavenly Dragon Clan, we will definitely destroy you!”<br/><br/>The members of the Dragon Palace looked over with blood-red eyes.<br/><br/>They returned to the Dragon Palace angrily and stared at the ancient painting sect and the Heavenly Dragon Clan.<br/><br/>“Haha, this is only the beginning. Today, we will destroy you all!”<br/><br/>The experts from the ancient painting sect looked over and laughed maniacally.<br/><br/>With their strength, they could easily suppress them.<br/><br/>“Sou Sou Sou!”<br/><br/>Below, under the defense of the imperial dragon seed, all the disciples of the Dragon Palace entered the Dragon Palace.<br/><br/>Millions of disciples from the two forces immediately chased after them.<br/><br/>The Knights of the Dragon Palace in the sky also took the opportunity to retreat to the back of the Dragon Gate after eight points self-destructed.<br/><br/>Lei Ming and the other two didn’t dare to fight anymore and quickly flew over.<br/><br/>“Hehehe, do you think it’s safe to escape to Your Dragon Palace? Golden Dragon Pearl, Dragon Horn piercing the sky!”<br/><br/>Heavenly Dragon Duke and the others saw all the members of the Dragon Palace escaping into the Dragon Palace and their eyes were filled with cold killing intent.<br/><br/>He waved his arm, and the Golden Dragon Pearl turned into a pair of dragon horns and attacked the Dragon Palace.<br/><br/>Over 100 Universe Knights of the Heavenly Dragon Clan immediately flew to the front of the Dragon Palace, and their eyes were filled with awe.<br/><br/>Hong Hong<br/><br/>The Golden Dragon Pearl turned into a dragon horn and landed on the Dragon Gate of the Dragon Palace, causing ripples.<br/><br/>The entire Dragon Palace stood still.<br/><br/>“HM?”<br/><br/>“What a powerful defense!”<br/><br/>The Heavenly Dragon Duke was shocked when he saw that his attack didn’t even move when it landed on the Dragon Palace.<br/><br/>“It’s impossible to break through the Dragon Palace!”<br/><br/>In front of the Dragon Gate of the Dragon Palace, Prime Minister Gui and the others looked at the Heavenly Dragon Duke’s attack with cold expressions.<br/><br/>This time, according to their calculations, even if the Dragon Palace wasn’t his opponent, they could still make him lose some.<br/><br/>However, the power of the ancient painting sect and the Heavenly Dragon Clan made them know that there was still a huge gap between them.<br/><br/>The skeleton clan and the other two clans couldn’t compare to the ancient painting sect and the Heavenly Dragon Clan at all.<br/><br/>Their foundation and strength were much stronger than the other three clans.<br/><br/>However, it was impossible for the other party to break through the Dragon Palace.<br/><br/>The current defense of the Dragon Palace could withstand attacks from anyone below the ruler realm.<br/><br/>Anyone below the level of a universe master wouldn’t be able to break through the defense of the Dragon Palace.<br/><br/>They were very safe within the Dragon Palace.<br/><br/>However, they didn’t look too good about the battle just now.<br/><br/>In just a short battle, the Dragon Palace lost a level 2 knight and over 2,000 disciples.<br/><br/>This was a rare loss for the Dragon Palace.<br/><br/>“HMPH, all disciples of the ancient art sect, prepare to destroy Dragon Palace!”<br/><br/>The leader of the ancient art sect looked at Dragon Palace and immediately flew over, shouting.\t\t\t\t\t\t</div>", "images": {}, "success": true}