{"id": 203, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15072307.html", "title": "Chapter 3194 - Chapter 3194: 3193 Was Returning", "volume": 3, "volume_title": "Volume 3", "body": "<h1>Chapter 3194 - Chapter 3194: 3193 Was Returning</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 3194: 3193 was returning<br/><br/>“Eh?”<br/><br/>The expression of the mad lion changed slightly when he saw Wang Xian making a move and the Dragon Claw appearing around the female snake to protect her.<br/><br/>He was still filled with fear towards the Dragon King of the Dragon Palace.<br/><br/>Not long ago, the subordinate beside him had instantly killed a great demon of the Demon God Palace, causing him to be filled with fear.<br/><br/>He gritted his teeth and did not give up.<br/><br/>This time, there were quite a number of them, and their strength was not weaker than that of the Dragon Palace.<br/><br/>Furthermore, due to the unusual movements of the skysea Dragon Palace, they had already informed the other great demons of the palace of demi-gods. Soon, there would be more palace masters coming.<br/><br/>At that time, with their strength, they would not be afraid of the Dragon Palace at all.<br/><br/>“Huh?”<br/><br/>Seeing that the mad lion still dared to continue attacking, Wang Xian raised his eyebrows slightly and his dragon claws trembled slightly.<br/><br/>A terrifying energy charged towards the Mad Lion Demon.<br/><br/>“If you dare to attack again, I will destroy you.”<br/><br/>Wang Xian stared at him and warned him faintly.<br/><br/>Boom<br/><br/>When the Mad Lion Demon saw that his attack was defeated, his expression changed slightly. When he heard his words, his expression turned gloomy instantly.<br/><br/>He glanced at Wang Xian uncertainly and his gaze landed on the female snake.<br/><br/>“Oh no, that female snake has been obtained by the Dragon King of the Dragon Palace.”<br/><br/>When the demonic beasts chasing after them saw that the female snake was on the grayish dragon claw, they looked a little embarrassed.<br/><br/>Once it landed in the hands of the Dragon King, the treasure naturally had nothing to do with them.<br/><br/>Whoosh! Whoosh! Whoosh<br/><br/>“Wild Lion, what’s the situation?”<br/><br/>At this moment, another palace master of the Demon God Palace sensed the situation over here and immediately flew over. His gaze landed on Wang Xian before landing on Wild Lion.<br/><br/>“Palace master bird vulture, that female snake came out from the Dragon King’s palace and seemed to have obtained some treasure. I wanted to attack but was stopped by the Dragon King of the Dragon Palace.”<br/><br/>“He also said that if I dared to attack again, he would destroy me.”<br/><br/>Mad Lion said with a gloomy expression.<br/><br/>He was a great demon of the Demon God Palace after all. Although the strength of the Demon God Palace was weaker than the Heavenly Dragon Clan, it was not weaker than their Dragon Palace.<br/><br/>Now that the Dragon King of the Dragon Palace had given him such a warning, his expression did not look good either.<br/><br/>“Dragon King of the Dragon Palace, you guys really don’t give the Demon God Palace any face!”<br/><br/>Palace master bird vulture looked at Wang Xian and said coldly.<br/><br/>“In the Heaven Sea Dragon Palace, strength speaks for itself.”<br/><br/>Wang Xian said indifferently. With a wave of his arm, the female snake landed beside him.<br/><br/>“Strength? Are you saying that you are stronger than our Demon God Palace? Do you think that our Demon God Palace is afraid of Your Dragon Palace?”<br/><br/>Bird Vulture Palace master said coldly.<br/><br/>When they were outside, they had to enter the Sky Sea Dragon Palace. As he was the only universe knight with level-three combat strength, the Dragon Palace had killed one of their great demons and the Demon God Palace had tolerated it.<br/><br/>However, they had entered the Sky Sea Dragon Palace to fight for treasures. Why would they be afraid of fighting?<br/><br/>Most importantly, the other palace masters of the Demon God Palace were about to arrive.<br/><br/>Therefore, there was no need for the Demon God Palace to be afraid.<br/><br/>“Hehe!”<br/><br/>Wang Xian smiled faintly and looked at the willow deity. “Let’s go out.”<br/><br/>He didn’t argue with the people of the Demon God Palace and prepared to leave.<br/><br/>“Dragon King, hand over the female snake!”<br/><br/>With a wave of his arm, feathers formed from energy appeared in front of Wang Xian and the rest.<br/><br/>“Palace of monsters, don’t Court Death Yourself!”<br/><br/>Wang Xian looked at the feathers that contained terrifying energy in front of him. His eyes were filled with killing intent as he looked at Palace master vulture.<br/><br/>“HMPH, Dragon King of the Dragon Palace, I think you are courting death!”<br/><br/>Before Palace master vulture could reply, a voice came from not far away.<br/><br/>The other two palatial lords of the Demon God Palace flew over.<br/><br/>Around him, there were seven or eight great demons following him.<br/><br/>“Oh? is the Demon God Palace going to have a conflict with the Dragon Palace?”<br/><br/>“Not good. Let’s retreat quickly so that we won’t be affected.”<br/><br/>“It seems that it’s because of that female snake. A Demon Beast saw her coming out of the Dragon King Palace and obtained a treasure.”<br/><br/>The surrounding demonic beasts sensed the situation here. When they saw the experts of the Demon God Palace and the Dragon King of the Dragon Palace, they revealed fearful expressions.<br/><br/>They quickly hid far away.<br/><br/>“Hehe, interesting. It seems that they don’t want us to leave.”<br/><br/>Wang Xian looked around and revealed a smile.<br/><br/>He really didn’t care about the great demons of the Demon God Palace.<br/><br/>If they dared to make a move, he didn’t mind killing them.<br/><br/>“Leave the female snake behind and we will not pursue the matter of you killing the great demons of our monster God Palace. If you don’t know what’s good for you, our monster God Palace will not be so easy to bully.”<br/><br/>“You have to speak up for the death of the great demons of our monster God Palace!”<br/><br/>Palace master bird vulture took a few steps forward slowly and a huge wing appeared on his back.<br/><br/>“Looks like you guys are courting death.”<br/><br/>Wang Xian glanced at them and narrowed his eyes slightly.<br/><br/>“Hahaha, we are courting death? Dragon King of the Dragon Palace, you are too arrogant. Your Dragon Palace has already been destroyed, yet you still dare to be arrogant in our demon God Palace!”<br/><br/>Just as he finished his sentence, a maniacal laughter was heard from the front.<br/><br/>Two extremely tall giants that were ten meters tall flew over.<br/><br/>They only had one leg, but that leg was six to seven meters thick.<br/><br/>The entire leg took up three-quarters of the body. It looked very strange.<br/><br/>One-legged demon beasts, the strongest demon beast race in the Demon God Palace.<br/><br/>Two one-legged great demons flew over. The Demon Beast on the right was emitting a terrifying aura.<br/><br/>Its huge one-legged leg was extremely heavy and covered with a thick layer of armor.<br/><br/>Wang Xian was slightly stunned when he heard his words. He frowned and a cold look appeared in his eyes.<br/><br/>“Destroy Our Dragon Palace? Who Dares?”<br/><br/>He said coldly.<br/><br/>“Haha, who Dares? The ancient painting sect and the Heavenly Dragon Clan have already attacked Your Dragon Palace. I reckon that your Dragon Palace has already been destroyed!”<br/><br/>“No Wonder Your Dragon Palace was destroyed. Dragon King, you are too arrogant. You deserve to be destroyed!”<br/><br/>“You have offended the ancient painting sect and the Heavenly Dragon Clan. Now, you still dare to Offend Our Demon God Palace. You are courting death!”<br/><br/>The one-legged palace master said mockingly as he looked at them with disdain.<br/><br/>“Ancient Painting sect, Heavenly Dragon Clan!”<br/><br/>Wang Xian’s expression changed slightly when he heard his words.<br/><br/>The ancient painting sect had a grudge against them, so there was a high possibility that they would seek revenge.<br/><br/>Furthermore, not long ago, the Heavenly Dragon King had plotted against his bloodline and wanted to carry out the heaven pilfering bloodline exchange.<br/><br/>If it was this one-legged demon, it was really possible.<br/><br/>“You’re courting death!”<br/><br/>A strong killing intent flashed across Wang Xian’s eyes. With a wave of his arm, he brought along the female snake and flew towards the exit.<br/><br/>“You want to leave? You’ve offended our demon God Palace, and you want to leave this place. Have you asked us?”<br/><br/>When the one-legged palace master saw Wang Xian and the rest flying towards them, his eyes were filled with coldness.<br/><br/>“Heaven trampling!”<br/><br/>The one-legged palace master’s body suddenly enlarged by a hundred times. His terrifying one-legged body stomped towards Wang Xian and the rest.<br/><br/>“Attack! Let this arrogant fellow know how powerful our demon God Palace is!”<br/><br/>Around them, the bird vulture palace master shouted coldly. His body also moved immediately.<br/><br/>“Die!”<br/><br/>Willow deity Venerable’s eyes revealed killing intent.\t\t\t\t\t\t</div>", "images": {}, "success": true}