{"id": 205, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15072311.html", "title": "Chapter 3196 - Chapter 3196: 3195 Breakthrough, Kill!", "volume": 3, "volume_title": "Volume 3", "body": "<h1>Chapter 3196 - Chapter 3196: 3195 Breakthrough, Kill!</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 3196: 3195 breakthrough, Kill!<br/><br/>“150 universe knights.”<br/><br/>Hovering above the Dragon Palace, Wang Xian scanned his surroundings.<br/><br/>His eyes were filled with awe.<br/><br/>One Level 2 universe Knight of the Dragon Palace died, and more than 2,000 imperial dragon species died.<br/><br/>This was not a small loss for the Dragon Palace.<br/><br/>“It seems that the ancient art sect and the Heavenly Dragon Clan have planned a lot over the past three years. They spent three years planning the matters of the Sky Sea Dragon Palace. In three years, they planned this invasion.”<br/><br/>Wang Xian mumbled.<br/><br/>The teleportation formation connecting the Milky Way to the ancient painting and the opening of the Heavenly Sea Dragon Palace were all premeditated.<br/><br/>If not for the existence of the ancestral tree and the improvement of the Dragon Palace, the blow this time would have been fatal to the Dragon Palace.<br/><br/>“Dragon King, are we prepared to fight back? With your arrival and the willow deity, we are more than enough to kill them!”<br/><br/>In the Dragon King Palace, the leaders of the Dragon Palace flew over and spoke with murderous intent.<br/><br/>“They are still setting up a formation around our Dragon Palace. It seems that they are preparing to break through our Dragon Palace.”<br/><br/>Wang Xian scanned the millions of troops around the Dragon Palace and watched the strong ones setting up the formation. His eyes sparkled.<br/><br/>As he spoke, he looked at the leaders of the dragon palace and said, “Get all the members of the Dragon Palace to prepare for battle. I will improve first.”<br/><br/>As Wang Xian spoke, he landed in the middle of the Dragon King Palace and transformed into his divine dragon form.<br/><br/>“The Dragon King wants to capture them all in one go!”<br/><br/>Seeing the Dragon King taking out his resources one by one, the eyes of the leaders of the Dragon Palace lit up.<br/><br/>“The ancient painting sect and the Heavenly Dragon tribe are very strong. Although they only have seven level 3 universe knights, their combat strength can not be measured by normal standards. Be it the ancient paintings or the dragon balls, they are all abnormally terrifying.”<br/><br/>“If we make a move now, even though we can defeat them, at least half of them will be able to escape. However, once the Dragon King breaks through, it will be completely different.”<br/><br/>The sky array said, its eyes shining.<br/><br/>As long as the Dragon King could break through, then with the Dragon King’s strength, he would be able to quickly destroy the ancient painting sect and the Heavenly Dragon Clan’s universe knights at Level 3.<br/><br/>The other knights, with the Willow God and them, could also be easily killed.<br/><br/>Only then could they capture the other party in one fell swoop.<br/><br/>“This time, we have obtained enough resources to allow the Dragon King to make a breakthrough!”<br/><br/>The Willow God stood at the side and said with a smile.<br/><br/>“I hope they don’t leave during this time!”<br/><br/>Prime Minister Gui narrowed his eyes and said coldly.<br/><br/>“How’s the Array Formation?”<br/><br/>At the same time, outside the Dragon Palace, Heavenly Dragon Duke glanced around and asked the sect master of the ancient painting sect.<br/><br/>“This array formation is the heaven and Earth Array Formation that we spent a lot of money to get. It will be completed very soon. Once it is completed, the array formation will suck out all the spiritual energy within a 100 million kilometer radius.”<br/><br/>“At that time, this place will become a dead zone. What is the situation on your side, Sky Dragon King?”<br/><br/>The sect master of the ancient painting sect said calmly with a hint of confidence on his face.<br/><br/>“By this time, our Sky Dragon King should have succeeded. I don’t know if you have received a message, but there has been a huge change in the Sky Sea Dragon Palace.”<br/><br/>The Sky Dragon Duke narrowed his eyes slightly, and his face was also filled with confidence.<br/><br/>He had just received news that there had been a huge change in the Sky Sea Dragon Palace.<br/><br/>Thinking back to the instructions the Heavenly Dragon King had given them, he was a little excited.<br/><br/>The Heavenly Dragon King had said that after he succeeded in changing the bloodline of the Heaven Stealing Divine Dragon, he might inherit the Sky Sea Dragon Palace.<br/><br/>Once the Heavenly Dragon King inherited the Sky Sea Dragon Palace, the Heavenly Dragon Clan would belong to the pure-blooded Divine Dragon Bloodline.<br/><br/>They would be qualified to compete with the other divine dragon clans and have the chance to step onto the top of the universe.<br/><br/>Not long after, when the Sky Dragon King arrived, he would be able to easily break through the Dragon Palace. At that time, he would also be able to become a purebred divine dragon through the sky stealing bloodline exchange.<br/><br/>When he thought of this, he was extremely excited.<br/><br/>“Oh?”<br/><br/>The sect master of the ancient painting sect was slightly stunned when he heard the words of the Sky Dragon Duke. “Sky Sea Dragon Palace?”<br/><br/>A bright light flashed in his eyes, and a shocked expression appeared on his face. “Could it be…”<br/><br/>“Hehe!”<br/><br/>The Sky Dragon Duke smiled, and the corners of his mouth curled up slightly.<br/><br/>“Congratulations, Congratulations to the Sky Dragon Clan!”<br/><br/>The Master of the ancient painting sect was extremely shocked, and he quickly cupped his hands to congratulate.<br/><br/>Sky Sea Dragon Palace!<br/><br/>He knew the Sky Dragon clan very well. The rise of the Sky Dragon clan was because of the Sky Sea Dragon Palace.<br/><br/>Back then, the Heaven Dragon King had obtained an opportunity in the Heaven Sea Dragon Palace and established the powerful Heaven Dragon Clan.<br/><br/>If the Heaven Dragon King could obtain all the inheritances of the Heaven Sea Dragon Palace, the Heaven Sea Dragon Clan would be able to rise to the level of a mid-level race in the universe.<br/><br/>Putting everything else aside, the Heaven Dragon Clan would have an 80% chance of rising to the level of a mid-level race in the universe in the future.<br/><br/>“Dragon Palace, Hehe!”<br/><br/>He looked down, his eyes flashing with cold killing intent.<br/><br/>“Have you heard? The ancient painting sect and the Heavenly Dragon Clan have fought their way to the Dragon Palace. Now that the Dragon Palace has been defeated, they’ve retreated to the Dragon Palace and don’t dare to come out!”<br/><br/>“The Heavenly Dragon Clan and the ancient painting sect have a total of 150 universe knights. It’s too terrifying. Although the Dragon Palace has also sent out close to 100 universe knights, they’re still not their match.”<br/><br/>“The Dragon Palace has been defeated. I’m afraid it will be dangerous next.”<br/><br/>“The two major forces, and the Heavenly Dragon Clan of the Divine Dragon Clan. and the experts of the Heavenly Dragon Clan said that the Dragon King of the Dragon Palace has been killed by the Heavenly Dragon King.”<br/><br/>At this moment, the Milky Way was once again in an uproar.<br/><br/>The ancient painting sect, the Heavenly Dragon Clan, had attacked the Dragon Palace. The news of the Dragon Palace’s defeat was spread out, and it shocked everyone.<br/><br/>Although the strength displayed by the Dragon Palace had shocked everyone, the strength of the two forces had shocked all the experts in the Milky Way.<br/><br/>Now that the Dragon Palace didn’t dare to come out, it was suspected that the Dragon King of the Dragon Palace had been killed by the Heavenly Dragon King.<br/><br/>The situation of the Dragon Palace was very dangerous.<br/><br/>The experts of the other races in the Milky Way rushed over.<br/><br/>The arrival of the Dragon Palace had already caused several terrifying wars in the Milky Way.<br/><br/>It also made the various races in the Milky Way feel their insignificance.<br/><br/>Just as the ancient painting sect and the Heavenly Dragon Clan were preparing to set up a formation to trap the Dragon Palace to death, everyone in the Milky Way was engaged in a heated discussion.<br/><br/>In the Dragon Palace, a large amount of divine herbs entered Wang Xian’s stomach and rapidly transformed into dragon energy.<br/><br/>This time, according to Wang Xian’s estimation, just obtaining the divine herbs from the skysea Dragon Palace would allow him to achieve a breakthrough in his strength.<br/><br/>Time ticked by. Ten hours later, the system’s voice was heard.<br/><br/>“Ding, congratulations to host for raising your level to the eighth level void God Emperor!”<br/><br/>“Ding, Congratulations to host for comprehending the law divine ability: Soaring Cloud Dragon.”<br/><br/>“Ka Ka Ka!”<br/><br/>At this moment, Wang Xian opened his eyes. His pupils were emitting a bright light.<br/><br/>His body expanded to the size of 30,000 meters.<br/><br/>There were clouds and mist flickering on his body. A powerful aura was emitted from the dragon’s body.<br/><br/>He had made a breakthrough!\t\t\t\t\t\t</div>", "images": {}, "success": true}