{"id": 211, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15072323.html", "title": "Chapter 3202 - Chapter 3202: 3201 Xingjiang Clan Leader", "volume": 3, "volume_title": "Volume 3", "body": "<h1>Chapter 3202 - Chapter 3202: 3201 Xingjiang Clan Leader</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 3202: 3201 Xingjiang clan leader<br/><br/>“Kneel down, didn’t you hear what I Said?”<br/><br/>“If you don’t kneel down, die!”<br/><br/>Above the bridge of the ancient painting planet, an octagonal voice spread across the entire starry sky.<br/><br/>Below the bridge of the ancient painting planet, all the disciples of the ancient painting sect revealed looks of shock and confusion.<br/><br/>However, when the attack that covered an area of over a million kilometers descended, and when the screams of countless people rang out.<br/><br/>All the disciples of the ancient art sect were filled with fear.<br/><br/>Their bodies trembled, and they hurriedly knelt on the ground.<br/><br/>“Those who are at least at the third level of the Divine Emperor realm have been sent to the sky to commit suicide. I will give you ten seconds. If you don’t come out within ten seconds, I will continue to slaughter until I destroy everyone on the bridge of the Ancient Art Planet.”<br/><br/>When Ba Qi saw the disciples of the ancient art sect kneeling in the sky, he continued to speak coldly.<br/><br/>“How… how could this be!”<br/><br/>“Experts above the rank three God Emperor realm have all committed suicide!”<br/><br/>Everyone on the bridge of the ancient painting planet trembled. Their eyes were filled with fear.<br/><br/>Especially those void God Emperor realm experts above the rank three god Emperor realm.<br/><br/>Their faces were filled with despair.<br/><br/>They knew that their ancient painting sect had joined forces with the Heavenly Dragon Clan to exterminate the Dragon Palace.<br/><br/>However, they never expected that they would be completely annihilated.<br/><br/>Now, the experts from the Dragon Palace had come over and wanted them to kill themselves. They wanted to completely exterminate their ancient painting sect!<br/><br/>“It’s over. Our ancient painting sect is over. Hahaha, surrender and kill yourself!”<br/><br/>Some void God Emperor realm experts and above flew to the sky and said with a mournful expression.<br/><br/>The experts from the ancient painting sect had been killed. If they did not want everyone to die, they had to commit suicide.<br/><br/>They flew to the sky and slapped their heads.<br/><br/>“TSK TSK TSK, ten seconds have already passed. There are still some who did not come out. Since that’s the case, we will let more people die with us.”<br/><br/>Eight Point’s gaze swept across the area below and directly attacked.<br/><br/>“You bunch of cruel fellows, you bunch of inhumane fellows. Our Ancient Painting sect isn’t afraid of you, we don’t have any cowards.”<br/><br/>At this moment, a young man raised his head and looked upwards, his face filled with anger as he roared with blood-red eyes.<br/><br/>“Since you’re not afraid, then everyone can go to hell!”<br/><br/>Mo Sha said coldly, and with a wave of his arm, he directly attacked the position beside the young man.<br/><br/>In an instant, a dense number of miserable cries sounded.<br/><br/>When the young man saw this, his body trembled intensely.<br/><br/>“Are you not afraid of death? Very well, all of you should die!”<br/><br/>Ba Qi also roared with a face full of killing intent. He was prepared to continue attacking.<br/><br/>“No, no, don’t!”<br/><br/>An old man flew out and hurriedly stopped him.<br/><br/>“Don’t? But that Brat said that your ancient art sect doesn’t have any cowards? Hahaha, Old Thing, go and kill that Brat.”<br/><br/>Ba Qi said coldly.<br/><br/>His words caused that youth’s face to instantly turn extremely pale.<br/><br/>“Alright!”<br/><br/>That elder did not hesitate at all and directly charged towards that youth.<br/><br/>“No, no, no, no!”<br/><br/>The youth’s face revealed a despairing roar.<br/><br/>At this moment, all the experts at the third level of the Divine Emperor Realm and above on the bridge of the ancient painting planet flew out in despair.<br/><br/>“If you start a war, you will have to bear the consequences of losing the war.”<br/><br/>The willow deity looked over and said softly.<br/><br/>“There are quite a number of treasures in the ancient painting sect!”<br/><br/>Wang Xian entered their treasury, and his eyes were sparkling.<br/><br/>He would leave everything outside to the Thunder, eight-headed willow deity and the others. It would be sufficient for him to keep these treasures.<br/><br/>However, just as Wang Xian started to collect the treasures one by one, just as eight-headed willow deity and the others were killing the experts above level three of the celestial thearch of Void from the ancient painting sect, they were located in this starry sky.<br/><br/>The news regarding the Dragon Palace was immediately spread out in this starry sky.<br/><br/>At the same time, a piece of news from the Milky Way was also transmitted over.<br/><br/>“The Celestial Dragon Clan from the ancient painting sect went to the Milky Way to attack the Dragon Palace. They were all killed by the Dragon Palace. Not a single one was spared!”<br/><br/>“The Dragon Palace’s Dragon King led the experts to the Celestial Dragon Clan. Now that the Celestial Dragon Clan has been exterminated, the Celestial Dragon Clan should not be exterminated!”<br/><br/>“Right now, the Dragon Palace’s experts are at the ancient painting sect’s headquarters. The Dragon Palace wants to kill all the void God Emperor rank three and above experts from the ancient painting sect.”<br/><br/>Three pieces of news instantly caused a huge commotion in the starry sky.<br/><br/>The ancient painting sect and the Sky Dragon clan were well-known and powerful factions in the starry sky.<br/><br/>However, now that the two large factions were suddenly exterminated, this was undoubtedly a huge earthquake.<br/><br/>Everyone who saw this news had shocked expressions on their faces as they discussed animatedly.<br/><br/>Especially regarding the strength of the Dragon Palace, they were filled with shock.<br/><br/>The Milky Way Dragon Palace, the power of the divine dragon lineage was actually so strong?<br/><br/>Just as these three news spread, another piece of news caused a huge uproar.<br/><br/>The three universe knights of the Starriver clan were guests at the ancient painting sect and were directly killed by the Dragon King of the Dragon Palace.<br/><br/>When everyone received the news, they immediately became excited.<br/><br/>The Xingjiang clan was the most powerful force in this part of the starry sky.<br/><br/>The Xingjiang clan leader seemed to have the strength of a Level 4 universe knight. Furthermore, the number of universe knights in the entire Xingjiang clan had reached a terrifying 300.<br/><br/>However, the Dragon King of the Dragon Palace actually dared to kill a universe knight of the Xingjiang clan. Was this a provocation?<br/><br/>Especially when the disciples of the Xingjiang clan saw the news, they were furious.<br/><br/>Because of the arrival of the Dragon Palace, huge waves were created in the starry sky of the Xingjiang clan.<br/><br/>At the same time, the news quickly spread to the Xingjiang clan.<br/><br/>A vast river passed through the starry sky. The river was shining with seven-colored lights.<br/><br/>Beside the river, there were towering temples.<br/><br/>“Reporting to third elder, elder San Yuan’s life tablets have been broken, and they have indeed fallen. It was the Dragon King of the Dragon Palace who did it.”<br/><br/>In a temple in the center, an old man reported respectfully.<br/><br/>“Yes, I have reported it to the clan leader. He will come right away.”<br/><br/>Third Elder, who was holding a huge staff, nodded and said with a frown.<br/><br/>Although the Star River clan had many universe knights, the death of every one of them was a big deal.<br/><br/>Especially this time, three universe knights had died.<br/><br/>This was a very big deal for the Star River clan.<br/><br/>The clan leader had to deal with it personally.<br/><br/>Weng<br/><br/>As soon as the third elder finished speaking, a figure appeared in the sky.<br/><br/>Above the figure was a circular scarlet sun. The Scarlet Sun was suspended in the air and contained a terrifying pressure.<br/><br/>“We pay our respects to the clan leader!”<br/><br/>Within the Great Hall, more than ten figures immediately bowed respectfully.<br/><br/>“En, give me all the information!”<br/><br/>The Scarlet Sun emitted a red light that covered the face of the Xingjiang clan’s clan leader as he spoke in a deep voice.<br/><br/>“Yes!”<br/><br/>The old man below immediately handed over a set of information.<br/><br/>The rest of the experts quietly lowered their heads and didn’t speak!\t\t\t\t\t\t</div>", "images": {}, "success": true}