{"id": 213, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15072327.html", "title": "Chapter 3204 - Chapter 3204: 3203 Dragon King Vs Xingjiang Tribe Leader", "volume": 3, "volume_title": "Volume 3", "body": "<h1>Chapter 3204 - Chapter 3204: 3203 Dragon King Vs Xingjiang Tribe Leader</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 3204: 3203 Dragon King vs Xingjiang tribe leader<br/><br/>“Roar! Roar! Roar!”<br/><br/>After Wang Xian stopped Liu Shen and the rest from attacking, he raised his head and let out a dragon roar. Then, he transformed into a dragon body that was more than 30,000 meters long.<br/><br/>An extremely powerful dragon aura swept towards Xingjiang tribe leader.<br/><br/>“Divine Dragon, a pure-bred divine dragon?”<br/><br/>When Xingjiang tribe leader saw Wang Xian’s body size, his gaze froze.<br/><br/>A terrifying aura spread out. The Divine Dragon was glowing with radiance. If not for its strange wings, it would be exactly the same as the legendary divine dragon.<br/><br/>Even so, he could feel a pressure from Wang Xian’s body that came from the peak of his bloodline.<br/><br/>“Dragon Tomb!”<br/><br/>Wang Xian transformed into the body of the Divine Dragon and raised his head. The terrifying power of law in the sky started to revolve and condensed into a dragon tomb. The Dragon Tomb attacked the scarlet sun directly.<br/><br/>“Eh?”<br/><br/>The Xingjiang clan leader’s expression changed slightly when he felt this terrifying attack.<br/><br/>However, the scarlet sun above his head was too big. The opponent’s attack also covered a large area. It was impossible for him to dodge it.<br/><br/>“Fiery explosion!”<br/><br/>He let out a low roar. Columns of fire erupted from the sky above the scarlet sun and attacked the dragon tomb.<br/><br/>“Roar! Roar! Roar!”<br/><br/>At this moment, Wang Xian relied on his terrifying speed to appear directly in front of the Xingjiang clan leader. He waved his dragon claws and clawed at him.<br/><br/>The Xingjiang clan leader was 30,000 feet tall and was also 20,000 to 30,000 meters tall. When he saw Wang Xian coming at him, he made a circle in the air.<br/><br/>“Boom! Boom! Boom!”<br/><br/>A series of explosions of flames were heard as they blasted towards Wang Xian.<br/><br/>“Whoosh!”<br/><br/>However, at this moment, Wang Xian’s figure swayed. He easily dodged the attack and arrived at the position behind him.<br/><br/>The dragon tail attacked him directly.<br/><br/>“Bang!”<br/><br/>With a speed comparable to a level five universe knight, the Xingjiang clan leader did not have the time to react. An immense force landed on his body.<br/><br/>“Bang!”<br/><br/>His entire body was sent flying into the void.<br/><br/>A large amount of fiery lava flowed from the scarlet sun above his head and landed on his body. It quickly healed his injuries.<br/><br/>“That’s it? Xingjiang clan leader?”<br/><br/>Wang Xian growled and charged forward again.<br/><br/>The Xingjiang clan leader’s expression changed drastically when he sensed Wang Xian’s terrifying attack power.<br/><br/>“No Wonder Your Dragon Palace was able to destroy the ancient painting sect and the Heavenly Dragon Clan. It turns out that your dragon king has such strength.”<br/><br/>“However, it’s impossible for you to defeat me!”<br/><br/>The Xingjiang clan leader roared and raised his head with his mouth wide open.<br/><br/>“Buzz!”<br/><br/>The Scarlet Sun in the sky slowly shrank and flew toward his mouth.<br/><br/>“Boom!”<br/><br/>When the scarlet sun completely entered his body, his body erupted with extremely terrifying flames.<br/><br/>The Flames directly burned an area of hundreds of millions of kilometers around him.<br/><br/>Anyone who stepped into his area would be attacked by the flames without any difference.<br/><br/>“HMPH, let’s try it then. The Clouds and mist are like Dragons!”<br/><br/>Wang Xian’s eyes revealed a cold expression. His body trembled and the entire void was instantly enveloped by the Clouds and mist.<br/><br/>“Huh?”<br/><br/>The expression of the Xingjiang clan leader who was enveloped changed slightly when he saw that his vision was obstructed.<br/><br/>“Bang!”<br/><br/>“Oh no!”<br/><br/>At this moment, he felt a terrifying sense of danger coming from behind him.<br/><br/>This caused his expression to change slightly as he waved his hand to sweep backwards.<br/><br/>His entire arm was filled with incomparably dense law energy.<br/><br/>“Bang!”<br/><br/>However, his speed was still much slower. The Dragon Claw landed on his shoulder, tearing open a huge wound.<br/><br/>“Law projection, Rocket!”<br/><br/>The Xing Jiang clan leader’s expression changed slightly as he raised both his hands. Streams of flames condensed into arrows as they shot out in all directions.<br/><br/>“Boom! Boom! Boom!”<br/><br/>The bombardment came from all directions without any blind spots. When he sensed that there was a resistance coming from somewhere, his body moved.<br/><br/>“Sun Fist!”<br/><br/>“Boom! Boom! Boom!”<br/><br/>He waved his huge fist. Streams of terrifying sun-like flaming fists attacked Wang Xian.<br/><br/>“Buzz!”<br/><br/>Wang Xian’s figure flickered. He flapped his huge uninitiated holy wings and dodged the attacks rapidly.<br/><br/>“Heavenly Dragon Eight Tribes!”<br/><br/>“Attack!”<br/><br/>He let out a low roar and eight Divine Dragon Phantoms appeared in all directions. They attacked the Xingjiang tribe leader directly.<br/><br/>“I’m not his match!”<br/><br/>Sensing the attacks from all directions, the Xingjiang tribe leader’s expression changed slightly.<br/><br/>When he was fighting with the Dragon King, it was difficult for his attacks to hit the other party. However, he could not dodge the other party’s attacks.<br/><br/>If he continued to fight, he would lose miserably.<br/><br/>His expression changed, and the shadow of a great sun slowly wrapped around him.<br/><br/>“Boom Boom Boom!”<br/><br/>The Shadow of eight Divine Dragons landed on the shadow of the Great Sun and let out a terrifying collision.<br/><br/>The shadow of the great sun slowly began to collapse.<br/><br/>This caused the face of the Xingjiang clan leader to change again.<br/><br/>“Bang Bang Bang!”<br/><br/>Right at this moment, he felt the terrifying dragon claws clawing at him.<br/><br/>PFFT! PFFT! PFFT! PFFT<br/><br/>The Dragon Claw landed on his body, causing a large amount of blood to flow out from his body. The destructive force landed on his body, causing his expression to change drastically.<br/><br/>The Xingjiang clan leader gritted his teeth and flew straight towards the void in front of him.<br/><br/>He was no match for the Dragon King. He wanted to escape.<br/><br/>“You want to escape?”<br/><br/>Wang Xian sensed that he wanted to escape and a cold look appeared in his eyes.<br/><br/>However, at this moment, the Xingjiang clan leader suddenly opened his mouth and spat out a red sun that was filled with blood.<br/><br/>His body moved and entered the red sun directly.<br/><br/>The gigantic red sun left a trail and flew directly into the void.<br/><br/>“Huh?”<br/><br/>At the side, the willow deity did not hesitate and attacked the Red Sun with a bunch of thorns.<br/><br/>However, when the Willows and thorns touched scarlet sun, they immediately withered.<br/><br/>Wang Xian looked at his fleeing figure and raised his eyebrows slightly.<br/><br/>However, he did not continue to pursue him.<br/><br/>The clan leader of a powerful faction must have some tricks up his sleeves.<br/><br/>For example, Scarlet Sun was an extremely terrifying numinous treasure.<br/><br/>Even if Wang Xian went all out, it would be difficult to kill him.<br/><br/>At this moment, he also understood that the enemies he would encounter in the future would become stronger and stronger. The enemies he would encounter might also possess the ability to fight against opponents of a higher level.<br/><br/>“If he escaped, so be it.”<br/><br/>He mumbled.<br/><br/>Ever since the start of the battle, he had no intention of keeping the other party alive.<br/><br/>“This… this Xingjiang clan leader actually escaped after being heavily injured. That Dragon King’s strength is so terrifying!”<br/><br/>“Hiss, that Dragon King’s strength is so strong that even venerable Muyang is not his match. Then, who else in our Xingjiang galaxy is his match?”<br/><br/>“It’s over, our ancient art sect is completely finished.”<br/><br/>On the bridge of the ancient art planet, all the disciples of the ancient art sect saw this scene and their faces were filled with despair.<br/><br/>Even the strongest person in the starry sky of their galaxy was no match for the Dragon King, and their ancient art sect would never be able to turn the tables.<br/><br/>After today, their ancient art sect would probably become history.<br/><br/>Their last hope had been extinguished, and their faces were filled with despair.<br/><br/>“Dragon King, this Xingjiang clan’s patriarch is not weak, especially the spiritual treasure in his hands.”<br/><br/>Venerable Willow God flew over to Wang Xian and said.<br/><br/>“Yes, he is very strong, and the spiritual treasure is also very strong. We don’t need to bother about the Xingjiang clan. The ancient painting sect’s treasures have already been collected. We just need to wait for the Heaven Array to arrive and find the ancient painting sect’s Cosmos God Country.”<br/><br/>Wang Xian said indifferently.\t\t\t\t\t\t</div>", "images": {}, "success": true}