{"id": 210, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15072321.html", "title": "Chapter 3201 - Chapter 3201: 3,200 Stars Shook The Starry Sky", "volume": 3, "volume_title": "Volume 3", "body": "<h1>Chapter 3201 - Chapter 3201: 3,200 Stars Shook The Starry Sky</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 3201: 3,200 stars shook the starry sky<br/><br/>“Whoosh! Whoosh! Whoosh!”<br/><br/>Star ink map galaxy.<br/><br/>The star ink map galaxy was what the ancient painting sect called their territory.<br/><br/>More than 10,000 stars gathered, and each star was emitting a luster.<br/><br/>From Afar, it looked like an extremely beautiful starry sky.<br/><br/>The ancient painting sect was different from the Heavenly Dragon Clan.<br/><br/>The Heavenly Dragon Clan’s territory only had that sea. They didn’t have their own planet, nor did they have their own people.<br/><br/>The ancient painting sect was different. They were a human race, and the human race was one of the largest races in the universe.<br/><br/>The ancient painting sect had trillions of people and a deep foundation.<br/><br/>Their experts grew stronger and stronger from generation to generation.<br/><br/>But unfortunately, they provoked the Dragon Palace.<br/><br/>The current star ink map galaxy hadn’t received any news that their experts had been destroyed.<br/><br/>Even the ordinary disciples did not know that their ancient art sect was heading to the distant Milky Way to annihilate the dragon palace.<br/><br/>“It’s really a bright starry sky.”<br/><br/>Wang Xian and the rest flew in the galaxy of the star ink map. Looking at the bright starry sky in front of them, they said faintly.<br/><br/>“Their ancient art sect has already formed a powerful inheritance. Generation after generation, unless all their citizens are annihilated, it will be difficult to completely destroy them.”<br/><br/>“However, this is a devastating blow to the ancient painting sect. Almost all the universe knights have been destroyed.”<br/><br/>The willow deity said faintly from the side.<br/><br/>“The headquarters of the ancient painting sect is on the bridge of the ancient painting planet. Come, let’s go.”<br/><br/>As Wang Xian spoke, his gaze landed on the center of the galaxy.<br/><br/>The bridge of the ancient painting planet was a huge bridge connecting more than ten planets and more than ten mountain ranges of the ancient painting sect.<br/><br/>This was the headquarters of the ancient painting sect, and it was also the most prosperous place of the ancient painting sect.<br/><br/>The Holy Land of the ancient painting sect.<br/><br/>Wang Xian and the rest were moving very fast. Half an hour later, the Magnificent Bridge of the ancient painting planet appeared in their line of sight.<br/><br/>“Seal off the surroundings.”<br/><br/>Wang Xian’s gaze swept across the Holy Land where the mountains connected to the planet and said.<br/><br/>“It’s the Dragon King!”<br/><br/>The Forty Universe Knights of the Dragon Palace moved and immediately came to the left and right of the Ancient Painting Planet Bridge.<br/><br/>They stood in the void and a terrifying aura surged out from their bodies.<br/><br/>Boom! Boom! Boom<br/><br/>In the next moment, waves of dragon might crushed toward the ancient painting planet bridge.<br/><br/>“HMM? who dares to behave atrociously in our ancient painting sect?”<br/><br/>When waves of power swept over, five to six old men flew out from the center of the bridge on the ancient art planet.<br/><br/>Their eyes were filled with a terrifying killing intent.<br/><br/>Behind the five to six old men were a few hundred young and middle-aged men.<br/><br/>Their eyes swept toward Wang Xian and the rest, and their faces sank.<br/><br/>Swoosh<br/><br/>Wang Xian moved and arrived around the group at a terrifying speed.<br/><br/>Numerous chains sealed the surroundings.<br/><br/>“Huh?”<br/><br/>The pupils of the few people from the ancient art sect shrunk slightly when they saw this scene.<br/><br/>“Who are you?”<br/><br/>The old man in the middle stared at Wang Xian with a sullen face. His expression changed.<br/><br/>“Hehe, Dragon King of the Dragon Palace!”<br/><br/>Wang Xian smiled and introduced himself lightly.<br/><br/>“Dragon King…”<br/><br/>Upon hearing Wang Xian’s words, the expressions of the few old men obviously changed.<br/><br/>“I don’t want to waste any more time. I’m here to inform you that your time of death has come. Your ancient art sect is about to be exterminated.”<br/><br/>As he spoke, chains shot towards them.<br/><br/>“Dragon King, stop. We are from the Xingjiang clan.”<br/><br/>An Elder’s expression changed drastically as he shouted immediately.<br/><br/>“Oh?”<br/><br/>Upon hearing his words, Wang Xian raised his eyebrows and looked at the elder who spoke. “Take out something to prove your identity. Leave within three seconds. Otherwise, don’t leave.”<br/><br/>A voice filled with dominance entered the old man’s ears, causing his expression to change drastically.<br/><br/>Behind him, a few young men revealed furious expressions.<br/><br/>“We are disciples of the Xingjiang clan. Are you trying to threaten us?”<br/><br/>A young man couldn’t help but growl in a low voice.<br/><br/>“PFFT!”<br/><br/>However, just as he finished his sentence, a chain pierced through him instantly.<br/><br/>He widened his eyes and revealed a shocked expression.<br/><br/>“Since that’s the case, let’s all die.”<br/><br/>As Wang Xian spoke, the chains pierced through them instantly.<br/><br/>“Dragon King, we are from the Starriver clan. Are you trying to make an enemy out of our Starriver clan by killing us?”<br/><br/>The universe knight-level elder of the Starriver clan had a shocked expression on his face. He immediately shouted loudly.<br/><br/>“Hehe.”<br/><br/>“I have already exterminated the ancient painting sect and the Heavenly Dragon Clan. Why would I be afraid of your Xingjiang Clan? How dare a mere disciple act so arrogantly in front of me?”<br/><br/>Wang Xian had a look of disdain on his face.<br/><br/>“PFFT! PFFT! PFFT!”<br/><br/>In the next moment, chains penetrated their bodies.<br/><br/>“Soul capture!”<br/><br/>At the same time, he waved his arm. The body of an expert from the ancient painting sect, who was at level two of a universe knight, trembled slightly. A stream of information entered Wang Xian’s mind.<br/><br/>“What are you doing? How dare you behave atrociously in our ancient painting sect!”<br/><br/>“TSK TSK tsk, behave atrociously. I will destroy all of you today.”<br/><br/>Boom<br/><br/>The sound of an attack was heard, accompanied by screams.<br/><br/>“Everyone, kneel down for me. Don’t even think about escaping. Behave yourself. Otherwise, I will slaughter your entire ancient painting sect today.”<br/><br/>Ba Qi’s cold voice spread across the entire ancient painting planet bridge. The killing intent on his body was not concealed at all.<br/><br/>“Hu!”<br/><br/>Wang Xian opened his eyes at this moment. A cold expression appeared on his face.<br/><br/>He swept his gaze across and kept the corpses.<br/><br/>According to the old man’s memories, when the Paragons of the ancient painting sect went to the Dragon Palace, to prevent any accidents from happening in their headquarters, they invited a few paragons from the Xingjiang clan to be guests.<br/><br/>This was mainly to intimidate some small fry.<br/><br/>“Kill all those above level three void God realm.”<br/><br/>Wang Xian absorbed some of the memories and opened his eyes, giving out a killing order.<br/><br/>Since the ancient painting sect wanted to destroy their dragon palace, their Dragon Palace could not allow the ancient painting sect to revive.<br/><br/>Kill all those above level three void God realm.<br/><br/>As long as the inheritance of the ancient painting sect was broken, the ancient painting sect would fall into complete silence.<br/><br/>“It’s the Dragon King, Jie Jie Jie, the trash of the ancient painting sect wants to destroy our Dragon Palace. Today, we will break your inheritance.”<br/><br/>“Everyone kneel down. Those above the void God Emperor Rank 3, come out and commit suicide. Otherwise, this father will start a massacre!”<br/><br/>Ba Qi threatened with a dense expression.<br/><br/>They did not need to make a move. As long as the disciples of the ancient art sect did not obey, they could blast a planet apart. It would depend on whether they wanted to live or to save the other disciples.<br/><br/>Wang Xian swept his gaze and flew straight to the location below.<br/><br/>According to the memories he obtained, he had already determined the location of the ancient art sect’s treasury.<br/><br/>“Gulp!”<br/><br/>“How… How could this happen? All the experts of our ancient art sect were killed?”<br/><br/>“The Dragon Palace attacked? They actually attacked. They want to destroy our entire ancient art sect.”<br/><br/>On the bridge of the ancient art planet, countless disciples of the ancient art sect trembled and their faces were filled with shock.\t\t\t\t\t\t</div>", "images": {}, "success": true}