{"id": 212, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15072325.html", "title": "Chapter 3203 - Chapter 3203: 3202 Dragon King Vs Star River Clan Leader", "volume": 3, "volume_title": "Volume 3", "body": "<h1>Chapter 3203 - Chapter 3203: 3202 Dragon King Vs Star River Clan Leader</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 3203: 3202 Dragon King vs Star River clan leader<br/><br/>“This Dragon Palace Dragon King doesn’t put us in his eyes!”<br/><br/>In a shrine in the center of the seven-colored river, the figure with the red sun above his head looked at the information handed over by his clansmen and said lightly.<br/><br/>“Clan leader, according to the information we received, elder San Yuan told us the name of our Star River clan at that time and still suffered a vicious attack. That Dragon Palace Dragon King didn’t care about us at all.”<br/><br/>The third elder who was holding the huge staff had a cold expression.<br/><br/>“The Dragon Palace is not as simple as the information said. They were able to destroy the ancient painting sect and the 150 universe knights of the Heavenly Dragon Clan. This shows their strength.”<br/><br/>“They either have a Level 4 universe knight or an extremely powerful spiritual treasure.”<br/><br/>The clan leader of the Starriver clan who had a red sun on his head said slowly, leaning slightly behind him.<br/><br/>“Clan leader, are we just going to let it go?”<br/><br/>The elders said unwillingly.<br/><br/>“Let it go? Of course not. So what if it’s A Level 4 knight? We can go meet the Dragon King.”<br/><br/>“The Dragon Palace will have to pay a price for this.”<br/><br/>The Xing Jiang clan leader said as the red sun above his head burst into flames. He stood up and disappeared.<br/><br/>“I will handle this matter.”<br/><br/>A voice rang out in the hall. The elders below bowed respectfully.<br/><br/>In the teleportation formation of the Xingjiang clan, the Xingjiang clan leader disappeared in an instant.<br/><br/>…<br/><br/>“There are quite a number of treasures in the ancient painting sect’s treasure vault. It’s actually not less than the Heavenly Dragon Clan.”<br/><br/>At this moment, in the ancient painting sect’s treasure vault, Wang Xian looked at the large amount of resources inside and revealed an extremely excited expression.<br/><br/>Although the ancient art sect was much weaker than the Celestial Dragon Clan, their foundation was much stronger than the Celestial Dragon Clan.<br/><br/>Apart from that, the ancient art sect had many disciples and citizens. They also collected a lot of resources.<br/><br/>In the Treasury of the ancient art sect, the total amount of resources was even more than the Celestial Dragon Clan.<br/><br/>All kinds of divine herbs, pills, and divine weapons were kept in the treasury. This time, the Dragon Palace had obtained too many resources.<br/><br/>After the Heaven Array returned, he could still find the universe knights of the ancient painting sect.<br/><br/>After obtaining all the resources, the Dragon Palace’s strength would be greatly enhanced.<br/><br/>Just as Wang Xian was searching for treasures based on the memories in his mind, a figure was walking in the void in front of the bridge of the ancient painting planet. He was flying towards them at a terrifying speed.<br/><br/>From Afar, the figure looked extremely majestic. He had a body of 10,000 feet and was dressed in a set of divine flame armor. He was filled with power.<br/><br/>What was most shocking was that there was an extremely huge blazing star floating above his head.<br/><br/>The blazing star was comparable to a star and was emitting extremely hot flames.<br/><br/>The blazing sun above his head was like an ancient god who had come from the ancient times. He was the ruler of the world!<br/><br/>When this voice came, it immediately attracted the attention of the members of the Dragon Palace around the bridge of the ancient painting planet.<br/><br/>They saw the towering figure that was stepping through the void and slightly narrowed their eyes.<br/><br/>“Universe knight level four!”<br/><br/>The Willow God looked at the Xing Jiang clan leader and slightly narrowed her eyes as she said.<br/><br/>“That is? That is the Xing Jiang clan’s clan leader, Mo Yang Knight!”<br/><br/>“It’s the Xingjiang clan leader. The Xingjiang clan leader is here. He must be here to avenge the venerables of the Xingjiang clan!”<br/><br/>“Will the Xingjiang clan leader destroy everyone in the Dragon Palace?”<br/><br/>On the bridge of the ancient painting planet, all the disciples of the ancient painting sect recognized this towering figure immediately.<br/><br/>They looked expectant.<br/><br/>They hoped that Venerable Moyang and the Xingjiang clan leader could destroy the people of the Dragon Palace.<br/><br/>Kill them all.<br/><br/>“Dragon King of the Dragon Palace, come out immediately!”<br/><br/>The Xingjiang clan leader stopped in the void and swept his gaze across all the experts from the Dragon Palace. His cold voice spread across the entire bridge of the ancient painting planet.<br/><br/>“Who summoned our Dragon King?”<br/><br/>Lei Ming stared at the Xingjiang clan leader and asked coldly.<br/><br/>“HMM?”<br/><br/>At the same time, Wang Xian, who had just come out of the ancient painting sect’s treasury, was slightly stunned when he heard this voice.<br/><br/>He looked at the starry sky and narrowed his eyes slightly when he saw this towering and huge figure.<br/><br/>“Venerable Moyang? The leader of the Xingjiang Clan?”<br/><br/>Wang Xian saw his appearance and recalled some information from before. He moved his body and appeared behind him with the incipient saint wings. He stared at him and said faintly.<br/><br/>“Dragon King of the Dragon Palace?”<br/><br/>The leader of the Xingjiang clan’s gaze landed on Wang Xian and asked coldly.<br/><br/>“May I know why the leader of the Xingjiang clan is looking for me?”<br/><br/>Wang Xian glanced at the scarlet sun above his head and narrowed his eyes slightly.<br/><br/>“Why are you asking if you already know the answer? If you don’t give the Xingjiang clan an explanation today, I will have to ask for an explanation myself.”<br/><br/>As the leader of the Xingjiang clan spoke, a faint killing intent gushed out from his body.<br/><br/>“Explanation? The Disciples of your Xingjiang clan are courting death. Is this explanation enough?”<br/><br/>Wang Xian looked at him and the corner of his mouth curled up slightly.<br/><br/>He was not afraid of the Xingjiang clan’s King Immortal at all.<br/><br/>According to the information, the strongest person in the Xingjiang clan, Mo Yang the venerable, was also the clan leader of the Xingjiang clan.<br/><br/>He had the strength of a level four universe knight.<br/><br/>This was also the only level four universe knight in the Xingjiang clan.<br/><br/>A level four universe knight was a force that the dragon palace had nothing to worry about.<br/><br/>This was also the reason why he dared to kill the experts of the Xingjiang clan.<br/><br/>“Haha, Good, good. You are really domineering, Dragon King. Let me learn from you today!”<br/><br/>The Xingjiang clan leader’s eyes revealed a sinister look as he moved instantly.<br/><br/>Boom<br/><br/>In the next moment, his entire body was like a flaming meteorite as he charged towards Wang Xian.<br/><br/>“Hehe!”<br/><br/>Wang Xian stared at the Xingjiang tribe leader with a sinister look in his eyes.<br/><br/>He flapped his incorporeal holy wings and disappeared in a flash.<br/><br/>When he reappeared, he was already behind the Xingjiang tribe leader.<br/><br/>“Huh? What a fast speed!”<br/><br/>At this moment, the Xingjiang tribe leader’s expression changed slightly.<br/><br/>“Scarlet Sun, Defend!”<br/><br/>He growled in a low voice. The Scarlet Sun that was like the Sun in the sky descended countless flaming waterfalls to defend his back.<br/><br/>“Holy Dragon Shadow!”<br/><br/>When Wang Xian saw the scarlet sun lowering its defense, he waved his arm slightly. A Holy Dragon Shadow appeared in the sky and attacked the entire scarlet sun.<br/><br/>“Roar! Roar! Roar!”<br/><br/>“Boom! Boom! Boom!”<br/><br/>The Holy Dragon Shadow landed on the Scarlet Sun and let out a terrifying collision sound.<br/><br/>The entire scarlet sun fell slightly downwards.<br/><br/>“Dragon Claw!”<br/><br/>At this moment, Wang Xian flapped his godless holy wings and instantly appeared to his right. The Dragon Claw attacked the Xingjiang clan leader directly.<br/><br/>“Big Sun!”<br/><br/>The Xingjiang clan leader’s expression changed slightly. He clenched his fist and attacked the Dragon Claw.<br/><br/>Between his fists, a sun appeared and met the Dragon Claw.<br/><br/>“Boom Boom Boom!”<br/><br/>A terrifying clashing sound rang out and a wave of air spread out in the surroundings.<br/><br/>“You’re courting death. How dare you provoke our Dragon King!”<br/><br/>The willow deity and the rest looked over. Their bodies moved and they were prepared to attack.<br/><br/>“Haha, there’s no need. I’ll teach this Xingjiang clan leader a lesson!”<br/><br/>Wang Xian laughed out loud and stopped the willow deity and the rest from attacking.\t\t\t\t\t\t</div>", "images": {}, "success": true}