{"id": 227, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15072355.html", "title": "Chapter 3218 - Chapter 3218: 3217 Dragon-Seizing Palace, Annihilating Sky Sea Dragon King", "volume": 3, "volume_title": "Volume 3", "body": "<h1>Chapter 3218 - Chapter 3218: 3217 Dragon-Seizing Palace, Annihilating Sky Sea Dragon King</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 3218: 3217 dragon-seizing palace, annihilating Sky Sea Dragon King<br/><br/>“Just you wait.”<br/><br/>Sky Sea Dragon King let out a ferocious roar as the crown of a acquired true treasure wrapped around him.<br/><br/>The Dragon Palace was right in front of him.<br/><br/>However, he didn’t notice that the Dragon Palace was trembling slightly.<br/><br/>Boom! Boom! Boom<br/><br/>At this time, a Level 5 universe knight from the Horned Seal race waved a terrifying golden diamond toward Sky Sea Dragon King from behind him.<br/><br/>“Humph!”<br/><br/>Sky Sea Dragon King sensed the attack from behind him, snorted, and continued to fly forward.<br/><br/>With the defensive power of his acquired true treasure, it was enough to block this attack.<br/><br/>Peng<br/><br/>A terrifying collision sound was heard, and cracks appeared on Sky Sea Dragon King’s defense.<br/><br/>“Damn it, the acquired true treasure on his body is too powerful.”<br/><br/>Seeing that his full-power attack was blocked, the great beings of the horned seal race had ugly expressions and were somewhat envious.<br/><br/>Acquired Supreme Treasure! He didn’t even have such a treasure.<br/><br/>If he wanted to obtain an acquired supreme treasure, he would need a great opportunity, or there was only one way to enter the heaven splitting chaotic land.<br/><br/>“Hahaha!”<br/><br/>The Sky Sea Dragon King laughed wildly and dragged his injured body forward.<br/><br/>In the next second, he would be able to enter his own Dragon Palace.<br/><br/>Buzz! Buzz! Buzz<br/><br/>However, at this moment, the Tianhai dragon palace trembled violently and suddenly flew away in a strange manner.<br/><br/>The Tianhai Dragon King, who was flying toward his own Dragon Palace, was stunned. He opened his mouth slightly, and his expression changed drastically.<br/><br/>Buzz<br/><br/>His expression changed drastically, and his body quickly turned illusory.<br/><br/>Bang<br/><br/>“Hahaha, Tianhai Dragon King, I want to see how you can escape without your Dragon Palace!”<br/><br/>Wang Xian saw the Dragon Palace flying towards the distance at a terrifying speed. Knowing that Ao Jin had succeeded, a smile appeared on his face.<br/><br/>He interrupted ao Jin’s thoughts of escaping back to his Dragon Palace in an instant. Narrowing his eyes slightly, he charged towards the Tianhai Dragon King.<br/><br/>“What have you done? What have you done to My Dragon Palace? !”<br/><br/>When the Tianhai Dragon King saw that his dragon palace was fleeing, he wanted to control it to fly over from afar. However, he was met with a huge resistance.<br/><br/>This caused his expression to change drastically. He glared at Wang Xian with his blood-red eyes and roared furiously.<br/><br/>“Haha, What Have You Done? Don’t you want to snatch my bloodline? It’s impolite not to reciprocate. This time, I Will Snatch Your Dragon Palace and take your life.”<br/><br/>Wang Xian smiled faintly and looked at him mockingly.<br/><br/>Without the Dragon Palace, under their siege, even if he had a acquired Supreme Treasure, he was definitely not their match.<br/><br/>“Surround and kill him!”<br/><br/>Wang Xian said in a sinister tone. The five elements grinding mill directly attacked the Tianhai Dragon King.<br/><br/>“Whoosh! Whoosh! Whoosh!”<br/><br/>“Boom! Boom! Boom!”<br/><br/>The willow deity and the heaven formation’s attack arrived. The terrifying power directly covered the Tianhai Dragon King.<br/><br/>“Return this Dragon King’s Dragon Palace, return this Dragon King’s Dragon Palace!”<br/><br/>The Tianhai Dragon King roared somewhat crazily. He wanted to chase after his Dragon Palace.<br/><br/>The Tianhai Dragon Palace was his last trump card. Once he lost the Tianhai Dragon Palace, everything would be over.<br/><br/>Losing his bloodline, losing his Dragon Palace, everything would be over.<br/><br/>“Bang, Bang, Bang!”<br/><br/>The five elements great mill and the willow deity sky array’s attacks landed on the Tianhai Dragon King, causing his acquired Supreme Treasure’s defense to completely collapse.<br/><br/>“Eh? They actually took away the Tianhai Dragon King’s Dragon Palace?”<br/><br/>The experts of the horned seal race and the Gemini race, who were standing to the side, revealed astonished expressions.<br/><br/>Their eyes flickered as they directly attacked the Tianhai Dragon King.<br/><br/>“No, no, no, I, the Tianhai Dragon King, am not resigned.”<br/><br/>The Tianhai Dragon King saw the group of people surrounding him and felt the terrifying energy. His face revealed a terrified expression.<br/><br/>With his current strength, he was no match for them.<br/><br/>The Dragon Palace had been stolen away. What awaited him was the possibility of destruction.<br/><br/>“Kill, Kill, Kill!”<br/><br/>He attacked Wang Xian and the rest with a crazed expression, flapping his huge wings.<br/><br/>“Die, Beast!”<br/><br/>The eyes of the elite from the horned seal race were filled with coldness.<br/><br/>He moved and rushed over. His terrifying long tail swept towards the Sky Sea Dragon King.<br/><br/>With the Sky Sea Dragon King’s strength, he could barely fight against a level five universe knight.<br/><br/>However, if it was a life-and-death battle, he was still no match for him.<br/><br/>Not to mention, there was also Wang Xian and the other experts.<br/><br/>At this moment, the Sky Sea Dragon King did not have the ability to resist.<br/><br/>“Bang!”<br/><br/>The huge force caused his body to start to collapse, with cracks appearing one after another.<br/><br/>“Heavenly Dragon Eight Tribes!”<br/><br/>Wang Xian growled in a low voice. The Shadows of the eight Divine Dragons attacked the Tianhai Dragon King from all directions.<br/><br/>The attacks of the two experts of the twin species also covered the area.<br/><br/>“No, no, no!”<br/><br/>Terrified and desperate screams were heard.<br/><br/>“No, no!”<br/><br/>At the side, the great demons controlled by the Tianhai Dragon King and the supremacies of the Xingjiang clan revealed terrified expressions in their eyes.<br/><br/>“Bang! Bang! Bang!”<br/><br/>At the Tianhai Dragon King’s side, streams of terrifying energy were extinguishing the life force of the Tianhai Dragon King.<br/><br/>Ten seconds later, the Tianhai Dragon King was completely annihilated.<br/><br/>“No!”<br/><br/>At the side, the bodies of all the great demons and venerables controlled by the Tianhai Dragon King trembled. The life force on their bodies also quickly disappeared.<br/><br/>“Huh?”<br/><br/>Wang Xian’s gaze swept over and he raised his eyebrows slightly.<br/><br/>“What a terrifying control technique.”<br/><br/>He muttered.<br/><br/>“Whoosh!”<br/><br/>At this moment, Wang Xian saw the expert from the horned seal race moving and flying toward the Tianhai Dragon King rapidly.<br/><br/>He moved his palm and grabbed the crown on the head of the Tianhai Dragon King.<br/><br/>Wang Xian narrowed his eyes slightly and moved his body. He reached out his hand and grabbed the body of the Tianhai Dragon King.<br/><br/>Buzz<br/><br/>However, just as he was about to grab it, the expert from the horned seal race waved his arm and directly put the Tianhai Dragon King’s corpse into his bag.<br/><br/>“You took away the acquired treasure and you want to take away the corpse as well?”<br/><br/>Wang Xian raised his eyebrows slightly and said faintly.<br/><br/>“Your Dragon Palace has obtained the Tianhai Dragon King’s Dragon Palace. Your Harvest is greater than ours.”<br/><br/>The expert from the horned seal race frowned slightly and said.<br/><br/>“Without us taking the Sky Sea Dragon Palace away, can you destroy the Sky Sea Dragon King?”<br/><br/>Wang Xian’s eyes sparkled as he said indifferently.<br/><br/>However, he did not snatch it away from the experts from the horned seal race.<br/><br/>The corpse of the Sky Sea Dragon King was comparable to the corpse of a universe knight at level four.<br/><br/>There was another one not far away.<br/><br/>Furthermore, the Star River clan and the other great demons’corpses numbered in the hundreds.<br/><br/>He moved and immediately grabbed towards the Star River clan’s clan leader’s corpse.<br/><br/>“HM?”<br/><br/>When he flew over, the eyes of the two women from the Snake Lady clan flickered.<br/><br/>Their bodies moved and similarly grabbed towards the Star River clan’s clan leader’s corpse.<br/><br/>Beside the corpse of the Xingjiang clan’s clan leader was a powerful acquired spiritual treasure, Chi Yang.<br/><br/>“Scram!”<br/><br/>Wang Xian’s eyes turned cold when he saw the two women from the Sheji clan trying to snatch the treasure from him.<br/><br/>The horned seal race was in cahoots with the Sheji clan. Do you want more treasures?\t\t\t\t\t\t</div>", "images": {}, "success": true}