{"id": 225, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15072351.html", "title": "Chapter 3216 - Chapter 3216: 3215, The Besieged Tianhai Dragon King", "volume": 3, "volume_title": "Volume 3", "body": "<h1>Chapter 3216 - Chapter 3216: 3215, The Besieged Tianhai Dragon King</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 3216: 3215, the besieged Tianhai Dragon King<br/><br/>“This Tianhai Dragon King seems to have gone crazy.”<br/><br/>Ao Jin looked at the Rising Dragon Assembly Square and said bitterly.<br/><br/>He had been trapped in the Dragon Palace for billions of years and had planned for billions of years. In the end, not only did he fail, but half of his dragon soul was also taken away.<br/><br/>He had no choice but to possess an inferior dragon.<br/><br/>Maybe there was something wrong with this Tianhai Dragon King’s brain.<br/><br/>Otherwise, he wouldn’t be so arrogant and reckless.<br/><br/>Now, the price was coming.<br/><br/>The primary races of the universe had invited the experts from the surrounding starry skies.<br/><br/>The so-called surrounding starry skies was like a name, surrounding a continent.<br/><br/>Surrounding the first continent of the universe, surrounding the first continent to be born.<br/><br/>There was even a legend that there was this heaven opening primal continent before the universe.<br/><br/>The surrounding starry sky was also known as the landing starry sky.<br/><br/>In this starry sky, countless races and forces wanted to enter the heaven opening desolate continent.<br/><br/>That was because it was the true holy land in the universe, where acquired spiritual treasures were often born.<br/><br/>Acquired spiritual treasures would also soar into the sky if something happened.<br/><br/>A single blade of grass could be cultivated to a terrifying level and cut down the Sun, Moon, and stars.<br/><br/>The heaven opening desolate continent was the truly dazzling place.<br/><br/>However, the powers that could establish their own clans in the surrounding starry skies were not weak either.<br/><br/>Their ultimate goal was to ascend to the heaven-splitting primordial land. Naturally, they had to have a certain level of strength.<br/><br/>“It’s normal for a powerhouse to go crazy after being trapped in a place for billions of years of torture.”<br/><br/>Wang Xian mumbled.<br/><br/>From the very beginning, the actions of the skysea Dragon King were somewhat abnormal.<br/><br/>To be able to cultivate to such a realm, which one of them wasn’t meticulous and would think twice before taking action.<br/><br/>For someone like the Tianhai Dragon King, his brain wasn’t normal.<br/><br/>Perhaps it was because he had suffered a huge blow.<br/><br/>“Dragon King, this is an opportunity for us.”<br/><br/>Tianchen narrowed his eyes slightly and said with a smile.<br/><br/>“Okay!”<br/><br/>Wang Xian nodded. “I’ll leave the Ao Jin Dragon Palace to you. Later, we’ll take action as well. We’ll strive to eliminate the Tianhai Dragon King.”<br/><br/>A madman could do anything.<br/><br/>It was better to eliminate him. It would save them too much trouble.<br/><br/>“It’s the Dragon King!”<br/><br/>Ao Jin nodded.<br/><br/>“Roar Roar Roar. A bunch of damned fellows. How dare they challenge the dignity of this Dragon King. All of you will die today!”<br/><br/>At this moment, a furious roar was heard from the Rising Dragon Assembly Square.<br/><br/>“Kill them all! Leave No one alive!”<br/><br/>The Tianhai Dragon King roared and flapped his enormous wings, directly attacking the members of the winter moon race and the twin species.<br/><br/>Behind him, all the great demons and experts of the Starriver clan who were under his control heard the order and followed closely behind.<br/><br/>“HMPH, Tianhai Dragon King, I’ll teach you a lesson today. Don’t be too arrogant.”<br/><br/>The first elder and second elder of the twin-life race had a sinister look in their eyes. They moved to meet Sky Sea Dragon King.<br/><br/>“Two universe knights at level four and you still want to fight me?”<br/><br/>“Die!”<br/><br/>Sky Sea Dragon King flapped his wings, and the crown on his head emitted a golden light.<br/><br/>The golden light flowed onto his wings, and golden wings attacked the two great beings of the twin-life race.<br/><br/>“Two-sided!”<br/><br/>The first elder and second elder of the twin species shouted in a low voice, and a two-sided mask of wind-attribute laws condensed in the air.<br/><br/>The mask was slightly distorted, and it directly met the golden wings of the Tianhai Dragon King.<br/><br/>“Bang, Bang, Bang!”<br/><br/>The sound of collision rang out, but the two-sided mask of laws was instantly destroyed.<br/><br/>“What!”<br/><br/>“What powerful strength!”<br/><br/>The pupils of the two elders of the twin races slightly contracted when they saw their attack was instantly destroyed.<br/><br/>They had solemn expressions on their faces.<br/><br/>“This lord of the horn seal race, let’s attack together.”<br/><br/>They looked to the right and shouted at the middle-aged figure in the middle of the Sheji race.<br/><br/>“Destroy him, I want his body and the Sky Sea Dragon Palace!”<br/><br/>The middle-aged man with a horn and a long tail shouted confidently and moved.<br/><br/>“Roar!”<br/><br/>He growled and turned into battle mode.<br/><br/>His body had grown by about 1,000 meters. Other than his long tail and huge horn, he still looked like a human.<br/><br/>The difference was that his body was covered in golden scales, and his entire body was shining with golden light.<br/><br/>The horned seal race was also a great being from a mid-level race in the universe.<br/><br/>And to be able to be addressed as “Lord”by the two elders of the twin races, one could only imagine how powerful he was.<br/><br/>He had the Combat Power of a universe knight level five.<br/><br/>Hong<br/><br/>His body was emitting a terrifying power. He locked onto Sky Sea Dragon King and instantly attacked him.<br/><br/>“What!”<br/><br/>“A universe knight level five great being actually appeared, hiss… This is a great being invited by that low-level race in the universe.”<br/><br/>“This time, the Sky Sea Dragon King is going to be in trouble. Even a universe Knight Level 5 great being has appeared. Two universe intermediate races!”<br/><br/>On the plaza below, when the other great beings saw this scene, their faces were filled with shock.<br/><br/>This Sky Sea Dragon King had gone too far!<br/><br/>“Leave the Xing Jiang clan’s clan leader to me.”<br/><br/>A voice came from the mech on the right that contained terrifying power. The entire mech burst into flames and attacked the Xing Jiang clan’s clan leader at a terrifying speed.<br/><br/>“Destroy them!”<br/><br/>The two women from the Serpentine clan spoke. Their bodies moved and held strange sculptures in their hands. They directly attacked the Xingjiang clan’s venerable and the other great demons.<br/><br/>The battle had completely erupted.<br/><br/>“F * ck, kill this arrogant fellow, Tianhai Dragon King. Kill his people.”<br/><br/>Below them, the eyes of the experts from the other universe’s primary races flashed. With a loud roar, they attacked.<br/><br/>Sky Sea Dragon King wanted them to submit or else he would destroy them.<br/><br/>This made them angry and murderous.<br/><br/>Now that they saw so many beings attacking them, they hesitated and attacked the Star River clan and the beasts.<br/><br/>“Roar, Universe Knight Level 5? When I was at my peak, I killed trash like you. Today, you dare to attack me. I want you to die!”<br/><br/>The Sky Dragon King saw the horned seal race warrior attacking him, killing intent shot out from his eyes.<br/><br/>The crown on his head gleamed, a golden light spread to the dragon tail.<br/><br/>The dragon tail swept, directly attacking the horned seal race warrior.<br/><br/>“Hehe, if you were at your peak, I wouldn’t be much in front of you, but now you are a half dragon, a piece of trash, you still dare to talk nonsense in front of me?”<br/><br/>A look of disdain appeared in the eyes of the expert from the horned seal race. The long golden tail behind him went straight for him.<br/><br/>“Bang!”<br/><br/>A violent collision sounded. The body of the SKYSEA Dragon King flew backward.<br/><br/>A large amount of blood flowed out from his dragon tail.<br/><br/>“Roar! Roar!”<br/><br/>His eyes turned blood red and his expression was abnormally ugly.<br/><br/>“Attack!”<br/><br/>At this moment, Wang Xian and the rest who were in the distance narrowed their eyes and instantly charged over.\t\t\t\t\t\t</div>", "images": {}, "success": true}