{"id": 220, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15072341.html", "title": "Chapter 3211 - Chapter 3211: The 3210 Heavenly Dragon Roared, And The Starriver Clan Submitted", "volume": 3, "volume_title": "Volume 3", "body": "<h1>Chapter 3211 - Chapter 3211: The 3210 Heavenly Dragon Roared, And The Starriver Clan Submitted</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 3211: The 3210 Heavenly Dragon Roared, and the Starriver clan submitted<br/><br/>“The clan leader is here!”<br/><br/>“Clan leader!”<br/><br/>Countless palaces in the Starriver clan’s headquarters were destroyed by the Sky Sea Dragon King.<br/><br/>When the experts and disciples saw the clan leader of the Starriver clan with the Red Sun on his head, they were excited.<br/><br/>The Sky Sea Dragon King had the combat strength of a level four universe knight, and their clan leader also had the combat strength of a level four universe knight.<br/><br/>As long as their clan leader arrived, they would be able to stop Sky Sea Dragon King.<br/><br/>“Clan leader of the Starriver clan, hurry up and submit to this Dragon King!”<br/><br/>Sky Sea Dragon King heard the words of the clan leader of the Starriver clan and looked at him coldly.<br/><br/>Looking at the clan leader of the Starriver clan with the Red Sun above his head, he was still full of power.<br/><br/>“Back then, my clan leader had already guessed that there might be a true dragon in Sky Sea Dragon Palace, and there really is one. However, at this moment, it seems that you can no longer be called a true dragon.”<br/><br/>“A true dragon wouldn’t kill Innocents, and a true dragon wouldn’t have such a body.”<br/><br/>The head of the Xingjiang clan glanced around with a cold expression.<br/><br/>Sensing the thick smell of blood, his expression was extremely ugly.<br/><br/>“Roar Roar Roar!”<br/><br/>“You’re courting death. In a while, it’ll be time for you to crawl under me.”<br/><br/>Hearing his words, the Sky Sea Dragon King’s eyes shot out terrifying killing intent as he flapped his wings and attacked the head of the Xingjiang clan.<br/><br/>“HMPH!”<br/><br/>“The one who wants to die is you!”<br/><br/>The Xingjiang clan’s patriarch snorted coldly. With a wave of his arm, he heavily punched the scarlet sun above his head.<br/><br/>The entire scarlet sun was like a volcano erupting as it directly met the Tianhai Dragon King!<br/><br/>“You dare to fight me with a broken Houtian Numinous Treasure?”<br/><br/>When the Tianhai Dragon King saw this incomparably huge scarlet sun, the crown on his head flew out, and the blades on it slowly grew larger.<br/><br/>Finally, the blade released a terrifying golden color, and golden light filled the sky as it flew toward the Red Sun.<br/><br/>“We must win! We must win!”<br/><br/>“With our clan leader’s power, we will definitely win. Even if we can’t win, we can still pin him down!”<br/><br/>“We are ready to help our clan leader fight against that Brutal Sky Sea Dragon King!”<br/><br/>At this time, more than 200 universe knights of the Starriver clan had gathered around.<br/><br/>They looked at the battle between their clan leader and Sky Sea Dragon King with anger and anxiety, ready to join the battle at any time.<br/><br/>“Boom! Boom! Boom!”<br/><br/>At this time, the terrifying golden blade and scarlet sun clashed.<br/><br/>The incomparably sharp and terrifying blade and sword directly entered scarlet sun under the shocked gaze of the Starriver clan’s clan leader.<br/><br/>“Peng!”<br/><br/>The entire scarlet sun emitted an intense sound as cracks appeared on its surface.<br/><br/>“What! ?”<br/><br/>When the Xingjiang clan’s patriarch saw that the scarlet sun actually had cracks, his expression changed slightly.<br/><br/>“Clang, Clang, Clang!”<br/><br/>However, what made him even more terrified was that the terrifying golden blade and sword pierced through the scarlet sun and attacked him.<br/><br/>“Not good, what kind of treasure is this? This is absolutely not an acquired numinous treasure. This is an existence at the level of an acquired Supreme Treasure.”<br/><br/>The Xingjiang clan’s patriarch roared in a low voice with a trace of shock on his face.<br/><br/>“Break!”<br/><br/>He roared wildly and waved the fist in his hand. Waves of terrifying flaming meteorites shot towards the Golden Saber and sword.<br/><br/>“Peng Peng Peng!”<br/><br/>“Pu!”<br/><br/>However, that terrifying golden saber and sword broke through all of his attacks and landed in front of him.<br/><br/>A terrifying wave of energy charged over. The Xingjiang clan’s Patriarch’s face was pale as he spat out blood.<br/><br/>With one move, the Xing Jiang clan leader was defeated.<br/><br/>“What!”<br/><br/>“Not good, support the clan leader!”<br/><br/>All the universe knights around were shocked when they saw this scene. They quickly made their moves, and beams of energy shot toward Sky Sea Dragon King.<br/><br/>“Just a bunch of trash like you dare to provoke me?”<br/><br/>Sky Sea Dragon King’s gaze swept past them. He swept his arms and flapped his wings, and golden wings swept toward them.<br/><br/>“You little piece of trash, you still dare to contend with this Dragon King!”<br/><br/>“Submit to this dragon king immediately. Otherwise, I will exterminate everyone in your Xingjiang clan.”<br/><br/>As the Tianhai Dragon King spoke, he directly charged towards the Xingjiang clan’s patriarch.<br/><br/>“Oh no, I am not his match!”<br/><br/>“He is even more terrifying than that Dragon King!”<br/><br/>When the Xingjiang clan’s patriarch saw the Tianhai Dragon King charging over, his expression changed drastically.<br/><br/>If he continued to fight, he would definitely be destroyed.<br/><br/>However, how could he be willing to submit to the Tianhai Dragon King?<br/><br/>“Whoosh!”<br/><br/>His body moved and he hurriedly dodged to the side.<br/><br/>“Hahaha, you want to hide? If you dare to escape, we will slaughter the rest of your Xingjiang clan!”<br/><br/>The Tianhai Dragon King saw that the Xingjiang clan leader wanted to escape.<br/><br/>He flapped his dragon wings and attacked the palace in front of him.<br/><br/>There were countless disciples of the Xingjiang clan, and all of them lived here.<br/><br/>Some of the weaker ones couldn’t escape at all.<br/><br/>The Tianhai Dragon King’s attack instantly killed countless people of the Xingjiang clan.<br/><br/>Large areas of the palace were directly destroyed.<br/><br/>“Damn it!”<br/><br/>The Xingjiang clan leader’s heart sank when he saw the Tianhai Dragon King’s massacre, and his expression was extremely ugly.<br/><br/>Looking at the Crazy Sky Sea Dragon King, he had no doubt that he would slaughter the entire Xingjiang clan’s disciples.<br/><br/>There were trillions of people in the Xingjiang clan. If the Sky Sea Dragon King massacred them, too many people would die.<br/><br/>“Sky Sea Dragon King, you are a member of the Divine Dragon Clan. Are You So Despicable?”<br/><br/>The Xingjiang clan leader gritted his teeth and had no choice but to charge toward the Sky Sea Dragon King.<br/><br/>“Attack, attack this crazy fellow!”<br/><br/>“Kill!”<br/><br/>The other 200 plus universe knights also launched their attacks.<br/><br/>“I am the king under the Crown, suppress him!”<br/><br/>“Hahaha!”<br/><br/>Sky Sea Dragon King laughed maniacally. The crown on his head rotated and expanded to over 10 million kilometers in size, forming a cage that enveloped all of them.<br/><br/>“Not good, don’t be enveloped by this crown!”<br/><br/>The Xingjiang clan’s patriarch roared sternly.<br/><br/>However, the Tianhai Dragon King’s strength far exceeded their imaginations.<br/><br/>As a former Golden Dragon, his battle experience and strength were simply not something the Xingjiang clan could compare to.<br/><br/>The crown enveloped everyone, and blades suddenly floated around them.<br/><br/>“Not good!”<br/><br/>Looking at the blades that appeared out of thin air, their eyes darkened, and they had a bad premonition.<br/><br/>“Pu Pu Pu!”<br/><br/>“Ah Ah Ah!”<br/><br/>At this moment, the blades began to move, and they pierced towards them.<br/><br/>Blades and swords continuously pierced through their bodies, and miserable screams rang out.<br/><br/>When the Xingjiang clan’s patriarch saw this scene, his eyes were blood red, and his body trembled violently.<br/><br/>“Stop, stop immediately. We surrender, our Xingjiang clan surrenders!”<br/><br/>He roared with a mournful and unwilling expression.<br/><br/>“Roar Roar Roar!”<br/><br/>“Surrender? Submit, and immediately kneel before this Dragon King. Otherwise, I will kill all of you, Hahaha!”<br/><br/>The Tianhai Dragon King roared with a savage expression, and his body was filled with a violent murderous aura.<br/><br/>He did not look like a noble dragon, but like a ferocious dragon.\t\t\t\t\t\t</div>", "images": {}, "success": true}