{"id": 226, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15072353.html", "title": "Chapter 3217 - Chapter 3217: 3216 Dragon-Seizing Palace, Dragon King Of Heaven-Sea", "volume": 3, "volume_title": "Volume 3", "body": "<h1>Chapter 3217 - Chapter 3217: 3216 Dragon-Seizing Palace, Dragon King Of Heaven-Sea</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 3217: 3216 dragon-seizing palace, Dragon King of heaven-sea<br/><br/>“Ao Jin, leave the heaven-sea Dragon Palace to me. After we enter, bring him back to the Dragon Palace immediately!”<br/><br/>“Let’s Speed Up!”<br/><br/>When Wang Xian and the rest flew over, the incipient saint wings appeared behind him. He brought ao Jin along and flew toward the heaven-sea dragon palace at a terrifying speed.<br/><br/>Swoosh<br/><br/>When he brought him to the front of the heaven-sea Dragon Palace, Wang Xian changed his direction and immediately attacked the heaven-sea Dragon King.<br/><br/>With a move of his palm, a five elements millstone appeared in his hand. The five elements millstone directly attacked the skysea Dragon King.<br/><br/>“Skysea Dragon King, today is the day you die.”<br/><br/>He shouted softly, and a cold look appeared in his eyes.<br/><br/>“HMM?”<br/><br/>Wang Xian’s sudden attack stunned the experts from the horned seal race and the twin species. They looked over.<br/><br/>Boom<br/><br/>At this moment, the Tianhai Dragon King saw the attack of the Five Elements Millstone and felt its power. He revealed an extremely ugly expression.<br/><br/>The crown on his head flew up and crashed into the five elements millstone.<br/><br/>Bang! Bang! Bang<br/><br/>The sound of collision rang out. The five elements millstone flew toward Wang Xian.<br/><br/>“Let’s destroy him together!”<br/><br/>Wang Xian squinted his eyes and shouted.<br/><br/>“Kill!”<br/><br/>The two universe knights of the twin species squinted their eyes. The hurricane law condensed into wind demon and attacked the Tianhai Dragon King directly.<br/><br/>The horned seal race experts also flew towards the Tianhai Dragon King and swept their long tails.<br/><br/>“Roar, Roar, Roar, you deserve to die. Dragon King, you deserve to die. I didn’t go to kill you, but you dare to attack me. Roar, Roar, Roar!”<br/><br/>The eyes of the Tianhai Dragon King, who was instantly besieged, turned blood-red. He roared with a crazed look on his face.<br/><br/>He flapped his two crimson-gold dragon wings. Numerous sabers and Swords flew out and covered Wang Xian.<br/><br/>“Old Man, you still want to Covet Our Dragon King’s Bloodline? You’re really courting death.”<br/><br/>“Hehe, you won’t be able to escape today.”<br/><br/>The Voice of the Heaven Formation and the Willow deity rang out. Accompanied by terrifying attacks, they met the Sabers and Swords.<br/><br/>“Boom! Boom!”<br/><br/>The array and the dragon scale and willow leaf clashed with the Sky Sea Dragon King’s attack, completely cancelling it out.<br/><br/>“Eh? That’s the Dragon Palace? They’re so powerful.”<br/><br/>The two elders of the twin species saw this scene, and their expressions froze, their eyes filled with shock.<br/><br/>They had already witnessed the Sky Sea Dragon King’s strength, and it was definitely not something an ordinary fourth-level knight could contend against.<br/><br/>However, the two members of the Dragon Palace were able to withstand it directly.<br/><br/>This dragon palace was not simple.<br/><br/>Furthermore, the Dragon Palace had displayed three fourth-level universe knights at once. This was comparable to an intermediate-level universe race that was weak like them.<br/><br/>“Holy Dragon Shadow, Kill!”<br/><br/>Wang Xian’s gaze focused. A Holy Dragon Shadow appeared in the sky and charged toward the Sky Sea Dragon King.<br/><br/>“Horn region, break the barrier!”<br/><br/>The expert from the Horned Seal race roared. The horn on his head emitted a radiance and instantly attacked the Tianhai Dragon King.<br/><br/>“You Bunch of damned things. How Dare You Offend Me? Die!”<br/><br/>When the Tianhai Dragon King saw the terrifying attacks coming towards him, his expression was extremely ferocious.<br/><br/>The crown on his head shone brightly. A golden longsword and a golden longsword slashed towards them.<br/><br/>“Clang!”<br/><br/>The sound of the blades clashing was deafening as they swept through the surrounding space.<br/><br/>“Bang, Bang, Bang!”<br/><br/>Terrifying clashing sounds rang out as the sacred dragon’s figure slowly disappeared. The Horned Seal Race’s golden horn attack also gradually disappeared.<br/><br/>“Oh? This Sky Sea Dragon King is so strong.”<br/><br/>“The acquired Supreme Treasure in his hands is very strong!”<br/><br/>The horned seal race expert’s eyes were filled with shock when he saw this scene.<br/><br/>They thought that they could kill the Tianhai Dragon King with their own strength, but it seemed that it was impossible for them to do it by themselves.<br/><br/>“Fire Dragon Array, dissolve!”<br/><br/>At this moment, the attack of the Heaven Array descended again.<br/><br/>Fire conquers gold.<br/><br/>Four pillars descended around the Tianhai Dragon King. Divine Dragons rushed out from the fire pillars and attacked him.<br/><br/>“Wood Dragon Leaves!”<br/><br/>The Willow God waved her arms and countless willow leaves condensed into the shape of a wood divine dragon and attacked the Tianhai Dragon King.<br/><br/>The continuous attacks caused the Tianhai Dragon King’s expression to change drastically.<br/><br/>He had relied on the acquired supreme treasure to block the attacks from the experts of the Wang Immortal Horn Seal race. After that, two attacks covered him!<br/><br/>“Bang Bang Bang!”<br/><br/>“Roar! Roar! Roar!”<br/><br/>The Sky Sea Dragon King let out a blood-curdling scream. A large amount of blood flowed out from his mouth, causing his body to be in a sorry state.<br/><br/>His blood-red eyes stared at his surroundings, and his expression was abnormally ugly.<br/><br/>“All of you, just you wait. All of you, just you wait. One day, I will exterminate all of you. I will kill all of you!”<br/><br/>His face was filled with rage as he roared. His expression was ferocious and terrifying.<br/><br/>“HMPH, Little Evil Dragon, today is the day you die. You still want to kill us?”<br/><br/>The eyes of the two elders of the twin species were filled with a sinister look.<br/><br/>A magic staff appeared in their hands, and a hurricane surrounded the green magic staff.<br/><br/>The two waved their arms, and countless wind attribute needles shot towards the Sky Sea Dragon King.<br/><br/>“Today, I’ll cut off your head.”<br/><br/>The horned seal race warrior had a cold look in his eyes. He moved and rushed over.<br/><br/>The group attacked again.<br/><br/>“You Want to kill me? You Think You can kill me? A bunch of trash, even a Pinnacle Universe Knight couldn’t kill me, you think you can?”<br/><br/>Sky Sea Dragon King’s blood red eyes swept over them, filled with killing intent.<br/><br/>Facing the attacks of the experts, he wasn’t too afraid.<br/><br/>“Roar! Roar! Roar!”<br/><br/>“Just you wait, I’ll take revenge on you one by one.”<br/><br/>“Divine Crown Protection!”<br/><br/>He roared, and the crown on his head emitted a dazzling light, completely protecting his entire body.<br/><br/>At the same time, he flapped his enormous wings and flew directly into his Dragon Palace.<br/><br/>Even though Sky Sea Dragon King was arrogant and crazy, he still had one thing to rely on.<br/><br/>And that was his dragon palace.<br/><br/>Even though he was much weaker, the Dragon Palace was still that powerful Dragon Palace.<br/><br/>As long as he entered the Dragon Palace, no knight above level 9 could kill him.<br/><br/>He could enter the Dragon Palace and escape, looking for an opportunity to take revenge.<br/><br/>This was his greatest trump card, and also his capital to be arrogant and crazy.<br/><br/>“Stop him! He wants to escape back to his God Country! Stop Him!”<br/><br/>The expert from the horned seal race shouted loudly.<br/><br/>Wang Xian squinted his eyes and waved his arm. The five elements millstone above his head smashed toward the Sky Sea Dragon King.<br/><br/>Bang<br/><br/>However, the five elements millstone landed in front of his body and bounced to the side.<br/><br/>“Hahaha, just you wait for me, Dragon King.”<br/><br/>The Tianhai Dragon King laughed maniacally and dashed towards the Dragon Palace.<br/><br/>The Dragon Palace was very close to him. He only needed a few seconds to enter.<br/><br/>Once he entered, no one would be able to do anything to him.<br/><br/>“Not good, go after him!”<br/><br/>The expression of the experts from the horned seal race changed slightly as they shouted loudly.<br/><br/>“Hehe!”<br/><br/>At this moment, Wang Xian did not panic. Instead, he smiled faintly.<br/><br/>Buzz Buzz<br/><br/>At this moment, the Tianhai Dragon Palace trembled strangely.\t\t\t\t\t\t</div>", "images": {}, "success": true}