{"id": 224, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15072349.html", "title": "Chapter 3215 - Chapter 3215: 3214, An Expert From The Surrounding Lu Xingkong", "volume": 3, "volume_title": "Volume 3", "body": "<h1>Chapter 3215 - Chapter 3215: 3214, An Expert From The Surrounding Lu Xingkong</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 3215: 3214, an expert from the surrounding Lu Xingkong<br/><br/>“Reporting to the Tianhai Dragon King, forty universe races have arrived, and there are still twenty-one universe primary races that have yet to arrive.”<br/><br/>Within the Tianhai Dragon Palace, the Xingjiang clan’s patriarch came to the Dragon King’s Hall and reported respectfully to the Tianhai Dragon King.<br/><br/>“Hehe, there are still twenty-one races? Very good, very good.”<br/><br/>The Tianhai Dragon King leaned on the dragon throne and transformed into a burly middle-aged man.<br/><br/>He wore a crown on his head and his eyes were filled with a sinister look.<br/><br/>“Boom!”<br/><br/>His body moved and flew directly toward the outside, his body emitting an extremely powerful murderous aura.<br/><br/>The head of the Xingjiang clan immediately followed behind.<br/><br/>“Boom! Boom! Boom!”<br/><br/>On the square in front of the Tianhai Dragon Palace, waves of terrifying auras charged toward them.<br/><br/>The powerful aura was filled with unbridled fear as it directly charged toward the experts of the various factions.<br/><br/>“Eh?”<br/><br/>“What a terrifying aura!”<br/><br/>“Hiss, is this the Sky Sea Dragon King? I heard that he possessed the Sky Dragon King. He was once a purebred divine dragon.”<br/><br/>Seeing the Sky Sea Dragon King fly out, the experts of the various factions felt this terrifying aura and their pupils constricted slightly.<br/><br/>Their faces revealed a solemn and fearful expression.<br/><br/>“Roar Roar Roar!”<br/><br/>The Sky Sea Dragon King flew out and raised his head, letting out a roar.<br/><br/>The powerful aura pressed forward.<br/><br/>“This…”<br/><br/>“Peng Peng Peng!”<br/><br/>The faces of some of the great beings who were weaker than universe knights instantly turned pale. Under this terrifying dragon aura, they directly laid on the ground, sweat pouring down like rain.<br/><br/>“Today, I will exterminate all the universe primary races that haven’t arrived.”<br/><br/>He said with a ferocious expression.<br/><br/>“HM? What?”<br/><br/>“Hiss, there are still more than 20 races that haven’t arrived. Could it be that he wants to exterminate all the universe primary races?”<br/><br/>The group of universe knights forcefully withstood the draconic aura of Sky Sea Dragon King, their expressions extremely ugly.<br/><br/>In their eyes, this Sky Sea Dragon King was a madman.<br/><br/>He was crazy and arrogant.<br/><br/>“What? Do you dare to Object?”<br/><br/>Sky Sea Dragon King heard the shocked expressions of the crowd, he smiled coldly and asked.<br/><br/>Everyone looked at him, their hearts shook slightly, they lowered their heads and no one dared to speak.<br/><br/>“Sky Sea Dragon King, have you stayed in Your Dragon Palace for too long, is your brain damaged?”<br/><br/>“Sou Sou Sou!”<br/><br/>At this moment, figures suddenly flew over from the void in front of them.<br/><br/>The one who spoke was an old man with a crescent moon between his brows. His eyes were cold as he stared at Sky Sea Dragon King.<br/><br/>Around him were universe knights.<br/><br/>There were more than 200 universe knights.<br/><br/>The most eye-catching ones were two people.<br/><br/>These two people looked very strange.<br/><br/>They had two faces.<br/><br/>One in the front and one behind.<br/><br/>Two-faced people.<br/><br/>These two-faced people looked around and looked at the Sky Sea Dragon King, then at the Dragon Palace behind them.<br/><br/>“HM? It’s the winter moon race and their forces. How did they come together?”<br/><br/>“This… The Winter Moon race and more than 10 other races came together, who’s that two-faced man? Why haven’t we seen him before?”<br/><br/>All the forces heard this voice, and their eyes were filled with shock.<br/><br/>The Star River clan and the great demons looked over, their eyes filled with coldness and killing intent.<br/><br/>“Not only is his brain damaged, a pure-blooded dragon possessing a sub-dragon and being trapped within the Dragon Palace for billions of years, he should be a madman by now.”<br/><br/>At this time, another voice sounded.<br/><br/>On the right, another seven or eight races, over 100 knights flew over.<br/><br/>These 100 people could clearly see that they were split into two camps.<br/><br/>One camp was led by two female snakes with human bodies and snake tails, the two held a statue, their eyes filled with coldness.<br/><br/>In the middle of the two female snakes, there was a middle-aged man with a horn and a 10m long tail.<br/><br/>The leader of the other camp was a mecha.<br/><br/>A ten-meter-long mecha.<br/><br/>The entire mecha exuded a terrifying aura.<br/><br/>Seeing their arrival, everyone was slightly shocked.<br/><br/>“Roar!”<br/><br/>“I think you’re courting death!”<br/><br/>Seeing their arrival, the Tianhai Dragon King’s expression darkened as he roared sternly.<br/><br/>His body moved and immediately transformed into the appearance of a heavenly dragon.<br/><br/>A monstrous killing intent surged towards the experts in the void.<br/><br/>“You dare to Insult Our Dragon King? You are courting death.”<br/><br/>The Xingjiang clan’s clan leader flew into the sky and roared icily with the scarlet sun above his head.<br/><br/>“Hahaha, I didn’t expect the Grand Xingjiang clan to become the Lackey of an evil dragon.”<br/><br/>The elder from the Winter Moon clan laughed loudly and roared icily.<br/><br/>“The clan leader of the Starriver clan has been controlled. TSK, TSK, tsk. As expected of a purebred divine dragon. His methods are truly formidable.”<br/><br/>Just as he finished speaking, a two-faced person at the side laughed and said.<br/><br/>“The Starriver clan is truly pitiful. This evil dragon of yours is even more detestable. You even said that you wanted to exterminate all of our universe’s primary races. Do you really think that we are easy to bully?”<br/><br/>On the right, an old woman said coldly.<br/><br/>Facing the Sky Sea Dragon King, who was stronger than them, they didn’t have the slightest fear or fear.<br/><br/>They weren’t a match for the Sky Sea Dragon King, but it didn’t mean that they were at his mercy.<br/><br/>Their arrival this time wasn’t just to warn the Sky Sea Dragon King.<br/><br/>“What a pity. The true dragon has turned into a quasi-dragon.”<br/><br/>The snake-tailed woman beside the old woman on the right shook her head.<br/><br/>“This… this snake-tailed man seems to be from the snake-ji race, surrounding the low-level snake-ji race in the starry skies.”<br/><br/>“If I’m not wrong, that two-faced man is from the mid-level twin race, the mid-level race of the Universe!”<br/><br/>“What’s that mech? It feels so terrifying, its strength shouldn’t be lower than a knight level 4.”<br/><br/>“We’ve gone too far. Hehe, this Sky Sea Dragon King has gone too far. He’s forced some of the universe’s primary races into a corner.”<br/><br/>In the surrounding areas, some of the powerful beings saw the group of powerful beings suddenly flying over. They didn’t put the Sky Sea Dragon King in their eyes at all. Their eyes were filled with excitement.<br/><br/>Especially when they recognized the twin races.<br/><br/>Although the twin races were at the bottom of the universe’s intermediate races, they were still an intermediate race in the universe.<br/><br/>Although the serpentine race was only a low-tier race in the universe, they were definitely at the pinnacle among the low-tier races in the universe.<br/><br/>The serpentine race had a terrifying number of knights, reaching nearly 2,000.<br/><br/>The only thing they lacked was a universe knight level four great being.<br/><br/>Although they didn’t have the Combat Power of a universe knight level four, some middle-tier races in the universe didn’t dare to underestimate them.<br/><br/>After all, they had too many universe knights and had many trump cards.<br/><br/>Their arrival was obviously to deal with the Sky Sea Dragon King.<br/><br/>The Sky Sea Dragon King had to pay the price for his arrogance today.<br/><br/>“Ao Jin, don’t you think the Sky Sea Dragon King is a little crazy?”<br/><br/>At the same time, in the distant void, Wang Xian, who sensed this scene, raised his eyebrows.\t\t\t\t\t\t</div>", "images": {}, "success": true}