{"id": 222, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15072345.html", "title": "Chapter 3213 - Chapter 3213: At The 3212 Ascending Dragon Gathering", "volume": 3, "volume_title": "Volume 3", "body": "<h1>Chapter 3213 - Chapter 3213: At The 3212 Ascending Dragon Gathering</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 3213: At the 3212 ascending dragon gathering<br/><br/>“Greetings, Dragon King!”<br/><br/>In the Dragon Field, the million disciples of the Dragon Palace were divided into dragon species and lined up in the surroundings.<br/><br/>Wang Xian swept his gaze over and revealed a satisfied expression on his face.<br/><br/>The current Dragon Palace’s strength was definitely considered to be at the top among the primary races in the universe.<br/><br/>The weakest void God Emperor had a rank six combat strength. Among them, there were more than a thousand peak void God Emperor members.<br/><br/>More than 1,000 peak void God Emperor members. This was definitely a terrifying number.<br/><br/>With the combat strength of the disciples of the Dragon Palace, these 1,000 peak void God Emperor members were comparable to more than 100 universe Knight Level One experts.<br/><br/>The strength of the entire Dragon Palace had reached an unprecedented height.<br/><br/>“In the next period of time, get used to the increase in strength.”<br/><br/>Wang Xian instructed indifferently.<br/><br/>“As You Command, Dragon King!”<br/><br/>The one million members of the Dragon Palace immediately responded respectfully.<br/><br/>“All the leaders of the Dragon Palace, follow me. The rest of the members can leave first.”<br/><br/>As Wang Xian spoke, his body moved and he flew into the Dragon King’s Hall.<br/><br/>“All of you know about the matters in the starry sky of Xingjiang. Now that the Tianhai Dragon King wants to rule the entire starry sky of Xingjiang, our Dragon Palace and the Tianhai Dragon King are mortal enemies. We have to make preparations in advance for this matter.”<br/><br/>Wang Xian spoke.<br/><br/>In just a few days, there were already some primary races in the starry sky of Xingjiang who could not withstand the pressure of the Tianhai Dragon King and surrendered.<br/><br/>Wang Xian could imagine that there would definitely be a large number of races that would submit to the Tianhai Dragon King.<br/><br/>When that time came, the influence of the Tianhai Dragon King would reach a very powerful level.<br/><br/>Initially, Wang Xian wanted to continue waiting until he had full confidence in killing the Tianhai Dragon King before making his move. Now, it seemed that he could not wait any longer.<br/><br/>“Dragon King, our poisonous horned dragon species can enter the starry sky of the starriver and parasitize the bodies of many experts. We can control their every move.”<br/><br/>Ba Qi immediately spoke.<br/><br/>“Yes, that’s possible.”<br/><br/>Wang Xian nodded in agreement.<br/><br/>“Dragon King, I think we can just kill our way over.”<br/><br/>At the lower position, Ao Jin pondered for a moment and said, “Dragon King, with you, me, and the Willow Deity Heaven Formation, the four of us working together can definitely suppress the Tianhai Dragon King.”<br/><br/>“Maybe. It will be difficult to kill him.”<br/><br/>He frowned slightly as he spoke.<br/><br/>“Is that Sky Sea Dragon King’s acquired true treasure so strong? We can’t even kill him with our strength?”<br/><br/>Sky Array raised his eyebrows and asked.<br/><br/>He could kill a universe Knight Level 4 great being now. Even the Willow God ao Jin could do the same, and with Dragon King.<br/><br/>Together, they could almost fight against a Level 5 universe knight.<br/><br/>“He’s very strong. With that acquired spiritual treasure and his own resources and experience, even a level 5 universe knight might not be able to kill him.”<br/><br/>Ao Jin nodded.<br/><br/>After all, the Sky Sea Dragon King was once a dragon God, once a Dragon King.<br/><br/>Even if he was heavily injured now, it was not easy to kill him.<br/><br/>“However, we can’t let him continue to develop. Once all the primary races in the starry sky submit to him, it will be even more troublesome.”<br/><br/>Prime Minister Gui said.<br/><br/>Every primary race in the universe was not simple. They all had powerful trump cards.<br/><br/>If the starry sky was really suppressed by the Tianhai Dragon King, it would not be good news for the Dragon Palace.<br/><br/>If the skysea Dragon King recovered a little and obtained some treasures, it would be even harder to deal with him.<br/><br/>“Ao Jin, how much control do you have over the skysea Dragon Palace Now?”<br/><br/>Wang Xian’s eyes flickered as he asked.<br/><br/>“About 45% . If I were to compete with him for the control of the skysea Dragon Palace, I wouldn’t be able to compete with the skysea Dragon King.”<br/><br/>Ao Jin pondered for a moment before he replied.<br/><br/>“Then, what is the probability of US snatching over the Sky Sea Dragon Palace?”<br/><br/>Wang Xian squinted his eyes and asked.<br/><br/>“Snatching over?”<br/><br/>Ao Jin’s eyes sparkled. “The Sky Sea Dragon King doesn’t know of my existence. If we are caught off guard, coupled with you guys, the probability of us snatching over is very, very high.”<br/><br/>“Furthermore, the moment I enter the Sky Sea Dragon Palace, I will open up my authority and allow you guys to enter. The Sky Sea Dragon Palace will not dare to enter.”<br/><br/>His words caused ao crab’s eyes to light up.<br/><br/>Now that Ao crab had devoured two universe God kingdoms that were level 3 universe knights, he had the combat strength of A Level 3 universe knight.<br/><br/>If the Dragon King and the others could bring the Sky Sea Dragon Palace over to him, then…<br/><br/>“Dragon King, do you mean to bring the Sky Sea Dragon Palace over so that our devouring dragon can devour it?”<br/><br/>Ao he asked with anticipation.<br/><br/>The Sky Sea Dragon King’s Dragon Palace was comparable to a level 6 universe god country.<br/><br/>If he could devour it, wouldn’t he be able to raise his combat strength to Level 5 universe knight.<br/><br/>Their devouring dragon could even increase the combat strength of two level 5 universe knights.<br/><br/>“That’s right.”<br/><br/>Wang Xian nodded.<br/><br/>This was the best method he could think of at the moment.<br/><br/>As long as he could snatch the Sky Sea Dragon Palace, Ao Xie and the rest would be able to get a huge buzz.<br/><br/>By then, the resources of the Sky Sea Dragon Palace would allow the two devouring dragons to raise their combat strength to level five universe knights. Killing the Sky Sea Dragon King would be a piece of cake.<br/><br/>“Dragon King, this plan is feasible. When do we take action?”<br/><br/>All the leaders of the Dragon Palace nodded their heads in agreement.<br/><br/>“First, control all the actions of the Tianhai Dragon King. Then, we will make a detailed plan. This time, only Lei Ming, Ao Jin Liu Shen, and I will take action.”<br/><br/>Wang Xian said faintly.<br/><br/>“It’s the Dragon King. The venom horned dragon and the thorned dragon will go together to investigate the situation.”<br/><br/>Prime Minister Gui replied immediately.<br/><br/>Wang Xian nodded.<br/><br/>The plan was completed. Prime Minister Gui and the rest took action immediately.<br/><br/>Wang Xian was in the Dragon Palace, quietly waiting for the news.<br/><br/>“How many more races have yet to submit?”<br/><br/>At the same time, in the distant starry sky of Xingjiang, above the seven-colored river of the Xingjiang clan, a majestic dragon palace was floating above.<br/><br/>In the Dragon King’s Hall of the Dragon Palace, the Tianhai Dragon King was sitting on the dragon throne. He looked at the Xingjiang clan’s leader and the rest with a cold expression.<br/><br/>“Reporting to the Dragon King, only fifteen races have declared their allegiance. There are still thirty-six primary races that have yet to respond.”<br/><br/>The clan leader of the Xingjiang clan respectfully knelt on the throne below and replied.<br/><br/>His eyes were filled with respect and obedience as he faced the Tianhai Dragon King.<br/><br/>It was obvious that he had been subdued by the Tianhai Dragon King in a terrifying manner.<br/><br/>“There are still thirty-six races? I think they want to be destroyed. Immediately notify them. In ten days, this Dragon King will convene a rising dragon gathering. All factions must come. Those who don’t come will be directly destroyed!”<br/><br/>“When that day comes, this dragon king wants to see which race dares to disobey. hahaha!”<br/><br/>The Tianhai Dragon King roared arrogantly, his eyes filled with coldness.<br/><br/>“It’s the Sky Sea Dragon King. This lowly one will immediately notify all the races. If you dare to disobey the Dragon King, Kill!”<br/><br/>The Xingjiang clan leader’s eyes were burning as he spoke.\t\t\t\t\t\t</div>", "images": {}, "success": true}