{"id": 229, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15072359.html", "title": "Chapter 3220 - Chapter 3220: 3,219 Battles", "volume": 3, "volume_title": "Volume 3", "body": "<h1>Chapter 3220 - Chapter 3220: 3,219 Battles</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 3220: 3,219 battles<br/><br/>Hong, Hong, Hong<br/><br/>A terrifying aura rose above the square of Rising Dragon Society.<br/><br/>However, the main character had undergone a huge change.<br/><br/>Hong, Hong, Hong<br/><br/>Waves of terrifying pressure rose into the sky, and the vast power caused the entire starry sky to change color.<br/><br/>The battle had just ended, and another battle had begun.<br/><br/>The Winter Moon race, led by the twin races, had more than 10 universe primary races and more than 100 universe knights.<br/><br/>There were 70 to 80 universe knights led by the Snake Ji Race.<br/><br/>There were 70 to 80 universe knights led by the powerful mech.<br/><br/>There were a total of 200 to 300 universe knights.<br/><br/>Each knight exuded a terrifying aura as they locked onto Wang Xian and the rest.<br/><br/>“Hiss, this… They are fighting again.”<br/><br/>“That Dragon King is so arrogant. They are actually snatching the spoils of war. They don’t even care about the horned seal race and the twin races at all!”<br/><br/>“The one from the horned seal race is a universe knight at level five while the Dragon King from the Dragon Palace is only at level four. This is too arrogant and arrogant.”<br/><br/>The surrounding experts from various factions were shocked when they saw the war breaking out again.<br/><br/>This was especially so for the Dragon King. In their eyes, he was no weaker than the Tianhai Dragon King.<br/><br/>The horned seal race and the Gemini race were the experts from the two mid-level races in the universe.<br/><br/>Regardless of the races, the experts from the horned seal race and the Gemini race were not something the Dragon Palace could contend against.<br/><br/>“You’re courting death!”<br/><br/>Wang Xian’s eyes were filled with killing intent when he saw all of them attacking him.<br/><br/>Everyone could see the contributions made by the various factions in this battle.<br/><br/>They actually wanted to snatch the spoils of war that belonged to the Dragon Palace. Then, they would kill them!<br/><br/>“I’ll leave the expert from the horned seal race to you!”<br/><br/>Wang Xian ordered the Liu Shen Heaven Formation and the rest. He narrowed his eyes slightly and waved his arm. The five elements grinding mill attacked the expert from the horned seal race.<br/><br/>“Roar!”<br/><br/>As he was speaking, the roar of a divine dragon could be heard from afar.<br/><br/>A golden dragon was flying toward them at a terrifying speed.<br/><br/>“It’s the Dragon King. Leave it to us!”<br/><br/>The Willow deity Sky Formation saw ao Jin flying over and nodded his head.<br/><br/>The Willow Deity, Sky Formation, Ao Jin, and the Five Elements Millstone were all able to kill a universe Knight Level 4 expert.<br/><br/>It was not too much of a pressure for them to work together to fight against a Level 5 universe knight.<br/><br/>“Three Level 4 universe knights and you want to fight against me? Let’s see how I’m going to kill you all.”<br/><br/>Upon hearing Wang Xian’s words, the great being of the horned seal race exuded a violent aura. His long golden tail swept toward the five elements grindstone.<br/><br/>His gaze swept past Ao Jin, and his eyes gleamed.<br/><br/>“Sir, help us destroy that Golden Dragon. We want the bloodline of that Golden Dragon.”<br/><br/>At the side, the two women from the Sheji race saw ao Jin flying over. Their eyes emitted a fiery glow as they shouted immediately.<br/><br/>“No Problem!”<br/><br/>The expert from the horned seal race smiled confidently. He clenched his arm and streams of terrifying golden radiance condensed on it.<br/><br/>“Kill!”<br/><br/>“Hualala!”<br/><br/>The Willow God growled, and her entire body changed instantly. Her hair turned into long willow branches.<br/><br/>The willow branches fluttered and directly attacked the chief of the horned seal race.<br/><br/>“Formation, Heaven Overturning!”<br/><br/>The Heaven Array waved its arm, and a formation directly covered the expert from the horned seal race.<br/><br/>“Roar, Roar, Roar!”<br/><br/>The five divine dragons raised their heads, and an image of the starry sky appeared in the sky above them.<br/><br/>In the starry sky above them, there were frost divine swords, earth-yellow coffins, powerful swords, and fire pagodas…<br/><br/>“Boom! Boom! Boom!”<br/><br/>The images began to materialize and become real, and the frost divine swords attacked the expert of the horned seal race.<br/><br/>“Eh?”<br/><br/>Sensing the might of the Willow Divine Sky Formation and the five elements great mill, the expert from the horned seal race narrowed his eyes, revealing an extremely shocked expression.<br/><br/>These attacks came one after another, causing him to feel a sense of threat.<br/><br/>“Roar Roar Roar!”<br/><br/>Ao Jin, who had rushed over, opened his dragon mouth, and a Golden Dragon Pearl also attacked the expert from the horned seal race.<br/><br/>Four attacks were aimed at him. At this moment, the expression of the expert of the horned seal race changed slightly.<br/><br/>“Whoosh! Whoosh! Whoosh!”<br/><br/>He hurriedly retreated and dodged to the side.<br/><br/>“Eh? What?”<br/><br/>Seeing that the master of the horned seal race had actually dodged to the side, all the experts around were slightly shocked.<br/><br/>“You are courting death. You still want the bloodline of the Divine Dragon of the Dragon Palace?”<br/><br/>Wang Xian’s gaze landed on the two women from the Sheji clan. His body moved and he charged towards them with a terrifying speed.<br/><br/>The Sheji clan was also a race of female snakes.<br/><br/>However, the female snakes had escaped from the Sheji clan.<br/><br/>Wang Xian did not have any good feelings towards the Sheji clan, but he did not have any ill intentions. However, since they wanted the bloodline of Ao Jin, they were courting death.<br/><br/>“Stop him and attack this Dragon King. We have many experts!”<br/><br/>When the two Sheji clan women saw Wang Xian flying towards them at a terrifying speed, their expressions changed drastically. They immediately shouted loudly.<br/><br/>“Dragon King of the Dragon Palace, don’t be infatuated!”<br/><br/>The two elders of the twin species looked a little embarrassed.<br/><br/>They were still very fearful of the Dragon King of the Dragon Palace. However, they had no choice but to fight for the resources of the Xingjiang clan.<br/><br/>They did not want to be enemies with the Dragon Palace, but that did not mean that they did not dare to.<br/><br/>After all, they were an intermediate race in the universe.<br/><br/>Their overall strength was much stronger than the Dragon Palace.<br/><br/>The two elders of the Gemini race waved their arms and tornadoes of laws attacked Wang Xian.<br/><br/>“Bang, Bang, Bang!”<br/><br/>The mech expert raised his arm and fired a cannonball at Wang Xian.<br/><br/>“Do it! Cover him with energy!”<br/><br/>The rest of the experts from the elementary races in the starriver galaxy gritted their teeth and roared loudly.<br/><br/>In order to invite the twin races of the Serpentine clan to help, they had already paid a great price.<br/><br/>However, if they could share the treasures of the Starriver clan, they could make up for their injuries and even obtain some treasures.<br/><br/>With the alliance of their races, even the Tianhai Dragon King would not be afraid, let alone the Dragon Palace.<br/><br/>“Hehe!”<br/><br/>Wang Xian saw streams of extremely terrifying energy covering him. His dragon eyes were glowing.<br/><br/>“Eight luminaries Dragon Scale!”<br/><br/>He let out a low roar. His body was covered by the eight-colored dragon scale. There were also yin-yang tai chi patterns revolving around him.<br/><br/>He unfurled the primaless sacred wings, and his dragon eyes found a weak spot.<br/><br/>“Hua La!”<br/><br/>The primaless sacred wings flapped, and he flew toward that weak spot in an instant.<br/><br/>With his full speed, his speed was comparable to a level 5 universe knight.<br/><br/>On the battlefield, other than the experts from the horned seal race who could fight against Wang Xian, the rest were much slower.<br/><br/>“Buzz!”<br/><br/>His terrifying speed allowed him to dodge the overwhelming attacks. He narrowed his eyes and locked onto a universe Knight Level 1 expert.<br/><br/>Sou<br/><br/>His figure flashed and appeared in front of the Universe Knight Level 1 expert instantly.\t\t\t\t\t\t</div>", "images": {}, "success": true}