{"id": 221, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15072343.html", "title": "Chapter 3212 - Chapter 3212: The Improved Strength Of The 3211 Dragon Palace", "volume": 3, "volume_title": "Volume 3", "body": "<h1>Chapter 3212 - Chapter 3212: The Improved Strength Of The 3211 Dragon Palace</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 3212: The improved strength of the 3211 Dragon Palace<br/><br/>“Roar! Roar! Roar!”<br/><br/>Beside the seven-colored river of the Xingjiang clan, an extremely excited roar resounded through the sky.<br/><br/>A dragon with a huge pair of wings and a powerful murderous aura floated in the air.<br/><br/>In front of them, a group of experts led by the Xingjiang clan leader kneeled in front of them with an extremely embarrassed expression.<br/><br/>They had lost. The Xingjiang clan had completely lost.<br/><br/>The Xingjiang clan’s clan leader had the ability to escape, but once he escaped, the Tianhai Dragon King would slaughter the entire Xingjiang clan.<br/><br/>He didn’t dare to escape, because the Tianhai Dragon King really dared to slaughter countless of their people.<br/><br/>“Our clan leader and the others have actually lost. Our Xingjiang clan is going to submit to that evil dragon!”<br/><br/>“It’s over. We’re going to submit to the Tianhai Dragon King.”<br/><br/>“No, no, no, how could this be? He’s an evil dragon, a brutal evil dragon!”<br/><br/>All the surrounding Xingjiang clansmen trembled violently when they saw this scene. Their faces revealed an extremely embarrassed expression.<br/><br/>Their Xingjiang clan had actually become the slave of an evil dragon.<br/><br/>The news that the Tianhai Dragon King had brought his own Dragon Palace to suppress the Xingjiang clan quickly spread throughout the starry sky of Xingjiang.<br/><br/>When everyone learned that the Xingjiang clan had submitted to the Tianhai Dragon King, an extremely shocked expression appeared on their faces.<br/><br/>Especially when they learned that the Tianhai Dragon King had defeated the Xingjiang clan’s clan leader in one move, everyone was even more shocked.<br/><br/>“The Tianhai Dragon King didn’t die. He took over the body of the Tianhai Dragon King. His strength is extremely terrifying.”<br/><br/>“Who would have thought that the Tianhai Dragon King didn’t die and reincarnated. This… His strength is too terrifying. The Xingjiang clan was defeated in one move and is much stronger than the Dragon King of the Dragon Palace.”<br/><br/>“It’s said that the Tianhai Dragon King is extremely crazy. As long as the Xingjiang clan doesn’t surrender, he will slaughter everyone in the Xingjiang clan.”<br/><br/>“That Tianhai Dragon King is an evil dragon!”<br/><br/>Countless people were discussing on the universe’s AI.<br/><br/>A divine dragon from afar had taken over and reincarnated, giving them a powerful shock.<br/><br/>This was especially so since this divine dragon had suppressed the Xingjiang clan.<br/><br/>“Dragon King, this is news from the xingjiang starry sky.”<br/><br/>At the same time, at the location of the Dragon Palace, the situation of the Xingjiang clan was immediately transmitted to Prime Minister Gui.<br/><br/>When Wang Xian saw the news from Prime Minister Gui, he frowned slightly.<br/><br/>“Then what is the Tianhai Dragon King doing to suppress the Xingjiang clan? Is It for resources?”<br/><br/>A puzzled look appeared on his face as he pondered for a moment before continuing, “There is another possibility. It is to deal with our Dragon Palace.”<br/><br/>“It is possible, but it won’t be so easy for them to destroy our Dragon Palace.”<br/><br/>Prime Minister Gui said with a smile.<br/><br/>“Keep an eye on the situation with the Tianhai Dragon King.”<br/><br/>Wang Xian nodded his head.<br/><br/>“Yes, Dragon King!”<br/><br/>Prime Minister Gui nodded his head.<br/><br/>“I’ll have to fight with the Tianhai Dragon King sooner or later.”<br/><br/>Sitting on the dragon throne, Wang Xian muttered to himself. With a wave of his arm, the five elements millstone appeared in his hand.<br/><br/>One after another, the acquired spiritual treasures were placed on the five elements millstone and were quickly absorbed by it.<br/><br/>This included the two ancient paintings from the ancient painting sect.<br/><br/>Those two ancient paintings were considered to be exceptionally powerful existences among the acquired spiritual treasures.<br/><br/>After the five elements millstone devoured them, they should be able to kill a level four universe knight.<br/><br/>As for the level of the five elements millstone, Wang Xian was unsure.<br/><br/>Ordinary acquired spiritual treasures could only erupt with terrifying power when they were controlled.<br/><br/>However, because Wang Xian had five of his clones in the Five Elements Millstone, he didn’t need to control it himself to unleash a terrifying combat strength.<br/><br/>“After the five elements millstone devours it this time, it should be comparable to a postnatal numinous treasure, right?”<br/><br/>Wang Xian mumbled.<br/><br/>The five elements millstone could attack the opponent’s numinous treasure while he was fighting the enemy.<br/><br/>If he met the Sky Sea Dragon King, he might be able to fight him.<br/><br/>However, it might be difficult to defeat him.<br/><br/>However, if the willow deity and the Golden Dragon were added, he could definitely suppress the Sky Sea Dragon King.<br/><br/>As he thought, waves of energy surged into the five elements millstone to increase its speed of absorbing the Numinous Treasure.<br/><br/>Meanwhile, in the Dragon Palace, the other members of the Dragon Palace were increasing their strength in the dragon transformation pool.<br/><br/>Time passed day by day. The battle between the Dragon Palace and the other forces in the Milky Way also made all the forces in the Milky Way fearful.<br/><br/>Whether it was the mist race or the three-foot race, they were all respectful to the Dragon Palace.<br/><br/>The Dragon Palace had already become a transcendent existence in the Milky Way.<br/><br/>Another major event had happened in the starry sky.<br/><br/>The Tianhai Dragon King announced that all the races in the starry sky had to submit to him or they would be destroyed.<br/><br/>Once this news was out, it caused a huge commotion in the starry sky.<br/><br/>There were 50 to 60 primary races in the starry sky.<br/><br/>There were two to three universe knights in the weaker primary races.<br/><br/>There were more than 1,000 universe knights in the starry sky.<br/><br/>And the Sky Sea Dragon King’s words were to make more than 1,000 universe knights submit to him.<br/><br/>This caused the entire starry sky of Xingjiang to boil.<br/><br/>They were shocked by the Tianhai Dragon King’s arrogance and arrogance.<br/><br/>But in their hearts, they were also very afraid of the Tianhai Dragon King.<br/><br/>Everyone already knew what happened at the Xingjiang clan.<br/><br/>The Tianhai Dragon King could really make the move that as long as he didn’t submit to him, he would exterminate the entire clan.<br/><br/>This made the primary races of the universe look extremely embarrassed.<br/><br/>There were only two options. Either submit, or lead their clansmen and escape.<br/><br/>Otherwise, what awaited them was likely the Tianhai Dragon King’s attack.<br/><br/>The entire starry sky of Xingjiang was in complete chaos because of the Tianhai Dragon King.<br/><br/>While the starry sky of Xingjiang was in chaos, the members of the Dragon Palace were all upgraded.<br/><br/>After absorbing the resources from this battle, the strength of the entire Dragon Palace changed dramatically.<br/><br/>The number of universe knights in the Dragon Palace had increased by about 400.<br/><br/>Among them, the sky array had absorbed the resources from the Dragon Bones in the Sky Sea Dragon Palace’s Dragon Tomb, and its combat strength had risen to universe Knight Level 4.<br/><br/>The other members of the Dragon Palace and their leaders had all risen to universe knight level 3.<br/><br/>Currently, there were around 500 universe knights in the Dragon Palace.<br/><br/>500 universe knights… This number was definitely very terrifying.<br/><br/>Even the Starriver clan had a huge difference from the Dragon Palace.<br/><br/>Not to mention the members of the Dragon Palace who had level 4 universe knights.<br/><br/>Other than the improvement of the universe knights, the other members of the Dragon Palace had also reached a terrifying level.<br/><br/>This time, they had exterminated three universe primary races, and their elites were all at the god Emperor level.<br/><br/>Close to ten million god Emperor experts, and the resources formed from all the corpses allowed the disciples of the Dragon Palace to receive a terrifying improvement.<br/><br/>At this moment, even the weakest disciple of the Dragon Palace had the combat strength of a void God emperor at level six.<br/><br/>A void God emperor at level six was considered an elite of a race across the Milky Way. It would not be a problem for them to control one or two planets.\t\t\t\t\t\t</div>", "images": {}, "success": true}