{"id": 228, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15072357.html", "title": "Chapter 3219 - Chapter 3219: The Battle For The 3218 Spoils Of War", "volume": 3, "volume_title": "Volume 3", "body": "<h1>Chapter 3219 - Chapter 3219: The Battle For The 3218 Spoils Of War</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 3219: The battle for the 3218 spoils of war<br/><br/>“We killed the Xingjiang clan’s clan leader.”<br/><br/>When the two women from the Sheji clan saw Wang Xian heading towards them, their expressions changed slightly. They quickly dodged to the side.<br/><br/>“You killed him?”<br/><br/>Wang Xian glanced at them with a mocking look in his eyes.<br/><br/>The death of the Xingjiang clan’s clan leader was due to the death of the Tianhai Dragon King.<br/><br/>He ignored them and went straight for the corpse of the Xingjiang clan leader.<br/><br/>Buzz<br/><br/>He kept the corpse in the mother nest and reached for the acquired Numinous Treasure, Chi Yang.<br/><br/>This acquired Numinous Treasure was very powerful!<br/><br/>“That is our spoils of war!”<br/><br/>The expressions of the two women from the Sheji clan changed slightly. With a wave of the strange sculpture in their hands, a surge of energy attacked Wang Xian.<br/><br/>“You’re courting death. How dare you attack our Dragon King!”<br/><br/>At this moment, a cold killing intent enveloped the two women from the Sheji clan. Dragon-scaled willow leaves attacked them one after another.<br/><br/>The expressions of the two women changed drastically.<br/><br/>With a wave of their arms, a wave of strange dark energy blocked the dragon-scaled willow leaves.<br/><br/>“Pu Pu!”<br/><br/>“Ah Ah!”<br/><br/>However, the two of them were only at level three of the Universe Knights. Facing the sudden attack of the Willow God, they could not withstand it at all.<br/><br/>The willow leaves entered their bodies, causing a large amount of blood to ooze out from their bodies. Their faces were pale as they screamed in pain.<br/><br/>“Stop!”<br/><br/>At the side, the expert from the horned seal race looked over. His face turned cold as he scolded coldly.<br/><br/>Wang Xian waved his arm slightly and dispersed the strange attack from the snake princess race. Then, he kept the acquired spiritual treasure, Chi Yang.<br/><br/>“If you dare to attack again, I will destroy all of you.”<br/><br/>He looked at the two women from the snake princess race. His eyes were filled with coldness.<br/><br/>“Even the Divine Dragon Race is so arrogant? Didn’t you see the fate of the skysea Dragon King?”<br/><br/>When the expert from the horned seal race heard Wang Xian’s words, he narrowed his eyes slightly and stared at him coldly.<br/><br/>“You think you can destroy the Sky Sea Dragon King?”<br/><br/>“How dare you attack me? Do you believe that I can destroy them?”<br/><br/>Wang Xian looked at the expert of the horned seal race and said coldly.<br/><br/>If Ao Jin did not take the Dragon Palace away, it would be wishful thinking for them to kill the Sky Sea Dragon King.<br/><br/>When they attacked the Sky Sea Dragon King earlier, Wang Xian and the rest had contributed as much as the experts of the horned seal race.<br/><br/>He was not afraid of the Horned Seal race, a universe knight level five expert.<br/><br/>With the sky array and Willow God, he could easily fight against them.<br/><br/>If Ao Jin were to come, he could directly suppress them.<br/><br/>“You…”<br/><br/>The two women of the Snake Lady Race had a slight change in expression. They looked extremely embarrassed.<br/><br/>“I really don’t believe that you can destroy them.”<br/><br/>The eyes of the experts from the horned seal race flashed with killing intent.<br/><br/>“The enemy has already been destroyed. Everyone, next is the time to collect the spoils of war. There’s no need to have a conflict.”<br/><br/>The two elders from the twin races looked over, frowned slightly, and said.<br/><br/>“I agree!”<br/><br/>A voice came from a mecha that contained a powerful aura.<br/><br/>“I want 50% of all the spoils of war.”<br/><br/>As soon as they finished speaking, the powerhouse from the horned seal race said directly.<br/><br/>“Among the remaining resources, I want 30% .”<br/><br/>Wang Xian said faintly as his gaze swept across the corpses around him. “I’m not interested in the Xingjiang clan’s territory and other treasures. I want these corpses.”<br/><br/>“Aren’t the two of you asking for a little too much?”<br/><br/>When the two experts from the twin species heard their words, their expressions turned ugly.<br/><br/>“You want corpses? An array master can find their universe God country through corpses. This Dragon King from the Dragon Palace, you have a good plan.”<br/><br/>The expert from the horned seal race said coldly.<br/><br/>“The Starriver clan’s treasury, the Starriver clan’s domain, and the grotto-heaven blessed land are equally valuable. If you have any objections, you can find all of them and share them. However, if that’s the case, our Dragon Palace wants 40% .”<br/><br/>Wang Xian said faintly.<br/><br/>“Your Dragon Palace has already obtained a skysea Dragon Palace. Do you still want so many resources?”<br/><br/>The experts from the horned seal race narrowed their eyes slightly.<br/><br/>“Dragon King, we still have our forces to divide the resources. I hope you won’t Forget About Us!”<br/><br/>At this moment, the experts from the forces on the right spoke up.<br/><br/>“We also want 10 to 20 percent. Hehe, I don’t think it’s much.”<br/><br/>A group of powerhouses led by the Winter Moon race took a step forward and spoke.<br/><br/>“10 percent is enough for us.”<br/><br/>The mech that was emitting a terrifying aura said faintly.<br/><br/>“In that case, it’s not enough.”<br/><br/>Wang Xian narrowed his eyes slightly.<br/><br/>“This lord from the horned seal race is a level five universe knight. I have no objection to them splitting 50 percent with the snake princess race.”<br/><br/>The two elders of the twin races spoke and looked at Wang Xian. “Your Dragon Palace has already obtained the Dragon Palace. 20% is enough for you.”<br/><br/>“20% of the resources, together with the Dragon Palace of the Sky Sea Dragon King, is equivalent to 30-40% .”<br/><br/>The elder of the Winter Moon race, who was the leader, said faintly.<br/><br/>“Then it’s settled. Find all the treasures and share them according to the ratio.”<br/><br/>The expert from the horned seal race spoke directly.<br/><br/>“Have you decided that the Dragon Palace will agree to this?”<br/><br/>Wang Xian swept his gaze across them and asked faintly.<br/><br/>“Why? You Don’t agree? It’s already good enough if you get some points. Don’t wait until the end when none of them will be yours.”<br/><br/>The expert from the horned seal race emitted waves of aura as he stared at him coldly.<br/><br/>The two elders from the twin species and the mech that exuded a terrifying aura also looked at Wang Xian and the rest<br/><br/>“HMPH!”<br/><br/>The two women from the serpentine race had a cold look in their eyes.<br/><br/>“Haha, Without You, the Tianhai Dragon King and my dragon palace can be destroyed as well. However, without our dragon palace, it’s impossible for you to kill the Tianhai Dragon King.”<br/><br/>“Since you think that this is a reasonable distribution, you can take it. Our Dragon Palace will take it based on our strength!”<br/><br/>Wang Xian laughed out loud and looked at the willow deity Sky Formation and the rest.<br/><br/>At the same time, the incipient Saint Wings appeared behind him. He quickly retrieved the corpses one by one.<br/><br/>“You are courting death!”<br/><br/>“Impudent, Arrogant Fellow. The Tianhai Dragon King is the fate of Your Dragon Palace!”<br/><br/>When the expert from the horned seal race saw Wang Xian snatching the corpses away, his eyes were filled with killing intent as he roared coldly.<br/><br/>The two elders from the twin races, the 100 plus universe knights from the Winter Moon race, the terrifying mech, and the Snake Princess race all had ugly expressions on their faces.<br/><br/>They didn’t expect the Dragon King of the Dragon Palace to be so arrogant and look down on them.<br/><br/>Your Dragon Palace only had three universe knights at Level 4. Even if they were stronger than ordinary experts, they were too arrogant.<br/><br/>They were simply courting death.<br/><br/>“Let’s kill these reckless fellows first!”<br/><br/>The great beings of the horned seal race roared.<br/><br/>“Are the Dragon God lineage all so arrogant? Surround and attack them!”<br/><br/>The Knights of the Winter Moon race also roared with murderous intent.<br/><br/>In an instant, 200 to 300 universe knights locked onto Wang Xian and the rest.\t\t\t\t\t\t</div>", "images": {}, "success": true}