{"id": 235, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15072371.html", "title": "Chapter 3226 - Chapter 3226: 3225 Attacked First", "volume": 3, "volume_title": "Volume 3", "body": "<h1>Chapter 3226 - Chapter 3226: 3225 Attacked First</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 3226: 3225 attacked first<br/><br/>“Is this their Dragon Palace? It looks very similar to the Sky Sea Dragon King. It seems that this dragon palace has also obtained the true dragon inheritance.”<br/><br/>“Let’s test the strength of this dragon palace and be careful. Once the experts of the Dragon Palace come out, we will escape immediately.”<br/><br/>Over twenty figures were hiding in the air above the Dragon Palace.<br/><br/>They were the horned seal race, twin race, and Snake Lady Race Warriors.<br/><br/>After flying for close to 10 days, they arrived at the Milky Way.<br/><br/>This time, the main goal was to investigate the strength of the Dragon Palace.<br/><br/>The three races had sent out a total of six universe knights with level 3 combat strength, this strength wasn’t weak.<br/><br/>“Spread out and attack the four Dragon Gates of the Dragon Palace.”<br/><br/>The leader of the Horned XI race ordered.<br/><br/>“Yes!”<br/><br/>The rest nodded, their gazes locked onto the dragon gates.<br/><br/>“Attack!”<br/><br/>The Horned XI race knight shouted and flew towards the east gate.<br/><br/>“Stop testing, test my strength first.”<br/><br/>At this time, a voice sounded beside their ears, shocking them.<br/><br/>“Hualala!”<br/><br/>At this moment, chains were binding them. Everyone from the three races did not even have the time to react.<br/><br/>“Who is it?”<br/><br/>They looked at the chains on their bodies. Their foreheads were instantly filled with cold sweat as they looked at Wang Xian in shock.<br/><br/>“Hehe, why are you still asking who is coming to our Dragon Palace?”<br/><br/>Wang Xian smiled. His dragon eyes swept across them and revealed a demonic luster.<br/><br/>Soul capture!<br/><br/>In an instant, more than 20 universe knights from the three races were in a trance.<br/><br/>“Summon your divine kingdoms over.”<br/><br/>Wang Xian’s command was heard.<br/><br/>“Yes!”<br/><br/>Buzz! Buzz! Buzz<br/><br/>The strongest universe knight at level three could not resist Wang Xian at all.<br/><br/>Soon, more than 20 divine kingdoms appeared in the sky above the Dragon Palace.<br/><br/>In the Dragon Palace, the halberd dragon guard sensed the situation and immediately flew over.<br/><br/>“What are your intentions in coming to the Dragon Palace?”<br/><br/>Wang Xian looked at them and asked faintly.<br/><br/>“We are here to test the strength of the Dragon Palace.”<br/><br/>The Universe Knights answered in unison.<br/><br/>“Test the strength of the Dragon Palace? What happens after that?”<br/><br/>Wang Xian raised his eyebrows slightly and continued to ask.<br/><br/>“If the Dragon Palace is not strong, we are prepared to destroy it.”<br/><br/>They continued to reply.<br/><br/>“Destroy Our Dragon Palace? are the three races prepared to send experts to destroy us?”<br/><br/>Wang Xian’s eyes flickered.<br/><br/>“Yes. Currently, the three races have gathered more than a thousand universe knights in the starry sky of the galaxy. Among them, there are two level five universe knights.”<br/><br/>“To ensure that we can destroy the Dragon Palace, we, the Golden Dragon Knight, are refining an acquired spiritual treasure. Once the refinement is completed, if there are no level-five universe knights in the Dragon Palace, we can easily destroy them.”<br/><br/>The Knights of the three races replied.<br/><br/>“It seems that they have decided to destroy our Dragon Palace?”<br/><br/>Wang Xian mumbled, “How long will it take for the Golden Dragon Knight to refine an acquired spiritual treasure?”<br/><br/>“I don’t know, but it will take at least one to two months.”<br/><br/>A universe knight from the horned seal race replied.<br/><br/>Wang Xian nodded his head slightly. He stared at the three level three universe knights and absorbed their souls.<br/><br/>Waves of memories surged into his mind. He sealed these memories and didn’t plan to read them for the time being.<br/><br/>“Hualala!”<br/><br/>Wang Xian pulled the chain in his hand lightly and destroyed them.<br/><br/>With a wave of his hand, he threw more than 20 corpses beside the dragon transformation pool of the Dragon Palace.<br/><br/>There were more than 20 corpses and six level-three universe knights. This was a lot of resources.<br/><br/>“Keep these divine kingdoms and let the devouring dragon devour them. Tell prime minister turtle that I will be leaving for a while. This time, I might be leaving for a longer period of time.”<br/><br/>Wang Xian ordered the halberd dragon guard at the side. He arrived at the teleportation formation of the Dragon Palace and disappeared in an instant.<br/><br/>When he reappeared, he had already arrived at the former location of the Heavenly Dragon Clan in the starry sky of Xingjiang.<br/><br/>After flying out of the Dragon Palace, Wang Xian read some information in his mind and flew directly in the direction of the Xingjiang clan.<br/><br/>“If I want to destroy the Dragon Palace, I can only make the first move.”<br/><br/>“Not only do I want to destroy all of you, I also want to go to the encirclement of Lu Xingkong and your lair. Even if I can’t destroy the horned seal race, the Sheji race and the Gemini race can still be easily destroyed.”<br/><br/>As Wang Xian flew, killing intent flickered in his eyes.<br/><br/>His strength had made a breakthrough, and the five elements millstone in his hand had also completed its advancement.<br/><br/>With his current strength, he could already go to most places in the universe.<br/><br/>This time, the horned seal race, the snake princess race, and the Gemini race wanted to destroy the Dragon Palace. It was just right for him to go around Lu Xingkong as well.<br/><br/>He would go and destroy the Gemini race and the snake princess race.<br/><br/>It was better to strike first!<br/><br/>A hint of killing intent flashed in Wang Xian’s eyes as he quickly shuttled through the starry sky.<br/><br/>With the uninitiated holy wings spread out, his speed had reached a terrifying level.<br/><br/>Originally, the journey would take seven to eight days. However, it only took him one day to reach the sky above the seven-colored river of the Xingjiang clan.<br/><br/>When he reached the sky, Wang Xian’s eyes flickered as he scanned his surroundings.<br/><br/>His gaze landed on a palace and he narrowed his eyes slightly.<br/><br/>According to the memories obtained in his mind, the experts of the three clans were all in this palace.<br/><br/>The palace was huge, comparable to a planet. This was once the main shrine of the Xingjiang clan.<br/><br/>“Whoosh!”<br/><br/>Wang Xian’s figure moved and flew down quickly.<br/><br/>Under his concealment, it was difficult for anyone below level five universe knights to discover him.<br/><br/>Coupled with his terrifying speed, level one or level two universe knights could not see his shadow at all.<br/><br/>“Dragon Eye Lock on all corners!”<br/><br/>Coming to the sky above the temple, Wang Xian slowly spread out his arms.<br/><br/>Chains covered the surroundings in an instant.<br/><br/>The terrifying blood-red chains completely covered the temple below.<br/><br/>His pupils were sparkling as his gaze landed on the main hall at the center.<br/><br/>Over there, the grand supreme elder of the horned seal race and the Golden Dragon Knight were all there.<br/><br/>His figure flashed, and he instantly arrived at the right side of the shrine and hid himself.<br/><br/>Hong! Hong! Hong<br/><br/>Just as he flew down, terrifying figures flew out of the shrine.<br/><br/>“Who are they?”<br/><br/>Their eyes revealed a serious and shocked expression.<br/><br/>In an instant, 1,100 universe knights floated in the sky.<br/><br/>“Kill A Level five universe knight first, then it’ll be easy!”<br/><br/>Wang Xian squinted his eyes when he saw this scene. He flapped his incipient saint wings and instantly attacked the first supreme elder of the horned seal race.<br/><br/>“Oh no!”<br/><br/>“Oh no!”<br/><br/>Sensing the terrifying aura coming from behind, the first supreme elder of the horned seal race in the sky felt his heart tighten and quickly looked down.<br/><br/>“Your reaction is too slow!”<br/><br/>A cold voice was heard and a Flaming Dragon Claw grabbed the first Supreme Elder.\t\t\t\t\t\t</div>", "images": {}, "success": true}