{"id": 239, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15072379.html", "title": "Chapter 3230 - 3230 3229. Exterminate The Twin Species", "volume": 3, "volume_title": "Volume 3", "body": "<h1>Chapter 3230 - 3230 3229. Exterminate The Twin Species</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\t3230 3229. Exterminate the twin species<br/><br/>Buzz<br/><br/>Crash<br/><br/>Wang Xian flapped his incipient saint wings and quickly shuttled through the surrounding starry sky.<br/><br/>A day later, he arrived at a planet. This starry sky was very strange.<br/><br/>Two planets were connected together.<br/><br/>Green trees grew in the void. These green trees were also connected together.<br/><br/>Even the huge star and Sun in the center were connected to each other.<br/><br/>This was a very special starry sky.<br/><br/>It was also this special starry sky that created an intermediate race, the Gemini race.<br/><br/>Although the Gemini race was not very strong in the surrounding starry sky, they still had a few billion years of foundation.<br/><br/>The Gemini race had many disciples, and the entire void was the domain of the Gemini race.<br/><br/>The number of stars occupied by the Gemini race alone numbered in the millions. The number of Gemini race had reached a terrifying level.<br/><br/>The special and special space had created this special race.<br/><br/>“It really is a place where water and soil nourish a person. Hehe.”<br/><br/>Wang Xian came to this starry space. In this space, he could feel a special and strange energy.<br/><br/>This kind of energy would have some effect on a person.<br/><br/>“There are people in the AI who refer to this place as the Gemini Domain. It seems like this is indeed the case.”<br/><br/>As Wang Xian spoke, he narrowed his eyes slightly and flew straight towards the main planet of the Gemini race according to the memories in his mind.<br/><br/>The main planet of the Gemini race was very special.<br/><br/>Most planets were solid while the starry sky of the Gemini race was like a hornet’s nest. It was densely packed and looked extremely shocking from afar.<br/><br/>The experts of the Gemini race lived in this Hornet’s nest.<br/><br/>“According to my memory, this planet is the most precious treasure of the Gemini race. The entire planet contains a terrifying wind attribute force. The closer to the center, the more experts there are of the Gemini race.”<br/><br/>Wang Xian’s gaze swept across the area.<br/><br/>He had to be careful.<br/><br/>After all, it was an elementary race in the universe.<br/><br/>His body moved, and his body began to turn illusory as he flew straight in.<br/><br/>What the Gemini race could confirm was that they did not have a level five universe knight.<br/><br/>This allowed Wang Xian to sneak in very smoothly.<br/><br/>With his concealment ability, only a level five universe knight or above could sense it.<br/><br/>It was located at the core of the entire planet of the Gemini race.<br/><br/>It was also the largest cave entrance in the center. After Wang Xian entered, he immediately sensed the strong wind attribute law energy.<br/><br/>The entire cave entrance was only a thousand kilometers in height. Looking up from below, one could see the green energy.<br/><br/>In the sky, there were some wind attribute trees and plants.<br/><br/>The scenery of the plants above was indeed a little strange.<br/><br/>However, the entire interior was very beautiful.<br/><br/>Wang Xian flapped his wings and flew rapidly into the cave.<br/><br/>The plants in the sky gave him the best cover.<br/><br/>As he flew into the cave, he soon saw many palaces.<br/><br/>The palaces were lined up in a row. At a glance, they looked exceptionally luxurious.<br/><br/>“It’s about time. We can start now.”<br/><br/>Just as he was about to reach the center, Wang Xian’s eyes sparkled.<br/><br/>He took out the five elements millstone. With a move of his palm, he positioned it in the sky above the five elements millstone. The fire god Dragon slowly extended his hand.<br/><br/>“Let’s attract all the experts from the Gemini race over first.”<br/><br/>He muttered to himself. With a wave of his arm, the five elements Millstone flew straight ahead.<br/><br/>“Roar! Roar! Roar!”<br/><br/>The next moment, the roar reverberated throughout the entire planet. A fire god Dragon swayed its huge body and roared furiously.<br/><br/>The Fire God Dragon’s power was not very strong. It was only comparable to a level four universe knight.<br/><br/>However, with the support of the five elements grinding mill, the fire god Dragon’s recovery and endurance had reached a terrifying level.<br/><br/>Boom<br/><br/>Under the control of Wang Xian, the fire god Dragon raised his head and unleashed a ball of terrifying flames towards the palace in front of him.<br/><br/>“What? What Happened?”<br/><br/>“Divine Dragon? Fire God Dragon? Why did a divine dragon suddenly appear in our Gemini Race?”<br/><br/>“Bastard, quick, destroy him!”<br/><br/>This was the core of the entire Gemini race. It was also the residence of countless experts of the Gemini race.<br/><br/>When a fire dragon suddenly appeared within them, the expressions of the great beings of the twin species changed drastically.<br/><br/>The Universe Knights immediately attacked the Fire Dragon.<br/><br/>Roar! Roar! Roar<br/><br/>The fire dragon swayed its huge body, and waves of terrifying flames attacked the universe knights.<br/><br/>“Oh no, this dragon is very powerful. Why did such a dragon suddenly appear here?”<br/><br/>“What the hell is going on?”<br/><br/>The Universe Knights’expressions changed drastically, and they roared in embarrassment.<br/><br/>“Roar!”<br/><br/>“Peng! Peng! Peng!”<br/><br/>In the sky, the fire god Dragon Tail, which was over 30,000 meters long, swept toward the Dozen Universe Knights.<br/><br/>“Dodge! Dodge!”<br/><br/>The Universe Knights of the twin races’expressions changed drastically.<br/><br/>Peng! Peng! Peng<br/><br/>However, five or six universe knights were killed instantly.<br/><br/>Hu! Hu! Hu<br/><br/>At this moment, the sound of rushing wind could be heard throughout the entire planet.<br/><br/>“What happened?”<br/><br/>“The highest alert is that there’s an enemy invasion!”<br/><br/>“Who dares to invade our twin races?”<br/><br/>Universe Knights of the twin races rushed toward them from the other caves.<br/><br/>When they saw the flaming fire dragon, their expressions changed.<br/><br/>“Why did a fire dragon suddenly appear on our side?”<br/><br/>A two-faced old man frowned and asked with a serious expression.<br/><br/>“Leader, we don’t know either. This fire dragon suddenly appeared in the sky, and it’s exactly the same as the legendary dragon. It should be a pure-blooded dragon!”<br/><br/>A two-faced old man flew over and said solemnly.<br/><br/>“Send someone to guard the surroundings and kill this fire god Dragon First!”<br/><br/>The leader of the twin races ordered coldly.<br/><br/>“It’s the leader!”<br/><br/>“Kill this fire god Dragon!”<br/><br/>The old man roared and ordered the universe knights around him.<br/><br/>“It’s the Supreme Elder!”<br/><br/>The Universe Knights responded immediately. In an instant, 700 to 800 universe knights attacked the Fire God Dragon.<br/><br/>The leader of the twin races gestured to the Great Beings around him and started to look around.<br/><br/>Suddenly, a fire god Dragon appeared. They had to be alert to see if there were any accomplices around or if there was a conspiracy.<br/><br/>“I wonder if I can destroy this twin species with the five elements millstone alone.”<br/><br/>Wang Xian hid in a corner and stared at the battle ahead with a cold gaze.<br/><br/>He had merely ordered a divine dragon from the five elements millstone to come out and fight. He wanted to attract all the experts from the twin species to come over.<br/><br/>Then, he would capture them all in one go!\t\t\t\t\t\t</div>", "images": {}, "success": true}