{"id": 236, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15072373.html", "title": "Chapter 3227 - Chapter 3227: 3226 Charged Into The Encirclement Of Lu Xingkong", "volume": 3, "volume_title": "Volume 3", "body": "<h1>Chapter 3227 - Chapter 3227: 3226 Charged Into The Encirclement Of Lu Xingkong</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 3227: 3226 charged into the encirclement of Lu Xingkong<br/><br/>“Bang!”<br/><br/>A terrifying attack came. Wang Xian’s Dragon Claw grabbed the body of the grand elder of the horned seal race.<br/><br/>“Scram!”<br/><br/>When the grand elder of the horned seal race saw this situation, his expression changed drastically. He roared in horror and a huge golden hammer appeared in his hand.<br/><br/>“Buzz!”<br/><br/>“Ahhhhh!”<br/><br/>However, at the next moment, an extremely terrifying power of flames surged into his body.<br/><br/>Fire countered metal. The first Supreme Elder’s body turned red instantly and his body trembled.<br/><br/>“This is bad!”<br/><br/>“Not good, first Supreme Elder!”<br/><br/>“Attack him!”<br/><br/>The thousands of universe knights beside the first supreme elder of the horned seal race had a drastic change of expression when they saw this scene.<br/><br/>Their eyes revealed a look of horror.<br/><br/>There was actually someone who suddenly attacked from below.<br/><br/>This made their hearts tighten. They waved the weapons in their hands and slashed at Wang Xian.<br/><br/>“Hahaha, do you think you can destroy our Dragon Palace?”<br/><br/>Wang Xian laughed out loud. His figure flashed as he grabbed the body of the chief elder of the horned seal race and easily dodged their attack.<br/><br/>“No!”<br/><br/>At this moment, the chief elder of the horned seal race, who was about to collapse, let out a desperate scream.<br/><br/>Wang Xian waved his arm and put his body away.<br/><br/>“What! That’s the Dragon King, the Dragon King of the Dragon Palace!”<br/><br/>“Damn it, he actually killed the first Supreme Elder!”<br/><br/>“Lord Protector, Help!”<br/><br/>In just a split second, when they saw the first supreme elder being killed, the universe knights were shocked.<br/><br/>The first supreme elder of the horned seal race was a level 5 universe knight.<br/><br/>He was killed by the Dragon King in an instant.<br/><br/>How was this possible!<br/><br/>Didn’t the Dragon King only have the strength of a level four universe knight?<br/><br/>Could it be that he had broken through?<br/><br/>Everyone’s expression was abnormally ugly. The group of knights from the Horned Seal race hurriedly looked down for help.<br/><br/>Their Golden Dragon Knight Protector didn’t come out immediately because he was refining the acquired Supreme Treasure.<br/><br/>“It’s your turn now!”<br/><br/>A level five universe knight was killed. Wang Xian had nothing to worry about now.<br/><br/>The Five Elements Millstone appeared above his head. He flapped his primaless sacred wings and charged towards more than 1,000 universe knights.<br/><br/>“Attack him!”<br/><br/>Seeing Wang Xian’s attack, the Universe Knights from the three races in the sky showed a look of fear. They immediately released a terrifying energy that poured towards him.<br/><br/>“Bang, Bang, Bang!”<br/><br/>The five elements grinding mill spun above Wang Xian’s head. The attacks were easily blocked.<br/><br/>“Roar!”<br/><br/>Wang Xian let out a low roar and transformed into the body of a divine dragon. The incomparably huge dragon tail swept towards them.<br/><br/>“Not good, Dodge immediately!”<br/><br/>“Dodge, Dodge quickly!”<br/><br/>The terrifying dragon tail suddenly attacked, causing everyone to reveal a look of horror.<br/><br/>The terrifying aura on the dragon tail made them feel suffocated.<br/><br/>“Bang, Bang, Bang!”<br/><br/>More than a hundred universe knights couldn’t Dodge in time and were swept by Wang Xian’s dragon tail. Their bodies were sent flying backward, and their vitality was almost gone.<br/><br/>“He is very strong. We are not his match.”<br/><br/>An elder of the twin species shouted in shock as his expression changed drastically.<br/><br/>“Isn’t the Dragon King a level four universe knight? How did he suddenly become a level five? Furthermore, he is such a terrifying level five powerhouse?”<br/><br/>The Lady of the Serpentine race roared with bloodshot eyes.<br/><br/>“Hehe, with your strength, you still want to destroy our Dragon Palace?”<br/><br/>Wang Xian said disdainfully. He swayed his huge dragon body and charged towards them.<br/><br/>“Clang!”<br/><br/>“Dragon King, you’re courting death!”<br/><br/>At this moment, a terrifying attack came from below.<br/><br/>An incomparably resplendent crown was emitting a dazzling golden glow. The swords and sabers on it were crossed as they attacked Wang Xian directly.<br/><br/>“Bang!”<br/><br/>Wang Xian squinted his eyes slightly when he saw the acquired Supreme Treasure that was attacking him.<br/><br/>“Roar! Roar! Roar!”<br/><br/>Without Wang Xian’s command and control, the five elements millstone in the sky let out a furious roar.<br/><br/>The entire five elements millstone spun and turned into a terrifying flame that smashed directly at the crown.<br/><br/>“Boom!”<br/><br/>An incomparably terrifying collision sound was heard. The crown that was at the level of an acquired supreme treasure fell directly downwards.<br/><br/>In this collision, the five elements millstone had the complete upper hand.<br/><br/>Of course, this was also the reason why this acquired Supreme Treasure had not been completely refined.<br/><br/>“What!”<br/><br/>Below, the figure of the Golden Dragon Knight appeared. When he saw that the crown had been knocked down, his expression changed drastically.<br/><br/>Even if this acquired supreme treasure had not been completely refined, he could still display some of its power.<br/><br/>However, he was actually at a disadvantage in the collision with the Dragon King’s treasure. This caused his pupils to constrict slightly.<br/><br/>“That’s it? I’ll Destroy You First!”<br/><br/>Wang Xian’s gaze locked onto the venerable Golden Dragon. He moved his body and extended his dragon claws to dive down.<br/><br/>His body was slowly emitting a terrifying power of flames.<br/><br/>The True Dragon’s dragon body could allow him to change the eight attributes in his body at will.<br/><br/>Under such circumstances, he could perfectly restrain his enemy.<br/><br/>“What speed and terrifying power. This Dragon King has broken through!”<br/><br/>Sensing the Dragon King who was charging at him, the expression of the venerable golden dragon changed drastically.<br/><br/>He could no longer sense the aura of the first Supreme Elder. In other words, the first supreme elder had been killed.<br/><br/>This made his heart sink slightly. A hint of panic appeared in his eyes.<br/><br/>“Scram!”<br/><br/>His body trembled. His entire body turned into a thousand meters in size. His long golden tail swept towards Wang Xian.<br/><br/>“HMPH!”<br/><br/>Wang Xian stretched out his dragon claw and clawed at his long golden tail.<br/><br/>“Bang!”<br/><br/>The Dragon Claw collided with the long golden tail. The five elements grinding mill landed on the dragon claw rapidly, and a surge of energy was added to it.<br/><br/>“Crack! Crack! Crack!”<br/><br/>The Dragon Claw grabbed the long tail. Wang Xian’s eyes revealed a cold expression as he flung it downwards.<br/><br/>“Bang! Bang! Bang!”<br/><br/>The shrine below instantly collapsed.<br/><br/>Wang Xian swayed his body and appeared below the venerable Golden Dragon in the next second.<br/><br/>“What a terrifying speed!”<br/><br/>The descending venerable Golden Dragon sensed the dragon king below him and his expression changed drastically.<br/><br/>“Divine Crown Protection!”<br/><br/>He growled in a low voice. The acquired Supreme Treasure Crown was above his head as a wave of golden laws enveloped his body.<br/><br/>“It’s useless!”<br/><br/>“Bang, Bang, Bang!”<br/><br/>Wang Xian looked at the venerable Golden Dragon who was enveloped by the golden glow. His dragon claws landed heavily on the crown.<br/><br/>“Roar!”<br/><br/>The five elements grinding on the fire god Dragon let out a roar. A terrifying pillar of fire shot out.<br/><br/>“Crack, crack, crack!”<br/><br/>The golden law surrounding him slowly cracked and collapsed.<br/><br/>“No, Dragon King, Stop!”<br/><br/>At this moment, the Venerable Golden Dragon revealed a look of fear in his eyes. He let out an involuntary roar.<br/><br/>“Peng!”<br/><br/>Wang Xian’s dragon claw penetrated the golden light defense and landed on his body. He clenched it tightly.<br/><br/>The Second Level 5 universe Knight of the Horned Seal race had died!<br/><br/>“Gulp!”<br/><br/>“This… this…”<br/><br/>In the sky, when the other knights of the three races saw Golden Dragon Knight being killed so quickly, their eyes revealed fear and despair.\t\t\t\t\t\t</div>", "images": {}, "success": true}