{"id": 234, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15072369.html", "title": "Chapter 3225 - Chapter 3225: 3224 Breakthrough", "volume": 3, "volume_title": "Volume 3", "body": "<h1>Chapter 3225 - Chapter 3225: 3224 Breakthrough</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 3225: 3224 breakthrough<br/><br/>“The resources this time are almost enough to improve myself!”<br/><br/>In the Dragon King Palace of the Dragon Palace, Wang Xian was looking at the information in front of him. His eyes were shining.<br/><br/>There were hundreds of treasures in the Divine Kingdom of universe knights, including the treasures in the Divine Kingdom of the Xingjiang clan’s patriarch.<br/><br/>This was a terrifying amount of resources.<br/><br/>These resources could produce more than 100 universe knights in the Dragon Palace.<br/><br/>Wang Xian roughly estimated that these resources were sufficient to allow him to achieve a breakthrough in his strength.<br/><br/>“Very good, I can achieve a breakthrough on my own. I should be able to achieve a breakthrough with the Five Elements Millstone!”<br/><br/>“It’s a pity that I didn’t obtain the corpse of the Tianhai Dragon King and his acquired Supreme Treasure this time.”<br/><br/>He mumbled.<br/><br/>The corpse of the Tianhai Dragon King might be able to produce a golden dragon in the Dragon Palace. Needless to say, the power of the acquired Supreme Treasure was beyond description.<br/><br/>“Let’s first increase my strength and the Five Elements Millstone.”<br/><br/>He waved his arm, and the acquired Supreme Treasure, Chi Yang, and the other seventy or eighty acquired Supreme Treasures of the five elements appeared at the side.<br/><br/>The five elements millstone floated and began to devour.<br/><br/>Chi Yang, the Supreme Treasure of the Xingjiang clan leader, was almost one step away from breaking through to the realm of the acquired Supreme Treasure.<br/><br/>After devouring so many spirit treasures, the five elements millstone was almost 100% certain that it would be able to improve.<br/><br/>At that time, the five elements millstone would have the power to kill a level five knight.<br/><br/>“Roar!”<br/><br/>He growled, and a large amount of resources entered his stomach and turned into dragon qi.<br/><br/>In the Dragon Transformation Pool of the Dragon Palace, all the members of the Dragon Palace were improving.<br/><br/>Next to the Dragon Palace was another Dragon Palace. At this moment, ao crab was leading a few of his subordinates to devour the treasures.<br/><br/>“That Dragon Palace is so arrogant. They actually took away all the resources and treasures. Humph!”<br/><br/>While the Dragon Palace was upgrading, nearly 1,000 experts were sitting in a palace of the Xingjiang clan.<br/><br/>The leader was an expert of the horned seal race with a single horn and a long tail.<br/><br/>On the left and right were the warriors of the Snake Lady Race and the twin races.<br/><br/>In two days, the reinforcements of the three races had all arrived.<br/><br/>Any one of the three races would be invincible in the Star River Galaxy.<br/><br/>The total number of universe knights they had as reinforcements reached over 1,000.<br/><br/>One could imagine how terrifying their strength was.<br/><br/>“The most precious thing is the Dragon Palace. It’s the Dragon Palace of a powerful true dragon!”<br/><br/>The Lady of the Snake Lady Race said with a burning gaze.<br/><br/>“The Dragon Palace isn’t weak. Their great beings working together can pin me down. And that Dragon King can pin down two or three universe knights at Level 4. His speed is terrifying.”<br/><br/>Golden Dragon Knight said solemnly, looking at the great beings of the same race beside him.<br/><br/>“So, in order to destroy that Dragon Palace, at least three universe knight level five Great Beings are needed?”<br/><br/>“To be safe, four universe knight level five Great Beings are better.”<br/><br/>The horned seal race great being sitting beside Golden Dragon Knight said indifferently.<br/><br/>“If there are four of us, we can basically destroy the Dragon Palace completely. However, Golden Dragon Knight has obtained a acquired true treasure. If we refine it, it shouldn’t be a problem for one person to fight two or three of the same level.”<br/><br/>The eyes of the first elder of the twin species flickered as he said.<br/><br/>“Huh?”<br/><br/>His words slightly startled the knight at the center of the Horned Seal race, and he looked at Golden Dragon Knight.<br/><br/>“That’s right. It’s a very powerful acquired true treasure. If I refine it, it might take some time.”<br/><br/>Golden Dragon Knight’s eyes were shining, and he nodded.<br/><br/>“Congratulations, Golden Dragon Protector. Acquired true treasures are very rare.”<br/><br/>The great being from the horned seal race said enviously, “If golden dragon protector can refine an acquired true treasure, then we don’t need four fifth-level knights. Just the two of us are enough.”<br/><br/>The power of one acquired Supreme Treasure was enough for one person to fight against two or three of the same level.<br/><br/>A powerful acquired supreme treasure was undoubtedly a terrifying trump card for them.<br/><br/>However, acquired supreme treasures were extremely rare. If they wanted to obtain them, they had to go to the heaven opening and desolate continent.<br/><br/>“We can, but we still can’t underestimate the Dragon Palace.”<br/><br/>Golden Dragon Knight nodded. “I’ll refine the acquired true treasure during this period of time. You guys go and test the strength of the Dragon Palace.”<br/><br/>“Sure, be prepared.”<br/><br/>Another great being of the horned seal race, a level five great being, nodded and glanced at the other two races.<br/><br/>They nodded in agreement.<br/><br/>The Horned Seal Race’s strength was one level higher than theirs. They naturally wouldn’t refute Golden Dragon Knight’s opinion.<br/><br/>“Roar Roar Roar!”<br/><br/>At the same time, a dragon roar sounded from within the Dragon Palace’s Dragon King Hall.<br/><br/>“Ding, congratulations to host for breaking through to the ninth level void God Emperor!”<br/><br/>“Ding, Congratulations to host for comprehending the Laws of the Divine Dragon True Dragon Dragon Body.”<br/><br/>Along with the system’s voice, Wang Xian raised his head. His eyes revealed an excited expression.<br/><br/>He curled up and glanced at his body.<br/><br/>“Buzz Buzz Buzz!”<br/><br/>With a thought, his body began to change.<br/><br/>The eight-colored dragon scales began to transform. Slowly, eight rays of light circulated, forming an extremely terrifying flame.<br/><br/>Following that, the flame turned into a stream of water. The stream of water turned into a golden light and the golden light turned into a yellow color.<br/><br/>Name: Wang Xian<br/><br/>Race: Yin-yang five Elemental Divine Dragon (man-dragon unity)<br/><br/>Grade: void God Emperor Rank 9(Divine Dragon transformation eighth form)<br/><br/>Origin: 1% (99% needed for the next breakthrough)<br/><br/>Divine ability: ruling the water tribe (ruling the water tribe below one’s level)<br/><br/>Devouring creatures (devouring creatures to extract origin)<br/><br/>Control of the five elements<br/><br/>Cultivation Method: Divine Dragon Transformation<br/><br/>Divine ability: soul capturing, spirit attaching<br/><br/>Laws and divine abilities: Dragon Eye Lock, Five Elements Dragon Claw, Yin-yang realm breaking, eight luminaries Dragon Scale, Divine Dragon Shadow, Heavenly Dragon Eight Tribes, Dragon Tomb, Cloud Dragon Soaring, True Dragon body<br/><br/>Aspect: five elemental great mill, Dragon Kingdom in Palm, Dragon head under the heavens, Dragon body of ten thousand miles, Yin-yang dual polarity, Yin-yang five elemental alms bowl, divine dragon tail swing!<br/><br/>Laws of control: metal, wood, water, fire, Earth, light, dark wind<br/><br/>Divine Kingdom: Dragon Palace<br/><br/>Dragon Palace in possession: acquired.<br/><br/>Scanning his own attributes, Wang Xian was full of smiles as the attributes in his body kept rotating.<br/><br/>“This true dragon body’s Abhijna is very strong. When it is activated, the energy of the other attributes will be converted into one type. This way, it will be easier to form a counter in battle.”<br/><br/>Wang Xian mumbled as his eyes sparkled.<br/><br/>Crack! Crack! Crack<br/><br/>His body moved and he slowly transformed into his human form.<br/><br/>His gaze swept across the five elements millstone at the side.<br/><br/>It might still take some time for the five elements millstone to improve.<br/><br/>His body moved and he came to the front of the five elements millstone to help refine a bunch of numinous treasures.<br/><br/>“Eh!”<br/><br/>Time passed day by day. After the five elements Millstone had swallowed the Scarlet Sun acquired Numinous Treasure, it had already made a breakthrough.<br/><br/>When he was still refining and absorbing other acquired spiritual treasures, the increase in his strength had greatly increased his sensing ability.<br/><br/>Through his sensing ability, he realized that there were experts hiding around the dragon palace as if they were sizing up something.<br/><br/>“Who is plotting something? The race of the Horned Seal? or?”<br/><br/>Wang Xian mumbled and disappeared in an instant.\t\t\t\t\t\t</div>", "images": {}, "success": true}