{"id": 237, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15072375.html", "title": "Chapter 3228 - 3228 3227 Charged Into The Encirclement Of Lu Xing Kong", "volume": 3, "volume_title": "Volume 3", "body": "<h1>Chapter 3228 - 3228 3227 Charged Into The Encirclement Of Lu Xing Kong</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\t3228 3227 charged into the encirclement of Lu Xing Kong<br/><br/>“It’s your turn!”<br/><br/>Wang Xian kept the corpse of the Golden Dragon Knight and the acquired true treasure.<br/><br/>He squinted his eyes and looked at the Universe Knights of the three races who were filled with fear.<br/><br/>“Run!”<br/><br/>More than a thousand universe knights were filled with fear at this moment. They wanted to escape in fear.<br/><br/>Their figures flashed and they wanted to escape immediately.<br/><br/>Hualala<br/><br/>However, when their figures became illusory, the chains around them trembled and prevented them from returning to their own divine kingdom.<br/><br/>This made all of them look horrified. Their eyes swept across the blood-red chains around them.<br/><br/>“Breakthrough!”<br/><br/>A Universe Knight roared and fled frantically.<br/><br/>“Whoosh!”<br/><br/>Wang Xian waved his arm and the five elements Millstone flew out. A grayish long river of annihilation swept towards them.<br/><br/>The terrifying long river seemed as though it wanted to destroy everything in the world, enveloping all of them.<br/><br/>The experts of the three races revealed a terrified expression.<br/><br/>“Ahhhhh!”<br/><br/>When the energy of annihilation landed on their bodies, they let out a miserable scream.<br/><br/>There were more than 1,000 universe knights from the three races, and the strongest one was a level four universe knight.<br/><br/>Under the attack of the five elements millstone, they could not resist at all.<br/><br/>Very soon, one by one, the universe knights were wiped out. There was no sign of life left.<br/><br/>Wang Xian flew over and waved his arm, sending all the corpses back to the Dragon Palace.<br/><br/>He did not order them to summon his universe god country over because he was afraid of alerting them.<br/><br/>The moment the three races became wary, they would be in great trouble for his next move.<br/><br/>Wang Xian mumbled. His body moved and he flew in a certain direction at a terrifying speed.<br/><br/>There was no teleportation formation in the surrounding starry sky. He had to fly in order to get there.<br/><br/>With his speed, it would take him a few days.<br/><br/>The surrounding starry sky was just a step away from the dazzling heaven-splitting chaotic land.<br/><br/>That was the dazzling land of the entire universe, the origin of the universe.<br/><br/>The heaven-splitting chaotic land was huge. There were all kinds of secret realms, grotto-heavens, blessed lands, and places of races. There were countless of them.<br/><br/>The spiritual energy in the universe was all emitted from the heaven opening primal continent.<br/><br/>One could imagine how terrifying that place was.<br/><br/>And the surrounding starry sky was also incomparably huge. Countless races were gathered there.<br/><br/>The weakest were the primary races of the universe, and the strongest were the intermediate races of the universe.<br/><br/>There were also many sects and sects.<br/><br/>All of them were terrifying experts.<br/><br/>According to some rough estimates, there were hundreds of thousands of universe’s primary and intermediate races surrounding Lu Xing Kong, or even more.<br/><br/>Hundreds of thousands of the weakest primary races, what kind of concept was that?<br/><br/>Of course, the area surrounding Lu Xing Kong was also very vast.<br/><br/>The Starry River Starry Sky was already very big, there were 50 to 60 universe’s primary races.<br/><br/>But the Starry River Starry Sky was nothing compared to the surrounding Lu Xing Kong.<br/><br/>“However, my invincible strength as a universe knight at level five would be considered strong in the surrounding starry sky.”<br/><br/>Wang Xian mumbled and smiled.<br/><br/>While absorbing the memories in his mind, he flew in the starry sky.<br/><br/>Although there were more powerful races in the surrounding starry sky, the truly powerful forces had already set foot on the primeval continent.<br/><br/>There, an intermediate race with a universe knight level six great being could attempt to land.<br/><br/>If one had the power of a universe knight level seven, 80% of them would be able to land on the vast land and establish a race there.<br/><br/>Of course, this also depended on where one chose to land.<br/><br/>There were countless grotto-heavens and blessed lands on the vast land. There were also three, six, and nine levels of grotto-heavens and blessed lands. There were more forces competing for the stronger grotto-heavens and blessed lands.<br/><br/>For example, the Snake Princess Race and the Gemini race were both at the edge of the surrounding starry sky.<br/><br/>The strength of the horned seal race could only be considered average when compared to the surrounding starry sky.<br/><br/>“It’s easy to exterminate the snake princess race. It’s also easy to exterminate the Gemini race. However, it might be a little difficult for the horned seal race. It might even be impossible to exterminate them.”<br/><br/>Wang Xian mumbled to himself as he shuttled through the starry sky rapidly.<br/><br/>Time passed day by day. On the third day, the surrounding starry sky underwent an earth-shattering change.<br/><br/>Wang Xian looked at his surroundings with an extremely astonished expression.<br/><br/>In the surrounding starry sky, he could see a huge battleship shuttling through the void from time to time.<br/><br/>There were also ships that were similar to ancient sailing ships that were shuttling through the void.<br/><br/>Wang Xian even saw flying vessels that were similar to dragon boats that were wandering in the starry sky.<br/><br/>There were all kinds of large flying divine artifacts.<br/><br/>He looked at the bustling starry sky with a shocked expression on his face.<br/><br/>In the Milky Way and the starry sky of the galaxy, he had never seen such a resplendent scene.<br/><br/>All kinds of flying artifacts could be seen almost everywhere.<br/><br/>Other than these flying artifacts, he could also see all kinds of powerful demonic beasts and desolate beast mounts.<br/><br/>His eyes sparkled.<br/><br/>“What a prosperous starry sky. What a bright starry sky. Some flying treasures are even at the level of acquired Numinous Treasures.”<br/><br/>“Moreover, from our senses, the number of universe knights around us is no less than ten.”<br/><br/>He mumbled.<br/><br/>This could be said to be the center of the universe.<br/><br/>There were hundreds of thousands of powerful races and trillions of living beings.<br/><br/>The number of strong people was naturally terrifying.<br/><br/>“Roar!”<br/><br/>Wang Xian continued to fly. An hour later, a roar suddenly came from the front.<br/><br/>He saw more than a dozen battleships and spaceships in the surroundings quickly making way for him.<br/><br/>“Everyone, please make way. Please forgive me if I have offended you.”<br/><br/>“Quick, quick, quick, catch it. We can’t let it escape. Dragon scale chains!”<br/><br/>A delicate voice was heard. Soon after, Wang Xian sensed a rush of savage aura.<br/><br/>He looked over and was slightly shocked.<br/><br/>At the front, a terrifying gigantic beast that was at least 100,000 meters in size was flying over.<br/><br/>The gigantic beast was similar to a sea turtle, but it was completely different.<br/><br/>It had several heads, and there were five in Wang Xian’s line of sight alone.<br/><br/>This was a space beast!<br/><br/>What shocked him even more was that there were more than ten divine dragons swaying their huge bodies around this space beast. They were using huge nets and chains to capture this space beast.<br/><br/>“Other than one of them, the rest are not purebred divine dragons. However, they are still very powerful dragon species!”<br/><br/>“I didn’t expect to see a powerhouse of the divine dragon lineage when I just stepped into this space.”<br/><br/>Wang Xian swept his gaze over, and his eyes revealed a look of astonishment.<br/><br/>It was a space behemoth, a pure-bred water divine dragon.<br/><br/>This encirclement of the starry sky really surprised him.<br/><br/>“It’s the people from the Water Dragon Palace. They are actually hunting that dragon savagely ten-headed space behemoth!”<br/><br/>“The experts from the Water Dragon Palace. Hiss, they are too powerful. They have a high chance of capturing that dragon savagely ten-headed space behemoth!”<br/><br/>Not far away from Wang Xian, there were sounds of exclamations.\t\t\t\t\t\t</div>", "images": {}, "success": true}