{"id": 231, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15072363.html", "title": "Chapter 3222 - Chapter 3222: 3221 Had Gone Too Far", "volume": 3, "volume_title": "Volume 3", "body": "<h1>Chapter 3222 - Chapter 3222: 3221 Had Gone Too Far</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 3222: 3221 had gone too far<br/><br/>“Support Lord Golden Dragon!”<br/><br/>The two women of the Snake Lady Race heard the roar of the Horned XI race warrior and their expressions changed.<br/><br/>The Horned Xi Race’s Golden Dragon Knight was called over by them and was on their side.<br/><br/>Hearing the roar of rage, the two of them moved and immediately flew into the sky.<br/><br/>The other knights’expressions changed, not knowing what to do.<br/><br/>The seven to eight experts from the elementary universe races who were with the snake princess clan hesitated for a moment before following behind.<br/><br/>Crash<br/><br/>At this moment, Wang Xian, who had attacked the Golden Dragon Knight, immediately looked down and narrowed his eyes.<br/><br/>He flapped his incipient saint wings and flew down at a terrifying speed.<br/><br/>His gaze was locked onto the group of knights following behind the two women of the Snake Princess clan.<br/><br/>The two women of the Snake Lady clan were only at the level of a Level 3 universe knight. However, with the addition of that strange sculpture, it would be a little troublesome for Wang Xian to kill them.<br/><br/>Therefore, he locked onto the 70 to 80 universe knights behind them.<br/><br/>Among this group of universe knights, the strongest one was only at the Level 2 universe knight.<br/><br/>In the clouds, their vision was already obstructed.<br/><br/>“Whoosh!”<br/><br/>At this moment, the two women of the Sheji clan, who were flying towards them, felt a voice attacking them.<br/><br/>Their eyes focused, and they held the statue in their hands, emitting a strange energy.<br/><br/>“Not good, that Dragon King is attacking us.”<br/><br/>At this moment, a voice of fear came from behind them.<br/><br/>“Not good!”<br/><br/>The two women from the Sheji clan had a slight change in expression.<br/><br/>“PFFT! PFFT! PFFT!”<br/><br/>“Ahhhhh!”<br/><br/>Wang Xian arrived at the group of Paragons at a terrifying speed. His dragon claws slashed across the bodies of the paragons.<br/><br/>Buzz<br/><br/>A dragon tomb appeared below them and covered them.<br/><br/>“Five Elements Annihilation River!”<br/><br/>Wang Xian opened his mouth and a gray torrent swept across 70 to 80 universe knights.<br/><br/>“No, no!”<br/><br/>“Run, run!”<br/><br/>“Bang, Bang, Bang!”<br/><br/>Some of the universe knights let out desperate roars and fled in all directions.<br/><br/>However, Wang Xian was even faster.<br/><br/>As the river of destruction swept across, Wang Xian’s five elements dragon claws covered everyone and knocked them into the dragon tomb.<br/><br/>The terrifying energy in the dragon tomb quickly destroyed their last chance of survival.<br/><br/>“Dragon King, you are courting death!”<br/><br/>The two women from the Serpentine clan reacted. They turned around and let out a sharp sound.<br/><br/>On their sculpture, a black poisonous snake flew out and let out a terrifying roar.<br/><br/>“It’s a little slow!”<br/><br/>Wang Xian swept his gaze over and a mocking expression appeared on his face.<br/><br/>He waved his arm and stored 70 to 80 corpses.<br/><br/>“You, the primary races of the universe, are simply asking for your own destruction. Our Dragon Palace is not the Tianhai Dragon King.”<br/><br/>Wang Xian easily dodged the attacks of the two venomous snakes. With a flap of his incipient saint wings, he flew to the side and said calmly.<br/><br/>“The universe knights who followed the Sheji race were killed!”<br/><br/>“Hiss… this… What should we do? What should we do!”<br/><br/>“What’s the situation with the Horned Seal Race’s Lord? Without him to deal with the Dragon King, we’ll all be killed by him sooner or later!”<br/><br/>“The Golden Dragon Knight is completely restrained, we’re not the Dragon Palace’s Dragon King’s match.”<br/><br/>Below, the Knights of the Starriver universe primary race had extremely ugly expressions.<br/><br/>There were already 70 to 80 knights that had died at the Dragon Palace’s Dragon King’s hands.<br/><br/>Even though they weren’t from their race, they were on the same side now.<br/><br/>The Fox mourns the death of the Hare!<br/><br/>They might be next.<br/><br/>Furthermore, the strength that the dragon palace had displayed made them feel fear.<br/><br/>They were from the starry skies of Star River. If the Dragon Palace were to take revenge on them in the future, with the terrifying strength of the Dragon Palace, they could easily destroy them.<br/><br/>“I didn’t expect that the great beings from the horned seal race, twin race, and snake race couldn’t be a match for the Dragon Palace. That Dragon King has already killed nearly 100 universe knights. His power is too terrifying.”<br/><br/>“Fortunately, we didn’t participate. The power of the Dragon Palace is much more terrifying than that of the Sky Sea Dragon King.”<br/><br/>“In the battle to kill the Sky Sea Dragon King, the Dragon King and the others played a crucial role. In the end, they only gave the Dragon Palace 20% of the spoils of war. This time, they are in big trouble. Let alone the spoils of war, who knows how many knights will die.”<br/><br/>The surrounding warriors of the universe primary races looked at the battle in the sky with shock on their faces.<br/><br/>This time, all the powers had underestimated the Dragon Palace, and they had paid a heavy price for it.<br/><br/>It was hard to say how the spoils of war would be distributed.<br/><br/>“The Star River clan’s spoils of war… we have suffered so much that we don’t want them anymore.”<br/><br/>The two elders of the twin races, the Knights of the Winter Moon race, looked at each other and said with an unsightly expression.<br/><br/>The Dragon King of the Dragon Palace was so fast that they couldn’t beat him at all. They could only be killed passively.<br/><br/>If they continued to fight, they might die.<br/><br/>Even if the entire Starriver clan’s resources were given to them, they didn’t dare to fight for it.<br/><br/>They could already tell that their side would not be able to win this war.<br/><br/>The words of the expert from the bitter non-race caused all of their expressions to change slightly.<br/><br/>“We…”<br/><br/>The expression of the expert from the Dongyue race changed as he had the intention to retreat.<br/><br/>“Hehe!”<br/><br/>Wang Xian’s gaze swept across the group of them. His body moved and he did not attack again. Instead, he flew to the side.<br/><br/>There, there were still a group of corpses of the Xingjiang clan and great demons that had yet to be collected.<br/><br/>He flew over and collected all the corpses into his bag.<br/><br/>The rain and fog in the middle disappeared. The Gemini race, Mech, Snake Lady Race and the rest gathered together. Behind them, there were nearly 200 universe knights.<br/><br/>Wang Xian floated in the air and stared at them with a mocking gaze.<br/><br/>“Continue, or get lost immediately!”<br/><br/>He swept his gaze across the crowd and asked indifferently.<br/><br/>“Dragon King, Your Dragon Palace doesn’t have the ability to make us leave.”<br/><br/>The two elders of the Gemini race heard his words and said coldly.<br/><br/>“You can kill them, but you can’t Kill Us. We will still get a share of the resources this time!”<br/><br/>The mech stared at Wang Xian and echoed coldly.<br/><br/>“It doesn’t matter. No matter how much resources you take away, I will blame it on the races behind you. If they don’t compensate our Dragon Palace, I will destroy them.”<br/><br/>Wang Xian smiled and his tone was filled with hostility.<br/><br/>“Dragon King, you… Don’t go too far!”<br/><br/>When the experts from the elementary races in the universe heard his words, their expressions changed drastically. They clenched their fists and roared in a low voice.<br/><br/>“So what if I bully you? You dared to besiege our Dragon Palace. It’s already merciful of me not to destroy you all.”<br/><br/>Wang Xian swept his gaze across them. His eyes were filled with mockery and disdain.<br/><br/>One had to pay the price for being enemies with the Dragon Palace.<br/><br/>It would be difficult for them to stop the horned seal race, the Gemini race, the Sheji race, and the mech. Some treasures would definitely be obtained by them.<br/><br/>But it didn’t matter. They could just get them back from the lower races.\t\t\t\t\t\t</div>", "images": {}, "success": true}