{"id": 238, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15072377.html", "title": "Chapter 3229 - 3229 3228 Ferocious Dragon 10-Headed Space Beast", "volume": 3, "volume_title": "Volume 3", "body": "<h1>Chapter 3229 - 3229 3228 Ferocious Dragon 10-Headed Space Beast</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\t3229 3228 ferocious dragon 10-headed space beast<br/><br/>In the boundless space surrounding the land, a 100,000 m large space beast was escaping.<br/><br/>It had 10 heads and a huge body, giving off a prehistoric aura.<br/><br/>Over 10 godly dragons surrounded it, wanting to hunt it down. This shocked the people on the surrounding battleships and spaceships.<br/><br/>This Dragon Savage 10 Head Space Beast was a very powerful existence.<br/><br/>Looking at its power, it had the strength of a universe knight level 3 or 4.<br/><br/>However, the surrounding water dragon palace warriors weren’t weak either. Some of them had at least the strength of a universe Knight Level 4.<br/><br/>Especially that water god Dragon, it was the strongest.<br/><br/>Blue chains completely bound the Dragon Savage 10 Head Space Beast, a law net formed from water attribute energy trapped it.<br/><br/>“Roar Roar Roar!”<br/><br/>The ten-headed Dragon Space Beast shook its huge body and struggled to break free.<br/><br/>“Beast, behave yourself!”<br/><br/>The delicate voice continued to ring out. A water god Dragon shook its huge body and flew directly to the sky above the ten-headed Dragon Space Beast. Her body shook, and water pillars fell from the sky, they directly attacked the ten-headed Dragon Space Beast.<br/><br/>“Roar! Roar! Roar!”<br/><br/>The ten ferocious dragon-headed space beasts were in pain and shook their bodies crazily. Waves of earth-elemental nomological power spread out in all directions.<br/><br/>“Watch Out!”<br/><br/>A Dragon God roared and they tried to block the attacks.<br/><br/>A few weaker members of the Water Dragon Palace couldn’t help but fly backward.<br/><br/>“Roar! Roar! Roar!”<br/><br/>At this moment, the ten ferocious dragon-headed space beast let out a furious roar again.<br/><br/>This roar was extremely dull and uncomfortable.<br/><br/>Balls that were 100 meters in size were spat out from the ten dragon heads.<br/><br/>“Be careful, it’s black meteorites. Their attack power is very terrifying!”<br/><br/>A cry sounded and the Water Dragon God in the sky warned.<br/><br/>Ten black meteorites that looked like black holes attacked the ten people from the Water Dragon Palace.<br/><br/>“Huh?”<br/><br/>Wang Xian, who was standing at the side, saw the black meteorites that were attacking him. He raised his eyebrows slightly when he saw a dragon species flying in his direction.<br/><br/>According to his calculations, the dragon species in front of him would definitely not be able to dodge this attack.<br/><br/>With the terrifying attack of this space beast, this dragon would probably perish.<br/><br/>“Shuiyun, be careful! Dodge!”<br/><br/>The exclamations of the other dragon species could be heard from the side as they flew rapidly towards him.<br/><br/>The expression of the dragon species changed drastically when he saw the incoming black meteorite.<br/><br/>Crash<br/><br/>Wang Xian raised his eyebrows slightly. After hesitating for a moment, he flapped his divine wings and instantly appeared beside the water god Dragon.<br/><br/>His arm turned into a dragon claw and grabbed him to the side.<br/><br/>Boom<br/><br/>The terrifying black meteorite shot out from the side.<br/><br/>“What a powerful attack. As expected of the Space Behemoth.”<br/><br/>Wang Xian sensed the terrifying energy from the black meteorite and was astonished.<br/><br/>Space behemoths were the behemoths in the universe. Each of them had terrifying strength when they matured.<br/><br/>It was almost impossible to suppress a space beast of the same level.<br/><br/>Even a warrior would find it difficult to suppress a space beast.<br/><br/>This space beast was able to fight back despite being surrounded by over 10 powerful dragon species, one could imagine how terrifying its strength was.<br/><br/>However, this 10-headed space beast couldn’t compare to Xiao Zhai.<br/><br/>Now that Xiao Zhai Xiao Lan had the combat strength of a level four universe knight, their body size had already reached over a thousand kilometers.<br/><br/>Xiao Zhai Xiao Lan’s body size at the later stage could be comparable to the size of the stars.<br/><br/>“Thank you for your help, Sir!”<br/><br/>The Water Dragon Palace’s powerhouse who was rescued by Wang Xian had a look of a survivor.<br/><br/>He quickly thanked Wang Xian.<br/><br/>“No need, it’s nothing!”<br/><br/>Wang Xian shook his head and retracted his dragon claw.<br/><br/>“HMM? This sir is also a member of the Divine Dragon Lineage?”<br/><br/>When the expert from the Water Dragon Palace saw Wang Xian’s palm, his eyes were filled with astonishment.<br/><br/>He could sense the might of the divine dragon on the Dragon Claw.<br/><br/>Wang Xian smiled and nodded.<br/><br/>“Thank you for your help, brother. Our Water Dragon Palace is extremely grateful.”<br/><br/>In the sky above the ten ferocious dragons, the water dragon God thanked Wang Xian.<br/><br/>She held a huge water rope in her hand. The water rope bound all ten heads of the ten ferocious dragons.<br/><br/>Wang Xian took a look from the side. He knew a little about the water dragon palace from the universe’s AI.<br/><br/>Before the rise of the Dragon Palace, there were nine more famous divine dragons in the universe.<br/><br/>The Weakest Divine Dragon clan and the rest of the divine dragon lineages had all reached the level of mid-level races in the universe.<br/><br/>As for the Water Dragon Palace, among the other eight forces of the Divine Dragon lineage, they were neither strong nor weak.<br/><br/>The strongest divine dragon lineage called themselves the ancestral dragon lineage. They had already entered the heaven-splitting primordial land and had also stepped into the ranks of the high-level races in the universe.<br/><br/>Wang Xian was very curious about the powers of these divine dragon lineages.<br/><br/>Currently, there were not many purebred divine dragons in the Dragon Palace. As for the water god Dragon in front of him, the Dragon Palace did not have one.<br/><br/>“According to the information on the AI, the strongest person in the water god Dragon lineage seems to be a level five universe knight.”<br/><br/>Wang Xian muttered.<br/><br/>Boom<br/><br/>Roar Roar Roar<br/><br/>At this moment, in front of them, the ferocious ten-headed space beast let out a pained cry. Its body was also riddled with injuries.<br/><br/>It could be seen that the battle between the Water Dragon Palace and this cosmic beast had been going on for a long time.<br/><br/>“It’s going to be suppressed.”<br/><br/>Wang Xian muttered as he saw the heads of the ten-headed cosmic beast lowering slowly.<br/><br/>“It’s a success.”<br/><br/>At the side, the dragon of the Water Dragon Palace, who was similar to the water god Dragon but had a completely different head, looked excited when he saw this scene.<br/><br/>“Sir, you have saved my life. This is for you. Welcome to our Water Dragon Palace as a guest in the future. I will help to subdue this space behemoth first.”<br/><br/>He spoke to Wang Xian respectfully. He opened his mouth and spat out a water dragon bead. Then, he flew toward the ten ferocious dragon heads excitedly.<br/><br/>“HMM?”<br/><br/>Wang Xian looked at the dragon bead and raised his eyebrows with a smile.<br/><br/>A level two water dragon pearl of a universe knight. Although it was not a purebred dragon pearl, it was still pretty good.<br/><br/>“I can go to the Water Dragon Palace to take a look.”<br/><br/>Wang Xian mumbled. He was also curious about the other divine dragons.<br/><br/>Since the Water Dragon Palace had a purebred divine dragon, it must have obtained a huge opportunity and the inheritance of the Divine Dragon.<br/><br/>Seeing that they were doing their best to suppress the ferocious ten-headed space beast, Wang Xian did not continue to watch.<br/><br/>He moved his body and continued forward.<br/><br/>The main objective of this trip was the three major races.<br/><br/>He flapped his incipient saint wings and shuttled through the surrounding starry skies at a terrifying speed.<br/><br/>His first target was the Gemini race!\t\t\t\t\t\t</div>", "images": {}, "success": true}