{"id": 232, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15072365.html", "title": "Chapter 3223 - Chapter 3223: 3222 Dragon Palace Warriors Arrived", "volume": 3, "volume_title": "Volume 3", "body": "<h1>Chapter 3223 - Chapter 3223: 3222 Dragon Palace Warriors Arrived</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 3223: 3222 Dragon Palace warriors arrived<br/><br/>“Hu hu, Hu Hu!”<br/><br/>In the Rising Dragon Gathering Square, the universe knights from the low-level races in the starry sky were breathing heavily.<br/><br/>They had paid a huge price to summon the twin races and the Snake Lady Race to tide over this crisis.<br/><br/>Now, a true dragon had come after the destruction of an inferior dragon.<br/><br/>The Dragon King of the Dragon Palace’s strength made their expressions extremely ugly.<br/><br/>If the Dragon Palace really wanted them to pay a certain price and take out some treasures to compensate, they would be destroyed if they didn’t agree.<br/><br/>This wasn’t much different from submitting to the Tianhai Dragon King.<br/><br/>They could either take out treasures to compensate or escape from the starry sky.<br/><br/>As for the others?<br/><br/>The experts of the horned seal race and the twin races couldn’t protect them forever.<br/><br/>The Dragon Palace and the Tianhai Dragon King were slightly different.<br/><br/>The Tianhai Dragon King was arrogant and extremely powerful.<br/><br/>Although the Dragon Palace was powerful, they always had a plan.<br/><br/>If they really wanted to destroy them, they wouldn’t be able to withstand it with their strength.<br/><br/>Unless the Dragon Palace was destroyed.<br/><br/>“My Lord!”<br/><br/>They looked at the experts of the twin species and the snake princess race with an extremely ugly expression.<br/><br/>The two elders of the Gemini race also had ugly expressions.<br/><br/>“Dragon King of the Dragon Palace, do you know that you are making an enemy out of our Gemini race, the snake princess race, and the Horned Imperial Pig?”<br/><br/>“Have you considered the consequences of making an enemy out of us?”<br/><br/>The two elders of the Gemini race stared at Wang Xian coldly and threatened him.<br/><br/>“I would like to see what the consequences will be.”<br/><br/>As Wang Xian spoke, he narrowed his eyes slightly, he swept his gaze across the two elders of the Gemini race and said, “If I remember correctly, the strongest person in your race is only a level four universe knight. Have you ever thought of the consequences of offending our Dragon Palace?”<br/><br/>Threatening? Who Wouldn’t know that!<br/><br/>The Gemini race was an intermediate race in the universe, but they were only the weakest intermediate race in the universe.<br/><br/>They were the strongest at level four universe knight level, and the Dragon Palace’s current strength was no problem for them to fight against more than a dozen level four universe knights.<br/><br/>Not to mention their strength after this upgrade in resources.<br/><br/>It was not certain who would be eliminated.<br/><br/>His words caused the faces of the two elders of the Gemini Race to change slightly.<br/><br/>“Haha, a bunch of trash. If you want to take over our Dragon Palace’s resources today, our Dragon Palace is not afraid of starting a war with you!”<br/><br/>Wang Xian laughed out loud and flew to a spot about 10,000 meters in front of him.<br/><br/>“Damn it!”<br/><br/>Seeing that the Dragon King was almost right in front of them and feeling the thick provocation, their faces turned gloomy.<br/><br/>“Holy Armor Knight, we are no match for the Dragon King. We will go back first.”<br/><br/>A Universe Knight said to the mech. His figure was slightly illusory.<br/><br/>“Go, go, that Dragon King’s speed is too terrifying!”<br/><br/>Beside him, a few other universe knights were illusory.<br/><br/>If they couldn’t win the battle, staying here would only lead to death. Naturally, they wouldn’t seek death.<br/><br/>The Knights started to flee and returned to their God countries in an instant.<br/><br/>Sacred Armor Knight’s home port swept by, his expression unchanging. He looked at the two elders of the twin race and the two women of the Snake Lady Race.<br/><br/>“If you want to leave, then leave.”<br/><br/>The two elders said.<br/><br/>This battle wasn’t something they could participate in anymore.<br/><br/>“Yes, yes!”<br/><br/>The Knights hesitated and decided to leave.<br/><br/>They couldn’t participate in this battle anymore. If they continued, they would be courting death.<br/><br/>Sou Sou Sou<br/><br/>At this moment, figures emitting powerful auras flew over.<br/><br/>There were 300 of them, each of them exuding the power of a universe knight.<br/><br/>Feeling this terrifying aura, the expressions of the two elders of the twin races and the two women of the Snake Lady Race changed.<br/><br/>“This is a great being from the Dragon Palace, a great being from the Dragon Palace!”<br/><br/>Looking at the terrifying wind god Dragon swaying in front of them, their expressions were unusually solemn.<br/><br/>Just this terrifying power alone made them feel a strong pressure.<br/><br/>One had to know that they had the combat power of a level four universe knight.<br/><br/>“How did the Great Beings from the Dragon Palace arrive so quickly? Aren’t they at the Milky Way? How did they rush over so quickly?”<br/><br/>The two elders of the twin races’expressions changed.<br/><br/>They had also reported the situation here to their clan. Now, their clan had sent their experts over.<br/><br/>However, it would take at least a few days to get here from the encirclement of Lu Xingkong.<br/><br/>However, the people of the Dragon Palace had arrived so quickly.<br/><br/>Didn’t they say that the teleportation array from Xingjiang to the Milky Way had been destroyed?<br/><br/>Once the powerhouses of the Dragon Palace arrived, all the resources would be taken away by them.<br/><br/>“Dragon King, we agree with you. Your Dragon Palace will get 50% .”<br/><br/>The two elders of the twin species looked at each other and said with changing expressions.<br/><br/>“Are You Idiots?”<br/><br/>Upon hearing his words, Wang Xian laughed mockingly. He looked at the members of the Dragon Palace who were flying over and immediately gave an order, “Gather all the treasures of the Xingjiang clan. You Don’t have to participate in the battle here.”<br/><br/>“It’s the Dragon King!”<br/><br/>The leaders of the Dragon Palace immediately responded when they heard Wang Xian’s order.<br/><br/>“Dragon King, are you trying to monopolize everything? Are you ignoring us completely?”<br/><br/>The two women from the Sheji clan said with a gloomy expression as blood dripped from their faces.<br/><br/>“Stop the people from the Dragon Palace. Our horned seal race can ensure your safety.”<br/><br/>In the sky, the horned seal race saw that the experts from the Dragon Palace had arrived. Their expressions changed slightly and they immediately shouted.<br/><br/>They were already restrained. If no one was restraining the experts from the Dragon Palace, they wouldn’t be able to obtain any treasures.<br/><br/>The two elders from the twin species frowned and looked at the people from the winter moon race beside them.<br/><br/>“Hehe, you can try to stop them. Let’s see if you will be destroyed by the Dragon Palace in the future.”<br/><br/>Wang Xian smiled gently and swept his gaze across the forces of the winter moon race.<br/><br/>Regardless of whether their race could stop the powerhouses of the Dragon Palace, the Dragon Palace would definitely destroy them if they dared to stop them.<br/><br/>Even the horned seal race could not protect them.<br/><br/>Gulp<br/><br/>The Universe Knights of the Winter Moon race looked at the 300 or so powerhouses of the Dragon Palace before looking at the powerful Dragon King. They pursed their lips.<br/><br/>Becoming enemies with the Dragon Palace?<br/><br/>No matter what the outcome was, they could forget about staying in the starry sky.<br/><br/>“Sir, we…”<br/><br/>The expression of the winter moon race’s Paragon changed as he looked at the two elders of the Gemini race in front of him.<br/><br/>The Gemini Race’s Sheji race and that saint-armored paragon had gloomy expressions. They knew that they did not want to be enemies with the Dragon Palace.<br/><br/>And at this moment, more than 300 experts of the Dragon Palace had already entered the Starriver clan and started to collect treasures.<br/><br/>The Dragon Wizard that had specially brought over started to search the Cosmos God nation with the help of the treasures.<br/><br/>Wang Xian floated there quietly with a smile on his face, sealing off all of them.\t\t\t\t\t\t</div>", "images": {}, "success": true}