{"id": 233, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15072367.html", "title": "Chapter 3224 - Chapter 3224: The 3223 Treasure Was In His Hands", "volume": 3, "volume_title": "Volume 3", "body": "<h1>Chapter 3224 - Chapter 3224: The 3223 Treasure Was In His Hands</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 3224: The 3223 treasure was in his hands<br/><br/>One person could hold the fort and no one could open it!<br/><br/>Wang Xian stood there calmly. The experts from the Gemini race, the snake princess race, the Saint Armor Venerable, and the other forces looked at him with an awkward expression.<br/><br/>The elementary races in the starry sky didn’t dare to make a move.<br/><br/>The strength displayed by the Dragon Palace made them feel fearful.<br/><br/>“Dragon King of the Dragon Palace, are you going to make an enemy out of us?”<br/><br/>“The Dragon Palace must think of the price to pay for making an enemy out of us!”<br/><br/>In the sky, the experts of the horned seal race, who were completely restrained by the Heaven Formation Willow God and the rest, roared furiously.<br/><br/>“Today, you can either defeat US and fight for the resources, or get lost. As for making an enemy out of you, our Dragon Palace is not afraid at all.”<br/><br/>Wang Xian looked at the venerable Golden Dragon of the Horned Seal race in the sky and said faintly.<br/><br/>“Roar!”<br/><br/>“Good, good, good. Just you wait!”<br/><br/>When the Golden Dragon Knight heard Wang Xian’s words, a cold killing intent appeared on his face.<br/><br/>He moved and retreated to the back immediately.<br/><br/>Now, there was no longer a need to continue the battle.<br/><br/>They could not fight against the Dragon Palace. They could only watch helplessly as they plundered a large number of treasures.<br/><br/>“This… the experts of the horned seal race are completely unable to fight against the experts of the Dragon Palace.”<br/><br/>“The strength of the Dragon Palace is simply too strong. I really did not expect that their strength would be so terrifying.”<br/><br/>“Another faction of the divine dragon lineage has risen.”<br/><br/>The experts of the other races who were not participating in the battle in the starry sky of the surrounding galaxy were filled with shock when they saw this scene.<br/><br/>The Dragon Palace had single-handedly blocked the experts from the three races and the terrifying mecha.<br/><br/>“If they split the spoils of war like the Dragon Palace said at the beginning, they can still get a lot of treasures. Now…”<br/><br/>Some people pursed their lips and glanced at the venerable Golden Dragon and the others.<br/><br/>Maybe it wasn’t because they were greedy, but they didn’t expect the Dragon Palace’s strength to be so terrifying.<br/><br/>“Venerable Golden Dragon!”<br/><br/>The two women of the Serpentine clan moved and flew toward the Venerable Golden Dragon.<br/><br/>“Yes!”<br/><br/>The Venerable Golden Dragon nodded with a gloomy face and looked down.<br/><br/>The experts of the Dragon Palace were looting all kinds of treasures.<br/><br/>The starriver clan was not weak. The treasures that their clan had were very tempting to even the horned seal clan.<br/><br/>Now, seeing that the treasures that originally belonged to them had been taken away by others, his heart was burning with anger.<br/><br/>“The people of the Dragon Palace are too arrogant. They don’t put us in their eyes at all.”<br/><br/>A woman said with a changing expression.<br/><br/>“It will take a few days for our people to reach here. During this time, they will be able to take away all the treasures here.”<br/><br/>The other snake lady’s expression was not good either.<br/><br/>They thought it would be a huge harvest, but they did not expect it to be like this.<br/><br/>“Everyone, Goodbye!”<br/><br/>From the side, the Sacred Armor Knight shook his head when he saw this. He moved and left immediately.<br/><br/>The Sacred Armor Knight was a lone wolf in the universe. He did not have his own race.<br/><br/>He was not going to participate in this situation.<br/><br/>It might not be beneficial for him to continue participating.<br/><br/>As he spoke, his body flashed and he left.<br/><br/>“Sir Golden Dragon Knight, we…”<br/><br/>The two elders of the twin species flew over and said with an ugly expression.<br/><br/>“The Tianhai Dragon King’s Dragon Palace is a huge treasure, and with the Xingjiang clan’s treasure…”<br/><br/>The Golden Dragon Venerable’s expression also changed slightly.<br/><br/>A former Divine Dragon, a former Dragon King. Even if the Sky Sea Dragon Palace didn’t have any treasures, the Sky Sea Dragon Palace’s value alone was extremely terrifying.<br/><br/>With the entire Star River clan’s treasure, this resource was too terrifying.<br/><br/>“That Dragon Palace’s rate of improvement is very fast. Their Dragon Palace definitely has a powerful divine dragon inheritance.”<br/><br/>The two women of the Snake Princess Clan said.<br/><br/>Now, they were considering whether or not to attack the Dragon Palace.<br/><br/>Once they did, they had to destroy the Dragon Palace. Otherwise, the revenge of a faction of the Divine Dragon bloodline would be very terrifying.<br/><br/>Especially since the Dragon Palace had a purebred divine dragon.<br/><br/>With a purebred divine dragon, their potential in the future was much greater than theirs.<br/><br/>“Let’s investigate the situation of the Dragon Palace first before making a decision!”<br/><br/>After seeing the terrifying power of the Dragon Palace, the Golden Dragon Knight didn’t dare to start a war rashly.<br/><br/>Even though their horned seal race was a mid level race in the universe, they weren’t too strong.<br/><br/>Compared to the powerful races in the surrounding starry skies, there was still a huge gap.<br/><br/>There weren’t many universe Knight Level 5 Great Beings in their race.<br/><br/>They wouldn’t make a move rashly before they had the confidence to destroy the Dragon Palace.<br/><br/>The Gemini race and the Sheji race were slightly silent.<br/><br/>If the horned seal race didn’t make a move, it would be very difficult for them to destroy the Dragon Palace with their Race’s strength.<br/><br/>“Damn the Dragon Palace!”<br/><br/>The sheji race’s two women looked around with dark expressions.<br/><br/>This time, they came for the Dragon Blood and the Dragon Palace. In the end, they only obtained the corpse of a Yilong.<br/><br/>The Venerable Golden Dragon and the rest did not continue to attack. Wang Xian and the rest were floating in the void and locked onto them.<br/><br/>Time passed little by little. The members of the Dragon Palace had obtained a large number of treasures.<br/><br/>None of the Cosmos God kingdoms could find them.<br/><br/>“Dragon King, we have basically obtained everything that we can gather.”<br/><br/>Ten hours later, the leaders of the Dragon Palace walked over excitedly.<br/><br/>“Very good. Let’s go back.”<br/><br/>Wang Xian smiled and waved at them.<br/><br/>“Let’s go back!”<br/><br/>The leaders of the dragon palace shouted softly and slowly disappeared.<br/><br/>They left behind the Golden Dragon Venerable and the rest, who looked a little embarrassed and gloomy.<br/><br/>“Dragon King, there are a lot of treasures in the Starriver clan’s treasury. Most importantly, there are a large number of treasures in the Sky Sea Dragon Palace. They should have been given to the Sky Sea Dragon King by the great demons and the Starriver clan.”<br/><br/>“These resources would not pose a problem for the Dragon Palace to increase the number of universe knights by more than 100.”<br/><br/>“There are also the resources in the Cosmos God Nation and the Cosmos God nation, which could increase the number of universe knights by around 200.”<br/><br/>Prime Minister Gui and the rest finished counting the resources and revealed an excited expression.<br/><br/>“There are around 550 corpses of universe knights here. Among them, there is one level four universe knight and seven or eight level three universe knights.”<br/><br/>Wang Xian waved his arm and took out all the corpses. He was smiling.<br/><br/>This time, the Dragon Palace had gained more than the three races.<br/><br/>The Starriver clan had lost more than 300 universe knights this time, along with the great demons and the ones he killed later.<br/><br/>There was a total of more than 500.<br/><br/>These corpses could increase the combat strength of the Dragon Palace by at least 500 universe knights.<br/><br/>“After this, the Dragon Palace will have the strength of an intermediate race in the universe.”<br/><br/>Wang Xian’s eyes were shining.\t\t\t\t\t\t</div>", "images": {}, "success": true}