{"id": 241, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15072383.html", "title": "Chapter 3232 - 3232 3231 Pairs Of Life And Death", "volume": 3, "volume_title": "Volume 3", "body": "<h1>Chapter 3232 - 3232 3231 Pairs Of Life And Death</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\t3232 3231 pairs of life and death<br/><br/>“It’s too late to know now!”<br/><br/>Wang Xian stared at the experts of the Gemini race with a cold look in his eyes.<br/><br/>“Roar! Roar! Roar!”<br/><br/>He let out an angry roar. He swayed his huge divine dragon body and attacked the experts of the Gemini race directly.<br/><br/>The dragon scales on his body glowed and transformed into a terrifying fire divine dragon that swept towards them.<br/><br/>“Oh no, all the experts of the twin species, defend!”<br/><br/>When the tribe leader of the twin species saw this scene, his face revealed a look of horror as he shouted in horror.<br/><br/>The fire god Dragon that they had spent a huge price to defeat was actually just a treasure of the Dragon King.<br/><br/>Now that the Dragon King had taken action personally, how terrifying would that be?<br/><br/>His expression changed drastically as his gaze swept across the surrounding chains. His body moved and he did not attack Wang Xian. Instead, he attacked the blood-red chains.<br/><br/>He could feel a strange energy from the chains. This energy could stop them from escaping in an instant.<br/><br/>Whoosh<br/><br/>When he attacked the chains, the five elements Millstone attacked him directly.<br/><br/>The Five Elements Millstone spun and contained a terrifying power.<br/><br/>This power was not something that the Gemini tribe leader could withstand.<br/><br/>Weng<br/><br/>Feeling the power of the five elements millstone, he was overwhelmed with shock.<br/><br/>Just now, only a dozen universe knight level four great beings of the twin races had been able to suppress it. Now, he was no match for it.<br/><br/>The green tree in his hand swayed with the green law energy and went straight for the Five Elements Millstone.<br/><br/>However, on the five elements millstone, a fire dragon suddenly poked out. The fire dragon raised its huge head and attacked the green tree.<br/><br/>“Ka Ka!”<br/><br/>“No!”<br/><br/>Feeling the power of the Five Elements Millstone, the Gemini tribe leader’s face revealed a look of despair.<br/><br/>After a miserable cry, his body was covered by the Five Elements Millstone, and his life force completely disappeared.<br/><br/>“Clan leader!”<br/><br/>“Clan leader!”<br/><br/>In the sky, everyone heard the blood-curdling scream of the clan leader. A look of horror appeared on their faces.<br/><br/>“Dragon Tomb, suppress!”<br/><br/>Wang Xian swept his gaze across. A cold expression appeared in his eyes. With a wave of his dragon claws, an incomparably huge dragon tomb appeared below them.<br/><br/>Above them, the coffin lid of the dragon tomb was pressing down on all of them.<br/><br/>A terrifying suction force came from the dragon tomb.<br/><br/>“Not good, Dodge!”<br/><br/>“We’re not his match. Run, run, run as much as you can. We’ll avenge our brothers in the future!”<br/><br/>Terrified voices sounded around them. The death of their patriarch made them lose their will to fight.<br/><br/>They also knew that they were no match for the Dragon King of the Dragon Palace.<br/><br/>The entire twin species was no match for the Dragon King of the Dragon Palace.<br/><br/>They moved one by one and quickly fled to their surroundings.<br/><br/>However, under the attack of the Dragon Tomb, more than 300 universe knights were suppressed in an instant.<br/><br/>“You want to escape? None of you can escape!”<br/><br/>Wang Xian looked around with contempt in his eyes.<br/><br/>The purpose of gathering them here was to capture all of them in one go.<br/><br/>“Dragon Eye Lock on all corners, Lock!”<br/><br/>“Five elements millstone, river of annihilation!”<br/><br/>Wang Xian let out a low roar and the dense chains around him began to shrink.<br/><br/>Five Divine Dragons on the five elements millstone raised their heads and spat out five elemental laws.<br/><br/>The five elemental laws interweaved and formed a grayish river of annihilation.<br/><br/>The river of annihilation engulfed all the experts of the twin species.<br/><br/>“No!”<br/><br/>Under the horrifying attack of the life-extinguishing force, the great beings of the twin species let out desperate roars.<br/><br/>“Bang, Bang, Bang!”<br/><br/>One by one, the corpses fell to the ground. After more than 10 seconds, more than 900 universe knights were all dead.<br/><br/>Wang Xian swept his gaze across and revealed a smile.<br/><br/>Buzz<br/><br/>With a move of his palm, an altar appeared in front of him.<br/><br/>“An lie, bring the heaven array over!”<br/><br/>With a thought, a voice sounded from within the Dragon Palace.<br/><br/>“It’s the Dragon King!”<br/><br/>An lie nodded respectfully within the Dragon Palace. Ten seconds later, the figures of the dark intense heaven array and the rest appeared in front of him.<br/><br/>“Collect all these corpses. Heaven Array, search the surroundings of their Cosmos God Nation!”<br/><br/>Wang Xian immediately ordered them.<br/><br/>“It’s the Dragon King!”<br/><br/>SKY array looked around with excitement in his eyes. “Dragon King, with so many corpses, our dragon palace can increase the combat strength of a few level five universe knights.”<br/><br/>“En, you should improve first. Also, let Xiao Lan and the rest improve as well.”<br/><br/>Wang Xian said.<br/><br/>Xiao Lan’s small house and the rest’s combat strength were still very abnormal. Their improvement would have a huge effect on the dragon palace.<br/><br/>Furthermore, it would be better to have a large war beast when traveling through the surrounding starry sky.<br/><br/>Xiao Lan’s small house was just right.<br/><br/>“It’s the Dragon King!”<br/><br/>The sky array nodded and immediately used the array formation to search for the God countries of those universe knights.<br/><br/>An lie scanned his surroundings and began to search for treasures.<br/><br/>Currently, an lie only had the combat strength of a level three void God Emperor. He was considered the weakest in the Dragon Palace.<br/><br/>Although his ability was rather perverse, it was not of much use to the Dragon Palace.<br/><br/>Unfortunately, he had yet to find some devil spirit altars that could help him increase his strength.<br/><br/>Wang Xian hovered around and searched for some treasures. All acquired spiritual treasures with the five elements attributes were absorbed by the five elements grinding mill.<br/><br/>When he encountered those with the light and dark attributes, he was considering whether to create a powerful yin-yang Dragon Plate?<br/><br/>Currently, the yin-yang Dragon Plate that was formed solely by relying on his own energy was of little value.<br/><br/>Time passed by little by little. What happened on the planet of the Gemini race caused a huge commotion on the Gemini race’s side.<br/><br/>Countless members of the Gemini race rushed over and surrounded the planet.<br/><br/>Looking at their main planet, a look of shock appeared in their eyes.<br/><br/>Looking from the outside, the entire planet was in chaos. The auras of the experts within their race had all disappeared.<br/><br/>Inside, there were still terrifying aftershocks from the battle.<br/><br/>Even peak void God emperor experts did not dare to approach.<br/><br/>“What happened within our Gemini Race?”<br/><br/>More and more experts gathered around and shouted with faces full of shock.<br/><br/>“Hong Hong Hong!”<br/><br/>However, two days later, the entire planet suddenly collapsed and flew towards the surrounding void space.<br/><br/>“From today onwards, there will be no more Gemini race. If the Gemini race dares to establish a race again, they will continue to come and destroy us!”<br/><br/>An ice-cold voice resounded in the void space.<br/><br/>In the surrounding area, the bodies of the experts from the twin races trembled, their faces filled with shock.<br/><br/>“Who is it? How can our twin races be exterminated!”<br/><br/>“Who dares to spout nonsense?”<br/><br/>The faces of the elite disciples from the twin races who had been surrounding the area and did not dare to enter changed drastically when they heard this. Their faces were filled with disbelief as they roared.<br/><br/>“Boom!”<br/><br/>However, in the next moment, an incomparably huge and terrifying flaming dragon claw descended from the sky and covered the elite twin race experts.\t\t\t\t\t\t</div>", "images": {}, "success": true}