{"id": 246, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15072393.html", "title": "Chapter 3237 - 3237 3236 The Friendship Of The Water Dragon Palace", "volume": 3, "volume_title": "Volume 3", "body": "<h1>Chapter 3237 - 3237 3236 The Friendship Of The Water Dragon Palace</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\t3237 3236 the friendship of the Water Dragon Palace<br/><br/>“Bastard, you’ve ruined my plan. You’re courting death. No matter where you run to in the universe, I will destroy you and kill your entire family!”<br/><br/>A sinister voice was emitted from the mouth of the Princess of the Water Dragon Palace. At this moment, her aura had undergone an earth-shattering change.<br/><br/>She stared at Wang Xian with her eyes filled with fury.<br/><br/>Her plan had actually been ruined by this fellow.<br/><br/>This was a plan that he had prepared for a long time!<br/><br/>When the Water Dragon Queen saw this scene, her expression changed drastically.<br/><br/>“Fire Dragon Lord, get out of my daughter’s body immediately!”<br/><br/>She clenched her fists tightly and shouted with reddened eyes.<br/><br/>“Hahaha, Water Dragon Queen, if Your Water Dragon Palace is willing to submit to our fire Dragon Palace, I can consider letting your daughter go. Otherwise, you will only get a corpse!”<br/><br/>The Princess of the Water Dragon Palace stared at the Water Dragon Queen with a grim expression as she roared ferociously.<br/><br/>“Do you think that’s possible? Fire Dragon Lord, if anything happens to my daughter, I Will Make Your Fire Dragon Palace pay a painful price, even if we have to fight to the death!”<br/><br/>The eyes of the water dragon queen were filled with killing intent as she roared.<br/><br/>“Then let’s give it a try. Water Dragon Queen, I Will Destroy Your Water Dragon Palace very soon. And you, you detestable fellow, I will crush your bones and Scatter Your Ashes!”<br/><br/>The Princess of the Water Dragon Palace roared ferociously. Her gaze landed fiercely on Wang Xian once again.<br/><br/>“Get out of my daughter’s body!”<br/><br/>Water Dragon Queen’s expression was abnormally ugly. She moved her body and instantly appeared beside her daughter.<br/><br/>“Hahaha, you can only get one corpse!”<br/><br/>Seeing Water Dragon Queen coming to her side, the Princess of the Water Dragon Palace didn’t move at all. She spoke in a sinister tone.<br/><br/>Buzz<br/><br/>A terrifying flame shot out from her body. The body of the water dragon princess began to crack.<br/><br/>“No!”<br/><br/>“Kill my entire family? Grind my bones and Scatter My Ashes?”<br/><br/>Wang Xian smiled coldly when he heard this. His eyes sparkled when he saw that the Water Dragon Queen was trying her best to prevent the flames from spilling out.<br/><br/>The result of her method would not change.<br/><br/>Buzz<br/><br/>“Water Dragon Queen, leave it to me!”<br/><br/>Wang Xian waved his arm and the five elements Millstone flew towards the head of the Water Dragon Princess.<br/><br/>Roar! Roar<br/><br/>The Five Divine Dragons on the Millstone let out a low roar as the five elements revolved. The flames that shot out from the body of the Water Dragon Princess were converted by the five elements and eventually converted into water energy that flowed into her body.<br/><br/>“Eh?”<br/><br/>The water dragon queen was slightly shocked when she saw this scene. She quickly withdrew her palm and looked at the five elements millstone in shock.<br/><br/>The five elements revolved. Fire gave birth to Earth, Earth gave birth to gold, and gold gave birth to water.<br/><br/>The water energy entered the Water Dragon Palace Princess’body.<br/><br/>The remaining flames in her body were transformed into water-type energy through the five elements millstone and entered her body.<br/><br/>This formed a cycle, and the fire energy within completely disappeared.<br/><br/>“Ling long, Ling long!”<br/><br/>At this moment, a voice filled with shock and anger rang out. The Water Dragon King appeared at the side with an anxious look on his face.<br/><br/>“Husband!”<br/><br/>The Water Dragon Queen hurriedly pulled his arm, indicating for him to stop talking.<br/><br/>The Water Dragon King’s body trembled slightly. His eyes were filled with anger and worry as he stared at his daughter.<br/><br/>Buzz<br/><br/>Wang Xian looked at her and moved his body. He came before the Princess of the Water Dragon Palace. With a move of his palm, the Fuchang tree and the endless wood branches slowly landed on her body.<br/><br/>The Fuchang tree and the endless wood were targeted at the soul aspect. They were used to remove the remnant soul of the Fire Dragon Lord in her body.<br/><br/>Buzz<br/><br/>The radiance of the Fuchang tree and the endless wood enveloped the head of the Princess of the Water Dragon Palace, causing her slightly ferocious face to disappear slowly.<br/><br/>Crack<br/><br/>She smacked her lips and fell to the side as though she was in a deep sleep.<br/><br/>Wang Xian was slightly speechless as he looked at her. He extended his hand to support her body.<br/><br/>The flames that were seeping out from her body had gradually disappeared. Under the circulation of the five elements, even the injuries in her body had completely recovered.<br/><br/>“Ling long! Ling long!”<br/><br/>The Water Dragon King and the Water Dragon Queen walked over immediately with an excited look on their faces.<br/><br/>“Phew, it’s good that you’re alright. It’s good that you’re Alright!”<br/><br/>The Water Dragon King took a look and heaved a heavy sigh of relief.<br/><br/>“Father, I… I seem to have been controlled by someone?”<br/><br/>At this moment, Shui Linglong’s eyelashes fluttered. She opened her eyes and felt a little lost.<br/><br/>She knew everything that happened just now, but it felt like a dream!<br/><br/>She couldn’t tell the truth.<br/><br/>“It’s good that you’re Alright!”<br/><br/>The Water Dragon King touched his daughter’s head and said softly.<br/><br/>Wang Xian looked at the dazed Princess of the Water Dragon Palace and shook his head speechlessly.<br/><br/>“Thank you, young master. Thank you so much. If it weren’t for you, we really can’t imagine what the consequences would be.”<br/><br/>The Water Dragon Queen walked over and thanked him with some lingering fear.<br/><br/>They never expected that the last time the Fire Dragon Palace robbed their space behemoth, they had planted such a terrifying seed.<br/><br/>It was probably because of this plan that they snatched the space beast.<br/><br/>Once their daughter was controlled and took away the dragon token, the fire dragon master would be able to open the water dragon palace and enter freely.<br/><br/>The consequences were unimaginable to them.<br/><br/>In fact, it would be a disaster for them.<br/><br/>“No need, it’s just a piece of cake for me!”<br/><br/>Wang Xian shook his head nonchalantly.<br/><br/>He didn’t expect to encounter such a situation.<br/><br/>“Phew, thank you for saving my daughter. Thank you!”<br/><br/>The Water Dragon King walked over and thanked Wang Xian profusely.<br/><br/>Wang Xian continued to shake his head.<br/><br/>“I haven’t had the chance to ask this young master for his name. I’m really sorry!”<br/><br/>The Water Dragon Queen bowed to him apologetically.<br/><br/>Ever since Wang Xian came in, they had been on high alert to prevent him from being a member of the Fire God Palace.<br/><br/>If it weren’t for him, the incident just now would have been a huge blow to the water dragon palace and them.<br/><br/>“You can just call me Wang Xian. I’m also a member of the Divine Dragon lineage.”<br/><br/>As Wang Xian spoke, he accepted their gratitude.<br/><br/>He had indeed helped them to tide over a considerable crisis.<br/><br/>“Thank you, Big Brother. I’ve seen you before. You’re the one who suppressed the ten-headed space behemoth, Long Zheng, last time.”<br/><br/>At the side, Shui Linglong looked at Wang Xian with a twinkle in her eyes and said in surprise.<br/><br/>“Yes!”<br/><br/>Wang Xian nodded. “I didn’t expect that the space beast was snatched away by someone.”<br/><br/>“It’s all because of those bastards!”<br/><br/>Shui Linglong nodded. “Thank you for what happened just now. If it weren’t for you, we would be in big trouble.”<br/><br/>“Hehe, Linglong, you really have to thank young master Wang Xian. If it weren’t for him saving you, mother wouldn’t be able to do anything about it.”<br/><br/>The Water Dragon Queen smiled and looked at Wang Xian. “Young master Wang, let’s Go in and have a seat. This time, our water dragon palace really has to thank you.”<br/><br/>“HMM, alright. I’m here to take a look at the water dragon palace and see some people with the bloodline of the Divine Dragon.”<br/><br/>Wang Xian nodded.\t\t\t\t\t\t</div>", "images": {}, "success": true}