{"id": 248, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15072397.html", "title": "Chapter 3239 - 3239 3238 Took Part In The Battle", "volume": 3, "volume_title": "Volume 3", "body": "<h1>Chapter 3239 - 3239 3238 Took Part In The Battle</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\t3239 3238 took part in the battle<br/><br/>“How is it? Our Water Dragon Palace is not bad, right?”<br/><br/>In the Water Dragon Palace, Shui Linglong brought him around with a smile on her face.<br/><br/>“It’s very beautiful!”<br/><br/>Wang Xian nodded and said sincerely.<br/><br/>The Water Dragon Palace was very exquisite. There were all kinds of sub-dragons and aquatic creatures living in it.<br/><br/>It was much more exquisite than the Dragon Palace. After all, there were only those dragon species in the Dragon Palace.<br/><br/>“There are still some fun things below the Dragon King Palace. Let’s go, I’ll bring you there.”<br/><br/>As Shui Linglong spoke, she brought Wang Xian inside.<br/><br/>“Dragon King, Dragon Queen, we have discovered the Dragon Eagle Legion and the Fire Cloud Legion of the Fire Dragon Palace around the Dragon Palace. There are also Netherclaw and Ghost Dragon. The people from the four legions are scattered around the Water Dragon Palace.”<br/><br/>“There are disciples who have flown back and have been attacked by them.”<br/><br/>When they arrived at the Dragon King’s Palace, they saw dozens of sub-dragons of the Water Dragon Palace reporting the news.<br/><br/>Shui Linglong brought him in suddenly, causing the sub-dragons to be slightly stunned.<br/><br/>They looked at Wang Xian in astonishment.<br/><br/>However, they knew their princess very well. They were not too surprised by her sudden appearance.<br/><br/>“The Fire Dragon Palace and the Devil Dragon Clan are going to war with us!”<br/><br/>“The Dragon Eagle Legion of the Fire Dragon Palace is good at Scouting, and the Fire Cloud, Hell Claw, and Ghost Dragon are all good at assassinations. They are going to lock down the Water Dragon Palace!”<br/><br/>On the Dragon Throne, the Water Dragon King said coldly.<br/><br/>“Water Dragon King, with our strength, we are no match for the four legions of the Fire Dragon Palace!”<br/><br/>An elder below replied with a solemn expression.<br/><br/>“In terms of overall strength, the Fire Dragon Palace is stronger than us, and the Devil Dragon bloodline is not weaker than us. Now that their most elite Dragon Army is surrounding us, our West Water Division and the Hidden Water Division can’t do anything about it.”<br/><br/>The old woman beside him also said with an embarrassed expression.<br/><br/>The Hidden Water Division and the West Water Division were the most powerful legions of the Water Dragon Palace, and they were also powerful dragons.<br/><br/>The number of the two legions wasn’t much, only about 500.<br/><br/>“Seal the Water Dragon Palace. They can’t stay around the Water Dragon Palace forever. We can afford to waste time with them.”<br/><br/>The Water Dragon Queen said with a sullen face.<br/><br/>The group of dragons nodded slightly.<br/><br/>There was only one way.<br/><br/>They were self-sufficient in the Water Dragon Palace. The Water Dragon Palace’s defense was almost invincible. They were not worried that the other party would attack them.<br/><br/>Although they felt extremely aggrieved, there was nothing they could do about it.<br/><br/>Wang Xian heard their conversation and his eyes sparkled.<br/><br/>The two divine dragons were at war with the Water Dragon Palace?<br/><br/>“Let’s go, let’s go. We don’t have to worry about these things.”<br/><br/>Shui Linglong also heard her parents’words. She pulled him to the back nonchalantly.<br/><br/>Although she was a purebred divine dragon, she had no influence on this battle situation.<br/><br/>Wang Xian was pulled to the bottom of the Dragon King’s palace. This place was transformed into a crystal world with crystals.<br/><br/>The entire space was dreamy and beautiful.<br/><br/>“How is it? Is It Beautiful? My father made it for me. Hehe.”<br/><br/>Shui Linglong said happily to him.<br/><br/>Wang Xian nodded. After a moment of hesitation, he asked her, “Do you know much about the fire dragon palace and the lineage of the Demon Dragon?”<br/><br/>“HMM? Brother Wang Xian, why are you asking about these things?”<br/><br/>Shui Linglong was stunned for a moment and looked at him in surprise. “Brother Wang Xian, are you trying to help us? Although you are very strong, it is still very difficult for you to change the situation of the battle.”<br/><br/>“The Fire Dragon Palace has six universe knights with level five combat strength, including the Divine Dragon and the inferior dragon. The demonic dragon lineage also has five or six of them. Furthermore, they have very powerful ultimate treasures in their hands.”<br/><br/>She frowned slightly and continued, “With their abilities, they are able to carry out the landing battle. However, they might be afraid of losing too much, so they have not entered the heaven opening primal continent.”<br/><br/>“Five or six?”<br/><br/>“If we add in powerful treasures, they should be able to fight against a level six universe Knight.”<br/><br/>Wang Xian raised his eyebrows, and a thoughtful expression appeared on his face.<br/><br/>This person was not weak, but it was not to the point where he was worried.<br/><br/>“Do you know the information about the Dragon Eagle and Fire Cloud?”<br/><br/>Wang Xian asked her.<br/><br/>He knew a lot about the information about the Netherclaw and Ghost Dragon, and he was very clear about the strength of these two legions.<br/><br/>However, he did not know about the Dragon Eagle and fire cloud.<br/><br/>“I have a piece of information here, but it might not be 100% accurate.”<br/><br/>Shui Linglong took out the universal AI and sent him a message.<br/><br/>“It’s a little stronger than the powers of the Netherclaw and Ghost Dragon that I obtained from my soul catcher. However, it’s about the same.”<br/><br/>Wang Xian took a look and his eyes sparkled.<br/><br/>The reason why he wanted this information was to participate in the war between the Water Dragon Palace, Fire Dragon Palace, and the lineage of the demon dragon.<br/><br/>Last time, the resources that the Dragon Palace obtained from the Tianhai Dragon King had greatly improved the Dragon Palace.<br/><br/>If he could eliminate the Fire Dragon Palace and the Devil Dragon lineage, the Dragon Palace would receive a qualitative boost once again.<br/><br/>After eliminating them, the Dragon Palace would be able to set foot on the heaven-splitting prehistoric continent easily.<br/><br/>Perhaps, his own strength would receive a boost.<br/><br/>If he were to increase his strength again this time, he would directly possess the combat strength of a level seven universe knight.<br/><br/>He was deep in thought.<br/><br/>“What’s wrong, brother Wang Xian?”<br/><br/>Shui Linglong waved her hand in front of him and asked curiously.<br/><br/>“Nothing.”<br/><br/>Wang Xian smiled and looked at her. “Do you need my help to deal with the Fire God Palace and the Demonic Dragon faction outside?”<br/><br/>“AH? Brother Wang Xian, do you have a way?”<br/><br/>Shui Linglong looked at him in astonishment.<br/><br/>“Of course.”<br/><br/>Wang Xian nodded and took out his AI to send a message to Prime Minister Gui. “How is the upgrade of the members of the Dragon Palace?”<br/><br/>“Dragon King, the upgrade has been completed!”<br/><br/>Soon, Prime Minister Gui replied.<br/><br/>“Alright, get the strongest members of the three dragon species, namely the Raptor, Arrow and Succubus, to prepare. Two hundred members each. Get the Heaven Formation to come over as well.”<br/><br/>Wang Xian instructed immediately.<br/><br/>“Come, let’s go to the entrance of the Water Dragon Palace.”<br/><br/>Wang Xian said to Shui Linglong as he spoke.<br/><br/>“Huh?”<br/><br/>Shui Linglong looked at him in astonishment. She nodded her head blankly and followed behind him.<br/><br/>“Your Highness, the situation is critical now. Please don’t go out!”<br/><br/>The two guards of the Water Dragon Palace said when they arrived at the entrance of the Dragon Gate.<br/><br/>“It’s alright. It’s just at the entrance. We won’t go anywhere else.”<br/><br/>Wang Xian spoke and Shui Linglong immediately followed behind him.<br/><br/>The two guards opened their mouths and hesitated for a moment before following him.<br/><br/>Buzz<br/><br/>Wang Xian walked to the entrance and waved his arm. A summoning altar appeared.<br/><br/>Buzz Buzz Buzz<br/><br/>Soon, the figures of Ao Yaotian Formation and the rest appeared in the summoning altar.<br/><br/>A total of around 600 members of the Dragon Palace appeared slowly.\t\t\t\t\t\t</div>", "images": {}, "success": true}