{"id": 249, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15072399.html", "title": "Chapter 3240 - 3240 3239 Spiny Dragon Vs Netherclaw Ghost Dragon", "volume": 3, "volume_title": "Volume 3", "body": "<h1>Chapter 3240 - 3240 3239 Spiny Dragon Vs Netherclaw Ghost Dragon</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\t3240 3239 spiny dragon vs Netherclaw Ghost Dragon<br/><br/>“Greetings, Dragon King!”<br/><br/>In front of the Water Dragon Palace, Tian Cheng and the rest appeared and greeted Wang Xian respectfully.<br/><br/>Shui Linglong was shocked.<br/><br/>The two guards of the Water Dragon Palace were on high alert.<br/><br/>“HMM, get up!”<br/><br/>Wang Xian glanced at them and smiled.<br/><br/>Tian Cheng, spiny dragon, charming dragon, and arrow dragon.<br/><br/>The elites of the three dragon species.<br/><br/>They were all universe knights with combat strength.<br/><br/>Sky Array’s current strength had already reached the level five combat strength of a universe knight. Among the level five, it was considered the best.<br/><br/>“Brother Wang Xian… you… You Are?”<br/><br/>At the side, Shui Linglong couldn’t help but stare at him and exclaimed.<br/><br/>“I belong to the Divine Dragon lineage. They are my subordinates.”<br/><br/>Wang Xian smiled faintly at her. “Aren’t the Fire Dragon Palace and the Devil Dragon lineage your enemies? I can help you deal with some of them.”<br/><br/>“AH? This… this…”<br/><br/>Shui Linglong widened her eyes and didn’t know what to say.<br/><br/>“Sky Formation, use the crescent moon and the formation to scout the surroundings. It’s best if you can detect the people hiding in the surroundings.”<br/><br/>Wang Xian looked at the sky formation at the side and instructed him.<br/><br/>“It’s the Dragon King!”<br/><br/>The Sky Formation nodded.<br/><br/>“Brother Wang Xian, are you going to help us deal with the Fire Dragon Palace and the demonic dragon lineage? They are very strong.”<br/><br/>Shui Linglong walked over. Her small face was filled with shock as she asked him in a daze.<br/><br/>“Yes, I also want to see their powerful dragon species.”<br/><br/>He was indeed very curious about these dragon palaces.<br/><br/>“Brother Wang Xian, you’re too kind. I’m going to tell my parents.”<br/><br/>Shui Linglong cheered and flew into the Water Dragon Palace immediately.<br/><br/>The other two guards of the Water Dragon Palace stood at the side. They exchanged a glance and returned to their positions.<br/><br/>“An lie!”<br/><br/>Wang Xian watched Shui Linglong leave and shook his head as he looked at an lie. “An lie!”<br/><br/>“Dragon King!”<br/><br/>An lie bowed and waited for the order.<br/><br/>“I’ll send you a set of information. After you go back, get Prime Minister Gui and the rest to prepare. After that, go and exterminate the horned seal race.”<br/><br/>Wang Xian said to him directly.<br/><br/>“It’s the Dragon King!”<br/><br/>An lie was slightly taken aback before nodding his head.<br/><br/>Wang Xian had more or less understood the strength of the horned seal race. After two universe knight level five powerhouses were exterminated, the Horned Seal race still had four universe knight level five powerhouses.<br/><br/>This number was not a small number for the current Dragon Palace.<br/><br/>After all, other than himself, the Dragon Palace only had four.<br/><br/>However, the four members of the Dragon Palace could not be compared to the four members of the horned seal race.<br/><br/>It was not difficult for the Dragon Palace to exterminate the horned seal race.<br/><br/>As long as the poisonous horned dragon species could enter the inner parts of the horned seal race, it would be very easy to exterminate them.<br/><br/>In fact, there was no need for him to do it himself.<br/><br/>Buzz<br/><br/>Wang Xian waved his arm and a stream of information was transmitted to an Lie’s mind.<br/><br/>An lie cupped his hands and disappeared.<br/><br/>When the Dragon Palace was about to exterminate the race of the horn seal, all he needed to do was to rush over with the sky formation.<br/><br/>Wang Xian thought to himself as he looked at the sky formation at the side.<br/><br/>At this moment, the sky formation was setting up a formation to scout the surrounding void space.<br/><br/>As a level five Dragon Wizard with the combat strength of a universe knight, his strength was definitely one of the best in the Fire Dragon Palace and the demonic dragon lineage.<br/><br/>Buzz<br/><br/>At this moment, more than ten figures flew over quickly.<br/><br/>The leader of the group, Water Dragon King and Water Dragon Queen, scanned the surroundings of Wang Xian, their eyes filled with astonishment.<br/><br/>“A Level 5 universe Knight Array Master.”<br/><br/>“600 subordinates of a universe knight. That light-dark dragon species is very strange. It’s at least a high-level dragon species.”<br/><br/>The Water Dragon Queen swept her gaze across the area. Her eyes were filled with astonishment.<br/><br/>“Is it that powerful? Brother Wang Xian actually has so many powerful subordinates?”<br/><br/>Shui Linglong exclaimed when she heard her mother’s voice.<br/><br/>“Young master Wang Xian, you… you want to help us deal with the Fire Dragon Palace and the demonic dragon lineage? You want to participate in our war?”<br/><br/>The Water Dragon King stared at Wang Xian with a twinkle in his eyes as he asked.<br/><br/>“Yes. The Fire Dragon King said that no matter where I flee to in the universe, he would destroy me. In that case, I can only let him know the price for his words.”<br/><br/>Wang Xian smiled faintly.<br/><br/>“Young master Wang Xian, there’s no need for that at all. If you stay in our Water Dragon Palace, they won’t be able to break through our defenses. With our water dragon palace around, they won’t be able to hurt you.”<br/><br/>The Water Dragon King shook his head and said sincerely.<br/><br/>“It’s alright. I know that I’m not strong enough to fight against them. However, I’ll play with them first.”<br/><br/>Wang Xian said nonchalantly.<br/><br/>He had called Ao Yao and the rest over because he had no intention of defeating or even annihilating them.<br/><br/>He just wanted to understand the strength and abilities of the two high-level dragons of the divine dragon lineage.<br/><br/>Was there a hidden peak race.<br/><br/>Of course, a large part of the reason was that the Fire Dragon Lord wanted to destroy him.<br/><br/>Then, he would play with them.<br/><br/>Since the Water Dragon Palace was behind them, they could escape if they could not defeat him.<br/><br/>“This…”<br/><br/>The Water Dragon King, the Water Dragon Queen, was slightly speechless when she heard his words.<br/><br/>The experts from the water dragon palace behind him could not understand why the expert who had saved their princess would do this.<br/><br/>“Since young master Wang Xian is prepared to make a move, we shall use the water secret division and the West Water Division to play with them!”<br/><br/>A hint of sternness flashed across the Water Dragon King’s eyes as he spoke.<br/><br/>“Water Dragon King, we have the geographical advantage. They have surrounded our water dragon palace and think that we are easy to bully? Let them know how powerful we are!”<br/><br/>Immediately, the experts from the Water Dragon Palace chimed in.<br/><br/>“That’s right. Let them know how powerful we are!”<br/><br/>The group of experts from the Water Dragon Palace roared.<br/><br/>“Alright!”<br/><br/>The Water Dragon King nodded his head heavily. There was a hint of coldness in his eyes.<br/><br/>“Get the disciples from the Western Water Division of the water secret division to prepare. Kill!”<br/><br/>He roared with a face full of killing intent.<br/><br/>“The western side is locked down by the people from the Netherclaw and Ghost Dragon Legions of the demonic dragon lineage. The Fire Cloud and Dragon Eagle Legions of the Fire Dragon Palace are on the eastern side.”<br/><br/>“I’m going to get my men to attack the Netherclaw and Ghost Dragon.”<br/><br/>Wang Xian looked at them and said with a smile.<br/><br/>“Alright, let’s go and meet the experts of the Fire Dragon Palace.”<br/><br/>The Water Dragon King and the rest nodded their heads. Their eyes were gleaming.<br/><br/>They moved and immediately flew towards the other direction of the Water Dragon Palace.<br/><br/>“Brother Wang Xian, I’m on your side. Are we going to make a move later?”<br/><br/>Shui Linglong stared at the front and said excitedly.<br/><br/>“No need. We can just stay here and watch.”<br/><br/>Wang Xian shook his head and looked at the sky array in front of him.<br/><br/>In the future, the heavenly numinous treasure would be illuminated by the crescent moon in the sky. Together with the array formations, they would start to scan the surroundings.<br/><br/>As long as one’s strength did not exceed level five of a universe knight, there would be nowhere to hide under his array formations.<br/><br/>“Dragon King, it’s Done!”<br/><br/>Two hours later, the sky formation waved its arm and reported to Wang Xian.\t\t\t\t\t\t</div>", "images": {}, "success": true}