{"id": 244, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15072389.html", "title": "Chapter 3235 - 3235 3234 Ghost Dragon, Netherclaw", "volume": 3, "volume_title": "Volume 3", "body": "<h1>Chapter 3235 - 3235 3234 Ghost Dragon, Netherclaw</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\t3235 3234 Ghost Dragon, Netherclaw<br/><br/>Buzz<br/><br/>Buzz! Buzz! Buzz<br/><br/>When the Bright Dragon Claw reached into the crack, the sound of corrosion could be heard from inside.<br/><br/>“HMPH, how Dare You Ambush Me? Get Out Here!”<br/><br/>Wang Xian’s dragon claw clawed into the crack, and a 100-meter-long creature with darkness attribute was pulled out.<br/><br/>Sensing the power of this creature’s bloodline, he narrowed his eyes slightly.<br/><br/>From this creature’s body, he could feel the power of the Divine Dragon’s bloodline. This was a sub-dragon.<br/><br/>It had a body of 100 meters with two terrifying claws and a bony head. Its entire body was filled with a sinister and ferocious aura.<br/><br/>“Let go of me! Let Go of me immediately!”<br/><br/>This sub-dragon of darkness attribute stared at Wang Xian as it roared with its blood-red eyes.<br/><br/>Wang Xian narrowed his eyes slightly and stared at the Asian Dragon with a twinkle in his eyes.<br/><br/>“The pure bloodline power is relatively strong even among the dragon species. It’s comparable to a high-level dragon species and can fight two levels above it.”<br/><br/>He was slightly surprised. The bloodline of the divine dragon contained in this dragon species was very strong. Fighting two levels above it was not weak even when it was at the peak of the divine dragon species.<br/><br/>“Soul Catcher!”<br/><br/>His eyes flickered and he immediately activated the Soul Catcher’s power.<br/><br/>“Roar! Roar! Roar!”<br/><br/>However, just as Wang Xian activated the Soul Catcher’s power, a terrifying roar rushed into his mind.<br/><br/>The next moment, an extremely ghostly figure attacked him again.<br/><br/>“You’re courting death!”<br/><br/>Wang Xian sensed this terrifying attack and his expression changed slightly.<br/><br/>His body emitted a terrifying power of light as numerous light spears attacked him.<br/><br/>“Roar! Roar!”<br/><br/>The figure that was attacking him was like a ghost. It was as though there was no corpse. His body flickered and he easily dodged Wang Xian’s attack. He continued to attack him.<br/><br/>Wang Xian’s eyes focused and he immediately cast the Divine Dragon Law.<br/><br/>The Phantom of the Divine Dragon from all directions attacked the phantom-like figure directly.<br/><br/>Wang Xian’s dragon eyes flickered as he locked onto the phantom-like figure.<br/><br/>It was a divine dragon with an extremely ferocious face. He did not have a corporeal body. The strange dark energy formed a terrifying existence.<br/><br/>His head was very similar to that of the Divine Dragon, but it was unusually ferocious. His body was similar to that of the demonic dragon.<br/><br/>“Another powerful Dragon!”<br/><br/>Wang Xian’s eyes were filled with shock. Rays of light shone from the dragon’s eyes as the chains slowly extended towards the surroundings.<br/><br/>“Roar! Roar!”<br/><br/>The ferocious dark dragon was attacked by the eight shadows of the Divine Dragon. When he saw the blood-red chains extending towards him, his eyes revealed a hint of solemnity and fear.<br/><br/>Buzz<br/><br/>The next moment, his entire body was like a cloud of black smoke as he quickly fled to the back.<br/><br/>It was extremely strange.<br/><br/>When Wang Xian saw him fleeing, he frowned slightly.<br/><br/>This Strange Dragon was also a high-level dragon.<br/><br/>It had the combat strength of a level five universe knight.<br/><br/>“Two powerful dragon species are actually ambushing me in the surroundings?”<br/><br/>Wang Xian was puzzled as he looked at the dragon species that he had captured.<br/><br/>“Let go of me, let go of me immediately. Otherwise, you will suffer a brutal revenge!”<br/><br/>The dragon species that he had captured stared at Wang Xian ferociously as he roared.<br/><br/>Buzz<br/><br/>Wang Xian waved his arm and used the soul-absorbing power once again.<br/><br/>A stream of information entered Wang Xian’s mind, causing him to squint his eyes slightly and sparkle.<br/><br/>“Netherclaw, Ghostly Dragon!”<br/><br/>This was the information he received. Netherclaw was the name of the dragon in front of him, while ghostly dragon was the name of the dragon that escaped earlier.<br/><br/>Netherclaw and ghostly dragon belonged to the powerful dragon species of the demonic dragon lineage.<br/><br/>They belonged to the most powerful army of the demonic dragon lineage.<br/><br/>The number of the two dragon species was not many. There were only a few hundred members, but they were the two most powerful armies of the demonic dragon lineage.<br/><br/>“Hunting down all the powerhouses who enter and exit the Water Dragon Palace. is the demonic dragon lineage going to deal with the Water Dragon Palace?”<br/><br/>Wang Xian mumbled as he looked at the information in his mind.<br/><br/>Furthermore, he received another piece of information. Not only them, but the powerhouses of the Fire Dragon Palace were also lying in ambush around them.<br/><br/>However, they were lying in ambush at another location.<br/><br/>The ambushers of the Fire Dragon Palace were equally as famous as them.<br/><br/>Dragon Eagle, Fire Cloud!<br/><br/>These were the names of the ambushers of the Fire Dragon Palace, and they were also powerful high-level dragons.<br/><br/>“TSK, TSK, I didn’t expect to be involved in the war between the races of the Divine Dragon Clan. The Fire God Palace, the Demon Dragon Clan…”<br/><br/>He hesitated and flew back to the Water Dragon Palace.<br/><br/>Their war had nothing to do with him. He was only here to take a look. He would return after taking a stroll around.<br/><br/>He did not plan to stay at the Water Dragon Palace for long. After he returned and waited for the strength of the Dragon Palace to improve, he would come to exterminate the horned seal race and the rest.<br/><br/>Wang Xian pondered in his heart and continued to fly towards the direction of the Water Dragon Palace.<br/><br/>The corpse of the Netherclaw Dragon Seed was kept by Wang Xian.<br/><br/>A high-level dragon seed was considered pretty good in the universe.<br/><br/>The bloodline and physical strength of the high-level races in the universe were at the limit of two levels higher.<br/><br/>Buzz<br/><br/>When he passed through the clouds and entered the sky above the water dragon continent’s ocean, he injected some energy into the water dragon pearl.<br/><br/>Whoosh! Whoosh<br/><br/>Before he could get close to the ocean below, a middle-aged figure flew over.<br/><br/>“Benefactor, Welcome to the Water Dragon Palace.”<br/><br/>Shui Yun looked at Wang Xian with sparkling eyes and cupped his hands.<br/><br/>“En, it’s really difficult to enter your water dragon palace. There are actually ambushers outside.”<br/><br/>Chu Xian said with a smile.<br/><br/>“Ambushers?”<br/><br/>Shui Yun was slightly stunned when she heard Wang Xian’s words. Then she frowned and asked, “Who ambushed you, benefactor?”<br/><br/>“Netherclaw and Ghost Dragon. is the Water Dragon Palace going to start a war with the demonic dragon lineage?”<br/><br/>Wang Xian did not hide what he had obtained and asked openly.<br/><br/>“Benefactor, please come in. This is not something that I can decide. We are indeed in conflict with the other divine dragon lineage.”<br/><br/>Shui Yun shook her head and extended her hand to invite him. She did not say much.<br/><br/>“I am also very curious about the divine dragons. I will come to your water dragon palace to take a look.”<br/><br/>Wang Xian smiled and followed beside him.<br/><br/>“Benefactor is also a member of the Divine Dragons. We would naturally welcome you.”<br/><br/>Shui Yun smiled and did not say anything else.<br/><br/>At this moment, he was also a little wary of his benefactor.<br/><br/>Wang Xian nodded his head. He also noticed some of Shui Yun’s misgivings.<br/><br/>He followed him to the front of the Water Dragon Palace. Looking at the Majestic Water Dragon Palace, his eyes revealed a look of astonishment.<br/><br/>The size of the Water Dragon Palace was dozens of times larger than the skysea Dragon Palace.<br/><br/>“It seems that the water dragon palace has obtained quite a lot of opportunities. This dragon palace should belong to the overlord-level Water Dragon King.”<br/><br/>Wang Xian sized up the dragon palace and was extremely astonished.<br/><br/>This dragon palace was much stronger than the current Dragon Palace created by the system.<br/><br/>“Please, benefactor!”<br/><br/>Shui Yun brought him inside.<br/><br/>After passing through the Dragon Gate, Wang Xian instantly sensed a feeling of being monitored.\t\t\t\t\t\t</div>", "images": {}, "success": true}