{"id": 240, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15072381.html", "title": "Chapter 3231 - 3231 3230. Exterminate The Twin Species", "volume": 3, "volume_title": "Volume 3", "body": "<h1>Chapter 3231 - 3231 3230. Exterminate The Twin Species</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\t3231 3230. Exterminate the twin species<br/><br/>“Roar Roar Roar!”<br/><br/>On the main planet of the twin species, the fire dragon was wreaking havoc.<br/><br/>The 30,000-meter-long body burst out terrifying flames in this narrow space.<br/><br/>Under the terrifying flames, the temples below collapsed one by one. Even the ground was cracked.<br/><br/>“Stop him! Don’t let him destroy our planet!”<br/><br/>The Universe Knights of the twin races roared.<br/><br/>They were all universe knights, and they were all universe knights. They were all universe knights, and they were all universe knights. They were all universe knights, and they were all universe knights. They were all universe knights, and they were all universe knights.<br/><br/>Not only that, but dozens of universe knights were killed by the fire dragon.<br/><br/>“Activate the wind array and kill this beast.”<br/><br/>The leader of the twin races looked at the battlefield and growled.<br/><br/>“It’s the leader!”<br/><br/>The Universe Knights immediately responded.<br/><br/>Buzz! Buzz! Buzz<br/><br/>The next moment, a green light flashed across the space.<br/><br/>Terrifying wind blades were formed.<br/><br/>“Bind!”<br/><br/>In the middle, a Level 4 universe knight saw the formation around him activated and immediately shouted.<br/><br/>“Wind God’s Bind!”<br/><br/>“Wind God’s Bind!”<br/><br/>“Earth Net and Sky Bind!”<br/><br/>Cold roars were heard as wind chains and wind bind headed towards the fire god Dragon.<br/><br/>“There should be more than 1,300 universe knights from the Gemini race. There are only about 800 of them here. It’s not enough. I need the Fire God Dragon to hold on for a while longer!”<br/><br/>Wang Xian muttered when he saw the other party using the power of the formation.<br/><br/>At this moment, at the core of the fire dragon, the five elements grinding mill started to operate. The other divine dragons were breathing in and out.<br/><br/>An even more terrifying aura burst out from the fire dragon’s body.<br/><br/>The Flames turned into numerous fire divine swords and went straight for the countless wind swords in the surroundings.<br/><br/>“Peng, Peng, Peng!”<br/><br/>The intense collision made everyone from the twin races change their expressions.<br/><br/>“Not good, this flame dragon is going crazy.”<br/><br/>The expressions of the 10 universe Knight Level 4 Great Beings from the twin races changed.<br/><br/>“Roar, Roar, Roar!”<br/><br/>At this moment, the Flame Dragon raised his head again, and a terrifying sun appeared above him.<br/><br/>Crack! Crack! Crack<br/><br/>The appearance of the Sun caused cracks to appear on the top of the twin species.<br/><br/>This was the power of the acquired Spirit Treasure, Red Sun.<br/><br/>When Red Sun appeared, the fire dragon’s destructive power had already reached the level of a level five universe knight.<br/><br/>“Damn it, Kill!”<br/><br/>The expression of the twin species leader changed slightly when he saw this scene, and he waved the small tree in his hand.<br/><br/>The small tree was emitting green energy. The small trees of wind attribute attacked scarlet sun like they were about to hit the starry sky.<br/><br/>Hong<br/><br/>A terrifying collision sound was heard, and a large number of universe knights were sent flying backward.<br/><br/>Roar! Roar! Roar<br/><br/>Fire God Dragon swayed his huge body and attacked the universe knights.<br/><br/>“Not good.”<br/><br/>The expressions of the dozens of universe knights changed slightly.<br/><br/>Hong<br/><br/>The next moment, the flames covered them, and their bodies fell down one by one.<br/><br/>“Activate the power of Wind Star!”<br/><br/>The expression of the twin race leader changed again when he saw this scene.<br/><br/>He waved the green tree in his hand upward.<br/><br/>Ka Ka Ka<br/><br/>The entire planet seemed to revolve, and countless wind law energies began to condense.<br/><br/>The vast wind attribute law energy pressed towards the fire god Dragon.<br/><br/>“Kill this beast!”<br/><br/>In the surrounding area, a group of universe knights roared with bloodshot eyes.<br/><br/>From the start of the battle until now, more than 200 universe knights had rushed over after receiving the news.<br/><br/>The number of universe knights from the twin races in the surroundings had reached more than 900.<br/><br/>“As expected of an intermediate race in the universe. Such a terrifying attack can defeat an ordinary universe knight level 5 powerhouse.”<br/><br/>At this moment, Wang Xian, who had been hiding at the side, saw this attack and muttered.<br/><br/>It was about time.<br/><br/>Wang Xian was already very satisfied to be able to gather more than 900 universe knights.<br/><br/>After all, many universe knights might be cultivating in their own god country or on other planets.<br/><br/>Gathering more than 900 universe knights should be the current limit.<br/><br/>If it weren’t for the Gemini Race’s wind planet being attacked, there wouldn’t be so many universe knights coming over.<br/><br/>Boom! Boom! Boom<br/><br/>At this moment, Wang Xian sensed a terrifying wind attribute law power coming from the entire planet.<br/><br/>A huge sword formed from wind attribute law was formed. It seemed to have split apart the entire planet and was heading towards the Fire God Dragon.<br/><br/>Terrifying sounds of collision rang out.<br/><br/>The fire god Dragon’s body slowly collapsed.<br/><br/>“Bang!”<br/><br/>Finally, the sound of metal colliding rang out. The five elements grinding mill that was a hundred meters wide appeared in front of everyone.<br/><br/>“What is this?”<br/><br/>“This is? A pre-sky realm treasure? What level of treasure is this?”<br/><br/>“How can it be a treasure?”<br/><br/>When all the paragons of the twin species saw the five elements grinding mill after the fire god Dragon collapsed, they were all shocked.<br/><br/>The leader of the twin races was also stunned, and then his eyes lit up.<br/><br/>“Acquired true treasure? Why would we have acquired true treasures here?”<br/><br/>He murmured, and then he shouted, “Suppress and subdue it!”<br/><br/>“Yes!”<br/><br/>The universe knights around him answered immediately, and their eyes were burning with passion.<br/><br/>“Not bad, not bad. To be able to defeat my weapon, the twin races are indeed powerful!”<br/><br/>At this moment, a voice suddenly rang out. This shocked the more than 900 universe knights of the Gemini race who were surrounding the five elements grinding mill.<br/><br/>Their bodies trembled and their eyes revealed a look of shock.<br/><br/>“Who is it!”<br/><br/>The leader of the Gemini race was drenched in cold sweat at this moment. He immediately turned around and looked behind him.<br/><br/>“Hehe!”<br/><br/>Wang Xian smiled. He flapped his incorporeal holy wings and flew over slowly.<br/><br/>“Who are you?”<br/><br/>The leader of the Gemini race stared at Wang Xian. He felt his scalp tingling.<br/><br/>They had used almost all their strength to deal with his weapon?<br/><br/>What about his strength?<br/><br/>“Don’t you Gemini race know who I am? Didn’t you want to destroy us?”<br/><br/>Wang Xian swept his gaze across them. His face was filled with mockery.<br/><br/>“Huh?”<br/><br/>The expression of the leader of the twin species changed.<br/><br/>“All of you from the twin species will die today!”<br/><br/>Wang Xian didn’t explain too much to them. His eyes were filled with killing intent. With a wave of his arm, the five elements Millstone flew towards him.<br/><br/>Hualala<br/><br/>At this moment, chains spread out in the surroundings, sealing all of them.<br/><br/>“After today, there will be no other twin species!”<br/><br/>He roared and turned into a divine dragon, attacking them.<br/><br/>“You… You’re from the Dragon Palace?”<br/><br/>At this moment, the leader of the twin species suddenly realized and roared in disbelief.\t\t\t\t\t\t</div>", "images": {}, "success": true}