{"id": 245, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15072391.html", "title": "Chapter 3236 - 3236 3235, The Heavily Injured Princess Of The Water Dragon Palace", "volume": 3, "volume_title": "Volume 3", "body": "<h1>Chapter 3236 - 3236 3235, The Heavily Injured Princess Of The Water Dragon Palace</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\t3236 3235, the heavily injured Princess of the Water Dragon Palace<br/><br/>“What a strong water elemental energy, what a powerful force.”<br/><br/>Wang Xian followed beside Shui Yun and looked around with a face full of admiration.<br/><br/>The spiritual energy contained in the Water Dragon Palace made him slightly amazed.<br/><br/>“Benefactor, our water dragon palace was obtained by the Water Dragon King and the Water Dragon Queen. It is the Dragon Palace of a senior at the ruler level. Once we close the Dragon Palace, even a peak universe knight wouldn’t be able to break through it.”<br/><br/>“Enemies who enter our water dragon palace, even if they are peak universe knights, will be suppressed.”<br/><br/>Shui Yun raised his head slightly. There was a hint of confidence and pride on his face.<br/><br/>This Water Dragon Palace was the biggest trump card and reliance of the Water Dragon Clan.<br/><br/>Even if the fire god Dragon and Devil Dragon Clan wanted to deal with the Water Dragon Palace, they were not afraid at all.<br/><br/>Wang Xian nodded his head slightly.<br/><br/>He knew a little about the true power of the Dragon Palace.<br/><br/>The skysea Dragon King’s Dragon Palace was the best example.<br/><br/>The Water Dragon Palace relied solely on this dragon bloodline. Other than the peak races, it was difficult for other races to destroy them.<br/><br/>Of course, there might be some strange methods.<br/><br/>However, it was very difficult to break through this water dragon palace.<br/><br/>This was the divine dragon that was once the strongest race in the universe.<br/><br/>He had been following Shui Yun around. He met some disciples of the Water Dragon Palace around him. They looked at Wang Xian curiously. Wang Xian also glanced at them.<br/><br/>They were all sub-dragons, ordinary dragon species.<br/><br/>They were not weak, but they were not strong either.<br/><br/>Wang Xian did not take the arrows from the Water Dragon Palace to heart.<br/><br/>Now that the Water Dragon Palace and the Fire Dragon Palace were in a state of tension, it was natural for them to have some defenses.<br/><br/>The layout of the Water Dragon Palace was basically the same as that of the Sky Sea Dragon Palace, but the area was a little larger.<br/><br/>Many aquatic creatures and sub-dragons lived in the palace.<br/><br/>There were all kinds of swimming fish and sub-dragons in various forms, which made the entire water dragon palace exceptionally beautiful.<br/><br/>Wang Xian asked after following Shui Yun for more than an hour.<br/><br/>“To tell you the truth, not long after you left, we were attacked by the Fire Dragon Palace. The ten ferocious dragons were snatched away by the Fire Dragon Palace. Even our princess was severely injured.”<br/><br/>Shui Yun’s eyes were filled with anger.<br/><br/>“Oh?”<br/><br/>Wang Xian raised his eyebrows.<br/><br/>“Welcome to the Water Dragon Palace. Thank you for saving Shui Yun’s life last time.”<br/><br/>At this moment, a graceful and elegant woman walked over from the front. She had a dragon horn on her head and she exuded a powerful aura.<br/><br/>“Water Dragon Queen!”<br/><br/>Shui Yun immediately bowed and greeted her.<br/><br/>“It’s nothing. I came to the Water Dragon Palace today out of curiosity. I want to see the inheritance of the purebred divine dragon. Sorry to disturb you, Water Dragon Queen!”<br/><br/>Wang Xian looked at the lady and cupped his hands.<br/><br/>“I’m not disturbing you. You are my guest. However, I’m afraid that we won’t be able to entertain this friend properly. You should know more about the situation outside.”<br/><br/>Water Dragon Queen said with a smile.<br/><br/>“You don’t have to be so polite. I’m just here to take a look. I’ll be leaving in a while!”<br/><br/>Wang Xian smiled.<br/><br/>He could tell that the woman and Shui Yun were on high alert. It was already good enough that they didn’t chase away a stranger like him.<br/><br/>“Your Highness, Your Highness, you haven’t recovered yet. Don’t run around!”<br/><br/>At this moment, a voice suddenly came from the front.<br/><br/>Soon after, a woman wearing a white gauze with dragon horns flew towards them.<br/><br/>Behind her was a helpless woman.<br/><br/>“Hehe, I’m fine. Although my injuries are serious, they don’t hurt anymore. I need to find my mother.”<br/><br/>The woman said with a smile and flew straight towards the woman.<br/><br/>“You Little Girl, why did you run out when you were lying on the bed?”<br/><br/>The Water Dragon Queen looked at the woman with a doting look in her eyes.<br/><br/>“Hehe, mother, give me the dragon token. I want to go to the inner part of the Dragon King Palace. I want to recover as soon as possible. I want to teach those guys from the Fire Dragon Palace a lesson!”<br/><br/>The woman walked to the side of the Water Dragon Queen and stretched out her arm. She said with a smile.<br/><br/>Wang Xian looked at the Princess of the Water Dragon Palace with a hint of curiosity in his eyes.<br/><br/>The last time he saw her was probably her.<br/><br/>In her human form, she looked like she was seventeen or eighteen years old. Her body was watery, as if she was made of water.<br/><br/>Even the dragon horns on her head were pink and tender.<br/><br/>“Good, good. Can’t you see that we are receiving guests?”<br/><br/>The Water Dragon Empress stroked her head lovingly.<br/><br/>“I know, I know!”<br/><br/>“I Won’t Disturb You!”<br/><br/>The Water Dragon Princess spoke in a crisp and weak voice.<br/><br/>“My Apologies, my daughter is injured.”<br/><br/>The Water Dragon Queen passed a dragon token to her daughter and smiled apologetically at Wang Xian.<br/><br/>“It’s Alright!”<br/><br/>Wang Xian shook his head and looked at the Water Dragon Princess. Suddenly, he raised his eyebrows slightly.<br/><br/>After hesitating for a moment, he opened his dragon eyes and stared at her body.<br/><br/>There was a ball of red flame in his body. There were also quite a number of injuries in his body.<br/><br/>What surprised Wang Xian was that there was a wisp of flame in this ball of flame that was connected to the position of her head.<br/><br/>Looking at this situation, coupled with his control of soul capture, the reaction of the branches of the ancestral tree and the soul-returning tree, he could basically confirm one thing.<br/><br/>“Mother, I’ll go and recover First!”<br/><br/>The Princess of the Water Dragon Palace received the dragon token and waved her hand at her mother.<br/><br/>“Water Dragon Queen, I have to remind you that your girl has been controlled by someone else.”<br/><br/>Wang Xian hesitated for a moment and looked at Water Dragon Queen to remind her.<br/><br/>“HMM?”<br/><br/>Water Dragon Queen was slightly stunned when she heard his sudden words. She frowned slowly.<br/><br/>“Benefactor, what do you mean by that?”<br/><br/>Shui Yun, who was at the side, asked Wang Xian.<br/><br/>“There is a special energy in her body that is controlling her movements. It is better for you to check it out!”<br/><br/>Wang Xian continued to speak to them indifferently.<br/><br/>The Water Dragon Queen’s expression changed slightly.<br/><br/>“What nonsense are you talking about? Who are you saying is being controlled?”<br/><br/>At this moment, the expression of the water dragon princess who had just left changed slightly. She turned around and pouted her lips as she glared at Wang Xian with dissatisfaction.<br/><br/>Wang Xian didn’t say anything. Instead, he looked at the water dragon queen beside him.<br/><br/>“It’s my own daughter. How can I not be able to tell?”<br/><br/>The Water Dragon Queen said to Wang Xian. However, her eyes flickered slightly.<br/><br/>“Linglong, mother, use some of your energy to completely recover from your injuries!”<br/><br/>She looked at her daughter and said.<br/><br/>“Mother, don’t You Trust Me Anymore?”<br/><br/>The Princess of the Water Dragon Palace pouted and said with an unhappy face.<br/><br/>“Don’t be willful, little girl. Heal your injuries completely so that mother won’t have to worry.”<br/><br/>The Water Dragon Queen waved at her and looked at him with some worry.<br/><br/>“Bastard, you’ve ruined my plan. You’re courting death. No matter where you run to in the universe, I will destroy you and kill your entire family!”<br/><br/>All of a sudden, the expression of the princess of the Water Dragon Palace changed drastically. She glared at Wang Xian with a ferocious expression and roared.\t\t\t\t\t\t</div>", "images": {}, "success": true}