{"id": 242, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15072385.html", "title": "Chapter 3233 - 3233 3232 Headed To The Water Dragon Palace", "volume": 3, "volume_title": "Volume 3", "body": "<h1>Chapter 3233 - 3233 3232 Headed To The Water Dragon Palace</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\t3233 3232 headed to the Water Dragon Palace<br/><br/>“Hong!”<br/><br/>Around the Gemini Race’s main planet, a terrifying dragon claw descended from the sky, heading towards the experts of the Gemini race.<br/><br/>“Not good, quickly escape!”<br/><br/>“No!”<br/><br/>Around this area, most of the elite core disciples of the Gemini race had gathered. 80% of them were void God Emperor rank 5 and above.<br/><br/>There were a few hundred thousand of them. When the terrifying dragon claws landed, the expressions of the elite experts of the Gemini race changed drastically.<br/><br/>“Peng!”<br/><br/>The Dragon Claws landed and covered all of them!<br/><br/>“Weng!”<br/><br/>A huge net swept towards them and collected all the corpses.<br/><br/>In the sky, Wang Xian stood on the five elements grinding mill and flew towards the distance at a terrifying speed.<br/><br/>Eighty percent of the Universe Knights of the twin races had been destroyed. What awaited them next was destruction.<br/><br/>Their next target was the Sheji race.<br/><br/>“The Sheji race has many universe knights. There are more than 2,000 of them, more than the twin races. If we destroy them again, the improvement of the Dragon Palace this time will be terrifying.”<br/><br/>Wang Xian mumbled.<br/><br/>There were already more than 1,000 strong warriors in the Dragon Palace. Adding the resources this time, there would be more than 3,000 of them.<br/><br/>Furthermore, the Dragon Palace would be able to increase the number of level 5 universe knights by about four.<br/><br/>“After the improvement of the Dragon Palace, I can go and destroy the horned seal race!”<br/><br/>The corner of Wang Xian’s lips curled up slightly as he flew towards the Serpentine clan.<br/><br/>The Sheji clan was not far from here, but it would take about a day to reach them.<br/><br/>Sitting cross-legged on the five elements mill, he took out his artificial intelligence.<br/><br/>When he opened his artificial intelligence, the news of the extermination of the Gemini race had already spread.<br/><br/>The Gemini race was not strong, but they were not weak either. After all, they were an intermediate race in the universe.<br/><br/>However, this stir was not as big as Wang Xian had imagined.<br/><br/>The surrounding starry sky was an extremely dangerous and cruel starry sky.<br/><br/>Just take the Battle of the landings as an example. If one wanted to reach the heaven-splitting primordial land, one had to defeat the other race.<br/><br/>Many battles at this level would involve the extermination of a race.<br/><br/>Moreover, once a small race provoked a powerful enemy, they might be exterminated.<br/><br/>However, it was not as cruel as one had imagined.<br/><br/>Even if it was a low-level race in the universe, it would still have a great deterrent force.<br/><br/>Once you exterminated a race and let some universe knights escape, then if these universe knights wanted to take revenge and kill the ordinary disciples of your race, there was nothing you could do.<br/><br/>Therefore, exterminating a race was a very serious matter for any race.<br/><br/>Time passed by little by little. A day later, when Wang Xian arrived at the serpentine race, he was slightly stunned.<br/><br/>The serpentine race was different from the Gemini race. The serpentine race had a strong bloodline power. They could fight across levels.<br/><br/>Their bloodline was more noble than the Gemini clan’s.<br/><br/>Therefore, the Serpentine clan didn’t have many members, perhaps only a few tens of billions.<br/><br/>However, according to the memories in his mind, he didn’t find any members of the Serpentine clan when he came to the territory of the Serpentine clan.<br/><br/>There was no trace of them in the starry sky where the Serpentine clan used to live.<br/><br/>“What’s going on? Could it be that the Sheji clan knew that I was coming to destroy them and escaped in advance?”<br/><br/>Wang Xian frowned slightly. He scanned his surroundings and headed straight for a spaceship.<br/><br/>It was a spaceship that was similar to a dragon boat. There were still some people on it.<br/><br/>Buzz<br/><br/>Wang Xian arrived in front of the flying dragon boat. His aura trembled and the terrifying energy caused the dragon boat to stop.<br/><br/>“Let me ask you one thing. Where did the Sheji tribe go?”<br/><br/>Wang Xian’s aura swept across everyone on the dragon boat, causing them to be slightly shocked. Their faces were filled with fear.<br/><br/>“Sir, we are not too sure either. It seems like… It seems like their entire tribe has been transferred to the Horned Seal tribe. I have only just heard about it.”<br/><br/>An old man bowed and said respectfully.<br/><br/>“HMM?”<br/><br/>Wang Xian raised his eyebrows as his eyes sparkled.<br/><br/>He waved his arm and the dragon boat continued to move forward.<br/><br/>“That Sir has such terrifying strength!”<br/><br/>“That’s right. He can stop our dragon boat with a wave of his hand. He must be at least a universe knight level 3 or above.”<br/><br/>Everyone on the dragon boat heaved a sigh of relief and said softly.<br/><br/>“As expected, the Sheji race has received some news. They actually transferred their entire race to the horned seal race. That means the horned seal race is not weak now!”<br/><br/>“Especially in their base camp. It will be impossible for them to destroy the Gemini tribe again.”<br/><br/>Wang Xian frowned slightly.<br/><br/>Now that he had entered the base camp of the Horned Seal tribe, he was not even confident of killing his way out, let alone exterminating them.<br/><br/>He floated in the air with a contemplative look on his face.<br/><br/>Should he go back now? or?<br/><br/>“I’ll make a trip to the Water Dragon Palace. The reputation of the Water Dragon Palace in the universe ai is pretty good. I’ll go and take a look at the powers of the Divine Dragon lineage.”<br/><br/>He made up his mind.<br/><br/>The reason why he rushed over this time was partly to exterminate the three races. He was still thinking of going to the heaven-opening primal continent to take a look.<br/><br/>However, he happened to run into the Water Dragon Palace, so he could go and take a look.<br/><br/>With a move of his palm, Wang Xian took out the water dragon pearl.<br/><br/>The Water Dragon Pearl was given to him by the Asian dragon whom he had saved.<br/><br/>This Water Dragon Pearl was a treasure nurtured by the Asian Dragon for a long time and was connected to his bloodline.<br/><br/>Of course, he could also refine this water dragon pearl into his own treasure.<br/><br/>This water dragon Pearl had one ability, and that was to transmit telepathic messages.<br/><br/>Holding this water dragon pearl, he could contact the Asian Dragon.<br/><br/>“Let’s go for a walk!”<br/><br/>As Wang Xian spoke, a trace of energy was injected into it.<br/><br/>There was no water god Dragon in the Dragon Palace. The strongest among the dragon God lineage at their peak was a water god Dragon.<br/><br/>It was a terrifying existence at the Heaven’s origin level.<br/><br/>The strength of this water dragon was stronger than the Five Elements Dragon King and the yin-yang Dragon King back then.<br/><br/>Buzz<br/><br/>“Benefactor, what are your orders?”<br/><br/>Soon, the image of a water dragon formed above the water dragon pearl. He looked at Wang Xian respectfully and bowed.<br/><br/>“It’s nothing serious. I would like to visit Your Water Dragon Palace.”<br/><br/>Wang Xian spoke.<br/><br/>“You are most welcome. Benefactor, you can come to our water dragon palace as a guest according to the guidance of the Water Dragon Pearl!”<br/><br/>The image of the water dragon said enthusiastically to Wang Xian.<br/><br/>“Alright!”<br/><br/>Wang Xian nodded his head.<br/><br/>Very soon, there was a message guiding him on the Water Dragon Pearl.<br/><br/>Based on this message, he immediately flew into the Water Dragon Palace.<br/><br/>…<br/><br/>“Shuiyun, who contacted you?”<br/><br/>At this moment, they were in a vast ocean covered by clouds and mist.<br/><br/>In the Majestic Underwater Dragon Palace, thousands of experts from the Water Dragon Palace who had two horns on their heads and had transformed into human forms were gathered together.<br/><br/>Seeing Shui Yun communicating with someone, an elder asked curiously.<br/><br/>“Elder, it’s the Lord who saved me. He said he’s coming to the Water Dragon Palace.”<br/><br/>Shui Yun replied immediately.<br/><br/>“HMM? The expert with the bloodline of the Divine Dragon? He’s coming to our water dragon palace at this time?”<br/><br/>The elder of the water dragon palace frowned slightly.\t\t\t\t\t\t</div>", "images": {}, "success": true}