{"id": 253, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15072407.html", "title": "Chapter 3244 - 3244 3243. Under The Wrath Of The Fire Dragon", "volume": 3, "volume_title": "Volume 3", "body": "<h1>Chapter 3244 - 3244 3243. Under The Wrath Of The Fire Dragon</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\t3244 3243. Under the wrath of the Fire Dragon<br/><br/>“Demon Dragon King, what is the meaning of this? Our Fire Cloud Dragon Eagle was attacked by the Water Dragon Palace and asked for help. Why didn’t your people help?”<br/><br/>In the dark world of the Demon Dragon, the Fire Dragon King came in with his huge body and roared with a cold face.<br/><br/>“Fire Dragon King, shut up. More than 100 of our Ghost Dragons died, and we are still asking for help?”<br/><br/>The Demon Dragon King stared at the Fire Dragon Lord and roared angrily, “Didn’t you say that you’ve found out the strength of the Water Dragon Palace? How can they attack us when they’re attacking you?”<br/><br/>“Can the West Water Division and the Hidden Water Division of the Dragon Palace do it?”<br/><br/>The Demon Dragon King was also furious. When he found out that more than a hundred ghost dragons and the Ghost Dragons had died, he looked extremely embarrassed.<br/><br/>These were the high-grade dragon species of their demon dragon lineage.<br/><br/>Even if one died, his heart would ache, not to mention more than 100.<br/><br/>The Ghost Dragon and Dark Claw were the core experts of their demon dragon lineage in the future. They were the important trump cards that they would use to enter the heaven opening desolate continent in the future.<br/><br/>“How is this possible? The abilities of the Ghost Dragon and Dark Claw will be attacked and assassinated?”<br/><br/>The Fire Dragon King’s expression changed slightly. His face was filled with disbelief.<br/><br/>The Demon Dragon King’s expression didn’t change as he stared at the Fire Dragon Lord.<br/><br/>“According to the information we received, a powerful array master appeared in the Water Dragon Palace, a powerful Archer, an assassin, and a strange dragon. According to their senses, the other party is a very powerful dragon.”<br/><br/>After pondering for dozens of seconds, the demon Dragon King said coldly.<br/><br/>“How is this possible? I know the background of the Water Dragon Palace very well.”<br/><br/>The fire dragon lord frowned, and then a figure appeared in his mind, and his face changed slightly.<br/><br/>“Only that guy, only that guy, no one else!”<br/><br/>He thought of the young man who ruined his plan, and his eyes were full of killing intent.<br/><br/>“The Water Dragon Palace must have found a helper, but we are not sure which force this helper belongs to.”<br/><br/>The Fire Dragon Lord said with a gloomy face.<br/><br/>“With or without a helper, the current strength of the Water Dragon Palace is not something we can destroy!”<br/><br/>This time, not only did they fail to get any benefits, but they also suffered heavy losses.<br/><br/>“I am not resigned. I prepared for tens of thousands of years and was about to succeed, but someone interfered.”<br/><br/>The Fire Dragon Lord roared ferociously.<br/><br/>In order to destroy the Water Dragon Palace, he had prepared for a long time, but at the critical moment, he was destroyed one after another!<br/><br/>“Unless you can find another helper, but one more helper means more resources.”<br/><br/>The Demon Dragon King’s face was dark as he stared at the Fire Dragon Lord.<br/><br/>The current divine dragon lineage, the lineage that called themselves the ancestral dragon, had already stepped into the heaven opening primal continent, and they had already reached the level of a high-level race in the universe.<br/><br/>The ancestral dragon was the most powerful force of the Dragon God bloodline, and they had many purebred dragons.<br/><br/>Other than the ancestral dragon, there was also the Holy Dragon Clan. However, the Holy Dragon Clan had also entered the heaven opening primal continent, and they had become the subordinates of the Angel of light.<br/><br/>Other than these two experts of the Dragon God bloodline, there were the Fire Dragon Palace, Water Dragon Palace, Demon Dragon Bloodline, Red Gold War Dragon, and wind and Thunder Dragon Bloodline.<br/><br/>They didn’t know much about the Dragon Palace.<br/><br/>“Do you think the helpers of the Water Dragon Palace are from the Dragon Palace?”<br/><br/>Thinking of the Dragon Palace, the Fire Dragon Lord narrowed his eyes and guessed.<br/><br/>“HMM? The Dragon Palace? According to the information we got, the Dragon Palace is not very strong. They are not qualified to fight against us!”<br/><br/>The Devil Dragon King was slightly stunned and replied.<br/><br/>“Not necessarily. The improvement of our divine dragon lineage is not something that other races can compare with. It is said that the Dragon Palace also has a pure-blooded divine dragon!”<br/><br/>The Fire Dragon Lord shook his head, his eyes shining.<br/><br/>“Then what should we do now?”<br/><br/>The Demon Dragon King asked faintly.<br/><br/>“Change the target, the wind and Thunder Divine Dragon Lineage!”<br/><br/>The fire dragon lord gritted his teeth and said.<br/><br/>The wind and thunder divine dragon lineage was relatively weak among the current divine dragon lineage. It would be easier to destroy them.<br/><br/>“Fire Dragon Lord, are you about to break through?”<br/><br/>The Devil Dragon King stared at the Fire Dragon Lord and narrowed his eyes, a hint of wariness flashing through his eyes.<br/><br/>“What? Are You Afraid? If our divine dragon lineage wants to improve quickly, the best way is to destroy the other divine dragon lineages. The ancestral dragon lineage had to subdue and suppress the other divine dragon lineages to obtain their current strength.”<br/><br/>“The resources of the other divine dragons are an opportunity for us. Who knows, they might help us break through.”<br/><br/>The Fire Dragon Lord said faintly.<br/><br/>“Hahaha, alright. Let’s destroy the wind and thunder. Their strength is not as strong as the Water Dragon Palace. As long as you can break through their Dragon Palace, we will be able to destroy them very quickly!”<br/><br/>The Devil Dragon King said with a laugh.<br/><br/>“Don’t worry, there won’t be any problems this time!”<br/><br/>The Fire Dragon Lord said sinisterly as his figure slowly disappeared.<br/><br/>“To destroy the other divine dragon branches in such a hurry, it seems that your fire dragon Lord has reached the opportunity to break through. Let’s see who can break through first, hehehe!”<br/><br/>He smiled sinisterly as his figure slowly disappeared into the demon Dragon Dark World.<br/><br/>In the depths of the dark world of the Demon Dragon, an extremely huge blood-red pupil flashed with a hint of luster.<br/><br/>…<br/><br/>“Hahaha, Dragon King, thank you for your help this time. The Fire Dragon Palace and the lineage of the demon dragon probably won’t dare to act arrogantly around us anymore!”<br/><br/>At the same time, in the Water Dragon Palace, the Water Dragon King said respectfully to Wang Xian with a face full of laughter.<br/><br/>This time, Wang Xian and the rest had made a move. The demonic dragon lineage had suffered heavy losses. They should know that their water dragon palace had a powerful helper.<br/><br/>Under such circumstances, they didn’t dare to make a move against the Water Dragon Palace.<br/><br/>They might even give up.<br/><br/>“It’s just a small favor. You Don’t have to be so polite, water dragon king.”<br/><br/>Wang Xian shook his head and said with a smile.<br/><br/>“Haha, this isn’t a small favor. My Daughter’s life was saved by you. The Dragon King is the benefactor of our Water Dragon Palace!”<br/><br/>The Water Dragon Queen shook her head and waved her hand to the side.<br/><br/>More than ten members of the Water Dragon Palace carried over boxes and placed them in front of them.<br/><br/>“Dragon King, please accept this small token of my appreciation!”<br/><br/>The Water Dragon Queen smiled and gestured.<br/><br/>“Then I won’t reject it. I’ll accept it!”<br/><br/>Wang Xian hesitated for a moment before smiling. He waved his arm and kept the boxes.<br/><br/>“Haha, Let’s Toast to the Dragon King. In the future, if the Dragon Palace has any problems, the Water Dragon Palace will definitely do our best to help!”<br/><br/>The Water Dragon King laughed out loud.<br/><br/>“Thank you for your help, Dragon King!”<br/><br/>The surrounding experts from the Water Dragon Palace thanked him.<br/><br/>“No need, no need!”<br/><br/>Wang Xian said politely.<br/><br/>“Hehe, thank you for saving my life this time, Dragon King. Let Me Toast to you too!”<br/><br/>Shui Linglong sat beside him and said with a smile.<br/><br/>Wang Xian smiled.<br/><br/>After that, Shui Linglong brought him around the water dragon palace for two days.<br/><br/>To Wang Xian’s disappointment, the Fire Dragon Palace and the Demonic Dragon Clan seemed to have given up on dealing with the water dragon palace.<br/><br/>There was no war.\t\t\t\t\t\t</div>", "images": {}, "success": true}