{"id": 252, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15072405.html", "title": "Chapter 3243 - 3243 3242 Fire Dragon Devil Dragon’S Fury", "volume": 3, "volume_title": "Volume 3", "body": "<h1>Chapter 3243 - 3243 3242 Fire Dragon Devil Dragon’S Fury</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\t3243 3242 Fire Dragon Devil Dragon’s fury<br/><br/>“Retreat, Retreat, Retreat!”<br/><br/>The Ghost Dragon and the leader of the Hell’s claw used all their strength to deal with the formation of the sky array. When they sensed the situation around them, their expressions changed drastically.<br/><br/>The attacks of the group of people in front of them were somewhat strange. It was so strange that they did not receive any attacks, but they had strange symptoms.<br/><br/>In just a moment of stupor, dozens of ghost dragons and Hell’s claw were killed.<br/><br/>This made the two leaders furious.<br/><br/>“Roar! Roar!”<br/><br/>They roared, and the Netherclaw leader’s body shook, and a pitch-black claw appeared in front of him.<br/><br/>The Claw lightly slashed forward, forming a terrifying river of darkness.<br/><br/>The formation of the sky array landed on it, but it was easily blocked.<br/><br/>“Roar! Roar! Roar!”<br/><br/>A sinister mask with a dark ghost face floated in front of the Ghost Dragon leader, and the mask was filled with blood-red patterns.<br/><br/>The blood-red patterns condensed into a bloody face and covered the front.<br/><br/>“Whoosh! Whoosh! Whoosh! Whoosh!”<br/><br/>At this moment, the charm dragon and the Arrow Dragon attacked the Ghost Dragon and the Netherclaw again.<br/><br/>However, this time, the strange blood-red mask broke the formation of the sky array.<br/><br/>The arrows and the Charm Dragon’s strange attacks were easily blocked.<br/><br/>This caused the expression of the sky array to change slightly.<br/><br/>“Retreat, let’s Go!”<br/><br/>“Just you wait. We will make you pay a hundred times the price for what happened today!”<br/><br/>The leader of the Ghost Dragon roared with a gloomy face.<br/><br/>He waved his dragon claw and a dark shadow enveloped the area. He led all his subordinates and left quickly.<br/><br/>The other party’s strength had exceeded their expectations.<br/><br/>“Wow, brother Wang Xian, your subordinates are so powerful. They actually killed so many ghost dragons and Netherclaw.”<br/><br/>However, Shui Linglong, who was standing at the side, watched this scene with a face full of shock.<br/><br/>As the Princess of the Water Dragon Palace, she was very familiar with the fire clouds, dragonhawks, Netherclaw and Ghost Dragons of the demonic dragon lineage.<br/><br/>These were the high-level dragon species of the two forces.<br/><br/>High-level dragon species had powerful talents and life-saving methods.<br/><br/>It was very difficult to kill them.<br/><br/>It was no exaggeration to say that it was extremely difficult for a level 5 universe knight to Kill A Level 3 universe knight with Dark Claw.<br/><br/>Because they had powerful talents and life-saving methods.<br/><br/>However, just now, more than 100 Netherclaw and Ghost Dragons had fallen in front of her eyes. He was stunned.<br/><br/>Since when were high-grade dragons so easy to kill?<br/><br/>They were existences that were second only to purebred divine dragons!<br/><br/>“As expected of a high-grade dragon. Even though I already knew their location, I only managed to assassinate more than 100 of them.”<br/><br/>When Wang Xian saw this result, he shook his head slightly.<br/><br/>Of course, he also knew that this was mainly because the strength of the prickly dragon was weaker than the other party.<br/><br/>However, one could also tell from the side that the Ghost Dragon’s Netherclaw was powerful.<br/><br/>Especially after they took out their acquired treasures, they could easily break through the defense of the Heaven Formation.<br/><br/>“Dragon King, the combined strength of the Netherclaw and Ghost Dragon is much stronger than ours. Our success rate this time is not high.”<br/><br/>At this moment, AO Yaoyao flew over and reported with a frown.<br/><br/>“It’s already not bad.”<br/><br/>Wang Xian said with a smile.<br/><br/>The Ghost Dragon and Netherclaw were the strongest legions of the demonic dragon lineage. However, the thorned dragon was only one of several legions in the Dragon Palace.<br/><br/>With the current strength of the Dragon Palace, it should not be too much of a problem to fight against the demonic dragon lineage alone.<br/><br/>In terms of direct combat strength, the Dragon Palace still had the berserk dragon, imperial dragon, Starwood Dragon, Heaven Thunder, Earth Fire Dragon, Phoenix, and so on.<br/><br/>These were all peak dragon species.<br/><br/>At present, there were no weak dragon species in the Dragon Palace.<br/><br/>“This is already very powerful. When high-level dragon species were at the peak of the Divine Dragon lineage, they were also very powerful. Our Water Dragon Palace has less than 300 high-level dragon species.”<br/><br/>Shui Linglong continued to say from the side.<br/><br/>Just as Shui Linglong said, when the divine dragon lineage was at its peak, high-level dragon species were also very powerful.<br/><br/>At that time, the most elite troop of a powerful Dragon Palace was also the high-grade Dragon Troop.<br/><br/>The core troop of high-grade dragons was similar to the Netherclaw Ghost Dragon. It was already considered good enough for a powerful dragon palace to have a few hundred of them.<br/><br/>Boom! Boom! Boom<br/><br/>Just as they were talking, a terrifying battle broke out in the sky above the east gate of the Water Dragon Palace.<br/><br/>Wang Xian looked over and his eyes were sparkling.<br/><br/>“Netherclaw Ghost Dragon, come and support us!”<br/><br/>The furious roar was heard, causing Wang Xian and the rest to smile slightly.<br/><br/>“Damn it, Devil Dragon lineage, where are your people?”<br/><br/>In less than ten seconds, an angry voice was heard.<br/><br/>“Hehehe, Netherclaw Ghost Dragon has suffered such a great loss. He must have fled in pain!”<br/><br/>When Shui Linglong heard that, an excited look appeared on her face.<br/><br/>“Let’s go and take a look!”<br/><br/>Wang Xian said to Shui Linglong. His body moved and he immediately flew towards the East Gate of the Water Dragon Palace.<br/><br/>When he flew over, he saw that the battle had ended.<br/><br/>A group of experts from the Fire Dragon Palace were walking into the distance.<br/><br/>“How dare you be so arrogant in our place. Useless people from the Fire Dragon Palace, don’t run away!”<br/><br/>Some of the experts from the Water Dragon Palace roared with anger and disdain.<br/><br/>“Roar! Roar! Roar!”<br/><br/>Their angry roars resounded throughout the sky. The experts from the Fire Dragon Palace quickly disappeared.<br/><br/>“HMPH!”<br/><br/>Below them, the faces of the Water Dragon King, Water Dragon Queen, and the rest revealed a ghastly expression.<br/><br/>“Father, mother!”<br/><br/>When Shui Linglong saw this, she came to the side of the Water Dragon King and the rest with a smile on her face.<br/><br/>“Mm.”<br/><br/>Water Dragon Queen touched her daughter’s face. Her face was filled with smiles.<br/><br/>“Mother, you don’t know. Brother Wang Xian’s subordinates are very powerful. They killed more than 100 ghostly dragon claws.”<br/><br/>Shui Linglong said excitedly.<br/><br/>“HMM? More than 100 Ghostly Dragon Claws?”<br/><br/>Her words made the Water Dragon King and the water dragon queen slightly shocked. They looked at Wang Xian in astonishment.<br/><br/>“Yes, brother Wang Xian is the Dragon King of the Dragon Palace. He’s very powerful.”<br/><br/>Shui Linglong continued.<br/><br/>“Dragon King of the Dragon Palace.”<br/><br/>The bodies of the Water Dragon King and the Water Dragon Queen paused for a moment. They looked at each other in surprise but also as expected.<br/><br/>They had made the same guess just now.<br/><br/>“Thank you, Dragon King of the Dragon Palace, for making a move this time. Otherwise, with our strength, we wouldn’t dare to fight them head-on.”<br/><br/>The Water Dragon King cupped his hands at Wang Xian and thanked him.<br/><br/>“You’re welcome. I also want to experience the strength of the other divine dragons.”<br/><br/>Wang Xian said with a smile.<br/><br/>His words surprised the water dragon king and the Water Dragon Queen. They knew that the Dragon King in front of them was also ambitious.<br/><br/>“Haha, Let’s Go. Dragon King, you saved my daughter and helped us so much. In the future, the Water Dragon Palace will be the best friend of the Dragon Palace. If the Dragon Palace needs any help in the future, the Water Dragon Palace will definitely not decline.”<br/><br/>The Water Dragon King laughed and gestured with his hand.<br/><br/>Wang Xian nodded with a smile and walked in together.<br/><br/>“Roar! Roar! Roar!”<br/><br/>However, in the distant dark world of the demon dragon, angry roars could be heard.\t\t\t\t\t\t</div>", "images": {}, "success": true}