{"id": 257, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15072415.html", "title": "Chapter 3248 - 3248 The 3247 Giant Beast Roared As The Horn Seal Was Destroyed", "volume": 3, "volume_title": "Volume 3", "body": "<h1>Chapter 3248 - 3248 The 3247 Giant Beast Roared As The Horn Seal Was Destroyed</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\t3248 The 3247 giant beast roared as the horn seal was destroyed<br/><br/>Kun’s domain!<br/><br/>Kun’s domain was an ability that Xiao Lan had possessed a long time ago. It was an extremely terrifying ability.<br/><br/>He was able to pull the entire region into his domain. Within his domain, he possessed terrifying power.<br/><br/>When Xiao Lan’s Kun’s domain was activated, it immediately enveloped the entire planet of the horn seal race.<br/><br/>He created an independent space in this space.<br/><br/>“Oh? What ability is this?”<br/><br/>“This space beast actually launched an attack on us? It pulled us into this strange domain?”<br/><br/>“No, it should be that these two space beasts sensed a threat!”<br/><br/>“Prepare for battle. Suppress these two space beasts. Once they are suppressed, our horned seal race will be able to receive a huge upgrade.”<br/><br/>The Great Beings of the Horned XI race didn’t panic when they saw that they were suddenly enveloped in this strange space.<br/><br/>The space beasts in front of them were around level 5 knights, and with their strength, they could fight them.<br/><br/>“They dare to charge at us, courting death, Kill!”<br/><br/>The leader of the Horned XI race roared with a terrifying killing intent.<br/><br/>“Kill!”<br/><br/>The other 3,000 or so experts of the horned seal race and the snake princess race immediately gripped their weapons tightly and charged towards little blue’s small house.<br/><br/>The old man holding the crescent moon weapon emitted a golden light.<br/><br/>At this moment, everyone from the horned seal race stared at the approaching space beast and prepared to attack.<br/><br/>“Pu Pu Pu!”<br/><br/>“Pu Pu Pu!”<br/><br/>However, just as the chief of the horned seal race was about to give the order to attack, a series of attacks suddenly sounded out.<br/><br/>The chief of the horned seal race only felt a terrifying weapon directly cutting off his body, rapidly dissipating the life force in his body.<br/><br/>At the side of the horned seal race, a supreme elder of the horned seal race was directly pierced through by a pitch-black arm.<br/><br/>At the back, people of the horned seal race suddenly attacked their companions.<br/><br/>“Kill!”<br/><br/>However, at this moment, the figures of the dragon palace experts on Xiao Lan’s body flew out and attacked them one after another.<br/><br/>“What!”<br/><br/>The sudden change made all the people of the horned seal race look shocked.<br/><br/>“Patriarch!”<br/><br/>“There are people on the space beast. They are here to attack us!”<br/><br/>“Be careful, Supreme Elder, what are you going to do? !”<br/><br/>In an instant, the entire horned seal race was in chaos and everyone looked terrified.<br/><br/>The Supreme Elder with the crescent moon weapon suddenly attacked the patriarch and a Supreme Elder.<br/><br/>Just now, when everyone was ready to attack, who would have thought that their supreme elder would suddenly attack their own people.<br/><br/>They were completely unprepared.<br/><br/>Even their clan leader didn’t have any reaction and was directly cut into two pieces.<br/><br/>The one who attacked was their supreme elder!<br/><br/>No one would have thought that such a thing would happen.<br/><br/>Moreover, what made their faces even uglier was that there were a large number of experts on the space behemoth.<br/><br/>This made them instantly guess that this was a conspiracy against their horned seal race!<br/><br/>“Old Luo, what are you doing! ?”<br/><br/>A supreme elder stared at the old man with the crescent moon weapon in disbelief and shouted sternly.<br/><br/>“Keke Keke, die!”<br/><br/>At this moment, the supreme elder of the horned seal race with the crescent moon weapon let out a sinister smile and attacked from behind again.<br/><br/>“He is no longer the supreme elder of our horned seal race. Attack!”<br/><br/>The Universe Knight Level 5 great being of the horned seal race who was standing at the side had a drastic change in expression as he shouted sternly.<br/><br/>“Horned seal race, Snake Queen race, give me your life!”<br/><br/>The group of experts from the horned seal race wanted to attack Ba Qi, who was parasitizing the supreme elder of the horned seal race. However, Wang Xian and the rest had already rushed over at this moment. Their bodies were emitting a terrifying aura.<br/><br/>Boom! Boom! Boom<br/><br/>Streams of terrifying energy shot toward them, causing everyone’s expressions to change drastically.<br/><br/>“Who are you? Why are you plotting against our horned seal race?”<br/><br/>A Knight Level 5 warrior stared ahead, sweeping his gaze across the clan leader and the others, his heart beating violently, his expression unsightly as he roared.<br/><br/>“Wu Wu Wu!”<br/><br/>“Howl Howl Howl!”<br/><br/>Waiting for his response were the roars of the Dragon Palace warriors, along with Little Blue’s.<br/><br/>The moment the warriors rushed over, Little Blue’s body disappeared, appearing directly behind the horned imperial race.<br/><br/>This was little blue’s territory, and within this territory, his speed could be raised to a terrifying level.<br/><br/>“Jie Jie Jie, kill!”<br/><br/>Eight Qi flew back. Behind him, all of them were weaker than him.<br/><br/>In an instant, he cut a bloody path and flew in front of little blue.<br/><br/>A group of over 300 poisonous horned dragons floated behind him, smiling.<br/><br/>In just a split second, they had killed 700 to 800 universe knights of the Horned Seal race.<br/><br/>Especially Ba Qi, who had killed two universe knights at Level 5.<br/><br/>Most importantly, the leader of the horned seal race had been killed.<br/><br/>“Five elements Millstone, suppress!”<br/><br/>“Divine Dragon Array, Rise!”<br/><br/>“Roar Roar Roar!”<br/><br/>Wang Xian revealed a smile in his eyes. He waved the five elements millstone and turned it into a terrifying millstone, crushing forward.<br/><br/>“Damn it, block them, block them!”<br/><br/>“They are from the Dragon Palace, they are from the Dragon Palace!”<br/><br/>More than 3,000 universe knights from the snake-ji race of the horned seal race saw this scene and were shocked. They shouted sternly.<br/><br/>The remaining four universe knights, level five experts, had extremely gloomy expressions. They immediately moved to block the attacks of Wang Xian and the rest.<br/><br/>Boom! Boom! Boom<br/><br/>The four level 5 universe knights faced the attacks of Wang Xian’s Heaven Formation and Ao Jin.<br/><br/>Crack! Crack! Crack<br/><br/>However, under the confrontation of their energy, they were horrified to realize that they were at a complete disadvantage.<br/><br/>“Oh no, the opponent’s attack power is stronger than ours. Damn it, we’ve been tricked!”<br/><br/>A Level 5 universe knight shouted with a gloomy expression.<br/><br/>They had been tricked.<br/><br/>This space beast was a huge beast from the Dragon Palace.<br/><br/>The Dragon Palace had come to destroy them.<br/><br/>Most importantly, there was actually a great being from the dragon palace pretending to be their supreme elder.<br/><br/>As a result, the clan leader and the others were instantly killed, and they didn’t take out their clan treasure.<br/><br/>“Wu Wu!”<br/><br/>At this time, from behind, little blue let out a low voice and charged towards them.<br/><br/>“Attack him!”<br/><br/>Seeing the space beast flying toward them from behind, the universe knights from the two races immediately roared.<br/><br/>Their bodies shook, and waves of vast law energy attacked little blue.<br/><br/>All kinds of metal swords and spears seemed to tear through space and landed on Little Blue’s body in a flash.<br/><br/>However, to their horror, their attacks landed on the body of the space beast without leaving any traces.\t\t\t\t\t\t</div>", "images": {}, "success": true}