{"id": 258, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15072417.html", "title": "Chapter 3249 - 3249 The 3248 Beast Roared, And Its Horn Seal Was Destroyed", "volume": 3, "volume_title": "Volume 3", "body": "<h1>Chapter 3249 - 3249 The 3248 Beast Roared, And Its Horn Seal Was Destroyed</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\t3249 The 3248 beast roared, and its horn seal was destroyed<br/><br/>“This space beast is terrifying!”<br/><br/>Over 1,000 universe knights attacked little blue, but to their horror, their attacks didn’t leave any marks on Little Blue’s body.<br/><br/>This made all of their faces change.<br/><br/>Among the 1,000 universe knights, there was a Level 4 universe knight.<br/><br/>Such an attack couldn’t break through the Beast’s defense, so one could imagine how terrifying it was.<br/><br/>Hong<br/><br/>Little Blue’s body was emitting gray energy, and its huge body crashed toward them.<br/><br/>In Kun region, Little Blue’s speed was very terrifying.<br/><br/>Peng<br/><br/>Its huge body was 500 to 600 kilometers long, and it was so fast that the 1,000 universe knights didn’t have time to dodge it.<br/><br/>All the Universe Knights felt that they were hit by an extremely vast meteorite, and a vast and unstoppable force rushed toward their bodies.<br/><br/>“Bang! Bang! Bang!”<br/><br/>The terrifying sound of collision rang out, and the bodies of the universe knights flew backward like dust.<br/><br/>Their bodies were completely deformed, and the life force in their bodies seemed to have disappeared in an instant.<br/><br/>In an instant, over 1,000 universe knights were killed by Little Blue’s attack.<br/><br/>“What!”<br/><br/>“Hiss, be careful of this giant beast. Its attack is very terrifying!”<br/><br/>A Universe Knight level five great being looked behind him, and his face revealed a look of shock as he reminded him loudly.<br/><br/>“Mind Your Own Business First!”<br/><br/>Right at this moment, a voice appeared beside his ear.<br/><br/>This made the eyes of this universe Knight Level 5 great being of the horned seal race narrow, and his face revealed a look of shock.<br/><br/>Peng<br/><br/>A Terrifying Dragon Claw appeared in front of him and grabbed his body.<br/><br/>The body of the horned seal race trembled, and golden scales covered his entire body, emitting a terrifying golden light.<br/><br/>Ka Ka Ka<br/><br/>However, the terrifying Dragon Claw clenched hard, and blood flowed out from his scales.<br/><br/>This caused the universe knight of the horned seal race to be filled with shock.<br/><br/>“Third brother!”<br/><br/>An enraged voice came from the side, and a powerful horned seal race warrior attacked Wang Xian with his terrifying long tail.<br/><br/>“Roar!”<br/><br/>At this moment, a golden dragon tail came up and collided with the long tail.<br/><br/>“Hong!”<br/><br/>A terrifying collision sound was heard. The expression of the great being who was supporting them changed drastically.<br/><br/>“Today is the day your horned seal race and the snake lady race will be destroyed. If you want to destroy our Dragon Palace, today is the price you will pay!”<br/><br/>A cold voice came out of the mouths of the leaders of the Dragon Palace.<br/><br/>More than 3,000 universe knights from Dragon Palace rushed into the group of warriors from the Snake Lady Race.<br/><br/>“Wu Wu!”<br/><br/>Little House shook his huge body and charged straight into the group of warriors from the Snake Lady Race, full of unbridled fear.<br/><br/>With little house’s defense, without a Level 5 universe knight attacking, no one could seriously injure him.<br/><br/>“Not good, we are not their match!”<br/><br/>“Break this space, run!”<br/><br/>“All disciples of the Horned Seal race, run!”<br/><br/>Seeing the Space Beast, the Dragon Palace warrior rushed over, and the remaining three level 5 knights roared.<br/><br/>Run!<br/><br/>From the beginning, when someone controlled their bodies to launch a surprise attack, they were already in chaos.<br/><br/>Now that more than 1,000 universe knights had been killed, they were clear that they couldn’t win this battle.<br/><br/>Now, they could only run!<br/><br/>The Universe Knights of the horned seal race moved and immediately flew towards the edge of the Kun region.<br/><br/>Wu Wu<br/><br/>However, within Little Blue’s domain, how could someone of the same level be faster than him.<br/><br/>He swayed his huge body and headed straight for a universe knight level five great being.<br/><br/>“Damn it!”<br/><br/>When the horned seal race level five knight saw that he was being targeted by this space beast, his expression changed drastically. He gritted his teeth and shook his body.<br/><br/>Roar! Roar<br/><br/>His entire body transformed into a combat body of about 3,000 meters. His entire body was covered in golden scales, and he had a terrifying horn.<br/><br/>His long golden tail spun around his entire body, and his single horn emitted a brilliant light as he charged towards Xiao Lan.<br/><br/>“Bang!”<br/><br/>The incomparably sharp single horn was placed on Xiao Lan’s body, and it directly charged into his body.<br/><br/>Compared to Xiao Lan’s body, the body of the horned seal race’s expert was like that of a mosquito or an elephant.<br/><br/>However, his attacks were also extremely terrifying, and his entire body directly drilled into Xiao Lan’s body.<br/><br/>“Roar, Roar, Roar, no, no, no, don’t!”<br/><br/>However, very quickly, a scene that made him feel terrified happened.<br/><br/>After drilling into the body of the space behemoth, he was terrified to discover that the place that he had torn apart was actually rapidly fusing together. A terrifying force was pressing towards him.<br/><br/>In the Void, Little Blue’s body slowly floated there. Gray energy spread out in all directions.<br/><br/>“No!”<br/><br/>Finally, a desperate scream came from Little Blue’s body.<br/><br/>“What!”<br/><br/>“That Beast and Dragon Palace Dragon King are both extremely terrifying!”<br/><br/>Hearing the scream, the expressions of all the Knights of the horned seal race and snake lady race paled.<br/><br/>Especially the snake lady race, they were already much weaker than the horned seal race, facing such a situation, they could only be slaughtered.<br/><br/>“Don’t even think about leaving. All of you can stay here!”<br/><br/>“Activate the formation!”<br/><br/>The sky formation shouted coldly as terrifying formations were formed one after another.<br/><br/>Ao Jin transformed into a golden dragon and wreaked havoc in the Kun region.<br/><br/>He was invincible!<br/><br/>The Dragon Palace was in a crushing stance as it charged at all the experts of the two races.<br/><br/>Wang Xian’s gaze locked onto a level 5 universe knight and rushed over immediately.<br/><br/>With his terrifying speed and the help of the five elements grinding mill, that level five universe knight was killed in less than a minute.<br/><br/>At the side, the sky formation also killed the last level five universe knight.<br/><br/>From then on, all level five universe knight powerhouses of the horned seal race were killed.<br/><br/>Wang Xian squinted his eyes and scanned his surroundings with a smile on his face.<br/><br/>The following battle was much simpler.<br/><br/>As he scanned his surroundings, one by one, the universe knights were killed.<br/><br/>“Dragon King, leave it to us. As the grand elder of the horned seal race, I will gather all the resources of the horned seal race.”<br/><br/>Ba Qi flew over and said to Wang Xian.<br/><br/>“HMM?”<br/><br/>Wang Xian raised his eyebrows. “Sure. This way, we can gather more resources.”<br/><br/>Most of the universe knights of the horned seal race and the snake queen race had been exterminated. Now, it was time to collect the spoils of war.<br/><br/>Meanwhile, the Ba Qi could continue to parasitize on the supreme elder of the horned seal race to obtain more resources.<br/><br/>For example, they could gather all the resources from the other planets of the horned seal race.<br/><br/>This way, their harvest would be even greater!<br/><br/>“This time, the Dragon Palace will be able to obtain a significant improvement.”<br/><br/>Wang Xian narrowed his eyes and was full of smiles.\t\t\t\t\t\t</div>", "images": {}, "success": true}