{"id": 251, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15072403.html", "title": "Chapter 3242 - 3242 The Dragon Seed Of The 3241 Dragon Palace", "volume": 3, "volume_title": "Volume 3", "body": "<h1>Chapter 3242 - 3242 The Dragon Seed Of The 3241 Dragon Palace</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\t3242 The dragon seed of the 3241 Dragon Palace<br/><br/>Weng<br/><br/>In the cloudless starry sky, everything seemed calm.<br/><br/>The wind whistled, and nothing unusual happened.<br/><br/>Puff! Puff! Puff<br/><br/>However, what was weird was that drops of blood suddenly flowed out from one place in the void.<br/><br/>Blood flowed out of the void weirdly.<br/><br/>There was more than one place in the void.<br/><br/>This scene caused one’s scalp to go numb.<br/><br/>“Roar Roar Roar!”<br/><br/>“Who? Who is ambushing us?”<br/><br/>All of a sudden, an incomparably furious voice sounded out of nowhere.<br/><br/>Following that, an incomparably terrifying claw tore through the void as a pair of ice-cold eyes scanned the surroundings.<br/><br/>“Someone ambushed us. Is it someone from the Hidden Water Division?”<br/><br/>Another incomparably savage, boneless, liquid-like terrifying existence also appeared in the void. His blood-red eyes stared in a certain direction as his face was filled with killing intent.<br/><br/>“Those who dare to sneak attack us, kill them!”<br/><br/>“All ghost dragons, be careful.”<br/><br/>The leader of Ghost Dragons and the leader of Ghost Dragons had extremely fierce expressions as they warned loudly.<br/><br/>“Buzz!”<br/><br/>The next moment, Ghost Dragons waved their claws, and a terrifying beam of darkness attacked the void in front of them.<br/><br/>“Retreat!”<br/><br/>Ao Yao sensed the attack of the leader of Ghost Dragons and gave the order to retreat.<br/><br/>“Buzz!”<br/><br/>In the void, figures quickly retreated toward the Water Dragon Palace.<br/><br/>The Ghost Dragon Leader roared and ordered his subordinates in the void.<br/><br/>“Roar! Roar! Roar!”<br/><br/>Roars were heard as figures came out of the void crack.<br/><br/>However, when the Ghost Dragon Leader saw the figures, he paused.<br/><br/>“Why are there only over 200 of them? Where are the other members?”<br/><br/>“All Hell’s Claw, come out!”<br/><br/>“All Hell’s Claw, come out!”<br/><br/>When the leader of the Ghost Dragon Hell’s claw saw that there were only over 200 members of the Ghost Dragon Hell’s Claw, his expression drastically changed as he sternly roared.<br/><br/>However, there was no response.<br/><br/>This caused the expression of the leader of the Ghost Dragon Hell’s claw to slightly change.<br/><br/>The other Ghost Dragon Hell Claw’s pupils constricted as fear appeared in their eyes.<br/><br/>“Roar Roar Roar!”<br/><br/>“Kill them!”<br/><br/>A ferocious expression appeared on their faces as their bodies flashed and attacked all the thorny dragons.<br/><br/>Terrifying dark energy directly attacked in front of them.<br/><br/>“WHOOSH WHOOSH WHOOSH!”<br/><br/>However, at this moment, the thorny dragons had already flown towards the water dragon palace at their fastest speed.<br/><br/>Even those who were quite far away had returned to the Dragon Palace the moment the leader of Ghost Dragon Hell Claw discovered them.<br/><br/>“Follow me and kill!”<br/><br/>The leader of Ghost Dragon and Hell Claw’s eyes were filled with bloodlust and anger as they directly ordered.<br/><br/>Their Hell Claw and Ghost Dragon were the core legions of the Devil Dragon lineage. They were the most powerful dragon species in the entire devil dragon lineage apart from the Devil Dragon King.<br/><br/>The combined number of the two legions was only around 400 people.<br/><br/>This time, there were only around 300 people.<br/><br/>But now, there were less than 100 subordinates.<br/><br/>Although 100 people wasn’t a lot, this was a quarter of their Netherclaw Ghost Dragon.<br/><br/>This was a quarter of the strength of their Devil Dragon’s most elite legions.<br/><br/>If more than 100 members were killed, it would be a great loss to their entire Devil Dragon lineage.<br/><br/>After all, this was a powerful high-grade dragon species, and the number was limited.<br/><br/>“Roar Roar Roar!”<br/><br/>“Kill them, they actually dared to assassinate us, kill them!”<br/><br/>The group of Ghost Dragons and Netherclaw roared with sinister faces.<br/><br/>As the demonic dragon lineage, as the powerful assassins of the divine dragon lineage, but today, they were actually quietly assassinated more than a hundred of their comrades.<br/><br/>As powerful assassins, they were actually assassinated.<br/><br/>This made them feel indignant and humiliated.<br/><br/>At the same time, they were a little terrified.<br/><br/>What kind of enemy could actually assassinate them?<br/><br/>“HMM?”<br/><br/>At the same time, at the front of the Water Dragon Palace, Wang Xian frowned slightly when he saw the scene in front of him.<br/><br/>“They only assassinated about a hundred Netherclaw Ghost Dragons, yet they are attacking in such a crazy manner?”<br/><br/>He muttered, his eyes flashing with cold killing intent.<br/><br/>“Let them see our strength.”<br/><br/>Tian Chen’s gaze swept past a certain Zesen and the others, and he said coldly.<br/><br/>“Alright!”<br/><br/>The group of Archdragon and charm dragon species slightly narrowed their eyes.<br/><br/>The leader of the charm dragon species held the black spider lilies, and a faint, strange aura surged out of his body.<br/><br/>She had already evolved into a succubus, and now that she was in control of the black spider lily, she would be even more terrifying.<br/><br/>“Here they come. Leave the two Knight Level 5 Ghost Dragon Hell Claw leaders to me, and the rest to you. Try to kill as many as you can.”<br/><br/>At this time, a group of thorned dragon species flew over. Sky Array saw the ghost dragon chasing after them, and his eyes narrowed.<br/><br/>“Buzz!”<br/><br/>“Buzz Buzz Buzz!”<br/><br/>The leader of the Succubus waved his arm, and the black spider lily in his hand instantly launched an attack.<br/><br/>The other succubus followed closely behind, and a strange sound covered them.<br/><br/>One by one, energy condensed into extremely charming eyes appeared in the void, and the ghost dragon with Dark Claw attacked.<br/><br/>“WHOOSH WHOOSH WHOOSH!”<br/><br/>In the next moment, the arrow dragon species at the side launched a terrifying arrow at them.<br/><br/>“Ambush? Humph!”<br/><br/>Seeing the attack, the leader of the Ghost Dragon and the Hell Claw had a cold look in his eyes.<br/><br/>After a while, they waved their claws and attacked forward.<br/><br/>They dared to chase after them because of their confidence in their own strength and their understanding of the Water Dragon Palace.<br/><br/>With their strength and the treasures in their hands, they could easily retreat.<br/><br/>* Boom! *<br/><br/>The moment they made their move, the surrounding spell formations began to move as well. The spell formations that had been set up beforehand began to cover them.<br/><br/>“Huh? What? When did the Water Dragon Palace have Magi?”<br/><br/>When they saw the sudden attack, their expressions changed slightly.<br/><br/>“Retreat!”<br/><br/>Netherclaw and the Ghost Dragon Leader felt that something was amiss and made a prompt decision. Without the slightest hesitation, they roared with unsightly expressions.<br/><br/>They had originally planned to kill some of the fellows who had ambushed them. Now, they could only give up.<br/><br/>“Can you leave just because you want to?”<br/><br/>A cold expression appeared in the eyes of the sky array as he waved his arm once again.<br/><br/>“Boom Boom!”<br/><br/>In an instant, all the formations around them exploded.<br/><br/>At this moment, the strange attacks of the charm dragon and the Arrow Dragon had also arrived.<br/><br/>“Dodge!”<br/><br/>The Ghost Dragons and dark claw saw these attacks and immediately dodged to the side, preparing to leave.<br/><br/>Weng<br/><br/>“Ah Ah Ah!”<br/><br/>However, the strange thing was that when their gazes swept across the strange pupils, their eyes revealed a dazed look. Some of the Dark Claw and Ghost Dragons, who were only level 1 or 2 knights, revealed a dazed look.<br/><br/>Pu! Pu! Pu<br/><br/>However, just as they were in a daze, arrows pierced through their bodies.<br/><br/>“Damn it, what kind of strange attack is this? Everyone Retreat.”\t\t\t\t\t\t</div>", "images": {}, "success": true}