{"id": 254, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15072409.html", "title": "Chapter 3245 - 3245 On The 3244 War Of The Dragons", "volume": 3, "volume_title": "Volume 3", "body": "<h1>Chapter 3245 - 3245 On The 3244 War Of The Dragons</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\t3245 On the 3244 War of the Dragons<br/><br/>“I’m going back.”<br/><br/>On the third day, Wang Xian didn’t plan to stay here any longer. He bid farewell to Shui Linglong.<br/><br/>“AH? Brother Wang Xian, are you going back?”<br/><br/>Shui Linglong looked at him and said with a reluctant expression.<br/><br/>“Yes, there are still some matters to be dealt with in the Dragon Palace!”<br/><br/>Wang Xian nodded. He couldn’t stay here forever.<br/><br/>“Then… then can I go to the Dragon Palace to take a look? I haven’t been to other dragon palaces before. How about brother Wang Xian?”<br/><br/>Shui Linglong grabbed his arm and said coquettishly.<br/><br/>“Ahem, this… that’s fine too. Tell your parents.”<br/><br/>Wang Xian hesitated for a moment and nodded his head.<br/><br/>“Hehe, don’t worry. I’ll follow you out. My parents will definitely agree.”<br/><br/>Shui Linglong smiled and said, “Let’s go, let’s Go!”<br/><br/>Wang Xian nodded his head helplessly and flew out with her.<br/><br/>Buzz<br/><br/>He waved his arm and kept shui Linglong into the mother nest. The next moment, he appeared in the Dragon Palace.<br/><br/>“Wow, is this your Dragon Palace, brother Wang Xian?”<br/><br/>After releasing Shui Linglong, she exclaimed excitedly.<br/><br/>“I still have some matters to take care of first. I’ll get someone to show you around.”<br/><br/>Wang Xian said to her.<br/><br/>“Yes, yes, yes. Brother Wang Xian, do your thing.”<br/><br/>Shui Linglong nodded obediently.<br/><br/>Wang Xian called Ao nu over and asked her to show Shui Linglong around.<br/><br/>He came to the Dragon Palace.<br/><br/>“I’m Here!”<br/><br/>Sitting on the Dragon Throne, Prime Minister Gui came over immediately.<br/><br/>“How is the situation with the horned seal race?”<br/><br/>Wang Xian asked him.<br/><br/>The Dragon Palace should have made some preparations in the past few days.<br/><br/>“Dragon King, we have raised the abilities of the eight-headed dragon to the level of a universe knight level five. Now, he has entered deep into the inner parts of the horned seal race. Now, he is parasitizing an elder of the horned seal race. He is looking for an opportunity to parasitize the pinnacle powerhouses of the horned seal race.”<br/><br/>Prime Minister GUI immediately reported, “The other poisonous horned dragons have also parasitized the horned seal race and the snake princess race on a large scale. In another five to six days, we should be able to make our move.”<br/><br/>“Yes!”<br/><br/>Wang Xian nodded slightly when he heard Prime Minister Gui’s report.<br/><br/>Eliminating the horned seal race would be a great boost to the Dragon Palace.<br/><br/>“We must be fully prepared to completely exterminate the horned seal race and the Snake Lady Race!”<br/><br/>Wang Xian said with a cold gaze.<br/><br/>He would return the favor to any force that wanted to exterminate the Dragon Palace.<br/><br/>“It’s the Dragon King!”<br/><br/>Prime Minister Gui replied solemnly.<br/><br/>“Xiao Xian, who is the little beauty who just arrived in the Dragon Palace?”<br/><br/>At this moment, a voice rang out. Wang Xian looked over and saw Guan Shuqing, Lan Qingyue, and the rest walking over. They were sizing him up from head to toe.<br/><br/>“This is the princess of the Water Dragon Palace. She is also from the divine dragon lineage. She is a purebred water divine dragon!”<br/><br/>Wang Xian saw their expressions and his face darkened slightly. He immediately explained.<br/><br/>“Is that so? Have you not had a concubine for a long time? is that why you are looking for one? Or are you saying that our Dragon Palace is going to enter into a marriage alliance with the Water Dragon Palace?”<br/><br/>Guan Shuqing waited for him and mocked him.<br/><br/>“How can that be? I just happened to go to the water dragon palace and Shui Linglong wanted to follow me here, so I brought her here for a stroll!”<br/><br/>Wang Xian said hurriedly.<br/><br/>“Hehe, bringing a girl here is definitely not a good thing.”<br/><br/>The rest of the girls snorted and rolled their eyes at him.<br/><br/>This made Wang Xian feel very wronged.<br/><br/>Was he that kind of person?<br/><br/>However… It had to be said that Shui Linglong was the most beautiful girl he had met in the past few years, especially since she was a purebred water god Dragon. She had a special temperament.<br/><br/>Wang Xian walked over and immediately tried to coax her. In the end, none of the girls believed his words. This made him feel very helpless.<br/><br/>A few hours later, Wang Xian brought the group of girls and Shui Linglong to have a meal together.<br/><br/>Shui Linglong took a look at Guan Shuqing and the rest. She didn’t look too strange and kept calling them ‘big sister’. It made them feel uncomfortable to continue to put on a face and chat with her with a smile.<br/><br/>This made Wang Xian sigh in relief. Perhaps Shui Linglong didn’t have that intention.<br/><br/>In the next few days, Shui Linglong strolled around the Dragon Palace.<br/><br/>When she was in the Water Dragon Palace, she was a princess and had no one to accompany her.<br/><br/>There were some people in the Dragon Palace who could get along well, especially with Hua Er, Cai er, and the others.<br/><br/>Wang Xian was rather relaxed when he saw this and kept an eye on the situation at the eight-headed Dragon Palace.<br/><br/>On the third day, the Dragon Palace underwent a major migration.<br/><br/>They were transferred from the Milky Way to the sea where the heavenly dragon tribe used to be.<br/><br/>Now, when the forces in the starry sky and starry sky heard that the Dragon Palace had come to their side, they hurriedly came over to pay their respects and offer their treasures.<br/><br/>After all, the strength that the Dragon Palace had displayed was too shocking to them.<br/><br/>This was especially so after the dragon palace had exterminated the experts of the three races.<br/><br/>“Dragon King, something big has happened in the encirclement of Lu Xingkong!”<br/><br/>On the fourth day, Prime Minister Gui suddenly reported a piece of news that surprised Wang Xian.<br/><br/>The current Dragon Palace had already reached the level of an intermediate race in the universe and was considered an invincible existence in Xingjiang and xingkong.<br/><br/>They had set their sights on the surrounding starry sky.<br/><br/>Prime Minister Gui received a piece of news that shocked the surrounding starry sky.<br/><br/>The Fire Dragon Palace and the Devil Dragon Clan had joined hands to destroy the wind and thunder clan.<br/><br/>As the peak race of the universe, the situation of the Divine Dragon clan was still highly valued by the major races.<br/><br/>In particular, the rapid rise of the Divine Dragon clan shocked and terrified many races.<br/><br/>The wind and Thunder Dragon God lineage rose up hundreds of millions of years ago, and their power could only be considered average when compared to the forces surrounding Lu Xing Kong.<br/><br/>There were only two universe Knight Level 5 Great Beings, and they were not very strong.<br/><br/>However, the Dragon God lineage surrounding Lu Xing Kong all had a treasure that made all the powers jealous — the Dragon Palace.<br/><br/>Because of the existence of the Dragon Palace, even the powers that had the power to enter the mainland did not dare to offend them.<br/><br/>Because they could not break through the defense of the Dragon Palace.<br/><br/>If they could not break through it, it meant that they could not be destroyed.<br/><br/>Once they could not destroy the other party, the retaliation that they would suffer would be something that no other faction could withstand.<br/><br/>It was also because of this that the status of the divine dragons in the surrounding Lu Xingkong was not low.<br/><br/>However, today, a piece of shocking news spread out. The Divine Dragons of wind and thunder were destroyed by the Fire Dragon Palace and the demonic dragons.<br/><br/>This was a major event for many factions.<br/><br/>Ever since the Water Dragon Palace had returned, Wang Xian had also instructed Prime Minister Gui to pay attention to the other divine dragons.<br/><br/>What he didn’t expect was that the demonic dragons and the Fire Dragon Palace had destroyed another faction of the Divine Dragons so quickly.<br/><br/>“Why did they have to destroy the other divine dragons so urgently? Is there such a huge grudge?”<br/><br/>Wang Xian read the news and muttered to himself. His eyes were sparkling.<br/><br/>“Dragon King, there’s news from Ba Qi. They said that they can make a move now!”<br/><br/>At this moment, Prime Minister Gui saw the information on the AI and reported to Wang Xian immediately.\t\t\t\t\t\t</div>", "images": {}, "success": true}