{"id": 250, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15072401.html", "title": "Chapter 3241 - 3241 3240 Thorn Dragon Vs Ghost Dragon Of The Netherclaw", "volume": 3, "volume_title": "Volume 3", "body": "<h1>Chapter 3241 - 3241 3240 Thorn Dragon Vs Ghost Dragon Of The Netherclaw</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\t3241 3240 Thorn Dragon vs Ghost Dragon of the Netherclaw<br/><br/>Above the West Dragon Gate of the Water Dragon Palace, a 100-meter-wide scene appeared in the void.<br/><br/>From this scene, one could see many figures hiding in a place without moving.<br/><br/>Wang Xian came to the front of the scene and squinted his eyes to scan it.<br/><br/>“313 figures. There’s a gap between the information I got from the Netherclaw.”<br/><br/>He stood at the front and mumbled.<br/><br/>“Dragon King, if you want to avoid my detection, either your opponent is a level six universe knight, or he has a powerful acquired Supreme Treasure.”<br/><br/>Tian Chen stood at the side and said to Wang Xian.<br/><br/>“It’s impossible to have a level six combat strength, but it’s highly possible to have a acquired Supreme Treasure.”<br/><br/>Wang Xian thought of the ghost dragon that attacked him previously.<br/><br/>That Ghost Dragon had the combat strength of a Level 5 universe knight. However, it was still able to sneak attack him even though he was already on alert. It must have a powerful hidden supreme treasure.<br/><br/>“Wow, brother Wang Xian, this master is so powerful. He was actually able to detect the people from the demonic dragon lineage.”<br/><br/>Shui Linglong, who was standing at the side, looked at the scene in front of her in astonishment.<br/><br/>“Hehe!”<br/><br/>Wang Xian smiled. He looked at Shui Linglong and asked, “Linglong, may I ask how many acquired treasures do Your Water Dragon Palace have?”<br/><br/>“Acquired treasures? Our Water Dragon Palace has five or six of them. I have one too!”<br/><br/>Shui Linglong squinted her eyes and said. With a move of her palm, a ring appeared in her hand.<br/><br/>“Five or six? That’s a lot.”<br/><br/>Wang Xian looked at the acquired true treasures in her hand and was speechless.<br/><br/>Acquired true treasures were exceptionally precious. It was already considered pretty good for a universe knight at level six or seven to have one acquired true treasure.<br/><br/>At his peak, the Sky Sea Dragon King had the combat strength of a universe knight at level nine. He only had one acquired true treasure.<br/><br/>Water Dragon Palace had five or six acquired true treasures, which should have been obtained from Water Dragon Palace.<br/><br/>It could be guessed that the Devil Dragon Lineage’s Fire Dragon Palace probably had as many acquired true treasures as they did.<br/><br/>It was very likely that Ghost Dragon had acquired true treasures.<br/><br/>Wang Xian looked at the 200 thorned dragon species and ordered.<br/><br/>“It’s the Dragon King.”<br/><br/>Ao Yao replied immediately.<br/><br/>“Arrow dragon species, charm dragon species, you guys will be at the front to provide support. If any thorned dragon species are besieged or defeated, help them out.”<br/><br/>Wang Xian continued to instruct the Arrow Dragon and Charm Dragon.<br/><br/>“It’s the Dragon King!”<br/><br/>Mou Zesen and the rest responded immediately.<br/><br/>“Sky Array, you will be at the back to provide support.”<br/><br/>Wang Xian instructed the sky array again.<br/><br/>The sky array nodded and looked at Ao Yao and the rest.<br/><br/>“Lock onto their position and prepare for assassination!”<br/><br/>Ao Yao’s eyes were sparkling with excitement as she ordered her subordinates.<br/><br/>This time, they were fighting the Netherclaw and Ghost Dragon, who were both powerful dragon species.<br/><br/>Among the group of dragon species, none of them were weaker than universe knights.<br/><br/>Similarly, they were the best at assassination.<br/><br/>This was a huge challenge for the thorned dragon species.<br/><br/>“Yes!”<br/><br/>The bodies of the thorned dragon species flashed with light and darkness. They glanced at where Dark Claw Ghost Dragon was, and in the next moment, they disappeared into the void space.<br/><br/>“Ah, why did they disappear all of a sudden? I can’t even sense their existence!”<br/><br/>Shui Linglong, who was at the side, exclaimed in surprise.<br/><br/>Wang Xian smiled and didn’t say anything.<br/><br/>Although the thorned dragon species’assassination ability wasn’t the best in the universe, it was definitely one of the top three.<br/><br/>With Shui Linglong’s strength, she wouldn’t be able to detect the thorned dragon species unless she tried her best to sense it.<br/><br/>“Oh right, they call brother Wang Xian the Dragon King. Are you the Dragon King from the Dragon Palace?”<br/><br/>Following that, Shui Linglong looked at him and asked again.<br/><br/>There were not many divine dragons in the universe. Naturally, the rise of the Dragon Palace would attract the attention of the other divine dragons.<br/><br/>Shui Linglong also knew that her parents had made a guess just now, but they did not ask about it directly.<br/><br/>“Yes, I came to encircle Lu Xingkong to settle some matters. I happened to bump into you guys, so I came here out of curiosity.”<br/><br/>Wang Xian didn’t hide anything and nodded his head.<br/><br/>“Really? Then, brother Wang Xian, Your Dragon Palace is so strong. are those subordinates of yours also powerful dragons?”<br/><br/>Shui Linglong asked curiously.<br/><br/>“Not bad!”<br/><br/>Wang Xian smiled faintly.<br/><br/>“Hehe, I really didn’t expect that the Fire Dragon Palace and the demonic dragons would join forces. The Dragon Palace, you guys will help our water dragon palace. Hehe, let’s teach them a good lesson.”<br/><br/>Shui Linglong clenched her fists and smiled.<br/><br/>“Don’t worry, let’s teach them a good lesson!”<br/><br/>Wang Xian nodded and looked at the scene in front of him.<br/><br/>Shui Linglong was also staring at the scene with her eyes wide open.<br/><br/>She was born in the Water Dragon Palace and was a purebred divine dragon. She was doted on by thousands of people.<br/><br/>Even though she had the strength of a level four universe knight, she was still very simple-minded.<br/><br/>In the void space around the Water Dragon Palace, the two core legions of the Devil Dragon Lineage were hiding around.<br/><br/>The Fire Dragon Palace had formed an alliance with the Devil Dragon Lineage and was prepared to destroy the Water Dragon Palace.<br/><br/>They hid here to weaken the power of the Water Dragon Palace and to lock them down.<br/><br/>In fact, they had already achieved a lot.<br/><br/>At the beginning, the Water Dragon Palace didn’t know that they had already assassinated over 100,000 disciples.<br/><br/>There were many universe knights among them.<br/><br/>Even at the end, they didn’t really reveal themselves.<br/><br/>As the Devil Dragon Bloodline, they were most proud of their assassins.<br/><br/>Ghost Dragon and Dark Claw, two terrifying assassination dragons.<br/><br/>They hid in the void, even those stronger than them couldn’t sense them.<br/><br/>The moment they made a move, they would be killed.<br/><br/>They were confident that they could assassinate any warrior of the same level.<br/><br/>Now, they knew that the Water Dragon Palace knew of their existence, but they were not afraid at all.<br/><br/>Before the Water Dragon Palace wanted to surround and kill them, they had already sensed and left quickly.<br/><br/>Moreover, with their leader’s strength, he was not afraid even when facing the top-tier powerhouses of the Water Dragon Palace.<br/><br/>All the Ghost Dragons of the Hell’s Claw hid in the void crack, their cold eyes alert the surroundings.<br/><br/>They were waiting for their prey.<br/><br/>They were guarding their surroundings.<br/><br/>“Just hiding in the darkness will be illuminated by the light.”<br/><br/>“Swimming in the light and darkness is the true assassination!”<br/><br/>All the Netherclaw Ghost Dragons did not notice that they had been exposed to the powerful formation.<br/><br/>What was even more unexpected was that there were already figures rapidly approaching them.\t\t\t\t\t\t</div>", "images": {}, "success": true}