{"id": 259, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15072419.html", "title": "Chapter 3250 - 3250 3249 Was Courting Death", "volume": 3, "volume_title": "Volume 3", "body": "<h1>Chapter 3250 - 3250 3249 Was Courting Death</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\t3250 3249 was courting death<br/><br/>“What happened? What happened in the sky above our race?”<br/><br/>“Why did the sky above suddenly turn into nothingness? What Happened?”<br/><br/>In the sky above the main planet of the race, the change in the sky caused a huge change to all the disciples on the planet.<br/><br/>The space beast that suddenly flew towards them suddenly appeared in the nothingness.<br/><br/>Many disciples were shocked.<br/><br/>However, at this time, the void disappeared and dozens of figures appeared.<br/><br/>They were the venerables of the horned seal race.<br/><br/>“Eh? Where are our clan leader and the others? What about the Space Beast?”<br/><br/>The disciples of the horned seal race looked over, their faces full of surprise.<br/><br/>“Sou!”<br/><br/>At this time, the dozens of figures in the sky didn’t give any orders and flew toward the hall of the horned seal race.<br/><br/>Following that, an order was passed down throughout the entire horned seal race, gathering all the resources.<br/><br/>At the same time, among the dozens of people from the horned seal race, a figure that did not belong to the horned seal race was hidden among them.<br/><br/>All the disciples of the horned seal race were unaware of all these changes.<br/><br/>At this moment, in the starry sky not far away from the horned seal race, Wang Xian and the rest were already preparing to rush back.<br/><br/>As Xiao Lan’s little house could not return to the Dragon Palace in an instant, they continued flying back.<br/><br/>“Dragon King, we have obtained over 3,000 corpses of universe knights this time. Among them, there are six at the level of a level five universe knight and 13 at the level four!”<br/><br/>Prime Minister Gui, who was on Xiao Lan’s body, said with a smile.<br/><br/>Out of the 3,000 corpses, there were a total of seven at the level five universe knight level. However, there was one at the level of eight-headed spirit.<br/><br/>These corpses were sufficient for the Dragon Palace to receive a huge upgrade.<br/><br/>Other than these corpses, the sky array was currently located at the eighth level. Next, they began to search for a group of universe God kingdoms.<br/><br/>Other than that, there were also a large number of resources from the horned seal race and the Snake Lady Race.<br/><br/>“I wonder if these resources are enough to increase my strength!”<br/><br/>Wang Xian stood at the side, his eyes shining.<br/><br/>If he could increase his strength this time, it wouldn’t be as simple as increasing one level.<br/><br/>Instead, it would directly increase his combat strength from a level five universe knight to a level seven universe knight.<br/><br/>“Those two space beasts are back!”<br/><br/>Little Blue was flying in the starry sky. The two old men were shocked when they felt the aura in front of them.<br/><br/>They thought they had lost the two space beasts, but they didn’t expect them to come back.<br/><br/>They looked at each other excitedly.<br/><br/>“How long will it take for the experts of our clan to arrive?”<br/><br/>An old man asked with a burning gaze.<br/><br/>“At most 10 minutes. This time, our clan elder is here too. Hahaha, with our clan elder’s help, suppressing these two space beasts shouldn’t be too much of a problem!”<br/><br/>The other old man looked at the universe AI and laughed loudly.<br/><br/>“Looks like our luck isn’t bad. We’ll hold them off until the clan elder and the others arrive!”<br/><br/>As they spoke, their eyes gleamed.<br/><br/>With a wave of their arms, a net of light appeared in front of them.<br/><br/>The two of them looked at the two space beasts that had appeared in their line of sight, their eyes filled with excitement.<br/><br/>Their holy prose clan was considered an extremely powerful existence in the surrounding starry skies.<br/><br/>Suppressing the strongest universe Knight Level 5 Space Beast wasn’t a problem at all.<br/><br/>Once they subdued it, it would be a huge improvement for their holy prose clan!<br/><br/>After all, such a huge and terrifying space beast had an abnormally terrifying strength.<br/><br/>“Be careful!”<br/><br/>“Use the holy net of light to trap it!”<br/><br/>The two of them reminded each other and an incomparably huge net of light headed straight for Xiao Lan.<br/><br/>“Eh?”<br/><br/>At this moment, Wang Xian and the rest, who were on Xiao Lan’s body, were slightly stunned when they saw the huge net of light heading towards them. A cold look appeared in their eyes.<br/><br/>“Get lost!”<br/><br/>Prime Minister Gui looked over and his body moved. He hovered above Xiao Lan’s body and warned the two elders in front of him.<br/><br/>“Eh?”<br/><br/>The two warriors of the Saint Wen Clan who were attacking little blue were stunned, their eyes shining.<br/><br/>“There’s a human on that space beast. That creature is only a level 3 universe knight.”<br/><br/>An old man from the Saint Wen Clan narrowed his eyes, his expression unsightly.<br/><br/>They had been following the space beast for a long time. They had seen the opportunity to subdue it, but they had not expected there to be a human on it.<br/><br/>Was the space beast subdued and suppressed to begin with, or was there something else going on?<br/><br/>“Test their strength. If they are strong, apologize and leave. Don’t expose your identity.”<br/><br/>The two elders from the sacred prose clan were slightly unwilling, and one of them said in a low voice.<br/><br/>“Alright!”<br/><br/>The two nodded, but their movements did not stop. The net of light continued to attack them.<br/><br/>At the same time, their figures were completely covered by the light. Their faces could not be seen clearly.<br/><br/>If the other party was very strong, they would leave immediately.<br/><br/>If there was only one creature floating in the air, they could consider their next move.<br/><br/>“You’re courting death!”<br/><br/>Seeing that they were still attacking them, Wang Xian’s eyes turned cold.<br/><br/>“Woo Woo, Woo Woo!”<br/><br/>Xiao Lan’s eyes were filled with fury. She opened her mouth and let out a low roar.<br/><br/>The next moment, an extremely huge black hole appeared in front of him. His body entered the black hole directly.<br/><br/>“He wants to escape. It seems that his opponent isn’t very strong. Attack!”<br/><br/>When the two elders from the Shengwen clan saw this scene, their eyes glowed as they shouted excitedly.<br/><br/>“Weng!”<br/><br/>However, in the next moment, a black hole appeared beneath them, and an incomparably large mouth began to devour them.<br/><br/>“What! ?”<br/><br/>“Be careful!”<br/><br/>Seeing the black hole appear beneath them in the blink of an eye, and seeing the incomparably large mouth, their expressions changed slightly.<br/><br/>Their bodies moved, wanting to dodge to the side.<br/><br/>However, at this moment, a terrifying suction force appeared, causing their pupils to constrict slightly.<br/><br/>“Wings of light, break free from the shackles!”<br/><br/>The two of them roared at the same time, and a pair of wings of light appeared behind them.<br/><br/>They fled to the side.<br/><br/>“You want to escape? You’re courting death!”<br/><br/>“Hualala!”<br/><br/>However, at this moment, chains attacked them.<br/><br/>The chains instantly wrapped around their bodies.<br/><br/>“Oh no, there’s an expert!”<br/><br/>At this moment, the two elders from the holy prose clan revealed expressions of fear. A bad premonition enveloped their hearts.<br/><br/>“Hualala!”<br/><br/>Their bodies were completely wrapped around, and they directly fell towards the terrifying space beast.\t\t\t\t\t\t</div>", "images": {}, "success": true}