{"id": 261, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15072423.html", "title": "Chapter 3252 - 3252 3251 Fire Dragons Submitted, And The Demon Dragons Were The Main Ones", "volume": 3, "volume_title": "Volume 3", "body": "<h1>Chapter 3252 - 3252 3251 Fire Dragons Submitted, And The Demon Dragons Were The Main Ones</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\t3252 3251 fire dragons submitted, and the demon dragons were the main ones<br/><br/>“Roar!”<br/><br/>In the Dragon Palace of the Red Gold War Dragon, the current Red Gold War Dragons were all controlled by the Fire Dragon Palace and the demon dragons.<br/><br/>The Dragon King of the Red Gold War Dragon was killed, and more than half of the core experts were killed or injured.<br/><br/>The rest all submitted.<br/><br/>If they didn’t submit, they would die!<br/><br/>On the AI of the universe that surrounded Lu Xingkong, everyone was shocked by the changes of the Dragon God bloodline.<br/><br/>The wind-destroying Thunder Dragon bloodline suppressed the Red Gold War Dragon Bloodline.<br/><br/>There were only the Fire Dragon Palace, the Demon Dragon Bloodline, and the Water Dragon Palace in Lu Xingkong.<br/><br/>Many forces were paying attention to the situation of the Fire Dragon Palace and the Demon Dragon bloodline, making all kinds of guesses.<br/><br/>However, three days later, a roar came from the Red Gold War Dragon Palace.<br/><br/>The roar was filled with a powerful pressure that covered the entire Red Gold War Dragon Palace.<br/><br/>“HMM?”<br/><br/>At this moment, everyone’s pupils constricted as they looked at the source of the Roar in shock.<br/><br/>“Hahaha, hahaha!”<br/><br/>“I, the Dragon Lord, will rule the bloodline of the Lu Xingkong Divine Dragon. Everyone must submit to me!”<br/><br/>Then, a voice filled with wild excitement sounded. It was filled with unbridled fear.<br/><br/>His words caused the hearts of all the quasi-dragons in the golden-red War Dragon Palace to tremble slightly.<br/><br/>“What is this fire dragon lord doing?”<br/><br/>Some experts from the Devil Dragon Branch narrowed their eyes and muttered.<br/><br/>“Boom Boom Boom!”<br/><br/>At this moment, a vast and mighty power swept over, causing the faces of everyone from the Devil Dragon Branch to slightly change.<br/><br/>Hong<br/><br/>The 60,000 meter tall fire dragon emperor flew over. He swayed his huge body and emitted endless dragon power.<br/><br/>He raised his head and looked up, his eyes filled with excitement as he roared arrogantly!<br/><br/>“What?”<br/><br/>“Hiss! Fire Dragon Master has made a breakthrough. He now has the Combat Power of a universe knight at level six.”<br/><br/>Around them, the Ya Long’s eyes were filled with shock.<br/><br/>All the Great Beings of the Devil Dragon lineage looked slightly embarrassed.<br/><br/>However, the Great Beings of Fire Dragon Palace moved and immediately came to the surroundings of Fire Dragon Master. Their eyes were filled with fervor.<br/><br/>Their king had actually broken through.<br/><br/>Once the Fire Dragon Lord broke through, with the Fire Dragon Lord’s strength, he could completely suppress the devil dragon lineage.<br/><br/>At that time, they would be able to set foot on the heaven opening primal continent.<br/><br/>“Hahaha, Fire Dragon Lord, you are still so arrogant. You have just broken through and you are already impatient to suppress our devil dragon lineage!”<br/><br/>At the entrance, the Devil Dragon Dark World enveloped the entire Dragon Palace of the Red Gold War Dragon. The head of the Devil Dragon King slowly stuck out and looked down at the Fire Dragon Lord.<br/><br/>“Huh?”<br/><br/>The Fire Dragon Lord saw the mocking look on the Devil Dragon King’s face and his gaze slightly focused.<br/><br/>“Then do you want me to suppress you, or do you want to obediently surrender?”<br/><br/>His gaze was ice-cold as he stared at the Devil Dragon King in the sky!<br/><br/>“I think it’s better for Your Fire Dragon Palace to submit to our Devil Dragon Lineage!”<br/><br/>The Devil Dragon King roared coldly.<br/><br/>“Weng!”<br/><br/>Just as he finished speaking, an incomparably huge black dragon claw directly pressed towards the Fire Dragon Lord.<br/><br/>“Eh?”<br/><br/>The Fire Dragon Lord’s expression changed slightly when he saw that the Devil Dragon King actually dared to attack him.<br/><br/>“Roar Roar!”<br/><br/>“You’re courting death!”<br/><br/>He raised his head and a terrifying dragon flame flew towards the Dragon Claw.<br/><br/>“Boom!”<br/><br/>The Dragon Flame and the Devil Dragon Claw collided, emitting a terrifying sound.<br/><br/>“What!”<br/><br/>However, in the next moment, the Fire Dragon Lord’s pupils contracted slightly.<br/><br/>That terrifying dragon claw easily extinguished the flames and clawed towards him.<br/><br/>Furthermore, the Dragon Claw exploded with an even more terrifying power of darkness.<br/><br/>“This is impossible. Devil Dragon King, how can you be so powerful!”<br/><br/>Fire Dragon Master felt the power of this terrifying Devil Dragon Claw, and his expression changed drastically. He roared sternly.<br/><br/>“I don’t have the power.”<br/><br/>Devil Dragon King smiled lightly. Beside him, an even larger dragon head emerged from the darkness.<br/><br/>His cold eyes stared at Fire Dragon Master.<br/><br/>“You’re not bad. The true treasure in your hand broke two dragon palaces in a row and submitted to our Devil Dragon Bloodline.”<br/><br/>The even larger dragon head said faintly.<br/><br/>“Who… Who Are You? Who Are You?”<br/><br/>Fire Dragon Master saw the terrifying existence that emerged from Devil Dragon Dark World and roared in shock.<br/><br/>“Me? I’ll Be Your King in the future.”<br/><br/>The huge devil head said calmly, and its invincible dragon claws covered him.<br/><br/>“Not good!”<br/><br/>The Fire Dragon Lord’s expression did not change. He wanted to escape immediately.<br/><br/>“Buzz!”<br/><br/>But at this moment, he felt his surroundings turn dark and he was completely trapped in a dark space.<br/><br/>It’s over!<br/><br/>When he sensed the situation around him, his eyes revealed a trace of fear and despair.<br/><br/>He was enveloped by the dark world of the Demon Dragon.<br/><br/>The Dark World of the Demon Dragon was a domain created by the powerful demon Dragon King that was similar to the Dragon Palace. Its effect was similar to the Dragon Palace.<br/><br/>Once he entered, he would be easily suppressed.<br/><br/>Previously, when he entered the dark world of the Demon Dragon, he entered it completely as a clone.<br/><br/>“Roar! Roar!”<br/><br/>At this moment, a low roar was heard. He saw the demon Dragon King swaying its huge body.<br/><br/>Beside him, there was an even bigger demon dragon.<br/><br/>This caused his pupils to shrink and his expression to change drastically.<br/><br/>…<br/><br/>“Brother Wang Xian, I’m going back to the Water Dragon Palace.”<br/><br/>At the same time, in the Dragon Palace located in the starry sky of the galaxy, Wang Xian and the rest had returned from their expedition.<br/><br/>When he had just arrived at the Dragon Palace, Shui Linglong walked over and said goodbye to him.<br/><br/>“HMM? Didn’t you say that you wanted to stay here for a little longer?”<br/><br/>Wang Xian raised his eyebrows and asked him.<br/><br/>“No thanks, brother Wang Xian. Father and mother asked me to return as soon as possible. In addition, the divine wind and Thunder Dragon and the red-gold war dragon have been destroyed. Father and mother are a little worried.”<br/><br/>Shui Linglong shook her head.<br/><br/>“Yes!”<br/><br/>Wang Xian nodded.<br/><br/>Shui Linglong waved her hand and her figure slowly disappeared.<br/><br/>“After destroying the divine wind and Thunder Dragon, the red-gold War Dragon, will they attack the Water Dragon Palace next?”<br/><br/>Wang Xian mumbled.<br/><br/>“The shilling has increased the strength of all the members.”<br/><br/>He instructed Prime Minister Gui.<br/><br/>“It’s the Dragon King!”<br/><br/>Prime Minister Gui nodded his head.<br/><br/>As long as the strength of the Dragon Palace was stronger, they would be able to deal with the upcoming dangers.<br/><br/>Time passed day by day. Two days later, another piece of news that shocked many factions came from the surrounding Lu Xingkong.<br/><br/>The Fire Dragon Palace had submitted to the lineage of the demon dragon.<br/><br/>The moment this news was released, it caused quite a shock.<br/><br/>The Fire Dragon Palace had suddenly submitted to the lineage of the Demon Dragon?<br/><br/>What was going on?<br/><br/>The two divine dragon lineages had just annihilated and suppressed the two factions. Now, there was an internal conflict in the blink of an eye?<br/><br/>The lineage of the Demon Dragon had obtained victory?<br/><br/>This shocked everyone.<br/><br/>Wang Xian looked at the news and narrowed his eyes slightly.<br/><br/>“The Fire Dragon Palace has actually submitted to the demonic dragon lineage. There is only one possibility. The demonic dragon lineage has suppressed the Fire Dragon Palace. There is a level 6 universe knight in the demonic dragon lineage.”<br/><br/>He muttered.\t\t\t\t\t\t</div>", "images": {}, "success": true}