{"id": 267, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15072435.html", "title": "Chapter 3258 - 3258 3257 Little Blue Vs 10 Ferocious Dragons", "volume": 3, "volume_title": "Volume 3", "body": "<h1>Chapter 3258 - 3258 3257 Little Blue Vs 10 Ferocious Dragons</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\t3258 3257 little blue vs 10 ferocious dragons<br/><br/>“Woo Woo!”<br/><br/>The enormous little blue shuttled through the starry sky and quickly headed toward the Water Dragon Palace.<br/><br/>“As expected, they are heading toward the Water Dragon Palace. There are still many people above the space beast. We can confirm that they are ready to take action.”<br/><br/>An old man on a planet not far away said faintly.<br/><br/>“We can send people directly to the Water Dragon Palace. If they fight with the Devil Dragon Clan, we will take action. If there is no fight, we will act according to the situation.”<br/><br/>“Okay!”<br/><br/>The old men talked and disappeared immediately.<br/><br/>Soon, a huge lotus flower emitting light flew out from the holy prose clan.<br/><br/>The lotus flower was thousands of meters long and contained a terrifying power of light.<br/><br/>Thousands of middle-aged elders stood on it and flew toward the Water Dragon Palace.<br/><br/>Boom! Boom! Boom<br/><br/>As the time limit of the Devil Dragon Clan passed day by day, three dragon palaces had gathered around the water dragon palace.<br/><br/>Fire Dragon Palace!<br/><br/>Red Gold War Dragon Palace!<br/><br/>Wind Thunder Divine Dragon Palace!<br/><br/>The three dragon palaces had surrounded the water dragon palace in a triangular formation.<br/><br/>“Dragon Lord, when will the Devil Dragon King and the Devil Dragon Emperor arrive?”<br/><br/>At this moment, a red gold war dragon in the Fire Dragon Palace asked the Fire Dragon Lord.<br/><br/>“They will arrive at the last moment. We will seal the Water Dragon Palace and prevent their experts from escaping.”<br/><br/>The Fire Dragon Lord said expressionlessly as he looked to the side.<br/><br/>“Order everyone to spread out in the surroundings. We must not let anyone from the Water Dragon Palace escape.”<br/><br/>“Also, release the ten heads of Long Zheng and order him to patrol the surroundings.”<br/><br/>The Fire Dragon Lord continued to give orders.<br/><br/>He naturally couldn’t let them escape if he wanted to suppress the Water Dragon Palace.<br/><br/>It was fine if the Water Dragon Palace submitted, but if they dared to resist, what awaited them was destruction.<br/><br/>“Yes!”<br/><br/>The members of the Fire Dragon Palace and the experts of the scarlet gold battle dragon immediately replied.<br/><br/>Among the experts who submitted to the Devil Dragon lineage, the Fire Dragon Lord was the strongest.<br/><br/>If the Devil Dragon Emperor didn’t suddenly appear, the Fire Dragon Lord would have already become the king.<br/><br/>“Roar!”<br/><br/>Soon, a huge space beast with 10 heads flew out from behind Fire Dragon Palace.<br/><br/>It was 60,000 meters long and had 10 ferocious heads. It was even bigger than when Shui Linglong and the others suppressed it.<br/><br/>It was obviously a huge improvement.<br/><br/>The power it gave off had reached level five knight level.<br/><br/>A Universe Knight Level Five Space Beast was definitely an extremely terrifying existence.<br/><br/>The ten ferocious-looking dragons roared and flew to the sky, their cold eyes staring at the water dragon palace below.<br/><br/>“Do they really think that our water dragon palace is easy to bully? They actually suppressed three dragon palaces around us, and that Space Beast, it was originally a giant beast of our Water Dragon Palace.”<br/><br/>In the Water Dragon Palace, the experts looked around angrily.<br/><br/>The three dragon palaces surrounded them, and a giant space beast flew above their heads.<br/><br/>This made them feel extremely aggrieved.<br/><br/>The Water Dragon Palace had never suffered such humiliation before.<br/><br/>“Water Dragon King, I request to go out and destroy their arrogance.”<br/><br/>The leader of the West Water Tribe asked the Water Dragon King with a face full of killing intent.<br/><br/>“Water Dragon King, the experts from the Devil Dragon lineage have not arrived yet. I think we can have a good fight with them.”<br/><br/>The old woman beside him also said with a ghastly expression.<br/><br/>“Wait for the people from the Dragon Palace to arrive before we make a move. This time, the Dragon Palace has sent many experts. Once they arrive, we will immediately let them know how powerful our water dragon palace is.”<br/><br/>The Water Dragon King said with a cold face.<br/><br/>Now that the Devil Dragon Clan had bullied them to their home, no one could stand it.<br/><br/>Once the reinforcements of the Dragon Palace arrived, they were ready to fight back immediately.<br/><br/>Even if they couldn’t kill too many people, they had to let them know their attitude, determination, and strength.<br/><br/>The group of strong disciples of the Water Dragon Palace held their weapons tightly with murderous looks, ready to fight at any time.<br/><br/>“We’re almost there!”<br/><br/>At the same time, Shui Linglong, who was on Little Blue’s body, stared at the front and said coldly.<br/><br/>“Leader of the sky array, the front is about to reach the water dragon palace. There are three dragon palaces surrounding us. We might be attacked when we get there.”<br/><br/>“But when we get there, the Water Dragon Palace will attack them. Please help us.”<br/><br/>Leader Shui Yin walked to the side of the sky array and cupped his hands.<br/><br/>“Don’t Worry!”<br/><br/>The sky array nodded and stared at the area in front of them with sparkling eyes.<br/><br/>Slowly, the continent of the Water Dragon Palace appeared in their sight. They could feel the powerful pressure coming from the four dragon palaces in front of them.<br/><br/>“Leader Shui Yin and the experts of the Dragon Palace are here. Prepare to attack those guys from the Fire Dragon Palace and the Red Gold War Dragon Palace.”<br/><br/>Within Water Dragon Palace, Water Dragon Emperor and the others received the news and immediately ordered.<br/><br/>“Yes!”<br/><br/>“Attack, Kill.”<br/><br/>“Let them know how powerful our water dragon palace is.”<br/><br/>In an instant, more than 4,000 universe knights who had been prepared rushed out under the leadership of the leaders of Water Dragon Palace.<br/><br/>“Madam, wait here, I’ll attack too!”<br/><br/>Water Dragon Emperor said with killing intent, and he rushed out of Water Dragon Palace.<br/><br/>“Hahaha, Fire Dragon Master, I didn’t expect you to be demon Dragon’s lackey. You, Fire Dragon Master, are just so-so. Come and face your death.”<br/><br/>Water Dragon Emperor flew out and stared in the direction of Fire Dragon Palace, roaring coldly.<br/><br/>Roar! Roar<br/><br/>He turned into a water god Dragon, giving off a powerful aura.<br/><br/>“Water Dragon King, if you don’t submit, you will be destroyed. You have to think carefully.”<br/><br/>In the Fire Dragon Palace, they heard the Water Dragon King’s voice.<br/><br/>The Fire Dragon Lord’s eyes were cold and disdainful. He swayed his huge body and came out of the Dragon Gate of the Fire Dragon Palace, staring at the Water Dragon King coldly.<br/><br/>“You want to destroy us? No one can destroy the Water Dragon Palace. No one in the Water Dragon Palace is afraid of death.”<br/><br/>The Water Dragon King said coldly and opened his mouth. An extremely powerful water dragon pearl appeared above him.<br/><br/>“Hehe, you’re courting death. It’s easy for me to destroy you.”<br/><br/>The Fire Dragon Lord stared at the Water Dragon King with ridicule and disdain.<br/><br/>“Wu Wu Wu!”<br/><br/>At this moment, a muffled roar sounded as if it came from a reason.<br/><br/>“Eh? Are the people from the Dragon Palace here to support you? Hehe, that’s good too. We were planning to destroy the Dragon Palace after we destroy you. Now that we’ve gathered together, it’s just right!”<br/><br/>The Fire Dragon Lord looked at the source of the voice. When he saw Xiao Lan’s enormous body and sensed the power coming from above, he smiled.\t\t\t\t\t\t</div>", "images": {}, "success": true}