{"id": 262, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15072425.html", "title": "Chapter 3253 - 3253 3252 United", "volume": 3, "volume_title": "Volume 3", "body": "<h1>Chapter 3253 - 3253 3252 United</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\t3253 3252 united<br/><br/>The Fire Dragon surrendered and the Devil Dragon was the main force!<br/><br/>The moment this news was released, it caused a huge sensation.<br/><br/>Not only Wang Xian could guess, the other forces could also guess some problems.<br/><br/>There was only one possibility for the devil dragon lineage to be able to make the Fire Dragon Palace surrender. The strength of the Devil Dragon lineage far surpassed the Fire Dragon Palace.<br/><br/>The Fire Dragon Palace was not weak in the surrounding Lu Xing Kong. It could even be said to be relatively strong.<br/><br/>The Moment Fire Dragon Master could break through to the level 6 knight level, 80% of them would be able to set foot on the heaven opening primal continent.<br/><br/>This was because the dragon bloodline had the advantage of the Dragon Palace, it had terrifying power.<br/><br/>Normal people with bloodlines and physiques would not be able to fight against it.<br/><br/>After the Wind Thunder Dragon was destroyed, the Red Gold War Dragon submitted, the Fire Dragon Palace submitted, and the Devil Dragon bloodline controlled three dragon palaces at once.<br/><br/>They controlled a large amount of resources.<br/><br/>This was a huge increase in the strength of the lineage of the Devil Dragon.<br/><br/>“Is the lineage of the Devil Dragon going to unify the Lu Xingkong Divine Dragon lineage? With their strength, they should be able to land on the heaven opening desolate continent now, right?”<br/><br/>“The strength of the lineage of the Devil Dragon can definitely land on the heaven opening desolate continent now. However, they might continue to attack the water dragon palace and subdue the other divine dragon lineages!”<br/><br/>“Other than the water dragon palace, there seems to be another dragon palace. It’s said that the Dragon Palace’s strength isn’t weak either.”<br/><br/>“The demon dragon lineage controls the method to open the other dragon palaces. If it were me, I would say that they would definitely subdue the other dragon God lineages and wait for their strength to accumulate to a terrifying level before landing on the Heaven Opening Primal Continent.”<br/><br/>On the universe’s AI, the disciples of countless forces and races were discussing.<br/><br/>Now that the lineage of the Devil Dragon had progressed step by step, the other forces could almost guess their next move.<br/><br/>The Fire Dragon Palace had submitted, which made all the strong disciples of the Water Dragon Palace panic.<br/><br/>“Dragon King, all the resources have been obtained.”<br/><br/>In the Dragon Palace, Wang Xian was looking at the information on the universal AI. At this moment, Prime Minister Gui came forward to report.<br/><br/>“Oh?”<br/><br/>He raised his eyebrows and revealed a smile, “Have the eight-point sky array returned?”<br/><br/>“They will be back soon. News from the sky array has arrived. Most of the divine kingdoms have been found. They are now located in front of our Dragon Palace.”<br/><br/>Prime Minister Gui said.<br/><br/>“Very good!”<br/><br/>Wang Xian stood up immediately with a burning look in his eyes.<br/><br/>More than 3,000 universe God kingdoms, as well as all the resources of the horn seal race and the snake princess race, were enough to increase his strength.<br/><br/>It could also increase the Dragon Palace’s strength tremendously.<br/><br/>Buzz<br/><br/>At this moment, his universe intelligence brain trembled.<br/><br/>“Oh?”<br/><br/>Wang Xian looked over and saw the message from Shui Linglong.<br/><br/>When he saw the contents, he narrowed his eyes slightly.<br/><br/>The message from Shui Linglong was not a casual chat. Instead, she was discussing the current issue of the Divine Dragon lineage on behalf of her parents.<br/><br/>The main purpose was to form an alliance with the Dragon Palace.<br/><br/>An alliance and a statement on the cosmic brain.<br/><br/>This alliance was mainly for self-protection.<br/><br/>This was because the water dragon palace and many other races had guessed that the demonic dragon lineage would be going against them or even the Dragon Palace.<br/><br/>If the two major powers made a statement and formed an alliance at this time, it might cause the demonic dragon lineage to be afraid.<br/><br/>“Sure!”<br/><br/>Wang Xian looked at the message and agreed without much hesitation.<br/><br/>The fire dragon wanted to exterminate him.<br/><br/>He had also sent people to assassinate the high-level dragon of the demonic dragon lineage. This enmity had already been formed.<br/><br/>Joining forces with the Water Dragon Palace would be beneficial to the dragon palace.<br/><br/>“Prime Minister Gui, use the name of our Dragon Palace to announce on the AI. Join forces with the Water Dragon Palace to advance and retreat together.”<br/><br/>Wang Xian instructed Prime Minister Gui.<br/><br/>“It’s the Dragon King!”<br/><br/>Prime Minister Gui nodded his head slightly.<br/><br/>“I will go to the Kingdom of God in front to take a look.”<br/><br/>As Wang Xian spoke, his body moved and he flew straight ahead.<br/><br/>The Kingdom of God of a bunch of universe knights must contain many treasures and resources.<br/><br/>“Father, brother Wang Xian has agreed. He will immediately get someone to announce their alliance with us on the AI.”<br/><br/>In the Water Dragon Palace, Shui Linglong smiled when she saw Wang Xian’s reply.<br/><br/>“Okay.”<br/><br/>The Water Dragon King and the water dragon queen nodded slightly.<br/><br/>“I hope the Fire Dragon Palace and the demonic dragon lineage can be wary of our collaboration. Otherwise, our water dragon palace will still be in danger. There must be a level 6 powerhouse in the demonic dragon lineage.”<br/><br/>The water dragon queen sighed and prayed.<br/><br/>“I’m just curious, how did they open the wind and Thunder Divine Dragon and Red Gold Battle Dragon Palace? What treasures are they holding?”<br/><br/>The Water Dragon King said with an ugly expression.<br/><br/>The Dragon Palace was their greatest trump card. Now that the other party was able to break through their Dragon Palace, it was undoubtedly their trump card.<br/><br/>Water Dragon Queen shook her head and frowned, she took out her AI, “I’ll send the statement on the Universe AI. The Dragon Palace isn’t weak, they should be wary. Also, we have to be prepared, we can’t rely on our water dragon palace at the crucial moment.”<br/><br/>“OK!”<br/><br/>Water Dragon King nodded.<br/><br/>The Fire Dragon Palace of the Devil Dragon lineage caused such a huge commotion, the entire surrounding races were paying attention.<br/><br/>When the Dragon Palace and the Water Dragon Palace made their announcement, it immediately attracted the attention of all the races.<br/><br/>“The Water Dragon Palace and the Dragon Palace have joined hands. They are obviously afraid of the Devil Dragon Lineage!”<br/><br/>“The Devil Dragon lineage has exterminated two races. Even the Water Dragon Palace is afraid!”<br/><br/>“If the two forces join hands, I wonder what the Devil Dragon lineage will do?”<br/><br/>The entire galaxy was watching the Battle of the Dragon God.<br/><br/>“Hehe, join forces? Dragon Palace?”<br/><br/>In the Devil Dragon Dark World, the Devil Dragon King sat on the Dragon Throne and listened to his subordinate’s report. His eyes were filled with coldness.<br/><br/>The Dragon Palace had killed more than a hundred ghost dragon experts. He still remembered this grudge!<br/><br/>He moved his dragon claws slightly and a pair of bright dragon horns appeared in his hand.<br/><br/>However, at this moment, this pair of magical dragon horns had lost its luster.<br/><br/>“Fire Dragon Lord, do you only have this pair of dragon horns?”<br/><br/>He looked down and asked the fire dragon Lord who was sitting on the right.<br/><br/>“Demon Dragon King, i… I only have this pair of dragon horns. Breaking through the two dragon palaces has consumed all of my energy.”<br/><br/>The Fire Dragon King immediately stood up and bowed as he said with an embarrassed expression.<br/><br/>If it wasn’t for the fact that there was an old monster hiding in the Devil Dragon Bloodline, he wouldn’t have been suppressed and wouldn’t have submitted to a guy who was even weaker than him!<br/><br/>“Oh? So this thing is useless?”<br/><br/>The Devil Dragon King raised his eyebrows and said indifferently.<br/><br/>“Basically useless. Now, if the Devil Dragon King wants to suppress or destroy the Water Dragon Palace, he can suppress them with the four dragon palaces.”<br/><br/>The fire dragon Lord lowered his head and replied.<br/><br/>“Suppress the four dragon palaces? Hehe, announce that the water dragon palace has ten days. If they don’t surrender within ten days, we will suppress them.”<br/><br/>The Demon Dragon King ordered faintly.<br/><br/>“Yes!”<br/><br/>Below, the Ghost Dragon Leader immediately replied.<br/><br/>“One by one!”<br/><br/>The Demon Dragon King narrowed his eyes and disappeared.\t\t\t\t\t\t</div>", "images": {}, "success": true}