{"id": 263, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15072427.html", "title": "Chapter 3254 - 3254 3253", "volume": 3, "volume_title": "Volume 3", "body": "<h1>Chapter 3254 - 3254 3253</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\t3254 3253<br/><br/>“The bloodline of the Demon Dragon has issued a statement. They have warned the water dragon palace to suppress them if they don’t surrender within ten days!”<br/><br/>“Hiss, the bloodline of the demon dragon is too powerful now. If they ask the Water Dragon Palace to surrender, will the Water Dragon Palace agree to it?”<br/><br/>“The Water Dragon Palace is stronger than the bloodline of the Red Gold War Dragon and the wind-thunder divine dragon. Will the Water Dragon Palace agree to it?”<br/><br/>“The water dragon palace might be suppressed if they don’t agree. After all, the Red Gold War Dragon and the Fire Dragon Palace have both submitted to the Demon Dragon.”<br/><br/>“The Water Dragon Palace and the Dragon Palace will not submit if they join forces.”<br/><br/>“It’s obvious that the demon dragon is the strongest now. I guess the demon dragon is going to unify the Divine Dragon bloodline around Lu Xingkong.”<br/><br/>The statement of the Demon Dragon bloodline caused a huge uproar.<br/><br/>They directly made the Water Dragon Palace surrender. This was too strong.<br/><br/>The countless races in the surrounding starry sky discussed.<br/><br/>“They don’t put us in their eyes at all. Do they really think we’re easy to bully?”<br/><br/>The experts of the water dragon palace were filled with anger when they heard the news.<br/><br/>The expressions of the Water Dragon King and the Water Dragon Queen were extremely ugly.<br/><br/>The current demonic dragon lineage had forced them into a desperate situation.<br/><br/>“Their strength is not something we can contend against. If they can open up our water dragon palace, we will not be their match.”<br/><br/>The Water Dragon Queen said with a solemn expression.<br/><br/>Everyone in the Dragon King Palace looked extremely ugly when they heard this.<br/><br/>Just as the Water Dragon Queen had said, the strength displayed by the demonic dragon lineage was not something they could contend against.<br/><br/>“Mother, we can ask brother Wang Xian and the people from the Dragon Palace for help. With the help of the Dragon Palace, we shouldn’t be afraid of them!”<br/><br/>Shui Linglong stood at the side and said angrily.<br/><br/>“The Dragon Palace?”<br/><br/>The Water Dragon Queen and the Water Dragon King looked at each other.<br/><br/>The Water Dragon Palace and the Dragon Palace had announced their alliance. However, this alliance was initiated by the Water Dragon Palace.<br/><br/>Now that the water dragon palace had encountered such a situation, they were embarrassed to look for the Dragon Palace again.<br/><br/>Would the Dragon Palace agree to them?<br/><br/>The two of them were not sure.<br/><br/>Their relationship with the Dragon Palace was not as good as they had imagined. Even their daughter had only known the Dragon King for a short time.<br/><br/>Would the Dragon Palace agree to help them in a war that could kill hundreds or thousands of knights?<br/><br/>“Hu!”<br/><br/>“Water Dragon Emperor, Dragon Queen, why don’t we ask for help from the Dragon Palace? Otherwise, we can only give up on the Water Dragon Palace.”<br/><br/>An old woman’s expression changed as she spoke from below.<br/><br/>“There’s only one way now. We just don’t know if we can hold them off with the Dragon Palace.”<br/><br/>An old man beside him said with a changed expression.<br/><br/>“Let’s try. Leader Shui Yin, take Linglong with you.”<br/><br/>The Water Dragon Queen pondered for a moment and said.<br/><br/>As she spoke, she waved her arm, and a water dragon pearl that contained terrifying energy and a bracelet that looked like a water pearl flew toward leader Shui Yin.<br/><br/>“These two acquired Supreme Treasures will be our gifts.”<br/><br/>The Water Dragon Queen said lightly.<br/><br/>The expressions of the leaders of the Water Dragon Palace changed slightly when they saw these two acquired treasures.<br/><br/>“Yes!”<br/><br/>Chief Shui Yin sighed helplessly, nodded, and looked at Shui Linglong. “Princess, let’s Go!”<br/><br/>“Okay!”<br/><br/>Shui Linglong nodded, and the two immediately flew out.<br/><br/>The atmosphere in the water dragon palace was unusually heavy.<br/><br/>…<br/><br/>“He doesn’t put the Water Dragon Palace and our Dragon Palace in his eyes at all!”<br/><br/>At the same time, in the Dragon Palace, Wang Xian’s eyes were sparkling when he saw the news.<br/><br/>Their Water Dragon Palace and the demonic dragon lineage had just announced their alliance, yet the other party had made such an announcement.<br/><br/>It was obvious that they didn’t put them in his eyes.<br/><br/>Perhaps, they thought that they could destroy the Dragon Palace easily.<br/><br/>“Is the Water Dragon Palace acting this way?”<br/><br/>He revealed a curious expression and shook his head.<br/><br/>He moved and entered the Divine Kingdoms of the universe knights and began to collect treasures.<br/><br/>As a universe knight, their divine kingdoms contained all their treasures.<br/><br/>There were all kinds of elixirs and godly herbs.<br/><br/>Wang Xian collected all the elixirs and godly herbs one by one.<br/><br/>“Eh, what is This?”<br/><br/>After searching for more than half an hour, Wang Xian suddenly found a mystical treasure in the treasure vault of a universe Knight’s divine kingdom.<br/><br/>It was an oil lamp. It looked very simple and unadorned.<br/><br/>The oil lamp did not seem to have any outstanding features. In fact, it was already extinguished. However, this oil lamp gave him a very mystical feeling.<br/><br/>The material of the oil lamp looked extraordinary. There were ancient oil colors carved on it.<br/><br/>There were shields, city walls, and giants.<br/><br/>“This lamp seems to be extinguished. There is no energy left in it.”<br/><br/>Wang Xian mumbled. He felt that this treasure was extraordinary and immediately kept it.<br/><br/>After checking the resources in his hands, a smile appeared on his face. He moved his body and immediately flew into the Dragon King’s palace.<br/><br/>The resources in his hands were sufficient for him to improve.<br/><br/>“Roar Roar!”<br/><br/>With a low roar, he transformed into the body of a divine dragon. Wang Xian’s dragon claws moved slightly and a large amount of resources entered his mouth.<br/><br/>“Boom Boom Boom!”<br/><br/>Waves of terrifying aura spread out from Wang Xian’s body.<br/><br/>When Wang Xian was improving, there were also many members of the Dragon Palace who were breaking through in the dragon transformation pool.<br/><br/>In the various Cosmos God countries, the devouring dragons began to devour.<br/><br/>Time passed by slowly.<br/><br/>“Hong!”<br/><br/>A day later, in the Dragon King Palace, an extremely vast energy spread to the surroundings.<br/><br/>“Ding, congratulations to host for increasing your level. You have broken through to the ninth change of the Divine Dragon Realm, the realm of a level one universe Knight!”<br/><br/>“Ding, congratulations to host for increasing your level. You have comprehended the law form: eight Dragon Pillars!”<br/><br/>Name: Wang Xian<br/><br/>Race: Yin-yang Five Elements Divine Dragon (man-dragon unity)<br/><br/>Level: Universe Knight Level 1(Divine Dragon Transformation 9th form)<br/><br/>Origin: 1% (99% needed for the next breakthrough)<br/><br/>Ability: ruling the water tribe (ruling the water tribe below one’s level)<br/><br/>Devouring creatures (devouring creatures to extract origin)<br/><br/>Control of the five elements<br/><br/>Technique: Divine Dragon Transformation<br/><br/>Ability: soul capture, spirit attachment<br/><br/>Law Divine Ability: Dragon Eye Lock, Five Elements Dragon Claw, Yin-yang realm-breaking, eight luminaries dragon scale, Sacred Dragon Shadow, Heavenly Dragon Eight Tribes, Dragon Tomb, Cloud Dragon Soaring, True Dragon body<br/><br/>Aspect: five elements great mill, Dragon Kingdom in the palm, Dragon Head under the heavens, Dragon Body of ten thousand miles, yin-yang two poles, Yin-yang Five Elements Bowl, divine dragon swinging tail!<br/><br/>Law aspect: eight dragon pillars<br/><br/>Control Law: metal, wood, water, fire, Earth, light, dark wind<br/><br/>Kingdom of God: Dragon Palace<br/><br/>Dragon Palace owned: acquired.<br/><br/>Dragon Palace members: 1134450<br/><br/>The system’s voice rang out. Information flashed across Wang Xian’s mind. He opened his dragon eyes and revealed an excited expression.<br/><br/>The nine transformations of the Divine Dragon. He had now arrived at the final transformation.<br/><br/>He had officially stepped into the realm of a universe knight.<br/><br/>After the nine transformations of the Divine Dragon were united, he would be in the realm of a universe master.\t\t\t\t\t\t</div>", "images": {}, "success": true}