{"id": 269, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15072439.html", "title": "Chapter 3260 - 3260 3259 Heaven Array Vs Fire Dragon Lord", "volume": 3, "volume_title": "Volume 3", "body": "<h1>Chapter 3260 - 3260 3259 Heaven Array Vs Fire Dragon Lord</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\t3260 3259 Heaven Array vs Fire Dragon Lord<br/><br/>“Wu Wu!”<br/><br/>Little Blue let out a low roar after devouring the ten vicious dragon heads and quickly digested the space beast in her body.<br/><br/>Kun was a creature that fed on powerful bloodlines. After devouring the Ten Vicious Dragon Heads, little blue could improve a lot.<br/><br/>“What?”<br/><br/>“The ten vicious dragon heads have been devoured?”<br/><br/>“What level is this terrifying beast that can devour the Ten Vicious Dragon Heads so quickly? !”<br/><br/>The Warriors from Fire Dragon Palace and Water Dragon Palace were all shocked by this scene.<br/><br/>The 10 of them were a very powerful space beast.<br/><br/>Back then, they were only universe knights at Level 4. Water Dragon Palace had to send three to four universe knights with level 4 strength to suppress them.<br/><br/>That was a pure-bred water god Dragon, Shui Linglong.<br/><br/>Now, the 10 ferocious dragons, who had already made a breakthrough, had been swallowed by the Terrifying Space Beast in the sky.<br/><br/>It was extremely terrifying!<br/><br/>“Damn it!”<br/><br/>Fire Dragon Master’s pupils constricted slightly when he saw this scene, and his face revealed an unsightly expression.<br/><br/>After Fire Dragon Palace had taken the space beast away from Water Dragon Palace, they had consumed a large amount of resources to allow it to make another breakthrough in its power.<br/><br/>But now, it was swallowed by a space beast.<br/><br/>“If You Swallow My Space Beast, I’ll suppress you!”<br/><br/>He growled and didn’t attack Water Dragon Emperor anymore. Instead, he attacked little blue.<br/><br/>“Be careful, Fire Dragon Emperor has the power of a Level 6 Knight!”<br/><br/>Water Dragon Emperor saw him attack little blue and shouted.<br/><br/>“What!”<br/><br/>Fire Dragon Master had the power of a level 6 knight, this was something they hadn’t expected.<br/><br/>With such power, how could he still submit to the Demon Dragon Bloodline?<br/><br/>“Everyone enter the Water Dragon Palace immediately, brothers of the Dragon Palace, enter the Water Dragon Palace!”<br/><br/>Water Dragon Emperor continued to roar loudly.<br/><br/>A Universe Knight Level 6, to them, was already undefeatable.<br/><br/>“Hahaha, killing our Fire Dragon Palace’s Space Beast, then today I’ll subdue you, no one can stop me.”<br/><br/>Fire Dragon Emperor heard water dragon emperor’s exclamation, his face revealed a sinister expression.<br/><br/>He didn’t pay attention to the surrounding people, his gaze locked onto little blue.<br/><br/>Little Blue’s strength had completely exceeded his expectations, but with his current strength, he could still subdue him.<br/><br/>After suppressing it, the losses of the ten heads could be completely compensated.<br/><br/>He could even obtain an even more powerful space beast.<br/><br/>“HMPH!”<br/><br/>In the void at the side, Tian Cheng stared at the Fire Dragon Lord, his eyes revealing a cold expression.<br/><br/>His palm moved slightly, and array formations attacked him.<br/><br/>“Scram!”<br/><br/>The Fire Dragon Lord felt the attack of Tian Cheng. His gaze turned cold, and he waved his dragon claws.<br/><br/>“Huh?”<br/><br/>However, he quickly focused his eyes and looked shocked.<br/><br/>Hong<br/><br/>The next moment, terrifying flames erupted from his body, and his dragon claws met the array again.<br/><br/>Peng<br/><br/>The terrifying sound of the collision made fire dragon master look serious.<br/><br/>“A universe knight level six great being? I didn’t Expect Your Dragon Palace to have such a great being.”<br/><br/>He roared in shock.<br/><br/>“Hehe, you, Fire Dragon Master, can even have the power of a universe knight level six, why can’t our Dragon Palace have a knight level six great being!”<br/><br/>Sky Array’s eyes revealed a mocking expression, and one array after another attacked him.<br/><br/>“Get lost, a dragon dares to compete with me!”<br/><br/>Fire Dragon Master roared coldly, and his body moved, directly attacking sky array.<br/><br/>“Hehe!”<br/><br/>The sky array smiled coldly, and the five elements energy behind him quickly revolved to form a powerful five elements millstone-like array.<br/><br/>This array was a five elements array that he had created based on the five elements millstone.<br/><br/>The terrifying Millstone attacked Fire Dragon Master directly.<br/><br/>“Peng, Peng, Peng!”<br/><br/>The terrifying collisions stopped fire dragon master from advancing further, and his face slowly darkened.<br/><br/>“There’s actually a universe Knight Level 6 great being in Dragon Palace!”<br/><br/>The Great Beings of water dragon palace were pleasantly surprised when they saw this scene.<br/><br/>Fire Dragon Master’s power made them feel fear and despair, but it was a surprise that Dragon Palace had a universe Knight Level 6 great being.<br/><br/>With A Level 6 great being, he could fight fire dragon master.<br/><br/>“It seems that I have to be serious.”<br/><br/>The Fire Dragon Lord’s eyes were filled with a dense killing intent. He raised his head, and a fire dragon pearl floated in the air.<br/><br/>“Roar!”<br/><br/>“True Dragon’s Fire!”<br/><br/>He roared, and his entire body was covered in terrifying flames.<br/><br/>The Flames covered an area of a few hundred kilometers.<br/><br/>Under the cover of the flames, his body seemed to have reached a few hundred kilometers in size, comparable to Little Blue’s body.<br/><br/>In the sky, the Dragon Pearl was like the scarlet sun, exuding a temperature of extreme yang.<br/><br/>One after another, Phantoms slowly appeared. The entire sky seemed to be the domain of the Fire Dragon God.<br/><br/>“Boom!”<br/><br/>Tens of thousands of flames surged wildly toward the sky formation.<br/><br/>“Reversal of the five elements formation, water domain!”<br/><br/>Seeing this terrifying attack, the sky formation’s pupils constricted slightly, and it immediately shouted.<br/><br/>“Hualala!”<br/><br/>The five elements Millstone reversed and turned into seawater that descended from the sky and directly surged towards Fire Dragon Lord.<br/><br/>“Hong Hong!”<br/><br/>A terrifying collision sound rang out.<br/><br/>“Hou Hou!”<br/><br/>Fire Dragon Lord let out a wild roar and his body directly rushed forward. The seawater disappeared bit by bit under the flames.<br/><br/>“Hou Hou!”<br/><br/>Sky Formation also let out a low roar. His entire body underwent a transformation. He had a dragon tail and a nine-colored light enveloped his body.<br/><br/>It looked holy and strange.<br/><br/>“Mobilize, wind, fire, thunder, and lightning, Attack!”<br/><br/>He let out a low growl, and one array after another attacked in front of him.<br/><br/>“Attack!”<br/><br/>In front of him, Fire Dragon Master let out a furious roar, and the illusory images of the flaming godly dragons above him charged toward sky array.<br/><br/>Hong, Hong, Hong<br/><br/>The sounds of collision rang out once again.<br/><br/>However, this time, the illusory images of the flaming godly dragons were quickly defeated.<br/><br/>The sky array was now powerful enough to fight against three universe knights at level six.<br/><br/>Fire Dragon Master was a pure-blooded godly dragon, and he had a dragon pearl at the level of a acquired true treasure. His power was far beyond that of an ordinary universe knight at level six.<br/><br/>However, Fire Dragon Master was only as powerful as two universe knights, and it would be difficult for him to fight against three.<br/><br/>Acquired true treasures were very powerful. If a universe knight was at level one, level two, or even level three, he could fight against someone of a higher level.<br/><br/>However, the higher the level, the more difficult it would be to fight against someone of a higher level with acquired true treasures.<br/><br/>At this level, one would need to be at the level of a spirit treasure to fight against someone of a higher level with a treasure.<br/><br/>Or, one might have four or five acquired true treasures in their hands.<br/><br/>“Palm Wind, Palm Rain, Palm Lightning, three great formations, descend!”<br/><br/>The three corresponding light rays of the wind, water, and thunder element on the body of the heaven formation emitted light rays, and one formation after another covered fire dragon master.<br/><br/>“What a strange fellow. He is definitely not an ordinary dragon. He might be a peak race of the divine dragon lineage.”<br/><br/>Fire Dragon Master looked extremely embarrassed when he saw the powerful formations.\t\t\t\t\t\t</div>", "images": {}, "success": true}