{"id": 268, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15072437.html", "title": "Chapter 3259 - 3259 3,258 Little Blue Vs 10 Ferocious Dragons", "volume": 3, "volume_title": "Volume 3", "body": "<h1>Chapter 3259 - 3259 3,258 Little Blue Vs 10 Ferocious Dragons</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\t3259 3,258 little blue VS 10 ferocious dragons<br/><br/>“All Disciples of the Dragon Palace, get ready for battle!”<br/><br/>On Little Blue’s body, sky array looked ahead and ordered.<br/><br/>In front of the Water Dragon Palace, Water Dragon Emperor led a group of warriors to confront the Warriors of the Fire Dragon Palace and the Red Gold Battle Dragon.<br/><br/>A war could break out at any time.<br/><br/>Sky Array looked over, his eyes revealing a cold expression.<br/><br/>Now that his power had broken through, he could even fight against a universe Knight Level 6 great being from the Devil Dragon Bloodline.<br/><br/>“Kill! Kill them all!”<br/><br/>Water Dragon Palace looked not far away, and his eyes were filled with excitement.<br/><br/>He locked his eyes on fire dragon master, and with a move, the Water Dragon Pearl released a terrifying pressure and directly attacked Fire Dragon Master.<br/><br/>“Kill, Kill, Kill!”<br/><br/>The experts of the Water Dragon Palace roared and attacked the experts of the Fire Dragon Palace.<br/><br/>“Hehe, I can kill you even without the demon Dragon Emperor.”<br/><br/>The Fire Dragon Lord looked at the Water Dragon King with disdain.<br/><br/>He moved and met the Water Dragon King.<br/><br/>“I’ll give you ten days to submit. If you don’t know what’s good for you, I’ll kill you today. Don’t wait for ten days!”<br/><br/>“Roar Roar Roar!”<br/><br/>The Fire Dragon Lord roared and his claws released terrifying flames as he directly met the Water Dragon King.<br/><br/>“HMPH!”<br/><br/>The Water Dragon King’s eyes were extremely cold as the Water Dragon Pearl entered his body one after another.<br/><br/>“Roar!”<br/><br/>An extremely terrifying water flow condensed into a water dragon and attacked the Fire Dragon Lord.<br/><br/>The surrounding experts of the Water Dragon Palace roared with killing intent as they charged forward.<br/><br/>“Attack and support the Water Dragon Palace!”<br/><br/>The sky array immediately shouted from Little Blue’s body.<br/><br/>“SWOOSH SWOOSH SWOOSH!”<br/><br/>This time, the people who followed the sky array were all elites of the Dragon Palace.<br/><br/>Mad Dragon, Arrow Dragon, Heavenly Lightning, Earth Fire Dragon, Phoenix, charming dragon, and so on.<br/><br/>The two thousand core experts of the Dragon Palace instantly flew toward the battlefield.<br/><br/>“Hahaha, we didn’t kill you. How dare you join us? I’ll kill all of you today!”<br/><br/>The Fire Dragon Lord waved his dragon claw to block the Water Dragon King’s attack.<br/><br/>At the same time, he looked up at the experts of the Dragon Palace, his eyes full of mockery, as if he didn’t care about the Water Dragon King at all.<br/><br/>“You’re courting death!”<br/><br/>Seeing that the fire dragon lord was distracted while fighting with him, the Water Dragon King’s eyes were full of killing intent. Streams of water turned into terrifying dragon scales and attacked him directly.<br/><br/>“Die!”<br/><br/>When the Fire Dragon King sensed the Water Dragon King’s attack, a fierce look appeared in his eyes. His body moved and he directly rushed towards the Water Dragon King.<br/><br/>“Boom Boom Boom!”<br/><br/>“Fire Claw, cover the Sky!”<br/><br/>The water dragon formed by the water streams was easily broken by the Fire Dragon King. He stretched out his Dragon Claw and roared.<br/><br/>An incomparably huge fire dragon claw directly attacked the Water Dragon King.<br/><br/>“What!”<br/><br/>Water Dragon Emperor saw that his attack was easily broken and felt the terrifying fire dragon claw, his expression changed.<br/><br/>“Not good, this fire dragon Emperor’s power is weird!”<br/><br/>He raised his Water Dragon Pearl and blocked the terrifying fire dragon claw.<br/><br/>“Peng!”<br/><br/>However, the Water Dragon Pearl that released a powerful water law was slapped down by the Dragon Claw, and the Fire Dragon Claw continued to attack Water Dragon Emperor.<br/><br/>“This fire Dragon Emperor’s power is definitely not only at level five universe knights!”<br/><br/>Water Dragon Emperor roared, his eyes wide open in disbelief.<br/><br/>How Could Fire Dragon Emperor’s power be at level six universe knights?<br/><br/>With such power, how could he still submit to the Devil Dragon lineage?<br/><br/>Water Dragon Emperor’s expression kept changing.<br/><br/>The reason why Water Dragon Palace dared to attack was because the devil dragon lineage was not around.<br/><br/>In their eyes, the Devil Dragon bloodline had given birth to a universe Knight Level 6 great being, but they had never expected fire dragon master to have such power.<br/><br/>Terrifying!<br/><br/>“Retreat, we have to retreat!”<br/><br/>Water Dragon Emperor roared in fear.<br/><br/>They couldn’t defend against a universe Knight Level 6 great being.<br/><br/>Peng<br/><br/>The terrifying dragon claws attacked, and a large amount of water shields appeared in front of Water Dragon Emperor to defend himself.<br/><br/>Sizzle! Sizzle! Sizzle<br/><br/>However, black wounds still appeared on his body.<br/><br/>These black wounds were burned by the flames, and they looked extremely terrifying.<br/><br/>With one move, water dragon emperor was heavily injured.<br/><br/>Within his body, a water type true treasure that looked like a clock was rotating, and it was quickly healing the injuries on his body.<br/><br/>“HM? Universe Knight Level 6 Battle Power?”<br/><br/>In the sky, sky array flew down from Little Blue’s body and sensed the battle on fire dragon master’s side. He was full of surprise.<br/><br/>The power that fire dragon master unleashed also shocked sky array.<br/><br/>Sou<br/><br/>He waved his hand quickly, and one array after another was formed.<br/><br/>Roar! Roar! Roar<br/><br/>On one side, Vicious Dragon ten heads, who had been hovering above water dragon palace, sensed the aura of little blue and the others.<br/><br/>They all stared at Xiao Lan, who was hundreds of times bigger than them, with shining eyes.<br/><br/>“Woo! Woo!”<br/><br/>Xiao Lan also noticed the ten heads of Hideous Dragon, a space beast, and his eyes slowly revealed an excited look.<br/><br/>He growled and directly attacked the ten heads of hideous dragon.<br/><br/>“Roar! Roar! Roar!”<br/><br/>The ten heads of the ten heads of hideous dragon let out a terrifying roar, and a huge mountain began to form on their bodies.<br/><br/>The mountain peak directly attacked Xiao Lan.<br/><br/>“Wu Wu!”<br/><br/>The grey energy on Xiao Lan’s body trembled. It did not dodge at all and directly charged towards the mountain peak.<br/><br/>The mountain peak was dozens of times bigger than Xiao Lan, but the terrifying mountain peak quickly crumbled when it landed on Xiao Lan’s body.<br/><br/>Xiao Lan slowly opened his incomparably terrifying mouth, as if he wanted to devour the entire void.<br/><br/>“Roar Roar!”<br/><br/>The ferocious dragon ten heads felt that little blue had easily defeated its attack, and a trace of fear and dread appeared in their eyes.<br/><br/>One by one, incomparably large earthen yellow sharp horns attacked little blue’s incomparably large mouth.<br/><br/>However, those earthen yellow sharp horns entered little blue’s bottomless mouth, not causing the slightest ripple.<br/><br/>Little Blue continued to devour it.<br/><br/>This caused the ferocious dragon ten heads’eyes to be filled with panic.<br/><br/>This space beast that looked like it had similar strength was too strange.<br/><br/>“Wu Wu!”<br/><br/>The ferocious dragon ten heads let out a low roar and immediately fled to the side.<br/><br/>“Weng Weng Weng!”<br/><br/>However, at this moment, terrifying black holes appeared in all directions around him. His body shook and he instantly disappeared into the black holes.<br/><br/>However, in the next moment, the exit of the black holes appeared in Little Blue’s mouth.<br/><br/>“Roar Roar Roar!”<br/><br/>When the ten ferocious dragon heads came out from the black holes, their eyes were filled with fear as they roared. The law energy on their bodies boiled up and they desperately attacked their surroundings.<br/><br/>“Buzz!”<br/><br/>However, at this moment, little blue slowly closed his mouth and began to digest.<br/><br/>The extremely powerful ten ferocious dragon heads became Little Blue’s food.<br/><br/>In the same realm, invincible!\t\t\t\t\t\t</div>", "images": {}, "success": true}