{"id": 260, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15072421.html", "title": "Chapter 3251 - 3251 The 3,250 Divine Dragons Had A Huge Change", "volume": 3, "volume_title": "Volume 3", "body": "<h1>Chapter 3251 - 3251 The 3,250 Divine Dragons Had A Huge Change</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\t3251 The 3,250 divine dragons had a huge change<br/><br/>“You’re courting death!”<br/><br/>On Xiao Lan’s body, chains penetrated the bodies of the two universe knights of the holy prose clan, severely injuring them.<br/><br/>“You… Let us go. We didn’t mean to offend you. We didn’t mean to offend you at all. Let Us Go!”<br/><br/>The two experts of the holy prose clan were shocked and their faces were full of cold sweat.<br/><br/>They shouted in horror.<br/><br/>“You brought this on yourself!”<br/><br/>Wang Xian extended his palm and a surge of energy surged into their bodies.<br/><br/>Prime Minister Gui had already given them a warning. If they dared to continue attacking, they would not be able to hold back.<br/><br/>Buzz<br/><br/>“Soul Catcher!”<br/><br/>Wang Xian’s eyes flashed with a strange luster, causing the two of them to tremble slightly.<br/><br/>“Summon Your Universe God Country!”<br/><br/>He shouted in a low voice and ordered.<br/><br/>“Yes! Yes!”<br/><br/>The two of them answered in confusion, and two God countries slowly appeared.<br/><br/>“Hahaha, these two guys are really good people, sending resources from billions of miles away!”<br/><br/>At the side, ao crab laughed loudly, and his face revealed an excited expression.<br/><br/>Two universe knight level five God countries were enough for him to make a breakthrough.<br/><br/>The two corpses could also increase the combat strength of two level 5 universe knights in the Dragon Palace.<br/><br/>“Holy prose clan.”<br/><br/>At this moment, Wang Xian opened his eyes, which were shining.<br/><br/>One of them was quite famous in the surrounding Lu Xing Kong.<br/><br/>Their clan elder had a level 6 universe knight power.<br/><br/>In the surrounding Lu Xing Kong, a power with a Level 6 universe knight was considered quite powerful.<br/><br/>A power with a Level 7 universe knight could consider logging in.<br/><br/>This holy prose clan wasn’t weak.<br/><br/>The two of them were also the core elders of the holy prose clan.<br/><br/>Wang Xian didn’t take them to heart.<br/><br/>Putting aside the fact that the other party didn’t know who killed them, so what if they did?<br/><br/>Soon, the Dragon Palace would receive a huge upgrade. By then, the Holy Prose Clan wouldn’t be afraid at all.<br/><br/>If they rushed over to take revenge, the Dragon Palace would dare to destroy them.<br/><br/>“Dragon King, there’s another big news from the divine dragon lineage in the surrounding Lu Xingkong!”<br/><br/>Before he could rush back to the Dragon Palace, Prime Minister Gui suddenly walked over and said with a hint of shock on his face.<br/><br/>“Huh? What’s Wrong?”<br/><br/>Wang Xian looked at him with a face full of curiosity.<br/><br/>“According to the news from Lu Xingkong’s Wisdom Brain Mountain, the Fire Dragon Palace and the Devil Dragon lineage are now invading the red gold war dragon lineage.”<br/><br/>“Furthermore, it seems that the red gold war dragon is no match for the two great divine dragons. They have already surrendered.”<br/><br/>Prime Minister GUI said with a slightly solemn expression.<br/><br/>The invasion of the Divine Fire Palace and the demonic dragon lineage was a huge shock to the divine dragon lineage.<br/><br/>To the entire surrounding starry sky, it was not a small matter.<br/><br/>“After destroying the divine wind and thunder dragon lineage and now defeating the red-gold War Dragon lineage, the Fire Dragon Palace and the demonic dragon lineage are not simple at all!”<br/><br/>Wang Xian frowned slightly.<br/><br/>Regardless of whether it was the bloodline of the divine wind and Thunder Dragon or the bloodline of the Red Gold War Dragon, they both had a powerful dragon palace.<br/><br/>With the protection of the powerful Dragon Palace, how could they be destroyed so easily.<br/><br/>There was only one explanation. The Fire Dragon Palace and the Devil Dragon Bloodline had a way to break through the powerful Dragon Palace.<br/><br/>“They might have wanted to destroy the water dragon palace in the beginning because their appearance changed their target.”<br/><br/>Wang Xian guessed in his heart.<br/><br/>As for the Fire Dragon Palace’s demonic dragon lineage, what were they going to do when they defeated the two divine dragon lineages in such a crazy manner?<br/><br/>Resources?<br/><br/>The huge amount of resources allowed them to improve rapidly?<br/><br/>That was the only explanation.<br/><br/>Furthermore, after absorbing the two divine dragon lineages, the Fire Dragon Palace and the demonic dragon lineage must have obtained a huge improvement.<br/><br/>“Dragon King, they have destroyed the forces of the divine dragon lineage one after another. I’m afraid that they might target us.”<br/><br/>Prime Minister Gui said from the side.<br/><br/>“It’s possible. However, we don’t have to be anxious. Even if they make a move, it might be to deal with the Water Dragon Palace first.”<br/><br/>Wang Xian said faintly.<br/><br/>Most importantly, the strongest known expert of the Fire Dragon Palace and the Devil Dragon lineage was only a level five universe knight.<br/><br/>With only the combat strength of a level five universe knight, even if they had acquired treasures, Wang Xian was not too worried.<br/><br/>Prime Minister Gui nodded. The resources that the Dragon Palace had obtained this time were not much of a problem for the sky array to have the combat strength of a level six universe knight.<br/><br/>Xiao Lan continued to move through the void. Wang Xian took out the universe AI and browsed through the information about the Fire Dragon Palace and the Devil Dragon lineage.<br/><br/>…<br/><br/>“Roar, Roar, Roar. At least all of you are tactful. Submit to US and avoid death.”<br/><br/>At the same time, in a golden ocean, golden seawater was flowing.<br/><br/>In the middle of the Golden Ocean, a stretch of darkness enveloped the center.<br/><br/>In the entire darkness, the phantom image of the Demon Dragons would fly in from time to time. It was hard to see clearly.<br/><br/>However, the darkness made everyone feel fear and fear.<br/><br/>Under the Golden Ocean covered by the darkness, there was a huge Golden Dragon Palace.<br/><br/>The entire Dragon Palace was shining with golden light.<br/><br/>However, at this moment, a huge fire dragon and the demon dragon were floating beside the dragon throne in the Dragon King’s palace.<br/><br/>In front of them, a group of red-gold battle dragons were crouching down.<br/><br/>In the middle, there was a huge dragon head that was dripping with blood.<br/><br/>It was the head of the red-gold Battle Dragon King, a descendant of the red-gold Battle Dragons.<br/><br/>Although the red-gold Dragon King was not a purebred dragon, he was a peak-level dragon.<br/><br/>But now, the dragon head was cut off.<br/><br/>“Go, bring all the resources in your red-gold Battle Dragon Palace over!”<br/><br/>The Fire Dragon Lord’s eyes flickered with excitement and excitement as he ordered a red gold war dragon expert below.<br/><br/>“Yes, Yes, it’s Your Highness!”<br/><br/>The Red Gold War dragon expert immediately replied and walked towards the back.<br/><br/>Soon, large amounts of dragon blood grass and various resources were transported over.<br/><br/>The Fire Dragon Lord’s eyes stared at those resources, filled with excitement and excitement!<br/><br/>“Hahaha, I want half of the resources, the rest belongs to you, Devil Dragon King.”<br/><br/>The Fire Dragon Lord shouted, he waved his arm to take half of the resources and immediately flew forward.<br/><br/>The Fire Dragon Palace’s high-level dragon species, fire cloud dragon eagle, followed him and flew toward the Scarlet Gold Battle Dragon.<br/><br/>“Hahaha, you guys guard the surroundings!”<br/><br/>The Fire Dragon Lord came to a place and waved his arm to set up a restriction.<br/><br/>He stared at the resources in front of him and trembled slightly.<br/><br/>“Soon, I will become the king of the Lu Xingkong Divine Dragon Bloodline!”<br/><br/>The Fire Dragon Lord roared in a low voice, his eyes shining with a fiery light.<br/><br/>“The fire dragon lord is so excited and anxious. It seems that he is going to break through.”<br/><br/>A faint voice sounded in the dark sky that covered the entire Red Gold War Dragon Palace.<br/><br/>“Yes, father, are you…”<br/><br/>The Demon Dragon King who was in the Dragon King’s palace just now stood respectfully in front of a shadow.\t\t\t\t\t\t</div>", "images": {}, "success": true}