{"id": 266, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15072433.html", "title": "Chapter 3257 - 3257 3256 Shengwen Clan Intervened", "volume": 3, "volume_title": "Volume 3", "body": "<h1>Chapter 3257 - 3257 3256 Shengwen Clan Intervened</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\t3257 3256 Shengwen clan intervened<br/><br/>Buzz<br/><br/>Inside the Dragon Palace, Wang Xian was controlling the five elements grinding mill to absorb the two acquired treasures of water attribute.<br/><br/>He opened the AI and checked the current situation of the Water Dragon Palace.<br/><br/>“HMM?”<br/><br/>When he saw some videos and pictures on the AI, he raised his eyebrows slightly.<br/><br/>In the videos and pictures, three huge dragon palaces were flying in the void.<br/><br/>Each dragon palace was giving off a terrifying power.<br/><br/>The Golden Dragon Palace was giving off Golden Light, and the Lightning Dragon Palace was giving off terrifying lightning.<br/><br/>There was also a fire dragon palace that was giving off terrifying flames.<br/><br/>The three terrifying dragon palaces caused a huge commotion as they flew through the starry sky.<br/><br/>These three dragon palaces had invincible defenses against all the forces surrounding the starry sky.<br/><br/>No one could break through the defenses of the three dragon palaces.<br/><br/>However, the three dragon palaces were flying toward the Water Dragon Palace.<br/><br/>The three dragon palaces, together with the Demon Dragon Dark World that was essentially the Dragon Palace, had four dragon palaces.<br/><br/>If the four dragon palaces headed toward the Water Dragon Palace, they would completely suppress the Water Dragon Palace!<br/><br/>“They sent four dragon palaces before the ten-day limit of the demon dragon bloodline arrives. Are they going to destroy the water dragon palace as soon as the limit is up?”<br/><br/>“This is too terrifying. Four Dragon Palaces, each of which is extremely terrifying. If four dragon palaces suppress the water dragon palace, they might be able to break the defense of the Water Dragon Palace.”<br/><br/>“It’s highly possible. The power of the Devil Dragon bloodline is too terrifying right now. If they were to be placed on our side, other than the two level 7 universe knights, they would be invincible, right?”<br/><br/>The group of dragon palaces flew towards the location of the Water Dragon Palace, attracting the discussion of countless powerhouses.<br/><br/>The strength displayed by the demonic dragon lineage was almost invincible in the surrounding Lu Xing Kong.<br/><br/>“The four great dragon palaces are suppressing one water dragon palace. Perhaps they can really break through the defense of the Water Dragon Palace.”<br/><br/>Wang Xian looked at the information on the AI, his eyes shining.<br/><br/>He looked at the pictures of the dragon palaces one by one, and his heart was burning with passion.<br/><br/>However, it was too difficult to obtain this dragon palace.<br/><br/>Unless all of them came out, Wang Xian would be able to kill all the people who controlled the Dragon Palace.<br/><br/>Otherwise, they would basically be invincible when they entered the palace.<br/><br/>However, there was another possibility. It was that an Lie’s strength would be greatly enhanced.<br/><br/>He would be able to reach the level of a universe knight at level five or six.<br/><br/>If he could reach such a level, even if the Fire Dragon Lord and the rest were in his fire Dragon Palace, an lie would be able to use his terrifying teleportation power to assassinate them.<br/><br/>“I wonder how is an Lie’s current situation.”<br/><br/>Wang Xian mumbled as he waited for an Lie’s return.<br/><br/>…<br/><br/>“The Fire Dragon Palace has already arrived at our water dragon continent. HMPH, they are just a bunch of D * mned B * stards. They only know how to bully us.”<br/><br/>At the same time, Shui Linglong, who was on Xiao Lan’s body, had been paying attention to the situation of the Water Dragon Palace.<br/><br/>Her face was full of anger when she saw the news.<br/><br/>“According to their speed, the demon Dragon Branch has already arrived at the Water Dragon Palace before we can go back.”<br/><br/>Chief Shui Yin said with a dark face from the side.<br/><br/>“However, the experts sent by the Dragon Palace to support us this time are very strong. Maybe we can get through this crisis.”<br/><br/>He glanced at the members of the Dragon Palace around him, and he was full of gratitude toward the Dragon Palace.<br/><br/>The 2,000 Great Beings of the Dragon Palace were all stronger than universe knights at Level One.<br/><br/>And the space beast beneath them was even more terrifying under his senses.<br/><br/>With his level five Knight Combat Power, unless he took out a acquired true treasure, he would have no choice but to run away if he encountered this space beast.<br/><br/>Little blue shuttled through the starry sky and quickly headed toward the Water Dragon Palace.<br/><br/>A huge space beast once again attracted the attention of many people.<br/><br/>Ten hours later, the news of a huge space beast flying around the starry sky spread in a small area on the AI.<br/><br/>The holy prose clan was a famous and powerful clan in the starry sky. When they heard the news from their subordinates, they immediately gathered together.<br/><br/>“We’ve discovered the traces of that space beast once again. The last time third elder and seventh elder died, it was related to that Space Beast. Moreover, there’s something very fishy about it.”<br/><br/>Within a large hall of the saint prose sect, dozens of middle-aged elders were sitting inside.<br/><br/>One of the elders looked at a space beast phantom in front of him and said in a deep voice.<br/><br/>“According to the latest news, someone found someone on top of that Space Beast. In other words, that space beast was subdued and suppressed by a faction.”<br/><br/>A middle-aged man on the other side said indifferently.<br/><br/>“The disciple we sent out to investigate already has a clear message that the space beast came from a place called the Starry River.”<br/><br/>At this time, an old man in the center looked at the latest report from his disciple and said.<br/><br/>Ever since the two universe Knight Level 5 Great Beings of the holy prose clan were killed, the holy prose clan had been investigating the cause of death of the two elders.<br/><br/>This time, the appearance of the space beast once again attracted the attention of the entire holy prose clan.<br/><br/>The holy prose clan had used almost all their power to investigate this space beast.<br/><br/>“Space of the galaxy? That galaxy should be where the Dragon Palace is, right? You said that the space beast is from the Dragon Palace?”<br/><br/>An old man holding a light staff frowned slightly and said.<br/><br/>“There’s an 80% chance, and according to the Space Beast’s route, he’s heading towards the Water Dragon Palace.”<br/><br/>The old man in the center confirmed.<br/><br/>“Water Dragon Palace?”<br/><br/>The surrounding people pondered. In terms of strength, they were stronger than the Water Dragon Palace.<br/><br/>Besides, the Water Dragon Palace was in danger of being destroyed.<br/><br/>The Water Dragon Palace and the Dragon Palace had formed an alliance, so the possibility of the space beast being the Dragon Palace was very high.<br/><br/>“According to the news, the strongest warrior of the Dragon Palace is also a Level 5 universe knight. If the space beast is really from the Dragon Palace, and the third elder and the seventh elder are dead, we will make the Dragon Palace pay the price in blood!”<br/><br/>The old man in the middle said coldly, his eyes full of killing intent.<br/><br/>“Hehe, now that the Water Dragon Palace and the Dragon Palace are being suppressed by the Devil Dragon Bloodline, if we can confirm it, I think we can report to the clan elder and ask him to lead us to completely destroy the Dragon Palace and avenge the third elder and the seventh Elder.”<br/><br/>“Maybe we can even suppress the Space Beast.”<br/><br/>The elder holding the light staff had a sinister and cunning look in his eyes.<br/><br/>Normally, with the terrifying defense of the Dragon Palace, they wouldn’t rashly become enemies with them.<br/><br/>But now, it was different. Looking at the current situation, the Devil Dragon bloodline wanted to destroy the Water Dragon Palace and even the Dragon Palace.<br/><br/>They could participate and gain some benefits.<br/><br/>The higher-ups of the holy prose clan looked at each other and smiled faintly.\t\t\t\t\t\t</div>", "images": {}, "success": true}