{"id": 265, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15072431.html", "title": "Chapter 3256 - 3256 3255 Under The Suppression Of The Four Dragon Palaces", "volume": 3, "volume_title": "Volume 3", "body": "<h1>Chapter 3256 - 3256 3255 Under The Suppression Of The Four Dragon Palaces</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\t3256 3255 under the suppression of the four dragon palaces<br/><br/>“I hope an lie can break through more.”<br/><br/>Wang Xian looked at the disappearing figure of an lie and muttered.<br/><br/>An lie had stayed at the third level of the void God realm for too long. If an lie could not break through, he would not be of much use in the future.<br/><br/>With the protection of the oil lamp, there should not be too much of a problem.<br/><br/>“Boom!”<br/><br/>At this moment, a powerful force came from the dragon transformation pool. Wang Xian looked over and revealed a smile.<br/><br/>The Sky Formation had broken through.<br/><br/>This time, they had killed a total of nine level five universe knights. With some resources, the strength of the sky formation had risen to the level of a level six universe knight.<br/><br/>Once the sky formation broke through, it could fight against three level six universe knights. Therefore, it was more suitable for him to break through first than adding ten level five universe knights to the Dragon Palace.<br/><br/>Wang Xian moved and arrived in front of the dragon transformation pool.<br/><br/>This time, the sky array was not the only one who broke through. There were more than 3,000 universe knights.<br/><br/>There was another group of members who were still improving.<br/><br/>“After this improvement, the number of universe knights in the Dragon Palace can reach more than 8,000.”<br/><br/>Wang Xian muttered.<br/><br/>8,000 universe knights was considered pretty good among the middle-level races in the universe.<br/><br/>However, there was still a gap between them and a high-level race in the universe.<br/><br/>To reach the level of a high-level race in the universe, there was a standard, which was the Combat Power of a universe knight.<br/><br/>A Universe Knight could form an army.<br/><br/>The Pinnacle Races in the universe were invincible because they had too many great beings.<br/><br/>For example, the angel race could mass-produce battle angels at the level of universe knights.<br/><br/>The number of their battle Angel Army could reach millions or even tens of millions.<br/><br/>That was how terrifying and invincible they were.<br/><br/>A battle Angel Army of tens of millions of universe knights, what kind of concept was that?<br/><br/>The foundation of a pinnacle race was unimaginable. They had all experienced one calamity after another in the universe, and one calamity was more than 30 billion years.<br/><br/>Besides having a long foundation, the second reason was that they controlled a large amount of resources in the heaven opening primal continent.<br/><br/>The strength of the peak races that had benefited from the endless ages in the universe was unimaginable.<br/><br/>From one point, one could see that just a little inheritance left by the Dragon King could create middle-level races and high-level races in the universe. One could imagine how powerful the peak races were.<br/><br/>Of course, there were also some extremely powerful high-level races in the universe.<br/><br/>The Dragon Palace was still far from reaching the peak.<br/><br/>In the next few days, the members of the Dragon Palace began to have a large number of breakthroughs.<br/><br/>“Dragon King, the leader of the water secret division of the Water Dragon Palace and the Princess of the Water Dragon Palace have come to seek an audience.”<br/><br/>On this day, Wang Xian, who was in the Dragon Palace, suddenly heard Prime Minister Gui’s report and was stunned.<br/><br/>Shui Linglong and the others from the Water Dragon Palace wanted to see him?<br/><br/>There was no prior notice.<br/><br/>A hint of surprise flashed across his eyes. Soon after, he guessed a problem.<br/><br/>“Invite them in!”<br/><br/>Wang Xian said.<br/><br/>“It’s the Dragon King!”<br/><br/>Prime Minister Gui nodded.<br/><br/>“Greetings, Dragon King!”<br/><br/>Soon, Shui Linglong, the leader of the water secret division of the Water Dragon Palace, walked in. She cupped her hands and bowed.<br/><br/>It was obvious that this was an official visit.<br/><br/>“Please take a seat.”<br/><br/>Wang Xian looked at Shui Linglong and the rest and gestured to them with a smile.<br/><br/>“Brother Wang Xian, we are here to visit under the name of the Water Dragon Palace. We have something important to ask the Dragon Palace for help.”<br/><br/>Shui Linglong sat down and said to Wang Xian.<br/><br/>“I know why you are here. I will send some subordinates to your place this time.”<br/><br/>Wang Xian said immediately.<br/><br/>“Oh? Thank you, Dragon King. Thank you, Dragon Palace, for being willing to lend a helping hand. We, the Water Dragon Palace, are extremely grateful.”<br/><br/>When the leader of the Hidden Water Tribe heard that, surprise and joy appeared in his eyes. He immediately stood up and thanked Wang Xian.<br/><br/>“This is a thank you gift from the Water Dragon Queen of the Water Dragon King to the Dragon King. Please accept it, Dragon King!”<br/><br/>As the leader of the Hidden Water Tribe spoke, he waved his arm and the two acquired treasures flew towards Wang Xian.<br/><br/>“Eh?”<br/><br/>Wang Xian sensed the two acquired treasures and was slightly shocked.<br/><br/>He hesitated for a moment before putting them away.<br/><br/>“Our Dragon Palace will advance and retreat together with the Water Dragon Palace.”<br/><br/>Wang Xian said with a smile.<br/><br/>“Thank you, Dragon King!”<br/><br/>The leader of the Hidden Water Tribe thanked him once again.<br/><br/>At this moment, the universal intelligence on him trembled.<br/><br/>Eh?<br/><br/>The leader of the Hidden Water Tribe took a glance and his pupils constricted slightly.<br/><br/>“Dragon King, we have to rush back immediately. The demonic dragon lineage is going to send four dragon palaces to suppress our Water Dragon Palace.”<br/><br/>His expression suddenly changed as he spoke to Wang Xian.<br/><br/>“Four dragon palaces are suppressing the Water Dragon Palace?”<br/><br/>Wang Xian narrowed his eyes slightly as his eyes sparkled.<br/><br/>“AH? They are going to seal us off now? Damn the demonic dragon lineage. Do they really think that we are easy to bully?”<br/><br/>Shui Linglong took out her artificial intelligence to take a look at the leader of the Shui Yin Division. Her face was filled with anger.<br/><br/>“Prime Minister Gui, get the Heaven Array to bring 2,000 elites of the Dragon Palace to the Water Dragon Palace.”<br/><br/>Wang Xian immediately ordered Prime Minister Gui who was beside him.<br/><br/>“It’s the Dragon King!”<br/><br/>Prime Minister Gui replied immediately.<br/><br/>“Linglong, don’t worry. I will send the powerhouses of the Dragon Palace over immediately. I will rush over as well.”<br/><br/>Wang Xian looked at Shui Linglong and comforted her.<br/><br/>“Thank you, brother Wang Xian!”<br/><br/>Shui Linglong thanked him.<br/><br/>“Get Xiao Lan to carry all of you. Speed Up.”<br/><br/>Soon, Tian Cheng led a group of powerhouses of the Dragon Palace over. Wang Xian gave them an order.<br/><br/>“It’s the Dragon King!”<br/><br/>Tian Cheng and the rest cupped their hands and flew up to the Dragon Palace immediately.<br/><br/>“Woo Woo!”<br/><br/>Xiao Lan, who was at the back, flew up to the sky and let out a low growl.<br/><br/>“A space beast, what a powerful Space Beast!”<br/><br/>The leader of the Shui Yin division was shocked when he saw Xiao Lan’s enormous body.<br/><br/>He felt a strong threat from Xiao Lan’s body.<br/><br/>“Go.”<br/><br/>Wang Xian came to Shui Linglong and patted her back.<br/><br/>“Thank you, brother Wang Xian!”<br/><br/>Shui Linglong looked at him gratefully and flew towards Xiao Lan.<br/><br/>Wang Xian didn’t follow her because Xiao Lan and the rest would need two days to get there.<br/><br/>By then, if he wanted to get there himself, he only needed to ask Tian Chen and the rest to draw an altar. An lie would be able to teleport him there instantly.<br/><br/>Furthermore, Wang Xian might not have to do it himself in this battle.<br/><br/>Sky Array’s strength had already broken through to level-six universe knight. He could definitely fight against them.<br/><br/>With the situation of the Water Dragon Palace, it wouldn’t be a problem with the support of the Dragon Palace.<br/><br/>“This water dragon palace is really generous. They gifted me two acquired treasures directly.”<br/><br/>Wang Xian moved his palm and looked at the two acquired treasures in his hand. He smiled.<br/><br/>Coincidentally, after these two acquired treasures were devoured by the five elements grinding, they would be able to receive another upgrade.<br/><br/>However, this upgrade would probably only increase his combat strength to a Level 6 universe knight.\t\t\t\t\t\t</div>", "images": {}, "success": true}